[{"id":2405024006,"title":"Content Engineer, Developer Documentation","company":"Livekit","image":"https://avatars.githubusercontent.com/u/69438833?s=200&v=4","description":"<p style=\"min-height:1.5em\">LiveKit is revolutionizing the AI landscape by providing the essential network infrastructure that powers multimodal AI interfaces, enabling seamless audio and visual interactions. Founded in 2021, LiveKit has rapidly grown to support over 3 Billion calls annually, 100,000+ developers globally, and industry giants like OpenAI, Character AI, Spotify, and Meta.</p><h3></h3><h2><strong>You'll thrive at LiveKit if you:</strong></h2><ul style=\"min-height:1.5em\"><li><p style=\"min-height:1.5em\">obsessed with making the best product for our customers.</p></li><li><p style=\"min-height:1.5em\">are known as the go-to person for tackling tough problems</p></li><li><p style=\"min-height:1.5em\">work hard and can build <em>and</em> ship fast</p></li><li><p style=\"min-height:1.5em\">focused on polish, detail and quality</p></li><li><p style=\"min-height:1.5em\">are a fast learner, frequently picking up new tips, tricks, and skills.</p></li></ul><p style=\"min-height:1.5em\"></p><h2>About This Role:</h2><p style=\"min-height:1.5em\">LiveKit is building the modern, open platform for real-time audio and video. Developers use our SDKs and APIs to add interactive video, voice, and live media features into their apps. We're used in healthcare, fitness, virtual events, customer support, gaming, and more — anywhere people collaborate or connect live online.</p><p style=\"min-height:1.5em\">We’re looking for a <strong>Content Engineer</strong> with a deep understanding of software development who is passionate about helping developers succeed through great documentation and learning resources. This is not just a technical writing role — you’ll be writing real code, testing SDKs, and directly improving our documentation site alongside our engineering team.</p><p style=\"min-height:1.5em\"></p><h2>What you'll do</h2><ul style=\"min-height:1.5em\"><li><p style=\"min-height:1.5em\"><strong>Author and maintain high-quality developer documentation</strong>, including tutorials, SDK guides, and API references that serve both novice and advanced developers.</p></li><li><p style=\"min-height:1.5em\"><strong>Write and run code</strong> — test LiveKit’s SDKs and APIs (JavaScript, Swift, Kotlin, etc.) to create working examples and verify correctness of documentation.</p></li><li><p style=\"min-height:1.5em\"><strong>Extend our documentation infrastructure</strong>, improving the site UX, build pipeline, search-ability, or layout to make the docs more useful and maintainable.</p></li><li><p style=\"min-height:1.5em\"><strong>Improve and maintain written content across our open source repos</strong>, including READMEs, examples, and package documentation to ensure clarity and consistency.</p></li><li><p style=\"min-height:1.5em\"><strong>Collaborate closely with engineering and product</strong> to understand new features and help launch them with strong supporting materials.</p></li><li><p style=\"min-height:1.5em\"><strong>Own content quality</strong> by identifying and fixing inconsistencies, outdated references, or unclear explanations.</p></li><li><p style=\"min-height:1.5em\">Help <strong>shape the future</strong> of our learning content by proposing new formats, interactive examples, or educational tools to better serve the LiveKit developer community.</p></li></ul><p style=\"min-height:1.5em\"></p><h2>You might be a good fit if you</h2><ul style=\"min-height:1.5em\"><li><p style=\"min-height:1.5em\">Have <strong>strong writing skills</strong> and a knack for explaining complex technical topics clearly and concisely.</p></li><li><p style=\"min-height:1.5em\">Are a <strong>practicing developer</strong> — comfortable working in multiple programming languages and familiar with web application development.</p></li><li><p style=\"min-height:1.5em\">Have experience with or interest in <strong>real-time communication, video streaming, or multimedia APIs</strong>.</p></li><li><p style=\"min-height:1.5em\">Have contributed to or maintained <strong>technical documentation</strong>, developer blogs, or tutorial content in a professional or open-source setting.</p></li></ul><h3>Bonus points if you</h3><ul style=\"min-height:1.5em\"><li><p style=\"min-height:1.5em\">Have built or contributed to documentation tooling or developer portals.</p></li><li><p style=\"min-height:1.5em\">Have a portfolio of writing samples, such as published tutorials, API guides, or technical blog posts.</p></li></ul><p style=\"min-height:1.5em\"></p><h2><strong>Our Commitments to You</strong></h2><h3><strong>We offer</strong></h3><ul style=\"min-height:1.5em\"><li><p style=\"min-height:1.5em\">An opportunity to build something truly impactful to the world</p></li><li><p style=\"min-height:1.5em\">Contribute to open source alongside world-class engineers</p></li><li><p style=\"min-height:1.5em\">Competitive salary and equity package</p></li><li><p style=\"min-height:1.5em\">Health, dental, and vision benefits</p></li><li><p style=\"min-height:1.5em\">Flexible vacation policy</p></li></ul>","tags":"[\"javascript\",\"swift\",\"kotlin\"]","pubDate":"2025-06-07T16:48:22.455Z","link":"https://jobs.ashbyhq.com/livekit/8f69ef7c-2c98-46ba-ad66-6ed13670458d","slug":"content-engineer-developer-documentation-livekit-2194"}]