[{"id":4469279849,"title":"Customer Success Manager","company":"Instrumentl","image":"https://pbs.twimg.com/profile_images/1263546899153502209/ObHsQoNr_400x400.jpg","description":"<div class=\"section page-centered\" data-qa=\"job-description\"><div>Instrumentl is growing! We’re hiring a <b>Customer Success Manager</b>&nbsp;<b>(CSM)</b> to help our customers (nonprofits and grant writers) achieve their goals while using our platform. If you are motivated by customer happiness and excited to join a mission-driven company, then this role is made for you. </div><div><br></div><div><b style=\"font-size: 18px\">About us:</b></div><div><br></div><div><a href=\"https://www.instrumentl.com/\" class=\"postings-link\">Instrumentl</a> (YC S16) is the best platform for nonprofits and grant writing consultants looking to grow revenue. We help over 3,000 organizations to manage their institutional fundraising and win more grants by bringing discovery, tracking, and grant management to one place.&nbsp;</div><div><br></div><div>Our mission is to be a force multiplier on the nonprofit sector’s ability to drive impact. We’re profitable and doubling year-over-year, with strong product-market fit (NPS is 60+).</div><div><br></div><div><b style=\"font-size: 18px\">About the role:</b></div><div><br></div><div>In your&nbsp;first year&nbsp;as a Customer Success Manager, you will help expand our company’s reach by scaling our CS efforts. You'll be an advocate for our customers at every stage of the journey, from onboarding to driving new engagement, gathering product feedback, and ensuring renewals. </div><div><br></div><div>Our ideal candidate is proactive, eager to learn, willing to experiment, and excited to collaborate with multiple teams to enhance the customer experience at Instrumentl.</div><div><br></div><div>You'll be the <b>7th</b> member of the CS team, reporting directly to Tracie, our Customer Success Lead. You'll also work closely with:</div><div><br></div><div>- Amélie, CSM</div><div>- Eric, Customer Support Associate </div><div>- Ketaki, CSM</div><div>- Rebecca, Customer Education Manager</div><div>- Will, Head of Growth &amp; Customer Success</div><div><br></div><div>Get to know us at <a href=\"https://www.instrumentl.com/about\" class=\"postings-link\">instrumentl.com/about</a>!</div><div><br></div><div>Instrumentl is fully distributed <b>(read: no office!)</b>. For this position, we are looking for someone based in the continental US, but open to those flexible to Eastern or Central Time standard working hours as well.</div></div><div class=\"section page-centered\"><div><h3>What you'll get to do:</h3><ul class=\"posting-requirements plain-list\"><ul><li>Build and foster relationships with Instrumentl’s customers to help them realize value and accomplish their organizational goals</li><li>Take on primary ownership of post-sale onboarding, engagement, retention, and expansion of customer accounts within your portfolio&nbsp;</li><li>Meet and exceed customer satisfaction, adoption, renewal, and expansion targets</li><li>Provide additional value to customers via 1-to-many delivery models, sharing product and best practice guidance, and conducting periodic business reviews</li><li>Contribute to the Instrumentl Knowledge Base by authoring and updating resources such as KB articles, guides, community FAQs, product documentation, etc.</li><li>Be the voice of customers across the company, especially when collaborating with product and other revenue teams</li></ul></ul></div></div><div class=\"section page-centered\"><div><h3>What we're looking for:</h3><ul class=\"posting-requirements plain-list\"><ul><li><b>3+ years of work experience: </b>ideally, you’ve held a Customer Success or Account Management role in a SaaS environment, managing 300+ accounts. A background in nonprofit development or fundraising is a plus!</li><li><b>Customer education and onboarding:</b> you are able to manage customer onboarding processes that combine human interaction and self-service tools.</li><li><b>Community engagement and program design:</b> you are able to conceptualize, build, and lead creative customer engagement efforts that turn users into vocal advocates.</li><li><b>Communication:</b> you pride yourself on your ability to communicate complex topics easily over video and in writing.</li><li><b>Empathy: </b>you are warm and approachable in your interactions with others, and genuinely interested in fostering collaborative relationships with colleagues and customers.</li><li><b>Adaptability: </b>you thrive in fast-paced environments, and feel comfortable handling ambiguity and change. Experience in an early-stage startup environment is a plus!</li><li><b>Ownership: </b>you have a proactive approach to process improvement and the confidence to execute on new ideas.</li><li><b>Tech savviness: </b>you're familiar with tools like G Suite, Zoom, Slack, Intercom and Canva. You love shortcuts and can name your favorites off the top of your head.</li><li><b>Growth mindset: </b>you exhibit a growth mindset every day and take feedback in stride.</li><li><b>Passion: </b>you're excited about Instrumentl's mission and eager to support the work done by the nonprofit community!</li><div><br></div><li><b>Bonus: </b>experience working with nonprofit or SMB customers.</li><li><b>Bonus: </b>experience working remotely.</li></ul></ul></div></div><div class=\"section page-centered\"><div><h3>Compensation and Benefits:</h3><ul class=\"posting-requirements plain-list\"><ul><li>Competitive salary ($75,000-$100,000/year OTE), depending on experience&nbsp;</li><li>100% covered health, dental, and vision insurance for employees, 50% for dependents</li><li>Generous PTO policy, including parental leave</li><li>401(k)</li><li>Company laptop + stipend to set up your home workstation</li><li>Work with awesome nonprofits around the US. We partner with incredible organizations doing meaningful work, and you get to help power their success.</li></ul></ul></div></div><!--[2022-11-28] [GOLD-2535] Remove payTransparencyV1 when feature flag is fully removed--><div class=\"section page-centered\" data-qa=\"closing-description\"><div><b style=\"font-size: 18px\">What to expect: </b></div><div><br></div><div>Instrumentl is evolving rapidly. You’ll always have new challenges and opportunities to grow in your role - you won’t be bored! You’ll be an early member of our small but mighty team, playing a huge part in shaping our culture for the years and teammates to come.</div><div><br></div><div><b>At Instrumentl:</b></div><div><br></div><div>- <b>We’re customer-focused. </b>We routinely seek feedback from our customers to improve the Instrumentl experience for everyone. Our first company value is \"The customer is the hero\" and we mean it.&nbsp;</div><div>- <b>We love to experiment.</b> We are constantly generating new concepts and iterating to see what works - ideation and experimentation are essential here. \"Bend the curve\" is another key company value.</div><div>- <b>We appreciate authenticity.</b> We have a diverse range of life experiences, and we encourage open, clear communication with each other about the things that matter most to us.</div><div>- <b>We’re approachable and collaborative.</b> Everyone has a voice, and we’re all building Instrumentl together.</div><div>- <b>We kick it every day with some of the nicest people in the world.</b> No joke, our customers are often on the front lines educating kids, saving endangered species, and restoring watersheds. In helping them take advantage of Instrumentl’s technology, you’re helping them move the world forward.</div><div><br></div><div><b style=\"font-size: 18px\">Ready to apply?</b></div><div><br></div><div>Please submit either a written response or a link to a short Loom video, addressing the prompts below:</div><div><br></div><div><b>1.</b>&nbsp;<b>What is the largest book of business you have managed in previous roles?</b> We are interested in the number of customers you’ve worked with simultaneously.</div><div><b>2. What is the most creative 1-to-many customer success campaign you’ve worked on? </b>What role did you play, and what was the outcome?&nbsp;</div><div><br></div><div>Don't forget to include the word <b>moxie </b>in your application to show you read this from start to finish! Along with your written response or Loom video, please attach your CV or resume.</div><div><br></div><div><i>At Instrumentl, we pride ourselves on building a diverse team from the ground up. Every role is an opportunity to teach, learn, and create some of your best work - if you’re excited to grow along with us, we encourage you to apply!</i></div></div><div class=\"section page-centered last-section-apply\" data-qa=\"btn-apply-bottom\"><a class=\"postings-btn template-btn-submit hex-color\" data-qa=\"show-page-apply\" href=\"https://jobs.lever.co/Instrumentl/ed214a85-169f-4985-aad4-fb29f734ebd9/apply\">Apply for this job</a></div>","tags":"[\"management\"]","pubDate":"2023-12-17 03:34:30.599","link":"https://jobs.lever.co/Instrumentl/ed214a85-169f-4985-aad4-fb29f734ebd9","savedDate":"2023-12-17 03:34:30.599","slug":"customer-success-manager-instrumentl-9819"},{"id":7029168679,"title":"Content Review Associate","company":"Instrumentl","image":"https://pbs.twimg.com/profile_images/1263546899153502209/ObHsQoNr_400x400.jpg","description":"<div class=\"section page-centered\" data-qa=\"job-description\"><div><b style=\"font-size: 11pt\">Who We Are</b></div><div><span style=\"font-size: 11pt\">Instrumentl is a profitable, YC-backed startup with over 3,000 nonprofit clients, from local homeless shelters to larger organizations like the San Diego Zoo and the University of Alaska. We are building the future of fundraising automation, helping nonprofits to force multiply their impact with our streamlined grant management platform.</span></div><div><br></div><div><b style=\"font-size: 11pt\">Summary of Role</b></div><div><span style=\"font-size: 11pt\">At Instrumentl, the grants database is the lifeblood of our product and our customers rely on us to provide up-to-date and accurate funding information. As Content Review Associate, you will manage the team and procedures required to update our grants database quickly, efficiently, and accurately while constantly striving to exceed our clients’ expectations. This position will oversee a remote, part-time team responsible for reviewing changes to grant information and updating our database listings accordingly. The Content Review Associate will resolve higher tier review tasks daily and work to improve our current standards of accuracy and timeliness. We are fully distributed (read: no office!) and for this position, and we are looking for someone based within the EST to PST timezones.</span></div></div><div class=\"section page-centered\"><div><h3>Responsibilities</h3><ul class=\"posting-requirements plain-list\"><ul><li>Develop, track &amp; analyze database accuracy and team efficiency metrics</li><li>Work with the Content Operations Manager (Bonnie) to design &amp; implement new procedures to improve accuracy standards</li><li>Manage team of contractors responsible for the bulk of day-to-day manual review tasks</li><li>Resolve higher tier review work each day and respond to any elevated items from review contractors</li><li>Strategize with the Content team to determine and execute on annual and quarterly goals&nbsp;</li></ul></ul></div></div><div class=\"section page-centered\"><div><h3>Required Skills</h3><ul class=\"posting-requirements plain-list\"><ul><li>A ‘state of the art’ attention to detail - superhero-like ability to find the tiniest error, whether it be a typo, an inconsistency or a noncompliant formatting mistake</li><li>Ability to manage a diverse, international, team of contractors</li><li>Dedication and ability to optimize every piece of a process and catch any unwelcome dips in performance, efficiency, or accuracy</li><li>Tech-savvy &amp; a fast learner - able to pick up new tools or procedures quickly and effectively</li><li>Familiarity with the nonprofit sector, especially with grants</li><li>A passion for Instrumentl’s mission</li><li>Bonus: experience working in early-stage startups and being comfortable (even thriving!) with ambiguity</li></ul></ul></div></div><div class=\"section page-centered\"><div><h3>Compensation and Benefits</h3><ul class=\"posting-requirements plain-list\"><ul><li>Competitive salary, depending on experience</li><li>Health, dental, and vision insurance</li><li>Generous PTO policy, including parental leave</li><li>Company laptop + $500 to set up your home workstation</li><li>Work with awesome nonprofits around the US. At Instrumentl, we are lucky to kick it every day with some of the nicest people in the world, and we get to help power their success!</li></ul></ul></div></div><!--[2022-11-28] [GOLD-2535] Remove payTransparencyV1 when feature flag is fully removed--><div class=\"section page-centered\" data-qa=\"salary-range\"><div>$45,000 - $55,000 a year</div><small><div>Depending on experience.</div></small></div><div class=\"section page-centered last-section-apply\" data-qa=\"btn-apply-bottom\"><a class=\"postings-btn template-btn-submit hex-color\" data-qa=\"show-page-apply\" href=\"https://jobs.lever.co/Instrumentl/8f076e8e-3c4a-4074-8d75-718b5669845d/apply\">Apply for this job</a></div>","tags":"[\"management\",\"database\"]","pubDate":"2023-12-17 03:34:30.597","link":"https://jobs.lever.co/Instrumentl/8f076e8e-3c4a-4074-8d75-718b5669845d","savedDate":"2023-12-17 03:34:30.597","slug":"content-review-associate-instrumentl-9748"},{"id":3227980674,"title":"Rust Developer","company":"Nitka","image":"https://remotive.com/job/1863207/logo","description":"<p><strong>Nitka Technologies</strong>'s developing software for customers in the US and Europe and brings together about 300 professionals from Eastern Europe, North and South America, Armenia, Georgia and Kazakhstan.</p>\n<p>We are looking for an experienced<strong> Rust (CosmWasm) Blockchain Developer</strong> to work at DeFi blockchain project. We offer fresh technologies, interesting tasks, ambitious team. </p>\n<p><strong>Main task:</strong> Development of the Cosmos SDK based blockchain with a DeFi protocol on it.</p>\n<p><strong>Project is a startup with a work in the following areas:</strong></p>\n<ul style=\"\">\n<li style=\"\">Blockchain protocol development (Go)</li>\n<li style=\"\">Off-chain tools development (Go, Python, Typescript)</li>\n<li style=\"\">CosmWasm smart contracts development (Rust)</li>\n<li style=\"\">Web UI development (Typescript, React)</li>\n<li style=\"\">Infrastructure configuration (GCP, Terraform)</li>\n<li style=\"\">Monitoring tools development (Grafana, Prometheus)</li>\n</ul>\n<p><strong>What you could work on:</strong></p>\n<ul style=\"\">\n<li style=\"\">Integration support for partner protocols, wallets, custodians, exchanges and so on.</li>\n<li style=\"\">Produce high quality technical documentation e.g. API docs, cookbooks, code examples and tutorials</li>\n<li style=\"\">Engaging developers on discord channels for dev support</li>\n</ul>\n<p><strong>Skills required</strong>:</p>\n<ul style=\"\">\n<li style=\"\">Smart Contract Development experience in Rust, Cosm-Wasm</li>\n<li style=\"\">Familiar with Cosmos-SDK</li>\n<li style=\"\">Strong spoken and written English skills (Upper Intermediate level and more)</li>\n<li style=\"\">We are looking for a sociable, communicable, easy-going person</li>\n</ul>\n<p><strong>Working conditions:</strong></p>\n<ul style=\"\">\n<li style=\"\">Remote work</li>\n<li style=\"\">Full-time (8 hours/day)</li>\n<li style=\"\">Interaction with a team from the USA (а few times a week calls're in the evening, around 19:00 - 21:00 GTM+3 (morning on the US West Coast))</li>\n<li style=\"\">Flexible schedule without time trackers</li>\n<li style=\"\">Attractive USD compensation</li>\n<li style=\"\">Paid vacation, holidays</li>\n</ul>\n<p> </p><img src=\"https://remotive.com/job/track/1863207/blank.gif?source=public_api\" alt=\"\"/>","tags":"[\"api\",\"go\",\"python\",\"react\",\"UI/UX\",\"blockchain\",\"rust\",\"documentation\",\"wasm\",\"Typescript \",\"terraform\",\"GCP\",\"startup\",\"technical documentation\",\"infrastructure\",\"grafana\"]","pubDate":"2023-12-15 13:20:24.000","link":"https://remotive.com/remote-jobs/software-dev/rust-developer-1863207","savedDate":"2023-12-17 03:34:30.595","slug":"rust-developer-nitka-4850"},{"id":6418314157,"title":"Level 3 Technical Support Specialist - CentOS, EOL","company":"CloudLinux","image":"https://pbs.twimg.com/profile_images/696718028084482050/ymY3OEPk_400x400.png","description":"<p>We are looking for a seasoned Level 3/4 Technical Support Specialist with over 15 years of experience to provide advanced technical support for various Linux distributions, including CentOS, and other popular distros. This role demands extensive knowledge of Linux environments, particularly CentOS Extended Lifecycle Support (ELS) for versions 6, 7, and 8, across x86, x64, and ARM architectures. The ideal candidate must be adept in managing high and critical CVEs and comfortable in English language conference calls. This role will require some 24x7 “on call” support and weekends.</p><p></p><p>As our L3 Technical Support Engineer you will:</p><ul> <li>Offer expert-level technical support for CentOS and other Linux distributions, addressing complex issues across diverse versions and architectures.</li> <li>Lead the installation and configuration of Linux environments, ensuring optimal setup for various distributions.</li> <li>Evaluate alternative solutions for EOL Linux distributions, guiding clients towards the most suitable replacements.</li> <li>Manage release planning and testing for multiple Linux distributions, including CentOS.</li> <li>Provide scalability guidance for Linux-based systems, ensuring efficient growth and adaptation to increased demands.</li> <li>Implement upgrades and patches across various Linux distributions, maintaining system security and up-to-date functionality.</li> <li>Conduct CVE impact assessments for Linux environments, recommending appropriate mitigation strategies.</li> <li>Perform risk assessments for system migrations, focusing on potential challenges and solutions.</li> <li>Assist in integration and performance optimization for a range of Linux distributions.</li> <li>Guide clients on containerization strategies and Linux-specific best practices.</li> <li>Handle feature and functionality queries for Linux systems, clarifying capabilities and potential configurations.</li> </ul><p></p><p></p><h3>Requirements: </h3><p>To be successful you should have;</p><ul> <li>Bachelor's degree in Computer Science, Information Technology, or related field.</li> <li>At least 10 years of experience in technical support or system architecture, with a strong focus on Linux systems, including Fedora and Debian-based distributions.</li> <li>Comprehensive knowledge of Linux environments and architectures (x86, x64, ARM).</li> <li>Experience in managing high and critical CVEs within Linux systems.</li> <li>Some experience in backporting patches and updates for Linux distributions.</li> <li>Experience working with package manager and repositories</li> <li>Exceptional problem-solving, analytical, and technical skills.</li> <li>Excellent communication and customer service skills, proficient in English for conference calls and emails/documentation; native or fluent level.</li> <li>Open source software experience a plus</li> <li>Should be able to work some&nbsp; 24x7 “on call” support and weekends.&nbsp;</li> </ul><h3>Benefits: </h3><p><strong>What's in it for you?</strong></p><ul> <li>A focus on professional development; </li> <li>Interesting and challenging projects</li> <li> Flexible working hours</li> <li>Paid one month vacation per year and unlimited sick leave</li> <li>Medical insurance reimbursement</li> <li>Co-working and gym/sports reimbursement</li> <li>The opportunity to receive a reward for the most innovative idea that the company can patent</li> </ul><p><em>By applying for this position, you agree with </em><a href=\"https://cloudlinux.com/privacy-policy\" rel=\"nofollow noreferrer noopener\" class=\"external\"><em>Cloudlinux Privacy Policy</em></a><em> and give us your consent to maintain and process your personal data with this respect. Please read our Privacy Policy for more information.</em></p>","tags":"[]","pubDate":"2023-12-15 00:00:00.000","link":"https://apply.workable.com/cloudlinux-1/j/976AE56F2A","savedDate":"2023-12-17 03:34:30.599","slug":"level-3-technical-support-specialist-centos-eol-cloudlinux-5313"},{"id":1304266329,"title":"Senior QA Automation Engineer","company":"IOVLabs","image":"https://remotive.com/job/1855153/logo","description":"<div><strong>About IOV Labs</strong></div>\n<div>IOV Labs is on a mission to provide the next generation of fintech innovators with the decentralized tools and technology to build a new global economy.</div>\n<div>IOV Labs operates the Rootstock Blockchain, a Bitcoin merge-mined smart contracts platform - the most secure smart contract platform in the world. IOV Labs also develops the Rootstock Infrastructure Framework (RIF) to provide our partners with everything they need to build decentralised apps and new Open Finance services on the Rootstock Blockchain.</div>\n<div>We have had early success with partners building ground-breaking Open Finance services on Rootstock. We are now scaling-up our ambitions and exploring exciting new applications for our decentralised technology.</div>\n<div> </div>\n<div><strong>About the Role</strong></div>\n<div>We are looking for a Senior QA Engineer to join IOV Labs during this exciting time of growth. Reporting to the Head of QA, you will support the Developer Experience squad in their ongoing challenge to craft cutting-edge solutions for the rootstock community.</div>\n<div>As an accomplished automation engineer, you will work across multiple teams and support them in identifying and addressing potential issues in the development lifecycle, estimating testing efforts and collaborating with a cross-functional team to meet project milestones. This role is an incredible opportunity to impact the Developer Experience team for one of the world’s leading smart contract platforms.</div>\n<div> </div>\n<p><br><br></p>\n<div class=\"h3\">What You’ll be Doing</div>\n<ul style=\"\">\n<li style=\"\">Estimate, prioritize, plan and coordinate testing activities</li>\n</ul>\n<ul style=\"\">\n<li style=\"\">Create detailed, comprehensive and well-structured test plans and test cases</li>\n</ul>\n<ul style=\"\">\n<li style=\"\">Design, develop and execute automation scripts</li>\n</ul>\n<ul style=\"\">\n<li style=\"\">Provide exhaustive and detailed documentation on bug reports, test cases, and automation tools used, among others</li>\n</ul>\n<ul style=\"\">\n<li style=\"\">Coordinate the tracking of bugs found with the development team</li>\n</ul>\n<ul style=\"\">\n<li style=\"\">Perform thorough regression testing when bugs are resolved or before a release.</li>\n</ul>\n<ul style=\"\">\n<li style=\"\">Investigate product quality in order to make improvements to achieve better customer satisfaction</li>\n</ul>\n<ul style=\"\">\n<li style=\"\">Collaborate with the Development team to ensure consistent project execution</li>\n</ul>\n<ul style=\"\">\n<li style=\"\">Identify quality assurance process bottleneck and suggest actions for improvement</li>\n</ul>\n<ul style=\"\">\n<li style=\"\">Collect and report quality data </li>\n</ul>\n<ul style=\"\">\n<li style=\"\">Prepare and present reports and metrics to management and the squad</li>\n</ul>\n<ul style=\"\">\n<li style=\"\">Establish excellent QA practices that can be transferred to other technical teams of the organization</li>\n</ul>\n<p><br><br></p>\n<div class=\"h3\">What You Bring to the Table</div>\n<ul style=\"\">\n<li style=\"\">Bachelor or Advanced Student of Computer Engineering, Computer Science, Systems or related careers</li>\n</ul>\n<ul style=\"\">\n<li style=\"\">5-8 years of experience working as a QA Automation Engineer</li>\n</ul>\n<ul style=\"\">\n<li style=\"\">Working knowledge of common software architectures (web/mobile/API/DB)</li>\n</ul>\n<ul style=\"\">\n<li style=\"\">Strong technical ability who has previously set up UI and API automation framework</li>\n</ul>\n<ul style=\"\">\n<li style=\"\">Experience in writing, executing and monitoring automated test suites using a variety of technologies</li>\n</ul>\n<ul style=\"\">\n<li style=\"\">Proficient with bug tracking and test management toolsets to support development processes</li>\n</ul>\n<ul style=\"\">\n<li style=\"\">Strong working knowledge of testing fundamentals such as TDD and BDD automation framework experience.</li>\n</ul>\n<ul style=\"\">\n<li style=\"\">Working knowledge in one or more automation tools (Selenium, Appium, WebdriverIO, Playwright, Chai, Mocha, SoapUI, JMeter…)</li>\n</ul>\n<ul style=\"\">\n<li style=\"\">Working knowledge in one or more test management tools (Xray, Zephir, TestRail…)</li>\n</ul>\n<ul style=\"\">\n<li style=\"\">Programming languages knowledge (JavaScript, TypeScript, Java)</li>\n</ul>\n<ul style=\"\">\n<li style=\"\">Experience with performance tests</li>\n</ul>\n<ul style=\"\">\n<li style=\"\">Experience working in an Agile/Scrum development process</li>\n</ul>\n<ul style=\"\">\n<li style=\"\">Experience working towards objectives with remote teams</li>\n</ul>\n<ul style=\"\">\n<li style=\"\">Bring the right attitude to the team: ownership, accountability, attention to detail.</li>\n</ul>\n<ul style=\"\">\n<li style=\"\">Advanced English language proficiency</li>\n</ul>\n<ul style=\"\">\n<li style=\"\">Good interpersonal and communication skills</li>\n</ul>\n<div> </div>\n<div><strong>Bonus points</strong></div>\n<ul style=\"\">\n<li style=\"\">Blockchain Technology Knowledge.</li>\n</ul>\n<ul style=\"\">\n<li style=\"\">Strong interest in and familiarity with cryptocurrency and decentralized technologies.</li>\n</ul>\n<ul style=\"\">\n<li style=\"\">Experience working in a fast-growing start-up.</li>\n</ul>\n<ul style=\"\">\n<li style=\"\">Information Security Knowledge.</li>\n</ul>\n<ul style=\"\">\n<li style=\"\">Threat model, safe development cycle (SDL).</li>\n</ul>\n<ul style=\"\">\n<li style=\"\">Ability to evaluate software stability and quality from a security perspective.</li>\n</ul>\n<p><br><br></p>\n<div class=\"h3\">What You’ll Get Back</div>\n<ul style=\"\">\n<li style=\"\">Competitive salary and bonus</li>\n</ul>\n<ul style=\"\">\n<li style=\"\">100% remote working (contractor) from anywhere in the world</li>\n</ul>\n<ul style=\"\">\n<li style=\"\">Possibility to work at your nearest WeWork space</li>\n</ul>\n<ul style=\"\">\n<li style=\"\">Flexible working hours. You’re free to work however you work best</li>\n</ul>\n<ul style=\"\">\n<li style=\"\">Paid holidays and personal leave days </li>\n</ul>\n<ul style=\"\">\n<li style=\"\">Opportunity to work with state of art technology in a challenging and unique project </li>\n</ul>\n<ul style=\"\">\n<li style=\"\">Internationally diverse and dynamic team with a clear vision and strategy </li>\n</ul>\n<ul style=\"\">\n<li style=\"\">Training programs to learn everything about the crypto world</li>\n</ul>\n<ul style=\"\">\n<li style=\"\">Language courses: English or Spanish</li>\n</ul>\n<ul style=\"\">\n<li style=\"\">Employee assistance program offering legal, financial, family, psychological, and wellness counseling for you and your family</li>\n</ul>\n<div> </div>\n<p><br><br></p>\n<div class=\"h3\">IOV Labs Mission, Vision, &amp; Purpose</div>\n<ul style=\"\">\n<li style=\"\"><strong>Our purpose is to...</strong> build a more decentralized world, for a freer and fairer future</li>\n</ul>\n<ul style=\"\">\n<li style=\"\"><strong>Our vision is…</strong> a safe and equitable global financial system that enables everyone to participate and prosper</li>\n</ul>\n<ul style=\"\">\n<li style=\"\"><strong>We’re on a mission to… </strong>provide the next generation of fintech innovators with the decentralized tools and technology to build a new global economy</li>\n</ul>\n<img src=\"https://remotive.com/job/track/1855153/blank.gif?source=public_api\" alt=\"\"/>","tags":"[\"api\",\"crypto\",\"java\",\"javascript\",\"scrum\",\"security\",\"UI/UX\",\"blockchain\",\"agile\",\"automation\",\"documentation\",\"information security\",\"Typescript \",\"bitcoin\",\"SoapUI\",\"selenium\",\"appium\",\"fintech\",\"JMeter\",\"testing\",\"computer science\",\"infrastructure\",\"TDD\"]","pubDate":"2023-12-14 17:22:02.000","link":"https://remotive.com/remote-jobs/qa/senior-qa-automation-engineer-1855153","savedDate":"2023-12-17 03:34:30.596","slug":"senior-qa-automation-engineer-iovlabs-9017"},{"id":7552121249,"title":"Live Chat Sales Specialist","company":"Awesome Motive","image":"https://remotive.com/job/1866149/logo","description":"<p>As a Live Chat Sales Specialist, you will join the WPForms team in Awesome Motive. As a Live Chat Sales Specialist, you’ll help curious business owners understand how WPForms can help them create forms to create surveys, build their email lists, collect payments, and many <a class=\"external\" href=\"https://wpforms.com/templates/\" rel=\"nofollow\">other exciting forms</a> for their websites. You are motivated to ‘<strong>Helping Small Businesses Grow &amp; Compete with the Big Guys</strong>’. </p>\n<p>💡 <strong>Interested in applying?</strong></p>\n<p>🔍 <strong>Please read/follow the next steps outlined in \"How to Apply\" at the bottom of this listing.</strong></p>\n<p><em>Attention to detail is one of our </em><a class=\"external\" href=\"https://awesomemotive.com/career/\" rel=\"nofollow\"><em>core values</em></a><em>! This is your chance to stand out :)</em></p>\n<div class=\"h3\">To love this role, here’s the type of person you are:</div>\n<ul style=\"\">\n<li style=\"\">You’re an extrovert, optimistic, creative, and care about customer’s interests.</li>\n<li style=\"\">You’re an excellent communicator who makes sure nothing slips through the cracks.</li>\n<li style=\"\">You’re a self-starter who loves taking initiative and seeing things through to completion.</li>\n<li style=\"\">You have the curiosity and desire to learn and grow your skills.</li>\n<li style=\"\">You take pride in the quality and craftsmanship of your work rather than just doing it to get it done.</li>\n</ul>\n<div class=\"h3\">Common responsibilities include (but are not limited to):</div>\n<ul style=\"\">\n<li style=\"\">During your first 3 months, you’ll spend the majority of your time learning about WPForms so you can accurately answer questions about it. You’ll also shadow our existing Live Chat Specialists and start chatting with visitors directly.</li>\n<li style=\"\">After that, you’ll spend 70-80% of your time chatting with visitors to our website via our chat software (LiveChatInc). You may also be required to have demo/sales meeting with prospective customers via Zoom/Google Meet.</li>\n<li style=\"\">You’ll also assist in establishing the sales goals metric and strategies to achieve them successfully.</li>\n<li style=\"\">With the rest of your time, you’ll work on one small “rock” each quarter. A rock is a project that helps us move closer to accomplishing our annual goals. You’ll have input into what rocks you’re assigned.</li>\n<li style=\"\">You’ll use a consultative selling approach to guide visitors through the decision to purchase WPForms.</li>\n<li style=\"\">When appropriate, you’ll recommend upgrades, or cross-sell other WPForms suite of products.</li>\n<li style=\"\">Your voice will impact the WPForms marketing plan and product roadmap, so it’s important to share your thoughts. Your input will help us make sure we understand the questions visitors ask.</li>\n<li style=\"\">You’ll help identify new product opportunities by listening for inquiries about features or solutions we don’t offer yet. It’s up to you to collect and thoroughly document feature requests so that you can most effectively represent our customers’ goals when we review feature requests.</li>\n<li style=\"\">You’ll also help beta test features yourself.</li>\n<li style=\"\">You’ll use your natural curiosity to learn more about marketing and sales, and to grow your understanding of how businesses want to use WPForms. You’ll freely share what you’ve learned with the rest of the team.</li>\n<li style=\"\">You’ll redirect existing WPForms customers to the Technical Support Team with grace, helping to de-escalate any frustrations and reassure them that the proper team will handle their issues swiftly.</li>\n<li style=\"\">The hardest thing about this role is controlling the conversation and turning it towards a sale rather than simply answering the visitor's question.</li>\n<li style=\"\">You will use the following tools frequently. You will take it upon yourself to utilize our documentation and theirs to learn how to use them if you’re not already familiar with them. You’ll ask for help quickly when you need help: WPForms, LiveChatInc, Asana, Zoom/Google Meet, Gmail, GSuite, HelpScout, Google Analytics, and Screencasting software like Droplr or Zoom.</li>\n</ul>\n<p><strong>Requirements</strong></p>\n<ul style=\"\">\n<li style=\"\">You have demonstrated experience in a sales position where your performance was measured by the sales volume you produced.</li>\n<li style=\"\">At least 2 years of software sales experience.</li>\n<li style=\"\">You can write and speak conversational English very well and are excellent at thoroughly explaining complicated things in a simple way.</li>\n<li style=\"\">Patience, grace, and a sense of humor.</li>\n<li style=\"\">You understand that what seems easy to you might seem like a technical nightmare to a prospect, and you won’t make them feel bad for feeling that way.</li>\n<li style=\"\">You will become a WPForms expert. You’ll take the initiative to use our existing resources and team to master it technically and to understand the business use cases for it. After all, you can’t sell what you don’t know.</li>\n<li style=\"\">You are more marketing-minded than technical, but it would be helpful if you already know some CSS/HTML. If you don’t, it’s not a dealbreaker because you’ll be willing to learn what it is. You aren’t intimidated by learning new things. </li>\n<li style=\"\">You’ve used or at least have a basic understanding of WordPress dashboards. WPForms is a WordPress plugin, so it will be helpful if you’ve administered a WordPress website before.</li>\n<li style=\"\">You have a basic understanding of email marketing services &amp; payment gateway, as plenty of our users use our forms to build their lists or to accept payments.</li>\n<li style=\"\">You type at least 55 words per minute with 95% accuracy. You’ll be tested on this before we interview.</li>\n<li style=\"\">Previous freelance or remote work experience.</li>\n<li style=\"\">Personal Computer with Internet Access</li>\n<li style=\"\">You can work between the hours of 9 AM and 5 PM ET. While our team is distributed worldwide, we get the most inquiries during this time.</li>\n</ul>\n<p><strong>Bonus points if you also have:</strong></p>\n<ul style=\"\">\n<li style=\"\">Experience working and communicating remotely.</li>\n<li style=\"\">Experience using WPForms or other similar tools.</li>\n<li style=\"\">Experience training other team members on sales-marketing skills to scale our sales team further.</li>\n<li style=\"\">Created your own website and content for it (even if it was just a hobby).</li>\n</ul>\n<p><strong>Benefits</strong></p>\n<p>Working for a fast-growing bootstrapped company is a rare opportunity, one we consider a lifestyle choice rather than a job choice. Our positions are challenging, but also come with amazing advantages and fulfillment to those who earn them. Here’s what we offer.</p>\n<ul style=\"\">\n<li style=\"\">Competitive Salary.</li>\n<li style=\"\">Term Life Insurance and Accidental Death &amp; Dismemberment for all full-time team members during their employment.</li>\n<li style=\"\">Health, Dental, and Vision Insurance benefits for full-time U.S. employees.</li>\n<li style=\"\">Health Insurance benefits for all employees in India, Pakistan, Brazil, and Ukraine.</li>\n<li style=\"\">Work from your home. We’re spread out worldwide – United States, Canada, Ukraine, India, Pakistan, Singapore, and more.</li>\n<li style=\"\">Unlimited PTO after 90 days of employment. We encourage employees to take the time they need for a vacation, stay healthy, and spend time with friends and family.</li>\n<li style=\"\">Holidays (based on your location)</li>\n<li style=\"\">Paid maternity and paternity leave.</li>\n<li style=\"\">We happily provide or reimburse software you’ll need as well as books or courses that promote continued learning.</li>\n<li style=\"\">We cover all costs of company travel (including our annual all-company retreat and mini-team meetups).</li>\n<li style=\"\">Additional Perks include AM Welcome Box for new team members, Yearly Anniversary Gifts, and Technology Stipend each work anniversary.</li>\n<li style=\"\">We give you the opportunity to solve challenging and meaningful problems that make a difference.</li>\n<li style=\"\">Ability to work with some of the best people in the business through frequent, if not daily, interactions.</li>\n<li style=\"\">And in case you were wondering: no politics, no b.s., and no jerks.</li>\n</ul>\n<p><strong>Location<br></strong>This is a remote position - our team is spread around the globe! Our home base is in Florida, USA, so company operating hours are 9am - 5pm ET (UTC -5). For this role, typical work hours match these operating hours.</p>\n<p><strong>Inclusion Statement<br></strong>At Awesome Motive, we strive to have the broadest possible view of diversity, going beyond visible differences to include the background, experiences, skills, and perspectives that make each person unique. Awesome Motive is proud to be an equal opportunity workplace and is committed to equal employment opportunity regardless of race, color, ancestry, religion, sex, national origin, sexual orientation, age, citizenship, marital status, disability, gender identity, veteran status, or any other basis protected by federal, state, or local law.</p>\n<p><strong>How to apply?<br></strong>If all of this sounds interesting, then please submit your application!</p>\n<p><strong>Please clearly include the following in your cover letter:</strong></p>\n<ul style=\"\">\n<li style=\"\">Your previous sales experience and sales goals you met, including your approach to working with team members.</li>\n<li style=\"\">A bit about yourself and why you should be considered. Team culture is very important to us, so in addition to your experience and qualifications, please help us to see your personality/get to know who you are. Bonus points if you decide to share a video of yourself.</li>\n<li style=\"\">Profile links if available (Your website, sites where you’ve written guest posts, WordPress.org, GitHub, or any social accounts you feel are relevant to this role that you’d like us to see).</li>\n<li style=\"\">In three sentences or less, in your own words, tell us how you think WPForms helps small businesses. You will not be considered for the role if you skip this part.</li>\n</ul>\n<p>Also note, don't forget to proofread before submitting. Check spelling, capitalization, etc. This is your chance to make your application stand out :)</p>\n<p>We won’t be able to respond to all applications individually, but if we feel you’re a strong match, someone will be in touch shortly.</p>\n<p><strong>Thanks, and we look forward to hearing from you!</strong></p>\n<img src=\"https://remotive.com/job/track/1866149/blank.gif?source=public_api\" alt=\"\"/>","tags":"[\"CSS\",\"html\",\"video\",\"wordpress\",\"documentation\",\"analytics\",\"google analytics\",\"asana\",\"technical support\",\"chat\",\"email marketing\",\"software sales\",\"github\",\"diversity\",\"travel\",\"REST\",\"insurance\",\"gsuite\"]","pubDate":"2023-12-14 17:21:33.000","link":"https://remotive.com/remote-jobs/sales/live-chat-sales-specialist-1866149","savedDate":"2023-12-17 03:34:30.596","slug":"live-chat-sales-specialist-awesome-motive-6703"}]