[{"id":3221635341,"title":"Sr. Product Manager - México ","company":"Empower","image":"https://lever-client-logos.s3.us-west-2.amazonaws.com/2e1a369c-b58f-41ac-8d86-4b0a77695e68-1687915522032.png","description":"<p style=\"min-height:1.5em\"><strong>EMPOWER OVERVIEW</strong></p><p style=\"min-height:1.5em\"><a target=\"_blank\" rel=\"noopener noreferrer nofollow\" href=\"http://empower.me/\">Empower</a> is shaking up an outdated financial system by providing real opportunity for our customers: the opportunity to get the cash they need, to access fair credit, and to change their financial story. Today, we’re helping millions of people find financial security through machine learning models that evaluate creditworthiness using a more inclusive lens and mobile-first products: Cash Advance, Thrive line of credit, and Petal credit cards. Tomorrow? Creating even more financial paths for our customers (and their wallets) to succeed.</p><p style=\"min-height:1.5em\">This year, Empower ranked #65 on Inc. 5000’s Fastest-Growing Private Companies list — our third year in a row cracking the top 100 — and was named by Forbes as one of the 25 Next Billion-Dollar Startups for 2024. Empower was also featured by Forbes on America’s Best Startup Employers list in 2023, and our Thrive line of credit product was named by Fast Company as one of 2022’s Next Big Things in Tech.</p><p style=\"min-height:1.5em\">Empower is backed by Sequoia Capital, Blisce, and Icon Ventures. Ready to grow your impact and accelerate your career? Take a look at our open roles — we can’t wait to meet you.</p><p style=\"min-height:1.5em\"></p><p style=\"min-height:1.5em\"><strong>THE EMPOWER WAY</strong></p><p style=\"min-height:1.5em\"><strong>Great Expectations</strong>: We come up with bold, audacious goals for ourselves and go all out for impact</p><p style=\"min-height:1.5em\"><strong>Owner Mindset</strong>: We give every employee latitude to act independently, make smart choices, and move the business forward</p><p style=\"min-height:1.5em\"><strong>Spirited Debate</strong>: We love skeptics and seek counter opinions to challenge our personal assumptions and expand our view</p><p style=\"min-height:1.5em\"><strong>Customer Obsession:</strong> We listen to understand, empathize, and create a memorable, rewarding experience for our community</p><p style=\"min-height:1.5em\"><strong>Inclusive Collaboration</strong>: We believe diverse teams make the best decisions, and we strive to give diverse voices a seat at the table</p><p style=\"min-height:1.5em\"><strong>No Jerks Allowed</strong>: We value our relationships and take the time to build trust and connection and communicate respectfully</p><p style=\"min-height:1.5em\"></p><p style=\"min-height:1.5em\"><strong>WHAT EMPOWER OFFERS</strong></p><p style=\"min-height:1.5em\">Competitive salary</p><p style=\"min-height:1.5em\">Generous equity package</p><p style=\"min-height:1.5em\">Full healthcare benefits</p><p style=\"min-height:1.5em\">Technology expense reimbursement</p><p style=\"min-height:1.5em\">Work from anywhere</p><p style=\"min-height:1.5em\"></p><p style=\"min-height:1.5em\"><strong>THE ROLE</strong><br /><br />We're looking for a founding Product Manager to join the Empower México (MX) team. As a Sr. Product Manager, you will be responsible for the company's product success and delivery. This role requires someone who is a proven self-starter as Empower México is still a small company with huge ambitions. If you’re looking to own and drive the product of a whole company's future, this role offers that rare chance.</p><p style=\"min-height:1.5em\"></p><p style=\"min-height:1.5em\">You'll collaborate with an established team that values high trust, agency, and skill across engineering, credit, and operations to write the story of Empower México.</p><p style=\"min-height:1.5em\"></p><h3>RESPONSIBILITIES</h3><ul style=\"min-height:1.5em\"><li><p style=\"min-height:1.5em\">You will develop a strategic vision for the lending products in Mexico and identify new product opportunities aligned with business objectives. Given the developing stage of Empower México, our product roadmap is open to exploration and experimentation.</p></li><li><p style=\"min-height:1.5em\">Prioritize and drive product features to meet market needs by defining clear and concise criteria, and ensuring cross-team alignment with the MX roadmap.</p></li><li><p style=\"min-height:1.5em\">Utilize our internal experiment infrastructure to conduct experiments and contribute to the implementation and analysis of these experiments, as well as collaborate with Credit and Operations to develop new ones.</p></li><li><p style=\"min-height:1.5em\">Lead and inspire the rest of the México team to deliver product goals and OKRs by setting team objectives that support the company's strategy.</p></li><li><p style=\"min-height:1.5em\">Collaborate with engineering to prioritize tasks, ensuring efficient and high-quality delivery.</p></li><li><p style=\"min-height:1.5em\">Report back to the leadership team and stakeholders that oversee México’s progress.</p></li></ul><p style=\"min-height:1.5em\"></p><h3>REQUIREMENTS + SKILLS</h3><ul style=\"min-height:1.5em\"><li><p style=\"min-height:1.5em\">Bachelor's degree: preferred focus in Business, Finance, Computer Science or similar field</p></li><li><p style=\"min-height:1.5em\">5-10 years in product management with a preferred focus on financial or lending products</p></li><li><p style=\"min-height:1.5em\">Experience collaborating with cross-functional teams, including but not limited to engineering and design teams</p></li><li><p style=\"min-height:1.5em\">Proficient use of SQL and analytical data visualization tools (e.g., Tableau, PowerBI)</p></li><li><p style=\"min-height:1.5em\">Capacity to balance functional and user experience requirements while considering the trade-offs between different technical strategies</p></li><li><p style=\"min-height:1.5em\">Broad understanding of the technical restraints engineers face when delivering product</p></li></ul><p style=\"min-height:1.5em\"></p><h3>STRONG PLUS</h3><ul style=\"min-height:1.5em\"><li><p style=\"min-height:1.5em\">Worked on a “zero to one” project taking a business from an idea to a profitable venture</p></li><li><p style=\"min-height:1.5em\">Experience in consumer lending products</p></li><li><p style=\"min-height:1.5em\">Experience in México or a LATAM financial market</p></li><li><p style=\"min-height:1.5em\">Fluency in Spanish (written and verbal)</p></li></ul><p style=\"min-height:1.5em\">At Empower, we hire for people that push themselves to understand others and seek out ways to challenge their personal assumptions. Our hope is that by fostering such an environment, we strengthen our business and relationships by putting people first. We are committed to building a diverse, inclusive, and equitable workspace where everyone (regardless of age, education, ethnicity, gender, sexual orientation, or any personal characteristics) feels like they belong. Even if your experience doesn’t exactly match up to our job description, you should feel empowered to apply regardless!</p>","tags":"[\"Finance\",\"management\",\"engineering\"]","pubDate":"2024-12-18T17:16:41.699Z","link":"https://jobs.ashbyhq.com/empower%20finance/dbb2419b-e6fc-4d3a-9931-d37cf76c76d0","slug":"sr-product-manager-m-xico-empower-4544"},{"id":2001986230,"title":"NOC Lead","company":"Airalo","image":"https://lever-client-logos.s3.us-west-2.amazonaws.com/55028a36-609c-479c-9553-d4689ff2dd8c-1669620566663.png","description":"<div><b>About Airalo</b></div><div>Alo! Airalo is the world’s first eSIM store that helps people connect in over 200+ countries and regions across the globe. We are building the next digital service that revolutionizes the telecom industry. We are a travel-tech company and an equal-opportunity environment that values and executes diversity, inclusion, and equity. Our team is spread across 50+ countries and six continents. What glues us together is our commitment to changing the way you connect<span style=\"font-size: 13.3333px\">. </span></div><div><br></div><div><b>About you</b></div><div>We hope that you care deeply about the quality of your work, the intrinsic worth of tasks, and the success of your team. You are self-disciplined and do not require micromanagement in terms of your skillset and work ethic. You do your best to flourish as an individual every day while working hard to foster a collaborative team environment. You believe in the importance of being — and staying — authentic, honest, positive, and kind. You are a good interlocutor with clear and concise communication. You are able to manage multiple projects, have an analytical mind, pay keen attention to detail, and love to get your hands dirty. You are cognizant, tolerant, and welcoming of vulnerabilities and cultural differences.</div><div><br></div><div><b>About the Role</b></div><div><b>Position</b>: Full-time / Employee</div><div><b>Location:</b>&nbsp;Remote-first </div><div><b>Benefits:</b>&nbsp;Health Insurance, work-from-anywhere stipend, annual wellness &amp; learning credits, annual all-expenses-paid company retreat in a gorgeous destination &amp; other benefits</div><div><br></div><div>As the NOC Lead at Airalo, you will be responsible for building and leading our Telecom NOC team from the ground up. You will manage both the 1st and 2nd level NOC engineers and oversee all incidents, performance monitoring, and escalation management. This position is crucial to ensuring that our services are always operational and that any potential issues are quickly identified, mitigated, and communicated effectively across the organization. Your role will be pivotal in shaping the future of Airalo's network operations and ensuring seamless, uninterrupted service for our customers.&nbsp;</div><h3>Your main responsibilities will be to:</h3><li>Build a high-performing team of Telecom NOC engineers, responsible for 24/7 monitoring and managing the performance of Airalo’s network and services, including both 1st and 2nd level NOC support.</li><li>Line management for 1st and 2nd level NOC agents, including building development plans, performance reviews, coaching, mentoring.</li><li>Take ownership of all incidents from detection to resolution, ensuring quick identification and remediation of issues. Coordinate with internal teams and external partners to resolve incidents promptly and effectively.</li><li>Implement tools and processes to gain better visibility into partner network performance, our API performance, and other critical systems. Ensure potential issues are recognized immediately.</li><li>Orchestrate clear communication channels between the NOC team, customer care, engineering, and management teams. Ensure that relevant parties are notified promptly of issues, resolutions, and next steps.</li><li>Perform immediate corrective and mitigation actions when issues arise. Manage 2nd level corrective measures independently to avoid overloading the engineering team with interruptions.</li><li>Collaborate closely with customer care to notify them of confirmed issues and updates. Help release the engineering team from day-to-day troubleshooting by handling 2nd level issues autonomously.</li><li>Manage and perform legal interception requests from authorities as needed, ensuring proper adherence to local regulations.</li><li>Oversee and manage NOC-related stock to ensure that all necessary equipment and tools are available to the team when needed.</li>,<h3>Does this sound like you?</h3><li>Proven experience as a NOC Lead, NOC Manager, or similar leadership role in a fast-paced tech environment.</li><li>Experience building and managing a NOC team in a 24/7 setup.</li><li>Strong understanding of telecom network monitoring, incident management, and escalation procedures.</li><li>Ability to implement tools and processes for improved visibility and performance tracking of network and API performance.</li><li>Excellent communication and interpersonal skills, with a strong ability to coordinate across different teams and escalate issues effectively.</li><li>Strong problem-solving skills and a proactive approach to managing incidents.</li><li>Ability to work independently and take ownership of complex issues.</li><li>Experience in legal interception and stock management is a plus.</li><li>Familiarity with API performance, cloud infrastructure, and telecom industry trends is advantageous.</li>,<h3>It's a bonus if you have:</h3><li>Prior experience in telecommunications or network infrastructure.</li><li>Familiarity with eSIM and GSMA technologies.</li><div><span style=\"font-size: 15px;\">If you are interested in this position,&nbsp;</span><b style=\"font-size: 15px;\">please apply via the link.</b></div><div><br></div><div><i style=\"font-size: 15px;\">Please note that our Engineering &amp; Product team works in the CET timezone, so candidates will need to reside in countries with the same time zone or similar to it and will need to already have permit to work in the country where they are based.</i></div><div><br></div><div>We sincerely thank all applicants in advance for submitting their interest in this opportunity. Airalo is an equal opportunity employer and values diversity, equity &amp; inclusion. We do not discriminate on the basis of race, religion, national origin, gender, sexual orientation, age, marital status, veteran status, or disability status. We are committed to providing reasonable accommodations upon request for individuals with disabilities throughout our job interview process.</div>","tags":"[\"management\",\"engineering\",\"legal\"]","pubDate":"2024-12-18T09:26:59.774Z","link":"https://jobs.lever.co/airalo/7facf451-b595-402f-87ea-a7b841e186bb","slug":"noc-lead-airalo-1548"},{"id":9360001709,"title":"Engineering Manager","company":"Airalo","image":"https://lever-client-logos.s3.us-west-2.amazonaws.com/55028a36-609c-479c-9553-d4689ff2dd8c-1669620566663.png","description":"<div><b>About Airalo</b></div><div>Alo! Airalo is the world’s first eSIM store that helps people connect in over 200+ countries and regions across the globe. We are building the next digital service that revolutionizes the telecom industry. We are a travel-tech company and an equal-opportunity environment that values and executes diversity, inclusion, and equity. Our team is spread across 50+ countries and six continents. What glues us together is our commitment to changing the way you connect<span style=\"font-size: 13.3333px\">. </span></div><div><br></div><div><b>About you</b></div><div>We hope that you care deeply about the quality of your work, the intrinsic worth of tasks, and the success of your team. You are self-disciplined and do not require micromanagement in terms of your skillset and work ethic. You do your best to flourish as an individual every day while working hard to foster a collaborative team environment. You believe in the importance of being — and staying — authentic, honest, positive, and kind. You are a good interlocutor with clear and concise communication. You are able to manage multiple projects, have an analytical mind, pay keen attention to detail, and love to get your hands dirty. You are cognizant, tolerant, and welcoming of vulnerabilities and cultural differences.</div><div><br></div><div><b>About the Role</b></div><div><b>Position</b>: Full-time / Employee</div><div><b>Location:</b>&nbsp;Remote-first </div><div><b>Benefits:</b>&nbsp;Health Insurance, work-from-anywhere stipend, annual wellness &amp; learning credits, annual all-expenses-paid company retreat in a gorgeous destination &amp; other benefits</div><div><br></div><div>We are looking for an Engineering Manager to help us scale, improve organizational transparency, provide career development, mentorship, and honest feedback for our smart and talented engineers. Using your varying technical backgrounds and interests, you will drive and provide general technical direction and oversight. You will keep your team efficient and executing on the right goals. We build teams that are inclusive, helpful, and have a strong sense of ownership for the things they build.</div><h3>Your main responsibilities will be to:</h3><li>Lead technology excellence in the company in the related domain</li><li>Extend and improve engineering best practices in the teams</li><li>Maintain and improve a collaborative environment, commit to driving projects to completion creatively</li><li>Motivate and instill a strong sense of ownership in your team</li><li>Mentor and guide the professional and technical development of your team members</li><li>Ensures that the team delivers high-quality products and solutions by following the best practices, e.g. testing, observability, etc.</li><li>Build a team that is collaborative, inclusive, and respectful of each other</li><li>Provide continuous feedback, address underperformance, and recognize the individual strengths and contributions of your team members</li><li>Work with your engineers and/or product managers to maintain a prioritized backlog and create short-term and long-term goals</li><li>Own your team’s deliverables and ensure we continue to ship scalable, highly-available products</li><li>Work closely with the recruiting team to hire high-potential candidates from diverse backgrounds</li>,<h3>Does this sound like you?</h3><li>Minimum 5 years of technical background and are able to contribute to planning and design discussions, drive technical decisions and perform code reviews</li><li>Minimum 2 years of experience in leading the team and guiding them through their career development</li><li>Experience in guiding teams through planning, prioritization, and execution of work</li><li>Expertise in building and refactoring of distributed systems</li><li>Expertise in event-driven architecture and Messaging systems: Queue, Pub/Sub, etc.</li><li>Good knowledge of SQL/NoSQL</li><li>Good knowledge in AWS services (EC2, Lambda, SQS, Security, Aurora, DynamoDB)</li><li>Experience with Docker</li><li>Knowledge and experience about Unit Test/Feature Test/Mocking</li><li>Good communication skills and fluency in English</li><div>If you are interested in this position, please apply via the <b>link.</b></div><div><br></div><div><i style=\"font-size: 15px;\">Please note that our Engineering team works in the CET timezone, so candidates will need to reside in countries with the same time zone or similar to it and will need to already have permit to work in the country where they are based.</i></div><div><br></div><div>We sincerely thank all applicants in advance for submitting their interest in this opportunity. Airalo is an equal opportunity employer and values diversity, equity &amp; inclusion. We do not discriminate on the basis of race, religion, national origin, gender, sexual orientation, age, marital status, veteran status, or disability status. We are committed to providing reasonable accommodations upon request for individuals with disabilities throughout our job interview process.</div>","tags":"[\"management\",\"engineering\",\"aws\"]","pubDate":"2024-12-18T08:38:42.604Z","link":"https://jobs.lever.co/airalo/efe39f01-75d1-48ba-bccd-dd77cc13c5c2","slug":"engineering-manager-airalo-1660"},{"id":5795945024,"title":"Customer Support Manager","company":"Sienna Charles","image":"https://remotive.com/job/1958081/logo","description":"<p dir=\"ltr\" style=\"line-height:1.2;margin-top:0pt;margin-bottom:0pt;\"><span style=\"color:#0e101a;background-color:transparent;font-weight:700;font-style:normal;font-variant:normal;text-decoration:none;vertical-align:baseline;white-space:pre;white-space:pre-wrap;\">Summary:</span></p><p dir=\"ltr\" style=\"line-height:1.2;margin-top:0pt;margin-bottom:0pt;\"><a href=\"https://siennacharles.com/about/our-approach/\" rel=\"nofollow\" style=\"text-decoration:none;\"><span style=\"color:#1155cc;background-color:transparent;font-weight:400;font-style:normal;font-variant:normal;text-decoration:underline;-webkit-text-decoration-skip:none;text-decoration-skip-ink:none;vertical-align:baseline;white-space:pre;white-space:pre-wrap;\">Sienna Charles</span></a><span style=\"color:#0e101a;background-color:transparent;font-weight:400;font-style:normal;font-variant:normal;text-decoration:none;vertical-align:baseline;white-space:pre;white-space:pre-wrap;\">, the premier luxury lifestyle company featured in magazines such as Forbes, is looking for a </span><span style=\"color:#0e101a;background-color:transparent;font-weight:700;font-style:normal;font-variant:normal;text-decoration:none;vertical-align:baseline;white-space:pre;white-space:pre-wrap;\"> Customer Support Manager</span><span style=\"color:#0e101a;background-color:transparent;font-weight:400;font-style:normal;font-variant:normal;text-decoration:none;vertical-align:baseline;white-space:pre;white-space:pre-wrap;\"> who is as passionate as we are about creating incredible customer service experiences for our elite clientele. This highly skilled individual will oversee and execute the company’s day-to-day operations of our exclusive travel and lifestyle services team. </span></p><p><strong><br></strong></p><p dir=\"ltr\" style=\"line-height:1.2;margin-top:0pt;margin-bottom:0pt;\"><span style=\"color:#0e101a;background-color:transparent;font-weight:700;font-style:normal;font-variant:normal;text-decoration:none;vertical-align:baseline;white-space:pre;white-space:pre-wrap;\">Key Responsibilities:</span></p><ul style=\"\"><li dir=\"ltr\" style=\"\"><p dir=\"ltr\" style=\"line-height:1.2;margin-top:0pt;margin-bottom:0pt;\"><span style=\"color:#0e101a;background-color:transparent;font-weight:700;font-style:normal;font-variant:normal;text-decoration:none;vertical-align:baseline;white-space:pre;white-space:pre-wrap;\">Team and Project Management: </span><span style=\"color:#0e101a;background-color:transparent;font-weight:400;font-style:normal;font-variant:normal;text-decoration:none;vertical-align:baseline;white-space:pre;white-space:pre-wrap;\">Responsible for all day-to-day operations related to client travel and concierge requests using tools like Zendesk for client support and engagement. Set and maintain team schedules, ensuring client deadlines are met or exceeded and providing quality control to ensure standards are always met</span></p></li><li dir=\"ltr\" style=\"\"><p dir=\"ltr\" style=\"line-height:1.2;margin-top:0pt;margin-bottom:0pt;\"><span style=\"color:#0e101a;background-color:transparent;font-weight:700;font-style:normal;font-variant:normal;text-decoration:none;vertical-align:baseline;white-space:pre;white-space:pre-wrap;\">Zendesk: </span><span style=\"color:#0e101a;background-color:transparent;font-weight:400;font-style:normal;font-variant:normal;text-decoration:none;vertical-align:baseline;white-space:pre;white-space:pre-wrap;\">Should be skilled in creating custom ticket views, optimizing workflows with triggers, automations, and macros, and configuring SLAs for timely issue resolution. Able to build custom reports in Zendesk Explore to track KPIs like response time and CSAT and integrate third-party tools for seamless client interactions.</span></p></li><li dir=\"ltr\" style=\"\"><p dir=\"ltr\" style=\"line-height:1.2;margin-top:0pt;margin-bottom:0pt;\"><span style=\"color:#0e101a;background-color:transparent;font-weight:700;font-style:normal;font-variant:normal;text-decoration:none;vertical-align:baseline;white-space:pre;white-space:pre-wrap;\">Training and Coaching</span><span style=\"color:#0e101a;background-color:transparent;font-weight:400;font-style:normal;font-variant:normal;text-decoration:none;vertical-align:baseline;white-space:pre;white-space:pre-wrap;\">: Oversee our training program to empower the trip team to execute consistently at the highest standards. Provide performance reviews and feedback to improve the teams’ performance and confidence continually. </span></p></li><li dir=\"ltr\" style=\"\"><p dir=\"ltr\" style=\"line-height:1.2;margin-top:0pt;margin-bottom:0pt;\"><span style=\"color:#0e101a;background-color:transparent;font-weight:700;font-style:normal;font-variant:normal;text-decoration:none;vertical-align:baseline;white-space:pre;white-space:pre-wrap;\">Process Improvement</span><span style=\"color:#0e101a;background-color:transparent;font-weight:400;font-style:normal;font-variant:normal;text-decoration:none;vertical-align:baseline;white-space:pre;white-space:pre-wrap;\">: Partner closely with the team to proactively identify and prioritize opportunities for process improvement, including requests to the technology team to improve and optimize the workflows and dashboards. Based on data, create future processes and standards for your team as we continue to learn and improve. </span></p></li><li dir=\"ltr\" style=\"\"><p dir=\"ltr\" style=\"line-height:1.2;margin-top:0pt;margin-bottom:0pt;\"><span style=\"color:#0e101a;background-color:transparent;font-weight:700;font-style:normal;font-variant:normal;text-decoration:none;vertical-align:baseline;white-space:pre;white-space:pre-wrap;\">Problem Solving</span><span style=\"color:#0e101a;background-color:transparent;font-weight:400;font-style:normal;font-variant:normal;text-decoration:none;vertical-align:baseline;white-space:pre;white-space:pre-wrap;\">: Ability to think creatively to manage exceptions and issues arising from the team and client situations. You will be the primary point of escalation for questions and concerns from the team and be responsible for finding and creating solutions to problems that arise.</span></p></li></ul><p><strong><br></strong></p><p><strong><br></strong></p><p dir=\"ltr\" style=\"line-height:1.2;margin-top:0pt;margin-bottom:0pt;\"><span style=\"color:#0e101a;background-color:transparent;font-weight:700;font-style:normal;font-variant:normal;text-decoration:none;vertical-align:baseline;white-space:pre;white-space:pre-wrap;\">Persona Fit:</span></p><ul style=\"\"><li dir=\"ltr\" style=\"\"><p dir=\"ltr\" style=\"line-height:1.2;margin-top:0pt;margin-bottom:0pt;\"><span style=\"color:#0e101a;background-color:transparent;font-weight:700;font-style:normal;font-variant:normal;text-decoration:none;vertical-align:baseline;white-space:pre;white-space:pre-wrap;\">Character and Culture:</span><span style=\"color:#0e101a;background-color:transparent;font-weight:400;font-style:normal;font-variant:normal;text-decoration:none;vertical-align:baseline;white-space:pre;white-space:pre-wrap;\"> Relatable and engaging personality, enjoys working with others, and has strong written and verbal communication skills. Practice a high level of discretion and maintain confidentiality with our clients, and expect the same from your team.</span></p></li><li dir=\"ltr\" style=\"\"><p dir=\"ltr\" style=\"line-height:1.2;margin-top:0pt;margin-bottom:0pt;\"><span style=\"color:#0e101a;background-color:transparent;font-weight:700;font-style:normal;font-variant:normal;text-decoration:none;vertical-align:baseline;white-space:pre;white-space:pre-wrap;\">Attention to Detail:</span><span style=\"color:#0e101a;background-color:transparent;font-weight:400;font-style:normal;font-variant:normal;text-decoration:none;vertical-align:baseline;white-space:pre;white-space:pre-wrap;\"> You are obsessed with ensuring every piece is where it needs to be and can't let something go until you know it's perfect.</span></p></li><li dir=\"ltr\" style=\"\"><p dir=\"ltr\" style=\"line-height:1.2;margin-top:0pt;margin-bottom:0pt;\"><span style=\"color:#0e101a;background-color:transparent;font-weight:700;font-style:normal;font-variant:normal;text-decoration:none;vertical-align:baseline;white-space:pre;white-space:pre-wrap;\">Prioritization and Efficiency:</span><span style=\"color:#0e101a;background-color:transparent;font-weight:400;font-style:normal;font-variant:normal;text-decoration:none;vertical-align:baseline;white-space:pre;white-space:pre-wrap;\"> With a strong sense of urgency, you can determine what to focus on first and can work both quickly and efficiently to maintain multiple deadlines.  </span></p></li><li dir=\"ltr\" style=\"\"><p dir=\"ltr\" style=\"line-height:1.2;margin-top:0pt;margin-bottom:0pt;\"><span style=\"color:#0e101a;background-color:transparent;font-weight:700;font-style:normal;font-variant:normal;text-decoration:none;vertical-align:baseline;white-space:pre;white-space:pre-wrap;\">Ownership and Management:</span><span style=\"color:#0e101a;background-color:transparent;font-weight:400;font-style:normal;font-variant:normal;text-decoration:none;vertical-align:baseline;white-space:pre;white-space:pre-wrap;\"> You see your role as more than a job and look for ways to go above and beyond to improve the process continuously. You keep on top of all tasks and know how to organize and maintain them all. </span></p></li></ul><p><strong><br></strong></p><p dir=\"ltr\" style=\"line-height:1.2;margin-top:0pt;margin-bottom:0pt;\"><span style=\"color:#0e101a;background-color:transparent;font-weight:400;font-style:normal;font-variant:normal;text-decoration:none;vertical-align:baseline;white-space:pre;white-space:pre-wrap;\">If the above describes you well and are attributes that come naturally to you, this would indicate that you are right for the role.</span></p><p dir=\"ltr\" style=\"line-height:1.2;margin-top:0pt;margin-bottom:0pt;\"><span style=\"color:#0e101a;background-color:transparent;font-weight:400;font-style:normal;font-variant:normal;text-decoration:none;vertical-align:baseline;white-space:pre;white-space:pre-wrap;\"><br></span></p><p dir=\"ltr\" style=\"line-height:1.2;margin-top:0pt;margin-bottom:0pt;\"><span style=\"color:#0e101a;background-color:transparent;font-weight:400;font-style:normal;font-variant:normal;text-decoration:none;vertical-align:baseline;white-space:pre;white-space:pre-wrap;\"><br></span></p><p dir=\"ltr\" style=\"line-height:1.2;margin-top:0pt;margin-bottom:0pt;\"><span style=\"color:#0e101a;background-color:transparent;font-weight:700;font-style:normal;font-variant:normal;text-decoration:none;vertical-align:baseline;white-space:pre;white-space:pre-wrap;\">Requirements: </span></p><ul style=\"\"><li dir=\"ltr\" style=\"\"><p dir=\"ltr\" style=\"line-height:1.2;margin-top:0pt;margin-bottom:0pt;\"><span style=\"color:#0e101a;background-color:transparent;font-weight:400;font-style:normal;font-variant:normal;text-decoration:none;vertical-align:baseline;white-space:pre;white-space:pre-wrap;\">3-5 years of management experience with a proven ability to keep a team on track; has a track record of training and empowering team members.</span></p></li><li dir=\"ltr\" style=\"\"><p dir=\"ltr\" style=\"line-height:1.2;margin-top:0pt;margin-bottom:0pt;\"><span style=\"color:#0e101a;background-color:transparent;font-weight:400;font-style:normal;font-variant:normal;text-decoration:none;vertical-align:baseline;white-space:pre;white-space:pre-wrap;\">Proficient in Zendesk and other project management and communication tools; must be tech-savvy and quick to learn new software.</span></p></li><li dir=\"ltr\" style=\"\"><p dir=\"ltr\" style=\"line-height:1.2;margin-top:0pt;margin-bottom:0pt;\"><span style=\"color:#0e101a;background-color:transparent;font-weight:400;font-style:normal;font-variant:normal;text-decoration:none;vertical-align:baseline;white-space:pre;white-space:pre-wrap;\">Must have experience with BPOS and outsourced teams.</span></p></li><li dir=\"ltr\" style=\"\"><p dir=\"ltr\" style=\"line-height:1.2;margin-top:0pt;margin-bottom:0pt;\"><span style=\"color:#0e101a;background-color:transparent;font-weight:400;font-style:normal;font-variant:normal;text-decoration:none;vertical-align:baseline;white-space:pre;white-space:pre-wrap;\">Ideally, experience in high-level B2C services in the travel industry are a plus. </span></p></li><li dir=\"ltr\" style=\"\"><p dir=\"ltr\" style=\"line-height:1.2;margin-top:0pt;margin-bottom:0pt;\"><span style=\"color:#0e101a;background-color:transparent;font-weight:400;font-style:normal;font-variant:normal;text-decoration:none;vertical-align:baseline;white-space:pre;white-space:pre-wrap;\">Results-driven and self-motivated, with strong multitasking abilities.</span></p></li><li dir=\"ltr\" style=\"\"><p dir=\"ltr\" style=\"line-height:1.2;margin-top:0pt;margin-bottom:0pt;\"><span style=\"color:#0e101a;background-color:transparent;font-weight:400;font-style:normal;font-variant:normal;text-decoration:none;vertical-align:baseline;white-space:pre;white-space:pre-wrap;\">Excellent verbal and written communication skills, with a focus on cross-functional collaboration.</span></p></li><li dir=\"ltr\" style=\"\"><p dir=\"ltr\" style=\"line-height:1.2;margin-top:0pt;margin-bottom:0pt;\"><span style=\"color:#0e101a;background-color:transparent;font-weight:400;font-style:normal;font-variant:normal;text-decoration:none;vertical-align:baseline;white-space:pre;white-space:pre-wrap;\">Proven experience in driving projects, prioritizing tasks from initiation to completion, and leading cross-functional teams.</span></p></li><li dir=\"ltr\" style=\"\"><p dir=\"ltr\" style=\"line-height:1.2;margin-top:0pt;margin-bottom:0pt;\"><span style=\"color:#0e101a;background-color:transparent;font-weight:400;font-style:normal;font-variant:normal;text-decoration:none;vertical-align:baseline;white-space:pre;white-space:pre-wrap;\">Creative and strategic thinker, particularly in client advocacy and retention.</span></p></li><li dir=\"ltr\" style=\"\"><p dir=\"ltr\" style=\"line-height:1.2;margin-top:0pt;margin-bottom:0pt;\"><span style=\"color:#0e101a;background-color:transparent;font-weight:400;font-style:normal;font-variant:normal;text-decoration:none;vertical-align:baseline;white-space:pre;white-space:pre-wrap;\">Flexible availability, including weekends as needed</span></p></li></ul><p><strong><br></strong></p><p><strong><br></strong></p><p dir=\"ltr\" style=\"line-height:1.2;margin-top:0pt;margin-bottom:0pt;\"><span style=\"color:#0e101a;background-color:transparent;font-weight:700;font-style:normal;font-variant:normal;text-decoration:none;vertical-align:baseline;white-space:pre;white-space:pre-wrap;\">Location:</span></p><p dir=\"ltr\" style=\"line-height:1.2;margin-top:0pt;margin-bottom:0pt;\"><span style=\"color:#0e101a;background-color:transparent;font-weight:400;font-style:normal;font-variant:normal;text-decoration:none;vertical-align:baseline;white-space:pre;white-space:pre-wrap;\">The company is primarily based out of our New York City office location. The job would primarily be remote.</span></p><p><br></p><p dir=\"ltr\" style=\"line-height:1.2;margin-top:0pt;margin-bottom:0pt;\"><span style=\"color:#0e101a;background-color:transparent;font-weight:700;font-style:normal;font-variant:normal;text-decoration:none;vertical-align:baseline;white-space:pre;white-space:pre-wrap;\">Timezone:</span></p><p dir=\"ltr\" style=\"line-height:1.2;margin-top:0pt;margin-bottom:0pt;\"><span style=\"color:#0e101a;background-color:transparent;font-weight:400;font-style:normal;font-variant:normal;text-decoration:none;vertical-align:baseline;white-space:pre;white-space:pre-wrap;\">The job would be fully remote and be required to work in the EST timezone around 8 am-5 pm EST.</span></p><p><br></p>\n<img src=\"https://remotive.com/job/track/1958081/blank.gif?source=public_api\" alt=\"\"/>","tags":"[\"go\",\"project management\",\"zendesk\",\"travel\"]","pubDate":"2024-12-17T18:59:27.000Z","link":"https://remotive.com/remote-jobs/customer-support/customer-support-manager-1958081","slug":"customer-support-manager-sienna-charles-5269"}]