[{"id":6892807381,"title":"Lead Linux Kernel Engineer - Ubuntu","company":"Canonical","image":"https://pbs.twimg.com/profile_images/1673959375340290050/x7pNtXQ7_400x400.jpg","description":"\n      <p>Ubuntu Linux, already the most popular Linux distribution in the world, is currently in the midst of an unprecedented surge in demand. To meet this need the Canonical Kernel Team - those responsible for the build, maintenance, and distribution of the Linux kernel for Ubuntu - are looking for individuals with not only an incredibly deep technical background in operating system kernels and distributions, but also a strong flair for leadership and taking initiative to drive ideas and the associated delivery teams to completion.</p>\n<p>The Canonical Kernel Team is seeking exceptionally talented technology experts and industry veterans with a proven track record to take the lead in the architecture, implementation, and ongoing delivery of the following (but not limited to) aspects of kernel engineering:</p>\n<ul>\n<li>Driving engagements for key Silicon and Cloud partners to provide optimal solutions for their platforms</li>\n<li>Leading the mitigation of common vulnerabilities and exposures for Ubuntu Linux as well as driving active hardening in the kernel</li>\n<li>Architecting enhancements to performance and correctness to make Ubuntu Linux the most reliable and highest performing Linux kernel available today</li>\n<li>Streamlining the packaging and distribution of particularly troublesome third-party components for optimal experience by end users</li>\n<li>Developing new means to deliver Ubuntu Linux at scale to the strict quality standards and delivery schedules expected by end users</li>\n</ul>\n<p>While not a formal managerial role, the successful candidate will possess strong people skills and natural ability to lead engineers within the team, as well as working with other external teams to coordinate adoption and delivery.</p>\n<p>While we hesitate to put a specific number of years of experience as a requirement for an applicant as that does not take into account relative ability or circumstances, for a comparative guideline we would be seeking candidates with the demonstrated technical equivalent of 15+ years of industry experience.</p>\n<p><strong>Location:</strong> We have home-based lead kernel roles in every timezone, although the individual aspects as listed above may be linked to a specific geographic region.</p>\n<h2><strong>What your day will look like</strong></h2>\n<ul>\n<li>Set the technical direction and lead the delivery of a team of junior and mid-career engineers for a key aspect of Ubuntu Linux</li>\n<li>Work closely with management within and outside the team to track and coordinate initiatives to delivery</li>\n<li>Collaborate daily with other senior technical leadership on the Kernel Team on how best to ensure Ubuntu stays at the pinnacle of Linux distributions</li>\n</ul>\n<h2><strong>What we are looking for in you</strong></h2>\n<ul>\n<li>Well-organised and motivated self-starter able to thrive in a remote work environment</li>\n<li>Strong communication skills in English, both written and verbal</li>\n<li>Expert understanding of the C programming language</li>\n<li>Demonstrated expertise working in a *nix-based operating system kernel and distribution. While direct Linux experience would be ideal, it is not mandatory.</li>\n<li>Python and Bash scripting ability</li>\n<li>Powerful grasp of the capabilities and nuances of the git version control system</li>\n<li>Ability to travel internationally at least twice a year for company events of up to two weeks length</li>\n</ul>\n<h2><strong>Additional skills that you might also bring</strong></h2>\n<ul>\n<li>Strong background in RTOS and real-time performance analysis</li>\n<li>Prior experience with Ubuntu/Debian/Snap packaging</li>\n<li>Demonstrated experience with kernel patching and debugging</li>\n<li>Strong grasp of device drivers, BSP’s, and other low level system engineering</li>\n</ul>\n<h2><strong>What we offer you</strong></h2>\n<p>We consider geographical location, experience, and performance in shaping compensation worldwide. We revisit compensation annually to ensure we recognise outstanding performance. In addition to base pay, we offer a performance-driven annual bonus. We provide all team members with additional benefits, which reflect our values and ideals. We balance our programs to meet local needs and ensure fairness globally.</p>\n<ul>\n<li>Home-based work environment with twice-yearly team sprints in person</li>\n<li>Personal learning and development budget of USD 2,000 per year</li>\n<li>Annual compensation review</li>\n<li>Recognition rewards</li>\n<li>Annual holiday leave</li>\n<li>Maternity and paternity leave</li>\n<li>Employee Assistance Programme</li>\n<li>Opportunity to travel to new locations to meet colleagues</li>\n<li>Priority Pass, and travel upgrades for long haul company events</li>\n</ul>\n<h2><strong>About Canonical</strong></h2>\n<p>Canonical is a pioneering tech firm at the forefront of the global move to open source. As the company that publishes Ubuntu, one of the most important open source projects and the platform for AI, IoT and the cloud, we are changing the world on a daily basis. We recruit on a global basis and set a very high standard for people joining the company. We expect excellence - in order to succeed, we need to be the best at what we do. Canonical has been a remote-first company since its inception in 2004.​ Working here is a step into the future, and will challenge you to think differently, work smarter, learn new skills, and raise your game.</p>\n<h2><strong>Canonical is an equal opportunity employer</strong></h2>\n<p>We are proud to foster a workplace free from discrimination. Diversity of experience, perspectives, and background create a better work environment and better products.&nbsp;</p>\n<p><a href=\"https://canonical.com/careers/diversity/identity\">Whatever your identity, we will give your application fair consideration.</a></p>\n\n<p>#LI-remote</p><p>Requisition ID: 466</p><p></p>\n    ","tags":"[\"management\",\"engineering\"]","pubDate":"2024-06-09 04:52:24.384","link":"https://canonical.com/careers/6010955","savedDate":"2024-06-09 04:52:24.384","slug":"lead-linux-kernel-engineer-ubuntu-canonical-2523"},{"id":9296030111,"title":"Business Development Representative ","company":"MixRank","image":"https://pbs.twimg.com/profile_images/378800000147745937/0fac42c12b433bbbd53ff3e15cd6fca4_400x400.png","description":"<p>MixRank (YC S11) is a data mining company that was founded in 2011.</p>\n<p>We’re a fully remote company with over 40 teammates all across the world. We have a decade of experience (in making mistakes). We turned profitable over 5 years ago, and have no plans of an exit or getting acquired for the next decade. Our team is exceptionally strong in both engineering and sales. We process over 3 petabytes of data each month, and are (surprisingly) one of the few data companies that own all our hardware and run everything bare-metal.</p>\n<p>Our customers include some of the world’s biggest sales platforms, recruitment solutions, VCs, and PE firms, to startups that just launched in the latest YC batch.</p>\n<p>We’ve worked diligently over the years to build a team and an infrastructure that is helping our customers get the most up-to-date data and help them build their own product, train AI models, or make investment decisions using it. We have everything needed to scale and we’re eager to bring a few BDRs onboard who will show up every day motivated and ready to help us get to the next level.</p>\n<p>The ideal candidate we are looking for is someone who has some experience in building their own target list, creating outbound sequences, knows how to write personalized emails, and doesn’t shy away from experimenting with video, voice, etc, to get qualified accounts interested in our data products.</p>\n<p><strong>About the role</strong></p>\n<p>Reporting directly to the BDR Manager, you will be fully in charge of creating a strong pipeline of qualified accounts for MixRank’s data products. Your role is to set us up for success as we engage with prospects and customers, helping them understand the value of MixRank data products, educating them on potential use cases, and eventually moving them along to a product demo. Our team is remote and works on Eastern Standard Time (EST).</p>\n<p>You can be anywhere and work flexibly — we value results, and not the number of hours you put in.</p>\n<p><strong>What you’ll be doing</strong></p>\n<p>We love setting big goals, and we love coaching you to get there. : )</p>\n<ul>\n<li>Build a $500k ARR pipeline of qualified, closeable business for 2024 and beyond.</li>\n<li>Use MixRank and other tools to generate high-quality outbound copy with app intel, analytics, and key competitive insights.</li>\n<li>Use cold email, LinkedIn, and other channels to reach out to the right decision-makers.</li>\n<li>Staying in the loop on trends within the data industry, build solid knowledge about our data products, and showcase its value to customers.</li>\n<li>Accurate and timely management of all sales activities, pipeline management, and opportunity management within our CRM (Attio).</li>\n</ul>\n<p></p>\n<p><strong>The skills that’ll make you stand out</strong></p>\n<ul>\n<li>1+ years of customer-facing experience (SDR/BDR in a SaaS is a +).</li>\n<li>Prospecting skills (cold emails, social selling, personalized videos) and <strong>exceptional</strong> follow-up skills.</li>\n<li>Familiarity with email sequencing tools and CRM tools such as Smartleads, Attio, Amplemarket, and/or LinkedIn Sales Navigator.</li>\n<li>Highly motivated, self-driven, and Never Give Up mentality</li>\n<li>Proven record of success and hitting KPIs.</li>\n<li>Proactive, collaborative, and <strong>coachable</strong>.</li>\n</ul>\n<p></p>\n<p><strong>How we’ll set you up</strong></p>\n<ul>\n<li>100% remote.</li>\n<li>Competitive salary.</li>\n<li>Set up your own home office with a Remote Office Grant.</li>\n<li>Health and Wellbeing Allowances.</li>\n<li>Personal Development Budget.</li>\n<li>Leave Policy: Take as many days as you need; we recommend at least 15 days a year.</li>\n</ul>\n<p></p>\n<p><strong>Next steps</strong></p>\n<p>If this looks interesting, and you want to apply, please send us answers to the following questions, either via an email or a video to jobs +gtm at <a href=\"http://mixrank.com\" target=\"_blank\">mixrank.com</a> with the subject line “{Your Name} | MixRank BDR 2024”</p>\n<ol>\n<li>One of MixRank’s data products is to provide app intelligence to vendors and technology providers. See here: <a href=\"https://mixrank.com/datasets/mobile-apps-and-sdks/\" target=\"_blank\">https://mixrank.com/datasets/mobile-apps-and-sdks/</a>. If you were pitching MixRank to New Relic, how would your first email be?</li>\n<li>You have a list of 50 leads to contact today. How would you prioritize them? What would your approach be to establish a connection and interest in MixRank?</li>\n<li>Imagine you have successfully scheduled a meeting with a potential client after multiple follow-ups. However, an hour before the meeting, they wish to reschedule it due to an emergency. How would you handle this situation?</li>\n<li>What excites you about starting a career in sales, especially in a tech company like MixRank?</li>\n<li>Sales can be a challenging field with many rejections. How do you handle rejection and maintain your motivation?</li>\n<li>Can you share an experience where you had to work closely within a team to achieve a common goal? What was your role, and how did you handle conflicts, if any?</li>\n<li>We have a culture of continuous learning and improvement at MixRank. How do you ensure you are constantly learning and staying updated in your professional life?</li>\n</ol>\n<p><strong>Things to remember</strong></p>\n<ol>\n<li><strong>Direct applications only.</strong> We strongly prefer receiving applications directly via email. Unfortunately, applications through LinkedIn or other automated hiring platforms may not be processed due to high volumes.</li>\n<li><strong>Originality in applications.</strong> At MixRank, we value originality and a personal touch in applications. While we understand the growing trend of AI assistance, we discourage the use of AI tools like ChatGPT for crafting your application responses. We’re looking for genuine, human-written anecdotes and workflows — AI-generated responses tend to be lackluster and are easy to identify. If you do choose to use AI assistance, please be transparent about it. However, know that priority will be given to applications demonstrating personal effort and original thinking.</li>\n</ol>\n","tags":"[\"management\",\"engineering\"]","pubDate":"2024-06-09 04:52:24.383","link":"https://www.ycombinator.com/companies/mixrank/jobs/le7n0YA-business-development-representative","savedDate":"2024-06-09 04:52:24.383","slug":"business-development-representative-mixrank-4384"},{"id":5529398197,"title":"Full-Stack Web Developer  - Global/Remote","company":"MixRank","image":"https://pbs.twimg.com/profile_images/378800000147745937/0fac42c12b433bbbd53ff3e15cd6fca4_400x400.png","description":"<p>At MixRank, we create B2B SaaS products that enable sales, marketing, finance, and business intelligence teams to accelerate their business with data and insights into their customers. One that provides the most comprehensive database of mobile apps and websites, technographics, companies, and decision makers. It's a platform created with the sole purpose of providing the fastest way for sales reps to build prospect lists, prioritize leads, and contact decision-makers.</p>\n<p>We're looking for remote engineers to build web applications and APIs. The ideal candidate is looking to grow into position of technical leadership in product development.</p>\n<p>Experience with full-stack web development, Python, PostgreSQL, and Linux is required. Competency or interest in data visualization, UI, UX, and design are desired.</p>\n<p>Why Join MixRank? Fully-remote, no HQ office. Team of 32 people across 15+ countries Invested in by Y Combinator, 500 Startups, Mark Cuban. Profitable and growing 50% every year.</p>\n<p>Please include your updated resume when applying for this role.</p>\n","tags":"[\"postgres\",\"Finance\",\"B2B\",\"database\"]","pubDate":"2024-06-09 04:52:24.383","link":"https://www.ycombinator.com/companies/mixrank/jobs/TXvOcDb-full-stack-web-developer-global-remote","savedDate":"2024-06-09 04:52:24.383","slug":"full-stack-web-developer-global-remote-mixrank-211"},{"id":2093363456,"title":"Data Engineer - Global/Remote","company":"MixRank","image":"https://pbs.twimg.com/profile_images/378800000147745937/0fac42c12b433bbbd53ff3e15cd6fca4_400x400.png","description":"<p>At MixRank, we create B2B SaaS products that enable sales, marketing, finance, and business intelligence teams to accelerate their business with data and insights into their customers. One that provides the most comprehensive database of mobile apps and websites, technographics, companies, and decision makers. It's a platform created with the sole purpose of providing the fastest way for sales reps to build prospect lists, prioritize leads, and contact decision-makers.</p>\n<p>We're looking for remote engineers to help with data mining, machine learning/data science, data transformation/ETL, data modeling, database scaling, and more.</p>\n<p>PostgreSQL experience is highly desired (administration, optimization, DDL, etc). Also looking for experience with Python, Linux, Nix, and data mining.</p>\n<p>Why Join MixRank? Fully-remote, no HQ office. Team of 32 people across 15+ countries. Invested in by Y Combinator, 500 Startups, Mark Cuban. Profitable and growing 50% every year.</p>\n<p>Please include your updated resume when applying for this role.</p>\n<p>Thanks,\nKiran</p>\n","tags":"[\"postgres\",\"Finance\",\"B2B\",\"database\"]","pubDate":"2024-06-09 04:52:24.383","link":"https://www.ycombinator.com/companies/mixrank/jobs/SaoXMWj-data-engineer-global-remote","savedDate":"2024-06-09 04:52:24.383","slug":"data-engineer-global-remote-mixrank-2025"},{"id":5418805582,"title":"Junior Software Engineer - Global/Remote","company":"MixRank","image":"https://pbs.twimg.com/profile_images/378800000147745937/0fac42c12b433bbbd53ff3e15cd6fca4_400x400.png","description":"<p>At MixRank, we create B2B SaaS products that enable sales, marketing, finance, and business intelligence teams to accelerate their business with data and insights into their customers. One that provides the most comprehensive database of mobile apps and websites, technographics, companies, and decision makers. It's a platform created with the sole purpose of providing the fastest way for sales reps to build prospect lists, prioritize leads, and contact decision-makers.</p>\n<p>We're looking for remote engineers that have finished school within the last 2 years or will finish in the next 6 months. This is an open-ended entry-level role with mentorship, and diverse opportunities to work on all areas of our product: databases, distributed systems, infrastructure and tooling, data analysis, machine learning, frontend and backend web development, APIs, data mining, data modeling, and more.</p>\n<p>Our code base is very friendly to new contributors. You'll have a fully-functional development environment within hours (fully automated) and be pushing commits on your first day. Deployments to production happen multiple times per day and finish in less than 2 minutes. Effectively all of our codebase is written in Python, SQL, and Javascript/TypeScript. The core technologies you'll need familiarity with to be productive are Python, PostgreSQL, Linux, and Git.</p>\n<p>Why Join MixRank? Fully-remote, no HQ office. Team of 32 people across 15+ countries. Invested in by Y Combinator, 500 Startups, Mark Cuban. Profitable and growing 50% every year.</p>\n<p>Please include your updated resume when applying for this role.</p>\n","tags":"[\"postgres\",\"javascript\",\"typescript\",\"Finance\",\"B2B\",\"database\"]","pubDate":"2024-06-09 04:52:24.383","link":"https://www.ycombinator.com/companies/mixrank/jobs/WdgITmW-junior-software-engineer-global-remote","savedDate":"2024-06-09 04:52:24.383","slug":"junior-software-engineer-global-remote-mixrank-8943"},{"id":2700739107,"title":"Client Onboarding Representative (English & Punjabi)","company":"Bobtail","image":"https://media.licdn.com/dms/image/D4E0BAQGvUyfPVBWDyg/company-logo_200_200/0/1657595552015?e=2147483647&v=beta&t=EecsDCOy3Fh_26M1noQDDIYw8-JuGKz_d1JDvcBZ-yI","description":"\n    \n\n    <h2>About Bobtail</h2>\n<p>Bobtail is dedicated to increasing happiness by eliminating inefficiencies in the supply chain.&nbsp; We envision a supply chain without friction, fraud, waste, and abuse where companies succeed based on the value they create.&nbsp;&nbsp;</p>\n<p>We work in a unique way at Bobtail, where we value teams over individuals and encourage experimentation and iteration to constantly improve.&nbsp; Teams are given flexibility in working towards a shared purpose and given the freedom to decide how they will accomplish their goals.&nbsp;&nbsp;</p>\n<p>If you are an out of the box thinker that takes a proactive approach in collaborating with others to solve problems and achieve your goals - we would love to talk to you.&nbsp;&nbsp;</p>\n<p>The things we value:</p>\n<ol>\n<li>Mission</li>\n<li>Teams over individuals</li>\n<li>Collaboration</li>\n<li>Communication</li>\n<li>Iteration</li>\n<li>Experimentation and failing fast</li>\n<li>Initiative and solutions oriented approach</li>\n<li>Documentation</li>\n<li>Data</li>\n<li>Mental health and work life balance</li>\n<li>Diversity</li>\n<li>Transparency</li>\n</ol>\n<h2>You should apply if you have:</h2>\n<ul>\n<li>Customer success and onboarding experience (2/3 years minimum)</li>\n<li>Possess excellent verbal and written communication skills</li>\n<li>Time management and multitasking skills in order to handle multiple tasks and clients at once</li>\n<li>Strong organizational skills and attention to detail</li>\n<li>Capable of prioritizing tasks/requests to meet the client &amp; company needs</li>\n<li>Ability to work independently and as part of a team</li>\n<li>Problem-solving skills and the ability to think critically under pressure</li>\n</ul>\n<p><span style=\"font-weight: 400;\"><br><br></span></p>\n<h2>You will be responsible for:</h2>\n<ul>\n<li>Serve as the primary point of contact for new clients during the onboarding process</li>\n<li>Conduct onboarding sessions, including product&nbsp; and training for new clients</li>\n<li>Gather and verify required client information and documentation</li>\n<li>Collaborate with internal teams (sales, Customer success, processing, Etc) to ensure a seamless onboarding experience</li>\n<li>Provide ongoing support and follow-up with clients to address any questions or concerns</li>\n<li>Develop and maintain onboarding materials and resources</li>\n<li>Track and report on onboarding progress, identifying areas for improvement and implementing solutions</li>\n<li>proficiency with CRM software (salesforce)&nbsp; and other onboarding tools</li>\n<li>&nbsp;Communicate with assigned carriers via email, text or phone</li>\n</ul>\n<p><span style=\"font-weight: 400;\"><br><br></span></p>\n<h2>Benefits</h2>\n<ul>\n<li>Monthly Mental Break Day</li>\n<li>Paid Time Off</li>\n<li>Work from home (or wherever)</li>\n<li>Parental leave</li>\n</ul>\n<p>Creating a diverse and inclusive workplace is Bobtail’s nucleus. We are an equal opportunity employer and embrace people of different backgrounds, cultures, religions, national origins, races, colors, genders, gender expressions, sexual orientations, ages, marital status, veteran status, experiences, abilities and perspectives. <br><br></p>\n<p>&nbsp;</p>\n\n    \n\n    \n","tags":"[\"management\"]","pubDate":"2024-06-09 04:52:24.383","link":"https://boards.greenhouse.io/bobtail/jobs/4204778005","savedDate":"2024-06-09 04:52:24.383","slug":"client-onboarding-representative-english-punjabi-bobtail-4186"},{"id":8719420615,"title":" SMB Sales Manager Bilingual - Factoring (Spanish-English)","company":"Bobtail","image":"https://media.licdn.com/dms/image/D4E0BAQGvUyfPVBWDyg/company-logo_200_200/0/1657595552015?e=2147483647&v=beta&t=EecsDCOy3Fh_26M1noQDDIYw8-JuGKz_d1JDvcBZ-yI","description":"\n    \n\n    <h2>About Bobtail</h2>\n<p>Bobtail is dedicated to increasing happiness by eliminating inefficiencies in the supply chain.&nbsp; We envision a supply chain without friction, fraud, waste, and abuse where companies succeed based on the value they create.&nbsp;&nbsp;</p>\n<p>We work in a unique way at Bobtail, where we value teams over individuals and encourage experimentation and iteration to constantly improve.&nbsp; Teams are given flexibility in working towards a shared purpose and given the freedom to decide how they will accomplish their goals.&nbsp;&nbsp;</p>\n<p>If you are an out-of-the-box thinker that takes a proactive approach to collaborating with others to solve problems and achieve your goals - we would love to talk to you.&nbsp;&nbsp;</p>\n<p>The things we value:</p>\n<ol>\n<li>Mission</li>\n<li>Teams over individuals</li>\n<li>Collaboration</li>\n<li>Communication</li>\n<li>Iteration</li>\n<li>Experimentation and failing fast</li>\n<li>Initiative and solutions-oriented approach</li>\n<li>Documentation</li>\n<li>Data</li>\n<li>Mental health and work-life balance</li>\n<li>Diversity</li>\n<li>Transparency<br><br></li>\n</ol>\n<h3><strong>You should apply if you have:</strong></h3>\n<ul>\n<li>Speak both English &amp; Spanish fluently</li>\n<li>Ability to quickly learn in a fast paced environment</li>\n<li>Confidence, as well as strong verbal &amp; written communication skills when interacting with clients</li>\n<li>A motivated, driven, self-starter… We love those with grit and accountability!</li>\n<li>Team player, motivator, coach</li>\n<li>Ability to lead and inspire their team</li>\n<li>3-5 years as a manager in SaaS organization</li>\n<li>Previous experience with Salesforce</li>\n<li>Experience in FinTech and/or logistics industry preferred</li>\n</ul>\n<h3><strong><br></strong><strong>You will be responsible for:</strong></h3>\n<ul>\n<li>Play an active role in clearing team and individual impediments in collaboration with the scrum master</li>\n<li>Present senior leadership with sales strategy to expand client base given current conditions</li>\n<li>Regularly create detailed sales forecasts and set expectations for team performance</li>\n<li>Convey sales direction, strategy, and expectations to sales team consistently and clearly - verbally and through documentation</li>\n<li>Lead offshore sales teams in delivering new clients and constantly improving performance</li>\n<li>Improve sales performance through individual coaching and document what you did</li>\n<li>Be constantly creating, updating, and improving documentation of standards for sales best practices</li>\n<li>Celebrate individual and team victories</li>\n<li>Support and facilitate efforts to create positive work culture and sense of community within sales teams</li>\n<li>Stay informed of current sales data (team and individual)</li>\n<li>Track the meeting notes documented by the scrum master</li>\n<li>Research new technologies and tools to support sales team</li>\n<li>Keep informed of agile and scrum best practices in sales</li>\n</ul>\n<h3><strong>Benefits:</strong></h3>\n<ul>\n<li>Monthly Mental Break Day</li>\n<li>Work from home (or wherever)</li>\n<li>Parental leave</li>\n<li>Paid Time Off</li>\n</ul>\n<h5><br>Creating a diverse and inclusive workplace is Bobtail’s nucleus. We are an equal opportunity employer and embrace people of different backgrounds, cultures, religions, national origins, races, colors, genders, gender expressions, sexual orientations, ages, marital status, veteran status, experiences, abilities, and perspectives</h5>\n\n    \n\n    \n","tags":"[]","pubDate":"2024-06-09 04:52:24.383","link":"https://boards.greenhouse.io/bobtail/jobs/4310241005","savedDate":"2024-06-09 04:52:24.383","slug":"smb-sales-manager-bilingual-factoring-spanish-english-bobtail-9306"},{"id":4698150310,"title":"Product Manager, AI [IC4]","company":"Sourcegraph","image":"https://pbs.twimg.com/profile_images/1428393724527190022/4mt5PACL_400x400.png","description":"\n    <div class=\"content-intro\"><h3>ALL SOURCEGRAPH ROLES ARE FULLY REMOTE</h3>\n<h2><strong><span style=\"color: #a112ff;\">Who we are</span></strong></h2>\n<p>Our mission at Sourcegraph is to make it so that&nbsp;<a class=\"c-link\" href=\"https://sourcegraph.notion.site/Mission-values-e9d37e6b972a4ef395c3076aea2bd07d\" target=\"_blank\" data-stringify-link=\"https://handbook.sourcegraph.com/strategy-goals/strategy\" data-sk=\"tooltip_parent\">everyone can code</a>, not just ~0.1% of the population. Our code graph powers Cody, the most powerful and accurate AI coding assistant, as well as our Code Search product, which helps devs explore their entire codebase and make large-scale migrations and security fixes. We’re building software that builds software, and in doing so we’re making devs more productive and preparing for a world where a lot more code gets written.</p>\n<p>It’s an exciting time to join Sourcegraph. AI has taken over the world, and we’ve spent the last 10 years building infrastructure that’s integral to making AI generated code more powerful and accurate. Our customers include 4/5 FAANG companies, 4 of the top 10 banks, government organizations, Uber, Plaid, and many other companies building the software that pushes the world forward. We’ve raised $225M at a $2.625B valuation from <a class=\"c-link\" href=\"https://techcrunch.com/2021/07/13/sourcegraph-raises-125m-series-d-on-2-6b-valuation-for-universal-code-search-tool/\" target=\"_blank\" data-stringify-link=\"https://techcrunch.com/2021/07/13/sourcegraph-raises-125m-series-d-on-2-6b-valuation-for-universal-code-search-tool/\" data-sk=\"tooltip_parent\">a16z</a>,&nbsp;<a class=\"c-link\" href=\"https://sourcegraph.com/blog/series-c-with-sequoia/\" target=\"_blank\" data-stringify-link=\"https://about.sourcegraph.com/blog/series-c-with-sequoia/\" data-sk=\"tooltip_parent\">Sequoia</a>,&nbsp;<a class=\"c-link\" href=\"https://www.redpoint.com/companies/sourcegraph/\" target=\"_blank\" data-stringify-link=\"https://www.redpoint.com/companies/sourcegraph/\" data-sk=\"tooltip_parent\">Redpoint</a>,&nbsp;<a class=\"c-link\" href=\"https://medium.com/craft-ventures/why-we-invested-in-sourcegraph-5ace28317e3d\" target=\"_blank\" data-stringify-link=\"https://medium.com/craft-ventures/why-we-invested-in-sourcegraph-5ace28317e3d\" data-sk=\"tooltip_parent\">Craft</a>&nbsp;and others. We’re making ambitious bets on our future and we’re looking to hire exceptional people to join our team as we make Sourcegraph one of the biggest and most influential companies in the world.</p></div>\n\n    <h2><span style=\"color: rgb(161, 18, 255);\"><strong>Location</strong></span></h2>\n<p>🌎 While we are an all-remote company and hire <a href=\"https://sourcegraph.notion.site/How-we-engage-talent-outside-of-the-US-218f7193695a46cbb1ef39ef9c1f72d4\">almost anywhere</a> in the world, we have a preference for someone to reside in the following locations for this role. However, if you feel qualified, we welcome you to apply regardless of location. No matter what, working hours must overlap with PST for at least 20 hours/week.</p>\n<p><strong>Preferred locations:</strong></p>\n<ul>\n<li>Remote, San Francisco</li>\n</ul>\n<h2><span style=\"color: rgb(161, 18, 255);\"><strong>Why this job is exciting</strong></span></h2>\n<p>Sourcegraph's deep code expertise sits at the heart of Cody’s industry-leading technical capabilities. Our Code AI platform is core to everything we do at Sourcegraph (read more in&nbsp;<a href=\"https://www.notion.so/sourcegraph/fe1432bc4f0945a9a133c78acbe04ff5?v=b7fe53afa3d14b4482b77e74a8ecaa92\">our handbook</a>). As the Product Manager for our Code AI Platform, you will be responsible for continuing to push the boundaries of what it means to build an open and universal platform in the age of LLMs. How do we measure the impact of an admin’s LLM choice to their developers user experience? How do we help admins in extremely secure organizations trust our platform? Why would a developer build with our platform over competitors? Ideally, you will define a compelling vision at the center of our unique differentiation, an untapped part of the market, and something our customers are willing to pay for. You will be the go-to for defining a crucial member of our exceptional<a href=\"https://www.notion.so/sourcegraph/Mission-values-e9d37e6b972a4ef395c3076aea2bd07d?pvs=4#0818ae942546415d8db15367a8480f1e\"> high agency</a>, <a href=\"https://www.notion.so/sourcegraph/All-remote-guidelines-4d1270d806294bf4ae6db7ab02911957\">all-remote team</a>, and will help us to achieve ambitious objectives to build a code intelligence platform.</p>\n<p>📅 Within one month, you will…</p>\n<ul>\n<li>You will start building a trusting relationship with your team and peers.</li>\n<li>Spend time learning from customers about why they chose Sourcegraph.</li>\n<li>You will understand the what, why, and how of the projects that your team is working on, how those projects contribute to our company goals, as well as current status, risks, and mitigations.</li>\n<li>Be transparent in your internal and external communication. Sourcegraph is open source, so most discussions are public or in channels where you communicate directly with our customers.</li>\n<li>Maintain the roadmap, backlog, and curate and solicit feedback for the product area.</li>\n</ul>\n<p>📅 Within three months, you will…</p>\n<ul>\n<li>You will have identified differentiated experiences and created a clear roadmap for the engineering team</li>\n<li>Uphold your side of the PM – EM partnership<a href=\"https://www.notion.so/sourcegraph/EPD-Resources-c92cc63f2d63463d91e11a02bebf641c\"> responsibilities</a>.</li>\n<li>Begin to define and track activation metrics</li>\n<li>Gather customer feedback to validate priorities, improve documentation, and define product requirements.</li>\n<li>Your peers are enthusiastic to work with you because you reliably follow-through with your commitments.</li>\n</ul>\n<p>📅 Within six months, you will…</p>\n<ul>\n<li>Add value to the user by surfacing real problems to improve the trial start flow for cloud and self-managed, in-product onboarding and activations, and in-product calls-to-action</li>\n<li>Shown clear value to customers by shipping meaningful value (AI is moving fast, we can’t wait!)</li>\n<li>Unlocked a key differentiated experience via our Code AI Platform.</li>\n<li>You will celebrate the fact that your team has delivered key results in support of their objectives for the year.</li>\n</ul>\n<h2><span style=\"color: rgb(161, 18, 255);\"><strong>About you</strong></span></h2>\n<p>As a Product Manager, you’re the storyteller of the organization, pulling together the story of “why”, and getting people excited about growth and what your team is doing. You collaborate with all parts of the organization to understand our market, our business model and the problems our customers are trying to solve to articulate a growth strategy. You are organized, results driven and provide clarity across the organization and your team, to help inspire focus and reinforce that they are working on the right things. You are constantly curious - wanting to dig into the data, discover optimization opportunities to get our users to value faster. You can identify root causes of friction and devise experiments to address them. You’re empathetic - you bring the voice of the user into every conversation, and hold empathy and understanding for your teammates to align on an experimentation approach that is right.</p>\n<ul>\n<li>5+ years of experience as a Product Manager with a specialization in enterprise SaaS development</li>\n<li>Experience as a software engineer or other technical background, particularly data-centric</li>\n<li>You have relevant domain knowledge and experience in one or more of the following areas: single-tenant cloud products, B2B, SaaS, developer tools, growth, product analytics, and user research</li>\n<li>Experience working with complex products that require integrations or complex implementations</li>\n<li>Your working hours overlap with 8am-5pm <a href=\"https://time.is/PT\">Pacific Time</a> for at least 20 hours per week so we have time to collaborate synchronously when necessary.</li>\n</ul>\n<p>Nice to haves:</p>\n<ul>\n<li>Experience with LLMs and prompt engineering fundamentals</li>\n<li>Recent meaningful coding experience with an LLM-backed coding assistant</li>\n<li>Familiarity with the latest competitive landscape of coding assistants</li>\n<li>Deep experience with at least one major IDE such as VSCode or IntelliJ</li>\n</ul>\n<h2><span style=\"color: rgb(161, 18, 255);\"><strong>Level</strong></span></h2>\n<p>📊 This job is an IC4. You can read more about <a href=\"https://www.notion.so/sourcegraph/Leveling-Guide-0e1b5c76ada64b9caac387f8b7c4fc66\">our job leveling philosophy</a> in our Handbook.</p>\n<h2><span style=\"color: rgb(161, 18, 255);\"><strong>Compensation</strong></span></h2>\n<p><strong>💸 We pay you an above-average salary</strong> because we want to hire the best people who are fully focused on helping Sourcegraph succeed, not worried about paying bills. As an <a href=\"https://sourcegraph.notion.site/Mission-values-e9d37e6b972a4ef395c3076aea2bd07d\">open and transparent</a> company that values <a href=\"https://www.notion.so/sourcegraph/Compensation-Pay-Transparency-at-Sourcegraph-d58d0774f51b4b489d41c3628d30ff8d?pvs=4\">competitive compensation</a>, our compensation ranges are visible to every single Sourcegraph teammate.</p>\n<p>To determine your salary, we use a number of market and data-driven salary sources, along with your location zone, and target the high-end of the range to ensure we’re always paying above market regardless of where you live in the world. Both U.S. and international locations are divided into one of four zones, determined by the cost of labor index for each area. The starting salary for a successful candidate will be based on level, job-related skills, experience, qualifications, and location zone. Please note that these salary ranges may be adjusted in the future.</p>\n<p>💰The target compensation for this role is $208,500.</p>\n<ul>\n<li>Zone 1: $208,500</li>\n<li>Zone 2:$166,800</li>\n<li>Zone 3: $125,100</li>\n<li>Zone 4: $83,400</li>\n</ul>\n<p>Please speak with a recruiter for additional information regarding zone locations.</p>\n<p>📈 In addition to our cash compensation, we offer equity (because when we succeed as a company, we want you to succeed, too) and generous&nbsp;<a href=\"https://sourcegraph.notion.site/Benefits-Perks-dd1da4b6b3a64780abed010a144d34ba\">perks &amp; benefits</a>.</p>\n<h2><span style=\"color: rgb(161, 18, 255);\"><strong>Interview process</strong></span></h2>\n<p><em>Below is the interview process you can expect for this role (you can read more about </em><a href=\"https://sourcegraph.notion.site/Types-of-interviews-f279f080583d49ee9f2c60e30c8cb1f7\"><em>the types of interviews</em></a><em> in our Handbook). It may look like a lot of steps, but rest assured that we move quickly and the steps are designed to help you get the information needed to determine if we’re the right fit for you… Interviewing is a two-way street, after all!&nbsp;</em></p>\n<p>We expect the interview process to take 5.5 hours in total.</p>\n<p><strong>👋 Introduction Stage</strong> - we have initial conversations to get to know you better…</p>\n<ul>\n<li>[30m]<a href=\"https://www.notion.so/sourcegraph/Types-of-interviews-sample-questions-f279f080583d49ee9f2c60e30c8cb1f7?pvs=4#99be5ff628b2414194a0ba79d9f25f13\"> Recruiter Screen</a></li>\n<li>[60m]<a href=\"https://www.notion.so/sourcegraph/Product-Interview-Process-82297583a0464461b6ee0ce9ec04e76a?pvs=4#4a81765044b648e49a2762e1e37877ce\"> Team Collaboration / Resume Deep Dive</a></li>\n</ul>\n<p><strong>🧑‍💻 Team Interview Stage</strong> - we then delve into your experience in more depth and introduce you to members of the team, including cross-functional partners…</p>\n<ul>\n<li>[15m]<a href=\"https://www.notion.so/sourcegraph/Types-of-interviews-sample-questions-f279f080583d49ee9f2c60e30c8cb1f7?pvs=4#1919882c0cf147c487eb1df40db8a694\"> Hiring Manager intro</a></li>\n<li>[45m]<a href=\"https://www.notion.so/sourcegraph/Product-Interview-Process-82297583a0464461b6ee0ce9ec04e76a?pvs=4#4a682171775241f8b08ad3cbdfadc29b\"> Engineering Collaboration</a></li>\n<li>[60m] <a href=\"https://www.notion.so/sourcegraph/Product-Interview-Process-82297583a0464461b6ee0ce9ec04e76a?pvs=4#72d47639962b4887894489792fdd64d0\">Overview of Past Projects</a> (requires preparation)</li>\n</ul>\n<p><strong>🎉 Final Interview Stage </strong>- we move you to our final round, where you gain a better understanding of our business and values holistically…</p>\n<ul>\n<li>[30-60m] Final Hiring Manager Interview</li>\n<li>[30m] <a href=\"https://www.notion.so/sourcegraph/Types-of-interviews-sample-questions-f279f080583d49ee9f2c60e30c8cb1f7?pvs=4#e3a04291743048df87541a88aa8199dd\">Values</a></li>\n<li>We check references and conduct your background check</li>\n</ul>\n<p>Please note - you are welcome to request additional conversations with anyone you would like to meet, but didn’t get to meet during the interview process.</p>\n\n    \n\n    <div class=\"content-conclusion\"><h2><strong><span style=\"color: #a112ff;\">Not sure if this is you?</span></strong></h2>\n<p><span style=\"font-weight: 400;\">We want a diverse, global team, with a broad range of experience and perspectives. If this job sounds great, but you’re not sure if you qualify, apply anyway! We carefully consider every application, and will either move forward with you, find another team that might be a better fit, keep in touch for future opportunities, or thank you for your time.</span></p>\n<h2><strong><span style=\"color: #a112ff;\">Learn more about us</span></strong></h2>\n<p><span style=\"font-weight: 400;\">To create a product that serves the needs of all developers, we are building a diverse </span><a href=\"https://sourcegraph.notion.site/All-remote-guidelines-4d1270d806294bf4ae6db7ab02911957\"><span style=\"font-weight: 400;\">all-remote team</span></a><span style=\"font-weight: 400;\"> that is </span><a href=\"https://www.notion.so/sourcegraph/7ed54d4ec4624475a4b45619901236d7?v=e06d936c673f46ca8c313a557bd4410f\"><span style=\"font-weight: 400;\">distributed across the world</span></a><span style=\"font-weight: 400;\">. Sourcegraph is an equal opportunity workplace; we welcome people from all backgrounds and communities.&nbsp;</span></p>\n<p><span style=\"font-weight: 400;\">We provide </span><a href=\"https://sourcegraph.notion.site/Compensation-Pay-Transparency-at-Sourcegraph-d58d0774f51b4b489d41c3628d30ff8d?pvs=74\"><span style=\"font-weight: 400;\">competitive compensation</span></a><span style=\"font-weight: 400;\"> and </span><a href=\"https://sourcegraph.notion.site/Benefits-Perks-dd1da4b6b3a64780abed010a144d34ba?pvs=74\"><span style=\"font-weight: 400;\">practical benefits</span></a><span style=\"font-weight: 400;\"> to keep you happy and healthy so that you can do your best work.&nbsp;</span><span style=\"font-weight: 400;\">&nbsp;</span></p>\n<p><span style=\"font-weight: 400;\">Learn more about what it is like to work at Sourcegraph by reading </span><a href=\"https://sourcegraph.notion.site/d7614e3e9dc04c09ac2d42d57f1816e6?v=2a6d426dbae14390b155120b0c029ce0\"><span style=\"font-weight: 400;\">our handbook</span></a><span style=\"font-weight: 400;\">.</span></p>\n<p><span style=\"font-weight: 400;\">We want to ensure Sourcegraph is an environment that suits your working style and empowers you to do your best work, so we are eager to answer any questions that you have about us at any point in the interview process.</span></p>\n<p><span style=\"font-weight: 400;\">Go back to the </span><a href=\"https://about.sourcegraph.com/jobs/\"><span style=\"font-weight: 400;\">careers page</span></a><span style=\"font-weight: 400;\"> for all open positions.</span></p>\n<p>&nbsp;</p>\n<p><em><span style=\"font-weight: 400;\">Sourcegraph participates in <a href=\"https://sourcegraph.notion.site/E-Verify-2ab3286dde3446d6bac2898c83610107\" target=\"_blank\">E-Verify</a> for U.S. Employees</span></em></p></div>\n","tags":"[\"engineering\",\"B2B\"]","pubDate":"2024-06-09 04:52:24.382","link":"https://boards.greenhouse.io/sourcegraph91/jobs/5196192004","savedDate":"2024-06-09 04:52:24.382","slug":"product-manager-ai-ic4-sourcegraph-7285"},{"id":3688855077,"title":"Marketing Generalist (Ex-Founders)","company":"MixRank","image":"https://pbs.twimg.com/profile_images/378800000147745937/0fac42c12b433bbbd53ff3e15cd6fca4_400x400.png","description":"<p>At MixRank, we’ve observed that some of our most successful hires have been ex-founders. We only recently came to this conclusion ourselves, and now want to discover startup founders, who have shut down their company, or are in the chasm before the next venture.</p>\n<p>If you're brimming with a founder's mentality, we're eager to welcome you to our team.</p>\n<h2>About MixRank</h2>\n<p>MixRank (YC S11) is a data mining company that was founded in 2011. We’ve gone through YC, and raised funding from folks like 500 Startups, Mark Cuban and a few other Silicon Valley investors.</p>\n<p>We’re a fully-remote company with over 40 team-mates all across the world. Almost half the team is comprised of data engineers, and the rest are Go-to-Market and Operations.</p>\n<p>We have a decade of experience (in making mistakes). We turned profitable over 5 years ago, and have no plans of an exit or getting acquired for the next decade. Our team is exceptionally strong in both engineering and sales. We process over 3 petabytes of data each month, and are (surprisingly) one of the few data companies that own all our hardware, and run everything bare-metal.</p>\n<p>Our customers include some of the world’s biggest sales platforms, recruitment solutions, VCs and PE firms, to startups that just launched in the latest YC batch.</p>\n<p>To learn more about our work culture, please look to Glassdoor reviews or speak with our (past or present) team members. Please also check out <a href=\"https://mixrank.com/about\" target=\"_blank\">https://mixrank.com/about</a>.</p>\n<h2>What You’ll Do</h2>\n<p>While we don't expect mastery in all, proficiency in <strong>at least one</strong> of the following is crucial:</p>\n<ul>\n<li><strong>Content &amp; SEO</strong>: Initiate and lead our content journey, crafting unique, data-driven content.</li>\n<li><strong>Technical SEO</strong>: Enhance website performance and discoverability, with the willingness to learn and apply new techniques.</li>\n<li><strong>Paid Ads</strong>: Reboot our ad strategy, focusing on branded keywords and conversion optimization.</li>\n<li><strong>CRO &amp; Landing Pages</strong>: Fine-tune our landing pages for better design, mobile optimization, and lead capture.</li>\n<li><strong>Product Marketing</strong>: Deepen customer relationships, providing valuable resources from decision-making to implementation.</li>\n</ul>\n<h3>Here’s the Opportunity</h3>\n<p>Our journey in marketing is just beginning. Prior to our website redesign 2 years ago, we went 5 years without any changes to our homepage. Up until early last year, ~90% of our leads came in via outbound &amp; referrals.</p>\n<p>But over the last 2 years, we’ve done a website redesign, and invested $500/mo into ads. In January 2024, we had 21 inbound leads (with an average ACV of $40k).</p>\n<p>Imagine what we could do if we were actually good at marketing? :)</p>\n<p>Jokes aside, we’re a fiscally conservative company. All our funding money ran out years ago. Since then, we’ve been spending from revenue. And so, we’re conservative in how we’d want to move forward in any new initiative (including marketing). But we’d love for someone to come in, start working within constraints, and help us scale in impact as well as budgets and spends.</p>\n<h2>Who We’re Looking For</h2>\n<ul>\n<li><strong>Flawless English</strong>: Absolutely no compromises here. Both the founders are anal about having clarity of thought and being able to communicate that effortlessly. Our team is fully distributed as well, so 90% of internal communication happens over Slack. As a marketer, that skill needs to extend to customers as well — You need to be great at getting your point across, both in writing and speaking. Imagine crafting a punchy headline or diving deep into a 3,000-word article — that's the range we're talking about.</li>\n<li>Have gone from <strong>0 to 1</strong>, in terms of marketing strategy. We really want someone that understands where we are, and what needs to be done. We’re also at a stage where there’s no one else. So, that means having to roll up your sleeves, and working without needing agencies or even a team (at least initially).</li>\n<li><strong>Highly Self-driven and Accountable</strong>: Here's the deal – we're 100% remote. No daily check-ins or endless meetings. It's mostly you, your goals, and your screen. That means you've got to be the kind of person who can really drive themselves. If you've got a history of working remotely or have demonstrated that you’re very good at managing yourself on a day-to-day basis, you're who we're looking for.</li>\n<li><strong>Long-term Commitment</strong>: MixRank has been around for over a decade. We're small but growing steadily, and we're not planning an exit anytime soon. We're in it for the long game — think long-term projects and steady growth that make a real impact over time. If you're looking to put down roots and really grow with a company, we could be a great fit.</li>\n<li><strong>Hardworking</strong>: This goes without saying, but we like to believe we’re all hard workers, and we want someone with a very similar work ethic. Because we’re a small team, it becomes obvious when someone isn’t pulling their weight because that impacts everyone else on the team. So, we want folks that are able to commit to MixRank during work hours, and follow a strong work ethic.</li>\n<li><strong>Detail-oriented</strong>: How many times do you proof-read something before it gets launched or published? We aim for perfection, and while we know it’s not reasonable to be perfect with every single thing, trying to do so goes a long way in ensuring everything we do is high-quality.</li>\n<li><strong>Project ownership</strong>: You’re capable of taking full ownership of everything you’re working on. Oftentimes, you end up working on projects that may require inputs or even help from other departments. Because of such external dependencies, projects may end up being on hold. The ideal candidate can take on accountability for such projects, and try and complete them without passing over the buck to someone else.</li>\n<li><strong>Resourceful</strong>: Being part of a startup, especially in a team without a dedicated marketing department, means sometimes you've got to get creative. You might find yourself in new territory, where there's no set path. We need someone who sees this as a challenge, not a roadblock. Roll up your sleeves, figure it out, and make things happen.</li>\n<li><strong>Action-biased and Analytical</strong> — there’s plenty to do, but sometimes the next item may not be as obvious. We believe the ideal candidate should always have a backlog of items they need to get to, but end up prioritizing the most significant and most urgent projects, at all times.</li>\n</ul>\n<h2>Compensation &amp; Benefits</h2>\n<ul>\n<li>Our compensation model is based on seniority and location. But being transparent, our current budget will likely not allow us to hire someone in the US full-time. But if you are based in the US and still want to apply, and we both find each other to be very strong fits, we would love to have you on a part-time basis, and evolve that into a full-time opportunity down the line.</li>\n<li>Remote Flexibility: Full freedom to work from anywhere.</li>\n<li>Health Coverage: 100% health (including vision and dental) insurance for you and your immediate family.</li>\n<li>Life Insurance: Ensuring peace of mind for you and your loved ones.</li>\n<li>Unlimited leave policy: Take as much time as you need, but do right by your team-mates.</li>\n<li>Learning and Growth: Unlimited book budget and personal development fund.</li>\n<li>Fitness Grant: Stay healthy and active with our fitness grant.</li>\n<li>Entertainment Perks: Enjoy streaming services with our entertainment grant.</li>\n</ul>\n","tags":"[\"engineering\"]","pubDate":"2024-06-09 04:52:24.382","link":"https://www.ycombinator.com/companies/mixrank/jobs/B4kyHsp-marketing-generalist-ex-founders","savedDate":"2024-06-09 04:52:24.382","slug":"marketing-generalist-ex-founders-mixrank-7469"},{"id":2179737259,"title":"Software Engineer - Global/Remote","company":"MixRank","image":"https://pbs.twimg.com/profile_images/378800000147745937/0fac42c12b433bbbd53ff3e15cd6fca4_400x400.png","description":"<p>MixRank processes petabytes of data every month from web crawls, Google Play Store, Apple App Store, social media, and dozens of other sources. We have hundreds of customers using our data products including Google, Amazon, Facebook, Intel, and Adobe, across industries Sales, Marketing, Finance, and Security.</p>\n<p>Our code base is very friendly to new contributors. You'll have a fully-functional development environment within hours (fully automated) and be pushing commits on your first day. Deployments to production happen multiple times per day and finish in less than 2 minutes. Effectively all of our codebase is written in Python, SQL, and Javascript/TypeScript. The core technologies you'll need familiarity with to be productive are Python, PostgreSQL, Linux, and Git.</p>\n<p>We're hiring generalist software engineers to work on web applications, data mining, machine learning/data science, data transformation/ETL, data modeling, database scaling, infrastructure, devops, and more. We'll cater the role to whatever subset of these areas match your interests.</p>\n<p>Beneficial experience includes PostgreSQL, Python, Linux, TypeScript, Nix, frontend/backend web development, and data mining.</p>\n<p>Why Join MixRank? Fully-remote, no HQ office. Team of 32 people across 15+ countries. Invested in by Y Combinator, 500 Startups, Mark Cuban. Profitable and growing 50% every year.</p>\n<p>Please include your updated resume when applying for this role.</p>\n","tags":"[\"postgres\",\"javascript\",\"typescript\",\"Finance\",\"database\"]","pubDate":"2024-06-09 04:52:24.382","link":"https://www.ycombinator.com/companies/mixrank/jobs/35HrJ61-software-engineer-global-remote","savedDate":"2024-06-09 04:52:24.382","slug":"software-engineer-global-remote-mixrank-2963"},{"id":9277257635,"title":"Sales Enablement Manager ","company":"Timescale","image":"https://pbs.twimg.com/profile_images/1542681228666671107/L5LYJLAD_400x400.png","description":"&lt;p&gt;&lt;span style=&quot;font-weight: 400;&quot;&gt;Timescale is the creator of TimescaleDB, the industry-leading relational database for time-series. Tens of thousands of organizations trust TimescaleDB today with their mission-critical time-series applications. The company is dedicated to serving software developers and businesses worldwide, enabling them to build exceptional data-driven products that &lt;/span&gt;&lt;strong&gt;measure everything that matters&lt;/strong&gt;&lt;span style=&quot;font-weight: 400;&quot;&gt;: software applications, industrial equipment, financial markets, blockchain activity, consumer behavior, machine learning models, climate change, and more. Analyzing data across the time dimension (“time-series data”) enables developers to understand what is happening right now, how that is changing, and why that is changing.&amp;nbsp;&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;The&lt;strong&gt; Sales Enablement Manager &lt;/strong&gt;provides go-to-market leaders,&amp;nbsp; account executives, customer success managers, business development reps, solution architects, and implementation engineers with the learning materials, content, and resources to drive growth and success. Partnering with the sales team, product, and broader enablement team, the sales enablement manager will develop and execute impactful, data-driven solutions for transforming the sales process. Success is measured by the overall business impact of these solutions and cross-functional collaboration.&amp;nbsp; The successful candidate will be a well-organized sales professional who has experience in running similar initiatives and defining them.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Your main responsibilities will include:&lt;/strong&gt;&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;Be a strategic partner for our customers, helping them plan, execute, and succeed with their initial and ongoing usage and growth with Timescaledb.&lt;/li&gt;\n&lt;li&gt;Work with go to market leadership to develop, execute, optimize and assess enablement program&lt;/li&gt;\n&lt;li&gt;Responsible for all aspects of sales foundational and continuing learning programs, including scheduling and coordination, creation and delivery of on-demand courseware and instructor-led training.&lt;/li&gt;\n&lt;li&gt;Responsible for the analysis and tracking of courseware and other sales enablement content.&lt;/li&gt;\n&lt;li&gt;Supports the buying/selling process at all stages, from lead generation to win/loss.&lt;/li&gt;\n&lt;li&gt;Assists frontline sales leaders and sales team members in implementing effective management techniques and establishing a sales coaching program.&lt;/li&gt;\n&lt;li&gt;Determine sales enablement priorities with go to market stakeholders&lt;/li&gt;\n&lt;li&gt;Communicate enablement strategy and KPIs to stakeholders&lt;/li&gt;\n&lt;li&gt;Build a trusted relationship with account executives&lt;/li&gt;\n&lt;li&gt;Serve as a liaison between sales, marketing and product teams&lt;/li&gt;\n&lt;li&gt;Provide effective onboarding and training programs for the go to market team&lt;/li&gt;\n&lt;li&gt;Coordinate educational content for ongoing training&lt;/li&gt;\n&lt;li&gt;Facilitate content creation and use with sales and marketing teams&lt;/li&gt;\n&lt;li&gt;Gather and relay feedback to continuously iterate on the enablement strategy&lt;/li&gt;\n&lt;li&gt;Use performance data to identify knowledge or skill gaps across the sales team&lt;/li&gt;\n&lt;li&gt;Maintain sales enablement software to ensure it is easily accessible and providing the capabilities sellers need&lt;/li&gt;\n&lt;li&gt;Be curious, always willing to learn, and always looking for ways to improve our products, processes, and culture&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;&lt;strong&gt;What You&#39;ll Have:&lt;/strong&gt;&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;4+ years experience in a high-performance sales organization in sales, enablement, or learning and development&lt;/li&gt;\n&lt;li&gt;A strong understanding of the sales environment, including sales content, sales methodologies (MEDDIC), tools and training, buyer’s journey alignment, and modern sales processes&lt;/li&gt;\n&lt;li&gt;Experience with project management from conception to completion, content management and learning management systems&lt;/li&gt;\n&lt;li&gt;Able to build internal relationships with sales, marketing, product&lt;/li&gt;\n&lt;li&gt;Excellent communication skills&lt;/li&gt;\n&lt;li&gt;Fast learner&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;&lt;strong&gt;Other Things that Will Help:&lt;/strong&gt;&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;Highly motivated to achieve results.&lt;/li&gt;\n&lt;li&gt;A strong sense of curiosity and a willingness to wade into the unknown and learn as you go&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;&lt;strong&gt;Working at Timescale🐯&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span style=&quot;font-weight: 400;&quot;&gt;Timescale is breaking boundaries and setting new standards in the innovating and rapidly growing time-series data industry. Built on the foundation of people-focused values and principles, Timescale makes sure integrity, mutual respect, and compassion is at the heart of everything we do. Empowered by our Co-Founders, Ajay Kulkarni (CEO) and Mike Freedman (CTO), we are challenging the norm by working with people who continuously inspire and teach us 🤝. &lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span style=&quot;font-weight: 400;&quot;&gt;Timescale is a remote-first company with a global🌎 workforce and is backed by Tiger Global, Benchmark Capital, New Enterprise Associates, Redpoint Ventures, Icon Ventures, Two Sigma Ventures, and other leading investors. For more information, visit www.timescale.com or follow @TimescaleDB.&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span style=&quot;font-weight: 400;&quot;&gt;Enjoy debating the crunch-factor of different chicken nuggets 🍗, sweating it out during lunch 💦, talking about your kids, whether they be actual children 👶🏽, potted plants 🪴, or four-legged creatures 🐾? You’ll fit right in at Timescale!&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;What we’re offering&lt;/strong&gt;&lt;/p&gt;\n&lt;ul&gt;\n&lt;li style=&quot;font-weight: 400;&quot;&gt;&lt;span style=&quot;font-weight: 400;&quot;&gt;Flexible PTO and family leave&lt;/span&gt;&lt;/li&gt;\n&lt;li style=&quot;font-weight: 400;&quot;&gt;&lt;span style=&quot;font-weight: 400;&quot;&gt;Summer Fridays off in August ☀️&lt;/span&gt;&lt;/li&gt;\n&lt;li style=&quot;font-weight: 400;&quot;&gt;&lt;span style=&quot;font-weight: 400;&quot;&gt;Full remote work from almost &lt;/span&gt;&lt;em&gt;&lt;span style=&quot;font-weight: 400;&quot;&gt;anywhere&lt;/span&gt;&lt;/em&gt;&lt;/li&gt;\n&lt;li style=&quot;font-weight: 400;&quot;&gt;&lt;span style=&quot;font-weight: 400;&quot;&gt;Stock options&lt;/span&gt;&lt;/li&gt;\n&lt;li style=&quot;font-weight: 400;&quot;&gt;&lt;span style=&quot;font-weight: 400;&quot;&gt;Monthly WiFi stipend&lt;/span&gt;&lt;/li&gt;\n&lt;li style=&quot;font-weight: 400;&quot;&gt;&lt;span style=&quot;font-weight: 400;&quot;&gt;Professional development &amp;amp; educational benefits&lt;/span&gt;&lt;/li&gt;\n&lt;li style=&quot;font-weight: 400;&quot;&gt;&lt;span style=&quot;font-weight: 400;&quot;&gt;Premium insurance options for you and your family &lt;/span&gt;&lt;em&gt;&lt;span style=&quot;font-weight: 400;&quot;&gt;(US employees)&lt;/span&gt;&lt;/em&gt;&lt;/li&gt;\n&lt;li style=&quot;font-weight: 400;&quot;&gt;&lt;span style=&quot;font-weight: 400;&quot;&gt;FSA/Dependent FSA plans &lt;/span&gt;&lt;em&gt;&lt;span style=&quot;font-weight: 400;&quot;&gt;(US employees)&lt;/span&gt;&lt;/em&gt;&lt;/li&gt;\n&lt;li style=&quot;font-weight: 400;&quot;&gt;401(k) retirement plan &lt;em&gt;(US employees)&lt;/em&gt;&lt;/li&gt;\n&lt;/ul&gt;&lt;div class=&quot;content-conclusion&quot;&gt;&lt;p&gt;By applying for this position, you are agreeing to &lt;a href=&quot;https://www.timescale.com/legal/timescale-applicant-privacy-notice&quot;&gt;Timescale&#39;s Applicant Privacy Notice.&amp;nbsp;&lt;/a&gt;&lt;/p&gt;&lt;/div&gt;","tags":"[\"management\",\"legal\",\"database\"]","pubDate":"2024-06-09 04:52:24.381","link":"https://www.timescale.com/careers/7470866002?gh_jid=7470866002","savedDate":"2024-06-09 04:52:24.381","slug":"sales-enablement-manager-timescale-7388"},{"id":9597438660,"title":"Sr. Product Marketing Manager","company":"Timescale","image":"https://pbs.twimg.com/profile_images/1542681228666671107/L5LYJLAD_400x400.png","description":"&lt;p&gt;&lt;strong&gt;Sr. Product Marketing Manager&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;We are looking for a Sr. Product Marketing Manager to help us take our category-defining PostgreSQL database platform to market. This person will be responsible for equipping our sales and marketing teams with the tools, resources, and knowledge they need to effectively communicate the value of Timescale&#39;s products to our customers.&lt;/p&gt;\n&lt;p&gt;The ideal candidate will have a strong background in working with technical products, particularly developer tools, the ability to craft compelling narratives that resonate with developers and business buyers, and extensive experience in sales and marketing enablement.&lt;/p&gt;\n&lt;p&gt;&lt;em&gt;This role is remote, and English language fluency is a requirement.&amp;nbsp;&lt;/em&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Responsibilities&lt;/strong&gt;&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;Develop and execute the sales enablement strategy, including writing and organizing our sales enablement materials and rolling them out to our sales team.&lt;/li&gt;\n&lt;li&gt;Develop buyer personas and customer segments and adapt our product positioning for different audiences.&lt;/li&gt;\n&lt;li&gt;Work with our amazing customers to create customer success stories.&lt;/li&gt;\n&lt;li&gt;Research and stay informed about industry trends, competitor activities, and customer needs to shape effective sales strategies.&lt;/li&gt;\n&lt;li&gt;Collect and analyze data that supports our solutions in the market to buyers.&lt;/li&gt;\n&lt;li&gt;Collaborate with product management, sales, and marketing teams to ensure messaging, positioning, and go-to-market activities alignment.&lt;/li&gt;\n&lt;li&gt;Find our customer advocates through relationships with sales reps and via social media, then nurture them and help them promote our cause.&lt;/li&gt;\n&lt;li&gt;Work closely with the demand generation team to develop campaigns that support sales objectives.&lt;/li&gt;\n&lt;li&gt;Use data (including social media experiments, user research, market insights, and product understanding) to hone messaging, identify the best go-to-market strategies, and segment the market most effectively.&amp;nbsp;&lt;/li&gt;\n&lt;li&gt;Partner with sales to run win/loss analysis and identify improvements across product, marketing, and sales to increase our win rate.&lt;/li&gt;\n&lt;li&gt;Work with marketing and product to write compelling content (e.g. blogs, website copy) for our audience.&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;&lt;strong&gt;Experience and Skills&lt;/strong&gt;&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;5+ years of product marketing experience, focusing on sales and marketing enablement. At least two years of experience with &lt;strong&gt;technical products for developers&lt;/strong&gt;.&lt;/li&gt;\n&lt;li&gt;3+ years of experience working remotely with a globally distributed team.&lt;/li&gt;\n&lt;li&gt;Proven track record of developing and executing successful sales enablement programs.&lt;/li&gt;\n&lt;li&gt;&lt;strong&gt;Entrepreneurial mindset&lt;/strong&gt; with a strong sense of ownership, urgency, and problem-solving skills - Timescale is moving fast, and so should you. Trying things, making mistakes, and quickly improving are in our DNA.&lt;/li&gt;\n&lt;li&gt;Excellent written and verbal communication skills, with the ability to convey complex technical concepts clearly and compellingly to both internal and target customer audiences.&lt;/li&gt;\n&lt;li&gt;Ability to work collaboratively in a fast-paced, cross-functional environment.&lt;/li&gt;\n&lt;/ul&gt;&lt;div class=&quot;content-conclusion&quot;&gt;&lt;p&gt;By applying for this position, you are agreeing to &lt;a href=&quot;https://www.timescale.com/legal/timescale-applicant-privacy-notice&quot;&gt;Timescale&#39;s Applicant Privacy Notice.&amp;nbsp;&lt;/a&gt;&lt;/p&gt;&lt;/div&gt;","tags":"[\"postgres\",\"management\",\"legal\",\"database\"]","pubDate":"2024-06-09 04:52:24.381","link":"https://www.timescale.com/careers/7028461002?gh_jid=7028461002","savedDate":"2024-06-09 04:52:24.381","slug":"sr-product-marketing-manager-timescale-2803"},{"id":6232385722,"title":"Partnerships Manager","company":"SafetyWing","image":"https://pbs.twimg.com/profile_images/1177267684574208000/54eG3WmW_400x400.jpg","description":"<h2>🧘 What we offer</h2> <ul><li><!--block-->Fully remote work environment – work from anywhere globally.&nbsp;</li><li><!--block-->Competitive compensation.</li><li><!--block-->Global coverage with Remote Health and Nomad Insurance.</li><li><!--block-->A minimum of 20 days of compensated time off each year.</li><li><!--block-->Referral bonus - an incentive program rewarding you for helping us find exceptional talent to join our team.</li><li><!--block-->Opportunity to unlock more benefits as your tenure with SafetyWing grows.</li><li><!--block-->We are looking forward to hearing from you!</li></ul><div><!--block--><br></div> <div><!--block--><strong>SafetyWing</strong> (YC W18) seeks a <strong>Partnerships Manager (YouTube)</strong>&nbsp; to support our growing Partnerships team and our network of Ambassadors with care and personalized attention as we scale the program.<br><br></div><div><!--block-->Partnerships with affiliates and content creators have successfully supported the tremendous growth of SafetyWing since the launch of the Nomad Insurance product in 2019.<br><br></div><div><!--block-->Our influencer program (the ambassador program) was created in-house and designed according to our unique values of authenticity and simplicity. As a result, it became the most strategic growth channel for Nomad Insurance, accounting for more than 35% of sales.</div> <h2>💻 Your responsibilities will include</h2>  <ul><li><!--block-->Identifying the best YouTube creators that could fit our affiliate program well.</li><li><!--block-->Reaching out to these creators using genuine outreach/messaging.</li><li><!--block-->Signing up ambassadors through 1:1 calls and pitch presentations.</li><li><!--block-->Helping them create the first piece of content that includes SafetyWing products.</li><li><!--block-->Allocating budgets and crafting creative briefs for sponsored campaigns.</li><li><!--block-->Monitoring the results from both the outreach efforts and the Ambassadors’ successes.</li><li><!--block-->Helping in finding creative ways to scale the acquisition of quality ambassadors for SafetyWing.</li></ul> <h2>🧪 We are looking for someone who</h2> <ul><li><!--block-->Has experience and a strong interest in developing in the sales/partnerships field.</li><li><!--block-->Has hands-on experience working with YouTube content creators.</li><li><!--block-->Has experience working autonomously and understands remote work specifics.</li><li><!--block-->Has excellent written and verbal communication skills.</li><li><!--block-->Understands influence marketing, blogging and SEO.</li><li><!--block-->Has a “go-getter attitude”: an entrepreneurial spirit who creatively solves problems and works independently.</li></ul><div><!--block--><strong>😀 We like to work with people who:</strong></div><ul><li><!--block-->Want to help build a global social safety net on the Internet.</li><li><!--block-->Think for themselves instead of copying others.</li><li><!--block-->Are willing to try new things, even with the risk of failure.</li><li><!--block-->Are intellectually curious and open to new ideas.</li><li><!--block-->Are creative and bold in the face of any problems.</li><li><!--block-->Have strong integrity and do the right thing.</li></ul><div><!--block--><br></div>","tags":"[]","pubDate":"2024-06-09 04:52:24.380","link":"https://safetywing.pinpointhq.com/en/jobs/188488","savedDate":"2024-06-09 04:52:24.380","slug":"partnerships-manager-safetywing-1578"},{"id":7697652435,"title":"Elixir Engineer","company":"Supabase","image":"https://pbs.twimg.com/profile_images/1651226564728700928/h0tz5UT1_400x400.jpg","description":"\n    <div class=\"content-intro\"><p><img src=\"https://pbs.twimg.com/media/FIdU8GJWQAUGWRA?format=jpg&amp;name=small\" alt=\"Join Supabase\" width=\"680\" height=\"453\"></p></div>\n\n    <p>Supabase is an open source and fully remote company building developer tools for databases. We are seeking backend Elixir experts.</p>\n<h3>About Elixir at Supabase</h3>\n<p><a href=\"https://github.com/supabase/realtime\">Supabase's Realtime server</a> is written in Elixir and manages broadcasting database updates to thousands of connected clients for Supabase customers. We starting to work on our next iteration of Realtime, which includes <a href=\"https://multiplayer.dev/\">Multiplayer</a> functionality, like <a href=\"https://supabase.com/blog/2022/04/01/supabase-realtime-with-multiplayer-features\">Presence and Broadcasts</a>.</p>\n<p>Supabase recently acquired <a href=\"https://logflare.app/\">Logflare</a> which is written in Elixir. Logflare handles almost two billion log events per day and is growing rapidly. Logflare also serves SQL queries allowing Supabase customers to query and visualize structured Postgres and infrastructures logs.</p>\n<p>Elixir is powering more and more backend functionality at Supabase and we need your help!</p>\n<h3><strong>You will</strong></h3>\n<ul>\n<li style=\"font-weight: 400;\"><span style=\"font-weight: 400;\">Support ongoing Elixir projects and developers with a deep understanding of the Erlang VM.</span></li>\n<li style=\"font-weight: 400;\"><span style=\"font-weight: 400;\">Build out custom observability infrastructure to support daily operations of thousands of Postgres databases.</span></li>\n<li style=\"font-weight: 400;\"><span style=\"font-weight: 400;\">Build high throughput and robust data pipelines.</span></li>\n<li style=\"font-weight: 400;\"><span style=\"font-weight: 400;\">Build programmatic interfaces (REST, gRPC, or other messaging protocols) for managing Postgres.</span></li>\n</ul>\n<h3><strong>You are</strong></h3>\n<ul>\n<li style=\"font-weight: 400;\"><span style=\"font-weight: 400;\">You've built and scaled large multi-node Elixir or Erlang systems.</span></li>\n<li style=\"font-weight: 400;\"><span style=\"font-weight: 400;\">String and binary parsing experience preferred.</span><span style=\"font-weight: 400;\"><br><br></span></li>\n</ul>\n<h3><strong>We offer:</strong></h3>\n<ul>\n<li style=\"font-weight: 400;\"><span style=\"font-weight: 400;\">100% remote work from anywhere in the world. No location-based adjustment to your salary.</span></li>\n<li style=\"font-weight: 400;\"><span style=\"font-weight: 400;\">Autonomous work. We work collaboratively on projects, but you set your own pace.</span></li>\n<li style=\"font-weight: 400;\"><span style=\"font-weight: 400;\">Health, Vision and Dental benefits. Supabase covers 100% of the cost for employees and 80% for dependants</span></li>\n<li style=\"font-weight: 400;\"><span style=\"font-weight: 400;\">Generous Tech Allowance for any office setup you need</span></li>\n<li style=\"font-weight: 400;\"><span style=\"font-weight: 400;\">Annual Education Allowance</span></li>\n<li style=\"font-weight: 400;\"><span style=\"font-weight: 400;\">Annually run off-sites.</span></li>\n</ul>\n<p>&nbsp;</p>\n\n    \n\n    <div class=\"content-conclusion\"><h3>BUILD IN A WEEKEND. SCALE TO BILLIONS</h3>\n<p>Supabase adds auth, realtime, and restful APIs to Postgres without a single line of code.</p>\n<p>Each project within Supabase is an isolated&nbsp;Postgres cluster, allowing customers to scale independently, while still providing the features that you need to build: instant database setup, auth, row level security, realtime data streams, auto-generating APIs, and a simple to use web interface.</p>\n<p>We are a fully remote company.</p>\n<p>Key Tech: Javascript, Typescript, Go, Elixir, PostgREST (haskell), Postgres, Pulumi.</p>\n<h3><a id=\"about-the-team\" class=\"anchor\"></a>About the team</h3>\n<ul>\n<li>We're a startup. It's unstructured.</li>\n<li>Collectively founded more than a dozen venture-backed companies.</li>\n<li>More than 10 different nationalities.</li>\n<li>We deeply believe in <a href=\"https://supabase.com/blog/2022/03/25/should-i-open-source-my-company\" target=\"_blank\">the efficacy of collaborative open source</a>. We support existing communities and tools, rather than building \"yet another xx\".</li>\n<li>We \"dogfood\" everything. If you use it in your project, we use it in Supabase.</li>\n</ul>\n<h2><a id=\"process\" class=\"anchor\"></a>Process</h2>\n<ul>\n<li>The entire process is fully remote and all communication will happen over email or via video chat.</li>\n<li>Once you've submitted your application, the team will review your submission, and may reach out for a short screening interview over video call.</li>\n<li>If you pass the screen you will be invited to up to four follow up interviews. The calls:\n<ul>\n<li>usually take between 20-45 minutes each depending on the interviewer.</li>\n<li>are all 1:1.</li>\n<li>will be with both founders, a member of either the growth or engineering team (depending on the role), and usually one other person from your immediate team or function.</li>\n</ul>\n</li>\n<li>Once the interviews are over, the team will meet to discuss several roles and candidates and may:\n<ul>\n<li>ask one or two follow-up questions over email or a quick call.</li>\n<li>go directly to making an offer.</li>\n</ul>\n</li>\n</ul>\n<h2>&nbsp;</h2></div>\n","tags":"[\"postgres\",\"pulumi\",\"javascript\",\"typescript\",\"elixir\",\"engineering\",\"database\"]","pubDate":"2024-06-09 04:52:24.378","link":"https://boards.greenhouse.io/supabase/jobs/5182662004","savedDate":"2024-06-09 04:52:24.378","slug":"elixir-engineer-supabase-4132"},{"id":1948125270,"title":"Product Marketer","company":"SafetyWing","image":"https://pbs.twimg.com/profile_images/1177267684574208000/54eG3WmW_400x400.jpg","description":"<h2>🧘 What we offer</h2> <ul><li><!--block-->Fully remote work environment – work from anywhere globally.&nbsp;</li><li><!--block-->Competitive compensation.</li><li><!--block-->Global coverage with Remote Health and Nomad Insurance.</li><li><!--block-->A minimum of 20 days of compensated time off each year.</li><li><!--block-->Referral bonus - an incentive program rewarding you for helping us find exceptional talent to join our team.</li><li><!--block-->Opportunity to unlock more benefits as your tenure with SafetyWing grows.</li></ul><div><!--block-->We are looking forward to hearing from you!</div> <div><!--block--><strong>SafetyWing (YC W18)</strong> is seeking a <strong>Product Marketer </strong>who will streamline our marketing strategies to enhance the success of our insurance products. In this role, you will dive into market research, craft compelling messaging, oversee product launches, and develop tools to boost customer acquisition and retention. Your efforts will ensure our audience understands and values our products, directly contributing to our growth.&nbsp;</div><div><!--block--><br></div><div><!--block-->We are on a mission to remove the role of geographical borders as a barrier to equal opportunities and freedom for everyone. And we are doing that by creating simple health, insurance, and retirement products for remote workers worldwide as a replacement for national welfare systems.</div><div><!--block--><br></div> <h2>💻 Your responsibilities will include</h2>  <ul><li><!--block-->Talking to our customers to find out why they buy our products and keeping an eye on market trends.</li><li><!--block-->Crafting clear and engaging messages that resonate with our diverse audience.</li><li><!--block-->Leading efforts to track and refine our growth, making data-driven suggestions for enhancements.</li><li><!--block-->Ensuring that both our team and customers have a deep understanding and appreciation of our product.</li><li><!--block-->Managing our website in collaboration with the design team to ensure it reflects our core messaging.</li><li><!--block-->Coordinating the launch of new features and product updates, prioritizing alignment with our product's core principles.&nbsp;</li><li><!--block-->Crafting marketing tools like web pages and ads to attract and keep customers, always seeking ways to do it better.</li><li><!--block-->Collaborating with customer success to proactively tackle customer issues and refine their experience.</li><li><!--block-->Leveraging your deep understanding of our product principles to make wise decisions, especially in managing projects and product launches.</li></ul> <h2>🧪 We are looking for someone who</h2> <ul><li><!--block-->Has a background in product marketing.</li><li><!--block-->Is passionate about creating strategies that resonate with target audiences.</li><li><!--block-->Is a team player who's eager to collaborate across functions to achieve shared goals.</li><li><!--block-->Is an innovative thinker, always looking for new ways to engage customers and improve their experience with our products.</li><li><!--block-->Has a strong ability to communicate complex ideas simply and attractively.</li><li><!--block-->Is driven by data to make decisions and improve product positioning.</li></ul><div><!--block--><strong>😀 We like to work with people who:</strong></div><ul><li><!--block-->Want to help build a global social safety net on the Internet.</li><li><!--block-->Think for themselves instead of copying others.</li><li><!--block-->Are willing to try new things, even with the risk of failure.</li><li><!--block-->Are intellectually curious and open to new ideas.</li><li><!--block-->Are creative and bold in the face of any problems.</li><li><!--block-->Have strong integrity and do the right thing.</li></ul>","tags":"[]","pubDate":"2024-06-09 04:52:24.378","link":"https://safetywing.pinpointhq.com/en/jobs/179044","savedDate":"2024-06-09 04:52:24.378","slug":"product-marketer-safetywing-4619"},{"id":8411798907,"title":"Lead Product Marketing Manager - Fintech","company":"ConsenSys","image":"https://remotive.com/job/1916206/logo","description":"<p><span style='\"font-weight:'>Our mission is to unlock the collaborative power of communities by making Web3 universally easy to use, access, and build on.</span></p>\n<p><span style='\"font-weight:'>Working with Consensys puts you at the </span><strong>forefront of an evolving paradigm</strong><span style='\"font-weight:'>, transforming our society for the better. We fundamentally believe blockchain is the next generation of technology that can lay the foundation for a more just and equitable society. </span></p>\n<p><span style='\"font-weight:'>Blockchain tech is just over 10 years old. Ethereum itself is still a toddler and we’re far from reaching our full potential. You’ll get to work on the tools, infrastructure, and apps that scale these platforms to billions of users. </span></p>\n<p><span style='\"font-weight:'>You’ll be constantly exposed to new concepts, ideas, and frameworks from your peers, and as you work on different projects — challenging you to stay at the </span><strong>top of your game</strong><span style='\"font-weight:'>. You’ll join a network of entrepreneurs and technologists that reaches the </span><strong>edge of our ecosystem</strong><span style='\"font-weight:'>. Consensys alumni have moved on to become tech entrepreneurs, CEOs, and team leads at tech companies.</span><span style='\"font-weight:'> </span></p>\n<p><strong>About </strong><strong>Marketing</strong><span style='\"font-weight:'><br></span></p>\n<p>People at Consensys make work that moves the crypto industry forward, spreading our leading-edge products far and wide into the world and pushing for the adoption of Web3 technology. We’re an ambitious team, using our unique point of view to create work that infiltrates crypto culture, influences mindsets, and pride ourselves on being defiantly optimistic.</p>\n<p><strong><em>We have a very exciting opportunity for an independent Product Marketing Lead who can take on the challenge of bringing to market a new product and scaling it to broader audience.</em></strong></p>\n<p><strong>What you’ll do</strong></p>\n<ul style=\"\">\n<li style=\"\">\n<p><strong>Product positioning and strategy:</strong></p>\n<ul style=\"\">\n<li style=\"\">Together with the Product team, define the long-term vision and strategy for some MetaMask’s new products based on a deep understanding of the market opportunity and trends, user segments and needs, and competitor offerings.</li>\n<li style=\"\">Define and communicate the value proposition by creating compelling messages for our product offerings that resonate with users.</li>\n<li style=\"\">Partner with a cross-functional teams to land product-centric value propositions and messaging on external channels.</li>\n</ul>\n<p><strong>Go-to-market strategy</strong></p>\n<ul style=\"\">\n<li style=\"\">Develop the GTM plan for our evolving offerings, from strategy to execution with support from cross-functional marketing teams.</li>\n<li style=\"\">Understand the most valuable channels to reach and bring the target audience into action. Create relevant collateral to make this happen.</li>\n<li style=\"\">Work with the Growth team to create ongoing life-cycle marketing plans and constantly optimise to reach ambitious targets.</li>\n<li style=\"\">Identify innovative ideas to reach objectives as well as drive cross-product opportunities.</li>\n</ul>\n<p><strong>Other day-to-day activities</strong></p>\n<ul style=\"\">\n<li style=\"\">Diagnose business issues and resolve them through analytical decision-making.</li>\n<li style=\"\">Manage budgets to achieve your business objectives. </li>\n<li style=\"\">Partner with cross-functional teams to bring your GTM to life.</li>\n<li style=\"\">Manage external partnerships.</li>\n</ul>\n</li>\n</ul>\n<p><strong>Would be great if you brought this to the role</strong></p>\n<ul style=\"\">\n<li style=\"\">6+ years of product marketing experience in a FinTech role bringing new financial product offerings to market, focused on driving revenue and customer growth. You are comfortable bringing a product from 0 to 1 and then from 1 to 100.</li>\n<li style=\"\">Experience with building end-to-end go-to-market plans, including crafting compelling positioning, messaging and user-facing content based on insights and learnings to compel users to take an action at various stages of their journey.</li>\n<li style=\"\">Life-cycle marketing focused on a full-funnel approach: from driving awareness to acquisition to retention and loyalty. You are analytical and can translate data into impactful insights to increase success. You can interpret product and market signals, make data-driven decisions to optimize our marketing strategies over time.</li>\n<li style=\"\">Proven experience to bring innovative solutions and ideas to solve complicated challenges.</li>\n<li style=\"\">Identify critical priorities that lead to growth opportunities.</li>\n<li style=\"\">Ability to effectively build cross-functional relationships and work with a large variety of stakeholders as well as motivate diverse teams and functions to produce high-quality outcomes. </li>\n<li style=\"\">Excellent communication skills and an inherently collaborative nature.</li>\n<li style=\"\">At least an intermediate understanding of web3 in either a professional or personal capacity.</li>\n<li style=\"\">Thrive in a fast-paced environment. Things move fast in web3 and also at Consensys.</li>\n</ul>\n<p><strong>Bonus points for: </strong></p>\n<ul style=\"\">\n<li style=\"\">Product Marketing experience in web3. (Extra bonus points for FinTech web3 product marketing experience.)</li>\n<li style=\"\">Experience working with partners for co-marketing opportunities.</li>\n</ul>\n<p><span style='\"font-weight:'>Don't meet all the requirements? Don't sweat it. We’re passionate about building a diverse team of humans and as such, if you think you've got what it takes for our chaotic-but-fun, remote-friendly, start-up environment—apply anyway, detailing your relevant transferable skills in your cover letter. While we have a pretty good idea of what we need, we're ready for you to challenge our thinking on who needs to be in this role</span><span style='\"font-weight:'>.</span></p>\n<p><em><span style='\"font-weight:'>Consensys is an equal opportunity employer. We encourage people from all backgrounds to apply. We are committed to ensuring that our technology is made available and accessible to everyone. All employment decisions are made without regard to race, color, national origin, ancestry, sex, gender, gender identity or expression, sexual orientation, age, genetic information, religion, disability, medical condition, pregnancy, marital status, family status, veteran status, or any other characteristic protected by law. Consensys is aware of fraudulent recruitment practices and we encourage all applicants to review our best practices to protect yourself which can be found (https://consensys.io/careers/best-practices-to-avoid-recruitment-fraud/)</span></em><em><span style='\"font-weight:'>.</span></em></p><div class='\"content-pay-transparency\"'><div class='\"pay-input\"'><div class='\"description\"'><p><em>The salary range for US-based candidates only will be determined throughout the interview process depending on experience and skills.</em></p></div><div class='\"title\"'>US pay range (not including bonus, equity or other benefits)</div><div class='\"pay-range\"'><span>$150,000</span><span class='\"divider\"'>—</span><span>$200,000 USD</span></div></div></div><img src=\"https://remotive.com/job/track/1916206/blank.gif?source=public_api\" alt=\"\"/>","tags":"[\"crypto\",\"go\",\"blockchain\",\"product marketing\",\"Ethereum\",\"partnerships\",\"fintech\",\"infrastructure\"]","pubDate":"2024-06-07 19:20:48.000","link":"https://remotive.com/remote-jobs/marketing/lead-product-marketing-manager-fintech-1916206","savedDate":"2024-06-09 04:52:24.377","slug":"lead-product-marketing-manager-fintech-consensys-5047"},{"id":8203695274,"title":"Technical Support Associate | Vodori","company":"Gt Hq","image":"https://remotive.com/job/1916592/logo","description":"<p style=\"min-height:1.5em\"><strong>GT was founded in 2019 by a former Apple, Nest, and Google executive.</strong> GT’s mission is to connect the world’s best talent with product careers offered by high-growth companies in the UK, USA, Canada, Germany, and the Netherlands.</p><p style=\"min-height:1.5em\">On behalf of <strong>Vodori</strong>, GT is looking for a <strong>Technical Support Associate </strong>interested in <strong>helping customers  achieve success with the software. </strong></p><p style=\"min-height:1.5em\"></p><div class=\"h2\"><strong>About the Client &amp; the Project</strong></div><p style=\"min-height:1.5em\">   Vodori is a SaaS technology company building robust, cloud-based software for life science companies. With strategic partnerships with industry leaders like IQVIA, a robust direct sales model, and a customer base of over 100 diversified life sciences leaders, we are looking for an enthusiastic and collaborative product expert with a passion for delighting customers.</p><p style=\"min-height:1.5em\"></p><div class=\"h2\"><strong>About the Role</strong></div><p style=\"min-height:1.5em\">We are seeking an experienced, self-directed, and technically skilled Technical Support Associate to join our team. Reporting directly to the Technical Support Manager, this role will be pivotal in supporting our customers through efficient problem-solving and technical troubleshooting. The position is ideal for candidates who thrive in dynamic environments and are committed to delivering exceptional customer service.</p><p style=\"min-height:1.5em\"></p><p style=\"min-height:1.5em\"><strong>We may be if you are looking for: </strong></p><ul style=\"\"><li style=\"\"><p style=\"min-height:1.5em\">a company where the work you do every day makes a difference–a difference for our customers, our growing business, and your career; </p></li><li style=\"\"><p style=\"min-height:1.5em\">a company whose mission is to transform lives by empowering life sciences companies to bring their vital drugs, vaccines, medical devices, and diagnostic solutions to market faster;</p></li><li style=\"\"><p style=\"min-height:1.5em\">a company whose culture embraces putting the customer first, being bold and pursuing the unexpected, supporting the team, aspiring to excellence, moving, thinking and acting swiftly, and keeping things simple; and</p></li><li style=\"\"><p style=\"min-height:1.5em\">a company that embodies its midwestern heritage where respect, trust, transparency, and humility are ever-present</p></li></ul><p style=\"min-height:1.5em\"></p><div class=\"h2\"><strong>Responsibilities:</strong></div><ul style=\"\"><li style=\"\"><p style=\"min-height:1.5em\">Engage directly with customers over calls to resolve issues, providing high-level technical troubleshooting and support.</p></li><li style=\"\"><p style=\"min-height:1.5em\">Manage and own incoming customer support requests, ensuring timely and accurate responses through email, chat, and phone/meeting following standard SLAs.</p></li><li style=\"\"><p style=\"min-height:1.5em\">Deeply understand the functionality, market fit and configurable nature of the Vodori product suite.</p></li><li style=\"\"><p style=\"min-height:1.5em\">Perform configuration changes, testing, and other technical services on behalf of customers.</p></li><li style=\"\"><p style=\"min-height:1.5em\">Utilize Zendesk and Jira for tracking and managing escalated support tickets and ongoing technical projects.</p></li><li style=\"\"><p style=\"min-height:1.5em\">Document and relay important customer feedback and technical issues to the product team to help enhance our software solutions.</p></li><li style=\"\"><p style=\"min-height:1.5em\">Collaborate closely with technical and customer success teams to ensure a seamless customer experience.</p></li></ul><div class=\"h2\"><strong>Essential knowledge, skills &amp; experience:</strong></div><ul style=\"\"><li style=\"\"><p style=\"min-height:1.5em\">1-3 years of relevant experience in technical customer support, ideally within a SaaS environment. Entry-level candidates with strong technical acumen are also encouraged to apply.</p></li><li style=\"\"><p style=\"min-height:1.5em\">Highly collaborative and able to work cross-functionally internally and with customers to understand needs and gather requirements.</p></li><li style=\"\"><p style=\"min-height:1.5em\">Proven ability to effectively prioritize work with strong follow-through and attention to detail on the completion of tasks.</p></li><li style=\"\"><p style=\"min-height:1.5em\">Strong understanding of change control principles and experience using Github.</p></li><li style=\"\"><p style=\"min-height:1.5em\">Strong problem-solving skills and ability to manage multiple tasks effectively.</p></li><li style=\"\"><p style=\"min-height:1.5em\">Excellent communication skills, capable of handling customer interactions with empathy and professionalism.</p></li><li style=\"\"><p style=\"min-height:1.5em\">Proficiency in SQL and data analytics with a strong understanding of Excel or Google Sheets, a plus.</p></li></ul><div class=\"h2\"></div><div class=\"h2\"><strong>Interview Steps</strong></div><ol style=\"\"><li style=\"\"><p style=\"min-height:1.5em\">GT interview with Recruiter</p></li><li style=\"\"><p style=\"min-height:1.5em\">Screen interview with Team Lead</p></li><li style=\"\"><p style=\"min-height:1.5em\">Panel interview</p></li><li style=\"\"><p style=\"min-height:1.5em\">Final interview with VP of Customer Success at Vodori<br></p></li></ol><div class=\"h2\"><strong>We go beyond usual perks… By working with us, you will get:</strong></div><ul style=\"\"><li style=\"\"><p style=\"min-height:1.5em\">Health insurance</p></li><li style=\"\"><p style=\"min-height:1.5em\">Lunches coverage</p></li><li style=\"\"><p style=\"min-height:1.5em\">Psychotherapy assistance allowance</p></li><li style=\"\"><p style=\"min-height:1.5em\">Gym allowance</p></li><li style=\"\"><p style=\"min-height:1.5em\">Individual educational budget</p></li><li style=\"\"><p style=\"min-height:1.5em\">18 business days of paid vacation days per year.</p></li><li style=\"\"><p style=\"min-height:1.5em\">Paid sick leaves.</p></li><li style=\"\"><p style=\"min-height:1.5em\">All public holidays are paid days off.</p></li></ul><p style=\"min-height:1.5em\"></p><div class=\"h2\"><strong>GT working model:</strong></div><p style=\"min-height:1.5em\">You will work directly with a client through our Extended Team model. We try to do things differently and put our efforts into integrating you as deeply as possible into the client’s team. You work with the same tools and technologies as they do and are managed directly by the client without any intermediary in between. We help you build relationships and create an environment where you genuinely feel like a member of the client’s team. We also encourage trips to a client and join teambuilding and after-work activities. Our Extended Team model is focused on long-term projects that last over several years.</p><img src=\"https://remotive.com/job/track/1916592/blank.gif?source=public_api\" alt=\"\"/>","tags":"[\"sql\"]","pubDate":"2024-06-07 01:20:58.000","link":"https://remotive.com/remote-jobs/customer-support/technical-support-associate-vodori-1916592","savedDate":"2024-06-09 04:52:24.378","slug":"technical-support-associate-vodori-gt-hq-3900"},{"id":8124018425,"title":"Middle/Senior Data Engineer (remote-only opportunity, location - Europe&CIS)","company":"CloudLinux","image":"https://pbs.twimg.com/profile_images/696718028084482050/ymY3OEPk_400x400.png","description":"<p>We are seeking a Data Engineer who will be joining our dynamic Data Analytics team, a critical division within CloudLinux. </p><p>This team is instrumental in transforming raw data into actionable insights that drive our strategic initiatives and operational efficiencies. We are building the team from scratch so you will have a unique opportunity to apply best practices within the organization. The Data Analytics team is the backbone of CloudLinux’s data strategy, ensuring that we have the right data, at the right time, to make informed decisions.&nbsp;</p><p>CloudLinux is a global remote-first company. We are driven by our principles: Do the right thing, employees first, we are remote first, and&nbsp; we deliver high volume, low-cost Linux infrastructure and security products that help companies to increase the efficiency of their operations. Every person on our team supports each other and does what we can to ensure we all are successful.&nbsp;</p><p>We are truly a great place to work.&nbsp;</p><p>As a Data Engineer, your role will be crucial in enhancing our data infrastructure, implementing data pipelines, and enabling seamless data integration. Your data engineering responsibilities encompass designing, building, installing, and maintaining systems to ensure seamless data flow, availability, and reliability.</p><p><strong>As our Data Engineer, you will be responsible for:</strong></p><ul> <li>Implementing data flows to connect operational systems, data for analytics, and business intelligence (BI) systems;</li> <li>Re-engineering manual data flows to enable scaling and repeatable use;</li> <li>Writing ETL (extract, transform, load) scripts and coding to ensure the ETL process performs optimally;</li> <li>Building accessible data for analysis;</li> <li>Collaborating with data analysts to understand data requirements and deliver relevant datasets;</li> <li>Monitoring data infrastructure for performance and reliability to address issues promptly;</li> <li>Continuously optimizing data architecture to support the company's evolving data needs.</li> </ul><h3>Requirements: </h3><p><strong>To be successful in this role you should have:</strong></p><ul> <li>Minimum of 4 years of proven experience as a Data Engineer;</li> <li>Proficiency in programming languages, such as Python, Java, or Scala;</li> <li>Proficiency in data modeling, database management, data warehousing concepts;</li> <li>Experience with big data technologies (e.g., Hadoop, Spark, Kafka);</li> <li>Familiarity with data warehousing and cloud platforms (e.g., AWS, Azure, or Google Cloud);</li> <li>Proficiency in cloud warehouse technologies (e.g., BigQuery, Snowflake, Amazon Redshift, Databricks);</li> <li>Experience with ClickHouse is a plus;</li> <li>Strong communication and collaboration skills.&nbsp;</li> </ul><h3>Benefits: </h3><p><strong>What's in it for you?</strong></p><ul> <li>A focus on professional development; </li> <li>Interesting and challenging projects</li> <li>Flexible working hours</li> <li>Paid one month vacation per year and unlimited sick leave</li> <li>Medical insurance reimbursement</li> <li>Co-working and gym/sports reimbursement</li> <li>The opportunity to receive a reward for the most innovative idea that the company can patent</li> </ul><p><em>By applying for this position, you agree with </em><a href=\"https://cloudlinux.com/privacy-policy\" rel=\"nofollow noreferrer noopener\" class=\"external\"><em>Cloudlinux Privacy Policy</em></a><em> and give us your consent to maintain and process your personal data with this respect. Please read our Privacy Policy for more information.</em></p>","tags":"[\"management\",\"engineering\",\"database\",\"aws\"]","pubDate":"2024-06-07 00:00:00.000","link":"https://apply.workable.com/cloudlinux-1/j/6FBAB93F8C","savedDate":"2024-06-09 04:52:24.385","slug":"middle-senior-data-engineer-remote-only-opportunity-location-europe-cis-cloudlinux-7407"},{"id":9178974558,"title":"Head of Support","company":"DoubleCloud","image":"https://remotive.com/job/1916681/logo","description":"<p><strong>About DoubleCloud</strong></p>\n<p>At DoubleCloud, we pioneered the first managed ClickHouse service in 2018, which has since grown to serve over 500 customers. Our engineers contribute significantly to leading open-source technologies like ClickHouse, PostgreSQL, Odyssey, and WAL-G. </p>\n<p>Since 2021, we've partnered with more than 100 companies to leverage analytics tools such as ClickHouse, BigQuery, Redshift, MySQL, Postgres, and Kafka. </p>\n<p>Eventually, we've developed a data platform that helps businesses build end-to-end modern data stacks and real-time analytics with fully managed open-source technologies.</p>\n<p> </p>\n<p><strong>About the Role</strong></p>\n<p>We are seeking an enthusiastic and experienced leader to head our globally distributed Technical Support Team. In this role, you will work on existing processes, provide leadership, and foster development for team members. Support is central to our business, and we are looking for someone who shares this passion.</p>\n<p> </p>\n<p><strong>Responsibilities</strong></p>\n<ul style=\"\">\n<li style=\"\"><strong>Process Development</strong>: Manage support team processes, driving continuous improvement through automation, training, and tool enhancements.</li>\n<li style=\"\"><strong>KPI Management</strong>: Take ownership of team KPIs, ensuring consistently high service levels for both the team and our customers.</li>\n<li style=\"\"><strong>Collaboration</strong>: Work with departmental managers and outsourced providers to enhance DoubleCloud's support function, streamlining escalations between levels.</li>\n<li style=\"\"><strong>Knowledge Management</strong>: Oversee Level 2 support's knowledge library, developing and improving our knowledge base.</li>\n<li style=\"\"><strong>Team Building</strong>: Collaborate with the People-Team to hire and onboard new team members for L1 &amp; L2 Support.</li>\n<li style=\"\"><strong>Training &amp; Development</strong>: Build training plans for new team members and conduct regular performance reviews.</li>\n</ul>\n<p> </p>\n<p><strong>Requirements</strong></p>\n<ul style=\"\">\n<li style=\"\"><strong>Experience</strong>: Proven experience in building and leading customer-facing technical support teams.</li>\n<li style=\"\"><strong>Support Processes</strong>: Expertise in establishing and managing support processes such as Ticket Management, Request Management, Problem Management, and Knowledge Base Management.</li>\n<li style=\"\"><strong>Project Management</strong>: Strong project management skills with the ability to handle multiple projects, prioritize tasks, and meet deadlines.</li>\n<li style=\"\"><strong>Availability</strong>: Willingness to be on-call as needed.</li>\n</ul>\n<p> </p>\n<p><strong>Preferred Qualifications</strong></p>\n<ul style=\"\">\n<li style=\"\"><strong>Cloud Experience</strong>: Hands-on experience with AWS, Azure, and/or GCP.</li>\n<li style=\"\"><strong>SaaS/PaaS Knowledge</strong>: Familiarity with platforms like Snowflake, Databricks, MS SQL, and Oracle.</li>\n<li style=\"\"><strong>Open-Source Solutions</strong>: Experience with open-source technologies such as Kafka, Postgres, Elastic, Kubernetes (K8S), and ClickHouse.</li>\n<li style=\"\"><strong>Service Management Tools</strong>: Proficiency with tools like Jira, HubSpot, PagerDuty, etc.</li>\n</ul>\n<p> </p>\n<p><strong>DoubleCloud Culture</strong></p>\n<p>As a team, we work in a startup-like agile rhythm. We help and inspire each other, try new things and learn new lessons. We are here for each other, and we ensure each individual has everything they need to reach their goals. We are here to build the best possible product and want our customers to get the most value of it.</p>\n<p>DoubleCloud is proud to be an equal opportunity employer. Simply put, we do not discriminate which means we treat everyone with respect. Diversity, equity and inclusion are fundamental principles at DoubleCloud. </p>\n<p>We're a global and diverse team full of positive vibes, and we love it that way.</p>\n<p> </p>\n<p><strong>Benefits &amp; Perks</strong></p>\n<p>To reward our employees for the great work they're doing, we offer several perks and benefits, including:</p>\n<ul style=\"\">\n<li style=\"\">Exceptional medical benefits</li>\n<li style=\"\">Paid parental leave </li>\n<li style=\"\">For WFH: Home office expenses reimbursement options </li>\n<li style=\"\">For remote coworking: office space or coworking expenses reimbursement</li>\n<li style=\"\">Flexible vacation and paid sick leaves</li>\n<li style=\"\">Retirement plan</li>\n<li style=\"\">And plenty more…</li>\n</ul>\n<p> </p>\n<p><strong>Interested?</strong></p>\n<p>If you are passionate about leading a dynamic technical support team and driving customer satisfaction, we want to hear from you. Contact us or share this opportunity with someone you think would be a great fit.</p>\n<img src=\"https://remotive.com/job/track/1916681/blank.gif?source=public_api\" alt=\"\"/>","tags":"[\"AWS\",\"azure\",\"cloud\",\"kafka\",\"kubernetes\",\"oracle\",\"postgresql\",\"saas\",\"sql\",\"paas\",\"agile\",\"automation\",\"project management\",\"jira\",\"analytics\",\"GCP\",\"MySQL\",\"technical support\",\"Snowflake\",\"startup\",\"hubspot\",\"diversity\",\"BigQuery\"]","pubDate":"2024-06-06 23:21:14.000","link":"https://remotive.com/remote-jobs/customer-support/head-of-support-1916681","savedDate":"2024-06-09 04:52:24.378","slug":"head-of-support-doublecloud-4655"},{"id":2027355474,"title":"Creative/Script Writer | YouTube Aviation Channel","company":"Electrify Video Partners","image":"https://remotive.com/job/1916919/logo","description":"<p><em>Electrify Video Partners is a dynamic new digital media company that invests in and scales creators with an established YouTube presence. Our mission is to turn creators into global media businesses by building teams, scaling the production and distribution of their content and introducing new revenue streams across platforms. We acquire between 50% and 100% of creator businesses with an established YouTube presence. We have raised multiple funding rounds and have significant existing revenue streams.<br></em></p>\n<p><em>We are building a decentralised global team to power our business and are looking for A-players that share our vision and values and want to play a part in driving the business forward on its exciting journey. Come and build the future of media with Electrify!</em></p>\n<p>Mentour Now is the go-to spot for all things aviation. We dive deep into industry updates, tech breakthroughs, new planes, and even reactions to it all. If you're curious about flying, you're in the right place.</p>\n<p>We are looking for a creative and experienced Creative Writer/Scriptwriter to join our remote digital video team. The ideal candidate will be responsible for writing engaging, informative and accurate scripts for long-form videos related to Aviation.</p>\n<p>This individual should possess a background or some familiarity with aviation, as comprehension of the source material is essential for effective writing. They will work together with the team to turn technical script outlines into well-flowing narratives that tell the story, including crucial details. They will also work closely with the rest of the team to ensure that the videos are informative, entertaining, and visually appealing.</p>\n<div class=\"h2\">Tasks</div>\n<ul style=\"\">\n<li style=\"\">Transform complex technical information into engaging and accessible content for a diverse audience.</li>\n<li style=\"\">Write, revise, and edit scripts for videos with a focus on accuracy and engaging storytelling in collaboration with the team.</li>\n<li style=\"\">Ensure that scripts align with the visual direction of the videos and meet the overall content goals</li>\n<li style=\"\">Dive deep into research and source materials to fill in gaps and enhance storytelling.</li>\n<li style=\"\">Collaborate closely with the team to ensure accuracy and clarity in narratives.</li>\n<li style=\"\">Deliver scripts in a format that can be easily read on a teleprompter</li>\n</ul>\n<div class=\"h2\">Requirements</div>\n<ul style=\"\">\n<li style=\"\">Strong passion for aviation and storytelling, with a deep understanding of both industries.</li>\n<li style=\"\">Proven experience in writing compelling narratives for YouTube videos or similar visual media formats.</li>\n<li style=\"\">A portfolio showcasing writing ability, attention to detail, and ability to communicate complex ideas in a clear and engaging way</li>\n<li style=\"\">Strong project management skills, with the ability to manage multiple projects simultaneously and meet tight deadlines</li>\n<li style=\"\">Excellent communication skills, with the ability to articulate complex ideas in a clear and concise manner</li>\n<li style=\"\">Strong attention to detail and a commitment to producing high-quality content that meets the standards of the YouTube channel</li>\n<li style=\"\">Passionate about educating and Aviation in general.</li>\n<li style=\"\">Demonstrated ability to work collaboratively with creative teams, responding to feedback in a timely fashion</li>\n</ul>\n<div class=\"h2\">Benefits</div>\n<ul style=\"\">\n<li style=\"\">Dynamic environment - We are dedicated to providing a world-class creative culture where our employees can thrive. We’re looking for self-starters with an entrepreneurial mindset who want to be part of our success story. You’ll discover new opportunities, take ownership of important initiatives and learn at a fast pace.</li>\n<li style=\"\">Work anywhere - We are a remote team with employees around the world. This means you are free to work from anywhere with a good internet connection.</li>\n<li style=\"\">Force for good - We believe in leveraging the power of Electrify to change lives and have set up our Creator Foundation. For each established creator that we invest in, we will provide both the cash and production support for an emerging creator to produce and distribute a video that tells an important story linked to one of the United Nations 17 Sustainable Development Goals (SDGs). We actively encourage your involvement in these projects.</li>\n</ul>\n<p>Electrify is an equal opportunity employer committed to fostering an inclusive, innovative environment with the best employees. We provide employment opportunities without regard to age, race, colour, ancestry, national origin, religion, disability, sex, gender identity or expression, sexual orientation, or any other protected status in accordance with applicable law.</p>\n<p><strong>Unfortunately we are unable to respond to all applications, but thank you for your interest and time taken to apply</strong></p>\n<div class=\"h1\">About the company</div>\n<p>Electrify Video Partners is a digital media company that invests in and scales established YouTube channels. Our mission is to turn channels into global media businesses by building teams, scaling the production and distribution of the content and introducing new revenue streams across platforms. We acquire between 50% and 100% of channel businesses. We have raised multiple funding rounds and have existing revenue streams.</p>\n<img src=\"https://remotive.com/job/track/1916919/blank.gif?source=public_api\" alt=\"\"/>","tags":"[\"go\",\"video\",\"project management\",\"research\",\"digital media\",\"youtube\",\"REST\"]","pubDate":"2024-06-06 15:20:20.000","link":"https://remotive.com/remote-jobs/writing/creative-script-writer-youtube-aviation-channel-1916919","savedDate":"2024-06-09 04:52:24.378","slug":"creative-script-writer-youtube-aviation-channel-electrify-video-partners-4134"},{"id":5075584662,"title":"Strategic Pricing Manager","company":"Airalo","image":"https://lever-client-logos.s3.us-west-2.amazonaws.com/55028a36-609c-479c-9553-d4689ff2dd8c-1669620566663.png","description":"<div><b>About Airalo</b></div><div>Alo! Airalo is the world’s first eSIM store that helps people connect in over 200+ countries and regions across the globe. We are building the next digital service that revolutionizes the telecom industry. We are a travel-tech company and an equal-opportunity environment that values and executes diversity, inclusion, and equity. Our team is spread across 50+ countries and six continents. What glues us together is our commitment to changing the way you connect<span style=\"font-size: 13.3333px\">. </span></div><div><br></div><div><b>About you</b></div><div>We hope that you care deeply about the quality of your work, the intrinsic worth of tasks, and the success of your team. You are self-disciplined and do not require micromanagement in terms of your skillset and work ethic. You do your best to flourish as an individual every day while working hard to foster a collaborative team environment. You believe in the importance of being — and staying — authentic, honest, positive, and kind. You are a good interlocutor with clear and concise communication. You are able to manage multiple projects, have an analytical mind, pay keen attention to detail, and love to get your hands dirty. You are cognizant, tolerant, and welcoming of vulnerabilities and cultural differences.</div><div><br></div><div><b>About the Role</b></div><div><b>Position</b>: Full-time / Employee</div><div><b>Location:</b>&nbsp;Remote-first </div><div><b>Benefits:</b>&nbsp;Health Insurance, work-from-anywhere stipend, annual wellness &amp; learning credits, annual all-expenses-paid company retreat in a gorgeous destination &amp; other benefits</div><div><br></div><div>As Airalo’s first<b> Strategic Pricing Manager,</b> you will be responsible for developing and implementing pricing strategies to maximize profitability and market share across multiple regions and product lines. You will collaborate with various departments such as partnerships, growth, finance, and product development to ensure alignment with business objectives while considering market dynamics, competitive landscape, and customer needs.</div><h3>Responsibilities include, but are not limited to:</h3><li>Analyze market trends, competitive positioning, and customer insights to formulate pricing strategies that drive revenue growth and profitability.</li><li>Develop pricing models and methodologies that balance pricing objectives with market demand and competitive pressures across our B2C, B2B &amp; B2B2C product lines.</li><li>Establish pricing guidelines and policies to ensure consistency and transparency across all markets and customer segments.</li><li>Conduct regular pricing analysis and performance reviews to identify opportunities for optimization and improvement.</li><li>Utilize data-driven insights to adjust pricing structures, discounting strategies, and promotional offers to enhance profitability while maintaining competitiveness.</li><li>Implement pricing tools and systems to streamline pricing processes and improve efficiency.</li><li>Collaborate with sales teams to understand customer requirements and market dynamics, ensuring pricing strategies are aligned with sales objectives.</li><li>Work closely with marketing teams to develop pricing strategies that support product positioning and marketing campaigns.</li><li>Partner with finance teams to assess pricing implications on revenue forecasts, margins, and profitability targets.</li><li>Monitor competitor pricing strategies and market trends to anticipate changes and adjust pricing strategies accordingly.</li><li>Conduct regular competitive analysis to benchmark pricing levels and identify areas for differentiation.</li><li>Leverage competitive insights to develop proactive pricing strategies that capitalize on market opportunities and mitigate threats.</li><li>Ensure compliance with regulatory requirements and pricing policies in all regions and markets.</li><li>Establish pricing governance frameworks to monitor and control pricing practices across the organization.</li><li>Provide guidance and training to internal stakeholders on pricing policies, processes, and best practices.</li>,<h3>Must Haves:</h3><li>Bachelor's degree in business, economics, finance, or related field; MBA or advanced degree preferred.</li><li>Proven experience in pricing management or related roles, preferably in a global or multinational organization.</li><li>A clear ability to manage multiple projects within deadlines and budgets.</li><li>Strong analytical skills with proficiency in data analysis and modeling.</li><li>Excellent understanding of pricing principles, methodologies, and techniques.</li><li>Ability to communicate effectively and influence cross-functional teams.</li><li>Strategic thinker with a results-oriented mindset and attention to detail.</li><li>Experience with pricing software and analytics tools is a plus.</li><li>Knowledge of global markets and regulatory environments is desirable.</li><li>Ability to thrive in a fast-paced, dynamic environment and manage multiple priorities effectively.</li>,<h3>Nice to haves:</h3><li>Experience working with SaaS or technology companies</li><li>Proficiency in SQL, Python, R or similar and experience with CRMs (Salesforce, Microsoft Dynamics, or HubSpot) and ERP (SAP, Oracle, or NetSuite) systems</li><li>Experience working with Telco, MNOs, MNVOs, eSIM &amp; GSMA</li><div><i>We sincerely thank all applicants in advance for submitting their interest in this opportunity with Airalo. </i></div>","tags":"[\"Finance\",\"management\",\"B2C\",\"B2B\"]","pubDate":"2024-06-05 15:07:50.150","link":"https://jobs.lever.co/airalo/8c1dce9e-6c1f-425c-9646-3b11f35cf0c3","savedDate":"2024-06-09 04:52:24.390","slug":"strategic-pricing-manager-airalo-7603"},{"id":4162851502,"title":"Project Coordinator","company":"Circle","image":"https://lever-client-logos.s3.us-west-2.amazonaws.com/3b00b20d-12c8-4ed9-ae9e-97d8601567b2-1706111761671.png","description":"<div><b style=\"font-size: 18px\">About Us</b></div><div>Circle is building the world’s leading all-in-one platform for online communities. We make it possible for creators, coaches, educators, and businesses to bring together their audience with engaging discussions, live streams, events, chat, courses, and payments — all in one place, all under their own brand.</div><div><br></div><div>We’re proud to be a fully remote company of around 150 (and growing!) team members from 30+ countries around the world. We strive to find exceptional talent, empower them to do their best work, and in turn, have a meaningful impact in their own lives. We don’t track hours, but we manage for outcomes in an a-synchronous culture.</div><div><br></div><div>Twice a year, we bring the whole company together for incredible company retreats in beautiful places around the world!</div><div><br></div><div><b style=\"font-size: 18px\">About the role</b></div><div>We are looking for a Project Coordinator to join our team to play an instrumental role in helping us deliver two key services offered today to customers: Circle Plus mobile app launches &amp; course migrations. We have been offering both of these services now for over 12 months, and the demand is continuing to grow. It’s officially time we bring on a new teammate to help us scale and refine our processes.</div><div><br></div><div>You’ll have a unique opportunity to work cross-functionally alongside almost every department at Circle (engineering, design, sales, customer success, and customer support) to help our customers build, launch, and maintain their mobile apps in the Google Play and Apple App Stores, as well as support migrating their existing courses over to Circle.</div><div><span style=\"font-size: 13.3333px\">Cash compensation is a starting point, and we want all of our team members to be able to grow in their roles. In addition to equity, benefits and perks, our cash compensation is subject to an annual review and increase on a once per year basis on the hire date anniversary.</span></div><h3>What you'll be doing</h3><li>Be the main point of contact for anything related to a customer’s Circle Plus app launch. You’ll coordinate the app submission process from end-to-end and own all aspects of project planning, tracking, and communications. <i>See more on the app submission process below.</i></li><li>Proactively handling schedule and scope changes, identifying risks, and managing escalations throughout the app submission process.</li><li>Partnering closely with other internal stakeholders to share feedback and experiences that help us improve our customer's experience on Circle.</li><li>Spotting inefficiencies in the way we do things, identifying problems, proposing solutions, and leading process improvement projects to root out inefficiencies.</li><li>Maintaining a deep understanding of the Circle platform and our white-labelled apps, and making recommendations on how customers can use our products &amp; services to accelerate their desired outcomes.</li><li>Partnering closely with Customer Success Managers to communicate proactively and collaborate to ensure customers migrations and launches are a seamless experience.</li><li>Working directly with both new and existing customers on assessing project requirements and feasibility, helping them understand key changes alongside migrations, and owning project execution &amp; communication from end-to-end. In the case of course migrations, this entails coordinating work amongst our team of virtual assistants (VAs) for content migration.</li><li>Documenting key processes and implementing necessary changes as needed based on efficiency improvements, or platform changes, that require adjustments to our services.</li>,<h3>What goes on during the app submission process?</h3><li>Preparing materials for the kickoff calls.</li><li>Outlining the app submission process to customers.</li><li>Setting expectations with customers about the app submission process.</li><li>Helping customers set up their app accounts.</li><li>Coordinating the design asset process on behalf of our customers.</li><li>Submitting the apps into the Apple app store / Google play store.</li><li>Maintaining the apps when updates are needed.</li>,<h3>What goes on during a course migration process?</h3><li>Review migration request and assess viability based on defined acceptance criteria.</li><li>Facilitate and manage the kickoff meeting with the customer.</li><li>Serve as the main point of contact for the customer throughout the migration process.</li><li>Collaborate closely with our VAs, providing support to ensure timely and high-quality completion of the migration.</li><li>Maintain and update all documentation and enablement resources in line with new course features</li>,<h3>What you'll need to be successful</h3><li>Strong alignment with our values.&nbsp;<a href=\"https://www.notion.so/223a15ea312c4922b793593d07add7fe?pvs=21\" class=\"postings-link\">Find our values on our career page</a>&nbsp;if you haven’t read up on them yet.</li><li>You are proficient in English (spoken, written, and reading) at a&nbsp;<a href=\"https://magoosh.com/english-speaking/english-proficiency-levels-a-guide-to-determining-your-level/\" class=\"postings-link\">CEFR Level C2</a>&nbsp;/&nbsp;<a href=\"https://www.govtilr.org/\" class=\"postings-link\">ILR Level 5</a>.</li><li>You have 2+ years of experience working as a project coordinator, project manager, implementation partner, or any role that has managed processes end-to-end with customers.</li><li>You have worked in a similar role at a SaaS company, ideally that serves small to medium sized businesses (SMB) with a high-volume of customers.</li><li>You’re resourceful. You may not have all the answers, but you know how to find them.</li><li>You’re committed to making sure the customer has an enjoyable experience throughout each step in their journey, and are constantly thinking about ways to improve it.</li><li>You’re a team player, with a high level of integrity and desire to assist your team. You enjoy working with cross-functional teams, and are able to effectively balance competing priorities to make decisions that best support the customer, the team, and Circle.</li><li>You have an aptitude for digesting and effectively communicating technical concepts across audiences of varying technical ability.</li>,<h3>Bonus points</h3><li>Experience setting up integrations, and understanding how systems communicate with each other.</li><div><b style=\"font-size: 18px\">The fun stuff</b></div><div><b>Fully remote:</b>&nbsp;work from anywhere in the world!</div><div><b>Autonomy and trust to do your job:</b>&nbsp;we care about outcomes over everything else.</div><div><b>Paid time away:</b>&nbsp;all employees are given 35 days of PTO annually. We also offer a paid sabbatical after 5 years.</div><div><b>Generous U.S. benchmarked compensation</b>&nbsp;and startup equity no matter where you are in the world.*</div><div><b>Awesome medical coverage</b>&nbsp;with 100% coverage for you and your family, or medical reimbursement options where applicable!*</div><div><b>Parental leave</b>&nbsp;for parents expanding their family, or just starting one.</div><div><b>Home office stipend</b>&nbsp;to help you get up and running.</div><div><b>Learning &amp; development stipend</b>&nbsp;to help you level up your professional skills.</div><div><b>Annual bonus potential</b>&nbsp;for roles that don't already receive variable income or commission.</div><div><b>Company retreats:</b>&nbsp;Twice a year, the Circle team gets together for a fully paid company retreat in incredible places around the world! We’ve had past retreats in Colombia, Portugal, and Mexico, with more planned on the horizon.</div><div><b>Check out our&nbsp;<a href=\"https://careers.circle.so/\" class=\"postings-link\">Careers</a>&nbsp;page for more.</b></div><div><span style=\"font-size: 10px\">*</span><i style=\"font-size: 10px\">Your role, location and unique circumstance may affect this.</i></div><div><br></div><div><b>Diversity, Equity &amp; Inclusion</b></div><div>As a fully-remote international company, diversity is baked into our DNA. Here’s how our CEO, Sid Yadav, frames our hiring mission: “let’s find talent in underserved and under-represented corners of the world, set them up to do the best work of their lives, and in turn, change their life.” To achieve this hiring mission, we offer competitive&nbsp;U.S. benchmarked&nbsp;compensation no matter where someone’s located in the world, and we proactively seek candidates who expand representation of backgrounds, cultures and lived experiences in our teams.</div><div><br></div><div><b>Equal Employment Opportunity</b></div><div>Circle is an equal opportunity employer and as such, we do not discriminate on the basis of race, color, religion, sex, sexual orientation, gender identity, national origin, age, disability, or any other characteristic protected by applicable laws.</div><div>If you require any accommodations during the recruitment process, please let us know and we will work with you to meet your needs.</div>","tags":"[\"engineering\",\"aws\"]","pubDate":"2024-06-04 14:34:10.356","link":"https://jobs.lever.co/circleco/5a5b9bc6-9714-4d5f-bdc6-da6d3f7c75bc","savedDate":"2024-06-09 04:52:24.388","slug":"project-coordinator-circle-2731"},{"id":7956799122,"title":"Technical Writer (English) - AI Tutor","company":"Mindrift","image":"https://remotive.com/job/1916945/logo","description":"<p>If you're a <strong>professional technical writer/editor</strong>, we have an exciting opportunity to use your language skills in a new and innovative way. Instead of thinking that <strong>AI</strong> will replace you, here you can help shape the future of <strong>AI</strong>.</p>\n<p>We are working on several projects that require excellent English skills and familiarity with coding documentation. Following our style guide and other quality guidelines, you will create and check responses that will form the “<strong>voice</strong>” of <strong>future AI</strong>. You will create and edit original, helpful, honest, and harmless responses; fact check existing responses; bring submitted texts up to our standards; and work directly with Team Leads to help provide feedback to writers and other participants to ensure they can regularly produce high-quality work.</p>\n<p><br><br><strong>Requirements</strong><br><br></p>\n<ul style=\"\">\n<li style=\"\">At least <strong>1 year of professional experience</strong> in writing and editing technical documentation related to <strong>software development</strong>.</li>\n</ul>\n<ul style=\"\">\n<li style=\"\">An ability to understand technical terminology and basic code samples in a variety of programming languages.</li>\n<li style=\"\">Familiarity with various rich-text formats, including YAML, CSV, and HTML.</li>\n<li style=\"\">A degree in a field related to English, technical communication, journalism, computer science, or similar.</li>\n<li style=\"\"><strong>Native level of English.</strong></li>\n<li style=\"\">Willingness to learn new methods, ability to switch between projects and topics quickly and sometimes work with challenging, complex guidelines.</li>\n<li style=\"\">A laptop, internet connection, availability, and enthusiasm to take on new challenges.</li>\n</ul>\n<p><br><br><strong>Benefits</strong><br><br></p>\n<p><strong>AI Training</strong> will be a fast-growing area in the future. We offer an opportunity to jump onboard, learn with us and create a new skill set for the future.</p>\n<p>This is a freelance role; it can be done part time alongside other work, although we do hope that you’ll dive deep with us, join our community, and collaborate and grow alongside us.</p>\n<p> </p>\n<img src=\"https://remotive.com/job/track/1916945/blank.gif?source=public_api\" alt=\"\"/>","tags":"[\"html\",\"AI/ML\",\"documentation\",\"editing\",\"technical documentation\",\"computer science\"]","pubDate":"2024-06-04 06:41:28.000","link":"https://remotive.com/remote-jobs/writing/technical-writer-english-ai-tutor-1916945","savedDate":"2024-06-09 04:52:24.378","slug":"technical-writer-english-ai-tutor-mindrift-7231"},{"id":8496900063,"title":"Onboarding & Solutions Specialist (Accounting & Finance)","company":"Pluto Card","image":"https://pbs.twimg.com/profile_images/1520019984780513281/qnVtutKu_400x400.jpg","description":"<h3><strong>About Pluto</strong></h3><p>Pluto is the Enterprise Spend Management platform for MENA serving the $30 Trillion+ B2B Payments market. Pluto has been awarded the \"Corporate solutions of the year\" by the Middle Eastern Fintech Association.</p><p>Pluto is backed by some of Silicon Valley’s top-tier venture capital firms. We’ve raised $7M Seed from top investors and operators, including founders from Ramp, Airbase, Plaid, Italic &amp; Senior Leadership at Shopify, Cash App,&nbsp;<a href=\"http://checkout.com/\" target=\"_blank\" rel=\"nofollow noreferrer noopener\" class=\"external\">Checkout.com</a>, Alloy and some of the worlds most successful FinTech VCs like GFC, Graph Ventures, Soma Capital, Adapt Ventures, amongst others who’ve trusted us 🤩</p><p>With the vision of building a modern financial operating system for businesses in MENA, we’re at the tipping point of a fintech revolution. We’re a lean but impactful team that dreams big and believes in making the impossible happen - and we are looking for someone equally motivated who wants to make their mark and help us expand our horizons.</p><p></p><h3>About this role</h3><p>We are hiring an Onboarding &amp; Solutions Specialist to join Pluto's Customer Success team. We are looking for a fast learner who ideally comes from an accounting background to help Pluto customers get the best onboarding experience. </p><p>This job is for you if you have an accounting background, or have deep experience in tools like SAP, Oracle, Xero and others and love interacting with customers. </p><p>You will be creating use cases, providing best practices to our customers, understanding their needs and helping them make use of Pluto in the best possible way. </p><p></p><h3><strong>Responsibilities: </strong></h3><ol> <li>Onboard Pluto's Customers (Accountants, CFOs, Finance Managers) and be the accounting and finance expert helping them automate their workflows using Pluto's offerings.</li> <li>Understand the customer's process and accounting automation goals and craft an onboarding journey for them for full feature adoption. </li> <li>Be the pre-sales solutions consultant who has deep finance &amp; accounting knowledge, assisting sales teams in closing the deals. </li> <li>Work cross-functionally across sales &amp; customer success managers to ensure your portfolio of customers are onboarded successfully and realize value quickly. </li> <li>Be the subject matter expert in reconciliation, accounting, finance, AP &amp; procurement processes for the product team. </li> </ol><h3>Requirements: </h3><ol> <li>Excellent verbal and written communication in English</li> <li>Accounting or Finance related degree or training</li> <li>Deep understanding of the General Ledger Process</li> <li>Prior experience in customer-facing roles </li> <li>Deep customer empathy</li> <li>At least 3 years of work experience</li> </ol><p></p><p><strong>Optional but great to have: </strong></p><ol> <li>Prior experience implementing ERP systems such as Oracle Netsuite </li> <li>Oracle or SAP or other ERP Solutions Consultant Certifications </li> <li>CPA, CA, CMA, ACCA or other relevant accounting certifications</li> <li>Past experience in similar roles</li> </ol><h3>Benefits: </h3><h3>Benefits</h3><ul> <li>Hybrid and flexible work culture</li> <li>Competitive Base Pay</li> <li>Bonuses on performance</li> </ul>","tags":"[\"Finance\",\"management\",\"B2B\"]","pubDate":"2024-06-04 00:00:00.000","link":"https://apply.workable.com/pluto-card/j/993C4F71CC","savedDate":"2024-06-09 04:52:24.384","slug":"onboarding-solutions-specialist-accounting-finance-pluto-card-6107"},{"id":2843594315,"title":"Growth Product Manager","company":"Ciceksepeti","image":"https://lever-client-logos.s3.us-west-2.amazonaws.com/de4eebbf-97f1-4bdb-b542-4fa65a0b48ab-1662467464737.png","description":"<div>Technology (AI/ML/<i>add all the buzzwords here</i>) is changing the world precipitously and shaping our future. Join us if you DISAGREE and want to shape the future yourself!</div><div><br></div><div><b>We need a top-notch Growth Product Manager with the ambition to create the technology that changes the world and builds an impeccable user experience.</b></div><div><br></div><div>This is a great opportunity to blend your technical skills with a business mindset, as we become a global e-commerce player with the vision to be the greatest gifting company in the world!</div><h3>🎯Your Journey Begins: Embrace the Exciting Adventure Ahead!</h3><li>Developing the product vision by keeping an eye on new technologies and customer insight</li><li>Responsible for driving the growth of a product or service by implementing strategies to acquire and retain users, increase engagement, and optimize conversion rates. </li><li>Work closely with cross-functional teams including product development, growth marketing, CRM and data analytics to identify opportunities for improvement and implement experiments to enhance the product's performance</li><li>Translating business requirements into conceptual, applicable, and user-friendly technological solutions</li><li>Creating new user stories, breaking-down complex stories into relevant pieces</li><li>Forming the product acceptance criteria in line with prioritized features and specifications</li><li>Creating and developing the product backlog</li><li>Establishing the project scope for business requirements, mapping the process in detail, measuring the added value of prospective projects</li><li>Keeping in touch with all stakeholders of the product on a regular basis, analyzing &amp; reporting key components of the product lifecycle (i.e. release burn down)</li><li>Following up the daily operation &amp; performance of both desktop and mobile sites / apps to take relevant actions in a timely manner</li><li>Testing the product on a regular basis and reporting the bugs</li>,<h3>🥰Are You the One We’re Seeking?</h3><li>BSc degree in relevant academic disciplines (Education in English will be preferred)</li><li>Experience in UX/UI in both web and mobile products</li><li>Proficiency in SQL </li><li>Experience in release management and planning is crucial for the role</li><li>Experience in A/B testing</li><li>Fluency in English (written &amp; spoken)</li><li>Proficiency in a software language will be nice to have</li><li>HTML, CSS knowledge will be preferred</li><li>Development management experience in web &amp; mobile would be a plus</li><li>Advanced skills in MS Office Programs</li><li>Experience with Google Analytics or Analytics Tools preferred </li>,<h3>✨Let Your Skills Shine with Us!</h3><li>You possess exceptional analytical and conceptual thinking skills</li><li>You have excellent communication, planning, and collaboration skills</li><li>You’re genuinely interested in acting as a bridge between the technology team and the business team, to ensure an efficient translation of requirements and solutions</li><li>You have an insatiable curiosity and a craving for lifelong learning</li><li>You literally enjoy seeing the outcome of your work: <i>the actual experience of the user</i></li>,<h3>😎What’s in here for you?</h3><li>🎉Fun and Adventure Await: Get ready for exhilarating team adventures and unforgettable company activities that will create memories to cherish!&nbsp;🌈</li><li>🛍️Take excellent care of yourself : HiDoctor, Momento, and More!&nbsp;👩🏻‍⚕️</li><li>🎩Express Your Unique Style: No more stuffy suits or uncomfortable attire. Embrace your personal style and wear whatever makes you feel confident and comfortable. 👗👕</li><li>📚Unlock Your Potential: Biweekly Learning Hours and a Vast Training Library Await! 🎓 Never stop learning and growing! With unlimited access to top-notch training resources like Udemy and more, your professional growth knows no limits! 🚀</li><li>🥰Join Vibrant Social Clubs: Connect, Collaborate, and Create Lifelong Friendships!🎉Be part of our vibrant social clubs, where you can engage with colleagues who share your passions and interests. Cultivate meaningful connections, foster collaboration, and create memories that extend beyond the workplace.🤝</li><li>🤝Seamless Onboarding: Receive a Warm Welcome and a Smooth Transition! 📋 Our dedicated onboarding process ensures you feel supported and empowered from day one. We provide comprehensive training and resources to help you settle into your role quickly and effectively. 🌟</li><li>Join us on this exciting journey a dynamic work ecosystem, thrilling team activities, entertainment galore, a flexible dress code, and endless learning opportunities await you! It’s time to unleash your full potential and embrace the future of work!&nbsp;💃</li><div><b>😍About Us</b></div><div><br></div><div>As a pioneering tech company in gifts, our vision is to be a leader in all markets in which we operate. We create lifelong value in the lives of our employees, customers and all our business partners! 💪</div><div><br></div><div>Founded in 2006 by Emre Aydın, <a href=\"http://ciceksepeti.com/\" class=\"postings-link\">Ciceksepeti.com</a> offers the broadest selection of flowers &amp; gifts delivered same day within a single experience. We are very proud to have created a culture of celebration among people with our gift arrangements and our brand Bonnyfood. We are committed to continuing this tradition by making every special day memorable. In addition to our original mission of bringing a new perspective to the e-commerce sector in Turkey and making shipping faster and easier, now we offer a diverse range of products under various categories, such as electronics, home &amp; living, personal care, supermarket, cosmetics, fashion, sports &amp; outdoor, hobby, pet shop, jewellery &amp; accessories, as well as flowers and edible flowers since 2019.</div><div><br></div><div><a href=\"http://ciceksepeti.com/\" class=\"postings-link\">Ciceksepeti.com</a> is the most visited floral and gifting website according to SimilarWeb data, having 4 times more visitors than the second largest player in the world. 😎</div><div><br></div><div>Besides covering 70+ cities in Turkey through <a href=\"http://55.0.0.0/\" class=\"postings-link\">55.000</a>+ vendors and 24x7 customer support, Ciceksepeti has expanded into Mexico with its international brand, LolaFlora.💃</div><div><br></div><div>We are so happy and proud to have been selected the Best Employer Brand at LinkedIn Turkey Talent Awards in 2019 and 2022! 🥳</div><div><br></div><div>Headquartered in İstanbul, we’re a young, nimble, dedicated team of professionals, who are not only hard workers but also smart workers; who know how to get things done in the right way, as well as getting the right things done for our customers. Moreover, we’re on the verge of an exciting episode in our journey as we simultaneously set foot on international markets and grow further in domestic market.</div><div><br></div><div>\"İşe alım süreçlerimizde kişisel verilerinizi nasıl işlediğimize dair bilgiye çalışan adayı aydınlatma metnimizden ulaşabilirsiniz./ Please see our candidate privacy note for information on how we process your personal data during our recruitment activities.\"</div><div><a href=\"https://cdn03.ciceksepeti.com/editor/hr/Ciceksepeti_CS-Teknoloji-Calisan-Adayi_Aydinlatma-Metni-15092023.pdf\" class=\"postings-link\">https://cdn03.ciceksepeti.com/editor/hr/Ciceksepeti_CS-Teknoloji-Calisan-Adayi_Aydinlatma-Metni-15092023.pdf</a></div><div><a href=\"https://cdn03.ciceksepeti.com/editor/hr/Ciceksepeti_CS-Teknoloji-Calisan-Adayi_Aydinlatma-Metni-15092023.docx.pdf\" class=\"postings-link\">https://cdn03.ciceksepeti.com/editor/hr/Ciceksepeti_CS-Teknoloji-Calisan-Adayi_Aydinlatma-Metni-15092023.docx.pdf</a></div>","tags":"[\"management\"]","pubDate":"2024-06-03 16:10:47.141","link":"https://jobs.lever.co/ciceksepeti/4c7bef51-c139-47c9-8b3b-7860c146ad6c","savedDate":"2024-06-09 04:52:24.391","slug":"growth-product-manager-ciceksepeti-4125"},{"id":8893601295,"title":"Enterprise & Mid-market Account Management Lead","company":"Pluto Card","image":"https://pbs.twimg.com/profile_images/1520019984780513281/qnVtutKu_400x400.jpg","description":"<h3><strong>About Pluto</strong></h3><p>Pluto is the Enterprise Spend Management platform for MENA serving the $30 Trillion+ B2B Payments market. Pluto has been awarded the \"Corporate solutions of the year\" by the Middle Eastern Fintech Association.</p><p>Pluto is backed by some of Silicon Valley’s top-tier venture capital firms. We’ve raised $7M Seed from top investors and operators, including founders from Ramp, Airbase, Plaid, Italic &amp; Senior Leadership at Shopify, Cash App, <a href=\"http://checkout.com/\" rel=\"nofollow noreferrer noopener\" class=\"external\">Checkout.com</a>, Alloy and some of the worlds most successful FinTech VCs like GFC, Graph Ventures, Soma Capital, Adapt Ventures, amongst others who’ve trusted us 🤩</p><p>With the vision of building a modern financial operating system for businesses in MENA, we’re at the tipping point of a fintech revolution. We’re a lean but impactful team that dreams big and believes in making the impossible happen - and we are looking for someone equally motivated who wants to make their mark and help us expand our horizons.</p><p></p><h3>About this role</h3><p>We are hiring for an Enterprise &amp; Midmarket Account Management Lead. You will be responsible for managing Pluto’s current and future highest revenue-generating contracts and clients. You will work directly with the COO and set the bar for what excellent account management looks like.</p><p>Pluto is growing rapidly, with over 600 businesses using Pluto in the UAE, including some of the largest enterprise customers with over 1000 employees regularly using Pluto. When a client purchases Pluto, they must go through change management—both at the finance team level and at the broader company-wide adoption level.</p><p>You will be responsible for the change management process, onboarding, implementation, and success of Pluto’s top revenue-generating clients. Your KPIs will be driven by the fastest time to successfully implement Pluto across the company and positive Net Revenue Retention.</p><p></p><h3>How this role within Pluto</h3><p>You will be joining as a founding core team member of Pluto’s account management practice. This role will be responsible for ensuring positive net revenue retention across Pluto’s highest revenue-generating customers.</p><p>Our engineering and product teams ship products at a lightning-fast cadence. It will be your responsibility to ensure the most successful enterprises in MENA adopt Pluto for finance control and compliance across their companies.</p><p>While this is an individual contributor role, you will be on a director track to eventually build and manage Pluto’s account management practice from scratch.</p><p></p><h3>Your responsibilities:</h3><ol> <li>Be the directly responsible individual (engagement manager) for Pluto’s top revenue-generating clients.</li> <li>Be the go-to relationship manager for our clients.</li> <li>Ensure positive net revenue retention through upselling and driving adoption across the organization.</li> <li>Take an enterprise customer from RFQ closed to activated through your project management, stakeholder management, and activation skills.</li> <li>Carry out training and onboarding sessions for customers and their employees as needed.</li> <li>Drive revenue by owning renewals, use case expansions, and overall growth via continuous engagement, emails, webinars, and other channels.</li> <li>Be the subject matter expert for enterprise prospects during pre-sales calls and meetings.</li> <li>Collaborate with product, design, and engineering teams during client engagements to carry out implementations of feature requests and custom integrations.</li> <li>Surface thematic product gaps and needs within your book of business.</li> <li>Experience creating and delivering high-quality QBRs to executive and leadership teams.</li> </ol><h3>Requirements: </h3><h3>You are a good fit if..</h3><ol> <li>You have previously been in similar roles for at least 4+ years within B2B SaaS software</li> <li>Experience navigating RFQs, and SOW-based delivery of client requirements</li> <li>You can go deep into understanding complex products and have the ability to effectively communicate value to customers</li> <li>You have the ability to take a systematic, process driven approach to activating and retaining clients</li> <li>You have a proven ability to build and maintain relationships with customers</li> <li>You are confident and don’t shy away from negotiations or upsells with Finance Leaders (VPs, Directors) and Controllers.</li> <li>You have the ability to work cross functionality with engineering &amp; product, and communicate your requirements in a way that is easily understood</li> <li>You are on top of your inbox, have strong project &amp; time management skills and leverage modern tools to ensure you are effective</li> <li>You have previously managed team members or have the desire to grow into a manager</li> <li>Demonstrated pipeline maintenance skills (Farming) using Sales tools such as Hubspot, Salesloft etc.</li> </ol><h3></h3><h3>Optional, but great to have:</h3><ol> <li>Basic understanding of accounting and finance ecosystem</li> <li>Experience utilizing common tools within the CS tech stack (Hubspot, Gainsight, Gong, Catalyst, Totango, Outreach)</li> </ol><h3>Benefits: </h3><h3>Benefits</h3><ul> <li>Hybrid and flexible work culture</li> <li>Competitive Base Pay</li> <li>Commissions &amp; bonuses on upsells and positive net revenue retention</li> <li>Equity for all employees — you win if we win 🏆</li> </ul>","tags":"[\"Finance\",\"management\",\"engineering\",\"B2B\"]","pubDate":"2024-06-03 00:00:00.000","link":"https://apply.workable.com/pluto-card/j/B43D64DAA2","savedDate":"2024-06-09 04:52:24.384","slug":"enterprise-mid-market-account-management-lead-pluto-card-6572"},{"id":9829383292,"title":"Senior Account Manager (Remote)","company":"Pluto Card","image":"https://pbs.twimg.com/profile_images/1520019984780513281/qnVtutKu_400x400.jpg","description":"<h3><strong>About Pluto</strong></h3><p>Pluto is the Enterprise Spend Management platform for MENA serving the $30 Trillion+ B2B Payments market. Pluto has been awarded the \"Corporate solutions of the year\" by the Middle Eastern Fintech Association.</p><p>Pluto is backed by some of Silicon Valley’s top-tier venture capital firms. We’ve raised $7M Seed from top investors and operators, including founders from Ramp, Airbase, Plaid, Italic &amp; Senior Leadership at Shopify, Cash App, <a href=\"http://checkout.com/\" rel=\"nofollow noreferrer noopener\" class=\"external\">Checkout.com</a>, Alloy and some of the worlds most successful FinTech VCs like GFC, Graph Ventures, Soma Capital, Adapt Ventures, amongst others who’ve trusted us 🤩</p><p>With the vision of building a modern financial operating system for businesses in MENA, we’re at the tipping point of a fintech revolution. We’re a lean but impactful team that dreams big and believes in making the impossible happen - and we are looking for someone equally motivated who wants to make their mark and help us expand our horizons.</p><p></p><h3>About this role</h3><p>We are hiring for an experienced Account Manager. You will be responsible for managing ensuring that Pluto's current clients continuously increase in usage and be the front facing lead to increase adoption of our platfor. You will work directly with the COO and set the bar for what excellent account management looks like.</p><p>Pluto is growing rapidly, with over 600 businesses using Pluto in the UAE, including some of the largest enterprise customers with over 1000 employees regularly using Pluto. When a client purchases Pluto, they must go through change management—both at the finance team level and at the broader company-wide adoption level.</p><p>You will be responsible for the change management process, onboarding, implementation, and success of Pluto’s clients. </p><p>Your KPIs will be driven by the fastest time to successfully implement Pluto across the company and positive Net Revenue Retention.</p><p></p><h3>How this role within Pluto</h3><p>You will be joining as a founding core team member of Pluto’s account management practice. This role will be responsible for ensuring positive net revenue retention across all of Pluto’s customers including free, pro &amp; essential tier customers.</p><p>Our engineering and product teams ship products at a lightning-fast cadence. It will be your responsibility to ensure the most successful enterprises in MENA adopt Pluto for finance control and compliance across their companies.</p><p></p><h3>Your responsibilities:</h3><ol> <li>Be the directly responsible individual (engagement manager) for Pluto’s clients.</li> <li>Be the go-to relationship manager for our clients.</li> <li>Ensure positive net revenue retention through upselling and driving adoption across the organization.</li> <li>Carry out training and onboarding sessions for customers and their employees as needed.</li> <li>Drive revenue by owning renewals, use case expansions, and overall growth via continuous engagement, emails, webinars, and other channels.</li> <li>Be the subject matter expert for prospects during pre-sales calls and meetings.</li> <li>Collaborate with product, design, and engineering teams during client engagements to carry out implementations of feature requests and custom integrations.</li> <li>Surface thematic product gaps and needs within your book of business.</li> </ol><h3>Requirements: </h3><h3>You are a good fit if..</h3><ol> <li>You have previously been in similar roles for at least 3+ years within B2B SaaS software</li> <li>You can go deep into understanding complex products and have the ability to effectively communicate value to customers</li> <li>You have the ability to take a systematic, process driven approach to activating and retaining clients</li> <li>You have a proven ability to build and maintain relationships with customers</li> <li>You are confident and don’t shy away from negotiations or upsells with Finance Leaders (VPs, Directors) and Controllers</li> <li>You have the ability to work cross functionality with engineering &amp; product, and communicate your requirements in a way that is easily understood</li> <li>You are on top of your inbox, have time management skills and leverage modern tools to ensure you are effective</li> <li>You understand that startups require to fill many roles and maintain high energy all throughout 💪🏽💪🏽💪🏽</li> <li>Demonstrated pipeline maintenance skills (Farming) using Sales tools such as Hubspot, Salesloft etc.</li> </ol><h3></h3><h3>Optional, but great to have:</h3><ol> <li>Basic understanding of accounting and finance ecosystem</li> <li>Experience utilizing common tools within the CS tech stack (Hubspot, Gainsight, Gong, Catalyst, Totango, Outreach)</li> </ol><h3>Benefits: </h3><h3>Benefits</h3><ul> <li>Hybrid and flexible work culture</li> <li>Competitive Base Pay</li> <li>Commissions &amp; bonuses on upsells and positive net revenue retention</li> <li>Equity for all employees — you win if we win 🏆</li> </ul>","tags":"[\"Finance\",\"management\",\"engineering\",\"B2B\"]","pubDate":"2024-06-03 00:00:00.000","link":"https://apply.workable.com/pluto-card/j/685048B0FB","savedDate":"2024-06-09 04:52:24.385","slug":"senior-account-manager-remote-pluto-card-2577"},{"id":6009927603,"title":"Support Engineer (Imunify Focus) - Remote/ Work Anywhere","company":"CloudLinux","image":"https://pbs.twimg.com/profile_images/696718028084482050/ymY3OEPk_400x400.png","description":"<p>This is a 100% remote role that can be located anywhere. We are obliged by the job posting sites to denote a country in order to advertise with them.</p><p>We are looking for a support engineer to handle tickets and ensure that customer inquiries/issues get off to a successful start. As our Support Engineer, you will gather information from the tickets, search for a resolution in our knowledge base, review known error/bugs database, and work for a quick resolution. If a resolution is not found, you will escalate the ticket to a higher level. </p><p>The ideal candidate enjoys assisting the customer with issues and is able to explain technical details simply, he/she will feel at home with Linux, because they’ll be supporting the world’s best web-hosting Linux-based operating system, and other leading Linux-based products, </p><p>CloudLinux is a global remote-first company. We are driven by our principles: Do the right thing, employees first, we are remote first, and we deliver high volume, low-cost Linux infrastructure and security products that help companies to increase the efficiency of their operations. Every person on our team supports each other and does what we can to ensure everyone is successful. We are truly a great place to work.<br></p><p>For more information, go to <a href=\"https://www.cloudlinux.com/\" rel=\"nofollow noreferrer noopener\" class=\"external\">cloudlinux.com</a></p><p><strong>Responsibilities:</strong></p><ul> <li>Give world-class technical support to worldwide customers.</li> <li>Use your Linux skills to analyze and solve different technical issues.</li> <li>Work closely with developers, troubleshooting, bug-fixing, and issue-tracking.</li> <li>Engage directly with customers, make sure they’re happy, and love us and our products.</li> <li>Involve yourself with product development, using your insight into customers’ issues and use cases.</li> <li>Create Knowledge Base articles based on your findings.</li> </ul><h3>Requirements: </h3><ul> <li>Technical, a passionate problem-solver with a customer-centric mindset.</li> <li>Feel at home with Linux, because you’ll be supporting the world’s best web-hosting Linux-based operating system, and other leading Linux-based products.</li> <li>Organized, resourceful, and responsive, because you’ll be working remotely, at home, or wherever suits you best.</li> <li>Flexible, willing to work shifts or do what’s necessary to help our customers on a 24/7/365 basis.</li> </ul><h3>Benefits: </h3><p><strong>What's in it for you?</strong></p><ul> <li>A focus on professional development; </li> <li>Interesting and challenging projects</li> <li>Flexible working hours</li> <li>Paid one month vacation per year and unlimited sick leave</li> <li>Medical insurance reimbursement</li> <li>Co-working and gym/sports reimbursement</li> <li>The opportunity to receive a reward for the most innovative idea that the company can patent</li> </ul><p><em>By applying for this position, you agree with </em><a href=\"https://cloudlinux.com/privacy-policy\" rel=\"nofollow noreferrer noopener\" class=\"external\"><em>Cloudlinux Privacy Policy</em></a><em> and give us your consent to maintain and process your personal data with this respect. Please read our Privacy Policy for more information.</em></p>","tags":"[\"database\"]","pubDate":"2024-06-03 00:00:00.000","link":"https://apply.workable.com/cloudlinux-1/j/19CFD4CF4C","savedDate":"2024-06-09 04:52:24.385","slug":"support-engineer-imunify-focus-remote-work-anywhere-cloudlinux-7379"},{"id":5291262215,"title":"Solutions Architect - Fully Remote","company":"CoverGo","image":"https://pbs.twimg.com/profile_images/1382655628523364355/MWPIbbID_400x400.jpg","description":"<p><strong>Top 3 Reasons To Join Us</strong></p><ul> <li>Competitive Salary</li> <li>International Environment</li> <li>Working on the latest tech for the Insurtech Market Leader</li> </ul><p><strong>About Us</strong></p><p>At CoverGo, our mission is to empower all insurance companies to make insurance 100% digital and accessible to everyone.</p><ul> <li>We are a leading global no-code insurance platform for health, life, and P&amp;C</li> <li>We’re the winner of the Insurtech of the Year in all of Asia and other awards globally</li> <li>We work with insurance enterprise clients such as AXA, Bupa, MSIG, Dai-ichi, Bank of China Group Insurance, and many more</li> <li>We're an international, diverse team of over 120 people with 30 nationalities and team members working remotely from all over the world</li> <li>We are fully funded and backed by reputable VC funds and strategic institutional investors</li> <li>We have a global presence in Asia, EMEA and the Americas</li> <li>We’ve grown our annualized revenue by over 30x since January 2021</li> <li>We’re constantly working towards making CoverGo a workplace that you love coming to. We deeply believe that bringing together a diversity of thoughts, expressions, and perspectives is key to building the best culture for equally diverse communities all over the world</li> </ul><p><strong>About the Role</strong></p><p>A cloud technology-focused individual providing design and delivery expertise for forward-looking solutions in a modern cloud-based insurance environment. The successful candidate will work directly with clients, assessing their needs, designing tailored solutions, and supporting business initiatives in alignment with defined roadmaps. This role is technology agnostic but emphasizes solutions leveraging heavily on AWS and/or GCP environments, incorporating elements of open-source, PaaS, and SaaS components.</p><p><strong>What You Will Do</strong></p><ul> <li>Engage with clients to understand their requirements and advise on appropriate solution architectures</li> <li>Collaborate with Product Managers to ensure alignment between client needs and solution design</li> <li>Work closely with Delivery Managers to oversee the architecture approach during solution deployment</li> <li>Explore a range of possibilities and creative alternatives to identify the most effective solutions</li> <li>Ensure that designed solutions are implemented in accordance with client expectations and company standards</li> <li>Assist in identifying, specifying, and selecting off-the-shelf components to meet client needs</li> <li>Provide ongoing support and guidance to clients throughout the implementation process</li> <li>Maintain awareness of industry trends and emerging technologies to continuously improve solutions</li> </ul><p><strong>Required Skills and Knowledge</strong></p><ul> <li>At least 6 years of professional experience in solution architecture design and delivery roles in the insurance vertical with exposure to multiple lines of business</li> <li>Experienced in delivering cloud-based technology product solutions in an enterprise environment</li> <li>Ability to assist in defining and socialising a product/enterprise roadmap</li> <li>Ability to translate client requirements into actionable steps and solution architectures</li> <li>Understand business architecture models &amp; patterns</li> <li>Has designed and implemented innovative and creative solutions to business problems</li> <li>Can think \"outside the box\", but also be able to understand the business constraints that lead to “in the box” approaches</li> <li>Understand the optimum approaches for cloud-based applications with high availability and highly scalable solutions</li> <li>Experienced in designing solutions in a Relational DB and noSQL environment&nbsp;</li> <li>Experienced in designing for API &amp; Micro-services centric environments&nbsp;</li> <li>Demonstrated capability to self-learn new technology trends and approaches</li> <li>Ideally has experience or understanding of the benefits of low-code platforms&nbsp;</li> <li>While the Solution Architect is not expected to build the solutions experience of multiple development languages &amp; various DB engines will be advantageous</li> <li>Exposure to authentication and authorisation concepts (SSO, SAML integration, identity federation etc)</li> <li>Excellent communication skills, both written and verbal</li> </ul><p><strong>Required Competencies</strong></p><ul> <li>Must be equally comfortable discussing the solution strategies and enterprise roadmap with people at all levels of our organisation and CxO to project-level teams in our clients</li> <li>Strong analytical skills &amp; ability to understand and collect business requirements from corporate clients.</li> <li>Strong ability to build the value proposition and solution documents, and in some cases, the business case for a corporate client.</li> <li>Relationship management experience with corporate clients.</li> <li>Excellent organisational, interpersonal &amp; communication skills and an ability to engage audiences</li> <li>Excellent decision-making and judgment skills</li> <li>Understanding of insurance business processes across all areas and at least two lines of business</li> <li>Maintains direction and focus through proactive planning and organized approaches to work</li> <li>Certification in one architecture discipline (TOGAF, Zachman, etc.) is a distinct advantage</li> <li>Certification in one cloud environment is a distinct advantage with a broad knowledge and experience of the cloud platform’s capabilities</li> <li>A high proficiency in working in English as your primary language</li> </ul><p><strong>Why You'll Love Working Here</strong></p><ul> <li>Fully Remote</li> <li>Flexible Leave</li> <li>International Environment</li> <li>Competitive renumeration package</li> <li>Performance Bonus</li> <li>Stock Options after 6 months </li> <li>Remote work allowance</li> <li>Company activities and events</li> <li>Learning and development plan</li> </ul><p><strong>CoverGo Company</strong><a href=\"https://www.youtube.com/watch?v=YI0ezLxvFvA\" rel=\"nofollow noreferrer noopener\" class=\"external\"><strong> Video</strong></a></p><p>By submitting your application, you confirm that you have read, understood, and accepted the content of CoverGo’s <a href=\"https://apply.workable.com/covergo/gdpr_policy?lng=en\" target=\"_blank\" rel=\"nofollow noreferrer noopener\" class=\"external\">Privacy Notice</a> and you consent to the processing of your data as part of this application.</p><h3>Requirements: </h3><h3>Benefits: </h3>","tags":"[\"management\",\"aws\"]","pubDate":"2024-06-03 00:00:00.000","link":"https://apply.workable.com/covergo/j/A059C10B7B","savedDate":"2024-06-09 04:52:24.385","slug":"solutions-architect-fully-remote-covergo-3621"},{"id":1108194032,"title":"Solutions Architect - Fully Remote","company":"CoverGo","image":"https://pbs.twimg.com/profile_images/1382655628523364355/MWPIbbID_400x400.jpg","description":"<p><strong>Top 3 Reasons To Join Us</strong></p><ul> <li>Competitive Salary</li> <li>International Environment</li> <li>Working on the latest tech for the Insurtech Market Leader</li> </ul><p><strong>About Us</strong></p><p>At CoverGo, our mission is to empower all insurance companies to make insurance 100% digital and accessible to everyone.</p><ul> <li>We are a leading global no-code insurance platform for health, life, and P&amp;C</li> <li>We’re the winner of the Insurtech of the Year in all of Asia and other awards globally</li> <li>We work with insurance enterprise clients such as AXA, Bupa, MSIG, Dai-ichi, Bank of China Group Insurance, and many more</li> <li>We're an international, diverse team of over 120 people with 30 nationalities and team members working remotely from all over the world</li> <li>We are fully funded and backed by reputable VC funds and strategic institutional investors</li> <li>We have a global presence in Asia, EMEA and the Americas</li> <li>We’ve grown our annualized revenue by over 30x since January 2021</li> <li>We’re constantly working towards making CoverGo a workplace that you love coming to. We deeply believe that bringing together a diversity of thoughts, expressions, and perspectives is key to building the best culture for equally diverse communities all over the world</li> </ul><p><strong>About the Role</strong></p><p>A cloud technology-focused individual providing design and delivery expertise for forward-looking solutions in a modern cloud-based insurance environment. The successful candidate will work directly with clients, assessing their needs, designing tailored solutions, and supporting business initiatives in alignment with defined roadmaps. This role is technology agnostic but emphasizes solutions leveraging heavily on AWS and/or GCP environments, incorporating elements of open-source, PaaS, and SaaS components.</p><p><strong>What You Will Do</strong></p><ul> <li>Engage with clients to understand their requirements and advise on appropriate solution architectures</li> <li>Collaborate with Product Managers to ensure alignment between client needs and solution design</li> <li>Work closely with Delivery Managers to oversee the architecture approach during solution deployment</li> <li>Explore a range of possibilities and creative alternatives to identify the most effective solutions</li> <li>Ensure that designed solutions are implemented in accordance with client expectations and company standards</li> <li>Assist in identifying, specifying, and selecting off-the-shelf components to meet client needs</li> <li>Provide ongoing support and guidance to clients throughout the implementation process</li> <li>Maintain awareness of industry trends and emerging technologies to continuously improve solutions</li> </ul><p><strong>Required Skills and Knowledge</strong></p><ul> <li>At least 6 years of professional experience in solution architecture design and delivery roles in the insurance vertical with exposure to multiple lines of business</li> <li>Experienced in delivering cloud-based technology product solutions in an enterprise environment</li> <li>Ability to assist in defining and socialising a product/enterprise roadmap</li> <li>Ability to translate client requirements into actionable steps and solution architectures</li> <li>Understand business architecture models &amp; patterns</li> <li>Has designed and implemented innovative and creative solutions to business problems</li> <li>Can think \"outside the box\", but also be able to understand the business constraints that lead to “in the box” approaches</li> <li>Understand the optimum approaches for cloud-based applications with high availability and highly scalable solutions</li> <li>Experienced in designing solutions in a Relational DB and noSQL environment&nbsp;</li> <li>Experienced in designing for API &amp; Micro-services centric environments&nbsp;</li> <li>Demonstrated capability to self-learn new technology trends and approaches</li> <li>Ideally has experience or understanding of the benefits of low-code platforms&nbsp;</li> <li>While the Solution Architect is not expected to build the solutions experience of multiple development languages &amp; various DB engines will be advantageous</li> <li>Exposure to authentication and authorisation concepts (SSO, SAML integration, identity federation etc)</li> <li>Excellent communication skills, both written and verbal</li> </ul><p><strong>Required Competencies</strong></p><ul> <li>Must be equally comfortable discussing the solution strategies and enterprise roadmap with people at all levels of our organisation and CxO to project-level teams in our clients</li> <li>Strong analytical skills &amp; ability to understand and collect business requirements from corporate clients.</li> <li>Strong ability to build the value proposition and solution documents, and in some cases, the business case for a corporate client.</li> <li>Relationship management experience with corporate clients.</li> <li>Excellent organisational, interpersonal &amp; communication skills and an ability to engage audiences</li> <li>Excellent decision-making and judgment skills</li> <li>Understanding of insurance business processes across all areas and at least two lines of business</li> <li>Maintains direction and focus through proactive planning and organized approaches to work</li> <li>Certification in one architecture discipline (TOGAF, Zachman, etc.) is a distinct advantage</li> <li>Certification in one cloud environment is a distinct advantage with a broad knowledge and experience of the cloud platform’s capabilities</li> <li>A high proficiency in working in English as your primary language</li> </ul><p><strong>Why You'll Love Working Here</strong></p><ul> <li>Fully Remote</li> <li>Flexible Leave</li> <li>International Environment</li> <li>Competitive renumeration package</li> <li>Performance Bonus</li> <li>Stock Options after 6 months </li> <li>Remote work allowance</li> <li>Company activities and events</li> <li>Learning and development plan</li> </ul><p><strong>CoverGo Company</strong><a href=\"https://www.youtube.com/watch?v=YI0ezLxvFvA\" rel=\"nofollow noreferrer noopener\" class=\"external\"><strong> Video</strong></a></p><p>By submitting your application, you confirm that you have read, understood, and accepted the content of CoverGo’s <a href=\"https://apply.workable.com/covergo/gdpr_policy?lng=en\" target=\"_blank\" rel=\"nofollow noreferrer noopener\" class=\"external\">Privacy Notice</a> and you consent to the processing of your data as part of this application.</p><h3>Requirements: </h3><h3>Benefits: </h3>","tags":"[\"management\",\"aws\"]","pubDate":"2024-06-03 00:00:00.000","link":"https://apply.workable.com/covergo/j/61FF5709D2","savedDate":"2024-06-09 04:52:24.386","slug":"solutions-architect-fully-remote-covergo-4892"},{"id":6414048451,"title":"Solutions Architect - Fully Remote","company":"CoverGo","image":"https://pbs.twimg.com/profile_images/1382655628523364355/MWPIbbID_400x400.jpg","description":"<p><strong>Top 3 Reasons To Join Us</strong></p><ul> <li>Competitive Salary</li> <li>International Environment</li> <li>Working on the latest tech for the Insurtech Market Leader</li> </ul><p><strong>About Us</strong></p><p>At CoverGo, our mission is to empower all insurance companies to make insurance 100% digital and accessible to everyone.</p><ul> <li>We are a leading global no-code insurance platform for health, life, and P&amp;C</li> <li>We’re the winner of the Insurtech of the Year in all of Asia and other awards globally</li> <li>We work with insurance enterprise clients such as AXA, Bupa, MSIG, Dai-ichi, Bank of China Group Insurance, and many more</li> <li>We're an international, diverse team of over 120 people with 30 nationalities and team members working remotely from all over the world</li> <li>We are fully funded and backed by reputable VC funds and strategic institutional investors</li> <li>We have a global presence in Asia, EMEA and the Americas</li> <li>We’ve grown our annualized revenue by over 30x since January 2021</li> <li>We’re constantly working towards making CoverGo a workplace that you love coming to. We deeply believe that bringing together a diversity of thoughts, expressions, and perspectives is key to building the best culture for equally diverse communities all over the world</li> </ul><p><strong>About the Role</strong></p><p>A cloud technology-focused individual providing design and delivery expertise for forward-looking solutions in a modern cloud-based insurance environment. The successful candidate will work directly with clients, assessing their needs, designing tailored solutions, and supporting business initiatives in alignment with defined roadmaps. This role is technology agnostic but emphasizes solutions leveraging heavily on AWS and/or GCP environments, incorporating elements of open-source, PaaS, and SaaS components.</p><p><strong>What You Will Do</strong></p><ul> <li>Engage with clients to understand their requirements and advise on appropriate solution architectures</li> <li>Collaborate with Product Managers to ensure alignment between client needs and solution design</li> <li>Work closely with Delivery Managers to oversee the architecture approach during solution deployment</li> <li>Explore a range of possibilities and creative alternatives to identify the most effective solutions</li> <li>Ensure that designed solutions are implemented in accordance with client expectations and company standards</li> <li>Assist in identifying, specifying, and selecting off-the-shelf components to meet client needs</li> <li>Provide ongoing support and guidance to clients throughout the implementation process</li> <li>Maintain awareness of industry trends and emerging technologies to continuously improve solutions</li> </ul><p><strong>Required Skills and Knowledge</strong></p><ul> <li>At least 6 years of professional experience in solution architecture design and delivery roles in the insurance vertical with exposure to multiple lines of business</li> <li>Experienced in delivering cloud-based technology product solutions in an enterprise environment</li> <li>Ability to assist in defining and socialising a product/enterprise roadmap</li> <li>Ability to translate client requirements into actionable steps and solution architectures</li> <li>Understand business architecture models &amp; patterns</li> <li>Has designed and implemented innovative and creative solutions to business problems</li> <li>Can think \"outside the box\", but also be able to understand the business constraints that lead to “in the box” approaches</li> <li>Understand the optimum approaches for cloud-based applications with high availability and highly scalable solutions</li> <li>Experienced in designing solutions in a Relational DB and noSQL environment&nbsp;</li> <li>Experienced in designing for API &amp; Micro-services centric environments&nbsp;</li> <li>Demonstrated capability to self-learn new technology trends and approaches</li> <li>Ideally has experience or understanding of the benefits of low-code platforms&nbsp;</li> <li>While the Solution Architect is not expected to build the solutions experience of multiple development languages &amp; various DB engines will be advantageous</li> <li>Exposure to authentication and authorisation concepts (SSO, SAML integration, identity federation etc)</li> <li>Excellent communication skills, both written and verbal</li> </ul><p><strong>Required Competencies</strong></p><ul> <li>Must be equally comfortable discussing the solution strategies and enterprise roadmap with people at all levels of our organisation and CxO to project-level teams in our clients</li> <li>Strong analytical skills &amp; ability to understand and collect business requirements from corporate clients.</li> <li>Strong ability to build the value proposition and solution documents, and in some cases, the business case for a corporate client.</li> <li>Relationship management experience with corporate clients.</li> <li>Excellent organisational, interpersonal &amp; communication skills and an ability to engage audiences</li> <li>Excellent decision-making and judgment skills</li> <li>Understanding of insurance business processes across all areas and at least two lines of business</li> <li>Maintains direction and focus through proactive planning and organized approaches to work</li> <li>Certification in one architecture discipline (TOGAF, Zachman, etc.) is a distinct advantage</li> <li>Certification in one cloud environment is a distinct advantage with a broad knowledge and experience of the cloud platform’s capabilities</li> <li>A high proficiency in working in English as your primary language</li> </ul><p><strong>Why You'll Love Working Here</strong></p><ul> <li>Fully Remote</li> <li>Flexible Leave</li> <li>International Environment</li> <li>Competitive renumeration package</li> <li>Performance Bonus</li> <li>Stock Options after 6 months </li> <li>Remote work allowance</li> <li>Company activities and events</li> <li>Learning and development plan</li> </ul><p><strong>CoverGo Company</strong><a href=\"https://www.youtube.com/watch?v=YI0ezLxvFvA\" rel=\"nofollow noreferrer noopener\" class=\"external\"><strong> Video</strong></a></p><p>By submitting your application, you confirm that you have read, understood, and accepted the content of CoverGo’s <a href=\"https://apply.workable.com/covergo/gdpr_policy?lng=en\" target=\"_blank\" rel=\"nofollow noreferrer noopener\" class=\"external\">Privacy Notice</a> and you consent to the processing of your data as part of this application.</p><h3>Requirements: </h3><h3>Benefits: </h3>","tags":"[\"management\",\"aws\"]","pubDate":"2024-06-03 00:00:00.000","link":"https://apply.workable.com/covergo/j/E879441AD6","savedDate":"2024-06-09 04:52:24.386","slug":"solutions-architect-fully-remote-covergo-9649"},{"id":3380435152,"title":"Senior Demand Generation Manager","company":"Circle","image":"https://lever-client-logos.s3.us-west-2.amazonaws.com/3b00b20d-12c8-4ed9-ae9e-97d8601567b2-1706111761671.png","description":"<div><b style=\"font-size: 18px\">About Us</b></div><div>Circle is building the world’s leading all-in-one platform for online communities. We make it possible for creators, coaches, educators, and businesses to bring together their audience with engaging discussions, live streams, events, chat, courses, and payments — all in one place, all under their own brand.</div><div><br></div><div>We’re proud to be a fully remote company of around 150 (and growing!) team members from 30+ countries around the world. We strive to find exceptional talent, empower them to do their best work, and in turn, have a meaningful impact in their own lives. We don’t track hours, but we manage for outcomes in an a-synchronous culture.</div><div><br></div><div>Twice a year, we bring the whole company together for incredible company retreats in beautiful places around the world!</div><div><br></div><div><b style=\"font-size: 18px\">About the role</b></div><div><span style=\"font-size: 11pt\">We’re looking for a Demand Generation Manager to help grow MRR by building out our mid-market funnel.</span></div><div><br></div><div><span style=\"font-size: 11pt\">Reporting to the Demand Generation Lead, and working closely with the marketing and sales teams, you’ll craft and execute inbound and outbound marketing programs, define the “buyer journey,” and drive pipeline that close-wins at a predictable rate.</span></div><div><br></div><div><span style=\"font-size: 11pt\">Marketing is a team sport at Circle—you’ll be a key member of the team, and will be driven by its greater success. You’ll contribute to this success by taking full ownership of mid-market demand, and acting as a strategic partner to sales as leads progress through the funnel.</span></div><div><br></div><div><span style=\"font-size: 11pt\">It’s important that you have a bias for action, are highly organized, have a keen attention to detail, are deeply curious, and enjoy a lot of collaboration. In other words, you thrive in an action-oriented and results-driven environment.</span></div><div><br></div><div><b style=\"font-size: 11pt\">This role has core hours of 10:00am to 2:00pm Eastern time, Monday to Friday. So, we prefer candidates in North or South American time zones.</b></div><div><span style=\"font-size: 13.3333px\">Cash compensation is a starting point, and we want all of our team members to be able to grow in their roles. In addition to equity, benefits and perks, our cash compensation is subject to an annual review and increase on a once per year basis on the hire date anniversary.</span></div><h3>What you'll be doing</h3><li><b>Owning typical demand generation metrics. </b>You’ll focus on improving pipeline and MRR, as well as metrics that influence them.&nbsp;</li><li><b>Optimizing sales funnel efficiency. </b>Specifically, working with sales and revenue operations to improve the user experience, from requesting a demo to being closed-won.</li><li><b>Building always-on campaigns from scratch. </b>You’ll build out, validate, and scale new awareness and acquisition channels.&nbsp;</li><li><b>Go-to-market team collaboration. </b>You’ll regularly work with sales, marketing, and revenue operations to keep on top of metrics and continually improve them. You’ll also be deeply involved in feature launches, bringing new value propositions to the mid-market segment of our ICP.</li><li><b>Owning budget. </b>You’ll help optimize marketing spend and support the demand generation lead in reporting monthly to members of the leadership team. </li>,<h3>What you'll need to be successful</h3><li>Strong alignment with our values,&nbsp;<a href=\"https://www.notion.so/Circle-Careers-223a15ea312c4922b793593d07add7fe?pvs=21\" class=\"postings-link\">find our values on our career page</a>&nbsp;if you haven’t read up on them yet</li><li>You are proficient in English (spoken, written, and reading) at a&nbsp;<a href=\"https://magoosh.com/english-speaking/english-proficiency-levels-a-guide-to-determining-your-level/\">CEFR Level C1</a>&nbsp;/&nbsp;<a href=\"https://www.govtilr.org/\" class=\"postings-link\">ILR Level 5</a>.</li><li><b>Experience in a similar role. </b>You likely have “demand generation,” “growth marketing,” or something similar in your past job titles. <i>And</i>, you have at least <b><i>three years</i></b> experience at this in a startup environment targeting mid-market businesses.</li><li><b>You have built a demand generation funnel</b> and, and owned a pipeline/revenue goal.</li><li><b>You own numbers. </b>Not just revenue/pipeline, but you closely monitor all of the metrics that indicate lead generation and channel performance --MQLs, ROAS, etc.</li><li><b>You have created long-term scalable growth strategies. </b>You don't rely on one-and-done campaigns to win.</li><li><b>You fundamentally understand growing and optimizing isolated B2B demand generation channels.</b></li><li><b>You concentrate on inbound. </b>The vast majority of Circle’s pipeline and revenue are sourced through inbound marketing.</li><li><b>You have knowledge of SaaS sales funnels. </b>You know which metrics impact others, can report on performance, and extract insights that marketing and sales can use.&nbsp;</li><li><b>You can jump into platforms, if need be.</b> You know how to navigate a CRM and troubleshoot a demo booking tool.</li><div><b style=\"font-size: 18px\">The fun stuff</b></div><div><b>Fully remote:</b>&nbsp;work from anywhere in the world!</div><div><b>Autonomy and trust to do your job:</b>&nbsp;we care about outcomes over everything else.</div><div><b>Paid time away:</b>&nbsp;all employees are given 35 days of PTO annually.</div><div><b>Generous U.S. benchmarked compensation</b>&nbsp;and startup equity no matter where you are in the world.*</div><div><b>Awesome medical coverage</b>&nbsp;with 100% coverage for you and your family, or medical reimbursement options where applicable!*</div><div><b>Home office stipend</b>&nbsp;to help you get up and running.</div><div><b>Learning &amp; development stipend</b>&nbsp;to help you level up your professional skills.</div><div><b>Annual bonus potential</b>&nbsp;for roles that don't already receive variable income or commission.</div><div><b>Company retreats:</b>&nbsp;Twice a year, the Circle team gets together for a fully paid company retreat in incredible places around the world! We’ve had past retreats in Colombia, Portugal, and Mexico, with more planned on the horizon.</div><div><b>Check out our&nbsp;</b><a href=\"https://careers.circle.so/\" class=\"postings-link\"><b>Careers</b></a><b>&nbsp;page for more.</b></div><div><span style=\"font-size: 10px\">*</span><i style=\"font-size: 10px\">Your role, location and unique circumstance may affect this.</i></div><div><br></div><div><b>Diversity, Equity &amp; Inclusion</b></div><div>As a fully-remote international company, diversity is baked into our DNA. Here’s how our CEO, Sid Yadav, frames our hiring mission: “let’s find talent in underserved and under-represented corners of the world, set them up to do the best work of their lives, and in turn, change their life.” To achieve this hiring mission, we offer competitive&nbsp;<a href=\"http://u.s.-benchmarked/\" class=\"postings-link\">U.S.-benchmarked</a>&nbsp;compensation no matter where someone’s located in the world, and we proactively seek candidates who expand representation of backgrounds, cultures and lived experiences in our teams.</div><div><br></div><div><b>Equal Employment Opportunity</b></div><div>Circle is an equal opportunity employer and as such, we do not discriminate on the basis of race, color, religion, sex, sexual orientation, gender identity, national origin, age, disability, or any other characteristic protected by applicable laws.</div><div>If you require any accommodations during the recruitment process, please let us know and we will work with you to meet your needs.</div>","tags":"[\"B2B\",\"aws\"]","pubDate":"2024-05-31 15:23:07.210","link":"https://jobs.lever.co/circleco/a1231188-b9c2-4bf9-a083-2dc545839e5b","savedDate":"2024-06-09 04:52:24.389","slug":"senior-demand-generation-manager-circle-1911"},{"id":1012976919,"title":"Jr. New Product Introduction Specialist / New Grad","company":"Ciceksepeti","image":"https://lever-client-logos.s3.us-west-2.amazonaws.com/de4eebbf-97f1-4bdb-b542-4fa65a0b48ab-1662467464737.png","description":"<div><b style=\"font-size: 16px\">Bir teknolojisi firması olarak faaliyet gösterdiğimiz tüm pazarlarda lider olmak vizyonuyla çıktığımız yolda bize katılmak ister misiniz?</b></div><div><br></div><div><span style=\"font-size: 16px\">Kurumsalın alışılagelmiş ifadelerinden ve hiyerarşiden uzak heyecan verici bir kariyere başlamak için en iyi yönlerini ortaya çıkarmaya hazır, dinamik, entelektüel açıdan meraklı genç profesyoneller arıyoruz. Hızla büyümeye devam eden bir teknoloji şirketi olarak gerçek hayatta yaşanan sorunları çözme ve profesyonel yaşamı deneyimleme imkanı sunuyoruz. Yaptığın işin tüm sorumluluğunu almak istiyorsan, işine katkı sağlayacak yeni fikirlerin olduğunda sesini duyurmak istiyorsan ve olağanüstü bir işbaşında eğitim deneyimi yaşamaya hazırsan; o zaman meydan okumaya hazırsın. Bu heyecana ortak olup başarımızı daha da ileriye taşıyacak</span><b style=\"font-size: 16px\"> Jr. New Product Introduction Specialist / New Grad </b><span style=\"font-size: 16px\">arıyoruz.</span></div><h3>🎯 Sorumluluklar</h3><li>Sitede açılacak yeni aranjmanlarla ilgili ürün çekimi planlaması yapmak</li><li>Ürünlerin sitede yer alması için yapılan tüm işlemlerin takibini yapmak</li><li>İlgili ürünlerin web sitemizdeki konumlandırmasını ve performansını takip ederek ilgili aksiyonları proaktif bir şekilde almak</li><li>Mevcut işi geliştirmek ve müşteri memnuniyetini artırmak için sürekli olarak ürünler ve alt kategoriler aramak</li><li>Sitede açılacak ürünlerle ilgili fiyatlandırma ve karlılık çalışmalarını yürütmek</li><li>Müşterilerimize en uygun fiyatlandırma seçeneklerini sunmak için rakip analizi ve pazar araştırması çalışmalarını yapmak</li>,<h3>✨Aranan Nitelikler</h3><li>En az lisans mezunu</li><li>Etkin sözlü ve yazılı iletişim becerisine sahip</li><li>Sorumluluk sahibi, iş odaklı ve disiplinli</li><li>Takım çalışmasına yatkın</li><li>Yoğun, tempolu esnek çalışma saatlerine uyum sağlayabilecek</li><li>MS Office Programlarını iyi kullanabilen</li><li>Haftada en az 2 gün merkez ofis (Zincirlikuyu’da) çalışabilecek</li><div><b>😍 Hakkımızda</b></div><div><br></div><div>En kolay ve ekonomik yoldan çiçek göndermeyi sağlamak için 2006’da kurulan <a href=\"http://ciceksepeti.com/\"><u>ciceksepeti.com</u></a>, Türkiye genelinde 55.000+ iş ortağı ve 70’den fazla ile gönderimini sağladığı binlerce siparişle, Türkiye'deki en büyük online çiçekçidir.😎</div><div><br></div><div>Çiçeksepeti; çiçek aranjmanları, kek ve kurabiye buketlerinin yanı sıra kişiselleştirilmiş hediyeler ile müşterilerine binlerce alternatif sunarak özel günlerde ilk akla gelen e-ticaret firmasıdır. Türkiye'deki başarı hikâyemizi, LolaFlora markası ile Meksika'da sürdürürken, bir teknoloji firması olarak, hediye alanındaki pazar liderliğimizi yeni iş modellerimize de taşımak vizyonu ile emin adımlarla ilerliyoruz. 💃</div><div><br></div><div>\"İşe alım süreçlerimizde kişisel verilerinizi nasıl işlediğimize dair bilgiye çalışan adayı aydınlatma metnimizden ulaşabilirsiniz./ Please see our candidate privacy note for information on how we process your personal data during our recruitment activities.\"</div><div><a href=\"https://cdn03.ciceksepeti.com/editor/hr/Ciceksepeti_CS-Teknoloji-Calisan-Adayi_Aydinlatma-Metni-15092023.pdf\">https://cdn03.ciceksepeti.com/editor/hr/Ciceksepeti_CS-Teknoloji-Calisan-Adayi_Aydinlatma-Metni-15092023.pdf</a></div><div><a href=\"https://cdn03.ciceksepeti.com/editor/hr/Ciceksepeti_CS-Teknoloji-Calisan-Adayi_Aydinlatma-Metni-15092023.docx.pdf\">https://cdn03.ciceksepeti.com/editor/hr/Ciceksepeti_CS-Teknoloji-Calisan-Adayi_Aydinlatma-Metni-15092023.docx.pdf</a></div>","tags":"[]","pubDate":"2024-05-31 14:51:15.244","link":"https://jobs.lever.co/ciceksepeti/ce806576-e4e3-40a3-b0a5-33b9bfca4f70","savedDate":"2024-06-09 04:52:24.391","slug":"jr-new-product-introduction-specialist-new-grad-ciceksepeti-6405"},{"id":8987686232,"title":"Senior Contract Administrator","company":"Airalo","image":"https://lever-client-logos.s3.us-west-2.amazonaws.com/55028a36-609c-479c-9553-d4689ff2dd8c-1669620566663.png","description":"<div><b>About Airalo</b></div><div>Alo! Airalo is the world’s first eSIM store that helps people connect in over 200+ countries and regions across the globe. We are building the next digital service that revolutionizes the telecom industry. We are a travel-tech company and an equal-opportunity environment that values and executes diversity, inclusion, and equity. Our team is spread across 50+ countries and six continents. What glues us together is our commitment to changing the way you connect<span style=\"font-size: 13.3333px\">. </span></div><div><br></div><div><b>About you</b></div><div>We hope that you care deeply about the quality of your work, the intrinsic worth of tasks, and the success of your team. You are self-disciplined and do not require micromanagement in terms of your skillset and work ethic. You do your best to flourish as an individual every day while working hard to foster a collaborative team environment. You believe in the importance of being — and staying — authentic, honest, positive, and kind. You are a good interlocutor with clear and concise communication. You are able to manage multiple projects, have an analytical mind, pay keen attention to detail, and love to get your hands dirty. You are cognizant, tolerant, and welcoming of vulnerabilities and cultural differences.</div><div><br></div><div><b>About the Role</b></div><div><b>Position</b>: Full-time / Employee</div><div><b>Location:</b>&nbsp;Remote-first </div><div><b>Benefits:</b>&nbsp;Health Insurance, work-from-anywhere stipend, annual wellness &amp; learning credits, annual all-expenses-paid company retreat in a gorgeous destination &amp; other benefits</div><div><br></div><div>Airalo is looking for a talented and motivated <b>Senior Contract Administrator</b> to join our team and support our growth as we expand into multiple additional global markets while building our B2B &amp; B2B2C offerings. In this role, you will have the opportunity to be one of the first members of the legal team, working closely with the head of our Legal department &amp; defining our legal SOPs.</div><div><br></div><div>As <b>a Senior Contract Administrator</b> at Airalo, you will collaborate closely with the head of our legal department and different department directors in the company. You will work on various contractual topics, both well-known and novel, as our technological solutions require creative and proactive legal guidance. You will support a range of products and business areas within Airalo in multiple global locations.</div><h3>Responsibilities include but are not limited to:</h3><li>Provide contract administration support, and assist with drafting, reviewing, negotiating, and managing Statements of Work, Change Requests, Arrangement Letters, Subcontracts, and NDAs, alongside our Director of Legal and commercial teams</li><li>Develop a comprehensive contract management system to track contract status, milestones, and obligations.</li><li>Ensure all contracts comply with applicable laws, regulations, and company policies.</li><li>Work with our networks, partnerships &amp; sales teams, as well as client counterparts to assist with day-to-day service &amp; contract delivery</li><li>Assist with reporting, and documenting commercial and contract risks and issues, following up with contract management leads to coordinate completion of ongoing opportunities</li><li>Assist with drafting weekly, monthly, and quarterly reports in compliance with contract management processes and account delivery requirements</li><li>Assist with the development of a contract awareness program for the revenue team highlighting critical contract terms and conditions</li><li>Provide guidance and training to other team members on contract management practices and policies.</li><li>Resolve any disputes or issues that arise in the execution of contracts.</li><li>Monitor contract performance, ensuring all parties fulfill their contractual obligations.</li><li>Identify potential risks in contract terms and conditions and recommend mitigation strategies.</li><li>Stay updated on industry best practices and emerging trends in contract management.</li>,<h3>Must-haves:</h3><li>Bachelor’s Degree with a minimum 5 years of contractual management experience, either in a practice or in-house environment</li><li>To have some procurement background with knowledge on standard purchasing agreement, Outline agreement, Master Service agreement and Schedule of Works (SOW)</li><li>Comfortable working in a fast-paced environment / experience in communicating and collaborating with cross-functional teams &amp; balance competing priorities and manage several time-sensitive projects at the same time</li><li>Effective interpersonal and communication skills, creative and pragmatic problem-solving skills with strong business acumen</li><li>Good understanding of contract law and principles.</li><li>Excellent negotiation and communication skills.</li><li>Strong analytical and problem-solving abilities</li><li>Strong attention to detail and organizational skills.</li>,<h3>Good to have:</h3><li>Experience working with internet and technology companies</li><li>Experience working with Telco, MNOs &amp; MNVOs</li><div><i>We sincerely thank all applicants in advance for submitting their interest in this opportunity with Airalo. </i></div>","tags":"[\"management\",\"B2C\",\"B2B\",\"legal\",\"aws\"]","pubDate":"2024-05-31 14:41:32.516","link":"https://jobs.lever.co/airalo/77f85759-e3d8-4082-b3b0-e12023400dbe","savedDate":"2024-06-09 04:52:24.389","slug":"senior-contract-administrator-airalo-4498"},{"id":3395345951,"title":"Senior Strategy Manager","company":"Airalo","image":"https://lever-client-logos.s3.us-west-2.amazonaws.com/55028a36-609c-479c-9553-d4689ff2dd8c-1669620566663.png","description":"<div><b>About Airalo</b></div><div>Alo! Airalo is the world’s first eSIM store that helps people connect in over 200+ countries and regions across the globe. We are building the next digital service that revolutionizes the telecom industry. We are a travel-tech company and an equal-opportunity environment that values and executes diversity, inclusion, and equity. Our team is spread across 50+ countries and six continents. What glues us together is our commitment to changing the way you connect<span style=\"font-size: 13.3333px\">. </span></div><div><br></div><div><b>About you</b></div><div>We hope that you care deeply about the quality of your work, the intrinsic worth of tasks, and the success of your team. You are self-disciplined and do not require micromanagement in terms of your skillset and work ethic. You do your best to flourish as an individual every day while working hard to foster a collaborative team environment. You believe in the importance of being — and staying — authentic, honest, positive, and kind. You are a good interlocutor with clear and concise communication. You are able to manage multiple projects, have an analytical mind, pay keen attention to detail, and love to get your hands dirty. You are cognizant, tolerant, and welcoming of vulnerabilities and cultural differences.</div><div><br></div><div><b>About the Role</b></div><div><b>Position</b>: Full-time / Employee</div><div><b>Location:</b>&nbsp;Remote-first </div><div><b>Benefits:</b>&nbsp;Health Insurance, work-from-anywhere stipend, annual wellness &amp; learning credits, annual all-expenses-paid company retreat in a gorgeous destination &amp; other benefits</div><div><br></div><div>Airalo is looking for a <b>Senior Strategy Manager</b> to join its Strategy team and become a driver in shaping the strategic direction of the company. This position will support in driving critical strategic initiatives and contributing to the company's growth and success. The ideal candidate will have a proven track record in strategy consulting or a similar role, demonstrating exceptional leadership, analytical skills, and a deep understanding of business strategy and business planning.&nbsp;</div><h3>Responsibilities include but are not limited to:</h3><li><b>Strategy planning and execution:</b></li><li>Conduct in-depth research and analysis to support strategic decision-making across various areas, including market analysis, competitive intelligence, and financial modeling.</li><li>Oversee the implementation of strategic initiatives, ensuring alignment across departments and tracking progress against key metrics.</li><li>Manage strategic projects from initiation to completion, ensuring on-time delivery and achieving desired outcomes.</li><li>Identify and evaluate new business opportunities for expansion and growth.</li><li>Monitor industry trends and competitive landscape, providing regular updates to the strategy team.</li><li>Identify potential risks and opportunities for the company.</li><li>Support the implementation of good corporate governance practices.</li><li>Assist in the development and maintenance of corporate governance policies and procedures.</li><li>Represent the company's interests at local, national, and international levels by engaging with governments, stakeholders, and the public. This involves shaping public policy, managing the company's reputation, and promoting corporate social responsibility.</li><li><b>Corporate Development and M&amp;A:</b></li><li>Support the preparation of investor materials and participate in investor meetings as needed</li><li>Develop and maintain relationships with existing and potential investors and strategic partners.</li><li>Support in the development of M&amp;A strategy and framework</li><li>Assist in the identification, evaluation, and execution of potential M&amp;A transactions, including due diligence and financial analysis</li><li>Ensure to have an always up-to-date pitch deck and data room for the company</li><li><b>Investor Relations:</b></li><li>Facilitate communication between the executive team and the board of directors.</li><li>Prepare and distribute materials for board meetings, including agendas, reports, and presentations.</li><li>Coordinate logistics for board meetings, ensuring that all necessary information is provided to board members in a timely manner.</li><li>Assist in the implementation of board decisions and resolutions.</li><li>Develop and implement strategies to enhance shareholder value and promote confidence in the organization.</li><li>Address shareholder concerns and inquiries, ensuring a positive and transparent communication process</li>,<h3>Must-haves:</h3><li>Bachelor's degree in a relevant field, such as business administration, economics, finance or engineering.</li><li>4+ years of experience in strategy consulting, corporate strategy, or a related field, with a focus on technology or telecommunications.</li><li>Strong analytical and problem-solving skills, with the ability to synthesize complex information and develop actionable recommendations.</li><li>Excellent communication and interpersonal skills, with the ability to build relationships and influence stakeholders at all levels.</li><li>Demonstrated experience in M&amp;A transactions, due diligence, financial modeling, and strategic planning.</li>,<h3>Good to have:</h3><li>MBA or equivalent advanced degree from a top-tier institution</li><li>Demonstrated leadership experience, with the ability to manage and mentor a team of high-performing individuals.</li><div><i>We sincerely thank all applicants in advance for submitting their interest in this opportunity with Airalo. </i></div>","tags":"[\"Finance\",\"management\",\"engineering\"]","pubDate":"2024-05-30 18:56:40.638","link":"https://jobs.lever.co/airalo/7202b204-d486-4e76-96da-a975f637e50d","savedDate":"2024-06-09 04:52:24.390","slug":"senior-strategy-manager-airalo-485"},{"id":5753684720,"title":"Growth Marketing Director - Paid Social","company":"Empower","image":"https://lever-client-logos.s3.us-west-2.amazonaws.com/2e1a369c-b58f-41ac-8d86-4b0a77695e68-1687915522032.png","description":"<div><b style=\"font-size: 12pt\">EMPOWER OVERVIEW</b></div><div><a href=\"http://empower.me/\" style=\"font-size: 12pt\" class=\"postings-link\">Empower</a><span style=\"font-size: 12pt\"> is a financial technology company on a mission to expand access to fair credit and give anyone in the world the opportunity to improve their financial security and mobility. Our vision is to underwrite the next billion people in the world using alternative data and machine learning to assess financial responsibility more thoughtfully and equitably. Through innovative credit products, offered in a user-friendly mobile experience, we’re making credit more accessible and inclusive and providing more people the chance they deserve to participate in our financial </span><a href=\"http://system.Empower\" class=\"postings-link\"><span style=\"font-size: 12pt\">system.Empower</span></a><span style=\"font-size: 12pt\"> is backed by Sequoia Capital, Blisce, and Icon Ventures. Are we the next great place for you to increase your impact and accelerate your career? We think so:Inc. ranked Empower #56 in the 2023 Inc. 5000 list of the fastest-growing private companies in the US (#55 in 2022). Forbes put Empower on its 2023 list of America's Best Startup Employers. Fast Company recognized the new Empower Thrive line of credit in their 2022 list of the Next Big Things in </span><a href=\"http://Tech.THE\" class=\"postings-link\"><span style=\"font-size: 12pt\">Tech.</span></a></div><div><br></div><div><a href=\"http://Tech.THE\" class=\"postings-link\"><b style=\"font-size: 12pt\">THE</b></a><b style=\"font-size: 12pt\"> EMPOWER WAY</b></div><div><b style=\"font-size: 12pt\">Great Expectations</b><span style=\"font-size: 12pt\">: We come up with bold, audacious goals for ourselves and go all out for impact</span></div><div><b style=\"font-size: 12pt\">Owner Mindset</b><span style=\"font-size: 12pt\">: We give every employee latitude to act independently, make smart choices, and move the business forward</span></div><div><b style=\"font-size: 12pt\">Spirited Debate</b><span style=\"font-size: 12pt\">: We love skeptics and seek counter opinions to challenge our personal assumptions and expand our view</span></div><div><b style=\"font-size: 12pt\">Customer Obsession:</b><span style=\"font-size: 12pt\"> We listen to understand, empathize, and create a memorable, rewarding experience for our community</span></div><div><b style=\"font-size: 12pt\">Inclusive Collaboration</b><span style=\"font-size: 12pt\">: We believe diverse teams make the best decisions, and we strive to give diverse voices a seat at the table</span></div><div><b style=\"font-size: 12pt\">No Jerks Allowed</b><span style=\"font-size: 12pt\">: We value our relationships and take the time to build trust and connection and communicate respectfully</span></div><div><b style=\"font-size: 12pt\">WHAT EMPOWER OFFERS</b><span style=\"font-size: 12pt\">Competitive salaryGenerous equity packageFull healthcare benefitsTechnology expense reimbursementWork from anywhere</span></div><div><br></div><div><b style=\"font-size: 12pt\">JOB DESCRIPTION</b></div><div><span style=\"font-size: 12pt\">Empower is looking for an exceptional digital marketing leader who can holistically own critical channels for our growth including Meta and TikTok. As the leader of Paid Social, you will be responsible for creating and executing a strategy to profitably and sustainably grow your channels as well as day to day management of the channels. We are looking for someone who is on the cutting edge of how to win on Meta and TikTok and is effective across campaign management, analytics, measurement and attribution, ad creative, A/B testing, and technical setup including event / data </span><a href=\"http://passbacks.Experience\" class=\"postings-link\"><span style=\"font-size: 12pt\">passbacks. </span></a></div><div><br></div><div><a href=\"http://passbacks.Experience\" class=\"postings-link\"><span style=\"font-size: 12pt\">Experience</span></a><span style=\"font-size: 12pt\"> in Financial Services / FinTech and in mobile app marketing are valued but not </span><a href=\"http://required.Travel\" class=\"postings-link\"><span style=\"font-size: 12pt\">required. Travel</span></a><span style=\"font-size: 12pt\"> for company offsites is expected a minimum of 2 times per </span><a href=\"http://year.ResponsibilitiesChannel\" class=\"postings-link\"><span style=\"font-size: 12pt\">year.</span></a></div><div><br></div><h3>Responsibilities</h3><li><b>Channel Ownership:</b> Working with your direct report(s), manage the channels on a constant basis, ensuring we deliver on ROAS targets within budget and compliance</li><li><b>Strategic Leadership: </b>Develop the holistic strategy for growing the channels on a short- and long-term basis and effectively partner with key teammates across Creative, Product and Engineering, Data Science, Credit, Compliance, and beyond to quickly bring it to life</li><li><b>Measurement and Attribution: </b>Develop and iterate on the approach for measuring channel performance, effectively accounting for the differences in best-class approaches between android and iOS</li><li><b>Grow Profitably: </b>Invest spend at ROAS above hurdle rate, with a focus on growing the channel volume profitably while avoiding underwater marginal spendTest and Learn: Build constant pipeline of A/B tests spanning creative, product terms and claims, bid and campaign management methodologies</li><li><b>Win with the Consumer: </b>Create and execute an ad creative strategy that continuously unlocks new insights and delivers new winners across multiple static and video ad formats and across differing channel placements</li>,<h3>Qualifications</h3><li>Bachelors or Graduate Degree in a quant-related field such as Economics, Business, Engineering, Analytics</li><li>5+ years of experience in digital marketing with 3+ on Meta and/or TikTok including experience managing a $10M+ annual budget</li><li>Demonstrated track record of driving growth in Paid Social Marketing</li><li>Strategic thinker with excellent analytical, organizational, and problem-solving skills</li><li>Proficiency on ad platforms and in analytical tools such as Excel and Tableau</li><li>Outstanding communication and interpersonal abilities to engage with all levels of the organization and external stakeholders</li><div><span style=\"font-size: 12pt\">At Empower, we hire for people that push themselves to understand others and seek out ways to challenge their personal assumptions. Our hope is that by fostering such an environment, we strengthen our business and relationships by putting people first. We are committed to building a diverse, inclusive, and equitable workspace where everyone (regardless of age, education, ethnicity, gender, sexual orientation, or any personal characteristics) feels like they belong. Even if your experience doesn’t exactly match up to our job description, you should feel empowered to apply regardless!</span></div>","tags":"[\"management\",\"engineering\"]","pubDate":"2024-05-30 16:26:50.214","link":"https://jobs.lever.co/empower.me/8d67acdf-f393-476c-8175-9acf3a0b31c5","savedDate":"2024-06-09 04:52:24.388","slug":"growth-marketing-director-paid-social-empower-1780"},{"id":1487181785,"title":"Lead, Business Development (Remote)","company":"DuckDuckGo","image":"https://spreadprivacy.com/content/images/2023/05/duckduckgo-logo_wide.png","description":"<p><br /></p>\n<p>Hi, we’re DuckDuckGo, the Internet privacy company for everyone who wants to take back their privacy now. For over a decade, we've been building our all-in-one product, developing new privacy technology, and working with policymakers to make online privacy simple and accessible for all. </p>\n<p><br /></p>\n<p>Our app is now downloaded more than 78M times a year, and our private search engine packaged with it has become the #2 search engine on mobile in the United States and 18 other countries, including the United Kingdom, Canada, Australia, Germany, and the Netherlands. Oh, and we've been profitable since 2014, with revenue exceeding $100 million a year! Now, we’re rolling out a suite of new privacy solutions, including <u><a href=\"https://spreadprivacy.com/meetprivacypro/\" rel=\"noopener\">Privacy Pro</a></u>,  <u><a href=\"https://spreadprivacy.com/introducing-app-tracking-protection/\" rel=\"noopener\">App Tracking Protection</a></u>and our first-ever Desktop Apps for <u><a href=\"https://spreadprivacy.com/introducing-duckduckgo-for-mac/\" rel=\"noopener\">Mac</a></u><a href=\"https://spreadprivacy.com/introducing-duckduckgo-for-mac/\" rel=\"noopener\"> </a>and <u><a href=\"https://spreadprivacy.com/windows-browser-open-beta/\" rel=\"noopener\">Windows</a></u>.</p>\n<p><br /></p>\n<p>We’re looking for a <em>Lead, Business Development</em> to help shape our all-in-one privacy solution and join our mission to show the world that protecting your privacy online can be simple.  </p>\n<p><br /></p>\n<p><strong>The Opportunity</strong> </p>\n<p>In this role, you will lead end-to-end partnerships deals, supporting future products and distribution to help scale revenue opportunities and expand functionality to improve our services.</p>\n<p><br /></p>\n<p>You will lead the evaluation and execution of these deals with little oversight, creating clear rationale for proposed partnerships, building internal consensus, and negotiating and executing partnerships. You will also manage and nurture relationships with existing partners, pursuing opportunities to expand partnerships while contributing to strategy development by identifying, scoping, and pursuing business development opportunities.</p>\n<p><br /></p>\n<p>As someone comfortable navigating complex business organizations, you will demonstrate effective project management skills coordinating and guiding alignment with internal teams, such as product, engineering, and design, to support organizational needs and execute partner integrations, as well as both internal and external legal resources to structure and close on business deals.</p>\n<p><br /></p>\n<p><strong>What You Will Bring to DuckDuckGo</strong> </p>\n<ol><li>10+ years of business development experience, including 5+ years of leadership experience.</li><li>Proven success in similar roles, identifying and developing business opportunities, and structuring and closing large deals, ideally in a web or software-based business. </li><li>Experience negotiating complex deals including the ability to draft term sheets and contract language.</li><li>Experience navigating complicated business org structures, identifying and reaching decision-makers, crafting proposals and driving successful outcomes, while taking full ownership of deals and seeing them through completion. </li><li>Experience with search, digital advertising, or software subscription and in-app purchase models, with strong awareness of established and disruptive brands.</li><li>Team-oriented and able to collaborate with others both within and beyond our functional team.</li><li>Focused critical thinking and problem-solving skills — you devise improvements to processes and contribute to strategy at the project and objective level.</li><li>Superior level of communication demonstrated either within your functional team or through large scale cross-functional projects, preferably at a global scale tech company.</li></ol>\n<p><br /></p>\n<p><br /></p>\n<p><strong>How We Will Support You </strong> </p>\n<p>Our core values -- build trust, question assumptions, and validate direction -- underpin how we work day-to-day and the support we give our team members. We strive to empower our team members to be self-directed and self-motivated in their work.  </p>\n<p><br /></p>\n<ol><li><strong>Remote First, Always</strong>: We've always been a fully distributed company with team members all over the world. We trust you to get your work done wherever, and whenever. (*Please note that applicants for this role must be based in the United States or Canada)  </li><li><strong>Commitment to Personal Growth:</strong> Every team member has an annual budget of $1,250 USD to invest in their professional development. <em>For team members in designated leadership roles, we offer reimbursement for leadership coaching services. The reimbursement amount varies by professional level.</em> Every team member also has a dedicated Career Advisor, who serves as a guide to help you develop your strengths, identify your motivations, and understand your opportunities for growth. </li><li><strong>Leadership:</strong> We have many different types of leaders and possible combinations of leadership roles, so you can grow your career in a way that aligns best with your personal goals. You can seek additional leadership roles by being directly responsible for projects, taking ownership of areas of the company, developing and maintaining internal processes, or pursuing advisory roles. </li><li><strong>Work/Life Balance: </strong>Team members have the freedom and flexibility to organize their own work schedules. We want you to thrive both in and out of the office. We trust you to use good judgment and take the time off that you need to bring your best self to work.  </li></ol>\n<p><br /></p>\n<p>We also offer paid parental leave, a co-working stipend, office setup reimbursement, and a wellness stipend. More support resources can be found in our <u><a href=\"https://duckduckgo.com/assets/hiring/team_support_guide.pdf\" rel=\"noopener\">Team Member Support Guide</a></u>, which explains how we make your well-being a priority. </p>\n<p><br /></p>\n<p>For more information on how we collaborate worldwide, from leadership in our relatively flat organization to start-to-finish ownership<strong>,</strong> check out <u><a href=\"https://duckduckgo.com/assets/hiring/how_we_work.pdf\" rel=\"noopener\">DuckDuckGo Culture: How We Work.</a></u> </p>\n<p><br /></p>\n<p><strong>Compensation</strong> </p>\n<p>Annual compensation: $198,000 - $220,000 USD and stock options. Compensation is the same within a professional level, regardless of geographic location or functional area, and the compensation for each professional level is transparent across the organization.</p>\n<p><br /></p>\n<p><strong>Hiring Process</strong> </p>\n<p>Hiring works best when it's a two-way street. Learn how we help you get to know DuckDuckGo and envision your future role here. Find out more about <u><a href=\"https://duckduckgo.com/assets/hiring/how_we_hire.pdf\" rel=\"noopener\">how we hire</a></u>. </p>\n<p><br /></p>\n<p><strong>Diversity, Equity, and Inclusion</strong> </p>\n<p>DuckDuckGo provides equal work opportunities to all team members and applicants<u>,</u> and it prohibits discrimination and harassment of any type on the basis of race, color, ethnicity, caste, religion, age, sex (including pregnancy), national origin, disability status, genetics, protected veteran status, sexual orientation, gender identity or expression, or any other characteristic protected by our policies or federal, state, or local laws.</p>\n<p><br /></p>\n<p>We want to ensure that our hiring process is accessible. If you need reasonable accommodation for any part of the application process because of a medical condition or disability, please send an email to <u><a href=\"mailto:careers@duckduckgo.com\" rel=\"noopener\">careers@duckduckgo.com</a></u> to let us know the nature of your request.  </p>\n<p><br /></p>\n<p>If you think you might thrive in this environment, we would love to hear from you. </p>\n<p><br /></p>\n<p><strong>Please note that:</strong> </p>\n<ol><li>Sometimes we meet up! Expect to travel at least two times a year: once for our all-hands meetup and again for a team retreat (each around 4-5 days). While extenuating circumstances may impact attendance, everyone is strongly encouraged to attend.</li><li>While we offer a flexible work arrangement with no core hours, expect an average full-time commitment of 40 hours per week. </li><li>A successful candidate will be subject to a background check and must receive satisfactory results of the same, as a condition of joining the team. </li><li>By applying for this role, you confirm that all information submitted is accurate and complete. You further acknowledge that providing false or fraudulent information during the application process is cause for denial of an offer, revocation of any existing offer, or other adverse action, up to and including termination after the start of your commencement of work.</li></ol>\n<p>#US #CN</p>","tags":"[\"management\",\"engineering\",\"legal\",\"aws\"]","pubDate":"2024-05-30 12:25:36.000","link":"https://duckduckgo.recruitee.com/o/lead-business-development-remote-uscanada","savedDate":"2024-06-09 04:52:24.380","slug":"lead-business-development-remote-duckduckgo-6751"},{"id":5622407611,"title":"Performance Marketing Manager (Remote)","company":"Empower","image":"https://lever-client-logos.s3.us-west-2.amazonaws.com/2e1a369c-b58f-41ac-8d86-4b0a77695e68-1687915522032.png","description":"<div><b style=\"font-size: 24px\">EMPOWER OVERVIEW</b></div><div><br></div><div><a href=\"http://empower.me/\" class=\"postings-link\">Empower</a>&nbsp;is a high-growth financial technology company on a mission to expand access to fair credit to give anyone in the world the opportunity to improve their financial security and mobility. We dream up and launch one-of-a-kind features that help our members get money instantly whenever they need it, save for the future, and rewrite their financial story. Our members see Empower Cash Advance as a life-saver, Empower Automatic Savings as a game-changer, and the new Empower Thrive line of credit (currently in beta, launching soon) as a lifeline to low-cost borrowing and the only practical path to building good credit.</div><div><br></div><div>Empower is backed by Sequoia Capital, Blisce, and Icon Ventures. Are we the next great place to grow your impact and accelerate your career? We think so:</div><div><br></div><div>Inc. ranked Empower #56 in the 2023 Inc. 5000 list of the fastest-growing private companies in the US (#55 in 2022). Forbes put Empower on its 2023 list of America's Best Startup Employers. Fast Company recognized the new Empower Thrive line of credit in their 2022 list of the Next Big Things in Tech. </div><div><br></div><div><b style=\"font-size: 18px\">THE EMPOWER WAY</b></div><div><b>Great Expectations</b>: We come up with bold, audacious goals for ourselves and go all out for impact</div><div><b>Owner Mindset</b>: We give every employee latitude to act independently, make smart choices, and move the business forward</div><div><b>Spirited Debate</b>: We love skeptics and seek counter opinions to challenge our personal assumptions and expand our view</div><div><b>Customer Obsession: </b>We listen to understand, empathize, and create a memorable, rewarding experience for our community</div><div><b>Inclusive Collaboration</b>: We believe diverse teams make the best decisions, and we strive to give diverse voices a seat at the table</div><div>N<b>o Jerks Allowed</b>: We value our relationships and take the time to build trust and connection and communicate respectfully</div><div><br></div><div><b style=\"font-size: 18px\">WHAT EMPOWER OFFERS</b></div><div><span style=\"font-size: 11pt\">Competitive salary</span></div><div><span style=\"font-size: 11pt\">Generous equity package</span></div><div><span style=\"font-size: 11pt\">Full healthcare benefits</span></div><div><span style=\"font-size: 11pt\">Technology expense reimbursement</span></div><div><span style=\"font-size: 11pt\">Work from anywhere</span></div><div><br></div><div><b style=\"font-size: 18px\">JOB DESCRIPTION</b></div><div><span style=\"font-size: 11pt\">Empower is seeking a Performance Marketing Manager to lead Paid Social campaigns and drive new customer acquisition efficiently and profitably. This role will be responsible for all aspects of digital campaign management, from setup and operations to reporting and creative project management. The ideal candidate is a quick learner and a resourceful problem solver with a keen attention to detail and a knack for connecting with customers on Meta and TikTok. This position reports to the Senior Manager of Performance Marketing.</span></div><div><br></div><div>Travel for company offsites is expected at a minimum 2 times a year. </div><h3>Key Responsibilities</h3><li>Develop and execute paid acquisition strategies and campaigns to drive cost-efficient acquisition of marketing qualified leads</li><li>Analyze and report on campaign, ad set, and creative performance to translate data into actionable insights and recommendations to achieve team KPIs</li><li>Design and launch statistically sound A/B tests to prove the effectiveness of marketing tactics and creative assets</li><li>Manage the ad creation process from start to finish, including organizing creative brainstorms, writing creative briefs, and launching campaigns</li><li>Develop new creative concepts and value propositions to improve advertising effectiveness and reach qualified new customers&nbsp;</li><div><br></div>,<h3>Candidate Qualifications</h3><li>Proven ability to create, manage, and optimize paid growth campaigns on Meta and TikTok, with accountability for performance metrics like CPA, ROAS, and LTV</li><li>Track record of paid growth experimentation and experience managing monthly budgets of $500,000+</li><li>Proficient in Excel and Google Sheets, with exceptional results orientation and agility</li><li>Knowledge of the ad-tech stack for mobile acquisition, including tracking and measurement (MMP &amp; SKAdNetwork), bid management, and attribution</li><li>Experience developing a strong creative pipeline for advertising</li><li>Ability to build reports and pull data with minimal support</li><li>Able to work independently and meet deadlines</li><div>At Empower, we hire for people that push themselves to understand others and seek out ways to challenge their personal assumptions. Our hope is that by fostering such an environment, we strengthen our business and relationships by putting people first. We are committed to building a diverse, inclusive, and equitable workspace where everyone (regardless of age, education, ethnicity, gender, sexual orientation, or any personal characteristics) feels like they belong. Even if your experience doesn’t exactly match up to our job description, you should feel empowered to apply regardless!&nbsp;</div>","tags":"[\"management\"]","pubDate":"2024-05-29 16:24:40.421","link":"https://jobs.lever.co/empower.me/fb6d4f02-42b8-4836-b3dd-ddaddd7897b8","savedDate":"2024-06-09 04:52:24.388","slug":"performance-marketing-manager-remote-empower-8999"},{"id":3224273607,"title":"Technical Writer (English) - Freelance AI tutor","company":"Mindrift","image":"https://remotive.com/job/1915907/logo","description":"<p>If you're a <strong>professional technical writer/editor</strong>, we have an exciting opportunity to use your language skills in a new and innovative way. Instead of thinking that <strong>AI</strong> will replace you, here you can help shape the future of <strong>AI</strong>.</p>\n<p>We are working on several projects that require excellent English skills and familiarity with coding documentation. Following our style guide and other quality guidelines, you will create and check responses that will form the “<strong>voice</strong>” of <strong>future AI</strong>. You will create and edit original, helpful, honest, and harmless responses; fact check existing responses; bring submitted texts up to our standards; and work directly with Team Leads to help provide feedback to writers and other participants to ensure they can regularly produce high-quality work.</p>\n<p><br><br><strong>Requirements</strong></p>\n<p> </p>\n<ul style=\"\">\n<li style=\"\">At least <strong>1 year of professional experience</strong> in writing and editing technical documentation related to <strong>software development</strong>.</li>\n<li style=\"\">An ability to understand technical terminology and basic code samples in a variety of programming languages.</li>\n<li style=\"\">Familiarity with various rich-text formats, including YAML, CSV, and HTML.</li>\n<li style=\"\">A degree in a field related to English, technical communication, journalism, computer science, or similar.</li>\n<li style=\"\"><strong>Native level of English.</strong></li>\n<li style=\"\">Willingness to learn new methods, ability to switch between projects and topics quickly and sometimes work with challenging, complex guidelines.</li>\n<li style=\"\">A laptop, internet connection, availability, and enthusiasm to take on new challenges.</li>\n</ul>\n<p><br><br><strong>Benefits</strong><br><br></p>\n<p><strong>AI Training</strong> will be a fast-growing area in the future. We offer an opportunity to jump onboard, learn with us and create a new skill set for the future.</p>\n<p>This is a freelance role; it can be done part time alongside other work, although we do hope that you’ll dive deep with us, join our community, and collaborate and grow alongside us.</p>\n<p> </p>\n<img src=\"https://remotive.com/job/track/1915907/blank.gif?source=public_api\" alt=\"\"/>","tags":"[\"html\",\"AI/ML\",\"documentation\",\"editing\",\"technical documentation\",\"computer science\"]","pubDate":"2024-05-29 04:49:14.000","link":"https://remotive.com/remote-jobs/writing/technical-writer-english-freelance-ai-tutor-1915907","savedDate":"2024-06-09 04:52:24.378","slug":"technical-writer-english-freelance-ai-tutor-mindrift-5096"},{"id":8961648655,"title":"Senior Engineering Manager, Creators & Economy","company":"VRChat","image":"https://pbs.twimg.com/profile_images/1719900921793003520/qPc3pV09_400x400.jpg","description":"<div><span style=\"font-size: 24px\">Join the VRChat Team!</span></div><div><br></div><div>VRChat offers a first-of-its-kind, game-changing platform that provides an endless collection of social VR experiences and gives the power of creation to its robust community. With over 250,000 worlds and growing, VRChat’s vision is to allow users to bring their imaginations to life and help shape the metaverse anywhere in the world on any device. VRChat has raised $100M to date with the support of investors Makers Fund, Anthos Capital and HTC. We have a great team which includes people from: Netflix, Twitter, Meta, Microsoft, Roblox, Google, Amazon, Unity, Spotify, Discord, Uber, eBay, Robinhood, Twitch, Zynga and TikTok.</div><div><br></div><div>Come and join the mission!</div><div><br></div><div><span style=\"font-size: 24px\">Job Overview</span></div><div><br></div><div>The Senior Engineering Manager for the Creators &amp; Economy is a critical leadership role at VRChat. This person is accountable for the technical direction for the Creator and Economy teams which own critical strategic functions across all VRChat platforms.&nbsp;</div><div><br></div><div>The Creator team manages all external facing SDKs and interactions with our creator community that drives our UGC based platform. This team helps build the tools and standards to empower a large community of engaged creators that power the magic behind our platform.</div><div><br></div><div>The Economy team is responsible for all of our revenue driving mechanics and features helping to maintain the health of the business. Specifically, this team is tasked with helping to build up our Creator Economy which rewards our creators for the amazing work they do and allows VRChat users to unlock incredible value on the platform. The Economy Team also owns VRChat Plus, our monthly subscription program that allows for deeper customization and user value.</div><div>&nbsp;</div><div>As one of the Creator and Economy Team Leads, the Senior Engineering Manager will work collaboratively, along with product and design leads, to define those teams’ strategies and direction. This management position reports into the VP of Engineering at VRChat and will work closely with a dedicated cross functional team, heads of various functions, and periodically interact with the exec team</div><div><br></div><h3>Duties and Responsibilities</h3><li>Take ownership of core VRChat systems, including our Creator SDK and payment systems, partnering closely with product, design and engineering leaders across the company to ensure we are supporting their ongoing needs.</li><li>Take ownership of the technical decisions for the Creator and Economy Teams, partnering closely with product, design and engineering leaders to ensure the right balance of quality, speed of execution, and scalability.</li><li>Directly manage, support and inspire a team of approximately 20 engineers across multiple disciplines including API and client.</li><li>Foster a positive and high functioning team with solid technical practices that delivers timely and quality software.</li><li>Create the short and long term strategy for this space, and align it with higher level vision and strategy across the company.</li><li>Contribute to a smooth and collaborative planning process to generate plans that reflect strategic goals, user insights and past learnings.</li><li>Make critical tradeoffs to ensure the long-term health and development of our platform.</li><li>Represent progress at periodic reviews and seek leadership support in a timely manner to unblock execution.</li><li>Partner with production to manage execution and work collaboratively to resolve issues to deliver against goals and objectives.&nbsp;</li><li>Stay current on industry trends and best practices in the technology behind gaming, UGC and social platforms to inform strategic decisions.</li><li>Develop and maintain strong relationships with key stakeholders, including internal teams, creators, partners, and the broader VRChat community.</li><li>Support the VP Engineering in critical strategy, organization and execution areas.</li>,<h3>Experience, Skills, and Qualifications</h3><li>3+ years of engineering management in a high-growth consumer or b2b tech company and solid technical background.</li><li>Excellent verbal and written communication skills which are particularly important in our fully remote environment.</li><li>Technical experience with Unity or 3D gaming development is a plus.</li><li>Past expertise in virtual economies, e-commerce, gaming, UGC and/or social platforms is a plus, though not required.</li><li>University degree or equivalent work experience with technical background</li><li>Experience defining metrics and making product and strategic decisions based on measurable impact.</li><li>Intellectually curious about new technologies and societal changes, and understands how to apply innovations and trends to product opportunities.</li><li>Comfortable dealing with ambiguity and operating in a fast-paced and evolving environment.</li>,<h3>Benefits</h3><li>Work from anywhere! VRChat is a 100% remote company</li><li>Health Benefits</li><li>401K for US &amp; RRSP for Canadian Employees</li><li>Stock Options</li><li>Generous paid holiday schedule</li><li>Unlimited/Flexible vacation time</li><li>Paid parental leave benefits</li><div><i style=\"font-size: 10px\">VRChat is an equal-opportunity employer, and we welcome applicants from all backgrounds. VRChat fosters a diverse, creative, and collaborative environment where anyone can contribute to any of the ongoing projects or direction of the roadmap at any time.  If you’re a passionate team player who wants to have an impact on a dynamic team, we’d love to hear from you!</i></div>","tags":"[\"management\",\"engineering\",\"B2B\"]","pubDate":"2024-05-28 15:39:38.339","link":"https://jobs.lever.co/vrchat/915c1c93-14c4-462f-9b2c-0458da7a4b1f","savedDate":"2024-06-09 04:52:24.387","slug":"senior-engineering-manager-creators-economy-vrchat-1618"},{"id":6112371596,"title":"Senior Engineering Manager, Consumer Experience","company":"VRChat","image":"https://pbs.twimg.com/profile_images/1719900921793003520/qPc3pV09_400x400.jpg","description":"<div><span style=\"font-size: 24px\">Join the VRChat Team!</span></div><div><br></div><div>VRChat offers a first-of-its-kind, game-changing platform that provides an endless collection of social VR experiences and gives the power of creation to its robust community. With over 250,000 worlds and growing, VRChat’s vision is to allow users to bring their imaginations to life and help shape the metaverse anywhere in the world on any device. VRChat has raised $100M to date with the support of investors Makers Fund, Anthos Capital and HTC. We have a great team which includes people from: Netflix, Twitter, Meta, Microsoft, Roblox, Google, Amazon, Unity, Spotify, Discord, Uber, eBay, Robinhood, Twitch, Zynga and TikTok.</div><div><br></div><div>Come and join the mission!</div><div><br></div><div><span style=\"font-size: 24px\">Job Overview</span></div><div><br></div><div>The Senior Engineering Manager for the Experience team is a critical leadership role at VRChat. This person is accountable for the technical direction of the Experience team which owns the core experience for users across all VRChat platforms. This includes the “core loop” of VRChat, platform performance, Trust &amp; Safety, and anything aimed at improving the engagement for VRChat users. As one of the Experience Team Leads, the Senior Engineering Manager will work collaboratively along with product and design leads to define the team’s strategy and direction.</div><div><br></div><div>This management position reports into the VP of Engineering at VRChat and will work closely with a dedicated cross-functional team, heads of various functions, and periodically interact with the exec team.</div><div><br></div><h3>Duties and Responsibilities</h3><li>Take ownership of the core VRChat experience, partnering closely with product, design and engineering leaders across the company to ensure we are supporting their ongoing needs.</li><li>Take ownership of the technical decisions for the Experience Team, partnering closely with product, design and engineering leaders to ensure the right balance of quality, speed of execution, and scalability.</li><li>Directly manage, support and inspire a team of approximately 20 engineers across multiple disciplines including API and client.</li><li>Foster a positive and high functioning team with solid technical practices that delivers timely and quality software.</li><li>Create the short and long term strategy for this space, and align it with higher level vision and strategy across the company.</li><li>Contribute to a smooth and collaborative planning process to generate plans that reflect strategic goals, user insights and past learnings.</li><li>Make critical tradeoffs to ensure the long-term health and development of our platform.</li><li>Represent progress at periodic reviews and seek leadership support in a timely manner to unblock execution.</li><li>Partner with production to manage execution and work collaboratively to resolve issues to deliver against goals and objectives.&nbsp;</li><li>Stay current on industry trends and best practices in the technology behind gaming, UGC and social platforms to inform strategic decisions.</li><li>Develop and maintain strong relationships with key stakeholders, including internal teams, creators, partners, and the broader VRChat community.</li><li>Support the VP Engineering in critical strategy, organization and execution areas.</li>,<h3>Experience, Skills, and Qualifications</h3><li>3+ years of engineering management in a high-growth consumer or b2b tech company and solid technical background.</li><li>Excellent verbal and written communication skills which are particularly important in our fully remote environment.</li><li>Technical experience with Unity or 3D gaming development is a plus.</li><li>Past expertise in virtual economies, e-commerce, gaming, UGC and/or social platforms is a plus, though not required.</li><li>University degree or equivalent work experience with technical background</li><li>Experience defining metrics and making product and strategic decisions based on measurable impact.</li><li>Intellectually curious about new technologies and societal changes, and understands how to apply innovations and trends to product opportunities.</li><li>Comfortable dealing with ambiguity and operating in a fast-paced and evolving environment.</li>,<h3>Benefits</h3><li>Work from anywhere! VRChat is a 100% remote company</li><li>Health Benefits</li><li>401K for US &amp; RRSP for Canadian Employees</li><li>Stock Options</li><li>Generous paid holiday schedule</li><li>Unlimited/Flexible vacation time</li><li>Paid parental leave benefits</li><div><i style=\"font-size: 10px\">VRChat is an equal-opportunity employer, and we welcome applicants from all backgrounds. VRChat fosters a diverse, creative, and collaborative environment where anyone can contribute to any of the ongoing projects or direction of the roadmap at any time.  If you’re a passionate team player who wants to have an impact on a dynamic team, we’d love to hear from you!</i></div>","tags":"[\"management\",\"engineering\",\"B2B\"]","pubDate":"2024-05-28 15:31:15.907","link":"https://jobs.lever.co/vrchat/70754187-7678-40bd-bfd5-045c3583ad3d","savedDate":"2024-06-09 04:52:24.387","slug":"senior-engineering-manager-consumer-experience-vrchat-836"},{"id":4664500995,"title":"VIDEO EDITOR (Work from anywhere in the world)","company":"Wishpond","image":"https://scontent.fcmb4-2.fna.fbcdn.net/v/t39.30808-6/273499217_5218973671480777_3308731762242867065_n.jpg?_nc_cat=110&ccb=1-7&_nc_sid=efb6e6&_nc_ohc=YDi_Wd17RD8AX9wXcyR&_nc_zt=23&_nc_ht=scontent.fcmb4-2.fna&oh=00_AfB4sOOYpj6VyDSuvvuqhVnZbH22m89SqG99HwaOa-uslw&oe=65BE4336","description":"<div><b style=\"font-size: 18px\">Wishpond Technologies currently has the position of  VIDEO EDITOR available, and we’re excited to tell you about it!</b></div><div><span style=\"font-size: 22px\">&nbsp;</span></div><div><b style=\"font-size: 24px\">OVERVIEW</b></div><div><span style=\"font-size: 15px\">We are searching for a Video Editor to join our team on a full-time basis.&nbsp; This is a fully remote position and the successful individual could be based anywhere in the world. You will work with an amazing remote team servicing and building&nbsp;relationships with&nbsp;clients based in the US and Canada.&nbsp;In collaboration with the Design Team and all departments, the Video Editor is responsible for the success of Wishpond Technologies Ltd.&nbsp; Please note : this positions does require you to display your previous skills and experience in your demo reel.</span></div><div>&nbsp;</div><div><b style=\"font-size: 24px\">RESPONSIBILITIES</b></div><div>• <span style=\"font-size: 15px\">Develop storyboards for social media video ads</span></div><div>• <span style=\"font-size: 15px\">Edit client’s assets / products in Photoshop to later use in videos</span></div><div>• <span style=\"font-size: 15px\">Create engaging videos using images, text and footage for social media in various sizes and orientations</span></div><div>• <span style=\"font-size: 15px\">Convert short videos into gifs optimized for web</span></div><div>• <span style=\"font-size: 15px\">Optimize existing videos for various social platforms, including vertical for stories</span></div><div>• <span style=\"font-size: 15px\">Execute creative editing, color correction, sound mixing</span></div><div>• <span style=\"font-size: 15px\">Create outstanding graphics for ads and posts (mainly Facebook and Instagram ads)</span></div><div>• <span style=\"font-size: 15px\">Design static banners and gifs for email templates</span></div><div>• <span style=\"font-size: 15px\">Tell stories using compelling motion graphics, animation and video</span></div><div>• Other duties as assigned</div><div><br></div><div><b style=\"font-size: 24px\">QUALIFICATIONS</b></div><div>• <span style=\"font-size: 15px\">A minimum of 3 years experience in a similar role</span></div><div>• <span style=\"font-size: 15px\">Proficiency in Adobe's creative suite, primarily Adobe Premiere, After Effects, Photoshop and Illustrator</span></div><div>• <span style=\"font-size: 15px\">Knowledge in sound design software such as Audition is an asset</span></div><div>• <span style=\"font-size: 15px\">In-depth knowledge of video editing workflow, formats, codecs, plug-ins</span></div><div>• <span style=\"font-size: 15px\">Versatility in working on different formats for marketing videos</span></div><div>• <span style=\"font-size: 15px\">Good understanding of current social video trends</span></div><div>• <span style=\"font-size: 15px\">Experience with Motion Graphics</span></div><div>• Knowledge of production standards and best practices for social platforms (Twitter, Facebook, Instagram, YouTube, TikTok, Snapchat, etc.)</div><div>• <span style=\"font-size: 15px\">Experience with Graphic Design</span></div><div>• <span style=\"font-size: 15px\">A degree or diploma that contributes to the role and the operation would be considered an asset</span></div><div>• <span style=\"font-size: 15px\">Must be detail oriented, creative and have a passion for marketing</span></div><div>• <span style=\"font-size: 15px\">Self-motivated with the ability to establish and maintain solid relationships through a client-first mentality&nbsp;</span></div><div>• <span style=\"font-size: 15px\">As part of a diverse team, ability to work both independently and collaboratively </span></div><div>• <span style=\"font-size: 15px\">Must be technical, analytical, results-driven and have the ability to multi-task in a fast-paced environment</span></div><div>• <span style=\"font-size: 15px\">Organized, administratively strong, and have solid writing, phone, and general communication skills</span></div><div>• <span style=\"font-size: 15px\">Fluent in English (spoken and written). Knowledge of a second language is considered an asset</span></div><div>• <span style=\"font-size: 15px\">Willing to participate in ongoing education and training for the role</span></div><div><br></div><div><b style=\"font-size: 24px\">WORK ENVIRONMENT</b></div><div>• It is expected that the successful candidate will provide their own workstation, computer, and headset, and have a fast and reliable internet connection.&nbsp;Certain roles will be required to utilize and or download company-approved software.</div><div>• The individual must be prepared to work standard business hours on EST or PST</div><div>• Due to the nature of this role, we may verify backgrounds including conducting employment references, criminal record, and credit checks.</div><div>• Once hired, the successful candidate must provide a valid government-issued photo ID and proof of residential address as part of their onboarding process.</div><div><br></div><div><b style=\"font-size: 24px\">GREAT REASONS TO JOIN OUR TEAM !</b></div><div>• Fully remote position allowing you to <b>work from your home anywhere in the world !</b></div><div>• Exciting and dynamic environment with a great leadership team&nbsp;</div><div>• Comprehensive training program and regular performance reviews to facilitate your success</div><div>• Competitive compensation based on experience and proven abilities</div><div>• Great referral programs with incentives and bonuses</div><div>• Unbelievable product discounts when you use our products for your own business</div><div>• A global workforce of multi-cultural and talented colleagues&nbsp;</div><div>• A close-knit operation with amazing growth opportunities for your personal development</div><div>• A high growth SaaS technology company publicly traded on the TSX Venture Exchange</div><div>• Corporate headquarters in beautiful Vancouver, British Columbia, Canada</div><div>• Access to our education credits program and so much more !</div><div><br></div><div><b style=\"font-size: 24px\">ABOUT US</b></div><div>Founded in 2009, Wishpond is a rapidly growing technology company providing digital marketing solutions targeted at small businesses.&nbsp; The cloud-based platform includes landing pages, social promotions, website pop-ups, online forms, and lead activity tracking. Wishpond has a dedicated team of professional project managers, designers, copywriters, and developers who provide marketing services tailored to our individual clients.</div><div>&nbsp;</div><div>Wishpond serves over 3,000 customers in various industries and sizes, from startups to large Fortune 500 companies. Wishpond has a rapidly growing global headcount and continues to hire dedicated and qualified employees and contractors who have what it takes to scale a successful software company.</div><div><br></div><div>To learn more about Wishpond Technologies, please visit our website or any of our social media platforms:</div><div><br></div><div>• Website: <a href=\"http://www.wishpond.com/\" class=\"postings-link\">www.wishpond.com</a></div><div>• Instagram: @wishpondofficial</div><div>• Twitter: Wishpond</div><div>• Youtube: Thewishpond</div><div>• LinkedIn : Wishpond</div><div><br></div><div><b style=\"font-size: 24px\">APPLICATION PROCESS</b></div><div><b>If you are interested in applying for this exciting opportunity, please provide an updated resume in English (PDF or Word formats only), quoting the position title in the subject line of your cover letter</b></div><div>&nbsp;<b>&nbsp;</b></div><div>Wishpond Technologies is an equal-opportunity employer committed to hiring a diverse workforce and sustaining an inclusive culture that does not discriminate on the basis of disability, status, or any other basis protected under legislation</div><div>&nbsp;</div><div>We thank all applicants in advance for their interest in this position however due to the volume of applications we receive, we are unable to respond to phone, email, or agency inquiries.</div>","tags":"[]","pubDate":"2024-05-28 15:03:16.921","link":"https://jobs.lever.co/wishpond/07b6dd78-f6d7-4d96-8022-c7bc551504a5","savedDate":"2024-06-09 04:52:24.387","slug":"video-editor-work-from-anywhere-in-the-world-wishpond-9362"}]