[{"id":2476019408,"title":"Senior .NET Software Engineer","company":"Aiwyn","image":"https://www.aiwyn.ai/hubfs/Aiwyn%20Favicon.jpg","description":"<div><b>Who is Aiwyn and what do we do?</b></div><div><br></div><div>Aiwyn is the fastest-growing software company serving the accounting profession.&nbsp;Founded in 2020, we now work with 100+ of the largest CPA firms in the world.&nbsp;Our “Job to be done”: speed up cash flow, save Partner time, &amp; deliver best-in-class client experiences. We do this by automating day-to-day firm operations with our Practice Automation solutions. Aiwyn is led by serial entrepreneurs with multiple exits and funded by top-tier investors (Bessemer, KKR, &amp; Revolution). We're passionate about building a remarkable company with world-class people, processes, and technology.</div><div><br></div><div>To learn more, visit our <a rel=\"noopener noreferrer\" class=\"postings-link\" href=\"https://aiwyn.ai/\"><b>website</b></a></div><div><b>Who is Aiwyn and what do we do?</b></div><div><br></div><div>Aiwyn is the fastest-growing software company serving the accounting profession.&nbsp;Founded in 2020, we now work with 100+ of the largest CPA firms in the world.&nbsp;Our “Job to be done”: speed up cash flow, save Partner time, &amp; deliver best-in-class client experiences. We do this by automating day-to-day firm operations with our Practice Automation solutions. Aiwyn is led by serial entrepreneurs with multiple exits and funded by top-tier investors (Bessemer, KKR, &amp; Revolution). We're passionate about building a remarkable company with world-class people, processes, and technology.</div><div><br></div><div>To learn more, visit our <a href=\"https://aiwyn.ai/\" class=\"postings-link\" target=\"_blank\" rel=\"noopener noreferrer\"><b>website</b></a></div><h3>What You'll Do:</h3><li><b>Design &amp; Develop: </b>Create robust, scalable software solutions using the Microsoft technology stack, while maintaining high code quality standards. You'll implement complex features in C#, contribute to architectural decisions, and help shape our cloud-native applications on Azure.</li><li><b>Collaborate &amp; Deliver: </b>Work within agile teams to deliver high-quality features, participate in code reviews, and contribute to technical discussions. You'll help identify and resolve technical challenges while ensuring timely delivery of solutions.</li><li><b>Problem Solve &amp; Innovate: </b>Tackle complex technical problems, propose innovative solutions, and contribute to improving our development practices, tooling, and system reliability.</li><h3>What We Need:</h3><li>5+ years of experience in C# and the .NET ecosystem (.NET 6 or later preferred).</li><li>Experience with Azure services including App Services, Azure Functions, Key Vault, and Azure DevOps.</li><li>Proficiency in working with Microsoft SQL Server, including designing schemas, writing stored procedures, and optimizing queries.</li><li>Solid understanding of object-oriented programming, asynchronous programming, and software design principles.</li><li>Ability to write clean, maintainable, and testable code.</li><li>Demonstrated ability to analyze and solve complex technical problems across cloud-based, distributed systems.</li><li>Capable of identifying performance bottlenecks and implementing effective solutions.</li><li>Strong commitment to code quality and automated testing.</li><li>Familiarity with testing frameworks such as xUnit/NUnit.</li><li>Experience implementing CI/CD pipelines in Azure DevOps or GitHub Actions.</li><li>Ability to clearly communicate technical concepts and decisions.</li><li>Active participant in code reviews and technical design discussions.</li><li>Effective team player with experience working in agile teams.</li><li>Willingness to mentor junior developers and share knowledge with peers.</li><li>Familiarity with event-driven systems and RESTful APIs.</li><li>Understanding of system monitoring and observability in Azure environments (e.g., Application Insights, Log Analytics).</li><h3>Preferred:</h3><li>Proficient with front-end frameworks (e.g., Angular, React, or Blazor).</li><li>Experience with Azure Data Factory, Logic Apps, or other data integration tools.</li><li>Capable of building UI automation processes for production use with tools like Selenium.</li><li>Actively involved with contributing to system architecture and design.</li><li>Adept at doing integrations with third-party systems&nbsp;</li><li>Track record of mentoring and growing engineering talent.</li><h3>Why Work at Aiwyn?</h3><li>The big-picture value proposition of this role is simple: join us, and you'll be paid competitively to have freedom in solving worthwhile, challenging problems alongside other A-players at a fast-growing SaaS startup led by an experienced and successful team with industry experience.</li><div><br></div><div>Other benefits include:</div><li><b>Adventure travel stipend</b> - you receive a $1,000 travel reimbursement on your work anniversary each year. We encourage our team to recharge and explore the world beyond their home office walls.</li><li><b>Remote, work-from-anywhere culture</b></li><li><b>Flexible PTO</b></li><li><b>World Class health benefits</b> - we believe in fostering flourishing teams by providing benefits that go beyond the usual standards - Health, vision, dental, HSA/FSA, and mental health support.</li><li><b>Stock options</b> - every Full Time Employee has ownership in Aiwyn's future and success.</li><li><b>401(k) matching</b></li><h3>Our Values:</h3><li><b>Trust</b> - We champion transparency, welcome differing perspectives, uphold accountability, and trust that others have good intentions</li><li><b>Courage</b> - We have the courage to take calculated risks and embrace change, knowing what worked in the past won’t always work in the future</li><li><b>Impact</b> - Rooted in determination and innovation, we chase extraordinary outcomes and impactful results</li><li><b>Relentlessness</b> - We approach challenges with an unwavering resolve, never settling for mediocrity, and always striving to surpass expectations</li><h3>Learn more about Aiwyn</h3><li><a rel=\"noopener noreferrer\" class=\"postings-link\" href=\"https://www.aiwyn.ai/about\"><b>About us</b></a></li><li><a rel=\"noopener noreferrer\" class=\"postings-link\" href=\"https://www.aiwyn.ai/why-aiwyn\"><b>Why Aiwyn</b></a></li><li><a rel=\"noopener noreferrer\" class=\"postings-link\" href=\"https://www.youtube.com/@AiwynAI\"><b>YouTube page</b></a></li><div>Aiwyn is an equal opportunity employer. All qualified applicants will receive consideration for employment without regard to age, ancestry, color, family or medical care leave, gender identity or expression, genetic information, marital status, medical condition, national origin, physical or mental disability, political affiliation, protected veteran status, race, religion, sex (including pregnancy), sexual orientation, or any other characteristic protected by applicable laws, regulations and ordinances.</div><div><br></div><div>Candidate information will be treated in accordance with our CCPA privacy notice which can be found here: <a rel=\"noopener noreferrer\" class=\"postings-link\" href=\"https://www.aiwyn.ai/ccpa\">https://www.aiwyn.ai/ccpa</a></div>","tags":"[\"engineering\",\"aws\"]","pubDate":"2025-04-15T21:17:42.609Z","link":"https://jobs.lever.co/aiwyn/c0a6eab7-69e7-46d2-b4e5-0fa11a1ab3d2","slug":"senior-net-software-engineer-aiwyn-944"},{"id":3090667808,"title":"Implementation Engineer [IC3] ","company":"Sourcegraph","image":"https://avatars.githubusercontent.com/u/3979584?s=200&v=4","description":"&lt;div class=&quot;content-intro&quot;&gt;&lt;h2&gt;&lt;span style=&quot;color: rgb(243, 78, 63);&quot;&gt;&lt;strong&gt;Who we are&lt;/strong&gt;&lt;/span&gt;&lt;/h2&gt;\n&lt;p&gt;Our mission at Sourcegraph is to make it so that &lt;a href=&quot;https://www.notion.so/sourcegraph/Mission-values-e9d37e6b972a4ef395c3076aea2bd07d?pvs=4&quot;&gt;everyone can code&lt;/a&gt;, not just ~0.1% of the population.&amp;nbsp;&lt;/p&gt;\n&lt;p&gt;We are transforming how the world’s most important companies build software by industrializing development with AI. Today, most professional developers spend a disproportionate amount of time understanding code and performing repetitive, low-level tasks—leaving less time for innovation and meaningful impact.&lt;/p&gt;\n&lt;p&gt;We’re changing that. Sourcegraph brings AI-powered search and agents to the enterprise, helping teams automate the mundane and amplify what developers do best— solving hard problems and creating great products.&lt;/p&gt;\n&lt;p&gt;Here’s how we’re making a difference:&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;&lt;strong&gt;Accelerating developers &lt;/strong&gt;with AI agents that deliver insights and precision—enabling 5x faster test creation, 30% increase in merge requests, and saving 20 minutes per developer daily.&lt;/li&gt;\n&lt;li&gt;&lt;strong&gt;Automating repetitive tasks,&lt;/strong&gt; from remediating vulnerabilities (saving teams 1,000+ hours annually) to speeding up migrations that would take years to months.&amp;nbsp;&lt;/li&gt;\n&lt;li&gt;&lt;strong&gt;Enabling innovation&lt;/strong&gt; by addressing complex problems like automated bug triage, vulnerability detection, and AI-driven code reviews seamlessly integrated into workflows.&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;Trusted by 7/10 top software companies by market cap, 4/6 top US banks and many of the companies leading global innovation, like Stripe, Indeed, Tesla, and 1Password, and with $225M in funding from investors like &lt;a href=&quot;https://techcrunch.com/2021/07/13/sourcegraph-raises-125m-series-d-on-2-6b-valuation-for-universal-code-search-tool/&quot;&gt;a16z&lt;/a&gt;, &lt;a href=&quot;https://about.sourcegraph.com/blog/series-c-with-sequoia/&quot;&gt;Sequoia&lt;/a&gt;, and &lt;a href=&quot;https://www.redpoint.com/companies/sourcegraph/&quot;&gt;Redpoint&lt;/a&gt;, we are building the tools that will define the next era of enterprise software development.&lt;/p&gt;\n&lt;p&gt;If you’re passionate about solving the hardest problems in software and shaping the future of technology, join us. Let’s build something extraordinary together.&lt;/p&gt;&lt;/div&gt;&lt;h2&gt;&lt;span style=&quot;color: rgb(243, 78, 63);&quot;&gt;&lt;strong&gt;Hours &amp;amp; location&lt;/strong&gt;&lt;/span&gt;&lt;/h2&gt;\n&lt;p&gt;🌎 While we hire &lt;a href=&quot;https://sourcegraph.notion.site/How-we-engage-talent-outside-of-the-US-218f7193695a46cbb1ef39ef9c1f72d4&quot;&gt;almost anywhere&lt;/a&gt; in the world, we have a preference for someone to reside on the east coast of the United States for this role. However, if you feel qualified, we welcome you to apply regardless of location. No matter what, working hours must overlap with the Eastern Time Zone for at least 30 hours/week.&lt;/p&gt;\n&lt;p&gt;We do not subscribe to “I do my best work when I work 40 hours a week.”&amp;nbsp; People we hire at Sourcegraph believe that building outstanding things means working very hard — smarter and more hours than the competition.&lt;/p&gt;\n&lt;h2&gt;&lt;span style=&quot;color: rgb(243, 78, 63);&quot;&gt;&lt;strong&gt;Why this job is exciting&amp;nbsp;&lt;/strong&gt;&lt;/span&gt;&lt;/h2&gt;\n&lt;p&gt;As an Implementation Engineer at Sourcegraph, you&#39;ll deliver our powerful code intelligence platform to some of the world&#39;s most innovative companies. You&#39;ll provide white-glove implementation services using our Kubernetes and Docker Compose deployment solutions, working directly with elite engineering organizations that prioritize developer experience. This role offers exceptional growth potential as you partner with customers to solve complex problems related to Sourcegraph’s product while reducing their time-to-value by giving expert implementation support within their environments. If you&#39;re passionate about developer tools and want to make a tangible difference in how the world&#39;s best engineering teams work with code, this opportunity allows you to bridge technical and business worlds while directly impacting customer satisfaction and success.&lt;/p&gt;\n&lt;p&gt;📅 Within one month, you will…&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;Start building a trusting relationship with your peers on the Solutions Engineering, Customer Success, Support, and Release teams.&lt;/li&gt;\n&lt;li&gt;Learn about our product, our value proposition, our customers, our team, and our processes.&lt;/li&gt;\n&lt;li&gt;Learn about our deployment methodologies, options, best practices, and limitations.&lt;/li&gt;\n&lt;li&gt;Join customer and prospect calls with some of our largest (fortune 500) customers to understand their technical challenges and needs.&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;📅 Within three months, you will…&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;Work directly with Sales and Technical Success counterparts to lead our customers to success: troubleshooting, debugging, tuning and configuring Sourcegraph deployments.&lt;/li&gt;\n&lt;li&gt;Propose, scope, design, and implement various deployment architectures with customers in their own environments.&lt;/li&gt;\n&lt;li&gt;Educate and enable technical admins within our customers to successfully configure and subsequently maintain their environments through best practices.&lt;/li&gt;\n&lt;li&gt;Help optimize internal customer success metrics by partnering with technical admins and users.&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;📅 Within six months and beyond, you will…&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;Collaborate closely with Product on what you observe and learn from customers to drive product improvements in the future.&lt;/li&gt;\n&lt;li&gt;Work closely with Sales and Technical Success to improve the overall customer experience.&lt;/li&gt;\n&lt;li&gt;Iterate on existing processes, templates, and tools to better service our customers.&lt;/li&gt;\n&lt;/ul&gt;\n&lt;h2&gt;&lt;span style=&quot;color: rgb(243, 78, 63);&quot;&gt;&lt;strong&gt;About you&lt;/strong&gt;&lt;/span&gt;&lt;/h2&gt;\n&lt;p&gt;You are an enthusiastic, driven, and results-oriented technologist who shares our values and has a passion for leading customers to technical success.&lt;/p&gt;\n&lt;p&gt;🔍 Your skillset:&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;Strong experience with microservices architecture and container orchestration technologies including&amp;nbsp; Docker, Docker Compose, Kubernetes, Helm, Kustomize, on-premise deployment managements solutions such as OpenShift, and cloud-native managed Kubernetes services such as EKS, GKE, and AKS.&lt;/li&gt;\n&lt;li&gt;Working experience with a range of customer environments, complexities, and deployment methods including both on-premise and cloud-native architectures.&lt;/li&gt;\n&lt;li&gt;Experience managing customer deployments on their behalf: project management, maintenance, upgrades, monitoring and performance tuning.&lt;/li&gt;\n&lt;li&gt;Scripting capabilities (such as in Python/Go/Terraform) either for addressing ad hoc requirements or for automation needs.&lt;/li&gt;\n&lt;li&gt;In using your skills to provide solutions for customers, you’re able to identify shortcomings and opportunities to share this experience internally with the product team.&lt;/li&gt;\n&lt;li&gt;Demonstrated ability to identify and articulate shortcomings and opportunities to share this experience internally with the product and engineering teams.&lt;/li&gt;\n&lt;li&gt;Ability to communicate and explain technical concepts to non-technical audiences.&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;💪 Nice to haves:&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;Certified Kubernetes Application Developer (CKAD) and/or AWS Cloud Architect certifications are highly desired.&lt;/li&gt;\n&lt;li&gt;Bachelor&#39;s degree in Computer Science or equivalent professional experience as a Software Engineer.&lt;/li&gt;\n&lt;li&gt;Experience deploying, managing, or optimizing Large Language Models (LLMs) in production environments.&lt;/li&gt;\n&lt;/ul&gt;\n&lt;h2&gt;&lt;span style=&quot;color: rgb(243, 78, 63);&quot;&gt;&lt;strong&gt;Level&lt;/strong&gt;&lt;/span&gt;&lt;/h2&gt;\n&lt;p&gt;📊 This job is an IC3.&amp;nbsp; You can read more about &lt;a href=&quot;https://www.notion.so/sourcegraph/Leveling-Guide-0e1b5c76ada64b9caac387f8b7c4fc66&quot;&gt;our job leveling philosophy&lt;/a&gt; in our Handbook.&lt;/p&gt;\n&lt;h2&gt;&lt;span style=&quot;color: rgb(243, 78, 63);&quot;&gt;&lt;strong&gt;Compensation&lt;/strong&gt;&lt;/span&gt;&lt;/h2&gt;\n&lt;p&gt;&lt;strong&gt;💸 We pay you an above-average salary&lt;/strong&gt; because we want to hire the best people who are fully focused on helping Sourcegraph succeed, not worried about paying bills. As an &lt;a href=&quot;https://sourcegraph.notion.site/Mission-values-e9d37e6b972a4ef395c3076aea2bd07d&quot;&gt;open and transparent&lt;/a&gt; company that values &lt;a href=&quot;https://www.notion.so/sourcegraph/Compensation-Pay-Transparency-at-Sourcegraph-d58d0774f51b4b489d41c3628d30ff8d?pvs=4&quot;&gt;competitive compensation&lt;/a&gt;, our compensation ranges are visible to every single Sourcegraph teammate.&lt;/p&gt;\n&lt;p&gt;Your salary is determined by your pay band for the IC3 job level. For determining pay bands, we use a number of market and data-driven salary sources, along with your location zone, and target the high-end of the range to ensure we’re always paying above market regardless of where you live in the world. Both U.S. and international locations are divided into one of four zones, determined by the cost of labor index for each area. The salary for a successful candidate will be based on level, job-related skills, experience, qualifications, and location zone. Please note that the salaries below may be adjusted in the future.&lt;/p&gt;\n&lt;p&gt;💰 The target compensation for this role is based on the IC3 &amp;nbsp;pay band for your zone. The IC3 &amp;nbsp;pay band for each zone is listed below:&lt;/p&gt;\n&lt;p&gt;Zone 1: $155,000 USD&lt;br&gt;Zone 2: $124,000 USD&lt;/p&gt;\n&lt;p&gt;Please speak with a recruiter for additional information regarding zone locations.&lt;/p&gt;\n&lt;p&gt;📈 In addition to our cash compensation, we offer equity (because when we succeed as a company, we want you to succeed, too) and generous&amp;nbsp;&lt;a href=&quot;https://sourcegraph.notion.site/Benefits-Perks-dd1da4b6b3a64780abed010a144d34ba&quot;&gt;perks &amp;amp; benefits&lt;/a&gt;.&lt;/p&gt;\n&lt;h2&gt;&lt;span style=&quot;color: rgb(243, 78, 63);&quot;&gt;&lt;strong&gt;Interview process&amp;nbsp;&lt;/strong&gt;&lt;/span&gt;&lt;/h2&gt;\n&lt;p&gt;&lt;em&gt;Below is the interview process you can expect for this role (you can read more about &lt;/em&gt;&lt;a href=&quot;https://sourcegraph.notion.site/Types-of-interviews-f279f080583d49ee9f2c60e30c8cb1f7&quot;&gt;&lt;em&gt;the types of interviews&lt;/em&gt;&lt;/a&gt;&lt;em&gt; in our Handbook). It may look like a lot of steps, but rest assured that we move quickly and the steps are designed to help you get the information needed to determine if we’re the right fit for you… Interviewing is a two-way street, after all!&amp;nbsp;&lt;/em&gt;&lt;/p&gt;\n&lt;p&gt;We expect the interview process to take 3.5 hours in total.&amp;nbsp;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;👋 Introduction Stage&lt;/strong&gt; - we have initial conversations to get to know you better…&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;[30m]&amp;nbsp; &lt;a href=&quot;https://www.notion.so/sourcegraph/Types-of-interviews-sample-questions-f279f080583d49ee9f2c60e30c8cb1f7?pvs=4#99be5ff628b2414194a0ba79d9f25f13&quot;&gt;Recruiter Screen&lt;/a&gt;&lt;/li&gt;\n&lt;li&gt;[45m] &lt;a href=&quot;https://www.notion.so/sourcegraph/Types-of-interviews-sample-questions-f279f080583d49ee9f2c60e30c8cb1f7?pvs=4#1919882c0cf147c487eb1df40db8a694&quot;&gt;Hiring Manager Screen&lt;/a&gt; / &lt;a href=&quot;https://www.notion.so/sourcegraph/Types-of-interviews-sample-questions-f279f080583d49ee9f2c60e30c8cb1f7?pvs=4#c678a2a86e0e47e4958507e869bf7ded&quot;&gt;Resume Deep Dive&lt;/a&gt;&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;&lt;strong&gt;🧑‍💻 Team Interview Stage&lt;/strong&gt; - we then delve into your experience in more depth and introduce you to members of the team, including cross-functional partners…&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;[60m] Discussion and Technical Assessment&lt;/li&gt;\n&lt;li&gt;[30m] &lt;a href=&quot;https://www.notion.so/sourcegraph/Types-of-interviews-sample-questions-f279f080583d49ee9f2c60e30c8cb1f7?pvs=4#88b9f826dee04ef98afc2aeec35b877a&quot;&gt;Peer&lt;/a&gt;&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;&lt;strong&gt;🎉 Final Interview Stage &lt;/strong&gt;- we move you to our final round, where you gain a better understanding of our business and values holistically…&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;[30m] &lt;a href=&quot;https://www.notion.so/sourcegraph/Types-of-interviews-sample-questions-f279f080583d49ee9f2c60e30c8cb1f7?pvs=4#e3a04291743048df87541a88aa8199dd&quot;&gt;Values&lt;/a&gt;&lt;/li&gt;\n&lt;li&gt;[15m] &lt;a href=&quot;https://www.notion.so/sourcegraph/How-to-work-with-Quinn-Slack-CEO-807673e0864d473f959cc4efd9642a5a?pvs=4#6f185c0e2011411eac5be9c675f9056c&quot;&gt;Leadership&lt;/a&gt; with co-founder&amp;nbsp;&lt;/li&gt;\n&lt;li&gt;We check references and conduct your background check&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;Please note - you are welcome to request additional conversations with anyone you would like to meet, but didn’t get to meet during the interview process.&lt;/p&gt;&lt;div class=&quot;content-conclusion&quot;&gt;&lt;h2&gt;&lt;span style=&quot;color: rgb(243, 78, 63);&quot;&gt;&lt;strong&gt;Learn more about us&lt;/strong&gt;&lt;/span&gt;&lt;/h2&gt;\n&lt;p&gt;You can learn more about what it is like to work at Sourcegraph by reading &lt;a href=&quot;https://sourcegraph.notion.site/d7614e3e9dc04c09ac2d42d57f1816e6?v=2a6d426dbae14390b155120b0c029ce0&quot;&gt;our handbook&lt;/a&gt;.&lt;/p&gt;\n&lt;p&gt;We are an ambitious team who are collectively working hard to build the most influential company in the world.&amp;nbsp; You can read more about our &lt;a href=&quot;https://sourcegraph.notion.site/What-it-s-like-working-at-Sourcegraph-119a8e11265880b18911eee4d9b7c460#119a8e1126588062b935fc66104b6115&quot;&gt;culture&lt;/a&gt;, &lt;a href=&quot;https://sourcegraph.notion.site/Compensation-Pay-Transparency-at-Sourcegraph-d58d0774f51b4b489d41c3628d30ff8d?pvs=74&quot;&gt;competitive compensation&lt;/a&gt; and &lt;a href=&quot;https://sourcegraph.notion.site/Benefits-Perks-dd1da4b6b3a64780abed010a144d34ba?pvs=74&quot;&gt;benefits&lt;/a&gt; here.&lt;/p&gt;\n&lt;p&gt;Sourcegraph is an equal opportunity workplace; we welcome people from all backgrounds.&amp;nbsp;&lt;/p&gt;\n&lt;p&gt;&lt;em&gt;Sourcegraph participates in &lt;/em&gt;&lt;a href=&quot;https://sourcegraph.notion.site/E-Verify-2ab3286dde3446d6bac2898c83610107&quot;&gt;&lt;em&gt;E-Verify&lt;/em&gt;&lt;/a&gt;&lt;em&gt; for U.S. Employees. &lt;/em&gt;&lt;/p&gt;&lt;/div&gt;","tags":"[\"management\",\"engineering\",\"aws\"]","pubDate":"2025-04-15T20:03:14.000Z","link":"https://job-boards.greenhouse.io/sourcegraph91/jobs/5498640004","slug":"implementation-engineer-ic3-sourcegraph-3886"},{"id":4441050825,"title":"Senior Customer Support Associate","company":"Empower","image":"https://lever-client-logos.s3.us-west-2.amazonaws.com/2e1a369c-b58f-41ac-8d86-4b0a77695e68-1687915522032.png","description":"<p style=\"min-height:1.5em\"><strong>EMPOWER OVERVIEW</strong></p><p style=\"min-height:1.5em\"><a target=\"_blank\" rel=\"noopener noreferrer nofollow\" href=\"http://empower.me/\">Empower</a> is shaking up an outdated financial system by providing real opportunity for our customers: the opportunity to get the cash they need, to access fair credit, and to change their financial story. Today, we’re helping millions of people find financial security through machine learning models that evaluate creditworthiness using a more inclusive lens and mobile-first products: Cash Advance, Thrive line of credit, and Petal credit cards. Tomorrow? Creating even more financial paths for our customers (and their wallets) to succeed.</p><p style=\"min-height:1.5em\">This year, Empower ranked #65 on Inc. 5000’s Fastest-Growing Private Companies list — our third year in a row cracking the top 100 — and was named by Forbes as one of the 25 Next Billion-Dollar Startups for 2024. Empower was also featured by Forbes on America’s Best Startup Employers list in 2023, and our Thrive line of credit product was named by Fast Company as one of 2022’s Next Big Things in Tech.</p><p style=\"min-height:1.5em\">Empower is backed by Sequoia Capital, Blisce, and Icon Ventures. Ready to grow your impact and accelerate your career? Take a look at our open roles — we can’t wait to meet you.</p><p style=\"min-height:1.5em\"></p><p style=\"min-height:1.5em\"><strong>THE EMPOWER WAY</strong></p><p style=\"min-height:1.5em\"><strong>Great Expectations</strong>: We come up with bold, audacious goals for ourselves and go all out for impact</p><p style=\"min-height:1.5em\"><strong>Owner Mindset</strong>: We give every employee latitude to act independently, make smart choices, and move the business forward</p><p style=\"min-height:1.5em\"><strong>Spirited Debate</strong>: We love skeptics and seek counter opinions to challenge our personal assumptions and expand our view</p><p style=\"min-height:1.5em\"><strong>Customer Obsession:</strong> We listen to understand, empathize, and create a memorable, rewarding experience for our community</p><p style=\"min-height:1.5em\"><strong>Inclusive Collaboration</strong>: We believe diverse teams make the best decisions, and we strive to give diverse voices a seat at the table</p><p style=\"min-height:1.5em\"><strong>No Jerks Allowed</strong>: We value our relationships and take the time to build trust and connection and communicate respectfully</p><p style=\"min-height:1.5em\"></p><p style=\"min-height:1.5em\"><strong>WHAT EMPOWER OFFERS</strong></p><p style=\"min-height:1.5em\">Competitive salary</p><p style=\"min-height:1.5em\">Generous equity package</p><p style=\"min-height:1.5em\">Full healthcare benefits</p><p style=\"min-height:1.5em\">Technology expense reimbursement</p><p style=\"min-height:1.5em\">Virtual first environment</p><p style=\"min-height:1.5em\"><br /><strong>JOB DESCRIPTION</strong></p><p style=\"min-height:1.5em\">As a Senior Customer Support Associate, you will lead the management and resolution of escalated issues and helps to improve the overall customer experience at Empower. You will work within the Customer Support team and collaborate with cross-functional teams. In addition, you will monitor leading trends and drivers and engage proactively with the team and our customers before an escalation occurs. </p><p style=\"min-height:1.5em\"></p><p style=\"min-height:1.5em\"><strong>RESPONSIBILITIES </strong></p><ul style=\"min-height:1.5em\"><li><p style=\"min-height:1.5em\">Manage escalations and coordinate resolutions in partnership with the Customer Support Manager and cross-functional teams</p></li><li><p style=\"min-height:1.5em\">Collaborate with the team to resolve problems, and deliver a top-notch customer experience by contributing to customer support-related projects</p></li><li><p style=\"min-height:1.5em\">Develop strong knowledge of customer support pain points to assist both customers and team members</p></li><li><p style=\"min-height:1.5em\">Advocate for customers from within the organization and drive changes to improve their experience </p></li><li><p style=\"min-height:1.5em\">Continuously add value through effective and efficient project management, prioritization, and execution skills</p></li></ul><p style=\"min-height:1.5em\"></p><p style=\"min-height:1.5em\"><strong>QUALIFICATIONS</strong></p><ul style=\"min-height:1.5em\"><li><p style=\"min-height:1.5em\">2-4 years in a customer support role, preferably in the fintech industry</p></li><li><p style=\"min-height:1.5em\">Demonstrated passion for the customer experience, with the ability to quickly and empathetically solve problems for customers</p></li><li><p style=\"min-height:1.5em\">Excellent verbal and written communication skills, with the ability to explain complex topics in easily understood, concise language</p></li><li><p style=\"min-height:1.5em\">Familiarity with banking regulations and payment processes; compliance is a plus </p></li><li><p style=\"min-height:1.5em\">Motivated by Empower’s mission and determined to create a seamless support experience for our customer base</p></li><li><p style=\"min-height:1.5em\">Ability to communicate cross-functionally and globally</p></li><li><p style=\"min-height:1.5em\">Available on some weekends and holidays if needed</p></li></ul><p style=\"min-height:1.5em\">At Empower, we hire for people that push themselves to understand others and seek out ways to challenge their personal assumptions. Our hope is that by fostering such an environment, we strengthen our business and relationships by putting people first. We are committed to building a diverse, inclusive, and equitable workspace where everyone (regardless of age, education, ethnicity, gender, sexual orientation, or any personal characteristics) feels like they belong. Even if your experience doesn’t exactly match up to our job description, you should feel empowered to apply regardless!</p>","tags":"[\"management\"]","pubDate":"2025-04-15T19:04:09.072Z","link":"https://jobs.ashbyhq.com/empower%20finance/ea881225-6763-47c4-9cee-e580d8a6948f","slug":"senior-customer-support-associate-empower-8662"},{"id":8370062347,"title":"Communications Assistant","company":"Winona","image":"https://yt3.googleusercontent.com/k45HnnNMWgPv-xF3D-u2ThxmesDOeU0p02rNJpbRWLes2Z18WpkLgXEE7XuBLkkzN_38AFnp3A=s160-c-k-c0x00ffffff-no-rj","description":"<p style=\"min-height:1.5em\"><strong>About Winona:</strong></p><p style=\"min-height:1.5em\"><a target=\"_blank\" rel=\"noopener noreferrer nofollow\" href=\"https://bywinona.com\">Winona</a> is one of the leading telemedicine companies providing HRT for women in menopause. We’ve built all of our technology in house including an EHR, patient care admin system, patient portal, website, marketing technology etc. Winona has two compounding pharmacies and a team of in house physicians providing world-class care via a fully vertically integrated business model.</p><p style=\"min-height:1.5em\"> </p><p style=\"min-height:1.5em\"><strong>About the role:</strong></p><p style=\"min-height:1.5em\">Winona is looking for a proactive and detail-oriented full-time remote <strong>Communications Assistant</strong> to join our dynamic social team. The Communications Assistant will assist in the execution of PR strategies and campaigns, manage media relations, manage building our influencer network and support various communication efforts. The ideal candidate will have excellent communication skills, a passion for storytelling, and a keen interest in media trends.</p><p style=\"min-height:1.5em\"></p><p style=\"min-height:1.5em\"><strong>Seniority Level:</strong> Junior-Mid Level</p><p style=\"min-height:1.5em\"> </p><p style=\"min-height:1.5em\"><strong>Key Responsibilities:</strong></p><p style=\"min-height:1.5em\">Earned Media &amp; Media Relations</p><ul style=\"min-height:1.5em\"><li><p style=\"min-height:1.5em\">Assist the Head of Social in developing and implementing PR strategies and campaigns.</p></li><li><p style=\"min-height:1.5em\">Draft, distribute, and track media pitches, and other PR materials.</p></li><li><p style=\"min-height:1.5em\">Build and maintain media relationships; handle media inquiries and coordinate interviews.</p></li><li><p style=\"min-height:1.5em\">Engage with reporters on social media.</p></li><li><p style=\"min-height:1.5em\">Maintain and update media contact lists, databases, and distribution lists.</p></li><li><p style=\"min-height:1.5em\">Craft personalized pitches tailored to journalists, enhancing outreach effectiveness.</p></li><li><p style=\"min-height:1.5em\">Track the progress of outreach efforts meticulously.</p></li><li><p style=\"min-height:1.5em\">Conduct research on industry trends, competitors, and media outlets.</p></li><li><p style=\"min-height:1.5em\">Influencer Network Project Management</p></li></ul><p style=\"min-height:1.5em\">Owned Media &amp; Content Strategy</p><ul style=\"min-height:1.5em\"><li><p style=\"min-height:1.5em\">Assist in publishing content on brand-owned channels (blogs, email campaigns, social media).</p></li><li><p style=\"min-height:1.5em\">Collaborate with writers, editors, and contributors to generate content.</p></li><li><p style=\"min-height:1.5em\">Work with our social media manager and sync on any social initiatives </p></li></ul><p style=\"min-height:1.5em\">Media Monitoring &amp; Analysis</p><ul style=\"min-height:1.5em\"><li><p style=\"min-height:1.5em\">Implement and use media monitoring tools to track media coverage.</p></li><li><p style=\"min-height:1.5em\">Monitor media coverage, compile press clippings, and prepare regular reports on PR activities and metrics.</p></li><li><p style=\"min-height:1.5em\">Prepare regular reports on media coverage and campaign performance.</p></li></ul><p style=\"min-height:1.5em\">Corporate Communications</p><ul style=\"min-height:1.5em\"><li><p style=\"min-height:1.5em\">Use various communication channels (email, intranets, Slack) to ensure message delivery.</p></li><li><p style=\"min-height:1.5em\">Organize and maintain PR files, documents, and archives.</p></li><li><p style=\"min-height:1.5em\">Provide administrative support, including scheduling and calendar management.</p></li></ul><p style=\"min-height:1.5em\">PR Reporting</p><ul style=\"min-height:1.5em\"><li><p style=\"min-height:1.5em\">Create and share PR reports with executives and cross-functional teams.</p></li><li><p style=\"min-height:1.5em\">Analyze PR results and communicate their impact on the brand.</p></li><li><p style=\"min-height:1.5em\">Maintain comprehensive outreach efforts for bi-monthly reporting, compiling data and insights.</p></li></ul><p style=\"min-height:1.5em\">Media Measurement</p><ul style=\"min-height:1.5em\"><li><p style=\"min-height:1.5em\">Use metrics to connect PR campaign goals with business outcomes.</p></li><li><p style=\"min-height:1.5em\">Provide insights to improve future PR efforts.</p></li></ul><p style=\"min-height:1.5em\">Speaking Engagements</p><ul style=\"min-height:1.5em\"><li><p style=\"min-height:1.5em\">Assist in organizing and preparing for speaking events and webinars.</p></li><li><p style=\"min-height:1.5em\">Create presentations and talking points for speakers.</p></li><li><p style=\"min-height:1.5em\">Research and identify suitable podcasts for outreach, coordinating efforts with the SEO manager.</p></li><li><p style=\"min-height:1.5em\">Track the progress of podcast appearances.</p></li></ul><p style=\"min-height:1.5em\">Multimedia Development &amp; Visual Storytelling</p><ul style=\"min-height:1.5em\"><li><p style=\"min-height:1.5em\">Support the development of multimedia content.</p></li><li><p style=\"min-height:1.5em\">Ensure consistency with brand positioning and messaging.</p></li></ul><p style=\"min-height:1.5em\">Event &amp; Experiential Marketing</p><ul style=\"min-height:1.5em\"><li><p style=\"min-height:1.5em\">Research PR-related events and venues, contributing to event coordination.</p></li><li><p style=\"min-height:1.5em\">Ensure events align with brand messaging and generate positive media exposure.</p></li></ul><p style=\"min-height:1.5em\">Social Media &amp; PR Sync</p><ul style=\"min-height:1.5em\"><li><p style=\"min-height:1.5em\">Assist in the collaboration between PR and social to highlight new initiatives for maximum coverage.</p></li><li><p style=\"min-height:1.5em\">Oversee and organize all influencer communications and partnership development</p></li><li><p style=\"min-height:1.5em\">Serve as the primary contact for influencer inquiries related to partnerships</p></li><li><p style=\"min-height:1.5em\">Maintain and track influencer contracts and related documentation</p></li><li><p style=\"min-height:1.5em\">Manage all aspects of influencer contract processes</p></li></ul><p style=\"min-height:1.5em\">Data Journalism</p><ul style=\"min-height:1.5em\"><li><p style=\"min-height:1.5em\">Collaborate with data scientists to create marketable stories from data.</p></li><li><p style=\"min-height:1.5em\">Use data to support media pitches and brand content.</p></li></ul><p style=\"min-height:1.5em\">Trend Spotting</p><ul style=\"min-height:1.5em\"><li><p style=\"min-height:1.5em\">Identify and capitalize on emerging media trends.</p></li><li><p style=\"min-height:1.5em\">Use media monitoring tools to spot and act on trends early.</p></li></ul><p style=\"min-height:1.5em\">Reputation Management</p><ul style=\"min-height:1.5em\"><li><p style=\"min-height:1.5em\">Monitor and manage the company’s online reputation.</p></li><li><p style=\"min-height:1.5em\">Research awards and other media opportunities.</p></li></ul><p style=\"min-height:1.5em\">Community Relations</p><ul style=\"min-height:1.5em\"><li><p style=\"min-height:1.5em\">Support efforts to build positive relationships with local communities.</p></li><li><p style=\"min-height:1.5em\">Engage in activities that enhance community goodwill.<br /></p></li></ul><p style=\"min-height:1.5em\"><strong>Requirements:</strong></p><ul style=\"min-height:1.5em\"><li><p style=\"min-height:1.5em\">At least 3 years of experience in PR or Marketing. </p></li><li><p style=\"min-height:1.5em\">Strong writing and communication skills, with the ability to craft clear and compelling messages. </p></li><li><p style=\"min-height:1.5em\">Experience working with media relations, including pitching and managing inquiries. </p></li><li><p style=\"min-height:1.5em\">Experience working with influencers and building a creator network</p></li><li><p style=\"min-height:1.5em\">Familiarity with social media platforms and tools. </p></li><li><p style=\"min-height:1.5em\">Familiarity using ClickUp.</p></li><li><p style=\"min-height:1.5em\">Strong attention to detail and organizational skills. </p></li><li><p style=\"min-height:1.5em\">Ability to work effectively in a fast-paced environment and manage multiple tasks simultaneously. </p></li><li><p style=\"min-height:1.5em\">Must be available to work from 12 PM to 5 PM EST.</p></li></ul><p style=\"min-height:1.5em\"></p><p style=\"min-height:1.5em\"><strong>Nice-to-haves:</strong></p><ul style=\"min-height:1.5em\"><li><p style=\"min-height:1.5em\">Background in communications, public relations, journalism, or related field. </p></li><li><p style=\"min-height:1.5em\">Experience working in a PR/Marketing/Events agencies.</p></li><li><p style=\"min-height:1.5em\">Experience in tracking and completing contracts</p></li><li><p style=\"min-height:1.5em\">Experience organizing/mounting events. </p></li></ul><p style=\"min-height:1.5em\"></p><p style=\"min-height:1.5em\"><strong>What’s in it for you?</strong></p><p style=\"min-height:1.5em\">As a full-time member of our team, you’ll enjoy:</p><ul style=\"min-height:1.5em\"><li><p style=\"min-height:1.5em\">Work wherever you choose.</p></li><li><p style=\"min-height:1.5em\">Unlimited PTO.</p></li><li><p style=\"min-height:1.5em\">Non-working holidays per country of residence.</p></li><li><p style=\"min-height:1.5em\">Pro-rated 13th-month bonus in select regions.</p></li><li><p style=\"min-height:1.5em\">Referral bonuses.</p></li><li><p style=\"min-height:1.5em\">Financial support for online courses.</p></li><li><p style=\"min-height:1.5em\">Fun and casual work environment.</p></li><li><p style=\"min-height:1.5em\">Employee engagement activities and virtual gatherings.</p></li><li><p style=\"min-height:1.5em\">We are a diverse, global team! 🌍</p></li></ul><p style=\"min-height:1.5em\"></p><p style=\"min-height:1.5em\"><em><strong>Equal Employment Opportunity</strong></em></p><p style=\"min-height:1.5em\"><em>Winona provides equal employment opportunities to all qualified individuals without regard to race, color, religion, sex, gender identity, sexual orientation, pregnancy, age, national origin, physical or mental disability, military or veteran status, genetic information, or any other protected classification. Equal employment opportunity extends to all aspects of employment including, but not limited to, recruitment, hiring, training, promotion, demotion, transfer, leaves of absence, and termination. Winona takes allegations of discrimination, harassment, and retaliation seriously and will promptly investigate such behaviors.</em></p>","tags":"[\"management\",\"database\"]","pubDate":"2025-04-15T16:56:16.552Z","link":"https://jobs.ashbyhq.com/winona/556e1a7d-0e25-453c-a806-58c02afa5eef","slug":"communications-assistant-winona-1694"},{"id":9261896459,"title":"Customer Success Engineer, APAC","company":"Fingerprint","image":"https://avatars.githubusercontent.com/u/67208791?s=200&v=4","description":"&lt;div class=&quot;content-intro&quot;&gt;&lt;p&gt;&lt;strong&gt;Fingerprint&lt;/strong&gt;&amp;nbsp;empowers developers to stop online fraud at the source.&lt;/p&gt;\n&lt;p&gt;We work on turning radical new ideas in the fraud detection space into reality. Our products are developer-focused and our clients range from solo developers to publicly traded companies.&amp;nbsp;&lt;strong&gt;We are a globally dispersed, 100% remote company&lt;/strong&gt; with a strong open-source focus. Our flagship open-source project is &lt;a class=&quot;c-link c-link--focus-visible&quot; href=&quot;https://github.com/fingerprintjs/fingerprintjs&quot; target=&quot;_blank&quot; data-stringify-link=&quot;https://github.com/fingerprintjs/fingerprintjs&quot; data-sk=&quot;tooltip_parent&quot;&gt;FingerprintJS&lt;/a&gt; (20K stars on GitHub).&lt;/p&gt;\n&lt;p&gt;&lt;a class=&quot;c-link c-link--focus-visible&quot; href=&quot;https://www.crunchbase.com/organization/fingerprintjs&quot; target=&quot;_blank&quot; data-stringify-link=&quot;https://www.crunchbase.com/organization/fingerprintjs&quot; data-sk=&quot;tooltip_parent&quot;&gt;We have raised $77M&amp;nbsp;&lt;/a&gt;and are backed by Craft Ventures (previously invested in&amp;nbsp;&lt;a class=&quot;c-link c-link--focus-visible&quot; href=&quot;https://www.tesla.com/&quot; target=&quot;_blank&quot; data-stringify-link=&quot;https://www.tesla.com/&quot; data-sk=&quot;tooltip_parent&quot;&gt;Tesla,&amp;nbsp;&lt;/a&gt;&lt;a class=&quot;c-link c-link--focus-visible&quot; href=&quot;https://facebook.com/&quot; target=&quot;_blank&quot; data-stringify-link=&quot;https://facebook.com/&quot; data-sk=&quot;tooltip_parent&quot;&gt;Facebook,&amp;nbsp;&lt;/a&gt;&lt;a class=&quot;c-link c-link--focus-visible&quot; href=&quot;https://www.airbnb.com/&quot; target=&quot;_blank&quot; data-stringify-link=&quot;https://www.airbnb.com/&quot; data-sk=&quot;tooltip_parent&quot;&gt;Airbnb&amp;nbsp;&lt;/a&gt;), Nexus Venture Partners (previously invested in &lt;a href=&quot;https://www.postman.com/&quot;&gt;Postman&lt;/a&gt;, &lt;a href=&quot;https://www.apollo.io/&quot;&gt;Apollo.io,&lt;/a&gt; &lt;a href=&quot;https://min.io/&quot;&gt;MinIO&lt;/a&gt;, Druva)&amp;nbsp;and Uncorrelated Ventures (previously invested in&amp;nbsp;&lt;a class=&quot;c-link c-link--focus-visible&quot; href=&quot;https://redis.io/&quot; target=&quot;_blank&quot; data-stringify-link=&quot;https://redis.io/&quot; data-sk=&quot;tooltip_parent&quot;&gt;Redis,&amp;nbsp;&lt;/a&gt;&lt;a class=&quot;c-link c-link--focus-visible&quot; href=&quot;https://rollbar.com/&quot; target=&quot;_blank&quot; data-stringify-link=&quot;https://rollbar.com/&quot; data-sk=&quot;tooltip_parent&quot;&gt;Rollbar&amp;nbsp;&lt;/a&gt;&amp;amp;&lt;a class=&quot;c-link c-link--focus-visible&quot; href=&quot;https://gradle.org/&quot; target=&quot;_blank&quot; data-stringify-link=&quot;https://gradle.org/&quot; data-sk=&quot;tooltip_parent&quot;&gt;&amp;nbsp;Gradle&lt;/a&gt;).&lt;/p&gt;\n&lt;p&gt;&lt;em&gt;We have noticed a rise in recruiting impersonations across the industry, where scammers attempt to access candidates&#39; personal and financial information through fake interviews and offers. All Fingerprint recruiting email communications will always come from the @fingerprint.com domain. Any outreach claiming to be from Fingerprint via other sources should be ignored.&lt;/em&gt;&lt;/p&gt;\n&lt;p&gt;&amp;nbsp;&lt;/p&gt;\n&lt;hr&gt;\n&lt;p&gt;&amp;nbsp;&lt;/p&gt;\n&lt;p&gt;&amp;nbsp;&lt;/p&gt;\n&lt;p&gt;&amp;nbsp;&lt;/p&gt;&lt;/div&gt;&lt;p&gt;We are seeking an experienced and dynamic Customer Success Engineer to join our team. In this role, you will be the technical point of contact for our enterprise customers, ensuring they receive maximum value from our products and services. You will collaborate closely with our Customer Success Managers, Sales, Product, and Engineer teams to deliver tailored solutions that meet the unique needs of our most strategic clients. Your ability to understand customer challenges, provide technical guidance, and drive successful product adoption will be critical to the long-term success of our customers and our company.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Key Responsibilities:&lt;/strong&gt;&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;&lt;strong&gt;Technical Expertise:&lt;/strong&gt; Act as the primary technical resource for our customers, providing expert guidance on the deployment, integration, and optimization of our products.&lt;/li&gt;\n&lt;li&gt;&lt;strong&gt;Customer Onboarding:&lt;/strong&gt; Lead the technical onboarding process for new strategic customers, ensuring a smooth and efficient setup that meets their specific requirements and goals.&lt;/li&gt;\n&lt;li&gt;&lt;strong&gt;Ongoing Support:&lt;/strong&gt; Provide ongoing technical support and troubleshooting to enterprise clients, addressing their concerns promptly and effectively.&lt;/li&gt;\n&lt;li&gt;&lt;strong&gt;Customer Advocacy:&lt;/strong&gt; Serve as the voice of the customer within the company, advocating for their needs and working with internal teams to ensure customer satisfaction.&lt;/li&gt;\n&lt;li&gt;&lt;strong&gt;Product Adoption:&lt;/strong&gt; Work closely with customers to drive product adoption, ensuring they fully leverage our solutions to meet their business goals.&lt;/li&gt;\n&lt;li&gt;&lt;strong&gt;Training and Enablement:&lt;/strong&gt; Conduct training sessions and workshops to educate customers on best practices and new features, empowering them to use our products effectively.&lt;/li&gt;\n&lt;li&gt;&lt;strong&gt;Feedback Loop:&lt;/strong&gt; Gather customer feedback on product performance and feature requests, collaborating with the product team to influence the product roadmap.&lt;/li&gt;\n&lt;li&gt;&lt;strong&gt;Relationship Management:&lt;/strong&gt; Build and maintain strong relationships with key stakeholders within enterprise accounts, acting as a trusted advisor and partner.&lt;/li&gt;\n&lt;li&gt;&lt;strong&gt;Reporting:&lt;/strong&gt; Monitor customer health metrics, usage data, and satisfaction levels, providing regular reports to internal teams and clients.&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;&amp;nbsp;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Qualifications:&lt;/strong&gt;&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;&lt;strong&gt;Experience:&lt;/strong&gt; 3+ years of experience in a customer-facing role, preferably as a Customer Success Engineer or Technical Support Engineer, with a focus on API products.&lt;/li&gt;\n&lt;li&gt;&lt;strong&gt;Location:&amp;nbsp;&lt;/strong&gt;Must be based in India&lt;/li&gt;\n&lt;li&gt;&lt;strong&gt;Technical Skills:&lt;/strong&gt; Strong technical acumen with experience in JavaScript, with a demonstrated ability to create and maintain automation scripts, RESTful architecture, SQL and web services.&lt;/li&gt;\n&lt;li&gt;Knowledge of cloud computing, APIs, and enterprise-level integrations is highly desirable.&lt;/li&gt;\n&lt;li&gt;&lt;strong&gt;Problem-Solving:&lt;/strong&gt; Exceptional troubleshooting skills with the ability to diagnose and resolve complex technical issues.&lt;/li&gt;\n&lt;li&gt;&lt;strong&gt;Communication:&lt;/strong&gt; Excellent communication skills, both verbal and written, with the ability to convey technical concepts to non-technical stakeholders.&lt;/li&gt;\n&lt;li&gt;&lt;strong&gt;Customer Focus:&lt;/strong&gt; Demonstrated ability to understand customer needs and deliver solutions that drive success.&lt;/li&gt;\n&lt;li&gt;&lt;strong&gt;Collaboration:&lt;/strong&gt; Proven ability to work cross-functionally with sales, product, and engineering teams to achieve common goals.&lt;/li&gt;\n&lt;li&gt;&lt;strong&gt;Education:&lt;/strong&gt; Bachelor’s degree in Computer Science, Engineering, or a related field is preferred.&lt;/li&gt;\n&lt;li&gt;&lt;strong&gt;Certifications:&lt;/strong&gt; Relevant certifications are a plus.&lt;/li&gt;\n&lt;/ul&gt;&lt;div class=&quot;content-conclusion&quot;&gt;&lt;p&gt;&lt;em&gt;We have noticed a rise in recruiting impersonations across the industry, where scammers attempt to access candidates&#39; personal and financial information through fake interviews and offers. All Fingerprint recruiting email communications will always come from the @fingerprint.com domain. Any outreach claiming to be from Fingerprint via other sources should be ignored.&lt;/em&gt;&lt;/p&gt;\n&lt;p&gt;Offers vary depending on, but not limited to, relevant experience, education, certifications/licenses, skills, training, and market conditions.&amp;nbsp;&lt;/p&gt;\n&lt;p&gt;Due to regulatory and security reasons, there’s a small number of countries where we cannot have Fingerprint teammates based.&amp;nbsp;&lt;strong data-stringify-type=&quot;bold&quot;&gt;Additionally, because Fingerprint is an all-remote company and people can join our workforce from almost any country, we do not sponsor visas. Fingerprint teammates need to be authorized to work from their home location&lt;/strong&gt;.&lt;/p&gt;\n&lt;p&gt;We are dedicated to creating an inclusive work environment for everyone. We embrace and celebrate the unique experiences, perspectives and cultural backgrounds that each employee brings to our workplace. Fingerprint strives to foster an environment where our employees feel respected, valued and empowered, and our team members are at the forefront in helping us promote and sustain an inclusive workplace. We highly encourage people from underrepresented groups in tech to apply.&lt;/p&gt;\n&lt;p&gt;If you are applying as a resident of California, please read our CCPA notice &lt;a href=&quot;https://dev.fingerprint.com/docs/dpa-ccpa&quot; target=&quot;_blank&quot;&gt;here&lt;/a&gt;&lt;/p&gt;\n&lt;p&gt;If you are applying as a resident of the EU, please read our GDPR notice &lt;a href=&quot;https://dev.fingerprint.com/docs/dpa-gdpr&quot; target=&quot;_blank&quot;&gt;here&lt;/a&gt;&lt;/p&gt;&lt;/div&gt;","tags":"[\"javascript\",\"management\",\"engineering\"]","pubDate":"2025-04-15T16:38:18.000Z","link":"https://fingerprint.com/careers/jobs/apply/?gh_jid=5482949004","slug":"customer-success-engineer-apac-fingerprint-9365"},{"id":8486711275,"title":"Account Executive Bilingual (English & Spanish)","company":"Bobtail","image":"https://www.bobtail.com/wp-content/uploads/2023/09/cropped-cropped-favicon-180x180.png","description":"&lt;h2&gt;&lt;strong&gt;About Bobtail&lt;/strong&gt;&lt;/h2&gt;\n&lt;p&gt;Bobtail is dedicated to increasing happiness for our customers by eliminating inefficiencies in the supply chain. We envision a supply chain without friction, fraud, waste, and abuse where companies succeed based on the value they create.&lt;/p&gt;\n&lt;p&gt;&amp;nbsp;&lt;/p&gt;\n&lt;p&gt;We work uniquely at Bobtail, where we value teams over individuals and encourage experimentation and iteration to constantly improve. Teams are given flexibility in working towards a shared purpose and given the freedom to decide how they will accomplish their goals.&lt;/p&gt;\n&lt;p&gt;If you are an out-of-the-box thinker who takes a proactive approach to collaborating with others to solve problems and achieve your goals - we would love to talk to you.&lt;/p&gt;\n&lt;p&gt;The things we value:&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;Mission&lt;/li&gt;\n&lt;li&gt;Teams over individuals&lt;/li&gt;\n&lt;li&gt;Collaboration&lt;/li&gt;\n&lt;li&gt;Communication&lt;/li&gt;\n&lt;li&gt;Iteration&lt;/li&gt;\n&lt;li&gt;Experimentation and failing fast&lt;/li&gt;\n&lt;li&gt;Initiative and solutions-oriented approach&lt;/li&gt;\n&lt;li&gt;Documentation&lt;/li&gt;\n&lt;li&gt;Data&lt;/li&gt;\n&lt;li&gt;Mental health and work-life balance&lt;/li&gt;\n&lt;li&gt;Diversity&lt;/li&gt;\n&lt;li&gt;Transparency&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;&lt;strong&gt;You should apply if you have:&lt;/strong&gt;&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;3 years of B2B cold calling &amp;amp; outbound sales experience&lt;/li&gt;\n&lt;li&gt;Bilingual (English/Spanish) is a must&lt;/li&gt;\n&lt;li&gt;Software as a Service (SaaS) Nice to have&amp;nbsp;&lt;/li&gt;\n&lt;li&gt;US Trucking Industry knowledge is a plus&lt;/li&gt;\n&lt;li&gt;CRM usage experience is preferred (Salesforce is a plus)&lt;/li&gt;\n&lt;li&gt;Start-up experience is a plus&lt;/li&gt;\n&lt;li&gt;Ability to quickly learn in a fast-paced environment,&lt;/li&gt;\n&lt;li&gt;Consistent track record of achievement and hitting quotas&lt;/li&gt;\n&lt;li&gt;Confidence, as well as strong verbal &amp;amp; written communication skills when interacting with clients&lt;/li&gt;\n&lt;li&gt;Ability to discover and understand customer needs and propose solutions&lt;/li&gt;\n&lt;li&gt;Dependable team player&lt;/li&gt;\n&lt;li&gt;A motivated, driven, self-starter… We love those with grit and accountability!&lt;/li&gt;\n&lt;li&gt;You must own a modern laptop with a working camera that is not older than 3 years.&lt;/li&gt;\n&lt;li&gt;An Internet Speed of 50 Mbps is required&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;&amp;nbsp;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;You will be responsible for:&lt;/strong&gt;&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;Making daily cold calls &amp;amp; sending emails/text to connect with prospects&lt;/li&gt;\n&lt;li&gt;Converting prospects &amp;amp; leads into Bobtail clients&lt;/li&gt;\n&lt;li&gt;Collaborating as a team to accomplish individual, team, and company-wide goals&lt;/li&gt;\n&lt;li&gt;Maintaining a pipeline of leads and opportunities using our CRM (Salesforce)&lt;/li&gt;\n&lt;li&gt;Effectively using other sales tools to track progress and improve your performance&lt;/li&gt;\n&lt;li&gt;Learning about each client’s needs, industry, and competitors.&lt;/li&gt;\n&lt;li&gt;Building long-lasting, mutually beneficial relationships with prospects and clients to create a better customer experience.&lt;/li&gt;\n&lt;li&gt;Following up with prospects throughout the sales cycle to continue nurturing them.&lt;/li&gt;\n&lt;li&gt;Presenting the value of Bobtail products and services to prospects&lt;/li&gt;\n&lt;li&gt;Staying current on company offerings and industry trends.&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;&lt;strong&gt;Educational background:&lt;/strong&gt;&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;Bachelor’s degree preferred&lt;/li&gt;\n&lt;li&gt;Sales or business education/certification preferred&lt;/li&gt;\n&lt;li&gt;Completed studies preferred&lt;br&gt;&lt;br&gt;&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;&lt;strong&gt;Benefits:&lt;/strong&gt;&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;Monthly Mental Break Day&lt;/li&gt;\n&lt;li&gt;Paid Time Off&lt;/li&gt;\n&lt;li&gt;Work from home (or wherever)&lt;/li&gt;\n&lt;li&gt;Parental leave&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;&lt;br&gt;Creating a diverse and inclusive workplace is Bobtail’s nucleus. We are an equal opportunity employer and embrace people of different backgrounds, cultures, religions, national origins, races, colors, genders, gender expressions, sexual orientations, ages, marital status, veteran status, experiences, abilities, and perspectives.&lt;/p&gt;\n&lt;p&gt;&lt;br&gt;&lt;br&gt;&lt;/p&gt;","tags":"[\"b2b\"]","pubDate":"2025-04-15T15:25:05.000Z","link":"https://job-boards.greenhouse.io/bobtail/jobs/4553807005","slug":"account-executive-bilingual-english-spanish-bobtail-3601"},{"id":4463559860,"title":"Senior Visual Designer (Marketing Assets)","company":"Clutch","image":"https://avatars.githubusercontent.com/u/69215121?s=200&v=4","description":"<h1><strong>About the Role</strong></h1><p style=\"min-height:1.5em\">Clutch is expanding its design team! We are looking for a <strong>Senior Marketing Designer</strong> with a sharp eye for branding and marketing collateral — not generalists or concept creatives, but someone who knows how to <strong>translate GTM strategy into compelling visual assets</strong> that drive awareness, engagement, and conversion.</p><p style=\"min-height:1.5em\">In this role, you’ll collaborate closely with Marketing, Sales, and Design to develop and scale a consistent visual language across digital campaigns, pitch decks, ads, landing pages, internal comms, and more. Your work will play a key role in elevating our brand and enabling growth.</p><p style=\"min-height:1.5em\"></p><h1><strong>About the Team</strong></h1><p style=\"min-height:1.5em\">At Clutch, design isn’t just a department — it’s a strategic function that helps credit unions deliver best-in-class banking experiences. Our fully remote design team is based in the U.S. and Brazil, and works across product, marketing, and brand. We’re collaborative, ambitious, diverse, and empowered to make bold design decisions.</p><p style=\"min-height:1.5em\"></p><h1><strong>What You’ll Do</strong></h1><p style=\"min-height:1.5em\"></p><h2>Within 3 months, you will:</h2><ul style=\"min-height:1.5em\"><li><p style=\"min-height:1.5em\">Understand Clutch’s vision, market positioning, and marketing strategy</p></li><li><p style=\"min-height:1.5em\">Build strong partnerships with the Marketing and Sales teams</p></li><li><p style=\"min-height:1.5em\">Audit and improve existing marketing and sales collateral</p><p style=\"min-height:1.5em\"></p></li></ul><h2><strong>Within 6 months, you will:</strong></h2><ul style=\"min-height:1.5em\"><li><p style=\"min-height:1.5em\">Lead end-to-end design projects for campaigns, sales enablement, and internal communications</p></li><li><p style=\"min-height:1.5em\">Own the creation of templates and design systems for marketing use</p></li><li><p style=\"min-height:1.5em\">Establish guidelines to ensure brand consistency across all assets</p><p style=\"min-height:1.5em\"></p></li></ul><h2>Within 9 months, you will:</h2><ul style=\"min-height:1.5em\"><li><p style=\"min-height:1.5em\">Partner with Marketing to identify new opportunities for design to drive business results</p></li><li><p style=\"min-height:1.5em\">Influence how design contributes to storytelling across the customer journey</p></li><li><p style=\"min-height:1.5em\">Help elevate the visual bar across Clutch — in and beyond marketing</p></li></ul><p style=\"min-height:1.5em\"></p><h1><strong>What You’ll Bring</strong></h1><ul style=\"min-height:1.5em\"><li><p style=\"min-height:1.5em\">6+ years of experience in graphic, communication, or marketing design</p></li><li><p style=\"min-height:1.5em\">A strong portfolio showcasing <strong>marketing campaigns, branded content, sales assets, and digital design</strong></p></li><li><p style=\"min-height:1.5em\">Expertise in branding, typography, layout, and visual hierarchy</p></li><li><p style=\"min-height:1.5em\">Proficiency in Figma, Adobe Creative Suite, and motion design tools</p></li><li><p style=\"min-height:1.5em\">Experience designing for web, email, paid media, and social platforms</p></li><li><p style=\"min-height:1.5em\">Familiarity with B2B growth strategies and design-for-performance principles</p></li><li><p style=\"min-height:1.5em\">Comfort working in a fast-paced startup environment, balancing quality and speed</p></li><li><p style=\"min-height:1.5em\">Bonus: experience in fintech or mission-driven companies</p></li></ul><p style=\"min-height:1.5em\"><em>Please note that this role may evolve as our business needs change, so we appreciate your flexibility and adaptability.</em></p><p style=\"min-height:1.5em\"></p><p style=\"min-height:1.5em\"><strong>What’s In It For You?</strong></p><ul style=\"min-height:1.5em\"><li><p style=\"min-height:1.5em\"><strong>Remote Flexibility:</strong> Enjoy the freedom of remote work from anywhere, balancing life and career seamlessly.</p></li><li><p style=\"min-height:1.5em\"><strong>Unforgettable Off-Sites:</strong> Twice a year, bond with colleagues in exciting destinations, fostering teamwork and fresh ideas.</p></li><li><p style=\"min-height:1.5em\"><strong>Paid Time Off and National Holidays:</strong> Enjoy 20 PTO days yearly and the National Holidays for relaxation and rejuvenation.</p></li><li><p style=\"min-height:1.5em\"><strong>Stock Options:</strong> Joining us means having a stake in our success, so you'll receive stock options as part of your compensation package.</p></li><li><p style=\"min-height:1.5em\"><strong>Home Office Setup:</strong> Create your ideal workspace with a dedicated budget for home office essentials.</p></li><li><p style=\"min-height:1.5em\"><strong>Work Trip Budget:</strong> Grow personally and professionally with a budget for work-related trips and co-working.</p></li></ul><p style=\"min-height:1.5em\"><strong>About Us</strong></p><p style=\"min-height:1.5em\"><strong>Clutch</strong> is a revolutionary vertical SaaS company, proudly backed by Andreessen Horowitz (A16z), aimed at revolutionizing the way Credit Unions engage and change the lives of their members. As a champion of financial well-being, we address the urgent need for affordable lending solutions in an era where the average American grapples with over $155,000 in household debt.  Unlike traditional financial institutions, Clutch develops software to turn Credit Unions into FinTech lenders and leverage their balance sheets to responsibly lend to over 130M Americans. Our mission extends beyond mere financial transactions; we strive to fundamentally enhance the way credit unions interact with their members. By integrating cutting-edge technologies and user-centric designs, we help credit unions provide seamless digital experiences that are on par with leading tech companies. This approach not only preserves but revitalizes the longstanding tradition of community and member-focused service inherent to credit unions.</p><p style=\"min-height:1.5em\"><strong>Please note:</strong> This position is offered on a contractor basis. Applicants must have the necessary documentation and authorization to work in the country where the job is located. Clutch cannot provide sponsorship or assist with obtaining work permits for this role.</p>","tags":"[\"b2b\"]","pubDate":"2025-04-15T13:25:21.775Z","link":"https://jobs.ashbyhq.com/withclutch/6e1bffa9-36ae-4dc9-b9a3-cba2b116b865","slug":"senior-visual-designer-marketing-assets-clutch-8585"},{"id":5822384572,"title":"Wholesale & Networks Manager","company":"Airalo","image":"https://lever-client-logos.s3.us-west-2.amazonaws.com/55028a36-609c-479c-9553-d4689ff2dd8c-1669620566663.png","description":"<div><b>About Airalo</b></div><div>Alo! Airalo is the world’s first eSIM store that helps people connect in over 200+ countries and regions across the globe. We are building the next digital service that revolutionizes the telecom industry. We are a travel-tech company and an equal-opportunity environment that values and executes diversity, inclusion, and equity. Our team is spread across 50+ countries and six continents. What glues us together is our commitment to changing the way you connect<span style=\"font-size: 13.3333px\">. </span></div><div><br></div><div><b>About you</b></div><div>We hope that you care deeply about the quality of your work, the intrinsic worth of tasks, and the success of your team. You are self-disciplined and do not require micromanagement in terms of your skillset and work ethic. You do your best to flourish as an individual every day while working hard to foster a collaborative team environment. You believe in the importance of being — and staying — authentic, honest, positive, and kind. You are a good interlocutor with clear and concise communication. You are able to manage multiple projects, have an analytical mind, pay keen attention to detail, and love to get your hands dirty. You are cognizant, tolerant, and welcoming of vulnerabilities and cultural differences.</div><div><br></div><div><b>About the Role</b></div><div><b>Position</b>: Full-time / Employee</div><div><b>Location:</b>&nbsp;Remote-first </div><div><b>Benefits:</b>&nbsp;Health Insurance, work-from-anywhere stipend, annual wellness &amp; learning credits, annual all-expenses-paid company retreat in a gorgeous destination &amp; other benefits</div><div><br></div><div><span style=\"font-size: 16px;\">As a </span><b style=\"font-size: 16px;\">Wholesales &amp; Networks Manager</b><span style=\"font-size: 16px;\"> at Airalo you will be responsible for expanding into new partner networks across the globe as well as permanently improve the rates, services and quality of our existing partner networks. You are someone who is obsessed with providing the best rate possible (without compromising network quality) to global travellers in need of a reliable data connection when leaving their home network.</span></div><h3>Responsibilities include, but not limited to:</h3><li>Represent Airalo as the ideal interface to mobile network partners on a global level</li><li>Add &amp; improve network partnerships</li><li>Negotiate terms and conditions of wholesales and reseller contracts with host mobile network operators</li><li>Manage and assure regulatory compliance requirements for all our local markets and provide information to product management</li><li>Monitor and assure network quality is provided by our partners</li><li>Define and run traffic, sales and monetary analytics</li><li>Develop methods to assure unifications of conditions and agreements</li><li>Prepare the rollout of new markets</li><li>Connect and integrate foreign mobile networks with Airalo’s OSS and BSS platform</li><li>Perform escalations in case of network quality issues and availabilities</li><li>Define and perform reconciliation processes</li>,<h3>Must Haves</h3><li>Sound understanding of eSIM technology and use cases</li><li>Good overview in Telecommunication Network technologies like Mobile Core (PGW, IMS, Voice GW, HSS), OSS &amp; BSS</li><li>Understanding different Mobile Services as MOC/MTC, SM-MO, SM-MT, Data, Roaming, International Calling</li><li>Understanding different Mobile Network Generations like 2G, 3G/UMTS, 4G/LTE, 5G NSA and 5 G SA and how it influences customer experiences</li><li>Ideally having served on the management team of an MVNO or MVNA respectively with hands on mentality</li><li>Having at least negotiated two different wholesales agreements on behalf or with MVNOs with Host Mobile Network operators</li><li>Deep knowledge of subscriber life cycles with mobile services</li><li>Understanding the regulatory requirements on providing mobile services</li><li>Be familiar with KYC processes for mobile subscriptions</li><li>Excellent English skills; in writing, speaking and reading – business fluent</li><li>5 years minimum relevant experience in the mobile telco industry</li>,<h3>Good to Haves:</h3><li>Good to haves:</li><li>Master Studies and/or MBA highly preferred</li><li>Clear communication skills</li><li>International working experience is highly preferred</li><li>Pro-activeness and Management skills in international environments</li><div>If you are interested in this position, please apply via the link.</div><div><br></div><div>We sincerely thank all applicants in advance for submitting their interest in this opportunity. Airalo is an equal opportunity employer and values diversity, equity &amp; inclusion. We do not discriminate on the basis of race, religion, national origin, gender, sexual orientation, age, marital status, veteran status, or disability status. We are committed to providing reasonable accommodations upon request for individuals with disabilities throughout our job interview process.</div>","tags":"[\"management\"]","pubDate":"2025-04-15T09:51:57.916Z","link":"https://jobs.lever.co/airalo/c41ce2b5-e8b5-4ba5-b3d4-b7d2aa32b4df","slug":"wholesale-networks-manager-airalo-2104"},{"id":4477374267,"title":"Billing engineer","company":"Supabase","image":"https://avatars.githubusercontent.com/u/54469796?s=200&v=4","description":"<p style=\"min-height:1.5em\">Supabase is an Open Source and fully remote company building a Postgres Developer Platform.</p><p style=\"min-height:1.5em\">We are looking for a Billing Engineer with hands-on experience working with billing systems that thrives in a cross-functional environment. Besides working on billing and collaborating with many teams, you are encouraged to bring in your ideas to further drive revenue and growth.</p><p style=\"min-height:1.5em\">As part of our billing team, you’ll play a key role in shaping our billing system alongside dunning, fraud prevention, service restrictions, growth and revenue operations. If you consider billing as a product and want to help us take our billing system to the next level, we’d love to hear from you!</p><p style=\"min-height:1.5em\"><strong>You will:</strong></p><ul style=\"min-height:1.5em\"><li><p style=\"min-height:1.5em\">Contribute to the design and development of our Billing system, ensuring accessibility, transparency, speed, and predictability for an exceptional user experience</p></li><li><p style=\"min-height:1.5em\">Collaborate with product teams to meet their billing requirements and help figure out pricing</p></li><li><p style=\"min-height:1.5em\">Improve usage insights for both users and our success/support/product teams</p></li><li><p style=\"min-height:1.5em\">Enhance our dunning process to decrease payment short-fall</p></li><li><p style=\"min-height:1.5em\">Build and refine systems to detect and prevent fraud</p></li><li><p style=\"min-height:1.5em\">Support our customers and find ways to reduce support load by optimizing usage insights or self-serve capabilities</p></li><li><p style=\"min-height:1.5em\">Implement timely usage/budget notifications and better cost control for customers</p></li></ul><p style=\"min-height:1.5em\"><strong>You have:</strong></p><ul style=\"min-height:1.5em\"><li><p style=\"min-height:1.5em\">Experience with billing systems. You have hands-on experience working with billing systems, possessing a deep understanding of billing concepts, workflows, and best practices.</p></li><li><p style=\"min-height:1.5em\">Experience managing yourself. You will have the autonomy and responsibility to own and drive the billing infrastructure. We need someone who is self-motivated, organized, and can effectively prioritize tasks, managing their own workflow to deliver high-quality results independently.</p></li><li><p style=\"min-height:1.5em\">Full-Stack experience (ideally, with Typescript). You thrive in a cross-functional environment, navigating the realms of backend, frontend, data engineering, operations, sales, and growth, ensuring seamless integration of billing as a critical, cross-cutting concern.</p></li></ul><p style=\"min-height:1.5em\"><strong>We offer:</strong></p><ul style=\"min-height:1.5em\"><li><p style=\"min-height:1.5em\">100% remote work from anywhere in the world. No location-based adjustment to your salary.</p></li><li><p style=\"min-height:1.5em\">Autonomous work. We work collaboratively on projects, but you set your own pace.</p></li><li><p style=\"min-height:1.5em\">Health, Vision and Dental benefits. Supabase covers 100% of the cost for employees and 80% for dependants</p></li><li><p style=\"min-height:1.5em\">Generous Tech Allowance for any office setup you need</p></li><li><p style=\"min-height:1.5em\">Annual Education Allowance</p></li><li><p style=\"min-height:1.5em\">Annually run off-sites.</p></li></ul><h2>About the team</h2><ul style=\"min-height:1.5em\"><li><p style=\"min-height:1.5em\">We're a startup. It's unstructured.</p></li><li><p style=\"min-height:1.5em\">Collectively founded more than 30 startups.</p></li><li><p style=\"min-height:1.5em\">Globally distributed team with more than 30 different nationalities.</p></li><li><p style=\"min-height:1.5em\">We deeply believe in <a target=\"_blank\" rel=\"noopener noreferrer nofollow\" href=\"https://supabase.com/blog/2022/03/25/should-i-open-source-my-company\">the efficacy of collaborative open source</a>. We support existing communities and tools, rather than building \"yet another xx\".</p></li><li><p style=\"min-height:1.5em\">We \"dogfood\" everything. If you use it in your project, we use it in Supabase.</p></li></ul><h2>Process</h2><ul style=\"min-height:1.5em\"><li><p style=\"min-height:1.5em\">The entire process is fully remote and all communication will happen over email or via video chat.</p></li><li><p style=\"min-height:1.5em\">Once you've submitted your application, the team will review your submission and may reach out for a short screening interview over a video call.</p></li><li><p style=\"min-height:1.5em\">If you pass the screen you will be invited to up to four follow-up interviews. </p></li><li><p style=\"min-height:1.5em\">The calls:</p><ul style=\"min-height:1.5em\"><li><p style=\"min-height:1.5em\">usually take between 20-45 minutes each depending on the interviewer.</p></li><li><p style=\"min-height:1.5em\">most of the time, are all 1:1.</p></li><li><p style=\"min-height:1.5em\">will be with the founders, a member of either the growth or engineering team (depending on the role) and usually one other person from your immediate team or function.</p></li></ul></li><li><p style=\"min-height:1.5em\">Once the interviews are over, the team will meet to discuss several roles and candidates and may:</p><ul style=\"min-height:1.5em\"><li><p style=\"min-height:1.5em\">ask one or two follow-up questions over email or a quick call.</p></li><li><p style=\"min-height:1.5em\">go directly to making an offer.</p></li></ul></li></ul>","tags":"[\"postgres\",\"typescript\",\"engineering\"]","pubDate":"2025-04-14T15:56:16.005Z","link":"https://jobs.ashbyhq.com/supabase/3259ff08-dc10-4d33-9a1e-12749e89d8cb","slug":"billing-engineer-supabase-6471"},{"id":5545070458,"title":"Analytics Engineer, GTM","company":"Owner","image":"https://avatars.githubusercontent.com/u/87661266?s=200&v=4","description":"<div><span style=\"font-size: 24px;\">👋&nbsp;</span><b style=\"font-size: 24px;\">About&nbsp;<a href=\"http://owner.com/\">Owner.com</a></b></div><div>Owner is the all-in-one platform that restaurants use to succeed online.</div><div><br></div><div>Thousands of restaurant owners use our tools to build their website, drive online orders, create their own branded app, manage their customer relationships, and set up marketing automations.</div><div><br></div><div>You can think of it as Shopify meets HubSpot, but specifically for restaurants.</div><div><br></div><div>Learn more about the problems we are solving for our customers&nbsp;<a href=\"https://www.owner.com/our-story\">here</a>.</div><div><br></div><div><span style=\"font-size: 24px;\">🌎&nbsp;</span><b style=\"font-size: 24px;\">Our vision</b></div><div>We’re starting by helping independent restaurants succeed online.</div><div><br></div><div>But it’s not just restaurants that need our help. Most local businesses are struggling with these same problems. Huge technology corporations are taking their customers, bleeding their profits, and making it hard for them to survive.</div><div>Once we nail the solution for restaurants&nbsp;–&nbsp;we’ll scale it into every other local business type.</div><div><br></div><div>In the future we envision, tens of millions of local business owners will use our technology to succeed in the digital age.</div><div><br></div><div><span style=\"font-size: 24px;\">🚀&nbsp;</span><b style=\"font-size: 24px;\">Our traction</b></div><div>In just over 3 years we've generated&nbsp;tens of millions in revenue, served millions of guests, and processed hundreds of millions of online orders.</div><div><br></div><div>More importantly, we’ve helped thousands of restaurant owners save their businesses - and not&nbsp; only survive, but thrive.</div><div><br></div><div><span style=\"font-size: 24px;\">⭐&nbsp;</span><b style=\"font-size: 24px;\">Our team</b></div><div>Our team grew from under 100 to nearly 200 talented people in 2024. We’ve got top talent from the most successful companies in SMB software, including: Shopify, HubSpot, DoorDash, ServiceTitan, Rappi, Faire and Stripe.</div><div><br></div><div>We’ll be scaling even faster in 2025 to keep pace with our customer growth.</div><div><br></div><div><span style=\"font-size: 24px;\">🌆&nbsp;</span><b style=\"font-size: 24px;\">Where we work</b></div><div>Owner is a remote-first, global company headquartered in San Francisco, with a sales hub in Toronto. For a few of our roles we prioritize in-person collaboration at one of our office locations. Most of our employees are distributed throughout the globe. Please review the role description and discuss with your recruiter for more details on location.</div><div><br></div><div><span style=\"font-size: 24px;\">🔍 </span><b style=\"font-size: 24px;\">Why we’re looking for you</b></div><div><br></div><div>We are building a scalable, modern Data Platform at <a rel=\"noopener noreferrer\" class=\"postings-link\" href=\"http://Owner.com\">Owner.com</a>. As a GTM Analytics Engineer, you will play a pivotal role in shaping the data landscape and driving the strategic use of data across the organization, with a focus on go-to-market solutions. You will be instrumental in building SSOT models in DBT &amp; Snowflake, maintaining robust, scalable data pipelines, and enhancing our data infrastructure to support analytics and data-driven decision-making.</div><div><br></div><div>This role is 100% remote and can be based anywhere in the United States or Canada.</div><div><span style=\"font-size: 24px;\">🔍 </span><b style=\"font-size: 24px;\">Why we’re looking for you</b></div><div><br></div><div>We are building a scalable, modern Data Platform at <a href=\"http://Owner.com\" class=\"postings-link\" target=\"_blank\" rel=\"noopener noreferrer\">Owner.com</a>. As a GTM Analytics Engineer, you will play a pivotal role in shaping the data landscape and driving the strategic use of data across the organization, with a focus on go-to-market solutions. You will be instrumental in building SSOT models in DBT &amp; Snowflake, maintaining robust, scalable data pipelines, and enhancing our data infrastructure to support analytics and data-driven decision-making.</div><div><br></div><div>This role is 100% remote and can be based anywhere in the United States or Canada.</div><h3>💥 The impact you will have</h3><li>Design and implement scalable, efficient Data Products that drives business value within our GTM product. Examples include sales heatmap &amp; overall efficiency; quotas &amp; attainment; revenue attribution; marketing attribution; marketing spend efficiency; Reverse ETL from product to SFDC.</li><li>Collaborate with stakeholders and GTM data scientists to understand business requirements and translate them into clear, actionable data outputs through effective data modeling.</li><li>Improve time to insight by preparing SSOT data models as a core input for analysis in Sigma, our preferred BI tool.</li><li>Optimize data pipeline systems from a variety of sources, ensuring data is accurate, timely, and consistent, Sample tools: hubspot, salesforce, talkdesk, marketing platforms. Make sure our Product / backend systems have a proper linkage with GTM systems.</li><li>Improve GTM data quality, sharing data integrity guidelines, highlighting current issues, and collaborating with different stakeholders on implementation of proper fixes.</li><h3>🤝 Who you’ll work with</h3><li>This role reports to our Director of Data Analytics, Piotr Rosiak.</li><li>You will partner with data scientists, business analysts, and key stakeholders from related teams such as Rev-Ops, Sales, Marketing, Product, Finance.</li><h3>✅ What we’re looking for</h3><li>At least 5 years of experience in a data engineering or analytics engineering role.</li><li>Expert in SQL and DBT: strong track record of designing conceptual data models, developing comprehensive data tests, and establishing a clear, efficient single source of truth (SSOT).</li><li>A proven track record of developing and managing marketing / sales / GTM analytics the scratch.</li><li>Ability to build comprehensive end to end Data products (snowflake, DBT, Sigma).</li><li>Moderate Python experience would be considered an asset.</li><li>Highly organized, with an eye for precision and a love for keeping things tidy.</li><li>Experience with SaaS and/or startups is highly preferred.</li><li>Prior experience in the restaurant industry is a plus!</li><h3>🏆 Pay and benefits</h3><li>The estimated base salary range for this role is $160,000 to $180,000 for US-based roles, plus a generous equity pre-IPO equity package. For salary ranges in other geo locations, please discuss with your recruiter.</li><li>Other benefits include comprehensive health coverage, work from anywhere (100% remote workplace), unlimited PTO - plus extra fun perks!</li><div><b><span style=\"font-size: 10px\">🚩 Notice - Employment Scams</span></b></div><div><span style=\"font-size: 10px\">Communication from our team regarding job opportunities will only be made by an Owner employee with an @owner.com email address.</span></div><div><span style=\"font-size: 10px\">We do not conduct interviews over email or chat platforms, and we will never ask you to provide personal or financial information such as your mailing address, social security number, credit card numbers or banking information.&nbsp; If you believe you are being contacted by scammer, please mark the communication as \"phishing\" or “spam” and do not respond.</span></div><div><span style=\"font-size: 24px;\">👋&nbsp;</span><b style=\"font-size: 24px;\">About&nbsp;<a href=\"http://owner.com/\">Owner.com</a></b></div><div>Owner is the all-in-one platform that restaurants use to succeed online.</div><div><br></div><div>Thousands of restaurant owners use our tools to build their website, drive online orders, create their own branded app, manage their customer relationships, and set up marketing automations.</div><div><br></div><div>You can think of it as Shopify meets HubSpot, but specifically for restaurants.</div><div><br></div><div>Learn more about the problems we are solving for our customers&nbsp;<a href=\"https://www.owner.com/our-story\">here</a>.</div><div><br></div><div><span style=\"font-size: 24px;\">🌎&nbsp;</span><b style=\"font-size: 24px;\">Our vision</b></div><div>We’re starting by helping independent restaurants succeed online.</div><div><br></div><div>But it’s not just restaurants that need our help. Most local businesses are struggling with these same problems. Huge technology corporations are taking their customers, bleeding their profits, and making it hard for them to survive.</div><div>Once we nail the solution for restaurants&nbsp;–&nbsp;we’ll scale it into every other local business type.</div><div><br></div><div>In the future we envision, tens of millions of local business owners will use our technology to succeed in the digital age.</div><div><br></div><div><span style=\"font-size: 24px;\">🚀&nbsp;</span><b style=\"font-size: 24px;\">Our traction</b></div><div>In just over 3 years we've generated&nbsp;tens of millions in revenue, served millions of guests, and processed hundreds of millions of online orders.</div><div><br></div><div>More importantly, we’ve helped thousands of restaurant owners save their businesses - and not&nbsp; only survive, but thrive.</div><div><br></div><div><span style=\"font-size: 24px;\">⭐&nbsp;</span><b style=\"font-size: 24px;\">Our team</b></div><div>Our team grew from under 100 to nearly 200 talented people in 2024. We’ve got top talent from the most successful companies in SMB software, including: Shopify, HubSpot, DoorDash, ServiceTitan, Rappi, Faire and Stripe.</div><div><br></div><div>We’ll be scaling even faster in 2025 to keep pace with our customer growth.</div><div><br></div><div><span style=\"font-size: 24px;\">🌆&nbsp;</span><b style=\"font-size: 24px;\">Where we work</b></div><div>Owner is a remote-first, global company headquartered in San Francisco, with a sales hub in Toronto. For a few of our roles we prioritize in-person collaboration at one of our office locations. Most of our employees are distributed throughout the globe. Please review the role description and discuss with your recruiter for more details on location.</div>","tags":"[\"finance\",\"engineering\"]","pubDate":"2025-04-14T13:35:48.177Z","link":"https://jobs.lever.co/owner/da71fdd1-4893-47f5-9203-62bb576b2ac6","slug":"analytics-engineer-gtm-owner-9170"}]