[{"id":6854986836,"title":"UX Lead","company":"Ethereum Foundation","image":"https://remotive.com/job/2016674/logo","description":"<div>About the Ethereum Foundation</div>\n<div> </div>\n<div>The <a class=\"postings-link\" href=\"https://ethereum.foundation/ef\" rel=\"nofollow\">Ethereum Foundation (EF)</a> is a global non-profit organization dedicated to supporting Ethereum and related technologies. Our mission is to do what is best for Ethereum’s long-term success. Our role is to allocate resources to critical projects, to be a valued voice within the Ethereum ecosystem, and to advocate for Ethereum to the outside world.</div>\n<div> </div>\n<div>Background</div>\n<div> </div>\n<div><a class=\"postings-link\" href=\"http://protocol.ethereum.foundation/\" rel=\"nofollow\"><strong>Protocol</strong></a><strong> </strong>is the Ethereum Foundation’s R&amp;D group, with the mission of bringing the world computer to the world. Our research, engineering and delivery teams work at the frontier of multiple domains to execute on Ethereum’s ambitious roadmap without compromising on our <a class=\"postings-link\" href=\"https://blog.ethereum.org/2025/04/28/next-chapter\" rel=\"nofollow\">guiding principles</a>.</div>\n<div> </div>\n<div>About this Role</div>\n<div> </div>\n<div>The UX Lead at Protocol will collaborate closely with our Protocol Architecture team to ensure Ethereum evolves in ways that directly benefit users. This is not a traditional product design role. Instead, it focuses on user research, strategic UX thinking, and shaping the foundations of protocol-layer decisions before they reach the UI.</div>\n<div> </div>\n<div>This role is foundational: you will not only define and advocate for exceptional user experiences but also infuse user-centric thinking into technical decisions across the organization. Your work will impact millions of current and future Ethereum users.</div>\n<div> </div>\n<div><strong>You’ll be responsible for: </strong></div>\n<div> </div>\n<div>- Establishing and embedding UX best practices within Protocol, ensuring user experience is a first-class consideration in technical design and strategic decisions.</div>\n<div>- Establishing and embedding UX best practices within Protocol, ensuring user experience is a first-class consideration in technical design and strategic decisions.</div>\n<div>- Conducting deep, user-focused research to identify pain points, opportunities, and interaction patterns across Ethereum’s ecosystem.</div>\n<div>- Consulting and partnering with various technical teams within Protocol and the Ethereum ecosystem, leveling up their understanding and execution of user-centered design.</div>\n<div>- Driving user-focused conversations, clearly articulating trade-offs, and shaping decisions that impact Ethereum’s global community.</div>\n<div> </div>\n<div>Protocol is a unique environment, and you’ll encounter problems that are highly technical, novel, and challenging. You will thrive here if you’re both strategic and tactical—equally comfortable articulating a vision and rolling up your sleeves to execute it.</div>\n<div> </div>\n<div>Requirements</div>\n<div> </div>\n<div>- 5+ years of UX design experience, ideally with significant exposure to deeply technical domains with Ethereum or crypto products: wallets, apps, infrastructure or protocols.</div>\n<div>- Proven ability to conduct rigorous user research, distill insights clearly, and integrate them meaningfully into product development.</div>\n<div>- Strong collaborative and communication skills; experience advocating for UX best practices among highly technical teams.</div>\n<div> </div>\n<div>Open Questions and Initiatives</div>\n<div> </div>\n<div>- What are the most urgent user pain points to solve, and the most effective levers to address them?</div>\n<div>- How to design, deploy and leverage <a class=\"postings-link\" href=\"https://vitalik.eth.limo/general/2024/10/17/futures2.html#6\" rel=\"nofollow\">interoperability</a> <a class=\"postings-link\" href=\"https://ethereum-magicians.org/t/erc-7828-chain-specific-addresses-using-ens/21930\" rel=\"nofollow\">features and standards</a>, allowing for a seamless crosschain experience?</div>\n<div>- How to communicate <a class=\"postings-link\" href=\"https://l2beat.com/scaling/summary\" rel=\"nofollow\">trust assumptions</a> clearly and actionably, without <a class=\"postings-link\" href=\"https://www.decentralised.co/p/abstracting-chains\" rel=\"nofollow\">flattening complexity</a>?</div>\n<div>- Is <a class=\"postings-link\" href=\"https://stark.mirror.xyz/rkLEVz9p4r3ouusD-WCkWP_iVZYkZ0K7TFkzeRfiXCU\" rel=\"nofollow\">Trust Experience</a> the right way to think about Ethereum’s unique affordances?</div>\n<div>- How to expose privacy as a <a class=\"postings-link\" href=\"https://x.com/VitalikButerin/status/1928794599121732041\" rel=\"nofollow\">first-class UX component</a> for onchain interactions?</div>\n<div>- How to engage with the shift from browser-extension wallets to <a class=\"postings-link\" href=\"https://x.com/gakonst/status/1927764579028783156\" rel=\"nofollow\">embedded/in-app wallets</a>?</div>\n<div> </div>\n<div>How we work</div>\n<div> </div>\n<div>Protocol isn’t a traditional workplace: it demands and rewards clarity, rapid execution, and genuine commitment to Ethereum’s mission. Distinct aspects of our work environment include:</div>\n<div> </div>\n<div><strong>- Ethereum, period: </strong>the EF is in the privileged position where it only needs to consider what is best for Ethereum, without other constraints. This opens the door for unconventional strategies and bold approaches that wouldn’t be possible if we had to optimize for anything else.</div>\n<div><strong>- Public by Default: </strong>Most contributions happen in the open, coordinating with stakeholders across the broader Ethereum community. This requires proactive engagement, clear communication, and effective collaboration without direct authority, even (and especially!) when consensus is challenging.</div>\n<div><strong>- Agency, Impact &amp; Accountability:</strong> You’ll have substantial freedom to define your own approach, experiment, and take ownership over your decisions. But with this autonomy comes clear accountability. Your work will be measured both by its immediate strategic impact, and also by its second-order effects across Ethereum’s ecosystem.</div>\n<div> </div>\n<div>This isn’t a fit for everyone, but for motivated, independent individuals, it’s uniquely empowering.</div>\n<div> </div>\n<div>Contract Details</div>\n<div> </div>\n<div>- This is a full-time role, fully remote. Hours are flexible, but you should generally be available around “Eth o’clock” (14:00 UTC) for synchronous calls.</div>\n<div>- Additionally, while this isn’t a strict requirement, you’ll benefit from being able to travel a few times a year to events related to your work, such as <a class=\"postings-link\" href=\"https://devcon.org/en/\" rel=\"nofollow\">devcon</a>, or <a class=\"postings-link\" href=\"https://blog.ethereum.org/2024/05/22/nyota-interop-recap\" rel=\"nofollow\">interop</a>.</div>\n<div>- Lastly, anons are welcome to apply and work under a pseudonym, but will need to KYC with the Ethereum Foundation.</div>\n<div> </div>\n<img src=\"https://remotive.com/job/track/2016674/blank.gif?source=public_api\" alt=\"\"/>","tags":"[\"ethereum\"]","pubDate":"2025-06-07T20:50:14.000Z","link":"https://remotive.com/remote-jobs/design/ux-lead-2016674","slug":"ux-lead-ethereum-foundation-4036"},{"id":2557641104,"title":"Customer Success & Sales Operations Manager","company":"Interprefy Ag","image":"https://remotive.com/job/2016856/logo","description":"<div class=\"h3\">The team</div><p>\n</p><p style=\"text-align:justify;\"><span style=\"\">Our <strong>Customer Success team</strong> is the heart of how we support and grow lasting client relationships. We work closely with our global Sales teams, Project Managers, and other departments to make sure every customer interaction is thoughtful, proactive, and genuinely helpful.</span></p><p style=\"text-align:justify;\"><span style=\"\">We’re a people-first team—curious, collaborative, and always ready to step in. Whether it’s guiding a client through their first multilingual event or identifying new ways they can get value from our solutions, we’re here to make it easy, smooth, and impactful.</span></p><p style=\"text-align:justify;\"><span style=\"\">We care deeply about doing things well and doing them together. And as part of our broader team, we’re always learning, adapting, and finding smarter ways to serve our clients—because when they grow, so do we.</span></p>\n<div class=\"h3\">The Role- key responsibilities</div><p>\n</p><p style=\"text-align:justify;\"><span style=\"\"><span style=\"\">This role sits within our Customer Success team and works closely with Sales Operations, Business Development Managers, and other internal partners. It’s a great fit for someone who’s proactive, detail-oriented, and excited to contribute to the success of both our clients and our internal teams.</span></span></p><div style=\"text-align:justify;\"><span style=\"\"><span style=\"\"><strong>What you'll do: </strong></span></span></div><div style=\"text-align:justify;\"><br></div><p style=\"text-align:justify;\"><span style=\"\"><strong><span style=\"\">Customer relationship management</span></strong></span></p><ul style=\"\"><li style=\"\"><p style=\"text-align:justify;\">Build and grow strong client relationships across your portfolio of accounts.</p></li><li style=\"\"><p style=\"text-align:justify;\">Present quotes through live meetings and ensure timely follow-up after events via meeting or survey.</p></li><li style=\"\"><p style=\"text-align:justify;\">Ensure each client account receives meaningful engagement on a regular basis.</p></li><li style=\"\"><p style=\"text-align:justify;\">Host regular client meetings and share insights to support retention and satisfaction.</p></li><li style=\"\"><p style=\"text-align:justify;\">Resolve any client issues in close collaboration with Operations and Management.</p></li></ul><p style=\"text-align:justify;\"><span style=\"\"><strong>Growth &amp; opportunity development</strong></span></p><ul style=\"\"><li style=\"\"><p style=\"text-align:justify;\">Proactively explore new business opportunities within existing accounts.</p></li><li style=\"\"><p style=\"text-align:justify;\">Expand client contact networks and identify potential for new service areas.</p></li><li style=\"\"><p style=\"text-align:justify;\">Collaborate regularly with Business Development Managers to align on account strategies and client communication.</p></li></ul><p style=\"text-align:justify;\"><span style=\"\"><strong>Sales operations support</strong></span></p><ul style=\"\"><li style=\"\"><p style=\"text-align:justify;\">Coordinate contract, terms, and special agreement processes—ensuring accuracy and timely completion.</p></li><li style=\"\"><p style=\"text-align:justify;\">Support onboarding of Interprefy as a vendor with new clients and escalate delays when needed.</p></li><li style=\"\"><p style=\"text-align:justify;\">Gather feedback during onboarding and identify areas for process improvement.</p></li><li style=\"\"><p style=\"text-align:justify;\">Be the go-to person in your time zone for HubSpot-related questions or troubleshooting.</p></li><li style=\"\"><p style=\"text-align:justify;\">Assist with platform access requests and strategic account support during NALA business hours.</p></li></ul><p style=\"text-align:justify;\"><span style=\"\"><strong>Operational coordination &amp; admin</strong></span></p><ul style=\"\"><li style=\"\"><p style=\"text-align:justify;\">Work with the Accounting team to support accurate and timely invoicing.</p></li><li style=\"\"><p style=\"text-align:justify;\">Ensure seamless handovers to Project Management for live event execution.</p></li><li style=\"\"><p style=\"text-align:justify;\">Contribute to reporting, client feedback analysis, and internal documentation.</p></li></ul>\n<div class=\"h3\">Key experiences and competencies</div><p>\n</p><div style=\"text-align:justify;\"><strong><span style=\"\">What you bring:</span></strong><br><br></div><ul style=\"\"><li style=\"\"><p style=\"text-align:justify;\">Confidence leading video calls and managing client relationships.</p></li><li style=\"\"><p style=\"text-align:justify;\">Experience working with senior stakeholders internally and externally.</p></li><li style=\"\"><p style=\"text-align:justify;\">Strong attention to detail and documentation habits.</p></li><li style=\"\"><p style=\"text-align:justify;\">Tech-savviness—especially in HubSpot, Zoom, and collaborative tools.</p></li><li style=\"\"><p style=\"text-align:justify;\">A self-starter mindset—you manage your workload independently.</p></li><li style=\"\"><p style=\"text-align:justify;\">Strong communication, listening, and conflict resolution skills.</p></li><li style=\"\"><p style=\"text-align:justify;\">A flexible, solutions-focused mindset.</p></li></ul><p style=\"text-align:justify;\"><span style=\"\"><strong>Ready to make a real impact?</strong><br></span><span style=\"\"><br>Join us as a Customer Success &amp; Sales Operations Manager and help us connect the world in their own language—one multilingual event at a time.</span></p><p style=\"text-align:justify;\"><span style=\"\"><strong>Apply now and let’s Interprefy it!</strong></span></p>\n<img src=\"https://remotive.com/job/track/2016856/blank.gif?source=public_api\" alt=\"\"/>","tags":"[]","pubDate":"2025-06-07T06:51:21.000Z","link":"https://remotive.com/remote-jobs/customer-support/customer-success-sales-operations-manager-2016856","slug":"customer-success-sales-operations-manager-interprefy-ag-8403"}]