[{"id":3427249890,"title":"Cloud Support Associate Engineer","company":"Canonical","image":"https://pbs.twimg.com/profile_images/1673959375340290050/x7pNtXQ7_400x400.jpg","description":"\n      <p>Canonical is a leading provider of open source software and operating systems to the global enterprise and technology markets. Our platform, Ubuntu, is very widely used in breakthrough enterprise initiatives such as public cloud, data science, AI, engineering innovation and IoT. Our customers include the world's leading public cloud and silicon providers, and industry leaders in many sectors. The company is a pioneer of global distributed collaboration, with 1100+ colleagues in 75+ countries and very few office based roles. Teams meet two to four times yearly in person, in interesting locations around the world, to align on strategy and execution.</p>\n<p>The company is founder led, profitable and growing.</p>\n<p>We are hiring a Cloud Support Associate Engineer to build a career with Canonical and support the technical needs of customers leveraging Ubuntu and open source products. This role is an opportunity for a hands-on engineer with eagerness to learn, a passion for Linux and cloud technologies to work with some of the best people in the industry at Canonical.</p>\n<p>We regularly solve interesting, technical problems. From triaging complex Cloud environment issues, Linux kernel crashes we’ve never seen before to OS configuration issues and root cause analysis, we provide an expert level of support and satisfaction to our peer groups and&nbsp; customers. You will be accountable for delivering an outstanding technical support experience on the full cloud technical stack at Canonical. From problem qualification to full resolution, you will own and manage your cases. When needed, you will transfer your cases to your colleagues or involve senior engineers.</p>\n<p><strong>Location</strong>: This is a remote role based in AMER, EMEA or APAC time zones.</p>\n<h2>The role entails</h2>\n<ul>\n<li>Work from your remote home office and provide technical support for employees.</li>\n<li>Be available to take ownership of new cases via telephone, email and web</li>\n<li>Act as an internal customer advocate keeping them updated in a timely manner</li>\n<li>Ensure that each support case owned by you is handled according to our Service Level Agreement (SLA) with the highest possible customer satisfaction by setting the right expectations and fulfilling your commitments.</li>\n<li>Contribute new knowledge base articles and maintain existing articles, ensuring shared knowledge and lessons learned are available to customers.</li>\n<li>Draft and distribute technical notices for internal and external communication.</li>\n<li>Prioritise your work in order to accomplish the most important and urgent tasks first</li>\n<li>Keep on learning as our products and services grow and evolve</li>\n<li>Understanding Ubuntu development process to be able to set customer expectations correctly on timeline for a fix.</li>\n<li>Maintain regular communication and information exchange with the rest of the team, locally and remotely</li>\n<li>Identify and suggest any opportunities to provide a better service</li>\n<li>Participate in a regular weekend working rotation.</li>\n</ul>\n<h2>What are we looking for in you</h2>\n<ul>\n<li>Bachelors or equivalent four year degree in a technical field from an accredited college or university. Preferable majors: Computer Science, MIS, Electrical Engineering, etc.</li>\n<li>Experience with Linux troubleshooting (collecting logs and stack traces, fine-tuning by editing configuration files)</li>\n<li>Experience with Linux server administration</li>\n<li>Strong knowledge of Cloud computing concepts (provisioning, monitoring, orchestration, etc.)</li>\n<li>Knowledge or basic hands-on experience on 2 or more of:</li>\n<ul>\n<li>Virtualization / Cloud</li>\n<li>Containers</li>\n<li>Storage technologies</li>\n<li>Networking (bonding, firewalling, bridging, switching, network file system tuning, MTU issues, etc.</li>\n</ul>\n<li>Programming fundamentals in any language (bash, Perl, Ruby, Javascript, C or C++, Go)&nbsp;</li>\n<li>Ability to learn quickly, thrive on change and handle the pressure of a customer facing job</li>\n<li>Strong written and verbal English communication skills</li>\n<li>Ability to travel</li>\n<li>Background check required</li>\n</ul>\n<h2>Nice-to-have skills</h2>\n<ul>\n<li>Experience supporting virtualized environments (KVM, Virtual Box, VMWare)</li>\n<li>Experience with other open-source desktop technologies</li>\n<li>Active contribution to open-source projects/forum/code</li>\n</ul>\n<h2>What we offer colleagues</h2>\n<p>We consider geographical location, experience, and performance in shaping compensation worldwide. We revisit compensation annually (and more often for graduates and associates) to ensure we recognise outstanding performance. In addition to base pay, we offer a performance-driven annual bonus or commission. We provide all team members with additional benefits, which reflect our values and ideals. We balance our programs to meet local needs and ensure fairness globally.</p>\n<ul>\n<li>Distributed work environment with twice-yearly team sprints in person</li>\n<li>Personal learning and development budget of USD 2,000 per year</li>\n<li>Annual compensation review</li>\n<li>Recognition rewards</li>\n<li>Annual holiday leave</li>\n<li>Maternity and paternity leave</li>\n<li>Employee Assistance Programme</li>\n<li>Opportunity to travel to new locations to meet colleagues</li>\n<li>Priority Pass, and travel upgrades for long haul company events</li>\n</ul>\n<h3>About Canonical</h3>\n<p>Canonical is a pioneering tech firm at the forefront of the global move to open source. As the company that publishes Ubuntu, one of the most important open source projects and the platform for AI, IoT and the cloud, we are changing the world of software. We recruit on a global basis and set a very high standard for people joining the company. We expect excellence - in order to succeed, we need to be the best at what we do. Most colleagues at Canonical have worked from home since its inception in 2004.​ Working here is a step into the future, and will challenge you to think differently, work smarter, learn new skills, and raise your game.</p>\n<p>Canonical is an equal opportunity employer</p>\n<p>We are proud to foster a workplace free from discrimination. Diversity of experience, perspectives, and background create a better work environment and better products. <a href=\"https://canonical.com/careers/diversity/identity\">Whatever your identity, we will give your application fair consideration.</a></p>\n<p>#LI-remote</p><p>Requisition ID: 210</p><p></p>\n    ","tags":"[\"javascript\",\"engineering\"]","pubDate":"2025-01-15T09:12:51.942Z","link":"https://canonical.com/careers/5320462","slug":"cloud-support-associate-engineer-canonical-1170"},{"id":9648291205,"title":"Sr. Software Engineer","company":"Bobtail","image":"https://media.licdn.com/dms/image/v2/D560BAQHzAQXggf5uQg/company-logo_200_200/company-logo_200_200/0/1688643230676/bobtail_logo?e=1742428800&v=beta&t=P9gHgDHOknAHShwQR1JsLMYGaVscLGTzwmWViGMvnbE","description":"&lt;h2&gt;&lt;span style=&quot;font-weight: 400;&quot;&gt;About Bobtail&lt;/span&gt;&lt;/h2&gt;\n&lt;p&gt;&lt;span style=&quot;font-weight: 400;&quot;&gt;Bobtail is dedicated to increasing happiness by eliminating inefficiencies in the supply chain.&amp;nbsp; We envision a supply chain without friction, fraud, waste, and abuse where companies succeed based on the value they create.&amp;nbsp;&amp;nbsp;&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span style=&quot;font-weight: 400;&quot;&gt;We work in a unique way at Bobtail, where we value teams over individuals and encourage experimentation and iteration to constantly improve.&amp;nbsp; Teams are given flexibility in working towards a shared purpose and given the freedom to decide how they will accomplish their goals.&amp;nbsp;&amp;nbsp;&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span style=&quot;font-weight: 400;&quot;&gt;If you are an out of the box thinker that takes a proactive approach in collaborating with others to solve problems and achieve your goals - we would love to talk to you.&amp;nbsp;&amp;nbsp;&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span style=&quot;font-weight: 400;&quot;&gt;The things we value:&lt;/span&gt;&lt;/p&gt;\n&lt;ol&gt;\n&lt;li style=&quot;font-weight: 400;&quot;&gt;&lt;span style=&quot;font-weight: 400;&quot;&gt;Mission&lt;/span&gt;&lt;/li&gt;\n&lt;li style=&quot;font-weight: 400;&quot;&gt;&lt;span style=&quot;font-weight: 400;&quot;&gt;Teams over individuals&lt;/span&gt;&lt;/li&gt;\n&lt;li style=&quot;font-weight: 400;&quot;&gt;&lt;span style=&quot;font-weight: 400;&quot;&gt;Collaboration&lt;/span&gt;&lt;/li&gt;\n&lt;li style=&quot;font-weight: 400;&quot;&gt;&lt;span style=&quot;font-weight: 400;&quot;&gt;Communication&lt;/span&gt;&lt;/li&gt;\n&lt;li style=&quot;font-weight: 400;&quot;&gt;&lt;span style=&quot;font-weight: 400;&quot;&gt;Iteration&lt;/span&gt;&lt;/li&gt;\n&lt;li style=&quot;font-weight: 400;&quot;&gt;&lt;span style=&quot;font-weight: 400;&quot;&gt;Experimentation and failing fast&lt;/span&gt;&lt;/li&gt;\n&lt;li style=&quot;font-weight: 400;&quot;&gt;&lt;span style=&quot;font-weight: 400;&quot;&gt;Initiative and solutions oriented approach&lt;/span&gt;&lt;/li&gt;\n&lt;li style=&quot;font-weight: 400;&quot;&gt;&lt;span style=&quot;font-weight: 400;&quot;&gt;Documentation&lt;/span&gt;&lt;/li&gt;\n&lt;li style=&quot;font-weight: 400;&quot;&gt;&lt;span style=&quot;font-weight: 400;&quot;&gt;Data&lt;/span&gt;&lt;/li&gt;\n&lt;li style=&quot;font-weight: 400;&quot;&gt;&lt;span style=&quot;font-weight: 400;&quot;&gt;Mental health and work life balance&lt;/span&gt;&lt;/li&gt;\n&lt;li style=&quot;font-weight: 400;&quot;&gt;&lt;span style=&quot;font-weight: 400;&quot;&gt;Diversity&lt;/span&gt;&lt;/li&gt;\n&lt;li style=&quot;font-weight: 400;&quot;&gt;&lt;span style=&quot;font-weight: 400;&quot;&gt;Transparency&lt;/span&gt;&lt;span style=&quot;font-weight: 400;&quot;&gt;&lt;br&gt;&lt;br&gt;&lt;/span&gt;&lt;/li&gt;\n&lt;/ol&gt;\n&lt;h2&gt;&lt;span style=&quot;font-weight: 400;&quot;&gt;You should apply if you have:&lt;/span&gt;&lt;/h2&gt;\n&lt;ul&gt;\n&lt;li style=&quot;font-weight: 400;&quot;&gt;&lt;span style=&quot;font-weight: 400;&quot;&gt;Exposure to SDLC from reviewing requirements through to debugging complex systems in Production.&lt;/span&gt;&lt;/li&gt;\n&lt;li style=&quot;font-weight: 400;&quot;&gt;&lt;span style=&quot;font-weight: 400;&quot;&gt;Strong theoretical fundamentals and hands-on experience designing and implementing highly available and performant fault-tolerant distributed systems.&lt;/span&gt;&lt;/li&gt;\n&lt;li style=&quot;font-weight: 400;&quot;&gt;&lt;span style=&quot;font-weight: 400;&quot;&gt;5+ years of experience in software engineering with demonstrated proficiency in programming languages, such as nodejs, typescript and overall system design.&lt;/span&gt;&lt;/li&gt;\n&lt;li style=&quot;font-weight: 400;&quot;&gt;&lt;span style=&quot;font-weight: 400;&quot;&gt;Experience building enterprise software, event driven microservices architecture, and distributed systems at scale.&lt;/span&gt;&lt;/li&gt;\n&lt;li style=&quot;font-weight: 400;&quot;&gt;&lt;span style=&quot;font-weight: 400;&quot;&gt;Bachelor&#39;s degree in computer science or a related engineering degree.&lt;/span&gt;&lt;/li&gt;\n&lt;/ul&gt;\n&lt;h2&gt;&lt;span style=&quot;font-weight: 400;&quot;&gt;You will be responsible for:&lt;/span&gt;&lt;/h2&gt;\n&lt;ul&gt;\n&lt;li style=&quot;font-weight: 400;&quot;&gt;&lt;span style=&quot;font-weight: 400;&quot;&gt;Writing reusable, testable, efficient and secure code.&lt;/span&gt;&lt;/li&gt;\n&lt;li style=&quot;font-weight: 400;&quot;&gt;&lt;span style=&quot;font-weight: 400;&quot;&gt;Working with large scale, highly available and resilient modern financial systems.&lt;/span&gt;&lt;/li&gt;\n&lt;li style=&quot;font-weight: 400;&quot;&gt;&lt;span style=&quot;font-weight: 400;&quot;&gt;Working with automated deployment, enabling code release multiple times a day.&lt;/span&gt;&lt;/li&gt;\n&lt;li style=&quot;font-weight: 400;&quot;&gt;&lt;span style=&quot;font-weight: 400;&quot;&gt;Working with modern tools and languages that excite you&lt;/span&gt;&lt;/li&gt;\n&lt;li style=&quot;font-weight: 400;&quot;&gt;&lt;span style=&quot;font-weight: 400;&quot;&gt;Being an integral part of a team, in addition to its culture and ways of working. Common practices include agile methodologies.&lt;/span&gt;&lt;/li&gt;\n&lt;/ul&gt;\n&lt;h2&gt;&lt;span style=&quot;font-weight: 400;&quot;&gt;Some of the technologies you’ll get to work with:&lt;/span&gt;&lt;/h2&gt;\n&lt;ul&gt;\n&lt;li style=&quot;font-weight: 400;&quot;&gt;&lt;span style=&quot;font-weight: 400;&quot;&gt;Typescript &amp;amp; Javascript.&lt;/span&gt;&lt;/li&gt;\n&lt;li style=&quot;font-weight: 400;&quot;&gt;&lt;span style=&quot;font-weight: 400;&quot;&gt;Node.js, Express js.&lt;/span&gt;&lt;/li&gt;\n&lt;li style=&quot;font-weight: 400;&quot;&gt;&lt;span style=&quot;font-weight: 400;&quot;&gt;CI/CD, AWS, Terraform, Docker, EKS / ECS.&lt;/span&gt;&lt;/li&gt;\n&lt;/ul&gt;\n&lt;h2&gt;&lt;span style=&quot;font-weight: 400;&quot;&gt;Benefits&lt;/span&gt;&lt;/h2&gt;\n&lt;ul&gt;\n&lt;li style=&quot;font-weight: 400;&quot;&gt;&lt;span style=&quot;font-weight: 400;&quot;&gt;Monthly Mental Break Day&lt;/span&gt;&lt;/li&gt;\n&lt;li style=&quot;font-weight: 400;&quot;&gt;&lt;span style=&quot;font-weight: 400;&quot;&gt;Paid Time Off&lt;/span&gt;&lt;/li&gt;\n&lt;li style=&quot;font-weight: 400;&quot;&gt;&lt;span style=&quot;font-weight: 400;&quot;&gt;Work from home (or wherever)&lt;/span&gt;&lt;/li&gt;\n&lt;li style=&quot;font-weight: 400;&quot;&gt;&lt;span style=&quot;font-weight: 400;&quot;&gt;Parental leave&lt;/span&gt;&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;&lt;span style=&quot;font-weight: 400;&quot;&gt;If you are interested in learning more, please email us at careers@bobtail.com.&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span style=&quot;font-weight: 400;&quot;&gt;&lt;br&gt;&lt;/span&gt;&lt;span style=&quot;font-weight: 400;&quot;&gt;Creating a diverse and inclusive workplace is Bobtail’s nucleus. We are an equal opportunity employer and embrace people of different backgrounds, cultures, religions, national origins, races, colors, genders, gender expressions, sexual orientations, ages, marital status, veteran status, experiences, abilities and perspective&lt;/span&gt;&lt;span style=&quot;font-weight: 400;&quot;&gt;s.&lt;/span&gt; &lt;span style=&quot;font-weight: 400;&quot;&gt;&lt;br&gt;&lt;br&gt;&lt;/span&gt;&lt;/p&gt;","tags":"[\"javascript\",\"typescript\",\"engineering\",\"aws\"]","pubDate":"2025-01-15T05:18:53.000Z","link":"https://job-boards.greenhouse.io/bobtail/jobs/4514274005","slug":"sr-software-engineer-bobtail-4361"},{"id":5159887644,"title":"Principal Product Marketing Manager","company":"Livekit","image":"https://avatars.githubusercontent.com/u/69438833?s=200&v=4","description":"<p style=\"min-height:1.5em\"></p><p style=\"min-height:1.5em\"><strong>About this role:</strong></p><p style=\"min-height:1.5em\">This isn't your typical product marketing role where we're looking for someone to create slide decks and write blog posts (though you'll do some of that too). We're looking for a technical marketer who can explain WebRTC architecture one minute and craft compelling product narratives the next. Think of it as being a technical translator who can speak both \"engineer\" and \"human\" fluently. If you get excited about diving into our SDKs, prototyping with our APIs, and then explaining to the world why what we've built matters—without sounding like everyone else in the space—you might be perfect for this.</p><p style=\"min-height:1.5em\">For clarity, we compensate our technical marketers like we do our engineers, because great technical product marketing is as valuable as great code.</p><p style=\"min-height:1.5em\"></p><p style=\"min-height:1.5em\"><strong>As a Technical Product Marketing Manager at LiveKit, you will:</strong></p><ul style=\"min-height:1.5em\"><li><p style=\"min-height:1.5em\">Own our end-to-end go-to-market strategy, driving product awareness and adoption in the real-time communication space</p></li><li><p style=\"min-height:1.5em\">Craft technically accurate yet engaging narratives that resonate with developers (because you are one)</p></li><li><p style=\"min-height:1.5em\">Plan and execute product launches that actually matter to developers, not just feature checkbox exercises</p></li><li><p style=\"min-height:1.5em\">Create technical content that helps developers understand and implement LiveKit, from architecture diagrams to sample implementations</p></li><li><p style=\"min-height:1.5em\">Work closely with our engineering team to understand product capabilities and translate them into clear value propositions</p></li><li><p style=\"min-height:1.5em\">Influence product strategy with market insights and developer feedback</p></li><li><p style=\"min-height:1.5em\">Support our Sales and Developer Success teams with technical materials that help close deals</p></li></ul><p style=\"min-height:1.5em\"></p><p style=\"min-height:1.5em\"><strong>You'll thrive as a Technical Product Marketing Manager at LiveKit if:</strong></p><ul style=\"min-height:1.5em\"><li><p style=\"min-height:1.5em\">You have a strong technical background (CS degree preferred) and can read/write code</p></li><li><p style=\"min-height:1.5em\">You get energized by making complex technical concepts accessible without dumbing them down</p></li><li><p style=\"min-height:1.5em\">You're allergic to marketing fluff and believe the best technical marketing is honest and accurate</p></li><li><p style=\"min-height:1.5em\">You have experience marketing to developers and understand what makes them tick</p></li><li><p style=\"min-height:1.5em\">You enjoy prototyping with new technologies and can quickly grasp technical concepts</p></li><li><p style=\"min-height:1.5em\">You write well. Really well. Both code and prose.</p></li></ul><p style=\"min-height:1.5em\"></p><p style=\"min-height:1.5em\"><strong>Bonus Points</strong></p><ul style=\"min-height:1.5em\"><li><p style=\"min-height:1.5em\">You've built something with WebRTC before</p></li><li><p style=\"min-height:1.5em\">You have experience in developer relations or developer marketing</p></li><li><p style=\"min-height:1.5em\">You've contributed to open source projects</p></li><li><p style=\"min-height:1.5em\">You can explain WebRTC without putting people to sleep</p></li><li><p style=\"min-height:1.5em\">You actually enjoy reading technical documentation (we won't judge)</p></li></ul><p style=\"min-height:1.5em\"></p><h2>Our Commitments to You</h2><h3>We offer</h3><ul style=\"min-height:1.5em\"><li><p style=\"min-height:1.5em\">An opportunity to build something truly impactful to the world</p></li><li><p style=\"min-height:1.5em\">Contribute to open source alongside world-class engineers</p></li><li><p style=\"min-height:1.5em\">Competitive salary and equity package</p></li><li><p style=\"min-height:1.5em\">Work anywhere in the world</p></li><li><p style=\"min-height:1.5em\">Health, dental, and vision benefits</p></li><li><p style=\"min-height:1.5em\">Flexible vacation policy</p></li></ul><p style=\"min-height:1.5em\"></p><p style=\"min-height:1.5em\"><strong>Ready to Apply?</strong> If you're excited about crafting the narrative for the future of real-time communications and want to make a significant impact at a high-growth company, we'd love to hear from you. Bonus points if you include your GitHub profile or any technical content you've created.</p>","tags":"[\"engineering\"]","pubDate":"2025-01-14T23:32:12.469Z","link":"https://jobs.ashbyhq.com/livekit/97651ce7-9ac6-4bea-8384-d1c71cb8725c","slug":"principal-product-marketing-manager-livekit-4243"},{"id":1603687205,"title":"Software Engineer (Senior/Staff/Principal)","company":"Didask","image":"https://avatars.githubusercontent.com/u/14350668?s=200&v=4","description":"<h1>About Didask</h1><p style=\"min-height:1.5em\">Didask is a SaaS eLearning solution that enables organizations to create effective online training programs with ease and strong pedagogical foundations. It is the first platform on the market to integrate a pedagogical assistant, designed by our researchers based on recommendations from cognitive science research. This innovative technology generates tailored training frameworks aligned with your learners' cognitive needs and guides you step-by-step in designing adaptive learning experiences with proven educational impact.</p><p style=\"min-height:1.5em\">Our platform also leverages cutting-edge Generative AI (GenAI) capabilities, enhanced by our deep expertise in cognitive science. Unlike generic AI tools, Didask’s GenAI is specifically designed to meet the unique challenges of learning and training, ensuring outputs that are not only innovative but also scientifically grounded and pedagogically effective.</p><p style=\"min-height:1.5em\">As a French EdTech company, Didask was founded by researchers from the prestigious École Normale Supérieure (ENS) in Paris, driven by a passion for education and pedagogy. Since late 2021, we have been supported by a European investment fund that drives our growth and ambitious development projects.</p><p style=\"min-height:1.5em\">At Didask, we combine advanced research, innovative AI, and a mission to make impactful learning accessible to all. Join us to help shape the future of education!</p><h1>Job description</h1><p style=\"min-height:1.5em\">As a Software Engineer at Didask, you'll be part of the product team that build our next-generation Learning Management System (LMS) and our brand new Learning Assistant.</p><p style=\"min-height:1.5em\">Working as <a target=\"_blank\" rel=\"noopener noreferrer nofollow\" class=\"wui-link\" href=\"https://blog.pragmaticengineer.com/the-product-minded-engineer/\">Product Engineers</a>, you'll have a large scope of ownership to solve our end-user's pain points:</p><ul style=\"min-height:1.5em\"><li><p style=\"min-height:1.5em\">Shape the best solution by engaging with Product Managers and Designers</p></li><li><p style=\"min-height:1.5em\">Bring these solutions to life (system design, architecture, coding, etc.) in collaboration with other Engineers</p></li><li><p style=\"min-height:1.5em\">Ship it and make sure it ends up solving the problem you've been tasked to solve</p></li></ul><p style=\"min-height:1.5em\">As a senior member of the team, you'll have a key role in making sure our product is secure, reliable and performant. You'll do so by intervening directly on the codebase, mentoring other engineers, and making them fall into the pit of success.</p><p style=\"min-height:1.5em\">You are also a contributor to our roadmap, identifying new opportunities thanks in particular to your awareness of both the latest advancements in technology and the EdTech market.</p><p style=\"min-height:1.5em\">All engineers are expected to spend a majority of their time building the product themselves, as Individual Contributors. Team leadership is a temporary (and possibly part-time) role one can move in and out of without it being considered a promotion or demotion.</p><h1>Tech stack</h1><ul style=\"min-height:1.5em\"><li><p style=\"min-height:1.5em\">Our product is built with TypeScript, Node.js, MongoDB, and React, plus the frameworks Next.js and Nest.js. Newer parts of our product rely on postgreSQL and ElasticSearch, and Rivet to build advanced LLM workflows based on various third-party models.</p></li><li><p style=\"min-height:1.5em\">We use Jest as our main tests runner, with a combination of unit, integration and end-to-end tests, both on the front-end (using Playwright) and API endpoints.</p></li><li><p style=\"min-height:1.5em\">Our hosting is entirely cloud-based, we are currently in the process of moving our infrastructure to Qovery.</p></li><li><p style=\"min-height:1.5em\">Our observability stack is built with Prometheus, Grafana, Datadog, Sentry, Langfuse and Gentrace.</p></li></ul><h1>Your profile</h1><p style=\"min-height:1.5em\">We're hiring primarily in \"senior plus\" positions, meaning that we want you to own large projects in collaboration with other Product Engineers, and help us define what we should do next.</p><p style=\"min-height:1.5em\">You should have a strong track record showing us you're able to do just that. We're quite open-minded about the variety of previous experiences that can lead you to us. Having a diploma from school A or having worked at company Z is one signal among many others. We encourage candidates from all backgrounds to apply.</p><p style=\"min-height:1.5em\">We do however have a few expectations in terms of previous experience, skills, and mindset:</p><ul style=\"min-height:1.5em\"><li><p style=\"min-height:1.5em\">Your have a recent experience as an Individual Contributor in a product-oriented company (B2B SaaS is a plus).</p></li><li><p style=\"min-height:1.5em\">You are familiar with our tech stack, in particular you are not afraid of the JavaScript ecosystem, crazy as it might be! We do not require a long, professional experience with it; but you'll need to master key principles and be able to write some code during the tech interview (you can use LLMs but we'll check that you understand what you accept).</p></li><li><p style=\"min-height:1.5em\">T-shaped profile: you have a full-stack mindset (eager to dig into the back-end, front-end or infrastructure aspects of a problem) with a spike in one area in particular where you excel.</p></li><li><p style=\"min-height:1.5em\">Sense of ownership: you have a holistic approach to problem solving, you are able to make decisions after collecting data and input from relevant stakeholders, even if there's no clear consensus, and you are accountable for them.</p></li><li><p style=\"min-height:1.5em\">Team spirit: you do your best to align yourself and the people around you with the company's mission, strategy and culture. You are operationally flexible, and able to adapt to an evolving environment.</p></li><li><p style=\"min-height:1.5em\">You are excited to work in a written-first and async-first environment (though we still have many occasions to speak face-to-face!), where radical transparency is a core value.</p></li><li><p style=\"min-height:1.5em\">You have a stellar communication, especially in written form. You welcome feedback and challenges; you can express your point of view clearly and without compromission, but also without antagonizing others, in a way that moves conversations towards a conclusion.</p></li><li><p style=\"min-height:1.5em\">People love working with you: you have a positive energy, you like to help others even when it's not your responsibility, and you place a high premium on maintaining good relationships with the team.</p></li><li><p style=\"min-height:1.5em\">You are passionate about technology and how to use it to solve real-life problems, in particular in the field of education and training. You are aware of the GenAI field, and you know how to leverage it, including in your job as an engineer.</p></li></ul><h1>Interview process</h1><ul style=\"min-height:1.5em\"><li><p style=\"min-height:1.5em\">Apply to this position by answering a few written questions. Though we love LLMs, please use your own words 🙏 We don't expect more than a paragraph per question.</p></li><li><p style=\"min-height:1.5em\">If your profile catches our attention, we'll invite you for a screening interview. We'll ask you a few questions and you'll have time to ask us questions too.</p></li><li><p style=\"min-height:1.5em\">If we're both willing to move forward, we'll send a take-home exercise and we'll schedule a technical interview with our engineers.</p></li><li><p style=\"min-height:1.5em\">Finally, you'll have a chat about product engineering and our company culture with our CTO and/or a Product Manager.</p></li></ul><h1>Language and location</h1><p style=\"min-height:1.5em\">Didask is a french company, transitioning to English as our internal working language in 2025. Professional proficiency in English is required. </p><p style=\"min-height:1.5em\">Unless specified otherwise, all our positions are remote-first. At the moment, we can only accept candidates who are French fiscal residents. You can work from anywhere in a timezone close to ours, as long as you have good working conditions (including a good Internet connection for fluid videoconferencing).</p>","tags":"[\"postgres\",\"javascript\",\"typescript\",\"management\",\"engineering\",\"b2b\",\"mongo\"]","pubDate":"2025-01-14T22:33:34.454Z","link":"https://jobs.ashbyhq.com/didask/c15df717-f37a-4855-b8d7-b69699a2be17","slug":"software-engineer-senior-staff-principal-didask-3653"},{"id":1572534730,"title":"Client Success Representative Bilingual (English & Spanish)","company":"Bobtail","image":"https://media.licdn.com/dms/image/v2/D560BAQHzAQXggf5uQg/company-logo_200_200/company-logo_200_200/0/1688643230676/bobtail_logo?e=1742428800&v=beta&t=P9gHgDHOknAHShwQR1JsLMYGaVscLGTzwmWViGMvnbE","description":"&lt;h2&gt;&lt;span style=&quot;font-weight: 400;&quot;&gt;About Bobtail&lt;/span&gt;&lt;/h2&gt;\n&lt;p&gt;&lt;span style=&quot;font-weight: 400;&quot;&gt;Bobtail is dedicated to increasing happiness by eliminating inefficiencies in the supply chain.&amp;nbsp; We envision a supply chain without friction, fraud, waste, and abuse where companies succeed based on the value they create.&amp;nbsp;&amp;nbsp;&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span style=&quot;font-weight: 400;&quot;&gt;We work uniquely at Bobtail, where we value teams over individuals and constantly encourage experimentation and iteration to improve. Teams are given flexibility in working towards a shared purpose and the freedom to decide how they will accomplish their goals.&amp;nbsp;&amp;nbsp;&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span style=&quot;font-weight: 400;&quot;&gt;If you are an out-of-the-box thinker that takes a proactive approach to collaborate with others to solve problems and achieve your goals - we would love to talk to you.&amp;nbsp;&amp;nbsp;&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span style=&quot;font-weight: 400;&quot;&gt;The things we value:&lt;/span&gt;&lt;/p&gt;\n&lt;ol&gt;\n&lt;li style=&quot;font-weight: 400;&quot;&gt;&lt;span style=&quot;font-weight: 400;&quot;&gt;Mission&lt;/span&gt;&lt;/li&gt;\n&lt;li style=&quot;font-weight: 400;&quot;&gt;&lt;span style=&quot;font-weight: 400;&quot;&gt;Teams over individuals&lt;/span&gt;&lt;/li&gt;\n&lt;li style=&quot;font-weight: 400;&quot;&gt;&lt;span style=&quot;font-weight: 400;&quot;&gt;Collaboration&lt;/span&gt;&lt;/li&gt;\n&lt;li style=&quot;font-weight: 400;&quot;&gt;&lt;span style=&quot;font-weight: 400;&quot;&gt;Communication&lt;/span&gt;&lt;/li&gt;\n&lt;li style=&quot;font-weight: 400;&quot;&gt;&lt;span style=&quot;font-weight: 400;&quot;&gt;Iteration&lt;/span&gt;&lt;/li&gt;\n&lt;li style=&quot;font-weight: 400;&quot;&gt;&lt;span style=&quot;font-weight: 400;&quot;&gt;Experimentation and failing fast&lt;/span&gt;&lt;/li&gt;\n&lt;li style=&quot;font-weight: 400;&quot;&gt;&lt;span style=&quot;font-weight: 400;&quot;&gt;Initiative and solutions-oriented approach&lt;/span&gt;&lt;/li&gt;\n&lt;li style=&quot;font-weight: 400;&quot;&gt;&lt;span style=&quot;font-weight: 400;&quot;&gt;Documentation&lt;/span&gt;&lt;/li&gt;\n&lt;li style=&quot;font-weight: 400;&quot;&gt;&lt;span style=&quot;font-weight: 400;&quot;&gt;Data&lt;/span&gt;&lt;/li&gt;\n&lt;li style=&quot;font-weight: 400;&quot;&gt;&lt;span style=&quot;font-weight: 400;&quot;&gt;Mental health and work-life balance&lt;/span&gt;&lt;/li&gt;\n&lt;li style=&quot;font-weight: 400;&quot;&gt;&lt;span style=&quot;font-weight: 400;&quot;&gt;Diversity&lt;/span&gt;&lt;/li&gt;\n&lt;li style=&quot;font-weight: 400;&quot;&gt;&lt;span style=&quot;font-weight: 400;&quot;&gt;Transparency&lt;/span&gt;&lt;/li&gt;\n&lt;/ol&gt;\n&lt;h2&gt;&lt;span style=&quot;font-weight: 400;&quot;&gt;You should apply if you have:&lt;/span&gt;&lt;/h2&gt;\n&lt;ul&gt;\n&lt;li style=&quot;font-weight: 400;&quot;&gt;&lt;span style=&quot;font-weight: 400;&quot;&gt;Customer service experience (2/3 years minimum)&lt;br&gt;&lt;/span&gt;&lt;/li&gt;\n&lt;li style=&quot;font-weight: 400;&quot;&gt;&lt;span style=&quot;font-weight: 400;&quot;&gt;Possess excellent verbal and written communication skills&lt;/span&gt;&lt;/li&gt;\n&lt;li style=&quot;font-weight: 400;&quot;&gt;&lt;span style=&quot;font-weight: 400;&quot;&gt;Time management and multitasking skills in order to handle multiple tasks and clients at once&lt;/span&gt;&lt;/li&gt;\n&lt;li style=&quot;font-weight: 400;&quot;&gt;&lt;span style=&quot;font-weight: 400;&quot;&gt;Strong organizational skills and attention to detail&lt;/span&gt;&lt;/li&gt;\n&lt;li style=&quot;font-weight: 400;&quot;&gt;&lt;span style=&quot;font-weight: 400;&quot;&gt;Capable of prioritizing tasks/requests to meet the client &amp;amp; company needs&lt;/span&gt;&lt;/li&gt;\n&lt;li style=&quot;font-weight: 400;&quot;&gt;&lt;span style=&quot;font-weight: 400;&quot;&gt;Ability to work independently and as part of a team&lt;/span&gt;&lt;/li&gt;\n&lt;/ul&gt;\n&lt;h2&gt;&lt;span style=&quot;font-weight: 400;&quot;&gt;You will be responsible for:&lt;/span&gt;&lt;/h2&gt;\n&lt;ul&gt;\n&lt;li style=&quot;font-weight: 400;&quot;&gt;&lt;span style=&quot;font-weight: 400;&quot;&gt;Act as the first point of contact for company clients&lt;/span&gt;&lt;/li&gt;\n&lt;li style=&quot;font-weight: 400;&quot;&gt;&lt;span style=&quot;font-weight: 400;&quot;&gt;Resolve complaints and prevent additional issues by improving processes.&lt;/span&gt;&lt;/li&gt;\n&lt;li style=&quot;font-weight: 400;&quot;&gt;&lt;span style=&quot;font-weight: 400;&quot;&gt;Build &amp;amp; maintain a good relationship with assigned carriers based on trust and respect&lt;/span&gt;&lt;/li&gt;\n&lt;li style=&quot;font-weight: 400;&quot;&gt;&lt;span style=&quot;font-weight: 400;&quot;&gt;Collaborate with internal departments to fulfill carrier needs&lt;/span&gt;&lt;/li&gt;\n&lt;li style=&quot;font-weight: 400;&quot;&gt;&lt;span style=&quot;font-weight: 400;&quot;&gt;Maintain up-to-date knowledge of assigned accounts&lt;/span&gt;&lt;/li&gt;\n&lt;li style=&quot;font-weight: 400;&quot;&gt;&lt;span style=&quot;font-weight: 400;&quot;&gt;Answer incoming calls from carriers, brokers &amp;amp; potential new clients&lt;/span&gt;&lt;/li&gt;\n&lt;li style=&quot;font-weight: 400;&quot;&gt;&lt;span style=&quot;font-weight: 400;&quot;&gt;Communicate with assigned carriers via email, text, or phone&lt;/span&gt;&lt;/li&gt;\n&lt;/ul&gt;\n&lt;h2&gt;&lt;span style=&quot;font-weight: 400;&quot;&gt;Benefits&lt;/span&gt;&lt;/h2&gt;\n&lt;p&gt;&amp;nbsp;&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;Monthly Mental Break Day&lt;/li&gt;\n&lt;li&gt;Paid Time Off&lt;/li&gt;\n&lt;li&gt;Work from home (or wherever)&lt;/li&gt;\n&lt;li&gt;Parental leave&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;&lt;span style=&quot;font-weight: 400;&quot;&gt;Creating a diverse and inclusive workplace is Bobtail’s nucleus. We are an equal opportunity employer and embrace people of different backgrounds, cultures, religions, national origins, races, colors, genders, gender expressions, sexual orientations, ages, marital status, veteran status, experiences, abilities, and perspective&lt;/span&gt;&lt;span style=&quot;font-weight: 400;&quot;&gt;s.&lt;/span&gt;&lt;span style=&quot;font-weight: 400;&quot;&gt; &lt;/span&gt;&lt;span style=&quot;font-weight: 400;&quot;&gt;&lt;br&gt;&lt;br&gt;&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;br&gt;&lt;br&gt;&lt;/p&gt;","tags":"[\"management\"]","pubDate":"2025-01-14T21:50:58.000Z","link":"https://job-boards.greenhouse.io/bobtail/jobs/4517048005","slug":"client-success-representative-bilingual-english-spanish-bobtail-2558"},{"id":5720051531,"title":"Data Engineer","company":"BioRender","image":"https://avatars.githubusercontent.com/u/46490948?s=200&v=4","description":"<p style=\"min-height:1.5em\">At BioRender, we are accelerating the world’s ability to discover, learn, and communicate science faster through visuals. Today, BioRender empowers millions of scientists to create beautiful, accurate biological figures for communication within pharma companies and academic research.</p><p style=\"min-height:1.5em\"></p><p style=\"min-height:1.5em\">Our vision is to make BioRender the place where humans read biology—translating human and AI-generated data into scientifically accurate, human-understandable visuals. As AI automates large parts of research, BioRender will transform complex data, experimental results, and text inputs into clear, intuitive visuals that scientists, decision-makers, and broader audiences can quickly interpret. Visual communication will be critical to accelerating breakthroughs across academia and industry, and BioRender will bridge the gap between specialized knowledge domains.</p><p style=\"min-height:1.5em\"></p><p style=\"min-height:1.5em\">Our Data Platform team is at the heart of collecting and unlocking data at BioRender. We seek to build and maintain the right architecture and tooling to support our data science, analytics, product, and machine learning initiatives. An ideal candidate will have plenty of experience building data products and helping shape data strategy in a fast-paced startup environment</p><p style=\"min-height:1.5em\"></p><p style=\"min-height:1.5em\"><strong>What you'll bring :</strong></p><ul style=\"min-height:1.5em\"><li><p style=\"min-height:1.5em\">5+ years of data engineering experience of relevant industry experience</p></li><li><p style=\"min-height:1.5em\">Expertise working with Data Warehousing platforms (AWS RedShift or Snowflake preferred) and data lake / lakehouse architectures</p></li><li><p style=\"min-height:1.5em\">Experience with Data Streaming platforms (AWS Kinesis / Firehose preferred) </p></li><li><p style=\"min-height:1.5em\">Demonstrated ability to (creatively) solve complex architectural problems, think about tradeoffs and systems design</p></li><li><p style=\"min-height:1.5em\">Effective communication skills and ability to translate deeply technical designs into business appropriate representations as well as analyze business needs and requirements ensuring implementation of data services directly correlates to the strategy and growth of the business</p></li><li><p style=\"min-height:1.5em\">Expertise with SQL and programming languages commonly used in data platforms (Python, Spark, etc) </p></li><li><p style=\"min-height:1.5em\">Experience with data pipeline orchestration (e.g., Airflow) and data pipeline integrations (e.g. Airbyte, Stitch)</p></li></ul><p style=\"min-height:1.5em\"></p><p style=\"min-height:1.5em\"><strong>Our ideal fit brings:</strong></p><ul style=\"min-height:1.5em\"><li><p style=\"min-height:1.5em\">Detail-oriented, process-oriented, data-focused, and good at picking up on data inconsistencies</p></li><li><p style=\"min-height:1.5em\">Growth mindset, excited to learn new libraries / technologies but extremely practical and deliberate about adopting them for production. Extremely thoughtful about tradeoffs between different tools and whether they are solving the right problems for the team and for our users</p></li><li><p style=\"min-height:1.5em\">Strong work ethic with a focus on delivering results</p></li><li><p style=\"min-height:1.5em\">Inquisitive, thorough, and pragmatic</p></li><li><p style=\"min-height:1.5em\">Excellent communication skills with the ability to explain complex solutions/problems clearly and succinctly to the team and internal stakeholders</p></li><li><p style=\"min-height:1.5em\">Enjoys working cross-functionally and helping teammates work more effectively</p></li></ul><p style=\"min-height:1.5em\"></p><p style=\"min-height:1.5em\"><strong>Nice to haves:</strong></p><ul style=\"min-height:1.5em\"><li><p style=\"min-height:1.5em\">Proficiency in dbt, sdf, or an equivalent SQL development framework</p></li><li><p style=\"min-height:1.5em\">Hands-on experience with data mesh architecture</p></li><li><p style=\"min-height:1.5em\">Experience with Data as a Product (DaaP) principles, emphasizing data discoverability, quality, security, and self-service accessibility</p></li></ul><p style=\"min-height:1.5em\"></p><p style=\"min-height:1.5em\"><strong>Why join us?</strong></p><ul style=\"min-height:1.5em\"><li><p style=\"min-height:1.5em\"><strong>We are mission-driven</strong>: we work collaboratively towards our shared vision of improving scientific communication and accelerating scientific discovery. BioRender figures have appeared in more than 54,000 publications! </p></li><li><p style=\"min-height:1.5em\"><strong>BioRender is loved by millions!</strong> We have a world-class NPS and a community of loyal fans and users in 200+ countries!</p></li><li><p style=\"min-height:1.5em\"><strong>Our company is backed by top investors</strong> and accelerators like Y Combinator, and we are on a growth trajectory comparable to many top-performing SaaS companies </p></li><li><p style=\"min-height:1.5em\"><strong>We’re remote-first</strong> with team members across Canada and the U.S., offering you the flexibility to work from anywhere. </p></li></ul><p style=\"min-height:1.5em\"></p><p style=\"min-height:1.5em\">BioRender is an Equal Opportunity Employer. We celebrate diversity and are committed to creating an inclusive environment for all employees. All qualified applicants will receive consideration for employment without regard to race, color, religion, sex, sexual orientation, gender identity, national origin, disability, or veteran status.</p>","tags":"[\"engineering\",\"aws\"]","pubDate":"2025-01-14T21:42:58.762Z","link":"https://jobs.ashbyhq.com/biorender/f22237ff-ad9e-4883-9d03-f7023435e4ad","slug":"data-engineer-biorender-9648"},{"id":2809177489,"title":"Senior / Staff Backend Engineer","company":"Kindred","image":"https://instagram.fcmb2-2.fna.fbcdn.net/v/t51.2885-19/278488600_362609942591349_5608095197475222823_n.jpg?_nc_ht=instagram.fcmb2-2.fna.fbcdn.net&_nc_cat=1&_nc_oc=Q6cZ2AGpE9ghK6FVW-SUB3AI4p7-QXdLJ2cyAQzC5L8eRJDQ4hPTFMD5v99r3e08B8ISLJU&_nc_ohc=10EvF-gTgGEQ7kNvgH-nAe-&_nc_gid=24073162fb2e4f89ba6e1396958855ee&edm=AP4sbd4BAAAA&ccb=7-5&oh=00_AYDpVQxFijM0gWMzp6mC80WuwFFKSztyKYeZhcngAbZEXw&oe=67708C4E&_nc_sid=7a9f4b","description":"<p style=\"min-height:1.5em\">Kindred is a members-only home swapping network that unlocks the ability to live a travel-rich lifestyle through the power of community. By exchanging primary residences with trusted peers, renters and owners alike can match with Kindred spirits and explore new destinations without breaking the bank.</p><p style=\"min-height:1.5em\">We are on a mission to build a sharing economy that lives up to the name, and we’ve raised significant capital from some of the best investors in Silicon Valley, including Index Ventures, Andreessen Horowitz, New Enterprise Associates, Bessemer Venture Partners, Caffeinated Capital, Elad Gil, and the founders of Opendoor, Figma, ClassPass, Clubhouse, Divvy, Gem, and Homebound.</p><p style=\"min-height:1.5em\">The co-founders are proven leaders from the early team at proptech company Opendoor ($15B+ exit) and have each separately built and scaled products that today do $1B+ annual revenue combined.</p><p style=\"min-height:1.5em\">We’re looking for the world’s top builders, executors, and believers to join us on this ride.</p><p style=\"min-height:1.5em\">You can learn more about us in <a target=\"_blank\" rel=\"noopener noreferrer nofollow\" href=\"https://www.forbes.com/sites/bridgetarsenault/2022/06/10/a-new-home-swapping-platform-allows-you-to-travel-the-world-like-cameron-diaz-and-kate-winslet/?sh=203a5d0722cb\">Forbes</a> and <a target=\"_blank\" rel=\"noopener noreferrer nofollow\" href=\"https://techcrunch.com/2023/04/19/opendoor-alums-raise-15m-for-kindred-a-home-swapping-network/\">TechCrunch</a>.</p><h1><strong>The Role:</strong></h1><p style=\"min-height:1.5em\">We’re looking for a world-class engineer with deep experience in backend software development to join our team.</p><p style=\"min-height:1.5em\">We're looking for a thought partner who is motivated by the opportunity to build an iconic consumer product that will shape the future of travel.</p><h2><strong>You Will:</strong></h2><ul style=\"min-height:1.5em\"><li><p style=\"min-height:1.5em\">Serve as technology lead and own key decisions including the tech stack and strategy for backend design, data infrastructure, and machine learning investments</p></li><li><p style=\"min-height:1.5em\">Work directly with the co-founders, product designers, and frontend engineers to build the first version of our platform</p></li><li><p style=\"min-height:1.5em\">Help establish and grow our engineering organization and mentor the next generation of technology leaders</p></li><li><p style=\"min-height:1.5em\">Have access to our bench of world class technical advisors and angels for mentorship and support as needed</p></li></ul><h1><strong>You may be a right fit for this role if you:</strong></h1><ul style=\"min-height:1.5em\"><li><p style=\"min-height:1.5em\">Have 5+ years of technical experience as a backend software engineer</p></li><li><p style=\"min-height:1.5em\">Have experience crafting robust backends and database structures that can both scale with user volume as well as business complexity</p></li><li><p style=\"min-height:1.5em\">Have some experience with devops (setting up CI/CD, containerization, etc.)</p></li><li><p style=\"min-height:1.5em\">Have worked with service providers like AWS, configured CDNs, used Heroku, etc.</p></li><li><p style=\"min-height:1.5em\">Have demonstrated success operating as a tech lead on critical projects at previous roles</p></li><li><p style=\"min-height:1.5em\">Have prior experience at a high-growth stage company</p></li><li><p style=\"min-height:1.5em\">Are an entrepreneur at heart who is excited about bringing new experiences to the world</p></li><li><p style=\"min-height:1.5em\">Are motivated by consumer products and building platforms that become cornerstones of consumer behavior</p></li><li><p style=\"min-height:1.5em\">Have the ability to exercise strong judgment and make difficult technical tradeoff decisions</p></li><li><p style=\"min-height:1.5em\">Are an excellent listener and strong communicator, working well cross-functionally in a fast-paced environment</p></li><li><p style=\"min-height:1.5em\">Are comfortable with uncertainty and ambiguity</p></li><li><p style=\"min-height:1.5em\">Enjoy the process of making something new and unknown</p></li><li><p style=\"min-height:1.5em\">Have a pragmatic approach to engineering — you’re not dogmatic and know how to choose the best tool or process for the job at hand</p></li><li><p style=\"min-height:1.5em\">Come to work with energy, humility, and positivity</p></li></ul><h1><strong>Our Benefits:</strong></h1><p style=\"min-height:1.5em\">At Kindred, we know that good things happen when we look out for one another. We offer our employees the following benefits:</p><ul style=\"min-height:1.5em\"><li><p style=\"min-height:1.5em\">Our opening spans more than one career level. The base salary offered depends on many factors, such as work experience, transferable skills, business needs and impact, and market demands.</p></li><li><p style=\"min-height:1.5em\">A vibrant, inclusive, and highly skilled team that ferociously protects team chemistry</p></li><li><p style=\"min-height:1.5em\">A culture of championship (vs. just mentorship), feedback, and continual development</p></li><li><p style=\"min-height:1.5em\">Competitive cash compensation and equity</p></li><li><p style=\"min-height:1.5em\">Comprehensive health benefits</p></li><li><p style=\"min-height:1.5em\">Flexible vacation policy</p></li><li><p style=\"min-height:1.5em\">Unlimited credits to stay at Kindred homes during your time as an employee</p></li><li><p style=\"min-height:1.5em\">$4,000 annual travel stipend to use toward travel costs to stay at a Kindred home</p></li><li><p style=\"min-height:1.5em\">Remote-flexible work environment. We encourage team members to travel and adventure, including working from Kindred HQ in San Francisco!</p></li><li><p style=\"min-height:1.5em\">Regular offsites to co-locate with the team</p></li></ul><p style=\"min-height:1.5em\"><em>At Kindred, we believe that bringing together people who have different worldviews, personal circumstances, and unique experiences improves our customer service, work environment, and one another. Diverse strengths, abilities, ideas, and perspectives power the flow of innovation and creativity, which is vital to our success. We encourage people from all walks of life — all backgrounds, identities, genders, ages, races, religions, abilities, and socioeconomic statuses — to apply.</em></p><p style=\"min-height:1.5em\"><em>We are committed to providing equal employment opportunities for all applicants and employees. Kindred does not discriminate on the basis of any protected characteristic, including race, color, ancestry, national origin, religion, creed, age, disability, sex, gender, sexual orientation, gender identity, gender expression, medical condition, genetic information, family care or medical leave status, marital status, domestic partner status, military and veteran status, or any other characteristic protected by US federal, state or local laws, or the laws of the country or jurisdiction where you work. Pursuant to the San Francisco Fair Chance Ordinance, we will consider for employment qualified applicants with arrest and conviction records.</em></p>","tags":"[\"engineering\",\"database\",\"aws\"]","pubDate":"2025-01-14T20:08:59.311Z","link":"https://jobs.ashbyhq.com/kindred/ac098955-f86f-4aeb-8578-c2b2b96c11d9","slug":"senior-staff-backend-engineer-kindred-6875"},{"id":9941102866,"title":"Performance Creative Strategist","company":"Winona","image":"https://yt3.googleusercontent.com/ZGlfAez34nsR8HXg119c3neHtGLos5lWuyQOAnml2Wuvb0stHrZPUSGBBkxK3YzNDCXOJd5oI9M=s160-c-k-c0x00ffffff-no-rj","description":"<p style=\"min-height:1.5em\"><strong>About Winona:</strong></p><p style=\"min-height:1.5em\"><a target=\"_blank\" rel=\"noopener noreferrer nofollow\" href=\"https://bywinona.com\">Winona</a> is one of the leading telemedicine companies providing HRT for women in menopause. We’ve built all of our technology in house including an EHR, patient care admin system, patient portal, website, marketing technology etc. Winona has two compounding pharmacies and a team of in house physicians providing world-class care via a fully vertically integrated business model.</p><p style=\"min-height:1.5em\"></p><p style=\"min-height:1.5em\"><strong>About the role:</strong></p><p style=\"min-height:1.5em\">We are looking for a talented and driven full-time remote <strong>Performance Creative Strategist</strong> to join our team. In this role, you will play a key part in shaping and executing high-performing paid media campaigns that drive customer acquisition and engagement. As a Performance Creative Strategist, you will work closely with designers and creative teams to conceptualize impactful advertising strategies, focusing on data-driven insights and audience engagement.</p><p style=\"min-height:1.5em\"></p><p style=\"min-height:1.5em\"><strong>Seniority Level: </strong>Senior-level</p><p style=\"min-height:1.5em\"></p><p style=\"min-height:1.5em\"><strong>Responsibilities:</strong></p><p style=\"min-height:1.5em\">Develop and Execute Creative Strategies</p><ul style=\"min-height:1.5em\"><li><p style=\"min-height:1.5em\">Craft and implement creative strategies specifically tailored for paid media channels, including social media, search, and display.</p></li><li><p style=\"min-height:1.5em\">Collaborate with cross-functional teams, including marketing, product, and design, to deliver cohesive and impactful advertising campaigns.</p></li></ul><p style=\"min-height:1.5em\">Creative Collaboration</p><ul style=\"min-height:1.5em\"><li><p style=\"min-height:1.5em\">Partner with designers and creative teams to ideate, brief, and guide the development of performance-driven content, ensuring alignment with campaign goals.</p></li><li><p style=\"min-height:1.5em\">Provide creative direction and feedback on all aspects of the creative process, from concept to execution.</p></li></ul><p style=\"min-height:1.5em\">Research and Insights Gathering</p><ul style=\"min-height:1.5em\"><li><p style=\"min-height:1.5em\">Conduct research and gather insights to deeply understand the needs and preferences of women experiencing menopause.</p></li><li><p style=\"min-height:1.5em\">Develop audience personas and identify key messaging that resonates with our target audience.</p></li></ul><p style=\"min-height:1.5em\">Performance Optimization</p><ul style=\"min-height:1.5em\"><li><p style=\"min-height:1.5em\">Optimize creative strategies based on performance data and A/B testing to continually improve campaign outcomes.</p></li><li><p style=\"min-height:1.5em\">Monitor paid media performance metrics and provide actionable insights to refine creative strategies.</p></li></ul><p style=\"min-height:1.5em\">Stay Informed</p><ul style=\"min-height:1.5em\"><li><p style=\"min-height:1.5em\">Stay up-to-date with industry trends, competitor activity, and emerging platforms to keep Winona’s paid media strategies fresh and innovative.</p></li></ul><p style=\"min-height:1.5em\"></p><p style=\"min-height:1.5em\"><strong>Requirements</strong>:</p><ul style=\"min-height:1.5em\"><li><p style=\"min-height:1.5em\">3+ years of proven experience in a creative or strategic role focused on paid media, preferably in healthcare, wellness, or lifestyle brands.</p></li><li><p style=\"min-height:1.5em\">Expertise in crafting performance-driven ad strategies for platforms like Facebook, Instagram, Google Ads, and TikTok.</p></li><li><p style=\"min-height:1.5em\">Strong analytical skills with a data-driven mindset to assess and optimize campaign performance.</p></li><li><p style=\"min-height:1.5em\">Exceptional storytelling skills with a strong ability to connect emotionally with an audience through paid media.</p></li><li><p style=\"min-height:1.5em\">Experience briefing and collaborating with creative teams and designers.</p></li><li><p style=\"min-height:1.5em\">Strong project management skills and the ability to work collaboratively in a fast-paced environment.</p></li><li><p style=\"min-height:1.5em\">A passion for women’s health and a commitment to destigmatizing menopause.</p></li></ul><p style=\"min-height:1.5em\"></p><p style=\"min-height:1.5em\"><strong>What’s in it for you?</strong></p><p style=\"min-height:1.5em\">As a full-time member of our team, you’ll enjoy:</p><ul style=\"min-height:1.5em\"><li><p style=\"min-height:1.5em\">Flexible hours, work wherever you choose.</p></li><li><p style=\"min-height:1.5em\">Unlimited PTO.</p></li><li><p style=\"min-height:1.5em\">Medical/ Dental/ Vision insurance (US-W2).</p></li><li><p style=\"min-height:1.5em\">Non-working holidays per country of residence.</p></li><li><p style=\"min-height:1.5em\">Referral bonuses.</p></li><li><p style=\"min-height:1.5em\">Financial support for online courses.</p></li><li><p style=\"min-height:1.5em\">Fun and casual work environment.</p></li><li><p style=\"min-height:1.5em\">Employee engagement activities and virtual gatherings.</p></li><li><p style=\"min-height:1.5em\">We are a diverse, global team! 🌍</p></li></ul>","tags":"[\"management\"]","pubDate":"2025-01-14T16:16:15.613Z","link":"https://jobs.ashbyhq.com/winona/2bf8c877-7851-4110-8c97-4220008da185","slug":"performance-creative-strategist-winona-1136"},{"id":9984466304,"title":"Chief Information Security Officer","company":"Supabase","image":"https://avatars.githubusercontent.com/u/54469796?s=200&v=4","description":"<p style=\"min-height:1.5em\">Supabase is an Open Source and fully remote company building developer tools for databases.</p><p style=\"min-height:1.5em\">We are looking for an experienced Chief Information Security Officer (CISO) to lead and improve the security of our hosted cloud offering. We manage over 1 million Postgres databases for our users and are <a target=\"_blank\" rel=\"noopener noreferrer nofollow\" href=\"https://x.com/kiwicopple/status/1874018276638154803\">growing fast</a>. We are custodians of user data and securing their data is fundamental in ensuring users continue to trust us.</p><p style=\"min-height:1.5em\">You will be responsible for securing the Supabase Cloud offering. Here’s what you’ll be working on:</p><ul style=\"min-height:1.5em\"><li><p style=\"min-height:1.5em\">Security engineering: improve the baseline security of our product suite by evaluating features from a security perspective and making security a core part of our software development lifecycle</p></li><li><p style=\"min-height:1.5em\">Security as a Product: Design and develop platform security features like user-configurable firewalls, audit logs, alerting mechanisms and other tools that empower users to manage their own security.</p></li><li><p style=\"min-height:1.5em\">Security Training: Strengthen the security culture in the company by running through attack simulations and workshops.</p></li><li><p style=\"min-height:1.5em\">Governance and compliance: Ensure compliance with laws, regulations, and frameworks such as GDPR, PCI DSS, SOC2 and HIPAA</p></li><li><p style=\"min-height:1.5em\">Incident response: Lead efforts to mitigate attacks on our platform and operationalize a robust security incident response plan.</p></li><li><p style=\"min-height:1.5em\">Security Automation: Streamline security processes by automating controls with tools like MDM, SIEM, and other tools.</p></li><li><p style=\"min-height:1.5em\">Be the security expert in conversations with key customers.</p></li><li><p style=\"min-height:1.5em\">Risk management: Identify and mitigate risks through risk assessments, audits and training sessions.</p></li></ul><p style=\"min-height:1.5em\"><strong>You are:</strong></p><ul style=\"min-height:1.5em\"><li><p style=\"min-height:1.5em\">Passionate about securing systems and building trust through robust security practices.</p></li><li><p style=\"min-height:1.5em\">Worked as a CISO or similar leadership role for 4+ years.</p></li><li><p style=\"min-height:1.5em\">Comfortable working in a fully remote environment and collaborating closely with engineers</p></li><li><p style=\"min-height:1.5em\">Skilled at scaling up security programs within B2B SaaS companies</p></li><li><p style=\"min-height:1.5em\">Experience working for developer tools or platform companies is a plus</p></li><li><p style=\"min-height:1.5em\">An excellent communicator to both technical and non-technical audiences</p></li></ul><h3>We offer:</h3><ul style=\"min-height:1.5em\"><li><p style=\"min-height:1.5em\">100% remote work from anywhere in the world. No location-based adjustment to your salary.</p></li><li><p style=\"min-height:1.5em\">Autonomous work. We work collaboratively on projects, but you set your own pace.</p></li><li><p style=\"min-height:1.5em\">Health, Vision and Dental benefits. Supabase covers 100% of the cost for employees and 80% for dependants</p></li><li><p style=\"min-height:1.5em\">Generous Tech Allowance for any office setup you need</p></li><li><p style=\"min-height:1.5em\">Annual Education Allowance</p></li><li><p style=\"min-height:1.5em\">Annually run off-sites.</p></li></ul><h2>About the team</h2><ul style=\"min-height:1.5em\"><li><p style=\"min-height:1.5em\">We're a startup. It's unstructured.</p></li><li><p style=\"min-height:1.5em\">Collectively founded more than 30 startups.</p></li><li><p style=\"min-height:1.5em\">Globally distributed team with more than 30 different nationalities.</p></li><li><p style=\"min-height:1.5em\">We deeply believe in <a target=\"_blank\" rel=\"noopener noreferrer nofollow\" href=\"https://supabase.com/blog/2022/03/25/should-i-open-source-my-company\">the efficacy of collaborative open source</a>. We support existing communities and tools, rather than building \"yet another xx\".</p></li><li><p style=\"min-height:1.5em\">We \"dogfood\" everything. If you use it in your project, we use it in Supabase.</p></li></ul><h2>Process</h2><ul style=\"min-height:1.5em\"><li><p style=\"min-height:1.5em\">The entire process is fully remote and all communication will happen over email or via video chat.</p></li><li><p style=\"min-height:1.5em\">Once you've submitted your application, the team will review your submission and may reach out for a short screening interview over a video call.</p></li><li><p style=\"min-height:1.5em\">If you pass the screen you will be invited to up to four follow-up interviews. </p></li><li><p style=\"min-height:1.5em\">The calls:</p><ul style=\"min-height:1.5em\"><li><p style=\"min-height:1.5em\">usually take between 20-45 minutes each depending on the interviewer.</p></li><li><p style=\"min-height:1.5em\">most of the time, are all 1:1.</p></li><li><p style=\"min-height:1.5em\">will be with the founders, a member of either the growth or engineering team (depending on the role) and usually one other person from your immediate team or function.</p></li></ul></li><li><p style=\"min-height:1.5em\">Once the interviews are over, the team will meet to discuss several roles and candidates and may:</p><ul style=\"min-height:1.5em\"><li><p style=\"min-height:1.5em\">ask one or two follow-up questions over email or a quick call.</p></li><li><p style=\"min-height:1.5em\">go directly to making an offer.</p></li></ul></li></ul>","tags":"[\"postgres\",\"management\",\"engineering\",\"b2b\",\"database\",\"aws\"]","pubDate":"2025-01-14T14:40:44.637Z","link":"https://jobs.ashbyhq.com/supabase/8e7a3512-c453-4a93-a236-93e1e9b0f4d5","slug":"chief-information-security-officer-supabase-8919"},{"id":3404990521,"title":"Senior Python/Go Developer for Imunify (worldwide remote, work anywhere)","company":"CloudLinux","image":"https://pbs.twimg.com/profile_images/696718028084482050/ymY3OEPk_400x400.png","description":"<p>CloudLinux OS, our flagship product, runs on more than 50,000 production servers today, powering over 40 million websites, and is recognized as the best OS for security and efficiency in a shared hosting environment. CloudLinux OS increases server density and enhances security, thus reducing operating costs, decreasing churn rates, and increasing profitability.</p><p>Check out our website for more information about our CLOS Product: <a href=\"https://www.cloudlinux.com/\" rel=\"nofollow noreferrer noopener\" class=\"external\">https://www.cloudlinux.com/</a></p><p></p><p><strong>We are looking for a Senior Python/Go Developer to join our dynamic team at Imunify360.</strong></p><p>Imunify360 Security Suite is a product of CloudLinux Inc., the maker of the #1 OS in security and stability for hosting providers. Imunify is an innovative security solution designed specifically for shared and VPS/Dedicated servers. The automated, easy-to-use solution with the six-layer approach to security delivers comprehensive and complete attack prevention.</p><p>More details about the project can be found on the product website: <a href=\"https://www.imunify360.com/\" rel=\"nofollow noreferrer noopener\" class=\"external\">https://www.imunify360.com/</a></p><p></p><p><strong>As the Senior Python/Go Developer, your responsibilities will include:</strong></p><ul> <li>Contributing to the development of Imunify360 products using Python.</li> <li>Writing unit and functional tests to ensure code quality and reliability.</li> <li>Reviewing code submitted by colleagues.</li> <li>Designing architecture and creating technical documentation for new features.</li> <li>Investigating and resolving issues reported by clients, partners, or the support team.</li> </ul><h3>Requirements: </h3><ul> <li>5+ years of Python programming experience.</li> <li>Experience in GoLang.</li> <li>Strong Linux knowledge.</li> <li>Experience in system programming: sockets, filesystem, process management.</li> <li>Experience with automated testing and CI/CD systems.</li> <li>Upper-intermediate or higher proficiency in English.</li> </ul><p></p><p><strong>Would be a plus:</strong></p><ul> <li>Experience with network security.</li> <li>Experience with Linux server administration.</li> <li>Familiarity with RPM and DEB package management.</li> </ul><p></p><p><strong>Personal skills:</strong></p><ul> <li>Fast learner with a proactive approach.</li> <li>Strong self-motivation, driven to achieve committed milestones.</li> <li>Strong prioritization skills and a flexible mindset.</li> <li>Ability to independently analyze tasks and find the right solutions.</li> <li>Ability to work with vague requirements and make independent decisions.</li> <li>Ability to work effectively in a team.</li> </ul><h3>Benefits: </h3><p>What's in it for you?</p><ul> <li>A focus on professional development.</li> <li>Interesting and challenging projects.</li> <li>Fully remote work with flexible working hours, that allows you to schedule your day and work from any location worldwide.</li> <li>Paid 24 days of vacation per year, 10 days of national holidays, and unlimited sick leaves.</li> <li>Compensation for private medical insurance.</li> <li>Co-working and gym/sports reimbursement.</li> <li>Budget for education.</li> <li>The opportunity to receive a reward for the most innovative idea that the company can patent.</li> </ul><p><br>By applying for this position, you consent to the processing of your personal data as described in our Privacy Policy (<a href=\"https://cloudlinux.com/candidate-privacy-notice\" rel=\"nofollow noreferrer noopener\" class=\"external\">https://cloudlinux.com/candidate-privacy-notice</a>), which provides detailed information on how we maintain and handle your data.</p>","tags":"[\"management\"]","pubDate":"2025-01-14T00:00:00.000Z","link":"https://apply.workable.com/cloudlinux-1/j/B5F53071E1","slug":"senior-python-go-developer-for-imunify-worldwide-remote-work-anywhere-cloudlinux-1042"},{"id":7545503319,"title":"Video Editor - Social Media Ads for eCommerce D2C Brand - REMOTE","company":"Chef Preserve","image":"https://remotive.com/job/1963445/logo","description":"<p>Are you a creative and detail-oriented video editor with a passion for creating engaging social media content? We are looking for a <strong>Video Editor</strong> to join our team and craft compelling commercials that showcase our products.</p>\n<p>As a key member of our creative team, you will receive high-quality raw video files, scripts, and instructions to produce polished videos tailored for various social media platforms. We expect you to familiarize yourself with our extensive media library to select the best raw files for each scene, creating a seamless and engaging narrative.<br><br>Whether it's 4:5, 9:16, or 16:9 formats, you’ll ensure the final product captivates and resonates with our audience.</p>\n<p>If you’re detail-oriented, thrive on creative challenges, and are driven to achieve perfection in every edit, this role is perfect for you.<br><br><strong>Experience in Video Editing or similar role in a D2C e-commerce company is a must. (2+ Year Experience)</strong><br><br><strong>Key Responsibilities:</strong></p>\n<ol style=\"\">\n<li style=\"\">Edit high-quality social media ads in formats such as 4:5, 9:16, and 16:9.</li>\n<li style=\"\">Work closely with creative directors and media buyers to strategize and execute content plans.</li>\n<li style=\"\">Review and manage extensive media libraries to identify the best raw footage for each project.</li>\n<li style=\"\">Ensure all edits are product-focused, engaging, and highlight the product’s features effectively.</li>\n<li style=\"\">Maintain a strong focus on detail to deliver polished, professional, and visually compelling edits.</li>\n<li style=\"\">Utilize industry-standard editing platforms like Final Cut Pro, Adobe Premiere Pro, or equivalent software.</li>\n<li style=\"\">Stay up-to-date with social media trends to ensure content remains relevant and effective.</li>\n</ol>\n<p><br><br><strong>Requirements</strong><br><br></p>\n<ol style=\"\">\n<li style=\"\">Proven experience in video editing, preferably for social media platforms (2+ years).</li>\n<li style=\"\">Proficiency in editing software such as Final Cut Pro, Adobe Premiere Pro, or similar tools.</li>\n<li style=\"\"><strong>A strong portfolio showcasing creative and engaging video content is a must!</strong></li>\n<li style=\"\">Exceptional attention to detail and a commitment to producing high-quality work.</li>\n<li style=\"\">Strong organizational skills to manage media libraries and editing projects efficiently.</li>\n<li style=\"\">Ability to collaborate and communicate effectively with creative teams.</li>\n<li style=\"\">Familiarity with social media trends and platform-specific video requirements.</li>\n<li style=\"\">A creative mindset with a focus on storytelling and audience engagement.</li>\n<li style=\"\"><strong>Commitment to working exclusively with our team, ensuring undivided focus on the job and its responsibilities.</strong></li>\n</ol>\n<p><br><br><strong>Benefits</strong><br><br></p>\n<p><strong>Competitive Salary:</strong> $60,000 - $80,000 per year</p>\n<p><strong>Bonuses</strong>: End-of-year bonus</p>\n<p><strong>Additional Benefits</strong>: Annual wellness and home office budget</p>\n<p><strong>Paid Leave:</strong> 14 days annually</p>\n<p><strong>Creative Growth:</strong> Work in a collaborative environment with opportunities to strategize and innovate</p>\n<p><strong>Flexibility:</strong> Fully remote position with flexible working hours</p>\n<img src=\"https://remotive.com/job/track/1963445/blank.gif?source=public_api\" alt=\"\"/>","tags":"[\"ecommerce\",\"social media\",\"video\",\"D2C\",\"editing\",\"video editing\"]","pubDate":"2025-01-13T13:29:50.000Z","link":"https://remotive.com/remote-jobs/marketing/video-editor-social-media-ads-for-ecommerce-d2c-brand-remote-1963445","slug":"video-editor-social-media-ads-for-ecommerce-d2c-brand-remote-chef-preserve-1126"}]