[{"id":6306911233,"title":"Data Migration Specialist","company":"Booksy","image":"https://remotive.com/job/1959215/logo","description":"<p> </p>\n<p>A career at Booksy means you’re part of a global team focused on helping people around the world feel great about themselves, every day. From empowering entrepreneurs to build successful businesses, to supporting their customers arrange 'me time' moments, we’re in the business of helping people thrive and feel fantastic.</p>\n<p>Working in an ever-changing, scale-up where things are messy, and resources are limited isn't for everyone. If you thrive in a stable environment with big budgets, clear processes and structures then, if being honest, we’re probably not for you. However, if you love bringing order to chaos, inventively solving problems, and prioritizing your own path within ambiguity, then you're likely to love it here.</p>\n<p><strong>The people you’ll like to work with and things you'll enjoy impacting:</strong></p>\n<p>The Data Migration Specialist plays a key role in ensuring the efficient and secure data transfer. He/she is responsible for customer data migration processes (configuration), including import and export, facilitating the smooth onboarding of new customers. The specialist ensures that all processes are GDPR compliant, which is essential to maintain data security and confidentiality. In close cooperation with other departments, especially the product experts and the systems and operations specialist, the data migration specialist helps to optimize and improve data migration processes.</p>\n<p><strong>Requirements</strong></p>\n<p>Essentially, to ensure you succeed in this role you’re going to need…</p>\n<p> </p>\n<ul style=\"\">\n<li style=\"\">Experience in Data Migration or similar roles.</li>\n<li style=\"\">Basic knowledge of tools such as Admin Panel, Salesforce, Data Studio, Zowie, enabling effective data management and migration.</li>\n<li style=\"\">Proficiency in using tools within the Google Workspace suite for data management and processing. Knowledge of Google Sheets and MS Excel, allowing for work with large datasets, formatting, merging, and filtering data.</li>\n<li style=\"\">Familiarity with data structures related to bookings, customer databases, services, and reviews in Booksy, ensuring efficient data import and export operations.</li>\n</ul>\n<ul style=\"\">\n<li style=\"\">You are meticulous and organised, enabling you to respond quickly and effectively to the needs of our clients and our team.</li>\n<li style=\"\">Positive and proactive attitude, commitment, and ownership of work. Team player.</li>\n<li style=\"\">At a minimum we require conversational level English language skills. Why? English is our company language and is used for any business-wide communications, so we need you to be able to speak English to feel like an integrated part of Booksy.</li>\n</ul>\n<p><strong>Benefits</strong></p>\n<ul style=\"\">\n<li style=\"\">We are proud to be a globally distributed team and have the possibility to work remotely but we also like to share and see our colleagues in the Granada office.</li>\n<li style=\"\">Wellness platform where you can redeem coupons at Zalando, Amazon, Decathlon, MediaMarkt, Primark, Carrefour, or Spotify.</li>\n<li style=\"\">Booksy benefit €50 per month to use on services in our app.</li>\n<li style=\"\">Online English classes once a week.</li>\n<li style=\"\">Psychologist available 2 times per week in English.</li>\n<li style=\"\">Flexible remuneration: Income tax savings to be used on restaurant card, transport, health insurance, childcare, training and discounts on other benefits.</li>\n<li style=\"\">Medical+dental insurance paid by Booksy.</li>\n<li style=\"\">Your day birthday off.</li>\n</ul>\n<p> </p>\n<p>Sounds interesting? Apply by completing the recruitment form :)  We're waiting for you!</p>\n<p> </p>\n<p><strong>Our Diversity and Inclusion Commitment:</strong></p>\n<p>We work in a highly creative and diverse industry so it goes without saying that we strive to create an inclusive environment for all. We welcome people from all backgrounds and are committed to fair consideration in our hiring process. If you have any accessibility needs or require reasonable adjustments during the interview process, please contact us at <a class=\"external\" href=\"mailto:belonging@booksy.com\" rel=\"nofollow\">belonging@booksy.com</a>, so we can best support you.</p>\n<p> </p>\n<p><em><strong>We pride ourselves on being people-first at Booksy, which means you know a human will always review your application. It also means that many of our team are taking a well-deserved break over the festive period. This might cause a little delay in you hearing from us. If we don’t respond by the end of 2024, we’ll definitely be in touch soon into the new year. Thanks for your interest and patience.</strong></em></p>\n<p> </p>\n<p><strong>~ Booksy Team</strong></p>\n<p><br><br></p>\n<div class=\"h2\">About the company</div>\n<p> </p>\n<p><strong>Who are we?</strong></p>\n<p>We’re Booksy and we have a passion for keeping the world’s beauty professionals busy and organized. We love connecting clients with their beauty professionals, so they can look and feel their best making the appointment process as easy and painless as possible is an obsession of ours. Booksy is the world's leading hair &amp; beauty app that solves the more complicated aspects of running a beauty business by taking the nitty-gritty everyday tasks off their hands. Now they have the time to do what they do best, help you be you, only better!</p>\n<p>Do you. We'll do the rest.</p>\n<img src=\"https://remotive.com/job/track/1959215/blank.gif?source=public_api\" alt=\"\"/>","tags":"[\"excel\",\"salesforce\"]","pubDate":"2024-12-29T03:51:21.000Z","link":"https://remotive.com/remote-jobs/data/data-migration-specialist-1959215","slug":"data-migration-specialist-booksy-3562"}]