[{"id":8691701051,"title":"Crypto Newsletter Editor and Writer","company":"Tokenmetrics","image":"https://remotive.com/job/1999038/logo","description":"<div><strong>Token Metrics</strong> is looking for a skilled <strong>Newsletter Editor and Writer</strong> who can turn crypto data, news, and insights into must-read weekly content for thousands of subscribers. You'll bring a clear, confident editorial voice to our newsletter and build a loyal readership.</div>\n<div> </div>\n<div><strong>Job Purpose</strong></div>\n<div>The Newsletter Editor will lead the strategy, writing, and distribution of our email newsletters, helping readers make sense of market trends and positioning Token Metrics as a trusted industry voice.</div>\n<p><br><br></p>\n<div class=\"h3\">Key Responsibilities</div>\n<ul style=\"\">\n<li style=\"\">Write and edit multiple newsletters per week with engaging insights and headlines.</li>\n<li style=\"\">Curate timely, relevant stories from across the crypto world.</li>\n<li style=\"\">Collaborate with analysts and content creators to integrate research insights.</li>\n<li style=\"\">Monitor open rates, click-throughs, and engagement metrics.</li>\n<li style=\"\">Run A/B tests on subject lines and layout formats.</li>\n</ul>\n<p><br><br></p>\n<div class=\"h3\">Required Skills and Qualifications</div>\n<ul style=\"\">\n<li style=\"\">4+ years in journalism, content strategy, or editorial writing.</li>\n<li style=\"\">Proven newsletter experience using tools like Beehiiv, Substack, or Mailchimp.</li>\n<li style=\"\">Strong writing and editing skills with an eye for clarity and flow.</li>\n<li style=\"\">Ability to simplify technical or market content for a general audience.</li>\n</ul>\n<p><br><br></p>\n<div class=\"h3\">Preferred Qualifications</div>\n<ul style=\"\">\n<li style=\"\">Background in crypto and must be knowledgeable about the crypto markets and trends daily.</li>\n<li style=\"\">Experience growing newsletter subscriber lists.</li>\n</ul>\n<div>About Token Metrics</div>\n<div> </div>\n<div>Token Metrics helps crypto investors build profitable portfolios using artificial intelligence-based crypto indices, rankings, and price predictions. </div>\n<div> </div>\n<div>Token Metrics has a diverse set of customers, from retail investors and traders to crypto fund managers, in more than 50 countries.</div>\n<img src=\"https://remotive.com/job/track/1999038/blank.gif?source=public_api\" alt=\"\"/>","tags":"[\"content strategy\",\"editing\"]","pubDate":"2025-04-25T22:51:39.000Z","link":"https://remotive.com/remote-jobs/writing/crypto-newsletter-editor-and-writer-1999038","slug":"crypto-newsletter-editor-and-writer-tokenmetrics-6662"},{"id":3101122115,"title":"Executive Support Coordinator","company":"Sagan Recruitment","image":"https://remotive.com/job/2000194/logo","description":"<p><strong>Job Title:</strong> Executive Support Coordinator</p>\n<p><strong>Location:</strong> Remote (Ability to work within specified time zones as needed)</p>\n<p><strong>Work Schedule:</strong> Flexible based on employer's needs, typically Monday to Friday.</p>\n<p><strong>Company Overview:</strong></p>\n<p>Sagan is an exclusive membership community for top executives, founders, and CEOs seeking to hire and maximize the impact of international talent. We bridge the gap between global talent and US-based businesses, connecting candidates from vibrant regions like Latin America, the Philippines, India, Pakistan, Bangladesh, and Africa with leading American companies. Discover a world of career possibilities with Sagan.</p>\n<p><strong>Position Overview:</strong></p>\n<p>We are looking for a highly skilled and proactive Executive Support Coordinator with <strong>proven experience in executive support or high-level executive assistance</strong> to provide strategic administrative support in a fast-paced, remote work environment. This role is more than just managing schedules and emails, it requires critical thinking, problem-solving, and the ability to anticipate the needs of executives. You will be responsible for optimizing workflows, coordinating high-level projects, and ensuring seamless day-to-day operations.</p>\n<p>The ideal candidate is highly organized, tech-savvy, and detail-oriented, with a strong ability to manage competing priorities while maintaining discretion and professionalism.</p>\n<p><strong>Key Responsibilities:</strong></p>\n<ul style=\"\">\n<li style=\"\"><strong>Calendar &amp; Schedule Management:</strong> Handle complex scheduling across multiple time zones, anticipate conflicts, and adjust priorities as needed.</li>\n<li style=\"\"><strong>Email &amp; Communication Management:</strong> Monitor and manage email correspondence, draft responses, and ensure timely follow-ups with internal and external stakeholders.</li>\n<li style=\"\"><strong>Project Coordination:</strong> Support executive-led initiatives by tracking deadlines, managing deliverables, and ensuring alignment across teams.</li>\n<li style=\"\"><strong>Travel &amp; Logistics Coordination:</strong> Plan and manage travel itineraries, including flights, accommodations, transportation, and event logistics.</li>\n<li style=\"\"><strong>Document &amp; Data Management:</strong> Prepare reports, presentations, and meeting agendas with accuracy and attention to detail.</li>\n<li style=\"\"><strong>Process Improvement &amp; Automation:</strong> Leverage tools like Notion, Asana, or Zapier to enhance efficiency and optimize workflows.</li>\n<li style=\"\"><strong>Stakeholder &amp; Vendor Coordination:</strong> Act as the main point of contact for vendors, contractors, and external partners, ensuring smooth collaboration.</li>\n<li style=\"\"><strong>Confidential Task Management:</strong> Handle sensitive company and executive matters with the highest level of discretion.</li>\n</ul>\n<p><strong>Qualifications:</strong></p>\n<ul style=\"\">\n<li style=\"\"><strong>Mandatory:</strong> <strong>Minimum of 2+ years of proven experience</strong> as an Executive Assistant, or in a similar high-level executive support role. <strong>Applications without this experience will not be considered.</strong></li>\n<li style=\"\">Proven experience supporting executives, with a strong focus on <strong>email and calendar management</strong> across multiple time zones.</li>\n<li style=\"\">Strong written and verbal communication skills in English, with the ability to draft professional correspondence.</li>\n<li style=\"\">Proficiency in Microsoft Office Suite and Google Workspace.</li>\n<li style=\"\">Tech-savvy with experience using CRM systems (e.g., HubSpot), or project management tools (e.g., Notion, Asana, Monday.com).</li>\n<li style=\"\">Exceptional organizational skills, with a demonstrated ability to prioritize multiple tasks efficiently.</li>\n<li style=\"\">Analytical mindset, capable of problem-solving, process optimization, and improving operational workflows.</li>\n<li style=\"\">Strong ability to work independently, take initiative, and anticipate executive needs.</li>\n</ul>\n<p><strong>Nice to Haves:</strong></p>\n<ul style=\"\">\n<li style=\"\">Familiarity with financial tasks such as invoicing, expense tracking, and budget reporting.</li>\n<li style=\"\">Background in process automation and workflow optimization.</li>\n</ul>\n<p><strong>Only candidates who achieve an 80% or higher score on the assessment will be considered.</strong></p>\n<img src=\"https://remotive.com/job/track/2000194/blank.gif?source=public_api\" alt=\"\"/>","tags":"[\"automation\",\"project management\",\"CRM\",\"asana\",\"executive assistant\",\"hubspot\",\"microsoft office\",\"travel\"]","pubDate":"2025-04-25T18:51:42.000Z","link":"https://remotive.com/remote-jobs/all-others/executive-support-coordinator-2000194","slug":"executive-support-coordinator-sagan-recruitment-639"},{"id":5743949970,"title":"Software Engineer - Infrastructure Team","company":"Discourse","image":"https://remotive.com/job/1989176/logo","description":"<p><em style=\"color: var(--remotive-chocolate);\">Salary depends on location and experience, able to provide up front</em></p>\n<p><em> </em></p>\n<p><em>When you send your resume also send a little intro for us to get to know you, with insight into why you want this job here at Discourse. Tell us about something you've made that you're proud of. Tell us something you think is interesting/cool about Discourse the software.</em></p>\n<p> </p>\n<p> </p>\n<p class=\"h2\">About the job</p>\n<p>The infrastructure team at Discourse are computing-system generalists. In this role, you’ll work across all layers of our tech stack, focusing on building and maintaining systems for our hosting platform.</p>\n<p> </p>\n<p>Discourse is primarily a hosting company, and robust infrastructure is a core competency for us. You’ll develop tools to reduce toil, enhance reliability, and improve performance. Most deployments are served from our own bare metal, with AWS and other cloud services used as necessary.</p>\n<p> </p>\n<p>Applicants will have a 10-40 hour paid trial project (over 2-10 weeks) prior to joining the team. The trial project usually involves adding a feature to Discourse or a Discourse plugin.</p>\n<p> </p>\n<p class=\"h4\">Your responsibilities will include:</p>\n<ul style=\"\">\n<li style=\"\">Applying fundamental computing theory to solve problems in sustainable space and time.</li>\n<li style=\"\">When reasoning about infrastructure improvements, draw upon these combined skills to choose or build the right tool for the job.</li>\n<li style=\"\">While stewarding code along the path from initial development to eventual retirement, support and document the system for the operators who depend on it.</li>\n</ul>\n<p> </p>\n<p class=\"h4\">We’re looking for someone who: </p>\n<ul style=\"\">\n<li style=\"\">Has a well-rounded understanding of how applications interface with the operating system, how the operating system interfaces with the network.</li>\n<li style=\"\">Can read C, and feels at home in Unix-like systems.</li>\n<li style=\"\">Has fluency in at least one high-level programming language. We have a large amount of infrastructure tooling, primarily in Go and Ruby.</li>\n<li style=\"\">Has experience with at least some of tools the we use: PostgreSQL, Docker, HAProxy, Prometheus, Grafana.</li>\n</ul>\n<p> </p>\n<p>At Discourse, the ability to communicate well in writing is paramount. We use our own software, Discourse, for most communication and most of your interaction with customers and team members will be in writing. In order to live these values, we look for folks who are:</p>\n<p> </p>\n<ul style=\"\">\n<li style=\"\">Detail-oriented, proactive, and organized</li>\n<li style=\"\">Able to make decisions quickly and communicate effectively</li>\n<li style=\"\">Work well independently and remotely</li>\n<li style=\"\">Kind to their co-workers</li>\n<li style=\"\">Highly driven with an execution focus and a strong belief in our mission to make the internet a better place</li>\n</ul>\n<p> </p>\n<p class=\"h2\">About our Pay &amp; Benefits</p>\n<p>We believe that high-quality benefits make our team more effective. We’ve been thoughtful about our benefits package which includes a completely flexible schedule, 5 weeks of vacation per year, funding for a co-working stipend, and much more!</p>\n<p> </p>\n<p>Our Salary Framework is location and experience based, and we’re happy to provide a range up front. We also give every employee a stake in the success of the business, regardless of seniority or role. All full-time employees are eligible to receive equity options in the company as part of our equity incentive program.</p>\n<p> </p>\n<p>Lastly, we believe in having a welcoming workplace where people with diverse backgrounds and cultures can create something great together. We encourage you to apply, even if you don’t meet every qualification! Apply to <span style=\"color: var(--remotive-chocolate);\">jobs@discourse.org.</span><span style=\"color: var(--remotive-chocolate);\"> Send your resume and a little intro for us to get to know you, with insight into why you want this job here at Discourse.</span></p>\n<p><span style=\"color: var(--remotive-chocolate);\"> </span></p>\n<p class=\"h2\"><span style=\"color: var(--remotive-chocolate);\">Important location info:</span></p>\n<p><span style=\"color: var(--remotive-chocolate);\">Within Europe, we only hire from:</span></p>\n<p><span style=\"color: var(--remotive-chocolate);\"> </span></p>\n<ul style=\"\">\n<li style=\"\">Austria</li>\n<li style=\"\">Italy</li>\n<li style=\"\">Poland</li>\n<li style=\"\">Portugal</li>\n<li style=\"\">Romania</li>\n<li style=\"\">United Kingdom</li>\n</ul>\n<img src=\"https://remotive.com/job/track/1989176/blank.gif?source=public_api\" alt=\"\"/>","tags":"[\"api\",\"CSS\",\"frontend\",\"html\",\"javascript\",\"postgresql\",\"ruby/rails\",\"open source\",\"Redis\",\"infrastructure\"]","pubDate":"2025-04-25T17:31:12.000Z","link":"https://remotive.com/remote-jobs/software-dev/software-engineer-infrastructure-team-1989176","slug":"software-engineer-infrastructure-team-discourse-9610"},{"id":8024070735,"title":"Quality Assurance Engineer","company":"FlyFlat","image":"https://remotive.com/job/1995779/logo","description":"<p><strong>Quality Assurance Engineer – Web &amp; Mobile Specialist</strong></p>\n<p><strong>(Remote Opportunity)</strong></p>\n<p><strong> </strong></p>\n<p><strong>Company Overview:</strong></p>\n<p>FlyFlat has achieved remarkable growth, expanding by over 300% year-over-year through word of mouth alone. Now operating at a $20M run rate with $2M recently raised in capital, we’re on a mission to reach $30M+ by the end of 2025 and become the go-to solution for luxury international travel management for the world’s leading business owners and investors. As we continue to scale, we are seeking a dedicated Quality Assurance Engineer to uphold and advance the user experience across our web and mobile platforms</p>\n<p><strong> </strong></p>\n<p><strong>Introduction:</strong></p>\n<p>As a Quality Assurance Engineer at FlyFlat, you'll be the guardian of our product quality. You'll work across all departments—engineering, product, design, growth, and support to implement comprehensive testing strategies that maintain the high standards our customers expect. Your attention to detail and commitment to excellence will be critical in supporting our continued rapid growth<strong>.</strong></p>\n<p><strong>Responsibilities:</strong></p>\n<p><strong>End-to-End Testing &amp; Quality Management</strong></p>\n<ul style=\"\">\n<li style=\"\">Conduct thorough testing of new features and existing product functionality across web and mobile platforms.</li>\n<li style=\"\">Perform functional, API, integration, and compatibility testing with a focus on real-world customer scenarios.</li>\n<li style=\"\">Create and maintain test plans, test cases, and test documentation to ensure comprehensive coverage.</li>\n</ul>\n<p><strong>Cross-Department Collaboration</strong></p>\n<ul style=\"\">\n<li style=\"\">Partner with engineering, product, design, growth, and support teams to integrate quality assurance into every phase of the product lifecycle.</li>\n<li style=\"\">Advocate for the end-user experience and ensure that product releases meet FlyFlat’s high standards<strong>.</strong></li>\n</ul>\n<p><strong>Automation &amp; Continuous Improvement</strong></p>\n<ul style=\"\">\n<li style=\"\">Where possible, leverage test automation frameworks and tools to streamline QA processes.</li>\n<li style=\"\">Track and report on quality metrics to identify areas for continuous improvement.</li>\n<li style=\"\">Contribute to the development and refinement of QA best practices and standards<strong>.</strong></li>\n</ul>\n<p><strong>Process Integration &amp; Agile Participation</strong></p>\n<ul style=\"\">\n<li style=\"\">Participate in Agile ceremonies, including sprint planning, reviews, and retrospectives.</li>\n<li style=\"\">Support the integration of QA processes into CI/CD pipelines and DevOps workflows.</li>\n</ul>\n<p><strong> </strong></p>\n<p><strong>Required Skills &amp; Experience:</strong></p>\n<ul style=\"\">\n<li style=\"\">2+ years of experience in quality assurance for web and mobile applications.</li>\n<li style=\"\">Proficiency in manual testing, including test plan creation and execution.</li>\n<li style=\"\">Experience with API testing and customer-focused scenario testing.</li>\n<li style=\"\">Strong mobile QA experience (iOS and Android), including usability and accessibility.</li>\n<li style=\"\">Familiarity with Agile methodologies and modern software development lifecycles.</li>\n<li style=\"\">Exceptional attention to detail, debugging, and troubleshooting abilities.</li>\n<li style=\"\">Strong written and verbal communication skills.</li>\n</ul>\n<p><strong>Preferred Skills &amp; Experience:</strong></p>\n<ul style=\"\">\n<li style=\"\">Experience with test automation tools and frameworks.</li>\n<li style=\"\">Basic coding skills to support automation efforts.</li>\n<li style=\"\">Knowledge of CI/CD processes and DevOps practices.</li>\n<li style=\"\">Cross-browser testing expertise.</li>\n<li style=\"\">Background or interest in the travel industry.</li>\n</ul>\n<p><strong> </strong></p>\n<p><strong>Conclusion: </strong></p>\n<p>This is a pivotal opportunity for a detail-oriented QA professional to help shape the quality assurance function of a rapidly scaling company. As FlyFlat continues its impressive growth, your expertise will ensure that our web and mobile platforms deliver seamless, high-quality experiences for our discerning customer base. Join a fast-moving, collaborative team where your contributions directly impact product excellence and customer satisfaction.</p>\n<p><strong> </strong></p>\n<p><strong>Compensation and Employment Details:</strong></p>\n<ul style=\"\">\n<li style=\"\">$1500 - $2000 per month</li>\n<li style=\"\">Work on meaningful problems in a fast-growing industry.</li>\n<li style=\"\">Collaborate with a lean, high-performing team that values innovation and execution.</li>\n<li style=\"\">Contribute to a proven product with strong organic growth.</li>\n</ul>\n<p><strong>We are excited about the possibility of you joining us in this venture and look forward to seeing the profound impact you will have on our organization.</strong></p><img src=\"https://remotive.com/job/track/1995779/blank.gif?source=public_api\" alt=\"\"/>","tags":"[\"agile\"]","pubDate":"2025-04-25T00:50:32.000Z","link":"https://remotive.com/remote-jobs/qa/quality-assurance-engineer-1995779","slug":"quality-assurance-engineer-flyflat-9176"}]