[{"id":9874386316,"title":"Business Operations Manager - Cashalo/Empower","company":"Empower","image":"https://lever-client-logos.s3.us-west-2.amazonaws.com/2e1a369c-b58f-41ac-8d86-4b0a77695e68-1687915522032.png","description":"<p style=\"min-height:1.5em\"><strong>EMPOWER OVERVIEW</strong></p><p style=\"min-height:1.5em\"><a target=\"_blank\" rel=\"noopener noreferrer nofollow\" href=\"http://empower.me/\">Empower</a> is shaking up an outdated financial system by providing real opportunity for our customers: the opportunity to get the cash they need, to access fair credit, and to change their financial story. Today, we’re helping millions of people find financial security through machine learning models that evaluate creditworthiness using a more inclusive lens and mobile-first products: Cash Advance, Thrive line of credit, and Petal credit cards. Tomorrow? Creating even more financial paths for our customers (and their wallets) to succeed.</p><p style=\"min-height:1.5em\">This year, Empower ranked #65 on Inc. 5000’s Fastest-Growing Private Companies list — our third year in a row cracking the top 100 — and was named by Forbes as one of the 25 Next Billion-Dollar Startups for 2024. Empower was also featured by Forbes on America’s Best Startup Employers list in 2023, and our Thrive line of credit product was named by Fast Company as one of 2022’s Next Big Things in Tech.</p><p style=\"min-height:1.5em\">Empower is backed by Sequoia Capital, Blisce, and Icon Ventures. Ready to grow your impact and accelerate your career? Take a look at our open roles — we can’t wait to meet you.</p><p style=\"min-height:1.5em\"></p><p style=\"min-height:1.5em\"><strong>THE EMPOWER WAY</strong></p><p style=\"min-height:1.5em\"><strong>Great Expectations</strong>: We come up with bold, audacious goals for ourselves and go all out for impact</p><p style=\"min-height:1.5em\"><strong>Owner Mindset</strong>: We give every employee latitude to act independently, make smart choices, and move the business forward</p><p style=\"min-height:1.5em\"><strong>Spirited Debate</strong>: We love skeptics and seek counter opinions to challenge our personal assumptions and expand our view</p><p style=\"min-height:1.5em\"><strong>Customer Obsession:</strong> We listen to understand, empathize, and create a memorable, rewarding experience for our community</p><p style=\"min-height:1.5em\"><strong>Inclusive Collaboration</strong>: We believe diverse teams make the best decisions, and we strive to give diverse voices a seat at the table</p><p style=\"min-height:1.5em\"><strong>No Jerks Allowed</strong>: We value our relationships and take the time to build trust and connection and communicate respectfully</p><p style=\"min-height:1.5em\"></p><p style=\"min-height:1.5em\"><strong>WHAT EMPOWER OFFERS</strong></p><p style=\"min-height:1.5em\">Competitive salary</p><p style=\"min-height:1.5em\">Generous equity package</p><p style=\"min-height:1.5em\">Full healthcare benefits</p><p style=\"min-height:1.5em\">Technology expense reimbursement</p><p style=\"min-height:1.5em\">Virtual first environment</p><p style=\"min-height:1.5em\"><strong>Cashalo</strong>, an Empower company and leading lending fintech in the Philippines, is seeking a Business Operations Manager to build out Empower’s analytical capabilities, identify opportunities to improve operational efficiency, and share strategic recommendations and data-based insights for products and programs critical to Empower’s growth, customer acquisition, and customer retention in the Philippines. You will partner closely with our leadership team to develop insights and execute impactful programs. Your insights will build the foundation for our scaled success as we bring new products to market and expand access to fair credit in the region.</p><p style=\"min-height:1.5em\">This is a remote role with a preference for individuals in an Asia Pacific time zone (GMT +5-11). Occasional travel will be required for company onsites and market visits (minimum 4-6 times per year).</p><p style=\"min-height:1.5em\"><strong>Key Responsibilities</strong></p><ul style=\"min-height:1.5em\"><li><p style=\"min-height:1.5em\">Build analytical tools: Surface data-based insights through dashboards, automated reporting, and presentations to inform critical decision-making; experience in SQL and Tableau is a strong plus</p></li><li><p style=\"min-height:1.5em\">Establish and monitor KPIs: Monitor day-to-day business, conduct data analysis to identify trends, patterns, and insights that inform business decision-making.</p></li><li><p style=\"min-height:1.5em\">Identify opportunities for automation and process improvement, work with the team to set up processes that allow us to keep scaling.</p></li><li><p style=\"min-height:1.5em\">Set strategic priorities: Partner with different teams to build business cases, refine product pricing, and develop incentive structures for our product.</p></li><li><p style=\"min-height:1.5em\">Wear multiple hats: Embrace the dynamic nature of our team at this exciting stage. Demonstrate versatility by willingly taking on a variety of tasks, contributing to the multifaceted growth of the team and the company.</p></li><li><p style=\"min-height:1.5em\">Lead cross-functional initiatives: Collaborate with cross-functional colleagues in Product, Data Science, Marketing, and Engineering.</p></li></ul><p style=\"min-height:1.5em\"><strong>Candidate Qualifications</strong></p><ul style=\"min-height:1.5em\"><li><p style=\"min-height:1.5em\">Based in an Asia Pacific time zone (GMT +5-11)</p></li><li><p style=\"min-height:1.5em\">Willingness to travel 1-2 times per quarter to Manila, and to company-wide onsites up to 2 times per year</p></li><li><p style=\"min-height:1.5em\">Minimum of 2+ years work experience in management consulting, startup operations, strategic finance, and/or investment banking</p></li><li><p style=\"min-height:1.5em\">Strong analytical abilities and comfort building and working with complex Excel models; SQL and Tableau experience are strongly preferred</p></li><li><p style=\"min-height:1.5em\">A get-it-done mindset; you’re resourceful and happy to roll up your sleeves and be in the weeds</p></li><li><p style=\"min-height:1.5em\">Experience delivering complex, cross-functional operational initiatives</p></li><li><p style=\"min-height:1.5em\">A interest in addressing complicated and impactful product &amp; business problems</p></li><li><p style=\"min-height:1.5em\">Strong strategic thinking, problem solving, and logical structuring abilities</p></li><li><p style=\"min-height:1.5em\">Comfort with ambiguity; the ability to independently lay out and test clear hypotheses, and solve problems without well-defined direction</p></li><li><p style=\"min-height:1.5em\">Excellent verbal and written communication skills</p></li></ul><p style=\"min-height:1.5em\">At Empower, we hire for people that push themselves to understand others and seek out ways to challenge their personal assumptions. Our hope is that by fostering such an environment, we strengthen our business and relationships by putting people first. We are committed to building a diverse, inclusive, and equitable workspace where everyone (regardless of age, education, ethnicity, gender, sexual orientation, or any personal characteristics) feels like they belong. Even if your experience doesn’t exactly match up to our job description, you should feel empowered to apply regardless!</p>","tags":"[\"finance\",\"management\",\"engineering\"]","pubDate":"2025-03-12T04:09:24.334Z","link":"https://jobs.ashbyhq.com/empower%20finance/9321661a-0098-4a3d-84ec-e005d3a792c8","slug":"business-operations-manager-cashalo-empower-empower-3486"},{"id":2041759418,"title":"Senior Specialist, User Acquisition, UX","company":"Airalo","image":"https://lever-client-logos.s3.us-west-2.amazonaws.com/55028a36-609c-479c-9553-d4689ff2dd8c-1669620566663.png","description":"<div><b>About Airalo</b></div><div>Alo! Airalo is the world’s first eSIM store that helps people connect in over 200+ countries and regions across the globe. We are building the next digital service that revolutionizes the telecom industry. We are a travel-tech company and an equal-opportunity environment that values and executes diversity, inclusion, and equity. Our team is spread across 50+ countries and six continents. What glues us together is our commitment to changing the way you connect<span style=\"font-size: 13.3333px\">. </span></div><div><br></div><div><b>About you</b></div><div>We hope that you care deeply about the quality of your work, the intrinsic worth of tasks, and the success of your team. You are self-disciplined and do not require micromanagement in terms of your skillset and work ethic. You do your best to flourish as an individual every day while working hard to foster a collaborative team environment. You believe in the importance of being — and staying — authentic, honest, positive, and kind. You are a good interlocutor with clear and concise communication. You are able to manage multiple projects, have an analytical mind, pay keen attention to detail, and love to get your hands dirty. You are cognizant, tolerant, and welcoming of vulnerabilities and cultural differences.</div><div><br></div><div><b>About the Role</b></div><div><b>Position</b>: Full-time / Employee</div><div><b>Location:</b>&nbsp;Remote-first </div><div><b>Benefits:</b>&nbsp;Health Insurance, work-from-anywhere stipend, annual wellness &amp; learning credits, annual all-expenses-paid company retreat in a gorgeous destination &amp; other benefits</div><div><br></div><div><span style=\"font-size: 11pt;\">As our Senior Specialist, User Acquisition, you will be responsible for implementing and optimizing Airalo’s performance marketing initiatives. You will own paid media execution across Search, Social, Video and Display. We are looking for someone who is an expert in the Google Ads platform and has a track record of delivering business results. </span></div><h3>What will you work on:</h3><li>Developing and executing mobile app and web acquisition campaigns across various&nbsp; marketing channels (Google Ads, META, among others)</li><li>Own measurement and reporting for acquisition campaigns, identifying insights to optimize performance</li><li>Work closely with the data team and regional directors to understand impact and incrementality</li><li>Staying up-to-date with industry trends, especially in travel, and best practices in mobile app acquisition</li><li>Supporting the team in producing testing frameworks for creative assets and optimization</li><li>Contributing to new and creative growth strategies for customer acquisition</li>,<h3>Experience:</h3><li>7+ years of experience managing user acquisition campaigns in performance-driven, competitive verticals</li><li>Deep subject matter expertise in Google Ads (Search, App Campaigns, Performance Max, etc.) and META</li><li>Strong quantitative and analytical capabilities - comfortable with data analysis and able to use data to make recommendations for optimization</li><li>Strong presentation skills and the ability to synthesise their own and other’s thoughts into crisp and effective communications</li><li>Entrepreneurial spirit, able to take risks and put forth new ideas</li><li>Prior experience in the tech, travel, or telecommunications industry is a plus</li><li>Experience navigating data platforms such as Looker, Adjust, Google Big Query is a plus</li><div>#EMEA</div><div><br></div><div>We sincerely thank all applicants in advance for submitting their interest in this opportunity. Airalo is an equal opportunity employer and values diversity, equity &amp; inclusion. We do not discriminate on the basis of race, religion, national origin, gender, sexual orientation, age, marital status, veteran status, or disability status. We are committed to providing reasonable accommodations upon request for individuals with disabilities throughout our job interview process.</div>","tags":"[\"management\"]","pubDate":"2025-03-11T21:32:30.470Z","link":"https://jobs.lever.co/airalo/836cf3be-bf67-4fe8-82a4-31e96657414c","slug":"senior-specialist-user-acquisition-ux-airalo-5151"},{"id":7045322466,"title":"Senior Operations Analyst","company":"Empower","image":"https://lever-client-logos.s3.us-west-2.amazonaws.com/2e1a369c-b58f-41ac-8d86-4b0a77695e68-1687915522032.png","description":"<p style=\"min-height:1.5em\"><strong>EMPOWER OVERVIEW</strong></p><p style=\"min-height:1.5em\"><a target=\"_blank\" rel=\"noopener noreferrer nofollow\" href=\"http://empower.me/\">Empower</a> is shaking up an outdated financial system by providing real opportunity for our customers: the opportunity to get the cash they need, to access fair credit, and to change their financial story. Today, we’re helping millions of people find financial security through machine learning models that evaluate creditworthiness using a more inclusive lens and mobile-first products: Cash Advance, Thrive line of credit, and Petal credit cards. Tomorrow? Creating even more financial paths for our customers (and their wallets) to succeed.</p><p style=\"min-height:1.5em\">This year, Empower ranked #65 on Inc. 5000’s Fastest-Growing Private Companies list — our third year in a row cracking the top 100 — and was named by Forbes as one of the 25 Next Billion-Dollar Startups for 2024. Empower was also featured by Forbes on America’s Best Startup Employers list in 2023, and our Thrive line of credit product was named by Fast Company as one of 2022’s Next Big Things in Tech.</p><p style=\"min-height:1.5em\">Empower is backed by Sequoia Capital, Blisce, and Icon Ventures. Ready to grow your impact and accelerate your career? Take a look at our open roles — we can’t wait to meet you.</p><p style=\"min-height:1.5em\"></p><p style=\"min-height:1.5em\"><strong>THE EMPOWER WAY</strong></p><p style=\"min-height:1.5em\"><strong>Great Expectations</strong>: We come up with bold, audacious goals for ourselves and go all out for impact</p><p style=\"min-height:1.5em\"><strong>Owner Mindset</strong>: We give every employee latitude to act independently, make smart choices, and move the business forward</p><p style=\"min-height:1.5em\"><strong>Spirited Debate</strong>: We love skeptics and seek counter opinions to challenge our personal assumptions and expand our view</p><p style=\"min-height:1.5em\"><strong>Customer Obsession:</strong> We listen to understand, empathize, and create a memorable, rewarding experience for our community</p><p style=\"min-height:1.5em\"><strong>Inclusive Collaboration</strong>: We believe diverse teams make the best decisions, and we strive to give diverse voices a seat at the table</p><p style=\"min-height:1.5em\"><strong>No Jerks Allowed</strong>: We value our relationships and take the time to build trust and connection and communicate respectfully</p><p style=\"min-height:1.5em\"></p><p style=\"min-height:1.5em\"><strong>WHAT EMPOWER OFFERS</strong></p><p style=\"min-height:1.5em\">Competitive salary</p><p style=\"min-height:1.5em\">Generous equity package</p><p style=\"min-height:1.5em\">Full healthcare benefits</p><p style=\"min-height:1.5em\">Technology expense reimbursement</p><p style=\"min-height:1.5em\">Virtual first environment</p><p style=\"min-height:1.5em\"></p><h2><strong>JOB DESCRIPTION</strong></h2><p style=\"min-height:1.5em\">As an Operations Analyst, you will play a critical role in safeguarding our platform by reviewing potential fraud cases, performing enhanced due diligence reviews, and analyzing and responding to credit report disputes. Your responsibilities will include analyzing suspicious account activity, reviewing user-submitted documentation for inconsistencies, handling user communications via email, ensuring the highest level of credit reporting accuracy, and mitigating fraud risks. You will also collaborate with cross-functional teams to contain and remediate open issues and mitigate risk.</p><p style=\"min-height:1.5em\">This role requires strong analytical skills, attention to detail, and the ability to manage sensitive user interactions with professionalism and discretion.</p><p style=\"min-height:1.5em\">Travel for company offsites is expected at least 2 times per year.</p><p style=\"min-height:1.5em\"></p><h2><strong>RESPONSIBILITIES</strong></h2><ul style=\"min-height:1.5em\"><li><p style=\"min-height:1.5em\">User Communication &amp; Case Handling</p><ul style=\"min-height:1.5em\"><li><p style=\"min-height:1.5em\">Engage with users exclusively via email to address fraud-related inquiries and case reviews.</p></li><li><p style=\"min-height:1.5em\">Handle de-escalation efforts and provide clear guidance to users under review.</p></li><li><p style=\"min-height:1.5em\">Review and verify user-submitted documentation for authenticity and inconsistencies.</p></li></ul></li><li><p style=\"min-height:1.5em\">Fraud Investigation &amp; Risk Mitigation</p><ul style=\"min-height:1.5em\"><li><p style=\"min-height:1.5em\">Analyze account activity and transaction patterns to identify abnormalities.</p></li><li><p style=\"min-height:1.5em\">Monitor and investigate fraud alerts from transaction monitoring systems.</p></li><li><p style=\"min-height:1.5em\">Conduct in-depth investigations into high-risk disputes and fraudulent activities.</p></li><li><p style=\"min-height:1.5em\">Document and maintain fraud databases to track cases, trends, and emerging fraud risks.</p></li></ul></li><li><p style=\"min-height:1.5em\">Regulatory Compliance &amp; Reporting</p><ul style=\"min-height:1.5em\"><li><p style=\"min-height:1.5em\">Research and respond to credit report disputes while meeting tight regulatory deadlines</p></li><li><p style=\"min-height:1.5em\">Escalate complex or high-risk fraud cases for further investigation.</p></li><li><p style=\"min-height:1.5em\">Collaborate with internal teams and external partners to enhance fraud detection and prevention strategies.</p></li></ul></li></ul><p style=\"min-height:1.5em\"></p><h2><strong>QUALIFICATIONS</strong></h2><ul style=\"min-height:1.5em\"><li><p style=\"min-height:1.5em\">BA/BS degree or equivalent practical work experience in fraud prevention or financial crimes.</p></li><li><p style=\"min-height:1.5em\">4+ years of experience in banking, financial fraud, or abuse investigations.</p></li><li><p style=\"min-height:1.5em\">3+ years of direct customer interaction experience, with a focus on fraud case management.</p></li><li><p style=\"min-height:1.5em\">Strong analytical skills and ability to interpret large datasets to detect fraud patterns.</p></li><li><p style=\"min-height:1.5em\">Previous experience in fraud operations, risk analysis, or compliance investigations.</p></li><li><p style=\"min-height:1.5em\">Proven ability to assess risk critically and maintain a healthy level of skepticism when handling suspicious cases.</p></li><li><p style=\"min-height:1.5em\">Ability to work both independently and collaboratively in a fast-paced production environment.</p></li></ul><p style=\"min-height:1.5em\"></p><p style=\"min-height:1.5em\">At Empower, we hire for people that push themselves to understand others and seek out ways to challenge their personal assumptions. Our hope is that by fostering such an environment, we strengthen our business and relationships by putting people first. We are committed to building a diverse, inclusive, and equitable workspace where everyone (regardless of age, education, ethnicity, gender, sexual orientation, or any personal characteristics) feels like they belong. Even if your experience doesn’t exactly match up to our job description, you should feel empowered to apply regardless!</p>","tags":"[\"management\",\"database\"]","pubDate":"2025-03-11T20:18:53.290Z","link":"https://jobs.ashbyhq.com/empower%20finance/61580535-9770-4318-9237-f919117d9774","slug":"senior-operations-analyst-empower-8446"},{"id":4125510639,"title":"Finance and Strategy Manager","company":"Empower","image":"https://lever-client-logos.s3.us-west-2.amazonaws.com/2e1a369c-b58f-41ac-8d86-4b0a77695e68-1687915522032.png","description":"<p style=\"min-height:1.5em\"><strong>EMPOWER OVERVIEW</strong></p><p style=\"min-height:1.5em\"><a target=\"_blank\" rel=\"noopener noreferrer nofollow\" href=\"http://empower.me/\">Empower</a> is shaking up an outdated financial system by providing real opportunity for our customers: the opportunity to get the cash they need, to access fair credit, and to change their financial story. Today, we’re helping millions of people find financial security through machine learning models that evaluate creditworthiness using a more inclusive lens and mobile-first products: Cash Advance, Thrive line of credit, and Petal credit cards. Tomorrow? Creating even more financial paths for our customers (and their wallets) to succeed.</p><p style=\"min-height:1.5em\">This year, Empower ranked #65 on Inc. 5000’s Fastest-Growing Private Companies list — our third year in a row cracking the top 100 — and was named by Forbes as one of the 25 Next Billion-Dollar Startups for 2024. Empower was also featured by Forbes on America’s Best Startup Employers list in 2023, and our Thrive line of credit product was named by Fast Company as one of 2022’s Next Big Things in Tech.</p><p style=\"min-height:1.5em\">Empower is backed by Sequoia Capital, Blisce, and Icon Ventures. Ready to grow your impact and accelerate your career? Take a look at our open roles — we can’t wait to meet you.</p><p style=\"min-height:1.5em\"></p><p style=\"min-height:1.5em\"><strong>THE EMPOWER WAY</strong></p><p style=\"min-height:1.5em\"><strong>Great Expectations</strong>: We come up with bold, audacious goals for ourselves and go all out for impact</p><p style=\"min-height:1.5em\"><strong>Owner Mindset</strong>: We give every employee latitude to act independently, make smart choices, and move the business forward</p><p style=\"min-height:1.5em\"><strong>Spirited Debate</strong>: We love skeptics and seek counter opinions to challenge our personal assumptions and expand our view</p><p style=\"min-height:1.5em\"><strong>Customer Obsession:</strong> We listen to understand, empathize, and create a memorable, rewarding experience for our community</p><p style=\"min-height:1.5em\"><strong>Inclusive Collaboration</strong>: We believe diverse teams make the best decisions, and we strive to give diverse voices a seat at the table</p><p style=\"min-height:1.5em\"><strong>No Jerks Allowed</strong>: We value our relationships and take the time to build trust and connection and communicate respectfully</p><p style=\"min-height:1.5em\"></p><p style=\"min-height:1.5em\"><strong>WHAT EMPOWER OFFERS</strong></p><p style=\"min-height:1.5em\">Competitive salary</p><p style=\"min-height:1.5em\">Generous equity package</p><p style=\"min-height:1.5em\">Full healthcare benefits</p><p style=\"min-height:1.5em\">Technology expense reimbursement</p><p style=\"min-height:1.5em\">Virtual first environment</p><p style=\"min-height:1.5em\"></p><p style=\"min-height:1.5em\"><strong>JOB DESCRIPTION</strong></p><p style=\"min-height:1.5em\">The Finance and Strategy Manager will help build out Empower’s analytical capabilities and business planning, and share strategic recommendations and data-based insights for products and programs critical to our growth, customer acquisition, and customer retention. You will partner closely with our Executive leadership team and Board to develop and present insights. Your insights will build the foundation for Empower’s scaled success as we bring new products to market and scale programs impactful to our core business.</p><p style=\"min-height:1.5em\">Travel for company offsites is expected at least 2 times per year.</p><p style=\"min-height:1.5em\"></p><p style=\"min-height:1.5em\"><strong>RESPONSIBILITIES</strong></p><ul style=\"min-height:1.5em\"><li><p style=\"min-height:1.5em\">Build analytical tools: Surface data-based insights through dashboards, automated reporting, and presentations that give our internal stakeholders information critical to make decisions. Drive improvements to our data analysis infrastructure and processes. </p></li><li><p style=\"min-height:1.5em\">Quarterback planning: Collaborate with operating teams and the Finance team to run annual planning and quarterly team planning processes, ensuring that the right initiatives are pursued and we are resource-allocated appropriately across our various bets.</p></li><li><p style=\"min-height:1.5em\">Set strategic priorities: Conduct market research, competitive analysis, and data analyses to inform strategic priorities for Empower.</p></li><li><p style=\"min-height:1.5em\">Represent finance in cross-functional teams: Partner with Credit, Product, and Marketing teams to build business cases, and conduct unit economics and tradeoff analyses to inform operational decision-making.</p></li><li><p style=\"min-height:1.5em\">Drive product positioning: Leverage customer data to inform product positioning and optimize our scaling efforts. Lead complex analyses on our products, develop case studies, and design experiments to improve product performance.</p></li><li><p style=\"min-height:1.5em\">Lead cross-functional initiatives: Collaborate with cross-functional colleagues in Product, Data Science, Marketing, and Engineering.</p></li></ul><p style=\"min-height:1.5em\"></p><p style=\"min-height:1.5em\"><strong>QUALIFICATIONS</strong></p><ul style=\"min-height:1.5em\"><li><p style=\"min-height:1.5em\">​​Minimum of 4+ years of work experience in strategic finance, bizops, management consulting, or investment banking</p></li><li><p style=\"min-height:1.5em\">Strong analytical skills; ability to consistently define and measure goals </p></li><li><p style=\"min-height:1.5em\">Strong customer empathy, with experience shaping product direction and execution based on customer needs</p></li><li><p style=\"min-height:1.5em\">Strong financial modeling and unit economics modeling experience</p></li><li><p style=\"min-height:1.5em\">Comfortable with SQL</p></li><li><p style=\"min-height:1.5em\">A get-it-done mindset - you’re resourceful and enjoy being hands-on and in the weeds</p></li><li><p style=\"min-height:1.5em\">Interested in addressing complicated and impactful product &amp; business problems</p></li><li><p style=\"min-height:1.5em\">Experience delivering complex, cross-functional product initiatives </p></li><li><p style=\"min-height:1.5em\">Strong strategic thinking, problem-solving, and logical structuring skills</p></li><li><p style=\"min-height:1.5em\">Comfortable with ambiguity; able to independently lay out and test clear hypotheses, and solve problems without well-defined direction</p></li><li><p style=\"min-height:1.5em\">Excellent verbal and written communication skills</p></li></ul><p style=\"min-height:1.5em\">At Empower, we hire for people that push themselves to understand others and seek out ways to challenge their personal assumptions. Our hope is that by fostering such an environment, we strengthen our business and relationships by putting people first. We are committed to building a diverse, inclusive, and equitable workspace where everyone (regardless of age, education, ethnicity, gender, sexual orientation, or any personal characteristics) feels like they belong. Even if your experience doesn’t exactly match up to our job description, you should feel empowered to apply regardless!</p>","tags":"[\"finance\",\"management\",\"engineering\"]","pubDate":"2025-03-11T20:09:08.530Z","link":"https://jobs.ashbyhq.com/empower%20finance/bcdd237d-7c67-42b4-af38-616259e8a00b","slug":"finance-and-strategy-manager-empower-1097"},{"id":8168658984,"title":"Executive Assistant","company":"Coalesce","image":"https://avatars.githubusercontent.com/u/114246237?s=200&v=4","description":"<p style=\"min-height:1.5em\">The Executive Assistant will play a key role in supporting the CEO and executive leadership team. With approximately 5 years of experience, the ideal candidate will demonstrate strong organizational skills, attention to detail, and a proactive mindset. This person will handle a variety of tasks ranging from administrative duties to more complex project management, ensuring smooth operations and efficient execution of company priorities.</p><p style=\"min-height:1.5em\"><strong>Key Responsibilities:</strong></p><ul style=\"min-height:1.5em\"><li><p style=\"min-height:1.5em\"><strong>Executive Support:</strong> Provide high-level administrative support to the CEO and executive team, including managing schedules, coordinating meetings, and handling correspondence.</p></li><li><p style=\"min-height:1.5em\"><strong>Calendar Management:</strong> Effectively manage and prioritize calendars, ensuring alignment with executive priorities, and handle any scheduling conflicts.</p></li><li><p style=\"min-height:1.5em\"><strong>Communication:</strong> Serve as a liaison between the executive team and internal/external stakeholders, maintaining clear communication and professionalism at all times.</p></li><li><p style=\"min-height:1.5em\"><strong>Travel Coordination:</strong> Organize travel arrangements including flights, accommodations, itineraries, and transportation for executives.</p></li><li><p style=\"min-height:1.5em\"><strong>Document Management:</strong> Prepare and edit reports, presentations, and other documents as needed. Ensure documents are accurate, complete, and delivered in a timely manner.</p></li><li><p style=\"min-height:1.5em\"><strong>Project Management:</strong> Assist with the coordination and management of various projects, including tracking deadlines, organizing resources, and ensuring project milestones are met.</p></li><li><p style=\"min-height:1.5em\"><strong>Confidentiality &amp; Discretion:</strong> Handle sensitive and confidential information with the utmost discretion and integrity.</p></li><li><p style=\"min-height:1.5em\"><strong>Office Coordination:</strong> Oversee day-to-day office operations, ensuring that executives have the necessary tools and resources to succeed.</p></li></ul><p style=\"min-height:1.5em\"><strong>Qualifications:</strong></p><ul style=\"min-height:1.5em\"><li><p style=\"min-height:1.5em\">Minimum of 5 years of experience as an Executive Assistant or similar role supporting senior leadership.</p></li><li><p style=\"min-height:1.5em\">Exceptional organizational skills with the ability to multitask and prioritize effectively in a fast-paced environment.</p></li><li><p style=\"min-height:1.5em\">Strong written and verbal communication skills, with the ability to interact with stakeholders at all levels.</p></li><li><p style=\"min-height:1.5em\">Advanced proficiency in Microsoft Office Suite (Word, Excel, PowerPoint, Outlook) and familiarity with project management tools.</p></li><li><p style=\"min-height:1.5em\">Strong attention to detail and ability to maintain a high level of accuracy in all tasks.</p></li><li><p style=\"min-height:1.5em\">Proven ability to handle confidential information with discretion and professionalism.</p></li><li><p style=\"min-height:1.5em\">Ability to work independently, as well as collaboratively in a team setting.</p></li><li><p style=\"min-height:1.5em\">Excellent problem-solving skills and a proactive approach to addressing challenges.</p></li><li><p style=\"min-height:1.5em\">A positive, professional attitude with the ability to remain calm under pressure.</p></li></ul><p style=\"min-height:1.5em\"><strong>Preferred:</strong></p><ul style=\"min-height:1.5em\"><li><p style=\"min-height:1.5em\">Bachelor's degree or equivalent experience in a related field.</p></li></ul><p style=\"min-height:1.5em\">Since founding Coalesce in 2020, our mission has remained the same: to improve the lives of data professionals by helping them transform data as efficiently as possible. We aim to bring an end to the days of arduous manual coding and inflexible GUIs by providing a best of both worlds solution. </p><p style=\"min-height:1.5em\"></p><p style=\"min-height:1.5em\">Coalesce is a fully remote and culture-first company. We believe that our culture is what allows us to not only recruit world-class talent, but also retain it. At Coalesce, you can expect to experience radical honesty, trust in the workplace empathy for yourself and others, and support for continuous learning and improvement.</p><p style=\"min-height:1.5em\"></p><p style=\"min-height:1.5em\"><em>US Benefits: Coalesce offers the following benefits for this position, subject to applicable eligibility requirements: Medical insurance; Dental insurance; Vision insurance; Life, AD&amp;D, and Disability Insurance; Unlimited Paid Time off, Paid Sick Time, Equity, Internet Reimbursement, WFH Office Set-Up Reimbursement, 401(k) retirement plan, and Company Annual Leave between December 26- January 2. </em></p>","tags":"[\"management\"]","pubDate":"2025-03-11T19:09:08.934Z","link":"https://jobs.ashbyhq.com/coalesce/e4915ff2-1e61-4549-8239-d5000b36d355","slug":"executive-assistant-coalesce-7211"},{"id":2288826414,"title":"Director of Marketing","company":"Kit","image":"https://avatars.githubusercontent.com/u/10557747?s=200&v=4","description":"&lt;div class=&quot;content-intro&quot;&gt;&lt;h4&gt;Description&lt;/h4&gt;\n&lt;div&gt;\n&lt;p class=&quot;p1&quot;&gt;Kit is an email-first operating system for creators who mean business. We help creators grow and monetize their audience with ease. For coaches, YouTubers, authors, podcasters, and other creatives, there isn’t a better marketing hub to rely on to grow audiences, automate email marketing, and sell digital products - all within one platform. More importantly, there isn’t a team more committed to helping creators earn a living.&lt;/p&gt;\n&lt;p&gt;We’re on a mission to help creators earn $1 billion using our creator marketing platform. We have always been 100% independent and 100% remote. We are proud to have built a product that our customers love, and we look for people who have enthusiasm and belief in our mission, vision, and values to join our team.&lt;/p&gt;\n&lt;p&gt;The Kit culture is one where emotional intelligence is valued, radical candor is encouraged, and where everyone works together to uphold a set of shared team principles.&lt;/p&gt;\n&lt;hr&gt;\n&lt;p&gt;&amp;nbsp;&lt;/p&gt;\n&lt;/div&gt;&lt;/div&gt;&lt;h3&gt;&lt;strong&gt;The Role&lt;/strong&gt;&lt;/h3&gt;\n&lt;p&gt;We believe the creator economy is powered by genuine value creation. As our Director of Marketing, you&#39;ll help creators build more valuable businesses by positioning our product strategically in the market, growing our pipeline of Scaling Creators, driving upgrades to &lt;a href=&quot;https://kit.com/pricing?campaignid=22138362407&amp;amp;adgroupid=174435131180&amp;amp;device=c&amp;amp;placement=&amp;amp;network=g&amp;amp;utm_source=google&amp;amp;utm_medium=ad&amp;amp;utm_content=729503800786&amp;amp;utm_term=kit%20pricing&amp;amp;utm_campaign=kit-brand-price-2025&amp;amp;hsa_acc=4935923627&amp;amp;hsa_cam=22138362407&amp;amp;hsa_grp=174435131180&amp;amp;hsa_ad=729503800786&amp;amp;hsa_src=g&amp;amp;hsa_tgt=kwd-362661285101&amp;amp;hsa_kw=kit%20pricing&amp;amp;hsa_mt=b&amp;amp;hsa_net=adwords&amp;amp;hsa_ver=3&amp;amp;gad_source=1&amp;amp;gclid=CjwKCAiArKW-BhAzEiwAZhWsIFqmMuzbvNIm9iP0CqjISx-R4quvW_Fs0qp3p2KOr0CXV41ZPr0-2hoC71IQAvD_BwE&quot;&gt;paid plans&lt;/a&gt;, and enabling our sales team to win Star Creators (think Tom Brady or Matthew McConaughey who are both customers).&lt;/p&gt;\n&lt;p&gt;You won’t be alone in these efforts.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;The Team&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;You will work as a strategist (40%), coach (40%), and player (20%). You’ll lead an 8-person team that is seeking clear direction and coaching to hit revenue targets and reach their potential. The team is made-up of an SEO Manager, Affiliate Marketing Manager, Lifecycle Marketer, 2 Product Marketing Managers, Sr Content Marketing Manager, Creator Educator, and a Social Media Manager.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Your Support System&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;You’ll report into our CRO, &lt;a href=&quot;https://www.linkedin.com/in/davealtarescu/&quot;&gt;Dave Altarescu&lt;/a&gt;, who’s a marketer himself and is ready to be a thought partner. He’s been managing the team while we search for a new leader. You’ll also have a rockstar partner in our Creative Director, &lt;a href=&quot;https://www.linkedin.com/in/charliprangley/&quot;&gt;Charli Prangley&lt;/a&gt;, who leads our brand designers, senior writer, and video creator. You’ll work closely with other cross-functional partners on our sales and migrations, customer growth, and customer experience teams.&lt;/p&gt;\n&lt;h3&gt;What You’ll Do&lt;/h3&gt;\n&lt;ul&gt;\n&lt;li&gt;&lt;strong&gt;First Week:&lt;/strong&gt; Dive into our product, customers, and workflows. Take part in Get To Know You’s (GTKYs) to meet our distributed team.&lt;/li&gt;\n&lt;li&gt;&lt;strong&gt;First Month:&lt;/strong&gt; Assess our current state and craft a plan that will set the team up for success. Build and execute a marketing strategy that reaches a professional creator audience, improves onboarding and activation, drives Creator Network adoption, delivers value through our App Store, and hits revenue growth targets.&lt;/li&gt;\n&lt;li&gt;&lt;strong&gt;First Six Months:&lt;/strong&gt; Define, track, and report on top of funnel metrics. Monitor competitor positioning and stay ahead of industry shifts. Form hypotheses, test them, and scale what works. Share insights with stakeholders and partner with cross-functional teams on key initiatives like building a robust sales-led enterprise motion, launching Kit Studios locations, and hosting our signature event, Craft + Commerce.&lt;/li&gt;\n&lt;li&gt;&lt;strong&gt;First Year:&lt;/strong&gt; Elevate our product and lifecycle marketing to new heights. Help us hit new customer MRR goals, reactivation targets, and drive feature adoption. Come to deeply understand our core value that &quot;creator success is our success.”&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;&lt;strong&gt;&lt;/strong&gt;&lt;/p&gt;\n&lt;h3&gt;What Will S.E.T. You Up For Success&lt;/h3&gt;\n&lt;p&gt;&lt;strong&gt;Skills&lt;/strong&gt;&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;Knowing how to build pipeline and leverage lead scoring to understand prospect intent&lt;/li&gt;\n&lt;li&gt;Hands-on expertise in lifecycle marketing, product marketing, and sales enablement — these should be your marketing superpowers&lt;/li&gt;\n&lt;li&gt;SEO knowledge and ideas for evolving with AI&lt;/li&gt;\n&lt;li&gt;Strong analytical mindset, leveraging data to inform marketing strategy and measure impact.&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;&lt;strong&gt;Experiences&lt;/strong&gt;&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;Leading and coaching to a 6-8 person team&lt;/li&gt;\n&lt;li&gt;Working with both product-led growth (PLG) and sales-led revenue motions&lt;/li&gt;\n&lt;li&gt;Contributed to marketing efforts that grew revenue from $50M to $75M ARR.&lt;/li&gt;\n&lt;li&gt;Bonus: Being a creator yourself—we value being “for creators, by creators”&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;&lt;strong&gt;Traits&lt;/strong&gt;&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;You thrive in turnaround environments, knowing the investment in the team and processes lets you make a big impact&lt;/li&gt;\n&lt;li&gt;Your former direct reports would be excited to work with you again&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;&lt;strong&gt;What Won’t Set You Up For Success&lt;/strong&gt;&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;Wanting to build a massive team overnight—we’re a small team with a large surface area.&lt;/li&gt;\n&lt;li&gt;Needing rigid structure—we offer autonomy over systems&lt;/li&gt;\n&lt;li&gt;Expecting a big marketing budget—we’re 100% independent, frugal, and profitable&lt;/li&gt;\n&lt;/ul&gt;\n&lt;h3&gt;Working Hours and Location&lt;/h3&gt;\n&lt;p&gt;We&#39;re 100% remote with team members across the globe. Your working hours align with your local time zone, but team meetings follow U.S. time zones.&lt;/p&gt;\n&lt;h3&gt;Compensation and Benefits&lt;/h3&gt;\n&lt;p&gt;Kit has standardized salaries based on position, no matter where you live. This role is a &lt;strong&gt;manager level 5 ($229,000)&lt;/strong&gt;. Our other perks and benefits include:&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;&lt;a href=&quot;https://www.linkedin.com/posts/nathanbarry_convertkit-compensation-model-activity-6991414959247147008-i9V3/?utm_source=share&amp;amp;utm_medium=member_desktop&quot;&gt;Profit Sharing&lt;/a&gt;&lt;/li&gt;\n&lt;li&gt;Kit equity&lt;/li&gt;\n&lt;li&gt;401k with a 5% match&lt;/li&gt;\n&lt;li&gt;We cover up to $1,950 per month toward medical premiums, with dental and vision fully covered. We offer health insurance plans through Aetna.&lt;/li&gt;\n&lt;li&gt;$4,000 equipment allowance for your first two years, $3,000 every two years after&lt;/li&gt;\n&lt;li&gt;$3,500 annual learning and development budget&lt;/li&gt;\n&lt;li&gt;$3,000 annual childcare benefit&lt;/li&gt;\n&lt;li&gt;20 days paid time off per year&lt;/li&gt;\n&lt;li&gt;Paid paid vacation: $1,000 bonus for taking five consecutive days full unplugged&lt;/li&gt;\n&lt;li&gt;10 paid holidays per year&lt;/li&gt;\n&lt;li&gt;2 weeks of paid sick time each year, including mental health days&lt;/li&gt;\n&lt;li&gt;12 weeks paid parental leave with flexible scheduling&lt;/li&gt;\n&lt;li&gt;Up to 6 weeks of paid bereavement, medical, and disaster leave&lt;/li&gt;\n&lt;li&gt;Winter Break: Kit closes for a week at the end of December to give everyone a collective break to enjoy the holiday season.&amp;nbsp;&lt;em&gt;Essential support services remain available, with teams coordinating to ensure coverage during this period&lt;/em&gt;&lt;/li&gt;\n&lt;li&gt;4 week paid sabbatical after 5 years with the team&lt;/li&gt;\n&lt;li&gt;Fantastic in-person team retreats 2x per year&lt;/li&gt;\n&lt;/ul&gt;\n&lt;h3&gt;Interview Process&lt;/h3&gt;\n&lt;p&gt;We know that most people hate interviewing (we relate!). We aim to make it a positive experience and keep you informed throughout. Here’s what to expect:&lt;/p&gt;\n&lt;ol&gt;\n&lt;li&gt;Phone screen with our recruiter&lt;/li&gt;\n&lt;li&gt;Hiring manager interview&lt;/li&gt;\n&lt;li&gt;Cross-functional group interview&lt;/li&gt;\n&lt;li&gt;Work sample presentation to our executives, plus a conversation with a Board advisor&lt;/li&gt;\n&lt;/ol&gt;\n&lt;p&gt;To get started, complete this application, including answers to the questions below.&amp;nbsp;&lt;strong&gt;We read every application and your responses help us understand your experience beyond the resume.&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&amp;nbsp;&lt;/p&gt;&lt;div class=&quot;content-conclusion&quot;&gt;&lt;hr&gt;\n&lt;p&gt;&amp;nbsp;&lt;/p&gt;\n&lt;p&gt;Kit is an equal opportunity employer. We value diversity in all of its forms, and we hire the best person we can for each role, no matter your personal background. Research tells us that applicants who are female or non-binary, as well as applicants who are people of color, are less likely to apply for roles they do not feel 100% qualified for. If you think you meet more than 50% of our requirements but fewer than 100% of them, please apply. We’re imperfect communicators, so think of our job postings as the starting point for discussion rather than proof that you shouldn’t apply.&lt;/p&gt;\n&lt;p&gt;Kit does not discriminate on the basis of race, sex, color, religion, age, national origin, marital status, disability, veteran status, genetic information, sexual orientation, gender identity or any other reason prohibited by law in provision of employment opportunities and benefits.&lt;/p&gt;&lt;/div&gt;","tags":"[]","pubDate":"2025-03-11T18:38:55.000Z","link":"https://job-boards.greenhouse.io/convertkit/jobs/4674542007","slug":"director-of-marketing-kit-4176"},{"id":7905316891,"title":"Director of Marketing","company":"Kit","image":"https://avatars.githubusercontent.com/u/10557747?s=200&v=4","description":"&lt;div class=&quot;content-intro&quot;&gt;&lt;h4&gt;Description&lt;/h4&gt;\n&lt;div&gt;\n&lt;p class=&quot;p1&quot;&gt;Kit is an email-first operating system for creators who mean business. We help creators grow and monetize their audience with ease. For coaches, YouTubers, authors, podcasters, and other creatives, there isn’t a better marketing hub to rely on to grow audiences, automate email marketing, and sell digital products - all within one platform. More importantly, there isn’t a team more committed to helping creators earn a living.&lt;/p&gt;\n&lt;p&gt;We’re on a mission to help creators earn $1 billion using our creator marketing platform. We have always been 100% independent and 100% remote. We are proud to have built a product that our customers love, and we look for people who have enthusiasm and belief in our mission, vision, and values to join our team.&lt;/p&gt;\n&lt;p&gt;The Kit culture is one where emotional intelligence is valued, radical candor is encouraged, and where everyone works together to uphold a set of shared team principles.&lt;/p&gt;\n&lt;hr&gt;\n&lt;p&gt;&amp;nbsp;&lt;/p&gt;\n&lt;/div&gt;&lt;/div&gt;&lt;h3&gt;&lt;strong&gt;The Role&lt;/strong&gt;&lt;/h3&gt;\n&lt;p&gt;We believe the creator economy is powered by genuine value creation. As our Director of Marketing, you&#39;ll help creators build more valuable businesses by positioning our product strategically in the market, growing our pipeline of Scaling Creators, driving upgrades to &lt;a href=&quot;https://kit.com/pricing?campaignid=22138362407&amp;amp;adgroupid=174435131180&amp;amp;device=c&amp;amp;placement=&amp;amp;network=g&amp;amp;utm_source=google&amp;amp;utm_medium=ad&amp;amp;utm_content=729503800786&amp;amp;utm_term=kit%20pricing&amp;amp;utm_campaign=kit-brand-price-2025&amp;amp;hsa_acc=4935923627&amp;amp;hsa_cam=22138362407&amp;amp;hsa_grp=174435131180&amp;amp;hsa_ad=729503800786&amp;amp;hsa_src=g&amp;amp;hsa_tgt=kwd-362661285101&amp;amp;hsa_kw=kit%20pricing&amp;amp;hsa_mt=b&amp;amp;hsa_net=adwords&amp;amp;hsa_ver=3&amp;amp;gad_source=1&amp;amp;gclid=CjwKCAiArKW-BhAzEiwAZhWsIFqmMuzbvNIm9iP0CqjISx-R4quvW_Fs0qp3p2KOr0CXV41ZPr0-2hoC71IQAvD_BwE&quot;&gt;paid plans&lt;/a&gt;, and enabling our sales team to win Star Creators (think Tom Brady or Matthew McConaughey who are both customers).&lt;/p&gt;\n&lt;p&gt;You won’t be alone in these efforts.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;The Team&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;You will work as a strategist (40%), coach (40%), and player (20%). You’ll lead an 8-person team that is seeking clear direction and coaching to hit revenue targets and reach their potential. The team is made-up of an SEO Manager, Affiliate Marketing Manager, Lifecycle Marketer, 2 Product Marketing Managers, Sr Content Marketing Manager, Creator Educator, and a Social Media Manager.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Your Support System&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;You’ll report into our CRO, &lt;a href=&quot;https://www.linkedin.com/in/davealtarescu/&quot;&gt;Dave Altarescu&lt;/a&gt;, who’s a marketer himself and is ready to be a thought partner. He’s been managing the team while we search for a new leader. You’ll also have a rockstar partner in our Creative Director, &lt;a href=&quot;https://www.linkedin.com/in/charliprangley/&quot;&gt;Charli Prangley&lt;/a&gt;, who leads our brand designers, senior writer, and video creator. You’ll work closely with other cross-functional partners on our sales and migrations, customer growth, and customer experience teams.&lt;/p&gt;\n&lt;h3&gt;What You’ll Do&lt;/h3&gt;\n&lt;ul&gt;\n&lt;li&gt;&lt;strong&gt;First Week:&lt;/strong&gt; Dive into our product, customers, and workflows. Take part in Get To Know You’s (GTKYs) to meet our distributed team.&lt;/li&gt;\n&lt;li&gt;&lt;strong&gt;First Month:&lt;/strong&gt; Assess our current state and craft a plan that will set the team up for success. Build and execute a marketing strategy that reaches a professional creator audience, improves onboarding and activation, drives Creator Network adoption, delivers value through our App Store, and hits revenue growth targets.&lt;/li&gt;\n&lt;li&gt;&lt;strong&gt;First Six Months:&lt;/strong&gt; Define, track, and report on top of funnel metrics. Monitor competitor positioning and stay ahead of industry shifts. Form hypotheses, test them, and scale what works. Share insights with stakeholders and partner with cross-functional teams on key initiatives like building a robust sales-led enterprise motion, launching Kit Studios locations, and hosting our signature event, Craft + Commerce.&lt;/li&gt;\n&lt;li&gt;&lt;strong&gt;First Year:&lt;/strong&gt; Elevate our product and lifecycle marketing to new heights. Help us hit new customer MRR goals, reactivation targets, and drive feature adoption. Come to deeply understand our core value that &quot;creator success is our success.”&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;&lt;strong&gt;&lt;/strong&gt;&lt;/p&gt;\n&lt;h3&gt;What Will S.E.T. You Up For Success&lt;/h3&gt;\n&lt;p&gt;&lt;strong&gt;Skills&lt;/strong&gt;&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;Knowing how to build pipeline and leverage lead scoring to understand prospect intent&lt;/li&gt;\n&lt;li&gt;Hands-on expertise in lifecycle marketing, product marketing, and sales enablement — these should be your marketing superpowers&lt;/li&gt;\n&lt;li&gt;SEO knowledge and ideas for evolving with AI&lt;/li&gt;\n&lt;li&gt;Strong analytical mindset, leveraging data to inform marketing strategy and measure impact.&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;&lt;strong&gt;Experiences&lt;/strong&gt;&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;Leading and coaching to a 6-8 person team&lt;/li&gt;\n&lt;li&gt;Working with both product-led growth (PLG) and sales-led revenue motions&lt;/li&gt;\n&lt;li&gt;Contributed to marketing efforts that grew revenue from $50M to $75M ARR.&lt;/li&gt;\n&lt;li&gt;Bonus: Being a creator yourself—we value being “for creators, by creators”&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;&lt;strong&gt;Traits&lt;/strong&gt;&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;You thrive in turnaround environments, knowing the investment in the team and processes lets you make a big impact&lt;/li&gt;\n&lt;li&gt;Your former direct reports would be excited to work with you again&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;&lt;strong&gt;What Won’t Set You Up For Success&lt;/strong&gt;&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;Wanting to build a massive team overnight—we’re a small team with a large surface area.&lt;/li&gt;\n&lt;li&gt;Needing rigid structure—we offer autonomy over systems&lt;/li&gt;\n&lt;li&gt;Expecting a big marketing budget—we’re 100% independent, frugal, and profitable&lt;/li&gt;\n&lt;/ul&gt;\n&lt;h3&gt;Working Hours and Location&lt;/h3&gt;\n&lt;p&gt;We&#39;re 100% remote with team members across the globe. Your working hours align with your local time zone, but team meetings follow U.S. time zones.&lt;/p&gt;\n&lt;h3&gt;Compensation and Benefits&lt;/h3&gt;\n&lt;p&gt;Kit has standardized salaries based on position, no matter where you live. This role is a &lt;strong&gt;manager level 5 ($229,000)&lt;/strong&gt;. Our other perks and benefits include:&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;&lt;a href=&quot;https://www.linkedin.com/posts/nathanbarry_convertkit-compensation-model-activity-6991414959247147008-i9V3/?utm_source=share&amp;amp;utm_medium=member_desktop&quot;&gt;Profit Sharing&lt;/a&gt;&lt;/li&gt;\n&lt;li&gt;Kit equity&lt;/li&gt;\n&lt;li&gt;401k with a 5% match&lt;/li&gt;\n&lt;li&gt;We cover up to $1,950 per month toward medical premiums, with dental and vision fully covered. We offer health insurance plans through Aetna.&lt;/li&gt;\n&lt;li&gt;$4,000 equipment allowance for your first two years, $3,000 every two years after&lt;/li&gt;\n&lt;li&gt;$3,500 annual learning and development budget&lt;/li&gt;\n&lt;li&gt;$3,000 annual childcare benefit&lt;/li&gt;\n&lt;li&gt;20 days paid time off per year&lt;/li&gt;\n&lt;li&gt;Paid paid vacation: $1,000 bonus for taking five consecutive days full unplugged&lt;/li&gt;\n&lt;li&gt;10 paid holidays per year&lt;/li&gt;\n&lt;li&gt;2 weeks of paid sick time each year, including mental health days&lt;/li&gt;\n&lt;li&gt;12 weeks paid parental leave with flexible scheduling&lt;/li&gt;\n&lt;li&gt;Up to 6 weeks of paid bereavement, medical, and disaster leave&lt;/li&gt;\n&lt;li&gt;Winter Break: Kit closes for a week at the end of December to give everyone a collective break to enjoy the holiday season.&amp;nbsp;&lt;em&gt;Essential support services remain available, with teams coordinating to ensure coverage during this period&lt;/em&gt;&lt;/li&gt;\n&lt;li&gt;4 week paid sabbatical after 5 years with the team&lt;/li&gt;\n&lt;li&gt;Fantastic in-person team retreats 2x per year&lt;/li&gt;\n&lt;/ul&gt;\n&lt;h3&gt;Interview Process&lt;/h3&gt;\n&lt;p&gt;We know that most people hate interviewing (we relate!). We aim to make it a positive experience and keep you informed throughout. Here’s what to expect:&lt;/p&gt;\n&lt;ol&gt;\n&lt;li&gt;Phone screen with our recruiter&lt;/li&gt;\n&lt;li&gt;Hiring manager interview&lt;/li&gt;\n&lt;li&gt;Cross-functional group interview&lt;/li&gt;\n&lt;li&gt;Work sample presentation to our executives, plus a conversation with a Board advisor&lt;/li&gt;\n&lt;/ol&gt;\n&lt;p&gt;To get started, complete this application, including answers to the questions below.&amp;nbsp;&lt;strong&gt;We read every application and your responses help us understand your experience beyond the resume.&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&amp;nbsp;&lt;/p&gt;&lt;div class=&quot;content-conclusion&quot;&gt;&lt;hr&gt;\n&lt;p&gt;&amp;nbsp;&lt;/p&gt;\n&lt;p&gt;Kit is an equal opportunity employer. We value diversity in all of its forms, and we hire the best person we can for each role, no matter your personal background. Research tells us that applicants who are female or non-binary, as well as applicants who are people of color, are less likely to apply for roles they do not feel 100% qualified for. If you think you meet more than 50% of our requirements but fewer than 100% of them, please apply. We’re imperfect communicators, so think of our job postings as the starting point for discussion rather than proof that you shouldn’t apply.&lt;/p&gt;\n&lt;p&gt;Kit does not discriminate on the basis of race, sex, color, religion, age, national origin, marital status, disability, veteran status, genetic information, sexual orientation, gender identity or any other reason prohibited by law in provision of employment opportunities and benefits.&lt;/p&gt;&lt;/div&gt;","tags":"[]","pubDate":"2025-03-11T18:38:47.000Z","link":"https://job-boards.greenhouse.io/convertkit/jobs/4674541007","slug":"director-of-marketing-kit-6638"},{"id":6341755348,"title":"Director of Marketing","company":"Kit","image":"https://avatars.githubusercontent.com/u/10557747?s=200&v=4","description":"&lt;div class=&quot;content-intro&quot;&gt;&lt;h4&gt;Description&lt;/h4&gt;\n&lt;div&gt;\n&lt;p class=&quot;p1&quot;&gt;Kit is an email-first operating system for creators who mean business. We help creators grow and monetize their audience with ease. For coaches, YouTubers, authors, podcasters, and other creatives, there isn’t a better marketing hub to rely on to grow audiences, automate email marketing, and sell digital products - all within one platform. More importantly, there isn’t a team more committed to helping creators earn a living.&lt;/p&gt;\n&lt;p&gt;We’re on a mission to help creators earn $1 billion using our creator marketing platform. We have always been 100% independent and 100% remote. We are proud to have built a product that our customers love, and we look for people who have enthusiasm and belief in our mission, vision, and values to join our team.&lt;/p&gt;\n&lt;p&gt;The Kit culture is one where emotional intelligence is valued, radical candor is encouraged, and where everyone works together to uphold a set of shared team principles.&lt;/p&gt;\n&lt;hr&gt;\n&lt;p&gt;&amp;nbsp;&lt;/p&gt;\n&lt;/div&gt;&lt;/div&gt;&lt;h3&gt;&lt;strong&gt;The Role&lt;/strong&gt;&lt;/h3&gt;\n&lt;p&gt;We believe the creator economy is powered by genuine value creation. As our Director of Marketing, you&#39;ll help creators build more valuable businesses by positioning our product strategically in the market, growing our pipeline of Scaling Creators, driving upgrades to &lt;a href=&quot;https://kit.com/pricing?campaignid=22138362407&amp;amp;adgroupid=174435131180&amp;amp;device=c&amp;amp;placement=&amp;amp;network=g&amp;amp;utm_source=google&amp;amp;utm_medium=ad&amp;amp;utm_content=729503800786&amp;amp;utm_term=kit%20pricing&amp;amp;utm_campaign=kit-brand-price-2025&amp;amp;hsa_acc=4935923627&amp;amp;hsa_cam=22138362407&amp;amp;hsa_grp=174435131180&amp;amp;hsa_ad=729503800786&amp;amp;hsa_src=g&amp;amp;hsa_tgt=kwd-362661285101&amp;amp;hsa_kw=kit%20pricing&amp;amp;hsa_mt=b&amp;amp;hsa_net=adwords&amp;amp;hsa_ver=3&amp;amp;gad_source=1&amp;amp;gclid=CjwKCAiArKW-BhAzEiwAZhWsIFqmMuzbvNIm9iP0CqjISx-R4quvW_Fs0qp3p2KOr0CXV41ZPr0-2hoC71IQAvD_BwE&quot;&gt;paid plans&lt;/a&gt;, and enabling our sales team to win Star Creators (think Tom Brady or Matthew McConaughey who are both customers).&lt;/p&gt;\n&lt;p&gt;You won’t be alone in these efforts.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;The Team&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;You will work as a strategist (40%), coach (40%), and player (20%). You’ll lead an 8-person team that is seeking clear direction and coaching to hit revenue targets and reach their potential. The team is made-up of an SEO Manager, Affiliate Marketing Manager, Lifecycle Marketer, 2 Product Marketing Managers, Sr Content Marketing Manager, Creator Educator, and a Social Media Manager.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Your Support System&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;You’ll report into our CRO, &lt;a href=&quot;https://www.linkedin.com/in/davealtarescu/&quot;&gt;Dave Altarescu&lt;/a&gt;, who’s a marketer himself and is ready to be a thought partner. He’s been managing the team while we search for a new leader. You’ll also have a rockstar partner in our Creative Director, &lt;a href=&quot;https://www.linkedin.com/in/charliprangley/&quot;&gt;Charli Prangley&lt;/a&gt;, who leads our brand designers, senior writer, and video creator. You’ll work closely with other cross-functional partners on our sales and migrations, customer growth, and customer experience teams.&lt;/p&gt;\n&lt;h3&gt;What You’ll Do&lt;/h3&gt;\n&lt;ul&gt;\n&lt;li&gt;&lt;strong&gt;First Week:&lt;/strong&gt; Dive into our product, customers, and workflows. Take part in Get To Know You’s (GTKYs) to meet our distributed team.&lt;/li&gt;\n&lt;li&gt;&lt;strong&gt;First Month:&lt;/strong&gt; Assess our current state and craft a plan that will set the team up for success. Build and execute a marketing strategy that reaches a professional creator audience, improves onboarding and activation, drives Creator Network adoption, delivers value through our App Store, and hits revenue growth targets.&lt;/li&gt;\n&lt;li&gt;&lt;strong&gt;First Six Months:&lt;/strong&gt; Define, track, and report on top of funnel metrics. Monitor competitor positioning and stay ahead of industry shifts. Form hypotheses, test them, and scale what works. Share insights with stakeholders and partner with cross-functional teams on key initiatives like building a robust sales-led enterprise motion, launching Kit Studios locations, and hosting our signature event, Craft + Commerce.&lt;/li&gt;\n&lt;li&gt;&lt;strong&gt;First Year:&lt;/strong&gt; Elevate our product and lifecycle marketing to new heights. Help us hit new customer MRR goals, reactivation targets, and drive feature adoption. Come to deeply understand our core value that &quot;creator success is our success.”&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;&lt;strong&gt;&lt;/strong&gt;&lt;/p&gt;\n&lt;h3&gt;What Will S.E.T. You Up For Success&lt;/h3&gt;\n&lt;p&gt;&lt;strong&gt;Skills&lt;/strong&gt;&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;Knowing how to build pipeline and leverage lead scoring to understand prospect intent&lt;/li&gt;\n&lt;li&gt;Hands-on expertise in lifecycle marketing, product marketing, and sales enablement — these should be your marketing superpowers&lt;/li&gt;\n&lt;li&gt;SEO knowledge and ideas for evolving with AI&lt;/li&gt;\n&lt;li&gt;Strong analytical mindset, leveraging data to inform marketing strategy and measure impact.&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;&lt;strong&gt;Experiences&lt;/strong&gt;&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;Leading and coaching to a 6-8 person team&lt;/li&gt;\n&lt;li&gt;Working with both product-led growth (PLG) and sales-led revenue motions&lt;/li&gt;\n&lt;li&gt;Contributed to marketing efforts that grew revenue from $50M to $75M ARR.&lt;/li&gt;\n&lt;li&gt;Bonus: Being a creator yourself—we value being “for creators, by creators”&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;&lt;strong&gt;Traits&lt;/strong&gt;&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;You thrive in turnaround environments, knowing the investment in the team and processes lets you make a big impact&lt;/li&gt;\n&lt;li&gt;Your former direct reports would be excited to work with you again&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;&lt;strong&gt;What Won’t Set You Up For Success&lt;/strong&gt;&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;Wanting to build a massive team overnight—we’re a small team with a large surface area.&lt;/li&gt;\n&lt;li&gt;Needing rigid structure—we offer autonomy over systems&lt;/li&gt;\n&lt;li&gt;Expecting a big marketing budget—we’re 100% independent, frugal, and profitable&lt;/li&gt;\n&lt;/ul&gt;\n&lt;h3&gt;Working Hours and Location&lt;/h3&gt;\n&lt;p&gt;We&#39;re 100% remote with team members across the globe. Your working hours align with your local time zone, but team meetings follow U.S. time zones.&lt;/p&gt;\n&lt;h3&gt;Compensation and Benefits&lt;/h3&gt;\n&lt;p&gt;Kit has standardized salaries based on position, no matter where you live. This role is a &lt;strong&gt;manager level 5 ($229,000)&lt;/strong&gt;. Our other perks and benefits include:&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;&lt;a href=&quot;https://www.linkedin.com/posts/nathanbarry_convertkit-compensation-model-activity-6991414959247147008-i9V3/?utm_source=share&amp;amp;utm_medium=member_desktop&quot;&gt;Profit Sharing&lt;/a&gt;&lt;/li&gt;\n&lt;li&gt;Kit equity&lt;/li&gt;\n&lt;li&gt;401k with a 5% match&lt;/li&gt;\n&lt;li&gt;We cover up to $1,950 per month toward medical premiums, with dental and vision fully covered. We offer health insurance plans through Aetna.&lt;/li&gt;\n&lt;li&gt;$4,000 equipment allowance for your first two years, $3,000 every two years after&lt;/li&gt;\n&lt;li&gt;$3,500 annual learning and development budget&lt;/li&gt;\n&lt;li&gt;$3,000 annual childcare benefit&lt;/li&gt;\n&lt;li&gt;20 days paid time off per year&lt;/li&gt;\n&lt;li&gt;Paid paid vacation: $1,000 bonus for taking five consecutive days full unplugged&lt;/li&gt;\n&lt;li&gt;10 paid holidays per year&lt;/li&gt;\n&lt;li&gt;2 weeks of paid sick time each year, including mental health days&lt;/li&gt;\n&lt;li&gt;12 weeks paid parental leave with flexible scheduling&lt;/li&gt;\n&lt;li&gt;Up to 6 weeks of paid bereavement, medical, and disaster leave&lt;/li&gt;\n&lt;li&gt;Winter Break: Kit closes for a week at the end of December to give everyone a collective break to enjoy the holiday season.&amp;nbsp;&lt;em&gt;Essential support services remain available, with teams coordinating to ensure coverage during this period&lt;/em&gt;&lt;/li&gt;\n&lt;li&gt;4 week paid sabbatical after 5 years with the team&lt;/li&gt;\n&lt;li&gt;Fantastic in-person team retreats 2x per year&lt;/li&gt;\n&lt;/ul&gt;\n&lt;h3&gt;Interview Process&lt;/h3&gt;\n&lt;p&gt;We know that most people hate interviewing (we relate!). We aim to make it a positive experience and keep you informed throughout. Here’s what to expect:&lt;/p&gt;\n&lt;ol&gt;\n&lt;li&gt;Phone screen with our recruiter&lt;/li&gt;\n&lt;li&gt;Hiring manager interview&lt;/li&gt;\n&lt;li&gt;Cross-functional group interview&lt;/li&gt;\n&lt;li&gt;Work sample presentation to our executives, plus a conversation with a Board advisor&lt;/li&gt;\n&lt;/ol&gt;\n&lt;p&gt;To get started, complete this application, including answers to the questions below.&amp;nbsp;&lt;strong&gt;We read every application and your responses help us understand your experience beyond the resume.&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&amp;nbsp;&lt;/p&gt;&lt;div class=&quot;content-conclusion&quot;&gt;&lt;hr&gt;\n&lt;p&gt;&amp;nbsp;&lt;/p&gt;\n&lt;p&gt;Kit is an equal opportunity employer. We value diversity in all of its forms, and we hire the best person we can for each role, no matter your personal background. Research tells us that applicants who are female or non-binary, as well as applicants who are people of color, are less likely to apply for roles they do not feel 100% qualified for. If you think you meet more than 50% of our requirements but fewer than 100% of them, please apply. We’re imperfect communicators, so think of our job postings as the starting point for discussion rather than proof that you shouldn’t apply.&lt;/p&gt;\n&lt;p&gt;Kit does not discriminate on the basis of race, sex, color, religion, age, national origin, marital status, disability, veteran status, genetic information, sexual orientation, gender identity or any other reason prohibited by law in provision of employment opportunities and benefits.&lt;/p&gt;&lt;/div&gt;","tags":"[]","pubDate":"2025-03-11T18:38:39.000Z","link":"https://job-boards.greenhouse.io/convertkit/jobs/4674539007","slug":"director-of-marketing-kit-5658"},{"id":9276990503,"title":"Product Manager - Thrive","company":"Empower","image":"https://lever-client-logos.s3.us-west-2.amazonaws.com/2e1a369c-b58f-41ac-8d86-4b0a77695e68-1687915522032.png","description":"<p style=\"min-height:1.5em\"><strong>EMPOWER OVERVIEW</strong></p><p style=\"min-height:1.5em\"><a target=\"_blank\" rel=\"noopener noreferrer nofollow\" href=\"http://empower.me/\">Empower</a> is shaking up an outdated financial system by providing real opportunity for our customers: the opportunity to get the cash they need, to access fair credit, and to change their financial story. Today, we’re helping millions of people find financial security through machine learning models that evaluate creditworthiness using a more inclusive lens and mobile-first products: Cash Advance, Thrive line of credit, and Petal credit cards. Tomorrow? Creating even more financial paths for our customers (and their wallets) to succeed.</p><p style=\"min-height:1.5em\">This year, Empower ranked #65 on Inc. 5000’s Fastest-Growing Private Companies list — our third year in a row cracking the top 100 — and was named by Forbes as one of the 25 Next Billion-Dollar Startups for 2024. Empower was also featured by Forbes on America’s Best Startup Employers list in 2023, and our Thrive line of credit product was named by Fast Company as one of 2022’s Next Big Things in Tech.</p><p style=\"min-height:1.5em\">Empower is backed by Sequoia Capital, Blisce, and Icon Ventures. Ready to grow your impact and accelerate your career? Take a look at our open roles — we can’t wait to meet you.</p><p style=\"min-height:1.5em\"></p><p style=\"min-height:1.5em\"><strong>THE EMPOWER WAY</strong></p><p style=\"min-height:1.5em\"><strong>Great Expectations</strong>: We come up with bold, audacious goals for ourselves and go all out for impact</p><p style=\"min-height:1.5em\"><strong>Owner Mindset</strong>: We give every employee latitude to act independently, make smart choices, and move the business forward</p><p style=\"min-height:1.5em\"><strong>Spirited Debate</strong>: We love skeptics and seek counter opinions to challenge our personal assumptions and expand our view</p><p style=\"min-height:1.5em\"><strong>Customer Obsession:</strong> We listen to understand, empathize, and create a memorable, rewarding experience for our community</p><p style=\"min-height:1.5em\"><strong>Inclusive Collaboration</strong>: We believe diverse teams make the best decisions, and we strive to give diverse voices a seat at the table</p><p style=\"min-height:1.5em\"><strong>No Jerks Allowed</strong>: We value our relationships and take the time to build trust and connection and communicate respectfully</p><p style=\"min-height:1.5em\"></p><p style=\"min-height:1.5em\"><strong>WHAT EMPOWER OFFERS</strong></p><p style=\"min-height:1.5em\">Competitive salary</p><p style=\"min-height:1.5em\">Generous equity package</p><p style=\"min-height:1.5em\">Full healthcare benefits</p><p style=\"min-height:1.5em\">Technology expense reimbursement</p><p style=\"min-height:1.5em\">Virtual first environment</p><p style=\"min-height:1.5em\"></p><p style=\"min-height:1.5em\"><strong>JOB DESCRIPTION</strong></p><p style=\"min-height:1.5em\">We’re looking for extraordinary people to help lead product development as Empower continues to scale. Our product leaders are customer-centric, collaborate intensely with other key disciplines, and make decisions with an eye towards Empower’s business. Successful product managers are ambitious and resourceful -- willing to do whatever it takes to deliver value to our customers.</p><p style=\"min-height:1.5em\">The PM in this role will support our Thrive line of credit product as we continue to enhance the value proposition for our current and prospective customers. The role requires an aptitude for data analysis, comfort in driving independent execution on a range of quality of life projects, and an appetite for driving financial services innovation as we explore new ways to deliver on our company’s mission.</p><p style=\"min-height:1.5em\">Empower product managers are experts in cross-functional partnership, constantly engaging colleagues in Operations, Marketing, Finance, Compliance, Support, and other Product areas in order to deliver on their goals and maximize impact. If you’re looking for a role where you can have massive impact and a wide scope, you’ll find this role compelling, challenging, and rewarding.</p><p style=\"min-height:1.5em\">Travel for company offsites is expected at a minimum 2 times a year.</p><p style=\"min-height:1.5em\"></p><p style=\"min-height:1.5em\"><strong>QUALIFICATIONS</strong></p><ul style=\"min-height:1.5em\"><li><p style=\"min-height:1.5em\">We are looking for product managers and product leaders with varying levels of experience (minimum of 3+ years work experience in product management or management consulting/investment banking)</p></li><li><p style=\"min-height:1.5em\">A strong analytical skillset, evidenced by proficiency in SQL (or equivalent programming experience), or a demonstrated comfort in independently analysing ambiguous data across data sets to draw actionable conclusions</p></li><li><p style=\"min-height:1.5em\">Strong customer empathy and experience shaping product direction and execution based on customer needs</p></li><li><p style=\"min-height:1.5em\">A get-it-done mindset; you’re resourceful and happy to be hands on and in the weeds</p></li><li><p style=\"min-height:1.5em\">Experience delivering complex, cross-functional product initiatives </p></li><li><p style=\"min-height:1.5em\">Strong strategic thinking, problem solving, and logical structuring abilities</p></li><li><p style=\"min-height:1.5em\">Comfort with ambiguity; the ability to independently lay out and test clear hypotheses, and solve problems without well-defined direction</p></li><li><p style=\"min-height:1.5em\">Excellent verbal and written communication skills</p></li></ul><p style=\"min-height:1.5em\"><br /></p><p style=\"min-height:1.5em\">At Empower, we hire for people that push themselves to understand others and seek out ways to challenge their personal assumptions. Our hope is that by fostering such an environment, we strengthen our business and relationships by putting people first. We are committed to building a diverse, inclusive, and equitable workspace where everyone (regardless of age, education, ethnicity, gender, sexual orientation, or any personal characteristics) feels like they belong. Even if your experience doesn’t exactly match up to our job description, you should feel empowered to apply regardless!</p>","tags":"[\"finance\",\"management\"]","pubDate":"2025-03-11T17:45:55.341Z","link":"https://jobs.ashbyhq.com/empower%20finance/34e6509e-de93-4e6a-97e1-1736c86a4f7e","slug":"product-manager-thrive-empower-3455"},{"id":4818672028,"title":"SR UX Researcher ","company":"ília","image":"https://avatars.githubusercontent.com/u/35933823?s=200&v=4","description":"&lt;p&gt;Aqui na ília nossas vagas estão sempre abertas para todas as pessoas e não se restringem quanto a gênero, etnia, orientação sexual, fatores sociais, condições físicas ou intelectuais (PCD) etc. Incentivamos a candidatura de integrantes de todos os grupos minoritários!&lt;/p&gt;\n&lt;h3&gt;&lt;strong&gt;Sobre a ília&lt;/strong&gt;&lt;/h3&gt;\n&lt;p&gt;Somos especialistas em tecnologia, dados e design, impulsionando a transformação digital de grandes players do mercado há mais de 10 anos, nos setores financeiro, seguros e mobilidade. Com mais de 450 profissionais, estamos presentes no Brasil e Europa, atendendo aos mercados da América Latina, Europa e América do Norte, desenvolvendo produtos digitais de alta qualidade e com foco em resultados de negócios. Somos uma equipe inovadora, criativa e apaixonada por tecnologia.&amp;nbsp;&lt;/p&gt;\n&lt;p&gt;Certificada pelo 5° ano consecutivo como Great Place to work aqui na ília acreditamos que pessoas mudam o mundo, e investimos nelas. Nossas awesome deliveries são feitas de pessoas para pessoas, afinal awesome people make awesome deliveries!&amp;nbsp;&lt;/p&gt;\n&lt;p&gt;#Vempraília!&lt;/p&gt;\n&lt;h3&gt;&lt;strong&gt;Sobre a vaga:&lt;/strong&gt;&lt;/h3&gt;\n&lt;ul&gt;\n&lt;li&gt;Estamos em busca de um&amp;nbsp;&lt;strong&gt;UX Researcher Sr.&lt;/strong&gt; altamente qualificado para se juntar à nossa equipe. O candidato ideal terá uma vasta experiência em design de serviços e desenvolvimento de produtos digitais, com um forte conhecimento dos mercados financeiros. Será responsável por conduzir pesquisas profundas que informarão o design e o desenvolvimento de soluções inovadoras para nossos clientes.&lt;/li&gt;\n&lt;/ul&gt;\n&lt;h3&gt;Responsabilidades:&amp;nbsp;&lt;/h3&gt;\n&lt;ul&gt;\n&lt;li&gt;Conduzir pesquisas qualitativas e quantitativas para entender as necessidades e comportamentos dos usuários.&lt;/li&gt;\n&lt;li&gt;Planejar e executar estudos de usabilidade, entrevistas, testes A/B e outros métodos de pesquisa em design.&lt;/li&gt;\n&lt;li&gt;Colaborar com equipes de design, produto e desenvolvimento para garantir que as descobertas de pesquisa sejam integradas ao processo de design.&lt;/li&gt;\n&lt;li&gt;Analisar dados de pesquisa e apresentar resultados de forma clara e convincente para stakeholders.&lt;/li&gt;\n&lt;li&gt;Desenvolver e atualizar personas, jornadas do usuário e outros artefatos de pesquisa que ajudem a guiar o design de serviços.&lt;/li&gt;\n&lt;li&gt;Manter-se atualizado com as tendências do mercado financeiro e melhores práticas em pesquisa de UX.&lt;/li&gt;\n&lt;/ul&gt;\n&lt;h3&gt;&lt;strong&gt;Requisitos:&amp;nbsp;&lt;/strong&gt;&lt;/h3&gt;\n&lt;ul&gt;\n&lt;li&gt;Graduação em Design, Psicologia, Antropologia, Pesquisa de Mercado ou área relacionada.&lt;/li&gt;\n&lt;li&gt;Mínimo de 5 anos de experiência em UX Research, com foco em design de serviços e produtos digitais.&lt;/li&gt;\n&lt;li&gt;Experiência comprovada em mercados financeiros e compreensão das necessidades dos usuários nesse setor.&lt;/li&gt;\n&lt;li&gt;Conhecimento sólido em métodos e técnicas de pesquisa em design, incluindo pesquisa qualitativa e quantitativa.&lt;/li&gt;\n&lt;li&gt;Habilidades de comunicação excepcionais, tanto escritas quanto verbais.&lt;/li&gt;\n&lt;li&gt;Capacidade de trabalhar de forma colaborativa em um ambiente dinâmico e ágil.&lt;/li&gt;\n&lt;/ul&gt;\n&lt;h3&gt;&lt;strong&gt;Benefícios e Incentivos:&lt;/strong&gt;&lt;/h3&gt;\n&lt;p&gt;Nossa contratação é CLT- 40h semanais com jornada flexível, sendo executada 100% de forma remota. Os benefícios da ília são pensados para proporcionar uma experiência AWESOME para cada ílian, abaixo você encontra os benefícios de forma resumida. #vempraília&lt;/p&gt;\n&lt;p&gt;&lt;em&gt;Para Saúde e bem-estar:&lt;/em&gt;&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;Plano de Saúde e Odontológico SulAmérica extensivo a dependentes;&lt;/li&gt;\n&lt;li&gt;Vale Alimentação/Refeição em cartão fléxivel Picpay benefícios&amp;nbsp;&lt;/li&gt;\n&lt;li&gt;Seguro de Vida;&lt;/li&gt;\n&lt;li&gt;Auxílio Home-Office em cartão fléxivel Picpay benefícios;&lt;/li&gt;\n&lt;li&gt;Wellhub (Gympass)&lt;/li&gt;\n&lt;li&gt;TotalPass&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;&lt;em&gt;Para o seu Desenvolvimento:&lt;/em&gt;&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;ília University: Universidade Corporativa com mais de 20 mil cursos disponíveis para desenvolvimento pessoal e profissional;&lt;/li&gt;\n&lt;li&gt;Language Academy: Escola de idiomas para ílians;&lt;/li&gt;\n&lt;li&gt;í-talks e Chapter: Momentos e cerimônias em que o time compartilha práticas, estudos, projetos e ideias. Nas chapters ainda se reúnem pessoas com skills similares para compartilhamento de ideias, práticas e experiências;&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;&lt;em&gt;Gostamos de ir além no cuidado com as nossas pessoas, então dispomos também de alguns benefícios não convencionais:&amp;nbsp;&lt;/em&gt;&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;Plano de Saúde PET- Guapeco&amp;nbsp;&lt;/li&gt;\n&lt;li&gt;BYOD- Alugamos o seu notebook pessoal te pagando um valor mensal para que você o use, mas disponibilizamos também máquinas de trabalho para ílians. Você quem decide!&lt;/li&gt;\n&lt;li&gt;Seu Niver, seu bolo!&lt;/li&gt;\n&lt;li&gt;Seu Networking Vale Prêmio- Programa de premiação a indicação de novos funcionários.&lt;/li&gt;\n&lt;/ul&gt;","tags":"[\"finance\"]","pubDate":"2025-03-11T17:30:25.000Z","link":"https://job-boards.greenhouse.io/ilia/jobs/5473185004","slug":"sr-ux-researcher-lia-4263"},{"id":1308694947,"title":"SR UX Designer ","company":"ília","image":"https://avatars.githubusercontent.com/u/35933823?s=200&v=4","description":"&lt;p&gt;Aqui na ília nossas vagas estão sempre abertas para todas as pessoas e não se restringem quanto a gênero, etnia, orientação sexual, fatores sociais, condições físicas ou intelectuais (PCD) etc. Incentivamos a candidatura de integrantes de todos os grupos minoritários!&lt;/p&gt;\n&lt;h3&gt;&lt;strong&gt;Sobre a ília&lt;/strong&gt;&lt;/h3&gt;\n&lt;p&gt;Somos especialistas em tecnologia, dados e design, impulsionando a transformação digital de grandes players do mercado há mais de 10 anos, nos setores financeiro, seguros e mobilidade. Com mais de 450 profissionais, estamos presentes no Brasil e Europa, atendendo aos mercados da América Latina, Europa e América do Norte, desenvolvendo produtos digitais de alta qualidade e com foco em resultados de negócios. Somos uma equipe inovadora, criativa e apaixonada por tecnologia.&amp;nbsp;&lt;/p&gt;\n&lt;p&gt;Certificada pelo 5° ano consecutivo como Great Place to work aqui na ília acreditamos que pessoas mudam o mundo, e investimos nelas. Nossas awesome deliveries são feitas de pessoas para pessoas, afinal awesome people make awesome deliveries!&amp;nbsp;&lt;/p&gt;\n&lt;p&gt;#Vempraília!&lt;/p&gt;\n&lt;h3&gt;&lt;strong&gt;Sobre a vaga:&lt;/strong&gt;&lt;/h3&gt;\n&lt;p&gt;Estamos em busca de um&amp;nbsp;&lt;strong&gt;UX Designer Sr.&lt;/strong&gt; talentoso e experiente para ajudar &amp;nbsp;na evolução do nosso Design System. O candidato ideal terá um histórico comprovado na construção e implementação de Design Systems eficazes, além de uma forte capacidade de colaboração com equipes multidisciplinares. Será responsável por criar diretrizes, componentes e padrões que garantam a consistência e a excelência na experiência do usuário em todos os nossos produtos digitais.&lt;/p&gt;\n&lt;h3&gt;Responsabilidades:&amp;nbsp;&lt;/h3&gt;\n&lt;ul&gt;\n&lt;li&gt;Colaborar com a evolução e manutenção do nosso Design System, garantindo que ele atenda às necessidades de todos os produtos.&lt;/li&gt;\n&lt;li&gt;Colaborar com equipes de produto, desenvolvimento e marketing para integrar componentes do Design System em novas soluções e atualizações.&lt;/li&gt;\n&lt;li&gt;Criar, documentar e manter componentes reutilizáveis, padrões de design e diretrizes de estilo.&lt;/li&gt;\n&lt;li&gt;Elaborar documentações detalhadas e acessíveis do Design System, garantindo que todos os stakeholders possam utilizá-lo de forma eficaz.&lt;/li&gt;\n&lt;li&gt;Conduzir workshops e sessões de co-design para envolver as partes interessadas e coletar feedback sobre o Design System.&lt;/li&gt;\n&lt;li&gt;Realizar treinamentos para equipes sobre como utilizar o Design System, promovendo uma cultura de design consistente dentro da organização.&lt;/li&gt;\n&lt;li&gt;Realizar pesquisas de usuário e testes de usabilidade para validar e otimizar componentes e diretrizes existentes.&lt;/li&gt;\n&lt;li&gt;Ficar atualizado sobre as melhores práticas de design e tendências do setor para garantir que nosso Design System permaneça relevante e inovador.&lt;/li&gt;\n&lt;/ul&gt;\n&lt;h3&gt;&lt;strong&gt;Requisitos:&amp;nbsp;&lt;/strong&gt;&lt;/h3&gt;\n&lt;ul&gt;\n&lt;li&gt;Graduação em Design Gráfico, Design de Interação, Design de Produto ou área relacionada.&lt;/li&gt;\n&lt;li&gt;Mínimo de 5 anos de experiência em UX Design, e pelo menos 2 anos com foco específico em Design Systems.&lt;/li&gt;\n&lt;li&gt;Experiência prática na construção ou evolução de um Design System em projetos anteriores.&lt;/li&gt;\n&lt;li&gt;Sólido conhecimento em ferramentas de design (ex: Figma, Sketch, Adobe XD) e prototipagem.&lt;/li&gt;\n&lt;li&gt;Habilidades de comunicação excepcionais, com a capacidade de explicar conceitos de design de forma clara e envolvente.&lt;/li&gt;\n&lt;li&gt;Habilidade de escrita e capacidade de síntese, essencial para a criação de documentações e diretrizes.&lt;/li&gt;\n&lt;li&gt;Capacidade de trabalhar de forma colaborativa em um ambiente dinâmico e ágil.&lt;/li&gt;\n&lt;/ul&gt;\n&lt;h3&gt;Diferenciais:&amp;nbsp;&lt;/h3&gt;\n&lt;ul&gt;\n&lt;li&gt;Experiência com desenvolvimento front-end ou conhecimento de tecnologias (Android, IOS, React e Flutter)&lt;/li&gt;\n&lt;li&gt;Familiaridade com metodologias ágeis e práticas de design centradas no usuário.&lt;/li&gt;\n&lt;li&gt;Contribuições para comunidades de design ou publicações relacionadas ao Design System.&lt;/li&gt;\n&lt;/ul&gt;\n&lt;h3&gt;&lt;strong&gt;Benefícios e Incentivos:&lt;/strong&gt;&lt;/h3&gt;\n&lt;p&gt;Nossa contratação é CLT- 40h semanais com jornada flexível, sendo executada 100% de forma remota. Os benefícios da ília são pensados para proporcionar uma experiência AWESOME para cada ílian, abaixo você encontra os benefícios de forma resumida. #vempraília&lt;/p&gt;\n&lt;p&gt;&lt;em&gt;Para Saúde e bem-estar:&lt;/em&gt;&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;Plano de Saúde e Odontológico SulAmérica extensivo a dependentes;&lt;/li&gt;\n&lt;li&gt;Vale Alimentação/Refeição em cartão fléxivel Picpay benefícios&amp;nbsp;&lt;/li&gt;\n&lt;li&gt;Seguro de Vida;&lt;/li&gt;\n&lt;li&gt;Auxílio Home-Office em cartão fléxivel Picpay benefícios;&lt;/li&gt;\n&lt;li&gt;Wellhub (Gympass)&lt;/li&gt;\n&lt;li&gt;TotalPass&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;&lt;em&gt;Para o seu Desenvolvimento:&lt;/em&gt;&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;ília University: Universidade Corporativa com mais de 20 mil cursos disponíveis para desenvolvimento pessoal e profissional;&lt;/li&gt;\n&lt;li&gt;Language Academy: Escola de idiomas para ílians;&lt;/li&gt;\n&lt;li&gt;í-talks e Chapter: Momentos e cerimônias em que o time compartilha práticas, estudos, projetos e ideias. Nas chapters ainda se reúnem pessoas com skills similares para compartilhamento de ideias, práticas e experiências;&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;&lt;em&gt;Gostamos de ir além no cuidado com as nossas pessoas, então dispomos também de alguns benefícios não convencionais:&amp;nbsp;&lt;/em&gt;&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;Plano de Saúde PET- Guapeco&amp;nbsp;&lt;/li&gt;\n&lt;li&gt;BYOD- Alugamos o seu notebook pessoal te pagando um valor mensal para que você o use, mas disponibilizamos também máquinas de trabalho para ílians. Você quem decide!&lt;/li&gt;\n&lt;li&gt;Seu Niver, seu bolo!&lt;/li&gt;\n&lt;li&gt;Seu Networking Vale Prêmio- Programa de premiação a indicação de novos funcionários.&lt;/li&gt;\n&lt;/ul&gt;","tags":"[\"finance\"]","pubDate":"2025-03-11T17:29:35.000Z","link":"https://job-boards.greenhouse.io/ilia/jobs/5473192004","slug":"sr-ux-designer-lia-1631"},{"id":8552802387,"title":"Senior Site Reliability Engineer","company":"Airalo","image":"https://lever-client-logos.s3.us-west-2.amazonaws.com/55028a36-609c-479c-9553-d4689ff2dd8c-1669620566663.png","description":"<div><b>About Airalo</b></div><div>Alo! Airalo is the world’s first eSIM store that helps people connect in over 200+ countries and regions across the globe. We are building the next digital service that revolutionizes the telecom industry. We are a travel-tech company and an equal-opportunity environment that values and executes diversity, inclusion, and equity. Our team is spread across 50+ countries and six continents. What glues us together is our commitment to changing the way you connect<span style=\"font-size: 13.3333px\">. </span></div><div><br></div><div><b>About you</b></div><div>We hope that you care deeply about the quality of your work, the intrinsic worth of tasks, and the success of your team. You are self-disciplined and do not require micromanagement in terms of your skillset and work ethic. You do your best to flourish as an individual every day while working hard to foster a collaborative team environment. You believe in the importance of being — and staying — authentic, honest, positive, and kind. You are a good interlocutor with clear and concise communication. You are able to manage multiple projects, have an analytical mind, pay keen attention to detail, and love to get your hands dirty. You are cognizant, tolerant, and welcoming of vulnerabilities and cultural differences.</div><div><br></div><div><b>About the Role</b></div><div><b>Position</b>: Full-time / Employee</div><div><b>Location:</b>&nbsp;Remote-first </div><div><b>Benefits:</b>&nbsp;Health Insurance, work-from-anywhere stipend, annual wellness &amp; learning credits, annual all-expenses-paid company retreat in a gorgeous destination &amp; other benefits</div><div><br></div><div>We are looking for an experienced Site Reliability Engineer to join our growing engineering team.&nbsp;We are a company that values SRE principles and practices. We believe in empowering our SREs to make data-driven decisions, automate operational tasks, and continuously improve the reliability of our systems. We foster a blameless culture where everyone is encouraged to learn from mistakes and share knowledge. If you are passionate about building and maintaining highly reliable systems, we would love to hear from you!</div><h3>Responsibilities include but are not limited to:</h3><li>Develop and maintain reliable, scalable, and efficient systems.</li><li>Define and track Service Level Objectives (SLOs) and Service Level Indicators (SLIs) to measure and improve system reliability.</li><li>Conduct blameless post-incident reviews to identify root causes and implement preventive measures.</li><li>Drive automation of operational tasks and incident response.</li><li>Develop and maintain runbooks and playbooks for common operational tasks and incident response.</li><li>Mitigate operational risks.</li><li>Work with software engineers to design systems for reliability, scalability, and maintainability.</li><li>Continuously evaluate and optimize system performance, capacity, and cost.</li><li>Participate in on-call rotation and be available to troubleshoot and resolve critical issues.</li>,<h3>Must-haves:</h3><li>Bachelor’s degree in Computer Engineering or a similar discipline.</li><li>5+ years of experience as a Site Reliability Engineer or in a similar role.</li><li>3+ years of experience with AWS services including strong knowledge of container orchestration.</li><li>2+ years of Kubernetes experience</li><li>Deep understanding of observability principles and tools (logging, monitoring, tracing).</li><li>Experience with incident management and postmortem analysis.</li><li>Experience and interest in infrastructure as a code approach (Terraform).</li><li>Experience with chaos engineering and other techniques for testing system resilience.</li><li>Experience with CI/CD tools such as GitHub Actions.</li><li>Proficiency in at least one programming language (Python, Go, Java, etc.) for automation and tooling.</li><li>Comfortable with messaging systems (SNS, SQS, etc)</li><li>Ability to work independently and collaboratively in a fast-paced environment.</li><li>Team player and open to new ideas.</li><li>Good communication skills and fluency in English.</li>,<h3>Good to have:</h3><li>Prior experience with Scrum and other agile methods.</li><li>Certification in relevant areas such as AWS Certified DevOps Engineer, Certified Kubernetes Administrator (CKA), or similar.</li><li>Experience with AI-driven SRE tools for anomaly detection and improvements</li><li>Contributions to open-source SRE projects or communities.</li><li>Prior work experience in telecommunications.</li><li>Knowledge of eSIM and GSMA related technologies and services.</li><div>If you are interested in this position, <b>please apply via the link. </b></div><div><br></div><div>#EMEA</div><div>#<span style=\"font-size: 15px;\">LI-TE1</span></div><div><br></div><div><br></div><div>We sincerely thank all applicants in advance for submitting their interest in this opportunity. Airalo is an equal opportunity employer and values diversity, equity &amp; inclusion. We do not discriminate on the basis of race, religion, national origin, gender, sexual orientation, age, marital status, veteran status, or disability status. We are committed to providing reasonable accommodations upon request for individuals with disabilities throughout our job interview process.</div>","tags":"[\"management\",\"engineering\",\"aws\"]","pubDate":"2025-03-11T14:22:27.821Z","link":"https://jobs.lever.co/airalo/4b6cc1ba-2655-471f-9263-bc323f9678c4","slug":"senior-site-reliability-engineer-airalo-9220"},{"id":3264353539,"title":"Threat Intelligence Lead","company":"Canonical","image":"https://avatars.githubusercontent.com/u/53057619?s=200&v=4","description":"&lt;p&gt;The Threat Intelligence Lead will own Canonical’s threat intelligence strategy and execution, including understanding of which cyber threat actors are targeting Canonical, and the use of intelligence on Tactics, Techniques and Procedures (TTP) to better our products and internal cybersecurity controls. You will collaborate with internal stakeholders as well as with the wider cybersecurity community, making sure that Canonical is recognised as a thought leader on open source threat intelligence.&lt;/p&gt;\n&lt;p&gt;This role will report to the CISO.&lt;/p&gt;\n&lt;p&gt;You will lead intelligence gathering and development activities on threat actors targeting software supply chains. You&#39;ll study attack trends across the wider open source software landscape, report findings to internal security teams, and advise the wider engineering community on the best course of action to detect and mitigate possible threats.&lt;/p&gt;\n&lt;p&gt;As the publisher of Ubuntu, Canonical products are directly or indirectly present in almost every organisation and household in the world, making them a prime target for threat actors. This team&#39;s mission is to help Canonical, and by extension countless community members and companies around the world, secure their software infrastructure.&lt;/p&gt;\n&lt;h3&gt;What you’ll do in this role&lt;/h3&gt;\n&lt;ul&gt;\n&lt;li&gt;Build and own Canonical’s threat intelligence strategy&lt;/li&gt;\n&lt;li&gt;Build and maintain OSINT research environments&lt;/li&gt;\n&lt;li&gt;Develop OSINT tradecraft, principals, and techniques&lt;/li&gt;\n&lt;li&gt;Identify and track targeted intrusion cyber threats, trends, and new developments by cyber threat actors through analysis of proprietary and open source datasets&amp;nbsp;&lt;/li&gt;\n&lt;li&gt;Collaborate across teams to inform on activity of interest&lt;/li&gt;\n&lt;li&gt;Coordinate adversary/campaign tracking&lt;/li&gt;\n&lt;li&gt;Contribute to the wider threat intelligence community, establishing Canonical as a key contributor and thought leader in the space&lt;/li&gt;\n&lt;li&gt;Work with product and engineering teams to explain cybersecurity threats and advise on mitigation strategies&lt;/li&gt;\n&lt;li&gt;Work with the OPSEC and IS team to help implement/update security controls prioritising cyber defence&lt;/li&gt;\n&lt;li&gt;Identify intelligence gaps and propose new tools and research projects to fill them&lt;/li&gt;\n&lt;li&gt;Conduct briefings for executives, internal stakeholders and external customers&lt;/li&gt;\n&lt;/ul&gt;\n&lt;h3&gt;The successful Threat Intelligence Lead will be&lt;/h3&gt;\n&lt;ul&gt;\n&lt;li&gt;An experienced threat intelligence leader (or similar)&lt;/li&gt;\n&lt;li&gt;Knowledgeable about the current open source threat landscape and computer networking/infrastructure concepts&lt;/li&gt;\n&lt;li&gt;Highly competent with OSINT tools (e.g., Buscador, Trace Labs OSINT VM, OSINT Framework, Maltego, Shodan, social media scraping tools, etc.)&lt;/li&gt;\n&lt;li&gt;Able to identify, organise, catalogue, and track adversary tradecraft trends — often with incomplete data&lt;/li&gt;\n&lt;li&gt;Experienced using threat intelligence data to influence enterprise architecture or product development decisions&lt;/li&gt;\n&lt;li&gt;An excellent communicator with the ability to clearly articulate and tailor technical content to a variety of audiences&lt;/li&gt;\n&lt;li&gt;Able to travel twice a year, for company events up to two weeks long&lt;/li&gt;\n&lt;/ul&gt;\n&lt;h3&gt;Desired Characteristics&lt;/h3&gt;\n&lt;ul&gt;\n&lt;li&gt;A professional portfolio of OSINT related scripts, tools, or frameworks&lt;/li&gt;\n&lt;li&gt;Demonstrated involvement in the larger OSINT community (please share relevant links)&lt;/li&gt;\n&lt;li&gt;Degree qualified, with a bachelor&#39;s degree in computer science, information security, or a related field&lt;/li&gt;\n&lt;li&gt;Certifications in related areas (e.g. GOSI, SANS SEC487 &amp;amp; SEC587, IntelTechniques OSIP, etc)&lt;/li&gt;\n&lt;li&gt;Experience in a tech company or government/military signal intelligence departments&lt;/li&gt;\n&lt;/ul&gt;\n&lt;h3&gt;What we offer you&lt;/h3&gt;\n&lt;p&gt;We consider geographical location, experience, and performance in shaping compensation worldwide. We revisit compensation annually (and more often for graduates and associates) to ensure we recognise outstanding performance. In addition to base pay, we offer a performance-driven annual bonus. We provide all team members with additional benefits, which reflect our values and ideals. We balance our programs to meet local needs and ensure fairness globally.&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;Distributed work environment with twice-yearly team sprints in person&lt;/li&gt;\n&lt;li&gt;Personal learning and development budget of USD 2,000 per year&lt;/li&gt;\n&lt;li&gt;Annual compensation review&lt;/li&gt;\n&lt;li&gt;Recognition rewards&lt;/li&gt;\n&lt;li&gt;Annual holiday leave&lt;/li&gt;\n&lt;li&gt;Maternity and paternity leave&lt;/li&gt;\n&lt;li&gt;Employee Assistance Programme&lt;/li&gt;\n&lt;li&gt;Opportunity to travel to new locations to meet colleagues&lt;/li&gt;\n&lt;li&gt;Priority Pass, and travel upgrades for long haul company events&lt;/li&gt;\n&lt;/ul&gt;\n&lt;h3&gt;About Canonical&lt;/h3&gt;\n&lt;p&gt;Canonical is a pioneering tech firm at the forefront of the global move to open source. As the company that publishes Ubuntu, one of the most important open source projects and the platform for AI, IoT and the cloud, we are changing the world on a daily basis. We recruit on a global basis and set a very high standard for people joining the company. We expect excellence - in order to succeed, we need to be the best at what we do. Canonical has been a remote-first company since its inception in 2004.​ Working here is a step into the future, and will challenge you to think differently, work smarter, learn new skills, and raise your game.&lt;/p&gt;\n&lt;h3&gt;Canonical is an equal opportunity employer&lt;/h3&gt;\n&lt;p&gt;We are proud to foster a workplace free from discrimination. Diversity of experience, perspectives, and background create a better work environment and better products. &lt;a href=&quot;https://canonical.com/careers/diversity/identity&quot;&gt;Whatever your identity, we will give your application fair consideration.&lt;/a&gt;&lt;/p&gt;\n&lt;p&gt;#LI-remote&lt;/p&gt;","tags":"[\"engineering\"]","pubDate":"2025-03-11T13:00:33.000Z","link":"https://job-boards.greenhouse.io/canonical/jobs/5144666","slug":"threat-intelligence-lead-canonical-9975"},{"id":2082109933,"title":"Atlassian Marketplace Application Support Engineer","company":"Modus","image":"https://avatars.githubusercontent.com/u/959059?s=200&v=4","description":"&lt;h3&gt;&lt;span style=&quot;font-size: 10pt;&quot;&gt;&lt;strong&gt;[In reference to requisition 1953]&lt;/strong&gt;&lt;/span&gt;&lt;/h3&gt;\n&lt;h3&gt;&lt;strong&gt;Join Our Product Team Studio!&lt;/strong&gt;&lt;/h3&gt;\n&lt;p&gt;We are looking for an &lt;strong&gt;Atlassian Marketplace Application Support Engineer &lt;/strong&gt;to join our team to partner with cross-functional teams across the company and provide technical and product leadership for our suite of Marketplace Apps.&lt;/p&gt;\n&lt;h3&gt;&lt;span style=&quot;font-size: 12pt;&quot;&gt;&lt;strong&gt;About You:&lt;/strong&gt;&lt;/span&gt;&lt;/h3&gt;\n&lt;ul&gt;\n&lt;li&gt;&lt;strong&gt;Experience Level: &lt;/strong&gt;Senior/Principal&lt;/li&gt;\n&lt;li&gt;Experience supporting Atlassian tools, including: Jira (Software, Core, Service Management), Confluence and other Atlassian Marketplace apps&lt;/li&gt;\n&lt;li&gt;Deep understanding of Jira configurations, including:&lt;/li&gt;\n&lt;ul&gt;\n&lt;li&gt;Different scheme types (permission schemes, issue type schemes, notification schemes, workflow schemes, etc.) and their interactions.&lt;/li&gt;\n&lt;li&gt;Permission structures and how various entities (groups, roles, issue security levels, etc.) interact to control user access.&lt;/li&gt;\n&lt;li&gt;Jira Query Language (JQL) for searching, reporting, and automation.&lt;/li&gt;\n&lt;/ul&gt;\n&lt;li&gt;Ability to troubleshoot and resolve technical issues independently while documenting solutions and assisting customers in configuring their Atlassian environments.&lt;/li&gt;\n&lt;li&gt;Experience working remotely in a globally distributed team, demonstrating strong time management and self-motivation.&lt;/li&gt;\n&lt;/ul&gt;\n&lt;h3&gt;&lt;strong&gt;Bonus &lt;span style=&quot;font-size: 12pt;&quot;&gt;Points&lt;/span&gt; For:&lt;/strong&gt;&lt;/h3&gt;\n&lt;ul&gt;\n&lt;li&gt;Technical knowledge beyond standard Atlassian administration, including:&lt;/li&gt;\n&lt;ul&gt;\n&lt;li&gt;Understanding of HTTP requests and how they work in APIs.&lt;/li&gt;\n&lt;li&gt;Experience working with JSON data structures for integrations and configurations.&lt;/li&gt;\n&lt;li&gt;Basic networking knowledge, including how network routing works.&lt;/li&gt;\n&lt;li&gt;Understanding of email protocols (SMTP, IMAP, POP) and how they interact with Jira Service Management notifications.&lt;/li&gt;\n&lt;/ul&gt;\n&lt;li&gt;Experience in scripting or automation, using languages such as: Python, Groovy, JavaScript or Bash.&lt;/li&gt;\n&lt;li&gt;Atlassian Technical Certifications, such as:&lt;/li&gt;\n&lt;ul&gt;\n&lt;li&gt;ACP-JA (Jira Administrator)&lt;/li&gt;\n&lt;li&gt;ACP-CA (Confluence Administrator)&lt;/li&gt;\n&lt;li&gt;ACP-SA (System Administrator)&lt;/li&gt;\n&lt;li&gt;ACP-JCA (Jira Cloud Administrator)&lt;/li&gt;\n&lt;/ul&gt;\n&lt;li&gt;Multilingual proficiency (German, French, or Spanish preferred) to support a diverse global customer base.&lt;/li&gt;\n&lt;/ul&gt;\n&lt;h3&gt;&lt;strong&gt;You’ll Love:&lt;/strong&gt;&lt;/h3&gt;\n&lt;ul&gt;\n&lt;li&gt;Leading, mentoring, and coaching both clients and Modus teammates from the comfort of home.&lt;/li&gt;\n&lt;li&gt;Deep diving into customer needs and translating them into actionable requirements.&lt;/li&gt;\n&lt;li&gt;Exploring new tech and continuously learning—because software is always evolving!&lt;/li&gt;\n&lt;li&gt;Sharing your knowledge and participating actively in the community.&lt;/li&gt;\n&lt;/ul&gt;\n&lt;h3&gt;&lt;strong&gt;Team Collaboration:&lt;/strong&gt;&lt;/h3&gt;\n&lt;ul&gt;\n&lt;li&gt;Overlap with some EST hours daily is expected.&lt;/li&gt;\n&lt;li&gt;Reliable high-speed internet is a must!&lt;/li&gt;\n&lt;/ul&gt;\n&lt;h3&gt;&lt;strong&gt;Team Culture:&lt;/strong&gt;&lt;/h3&gt;\n&lt;p&gt;At Modus, a fast-growing, remote-first company, you’ll experience various exciting projects! Here’s a taste of what you might do:&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;&lt;strong&gt;Giving back&lt;/strong&gt;: Be an active participant through opportunities such as blog posts, open source contributions, and event speaking.&lt;/li&gt;\n&lt;li&gt;&lt;strong&gt;Travel &amp;amp; connections&lt;/strong&gt;: Meet fantastic people during our remote meet-ups! It’s all about collaboration and fun! Global environment and diversity at its best.&lt;/li&gt;\n&lt;li&gt;&lt;strong&gt;Teaching and learning&lt;/strong&gt;: Work in active teams on internal and external projects, staying up-to-date with the latest technologies.&lt;/li&gt;\n&lt;li&gt;&lt;strong&gt;Being a self starter:&amp;nbsp; &lt;/strong&gt;Autonomy and proactivity are the key to succeed at Modus.&lt;/li&gt;\n&lt;li&gt;&lt;strong&gt;Client interaction:&amp;nbsp;&lt;/strong&gt;Represent Modus and our values while connecting directly with our clients, some of the world’s biggest brands.&lt;/li&gt;\n&lt;li&gt;&lt;strong&gt;Growth&lt;/strong&gt;: Enjoy comprehensive learning benefits, with access to over 12,000 courses. Your growth is our priority!&lt;/li&gt;\n&lt;/ul&gt;\n&lt;h3&gt;&lt;span style=&quot;font-size: 12pt;&quot;&gt;&lt;strong&gt;About us:&amp;nbsp;&lt;/strong&gt;&lt;/span&gt;&lt;/h3&gt;\n&lt;p&gt;Founded in 2011, Modus is a global, fully remote team of world-class technologists who thrive in a collaborative, innovative environment. We were fully remote before it was cool! We support organizations on their digital transformation journey through strategic consulting and full lifecycle product development, partnering with industry leaders including Atlassian, GitHub and AWS. Recognized as one of the Inc. 5000 Fastest Growing Private Companies for nine years and a top remote work company by FlexJobs, we have helped some of the world’s largest brands deliver powerful digital experiences.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;We combine boutique expertise with enterprise-scale capabilities.&lt;/strong&gt; &lt;strong&gt;As an award-winning Atlassian partner with a world-class team, we help organizations innovate and solve complex challenges for Fortune 500 companies and beyond, we want to hear from you.&lt;/strong&gt;&lt;/p&gt;\n&lt;h3&gt;&lt;span style=&quot;font-size: 12pt;&quot;&gt;&lt;strong&gt;Perks of working with us:&lt;/strong&gt;&lt;/span&gt;&lt;/h3&gt;\n&lt;ul&gt;\n&lt;li&gt;Remote work with flexible working hours&lt;/li&gt;\n&lt;li&gt;Modus Global Office Programme:for when you want to get out of your home, we offer on-demand access to private offices, meeting rooms, coworking spaces and business lounges in locations in over 120 countries.&amp;nbsp;&lt;/li&gt;\n&lt;li&gt;Employee Referral Program&amp;nbsp;&lt;/li&gt;\n&lt;li&gt;Client Referral Program&amp;nbsp;&lt;/li&gt;\n&lt;li&gt;Travel according to client or team needs&lt;/li&gt;\n&lt;li&gt;The chance to work side-by-side with thought leaders in emerging tech&lt;/li&gt;\n&lt;li&gt;Access to more than 12,000 courses with a licensed Coursera account.&lt;/li&gt;\n&lt;li&gt;Possibility to obtain paid certification/courses if they align with company goals and are relevant to the employee&#39;s role.&lt;br&gt;&lt;br&gt;&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;Additional benefits might apply contingent on your location.&lt;/p&gt;\n&lt;p&gt;By joining our team, you’ll be part of a winning squad that plays to each other’s strengths and celebrates every success together. Apply now and show us you’ve got what it takes to take your consulting skills to the next level with Modus Create!&lt;/p&gt;","tags":"[\"javascript\",\"management\",\"aws\"]","pubDate":"2025-03-11T12:51:01.000Z","link":"https://moduscreate.com/careers/6506038003?gh_jid=6506038003","slug":"atlassian-marketplace-application-support-engineer-modus-2295"},{"id":3441405152,"title":"Staff Security Operations Engineer","company":"Canonical","image":"https://avatars.githubusercontent.com/u/53057619?s=200&v=4","description":"&lt;p&gt;We have opened several senior/staff Security Operations Engineer (SOC) positions, creating a new team reporting to the CISO. We are looking for a range of experience in these positions - at the high end we are looking for deep experience defending highly contested critical assets and high-value cyber targets against advanced persistent threats and state-level actors. We have more junior roles for exceptional individuals with a proven personal interest an engagement in cyber attack and defence, and outstanding academic and career performance even if experience is limited.&lt;/p&gt;\n&lt;p&gt;Our goal is to build an entirely new level of assurance and observable rigour into the open source supply chain. We have our own estate to monitor, but more broadly our goal is to raise the robustness of the entire global Ubuntu estate through the work of this team.&lt;/p&gt;\n&lt;p&gt;The Security Operations (SecOps) team is responsible for design, implementation and evolution of Canonical security practices, techniques, tools, systems and policies. The team is the primary owner of strategy and practices that determine how Canonical secures its data, internal infrastructure and build processes. They are responsible for assuring the security and integrity of our own infrastructure and product deployments. They design and implement technical security controls that ensure security threats are automatically identified, contained and remediated. The team will also contribute ideas and requirements for Canonical product security, improving the resilience and robustness of all Ubuntu customers and users subject to cyber attack.&lt;/p&gt;\n&lt;p&gt;The SecOps team&#39;s mission is not only to secure Canonical, but also to contribute to the security of the wider open source ecosystem. They might share knowledge through public presentations and industry events, and share threat intelligence with the wider community or represent Canonical in sector-specific governance bodies.&lt;/p&gt;\n&lt;h2&gt;&lt;strong&gt;What you will do in this role:&lt;/strong&gt;&lt;/h2&gt;\n&lt;ul&gt;\n&lt;li&gt;Implement and evolve Canonical&#39;s SecOps security standards and playbooks&lt;/li&gt;\n&lt;li&gt;Analyse and improve Canonical&#39;s security architecture&lt;/li&gt;\n&lt;li&gt;Evaluate, select and implement new security tools and practices&lt;/li&gt;\n&lt;li&gt;Identify, contain and guide the remediation of security threats and cyber attacks&lt;/li&gt;\n&lt;li&gt;Grow the presence and thought leadership of Canonical SecOps practice&lt;/li&gt;\n&lt;li&gt;Contribute to open source threat intelligence initiatives&lt;/li&gt;\n&lt;li&gt;Drive threat modelling, table top exercises and other SecOps practices across Engineering, IS and Canonical&lt;/li&gt;\n&lt;li&gt;Develop Canonical SecOps learning and development materials&lt;/li&gt;\n&lt;li&gt;Publish blog posts, whitepapers and conference presentations&lt;/li&gt;\n&lt;li&gt;Identify, implement and track SecOps KPIs&lt;/li&gt;\n&lt;li&gt;Plan and deliver SecOps work in the framework of Canonical&#39;s agile engineering practice&lt;/li&gt;\n&lt;li&gt;Work with Security leadership to present information and influence change&lt;/li&gt;\n&lt;/ul&gt;\n&lt;h2&gt;&lt;strong&gt;What we are looking for&lt;/strong&gt;&lt;/h2&gt;\n&lt;ul&gt;\n&lt;li&gt;An exceptional academic track record&amp;nbsp;&lt;/li&gt;\n&lt;li&gt;Undergraduate degree in Computer Science or STEM, or a compelling narrative about your alternative path&lt;/li&gt;\n&lt;li&gt;Drive and a track record of going above-and-beyond expectations&lt;/li&gt;\n&lt;li&gt;Deep personal motivation to be at the forefront of technology security&lt;/li&gt;\n&lt;li&gt;Expertise in threat modelling and risk management frameworks&lt;/li&gt;\n&lt;li&gt;Knowledge of security architecture and market-leading security tools&lt;/li&gt;\n&lt;li&gt;Experience contributing to, and consuming, threat intelligence feeds&lt;/li&gt;\n&lt;li&gt;Experience in security risk management frameworks such as NIST CSF&lt;/li&gt;\n&lt;li&gt;Experience with security standards such as ISO 27001&lt;/li&gt;\n&lt;/ul&gt;\n&lt;h2&gt;&lt;strong&gt;Optional things we value&lt;/strong&gt;&lt;/h2&gt;\n&lt;ul&gt;\n&lt;li&gt;Experience in a security operations team or a security operations centre (SOC)&lt;/li&gt;\n&lt;li&gt;Experience in offensive or defensive security teams with hands-on ability&lt;/li&gt;\n&lt;li&gt;Experience with state-actor and other advanced persistent threats&lt;/li&gt;\n&lt;/ul&gt;\n&lt;h2&gt;&lt;strong&gt;What we offer you&lt;/strong&gt;&lt;/h2&gt;\n&lt;p&gt;We consider geographical location, experience, and performance in shaping compensation worldwide. We revisit compensation annually (and more often for graduates and associates) to ensure we recognise outstanding performance. In addition to base pay, we offer a performance-driven annual bonus. We provide all team members with additional benefits, which reflect our values and ideals. We balance our programs to meet local needs and ensure fairness globally.&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;Distributed work environment with twice-yearly team sprints in person&lt;/li&gt;\n&lt;li&gt;Personal learning and development budget of USD 2,000 per year&lt;/li&gt;\n&lt;li&gt;Annual compensation review&lt;/li&gt;\n&lt;li&gt;Recognition rewards&lt;/li&gt;\n&lt;li&gt;Annual holiday leave&lt;/li&gt;\n&lt;li&gt;Maternity and paternity leave&lt;/li&gt;\n&lt;li&gt;Employee Assistance Programme&lt;/li&gt;\n&lt;li&gt;Opportunity to travel to new locations to meet colleagues&lt;/li&gt;\n&lt;li&gt;Priority Pass, and travel upgrades for long haul company events&lt;/li&gt;\n&lt;/ul&gt;\n&lt;h2&gt;&lt;strong&gt;About Canonical&lt;/strong&gt;&lt;/h2&gt;\n&lt;p&gt;Canonical is a pioneering tech firm at the forefront of the global move to open source. As the company that publishes Ubuntu, one of the most important open source projects and the platform for AI, IoT and the cloud, we are changing the world on a daily basis. We recruit on a global basis and set a very high standard for people joining the company. We expect excellence - in order to succeed, we need to be the best at what we do. Canonical has been a remote-first company since its inception in 2004.​ Working here is a step into the future, and will challenge you to think differently, work smarter, learn new skills, and raise your game.&lt;/p&gt;\n&lt;h2&gt;&lt;strong&gt;Canonical is an equal opportunity employer&lt;/strong&gt;&lt;/h2&gt;\n&lt;p&gt;We are proud to foster a workplace free from discrimination. Diversity of experience, perspectives, and background create a better work environment and better products.&lt;a href=&quot;https://canonical.com/careers/diversity/identity&quot;&gt; Whatever your identity, we will give your application fair consideration.&lt;/a&gt;&lt;/p&gt;\n&lt;p&gt;#LI-remote&lt;/p&gt;","tags":"[\"management\",\"engineering\"]","pubDate":"2025-03-11T09:22:27.000Z","link":"https://job-boards.greenhouse.io/canonical/jobs/6485081","slug":"staff-security-operations-engineer-canonical-4482"},{"id":2727425962,"title":"Senior Security Operations Engineer","company":"Canonical","image":"https://avatars.githubusercontent.com/u/53057619?s=200&v=4","description":"&lt;p&gt;We have opened several senior/staff Security Operations Engineer (SOC) positions, creating a new team reporting to the CISO. We are looking for a range of experience in these positions - at the high end we are looking for deep experience defending highly contested critical assets and high-value cyber targets against advanced persistent threats and state-level actors. We have more junior roles for exceptional individuals with a proven personal interest an engagement in cyber attack and defence, and outstanding academic and career performance even if experience is limited.&lt;/p&gt;\n&lt;p&gt;Our goal is to build an entirely new level of assurance and observable rigour into the open source supply chain. We have our own estate to monitor, but more broadly our goal is to raise the robustness of the entire global Ubuntu estate through the work of this team.&lt;/p&gt;\n&lt;p&gt;The Security Operations (SecOps) team is responsible for design, implementation and evolution of Canonical security practices, techniques, tools, systems and policies. The team is the primary owner of strategy and practices that determine how Canonical secures its data, internal infrastructure and build processes. They are responsible for assuring the security and integrity of our own infrastructure and product deployments. They design and implement technical security controls that ensure security threats are automatically identified, contained and remediated. The team will also contribute ideas and requirements for Canonical product security, improving the resilience and robustness of all Ubuntu customers and users subject to cyber attack.&lt;/p&gt;\n&lt;p&gt;The SecOps team&#39;s mission is not only to secure Canonical, but also to contribute to the security of the wider open source ecosystem. They might share knowledge through public presentations and industry events, and share threat intelligence with the wider community or represent Canonical in sector-specific governance bodies.&lt;/p&gt;\n&lt;h2&gt;&lt;strong&gt;What you will do in this role:&lt;/strong&gt;&lt;/h2&gt;\n&lt;ul&gt;\n&lt;li&gt;Implement and evolve Canonical&#39;s Security Operation Center&lt;/li&gt;\n&lt;li&gt;Analyse and improve Canonical&#39;s security architecture&lt;/li&gt;\n&lt;li&gt;Evaluate, select and implement new security tools and practices&lt;/li&gt;\n&lt;li&gt;Identify, contain and guide the remediation of security threats and cyber attacks&lt;/li&gt;\n&lt;li&gt;Grow the presence and thought leadership of Canonical SecOps practice&lt;/li&gt;\n&lt;li&gt;Contribute to open source threat intelligence initiatives&lt;/li&gt;\n&lt;li&gt;Drive threat modelling, table top exercises and other SecOps practices across Engineering, IS and Canonical&lt;/li&gt;\n&lt;li&gt;Develop Canonical SecOps learning and development materials&lt;/li&gt;\n&lt;li&gt;Publish blog posts, whitepapers and conference presentations&lt;/li&gt;\n&lt;li&gt;Identify, implement and track SecOps KPIs&lt;/li&gt;\n&lt;li&gt;Plan and deliver SecOps work in the framework of Canonical&#39;s agile engineering practice&lt;/li&gt;\n&lt;li&gt;Work with Security leadership to present information and influence change&lt;/li&gt;\n&lt;/ul&gt;\n&lt;h2&gt;&lt;strong&gt;What we are looking for&lt;/strong&gt;&lt;/h2&gt;\n&lt;ul&gt;\n&lt;li&gt;An exceptional academic track record&amp;nbsp;&lt;/li&gt;\n&lt;li&gt;Undergraduate degree in Computer Science or STEM, or a compelling narrative about your alternative path&lt;/li&gt;\n&lt;li&gt;Previous professional experience working or leading a Security Operation Center&lt;/li&gt;\n&lt;li&gt;Deep personal motivation to be at the forefront of technology security&lt;/li&gt;\n&lt;li&gt;Expertise in threat modelling and risk management frameworks&lt;/li&gt;\n&lt;li&gt;Knowledge of security architecture and market-leading security tools&lt;/li&gt;\n&lt;li&gt;Experience contributing to, and consuming, threat intelligence feeds&lt;/li&gt;\n&lt;li&gt;Experience in security risk management frameworks such as NIST CSF and ISO27001&lt;/li&gt;\n&lt;/ul&gt;\n&lt;h2&gt;&lt;strong&gt;Optional things we value&lt;/strong&gt;&lt;/h2&gt;\n&lt;ul&gt;\n&lt;li&gt;Experience in a security operations team or a security operations centre (SOC)&lt;/li&gt;\n&lt;li&gt;Experience in offensive or defensive security teams with hands-on ability&lt;/li&gt;\n&lt;li&gt;Experience with state-actor and other advanced persistent threats&lt;/li&gt;\n&lt;/ul&gt;\n&lt;h2&gt;&lt;strong&gt;What we offer you&lt;/strong&gt;&lt;/h2&gt;\n&lt;p&gt;We consider geographical location, experience, and performance in shaping compensation worldwide. We revisit compensation annually (and more often for graduates and associates) to ensure we recognise outstanding performance. In addition to base pay, we offer a performance-driven annual bonus. We provide all team members with additional benefits, which reflect our values and ideals. We balance our programs to meet local needs and ensure fairness globally.&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;Distributed work environment with twice-yearly team sprints in person&lt;/li&gt;\n&lt;li&gt;Personal learning and development budget of USD 2,000 per year&lt;/li&gt;\n&lt;li&gt;Annual compensation review&lt;/li&gt;\n&lt;li&gt;Recognition rewards&lt;/li&gt;\n&lt;li&gt;Annual holiday leave&lt;/li&gt;\n&lt;li&gt;Maternity and paternity leave&lt;/li&gt;\n&lt;li&gt;Employee Assistance Programme&lt;/li&gt;\n&lt;li&gt;Opportunity to travel to new locations to meet colleagues&lt;/li&gt;\n&lt;li&gt;Priority Pass, and travel upgrades for long haul company events&lt;/li&gt;\n&lt;/ul&gt;\n&lt;h2&gt;&lt;strong&gt;About Canonical&lt;/strong&gt;&lt;/h2&gt;\n&lt;p&gt;Canonical is a pioneering tech firm at the forefront of the global move to open source. As the company that publishes Ubuntu, one of the most important open source projects and the platform for AI, IoT and the cloud, we are changing the world on a daily basis. We recruit on a global basis and set a very high standard for people joining the company. We expect excellence - in order to succeed, we need to be the best at what we do. Canonical has been a remote-first company since its inception in 2004.​ Working here is a step into the future, and will challenge you to think differently, work smarter, learn new skills, and raise your game.&lt;/p&gt;\n&lt;h2&gt;&lt;strong&gt;Canonical is an equal opportunity employer&lt;/strong&gt;&lt;/h2&gt;\n&lt;p&gt;We are proud to foster a workplace free from discrimination. Diversity of experience, perspectives, and background create a better work environment and better products.&lt;a href=&quot;https://canonical.com/careers/diversity/identity&quot;&gt; Whatever your identity, we will give your application fair consideration.&lt;/a&gt;&lt;/p&gt;\n&lt;p&gt;#LI-remote&lt;/p&gt;","tags":"[\"management\",\"engineering\"]","pubDate":"2025-03-11T09:13:59.000Z","link":"https://job-boards.greenhouse.io/canonical/jobs/5391149","slug":"senior-security-operations-engineer-canonical-9852"},{"id":3802239586,"title":"Product Manager, Agentic Products","company":"Nethermind","image":"https://avatars.githubusercontent.com/u/43478154?s=200&v=4","description":"&lt;div class=&quot;content-intro&quot;&gt;&lt;h2&gt;What are we all about?&lt;/h2&gt;\n&lt;p&gt;We are a team of builders and researchers on a mission to empower enterprises and developers worldwide to access and build on decentralized systems.&lt;/p&gt;\n&lt;p&gt;Our expertise covers several domains: Ethereum and Starknet protocol engineering, layer-2, AI, cryptography research, protocol research, decentralized finance (DeFi), security auditing, formal verification, real-time monitoring, smart contract development, and dapps and enterprise engineering.&lt;/p&gt;\n&lt;p&gt;Working to solve some of the most challenging problems in the blockchain space, we frequently collaborate with renowned companies, such as Ethereum Foundation, Starknet Foundation, Gnosis Chain, Flashbots, Forta Protocol, Lido, EigenLayer, Open Zeppelin, RISCZero, Aleph Zero, and many more.&lt;/p&gt;\n&lt;p&gt;Today, we are a 350+ strong team working remotely across 66+ countries.&lt;/p&gt;\n&lt;p&gt;View all our open positions here: &lt;a href=&quot;https://www.nethermind.io/open-roles&quot;&gt;https://www.nethermind.io/open-roles&amp;nbsp;&lt;/a&gt;&lt;/p&gt;&lt;/div&gt;&lt;p&gt;&lt;strong&gt;What We Need&lt;/strong&gt;&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;A proactive and hands-on product manager to own and drive the development of Agentic AI products from concept to launch.&lt;/li&gt;\n&lt;li&gt;Demonstrable hands-on experience developing, managing, or implementing AI agents or related technologies (e.g., autonomous agents, reinforcement learning, LLM-based agents).&lt;/li&gt;\n&lt;li&gt;Strong understanding of AI concepts beyond casual or end-user familiarity, particularly related to agent-based systems.&lt;/li&gt;\n&lt;li&gt;Solid domain knowledge of the Ethereum ecosystem.&lt;/li&gt;\n&lt;li&gt;A willingness to work remotely with a globally distributed team of talented engineers, researchers, and industry-leading partners.&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;&lt;strong&gt;Role &amp;amp; Responsibilities&lt;/strong&gt;&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;Define and champion the mission and vision for assigned Agentic AI products.&lt;/li&gt;\n&lt;li&gt;Develop and execute the product strategy, collaborating with other product managers to align on broader portfolio goals.&lt;/li&gt;\n&lt;li&gt;Deeply understand our users’ needs by using our products, conducting research, and engaging with the community.&lt;/li&gt;\n&lt;li&gt;Create and manage a clear, prioritized roadmap, ensuring alignment with user needs, technical feasibility, and resource availability.&lt;/li&gt;\n&lt;li&gt;Work closely with UX/UI designers, project managers, engineers, marketing, and legal to ensure successful product development and launch.&lt;/li&gt;\n&lt;li&gt;Monitor and report on key financial metrics, such as burn rate, revenue projections, and unit economics, ensuring alignment with overall business goals.&lt;/li&gt;\n&lt;li&gt;Maintain deep insight into the ecosystems around the blockchains and AI technologies we are helping to build.&lt;/li&gt;\n&lt;li&gt;Demonstrate empathy with developers by writing clear, complete product requirements that enable productive development.&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;&lt;strong&gt;Requirements&lt;/strong&gt;&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;At least two years of experience in the crypto industry.&lt;/li&gt;\n&lt;li&gt;At least two years of experience working in a product role.&lt;/li&gt;\n&lt;li&gt;Proven experience developing or managing at least one AI agent or autonomous system (e.g., autonomous agents, reinforcement learning, or LLM-based applications).&lt;/li&gt;\n&lt;li&gt;Strong English communication skills.&lt;/li&gt;\n&lt;li&gt;Hands-on experience in software development.&lt;/li&gt;\n&lt;li&gt;Bachelor’s degree or equivalent practical experience.&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;&lt;strong&gt;Nice to Have&lt;/strong&gt;&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;Prior involvement in one or more Ethereum L2 blockchains.&lt;/li&gt;\n&lt;li&gt;Basic smart contract development experience.&lt;/li&gt;\n&lt;li&gt;Understanding of the DeFi landscape, including lending protocols, AMMs, perpetuals, and stablecoins.&lt;/li&gt;\n&lt;/ul&gt;&lt;div class=&quot;content-conclusion&quot;&gt;&lt;div&gt;&lt;span style=&quot;font-size: 8pt;&quot;&gt;&lt;em&gt;&lt;span style=&quot;text-decoration: underline;&quot;&gt;&lt;strong&gt;Disclaimer&lt;/strong&gt;&lt;/span&gt;: I hereby consent to my personal information being stored and processed by Demerzel Solutions Limited (t/a Nethermind) (the “Company”) for recruitment purposes in relation to both the selected job role and any other role the Company considers me a qualified candidate for. All data storing and processing by the Company takes place in accordance with the UK GDPR. Kindly refer to our privacy policy for more details.&amp;nbsp;&lt;/em&gt;&lt;/span&gt;&lt;br&gt;&lt;span style=&quot;font-size: 8pt;&quot;&gt;&lt;em&gt;Your consent to share personal information is entirely voluntary, and you may withdraw your consent at any time. Should you have any questions about this process, or wish to withdraw your consent please contact: legalnotices@nethermind.io&amp;nbsp;&lt;/em&gt;&lt;/span&gt;&lt;br&gt;&lt;br&gt;Keep up to date on what we are working on by following&amp;nbsp;&lt;span class=&quot;il&quot;&gt;us&lt;/span&gt;&amp;nbsp;on &lt;strong&gt;our social channels&lt;br&gt;&lt;br&gt;&lt;/strong&gt;&lt;/div&gt;\n&lt;div&gt;&lt;a href=&quot;https://twitter.com/nethermindeth&quot; target=&quot;_blank&quot;&gt;&lt;img src=&quot;https://cdn4.iconfinder.com/data/icons/social-media-icons-the-circle-set/48/twitter_circle-512.png&quot; alt=&quot;&quot; width=&quot;50&quot; height=&quot;50&quot;&gt;&lt;/a&gt; &amp;nbsp; &lt;a href=&quot;https://discord.com/invite/PaCMRFdvWT&quot; target=&quot;_blank&quot;&gt;&lt;img src=&quot;https://cdn3.iconfinder.com/data/icons/popular-services-brands-vol-2/512/discord-1024.png&quot; alt=&quot;&quot; width=&quot;49&quot; height=&quot;49&quot;&gt;&lt;/a&gt; &amp;nbsp; &lt;a href=&quot;https://www.linkedin.com/company/nethermind/mycompany/&quot; target=&quot;_blank&quot;&gt;&lt;img src=&quot;https://cdn1.iconfinder.com/data/icons/logotypes/32/circle-linkedin-1024.png&quot; alt=&quot;&quot; width=&quot;49&quot; height=&quot;49&quot;&gt;&lt;/a&gt;&lt;/div&gt;\n&lt;div&gt;&amp;nbsp;&lt;/div&gt;\n&lt;div&gt;&lt;strong&gt;&lt;a href=&quot;https://www.nethermind.io/legal&quot; target=&quot;_blank&quot;&gt;&lt;em&gt;Click here to view our Privacy Policy.&lt;/em&gt;&lt;/a&gt;&lt;/strong&gt;&lt;/div&gt;&lt;/div&gt;","tags":"[\"finance\",\"engineering\",\"legal\"]","pubDate":"2025-03-11T08:14:30.000Z","link":"https://job-boards.eu.greenhouse.io/nethermind/jobs/4553011101","slug":"product-manager-agentic-products-nethermind-1413"},{"id":3334997049,"title":"Senior Site Reliability Engineer (SRE) for Release Engineering (remote-only)","company":"CloudLinux","image":"https://avatars.githubusercontent.com/u/16290369?s=200&v=4","description":"<p>CloudLinux is looking for a brilliant&nbsp;<strong>Senior Site Reliability Engineer (SRE)</strong>&nbsp;to join the&nbsp;<strong>Release Engineering Department</strong>, a team that plays a critical role in maintaining both external and internal infrastructure related to package repositories, with a strong focus on delivering and managing repository distribution to users. </p><p>This role offers a unique opportunity to collaborate with multiple development teams, accelerate progress, and provide enterprise-level solutions globally. Responsibilities include Linux OS administration, designing system solutions at an architectural level, advancing cloud technologies, system programming, Python/Linux scripting, and working with virtualization. This is a remote position best suited for professionals located in Europe and CIS, as the team primarily operates within European time zones.</p><p></p><p><strong>As our Senior Site Reliability Engineer, you will:</strong></p><ul> <li>Design, implement, and manage scalable, resilient, and secure wide company repository infrastructure for CloudLinux products as a first assignment.</li> <li>Automate software operations for re-usability and consistency across private and public clouds, taking into consideration the complexities of distributed systems.</li> <li>Monitor system performance and troubleshoot issues proactively to ensure optimal uptime and reliability.</li> <li>Automate deployment processes using Infrastructure as Code (IaC) principles.</li> <li>Share your experience, know-how, and best practices with other team members in design sessions, system architecture discussions, mentorship, and \"doing work together\".</li> </ul><p><strong>Requirements</strong></p><p><strong>To be successful, you should have:</strong></p><ul> <li>Strong background in development: an ideal candidate had started a career as a developer, then rolled to infrastructure-based projects on a large scale.&nbsp;</li> <li>Proven experience as a leading SRE or in a similar role, with a strong focus on Linux environments.</li> <li>Proficiency in modern agile SDLC practices and principles, orchestration, and CI/CD tooling i.e. Python, Java, Terraform, Ansible, Cloudformation, Puppet, Chef, or similar.</li> <li>Knowledge of the Grafana ecosystem or similar, building dashboards, alert rules, PromQL, as well as frontend observability.</li> <li>Excellent technical knowledge of IT Infrastructure, including network and application load balancers, switches, routers, and IP addressing.</li> <li>Strong analytical and problem-solving skills with a focus on root cause analysis and mitigation.</li> <li>Excellent communication and teamwork skills with the ability to collaborate effectively across engineering teams.</li> <li>English: at least Intermediate level required.</li> </ul><p><strong>Benefits</strong></p><p><strong>What's in it for you?</strong></p><ul> <li>A focus on professional development.</li> <li>Interesting and challenging projects.</li> <li>Fully remote work with flexible working hours, that allows you to schedule your day and work from any location worldwide.</li> <li>Paid 24 days of vacation per year, 10 days of national holidays, and unlimited sick leaves.</li> <li>Compensation for private medical insurance.</li> <li>Co-working and gym/sports reimbursement.</li> <li>Budget for education.</li> <li>The opportunity to receive a reward for the most innovative idea that the company can patent.</li> </ul><p></p><p><em>By applying for this position, you consent to the processing of your personal data as described in our Privacy Policy (</em><a href=\"https://cloudlinux.com/candidate-privacy-notice\" target=\"_blank\" rel=\"nofollow noreferrer noopener\" class=\"external\"><em>https://cloudlinux.com/candidate-privacy-notice</em></a><em>), which provides detailed information on how we maintain and handle your data.</em></p>","tags":"[\"engineering\"]","pubDate":"2025-03-11T00:00:00.000Z","link":"https://apply.workable.com/j/70F2AF1366","slug":"senior-site-reliability-engineer-sre-for-release-engineering-remote-only-cloudlinux-9034"},{"id":6547671079,"title":"Senior Site Reliability Engineer (SRE) for Release Engineering (remote-only)","company":"CloudLinux","image":"https://avatars.githubusercontent.com/u/16290369?s=200&v=4","description":"<p>CloudLinux is looking for a brilliant&nbsp;<strong>Senior Site Reliability Engineer (SRE)</strong>&nbsp;to join the&nbsp;<strong>Release Engineering Department</strong>, a team that plays a critical role in maintaining both external and internal infrastructure related to package repositories, with a strong focus on delivering and managing repository distribution to users. </p><p>This role offers a unique opportunity to collaborate with multiple development teams, accelerate progress, and provide enterprise-level solutions globally. Responsibilities include Linux OS administration, designing system solutions at an architectural level, advancing cloud technologies, system programming, Python/Linux scripting, and working with virtualization. This is a remote position best suited for professionals located in Europe and CIS, as the team primarily operates within European time zones.</p><p></p><p><strong>As our Senior Site Reliability Engineer, you will:</strong></p><ul> <li>Design, implement, and manage scalable, resilient, and secure wide company repository infrastructure for CloudLinux products as a first assignment.</li> <li>Automate software operations for re-usability and consistency across private and public clouds, taking into consideration the complexities of distributed systems.</li> <li>Monitor system performance and troubleshoot issues proactively to ensure optimal uptime and reliability.</li> <li>Automate deployment processes using Infrastructure as Code (IaC) principles.</li> <li>Share your experience, know-how, and best practices with other team members in design sessions, system architecture discussions, mentorship, and \"doing work together\".</li> </ul><p><strong>Requirements</strong></p><p><strong>To be successful, you should have:</strong></p><ul> <li>Strong background in development: an ideal candidate had started a career as a developer, then rolled to infrastructure-based projects on a large scale.&nbsp;</li> <li>Proven experience as a leading SRE or in a similar role, with a strong focus on Linux environments.</li> <li>Proficiency in modern agile SDLC practices and principles, orchestration, and CI/CD tooling i.e. Python, Java, Terraform, Ansible, Cloudformation, Puppet, Chef, or similar.</li> <li>Knowledge of the Grafana ecosystem or similar, building dashboards, alert rules, PromQL, as well as frontend observability.</li> <li>Excellent technical knowledge of IT Infrastructure, including network and application load balancers, switches, routers, and IP addressing.</li> <li>Strong analytical and problem-solving skills with a focus on root cause analysis and mitigation.</li> <li>Excellent communication and teamwork skills with the ability to collaborate effectively across engineering teams.</li> <li>English: at least Intermediate level required.</li> </ul><p><strong>Benefits</strong></p><p><strong>What's in it for you?</strong></p><ul> <li>A focus on professional development.</li> <li>Interesting and challenging projects.</li> <li>Fully remote work with flexible working hours, that allows you to schedule your day and work from any location worldwide.</li> <li>Paid 24 days of vacation per year, 10 days of national holidays, and unlimited sick leaves.</li> <li>Compensation for private medical insurance.</li> <li>Co-working and gym/sports reimbursement.</li> <li>Budget for education.</li> <li>The opportunity to receive a reward for the most innovative idea that the company can patent.</li> </ul><p></p><p><em>By applying for this position, you consent to the processing of your personal data as described in our Privacy Policy (</em><a href=\"https://cloudlinux.com/candidate-privacy-notice\" target=\"_blank\" rel=\"nofollow noreferrer noopener\" class=\"external\"><em>https://cloudlinux.com/candidate-privacy-notice</em></a><em>), which provides detailed information on how we maintain and handle your data.</em></p>","tags":"[\"engineering\"]","pubDate":"2025-03-11T00:00:00.000Z","link":"https://apply.workable.com/j/70F2AF1366","slug":"senior-site-reliability-engineer-sre-for-release-engineering-remote-only-cloudlinux-9499"},{"id":9278298579,"title":"Senior Site Reliability Engineer (SRE) for Release Engineering (remote-only)","company":"CloudLinux","image":"https://avatars.githubusercontent.com/u/16290369?s=200&v=4","description":"<p>CloudLinux is looking for a brilliant&nbsp;<strong>Senior Site Reliability Engineer (SRE)</strong>&nbsp;to join the&nbsp;<strong>Release Engineering Department</strong>, a team that plays a critical role in maintaining both external and internal infrastructure related to package repositories, with a strong focus on delivering and managing repository distribution to users. </p><p>This role offers a unique opportunity to collaborate with multiple development teams, accelerate progress, and provide enterprise-level solutions globally. Responsibilities include Linux OS administration, designing system solutions at an architectural level, advancing cloud technologies, system programming, Python/Linux scripting, and working with virtualization. This is a remote position best suited for professionals located in Europe and CIS, as the team primarily operates within European time zones.</p><p></p><p><strong>As our Senior Site Reliability Engineer, you will:</strong></p><ul> <li>Design, implement, and manage scalable, resilient, and secure wide company repository infrastructure for CloudLinux products as a first assignment.</li> <li>Automate software operations for re-usability and consistency across private and public clouds, taking into consideration the complexities of distributed systems.</li> <li>Monitor system performance and troubleshoot issues proactively to ensure optimal uptime and reliability.</li> <li>Automate deployment processes using Infrastructure as Code (IaC) principles.</li> <li>Share your experience, know-how, and best practices with other team members in design sessions, system architecture discussions, mentorship, and \"doing work together\".</li> </ul><p><strong>Requirements</strong></p><p><strong>To be successful, you should have:</strong></p><ul> <li>Strong background in development: an ideal candidate had started a career as a developer, then rolled to infrastructure-based projects on a large scale.&nbsp;</li> <li>Proven experience as a leading SRE or in a similar role, with a strong focus on Linux environments.</li> <li>Proficiency in modern agile SDLC practices and principles, orchestration, and CI/CD tooling i.e. Python, Java, Terraform, Ansible, Cloudformation, Puppet, Chef, or similar.</li> <li>Knowledge of the Grafana ecosystem or similar, building dashboards, alert rules, PromQL, as well as frontend observability.</li> <li>Excellent technical knowledge of IT Infrastructure, including network and application load balancers, switches, routers, and IP addressing.</li> <li>Strong analytical and problem-solving skills with a focus on root cause analysis and mitigation.</li> <li>Excellent communication and teamwork skills with the ability to collaborate effectively across engineering teams.</li> <li>English: at least Intermediate level required.</li> </ul><p><strong>Benefits</strong></p><p><strong>What's in it for you?</strong></p><ul> <li>A focus on professional development.</li> <li>Interesting and challenging projects.</li> <li>Fully remote work with flexible working hours, that allows you to schedule your day and work from any location worldwide.</li> <li>Paid 24 days of vacation per year, 10 days of national holidays, and unlimited sick leaves.</li> <li>Compensation for private medical insurance.</li> <li>Co-working and gym/sports reimbursement.</li> <li>Budget for education.</li> <li>The opportunity to receive a reward for the most innovative idea that the company can patent.</li> </ul><p></p><p><em>By applying for this position, you consent to the processing of your personal data as described in our Privacy Policy (</em><a href=\"https://cloudlinux.com/candidate-privacy-notice\" target=\"_blank\" rel=\"nofollow noreferrer noopener\" class=\"external\"><em>https://cloudlinux.com/candidate-privacy-notice</em></a><em>), which provides detailed information on how we maintain and handle your data.</em></p>","tags":"[\"engineering\"]","pubDate":"2025-03-11T00:00:00.000Z","link":"https://apply.workable.com/j/70F2AF1366","slug":"senior-site-reliability-engineer-sre-for-release-engineering-remote-only-cloudlinux-1420"},{"id":4270212070,"title":"Senior Site Reliability Engineer (SRE) for Release Engineering (remote-only)","company":"CloudLinux","image":"https://avatars.githubusercontent.com/u/16290369?s=200&v=4","description":"<p>CloudLinux is looking for a brilliant&nbsp;<strong>Senior Site Reliability Engineer (SRE)</strong>&nbsp;to join the&nbsp;<strong>Release Engineering Department</strong>, a team that plays a critical role in maintaining both external and internal infrastructure related to package repositories, with a strong focus on delivering and managing repository distribution to users. </p><p>This role offers a unique opportunity to collaborate with multiple development teams, accelerate progress, and provide enterprise-level solutions globally. Responsibilities include Linux OS administration, designing system solutions at an architectural level, advancing cloud technologies, system programming, Python/Linux scripting, and working with virtualization. This is a remote position best suited for professionals located in Europe and CIS, as the team primarily operates within European time zones.</p><p></p><p><strong>As our Senior Site Reliability Engineer, you will:</strong></p><ul> <li>Design, implement, and manage scalable, resilient, and secure wide company repository infrastructure for CloudLinux products as a first assignment.</li> <li>Automate software operations for re-usability and consistency across private and public clouds, taking into consideration the complexities of distributed systems.</li> <li>Monitor system performance and troubleshoot issues proactively to ensure optimal uptime and reliability.</li> <li>Automate deployment processes using Infrastructure as Code (IaC) principles.</li> <li>Share your experience, know-how, and best practices with other team members in design sessions, system architecture discussions, mentorship, and \"doing work together\".</li> </ul><p><strong>Requirements</strong></p><p><strong>To be successful, you should have:</strong></p><ul> <li>Strong background in development: an ideal candidate had started a career as a developer, then rolled to infrastructure-based projects on a large scale.&nbsp;</li> <li>Proven experience as a leading SRE or in a similar role, with a strong focus on Linux environments.</li> <li>Proficiency in modern agile SDLC practices and principles, orchestration, and CI/CD tooling i.e. Python, Java, Terraform, Ansible, Cloudformation, Puppet, Chef, or similar.</li> <li>Knowledge of the Grafana ecosystem or similar, building dashboards, alert rules, PromQL, as well as frontend observability.</li> <li>Excellent technical knowledge of IT Infrastructure, including network and application load balancers, switches, routers, and IP addressing.</li> <li>Strong analytical and problem-solving skills with a focus on root cause analysis and mitigation.</li> <li>Excellent communication and teamwork skills with the ability to collaborate effectively across engineering teams.</li> <li>English: at least Intermediate level required.</li> </ul><p><strong>Benefits</strong></p><p><strong>What's in it for you?</strong></p><ul> <li>A focus on professional development.</li> <li>Interesting and challenging projects.</li> <li>Fully remote work with flexible working hours, that allows you to schedule your day and work from any location worldwide.</li> <li>Paid 24 days of vacation per year, 10 days of national holidays, and unlimited sick leaves.</li> <li>Compensation for private medical insurance.</li> <li>Co-working and gym/sports reimbursement.</li> <li>Budget for education.</li> <li>The opportunity to receive a reward for the most innovative idea that the company can patent.</li> </ul><p></p><p><em>By applying for this position, you consent to the processing of your personal data as described in our Privacy Policy (</em><a href=\"https://cloudlinux.com/candidate-privacy-notice\" target=\"_blank\" rel=\"nofollow noreferrer noopener\" class=\"external\"><em>https://cloudlinux.com/candidate-privacy-notice</em></a><em>), which provides detailed information on how we maintain and handle your data.</em></p>","tags":"[\"engineering\"]","pubDate":"2025-03-11T00:00:00.000Z","link":"https://apply.workable.com/j/70F2AF1366","slug":"senior-site-reliability-engineer-sre-for-release-engineering-remote-only-cloudlinux-7817"},{"id":9300882728,"title":"Senior Site Reliability Engineer (SRE) for Release Engineering (remote-only)","company":"CloudLinux","image":"https://avatars.githubusercontent.com/u/16290369?s=200&v=4","description":"<p>CloudLinux is looking for a brilliant&nbsp;<strong>Senior Site Reliability Engineer (SRE)</strong>&nbsp;to join the&nbsp;<strong>Release Engineering Department</strong>, a team that plays a critical role in maintaining both external and internal infrastructure related to package repositories, with a strong focus on delivering and managing repository distribution to users. </p><p>This role offers a unique opportunity to collaborate with multiple development teams, accelerate progress, and provide enterprise-level solutions globally. Responsibilities include Linux OS administration, designing system solutions at an architectural level, advancing cloud technologies, system programming, Python/Linux scripting, and working with virtualization. This is a remote position best suited for professionals located in Europe and CIS, as the team primarily operates within European time zones.</p><p></p><p><strong>As our Senior Site Reliability Engineer, you will:</strong></p><ul> <li>Design, implement, and manage scalable, resilient, and secure wide company repository infrastructure for CloudLinux products as a first assignment.</li> <li>Automate software operations for re-usability and consistency across private and public clouds, taking into consideration the complexities of distributed systems.</li> <li>Monitor system performance and troubleshoot issues proactively to ensure optimal uptime and reliability.</li> <li>Automate deployment processes using Infrastructure as Code (IaC) principles.</li> <li>Share your experience, know-how, and best practices with other team members in design sessions, system architecture discussions, mentorship, and \"doing work together\".</li> </ul><p><strong>Requirements</strong></p><p><strong>To be successful, you should have:</strong></p><ul> <li>Strong background in development: an ideal candidate had started a career as a developer, then rolled to infrastructure-based projects on a large scale.&nbsp;</li> <li>Proven experience as a leading SRE or in a similar role, with a strong focus on Linux environments.</li> <li>Proficiency in modern agile SDLC practices and principles, orchestration, and CI/CD tooling i.e. Python, Java, Terraform, Ansible, Cloudformation, Puppet, Chef, or similar.</li> <li>Knowledge of the Grafana ecosystem or similar, building dashboards, alert rules, PromQL, as well as frontend observability.</li> <li>Excellent technical knowledge of IT Infrastructure, including network and application load balancers, switches, routers, and IP addressing.</li> <li>Strong analytical and problem-solving skills with a focus on root cause analysis and mitigation.</li> <li>Excellent communication and teamwork skills with the ability to collaborate effectively across engineering teams.</li> <li>English: at least Intermediate level required.</li> </ul><p><strong>Benefits</strong></p><p><strong>What's in it for you?</strong></p><ul> <li>A focus on professional development.</li> <li>Interesting and challenging projects.</li> <li>Fully remote work with flexible working hours, that allows you to schedule your day and work from any location worldwide.</li> <li>Paid 24 days of vacation per year, 10 days of national holidays, and unlimited sick leaves.</li> <li>Compensation for private medical insurance.</li> <li>Co-working and gym/sports reimbursement.</li> <li>Budget for education.</li> <li>The opportunity to receive a reward for the most innovative idea that the company can patent.</li> </ul><p></p><p><em>By applying for this position, you consent to the processing of your personal data as described in our Privacy Policy (</em><a href=\"https://cloudlinux.com/candidate-privacy-notice\" target=\"_blank\" rel=\"nofollow noreferrer noopener\" class=\"external\"><em>https://cloudlinux.com/candidate-privacy-notice</em></a><em>), which provides detailed information on how we maintain and handle your data.</em></p>","tags":"[\"engineering\"]","pubDate":"2025-03-11T00:00:00.000Z","link":"https://apply.workable.com/j/70F2AF1366","slug":"senior-site-reliability-engineer-sre-for-release-engineering-remote-only-cloudlinux-9922"},{"id":9773072311,"title":"Senior Analytics Engineer","company":"Genie AI","image":"https://remotive.com/job/1982807/logo","description":"<ul style=\"\">\n<li style=\"\">\n<p dir=\"ltr\">Transform how the legal industry operates with the way you use our data</p>\n</li>\n<li style=\"\">\n<p dir=\"ltr\">Building all your own pipes, transformations and flows - working with a modern data stack of your choice (inc. dbt) to transform data into business value</p>\n</li>\n<li style=\"\">\n<p dir=\"ltr\">Autonomously work from deep data analysis to providing strategic, commercial and customer insights</p>\n</li>\n</ul>\n<p> </p>\n<div class=\"h3\"><strong>Your purpose in our mission</strong></div>\n<p dir=\"ltr\">We’ve raised $17.8 million in Series A funding led by Google Ventures and joined by Khosla Ventures. They believe in our vision that the law should be accessible to everyone. We need you to enable a self-service data culture where teams can access insights independently.</p>\n<div class=\"h3\"><strong>Your manager and team</strong></div>\n<p dir=\"ltr\">Our org structure is made up of pods with distinct areas of focus to keep us all working on the most impactful things for our customers all of the time. Some of our team members work across multiple pods. Our structure was conceived with impact, autonomy and velocity in mind and we'd love to share more with you throughout our interview process. Initially reporting to Alex Denne, our Head of Growth (PLG), you’ll be empowered to elevate Genie through the power of data. Both Alex and Nitish, our Co-Founder &amp; CTO will collaborate with you and enable you when you need them to, and will inspire you to push yourself outside your comfort zone.</p>\n<p> </p>\n<div class=\"h3\"><strong>This is what you’ll be doing</strong></div>\n<p dir=\"ltr\">As a Senior Analytics Engineer at Genie AI you’ll get the chance to immerse yourself within the world of law, legal contracts and AI at a fast paced and autonomous start up. We’re big enough to disrupt the legaltech industry, but small enough that you can make a massive impact on the team. Some of your key day to day duties will include:</p>\n<p dir=\"ltr\"> </p>\n<p> </p>\n<ul style=\"\">\n<li dir=\"ltr\" style=\"\">\n<p dir=\"ltr\">Design, build, and maintain the data models which power business insights</p>\n</li>\n<li dir=\"ltr\" style=\"\">\n<p dir=\"ltr\">Develop metrics frameworks and dimensions that standardize how we measure business performance</p>\n</li>\n<li dir=\"ltr\" style=\"\">\n<p dir=\"ltr\">Work with stakeholders across marketing, sales, product, and operations and machine learning to translate business questions into data solutions</p>\n</li>\n<li dir=\"ltr\" style=\"\">\n<p dir=\"ltr\">Enable key stakeholders to share and present data insights across the business</p>\n</li>\n<li dir=\"ltr\" style=\"\">\n<p dir=\"ltr\">Enabling robust experimental results that removes opinion from discussion - this will ensure high impact growth / work is done</p>\n</li>\n<li dir=\"ltr\" style=\"\">\n<p dir=\"ltr\">Build and maintain a semantic layer that makes data accessible to non-technical users</p>\n</li>\n<li dir=\"ltr\" style=\"\">\n<p dir=\"ltr\">Create documentation and training to enable self-service analytics across teams</p>\n</li>\n<li dir=\"ltr\" style=\"\">\n<p dir=\"ltr\">Implement and maintain dbt models that transform our raw data into reliable, tested datasets</p>\n</li>\n<li dir=\"ltr\" style=\"\">\n<p dir=\"ltr\">Help establish data governance and quality practices as we scale</p>\n</li>\n</ul>\n<div class=\"h3\"><br><strong>This is how we’ll set you up for success and the outcomes we expect from you</strong></div>\n<p dir=\"ltr\">Over your first 90 days you can expect us to help point you in the right direction to set you up for success. During the interview process we can talk you through a high level overview of your 90 day plan. </p>\n<div class=\"h5\">By the end of your first three months we expect you to be:</div>\n<ul style=\"\">\n<li style=\"\"><strong>Month 1:</strong> Understand business needs, audit data sources (Mixpanel, Segment, MongoDB, BQ etc.), map stakeholder requirements and develop a roadmap towards a simple but modern data stack. You’ll create a few high-value dashboards by working and playing with the data we already have.</li>\n</ul>\n<div> </div>\n<ul style=\"\">\n<li style=\"\"><strong>Month 2:</strong> Implement core data models in BigQuery (probably) or Snowflake/Databricks, creating initial dashboards, establish a metrics framework, and set up dbt transformations for key entities.</li>\n</ul>\n<div> </div>\n<ul style=\"\">\n<li style=\"\"><strong>Month 3:</strong> Enable self-service analytics, implement automated reverse ETL for marketing activation campaigns, refine dashboards based on feedback, and deliver actionable insights to growth, sales, finance and product stakeholders.</li>\n</ul>\n<p> </p>\n<p dir=\"ltr\"> </p>\n<p> </p>\n<div class=\"h5\">We’ll continually develop and measure success on the below criteria:</div>\n<p> </p>\n<p dir=\"ltr\"> </p>\n<p> </p>\n<ul style=\"\">\n<li dir=\"ltr\" style=\"\">\n<p dir=\"ltr\"><strong>Insight Activation</strong>: Business decisions across growth, product, sales and strategy are consistently made using data from our analytics platform</p>\n</li>\n<li dir=\"ltr\" style=\"\">\n<p dir=\"ltr\"><strong>Self-Service Analytics</strong>: Teams can answer their own data questions without your involvement using well-designed dashboards and data models</p>\n</li>\n<li dir=\"ltr\" style=\"\">\n<p dir=\"ltr\"><strong>Single Customer View</strong>: Creation of a unified customer data model that connects behavior across platforms and enables personalization within both growth and marketing comms, and product/ML via AI</p>\n</li>\n<li dir=\"ltr\" style=\"\">\n<p dir=\"ltr\"><strong>Metrics Standardization</strong>: Core business metrics are clearly defined, documented, and consistently calculated across the company (grey areas are known to everyone)</p>\n</li>\n<li dir=\"ltr\" style=\"\">\n<p dir=\"ltr\"><strong>Data Culture</strong>: Increased use of data in decision-making, with more teams requesting access to and using analytics tools</p>\n</li>\n<li style=\"\">\n<p><strong>Technical Foundation</strong>: Implementation of a sustainable, documented modern data stack that can evolve with our business needs</p>\n<p dir=\"ltr\"> </p>\n</li>\n</ul>\n<p>We are a start up in an exceptionally dynamic stage of our growth. We are a customer and employee led organisation. What this means is that we adapt to our customers' needs, and the problems we’re solving today could be very different in six months, or even by the end of this recruitment process. We also listen to our team as we empower you to have full autonomy of your role - you're the expert. You should expect to work with us on how your role develops, grows and changes throughout your time at Genie.</p>\n<div class=\"h3\"><strong>It can be tough here because</strong></div>\n<ul style=\"\">\n<li dir=\"ltr\" style=\"\">\n<p dir=\"ltr\">We don’t structure your work for you. We give you the <em>what</em> and you come up with the how</p>\n</li>\n<li dir=\"ltr\" style=\"\">\n<p dir=\"ltr\">We don’t try to get things perfect the first time. We get things to ‘good enough’, and then we continuously iterate</p>\n</li>\n<li dir=\"ltr\" style=\"\">\n<p dir=\"ltr\">This is a generalist analytics role - we need you to be good at a lot of data areas rather than specialising in one</p>\n</li>\n</ul>\n<div class=\"h3\"><strong>But we think you’ll love</strong></div>\n<ul style=\"\">\n<li dir=\"ltr\" style=\"\">\n<p dir=\"ltr\">The autonomy and trust we give you to deliver your best work</p>\n</li>\n<li dir=\"ltr\" style=\"\">\n<p dir=\"ltr\">Learning from some of the brightest minds in the field of AI</p>\n</li>\n<li dir=\"ltr\" style=\"\">\n<p dir=\"ltr\">The exhilaration of a fast pace start up</p>\n</li>\n</ul>\n<div class=\"h3\"><strong> </strong></div>\n<div class=\"h3\"><strong>The skills you need to succeed in this role</strong></div>\n<p dir=\"ltr\"><strong>The ideal candidate will have 5 years+ experience and:</strong></p>\n<ul style=\"\">\n<li dir=\"ltr\" style=\"\">\n<p dir=\"ltr\"><strong>Advanced SQL: </strong>Expert-level SQL for complex data modeling and transformation</p>\n</li>\n<li dir=\"ltr\" style=\"\">\n<p dir=\"ltr\"><strong>Data modeling/transformation</strong>: Strong experience with dbt for transforming raw data into analytics-ready datasets</p>\n</li>\n<li dir=\"ltr\" style=\"\">\n<p dir=\"ltr\"><strong>Cloud data warehouses</strong>: Experience with BigQuery (preferred) or Snowflake/Redshift</p>\n</li>\n<li dir=\"ltr\" style=\"\">\n<p dir=\"ltr\"><strong>Business communication</strong>: Proven ability to translate data insights into business outcomes</p>\n</li>\n<li dir=\"ltr\" style=\"\">\n<p dir=\"ltr\"><strong>Data visualization</strong>: Experience creating intuitive dashboards that tell clear data stories</p>\n</li>\n<li dir=\"ltr\" style=\"\">\n<p dir=\"ltr\"><strong>BI tools:</strong> Proficiency with modern tools like Looker, Holistics, PowerBI or Tableau</p>\n</li>\n<li dir=\"ltr\" style=\"\">\n<p dir=\"ltr\"><strong>Metrics definition</strong>: Experience defining standardized business metrics and dimensions</p>\n</li>\n<li dir=\"ltr\" style=\"\">\n<p dir=\"ltr\"><strong>Python</strong>: Basic programming skills for data transformation and analysis</p>\n</li>\n<li dir=\"ltr\" style=\"\">\n<p dir=\"ltr\"><strong>Version control</strong>: Experience with Git for managing data transformation code</p>\n</li>\n<li dir=\"ltr\" style=\"\">\n<p dir=\"ltr\"><strong>Product Analytics</strong>: Experience with tools like Segment, Snowplow, Mixpanel or Amplitude</p>\n</li>\n</ul>\n<p dir=\"ltr\"><strong>Nice to have:</strong></p>\n<ul style=\"\">\n<li dir=\"ltr\" style=\"\">\n<p dir=\"ltr\"><strong>Cloud platforms</strong>: Familiarity with GCP (preferred) or AWS services</p>\n</li>\n<li dir=\"ltr\" style=\"\">\n<p dir=\"ltr\"><strong>Data quality</strong>: Experience with testing and validating data transformations</p>\n</li>\n<li dir=\"ltr\" style=\"\">\n<p dir=\"ltr\"><strong>ETL/ELT tools</strong>: Familiarity with tools like Fivetran or Stitch</p>\n</li>\n<li dir=\"ltr\" style=\"\">\n<p dir=\"ltr\"><strong>Reverse ETL</strong>: Understanding of how to activate data in marketing tools</p>\n</li>\n</ul>\n<p dir=\"ltr\"><em>(Don’t worry about ticking every single box on the list to be considered for this role.)</em></p>\n<p dir=\"ltr\"><strong>The data challenges we'll solve together</strong></p>\n<p dir=\"ltr\">We're excited to discuss with you the specific data problems we're working to solve – from unifying user journey data across multiple touchpoints to creating actionable customer segments that drive growth.</p>\n<p dir=\"ltr\">You'll help us answer questions like:</p>\n<ul style=\"\">\n<li dir=\"ltr\" style=\"\">\n<p dir=\"ltr\">What behaviors predict our highest-value customers?</p>\n</li>\n<li dir=\"ltr\" style=\"\">\n<p dir=\"ltr\">How do we measure product adoption across 120,000+ companies and a range of AI features?</p>\n</li>\n<li dir=\"ltr\" style=\"\">\n<p dir=\"ltr\">What engagement patterns lead to contract renewals?</p>\n</li>\n</ul>\n<p dir=\"ltr\">You'll work with data from Mixpanel, MongoDB, Segment, Stripe and more to build a unified view that powers everything from marketing campaigns to product decisions.</p>\n<p dir=\"ltr\">This role offers the rare opportunity to shape our entire data strategy while delivering immediate business impact. We'd love to dive deeper into these challenges with you during our conversations.</p>\n<p dir=\"ltr\"><em> </em></p>\n<div class=\"h3\"><strong>Unleash your magic: our interview process</strong></div>\n<ul style=\"\">\n<li style=\"\">\n<p dir=\"ltr\"><strong>Step 1:</strong> Meet our Talent Acquisition Lead, Char, to assess your motivations and baseline skills</p>\n</li>\n<li style=\"\">\n<p dir=\"ltr\"><strong>Step 2:</strong> Complete our take home task</p>\n</li>\n<li style=\"\">\n<p dir=\"ltr\"><strong>Step 3:</strong> Business / Analytics interview with Alex Denne (our Head of Growth) and Rafie Faruq (our Co-Founder &amp; CEO)</p>\n</li>\n<li style=\"\">\n<p dir=\"ltr\"><strong>Step 4: </strong>Engineering interview with Nitish Mutha (our Co-founder &amp; CEO) and Emile Joubert (our Snr Software Engineer - Machine Learning)</p>\n</li>\n<li style=\"\">\n<p dir=\"ltr\"><strong>Step 5: </strong>Culture interview with Char (Talent Acquisition Lead) and Rosie Dent-Spargo (our Product Design Lead)</p>\n</li>\n<li style=\"\">\n<p dir=\"ltr\">For Lead level roles and above, we collect blind references to set you up for success. These insights help us ensure a smooth transition into our team and foster meaningful collaboration between you and your manager from day one.</p>\n</li>\n</ul>\n<p dir=\"ltr\">We can’t wait to meet you! Bring your authentic self, and get ready to explore our culture, team events, and big mission. We're excited to discover what makes you and us unique. </p>\n<div class=\"h3\"><strong>Our benefits</strong></div>\n<p dir=\"ltr\">Here’s just some of the benefits you can look forward to when you enter the Genie’s lamp:</p>\n<ul style=\"\">\n<li style=\"\">\n<p dir=\"ltr\"><strong>Generous Stock Options:</strong> We want all our genies to share in our success </p>\n</li>\n<li style=\"\">\n<p dir=\"ltr\"><strong>Private healthcare: </strong>To help keep you fit as a fiddle</p>\n</li>\n<li style=\"\">\n<p dir=\"ltr\"><strong>Fully Remote Working:</strong> Work from anywhere your heart desires </p>\n</li>\n<li style=\"\">\n<p dir=\"ltr\"><strong>Unlimited book budget</strong>: Dive into an unlimited budget for business, law, or technology books</p>\n</li>\n<li style=\"\">\n<p dir=\"ltr\"><strong>Home Office Setup:</strong> Equip your home office with the best – a top-of-the-range laptop, monitor, wireless keyboard, mouse, and a comfortable office chair. Your workspace will be as splendid as a royal palace</p>\n</li>\n<li style=\"\">\n<p dir=\"ltr\"><strong>Learning and Development Budget:</strong> Each Genie gets an individual £500 L&amp;D budget annually, plus five days off for any job specific learning adventures</p>\n</li>\n<li style=\"\">\n<p dir=\"ltr\"><strong>Unlimited Holiday:</strong> Take as much time off as you need to recharge your batteries</p>\n</li>\n<li style=\"\">\n<p dir=\"ltr\"><strong>Parental Leave:</strong> Both genie parents get enhanced leave to welcome their little genies into the world</p>\n</li>\n<li style=\"\">\n<p dir=\"ltr\"><strong>Free access to Genie:</strong> For you to create, negotiate and collaborate on legal documents in real time on one platform!</p>\n</li>\n</ul>\n<div class=\"h4\" dir=\"ltr\"> </div>\n<div class=\"h3\"><strong>About Genie AI</strong></div>\n<p dir=\"ltr\">Genie AI is a machine learning startup with a mission to enable everyone to draft quality legal documents. We're shaking up the legal world and flipping the business model on its head!</p>\n<p dir=\"ltr\">Think of what GitHub did with open source code, Instagram and TikTok with entertainment, Airbnb with hospitality, and Uber with travel – Genie AI is doing that with legal contracts. We're conjuring up a community-based AI law platform that'll change the game. Join us, and let’s make some legal magic together!</p>\n<ul style=\"\">\n<li style=\"\">\n<p dir=\"ltr\">100,000 companies use Genie AI today - we’ve been growing exponentially!</p>\n</li>\n<li style=\"\">\n<p dir=\"ltr\">We’re funded by the world’s top investors, with significant runway - and we’re growing the team</p>\n</li>\n<li style=\"\">\n<p dir=\"ltr\">We’ve collaborated with Oxford University and Imperial College London to co-author research papers on explainable AI</p>\n</li>\n<li style=\"\">\n<p dir=\"ltr\">According to Forbes, we're also rated one of the top 29 AI startups in the UK</p>\n</li>\n<li style=\"\">\n<p dir=\"ltr\">We're a Sunday Times Best Places to Work Award Winner 2024 </p>\n</li>\n<li style=\"\">\n<p dir=\"ltr\">We’re backed by top legal pedigree, from Lord Neuberger to representing the UK on multiple Ministry of Justice trade missions</p>\n</li>\n<li style=\"\">\n<p dir=\"ltr\">Our customers save on average £15,000 on legal fees per year with Genie</p>\n</li>\n<li style=\"\">\n<p dir=\"ltr\">This isn’t just a SaaS product - we’re redefining the business model of law</p>\n</li>\n</ul>\n<div> </div>\n<p dir=\"ltr\"><strong>Ready to grant wishes and disrupt a £750bn industry? Click apply and join us in creating a world of digital wonders!</strong></p>\n<p dir=\"ltr\"><em>At Genie, we’re committed to creating a diverse environment. Whilst we’re on the cutting edge of innovation, it’s all about the people. We embrace differences and hire based on merit, giving equal consideration to all applications, regardless of gender, background and race.</em></p>\n<p dir=\"ltr\"><em><strong>If you would like to subscribe to be notified of future job openings matching your interests and preferences please click </strong><strong><a href=\"https://careers.genieai.co/connect\" rel=\"nofollow\" target=\"_blank\">here</a></strong><br></em></p>\n<p> </p>\n<img src=\"https://remotive.com/job/track/1982807/blank.gif?source=public_api\" alt=\"\"/>","tags":"[\"data visualization\"]","pubDate":"2025-03-10T21:50:57.000Z","link":"https://remotive.com/remote-jobs/data/senior-analytics-engineer-1982807","slug":"senior-analytics-engineer-genie-ai-9988"},{"id":5442008003,"title":"Advancement Communications Lead","company":"Wikimedia Foundation","image":"https://remotive.com/job/1982374/logo","description":"<p><strong>ADVANCEMENT COMMUNICATIONS LEAD</strong></p>\n<p><strong>Summary</strong></p>\n<p>The Wikimedia Foundation is looking for an Advancement Communications Lead to provide proficient and dynamic communications as part of the Advancement department. Reporting to and collaborating closely with the Planning and Communications Manager of Advancement, you will develop communication material such as briefing documents and talking points, supporting the development of speeches, ghostwriting blogs, and other written materials. These will be on behalf of the Chief Advancement Officer, for internal and public consumption. As a key member of the Advancement team, you will be responsible for crafting and delivering strategic announcements and key updates across various media platforms. You will collaborate with multiple teams to ensure consistent and engaging messaging that aligns with the Foundation's annual plan and its overarching strategies. You will also actively support the Chief Advancement Officer and other senior leadership in developing and maintaining strong relationships with Board members.</p>\n<p><strong>Key Responsibilities:</strong></p>\n<ul style=\"\">\n<li style=\"\">Conduct in-depth research on relevant topics and their associated dependencies to create executive-level communications.</li>\n<li style=\"\">Develop weekly departmental communications/newsletters.</li>\n<li style=\"\">Clearly articulate and present organizational strategies for understanding across a diversified team.</li>\n<li style=\"\">Create compelling thought leadership pieces in various formats including personal narratives and organizational initiatives.</li>\n<li style=\"\">Develop a strong understanding of various stakeholder audiences, analyze their priorities, and effectively tailor communications to share insights in a way that resonates with each group.</li>\n<li style=\"\">Work closely with your manager to develop and maintain materials for the Wikimedia Endowment Board, including presentations, full board meeting materials, committee reports, and governance documents.</li>\n<li style=\"\">Write, edit, and proofread content for multiple media platforms, including blog posts, newsletters, regulatory reports, and website updates.</li>\n<li style=\"\">Coordinate and collaborate closely with Communications department colleagues on messaging, developing materials, and ensure consistency across channels.</li>\n<li style=\"\">Champion, role model, and embed Wikimedia Foundation’s core values into your daily work.</li>\n</ul>\n<p><strong>Skills and experience:</strong></p>\n<ul style=\"\">\n<li style=\"\">Extensive experience in communications, journalism, or public relations, or in related roles developing communications strategies for a broad and diverse audience.</li>\n<li style=\"\">Excellent organizational skills with the ability to prioritize, adapt, and meet deadlines under pressure.</li>\n</ul>\n<p><strong>Qualities that are important to us: </strong></p>\n<ul style=\"\">\n<li style=\"\">Detail-oriented with a passion for writing, editing, and proofreading across various mediums.</li>\n<li style=\"\">Comfortable working in a fast-paced environment.</li>\n<li style=\"\">Curiosity and enthusiasm for research and information-gathering.</li>\n<li style=\"\">Skilled and creative writer who is excited about storytelling for a mission-driven organization.</li>\n<li style=\"\">A collaborative communicator who enjoys co-creating and partnering on communications initiatives—big and small. </li>\n<li style=\"\">Strong ability to work across cross-functional teams, volunteer communities, and external partners to advocate for Wikimedia’s mission.</li>\n<li style=\"\">Strong diplomatic and advisory skills to support the Chief Advancement Officer in crafting communications on a range of issues.</li>\n<li style=\"\">Adaptable and detail-oriented, with the ability to create and manage multiple narratives and communications campaigns simultaneously. </li>\n<li style=\"\">Strong time management skills, consistency,  preparation, and strategic prioritization of tasks. </li>\n<li style=\"\">A proactive leader who embraces both autonomy and collaboration while balancing both proactive and reactive communication needs.</li>\n</ul>\n<p><strong>Additionally, we’d love it if you have:</strong></p>\n<ul style=\"\">\n<li style=\"\">Experience working with senior leadership and boards is a plus.</li>\n<li style=\"\">Experience working on philanthropy and impact narratives, effectively telling the story of mission-driven impact and funding.</li>\n<li style=\"\">Experience in translating financial details into compelling narratives; a strong understanding of fundraising strategies and the ability to distill complex financial documents into clear talking points from them.</li>\n<li style=\"\">Strong understanding of various media platforms (blogs, internal newsletters, organization websites) and best practices for effective communication.</li>\n<li style=\"\">Experience with communication tools (Google Suite, Adobe Acrobat).</li>\n<li style=\"\">Experience working in an international organization with a globally distributed workforce.</li>\n</ul>\n<div class=\"h4\">About the Wikimedia Foundation</div>\n<p>The Wikimedia Foundation is the nonprofit organization that operates Wikipedia and the other Wikimedia free knowledge projects. Our vision is a world in which every single human can freely share in the sum of all knowledge. We believe that everyone has the potential to contribute something to our shared knowledge, and that everyone should be able to access that knowledge freely. We host Wikipedia and the Wikimedia projects, build software experiences for reading, contributing, and sharing Wikimedia content, support the volunteer communities and partners who make Wikimedia possible, and advocate for policies that enable Wikimedia and free knowledge to thrive. </p>\n<p>The Wikimedia Foundation is a charitable, not-for-profit organization that relies on donations. We receive donations from millions of individuals around the world, with an average donation of about $15. We also receive donations through institutional grants and gifts. The Wikimedia Foundation is a United States 501(c)(3) tax-exempt organization with offices in San Francisco, California, USA.</p>\n<p><em><strong>As an equal opportunity employer, the Wikimedia Foundation values having a diverse workforce and continuously strives to maintain an inclusive and equitable workplace. We encourage people with a diverse range of backgrounds to apply. We do not discriminate against any person based upon their race, traits historically associated with race, religion, color, national origin, sex, pregnancy or related medical conditions, parental status, sexual orientation, gender identity, gender expression, age, status as a protected veteran, status as an individual with a disability, genetic information, or any other legally protected characteristics.</strong></em></p>\n<p>The Wikimedia Foundation is a remote-first organization with staff members including contractors based 40+ countries<strong>*</strong>. Salaries at the Wikimedia Foundation are set in a way that is competitive, equitable, and consistent with our values and culture. The anticipated annual pay range of this position for applicants based within the United States is US$107,349 to US$161,894 with multiple individualized factors, including cost of living in the location, being the determinants of the offered pay. For applicants located outside of the US, the pay range will be adjusted to the country of hire. We neither ask for nor take into consideration the salary history of applicants. The compensation for a successful applicant will be based on their skills, experience and location. </p>\n<p><strong>*Please note that we are currently able to hire in the following countries: </strong>Australia, Austria, Bangladesh, Belgium, Brazil, Canada, Colombia, Costa Rica, Croatia, Czech Republic, Denmark, Egypt, Estonia, Finland, France, Germany, Ghana, Greece, India, Indonesia, Ireland, Israel, Italy, Kenya, Mexico, Netherlands, Nigeria, Peru, Poland, Singapore, South Africa, Spain, Sweden, Switzerland, Uganda, United Arab Emirates, United Kingdom, United States of America and Uruguay.  Our non-US employees are hired through a local third party Employer of Record (EOR). </p>\n<p>We periodically review this list to streamline to ensure alignment with our hiring requirements. </p>\n<p>All applicants can reach out to their recruiter to understand more about the specific pay range for their location during the interview process.</p>\n<p><em><strong>If you are a qualified applicant requiring assistance or an accommodation to complete any step of the application process due to a disability, you may contact us at recruiting@wikimedia.org or +1 (415) 839-6885.</strong></em></p>\n<p><strong>More information</strong></p>\n<p><a href=\"%22https:/wikimediafoundation.org/about/jobs/#section-12%22\" rel=\"nofollow\"><strong>U.S. Benefits &amp; Perks</strong></a></p>\n<p><a href=\"%22https:/foundation.wikimedia.org/wiki/Applicant_privacy_policy%22\" rel=\"nofollow\"><strong>Applicant Privacy Policy</strong></a></p>\n<p><a href=\"%22https:/wikimediafoundation.org/%22\" rel=\"nofollow\"><strong>Wikimedia Foundation</strong></a></p>\n<p><a href=\"%22https:/www.youtube.com/watch?v=8mvPYF_erNA&amp;list=PLVx9pX-VnGVh9Akb-O-SAKZ-GDTVTHZqS&amp;index=8%22\" rel=\"nofollow\"><strong>What does the Wikimedia Foundation do?</strong></a></p>\n<p><a href=\"%22https:/www.youtube.com/watch?v=7gATwhhGrPk&amp;list=PLVx9pX-VnGVh9Akb-O-SAKZ-GDTVTHZqS&amp;index=1%22\" rel=\"nofollow\"><strong>What makes Wikipedia different from social media platforms?</strong></a></p>\n<p><a href=\"%22https:/wikimediafoundation.org/wiki/Our_projects%22\" rel=\"nofollow\"><strong>Our Projects</strong></a></p>\n<p><a href=\"%22https:/techblog.wikimedia.org/%22\" rel=\"nofollow\"><strong>Our Tech Stack</strong></a></p>\n<p><a href=\"%22https:/wikimediafoundation.org/news/%22\" rel=\"nofollow\"><strong>News from across the Wikimedia movement</strong></a></p>\n<p><a href=\"%22https:/diff.wikimedia.org/%22\" rel=\"nofollow\"><strong>Wikimedia Blog</strong></a></p>\n<p><a href=\"%22https:/meta.wikimedia.org/wiki/Strategy/Wikimedia_movement/2017%22\" rel=\"nofollow\"><strong>Wikimedia 2030</strong></a></p>\n<p> </p>\n<div id='\"l-content\"'> </div>\n<img src=\"https://remotive.com/job/track/1982374/blank.gif?source=public_api\" alt=\"\"/>","tags":"[\"research\",\"public relations\",\"editing\"]","pubDate":"2025-03-10T17:51:15.000Z","link":"https://remotive.com/remote-jobs/marketing/advancement-communications-lead-1982374","slug":"advancement-communications-lead-wikimedia-foundation-6913"},{"id":4709880148,"title":"Senior Software Engineer","company":"DNSfilter","image":"https://remotive.com/job/1980741/logo","description":"<div class='\"content-intro\"'>\n<p>At DNSFilter we are making workplaces more secure through protective DNS and advanced content filtering—and we need your help! We’ve come a long way over the past few years. In 2021 we had a successful $30 million Series A funding round, in 2022 we became the fastest DNS security tool on the planet and acquired the privacy-focused VPN Guardian, and in 2023 we extended our Series A by $15M and added more global points of presence to our anycast network! </p>\n<p>As we continue our product-fueled growth by adding new features and broadening our solution to meet the needs of the global market, it's clear there's a missing piece. That's where you come in!</p>\n</div>\n<p>We are looking for a Senior Software Engineer specializing in Go development. As a Senior Software Engineer, you will work as part of the team building the query processor servicing all the incoming traffic requests. Our query processors serve billions of DNS requests daily, playing a core role in our product.</p>\n<p>Eligible candidates have and can work successfully in a remote environment and are familiar with working in a fast-paced hyper-growth SaaS start-up. This is a full-time remote role working with globally distributed teams. It is open to candidates anywhere in the United States and Canada who can work ET hours M-F.</p>\n<p>We recognize that people come with a wealth of experience and talent beyond just the technical requirements of a job. If you feel like this job is for you, please apply. We believe diversity of experience and skills, including transferable skills, combined with passion is a key to innovation and excellence; therefore we encourage people from all backgrounds to apply to our positions!</p>\n<p> </p>\n<p><strong>At DNSFilter You Will: </strong></p>\n<ul style=\"\">\n<li style=\"\">Be a key member of the Engineering team</li>\n<li style=\"\">Build, modify and support applications implemented using languages such as Go &amp; Shell.</li>\n<li style=\"\">You will collaborate with cross-functional teams to define, design, and ship new features</li>\n<li style=\"\">You will contribute to the improvement of the development and deployment processes, ensuring that we continuously evolve to be better</li>\n<li style=\"\">You will demonstrate strong ownership of your projects to their delivery</li>\n<li style=\"\">Optimize software applications for maximum performance and efficiency, taking advantage of Go's concurrency capabilities, focusing on scalability and reliability</li>\n</ul>\n<p><strong><br>Requirements: </strong></p>\n<ul style=\"\">\n<li style=\"\">5+ years of recent experience as a Software Engineer developing and maintaining applications in Go</li>\n<li style=\"\">Experience working at a fast-paced hypergrowth SaaS company</li>\n<li style=\"\">Developed and maintained robust and scalable software solutions using the Go programming language, focusing on performance and reliability.</li>\n<li style=\"\">Strong experience and understanding of building highly resilient distributed systems and ensuring they have at least 5 9s uptime</li>\n<li style=\"\">Experience working with the open telemetry stack, including Prometheus</li>\n<li style=\"\">Knowledge of networking fundamentals and beyond (TCP/IP, DNS, HTTP/S)</li>\n<li style=\"\">Experience using Git or other code versioning tools</li>\n<li style=\"\">Knowledge and experience in all aspects of SDLC</li>\n<li style=\"\">Working knowledge of AWS and EKS</li>\n<li style=\"\">Experience working remotely under minimal supervision</li>\n<li style=\"\">Passion for product quality and attention to details</li>\n<li style=\"\">A strong commitment to collaborative work in a remote environment</li>\n<li style=\"\">The ability to keep work hours that overlap with 8 am - 12 pm EST timezone, M-F</li>\n</ul>\n<p><strong>Bonus points for: </strong></p>\n<ul style=\"\">\n<li style=\"\">Knowledge of other programming languages</li>\n<li style=\"\">Knowledge of continuous integration systems, including GitHub workflows and Makefiles</li>\n<li style=\"\">Experience with Kafka, Redis, and Relational databases</li>\n</ul>\n<div class='\"content-pay-transparency\"'>\n<div class='\"pay-input\"'>\n<div class='\"title\"'>U.S. hiring salary range</div>\n<div class='\"pay-range\"'>$135,000<span class='\"divider\"'>—</span>$170,000 USD</div>\n</div>\n</div>\n<div class='\"content-conclusion\"'>\n<p><strong>We Offer:</strong></p>\n<ul style=\"\">\n<li style=\"\">A 100% work-from-home position with a company that values and fosters personal and professional growth</li>\n<li style=\"\">Pathway to promotion to additional organizational positions and responsibilities based upon results and performance - not just time in the chair.  You help us grow, we will help you grow.</li>\n<li style=\"\">Passionate and intelligent colleagues who work hard and have a good time doing it</li>\n<li style=\"\">Flexible Fridays</li>\n<li style=\"\">Paid company-wide week off at the end of each year</li>\n<li style=\"\">Flexible Vacation policy</li>\n<li style=\"\">Awesome company swag</li>\n<li style=\"\">Home office buildout allowance</li>\n<li style=\"\">Medical, dental, and vision benefits for US, UK, and Canada based employees</li>\n<li style=\"\">Full short-term disability and life benefits; available long-term disability</li>\n<li style=\"\">Retirement savings account options with vested company matching for qualifying employees</li>\n<li style=\"\">In-person annual gatherings. Last time we all spent a week on a beach in Cancun!</li>\n</ul>\n<p><em>DNSFilter is a pay for performance organization, which means there is the opportunity to advance your compensation with performance over time. The hiring base pay is dependent upon many factors such as level, function, training, transferable skills, work experience, business needs, and/or geographic location. As a fully remote company, our compensation reflects the cost of labor across several U.S. and global geographic markets. We pay differently based on those defined markets. Our Talent Team can share more about the specific salary range for the job location during the hiring process.<br><br><strong>At DNSFilter, we utilize sophisticated software and tools to identify and eliminate Deepfake candidates. This approach helps us maintain the integrity of our hiring process, ensuring that we select the most qualified and genuine individuals to join our team.</strong><br></em></p>\n</div>\n<img src=\"https://remotive.com/job/track/1980741/blank.gif?source=public_api\" alt=\"\"/>","tags":"[\"AWS\",\"git\",\"go\",\"saas\",\"distributed systems\"]","pubDate":"2025-03-10T17:50:56.000Z","link":"https://remotive.com/remote-jobs/software-dev/senior-software-engineer-1980741","slug":"senior-software-engineer-dnsfilter-8846"}]