[{"id":9258516389,"title":"Technical Product Marketer (Remote/Europe)","company":"Collabora","image":"https://avatars.githubusercontent.com/u/4499761?s=200&v=4","description":"<div>We are seeking a highly motivated and tech-savvy Technical Product Marketer to join our growing team. In this key role, you will be responsible for translating complex technical information about our Open Source office suite into compelling and easily understandable messages that resonate with our target audience. </div><div><br></div><div>You will work closely with engineering, product management and sales teams to develop and execute content that drives adoption and understanding of how our product works.</div><div>We are seeking a highly motivated and tech-savvy Technical Product Marketer to join our growing team. In this key role, you will be responsible for translating complex technical information about our Open Source office suite into compelling and easily understandable messages that resonate with our target audience. </div><div><br></div><div>You will work closely with engineering, product management and sales teams to develop and execute content that drives adoption and understanding of how our product works.</div><h3>Areas of Focus</h3><li>Work with internal teams to obtain an in-depth understanding of the product and content requirements</li><li>Develop high-quality technical content, including: product tutorials and guides, slides and demos for technical audiences, online courses and training materials, white papers, case studies, blog posts, and other long-form content</li><li>Collaborate with product management to communicate product roadmaps</li><li>Maintain and update current content to be in line with the most recent release notes</li><li>Effectively communicate complex technical concepts to a broad audience, including developers, engineers and IT professionals</li><li>Build and maintain relationships with developers and other key stakeholders</li><h3>Competencies</h3><li>Strong technical background with a deep understanding of open-source software development principles and best practices</li><li>Excellent written and verbal communication skills, with the ability to explain complex technical concepts in a clear and concise manner</li><li>Experience in creating and delivering technical content, such as documentation, blog posts and presentations</li><li>Ability to build and maintain strong relationships with stakeholders</li><li>Strong project management and organisational skills with the ability to \thandle multiple projects simultaneously</li><li>Excellent written and verbal skills in English</li><li>Based within +/- 3 hours of UK time zone</li><li>Ability to travel to events across Europe</li><h3>Ideal Experience</h3><li>Degree in Computer Science, Engineering or a related field</li><li>Basic web development experience, git usage, shell scripting</li><li>Ability to compile and test bleeding edge software from source</li><li>Passion for Open Source and a good understanding of the Open Source community</li><li>Awareness of the office document creation competitive landscape</li><li>Experience with FLOSS tools and and/or the Linux Desktop</li><li>Experience working remotely</li><li>German language experience a bonus</li><div><br></div><div><br></div><div>#LI-Remote</div>","tags":"[\"management\",\"engineering\"]","pubDate":"2025-02-12T11:38:42.194Z","link":"https://jobs.lever.co/collabora/8e1e3c9d-ce47-478e-a97d-e6ad917b7750","slug":"technical-product-marketer-remote-europe-collabora-6210"}]