[{"id":5310423879,"title":"People Operations Administrator (Remote/Anywhere)","company":"Collabora","image":"https://pbs.twimg.com/profile_images/1545121577632763912/7FMnABb0_400x400.jpg","description":"<div class=\"section page-centered\" data-qa=\"job-description\"><div><span style=\"font-size: 12pt\">Are you interested in People Operations and helping internal teams strive for improvement?</span></div><div><span style=\"font-size: 12pt\">Are you process driven, with an eye for detail, optimisation and passion for helping others?</span></div><div><span style=\"font-size: 12pt\">If the answer is yes, please read on!</span></div><div><br></div><div><span style=\"font-size: 12pt\">The People Operations (POps) Team at Collabora is going through an exciting journey of digital transformation. To help us get there, we are looking for a detail-oriented and empathetic People Operations Administrator, who is as excited about automating processes with us as they are looking after our globally distributed team throughout their journey with us.</span></div><div><br></div><div><span style=\"font-size: 12pt\">You will be instrumental in supporting the day to day people operations, from onboarding new hires to ensuring compliance with policies and procedures.</span></div><div><br></div><div><b style=\"font-size: 12pt\">Who are we?</b></div><div><br></div><div><span style=\"font-size: 12pt\">We are a globally distributed technical consultancy, focused on promoting and implementing open source solutions for our various customers around the world. Because of this our team is built on collaboration whilst working remotely, thriving on the unique culture and rewarding workplace.</span></div><div><br></div><div><b style=\"font-size: 12pt\">Who are you?</b></div><div><br></div><div><span style=\"font-size: 12pt\">You care deeply about the impact of your work on Collaborans and embody our key values such as Openness, Transparency and Trust. You understand the value of genuine interpersonal communication, especially within a globally distributed work environment. You respect and cherish individuality and are able to engage with people accordingly.</span></div></div><div class=\"section page-centered\"><div><h3>Responsibilities</h3><ul class=\"posting-requirements plain-list\"><ul><li>Acting as a point of contact for employee inquiries and providing guidance on policies and procedures</li><li>Managing the end-to-end employee lifecycle from onboarding to offboarding, ensuring a smooth and positive experience</li><li>Maintaining and updating our HRIS (Zoho People), procedure manuals, policies and relevant wiki pages for all employees &amp; contractors</li><li>Supporting benefits enrolment processes and acting as a point of contact for benefits-related inquiries</li><li>Assisting with POps projects such as automation, process improvements, policy updates, diversity initiatives, and organizational changes</li><li>Assisting the company with staying up-to-date with relevant labour laws and regulations to ensuring compliance in all people operations practices</li></ul></ul></div></div><div class=\"section page-centered\"><div><h3>Essential Skills</h3><ul class=\"posting-requirements plain-list\"><ul><li>This role is ideal for someone who thrives in a fast-paced environment, enjoys working with people, and is passionate about contributing to a supportive organizational culture</li><li>Strong experience in a people operations capacity for a fully remote, globally distributed team</li><li>Strong understanding of people operations policies and practices, including compliance requirements</li><li>Detail-oriented with strong organizational and time management skills</li><li>Proficiency in using HRIS software and other HR Tech, and the confidence and ability to quickly get up to speed with tools that you may not have used before (the POps team uses Zoho People &amp; Lever and within the wider company we use open source tools such as MatterMost and Phabricator)</li><li>We don’t need you to be an automation and process optimisation pro (bonus points if you are) but we need someone who is willing to automate with us and who habitually questions the way we do things to make them better and more efficient</li><li>Deep understanding of the challenges and opportunities of remote and hybrid work environments</li><li>Willingness and adaptability to embrace new systems, processes and ways of working</li></ul></ul></div></div><div class=\"section page-centered\"><div><h3> Desirable Skills</h3><ul class=\"posting-requirements plain-list\"><ul><li>Experience in a tech company environment</li><li>Experience looking after employees in one or more of the following locations: UK, France, Canada, US</li><li>Experience of ISO controls</li><li>French speaking</li><li>Zoho People </li></ul></ul></div></div><div class=\"section page-centered\" data-qa=\"closing-description\"><div><br></div><div><br></div><div><span style=\"font-size: 12pt\">#LI-Remote</span></div></div><div class=\"section page-centered last-section-apply\" data-qa=\"btn-apply-bottom\"><a class=\"postings-btn template-btn-submit hex-color\" data-qa=\"show-page-apply\" href=\"https://jobs.lever.co/collabora/75302711-cfab-449e-b8d5-3134c052a098/apply\">Apply for this job</a></div>","tags":"[\"management\",\"aws\"]","pubDate":"2024-07-04 03:56:30.961","link":"https://jobs.lever.co/collabora/75302711-cfab-449e-b8d5-3134c052a098","savedDate":"2024-07-04 03:56:30.961","slug":"people-operations-administrator-remote-anywhere-collabora-8564"},{"id":4400603445,"title":"Engineering Manager - Cloud Ops [M3]","company":"Sourcegraph","image":"https://pbs.twimg.com/profile_images/1428393724527190022/4mt5PACL_400x400.png","description":"\n    <div class=\"content-intro\"><h3>ALL SOURCEGRAPH ROLES ARE FULLY REMOTE</h3>\n<h2><strong><span style=\"color: #a112ff;\">Who we are</span></strong></h2>\n<p>Our mission at Sourcegraph is to make it so that <a href=\"https://www.notion.so/sourcegraph/Mission-values-e9d37e6b972a4ef395c3076aea2bd07d?pvs=4\">everyone can code</a>, not just ~0.1% of the population. We're building the code intelligence platform that powers the world's best code search and the most popular open-source code AI tool. It’s an exciting time to join Sourcegraph—AI has taken over the world, and we aim to automate 99% of the toil in software engineering with our code understanding and code AI tools, leaving the remaining 1% to the irreplicable creative spark from humans.&nbsp;</p>\n<p>Our customers range from startups to the Fortune 500, 4/5 FAANG companies, government organizations, Uber, Plaid, and more. We’ve raised $225M at a $2.625B valuation from <a href=\"https://techcrunch.com/2021/07/13/sourcegraph-raises-125m-series-d-on-2-6b-valuation-for-universal-code-search-tool/\">a16z</a>,<a href=\"https://about.sourcegraph.com/blog/series-c-with-sequoia/\"> Sequoia</a>, <a href=\"https://www.redpoint.com/companies/sourcegraph/\">Redpoint</a>, <a href=\"https://medium.com/craft-ventures/why-we-invested-in-sourcegraph-5ace28317e3d\">Craft</a> and others. We’re making ambitious bets on our future and we’re looking to hire exceptional people to join our team as we make Sourcegraph one of the biggest and most influential companies in the world.</p></div>\n\n    <h2><span style=\"color: rgb(161, 18, 255);\"><strong>Location</strong></span></h2>\n<p>🌎 While we are an all-remote company and hire <a href=\"https://sourcegraph.notion.site/How-we-engage-talent-outside-of-the-US-218f7193695a46cbb1ef39ef9c1f72d4\">almost anywhere</a> in the world, we have a preference for someone to reside in the following locations for this role. However, if you feel qualified, we welcome you to apply regardless of location. No matter what, working hours must overlap with both Pacific Time and Central European time for at least 10 hours/week.</p>\n<p><strong>Preferred locations:</strong></p>\n<ul>\n<li>Remote</li>\n</ul>\n<h2><span style=\"color: rgb(161, 18, 255);\"><strong>Why this job is exciting</strong></span></h2>\n<p>Source code is at the heart of Sourcegraph. We support multiple code hosts and retrieve, store, index, and serve source code - to end users, admins, and other internal services. Our latest addition to our product catalog, Cody, reimagines how code is written and supercharges our developer customers.</p>\n<p>As an Engineering Manager for Cloud Operations, you will oversee the operations of our Cloud Managed Services. Sourcegraph hosts the infrastructure for our customers to manage their source code (search, insights, own, etc) as well as our brand new AI Code Assistant (Cody).</p>\n<p>This role gives you the opportunity to solve complex, challenging, and highly technical problems for our customers, both internally and externally, help unleash the potential and productivity of our Engineering teams, and delight our customers with industry-leading quality software.</p>\n<p>📅 Within one month, you will…</p>\n<ul>\n<li>Start building a trusting relationship with your direct reports and peers.</li>\n<li>Understand the what, why, and how of the projects your teams are working on, how those projects contribute to our company goals, and current status, risks, and mitigations.</li>\n<li>You will work closely with senior ICs on your team to ensure the technical strategy sets us up for success.</li>\n<li>Start the transition of the Cloud Operations team over to you.</li>\n</ul>\n<p>📅 Within three months, you will…</p>\n<ul>\n<li>Help all teams build scalable solutions to manage complex releases.</li>\n<li>Steadily improve processes for your teams and manage on-call &amp; support rotations, and improve self-service capabilities</li>\n<li>Help improve our observability and reduce our MTTD (Mean Time to Detect) and MTTR (Mean Time to Resolve) critical customer issues</li>\n<li>Help define and implement cloud-specific SLOs and performance targets</li>\n<li>Champion customer engagement in all phases of design, and development to support flawless deployments</li>\n</ul>\n<p>📅 Within six months, you will…</p>\n<ul>\n<li>Have significantly improved our current infrastructure key pain points</li>\n<li>Have enabled product teams to use the Cloud SLO framework</li>\n<li>Created a long-term plan for continuous improvement of the organization, higher-scale customer handling, etc.</li>\n</ul>\n<h2><span style=\"color: rgb(161, 18, 255);\"><strong>About you</strong></span></h2>\n<p>As Engineering Manager for Cloud Ops, you have experience as a technical manager and personal expertise to guide our teams to improve existing infrastructure, prepare for the expansion of product lines, scale customer environments, and scale our ability to host more customers.</p>\n<p>You have experience dealing with customers with very high technical bars, and you can have serious technical conversations with CTOs, Heads of Engineering, and decision-makers in companies in every business sector. You can represent your team with customers, roughly as if you were a rotation engineer on that team.</p>\n<p>As an Engineering Manager at Sourcegraph, your broad industry experience will be valuable across departments, from the data source (repo management) to indexing, processing, and API serving in all our deployment environments.&nbsp;</p>\n<ul>\n<li>You have at least 4 years of management experience and 5 years of hands-on coding experience.</li>\n<li>You have led engineering teams and held a high technical bar for teammates and yourself.</li>\n<li>You have experience with SaaS operations.</li>\n<li>You have experience with Google Cloud Platform.</li>\n<li>You have experience with container solutions (Kubernetes, GKE, Kustomize, Helm).</li>\n</ul>\n<h2><span style=\"color: rgb(161, 18, 255);\"><strong>Level</strong></span></h2>\n<p>📊 This job is an M3. You can read more about&nbsp;<a href=\"https://www.notion.so/sourcegraph/Leveling-Guide-0e1b5c76ada64b9caac387f8b7c4fc66\">our job leveling philosophy</a> in our Handbook.</p>\n<h2><span style=\"color: rgb(161, 18, 255);\"><strong>Compensation</strong></span></h2>\n<p><strong>💸 We pay you an above-average salary</strong> because we want to hire the best people who are fully focused on helping Sourcegraph succeed, not worried about paying bills. As an <a href=\"https://sourcegraph.notion.site/Mission-values-e9d37e6b972a4ef395c3076aea2bd07d\">open and transparent</a> company that values <a href=\"https://www.notion.so/sourcegraph/Compensation-Pay-Transparency-at-Sourcegraph-d58d0774f51b4b489d41c3628d30ff8d?pvs=4\">competitive compensation</a>, our compensation ranges are visible to every single Sourcegraph teammate.</p>\n<p>To determine your salary, we use a number of market and data-driven salary sources, along with your location zone, and target the high-end of the range to ensure we’re always paying above market regardless of where you live in the world. Both U.S. and international locations are divided into one of four zones, determined by the cost of labor index for each area. The starting salary for a successful candidate will be based on level, job-related skills, experience, qualifications, and location zone. Please note that these salary ranges may be adjusted in the future.</p>\n<p>💰The target compensation for this role is $90,000-$180,000 USD base.</p>\n<ul>\n<li>Zone 2: $180,000 USD</li>\n<li>Zone 3: $135,000 USD</li>\n<li>Zone 4: $90,000 USD</li>\n</ul>\n<p>Please speak with a recruiter for additional information regarding zone locations.</p>\n<p><br>📈 In addition to our cash compensation, we offer equity (because when we succeed as a company, we want you to succeed, too) and generous <a href=\"https://sourcegraph.notion.site/Benefits-Perks-dd1da4b6b3a64780abed010a144d34ba\">perks &amp; benefits</a>.</p>\n<h2><span style=\"color: rgb(161, 18, 255);\"><strong>Interview process</strong></span></h2>\n<p><em>Below is the interview process you can expect for this role (you can read more about </em><a href=\"https://sourcegraph.notion.site/Types-of-interviews-f279f080583d49ee9f2c60e30c8cb1f7\"><em>the types of interviews</em></a><em> in our Handbook). It may look like a lot of steps, but rest assured that we move quickly and the steps are designed to help you get the information needed to determine if we’re the right fit for you… Interviewing is a two-way street, after all!&nbsp;</em></p>\n<p>We expect the interview process to take 5.5 hours in total.</p>\n<p><strong>👋 Introduction Stage</strong> - we have initial conversations to get to know you better…</p>\n<ul>\n<li>[30m] <a href=\"https://www.notion.so/sourcegraph/Types-of-interviews-sample-questions-f279f080583d49ee9f2c60e30c8cb1f7?pvs=4#99be5ff628b2414194a0ba79d9f25f13\">Recruiter Screen</a></li>\n<li>[15m] Hiring Manager Intro</li>\n</ul>\n<p><strong>🧑‍💻 Team Interview Stage</strong> - we then delve into your experience in more depth and introduce you to members of the team, including cross-functional partners…</p>\n<ul>\n<li>[60m] <a href=\"https://www.notion.so/sourcegraph/Types-of-interviews-sample-questions-f279f080583d49ee9f2c60e30c8cb1f7?pvs=4#c678a2a86e0e47e4958507e869bf7ded\">Resume Deep Dive</a></li>\n<li>[45m] Technical Interview</li>\n<li>[45m] Peer Interview</li>\n<li>[45m] Cross-functional Team Collaboration Interview</li>\n</ul>\n<p><strong>🎉 Final Interview Stage </strong>- we move you to our final round, where you gain a better understanding of our business and values holistically…</p>\n<ul>\n<li>[30m] <a href=\"https://www.notion.so/sourcegraph/Types-of-interviews-sample-questions-f279f080583d49ee9f2c60e30c8cb1f7?pvs=4#e3a04291743048df87541a88aa8199dd\">Values</a></li>\n<li>[30m] <a href=\"https://www.notion.so/sourcegraph/How-to-work-with-Quinn-Slack-CEO-807673e0864d473f959cc4efd9642a5a?pvs=4#6f185c0e2011411eac5be9c675f9056c\">Leadership</a> with co-founder</li>\n<li>We check references and conduct your background check</li>\n</ul>\n<p>Please note - you are welcome to request additional conversations with anyone you would like to meet, but didn’t get to meet during the interview process.</p>\n\n    \n\n    <div class=\"content-conclusion\"><h2><strong><span style=\"color: #a112ff;\">Not sure if this is you?</span></strong></h2>\n<p><span style=\"font-weight: 400;\">We want a diverse, global team, with a broad range of experience and perspectives. If this job sounds great, but you’re not sure if you qualify, apply anyway! We carefully consider every application, and will either move forward with you, find another team that might be a better fit, keep in touch for future opportunities, or thank you for your time.</span></p>\n<h2><strong><span style=\"color: #a112ff;\">Learn more about us</span></strong></h2>\n<p><span style=\"font-weight: 400;\">To create a product that serves the needs of all developers, we are building a diverse </span><a href=\"https://sourcegraph.notion.site/All-remote-guidelines-4d1270d806294bf4ae6db7ab02911957\"><span style=\"font-weight: 400;\">all-remote team</span></a><span style=\"font-weight: 400;\"> that is </span><a href=\"https://www.notion.so/sourcegraph/7ed54d4ec4624475a4b45619901236d7?v=e06d936c673f46ca8c313a557bd4410f\"><span style=\"font-weight: 400;\">distributed across the world</span></a><span style=\"font-weight: 400;\">. Sourcegraph is an equal opportunity workplace; we welcome people from all backgrounds and communities.&nbsp;</span></p>\n<p><span style=\"font-weight: 400;\">We provide </span><a href=\"https://sourcegraph.notion.site/Compensation-Pay-Transparency-at-Sourcegraph-d58d0774f51b4b489d41c3628d30ff8d?pvs=74\"><span style=\"font-weight: 400;\">competitive compensation</span></a><span style=\"font-weight: 400;\"> and </span><a href=\"https://sourcegraph.notion.site/Benefits-Perks-dd1da4b6b3a64780abed010a144d34ba?pvs=74\"><span style=\"font-weight: 400;\">practical benefits</span></a><span style=\"font-weight: 400;\"> to keep you happy and healthy so that you can do your best work.&nbsp;</span><span style=\"font-weight: 400;\">&nbsp;</span></p>\n<p><span style=\"font-weight: 400;\">Learn more about what it is like to work at Sourcegraph by reading </span><a href=\"https://sourcegraph.notion.site/d7614e3e9dc04c09ac2d42d57f1816e6?v=2a6d426dbae14390b155120b0c029ce0\"><span style=\"font-weight: 400;\">our handbook</span></a><span style=\"font-weight: 400;\">.</span></p>\n<p><span style=\"font-weight: 400;\">We want to ensure Sourcegraph is an environment that suits your working style and empowers you to do your best work, so we are eager to answer any questions that you have about us at any point in the interview process.</span></p>\n<p><span style=\"font-weight: 400;\">Go back to the </span><a href=\"https://about.sourcegraph.com/jobs/\"><span style=\"font-weight: 400;\">careers page</span></a><span style=\"font-weight: 400;\"> for all open positions.</span></p>\n<p><em><span style=\"font-weight: 400;\">Sourcegraph participates in <a href=\"https://sourcegraph.notion.site/E-Verify-2ab3286dde3446d6bac2898c83610107\" target=\"_blank\">E-Verify</a> for U.S. Employees</span></em></p></div>\n","tags":"[\"management\",\"engineering\"]","pubDate":"2024-07-04 03:56:30.960","link":"https://boards.greenhouse.io/sourcegraph91/jobs/5210245004","savedDate":"2024-07-04 03:56:30.960","slug":"engineering-manager-cloud-ops-m3-sourcegraph-9546"},{"id":5406146799,"title":"Client Onboarding Representative (English & Punjabi)","company":"Bobtail","image":"https://media.licdn.com/dms/image/D4E0BAQGvUyfPVBWDyg/company-logo_200_200/0/1657595552015?e=2147483647&v=beta&t=EecsDCOy3Fh_26M1noQDDIYw8-JuGKz_d1JDvcBZ-yI","description":"\n    \n\n    <h2>About Bobtail</h2>\n<p>Bobtail is dedicated to increasing happiness by eliminating inefficiencies in the supply chain.&nbsp; We envision a supply chain without friction, fraud, waste, and abuse where companies succeed based on the value they create.&nbsp;&nbsp;</p>\n<p>We work in a unique way at Bobtail, where we value teams over individuals and encourage experimentation and iteration to constantly improve.&nbsp; Teams are given flexibility in working towards a shared purpose and given the freedom to decide how they will accomplish their goals.&nbsp;&nbsp;</p>\n<p>If you are an out of the box thinker that takes a proactive approach in collaborating with others to solve problems and achieve your goals - we would love to talk to you.&nbsp;&nbsp;</p>\n<p>The things we value:</p>\n<ol>\n<li>Mission</li>\n<li>Teams over individuals</li>\n<li>Collaboration</li>\n<li>Communication</li>\n<li>Iteration</li>\n<li>Experimentation and failing fast</li>\n<li>Initiative and solutions oriented approach</li>\n<li>Documentation</li>\n<li>Data</li>\n<li>Mental health and work life balance</li>\n<li>Diversity</li>\n<li>Transparency</li>\n</ol>\n<h2>You should apply if you have:</h2>\n<ul>\n<li>Customer success and onboarding experience (2/3 years minimum)</li>\n<li>Possess excellent verbal and written communication skills</li>\n<li>Time management and multitasking skills in order to handle multiple tasks and clients at once</li>\n<li>Strong organizational skills and attention to detail</li>\n<li>Capable of prioritizing tasks/requests to meet the client &amp; company needs</li>\n<li>Ability to work independently and as part of a team</li>\n<li>Problem-solving skills and the ability to think critically under pressure</li>\n</ul>\n<p><span style=\"font-weight: 400;\"><br><br></span></p>\n<h2>You will be responsible for:</h2>\n<ul>\n<li>Serve as the primary point of contact for new clients during the onboarding process</li>\n<li>Conduct onboarding sessions, including product&nbsp; and training for new clients</li>\n<li>Gather and verify required client information and documentation</li>\n<li>Collaborate with internal teams (sales, Customer success, processing, Etc) to ensure a seamless onboarding experience</li>\n<li>Provide ongoing support and follow-up with clients to address any questions or concerns</li>\n<li>Develop and maintain onboarding materials and resources</li>\n<li>Track and report on onboarding progress, identifying areas for improvement and implementing solutions</li>\n<li>proficiency with CRM software (salesforce)&nbsp; and other onboarding tools</li>\n<li>&nbsp;Communicate with assigned carriers via email, text or phone</li>\n</ul>\n<p><span style=\"font-weight: 400;\"><br><br></span></p>\n<h2>Benefits</h2>\n<ul>\n<li>Monthly Mental Break Day</li>\n<li>Paid Time Off</li>\n<li>Work from home (or wherever)</li>\n<li>Parental leave</li>\n</ul>\n<p>Creating a diverse and inclusive workplace is Bobtail’s nucleus. We are an equal opportunity employer and embrace people of different backgrounds, cultures, religions, national origins, races, colors, genders, gender expressions, sexual orientations, ages, marital status, veteran status, experiences, abilities and perspectives. <br><br></p>\n<p>&nbsp;</p>\n\n    \n\n    \n","tags":"[\"management\"]","pubDate":"2024-07-04 03:56:30.960","link":"https://boards.greenhouse.io/bobtail/jobs/4204778005","savedDate":"2024-07-04 03:56:30.960","slug":"client-onboarding-representative-english-punjabi-bobtail-9920"},{"id":5812425950,"title":"Strategic Partnerships Manager (South Korea)","company":"Airalo","image":"https://lever-client-logos.s3.us-west-2.amazonaws.com/55028a36-609c-479c-9553-d4689ff2dd8c-1669620566663.png","description":"<div><b>About Airalo</b></div><div>Alo! Airalo is the world’s first eSIM store that helps people connect in over 200+ countries and regions across the globe. We are building the next digital service that revolutionizes the telecom industry. We are a travel-tech company and an equal-opportunity environment that values and executes diversity, inclusion, and equity. Our team is spread across 50+ countries and six continents. What glues us together is our commitment to changing the way you connect<span style=\"font-size: 13.3333px\">. </span></div><div><br></div><div><b>About you</b></div><div>We hope that you care deeply about the quality of your work, the intrinsic worth of tasks, and the success of your team. You are self-disciplined and do not require micromanagement in terms of your skillset and work ethic. You do your best to flourish as an individual every day while working hard to foster a collaborative team environment. You believe in the importance of being — and staying — authentic, honest, positive, and kind. You are a good interlocutor with clear and concise communication. You are able to manage multiple projects, have an analytical mind, pay keen attention to detail, and love to get your hands dirty. You are cognizant, tolerant, and welcoming of vulnerabilities and cultural differences.</div><div><br></div><div><b>About the Role</b></div><div><b>Position</b>: Full-time / Employee</div><div><b>Location:</b>&nbsp;Remote-first </div><div><b>Benefits:</b>&nbsp;Health Insurance, work-from-anywhere stipend, annual wellness &amp; learning credits, annual all-expenses-paid company retreat in a gorgeous destination &amp; other benefits</div><div><br></div><div>We are looking for a <b>Strategic Partnerships</b> superstar to join the <b>Airalo Partnerships</b> department.</div><div>The undisputed industry leader in the B2C segment in the eSIM industry, we are now looking to expand our presence in the B2B2C and B2B space to bring the eSIM revolution to global markets.</div><div>As the Strategic Partnerships Manager for South Korea, you will lead and oversee various strategic partnerships for Airalo in South Korea.</div><h3>Responsibilities include but are not limited to:</h3><li>Work closely with the Senior Partnerships Director, APAC and other team members in the department</li><li>Find, identify, prospect, and lead negotiations with potential strategic partners to support Airalo’s market penetration efforts</li><li>Onboard and support new partners as they join the Airalo Partner Community</li><li>Maintain relationships with key partners to drive partner profitability and grow the B2B2C partnerships’ contribution to the business</li><li>Conduct ongoing competitive analysis in South Korea to establish and maintain Airalo’s status as the leading eSIM provider across partner industries</li><li>Collaborate and work with different internal and external stakeholders to develop and execute projects/opportunities</li><li>Identify relevant events and conferences across South Korea and represent Airalo as a speaker, delegate, or exhibitor to educate the ecosystem about eSIMs and Airalo</li><li>Own the relevant Airalo Partnerships OKRs in South Korea</li><li>As a senior member of the South Korea squad, drive the overall growth strategy for Airalo in South Korea</li>,<h3>Must-haves:</h3><li>5+ years of experience in partnerships, sales, account management, or business development in a high-growth B2B2C environment</li><li>Proven expertise in recruiting and managing large partners</li><li>Deep understanding of the travel/telecom partnerships ecosystem in South Korea with a strong, existing network</li><li>Partner-first mentality and a genuine passion to help your stakeholders succeed while creating win-win relationships</li><li>Ability to narrate a good story - Airalo’s unique story and the problem we solve for our users make it a compelling partnership proposition</li><li>Ability to employ sales techniques, including effective questioning, objection handling, consultative selling, and solution selling</li><li>Ability to multi-task in a complex &amp; matrix environment</li><li>Extreme comfort with technology including managing API integrations</li><li>Experience with sales and partnerships tools</li><li>Perfect verbal and written communication skills in English and Korean</li>,<h3>Good to have:</h3><li>Familiarity with the travel industry</li><li>Prior experience in a travel tech/telecom company</li><li>Graduate degree in a related field</li><li>Certificates and courses in sales and partnerships</li><li>Verbal and written ability in relevant, additional languages</li><div>If you are interested in this position, <b>please apply via the link.</b></div><div><br></div><div><i>We sincerely thank all applicants in advance for submitting their interest in this opportunity with Airalo. </i></div>","tags":"[\"management\",\"B2C\",\"B2B\"]","pubDate":"2024-07-03 01:29:55.120","link":"https://jobs.lever.co/airalo/79bb031b-56de-40ca-9ebc-d5463889d77a","savedDate":"2024-07-04 03:56:30.964","slug":"strategic-partnerships-manager-south-korea-airalo-629"},{"id":2673601213,"title":"Corporate Sales Specialist (Australia)","company":"Airalo","image":"https://lever-client-logos.s3.us-west-2.amazonaws.com/55028a36-609c-479c-9553-d4689ff2dd8c-1669620566663.png","description":"<div><b>About Airalo</b></div><div>Alo! Airalo is the world’s first eSIM store that helps people connect in over 200+ countries and regions across the globe. We are building the next digital service that revolutionizes the telecom industry. We are a travel-tech company and an equal-opportunity environment that values and executes diversity, inclusion, and equity. Our team is spread across 50+ countries and six continents. What glues us together is our commitment to changing the way you connect<span style=\"font-size: 13.3333px\">. </span></div><div><br></div><div><b>About you</b></div><div>We hope that you care deeply about the quality of your work, the intrinsic worth of tasks, and the success of your team. You are self-disciplined and do not require micromanagement in terms of your skillset and work ethic. You do your best to flourish as an individual every day while working hard to foster a collaborative team environment. You believe in the importance of being — and staying — authentic, honest, positive, and kind. You are a good interlocutor with clear and concise communication. You are able to manage multiple projects, have an analytical mind, pay keen attention to detail, and love to get your hands dirty. You are cognizant, tolerant, and welcoming of vulnerabilities and cultural differences.</div><div><br></div><div><b>About the Role</b></div><div><b>Position</b>: Full-time / Employee</div><div><b>Location:</b>&nbsp;Remote-first </div><div><b>Benefits:</b>&nbsp;Health Insurance, work-from-anywhere stipend, annual wellness &amp; learning credits, annual all-expenses-paid company retreat in a gorgeous destination &amp; other benefits</div><div><br></div><div>Airalo is looking for a <b>Corporate Sales Specialist</b> to join the <b>Airalo Partnerships</b> department.</div><div>Physical SIM cards are passe. The future of connectivity, including for business travelers, is through eSIMs. As the undisputed industry leader in the B2C segment, we are now looking to expand our presence in the corporate channel. Through the ‘Airalo for Corporates’ solution, we will offer significant savings and considerable ease to corporates when their employees travel for work.</div><div>As the <b>Corporate Sales Specialist</b> for Australia, you will own Airalo’s corporate sales strategy and execution to ensure Airalo’s adoption as the business travel connectivity solution across small, medium and large enterprises.</div><h3>Responsibilities include but are not limited to:</h3><li>Work closely with the Corporate Sales Manager, APAC and other team members in the department</li><li>Conduct competitive research and define the Airalo corporate distribution roadmap to maintain Airalo’s status as the preferred provider across corporate partners</li><li>Market mapping of the top corporate prospects in key cities across Australia and creating a distribution roadmap to achieve maximum penetration across the universe</li><li>Onboard and support new corporate partners as they join the Airalo partner community</li><li>Build and maintain fruitful relationships with key stakeholders (Human resources, travel admins, IT admins) at corporate partners to drive mutual growth</li><li>Organize events and roadshows at key corporates to educate employees about benefits of eSIMs over other travel connectivity options</li><li>Collaborate and work with different internal and external stakeholders to develop and execute projects/opportunities successfully</li><li>Own and deliver monthly, quarterly and annual OKRs for your channel with regular tracking and progress reports</li><li>As a core member of the Australia squad, always explore ways and means to further consolidate Airalo’s dominance in Australia</li>,<h3>Must-haves:</h3><li>2+ years of experience in corporate channel sales or business development in the tech, travel or telecom industry</li><li>Good understanding of the corporate channel (preferably the travel and / or telecom corporate) in Australia</li><li>This is a largely relationship driven channel. You must be able to forge and nurture relationships with stakeholders across the channel</li><li>Ability to narrate a good story - Airalo’s unique story and the problem we solve for our users makes it a compelling pitch for partners</li><li>Ability to employ sales techniques, including effective questioning, objection handling, consultative selling, and solution selling</li><li>Ability to multi-task</li><li>Experience with sales and partnerships tools</li><li>Perfect verbal and written communication skills in English</li>,<h3>Good to have:</h3><li>Familiarity with the travel or telecom industry</li><li>Prior work experience in the travel or telecom industry</li><li>Knowledge of eSIM and GSMA-related technologies and services</li><li>Certificates and courses in sales and partnerships</li><div>If you are interested in this position, <b>please apply via the link.</b></div><div><br></div><div><i>We sincerely thank all applicants in advance for submitting their interest in this opportunity with Airalo. </i></div>","tags":"[\"management\",\"B2C\"]","pubDate":"2024-07-03 01:14:47.898","link":"https://jobs.lever.co/airalo/14d9f1ef-e41e-490b-aed6-de69664ed636","savedDate":"2024-07-04 03:56:30.963","slug":"corporate-sales-specialist-australia-airalo-4170"},{"id":1710616661,"title":"Digital Insurance Project Manager (Fully Remote)","company":"CoverGo","image":"https://pbs.twimg.com/profile_images/1382655628523364355/MWPIbbID_400x400.jpg","description":"<p><strong>Top 3 Reasons To Join Us</strong></p><ul> <li>Competitive Salary</li> <li>100% Remote</li> <li>Working on the latest tech for the Insurtech Market Leader</li> </ul><p><strong>About Us</strong></p><p>At CoverGo, our mission is to empower all insurance companies to make insurance 100% digital and accessible to everyone.</p><ul> <li>We are a leading global no-code insurance platform for health, life, and P&amp;C</li> <li>We’re the winner of the Insurtech of the Year in all of Asia and other awards globally</li> <li>We work with insurance enterprise clients such as AXA, Bupa, MSIG, Dai-ichi, Bank of China Group Insurance, and many more</li> <li>We're an international, diverse team of over 120 people with 30 nationalities and team members working remotely from all over the world</li> <li>We are fully funded and backed by reputable VC funds and strategic institutional investors</li> <li>We have a global presence in Asia, EMEA and the Americas</li> <li>We’ve grown our annualized revenue by over 30x since January 2021</li> <li>We’re constantly working towards making CoverGo a workplace that you love coming to. We deeply believe that bringing together a diversity of thoughts, expressions, and perspectives is key to building the best culture for equally diverse communities all over the worldrkplace that you love coming to. We deeply believe that bringing together a diversity of thoughts, expressions, and perspectives is key to building the best culture for equally diverse communities all over the world</li> </ul><p><strong>About the Role</strong></p><p>As a Digital Insurance Project Manager, your core responsibility will be to oversee and manage the implementation of new and/or existing projects within CoverGo's operations. This role presents an exciting opportunity for an individual with a strong drive to lead transformative projects in the insurtech industry. </p><p><strong>What You Will Do</strong></p><ul> <li>Engage and manage relationships with clients and stakeholders</li> <li>Lead project planning sessions with the internal team and client's staff</li> <li>Support solution proposals for client pursuits, proposals, and PoCs</li> <li>Participate in proposal and POC processes (i.e. design, submission, and review)</li> <li>Support the creation of contracts and related communication with clients</li> <li>Identify and help secure growth opportunities for existing clients</li> <li>Manage project progress and adapt work as required</li> <li>Ensure projects meet deadlines</li> <li>Manage relationships with clients and stakeholders</li> <li>Host regular/weekly project review and create reports with key metrics about team and project status using company standard metrics</li> <li>Oversee all incoming and outgoing project documentation</li> <li>Identify and manage issues, risks, assumptions, and dependencies</li> <li>Continuously optimize and improve processes and the overall approach where necessary</li> </ul><p><strong>What We Need</strong></p><ul> <li>Bachelor's degree in computer science or a related technical field is a plus</li> <li>5+ years experience as a Project Manager</li> <li>Insurance domain knowledge is a must</li> <li>Strong client facing experience is a must</li> <li>Technical skills are a plus</li> <li>Has experience seeing projects through the full life cycle</li> <li>Excellent analytical skills and problem-solving skills</li> <li>Strong interpersonal skills and extremely resourceful</li> <li>Proven ability to complete projects according to outlined scope, budget, and timeline</li> <li>Self-motivated and able to work independently</li> <li>Able, willing, and excited to work in a fast-paced collaborative startup environment</li> <li>Must be based in the Philippines</li> </ul><p><strong>Why You'll Love Working Here</strong></p><ul> <li>Fully Remote</li> <li>Flexible Leave</li> <li>International Environment</li> <li>Competitive renumeration package</li> <li>Performance Bonus</li> <li>Stock Options after 6 months</li> <li>Company activities and events</li> <li>Learning and development plan</li> <li>Remote work allowance</li> </ul><p><strong>CoverGo Company </strong><a href=\"https://www.youtube.com/watch?v=YI0ezLxvFvA\" rel=\"nofollow noreferrer noopener\" class=\"external\"><strong>Video</strong></a></p><p>By submitting your application, you confirm that you have read, understood, and accepted the content of CoverGo’s <a href=\"https://apply.workable.com/covergo/gdpr_policy?lng=en\" target=\"_blank\" rel=\"nofollow noreferrer noopener\" class=\"external\">Privacy Notice</a> and you consent to the processing of your data as part of this application.</p><p><a href=\"https://www.youtube.com/watch?v=YI0ezLxvFvA\" rel=\"nofollow noreferrer noopener\" class=\"external\"></a></p><h3>Requirements: </h3><h3>Benefits: </h3>","tags":"[]","pubDate":"2024-07-03 00:00:00.000","link":"https://apply.workable.com/covergo/j/2FC8D8A6D4","savedDate":"2024-07-04 03:56:30.962","slug":"digital-insurance-project-manager-fully-remote-covergo-8628"},{"id":9721429815,"title":"Sr. Data Scientist - Remote (APAC Region)","company":"Empower","image":"https://lever-client-logos.s3.us-west-2.amazonaws.com/2e1a369c-b58f-41ac-8d86-4b0a77695e68-1687915522032.png","description":"<div><b style=\"font-size: 24px\">EMPOWER OVERVIEW</b></div><div><br></div><div><a href=\"http://empower.me/\" class=\"postings-link\">Empower</a>&nbsp;is a high-growth financial technology company on a mission to expand access to fair credit to give anyone in the world the opportunity to improve their financial security and mobility. We dream up and launch one-of-a-kind features that help our members get money instantly whenever they need it, save for the future, and rewrite their financial story. Our members see Empower Cash Advance as a life-saver, Empower Automatic Savings as a game-changer, and the new Empower Thrive line of credit as a lifeline to low-cost borrowing and the only practical path to building good credit.</div><div><br></div><div>Empower is backed by Sequoia Capital, Blisce, and Icon Ventures. Are we the next great place to grow your impact and accelerate your career? We think so:</div><div><br></div><div>Inc. ranked Empower #56 in the 2023 Inc. 5000 list of the fastest-growing private companies in the US (#55 in 2022). Forbes put Empower on its 2023 list of America's Best Startup Employers. Fast Company recognized the new Empower Thrive line of credit in their 2022 list of the Next Big Things in Tech. </div><div><br></div><div><b style=\"font-size: 18px\">THE EMPOWER WAY</b></div><div><b>Great Expectations</b>: We come up with bold, audacious goals for ourselves and go all out for impact</div><div><b>Owner Mindset</b>: We give every employee latitude to act independently, make smart choices, and move the business forward</div><div><b>Spirited Debate</b>: We love skeptics and seek counter opinions to challenge our personal assumptions and expand our view</div><div><b>Customer Obsession: </b>We listen to understand, empathize, and create a memorable, rewarding experience for our community</div><div><b>Inclusive Collaboration</b>: We believe diverse teams make the best decisions, and we strive to give diverse voices a seat at the table</div><div>N<b>o Jerks Allowed</b>: We value our relationships and take the time to build trust and connection and communicate respectfully</div><div><b>&nbsp;</b></div><div><b>&nbsp;</b></div><div><b style=\"font-size: 18px\">WHAT EMPOWER OFFERS</b></div><div>Competitive salary</div><div>Generous equity package</div><div>Full healthcare and dental benefits</div><div>Technology&nbsp; expense reimbursement</div><div>Work&nbsp; from anywhere</div><div><br></div><div><b style=\"font-size: 18px\">JOB DESCRIPTION</b></div><div><br></div><div>We’re looking for a talented data scientist to lead our launch in Southeast Asia — starting with the Philippines. In this role, you’ll be responsible for the entire model development process from conception with stakeholders, creation of model pipelines, technical development, deployment. You’ll collaborate with a small, experienced team of credit analysts, product managers, engineers, designers, and marketers in a “startup within a startup” environment. You’ll own our model development roadmap and execution for the new business, expanding access to fair credit in one of the world’s fastest-growing regions. And you’ll be supported by Empower’s deep expertise and experience from the US and Mexico.</div><div><br></div><div>The ideal candidate is passionate about using data and models to drive business growth and help customers improve their financial situations.&nbsp; This individual will own creating and improving credit risk models to help the business decrease loss rates and increase approval rates.&nbsp; The right person for this role is someone who shines while solving complex problems and is comfortable with a wide variety of technical tools.</div><h3>Key Responsibilities</h3><li>Grow user base, increase retention and lower loss rate through machine learning and analytics for Empower’s new Southeast Asia business </li><li>Build machine learning models with large scale data sets to address business priorities</li><li>Design and influence strategies on underwriting, marketing, fraud and customer experience</li><li>Work closely with our engineering team as you implement models in production&nbsp;</li><li>Collaborate effectively with operations and product to ensure the work fits into the broader strategy and business context</li><li>Develop data standards and analytics pipelines to facilitate current and future analysis</li>,<h3>Candidate Qualifications</h3><li>Based in an Asia Pacific time zone</li><li>BS degree in engineering, computer science, finance or mathematics</li><li>4+ years industry experience in data mining, machine learning, statistical analysis, and/or predictive modeling</li><li>Deep understanding of statistics and machine learning techniques, including regression, classification, clustering and optimization&nbsp;Experience building predictive models from scratch</li><li>Strong programming skills (Python preferred) with intermediate to advanced knowledge of SQL</li><li>Demonstrable experience with ML packages: scikit-learn, LightGBM, XGBoost, SparkML, etc.</li><li>Knowledge in deep learning and experience with DL toolkits (Tensorflow, Keras, PyTorch) is preferred though not required</li><li>Comfort working with a variety of cross functional partners in tech, product, credit, and business</li><li>Strong and structured approach to problem solving and ability to use of frameworks to communicate complex topics in an effective manner</li>,<h3>Preferred Qualifications</h3><li>MS or PhD preferred</li><li>At least 2+ year at a bank or FinTech working in data science or credit analytics is a plus</li><li>Experience in cloud computing (AWS, Azure, etc.) is a plus</li><li>Working with markets in developing countries is a plus</li><div><span style=\"font-size: 15px\">At Empower, we hire for people that push themselves to understand others and seek out ways to challenge their personal assumptions. Our hope is that by fostering such an environment, we strengthen our business and relationships by putting people first. We are committed to building a diverse, inclusive, and equitable workspace where everyone (regardless of age, education, ethnicity, gender, sexual orientation, or any personal characteristics) feels like they belong. Even if your experience doesn’t exactly match up to our job description, you should feel empowered to apply regardless!</span></div>","tags":"[\"Finance\",\"engineering\",\"aws\"]","pubDate":"2024-07-02 23:28:28.146","link":"https://jobs.lever.co/empower.me/49752337-6d68-451c-b2e0-3c9f1662c236","savedDate":"2024-07-04 03:56:30.963","slug":"sr-data-scientist-remote-apac-region-empower-3106"},{"id":1850552828,"title":"Product Manager","company":"TCP Management","image":"https://remotive.com/job/1919586/logo","description":"<p>Are you a skilled and experienced Product Manager with a specialization in Saas Products? Join Voxco, a leader in the market research industry, and help us transform how organizations gather and analyze data. As a Product Manager at Voxco, you will play a pivotal role in shaping the future of our research products, driving innovation, and enhancing our data collection methods.</p>\n<p><strong>About Us:</strong></p>\n<p>Voxco is transforming how organizations gather and analyze data to make informed decisions. Our comprehensive suite of survey software solutions empowers businesses across various industries to unlock valuable insights and drive meaningful outcomes. We are committed to delivering exceptional value to our clients through innovative technology and unparalleled expertise.</p>\n<p> </p>\n<p><strong>Key Responsibilities:</strong></p>\n<ul style=\"\">\n<li style=\"\">Develop and maintain product roadmaps, ensuring alignment with company strategy and successful product execution.</li>\n<li style=\"\">Become an expert in our platforms, understanding existing capabilities and identifying future opportunities.</li>\n<li style=\"\">Manage the end-to-end product development process, collaborating with engineering, customer success, and marketing teams.</li>\n<li style=\"\">Incorporate usability studies, research, and market analysis into product requirements to enhance user satisfaction.</li>\n<li style=\"\">Analyze multiple data sources to identify opportunities for increased user value, showcasing attention to detail and initiative.</li>\n<li style=\"\">Foster a collaborative and adaptive environment, working agilely to respond to market shifts and customer feedback.</li>\n</ul>\n<p> </p>\n<p>If you are passionate about creating innovative insights products, have a strong background in survey software or telephony data collection modes, and possess the skills outlined above, we encourage you to apply. Flexibility in working across different time zones is expected.</p>\n<p><strong>Requirements</strong></p>\n<p><strong>Experience and Qualifications:</strong></p>\n<p><strong>Required:</strong></p>\n<ul style=\"\">\n<li style=\"\">6+ years of software product management in a complex technical environment.</li>\n<li style=\"\">Proven success in SaaS product management.</li>\n<li style=\"\">Experience in agile environments with the ability to adapt to shifting priorities.</li>\n<li style=\"\">Excellent organizational and project management skills, with strong attention to detail.</li>\n<li style=\"\">Exceptional collaboration skills, engaging and influencing multiple business partners.</li>\n<li style=\"\">Fluency in English; proficiency in French is a plus.</li>\n</ul>\n<p><strong>Preferred:</strong></p>\n<ul style=\"\">\n<li style=\"\">Experience with survey data collection platforms.</li>\n<li style=\"\">Experience in telephony products.</li>\n<li style=\"\">Knowledge of Research &amp; Customer Experience Insights.</li>\n<li style=\"\">Strong analytical skills with a data-driven approach to decision-making.</li>\n<li style=\"\">Ability to work effectively across different time zones and cultures.</li>\n</ul>\n<p> </p>\n<p><strong>Benefits</strong></p>\n<ul style=\"\">\n<li style=\"\">Be part of a team driving innovation in data collection and analysis.</li>\n</ul>\n<ul style=\"\">\n<li style=\"\">Work remotely from anywhere in the world, collaborating with colleagues in Europe, North America, and India.</li>\n<li style=\"\">Enjoy a flexible work environment that values work-life balance.</li>\n<li style=\"\">Competitive salary and benefits package.</li>\n</ul>\n<p><br><br></p>\n<div class=\"h2\">About the company</div>\n<p> </p>\n<p>Founded in 2017, Terminus Capital Partners is a growth-oriented private equity firm focused exclusively on majority investments in B2B software companies. For over 14 years, at Terminus Capital Partners and at predecessor companies, our principals and associates have helped build 7 market-leading companies.</p>\n<p>We differentiate ourselves by being sector experts, truly helping our companies with nitty gritty work, and by being the best possible partner to founder to managers, founders, and sellers. Indeed, we strive to be the world's premier small-cap B2B software private equity firm, a commitment we renew every day.</p>\n<img src=\"https://remotive.com/job/track/1919586/blank.gif?source=public_api\" alt=\"\"/>","tags":"[\"saas\",\"agile\",\"project management\",\"research\",\"product management\",\"market research\",\"product development\"]","pubDate":"2024-07-02 13:21:06.000","link":"https://remotive.com/remote-jobs/product/product-manager-1919586","savedDate":"2024-07-04 03:56:30.957","slug":"product-manager-tcp-management-6676"},{"id":6005499107,"title":"Product Manager - Treasury & Corporate Accounts","company":"Xapo61","image":"https://remotive.com/job/1920043/logo","description":"<div class='\"content-intro\"'>\n<p>Work from anywhere, impact everywhere </p>\n<p>Diversity is at the heart of who we are at Xapo Bank. We’re a fully distributed team of over 140 Xapiens that work remotely from 40+ countries around the world. </p>\n<p>Our beginning: A world that enjoys economic freedom and wealth protection, no matter where you live or who is running your country. This is the dream that drove Wences Casares, our Founder and Chairman, to quietly transform the world of banking.</p>\n<p>To achieve that, we search the world for the best people for the job. We work hard, think globally, and inspire each other to learn and grow. We are committed to changing the way things are done.</p>\n<p><strong>Risk is inherent in all of our business activities and managing risk well is the responsibility of every Xapien. Sound risk management enables us to serve our customers and deliver value for our shareholders, and helps make Xapo a great place to work.</strong></p>\n<p> </p>\n<p><em>Although we are headquartered in Gibraltar, this is a full time, 100% remote position <br></em><em>Work from anywhere!</em></p>\n<p> </p>\n</div>\n<p><strong><em>Position overview</em></strong></p>\n<p>As a Product Manager for Treasury and Corporate Accounts at Xapo Bank, you will play a pivotal role in optimizing the deployment of funds for our internal Treasury team. You will lead product discovery and MVP development for a new corporate account offering that acts like a treasury account. This role involves close collaboration with cross-functional teams to ensure the successful launch and continuous improvement of our treasury and corporate account products.</p>\n<p><strong><em>Responsibilities</em></strong></p>\n<ul style=\"\">\n<li style=\"\"><strong>Treasury Optimization. </strong>Our Treasury team is the heartbeat of how we earn. You’ll work closely with the Treasury team to understand their needs and optimize fund deployment strategies - developing tools and processes to enhance our treasury.</li>\n<li style=\"\"><strong>Product Discovery and Development.</strong> Lead extensive product discovery for corporate accounts that function like treasury accounts. Define MVP features and the creation of a potential roadmap moving forward. </li>\n<li style=\"\"><strong>Market Research and Analysis.</strong> Conduct in-depth market research to identify trends, customer needs, and opportunities for product innovation. </li>\n<li style=\"\"><strong>Product Development Support.</strong> Collaborate with cross-functional teams, including your tech lead, developers, our treasury function and others to create comprehensive product requirements, user stories, and feature prioritisation. You’ll coordinate with legal, compliance, and risk management teams as well to ensure successful launches and adherence to regulatory standards.</li>\n<li style=\"\"><strong>Product Testing and Quality Assurance. </strong>Ensure rigorous testing and quality assurance for new product releases and feature updates. Maintain high standards of performance, security, and reliability.</li>\n<li style=\"\"><strong>Performance Monitoring and Analysis. </strong>Track key performance indicators (KPIs), user engagement metrics, and customer feedback to identify areas for improvement and drive product optimization.</li>\n<li style=\"\"><strong>Professional Development.</strong> You’ll have to stay updated on the latest trends and technologies in fintech, blockchain, and cryptocurrency markets to continuously enhance your knowledge and skills.</li>\n</ul>\n<p><strong><em>Skills needed</em></strong></p>\n<ul style=\"\">\n<li style=\"\">Bachelor's degree in a related field.</li>\n<li style=\"\">Proven experience in product management, preferably within fintech, banking, or cryptocurrency markets.</li>\n<li style=\"\">Excellent analytical, problem-solving, and critical thinking skills.</li>\n<li style=\"\">Strong communication and interpersonal skills, with the ability to collaborate effectively in a global, multicultural environment.</li>\n<li style=\"\">Detail-oriented with strong organizational and project management abilities.</li>\n<li style=\"\">Experience with market research, data analysis, and performance monitoring.</li>\n<li style=\"\">Knowledge of treasury management and corporate banking is a plus.</li>\n</ul>\n<p><strong><em>Other requirements</em></strong></p>\n<ul style=\"\">\n<li style=\"\">A dedicated workspace.</li>\n<li style=\"\">A reliable internet connection with the fastest speed possible in your area.</li>\n<li style=\"\">Devices and other essential equipment that meet minimal technical specifications.</li>\n<li style=\"\">Alignment with Our Values and the Xapo Values-Driven Leadership principles.</li>\n</ul>\n<div class='\"content-conclusion\"'>\n<p><strong>Why work for Xapo?</strong></p>\n<p>IMPACT GLOBALLY, WORK REMOTELY.</p>\n<ul style=\"\">\n<li style=\"\"><strong>Shape the Future:</strong> Improve lives through cutting-edge technology, work 100% remotely from anywhere in the world.</li>\n<li style=\"\"><strong>Great work-life balance:</strong> Build amazing things with a balance of autonomy and collaborative teamwork. Set your own work schedule and make use of a flexible PTO plan when you need to recharge. </li>\n<li style=\"\"><strong>Expect Excellence:</strong> Collaborate, learn, and grow with a high-performance team. Learn how you learn best - from books to conferences, you’ll get a yearly budget for your individual learning and development goals.</li>\n</ul>\n<p><strong>At Xapo, we prioritize consumer protection and adhere to regulatory requirements by ensuring that all Xapiens are accountable for upholding principles of fair treatment, transparency, and ethical conduct in their interactions with customers and stakeholders.</strong></p>\n</div>\n<img src=\"https://remotive.com/job/track/1920043/blank.gif?source=public_api\" alt=\"\"/>","tags":"[\"product management\",\"market research\"]","pubDate":"2024-07-02 01:21:01.000","link":"https://remotive.com/remote-jobs/product/product-manager-treasury-corporate-accounts-1920043","savedDate":"2024-07-04 03:56:30.957","slug":"product-manager-treasury-corporate-accounts-xapo61-2412"},{"id":4504296221,"title":"Account Executive","company":"Canny","image":"https://remotive.com/job/1921884/logo","description":"<p dir=\"ltr\">Thousands of companies build better software products with the help of Canny’s customer feedback platform. As an<strong> Account Executive </strong>you will work primarily with Business and Growth tier customers. Currently we have a very healthy inbound pipeline and are looking for someone to help us grow our new business approach and channels.</p>\n<p dir=\"ltr\"> </p>\n<p dir=\"ltr\">We are...</p>\n<ul style=\"\">\n<li dir=\"ltr\" style=\"\">\n<p dir=\"ltr\">Fully remote with no office</p>\n</li>\n<li dir=\"ltr\" style=\"\">\n<p dir=\"ltr\">16 people, spread across 5 countries (US, Canada, Mexico, Spain, Turkey)</p>\n</li>\n<li dir=\"ltr\" style=\"\">\n<p dir=\"ltr\">Bootstrapped (no outside funding) and profitable</p>\n</li>\n</ul>\n<p dir=\"ltr\"> </p>\n<p dir=\"ltr\">This role is part of our GTM team, which includes Support, Customer Success, Marketing and Operations. As our only team member focusing on sales you will have a lot of freedom and trust to try new approaches with support from the wider team. We are looking for an experienced solutions orientated SaaS salesperson, who has owned a pipeline from prospect to close and onboarding and is looking to lead our sales vision! </p>\n<p dir=\"ltr\"><br><br></p>\n<p dir=\"ltr\"><strong>The main objectives of this role are:</strong></p>\n<p dir=\"ltr\"><br><strong>Objective #1: Take over our inbound pipeline</strong><strong><br></strong></p>\n<p dir=\"ltr\">Canny gets anywhere from 40-65 pre-qualified demo requests per month. You will;</p>\n<ul style=\"\">\n<li dir=\"ltr\" style=\"\">\n<p dir=\"ltr\">Give demos to qualified leads (Business &amp; Growth tier), doing both discovery and demos in one ~45 minute video call</p>\n</li>\n<li dir=\"ltr\" style=\"\">\n<p dir=\"ltr\">Offer flexible availability to prospects, to facilitate deals from all over the world</p>\n</li>\n<li dir=\"ltr\" style=\"\">\n<p dir=\"ltr\">Nurture customers through the pipeline, to contract/negotiation/close</p>\n</li>\n<li dir=\"ltr\" style=\"\">\n<p dir=\"ltr\">Smoothly transition won customers over to customer success for successful onboarding</p>\n</li>\n<li dir=\"ltr\" style=\"\">\n<p dir=\"ltr\">Help us improve our qualification process, to only offer demos that are a good use of time</p>\n</li>\n<li dir=\"ltr\" style=\"\">\n<p dir=\"ltr\">Record demos and work with our product team to iterate on product knowledge</p>\n</li>\n<li dir=\"ltr\" style=\"\">\n<p dir=\"ltr\">Track feature requests in Canny, so our product team can reduce and unblock dealbreakers</p>\n</li>\n<li dir=\"ltr\" style=\"\">\n<p dir=\"ltr\">Work with marketing on ideas to increase the number of qualified inbound demo requests</p>\n</li>\n</ul>\n<div> </div>\n<p dir=\"ltr\"><strong>Objective #2: Crack outbound sales</strong><strong><br></strong>Historically 99% of our customers have come from inbound channels. Our growth is therefore limited to who visits our website and signs up for an account or demo.</p>\n<ul style=\"\">\n<li dir=\"ltr\" style=\"\">\n<p dir=\"ltr\">Brainstorm and execute on strategies to acquire customers via outbound sales</p>\n</li>\n<li dir=\"ltr\" style=\"\">\n<p dir=\"ltr\">Discover product/compliance blockers and communicate them to our team</p>\n</li>\n<li dir=\"ltr\" style=\"\">\n<p dir=\"ltr\">Identify the users of our competitors and pain points in their process</p>\n</li>\n<li dir=\"ltr\" style=\"\">\n<p dir=\"ltr\">Generally have a hunter mentality, positive attitude, and thick skin for rejection</p>\n</li>\n</ul>\n<div> </div>\n<p dir=\"ltr\"><strong>Objective #3: Lead the sales vision for Canny</strong><strong><br></strong></p>\n<p dir=\"ltr\">As this role is our sole sales team member, we are looking for someone who can execute on day-to-day sales but also has one eye on how to improve our approach to new business and growth. This includes, but is not limited to:</p>\n<ul style=\"\">\n<li dir=\"ltr\" style=\"\">\n<p dir=\"ltr\">Understanding key competitors in our space</p>\n</li>\n<li dir=\"ltr\" style=\"\">\n<p dir=\"ltr\">Update and craft current and future personas based on our customers to understand future markets</p>\n</li>\n<li dir=\"ltr\" style=\"\">\n<p dir=\"ltr\">Inside-sales with our Free, Starter and Growth tier customers to grow accounts</p>\n</li>\n<li dir=\"ltr\" style=\"\">\n<p dir=\"ltr\">Provide advice and guidance on our PLG pipeline</p>\n</li>\n<li dir=\"ltr\" style=\"\">\n<p dir=\"ltr\">Explore partnership opportunities, we already have a few in the pipeline</p>\n</li>\n<li dir=\"ltr\" style=\"\">\n<p dir=\"ltr\">When appropriate, and if you are interested there will be an opportunity to grow our sales team in the future.</p>\n</li>\n</ul>\n<p dir=\"ltr\"><strong> </strong></p>\n<p><strong>Tech you’ll use every day:</strong></p>\n<ul style=\"\">\n<li dir=\"ltr\" style=\"\">\n<p dir=\"ltr\">CRM: HubSpot</p>\n</li>\n<li dir=\"ltr\" style=\"\">\n<p dir=\"ltr\">Sales Automation: Apollo</p>\n</li>\n<li dir=\"ltr\" style=\"\">\n<p dir=\"ltr\">Customer Support: Intercom</p>\n</li>\n<li dir=\"ltr\" style=\"\">\n<p dir=\"ltr\">Call recording: tl;dv</p>\n</li>\n<li dir=\"ltr\" style=\"\">\n<p dir=\"ltr\">Video Calls: Zoom</p>\n</li>\n<li dir=\"ltr\" style=\"\">\n<p dir=\"ltr\">Team Communication: Slack, Notion, Missive (email)</p>\n</li>\n</ul>\n<p dir=\"ltr\">We have flexibility and budget for additional tools, just mainly care that they are great tools, cost effective, and integrate with our existing stack (eg. HubSpot).</p>\n<p dir=\"ltr\"><strong> </strong></p>\n<p dir=\"ltr\"><strong>Compensation</strong></p>\n<ul style=\"\">\n<li dir=\"ltr\" style=\"\">\n<p dir=\"ltr\">OTE $124k-156k USD, uncapped commission</p>\n</li>\n<li dir=\"ltr\" style=\"\">\n<p dir=\"ltr\">50-50 split between base salary and commission</p>\n</li>\n<li dir=\"ltr\" style=\"\">\n<p dir=\"ltr\">Regular compensation reviews (conducted semi-annually)</p>\n</li>\n<li dir=\"ltr\" style=\"\">\n<p dir=\"ltr\">Equity grant</p>\n</li>\n<li dir=\"ltr\" style=\"\">\n<p dir=\"ltr\">20 paid vacation days, 15 paid holidays, and unlimited sick leave.</p>\n</li>\n<li dir=\"ltr\" style=\"\">\n<p dir=\"ltr\">Benefits: medical, dental, and vision insurance</p>\n</li>\n<li dir=\"ltr\" style=\"\">\n<p dir=\"ltr\">In-person team retreats twice a year</p>\n</li>\n</ul>\n<p dir=\"ltr\"><strong>Required Qualifications</strong></p>\n<ul style=\"\">\n<li dir=\"ltr\" style=\"\">\n<p dir=\"ltr\">You have multiple years of professional experience selling SaaS software</p>\n</li>\n<li dir=\"ltr\" style=\"\">\n<p dir=\"ltr\">Experience managing a full sales cycle including your own outreach and pipeline generation</p>\n</li>\n<li dir=\"ltr\" style=\"\">\n<p dir=\"ltr\">Extensive experience working with a CRM, preferably Hubspot</p>\n</li>\n<li dir=\"ltr\" style=\"\">\n<p dir=\"ltr\">Excellent written and verbal communication, with the ability to simplify and translate complex ideas to different audiences</p>\n</li>\n<li dir=\"ltr\" style=\"\">\n<p dir=\"ltr\">Be a self-starter who bring solutions to the table - own your pipeline and be bold</p>\n</li>\n<li dir=\"ltr\" style=\"\">\n<p dir=\"ltr\">You are self-motivated and have strong organization skills</p>\n</li>\n<li dir=\"ltr\" style=\"\">You have demonstrated the ability to onboard and integrate with an organization long-term:\n<ul style=\"\">\n<li dir=\"ltr\" style=\"\">\n<p dir=\"ltr\">within the last 5 years, you've worked at one company for at least 2 years</p>\n</li>\n</ul>\n</li>\n<li dir=\"ltr\" style=\"\">\n<p dir=\"ltr\">You are able to thrive in a fully remote organization</p>\n</li>\n</ul>\n<div> </div>\n<p dir=\"ltr\"><strong>Preferred Qualifications</strong></p>\n<ul style=\"\">\n<li dir=\"ltr\" style=\"\">\n<p dir=\"ltr\">You have experience in the feedback management space, or selling to Product Managers</p>\n</li>\n<li dir=\"ltr\" style=\"\">\n<p dir=\"ltr\">Experience with outbound sales</p>\n</li>\n<li dir=\"ltr\" style=\"\">\n<p dir=\"ltr\">Experience working with a remote team</p>\n</li>\n<li dir=\"ltr\" style=\"\">\n<p dir=\"ltr\">Experience training and coaching other sales people</p>\n</li>\n</ul>\n<p> </p>\n<p dir=\"ltr\"><strong>Apply:</strong></p>\n<ul style=\"\">\n<li dir=\"ltr\" style=\"\">\n<p dir=\"ltr\"> In your application, please submit your resume, an optional cover letter, and explain your motivation to join Canny (we genuinely value understanding why you're drawn to us!) and a 3 minute Loom video explaining why you are a great fit for this role!</p>\n</li>\n<li dir=\"ltr\" style=\"\">\n<p dir=\"ltr\">A heads-up: Every application is carefully reviewed by our team. Please answer the screening questions diligently to stand out and ensure your success. Candidates who don't invest time in the screening questions rarely advance.</p>\n</li>\n<li dir=\"ltr\" style=\"\">\n<p dir=\"ltr\">For some extra flair, share a link to your favorite GIF.</p>\n</li>\n</ul>\n<div> </div>\n<p dir=\"ltr\"><strong>Location:</strong></p>\n<ul style=\"\">\n<li dir=\"ltr\" style=\"\">\n<p dir=\"ltr\">This role requires working North American hours to serve our customers best and coordinate with the team. As such, we are only looking to hire candidates based in North or South America.</p>\n</li>\n</ul>\n<img src=\"https://remotive.com/job/track/1921884/blank.gif?source=public_api\" alt=\"\"/>","tags":"[\"saas sales\"]","pubDate":"2024-07-02 01:20:54.000","link":"https://remotive.com/remote-jobs/sales-business/account-executive-1921884","savedDate":"2024-07-04 03:56:30.957","slug":"account-executive-canny-3597"},{"id":9885181886,"title":"Affiliate Manager","company":"Scholarship Owl","image":"https://remotive.com/job/1920967/logo","description":"<p><u>Are you a dynamic and results-driven individual with a passion for marketing? Do you thrive in a fast-paced environment and enjoy building relationships? If so, ScholarshipOwl is looking for an Affiliate Manager to join our Marketing department!</u></p>\n<div class=\"h3\">Who you are:</div>\n<p>You're data-driven, thrive on open communication, and act with integrity. Results-focused and customer-centric, you're always learning and innovating to delight. Sounds like you? You could be our next Affiliate Manager!</p>\n<div class=\"h3\">Who we are:</div>\n<p>ScholarshipOwl is the world's largest scholarship platform, leveraging AI technology to connect brands with Gen Z through scholarships. We simplify access to education, making it easier for students to achieve their academic goals while providing brands a unique opportunity to engage with the next generation. Join us in making a difference in students' lives and shaping the future of education.</p>\n<div class=\"h3\">What you will do:</div>\n<p>As an Affiliate Manager, you will play a crucial role in driving our affiliate marketing strategy and growing our network of partners. You will be responsible for building and maintaining relationships with affiliates, optimizing campaigns, and driving revenue growth. Your goal will be to build a strong affiliate network that aligns with our company’s objectives and values.</p>\n<p><u>Responsibilities:</u></p>\n<ul style=\"\">\n<li style=\"\"><strong>Find &amp; Welcome New Affiliates</strong>: We're always on the lookout to expand our affiliate network.</li>\n<li style=\"\"><strong>Cherish Our Current Partners</strong>: Keeping in touch and supporting our existing affiliates is key to our mutual success.</li>\n<li style=\"\"><strong>Craft &amp; Execute Winning Strategies</strong>: Brainstorm and roll out innovative marketing plans to boost both traffic and revenue.</li>\n<li style=\"\"><strong>Keep an Eye on Performance</strong>: With a keen eye on data, we fine-tune our campaigns for the best outcomes.</li>\n<li style=\"\"><strong>Teamwork Makes the Dream Work</strong>: Collaborating closely with other teams ensures our affiliate projects run smoothly.</li>\n<li style=\"\"><strong>Stay Sharp &amp; Informed</strong>: Keep on learning, stay ahead of the curve with the latest in affiliate marketing trends and practices.</li>\n</ul>\n<div class=\"h3\">Requirements:</div>\n<ul style=\"\">\n<li style=\"\"><span style=\"color: #c0504d;\"><span style=\"color: #000000;\">Prior experience in affiliate marketing or a similar role</span></span></li>\n<li style=\"\">Proven track record of successfully managing affiliate programs and driving revenue growth</li>\n<li style=\"\">Comprehensive understanding of the affiliate marketing ecosystem and performance marketing metrics</li>\n<li style=\"\"><span style=\"color: #c0504d;\"><span style=\"color: #000000;\">Experience with affiliate marketing platforms (Tune.com, Affise, etc)</span></span></li>\n<li style=\"\">Strong analytical skills and ability to interpret data to make informed decisions</li>\n<li style=\"\">Excellent communication and relationship-building skills</li>\n<li style=\"\">Passion for marketing and staying ahead of industry trends</li>\n</ul>\n<div class=\"h3\">What we offer:</div>\n<ul style=\"\">\n<li style=\"\"><strong>Unlimited PTO:</strong> Recharge and explore your passions with generous paid time off</li>\n<li style=\"\"><strong>Talent Powerhouse:</strong> Collaborate with brilliant minds and learn from the best in the industry</li>\n<li style=\"\"><strong>Global Community:</strong> Meet and be inspired by your colleagues across the globe through yearly company off-sites</li>\n<li style=\"\"><strong>Work-Life Harmony:</strong> Flexible work schedule and location for maximum productivity and well-being</li>\n<li style=\"\"><strong>Invest in Your Space:</strong> Enjoy a $200 monthly allowance to create a comfortable and inspiring home office</li>\n<li style=\"\"><strong>Remote-First Culture:</strong> Experience the flexibility and freedom of remote work, with all the support you need</li>\n</ul>\n<p>If you are driven by a passion for affiliate marketing and possess a proactive attitude, we are eager to connect with you! Join our team at ScholarshipOwl help us help students revolutionize their financing, while they fall in love with brands.</p>\n<p> </p>\n<p><strong>Note: This is a fully remote position open to candidates globally; no specific location requirements.</strong><strong><br></strong></p>\n<img src=\"https://remotive.com/job/track/1920967/blank.gif?source=public_api\" alt=\"\"/>","tags":"[\"marketing strategy\"]","pubDate":"2024-07-02 01:20:47.000","link":"https://remotive.com/remote-jobs/marketing/affiliate-manager-1920967","savedDate":"2024-07-04 03:56:30.957","slug":"affiliate-manager-scholarship-owl-7999"},{"id":9923153860,"title":"HR Intern (Immediate Hire) - Fully Remote","company":"CoverGo","image":"https://pbs.twimg.com/profile_images/1382655628523364355/MWPIbbID_400x400.jpg","description":"<p><strong>Top 3 Reasons To Join Us</strong></p><ul> <li>International Environment</li> <li>100% Remote</li> <li>Exposure to Diverse HR Functions</li> </ul><p><strong>About Us</strong></p><p>At CoverGo, our mission is to empower all insurance companies to make insurance 100% digital and accessible to everyone.</p><ul> <li>We are a leading global no-code insurance platform for health, life, and P&amp;C</li> <li>We’re the winner of the Insurtech of the Year in all of Asia and other awards globally</li> <li>We work with insurance enterprise clients such as AXA, Bupa, MSIG, Dai-ichi, Bank of China Group Insurance, and many more</li> <li>We're an international, diverse team of over 120 people with 30 nationalities and team members working remotely from all over the world</li> <li>We are fully funded and backed by reputable VC funds and strategic institutional investors</li> <li>We have a global presence in Asia, EMEA and the Americas</li> <li>We’ve grown our annualized revenue by over 30x since January 2021</li> <li>We’re constantly working towards making CoverGo a workplace that you love coming to. We deeply believe that bringing together a diversity of thoughts, expressions, and perspectives is key to building the best culture for equally diverse communities all over the world</li> </ul><p><strong>About the Role</strong></p><p>We are seeking a motivated and enthusiastic Human Resources Intern to join our HR team. This is a fantastic opportunity for a student or recent graduate who is looking to gain practical experience in a dynamic and fast-paced environment.</p><p>The HR Intern will assist with various HR tasks and projects, including recruitment, employee onboarding, HR administration, and employee engagement initiatives.</p><p><strong>What You Will Do</strong></p><ul> <li>Assist with recruitment activities, such as posting job ads, screening resumes, and scheduling interviews</li> <li>Support the onboarding process for new hires</li> <li>Assist with HR administrative tasks, including but not limited to maintaining employee records and updating HR databases</li> <li>Organize employee engagement initiatives and events</li> <li>Contribute to HR projects and process improvements</li> <li>Provide general HR support as needed</li> </ul><p><strong>What We Need</strong></p><ul> <li>Currently enrolled in a Bachelor's degree program in Human Resources, Business Administration, or a related field, or a recent graduate</li> <li>Strong organizational and time management skills</li> <li>Excellent communication and interpersonal skills</li> <li>Ability to maintain confidentiality and handle sensitive information</li> <li>Proficiency in Google Workspace</li> <li>Keen attention to detail</li> <li>Proactive and willing to take initiative</li> <li>Ability to work collaboratively in a team environment</li> <li>Positive attitude and eagerness to learn</li> <li>Must be based in the Philippines</li> <li>Please be advised that this internship opportunity is unpaid</li> </ul><p><strong>Why You'll Love Working Here</strong></p><ul> <li>Remote Setup</li> <li>International Environment</li> <li>Professional Development Opportunities</li> <li>Company activities and events</li> </ul><p><strong>CoverGo Company</strong><a href=\"https://www.youtube.com/watch?v=YI0ezLxvFvA\" rel=\"nofollow noreferrer noopener\" class=\"external\"><strong> Video</strong></a></p><p>By submitting your application, you confirm that you have read, understood, and accepted the content of CoverGo’s <a href=\"https://apply.workable.com/covergo/gdpr_policy?lng=en\" target=\"_blank\" rel=\"nofollow noreferrer noopener\" class=\"external\">Privacy Notice</a> and you consent to the processing of your data as part of this application.</p><h3>Requirements: </h3><h3>Benefits: </h3>","tags":"[\"management\",\"database\"]","pubDate":"2024-07-02 00:00:00.000","link":"https://apply.workable.com/covergo/j/AB88EB2929","savedDate":"2024-07-04 03:56:30.962","slug":"hr-intern-immediate-hire-fully-remote-covergo-8912"},{"id":5576387603,"title":"Credit Analytics Manager (Remote)","company":"Empower","image":"https://lever-client-logos.s3.us-west-2.amazonaws.com/2e1a369c-b58f-41ac-8d86-4b0a77695e68-1687915522032.png","description":"<div><b style=\"font-size: 24px\">EMPOWER OVERVIEW</b></div><div><br></div><div><a href=\"http://empower.me/\" class=\"postings-link\">Empower</a>&nbsp;is a high-growth financial technology company on a mission to expand access to fair credit to give anyone in the world the opportunity to improve their financial security and mobility. We dream up and launch one-of-a-kind features that help our members get money instantly whenever they need it, save for the future, and rewrite their financial story. Our members see Empower Cash Advance as a life-saver, Empower Automatic Savings as a game-changer, and the new Empower Thrive line of credit as a lifeline to low-cost borrowing and the only practical path to building good credit.</div><div><br></div><div>Empower is backed by Sequoia Capital, Blisce, and Icon Ventures. Are we the next great place to grow your impact and accelerate your career? We think so:</div><div><br></div><div>Inc. ranked Empower #56 in the 2023 Inc. 5000 list of the fastest-growing private companies in the US (#55 in 2022). Forbes put Empower on its 2023 list of America's Best Startup Employers. Fast Company recognized the new Empower Thrive line of credit in their 2022 list of the Next Big Things in Tech. </div><div><br></div><div><b style=\"font-size: 18px\">THE EMPOWER WAY</b></div><div><b>Great Expectations</b>: We come up with bold, audacious goals for ourselves and go all out for impact</div><div><b>Owner Mindset</b>: We give every employee latitude to act independently, make smart choices, and move the business forward</div><div><b>Spirited Debate</b>: We love skeptics and seek counter opinions to challenge our personal assumptions and expand our view</div><div><b>Customer Obsession: </b>We listen to understand, empathize, and create a memorable, rewarding experience for our community</div><div><b>Inclusive Collaboration</b>: We believe diverse teams make the best decisions, and we strive to give diverse voices a seat at the table</div><div>N<b>o Jerks Allowed</b>: We value our relationships and take the time to build trust and connection and communicate respectfully</div><div><b>&nbsp;</b></div><div><b>&nbsp;</b></div><div><b style=\"font-size: 18px\">WHAT EMPOWER OFFERS</b></div><div>Competitive salary</div><div>Generous equity package</div><div>Full healthcare and dental benefits</div><div>Technology&nbsp; expense reimbursement</div><div>Work&nbsp; from anywhere</div><div><br></div><div><b style=\"font-size: 18px\">JOB DESCRIPTION</b></div><div>Empower is searching for a talented analyst to develop customer management strategies for our newly acquired Credit Card product. This role is an exciting opportunity to join a high growth company and have a material impact on a new product segment within the business. This role will sit on the Credit and Data Science team, and while focusing on the Credit Card product, will have the opportunity to learn from credit developments and best practices in Empower’s other established lines of business.\\</div><div><br></div><div>The ideal candidate is passionate about using data and analytics to drive business growth and help customers improve their financial situations. This individual and their team will own workstreams across credit policy, testing, and valuations and will be asked to take projects from ideation to execution. They will also need to partner with product, tech, and finance teams to build out solutions that differentiate Empower. The right person for this role is someone who shines while solving complex problems and is comfortable with a wide variety of technical tools. </div><div><br></div><div>Travel for company offsites is expected at a minimum 2 times a year. </div><div>For US based employee's, this salary range includes multiple career levels of consideration and will be discussed further during the interview process. The salary range is based on a variety of factors such as candidate experience, qualifications, and business needs. The base pay range is subject to change and may be modified in the future.</div><h3>Key Responsibilities</h3><li><b>Build customer management infrastructure for Empower’s new Credit Card product, including:</b></li><li>credit limit increase policies</li><li>loss mitigation policies and tools</li><li>broad tests to optimize the future business</li><li>valuations models</li><li>customer management score models (in conjunction with Empower’s Data Science team)</li><li>automated systems to monitor business performance </li><li><b>Collaborate effectively with:</b></li><li>Finance to ensure the work fits into the broader company strategy&nbsp;</li><li>Product and Marketing to ensure we keep customers engaged with the product</li><li>Operations and External Vendors to ensure seamless execution of loss mitigation strategies</li><li>Data Infrastructure to ensure sound data quality used for analytics</li>,<h3>Candidate Qualifications</h3><li>B.S. degree in engineering, business, finance, computer science or mathematics&nbsp;</li><li>3+ years industry experience in data analytics and credit risk management&nbsp;</li><li>Experience designing tests and building credit policies&nbsp;Strong SQL and Python abilities</li><li>Adaptable to pick up new tools and analytical methods</li><li>Comfort working with a variety of cross functional partners in tech, product, credit, and business</li><li>Strong and structured approach to problem solving and ability to use of frameworks to communicate complex topics in an effective manner</li><li>(Preferred) At least two year at a bank or FinTech working in credit analytics</li><div>At Empower, we hire for people that push themselves to understand others and seek out ways to challenge their personal assumptions. Our hope is that by fostering such an environment, we strengthen our business and relationships by putting people first. We are committed to building a diverse, inclusive, and equitable workspace where everyone (regardless of age, education, ethnicity, gender, sexual orientation, or any personal characteristics) feels like they belong. Even if your experience doesn’t exactly match up to our job description, you should feel empowered to apply regardless!&nbsp;</div>","tags":"[\"Finance\",\"management\",\"engineering\"]","pubDate":"2024-07-01 20:50:34.272","link":"https://jobs.lever.co/empower.me/778868f2-ff2d-4382-aa66-7880c3d8cc3f","savedDate":"2024-07-04 03:56:30.962","slug":"credit-analytics-manager-remote-empower-8366"},{"id":1177774417,"title":"Institutional & DeFi Business Director","company":"Avara","image":"https://pbs.twimg.com/profile_images/1725197105923293184/0HcwlDMy_400x400.jpg","description":"<div><b style=\"font-size: 18px\">About us:</b><span style=\"font-size: 18px\">&nbsp;</span></div><div><br></div><div><span style=\"font-size: 16px\">Avara builds innovative products leveraging blockchain technologies. Avara's suite includes the Aave Protocol, along with the native stablecoin GHO, Lens, an open social network, and Family, a design-first mobile crypto wallet. Avara's vision is to build a people-powered internet that benefits all.</span></div><div><br></div><div><b style=\"font-size: 18px\">Our culture:</b><span style=\"font-size: 18px\">&nbsp;</span></div><div><br></div><div><span style=\"font-size: 16px\">Having cultivated a thriving, collaborative culture, our team is kind, welcoming and passionate about what we are building. We celebrate differences and seek to develop and retain the most talented people from a diverse candidate pool from all over the world. No matter where you are based, no ghost will be left behind and we appreciate every moment we get to work and have fun together.</span></div><div><br></div><div><b style=\"font-size: 18px\">About the role:</b></div><div><br></div><div><span style=\"font-size: 16px\">This role focuses on the Aave Protocol product within Aave Labs, emphasizing product development in collaboration with institutional partners. As an individual contributor, you will work closely with leadership, product, and engineering teams to drive these collaborative efforts.</span></div><div><b style=\"font-size: 18px;\">About us:</b><span style=\"font-size: 18px;\">&nbsp;</span></div><div><br></div><div><span style=\"font-size: 16px;\">Avara builds innovative products leveraging blockchain technologies. Avara's suite includes the Aave Protocol, along with the native stablecoin GHO, Lens, an open social network, and Family, a design-first mobile crypto wallet. Avara's vision is to build a people-powered internet that benefits all.</span></div><div><br></div><div><b style=\"font-size: 18px;\">Our culture:</b><span style=\"font-size: 18px;\">&nbsp;</span></div><div><br></div><div><span style=\"font-size: 16px;\">Having cultivated a thriving, collaborative culture, our team is kind, welcoming and passionate about what we are building. We celebrate differences and seek to develop and retain the most talented people from a diverse candidate pool from all over the world. No matter where you are based, no ghost will be left behind and we appreciate every moment we get to work and have fun together.</span></div><div><br></div><div><b style=\"font-size: 18px;\">About the role:</b></div><div><br></div><div><span style=\"font-size: 16px;\">This role focuses on the Aave Protocol product within Aave Labs, emphasizing product development in collaboration with institutional partners. As an individual contributor, you will work closely with leadership, product, and engineering teams to drive these collaborative efforts.</span></div><h3>How you can make an impact:</h3><li>Become a leading expert in Aave’s DeFi product suite including both Aave Protocol and GHO.</li><li>Develop and implement a business development strategy for Institutional DeFi both near and long-term growth objectives for this segment.</li><li>Collaborate with the Head of Growth and leadership to create a comprehensive program positioning Aave as the premier DeFi partner for financial institutions.</li><li>Establish and nurture relationships with financial institutions interested in DeFi, driving substantial commercial and product collaborations.</li><li>Work with key large scale collaborators within the ecosystem including DeFi projects, CeFi exchanges, blockchain protocols and other key industry players to grow distribution and market share.</li><li>Work closely with cross-functional team leads, including product, engineering, and marketing, to introduce new offerings to the market.</li><li>Represent Aave Labs at key industry events and conferences, enhancing its presence in the blockchain ecosystem. Serve as a PR representative and spokesperson for Aave in the region with institutional partners.</li><h3>Let's connect if:</h3><li>7-10+ years of business development experience within the financial services industry or a related industry. Corporate development experience a plus.</li><li>Proven expertise in forming strategic partnerships and managing complex projects. Experienced in creating and negotiating commercial agreements beyond standard sales contracts, collaborating with technical teams, lawyers, and marketers.</li><li>Strong passion for crypto and decentralization, with a solid understanding of crypto native products (staking, DeFi, etc.).</li><li>Deep familiarity with blockchain technology, Institutional DeFi, and the regulatory landscape of digital assets preferred.</li><li>Skill in effectively assessing the most promising high impact opportunities while efficiently managing others.</li><li>Exceptional communication, negotiation, and interpersonal skills to advance deals and projects.</li><li>Strong reputation and extensive network with industry leaders across capital markets.</li><div>Haven’t quite met all the criteria? Let’s not miss out on the chance to speak. Whilst you might not meet every single requirement, you might bring other, more exciting skills to the companies! </div><div><br></div><div><b>What we stand for: </b></div><div><br></div><div><i><b>Craft</b> — Seek excellence.</i></div><div><b>Accountability</b> —&nbsp;<i>One for all. All for one.</i></div><div><b>Integrity</b> —&nbsp;<i>Be true.</i></div><div><i><b>Sisu</b> — Dig deep.</i></div><div><b>Community</b> —&nbsp;<i>We’re in it together.</i>&nbsp;</div><div><br></div><div><b>Equal opportunities statement:</b>&nbsp;</div><div><br></div><div>Avara celebrates diversity and views each and every team member as a separate individual with their own unique identity. No matter your race, religion, gender, ethnicity, age, disability, sexual orientation or even the wallet you use, we welcome you at Avara. As an equal opportunities employer, we take accountability and believe in everyone's potential to build, create and inspire changes. With a mission to build a diverse workforce, we are proud to foster a working environment in which everyone can feel safe and valued for who they are.</div>","tags":"[\"engineering\"]","pubDate":"2024-07-01 12:54:50.434","link":"https://jobs.eu.lever.co/avara/7bb1c346-98a4-499b-8105-11f4b4554232","savedDate":"2024-07-04 03:56:30.965","slug":"institutional-defi-business-director-avara-6440"},{"id":4508648385,"title":"Social Media & Email Marketing Lead (Growth Team)","company":"Pluto Card","image":"https://pbs.twimg.com/profile_images/1520019984780513281/qnVtutKu_400x400.jpg","description":"<h3><strong>About Pluto</strong></h3><p>Pluto is the Enterprise Spend Management platform for MENA serving the $30 Trillion+ B2B Payments market. Pluto has been awarded the \"Corporate solutions of the year\" by the Middle Eastern Fintech Association.</p><p>Pluto is backed by some of Silicon Valley’s top-tier venture capital firms. We’ve raised $7M Seed from top investors and operators, including founders from Ramp, Airbase, Plaid, Italic &amp; Senior Leadership at Shopify, Cash App,&nbsp;<a href=\"http://checkout.com/\" target=\"_blank\" rel=\"nofollow noreferrer noopener\" class=\"external\">Checkout.com</a>, Alloy and some of the worlds most successful FinTech VCs like GFC, Graph Ventures, Soma Capital, Adapt Ventures, amongst others who’ve trusted us 🤩</p><p>With the vision of building a modern financial operating system for businesses in MENA, we’re at the tipping point of a fintech revolution. We’re a lean but impactful team that dreams big and believes in making the impossible happen - and we are looking for someone equally motivated who wants to make their mark and help us expand our horizons.</p><p></p><h3><strong>About this role </strong></h3><p><strong>Creative 🎨</strong></p><p><strong>Viral Media 📣</strong></p><p><strong>Not afraid to stand out 😤</strong></p><p><strong>Data Driven 📈</strong></p><p></p><p>If these words reasonate with you, you are likely the right fit. </p><p></p><p>We are looking for Growth Marketer to handle our social media &amp; e-mail marketing channels and help Pluto get reach through ALL digital channels. </p><p></p><p>You will be responsible for strategizing, planning &amp; creating content that drives Pluto's Brand all across the Middle East &amp; Beyond.</p><p></p><p>Your goals: </p><p>Goal #1: get Pluto in front of our ICP (CFOs, Finance, Procurement managers) by any means necessary! </p><p>Goal #2: turn our digital channels into a lead magnet.</p><h3>Requirements: </h3><ul> <li>Must have a portfolio (please do not apply to this role if you do not have a portfolio). </li> <li>Must have previously been responsible for growing digital channels with clear data indicators of your effort being successful.</li> <li>Strong copywriting skills.</li> <li>Strong content creation skills - you are able to create video &amp; image content on your own. </li> <li>Able to present on camera - you aren't camera shy! </li> <li>Ability to balance out fun &amp; corporate content to create a strong content calendar that relates to our ICP.</li> <li>Strong understanding of different marketing tools: Figma, Canva, Adobe Suite, Taplio, Planning software, Hubspot etc. </li> <li>Strong understanding of e-mail marketing channels and data cleaning: Hubspot, workflow sequences, Klaviyo etc.</li> <li>At least 3 years of experience in similar roles. </li> </ul><h3>Benefits: </h3><ul><ul> <li>Hybrid and flexible work culture</li> <li>Competitive Base Pay</li> <li>Insurance stipends provided for remote employees </li> <li>A Macbook and work from home stipend! </li> <li>Frequent team wide off sites </li> </ul></ul>","tags":"[\"Finance\",\"management\",\"B2B\"]","pubDate":"2024-07-01 00:00:00.000","link":"https://apply.workable.com/pluto-card/j/4E553328D1","savedDate":"2024-07-04 03:56:30.961","slug":"social-media-email-marketing-lead-growth-team-pluto-card-2734"},{"id":1343374436,"title":"Senior Kernel Developer for KernelCare (worldwide remote, work anywhere)","company":"CloudLinux","image":"https://pbs.twimg.com/profile_images/696718028084482050/ymY3OEPk_400x400.png","description":"<p>We are looking for <strong>Senior Kernel Developer</strong> to work on our KernelCare team. The ideal candidate is someone looking for a rewarding and challenging career developing Linux Kernels and patches. This role requires someone with strong C development skills and a passion for all that is Linux. Our Kernel Developers create patches with a cyber security focus while finding solutions for our customers. Please note, this is <strong>not</strong> an embedded Kernel role. </p><p>KernelCare is a product of CloudLinux Inc., the maker of the #1 OS in security and stability for hosting providers. KernelCare, a live kernel patching service provides security patches and bug fixes for a range of popular Linux kernels that can be installed without rebooting the system. Check out our website for more information about our KernelCare Product <a href=\"https://tuxcare.com/live-patching-services/\" rel=\"nofollow noreferrer noopener\" class=\"external\">https://tuxcare.com/live-patching-services/</a></p><p></p><p>We are truly a great place to work. </p><p><strong>As our Senior Kernel Developer, you will be responsible for:</strong></p><ul> <li>Support existing functionality and implementation of several new features</li> <li>Update existing kernels including security fixes and CVEs patches</li> <li>Develop and support Python and Bash scripts for task automation</li> </ul><h3>Requirements: </h3><p><strong>To be successful in this role you should have:</strong></p><ul> <li>Excellent C programming and debugging skills</li> <li>Good level knowledge of Linux kernel core subsystems</li> <li>CPU and cache architectures</li> <li>Experience with GDB and other debuggers</li> <li>CPU performance and power analysis</li> <li>Independent and self-motivated problem solver and strategic thinker</li> <li>Proficient in Git for development and patch/branch management</li> <li>Good planning, time management, decision-making, presentation, and organization skills</li> <li>Effective written and verbal communication</li> <li>Excellent interpersonal and teamwork skills</li> <li>Happy in an agile, fast-paced environment</li> </ul><ul> <li>Experience with python, shell scripting</li> <li>Experience with Jenkins</li> </ul><h3>Benefits: </h3><p><strong>What's in it for you?</strong></p><ul> <li>Focus on professional development;</li> <ul> <li>Training reimbursements</li> <li>Mentor programs</li> <li>Knowledge-Exchange programs</li> <li>Interesting and challenging projects</li> </ul> <li>Flexible working hours</li> <li>Paid one month vacation per year and unlimited sick leave</li> <li>Medical insurance reimbursement</li> <li>Co-working and gym/sports reimbursement</li> <li>The opportunity to receive a reward for the most innovative idea that the company can patent</li> </ul><p></p><p><em>By applying for this position, you agree with </em><a href=\"https://cloudlinux.com/privacy-policy\" rel=\"nofollow noreferrer noopener\" class=\"external\"><em>Cloudlinux Privacy Policy</em></a><em> and give us your consent to maintain and process your personal data with this respect. Please read our Privacy Policy for more information.</em></p>","tags":"[\"management\",\"cyber security\"]","pubDate":"2024-07-01 00:00:00.000","link":"https://apply.workable.com/cloudlinux-1/j/B84C27B7AF","savedDate":"2024-07-04 03:56:30.961","slug":"senior-kernel-developer-for-kernelcare-worldwide-remote-work-anywhere-cloudlinux-6486"},{"id":5758753589,"title":"Sr. Data Scientist - Remote","company":"Empower","image":"https://lever-client-logos.s3.us-west-2.amazonaws.com/2e1a369c-b58f-41ac-8d86-4b0a77695e68-1687915522032.png","description":"<div><b style=\"font-size: 24px\">EMPOWER OVERVIEW</b></div><div><br></div><div><a href=\"http://empower.me/\" class=\"postings-link\">Empower</a>&nbsp;is a high-growth financial technology company on a mission to expand access to fair credit to give anyone in the world the opportunity to improve their financial security and mobility. We dream up and launch one-of-a-kind features that help our members get money instantly whenever they need it, save for the future, and rewrite their financial story. Our members see Empower Cash Advance as a life-saver, Empower Automatic Savings as a game-changer, and the new Empower Thrive line of credit as a lifeline to low-cost borrowing and the only practical path to building good credit.</div><div><br></div><div>Empower is backed by Sequoia Capital, Blisce, and Icon Ventures. Are we the next great place to grow your impact and accelerate your career? We think so:</div><div><br></div><div>Inc. ranked Empower #56 in the 2023 Inc. 5000 list of the fastest-growing private companies in the US (#55 in 2022). Forbes put Empower on its 2023 list of America's Best Startup Employers. Fast Company recognized the new Empower Thrive line of credit in their 2022 list of the Next Big Things in Tech. </div><div><br></div><div><b style=\"font-size: 18px\">THE EMPOWER WAY</b></div><div><b>Great Expectations</b>: We come up with bold, audacious goals for ourselves and go all out for impact</div><div><b>Owner Mindset</b>: We give every employee latitude to act independently, make smart choices, and move the business forward</div><div><b>Spirited Debate</b>: We love skeptics and seek counter opinions to challenge our personal assumptions and expand our view</div><div><b>Customer Obsession: </b>We listen to understand, empathize, and create a memorable, rewarding experience for our community</div><div><b>Inclusive Collaboration</b>: We believe diverse teams make the best decisions, and we strive to give diverse voices a seat at the table</div><div>N<b>o Jerks Allowed</b>: We value our relationships and take the time to build trust and connection and communicate respectfully</div><div><b>&nbsp;</b></div><div><b>&nbsp;</b></div><div><b style=\"font-size: 18px\">WHAT EMPOWER OFFERS</b></div><div>Competitive salary</div><div>Generous equity package</div><div>Full healthcare and dental benefits</div><div>Technology&nbsp; expense reimbursement</div><div>Work&nbsp; from anywhere</div><div><br></div><div><b style=\"font-size: 18px\">JOB DESCRIPTION</b></div><div><br></div><div>Our data scientists are responsible for the entire model development process from conception with stakeholders, creation of model pipelines, technical development, deployment, and partnership with the credit, product, and finance teams to make business decisions.</div><div><br></div><div>The ideal candidate is passionate about using data and models to drive business growth and help customers improve their financial situations.&nbsp; This individual will own creating and improving credit risk models to help the business decrease loss rates and increase approval rates. They will also need to partner with product, tech, and finance teams to build out solutions that drive value for Empower and our customers.&nbsp; The right person for this role is someone who shines while solving complex problems and is comfortable with a wide variety of technical tools.</div><h3>Key Responsibilities</h3><li>Grow user base and increase retention through machine learning and analytics</li><li>Build machine learning models with large scale data sets to address business priorities</li><li>Design and influence strategies on underwriting, marketing, fraud and customer experience</li><li>Work closely with our engineering team as you implement models in production&nbsp;</li><li>Collaborate effectively with operations and product to ensure the work fits into the broader strategy and business context</li><li>Develop data standards and analytics pipelines to facilitate current and future analysis</li>,<h3>Candidate Qualifications</h3><li>BS degree in engineering, computer science, finance or mathematics</li><li>5+ years industry experience in data mining, machine learning, statistical analysis, and/or predictive modeling</li><li>Deep understanding of statistics and machine learning techniques, including regression, classification, clustering and optimization&nbsp;Experience building predictive models from scratch</li><li>Strong programming skills (Python preferred) with intermediate to advanced knowledge of SQL</li><li>Demonstrable experience with ML packages: scikit-learn, LightGBM, XGBoost, SparkML, etc.</li><li>Knowledge in deep learning and experience with DL toolkits (Tensorflow, Keras, PyTorch) is preferred though not required</li><li>Comfort working with a variety of cross functional partners in tech, product, credit, and business</li><li>Strong and structured approach to problem solving and ability to use of frameworks to communicate complex topics in an effective manner</li>,<h3>Preferred Qualifications</h3><li>MS or PhD preferred</li><li>At least 2+ year at a bank or FinTech working in data science or credit analytics is a plus</li><li>Experience in cloud computing (AWS, Azure, etc.) is a plus</li><div><span style=\"font-size: 15px\">At Empower, we hire for people that push themselves to understand others and seek out ways to challenge their personal assumptions. Our hope is that by fostering such an environment, we strengthen our business and relationships by putting people first. We are committed to building a diverse, inclusive, and equitable workspace where everyone (regardless of age, education, ethnicity, gender, sexual orientation, or any personal characteristics) feels like they belong. Even if your experience doesn’t exactly match up to our job description, you should feel empowered to apply regardless!</span></div>","tags":"[\"Finance\",\"engineering\",\"aws\"]","pubDate":"2024-06-21 21:18:55.778","link":"https://jobs.lever.co/empower.me/2d0bc333-9058-4761-a1af-98a8d2b6a189","savedDate":"2024-07-04 03:56:30.963","slug":"sr-data-scientist-remote-empower-7325"}]