[{"id":6635591410,"title":"Developer Relations Intern – Video Content and Technical Writing","company":"Appwrite","image":"https://avatars.githubusercontent.com/u/25003669?s=200&v=4","description":"\n<aside class=\"mask\" style=\"opacity: 1;\"></aside><div class=\"body\" data-columns=\"1\"><div class=\"article\" style=\";\">\n<h2>About the job</h2>\n<p>We are hiring a Developer Advocate Intern to support our Developer Relations team, focusing on creating, editing, and repurposing technical content.</p>\n<p>This isn’t your typical DevRel internship, you won’t be travelling, speaking at conferences, or constantly creating brand-new tutorials. Instead, your main focus will be producing and editing developer-focused video content, such as product walkthroughs and technical tutorials. You'll also be responsible for repurposing existing content from the team into engaging short-form videos, blog posts, and social media clips to maximize reach and impact.</p>\n<p>You’ll work closely with both our engineering, growth, and product teams to ensure content is technically accurate and optimized for multiple platforms. If you’re a developer who enjoys working behind the scenes to amplify technical content and turn one great piece into many - this role is for you.</p>\n</div></div>\n<style>\n                @media only screen and (max-width: 767px) {\n                    #block-1 {\n                        padding-top: 25px !important; padding-bottom: 25px !important;\n                    }\n                }\n                </style>\n\n<aside class=\"mask\" style=\"opacity: 1;\"></aside><div class=\"body\" data-columns=\"1\"><div class=\"article\" style=\";\">\n<h2>Responsibilities</h2>\n<ul>\n<li><p>Edit and produce technical video content - including product walkthroughs, tutorials, and demos for YouTube and other platforms.</p></li>\n<li><p>Transform long-form DevRel videos intMaximize co engaging short-form content for YouTube Shorts, TikTok, Instagram Reels, and other social media platforms.</p></li>\n<li><p>Maximize content reach by adapting and optimizing content for multiple platforms, including YouTube, Medium, <a target=\"_blank\" rel=\"noopener noreferrer nofollow\" href=\"http://Dev.to\">Dev.to</a>, X/Twitter, LinkedIn, TikTok, Instagram, <a target=\"_blank\" rel=\"noopener noreferrer nofollow\" href=\"http://Daily.dev\">Daily.dev</a>, and more.</p></li>\n<li><p>Support with demos and sample projects, occasionally build or modify simple technical demos tied to educational content</p></li>\n<li><p>Collaborate across teams, working closely with Developer Relations, Engineering, Growth, and Product teams to align content with goals and messaging.<br></p></li>\n</ul>\n<h2>Requirements</h2>\n<ul>\n<li><p>You have foundational video editing skills - this is the most important part of the role.</p></li>\n<li><p>You are a developer first - you love to code, build, and solve technical challenges.</p></li>\n<li><p>You have strong writing skills with experience in creating technical blog posts, documentation, or tutorials.</p></li>\n<li><p>You have experience building technical projects and demos.</p></li>\n<li><p>You have a passion for learning new technologies and sharing knowledge.</p></li>\n<li><p>You are comfortable working with cross-functional teams.</p></li>\n<li><p>You are proactive and self-motivated - you can manage your own time and work independently.</p></li>\n</ul>\n</div></div>\n<style>\n                @media only screen and (max-width: 767px) {\n                    #block-2 {\n                        padding-top: 25px !important; padding-bottom: 25px !important;\n                    }\n                }\n                </style>\n","tags":"[\"engineering\"]","pubDate":"2025-04-04T05:41:08.235Z","link":"https://www.appwrite.careers/developer-relations-intern-video-content-and-technical-writing/en","slug":"developer-relations-intern-video-content-and-technical-writing-appwrite-2343"},{"id":5254775925,"title":"Senior Software Engineer - Reporting","company":"Kit","image":"https://avatars.githubusercontent.com/u/10557747?s=200&v=4","description":"&lt;div class=&quot;content-intro&quot;&gt;&lt;h4&gt;Description&lt;/h4&gt;\n&lt;div&gt;\n&lt;p class=&quot;p1&quot;&gt;Kit is an email-first operating system for creators who mean business. We help creators grow and monetize their audience with ease. For coaches, YouTubers, authors, podcasters, and other creatives, there isn’t a better marketing hub to rely on to grow audiences, automate email marketing, and sell digital products - all within one platform. More importantly, there isn’t a team more committed to helping creators earn a living.&lt;/p&gt;\n&lt;p&gt;We’re on a mission to help creators earn $1 billion using our creator marketing platform. We have always been 100% independent and 100% remote. We are proud to have built a product that our customers love, and we look for people who have enthusiasm and belief in our mission, vision, and values to join our team.&lt;/p&gt;\n&lt;p&gt;The Kit culture is one where emotional intelligence is valued, radical candor is encouraged, and where everyone works together to uphold a set of shared team principles.&lt;/p&gt;\n&lt;hr&gt;\n&lt;p&gt;&amp;nbsp;&lt;/p&gt;\n&lt;/div&gt;&lt;/div&gt;&lt;h4&gt;&lt;strong&gt;The role&amp;nbsp;&lt;/strong&gt;&lt;/h4&gt;\n&lt;p style=&quot;line-height: 1.5;&quot;&gt;We are hiring a Senior Software Engineer who enjoys creating beautiful experiences and has empathy for the Creators we serve. You will be joining the Builders Squad, which is responsible for building the suite of tools Creators use to build their emails, landing pages, Creator Profile, and more. This squad builds and supports features that directly impact our growth, conversions, and churn.&lt;/p&gt;\n&lt;p style=&quot;line-height: 1.5;&quot;&gt;To learn more about how our engineering team works, you can peruse&amp;nbsp;&lt;a href=&quot;https://engineering.kit.com/&quot;&gt;our engineering blog&lt;/a&gt;.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Responsibilities&lt;/strong&gt;&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;Own solving problems across the full stack in collaboration with your team&lt;/li&gt;\n&lt;li&gt;Actively participate in driving the technical direction of our codebase&lt;/li&gt;\n&lt;li&gt;Collaborate with team members across the organization&lt;/li&gt;\n&lt;li&gt;Proactive communication with product stakeholders&lt;/li&gt;\n&lt;li&gt;Staying up to date with current technical best practices&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;&lt;strong&gt;Requirements&lt;/strong&gt;&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;Expertise with modern frameworks like React and Tailwind for building high-performance user interfaces.&lt;/li&gt;\n&lt;li&gt;Experience with Ruby on Rails.&lt;/li&gt;\n&lt;li&gt;Previous experience writing code that is accessible, scalable, maintainable, and performant.&lt;/li&gt;\n&lt;li&gt;A keen interest in working closely with Product and Engineering managers on prioritization. That includes analyzing risks and dependencies for proposed features, and providing insight into scope we can cut while still meeting business goals.&lt;/li&gt;\n&lt;li&gt;A commitment to mentoring and teaching other engineers formally and informally.&lt;/li&gt;\n&lt;li&gt;The ability to dive deep into problems, especially in maintaining and improving legacy applications, ensuring long-term stability beyond quick fixes.&lt;/li&gt;\n&lt;li&gt;Ability to take on ambiguous tasks, propose solutions, and independently execute projects. Self-starters with strong initiative are key.&lt;/li&gt;\n&lt;li&gt;A strong growth mindset, leadership, and ownership with a drive to continuously improve and take on new challenges.&lt;/li&gt;\n&lt;li&gt;Strong written and verbal communication skills, with a focus on documenting technical work clearly and making it accessible to all stakeholders.&lt;/li&gt;\n&lt;li&gt;Be autonomous and self-motivated to work effectively in a 100% remote company.&lt;/li&gt;\n&lt;li&gt;Have enthusiasm for and belief in our&lt;a href=&quot;https://kit.com/mission&quot;&gt; mission, vision, and values&lt;/a&gt;.&lt;/li&gt;\n&lt;li&gt;Attend our bi-annual company retreats.&lt;/li&gt;\n&lt;li&gt;At least a 4 hour overlap with teammates based in the east coast.&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;&lt;strong&gt;Nice to haves&lt;/strong&gt;&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;Experience with Onboarding, Activation, and Experimentation. Working on onboarding flows and activation testing.&lt;/li&gt;\n&lt;li&gt;Building or contributing to rich text editors such as,&amp;nbsp;&lt;a href=&quot;https://docs.slatejs.org/&quot;&gt;SlateJS.&lt;/a&gt;&lt;/li&gt;\n&lt;li&gt;Experience building email templates.&lt;/li&gt;\n&lt;/ul&gt;\n&lt;h4&gt;&lt;strong&gt;Compensation + perks + benefits&amp;nbsp;&lt;/strong&gt;&lt;/h4&gt;\n&lt;p&gt;Kit has standardized salaries based on position, no matter where you live. For this role, we’re hiring at a level 3 ($147,000) or a level 4 ($174,000), out of five levels. Level is determined based on experience and our interview process.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Perks + benefits include:&lt;/strong&gt;&lt;/p&gt;\n&lt;ul&gt;\n&lt;li data-stringify-indent=&quot;0&quot; data-stringify-border=&quot;0&quot;&gt;\n&lt;div&gt;&lt;a class=&quot;c-link&quot; href=&quot;https://www.linkedin.com/posts/nathanbarry_convertkit-compensation-model-activity-6991414959247147008-i9V3/?utm_source=share&amp;amp;utm_medium=member_desktop&quot; target=&quot;_blank&quot; data-stringify-link=&quot;https://www.linkedin.com/posts/nathanbarry_convertkit-compensation-model-activity-6991414959247147008-i9V3/?utm_source=share&amp;amp;utm_medium=member_desktop&quot; data-sk=&quot;tooltip_parent&quot;&gt;Profit Sharing&lt;/a&gt;&lt;/div&gt;\n&lt;/li&gt;\n&lt;li data-stringify-indent=&quot;0&quot; data-stringify-border=&quot;0&quot;&gt;Kit equity&lt;/li&gt;\n&lt;li data-stringify-indent=&quot;0&quot; data-stringify-border=&quot;0&quot;&gt;401k with a 5% match&lt;/li&gt;\n&lt;li data-stringify-indent=&quot;0&quot; data-stringify-border=&quot;0&quot;&gt;Monthly medical benefits up to $1,850 a month toward premiums. Dental and vision premiums covered 100%&lt;/li&gt;\n&lt;li data-stringify-indent=&quot;0&quot; data-stringify-border=&quot;0&quot;&gt;$4,000 equipment allowance for your first two years, $3,000 budget every following two years&lt;/li&gt;\n&lt;li data-stringify-indent=&quot;0&quot; data-stringify-border=&quot;0&quot;&gt;Individual learning + development budget ($3,500/year)&lt;/li&gt;\n&lt;li data-stringify-indent=&quot;0&quot; data-stringify-border=&quot;0&quot;&gt;Gender affirming benefits&lt;/li&gt;\n&lt;li data-stringify-indent=&quot;0&quot; data-stringify-border=&quot;0&quot;&gt;Childcare benefit up to $3,000 annually&lt;/li&gt;\n&lt;li data-stringify-indent=&quot;0&quot; data-stringify-border=&quot;0&quot;&gt;Twenty (20) days of paid time off during each year of employment&lt;/li&gt;\n&lt;li data-stringify-indent=&quot;0&quot; data-stringify-border=&quot;0&quot;&gt;Paid paid vacation: An after-tax bonus of $1,000 for taking five consecutive days of vacation where you’re fully unplugged from work&lt;/li&gt;\n&lt;li data-stringify-indent=&quot;0&quot; data-stringify-border=&quot;0&quot;&gt;Ten (10) paid holidays a year&lt;/li&gt;\n&lt;li data-stringify-indent=&quot;0&quot; data-stringify-border=&quot;0&quot;&gt;Two weeks of paid sick time each year, including mental health + well being days&lt;/li&gt;\n&lt;li data-stringify-indent=&quot;0&quot; data-stringify-border=&quot;0&quot;&gt;Twelve (12) weeks paid parental leave and flexible scheduling in your child’s first year&lt;/li&gt;\n&lt;li data-stringify-indent=&quot;0&quot; data-stringify-border=&quot;0&quot;&gt;Up to six weeks of paid bereavement leave, medical leave, and disaster after six months of employment, two weeks of each paid leave in your first six months&lt;/li&gt;\n&lt;li data-stringify-indent=&quot;0&quot; data-stringify-border=&quot;0&quot;&gt;Winter Break Closure: Kit closes for a week at the end of December, giving everyone a collective break to enjoy the holiday season.&amp;nbsp;&lt;em data-stringify-type=&quot;italic&quot;&gt;Essential support services remain available, with teams coordinating to ensure coverage during this period&lt;/em&gt;&lt;/li&gt;\n&lt;li data-stringify-indent=&quot;0&quot; data-stringify-border=&quot;0&quot;&gt;Four-week, paid sabbatical after five years with the team&lt;/li&gt;\n&lt;li&gt;Fantastic in-person or virtual retreats with the team twice a year&lt;/li&gt;\n&lt;/ul&gt;\n&lt;h4&gt;&lt;strong&gt;How to apply&lt;/strong&gt;&lt;/h4&gt;\n&lt;p&gt;We know that most people hate interviewing (we relate!). We aim to make it as good of an experience as we can, and part of that includes keeping you informed during the process.&lt;/p&gt;\n&lt;p&gt;Here’s what you can expect from the process:&lt;/p&gt;\n&lt;ol&gt;\n&lt;li&gt;30 min - Recruiter screen&lt;/li&gt;\n&lt;li&gt;45 min - Hiring manager screen&lt;/li&gt;\n&lt;li&gt;Work Sample&lt;/li&gt;\n&lt;li&gt;60 min - Technical Interview&lt;/li&gt;\n&lt;li&gt;60 min - Culture contribution chat&lt;/li&gt;\n&lt;li&gt;30 min - Hiring manager wrap-up&lt;/li&gt;\n&lt;/ol&gt;\n&lt;p&gt;To get started, complete this application, including answers to the questions on the next page.&lt;strong&gt; We read every single application, and your responses to our application questions help put your experience into context. &lt;/strong&gt;We’ll keep you informed through every step&lt;/p&gt;&lt;div class=&quot;content-conclusion&quot;&gt;&lt;hr&gt;\n&lt;p&gt;&amp;nbsp;&lt;/p&gt;\n&lt;p&gt;Kit is an equal opportunity employer. We value diversity in all of its forms, and we hire the best person we can for each role, no matter your personal background. Research tells us that applicants who are female or non-binary, as well as applicants who are people of color, are less likely to apply for roles they do not feel 100% qualified for. If you think you meet more than 50% of our requirements but fewer than 100% of them, please apply. We’re imperfect communicators, so think of our job postings as the starting point for discussion rather than proof that you shouldn’t apply.&lt;/p&gt;\n&lt;p&gt;Kit does not discriminate on the basis of race, sex, color, religion, age, national origin, marital status, disability, veteran status, genetic information, sexual orientation, gender identity or any other reason prohibited by law in provision of employment opportunities and benefits.&lt;/p&gt;&lt;/div&gt;","tags":"[\"engineering\"]","pubDate":"2025-04-04T03:22:57.000Z","link":"https://job-boards.greenhouse.io/kit/jobs/4698592007","slug":"senior-software-engineer-reporting-kit-394"},{"id":5836625254,"title":"Design Engineer","company":"Supabase","image":"https://avatars.githubusercontent.com/u/54469796?s=200&v=4","description":"<p style=\"min-height:1.5em\">Supabase is an Open Source and fully remote company building developer tools for databases.</p><p style=\"min-height:1.5em\">As a Design Engineer at Supabase, you’ll be a key member of our design team, crafting innovative and user-focused solutions for our open-source database platform. You’ll collaborate closely with Product Owners, Engineers, and other designers to take ideas from concept to completion, ensuring a seamless and intuitive user experience across all Supabase products.</p><p style=\"min-height:1.5em\">Your work will directly impact the developer community, making databases more accessible, powerful, and easy to use. You’ll push boundaries and set new standards in how developers build applications, driving both visual and functional improvements across the Supabase ecosystem.</p><p style=\"min-height:1.5em\">You’ll have opportunities to lead, propose, and execute projects across various products and tools. Whether refining designs, optimizing workflows, enhancing developer tools, or launching new features, your contributions will shape our platform’s future.</p><p style=\"min-height:1.5em\"><strong>We Need:</strong></p><ul style=\"min-height:1.5em\"><li><p style=\"min-height:1.5em\"><strong>Design &amp; Technical Expertise:</strong> Proficiency in tools like Figma (or Sketch/Adobe XD) and strong knowledge of recent front-end trends (React and Next.js).</p></li><li><p style=\"min-height:1.5em\"><strong>Problem-Solver:</strong> Creative thinking to address complex design challenges.</p></li><li><p style=\"min-height:1.5em\"><strong>“Demo Over Essay”:</strong> Ability to align teams with working prototypes, user flows, or high-fidelity mockups, choosing the most effective communication method.</p></li><li><p style=\"min-height:1.5em\"><strong>Collaboration and Communication:</strong> Excellent communication skills and experience working in a cross-functional team environment, collaborating with Product Owners, Success Engineers, Sales, Product Engineers, Product manager, Marketing, and other stakeholders.</p></li><li><p style=\"min-height:1.5em\"><strong>System Design Experience:</strong> Ability to build scalable design systems, contribute code, and maintain design libraries.</p></li><li><p style=\"min-height:1.5em\"><strong>Developer Mindset:</strong> Understanding the developer experience, anticipating potential pitfalls, and improving usability.</p></li><li><p style=\"min-height:1.5em\"><strong>Open Source Engagement:</strong> Passion for contributing to and interacting with open-source communities.</p></li><li><p style=\"min-height:1.5em\"><strong>Attention to Detail:</strong> High standards for design quality and user experience.</p></li></ul><p style=\"min-height:1.5em\"><strong>What We Don’t Need:</strong></p><ul style=\"min-height:1.5em\"><li><p style=\"min-height:1.5em\"><strong>Lone Wolves:</strong> If you prefer to work independently without regular collaboration, this role isn’t for you.</p></li><li><p style=\"min-height:1.5em\"><strong>Open Source Apathy:</strong> Lack of interest in open-source development or community engagement is a dealbreaker.</p></li><li><p style=\"min-height:1.5em\"><strong>Shallow Technical Knowledge:</strong> A deep understanding of modern front-end development and tools is essential.</p></li><li><p style=\"min-height:1.5em\"><strong>“Redo Everything” Approach:</strong> Focus on incremental improvements rather than overhauling everything at once.</p></li><li><p style=\"min-height:1.5em\"><strong>Feature Factory Mindset:</strong> We prioritize user experience and thoughtful design over feature output.</p></li><li><p style=\"min-height:1.5em\"><strong>Resistance to Feedback:</strong> Comfort with iterating based on feedback, data, and testing is key.</p></li><li><p style=\"min-height:1.5em\"><strong>Inflexibility:</strong> This role requires adaptability to changing requirements and team dynamics.</p></li><li><p style=\"min-height:1.5em\"><strong>Low Initiative:</strong> If you need constant direction and lack proactivity, this environment won’t suit you.</p></li></ul><h3>We offer:</h3><ul style=\"min-height:1.5em\"><li><p style=\"min-height:1.5em\">100% remote work from anywhere in the world. No location-based adjustment to your salary.</p></li><li><p style=\"min-height:1.5em\">Autonomous work. We work collaboratively on projects, but you set your own pace.</p></li><li><p style=\"min-height:1.5em\">Health, Vision and Dental benefits. Supabase covers 100% of the cost for employees and 80% for dependants</p></li><li><p style=\"min-height:1.5em\">Generous Tech Allowance for any office setup you need</p></li><li><p style=\"min-height:1.5em\">Annual Education Allowance</p></li><li><p style=\"min-height:1.5em\">Annually run off-sites.</p></li></ul><h2>About the team</h2><ul style=\"min-height:1.5em\"><li><p style=\"min-height:1.5em\">We're a startup. It's unstructured.</p></li><li><p style=\"min-height:1.5em\">Collectively founded more than 30 startups.</p></li><li><p style=\"min-height:1.5em\">Globally distributed team with more than 30 different nationalities.</p></li><li><p style=\"min-height:1.5em\">We deeply believe in <a target=\"_blank\" rel=\"noopener noreferrer nofollow\" href=\"https://supabase.com/blog/2022/03/25/should-i-open-source-my-company\">the efficacy of collaborative open source</a>. We support existing communities and tools, rather than building \"yet another xx\".</p></li><li><p style=\"min-height:1.5em\">We \"dogfood\" everything. If you use it in your project, we use it in Supabase.</p></li></ul><h2>Process</h2><ul style=\"min-height:1.5em\"><li><p style=\"min-height:1.5em\">The entire process is fully remote and all communication will happen over email or via video chat.</p></li><li><p style=\"min-height:1.5em\">Once you've submitted your application, the team will review your submission and may reach out for a short screening interview over a video call.</p></li><li><p style=\"min-height:1.5em\">If you pass the screen you will be invited to up to four follow-up interviews. </p></li><li><p style=\"min-height:1.5em\">The calls:</p><ul style=\"min-height:1.5em\"><li><p style=\"min-height:1.5em\">usually take between 20-45 minutes each depending on the interviewer.</p></li><li><p style=\"min-height:1.5em\">most of the time, are all 1:1.</p></li><li><p style=\"min-height:1.5em\">will be with the founders, a member of either the growth or engineering team (depending on the role) and usually one other person from your immediate team or function.</p></li></ul></li><li><p style=\"min-height:1.5em\">Once the interviews are over, the team will meet to discuss several roles and candidates and may:</p><ul style=\"min-height:1.5em\"><li><p style=\"min-height:1.5em\">ask one or two follow-up questions over email or a quick call.</p></li><li><p style=\"min-height:1.5em\">go directly to making an offer.</p></li></ul></li></ul>","tags":"[\"engineering\",\"database\"]","pubDate":"2025-04-03T20:47:39.669Z","link":"https://jobs.ashbyhq.com/supabase/0a932549-e32c-4f42-8832-e4599f5761cb","slug":"design-engineer-supabase-1582"},{"id":8340214531,"title":"Lifecycle Marketing Manager (Head of Lifecycle Marketing)","company":"Atticus","image":"https://images.atticus.com/images/www/media/favicon.png","description":"<h1>Lifecycle Marketing Manager (Head of Lifecycle Marketing)</h1><h2><br /><strong>About Atticus</strong></h2><p style=\"min-height:1.5em\">At any given time, 16 million Americans are experiencing a crisis that requires urgent help from our legal system or government. The right assistance could transform their lives. But today, most never get it. </p><p style=\"min-height:1.5em\">Atticus makes it easy for any sick or injured person in crisis to get the life-changing aid they deserve. In just three years, we’ve become the leading platform connecting people with disabilities to government benefits. We also help victims of accidents, misconduct, and violence get compensation from insurance. So far, we’ve gotten thousands of people access to over $2B in life-changing aid, and we’re just getting started.</p><p style=\"min-height:1.5em\">We've helped more than 20,000 people in need (see our 12,000+ five-star reviews) and raised more than $50 million from top VC firms like Forerunner, GV (Google Ventures), and True Ventures. (We closed our Series B round in May 2023, so we're well-funded for the foreseeable future.) We're small but moving fast — our team grew from 91 to over 150 last year and we expect to grow again in 2025.</p><h2><br /><strong>The Job</strong></h2><p style=\"min-height:1.5em\">Every time a client takes the next step with us they’re making a life-changing decision. To get someone the financial protection they need — we first need to get them on the phone. Understanding and optimizing the client lifecycle could not be more vital to the business, or the people Atticus serves. </p><p style=\"min-height:1.5em\">Our email and SMS campaigns shepherd clients from ad-contact to lawyer-hire — building trust  and educating them through complex legal choices. As the Lifecycle Marketing Manager you’ll work closely with our content marketing and product teams to rapidly test new messaging that reduces friction and prompts a greater percentage of our leads to take the next step. </p><p style=\"min-height:1.5em\"></p><p style=\"min-height:1.5em\">You’ll be responsible for: </p><ul style=\"min-height:1.5em\"><li><p style=\"min-height:1.5em\">Developing and owning a lifecycle marketing roadmap — prioritizing tests, improving messaging, and analyzing results.</p></li><li><p style=\"min-height:1.5em\">Growing a deep knowledge of our audience and holding a high bar every message they receive — ensuring comms are brand-aligned, compelling, and clear.</p></li><li><p style=\"min-height:1.5em\">Building campaigns efficiently and efficiently — without breakages, bugs, or unnecessary tech debt. </p></li></ul><h2><br /><strong>Qualifications</strong></h2><p style=\"min-height:1.5em\">Required:</p><ul style=\"min-height:1.5em\"><li><p style=\"min-height:1.5em\">You have 5+ years of marketing experience (2+ in lifecycle marketing) — ideally at a fast growing startup. </p></li><li><p style=\"min-height:1.5em\">You’ve successfully led lifecycle campaigns from conception to launch to optimization — both dictating strategy and rolling up your sleeves to build in a customer engagement tool.</p></li><li><p style=\"min-height:1.5em\">You’ved marketed to users with challenging needs — with a complex funnel, and multiple pre-purchase steps. </p></li><li><p style=\"min-height:1.5em\">You’ve built strong cross-functional relationships — and are excited to work closely with our talented growth marketing, growth product, data science, and creative teams. </p></li><li><p style=\"min-height:1.5em\">Bonus: Familiarity with our lifecycle marketing tech stack (<a target=\"_blank\" rel=\"noopener noreferrer nofollow\" href=\"http://customer.io\">customer.io</a>, Looker, SalesForce) and HTML.</p></li></ul><p style=\"min-height:1.5em\">We are strongly committed to building a diverse team. If you’re from a background that’s underrepresented in tech, we’d love to meet you.</p><h2><br /><strong>Salary and Benefits</strong></h2><p style=\"min-height:1.5em\">This is a rare opportunity to join a startup that has strong traction (substantial funding, well-respected backers, tremendous growth, and many happy customers) but is still small enough that you can have a huge impact and play a role in shaping our culture.</p><p style=\"min-height:1.5em\">We’re a certified B Corporation tackling a critical social problem. Our mission to help people in need drives everything we do, and your work here will touch many lives.</p><p style=\"min-height:1.5em\">We offer competitive pay — including equity — and generous benefits:</p><ul style=\"min-height:1.5em\"><li><p style=\"min-height:1.5em\">Medical and dental insurance with 100% of employee premiums covered</p></li><li><p style=\"min-height:1.5em\">15 vacation days &amp; ~19 paid holidays each year (including two weeks at end-of-year)</p></li><li><p style=\"min-height:1.5em\">Free membership to OneMedical</p></li><li><p style=\"min-height:1.5em\">$1,000 reimbursable stipend for education and training outside of work</p></li><li><p style=\"min-height:1.5em\">Student loan repayment assistance, 401(k), and optional HSA</p></li><li><p style=\"min-height:1.5em\">Free snacks, drinks, weekly lunches, and regular team dinners/events/retreats</p></li><li><p style=\"min-height:1.5em\">Humble, thoughtful, smart, fun colleagues </p></li></ul><p style=\"min-height:1.5em\">We anticipate the base salary band for this role will be between $150,000 and $180,000 in addition to equity and benefits. The salary at offer will be determined by a number of factors such as candidate’s experience, knowledge, skills and abilities, as well as internal equity among our team.<br /></p><h2><strong>Location</strong></h2><p style=\"min-height:1.5em\">This job is fully remote and we’re committed to empowering everyone with flexibility. Live wherever, work remotely, and travel to LA (on the company dime) as needed to be with your colleagues —somewhere between quarterly and yearly. We care a lot about building a great culture and we think some interactions need to happen in person, so we put a lot of thought into retreats, offsites, and other ways to gather.<br /></p>","tags":"[\"legal\"]","pubDate":"2025-04-03T18:30:37.618Z","link":"https://jobs.ashbyhq.com/atticus/fea1ec46-8a3e-4b8b-a861-af816df76675","slug":"lifecycle-marketing-manager-head-of-lifecycle-marketing-atticus-5303"},{"id":6595747666,"title":"Senior Data Analyst","company":"Supabase","image":"https://avatars.githubusercontent.com/u/54469796?s=200&v=4","description":"<p style=\"min-height:1.5em\">Supabase is on a mission to build the world’s best open-source backend platform for developers. We're looking for a <strong>Senior Data Analyst</strong> who is excited to dive into our usage data, find the hidden gems of insight, and champion decisions that push our products and business forward. If you thrive on turning messy datasets into meaningful stories—and want to help shape a platform used by thousands of developers around the globe—this is for you.</p><p style=\"min-height:1.5em\"></p><h3>What You’ll Do</h3><ul style=\"min-height:1.5em\"><li><p style=\"min-height:1.5em\"><strong>Uncover Key Insights:</strong> Analyze user behavior, platform usage patterns, and growth funnels. You’ll translate raw data into insights that guide product roadmaps, marketing strategies, and beyond.</p></li><li><p style=\"min-height:1.5em\"><strong>Build Dashboards &amp; Tools:</strong> Develop clear, actionable dashboards and self-serve analytics solutions for cross-functional teams (Product, Growth, Marketing, etc.), making crucial information accessible in seconds.</p></li><li><p style=\"min-height:1.5em\"><strong>Shape Experimentation &amp; Testing:</strong> Design and evaluate experiments (A/B tests, user engagement studies) to push the envelope on how we improve developer success, retention, and overall product adoption.</p></li><li><p style=\"min-height:1.5em\"><strong>Collaborate Cross-Functionally:</strong> You’ll be embedded with product managers, engineers, and other stakeholders to define requirements, prioritize analytics needs, and ensure every project is data-informed from day one.</p></li><li><p style=\"min-height:1.5em\"><strong>Architect Data Excellence:</strong> Help evolve our data pipelines, transform raw inputs into well-modeled tables, and maintain high-quality data. We leverage tools like <strong>BigQuery, dbt, and Hex</strong> — you’ll be hands-on in all of them.</p></li><li><p style=\"min-height:1.5em\"><strong>Mentor &amp; Elevate:</strong> As a senior member, you’ll set best practices for analytics within Supabase. You might review queries, mentor junior analysts, or introduce new approaches for advanced modeling and data storytelling.</p></li></ul><h3>What You’ll Bring</h3><ul style=\"min-height:1.5em\"><li><p style=\"min-height:1.5em\"><strong>Hands-On Analytics Chops:</strong> You’re comfortable writing complex SQL, digging into data warehouses, and rapidly prototyping solutions in tools like dbt, Hex, or similar analytics frameworks.</p></li><li><p style=\"min-height:1.5em\"><strong>Experience with Modern Data Stacks:</strong> Familiarity with event capture (e.g., PostHog, Segment), warehousing (BigQuery or Snowflake), and a transformation layer (dbt or Airflow).</p></li><li><p style=\"min-height:1.5em\"><strong>Strategic &amp; Curious Mindset:</strong> You spot patterns where others see chaos and quickly connect the dots between user behavior and business outcomes. Bonus if you have a background in SaaS or developer tools.</p></li><li><p style=\"min-height:1.5em\"><strong>Communication Superpowers:</strong> You translate data-speak into aha! moments for non-technical audiences. You can build a compelling narrative and share it in Slack, a meeting, or a well-crafted dashboard.</p></li><li><p style=\"min-height:1.5em\"><strong>Bias for Action:</strong> You move swiftly from question to data exploration, always with an eye on driving impact for the team. You’re comfortable proposing new ideas—and scrapping them if they don’t pan out.</p></li><li><p style=\"min-height:1.5em\"><strong>3–5+ Years of Relevant Experience:</strong> You’ve done this before—maybe in a high-growth startup or a data-driven tech company. You’ve got stories of big wins, tough lessons, and everything in between.</p></li></ul><h3>Why Join Supabase?</h3><ul style=\"min-height:1.5em\"><li><p style=\"min-height:1.5em\"><strong>Remote-First Team:</strong> Work from anywhere, connect with colleagues around the globe, and enjoy a flexible, async-friendly environment.</p></li><li><p style=\"min-height:1.5em\"><strong>Developer-Centric Culture:</strong> We live and breathe open source. You’ll have plenty of opportunities to contribute to (and leverage) the open-source community for data solutions.</p></li><li><p style=\"min-height:1.5em\"><strong>Ownership &amp; Impact:</strong> This isn’t a button-pushing gig. You’ll have full trust and autonomy to own projects from day one—and see real results from your work.</p></li><li><p style=\"min-height:1.5em\"><strong>Collaborative Atmosphere:</strong> We’re big on pairing up when it makes sense and dividing to conquer when needed. Either way, you’ll be surrounded by whip-smart folks eager to ship.</p></li></ul><p style=\"min-height:1.5em\"><strong>Ready to Apply?</strong></p><p style=\"min-height:1.5em\">Send us your resume, your best dashboard or SQL snippet, or whatever you think shows off your data prowess. We can’t wait to see how you’ll help us unearth fresh insights and fuel Supabase’s mission to build the world’s most developer-friendly backend platform.</p><p style=\"min-height:1.5em\"></p><h3><strong>We Offer:</strong></h3><ul style=\"min-height:1.5em\"><li><p style=\"min-height:1.5em\">100% remote work</p></li><li><p style=\"min-height:1.5em\">Autonomy to own your roadmap and execution.</p></li><li><p style=\"min-height:1.5em\">Comprehensive health, vision, and dental coverage.</p></li><li><p style=\"min-height:1.5em\">Generous tech and education allowances to support your growth.</p></li><li><p style=\"min-height:1.5em\">Annual off-sites with the global Supabase team.</p></li></ul><h2>About the team</h2><ul style=\"min-height:1.5em\"><li><p style=\"min-height:1.5em\">We're a startup. It's unstructured.</p></li><li><p style=\"min-height:1.5em\">Collectively founded more than 30 startups.</p></li><li><p style=\"min-height:1.5em\">Globally distributed team with more than 30 different nationalities.</p></li><li><p style=\"min-height:1.5em\">We deeply believe in <a target=\"_blank\" rel=\"noopener noreferrer nofollow\" href=\"https://supabase.com/blog/2022/03/25/should-i-open-source-my-company\">the efficacy of collaborative open source</a>. We support existing communities and tools, rather than building \"yet another xx\".</p></li><li><p style=\"min-height:1.5em\">We \"dogfood\" everything. If you use it in your project, we use it in Supabase.</p></li></ul><h2>Process</h2><ul style=\"min-height:1.5em\"><li><p style=\"min-height:1.5em\">The entire process is fully remote and all communication will happen over email or via video chat.</p></li><li><p style=\"min-height:1.5em\">Once you've submitted your application, the team will review your submission and may reach out for a short screening interview over a video call.</p></li><li><p style=\"min-height:1.5em\">If you pass the screen you will be invited to up to four follow-up interviews. </p></li><li><p style=\"min-height:1.5em\">The calls:</p><ul style=\"min-height:1.5em\"><li><p style=\"min-height:1.5em\">usually take between 20-45 minutes each depending on the interviewer.</p></li><li><p style=\"min-height:1.5em\">most of the time, are all 1:1.</p></li><li><p style=\"min-height:1.5em\">will be with the founders, a member of either the growth or engineering team (depending on the role) and usually one other person from your immediate team or function.</p></li></ul></li><li><p style=\"min-height:1.5em\">Once the interviews are over, the team will meet to discuss several roles and candidates and may:</p><ul style=\"min-height:1.5em\"><li><p style=\"min-height:1.5em\">ask one or two follow-up questions over email or a quick call.</p></li><li><p style=\"min-height:1.5em\">go directly to making an offer.</p></li></ul></li></ul>","tags":"[\"engineering\"]","pubDate":"2025-04-03T18:11:54.880Z","link":"https://jobs.ashbyhq.com/supabase/0c4ed980-53d2-4dfc-8019-318d8ee0cbb7","slug":"senior-data-analyst-supabase-4256"},{"id":4058955984,"title":"Growth Engineer","company":"Supabase","image":"https://avatars.githubusercontent.com/u/54469796?s=200&v=4","description":"<p style=\"min-height:1.5em\">We’re looking for a bold<strong> Growth Engineer</strong> to understand our funnel, unearth insights, and implement growth experiments that move the needle. This is an independent contributor role. You’ll take projects from ideation to execution: hypothesize, test, build, and measure. You’re comfortable solving a wide range of challenges using whatever tech (or approach) the situation calls for. If you love optimizing user journeys, running A/B tests, and hacking on developer tools, this might be your perfect fit.</p><p style=\"min-height:1.5em\"></p><h3>What You’ll Do</h3><ul style=\"min-height:1.5em\"><li><p style=\"min-height:1.5em\"><strong>Growth Experiments &amp; A/B Testing</strong></p><p style=\"min-height:1.5em\">Design, build, and analyze experiments that increase adoption, retention, and expansion. You’ll own the process end-to-end, from data discovery to launching production-ready code.</p></li><li><p style=\"min-height:1.5em\"><strong>Self-Serve Success</strong></p><p style=\"min-height:1.5em\">Identify roadblocks in the product and build solutions to help users easily succeed on their own. You’ll own everything from the UI tweaks to the backend logic.</p></li><li><p style=\"min-height:1.5em\"><strong>Data Analysis</strong></p><p style=\"min-height:1.5em\">Dive into our Postgres and BigQuery datasets, spotting friction points and bottlenecks in the user journey. Surface actionable insights that lead to product wins.</p></li><li><p style=\"min-height:1.5em\"><strong>Metrics &amp; Monitoring</strong></p><p style=\"min-height:1.5em\">Track growth metrics and success indicators with PostHog, or any other tool that gives you meaningful visibility. You’ll share learnings and keep the broader team informed.</p></li><li><p style=\"min-height:1.5em\"><strong>Cross-Functional Collaboration</strong></p><p style=\"min-height:1.5em\">Work side-by-side with product engineering, marketing, developer relations, and the data team. You’ll be the glue that connects user behavior data with the product roadmap.</p></li></ul><h3>What You Bring</h3><ul style=\"min-height:1.5em\"><li><p style=\"min-height:1.5em\"><strong>Versatility in Tech &amp; Tools</strong></p><p style=\"min-height:1.5em\">You’re comfortable popping into a Postgres console, wiring up BigQuery queries, dabbling in TypeScript, and shipping end-to-end features. You do what it takes to move fast and make an impact.</p></li><li><p style=\"min-height:1.5em\"><strong>Growth Engineering Experience</strong></p><p style=\"min-height:1.5em\">You’ve been in the weeds on product-led growth, or something close to it. You’ve got success stories of moving key metrics in high-growth environments.</p></li><li><p style=\"min-height:1.5em\"><strong>Background in Dev Tooling or High-Growth Startups</strong></p><p style=\"min-height:1.5em\">You know how developer products (like Supabase) work in the wild. You’ve seen enough to understand what resonates with engineers and how to design great dev experiences.</p></li><li><p style=\"min-height:1.5em\"><strong>Supabase Familiarity</strong></p><p style=\"min-height:1.5em\">You’ve used Supabase—maybe for a side project, maybe for production—and you know your way around our stack. Bonus points if you can share a link to your project!</p></li></ul><h3>Tech Stack You’ll Work On</h3><ul style=\"min-height:1.5em\"><li><p style=\"min-height:1.5em\"><strong>Must-Haves:</strong></p><ul style=\"min-height:1.5em\"><li><p style=\"min-height:1.5em\">TypeScript</p></li><li><p style=\"min-height:1.5em\">BigQuery (SQL)</p></li><li><p style=\"min-height:1.5em\">Postgres (SQL)</p></li></ul></li><li><p style=\"min-height:1.5em\"><strong>Nice-to-Have Knowledge:</strong></p><ul style=\"min-height:1.5em\"><li><p style=\"min-height:1.5em\">PostHog</p></li><li><p style=\"min-height:1.5em\">AWS SQS</p></li><li><p style=\"min-height:1.5em\">CloudWatch</p></li><li><p style=\"min-height:1.5em\">Pulumi</p></li><li><p style=\"min-height:1.5em\">Sentry<br /></p></li></ul></li></ul><h3><strong>We Offer:</strong></h3><ul style=\"min-height:1.5em\"><li><p style=\"min-height:1.5em\">100% remote work</p></li><li><p style=\"min-height:1.5em\">Autonomy to own your roadmap and execution.</p></li><li><p style=\"min-height:1.5em\">Comprehensive health, vision, and dental coverage.</p></li><li><p style=\"min-height:1.5em\">Generous tech and education allowances to support your growth.</p></li><li><p style=\"min-height:1.5em\">Annual off-sites with the global Supabase team.</p></li></ul><h2>About the team</h2><ul style=\"min-height:1.5em\"><li><p style=\"min-height:1.5em\">We're a startup. It's unstructured.</p></li><li><p style=\"min-height:1.5em\">Collectively founded more than 30 startups.</p></li><li><p style=\"min-height:1.5em\">Globally distributed team with more than 30 different nationalities.</p></li><li><p style=\"min-height:1.5em\">We deeply believe in <a target=\"_blank\" rel=\"noopener noreferrer nofollow\" href=\"https://supabase.com/blog/2022/03/25/should-i-open-source-my-company\">the efficacy of collaborative open source</a>. We support existing communities and tools, rather than building \"yet another xx\".</p></li><li><p style=\"min-height:1.5em\">We \"dogfood\" everything. If you use it in your project, we use it in Supabase.</p></li></ul><h2>Process</h2><ul style=\"min-height:1.5em\"><li><p style=\"min-height:1.5em\">The entire process is fully remote and all communication will happen over email or via video chat.</p></li><li><p style=\"min-height:1.5em\">Once you've submitted your application, the team will review your submission and may reach out for a short screening interview over a video call.</p></li><li><p style=\"min-height:1.5em\">If you pass the screen you will be invited to up to four follow-up interviews. </p></li><li><p style=\"min-height:1.5em\">The calls:</p><ul style=\"min-height:1.5em\"><li><p style=\"min-height:1.5em\">usually take between 20-45 minutes each depending on the interviewer.</p></li><li><p style=\"min-height:1.5em\">most of the time, are all 1:1.</p></li><li><p style=\"min-height:1.5em\">will be with the founders, a member of either the growth or engineering team (depending on the role) and usually one other person from your immediate team or function.</p></li></ul></li><li><p style=\"min-height:1.5em\">Once the interviews are over, the team will meet to discuss several roles and candidates and may:</p><ul style=\"min-height:1.5em\"><li><p style=\"min-height:1.5em\">ask one or two follow-up questions over email or a quick call.</p></li><li><p style=\"min-height:1.5em\">go directly to making an offer.</p></li></ul></li></ul>","tags":"[\"postgres\",\"pulumi\",\"typescript\",\"engineering\",\"aws\"]","pubDate":"2025-04-03T17:53:57.494Z","link":"https://jobs.ashbyhq.com/supabase/62a1a600-c916-4b74-9cdc-d4b9d2564e62","slug":"growth-engineer-supabase-678"},{"id":2479292725,"title":"Partnerships Development Manager - USA","company":"Supabase","image":"https://avatars.githubusercontent.com/u/54469796?s=200&v=4","description":"<p style=\"min-height:1.5em\">We are looking for a <strong>Partnerships Development Manager </strong>to lead our efforts in identifying, engaging, and scaling high-impact partnerships that drive revenue. This is a strategic, high-visibility role where you’ll work cross-functionally to define partnership models, explore whitespace opportunities, and engage with some of the most exciting companies in the tech landscape.</p><p style=\"min-height:1.5em\">This role is ideal for someone who thrives in ambiguity, has an entrepreneurial mindset, and is excited to be at the forefront of shaping Supabase’s market-facing strategy. </p><p style=\"min-height:1.5em\"></p><h3><strong>What You’ll Own:</strong></h3><ul style=\"min-height:1.5em\"><li><p style=\"min-height:1.5em\">Define and lead the strategic roadmap for partnerships and market development aligned with Supabase’s growth objectives.</p></li><li><p style=\"min-height:1.5em\">Identify and evaluate high-potential companies and technology partners—particularly those in the open-source, developer tools and startup ecosystems.</p></li><li><p style=\"min-height:1.5em\">Build and nurture revenue-generating partnerships, including affiliate programs and marketplace integrations.</p></li><li><p style=\"min-height:1.5em\">Craft and negotiate partnership models and terms that drive competitive differentiation and long-term value creation.</p></li><li><p style=\"min-height:1.5em\">Collaborate with Product, Marketing, and GTM teams to launch partner initiatives that increase customer adoption and engagement.</p></li><li><p style=\"min-height:1.5em\">Drive ongoing market analysis to surface new partnership opportunities and derisk strategic bets.</p></li><li><p style=\"min-height:1.5em\">Act as a thought leader internally and externally—representing Supabase in conversations with founders, VCs, and emerging tech leaders.</p></li></ul><h3><strong>Who You Are:</strong></h3><ul style=\"min-height:1.5em\"><li><p style=\"min-height:1.5em\">5+ years of experience in startup business development, strategic partnerships, corporate development, or venture capital. </p></li><li><p style=\"min-height:1.5em\">MBA or equivalent entrepreneurial/operator experience is strongly preferred.</p></li><li><p style=\"min-height:1.5em\">Deep understanding of the startup and developer ecosystems; familiarity with open-source business models and cloud infrastructure is a plus.</p></li><li><p style=\"min-height:1.5em\">Demonstrated ability to define strategy and execute with a high degree of autonomy.</p></li><li><p style=\"min-height:1.5em\">Experience designing and negotiating revenue-generating partnerships with a strong analytical foundation.</p></li><li><p style=\"min-height:1.5em\">Excellent communicator with the ability to engage with executive stakeholders and represent the company externally.</p></li><li><p style=\"min-height:1.5em\">Naturally curious, proactive, and energized by exploring new opportunities and building from zero-to-one.</p></li><li><p style=\"min-height:1.5em\">California, or west coast preferred. </p></li></ul><p style=\"min-height:1.5em\"></p><h3><strong>Why This Role is Different:</strong></h3><ul style=\"min-height:1.5em\"><li><p style=\"min-height:1.5em\"><strong>Chart Your Own Path:</strong> We’re at the cutting edge of open-source tech—this role offers the opportunity to define and execute a partnership strategy that shapes the future of Supabase and the broader ecosystem.</p></li><li><p style=\"min-height:1.5em\"><strong>High-Impact &amp; High-Visibility:</strong> Your work will directly drive revenue and influence how Supabase shows up in the market.</p></li><li><p style=\"min-height:1.5em\"><strong>Engage with the Next Generation:</strong> Work closely with startup founders, developer-first companies, and technical leaders who are building what’s next.</p></li><li><p style=\"min-height:1.5em\"><strong>Remote &amp; Global:</strong> Work from anywhere in the world with a team that values autonomy, trust, and flexibility.<br /></p></li></ul><h3><strong>We Offer:</strong></h3><ul style=\"min-height:1.5em\"><li><p style=\"min-height:1.5em\">100% remote work</p></li><li><p style=\"min-height:1.5em\">Autonomy to own your roadmap and execution.</p></li><li><p style=\"min-height:1.5em\">Comprehensive health, vision, and dental coverage.</p></li><li><p style=\"min-height:1.5em\">Generous tech and education allowances to support your growth.</p></li><li><p style=\"min-height:1.5em\">Annual off-sites with the global Supabase team.</p></li></ul><h2>About the team</h2><ul style=\"min-height:1.5em\"><li><p style=\"min-height:1.5em\">We're a startup. It's unstructured.</p></li><li><p style=\"min-height:1.5em\">Collectively founded more than 30 startups.</p></li><li><p style=\"min-height:1.5em\">Globally distributed team with more than 30 different nationalities.</p></li><li><p style=\"min-height:1.5em\">We deeply believe in <a target=\"_blank\" rel=\"noopener noreferrer nofollow\" href=\"https://supabase.com/blog/2022/03/25/should-i-open-source-my-company\">the efficacy of collaborative open source</a>. We support existing communities and tools, rather than building \"yet another xx\".</p></li><li><p style=\"min-height:1.5em\">We \"dogfood\" everything. If you use it in your project, we use it in Supabase.</p></li></ul><h2>Process</h2><ul style=\"min-height:1.5em\"><li><p style=\"min-height:1.5em\">The entire process is fully remote and all communication will happen over email or via video chat.</p></li><li><p style=\"min-height:1.5em\">Once you've submitted your application, the team will review your submission and may reach out for a short screening interview over a video call.</p></li><li><p style=\"min-height:1.5em\">If you pass the screen you will be invited to up to four follow-up interviews. </p></li><li><p style=\"min-height:1.5em\">The calls:</p><ul style=\"min-height:1.5em\"><li><p style=\"min-height:1.5em\">usually take between 20-45 minutes each depending on the interviewer.</p></li><li><p style=\"min-height:1.5em\">most of the time, are all 1:1.</p></li><li><p style=\"min-height:1.5em\">will be with the founders, a member of either the growth or engineering team (depending on the role) and usually one other person from your immediate team or function.</p></li></ul></li><li><p style=\"min-height:1.5em\">Once the interviews are over, the team will meet to discuss several roles and candidates and may:</p><ul style=\"min-height:1.5em\"><li><p style=\"min-height:1.5em\">ask one or two follow-up questions over email or a quick call.</p></li><li><p style=\"min-height:1.5em\">go directly to making an offer.</p></li></ul></li></ul>","tags":"[\"engineering\"]","pubDate":"2025-04-03T16:52:33.513Z","link":"https://jobs.ashbyhq.com/supabase/978c530c-4f19-4892-9426-6ab2d9044d5d","slug":"partnerships-development-manager-usa-supabase-8651"},{"id":4047726679,"title":"Technical Digital Marketer (MARTECH Implementation)","company":"WebFX","image":"https://media.licdn.com/dms/image/C4E0BAQEaJsLubyO-AA/company-logo_200_200/0/1630591240152/webfxinc_logo?e=2147483647&v=beta&t=mkc8r0aeeGBHIC7BLKk7r18oCDh3xnykU31_6dhVPdQ","description":"<div><span style=\"font-size: 12pt\">Hi there! We’re WebFX, a full-funnel revenue marketing agency based in the US. We’ve been 9x named a Best Place to Work, and we’d love to meet you! We are a fast-growing company of more than 700 FXers, that has doubled in size over the past 5 years, with talented team members in 6 US offices, 20+ US States, and now based around the globe (and representing 18+ different countries, including offices in Guatemala and South Africa!).&nbsp;</span></div><div><br></div><div><span style=\"font-size: 12pt\">While WebFX and our subsidiary companies, such as Nutshell CRM, </span><a href=\"http://seo.com/\"><span style=\"font-size: 12pt\">SEO.com</span></a><span style=\"font-size: 12pt\">, and TeamAI, are growing rapidly, we are committed to growing strategically and sustainably, and that starts with growing our team of the #BestCoworkers - that’s where you come in!</span></div><div><br></div><div><span style=\"font-size: 12pt\">We’re looking for people to join our mission to provide world-class full-funnel revenue marketing solutions to mid-size businesses worldwide, We are passionate about what we do, we’re committed to driving business growth for our clients, and we’re on the hunt for people just like you, who take pride in their work and want to be part of a company that does too.&nbsp;</span></div><div><br></div><div><span style=\"font-size: 18pt\">Why Choose WebFX?</span></div><div><br></div><div><span style=\"font-size: 12pt\">We’re proud to offer the same great culture and a comprehensive set of benefits to our team members no matter where in the world they’re based. In addition to very competitive base pay, we also offer company profit-sharing, performance bonuses, and health insurance (including dental, vision, remote doctor, etc.). To aid in your success, we also provide world-class industry training (Organic SEO, Local SEO, PPC, Google Analytics, etc.), long-term career track opportunities, and ongoing learning bonuses (yes, you can get paid to learn!), along with numerous other benefits!&nbsp;</span></div><div><br></div><div><span style=\"font-size: 12pt\">Some of the additional benefits our FXers enjoy include:</span></div><div><br></div><div><span style=\"font-size: 12pt\">- No matter where you are located or your position, WebFX offers long-term stability to all of our FXFamily members. Many of our global team members have been with WebFX for 10+ years, and we’re hoping you can be too! 🌏</span></div><div><span style=\"font-size: 12pt\">- We put our people first; it’s as simple as that. You’re never on your own - when you run into inevitable challenges, we’re there to support you along the way!&nbsp;</span></div><div><span style=\"font-size: 12pt\">- Long-lasting relationships with both clients and team members due to consistently low turnover rates, which are simply unheard of in our industry because, again, we put our people first.</span></div><div><span style=\"font-size: 16px\">- Save your time and money by skipping the commute to an office. This role allows you to work from the comfort of your home! 🏡</span></div><div><span style=\"font-size: 12pt\">- Fully equipped in-home office setup including computer, dual large monitors, headset, seriously fast internet, generator, and more! 🖥️&nbsp;</span></div><div><span style=\"font-size: 12pt\">- Unrestricted access to our proprietary software/platforms that our internal R&amp;D team has developed for our team’s exclusive use, in addition to access to the many 3rd party tools and software we utilize internally in order to WOW our clients. You can learn more about just some of our </span><a style=\"font-size: 12pt\" href=\"https://www.webfx.com/marketingcloudfx/\">proprietary tools here</a><span style=\"font-size: 12pt\">.</span></div><div><span style=\"font-size: 12pt\">- Be part of a rapidly growing company that, at the same time, only partners with clients who share our values. 🌱📈</span></div><div><span style=\"font-size: 12pt\">- Merit-based promotional structure.</span></div><div><span style=\"font-size: 12pt\">- Annual merit-based compensation increases! 💰</span></div><div><span style=\"font-size: 12pt\">- Access to virtual professional development opportunities with company experts and virtual team-building events like monthly meetups and hangouts.</span></div><div><span style=\"font-size: 12pt\">- Invitation to our annual FXFest – a week-long, all-expenses-paid trip for our international team members (with a 1-year tenure) to our company headquarters. This event is filled with activities, learning, and motivation to help unite our U.S. and global staff! 🛫</span></div><div><span style=\"font-size: 12pt\">- We have a very strong commitment to giving back globally - in fact, it’s one of our values here at WebFX. As a member of our FXFamily, you get to be a large part of that simply by achieving your goals - since 2014, we’ve committed to donating globally through our FXBuilds program. You can learn more about that </span><a style=\"font-size: 12pt\" href=\"https://www.webfx.com/about/fxbuilds/\">here</a><span style=\"font-size: 12pt\">!</span></div><div><span style=\"font-size: 12pt\">- When you join WebFX, you don’t just join a company; you join a community! We value all of our team members the same, regardless of their position or where they call home. We truly look forward to learning about you and your background, and we will be there to celebrate the milestones in your life together, no matter how big or small! 👏</span></div><div><br></div><div><span style=\"font-size: 18pt\">What You'll Get</span></div><div><br></div><div><span style=\"font-size: 13.5pt\">World-Class Training and Ongoing Career Development</span></div><div><br></div><div><span style=\"font-size: 12pt\">- No matter your level of experience, our “Bootcamp” training program is provided for all new WebFX “family members” to learn, grow and develop in and out of the office with the hard skills necessary to be successful in their position.&nbsp;</span></div><div><span style=\"font-size: 12pt\">- From training with our </span><a style=\"font-size: 12pt\" href=\"https://www.horizoninteractiveawards.com/news/article/top-agency-2020-interview-kyle-helder-web-design-team-lead\">Award-Winning</a><span style=\"font-size: 12pt\"> Sr. Developers, Designers, Marketers, and more to access to countless industry-leading online training resources/courses/tutorials to getting experience with our client base that spans just about every industry you can think of (and then some), our training program is simply unrivaled!</span></div><div><span style=\"font-size: 12pt\">- Training doesn’t stop after your initial training period, we offer career development training and monthly Lunch-and-Learns with our state-of-the-art training amenities to facilitate departmental training, industry-related updates, and more!</span></div><div><span style=\"font-size: 12pt\">- FXLearns program – where you get incentives for taking advantage of our countless industry training resources!</span></div><div><span style=\"font-size: 12pt\">- With a track record of serving over 1,500+ clients, we’ve been able to truly master our processes and procedures, and we’ll train you on them - no need to develop how to do things (unless you want to help us continually improve that process!), because we refuse to ever stagnate, we are always pushing to make those processes 1% better too!&nbsp;</span></div><div><br></div><div><span style=\"font-size: 13.5pt\">Opportunities for Growth</span></div><div><br></div><div><span style=\"font-size: 12pt\">WebFX has doubled in size over the past 5 years, and merit-based promotional opportunities are abundant if you're meeting or exceeding position performance metrics. We believe in growing and promoting our internal team first and foremost. In fact, 95% of our promotions are internal! All team members have a very clearly defined progression path, so you know exactly what is expected of you so you can put your career in your own hands.&nbsp;</span></div><div><br></div><div><span style=\"font-size: 12pt\">What’s more, you’re not expected to know it all - we believe in continually striving to be an expert in your subject matter of expertise, so while we will purposely challenge you to grow in your niche, we are a full-service agency that has experts in other departments that handle everything else - from link building, to social media, to web design, and web development. This is done so you can truly master your trade. </span></div><h3>Who We're Looking For</h3><li><b>General Knowledge in the following:</b></li><li>Strong English written communication skills. Resume must be in English to be considered.</li><li>Basic understanding of WordPress</li><li>Basic understanding of design and visual website elements</li><div><br></div><li><b>Experience</b></li><li>Digital Marketing Experience (SEO/PPC/Analytics/GTM/etc)</li><li>Martech/AdTech or Technical SEO experience with willingness to learn</li><li>CMS experience with Wordpress</li><li>Technical experience with implementing tracking code on client websites</li><li>Basic understanding of SEO (Desired)</li><li>Basic HTML experience or willingness to learn (Desired)</li><div><br></div><li><b>Qualities</b></li><li>Demonstrates ability to get things done</li><li>Enjoys attention to detail technical task</li><li>Likes reviewing data and making recommendations </li><li>Communicates reliably about the status of a project</li><li>Outstanding attention to detail</li><h3>What You'll Do</h3><li><b>Responsibilities</b></li><li>Set up our marketing automation software (MCFX) on clients websites</li><li>Consults with internal team to deploy Google Analytics/Google Tag Manager (GTM) on client websites</li><li>Auditing / Making Implementation changes to Analytics and Tag Management accounts</li><li>Interprets data, understands personas/audiences for LeadNurtureFX &amp; PersonalizeFX</li><li>Makes writing CRO/UX recommendations </li><li>Understands Attribution/Micro-Conversions</li><li>Ability to meet and exceed monthly production goals</li><li>Requires reliable internet access</li><li><b><i>The Content Integration Specialist role is NOT a client-facing position</i></b></li><div><br></div><li><b>Percentage Breakdown</b></li><li>60%&nbsp;Google&nbsp;Tag&nbsp;Manager&nbsp;- Setup &amp; Advanced Event Tracking / Troubleshooting /&nbsp;Google&nbsp;Analytics Troubleshooting Tickets / Data &amp; Attribution Governance</li><li>20% MCFX Installs </li><li>10% Social Media tracking installation </li><li>10% Dev-related marketing support</li><div><span style=\"font-size: 18pt\">Compensation</span></div><div><br></div><div><span style=\"font-size: 16px\">Negotiable, based on experience</span></div><div><span style=\"font-size: 16px\">Annual merit-based increases</span></div><div><br></div><div><span style=\"font-size: 18pt\">Working Hours</span></div><div><br></div><div><span style=\"font-size: 12pt\">Asia (Philippines / Indonesia)</span></div><div><span style=\"font-size: 12pt\">This position requires overlapping hours from 3:30 AM EST - 12:00 PM EST (New York Time Zone) Monday - Friday. </span></div><div><br></div><div><span style=\"font-size: 12pt\">Africa / Europe (Ghana, UK, Ireland, Kenya, etc)</span></div><div><span style=\"font-size: 12pt\">This position requires overlapping hours from 6:00 AM EST - 2:30 PM EST, Monday - Friday. The 40 hours of work doesn’t include any lunch or breaks.&nbsp;&nbsp;</span></div><div><br></div><div><span style=\"font-size: 12pt\">*** This excludes South Africa, where our in-office team follows a different schedule. </span></div><div><br></div><div><span style=\"font-size: 12pt\">North America &amp; South America</span></div><div><span style=\"font-size: 12pt\">This position requires overlapping hours from 8:00 AM EST - 4:30 PM EST, Monday - Friday. The 40 hours of work doesn’t include any lunch or breaks.&nbsp;&nbsp;</span></div><div><br></div><div><span style=\"font-size: 12pt\">*** This excludes Guatemala, where our in-office team follows a different schedule.</span></div><div><br></div><div><span style=\"font-size: 13.5pt\">Check out our culture on social media:</span></div><div><a style=\"font-size: 12pt\" href=\"https://www.instagram.com/webfx\">Instagram</a></div><div><a style=\"font-size: 12pt\" href=\"https://twitter.com/webfx\">Twitter</a></div><div><a style=\"font-size: 12pt\" href=\"https://www.facebook.com/webfxinc/\">Facebook</a></div><div><br></div><div><span style=\"font-size: 12pt\">Please submit a resume or CV (in English) to be considered for this opportunity.</span></div><div><br></div><div><span style=\"font-size: 11pt\">*You don't need to apply more than once, even if you're interested in multiple positions - you can simply let us know! We consider all open roles when reviewing resumes and applications!&nbsp;</span></div><div><br></div><div><span style=\"font-size: 12pt\">WebFX is an Equal Opportunity Employer, committed to providing and fostering an inclusive environment where all people, including women, minorities, LGBTQ+, and other underrepresented groups, are supported, respected, and encouraged to excel within STEM careers. Our goal as an organization is to empower our team to achieve their personal best, bring people together, and provide equal opportunity to do so regardless of race, age, gender, sexual orientation, religion, physical ability or disability, or political affiliation. </span><a style=\"font-size: 12pt\" href=\"https://equality.webfx.com/\">You can learn more on our website here</a><span style=\"font-size: 12pt\">!</span></div><div><span style=\"font-size: 12pt\">Hi there! We’re WebFX, a full-funnel revenue marketing agency based in the US. We’ve been 9x named a Best Place to Work, and we’d love to meet you! We are a fast-growing company of more than 700 FXers, that has doubled in size over the past 5 years, with talented team members in 6 US offices, 20+ US States, and now based around the globe (and representing 18+ different countries, including offices in Guatemala and South Africa!).&nbsp;</span></div><div><br></div><div><span style=\"font-size: 12pt\">While WebFX and our subsidiary companies, such as Nutshell CRM, </span><a href=\"http://seo.com/\"><span style=\"font-size: 12pt\">SEO.com</span></a><span style=\"font-size: 12pt\">, and TeamAI, are growing rapidly, we are committed to growing strategically and sustainably, and that starts with growing our team of the #BestCoworkers - that’s where you come in!</span></div><div><br></div><div><span style=\"font-size: 12pt\">We’re looking for people to join our mission to provide world-class full-funnel revenue marketing solutions to mid-size businesses worldwide, We are passionate about what we do, we’re committed to driving business growth for our clients, and we’re on the hunt for people just like you, who take pride in their work and want to be part of a company that does too.&nbsp;</span></div><div><br></div><div><span style=\"font-size: 18pt\">Why Choose WebFX?</span></div><div><br></div><div><span style=\"font-size: 12pt\">We’re proud to offer the same great culture and a comprehensive set of benefits to our team members no matter where in the world they’re based. In addition to very competitive base pay, we also offer company profit-sharing, performance bonuses, and health insurance (including dental, vision, remote doctor, etc.). To aid in your success, we also provide world-class industry training (Organic SEO, Local SEO, PPC, Google Analytics, etc.), long-term career track opportunities, and ongoing learning bonuses (yes, you can get paid to learn!), along with numerous other benefits!&nbsp;</span></div><div><br></div><div><span style=\"font-size: 12pt\">Some of the additional benefits our FXers enjoy include:</span></div><div><br></div><div><span style=\"font-size: 12pt\">- No matter where you are located or your position, WebFX offers long-term stability to all of our FXFamily members. Many of our global team members have been with WebFX for 10+ years, and we’re hoping you can be too! 🌏</span></div><div><span style=\"font-size: 12pt\">- We put our people first; it’s as simple as that. You’re never on your own - when you run into inevitable challenges, we’re there to support you along the way!&nbsp;</span></div><div><span style=\"font-size: 12pt\">- Long-lasting relationships with both clients and team members due to consistently low turnover rates, which are simply unheard of in our industry because, again, we put our people first.</span></div><div><span style=\"font-size: 16px\">- Save your time and money by skipping the commute to an office. This role allows you to work from the comfort of your home! 🏡</span></div><div><span style=\"font-size: 12pt\">- Fully equipped in-home office setup including computer, dual large monitors, headset, seriously fast internet, generator, and more! 🖥️&nbsp;</span></div><div><span style=\"font-size: 12pt\">- Unrestricted access to our proprietary software/platforms that our internal R&amp;D team has developed for our team’s exclusive use, in addition to access to the many 3rd party tools and software we utilize internally in order to WOW our clients. You can learn more about just some of our </span><a href=\"https://www.webfx.com/marketingcloudfx/\" style=\"font-size: 12pt\">proprietary tools here</a><span style=\"font-size: 12pt\">.</span></div><div><span style=\"font-size: 12pt\">- Be part of a rapidly growing company that, at the same time, only partners with clients who share our values. 🌱📈</span></div><div><span style=\"font-size: 12pt\">- Merit-based promotional structure.</span></div><div><span style=\"font-size: 12pt\">- Annual merit-based compensation increases! 💰</span></div><div><span style=\"font-size: 12pt\">- Access to virtual professional development opportunities with company experts and virtual team-building events like monthly meetups and hangouts.</span></div><div><span style=\"font-size: 12pt\">- Invitation to our annual FXFest – a week-long, all-expenses-paid trip for our international team members (with a 1-year tenure) to our company headquarters. This event is filled with activities, learning, and motivation to help unite our U.S. and global staff! 🛫</span></div><div><span style=\"font-size: 12pt\">- We have a very strong commitment to giving back globally - in fact, it’s one of our values here at WebFX. As a member of our FXFamily, you get to be a large part of that simply by achieving your goals - since 2014, we’ve committed to donating globally through our FXBuilds program. You can learn more about that </span><a href=\"https://www.webfx.com/about/fxbuilds/\" style=\"font-size: 12pt\">here</a><span style=\"font-size: 12pt\">!</span></div><div><span style=\"font-size: 12pt\">- When you join WebFX, you don’t just join a company; you join a community! We value all of our team members the same, regardless of their position or where they call home. We truly look forward to learning about you and your background, and we will be there to celebrate the milestones in your life together, no matter how big or small! 👏</span></div><div><br></div><div><span style=\"font-size: 18pt\">What You'll Get</span></div><div><br></div><div><span style=\"font-size: 13.5pt\">World-Class Training and Ongoing Career Development</span></div><div><br></div><div><span style=\"font-size: 12pt\">- No matter your level of experience, our “Bootcamp” training program is provided for all new WebFX “family members” to learn, grow and develop in and out of the office with the hard skills necessary to be successful in their position.&nbsp;</span></div><div><span style=\"font-size: 12pt\">- From training with our </span><a href=\"https://www.horizoninteractiveawards.com/news/article/top-agency-2020-interview-kyle-helder-web-design-team-lead\" style=\"font-size: 12pt\">Award-Winning</a><span style=\"font-size: 12pt\"> Sr. Developers, Designers, Marketers, and more to access to countless industry-leading online training resources/courses/tutorials to getting experience with our client base that spans just about every industry you can think of (and then some), our training program is simply unrivaled!</span></div><div><span style=\"font-size: 12pt\">- Training doesn’t stop after your initial training period, we offer career development training and monthly Lunch-and-Learns with our state-of-the-art training amenities to facilitate departmental training, industry-related updates, and more!</span></div><div><span style=\"font-size: 12pt\">- FXLearns program – where you get incentives for taking advantage of our countless industry training resources!</span></div><div><span style=\"font-size: 12pt\">- With a track record of serving over 1,500+ clients, we’ve been able to truly master our processes and procedures, and we’ll train you on them - no need to develop how to do things (unless you want to help us continually improve that process!), because we refuse to ever stagnate, we are always pushing to make those processes 1% better too!&nbsp;</span></div><div><br></div><div><span style=\"font-size: 13.5pt\">Opportunities for Growth</span></div><div><br></div><div><span style=\"font-size: 12pt\">WebFX has doubled in size over the past 5 years, and merit-based promotional opportunities are abundant if you're meeting or exceeding position performance metrics. We believe in growing and promoting our internal team first and foremost. In fact, 95% of our promotions are internal! All team members have a very clearly defined progression path, so you know exactly what is expected of you so you can put your career in your own hands.&nbsp;</span></div><div><br></div><div><span style=\"font-size: 12pt\">What’s more, you’re not expected to know it all - we believe in continually striving to be an expert in your subject matter of expertise, so while we will purposely challenge you to grow in your niche, we are a full-service agency that has experts in other departments that handle everything else - from link building, to social media, to web design, and web development. This is done so you can truly master your trade. </span></div>","tags":"[\"management\"]","pubDate":"2025-04-03T14:13:27.479Z","link":"https://jobs.lever.co/webfx/cc75b160-0e64-44ab-b0db-23e79cdf4bb2","slug":"technical-digital-marketer-martech-implementation-webfx-9235"},{"id":5524599754,"title":"Community Engineer (multiple roles and seniority levels)","company":"Canonical","image":"https://avatars.githubusercontent.com/u/53057619?s=200&v=4","description":"&lt;p&gt;Our ambition is to set a standard of excellence when it comes to serving the open source ecosystem. This is your chance to be a part of that as a &lt;strong&gt;Community Engineer at Canonical&lt;/strong&gt;.&lt;/p&gt;\n&lt;p&gt;We are building community management at scale. We have multiple positions available, at different seniority levels.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;All applications and candidates are handled through this single entry point.&lt;/strong&gt;&lt;/p&gt;\n&lt;h2&gt;The role of a Community Engineer&lt;/h2&gt;\n&lt;p&gt;The Community team at Canonical enables community leaders and participants to get things done, co-ordinating with Canonical teams and ensuring that community processes are efficient and well run. We don&#39;t do the work of the community, but we facilitate that work to ensure that energetic and ambitious community members with their own vision of open source can benefit from the work Canonical does and bring their own flavor of Ubuntu into being, to meet the needs and express the interests of their community. You will play a key role in designing, executing, and scaling initiatives that foster a thriving community.&lt;/p&gt;\n&lt;p&gt;This is an exciting opportunity for a technically proficient person who is passionate about open source software, Linux, and sustainable community building.&lt;/p&gt;\n&lt;p&gt;In this role, you will support community initiatives with your technical skills and strong organizational skills. You work hand in hand with developers to smooth processes and integrate community plans with Canonical plans for maximum impact. You can encourage and facilitate the creation of new technical projects that enhance the community contribution experience, and you represent community interests to Canonical teams. You will lead complex, multi-disciplinary programs from conception through launch, working closely with Developer Relations engineers, technical authors, product managers, marketing teams, engineering teams, and external partners.&lt;/p&gt;\n&lt;p&gt;You will support and engage with volunteer developers in the Ubuntu community, addressing their concerns and helping them to create successful tools. You will help to ensure their success and the overall autonomy and sustainability of projects.&lt;/p&gt;\n&lt;p&gt;You will provide the content and technical support to ensure the community stays engaged and informed. This will include regular blog and social media posts about community initiatives, events, accomplishments, and collaborative efforts between Canonical and the Ubuntu community.&lt;/p&gt;\n&lt;p&gt;You will communicate effectively with developers and software engineers and represent not only the Ubuntu community but Canonical as a contributor to the wider Linux ecosystem. Our team attends conferences and expos, and talks about technical community projects and their development processes.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Location&lt;/strong&gt;: These are fully remote roles, open to candidates across the globe.&lt;/p&gt;\n&lt;h2&gt;What your day will look like&lt;/h2&gt;\n&lt;ul&gt;\n&lt;li&gt;Write high quality content to promote and support community initiatives&lt;/li&gt;\n&lt;li&gt;Discuss ideas and collaborate on finding good solutions to community problems&lt;/li&gt;\n&lt;li&gt;Work from home with global travel 2 to 4 weeks for internal and external events&lt;/li&gt;\n&lt;li&gt;Potential opportunity to travel more if you wish&lt;/li&gt;\n&lt;li&gt;Nurture community contributions to Ubuntu&lt;/li&gt;\n&lt;li&gt;Engage with the Ubuntu community through Discourse, Matrix, social media, conferences, etc.&lt;/li&gt;\n&lt;li&gt;Represent Ubuntu via speaking engagements at events and conferences&lt;/li&gt;\n&lt;li&gt;Support the engagement by Canonical teams into the open source ecosystem&lt;/li&gt;\n&lt;/ul&gt;\n&lt;h2&gt;What we are looking for in you&lt;/h2&gt;\n&lt;ul&gt;\n&lt;li&gt;You love technology and working with brilliant people&lt;/li&gt;\n&lt;li&gt;You are curious, flexible, articulate, and accountable&lt;/li&gt;\n&lt;li&gt;You value soft skills and are passionate, enterprising, thoughtful, and self-motivated&lt;/li&gt;\n&lt;li&gt;You have experience with developer tools and open source projects&lt;/li&gt;\n&lt;li&gt;You have a clear public record of accomplishments (talks, blog posts, GitHub, X, etc.)&lt;/li&gt;\n&lt;li&gt;You have interest and experience with some of the following: Ubuntu Linux - kernel or userspace, DevOps, software development, testing and QA, package management, container technology&lt;/li&gt;\n&lt;li&gt;You can work autonomously and assume full ownership of objectives as needed&lt;/li&gt;\n&lt;li&gt;You can be flexible with your time and enjoy working with new technology in a fast-paced environment&lt;/li&gt;\n&lt;li&gt;You are experienced working with open source communities and understand the workflow of volunteer contributors&lt;/li&gt;\n&lt;li&gt;You have experience in (technical) program management and have excellent organizational, communication and interpersonal skills&lt;/li&gt;\n&lt;/ul&gt;\n&lt;h2&gt;Additional skills that you might also bring&lt;/h2&gt;\n&lt;ul&gt;\n&lt;li&gt;Experience with community management&lt;/li&gt;\n&lt;li&gt;Experience with Developer advocacy&lt;/li&gt;\n&lt;li&gt;Experience as a software developer&lt;/li&gt;\n&lt;li&gt;Examples of contributions to the Ubuntu Community&lt;/li&gt;\n&lt;li&gt;Experience with contributing to open source projects&lt;/li&gt;\n&lt;/ul&gt;\n&lt;h2&gt;&lt;strong&gt;What we offer&lt;/strong&gt; colleagues&lt;/h2&gt;\n&lt;p&gt;We consider geographical location, experience, and performance in shaping compensation worldwide. We revisit compensation annually (and more often for graduates and associates) to ensure we recognize outstanding performance. In addition to base pay, we offer a performance-driven annual bonus or commission. We provide all team members with additional benefits, which reflect our values and ideals. We balance our programs to meet local needs and ensure fairness globally.&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;Distributed work environment with twice-yearly team sprints in person&lt;/li&gt;\n&lt;li&gt;Personal learning and development budget of USD 2,000 per year&lt;/li&gt;\n&lt;li&gt;Annual compensation review&lt;/li&gt;\n&lt;li&gt;Recognition rewards&lt;/li&gt;\n&lt;li&gt;Annual holiday leave&lt;/li&gt;\n&lt;li&gt;Maternity and paternity leave&lt;/li&gt;\n&lt;li&gt;Employee Assistance Program&lt;/li&gt;\n&lt;li&gt;Opportunity to travel to new locations to meet colleagues&lt;/li&gt;\n&lt;li&gt;Priority Pass, and travel upgrades for long haul company events&lt;/li&gt;\n&lt;/ul&gt;\n&lt;h3&gt;&lt;strong&gt;About Canonical&lt;/strong&gt;&lt;/h3&gt;\n&lt;p&gt;Canonical is a pioneering tech firm at the forefront of the global move to open source. As the company that publishes Ubuntu, one of the most important open source projects and the platform for AI, IoT and the cloud, we are changing the world of software. We recruit on a global basis and set a very high standard for people joining the company. We expect excellence - in order to succeed, we need to be the best at what we do. Most colleagues at Canonical have worked from home since its inception in 2004.​ Working here is a step into the future, and will challenge you to think differently, work smarter, learn new skills, and raise your game.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Canonical is an equal opportunity employer&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;We are proud to foster a workplace free from discrimination. Diversity of experience, perspectives, and background create a better work environment and better products.&lt;a href=&quot;https://canonical.com/careers/diversity/identity&quot;&gt; Whatever your identity, we will give your application fair consideration.&lt;/a&gt;&lt;/p&gt;\n&lt;p&gt;#LI-remote&lt;/p&gt;\n&lt;p&gt;&amp;nbsp;&lt;/p&gt;","tags":"[\"management\",\"engineering\"]","pubDate":"2025-04-03T12:59:27.000Z","link":"https://job-boards.greenhouse.io/canonical/jobs/3275433","slug":"community-engineer-multiple-roles-and-seniority-levels-canonical-2129"},{"id":2335145629,"title":"Staff Data Engineer","company":"Kindred","image":"https://pbs.twimg.com/profile_images/1515067066750885890/jAQEhnud_400x400.jpg","description":"<p style=\"min-height:1.5em\">Kindred is a members-only home swapping network that unlocks the ability to live a travel-rich lifestyle through the power of community. By exchanging primary residences with trusted peers, renters and owners alike can match with Kindred spirits and explore new destinations without breaking the bank.</p><p style=\"min-height:1.5em\">We are on a mission to build a sharing economy that lives up to the name, and we’ve raised significant capital from some of the best investors in Silicon Valley, including Index Ventures, Andreessen Horowitz, New Enterprise Associates, Bessemer Venture Partners, Caffeinated Capital, Elad Gil, and the founders of Opendoor, Figma, ClassPass, Clubhouse, Divvy, Gem, and Homebound.</p><p style=\"min-height:1.5em\">The co-founders are proven leaders from the early team at proptech company Opendoor ($15B+ exit) and have each separately built and scaled products that today do $1B+ annual revenue combined.</p><p style=\"min-height:1.5em\">We’re looking for the world’s top builders, executors, and believers to join us on this ride.</p><p style=\"min-height:1.5em\">You can learn more about us in <a target=\"_blank\" rel=\"noopener noreferrer nofollow\" href=\"https://www.forbes.com/sites/bridgetarsenault/2022/06/10/a-new-home-swapping-platform-allows-you-to-travel-the-world-like-cameron-diaz-and-kate-winslet/?sh=203a5d0722cb\">Forbes</a> and <a target=\"_blank\" rel=\"noopener noreferrer nofollow\" href=\"https://techcrunch.com/2023/04/19/opendoor-alums-raise-15m-for-kindred-a-home-swapping-network/\">TechCrunch</a>.</p><p style=\"min-height:1.5em\"><br /><strong>The Role:</strong></p><p style=\"min-height:1.5em\">We’re looking for a world-class data engineer with deep experience in building scalable data infrastructure to join us at the ground floor.</p><p style=\"min-height:1.5em\">You’ll be one of the earliest members of our data engineering team, shaping the foundation of Kindred’s data platform. This is an opportunity to build an iconic consumer product and a category-defining business that reshapes how people travel.<br /><br /></p><p style=\"min-height:1.5em\"><strong>You Will:</strong></p><ul style=\"min-height:1.5em\"><li><p style=\"min-height:1.5em\">Play a key role in shaping the vision, architecture, and implementation of our end-to-end data infrastructure</p></li><li><p style=\"min-height:1.5em\">Partner with engineering, product, and business leaders to understand data needs and influence the long-term data architecture</p></li><li><p style=\"min-height:1.5em\">Build scalable, reliable data pipelines that support analytics, operations, and product experiences</p></li><li><p style=\"min-height:1.5em\">Design and implement efficient batch and real-time data flows to power reporting, insights, and automation</p></li><li><p style=\"min-height:1.5em\">Collaborate with software engineers to instrument key events and ensure data is captured cleanly and consistently</p></li><li><p style=\"min-height:1.5em\">Develop well-modeled, intuitive data layers that make it easy for others to query and consume data</p></li><li><p style=\"min-height:1.5em\">Implement quality checks, monitoring, and alerts to ensure trust in the data</p></li><li><p style=\"min-height:1.5em\">Continuously optimize pipelines and workflows for performance, cost, and maintainability</p></li><li><p style=\"min-height:1.5em\">Play a key role in growing our data engineering capabilities as we scale — including mentoring others and setting foundational practices</p></li><li><p style=\"min-height:1.5em\">Contribute to incident response and support rotational coverage when needed to maintain data uptime and reliability<br /></p></li></ul><p style=\"min-height:1.5em\"><strong>You may be a right fit for this role if you:</strong></p><ul style=\"min-height:1.5em\"><li><p style=\"min-height:1.5em\">Have 5+ years of experience building and maintaining data infrastructure at scale</p></li><li><p style=\"min-height:1.5em\">Are fluent in modern data tools and cloud-native ecosystems (e.g. dbt, Airflow, Snowflake/BigQuery, Kafka, Spark, etc.)</p></li><li><p style=\"min-height:1.5em\">Have experience designing dimensional data models and optimizing warehouse performance</p></li><li><p style=\"min-height:1.5em\">Have partnered closely with analytics, product, or ML teams to deliver clean, reliable, well-documented data</p></li><li><p style=\"min-height:1.5em\">Have built data platforms from the ground up or been a key contributor in a high-growth startup environment</p></li><li><p style=\"min-height:1.5em\">Are pragmatic and quality-driven — you know when to ship scrappy and when to build for scale</p></li><li><p style=\"min-height:1.5em\">Are excited about working cross-functionally to turn ambiguous business problems into concrete data solutions</p></li><li><p style=\"min-height:1.5em\">Thrive in early-stage environments with high ownership, autonomy, and rapid change</p></li><li><p style=\"min-height:1.5em\">Are motivated by building elegant systems that empower others — not just crunching numbers</p></li><li><p style=\"min-height:1.5em\">Come to work with curiosity, humility, and a collaborative spirit<br /></p></li></ul><h1><strong>Our Benefits:</strong></h1><p style=\"min-height:1.5em\">At Kindred, we know that good things happen when we look out for one another. We offer our employees the following benefits:</p><ul style=\"min-height:1.5em\"><li><p style=\"min-height:1.5em\">Our opening spans more than one career level. The base salary offered depends on many factors, such as work experience, transferable skills, business needs and impact, and market demands.</p></li><li><p style=\"min-height:1.5em\">A vibrant, inclusive, and highly skilled team that ferociously protects team chemistry</p></li><li><p style=\"min-height:1.5em\">A culture of championship (vs. just mentorship), feedback, and continual development</p></li><li><p style=\"min-height:1.5em\">Competitive cash compensation and equity</p></li><li><p style=\"min-height:1.5em\">Comprehensive health benefits</p></li><li><p style=\"min-height:1.5em\">Flexible vacation policy</p></li><li><p style=\"min-height:1.5em\">Unlimited credits to stay at Kindred homes during your time as an employee</p></li><li><p style=\"min-height:1.5em\">$4,000 annual travel stipend to use toward travel costs to stay at a Kindred home</p></li><li><p style=\"min-height:1.5em\">Remote-flexible work environment. We encourage team members to travel and adventure, including working from Kindred HQ in San Francisco!</p></li><li><p style=\"min-height:1.5em\">Regular offsites to co-locate with the team</p></li></ul><p style=\"min-height:1.5em\"><em>We are committed to providing equal employment opportunities for all applicants and employees. Kindred does not discriminate on the basis of any protected characteristic, including race, color, ancestry, national origin, religion, creed, age, disability, sex, gender, sexual orientation, gender identity, gender expression, medical condition, genetic information, family care or medical leave status, marital status, domestic partner status, military and veteran status, or any other characteristic protected by US federal, state or local laws, or the laws of the country or jurisdiction where you work. Pursuant to the San Francisco Fair Chance Ordinance, we will consider for employment qualified applicants with arrest and conviction records.</em></p>","tags":"[\"engineering\",\"aws\"]","pubDate":"2025-04-03T12:20:50.876Z","link":"https://jobs.ashbyhq.com/kindred/7dc9acdd-4eda-44c4-b4db-78e095d5b727","slug":"staff-data-engineer-kindred-7802"},{"id":1453046472,"title":"Copywriter","company":"Coalition Technologies ","image":"https://remotive.com/job/1749306/logo","description":"<p class=\"h3\"> </p>\n<div class=\"h3\">WHO WE'RE LOOKING FOR</div>\n<div class=\"h3\">The ideal copywriter has excellent English writing skills and is excited to write high-quality, SEO-driven content that aligns with detailed, client-specific guidelines. Projects most commonly include writing web pages for eCommerce and lead generation business sites such as category pages, product descriptions, and blog posts. Our clientele is constantly evolving. We produce content for these and many other industry verticals:</div>\n<div class=\"h3\"> </div>\n<div class=\"h3\">Fashion (both mass-market and luxury)</div>\n<div class=\"h3\">Skincare &amp; Beauty</div>\n<div class=\"h3\">Tech &amp; Software**</div>\n<div class=\"h3\">Finance &amp; Investing**</div>\n<div class=\"h3\">Law (family law, product liability, divorce, etc.)**</div>\n<div class=\"h3\">Education</div>\n<div class=\"h3\">Home Improvement</div>\n<div class=\"h3\">Automobiles &amp; Motorcycles (OEM and aftermarket accessories)</div>\n<div class=\"h3\">Health and Wellness**</div>\n<div class=\"h3\">Medical / Clinical**</div>\n<div class=\"h3\">Digital Marketing</div>\n<div class=\"h3\">SEO / PR / Advertising / Marketing**</div>\n<div class=\"h3\">**Writers with a background in these highly specialized fields are strongly encouraged to apply.</div>\n<div class=\"h3\">The ideal candidate for this position is a multifaceted technical and creative writer with at least two to four years of professional, non-academic experience. Candidates should understand how to write content that effortlessly blends SEO best practices and brand priorities for finished work that’s engaging, creative, and ROI-driven. Candidates should also be willing and able to complete careful research in order to gain a strong understanding of various industries. Candidates should be prepared to provide portfolios featuring published work. Once an offer has been extended, writers will be asked to take a brief training course.</div>\n<div class=\"h3\"> </div>\n<div class=\"h3\">Compensation</div>\n<div class=\"h3\">Writers are paid on a per-word basis. The rate is assessed according to our KPI rubric (key performance indicators) with an automatic raise after 400 and 800 pages have gone live on our client's websites.</div>\n<div class=\"h3\">Initial compensation is up to $0.06 per word with $0.034 per word being the most typical compensation level. This is $30 or $17 per page of 500 words.</div>\n<div class=\"h3\">After 400 pages live, the top marginal rate increases to $0.064 per word with the most typical rate of $0.038 per word, or $32 and $19 per page. After 800 pages live, the top marginal rate increases to $0.07 per word with $0.044 per word being the most typical, or $35 and $22 per page.</div>\n<img src=\"https://remotive.com/job/track/1749306/blank.gif?source=public_api\" alt=\"\"/>","tags":"[\"accounting\",\"excel\",\"research\",\"data analysis\",\"bookkeeping\",\"google sheets\",\"quickbooks\",\"data entry\",\"insurance\",\"G Suite\"]","pubDate":"2025-04-02T18:00:39.000Z","link":"https://remotive.com/remote-jobs/writing/copywriter-1749306","slug":"copywriter-coalition-technologies-7249"}]