[{"id":1683750300,"title":"Partnerships Manager, Defi","company":"Scroll","image":"https://avatars.githubusercontent.com/u/87750292?s=200&v=4","description":"<div>Scroll has a remote-first work culture, our staff base is globally distributed and we are location agnostic. We make hiring decisions based on talent, culture fit and role suitability. If you have the skills and experience requested by this job description then please APPLY!</div><div>At Scroll, we operate on the bleeding edge of a fast-moving frontier of zk technology, research and innovation. The Partnership Manager will be responsible for onboarding new dApps and and systematically grow and strengthen Scroll’s DeFi ecosystem. You will identify opportunities for fruitful partnerships, meet with potential partners (remote or at conferences), and ensure the ongoing success. This role will require strategic thinking to align external partners with the interests of the Scroll community. The role is ideal for an individual who thrives in a start-up environment, a self-starter that is dynamic and comfortable to take on responsibilities and can work effectively within a remote setup.</div><div><br></div><div><b>About Scroll…</b></div><div>Scroll is building an open source, bytecode level compatible zkEVM layer 2 solution for Ethereum. Our mission is to scale Ethereum while maintaining our values of credible neutrality, openness, and community driven.</div><h3>Responsibilities </h3><li>Cultivate and enhance partnerships with decentralized applications (dApps) and liquidity providers, leveraging expertise in key DeFi account management to foster collaborations within Scroll and its partners' ecosystems.</li><li>Play an instrumental role in shaping and executing the strategy for resource distribution within the Scroll DeFi network.</li><li>Analyze the evolving landscape of DeFi dApps to identify emerging trends and opportunities that can augment the Scroll ecosystem.</li><li>Proactively identify and assess potential new business ventures, aligning them with Scroll’s strategic objectives.</li><li>Efficiently manage and prioritize a diverse portfolio of projects and partnerships, ensuring optimal resource allocation and alignment with Scroll's vision.</li>,<h3>Requirements </h3><li>Deep understanding of and integration within the Ethereum DeFi community</li><li>Ability to analyze and interpret trading data and market performance while staying informed about the latest market trends, particularly in the DeFi and blockchain space.</li><li>Willingness to travel for community events</li><li>Strong communication and ability to explain complex issues in clear, persuasive language</li><li>Several years of experience in finance, investment banking, asset management, or a related field.</li><li>Experience with financial modeling, analysis, and investment strategies.</li>,<h3>Nice to Haves</h3><li>3+ years of relevant work experience in a DeFi project or (crypto) fund</li><li>Familiarity with handling and managing large financial portfolios.</li><li>Understanding of financial regulations and compliance requirements relevant to the role.</li><li>Knowledge of anti-money laundering (AML) and know your customer (KYC) regulations, especially in the context of DeFi and cryptocurrencies.</li>,<h3>About You</h3><li>Proactive self-starter with strong ownership skills, well-organized, disciplined, and efficient in autonomous task and project management.</li><li>Conscientious and self-driven, adept at setting clear goals and effectively prioritizing tasks.</li><li>Responsive and collaborative, committed to high work standards and ethics.</li><li>Skilled communicator, proficient in articulating ideas clearly in remote, globally distributed teams.</li><li>Thrives in a dynamic, agile start-up environment.</li><li>Attentive listener, excelling in engaging and collaborating with team members.</li><li>Resilient and driven, continuously evolving and adapting to achieve success.</li>,<h3>What We Offer</h3><li>A mission-led, collaborative culture</li><li>Opportunity to work with cutting edge technology and like-minded people who are contributing to the progression of Ethereum</li><li>Competitive salary package / generous paid time off / annual growth budget</li><li>Remote from any location with flexible hours</li><li>Home office set up / co-working membership allowance</li><li>Private healthcare in selected countries</li><div><i>Scroll is proud to be an equal opportunity workplace. We are committed to equal employment opportunities regardless of race, color, ancestry, religion, sex, national origin, sexual orientation, age, citizenship, marital status, disability, gender identity, or Veteran status. If you have a disability or special need, please let us know and we'll do our best to accommodate.</i></div>","tags":"[\"Finance\",\"management\"]","pubDate":"2024-01-02 12:19:20.304","link":"https://jobs.lever.co/ScrollFoundation/13eb162f-9c1f-4431-ad92-5807283065c5","savedDate":"2024-01-31 09:45:04.326","slug":"partnerships-manager-defi-scroll-3692"}]