[{"id":7800278069,"title":"IoT Solutions Architecture Manager","company":"Canonical","image":"https://pbs.twimg.com/profile_images/1673959375340290050/x7pNtXQ7_400x400.jpg","description":"\n      <p>Canonical is a leading provider of open source software and operating systems to the global enterprise and technology markets. Our platform, Ubuntu, is very widely used in breakthrough enterprise initiatives such as public cloud, data science, AI, engineering innovation and IoT. Our customers include the world's leading public cloud and silicon providers, and industry leaders in many sectors. The company is a pioneer of global distributed collaboration, with 1200+ colleagues in 75+ countries and very few office based roles. Teams meet two to four times yearly in person, in interesting locations around the world, to align on strategy and execution.</p>\n<p>The company is founder-led, profitable and growing.</p>\n<p>We are hiring an <strong>IoT Solutions Architecture Manager</strong> to lead a regionally-focused team of Field engineers in Presales and Professional Services activities, by helping customers with solution architecture, design and delivery.</p>\n<p><strong>Location: </strong>This is a remote role, running a team in one of three Geos, Americas, EMEA or APAC. You will therefore need to be located in one of those three Geos to manage that specific team that spans few timezones from you</p>\n<p>Our Internet of Things mission is to enable companies to make fleets of very secure connected devices. Canonical provides the base Ubuntu OS and kernel, with secure update and management mechanisms. Our customers create mission-critical control systems, gateways and appliances that need to meet stringent quality and security requirements, and we aspire to bring this level of security to the wider consumer electronics and device market.</p>\n<p>Our Field Engineers are thought leaders helping our customers solve hard problems. They are accomplished technologists that take a hands-on approach to embedded Linux strategy and delivery. They have a passion to help customers achieve ambitious technical and business goals, and to show how the Canonical approach to open source and connected devices brings best-of-breed thinking to the emerging field of edge compute. They also care to develop their colleagues, helping them deepen their understanding of the technology, their ability to manage time, and their awareness of customer business thinking for continuous improvement and personal development.</p>\n<p>This career opportunity requires a unique blend of skills. Successful candidates will know Linux well and be proficient coders and scripters. They will have experience of low-level Linux boot, BIOS, firmware and embedded software development methodologies. They also enjoy the pace of change and diversity of client engagements with driven and ambitious technology entrepreneurs. Competitive, business-focused technologists at heart, they are also team drivers that take pride in team and company wins.</p>\n<h3>The role entails</h3>\n<ul>\n<li>Lead and develop a team of Field engineers, ranging from graduate to senior, in the areas of Presales and Professional Services</li>\n<li>Solve customer problems by promoting our technologies and being a trusted advisor</li>\n<li>Work remotely in a single major time zone</li>\n<li>Coach, mentor, and offer career development feedback</li>\n<li>Identify and measure team health indicators</li>\n<li>Implement disciplined engineering processes</li>\n<li>Represent your team and product to stakeholders, partners, and customers&nbsp;</li>\n<li>Develop and evangelise great engineering and organisational practices</li>\n<li>Plan and manage progress on agreed goals and projects</li>\n<li>Be an active part of the leadership team, collaborating with other leaders</li>\n</ul>\n<h3>What we are looking for in you</h3>\n<ul>\n<li>Exceptional academic track record from both high school and university</li>\n<li>Bachelors degree in Computer Science or related technical field</li>\n<li>Extensive embedded Linux experience - Yocto or other</li>\n<li>Extensive Linux experience - Debian or Ubuntu preferred</li>\n<li>Fluency in at least one of Golang, Python, C, C++, or Rust</li>\n<li>Ability to manage a small team</li>\n<li>Experience with customer engagements</li>\n<li>Professional written and spoken English</li>\n<li>Excellent interpersonal skills, curiosity, flexibility, and accountability</li>\n<li>Result-oriented, with a personal drive to meet commitments&nbsp;</li>\n<li>An ability to communicate the business benefits of technology</li>\n<li>An humble learner and quick study</li>\n</ul>\n<p>Other desirable traits include RTOS experience, additional languages (both the programming and human kinds), and previous experience working in a remote-first, diverse, distributed company.</p>\n<h3>What we offer you</h3>\n<p>We consider geographical location, experience, and performance in shaping compensation worldwide. We revisit compensation annually (and more often for graduates and associates) to ensure we recognise outstanding performance. In addition to base pay, we offer a performance-driven annual bonus or commission. We provide all team members with additional benefits, which reflect our values and ideals. We balance our programs to meet local needs and ensure fairness globally.</p>\n<ul>\n<li>Distributed work environment with twice-yearly team sprints in person</li>\n<li>Personal learning and development budget of USD 2,000 per year</li>\n<li>Annual compensation review</li>\n<li>Recognition rewards</li>\n<li>Annual holiday leave</li>\n<li>Maternity and paternity leave</li>\n<li>Employee Assistance Programme</li>\n<li>Opportunity to travel to new locations to meet colleagues from your team and others</li>\n<li>Priority Pass, and travel upgrades for long haul company events</li>\n</ul>\n<h3>About Canonical</h3>\n<p>Canonical is a pioneering tech firm at the forefront of the global move to open source. As the company that publishes Ubuntu, one of the most important open source projects and the platform for AI, IoT and the cloud, we are changing the world of software. We recruit on a global basis and set a very high standard for people joining the company. We expect excellence - in order to succeed, we need to be the best at what we do. Most colleagues at Canonical have worked from home since its inception in 2004.​ Working here is a step into the future, and will challenge you to think differently, work smarter, learn new skills, and raise your game.</p>\n<p><strong>Canonical is an equal opportunity employer</strong></p>\n<p>We are proud to foster a workplace free from discrimination. Diversity of experience, perspectives, and background create a better work environment and better products.&nbsp;<a href=\"https://canonical.com/careers/diversity/identity\">Whatever your identity, we will give your application fair consideration.</a></p>\n<p>#LI-remote</p>\n<p>Requisition ID: 753</p><p></p>\n    ","tags":"[\"management\",\"engineering\"]","pubDate":"2025-01-31T09:13:00.293Z","link":"https://canonical.com/careers/6587365","slug":"iot-solutions-architecture-manager-canonical-6157"},{"id":6349150129,"title":"Product Owner - Insurance (Fully Remote)","company":"CoverGo","image":"https://pbs.twimg.com/profile_images/1382655628523364355/MWPIbbID_400x400.jpg","description":"<h3><strong>Top 3 Reasons To Join Us</strong></h3><ul> <li>Competitive Salary</li> <li>International Environment</li> <li>Working on the latest tech for the Insurtech Market Leader</li> </ul><h3><strong>About Us</strong></h3><p>At CoverGo, our mission is to empower all insurance companies to make insurance 100% digital and accessible to everyone.</p><ul> <li>We are a leading global no-code insurance platform for health, life, and P&amp;C</li> <li>We’re the winner of the Insurtech of the Year in all of Asia and other awards globally</li> <li>We work with insurance enterprise clients such as AXA, Bupa, MSIG, Dai-ichi, Bank of China Group Insurance, and many more</li> <li>We're an international, diverse team of over 120 people with 30 nationalities and team members working remotely from all over the world</li> <li>We are fully funded and backed by reputable VC funds and strategic institutional investors</li> <li>We have a global presence in Asia, EMEA and the Americas</li> <li>We’ve grown our annualized revenue by over 30x since January 2021</li> <li>We’re constantly working towards making CoverGo a workplace that you love coming to. We deeply believe that bringing together a diversity of thoughts, expressions, and perspectives is key to building the best culture for equally diverse communities all over the world</li> </ul><p><strong>About the Role:&nbsp;</strong></p><p>As a Product Owner for our core health insurance system, you will play a pivotal role in shaping the evolution of our policy servicing module. Acting as the bridge between stakeholders and development teams, you will refine requirements, define product features, and drive the delivery of high-quality, impactful solutions that address the unique challenges of the health insurance industry. With a strong focus on user needs, collaboration, and accountability, you will help us build products that meet market demands while ensuring compliance with regulatory standards. This role requires a proactive approach, balancing technical depth, strategic thinking, and effective communication in a distributed working environment.</p><h3>What You Will Do:</h3><ol> <li>Backlog &amp; Feature Management:</li> <ol> <li>Define and prioritize the product backlog to reflect business value, market trends, and customer requirements.</li> <li>Collaborate closely with stakeholders to gather detailed requirements and ensure alignment on priorities.</li> <li>Translate high-level objectives into detailed, actionable user stories with clear acceptance criteria.</li> </ol> <li>Collaboration &amp; Team Engagement:</li> <ol> <li>Serve as the key point of contact between local and remote development teams, ensuring clear communication and smooth execution of deliverables.</li> <li>Work alongside cross-functional teams (e.g., engineering, QA, design) to refine features and deliver exceptional user experiences.</li> </ol> <li>Domain Expertise:</li> <ol> <li>Leverage your knowledge of health insurance and policy servicing to guide product development and ensure relevance to market needs.</li> <li>Stay informed about health insurance regulations and compliance requirements to ensure all deliverables meet legal standards.</li> </ol> <li>Agile Leadership:</li> <ol> <li>Actively participate in Agile ceremonies such as sprint planning, reviews, and retrospectives.</li> <li>Provide clear guidance to the development team, proactively addressing roadblocks and ensuring focus on priorities.</li> </ol> <li>Data-Driven Decision Making:</li> <ol> <li>Define and track KPIs to measure product success and identify opportunities for improvement.</li> <li>Conduct regular market research and competitor analysis to inform product innovation.</li> </ol> <li>Stakeholder Engagement:</li> <ol> <li>Build strong relationships with internal and external stakeholders, managing expectations and providing regular updates on progress.</li> <li>Act as the voice of the customer, championing their needs throughout the product lifecycle.</li> </ol> <li>Strategic Roadmap Ownership:</li> <ol> <li>Drive the product roadmap for the policy servicing module, balancing immediate deliverables with long-term strategic goals.</li> <li>Align product goals with business objectives and communicate them effectively across the organization.</li> </ol> </ol><h3>What We Need:</h3><ul> <li>Experience &amp; Knowledge:</li> <ul> <li>Bachelor’s degree in Computer Science, Business, or a related field (advanced degree preferred).</li> <li>Minimum 5 years of experience as a Product Owner, with at least 3 years focused on insurtech or health insurance systems.</li> <li>Demonstrated success managing end-to-end product development in complex, multi-stakeholder environments.</li> <li>Strong understanding of health insurance products, policy servicing, and regulatory requirements.</li> </ul> <li>Skills &amp; Competencies:</li> <ul> <li>Exceptional communication and interpersonal skills, with the ability to work effectively with distributed teams.</li> <li>Proven expertise in Agile methodologies, backlog management, and using tools like Jira, Confluence, or Trello.</li> <li>Analytical mindset with a track record of making data-driven decisions to optimize product performance.</li> <li>Knowledge of UX/UI principles and experience collaborating with design teams to enhance user experiences.</li> <li>Familiarity with tools and practices for remote collaboration (e.g., Slack, Miro, Figma).</li> </ul> <li>Mindset &amp; Leadership:</li> <ul> <li>Self-starter with a strong sense of ownership and accountability.</li> <li>Comfortable working in a distributed team environment and managing competing priorities.</li> <li>Passionate about driving innovation in the health insurance industry and solving complex challenges.</li> </ul> </ul><h3><strong>Why You'll Love Working Here</strong></h3><ul> <li>Flexible Leave</li> <li>International Environment</li> <li>Competitive renumeration package</li> <li>Performance Bonus</li> <li>Stock Options after 6 months </li> <li>Company activities and events</li> <li>Learning and development plan</li> </ul><p><strong>CoverGo Company </strong><a href=\"https://www.youtube.com/watch?v=YI0ezLxvFvA\" rel=\"nofollow noreferrer noopener\" class=\"external\"><strong>Video</strong></a></p><p>By submitting your application, you confirm that you have read, understood, and accepted the content of CoverGo’s <a href=\"https://apply.workable.com/covergo/gdpr_policy?lng=en\" target=\"_blank\" rel=\"nofollow noreferrer noopener\" class=\"external\">Privacy Notice</a> and you consent to the processing of your data as part of this application.</p><p><a href=\"https://www.youtube.com/watch?v=YI0ezLxvFvA\" rel=\"nofollow noreferrer noopener\" class=\"external\"></a></p><h3>Requirements: </h3><h3>Benefits: </h3>","tags":"[\"management\",\"engineering\",\"legal\"]","pubDate":"2025-01-31T00:00:00.000Z","link":"https://apply.workable.com/covergo/j/29FFF183AC","slug":"product-owner-insurance-fully-remote-covergo-4625"},{"id":8038958829,"title":"Digital Insurance Project Manager - French Speaker (Fully Remote)","company":"CoverGo","image":"https://pbs.twimg.com/profile_images/1382655628523364355/MWPIbbID_400x400.jpg","description":"<p><strong>Top 3 Reasons To Join Us</strong></p><ul> <li>Competitive Salary</li> <li>100% Remote</li> <li>Working on the latest tech for the Insurtech Market Leader</li> </ul><p><strong>About Us</strong></p><p>At CoverGo, our mission is to empower all insurance companies to make insurance 100% digital and accessible to everyone.</p><ul> <li>We are a leading global no-code insurance platform for health, life, and P&amp;C</li> <li>We’re the winner of the Insurtech of the Year in all of Asia and other awards globally</li> <li>We work with insurance enterprise clients such as AXA, Bupa, MSIG, Dai-ichi, Bank of China Group Insurance, and many more</li> <li>We're an international, diverse team of over 120 people with 30 nationalities and team members working remotely from all over the world</li> <li>We are fully funded and backed by reputable VC funds and strategic institutional investors</li> <li>We have a global presence in Asia, EMEA and the Americas</li> <li>We’ve grown our annualized revenue by over 30x since January 2021</li> <li>We’re constantly working towards making CoverGo a workplace that you love coming to. We deeply believe that bringing together a diversity of thoughts, expressions, and perspectives is key to building the best culture for equally diverse communities all over the world and a workplace that you love coming to. We deeply believe that bringing together a diversity of thoughts, expressions, and perspectives is key to building the best culture for equally diverse communities all over the world</li> </ul><p><strong>About the Role</strong></p><p>As a Digital Insurance Project Manager, your core responsibility will be to oversee and manage the implementation of new and/or existing projects within CoverGo's operations. This role presents an exciting opportunity for an individual with a strong drive to lead transformative projects in the insurtech industry. </p><p><strong>What You Will Do</strong></p><ul> <li>Engage and manage relationships with clients and stakeholders</li> <li>Lead project planning sessions with the internal team and client's staff</li> <li>Support solution proposals for client pursuits, proposals, and PoCs</li> <li>Participate in proposal and POC processes (i.e. design, submission, and review)</li> <li>Support the creation of contracts and related communication with clients</li> <li>Identify and help secure growth opportunities for existing clients</li> <li>Manage project progress and adapt work as required</li> <li>Ensure projects meet deadlines</li> <li>Manage relationships with clients and stakeholders</li> <li>Host regular/weekly project review and create reports with key metrics about team and project status using company standard metrics</li> <li>Oversee all incoming and outgoing project documentation</li> <li>Identify and manage issues, risks, assumptions, and dependencies</li> <li>Continuously optimize and improve processes and the overall approach where necessary</li> </ul><p><strong>What We Need</strong></p><ul> <li>Bachelor's degree in computer science or a related technical field is a plus</li> <li>5+ years experience as a Project Manager</li> <li>Insurance domain knowledge is a must</li> <li>Strong client facing experience is a must</li> <li>Technical skills are a plus</li> <li>Has experience seeing projects through the full life cycle</li> <li>Excellent analytical skills and problem-solving skills</li> <li>Strong interpersonal skills and extremely resourceful</li> <li>Proven ability to complete projects according to outlined scope, budget, and timeline</li> <li>Self-motivated and able to work independently</li> <li>Able, willing, and excited to work in a fast-paced collaborative startup environment</li> <li>Must be able to speak French</li> </ul><p><strong>Why You'll Love Working Here</strong></p><ul> <li>Fully Remote</li> <li>Flexible Leave</li> <li>International Environment</li> <li>Competitive renumeration package</li> <li>Performance Bonus</li> <li>Company activities and events</li> <li>Learning and development plan</li> <li>Remote work allowance</li> </ul><p><strong>CoverGo Company </strong><a href=\"https://www.youtube.com/watch?v=YI0ezLxvFvA\" rel=\"nofollow noreferrer noopener\" class=\"external\"><strong>Video</strong></a></p><p>By submitting your application, you confirm that you have read, understood, and accepted the content of CoverGo’s <a href=\"https://apply.workable.com/covergo/gdpr_policy?lng=en\" target=\"_blank\" rel=\"nofollow noreferrer noopener\" class=\"external\">Privacy Notice</a> and you consent to the processing of your data as part of this application.</p><p><a href=\"https://www.youtube.com/watch?v=YI0ezLxvFvA\" rel=\"nofollow noreferrer noopener\" class=\"external\"></a></p><h3>Requirements: </h3><h3>Benefits: </h3>","tags":"[]","pubDate":"2025-01-31T00:00:00.000Z","link":"https://apply.workable.com/covergo/j/850BC4C294","slug":"digital-insurance-project-manager-french-speaker-fully-remote-covergo-2351"},{"id":7976353975,"title":"Senior Business Analyst - Insurance, French Speaker (Fully Remote)","company":"CoverGo","image":"https://pbs.twimg.com/profile_images/1382655628523364355/MWPIbbID_400x400.jpg","description":"<h3><strong>Top 3 Reasons To Join Us</strong></h3><ul> <li>Competitive Salary</li> <li>100% Remote</li> <li>Working on the latest tech for the Insurtech Market Leader</li> </ul><h3><strong>About Us</strong></h3><p>At CoverGo, our mission is to empower all insurance companies to make insurance 100% digital and accessible to everyone.</p><ul> <li>We are a leading global no-code insurance platform for health, life, and P&amp;C</li> <li>We’re the winner of the Insurtech of the Year in all of Asia and other awards globally</li> <li>We work with insurance enterprise clients such as AXA, Bupa, MSIG, Dai-ichi, Bank of China Group Insurance, and many more</li> <li>We're an international, diverse team of over 120 people with 30 nationalities and team members working remotely from all over the world</li> <li>We are fully funded and backed by reputable VC funds and strategic institutional investors</li> <li>We have a global presence in Asia, EMEA and the Americas</li> <li>We’ve grown our annualized revenue by over 30x since January 2021</li> <li>We’re constantly working towards making CoverGo a workplace that you love coming to. We deeply believe that bringing together a diversity of thoughts, expressions, and perspectives is key to building the best culture for equally diverse communities all over the world</li> </ul><h3><strong>What You Will Do:</strong></h3><ul> <li>Work with clients and technical resources to identify their business problems and develop the right approach and analytical solution</li> <li>Plan and design simple to semi-complex business processes and system modifications</li> <li>Make recommendations to improve and support business activities</li> <li>Gather business requirements through a variety of techniques such as work sessions and interviews then analyze and document client complex business requirements and processes; communicate these requirements to appropriate parties</li> <li>Create complex test case scenarios to be used in testing; monitor/oversee the testing of business applications to verify that all client requirements are incorporated into the system design</li> <li>Develop business requirements documents/user stories to support the required modifications</li> <li>May plan, allocate and monitor work of other business analysts</li> <li>Understand simple to complex systems and related data to surface actionable insights, demonstrate sound judgment and decision-making skills</li> <li>Assist in providing time estimates for project related tasks</li> <li>Aid in updating process and procedural documentation</li> <li>Develop basic understanding of technical development cycle of mobile application or web portals</li> <li>Support QA, UAT and Release phases of the project via defect analysis, change maintenance, etc.</li> <li>Any other task that may be assigned</li> </ul><h3><strong>What We Need:</strong></h3><ul> <li>Minimum 5 years of experience as Business Analyst</li> <li>A degree in Business, IT or any relevant field</li> <li>Previous experience working in the insurance industry is required (Insurtech or health insurance experience is preferred)</li> <li>Health Insurance-related domain certification from INS/LOMA or III is an added advantage</li> <li>Knowledge of business analysis concepts of defining requirements, translating to technical solutions, and Agile approach to prioritizing work to epics, sprints</li> <li>Business analysis skills including facilitation, process documentation, requirements gathering and user acceptance testing</li> <li>Good organizational/time management skills to prioritize work and meet deadlines within defined timeframes</li> <li>Experience in an Agile and/or Scrum environment is a must</li> <li>Basic knowledge in generating process documentation, and document system functionality, data integration, and workflow</li> <li>Excellent written and verbal communication skills in English</li> <li>Technical writing skills are a plus</li> <li>Must be able to speak in French fluently</li> </ul><h3><strong>Why You'll Love Working Here</strong></h3><ul> <li>Fully Remote</li> <li>Flexible Leave</li> <li>International Environment</li> <li>Competitive renumeration package</li> <li>Performance Bonus</li> <li>Stock Options after 6 months </li> <li>Company activities and events</li> <li>Learning and development plan</li> <li>Remote work allowance</li> </ul><p><strong>CoverGo Company </strong><a href=\"https://www.youtube.com/watch?v=YI0ezLxvFvA\" rel=\"nofollow noreferrer noopener\" class=\"external\"><strong>Video</strong></a></p><p>By submitting your application, you confirm that you have read, understood, and accepted the content of CoverGo’s <a href=\"https://apply.workable.com/covergo/gdpr_policy?lng=en\" target=\"_blank\" rel=\"nofollow noreferrer noopener\" class=\"external\">Privacy Notice</a> and you consent to the processing of your data as part of this application.</p><p><a href=\"https://www.youtube.com/watch?v=YI0ezLxvFvA\" rel=\"nofollow noreferrer noopener\" class=\"external\"></a></p><h3>Requirements: </h3><h3>Benefits: </h3>","tags":"[\"management\"]","pubDate":"2025-01-31T00:00:00.000Z","link":"https://apply.workable.com/covergo/j/88553016C1","slug":"senior-business-analyst-insurance-french-speaker-fully-remote-covergo-1539"},{"id":1427061240,"title":"Digital Insurance Project Manager - French Speaker (Fully Remote)","company":"CoverGo","image":"https://pbs.twimg.com/profile_images/1382655628523364355/MWPIbbID_400x400.jpg","description":"<p><strong>Top 3 Reasons To Join Us</strong></p><ul> <li>Competitive Salary</li> <li>100% Remote</li> <li>Working on the latest tech for the Insurtech Market Leader</li> </ul><p><strong>About Us</strong></p><p>At CoverGo, our mission is to empower all insurance companies to make insurance 100% digital and accessible to everyone.</p><ul> <li>We are a leading global no-code insurance platform for health, life, and P&amp;C</li> <li>We’re the winner of the Insurtech of the Year in all of Asia and other awards globally</li> <li>We work with insurance enterprise clients such as AXA, Bupa, MSIG, Dai-ichi, Bank of China Group Insurance, and many more</li> <li>We're an international, diverse team of over 120 people with 30 nationalities and team members working remotely from all over the world</li> <li>We are fully funded and backed by reputable VC funds and strategic institutional investors</li> <li>We have a global presence in Asia, EMEA and the Americas</li> <li>We’ve grown our annualized revenue by over 30x since January 2021</li> <li>We’re constantly working towards making CoverGo a workplace that you love coming to. We deeply believe that bringing together a diversity of thoughts, expressions, and perspectives is key to building the best culture for equally diverse communities all over the world and a workplace that you love coming to. We deeply believe that bringing together a diversity of thoughts, expressions, and perspectives is key to building the best culture for equally diverse communities all over the world</li> </ul><p><strong>About the Role</strong></p><p>As a Digital Insurance Project Manager, your core responsibility will be to oversee and manage the implementation of new and/or existing projects within CoverGo's operations. This role presents an exciting opportunity for an individual with a strong drive to lead transformative projects in the insurtech industry. </p><p><strong>What You Will Do</strong></p><ul> <li>Engage and manage relationships with clients and stakeholders</li> <li>Lead project planning sessions with the internal team and client's staff</li> <li>Support solution proposals for client pursuits, proposals, and PoCs</li> <li>Participate in proposal and POC processes (i.e. design, submission, and review)</li> <li>Support the creation of contracts and related communication with clients</li> <li>Identify and help secure growth opportunities for existing clients</li> <li>Manage project progress and adapt work as required</li> <li>Ensure projects meet deadlines</li> <li>Manage relationships with clients and stakeholders</li> <li>Host regular/weekly project review and create reports with key metrics about team and project status using company standard metrics</li> <li>Oversee all incoming and outgoing project documentation</li> <li>Identify and manage issues, risks, assumptions, and dependencies</li> <li>Continuously optimize and improve processes and the overall approach where necessary</li> </ul><p><strong>What We Need</strong></p><ul> <li>Bachelor's degree in computer science or a related technical field is a plus</li> <li>5+ years experience as a Project Manager</li> <li>Insurance domain knowledge is a must</li> <li>Strong client facing experience is a must</li> <li>Technical skills are a plus</li> <li>Has experience seeing projects through the full life cycle</li> <li>Excellent analytical skills and problem-solving skills</li> <li>Strong interpersonal skills and extremely resourceful</li> <li>Proven ability to complete projects according to outlined scope, budget, and timeline</li> <li>Self-motivated and able to work independently</li> <li>Able, willing, and excited to work in a fast-paced collaborative startup environment</li> <li>Must be able to speak in French fluently</li> </ul><p><strong>Why You'll Love Working Here</strong></p><ul> <li>Fully Remote</li> <li>Flexible Leave</li> <li>International Environment</li> <li>Competitive renumeration package</li> <li>Performance Bonus</li> <li>Company activities and events</li> <li>Learning and development plan</li> <li>Remote work allowance</li> </ul><p><strong>CoverGo Company </strong><a href=\"https://www.youtube.com/watch?v=YI0ezLxvFvA\" rel=\"nofollow noreferrer noopener\" class=\"external\"><strong>Video</strong></a></p><p>By submitting your application, you confirm that you have read, understood, and accepted the content of CoverGo’s <a href=\"https://apply.workable.com/covergo/gdpr_policy?lng=en\" target=\"_blank\" rel=\"nofollow noreferrer noopener\" class=\"external\">Privacy Notice</a> and you consent to the processing of your data as part of this application.</p><p><a href=\"https://www.youtube.com/watch?v=YI0ezLxvFvA\" rel=\"nofollow noreferrer noopener\" class=\"external\"></a></p><h3>Requirements: </h3><h3>Benefits: </h3>","tags":"[]","pubDate":"2025-01-31T00:00:00.000Z","link":"https://apply.workable.com/covergo/j/3E07573DD2","slug":"digital-insurance-project-manager-french-speaker-fully-remote-covergo-9105"},{"id":7901157638,"title":"Senior Business Analyst - Insurance, French Speaker (Fully Remote)","company":"CoverGo","image":"https://pbs.twimg.com/profile_images/1382655628523364355/MWPIbbID_400x400.jpg","description":"<h3><strong>Top 3 Reasons To Join Us</strong></h3><ul> <li>Competitive Salary</li> <li>100% Remote</li> <li>Working on the latest tech for the Insurtech Market Leader</li> </ul><h3><strong>About Us</strong></h3><p>At CoverGo, our mission is to empower all insurance companies to make insurance 100% digital and accessible to everyone.</p><ul> <li>We are a leading global no-code insurance platform for health, life, and P&amp;C</li> <li>We’re the winner of the Insurtech of the Year in all of Asia and other awards globally</li> <li>We work with insurance enterprise clients such as AXA, Bupa, MSIG, Dai-ichi, Bank of China Group Insurance, and many more</li> <li>We're an international, diverse team of over 120 people with 30 nationalities and team members working remotely from all over the world</li> <li>We are fully funded and backed by reputable VC funds and strategic institutional investors</li> <li>We have a global presence in Asia, EMEA and the Americas</li> <li>We’ve grown our annualized revenue by over 30x since January 2021</li> <li>We’re constantly working towards making CoverGo a workplace that you love coming to. We deeply believe that bringing together a diversity of thoughts, expressions, and perspectives is key to building the best culture for equally diverse communities all over the world</li> </ul><h3><strong>What You Will Do:</strong></h3><ul> <li>Work with clients and technical resources to identify their business problems and develop the right approach and analytical solution</li> <li>Plan and design simple to semi-complex business processes and system modifications</li> <li>Make recommendations to improve and support business activities</li> <li>Gather business requirements through a variety of techniques such as work sessions and interviews then analyze and document client complex business requirements and processes; communicate these requirements to appropriate parties</li> <li>Create complex test case scenarios to be used in testing; monitor/oversee the testing of business applications to verify that all client requirements are incorporated into the system design</li> <li>Develop business requirements documents/user stories to support the required modifications</li> <li>May plan, allocate and monitor work of other business analysts</li> <li>Understand simple to complex systems and related data to surface actionable insights, demonstrate sound judgment and decision-making skills</li> <li>Assist in providing time estimates for project related tasks</li> <li>Aid in updating process and procedural documentation</li> <li>Develop basic understanding of technical development cycle of mobile application or web portals</li> <li>Support QA, UAT and Release phases of the project via defect analysis, change maintenance, etc.</li> <li>Any other task that may be assigned</li> </ul><h3><strong>What We Need:</strong></h3><ul> <li>Minimum 5 years of experience as Business Analyst</li> <li>A degree in Business, IT or any relevant field</li> <li>Previous experience working in the insurance industry is required (Insurtech or health insurance experience is preferred)</li> <li>Health Insurance-related domain certification from INS/LOMA or III is an added advantage</li> <li>Knowledge of business analysis concepts of defining requirements, translating to technical solutions, and Agile approach to prioritizing work to epics, sprints</li> <li>Business analysis skills including facilitation, process documentation, requirements gathering and user acceptance testing</li> <li>Good organizational/time management skills to prioritize work and meet deadlines within defined timeframes</li> <li>Experience in an Agile and/or Scrum environment is a must</li> <li>Basic knowledge in generating process documentation, and document system functionality, data integration, and workflow</li> <li>Excellent written and verbal communication skills in English</li> <li>Technical writing skills are a plus</li> <li>Must be able to speak in French fluently</li> </ul><h3><strong>Why You'll Love Working Here</strong></h3><ul> <li>Fully Remote</li> <li>Flexible Leave</li> <li>International Environment</li> <li>Competitive renumeration package</li> <li>Performance Bonus</li> <li>Stock Options after 6 months </li> <li>Company activities and events</li> <li>Learning and development plan</li> <li>Remote work allowance</li> </ul><p><strong>CoverGo Company </strong><a href=\"https://www.youtube.com/watch?v=YI0ezLxvFvA\" rel=\"nofollow noreferrer noopener\" class=\"external\"><strong>Video</strong></a></p><p>By submitting your application, you confirm that you have read, understood, and accepted the content of CoverGo’s <a href=\"https://apply.workable.com/covergo/gdpr_policy?lng=en\" target=\"_blank\" rel=\"nofollow noreferrer noopener\" class=\"external\">Privacy Notice</a> and you consent to the processing of your data as part of this application.</p><p><a href=\"https://www.youtube.com/watch?v=YI0ezLxvFvA\" rel=\"nofollow noreferrer noopener\" class=\"external\"></a></p><h3>Requirements: </h3><h3>Benefits: </h3>","tags":"[\"management\"]","pubDate":"2025-01-31T00:00:00.000Z","link":"https://apply.workable.com/covergo/j/3A1F908B3B","slug":"senior-business-analyst-insurance-french-speaker-fully-remote-covergo-5918"},{"id":2052927225,"title":"Digital Insurance Project Manager - French Speaker (Fully Remote)","company":"CoverGo","image":"https://pbs.twimg.com/profile_images/1382655628523364355/MWPIbbID_400x400.jpg","description":"<p><strong>Top 3 Reasons To Join Us</strong></p><ul> <li>Competitive Salary</li> <li>100% Remote</li> <li>Working on the latest tech for the Insurtech Market Leader</li> </ul><p><strong>About Us</strong></p><p>At CoverGo, our mission is to empower all insurance companies to make insurance 100% digital and accessible to everyone.</p><ul> <li>We are a leading global no-code insurance platform for health, life, and P&amp;C</li> <li>We’re the winner of the Insurtech of the Year in all of Asia and other awards globally</li> <li>We work with insurance enterprise clients such as AXA, Bupa, MSIG, Dai-ichi, Bank of China Group Insurance, and many more</li> <li>We're an international, diverse team of over 120 people with 30 nationalities and team members working remotely from all over the world</li> <li>We are fully funded and backed by reputable VC funds and strategic institutional investors</li> <li>We have a global presence in Asia, EMEA and the Americas</li> <li>We’ve grown our annualized revenue by over 30x since January 2021</li> <li>We’re constantly working towards making CoverGo a workplace that you love coming to. We deeply believe that bringing together a diversity of thoughts, expressions, and perspectives is key to building the best culture for equally diverse communities all over the world and a workplace that you love coming to. We deeply believe that bringing together a diversity of thoughts, expressions, and perspectives is key to building the best culture for equally diverse communities all over the world</li> </ul><p><strong>About the Role</strong></p><p>As a Digital Insurance Project Manager, your core responsibility will be to oversee and manage the implementation of new and/or existing projects within CoverGo's operations. This role presents an exciting opportunity for an individual with a strong drive to lead transformative projects in the insurtech industry. </p><p><strong>What You Will Do</strong></p><ul> <li>Engage and manage relationships with clients and stakeholders</li> <li>Lead project planning sessions with the internal team and client's staff</li> <li>Support solution proposals for client pursuits, proposals, and PoCs</li> <li>Participate in proposal and POC processes (i.e. design, submission, and review)</li> <li>Support the creation of contracts and related communication with clients</li> <li>Identify and help secure growth opportunities for existing clients</li> <li>Manage project progress and adapt work as required</li> <li>Ensure projects meet deadlines</li> <li>Manage relationships with clients and stakeholders</li> <li>Host regular/weekly project review and create reports with key metrics about team and project status using company standard metrics</li> <li>Oversee all incoming and outgoing project documentation</li> <li>Identify and manage issues, risks, assumptions, and dependencies</li> <li>Continuously optimize and improve processes and the overall approach where necessary</li> </ul><p><strong>What We Need</strong></p><ul> <li>Bachelor's degree in computer science or a related technical field is a plus</li> <li>5+ years experience as a Project Manager</li> <li>Insurance domain knowledge is a must</li> <li>Strong client facing experience is a must</li> <li>Technical skills are a plus</li> <li>Has experience seeing projects through the full life cycle</li> <li>Excellent analytical skills and problem-solving skills</li> <li>Strong interpersonal skills and extremely resourceful</li> <li>Proven ability to complete projects according to outlined scope, budget, and timeline</li> <li>Self-motivated and able to work independently</li> <li>Able, willing, and excited to work in a fast-paced collaborative startup environment</li> <li>Must be able to speak in French fluently</li> </ul><p><strong>Why You'll Love Working Here</strong></p><ul> <li>Fully Remote</li> <li>Flexible Leave</li> <li>International Environment</li> <li>Competitive renumeration package</li> <li>Performance Bonus</li> <li>Company activities and events</li> <li>Learning and development plan</li> <li>Remote work allowance</li> </ul><p><strong>CoverGo Company </strong><a href=\"https://www.youtube.com/watch?v=YI0ezLxvFvA\" rel=\"nofollow noreferrer noopener\" class=\"external\"><strong>Video</strong></a></p><p>By submitting your application, you confirm that you have read, understood, and accepted the content of CoverGo’s <a href=\"https://apply.workable.com/covergo/gdpr_policy?lng=en\" target=\"_blank\" rel=\"nofollow noreferrer noopener\" class=\"external\">Privacy Notice</a> and you consent to the processing of your data as part of this application.</p><p><a href=\"https://www.youtube.com/watch?v=YI0ezLxvFvA\" rel=\"nofollow noreferrer noopener\" class=\"external\"></a></p><h3>Requirements: </h3><h3>Benefits: </h3>","tags":"[]","pubDate":"2025-01-31T00:00:00.000Z","link":"https://apply.workable.com/covergo/j/DFFC26101C","slug":"digital-insurance-project-manager-french-speaker-fully-remote-covergo-9847"},{"id":8278789120,"title":"Senior Business Analyst - Insurance, French Speaker (Fully Remote)","company":"CoverGo","image":"https://pbs.twimg.com/profile_images/1382655628523364355/MWPIbbID_400x400.jpg","description":"<h3><strong>Top 3 Reasons To Join Us</strong></h3><ul> <li>Competitive Salary</li> <li>100% Remote</li> <li>Working on the latest tech for the Insurtech Market Leader</li> </ul><h3><strong>About Us</strong></h3><p>At CoverGo, our mission is to empower all insurance companies to make insurance 100% digital and accessible to everyone.</p><ul> <li>We are a leading global no-code insurance platform for health, life, and P&amp;C</li> <li>We’re the winner of the Insurtech of the Year in all of Asia and other awards globally</li> <li>We work with insurance enterprise clients such as AXA, Bupa, MSIG, Dai-ichi, Bank of China Group Insurance, and many more</li> <li>We're an international, diverse team of over 120 people with 30 nationalities and team members working remotely from all over the world</li> <li>We are fully funded and backed by reputable VC funds and strategic institutional investors</li> <li>We have a global presence in Asia, EMEA and the Americas</li> <li>We’ve grown our annualized revenue by over 30x since January 2021</li> <li>We’re constantly working towards making CoverGo a workplace that you love coming to. We deeply believe that bringing together a diversity of thoughts, expressions, and perspectives is key to building the best culture for equally diverse communities all over the world</li> </ul><h3><strong>What You Will Do:</strong></h3><ul> <li>Work with clients and technical resources to identify their business problems and develop the right approach and analytical solution</li> <li>Plan and design simple to semi-complex business processes and system modifications</li> <li>Make recommendations to improve and support business activities</li> <li>Gather business requirements through a variety of techniques such as work sessions and interviews then analyze and document client complex business requirements and processes; communicate these requirements to appropriate parties</li> <li>Create complex test case scenarios to be used in testing; monitor/oversee the testing of business applications to verify that all client requirements are incorporated into the system design</li> <li>Develop business requirements documents/user stories to support the required modifications</li> <li>May plan, allocate and monitor work of other business analysts</li> <li>Understand simple to complex systems and related data to surface actionable insights, demonstrate sound judgment and decision-making skills</li> <li>Assist in providing time estimates for project related tasks</li> <li>Aid in updating process and procedural documentation</li> <li>Develop basic understanding of technical development cycle of mobile application or web portals</li> <li>Support QA, UAT and Release phases of the project via defect analysis, change maintenance, etc.</li> <li>Any other task that may be assigned</li> </ul><h3><strong>What We Need:</strong></h3><ul> <li>Minimum 5 years of experience as Business Analyst</li> <li>A degree in Business, IT or any relevant field</li> <li>Previous experience working in the insurance industry is required (Insurtech or health insurance experience is preferred)</li> <li>Health Insurance-related domain certification from INS/LOMA or III is an added advantage</li> <li>Knowledge of business analysis concepts of defining requirements, translating to technical solutions, and Agile approach to prioritizing work to epics, sprints</li> <li>Business analysis skills including facilitation, process documentation, requirements gathering and user acceptance testing</li> <li>Good organizational/time management skills to prioritize work and meet deadlines within defined timeframes</li> <li>Experience in an Agile and/or Scrum environment is a must</li> <li>Basic knowledge in generating process documentation, and document system functionality, data integration, and workflow</li> <li>Excellent written and verbal communication skills in English</li> <li>Technical writing skills are a plus</li> <li>Must be able to speak in French fluently</li> </ul><h3><strong>Why You'll Love Working Here</strong></h3><ul> <li>Fully Remote</li> <li>Flexible Leave</li> <li>International Environment</li> <li>Competitive renumeration package</li> <li>Performance Bonus</li> <li>Stock Options after 6 months </li> <li>Company activities and events</li> <li>Learning and development plan</li> <li>Remote work allowance</li> </ul><p><strong>CoverGo Company </strong><a href=\"https://www.youtube.com/watch?v=YI0ezLxvFvA\" rel=\"nofollow noreferrer noopener\" class=\"external\"><strong>Video</strong></a></p><p>By submitting your application, you confirm that you have read, understood, and accepted the content of CoverGo’s <a href=\"https://apply.workable.com/covergo/gdpr_policy?lng=en\" target=\"_blank\" rel=\"nofollow noreferrer noopener\" class=\"external\">Privacy Notice</a> and you consent to the processing of your data as part of this application.</p><p><a href=\"https://www.youtube.com/watch?v=YI0ezLxvFvA\" rel=\"nofollow noreferrer noopener\" class=\"external\"></a></p><h3>Requirements: </h3><h3>Benefits: </h3>","tags":"[\"management\"]","pubDate":"2025-01-31T00:00:00.000Z","link":"https://apply.workable.com/covergo/j/FCFF7E4746","slug":"senior-business-analyst-insurance-french-speaker-fully-remote-covergo-2299"},{"id":8026324207,"title":"Account Executive - Management Liability","company":"Counterpart","image":"https://media.licdn.com/dms/image/v2/D560BAQEtAXn0ryOTBw/company-logo_200_200/company-logo_200_200/0/1694785555271/yourcounterpart_logo?e=1744243200&v=beta&t=-BEjbQP7PMMfAC5PtCYEgvJk4MuWZ4Bfzh54loGzpwo","description":"&lt;p&gt;&lt;strong&gt;Account Executive - Management Liability&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;Counterpart believes in small businesses and is dedicated to helping them do more with less risk. By pairing leading insurance experts with cutting-edge technology, Counterpart empowers small business owners to grow with confidence. Exceptional underwriters, trusted insurance brokers, and prominent insurance carriers come together on the Counterpart platform to support small businesses by providing AI-driven management and professional liability underwriting and claims services. That’s where you come in…&lt;/p&gt;\n&lt;p&gt;As a member of the risk engineering team, you will be responsible for the production of premium through proper risk analysis and effective distribution of our product. In collaboration with the engineering, design, data, and operations team, you will leverage your industry knowledge and broker relationships to develop management liability and professional liability insurance products that brokers are eager to promote to their clients.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;AS AN ACCOUNT EXECUTIVE YOU WILL:&lt;/strong&gt;&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;&lt;strong&gt;Achieve and exceed sales and underwriting goals&lt;/strong&gt;: Drive premium growth by managing high-volume submissions, meeting revenue targets, and proactively following up on quotes to convert opportunities into bound policies.&lt;/li&gt;\n&lt;li&gt;&lt;strong&gt;Price accounts efficiently and competitively&lt;/strong&gt;: Quickly assess and quote simpler risks with accuracy, ensuring terms align with underwriting guidelines and broker needs.&lt;/li&gt;\n&lt;li&gt;&lt;strong&gt;Prioritize quote follow-up and engagement&lt;/strong&gt;: Actively follow up on automated quotes and broker inquiries to ensure timely responses, build trust, and maximize bind rates.&lt;/li&gt;\n&lt;li&gt;&lt;strong&gt;Foster strong broker relationships&lt;/strong&gt;: Serve as a trusted partner to brokers, providing thoughtful communication, personalized service, and solutions that meet their clients’ needs.&lt;/li&gt;\n&lt;li&gt;&lt;strong&gt;Collaborate with the underwriting team&lt;/strong&gt;: Share market insights and broker feedback with peers to enhance underwriting strategies and streamline processes.&lt;/li&gt;\n&lt;li&gt;&lt;strong&gt;Provide actionable market feedback&lt;/strong&gt;: Recommend improvements to terms, rates, and guidelines, contributing to the continuous enhancement of policy forms, coverages, and automated systems.&lt;/li&gt;\n&lt;li&gt;&lt;strong&gt;Drive account growth through broker engagement&lt;/strong&gt;: Actively engage with brokers to strengthen relationships, increase submissions, and promote Counterpart’s offerings.&lt;/li&gt;\n&lt;li&gt;&lt;strong&gt;Represent Counterpart at local events&lt;/strong&gt;: Attend broker meetings and industry events to showcase Counterpart’s products, enhance visibility, and support broker engagement efforts.&lt;/li&gt;\n&lt;li&gt;&lt;strong&gt;Contribute to sales and process improvement initiatives&lt;/strong&gt;: Offer feedback to refine Counterpart’s tools and workflows, ensuring brokers have an exceptional quoting and binding experience.&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;&lt;strong&gt;WE LOOK FOR TEAMMATES WHO HAVE:&lt;/strong&gt;&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;&lt;strong&gt;4–8 years of underwriting or sales experience&lt;/strong&gt;: Demonstrated expertise in management liability insurance products, with a proven ability to assess and price risks effectively.&lt;/li&gt;\n&lt;li&gt;&lt;strong&gt;A strong broker network&lt;/strong&gt;: Established relationships with brokers, carriers, or underwriters in the management liability space, with evidence of driving submission volume and premium growth.&lt;/li&gt;\n&lt;li&gt;&lt;strong&gt;Specialty liability knowledge&lt;/strong&gt;: Proficiency in rating procedures, policy forms, endorsements, and applications specific to management liability products.&lt;/li&gt;\n&lt;li&gt;&lt;strong&gt;Sales and relationship-building skills&lt;/strong&gt;: Proven ability to engage brokers, nurture long-term partnerships, and actively follow up on quotes to drive account binding.&lt;/li&gt;\n&lt;li&gt;&lt;strong&gt;Confident communication abilities&lt;/strong&gt;: Comfortable presenting to brokers, clients, and internal teams, with a focus on articulating value propositions and resolving objections.&lt;/li&gt;\n&lt;li&gt;&lt;strong&gt;Success in sales and account management&lt;/strong&gt;: Documented history of meeting or exceeding monthly, quarterly, and annual sales or revenue targets in a performance-driven environment.&lt;/li&gt;\n&lt;li&gt;&lt;strong&gt;Adaptability in a fast-paced environment&lt;/strong&gt;: Thrives in high-velocity, tech-driven workflows with a focus on delivering results under tight timelines.&lt;/li&gt;\n&lt;li&gt;&lt;strong&gt;Educational background&lt;/strong&gt;: A college degree with at least 4+ years of relevant work experience in underwriting or professional liability insurance.&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;&lt;strong&gt;WHO YOU WILL WORK WITH:&amp;nbsp;&lt;/strong&gt;&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;&lt;strong&gt;Mike Levins, Head of Insurance&lt;/strong&gt;: Mike previously was the Head of Broker Relations and US MGA Operations at Hiscox. Mike oversaw the Midwest region with ~20 underwriters offering 13 different product lines, the primary lines being management liability, professional liability, and cyber/technology. His extensive insurance career has afforded Mike strong relationships across hundreds of retail and wholesale brokers. Mike received his BS from Marquette University and MBA from Benedictine University.&lt;/li&gt;\n&lt;li&gt;&lt;strong&gt;Tanner Hackett, CEO:&lt;/strong&gt; Having founded two other major startups, including Button and Lazada, Tanner now spends his time focused on mental health through his philanthropy,&lt;a href=&quot;http://openminded.org&quot;&gt; Openminded.org&lt;/a&gt;, in addition to reading, surfing, yoga, and enjoying the outdoors.&lt;/li&gt;\n&lt;li&gt;&lt;strong&gt;Satwik Mysore, Risk Engineer Territory Lead: &lt;/strong&gt;After graduating with an actuarial science degree, Satwik has spent most of his career at Travelers, where he built one of the largest and most profitable management liability books by forming strong broker relationships.&lt;/li&gt;\n&lt;li&gt;&lt;strong&gt;Brad Bahler, Risk Engineer Territory Lead:&lt;/strong&gt; Brad has over a decade of experience in management liability underwriting. He managed one of the largest books of small business management liability risks at Travelers, where he was known for his deep understanding of coverage, outstanding submission response times, and boundless enthusiasm for the space.&lt;/li&gt;\n&lt;li&gt;&lt;strong&gt;Jake O’Donnell, Risk Engineer Territory Lead:&amp;nbsp;&lt;/strong&gt;Jake started his insurance career at Chubb, where he was able to develop and grow a profitable book of private-for-profit and non-profit management liability business. Jake is known for his exceptional service to industry brokers and his extensive knowledge of management liability. Jake also is a CPCU designation recipient.&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;&lt;strong&gt;WHAT WE OFFER&lt;/strong&gt;&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;&lt;strong&gt;Fully remote workplace&lt;/strong&gt;&lt;/li&gt;\n&lt;li&gt;&lt;strong&gt;Unlimited Vacation&lt;/strong&gt;: We offer flexible time off, allowing you to take time when you need it.&lt;/li&gt;\n&lt;li&gt;&lt;strong&gt;Work from Anywhere&lt;/strong&gt;: Counterpart is a fully distributed company, meaning there is no office. We allow employees to work from wherever they do their best work, and invite the team to meet in person a couple times per year.&lt;/li&gt;\n&lt;li&gt;&lt;strong&gt;Stock Options&amp;nbsp;&lt;/strong&gt;&lt;/li&gt;\n&lt;li&gt;&lt;strong&gt;Health, Dental, and Vision Coverage&lt;/strong&gt;&lt;/li&gt;\n&lt;li&gt;&lt;strong&gt;401(k) Retirement Plan&lt;/strong&gt;&lt;/li&gt;\n&lt;li&gt;&lt;strong&gt;Parental Leave&lt;/strong&gt;&lt;/li&gt;\n&lt;li&gt;&lt;strong&gt;Home Office Allowance&lt;/strong&gt;: &lt;strong&gt;to set up your home office&lt;/strong&gt; with the necessary equipment and accessories.&lt;/li&gt;\n&lt;li&gt;&lt;strong&gt;Wellness Stipend&lt;/strong&gt;&lt;/li&gt;\n&lt;li&gt;&lt;strong&gt;Book stipend&lt;/strong&gt;&lt;/li&gt;\n&lt;li&gt;&lt;strong&gt;Professional Development Reimbursement&lt;/strong&gt;&lt;/li&gt;\n&lt;li&gt;&lt;strong&gt;No working birthdays&lt;/strong&gt;: &lt;strong&gt;Take your birthday off&lt;/strong&gt;, giving you the opportunity to relax, enjoy your special day, and spend time with loved ones.&lt;/li&gt;\n&lt;li&gt;&lt;strong&gt;Charitable Contribution Matching&lt;/strong&gt;&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;&lt;strong&gt;COUNTERPART&#39;S VALUES&lt;/strong&gt;&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;&lt;strong&gt;Conjoin Expectations&lt;/strong&gt; - it is the cornerstone of autonomy. Ensure you are aware of what is expected of you and clearly articulate what you expect of others.&amp;nbsp;&lt;/li&gt;\n&lt;li&gt;&lt;strong&gt;Speak Boldly &amp;amp; Honestly&lt;/strong&gt; - the only failure is not learning from mistakes. Don’t cheat yourself and your colleagues of the feedback needed when&amp;nbsp; expectations aren’t being met.&amp;nbsp;&lt;/li&gt;\n&lt;li&gt;&lt;strong&gt;Be Entrepreneurial&lt;/strong&gt; - control your own destiny.&amp;nbsp; Embrace action over perfection while navigating any obstacles that stand in the way of your ultimate goal.&amp;nbsp;&lt;/li&gt;\n&lt;li&gt;&lt;strong&gt;Practice Omotenashi&lt;/strong&gt; (“selfless hospitality”) - trust will follow.&amp;nbsp; Consider every interaction with internal and external partners an opportunity to develop trust by going above and beyond what is expected.&amp;nbsp;&lt;/li&gt;\n&lt;li&gt;&lt;strong&gt;Hold Nothing As Sacred&lt;/strong&gt; - create routines but modify them routinely.&lt;strong&gt;&amp;nbsp; &lt;/strong&gt;Take the time to reflect on where the business is today, where it needs to&amp;nbsp; go, and what you have to change in order to get there.&amp;nbsp;&lt;/li&gt;\n&lt;li&gt;&lt;strong&gt;Prioritize Wellness&lt;/strong&gt; - some things should never be sacrificed. We create an environment that stretches everyone to grow and improve, which is fulfilling, but is only one part of a meaningful life.&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;Our estimated pay range for this role is $105,000 to $120,000. Base salary is determined by a variety of factors, including but not limited to, market data, location, internal equitability, and experience.&lt;/p&gt;\n&lt;p&gt;We are committed to being a welcoming and inclusive workplace for everyone, and we are intentional about making sure people feel respected, supported and connected at work—regardless of who you are or where you come from. We value and celebrate our differences and we believe being open about who we are allows us to do the best work of our lives.&amp;nbsp;&lt;/p&gt;\n&lt;p&gt;We are an Equal Opportunity Employer. We do not discriminate against qualified applicants or employees on the basis of race, color, religion, gender identity, sex, sexual preference, sexual identity, pregnancy, national origin, ancestry, citizenship, age, marital status, physical disability, mental disability, medical condition, military status, or any other characteristic protected by federal, state, or local law, rule, or regulation.&amp;nbsp;&lt;/p&gt;\n&lt;p&gt;&lt;br&gt;&lt;br&gt;&lt;/p&gt;","tags":"[\"management\",\"engineering\"]","pubDate":"2025-01-30T20:43:47.000Z","link":"https://job-boards.greenhouse.io/counterpart/jobs/4523454005","slug":"account-executive-management-liability-counterpart-6622"},{"id":1511293817,"title":"Senior Production Risk Engineer - Professional Liability, Allied Health","company":"Counterpart","image":"https://media.licdn.com/dms/image/v2/D560BAQEtAXn0ryOTBw/company-logo_200_200/company-logo_200_200/0/1694785555271/yourcounterpart_logo?e=1744243200&v=beta&t=-BEjbQP7PMMfAC5PtCYEgvJk4MuWZ4Bfzh54loGzpwo","description":"&lt;p&gt;&lt;strong&gt;SENIOR PRODUCTION RISK ENGINEER, [Professional Liability], Allied Health&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;Counterpart believes in small businesses and is dedicated to helping them do more with less risk. By pairing leading insurance experts with cutting-edge technology, Counterpart empowers small business owners to grow with confidence. Exceptional underwriters, trusted insurance brokers, and prominent insurance carriers come together on the Counterpart platform to support small businesses by providing AI-driven management and professional liability underwriting and claims services. That’s where you come in…&lt;/p&gt;\n&lt;p&gt;As a member of the risk engineering team, you will be responsible for the production of premium through proper risk analysis and effective distribution of our product. In collaboration with the engineering, design, data, and operations team, you will leverage your industry knowledge and broker relationships to develop management liability and professional liability insurance products that brokers are eager to promote to their clients.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;AS A PRODUCTION FOCUSED RISK ENGINEER YOU WILL:&lt;/strong&gt;&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;Achieve and exceed underwriting performance and revenue goals: Underwrite Allied Health professional liability risks in accordance with Counterpart’s procedures and profitability objectives.&lt;/li&gt;\n&lt;li&gt;Price accounts thoughtfully and competitively: Evaluate Allied Health accounts to provide tailored, market-competitive terms while adhering to underwriting guidelines.&lt;/li&gt;\n&lt;li&gt;Manage quote-related communication: Respond to broker inquiries regarding Allied Health products promptly and build trust through consistent, thoughtful interactions.&lt;/li&gt;\n&lt;li&gt;Collaborate on complex exposures: Work closely with the underwriting team to analyze and address unique risks in Allied Health accounts, ensuring comprehensive coverage solutions.&lt;/li&gt;\n&lt;li&gt;Provide market feedback: Recommend enhancements to terms, rates, and guidelines specific to Allied Health, contributing to the continuous improvement of policy forms and endorsements.&lt;/li&gt;\n&lt;li&gt;Bind accounts through broker engagement: Develop and maintain strong relationships with brokers to drive submissions and ensure premium growth in the Allied Health sector.&lt;/li&gt;\n&lt;li&gt;Represent Counterpart at industry events: Attend broker meetings and healthcare-related conferences to promote Allied Health professional liability products and foster broker relationships.&lt;/li&gt;\n&lt;li&gt;Influence product development: Contribute insights on the Allied Health sector to improve Counterpart’s tools and services as a key stakeholder in product innovation.&lt;/li&gt;\n&lt;li&gt;Opportunity to become the SME for Allied Health: With proven success, transition into a subject matter expert (SME) role, focusing on product development and innovation within the Allied Health professional liability space.&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;&lt;strong&gt;WE LOOK FOR TEAMMATES WHO HAVE:&lt;/strong&gt;&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;5–12 years of underwriting experience: Specific expertise in professional liability insurance, with a focus on Allied Health risks preferred.&lt;/li&gt;\n&lt;li&gt;A network of industry relationships: Brokers, carriers, underwriters, or clients within the professional liability and Allied Health insurance sectors.&lt;/li&gt;\n&lt;li&gt;Expertise in specialty liability products: Proficiency in rating procedures, policy forms, applications, and endorsements, particularly for Allied Health.&lt;/li&gt;\n&lt;li&gt;Broker engagement skills: Proven ability to establish and nurture long-term, profitable partnerships with brokers specializing in Allied Health and professional liability.&lt;/li&gt;\n&lt;li&gt;Confident communicator: Skilled in presenting to internal teams and external stakeholders, with a strong ability to convey complex risk analyses and product insights.&lt;/li&gt;\n&lt;li&gt;Sales and account management success: Demonstrated track record of achieving and exceeding sales and revenue targets in a high-performance environment.&lt;/li&gt;\n&lt;li&gt;Entrepreneurial mindset: Enthusiasm for tackling continuous challenges in a high-velocity, innovative workplace.&lt;/li&gt;\n&lt;li&gt;Flexibility for travel: Willingness to travel as needed (minimum of once per month) for broker meetings, conferences, and industry events.&lt;/li&gt;\n&lt;li&gt;Educational background: College degree with 4+ years of relevant work experience in underwriting or professional liability.&lt;/li&gt;\n&lt;li&gt;Growth-oriented perspective: Interest in transitioning into a subject matter expert (SME) role focused on Allied Health product development and future healthcare products.&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;&lt;strong&gt;WHO YOU WILL WORK WITH:&amp;nbsp;&lt;/strong&gt;&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;&lt;strong&gt;Mike Levins, Head of Insurance&lt;/strong&gt;: Mike previously was the Head of Broker Relations and US MGA Operations at Hiscox. Mike oversaw the Midwest region with ~20 underwriters offering 13 different product lines, the primary lines being management liability, professional liability, and cyber/technology. His extensive insurance career has afforded Mike strong relationships across hundreds of retail and wholesale brokers. Mike received his BS from Marquette University and MBA from Benedictine University.&lt;/li&gt;\n&lt;li&gt;&lt;strong&gt;Tanner Hackett, CEO:&lt;/strong&gt; Having founded two other major startups, including Button and Lazada, Tanner now spends his time focused on mental health through his philanthropy,&lt;a href=&quot;http://openminded.org&quot;&gt; Openminded.org&lt;/a&gt;, in addition to reading, surfing, yoga, and enjoying the outdoors.&amp;nbsp;&lt;/li&gt;\n&lt;li&gt;&lt;strong&gt;Satwik Mysore, Risk Engineer Territory Lead: &lt;/strong&gt;After graduating with an actuarial science degree, Satwik has spent most of his career at Travelers, where he built one of the largest and most profitable management liability books by forming strong broker relationships.&lt;/li&gt;\n&lt;li&gt;&lt;strong&gt;Brad Bahler, Risk Engineer Territory Lead:&lt;/strong&gt; Brad has over a decade of experience in management liability underwriting. He managed one of the largest books of small business management liability risks at Travelers, where he was known for his deep understanding of coverage, outstanding submission response times, and boundless enthusiasm for the space.&lt;/li&gt;\n&lt;li&gt;&lt;strong&gt;Jake O’Donnell, Risk Engineer Territory Lead: &lt;/strong&gt;Jake started his insurance career at Chubb, where he was able to develop and grow a profitable book of private-for-profit and non-profit management liability business. Jake is known for his exceptional service to industry brokers and his extensive knowledge of management liability. Jake also is a CPCU designation recipient.&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;&lt;strong&gt;WHAT WE OFFER&lt;/strong&gt;&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;&lt;strong&gt;Fully remote workplace&lt;/strong&gt;&lt;/li&gt;\n&lt;li&gt;&lt;strong&gt;Unlimited Vacation&lt;/strong&gt;: We offer flexible time off, allowing you to take time when you need it.&lt;/li&gt;\n&lt;li&gt;&lt;strong&gt;Work from Anywhere&lt;/strong&gt;: Counterpart is a fully distributed company, meaning there is no office. We allow employees to work from wherever they do their best work, and invite the team to meet in person a couple times per year.&lt;/li&gt;\n&lt;li&gt;&lt;strong&gt;Stock Options&amp;nbsp;&lt;/strong&gt;&lt;/li&gt;\n&lt;li&gt;&lt;strong&gt;Health, Dental, and Vision Coverage&lt;/strong&gt;&lt;/li&gt;\n&lt;li&gt;&lt;strong&gt;401(k) Retirement Plan&lt;/strong&gt;&lt;/li&gt;\n&lt;li&gt;&lt;strong&gt;Parental Leave&lt;/strong&gt;&lt;/li&gt;\n&lt;li&gt;&lt;strong&gt;Home Office Allowance&lt;/strong&gt;: &lt;strong&gt;to set up your home office&lt;/strong&gt; with the necessary equipment and accessories.&lt;/li&gt;\n&lt;li&gt;&lt;strong&gt;Wellness Stipend&lt;/strong&gt;&lt;/li&gt;\n&lt;li&gt;&lt;strong&gt;Book stipend&lt;/strong&gt;&lt;/li&gt;\n&lt;li&gt;&lt;strong&gt;Professional Development Reimbursement&lt;/strong&gt;&lt;/li&gt;\n&lt;li&gt;&lt;strong&gt;No working birthdays&lt;/strong&gt;: &lt;strong&gt;Take your birthday off&lt;/strong&gt;, giving you the opportunity to relax, enjoy your special day, and spend time with loved ones.&lt;/li&gt;\n&lt;li&gt;&lt;strong&gt;Charitable Contribution Matching&lt;/strong&gt;&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;&lt;strong&gt;COUNTERPART&#39;S VALUES&lt;/strong&gt;&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;&lt;strong&gt;Conjoin Expectations&lt;/strong&gt; - it is the cornerstone of autonomy. Ensure you are aware of what is expected of you and clearly articulate what you expect of others.&amp;nbsp;&lt;/li&gt;\n&lt;li&gt;&lt;strong&gt;Speak Boldly &amp;amp; Honestly&lt;/strong&gt; - the only failure is not learning from mistakes. Don’t cheat yourself and your colleagues of the feedback needed when&amp;nbsp; expectations aren’t being met.&amp;nbsp;&lt;/li&gt;\n&lt;li&gt;&lt;strong&gt;Be Entrepreneurial&lt;/strong&gt; - control your own destiny.&amp;nbsp; Embrace action over perfection while navigating any obstacles that stand in the way of your ultimate goal.&amp;nbsp;&lt;/li&gt;\n&lt;li&gt;&lt;strong&gt;Practice Omotenashi&lt;/strong&gt; (“selfless hospitality”) - trust will follow.&amp;nbsp; Consider every interaction with internal and external partners an opportunity to develop trust by going above and beyond what is expected.&amp;nbsp;&lt;/li&gt;\n&lt;li&gt;&lt;strong&gt;Hold Nothing As Sacred&lt;/strong&gt; - create routines but modify them routinely.&lt;strong&gt;&amp;nbsp; &lt;/strong&gt;Take the time to reflect on where the business is today, where it needs to&amp;nbsp; go, and what you have to change in order to get there.&amp;nbsp;&lt;/li&gt;\n&lt;li&gt;&lt;strong&gt;Prioritize Wellness&lt;/strong&gt; - some things should never be sacrificed. We create an environment that stretches everyone to grow and improve, which is fulfilling, but is only one part of a meaningful life.&lt;br&gt;&lt;br&gt;&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;Our estimated pay range for this role is $140,000 to $160,000. Base salary is determined by a variety of factors, including but not limited to, market data, location, internal equitability, and experience.&lt;/p&gt;\n&lt;p&gt;We are committed to being a welcoming and inclusive workplace for everyone, and we are intentional about making sure people feel respected, supported and connected at work—regardless of who you are or where you come from. We value and celebrate our differences and we believe being open about who we are allows us to do the best work of our lives.&amp;nbsp;&lt;/p&gt;\n&lt;p&gt;We are an Equal Opportunity Employer. We do not discriminate against qualified applicants or employees on the basis of race, color, religion, gender identity, sex, sexual preference, sexual identity, pregnancy, national origin, ancestry, citizenship, age, marital status, physical disability, mental disability, medical condition, military status, or any other characteristic protected by federal, state, or local law, rule, or regulation.&amp;nbsp;&lt;/p&gt;","tags":"[\"management\",\"engineering\"]","pubDate":"2025-01-30T20:36:40.000Z","link":"https://job-boards.greenhouse.io/counterpart/jobs/4523559005","slug":"senior-production-risk-engineer-professional-liability-allied-health-counterpart-3258"},{"id":7931166551,"title":"Project Manager","company":"Clutch","image":"https://app.ashbyhq.com/api/images/org-theme-logo/87f6e542-ae68-4ff1-ab48-f05e9dab1964/e24aecd5-3955-404a-8728-c08806c78730.png","description":"<h1><strong>About the Role</strong></h1><p style=\"min-height:1.5em\">Engagement Managers are Project Managers on our Implementation Team with a bias towards customer engagement and success. They’ll handle about 8 customers at a time and lead their Implementation Projects through to success while holding others on the Project Team, both internally and externally, accountable for milestones, action items, and deliverables.</p><p style=\"min-height:1.5em\"></p><h1><strong>About the Team</strong></h1><p style=\"min-height:1.5em\">Our Implementation Team helps to get new Customers (Credit Unions) successfully onboarded to the Clutch Platform. Project teams consist of an Implementation Engineer and an Engagement Manager who work together to ensure the onboarding is successful.</p><p style=\"min-height:1.5em\"></p><h1><strong>What You’ll Do</strong></h1><p style=\"min-height:1.5em\"></p><h2>Within 3 months, you will:</h2><ul style=\"min-height:1.5em\"><li><p style=\"min-height:1.5em\">Drive the Onboarding efforts of new and existing customers by understanding business objectives and partnering with the project team to prescribe best practice recommendations in order to achieve those goals</p></li><li><p style=\"min-height:1.5em\">Develop detailed project plan schedules and work breakdown structures to ensure project team accountability for milestone dates and work quality</p></li><li><p style=\"min-height:1.5em\">Create comprehensive weekly status reports and communication plans to executive sponsors and internal/external project teams</p></li><li><p style=\"min-height:1.5em\">Proactively identify implementation risks and mitigate them effectively and efficiently</p></li><li><p style=\"min-height:1.5em\">Quickly establish/nurture rapport and a positive relationship with customer stakeholders</p></li></ul><h2>Within 6 months, you will:</h2><ul style=\"min-height:1.5em\"><li><p style=\"min-height:1.5em\">Execute implementation projects while partnering closely with our clients’ Executive-level project sponsors</p></li><li><p style=\"min-height:1.5em\">Deliver on these engagements which includes driving milestone meetings (onsite and virtual), customizing and developing new project artifacts and ensuring high levels of impact and client satisfaction with the services rendered</p></li><li><p style=\"min-height:1.5em\">Track detailed scope of engagement and when applicable work with the customer to estimate scope change/additions and execute change order(s)</p></li><li><p style=\"min-height:1.5em\">Develop and maintain a deep understanding of Credit Unions to be a trusted thought leader and advisor with your customers</p></li><li><p style=\"min-height:1.5em\">Coach and mentor project team members to facilitate improved teamwork both internally and with the client</p></li></ul><h2>Within 9 months, you will:</h2><ul style=\"min-height:1.5em\"><li><p style=\"min-height:1.5em\">Participate in establishing practices, templates, policies, tools, and partnerships to expand and mature the capabilities of the team</p></li><li><p style=\"min-height:1.5em\">Help us design methodologies, templates, and collateral to deliver new Clutch products effectively</p></li></ul><p style=\"min-height:1.5em\"></p><h1><strong>What You’ll Bring</strong></h1><ul style=\"min-height:1.5em\"><li><p style=\"min-height:1.5em\">Excellent communication skills; both written and verbal. Comfortable leading meetings with customers</p></li><li><p style=\"min-height:1.5em\">Ability to identify and clearly communicate pragmatic solutions to complex integration problems.</p></li><li><p style=\"min-height:1.5em\">Superior time management skills to manage multiple external customers simultaneously</p></li><li><p style=\"min-height:1.5em\">A passion for working with people, paired with excellent communication skills; you can explain a complex technical issue in such a way that most people could understand</p></li><li><p style=\"min-height:1.5em\">In-depth knowledge and experience with successfully managing enterprise software application implementations with waterfall and agile methodologies</p></li><li><p style=\"min-height:1.5em\">Skill set to understand and document business requirements as well provide prescriptive recommendations by actively listening and asking probing questions</p></li><li><p style=\"min-height:1.5em\">Experience with spearheading initiatives with cross-functional teams on a number of concurrent engagements</p></li><li><p style=\"min-height:1.5em\">Record of professional achievements with a track record of delighted, successful, and satisfied customers</p></li><li><p style=\"min-height:1.5em\">Executive presence and confidence in communicating with technical, business, and VP &amp; C-level stakeholders</p></li><li><p style=\"min-height:1.5em\">Strong communication, presentation, consultative and leadership skills</p></li><li><p style=\"min-height:1.5em\">Ability to create structure in ambiguous situations and design effective processes</p></li><li><p style=\"min-height:1.5em\">Capability to be dynamic and adapt quickly in a fast-paced environment</p></li><li><p style=\"min-height:1.5em\">Passion to be an expert on the product and for being part of a fast-growing company</p></li></ul><p style=\"min-height:1.5em\"><em>Please note that this role may evolve as our business needs change, so we appreciate your flexibility and adaptability.</em></p><p style=\"min-height:1.5em\"><strong>What’s In It For You?</strong></p><ul style=\"min-height:1.5em\"><li><p style=\"min-height:1.5em\"><strong>Remote Flexibility:</strong> Enjoy the freedom of remote work from anywhere, balancing life and career seamlessly.</p></li><li><p style=\"min-height:1.5em\"><strong>Unforgettable Off-Sites:</strong> Twice a year, bond with colleagues in exciting destinations, fostering teamwork and fresh ideas.</p></li><li><p style=\"min-height:1.5em\"><strong>Paid Time Off and National Holidays:</strong> Enjoy 20 PTO days yearly and the National Holidays for relaxation and rejuvenation.</p></li><li><p style=\"min-height:1.5em\"><strong>Stock Options:</strong> Joining us means having a stake in our success, so you'll receive stock options as part of your compensation package.</p></li><li><p style=\"min-height:1.5em\"><strong>Home Office Setup:</strong> Create your ideal workspace with a dedicated budget for home office essentials.</p></li><li><p style=\"min-height:1.5em\"><strong>Work Trip Budget:</strong> Grow personally and professionally with a budget for work-related trips and co-working.</p></li></ul><p style=\"min-height:1.5em\"><strong>About Us</strong></p><p style=\"min-height:1.5em\"><strong>Clutch</strong> is a revolutionary vertical SaaS company, proudly backed by Andreessen Horowitz (A16z), aimed at revolutionizing the way Credit Unions engage and change the lives of their members. As a champion of financial well-being, we address the urgent need for affordable lending solutions in an era where the average American grapples with over $155,000 in household debt.  Unlike traditional financial institutions, Clutch develops software to turn Credit Unions into FinTech lenders and leverage their balance sheets to responsibly lend to over 130M Americans. Our mission extends beyond mere financial transactions; we strive to fundamentally enhance the way credit unions interact with their members. By integrating cutting-edge technologies and user-centric designs, we help credit unions provide seamless digital experiences that are on par with leading tech companies. This approach not only preserves but revitalizes the longstanding tradition of community and member-focused service inherent to credit unions.</p><p style=\"min-height:1.5em\"><strong>Please note:</strong> This position is offered on a contractor basis. Applicants must have the necessary documentation and authorization to work in the country where the job is located. Clutch cannot provide sponsorship or assist with obtaining work permits for this role.</p>","tags":"[\"management\"]","pubDate":"2025-01-30T19:11:30.199Z","link":"https://jobs.ashbyhq.com/withclutch/51556766-b421-483b-8071-a056e8a2ca08","slug":"project-manager-clutch-7489"},{"id":8229976773,"title":"Digital Analytics Strategist","company":"Winona","image":"https://yt3.googleusercontent.com/ZGlfAez34nsR8HXg119c3neHtGLos5lWuyQOAnml2Wuvb0stHrZPUSGBBkxK3YzNDCXOJd5oI9M=s160-c-k-c0x00ffffff-no-rj","description":"<p style=\"min-height:1.5em\"><strong>About Winona:</strong></p><p style=\"min-height:1.5em\"><a target=\"_blank\" rel=\"noopener noreferrer nofollow\" href=\"https://bywinona.com\">Winona</a> is one of the leading telemedicine companies providing HRT for women in menopause. We’ve built all of our technology in house including an EHR, patient care admin system, patient portal, website, marketing technology etc. Winona has two compounding pharmacies and a team of in house physicians providing world-class care via a fully vertically integrated business model.</p><p style=\"min-height:1.5em\"></p><p style=\"min-height:1.5em\"><strong>About the role: </strong></p><p style=\"min-height:1.5em\">We are seeking a highly motivated and experienced <strong>Digital Analytics Strategist with deep expertise in Google Analytics 4 (GA4)</strong> to join our team. In this role, you will play a pivotal part in shaping how we measure, analyze, and optimize digital customer experiences. You’ll audit and manage key platforms, and ensure our insights align with business goals. This is a hands-on role requiring advanced knowledge of Google Analytics, Google Tag Manager, and other analytics and personalization tools.</p><p style=\"min-height:1.5em\"></p><p style=\"min-height:1.5em\"><strong>Seniority Level: </strong>Mid-Senior Level</p><p style=\"min-height:1.5em\"><br /><strong>Responsibilities: </strong></p><p style=\"min-height:1.5em\">Analytics Strategy &amp; Implementation:</p><ul style=\"min-height:1.5em\"><li><p style=\"min-height:1.5em\">Act as a Google Analytics 4 (GA4) subject matter expert, providing strategic recommendations and best practices.</p></li><li><p style=\"min-height:1.5em\">Synthesize data from GA4, Hyros, Mixpanel, and other analytics tools to provide a comprehensive, cross-platform view of performance.</p></li><li><p style=\"min-height:1.5em\">Conduct comprehensive audits of existing analytics implementations and recommend optimization strategies.</p></li><li><p style=\"min-height:1.5em\">Manage Google Tag Manager (GTM) to ensure accurate and reliable data tracking.</p></li><li><p style=\"min-height:1.5em\">Develop processes and workflows for consolidating insights from these platforms to inform strategic decision-making.</p></li><li><p style=\"min-height:1.5em\">Develop and maintain technical documentation, including Solution Design References (SDRs), Business Requirements Documents (BRDs), and tracking specifications.</p></li></ul><p style=\"min-height:1.5em\">Insights, Analysis &amp; Reporting:</p><ul style=\"min-height:1.5em\"><li><p style=\"min-height:1.5em\">Analyze digital performance, including user behaviors, conversion funnels, and customer journeys, to identify opportunities for growth and optimization.</p></li><li><p style=\"min-height:1.5em\">Design and deliver actionable insights, dashboards, and reports tailored to key stakeholders.</p></li><li><p style=\"min-height:1.5em\">Monitor KPIs and provide regular reports on trends, anomalies, and areas for improvement to support strategic decision-making.</p></li></ul><p style=\"min-height:1.5em\">Optimization &amp; Testing:</p><ul style=\"min-height:1.5em\"><li><p style=\"min-height:1.5em\">Collaborate with the marketing team on A/B testing and personalization initiatives by providing data-driven analysis of test results and actionable recommendations.</p></li><li><p style=\"min-height:1.5em\">Ensure seamless tracking and accurate measurement of experiments and personalization efforts.</p></li><li><p style=\"min-height:1.5em\">Support marketing in testing hypotheses and iterating on strategies based on data-driven outcomes.</p></li></ul><p style=\"min-height:1.5em\"></p><p style=\"min-height:1.5em\"><strong>Requirements:</strong></p><ul style=\"min-height:1.5em\"><li><p style=\"min-height:1.5em\">1+ years of hands-on experience with Google Analytics 4 (GA4), including implementation, configuration, and reporting.</p></li><li><p style=\"min-height:1.5em\">4+ years of experience in digital analytics overall, with a strong foundation in web analytics tools like Google Analytics and other platforms.</p></li><li><p style=\"min-height:1.5em\">Experience in Hyros, Mixpanel, or similar tools is a plus.</p></li><li><p style=\"min-height:1.5em\">Experience with Optimizely or other A/B testing and personalization platforms.</p></li><li><p style=\"min-height:1.5em\">Advanced knowledge of Google Tag Manager (GTM) for complex configurations.</p></li><li><p style=\"min-height:1.5em\">Strong understanding of digital marketing, customer journeys, and conversion optimization.</p></li><li><p style=\"min-height:1.5em\">Excellent analytical and communication skills, with the ability to convey insights to both technical and non-technical audiences.</p></li><li><p style=\"min-height:1.5em\">Google Analytics certifications or other relevant certifications (preferred).</p></li></ul><p style=\"min-height:1.5em\"></p><p style=\"min-height:1.5em\"><strong>Key Skills:</strong></p><ul style=\"min-height:1.5em\"><li><p style=\"min-height:1.5em\">Required: Google Analytics 4</p></li><li><p style=\"min-height:1.5em\">Nice to have: Hyros, Mixpanel, Optimizely</p></li></ul><p style=\"min-height:1.5em\"></p><p style=\"min-height:1.5em\"><strong>What’s in it for you?</strong></p><p style=\"min-height:1.5em\">As a full-time member of our team, you’ll enjoy:</p><ul style=\"min-height:1.5em\"><li><p style=\"min-height:1.5em\">Flexible hours, work wherever you choose.</p></li><li><p style=\"min-height:1.5em\">Unlimited PTO.</p></li><li><p style=\"min-height:1.5em\">Medical/ Dental/ Vision insurance (US-W2).</p></li><li><p style=\"min-height:1.5em\">Non-working holidays per country of residence.</p></li><li><p style=\"min-height:1.5em\">Referral bonuses.</p></li><li><p style=\"min-height:1.5em\">Financial support for online courses.</p></li><li><p style=\"min-height:1.5em\">Fun and casual work environment.</p></li><li><p style=\"min-height:1.5em\">Employee engagement activities and virtual gatherings.</p></li><li><p style=\"min-height:1.5em\">We are a diverse, global team! 🌍</p></li></ul>","tags":"[]","pubDate":"2025-01-30T17:31:38.121Z","link":"https://jobs.ashbyhq.com/winona/87279a69-23ef-479f-a0f7-509aa378d7f7","slug":"digital-analytics-strategist-winona-949"},{"id":2739042419,"title":"Sr. Software Engineer","company":"Bobtail","image":"https://media.licdn.com/dms/image/v2/D560BAQHzAQXggf5uQg/company-logo_200_200/company-logo_200_200/0/1688643230676/bobtail_logo?e=1742428800&v=beta&t=P9gHgDHOknAHShwQR1JsLMYGaVscLGTzwmWViGMvnbE","description":"&lt;h2&gt;&lt;span style=&quot;font-weight: 400;&quot;&gt;About Bobtail&lt;/span&gt;&lt;/h2&gt;\n&lt;p&gt;&lt;span style=&quot;font-weight: 400;&quot;&gt;Bobtail is dedicated to increasing happiness by eliminating inefficiencies in the supply chain.&amp;nbsp; We envision a supply chain without friction, fraud, waste, and abuse where companies succeed based on the value they create.&amp;nbsp;&amp;nbsp;&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span style=&quot;font-weight: 400;&quot;&gt;We work in a unique way at Bobtail, where we value teams over individuals and encourage experimentation and iteration to constantly improve.&amp;nbsp; Teams are given flexibility in working towards a shared purpose and given the freedom to decide how they will accomplish their goals.&amp;nbsp;&amp;nbsp;&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span style=&quot;font-weight: 400;&quot;&gt;If you are an out of the box thinker that takes a proactive approach in collaborating with others to solve problems and achieve your goals - we would love to talk to you.&amp;nbsp;&amp;nbsp;&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span style=&quot;font-weight: 400;&quot;&gt;The things we value:&lt;/span&gt;&lt;/p&gt;\n&lt;ol&gt;\n&lt;li style=&quot;font-weight: 400;&quot;&gt;&lt;span style=&quot;font-weight: 400;&quot;&gt;Mission&lt;/span&gt;&lt;/li&gt;\n&lt;li style=&quot;font-weight: 400;&quot;&gt;&lt;span style=&quot;font-weight: 400;&quot;&gt;Teams over individuals&lt;/span&gt;&lt;/li&gt;\n&lt;li style=&quot;font-weight: 400;&quot;&gt;&lt;span style=&quot;font-weight: 400;&quot;&gt;Collaboration&lt;/span&gt;&lt;/li&gt;\n&lt;li style=&quot;font-weight: 400;&quot;&gt;&lt;span style=&quot;font-weight: 400;&quot;&gt;Communication&lt;/span&gt;&lt;/li&gt;\n&lt;li style=&quot;font-weight: 400;&quot;&gt;&lt;span style=&quot;font-weight: 400;&quot;&gt;Iteration&lt;/span&gt;&lt;/li&gt;\n&lt;li style=&quot;font-weight: 400;&quot;&gt;&lt;span style=&quot;font-weight: 400;&quot;&gt;Experimentation and failing fast&lt;/span&gt;&lt;/li&gt;\n&lt;li style=&quot;font-weight: 400;&quot;&gt;&lt;span style=&quot;font-weight: 400;&quot;&gt;Initiative and solutions oriented approach&lt;/span&gt;&lt;/li&gt;\n&lt;li style=&quot;font-weight: 400;&quot;&gt;&lt;span style=&quot;font-weight: 400;&quot;&gt;Documentation&lt;/span&gt;&lt;/li&gt;\n&lt;li style=&quot;font-weight: 400;&quot;&gt;&lt;span style=&quot;font-weight: 400;&quot;&gt;Data&lt;/span&gt;&lt;/li&gt;\n&lt;li style=&quot;font-weight: 400;&quot;&gt;&lt;span style=&quot;font-weight: 400;&quot;&gt;Mental health and work life balance&lt;/span&gt;&lt;/li&gt;\n&lt;li style=&quot;font-weight: 400;&quot;&gt;&lt;span style=&quot;font-weight: 400;&quot;&gt;Diversity&lt;/span&gt;&lt;/li&gt;\n&lt;li style=&quot;font-weight: 400;&quot;&gt;&lt;span style=&quot;font-weight: 400;&quot;&gt;Transparency&lt;/span&gt;&lt;span style=&quot;font-weight: 400;&quot;&gt;&lt;br&gt;&lt;br&gt;&lt;/span&gt;&lt;/li&gt;\n&lt;/ol&gt;\n&lt;h2&gt;&lt;span style=&quot;font-weight: 400;&quot;&gt;You should apply if you have:&lt;/span&gt;&lt;/h2&gt;\n&lt;ul&gt;\n&lt;li style=&quot;font-weight: 400;&quot;&gt;&lt;span style=&quot;font-weight: 400;&quot;&gt;Exposure to SDLC from reviewing requirements through to debugging complex systems in Production.&lt;/span&gt;&lt;/li&gt;\n&lt;li style=&quot;font-weight: 400;&quot;&gt;&lt;span style=&quot;font-weight: 400;&quot;&gt;Strong theoretical fundamentals and hands-on experience designing and implementing highly available and performant fault-tolerant distributed systems.&lt;/span&gt;&lt;/li&gt;\n&lt;li style=&quot;font-weight: 400;&quot;&gt;&lt;span style=&quot;font-weight: 400;&quot;&gt;5+ years of experience in software engineering with demonstrated proficiency in programming languages, such as nodejs, typescript and overall system design.&lt;/span&gt;&lt;/li&gt;\n&lt;li style=&quot;font-weight: 400;&quot;&gt;&lt;span style=&quot;font-weight: 400;&quot;&gt;Experience building enterprise software, event driven microservices architecture, and distributed systems at scale.&lt;/span&gt;&lt;/li&gt;\n&lt;li style=&quot;font-weight: 400;&quot;&gt;&lt;span style=&quot;font-weight: 400;&quot;&gt;Bachelor&#39;s degree in computer science or a related engineering degree.&lt;/span&gt;&lt;/li&gt;\n&lt;/ul&gt;\n&lt;h2&gt;&lt;span style=&quot;font-weight: 400;&quot;&gt;You will be responsible for:&lt;/span&gt;&lt;/h2&gt;\n&lt;ul&gt;\n&lt;li style=&quot;font-weight: 400;&quot;&gt;&lt;span style=&quot;font-weight: 400;&quot;&gt;Writing reusable, testable, efficient and secure code.&lt;/span&gt;&lt;/li&gt;\n&lt;li style=&quot;font-weight: 400;&quot;&gt;&lt;span style=&quot;font-weight: 400;&quot;&gt;Working with large scale, highly available and resilient modern financial systems.&lt;/span&gt;&lt;/li&gt;\n&lt;li style=&quot;font-weight: 400;&quot;&gt;&lt;span style=&quot;font-weight: 400;&quot;&gt;Working with automated deployment, enabling code release multiple times a day.&lt;/span&gt;&lt;/li&gt;\n&lt;li style=&quot;font-weight: 400;&quot;&gt;&lt;span style=&quot;font-weight: 400;&quot;&gt;Working with modern tools and languages that excite you&lt;/span&gt;&lt;/li&gt;\n&lt;li style=&quot;font-weight: 400;&quot;&gt;&lt;span style=&quot;font-weight: 400;&quot;&gt;Being an integral part of a team, in addition to its culture and ways of working. Common practices include agile methodologies.&lt;/span&gt;&lt;/li&gt;\n&lt;/ul&gt;\n&lt;h2&gt;&lt;span style=&quot;font-weight: 400;&quot;&gt;Some of the technologies you’ll get to work with:&lt;/span&gt;&lt;/h2&gt;\n&lt;ul&gt;\n&lt;li style=&quot;font-weight: 400;&quot;&gt;&lt;span style=&quot;font-weight: 400;&quot;&gt;Typescript &amp;amp; Javascript.&lt;/span&gt;&lt;/li&gt;\n&lt;li style=&quot;font-weight: 400;&quot;&gt;&lt;span style=&quot;font-weight: 400;&quot;&gt;Node.js, Express js.&lt;/span&gt;&lt;/li&gt;\n&lt;li style=&quot;font-weight: 400;&quot;&gt;&lt;span style=&quot;font-weight: 400;&quot;&gt;CI/CD, AWS, Terraform, Docker, EKS / ECS.&lt;/span&gt;&lt;/li&gt;\n&lt;/ul&gt;\n&lt;h2&gt;&lt;span style=&quot;font-weight: 400;&quot;&gt;Benefits&lt;/span&gt;&lt;/h2&gt;\n&lt;ul&gt;\n&lt;li style=&quot;font-weight: 400;&quot;&gt;&lt;span style=&quot;font-weight: 400;&quot;&gt;Monthly Mental Break Day&lt;/span&gt;&lt;/li&gt;\n&lt;li style=&quot;font-weight: 400;&quot;&gt;&lt;span style=&quot;font-weight: 400;&quot;&gt;Paid Time Off&lt;/span&gt;&lt;/li&gt;\n&lt;li style=&quot;font-weight: 400;&quot;&gt;&lt;span style=&quot;font-weight: 400;&quot;&gt;Work from home (or wherever)&lt;/span&gt;&lt;/li&gt;\n&lt;li style=&quot;font-weight: 400;&quot;&gt;&lt;span style=&quot;font-weight: 400;&quot;&gt;Parental leave&lt;/span&gt;&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;&lt;span style=&quot;font-weight: 400;&quot;&gt;If you are interested in learning more, please email us at careers@bobtail.com.&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span style=&quot;font-weight: 400;&quot;&gt;&lt;br&gt;&lt;/span&gt;&lt;span style=&quot;font-weight: 400;&quot;&gt;Creating a diverse and inclusive workplace is Bobtail’s nucleus. We are an equal opportunity employer and embrace people of different backgrounds, cultures, religions, national origins, races, colors, genders, gender expressions, sexual orientations, ages, marital status, veteran status, experiences, abilities and perspective&lt;/span&gt;&lt;span style=&quot;font-weight: 400;&quot;&gt;s.&lt;/span&gt; &lt;span style=&quot;font-weight: 400;&quot;&gt;&lt;br&gt;&lt;br&gt;&lt;/span&gt;&lt;/p&gt;","tags":"[\"javascript\",\"typescript\",\"engineering\",\"aws\"]","pubDate":"2025-01-30T13:12:49.000Z","link":"https://job-boards.greenhouse.io/bobtail/jobs/4514274005","slug":"sr-software-engineer-bobtail-4953"},{"id":5343715676,"title":"Head of Customer Onboarding","company":"Sumsub","image":"https://remotive.com/job/1966184/logo","description":"<p dir=\"ltr\"><strong>Sumsub</strong> is the one verification platform to secure the whole user journey. With Sumsub’s customizable KYC, KYB, transaction monitoring and fraud prevention solutions, you can orchestrate your verification process, welcome more customers worldwide, meet compliance requirements, reduce costs and protect your business.<br><br>Sumsub has over 2,500 clients across the fintech, crypto, transportation, trading and gaming industries including Bitpanda, Wirex, Avis, Bybit, Huobi, Kaizen Gaming, and TransferGo.</p>\n<p dir=\"ltr\">Now we are looking for a <strong>Head of Customer Onboarding</strong> who will create a new onboarding flow for our clients and partners.</p>\n<p dir=\"ltr\"><strong>What You Will Be Doing:</strong></p>\n<ul style=\"\">\n<li style=\"\">Building a team and all processes from scratch.</li>\n<li style=\"\">Partnering with the Sales and CSM teams to improve our client’s onboarding flow.</li>\n<li style=\"\">For biggest clients: developing an understanding of the client’s needs and designing customised solutions and trainings that meet their requirements.</li>\n<li style=\"\">Preparing and delivering online product demonstrations emphasising complicated technical sides of the solution.</li>\n<li style=\"\">Creating webinars and video-instructions to introduce Sumsub transaction monitoring/fraud-prevention products and solutions to prospects and clients.</li>\n<li style=\"\">Creating engaging content, addressing all skill levels, and facilitating online/offline training for high profile participants worldwide.</li>\n</ul>\n<p dir=\"ltr\"><strong>About You:</strong></p>\n<ul style=\"\">\n<li style=\"\">Prior relevant experience in the Fintech, Payment solutions and other industries in relation to anti-fraud, transactions and risk management principles and practices.</li>\n<li style=\"\">Demonstrated track record in L&amp;D.</li>\n<li style=\"\">Extensive experience in team management, including coaching and mentoring</li>\n<li style=\"\">Solid planning and organisational skills with the ability to prioritise work and work towards a deadline.</li>\n<li style=\"\">Excellent project management skills, with a proactive and resourceful approach to driving projects forward.</li>\n<li style=\"\">Strong analytical capabilities to establish measurable objectives.</li>\n<li style=\"\">Excellent communication, interpersonal and presentation skills, with the ability to communicate clearly and confidently across different channels and build lasting relationships with internal and external stakeholders.</li>\n<li style=\"\">Proactive approach and ability to thrive in a fast-paced working environment.</li>\n<li style=\"\">Prior experience with budget management is essential.</li>\n</ul>\n<p dir=\"ltr\"><strong>What We Offer:</strong></p>\n<ul style=\"\">\n<li style=\"\">Competitive compensation in compliance with your professional expertise.</li>\n<li style=\"\">Working with a product that matters. Our technology helps to protect millions of users and lots of online services worldwide.</li>\n<li style=\"\">An international project. Our team works from offices in Berlin, Limassol, London, and Miami, our customers are spread from Mexico and the USA to Hong Kong, South Korea, and Singapore.</li>\n<li style=\"\">Remote first company – work from anywhere in the world.</li>\n<li style=\"\">Paid vacation and sick leave.</li>\n</ul>\n<p dir=\"ltr\"><strong>Sounds like a great opportunity for your career development? Then go ahead and apply!</strong></p>\n<p dir=\"ltr\"><em>We are a global community of innovators, creators, and thinkers, and we believe that diversity fuels our innovation. Sumsub is proud to be an equal opportunity employer, committed to building a diverse and inclusive workforce. We welcome applications from people of all backgrounds, cultures, genders, experiences, abilities and perspectives. Join us in shaping the future inclusively.</em></p>\n<img src=\"https://remotive.com/job/track/1966184/blank.gif?source=public_api\" alt=\"\"/>","tags":"[\"team management\"]","pubDate":"2025-01-30T05:51:07.000Z","link":"https://remotive.com/remote-jobs/customer-support/head-of-customer-onboarding-1966184","slug":"head-of-customer-onboarding-sumsub-7078"},{"id":9716685001,"title":"Customer Support Specialist (native or expert Swedish/Norwegian)","company":"Sherpany","image":"https://remotive.com/job/1966185/logo","description":"<p><strong>Sherpany is a mission-led team dedicated to helping to create a world where teams lead together and every meeting counts with its state of the art meeting management tool. Every day, we support thousands of leaders at multinational enterprises and other large organizations in preparing and conducting their most important gatherings. Our work helps teams cooperate and collaborate more effectively, inspire each other and ultimately thrive. And we want to enable more of this.</strong></p>\n<p><strong>Your mission - Bring a smile to our customers face :-)</strong></p>\n<p>As a <strong>Customer Support Specialist</strong> at Sherpany, you will be at the forefront of helping users—ranging from meeting organisers to decision-makers excel in their use of our innovative meeting management solution.</p>\n<p>Through highly-responsive support, proactive training, and impactful problem-solving, you'll empower users to elevate their meeting practices and unlock their potential to do excelent work.</p>\n<p>You'll deliver fast and reliable support to Sherpany users, helping them solve issues and maximize their use of our software. You'll proactively assist users, conduct training sessions, and collaborate with internal teams to improve the customer experience. By managing support cases, maintaining knowledge resources, and staying up to date on the product, you'll ensure users have a seamless and productive experience with Sherpany.</p>\n<p><strong>Your responsibilities: </strong></p>\n<ul style=\"\">\n<li style=\"\">Provide fast and reliable first-line support to Sherpany users, meeting response time targets (&lt;10 seconds for calls, &lt;60 seconds for chats, &lt;10 minutes for emails)</li>\n<li style=\"\">Help users solve their challenges, ensuring they have a smooth experience with our meeting management software.</li>\n<li style=\"\">Run training sessions, webinars, and one-on-one calls to help users get the most out of Sherpany and improve their meeting practices.</li>\n<li style=\"\">Work closely with Sales and Customer Success Managers, sharing insights and responding to requests to improve user satisfaction.</li>\n<li style=\"\">Categorize support cases, identify trends, and report findings</li>\n<li style=\"\">Create and update FAQs, the Support Center, and internal guides to make support more efficient and scalable.</li>\n<li style=\"\">Test new features and updates to keep your product knowledge sharp and ensure accurate support for users.</li>\n<li style=\"\">Help with product translations and review in-app text to ensure language quality, providing “best-effort” translation services when needed.</li>\n<li style=\"\">Cover shifts when team members are on leave to ensure uninterrupted support for our users.</li>\n</ul>\n<p><strong>What we'll love about you:</strong></p>\n<ul style=\"\">\n<li style=\"\">Fluency in <strong>Swedish/Norwegian</strong> and <strong>English</strong> (oral and written) to support a diverse customer base and collaborate with the team.</li>\n<li style=\"\">You are able to quickly learn and understand Sherpany's meeting management software, experience in CRM tools - Salesforce</li>\n<li style=\"\">You are skilled in identifying and resolving technical issues with a logical, solutions-oriented approach.</li>\n<li style=\"\">You're empathic and able to actively listens to user concerns, ensuring a positive and solutions-focused customer experience.</li>\n<li style=\"\">You have strong verbal and written communication skills, with the ability to simplify technical terms for non-technical users.</li>\n<li style=\"\">You thrive in a team environment, contributing to shared goals and supporting colleagues in delivering high-quality service.</li>\n<li style=\"\">You have excellent time management and task prioritisation to ensure all responsibilities are completed efficiently and effectively.</li>\n</ul>\n<p><strong><strong>What you'll love about us: </strong></strong></p>\n<ul style=\"\">\n<li style=\"\">You will be part of an international company with a flat hierarchy where you can take on a lot of personal responsibility and your ideas are always welcome.</li>\n<li style=\"\">Your personal and professional development is important to us, which is why we offer financial support for further education, training, etc.</li>\n<li style=\"\">We value your well-being is important to us - our partner <a href=\"https://nilohealth.com/de/mental-well-being-2/?utm_term=nilo health&amp;utm_campaign=G_dach_de_prs_brd&amp;utm_source=adwords&amp;utm_medium=ppc&amp;hsa_acc=7342711399&amp;hsa_cam=15931598089&amp;hsa_grp=131058998383&amp;hsa_ad=676812425014&amp;hsa_src=g&amp;hsa_tgt=kwd-1597201069819&amp;hsa_kw=nilo health&amp;hsa_mt=e&amp;hsa_net=adwords&amp;hsa_ver=3&amp;gad_source=1&amp;gclid=CjwKCAjwvIWzBhAlEiwAHHWgvXQd1oK6l0xXmd0UbnWKP4W9i0lxmzWCSr8hJs6Sf21iIsM_iS40CxoCyJUQAvD_BwE\" rel=\"nofollow\">nilo.health</a> supports you in this.</li>\n<li style=\"\">We work with new technologies and Apple MacBooks, which will be provided to you when you start.</li>\n<li style=\"\">Last but not least: Our corporate culture means a lot to us, which is why we regularly organize great team events and cultivate a value-oriented cooperation.</li>\n</ul>\n<p><strong>Our recruiting process:</strong></p>\n<ol style=\"\">\n<li style=\"\">Send us your online application </li>\n<li style=\"\">First interview with the Talent Acquisition Specialist </li>\n<li style=\"\">Second interview with Team Leader </li>\n<li style=\"\">Final interview: Show us your skills &amp; Get to know the team </li>\n<li style=\"\">Offer</li>\n</ol>\n<p> </p>\n<p><strong>Milestones for your first 6 months at Sherpany: </strong></p>\n<p><strong>1 month<br></strong></p>\n<ul style=\"\">\n<li style=\"\">At Sherpany, we acknowledge, understand, and believe that everyone learns and progresses at their own pace. While we have a pre-defined onboarding progression to guide you, we are flexible and supportive if you need more time or additional training to feel confident in your role. Your success is our priority, and we're here to ensure you have the resources and encouragement to thrive—no matter your individual timing.\n<ul style=\"\">\n<li style=\"\">Week 1 - Get to know your team and tools</li>\n<li style=\"\">Week 2 - Job Shadowing and knowledge building</li>\n<li style=\"\">Week 3 - Assisted Job execution and support cases</li>\n<li style=\"\">Week 4 - Freestanding job performance and notes for special cases<strong><br></strong></li>\n</ul>\n</li>\n</ul>\n<p><strong>3rd month: </strong></p>\n<ul style=\"\">\n<li style=\"\"><strong>Understand Sherpany and its tools</strong>: Have a beginner-level understanding of the product and be familiar with the customer journey at Sherpany, including the tools and processes used.</li>\n<li style=\"\"><strong>Enable Users Effectively</strong>: Be confident in guiding users through support interactions and enabling them to maximize the value of Sherpany's tools.</li>\n<li style=\"\"><strong>Navigate Resources and Information</strong>: Know where to find the information you need, how to get help from colleagues or resources, and where to contribute by creating or updating knowledge content.</li>\n<li style=\"\"><strong>Be Team-Ready</strong>: Fully integrate into the team, managing your responsibilities and collaborating effectively with colleagues.</li>\n</ul>\n<p><strong>6th month: </strong></p>\n<ul style=\"\">\n<li style=\"\"><strong>Independence</strong>: You confidently handle support requests independently, taking full ownership of your tasks and responsibilities.</li>\n<li style=\"\"><strong>Value Contribution</strong>: You actively add value to the team by sharing insights, solving complex cases, and contributing to knowledge resources.</li>\n<li style=\"\"><strong>KPI Achievement</strong>: Consistently meet or exceed key performance indicators (KPIs) such as First-Time Resolution (FTR) and Customer Satisfaction (CSAT).</li>\n<li style=\"\"><strong>Internal Network</strong>: Build strong relationships across teams, including Customer Success, Product, and other internal departments, to improve collaboration and knowledge sharing.</li>\n<li style=\"\"><strong>User Training</strong>: Begin delivering training sessions to users, helping them maximize their use of Sherpany's tools and improve their meeting practices.</li>\n<li style=\"\"><strong>Internal Team Support</strong>: Actively support internal teams (e.g., Sales, Customer Success) by responding to RFIs, sharing customer insights, and assisting with product-related inquiries.</li>\n<li style=\"\">At the 6-month mark, you will be a fully integrated and high-performing member of the team, contributing to Sherpany's success and the satisfaction of its users.</li>\n</ul>\n<img src=\"https://remotive.com/job/track/1966185/blank.gif?source=public_api\" alt=\"\"/>","tags":"[\"time management\"]","pubDate":"2025-01-29T21:50:24.000Z","link":"https://remotive.com/remote-jobs/customer-support/customer-support-specialist-native-or-expert-swedish-norwegian-1966185","slug":"customer-support-specialist-native-or-expert-swedish-norwegian-sherpany-2637"},{"id":1816077895,"title":"Sales Manager, SMB & Commercial","company":"HappyCo","image":"https://avatars.githubusercontent.com/u/1021150?s=200&v=4","description":"<div><b style=\"font-size: 11pt\">HappyCo is a company where people can grow their careers and work with like minded people, with no egos or politics. HappyCo is values driven and offers a flexible, supportive culture. Join HappyCo and </b><a class=\"postings-link\" href=\"https://happy.co/media/make-work-happy\"><b style=\"font-size: 11pt\">Make Work Happy</b></a><b style=\"font-size: 11pt\">!</b></div><div><br></div><div><span style=\"font-size: 9pt;\">We’re looking for a process-driven and experienced </span><b><span style=\"font-size: 9pt;\">Sales Manager</span></b><span style=\"font-size: 9pt;\"> to join our team.</span></div><div><br></div><div><b style=\"font-size: 9pt;\">The Position</b></div><div><span style=\"font-size: 9pt;\">As the Player-Coach for our SMB and Commercial Sales Division, you’ll play a dual role: actively contributing to sales while mentoring and managing a small team. You will focus on scaling revenue in the owner/operators and fee-managed groups with 500-3,000 units by building scalable, repeatable sales and onboarding processes. You'll leverage offshore contractors, AI, and automation to create efficiency, ensuring customers achieve rapid adoption and success with HappyCo’s product suite.</span></div><div><br></div><div><span style=\"font-size: 9pt;\">We’re looking for a process-driven and experienced </span><b><span style=\"font-size: 9pt;\">Sales Manager</span></b><span style=\"font-size: 9pt;\"> to join our team.</span></div><div><br></div><div><b style=\"font-size: 9pt;\">The Position</b></div><div><span style=\"font-size: 9pt;\">As the Player-Coach for our SMB and Commercial Sales Division, you’ll play a dual role: actively contributing to sales while mentoring and managing a small team. You will focus on scaling revenue in the owner/operators and fee-managed groups with 500-3,000 units by building scalable, repeatable sales and onboarding processes. You'll leverage offshore contractors, AI, and automation to create efficiency, ensuring customers achieve rapid adoption and success with HappyCo’s product suite.</span></div><div><br></div><h3>Key Responsibilities Include:</h3><li><b>Sales Leadership</b></li><li> \tActively engage in selling, prospecting, and closing deals to meet individual and team quotas.</li><li>\tLead and mentor a small team, fostering a culture of high performance and collaboration.</li><div><br></div><li><b>Process Development</b></li><li>\tDesign and implement scalable, repeatable sales processes to convert prospects from unaware to aware.</li><li>\tEstablish streamlined onboarding, training, and ongoing education processes for downstream customers.</li><div><br></div><li><b>Customer Success &amp; Retention</b></li><li>\tAddress customer churn and missed growth opportunities by developing consistent touchpoints and engagement strategies.</li><li>\tCollaborate with internal teams to improve cross-sell opportunities and product adoption.</li><div><br></div><li><b>Operational Efficiency</b></li><li>\tLeverage offshore BDR/SDR resources, AI, and automation to enhance team output and operational scalability.</li><li>\tImprove time-to-value (TTV) for customers, maintaining a TTV benchmark under 30 days.</li><div><br></div><h3>What we think you need to be successful</h3><li><b>Experience</b></li><li>\tMinimum of 7 years in sales, with proven success in leadership positions.</li><li>\tDemonstrated ability to create and implement scalable sales and onboarding processes.</li><div><br></div><li><b>Skills</b></li><li>\tStrong sales acumen with the ability to both sell and mentor.</li><li>\tExpertise in leveraging technology and process to drive efficiency and scalability.</li><li>\tExcellent communication and relationship-building skills.</li><div><br></div><li><b>Mindset</b></li><li>\tVisionary and proactive, with a knack for identifying opportunities and solving downstream customer challenges.</li><li>\tResults-driven, with a focus on measurable outcomes such as reducing churn, increasing product adoption, and growing ARR.</li><div><b style=\"font-size: 11pt\">About HappyCo</b>&nbsp;</div><div>Founded in 2011, HappyCo (<a class=\"postings-link\" href=\"http://happy.co\">happy.co</a>) builds mobile and cloud solutions to enable real-time property data. Our flagship product suite 'Happy Property’ has 3.5M units on its platform and has captured more than 400 million photos.&nbsp;</div><div><br></div><div>We’re everyday people with a shared purpose — improving the lives of others. Our team is made up of thinkers, talkers, planners, makers, builders and everything in between. Together, we’re turning our passions into happier communities!&nbsp;&nbsp;</div><div><br></div><div>When customers use our software, their communities get stronger. Our tools empower everyone in multifamily property management to improve their operations and maximize returns, which means they’re building better experiences for their residents. Learn more about our <a class=\"postings-link\" href=\"https://happyco-inc.wistia.com/medias/1va4woy4m3\">Product Vision</a> here!</div><div><br></div><div><b style=\"font-size: 11pt\">Our HappyCo Culture</b></div><div>HappyCo strives to build better communities. So naturally, we are dedicated to making our own community an enjoyable place that allows us do our best work. We’re devoted to building an inclusive, supportive culture that empowers each HappyCo’er to succeed and grow. To learn more about our culture, check out our <a class=\"postings-link\" href=\"https://happy.co/company/careers\">careers page</a>!&nbsp;</div><div><br></div><div><b>We Offer:</b></div><div>- Work from anywhere supported by a flexible company culture</div><div>- Opportunity to work for one of the fastest growing technology companies in the PropTech industry</div><div>- Unlimited vacation time</div><div>- Generous paid parental leave</div><div>- Competitive and equitable pay, including stock options</div><div>- Monthly stipends to support Wellness and Home Office expenses</div><div><br></div><div>Find out more about our <a class=\"postings-link\" href=\"https://happy.co/company/careers/employee-benefits-usa\">US Employee Benefits</a> here!</div><div><br></div><div><i style=\"font-size: 11pt\">We believe in supporting people to do their best work and thrive, and building a diverse, equitable, and inclusive company is core to our mission. Our goal is to ensure that HappyCo upholds an inclusive environment where all people feel that they are equally respected and valued, whether they are applying for an open position or working at the company. We welcome applicants of any educational background, gender identity and expression, sexual orientation, religion, ethnicity, age, citizenship, socioeconomic status, disability, and veteran status. HappyCo is also committed to providing reasonable accommodations for qualified individuals with disabilities and disabled veterans in our job application procedures.</i></div><div><br></div><div><i style=\"font-size: 11pt\">A note to Recruitment Agencies: Please don’t reach out to us about our roles -- we’ve got it covered. We don’t accept unsolicited agency resumes and HappyCo is not responsible for any fees related to unsolicited resumes.</i></div><div><b style=\"font-size: 11pt\">HappyCo is a company where people can grow their careers and work with like minded people, with no egos or politics. HappyCo is values driven and offers a flexible, supportive culture. Join HappyCo and </b><a href=\"https://happy.co/media/make-work-happy\" class=\"postings-link\"><b style=\"font-size: 11pt\">Make Work Happy</b></a><b style=\"font-size: 11pt\">!</b></div>","tags":"[\"management\"]","pubDate":"2025-01-17T17:46:05.813Z","link":"https://jobs.lever.co/happyco/ecfe021a-5f98-4a98-b2bc-b2df755ce254","slug":"sales-manager-smb-commercial-happyco-597"}]