[{"id":5230890940,"title":"Alliances Field Engineer","company":"Canonical","image":"https://pbs.twimg.com/profile_images/1673959375340290050/x7pNtXQ7_400x400.jpg","description":"\n      <p>Canonical is a leading provider of open source software and operating systems to the global enterprise and technology markets. Our platform, Ubuntu, is very widely used in breakthrough enterprise initiatives such as public cloud, data science, AI, engineering innovation and IoT. Our customers include the world's leading public cloud and silicon providers, and industry leaders in many sectors. The company is a pioneer of global distributed collaboration, with 1000+ colleagues in 70+ countries and very few roles based in offices. Teams meet two to four times yearly in person, in interesting locations around the world, to align on strategy and execution.</p>\n<p>The company is founder led, profitable and growing. We are hiring an <strong>Alliances Field Engineer</strong> to help our biggest partners (companies like Intel, Nvidia, Google, Dell, HP, Accenture, Tata and the like) understand and embrace our open source platform for themselves and their customers.</p>\n<p>Our worldwide field engineering team apply expert insights to real-world customer problems, enabling the enterprise adoption of Ubuntu, OpenStack, Kubernetes, AI/MLOps and a wide range of associated technologies. We are experts in the whole open source stack, from kernel to desktop, from cloud to the edge. Our team is also interested in business problems - building things reliably, efficiently and cost-effectively, and we have to learn to speak the language of our customers and their industries.</p>\n<p>We help global companies embrace public and private cloud infrastructure, cloud native operations, and open source applications. For this team we are looking for several Alliances Engineers to support OEM (hardware manufacturers), GSI (global system integrators), ISV (independent software vendors), Channel partners and Public Cloud alliance partners. You will support various alliances and partners of Canonical to adopt our products and technologies, help business leaders to define joint go-to-market programs with partners from the technical standpoint.</p>\n<p>We often say that our field engineers have 'the hardest job at Canonical' because customers can ask about any aspect of our solutions and products and expect a thoughtful, well-informed answer. We always want to do the best thing for our partners and customers, regardless of our company interests, and field engineers are the people we trust to ensure that is true.</p>\n<p><strong>Location</strong>: This is a home-based role, we are hiring worldwide.</p>\n<h3>What your day will look like</h3>\n<ul>\n<li>Understand Ubuntu, Linux, networking and services in real-world environments</li>\n<li>Architect cloud infrastructure solutions like Kubernetes, Kubeflow, OpenStack, Ceph, and Spark either On-Premises or in Public Cloud (AWS, Azure, Google Cloud)</li>\n<li>Architect and integrate popular open source software such as PostgreSQL, MongoDB, Kafka, Cassandra and NGINX</li>\n<li>Help partners to offer and architect joint solutions utilizing Canonical’s technologies on top of the public clouds and in the data center</li>\n<li>Design and publish joint Reference Architectures and perform technical validations with various partners</li>\n<li>Prepare and run onboarding sessions/workshops with various partners’ teams to promote Canonical products and solutions</li>\n</ul>\n<p>If you have a passion for the latest open source technologies, cloud-native development, data center technologies such as Kubernetes and computer networking, you will love the Alliances Engineer role at Canonical.</p>\n<h3>What we are looking for in you&nbsp;</h3>\n<ul>\n<li>Extensive experience with Linux (Ubuntu preferred), Kubernetes, Ceph, software automation</li>\n<li>Experience designing and implementing solutions on top of public or private clouds</li>\n<li>Python and bash understanding, troubleshooting skills</li>\n<li>Fluent written and spoken English</li>\n<li>Excellent communication and presentation skills</li>\n<li>High motivation, ability to multi-task and follow-up reliably on commitments</li>\n<li>Interest in customer-facing engagement, including pitching, demonstrating and understanding customer environment and needs</li>\n<li>Interest in new technologies like LXD, Juju and Snaps</li>\n<li>Ability to travel globally up to 30% of the time</li>\n<li>Degree in Computer Science, Mathematics, Physics or related technical field experience</li>\n</ul>\n<h3>What we offer you</h3>\n<p>We consider geographical location, experience, and performance in shaping compensation worldwide. We revisit compensation annually (and more often for graduates and associates) to ensure we recognise outstanding performance. In addition to base pay, we offer a performance-driven annual bonus. We provide all team members with additional benefits, which reflect our values and ideals. We balance our programs to meet local needs and ensure fairness globally.</p>\n<ul>\n<li>Distributed work environment with twice-yearly team sprints in person - we’ve been working remotely since 2004!</li>\n<li>Personal learning and development budget of USD 2,000 per year</li>\n<li>Annual compensation review</li>\n<li>Recognition rewards</li>\n<li>Annual holiday leave</li>\n<li>Maternity and paternity leave</li>\n<li>Employee Assistance Programme</li>\n<li>Opportunity to travel to new locations to meet colleagues from your team and others</li>\n<li>Priority Pass for travel and travel upgrades for long haul company events</li>\n</ul>\n<h3>About Canonical</h3>\n<p>Canonical is a pioneering tech firm that is at the forefront of the global move to open source. As the company that publishes Ubuntu, one of the most important open source projects and the platform for AI, IoT and the cloud, we are changing the world on a daily basis. We recruit on a global basis and set a very high standard for people joining the company. We expect excellence - in order to succeed, we need to be the best at what we do.</p>\n<p>Canonical has been a remote-first company since its inception in 2004.​ Work at Canonical is a step into the future, and will challenge you to think differently, work smarter, learn new skills, and raise your game. Canonical provides a unique window into the world of 21st-century digital business.</p>\n<h3>Canonical is an equal opportunity employer</h3>\n<p>We are proud to foster a workplace free from discrimination. Diversity of experience, perspectives, and background create a better work environment and better products. <a href=\"https://canonical.com/careers/diversity/identity\">Whatever your identity, we will give your application fair consideration.</a></p>\n\n<p>#LI-Remote</p>\n\n    ","tags":"[\"postgres\",\"engineering\",\"mongo\",\"aws\"]","pubDate":"2024-03-24 13:14:36.787","link":"https://canonical.com/careers/3433732","savedDate":"2024-03-24 13:14:36.787","slug":"alliances-field-engineer-canonical-1257"},{"id":3601837549,"title":"Account Executive ","company":"SafetyWing","image":"https://pbs.twimg.com/profile_images/1177267684574208000/54eG3WmW_400x400.jpg","description":"<h2>🧘 What we offer</h2> <ul><li><!--block-->Fully remote work environment – work from anywhere globally.&nbsp;</li><li><!--block-->Competitive compensation.</li><li><!--block-->Global coverage with Remote Health and Nomad Insurance.</li><li><!--block-->A minimum of 20 days of compensated time off each year.</li><li><!--block-->Referral bonus - an incentive program rewarding you for helping us find exceptional talent to join our team.</li><li><!--block-->Opportunity to unlock more benefits as your tenure with SafetyWing grows.</li></ul><div><!--block-->We are looking forward to hearing from you!</div><div><!--block--><br></div> <div><!--block--><strong>SafetyWing</strong> (YC W18) is seeking an <strong>Account Executive</strong> to join our team. Your role will be pivotal in understanding the challenges of remote and distributed teams and our prospective client's unique needs and offering them insights and ideas to leverage our solutions effectively. You'll be vital in expanding SafetyWing's impact.</div><div><!--block--><br></div><div><!--block-->We are building a global social safety net, including health and retirement for remote workers worldwide, as a replacement for national welfare systems. If we succeed, we believe this will help ensure freedom and equal opportunity for everyone, and it is one of the more important tasks of our time that no one else is working on.</div> <h2>💻 Your responsibilities will include</h2>  <ul><li><!--block-->Getting to the heart of remote and geographically distributed teams' needs through helpful insights and consultative selling.</li><li><!--block-->Navigating the full sales cycle, from discovery and engagement to negotiation and closure.</li><li><!--block-->Using a consultative approach to pinpoint customer needs, crafting value-added propositions, and developing complex proposals.</li><li><!--block-->Creating pathways within major accounts and initiating meaningful relationships.</li><li><!--block-->Guiding our customers to see the optimal value in our solutions, building consensus and enthusiasm.</li><li><!--block-->Proactively finding ways to tackle any deal-related obstacles.</li><li><!--block-->Keeping our CRM updated with the latest client info for top-notch planning and strategy.</li><li><!--block-->Gathering and integrating product feedback from clients to guide product enhancements.</li></ul> <h2>🧪 We are looking for someone who</h2> <ul><li><!--block-->Has a solid background in B2B sales, demonstrating a track record of success in navigating complex sales cycles.</li><li><!--block-->Is a skilled closer, proficient in overcoming objections and securing client commitments.</li><li><!--block-->Can think on their feet, plan strategically and thrives in a fast-moving startup environment.</li><li><!--block-->Has excellent communication skills in English, both verbal and written.</li><li><!--block-->Is tech-savvy and comfortable with Google Workspace, CRM software, and marketing automation tools.</li><li><!--block-->Is a continual learner, detailed, planning pro, and autonomous worker.</li><li><!--block-->Extra shine if you know the HR landscape and have experience selling to HR buyers.</li></ul><div><!--block--><strong>😀 We like to work with people who:</strong></div><ul><li><!--block-->Want to help build a global social safety net on the Internet.</li><li><!--block-->Think for themselves instead of copying others.</li><li><!--block-->Are willing to try new things, even with the risk of failure.</li><li><!--block-->Are intellectually curious and open to new ideas.</li><li><!--block-->Are creative and bold in the face of any problems.</li><li><!--block-->Have strong integrity and do the right thing.</li></ul><div><!--block--><br></div>","tags":"[\"B2B\"]","pubDate":"2024-03-24 13:14:36.786","link":"https://safetywing.pinpointhq.com/en/jobs/182470","savedDate":"2024-03-24 13:14:36.786","slug":"account-executive-safetywing-9599"},{"id":8525331129,"title":"Customer Support Representative","company":"MixRank","image":"https://pbs.twimg.com/profile_images/378800000147745937/0fac42c12b433bbbd53ff3e15cd6fca4_400x400.png","description":"<p>About the Role: Technical Support Executive</p>\n<p>As a pivotal connector between MixRank and our esteemed enterprise clientele, the Technical Support Executive will manage day-to-day interactions with our key accounts. This role involves handling all customer inquiries, proactive communication regarding new products, updates, bug fixes, and more. Additionally, the Technical Support Executive will collaborate closely with Account Executives to identify opportunities for upsells and cross-sells, besides managing ongoing renewals for our enterprise customers.</p>\n<p>This role is entirely remote, requiring availability during PST work hours.</p>\n<p>Key Responsibilities:</p>\n<p>Facilitate customer onboarding and maintain a comprehensive knowledge base.\nUtilize SQL queries to address common customer inquiries effectively.\nGain expertise in client use cases, database configurations, and more.\nServe as the primary MixRank contact for customer escalations and communications.\nDevelop customer health scores to aid the sales team in renewal forecasts and other sales-related activities.</p>\n<p>Qualifications:</p>\n<p>Outstanding communication skills, both written and oral.\nProficiency in SQL and a solid understanding of database systems.\nProven ability to manage client escalations and serve as the main point of contact for communications.\nExperience in project management, with the ability to allocate engineering resources efficiently and prioritize requests and bug fixes.\nAn innate ability to learn independently and a strong sense of responsibility.</p>\n<p>Why work at MixRank</p>\n<p>MixRank is a data intelligence platform that's backed by YCombinator, 500 Startups, Mark Cuban, and other Silicon Valley investors. Founded in 2011, we started off crawling websites and apps trying to decode tech stacks and what tools/products companies use.\nFast-forward to today, we're now among the top data providers in the world. Our ultra-high frequency datasets make their way into Fortune 500 companies, leading sales intelligence platforms &amp; recruitment solutions, venture capital, private equity and public market firms.\nOur customers are highly data-driven, and are experts at handling billions of records of data. We help provide a world-class data experience, and help our customers focus on their customer experience and outcomes, while we focus on ensuring instant and constant access to high quality, highly refreshed data.\nWe've been a 100% globally distributed company since 2018, spanning 14+ countries. We've been growing consistently 50% year over year the last 5 years. We're not a rocketship nor are we building things at hyperscale. Our focus is on making sure we're doing what's best by our customers, investors, and employees, while building a long-lasting business that teammates that join us would consider investing their life's work into.\nWe offer competitive salaries and remote work benefits, prefer asynchronous communication, and offer a healthy work culture.</p>\n","tags":"[\"management\",\"engineering\",\"database\"]","pubDate":"2024-03-24 13:14:36.786","link":"https://www.ycombinator.com/companies/mixrank/jobs/SG0hpTt-customer-support-representative","savedDate":"2024-03-24 13:14:36.786","slug":"customer-support-representative-mixrank-5773"},{"id":9941356968,"title":"Infrastructure Engineer (Blockchain)","company":"Status","image":"https://pbs.twimg.com/profile_images/966759182589308928/s5rZXoWk_400x400.jpg","description":"\n    <div class=\"content-intro\"><p style=\"text-align: justify;\"><strong>About Status</strong></p>\n<p style=\"text-align: justify;\"><span style=\"font-weight: 400;\">Status is building the tools and infrastructure for the advancement of a secure, private, and open web3.&nbsp;</span></p>\n<p style=\"text-align: justify;\"><span style=\"font-weight: 400;\">With the high level goals of preserving the right to privacy, mitigating the risk of censorship, and promoting economic trade in a transparent, open manner, Status is building a community where anyone is welcome to join and contribute.</span></p>\n<p style=\"text-align: justify;\"><span style=\"font-weight: 400;\">As an organization, Status seeks to push the web3 ecosystem forward through research, creation of developer tools, and support of the open source community.&nbsp;</span></p>\n<p style=\"text-align: justify;\"><span style=\"font-weight: 400;\">As a product, Status is an open source, Ethereum-based app that gives users the power to chat, transact, and access a revolutionary world of DApps on the decentralized web. But Status is also building foundational infrastructure for the whole Ethereum ecosystem, including the Nimbus ETH 1.0 and 2.0 clients, the Keycard hardware wallet, and the Waku messaging protocol; the p2p communication layer for Web3.</span></p>\n<p style=\"text-align: justify;\"><span style=\"font-weight: 400;\">As a team, Status has been completely distributed since inception.&nbsp; Our team is currently 200+ core contributors strong, and welcomes a growing number of community members from all walks of life, scattered all around the globe.&nbsp;</span></p>\n<p style=\"text-align: justify;\"><span style=\"font-weight: 400;\">We care deeply about open source, and our organizational structure has minimal hierarchy and no fixed work hours. We believe in working with a high degree of autonomy while supporting the organization's priorities.</span></p></div>\n\n    <div class=\"careers-block__trix external-panel text-left\">\n<p></p>\n<p><strong>The role</strong></p>\n<p>DevOps is a buzzword, but it's also generic enough to encompass the breadth of tasks required in supporting development teams. There are many ways to make the lives of developers easier, and everyone has their own best way, which also means every team has their own way. There is no perfect way to make everyone happy with the same thing.</p>\n<p>Supporting developers involves debugging obscure bash scripts from years ago that nobody remembers. It means biting on a piece of wood and using data formats turned programming languages like YAML to configure CI jobs. It means tracking down minute differences between releases of packages and libraries causing unexpected crashes. It means rewriting the same Dockerfile for the 5th time to allow a project to use one more obscure library. Or tracking down absurd race conditions of multi-threaded tests running in parallel on the same host. Or pulling your hair out at a bug only to realize it works fine after the CI worker host is restarted.</p>\n<p>But fundamentally it means wrestling it all into submission and making it run smoothly... at least for as long as you're there.</p>\n<p>If you have the guts to fight against entropy and deterioration of the reality we inhabit, then you just might also be crazy enough to enjoy the struggle while it lasts, and appreciate the eventual fruits of our labour, if you value privacy, freedom, and transparency. You might even make some money, and learn a bit from all the exceptional engineers working here.</p>\n<p>&nbsp;</p>\n<p><strong>Who you are</strong></p>\n<p>You have strong Linux Fundamentals:</p>\n<ul>\n<li>Distros and package managers</li>\n<li>Good understanding of process management</li>\n</ul>\n<p>You have programming experience:</p>\n<ul>\n<li>At least a few languages and showing the ability to learn</li>\n<li>Bash as a minimum; Python would be helpful&nbsp;</li>\n</ul>\n<p>You have experience in Continuous Integration:</p>\n<ul>\n<li>Jenkins CI - Pipelines are written in Groovy</li>\n<li>GitHub Actions - PR builds, mostly</li>\n</ul>\n<p>You have experience in Security:</p>\n<ul>\n<li>Good understanding of OpenSSH</li>\n<li>GnuPG for encryption of secrets and backups</li>\n</ul>\n<p><span class=\"hljs-strong\">Distributed Systems:</span></p>\n<ul>\n<li>Experience running Ethereum nodes</li>\n<li>Knowledge of Layer 2 scaling solutions</li>\n</ul>\n<p>&nbsp;</p>\n<p><strong>Compensation</strong></p>\n<p>We are happy to pay in any mix of fiat/crypto.</p>\n<p>&nbsp;</p>\n<p><strong>Hiring process</strong></p>\n<ol>\n<li>Interview with the&nbsp;Talent team</li>\n<li>Paid task</li>\n<li>Technical interview with Head of Infra</li>\n</ol>\n<p><em>[The</em>&nbsp;<em>steps may change along the way if we see it makes sense to adapt the interview stages, so please consider the above as a guideline]</em></p>\n<p></p>\n<p>&nbsp;</p>\n</div>\n\n    \n\n    \n","tags":"[\"management\"]","pubDate":"2024-03-24 13:14:36.786","link":"https://boards.greenhouse.io/embed/job_app?for=status72&token=5831029&b=https%3A%2F%2Fjobs.status.im%2F","savedDate":"2024-03-24 13:14:36.786","slug":"infrastructure-engineer-blockchain-status-386"},{"id":2274627297,"title":"Social Manager","company":"Optimismunlimited","image":"https://remotive.com/job/1902150/logo","description":"<div class='\"content-intro\"'>\n<p><strong>About the Optimism Collective and Optimism Unlimited</strong></p>\n<p>The Optimism Collective is redefining power to elevate humanity by building a more equitable internet. Our vision for this citizen-governed network: a composable, unified constellation of blockchains that can support internet-level activity; powered by the MIT-licensed open source OP Stack.</p>\n<p>To date, the Optimism Collective is defined by its focus on scaling Ethereum and funding public goods. We’ve processed hundreds of millions of transactions and are responsible for the largest ongoing <a href=\"%22https:/optimism.mirror.xyz/37Bgum6MfTJWDuE41CH9RXSH5KBm_RCL5zsSFeRZl4E%22\" rel=\"nofollow\">public goods funding program</a> in existence.</p>\n<p>Optimism Unlimited is a subsidiary of the Optimism Foundation that focuses on supporting the growth, adoption, and governance of the Optimism Collective.</p>\n</div>\n<p>Optimism Unlimited is looking for a Social Manager! Reporting to the Head of Marketing, the Social Manager is a vital role within the Optimism ecosystem, responsible for overseeing and elevating all social media channels. As the Social Manager, you will be at the forefront of shaping the organization’s online presence, driving engagement and growth through innovative and culturally relevant social media strategies.</p>\n<div class=\"h3\"><strong>What are the role responsibilities?</strong></div>\n<ul style=\"\">\n<li style=\"\">Develop and implement innovative social media strategies that resonate with the web3 community, driving increased engagement, follower growth, and brand visibility.</li>\n<li style=\"\">Create and curate engaging content that leverages memes, niche humor, and other relevant trends to connect with the blockchain and cryptocurrency communities.</li>\n<li style=\"\">Manage all social media channels, ensuring consistent messaging, tone, and brand voice that aligns with Optimism’s marketing goals.</li>\n<li style=\"\">Collaborate with external agencies to produce compelling visual content, enhancing the storytelling aspect of social media campaigns.</li>\n<li style=\"\">Analyze social media metrics to gauge the success of campaigns, adjusting strategies as needed to optimize engagement and reach.</li>\n<li style=\"\">Stay up-to-date with the latest trends in social media, web3 culture, and meme-driven communication to keep Optimism’s social presence fresh and relevant.</li>\n<li style=\"\">Work closely with the marketing team to align social media strategies with broader marketing initiatives and campaigns.</li>\n</ul>\n<div class=\"h3\"><strong>What skills do you bring?</strong></div>\n<ul style=\"\">\n<li style=\"\">Deep understanding of vibes, web3 community niche humor, and the dynamics of digital engagement. </li>\n<li style=\"\">Ability to significantly increase followers, likes, and engagement across various platforms in crypto.</li>\n<li style=\"\">Fluency in the communities surrounding Optimism to best represent and storytelling on behalf of the Optimism Collective.</li>\n<li style=\"\">Proven experience as a Social Media Manager or similar role, with a strong portfolio demonstrating success in growing and engaging online communities, especially in tech or blockchain.</li>\n<li style=\"\">Excellent understanding of social media platforms, trends, and analytics, with a specific focus on the web3 and blockchain community.</li>\n<li style=\"\">Strong creative skills, with the ability to produce and curate content that is both engaging and aligned with the brand's voice.</li>\n<li style=\"\">Experience working with creative agencies or teams to develop visual content.</li>\n<li style=\"\">Exceptional communication and collaboration skills.</li>\n</ul>\n<div class=\"h3\"><strong>Nice to haves</strong></div>\n<ul style=\"\">\n<li style=\"\">Familiarity with Ethereum’s infrastructure, decentralized technologies, and the broader blockchain ecosystem.</li>\n<li style=\"\">Experience in a startup or technology company, particularly within a fast-growing environment.</li>\n<li style=\"\">A knack for understanding and leveraging web3 and meme culture to create viral content.</li>\n</ul>\n<div class='\"content-conclusion\"'>\n<div class=\"h3\">What you'll like about us:</div>\n<ul style=\"\">\n<li style=\"\">We take pride in the accomplishments of our teammates and support each other in doing the best work of our careers.</li>\n<li style=\"\">Our team is a diverse group of people from a variety of backgrounds and interests. We cherish our eclecticism and consider it a great strength.</li>\n<li style=\"\">We have a transparent, feedback-driven and fun-centric culture.</li>\n<li style=\"\">We are a team of builders—our founding team has been working on Ethereum scalability since 2015.</li>\n</ul>\n<p><strong>We strongly encourage candidates of all different backgrounds to apply.</strong> We believe that our work is stronger with a variety of perspectives, and we’re eager to further diversify our company. If you have a background that you feel would make an impact at Optimism, please consider applying. We’re committed to building an inclusive, supportive place for you to do the best work of your career.</p>\n</div>\n<img src=\"https://remotive.com/job/track/1902150/blank.gif?source=public_api\" alt=\"\"/>","tags":"[\"crypto\",\"social media\",\"open source\",\"blockchain\",\"analytics\",\"Ethereum\",\"startup\",\"infrastructure\"]","pubDate":"2024-03-23 07:20:18.000","link":"https://remotive.com/remote-jobs/marketing/social-manager-1902150","savedDate":"2024-03-24 13:14:36.783","slug":"social-manager-optimismunlimited-4976"},{"id":3624802189,"title":"Senior Prenatal Specialist","company":"BillionToOne","image":"https://remotive.com/job/1902157/logo","description":"<p><strong>Do you want to join one of the fastest-growing molecular diagnostics companies to help transform prenatal and oncology diagnostics that can affect millions of patient lives?</strong></p>\n<p><strong>BillionToOne</strong>, ranked at the top 5% of Y Combinator companies with $300M+ in funding from prominent VC firms, has developed a DNA molecular counter that increases cfDNA diagnostic resolution by over 1,000 fold. BillionToOne's first product, UNITY™ is the first and only non-invasive prenatal test that can directly screen an unborn baby’s own risk for common and severe recessive genetic disorders and chromosomal abnormalities, as well as fetal sex and fetal antigens, from a single tube of blood from the pregnant mother, without paternal testing.</p>\n<p>In 2023, BillionToOne launched two liquid biopsy products that will markedly improve oncology treatment and care. With Northstar Select™, clinicians can select cancer therapies that will be most effective to each patient based on their individual genetic makeup. Northstar Response™ will enable clinicians to monitor a patient’s early response to these cancer therapies, by measuring minute changes in their ctDNA, which can reduce ineffective treatments and unwanted toxicity, lower costs, and substantially improve clinical outcomes.</p>\n<p>The <strong>Senior Prenatal Specialist </strong>is a seasoned prenatal sales executive, who will bring the first and only single-gene NIPT supported carrier and aneuploidy screen to OBGYN clinics &amp; MFM practices. You will provide clinical information to external accounts throughout your territory and internal teams. You will have significant influence over how the test is communicated to physicians and patients, and how it should evolve to better serve market needs. This is a remote position and reports to a Regional Manager - Prenatal.</p>\n<p><strong>Responsibilities:</strong></p>\n<ul style=\"\">\n<li style=\"\">Create and implement a strategic, data-driven business plan to build out the territory and grow revenue quickly</li>\n<li style=\"\">Drive market adoption, sales, and territory growth through direct sales to individual OBGYNs, MFMs, and Genetic Counselors.</li>\n<li style=\"\">Prospect and cultivate new business, and actively maintain existing relationships.</li>\n</ul>\n<p><strong>Requirements</strong>:</p>\n<ul style=\"\">\n<li style=\"\">Minimum three (3) years of Women's Health sales experience at a <strong>genetics or molecular diagnostics</strong> company in this territory; must have existing relationships with OBGYNs, MFMs, GCs, etc. and convertible business </li>\n<li style=\"\">Will consider Women’s Health medical device sales experience if all other requirements are met and there is strong convertible business</li>\n<li style=\"\">Proven track record of sales success (eg. National award winning - President Club or equivalent required); if company does not have national sales awards, must have comparable performance (ie. top 10% of salesforce nationally; strong demonstrated growth in sales volume and territory)</li>\n<li style=\"\">Solid negotiation skills, understanding of buyer/decision maker types, exhibit effective selling, listening, presentation skills, and ability to assess and respond to customer needs</li>\n<li style=\"\">Effective time management skills required with a demonstrated ability to assess and prioritize opportunity required</li>\n<li style=\"\">Must act with a sense of urgency, with a focus on closing and pulling through business</li>\n<li style=\"\">Ability to assess the needs of medical professionals and staff members with a focus on consultative sales, coordination of logistics, and problem solving</li>\n<li style=\"\">Strong desire to work in a startup environment and must work independently with an internal drive to be successful</li>\n</ul>\n<p><strong>Nice-to-Haves: </strong></p>\n<ul style=\"\">\n<li style=\"\">Experience in a start-up environment</li>\n<li style=\"\">Clinical laboratory experience</li>\n<li style=\"\">Prior field training experience</li>\n</ul>\n<p><strong>Benefits And Perks:</strong></p>\n<ul style=\"\">\n<li style=\"\">Working with a team of ‘rockstars’ who bring out the best in everyone</li>\n<li style=\"\">Open, transparent culture that includes weekly Town Hall meetings</li>\n<li style=\"\">The ability to indirectly or directly change the lives of hundreds of thousand patients</li>\n<li style=\"\">Multiple medical benefit options; employee premiums paid 100% of select plans, dependents covered at 80%</li>\n<li style=\"\">Extremely generous Family Bonding Leave for new parents (16 weeks, paid at 100%)</li>\n<li style=\"\">Retirement savings program including a 4% Company match</li>\n<li style=\"\">Free daily on-site lunches provided from top eateries</li>\n<li style=\"\">Latest and greatest hardware (laptop, lab equipment, facilities)</li>\n<li style=\"\">A variety of perks on campus (state of the art gym, restaurant)</li>\n<li style=\"\">Free on-site EV charging (compatible with all EVs, including Tesla)</li>\n</ul>\n<p>At BillionToOne, we are proud to offer a combination of a (1) base pay (2) generous equity options offering, on top of (3) industry leading company benefits (free healthcare options, 401k match, very generous fully paid parental leave etc.</p>\n<p>This position offers an annual compensation package, which includes a base pay of $140,000 in combination with <strong><em>uncapped</em></strong> quarterly sales commissions.</p>\n<p><em>BillionToOne is an equal opportunity employer. We do not discriminate on the basis of race, religion, color, national origin, gender, sexual orientation, age, marital status, veteran status, or disability status.</em></p><img src=\"https://remotive.com/job/track/1902157/blank.gif?source=public_api\" alt=\"\"/>","tags":"[\"salesforce\",\"unity\",\"healthcare\",\"hardware\",\"SOLID\",\"startup\",\"direct sales\",\"testing\",\"time management\"]","pubDate":"2024-03-23 01:20:49.000","link":"https://remotive.com/remote-jobs/sales-business/senior-prenatal-specialist-1902157","savedDate":"2024-03-24 13:14:36.784","slug":"senior-prenatal-specialist-billiontoone-3125"},{"id":7418414695,"title":"Customer Support Coordinator","company":"Jabra Hearing","image":"https://remotive.com/job/1901982/logo","description":"<div class='\"content-intro\"'><p><strong>Hi, we’re Jabra Hearing. </strong></p>\n<p>We’re on a mission to empower tens of millions of people to hear better through convenient, personalized hearing care — at a fraction of the cost thanks to telemedicine. In three years, we went from a scrappy startup to a leader in the direct-to-consumer hearing care space with the backing of our parent company GN, a global pioneer in intelligent audio solutions, to prove it. We partnered with Jabra (also in the GN Family) to create the Jabra Enhance online hearing business. Leveraging GN's expertise and Jabra's pioneering audio engineering helps us make our hearing care even more accessible and affordable.</p>\n<p><strong>About us.</strong></p>\n<p>We’re a data-thirsty, outcomes-driven group that cares as deeply about our employees as we do our customers. We’re led by a diverse crew of enormously talented thinkers, creators, and doers who are as collaborative as they are compassionate (and passionate). The team at Jabra Hearing includes actors, sommeliers, top-chefs, dancers, black belts, filmmakers and countless four-legged furry sidekicks. </p></div><p><strong>About the role.</strong></p>\n<p>As a remote <strong>Customer Support Coordinator</strong> at Jabra Hearing, you’ll play a pivotal role in our mission to empower people with hearing loss to connect with their world. You will provide efficient and friendly assistance to our customers in an omnichannel support environment, with a heavy focus on phone calls while also responding to emails, customer tasks, live chats, and other channels. Serving as a representative of our best-in-class customer care team, you'll triage support channels, handle administrative tasks, and ensure seamless coordination with other teams by utilizing multiple software systems. The Customer Support Coordinator reports directly to a Customer Experience Manager on a full-time basis.</p>\n<p><strong>What you’ll do.</strong></p>\n<ul style=\"\">\n<li style=\"\">Complete inbound work in an omnichannel support environment, with a focus on phone calls but also including emails, customer tasks, live chats, and other channels</li>\n<li style=\"\">Independently complete administrative tasks according to standard operating procedures including </li>\n<ul style=\"\">\n<li style=\"\">Scheduling and rescheduling customer appointments;</li>\n<li style=\"\">Processing order cancellations, returns, and warranties;</li>\n<li style=\"\">Providing customers with shipping and order statuses; and</li>\n<li style=\"\">Placing orders for additional supplies</li>\n</ul>\n<li style=\"\">Develop and maintain a working knowledge of our products to provide Level 1 Product Support information to customers</li>\n<li style=\"\">Properly address and route customers’ support needs, including complaints, leveraging a proficient and current understanding of Jabra Hearing services</li>\n<li style=\"\">Contribute to a larger team; meet department performance KPIs and productivity benchmarks, and adhere to expectations regarding time and attendance</li>\n<li style=\"\">Ensure our customers’ privacy and security; follow policies and procedures related to customer verification, data security and other compliance requirements.</li>\n<li style=\"\">Act as an ambassador of the Jabra Hearing culture by embodying our values in each internal and external interaction </li>\n</ul>\n<p><strong>What you’ll bring.</strong></p>\n<ul style=\"\">\n<li style=\"\">1+ years of previous experience working in a high-volume call center environment or providing remote (phone/video) customer support</li>\n<li style=\"\">Strong written and verbal communication skills, delivered with a friendly and professional tone</li>\n<li style=\"\">Demonstrated ability to effectively de-escalate and preempt frustration in customer interactions, fostering positive experiences and resolutions</li>\n<li style=\"\">Intermediate to advanced computer skill proficiency and familiarity working with support software; Salesforce experience a plus</li>\n<li style=\"\">Comfort working independently and efficiently in a fast-paced, high-touch support environment</li>\n<li style=\"\">Strong written and verbal communication skills; ability to read, write, speak, and comprehend English effectively to assist customers via phone, video call, cases, real-time chats, and emails; proficiency in Spanish is preferred </li>\n<li style=\"\">Ability to work one of the following schedules. Please indicate your 1st and 2nd preference within your application.<br><br></li>\n<ul style=\"\">\n<li style=\"\"><strong>A</strong>: Sunday: 10am - 6pm (ET), Mon, Tue, Thu, Fri: 8am - 4pm (ET); OFF: Wednesday &amp; Saturday</li>\n<li style=\"\"><strong>B</strong>: Saturday: 10am - 6pm (ET); Mon, Tue, Wed, Fri: 8am - 4pm (ET); OFF: Sunday &amp; Thursday</li>\n<li style=\"\"><strong>C</strong>: Saturday &amp; Sunday: 10am - 6pm (ET), Mon, Tue, Fri: 8am - 4pm (ET); OFF Wednesday &amp; Thursday</li>\n<li style=\"\"><strong>D</strong>: Monday - Friday: 8am - 4pm (ET); OFF Saturday &amp; Sunday</li>\n</ul>\n</ul>\n<p><strong>A sneak peek at our benefits.</strong></p>\n<ul style=\"\">\n<li style=\"\"><strong>You’re worth it. </strong>Our compensation is competitive ($20.00 to $24.00 per hour), and our 401k plan includes a 4% match.</li>\n<li style=\"\"><strong>Take care of yourself and your loved ones. </strong>We offer excellent medical, vision, and dental insurance and contribute generously to it. Adding a new member to your family? We also provide 12-weeks paid parental leave.</li>\n<li style=\"\"><strong>Fill that well! </strong>Whether you check out America’s natural treasures or just veg out on your couch, enjoy your paid time off. We <em>encourage</em> time off.</li>\n<li style=\"\"><strong>Be well! </strong>Jabra Hearing offers a monthly wellness stipend to support you in prioritizing self-care - covering anything from gym memberships and fitness equipment to vitamins and spa visits.</li>\n</ul><div class='\"content-conclusion\"'><p>GN Consumer Hearing Corporation dba Jabra Hearing is an equal opportunity employer and<a href=\"%22https://e-verify.uscis.gov/web/media/resourcesContents/E-Verify_Participation_Poster.pdf%22\" rel=\"nofollow\"> participates in E-Verify.</a> If you receive an offer of employment from Jabra Hearing, you will need to go through the E-Verify process of digital verification of your employment authorization documents as provided on the Form I-9. Participation in<a href=\"%22https://www.e-verify.gov/sites/default/files/everify/posters/IER_RighttoWorkPoster.pdf%22\" rel=\"nofollow\"> E-Verify does not limit your right to work</a> and verification will only be completed after you become an employee with Jabra Hearing.</p>\n<p>#LI-Remote</p></div><img src=\"https://remotive.com/job/track/1901982/blank.gif?source=public_api\" alt=\"\"/>","tags":"[\"C\",\"DBA\",\"go\",\"salesforce\",\"security\",\"video\",\"startup\",\"product support\",\"data security\",\"software systems\",\"insurance\"]","pubDate":"2024-03-23 01:20:28.000","link":"https://remotive.com/remote-jobs/customer-support/customer-support-coordinator-1901982","savedDate":"2024-03-24 13:14:36.784","slug":"customer-support-coordinator-jabra-hearing-2648"},{"id":6963242138,"title":"Senior Product Manager","company":"Airalo","image":"https://lever-client-logos.s3.us-west-2.amazonaws.com/55028a36-609c-479c-9553-d4689ff2dd8c-1669620566663.png","description":"<div><b>About Airalo</b></div><div>Alo! Airalo is the world’s first eSIM store that helps people connect in over 200+ countries and regions across the globe. We are building the next digital service that revolutionizes the telecom industry. We are a travel-tech company and an equal-opportunity environment that values and executes diversity, inclusion, and equity. Our team is spread across 50+ countries and six continents. What glues us together is our commitment to changing the way you connect<span style=\"font-size: 13.3333px\">. </span></div><div><br></div><div><b>About you</b></div><div>We hope that you care deeply about the quality of your work, the intrinsic worth of tasks, and the success of your team. You are self-disciplined and do not require micromanagement in terms of your skillset and work ethic. You do your best to flourish as an individual every day while working hard to foster a collaborative team environment. You believe in the importance of being — and staying — authentic, honest, positive, and kind. You are a good interlocutor with clear and concise communication. You are able to manage multiple projects, have an analytical mind, pay keen attention to detail, and love to get your hands dirty. You are cognizant, tolerant, and welcoming of vulnerabilities and cultural differences.</div><div><br></div><div><b>About the Role</b></div><div><b>Position</b>: Full-time / Employee</div><div><b>Location:</b>&nbsp;Remote-first </div><div><b>Benefits:</b>&nbsp;Health Insurance, work-from-anywhere stipend, annual wellness &amp; learning credits, annual all-expenses-paid company retreat in a gorgeous destination &amp; other benefits</div><div><br></div><div>As a Senior Product Manager, you will drive the strategy and execution of our product roadmap, focusing on delivering an unparalleled user experience to international travelers. Your role will be crucial in identifying and responding to the dynamic needs of our users, leading the charge in the development and implementation of innovative features. By orchestrating cross-functional teams, you will ensure the successful development, launch, and growth of our products, making every journey more seamless and connected.</div><div><br></div><div>To successfully accomplish this, you will partner closely with Engineering, Research, Design, Support, and Growth teams.</div><div>You are curious, humble and take pride in seeing others succeed as a result of your support and leadership. You are an excellent collaborator, with cross-discipline experience working to successfully deploy products and work streams.</div><div><br></div><h3>Responsibilities include but are not limited to:</h3><li>Work closely with the Director of Product and other team members in the department</li><li>Define, analyze and optimise the KPIs to grow your Product area while measuring impact and reporting on progress</li><li>Apply product management best practices incorporating working backwards, thorough product discovery and data insights to have a strong understanding of our users and identify new product opportunities</li><li>Own, prioritise and manage a backlog with clear Product Requirements Documents while ensuring successful and high quality product delivery</li><li>Work closely with&nbsp;Engineering, Product, Support, Growth and other departments to gather insights from our users and suggest improvements</li><li>Understand the needs of users and convert them into requirements for the engineering team</li><li>Ensure that the development team has a clear understanding of the product vision, goals, and priorities</li><li>Manage and mentor a designer within the product team, ensuring that design efforts align closely with product strategies and user experience goals, fostering collaboration between design and product development processes.</li>,<h3>Must-haves:</h3><li>5+ years of building world-class products as a Product Manager or Product Owner or relevant experience</li><li>Experience in defining, building, and shipping complex, technical products</li><li>Experience in collaborating with and designers, engineers, Q/A in an agile environment</li><li>Experience in creating and iterating product roadmaps</li><li>Experience in facilitating technical discussions about products and features and providing feedback for technical designs</li><li>Strong analytical and problem-solving skills and data-driven decision-making</li><li>Extraordinary attention to detail by thinking the beauty is hidden in them</li><li>Proven experience in user-centered design and research, with the ability to understand user needs and design products to meet those needs</li><li>Experience in Lean process as well as experience with agile/scrum methodology</li><li>Excellent verbal and written communication skills</li>,<h3>Good-to-have:</h3><li>Product experience in e-commerce, marketplace platforms, and mobile applications</li><li>Experience with Jira, Figma, QuickSight, Tableau, Dovetail, Google Analytics, Hotjar</li><li>Prior work experience in telecommunications</li><li>Knowledge of eSIM and GSMA-related technologies and services</li><div>If you are interested in this position, <b>please apply via the link.</b></div><div><br></div><div><i>We sincerely thank all applicants in advance for submitting their interest in this opportunity with Airalo. </i></div>","tags":"[\"management\",\"engineering\"]","pubDate":"2024-03-22 13:03:06.843","link":"https://jobs.lever.co/airalo/c4f1af72-0f6b-4d1c-9ccf-9a361d25174c","savedDate":"2024-03-24 13:14:36.792","slug":"senior-product-manager-airalo-3890"},{"id":3478507014,"title":"Analytics Engineer - Finance","company":"Equipmentsharecom","image":"https://remotive.com/job/1901746/logo","description":"<div class=\"h2\">EquipmentShare is Hiring an Analytics Engineer - Finance</div>\n<p>If you’re an analytics engineer with a deep passion for data, EquipmentShare could be the perfect place for you. With a fast-paced, fast-growing company environment, the opportunity for professional growth and development is unparalleled. At EquipmentShare we have a strong belief and support in supporting the business with data; as a result, processes and models you build will drive real impact on analytics across the company.</p>\n<div class=\"h3\"><strong>Primary Responsibilities</strong></div>\n<ul style=\"\">\n<li style=\"\">Translate between financial and accounting concepts and data</li>\n<li style=\"\">Build and maintain data models quickly, refining over time to get production models</li>\n<li style=\"\">Reduce tribal complexity of querying financial/accounting data</li>\n<li style=\"\">Develop pipelines and testing automation to ensure financial data quality and integrity</li>\n<li style=\"\">Strong owner in developing business-centric data models with minimal guidance and comfort deriving answers from ambiguity</li>\n<li style=\"\">Codify business rules into data models/testing</li>\n</ul>\n<div class=\"h3\"><strong>Why We're a Better Place to Work </strong></div>\n<ul style=\"\">\n<li style=\"\">Competitive salary.</li>\n<li style=\"\">Medical, Dental and Vision coverage for full-time employees.</li>\n<li style=\"\">401(k) and company match.</li>\n<li style=\"\">Generous paid time off (PTO) plus company paid holidays.</li>\n<li style=\"\">Stocked breakroom and full kitchen, chef prepared meals daily (breakfast and lunch).</li>\n<li style=\"\">State of the art onsite gym (Corporate HQ) with instructor led-courses/Gym stipend for remote employees.</li>\n<li style=\"\">Seasonal and year round wellness challenges.</li>\n<li style=\"\">Company sponsored events (annual family gatherings, happy hours and more).</li>\n<li style=\"\">Volunteering and local charity initiatives that help you nurture and grow the communities you call home. Employees receive 16 hours of paid volunteer time per year. </li>\n<li style=\"\">Opportunities for career and professional development with conferences, events, seminars and continued education. </li>\n</ul>\n<p> </p>\n<div class=\"h3\" style='\"line-height:'><strong>About You </strong></div>\n<ul style=\"\">\n<li style=\"\">Our mission to change an entire industry is not easily achieved, so we only hire people who are inspired by the goal and up for the challenge. In turn, our employees have every opportunity to grow with us, achieve personal and professional success and enjoy making a tangible difference in an industry that’s long been resistant to change. </li>\n<li style=\"\">Skills &amp; Qualifications </li>\n<li style=\"\">Bachelor’s degree in data analytics, data science, statistics, information technology or related fields</li>\n<li style=\"\">4+ years of SQL experience, creating complex SQL solutions to business problems</li>\n<li style=\"\">4+ years of experience data modeling</li>\n<li style=\"\">2+ years of experience reporting/querying cross-functional financial &amp; accounting data (GL, AP, purchasing)</li>\n<li style=\"\">Experience working in dbt or related tool</li>\n<li style=\"\">Experience developing test automation using any orchestration tools - Airflow or Dagster</li>\n<li style=\"\">Experience with git is a plus</li>\n</ul>\n<p>EquipmentShare is committed to a diverse and inclusive workplace. EquipmentShare is an equal opportunity<br>employer and does not discriminate on the basis of race, national origin, gender, gender identity, sexual orientation,<br>protected veteran status, disability, age, or other legally protected status.</p><img src=\"https://remotive.com/job/track/1901746/blank.gif?source=public_api\" alt=\"\"/>","tags":"[\"sql\",\"test automation\"]","pubDate":"2024-03-21 23:21:11.000","link":"https://remotive.com/remote-jobs/software-dev/analytics-engineer-finance-1901746","savedDate":"2024-03-24 13:14:36.785","slug":"analytics-engineer-finance-equipmentsharecom-6054"},{"id":5841212053,"title":"Affiliate Marketing Manager, LATAM","company":"Airalo","image":"https://lever-client-logos.s3.us-west-2.amazonaws.com/55028a36-609c-479c-9553-d4689ff2dd8c-1669620566663.png","description":"<div><b>About Airalo</b></div><div>Alo! Airalo is the world’s first eSIM store that helps people connect in over 200+ countries and regions across the globe. We are building the next digital service that revolutionizes the telecom industry. We are a travel-tech company and an equal-opportunity environment that values and executes diversity, inclusion, and equity. Our team is spread across 50+ countries and six continents. What glues us together is our commitment to changing the way you connect<span style=\"font-size: 13.3333px\">. </span></div><div><br></div><div><b>About you</b></div><div>We hope that you care deeply about the quality of your work, the intrinsic worth of tasks, and the success of your team. You are self-disciplined and do not require micromanagement in terms of your skillset and work ethic. You do your best to flourish as an individual every day while working hard to foster a collaborative team environment. You believe in the importance of being — and staying — authentic, honest, positive, and kind. You are a good interlocutor with clear and concise communication. You are able to manage multiple projects, have an analytical mind, pay keen attention to detail, and love to get your hands dirty. You are cognizant, tolerant, and welcoming of vulnerabilities and cultural differences.</div><div><br></div><div><b>About the Role</b></div><div><b>Position</b>: Full-time / Employee</div><div><b>Location:</b>&nbsp;Remote-first </div><div><b>Benefits:</b>&nbsp;Health Insurance, work-from-anywhere stipend, annual wellness &amp; learning credits, annual all-expenses-paid company retreat in a gorgeous destination &amp; other benefits</div><div><br></div><div>As Airalo’s Affiliate Marketing Manager for Latin America (LATAM), you will build and execute Airalo’s affiliate strategy to drive high-quality user acquisitions in the LATAM region. You will be the affiliate marketing expert who will work alongside experienced cross-functional teams to achieve our AARRR objectives and ensure that&nbsp;Airalo&nbsp;is on the proper path to becoming the&nbsp;gateway to instant connectivity worldwide.</div><h3>Responsibilities include but are not limited to:</h3><li>Work closely with our Partnerships Director for the region and other team members in the department</li><li>Take part in the whole growth experimentation cycle - from ideation through implementation and analysis</li><li>Fulfill the quarterly strategy by owning tactics, campaigns, initiatives, and experiments for the affiliate channel</li><li>Identify, recruit, and onboard new publishers for incremental reach</li><li>Manage and develop existing publisher relationships to drive scale against program KPIs and establish Airalo as the advertiser of choice with key publishers</li><li>Own communication with publishers on updates, brand guidelines, offers, etc.</li><li>Improve acquisition efficiency and maximize the contribution of affiliates as a channel by monitoring and optimizing conversion funnels</li><li>Constantly analyze, experiment, and iterate to improve performance and uncover new opportunities</li><li>Being creative and always thinking about ways to grow and reach our OKRs</li><li>Constantly learning new ways to utilize our tools of choice (e.g. affiliate marketing platforms)</li><li>Own the relationship with agency partners to help them deliver on agreed objectives</li><li>Working closely with other departments to gather insights from our users and partners to suggest improvements</li>,<h3>Must-haves:</h3><li>Bachelor’s degree in a related field</li><li>A growth mindset and data-driven decision-making approach</li><li>4+ years of experience in growth marketing (with a focus on affiliate marketing)</li><li>Proven track record of managing affiliate program(s)</li><li>Familiarity with and experience managing one or more affiliate marketing platforms like Impact, Partnerize, Rakuten Marketing, Commission Junction, Refersion etc.</li><li>Strong understanding of digital marketing strategy</li><li>Experience in data analysis on different platforms (e.g. Google Analytics, Adjust, Tableau, etc.)</li><li>Strong verbal and written communication skills in English and Spanish</li>,<h3>Good to have:</h3><li>Prior experience in setting up an affiliate program from scratch</li><li>Prior experience or familiarity with statistics and data analysis</li><li>Prior experience in the tech or telecommunications industry</li><li>Graduate degree in a related field</li><li>Certificates and courses in digital marketing and research methods</li><li>Knowledge of eSIM and GSMA-related technologies and services</li><div><i>We sincerely thank all applicants in advance for submitting their interest in this opportunity with Airalo. </i></div>","tags":"[\"management\"]","pubDate":"2024-03-21 19:52:56.519","link":"https://jobs.lever.co/airalo/7ee13bda-61fa-4b79-b03f-f33588cde6c1","savedDate":"2024-03-24 13:14:36.790","slug":"affiliate-marketing-manager-latam-airalo-2648"},{"id":6145665292,"title":"Senior Product Designer, Growth & Innovation","company":"Bio Render","image":"https://lever-client-logos.s3-us-west-2.amazonaws.com/0f4b434e-502f-4390-9819-c058d43028c1-1595260531860.png","description":"<div>At BioRender, our mission is to accelerate the world’s ability to learn, discover and communicate science. We are passionate about democratizing science communication in order to accelerate scientific discovery and understanding. We're looking for amazing people to help create the world’s go-to-place and platform where science is communicated. Come join us!</div><div><br></div><div>You can think of BioRender as the ‘Figma/Canva for scientists’ - a suite of web-based graphics communication products to empower scientists to create beautiful scientific visuals and presentations with ease.</div><div><br></div><div>Co-founded by Shiz Aoki, a world-renowned Medical Illustrator, our team has continuously put user experience and design at the core of our product development process. BioRender is design and UX first and it’s ingrained into our company DNA.</div><div><br></div><div>The Growth Team’s mission is to think big, start small, and move fast; experimenting across the entire user journey–adding value for scientists and creating sustained lift in key business metrics like engagement/retention, sign-ups, and revenue. We’re not just focused on optimizing funnels - we’re building new products and working to uncover entire new user acquisition channels.</div><div><br></div><div>We’re looking for a user-obsessed, business-outcome-oriented Product Designer to design new products and product experiments that will make it easier for scientists to communicate their research while driving material business outcomes for BioRender.</div><div><br></div><div>Our growth team has 3 sub-teams or workstreams that the product design role will flex 1-2 of the following opportunity spaces:&nbsp;</div><div>1. Engagement &amp; Retention: for example, exploring integrations and new add-on products (eg chemistry, animations, 3D figures) to drive user engagement.&nbsp;</div><div>2. Awareness &amp; Acquisition: for example, building free tools, sidecar products and virality loops within the product to drive high-leverage signups.&nbsp;</div><div>3. Free to Paid Conversion: for example, optimizing new user onboarding and activation, free trial experience and experimenting with pricing and packaging to drive self-serve revenue and generate product-qualified leads.</div><h3>What you'll do at BioRender:</h3><li>Become an expert on the user, different personas, usage behavior, BioRender products and opportunities and our space/market within the first 90 days. Being an expert on our key user personas will be crucial to your success in this role.</li><li>Partner with the Growth leadership triad to determine the highest ROI opportunities and the optimal investment allocation to create a sustained lift in key business metrics. This is an impactful opportunity to join a tightly-knit team solving deep-rooted problems for scientists.&nbsp;</li><li>Own the end-to-end design strategy and user experience across the Growth portfolio:</li><li>\t\t(1) Design add-on products and iterative product experiments that increase user engagement and retention, e.g. find the smallest viable way to test new add-on products such as AI, chemistry or animation; increase PPT add-on usage from ~6% of MAU to 20%.</li><li>\t\t(2) Design free tools or sidecar products (eg scientist graphing calculator, science news or research updates tool) for scientists that increase brand awareness and drive new user acquisition.</li><li>\t\t(3) Optimize signup, onboarding and upgrade funnels, and own pricing and packaging experience + experimentation.</li><li>Contribute to the overall product strategy at BioRender. Consistently reevaluate the roadmap based on user feedback, industry trends, company objectives and product strategy. The roadmap is as much yours as it is the product manager’s.</li><li>Be an active member of the BioRender Design team who critiques and drives continuous evolution of the overall design and UX of our product and our design practices.</li>,<h3>Our ideal fit:</h3><li>In a perpetual pursuit to understand our users and customers and design delightful user experiences that drive business outcomes (e.g. revenue, sign-ups, retention).</li><li>Uses both qualitative (user research) and quantitative (analytics) data to help make product and design decisions.</li><li>Extremely good at finding creative ways to reduce time to learn and validate product ideas and design approaches with minimal engineering effort.</li><li>Seen as an expert in nearly all user personas and their workflows within your pillar. Confidently and intuitively prioritizes user needs based on user context. Builds trusting relationships with users. Creates opportunities for cross-functional peers to empathize with users.</li><li>Leads qualitative user research on large, ambiguous initiatives.</li><li>Actively helps define the Growth team’s vision and how to execute it. Seen as an expert in&nbsp; the product.</li><li>Graphic/visual design background is a plus.</li><li>Science background is a plus but not required!</li>,<h3>Why join us?</h3><li>We are mission-driven, and work collaboratively towards our shared vision of improving scientific communication and accelerating scientific discovery: BioRender figures have appeared in more than 54,000 publications!&nbsp;</li><li>It’s a product that users love! We have a world-class NPS and a community of loyal fans. Check out our Testimonials page to see what our customers are saying about us: <a href=\"https://biorender.com/testimonials/\" class=\"postings-link\">https://biorender.com/testimonials/</a>&nbsp;</li><li>We are in the top quartile for profitability and year-over-year revenue growth, with users in 200+ countries.</li><li>BioRender is an equal opportunity employer, and an inclusive hiring process and work environment is a part of our DNA.&nbsp;</li><li>We’re remote-first and have team members across Canada and the United States. A physical office in Toronto is available, but you have the flexibility to work from anywhere.&nbsp;</li><li>We’re backed by top investors, accelerators, and some of the most successful life science entrepreneurs and philanthropists in the world including Y Combinator, Malala Fund founders, and Fifty Years VC.&nbsp;</li><li>We are committed to building a warm, inclusive, and diverse environment. Check out how we make sure our employees come first.</li><div><br></div><div>If your interest is piqued, please apply. We'd love to hear from you. Also, be sure to check out other listings on our Careers page.&nbsp;</div><div><br></div><div>BioRender is now remote-first, with plans to bring everyone together at our Toronto office a few times each year.</div><div><br></div><div>We are committed to providing work environments which promote the health, safety and well-being of all employees in accordance with public health regulation and guidance.</div><div><br></div><div><i>BioRender is an equal opportunity employer and, as such, does not discriminate on the basis of race, colour, religion, sex, national origins, age, sexual orientation, disability or any other characteristic protected by applicable laws.&nbsp; Selection decisions are solely based on job-related factors.</i></div><div>Read more about our <a href=\"https://biorender.notion.site/BioRender-Candidate-Resources-8255c155797f442a950720a33b4764d5\" class=\"postings-link\">BioRender interview process &amp; FAQs here!</a></div><div>Check out what it's like to work at BioRender in <a href=\"https://biorender.notion.site/Working-at-BioRender-as-a-Canada-Based-Employee-f6e12ab844154bb9948b22b32e3f0c70\" class=\"postings-link\">Canada</a> and the <a href=\"https://biorender.notion.site/Working-at-BioRender-as-a-U-S-Based-Employee-4ab2cc8e48f546f89aa98c318bccebc9\" class=\"postings-link\">US</a>!</div><div><br></div><div><span style=\"font-size: 10px\">#LI-HC1</span></div>","tags":"[\"engineering\",\"B2C\",\"aws\"]","pubDate":"2024-03-21 18:54:28.283","link":"https://jobs.lever.co/biorender/e07dda1b-9c0d-4817-9e92-bbb2f486e14f","savedDate":"2024-03-24 13:14:36.795","slug":"senior-product-designer-growth-innovation-bio-render-934"},{"id":1099196819,"title":"Founding CTO / Lead Developer","company":"Webicient","image":"https://remotive.com/job/1903636/logo","description":"<p>Are you seeking a role that combines your love for technology with the thrill of creative innovation? Do you envision waking up each day feeling passionate about your work, knowing you're making a tangible difference? Welcome to Webicient, where your dream job awaits!</p><p><br></p><p><strong>Discover Webicient:</strong></p><p>At Webicient, we're not just a Createch agency; we're a hub of creativity and technical mastery. Our mission is to empower ambitious businesses with ingenious and practical solutions. Imagine a world where creativity and tech are seamlessly integrated, accessible, and lightning-fast – that's the world we're building.</p><p><br></p><p>Our cutting-edge SaaS platform streamlines the process for our clients, offering bespoke createch services, complemented by the expertise of our dedicated project managers.</p><p><br></p><p><strong>Join Us as a CTO / Lead Developer:</strong></p><p>We're on the hunt for a Lead Developer, someone who's not just a participant but a pacesetter in our journey. Here's what your role will entail:</p><p></p><ul style=\"\"><li style=\"\">Becoming a guiding light in production, inspiring fellow developers.</li><li style=\"\">Propelling our teams towards groundbreaking achievements, while offering a wealth of knowledge for all developmental discussions.</li><li style=\"\">Crafting the blueprint for our DevOps strategies, ensuring that our development processes are ever-evolving.</li><li style=\"\">Harmonizing our production methods, anchoring our growth strategy.</li><li style=\"\">Pioneering our technical vision and strategy, making sure our technology solutions align not only with our current objectives but also scale with our ambitious future.</li></ul><p><br></p><p><strong>We Need You to Bring:</strong></p><p></p><ul style=\"\"><li style=\"\">A proven track record of assembling and nurturing development teams.</li><li style=\"\">A minimum of 6 years in full-stack development, with a strong focus on PHP and JavaScript (React, Next.JS).</li><li style=\"\">A knack for precise project estimation, accounting for potential risks.</li><li style=\"\">The talent to deconstruct larger tasks into manageable, estimable units.</li><li style=\"\">An in-depth understanding of DevOps processes.</li><li style=\"\">A BSc degree (or equivalent) in Computer Science.</li><li style=\"\">Expertise in CMS and Headless architectures.</li><li style=\"\">The agility to thrive in dynamic, fast-paced settings.</li><li style=\"\">A commitment to not just work with us but to be an integral part of our visionary journey.</li><li style=\"\">Experience in Sanity (Not a must but a bonus!)</li></ul><p><br></p><p><strong>What's in It for You:</strong></p><p></p><ul style=\"\"><li style=\"\">A transformative role where personal growth is a reality.</li><li style=\"\">Generous paid vacation to ensure work-life balance.</li><li style=\"\">An organizational culture that treasures its team.</li><li style=\"\">A platform where your ideas are not only heard but valued and implemented.</li></ul><p><br></p><p>At Webicient, you're not just joining a company; you're becoming a part of a revolution. Are you ready to make your mark? Join us and elevate your career to new heights, as we stride towards becoming a tier-1 agency on the global stage!</p>\n<img src=\"https://remotive.com/job/track/1903636/blank.gif?source=public_api\" alt=\"\"/>","tags":"[\"accounting\",\"fullstack\",\"javascript\",\"php\",\"react\",\"saas\",\"computer science\",\"CMS\"]","pubDate":"2024-03-21 14:19:47.000","link":"https://remotive.com/remote-jobs/software-dev/founding-cto-lead-developer-1903636","savedDate":"2024-03-24 13:14:36.785","slug":"founding-cto-lead-developer-webicient-2472"},{"id":7923487479,"title":"Information Security Officer","company":"Airalo","image":"https://lever-client-logos.s3.us-west-2.amazonaws.com/55028a36-609c-479c-9553-d4689ff2dd8c-1669620566663.png","description":"<div><b>About Airalo</b></div><div>Alo! Airalo is the world’s first eSIM store that helps people connect in over 200+ countries and regions across the globe. We are building the next digital service that revolutionizes the telecom industry. We are a travel-tech company and an equal-opportunity environment that values and executes diversity, inclusion, and equity. Our team is spread across 50+ countries and six continents. What glues us together is our commitment to changing the way you connect<span style=\"font-size: 13.3333px\">. </span></div><div><br></div><div><b>About you</b></div><div>We hope that you care deeply about the quality of your work, the intrinsic worth of tasks, and the success of your team. You are self-disciplined and do not require micromanagement in terms of your skillset and work ethic. You do your best to flourish as an individual every day while working hard to foster a collaborative team environment. You believe in the importance of being — and staying — authentic, honest, positive, and kind. You are a good interlocutor with clear and concise communication. You are able to manage multiple projects, have an analytical mind, pay keen attention to detail, and love to get your hands dirty. You are cognizant, tolerant, and welcoming of vulnerabilities and cultural differences.</div><div><br></div><div><b>About the Role</b></div><div><b>Position</b>: Full-time / Employee</div><div><b>Location:</b>&nbsp;Remote-first </div><div><b>Benefits:</b>&nbsp;Health Insurance, work-from-anywhere stipend, annual wellness &amp; learning credits, annual all-expenses-paid company retreat in a gorgeous destination &amp; other benefits</div><div><br></div><div>We are looking for an experienced Information Security Officer to join our growing engineering team. We welcome talented, passionate, innovative, result-oriented professionals who are highly skilled in security policies, procedures, controls and compliance with relevant data privacy and information security laws and regulation.</div><h3>Responsibilities include but are not limited to:</h3><li>Leading and maintaining compliance with SOC 2, ISO 27001, GDPR, CCPA and other programs.</li><li>Developing, implementing and enforcing information security policies, procedures and guidelines to safeguard organization data.</li><li>Conducting regular risk assessments and security audits to identify vulnerabilities and asses the effectiveness of existing security protocols.</li><li>Developing and maintaining disaster recovery and business continuity plans.</li><li>Completing risk assessment questionnaires for B2B and enterprise customers.</li><li>Conducting regular risk assessment for vendors.</li><li>Monitoring network and system activities for security incidents and responding to security breaches.</li><li>Collaborating with engineering and other departments to integrate security measures to into all aspects of the organization.</li><li>Staying informed about latest security trends, threads and technologies and continuously improving it.</li><li>Improving information security in the organization by providing security awareness and other trainings to colleagues.</li>,<h3>Must-haves:</h3><li>Bachelor’s degree in Computer Engineering or a similar discipline.</li><li>5+ years of experience in information security roles.</li><li>Strong understanding of information security policies, practices and controls.</li><li>Experience with SOC 2, ISO 27001, GDPR, CCPA compliance and audit processes.</li><li>Proficiency in network security, firewalls, intrusion detection and prevention systems.</li><li>Knowledge of data loss prevention and security information and event management systems.</li><li>Knowledge of cloud security principles and best practices.</li><li>Knowledge of security vendors, systems, and solutions</li>,<h3>Good to have:</h3><li>Familiarity with AI tools and technologies.</li><li>CISM, CISSP or a similar certification</li><li>Prior work experience in telecommunications.</li><li>Knowledge of eSIM and GSMA related technologies and services.</li><div>If you are interested in this position, <b>please apply via the link.</b></div><div><br></div><div><i>We sincerely thank all applicants in advance for submitting their interest in this opportunity with Airalo. </i></div>","tags":"[\"management\",\"engineering\",\"B2B\",\"aws\"]","pubDate":"2024-03-21 11:24:46.997","link":"https://jobs.lever.co/airalo/4431e25d-dba5-49e8-bd19-9d047a412a0a","savedDate":"2024-03-24 13:14:36.791","slug":"information-security-officer-airalo-9086"},{"id":2447754192,"title":"Middle/Senior Java Developer Remote/Work Anywhere","company":"CloudLinux","image":"https://pbs.twimg.com/profile_images/696718028084482050/ymY3OEPk_400x400.png","description":"<p>Are you a talented and passionate Java Developer? Join our team at CloudLinux and be a part of something amazing!</p><p>As the leading provider of the #1 OS for web-hosting providers, we take pride in developing innovative products that are used by thousands of companies worldwide.</p><p>In this role, you'll be an integral part of our Extended Lifecycle team. With your expertise in Java tools and fresh approach, you'll have the opportunity to make a significant impact by providing secure Java instrumentation for diverse Java-based environments.</p><p>What will you do in this role? Let's dive into the exciting details:</p><ul> <li>Your role will involve enhancing the security of Java and exploring its inner workings.</li> <li>You'll conduct research and run experiments to expedite the assembly of Java packages.</li> <li>Your work will result in a more secure Java environment, making development easier for others.</li> <li>You'll investigate vulnerabilities in Java and Java libraries, focusing on popular end-of-life versions.</li> <li>Your responsibilities will also include improving automation processes for dependency tree construction and project rebuilding.</li> </ul><p></p><h3>Requirements: </h3><p>To be successful you should have;</p><ul> <li>Over 4 years of expertise in software development</li> <li>Extensive hands-on experience and deep understanding of Java core, Spring boot, Spring data JPA, and Spring security</li> <li>Proficient with both noSQL (neo4j) and PostgreSQL databases</li> <li>Highly advantageous to have previous experience working with Gitlab as CI/CD</li> <li>Knowledge of repository management systems like Nexus will also be considered a plus</li> </ul><h3>Benefits: </h3><p><strong>What's in it for you?</strong></p><ul> <li>A focus on professional development; </li> <li>Interesting and challenging projects</li> <li>Flexible working hours</li> <li>Paid one month vacation per year and unlimited sick leave</li> <li>Medical insurance reimbursement</li> <li>Co-working and gym/sports reimbursement</li> <li>The opportunity to receive a reward for the most innovative idea that the company can patent</li> </ul><p><em>By applying for this position, you agree with </em><a href=\"https://cloudlinux.com/privacy-policy\" rel=\"nofollow noreferrer noopener\" class=\"external\"><em>Cloudlinux Privacy Policy</em></a><em> and give us your consent to maintain and process your personal data with this respect. Please read our Privacy Policy for more information.</em></p>","tags":"[\"postgres\",\"management\",\"database\"]","pubDate":"2024-03-20 00:00:00.000","link":"https://apply.workable.com/cloudlinux-1/j/FF5A9ACE9C","savedDate":"2024-03-24 13:14:36.787","slug":"middle-senior-java-developer-remote-work-anywhere-cloudlinux-3973"},{"id":5252654716,"title":"IT Helpdesk","company":"VRChat","image":"https://pbs.twimg.com/profile_images/1719900921793003520/qPc3pV09_400x400.jpg","description":"<div><span style=\"font-size: 24px\">Join the VRChat Team!</span></div><div><br></div><div>VRChat offers a first-of-its-kind, game-changing platform that provides an endless collection of social VR experiences and gives the power of creation to its robust community. With over 250,000 worlds and growing, VRChat’s vision is to allow users to bring their imaginations to life and help shape the metaverse anywhere in the world on any device. VRChat has raised $100M to date with the support of investors Makers Fund, Anthos Capital, and HTC and is building out a strong team to achieve hyper-growth in the coming years.</div><div><br></div><div><span style=\"font-size: 24px\">Job Overview</span></div><div><br></div><div>The IT Helpdesk will be responsible for the support and maintenance of IT Operations at VRChat. This role will help support the technology program for VRChat’s remote team, including the aid in hardware and software deployment and management while bringing IT best practices to your day-to-day.</div><div><br></div><div><br></div><div><span style=\"font-size: 24px\">Job &amp; Team Impact</span></div><div><br></div><div>You have a remote mindset and understand remote workers and their tech needs. You have a desire to keep learning and to stay up to date on security, hardware, and the latest software available to help enhance company operations. In this role, you will provide aid so that IT services run smoothly for the VRChat team while ensuring proper care is taken to ensure our remote team thrives.</div><div><br></div><h3>Duties & Responsibilities</h3><li>Execute the IT vision, strategy, and design needs of VRChat’s information technology team. This strategy will clearly define resources, systems, and technology needed to support the organization and will continuously evolve.</li><li>Responsible for SaaS account management and license tracking across the VRChat organization via SSO.</li><li>Lead new hire technology onboarding including but not limited to equipment procurement, device setup, and system access control.</li><li>Utilize best practices to establish protocols and playbooks for the IT Helpdesk.</li><li>Maintain IT hardware asset management program for the company.</li><li>Manage information technology and computer systems (including MacOS, iOS, and Windows operating systems).</li><li>Be the main point of contact for VRChat team members who need technological assistance and escalate when appropriate.</li><li>Work on documenting IT practices, policies, and procedures.</li><li>Serve as the first point of contact for customers seeking technical assistance.</li><li>Brainstorm, and participate in the integration of new IT Systems Development in alignment with the overall IT, data, and information security policies.</li><li>Automate and find solutions to common helpdesk issues.</li><li>Identify and suggest possible improvements on helpdesk procedures.</li>,<h3>Experience, Skills & Qualifications</h3><li>A bachelor’s degree in Information Technology, Computer Science, Information Systems, or a related field or equivalent experience.</li><li>Minimum 4 years of experience in IT operations field providing support.</li><li>Minimum of 4 years experience with MacOS and Windows.</li><li>Ability to grow in a virtual IT work environment.</li><li>Experience building and maintaining strong relationships with team members with a customer-focused approach.</li><li>Engineering mindset and IT strategies, organizational structures, and operating models.</li><li>Eagerness to learn new subject matter.</li>,<h3>Bonus Points</h3><li>Understanding of SSO (SAML/SCIM)</li><li>Asset Management Experience</li><li>Experience working for a startup or high-growth tech company while developing a high-performing team.</li><li>Demonstrated interest in VR, online communities, or be a VRChat user and creator!</li><li>Knowing how our platform and community works</li>,<h3>Benefits</h3><li>Work from anywhere! VRChat is a 100% remote company</li><li>Health Benefits</li><li>401K for US &amp; RRSP for Canadian Employees</li><li>Stock Options</li><li>Generous paid holiday schedule</li><li>Unlimited/Flexible vacation time</li><li>Paid parental leave benefits</li><li>Annual team events</li><div><i style=\"font-size: 10px\">VRChat is an equal-opportunity employer, and we welcome applicants from all backgrounds. VRChat fosters a diverse, creative, and collaborative environment where anyone can contribute to any of the ongoing projects or direction of the roadmap at any time.&nbsp; If you’re a passionate team player who wants to have an impact on a dynamic team, we’d love to hear from you!</i></div><div><br></div><div><i style=\"font-size: 10px\">Offers are subject to satisfactory background and reference checks.</i></div>","tags":"[\"management\",\"engineering\"]","pubDate":"2024-03-19 17:47:07.367","link":"https://jobs.lever.co/vrchat/16aa3c5b-d282-4814-9af4-a10c0091a866","savedDate":"2024-03-24 13:14:36.789","slug":"it-helpdesk-vrchat-3155"},{"id":1625709006,"title":"Director of Product, Consumers","company":"VRChat","image":"https://pbs.twimg.com/profile_images/1719900921793003520/qPc3pV09_400x400.jpg","description":"<div><span style=\"font-size: 16pt\">Join the VRChat Team!</span></div><div><br></div><div><span style=\"font-size: 10pt\">VRChat offers a first-of-its-kind, game-changing platform that provides an endless collection of social VR experiences and gives the power of creation to its robust community. With over 250,000 worlds and growing, VRChat’s vision is to allow users to bring their imaginations to life and help shape the metaverse anywhere in the world on any device. VRChat has raised $100M to date with the support of investors Makers Fund, Anthos Capital and HTC and is building out a strong team to achieve hypergrowth in the coming years.</span></div><div><br></div><div><span style=\"font-size: 16pt\">Job Overview</span></div><div><br></div><div><span style=\"font-size: 10pt\">The Director of Product, Consumers, is a highly strategic Senior IC role on the newly formed product management team at VRChat. This person will have full ownership of the end-to-end user experience on VRChat, which includes Social, Identity, Discovery, Trust &amp; Safety, and the overall experience . This person will play a pivotal role in building the experiences that will help us reach the next 10 million users.</span></div><div><br></div><div><span style=\"font-size: 10pt\">This role reports into the VP of Product at VRChat, and will work closely with a dedicated cross functional team, heads of various functions, with periodical interaction with the exec team and the VRChat Board as well.&nbsp; </span></div><h3>Responsibilities</h3><li>Take ownership of the entire User roadmap and establish a good framework for categorization and prioritization.</li><li>Support high quality execution with timely decisions and team leadership.</li><li>Create the short and long term strategy for this space, and align it with higher level product vision and strategy.</li><li>Develop a culture of experimentation and data-first decision making.</li><li>Run a smooth and collaborative planning process to generate plans that reflect strategic goals, user insights and past learnings.</li><li>Manage execution to deliver against goals and objectives.</li><li>Represent progress at periodic product reviews, and seek leadership support in a timely manner to unblock execution.</li><li>Partner with production for execution support and work collaboratively to resolve issues.&nbsp;Stay current on industry trends and best practices in virtual economies, e-commerce, gaming, UGC and social platforms to inform strategic decisions.</li><li>Develop and maintain strong relationships with key stakeholders, including the Creators team, creators, partners, and the broader VRChat community.</li><li>Support the VP of Product in critical strategy, organization and execution areas.</li>,<h3>Experience, Skills & Qualifications</h3><li>7+ years of product management in a high-growth consumer tech company.</li><li>Past expertise running A/B tests on scaled user bases.</li><li>University degree, with design, technical or business background or mix of education and experience.</li><li>Extensive experience in product intuition and UX design, with a healthy obsession to discover and fulfill the needs of users.</li><li>Expert at defining metrics and making product and strategic decisions based on A/B testing and/or qualitative feedback.</li><li>Intellectually curious about new technologies and societal changes, and understands how to apply innovations and trends to product opportunities.</li><li>Proven demonstrable impact, leading $10M+ high impact growth opportunities.</li>,<h3>Benefits</h3><li>Work from anywhere! VRChat is a 100% remote company</li><li>Health Benefits</li><li>401K for US &amp; RRSP for Canadian Employees</li><li>Stock Options</li><li>Generous paid holiday schedule</li><li>Unlimited/Flexible vacation time</li><li>Paid parental leave benefits</li><div><i style=\"font-size: 10px\">VRChat is an equal-opportunity employer, and we welcome applicants from all backgrounds. VRChat fosters a diverse, creative, and collaborative environment where anyone can contribute to any of the ongoing projects or direction of the roadmap at any time.&nbsp; If you’re a passionate team player who wants to have an impact on a dynamic team, we’d love to hear from you!&nbsp;</i></div><div><br></div><div><i style=\"font-size: 10px\">Offers are subject to satisfactory background and reference checks.</i></div>","tags":"[\"management\"]","pubDate":"2024-03-18 19:34:05.921","link":"https://jobs.lever.co/vrchat/91148e1f-0250-4ea0-9227-2252b9fe51c7","savedDate":"2024-03-24 13:14:36.789","slug":"director-of-product-consumers-vrchat-833"},{"id":2399660278,"title":"İnsan Kaynakları Müdürü","company":"Ciceksepeti","image":"https://lever-client-logos.s3.us-west-2.amazonaws.com/de4eebbf-97f1-4bdb-b542-4fa65a0b48ab-1662467464737.png","description":"<div><b style=\"font-size: 10.5pt\">Bir teknolojisi firması olarak faaliyet gösterdiğimiz tüm pazarlarda lider olmak vizyonuyla çıktığımız yolda bize katılmak ister misiniz?</b></div><div><br></div><div><span style=\"font-size: 10.5pt\">Kurumsalın alışılagelmiş ifadelerinden ve hiyerarşiden uzak heyecan verici bir kariyere başlamak için en iyi yönlerini ortaya çıkarmaya hazır, dinamik, entelektüel açıdan meraklı genç profesyoneller arıyoruz. Hızla büyümeye devam eden bir teknoloji şirketi olarak gerçek hayatta yaşanan sorunları çözme ve profesyonel yaşamı deneyimleme imkanı sunuyoruz. Yaptığın işin tüm sorumluluğunu almak istiyorsan, işine katkı sağlayacak yeni fikirlerin olduğunda sesini duyurmak istiyorsan ve olağanüstü bir işbaşında eğitim deneyimi yaşamaya hazırsan; o zaman meydan okumaya hazırsın.</span></div><div><br></div><div><br></div><div><br></div><h3>İş Tanımı</h3><li>Mavi yaka pozisyonlar için işe alım süreçlerini uçtan uca yönetmek.</li><li>İşe alım pozisyonları için stratejiler geliştirmek, verimliliği artırmak ve şirket ihtiyaçlarına uygun aday havuzunu oluşturmak.</li><li>İK departmanında iş ortağı olarak görev alarak İnsan Kaynakları süreçlerinden sorumlu olmak.</li>,<h3>Aranan Nitelikler</h3><li>Kütahya veya yakın illerde ikamet eden,</li><li>Üniversitelerin ilgili bölümlerinden mezun,</li><li>En az 10 yıl İK ve işe alım süreçleri deneyimine sahip,</li><li>Mavi yaka işe alım tecrübesi bulunan,</li><li>İş Hukuku ve yasal mevzuat konularında bilgi ve deneyime sahip,</li><li>Askerlik ile ilişiği olmayan (Erkek adaylar için),</li><li>Güçlü insan ilişkilerine, etkili iletişime ve ekip çalışmasına yatkın,</li><li>Çözüm odaklı, açık fikirli ve müzakere becerilerine sahip,</li><li>Yeniliklere açık, sonuç odaklı, iş takibi güçlü,</li><li>Dinamik ve hızlı çalışma ortamına uyum sağlayabilen.</li><div><b><span style=\"font-size: 10.5pt\">Hakkımızda</span></b></div><div><br></div><div><span style=\"font-size: 10.5pt\">En kolay ve ekonomik yoldan çiçek göndermeyi sağlamak için 2006’da kurulan</span><a href=\"http://ciceksepeti.com/\" style=\"font-size: 10.5pt\" class=\"postings-link\">ciceksepeti.com</a><span style=\"font-size: 10.5pt\">, Türkiye genelinde</span><a href=\"http://55.0.0.0/\" style=\"font-size: 10.5pt\" class=\"postings-link\">55.000</a><span style=\"font-size: 10.5pt\">+ iş ortağı ve 70’den fazla ile gönderimini sağladığı binlerce siparişle, Türkiye'deki en büyük online çiçekçidir.Çiçeksepeti; çiçek aranjmanları, kek ve kurabiye buketlerinin yanı sıra kişiselleştirilmiş hediyeler ile müşterilerine binlerce alternatif sunarak özel günlerde ilk akla gelen e-ticaret firmasıdır. </span></div><div><span style=\"font-size: 10.5pt\">Türkiye'deki başarı hikâyemizi, LolaFlora markası ile Meksika'da sürdürürken, bir teknoloji firması olarak, hediye alanındaki pazar liderliğimizi yeni iş modellerimize de taşımak vizyonu ile emin adımlarla ilerliyoruz.</span></div><div><br></div><div><span style=\"font-size: 10.5pt\">İşe alım süreçlerimizde kişisel verilerinizi nasıl işlediğimize dair bilgiye çalışan adayı aydınlatma metnimizden ulaşabilirsiniz./ Please see our candidate privacy note for information on how we process your personal data during our recruitment activities.\"</span><a href=\"https://cdn03.ciceksepeti.com/editor/hr/Ciceksepeti_CS-Teknoloji-Calisan-Adayi_Aydinlatma-Metni-15092023.pdf\" style=\"font-size: 10.5pt\" class=\"postings-link\">https://cdn03.ciceksepeti.com/editor/hr/Ciceksepeti_CS-Teknoloji-Calisan-Adayi_Aydinlatma-Metni-15092023.pdf</a><a href=\"https://cdn03.ciceksepeti.com/editor/hr/Ciceksepeti_CS-Teknoloji-Calisan-Adayi_Aydinlatma-Metni-15092023.docx.pdf\" style=\"font-size: 10.5pt\" class=\"postings-link\">https://cdn03.ciceksepeti.com/editor/hr/Ciceksepeti_CS-Teknoloji-Calisan-Adayi_Aydinlatma-Metni-15092023.docx.pdf</a></div>","tags":"[]","pubDate":"2024-03-18 09:00:22.654","link":"https://jobs.lever.co/ciceksepeti/d743e5f8-e5bb-4b20-a2b1-1137c449bd91","savedDate":"2024-03-24 13:14:36.793","slug":"nsan-kaynaklar-m-d-r-ciceksepeti-7258"}]