[{"id":9438162391,"title":"Manual Lead Software QA Engineer (Fully Remote)","company":"CoverGo","image":"https://pbs.twimg.com/profile_images/1382655628523364355/MWPIbbID_400x400.jpg","description":"<p><strong>Top 3 Reasons To Join Us</strong></p><ul> <li>Competitive Salary</li> <li>100% Remote</li> <li>Working on the latest tech for the Insurtech Market Leader</li> </ul><p><strong>About Us</strong></p><p>At CoverGo, our mission is to empower all insurance companies to make insurance 100% digital and accessible to everyone.</p><ul> <li>We are a leading global no-code insurance platform for health, life, and P&amp;C</li> <li>We’re the winner of the Insurtech of the Year in all of Asia and other awards globally</li> <li>We work with insurance enterprise clients such as AXA, Bupa, MSIG, Dai-ichi, Bank of China Group Insurance, and many more</li> <li>We're an international, diverse team of over 120 people with 30 nationalities and team members working remotely from all over the world</li> <li>We are fully funded and backed by reputable VC funds and strategic institutional investors</li> <li>We have a global presence in Asia, EMEA and the Americas</li> <li>We’ve grown our annualized revenue by over 30x since January 2021</li> <li>We’re constantly working towards making CoverGo a workplace that you love coming to. We deeply believe that bringing together a diversity of thoughts, expressions, and perspectives is key to building the best culture for equally diverse communities all over the world</li> </ul><p><strong>What You Will Do</strong></p><ul> <li>Lead and manage the manual software testing efforts, overseeing the creation of test plans, test cases, and their execution to ensure the quality and reliability of our software solutions</li> <li>Collaborate closely with cross-functional teams, including developers, product managers, and business analysts, to understand requirements and develop comprehensive test strategies</li> <li>Manage the QA team, distributing workload, setting goals for QA engineers, and conducting performance reviews for team members</li> <li>Identify, analyze, and document software defects and anomalies, and track them through resolution</li> <li>Define and maintain test environments, ensuring they are properly set up and configured for accurate testing</li> <li>Participate in the establishment of QA processes</li> <li>Participate in reviews of software requirements, design documents, and system architecture to provide feedback and ensure testing requirements are addressed</li> <li>Mentor and guide junior QA team members, providing coaching and support to help them enhance their skills</li> <li>Collaborate with automation engineers to develop and execute automated test scripts, as appropriate</li> </ul><p><strong>What We Need</strong></p><ul> <li>Bachelor's degree in Computer Science, Engineering, or a related field</li> <li>5+ years of experience in manual software testing, with a proven track record of delivering high-quality software products</li> <li>Strong knowledge of software testing methodologies, tools, and processes</li> <li>Experience in creating test plans, test cases, and executing tests to ensure software quality</li> <li>Proficient in defect tracking and test management tools</li> <li>Experience with QA processes establishment</li> <li>Experience with QA management, including setting goals and conducting performance reviews for the team</li> <li>Excellent analytical and problem-solving skills</li> <li>Strong attention to detail and ability to prioritize and manage workload effectively</li> <li>Excellent communication and interpersonal skills, with the ability to effectively collaborate with cross-functional teams</li> </ul><p><a href=\"https://www.youtube.com/watch?v=YI0ezLxvFvA\" rel=\"nofollow noreferrer noopener\" class=\"external\"></a><strong>Why You'll Love Working Here</strong></p><ul> <li>Fully Remote</li> <li>Flexible Leave</li> <li>International Environment</li> <li>Competitive renumeration package</li> <li>Performance Bonus</li> <li>Stock Options after 6 months </li> <li>Company activities and events</li> <li>Learning and development plan</li> </ul><p><strong>CoverGo Company</strong><a href=\"https://www.youtube.com/watch?v=YI0ezLxvFvA\" rel=\"nofollow noreferrer noopener\" class=\"external\"><strong> Video</strong></a></p><p>By submitting your application, you confirm that you have read, understood, and accepted the content of CoverGo’s <a href=\"https://apply.workable.com/covergo/gdpr_policy?lng=en\" target=\"_blank\" rel=\"nofollow noreferrer noopener\" class=\"external\">Privacy Notice</a> and you consent to the processing of your data as part of this application.</p><h3>Requirements: </h3><h3>Benefits: </h3>","tags":"[\"management\",\"engineering\"]","pubDate":"2024-01-25 00:00:00.000","link":"https://apply.workable.com/covergo/j/E670BB5123","savedDate":"2024-01-25 07:31:36.318","slug":"manual-lead-software-qa-engineer-fully-remote-covergo-7728"},{"id":2795001893,"title":"HR Admin (Fully Remote)","company":"CoverGo","image":"https://pbs.twimg.com/profile_images/1382655628523364355/MWPIbbID_400x400.jpg","description":"<p><strong>Top 3 Reasons To Join Us</strong></p><ul> <li>Competitive Salary</li> <li>100% Remote</li> <li>Working on the latest tech for the Insurtech Market Leader</li> </ul><p><strong>About Us:</strong></p><ul> <li>At CoverGo, our mission is to empower all insurance companies to make insurance 100% digital and accessible to everyone.</li> <li>We are a leading global no-code insurance platform for health, life, and P&amp;C</li> <li>We’re the winner of the Insurtech of the Year in all of Asia and other awards globally</li> <li>We work with insurance enterprise clients such as AXA, Bupa, MSIG, Dai-ichi, Bank of China Group Insurance, and many more</li> <li>We're an international, diverse team of over 120 people with 30 nationalities and team members working remotely from all over the world</li> <li>We are fully funded and backed by reputable VC funds and strategic institutional investors</li> <li>We have a global presence in Asia, EMEA and the Americas</li> <li>We’ve grown our annualized revenue by over 30x since January 2021</li> <li>We’re constantly working towards making CoverGo a workplace that you love coming to. We deeply believe that bringing together a diversity of thoughts, expressions, and perspectives is key to building the best culture for equally diverse communities all over the world</li> </ul><p><strong>What you will do:</strong></p><ul> <li>Assist the HR team in end-to-end recruitment processes, primarily managing the applicant tracking system</li> <li>Monitor the onboarding and offboarding task lists for joiners and leavers and assist in preparing and gathering documentation</li> <li>Prepare employment contracts, offer letters, and other HR-related documents.</li> <li>Collaborate with the staff club to develop and execute engagement strategies.</li> <li>Participate in HR team meetings and provide updates as required.</li> <li>Support HR team with administrative tasks.</li> <li>Maintain confidentiality of HR information and handle sensitive matters appropriately.</li> <li>Adapt to changing priorities and take on additional responsibilities when needed.</li> </ul><p><strong>What we are looking for:</strong></p><ul> <li>Fresh graduates are welcome to apply</li> <li>Degree in Psychology, Human Resource Development, or any related course</li> <li>Previous experience working for a startup or in Human resources is a plus</li> <li>Excellent skills in the use of Microsoft Office</li> <li>Able to work independently and under pressure in a fast-paced environment with an emphasis on accuracy and timeliness</li> <li>Self-motivated, hardworking, a strong sense of responsibility with a positive working attitude</li> <li>Good command of English is a must</li> </ul><p><a href=\"https://www.youtube.com/watch?v=YI0ezLxvFvA\" rel=\"nofollow noreferrer noopener\" class=\"external\"></a><strong>Why You'll Love Working Here</strong></p><ul> <li>Fully Remote</li> <li>Flexible Leave</li> <li>International Environment</li> <li>Competitive renumeration package</li> <li>Performance Bonus</li> <li>Stock Options after 6 months </li> <li>Company activities and events</li> <li>Learning and development plan</li> </ul><p><strong>CoverGo Company</strong><a href=\"https://www.youtube.com/watch?v=YI0ezLxvFvA\" rel=\"nofollow noreferrer noopener\" class=\"external\"><strong> Video</strong></a></p><p>By submitting your application, you confirm that you have read, understood, and accepted the content of CoverGo’s <a href=\"https://apply.workable.com/covergo/gdpr_policy?lng=en\" target=\"_blank\" rel=\"nofollow noreferrer noopener\" class=\"external\">Privacy Notice</a> and you consent to the processing of your data as part of this application.</p><h3>Requirements: </h3><h3>Benefits: </h3>","tags":"[]","pubDate":"2024-01-25 00:00:00.000","link":"https://apply.workable.com/covergo/j/5A501B336F","savedDate":"2024-01-25 07:31:36.318","slug":"hr-admin-fully-remote-covergo-9996"},{"id":6898373865,"title":"Online Surveys Quality Assurance Specialist","company":"Atlas Primary","image":"https://remotive.com/job/1891501/logo","description":"<p><strong>ABOUT ATLAS PRIMARY</strong></p>\n<p>Atlas Primary is a rapidly growing healthcare-focused market research company. Our work contributes to research that make healthcare professionals better at their most important work — the kind of work you read about in leading healthcare publications. Our clients are some of the largest healthcare companies in the world, and we are proud to help them drive innovation in healthcare through our extensive primary research data collection capabilities.</p>\n<p><strong>OUR CORE VALUES</strong></p>\n<p><strong>Optimize for Integrity</strong><br><br>Positive intent drives everything we do — we are true to each other, our healthcare and patient communities, our partners, and our clients. Success to us is measured by the quality of our relationships and the value we create for our stakeholders.<strong><br><br>One Team, One Dream</strong><br><br>We operate in a culture of transparency, teamwork, and trust to fulfill our company vision of helping our clients drive innovation and shape the future of healthcare. We know that each individual role plays a part in Atlas Primary's success. Everyone's work matters. Without the collective insight from a diverse group of experienced professionals, we would not be successful in our goal of delivering world-class solutions for our clients.<strong><br><br>Community Driven</strong><br><br>Some people may think of us as just a company… but we call ourselves family. We are the market research company that puts people first. Our success depends on a group of people working together to serve our clients and partners with the same devotion and care that we share for each other.<strong><br><br>Pride in Excellence</strong><br><br>We solve tough problems for our clients. Major decisions are made with the data we collect. We leverage our extensive experience to continually explore new ways to improve our processes, create efficiencies, and develop innovative solutions that ensure we deliver the best quality data available to inform our clients' most important decisions.<br><br></p>\n<p><strong></strong></p><p><strong><strong>POSITION DESCRIPTION: Online Surveys Quality Assurance Specialist</strong></strong></p><p></p>\n<p>We are looking for self-driven team players with a strong interest in the market research and healthcare industries. If you are a highly organized and goal-oriented person who is empowered by working in a fast-paced setting, this job is for you.<br></p>\n<p>The Quality Assurance Specialists' primary role is to assess, evaluate and test online questionnaires, keep track of programming changes interpret project needs/requirements or any other issues that could impact the study in a negative way.  </p><p><strong>RESPONSIBILITIES</strong></p><ul style=\"\"><li style=\"\">1 + years of experience in survey link testing</li><li style=\"\">Test survey links to ensure match to questionnaire</li><li style=\"\">Test quotas, qualifications logic, skip logic, validation logic, design and flow</li><li style=\"\">Responsible for data quality of online surveys data collection</li><li style=\"\">Must have good attention to detail and problem-solving skills</li><li style=\"\">Outstanding verbal and written communication skills</li><li style=\"\">Ability to interact with clients and programmers in a friendly manner</li><li style=\"\">Good understanding of online market research</li><li style=\"\">Healthcare market research experience a plus</li><li style=\"\">Bachelor's degree required</li><li style=\"\">Fully remote (work from home) position</li></ul><p><strong>REQUIREMENTS</strong></p>\n<ul style=\"\"><li style=\"\">Able to adapt and learn new tasks quickly</li><li style=\"\">Strong attention to detail <br></li><li style=\"\">Team player with a proven ability to build and maintain strong working relationships</li><li style=\"\">Expert in Microsoft Office tools</li><li style=\"\">Excellent problem-solving skills</li><li style=\"\">Ability to multitask and work independently</li><li style=\"\">Excellent written and verbal communication skills</li><li style=\"\">Strong command of the English language</li><li style=\"\">Able to work 8 am to 6 pm Eastern Time (US)</li><li style=\"\">Experience with Decipher data collection software a plus</li></ul>\n<img src=\"https://remotive.com/job/track/1891501/blank.gif?source=public_api\" alt=\"\"/>","tags":"[\"research\",\"market research\",\"healthcare\",\"microsoft office\",\"testing\"]","pubDate":"2024-01-24 01:21:29.000","link":"https://remotive.com/remote-jobs/qa/online-surveys-quality-assurance-specialist-1891501","savedDate":"2024-01-25 07:31:36.315","slug":"online-surveys-quality-assurance-specialist-atlas-primary-828"},{"id":8522250143,"title":"Head of Business Development","company":"Philabs","image":"https://remotive.com/job/1889523/logo","description":"<p><strong>Who are we?</strong></p>\n<p dir=\"ltr\"><a href=\"https://www.philabs.xyz/\" rel=\"nofollow\">Phi Labs</a> is a contributor of the<a href=\"https://archway.io/\" rel=\"nofollow\"> Archway</a> protocol, a Cosmos based layer 1 blockchain designed to reward dapp developers.</p>\n<p dir=\"ltr\">We are a software engineering company that focuses on the Cosmos SDK and CosmWasm, state-of-the-art frameworks for blockchain development. Our vision is to empower people to create a more transparent and accountable world through open, distributed, and interoperable networks.</p>\n<p>Archway is reshaping how value is created and shared across blockchain ecosystems. Initially incubated by Tendermint (Cosmos founders), Phi Labs raised a $21 million seed round from <a href=\"https://www.coindesk.com/business/2022/03/24/cosmos-protocol-archway-raises-21m-to-provide-developer-rewards/\" rel=\"nofollow\">Hashed and CoinFund</a>.</p>\n<p dir=\"ltr\"><a href=\"https://www.coindesk.com/business/2022/03/24/cosmos-protocol-archway-raises-21m-to-provide-developer-rewards/\" rel=\"nofollow\"><br></a></p>\n<p dir=\"ltr\"><strong>How we work</strong></p>\n<p dir=\"ltr\">We have team members working worldwide, from the Americas, Europe to the Middle East and Asia. We leverage agile methodologies to move quickly and stay focused. Communication is vital to us, and we rely heavily on Slack, Google Workspace, Notion, and GitHub to help us stay in sync. Most of the technology we build is free and open source.</p>\n<p dir=\"ltr\">This role is a full-time remote position, and you’re free to work from anywhere. Be advised that most team meetings occur between 6:30 am and 10:00 am Pacific Time (UTC-8/-7). If you're applying from a location where these hours are outside your usual working hours, we expect you to adapt to our meeting times.<br><br><strong><br></strong><strong>About the Role</strong></p>\n<p dir=\"ltr\">Phi Labs is seeking a talented and motivated <strong>Business Development Lead</strong> to join our global team.</p>\n<p dir=\"ltr\">We are looking for self-starters and mission-driven individuals to join us as we expand Archway across Web3. The ideal candidate for this role takes initiative and ownership over their work, thrives in fast-paced and highly collaborative remote settings, and is capable of rapidly adapting to evolving needs as required. You'll be at the helm of pioneering Web3 solutions on top of one of the most developer-friendly blockchain in the Cosmos ecosystem. You will work closely with our team to bring users, experienced teams, capital providers/funds, exchanges, wallets, infrastructure providers, and novel primitives to the Archway, engaging with groups at the earliest stages in their development and identifying opportunities to play a key role in the broader ecosystem.<br><br><br></p>\n<p dir=\"ltr\"><strong>What’s in it for you</strong></p>\n<p dir=\"ltr\">📍 Remote-first company with company off-sites and retreats</p>\n<p dir=\"ltr\">🌎 Flexible, dynamic environment within a diverse international team</p>\n<p dir=\"ltr\">🧑‍💻 The scope to create and build high-impact work that makes a difference in the Cosmos ecosystem and blockchain industry as a whole</p>\n<p dir=\"ltr\">💸 6 month contract to hire. Attractive compensation package with a token allocation after 6 months</p>\n<p dir=\"ltr\">✈️ Generous time off to rest, recharge, and be your best<br><br></p>\n<p dir=\"ltr\"><strong>What you will need</strong></p>\n<ul style=\"\">\n<li dir=\"ltr\" style=\"\">\n<p>Global work experience is required, specifically within Europe/APAC.</p>\n</li>\n<li dir=\"ltr\" style=\"\">\n<p>15 years experience with a focus on business development. 3+ yrs crypto experience.</p>\n</li>\n<li dir=\"ltr\" style=\"\">\n<p>Demonstrated experience in leading sales teams and developing market strategies.</p>\n</li>\n<li dir=\"ltr\" style=\"\">\n<p>Master at processes, frameworks, deal funnels</p>\n</li>\n<li dir=\"ltr\" style=\"\">\n<p>Strong understanding of the crypto market, DeFi, and traditional finance.</p>\n</li>\n<li dir=\"ltr\" style=\"\">\n<p>Experience working with commercial agreements, including creating and negotiating agreements outside of standard sales contracts</p>\n</li>\n<li dir=\"ltr\" style=\"\">\n<p>Experience developing and closing partner opportunities globally</p>\n</li>\n<li dir=\"ltr\" style=\"\">\n<p>A deep and relevant network including industry leaders and executives</p>\n</li>\n<li dir=\"ltr\" style=\"\">\n<p>Thorough knowledge of the current DeFi, NFT-fi, GameFi, etc landscapes in the on-chain ecosystem</p>\n</li>\n</ul>\n<div>\n<p dir=\"ltr\"><strong> </strong></p>\n<p dir=\"ltr\"><strong>Nice to have skills</strong></p>\n<ul style=\"\">\n<li dir=\"ltr\" style=\"\">\n<p dir=\"ltr\">Familiarity or keen interest in Rust and CosmWasm for smart contract development.</p>\n</li>\n<li dir=\"ltr\" style=\"\">\n<p dir=\"ltr\">Good communication skills + strong english skills</p>\n</li>\n<li dir=\"ltr\" style=\"\">\n<p dir=\"ltr\">Collaborative team spirit.</p>\n</li>\n<li dir=\"ltr\" style=\"\">\n<p dir=\"ltr\">Problem-solving attitude and passion for innovation</p>\n</li>\n<li dir=\"ltr\" style=\"\">\n<p dir=\"ltr\">Be a self-starter and able to work independently.</p>\n</li>\n<li dir=\"ltr\" style=\"\">\n<p dir=\"ltr\">Highly organized with great attention to detail.</p>\n</li>\n<li dir=\"ltr\" style=\"\">\n<p dir=\"ltr\">Strong DegenScore</p>\n</li>\n</ul>\n</div>\n<p> </p>\n<img src=\"https://remotive.com/job/track/1889523/blank.gif?source=public_api\" alt=\"\"/>","tags":"[\"crypto\",\"open source\",\"blockchain\",\"agile\",\"rust\",\"business development\",\"infrastructure\",\"github\",\"REST\"]","pubDate":"2024-01-24 01:21:14.000","link":"https://remotive.com/remote-jobs/business/head-of-business-development-1889523","savedDate":"2024-01-25 07:31:36.315","slug":"head-of-business-development-philabs-393"},{"id":7181427226,"title":"Sales Engineer for Hosting - REMOTE/ Work Anywhere","company":"CloudLinux","image":"https://pbs.twimg.com/profile_images/696718028084482050/ymY3OEPk_400x400.png","description":"<p></p><p>We are seeking for seasoned, passionate, hardworking and overachieving Sales Engineer. As our Sales Engineer at Cloudlinux, you will be instrumental in driving our success in the web hosting technology sector. In this role, you will utilize your technical expertise and enthusiasm for technology to provide critical support and guidance to business stakeholders across the European region. This position offers a unique opportunity to work with some of the industry’s leading experts, navigate complex challenges, and make a significant impact in a flexible, remote work environment.</p><p>CloudLinux is a globally-operating, remote-first company. Our guiding principles drive us: we prioritize doing the right thing, putting our employees first, embracing remote work, and delivering high-volume, low-cost Linux infrastructure and security products. These products are designed to enhance operational efficiency for businesses. Our team is committed to mutual support, with every member contributing to the success of all. We proudly stand as a truly great place to work.</p><p>Join our team at Cloudlinux and be a part of transforming the technology landscape. Discover more about our projects and company culture at<a href=\"https://cloudlinux.com/\" rel=\"nofollow noreferrer noopener\" class=\"external\"> cloudlinux.com</a>, and take the next step in advancing your career with us.</p><p></p><p><strong>As our Sales Engineer, you will be responsible for:</strong></p><ul> <li>Leading technical discussions throughout the sales cycle, effectively engaging with executive-level business stakeholders and technical experts.</li> <li>Gaining a comprehensive understanding of the CloudLinux ecosystem to deliver insightful consultative services.</li> <li>Continuously enhancing your technical knowledge and capabilities in collaboration with our Product and Engineering teams.</li> <li>Providing technical leadership to partners, focusing on integration strategies and project scope.</li> <li>Working closely with Sales, Customer Success, and Product teams to ensure successful project implementations.</li> <li>Integrating internal processes and requirements early in project planning to align with company standards.</li> <li>Contributing feedback to our Product teams, aiding in the development of market-aligned products.</li> <li>Conducting client demonstrations and proposals, showcasing CloudLinux’s strengths to various stakeholders.</li> <li>Implementing and recommending sales tools to enhance productivity and sales processes.</li> <li>Keeping up-to-date with industry trends and standards, ensuring CloudLinux maintains its market leadership.</li> <li>Assisting in the smooth onboarding of new clients through effective teamwork and collaboration.</li> <li>Liaising with product teams, providing industry feedback to inform future product development.</li> </ul><h3>Requirements: </h3><p><strong>To be successful in this role you should have:</strong></p><ul> <li>3-5 years of sales engineering experience in a technology environment, with a focus on web hosting technology.</li> <li>Demonstrated excellence in performance and a consultative sales approach.</li> <li>Efficient and effective prospect qualification skills.</li> <li>In-depth understanding of CloudLinux technology and the ability to build substantial relationships with customers.</li> <li>Creative mindset, proactive attitude, and strong technical skills.</li> <li>Ability to excel in a fast-paced and ambiguous environment.</li> <li>Outstanding presentation and negotiation abilities, with a talent for building credibility and rapport.</li> <li>Deep passion for startups and new technology businesses.</li> <li>Excellent English communication skills, both verbal and written, combined with charisma, empathy, humility, and humor.</li> <li>Strong commitment to personal and professional growth, with a team-oriented mindset and a balanced approach to teaching and learning.</li> </ul><h3>Benefits: </h3><p><strong>What's in it for you?</strong></p><ul> <li>A focus on professional development; </li> <li>Interesting and challenging projects</li> <li> Flexible working hours</li> <li>Paid one month vacation per year and unlimited sick leave</li> <li>Medical insurance reimbursement</li> <li>Co-working and gym/sports reimbursement</li> <li>The opportunity to receive a reward for the most innovative idea that the company can patent</li> </ul><p><em>By applying for this position, you agree with </em><a href=\"https://cloudlinux.com/privacy-policy\" rel=\"nofollow noreferrer noopener\" class=\"external\"><em>Cloudlinux Privacy Policy</em></a><em> and give us your consent to maintain and process your personal data with this respect. Please read our Privacy Policy for more information.</em></p>","tags":"[\"engineering\"]","pubDate":"2024-01-24 00:00:00.000","link":"https://apply.workable.com/cloudlinux-1/j/D17464C098","savedDate":"2024-01-25 07:31:36.316","slug":"sales-engineer-for-hosting-remote-work-anywhere-cloudlinux-7803"},{"id":6733866350,"title":"Business Development Manager for Hosting- REMOTE/ Work Anywhere","company":"CloudLinux","image":"https://pbs.twimg.com/profile_images/696718028084482050/ymY3OEPk_400x400.png","description":"<p>CloudLinux is a leading global, remote-first company specializing in high volume, low-cost Linux infrastructure and security products. We prioritize our employees, embrace remote working, and are committed to doing the right thing. Our team is collaborative and supportive, ensuring everyone's success and making CloudLinux a great place to work.</p><p>We are seeking an experienced hosting sales professional with a background in selling Linux products. As a Sales Representative at CloudLinux, you will be instrumental in driving our sales initiatives and expanding our presence in the hosting sector. You will mainly work with exciting and dynamic customers, requiring a proactive and engaging approach.&nbsp;</p><p>Join us to be part of a company that is not just about business, but about making a meaningful impact in the Linux and hosting industry. At CloudLinux, you'll be part of a team that supports each other and works together towards shared success.</p><p><strong>As our Sales Representative you will be responsible for:</strong></p><ul> <li>Regularly interact with new and existing customers who are dynamic and enthusiastic about our products.</li> <li>Utilize your proactive, 'hunter' approach to initiate contact with potential clients and explore new sales opportunities.</li> <li>Effectively present our value proposition to decision-makers and key personnel within organizations.</li> <li>Manage a pipeline of opportunities in Hubspot, and maintain regular communication on progress and status.</li> <li>Identify prospects who can act as public advocates for CloudLinux (e.g., through testimonials, case studies).</li> <li>Work in sync with company leadership to identify and pursue new market opportunities.</li> <li>Collaborate with SEs and Customer Success Managers to ensure successful customer adoption and onboarding.</li> </ul><h3>Requirements: </h3><p><strong>To be successful in this role you should have:</strong></p><ul> <li>3- 5 years in sales with a track record of high close rates and quick sales cycles.</li> <li>Understanding of Linux infrastructure and/or security software in the hosting industry.</li> <li>Exceptional communication, organization, collaboration, and attention to detail.</li> <li>Ability to balance multiple tasks and prioritize effectively.</li> <li>Proven ability to build and maintain relationships, mitigate risks, and drive successful deal closures.</li> <li>Familiarity with Hubspot is a plus.</li> </ul><ul> <li>Fluent in English.</li> <li>Hunter Personality: Strong initiative and drive to pursue new sales leads and business opportunities.</li> <li>Passionate and knowledgeable about technology, particularly in hosting and Linux domains.</li> <li>Ability to handle data entry tasks with a focus on upselling and cross-selling.</li> </ul><h3>Benefits: </h3><p><strong>What's in it for you?</strong></p><ul> <li>A focus on professional development; </li> <li>Interesting and challenging projects</li> <li>Flexible working hours</li> <li>Paid one month vacation per year and unlimited sick leave</li> <li>Medical insurance reimbursement</li> <li>Co-working and gym/sports reimbursement</li> <li>The opportunity to receive a reward for the most innovative idea that the company can patent</li> </ul><p><em>By applying for this position, you agree with </em><a href=\"https://cloudlinux.com/privacy-policy\" rel=\"nofollow noreferrer noopener\" class=\"external\"><em>Cloudlinux Privacy Policy</em></a><em> and give us your consent to maintain and process your personal data with this respect. Please read our Privacy Policy for more information.</em></p>","tags":"[]","pubDate":"2024-01-24 00:00:00.000","link":"https://apply.workable.com/cloudlinux-1/j/C8A7BB1468","savedDate":"2024-01-25 07:31:36.316","slug":"business-development-manager-for-hosting-remote-work-anywhere-cloudlinux-2174"},{"id":5482293523,"title":"Head of Finance","company":"JobRack","image":"https://remotive.com/job/1894583/logo","description":"<p><img height=\"48px\" src=\"https://lh7-us.googleusercontent.com/Z-GD_xS4Z9aqFc27hkIPPnvHWtPiLB3Ex2B32iBPY5SgsS5pThEK-uJzBLpPl_5I5-jEImQ8CXTf-5AMpC_RnC95hRTbwlM0Tsbjwg19O8MVYt9TtGbyyzbaEnsELB3eJbs85oMyUYSKLL2qSHLqg5o\" style=\"width: 552px; height: 48px;\" width=\"552px\"></p>\n<p>Here’s a <a class=\"external\" href=\"https://app.videopeel.com/share/3661568b-6d63-4ba6-97d2-9519f9d27632/lrf2rbph.mp4\" rel=\"nofollow\">quick introduction</a> to Munk Pack from their founders.</p>\n<p><a class=\"external\" href=\"https://store.munkpack.com/\" rel=\"nofollow\">Munk Pack</a> is a natural food company founded in 2013 that is on a mission to reduce chronic illness through low sugar nutrition. Their 1g sugar, plant-based Nut &amp; Seed Bars and Granola Bars are found in 11,000+ locations nationwide in the US as well as on E-Commerce.</p>\n<p> </p>\n<p>Munk Pack’s high-quality snacks not only boast exceptional taste but also avoid spiking blood sugar levels. Their snacks are so irresistibly delicious that you'd hardly believe they contain only 1 gram of sugar! </p>\n<p> </p>\n<p>Munk Pack’s Core Values: </p>\n<ul style=\"\">\n<li style=\"\">Team first, no ego.</li>\n<li style=\"\">Can do attitude.</li>\n<li style=\"\">Excellence.</li>\n<li style=\"\">Growth-orientation.</li>\n<li style=\"\">Honesty and learning from mistakes.</li>\n<li style=\"\">Nimbleness and efficiency.</li>\n</ul>\n<p> </p>\n<p> </p>\n<p>Join us at Munk Pack, where health-conscious meets mouthwatering, and be a part of their mission to redefine the world of snacks.</p>\n<p> </p>\n<p> </p>\n<p><img height=\"41px\" src=\"https://lh7-us.googleusercontent.com/NZUZWCa6tnw9X1WOwTktDRXziiVc9V0qxeyPW0oiYvUGDE2COR_Wo6pnMena_Lz0SQy4n4Kp482FljVhXWgb74qgyAfPcbP565i07cfrAqsY4IlV2UHJaN76VjnMBXAWHIEbWQ8G4NpMO23naEzRy1U\" style=\"width: 579px; height: 41px;\" width=\"579px\"></p>\n<p>As a Head of Finance, the purpose is to take charge of all things finance and accounting, playing a pivotal role in the company's success. Collaborating seamlessly with leaders across departments, you'll report directly to the CEO and co-founders.</p>\n<p>Key responsibilities:</p>\n<p>🧾 Lead the charge in financial planning and analysis, crafting strategies that drive the company's fiscal success.</p>\n<p>📦 Managing budgets and ensuring cash flows smoothly through the financial channels.</p>\n<p>📑 Lead the company’s monthly close process, overseeing accounting with precision.</p>\n<p>💼 Variance analysis and providing insight that guides decision-making.</p>\n<p>📊 Provide finance and accounting support to the heads of Sales, Marketing, and Operations.</p>\n<p>🗓️ Varied financial functions across the company, bringing your expertise to every aspect of their finances.</p>\n<p>Working Hours ⏰: Full time position based on the US East Coast (EST), but flexibility is embraced as long as there is enough overlap.</p>\n<p> </p>\n<p><strong>Requirements</strong></p>\n<p> </p>\n<p><img height=\"55px\" src=\"https://lh7-us.googleusercontent.com/ZMlijXtI6s4DE-jITpSCOPqhw25R92Z43npWS1epySZ0QSNjnnpjCzXzy8EFT4GXcp2NGK3ooQRqg7hN48BJ7IA8o_A_uNHoBOQn-9cCthSQIg23NxLTOucHPJRyNLfHv9ZRzWLP3VLIsyUjmef4GgY\" style=\"width: 628px; height: 55px;\" width=\"628px\"></p>\n<p>To excel in this role, you need to have: </p>\n<p> </p>\n<p>✅ Experience in finance and accounting leadership within the dynamic Consumer Packaged Goods sector.</p>\n<p>✅ Proficiency in FP&amp;A (Financial Planning &amp; Analysis).</p>\n<p>✅ Experience supporting, improving, or implementing finance and accounting systems and processes.</p>\n<p>✅ Expertise in financial modelling in Microsoft Excel.</p>\n<p>✅ NetSuite experience.</p>\n<p>As the Ideal Candidate, you should be:</p>\n<p>✅ Intelligent.</p>\n<p>✅ Kind.</p>\n<p>✅ Accurate.</p>\n<p>✅ A Multitasker.</p>\n<p>✅ Enthusiastic to work with a startup.</p>\n<p>✅ Proactive.</p>\n<p>Brownie Points for:</p>\n<p>✅ Experience as a Controller, then progressing into a leadership finance role.</p>\n<p> </p>\n<p><strong>Benefits</strong></p>\n<p> </p>\n<p><img height=\"43px\" src=\"https://lh7-us.googleusercontent.com/zfinzJr12O6aqLwU0GCCgFBHZjweKeXkY1tnemLp_DJf6xS-hMrnfsLlNtp0a7NnG1Bmvp9ucCrHw6hwoX4JezfORhj7IVXdm_A2zLFwAH_1F2YgCWBUeRuulXuBbHHBKbb_f4KBhy22PO4dQ0yWdgc\" style=\"width: 605px; height: 43px;\" width=\"605px\"></p>\n<p>What’s in it for you?</p>\n<p> </p>\n<ul style=\"\">\n<li style=\"\">💰 Competitive Salary: Earn a monthly salary of $4,500-$5,500.*</li>\n<li style=\"\">🌴 Global Work Flexibility: Work remotely from anywhere in the world.</li>\n<li style=\"\">🌟 Opportunities for Growth.</li>\n<li style=\"\">🌐 Performance-based bonuses.</li>\n<li style=\"\">🌴 PTO: Paid time-off policy that accumulates monthly – granting you 1 day off for every month worked, along with an additional 5 days for paid holidays.</li>\n</ul>\n<p>*Please note that this is a gross salary and that you are responsible for any tax-related procedures in your country of residence. We kindly ask you to apply only if you are happy to work remotely as an independent contractor.</p>\n<p><img height=\"42px\" src=\"https://lh7-us.googleusercontent.com/tcwcOvKzQm12q7Sg_e8w6sVPOiVrXqzB374DKbcw0opND_m_8q3IrbPUeG-6pFhUMGzLmtoSv-Ip0HlB62CUAFgm30DCPyk8JcZnyraJleZPclUXoBAMofKb5Q02FuvTnT_nFg_KBWA8RLJJ5-asUCA\" style=\"width: 633px; height: 42px;\" width=\"633px\"></p>\n<p> </p>\n<p>The JobRack team are working with Munk Pack to help them find their new team member. </p>\n<p> </p>\n<p>The hiring process for this position will include the following steps:</p>\n<p> </p>\n<ol style=\"\">\n<li style=\"\">Completing the application form on JobRack.</li>\n<li style=\"\">Recording a short video introduction of yourself.</li>\n<li style=\"\">If shortlisted, completing test tasks.</li>\n<li style=\"\">Attending video interviews to discuss your previous experience and the new role in more detail.</li>\n</ol>\n<p> </p>\n<p>The JobRack team has gained a full understanding of the Munk Pack’s needs and will review, filter, screen and test candidates in line with this.</p>\n<p> </p>\n<p>To ensure your application is considered, take the time to carefully read the job description and submit a high-quality application.</p>\n<p> </p>\n<p>We will, of course, provide you with feedback throughout the process.</p>\n<p> </p>\n<p>At the request of Munk Pack applications for this position must be submitted through JobRack and direct contact with the employer is not allowed. If you have any questions, please contact JobRack at: john@jobrack.eu</p>\n<p><br><br></p>\n<p>Please note that this position requires 100% commitment and is not suitable for those seeking a side job, freelance work, or part-time employment. It is important to only apply if you intend this to be your primary and only full-time job. Any attempts to work multiple full-time jobs without the knowledge of your employer may result in termination and a ban from applying to other jobs on the JobRack site.</p>\n<p><br><br></p>\n<p>We look forward to receiving your application! </p>\n<p> </p>\n<p>To make sure you receive updates on your application please add john@jobrack.eu to your email address book.  </p>\n<p><br>Got questions about working remotely? Check out JobRack’s FAQ for answers to everything you might want to know. <a class=\"external\" href=\"https://jobrack.eu/jobseeker-faq\" rel=\"nofollow\">https://jobrack.eu/jobseeker-faq</a></p>\n<img src=\"https://remotive.com/job/track/1894583/blank.gif?source=public_api\" alt=\"\"/>","tags":"[\"accounting\",\"excel\",\"video\",\"startup\",\"NetSuite\"]","pubDate":"2024-01-23 21:20:48.000","link":"https://remotive.com/remote-jobs/finance-legal/head-of-finance-1894583","savedDate":"2024-01-25 07:31:36.316","slug":"head-of-finance-jobrack-6687"},{"id":8845155179,"title":"Junior Machine Learning Engineer","company":"Jooble","image":"https://remotive.com/job/1884865/logo","description":"<p><strong>Jooble is a Ukrainian product IT company</strong> that ranks in the top 10 most visited websites in the world in the Jobs and Employment segment. The company's main product is a job search website, which is used by around 90 million users in 69 countries around the world each month, both employers and job seekers. In addition, Jooble is developing an ecosystem of related products and investing in startups based on employment through Jooble Venture Lab.</p>\n<p><strong>Jooble is a remote-first company</strong> with 355 professionals who live in 24 countries and speak 25 languages. We believe that talented people can create cool projects no matter where they are!<br><br><strong>We are looking for a role to build our product — Jooble Job Aggregator</strong></p>\n<ul style=\"\">\n<li style=\"\"><a href=\"http://jooble.org/\" rel=\"nofollow\">Jooble.org</a> is the main product. We gather vacancies from 140 000 sources, including corporate websites, social networks, classifieds, and other resources. This product is available in 69 countries.</li>\n<li style=\"\">Our user is a job seeker whom we help find a relevant job opportunity.</li>\n<li style=\"\">Our client is the marketing manager from a job board whom we give an opportunity to attract job seekers.</li>\n<li style=\"\">Our partners` websites help us increase traffic volume by posting our vacancies/widgets. Users visit our website, while partners receive rewards.</li>\n</ul>\n<p>We seek a talented and motivated <strong>Junior Machine Learning Engineer</strong> to join our team in supporting our Machine Learning and Big Data initiatives. As a member of our Search Engine team, you will work closely with cross-functional teams to develop and implement new systems, maintain and optimise existing models and pipelines, and ensure high data quality.</p>\n<p><strong>Responsibilities:</strong></p>\n<ul style=\"\">\n<li style=\"\">Integrate SOTA machine learning frameworks to the production environment;</li>\n<li style=\"\">Design, develop and launch efficient and reliable ETL data pipelines;</li>\n<li style=\"\">Optimize existing pipelines and maintain all domain-related data pipelines;</li>\n<li style=\"\">Partner with machine learning engineers to understand data needs and build high-performance scalable data warehouses;</li>\n<li style=\"\">Intelligently designed data models for optimal storage and retrieval;</li>\n<li style=\"\">Deploy inclusive data quality checks to ensure the accuracy of data;</li>\n<li style=\"\">Work closely with the DevOps team to integrate CI/CD into existing services.</li>\n</ul>\n<p><strong>Requirements:<br></strong></p>\n<ul style=\"\">\n<li style=\"\">Bachelor's or Master's degree in Computer Science;</li>\n<li style=\"\">Ability to estimate the complexity of base algorithms;</li>\n<li style=\"\">Strong background in statistics and math;</li>\n<li style=\"\">Understanding what the OOP and Design Patterns are;</li>\n<li style=\"\">Experience with Linux systems and administration tools, Bash and Shell scripting;</li>\n<li style=\"\">Basic knowledge of machine learning algorithms is a plus;</li>\n<li style=\"\">A willingness to learn and apply new cutting-edge technologies in information retrieval, big data and data science fields.</li>\n</ul>\n<p><strong>What makes work at Jooble comfortable?</strong></p>\n<p><strong>Work from anywhere</strong><br>All employees can work in the office or remotely. Also, we have hubs and offices. Everyone who is abroad can visit our space in Warsaw. For those in Ukraine, you can visit offices in Kyiv and Lutsk. The company provides all the necessary work equipment, whether you work in the office or remotely.</p>\n<p><strong>Flexible working hours</strong><br>The 8-hour working day and you choose when to start. What matters to us is the result, not the number of hours spent at the workplace.</p>\n<p><strong>Education</strong><br>We cover the cost of training, courses, webinars.</p>\n<p><strong>Healthcare</strong><br>We provide health insurance for everyone who has worked for more than 3 months. For colleagues who are abroad, financial support is provided in case of medical expenses.</p>\n<p><strong>Mental Health</strong><br>We are cooperating with the well-being service. It provides employees with psychological consultations or a 50% discount on different psychologists' services.</p>\n<p><strong>Vacation and Sick Leave</strong><br>24 days of annual leave, paid sick days, + the possibility to take 4 additional sick days without a medical certificate.</p>\n<p><strong>Our culture</strong><br>There is always a fantastic team behind a successful project. We'd really like our people to feel that Jooble's workplace promotes freedom, respect, support, and honesty. We always give feedback to each other, and we believe it helps us develop personally and our products in general.</p>\n<p><strong>Ukraine is the capital of great people! </strong><br>From the first day of the war, Jooble actively supports and organises fundraisings. Our colleagues protect our country and volunteer what is, for sure, important efforts for Ukraine today.<br>If, in the job description, you see yourself and really want to become a member of our team, please send us your CV, and our recruiter will reach you. </p>\n<p><strong><a href=\"https://www.linkedin.com/company/jooble\" rel=\"nofollow\" title=\"https://www.linkedin.com/company/jooble\"><u>LinkedIn</u></a></strong></p>\n<p><strong><a href=\"https://www.instagram.com/jooblelife/\" rel=\"nofollow\" title=\"https://www.instagram.com/jooblelife/\"><u>Instagram</u></a></strong></p>\n<p> </p>\n<img src=\"https://remotive.com/job/track/1884865/blank.gif?source=public_api\" alt=\"\"/>","tags":"[\"big data\",\"data science\",\"AI/ML\",\"CI/CD\",\"healthcare\",\"bash\",\"OOP\",\"ETL\",\"scripting\",\"Linux/Unix\",\"computer science\",\"statistics\",\"shell\",\"insurance\",\"mental health\"]","pubDate":"2024-01-23 15:21:17.000","link":"https://remotive.com/remote-jobs/software-dev/junior-machine-learning-engineer-1884865","savedDate":"2024-01-25 07:31:36.316","slug":"junior-machine-learning-engineer-jooble-5594"},{"id":9719802608,"title":"Chief Commercial Officer","company":"Career Renew","image":"https://remotive.com/job/1891053/logo","description":"<p>Career Renew is recruiting for one of its clients, a project that aims to develop enabling ecosystems in the countries of the LAC region to expand the use of digital wallets, a Chief Commercial Officer - Remote position.</p>\n<p> </p>\n<p><strong>The chosen candidate will play a pivotal role in driving revenue growth, spearheading sales initiatives, cultivating strategic business development, directing marketing endeavors, overseeing brand management, and enhancing customer engagement. This key leadership position is integral to positioning us as a prominent force in the global landscape of web3 and blockchain services and solutions.</strong></p>\n<p> </p>\n<p>This role requires to be a dynamic and results-oriented leader with a profound understanding of commercial and marketing strategies, coupled with knowledge of blockchain technology. The selected individual will be tasked with overseeing the commercialization and marketing endeavors of our blockchain infrastructure services and solutions, driving the execution of strategic partnerships to further augment the organization's impact and reach in the industry.</p>\n<p>The CCO will play a key role in extending our position by identifying and leveraging revenue opportunities, fostering strategic alliances, and placing a strong emphasis on marketing, brand management, and customer engagement throughout Latin American and Caribbean region. The objective is to enhance our position as a leader in blockchain infrastructure services and solutions, contributing to economic development and sustainable practices in the LAC region.</p>\n<p> </p>\n<div class=\"h3\"><strong>Main Activities</strong></div>\n<p> </p>\n<p>The CCO will have the following responsibilities and carry out the following activities:</p>\n<p>Commercial Strategy:</p>\n<ul style=\"\">\n<li style=\"\">Develop and execute comprehensive commercial strategies to maximise sales and profitability, aligning with the organisational objectives.</li>\n</ul>\n<ul style=\"\">\n<li style=\"\">Marketing Strategy: Develop and implement marketing strategies to promote the organisation's products or services. This includes branding, advertising, public relations, and market research.</li>\n</ul>\n<ul style=\"\">\n<li style=\"\">Partnerships and Alliances: Cultivate and manage strategic relationships with stakeholders to create new business opportunities and revenue streams.</li>\n</ul>\n<ul style=\"\">\n<li style=\"\">Market Analysis and Expansion: Conduct market research to identify new business opportunities, market trends, and potential challenges.</li>\n</ul>\n<ul style=\"\">\n<li style=\"\">Utilize insights to refine and enhance our commercial approach. As well as, work on expanding the organisation's market presence, both geographically and within existing markets by identify new market opportunities and develop strategies for market penetration.</li>\n</ul>\n<ul style=\"\">\n<li style=\"\">Revenue Generation: Lead efforts to identify and capitalize on revenue streams, including fee-based services, licensing agreements, and partnerships, ensuring financial sustainability.</li>\n</ul>\n<ul style=\"\">\n<li style=\"\">Brand Management: Manage and enhance the organization's brand to create a positive brand image and ensure consistency in messaging across all marketing channels.</li>\n</ul>\n<ul style=\"\">\n<li style=\"\">Communication and Messaging: craft the overall communication strategy for the organization, ensuring alignment with the brand identity and resonance with the target audience.</li>\n</ul>\n<ul style=\"\">\n<li style=\"\">Sales and Business Development: oversee sales teams and involved in business development activities, such as, acquiring of new customers, expanding market share, and driving revenue from existing clients.</li>\n</ul>\n<ul style=\"\">\n<li style=\"\">Customer Relationships, Acquisition and Retention: Develop and implement a robust strategy for building and managing relationships with key clients and partners, attracting new customers, and retaining existing ones. Leverage effective marketing campaigns to drive customer engagement and foster loyalty.</li>\n</ul>\n<ul style=\"\">\n<li style=\"\">Communication and Advocacy: Represent us in relevant forums, conferences, and industry events. Effectively communicate our value proposition.</li>\n</ul>\n<p><strong>Requirements</strong></p>\n<p><strong>Technical Competencies</strong></p>\n<ul style=\"\">\n<li style=\"\">Bachelor’s degree in Marketing, Business, Economics, Finance, or a related field.</li>\n<li style=\"\">Advanced degree or relevant certifications are a plus.</li>\n<li style=\"\">Proven expertise in occupying leading role within commercial or marketing positions.</li>\n<li style=\"\">Deep understanding of the Latin American and Caribbean business landscape.</li>\n<li style=\"\">Experience in successfully implementing and driving impactful commercial or marketing strategies.</li>\n<li style=\"\">Strong network in the blockchain, fintech, and sustainability ecosystems will be desirable.</li>\n<li style=\"\">Exceptional communication and negotiation skills.</li>\n<li style=\"\">Entrepreneurial mindset with a results-driven approach.</li>\n</ul>\n<p><strong>Leadership Competencies</strong></p>\n<ul style=\"\">\n<li style=\"\">Strategic leadership with experience in developing and executing commercial or marketing strategies focused on achieving results and meeting objectives.</li>\n<li style=\"\">Experience in managing and leading teams, with the ability to motivate, train, and retain talent.</li>\n<li style=\"\">International experience, with previous experience in global organizations, international environments, and managing teams distributed across different geographic locations being desirable.</li>\n<li style=\"\">Desirable experience in introducing new technologies, processes, or solutions that have driven the success of previous organizations.</li>\n</ul>\n<p><strong>Other Competencies:</strong></p>\n<ul style=\"\">\n<li style=\"\">Proficiency in both Spanish and English, both spoken and written, is required.</li>\n<li style=\"\">Postgraduate studies related areas to the position will be highly regarded.</li>\n<li style=\"\">Proven professional experience related to the position, with a minimum of 6 years.</li>\n<li style=\"\">Experience across various sectors, enabling a broader perspective and adaptability to</li>\n</ul>\n<p>different multi-sector environments.</p>\n<ul style=\"\">\n<li style=\"\">Desirable knowledge of cutting-edge technologies, a track record of promoting</li>\n</ul>\n<p>technological innovation, and the ability to communicate effectively.</p>\n<ul style=\"\">\n<li style=\"\">Desirable experience in digital transformation, adoption of new technologies, and</li>\n</ul>\n<p>promotion of innovation.</p>\n<ul style=\"\">\n<li style=\"\">Experience or knowledge of Latin America and the Caribbean.</li>\n<li style=\"\">Strong interpersonal and effective communication skills.</li>\n<li style=\"\">Enthusiastic and motivated personality.</li>\n<li style=\"\">Ability to multitask effectively.</li>\n<li style=\"\">Creativity, passion, initiative, flexibility, enthusiasm, proactivity, and discretion.</li>\n</ul>\n<p><strong>Benefits</strong></p>\n<ul style=\"\">\n<li style=\"\"><strong>Contract Type:</strong> International Consulting</li>\n<li style=\"\"><strong>Duration:</strong> 12 months, scoped to renew if satisfactory performance.</li>\n<li style=\"\"><strong>Work Location:</strong> Remote, based on the consultant's place of residence.</li>\n<li style=\"\"><strong>Working Hours and Time Zone:</strong> Washington D.C., USA (GMT-5), with a flexibility of +/- 2 hours.</li>\n<li style=\"\"><strong>Travel/Visits:</strong> Travel expenses deemed necessary for performing the duties will be reimbursed separately.</li>\n</ul>\n<img src=\"https://remotive.com/job/track/1891053/blank.gif?source=public_api\" alt=\"\"/>","tags":"[\"blockchain\",\"research\",\"market research\",\"advertising\",\"public relations\",\"brand design\",\"business development\",\"marketing strategy\",\"partnerships\",\"fintech\",\"infrastructure\",\"travel\"]","pubDate":"2024-01-23 05:21:08.000","link":"https://remotive.com/remote-jobs/finance-legal/chief-commercial-officer-1891053","savedDate":"2024-01-25 07:31:36.316","slug":"chief-commercial-officer-career-renew-6434"}]