[{"id":1181661923,"title":"Platform Engineer (Remote - Work from Anywhere)","company":"Xapo Bank","image":"https://avatars.githubusercontent.com/u/6930305?s=200&v=4","description":"&lt;div class=&quot;content-intro&quot;&gt;&lt;p style=&quot;text-align: left;&quot;&gt;&lt;span style=&quot;font-weight: 900;&quot;&gt;Work from anywhere, impact everywhere&amp;nbsp;&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;Diversity is at the heart of who we are at Xapo Bank. We’re a fully distributed team of over 140 Xapiens that work remotely from 40+ countries around the world.&amp;nbsp;&lt;/p&gt;\n&lt;p&gt;Our beginning: A world that enjoys economic freedom and wealth protection, no matter where you live or who is running your country. This is the dream that drove Wences Casares, our Founder and Chairman, to quietly transform the world of banking.&lt;/p&gt;\n&lt;p&gt;To achieve that, we search the world for the best people for the job. We work hard, think globally, and inspire each other to learn and grow. We are committed to changing the way things are done.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Risk is inherent in all of our business activities and managing risk well is the responsibility of every Xapien. Sound risk management enables us to serve our customers and deliver value for our shareholders, and helps make Xapo a great place to work.&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&amp;nbsp;&lt;/p&gt;\n&lt;p style=&quot;text-align: left;&quot;&gt;&lt;em&gt;&lt;span style=&quot;font-weight: 500;&quot;&gt;Although we are headquartered in Gibraltar, this is a full time, 100% remote position&amp;nbsp;&lt;br&gt;&lt;/span&gt;&lt;/em&gt;&lt;em&gt;&lt;span style=&quot;font-weight: 500;&quot;&gt;Work from anywhere!&lt;/span&gt;&lt;/em&gt;&lt;/p&gt;\n&lt;p style=&quot;text-align: left;&quot;&gt;&amp;nbsp;&lt;/p&gt;&lt;/div&gt;&lt;p&gt;&lt;strong&gt;&lt;em&gt;Position overview&lt;/em&gt;&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;A cloud native application platform automates infrastructure and service&amp;nbsp; provisioning and configuration, dynamically allocating and reallocating resources at deployment time based on the needs of the application. Building on a cloud native runtime optimises application life-cycle management, including scaling to meet demand, resource utilisation, orchestration across available resources, and recovery from failures with minimum downtime.&lt;/p&gt;\n&lt;p&gt;You will be at the driving seat of the developer experience platform team, by creating a self-serve, seamless and secure journey for Engineering and allowing them for shorter Speed to Market.&lt;/p&gt;\n&lt;p&gt;This approach reduces cognitive load on teams (they have less to think about) and it creates a standard way of building software. This brings additional benefits with onboarding new developers or adding additional development teams. The platform team also has a role to play in developer mentoring and support; helping development teams understand how good cloud native software operates.&amp;nbsp;&lt;/p&gt;\n&lt;p&gt;In successful software organisations, development teams can consume core services in a self-service manner from a central platform team.&amp;nbsp;&lt;/p&gt;\n&lt;p&gt;Examples of such services include:&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;Infrastructure provisioning (Compute, Network, Storage)&lt;/li&gt;\n&lt;li&gt;CI/CD pipelines and underlying tooling&lt;/li&gt;\n&lt;li&gt;Standardised mechanisms to log, monitor and troubleshoot their services in all environments&lt;/li&gt;\n&lt;li&gt;Codified templates to create new services in line with agreed architectural patterns&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;We rely on the following tools and technologies.&amp;nbsp;&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;Terraform&lt;/li&gt;\n&lt;li&gt;AWS (ECS, RDS, SQS, VPC, KMS)&lt;/li&gt;\n&lt;li&gt;GCP (Cloud run, Cloud functions, Datastream, BigQuery)&lt;/li&gt;\n&lt;li&gt;Docker&lt;/li&gt;\n&lt;li&gt;GitHub and GitHub Actions&lt;/li&gt;\n&lt;li&gt;Newrelic/PagerDuty&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;&lt;strong&gt;&lt;em&gt;Responsibilities&lt;/em&gt;&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;The development community are your core customers. The driving principles that underpin this function are:&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;A focus on the ongoing sustainable maintenance and operability of our developer platform.&amp;nbsp;&lt;/li&gt;\n&lt;li&gt;Adopting cloud native principles and a focus upon relentless automation and testing of change.&lt;/li&gt;\n&lt;li&gt;We will only operate what we absolutely must, favour buy over build and SaaS over on-prem.&lt;/li&gt;\n&lt;li&gt;Providing high quality fast feedback to development teams by having business incremental deliverables.&lt;/li&gt;\n&lt;li&gt;Building a developer journey that is architected to scale and handle change, be that new services, new customers, new regulations, new tooling or a change in demand.&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;You will:&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;Proactively work with stakeholders like Engineering Team, Product and Security, to identify and build a robust, self-serve and scalable framework of automated actions&lt;/li&gt;\n&lt;li&gt;Be part of a technical decision group, as your inputs will influence the Platform landscape and roadmap.&lt;/li&gt;\n&lt;li&gt;Deliver self-serve capabilities to our developers that allow them to provision, manage and operate their own infrastructure and services deployment..&lt;/li&gt;\n&lt;li&gt;Build high quality code into everything we do by following industry best practices and at the same time being able to understand what Xapo needs and make decisions according to it.&lt;/li&gt;\n&lt;li&gt;Provide coaching and mentoring to colleagues around how to build sustainable services and automated pipelines.&lt;/li&gt;\n&lt;li&gt;Keep security and compliance at the forefront of all you do.&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;&lt;strong&gt;&lt;em&gt;Skills needed&lt;/em&gt;&lt;/strong&gt;&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;Strong Problem solving skills and a growth mindset, the ability to learn and use the best in class technology and tools to address our requirements.&lt;/li&gt;\n&lt;li&gt;A good technical knowledge of software and systems – able to dive into details with engineers and speak in plain language with stakeholders.&lt;/li&gt;\n&lt;li&gt;Stays abreast of current technology developments and has demonstrated the ability to retain competitive advantage by implementing relevant technologies in software products.&lt;/li&gt;\n&lt;li&gt;Experience building and shaping developer’s environment as code and using pipelines, solid expertise in GitHub and GitHub action is mandatory.&lt;/li&gt;\n&lt;li&gt;Ideally is comfortable in a variety of scripting and coding languages.&lt;/li&gt;\n&lt;li&gt;Strong knowledge and experience in designing, deploying, and administering complex cloud environments. Preferably AWS or GCP certified and has a good understanding of cloud architecture best practices.&lt;/li&gt;\n&lt;li&gt;Strong understanding of Docker and best practices.&amp;nbsp;&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;&lt;strong&gt;&lt;em&gt;Other requirements&lt;/em&gt;&lt;/strong&gt;&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;A dedicated workspace.&lt;/li&gt;\n&lt;li&gt;A reliable internet connection with the fastest speed possible in your area.&lt;/li&gt;\n&lt;li&gt;Devices and other essential equipment that meet minimal technical specifications.&lt;/li&gt;\n&lt;li&gt;Alignment with Our Values and the Xapo Values-Driven Leadership principles.&lt;/li&gt;\n&lt;/ul&gt;&lt;div class=&quot;content-conclusion&quot;&gt;&lt;p&gt;&lt;span style=&quot;font-size: 12pt;&quot;&gt;&lt;strong&gt;Why work for Xapo?&lt;/strong&gt;&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span style=&quot;font-weight: 500; font-size: 10pt;&quot;&gt;IMPACT GLOBALLY, WORK REMOTELY.&lt;/span&gt;&lt;/p&gt;\n&lt;ul&gt;\n&lt;li style=&quot;font-weight: 500;&quot;&gt;&lt;strong&gt;Shape the Future:&lt;/strong&gt;&lt;span style=&quot;font-weight: 500;&quot;&gt; Improve lives through cutting-edge technology, work 100% remotely from anywhere in the world.&lt;/span&gt;&lt;/li&gt;\n&lt;li style=&quot;font-weight: 500;&quot;&gt;&lt;strong&gt;Great work-life balance:&lt;/strong&gt;&lt;span style=&quot;font-weight: 500;&quot;&gt; &lt;/span&gt;&lt;span style=&quot;font-weight: 500;&quot;&gt;Build amazing things with a balance of autonomy and collaborative teamwork. Set your own work schedule and make use of a flexible PTO plan when you need to recharge.&lt;/span&gt;&lt;span style=&quot;font-weight: 500;&quot;&gt;&amp;nbsp;&lt;/span&gt;&lt;/li&gt;\n&lt;li style=&quot;font-weight: 500;&quot;&gt;&lt;strong&gt;Expect Excellence:&lt;/strong&gt;&lt;span style=&quot;font-weight: 500;&quot;&gt; Collaborate, learn, and grow with a high-performance team. Learn&lt;/span&gt;&lt;span style=&quot;font-weight: 500;&quot;&gt; how you learn best - from books to conferences, you’ll get a yearly budget for your individual learning and development goals.&lt;/span&gt;&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;&lt;strong&gt;At Xapo, we prioritize consumer protection and adhere to regulatory requirements by ensuring that all Xapiens are accountable for upholding principles of fair treatment, transparency, and ethical conduct in their interactions with customers and stakeholders.&lt;/strong&gt;&lt;/p&gt;&lt;/div&gt;","tags":"[\"management\",\"engineering\",\"aws\"]","pubDate":"2025-03-06T07:29:05.000Z","link":"https://job-boards.greenhouse.io/xapo61/jobs/6481719003","slug":"platform-engineer-remote-work-from-anywhere-xapo-bank-9105"},{"id":3401856986,"title":"Marketing Analyst Graduate (Remote - Work from Anywhere)","company":"Xapo Bank","image":"https://avatars.githubusercontent.com/u/6930305?s=200&v=4","description":"&lt;div class=&quot;content-intro&quot;&gt;&lt;p style=&quot;text-align: left;&quot;&gt;&lt;span style=&quot;font-weight: 900;&quot;&gt;Work from anywhere, impact everywhere&amp;nbsp;&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;Diversity is at the heart of who we are at Xapo Bank. We’re a fully distributed team of over 140 Xapiens that work remotely from 40+ countries around the world.&amp;nbsp;&lt;/p&gt;\n&lt;p&gt;Our beginning: A world that enjoys economic freedom and wealth protection, no matter where you live or who is running your country. This is the dream that drove Wences Casares, our Founder and Chairman, to quietly transform the world of banking.&lt;/p&gt;\n&lt;p&gt;To achieve that, we search the world for the best people for the job. We work hard, think globally, and inspire each other to learn and grow. We are committed to changing the way things are done.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Risk is inherent in all of our business activities and managing risk well is the responsibility of every Xapien. Sound risk management enables us to serve our customers and deliver value for our shareholders, and helps make Xapo a great place to work.&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&amp;nbsp;&lt;/p&gt;\n&lt;p style=&quot;text-align: left;&quot;&gt;&lt;em&gt;&lt;span style=&quot;font-weight: 500;&quot;&gt;Although we are headquartered in Gibraltar, this is a full time, 100% remote position&amp;nbsp;&lt;br&gt;&lt;/span&gt;&lt;/em&gt;&lt;em&gt;&lt;span style=&quot;font-weight: 500;&quot;&gt;Work from anywhere!&lt;/span&gt;&lt;/em&gt;&lt;/p&gt;\n&lt;p style=&quot;text-align: left;&quot;&gt;&amp;nbsp;&lt;/p&gt;&lt;/div&gt;&lt;p&gt;&lt;strong&gt;&lt;em&gt;Marketing Operations Graduate @ Xapo&amp;nbsp;&lt;/em&gt;&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;Diversity is at the heart of who we are at Xapo Bank. We’re a fully distributed team of over 140 Xapiens that work remotely from 40+ countries around the world.&amp;nbsp;&lt;/p&gt;\n&lt;p&gt;Our beginning: A world that enjoys economic freedom and wealth protection, no matter where you live or who is running your country. This is the dream that drove Wences Casares, our Founder and Chairman, to quietly transform the world of banking.&lt;/p&gt;\n&lt;p&gt;To achieve that, we search the world for the best people for the job. We work hard, think globally, and inspire each other to learn and grow. We are committed to changing the way things are done.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Risk is inherent in all of our business activities and managing risk well is the responsibility of every Xapien. Sound risk management enables us to serve our customers and deliver value for our shareholders, and helps make Xapo a great place to work.&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&amp;nbsp;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;&lt;em&gt;About us&lt;/em&gt;&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;Established in 2013, Xapo has pioneered Crypto Banking, while earning a reputation as the Fort Knox of Crypto.&amp;nbsp;&lt;/p&gt;\n&lt;p&gt;We believe that Bitcoin will do for money, what the internet did for information. Our goal is to provide a bridge between digital assets and traditional financial services.&lt;/p&gt;\n&lt;p&gt;To make it safe and easy for you to save in Dollars or Bitcoins, with immediate access to funds via Card, Crypto and Bank payment rails. To help you to participate in both traditional and crypto markets, enabling you to grow your wealth and build your financial future.&amp;nbsp;&lt;/p&gt;\n&lt;p&gt;Xapo Bank is the first product of its kind: a platform that bridges the gap between crypto and traditional banking services. Headquartered in Gibraltar, we are regulated and authorised as a credit institution to provide fiat related services and in addition, Xapo VASP is regulated and authorised as a Distributed Ledger Technology Provider to provide crypto services.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;&lt;em&gt;Position overview&lt;/em&gt;&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;We are seeking a &lt;strong&gt;Marketing Operations Graduate&lt;/strong&gt; to play a key role in supporting our marketing initiatives. In this position, you will assist in planning, executing, and tracking marketing projects and campaigns that enhance member acquisition, retention, and engagement. You will collaborate with various teams, contribute to research and data analysis, and ensure the seamless integration of marketing efforts with broader organizational goals.&lt;/p&gt;\n&lt;p&gt;This role is perfect for recent graduates or individuals with some experience who are eager to launch their careers in marketing. If you’re passionate about learning, problem-solving, and contributing to impactful initiatives in a fast-paced and supportive environment, we’d love to hear from you.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;&lt;em&gt;Responsibilities&lt;/em&gt;&lt;/strong&gt;&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;Support the coordination of resources and priorities for Xapo’s marketing strategy&lt;/li&gt;\n&lt;li&gt;Assist in planning and tracking marketing projects, ensuring tasks are completed on time&lt;/li&gt;\n&lt;li&gt;Monitor and report on marketing campaign performance, providing insights to the team&lt;/li&gt;\n&lt;li&gt;Help create and update project plans, schedules, and documentation&lt;/li&gt;\n&lt;li&gt;Collaborate with various teams to ensure alignment and effective execution of shared goals, seamlessly integrating marketing efforts with broader initiatives&lt;/li&gt;\n&lt;li&gt;Assist with the development and management of vendor contracts and agreements&lt;/li&gt;\n&lt;li&gt;Support vendor coordination and ensure deliverables meet agreed standards&lt;/li&gt;\n&lt;li&gt;Perform daily administrative activities&lt;/li&gt;\n&lt;li&gt;Assist in ensuring data accuracy, completeness, and integrity across marketing processes&lt;/li&gt;\n&lt;/ul&gt;\n&lt;ul&gt;\n&lt;li&gt;Conduct research for briefs and identify relevant resources, such as reports and case studies&lt;/li&gt;\n&lt;li&gt;Stay updated on industry trends, market conditions, and the competitive landscape&lt;/li&gt;\n&lt;li&gt;Documenting and refining marketing processes to improve efficiency&lt;/li&gt;\n&lt;li&gt;Implementing tools and platforms to streamline marketing workflows&lt;/li&gt;\n&lt;li&gt;Researching emerging trends in fintech and cryptocurrency marketing&lt;/li&gt;\n&lt;li&gt;Maintaining Xapo’s brand consistency across all marketing initiatives.&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;&lt;strong&gt;&lt;em&gt;Skills needed&lt;/em&gt;&lt;/strong&gt;&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;A recent Bachelor’s degree in Marketing, Design, Business, or a related field;&lt;/li&gt;\n&lt;li&gt;Familiarity with advertising and analytics platforms (e.g., Google Analytics, LinkedIn, Instagram, Looker);&lt;/li&gt;\n&lt;li&gt;Familiarity with tracking and analytics tools or a willingness to learn;&lt;/li&gt;\n&lt;li&gt;Interest in exploring lead generation strategies and testing campaign effectiveness;&lt;/li&gt;\n&lt;li&gt;Strong communication and teamwork skills to collaborate across teams;&lt;/li&gt;\n&lt;li&gt;Good organizational skills and ability to manage priorities effectively;&lt;/li&gt;\n&lt;li&gt;A positive attitude and eagerness to learn and grow in a fast-paced environment;&lt;/li&gt;\n&lt;li&gt;Curiosity about marketing trends and openness to adopting new tools and technologies.&lt;/li&gt;\n&lt;li&gt;Enthusiasm for learning and contributing to marketing and project initiatives;&lt;/li&gt;\n&lt;li&gt;A proactive, can-do mindset, eager to grow in a dynamic and supportive environment.&lt;/li&gt;\n&lt;li&gt;Familiarity with marketing concepts, advertising, or communications;&lt;/li&gt;\n&lt;li&gt;Analytical mindset with the ability to gather and interpret data to generate insights.&lt;/li&gt;\n&lt;li&gt;Demonstrate creativity, adaptability and intellectual curiosity, the ability to analyse problems and offer outside of the box solutions.&lt;/li&gt;\n&lt;li&gt;Exposure to marketing, advertising, or communications through coursework, internships, or projects.&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;&lt;strong&gt;&lt;em&gt;Other requirements&lt;/em&gt;&lt;/strong&gt;&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;A dedicated workspace.&lt;/li&gt;\n&lt;li&gt;A reliable internet connection with the fastest speed possible in your area.&lt;/li&gt;\n&lt;li&gt;Devices and other essential equipment that meet minimal technical specifications.&lt;/li&gt;\n&lt;li&gt;Alignment with Our Values and the Xapo Values-Driven Leadership principles.&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;&lt;strong&gt;&lt;em&gt;Why work for Xapo?&lt;/em&gt;&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;IMPACT GLOBALLY, WORK REMOTELY.&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;Shape the Future: Improve lives through cutting-edge technology, work 100% remotely from anywhere in the world.&lt;/li&gt;\n&lt;li&gt;Own Your Success: Receive attractive remuneration, enjoy an autonomous work culture and flexible hours, apply your expertise to meaningful work every day.&lt;/li&gt;\n&lt;li&gt;Expect Excellence: Collaborate, learn, and grow with a high-performance team.&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;&lt;em&gt;Please note, all successful applicants that accept our offer will be required to undergo a background check facilitated by our partner Veremark before finalizing the onboarding process. These checks will be securely stored for 5 years to comply with the legal and regulatory requirements Xapo Bank is subject to as a regulated financial institution.&lt;/em&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;At Xapo, we prioritize consumer protection and adhere to regulatory requirements by ensuring that all Xapiens are accountable for upholding principles of fair treatment, transparency, and ethical conduct in their interactions with customers and stakeholders.&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;br&gt;&lt;br&gt;&lt;br&gt;&lt;/p&gt;&lt;div class=&quot;content-conclusion&quot;&gt;&lt;p&gt;&lt;span style=&quot;font-size: 12pt;&quot;&gt;&lt;strong&gt;Why work for Xapo?&lt;/strong&gt;&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span style=&quot;font-weight: 500; font-size: 10pt;&quot;&gt;IMPACT GLOBALLY, WORK REMOTELY.&lt;/span&gt;&lt;/p&gt;\n&lt;ul&gt;\n&lt;li style=&quot;font-weight: 500;&quot;&gt;&lt;strong&gt;Shape the Future:&lt;/strong&gt;&lt;span style=&quot;font-weight: 500;&quot;&gt; Improve lives through cutting-edge technology, work 100% remotely from anywhere in the world.&lt;/span&gt;&lt;/li&gt;\n&lt;li style=&quot;font-weight: 500;&quot;&gt;&lt;strong&gt;Great work-life balance:&lt;/strong&gt;&lt;span style=&quot;font-weight: 500;&quot;&gt; &lt;/span&gt;&lt;span style=&quot;font-weight: 500;&quot;&gt;Build amazing things with a balance of autonomy and collaborative teamwork. Set your own work schedule and make use of a flexible PTO plan when you need to recharge.&lt;/span&gt;&lt;span style=&quot;font-weight: 500;&quot;&gt;&amp;nbsp;&lt;/span&gt;&lt;/li&gt;\n&lt;li style=&quot;font-weight: 500;&quot;&gt;&lt;strong&gt;Expect Excellence:&lt;/strong&gt;&lt;span style=&quot;font-weight: 500;&quot;&gt; Collaborate, learn, and grow with a high-performance team. Learn&lt;/span&gt;&lt;span style=&quot;font-weight: 500;&quot;&gt; how you learn best - from books to conferences, you’ll get a yearly budget for your individual learning and development goals.&lt;/span&gt;&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;&lt;strong&gt;At Xapo, we prioritize consumer protection and adhere to regulatory requirements by ensuring that all Xapiens are accountable for upholding principles of fair treatment, transparency, and ethical conduct in their interactions with customers and stakeholders.&lt;/strong&gt;&lt;/p&gt;&lt;/div&gt;","tags":"[\"management\",\"legal\"]","pubDate":"2025-03-06T07:24:51.000Z","link":"https://job-boards.greenhouse.io/xapo61/jobs/6491087003","slug":"marketing-analyst-graduate-remote-work-from-anywhere-xapo-bank-4301"},{"id":8355246781,"title":"Senior Customer Engineer (Pre-Sales Solutions Engineer) - East [IC3] ","company":"Sourcegraph","image":"https://avatars.githubusercontent.com/u/3979584?s=200&v=4","description":"&lt;div class=&quot;content-intro&quot;&gt;&lt;h2&gt;&lt;span style=&quot;color: rgb(243, 78, 63);&quot;&gt;&lt;strong&gt;Who we are&lt;/strong&gt;&lt;/span&gt;&lt;/h2&gt;\n&lt;p&gt;Our mission at Sourcegraph is to make it so that &lt;a href=&quot;https://www.notion.so/sourcegraph/Mission-values-e9d37e6b972a4ef395c3076aea2bd07d?pvs=4&quot;&gt;everyone can code&lt;/a&gt;, not just ~0.1% of the population.&amp;nbsp;&lt;/p&gt;\n&lt;p&gt;We are transforming how the world’s most important companies build software by industrializing development with AI. Today, most professional developers spend a disproportionate amount of time understanding code and performing repetitive, low-level tasks—leaving less time for innovation and meaningful impact.&lt;/p&gt;\n&lt;p&gt;We’re changing that. Sourcegraph brings AI-powered search and agents to the enterprise, helping teams automate the mundane and amplify what developers do best— solving hard problems and creating great products.&lt;/p&gt;\n&lt;p&gt;Here’s how we’re making a difference:&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;&lt;strong&gt;Accelerating developers &lt;/strong&gt;with AI agents that deliver insights and precision—enabling 5x faster test creation, 30% increase in merge requests, and saving 20 minutes per developer daily.&lt;/li&gt;\n&lt;li&gt;&lt;strong&gt;Automating repetitive tasks,&lt;/strong&gt; from remediating vulnerabilities (saving teams 1,000+ hours annually) to speeding up migrations that would take years to months.&amp;nbsp;&lt;/li&gt;\n&lt;li&gt;&lt;strong&gt;Enabling innovation&lt;/strong&gt; by addressing complex problems like automated bug triage, vulnerability detection, and AI-driven code reviews seamlessly integrated into workflows.&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;Trusted by 7/10 top software companies by market cap, 4/6 top US banks and many of the companies leading global innovation, like Stripe, Indeed, Tesla, and 1Password, and with $225M in funding from investors like &lt;a href=&quot;https://techcrunch.com/2021/07/13/sourcegraph-raises-125m-series-d-on-2-6b-valuation-for-universal-code-search-tool/&quot;&gt;a16z&lt;/a&gt;, &lt;a href=&quot;https://about.sourcegraph.com/blog/series-c-with-sequoia/&quot;&gt;Sequoia&lt;/a&gt;, and &lt;a href=&quot;https://www.redpoint.com/companies/sourcegraph/&quot;&gt;Redpoint&lt;/a&gt;, we are building the tools that will define the next era of enterprise software development.&lt;/p&gt;\n&lt;p&gt;If you’re passionate about solving the hardest problems in software and shaping the future of technology, join us. Let’s build something extraordinary together.&lt;/p&gt;&lt;/div&gt;&lt;h2&gt;&lt;span style=&quot;color: rgb(243, 78, 63);&quot;&gt;&lt;strong&gt;Hours &amp;amp; location&lt;/strong&gt;&lt;/span&gt;&lt;/h2&gt;\n&lt;p&gt;🌎 While we hire &lt;a href=&quot;https://sourcegraph.notion.site/How-we-engage-talent-outside-of-the-US-218f7193695a46cbb1ef39ef9c1f72d4&quot;&gt;almost anywhere&lt;/a&gt; in the world, we prefer those working from the Eastern Time Zone.&amp;nbsp;&lt;/p&gt;\n&lt;p&gt;We do not subscribe to “I do my best work when I work 40 hours a week.” &amp;nbsp;People we hire at Sourcegraph believe that building outstanding things means working very hard — smarter and more hours than the competition.&lt;/p&gt;\n&lt;h2&gt;&lt;span style=&quot;color: rgb(243, 78, 63);&quot;&gt;&lt;strong&gt;Why this job is exciting&lt;/strong&gt;&lt;/span&gt;&lt;/h2&gt;\n&lt;p&gt;As a Solutions Engineer, you will have broad responsibility and growth potential in helping us take our pre-sales organization to the next level. Our customers are the world&#39;s leading technology organizations. No other role at any other company gives you insight into how so many world-class organizations and developers build software at scale, and no other role at any other company puts you right in the middle of it all like we do.&lt;/p&gt;\n&lt;p&gt;📅 Within one month, you will…&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;Learn about our products, our value propositions, our customers, our team, and our processes.&lt;/li&gt;\n&lt;li&gt;Set up your own fully configured sandbox instance&lt;/li&gt;\n&lt;li&gt;Start building a trusting relationship with your peers on Sales, Value Engineering, Post-sales Success (Technical Advisory) and Support teams&lt;/li&gt;\n&lt;li&gt;Join customer and prospect calls with some of our largest customers to understand their needs, how we communicate the value of Sourcegraph, and how we deliver positive impact to our customers’ business&lt;/li&gt;\n&lt;li&gt;Get demo certified&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;📅 Within three months, you will…&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;Continue to take ownership of more prospective relationships partnering with up to three Account Executives (AEs)&lt;/li&gt;\n&lt;li&gt;Lead early-stage conversations with prospective customers and delve into the technical needs for success&amp;nbsp;&lt;/li&gt;\n&lt;li&gt;Serve as an advocate on behalf of your customers by bringing important insights and feedback back to internal teams&lt;/li&gt;\n&lt;li&gt;Drawing from past experience, as well as observations, make internal contributions by identifying opportunities to help propose and deliver solutions&lt;/li&gt;\n&lt;li&gt;Participate in Solutions Engineer-led projects which will mature our own capabilities, increase the breadth of our footprint both internally and externally, and positively impact our business and our customers&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;📅 Within six months, you will…&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;Establish yourself as a thought leader and evangelist by using your insights to teach prospective customers new and better ways to get value from Sourcegraph.&lt;/li&gt;\n&lt;li&gt;Mentor, recruit and train teammates, prospects, and new hires&lt;/li&gt;\n&lt;/ul&gt;\n&lt;h2&gt;&lt;span style=&quot;color: rgb(243, 78, 63);&quot;&gt;&lt;strong&gt;About you&lt;/strong&gt;&lt;/span&gt;&lt;/h2&gt;\n&lt;p&gt;You are an enthusiastic, proactive, driven, and results-oriented Solutions Engineer who shares&lt;a href=&quot;https://about.sourcegraph.com/company/values&quot;&gt; our values&lt;/a&gt; and has a passion for getting prospective customers to that a-ha moment with Sourcegraph!&lt;/p&gt;\n&lt;p&gt;The ideal candidate:&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;You have at least 5 years experience in a relevant role such as Sales Engineering, Solutions Engineering, or Solution Architecture across a technical product.&lt;/li&gt;\n&lt;li&gt;You have experience selling Enterprise software solutions and have gone through the lived experience of the Enterprise process selling motions.&amp;nbsp;&lt;/li&gt;\n&lt;li&gt;You have an innate curiosity of getting to the root of customer problems and understanding their motivations.&amp;nbsp;&lt;/li&gt;\n&lt;li&gt;You’re excited about the prospect of being directly involved in the advent of generative AI!&amp;nbsp;&lt;/li&gt;\n&lt;li&gt;You are well versed in back end infrastructure architecture.&amp;nbsp;&lt;/li&gt;\n&lt;li&gt;You are very technically inclined and have a propensity to code and or hack code.&amp;nbsp;&lt;/li&gt;\n&lt;li&gt;You have experience writing code in one of the following (JavaScript, Python, Java, Go).&lt;/li&gt;\n&lt;li&gt;You are a problem solver, love to troubleshoot.&lt;/li&gt;\n&lt;li&gt;You have familiarity with Docker and Kubernetes environments.&lt;/li&gt;\n&lt;li&gt;Strong verbal and written communication skills, specifically across technical presentations and product demonstrations; ability to influence and excite a technical audience.&lt;/li&gt;\n&lt;li&gt;Either through direct experience or deep understanding, working knowledge of the end-to-end software development lifecycle and concepts such as continuous integration and continuous deployment. Note: You do not need to be a software engineer to be successful in this role!&lt;/li&gt;\n&lt;li&gt;You have the ability to speak fluently with our developer champions and users (who are all developers themselves).&amp;nbsp;&lt;/li&gt;\n&lt;li&gt;You have the strategic mindset to be able to identify opportunities and potential solutions to solve both internal and external problems or gaps, and you can use your skills to apply the appropriate solution.&lt;/li&gt;\n&lt;li&gt;You enjoy building tools, templates, and technical enablement collateral.&amp;nbsp;&lt;/li&gt;\n&lt;li&gt;You have an organized approach to work, with demonstrated ability to proactively manage a set of concurrent opportunities, to make difficult prioritization decisions, and to use data to guide decision-making.&lt;/li&gt;\n&lt;li&gt;You’re not afraid to learn a new skill to solve a problem that benefits or unblocks a deal.&lt;/li&gt;\n&lt;li&gt;You work well independently.&lt;/li&gt;\n&lt;/ul&gt;\n&lt;h2&gt;&lt;span style=&quot;color: rgb(243, 78, 63);&quot;&gt;&lt;strong&gt;Level&lt;/strong&gt;&lt;/span&gt;&lt;/h2&gt;\n&lt;p&gt;📊 This job is an IC3 position, depending on previous experience and role scope.&amp;nbsp; You can read more about &lt;a href=&quot;https://www.notion.so/sourcegraph/Leveling-Guide-0e1b5c76ada64b9caac387f8b7c4fc66&quot;&gt;our job leveling philosophy&lt;/a&gt; in our Handbook.&lt;/p&gt;\n&lt;h2&gt;&lt;span style=&quot;color: rgb(243, 78, 63);&quot;&gt;&lt;strong&gt;Compensation&lt;/strong&gt;&lt;/span&gt;&lt;/h2&gt;\n&lt;p&gt;&lt;strong&gt;💸 We pay you an above-average salary&lt;/strong&gt; because we want to hire the best people who are fully focused on helping Sourcegraph succeed, not worried about paying bills. As an &lt;a href=&quot;https://sourcegraph.notion.site/Mission-values-e9d37e6b972a4ef395c3076aea2bd07d&quot;&gt;open and transparent&lt;/a&gt; company that values &lt;a href=&quot;https://www.notion.so/sourcegraph/Compensation-Pay-Transparency-at-Sourcegraph-d58d0774f51b4b489d41c3628d30ff8d?pvs=4&quot;&gt;competitive compensation&lt;/a&gt;, our compensation ranges are visible to every single Sourcegraph teammate.&lt;/p&gt;\n&lt;p&gt;Your salary is determined by your pay band for the IC3 job level. For determining pay bands, we use a number of market and data-driven salary sources, along with your location zone, and target the high-end of the range to ensure we’re always paying above market regardless of where you live in the world. Both U.S. and international locations are divided into one of four zones, determined by the cost of labor index for each area. The salary for a successful candidate will be based on level, job-related skills, experience, qualifications, and location zone. Please note that the salaries below may be adjusted in the future.&lt;/p&gt;\n&lt;p&gt;💰 The target compensation for this role is based on the IC3 pay band for your zone. The start of the IC3 pay band for each zone is listed below:&lt;/p&gt;\n&lt;p&gt;Zone 1: $144,375 base + $48,125 variable ($192,500 USD on-target-earnings)&lt;br&gt;Zone 2: $115,500 base + $38,500 variable ($154,000 USD on-target earnings)&lt;/p&gt;\n&lt;p&gt;Please speak with a recruiter for additional information regarding zone locations.&lt;/p&gt;\n&lt;p&gt;📈 In addition to our cash compensation, we offer equity (because when we succeed as a company, we want you to succeed, too) and generous &lt;a href=&quot;https://sourcegraph.notion.site/Benefits-Perks-dd1da4b6b3a64780abed010a144d34ba&quot;&gt;perks &amp;amp; benefits&lt;/a&gt;.&lt;/p&gt;\n&lt;h2&gt;&lt;span style=&quot;color: rgb(243, 78, 63);&quot;&gt;&lt;strong&gt;Interview process&lt;/strong&gt;&lt;/span&gt;&lt;/h2&gt;\n&lt;p&gt;&lt;em&gt;Below is the interview process you can expect for this role (you can read more about &lt;/em&gt;&lt;a href=&quot;https://sourcegraph.notion.site/Types-of-interviews-f279f080583d49ee9f2c60e30c8cb1f7&quot;&gt;&lt;em&gt;the types of interviews&lt;/em&gt;&lt;/a&gt;&lt;em&gt; in our Handbook). It may look like a lot of steps, but rest assured that we move quickly and the steps are designed to help you get the information needed to determine if we’re the right fit for you… Interviewing is a two-way street, after all!&amp;nbsp;&lt;/em&gt;&lt;/p&gt;\n&lt;p&gt;We expect the interview process to take 3.5 hours in total.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;👋 Introduction Stage&lt;/strong&gt; - we have initial conversations to get to know you better…&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;[30m]&amp;nbsp;&lt;a href=&quot;https://www.notion.so/sourcegraph/Types-of-interviews-sample-questions-f279f080583d49ee9f2c60e30c8cb1f7?pvs=4#99be5ff628b2414194a0ba79d9f25f13&quot;&gt;Recruiter Screen&lt;/a&gt;&lt;/li&gt;\n&lt;li&gt;[60m] &lt;a href=&quot;https://www.notion.so/sourcegraph/Types-of-interviews-sample-questions-f279f080583d49ee9f2c60e30c8cb1f7?pvs=4#1919882c0cf147c487eb1df40db8a694&quot;&gt;Hiring Manager Screen&lt;/a&gt; /&amp;nbsp;&lt;a href=&quot;https://www.notion.so/sourcegraph/Types-of-interviews-sample-questions-f279f080583d49ee9f2c60e30c8cb1f7?pvs=4#c678a2a86e0e47e4958507e869bf7ded&quot;&gt;Resume Deep Dive&lt;/a&gt; with Hiring Manager&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;&lt;strong&gt;🧑‍💻 Team Interview Stage&lt;/strong&gt; - we then delve into your experience in more depth and introduce you to members of the team, including cross-functional partners…&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;[30m]&amp;nbsp;&lt;a href=&quot;https://www.notion.so/sourcegraph/Types-of-interviews-sample-questions-f279f080583d49ee9f2c60e30c8cb1f7?pvs=4#cb00697e95304550a146c32563c0255d&quot;&gt;Cross-functional&lt;/a&gt; /&amp;nbsp;&lt;a href=&quot;https://www.notion.so/sourcegraph/Types-of-interviews-sample-questions-f279f080583d49ee9f2c60e30c8cb1f7?pvs=4#88b9f826dee04ef98afc2aeec35b877a&quot;&gt;Peer&lt;/a&gt; with an Account Executive&lt;/li&gt;\n&lt;li&gt;[45m] &lt;a href=&quot;https://www.notion.so/sourcegraph/Technical-Success-interview-process-902069565e1147b89ac98054179eb676?pvs=4#5a1021deb9b140258e35bbdd345f7754&quot;&gt;Live Panel Demo&lt;/a&gt; with Hiring Manager, 1 CE &amp;amp; 1 AE&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;&lt;strong&gt;🎉 Final Interview Stage &lt;/strong&gt;- we move you to our final round, where you gain a better understanding of our business and values holistically…&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;[30m]&amp;nbsp;&lt;a href=&quot;https://www.notion.so/sourcegraph/Types-of-interviews-sample-questions-f279f080583d49ee9f2c60e30c8cb1f7?pvs=4#e3a04291743048df87541a88aa8199dd&quot;&gt;Values&lt;/a&gt;&lt;/li&gt;\n&lt;li&gt;[15m] &lt;a href=&quot;https://www.notion.so/sourcegraph/How-to-work-with-Quinn-Slack-CEO-807673e0864d473f959cc4efd9642a5a?pvs=4#6f185c0e2011411eac5be9c675f9056c&quot;&gt;Leadership&lt;/a&gt; with co-founder&amp;nbsp;&lt;/li&gt;\n&lt;li&gt;We check references and conduct your background check&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;Please note - you are welcome to request additional conversations with anyone you would like to meet, but didn’t get to meet during the interview process.&lt;/p&gt;&lt;div class=&quot;content-conclusion&quot;&gt;&lt;h2&gt;&lt;span style=&quot;color: rgb(243, 78, 63);&quot;&gt;&lt;strong&gt;Learn more about us&lt;/strong&gt;&lt;/span&gt;&lt;/h2&gt;\n&lt;p&gt;You can learn more about what it is like to work at Sourcegraph by reading &lt;a href=&quot;https://sourcegraph.notion.site/d7614e3e9dc04c09ac2d42d57f1816e6?v=2a6d426dbae14390b155120b0c029ce0&quot;&gt;our handbook&lt;/a&gt;.&lt;/p&gt;\n&lt;p&gt;We are an ambitious team who are collectively working hard to build the most influential company in the world.&amp;nbsp; You can read more about our &lt;a href=&quot;https://sourcegraph.notion.site/What-it-s-like-working-at-Sourcegraph-119a8e11265880b18911eee4d9b7c460#119a8e1126588062b935fc66104b6115&quot;&gt;culture&lt;/a&gt;, &lt;a href=&quot;https://sourcegraph.notion.site/Compensation-Pay-Transparency-at-Sourcegraph-d58d0774f51b4b489d41c3628d30ff8d?pvs=74&quot;&gt;competitive compensation&lt;/a&gt; and &lt;a href=&quot;https://sourcegraph.notion.site/Benefits-Perks-dd1da4b6b3a64780abed010a144d34ba?pvs=74&quot;&gt;benefits&lt;/a&gt; here.&lt;/p&gt;\n&lt;p&gt;Sourcegraph is an equal opportunity workplace; we welcome people from all backgrounds.&amp;nbsp;&lt;/p&gt;\n&lt;p&gt;&lt;em&gt;Sourcegraph participates in &lt;/em&gt;&lt;a href=&quot;https://sourcegraph.notion.site/E-Verify-2ab3286dde3446d6bac2898c83610107&quot;&gt;&lt;em&gt;E-Verify&lt;/em&gt;&lt;/a&gt;&lt;em&gt; for U.S. Employees. &lt;/em&gt;&lt;/p&gt;&lt;/div&gt;","tags":"[\"javascript\",\"engineering\"]","pubDate":"2025-03-06T06:07:26.000Z","link":"https://job-boards.greenhouse.io/sourcegraph91/jobs/5465002004","slug":"senior-customer-engineer-pre-sales-solutions-engineer-east-ic3-sourcegraph-95"},{"id":5262308715,"title":"Senior Customer Engineer (Pre-Sales Solutions Engineer) - West [IC4] ","company":"Sourcegraph","image":"https://avatars.githubusercontent.com/u/3979584?s=200&v=4","description":"&lt;div class=&quot;content-intro&quot;&gt;&lt;h2&gt;&lt;span style=&quot;color: rgb(243, 78, 63);&quot;&gt;&lt;strong&gt;Who we are&lt;/strong&gt;&lt;/span&gt;&lt;/h2&gt;\n&lt;p&gt;Our mission at Sourcegraph is to make it so that &lt;a href=&quot;https://www.notion.so/sourcegraph/Mission-values-e9d37e6b972a4ef395c3076aea2bd07d?pvs=4&quot;&gt;everyone can code&lt;/a&gt;, not just ~0.1% of the population.&amp;nbsp;&lt;/p&gt;\n&lt;p&gt;We are transforming how the world’s most important companies build software by industrializing development with AI. Today, most professional developers spend a disproportionate amount of time understanding code and performing repetitive, low-level tasks—leaving less time for innovation and meaningful impact.&lt;/p&gt;\n&lt;p&gt;We’re changing that. Sourcegraph brings AI-powered search and agents to the enterprise, helping teams automate the mundane and amplify what developers do best— solving hard problems and creating great products.&lt;/p&gt;\n&lt;p&gt;Here’s how we’re making a difference:&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;&lt;strong&gt;Accelerating developers &lt;/strong&gt;with AI agents that deliver insights and precision—enabling 5x faster test creation, 30% increase in merge requests, and saving 20 minutes per developer daily.&lt;/li&gt;\n&lt;li&gt;&lt;strong&gt;Automating repetitive tasks,&lt;/strong&gt; from remediating vulnerabilities (saving teams 1,000+ hours annually) to speeding up migrations that would take years to months.&amp;nbsp;&lt;/li&gt;\n&lt;li&gt;&lt;strong&gt;Enabling innovation&lt;/strong&gt; by addressing complex problems like automated bug triage, vulnerability detection, and AI-driven code reviews seamlessly integrated into workflows.&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;Trusted by 7/10 top software companies by market cap, 4/6 top US banks and many of the companies leading global innovation, like Stripe, Indeed, Tesla, and 1Password, and with $225M in funding from investors like &lt;a href=&quot;https://techcrunch.com/2021/07/13/sourcegraph-raises-125m-series-d-on-2-6b-valuation-for-universal-code-search-tool/&quot;&gt;a16z&lt;/a&gt;, &lt;a href=&quot;https://about.sourcegraph.com/blog/series-c-with-sequoia/&quot;&gt;Sequoia&lt;/a&gt;, and &lt;a href=&quot;https://www.redpoint.com/companies/sourcegraph/&quot;&gt;Redpoint&lt;/a&gt;, we are building the tools that will define the next era of enterprise software development.&lt;/p&gt;\n&lt;p&gt;If you’re passionate about solving the hardest problems in software and shaping the future of technology, join us. Let’s build something extraordinary together.&lt;/p&gt;&lt;/div&gt;&lt;h2&gt;&lt;span style=&quot;color: rgb(243, 78, 63);&quot;&gt;&lt;strong&gt;Hours &amp;amp; location&lt;/strong&gt;&lt;/span&gt;&lt;/h2&gt;\n&lt;p&gt;🌎 While we hire &lt;a href=&quot;https://sourcegraph.notion.site/How-we-engage-talent-outside-of-the-US-218f7193695a46cbb1ef39ef9c1f72d4&quot;&gt;almost anywhere&lt;/a&gt; in the world, we prefer those living in a hub city (Denver, Austin, or San Francisco) to be able to work from one of our office locations for several days per week.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Ideal locations:&lt;/strong&gt;&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;San Francisco, CA&lt;/li&gt;\n&lt;li&gt;Denver, CO&lt;/li&gt;\n&lt;li&gt;Chicago, IL&lt;/li&gt;\n&lt;li&gt;Austin, TX&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;We do not subscribe to “I do my best work when I work 40 hours a week.” &amp;nbsp;People we hire at Sourcegraph believe that building outstanding things means working very hard — smarter and more hours than the competition.&lt;/p&gt;\n&lt;h2&gt;&lt;span style=&quot;color: rgb(243, 78, 63);&quot;&gt;&lt;strong&gt;Why this job is exciting&lt;/strong&gt;&lt;/span&gt;&lt;/h2&gt;\n&lt;p&gt;As a Solutions Engineer, you will have broad responsibility and growth potential in helping us take our pre-sales organization to the next level. Our customers are the world&#39;s leading technology organizations. No other role at any other company gives you insight into how so many world-class organizations and developers build software at scale, and no other role at any other company puts you right in the middle of it all like we do.&lt;/p&gt;\n&lt;p&gt;📅 Within one month, you will…&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;Learn about our products, our value propositions, our customers, our team, and our processes.&lt;/li&gt;\n&lt;li&gt;Set up your own fully configured sandbox instance&lt;/li&gt;\n&lt;li&gt;Start building a trusting relationship with your peers on Sales, Value Engineering, Post-sales Success (Technical Advisory) and Support teams&lt;/li&gt;\n&lt;li&gt;Join customer and prospect calls with some of our largest customers to understand their needs, how we communicate the value of Sourcegraph, and how we deliver positive impact to our customers’ business&lt;/li&gt;\n&lt;li&gt;Get demo certified&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;📅 Within three months, you will…&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;Continue to take ownership of more prospective relationships partnering with up to three Account Executives (AEs)&lt;/li&gt;\n&lt;li&gt;Lead early-stage conversations with prospective customers and delve into the technical needs for success&amp;nbsp;&lt;/li&gt;\n&lt;li&gt;Serve as an advocate on behalf of your customers by bringing important insights and feedback back to internal teams&lt;/li&gt;\n&lt;li&gt;Drawing from past experience, as well as observations, make internal contributions by identifying opportunities to help propose and deliver solutions&lt;/li&gt;\n&lt;li&gt;Participate in Solutions Engineer-led projects which will mature our own capabilities, increase the breadth of our footprint both internally and externally, and positively impact our business and our customers&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;📅 Within six months, you will…&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;Establish yourself as a thought leader and evangelist by using your insights to teach prospective customers new and better ways to get value from Sourcegraph.&lt;/li&gt;\n&lt;li&gt;Mentor, recruit and train teammates, prospects, and new hires&lt;/li&gt;\n&lt;/ul&gt;\n&lt;h2&gt;&lt;span style=&quot;color: rgb(243, 78, 63);&quot;&gt;&lt;strong&gt;About you&lt;/strong&gt;&lt;/span&gt;&lt;/h2&gt;\n&lt;p&gt;You are an enthusiastic, proactive, driven, and results-oriented Solutions Engineer who shares&lt;a href=&quot;https://about.sourcegraph.com/company/values&quot;&gt; our values&lt;/a&gt; and has a passion for getting prospective customers to that a-ha moment with Sourcegraph!&lt;/p&gt;\n&lt;p&gt;The ideal candidate:&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;You have at least 5 years experience in a relevant role such as Sales Engineering, Solutions Engineering, or Solution Architecture across a technical product.&lt;/li&gt;\n&lt;li&gt;You have experience selling Enterprise software solutions and have gone through the lived experience of the Enterprise process selling motions.&amp;nbsp;&lt;/li&gt;\n&lt;li&gt;You have an innate curiosity of getting to the root of customer problems and understanding their motivations.&amp;nbsp;&lt;/li&gt;\n&lt;li&gt;You’re excited about the prospect of being directly involved in the advent of generative AI!&amp;nbsp;&lt;/li&gt;\n&lt;li&gt;You are well versed in back end infrastructure architecture.&amp;nbsp;&lt;/li&gt;\n&lt;li&gt;You are very technically inclined and have a propensity to code and or hack code.&amp;nbsp;&lt;/li&gt;\n&lt;li&gt;You have experience writing code in one of the following (JavaScript, Python, Java, Go).&lt;/li&gt;\n&lt;li&gt;You are a problem solver, love to troubleshoot.&lt;/li&gt;\n&lt;li&gt;You have familiarity with Docker and Kubernetes environments.&lt;/li&gt;\n&lt;li&gt;Strong verbal and written communication skills, specifically across technical presentations and product demonstrations; ability to influence and excite a technical audience.&lt;/li&gt;\n&lt;li&gt;Either through direct experience or deep understanding, working knowledge of the end-to-end software development lifecycle and concepts such as continuous integration and continuous deployment. Note: You do not need to be a software engineer to be successful in this role!&lt;/li&gt;\n&lt;li&gt;You have the ability to speak fluently with our developer champions and users (who are all developers themselves).&amp;nbsp;&lt;/li&gt;\n&lt;li&gt;You have the strategic mindset to be able to identify opportunities and potential solutions to solve both internal and external problems or gaps, and you can use your skills to apply the appropriate solution.&lt;/li&gt;\n&lt;li&gt;You enjoy building tools, templates, and technical enablement collateral.&amp;nbsp;&lt;/li&gt;\n&lt;li&gt;You have an organized approach to work, with demonstrated ability to proactively manage a set of concurrent opportunities, to make difficult prioritization decisions, and to use data to guide decision-making.&lt;/li&gt;\n&lt;li&gt;You’re not afraid to learn a new skill to solve a problem that benefits or unblocks a deal.&lt;/li&gt;\n&lt;li&gt;You work well independently.&lt;/li&gt;\n&lt;/ul&gt;\n&lt;h2&gt;&lt;span style=&quot;color: rgb(243, 78, 63);&quot;&gt;&lt;strong&gt;Level&lt;/strong&gt;&lt;/span&gt;&lt;/h2&gt;\n&lt;p&gt;📊 This job is an IC4 position, depending on previous experience and role scope.&amp;nbsp; You can read more about &lt;a href=&quot;https://www.notion.so/sourcegraph/Leveling-Guide-0e1b5c76ada64b9caac387f8b7c4fc66&quot;&gt;our job leveling philosophy&lt;/a&gt; in our Handbook.&lt;/p&gt;\n&lt;h2&gt;&lt;span style=&quot;color: rgb(243, 78, 63);&quot;&gt;&lt;strong&gt;Compensation&lt;/strong&gt;&lt;/span&gt;&lt;/h2&gt;\n&lt;p&gt;&lt;strong&gt;💸 We pay you an above-average salary&lt;/strong&gt; because we want to hire the best people who are fully focused on helping Sourcegraph succeed, not worried about paying bills. As an &lt;a href=&quot;https://sourcegraph.notion.site/Mission-values-e9d37e6b972a4ef395c3076aea2bd07d&quot;&gt;open and transparent&lt;/a&gt; company that values &lt;a href=&quot;https://www.notion.so/sourcegraph/Compensation-Pay-Transparency-at-Sourcegraph-d58d0774f51b4b489d41c3628d30ff8d?pvs=4&quot;&gt;competitive compensation&lt;/a&gt;, our compensation ranges are visible to every single Sourcegraph teammate.&lt;/p&gt;\n&lt;p&gt;Your salary is determined by your pay band for the IC4 job level. For determining pay bands, we use a number of market and data-driven salary sources, along with your location zone, and target the high-end of the range to ensure we’re always paying above market regardless of where you live in the world. Both U.S. and international locations are divided into one of four zones, determined by the cost of labor index for each area. The salary for a successful candidate will be based on level, job-related skills, experience, qualifications, and location zone. Please note that the salaries below may be adjusted in the future.&lt;/p&gt;\n&lt;p&gt;💰 The target compensation for this role is based on the IC4 pay band for your zone. The start of the IC4 pay band for each zone is listed below:&lt;/p&gt;\n&lt;p&gt;Zone 1: $162,969 base + $54,323 variable ($217,292 USD on-target-earnings)&lt;br&gt;Zone 2: $130,375 base + $43,459 variable ($173,834 USD on-target earnings)&lt;/p&gt;\n&lt;p&gt;Please speak with a recruiter for additional information regarding zone locations.&lt;/p&gt;\n&lt;p&gt;📈 In addition to our cash compensation, we offer equity (because when we succeed as a company, we want you to succeed, too) and generous &lt;a href=&quot;https://sourcegraph.notion.site/Benefits-Perks-dd1da4b6b3a64780abed010a144d34ba&quot;&gt;perks &amp;amp; benefits&lt;/a&gt;.&lt;/p&gt;\n&lt;h2&gt;&lt;span style=&quot;color: rgb(243, 78, 63);&quot;&gt;&lt;strong&gt;Interview process&lt;/strong&gt;&lt;/span&gt;&lt;/h2&gt;\n&lt;p&gt;&lt;em&gt;Below is the interview process you can expect for this role (you can read more about &lt;/em&gt;&lt;a href=&quot;https://sourcegraph.notion.site/Types-of-interviews-f279f080583d49ee9f2c60e30c8cb1f7&quot;&gt;&lt;em&gt;the types of interviews&lt;/em&gt;&lt;/a&gt;&lt;em&gt; in our Handbook). It may look like a lot of steps, but rest assured that we move quickly and the steps are designed to help you get the information needed to determine if we’re the right fit for you… Interviewing is a two-way street, after all!&amp;nbsp;&lt;/em&gt;&lt;/p&gt;\n&lt;p&gt;We expect the interview process to take 3.5 hours in total.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;👋 Introduction Stage&lt;/strong&gt; - we have initial conversations to get to know you better…&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;[30m]&amp;nbsp;&lt;a href=&quot;https://www.notion.so/sourcegraph/Types-of-interviews-sample-questions-f279f080583d49ee9f2c60e30c8cb1f7?pvs=4#99be5ff628b2414194a0ba79d9f25f13&quot;&gt;Recruiter Screen&lt;/a&gt;&lt;/li&gt;\n&lt;li&gt;[60m] &lt;a href=&quot;https://www.notion.so/sourcegraph/Types-of-interviews-sample-questions-f279f080583d49ee9f2c60e30c8cb1f7?pvs=4#1919882c0cf147c487eb1df40db8a694&quot;&gt;Hiring Manager Screen&lt;/a&gt; /&amp;nbsp;&lt;a href=&quot;https://www.notion.so/sourcegraph/Types-of-interviews-sample-questions-f279f080583d49ee9f2c60e30c8cb1f7?pvs=4#c678a2a86e0e47e4958507e869bf7ded&quot;&gt;Resume Deep Dive&lt;/a&gt; with Hiring Manager&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;&lt;strong&gt;🧑‍💻 Team Interview Stage&lt;/strong&gt; - we then delve into your experience in more depth and introduce you to members of the team, including cross-functional partners…&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;[30m]&amp;nbsp;&lt;a href=&quot;https://www.notion.so/sourcegraph/Types-of-interviews-sample-questions-f279f080583d49ee9f2c60e30c8cb1f7?pvs=4#cb00697e95304550a146c32563c0255d&quot;&gt;Cross-functional&lt;/a&gt; /&amp;nbsp;&lt;a href=&quot;https://www.notion.so/sourcegraph/Types-of-interviews-sample-questions-f279f080583d49ee9f2c60e30c8cb1f7?pvs=4#88b9f826dee04ef98afc2aeec35b877a&quot;&gt;Peer&lt;/a&gt; with an Account Executive&lt;/li&gt;\n&lt;li&gt;[45m] &lt;a href=&quot;https://www.notion.so/sourcegraph/Technical-Success-interview-process-902069565e1147b89ac98054179eb676?pvs=4#5a1021deb9b140258e35bbdd345f7754&quot;&gt;Live Panel Demo&lt;/a&gt; with Hiring Manager, 1 CE &amp;amp; 1 AE&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;&lt;strong&gt;🎉 Final Interview Stage &lt;/strong&gt;- we move you to our final round, where you gain a better understanding of our business and values holistically…&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;[30m]&amp;nbsp;&lt;a href=&quot;https://www.notion.so/sourcegraph/Types-of-interviews-sample-questions-f279f080583d49ee9f2c60e30c8cb1f7?pvs=4#e3a04291743048df87541a88aa8199dd&quot;&gt;Values&lt;/a&gt;&lt;/li&gt;\n&lt;li&gt;[15m] &lt;a href=&quot;https://www.notion.so/sourcegraph/How-to-work-with-Quinn-Slack-CEO-807673e0864d473f959cc4efd9642a5a?pvs=4#6f185c0e2011411eac5be9c675f9056c&quot;&gt;Leadership&lt;/a&gt; with co-founder&amp;nbsp;&lt;/li&gt;\n&lt;li&gt;We check references and conduct your background check&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;Please note - you are welcome to request additional conversations with anyone you would like to meet, but didn’t get to meet during the interview process.&lt;/p&gt;&lt;div class=&quot;content-conclusion&quot;&gt;&lt;h2&gt;&lt;span style=&quot;color: rgb(243, 78, 63);&quot;&gt;&lt;strong&gt;Learn more about us&lt;/strong&gt;&lt;/span&gt;&lt;/h2&gt;\n&lt;p&gt;You can learn more about what it is like to work at Sourcegraph by reading &lt;a href=&quot;https://sourcegraph.notion.site/d7614e3e9dc04c09ac2d42d57f1816e6?v=2a6d426dbae14390b155120b0c029ce0&quot;&gt;our handbook&lt;/a&gt;.&lt;/p&gt;\n&lt;p&gt;We are an ambitious team who are collectively working hard to build the most influential company in the world.&amp;nbsp; You can read more about our &lt;a href=&quot;https://sourcegraph.notion.site/What-it-s-like-working-at-Sourcegraph-119a8e11265880b18911eee4d9b7c460#119a8e1126588062b935fc66104b6115&quot;&gt;culture&lt;/a&gt;, &lt;a href=&quot;https://sourcegraph.notion.site/Compensation-Pay-Transparency-at-Sourcegraph-d58d0774f51b4b489d41c3628d30ff8d?pvs=74&quot;&gt;competitive compensation&lt;/a&gt; and &lt;a href=&quot;https://sourcegraph.notion.site/Benefits-Perks-dd1da4b6b3a64780abed010a144d34ba?pvs=74&quot;&gt;benefits&lt;/a&gt; here.&lt;/p&gt;\n&lt;p&gt;Sourcegraph is an equal opportunity workplace; we welcome people from all backgrounds.&amp;nbsp;&lt;/p&gt;\n&lt;p&gt;&lt;em&gt;Sourcegraph participates in &lt;/em&gt;&lt;a href=&quot;https://sourcegraph.notion.site/E-Verify-2ab3286dde3446d6bac2898c83610107&quot;&gt;&lt;em&gt;E-Verify&lt;/em&gt;&lt;/a&gt;&lt;em&gt; for U.S. Employees. &lt;/em&gt;&lt;/p&gt;&lt;/div&gt;","tags":"[\"javascript\",\"engineering\"]","pubDate":"2025-03-06T06:06:20.000Z","link":"https://job-boards.greenhouse.io/sourcegraph91/jobs/5468861004","slug":"senior-customer-engineer-pre-sales-solutions-engineer-west-ic4-sourcegraph-8672"},{"id":9083272386,"title":"Group Product Manager","company":"Atticus","image":"https://media.licdn.com/dms/image/v2/D560BAQHWkZ4dfdnqcQ/company-logo_200_200/company-logo_200_200/0/1667241664749/atticushq_logo?e=1743033600&v=beta&t=IKimC8hb4UT-bQFVefDOJ5jfW_yxRN7of8ZLj5GtZ4Q","description":"<h2><strong>About Atticus</strong></h2><p style=\"min-height:1.5em\">At any given time, 16 million Americans are experiencing a crisis that requires urgent help from our legal system or government. The right assistance could transform their lives. But today, most never get it.Atticus makes it easy for any sick or injured person in crisis to get the life-changing aid they deserve. In just five years, we’ve become the leading platform connecting people with disabilities to government benefits. We also help victims of accidents, misconduct, and violence get compensation from insurance. So far, we’ve gotten thousands of people access to over $2B in life-changing aid (see our <a target=\"_blank\" rel=\"noopener noreferrer\" class=\"c-link c-link--underline\" href=\"https://www.trustpilot.com/review/atticus.com\"><u>12,000+ five-star reviews</u></a>), and we’re just getting started.We’ve raised more than $50 million from top VC firms like Forerunner, GV (Google Ventures), and True Ventures. We're small but moving fast — our team grew from 89 to 151 last year and we expect to grow again in 2025.</p><p style=\"min-height:1.5em\"></p><h2><strong>The Job</strong></h2><p style=\"min-height:1.5em\">At every step of our funnel, we aim to make choosing Atticus a no-brainer. Our platform covers a lot: evaluating a client’s case, giving advice, matching them with the right lawyer, formalizing the arrangement, and helping both parties work together as the case progresses. We hold ourselves to an incredibly high bar, because we know it results in life-changing aid for those in need.  A few examples of what we’re currently working on:</p><ul style=\"min-height:1.5em\"><li><p style=\"min-height:1.5em\">Improve an existing framework to match clients to the best law firm in our network available (for their case, geography, client and firm preferences, etc.) and work with the Data Science team to turn it into a reality.</p></li><li><p style=\"min-height:1.5em\">Interview partner law firms to prioritize the next set of features we’ll build, then partner with Design and Engineering to craft a formal roadmap and mock up wireframes for our next product launch.</p></li><li><p style=\"min-height:1.5em\">Leverage data from our call center and case details to optimize how and when we reach clients across mediums and throughout their case lifecycle.</p></li><li><p style=\"min-height:1.5em\">Build a core data platform to support multiple verticals at varying scales with model-driven decision making and personalization throughout the funnel.</p></li></ul><h3><strong>Responsibilities</strong></h3><ul style=\"min-height:1.5em\"><li><p style=\"min-height:1.5em\">Get to know our users - both clients and lawyers - and understand their needs.</p></li><li><p style=\"min-height:1.5em\">Craft a product vision for our next phase of growth. Go deep on strategy: become an expert in our business model, current offering, and key milestones to inform your work.</p></li><li><p style=\"min-height:1.5em\">Develop a comprehensive product roadmap and build alignment for it with stakeholders and senior leadership.</p></li><li><p style=\"min-height:1.5em\">Work with engineering and design to build and ship new products and features. Play the role of conductor, coordinating and empowering others.</p></li><li><p style=\"min-height:1.5em\">Own key targets and metrics. Collect and analyze data, and use it to drive decision-making at a company level. Propose hypotheses, run experiments, and iterate quickly.</p></li></ul><h3><strong>Qualifications</strong></h3><ul style=\"min-height:1.5em\"><li><p style=\"min-height:1.5em\">7+ years of product management experience, building and shipping products at scale</p></li><li><p style=\"min-height:1.5em\">Demonstrated success in setting a product vision and strategy, and the ability to speak thoughtfully about the key decisions and tradeoffs you made</p></li><li><p style=\"min-height:1.5em\">Knowledge of best practices (from past work in a high-performing organization) and the ability to instill a great product culture as we grow</p></li><li><p style=\"min-height:1.5em\">Great communication and people skills — shown by great reviews from PMs, engineers and designers you’ve worked with</p></li><li><p style=\"min-height:1.5em\">Mastery of data platforms and ability to do your own analysis</p></li><li><p style=\"min-height:1.5em\">A demonstrated commitment to doing good and helping people</p></li><li><p style=\"min-height:1.5em\">Bonus: Early-stage startup experience - complex consumer business, two-sided marketplace, and/or B2B product</p></li></ul><p style=\"min-height:1.5em\">We are strongly committed to building a diverse team. If you’re from a background that’s underrepresented in tech, we’d particularly love to meet you.</p><p style=\"min-height:1.5em\"></p><h2><strong>Salary and Benefits</strong></h2><p style=\"min-height:1.5em\">This is a rare opportunity to join a startup that has strong traction (substantial funding, well-respected backers, tremendous growth, and many happy customers) but is still small enough that you can have a huge impact and play a role in shaping our culture.We’re a certified B Corporation tackling a critical social problem. Our mission to help people in need drives everything we do, and your work here will touch many lives.We offer competitive pay — including equity — and generous benefits:</p><ul style=\"min-height:1.5em\"><li><p style=\"min-height:1.5em\">Medical and dental insurance with 100% of employee premiums covered</p></li><li><p style=\"min-height:1.5em\">15 vacation days &amp; 16 paid holidays each year</p></li><li><p style=\"min-height:1.5em\">Free membership to OneMedical</p></li><li><p style=\"min-height:1.5em\">$1,000/year reimbursable stipend for education and training outside of work</p></li><li><p style=\"min-height:1.5em\">$600/year reimbursable stipend for internet service</p></li><li><p style=\"min-height:1.5em\">Up to $1,200/year student loan repayment assistance</p></li><li><p style=\"min-height:1.5em\">401(k) and optional HSA</p></li><li><p style=\"min-height:1.5em\">Free snacks, drinks, weekly lunches, and regular team dinners/events/retreats</p></li><li><p style=\"min-height:1.5em\">Humble, thoughtful, smart, fun colleagues</p></li></ul><p style=\"min-height:1.5em\"></p><h2><strong>Location</strong></h2><p style=\"min-height:1.5em\">This job is fully remote and we’re committed to empowering everyone with flexibility. Live wherever, work remotely, and travel to LA (on the company dime) as needed to be with your colleagues —somewhere between quarterly and yearly. We care a lot about building a great culture and we think some interactions need to happen in person, so we put a lot of thought into retreats, offsites, and other ways to gather.</p>","tags":"[\"management\",\"engineering\",\"b2b\",\"legal\"]","pubDate":"2025-03-06T02:19:58.537Z","link":"https://jobs.ashbyhq.com/atticus/7ff1cc66-dafd-4a7b-8f5d-1f0bd10dbc9c","slug":"group-product-manager-atticus-537"},{"id":4135544607,"title":"Product Manager","company":"Atticus","image":"https://media.licdn.com/dms/image/v2/D560BAQHWkZ4dfdnqcQ/company-logo_200_200/company-logo_200_200/0/1667241664749/atticushq_logo?e=1743033600&v=beta&t=IKimC8hb4UT-bQFVefDOJ5jfW_yxRN7of8ZLj5GtZ4Q","description":"<h2><strong>About Atticus</strong></h2><p style=\"min-height:1.5em\">At any given time, 16 million Americans are experiencing a crisis that requires urgent help from our legal system or government. The right assistance could transform their lives. But today, most never get it.Atticus makes it easy for any sick or injured person in crisis to get the life-changing aid they deserve. In just five years, we’ve become the leading platform connecting people with disabilities to government benefits. We also help victims of accidents, misconduct, and violence get compensation from insurance. So far, we’ve gotten thousands of people access to over $2B in life-changing aid (see our <a target=\"_blank\" rel=\"noopener noreferrer\" class=\"c-link c-link--underline\" href=\"https://www.trustpilot.com/review/atticus.com\"><u>12,000+ five-star reviews</u></a>), and we’re just getting started.We’ve raised more than $50 million from top VC firms like Forerunner, GV (Google Ventures), and True Ventures. We're small but moving fast — our team grew from 89 to 151 last year and we expect to grow again in 2025.</p><p style=\"min-height:1.5em\"></p><h2><strong>The Job</strong></h2><p style=\"min-height:1.5em\">At every step of our funnel, we aim to make choosing Atticus a no-brainer. Our platform covers a lot: evaluating a client’s case, giving advice, matching them with the right lawyer, formalizing the arrangement, and helping both parties work together as the case progresses. We hold ourselves to an incredibly high bar, because we know it results in life-changing aid for those in need.  A few examples of what we’re currently working on:</p><ul style=\"min-height:1.5em\"><li><p style=\"min-height:1.5em\">Improve an existing framework to match clients to the best law firm in our network available (for their case, geography, client and firm preferences, etc.) and work with the Data Science team to turn it into a reality.</p></li><li><p style=\"min-height:1.5em\">Interview partner law firms to prioritize the next set of features we’ll build, then partner with Design and Engineering to craft a formal roadmap and mock up wireframes for our next product launch.</p></li><li><p style=\"min-height:1.5em\">Leverage data from our call center and case details to optimize how and when we reach clients across mediums and throughout their case lifecycle.</p></li><li><p style=\"min-height:1.5em\">Build a core data platform to support multiple verticals at varying scales with model-driven decision making and personalization throughout the funnel.</p></li></ul><h3><strong>Responsibilities</strong></h3><ul style=\"min-height:1.5em\"><li><p style=\"min-height:1.5em\">Get to know our users - both clients and lawyers - and understand their needs.</p></li><li><p style=\"min-height:1.5em\">Craft a product vision for our next phase of growth. Go deep on strategy: become an expert in our business model, current offering, and key milestones to inform your work.</p></li><li><p style=\"min-height:1.5em\">Develop a comprehensive product roadmap and build alignment for it with stakeholders and senior leadership.</p></li><li><p style=\"min-height:1.5em\">Work with engineering and design to build and ship new products and features. Play the role of conductor, coordinating and empowering others.</p></li><li><p style=\"min-height:1.5em\">Own key targets and metrics. Collect and analyze data, and use it to drive decision-making at a company level. Propose hypotheses, run experiments, and iterate quickly.</p></li></ul><h3><strong>Qualifications</strong></h3><ul style=\"min-height:1.5em\"><li><p style=\"min-height:1.5em\">3+ years of product management experience, building and shipping products at scale</p></li><li><p style=\"min-height:1.5em\">Demonstrated success in setting a product vision and strategy, and the ability to speak thoughtfully about the key decisions and tradeoffs you made</p></li><li><p style=\"min-height:1.5em\">Knowledge of best practices (from past work in a high-performing organization) and the ability to instill a great product culture as we grow</p></li><li><p style=\"min-height:1.5em\">Great communication and people skills — shown by great reviews from PMs, engineers and designers you’ve worked with</p></li><li><p style=\"min-height:1.5em\">Mastery of data platforms and ability to do your own analysis</p></li><li><p style=\"min-height:1.5em\">A demonstrated commitment to doing good and helping people</p></li><li><p style=\"min-height:1.5em\">Bonus: Early-stage startup experience - complex consumer business, two-sided marketplace, and/or B2B product</p></li></ul><p style=\"min-height:1.5em\">We are strongly committed to building a diverse team. If you’re from a background that’s underrepresented in tech, we’d particularly love to meet you.</p><p style=\"min-height:1.5em\"></p><h2><strong>Salary and Benefits</strong></h2><p style=\"min-height:1.5em\">This is a rare opportunity to join a startup that has strong traction (substantial funding, well-respected backers, tremendous growth, and many happy customers) but is still small enough that you can have a huge impact and play a role in shaping our culture.We’re a certified B Corporation tackling a critical social problem. Our mission to help people in need drives everything we do, and your work here will touch many lives.We offer competitive pay — including equity — and generous benefits:</p><ul style=\"min-height:1.5em\"><li><p style=\"min-height:1.5em\">Medical and dental insurance with 100% of employee premiums covered</p></li><li><p style=\"min-height:1.5em\">15 vacation days &amp; 16 paid holidays each year</p></li><li><p style=\"min-height:1.5em\">Free membership to OneMedical</p></li><li><p style=\"min-height:1.5em\">$1,000/year reimbursable stipend for education and training outside of work</p></li><li><p style=\"min-height:1.5em\">$600/year reimbursable stipend for internet service</p></li><li><p style=\"min-height:1.5em\">Up to $1,200/year student loan repayment assistance</p></li><li><p style=\"min-height:1.5em\">401(k) and optional HSA</p></li><li><p style=\"min-height:1.5em\">Free snacks, drinks, weekly lunches, and regular team dinners/events/retreats</p></li><li><p style=\"min-height:1.5em\">Humble, thoughtful, smart, fun colleagues</p></li></ul><p style=\"min-height:1.5em\"></p><h2><strong>Location</strong></h2><p style=\"min-height:1.5em\">This job is fully remote and we’re committed to empowering everyone with flexibility. Live wherever, work remotely, and travel to LA (on the company dime) as needed to be with your colleagues —somewhere between quarterly and yearly. We care a lot about building a great culture and we think some interactions need to happen in person, so we put a lot of thought into retreats, offsites, and other ways to gather.</p>","tags":"[\"management\",\"engineering\",\"b2b\",\"legal\"]","pubDate":"2025-03-06T02:19:18.353Z","link":"https://jobs.ashbyhq.com/atticus/67f7fa65-55ab-4838-bc9d-f15a9c2ccfea","slug":"product-manager-atticus-3279"},{"id":3194067183,"title":"Security Analyst","company":"Sardine","image":"https://avatars.githubusercontent.com/u/65879301?s=200&v=4","description":"<p style=\"min-height:1.5em\"><strong>Who we are:</strong></p><p style=\"min-height:1.5em\">We are a leader in fraud prevention and AML compliance. Our platform uses device intelligence, behavior biometrics, machine learning, and AI to stop fraud before it happens. Today, over 300 banks, retailers, and fintechs worldwide use Sardine to stop identity fraud, payment fraud, account takeovers, and social engineering scams. We have raised $145M from world-class investors, including Andreessen Horowitz, Activant, Visa, Experian, FIS, and Google Ventures.</p><p style=\"min-height:1.5em\"></p><p style=\"min-height:1.5em\"><strong>Our culture:</strong></p><ul style=\"min-height:1.5em\"><li><p style=\"min-height:1.5em\">We have hubs in the Bay Area, NYC, Austin, and Toronto. However, we maintain a remote-first work culture. #WorkFromAnywhere</p></li><li><p style=\"min-height:1.5em\">We hire talented, self-motivated individuals with extreme ownership and high growth orientation. </p></li><li><p style=\"min-height:1.5em\">We value performance and not hours worked. We believe you shouldn't have to miss your family dinner, your kid's school play, friends get-together, or doctor's appointments for the sake of adhering to an arbitrary work schedule.</p></li></ul><p style=\"min-height:1.5em\"></p><p style=\"min-height:1.5em\"><strong>About the role:</strong></p><p style=\"min-height:1.5em\">Sardine is seeking a versatile and driven Security Analyst to join our team. This role blends the critical functions of Security Operations (SOC) and Governance, Risk, and Compliance (GRC), offering a unique opportunity to contribute to both the proactive defense and strategic management of our security posture. This position requires a strong understanding of security operations, incident response, risk management frameworks, and regulatory compliance.</p><p style=\"min-height:1.5em\"></p><p style=\"min-height:1.5em\">This role will focus on facilitating the reduction of risk to our environment through effective communications and partnerships. You will be responsible for communicating information to auditors, regulators and leaders while partnering with internal teams to facilitate successful compliance and review exercises across multiple domains.  </p><p style=\"min-height:1.5em\"></p><p style=\"min-height:1.5em\">You will also be responsible for monitoring, analyzing, and responding to security events and incidents, ensuring the confidentiality, integrity, and availability of our critical systems and data.  You will play a key part in protecting our organization from evolving cyber threats by proactively identifying vulnerabilities, implementing security controls, and contributing to the continuous improvement of our security posture.</p><p style=\"min-height:1.5em\"></p><p style=\"min-height:1.5em\"><strong>Key Responsibilities:</strong></p><p style=\"min-height:1.5em\"></p><h3><strong>Governance, Risk, and Compliance (GRC):</strong></h3><ul style=\"min-height:1.5em\"><li><p style=\"min-height:1.5em\">Develop, implement, and maintain security policies, standards, and procedures in line with regulatory requirements (e.g., NIST, ISO 27001, HIPAA, PCI DSS, GDPR).</p></li><li><p style=\"min-height:1.5em\">Conduct risk assessments to identify and mitigate threats to information assets.</p></li><li><p style=\"min-height:1.5em\">Monitor and report on compliance, tracking the effectiveness of security controls.</p></li><li><p style=\"min-height:1.5em\">Manage security audits, coordinate with external auditors, and address findings.</p></li><li><p style=\"min-height:1.5em\">Maintain security documentation and ensure alignment with evolving regulations.</p></li><li><p style=\"min-height:1.5em\">Provide security awareness training and support incident response planning.</p></li></ul><h3><strong>Security Operations Center (SOC):</strong></h3><ul style=\"min-height:1.5em\"><li><p style=\"min-height:1.5em\">Monitor SIEM systems and security tools for threats and vulnerabilities.</p></li><li><p style=\"min-height:1.5em\">Investigate and respond to security incidents, documenting analysis and remediation steps.</p></li><li><p style=\"min-height:1.5em\">Perform vulnerability scanning, penetration testing, and security assessments.</p></li><li><p style=\"min-height:1.5em\">Collaborate with IT teams to implement security controls and remediate risks.</p></li><li><p style=\"min-height:1.5em\">Stay informed on emerging threats and contribute to threat intelligence initiatives.</p></li><li><p style=\"min-height:1.5em\">Participate in incident response exercises and develop security reports for management.</p></li></ul><p style=\"min-height:1.5em\"></p><p style=\"min-height:1.5em\"><strong>An ideal candidate has:</strong></p><ul style=\"min-height:1.5em\"><li><p style=\"min-height:1.5em\">3+ years working in a fast-paced role.</p></li><li><p style=\"min-height:1.5em\">Strong understanding of security frameworks and standards (e.g., NIST, ISO 27001, SOC 2).</p></li><li><p style=\"min-height:1.5em\">Knowledge of relevant regulations and compliance requirements (e.g., HIPAA, PCI DSS, GDPR).</p></li><li><p style=\"min-height:1.5em\">Experience with security tools and technologies, such as SIEM, vulnerability scanners, intrusion detection/prevention systems, and firewalls.   </p></li><li><p style=\"min-height:1.5em\">Familiarity with risk assessment methodologies and frameworks.</p></li><li><p style=\"min-height:1.5em\">Experience in developing and implementing security policies, standards, and procedures.</p></li><li><p style=\"min-height:1.5em\">Strong analytical, problem-solving, and incident response skills.</p></li><li><p style=\"min-height:1.5em\">Excellent communication and interpersonal skills, with the ability to effectively interact with technical and non-technical stakeholders.   </p></li><li><p style=\"min-height:1.5em\">Ability to work independently and as part of a team.   </p></li><li><p style=\"min-height:1.5em\">Ability to travel if needed.</p></li><li><p style=\"min-height:1.5em\">Working knowledge of MacOS.</p></li></ul><p style=\"min-height:1.5em\"></p><p style=\"min-height:1.5em\"><strong>Nice to have qualifications:</strong></p><ul style=\"min-height:1.5em\"><li><p style=\"min-height:1.5em\">Experience with scripting languages (e.g., Python, Bash) or automation tools.</p></li><li><p style=\"min-height:1.5em\">Knowledge of cloud security best practices (e.g., AWS, Azure, GCP).</p></li><li><p style=\"min-height:1.5em\">Experience with penetration testing and ethical hacking.</p></li><li><p style=\"min-height:1.5em\">Familiarity with threat intelligence platforms and data feeds.</p></li><li><p style=\"min-height:1.5em\">Experience in fintech.</p></li><li><p style=\"min-height:1.5em\">Exposure to HR Software such as Rippling.</p></li></ul><p style=\"min-height:1.5em\"></p><p style=\"min-height:1.5em\">The compensation offered for this role will depend on various factors, including the candidate's location, qualifications, work history, and interview performance, and may differ from the stated range.</p><p style=\"min-height:1.5em\"></p><p style=\"min-height:1.5em\"><strong>Benefits we offer:</strong></p><ul style=\"min-height:1.5em\"><li><p style=\"min-height:1.5em\">Generous compensation in cash and equity</p></li><li><p style=\"min-height:1.5em\">Early exercise for all options, including pre-vested</p></li><li><p style=\"min-height:1.5em\">Work from anywhere: Remote-first Culture</p></li><li><p style=\"min-height:1.5em\">Flexible paid time off, Year-end break, Self care days off</p></li><li><p style=\"min-height:1.5em\">Health insurance, dental, and vision coverage for employees and dependents - <em>US and Canada specific</em></p></li><li><p style=\"min-height:1.5em\">4% matching in 401k / RRSP - <em>US and Canada specific</em></p></li><li><p style=\"min-height:1.5em\">MacBook Pro delivered to your door</p></li><li><p style=\"min-height:1.5em\">One-time stipend to set up a home office — desk, chair, screen, etc.</p></li><li><p style=\"min-height:1.5em\">Monthly meal stipend</p></li><li><p style=\"min-height:1.5em\">Monthly social meet-up stipend</p></li><li><p style=\"min-height:1.5em\">Annual health and wellness stipend</p></li><li><p style=\"min-height:1.5em\">Annual Learning stipend</p></li><li><p style=\"min-height:1.5em\">Unlimited access to an expert financial advisory</p></li></ul><p style=\"min-height:1.5em\"></p><p style=\"min-height:1.5em\">Join a fast-growing company with world-class professionals from around the world. If you are seeking a meaningful career, you found the right place, and we would love to hear from you.</p>","tags":"[\"management\",\"engineering\",\"aws\"]","pubDate":"2025-03-05T21:01:33.291Z","link":"https://jobs.ashbyhq.com/sardine/11f0689f-b25a-4ecd-9a3f-d5b3168baeb3","slug":"security-analyst-sardine-3064"},{"id":1607725297,"title":"People Success Partner","company":"Airalo","image":"https://lever-client-logos.s3.us-west-2.amazonaws.com/55028a36-609c-479c-9553-d4689ff2dd8c-1669620566663.png","description":"<div><b>About Airalo</b></div><div>Alo! Airalo is the world’s first eSIM store that helps people connect in over 200+ countries and regions across the globe. We are building the next digital service that revolutionizes the telecom industry. We are a travel-tech company and an equal-opportunity environment that values and executes diversity, inclusion, and equity. Our team is spread across 50+ countries and six continents. What glues us together is our commitment to changing the way you connect<span style=\"font-size: 13.3333px\">. </span></div><div><br></div><div><b>About you</b></div><div>We hope that you care deeply about the quality of your work, the intrinsic worth of tasks, and the success of your team. You are self-disciplined and do not require micromanagement in terms of your skillset and work ethic. You do your best to flourish as an individual every day while working hard to foster a collaborative team environment. You believe in the importance of being — and staying — authentic, honest, positive, and kind. You are a good interlocutor with clear and concise communication. You are able to manage multiple projects, have an analytical mind, pay keen attention to detail, and love to get your hands dirty. You are cognizant, tolerant, and welcoming of vulnerabilities and cultural differences.</div><div><br></div><div><b>About the Role</b></div><div><b>Position</b>: Full-time / Employee</div><div><b>Location:</b>&nbsp;Remote-first </div><div><b>Benefits:</b>&nbsp;Health Insurance, work-from-anywhere stipend, annual wellness &amp; learning credits, annual all-expenses-paid company retreat in a gorgeous destination &amp; other benefits</div><div><br></div><div>As a&nbsp;<b>People Success Partner</b>, you will be responsible for partnering with all leadership structures in your assigned teams, as well as the entire People &amp; Talent team.</div><h3>Responsibilities include but are not limited to:</h3><li>Partner with our Tech teams to ensure they are high-performing, engaged, and supported</li><li>Coach and advise managers, providing clear, steady guidance to help them navigate challenges with confidence and to support them to set up their teams for success</li><li>Manage team member relations issues, including performance concerns, grievances disciplinary actions if necessary, ensuring all our team members are treated with empathy and fairness</li><li>Be knowledgeable and considerate of the complexity of supporting a fully remote team, across almost 60 countries. Both by being knowledgable about employment law, and cultural nuances</li><li>Support leaders in ensuring People's OKR’s are met, such as regular Performance Reviews, Compensation Reviews, talent development and engagement initiatives etc.</li><li>Design and implement People programs that form part of our People OKRs such as job leveling frameworks, performance management enhancements, and engagement strategies</li><li>Working closely with the People Operations team to support and share feedback on policies and processes</li><li>Support with yearly Headcount Planning &amp; Forecasts with the People Director, Talent, and Hiring Managers</li><li>Serve as a strategic thought partner to leaders, offering insights that drive both business and People success</li><li>Champion a positive, inclusive workplace culture that fosters growth and collaboration</li><li>Build strong, trust-based relationships with stakeholders at all levels</li>,<h3>Must-haves:</h3><li><b>Resilience &amp; adaptability:</b> You thrive in fast-evolving environments and can confidently guide yourself and managers through change. You’re the kind of person who can shift with ease from coaching a manager through a tough conversation, to project work on job leveling structures.</li><li><b>Strong international business partnering experience in startup/scale-up:</b> You’ve worked with various stakeholders across multiple countries, advising on both day-to-day and strategic People matters</li><li><b>Exceptional prioritization skills:</b> You know how to juggle projects and requests, keeping stakeholders informed while staying focused on what matters most.</li><li><b>Customer-centric approach:</b> You’re passionate about delivering a great People experience and handle interactions with attention to detail, sound judgement and discretion in confidential or sensitive situations.</li><li><b>Passion for building:</b> You enjoy creating and shaping People programs whether it’s refining performance management, enhancing engagement strategies, or supporting leadership development.</li><li><b>Excellent communication &amp; stakeholder management:</b> You’re a strong communicator who can influence and build relationships at all levels. You establish trust early on and guide with a steady, consistent approach, staying calm even when the pace picks up. You’re clear, direct, and empathetic, not shying away from tough conversations.</li><li><b>Self-starter attitude:</b> You have a bias for action rather than waiting, you are organized, and able to drive initiatives and tasks independently</li><li><b>Analytical &amp; problem-solving skills:</b> You know how to gather the right insights and use them. Beyond just looking at the surface, you dig into root causes, identify patterns, and connect the dots to drive informed decisions.</li><li><b>Strategic mindset:</b> You understand both the big picture and the operational details, balancing between creating solutions with empathy that also align with business goals.</li><li><b>Commitment to inclusion &amp; belonging:</b> You champion diversity and foster an environment where everyone feels valued and included. You’re adaptable, culturally aware, and understand the nuances of supporting a fully remote, globally distributed team.</li>,<h3>Good to have:</h3><li>Experience with remote-first work environments.</li><li>Experience working in a scaling startup or global organization in tech.</li><li>Partnering with Engineering and Product teams</li><li>Knowledge of different labor laws (Germany, Spain, Portugal, Netherlands, Poland)</li><li>Experience with the tools we use or ones similar to them (Slack, Notion, HiBob, Deel, Kamsa, Google Workspace, Docusign)</li><div><b>#EMEA</b></div><div><br></div><div><br></div><div>We sincerely thank all applicants in advance for submitting their interest in this opportunity. Airalo is an equal opportunity employer and values diversity, equity &amp; inclusion. We do not discriminate on the basis of race, religion, national origin, gender, sexual orientation, age, marital status, veteran status, or disability status. We are committed to providing reasonable accommodations upon request for individuals with disabilities throughout our job interview process.</div>","tags":"[\"management\",\"engineering\",\"aws\"]","pubDate":"2025-03-05T20:15:07.627Z","link":"https://jobs.lever.co/airalo/3e880cc5-d3fe-4e71-891b-afd5a4c07fa6","slug":"people-success-partner-airalo-9750"},{"id":2279990388,"title":"Software Engineer [IC1]","company":"Sourcegraph","image":"https://avatars.githubusercontent.com/u/3979584?s=200&v=4","description":"&lt;div class=&quot;content-intro&quot;&gt;&lt;h2&gt;&lt;span style=&quot;color: rgb(243, 78, 63);&quot;&gt;&lt;strong&gt;Who we are&lt;/strong&gt;&lt;/span&gt;&lt;/h2&gt;\n&lt;p&gt;Our mission at Sourcegraph is to make it so that &lt;a href=&quot;https://www.notion.so/sourcegraph/Mission-values-e9d37e6b972a4ef395c3076aea2bd07d?pvs=4&quot;&gt;everyone can code&lt;/a&gt;, not just ~0.1% of the population.&amp;nbsp;&lt;/p&gt;\n&lt;p&gt;We are transforming how the world’s most important companies build software by industrializing development with AI. Today, most professional developers spend a disproportionate amount of time understanding code and performing repetitive, low-level tasks—leaving less time for innovation and meaningful impact.&lt;/p&gt;\n&lt;p&gt;We’re changing that. Sourcegraph brings AI-powered search and agents to the enterprise, helping teams automate the mundane and amplify what developers do best— solving hard problems and creating great products.&lt;/p&gt;\n&lt;p&gt;Here’s how we’re making a difference:&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;&lt;strong&gt;Accelerating developers &lt;/strong&gt;with AI agents that deliver insights and precision—enabling 5x faster test creation, 30% increase in merge requests, and saving 20 minutes per developer daily.&lt;/li&gt;\n&lt;li&gt;&lt;strong&gt;Automating repetitive tasks,&lt;/strong&gt; from remediating vulnerabilities (saving teams 1,000+ hours annually) to speeding up migrations that would take years to months.&amp;nbsp;&lt;/li&gt;\n&lt;li&gt;&lt;strong&gt;Enabling innovation&lt;/strong&gt; by addressing complex problems like automated bug triage, vulnerability detection, and AI-driven code reviews seamlessly integrated into workflows.&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;Trusted by 7/10 top software companies by market cap, 4/6 top US banks and many of the companies leading global innovation, like Stripe, Indeed, Tesla, and 1Password, and with $225M in funding from investors like &lt;a href=&quot;https://techcrunch.com/2021/07/13/sourcegraph-raises-125m-series-d-on-2-6b-valuation-for-universal-code-search-tool/&quot;&gt;a16z&lt;/a&gt;, &lt;a href=&quot;https://about.sourcegraph.com/blog/series-c-with-sequoia/&quot;&gt;Sequoia&lt;/a&gt;, and &lt;a href=&quot;https://www.redpoint.com/companies/sourcegraph/&quot;&gt;Redpoint&lt;/a&gt;, we are building the tools that will define the next era of enterprise software development.&lt;/p&gt;\n&lt;p&gt;If you’re passionate about solving the hardest problems in software and shaping the future of technology, join us. Let’s build something extraordinary together.&lt;/p&gt;&lt;/div&gt;&lt;p&gt;&lt;strong&gt;Devs and interns wanted&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;For arduous journey, building late into night or early morning, working by screenlight, grinding to remake the world of code, to build and accelerate the engines of bits that move the world, competitive wages, but true reward is what you build—the code that makes the code for 7 out of 10 top software companies by market cap&lt;/strong&gt;&lt;/p&gt;\n&lt;h2&gt;&lt;span style=&quot;color: rgb(243, 78, 63);&quot;&gt;&lt;strong&gt;Hours &amp;amp; location&lt;/strong&gt;&lt;/span&gt;&lt;/h2&gt;\n&lt;p&gt;🌎 While we hire &lt;a href=&quot;https://sourcegraph.notion.site/How-we-engage-talent-outside-of-the-US-218f7193695a46cbb1ef39ef9c1f72d4&quot;&gt;almost anywhere&lt;/a&gt; in the world, we have office hubs in select locations and expect this person to reside in San Francisco to be able to work from one of our office locations for several days per week.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Required locations:&lt;/strong&gt;&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;San Francisco, CA&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;We do not subscribe to “I do my best work when I work 40 hours a week.”&amp;nbsp; People we hire at Sourcegraph believe that building outstanding things means working very hard — smarter and more hours than the competition.&lt;/p&gt;\n&lt;h2&gt;&lt;span style=&quot;color: rgb(243, 78, 63);&quot;&gt;&lt;strong&gt;Why this job is exciting&lt;/strong&gt;&lt;/span&gt;&lt;/h2&gt;\n&lt;p&gt;You will contribute to various aspects of our software development cycle, impacting the growth and effectiveness of our products. You will work closely with a talented team of engineers, product managers, and designers to build features that enhance the capabilities of Sourcegraph&#39;s entire platform.&lt;/p&gt;\n&lt;p&gt;📅 Within one month, you will…&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;Design and implement new features in collaboration with your team.&lt;/li&gt;\n&lt;li&gt;Directly enhance product functionality, leading to improved user satisfaction and increased adoption rates.&lt;/li&gt;\n&lt;li&gt;Have high productivity and output, with frequent and meaningful commits.&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;📅 Within three months, you will…&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;Contribute to code reviews, maintain high coding standards, and improve existing codebase for better performance and scalability.&lt;/li&gt;\n&lt;li&gt;Elevate the quality and maintainability of the code, reducing bugs and facilitating future feature development.&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;📅 Within six months, you will…&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;Deliver clearly defined projects of small to medium technical risk.&lt;/li&gt;\n&lt;li&gt;Apply diligence through the entire software lifecycle: planning, coding, documenting, shipping, demoing, supporting, and improving your software over time.&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;📅 Within one year, you will…&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;Directly contribute to achieving Sourcegraph’s strategic goals and long-term success.&lt;/li&gt;\n&lt;/ul&gt;\n&lt;h2&gt;&lt;span style=&quot;color: rgb(243, 78, 63);&quot;&gt;&lt;strong&gt;About you&lt;/strong&gt;&lt;/span&gt;&lt;/h2&gt;\n&lt;p&gt;You are driven to do your best work by working smarter and harder than everyone else. You thrive in fast-paced environments. You have a knack for juggling competing priorities. You get stuff done.&amp;nbsp;&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;You have a CS degree from a top engineering school&lt;/li&gt;\n&lt;li&gt;You have an interest or experience in Go, TypeScript, or similar programming languages.&lt;/li&gt;\n&lt;li&gt;You have strong problem-solving skills and a passion for technology.&lt;/li&gt;\n&lt;li&gt;Excellent communication and teamwork abilities.&lt;/li&gt;\n&lt;li&gt;You always look for ways to uplevel your skills.&lt;/li&gt;\n&lt;li&gt;You seek out work, rather than waiting for work.&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;Nice to haves:&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;SWE experience on a large engineering team,&lt;/li&gt;\n&lt;li&gt;Open source contributions.&lt;/li&gt;\n&lt;li&gt;A project that showed up on Hacker News.&lt;/li&gt;\n&lt;/ul&gt;\n&lt;h2&gt;&lt;span style=&quot;color: rgb(243, 78, 63);&quot;&gt;&lt;strong&gt;Level&lt;/strong&gt;&lt;/span&gt;&lt;/h2&gt;\n&lt;p&gt;📊 This job is an IC1.&amp;nbsp; You can read more about &lt;a href=&quot;https://www.notion.so/sourcegraph/Leveling-Guide-0e1b5c76ada64b9caac387f8b7c4fc66&quot;&gt;our job leveling philosophy&lt;/a&gt; in our Handbook.&lt;/p&gt;\n&lt;h2&gt;&lt;span style=&quot;color: rgb(243, 78, 63);&quot;&gt;&lt;strong&gt;Compensation&lt;/strong&gt;&lt;/span&gt;&lt;/h2&gt;\n&lt;p&gt;&lt;strong&gt;💸 We pay you an above-average salary&lt;/strong&gt; because we want to hire the best people who are fully focused on helping Sourcegraph succeed, not worried about paying bills. As an &lt;a href=&quot;https://sourcegraph.notion.site/Mission-values-e9d37e6b972a4ef395c3076aea2bd07d&quot;&gt;open and transparent&lt;/a&gt; company that values &lt;a href=&quot;https://www.notion.so/sourcegraph/Compensation-Pay-Transparency-at-Sourcegraph-d58d0774f51b4b489d41c3628d30ff8d?pvs=4&quot;&gt;competitive compensation&lt;/a&gt;, our compensation ranges are visible to every single Sourcegraph teammate.&lt;/p&gt;\n&lt;p&gt;Your salary is determined by your pay band for the IC1 job level. For determining pay bands, we use a number of market and data-driven salary sources, along with your location zone, and target the high-end of the range to ensure we’re always paying above market regardless of where you live in the world. Both U.S. and international locations are divided into one of four zones, determined by the cost of labor index for each area. The salary for a successful candidate will be based on level, job-related skills, experience, qualifications, and location zone. Please note that the salaries below may be adjusted in the future.&lt;/p&gt;\n&lt;p&gt;💰 The target compensation for this role is based on the IC1 pay band for your zone. The start of the IC1 pay band is $129,500.&lt;/p&gt;\n&lt;p&gt;Please speak with a recruiter for additional information regarding zone locations.&lt;/p&gt;\n&lt;p&gt;📈 In addition to our cash compensation, we offer equity (because when we succeed as a company, we want you to succeed, too) and generous &lt;a href=&quot;https://sourcegraph.notion.site/Benefits-Perks-dd1da4b6b3a64780abed010a144d34ba&quot;&gt;perks &amp;amp; benefits&lt;/a&gt;.&lt;/p&gt;\n&lt;h2&gt;&lt;span style=&quot;color: rgb(243, 78, 63);&quot;&gt;&lt;strong&gt;Interview process&amp;nbsp;&lt;/strong&gt;&lt;/span&gt;&lt;/h2&gt;\n&lt;p&gt;&lt;em&gt;Below is the interview process you can expect for this role (you can read more about &lt;/em&gt;&lt;a href=&quot;https://sourcegraph.notion.site/Types-of-interviews-f279f080583d49ee9f2c60e30c8cb1f7&quot;&gt;&lt;em&gt;the types of interviews&lt;/em&gt;&lt;/a&gt;&lt;em&gt; in our Handbook). It may look like a lot of steps, but rest assured that we move quickly and the steps are designed to help you get the information needed to determine if we’re the right fit for you… Interviewing is a two-way street, after all!&amp;nbsp;&lt;/em&gt;&lt;/p&gt;\n&lt;p&gt;We expect the interview process to take 3.5 hours in total&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;👋 Introduction Stage&lt;/strong&gt; - we have initial conversations to get to know you better…&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;[30m] &lt;a href=&quot;https://www.notion.so/sourcegraph/Types-of-interviews-sample-questions-f279f080583d49ee9f2c60e30c8cb1f7?pvs=4#99be5ff628b2414194a0ba79d9f25f13&quot;&gt;Recruiter Screen&lt;/a&gt;&lt;/li&gt;\n&lt;li&gt;[15m] &lt;a href=&quot;https://www.notion.so/sourcegraph/Types-of-interviews-sample-questions-f279f080583d49ee9f2c60e30c8cb1f7?pvs=4#1919882c0cf147c487eb1df40db8a694&quot;&gt;Hiring Manager Screen&lt;/a&gt;&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;&lt;strong&gt;🧑‍💻 Team Interview Stage&lt;/strong&gt; - we then schedule an all-day onsite interview to delve into your experience in more depth and introduce you to members of the team, including cross-functional partners…&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;[60m] &lt;a href=&quot;https://sourcegraph.notion.site/Resources-for-Candidates-Engineering-Interview-Process-c37a70dea5794085bee0c0818c9ef0b3#e83edd987754460e839138a4bbfd592e&quot;&gt;Coding Exercise&lt;/a&gt;&lt;/li&gt;\n&lt;li&gt;[60m] &lt;a href=&quot;https://www.notion.so/sourcegraph/Resources-for-Candidates-Engineering-Interview-Process-c37a70dea5794085bee0c0818c9ef0b3?pvs=4#b37f3b535e894775b9c64f53675b5549&quot;&gt;System Design&lt;/a&gt;&lt;/li&gt;\n&lt;li&gt;[45m] &lt;a href=&quot;https://sourcegraph.notion.site/Types-of-interviews-sample-questions-f279f080583d49ee9f2c60e30c8cb1f7#cb00697e95304550a146c32563c0255d&quot;&gt;Cross-functional Team Collaboration Interview&lt;/a&gt; /&lt;a href=&quot;https://www.notion.so/sourcegraph/Types-of-interviews-sample-questions-f279f080583d49ee9f2c60e30c8cb1f7?pvs=4#e3a04291743048df87541a88aa8199dd&quot;&gt; Values Interview&lt;/a&gt;&lt;/li&gt;\n&lt;li&gt;We check references and conduct a background check&lt;/li&gt;\n&lt;/ul&gt;&lt;div class=&quot;content-conclusion&quot;&gt;&lt;h2&gt;&lt;span style=&quot;color: rgb(243, 78, 63);&quot;&gt;&lt;strong&gt;Learn more about us&lt;/strong&gt;&lt;/span&gt;&lt;/h2&gt;\n&lt;p&gt;You can learn more about what it is like to work at Sourcegraph by reading &lt;a href=&quot;https://sourcegraph.notion.site/d7614e3e9dc04c09ac2d42d57f1816e6?v=2a6d426dbae14390b155120b0c029ce0&quot;&gt;our handbook&lt;/a&gt;.&lt;/p&gt;\n&lt;p&gt;We are an ambitious team who are collectively working hard to build the most influential company in the world.&amp;nbsp; You can read more about our &lt;a href=&quot;https://sourcegraph.notion.site/What-it-s-like-working-at-Sourcegraph-119a8e11265880b18911eee4d9b7c460#119a8e1126588062b935fc66104b6115&quot;&gt;culture&lt;/a&gt;, &lt;a href=&quot;https://sourcegraph.notion.site/Compensation-Pay-Transparency-at-Sourcegraph-d58d0774f51b4b489d41c3628d30ff8d?pvs=74&quot;&gt;competitive compensation&lt;/a&gt; and &lt;a href=&quot;https://sourcegraph.notion.site/Benefits-Perks-dd1da4b6b3a64780abed010a144d34ba?pvs=74&quot;&gt;benefits&lt;/a&gt; here.&lt;/p&gt;\n&lt;p&gt;Sourcegraph is an equal opportunity workplace; we welcome people from all backgrounds.&amp;nbsp;&lt;/p&gt;\n&lt;p&gt;&lt;em&gt;Sourcegraph participates in &lt;/em&gt;&lt;a href=&quot;https://sourcegraph.notion.site/E-Verify-2ab3286dde3446d6bac2898c83610107&quot;&gt;&lt;em&gt;E-Verify&lt;/em&gt;&lt;/a&gt;&lt;em&gt; for U.S. Employees. &lt;/em&gt;&lt;/p&gt;&lt;/div&gt;","tags":"[\"typescript\",\"engineering\"]","pubDate":"2025-03-05T19:32:57.000Z","link":"https://job-boards.greenhouse.io/sourcegraph91/jobs/5463379004","slug":"software-engineer-ic1-sourcegraph-7695"},{"id":9139494404,"title":"Head of Sales","company":"Livekit","image":"https://avatars.githubusercontent.com/u/69438833?s=200&v=4","description":"<p style=\"min-height:1.5em\">At LiveKit, we build open-source APIs to power the future of computing. We are a company of engineers building software stacks for other engineers.</p><p style=\"min-height:1.5em\"><strong>You'll thrive at here if you:</strong></p><ul style=\"min-height:1.5em\"><li><p style=\"min-height:1.5em\">obsess with crafting code that is fast, reliable and practical for the problem</p></li><li><p style=\"min-height:1.5em\">are known as the go-to person for tackling tough technical problems</p></li><li><p style=\"min-height:1.5em\">work hard and can both build <em>and</em> ship fast</p></li><li><p style=\"min-height:1.5em\">can clearly explain complex technical concepts to others</p></li><li><p style=\"min-height:1.5em\">are a fast learner, frequently picking up new languages and tools</p></li></ul><h2></h2><p style=\"min-height:1.5em\">The Head of Sales will play a critical role in leading and scaling the sales department. You will be responsible for building, managing and growing a comprehensive sales strategy, a high-performing sales team, and robust sales processes and systems. LiveKit has a unique opportunity and we are looking for a builder to join a sales organization and build from the ground up, with the support and resources of a fast-growing company.</p><p style=\"min-height:1.5em\">You will report directly to [CEO] and work closely with other departments, including Marketing, Engineering, and People, to ensure alignment and maximize revenue opportunities.</p><h3></h3><h3><strong>Sales Strategy &amp; Leadership</strong></h3><ul style=\"min-height:1.5em\"><li><p style=\"min-height:1.5em\">Develop and execute a comprehensive sales strategy that aligns with company goals, market opportunities, and customer needs.</p></li><li><p style=\"min-height:1.5em\">Lead the growth and performance of the sales team by setting clear targets, KPIs, and benchmarks for success.</p></li><li><p style=\"min-height:1.5em\">Establish the vision, culture, and best practices for the sales organization, ensuring a high-performing and motivated team.</p></li><li><p style=\"min-height:1.5em\">Manage and mentor the current team, ensuring their success while building a cohesive sales team.</p></li><li><p style=\"min-height:1.5em\">Oversee the CRM and sales tools to ensure proper use and data integrity, working with other departments to improve automation and reporting.</p></li></ul><h3><strong>Team Building &amp; Development</strong></h3><ul style=\"min-height:1.5em\"><li><p style=\"min-height:1.5em\">Hire, train, and onboard new sales team members, expanding the team as the company scales.</p></li><li><p style=\"min-height:1.5em\">Foster a high-performance sales culture focused on accountability, continuous learning, and achievement of revenue goals.</p></li><li><p style=\"min-height:1.5em\">Develop and implement a sales training program to ensure team members are well-equipped to sell effectively and meet targets.</p></li></ul><h3><strong>Revenue Generation &amp; Management</strong></h3><ul style=\"min-height:1.5em\"><li><p style=\"min-height:1.5em\">Oversee the entire sales cycle, from lead generation to deal closure, ensuring strong pipeline management and consistent revenue growth.</p></li><li><p style=\"min-height:1.5em\">Build and maintain a strong, predictable sales pipeline and develop processes for effective pipeline forecasting.</p></li><li><p style=\"min-height:1.5em\">Collaborate with marketing to optimize lead generation strategies and work with the product team to ensure alignment on go-to-market strategy.</p></li></ul><h3><strong>Performance Monitoring &amp; Reporting</strong></h3><ul style=\"min-height:1.5em\"><li><p style=\"min-height:1.5em\">Regularly analyze sales metrics to identify trends, opportunities, and areas for improvement.</p></li><li><p style=\"min-height:1.5em\">Create and present detailed sales reports to the executive team, highlighting performance, forecasts, and strategic insights.</p></li><li><p style=\"min-height:1.5em\">Ensure the sales team is consistently meeting or exceeding revenue targets, driving continuous improvements.</p></li></ul><h3><strong>Qualifications:</strong></h3><ul style=\"min-height:1.5em\"><li><p style=\"min-height:1.5em\">Proven experience as a senior sales leader, with a track record of scaling sales teams and driving significant revenue growth in a high-growth environment.</p></li><li><p style=\"min-height:1.5em\">Previous experience in building sales teams and processes from the ground up is strongly preferred.</p></li><li><p style=\"min-height:1.5em\">Strong knowledge of CRM systems (e.g., Salesforce, HubSpot) and sales performance metrics.</p></li><li><p style=\"min-height:1.5em\">Excellent leadership skills, with the ability to inspire, mentor, and motivate a diverse team of sales professionals.</p></li><li><p style=\"min-height:1.5em\">Experience working closely with marketing and engineering teams to align sales strategy with broader business objectives.</p></li><li><p style=\"min-height:1.5em\">Exceptional communication, negotiation, and relationship-building skills, with the ability to effectively engage with both internal and external stakeholders.</p></li><li><p style=\"min-height:1.5em\">Data-driven approach to decision-making with a focus on measurable results and process optimization.</p></li><li><p style=\"min-height:1.5em\">Preferred Bachelors degree in STEM.</p></li></ul><p style=\"min-height:1.5em\"></p><h2>We offer</h2><ul style=\"min-height:1.5em\"><li><p style=\"min-height:1.5em\">An opportunity to build something truly impactful to the world</p></li><li><p style=\"min-height:1.5em\">Contribute to open source alongside world-class engineers</p></li><li><p style=\"min-height:1.5em\">Competitive salary and equity package</p></li><li><p style=\"min-height:1.5em\">Work anywhere in the world</p></li><li><p style=\"min-height:1.5em\">Health, dental, and vision benefits</p></li><li><p style=\"min-height:1.5em\">Flexible vacation policy</p></li></ul>","tags":"[\"management\",\"engineering\"]","pubDate":"2025-03-05T16:13:43.111Z","link":"https://jobs.ashbyhq.com/livekit/73842762-0d1e-461a-b971-8e90f1eba6c1","slug":"head-of-sales-livekit-498"},{"id":5590909385,"title":"Senior Full-Stack Software Engineer","company":"Synthflow","image":"https://pbs.twimg.com/profile_images/1879924055165272064/o-V7OZKb_400x400.jpg","description":"<p style=\"min-height:1.5em\">This is a fully remote role, allowing you to work from anywhere in the world.</p><p style=\"min-height:1.5em\"></p><h1><strong>About Synthflow</strong></h1><p style=\"min-height:1.5em\">At <a target=\"_blank\" rel=\"noopener noreferrer nofollow\" href=\"http://synthflow.ai/\">Synthflow</a> we’re building the easiest way for businesses to create AI-powered phone agents. No coding, no fuss—just smarter automation. We’re passionate about delivering the future of voice technology with lightning-fast, scalable solutions. It’s an exciting time at Synthflow: we’re early, fast-growing, and laser-focused on impact. Join us to do the best work of your career while helping businesses thrive.</p><p style=\"min-height:1.5em\"></p><h1><strong>About the role</strong></h1><p style=\"min-height:1.5em\">We’re looking for a Senior Full-Stack Engineer to build and scale Synthflow’s core platform.</p><p style=\"min-height:1.5em\"></p><h2><strong>Your responsibilities will include:</strong></h2><ul style=\"min-height:1.5em\"><li><p style=\"min-height:1.5em\"><strong>Build and maintain our full-stack architecture</strong> using React/Next.js, Node.js, and to deliver a robust, scalable, and high-performance platform.</p></li><li><p style=\"min-height:1.5em\"><strong>Implement user-facing features and backend services</strong> that support our evolving product.</p></li><li><p style=\"min-height:1.5em\"><strong>Collaborate closely</strong> with designers, product managers, and other engineers to deliver high-quality, user-friendly solutions.</p></li><li><p style=\"min-height:1.5em\"><strong>Optimize SQL queries and database interactions</strong> to ensure efficiency across our application stack.</p></li><li><p style=\"min-height:1.5em\"><strong>Leverage your experience in automated testing and CI/CD pipelines</strong> to drive quality and streamline deployment.</p></li><li><p style=\"min-height:1.5em\"><strong>Work in a fast-paced, startup environment</strong> where innovation, speed, and scalability are key.</p></li></ul><p style=\"min-height:1.5em\"></p><h1><strong>You Have:</strong></h1><ul style=\"min-height:1.5em\"><li><p style=\"min-height:1.5em\">A <strong>minimum of 4 years of professional experience</strong> as a Full-Stack Engineer with a strong focus on JavaScript/TypeScript</p></li><li><p style=\"min-height:1.5em\">Extensive experience with <strong>React, Node.js, TypeScript, CSS, and Next.js</strong>.</p></li><li><p style=\"min-height:1.5em\">Strong proficiency in <strong>SQL</strong> and optimizing complex queries.</p></li><li><p style=\"min-height:1.5em\"><strong>Experience with cloud platforms</strong> such as GCP or AWS.</p></li><li><p style=\"min-height:1.5em\">Familiarity with <strong>DevOps and containerization</strong> tools like Docker.</p></li><li><p style=\"min-height:1.5em\">Strong verbal and written communication skills, with a track record of effective collaboration in cross-functional teams.</p></li><li><p style=\"min-height:1.5em\"><strong>Contribute to a culture of learning and knowledge-sharing,</strong> participating in code reviews and pair programming.</p></li></ul><h3></h3><h1>Beyond the basics:</h1><ul style=\"min-height:1.5em\"><li><p style=\"min-height:1.5em\">Experience with <strong>Redis</strong> and relational databases for caching and data handling.</p></li><li><p style=\"min-height:1.5em\">Experience with AI Tooling and Framework like Langchain or OpenAI SDK</p></li><li><p style=\"min-height:1.5em\"><strong>Early-stage startup experience</strong> is a big plus, as we value adaptability and innovative problem-solving.</p><p style=\"min-height:1.5em\"></p></li></ul><h1><strong>What We Offer:</strong></h1><ul style=\"min-height:1.5em\"><li><p style=\"min-height:1.5em\"><strong>Autonomy at speed: </strong>High-ownership roles in a fast-moving startup.</p></li><li><p style=\"min-height:1.5em\"><strong>Remote-first flexibility: </strong>Contribute from anywhere, on your schedule.</p></li><li><p style=\"min-height:1.5em\"><strong>Cutting-edge technology:</strong> Work on what interests you most.</p></li><li><p style=\"min-height:1.5em\"><strong>Career growth: </strong>Scale your impact as the company grows.</p></li><li><p style=\"min-height:1.5em\"><strong>Rewarding package: </strong>Competitive pay, equity options, and comprehensive benefits that reflect your skills and experience. </p></li></ul>","tags":"[\"javascript\",\"typescript\",\"database\",\"aws\"]","pubDate":"2025-03-05T15:33:00.769Z","link":"https://jobs.ashbyhq.com/synthflow/011b1ed3-f877-4327-89c7-15160f497fac","slug":"senior-full-stack-software-engineer-synthflow-6633"},{"id":8109111084,"title":"Senior Content Marketing Manager (CCaaS)","company":"Synthflow","image":"https://pbs.twimg.com/profile_images/1879924055165272064/o-V7OZKb_400x400.jpg","description":"<p style=\"min-height:1.5em\">At Synthflow, we’re building the easiest way for businesses to create AI-powered phone agents. We’re looking for a <strong>Senior Content Marketing Manager (CCaaSS)</strong> to own and execute our content strategy, creating high-impact materials that engage enterprise customers, support sales, and strengthen our brand. This is an exciting opportunity to shape how we communicate with the market while working closely with cross-functional teams.</p><p style=\"min-height:1.5em\"></p><p style=\"min-height:1.5em\"><strong>What You’ll Do</strong></p><ul style=\"min-height:1.5em\"><li><p style=\"min-height:1.5em\"><strong>Lead Thought Leadership &amp; Enterprise Content</strong></p><ul style=\"min-height:1.5em\"><li><p style=\"min-height:1.5em\">Write and develop <strong>white papers, case studies, and research-backed reports</strong> to position Synthflow as an industry leader.</p></li><li><p style=\"min-height:1.5em\">Craft compelling content that supports enterprise sales, including <strong>sales collateral, one-pagers, and pitch decks</strong>.</p></li></ul></li><li><p style=\"min-height:1.5em\"><strong>Own LinkedIn Content &amp; Executive Positioning</strong></p><ul style=\"min-height:1.5em\"><li><p style=\"min-height:1.5em\">Manage content creation for our LinkedIn company page, ensuring consistent, engaging, and thought-provoking posts.</p></li><li><p style=\"min-height:1.5em\">Collaborate with leadership to craft personal LinkedIn content that establishes our executives as key voices in the AI industry.</p></li></ul></li><li><p style=\"min-height:1.5em\"><strong>Support Sales &amp; Demand Generation</strong></p><ul style=\"min-height:1.5em\"><li><p style=\"min-height:1.5em\">Work closely with sales and marketing teams to develop <strong>high-value content</strong> that nurtures leads and accelerates the enterprise sales cycle.</p></li><li><p style=\"min-height:1.5em\">Create compelling <strong>customer case studies</strong> that highlight success stories and business impact.</p></li></ul></li><li><p style=\"min-height:1.5em\"><strong>Work Closely with Design</strong></p><ul style=\"min-height:1.5em\"><li><p style=\"min-height:1.5em\">Collaborate with designers to develop visually engaging content, including infographics, eBooks, and multimedia assets.</p></li><li><p style=\"min-height:1.5em\">Ensure brand consistency across all marketing materials.</p></li></ul></li></ul><p style=\"min-height:1.5em\"></p><p style=\"min-height:1.5em\"><strong>What We’re Looking For</strong></p><ul style=\"min-height:1.5em\"><li><p style=\"min-height:1.5em\"><strong>5+ years of experience in content marketing, B2B marketing, or enterprise sales enablement.</strong></p></li><li><p style=\"min-height:1.5em\">CCaaS / Call Center/ Voice AI experience</p></li><li><p style=\"min-height:1.5em\">Proven ability to create high-quality <strong>white papers, case studies, and long-form content.</strong></p></li><li><p style=\"min-height:1.5em\">Experience writing for LinkedIn and optimizing content for engagement.</p></li><li><p style=\"min-height:1.5em\">Strong storytelling skills with the ability to simplify complex topics.</p></li><li><p style=\"min-height:1.5em\">Excellent collaboration skills and experience working cross-functionally with sales, design, and product teams.</p></li><li><p style=\"min-height:1.5em\">Experience in AI, SaaS, or B2B technology industries.</p></li></ul>","tags":"[\"b2b\"]","pubDate":"2025-03-05T13:19:49.002Z","link":"https://jobs.ashbyhq.com/synthflow/2f2d9a19-86a8-4d8b-8a43-f29d7950c10b","slug":"senior-content-marketing-manager-ccaas-synthflow-9723"},{"id":4110291397,"title":"Operations Virtual Assistant","company":"Winona","image":"https://yt3.googleusercontent.com/k45HnnNMWgPv-xF3D-u2ThxmesDOeU0p02rNJpbRWLes2Z18WpkLgXEE7XuBLkkzN_38AFnp3A=s160-c-k-c0x00ffffff-no-rj","description":"<p style=\"min-height:1.5em\"><strong>About Winona:</strong></p><p style=\"min-height:1.5em\"><a target=\"_blank\" rel=\"noopener noreferrer nofollow\" href=\"https://bywinona.com\">Winona</a> is one of the leading telemedicine companies providing HRT for women in menopause. We’ve built all of our technology in house including an EHR, patient care admin system, patient portal, website, marketing technology etc. Winona has two compounding pharmacies and a team of in house physicians providing world-class care via a fully vertically integrated business model.</p><p style=\"min-height:1.5em\"></p><p style=\"min-height:1.5em\"><strong>About the role:</strong></p><p style=\"min-height:1.5em\">We are seeking a detail-oriented and proactive <strong>Virtual Assistant</strong> to support our <strong>Operations team.</strong> The VA will play a critical role in maintaining organization, streamlining processes, and ensuring smooth operations. This position requires excellent organizational skills, a tech-savvy mindset, and the ability to multitask effectively. The ideal candidate will be a self-starter, capable of working independently, and possess a strong understanding of digital tools and platforms.</p><p style=\"min-height:1.5em\"></p><p style=\"min-height:1.5em\"><strong>Seniority Level:</strong> Junior-Mid level</p><p style=\"min-height:1.5em\"></p><p style=\"min-height:1.5em\"><strong>Responsibilities:</strong></p><p style=\"min-height:1.5em\">Google Business Account Management:</p><ul style=\"min-height:1.5em\"><li><p style=\"min-height:1.5em\">Oversee and manage Google business accounts, ensuring all activities are up-to-date and compliant with Google's policies.</p></li><li><p style=\"min-height:1.5em\">Respond to inquiries and resolve issues related to Google business accounts.</p></li></ul><p style=\"min-height:1.5em\">Email Management:</p><ul style=\"min-height:1.5em\"><li><p style=\"min-height:1.5em\">Maintain and organize the shared mailbox for efficient mail management.</p></li><li><p style=\"min-height:1.5em\">Prioritize, categorize, and respond to emails promptly and professionally.</p></li><li><p style=\"min-height:1.5em\">Filter spam and manage email folders to ensure a clean and organized inbox.</p></li></ul><p style=\"min-height:1.5em\">Document Management &amp; Execution:</p><ul style=\"min-height:1.5em\"><li><p style=\"min-height:1.5em\">Prepare and manage documents using PandaDoc, ensuring timely execution and accurate completion.</p></li><li><p style=\"min-height:1.5em\">Customize templates to meet specific business needs.</p></li><li><p style=\"min-height:1.5em\">Track and follow up on document statuses to ensure all required signatures and approvals are obtained.</p></li></ul><p style=\"min-height:1.5em\">Data Center Management:</p><ul style=\"min-height:1.5em\"><li><p style=\"min-height:1.5em\">Maintain and organize the data center (digital files and information), ensuring information is accurate, secure, and easily accessible.</p></li><li><p style=\"min-height:1.5em\">Implement and maintain a consistent filing system.</p></li><li><p style=\"min-height:1.5em\">Conduct regular audits to ensure data integrity.</p></li></ul><p style=\"min-height:1.5em\">Project &amp; Task Management:</p><ul style=\"min-height:1.5em\"><li><p style=\"min-height:1.5em\">Manage ClickUp tasks to ensure the proper flow of information and efficient task completion.</p></li><li><p style=\"min-height:1.5em\">Create, assign, and track tasks, ensuring deadlines are met.</p></li><li><p style=\"min-height:1.5em\">Update task statuses and provide regular progress reports.</p></li></ul><p style=\"min-height:1.5em\">Database Management:</p><ul style=\"min-height:1.5em\"><li><p style=\"min-height:1.5em\">Create, manage, and update Airtable databases to track and report key data.</p></li><li><p style=\"min-height:1.5em\">Develop and implement database structures to optimize data organization and retrieval.</p></li><li><p style=\"min-height:1.5em\">Generate reports and visualizations from Airtable data.</p></li></ul><p style=\"min-height:1.5em\">Mailing Coordination:</p><ul style=\"min-height:1.5em\"><li><p style=\"min-height:1.5em\">Coordinate and manage mailing tasks, including preparing and shipping items.</p></li></ul><p style=\"min-height:1.5em\">General Administrative Support:</p><ul style=\"min-height:1.5em\"><li><p style=\"min-height:1.5em\">Provide general administrative support to the Operations team as needed.</p></li></ul><p style=\"min-height:1.5em\"></p><p style=\"min-height:1.5em\"><strong>Requirements</strong>:</p><ul style=\"min-height:1.5em\"><li><p style=\"min-height:1.5em\">Proven experience as a Virtual Assistant or in a similar administrative role.</p></li><li><p style=\"min-height:1.5em\">Proficiency in tools such as ClickUp, AirTable, and PandaDoc.</p></li><li><p style=\"min-height:1.5em\">Strong organizational and time management skills.</p></li><li><p style=\"min-height:1.5em\">Excellent written and verbal communication skills.</p></li><li><p style=\"min-height:1.5em\">High level of attention to detail and accuracy.</p></li><li><p style=\"min-height:1.5em\">Ability to work independently and handle multiple tasks simultaneously.</p></li><li><p style=\"min-height:1.5em\">Reliable internet connection and access to a suitable workspace.</p></li></ul><p style=\"min-height:1.5em\"></p><p style=\"min-height:1.5em\"><strong>What’s in it for you?</strong></p><p style=\"min-height:1.5em\">As a full-time member of our team, you’ll enjoy:</p><ul style=\"min-height:1.5em\"><li><p style=\"min-height:1.5em\">Flexible hours, work wherever you choose</p></li><li><p style=\"min-height:1.5em\">Unlimited PTO</p></li><li><p style=\"min-height:1.5em\">Non-working holidays per country of residence</p></li><li><p style=\"min-height:1.5em\">Pro-rated 13th-month bonus in select regions</p></li><li><p style=\"min-height:1.5em\">Referral bonuses</p></li><li><p style=\"min-height:1.5em\">Financial support for online courses</p></li><li><p style=\"min-height:1.5em\">Fun and casual work environment</p></li><li><p style=\"min-height:1.5em\">Employee engagement activities and virtual gatherings</p></li><li><p style=\"min-height:1.5em\">We are a diverse, global team! 🌍</p></li></ul>","tags":"[\"management\",\"database\"]","pubDate":"2025-03-05T12:38:33.704Z","link":"https://jobs.ashbyhq.com/winona/c457e88c-b1bd-4dcc-94ad-8eb44815f1fa","slug":"operations-virtual-assistant-winona-9946"},{"id":1802558031,"title":"People Manager Intern (remote opportunity, location - Europe&CIS)","company":"CloudLinux","image":"https://avatars.githubusercontent.com/u/16290369?s=200&v=4","description":"<p>Are you passionate about HR and eager to gain hands-on experience in a dynamic and fast-paced environment? We are looking for a proactive and detail-oriented People Manager Intern to join our team. This is a great opportunity for someone who wants to develop their HR expertise, work on impactful projects, and take ownership of key people processes.</p><p><strong>What you will do:</strong></p><ul> <li>Organize and support the grade review process, ensuring smooth execution and proper documentation.</li> <li>Collect, structure, and document HR-related information, making processes more transparent and accessible.</li> <li>Coordinate feedback collection and track key touchpoints during the onboarding process for our Internship Programme.</li> <li>Assist in other HR projects, contributing to improvements in people processes and engagement initiatives.</li> </ul><p><strong>Requirements</strong></p><p><strong>What we expect from you:</strong></p><ul> <li>English proficiency (B2 or higher) – clear communication is essential.</li> <li>Fluent Russian – ability to communicate effectively in a bilingual environment.</li> <li>Strong Google Workspace skills, especially Google Sheets, to manage and analyze data effectively.</li> <li>Attention to detail and a structured approach to organizing information.</li> <li>Excellent interpersonal skills, making it easy to connect with colleagues across teams.</li> <li>A genuine interest in HR and a desire to grow in this field.</li> <li>A proactive mindset and a sense of ownership – we value individuals who take initiative and drive improvements rather than just execute tasks.</li> </ul><p><strong>Benefits</strong></p><p><strong>What's in it for you?</strong></p><ul> <li>A strong focus on professional development with opportunities for learning and growth:</li> <ul> <li>Interesting and challenging projects,</li> <li>Mentor and other knowledge-exchange programs.</li> </ul> <li>Fully remote work with flexible working hours, that allows you to schedule your day and work from any location worldwide.</li> <li>Paid 24 days of vacation per year, 10 days of national holidays, and unlimited sick leaves to ensure you maintain a healthy work-life balance.</li> <li>Compensation for private medical insurance.</li> <li>Co-working and gym/sports reimbursement.</li> <li>The opportunity to receive a reward for the most innovative idea that the company can patent, fostering a culture of creativity and innovation.</li> </ul><p></p><p><em>By applying for this position, you consent to the processing of your personal data as described in our Privacy Policy (</em><a href=\"https://cloudlinux.com/candidate-privacy-notice\" target=\"_blank\" rel=\"nofollow noreferrer noopener\" class=\"external\"><em>https://cloudlinux.com/candidate-privacy-notice</em></a><em>), which provides detailed information on how we maintain and handle your data.</em></p>","tags":"[]","pubDate":"2025-03-05T00:00:00.000Z","link":"https://apply.workable.com/j/0AEE1483C8","slug":"people-manager-intern-remote-opportunity-location-europe-cis-cloudlinux-6"},{"id":5773107422,"title":"SDET / QA Automation Engineer for ELS (remote-only)","company":"CloudLinux","image":"https://avatars.githubusercontent.com/u/16290369?s=200&v=4","description":"<p>We are looking for a<strong> SDET / QA Automation Engineer </strong>to join our Extended Lifecycle Support team. The ideal candidate should possess more than just technical expertise; they should have an unwavering commitment to quality and a deep passion for Python. We're looking for someone who not only writes Python code but also lives and breathes it. This candidate should think in Python, excel in Python, and communicate in Python. If you are excited about pushing the boundaries of QA engineering with your Python prowess, we encourage you to apply.</p><p>ELS (Extended Lifecycle Support) is a division of TuxCare, specializing in managing end-of-life Linux distributions. ELS offers services that automate and simplify Linux operations, reducing management tasks and patch delay risks through live patching. This approach ensures security and stability without the need for complex service migrations, even in high-availability environments.&nbsp;</p><p>Work is fully remote, with flexible hours, where you can plan your day and work from anywhere in the world.</p><p>More details about the project can be found on the product website TuxCare.com - <a href=\"https://docs.tuxcare.com/\" target=\"_blank\" rel=\"nofollow noreferrer noopener\" class=\"external\">https://docs.tuxcare.com/</a>, about the company - on Cloudlinux.com - <a href=\"https://cloudlinux.com/\" target=\"_blank\" rel=\"nofollow noreferrer noopener\" class=\"external\">https://cloudlinux.com/</a>.</p><p></p><p><strong>As our SDET / QA Automation Engineer you will:</strong></p><ul><ul> <li>Diagnose, isolate, and implement remedies for package failures caused by errors in our updates.</li> <li>Prepare all needed documentation sets clarifying all the aspects of the product’s environment.</li> <li>Add new automated test scenarios (Python), maintain continuous test execution (Jenkins), track test cycle execution results, recommend corrective actions, and work with the development engineers on the resolution of problems.</li> <li>Maintain and modify test environment and configuration as needed, create new test environments and configurations to meet customer-based configuration or problem reproducing requirements.</li> <li>Continue to expand test automation within ELS continuous integration (CI) and continuous deployment (CD) environments.</li> <li>Collaborate with C and Python Engineers.</li> </ul></ul><p><strong>Requirements</strong></p><p><strong>To be successful you should:</strong></p><ul><ul> <li>Speak Python, breathe Python, and think Python.</li> <li>Have a Bachelor’s degree in Computer Science, Software Engineering, or a similar field.</li> <li>Have 2+ years of experience in QA Automation with Python (experience only in UI and/or API automation isn’t relevant for us).</li> <li>Have 4+ years in QA.</li> <li>Have experience and a passion for Linux. Fluent in Linux CLI is a must!</li> <li>Have strong shell scripting knowledge.</li> <li>Have in-depth knowledge of Python (we use 2.7 mostly) programming language (is a must)!</li> <li>Have proficiency in object-oriented programming with Python.</li> <li>Possess knowledge of Ansible and Docker.</li> <li>Have an understanding of CI/CD systems, tools, and approaches.</li> <li>Have experience in the creation of Jenkins scripted/declarative pipelines.</li> <li>Possess a good understanding of DevOps principles and their relation to automation engineering.</li> <li>Have the ability to work well with culturally diverse teams.</li> <li>Have proven ability to communicate well with peers and all levels of management.</li> <li>Have intermediate (and higher) English level.</li> <li>Be a team player, but also able to work independently using your initiative.</li> <li>Be happy in an Agile, fast-paced environment.</li> </ul></ul><p><strong>Benefits</strong></p><p><strong>What's in it for you?</strong></p><ul> <li>A focus on professional development.</li> <li>Interesting and challenging projects.</li> <li>Fully remote work with flexible working hours, that allows you to schedule your day and work from any location worldwide.</li> <li>Paid 24 days of vacation per year, 10 days of national holidays, and unlimited sick leaves.</li> <li>Compensation for private medical insurance.</li> <li>Co-working and gym/sports reimbursement.</li> <li>Budget for education.</li> <li>The opportunity to receive a reward for the most innovative idea that the company can patent.</li> </ul><p><br><em>By applying for this position, you consent to the processing of your personal data as described in our Privacy Policy (</em><a href=\"https://cloudlinux.com/candidate-privacy-notice\" target=\"_blank\" rel=\"nofollow noreferrer noopener\" class=\"external\"><em>https://cloudlinux.com/candidate-privacy-notice</em></a><em>), which provides detailed information on how we maintain and handle your data.</em></p>","tags":"[\"management\",\"engineering\"]","pubDate":"2025-03-05T00:00:00.000Z","link":"https://apply.workable.com/j/5781E9695C","slug":"sdet-qa-automation-engineer-for-els-remote-only-cloudlinux-5289"},{"id":8611438464,"title":"SDET / QA Automation Engineer for ELS (remote-only)","company":"CloudLinux","image":"https://avatars.githubusercontent.com/u/16290369?s=200&v=4","description":"<p>We are looking for a<strong> SDET / QA Automation Engineer </strong>to join our Extended Lifecycle Support team. The ideal candidate should possess more than just technical expertise; they should have an unwavering commitment to quality and a deep passion for Python. We're looking for someone who not only writes Python code but also lives and breathes it. This candidate should think in Python, excel in Python, and communicate in Python. If you are excited about pushing the boundaries of QA engineering with your Python prowess, we encourage you to apply.</p><p>ELS (Extended Lifecycle Support) is a division of TuxCare, specializing in managing end-of-life Linux distributions. ELS offers services that automate and simplify Linux operations, reducing management tasks and patch delay risks through live patching. This approach ensures security and stability without the need for complex service migrations, even in high-availability environments.&nbsp;</p><p>Work is fully remote, with flexible hours, where you can plan your day and work from anywhere in the world.</p><p>More details about the project can be found on the product website TuxCare.com - <a href=\"https://docs.tuxcare.com/\" target=\"_blank\" rel=\"nofollow noreferrer noopener\" class=\"external\">https://docs.tuxcare.com/</a>, about the company - on Cloudlinux.com - <a href=\"https://cloudlinux.com/\" target=\"_blank\" rel=\"nofollow noreferrer noopener\" class=\"external\">https://cloudlinux.com/</a>.</p><p></p><p><strong>As our SDET / QA Automation Engineer you will:</strong></p><ul><ul> <li>Diagnose, isolate, and implement remedies for package failures caused by errors in our updates.</li> <li>Prepare all needed documentation sets clarifying all the aspects of the product’s environment.</li> <li>Add new automated test scenarios (Python), maintain continuous test execution (Jenkins), track test cycle execution results, recommend corrective actions, and work with the development engineers on the resolution of problems.</li> <li>Maintain and modify test environment and configuration as needed, create new test environments and configurations to meet customer-based configuration or problem reproducing requirements.</li> <li>Continue to expand test automation within ELS continuous integration (CI) and continuous deployment (CD) environments.</li> <li>Collaborate with C and Python Engineers.</li> </ul></ul><p><strong>Requirements</strong></p><p><strong>To be successful you should:</strong></p><ul><ul> <li>Speak Python, breathe Python, and think Python.</li> <li>Have a Bachelor’s degree in Computer Science, Software Engineering, or a similar field.</li> <li>Have 2+ years of experience in QA Automation with Python (experience only in UI and/or API automation isn’t relevant for us).</li> <li>Have 4+ years in QA.</li> <li>Have experience and a passion for Linux. Fluent in Linux CLI is a must!</li> <li>Have strong shell scripting knowledge.</li> <li>Have in-depth knowledge of Python (we use 2.7 mostly) programming language (is a must)!</li> <li>Have proficiency in object-oriented programming with Python.</li> <li>Possess knowledge of Ansible and Docker.</li> <li>Have an understanding of CI/CD systems, tools, and approaches.</li> <li>Have experience in the creation of Jenkins scripted/declarative pipelines.</li> <li>Possess a good understanding of DevOps principles and their relation to automation engineering.</li> <li>Have the ability to work well with culturally diverse teams.</li> <li>Have proven ability to communicate well with peers and all levels of management.</li> <li>Have intermediate (and higher) English level.</li> <li>Be a team player, but also able to work independently using your initiative.</li> <li>Be happy in an Agile, fast-paced environment.</li> </ul></ul><p><strong>Benefits</strong></p><p><strong>What's in it for you?</strong></p><ul> <li>A focus on professional development.</li> <li>Interesting and challenging projects.</li> <li>Fully remote work with flexible working hours, that allows you to schedule your day and work from any location worldwide.</li> <li>Paid 24 days of vacation per year, 10 days of national holidays, and unlimited sick leaves.</li> <li>Compensation for private medical insurance.</li> <li>Co-working and gym/sports reimbursement.</li> <li>Budget for education.</li> <li>The opportunity to receive a reward for the most innovative idea that the company can patent.</li> </ul><p><br><em>By applying for this position, you consent to the processing of your personal data as described in our Privacy Policy (</em><a href=\"https://cloudlinux.com/candidate-privacy-notice\" target=\"_blank\" rel=\"nofollow noreferrer noopener\" class=\"external\"><em>https://cloudlinux.com/candidate-privacy-notice</em></a><em>), which provides detailed information on how we maintain and handle your data.</em></p>","tags":"[\"management\",\"engineering\"]","pubDate":"2025-03-05T00:00:00.000Z","link":"https://apply.workable.com/j/5781E9695C","slug":"sdet-qa-automation-engineer-for-els-remote-only-cloudlinux-2833"},{"id":3298832102,"title":"SDET / QA Automation Engineer for ELS (remote-only)","company":"CloudLinux","image":"https://avatars.githubusercontent.com/u/16290369?s=200&v=4","description":"<p>We are looking for a<strong> SDET / QA Automation Engineer </strong>to join our Extended Lifecycle Support team. The ideal candidate should possess more than just technical expertise; they should have an unwavering commitment to quality and a deep passion for Python. We're looking for someone who not only writes Python code but also lives and breathes it. This candidate should think in Python, excel in Python, and communicate in Python. If you are excited about pushing the boundaries of QA engineering with your Python prowess, we encourage you to apply.</p><p>ELS (Extended Lifecycle Support) is a division of TuxCare, specializing in managing end-of-life Linux distributions. ELS offers services that automate and simplify Linux operations, reducing management tasks and patch delay risks through live patching. This approach ensures security and stability without the need for complex service migrations, even in high-availability environments.&nbsp;</p><p>Work is fully remote, with flexible hours, where you can plan your day and work from anywhere in the world.</p><p>More details about the project can be found on the product website TuxCare.com - <a href=\"https://docs.tuxcare.com/\" target=\"_blank\" rel=\"nofollow noreferrer noopener\" class=\"external\">https://docs.tuxcare.com/</a>, about the company - on Cloudlinux.com - <a href=\"https://cloudlinux.com/\" target=\"_blank\" rel=\"nofollow noreferrer noopener\" class=\"external\">https://cloudlinux.com/</a>.</p><p></p><p><strong>As our SDET / QA Automation Engineer you will:</strong></p><ul><ul> <li>Diagnose, isolate, and implement remedies for package failures caused by errors in our updates.</li> <li>Prepare all needed documentation sets clarifying all the aspects of the product’s environment.</li> <li>Add new automated test scenarios (Python), maintain continuous test execution (Jenkins), track test cycle execution results, recommend corrective actions, and work with the development engineers on the resolution of problems.</li> <li>Maintain and modify test environment and configuration as needed, create new test environments and configurations to meet customer-based configuration or problem reproducing requirements.</li> <li>Continue to expand test automation within ELS continuous integration (CI) and continuous deployment (CD) environments.</li> <li>Collaborate with C and Python Engineers.</li> </ul></ul><p><strong>Requirements</strong></p><p><strong>To be successful you should:</strong></p><ul><ul> <li>Speak Python, breathe Python, and think Python.</li> <li>Have a Bachelor’s degree in Computer Science, Software Engineering, or a similar field.</li> <li>Have 2+ years of experience in QA Automation with Python (experience only in UI and/or API automation isn’t relevant for us).</li> <li>Have 4+ years in QA.</li> <li>Have experience and a passion for Linux. Fluent in Linux CLI is a must!</li> <li>Have strong shell scripting knowledge.</li> <li>Have in-depth knowledge of Python (we use 2.7 mostly) programming language (is a must)!</li> <li>Have proficiency in object-oriented programming with Python.</li> <li>Possess knowledge of Ansible and Docker.</li> <li>Have an understanding of CI/CD systems, tools, and approaches.</li> <li>Have experience in the creation of Jenkins scripted/declarative pipelines.</li> <li>Possess a good understanding of DevOps principles and their relation to automation engineering.</li> <li>Have the ability to work well with culturally diverse teams.</li> <li>Have proven ability to communicate well with peers and all levels of management.</li> <li>Have intermediate (and higher) English level.</li> <li>Be a team player, but also able to work independently using your initiative.</li> <li>Be happy in an Agile, fast-paced environment.</li> </ul></ul><p><strong>Benefits</strong></p><p><strong>What's in it for you?</strong></p><ul> <li>A focus on professional development.</li> <li>Interesting and challenging projects.</li> <li>Fully remote work with flexible working hours, that allows you to schedule your day and work from any location worldwide.</li> <li>Paid 24 days of vacation per year, 10 days of national holidays, and unlimited sick leaves.</li> <li>Compensation for private medical insurance.</li> <li>Co-working and gym/sports reimbursement.</li> <li>Budget for education.</li> <li>The opportunity to receive a reward for the most innovative idea that the company can patent.</li> </ul><p><br><em>By applying for this position, you consent to the processing of your personal data as described in our Privacy Policy (</em><a href=\"https://cloudlinux.com/candidate-privacy-notice\" target=\"_blank\" rel=\"nofollow noreferrer noopener\" class=\"external\"><em>https://cloudlinux.com/candidate-privacy-notice</em></a><em>), which provides detailed information on how we maintain and handle your data.</em></p>","tags":"[\"management\",\"engineering\"]","pubDate":"2025-03-05T00:00:00.000Z","link":"https://apply.workable.com/j/5781E9695C","slug":"sdet-qa-automation-engineer-for-els-remote-only-cloudlinux-8453"},{"id":8388484077,"title":"SDET / QA Automation Engineer for ELS (remote-only)","company":"CloudLinux","image":"https://avatars.githubusercontent.com/u/16290369?s=200&v=4","description":"<p>We are looking for a<strong> SDET / QA Automation Engineer </strong>to join our Extended Lifecycle Support team. The ideal candidate should possess more than just technical expertise; they should have an unwavering commitment to quality and a deep passion for Python. We're looking for someone who not only writes Python code but also lives and breathes it. This candidate should think in Python, excel in Python, and communicate in Python. If you are excited about pushing the boundaries of QA engineering with your Python prowess, we encourage you to apply.</p><p>ELS (Extended Lifecycle Support) is a division of TuxCare, specializing in managing end-of-life Linux distributions. ELS offers services that automate and simplify Linux operations, reducing management tasks and patch delay risks through live patching. This approach ensures security and stability without the need for complex service migrations, even in high-availability environments.&nbsp;</p><p>Work is fully remote, with flexible hours, where you can plan your day and work from anywhere in the world.</p><p>More details about the project can be found on the product website TuxCare.com - <a href=\"https://docs.tuxcare.com/\" target=\"_blank\" rel=\"nofollow noreferrer noopener\" class=\"external\">https://docs.tuxcare.com/</a>, about the company - on Cloudlinux.com - <a href=\"https://cloudlinux.com/\" target=\"_blank\" rel=\"nofollow noreferrer noopener\" class=\"external\">https://cloudlinux.com/</a>.</p><p></p><p><strong>As our SDET / QA Automation Engineer you will:</strong></p><ul><ul> <li>Diagnose, isolate, and implement remedies for package failures caused by errors in our updates.</li> <li>Prepare all needed documentation sets clarifying all the aspects of the product’s environment.</li> <li>Add new automated test scenarios (Python), maintain continuous test execution (Jenkins), track test cycle execution results, recommend corrective actions, and work with the development engineers on the resolution of problems.</li> <li>Maintain and modify test environment and configuration as needed, create new test environments and configurations to meet customer-based configuration or problem reproducing requirements.</li> <li>Continue to expand test automation within ELS continuous integration (CI) and continuous deployment (CD) environments.</li> <li>Collaborate with C and Python Engineers.</li> </ul></ul><p><strong>Requirements</strong></p><p><strong>To be successful you should:</strong></p><ul><ul> <li>Speak Python, breathe Python, and think Python.</li> <li>Have a Bachelor’s degree in Computer Science, Software Engineering, or a similar field.</li> <li>Have 2+ years of experience in QA Automation with Python (experience only in UI and/or API automation isn’t relevant for us).</li> <li>Have 4+ years in QA.</li> <li>Have experience and a passion for Linux. Fluent in Linux CLI is a must!</li> <li>Have strong shell scripting knowledge.</li> <li>Have in-depth knowledge of Python (we use 2.7 mostly) programming language (is a must)!</li> <li>Have proficiency in object-oriented programming with Python.</li> <li>Possess knowledge of Ansible and Docker.</li> <li>Have an understanding of CI/CD systems, tools, and approaches.</li> <li>Have experience in the creation of Jenkins scripted/declarative pipelines.</li> <li>Possess a good understanding of DevOps principles and their relation to automation engineering.</li> <li>Have the ability to work well with culturally diverse teams.</li> <li>Have proven ability to communicate well with peers and all levels of management.</li> <li>Have intermediate (and higher) English level.</li> <li>Be a team player, but also able to work independently using your initiative.</li> <li>Be happy in an Agile, fast-paced environment.</li> </ul></ul><p><strong>Benefits</strong></p><p><strong>What's in it for you?</strong></p><ul> <li>A focus on professional development.</li> <li>Interesting and challenging projects.</li> <li>Fully remote work with flexible working hours, that allows you to schedule your day and work from any location worldwide.</li> <li>Paid 24 days of vacation per year, 10 days of national holidays, and unlimited sick leaves.</li> <li>Compensation for private medical insurance.</li> <li>Co-working and gym/sports reimbursement.</li> <li>Budget for education.</li> <li>The opportunity to receive a reward for the most innovative idea that the company can patent.</li> </ul><p><br><em>By applying for this position, you consent to the processing of your personal data as described in our Privacy Policy (</em><a href=\"https://cloudlinux.com/candidate-privacy-notice\" target=\"_blank\" rel=\"nofollow noreferrer noopener\" class=\"external\"><em>https://cloudlinux.com/candidate-privacy-notice</em></a><em>), which provides detailed information on how we maintain and handle your data.</em></p>","tags":"[\"management\",\"engineering\"]","pubDate":"2025-03-05T00:00:00.000Z","link":"https://apply.workable.com/j/5781E9695C","slug":"sdet-qa-automation-engineer-for-els-remote-only-cloudlinux-701"},{"id":8997325392,"title":"SDET / QA Automation Engineer for ELS (remote-only)","company":"CloudLinux","image":"https://avatars.githubusercontent.com/u/16290369?s=200&v=4","description":"<p>We are looking for a<strong> SDET / QA Automation Engineer </strong>to join our Extended Lifecycle Support team. The ideal candidate should possess more than just technical expertise; they should have an unwavering commitment to quality and a deep passion for Python. We're looking for someone who not only writes Python code but also lives and breathes it. This candidate should think in Python, excel in Python, and communicate in Python. If you are excited about pushing the boundaries of QA engineering with your Python prowess, we encourage you to apply.</p><p>ELS (Extended Lifecycle Support) is a division of TuxCare, specializing in managing end-of-life Linux distributions. ELS offers services that automate and simplify Linux operations, reducing management tasks and patch delay risks through live patching. This approach ensures security and stability without the need for complex service migrations, even in high-availability environments.&nbsp;</p><p>Work is fully remote, with flexible hours, where you can plan your day and work from anywhere in the world.</p><p>More details about the project can be found on the product website TuxCare.com - <a href=\"https://docs.tuxcare.com/\" target=\"_blank\" rel=\"nofollow noreferrer noopener\" class=\"external\">https://docs.tuxcare.com/</a>, about the company - on Cloudlinux.com - <a href=\"https://cloudlinux.com/\" target=\"_blank\" rel=\"nofollow noreferrer noopener\" class=\"external\">https://cloudlinux.com/</a>.</p><p></p><p><strong>As our SDET / QA Automation Engineer you will:</strong></p><ul><ul> <li>Diagnose, isolate, and implement remedies for package failures caused by errors in our updates.</li> <li>Prepare all needed documentation sets clarifying all the aspects of the product’s environment.</li> <li>Add new automated test scenarios (Python), maintain continuous test execution (Jenkins), track test cycle execution results, recommend corrective actions, and work with the development engineers on the resolution of problems.</li> <li>Maintain and modify test environment and configuration as needed, create new test environments and configurations to meet customer-based configuration or problem reproducing requirements.</li> <li>Continue to expand test automation within ELS continuous integration (CI) and continuous deployment (CD) environments.</li> <li>Collaborate with C and Python Engineers.</li> </ul></ul><p><strong>Requirements</strong></p><p><strong>To be successful you should:</strong></p><ul><ul> <li>Speak Python, breathe Python, and think Python.</li> <li>Have a Bachelor’s degree in Computer Science, Software Engineering, or a similar field.</li> <li>Have 2+ years of experience in QA Automation with Python (experience only in UI and/or API automation isn’t relevant for us).</li> <li>Have 4+ years in QA.</li> <li>Have experience and a passion for Linux. Fluent in Linux CLI is a must!</li> <li>Have strong shell scripting knowledge.</li> <li>Have in-depth knowledge of Python (we use 2.7 mostly) programming language (is a must)!</li> <li>Have proficiency in object-oriented programming with Python.</li> <li>Possess knowledge of Ansible and Docker.</li> <li>Have an understanding of CI/CD systems, tools, and approaches.</li> <li>Have experience in the creation of Jenkins scripted/declarative pipelines.</li> <li>Possess a good understanding of DevOps principles and their relation to automation engineering.</li> <li>Have the ability to work well with culturally diverse teams.</li> <li>Have proven ability to communicate well with peers and all levels of management.</li> <li>Have intermediate (and higher) English level.</li> <li>Be a team player, but also able to work independently using your initiative.</li> <li>Be happy in an Agile, fast-paced environment.</li> </ul></ul><p><strong>Benefits</strong></p><p><strong>What's in it for you?</strong></p><ul> <li>A focus on professional development.</li> <li>Interesting and challenging projects.</li> <li>Fully remote work with flexible working hours, that allows you to schedule your day and work from any location worldwide.</li> <li>Paid 24 days of vacation per year, 10 days of national holidays, and unlimited sick leaves.</li> <li>Compensation for private medical insurance.</li> <li>Co-working and gym/sports reimbursement.</li> <li>Budget for education.</li> <li>The opportunity to receive a reward for the most innovative idea that the company can patent.</li> </ul><p><br><em>By applying for this position, you consent to the processing of your personal data as described in our Privacy Policy (</em><a href=\"https://cloudlinux.com/candidate-privacy-notice\" target=\"_blank\" rel=\"nofollow noreferrer noopener\" class=\"external\"><em>https://cloudlinux.com/candidate-privacy-notice</em></a><em>), which provides detailed information on how we maintain and handle your data.</em></p>","tags":"[\"management\",\"engineering\"]","pubDate":"2025-03-05T00:00:00.000Z","link":"https://apply.workable.com/j/5781E9695C","slug":"sdet-qa-automation-engineer-for-els-remote-only-cloudlinux-3123"},{"id":4184939309,"title":"Cybersecurity Risk Management Writer","company":"omniscient","image":"https://remotive.com/job/1979697/logo","description":"<div class=\"h2\">About Omniscient Digital</div><p style=\"min-height:1.5em\">Omniscient Digital is an organic growth agency helping B2B software companies turn content and SEO into growth channels. We’ve helped build content and SEO programs for companies like Jasper, Adobe, Loom, <a href=\"http://Order.co\" rel=\"nofollow\" target=\"_blank\">Order.co</a>, Vendr, Hotjar, and more.</p><p style=\"min-height:1.5em\">Our work has been featured on websites like HubSpot, Shopify, Intercom, and CXL, and our strategies are used by many of the top content marketing teams around the world.</p><p style=\"min-height:1.5em\">Our team is 100% remote. Learn about the <a href=\"https://beomniscient.com/principles/\" rel=\"nofollow\" target=\"_blank\"><u>core values</u></a> that drive how we work and build a company.</p><p style=\"min-height:1.5em\"></p><div class=\"h2\">About this role</div><p style=\"min-height:1.5em\">Omniscient Digital is growing quickly, and we deeply believe in our commitment to never compromise content quality. It’s what differentiates us from other agencies. Writing great content requires great writers. </p><p style=\"min-height:1.5em\">We’re taking on an increasing number of technical clients and are seeking a stellar writer with expertise in <strong>cybersecurity, third-party risk management, and attack surface management &amp; threat intelligence. </strong></p><p style=\"min-height:1.5em\"><em>*Please note that we don’t work with writers who subcontract their work.</em></p><p style=\"min-height:1.5em\"></p><div class=\"h2\">Responsibilities:</div><ul style=\"\"><li style=\"\"><p style=\"min-height:1.5em\"><strong>Create blog content (and potentially other types of marketing content) that appeals to:</strong> </p><ul style=\"\"><li style=\"\"><p style=\"min-height:1.5em\"><strong>Information Security and Risk Leaders</strong> by providing actionable insights on attack surface management, security compliance, and risk frameworks.</p></li><li style=\"\"><p style=\"min-height:1.5em\"><strong>CISOs, CIOs, and security executives,</strong> focusing on third-party risk management, vendor security assessments, and regulatory changes.</p></li><li style=\"\"><p style=\"min-height:1.5em\"><strong>Cybersecurity Analysts &amp; Third-Party Risk Management (TPRM) Analysts</strong>, providing practical insights on risk assessment methodologies, vendor security evaluations, threat intelligence, and attack surface reduction strategies.</p></li></ul></li><li style=\"\"><p style=\"min-height:1.5em\">Translate complex cybersecurity and risk management concepts (e.g., <strong>NIST frameworks, SOC 2 compliance, attack surface reduction</strong>) into <strong>engaging, accessible content</strong>.</p></li><li style=\"\"><p style=\"min-height:1.5em\">Stay up-to-date with emerging trends, including <strong>evolving cybersecurity threats, major data breaches, and regulatory updates</strong>, to ensure content reflects the latest industry developments.</p></li><li style=\"\"><p style=\"min-height:1.5em\">Use <strong>company brand voice and messaging</strong> for written pieces to reinforce company culture.</p></li><li style=\"\"><p style=\"min-height:1.5em\">QA content for <strong>factual accuracy, readability, and compliance with editorial guidelines</strong>.</p></li><li style=\"\"><p style=\"min-height:1.5em\">Interview <strong>subject matter experts (SMEs) in cybersecurity, compliance, and risk management</strong> to enrich content with expert insights.</p></li><li style=\"\"><p style=\"min-height:1.5em\">Ensure projects are <strong>completed on time and meet quality standards</strong>.</p></li><li style=\"\"><p style=\"min-height:1.5em\">Suggest <strong>optimizations and content strategies</strong> based on <strong>industry trends and audience engagement</strong>.</p></li><li style=\"\"><p style=\"min-height:1.5em\">Manage <strong>complex information and multiple projects</strong> within content specifications and budget restrictions.</p></li></ul><p style=\"min-height:1.5em\"></p><div class=\"h2\">Job Qualifications and Technical Skill Sets:</div><ul style=\"\"><li style=\"\"><p style=\"min-height:1.5em\"><strong>2+ years of experience writing about cybersecurity, risk management, and compliance topics. </strong>You understand concepts like attack surface management, data privacy, third-party risk, and DevSecOps.</p></li><li style=\"\"><p style=\"min-height:1.5em\"><strong>Strong knowledge of data breaches, privacy regulations, and compliance frameworks. </strong>This includes SOC 2, ISO 27001, NIST, GDPR, CCPA.</p></li><li style=\"\"><p style=\"min-height:1.5em\"><strong>Ability to break down complex cybersecurity topics</strong> (e.g., IAM, vulnerability management, security automation) into clear, engaging narratives for <strong>director-level security professionals and executives</strong>.</p></li><li style=\"\"><p style=\"min-height:1.5em\"><strong>Experience interviewing subject matter experts. </strong>You’re comfortable conducting SME interviews to add industry opinion and narrative to your content. You know how to draft insightful questions to extract key information and structure compelling narratives around SME responses.</p></li><li style=\"\"><p style=\"min-height:1.5em\"><strong>Time management and organizational skills. </strong>You always meet your deadlines—or communicate in advance when you may need a deadline pushed back.</p></li><li style=\"\"><p style=\"min-height:1.5em\"><strong>A passion for cybersecurity, risk management, and security storytelling. </strong>You stay updated with industry trends and enjoy making complex topics digestible.</p></li><li style=\"\"><p style=\"min-height:1.5em\"><strong>Experience writing for both technical and non-technical audiences. </strong>This includes CISOs, CIOs, Directors of Security &amp; Risk, Cybersecurity Analysts, and TPRM Analysts professionals.</p></li><li style=\"\"><p style=\"min-height:1.5em\"><strong>Excellent written and verbal communication skills, with strong analytical and critical thinking skills. </strong>You turn complex security concepts into compelling narratives. You’re skilled at finding the story within complicated topics and can capture our client’s brand voice in every piece of writing.</p></li><li style=\"\"><p style=\"min-height:1.5em\"><strong>SEO experience. </strong>You’re not new to marketing, and you understand the various considerations that inform a piece of SEO content. You know how to search-optimize your content without sacrificing quality and can balance the needs of both your client and reader.</p></li><li style=\"\"><p style=\"min-height:1.5em\"><strong>Positive attitude. </strong>You’re kind, passionate, curious, and friendly! You’re open to exploring new ideas, stay updated on trending cybersecurity topics, and feel passionately about crafting excellent content. You welcome feedback and love learning how to improve your craft.</p></li><li style=\"\"><p style=\"min-height:1.5em\"><strong>Experience with both print and digital media formats. </strong>You’re also proficient in word processor programs such as Microsoft Word and Google Docs and PDF software such as Adobe Acrobat.</p></li></ul><div class=\"h3\"><strong>Other Preferred Qualifications:</strong></div><ul style=\"\"><li style=\"\"><p style=\"min-height:1.5em\"><strong>Hands-on experience </strong>with cybersecurity, risk management, or compliance.</p></li><li style=\"\"><p style=\"min-height:1.5em\"><strong>Understanding </strong>of security tools and attack surface management platforms, such as Bitsight, SecurityScorecard, and Black Kite. </p></li><li style=\"\"><p style=\"min-height:1.5em\"><strong>Experience </strong>with competitive research and cybersecurity industry trend analysis.</p></li><li style=\"\"><p style=\"min-height:1.5em\"><strong>Familiarity</strong> with third-party risk assessment processes and vendor security frameworks.</p></li></ul><p style=\"min-height:1.5em\"></p><div class=\"h2\">Portfolio</div><p style=\"min-height:1.5em\">A <strong>recent portfolio</strong> with <strong>cybersecurity writing experience</strong> is a must. Please submit <strong>3-5 sample articles</strong> published within the past three years. At least <strong>2 should be related to cybersecurity, risk management, or compliance</strong>. Older samples will be accepted only if accompanied by newer works.</p><p style=\"min-height:1.5em\"></p><div class=\"h2\"></div><div class=\"h2\">Our hiring process</div><p style=\"min-height:1.5em\">We read every application and do our best to get back to each applicant within a few weeks of submission. However, response times may vary depending on the time of year, number of applicants, and other factors. </p><p style=\"min-height:1.5em\"><strong>Note:</strong> We’re urgently hiring for this role. If we’re interested in moving forward with your application, we’ll likely reach out sooner via email. </p><p style=\"min-height:1.5em\"></p><div class=\"h2\">Ready to apply?</div><p style=\"min-height:1.5em\">We’re excited to meet you! 😎</p><p style=\"min-height:1.5em\">If you have any questions during or after the application process, feel free to reach out to our Director of Editorial, Sam Lund (samuel [at] beomniscient [dot] com).</p><p style=\"min-height:1.5em\"><em>Confidence can sometimes hold us back from applying for a job. But there’s no such thing as a \"perfect\" candidate. Omniscient Digital is a place where everyone can grow. So however you identify and whatever background you bring with you, please apply if the idea of this role excites you.</em></p><img src=\"https://remotive.com/job/track/1979697/blank.gif?source=public_api\" alt=\"\"/>","tags":"[\"seo\",\"cybersecurity\",\"risk management\"]","pubDate":"2025-03-04T19:51:57.000Z","link":"https://remotive.com/remote-jobs/writing/cybersecurity-risk-management-writer-1979697","slug":"cybersecurity-risk-management-writer-omniscient-9955"},{"id":1867552017,"title":"Middle Data Analyst","company":"Gr8tech","image":"https://remotive.com/job/1980265/logo","description":"<div class='\"content-intro\"'><p><strong>GR8 Tech is a global product company that provides innovative, scalable platforms and business solutions for the iGaming industry.</strong></p>\n<p>We have а great experience: GR8 Tech platform successfully handles millions of active players and offers best practices to develop and grow in the gambling industry. We are here to provide great gaming tech to satisfy even greater ambition!</p>\n<p>We develop complete tech coverage for gambling businesses worldwide, including iGaming platform solutions, consulting, integration, and long-lasting operation services.</p>\n<p><strong>We are driven by our ambition to make a great product with great people! Together we move the world of iGaming forward — join!</strong></p></div><div class=\"h2\"><strong>About your key responsibilities and impact:</strong></div>\n<ul style=\"\">\n<li style=\"\">Supporting and enhancing existing analytics reports;</li>\n<li style=\"\">Designing and implementing table aggregations for reporting;</li>\n<li style=\"\">Collaborating with Product Managers and Engineers to analyze site functionality;</li>\n<li style=\"\">Communicating analysis and improvement recommendations verbally, in writing, and visually;</li>\n<li style=\"\">Optimizing dashboard upload speeds and performance;</li>\n<li style=\"\">Developing and maintaining visual analytics dashboards;</li>\n<li style=\"\">Developing and optimizing analytics infrastructure;</li>\n<li style=\"\">Reviewing and ensuring the accuracy of analytics code.</li>\n</ul>\n<div class=\"h2\"><strong>Essential professional experience:</strong></div>\n<ul style=\"\">\n<li style=\"\">2+ years of experience working as a data/web analyst;</li>\n<li style=\"\">Intermediate level in Tableau and/or BI (Power BI, Qlik Sense);</li>\n<li style=\"\">2+ years of practical experience with SQL;</li>\n<li style=\"\">Strong knowledge of Excel;</li>\n<li style=\"\">Intermediate knowledge of probability theory and mathematical statistics;</li>\n<li style=\"\">Experience with Python (Pandas, Numpy, SciPy, Matplotlib, Scikit-learn, Statsmodels);</li>\n<li style=\"\">Experience with AWS Glue, Athena, S3;</li>\n<li style=\"\">Experience with GIT will be a plus;</li>\n<li style=\"\">Good written and spoken English (Intermediate +).</li>\n</ul>\n<p> </p><div class='\"content-conclusion\"'><p> </p>\n<div class=\"h2\"><strong>What we offer:</strong></div>\n<p><strong>Benefits Cafeteria:</strong></p>\n<ul style=\"\">\n<li style=\"\">Sports compensation;</li>\n<li style=\"\">Medical coverage;</li>\n<li style=\"\">Psychological support;</li>\n<li style=\"\">Home-office coverage.</li>\n</ul>\n<p><strong>Work-life:</strong></p>\n<ul style=\"\">\n<li style=\"\">Remote work, Coworking compensation;</li>\n<li style=\"\">Childcare budget;</li>\n<li style=\"\">Maternity leave;</li>\n<li style=\"\">Paternity leave;</li>\n<li style=\"\">Additional 2 days for family events.</li>\n</ul>\n<p><strong>Our GR8 Culture:</strong></p>\n<ul style=\"\">\n<li style=\"\">Open feedback and transparent direct communications;</li>\n<li style=\"\">Growth and development: better every day;</li>\n<li style=\"\">High tolerance to experiment and mistakes;</li>\n<li style=\"\">Supportive friendly environment.</li>\n</ul>\n<p> </p>\n<p> </p>\n<p>Data Protection Information regarding the processing of your personal data in connection with the recruitment and selection process can be found in the Candidate Privacy Notice at <a class='\"c-link\"' href=\"%22https://gr8.tech/candidate-privacy-notice/%22\" rel=\"nofollow\" target='\"_blank\"'>https://gr8.tech/candidate-privacy-notice/</a>.</p></div><img src=\"https://remotive.com/job/track/1980265/blank.gif?source=public_api\" alt=\"\"/>","tags":"[\"AWS\",\"excel\",\"python\",\"sql\",\"tableau\"]","pubDate":"2025-03-04T19:51:06.000Z","link":"https://remotive.com/remote-jobs/data/middle-data-analyst-1980265","slug":"middle-data-analyst-gr8tech-2982"},{"id":2722387910,"title":"Freelance Writer","company":"IAPWE","image":"https://remotive.com/job/1185979/logo","description":"<p class=\"p1\" style=\"font-variant-numeric: normal; font-variant-east-asian: normal; font-stretch: normal; line-height: normal; color: #000000;\">Our organization is seeking content writers to create articles and blog posts on a variety of topics.</p>\n<p class=\"p1\" style=\"font-variant-numeric: normal; font-variant-east-asian: normal; font-stretch: normal; line-height: normal; color: #000000;\"> </p>\n<p class=\"p1\" style=\"font-variant-numeric: normal; font-variant-east-asian: normal; font-stretch: normal; line-height: normal; color: #000000;\">The rate of pay is $20 per 100 words (this comes out to approximately $100 per article or $50 per hour).</p>\n<p> </p>\n<p class=\"p1\" style=\"font-variant-numeric: normal; font-variant-east-asian: normal; font-stretch: normal; line-height: normal; color: #000000;\">Some topics you may be asked to write about include the following (you can always turn down a topic if you do not feel comfortable writing about it, however if you have experience or expertise in a specific area, please let us know):</p>\n<p> </p>\n<ul class=\"ul1\" style=\"\">\n<li class=\"li1\" style=\"\">Health &amp; beauty</li>\n<li class=\"li1\" style=\"\">Fitness</li>\n<li class=\"li1\" style=\"\">Home Decor</li>\n<li class=\"li1\" style=\"\">Fashion</li>\n<li class=\"li1\" style=\"\">Sports</li>\n<li class=\"li1\" style=\"\">Do it yourself</li>\n<li class=\"li1\" style=\"\">Finance</li>\n<li class=\"li1\" style=\"\">Legal</li>\n<li class=\"li1\" style=\"\">Medical</li>\n<li class=\"li1\" style=\"\">Family/Parenting</li>\n<li class=\"li1\" style=\"\">Relationships</li>\n<li class=\"li1\" style=\"\">Real Estate</li>\n<li class=\"li1\" style=\"\">Restaurants</li>\n<li class=\"li1\" style=\"\">Contracting (plumbing, pool building, remodeling, etc.)</li>\n</ul>\n<p> </p>\n<p><span style=\"color: #000000;\">These are just some of the more general industries and topics that we cover.</span></p>\n<p> </p>\n<p><span style=\"font-weight: 600; color: #000000; letter-spacing: 0.75px;\">Requirements</span><span style=\"color: #000000;\">:</span></p>\n<ul style=\"\">\n<li style=\"\">We ask that all work be completed using a word processor such as Microsoft Word or Open Office</li>\n<li style=\"\">A reliable internet connection and the ability to meet deadlines</li>\n<li style=\"\">Good communication skills and respond in a timely manner to editorial staff when they ask for updates on tasks, etc</li>\n<li style=\"\">Work well as a team member with the rest of our content management and editorial staff</li>\n</ul>\n<p><br><br><em><strong>Note</strong>: Applicants to this job signaled that accessing some writing tasks may require payment.</em></p>\n<img src=\"https://remotive.com/job/track/1185979/blank.gif?source=public_api\" alt=\"\"/>","tags":"[\"REST\"]","pubDate":"2025-03-04T16:00:44.000Z","link":"https://remotive.com/remote-jobs/writing/freelance-writer-1185979","slug":"freelance-writer-iapwe-5015"},{"id":8741769515,"title":"Mid-Market Account Executive","company":"HappyCo","image":"https://avatars.githubusercontent.com/u/1021150?s=200&v=4","description":"<div><b style=\"font-size: 11pt\">HappyCo is a company where people can grow their careers and work with like minded people, with no egos or politics. HappyCo is values driven and offers a flexible, supportive culture. Join HappyCo and </b><a class=\"postings-link\" href=\"https://happy.co/media/make-work-happy\"><b style=\"font-size: 11pt\">Make Work Happy</b></a><b style=\"font-size: 11pt\">!</b></div><div><br></div><div>We’re looking for an enthusiastic, self-motivated, and experienced <b>Mid-Market Account Executive</b> to join our team. </div><div><br></div><div><b style=\"font-size: 11pt;\">The Position</b></div><div><span style=\"font-size: 9pt;\">Our Mid-Market Account Executive will work directly with prospects and clients to learn about their current problems and establish how the HappyCo product line can help solve them. Their duties include regularly meeting quotas, company goals and client expectations, helping clients understand the limits of their budget or resources and consistently meeting project deadlines laid out by the </span><a rel=\"noopener noreferrer\" class=\"postings-link\" style=\"font-size: 9pt;\" href=\"http://client.We\">client</a><span style=\"font-size: 9pt;\">. </span></div><div><br></div><div><b style=\"font-size: 9pt;\">We have a preference for candidates that have multifamily, property management or real estate industry experience, but it’s not a requirement. We do, however, require that our Mid-Market Account Executives possess:</b></div><div><br></div><div><b style=\"font-size: 11pt;\">-- A strong sales methodology and experience selling B2B SaaS products</b></div><div><b style=\"font-size: 11pt;\">-- Experience selling a complex platform solution and/or a suite of products</b></div><div><b style=\"font-size: 11pt;\">-- Experience closing deals greater than $40K</b></div><div><b style=\"font-size: 11pt;\">-- Experience selling to C-Level Executives and/or prospects that have decision making authority and hold technical, innovation, or operational positions; experience with a consultative sale which requires engaging with multiple stakeholders&nbsp;</b></div><div>We’re looking for an enthusiastic, self-motivated, and experienced <b>Mid-Market Account Executive</b> to join our team. </div><div><br></div><div><b style=\"font-size: 11pt;\">The Position</b></div><div><span style=\"font-size: 9pt;\">Our Mid-Market Account Executive will work directly with prospects and clients to learn about their current problems and establish how the HappyCo product line can help solve them. Their duties include regularly meeting quotas, company goals and client expectations, helping clients understand the limits of their budget or resources and consistently meeting project deadlines laid out by the </span><a href=\"http://client.We\" style=\"font-size: 9pt;\" class=\"postings-link\" target=\"_blank\" rel=\"noopener noreferrer\">client</a><span style=\"font-size: 9pt;\">. </span></div><div><br></div><div><b style=\"font-size: 9pt;\">We have a preference for candidates that have multifamily, property management or real estate industry experience, but it’s not a requirement. We do, however, require that our Mid-Market Account Executives possess:</b></div><div><br></div><div><b style=\"font-size: 11pt;\">-- A strong sales methodology and experience selling B2B SaaS products</b></div><div><b style=\"font-size: 11pt;\">-- Experience selling a complex platform solution and/or a suite of products</b></div><div><b style=\"font-size: 11pt;\">-- Experience closing deals greater than $40K</b></div><div><b style=\"font-size: 11pt;\">-- Experience selling to C-Level Executives and/or prospects that have decision making authority and hold technical, innovation, or operational positions; experience with a consultative sale which requires engaging with multiple stakeholders&nbsp;</b></div><h3>During your first 1-2 weeks you will:</h3><li>Get to know our leadership, culture, and values</li><li>Complete our HappyCo orientation and onboarding program</li><li>Onboard with the sales team</li><li>Familiarize yourself with Salesforce and other internal sales systems</li><li>Read our favorite industry primers</li><li>Attend your first Company Wide Meeting and Product Update Meetings </li><h3>During your first 1-3 months you will:</h3><li>Get acquainted with the different departments</li><li>Research and establish new potential sales accounts with a focus on top multifamily prospects</li><li>Lead your first meeting and/or product capability assessment with prospects</li><li>Prepare proposal estimates by studying prospect’s current procedures and portfolio</li><li>Prepare sales reports by collecting, analyzing, and summarizing territory information</li><li>Understand and deliver value propositions on all HappyCo products&nbsp; &nbsp;</li><li>Represent HappyCo by spending time in the field, at trade shows, demonstrations and seminars</li><h3>During your first 6-12 months you will:</h3><li>Research and prepare to start meeting or exceeding quota targets&nbsp;</li><li>Manage pipeline and accurately forecast opportunities</li><li>Determine improvements by analyzing cost-benefit ratios of HappyCo software</li><h3>What you could expect day to day:</h3><li>Negotiate and close business for the HappyCo suite of products with top Mid-Market Accounts&nbsp;</li><li>Work in conjunction with HappyCo partners and coworkers to grow the HappyCo brand and message</li><li>Identify and develop relationships with key C-level Executives</li><li>Independently build and maintain a pipeline of prospects and execute against quotas with the goal of consistently attaining or exceeding sales targets</li><li>Participate in deal flow management from signature through completion of launch for new customers&nbsp;</li><li>Work to grow your territory and knowledge of existing prospects</li><h3>What we think you need to be successful</h3><li>At least 3-5 years of sales experience (B2B SaaS) with a preference for multifamily, property management, or real estate industry experience&nbsp;</li><li>Previous sales experience in an Enterprise B2B SaaS context where you've tackled complex workflows and systems&nbsp;</li><li>Strong sales methodology and experience with the ability to demonstrate sales proficiency through a proven track record</li><li>Exceptional verbal and written communication skills, with the ability to effectively communicate at all levels, including with C-level executive</li><li>Strong organizational skills and ability to work independently</li><li>Ability to manage multiple competing priorities, and work effectively under the pressure of time constraints in a fast-paced, collaborative environment</li><li>Passionate belief in the HappyCo core values with unwavering commitment to quality and success</li><li>Ability to travel - up to 30 - 50% - for client meetings and industry trade shows/ events</li><h3>Keys to Optimum Happiness at HappyCo</h3><li>Pushing forward in ambiguity while striving for clarity</li><li>Discovery mindset to uncover pain points of prospects and be able to tie our solution to meet their needs</li><li>Being a proactive contributor to sales and marketing team culture, with a strong growth mindset</li><li>Experience and understanding of early-stage scale-ups and the challenges they face</li><li>Passion for the multifamily residential property industry</li><div>#LI-Remote</div><div><br></div><div><br></div><div><br></div><div><br></div><div><b style=\"font-size: 11pt\">About HappyCo</b>&nbsp;</div><div>Founded in 2011, HappyCo (<a class=\"postings-link\" href=\"http://happy.co\">happy.co</a>) builds mobile and cloud solutions to enable real-time property data. Our flagship product suite 'Happy Property’ has 3.5M units on its platform and has captured more than 400 million photos.&nbsp;</div><div><br></div><div>We’re everyday people with a shared purpose — improving the lives of others. Our team is made up of thinkers, talkers, planners, makers, builders and everything in between. Together, we’re turning our passions into happier communities!&nbsp;&nbsp;</div><div><br></div><div>When customers use our software, their communities get stronger. Our tools empower everyone in multifamily property management to improve their operations and maximize returns, which means they’re building better experiences for their residents. Learn more about our <a class=\"postings-link\" href=\"https://happyco-inc.wistia.com/medias/1va4woy4m3\">Product Vision</a> here!</div><div><br></div><div><b style=\"font-size: 11pt\">Our HappyCo Culture</b></div><div>HappyCo strives to build better communities. So naturally, we are dedicated to making our own community an enjoyable place that allows us do our best work. We’re devoted to building an inclusive, supportive culture that empowers each HappyCo’er to succeed and grow. To learn more about our culture, check out our <a class=\"postings-link\" href=\"https://happy.co/company/careers\">careers page</a>!&nbsp;</div><div><br></div><div><b>We Offer:</b></div><div>- Work from anywhere supported by a flexible company culture</div><div>- Opportunity to work for one of the fastest growing technology companies in the PropTech industry</div><div>- Unlimited vacation time</div><div>- Generous paid parental leave</div><div>- Competitive and equitable pay, including stock options</div><div>- Monthly stipends to support Wellness and Home Office expenses</div><div><br></div><div>Find out more about our <a class=\"postings-link\" href=\"https://happy.co/company/careers/employee-benefits-usa\">US Employee Benefits</a> here!</div><div><br></div><div><i style=\"font-size: 11pt\">We believe in supporting people to do their best work and thrive, and building a diverse, equitable, and inclusive company is core to our mission. Our goal is to ensure that HappyCo upholds an inclusive environment where all people feel that they are equally respected and valued, whether they are applying for an open position or working at the company. We welcome applicants of any educational background, gender identity and expression, sexual orientation, religion, ethnicity, age, citizenship, socioeconomic status, disability, and veteran status. HappyCo is also committed to providing reasonable accommodations for qualified individuals with disabilities and disabled veterans in our job application procedures.</i></div><div><br></div><div><i style=\"font-size: 11pt\">A note to Recruitment Agencies: Please don’t reach out to us about our roles -- we’ve got it covered. We don’t accept unsolicited agency resumes and HappyCo is not responsible for any fees related to unsolicited resumes.</i></div><div><b style=\"font-size: 11pt\">HappyCo is a company where people can grow their careers and work with like minded people, with no egos or politics. HappyCo is values driven and offers a flexible, supportive culture. Join HappyCo and </b><a href=\"https://happy.co/media/make-work-happy\" class=\"postings-link\"><b style=\"font-size: 11pt\">Make Work Happy</b></a><b style=\"font-size: 11pt\">!</b></div>","tags":"[\"management\",\"b2b\"]","pubDate":"2025-03-04T15:14:10.551Z","link":"https://jobs.lever.co/happyco/425d7856-b780-4ac3-bf5a-68cd8d1377bd","slug":"mid-market-account-executive-happyco-7624"},{"id":1446584526,"title":"Growth & Operations Manager (Creator Platforms)","company":"Bunny Agency LLC","image":"https://remotive.com/job/1980253/logo","description":"<p><!--block--><strong>Bunny Agency | Full-time | Remote / Dubai / Budapest / Salary: </strong><strong>$36k with Bonus Payments up to $70.000</strong></p>\n<p><!--block--></p>\n<p><!--block-->Are you ready to play a key role in scaling some of the most successful creators in the world? At <strong>Bunny Agency</strong>, we help top-tier creators turn their personal brands into thriving businesses—and as <strong>Growth &amp; Operations Manager</strong>, you’ll be the engine driving that growth behind the scenes.<br><br></p>\n<p><!--block-->This isn’t your typical ops role. You won’t just keep the machine running, you’ll <em>supercharge</em> it.<br><br></p>\n<p><!--block-->We’re looking for someone who loves <strong>data</strong>, <strong>processes</strong>, and <strong>people</strong> equally. Someone who can take insights from performance metrics and turn them into actionable strategies that unlock real revenue growth. Someone who can lead teams, optimize systems, and make sure our creators and their audiences have an outstanding experience at every touchpoint.<br><br></p>\n<p><!--block--></p>\n<p><!--block--><strong><br>🌟 What You’ll Own</strong></p>\n<ul style=\"\">\n<li style=\"\"><!--block-->Be the <strong>strategic heartbeat</strong> of our backend operations, driving engagement, retention, and revenue across OnlyFans, Instagram, and more.</li>\n<li style=\"\"><!--block-->Analyze creator performance to spot opportunities and create game-changing growth strategies.</li>\n<li style=\"\"><!--block-->Manage and mentor a global team of supervisors and chatters, ensuring top-tier quality, communication, and results.</li>\n<li style=\"\"><!--block-->Lead onboarding for new team members and creators, setting them up for success with clear processes and killer training.</li>\n<li style=\"\"><!--block-->Oversee quality control and constantly optimize shift planning, team structures, and workflows.</li>\n<li style=\"\"><!--block-->Collaborate directly with creators to perfect pricing strategies, content plans, and promotional offers.</li>\n<li style=\"\"><!--block-->Build systems and masterclasses that take our internal talent from good to world-class.</li>\n</ul>\n<p><!--block--></p>\n<p><!--block--><strong><br>🚀 Why You’ll Love This Role</strong></p>\n<ul style=\"\">\n<li style=\"\"><!--block-->You'll work at the cutting edge of the <strong>creator economy</strong>, scaling brands that reach millions.</li>\n<li style=\"\"><!--block-->Your ideas won’t just be heard—they’ll be implemented. We value people who take ownership.</li>\n<li style=\"\"><!--block-->Remote flexibility or join us in <strong>Dubai</strong> or <strong>Budapest</strong>—your call.</li>\n<li style=\"\"><!--block-->Direct impact on high-revenue projects with clear, performance-based bonuses.</li>\n<li style=\"\"><!--block-->Fast-paced, ambitious, and innovative team culture.</li>\n</ul>\n<p><!--block--><br><br><br></p>\n<p><!--block--><strong><br>🎯 We’re Looking For</strong></p>\n<ul style=\"\">\n<li style=\"\"><!--block-->Someone obsessed with <strong>growth</strong> and <strong>optimization</strong>.</li>\n<li style=\"\"><!--block-->Proven experience in <strong>operations</strong>, <strong>analytics</strong>, or <strong>creator platform management</strong>.</li>\n<li style=\"\"><!--block-->Mastery of data analysis and turning numbers into winning strategies.</li>\n<li style=\"\"><!--block-->Exceptional leadership and communication skills.</li>\n<li style=\"\"><!--block-->Knowledge of platforms like <strong>OnlyFans</strong>, <strong>Instagram</strong>, and <strong>Telegram</strong> (or excited to learn fast).</li>\n<li style=\"\"><!--block-->The ability to thrive in a remote, high-accountability environment.</li>\n</ul>\n<p><!--block--></p>\n<p><!--block--><strong><br>🏆 The Results We Expect</strong></p>\n<p><!--block-->Within your first 90 days, you'll aim to deliver:</p>\n<ul style=\"\">\n<li style=\"\"><!--block--><strong>15% increase</strong> in social media engagement.</li>\n<li style=\"\"><!--block--><strong>10% growth</strong> in new subscriptions.</li>\n<li style=\"\"><!--block--><strong>5% reduction</strong> in subscriber churn.</li>\n<li style=\"\"><!--block--><strong>25% revenue boost</strong> across our top-performing accounts.</li>\n</ul>\n<p><!--block--><br><br></p>\n<p><!--block-->If you’re ready to help creators build empires and grow your career in one of the most exciting spaces online <strong>apply now within 2 minutes.</strong></p>\n<img src=\"https://remotive.com/job/track/1980253/blank.gif?source=public_api\" alt=\"\"/>","tags":"[\"backend\",\"social media\",\"analytics\",\"data analysis\",\"onboarding\"]","pubDate":"2025-03-04T14:20:34.000Z","link":"https://remotive.com/remote-jobs/sales-business/growth-operations-manager-creator-platforms-1980253","slug":"growth-operations-manager-creator-platforms-bunny-agency-llc-3749"},{"id":5344009032,"title":"Quality Engineer (K8s Operators)","company":"Percona","image":"https://avatars.githubusercontent.com/u/1683025?s=200&v=4","description":"<p style=\"min-height:1.5em\">We are looking for a skilled and motivated full-time remote Quality Engineer to join our K8s Operators Team. As a Quality Engineer, you will be an integral part of ensuring the quality and reliability of our software products. In this role, you will be part of a distributed engineering team,  maintaining and improving the quality of our software products as part of the release process and in an ongoing fashion. This includes tasks such as analyzing and reporting defects captured by our automated testing frameworks, defining and implementing new test cases, and improving and scaling our testing capabilities and infrastructure.</p><p style=\"min-height:1.5em\"></p><p style=\"min-height:1.5em\"><strong><u>What You Will Do:</u></strong></p><ul style=\"min-height:1.5em\"><li><p style=\"min-height:1.5em\">Building quality into the product in the first place for the Kubernetes Operators for relational and NoSQL databases. Focus on preventing wrong design in the early stages and on automatic testing in CI/CD at a late stage.</p></li><li><p style=\"min-height:1.5em\">Evaluate and improve Percona Operator products and new features based on test plans, discovering product issues &amp; bugs.</p></li><li><p style=\"min-height:1.5em\">Contribute to the DevOps and release management lifecycle, which includes coordinating, testing, and managing Operator releases.</p></li><li><p style=\"min-height:1.5em\">Collaborate with engineers and teams across the company to help deploy and debug Kubernetes Operators to facilitate rapid integration and massive growth.</p></li><li><p style=\"min-height:1.5em\">Research and recommend tools, behaviors, and strategies for improving test and release processes.</p></li><li><p style=\"min-height:1.5em\">Actively participate in architecture/design collaboration and prevent Developers from faulty architecture decisions before code is written.</p></li></ul><p style=\"min-height:1.5em\"></p><p style=\"min-height:1.5em\"><strong><u>What You Have Done:</u></strong></p><ul style=\"min-height:1.5em\"><li><p style=\"min-height:1.5em\">Familiarity with Kubernetes and experience in testing applications within containerized environments.</p></li><li><p style=\"min-height:1.5em\">Solid understanding of database systems, architecture, and performance especially in a cloud or Kubernetes context.</p></li><li><p style=\"min-height:1.5em\">Experience in designing and implementing automated test scripts for databases, preferably with knowledge of Postgres, MySQL, or MongoDB.</p></li><li><p style=\"min-height:1.5em\">Experience and proficiency in Linux.</p></li><li><p style=\"min-height:1.5em\">Capability to build and maintain continuous integration and continuous delivery (CI/CD) pipelines preferably using Jenkins.</p></li><li><p style=\"min-height:1.5em\">Proficiency in scripting languages (e.g., Python, Bash) and familiarity with programming languages for test automation.</p></li><li><p style=\"min-height:1.5em\">Experience with version control systems like Git.</p></li><li><p style=\"min-height:1.5em\">Experience working in an Agile environment, using a test management tool for defect tracking and test management.</p></li></ul><p style=\"min-height:1.5em\"></p><p style=\"min-height:1.5em\"><strong><u>What Will Make You Stand Out:</u></strong></p><ul style=\"min-height:1.5em\"><li><p style=\"min-height:1.5em\">Interest and contributions to the open-source community.</p></li><li><p style=\"min-height:1.5em\">Passion for the evolving landscape of database technologies.</p></li><li><p style=\"min-height:1.5em\">A track record of bringing innovative ideas to the table, contributing to the improvement of testing strategies, automation processes, and overall product quality.</p></li><li><p style=\"min-height:1.5em\">Demonstrated commitment to ongoing learning, staying in touch with the latest trends in quality engineering, cloud, open source, databases, and related technologies.</p></li><li><p style=\"min-height:1.5em\">Experience with Helm charts for Kubernetes deployment and OpenShift OLM for application lifecycle management.</p></li><li><p style=\"min-height:1.5em\">Experienced in Go.</p></li></ul><p style=\"min-height:1.5em\"></p><p style=\"min-height:1.5em\">&lt;!--WEB-ONLY--&gt;</p><p style=\"min-height:1.5em\"><strong>Why Percona?</strong></p><p style=\"min-height:1.5em\">At Percona, we believe an open world is a better world. Our mission is to enable everyone to innovate freely, by providing the best open source database software, support, and services. We make databases and applications run better through a unique combination of expertise and open source software built with the community for you. Our technical teams are experts in MySQL, MongoDB, PostgreSQL, and MariaDB.</p><p style=\"min-height:1.5em\"></p><p style=\"min-height:1.5em\">Percona is proud to be a remote-only and globally dispersed workforce – we have colleagues in more than 50 countries! We offer a collaborative, highly-engaged culture where your ideas are welcome and your voice is heard.</p><p style=\"min-height:1.5em\"></p><p style=\"min-height:1.5em\">Our staff receives generous benefits including flexible work hours and various paid time off programs, all your equipment for your remote office, funds for career development (external training, certifications, conferences), ongoing connectivity allowances, and the opportunity to participate in our equity incentive plan. We also have benefits that support a healthy work/life balance such as The Percona Adventure Team, Work-from-Anywhere, FlowDays, FryDays, and overall flexibility. We also support being socially responsible through our PAVE volunteering program and Women Transforming Technology.</p><p style=\"min-height:1.5em\"></p><p style=\"min-height:1.5em\">If you love the idea of working with a high-growth tech company that is one of the best in the business and known globally as a leader in the open-source database space, let’s talk!</p><p style=\"min-height:1.5em\"></p><p style=\"min-height:1.5em\">Connect with us and stay up to date on our latest news and developments by following us on <a target=\"_blank\" rel=\"noopener noreferrer\" class=\"postings-link\" href=\"https://www.linkedin.com/search/results/all/?fetchDeterministicClustersOnly=true&amp;heroEntityKey=urn:li:organization:421929&amp;keywords=percona&amp;origin=RICH_QUERY_TYPEAHEAD_HISTORY&amp;position=0&amp;searchId=29912b91-aeb0-4aa6-b3ab-fc70c59fa57f&amp;sid=u0N\">LinkedIn</a> and <a target=\"_blank\" rel=\"noopener noreferrer\" class=\"postings-link\" href=\"https://twitter.com/Percona?ref_src=twsrc%5Egoogle%7Ctwcamp%5Eserp%7Ctwgr%5Eauthor\">Twitter</a>. We look forward to connecting with you!</p>","tags":"[\"postgres\",\"management\",\"engineering\",\"database\",\"mysql\",\"mongo\"]","pubDate":"2025-02-26T11:13:31.164Z","link":"https://jobs.ashbyhq.com/percona/d3f408d7-ce42-416c-8f98-f0950c0b38fa","slug":"quality-engineer-k8s-operators-percona-3637"}]