[{"id":8465391367,"title":"Recruiter","company":"Mechanical Orchard","image":"https://pbs.twimg.com/profile_images/1592609773958025216/CaG1yAqK_400x400.png","description":"<div class=\"section page-centered\" data-qa=\"job-description\"><div><span style=\"font-size: 11pt\">Mechanical Orchard is a fast-growing startup that takes a fresh view on old problems. We replace legacy computing systems for the Global 2000, with a focus on mitigating risk and creating a genuinely solid foundation for innovating and adapting.&nbsp;</span></div><div><br></div><div><span style=\"font-size: 11pt\">Our background in software development and the impact on the industry is well known, and we've literally helped write the book on XP and other impactful agile practices. We’re applying the same thoughtfulness and rigor in weaving AI into everything we do. We believe in the durable principles behind agile, and embrace the power of cross-functional teams, collective ownership, test driven development, short feedback loops, and continuous improvement.</span></div><div><br></div><div><span style=\"font-size: 11pt\">We are Generous, Ethical, Effective, and Kind.</span></div><div><br></div><div><b>Recruiter Job Responsibilities:</b></div><div><br></div><div>-Establish a recruiting strategy and define requirements in alignment with the organization's plans and objectives.</div><div>-Partner with management to consult on talent requirements; leverage the most effective sourcing channels and strategies to identify potential candidates and develop a pipeline of qualified candidates.</div><div>-Manage end-to-end recruitment, from planning to the implementation of the recruitment strategy.</div><div>-Own full-cycle recruitment process - requirement identification, job descriptions, sourcing, screening, interview scheduling, feedback consolidation, compensation negotiation, compliance, hiring and onboarding, attrition monitoring.</div><div>-Create a positive candidate experience throughout the sourcing and selection process.</div><div>-Work closely with management to identify relevant metrics, and monitor the effectiveness of the recruiting process to optimize key metrics.</div><div>-Manage the internship program by conducting orientations; scheduling rotations and assignments; monitoring intern job contributions; coaching interns; and advising managers on training and coaching.</div><div><br></div><div><b>The Ideal Candidate:</b></div><div><br></div><div>-Possesses a strong understanding of technical requirements and excellent candidate assessment skills.</div><div>-Is fluent in relevant employment law and international hiring practices.</div><div>-Possesses strong communication skills and exhibits good judgment.</div><div>-Understands that our brand is reflected through every touchpoint.</div><div>-Improves our positioning and employee value proposition by monitoring job offers and compensation, and recommending new policies and practices concerning benefits and perks.</div><div>-Continually improves by participating in educational opportunities, maintaining personal networks, and participating in professional organizations.</div><div><br></div><div><b>Education / Experience:</b></div><div><br></div><div>-6-8 years of experience in exempt and non-exempt recruiting within a full life-cycle environment, including managing multiple roles simultaneously.</div><div>-A minimum of 5 years of experience in recruiting within the relevant industry.</div><div>-Bachelor’s degree preferred.</div><div><br></div><div>This role reports to the VP of Human Resources.</div></div><div class=\"section page-centered\" data-qa=\"closing-description\"><div><span style=\"font-size: 11pt\">Mechanical Orchard, Inc. is an Equal Opportunity Employer and Prohibits Discrimination and Harassment of Any Kind. Mechanical Orchard, Inc. is committed to the principle of equal employment opportunity for all employees and to providing employees with a work environment free of discrimination and harassment. All employment decisions at Mechanical Orchard, Inc. are based on business needs, job requirements and individual qualifications, without regard to race, color, religion or belief, national, social or ethnic origin, sex (including pregnancy), age, physical, mental or sensory disability, HIV Status, sexual orientation, gender identity and/or expression, marital, civil union or domestic partnership status, past or present military service, family medical history or genetic information, family or parental status, or any other status protected by the laws or regulations in the locations where we operate. Mechanical Orchard, Inc. will not tolerate discrimination or harassment based on any of these characteristics. Mechanical Orchard, Inc. encourages applicants of all ages. Mechanical Orchard, Inc. will provide reasonable accommodation to employees who have protected disabilities consistent with local law.</span></div><div><br></div><div>We look forward to reviewing your application. Thanks!</div></div><div class=\"section page-centered last-section-apply\" data-qa=\"btn-apply-bottom\"><a class=\"postings-btn template-btn-submit hex-color\" data-qa=\"show-page-apply\" href=\"https://jobs.lever.co/mechanicalorchard/fa1e3ff1-5301-4fa2-bb26-b56ec725ea64/apply\">Apply for this job</a></div>","tags":"[\"management\",\"aws\"]","pubDate":"2024-01-31 07:17:33.482","link":"https://jobs.lever.co/mechanicalorchard/fa1e3ff1-5301-4fa2-bb26-b56ec725ea64","savedDate":"2024-01-31 07:17:33.482","slug":"recruiter-mechanical-orchard-4028"},{"id":9364845683,"title":"Email Marketer / Copywriter","company":"Instrumentl","image":"https://pbs.twimg.com/profile_images/1263546899153502209/ObHsQoNr_400x400.jpg","description":"<div class=\"section page-centered\" data-qa=\"job-description\"><div>Do you love crafting engaging digital experiences and using email to connect with people? Do you have a knack for testing and refining strategies to maximize results? How about making a social impact while working in tech? If so, this position is for you. </div><div><br></div><div><b style=\"font-size: 18px\">Who We Are:</b></div><div>Instrumentl is a profitable, hypergrowth YC-backed startup with over 3,000 nonprofit clients, from local homeless shelters to larger organizations like the San Diego Zoo and the University of Alaska. We are building the future of fundraising automation, helping nonprofits to discover, track, and manage grants efficiently through our SaaS platform.</div><div><br></div><div><b style=\"font-size: 18px\">The Opportunity:</b></div><div>Instrumentl is looking for an intellectually curious Email Marketer to scale and optimize multiple messaging initiatives across our go-to-market teams. We’re interested in candidates who think strategically,&nbsp;thrive on community engagement, and take every opportunity to improve existing processes.</div><div><br></div><div>As our Email Marketer, you'll take charge of planning, organizing, and executing impactful email marketing campaigns. Your primary objective is to drive demand, create meaningful connections, and foster community engagement through the power of email.</div><div><br></div><div>You’ll have significant ownership over email as a channel and the creative freedom to pitch new ideas and suggest ways to build a community.&nbsp;As a Growth team member, you'll work closely with: </div><div><br></div><div>- Will, Head of Growth</div><div>- Mia, Growth Strategist</div><div>- Ryan, Content Marketer</div><div>- Rachel, Events &amp; Community Manager</div><div>- Emily, Growth Product Designer</div><div><br></div><div>Get to know us at&nbsp;<a href=\"https://www.instrumentl.com/about\" class=\"postings-link\">instrumentl.com/about</a>! We can’t wait to meet you.</div><div><br></div><div>We are fully distributed<b> (read: no office!)</b>. For this position, we are looking for someone based in the continental US, but open to candidates who have substantial overlap with&nbsp;standard working hours in the Central Time Zone.&nbsp;</div><div><br></div><div><b style=\"font-size: 18px\">Why Join Instrumentl?</b></div><div>At Instrumentl, we are lucky to kick it every day with some of the nicest people in the world. No joke, our customers are often on the front lines saving endangered species, restoring watersheds, and educating kids. By helping nonprofits force multiply their ability to create impact, you’re helping them move the world forward.</div><div><br></div><div>You’ll be joining our small but mighty team, playing a huge role in shaping our culture for the years and teammates to come.</div><div><br></div><div>Instrumentl is evolving rapidly. You’ll always have new challenges and opportunities to grow in your role - you won’t be bored!</div></div><div class=\"section page-centered\"><div><h3>What You'll Do</h3><ul class=\"posting-requirements plain-list\"><ul><li>Develop and execute a comprehensive email marketing strategy aligned with overall marketing OKRs</li><li>Collaborate with cross-functional teams to ensure cohesive integration of email campaigns with other marketing channels</li><li>Create compelling and relevant content for email campaigns, including copywriting, visuals, and multimedia elements</li><li>Utilize subscriber data to segment audiences effectively and personalize email content for maximum impact</li><li>Further scale current email efforts&nbsp; to introduce thematic newsletters and build meaningful journeys for subscribers&nbsp;</li><li>Implement A/B testing strategies to optimize email performance and engagement rates</li><li>Monitor and analyze key email marketing metrics, and continuously improve your approach</li><li>Support the sales team with reviewing and refining emails or prospect nurturing sequences</li><li>Generate regular reports to track and measure the success of email campaigns against established KPIs</li></ul></ul></div></div><div class=\"section page-centered\"><div><h3>What We're Looking For</h3><ul class=\"posting-requirements plain-list\"><ul><li>4+ years of full-time work experience: you have been part of a Growth or Marketing team, preferably at a SaaS company. You have a proven track record of growing email lists and results to show. We are prioritizing experienced hires. </li><li>Strong business acumen: you can answer unstructured business questions and interpret qualitative and quantitative data to drive projects to conclusion.&nbsp;</li><li>Excellent analytical skills: you spot trends quickly, and are highly comfortable with tracking KPIs and applying A/B testing methodologies to experiment with different elements in email campaigns (subject lines, content, visuals)</li><li>Clear communication: you pride yourself on your ability to communicate complex topics easily in person (or on video) and in writing.&nbsp;</li><li>Effective execution: you work efficiently, meet deadlines, stay organized, and have a reputation for being incredibly dependable. It pains you to miss a goal or milestone.&nbsp;&nbsp;</li><li>Resourcefulness: you are able to conduct research and figure out solutions to new problems,&nbsp; given general direction and guidance.&nbsp;</li><li>Tech savviness: you love using tools like Mailer Lite, G Suite, Zoom, Slack, <a href=\"http://Close.io\" class=\"postings-link\">Close.io</a>, and Canva. You’re a fan of shortcuts and can name your favorites off the top of your head.</li><li>Growth mindset: you’re a self-motivated learner, and you welcome the chance to exchange constructive feedback with colleagues.&nbsp;</li><li>Friendly demeanor: you are warm and approachable, easy to work with, and genuinely enjoy connecting with others.</li><li><b>Bonus</b>: experience working in early-stage startups and being comfortable (even thriving!) with ambiguity.</li><li><b>Bonus</b>: experience in the nonprofit sector, especially with grants.</li></ul></ul></div></div><div class=\"section page-centered\"><div><h3>Compensation &amp; Benefits</h3><ul class=\"posting-requirements plain-list\"><ul><li>$70K-$90K/year salary and equity, depending on experience</li><li>Health, dental, and vision insurance</li><li>Unlimited PTO policy, including parental leave</li><li>Company laptop + stipend to set up your home workstation</li><li>Work with awesome nonprofits around the US. We partner with incredible organizations doing meaningful work, and you get to help power their success.</li></ul></ul></div></div><div class=\"section page-centered\" data-qa=\"salary-range\"><div>$70,000 - $90,000 a year</div></div><div class=\"section page-centered\" data-qa=\"closing-description\"><div><b style=\"font-size: 18px\">Ready to Apply?</b></div><div>Submit a cover letter or 5-minute Loom video addressing:</div><div>- Your past experience related to the responsibilities of this job&nbsp;3 traits (and examples) that make you an ideal candidate for this position</div><div>- Include the word timberwolves in your proposal to show you read this from start to finish! </div><div>- Along with your cover letter or Loom video, please attach your CV or resume.</div><div><br></div><div><i>At Instrumentl, we pride ourselves on building a diverse team from the ground up. Every role is an opportunity to teach, learn, and create some of your best work - if you’re excited to grow along with us, we encourage you to apply!</i></div><div><br></div></div><div class=\"section page-centered last-section-apply\" data-qa=\"btn-apply-bottom\"><a class=\"postings-btn template-btn-submit hex-color\" data-qa=\"show-page-apply\" href=\"https://jobs.lever.co/Instrumentl/f5545f51-4282-4d59-92ba-41137955c314/apply\">Apply for this job</a></div>","tags":"[]","pubDate":"2024-01-31 07:17:33.481","link":"https://jobs.lever.co/Instrumentl/f5545f51-4282-4d59-92ba-41137955c314","savedDate":"2024-01-31 07:17:33.481","slug":"email-marketer-copywriter-instrumentl-4195"},{"id":3064832593,"title":"Software Engineer - Release [IC2] ","company":"Sourcegraph","image":"https://pbs.twimg.com/profile_images/1428393724527190022/4mt5PACL_400x400.png","description":"\n    <div class=\"content-intro\"><h3>ALL SOURCEGRAPH ROLES ARE FULLY REMOTE</h3>\n<h2><span style=\"color: #a112ff;\">Who we are</span></h2>\n<p>Our mission at Sourcegraph is to make it so that&nbsp;<a class=\"c-link\" href=\"https://handbook.sourcegraph.com/strategy-goals/strategy\" target=\"_blank\" data-stringify-link=\"https://handbook.sourcegraph.com/strategy-goals/strategy\" data-sk=\"tooltip_parent\">everyone can code</a>, not just ~0.1% of the population. Our code graph powers Cody, the most powerful and accurate AI coding assistant, as well as our Code Search product, which helps devs explore their entire codebase and make large-scale migrations and security fixes. We’re building software that builds software, and in doing so we’re making devs more productive and preparing for a world where a lot more code gets written.</p>\n<p>It’s an exciting time to join Sourcegraph. AI has taken over the world, and we’ve spent the last 10 years building infrastructure that’s integral to making AI generated code more powerful and accurate. Our customers include 4/5 FAANG companies, 4 of the top 10 banks, government organizations, Uber, Plaid, and many other companies building the software that pushes the world forward. We’ve raised $225M at a $2.625B valuation from <a class=\"c-link\" href=\"https://techcrunch.com/2021/07/13/sourcegraph-raises-125m-series-d-on-2-6b-valuation-for-universal-code-search-tool/\" target=\"_blank\" data-stringify-link=\"https://techcrunch.com/2021/07/13/sourcegraph-raises-125m-series-d-on-2-6b-valuation-for-universal-code-search-tool/\" data-sk=\"tooltip_parent\">Andreessen Horowitz</a>,&nbsp;<a class=\"c-link\" href=\"https://about.sourcegraph.com/blog/series-c-with-sequoia/\" target=\"_blank\" data-stringify-link=\"https://about.sourcegraph.com/blog/series-c-with-sequoia/\" data-sk=\"tooltip_parent\">Sequoia</a>,&nbsp;<a class=\"c-link\" href=\"https://www.redpoint.com/companies/sourcegraph/\" target=\"_blank\" data-stringify-link=\"https://www.redpoint.com/companies/sourcegraph/\" data-sk=\"tooltip_parent\">Redpoint</a>,&nbsp;<a class=\"c-link\" href=\"https://medium.com/craft-ventures/why-we-invested-in-sourcegraph-5ace28317e3d\" target=\"_blank\" data-stringify-link=\"https://medium.com/craft-ventures/why-we-invested-in-sourcegraph-5ace28317e3d\" data-sk=\"tooltip_parent\">Craft</a>&nbsp;and others. We’re making ambitious bets on our future and we’re looking to hire exceptional people to join our team as we make Sourcegraph one of the biggest and most influential companies in the world.</p></div>\n\n    <h2><span style=\"color: rgb(140, 51, 236);\"><strong>Working hours&nbsp;</strong></span></h2>\n<p>🌎 Given that we are an all-remote company and hire <a href=\"https://handbook.sourcegraph.com/departments/people-ops/process/how-we-engage-talent-outside-the-us/\">almost anywhere</a> in the world, we don’t have a particular time-zone preference for this role. However, you may need to be available for non-recurring urgent meetings outside of working hours.</p>\n<h2><span style=\"color: rgb(140, 51, 236);\"><strong>Why this job is exciting&nbsp;</strong></span></h2>\n<p><a href=\"https://about.sourcegraph.com/cody?utm_source=google&amp;utm_medium=cpc&amp;utm_campaign=19895311885&amp;utm_term=sourcegraph%20cody&amp;gclid=CjwKCAjw0ZiiBhBKEiwA4PT9z9jbT-6ncbQS5bLcQHfuIy9Je5bCogDwICrbbZ8Z9TkwiKkenGMuFRoCptEQAvD_BwE\">Cody</a> is the best AI coding assistant today, and you'll get to help build it and get it in the hands of millions of devs. Our code intelligence, married with modern AI, is already providing a remarkable alpha experience, and you can help us unlock its full potential.&nbsp;</p>\n<p>Our rapid development pace means that building and releasing our products to the market is a unique challenge, from overseeing the release of all components supporting Cody as well as Cody itself, building the tools to provide a self-service experience to all teammates, to taking part in building a quality infrastructure to monitor Cody quality.&nbsp;</p>\n<p>We are looking for a Senior Release Engineer to join the Developer Infrastructure team to take our release process to the next level, turning it into a seamless process for everyone, maximizing the ownership of individual teams with a platform based approach.&nbsp;</p>\n<p>By joining our team, you will directly impact how Cody and our Code Intelligence platform is released to the world and be at the crossroads of all Sourcegraph teams by building mission critical tools to support our mission.&nbsp; If you’re passionate about enhancing developers’ productivity and are excited to be a part of a dynamic team pushing the boundaries of technology, then this role is for you.</p>\n<p>📅 Within one month, you will…</p>\n<ul>\n<li>Begin building relationships with cross-functional teams, including the Cody development team and other stakeholders.</li>\n<li>Dive into the codebase of Cody and Code Intelligence platform, gaining a deep understanding of the existing code, architecture, and dependencies.</li>\n</ul>\n<p>📅 Within three months, you will…</p>\n<ul>\n<li>Implement improvements that result in a measurable reduction in the time it takes to release new versions of Cody and the Code Intelligence platform while higher-level insights on architecture, scalability, and customer focus.</li>\n<li>Establish strong working relationships with Security teams, ensuring that the release process incorporates necessary security measures.</li>\n<li>Actively participate in code reviews and discussions to contribute higher-level insights on architecture, scalability, and customer focus.</li>\n</ul>\n<p>📅 Within six months, you will…</p>\n<ul>\n<li>Contribute to the development of a robust and scalable infrastructure for monitoring Cody's quality, performance, and user experience.</li>\n<li>Implement proactive alerting and monitoring systems to detect issues before they impact customers.</li>\n</ul>\n<p>📅 Within one year, you will…</p>\n<ul>\n<li>Successfully evolve the release process into a mature platform, enabling teams across Sourcegraph to manage their releases independently.</li>\n<li>Proactively propose additions and changes to the team's roadmap, aligning it with the broader goals of Sourcegraph.</li>\n</ul>\n<h2><span style=\"color: rgb(140, 51, 236);\"><strong>About you</strong></span></h2>\n<ul>\n<li>You’re a software engineer first, but you have a passion for working on the boundaries between software and the underlying infrastructure. You might have some past experience as an SRE, developing tooling for other developers, or jumping between the two.</li>\n<li>You’re interested in distributed systems and have experience debugging a few of the challenges that come along with them.</li>\n<li>You understand the software lifecycle, from design, to coding, to docs, as well as the maintenance lifecycle over time.</li>\n<li>You don't write code for the sake of it, but to provide value to our customers by solving problems.</li>\n<li>You value integrity and teamwork. Your strong sense of empathy helps you understand your peers' challenges and you sharply understand how to balance solving current and future problems, carving a path to implement your vision. You’re able to contribute feedback to your teammates as well as across team boundaries when needed.</li>\n<li>You understand your role in the company and how you contribute to its success or failures. You have a strong sense of ownership and a healthy sense of urgency. You&nbsp; understand that this is <strong>your</strong> company now.</li>\n<li>Your sense of ownership extends to the software that you ship to your customers. You understand that your code is likely the first impression many customers have of your company, and you often pause to consider the customer experience during development.</li>\n<li>You do work you are proud of and your work is respected by your peers as well as the broader community.</li>\n</ul>\n<h3>Skills</h3>\n<ul>\n<li>You're proficient at writing at least one language and likely experienced in other languages as well.</li>\n<li>You’ve done some frontend development work at some point in your career.</li>\n<li>You've had experience working with delivery and build pipelines of various sizes.</li>\n<li>You have working knowledge of Kubernetes, perhaps even including working and developing with Kubernetes APIs and internals such as CRDs and controllers.</li>\n<li><strong>Bonus:</strong> You have worked with Bazel or other build systems in large polyglot codebases.</li>\n<li><strong>Bonus:&nbsp;</strong>Familiarity with SvelteKit and Tailwind CSS.</li>\n</ul>\n<p>It doesn't matter if you're not an expert on all points, what really counts is that you understand the complexities of releasing software, and thrive to make it a seamless experience for both our customers and our teammates. Ultimately, you can jump in at any point in the software lifecycle and understand how to fix issues.</p>\n<h2><span style=\"color: rgb(140, 51, 236);\"><strong>Level</strong></span></h2>\n<p>📊 This job is an IC2.&nbsp; You can read more about <a href=\"https://handbook.sourcegraph.com/benefits-pay-perks/pay-expenses/compensation/leveling-guide/\">our job leveling philosophy</a> in our Handbook.</p>\n<h2><span style=\"color: rgb(140, 51, 236);\"><strong>Compensation</strong></span></h2>\n<p><strong>💸 We pay you an above-average salary</strong> because we want to hire the best people who are fully focused on helping Sourcegraph succeed, not worried about paying bills. You will have the flexibility to work and live anywhere in the world<em> (unless specified otherwise in the job description)</em>, and we’ll never take your location or current/past salary information into account when determining your compensation.&nbsp; As an <a href=\"https://handbook.sourcegraph.com/company-info-and-process/values/#sts=Open%20and%20transparent\">open and transparent </a>company that values equitable and competitive compensation for everyone, our <a href=\"https://handbook.sourcegraph.com/benefits-pay-perks/pay-expenses/compensation/\">compensation ranges are visible</a> to every single Sourcegraph Teammate. To determine your salary, we use a number of market and data-driven salary sources and target the high-end of the range, ensuring that we’re always paying above market regardless of where you live in the world.&nbsp;&nbsp;</p>\n<p>💰 The target compensation for this role is $141,500 USD base salary.</p>\n<p>📈 In addition to our cash compensation, we offer equity (because when we succeed as a company, we want you to succeed, too) and generous <a href=\"https://handbook.sourcegraph.com/benefits-pay-perks/benefits-perks/\">perks &amp; benefits</a>.</p>\n<h2><span style=\"color: rgb(140, 51, 236);\"><strong>Interview process</strong></span></h2>\n<p><em>Below is the interview process you can expect for this role (you can read more about </em><a href=\"https://handbook.sourcegraph.com/talent/types_of_interviews\"><em>the types of interviews</em></a><em> in our Handbook). It may look like a lot of steps, but rest assured that we move quickly and the steps are designed to help you get the information needed to determine if we’re the right fit for you… Interviewing is a two-way street, after all!&nbsp;</em></p>\n<p>We expect the interview process to take 4 hours in total.</p>\n<p><strong>👋 Introduction Stage</strong> - we have initial conversations to get to know you better…</p>\n<ul>\n<li>[30m] <a href=\"https://handbook.sourcegraph.com/departments/people-talent/talent/process/types_of_interviews/#recruiter-screen\">Recruiter Screen</a> with Grace Bohl&nbsp;</li>\n<li>[60m] <a href=\"https://handbook.sourcegraph.com/departments/people-talent/talent/process/engineering_interview_process_candidates/#technical-interview\">Technical Interview</a> and&nbsp;<a href=\"https://handbook.sourcegraph.com/departments/people-talent/talent/process/types_of_interviews/#resume-deep-dive\">Resume Deep Dive</a> with Jacob Pleiness</li>\n</ul>\n<p><strong>🧑‍💻 Team Interview Stage</strong> - we then delve into your experience in more depth and introduce you to members of the team…</p>\n<ul>\n<li>[45m] Code Walkthrough</li>\n<li>[15m]&nbsp;<a href=\"https://handbook.sourcegraph.com/departments/people-talent/talent/process/types_of_interviews/#hiring-manager-screen\">Hiring Manager Screen </a>with Nelson Araujo</li>\n<li>[60m] <a href=\"https://handbook.sourcegraph.com/departments/people-talent/talent/process/engineering_interview_process_candidates/#pairing-exercise\">Technical Interview: Pairing Exercise</a> with Michael Lin and Dax McDonald</li>\n<li>[45m] <a href=\"https://handbook.sourcegraph.com/departments/people-talent/talent/process/types_of_interviews/#cross-functional-team-collaboration-interview\">Cross-functional Team Interview</a> with <span style=\"font-weight: 400;\">Jon Galindo and Louis Jarvis</span></li>\n</ul>\n<p><strong>🎉 Final Interview Stage </strong>- we move you to our final round, where you meet cross-functional partners and gain a better understanding of our business and values holistically…</p>\n<ul>\n<li>[30m] <a href=\"https://handbook.sourcegraph.com/departments/people-talent/talent/process/types_of_interviews/#values-interview\">Values Interview</a></li>\n<li>[30m] <a href=\"https://handbook.sourcegraph.com/departments/people-talent/talent/process/types_of_interviews/#leadership-interview\">Leadership Interview</a> with co-founder&nbsp;</li>\n</ul>\n<p>We check references and conduct your background check</p>\n<p>Please note - you are welcome to request additional conversations with anyone you would like to meet, but didn’t get to meet during the interview process.</p>\n\n    \n\n    <div class=\"content-conclusion\"><h2><span style=\"color: #a112ff;\">Not sure if this is you?</span></h2>\n<p><span style=\"font-weight: 400;\">We want a diverse, global team, with a broad range of experience and perspectives. If this job sounds great, but you’re not sure if you qualify, apply anyway! We carefully consider every application, and will either move forward with you, find another team that might be a better fit, keep in touch for future opportunities, or thank you for your time.</span></p>\n<h2><span style=\"color: #a112ff;\">Learn more about us</span></h2>\n<p><span style=\"font-weight: 400;\">To create a product that serves the needs of all developers, we are building a diverse </span><a href=\"https://handbook.sourcegraph.com/company-info-and-process/remote\"><span style=\"font-weight: 400;\">all-remote team</span></a><span style=\"font-weight: 400;\"> that is </span><a href=\"https://handbook.sourcegraph.com/team\"><span style=\"font-weight: 400;\">distributed across the world</span></a><span style=\"font-weight: 400;\">. Sourcegraph is an equal opportunity workplace; we welcome people from all backgrounds and communities.&nbsp;</span></p>\n<p><span style=\"font-weight: 400;\">We provide </span><a href=\"https://about.sourcegraph.com/handbook/people-ops/compensation\"><span style=\"font-weight: 400;\">competitive compensation</span></a><span style=\"font-weight: 400;\"> and </span><a href=\"https://about.sourcegraph.com/handbook/people-ops/benefits-and-perks\"><span style=\"font-weight: 400;\">practical benefits</span></a><span style=\"font-weight: 400;\"> to keep you happy and healthy so that you can do your best work.&nbsp;</span><span style=\"font-weight: 400;\">&nbsp;</span></p>\n<p><span style=\"font-weight: 400;\">Learn more about what it is like to work at Sourcegraph by reading </span><a href=\"https://about.sourcegraph.com/handbook/\"><span style=\"font-weight: 400;\">our handbook</span></a><span style=\"font-weight: 400;\">.</span></p>\n<p><span style=\"font-weight: 400;\">We want to ensure Sourcegraph is an environment that suits your working style and empowers you to do your best work, so we are eager to answer any questions that you have about us at any point in the interview process.</span></p>\n<p><span style=\"font-weight: 400;\">Go back to the </span><a href=\"https://about.sourcegraph.com/jobs/\"><span style=\"font-weight: 400;\">careers page</span></a><span style=\"font-weight: 400;\"> for all open positions.</span></p>\n<p>&nbsp;</p>\n<p><em><span style=\"font-weight: 400;\">Sourcegraph participates in <a href=\"https://handbook.sourcegraph.com/departments/people-talent/e-verify/\" target=\"_blank\">E-Verify</a> for U.S. Employees</span></em></p></div>\n","tags":"[\"engineering\"]","pubDate":"2024-01-31 07:17:33.479","link":"https://boards.greenhouse.io/sourcegraph91/jobs/5066307004","savedDate":"2024-01-31 07:17:33.479","slug":"software-engineer-release-ic2-sourcegraph-5762"},{"id":7794187330,"title":"QA Automation engineer (mobile & API)","company":"Tabby","image":"https://remotive.com/job/1894385/logo","description":"<div><!--block-->We are hiring for <strong>QA engineer</strong> to join our team. In this role you will help us build our core product, improve processes and create discovery ways in the product. You will collaborate with the whole team and make real impact to the project. </div><br><br><div class=\"h3\">Key Responsibilities</div><ul style=\"\"><li style=\"\"><!--block-->Functional and non-functional testing; </li><li style=\"\"><!--block-->Making impactful decisions, prioritizing tasks and helping engineering teams with the direction;</li><li style=\"\"><!--block-->Finding the reason of the problem and consult team about that; </li><li style=\"\"><!--block-->Developing and improving documentation;</li><li style=\"\"><!--block-->Collaborate with our engineering and product teams </li></ul><div><!--block--><br></div><br><br><div class=\"h3\">Skills, Knowledge and Expertise</div><ul style=\"\"><li style=\"\"><!--block-->3+ years of experience as manual QA; </li><li style=\"\"><!--block-->At least 1 year of experience with mobile testing;</li><li style=\"\"><!--block-->Good knowledge of testing and development processes;</li><li style=\"\"><!--block-->Experience with CI/CD (Gitlab, Jenkins or Teamcity);</li><li style=\"\"><!--block-->Accountability for quality of the product;</li><li style=\"\"><!--block-->Ability to make decisions;</li><li style=\"\"><!--block-->Experience with auto tests in any language; </li><li style=\"\"><!--block-->Experience with APIs, SQL;</li><li style=\"\"><!--block-->Fluent english. </li></ul><div><!--block--><br></div><div><!--block--><br></div><br><br><div class=\"h3\">Benefits</div><ul style=\"\"><li style=\"\"><!--block-->We offer flexible working hours and trust you to work enough hours to do your job well, at times that suit you and your team.</li><li style=\"\"><!--block-->A working environment that gives you autonomy and responsibility from day one.</li><li style=\"\"><!--block-->You should be comfortable with the idea that the quality of your work will influence the shape of your career.</li><li style=\"\"><!--block-->Participation in company’s employee stock options program.</li><li style=\"\"><!--block-->Health Insurance</li></ul><div><!--block--><br></div><img src=\"https://remotive.com/job/track/1894385/blank.gif?source=public_api\" alt=\"\"/>","tags":"[\"sql\",\"CI/CD\"]","pubDate":"2024-01-30 01:20:54.000","link":"https://remotive.com/remote-jobs/qa/qa-automation-engineer-mobile-api-1894385","savedDate":"2024-01-31 07:17:33.476","slug":"qa-automation-engineer-mobile-api-tabby-1637"}]