[{"id":7785289777,"title":"Junior Cloud Field Engineer - Worldwide","company":"Canonical","image":"https://pbs.twimg.com/profile_images/1673959375340290050/x7pNtXQ7_400x400.jpg","description":"\n      <p>Help global companies embrace the latest private cloud infrastructure, Linux and cloud native operations, and open source applications. Our team applies expert insights to real-world customer problems, enabling the enterprise adoption of Linux Ubuntu, OpenStack, Kubernetes and a wide range of associated technology.</p>\n<p>This role has very diverse responsibilities. The team members are Linux and cloud solutions architects for our customers, designing private and public cloud solutions fitting their workload needs. They are the cloud consultants who work hands-on with the technologies by deploying, testing and handing over the solution to our support or managed services team at the end of a project. They are also software engineers who use Python to develop Kubernetes operators and Linux open source infrastructure-as-code.</p>\n<p>The people who love this role are developers who like to solve customer problems through architecture, presentations and training.</p>\n<p><strong>Location:</strong> This role will be home based.</p>\n<p><strong>What your day will look like</strong></p>\n<ul>\n<li>Work across the entire Linux stack, from kernel, networking, storage, to applications</li>\n<li>Work in Python to design and deliver open source code</li>\n<li>Architect cloud infrastructure solutions like OpenStack, Kubernetes, Ceph, Hadoop and Spark either On-Premises or in Public Cloud (AWS, Azure, Google Cloud)</li>\n<li>Coach and develop your colleagues where you have insights</li>\n<li>Grow a healthy, collaborative engineering culture in line with the company values</li>\n<li>Work from the comfort of your home</li>\n<li>Global travel up to 25% of time for internal and external events</li>\n</ul>\n<p><strong>What we are looking for in you</strong></p>\n<ul>\n<li>University degree in Computer Science or related software engineering expertise</li>\n<li>You have sound knowledge of cloud computing concepts &amp; technologies, such as Kubernetes, OpenStack, AWS, GCP, Azure, Ceph, etc.</li>\n<li>You have practical knowledge of Linux and networking</li>\n<li>You have Intermediate to Advanced level of Python programming skills</li>\n<li>You are a dynamic person who loves to jump in new projects and interact with people</li>\n<li>You have a demonstrated drive for continual learning</li>\n<li>Excellent communication and presentation skills (English)</li>\n<li>You have great organisational skills and follow-up reliably on commitments</li>\n<li>(Optional) You speak a second language</li>\n</ul>\n<p><strong>What you’ll learn</strong></p>\n<ul>\n<li>OpenStack and Kubernetes infrastructure</li>\n<li>Linux Ubuntu and networking knowledge</li>\n<li>Wide range of open source applications and skills</li>\n<li>Work directly with customers in a range of different businesses&nbsp;</li>\n<li>Real-life and hands-on exposure to a wide range of emerging technologies and tools&nbsp;</li>\n</ul>\n<p><strong>What we offer you</strong></p>\n<p>We consider geographical location, experience, and performance in shaping compensation worldwide. We revisit compensation annually (and more often for graduates and associates) to ensure we recognise outstanding performance. In addition to base pay, we offer a performance-driven quarterly bonus. We provide all team members with additional benefits, which reflect our values and ideals. We balance our programs to meet local needs and ensure fairness globally.</p>\n<ul>\n<li>Distributed work environment with twice-yearly team sprints in person - we’ve been working remotely since 2004!</li>\n<li>Personal learning and development budget of USD 2,000 per year</li>\n<li>Annual compensation review</li>\n<li>Recognition rewards</li>\n<li>Annual holiday leave</li>\n<li>Maternity and paternity leave</li>\n<li>Employee Assistance Programme</li>\n<li>Opportunity to travel to new locations to meet colleagues from your team and others</li>\n<li>Priority Pass for travel and travel upgrades for long haul company events</li>\n</ul>\n<p><strong>About Canonical</strong></p>\n<p>Canonical is a pioneering tech firm that is at the forefront of the global move to open source. As the company that publishes Ubuntu, one of the most important open source projects and the platform for AI, IoT and the cloud, we are changing the world on a daily basis. We recruit on a global basis and set a very high standard for people joining the company. We expect excellence - in order to succeed, we need to be the best at what we do.</p>\n<p>Canonical has been a remote-first company since its inception in 2004.​ Work at Canonical is a step into the future, and will challenge you to think differently, work smarter, learn new skills, and raise your game. Canonical provides a unique window into the world of 21st-century digital business.</p>\n<p><strong>Canonical is an equal opportunity employer</strong></p>\n<p>We are proud to foster a workplace free from discrimination. Diversity of experience, perspectives, and background create a better work environment and better products. <a href=\"https://canonical.com/careers/diversity/identity\">Whatever your identity, we will give your application fair consideration.</a></p>\n\n<p>#LI-Remote</p>\n<p>#stack</p>\n\n<p>Requisition ID: 522</p><p></p>\n    ","tags":"[\"engineering\",\"aws\"]","pubDate":"2025-02-05T09:13:05.454Z","link":"https://canonical.com/careers/6600932","slug":"junior-cloud-field-engineer-worldwide-canonical-2820"},{"id":1764301283,"title":"Backend Software Engineer Cashalo/Empower(Remote)","company":"Empower","image":"https://lever-client-logos.s3.us-west-2.amazonaws.com/2e1a369c-b58f-41ac-8d86-4b0a77695e68-1687915522032.png","description":"<p style=\"min-height:1.5em\"><strong>EMPOWER OVERVIEW</strong></p><p style=\"min-height:1.5em\"><a target=\"_blank\" rel=\"noopener noreferrer nofollow\" href=\"http://empower.me/\">Empower</a> is shaking up an outdated financial system by providing real opportunity for our customers: the opportunity to get the cash they need, to access fair credit, and to change their financial story. Today, we’re helping millions of people find financial security through machine learning models that evaluate creditworthiness using a more inclusive lens and mobile-first products: Cash Advance, Thrive line of credit, and Petal credit cards. Tomorrow? Creating even more financial paths for our customers (and their wallets) to succeed.</p><p style=\"min-height:1.5em\">This year, Empower ranked #65 on Inc. 5000’s Fastest-Growing Private Companies list — our third year in a row cracking the top 100 — and was named by Forbes as one of the 25 Next Billion-Dollar Startups for 2024. Empower was also featured by Forbes on America’s Best Startup Employers list in 2023, and our Thrive line of credit product was named by Fast Company as one of 2022’s Next Big Things in Tech.</p><p style=\"min-height:1.5em\">Empower is backed by Sequoia Capital, Blisce, and Icon Ventures. Ready to grow your impact and accelerate your career? Take a look at our open roles — we can’t wait to meet you.</p><p style=\"min-height:1.5em\"></p><p style=\"min-height:1.5em\"><strong>THE EMPOWER WAY</strong></p><p style=\"min-height:1.5em\"><strong>Great Expectations</strong>: We come up with bold, audacious goals for ourselves and go all out for impact</p><p style=\"min-height:1.5em\"><strong>Owner Mindset</strong>: We give every employee latitude to act independently, make smart choices, and move the business forward</p><p style=\"min-height:1.5em\"><strong>Spirited Debate</strong>: We love skeptics and seek counter opinions to challenge our personal assumptions and expand our view</p><p style=\"min-height:1.5em\"><strong>Customer Obsession:</strong> We listen to understand, empathize, and create a memorable, rewarding experience for our community</p><p style=\"min-height:1.5em\"><strong>Inclusive Collaboration</strong>: We believe diverse teams make the best decisions, and we strive to give diverse voices a seat at the table</p><p style=\"min-height:1.5em\"><strong>No Jerks Allowed</strong>: We value our relationships and take the time to build trust and connection and communicate respectfully</p><p style=\"min-height:1.5em\"></p><p style=\"min-height:1.5em\"><strong>WHAT EMPOWER OFFERS</strong></p><p style=\"min-height:1.5em\">Competitive salary</p><p style=\"min-height:1.5em\">Generous equity package</p><p style=\"min-height:1.5em\">Full healthcare benefits</p><p style=\"min-height:1.5em\">Technology expense reimbursement</p><p style=\"min-height:1.5em\">Virtual first environment</p><p style=\"min-height:1.5em\"><br /><strong>JOB DESCRIPTION</strong></p><p style=\"min-height:1.5em\">As a Backend Server Software Engineer, you’ll work on the engine that powers the Empower apps and business. You’ll engage with a collaborative, high powered team to develop solutions and lead product engineering on projects with a reach of millions. The solutions you’ll build will be robust, secure and easy to understand both for our users and your engineering peers. </p><p style=\"min-height:1.5em\"></p><p style=\"min-height:1.5em\">You’ll take end to end ownership of new features and product lines shaping work in early stages, building, deploying and running post deployment analysis to ensure we’re hitting our goals.<br /></p><p style=\"min-height:1.5em\">Travel for company offsites is expected at a minimum 2 times a year.</p><p style=\"min-height:1.5em\"></p><p style=\"min-height:1.5em\"><strong>Key Responsibilities</strong></p><ul style=\"min-height:1.5em\"><li><p style=\"min-height:1.5em\">Designing, building, and deploying server application code that interfaces with 3rd party clients and Empower</p></li><li><p style=\"min-height:1.5em\">Implementing secure coding standards in accordance with the Empower Secure Development Policy</p></li><li><p style=\"min-height:1.5em\">Perform on-going security testing and code review to improve software security</p></li><li><p style=\"min-height:1.5em\">Monitoring the performance of the Empower server application and applying corrective action through bug fixing and improved solutions</p></li><li><p style=\"min-height:1.5em\">Minimising defects and improving reliability through: Development of automated tests, manual test validation, development of fit for purpose architecture and code, contributing to PRs</p></li><li><p style=\"min-height:1.5em\">Developing and maintaining the server app build and deployment pipelineCollaborating cross-functionally to define, design and ship new features that create customer and business value</p></li><li><p style=\"min-height:1.5em\">Working with business and operations stakeholders for the definition and development of business requirements</p></li><li><p style=\"min-height:1.5em\">Contributing to server/client contract API definition</p></li><li><p style=\"min-height:1.5em\">Architecting solutions that interface into 3rd parties and the Empower mobile client</p></li><li><p style=\"min-height:1.5em\">Maximising effective development and identifying new technology opportunities by: Keeping across .NET development announcements, being across community best practice, discovering and evaluating new technologies</p></li><li><p style=\"min-height:1.5em\">Participating in the server ops on call schedule</p></li></ul><p style=\"min-height:1.5em\"><strong>Candidate Qualifications</strong></p><ul style=\"min-height:1.5em\"><li><p style=\"min-height:1.5em\">Bachelor degree or greater within Computer Science, Software Engineering or a related subject</p></li><li><p style=\"min-height:1.5em\">3+ years developing web APIs within .NET (C#)</p></li><li><p style=\"min-height:1.5em\">Working experience with ORMs such as Entity Framework</p></li><li><p style=\"min-height:1.5em\">Working experience constructing and optimising RDMS queries</p></li><li><p style=\"min-height:1.5em\">Working experience within the asynchronous programming model</p></li></ul><p style=\"min-height:1.5em\"><br /></p><p style=\"min-height:1.5em\">At Empower, we hire for people that push themselves to understand others and seek out ways to challenge their personal assumptions. Our hope is that by fostering such an environment, we strengthen our business and relationships by putting people first. We are committed to building a diverse, inclusive, and equitable workspace where everyone (regardless of age, education, ethnicity, gender, sexual orientation, or any personal characteristics) feels like they belong. Even if your experience doesn’t exactly match up to our job description, you should feel empowered to apply regardless!</p>","tags":"[\"engineering\"]","pubDate":"2025-02-05T04:17:02.799Z","link":"https://jobs.ashbyhq.com/empower%20finance/9fc36c03-a17c-4e60-bdb0-839aeda06140","slug":"backend-software-engineer-cashalo-empower-remote-empower-2279"},{"id":1690065561,"title":"Product Owner - Insurance (Fully Remote)","company":"CoverGo","image":"https://pbs.twimg.com/profile_images/1382655628523364355/MWPIbbID_400x400.jpg","description":"<h3><strong>Top 3 Reasons To Join Us</strong></h3><ul> <li>Competitive Salary</li> <li>International Environment</li> <li>Working on the latest tech for the Insurtech Market Leader</li> </ul><h3><strong>About Us</strong></h3><p>At CoverGo, our mission is to empower all insurance companies to make insurance 100% digital and accessible to everyone.</p><ul> <li>We are a leading global no-code insurance platform for health, life, and P&amp;C</li> <li>We’re the winner of the Insurtech of the Year in all of Asia and other awards globally</li> <li>We work with insurance enterprise clients such as AXA, Bupa, MSIG, Dai-ichi, Bank of China Group Insurance, and many more</li> <li>We're an international, diverse team of over 120 people with 30 nationalities and team members working remotely from all over the world</li> <li>We are fully funded and backed by reputable VC funds and strategic institutional investors</li> <li>We have a global presence in Asia, EMEA and the Americas</li> <li>We’ve grown our annualized revenue by over 30x since January 2021</li> <li>We’re constantly working towards making CoverGo a workplace that you love coming to. We deeply believe that bringing together a diversity of thoughts, expressions, and perspectives is key to building the best culture for equally diverse communities all over the world</li> </ul><p><strong>About the Role:&nbsp;</strong></p><p>As a Product Owner for our core health insurance system, you will play a pivotal role in shaping the evolution of our policy servicing module. Acting as the bridge between stakeholders and development teams, you will refine requirements, define product features, and drive the delivery of high-quality, impactful solutions that address the unique challenges of the health insurance industry. With a strong focus on user needs, collaboration, and accountability, you will help us build products that meet market demands while ensuring compliance with regulatory standards. This role requires a proactive approach, balancing technical depth, strategic thinking, and effective communication in a distributed working environment.</p><h3>What You Will Do:</h3><ol> <li>Backlog &amp; Feature Management:</li> <ol> <li>Define and prioritize the product backlog to reflect business value, market trends, and customer requirements.</li> <li>Collaborate closely with stakeholders to gather detailed requirements and ensure alignment on priorities.</li> <li>Translate high-level objectives into detailed, actionable user stories with clear acceptance criteria.</li> </ol> <li>Collaboration &amp; Team Engagement:</li> <ol> <li>Serve as the key point of contact between local and remote development teams, ensuring clear communication and smooth execution of deliverables.</li> <li>Work alongside cross-functional teams (e.g., engineering, QA, design) to refine features and deliver exceptional user experiences.</li> </ol> <li>Domain Expertise:</li> <ol> <li>Leverage your knowledge of health insurance and policy servicing to guide product development and ensure relevance to market needs.</li> <li>Stay informed about health insurance regulations and compliance requirements to ensure all deliverables meet legal standards.</li> </ol> <li>Agile Leadership:</li> <ol> <li>Actively participate in Agile ceremonies such as sprint planning, reviews, and retrospectives.</li> <li>Provide clear guidance to the development team, proactively addressing roadblocks and ensuring focus on priorities.</li> </ol> <li>Data-Driven Decision Making:</li> <ol> <li>Define and track KPIs to measure product success and identify opportunities for improvement.</li> <li>Conduct regular market research and competitor analysis to inform product innovation.</li> </ol> <li>Stakeholder Engagement:</li> <ol> <li>Build strong relationships with internal and external stakeholders, managing expectations and providing regular updates on progress.</li> <li>Act as the voice of the customer, championing their needs throughout the product lifecycle.</li> </ol> <li>Strategic Roadmap Ownership:</li> <ol> <li>Drive the product roadmap for the policy servicing module, balancing immediate deliverables with long-term strategic goals.</li> <li>Align product goals with business objectives and communicate them effectively across the organization.</li> </ol> </ol><h3>What We Need:</h3><ul> <li>Experience &amp; Knowledge:</li> <ul> <li>Bachelor’s degree in Computer Science, Business, or a related field (advanced degree preferred).</li> <li>Minimum 5 years of experience as a Product Owner, with at least 3 years focused on insurtech or health insurance systems.</li> <li>Demonstrated success managing end-to-end product development in complex, multi-stakeholder environments.</li> <li>Strong understanding of health insurance products, policy servicing, and regulatory requirements.</li> </ul> <li>Skills &amp; Competencies:</li> <ul> <li>Exceptional communication and interpersonal skills, with the ability to work effectively with distributed teams.</li> <li>Proven expertise in Agile methodologies, backlog management, and using tools like Jira, Confluence, or Trello.</li> <li>Analytical mindset with a track record of making data-driven decisions to optimize product performance.</li> <li>Knowledge of UX/UI principles and experience collaborating with design teams to enhance user experiences.</li> <li>Familiarity with tools and practices for remote collaboration (e.g., Slack, Miro, Figma).</li> </ul> <li>Mindset &amp; Leadership:</li> <ul> <li>Self-starter with a strong sense of ownership and accountability.</li> <li>Comfortable working in a distributed team environment and managing competing priorities.</li> <li>Passionate about driving innovation in the health insurance industry and solving complex challenges.</li> </ul> </ul><h3><strong>Why You'll Love Working Here</strong></h3><ul> <li>Flexible Leave</li> <li>International Environment</li> <li>Competitive renumeration package</li> <li>Performance Bonus</li> <li>Stock Options after 6 months </li> <li>Company activities and events</li> <li>Learning and development plan</li> </ul><p><strong>CoverGo Company </strong><a href=\"https://www.youtube.com/watch?v=YI0ezLxvFvA\" rel=\"nofollow noreferrer noopener\" class=\"external\"><strong>Video</strong></a></p><p>By submitting your application, you confirm that you have read, understood, and accepted the content of CoverGo’s <a href=\"https://apply.workable.com/covergo/gdpr_policy?lng=en\" target=\"_blank\" rel=\"nofollow noreferrer noopener\" class=\"external\">Privacy Notice</a> and you consent to the processing of your data as part of this application.</p><p><a href=\"https://www.youtube.com/watch?v=YI0ezLxvFvA\" rel=\"nofollow noreferrer noopener\" class=\"external\"></a></p><h3>Requirements: </h3><h3>Benefits: </h3>","tags":"[\"management\",\"engineering\",\"legal\"]","pubDate":"2025-02-05T00:00:00.000Z","link":"https://apply.workable.com/covergo/j/A5648FF559","slug":"product-owner-insurance-fully-remote-covergo-6843"},{"id":1201509176,"title":"Product Manager - Thrive","company":"Empower","image":"https://lever-client-logos.s3.us-west-2.amazonaws.com/2e1a369c-b58f-41ac-8d86-4b0a77695e68-1687915522032.png","description":"<p style=\"min-height:1.5em\"><strong>EMPOWER OVERVIEW</strong></p><p style=\"min-height:1.5em\"><a target=\"_blank\" rel=\"noopener noreferrer nofollow\" href=\"http://empower.me/\">Empower</a> is shaking up an outdated financial system by providing real opportunity for our customers: the opportunity to get the cash they need, to access fair credit, and to change their financial story. Today, we’re helping millions of people find financial security through machine learning models that evaluate creditworthiness using a more inclusive lens and mobile-first products: Cash Advance, Thrive line of credit, and Petal credit cards. Tomorrow? Creating even more financial paths for our customers (and their wallets) to succeed.</p><p style=\"min-height:1.5em\">This year, Empower ranked #65 on Inc. 5000’s Fastest-Growing Private Companies list — our third year in a row cracking the top 100 — and was named by Forbes as one of the 25 Next Billion-Dollar Startups for 2024. Empower was also featured by Forbes on America’s Best Startup Employers list in 2023, and our Thrive line of credit product was named by Fast Company as one of 2022’s Next Big Things in Tech.</p><p style=\"min-height:1.5em\">Empower is backed by Sequoia Capital, Blisce, and Icon Ventures. Ready to grow your impact and accelerate your career? Take a look at our open roles — we can’t wait to meet you.</p><p style=\"min-height:1.5em\"></p><p style=\"min-height:1.5em\"><strong>THE EMPOWER WAY</strong></p><p style=\"min-height:1.5em\"><strong>Great Expectations</strong>: We come up with bold, audacious goals for ourselves and go all out for impact</p><p style=\"min-height:1.5em\"><strong>Owner Mindset</strong>: We give every employee latitude to act independently, make smart choices, and move the business forward</p><p style=\"min-height:1.5em\"><strong>Spirited Debate</strong>: We love skeptics and seek counter opinions to challenge our personal assumptions and expand our view</p><p style=\"min-height:1.5em\"><strong>Customer Obsession:</strong> We listen to understand, empathize, and create a memorable, rewarding experience for our community</p><p style=\"min-height:1.5em\"><strong>Inclusive Collaboration</strong>: We believe diverse teams make the best decisions, and we strive to give diverse voices a seat at the table</p><p style=\"min-height:1.5em\"><strong>No Jerks Allowed</strong>: We value our relationships and take the time to build trust and connection and communicate respectfully</p><p style=\"min-height:1.5em\"></p><p style=\"min-height:1.5em\"><strong>WHAT EMPOWER OFFERS</strong></p><p style=\"min-height:1.5em\">Competitive salary</p><p style=\"min-height:1.5em\">Generous equity package</p><p style=\"min-height:1.5em\">Full healthcare benefits</p><p style=\"min-height:1.5em\">Technology expense reimbursement</p><p style=\"min-height:1.5em\">Virtual first environment</p><p style=\"min-height:1.5em\"></p><p style=\"min-height:1.5em\"><strong>JOB DESCRIPTION</strong></p><p style=\"min-height:1.5em\">We’re looking for extraordinary people to help lead product development as Empower continues to scale. Our product leaders are customer-centric, collaborate intensely with other key disciplines, and make decisions with an eye towards Empower’s business. Successful product managers are ambitious and resourceful -- willing to do whatever it takes to deliver value to our customers.</p><p style=\"min-height:1.5em\">More specifically, members of the product team drive the strategy, tactics, and delivery timelines for all Empower features and products. They identify opportunities and develop perspectives on the most impactful things we should be building for our customers, and then they go do the work required to build those experiences by getting cross-functional support, designing specs, overseeing development and measuring outcomes. Empower product managers are experts in cross-functional partnership, constantly engaging colleagues in Operations, Marketing, Finance, Compliance, Support, and other Product areas in order to deliver on their goals and maximize impact. If you’re looking for a role where you can have massive impact and a wide scope, you’ll find this role compelling, challenging, and rewarding.</p><p style=\"min-height:1.5em\"></p><p style=\"min-height:1.5em\">Travel for company offsites is expected at a minimum 2 times a year.</p><p style=\"min-height:1.5em\"></p><p style=\"min-height:1.5em\"></p><p style=\"min-height:1.5em\"><strong>Qualifications</strong></p><ul style=\"min-height:1.5em\"><li><p style=\"min-height:1.5em\">We are looking for product managers and product leaders with varying levels of experience (minimum of 3+ years work experience in product management or management consulting/investment banking)</p></li><li><p style=\"min-height:1.5em\">Strong analytical abilities and are comfortable defining and measuring goals consistently</p></li><li><p style=\"min-height:1.5em\">Strong customer empathy and experience shaping product direction and execution based on customer needs</p></li><li><p style=\"min-height:1.5em\">A get-it-done mindset; you’re resourceful and happy to be hands on and in the weeds</p></li><li><p style=\"min-height:1.5em\">A interest in addressing complicated and impactful product &amp; business problems</p></li><li><p style=\"min-height:1.5em\">Experience delivering complex, cross-functional product initiatives </p></li><li><p style=\"min-height:1.5em\">Strong strategic thinking, problem solving, and logical structuring abilities</p></li><li><p style=\"min-height:1.5em\">Comfort with ambiguity; the ability to independently lay out and test clear hypotheses, and solve problems without well-defined direction</p></li><li><p style=\"min-height:1.5em\">Excellent verbal and written communication skills</p></li></ul><p style=\"min-height:1.5em\"></p><p style=\"min-height:1.5em\"></p><p style=\"min-height:1.5em\">At Empower, we hire for people that push themselves to understand others and seek out ways to challenge their personal assumptions. Our hope is that by fostering such an environment, we strengthen our business and relationships by putting people first. We are committed to building a diverse, inclusive, and equitable workspace where everyone (regardless of age, education, ethnicity, gender, sexual orientation, or any personal characteristics) feels like they belong. Even if your experience doesn’t exactly match up to our job description, you should feel empowered to apply regardless! </p><p style=\"min-height:1.5em\"></p><p style=\"min-height:1.5em\">At Empower, we hire for people that push themselves to understand others and seek out ways to challenge their personal assumptions. Our hope is that by fostering such an environment, we strengthen our business and relationships by putting people first. We are committed to building a diverse, inclusive, and equitable workspace where everyone (regardless of age, education, ethnicity, gender, sexual orientation, or any personal characteristics) feels like they belong. Even if your experience doesn’t exactly match up to our job description, you should feel empowered to apply regardless!</p>","tags":"[\"finance\",\"management\"]","pubDate":"2025-02-04T22:48:37.753Z","link":"https://jobs.ashbyhq.com/empower%20finance/61de6e16-0d2d-4f4a-86a3-03a1df99787c","slug":"product-manager-thrive-empower-2138"},{"id":3967290917,"title":"Senior/Lead Security Engineer","company":"BioRender","image":"https://avatars.githubusercontent.com/u/46490948?s=200&v=4","description":"<p style=\"min-height:1.5em\">At BioRender, we’re on a mission to accelerate the world’s ability to learn, discover, and communicate science — transforming how knowledge is shared and making science open, collaborative, and easily understandable by all. </p><p style=\"min-height:1.5em\">We’re shaping the future of science communication and are looking for talented individuals to help bring this vision to life! 🚀</p><p style=\"min-height:1.5em\">As a Senior/Lead Security Engineer, you have a strong background in ethical hacking. You'll be responsible for conducting advanced penetration tests, vulnerability assessments, bug bounty program operation and work closely with engineering teams on implementing security best practices in Biorender’s flagship application. You'll leverage your deep understanding of the latest threats and attack vectors, along with your ability to develop and implement effective security measures.</p><p style=\"min-height:1.5em\"></p><p style=\"min-height:1.5em\"><strong>What you'll be doing </strong></p><ul style=\"min-height:1.5em\"><li><p style=\"min-height:1.5em\"><strong>Application Security:</strong> Create detailed design documents and guidelines for Engineering Teams. Ensure security requirements are detailed and integrated into all stages of the SDLC.</p></li><li><p style=\"min-height:1.5em\"><strong>Penetration Testing &amp; Threat mitigation:</strong> Execute comprehensive penetration tests on web applications, networks, and systems to identify security vulnerabilities. Conduct treat modeling, threat hunting, and log analysis across multiple environments</p></li><li><p style=\"min-height:1.5em\"><strong>Cloud Security &amp; WAF:</strong> Implement and manage security controls in cloud environments (AWS and Cloudflare) to ensure secure cloud architecture and data protection.</p></li><li><p style=\"min-height:1.5em\"><strong>Collaboration &amp; Stakeholder Engagement:</strong> Work closely with IT, development, and business teams to integrate security best practices across all technology initiatives. Advocate for security within the organization.</p></li><li><p style=\"min-height:1.5em\"><strong>Define Best Practices:</strong> Collaborate with security and engineering teams and stakeholders to enhance security posture and implement mitigation strategies. Assist in developing security policies, procedures, and guidelines to strengthen the organization's security framework. </p></li><li><p style=\"min-height:1.5em\"><strong>Mentorship &amp; Thought Leadership</strong>: Stay up-to-date with the latest security trends, vulnerabilities, and attack techniques. Mentor and train other engineers, sharing knowledge and best practices.</p></li><li><p style=\"min-height:1.5em\">Experience operating a bug bounty program. Participate in security research projects to discover new vulnerabilities and improve existing security tools.</p></li><li><p style=\"min-height:1.5em\"><strong>Vulnerability Management:</strong> Conduct security assessments, penetration testing, and vulnerability scans to identify and remediate security gaps.</p></li><li><p style=\"min-height:1.5em\"><strong>Security Architecture &amp; Implementation:</strong> Design and implement robust security solutions and security architecture to protect against cyber threats, ensuring the integrity and availability of systems and data.</p></li><li><p style=\"min-height:1.5em\"><strong>Security Tooling &amp; Automation:</strong> Evaluate, deploy, and manage security tools such as SIEM, EDR, IDS/IPS, and endpoint protection solutions.</p></li><li><p style=\"min-height:1.5em\"><strong>Incident Response &amp; Monitoring:</strong>  comfort with incident response frameworks.Proficient in leveraging security logs and/or a SIEM to detect, investigate, and respond to security events.</p></li></ul><p style=\"min-height:1.5em\"></p><p style=\"min-height:1.5em\"><strong>What you bring to the table </strong></p><ul style=\"min-height:1.5em\"><li><p style=\"min-height:1.5em\">Bachelor's degree in Computer Science, Information Security, or a related field (or equivalent work experience).</p></li><li><p style=\"min-height:1.5em\">Minimum of 5 years of experience in security, ethical hacking, or penetration testing.</p></li><li><p style=\"min-height:1.5em\">Strong knowledge of network protocols, operating systems, and security architectures</p></li><li><p style=\"min-height:1.5em\">Proficiency in using penetration testing tools such as Burp Suite, Kali, nmap, Wireshark, and Metasploit.</p></li><li><p style=\"min-height:1.5em\">Experience with scripting and programming languages (e.g., Python, Bash, PowerShell, Go, Javascript) to develop custom tools and exploits.</p></li><li><p style=\"min-height:1.5em\">Proficiency with AWS, CDN, WAF, modern web application and data pipelines (ie. Node.js, python).</p></li><li><p style=\"min-height:1.5em\">Strong understanding of network security, cryptography, and secure coding practices.</p></li><li><p style=\"min-height:1.5em\">Comprehensive understanding of OWASP Top Ten (WebApp, LLM, CI/CD) and common weaknesses and vulnerabilities, NIST.</p></li><li><p style=\"min-height:1.5em\">Relevant certifications such as AWS Certifications (Solutions Architect, Security Speciality, etc.) GWAPT, OSWE, OSCP, OSCE, OSEP, OSEE, CCSAS, CCT INF or relevant SANS courses (<a target=\"_blank\" rel=\"noopener noreferrer nofollow\" href=\"https://www.sans.org/cyber-security-courses/cloud-security-devsecops-automation/\"><u>SEC540</u></a>) are highly desirable.</p></li><li><p style=\"min-height:1.5em\">Excellent problem-solving skills and the ability to think like an attacker (ie. active defender mindset).</p></li><li><p style=\"min-height:1.5em\">Strong written and verbal communication skills, with the ability to develop documentation and explain technical details in a concise manner.</p></li><li><p style=\"min-height:1.5em\">Proven ability to work independently and as part of a team in a fast-paced, dynamic environment.</p></li></ul><p style=\"min-height:1.5em\"><strong>Preferred Qualifications:</strong></p><ul style=\"min-height:1.5em\"><li><p style=\"min-height:1.5em\">Experience implementing or assessing security controls.</p></li><li><p style=\"min-height:1.5em\">Experience with tools used for web application, network security and wireless testing.</p></li><li><p style=\"min-height:1.5em\">Knowledge of secure coding practices and software development life cycle (SDLC).</p></li><li><p style=\"min-height:1.5em\">Familiarity with threat modeling and risk assessment methodologies. </p></li><li><p style=\"min-height:1.5em\">Experience with runtime security, EDR, and forensic analysis tools on various operating systems.</p></li><li><p style=\"min-height:1.5em\">Experience in conducting social engineering assessments and physical security testing.</p></li><li><p style=\"min-height:1.5em\">Experience leading and operating a bug bounty program</p></li><li><p style=\"min-height:1.5em\">Participation in Capture the Flag tournaments and other national/global hacking competitions </p></li></ul><p style=\"min-height:1.5em\"></p><p style=\"min-height:1.5em\"><strong>Why join us?</strong></p><ul style=\"min-height:1.5em\"><li><p style=\"min-height:1.5em\"><strong>We are mission-driven</strong>: we work collaboratively towards our shared vision of improving scientific communication and accelerating scientific discovery. BioRender figures have appeared in more than 54,000 publications! </p></li><li><p style=\"min-height:1.5em\"><strong>BioRender is loved by millions!</strong> We have a world-class NPS and a community of loyal fans and users in 200+ countries!</p></li><li><p style=\"min-height:1.5em\"><strong>Our company is backed by top investors</strong> and accelerators like Y Combinator, and we are on a growth trajectory comparable to many top-performing SaaS companies </p></li><li><p style=\"min-height:1.5em\"><strong>We’re remote-first</strong> with team members across Canada and the U.S., offering you the flexibility to work from anywhere. </p></li></ul><p style=\"min-height:1.5em\"></p><p style=\"min-height:1.5em\">BioRender is an Equal Opportunity Employer. We celebrate diversity and are committed to creating an inclusive environment for all employees. All qualified applicants will receive consideration for employment without regard to race, color, religion, sex, sexual orientation, gender identity, national origin, disability, or veteran status.</p>","tags":"[\"javascript\",\"management\",\"engineering\",\"aws\"]","pubDate":"2025-02-04T22:22:27.375Z","link":"https://jobs.ashbyhq.com/biorender/9253dd07-2136-4c3c-a8e9-f0f42207111d","slug":"senior-lead-security-engineer-biorender-3659"},{"id":8343676385,"title":"Head of Sales - B2C (FR & EN Fluent)","company":"Paradox","image":"https://media.licdn.com/dms/image/v2/D4D0BAQEmydwDkZ6NPw/company-logo_200_200/company-logo_200_200/0/1711612675702/weareparadox_en_logo?e=1743033600&v=beta&t=w-Hh_tfeKg8KOPSA6AHYXlcEcUm84UVSnDoP8KaF7L0","description":"<p style=\"min-height:1.5em\"><strong>Wait a minute. </strong></p><p style=\"min-height:1.5em\"><em>Are you inspired in being a key player in building a massive EdTech company that will empower millions of people?</em></p><p style=\"min-height:1.5em\"><em>Do you have international ambition? </em></p><p style=\"min-height:1.5em\"><em>Do you love scaling companies &amp; finding new revenue streams?</em></p><p style=\"min-height:1.5em\"><em>Do you desire to put that thrive of excellence at the service of selling meaningful products that really change lives?</em></p><p style=\"min-height:1.5em\"></p><p style=\"min-height:1.5em\"><strong>Deep inside you are looking for a new adventure with… </strong></p><ul style=\"min-height:1.5em\"><li><p style=\"min-height:1.5em\"><strong>🗽 Freedom: feeling free to work remotely or hybrid and being trusted to deliver</strong></p></li><li><p style=\"min-height:1.5em\">🔥 <strong>Ambition:</strong> growing up surrounded by smart colleagues driven to create an iconic brand like Nike big </p></li><li><p style=\"min-height:1.5em\">😍 <strong>Impact:</strong> contributing to transform people lives at scale and feel your own impact in the company</p><p style=\"min-height:1.5em\"></p></li></ul><p style=\"min-height:1.5em\">Do you believe you are more than just a driven Head of Sales but you also:</p><ul style=\"min-height:1.5em\"><li><p style=\"min-height:1.5em\">Are a <strong>strong leader who can attract and inspire great talents</strong></p></li><li><p style=\"min-height:1.5em\">Have an<strong> analytical &amp; data driven mindset</strong></p></li><li><p style=\"min-height:1.5em\">Are really strong in terms of <strong>influence &amp; strategy</strong></p><p style=\"min-height:1.5em\"></p></li></ul><p style=\"min-height:1.5em\">You also happen to want to use your experience as an awesome B2C Head of Sales  to contribute to impacting the lives of thousands of people?</p><p style=\"min-height:1.5em\">Then, you have found the next adventure that will fulfill you!</p><p style=\"min-height:1.5em\"><strong>This is a full-time position, carried out from our beautiful offices in Dubaï, Lisbon or from the comfort of your couch! French and English fluency is required.</strong></p><p style=\"min-height:1.5em\"></p><h2>YOUR MISSION 🚀 </h2><p style=\"min-height:1.5em\">-------------------------------</p><p style=\"min-height:1.5em\"><strong>🎯 Your main goal will be to create a revenue generating machine and take us from €10M to €50M revenue</strong></p><p style=\"min-height:1.5em\">Our sources of inspiration are Apple, Nike, Disney for their obsession of excelling and having a worldwide impact. You will be playing a pivotal role in making Paradox play at that level and becoming an iconic brand.</p><p style=\"min-height:1.5em\"><u>To do so, here are your 5 main responsibilities : </u></p><p style=\"min-height:1.5em\"></p><h2>1I Contribute to Business Forecasting and define and execute a winning Sales Strategy</h2><ul style=\"min-height:1.5em\"><li><p style=\"min-height:1.5em\">Collaborate with cross-functional teams (Marketing, Product, and Operations) to align sales strategies with overall business goals and market opportunities.</p></li><li><p style=\"min-height:1.5em\">Analyze market trends, customer insights, and competitive landscape to identify key growth areas and refine go-to-market approaches.</p></li><li><p style=\"min-height:1.5em\">Develop, manage, and optimize sales processes and funnels, ensuring scalability and efficiency in customer acquisition and retention efforts.</p></li><li><p style=\"min-height:1.5em\">Set and monitor OKR to track the success of sales initiatives, adjusting tactics to meet revenue and growth targets. </p></li><li><p style=\"min-height:1.5em\">Leverage data-driven insights to forecast sales outcomes accurately, ensuring alignment with financial and operational planning.</p></li></ul><p style=\"min-height:1.5em\"></p><h2>2 I Attract, find and hire great talents &amp; Lead your Sales Dream team to Excellence &amp; Performance</h2><ul style=\"min-height:1.5em\"><li><p style=\"min-height:1.5em\">Build a recruiting agency within Paradox and source talents in your own network.</p></li><li><p style=\"min-height:1.5em\">Be proactive to create a machine to attract talents.</p></li><li><p style=\"min-height:1.5em\">Engineer the “Sales Hiring Formula”: Uncover the characteristics of successful sales and marketers for our product portfolio.</p></li><li><p style=\"min-height:1.5em\">Develop sales targets, objectives &amp; incentives for each team member.</p></li><li><p style=\"min-height:1.5em\">Accountable for achieving and exceeding the business’s sales targets, generating targeted revenue, and controlling sales expenses.</p></li><li><p style=\"min-height:1.5em\">Define the right Commission structure for the team.</p></li><li><p style=\"min-height:1.5em\">Ensure the CRM is properly filled with the right amount of information.</p></li><li><p style=\"min-height:1.5em\">Create a culture of Performance &amp; Feedback within the team while reinforcing our culture and values.</p><p style=\"min-height:1.5em\"></p></li></ul><h2>3I Drive Sales excellence by nailing personae, evolving the Sales pitch relentlessly and contributing to Sales Enablement material</h2><ul style=\"min-height:1.5em\"><li><p style=\"min-height:1.5em\">Develop a deep understanding of target customer personas through market research, user data, and feedback, ensuring the sales approach resonates with diverse audience segments.</p></li><li><p style=\"min-height:1.5em\">Continuously refine and optimize the sales pitch, tailoring it to different customer personas to maximize engagement, conversion rates, and overall sales effectiveness.</p></li><li><p style=\"min-height:1.5em\">Collaborate with Product, Marketing, and Customer Success teams to ensure that the sales pitch and messaging align with product offerings, customer pain points, and market positioning.</p></li><li><p style=\"min-height:1.5em\">Create and maintain comprehensive Sales Enablement materials (e.g., pitch decks, case studies, product demos, objection-handling guides) to support the sales team in effectively communicating value propositions.</p></li></ul><p style=\"min-height:1.5em\"></p><h2>4I Foster feedback loops with Product and Marketing to develop game changing offers and initiatives</h2><ul style=\"min-height:1.5em\"><li><p style=\"min-height:1.5em\">Establish regular communication channels between Sales, Product, and Marketing teams to share insights on customer needs, preferences, and pain points.</p></li><li><p style=\"min-height:1.5em\">Collaborate with the Product team to provide actionable feedback on product features, usability, and customer demand, influencing product roadmap decisions.</p></li><li><p style=\"min-height:1.5em\">Work closely with Marketing to align messaging, campaigns, and promotions based on real-time sales data and customer interactions, ensuring maximum impact in go-to-market strategies.</p></li><li><p style=\"min-height:1.5em\">Gather and analyze feedback from the sales team on market trends and competitor offerings, delivering insights that help shape compelling, differentiated offers.</p></li><li><p style=\"min-height:1.5em\">Participate in the creation of innovative offers and pricing strategies, combining input from Product and Marketing to attract new customers and improve retention rates.</p></li><li><p style=\"min-height:1.5em\">Facilitate regular brainstorming and feedback sessions with cross-functional teams, promoting agility and responsiveness to market shifts and customer feedback.</p></li></ul><p style=\"min-height:1.5em\"></p><h2>5I Being accountable for Sales Ops &amp; Rev Ops, streamline processes, ensuring alignment across sales, marketing, and finance functions.</h2><ul style=\"min-height:1.5em\"><li><p style=\"min-height:1.5em\">Ensure accurate sales data management and reporting, leveraging CRM systems and analytics tools to track performance metrics, revenue forecasts, and pipeline health.</p></li><li><p style=\"min-height:1.5em\">Optimize sales processes and workflows to improve efficiency, reduce friction in the buyer journey, and ensure scalability as the business grows.</p></li><li><p style=\"min-height:1.5em\">Align sales strategies with overall revenue goals, ensuring consistency in forecasting, budgeting, and long-term planning.</p></li><li><p style=\"min-height:1.5em\">Leverage RevOps insights to identify bottlenecks and opportunities in the revenue lifecycle, implementing data-driven improvements to enhance sales performance.</p></li><li><p style=\"min-height:1.5em\">Implement and manage incentive programs, quotas, and compensation structures in collaboration with HR to drive engagement and ensure alignment with business objectives.</p></li></ul><p style=\"min-height:1.5em\"></p><h2>DO YOU RECOGNIZE YOURSELF? 😍</h2><h3>-------------------------------</h3><p style=\"min-height:1.5em\"></p><h3><strong>Must Have</strong></h3><ul style=\"min-height:1.5em\"><li><p style=\"min-height:1.5em\">You have at least <strong>5 years commercial experience in B2C </strong>with an <strong>extraordinary track record</strong>.</p></li><li><p style=\"min-height:1.5em\">You have <strong>led teams of Sales</strong> but still loved to be handson</p></li><li><p style=\"min-height:1.5em\"><strong>You are passionate about sales and influence</strong>, you love to constantly train yourself to improve your sales, influence and negotiation skills.</p></li><li><p style=\"min-height:1.5em\">You <strong>excel in sales</strong> (especially the sales of high-ticket sales), you know when to speak, when to listen and guide customers through their decision-making process. </p></li><li><p style=\"min-height:1.5em\">You <strong>master and like modern tools</strong> and are comfortable with building processes.</p></li></ul><p style=\"min-height:1.5em\"></p><h3><strong>Personality</strong></h3><ul style=\"min-height:1.5em\"><li><p style=\"min-height:1.5em\">You are <strong>charismatic</strong>, have a strong <strong>ethic</strong> and a profonde sense of <strong>humility.</strong></p></li><li><p style=\"min-height:1.5em\">You <strong>are obsessed by performance</strong>, having ambitious goals and giving everything to achieve them.</p></li><li><p style=\"min-height:1.5em\">You <strong>love people deeply</strong>: You like to be interested in others and you know how to create a link very easily.</p></li><li><p style=\"min-height:1.5em\">You are <strong>obsessed with excellence</strong>, you must always strive to do better.</p></li><li><p style=\"min-height:1.5em\">You are <strong>organized </strong>and<strong> think out of the box</strong>.</p></li></ul><h3><strong>Other Key Points : </strong></h3><ul style=\"min-height:1.5em\"><li><p style=\"min-height:1.5em\"><strong>Cool under pressure</strong></p></li><li><p style=\"min-height:1.5em\"><strong>Drive &amp; Problem Solver : you’re ambitious, you work hard because you love it, you own things and get them done. </strong></p></li><li><p style=\"min-height:1.5em\"><strong>Growth over Ego : you are eager to learn, and receive hard feedback to grow. You let others speak and seek to understand their viewpoints. You are comfortable in conflict: at ease with defending your case with facts, until we find what’s right for the vision of the company (Jeff Bezos calls that  “Disagree &amp; Commit”). </strong></p></li><li><p style=\"min-height:1.5em\"><strong>Tech and product savviness</strong></p></li><li><p style=\"min-height:1.5em\">Growth and digital marketing have no secrets for you</p></li></ul><p style=\"min-height:1.5em\"></p><h3><strong>Language</strong></h3><ul style=\"min-height:1.5em\"><li><p style=\"min-height:1.5em\"><strong>French</strong>: Native</p></li><li><p style=\"min-height:1.5em\"><strong>English</strong>: Fluent English, you can hold a conversation on specific details with English-speaking colleagues.</p></li></ul><p style=\"min-height:1.5em\"></p><p style=\"min-height:1.5em\"><em>Our chosen language for written communication is English.  Currently, 10% of the team is English-speaking, a % which will continue to grow.</em></p><p style=\"min-height:1.5em\"></p><p style=\"min-height:1.5em\"><strong>TECHNICAL : </strong></p><ul style=\"min-height:1.5em\"><li><p style=\"min-height:1.5em\"><strong>Our CRM:  </strong>Hubspot </p><p style=\"min-height:1.5em\"></p></li></ul><h2>IT MIGHT NOT BE FOR YOU 🙅‍♀️</h2><h3>-------------------------------</h3><p style=\"min-height:1.5em\">Let’s be clear, we are looking for someone who is not just Great, and for whom Paradox ambition isn’t just another cool project; but a true mission.</p><p style=\"min-height:1.5em\"></p><p style=\"min-height:1.5em\">So if those <strong>personal interests :</strong> personal development / coaching / professional growth / education / edtech / teaching / edutainment<strong> are not things you REALLY love, let’s forget it!</strong></p><p style=\"min-height:1.5em\"></p><p style=\"min-height:1.5em\">Let’s forget about iit also if,</p><ul style=\"min-height:1.5em\"><li><p style=\"min-height:1.5em\">You <strong>don’t like to be challenged</strong> and grow in your job</p></li><li><p style=\"min-height:1.5em\">You don't like <strong>receiving or giving tough feedbacks</strong></p></li><li><p style=\"min-height:1.5em\">You <strong>don’t question the status quo: </strong>the process are there for a reason, we have always done it this way</p></li><li><p style=\"min-height:1.5em\">You <strong>like to have very specific &amp; fixed tasks</strong> assigned to you. Be told what to do and how to do it.</p></li><li><p style=\"min-height:1.5em\"><strong>Your only driver is joining a full-remote company</strong>: yes, our company culture is cool, but we want people to care about our mission, products, and their job!</p></li></ul><p style=\"min-height:1.5em\"><br /><br />🤩 JOIN US IF YOU CRAVE</p><h3>-------------------------------</h3><h3><em><strong>Growth &amp; Ambition 🚀</strong></em></h3><p style=\"min-height:1.5em\"><em><strong><br /></strong></em>🏅 We hire only the best, it’s exhilarating to be <strong>surrounded by A-players who strive to perform</strong> <strong>whilst being in a good mood. You'll be working with some of the best minds. We understand that \"A\" people attract \"A\" people.</strong></p><p style=\"min-height:1.5em\">🏋️‍♀️ No more bosses, but ongoing conversations to support your professional development.</p><p style=\"min-height:1.5em\">⚡️ Being part of an ambitious company with a lot of growth opportunities</p><p style=\"min-height:1.5em\"><em><strong>Impact &amp; Meaning </strong></em><strong>🔥</strong></p><p style=\"min-height:1.5em\">🦄 <strong>Playing a crucial role in the development of a company</strong> whose content and products are enjoyed by millions of people<br /><strong>🤩 Waking up in the morning knowing you are making a difference:</strong> <em>we receive messages every day from clients who have successfully lost weight, quit smoking, reach a mile stone in their business, built better relationships, and made positive changes in their lives.<br /><br /><strong>But that’s not all, we believe that driven people deserve…</strong></em></p><p style=\"min-height:1.5em\"><em><strong>Freedom &amp; Well Being 🗽☀️</strong></em></p><p style=\"min-height:1.5em\">😎 <strong>A company culture based on autonomy &amp; accountability<br /></strong>🗽 <strong>Flexible working hours<br /></strong>🌎 <strong>A remote culture from day one with the freedom to work from wherever you want<br /></strong>🏤 <strong>Magnificent offices in Dubai and Lisbon:</strong> you’re at home worldwide<br /><strong>⌨️ Standing desks</strong> paid by the company, if you live far from our offices<br />💻 <strong>Macbook:</strong> <em>to be the most efficient in your work<br /></em>🏀 <strong>350€ per year paid by the company to take care of yourself</strong> <em>(for your gym, or dance class or whatever make you feel great)<br /></em>📚 <strong>150€ per year paid by the company to boost your knowledge</strong> (books, education): we are passionate about learning and want to support your growth)<br />🤝 <strong>1:1 coachings</strong>: a Paradox coach supporting you personally or professionally to live your best life<br />✈️ <strong>Team buildings</strong></p><p style=\"min-height:1.5em\"><em>* those benefits are only for full-time employees</em></p><p style=\"min-height:1.5em\"></p><h2>HIRING PROCESS 📃</h2><h3>-------------------------------</h3><p style=\"min-height:1.5em\"><em>That job description resonated with you?</em></p><p style=\"min-height:1.5em\"></p><h3><strong>Here is your tailor made hiring process</strong></h3><p style=\"min-height:1.5em\"><strong>📃 A 6 to 8 minutes application survey (with a short video assignment) </strong></p><p style=\"min-height:1.5em\"><strong>📃 A 15/20 minutes what’s app call </strong>with <strong>Chloé</strong>, our Talent Manager, to tell you more about the challenge and see if it fits with your experience and expectations,</p><p style=\"min-height:1.5em\">💻 <strong>A video call</strong> with <strong>Chloé</strong> to do a deep dive into your career path and your ambition,</p><p style=\"min-height:1.5em\">💻 <strong>A video call</strong> with <strong>Quentin, the Hiring Manager &amp; Timy the Culture Coach</strong> to dive deeper into your technical skills, see how we can match your desires with our needs and for you both to understand how you could fit in Paradox’s social media team.</p><p style=\"min-height:1.5em\">💻A <strong>Case Study,</strong> you will present to David our founder &amp; CEO so we can learn more about your vision and understand if we can write the success story together.</p><p style=\"min-height:1.5em\">💼 <strong>Reference check</strong> to get in-depth insights about how you work in different environments, make your onboarding easier, and give everybody on the team the insurance to be surrounded by A-Players.</p><p style=\"min-height:1.5em\"><strong>🫵🚀</strong> <strong>Welcome aboard!</strong></p><p style=\"min-height:1.5em\"></p><h3><strong>About our hiring process</strong></h3><p style=\"min-height:1.5em\">Our recruitment process is tailored to do our best to avoid that you or us realize that we’re not a perfect fit. Every step serves a purpose and will allow us to get to know you better as much as it’ll help you understand more where you’ll be stepping in.</p><p style=\"min-height:1.5em\">We also want you to have time to ask all of your questions regarding the mission, the long-term vision of your team and the company, our values, with the relevant interlocutor in front of you.</p><p style=\"min-height:1.5em\"><br /><br /><br />But maybe YOU WONDER WHAT’S OUR STORY ? 😉</p><p style=\"min-height:1.5em\">-------------------------------</p><p style=\"min-height:1.5em\">At Paradox, we are convinced that people do not want “just a job” anymore.</p><p style=\"min-height:1.5em\">We are all craving to have an impact through our professional journey. Some want to start their own venture, some want to become an intrapreneur in their current organization, some others just want their day-to-day tasks to have more meaning.</p><p style=\"min-height:1.5em\"><strong>🎯 PARADOX HAS ONE GOAL: TO EMPOWER PEOPLE AND ORGANIZATIONS TO LIVE THEIR TRUE AMBITIONS.</strong></p><p style=\"min-height:1.5em\">But where do we start?</p><p style=\"min-height:1.5em\">If you have an interest in personal development, you probably already know that:</p><ul style=\"min-height:1.5em\"><li><p style=\"min-height:1.5em\">Making things happen is a real struggle when you don’t know what truly inspires you and how to get there ;</p></li><li><p style=\"min-height:1.5em\">Available resources are either boring 😴 or full of crazy unsubstantiated theories 🤪.</p></li></ul><p style=\"min-height:1.5em\">It needs to change, and we’re here to make it happen!</p><p style=\"min-height:1.5em\"><strong>⭐️ OUR AMBITION IS TO MAKE SUCCESS THE ONLY POSSIBLE OUTCOME FOR OUR CLIENTS (WHATEVER SUCCESS MEANS FOR THEM), BY CRAFTING INNOVATIVE &amp; CAPTIVATING BREAKTHROUGH EXPERIENCES.</strong></p><p style=\"min-height:1.5em\">In other words, we want to make personal growth <strong>as entertaining as watching Netflix.</strong></p><p style=\"min-height:1.5em\">How, you might be wondering?</p><ul style=\"min-height:1.5em\"><li><p style=\"min-height:1.5em\">We travel the world and surround ourselves with <strong>top entrepreneurs</strong> <em>(Richard Branson - Founder of Virgin, Marc Simoncini - Founder of Meeting, Fred Mazzella - Founder of BlablaCar)</em>, <strong>world</strong> <strong>athletes</strong> <em>(Tony Parker - Hall of fame NBA Player, Frederick Bousquet - World record in 50m free swimming, Frank Leboeuf - WorldCup Footballer)</em>, and <strong>artists</strong> <em>(Gad Elmaleh - Comedian, Franck Dubosc, Barry Osborne - Producer of Lord of the Rings and Matrix)</em> ✊;</p></li><li><p style=\"min-height:1.5em\">We reverse engineer their <strong>strategies for achieving success</strong> and fulfillment and lean on the <strong>latest researches</strong> about neurosciences ⚙️;</p></li><li><p style=\"min-height:1.5em\">We deliver trainings &amp; educational contents around Power Skills (critical thinking, productivity, leadership, public speaking, coaching, stress management, etc.), <strong>self-growth and performance</strong>, through a balanced set of <strong>e-learning programs, events and edutainment videos</strong> 💡.</p></li></ul><p style=\"min-height:1.5em\">From one well-known<a target=\"_blank\" rel=\"noopener noreferrer nofollow\" href=\"https://www.linkedin.com/in/davidlarochefr/\"> <u>Founder</u></a> to a team of +60 people today (and counting!), this approach has paid off and enabled us to exceed 2 million followers on social networks, and to have thousands of people attending our online events and training courses.</p><p style=\"min-height:1.5em\"><strong>🔥 TOGETHER, WE ARE DRIVEN BY ONE DREAM:</strong></p><ol style=\"min-height:1.5em\"><li><p style=\"min-height:1.5em\">Helping 100 000 people achieve their dream and display their pictures on what we call the “100 000 dreams wall” ;</p></li><li><p style=\"min-height:1.5em\">Giving our clients access to constant personal growth by reinventing their learning experience ;</p></li><li><p style=\"min-height:1.5em\">Leverage AI and other technology to provide an outstanding customized experience to millions of people for them to transform their lives. </p></li></ol><p style=\"min-height:1.5em\"></p><p style=\"min-height:1.5em\"><strong>And that’s where you come in. Join the Paradox Revolution !</strong></p><p style=\"min-height:1.5em\"></p>","tags":"[\"finance\",\"management\",\"b2c\"]","pubDate":"2025-02-04T18:31:07.016Z","link":"https://jobs.ashbyhq.com/paradox/1bfb7e18-08be-4673-8ece-6daacf402950","slug":"head-of-sales-b2c-fr-en-fluent-paradox-1145"},{"id":4902159717,"title":"Growth Engineering Manager","company":"Empower","image":"https://lever-client-logos.s3.us-west-2.amazonaws.com/2e1a369c-b58f-41ac-8d86-4b0a77695e68-1687915522032.png","description":"<p style=\"min-height:1.5em\"><strong>EMPOWER OVERVIEW</strong></p><p style=\"min-height:1.5em\"><a target=\"_blank\" rel=\"noopener noreferrer nofollow\" href=\"http://empower.me/\">Empower</a> is shaking up an outdated financial system by providing real opportunity for our customers: the opportunity to get the cash they need, to access fair credit, and to change their financial story. Today, we’re helping millions of people find financial security through machine learning models that evaluate creditworthiness using a more inclusive lens and mobile-first products: Cash Advance, Thrive line of credit, and Petal credit cards. Tomorrow? Creating even more financial paths for our customers (and their wallets) to succeed.</p><p style=\"min-height:1.5em\">This year, Empower ranked #65 on Inc. 5000’s Fastest-Growing Private Companies list — our third year in a row cracking the top 100 — and was named by Forbes as one of the 25 Next Billion-Dollar Startups for 2024. Empower was also featured by Forbes on America’s Best Startup Employers list in 2023, and our Thrive line of credit product was named by Fast Company as one of 2022’s Next Big Things in Tech.</p><p style=\"min-height:1.5em\">Empower is backed by Sequoia Capital, Blisce, and Icon Ventures. Ready to grow your impact and accelerate your career? Take a look at our open roles — we can’t wait to meet you.</p><p style=\"min-height:1.5em\"></p><p style=\"min-height:1.5em\"><strong>THE EMPOWER WAY</strong></p><p style=\"min-height:1.5em\"><strong>Great Expectations</strong>: We come up with bold, audacious goals for ourselves and go all out for impact</p><p style=\"min-height:1.5em\"><strong>Owner Mindset</strong>: We give every employee latitude to act independently, make smart choices, and move the business forward</p><p style=\"min-height:1.5em\"><strong>Spirited Debate</strong>: We love skeptics and seek counter opinions to challenge our personal assumptions and expand our view</p><p style=\"min-height:1.5em\"><strong>Customer Obsession:</strong> We listen to understand, empathize, and create a memorable, rewarding experience for our community</p><p style=\"min-height:1.5em\"><strong>Inclusive Collaboration</strong>: We believe diverse teams make the best decisions, and we strive to give diverse voices a seat at the table</p><p style=\"min-height:1.5em\"><strong>No Jerks Allowed</strong>: We value our relationships and take the time to build trust and connection and communicate respectfully</p><p style=\"min-height:1.5em\"></p><p style=\"min-height:1.5em\"><strong>WHAT EMPOWER OFFERS</strong></p><p style=\"min-height:1.5em\">Competitive salary</p><p style=\"min-height:1.5em\">Generous equity package</p><p style=\"min-height:1.5em\">Full healthcare benefits</p><p style=\"min-height:1.5em\">Technology expense reimbursement</p><p style=\"min-height:1.5em\">Virtual first environment</p><p style=\"min-height:1.5em\"><strong>JOB DESCRIPTION</strong></p><p style=\"min-height:1.5em\">As the Engineering Director for our Growth teams, you'll be responsible for leading a dynamic team of engineers focused on driving product adoption, improving user engagement, and optimizing our growth strategy through data-driven engineering initiatives. You’ll work closely with product management, data science, credit and marketing to develop high-impact features, experiments, and optimizations that directly contribute to our company’s growth goals.</p><p style=\"min-height:1.5em\"></p><p style=\"min-height:1.5em\">This is a highly impactful leadership role that blends technical expertise with a deep understanding of experimentation and user acquisition in a fast-paced startup environment.  The Growth teams take big swings, solve problems resourcefully, and work methodically across the business to enhance the impact, efficiency, and profitability of our growth programs.</p><p style=\"min-height:1.5em\"></p><p style=\"min-height:1.5em\">Travel for company offsites is expected at a minimum 2 times a year.</p><p style=\"min-height:1.5em\"></p><p style=\"min-height:1.5em\"><strong>KEY RESPONSIBILITIES</strong></p><p style=\"min-height:1.5em\"></p><ul style=\"min-height:1.5em\"><li><p style=\"min-height:1.5em\">Collaborate with Product, Marketing, and Credit teams to define and execute on growth objectives, ensuring alignment across engineering efforts and overall business goals</p></li><li><p style=\"min-height:1.5em\">Design and build systems that optimize user acquisition, retention, and activation, while continuously testing and iterating on features that drive measurable growth.</p></li><li><p style=\"min-height:1.5em\">Systematically deconstruct complex problems, formulate hypotheses, and organize team efforts for rigorous verification.</p></li><li><p style=\"min-height:1.5em\">Lead, mentor, and inspire a team of engineers focused on growth initiatives. Foster a culture of high performance, accountability, and continuous learning.</p></li><li><p style=\"min-height:1.5em\">Setting and effectively communicating priorities to align engineering team efforts with business objectives.</p></li><li><p style=\"min-height:1.5em\">Guide the team in solving complex technical challenges, balancing the technical quality of the team’s output with a rapid pace of learning.  Drive a technical roadmap that helps unlock greater impact.</p></li></ul><p style=\"min-height:1.5em\"><br /></p><p style=\"min-height:1.5em\"><strong>CANDIDATE QUALIFICATIONS</strong></p><p style=\"min-height:1.5em\"></p><ul style=\"min-height:1.5em\"><li><p style=\"min-height:1.5em\">7+ years of engineering experience, with at least 3 years in an engineering management role.</p></li><li><p style=\"min-height:1.5em\">Proven track record of leading growth-focused engineering teams at a scaling startup or high-growth company.</p></li><li><p style=\"min-height:1.5em\">Strong understanding of data-driven decision-making, A/B testing, and experimentation frameworks.</p></li><li><p style=\"min-height:1.5em\">Excellent communication skills, with the ability to articulate technical challenges to non-technical stakeholders and drive alignment across teams.</p></li><li><p style=\"min-height:1.5em\">Ability to balance hands-on engineering work with strategic leadership.</p></li><li><p style=\"min-height:1.5em\">Strong bias for action with the ability to efficiently and methodically organize and deploy cross-functional resources in pursuit of business goals and changing circumstances.</p></li></ul><p style=\"min-height:1.5em\">At Empower, we hire for people that push themselves to understand others and seek out ways to challenge their personal assumptions. Our hope is that by fostering such an environment, we strengthen our business and relationships by putting people first. We are committed to building a diverse, inclusive, and equitable workspace where everyone (regardless of age, education, ethnicity, gender, sexual orientation, or any personal characteristics) feels like they belong. Even if your experience doesn’t exactly match up to our job description, you should feel empowered to apply regardless!</p>","tags":"[\"management\",\"engineering\"]","pubDate":"2025-02-04T17:45:33.236Z","link":"https://jobs.ashbyhq.com/empower%20finance/389daa9f-37e4-46b1-b530-a9879cc06cbb","slug":"growth-engineering-manager-empower-881"},{"id":4797463833,"title":"Become a Co-Founder | Ruby Labs","company":"Ruby Labs","image":"https://media.licdn.com/dms/image/v2/D4D0BAQF7VVv61POIFw/company-logo_200_200/company-logo_200_200/0/1721937953426?e=1743033600&v=beta&t=_qAkZ_qGO7Du2NSUdHDNbUKIbz28Y1HDm1g9mwNIOnk","description":"<h1><strong>About us</strong></h1><p style=\"min-height:1.5em\">Ruby Labs is a leading tech company that creates and operates innovative consumer products. We offer a diverse range of opportunities across the health, education, and entertainment industries. Our innovative teams are driving the future of consumer-led products, and we're always looking for passionate individuals to join us. </p><p style=\"min-height:1.5em\">This form is for submitting your own startup ideas and pitch decks. To apply for an existing Co-Founder role, please return to the <a target=\"_blank\" rel=\"noopener noreferrer nofollow\" href=\"https://develop.ruby-labs-website.pages.dev/become-a-co-founder/\">Co-Founder Opportunities</a> page and apply through the Open Roles section.</p>","tags":"[]","pubDate":"2025-02-04T16:25:57.126Z","link":"https://jobs.ashbyhq.com/ruby-labs/d53fee86-4188-42d1-873e-e7f6f8271e9c","slug":"become-a-co-founder-ruby-labs-ruby-labs-1904"},{"id":8700095710,"title":"Accounting Manager","company":"Metabase","image":"https://avatars.githubusercontent.com/u/10520629?s=200&v=4","description":"<div>Metabase is the easiest way for people to get insights from their data, from tiny startups who get up and running quickly to major corporations with tens of thousands of users. That's why people <a class=\"postings-link\" href=\"https://www.metabase.com/love\">love us</a>.</div><div><br></div><div>We bring data tools with the elegance and simplicity of consumer products to the crufty world of enterprise business intelligence. We provide an opinionated open source starting point for how companies should measure, analyze and share their data, which is used by tens of thousands of companies.</div><div><br></div><div><span style=\"font-size: 11pt;\">Metabase’s BizOps &amp; Finance team is looking to add to our team with a high-performer who can manage our accounting, external audit, tax and payments.&nbsp; Our bookkeeping and tax accounting are outsourced, so this will require managing and overseeing external accounting firms.&nbsp; Longer-term we may bring some of these functions in-house.&nbsp; Alongside that you will design and build-out our internal systems, processes and reporting.</span></div><div><span style=\"font-size: 11pt;\">The role will offer significant exposure to the financial management of a rapidly growing company, and the opportunity to own and grow our accounting functions.&nbsp; We are a small team, so you should be prepared to roll up your sleeves and get stuck in where you are needed.&nbsp; </span></div><div><span style=\"font-size: 11pt;\">Metabase’s BizOps &amp; Finance team is looking to add to our team with a high-performer who can manage our accounting, external audit, tax and payments.&nbsp; Our bookkeeping and tax accounting are outsourced, so this will require managing and overseeing external accounting firms.&nbsp; Longer-term we may bring some of these functions in-house.&nbsp; Alongside that you will design and build-out our internal systems, processes and reporting.</span></div><div><span style=\"font-size: 11pt;\">The role will offer significant exposure to the financial management of a rapidly growing company, and the opportunity to own and grow our accounting functions.&nbsp; We are a small team, so you should be prepared to roll up your sleeves and get stuck in where you are needed.&nbsp; </span></div><h3>Responsibilities </h3><li>Working with our external financial accountants, managing the month-end-close process&nbsp;</li><li>Project-managing and liaising with our external financial auditors</li><li>Working with our tax accountants, providing ad-hoc analysis in support of tax submissions and making sure things stay on-track</li><li>Building-out internal reporting</li><li>Designing and implementing financial systems and processes to improve our efficiency</li><li>Owning our payments processes, and helping team members with purchases</li><li>Managing our insurance needs</li><li>Getting stuck in where needed</li><h3>About You</h3><li>Rock-solid quantitative skills: you produce error-free analysis and reports, and can diagnose and solve complex issues in our bookkeeping</li><li>Strong organizational / project-management skills</li><li>CPA with strong knowledge of GAAP</li><li>Roughly 3-5 years experience, preferably in a startup, high-growth company, or public accounting firm</li><li>Strong quantitative undergraduate degree</li><li>Based in the US or Canada</li><li>Low-ego attitude: no job should be too small or too large</li><li>Nice-to-have: experience with tax compliance and working with external auditors</li><li>Nice-to-have: familiarity with QBO&nbsp;</li><li>Nice-to-have: some knowledge of SQL and / or a scripting language to help automate things (e.g. python, javascript, VBA)</li><div>We're a global team (50% outside the US), fully distributed (from Thailand to California), who get things done asynchronously, with plenty of uninterrupted time, supporting each other to do the best work of our careers. We offer flexibility (define your own schedule and work from wherever you want), autonomy, and an environment that fosters growth, learning, and development. We're relentlessly user-focused and believe in building long-term value, not short-term hacks. And we raised a $30M Series B to take our approach to the next level for years to come.</div><div><br></div><div><span style=\"font-size: 10px\">For U.S. applicants: Metabase participates in the federal E-Verify program, which confirms employment authorization of newly hired U.S. based employees. E-Verify is not used as a tool to pre-screen candidates and is only initiated upon hire.</span></div><div><br></div><div><span style=\"font-size: 10px\"><a href=\"https://www.e-verify.gov/sites/default/files/everify/posters/EVerifyParticipationPoster.pdf\"><u>E-Verify Participation Notice</u></a> (English/Spanish)</span></div><div><span style=\"font-size: 10px\"><a href=\"https://www.e-verify.gov/sites/default/files/everify/posters/IER_RightToWorkPoster%20Eng_Es.pdf\"><u>Right to Work Notice</u></a> (English/Spanish)</span></div><div>Metabase is the easiest way for people to get insights from their data, from tiny startups who get up and running quickly to major corporations with tens of thousands of users. That's why people <a href=\"https://www.metabase.com/love\" class=\"postings-link\">love us</a>.</div><div><br></div><div>We bring data tools with the elegance and simplicity of consumer products to the crufty world of enterprise business intelligence. We provide an opinionated open source starting point for how companies should measure, analyze and share their data, which is used by tens of thousands of companies.</div>","tags":"[\"javascript\",\"finance\",\"management\"]","pubDate":"2025-02-04T13:56:21.295Z","link":"https://jobs.lever.co/metabase/683beb7a-c215-4d91-9cd8-9ead3aff56b5","slug":"accounting-manager-metabase-4983"},{"id":9059381804,"title":"Senior Product Manager, Payments + Trust","company":"Owner","image":"https://avatars.githubusercontent.com/u/87661266?s=200&v=4","description":"<div><span style=\"font-size: 18px\">👋&nbsp;</span><b style=\"font-size: 18px;\">About&nbsp;<a href=\"http://owner.com/\">Owner.com</a></b></div><div>Owner is the all-in-one platform that restaurants use to succeed online.</div><div><br></div><div>Thousands of restaurant owners use our tools to build their website, drive online orders, create their own branded app, manage their customer relationships, and set up marketing automations.</div><div><br></div><div>You can think of it as Shopify meets HubSpot, but specifically for restaurants.</div><div><br></div><div>Learn more about the problems we are solving for our customers&nbsp;<a href=\"https://www.owner.com/our-story\">here</a>.</div><div><br></div><div><span style=\"font-size: 18px\">🌎&nbsp;</span><b style=\"font-size: 18px;\">Our vision</b></div><div>We’re starting by helping independent restaurants succeed online.</div><div><br></div><div>But it’s not just restaurants that need our help. Most local businesses are struggling with these same problems. Huge technology corporations are taking their customers, bleeding their profits, and making it hard for them to survive.</div><div>Once we nail the solution for restaurants&nbsp;–&nbsp;we’ll scale it into every other local business type.</div><div><br></div><div>In the future we envision, tens of millions of local business owners will use our technology to succeed in the digital age.</div><div><br></div><div><span style=\"font-size: 18px\">🚀&nbsp;</span><b style=\"font-size: 18px;\">Our traction</b></div><div>In just over 3 years we've generated&nbsp;tens of millions in revenue, served millions of guests, and processed hundreds of millions of online orders.</div><div><br></div><div>More importantly, we’ve helped thousands of restaurant owners save their businesses - and not&nbsp; only survive, but thrive.</div><div><br></div><div><span style=\"font-size: 18px\">⭐&nbsp;</span><b style=\"font-size: 18px;\">Our team</b></div><div>Our team grew from under 100 to nearly 200 talented people in 2024. We’ve got top talent from the most successful companies in SMB software, including: Shopify, HubSpot, DoorDash, ServiceTitan, Rappi, Faire and Stripe.</div><div><br></div><div>We’ll be scaling even faster in 2025 to keep pace with our customer growth.</div><div><br></div><div><span style=\"font-size: 18px\">🌆&nbsp;</span><b style=\"font-size: 18px;\">Where we work</b></div><div>Owner is a remote-first, global company headquartered in San Francisco, with a sales hub in Toronto. For a few of our roles we prioritize in-person collaboration at one of our office locations. Most of our employees are distributed throughout the globe. Please review the role description and discuss with your recruiter for more details on location</div><div><br></div><div>🫵 <b>Why we’re looking for you</b></div><div><br></div><div>We are looking for a Senior Product Manager, Payments &amp; Risk, to build and optimize our internal fraud detection, payment and security systems. You will create a roadmap for the payment infrastructure, manage product development, collaborate with partners to enhance offerings, and conduct market research to inform strategies.</div><div>This role will be responsible for maintaining our existing payment capabilities and developing a strategy around Payments to meet market demand in a new way via a Payments offering. Your work will be rooted in building a solution that brings value to our customers.</div><div><br></div><div>As we scale our payments function, we want someone who has seen this journey before, understands how to optimize fraud detection and payment security, and can ensure we maintain a seamless customer experience.</div><div>If you have experience and have built extensively in the payments and fraud ecosystem, this role is for you!</div><div><br></div><div>For the right candidate, we are open to elevating this position to a Staff Level role. However, the final role level will be determined based on years of experience, industry background, domain expertise, and performance throughout the interview process as we progress toward the final stages.</div><div><br></div><div>This role is 100% remote, with a preference for folks to be in the Bay Area. Chat with your recruiter to understand what that looks like!</div><div>🫵 <b>Why we’re looking for you</b></div><div><br></div><div>We are looking for a Senior Product Manager, Payments &amp; Risk, to build and optimize our internal fraud detection, payment and security systems. You will create a roadmap for the payment infrastructure, manage product development, collaborate with partners to enhance offerings, and conduct market research to inform strategies.</div><div>This role will be responsible for maintaining our existing payment capabilities and developing a strategy around Payments to meet market demand in a new way via a Payments offering. Your work will be rooted in building a solution that brings value to our customers.</div><div><br></div><div>As we scale our payments function, we want someone who has seen this journey before, understands how to optimize fraud detection and payment security, and can ensure we maintain a seamless customer experience.</div><div>If you have experience and have built extensively in the payments and fraud ecosystem, this role is for you!</div><div><br></div><div>For the right candidate, we are open to elevating this position to a Staff Level role. However, the final role level will be determined based on years of experience, industry background, domain expertise, and performance throughout the interview process as we progress toward the final stages.</div><div><br></div><div>This role is 100% remote, with a preference for folks to be in the Bay Area. Chat with your recruiter to understand what that looks like!</div><h3>💻 The impact you will have</h3><li>Design the roadmap for maturing the Owner payments platform, so we can fully control the onboarding and user experience for our customers, help them manage complex flows like KYC and chargebacks, and pass along the absolute best processing rates.</li><li>Successfully ship new Payment &amp; Fraud related products, including defining vision, strategy, outcome-driven product roadmaps and creating and managing backlogs.</li><li>Expand our fraud detection abilities and build out remediation systems.</li><li>Drive an application security roadmap in concert with engineering.</li><li>Optimize payment integrations by identifying gaps in their processing and ensuring our customers get the best possible rates.</li><li>Lay the foundation for a dedicated payments team as we scale, influencing the structure and strategy for long-term success.</li><h3>👥 Who you’ll work with</h3><li>Reports to: Chief Product Officer</li><li>Dedicated Pod Structure: You will work closely with a team of engineers and a designer within an agile framework.</li><li>Cross-functional Collaboration: Partner with engineering, product, finance, and customer support teams to drive seamless payment experiences.</li><li>Executive Influence: Work alongside leadership to define and execute our payments and fraud strategy, setting the foundation for future scalability.</li><h3>✅ Minimum requirements</h3><li>8+ years of product management experience with significant experience in payments, fraud detection, or fintech product management</li><li>Experience building solutions with transaction revenue or knowledge of pricing on transactions in general.</li><li>Experience and working knowledge of payment players (esp Stripe or Adyen), ecosystems, incentives, and foundational systems.</li><li>Proven experience working with payment infrastructure at scale- ideally in vertical SaaS providing payments to a large number of small businesses.</li><li>Strong operational mindset—deep understanding of fraud detection, transaction flagging, and automation processes.</li><li>Hands-on experience in payment security, MFA, and risk mitigation.</li><li>Quick understanding of new fraud motives and sensible diagnosis of key control points.</li><li>Strong analytical and quantitative skills with the ability to use data and metrics to back up assumptions and recommendations to drive actions.</li><li>Proven ability to roadmap and execute quarterly plans, run sprints, and manage backlogs.</li><h3>🏆 Pay and Benefits</h3><li>The estimated base salary range for this role is $180,000 - $230,000 USD plus a generous equity pre-IPO equity package. Actual pay will be determined based on several factors such as past experience and qualifications, geographic location, and other job-related factors permitted by law.</li><li>Other benefits include comprehensive health coverage, work from anywhere (remote-first workplace), unlimited PTO - plus extra fun perks!</li><div><b><span style=\"font-size: 10px\">🚩 Notice - Employment Scams</span></b></div><div><span style=\"font-size: 10px\">Communication from our team regarding job opportunities will only be made by an Owner employee with an @owner.com email address.</span></div><div><span style=\"font-size: 10px\">We do not conduct interviews over email or chat platforms, and we will never ask you to provide personal or financial information such as your mailing address, social security number, credit card numbers or banking information.&nbsp; If you believe you are being contacted by scammer, please mark the communication as \"phishing\" or “spam” and do not respond.</span></div><div><span style=\"font-size: 18px\">👋&nbsp;</span><b style=\"font-size: 18px;\">About&nbsp;<a href=\"http://owner.com/\">Owner.com</a></b></div><div>Owner is the all-in-one platform that restaurants use to succeed online.</div><div><br></div><div>Thousands of restaurant owners use our tools to build their website, drive online orders, create their own branded app, manage their customer relationships, and set up marketing automations.</div><div><br></div><div>You can think of it as Shopify meets HubSpot, but specifically for restaurants.</div><div><br></div><div>Learn more about the problems we are solving for our customers&nbsp;<a href=\"https://www.owner.com/our-story\">here</a>.</div><div><br></div><div><span style=\"font-size: 18px\">🌎&nbsp;</span><b style=\"font-size: 18px;\">Our vision</b></div><div>We’re starting by helping independent restaurants succeed online.</div><div><br></div><div>But it’s not just restaurants that need our help. Most local businesses are struggling with these same problems. Huge technology corporations are taking their customers, bleeding their profits, and making it hard for them to survive.</div><div>Once we nail the solution for restaurants&nbsp;–&nbsp;we’ll scale it into every other local business type.</div><div><br></div><div>In the future we envision, tens of millions of local business owners will use our technology to succeed in the digital age.</div><div><br></div><div><span style=\"font-size: 18px\">🚀&nbsp;</span><b style=\"font-size: 18px;\">Our traction</b></div><div>In just over 3 years we've generated&nbsp;tens of millions in revenue, served millions of guests, and processed hundreds of millions of online orders.</div><div><br></div><div>More importantly, we’ve helped thousands of restaurant owners save their businesses - and not&nbsp; only survive, but thrive.</div><div><br></div><div><span style=\"font-size: 18px\">⭐&nbsp;</span><b style=\"font-size: 18px;\">Our team</b></div><div>Our team grew from under 100 to nearly 200 talented people in 2024. We’ve got top talent from the most successful companies in SMB software, including: Shopify, HubSpot, DoorDash, ServiceTitan, Rappi, Faire and Stripe.</div><div><br></div><div>We’ll be scaling even faster in 2025 to keep pace with our customer growth.</div><div><br></div><div><span style=\"font-size: 18px\">🌆&nbsp;</span><b style=\"font-size: 18px;\">Where we work</b></div><div>Owner is a remote-first, global company headquartered in San Francisco, with a sales hub in Toronto. For a few of our roles we prioritize in-person collaboration at one of our office locations. Most of our employees are distributed throughout the globe. Please review the role description and discuss with your recruiter for more details on location</div>","tags":"[\"finance\",\"management\",\"engineering\"]","pubDate":"2025-02-04T13:42:07.882Z","link":"https://jobs.lever.co/owner/e4b1277d-0f97-42bc-9cb5-892ae1c6d2f8","slug":"senior-product-manager-payments-trust-owner-1465"},{"id":2125938562,"title":"Senior Technical Account Manager","company":"Clutch","image":"https://app.ashbyhq.com/api/images/org-theme-logo/87f6e542-ae68-4ff1-ab48-f05e9dab1964/e24aecd5-3955-404a-8728-c08806c78730.png","description":"<h1><strong>About the Role</strong></h1><p style=\"min-height:1.5em\">At Clutch, <strong>Technical Account Managers (TAMs)</strong> are trusted advisors to our customers, ensuring seamless adoption, optimization, and expansion of our solutions post-launch. You will play a <strong>critical role in bridging the gap between Clutch’s technology and our customers’ operational needs</strong>, enabling credit unions to achieve digital transformation.</p><p style=\"min-height:1.5em\">As a <strong>TAM at Clutch</strong>, you will lead <strong>technical enablement, solutioning, and product adoption strategies</strong>, working cross-functionally with Customer Success, Product, Engineering, and Sales to drive successful long-term partnerships. You will tackle <strong>complex technical challenges, streamline integrations, and drive strategic outcomes</strong> for a book of accounts.</p><p style=\"min-height:1.5em\">This role is perfect for a <strong>technically adept, customer-focused professional</strong> who thrives in a <strong>high-growth, fast-paced environment</strong>, enjoys <strong>solving complex business and technical challenges</strong>, and is passionate about ensuring <strong>customers see measurable ROI</strong> from Clutch’s platform.</p><p style=\"min-height:1.5em\"></p><h1><strong>About the Team</strong></h1><p style=\"min-height:1.5em\">At Clutch, our Customer Success team is celebrated for its exceptional performance and the consistently glowing feedback from our clients. We are a dynamic, supportive group that thrives on collaboration, innovation, and an unwavering commitment to continuous improvement.</p><p style=\"min-height:1.5em\">Clutch fosters a fast-paced, innovative, and inclusive culture where curiosity and initiative are highly valued. We seek out self-starters who are eager to elevate themselves and their colleagues every day. Within our Customer Success organization, and across our cross-functional teams, we operate as a united front—striving to be smart, humble, hardworking, and above all, deeply collaborative.</p><p style=\"min-height:1.5em\"></p><h1><strong>What You’ll Do</strong></h1><p style=\"min-height:1.5em\">Within 3 months, you will:</p><ul style=\"min-height:1.5em\"><li><p style=\"min-height:1.5em\">Establish strong relationships with key customer stakeholders, ensuring a solid foundation for trust and collaboration.</p></li><li><p style=\"min-height:1.5em\">Gain a deep understanding of customers' technical needs and Clutch’s solutions to provide effective advisory.</p></li><li><p style=\"min-height:1.5em\">Achieve an initial improvement in customer satisfaction scores by addressing <strong>early technical pain points.</strong></p></li></ul><p style=\"min-height:1.5em\"></p><p style=\"min-height:1.5em\">Within 6 months, you will:</p><ul style=\"min-height:1.5em\"><li><p style=\"min-height:1.5em\">Lead <strong>technical solutioning</strong> for customers post-go-live, ensuring seamless <strong>feature adoption, workflow optimization, and cross-product enablement</strong>.</p></li><li><p style=\"min-height:1.5em\">Identify and address <strong>customer friction points</strong>, working with Product and Engineering to escalate critical feature gaps or technical improvements.</p></li><li><p style=\"min-height:1.5em\">Develop repeatable <strong>playbooks for proactive technical account management</strong>, helping standardize post-sales enablement processes.</p></li></ul><p style=\"min-height:1.5em\"></p><p style=\"min-height:1.5em\">Within 9 months, you will:</p><ul style=\"min-height:1.5em\"><li><p style=\"min-height:1.5em\">Be the <strong>technical voice of the customer</strong>, advocating for key enhancements that drive customer success and influencing Clutch’s product roadmap.</p></li><li><p style=\"min-height:1.5em\">Drive measurable improvements in <strong>customer retention and expansion</strong>, collaborating with Customer Success and Sales, leveraging <strong>adoption insights and product usage patterns</strong> to identify upsell opportunities, ensuring customers fully utilize Clutch’s platform across multiple product lines.</p></li><li><p style=\"min-height:1.5em\">Establish Clutch’s TAM function as a <strong>strategic post-sales differentiator</strong>, ensuring Clutch remains an indispensable partner to our customers.</p></li></ul><p style=\"min-height:1.5em\"></p><h1><strong>What You’ll Bring</strong></h1><p style=\"min-height:1.5em\"><strong>Technical Expertise &amp; Problem-Solving:</strong></p><ul style=\"min-height:1.5em\"><li><p style=\"min-height:1.5em\"><strong>5-8+ years of experience in a technical customer-facing role</strong>, such as <strong>Technical Account Management, Solutions Engineering, Customer Success Engineering, or Solutions Architect.</strong></p></li><li><p style=\"min-height:1.5em\"><strong>Expertise in the finance industry</strong> or experience with highly regulated industries and complex solutions is <strong>highly preferred and a key differentiator.</strong></p></li><li><p style=\"min-height:1.5em\"><strong>Technical Skills:</strong> Experience with programming languages (e.g., Python, JavaScript, or similar), understanding of APIs, databases, cloud platforms, and system integrations. Familiarity with SQL, debugging tools, and version control (e.g., Git) is a plus.</p></li><li><p style=\"min-height:1.5em\">Strong ability to <strong>diagnose technical issues, translate customer needs into solutions, and work cross-functionally</strong> to drive results.</p></li><li><p style=\"min-height:1.5em\">Experience working in startup environments required;</p></li></ul><p style=\"min-height:1.5em\"><strong>Customer-Focused Strategic Thinking:</strong></p><ul style=\"min-height:1.5em\"><li><p style=\"min-height:1.5em\"><strong>Proven ability to drive product adoption and customer technical success post-launch</strong>, ensuring measurable outcomes.</p></li><li><p style=\"min-height:1.5em\">Strong experience in <strong>change management and technical enablement</strong>, helping customers navigate complex product rollouts.</p></li><li><p style=\"min-height:1.5em\">Ability to <strong>engage C-level executives as well technical teams</strong>, serving as a trusted advisor on Clutch’s platform technical capabilities.</p></li></ul><p style=\"min-height:1.5em\"><strong>Collaboration &amp; Influence:</strong></p><ul style=\"min-height:1.5em\"><li><p style=\"min-height:1.5em\">Strong communication skills with the ability to <strong>explain complex technical topics to non-technical stakeholders</strong>.</p></li><li><p style=\"min-height:1.5em\">Proven experience collaborating with <strong>Product, Engineering, Implementation and Customer Success</strong> to drive feature adoption.</p></li></ul><p style=\"min-height:1.5em\"><em>Please note that this role may evolve as our business needs change, so we appreciate your flexibility and adaptability.</em></p><p style=\"min-height:1.5em\"></p><h1><strong>What’s In It For You?</strong></h1><ul style=\"min-height:1.5em\"><li><p style=\"min-height:1.5em\"><strong>Remote Flexibility:</strong> Enjoy the freedom of remote work from anywhere, balancing life and career seamlessly.</p></li><li><p style=\"min-height:1.5em\"><strong>Unforgettable Off-Sites:</strong> Twice a year, bond with colleagues in exciting destinations, fostering teamwork and fresh ideas.</p></li><li><p style=\"min-height:1.5em\"><strong>Paid Time Off:</strong> Enjoy flexible PTO days yearly for relaxation and rejuvenation.</p></li><li><p style=\"min-height:1.5em\"><strong>Stock Options:</strong> Joining us means having a stake in our success, so you'll receive stock options as part of your compensation package.</p></li><li><p style=\"min-height:1.5em\"><strong>Home Office Setup:</strong> Create your ideal workspace with a dedicated budget for home office essentials.</p></li><li><p style=\"min-height:1.5em\"><strong>Work Trip Budget:</strong> Grow personally and professionally with a budget for work-related trips and co-working.</p></li><li><p style=\"min-height:1.5em\"><strong>Health Coverage:</strong> Prioritize your well-being with comprehensive health and dental insurance plans.</p></li></ul><h1><strong>About Us</strong></h1><p style=\"min-height:1.5em\"><strong>Clutch</strong> is a revolutionary vertical SaaS company, proudly backed by Andreessen Horowitz (A16z), aimed at revolutionizing the way Credit Unions engage and change the lives of their members. As a champion of financial well-being, we address the urgent need for affordable lending solutions in an era where the average American grapples with over $155,000 in household debt.  Unlike traditional financial institutions, Clutch develops software to turn Credit Unions into FinTech lenders and leverage their balance sheets to responsibly lend to over 130M Americans. Our mission extends beyond mere financial transactions; we strive to fundamentally enhance the way credit unions interact with their members. By integrating cutting-edge technologies and user-centric designs, we help credit unions provide seamless digital experiences that are on par with leading tech companies. This approach not only preserves but revitalizes the longstanding tradition of community and member-focused service inherent to credit unions.</p><p style=\"min-height:1.5em\">Clutch is an equal opportunity employer. All applicants will be considered for employment without attention to race, color, religion, sex, sexual orientation, gender identity, national origin, veteran or disability status.</p><p style=\"min-height:1.5em\"><em>Our organization participates in E-Verify. Click </em><a target=\"_blank\" rel=\"noopener noreferrer\" href=\"https://www.e-verify.gov/about-e-verify/what-is-e-verify\"><em>here</em></a><em> to learn about E-Verify.</em></p>","tags":"[\"javascript\",\"finance\",\"management\",\"engineering\",\"database\"]","pubDate":"2025-02-04T13:08:09.890Z","link":"https://jobs.ashbyhq.com/withclutch/a0f937fe-eb38-404c-bc31-13e82cdbcf9c","slug":"senior-technical-account-manager-clutch-6114"},{"id":7916919437,"title":"Business Analyst","company":"Outliant","image":"https://remotive.com/job/1969389/logo","description":"<p style=\"min-height: 1.5em;\"><strong>About us:</strong></p>\n<p style=\"min-height: 1.5em;\">Outliant is a fully-remote, US-based, digital product development and startup consulting company, with a team of culturally diverse creators whose exceptional skills and talents help conceive seamless digital products. Our teams exhibit work-play energy that supports individual growth, as well as encourages the freedom of creativity and “thinking outside the box.”</p>\n<p style=\"min-height: 1.5em;\"> </p>\n<p style=\"min-height: 1.5em;\"><strong>Our Core Values:</strong></p>\n<ul style=\"\">\n<li style=\"\">\n<p style=\"min-height: 1.5em;\"><strong>Pursuit of Excellence: </strong>We are extremely competitive, ambitious, and driven to be exceptional – as individuals, teams, and as an organization. There is no standard high enough and we will never settle. We aspire to attract, retain, and empower the very best people.</p>\n</li>\n<li style=\"\">\n<p style=\"min-height: 1.5em;\"><strong>Startup Mentality:</strong> Outliant began with 5 startup founders, and startup culture is deep in our DNA. It’s a critical advantage that allows us to move faster, be more resourceful, and empower our team at all levels. We are in the early chapters of our journey.</p>\n</li>\n<li style=\"\">\n<p style=\"min-height: 1.5em;\"><strong>World-Class Remote Collaboration:</strong> Outliant is (and always has been) a 100% remote company – we have no offices and our teams are distributed around the world. Given the freedom and autonomy this provides, we require that our people excel in this remote structure.</p>\n<p style=\"min-height: 1.5em;\"> </p>\n</li>\n</ul>\n<p style=\"min-height: 1.5em;\"><strong>About the role:</strong></p>\n<p style=\"min-height: 1.5em;\">As a Business Analyst, you will be critical in bridging the gap between business needs and technical solutions. You will analyze complex business processes, identify opportunities for improvement, and collaborate with stakeholders to deliver effective solutions. Your ability to work independently, coupled with you strong analytical skills, will be essential in driving successful outcomes.</p>\n<p style=\"min-height: 1.5em;\"> </p>\n<p style=\"min-height: 1.5em;\"><strong>Seniority Level</strong>: Mid Level</p>\n<p style=\"min-height: 1.5em;\"> </p>\n<p style=\"min-height: 1.5em;\"><strong>Responsibilities</strong>:</p>\n<ul style=\"\">\n<li style=\"\">\n<p style=\"min-height: 1.5em;\"><strong>Business Process Analysis</strong>: Analyze complex business processes to identify areas for improvement, optimize workflows, and enhance efficiency across departments.</p>\n</li>\n<li style=\"\">\n<p style=\"min-height: 1.5em;\"><strong>Stakeholder Collaboration</strong>: Work closely with business stakeholders to gather and document requirements, ensuring a clear understanding of project goals and deliverables.</p>\n</li>\n<li style=\"\">\n<p style=\"min-height: 1.5em;\"><strong>Solution Design</strong>: Translate business needs into technical solutions by collaborating with development teams to ensure alignment with requirements and objectives.</p>\n</li>\n<li style=\"\">\n<p style=\"min-height: 1.5em;\"><strong>Data Analysis &amp; Reporting</strong>: Use data analytics to assess business performance, identify trends, and provide actionable insights to inform decision-making.</p>\n</li>\n<li style=\"\">\n<p style=\"min-height: 1.5em;\"><strong>Project Management Support</strong>: Assist in the planning, execution, and monitoring of project timelines, ensuring key milestones are met and issues are addressed promptly.</p>\n</li>\n<li style=\"\">\n<p style=\"min-height: 1.5em;\"><strong>Change Management</strong>: Facilitate smooth implementation of new systems or processes by creating training materials, conducting workshops, and managing stakeholder expectations.</p>\n</li>\n<li style=\"\">\n<p style=\"min-height: 1.5em;\"><strong>Risk &amp; Issue Identification</strong>: Identify potential risks and issues in projects, proactively addressing them to minimize impact and ensure project success.</p>\n</li>\n</ul>\n<p style=\"min-height: 1.5em;\"> </p>\n<p style=\"min-height: 1.5em;\"><strong>Requirements:</strong></p>\n<ul style=\"\">\n<li style=\"\">\n<p style=\"min-height: 1.5em;\"><strong>Experience</strong>: Proven track record of at least 3 years in business analysis or a similar role, with a focus on delivering process improvements and effective solutions.</p>\n</li>\n<li style=\"\">\n<p style=\"min-height: 1.5em;\"><strong>Analytical Skills</strong>: Strong analytical and problem-solving abilities, capable of interpreting complex data and making data-driven recommendations.</p>\n</li>\n<li style=\"\">\n<p style=\"min-height: 1.5em;\"><strong>Communication Skills</strong>: Excellent verbal and written communication skills, with the ability to explain technical concepts clearly to non-technical stakeholders.</p>\n</li>\n<li style=\"\">\n<p style=\"min-height: 1.5em;\"><strong>Technical Knowledge</strong>: Familiarity with software development lifecycles (SDLC), agile methodologies, and business analysis tools like JIRA or Trello.</p>\n</li>\n<li style=\"\">\n<p style=\"min-height: 1.5em;\"><strong>Interpersonal Skills</strong>: Strong collaboration skills with cross-functional teams, including developers, project managers, and business leaders.</p>\n</li>\n<li style=\"\">\n<p style=\"min-height: 1.5em;\"><strong>Attention to Detail</strong>: High level of attention to detail in documenting requirements, creating reports, and managing project timelines and priorities.</p>\n</li>\n<li style=\"\">\n<p style=\"min-height: 1.5em;\"><strong>Adaptability</strong>: Ability to quickly learn new systems, processes, and technologies, and adapt to changing business needs.</p>\n</li>\n<li style=\"\">\n<p style=\"min-height: 1.5em;\"><strong>Problem-Solving Mindset</strong>: Ability to think critically and creatively, identifying innovative solutions to complex business challenges.</p>\n</li>\n</ul>\n<p style=\"min-height: 1.5em;\"><strong>Nice-to-haves:</strong></p>\n<ul style=\"\">\n<li style=\"\">\n<p style=\"min-height: 1.5em;\">Experience working in a start-up company</p>\n</li>\n<li style=\"\">\n<p style=\"min-height: 1.5em;\">Familiarity with tech services</p>\n</li>\n<li style=\"\">\n<p style=\"min-height: 1.5em;\">Worked across multiple industries</p>\n</li>\n</ul>\n<p style=\"min-height: 1.5em;\"> </p>\n<p style=\"min-height: 1.5em;\"><strong>What’s in it for you?</strong></p>\n<p style=\"min-height: 1.5em;\">As a full-time member of our team, you’ll enjoy:</p>\n<ul style=\"\">\n<li style=\"\">\n<p style=\"min-height: 1.5em;\">Flexible hours, work wherever you choose</p>\n</li>\n<li style=\"\">\n<p style=\"min-height: 1.5em;\">Unlimited PTO</p>\n</li>\n<li style=\"\">\n<p style=\"min-height: 1.5em;\">Non-working holidays per country of residence</p>\n</li>\n<li style=\"\">\n<p style=\"min-height: 1.5em;\">Pro-rated 13th-month bonus in select regions</p>\n</li>\n<li style=\"\">\n<p style=\"min-height: 1.5em;\">Salary increases and performance-based bonuses</p>\n</li>\n<li style=\"\">\n<p style=\"min-height: 1.5em;\">Referral bonuses</p>\n</li>\n<li style=\"\">\n<p style=\"min-height: 1.5em;\">Mental health and well-being programs</p>\n</li>\n<li style=\"\">\n<p style=\"min-height: 1.5em;\">Fun and casual work environment</p>\n</li>\n<li style=\"\">\n<p style=\"min-height: 1.5em;\">Employee engagement activities and virtual gatherings</p>\n</li>\n<li style=\"\">\n<p style=\"min-height: 1.5em;\">We are a diverse, global team! 🌍</p>\n</li>\n</ul>\n<p style=\"min-height: 1.5em;\"> </p>\n<p style=\"min-height: 1.5em;\"> </p>\n<p style=\"min-height: 1.5em;\"><strong>Important Notice</strong></p>\n<p style=\"min-height: 1.5em;\">To ensure the legitimacy of job opportunities, we strongly recommend that you solely rely on positions posted here on our official website: <a href=\"http://outliant.com/careers\" rel=\"nofollow\" target=\"_blank\"><strong>outliant.com/careers</strong></a>.</p>\n<p style=\"min-height: 1.5em;\"> </p>\n<p style=\"min-height: 1.5em;\">All our current job openings require video interviews conducted in either or both synchronous (via Google Meet) and asynchronous (via Willo) formats. Kindly refrain from accepting offers that appear suspicious. For any inquiries or concerns, feel free to reach out to us via email at <a href=\"mailto:recruitment@outliant.com\" rel=\"nofollow\" target=\"_blank\"><strong>recruitment@outliant.com</strong></a>.</p>\n<p style=\"min-height: 1.5em;\"> </p>\n<p style=\"min-height: 1.5em;\">Please be assured that we are fully committed to maintaining integrity in our hiring process.</p>\n<img src=\"https://remotive.com/job/track/1969389/blank.gif?source=public_api\" alt=\"\"/>","tags":"[\"excel\",\"video\",\"agile\",\"project management\",\"jira\",\"product development\",\"analytics\",\"trello\",\"data analysis\",\"business analysis\",\"SDLC\",\"startup\",\"mental health\",\"digital products\"]","pubDate":"2025-02-04T07:52:06.000Z","link":"https://remotive.com/remote-jobs/data/business-analyst-1969389","slug":"business-analyst-outliant-9234"},{"id":1005670200,"title":"UI/UX Designer","company":"Chorus One","image":"https://remotive.com/job/1969270/logo","description":"<div class=\"h4\"><strong>About Us</strong></div>\n<p style=\"text-align: start;\"><span style=\"color: #000000;\">Chorus One is  at the forefront of </span><strong><span style=\"color: #000000;\">Proof-of-Stake networks</span></strong><span style=\"color: #000000;\"> and decentralized protocols, helping secure billions in assets for tens of </span><strong><span style=\"color: #000000;\">thousands of customers and institutions worldwide</span></strong><span style=\"color: #000000;\">. </span></p>\n<p style=\"text-align: start;\"><span style=\"color: #000000;\">Our mission? To drive </span><strong><span style=\"color: #000000;\">freedom and innovation</span></strong><span style=\"color: #000000;\"> through cutting-edge decentralized technologies.</span></p>\n<p style=\"text-align: start;\"><span style=\"color: #000000;\">We’re a</span><strong><span style=\"color: #000000;\"> global powerhouse</span></strong><span style=\"color: #000000;\"> of 75+ talented individuals from 25+ countries, united by a shared passion for excellence, radical transparency, and continuous growth. But it’s not just about results—we believe in </span><strong><span style=\"color: #000000;\">treating each other with kindness and generosity</span></strong><span style=\"color: #000000;\"> while tackling some of the industry’s most exciting challenges.</span></p>\n<p style=\"text-align: start;\"><span style=\"color: #000000;\">If you’re ready to make an impact in a collaborative, high-energy team redefining the future of blockchain infrastructure, we want to hear from you!</span></p>\n<p style=\"min-height: 1.7em;\"> </p>\n<div class=\"h4\"><strong>Role</strong></div>\n<p><span style=\"color: #000000;\">As a </span><strong><span style=\"color: #000000;\">UI/UX Designer</span></strong><span style=\"color: #000000;\">, you will drive the end-to-end design process for our products, ensuring they are intuitive, user-centric, and aligned with our business goals. You will work closely with Product and Engineering teams to create seamless and delightful user experiences that resonate with our customers.</span></p>\n<p><strong><span style=\"color: #000000;\">Responsibilities</span></strong></p>\n<ul style=\"\">\n<li style=\"\">\n<p><span style=\"color: #000000;\">Research and analyze customer preferences and user behaviors to inform requirement development.</span></p>\n</li>\n<li style=\"\">\n<p><span style=\"color: #000000;\">Conduct usability tests, user interviews, and other methods to gather insights and feedback.</span></p>\n</li>\n<li style=\"\">\n<p><span style=\"color: #000000;\">Translate customer insights into design deliverables, such as concepts, personas, user journeys, system maps, and user flows.</span></p>\n</li>\n<li style=\"\">\n<p><span style=\"color: #000000;\">Lead UX delivery from prototypes to high-fidelity designs based on our design system.</span></p>\n</li>\n<li style=\"\">\n<p><span style=\"color: #000000;\">Collaborate with Product and Engineering teams to develop and iterate on user interfaces, ensuring a seamless integration of design and functionality.</span></p>\n</li>\n<li style=\"\">\n<p><span style=\"color: #000000;\">Continuously refine the user experience based on analytics, feedback, and changing business needs.</span></p>\n</li>\n<li style=\"\">\n<p><span style=\"color: #000000;\">Stay updated on the latest design trends, tools, and best practices in the blockchain and broader tech industry.</span></p>\n</li>\n</ul>\n<p style=\"min-height: 1.7em;\"> </p>\n<p><strong><span style=\"color: #000000;\">What we are looking for</span></strong></p>\n<ul style=\"\">\n<li style=\"\">\n<p><strong><span style=\"color: #000000;\">Experience</span></strong><span style=\"color: #000000;\">: A minimum of 3 years of UI/UX design experience, with at least 1 year of experience in blockchain projects or organizations. Experience designing for institutional products is a plus.</span></p>\n</li>\n<li style=\"\">\n<p><strong><span style=\"color: #000000;\">Portfolio</span></strong><span style=\"color: #000000;\">: Strong portfolio showcasing user flows, wireframes, prototypes, and high-fidelity UI designs for digital products.</span></p>\n</li>\n<li style=\"\">\n<p><strong><span style=\"color: #000000;\">Skills</span></strong><span style=\"color: #000000;\">:</span></p>\n</li>\n</ul>\n<ul style=\"\">\n<li style=\"\">\n<p><span style=\"color: #000000;\">Expertise in UX research methods, usability testing, and data-driven design.</span></p>\n</li>\n<li style=\"\">\n<p><span style=\"color: #000000;\">Proficiency in design tools such as Figma, Adobe XD, or similar.</span></p>\n</li>\n<li style=\"\">\n<p><span style=\"color: #000000;\">Strong understanding of responsive design, accessibility, and design systems.</span></p>\n</li>\n<li style=\"\">\n<p><span style=\"color: #000000;\">Ability to create user-centered designs that balance business and technical requirements.</span></p>\n</li>\n</ul>\n<ul style=\"\">\n<li style=\"\">\n<p><strong><span style=\"color: #000000;\">Communication: </span></strong><span style=\"color: #000000;\">Excellent verbal and written communication skills to articulate design decisions and collaborate across teams.</span></p>\n</li>\n<li style=\"\">\n<p><strong><span style=\"color: #000000;\">Independence: </span></strong><span style=\"color: #000000;\">Comfort working autonomously, managing ambiguity, and delivering high-quality work within deadlines.</span></p>\n</li>\n<li style=\"\">\n<p><strong><span style=\"color: #000000;\">Nice to Have</span></strong><span style=\"color: #000000;\">: Personal use of crypto applications and experience in staking.</span></p>\n</li>\n</ul>\n<p style=\"text-align: start; min-height: 1.7em;\"> </p>\n<p style=\"text-align: start;\"><strong><span style=\"color: #000000;\">What We Offer:</span></strong></p>\n<p style=\"text-align: start;\"><span style=\"color: #000000;\">💸 </span><strong><span style=\"color: #000000;\">Compensation &amp; Equity<br></span></strong><span style=\"color: #000000;\">We offer a </span><strong><span style=\"color: #000000;\">80,000-110,000 USD annual salary range</span></strong><span style=\"color: #000000;\"> in your preferred local currency or stable coins, complemented by </span><strong><span style=\"color: #000000;\">stock options</span></strong><span style=\"color: #000000;\">, giving you a stake in the exciting future we’re building together. </span></p>\n<p style=\"min-height: 1.7em;\"> </p>\n<p style=\"text-align: start;\"><span style=\"color: #000000;\">🌱 </span><strong><span style=\"color: #000000;\">Growth &amp; Learning<br></span></strong><span style=\"color: #000000;\">We’re committed to your development! Benefit from an annual </span><strong><span style=\"color: #000000;\">3,000 CHF learning budget</span></strong><span style=\"color: #000000;\"> that goes beyond just conferences—supporting your physical, emotional, and mental well-being too. Attend up to </span><strong><span style=\"color: #000000;\">two conferences a year</span></strong><span style=\"color: #000000;\"> to dive deeper into the Web3 space and connect with the community. Plus, jumpstart your crypto journey with our </span><strong><span style=\"color: #000000;\">$1,000 Crypto Starter Kit</span></strong><span style=\"color: #000000;\"> to explore and engage with cryptocurrencies hands-on.</span></p>\n<p style=\"text-align: start; min-height: 1.7em;\"> </p>\n<p style=\"text-align: start;\"><span style=\"color: #000000;\">🤝 </span><strong><span style=\"color: #000000;\">Collaborative Culture<br></span></strong><span style=\"color: #000000;\">Collaboration is woven into our DNA. We thrive in </span><strong><span style=\"color: #000000;\">multiplayer settings</span></strong><span style=\"color: #000000;\">, ensuring every voice contributes to our mission. Connect across teams through our </span><strong><span style=\"color: #000000;\">buddy programs, regular virtual coffee chats,</span></strong><span style=\"color: #000000;\"> and </span><strong><span style=\"color: #000000;\">biannual retreats</span></strong><span style=\"color: #000000;\">, which offer unparalleled opportunities to build stronger relationships while tackling some of the industry's most exciting challenges.</span></p>\n<p style=\"text-align: start; min-height: 1.7em;\"> </p>\n<p style=\"text-align: start;\"><span style=\"color: #000000;\">✈️ </span><strong><span style=\"color: #000000;\">Retreats in Iconic Destinations<br></span></strong><span style=\"color: #000000;\">Twice a year, we bring the entire team together for </span><strong><span style=\"color: #000000;\">all-expenses-paid retreats</span></strong><span style=\"color: #000000;\"> in inspiring locations. Past retreats have taken us to</span><strong><span style=\"color: #000000;\"> Kenya, the USA, South Korea, Switzerland, Spain, Turkey, Thailand, Dubai and Japan.</span></strong><span style=\"color: #000000;\"> Our next stop? </span><strong><span style=\"color: #000000;\">Budapest, Hungary!</span></strong><span style=\"color: #000000;\"> These retreats are designed to recharge, connect, and spark innovation.</span></p>\n<p style=\"text-align: start; min-height: 1.7em;\"> </p>\n<p style=\"text-align: start;\"><span style=\"color: #000000;\">🏡 </span><strong><span style=\"color: #000000;\">Work From Anywhere<br></span></strong><span style=\"color: #000000;\">Embrace </span><strong><span style=\"color: #000000;\">remote flexibility</span></strong><span style=\"color: #000000;\"> that empowers you to work from anywhere in the world. Prefer a coworking space? We’ve got you covered with a </span><strong><span style=\"color: #000000;\">500 CHF/month coworking budget</span></strong><span style=\"color: #000000;\">. And for those growing their families, enjoy </span><strong><span style=\"color: #000000;\">paid parental leave</span></strong><span style=\"color: #000000;\"> to ensure your personal and professional lives align seamlessly.</span></p>\n<p style=\"text-align: start; min-height: 1.7em;\"> </p>\n<p style=\"text-align: start;\"><span style=\"color: #000000;\">🗣️ </span><strong><span style=\"color: #000000;\">Radical Transparency<br></span></strong><span style=\"color: #000000;\">We practice </span><strong><span style=\"color: #000000;\">radical candor</span></strong><span style=\"color: #000000;\">, fostering an environment of open, honest feedback that helps us grow individually and as a team. Expect a culture where learning from each other is not just encouraged—it’s celebrated.</span></p>\n<p style=\"text-align: start; min-height: 1.7em;\"> </p>\n<p style=\"text-align: start;\"><strong><span style=\"color: #000000;\">💼Employment</span></strong></p>\n<p style=\"text-align: start;\"><span style=\"color: #000000;\">We offer flexibility to suit your individual needs. With the ability to provide local employment in </span><strong><span style=\"color: #000000;\">over 150 countries</span></strong><span style=\"color: #000000;\">, you’ll have access to local benefits tailored to your region. Prefer contractor status instead? That’s an option too. During the offer, we work with you to determine the best arrangement, ensuring your experience aligns with your personal and professional preferences.</span></p>\n<p style=\"text-align: start; min-height: 1.7em;\"> </p>\n<p style=\"text-align: start;\"><span style=\"color: #000000;\">✨ Curious to see what life at Chorus One is really like? Check out these videos for a behind-the-scenes look:</span></p>\n<ul style=\"\">\n<li style=\"\">\n<p><u><a href=\"https://www.youtube.com/watch?v=CYF3Uv7xiuc\" rel=\"nofollow\" target=\"_blank\"><span style=\"color: #1155cc;\">Culture at Chorus One</span></a></u></p>\n</li>\n</ul>\n<p style=\"min-height: 1.7em;\"> </p>\n<img src=\"https://remotive.com/job/track/1969270/blank.gif?source=public_api\" alt=\"\"/>","tags":"[\"Figma\",\"adobe XD\"]","pubDate":"2025-02-04T01:50:16.000Z","link":"https://remotive.com/remote-jobs/design/ui-ux-designer-1969270","slug":"ui-ux-designer-chorus-one-4057"},{"id":8447112808,"title":"Customer Experience Operations Generalist","company":"Agora","image":"https://remotive.com/job/1967174/logo","description":"<p style=\"min-height: 1.5em;\">TL;DR: <a href=\"http://Agora.xyz\" rel=\"nofollow\" target=\"_blank\">Agora.xyz</a> is seeking a highly organized, customer-oriented CX Operations Generalist to drive our customer deployment and support experience. You'll work closely with our <a href=\"https://www.linkedin.com/in/brennanfoo/\" rel=\"nofollow\" target=\"_blank\">Head of CX</a>, product/eng/design, and founder-led sales team to ensure our clients—from industry-leading DAOs to emerging projects—receive seamless and timely solutions. This role is remote and best suited for someone who thrives in a fast-paced startup, excels in project management, and is excited to help shape the future of decentralized governance.</p>\n<p style=\"min-height: 1.5em;\"> </p>\n<p style=\"min-height: 1.5em;\">Also, here's a <a href=\"https://www.loom.com/share/24cf21e5b571456689ce3659f2889fb4\" rel=\"nofollow\" target=\"_blank\">2-minute video</a> from the hiring manager.</p>\n<p style=\"min-height: 1.5em;\"> </p>\n<p style=\"min-height: 1.5em;\"><strong>About Agora</strong></p>\n<p style=\"min-height: 1.5em;\">Agora is reimagining governance for DAOs, helping the world’s leading decentralized organizations like Optimism, ENS, and Uniswap run smoothly and make impactful decisions at scale. We provide governance tools and a platform that enable DAOs to streamline operations, propose and fund initiatives, and engage as a community.</p>\n<p style=\"min-height: 1.5em;\">But that’s not where we stop. Our goal is to build deep collaboration tools for people who couldn’t care less about crypto so that one day (soon), your friends back home are using Agora without ever knowing we’re on Ethereum.</p>\n<p style=\"min-height: 1.5em;\">We’re building something that <a href=\"https://x.com/brian_armstrong/status/1774300024823828927\" rel=\"nofollow\" target=\"_blank\">the best in crypto know is valuable</a>, and financially, Agora is as healthy as early-stage startups get. We’re not <em>profitable</em> because we’re continuing to grow and reinvest in the company, but we have strong revenue and have <a href=\"https://www.linkedin.com/posts/agoraxyz_introducing-agora-the-end-to-end-governance-activity-7191470154860441601-2tKM?utm_source=share&amp;utm_medium=member_desktop\" rel=\"nofollow\" target=\"_blank\">raised funding</a> from the world’s best crypto investors.</p>\n<p style=\"min-height: 1.5em;\">This is all enabled by our talented team of ~15+ from all across the world. Our founders (<a href=\"https://www.linkedin.com/in/charliecf/\" rel=\"nofollow\" target=\"_blank\">Charlie</a>, <a href=\"https://www.linkedin.com/in/yitongzhang/\" rel=\"nofollow\" target=\"_blank\">Yitong</a>, and <a href=\"https://www.linkedin.com/in/kentfenwick/\" rel=\"nofollow\" target=\"_blank\">Kent</a>) have collectively co-founded a Canadian unicorn (Charlie); designed essential products at Coinbase (Yitong); and led tech, growth, marketing, product, at several of Canada’s top startups (Kent). Yitong is a <a href=\"https://warpcast.com/yitong\" rel=\"nofollow\" target=\"_blank\">prominent voice</a> in the crypto community, having contributed to numerous crypto initiatives over several years.</p>\n<p style=\"min-height: 1.5em;\"> </p>\n<p style=\"min-height: 1.5em;\"><strong>About the Role</strong></p>\n<div style=\"text-align: left;\"><img src=\"https://app.ashbyhq.com/api/images/user-content/d8e6ae8b-cb92-420d-9199-5d359819ffda/301a167e-4bd7-41eb-b72f-56db8db11440/CX.png\" style=\"max-width: 100%;\"></div>\n<p style=\"min-height: 1.5em;\">The Customer Experience (CX) Operations Generalist will be responsible for overseeing the customer journey after the sale, enabling our customers to implement our platform as smoothly as possible, and ensuring that customers have an exceptional experience with Agora’s governance solutions. This role combines project management, process optimization, customer support, and influencing our product roadmap to achieve smooth launches and the best possible governance for our customers’ communities.</p>\n<p style=\"min-height: 1.5em;\">You will work closely with our <a href=\"https://linkedin.com/in/brennanfoo\" rel=\"nofollow\" target=\"_blank\">Head of CX</a>, product, eng, and design, and act as the operational backbone for all things implementation &amp; customer success, driving best practices and improving our overall CX operations.</p>\n<p style=\"min-height: 1.5em;\"> </p>\n<p style=\"min-height: 1.5em;\"><strong>What you'll be doing:</strong></p>\n<ul style=\"\">\n<li style=\"\">\n<p style=\"min-height: 1.5em;\"><strong>Project Manage Deployments:</strong> Oversee the customer onboarding and deployment processes, coordinating between customers and internal teams to ensure timelines are met and issues are swiftly resolved.</p>\n</li>\n<li style=\"\">\n<p style=\"min-height: 1.5em;\"><strong>Creating and Executing Customer Success Strategies:</strong> Work together with the Head of CX to create strategies to set each customer up for success, and then executing against these strategies.</p>\n</li>\n<li style=\"\">\n<p style=\"min-height: 1.5em;\"><strong>Customer Communication:</strong> Serve as the main point of contact for customers, managing inquiries, clarifying complex topics, and ensuring consistent, high-quality communication.</p>\n</li>\n<li style=\"\">\n<p style=\"min-height: 1.5em;\"><strong>Develop &amp; Refine SOPs:</strong> Design and improve standard operating procedures for onboarding, deployments, and customer success as the 2nd person on the CX team.</p>\n</li>\n<li style=\"\">\n<p style=\"min-height: 1.5em;\"><strong>Maintain Documentation:</strong> Own and update client-facing resources and documentation, including our onboarding guides and knowledge wiki to ensure customers have access to helpful, self-serve resources.</p>\n</li>\n<li style=\"\">\n<p style=\"min-height: 1.5em;\"><strong>Influence the product roadmap &amp; collaborate cross-functionally:</strong> Work with product, engineering, design, sales, and marketing to gather feedback, address issues, and deliver improvements based on customer input.</p>\n</li>\n<li style=\"\">\n<p style=\"min-height: 1.5em;\"><strong>Design, Analyze, &amp; Report on Metrics:</strong> Track metrics like onboarding time-to-value, customer success metrics like customer satisfaction and delegate engagement, and own deployment timelines, using insights to suggest and implement improvements.</p>\n</li>\n<li style=\"\">\n<p style=\"min-height: 1.5em;\"><strong>Meeting Customers</strong>: Approximately quarterly at major conferences like DevCon, ETHDenver, Token2049</p>\n<p style=\"min-height: 1.5em;\"> </p>\n</li>\n</ul>\n<p style=\"min-height: 1.5em;\"><strong>What we're looking for:</strong></p>\n<ul style=\"\">\n<li style=\"\">\n<p style=\"min-height: 1.5em;\">You are high integrity and are comfortable handling privileged information.</p>\n</li>\n<li style=\"\">\n<p style=\"min-height: 1.5em;\">You are organized and have a knack for keeping projects on track, and are comfortable managing multiple client engagements at once.</p>\n</li>\n<li style=\"\">\n<p style=\"min-height: 1.5em;\">You are able to communicate complex ideas clearly and effectively, both to customers and internal teams.</p>\n</li>\n<li style=\"\">\n<p style=\"min-height: 1.5em;\">You genuinely enjoy helping customers succeed and go the extra mile to make their experience great.</p>\n</li>\n<li style=\"\">\n<p style=\"min-height: 1.5em;\">You have an eye for efficiency and continuously seek ways to improve processes. (And as the 2nd person on the CX team, you’ll have the opportunity to influence <em>everything</em> that we do.)</p>\n</li>\n<li style=\"\">\n<p style=\"min-height: 1.5em;\">You combine metrics, customer feedback, and your own intuition to inform decisions and improve customer outcomes.</p>\n</li>\n<li style=\"\">\n<p style=\"min-height: 1.5em;\">You are <em>tech savvy</em>. Experience with web3, blockchain, crypto, or DAOs is a huge plus; at a minimum, you should be quick to adapt to new technologies and digital tools.</p>\n</li>\n<li style=\"\">\n<p style=\"min-height: 1.5em;\">You are smart and can grok technical concepts quicker than most.</p>\n</li>\n<li style=\"\">\n<p style=\"min-height: 1.5em;\">You have enough life/career experience to project confidence when speaking with influential stakeholders.</p>\n</li>\n</ul>\n<p style=\"min-height: 1.5em;\"> </p>\n<p style=\"min-height: 1.5em;\"><strong>Why you might be excited about Agora &amp; this role:</strong></p>\n<ul style=\"\">\n<li style=\"\">\n<p style=\"min-height: 1.5em;\">You’ll be in the room with stakeholders of multi-billion dollar protocols—the most impactful people in web3.</p>\n</li>\n<li style=\"\">\n<p style=\"min-height: 1.5em;\">Agora stands at the forefront of web3 governance. We're at the bleeding edge and we aim to level up governance across the entire industry.</p>\n</li>\n<li style=\"\">\n<p style=\"min-height: 1.5em;\">We are high performers who operate with a lot of trust and autonomy. The team is ex-Coinbase, Kraken, OpenZeppelin, Ethereum Foundation, BCG, IDEO. Our engineers like <a class=\"c-link\" href=\"https://warpcast.com/andreitr.eth\" rel=\"nofollow\" target=\"_blank\">andreitr.eth</a> and <a class=\"c-link\" href=\"https://warpcast.com/frog\" rel=\"nofollow\" target=\"_blank\">frog</a> live &amp; breathe web3. Our co-founder <a href=\"https://warpcast.com/yitong\" rel=\"nofollow\" target=\"_blank\">Yitong</a> is a significant contributor to the web3 community.</p>\n</li>\n</ul>\n<p style=\"min-height: 1.5em;\"> </p>\n<p style=\"min-height: 1.5em;\"><strong>Why you might </strong><em><strong>not</strong></em><strong> be excited about us:</strong></p>\n<ul style=\"\">\n<li style=\"\">\n<p style=\"min-height: 1.5em;\">We’re still a fairly young company (founded Oct 2022), so if you like more established companies, this role isn’t for you. Projects and priorities may shift; being comfortable operating with <em>some</em> ambiguity is important.</p>\n</li>\n<li style=\"\">\n<p style=\"min-height: 1.5em;\">Everyone on the team is extremely driven and works incredibly hard to push towards our lofty ambitions.</p>\n</li>\n<li style=\"\">\n<p style=\"min-height: 1.5em;\">Agora is an unabashedly pro-startup, pro-crypto organization. If that’s not your thing, this isn’t the place for you.</p>\n</li>\n</ul>\n<p style=\"min-height: 1.5em;\"> </p>\n<p style=\"min-height: 1.5em;\"><strong>Additional details</strong></p>\n<p style=\"min-height: 1.5em;\"><em>Please note this role is only open to candidates that are legally authorized to work where they reside. Due to the remote nature of the role, Agora does not currently sponsor candidates for visas or work authorizations/permits and does not currently support the transfer of visas or work authorizations/permits from prior employers to Agora.</em></p>\n<p style=\"min-height: 1.5em;\"> </p>\n<p style=\"min-height: 1.5em;\"><strong>Compensation</strong></p>\n<p style=\"min-height: 1.5em;\">This role comes with a competitive salary, stock options, you can take any PTO you need, anytime you need, and employee benefits including healthcare.</p>\n<p style=\"min-height: 1.5em;\"> </p>\n<p style=\"min-height: 1.5em;\"><strong>Location</strong></p>\n<p style=\"min-height: 1.5em;\">Agora is a remote, distributed team. This role is totally remote but will require occasional travel for IRL meetings and events. (We typically meet as a team at least 2x a year for ~3-5 days, and this role will also attend conferences (~3/yr) to meet with customers. The right candidate should be excited about this!)</p>\n<p style=\"min-height: 1.5em;\">We are excited about candidates globally; however, please note that our team works during U.S. friendly working hours.</p>\n<p style=\"min-height: 1.5em;\"> </p>\n<p style=\"min-height: 1.5em;\"><strong>Equal Opportunity Employer</strong></p>\n<p style=\"min-height: 1.5em;\">Agora is an equal opportunity employer dedicated to building an inclusive and diverse workforce. All employment is decided on the basis of qualifications, merit, and business need. We strongly encourage applications who are members of underrepresented communities to apply.</p>\n<p style=\"min-height: 1.5em;\">#LI-Remote</p>\n<img src=\"https://remotive.com/job/track/1967174/blank.gif?source=public_api\" alt=\"\"/>","tags":"[\"crypto\",\"go\",\"blockchain\",\"project management\",\"CX\",\"documentation\",\"healthcare\",\"Ethereum\",\"onboarding\",\"startup\",\"backbone\",\"travel\"]","pubDate":"2025-02-03T13:52:21.000Z","link":"https://remotive.com/remote-jobs/customer-support/customer-experience-operations-generalist-1967174","slug":"customer-experience-operations-generalist-agora-2241"},{"id":4706108428,"title":"Customer Lifecycle Marketing Manager","company":"Owner","image":"https://avatars.githubusercontent.com/u/87661266?s=200&v=4","description":"<div><span style=\"font-size: 18px\">👋&nbsp;</span><b><span style=\"font-size: 18px\">About&nbsp;</span></b><a href=\"http://owner.com/\"><b><span style=\"font-size: 18px\">Owner.com</span></b></a></div><div>Owner is the all-in-one platform that restaurants use to succeed online.</div><div><br></div><div>Thousands of restaurant owners use our tools to build their website, drive online orders, create their own branded app, manage their customer relationships, and set up marketing automations.</div><div><br></div><div>You can think of it as Shopify meets HubSpot, but specifically for restaurants.</div><div><br></div><div>Learn more about the problems we are solving for our customers&nbsp;<a href=\"https://www.owner.com/our-story\">here</a>.</div><div><br></div><div><span style=\"font-size: 18px\">🌎&nbsp;</span><b><span style=\"font-size: 18px\">Our vision</span></b></div><div>We’re starting by helping independent restaurants succeed online.</div><div><br></div><div>But it’s not just restaurants that need our help. Most local businesses are struggling with these same problems. Huge technology corporations are taking their customers, bleeding their profits, and making it hard for them to survive.</div><div>Once we nail the solution for restaurants&nbsp;–&nbsp;we’ll scale it into every other local business type.</div><div><br></div><div>In the future we envision, tens of millions of local business owners will use our technology to succeed in the digital age.</div><div><br></div><div><span style=\"font-size: 18px\">🚀&nbsp;</span><b><span style=\"font-size: 18px\">Our traction</span></b></div><div>In just over 3 years we've generated&nbsp;tens of millions in revenue, served millions of guests, and processed hundreds of millions of online orders.</div><div><br></div><div>More importantly, we’ve helped thousands of restaurant owners save their businesses - and not&nbsp; only survive, but thrive.</div><div><br></div><div><span style=\"font-size: 18px\">⭐&nbsp;</span><b><span style=\"font-size: 18px\">Our team</span></b></div><div>Our team grew from under 100 to nearly 200 talented people in 2024. We’ve got top talent from the most successful companies in SMB software, including: Shopify, HubSpot, DoorDash, ServiceTitan, Rappi, Faire and Stripe.</div><div><br></div><div>We’ll be scaling even faster in 2025 to keep pace with our customer growth.</div><div><br></div><div><span style=\"font-size: 18px\">🌆&nbsp;</span><b><span style=\"font-size: 18px\">Where we work</span></b></div><div>Owner is a remote-first, global company headquartered in San Francisco, with a sales hub in Toronto. For a few of our roles we prioritize in-person collaboration at one of our office locations. Most of our employees are distributed throughout the globe. Please review the role description and discuss with your recruiter for more details on location!</div><div><br></div><div><span style=\"font-size: 16px;\">🔍</span><b style=\"font-size: 16px;\"> Why we’re looking for you</b></div><div><br></div><div><span style=\"font-size: 16px;\">Owner is on a mission to arm restaurants to fight their goliaths. We are giving them tools (first-party online ordering, dedicated mobile app, advanced omni-channel marketing) that previously took teams to run and could really only be perfected by the big national brands. We are their CMO in a box.</span></div><div><br></div><div><span style=\"font-size: 16px;\">We are seeking a visionary, data-driven, and customer-obsessed Guest Lifecycle Marketing Manager. This person will help thousands of restaurants drive customer engagement, loyalty, and lifetime value through our marketing channels. This role will lead the development, testing and deployment of all guest-facing lifecycle marketing campaigns. You will partner deeply with the product development team to drive new features and capabilities into our CRM and marketing automation stack. Success is driving millions and eventually billions in revenue to our restaurants.</span></div><div><br></div><div><span style=\"font-size: 16px;\">We are looking for a veteran of restaurant marketing to work inside the product org along side the team building our self-driving CRM engine. We want to give thousands of local restaurants the expertise on lifecycle marketing only big national brands have access to.</span></div><div><br></div><div><span style=\"font-size: 16px;\">For the right candidate, we are open to elevating this position to a senior role. However, factors such as years of experience, background, restaurant domain expertise, and performance throughout the interview process will ultimately determine the role level as we near the final stages.</span></div><div><br></div><div><span style=\"font-size: 16px;\">For this particular role we are focused on candidates located in the San Francisco Bay Area. We are a remote-first company with a home base in SF, where our team comes together for periodic in-person collaboration (most local teammates opt to come in on Tuesdays/Thursdays). For more details chat with your recruiter!</span></div><div><span style=\"font-size: 16px;\">🔍</span><b style=\"font-size: 16px;\"> Why we’re looking for you</b></div><div><br></div><div><span style=\"font-size: 16px;\">Owner is on a mission to arm restaurants to fight their goliaths. We are giving them tools (first-party online ordering, dedicated mobile app, advanced omni-channel marketing) that previously took teams to run and could really only be perfected by the big national brands. We are their CMO in a box.</span></div><div><br></div><div><span style=\"font-size: 16px;\">We are seeking a visionary, data-driven, and customer-obsessed Guest Lifecycle Marketing Manager. This person will help thousands of restaurants drive customer engagement, loyalty, and lifetime value through our marketing channels. This role will lead the development, testing and deployment of all guest-facing lifecycle marketing campaigns. You will partner deeply with the product development team to drive new features and capabilities into our CRM and marketing automation stack. Success is driving millions and eventually billions in revenue to our restaurants.</span></div><div><br></div><div><span style=\"font-size: 16px;\">We are looking for a veteran of restaurant marketing to work inside the product org along side the team building our self-driving CRM engine. We want to give thousands of local restaurants the expertise on lifecycle marketing only big national brands have access to.</span></div><div><br></div><div><span style=\"font-size: 16px;\">For the right candidate, we are open to elevating this position to a senior role. However, factors such as years of experience, background, restaurant domain expertise, and performance throughout the interview process will ultimately determine the role level as we near the final stages.</span></div><div><br></div><div><span style=\"font-size: 16px;\">For this particular role we are focused on candidates located in the San Francisco Bay Area. We are a remote-first company with a home base in SF, where our team comes together for periodic in-person collaboration (most local teammates opt to come in on Tuesdays/Thursdays). For more details chat with your recruiter!</span></div><h3>💥 The impact you will have</h3><li>Develop and execute our guest lifecycle marketing strategy across thousands of local restaurants to increase engagement, retention, and customer lifetime value.</li><li>Oversee personalized multi-channel campaigns, including email, SMS, push, in-app and and in-store experiences.</li><li>Continuously create, test and optimize calendar and event driven campaigns driving millions in sales for our restaurants.</li><li>Scale and optimize our approach to discounts, coupons &amp; loyalty programs ensuring independent restaurants drive get huge ROI.</li><li>Very strong command of design and copy writing to create campaigns both directly and through guiding a team.</li><li>Analyze customer data to identify insights, optimize segmentation, and enhance personalization efforts.</li><li>Monitor key performance metrics (e.g., retention rates, customer lifetime value, ROI) and present actionable insights to leadership.</li><li>Collaborate with analytics and MarTech teams to build predictive models and identify gaps in data architecture.</li><li>Act as the embedded expert that both runs marketing on behalf of our restaurants, but also feeds-back to the product org on how our embedded marketing suite needs to evolve.</li><li>Start as a scrappy team of one (with agency/contractor help) - but be ready to scale the team as we prove our the value for our restaurants.</li><li>Be the voice of industry marketing experience while moving in a fast paced, flexible startup environment.</li><h3>🤝 Who you’ll work with</h3><li>You will report to our Chief Product Officer </li><li>You will collaborate closely with our Product, Engineering and Marketing Team </li><h3>✅ What we’re looking for</h3><li>8+ years of experience in CRM, lifecycle marketing, loyalty programs, or digital marketing, with 3+ years in a leadership role</li><li>Experience managing the CRM, architecting campaigns, driving personalization to achieve extraordinary business outcomes.</li><li>Experience managing large-scale databases (10M+), customer segmentation, and multi-channel campaign execution.</li><li>Deep knowledge key marketing levers: couponing and discounting, loyalty programs, specials and bundling.</li><li>Expertise with CRM tools and platforms (e.g., Adobe Campaign, Braze, Salesforce) and analytics tools (e.g., Tableau, SQL).</li><li>Analytical and results oriented while having an incredibly high bar for craft and quality of guest experience.</li><h3>🏆 Pay and benefits</h3><li>The estimated starting salary range for this role is $101,000k - $170,000k USD plus a generous pre-IPO equity package. Actual pay will be determined based on several factors such as past experience and qualifications, geographic location, and other job-related factors permitted by law.</li><li>Other benefits include comprehensive health coverage, monthly lifestyle stipend, unlimited/flexible PTO - plus extra fun perks!</li><div><br></div><div><br></div><div><b><span style=\"font-size: 10px\">🚩 Notice - Employment Scams</span></b></div><div><span style=\"font-size: 10px\">Communication from our team regarding job opportunities will only be made by an Owner employee with an @owner.com email address.</span></div><div><span style=\"font-size: 10px\">We do not conduct interviews over email or chat platforms, and we will never ask you to provide personal or financial information such as your mailing address, social security number, credit card numbers or banking information.&nbsp; If you believe you are being contacted by scammer, please mark the communication as \"phishing\" or “spam” and do not respond.</span></div><div><span style=\"font-size: 18px\">👋&nbsp;</span><b><span style=\"font-size: 18px\">About&nbsp;</span></b><a href=\"http://owner.com/\"><b><span style=\"font-size: 18px\">Owner.com</span></b></a></div><div>Owner is the all-in-one platform that restaurants use to succeed online.</div><div><br></div><div>Thousands of restaurant owners use our tools to build their website, drive online orders, create their own branded app, manage their customer relationships, and set up marketing automations.</div><div><br></div><div>You can think of it as Shopify meets HubSpot, but specifically for restaurants.</div><div><br></div><div>Learn more about the problems we are solving for our customers&nbsp;<a href=\"https://www.owner.com/our-story\">here</a>.</div><div><br></div><div><span style=\"font-size: 18px\">🌎&nbsp;</span><b><span style=\"font-size: 18px\">Our vision</span></b></div><div>We’re starting by helping independent restaurants succeed online.</div><div><br></div><div>But it’s not just restaurants that need our help. Most local businesses are struggling with these same problems. Huge technology corporations are taking their customers, bleeding their profits, and making it hard for them to survive.</div><div>Once we nail the solution for restaurants&nbsp;–&nbsp;we’ll scale it into every other local business type.</div><div><br></div><div>In the future we envision, tens of millions of local business owners will use our technology to succeed in the digital age.</div><div><br></div><div><span style=\"font-size: 18px\">🚀&nbsp;</span><b><span style=\"font-size: 18px\">Our traction</span></b></div><div>In just over 3 years we've generated&nbsp;tens of millions in revenue, served millions of guests, and processed hundreds of millions of online orders.</div><div><br></div><div>More importantly, we’ve helped thousands of restaurant owners save their businesses - and not&nbsp; only survive, but thrive.</div><div><br></div><div><span style=\"font-size: 18px\">⭐&nbsp;</span><b><span style=\"font-size: 18px\">Our team</span></b></div><div>Our team grew from under 100 to nearly 200 talented people in 2024. We’ve got top talent from the most successful companies in SMB software, including: Shopify, HubSpot, DoorDash, ServiceTitan, Rappi, Faire and Stripe.</div><div><br></div><div>We’ll be scaling even faster in 2025 to keep pace with our customer growth.</div><div><br></div><div><span style=\"font-size: 18px\">🌆&nbsp;</span><b><span style=\"font-size: 18px\">Where we work</span></b></div><div>Owner is a remote-first, global company headquartered in San Francisco, with a sales hub in Toronto. For a few of our roles we prioritize in-person collaboration at one of our office locations. Most of our employees are distributed throughout the globe. Please review the role description and discuss with your recruiter for more details on location!</div>","tags":"[\"engineering\",\"database\"]","pubDate":"2025-01-31T21:59:33.423Z","link":"https://jobs.lever.co/owner/ac51e9d3-c2a0-4ad7-9259-9231e0113aef","slug":"customer-lifecycle-marketing-manager-owner-7518"}]