[{"id":4416499919,"title":"Senior Fullstack Developer (S)","company":"Blue Coding","image":"https://media.licdn.com/dms/image/C4D0BAQHlK67hgnhzQw/company-logo_200_200/0/1631346154820?e=2147483647&v=beta&t=_R2Ssj7L_f4xqmSCcq0nOLCyCz0QN2lFnHssxxhj3YY","description":"<div><i style=\"font-size: 18px\">Do you want to earn a salary in USD?&nbsp;</i></div><div><i style=\"font-size: 18px\">Would you like to work from wherever you want?</i></div><div><i style=\"font-size: 18px\">Would you like to be a part of the leading next-gen software developers?&nbsp;</i></div><div><br></div><div><b style=\"font-size: 24px\">Hi, you finally found us!</b><span style=\"font-size: 24px\">&nbsp;</span></div><div><br></div><div><b style=\"font-size: 24px\">Why work at Blue Coding?</b><span style=\"font-size: 24px\">&nbsp;</span></div><div><br></div><div>At Blue Coding we specialize in hiring excellent developers and amazing people from all over Latin America and other parts of the world. For the past 10 years, we’ve helped cutting-edge companies in the United States and Canada -both large and small, build great development teams and develop great products. Online shops, digital agencies, SaaS providers, and software consulting firms are a few of our clients. Our team of over 100 engineers is distributed in more than 10 countries across the Americas. We are a fully remote company working with a wide array of technologies and have expertise in every stage of the software development process.&nbsp;&nbsp;</div><div><br></div><div>Our team is highly connected, united, and culturally diverse, and our collaborators are involved in many initiatives around the world, from wildlife preservation to volunteering at local charities. We also participate in group activities like movie nights, trivia, and meme competitions. We stand for honesty, fairness, respect, efficiency, hard work, and cooperation.</div><div><br></div><div><b style=\"font-size: 13pt;\">What are we looking for?</b></div><div>In this opportunity, we are looking for a Software Developer to work with one of our foreign clients, a tech company known for its expertise in digital innovation and product development. They offer various services, including user experience design, software development, and strategic consulting. Specializing in creating impactful digital experiences, collaborate with clients to bring innovative solutions to the market. They help the mid-market businesses move faster and smarter with AI, driving operational efficiency and unlocking new capabilities</div><div><br></div><div>If you are independent, a great communicator, a problem solver, and have a strong attention to detail, this is a great fit for you! Our jobs are fully remote – as long as you have the skills and can get the work done well, you can work anywhere in the listed countries you want.</div><div>So if you have the skills and can get the job done, join us and work from anywhere you want!</div><div><br></div><h3>Here are some of the exciting day-to-day challenges you will face in this role:</h3><li>Evaluate a product experience holistically, from high-level product architecture to the specifics of individual features and how those features fit together</li><li>Contribute toward determining short and long-term technical needs, objectives, and approaches to projects</li><li>Take on various tasks, development-related or not, to support different processes and needs for your project teams</li><li>Collaborate directly every day with designers, developers, engagement managers, and clients</li><li>Balance time between directly working on development and supervising/maintaining the quality of work from other contributors on your team</li>,<h3>You will shine if you have these:</h3><li>Full-stack developer proficient with a variety of languages and tools. Ex: TypeScript/JavaScript (both in-browser and server-side with Node.js, React, TypeScript, Next.js/Remix, Python, etc.)</li><li>Familiarity with AI concepts such as LLMs, agentic patterns, vector databases, RAG, and applied ML</li><li>Strong hands-on software development experience, ideally with experience in a client services or agency environment</li><li>Demonstrated practice with test-driven/behavior-driven product development</li><li>Proven experience leading teams and mentoring developers</li><li>Understanding of integrated development practices and experience directly collaborating with design teams</li><li>Experience solving problems across multiple technology platforms (eg, browsers, applications, operating systems, mobile and connected devices, other hardware)</li><li>Strong communication, client services, and interpersonal skills</li>,<h3>Here are some of the perks we offer you:</h3><li>Salary in USD</li><li>Long-term</li><li>Flexible schedule (within US Time zones)</li><li>100% Remote</li><div><b style=\"font-size: 24px\">Hey, you are still here!</b><span style=\"font-size: 24px\">&nbsp;</span></div><div><br></div><div>So, let us ask a few questions. Do you like working in a friendly environment? Are you fluent in English? Do you have a strong work ethic, are detail-oriented and have an ownership mentality? And most importantly do you love music and puppies? If so, then what are you waiting for? Come join our team and become part of this awesome company! We will be expecting you.</div>","tags":"[\"javascript\",\"typescript\",\"database\"]","pubDate":"2025-05-07T20:28:10.469Z","link":"https://jobs.lever.co/bluecoding/1181740a-36dd-41bb-9007-ef40c55d68cb","slug":"senior-fullstack-developer-s-blue-coding-1264"},{"id":5546134969,"title":"Renewal Risk Engineer [Management and Professional Liability] (West)","company":"Counterpart","image":"https://media.licdn.com/dms/image/v2/D560BAQEtAXn0ryOTBw/company-logo_200_200/company-logo_200_200/0/1694785555271/yourcounterpart_logo?e=1744243200&v=beta&t=-BEjbQP7PMMfAC5PtCYEgvJk4MuWZ4Bfzh54loGzpwo","description":"&lt;p&gt;&lt;strong&gt;RENEWAL RISK ENGINEER, [Management and Professional Liability] (West)&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;Counterpart believes in small businesses and is dedicated to helping them do more with less risk. By pairing leading insurance experts with cutting-edge technology, Counterpart empowers small business owners to grow with confidence. Exceptional underwriters, trusted insurance brokers, and prominent insurance carriers come together on the Counterpart platform to support small businesses by providing AI-driven management and professional liability underwriting and claims services. That’s where you come in…&lt;/p&gt;\n&lt;p&gt;As a member of the risk engineering team,you will play a critical role in underwriting and managing a renewal book of Management Liability (ML) and Professional Liability (PL) business. Your focus will be on evaluating, pricing, and binding renewals in accordance with our guidelines while ensuring profitable growth through thoughtful risk selection and strong broker relationships. You will collaborate with engineering, design, data, and operations teams to deliver and enhance our product offerings. This is a production-focused role responsible for maintaining and expanding relationships with wholesale brokers in your assigned territory.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;AS A RENEWAL FOCUSED RISK ENGINEER, YOU WILL:&lt;/strong&gt;&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;Underwrite renewal business across ML and PL product lines in accordance with company guidelines and performance targets.&lt;/li&gt;\n&lt;li&gt;Evaluate risk exposures, loss history, and operational data to determine appropriate pricing, coverage, and terms.&lt;/li&gt;\n&lt;li&gt;Provide quick and competitive quotes in alignment with distribution and market strategies.&lt;/li&gt;\n&lt;li&gt;Serve as a trusted partner to wholesale brokers by offering thoughtful underwriting guidance and responsive communication.&lt;/li&gt;\n&lt;li&gt;Maintain and expand a portfolio of high-performing broker relationships to drive retention and profitable growth.&lt;/li&gt;\n&lt;li&gt;Represent Counterpart at broker meetings, industry conferences, and networking events.&lt;/li&gt;\n&lt;li&gt;Work closely with fellow Risk Engineers and product teams to refine guidelines, pricing models, and coverage forms.&lt;/li&gt;\n&lt;li&gt;Identify market feedback and recommend enhancements to improve product offerings and underwriting strategy.&lt;/li&gt;\n&lt;li&gt;Bind renewal accounts through consistent engagement with brokers and effective management of the renewal lifecycle.&lt;/li&gt;\n&lt;li&gt;Maintain accurate and compliant documentation for all underwriting decisions.&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;&lt;strong&gt;WE LOOK FOR TEAMMATES WHO HAVE:&lt;/strong&gt;&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;4-8 years of underwriting experience in Management Liability and/or Professional Liability, ideally with a focus on renewals within the wholesale distribution channel.&lt;/li&gt;\n&lt;li&gt;Demonstrated success in building and maintaining broker relationships.&lt;/li&gt;\n&lt;li&gt;Expertise in specialty liability products including policy forms, rating procedures, and coverage structures.&lt;/li&gt;\n&lt;li&gt;Strong analytical, organizational, and communication skills.&lt;/li&gt;\n&lt;li&gt;Confidence in presenting and discussing underwriting decisions with internal and external stakeholders.&lt;/li&gt;\n&lt;li&gt;Proficiency with modern underwriting tools and systems.&lt;/li&gt;\n&lt;li&gt;Bachelor’s degree preferred, with a minimum of 4 years of relevant work experience.&lt;/li&gt;\n&lt;li&gt;Professional designations (e.g., RPLU, CPCU) are a plus.&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;&lt;strong&gt;WHO YOU WILL WORK WITH:&amp;nbsp;&lt;/strong&gt;&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;&lt;strong&gt;Tanner Hackett, CEO:&lt;/strong&gt; Having founded two other major startups, including Button and Lazada, Tanner now spends his time focused on mental health through his philanthropy,&lt;a href=&quot;http://openminded.org&quot;&gt; Openminded.org&lt;/a&gt;, in addition to reading, surfing, yoga, and enjoying the outdoors.&lt;/li&gt;\n&lt;li&gt;&lt;strong&gt;Satwik Mysore, Risk Engineer Territory Lead: After graduating with an actuarial science degree, Satwik has spent most of his career at Travelers, where he built one of the largest and most profitable management liability books by forming strong broker relationships.&lt;/strong&gt;&lt;/li&gt;\n&lt;li&gt;&lt;strong&gt;Brad Bahler, Risk Engineer Territory Lead:&lt;/strong&gt; Brad has over a decade of experience in management liability underwriting. He managed one of the largest books of small business management liability risks at Travelers, where he was known for his deep understanding of coverage, outstanding submission response times, and boundless enthusiasm for the space.&lt;/li&gt;\n&lt;li&gt;&lt;strong&gt;Jake O’Donnell, Risk Engineer Territory Lead: &lt;/strong&gt;Jake started his insurance career at Chubb, where he was able to develop and grow a profitable book of private-for-profit and non-profit management liability business. Jake is known for his exceptional service to industry brokers and his extensive knowledge of management liability. Jake also is a CPCU designation recipient.&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;&lt;strong&gt;WHAT WE OFFER&lt;/strong&gt;&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;&lt;strong&gt;Fully remote workplace&lt;/strong&gt;&lt;/li&gt;\n&lt;li&gt;&lt;strong&gt;Unlimited Vacation&lt;/strong&gt;: We offer flexible time off, allowing you to take time when you need it.&lt;/li&gt;\n&lt;li&gt;&lt;strong&gt;Work from Anywhere&lt;/strong&gt;: Counterpart is a fully distributed company, meaning there is no office. We allow employees to work from wherever they do their best work, and invite the team to meet in person a couple times per year.&lt;/li&gt;\n&lt;li&gt;&lt;strong&gt;Stock Options&amp;nbsp;&lt;/strong&gt;&lt;/li&gt;\n&lt;li&gt;&lt;strong&gt;Health, Dental, and Vision Coverage&lt;/strong&gt;&lt;/li&gt;\n&lt;li&gt;&lt;strong&gt;401(k) Retirement Plan&lt;/strong&gt;&lt;/li&gt;\n&lt;li&gt;&lt;strong&gt;Parental Leave&lt;/strong&gt;&lt;/li&gt;\n&lt;li&gt;&lt;strong&gt;Home Office Allowance&lt;/strong&gt;: &lt;strong&gt;to set up your home office&lt;/strong&gt; with the necessary equipment and accessories.&lt;/li&gt;\n&lt;li&gt;&lt;strong&gt;Wellness Stipend&lt;/strong&gt;&lt;/li&gt;\n&lt;li&gt;&lt;strong&gt;Book stipend&lt;/strong&gt;&lt;/li&gt;\n&lt;li&gt;&lt;strong&gt;Professional Development Reimbursement&lt;/strong&gt;&lt;/li&gt;\n&lt;li&gt;&lt;strong&gt;No working birthdays&lt;/strong&gt;: &lt;strong&gt;Take your birthday off&lt;/strong&gt;, giving you the opportunity to relax, enjoy your special day, and spend time with loved ones.&lt;/li&gt;\n&lt;li&gt;&lt;strong&gt;Charitable Contribution Matching&lt;/strong&gt;&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;&lt;strong&gt;COUNTERPART&#39;S VALUES&lt;/strong&gt;&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;&lt;strong&gt;Conjoin Expectations&lt;/strong&gt; - it is the cornerstone of autonomy. Ensure you are aware of what is expected of you and clearly articulate what you expect of others.&amp;nbsp;&lt;/li&gt;\n&lt;li&gt;&lt;strong&gt;Speak Boldly &amp;amp; Honestly&lt;/strong&gt; - the only failure is not learning from mistakes. Don’t cheat yourself and your colleagues of the feedback needed when&amp;nbsp; expectations aren’t being met.&amp;nbsp;&lt;/li&gt;\n&lt;li&gt;&lt;strong&gt;Be Entrepreneurial&lt;/strong&gt; - control your own destiny.&amp;nbsp; Embrace action over perfection while navigating any obstacles that stand in the way of your ultimate goal.&amp;nbsp;&lt;/li&gt;\n&lt;li&gt;&lt;strong&gt;Practice Omotenashi&lt;/strong&gt; (“selfless hospitality”) - trust will follow.&amp;nbsp; Consider every interaction with internal and external partners an opportunity to develop trust by going above and beyond what is expected.&amp;nbsp;&lt;/li&gt;\n&lt;li&gt;&lt;strong&gt;Hold Nothing As Sacred&lt;/strong&gt; - create routines but modify them routinely.&lt;strong&gt;&amp;nbsp; &lt;/strong&gt;Take the time to reflect on where the business is today, where it needs to&amp;nbsp; go, and what you have to change in order to get there.&amp;nbsp;&lt;/li&gt;\n&lt;li&gt;&lt;strong&gt;Prioritize Wellness&lt;/strong&gt; - some things should never be sacrificed. We create an environment that stretches everyone to grow and improve, which is fulfilling, but is only one part of a meaningful life.&lt;br&gt;&lt;br&gt;&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;Our estimated pay range for this role is $110,000 to $125,000. Base salary is determined by a variety of factors, including but not limited to, market data, location, internal equitability, and experience.&lt;/p&gt;\n&lt;p&gt;We are committed to being a welcoming and inclusive workplace for everyone, and we are intentional about making sure people feel respected, supported and connected at work—regardless of who you are or where you come from. We value and celebrate our differences and we believe being open about who we are allows us to do the best work of our lives.&amp;nbsp;&lt;/p&gt;\n&lt;p&gt;We are an Equal Opportunity Employer. We do not discriminate against qualified applicants or employees on the basis of race, color, religion, gender identity, sex, sexual preference, sexual identity, pregnancy, national origin, ancestry, citizenship, age, marital status, physical disability, mental disability, medical condition, military status, or any other characteristic protected by federal, state, or local law, rule, or regulation.&amp;nbsp;&lt;/p&gt;\n&lt;p&gt;&lt;br&gt;&lt;br&gt;&lt;/p&gt;","tags":"[\"management\",\"engineering\"]","pubDate":"2025-05-07T20:14:35.000Z","link":"https://job-boards.greenhouse.io/counterpart/jobs/4562352005","slug":"renewal-risk-engineer-management-and-professional-liability-west-counterpart-3383"},{"id":3998420863,"title":"Head of Customer Support and Operations","company":"Empower","image":"https://lever-client-logos.s3.us-west-2.amazonaws.com/2e1a369c-b58f-41ac-8d86-4b0a77695e68-1687915522032.png","description":"<p style=\"min-height:1.5em\"><strong>EMPOWER OVERVIEW</strong></p><p style=\"min-height:1.5em\"><a target=\"_blank\" rel=\"noopener noreferrer nofollow\" href=\"http://empower.me/\">Empower</a> is shaking up an outdated financial system by providing real opportunity for our customers: the opportunity to get the cash they need, to access fair credit, and to change their financial story. Today, we’re helping millions of people find financial security through machine learning models that evaluate creditworthiness using a more inclusive lens and mobile-first products: Cash Advance, Thrive line of credit, and Petal credit cards. Tomorrow? Creating even more financial paths for our customers (and their wallets) to succeed.</p><p style=\"min-height:1.5em\">This year, Empower ranked #65 on Inc. 5000’s Fastest-Growing Private Companies list — our third year in a row cracking the top 100 — and was named by Forbes as one of the 25 Next Billion-Dollar Startups for 2024. Empower was also featured by Forbes on America’s Best Startup Employers list in 2023, and our Thrive line of credit product was named by Fast Company as one of 2022’s Next Big Things in Tech.</p><p style=\"min-height:1.5em\">Empower is backed by Sequoia Capital, Blisce, and Icon Ventures. Ready to grow your impact and accelerate your career? Take a look at our open roles — we can’t wait to meet you.</p><p style=\"min-height:1.5em\"></p><h2>The Opportunity: Head of Customer Support and Operations</h2><p style=\"min-height:1.5em\">Empower is seeking a strategic Head of Customer Support and Operations to lead our front-line support and back-office teams, reporting directly to the CFO. In this critical leadership role, you’ll be responsible for designing and executing scalable, data-driven support and operations strategies that elevate the customer experience while ensuring efficiency, compliance, and alignment with company goals. You'll partner cross-functionally with teams like Product and Compliance, oversee outsourced vendors, and drive continuous improvement through process optimization and innovative use of technology—including AI. Our ideal candidate is a seasoned operations leader with a strong track record in customer-centric environments, particularly in B2C fintech or financial services.<br /><br />Empower is a remote-first company. We drive connectivity through regular company offsites. Travel for company offsites is expected at a minimum 2 times a year. For this role, you will also be expected to travel to the Philippines at a minimum of 2 times a year.</p><p style=\"min-height:1.5em\"></p><h2>How You’ll Make an Impact</h2><ul style=\"min-height:1.5em\"><li><p style=\"min-height:1.5em\">Lead, develop, and manage both front- and back-of-house support and operations teams, ensuring seamless integration to deliver an exceptional customer experience</p></li><li><p style=\"min-height:1.5em\">Define and execute customer support and operations strategies aligned with company goals, partnering closely with cross-functional leaders in Product, Compliance, and beyond</p></li><li><p style=\"min-height:1.5em\">Continuously assess and optimize operational processes to drive efficiency, scalability, and quality of service</p></li><li><p style=\"min-height:1.5em\">Track key customer satisfaction metrics and implement initiatives to improve experience, responsiveness, and resolution times</p></li><li><p style=\"min-height:1.5em\">Leverage technology—including AI and automation—to enhance service delivery and streamline operations</p></li><li><p style=\"min-height:1.5em\">Cultivate a high-performance culture centered on collaboration, accountability, and continuous improvement</p></li><li><p style=\"min-height:1.5em\">Oversee outsourced support vendors, ensuring contractual and SLA compliance while identifying areas for enhancement or transition</p></li><li><p style=\"min-height:1.5em\">Proactively identify operational risks and ensure all customer-facing processes align with regulatory requirements and internal standards</p></li></ul><h2><br />Why You’re a Great Fit</h2><ul style=\"min-height:1.5em\"><li><p style=\"min-height:1.5em\">8+ years of experience in operations leadership, ideally within B2C financial services or fintech</p></li><li><p style=\"min-height:1.5em\">Demonstrated success in managing both internal teams (front-line support and back-office operations) and external vendors or outsourced partners</p></li><li><p style=\"min-height:1.5em\">Proven ability to design and execute customer support strategies, with strengths in process optimization and technology-led transformation (including AI implementation)</p></li><li><p style=\"min-height:1.5em\">Data-driven decision maker with expertise in defining, tracking, and optimizing key performance indicators</p></li><li><p style=\"min-height:1.5em\">Skilled at building strong cross-functional relationships, especially with Product and Compliance</p></li><li><p style=\"min-height:1.5em\">Exceptional communication, leadership, and stakeholder management skills, with a customer-first mindset and a data-informed approach</p><p style=\"min-height:1.5em\"></p></li></ul><h2>Our Interview Process</h2><ol style=\"min-height:1.5em\"><li><p style=\"min-height:1.5em\"><strong>Initial Recruiter Call:</strong> A conversation to learn about your experience and what you're looking for in your next role.</p></li><li><p style=\"min-height:1.5em\"><strong>Hiring Manager Interview:</strong> A deeper discussion about your background and the Head of Customer Support and Operations opportunity.</p></li><li><p style=\"min-height:1.5em\"><strong>Skills Panel:</strong> Meet with Empower team members to discuss your expertise and problem-solving approach.</p></li><li><p style=\"min-height:1.5em\"><strong>Leadership Conversation:</strong> A final conversation with our CEO to discuss how you'll contribute to Empower's mission (and how we can help you achieve your career goals along the way).<br /></p></li></ol><p style=\"min-height:1.5em\"><strong>Don't meet every qualification? If you're excited about this challenge and driven to innovate, we still want to hear from you!</strong></p><p style=\"min-height:1.5em\"></p><h2>What You'll Get at Empower</h2><ul style=\"min-height:1.5em\"><li><p style=\"min-height:1.5em\"><strong>Meaningful Ownership:</strong> Competitive salary and generous equity in a profitable, fast growing company.</p></li><li><p style=\"min-height:1.5em\"><strong>Complete Support:</strong> 100% coverage for medical, dental, vision, and life insurance, plus a generous WFH reimbursement.</p></li><li><p style=\"min-height:1.5em\"><strong>High-Impact Teams:</strong> The chance to thrive in a small, focused team where your contributions directly shape outcomes for our business and customers.</p></li><li><p style=\"min-height:1.5em\"><strong>Remote First:</strong> A virtual first environment built on trust and outcomes.</p></li><li><p style=\"min-height:1.5em\"><strong>Team Connection:</strong> Twice-yearly company onsites where we come together to connect, learn, and build for the future (our last few have been in San Diego, Vail, and Flagstaff)!</p></li><li><p style=\"min-height:1.5em\"><strong>Growth Path:</strong> Ongoing opportunities for development in a dynamic, supportive, and creative environment.</p></li></ul><p style=\"min-height:1.5em\"></p><h2>The Empower Way</h2><p style=\"min-height:1.5em\">The Empower Way is one where bold ambition meets an owner mindset, where open dialogue and spirited debate are encouraged, and where everyone works together to put our customers first. We believe diverse voices lead to the best ideas, and we foster an environment where every individual is valued, heard, and supported as part of one unified team working to change lives and build a more inclusive future.</p><p style=\"min-height:1.5em\"><strong>If that sounds like you, join us and be part of a team that's helping millions of people reshape their financial futures.</strong></p>","tags":"[\"management\",\"b2c\"]","pubDate":"2025-05-07T17:13:25.982Z","link":"https://jobs.ashbyhq.com/empower%20finance/8fa96217-1a47-462e-a691-abb950b1f693","slug":"head-of-customer-support-and-operations-empower-9152"},{"id":7107654713,"title":"A Players - Spontaneous Application","company":"Paradox","image":"https://cdn.prod.website-files.com/63ef5a85ffdee87c27e6573a/66e0418f9e22dd4e4cacb077_Black%20symbol%20(1)%20(2).png","description":"<p style=\"min-height:1.5em\"><strong>Wait a minute…</strong></p><p style=\"min-height:1.5em\">Are you inspired by the idea of becoming a key player in building a massive EdTech company that empowers millions of people worldwide?</p><p style=\"min-height:1.5em\">At Paradox, our sources of inspiration are Apple, Nike, Spotify, Disney for their obsession of excelling, having a worldwide impact and not just selling products but <strong>crafting experiences.</strong></p><p style=\"min-height:1.5em\"></p><p style=\"min-height:1.5em\"><strong>Maybe you’re not seeing your ideal job listed — but deep inside you are looking to kick start your career and you crave...</strong></p><ul style=\"min-height:1.5em\"><li><p style=\"min-height:1.5em\"><strong>🗽 Freedom:</strong> feeling free to being trusted to deliver</p></li><li><p style=\"min-height:1.5em\"><strong>🔥 Ambition:</strong> growing up surrounded by smart colleagues driven to create an iconic brand like Nike</p></li><li><p style=\"min-height:1.5em\"><strong>😍 Impact:</strong> contributing to transform people lives at scale and feel your own impact in the company</p></li></ul><p style=\"min-height:1.5em\">If that resonates, it’s time to stop scrolling and start dreaming bigger. Join us — not for a job, but a mission.</p><p style=\"min-height:1.5em\"></p><p style=\"min-height:1.5em\">For us, being Iconic is to innovate at the intersection of Psychology x Creativity x Technology. We’re building that company — and we want you with us.</p><p style=\"min-height:1.5em\"></p><p style=\"min-height:1.5em\"></p><div style=\"text-align:left\"><img style=\"max-width:100%\" src=\"https://app.ashbyhq.com/api/images/user-content/9f216e31-710a-4d14-8a7c-747665aa0e4a/8530f88d-8278-498d-8183-5b8d617d220b/Intersection%20en%20blanc.png\" /></div><p style=\"min-height:1.5em\"></p><p style=\"min-height:1.5em\"></p><h2><strong>🌟</strong> DO YOU HAVE WHAT IT TAKES?</h2><h3>-------------------------------</h3><p style=\"min-height:1.5em\"><strong> </strong></p><p style=\"min-height:1.5em\">We’re not just looking for team members. We’re looking for <strong>builders</strong>, <strong>visionaries</strong>, and <strong>leaders</strong> at all levels who are:</p><p style=\"min-height:1.5em\">🌱 Constant learners who thrive on growth</p><p style=\"min-height:1.5em\">💖 Deeply aligned with our mission to empower others</p><p style=\"min-height:1.5em\">💡 Driven to create and innovate</p><p style=\"min-height:1.5em\">🙌 Humble, yet ambitious and results-oriented</p><h2></h2><p style=\"min-height:1.5em\">We welcome <strong>spontaneous applications</strong> across a wide range of domains — from intern to C-level:</p><p style=\"min-height:1.5em\">🎥 Video Production &amp; Editing</p><p style=\"min-height:1.5em\">💻 Full Stack Development</p><p style=\"min-height:1.5em\">🧠 Learning Experience Design (LXD) &amp; Product</p><p style=\"min-height:1.5em\">📋 HR, Culture, Finance &amp; Operations</p><p style=\"min-height:1.5em\">💼 Executive Leadership &amp; Strategy</p><p style=\"min-height:1.5em\">📈 Growth, Sales &amp; Business Development</p><p style=\"min-height:1.5em\">💻 Social Media, Content &amp; Brand</p><p style=\"min-height:1.5em\">✍️ Copywriting &amp; Creative Direction</p><p style=\"min-height:1.5em\">🤖 AI Innovation &amp; Automation</p><p style=\"min-height:1.5em\">…and more! With us, <strong>the sky’s the limit.</strong></p><p style=\"min-height:1.5em\"></p><p style=\"min-height:1.5em\">We are open to <strong>remote</strong>, <strong>hybrid</strong>, or <strong>on-site</strong> roles in <strong>Dubai or Lisbon.</strong></p><p style=\"min-height:1.5em\"><strong>French and English fluency is required.</strong></p><p style=\"min-height:1.5em\"></p><p style=\"min-height:1.5em\"></p><h2>IT MIGHT NOT BE FOR YOU 🙅‍♀️</h2><h3>-------------------------------</h3><p style=\"min-height:1.5em\">Let’s be clear, we are looking for someone who is not just Great, and for whom Paradox ambition isn’t just another cool project; but a true mission.</p><p style=\"min-height:1.5em\"></p><p style=\"min-height:1.5em\">So if those <strong>personal interests :</strong> personal development / coaching / professional growth / education / edtech / teaching / edutainment<strong> are not things you REALLY love, and want to solve for other, let’s forget it</strong></p><p style=\"min-height:1.5em\"></p><p style=\"min-height:1.5em\">Let’s forget about it also if,</p><ul style=\"min-height:1.5em\"><li><p style=\"min-height:1.5em\">You <strong>don’t like to be challenged</strong> and grow in your job</p></li><li><p style=\"min-height:1.5em\">You don't like <strong>receiving or giving tough feedbacks</strong></p></li><li><p style=\"min-height:1.5em\">You <strong>don’t question the status quo: </strong>the process are there for a reason, we have always done it this way</p></li><li><p style=\"min-height:1.5em\">You <strong>like to have very specific &amp; fixed tasks</strong> assigned to you. Be told what to do and how to do it.</p></li><li><p style=\"min-height:1.5em\"><strong>Your only driver is joining a full-remote company</strong>: yes, our company culture is cool, but we want people to care about our mission, products, and their job!</p><p style=\"min-height:1.5em\"></p></li></ul><h2>🤩 JOIN US IF YOU CRAVE</h2><h3>-------------------------------</h3><div style=\"text-align:left\"><img style=\"max-width:100%\" src=\"https://app.ashbyhq.com/api/images/user-content/9f216e31-710a-4d14-8a7c-747665aa0e4a/fa58b8af-ec0a-4bd3-a2d9-fd4c908e2f86/pic%20job%20desc1.png\" /></div><p style=\"min-height:1.5em\"></p><p style=\"min-height:1.5em\"><em><strong>Growth &amp; Ambition 🚀</strong></em></p><p style=\"min-height:1.5em\">🏅 We hire only the best, it’s exhilarating to be <strong>surrounded by A-players</strong> who strive to perform whilst being in a good mood. You'll be working with some of the best minds. We understand that \"A\" people attract \"A\" people.</p><p style=\"min-height:1.5em\">🏋️‍♀️ No more bosses, but ongoing conversations to support your professional development.</p><p style=\"min-height:1.5em\">⚡️ Being part of an ambitious company with a lot of growth opportunities</p><p style=\"min-height:1.5em\"></p><p style=\"min-height:1.5em\"><em><strong>Impact &amp; Meaning </strong></em><strong>🔥</strong></p><p style=\"min-height:1.5em\">🦄 <strong>Playing a crucial role in the development of a company</strong> whose content and products are enjoyed by millions of people<br /><strong>🤩 Waking up in the morning knowing you are making a difference:</strong> <em>we receive messages every day from clients who have successfully lost weight, quit smoking, reach a milestone in their business, built better relationships, and made positive changes in their lives.<br /><br /><strong>But that’s not all, we believe that driven people deserve…</strong></em></p><p style=\"min-height:1.5em\"></p><p style=\"min-height:1.5em\"><em><strong>Freedom &amp; Well Being* 🗽☀️</strong></em></p><p style=\"min-height:1.5em\">😎 A company culture based on <strong>autonomy &amp; accountability<br /></strong>🗽 <strong>Flexible working hours<br /></strong>🌎 <strong>A remote culture from day one with the freedom to work from wherever you want<br /></strong>🏤 <strong>Magnificent offices in Dubai and Lisbon:</strong> you’re at home worldwide<br /><strong>⌨️ Standing desks</strong> paid by the company, if you live far from our offices<br />💻 <strong>Macbook:</strong> <em>to be the most efficient in your work<br /></em>🏀 <strong>350€ per year paid by the company to take care of yourself</strong> <em>(for your gym, or dance class or whatever make you feel great)<br /></em>📚 <strong>150€ per year paid by the company to boost your knowledge</strong> (books, education): we are passionate about learning and want to support your growth)<br />🤝 <strong>1:1 coachings</strong>: a Paradox coach supporting you personally or professionally to live your best life<br />✈️ <strong>Team building</strong></p><p style=\"min-height:1.5em\"><em>* those benefits are only for full-time employees</em></p><h3></h3><h2>HIRING PROCESS 📃</h2><h3>-------------------------------</h3><p style=\"min-height:1.5em\">That resonated with you?</p><h3></h3><p style=\"min-height:1.5em\">Click on \"Apply for this position\" and fill out a short questionnaire (7 to 8 minutes) to tell us more about yourself and send us your CV with a short video assignment!</p><p style=\"min-height:1.5em\"></p><h2><strong>About our hiring process</strong></h2><p style=\"min-height:1.5em\">Our recruitment process is tailored to do our best to avoid that you or us realize that we’re not a perfect fit. Every step serves a purpose and will allow us to get to know you better as much as it’ll help you understand more where you’ll be stepping in.</p><p style=\"min-height:1.5em\">We also want you to have time to ask all of your questions regarding the mission, the long-term vision of your team and the company, our values, with the relevant interlocutor in front of you.</p><h2></h2><h2></h2><h2>But maybe YOU WONDER WHAT’S OUR STORY ? 😉</h2><p style=\"min-height:1.5em\">-------------------------------</p><p style=\"min-height:1.5em\">At Paradox, we are convinced that people do not want “just a job” anymore.</p><p style=\"min-height:1.5em\">We are all craving to have an impact through our professional journey. Some want to start their own venture, some want to become an intrapreneur in their current organization, some others just want their day-to-day tasks to have more meaning.</p><p style=\"min-height:1.5em\"><strong>🎯 PARADOX HAS ONE GOAL: TO EMPOWER PEOPLE AND ORGANIZATIONS TO LIVE THEIR TRUE AMBITIONS.</strong></p><p style=\"min-height:1.5em\">But where do we start?</p><p style=\"min-height:1.5em\">If you have an interest in personal development, you probably already know that:</p><ul style=\"min-height:1.5em\"><li><p style=\"min-height:1.5em\">Making things happen is a real struggle when you don’t know what truly inspires you and how to get there ;</p></li><li><p style=\"min-height:1.5em\">Available resources are either boring 😴 or full of crazy unsubstantiated theories 🤪.</p></li></ul><p style=\"min-height:1.5em\">It needs to change, and we’re here to make it happen!</p><p style=\"min-height:1.5em\"><strong>⭐️ OUR AMBITION IS TO MAKE SUCCESS THE ONLY POSSIBLE OUTCOME FOR OUR CLIENTS (WHATEVER SUCCESS MEANS FOR THEM), BY CRAFTING INNOVATIVE &amp; CAPTIVATING BREAKTHROUGH EXPERIENCES.</strong></p><p style=\"min-height:1.5em\">In other words, we want to make personal growth <strong>as entertaining as watching Netflix.</strong></p><p style=\"min-height:1.5em\">How, you might be wondering?</p><ul style=\"min-height:1.5em\"><li><p style=\"min-height:1.5em\">We travel the world and surround ourselves with <strong>top entrepreneurs</strong> <em>(Richard Branson - Founder of Virgin, Marc Simoncini - Founder of Meeting, Fred Mazzella - Founder of BlablaCar)</em>, <strong>world</strong> <strong>athletes</strong> <em>(Tony Parker - Hall of fame NBA Player, Frederick Bousquet - World record in 50m free swimming, Frank Leboeuf - WorldCup Footballer)</em>, and <strong>artists</strong> <em>(Gad Elmaleh - Comedian, Franck Dubosc, Barry Osborne - Producer of Lord of the Rings and Matrix)</em> ✊;</p></li><li><p style=\"min-height:1.5em\">We reverse engineer their <strong>strategies for achieving success</strong> and fulfillment and lean on the <strong>latest researches</strong> about neurosciences ⚙️;</p></li><li><p style=\"min-height:1.5em\">We deliver trainings &amp; educational contents around Power Skills (critical thinking, productivity, leadership, public speaking, coaching, stress management, etc.), <strong>self-growth and performance</strong>, through a balanced set of <strong>e-learning programs, events and edutainment videos</strong> 💡.</p></li></ul><div style=\"text-align:left\"><img style=\"max-width:100%\" src=\"https://app.ashbyhq.com/api/images/user-content/9f216e31-710a-4d14-8a7c-747665aa0e4a/ec9fe1ea-f8c2-41b8-84ec-8548d649bc0f/pic%20job%20desc.png\" /></div><p style=\"min-height:1.5em\">From one well-known<a target=\"_blank\" rel=\"noopener noreferrer nofollow\" href=\"https://www.linkedin.com/in/davidlarochefr/\"> <u>Founder</u></a> to a team of +45 people today (and counting!), this approach has paid off and enabled us to exceed 2 million followers on social networks, and to have thousands of people attending our online events and training courses.</p><p style=\"min-height:1.5em\"><strong>🔥 TOGETHER, WE ARE DRIVEN BY ONE DREAM:</strong></p><ol style=\"min-height:1.5em\"><li><p style=\"min-height:1.5em\">Helping 100 000 people achieve their dream and display their pictures on what we call the “100 000 dreams wall” ;</p></li><li><p style=\"min-height:1.5em\">Giving our clients access to constant personal growth by reinventing their learning experience ;</p></li><li><p style=\"min-height:1.5em\">Leverage AI and other technology to provide an outstanding customized experience to millions of people for them to transform their lives. </p></li></ol><p style=\"min-height:1.5em\"></p><p style=\"min-height:1.5em\"><strong>And that’s where you come in. Join the Paradox Revolution !</strong></p>","tags":"[\"finance\",\"management\"]","pubDate":"2025-05-07T16:47:27.679Z","link":"https://jobs.ashbyhq.com/paradox/7282c9d0-15e8-464a-a0d5-aec06a9fb39f","slug":"a-players-spontaneous-application-paradox-5140"},{"id":8765673981,"title":"Software Engineer, Platform","company":"Speechify","image":"https://avatars.githubusercontent.com/u/32529485?s=200&v=4","description":"&lt;p&gt;The mission of Speechify is to make sure that reading is never a barrier to learning.&lt;/p&gt;\n&lt;p&gt;Over 30 million people use Speechify’s text-to-speech products to turn whatever they’re reading – PDFs, books, Google Docs, news articles, websites – into audio, so they can read faster, read more, and remember more. Speechify’s text-to-speech reading products include its iOS app, Android App, Mac App, Chrome Extension, and Web App. Google recently named Speechify the Chrome Extension of the Year and Apple named Speechify its App of the Day.&lt;/p&gt;\n&lt;p&gt;Today, nearly 200 people around the globe work on Speechify in a 100% distributed setting – Speechify has no office. These include frontend and backend engineers, AI research scientists, and others from Amazon, Microsoft, and Google, leading PhD programs like Stanford, high growth startups like Stripe, Vercel, Bolt, and many founders of their own companies.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Overview&lt;/strong&gt;&lt;/p&gt;\n&lt;p data-speechify-sentence=&quot;&quot;&gt;The responsibilities of our Platform team include building and maintaining all backend services, including, but not limited to, payments, analytics, subscriptions, new products, text to speech, and external APIs.&lt;/p&gt;\n&lt;p data-speechify-sentence=&quot;&quot;&gt;This is a key role and ideal for someone who thinks strategically, enjoys fast-paced environments, is passionate about making product decisions, and has experience building great user experiences that delight users.&lt;/p&gt;\n&lt;p data-speechify-sentence=&quot;&quot;&gt;We are a flat organization that allows anyone to become a leader by showing excellent technical skills and delivering results consistently and fast. Work ethic, solid communication skills, and obsession with winning are paramount.&amp;nbsp;&lt;/p&gt;\n&lt;p data-speechify-sentence=&quot;&quot;&gt;Our interview process involves several technical interviews and we aim to complete them within 1 week.&amp;nbsp;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;What Yo&lt;/strong&gt;&lt;strong&gt;u’&lt;/strong&gt;&lt;strong&gt;ll Do&lt;/strong&gt;&lt;/p&gt;\n&lt;ul&gt;\n&lt;li data-speechify-sentence=&quot;&quot;&gt;Design, develop, and maintain robust APIs including public TTS API, internal APIs like Payment, Subscription, Auth and Consumption Tracking, ensuring they meet business and scalability requirements&lt;/li&gt;\n&lt;li data-speechify-sentence=&quot;&quot;&gt;Oversee the full backend API landscape, enhancing and optimizing for performance and maintainability&lt;/li&gt;\n&lt;li data-speechify-sentence=&quot;&quot;&gt;Collaborate on B2B solutions, focusing on customization and integration needs for enterprise clients&lt;/li&gt;\n&lt;li data-speechify-sentence=&quot;&quot;&gt;Work closely with cross-functional teams to align backend architecture with overall product strategy and user experience&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;&lt;strong&gt;An Ideal Candidate Should Have&lt;/strong&gt;&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;Proven experience in backend development: TS/Node (required)&lt;/li&gt;\n&lt;li&gt;Direct experience with GCP and knowledge of AWS, Azure, or other cloud providers&lt;/li&gt;\n&lt;li&gt;Efficiency in ideation and implementation, prioritizing tasks based on urgency and impact&lt;/li&gt;\n&lt;li&gt;Preferred: Experience with Docker and containerized deployments&lt;/li&gt;\n&lt;li&gt;Preferred: Proficiency in deploying high availability applications on Kubernetes&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p data-speechify-sentence=&quot;&quot;&gt;&lt;strong&gt;What We Offer &lt;/strong&gt;&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;A dynamic environment where your contributions shape the company and its products&lt;/li&gt;\n&lt;li&gt;A team that values innovation, intuition, and drive&lt;/li&gt;\n&lt;li&gt;Autonomy, fostering focus and creativity&lt;/li&gt;\n&lt;li&gt;The opportunity to have a significant impact in a revolutionary industry&lt;/li&gt;\n&lt;li&gt;Competitive compensation, a welcoming atmosphere, and a commitment to an exceptional asynchronous work culture&lt;/li&gt;\n&lt;li&gt;The privilege of working on a product that changes lives, particularly for those with learning differences like dyslexia, ADD, and more&lt;/li&gt;\n&lt;li&gt;An active role at the intersection of artificial intelligence and audio – a rapidly evolving tech domain&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;&lt;strong&gt;Compensation: &lt;/strong&gt;The US base salary range for this full-time position is $140,000-$200,000 + bonus + equity depending on experience&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Think you’re a good fit for this job?&amp;nbsp;&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;Tell us more about yourself and why you&#39;re interested in the role when you apply. &lt;br&gt;And don’t forget to include links to your portfolio and LinkedIn.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Not looking but know someone who would make a great fit?&amp;nbsp;&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;Refer them!&amp;nbsp;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Speechify is committed to a diverse and inclusive workplace.&amp;nbsp;&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;Speechify does not discriminate on the basis of race, national origin, gender, gender identity, sexual orientation, protected veteran status, disability, age, or other legally protected status.&lt;/p&gt;","tags":"[\"b2b\",\"legal\",\"aws\"]","pubDate":"2025-05-07T15:13:36.000Z","link":"https://job-boards.greenhouse.io/speechify/jobs/5533936004","slug":"software-engineer-platform-speechify-4408"},{"id":3188912303,"title":"Engineering Manager, Infrastructure","company":"Primer","image":"https://pbs.twimg.com/profile_images/1533245276764372993/AtyqkzHz_400x400.jpg","description":"<h2><strong>An Introduction to Primer</strong></h2><p style=\"min-height:1.5em\">We’re the world's first unified payment infrastructure, empowering businesses worldwide to unleash their payment potential. By choosing our platform, merchants can take control over their payment stack, create unique commerce experiences, accelerate their roadmap and increase payment success. We strive to make something complex incredibly simple and intuitive. The world's top investors, including Accel, Balderton, Iconiq, and Tencent, have invested in Primer's vision to rebuild payments and commerce from the ground up.</p><p style=\"min-height:1.5em\">Join us in shaping the future of payments and commerce.</p><p style=\"min-height:1.5em\"></p><h2><strong>What team will you be joining?</strong></h2><p style=\"min-height:1.5em\">Putting the ‘Infrastructure’ in Unified Payments Infrastructure!</p><p style=\"min-height:1.5em\">Our Infrastructure team provides a stable, highly available, easy to use platform for Primer's customers and employees through well designed solutions backed by robust policies and procedures. This team covers: Infrastructure Architecture, Networking, Day-to-day Operations, Incident Response/SRE, Monitoring &amp; Alerting, Data Infrastructure and Intermediate Modules</p><p style=\"min-height:1.5em\">Our tech stack includes: Python, Golang, AWS, Typescript, React, Kubernetes and Terraform, amongst lots of other things.</p><p style=\"min-height:1.5em\"></p><h2><strong>🔍 What will the role involve?</strong></h2><ul style=\"min-height:1.5em\"><li><p style=\"min-height:1.5em\">Leading and managing our Cloud Infrastructure and Data Engineering team, cultivating an environment of continuous learning and collaboration</p></li><li><p style=\"min-height:1.5em\">Driving our cloud infrastructure and data engineering strategy and direction with a strong focus on scalability, reliability, resiliency, and cost efficiency through FinOps practices</p></li><li><p style=\"min-height:1.5em\">Working closely with cloud infrastructure engineers and data engineers to design, deploy and operate Primer’s infrastructure</p></li><li><p style=\"min-height:1.5em\">Designing and building monitoring, alerting and observability to ensure infrastructure performance, availability and health</p></li><li><p style=\"min-height:1.5em\">Reviewing technical architecture proposals with considerations for cost, scalability, performance, resilience, testability and maintainability</p></li><li><p style=\"min-height:1.5em\">Taking responsibility for planning, execution and success of complex infrastructure and data projects</p></li><li><p style=\"min-height:1.5em\">Improving knowledge sharing and collaboration within and across teams to remove roadblocks and maintain high performance</p></li><li><p style=\"min-height:1.5em\">Driving a culture of cross-team learning, encouraging the team to share key learnings with the wider organisation</p><p style=\"min-height:1.5em\"></p></li></ul><h2><strong>👀 What are we looking for?</strong></h2><ul style=\"min-height:1.5em\"><li><p style=\"min-height:1.5em\">An experienced engineering leader with a strong track record managing infrastructure and data-focused teams in fast-paced environments</p></li><li><p style=\"min-height:1.5em\">A strategic thinker who can define and execute on infrastructure and data roadmaps with a focus on resilience, scale, and cost optimisation</p></li><li><p style=\"min-height:1.5em\">Strong technical understanding of cloud-native tools and platforms, including AWS, Kubernetes, Elastic, Docker, Terraform, Datadog, Snowflake, Kafka and GitLab</p></li><li><p style=\"min-height:1.5em\">Familiarity with FinOps frameworks and a passion for instilling cost-awareness and efficiency in engineering decisions</p></li><li><p style=\"min-height:1.5em\">Experience reviewing complex architecture proposals and guiding teams through trade-off analysis</p></li><li><p style=\"min-height:1.5em\">A collaborative leader who fosters psychological safety, inclusion, and high performance within the team</p></li><li><p style=\"min-height:1.5em\">Strong communicator who builds partnerships across engineering, product and business teams</p></li><li><p style=\"min-height:1.5em\">An advocate for continuous improvement in engineering processes, infrastructure reliability, and team development</p><p style=\"min-height:1.5em\"></p></li></ul><h2>🚫 <strong>You may not like it here if:</strong></h2><ul style=\"min-height:1.5em\"><li><p style=\"min-height:1.5em\">You enjoy working in an office-setting, we are remote-first and always will be!</p></li><li><p style=\"min-height:1.5em\">You are not comfortable with shifting context and navigating ambiguity</p></li><li><p style=\"min-height:1.5em\">You don’t enjoy testing your code, we have no testers or QA’s here at Primer</p></li></ul><p style=\"min-height:1.5em\"></p><h2><strong>✅ Our interview process</strong></h2><ul style=\"min-height:1.5em\"><li><p style=\"min-height:1.5em\">30 minute call with a Talent Partner</p></li><li><p style=\"min-height:1.5em\">45 minute interview with an Engineering Manager</p></li><li><p style=\"min-height:1.5em\">Take-home task</p></li><li><p style=\"min-height:1.5em\">60 minute final stage interview</p><p style=\"min-height:1.5em\"></p></li></ul><p style=\"min-height:1.5em\">Unfortunately we are unable to offer sponsorships or relocation packages at this time.</p><p style=\"min-height:1.5em\"></p><h2><strong>What’s the culture like at Primer?</strong></h2><p style=\"min-height:1.5em\">We’re building a culture where people can come and do their best work and enjoy it. We want our people to be proud of the impact that they have at Primer, and of the work that they are doing. You will be working with a team of people who are mission-driven, smart, and reflective, and who are invested in building exceptional products and delivering success for our merchants <em>(and we also know how to have fun along the way).</em></p><p style=\"min-height:1.5em\">We work remotely. We believe that building a successful, profitable company goes beyond proximity. We invest in our relationships with each other through great remote working practices and thoughtfully designed face-to-face time together. Our heads-together time comes in the form of workations, our annual company retreat, and co-working space access worldwide.</p><p style=\"min-height:1.5em\">Finally, let’s go ahead and say it. The work that we do is challenging. Startups are a challenge, building category defining products is a challenge. You should be prepared for a challenge at Primer. But, there’s a big difference between a challenge and a struggle. The key difference is that the right challenge comes with the right support structures, an acceptance that not everything always goes to plan, a collaborative environment, and a great team around you. It’s never a challenge that you will face alone.</p><p style=\"min-height:1.5em\"></p><h2><strong>Our benefits:</strong></h2><ul style=\"min-height:1.5em\"><li><p style=\"min-height:1.5em\">We are fully remote</p></li><li><p style=\"min-height:1.5em\">Competitive share options</p></li><li><p style=\"min-height:1.5em\">Uncapped holiday, with 25 days minimum to be taken</p></li><li><p style=\"min-height:1.5em\">Co-working space access</p></li><li><p style=\"min-height:1.5em\">Workations &amp; company retreat</p></li><li><p style=\"min-height:1.5em\">The best equipment for your role</p></li><li><p style=\"min-height:1.5em\">£500 towards your home office setup</p></li><li><p style=\"min-height:1.5em\">Generous learning budget</p></li><li><p style=\"min-height:1.5em\">Medical insurance</p></li><li><p style=\"min-height:1.5em\">A broad set of additional perks and benefits (<em>depending on location)</em></p></li></ul><p style=\"min-height:1.5em\"></p><h2><strong>Don’t meet every single requirement?</strong></h2><p style=\"min-height:1.5em\">At Primer, we’re dedicated to building a diverse, inclusive, and authentic workplace. If you’re excited about this role but your past experience doesn’t align perfectly with every qualification in the job description, we encourage you to apply. You may be the right candidate for this or other roles. Primer is committed to the equal treatment of all current and prospective employees, regardless of background or beliefs—see our diversity commitment statement for more details</p><p style=\"min-height:1.5em\">Primer adopts a zero-tolerance approach to discrimination.</p><p style=\"min-height:1.5em\">We are committed to providing equal opportunities to all current and prospective employees regardless of age, disability, sex, sexual orientation, pregnancy and maternity, race or ethnicity, religion or belief, gender identity, or marriage and civil partnership.</p><p style=\"min-height:1.5em\"></p>","tags":"[\"typescript\",\"engineering\",\"aws\"]","pubDate":"2025-05-07T09:23:04.757Z","link":"https://jobs.ashbyhq.com/primer.io/b34b3776-88bc-446c-afc3-38cf4eb60f9a","slug":"engineering-manager-infrastructure-primer-1453"},{"id":4740723164,"title":"Sr Product Manager - OSS Supply Chain Security (worldwide remote, work anywhere)","company":"CloudLinux","image":"https://avatars.githubusercontent.com/u/16290369?s=200&v=4","description":"<p>CloudLinux is a global remote-first company. We are driven by our principles: do the right thing, employees first, we are remote first, and we deliver high volume, low-cost Linux infrastructure and security products that help companies to increase the efficiency of their operations. Every person on our team supports each other and does what we can to ensure we all are successful.&nbsp;<a href=\"https://cloudlinux.com/\" rel=\"nofollow noreferrer noopener\" class=\"external\"></a></p><p>We are looking for a dynamic and experienced Senior Product Manager to lead and promote our Endless Lifecycle Support product lines, focusing on various open-source libraries and frameworks, languages and Linux distributions. This role is a unique blend of product management, OSS knowledge and supply chain security thought leadership, where you will be responsible for shaping the vision and defining go-to-market strategies. You will be reporting directly to the CEO.</p><p><strong>Key Responsibilities:</strong></p><ul> <li>Product Vision &amp; Strategy:</li> <ul> <li>Define and refine the vision for TuxCare’s Endless Lifecycle Support products.</li> <li>Develop and implement comprehensive go-to-market strategies tailored to different market segments and industries.</li> <li>Continuously assess market trends, customer needs, and competitive landscapes to guide product evolution.</li> <li>Work closely with engineering, marketing, and sales teams to create and launch new product lines.</li> <li>Oversee the entire product lifecycle, from ideation through development, launch, and post-launch support.</li> </ul> </ul><p><strong>Requirements</strong></p><p><strong>Qualifications</strong>:</p><ul> <li>Experience:</li> <ul> <li>5+ years of product management experience, preferably in the open-source and security domain.</li> <li>Proven track record of successfully launching and scaling technical products in the enterprise market.</li> <li>Strong understanding open-source software, OSS supply chain security</li> <li>Previous software engineering experience</li> </ul> <li>Skills:</li> <ul> <li>Exceptional communication and presentation skills, with the ability to articulate complex technical concepts to diverse audiences.</li> <li>Strong leadership and project management abilities, with a focus on driving results and fostering collaboration.</li> <li>Analytical mindset with the ability to interpret market data and customer feedback to inform product decisions.</li> <li>Fluent English speaker</li> </ul> </ul><p><strong>Benefits</strong></p><p><strong>What's in it for you?</strong></p><ul> <li>A focus on professional development</li> <li>Interesting and challenging projects</li> <li>Fully remote work with flexible working hours, that allows you to schedule your day and work from any location worldwide</li> <li>Paid 24 days of vacation per year, 10 days of national holidays, and unlimited sick leaves</li> <li>Compensation for private medical insurance</li> <li>Co-working and gym/sports reimbursement</li> <li>Budget for education</li> <li>The opportunity to receive a reward for the most innovative idea that the company can patent</li> </ul><p></p><p><em>By applying for this position, you agree with the CloudLinux Privacy Policy - </em><a href=\"https://cloudlinux.com/privacy-policy\" target=\"_blank\" rel=\"nofollow noreferrer noopener\" class=\"external\">https://cloudlinux.com/privacy-policy</a><a href=\"https://cloudlinux.com/privacy-policy\" target=\"_blank\" rel=\"nofollow noreferrer noopener\" class=\"external\"></a><em> and give us your consent to maintain and process your personal data in this respect. Please read our Privacy Policy for more information - </em><a href=\"https://cloudlinux.com/privacy-policy\" target=\"_blank\" rel=\"nofollow noreferrer noopener\" class=\"external\">https://cloudlinux.com/privacy-policy</a><em> .</em></p>","tags":"[\"management\",\"engineering\"]","pubDate":"2025-05-07T00:00:00.000Z","link":"https://apply.workable.com/j/4A94AD5F0D","slug":"sr-product-manager-oss-supply-chain-security-worldwide-remote-work-anywhere-cloudlinux-8493"},{"id":3348362982,"title":"Sr Product Manager - OSS Supply Chain Security (worldwide remote, work anywhere)","company":"CloudLinux","image":"https://avatars.githubusercontent.com/u/16290369?s=200&v=4","description":"<p>CloudLinux is a global remote-first company. We are driven by our principles: do the right thing, employees first, we are remote first, and we deliver high volume, low-cost Linux infrastructure and security products that help companies to increase the efficiency of their operations. Every person on our team supports each other and does what we can to ensure we all are successful.&nbsp;<a href=\"https://cloudlinux.com/\" rel=\"nofollow noreferrer noopener\" class=\"external\"></a></p><p>We are looking for a dynamic and experienced Senior Product Manager to lead and promote our Endless Lifecycle Support product lines, focusing on various open-source libraries and frameworks, languages and Linux distributions. This role is a unique blend of product management, OSS knowledge and supply chain security thought leadership, where you will be responsible for shaping the vision and defining go-to-market strategies. You will be reporting directly to the CEO.</p><p><strong>Key Responsibilities:</strong></p><ul> <li>Product Vision &amp; Strategy:</li> <ul> <li>Define and refine the vision for TuxCare’s Endless Lifecycle Support products.</li> <li>Develop and implement comprehensive go-to-market strategies tailored to different market segments and industries.</li> <li>Continuously assess market trends, customer needs, and competitive landscapes to guide product evolution.</li> <li>Work closely with engineering, marketing, and sales teams to create and launch new product lines.</li> <li>Oversee the entire product lifecycle, from ideation through development, launch, and post-launch support.</li> </ul> </ul><p><strong>Requirements</strong></p><p><strong>Qualifications</strong>:</p><ul> <li>Experience:</li> <ul> <li>5+ years of product management experience, preferably in the open-source and security domain.</li> <li>Proven track record of successfully launching and scaling technical products in the enterprise market.</li> <li>Strong understanding open-source software, OSS supply chain security</li> <li>Previous software engineering experience</li> </ul> <li>Skills:</li> <ul> <li>Exceptional communication and presentation skills, with the ability to articulate complex technical concepts to diverse audiences.</li> <li>Strong leadership and project management abilities, with a focus on driving results and fostering collaboration.</li> <li>Analytical mindset with the ability to interpret market data and customer feedback to inform product decisions.</li> <li>Fluent English speaker</li> </ul> </ul><p><strong>Benefits</strong></p><p><strong>What's in it for you?</strong></p><ul> <li>A focus on professional development</li> <li>Interesting and challenging projects</li> <li>Fully remote work with flexible working hours, that allows you to schedule your day and work from any location worldwide</li> <li>Paid 24 days of vacation per year, 10 days of national holidays, and unlimited sick leaves</li> <li>Compensation for private medical insurance</li> <li>Co-working and gym/sports reimbursement</li> <li>Budget for education</li> <li>The opportunity to receive a reward for the most innovative idea that the company can patent</li> </ul><p></p><p><em>By applying for this position, you agree with the CloudLinux Privacy Policy - </em><a href=\"https://cloudlinux.com/privacy-policy\" target=\"_blank\" rel=\"nofollow noreferrer noopener\" class=\"external\">https://cloudlinux.com/privacy-policy</a><a href=\"https://cloudlinux.com/privacy-policy\" target=\"_blank\" rel=\"nofollow noreferrer noopener\" class=\"external\"></a><em> and give us your consent to maintain and process your personal data in this respect. Please read our Privacy Policy for more information - </em><a href=\"https://cloudlinux.com/privacy-policy\" target=\"_blank\" rel=\"nofollow noreferrer noopener\" class=\"external\">https://cloudlinux.com/privacy-policy</a><em> .</em></p>","tags":"[\"management\",\"engineering\"]","pubDate":"2025-05-07T00:00:00.000Z","link":"https://apply.workable.com/j/4A94AD5F0D","slug":"sr-product-manager-oss-supply-chain-security-worldwide-remote-work-anywhere-cloudlinux-778"},{"id":4227007554,"title":"Sr Product Manager - OSS Supply Chain Security (worldwide remote, work anywhere)","company":"CloudLinux","image":"https://avatars.githubusercontent.com/u/16290369?s=200&v=4","description":"<p>CloudLinux is a global remote-first company. We are driven by our principles: do the right thing, employees first, we are remote first, and we deliver high volume, low-cost Linux infrastructure and security products that help companies to increase the efficiency of their operations. Every person on our team supports each other and does what we can to ensure we all are successful.&nbsp;<a href=\"https://cloudlinux.com/\" rel=\"nofollow noreferrer noopener\" class=\"external\"></a></p><p>We are looking for a dynamic and experienced Senior Product Manager to lead and promote our Endless Lifecycle Support product lines, focusing on various open-source libraries and frameworks, languages and Linux distributions. This role is a unique blend of product management, OSS knowledge and supply chain security thought leadership, where you will be responsible for shaping the vision and defining go-to-market strategies. You will be reporting directly to the CEO.</p><p><strong>Key Responsibilities:</strong></p><ul> <li>Product Vision &amp; Strategy:</li> <ul> <li>Define and refine the vision for TuxCare’s Endless Lifecycle Support products.</li> <li>Develop and implement comprehensive go-to-market strategies tailored to different market segments and industries.</li> <li>Continuously assess market trends, customer needs, and competitive landscapes to guide product evolution.</li> <li>Work closely with engineering, marketing, and sales teams to create and launch new product lines.</li> <li>Oversee the entire product lifecycle, from ideation through development, launch, and post-launch support.</li> </ul> </ul><p><strong>Requirements</strong></p><p><strong>Qualifications</strong>:</p><ul> <li>Experience:</li> <ul> <li>5+ years of product management experience, preferably in the open-source and security domain.</li> <li>Proven track record of successfully launching and scaling technical products in the enterprise market.</li> <li>Strong understanding open-source software, OSS supply chain security</li> <li>Previous software engineering experience</li> </ul> <li>Skills:</li> <ul> <li>Exceptional communication and presentation skills, with the ability to articulate complex technical concepts to diverse audiences.</li> <li>Strong leadership and project management abilities, with a focus on driving results and fostering collaboration.</li> <li>Analytical mindset with the ability to interpret market data and customer feedback to inform product decisions.</li> <li>Fluent English speaker</li> </ul> </ul><p><strong>Benefits</strong></p><p><strong>What's in it for you?</strong></p><ul> <li>A focus on professional development</li> <li>Interesting and challenging projects</li> <li>Fully remote work with flexible working hours, that allows you to schedule your day and work from any location worldwide</li> <li>Paid 24 days of vacation per year, 10 days of national holidays, and unlimited sick leaves</li> <li>Compensation for private medical insurance</li> <li>Co-working and gym/sports reimbursement</li> <li>Budget for education</li> <li>The opportunity to receive a reward for the most innovative idea that the company can patent</li> </ul><p></p><p><em>By applying for this position, you agree with the CloudLinux Privacy Policy - </em><a href=\"https://cloudlinux.com/privacy-policy\" target=\"_blank\" rel=\"nofollow noreferrer noopener\" class=\"external\">https://cloudlinux.com/privacy-policy</a><a href=\"https://cloudlinux.com/privacy-policy\" target=\"_blank\" rel=\"nofollow noreferrer noopener\" class=\"external\"></a><em> and give us your consent to maintain and process your personal data in this respect. Please read our Privacy Policy for more information - </em><a href=\"https://cloudlinux.com/privacy-policy\" target=\"_blank\" rel=\"nofollow noreferrer noopener\" class=\"external\">https://cloudlinux.com/privacy-policy</a><em> .</em></p>","tags":"[\"management\",\"engineering\"]","pubDate":"2025-05-07T00:00:00.000Z","link":"https://apply.workable.com/j/4A94AD5F0D","slug":"sr-product-manager-oss-supply-chain-security-worldwide-remote-work-anywhere-cloudlinux-1766"},{"id":2789109872,"title":"Sr Product Manager - OSS Supply Chain Security (worldwide remote, work anywhere)","company":"CloudLinux","image":"https://avatars.githubusercontent.com/u/16290369?s=200&v=4","description":"<p>CloudLinux is a global remote-first company. We are driven by our principles: do the right thing, employees first, we are remote first, and we deliver high volume, low-cost Linux infrastructure and security products that help companies to increase the efficiency of their operations. Every person on our team supports each other and does what we can to ensure we all are successful.&nbsp;<a href=\"https://cloudlinux.com/\" rel=\"nofollow noreferrer noopener\" class=\"external\"></a></p><p>We are looking for a dynamic and experienced Senior Product Manager to lead and promote our Endless Lifecycle Support product lines, focusing on various open-source libraries and frameworks, languages and Linux distributions. This role is a unique blend of product management, OSS knowledge and supply chain security thought leadership, where you will be responsible for shaping the vision and defining go-to-market strategies. You will be reporting directly to the CEO.</p><p><strong>Key Responsibilities:</strong></p><ul> <li>Product Vision &amp; Strategy:</li> <ul> <li>Define and refine the vision for TuxCare’s Endless Lifecycle Support products.</li> <li>Develop and implement comprehensive go-to-market strategies tailored to different market segments and industries.</li> <li>Continuously assess market trends, customer needs, and competitive landscapes to guide product evolution.</li> <li>Work closely with engineering, marketing, and sales teams to create and launch new product lines.</li> <li>Oversee the entire product lifecycle, from ideation through development, launch, and post-launch support.</li> </ul> </ul><p><strong>Requirements</strong></p><p><strong>Qualifications</strong>:</p><ul> <li>Experience:</li> <ul> <li>5+ years of product management experience, preferably in the open-source and security domain.</li> <li>Proven track record of successfully launching and scaling technical products in the enterprise market.</li> <li>Strong understanding open-source software, OSS supply chain security</li> <li>Previous software engineering experience</li> </ul> <li>Skills:</li> <ul> <li>Exceptional communication and presentation skills, with the ability to articulate complex technical concepts to diverse audiences.</li> <li>Strong leadership and project management abilities, with a focus on driving results and fostering collaboration.</li> <li>Analytical mindset with the ability to interpret market data and customer feedback to inform product decisions.</li> <li>Fluent English speaker</li> </ul> </ul><p><strong>Benefits</strong></p><p><strong>What's in it for you?</strong></p><ul> <li>A focus on professional development</li> <li>Interesting and challenging projects</li> <li>Fully remote work with flexible working hours, that allows you to schedule your day and work from any location worldwide</li> <li>Paid 24 days of vacation per year, 10 days of national holidays, and unlimited sick leaves</li> <li>Compensation for private medical insurance</li> <li>Co-working and gym/sports reimbursement</li> <li>Budget for education</li> <li>The opportunity to receive a reward for the most innovative idea that the company can patent</li> </ul><p></p><p><em>By applying for this position, you agree with the CloudLinux Privacy Policy - </em><a href=\"https://cloudlinux.com/privacy-policy\" target=\"_blank\" rel=\"nofollow noreferrer noopener\" class=\"external\">https://cloudlinux.com/privacy-policy</a><a href=\"https://cloudlinux.com/privacy-policy\" target=\"_blank\" rel=\"nofollow noreferrer noopener\" class=\"external\"></a><em> and give us your consent to maintain and process your personal data in this respect. Please read our Privacy Policy for more information - </em><a href=\"https://cloudlinux.com/privacy-policy\" target=\"_blank\" rel=\"nofollow noreferrer noopener\" class=\"external\">https://cloudlinux.com/privacy-policy</a><em> .</em></p>","tags":"[\"management\",\"engineering\"]","pubDate":"2025-05-07T00:00:00.000Z","link":"https://apply.workable.com/j/4A94AD5F0D","slug":"sr-product-manager-oss-supply-chain-security-worldwide-remote-work-anywhere-cloudlinux-6716"},{"id":1594035898,"title":"Senior Go Engineer","company":"OnHires","image":"https://remotive.com/job/2000791/logo","description":"<p dir=\"ltr\"><strong>Full-time | Remote</strong><br><strong>Industry: Software Development / Digital Product Agency</strong></p>\n<p dir=\"ltr\">Our client is a product design and development agency that partners with entrepreneurs, startups, and organizations to turn ideas into impactful digital platforms. With over a decade of experience, they’ve launched hundreds of products that empower their clients to scale and succeed. Their global, cross-functional team delivers innovative, efficient, and strategic solutions—eliminating the need for large in-house tech teams.</p>\n<p dir=\"ltr\">They are now looking for a <strong>Senior Go Engineer</strong> to join their growing engineering team and contribute to the development of scalable web platforms and digital applications.</p>\n<p dir=\"ltr\"><strong>Key Responsibilities:</strong></p>\n<ul style=\"\">\n<li dir=\"ltr\" style=\"\">\n<p dir=\"ltr\">Design, develop, and maintain robust and scalable systems using Go.</p>\n</li>\n<li dir=\"ltr\" style=\"\">\n<p dir=\"ltr\">Build and optimize RESTful APIs and server-side application logic.</p>\n</li>\n<li dir=\"ltr\" style=\"\">\n<p dir=\"ltr\">Ensure high code quality through best practices, testing, and code reviews.</p>\n</li>\n<li dir=\"ltr\" style=\"\">\n<p dir=\"ltr\">Collaborate with frontend developers, product managers, and designers to implement new features and deliver high-performing products.</p>\n</li>\n<li dir=\"ltr\" style=\"\">\n<p dir=\"ltr\">Troubleshoot and resolve issues in production environments.</p>\n</li>\n<li dir=\"ltr\" style=\"\">\n<p dir=\"ltr\">Participate in architectural planning and system design discussions.</p>\n</li>\n<li dir=\"ltr\" style=\"\">\n<p dir=\"ltr\">Provide mentorship and guidance to junior developers.<br><br></p>\n</li>\n</ul>\n<p dir=\"ltr\"><strong>Required Qualifications:</strong></p>\n<ul style=\"\">\n<li dir=\"ltr\" style=\"\">\n<p dir=\"ltr\">5+ years of experience with Go in production environments.</p>\n</li>\n<li dir=\"ltr\" style=\"\">\n<p dir=\"ltr\">Strong understanding of Go’s type system, interfaces, concurrency model, and generics.</p>\n</li>\n<li dir=\"ltr\" style=\"\">\n<p dir=\"ltr\">Solid experience with REST API development and PostgreSQL.</p>\n</li>\n<li dir=\"ltr\" style=\"\">\n<p dir=\"ltr\">Hands-on experience with cloud infrastructure (AWS, GCP, or similar).</p>\n</li>\n<li dir=\"ltr\" style=\"\">\n<p dir=\"ltr\">Proficiency with containerization (Docker) and orchestration (Kubernetes).</p>\n</li>\n<li dir=\"ltr\" style=\"\">\n<p dir=\"ltr\">Experience with Git, CI/CD pipelines, and automated testing frameworks.</p>\n</li>\n<li dir=\"ltr\" style=\"\">\n<p dir=\"ltr\">Comfortable working in distributed, remote-first teams.</p>\n</li>\n<li dir=\"ltr\" style=\"\">\n<p dir=\"ltr\">Degree in Computer Science or related field—or equivalent hands-on experience in system architecture, Linux, and networking.</p>\n</li>\n<li dir=\"ltr\" style=\"\">\n<p dir=\"ltr\">English level: B2 (Upper-Intermediate) or higher — required for communication with the global team.</p>\n</li>\n</ul>\n<p> </p>\n<p dir=\"ltr\"><strong>Preferred Qualifications:</strong></p>\n<ul style=\"\">\n<li dir=\"ltr\" style=\"\">\n<p dir=\"ltr\">Experience integrating third-party services (e.g., Stripe, Twilio, SendGrid).</p>\n</li>\n<li dir=\"ltr\" style=\"\">\n<p dir=\"ltr\">Familiarity with frontend technologies (TypeScript, HTML5, CSS3).</p>\n</li>\n<li dir=\"ltr\" style=\"\">\n<p dir=\"ltr\">Experience with GraphQL, OpenAPI, or gRPC.</p>\n</li>\n<li dir=\"ltr\" style=\"\">\n<p dir=\"ltr\">Knowledge of PostgreSQL-compatible ORMs for Go.</p>\n</li>\n<li dir=\"ltr\" style=\"\">\n<p dir=\"ltr\">Familiarity with Redis or Memcached for caching.</p>\n</li>\n<li dir=\"ltr\" style=\"\">\n<p dir=\"ltr\">Expertise in debugging race conditions and optimizing parallel processing in Go.</p>\n</li>\n<li dir=\"ltr\" style=\"\">\n<p dir=\"ltr\">Experience mentoring developers or leading small teams.</p>\n</li>\n<li dir=\"ltr\" style=\"\">\n<p dir=\"ltr\">Previous work in a development studio or agency environment.<br><br></p>\n</li>\n</ul>\n<p dir=\"ltr\"><strong>Who You Are</strong></p>\n<ul style=\"\">\n<li dir=\"ltr\" style=\"\">\n<p dir=\"ltr\">A self-starter who is genuinely interested in new technology and its impact.</p>\n</li>\n<li dir=\"ltr\" style=\"\">\n<p dir=\"ltr\">A clear and effective communicator who can bridge the gap between technical and non-technical teams.</p>\n</li>\n<li dir=\"ltr\" style=\"\">\n<p dir=\"ltr\">Someone who enjoys creating and maintaining product documentation, including product requirements, diagrams, acceptance criteria, and KPIs.</p>\n</li>\n<li dir=\"ltr\" style=\"\">\n<p dir=\"ltr\">A professional who can efficiently manage tasks and balance competing demands.</p>\n</li>\n<li dir=\"ltr\" style=\"\">\n<p dir=\"ltr\">Capable of managing multiple projects concurrently.</p>\n</li>\n<li dir=\"ltr\" style=\"\">\n<p dir=\"ltr\">Experienced in working with a remote multi-timezone development team.</p>\n</li>\n<li dir=\"ltr\" style=\"\">\n<p dir=\"ltr\">Detail-oriented with a knack for organizing complex ideas into actionable documentation.</p>\n</li>\n<li dir=\"ltr\" style=\"\">\n<p dir=\"ltr\">Proactive, resourceful, and eager to dive deep into understanding client needs and project goals.</p>\n</li>\n<li dir=\"ltr\" style=\"\">\n<p dir=\"ltr\">A collaborative team player who enjoys working with cross-functional teams to deliver successful outcomes.</p>\n</li>\n<li dir=\"ltr\" style=\"\">\n<p dir=\"ltr\">Comfortable working in a fast-paced environment with multiple priorities.</p>\n</li>\n</ul>\n<p dir=\"ltr\"> </p>\n<p dir=\"ltr\"><strong>Perks and Benefits</strong><br>🌎 100% Remote<br>💸 Competitive salaries based on your location<br>🌴 Unlimited paid vacation<br>💻 $500 home office stipend<br>👋 An awesome team dedicated to your growth<br><br><strong>Hiring process</strong></p>\n<ol style=\"\">\n<li dir=\"ltr\" style=\"\">\n<p dir=\"ltr\">30-minute prescreen with recruiter</p>\n</li>\n<li dir=\"ltr\" style=\"\">\n<p dir=\"ltr\">30-45 minute initial interview</p>\n</li>\n<li dir=\"ltr\" style=\"\">\n<p dir=\"ltr\">Short exercise</p>\n</li>\n<li dir=\"ltr\" style=\"\">\n<p dir=\"ltr\">60-minute exercise review (panel)</p>\n</li>\n<li dir=\"ltr\" style=\"\">\n<p dir=\"ltr\">Leadership interview(s)</p>\n</li>\n<li dir=\"ltr\" style=\"\">\n<p dir=\"ltr\">Decision</p>\n</li>\n</ol>\n<p> </p>\n<p dir=\"ltr\"><strong>Remote Work Requirements: The workday must overlap by at least 6 hours with Los Angeles, CA, USA.</strong></p>\n<p> </p>\n<img src=\"https://remotive.com/job/track/2000791/blank.gif?source=public_api\" alt=\"\"/>","tags":"[\"AWS\",\"docker\",\"go\",\"postgresql\"]","pubDate":"2025-05-06T00:50:06.000Z","link":"https://remotive.com/remote-jobs/software-dev/senior-go-engineer-2000791","slug":"senior-go-engineer-onhires-2979"}]