[{"id":1442024479,"title":"Commercial Lawyer ","company":"SafetyWing","image":"https://pbs.twimg.com/profile_images/1177267684574208000/54eG3WmW_400x400.jpg","description":"<h2>🧘 What we offer</h2> <ul><li><!--block-->Fully remote work environment – work from anywhere globally</li><li><!--block-->Competitive compensation in line with global benchmarks</li><li><!--block-->Potential to unlock equity compensation</li><li><!--block-->A minimum of four weeks of vacation per year</li><li><!--block-->Premium health insurance that travels with you</li><li><!--block-->Travel insurance any time you travel outside of your home country</li><li><!--block-->New laptop, office allowance and more!<br><br></li></ul><div><!--block--><br></div><div><!--block-->🚀 We look forward to hearing from you!</div> <div><!--block-->SafetyWing is looking for a skilled <strong>Commercial Lawyer </strong>to join our legal team. In this role, you will work closely with our Head of Legal and Regulatory Affairs and support product teams to develop innovative global products and scale existing ones. We are looking for a great communicator who can simplify complex legal concepts and provide actionable guidance to support our mission.&nbsp;</div><div><!--block--><br></div><div><!--block--><strong>🚀 About SafetyWing</strong></div><div><!--block-->&nbsp;At <strong>SafetyWing</strong>, we’re building a global social safety net for remote workers—simple health, insurance, and retirement products designed to replace national welfare systems. Our mission is to remove geographical borders as a barrier to equal opportunity and freedom for everyone. If we succeed, we believe this will be one of the most important tasks of our time.</div><div><!--block--><br></div><div><!--block-->We’re a fully remote team of nearly 130, stretching across 15+ timezones.</div> <h2>💻 Your responsibilities will include</h2>  <ul><li><!--block-->Collaborating with product teams to address legal challenges, support the development of new products, and scale existing offerings effectively&nbsp;</li><li><!--block-->Providing practical and strategic legal advice to support new product developments and enhance customer experience, while aligning with long term business goals</li><li><!--block-->Drafting, reviewing, and negotiating legal agreements in partnership with product teams</li><li><!--block-->Partnering with the sales team, providing legal support in high-value enterprise sales, including participating in client calls to facilitate deal closure&nbsp;</li><li><!--block-->Ensuring compliance with international laws, including data privacy, consumer protection, advertising, insurance regulations, and other applicable commercial laws across jurisdictions</li></ul> <h2>🧪 We are looking for someone who</h2> <ul><li><!--block-->Has solid experience in negotiating and drafting a broad range of commercial agreements, particularly in SaaS, technology, or regulated industries</li><li><!--block-->Is familiar with laws and regulations governing insurance, fintech, or similar industries across multiple jurisdictions</li><li><!--block-->Is comfortable working in fast-paced, ambiguous environments, preferably with experience in scaling products and navigating evolving legal landscapes across international jurisdictions</li><li><!--block-->Has demonstrated ability to identify potential legal issues early and take a proactive, solution-oriented approach</li><li><!--block-->Has strong understanding of how legal decisions impact business operations, particularly product development and sales</li><li><!--block-->Has proven ability to support enterprise sales teams in closing high-value deals, including direct client interaction</li></ul><div><!--block--><br></div><div><!--block--><strong>🦸‍♂️ We like to work with people who</strong></div><ul><li><!--block-->Share our vision to build a global social safety net on the Internet</li><li><!--block-->Think for themselves instead of copying others</li><li><!--block-->Are willing to try new things, even with the risk of failure</li><li><!--block-->Are intellectually curious and open to new ideas</li><li><!--block-->Are creative and bold in the face of any problem</li><li><!--block-->Have strong integrity and do the right thing</li></ul>","tags":"[\"legal\",\"aws\"]","pubDate":"2025-01-08T09:12:35.174Z","link":"https://safetywing.pinpointhq.com/en/jobs/301218","slug":"commercial-lawyer-safetywing-105"},{"id":5773126335,"title":"Senior Auth Engineer","company":"Supabase","image":"https://avatars.githubusercontent.com/u/54469796?s=200&v=4","description":"<p style=\"min-height:1.5em\">Supabase is an Open Source and fully remote company building developer tools for databases.</p><p style=\"min-height:1.5em\"><a target=\"_blank\" rel=\"noopener noreferrer nofollow\" href=\"https://supabase.com/auth\">Auth</a>, written in <a target=\"_blank\" rel=\"noopener noreferrer nofollow\" href=\"https://github.com/supabase/auth\">Go</a> (server) and with client libraries for <a target=\"_blank\" rel=\"noopener noreferrer nofollow\" href=\"https://github.com/supabase/auth-js\">TypeScript</a>, <a target=\"_blank\" rel=\"noopener noreferrer nofollow\" href=\"https://github.com/supabase/ssr\">SSR</a> and for other frameworks and technologies, is one of the most popular products in the Supabase stack. We are seeking someone to help us build new and maintain existing Auth features.</p><p style=\"min-height:1.5em\"></p><h3>You have:</h3><ul style=\"min-height:1.5em\"><li><p style=\"min-height:1.5em\">5+ years of Software Development experience</p></li><li><p style=\"min-height:1.5em\">Strong knowledge of web technology fundamentals (cookies, sessions, JWT, HTTP, browser APIs)</p></li><li><p style=\"min-height:1.5em\">Good knowledge of and deep interest in authentication security (passwords, protocols such as OAuth, OIDC or SAML, cryptography fundamentals such as hash functions, signatures and ciphers)</p></li><li><p style=\"min-height:1.5em\">Experience working with multiple web frameworks like Next.js (or other SSR alternative in the JavaScript space) and traditional web frameworks like Ruby on Rails, Django, Laravel or equivalent (in any language)</p></li><li><p style=\"min-height:1.5em\">Strong knowledge of Go and TypeScript (languages used daily) and Postgres</p></li><li><p style=\"min-height:1.5em\">Good technical writing skills (RFC process is an important part of making changes to the Auth product)</p></li></ul><h3>We offer:</h3><ul style=\"min-height:1.5em\"><li><p style=\"min-height:1.5em\">100% remote work from anywhere in the world. No location-based adjustment to your salary.</p></li><li><p style=\"min-height:1.5em\">Autonomous work. We work collaboratively on projects, but you set your own pace.</p></li><li><p style=\"min-height:1.5em\">Health, Vision and Dental benefits. Supabase covers 100% of the cost for employees and 80% for dependants</p></li><li><p style=\"min-height:1.5em\">Generous Tech Allowance for any office setup you need</p></li><li><p style=\"min-height:1.5em\">Annual Education Allowance</p></li><li><p style=\"min-height:1.5em\">Annually run off-sites.</p></li></ul><h2>About the team</h2><ul style=\"min-height:1.5em\"><li><p style=\"min-height:1.5em\">We're a startup. It's unstructured.</p></li><li><p style=\"min-height:1.5em\">Collectively founded more than 30 startups.</p></li><li><p style=\"min-height:1.5em\">Globally distributed team with more than 30 different nationalities.</p></li><li><p style=\"min-height:1.5em\">We deeply believe in <a target=\"_blank\" rel=\"noopener noreferrer nofollow\" href=\"https://supabase.com/blog/2022/03/25/should-i-open-source-my-company\">the efficacy of collaborative open source</a>. We support existing communities and tools, rather than building \"yet another xx\".</p></li><li><p style=\"min-height:1.5em\">We \"dogfood\" everything. If you use it in your project, we use it in Supabase.</p></li></ul><h2>Process</h2><ul style=\"min-height:1.5em\"><li><p style=\"min-height:1.5em\">The entire process is fully remote and all communication will happen over email or via video chat.</p></li><li><p style=\"min-height:1.5em\">Once you've submitted your application, the team will review your submission and may reach out for a short screening interview over a video call.</p></li><li><p style=\"min-height:1.5em\">If you pass the screen you will be invited to up to four follow-up interviews. </p></li><li><p style=\"min-height:1.5em\">The calls:</p><ul style=\"min-height:1.5em\"><li><p style=\"min-height:1.5em\">usually take between 20-45 minutes each depending on the interviewer.</p></li><li><p style=\"min-height:1.5em\">most of the time, are all 1:1.</p></li><li><p style=\"min-height:1.5em\">will be with the founders, a member of either the growth or engineering team (depending on the role) and usually one other person from your immediate team or function.</p></li></ul></li><li><p style=\"min-height:1.5em\">Once the interviews are over, the team will meet to discuss several roles and candidates and may:</p><ul style=\"min-height:1.5em\"><li><p style=\"min-height:1.5em\">ask one or two follow-up questions over email or a quick call.</p></li><li><p style=\"min-height:1.5em\">go directly to making an offer.</p></li></ul></li></ul>","tags":"[\"postgres\",\"javascript\",\"typescript\",\"engineering\",\"database\"]","pubDate":"2025-01-07T21:01:44.561Z","link":"https://jobs.ashbyhq.com/supabase/a2ede2c7-3792-4bfd-951d-686267b2b9a8","slug":"senior-auth-engineer-supabase-1550"},{"id":2940223403,"title":"Technical Documentation Specialist (Part-Time, Potential for Full-Time)","company":"Synthflow","image":"https://yt3.googleusercontent.com/d1EZViC7xXJl3O7DDUguF5UgjjvGXpqeKMhl-ivOftHbUeIFJDURN3TR8MnKewBKI44oO3n5HA=s160-c-k-c0x00ffffff-no-rj","description":"<h1>About Synthflow</h1><p style=\"min-height:1.5em\">With Synthflow any business can effortlessly create custom AI phone call agents. No coding or tech skills needed—just your data and ideas for powerful automation.<a target=\"_blank\" rel=\"noopener noreferrer nofollow\" class=\"y171A xmq3o Q7PwXb a-no-hover-decoration\" href=\"https://support.google.com/merchants/answer/14113862\"> </a>We’re at an exciting stage: early but fast-growing. If you love building from the ground up, moving fast, and making a huge impact, you’ll fit right in.</p><p style=\"min-height:1.5em\"></p><h1>About the Role</h1><p style=\"min-height:1.5em\">As a Technical Writer, you’ll bridge the gap between technical teams and end-users. By collaborating with engineers, designers, and product managers, you’ll craft clear, concise documentation that standardizes processes and improves cross-departmental alignment. This is a pivotal role in enhancing both internal and external understanding of our offerings.</p><p style=\"min-height:1.5em\"></p><h1><strong>Key Responsibilities</strong></h1><ul style=\"min-height:1.5em\"><li><p style=\"min-height:1.5em\">Write and maintain user-friendly how-to helpdesk articles.</p></li><li><p style=\"min-height:1.5em\">Develop API and integrations documentation.</p></li><li><p style=\"min-height:1.5em\">Standardize documentation across departments to ensure consistency.</p></li><li><p style=\"min-height:1.5em\">Collaborate with teams to gather and clarify technical information.</p></li><li><p style=\"min-height:1.5em\">Continuously improve documentation based on user feedback.</p></li></ul><h1><strong>What We’re Looking For</strong></h1><ul style=\"min-height:1.5em\"><li><p style=\"min-height:1.5em\">Strong B2B writing skills and the ability to translate technical concepts into clear, concise content.</p></li><li><p style=\"min-height:1.5em\">Experience in early-stage or fast-paced environments.</p></li><li><p style=\"min-height:1.5em\">Familiarity with tools like Confluence, Notion, or similar is a plus.</p></li><li><p style=\"min-height:1.5em\">Self-starter who can manage multiple priorities and deadlines.</p></li><li><p style=\"min-height:1.5em\">Availability to work 20 hours per week with flexibility for growth.</p><p style=\"min-height:1.5em\"></p></li></ul><h1>Why Join Synthflow AI?</h1><ul style=\"min-height:1.5em\"><li><p style=\"min-height:1.5em\"><strong>Own Your Work:</strong> You’ll have real ownership over what you do and see your impact daily.</p></li><li><p style=\"min-height:1.5em\"><strong>Early-Stage Excitement:</strong> Be part of a small team building something huge.</p></li><li><p style=\"min-height:1.5em\"><strong>Equity:</strong> We’re all building this together, and everyone shares in the upside.</p></li><li><p style=\"min-height:1.5em\"><strong>Work on Cool Stuff:</strong> You’ll be documenting cutting-edge technology that’s changing how people interact with AI.</p></li><li><p style=\"min-height:1.5em\"><strong>Remote Flexibility:</strong> Work wherever you’re most productive.</p></li></ul>","tags":"[\"b2b\"]","pubDate":"2025-01-07T18:29:19.695Z","link":"https://jobs.ashbyhq.com/synthflow/a32f9db5-50a4-411d-b0f9-eb4595d6a779","slug":"technical-documentation-specialist-part-time-potential-for-full-time-synthflow-6959"},{"id":6209521937,"title":"Processing Representative","company":"Bobtail","image":"https://media.licdn.com/dms/image/v2/D560BAQHzAQXggf5uQg/company-logo_200_200/company-logo_200_200/0/1688643230676/bobtail_logo?e=1742428800&v=beta&t=P9gHgDHOknAHShwQR1JsLMYGaVscLGTzwmWViGMvnbE","description":"&lt;h2&gt;About Bobtail&lt;/h2&gt;\n&lt;p&gt;Bobtail is dedicated to increasing happiness by eliminating inefficiencies in the supply chain.&amp;nbsp; We envision a supply chain without friction, fraud, waste, and abuse where companies succeed based on the value they create.&amp;nbsp;&amp;nbsp;&lt;/p&gt;\n&lt;p&gt;We work uniquely at Bobtail, where we value teams over individuals and encourage experimentation and iteration to constantly improve.&amp;nbsp; Teams are given flexibility in working towards a shared purpose and given the freedom to decide how they will accomplish their goals.&amp;nbsp;&amp;nbsp;&lt;/p&gt;\n&lt;p&gt;If you are an out-of-the-box thinker that takes a proactive approach in collaborating with others to solve problems and achieve your goals - we would love to talk to you.&amp;nbsp;&amp;nbsp;&lt;/p&gt;\n&lt;p&gt;The things we value:&lt;/p&gt;\n&lt;ol&gt;\n&lt;li&gt;Mission&lt;/li&gt;\n&lt;li&gt;Teams over individuals&lt;/li&gt;\n&lt;li&gt;Collaboration&lt;/li&gt;\n&lt;li&gt;Communication&lt;/li&gt;\n&lt;li&gt;Iteration&lt;/li&gt;\n&lt;li&gt;Experimentation and failing fast&lt;/li&gt;\n&lt;li&gt;Initiative and solutions-oriented approach&lt;/li&gt;\n&lt;li&gt;Documentation&lt;/li&gt;\n&lt;li&gt;Data&lt;/li&gt;\n&lt;li&gt;Mental health and work-life balance&lt;/li&gt;\n&lt;li&gt;Diversity&lt;/li&gt;\n&lt;li&gt;Transparency&lt;/li&gt;\n&lt;/ol&gt;\n&lt;h2&gt;You should apply if you have:&lt;/h2&gt;\n&lt;ul&gt;\n&lt;li&gt;2 years of invoice processing/accounts payable experience preferred&lt;/li&gt;\n&lt;li&gt;Excellent English proficiency - written and verbal&lt;/li&gt;\n&lt;li&gt;Detail and accuracy-oriented individual who enjoys investigating issues&lt;/li&gt;\n&lt;li&gt;Relevant knowledge and experience in cloud computing - Salesforce is a plus&lt;/li&gt;\n&lt;li&gt;Ability to quickly learn new web-based technologies&lt;/li&gt;\n&lt;li&gt;Confidence, as well as strong verbal &amp;amp; written communication skills when interacting with clients&lt;/li&gt;\n&lt;li&gt;Problem solver with the ability to discover problems and find solutions to them&lt;/li&gt;\n&lt;li&gt;A motivated, driven, self-starter...We love those with grit and accountability!&lt;/li&gt;\n&lt;/ul&gt;\n&lt;h2&gt;You will be responsible for:&lt;/h2&gt;\n&lt;ul&gt;\n&lt;li&gt;\n&lt;p&gt;Review, track and approve invoices for funding&lt;/p&gt;\n&lt;/li&gt;\n&lt;li&gt;\n&lt;p&gt;Communicate with brokers to verify invoice details&lt;/p&gt;\n&lt;/li&gt;\n&lt;li&gt;\n&lt;p&gt;Collect required documents from brokers and clients&lt;/p&gt;\n&lt;/li&gt;\n&lt;li&gt;\n&lt;p&gt;Manage the status of invoices according to the provided criteria&lt;/p&gt;\n&lt;/li&gt;\n&lt;li&gt;\n&lt;p&gt;Assist team members from different tiers with complex invoice issues&lt;/p&gt;\n&lt;/li&gt;\n&lt;li&gt;\n&lt;p&gt;Maintain broker &amp;amp; client relationship with consistent follow-ups to strengthen client rapport&lt;/p&gt;\n&lt;/li&gt;\n&lt;li&gt;\n&lt;p&gt;Document - log all communication notes in Bobtail Portal to document invoice notes.&lt;/p&gt;\n&lt;/li&gt;\n&lt;li&gt;\n&lt;p&gt;Communicate - We are committed to growth, so your ability to communicate users’ experiences and understand when and where to escalate is essential&lt;/p&gt;\n&lt;/li&gt;\n&lt;/ul&gt;\n&lt;h2&gt;Benefits&lt;/h2&gt;\n&lt;ul&gt;\n&lt;li&gt;Monthly Mental Break Day&lt;/li&gt;\n&lt;li&gt;Work from home (or wherever)&lt;/li&gt;\n&lt;/ul&gt;\n&lt;h2&gt;Contract&lt;/h2&gt;\n&lt;ul&gt;\n&lt;li&gt;This will be for a 6-month period and will be reviewed at the end of it for possible extensions.&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;&lt;br&gt;Creating a diverse and inclusive workplace is Bobtail’s nucleus. We are an equal opportunity employer and embrace people of different backgrounds, cultures, religions, national origins, races, colors, genders, gender expressions, sexual orientations, ages, marital status, veteran status, experiences, abilities and perspectives.&amp;nbsp;&lt;br&gt;&lt;br&gt;&lt;/p&gt;","tags":"[]","pubDate":"2025-01-07T15:08:56.000Z","link":"https://job-boards.greenhouse.io/bobtail/jobs/4514075005","slug":"processing-representative-bobtail-5842"},{"id":6718331384,"title":"Technical Customer Success Intern (Potential for Full-Time Conversion)","company":"Synthflow","image":"https://yt3.googleusercontent.com/d1EZViC7xXJl3O7DDUguF5UgjjvGXpqeKMhl-ivOftHbUeIFJDURN3TR8MnKewBKI44oO3n5HA=s160-c-k-c0x00ffffff-no-rj","description":"<p style=\"min-height:1.5em\"><em>This is a fully remote role, allowing you to work from anywhere in the world.</em></p><p style=\"min-height:1.5em\"></p><h1><strong>About Synthflow</strong></h1><p style=\"min-height:1.5em\">At Synthflow, we’re building the easiest way for businesses to create AI-powered phone agents. It’s an exciting time at Synthflow: we’re early, fast-growing, and laser-focused on impact. Join us to do the best work of your career while helping businesses thrive.</p><p style=\"min-height:1.5em\"></p><h1><strong>About the Role</strong></h1><p style=\"min-height:1.5em\">We’re seeking a proactive and motivated <strong>Technical Customer Success Intern</strong> to join our team. In this role, you’ll play a key part in ensuring a seamless experience for our customers by managing our customer support tools, handling customer inquiries, and assisting with operational tasks. This internship is a unique opportunity to learn, grow, and potentially transition into a full-time role at Synthflow.</p><p style=\"min-height:1.5em\"></p><h1><strong>What You’ll Do</strong></h1><ul style=\"min-height:1.5em\"><li><p style=\"min-height:1.5em\"><strong>Master Zendesk</strong>: Handle 20-30+ new tickets per day in Zendesk, covering everything from billing issues to helping customers implement API requests. </p></li><li><p style=\"min-height:1.5em\"><strong>Customer Support Excellence</strong>: Respond to customer inquiries via Zendesk and email, providing thoughtful and timely resolutions.</p></li><li><p style=\"min-height:1.5em\"><strong>Operational Assistance</strong>: Handle tasks like processing refunds and supporting other operational needs as required.</p></li><li><p style=\"min-height:1.5em\"><strong>Continuous Learning</strong>: Stay on top of product updates and features to assist customers effectively.</p></li><li><p style=\"min-height:1.5em\"><strong>Customer Advocacy</strong>: Create bug reports and feature requests on behalf of customers, and advocate for their prioritization.</p></li><li><p style=\"min-height:1.5em\"><strong>Product Improvement: </strong>Test new features and functions before they are released to customers.</p><p style=\"min-height:1.5em\"></p></li></ul><h1><strong>What You Bring</strong></h1><ul style=\"min-height:1.5em\"><li><p style=\"min-height:1.5em\"><strong>Eagerness to Learn</strong>: Commitment to continuous learning and skill development, particularly in technical domains.</p></li><li><p style=\"min-height:1.5em\"><strong>Technical Mindset: </strong>Ability to distill complex technical concepts into clear, actionable solutions.</p></li><li><p style=\"min-height:1.5em\"><strong>Strong Communication Skills</strong>: Outstanding written communication skills, with ability to adapt tone and technical depth to audience.</p></li><li><p style=\"min-height:1.5em\"><strong>Proactive Attitude: </strong>Self-directed work style with strong independent decision-making capabilities.</p></li><li><p style=\"min-height:1.5em\"><strong>Customer Passion</strong>: Passion for customer support with drive to excel in fast-paced environments.</p></li></ul><p style=\"min-height:1.5em\"></p><h1><strong>Why Join Synthflow?</strong></h1><ul style=\"min-height:1.5em\"><li><p style=\"min-height:1.5em\"><strong>Full-Time Potential</strong>: Successful interns may be offered a full-time role, allowing you to grow with the company.</p></li><li><p style=\"min-height:1.5em\"><strong>Ownership</strong>: You’ll have real ownership over your work and see the impact of your contributions daily.</p></li><li><p style=\"min-height:1.5em\"><strong>Early-Stage Excitement</strong>: Be part of a small, agile team building something transformative.</p></li><li><p style=\"min-height:1.5em\"><strong>Cutting-Edge Tech</strong>: Work with innovative technology that’s reshaping how businesses interact with AI.</p></li><li><p style=\"min-height:1.5em\"><strong>Remote Flexibility</strong>: Work wherever you’re most productive—no commute, no limits.</p></li></ul><p style=\"min-height:1.5em\"></p><h2><strong>Apply Now! </strong>If you’re ready to kickstart your career in customer success and contribute to building something remarkable, we’d love to hear from you!</h2>","tags":"[]","pubDate":"2025-01-07T14:58:31.832Z","link":"https://jobs.ashbyhq.com/synthflow/79ca0f27-621f-4e5f-b9db-e74aa069784b","slug":"technical-customer-success-intern-potential-for-full-time-conversion-synthflow-3167"},{"id":9949198578,"title":"[ORM Agency] CEO/COO/Managing Director | Ruby Labs","company":"Ruby Labs","image":"https://media.licdn.com/dms/image/v2/D4D0BAQF7VVv61POIFw/company-logo_200_200/company-logo_200_200/0/1721937953426?e=1743033600&v=beta&t=_qAkZ_qGO7Du2NSUdHDNbUKIbz28Y1HDm1g9mwNIOnk","description":"<h1><strong>About us</strong></h1><p style=\"min-height:1.5em\">Ruby Labs is a leading tech company that creates and operates innovative consumer products. We offer a diverse range of opportunities across the health, education, and entertainment industries. Our innovative teams are driving the future of consumer-led products, and we're always looking for passionate individuals to join us. Learn more about our story at: <a target=\"_blank\" rel=\"noopener noreferrer nofollow\" href=\"https://rubylabs.com/about-us/\">https://rubylabs.com/about-us/</a></p><p style=\"min-height:1.5em\"></p><h1><strong>Role </strong></h1><p style=\"min-height:1.5em\">We are establishing a new B2B Online Reputation Management (ORM) company and seeking a Managing Director to oversee its operations. Over the past few years, we have developed strong relationships with providers who can enhance reputation across multiple platforms. We are now confident in our ability to deliver high-quality ORM services both to our own products and external clients, helping them improve their online image and address reputation challenges.</p><p style=\"min-height:1.5em\">The Managing Director will be responsible for daily operations management, sales leadership, business execution, and building a world-class team. The company will operate as a full-service ORM provider, specializing in SEO optimization, review management, public relations, and reputation strategy.</p><p style=\"min-height:1.5em\">In this role, you will build and lead a team focused on sales development, external client engagement, contract negotiations, and service delivery to third parties. This is an opportunity to develop a comprehensive ORM operation serving both internal products and external clients, while establishing strong client relationships across the industry.</p><p style=\"min-height:1.5em\"></p><p style=\"min-height:1.5em\"><strong>Profit Share</strong></p><p style=\"min-height:1.5em\">This role comes with the profit share incentive and stock option that is quite generous for this role, more details would be shared at the interview.</p><p style=\"min-height:1.5em\"></p><p style=\"min-height:1.5em\"><strong>The team</strong></p><p style=\"min-height:1.5em\">You will be building a strong team with high talent density who enjoy working in our fast-paced, 100% remote environment.</p><p style=\"min-height:1.5em\"></p><p style=\"min-height:1.5em\"><strong>Employment</strong></p><p style=\"min-height:1.5em\">We offer an <a target=\"_blank\" rel=\"noopener noreferrer nofollow\" href=\"https://docs.google.com/document/d/1dHF4ctKlez75whdn-ybUwP5d5Wr0BdwVrorrm_fM40Q/preview\"><u>Independent Contractor Agreement</u></a> for this position.</p><p style=\"min-height:1.5em\"></p><p style=\"min-height:1.5em\"><strong>About you</strong></p><p style=\"min-height:1.5em\">We seek a dynamic, hands-on leader with extensive B2B experience, particularly in agency leadership (preferably in advertising, online reputation management, or similar service-based organizations). The ideal candidate should have a proven track record in sales and relationship building, while excelling at driving growth and innovation. They must demonstrate a deep understanding of product development, marketing strategies, and growth initiatives.</p><p style=\"min-height:1.5em\">In this role, you will lead all departments, focusing on executing strategic initiatives and optimizing company-wide performance. The position requires proven abilities in team management, delivering results and engaging deeply with operational aspects of the business. These qualities will be essential in steering our company toward continued success.</p><p style=\"min-height:1.5em\"></p><p style=\"min-height:1.5em\"><strong>What you’ll do</strong></p><ul style=\"min-height:1.5em\"><li><p style=\"min-height:1.5em\">Lead the company's strategic growth by developing and executing initiatives that drive business expansion, optimize market positioning, and advance overall progress.</p></li><li><p style=\"min-height:1.5em\">Lead cross-functional teams in executing complex strategic initiatives, ensuring alignment across product development, growth, marketing, and sales.</p></li><li><p style=\"min-height:1.5em\">Drive revenue growth and profitability while optimizing operational expenses.</p></li><li><p style=\"min-height:1.5em\">Oversee the product development lifecycle, from ideation to launch, ensuring products meet market needs and quality standards.</p></li><li><p style=\"min-height:1.5em\">Collaborate closely with engineering teams to deliver innovative solutions that align with customer expectations and business goals.</p></li><li><p style=\"min-height:1.5em\">Ensure that the product roadmap is aligned with business strategy and customer feedback.</p></li><li><p style=\"min-height:1.5em\">Oversee marketing campaigns, ensuring they are data-driven, customer-centric, and aligned with product launches and sales strategies.</p></li><li><p style=\"min-height:1.5em\">Utilize data analytics to refine and optimize growth strategies, ensuring sustainable revenue growth.</p></li><li><p style=\"min-height:1.5em\">Continuously monitor and analyze key financial and operational metrics, such as revenue growth, EBITDA margins, and customer acquisition costs (CAC).</p></li><li><p style=\"min-height:1.5em\">Evaluate customer lifetime value (LTV) and return on ad spend (ROAS) to optimize marketing efficiency and resource allocation.</p></li><li><p style=\"min-height:1.5em\">Track onboarding conversion rates to identify areas for improvement in user experience and increase customer activation and analyze average revenue per user (ARPU) and user retention rates to inform product development and enhance long-term profitability.</p></li></ul><p style=\"min-height:1.5em\"></p><p style=\"min-height:1.5em\"><strong>What we offer</strong></p><ul style=\"min-height:1.5em\"><li><p style=\"min-height:1.5em\"><strong>Remote Work Environment:</strong> Embrace the freedom of working from anywhere, anytime, fostering a better work-life balance.</p></li><li><p style=\"min-height:1.5em\"><strong>Stock options:</strong> We acknowledge the commitment required for the COO role. Hence, we offer generous company stock options and revenue sharing to appreciate and reward your hard work.</p></li><li><p style=\"min-height:1.5em\"><strong>Company-provided MacBook:</strong> We offer employees access to powerful MacBooks if needed, ensuring top-notch performance, energy efficiency, and seamless productivity.</p></li></ul><p style=\"min-height:1.5em\"></p><h1><strong>Life at Ruby Labs</strong></h1><p style=\"min-height:1.5em\">At Ruby Labs, we are more than a team; we're a community united in pushing the boundaries of technology and innovation. Our combined passion fuels our ambition for excellence, driving impact that resonates around the globe.</p><p style=\"min-height:1.5em\">We are an equal-opportunity employer and celebrate diversity, recognizing that a diversity of thought and backgrounds builds stronger teams. We approach diversity and inclusion seriously and thoughtfully. We do not discriminate based on race, ethnicity, religion, color, place of birth, sex, gender identity or expression, sexual orientation, age, marital status, military service status, or disability status. Join us and be part of a company that is crafting the future of technology across multiple industries.</p><p style=\"min-height:1.5em\"></p><p style=\"min-height:1.5em\">#Li-Remote</p>","tags":"[\"management\",\"engineering\",\"b2b\"]","pubDate":"2025-01-07T11:15:31.470Z","link":"https://jobs.ashbyhq.com/ruby-labs/33f2149f-24e0-47c2-a3da-3bf48bea8f7a","slug":"orm-agency-ceo-coo-managing-director-ruby-labs-ruby-labs-999"},{"id":8920387399,"title":"[PropTech] CEO/Managing Director | Ruby Labs","company":"Ruby Labs","image":"https://media.licdn.com/dms/image/v2/D4D0BAQF7VVv61POIFw/company-logo_200_200/company-logo_200_200/0/1721937953426?e=1743033600&v=beta&t=_qAkZ_qGO7Du2NSUdHDNbUKIbz28Y1HDm1g9mwNIOnk","description":"<h1><strong>About us</strong></h1><p style=\"min-height:1.5em\">Ruby Labs is a leading tech company that creates and operates innovative consumer products. We offer a diverse range of opportunities across the health, education, and entertainment industries. Our innovative teams are driving the future of consumer-led products, and we're always looking for passionate individuals to join us. Learn more about our story at: <a target=\"_blank\" rel=\"noopener noreferrer nofollow\" href=\"https://rubylabs.com/about-us/\">https://rubylabs.com/about-us/</a></p><p style=\"min-height:1.5em\"></p><h1><strong>Role</strong></h1><p style=\"min-height:1.5em\">We are creating a new product in the PropTech category, specifically an FTMO-style funded trading platform. We are looking for a Managing Director who can take care of day-to-day operations, execution, and building a world-class team. The platform will offer traders the opportunity to trade with company capital after passing evaluation challenges, similar to established services like FundedNext and FundedPips.</p><p style=\"min-height:1.5em\"></p><h1></h1><p style=\"min-height:1.5em\"><strong>Profit Share</strong></p><p style=\"min-height:1.5em\">This role comes with the profit share incentive and stock option that is quite generous for this role, more details would be shared at the interview.</p><p style=\"min-height:1.5em\"></p><p style=\"min-height:1.5em\"><strong>The team</strong></p><p style=\"min-height:1.5em\">You will be building a strong team with high talent density who enjoy working in our fast-paced, 100% remote environment.</p><p style=\"min-height:1.5em\"></p><p style=\"min-height:1.5em\"><strong>Employment</strong></p><p style=\"min-height:1.5em\">We offer an <a target=\"_blank\" rel=\"noopener noreferrer nofollow\" href=\"https://docs.google.com/document/d/1dHF4ctKlez75whdn-ybUwP5d5Wr0BdwVrorrm_fM40Q/preview\"><u>Independent Contractor Agreement</u></a> for this position.</p><p style=\"min-height:1.5em\"></p><p style=\"min-height:1.5em\"><strong>About you</strong></p><p style=\"min-height:1.5em\">You are a dynamic and hands-on leader with extensive experience in the direct to consumer products (preferably prop-tech, forex, trading or subscriptions). You excel at driving growth and innovation, with a deep understanding of engineering, product, marketing, and growth strategies. In this role, you will be at the forefront, leading all departments with a focus on executing strategic initiatives and optimizing performance across the board. Your proven ability to manage teams, deliver results under pressure, and deeply engage in the technical and operational aspects of the business makes you the ideal candidate to steer our company towards continued success.</p><p style=\"min-height:1.5em\"></p><p style=\"min-height:1.5em\"><strong>What you’ll do</strong></p><ul style=\"min-height:1.5em\"><li><p style=\"min-height:1.5em\">Lead the company's strategic growth by developing and executing initiatives that drive business expansion, optimize market positioning, and advance overall progress.</p></li><li><p style=\"min-height:1.5em\">Lead cross-functional teams in executing complex strategic initiatives, ensuring alignment across engineering, product development, growth, marketing, and sales.</p></li><li><p style=\"min-height:1.5em\">Drive revenue growth and profitability while optimizing operational expenses.</p></li><li><p style=\"min-height:1.5em\">Oversee the product development lifecycle, from ideation to launch, ensuring products meet market needs and quality standards.</p></li><li><p style=\"min-height:1.5em\">Collaborate closely with engineering teams to deliver innovative solutions that align with customer expectations and business goals.</p></li><li><p style=\"min-height:1.5em\">Demonstrate a solid understanding of engineering concepts, including current trends such as artificial intelligence (AI), and best practices like modern code patterns and DevOps practices.</p></li><li><p style=\"min-height:1.5em\">Ensure that the product roadmap is aligned with business strategy and customer feedback.</p></li><li><p style=\"min-height:1.5em\">Oversee marketing campaigns, ensuring they are data-driven, customer-centric, and aligned with product launches and sales strategies.</p></li><li><p style=\"min-height:1.5em\">Utilize data analytics to refine and optimize growth strategies, ensuring sustainable revenue growth.</p></li><li><p style=\"min-height:1.5em\">Continuously monitor and analyze key financial and operational metrics, such as revenue growth, EBITDA margins, and customer acquisition costs (CAC).</p></li><li><p style=\"min-height:1.5em\">Evaluate customer lifetime value (LTV) and return on ad spend (ROAS) to optimize marketing efficiency and resource allocation.</p></li><li><p style=\"min-height:1.5em\">Track onboarding conversion rates to identify areas for improvement in user experience and increase customer activation and analyze average revenue per user (ARPU) and user retention rates to inform product development and enhance long-term profitability.</p></li></ul><p style=\"min-height:1.5em\"></p><p style=\"min-height:1.5em\"><strong>What we offer</strong></p><ul style=\"min-height:1.5em\"><li><p style=\"min-height:1.5em\"><strong>Remote Work Environment:</strong> Embrace the freedom of working from anywhere, anytime, fostering a better work-life balance.</p></li><li><p style=\"min-height:1.5em\"><strong>Stock options:</strong> We acknowledge the commitment required for the COO role. Hence, we offer generous company stock options and revenue sharing to appreciate and reward your hard work.</p></li><li><p style=\"min-height:1.5em\"><strong>Company-provided MacBook:</strong> We offer employees access to powerful MacBooks if needed, ensuring top-notch performance, energy efficiency, and seamless productivity.</p><p style=\"min-height:1.5em\"></p></li></ul><h1><strong>Life at Ruby Labs</strong></h1><p style=\"min-height:1.5em\">At Ruby Labs, we are more than a team; we're a community united in pushing the boundaries of technology and innovation. Our combined passion fuels our ambition for excellence, driving impact that resonates around the globe.</p><p style=\"min-height:1.5em\">We are an equal-opportunity employer and celebrate diversity, recognizing that a diversity of thought and backgrounds builds stronger teams. We approach diversity and inclusion seriously and thoughtfully. We do not discriminate based on race, ethnicity, religion, color, place of birth, sex, gender identity or expression, sexual orientation, age, marital status, military service status, or disability status. Join us and be part of a company that is crafting the future of technology across multiple industries.</p><p style=\"min-height:1.5em\"></p><p style=\"min-height:1.5em\">#Li-Remote</p>","tags":"[\"engineering\"]","pubDate":"2025-01-07T11:03:48.967Z","link":"https://jobs.ashbyhq.com/ruby-labs/cf008ac2-e871-45f4-b4a6-db8266c52e87","slug":"proptech-ceo-managing-director-ruby-labs-ruby-labs-7319"},{"id":7067053732,"title":"Motion Designer ","company":"Ruby Labs","image":"https://media.licdn.com/dms/image/v2/D4D0BAQF7VVv61POIFw/company-logo_200_200/company-logo_200_200/0/1721937953426?e=1743033600&v=beta&t=_qAkZ_qGO7Du2NSUdHDNbUKIbz28Y1HDm1g9mwNIOnk","description":"<h1><strong>About us</strong></h1><p style=\"min-height:1.5em\">Hint is a popular astrology app with over 35 million downloads, providing hyper-personalized astrology services through its digital subscription product. The insights offered by Hint are uniquely crafted for each individual by combining the knowledge of our professional human astrologers with our AI engine.</p><p style=\"min-height:1.5em\"></p><h1><strong>About the role</strong></h1><p style=\"min-height:1.5em\">As a Creative Designer, you will be responsible for creating and designing a wide range of creatives (including static images and videos) for performance and branding campaigns across multiple platforms such as Google, Facebook, TikTok, and others. Your designs will play a crucial role in our marketing efforts, driving engagement and conversions. Experience in entertainment and fintech apps is a significant plus, as it will enable you to create designs that resonate with our target audience.</p><p style=\"min-height:1.5em\"></p><h1><strong>Responsibilities</strong></h1><ul style=\"min-height:1.5em\"><li><p style=\"min-height:1.5em\">Develop and design high-quality creatives (including static images and videos) for performance and branding campaigns across various digital channels.</p></li><li><p style=\"min-height:1.5em\">Collaborate with the marketing team to understand campaign objectives and create designs that align with our brand and marketing goals.</p></li><li><p style=\"min-height:1.5em\">Produce engaging and effective creatives for Google, Facebook, TikTok, and other advertising platforms.</p></li><li><p style=\"min-height:1.5em\">Ensure all designs adhere to brand guidelines and maintain a consistent visual identity across all marketing materials.</p></li><li><p style=\"min-height:1.5em\">Stay updated with the latest design trends, tools, and technologies to ensure our creatives are cutting-edge and effective.</p></li><li><p style=\"min-height:1.5em\">Work closely with the marketing and content teams to brainstorm and develop creative concepts and ideas.</p></li><li><p style=\"min-height:1.5em\">Manage multiple design projects simultaneously, ensuring timely delivery and high-quality output.</p></li><li><p style=\"min-height:1.5em\">Utilize feedback from stakeholders to continuously refine and improve designs.</p></li></ul><p style=\"min-height:1.5em\"></p><h1><strong>Technical qualifications</strong></h1><ul style=\"min-height:1.5em\"><li><p style=\"min-height:1.5em\"><strong>Design Software:</strong> Proficiency in Adobe Creative Suite (Photoshop, Illustrator, After Effects, Premiere Pro) and other design tools. Efficiency with AI tools is a plus.</p></li><li><p style=\"min-height:1.5em\"><strong>Video Editing and Animation:</strong> Strong skills in video editing and animation, particularly for creating engaging video ads.</p></li><li><p style=\"min-height:1.5em\"><strong>Creative Thinking:</strong> Ability to think creatively and develop innovative design concepts that capture attention and drive engagement.</p></li><li><p style=\"min-height:1.5em\"><strong>Attention to Detail:</strong> Strong attention to detail, ensuring all designs are visually appealing and free of errors.</p></li><li><p style=\"min-height:1.5em\"><strong>Time Management:</strong> Excellent time management skills, with the ability to manage multiple projects and meet deadlines.</p></li></ul><p style=\"min-height:1.5em\"></p><h1>Nice to have</h1><ul style=\"min-height:1.5em\"><li><p style=\"min-height:1.5em\">Background in fintech, with particular expertise in topics like investing, to create designs that resonate with our specific target audience.</p></li><li><p style=\"min-height:1.5em\">Background in entertainment, with particular expertise in dating apps or astrology apps.</p></li></ul><p style=\"min-height:1.5em\"></p><h1><strong>Location</strong></h1><p style=\"min-height:1.5em\">Hint operates within the CET (Central European Time) time zone. Applicants from any country are welcome to apply for the position as long as they are located within approximately ± 4 hours of CET. This ensures optimal collaboration and communication during working hours.</p><p style=\"min-height:1.5em\"></p><h1><strong>Benefits</strong></h1><p style=\"min-height:1.5em\">Discover the perks of being part of our vibrant team! We offer:</p><ul style=\"min-height:1.5em\"><li><p style=\"min-height:1.5em\"><strong>Remote Work Environment</strong>: Embrace the freedom to work from anywhere, anytime, promoting a healthy work-life balance. 🏡⏰</p></li><li><p style=\"min-height:1.5em\"><strong>Unlimited PTO</strong>: Enjoy unlimited paid time off to recharge and prioritize your well-being, without counting days. 🌴💼</p></li><li><p style=\"min-height:1.5em\"><strong>Paid National Holidays</strong>: Celebrate and relax on national holidays with paid time off to unwind and recharge. 🎉🌟</p></li><li><p style=\"min-height:1.5em\"><strong>Company-provided MacBook</strong>: Experience seamless productivity with top-notch Apple MacBooks provided to all employees who need them. 💻🚀</p></li><li><p style=\"min-height:1.5em\"><strong>Flexible Independent Contractor Agreement</strong>: Unlock the benefits of flexibility, autonomy, and entrepreneurial opportunities. Benefit from tax advantages, networking opportunities, reduced employment obligations, and the freedom to work from anywhere. Read more about it here: <a target=\"_blank\" rel=\"noopener noreferrer nofollow\" href=\"https://wiki.rubylabs.com/s/b11227c3-fa74-4c39-bd1d-3e59056a2cf4\">https://wiki.rubylabs.com/s/b11227c3-fa74-4c39-bd1d-3e59056a2cf4</a> 📈💼</p></li></ul><p style=\"min-height:1.5em\">Be part of our fast-growing team and seize this excellent opportunity for personal and professional growth!</p><p style=\"min-height:1.5em\"></p><h1><strong>Life at Hint</strong></h1><p style=\"min-height:1.5em\">By joining Hint, you’ll become part of a team that picks each other up, collaborates daily, and works hard, fast, and intelligent because they’re motivated and passionate about being the best in the industry. We thrive on innovation, push the boundaries, and are proud of our work!</p><p style=\"min-height:1.5em\"></p><p style=\"min-height:1.5em\">#Li-Remote</p>","tags":"[\"management\"]","pubDate":"2025-01-07T09:48:08.627Z","link":"https://jobs.ashbyhq.com/ruby-labs/ef682061-9234-4418-a8f4-f0ef7bafdb15","slug":"motion-designer-ruby-labs-3230"},{"id":1873545561,"title":"Senior Production Risk Engineer - Professional Liability","company":"Counterpart","image":"https://media.licdn.com/dms/image/v2/D560BAQEtAXn0ryOTBw/company-logo_200_200/company-logo_200_200/0/1694785555271/yourcounterpart_logo?e=1744243200&v=beta&t=-BEjbQP7PMMfAC5PtCYEgvJk4MuWZ4Bfzh54loGzpwo","description":"&lt;p&gt;&lt;strong&gt;SENIOR PRODUCTION RISK ENGINEER - PROFESSIONAL LIABILITY&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;Counterpart believes in small businesses and is dedicated to helping them do more with less risk. By pairing leading insurance experts with cutting-edge technology, Counterpart empowers small business owners to grow with confidence. Exceptional underwriters, trusted insurance brokers, and prominent insurance carriers come together on the Counterpart platform to support small businesses by providing AI-driven management and professional liability underwriting and claims services. That’s where you come in…&lt;/p&gt;\n&lt;p&gt;As a member of the risk engineering team, you will be responsible for the production of premium through proper risk analysis and effective distribution of our product. In collaboration with the engineering, design, data, and operations team, you will leverage your industry knowledge and broker relationships to develop management liability and professional liability insurance products that brokers are eager to promote to their clients.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;AS A PRODUCTION FOCUSED RISK ENGINEER YOU WILL:&lt;/strong&gt;&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;Achieve and exceed underwriting performance and revenue goals, underwriting in accordance with our stated procedures.&lt;/li&gt;\n&lt;li&gt;Price accounts with competitive terms quickly, thoughtfully, and in accordance with our guidelines.&lt;/li&gt;\n&lt;li&gt;Manage quote related communication and questions in a thoughtful and trusting manner.&lt;/li&gt;\n&lt;li&gt;Collaborate with the underwriting team of Risk Engineers on understanding the unique exposures of complex accounts.&lt;/li&gt;\n&lt;li&gt;Provide market feedback and recommend improvements to our terms, rates, and guidelines improving our policy forms and coverages&amp;nbsp;&lt;/li&gt;\n&lt;li&gt;Bind accounts through the continuous engagement of your assigned brokers.&lt;/li&gt;\n&lt;li&gt;Represent Counterpart at broker meetings and various industry events.&amp;nbsp;&lt;/li&gt;\n&lt;li&gt;Contribute ideas and feedback on our suite of tools and services as a key stakeholder of our product roadmap.&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;&lt;strong&gt;WE LOOK FOR TEAMMATES WHO HAVE:&lt;/strong&gt;&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;3-7 years of underwriting experience in the respective product.&lt;/li&gt;\n&lt;li&gt;A pre-existing network of brokers, carriers, underwriters, or clients in the professional liability insurance space.&lt;/li&gt;\n&lt;li&gt;Expertise in various aspects of specialty liability products (e.g. rating procedures, policy forms, applications and coverage endorsements).&amp;nbsp;&lt;/li&gt;\n&lt;li&gt;Ability to successfully engage with brokers to establish long-term, profitable partnerships with brokerages.&lt;/li&gt;\n&lt;li&gt;Confidence presenting to key internal and external stakeholders.&amp;nbsp;&lt;/li&gt;\n&lt;li&gt;Demonstrated success with high performing sales and account management practices.&lt;/li&gt;\n&lt;li&gt;A proven track record of success, achieving and exceeding monthly, quarterly and annual targets.&lt;/li&gt;\n&lt;li&gt;Enthusiasm for continuous challenges in a high velocity environment.&lt;/li&gt;\n&lt;li&gt;Flexibility for travel, when necessary (once per month as a minimum)&lt;/li&gt;\n&lt;li&gt;College Degree with relevant work experience of 4+ years.&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;&lt;strong&gt;WHO YOU WILL WORK WITH:&amp;nbsp;&lt;/strong&gt;&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;&lt;strong&gt;Mike Levins, Head of Insurance&lt;/strong&gt;: Mike previously was the Head of Broker Relations and US MGA Operations at Hiscox. Mike oversaw the Midwest region with ~20 underwriters offering 13 different product lines, the primary lines being management liability, professional liability, and cyber/technology. His extensive insurance career has afforded Mike strong relationships across hundreds of retail and wholesale brokers. Mike received his BS from Marquette University and MBA from Benedictine University.&lt;/li&gt;\n&lt;li&gt;&lt;strong&gt;Tanner Hackett, CEO:&lt;/strong&gt; Having founded two other major startups, including Button and Lazada, Tanner now spends his time focused on mental health through his philanthropy,&lt;a href=&quot;http://openminded.org&quot;&gt; Openminded.org&lt;/a&gt;, in addition to reading, surfing, yoga, and enjoying the outdoors.&amp;nbsp;&lt;/li&gt;\n&lt;li&gt;&lt;strong&gt;Satwik Mysore, Risk Engineer Territory Lead: &lt;/strong&gt;After graduating with an actuarial science degree, Satwik has spent most of his career at Travelers, where he built one of the largest and most profitable management liability books by forming strong broker relationships.&lt;/li&gt;\n&lt;li&gt;&lt;strong&gt;Brad Bahler, Risk Engineer Territory Lead:&lt;/strong&gt; Brad has over a decade of experience in management liability underwriting. He managed one of the largest books of small business management liability risks at Travelers, where he was known for his deep understanding of coverage, outstanding submission response times, and boundless enthusiasm for the space.&lt;/li&gt;\n&lt;li&gt;&lt;strong&gt;Jake O’Donnell, Risk Engineer Territory Lead: &lt;/strong&gt;Jake started his insurance career at Chubb, where he was able to develop and grow a profitable book of private-for-profit and non-profit management liability business. Jake is known for his exceptional service to industry brokers and his extensive knowledge of management liability. Jake also is a CPCU designation recipient.&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;&lt;strong&gt;WHAT WE OFFER&lt;/strong&gt;&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;&lt;strong&gt;Fully remote workplace&lt;/strong&gt;&lt;/li&gt;\n&lt;li&gt;&lt;strong&gt;Unlimited Vacation&lt;/strong&gt;: We offer flexible time off, allowing you to take time when you need it.&lt;/li&gt;\n&lt;li&gt;&lt;strong&gt;Work from Anywhere&lt;/strong&gt;: Counterpart is a fully distributed company, meaning there is no office. We allow employees to work from wherever they do their best work, and invite the team to meet in person a couple times per year.&lt;/li&gt;\n&lt;li&gt;&lt;strong&gt;Stock Options&amp;nbsp;&lt;/strong&gt;&lt;/li&gt;\n&lt;li&gt;&lt;strong&gt;Health, Dental, and Vision Coverage&lt;/strong&gt;&lt;/li&gt;\n&lt;li&gt;&lt;strong&gt;401(k) Retirement Plan&lt;/strong&gt;&lt;/li&gt;\n&lt;li&gt;&lt;strong&gt;Parental Leave&lt;/strong&gt;&lt;/li&gt;\n&lt;li&gt;&lt;strong&gt;Home Office Allowance&lt;/strong&gt;: &lt;strong&gt;to set up your home office&lt;/strong&gt; with the necessary equipment and accessories.&lt;/li&gt;\n&lt;li&gt;&lt;strong&gt;Wellness Stipend&lt;/strong&gt;&lt;/li&gt;\n&lt;li&gt;&lt;strong&gt;Book stipend&lt;/strong&gt;&lt;/li&gt;\n&lt;li&gt;&lt;strong&gt;Professional Development Reimbursement&lt;/strong&gt;&lt;/li&gt;\n&lt;li&gt;&lt;strong&gt;No working birthdays&lt;/strong&gt;: &lt;strong&gt;Take your birthday off&lt;/strong&gt;, giving you the opportunity to relax, enjoy your special day, and spend time with loved ones.&lt;/li&gt;\n&lt;li&gt;&lt;strong&gt;Charitable Contribution Matching&lt;/strong&gt;&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;&lt;strong&gt;COUNTERPART&#39;S VALUES&lt;/strong&gt;&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;&lt;strong&gt;Conjoin Expectations&lt;/strong&gt; - it is the cornerstone of autonomy. Ensure you are aware of what is expected of you and clearly articulate what you expect of others.&amp;nbsp;&lt;/li&gt;\n&lt;li&gt;&lt;strong&gt;Speak Boldly &amp;amp; Honestly&lt;/strong&gt; - the only failure is not learning from mistakes. Don’t cheat yourself and your colleagues of the feedback needed when&amp;nbsp; expectations aren’t being met.&amp;nbsp;&lt;/li&gt;\n&lt;li&gt;&lt;strong&gt;Be Entrepreneurial&lt;/strong&gt; - control your own destiny.&amp;nbsp; Embrace action over perfection while navigating any obstacles that stand in the way of your ultimate goal.&amp;nbsp;&lt;/li&gt;\n&lt;li&gt;&lt;strong&gt;Practice Omotenashi&lt;/strong&gt; (“selfless hospitality”) - trust will follow.&amp;nbsp; Consider every interaction with internal and external partners an opportunity to develop trust by going above and beyond what is expected.&amp;nbsp;&lt;/li&gt;\n&lt;li&gt;&lt;strong&gt;Hold Nothing As Sacred&lt;/strong&gt; - create routines but modify them routinely.&lt;strong&gt;&amp;nbsp; &lt;/strong&gt;Take the time to reflect on where the business is today, where it needs to&amp;nbsp; go, and what you have to change in order to get there.&amp;nbsp;&lt;/li&gt;\n&lt;li&gt;&lt;strong&gt;Prioritize Wellness&lt;/strong&gt; - some things should never be sacrificed. We create an environment that stretches everyone to grow and improve, which is fulfilling, but is only one part of a meaningful life.&lt;br&gt;&lt;br&gt;&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;Our estimated pay range for this role is $140,000 to $160,000. Base salary is determined by a variety of factors, including but not limited to, market data, location, internal equitability, and experience.&lt;/p&gt;\n&lt;p&gt;We are committed to being a welcoming and inclusive workplace for everyone, and we are intentional about making sure people feel respected, supported and connected at work—regardless of who you are or where you come from. We value and celebrate our differences and we believe being open about who we are allows us to do the best work of our lives.&amp;nbsp;&lt;/p&gt;\n&lt;p&gt;We are an Equal Opportunity Employer. We do not discriminate against qualified applicants or employees on the basis of race, color, religion, gender identity, sex, sexual preference, sexual identity, pregnancy, national origin, ancestry, citizenship, age, marital status, physical disability, mental disability, medical condition, military status, or any other characteristic protected by federal, state, or local law, rule, or regulation.&amp;nbsp;&lt;/p&gt;\n&lt;p&gt;&lt;br&gt;&lt;br&gt;&lt;/p&gt;","tags":"[\"management\",\"engineering\"]","pubDate":"2025-01-06T15:20:30.000Z","link":"https://job-boards.greenhouse.io/counterpart/jobs/4488606005","slug":"senior-production-risk-engineer-professional-liability-counterpart-5117"},{"id":9119356868,"title":"Technical Documentation Specialist","company":"Juakali","image":"https://remotive.com/job/1961619/logo","description":"<p><em>Who are we?</em></p>\n<p>We are Juakali, a FinTech start-up providing a platform for the microfinance lending market. Juakali empowers Financial Institutions with seamless, flexible, and powerful tools designed to boost their productivity. 100% bank-grade, best-of-breed technology.</p>\n<p>Although we are a small start-up, we are already global, our people work from all around the world. In the span of 4 years, we have employees and customers in more than 10 countries in Africa and Asia. Our teams are remote, working from wherever they are. It gives our people freedom; we only ask them to be responsible.</p>\n<p>You can work from anywhere you like as well as long as you have an internet connection, our office is located in Slack.</p>\n<p>What role will you play?</p>\n<p>The need for clear instruction is vital in business, we are looking for a skilled technical writer who can typically develop product manuals, how-to guides, website help sections, journal articles, user guides, API Developer guides, and other content that distils technical information with ease and clarity.</p>\n<ul style=\"\">\n<li style=\"\">Develop Inclusive documentation that meets organisation needs.</li>\n<li style=\"\">Research, outline, write and edit new and existing content.</li>\n<li style=\"\">Writing user-friendly content that meets the need for technical information and ease of understanding.</li>\n<li style=\"\">Obtain a deep understanding of products and services and translate complex information into simple and engaging formats going beyond traditional documentation.</li>\n<li style=\"\">Create in-depth user guides, FAQs, technical overviews, and in-product help documentation database.</li>\n<li style=\"\">Independently gather information from various departments and sources to develop, organize, and write procedure manuals, technical specifications, and process documentation, and other documents.</li>\n<li style=\"\">Work with development and support team leads to identify all documentation repositories and determine the best solution for data compilation and centralized storage.</li>\n<li style=\"\">Create, and maintain information architecture templates that uphold organizational and legal standards, and allow for easy data migration</li>\n</ul>\n<p>We are a small team, so every person has the opportunity to make a big impact and leave their marks on every project. You will help in shaping and uplifting a company from the start.</p>\n<p>What are we looking for?</p>\n<ul style=\"\">\n<li style=\"\">Minimum 4 years of experience as a technical writer</li>\n<li style=\"\">Strong written and verbal communication and working experience with content in multiple mediums</li>\n<li style=\"\">Strong experience in owning end-to-end documentation creation processes.</li>\n<li style=\"\">Excellent attention to detail and the ability to prioritize and work on multiple projects in a fast-paced, changing environment.</li>\n<li style=\"\">Familiarity with API documentation for REST or. NET APIs.</li>\n<li style=\"\">Experience in creating documentation for audiences with different levels of technical skill (from end-users to developers)</li>\n<li style=\"\">Ideally, some initial understanding of the business (exposed to microfinance/banking industries, especially for tech companies)</li>\n<li style=\"\">Working remotely requires you to be autonomous, proactive, and accountable for your work.</li>\n</ul>\n<p>What will be advantageous to have?</p>\n<ul style=\"\">\n<li style=\"\">Experience working with the following tools preferred: Confluence/JIRA, Github, HTML, CSS, JavaScript, and microservices.</li>\n<li style=\"\">Past experience in the same domain</li>\n</ul>\n<p>Why us?</p>\n<p>Fast learning environment within a team of cheerful, passionate, talented people. Opportunity to interact and work with international people from all over the globe. You will find it easy to keep a good work-life balance.</p>\n<p>You will be closely working with industry experts to have a positive impact on the business of our customers.</p>\n<p>Opportunity to drive transformation in one of the fastest-growing industries. The local contract includes a pension fund and health insurance for you and your family.</p>\n<div class=\"h1\">About the company</div>\n<p>We simplify Financial Services Providers' life by eliminating paperwork &amp; automating valueless tasks, so that your employees make the most of their time at work and you boost your productivity. Although we are a small start-up, we are already global, our people work from all around the world. Our teams are remote, working from wherever they are. It gives our people freedom; we only ask them to be responsible.</p>\n<img src=\"https://remotive.com/job/track/1961619/blank.gif?source=public_api\" alt=\"\"/>","tags":"[\"technical writing\"]","pubDate":"2025-01-06T13:52:15.000Z","link":"https://remotive.com/remote-jobs/writing/technical-documentation-specialist-1961619","slug":"technical-documentation-specialist-juakali-6048"},{"id":9990669904,"title":"Support Executive (Night shift)","company":"Clearer","image":"https://avatars.githubusercontent.com/u/100294047?s=200&v=4","description":"<div><b style=\"font-size: 16px;\">About Us:&nbsp;</b></div><div><br></div><div><b style=\"font-size: 16px;\">Take the Clearer route to smart career growth.</b><span style=\"font-size: 16px;\"> At </span><a style=\"font-size: 16px;\" href=\"http://clearer.io/\">Clearer.io</a><span style=\"font-size: 16px;\">, we’re reimagining eCommerce by enhancing search, discovery, and customer engagement through a standout suite of innovative apps. Our mission is straightforward yet powerful: to empower our partners with solutions that streamline their operations, foster customer trust, and drive sustainable growth. We’re not just about technology—we’re about making eCommerce smarter, simpler, and more impactful, delivering solutions that inspire confidence and create real results.</span></div><div><span style=\"font-size: 16px;\">With fresh investment and rapid growth, this is the perfect time to join our journey. When you become part of </span><a style=\"font-size: 16px;\" href=\"http://clearer.io/\">Clearer.io</a><span style=\"font-size: 16px;\">, you step into a role where your work truly matters. Here, you’ll have the opportunity to own your projects, drive outcomes, and make an impact within a supportive, diverse team of professionals dedicated to customer success. We value clarity, results, and a customer-centric approach that keeps us focused on delivering real value to our partners every step of the way.</span></div><div><span style=\"font-size: 16px;\">If you’re ready to cut through the clutter and focus on what really matters in a dynamic eCommerce landscape, </span><a style=\"font-size: 16px;\" href=\"http://clearer.io/\">Clearer.io</a><span style=\"font-size: 16px;\"> is the place to grow, lead, and shape the future of online retail. Join us, and be part of a team that’s committed to making eCommerce clearer, more efficient, and more rewarding for everyone.</span></div><div><br></div><div><b style=\"font-size: 16px;\">Your impact:</b></div><div><a style=\"font-size: 16px;\" href=\"http://clearer.io/\">Clearer.io</a><span style=\"font-size: 16px;\"> is seeking a Support Executive to join our Support team. As a Support Executive you will have the opportunity to work with cutting-edge technology and collaborate with top-notch professionals to deliver exceptional service to our clients.</span></div><div><b style=\"font-size: 16px;\">About Us:&nbsp;</b></div><div><br></div><div><b style=\"font-size: 16px;\">Take the Clearer route to smart career growth.</b><span style=\"font-size: 16px;\"> At </span><a href=\"http://clearer.io/\" style=\"font-size: 16px;\">Clearer.io</a><span style=\"font-size: 16px;\">, we’re reimagining eCommerce by enhancing search, discovery, and customer engagement through a standout suite of innovative apps. Our mission is straightforward yet powerful: to empower our partners with solutions that streamline their operations, foster customer trust, and drive sustainable growth. We’re not just about technology—we’re about making eCommerce smarter, simpler, and more impactful, delivering solutions that inspire confidence and create real results.</span></div><div><span style=\"font-size: 16px;\">With fresh investment and rapid growth, this is the perfect time to join our journey. When you become part of </span><a href=\"http://clearer.io/\" style=\"font-size: 16px;\">Clearer.io</a><span style=\"font-size: 16px;\">, you step into a role where your work truly matters. Here, you’ll have the opportunity to own your projects, drive outcomes, and make an impact within a supportive, diverse team of professionals dedicated to customer success. We value clarity, results, and a customer-centric approach that keeps us focused on delivering real value to our partners every step of the way.</span></div><div><span style=\"font-size: 16px;\">If you’re ready to cut through the clutter and focus on what really matters in a dynamic eCommerce landscape, </span><a href=\"http://clearer.io/\" style=\"font-size: 16px;\">Clearer.io</a><span style=\"font-size: 16px;\"> is the place to grow, lead, and shape the future of online retail. Join us, and be part of a team that’s committed to making eCommerce clearer, more efficient, and more rewarding for everyone.</span></div><div><br></div><div><b style=\"font-size: 16px;\">Your impact:</b></div><div><a href=\"http://clearer.io/\" style=\"font-size: 16px;\">Clearer.io</a><span style=\"font-size: 16px;\"> is seeking a Support Executive to join our Support team. As a Support Executive you will have the opportunity to work with cutting-edge technology and collaborate with top-notch professionals to deliver exceptional service to our clients.</span></div><h3>What you'll do: </h3><li>Responding to inquiries via live chat and calls.</li><li>Owning your customer’s enquiry from initial live chat to diagnosing the customer’s problem and updating the customer throughout.</li><li>Collaborating with product teams to pinpoint issues and providing insightful opinions on potential solutions based on diverse customer feedback.</li><li>Developing an in-depth understanding of AppHub’s core app functionalities and capabilities to become a knowledge resource.</li><h3>What you’ll bring:</h3><li>At least 1+ years of customer support experience in a software product company.</li><li>You enjoy solving problems. You love taking on challenges. You don’t get flustered easily. If you don’t know the answer, you’ll keep going until you find it.&nbsp;</li><li>You like helping people. You get a kick out of getting people to those aha! Moments - (and there's a lot of those).</li><li>You pay attention to the details. You stay focused and nothing is overlooked. </li><li>You think on your feet. You like learning new things and you can learn quickly. When things change, you know how to roll with it.</li><li>You are motivated and driven. You’re going to take ownership of your time with and truly make a difference.&nbsp;</li><div>Preferred Qualifications:</div><li>IELTS &gt; 6.</li><h3>Why choose Clearer.io?</h3><li><b>Customer-First:</b> Everything we do is for our customers, with real people ready to listen, understand, and help them succeed.</li><li><b>Growth-Focused:</b> We’re not just selling apps—we’re delivering results. We make eCommerce growth easy and intuitive.</li><li><b>Clear and Simple:</b> Our solutions work seamlessly, so you’ll enjoy an environment that’s direct, down-to-earth, and driven by genuine connections.</li><li><b>Supportive Team:</b> You’ll join a diverse team that values collaboration, empowerment, and a shared vision for success.</li><div><b>Clear Benefits:</b></div><li>100% Remote Culture:&nbsp;Work from anywhere that brings you happiness.</li><li>Performance-based Year-End Bonus:&nbsp;Recognizing and rewarding your individual contributions.</li><li>Wellness Allowance:&nbsp;Support for classes promoting physical and mental health.</li><li>Time Off:&nbsp;20 days/year, in addition to Vietnam holidays. </li><li>MacBook Provided.</li><li>Collaborative Events:&nbsp;Offline meet-ups, monthly gatherings, year-end party, and company trips.</li><li>Continuous Learning:&nbsp;Technical and general workshops and online resources.</li><li>Health and Wellness Benefits:&nbsp;Generali Health Care Insurance, annual check-up.</li><li>International Exposure:&nbsp;Enhance expertise and English communication skills.</li><h3>Working hours:</h3><li>10:00 PM – 6:00 AM (GMT+7), Monday to Friday with one Saturday per month.</li>","tags":"[]","pubDate":"2025-01-06T07:55:24.397Z","link":"https://jobs.lever.co/Clearer/0d94357d-de13-4fa8-afcc-cd188d24a17f","slug":"support-executive-night-shift-clearer-4003"},{"id":3579194855,"title":"Head of Growth Marketing","company":"Clearer","image":"https://avatars.githubusercontent.com/u/100294047?s=200&v=4","description":"<div><b style=\"font-size: 10pt;\">Take the Clearer route to smart career growth.</b></div><div><span style=\"font-size: 10pt;\"> At Clearer.io, we’re reimagining eCommerce by enhancing search, discovery, and customer engagement through a standout suite of innovative apps. Our mission is straightforward yet powerful: to empower our partners with solutions that streamline their operations, foster customer trust, and drive sustainable growth. We’re not just about technology—we’re about making eCommerce smarter, simpler, and more impactful, delivering solutions that inspire confidence and create real results. </span></div><div><br></div><div><span style=\"font-size: 10pt;\">With fresh investment and rapid growth, this is the perfect time to join our journey. When you become part of clearer.io, you step into a role where your work truly matters. Here, you’ll have the opportunity to own your projects, drive outcomes, and make an impact within a supportive, diverse team of professionals dedicated to customer success. We value clarity, results, and a customer-centric approach that keeps us focused on delivering real value to our partners every step of the way. If you’re ready to cut through the clutter and focus on what really matters in a dynamic eCommerce landscape, clearer.io is the place to grow, lead, and shape the future of online retail. Join us, and be part of a team that’s committed to making eCommerce clearer, more efficient, and more rewarding for everyone.</span></div><div><br></div><div><b style=\"font-size: 10pt;\">Your Impact:</b></div><div><span style=\"font-size: 10pt;\">As Head of Growth Marketing, you will develop and execute a comprehensive marketing strategy to accelerate growth, build brand authority, and drive product adoption. In this pivotal role, you’ll manage a high-performing team and collaborate with Sales, Product, and Customer Success to achieve ambitious revenue and growth targets. You’ll craft a compelling brand narrative, deliver impactful campaigns, and position clearer.io as a leader in smart discovery. The ideal candidate will have a proven track record in B2B SaaS marketing, with deep expertise in demand generation, content marketing, product marketing, and data-driven decision-making. As VP of Marketing this is your opportunity&nbsp; to lead with purpose and innovation, driving measurable results while advancing our mission to make eCommerce smarter, simpler, and clearer.</span></div><div><b style=\"font-size: 10pt;\">Take the Clearer route to smart career growth.</b></div><div><span style=\"font-size: 10pt;\"> At Clearer.io, we’re reimagining eCommerce by enhancing search, discovery, and customer engagement through a standout suite of innovative apps. Our mission is straightforward yet powerful: to empower our partners with solutions that streamline their operations, foster customer trust, and drive sustainable growth. We’re not just about technology—we’re about making eCommerce smarter, simpler, and more impactful, delivering solutions that inspire confidence and create real results. </span></div><div><br></div><div><span style=\"font-size: 10pt;\">With fresh investment and rapid growth, this is the perfect time to join our journey. When you become part of clearer.io, you step into a role where your work truly matters. Here, you’ll have the opportunity to own your projects, drive outcomes, and make an impact within a supportive, diverse team of professionals dedicated to customer success. We value clarity, results, and a customer-centric approach that keeps us focused on delivering real value to our partners every step of the way. If you’re ready to cut through the clutter and focus on what really matters in a dynamic eCommerce landscape, clearer.io is the place to grow, lead, and shape the future of online retail. Join us, and be part of a team that’s committed to making eCommerce clearer, more efficient, and more rewarding for everyone.</span></div><div><br></div><div><b style=\"font-size: 10pt;\">Your Impact:</b></div><div><span style=\"font-size: 10pt;\">As Head of Growth Marketing, you will develop and execute a comprehensive marketing strategy to accelerate growth, build brand authority, and drive product adoption. In this pivotal role, you’ll manage a high-performing team and collaborate with Sales, Product, and Customer Success to achieve ambitious revenue and growth targets. You’ll craft a compelling brand narrative, deliver impactful campaigns, and position clearer.io as a leader in smart discovery. The ideal candidate will have a proven track record in B2B SaaS marketing, with deep expertise in demand generation, content marketing, product marketing, and data-driven decision-making. As VP of Marketing this is your opportunity&nbsp; to lead with purpose and innovation, driving measurable results while advancing our mission to make eCommerce smarter, simpler, and clearer.</span></div><h3>What you'll do: </h3><li><b>Marketing Strategy &amp; Leadership</b>: Develop and implement an integrated marketing strategy aligned with the company’s growth and revenue goals, incorporating the use of data and AI to inform decisions and drive innovation.</li><li>Build, lead, and mentor a high-performing marketing team across demand generation, product marketing, content strategy, and digital marketing. </li><li>Oversee budget management, resource allocation, and performance monitoring to ensure marketing initiatives deliver a strong return on investment.</li><li><b>Demand Generation &amp; Customer Acquisition: </b>Drive scalable, predictable growth through multi-channel demand generation strategies, including paid media, content strategy, email, SEO, and events.</li><li>Utilize marketing automation tools to streamline lead generation and nurturing programs, ensuring consistent engagement with prospects.</li><li>Work closely with Sales to align on lead scoring, nurturing, and conversion metrics to maximize MQL to SQL conversion rates.</li><li><b>Product Marketing: </b>Develop compelling messaging and positioning that resonates with target audiences and differentiates our products from competitors.</li><li>Oversee product launches with effective go-to-market strategies that drive awareness, adoption, and engagement. </li><li>Conduct market research to stay informed on industry trends, customer needs, and competitive positioning.</li><li><b>Brand Development &amp; Content Marketing: </b>Enhance brand visibility and authority in the eCommerce space through storytelling and thought leadership content, including case studies, webinars, and more.</li><li>Lead the creation of engaging, high-quality content that educates, informs, and inspires the target audience, guided by a strong content strategy.</li><li>Manage PR, social media, and other channels to maintain a cohesive and impactful brand presence.</li><li><b>Data-Driven Insights &amp; Optimization:</b> Implement and optimize analytics tools to measure the impact of all marketing efforts and report on key metrics.</li><li>Leverage data and AI to inform strategies, ensuring all marketing efforts are results-oriented and ROI-focused.</li><li>Use customer insights and analytics to continuously improve marketing strategies and tactics.</li><li><b>Cross-Functional Collaboration: </b>Partner closely with Sales, Product, and Customer Success teams to ensure alignment across departments and consistent messaging.</li><li>Act as a key voice in strategic planning and product development discussions, bringing customer and market perspectives to the table.</li><h3>What you'll bring: </h3><li>10+ years of B2B marketing experience, with 5+ in a leadership role, ideally in SaaS or tech.</li><li>Proven expertise in scaling demand generation strategies to drive consistent and sustained revenue and growth in middle market businesses.</li><li>High accountability with a demonstrated track record of exceeding performance targets.</li><li>Skilled in product positioning, messaging, and go-to-market strategies for B2B SaaS.</li><li>Strong analytical abilities to make data-driven decisions and optimize marketing performance.</li><li>Demonstrated success building and leading high-performing, collaborative teams.</li><li>Strategic thinker with hands-on execution and a deep understanding of the B2B SaaS buyer journey.</li><li>Exceptional communication skills, with a talent for crafting compelling messaging.</li><li>Bachelor’s degree in Marketing, Business, or a related field; MBA or advanced degree preferred.</li><h3>Why clearer.io??</h3><li><b>Customer-First:</b> Everything we do is for our customers, with real people ready to listen, understand, and help them succeed.</li><li><b>Growth-Focused:</b> We’re not just selling apps—we’re delivering results. We make eCommerce growth easy and intuitive.</li><li><b>Clear and Simple:</b> Our solutions work seamlessly, so you’ll enjoy an environment that’s direct, down-to-earth, and driven by genuine connections.</li><li><b>Supportive Team:</b> You’ll join a diverse team that values collaboration, empowerment, and a shared vision for success.</li><li><b>Clear Benefits:  </b>Comprehensive Benefits Packages</li><div><b style=\"font-size: 10pt;\">Be a part of clearer.io</b><span style=\"font-size: 10pt;\">—where your expertise fuels real change in eCommerce. Come and join us- it’s clear we’re the place to be!</span></div>","tags":"[\"management\",\"b2b\"]","pubDate":"2025-01-04T16:34:40.943Z","link":"https://jobs.lever.co/Clearer/39f5aff5-4b28-4031-a8c9-ddeee2f5e7d5","slug":"head-of-growth-marketing-clearer-6596"},{"id":3690825320,"title":"(Senior) Production Risk Engineer - Management Liability, Private/Non-Profit","company":"Counterpart","image":"https://media.licdn.com/dms/image/v2/D560BAQEtAXn0ryOTBw/company-logo_200_200/company-logo_200_200/0/1694785555271/yourcounterpart_logo?e=1744243200&v=beta&t=-BEjbQP7PMMfAC5PtCYEgvJk4MuWZ4Bfzh54loGzpwo","description":"&lt;p&gt;&lt;strong&gt;Senior Product Risk Engineer - Management Liability, Private/Non-Profit&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;(Northeast)&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;Counterpart believes in small businesses and is dedicated to helping them do more with less risk. By pairing leading insurance experts with cutting-edge technology, Counterpart empowers small business owners to grow with confidence. Exceptional underwriters, trusted insurance brokers, and prominent insurance carriers come together on the Counterpart platform to support small businesses by providing AI-driven management and professional liability underwriting and claims services. That’s where you come in…&lt;/p&gt;\n&lt;p&gt;As a member of the risk engineering team, you will be responsible for the production of premium through proper risk analysis and effective distribution of our product. In collaboration with the engineering, design, data, and operations team, you will leverage your industry knowledge and broker relationships to develop management liability insurance products that brokers are eager to promote to their clients.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;AS A PRODUCTION FOCUSED RISK ENGINEER YOU WILL:&lt;/strong&gt;&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;Achieve and exceed underwriting performance and revenue goals, underwriting in accordance with our stated procedures.&lt;/li&gt;\n&lt;li&gt;Price accounts with competitive terms quickly, thoughtfully, and in accordance with our guidelines.&lt;/li&gt;\n&lt;li&gt;Manage quote related communication and questions in a thoughtful and trusting manner.&lt;/li&gt;\n&lt;li&gt;Collaborate with the underwriting team of Risk Engineers on understanding the unique exposures of complex accounts with a focus on Non-Profit underwriting.&amp;nbsp;&lt;/li&gt;\n&lt;li&gt;Provide market feedback and recommend improvements to our terms, rates, and guidelines improving our policy forms and coverages.&lt;/li&gt;\n&lt;li&gt;Bind accounts through the continuous engagement of your assigned brokers.&lt;/li&gt;\n&lt;li&gt;Represent Counterpart at broker meetings and various industry events.&amp;nbsp;&lt;/li&gt;\n&lt;li&gt;Contribute ideas and feedback on our suite of tools and services as a key stakeholder of our product roadmap.&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;&lt;strong&gt;WE LOOK FOR TEAMMATES WHO HAVE:&lt;/strong&gt;&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;5-10 years of underwriting experience in management liability with experience underwriting Non-Profit accounts.&lt;/li&gt;\n&lt;li&gt;A network of brokers, carriers, underwriters, or clients in the management liability or professional liability insurance market.&lt;/li&gt;\n&lt;li&gt;Expertise in various aspects of specialty liability products (e.g. rating procedures, policy forms, applications and coverage endorsements), and the ability to potentially lead the Non-Profit product line.&lt;/li&gt;\n&lt;li&gt;Ability to successfully engage with brokers to establish long-term, profitable partnerships.&lt;/li&gt;\n&lt;li&gt;Confidence presenting to key internal and external stakeholders.&amp;nbsp;&lt;/li&gt;\n&lt;li&gt;Demonstrated success with high performing sales and account management practices.&lt;/li&gt;\n&lt;li&gt;A proven track record of success, achieving and exceeding monthly, quarterly and annual targets.&lt;/li&gt;\n&lt;li&gt;Enthusiasm for continuous challenges in a high velocity environment.&lt;/li&gt;\n&lt;li&gt;Flexibility for travel, when necessary (once per month as a minimum)&lt;/li&gt;\n&lt;li&gt;College Degree with relevant work experience of 4+ years.&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;&lt;strong&gt;WHO YOU WILL WORK WITH:&amp;nbsp;&lt;/strong&gt;&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;&lt;strong&gt;Mike Levins, Head of Insurance&lt;/strong&gt;: Mike previously was the Head of Broker Relations and US MGA Operations at Hiscox. Mike oversaw the Midwest region with ~20 underwriters offering 13 different product lines, the primary lines being management liability, professional liability, and cyber/technology. His extensive insurance career has afforded Mike strong relationships across hundreds of retail and wholesale brokers. Mike received his BS from Marquette University and MBA from Benedictine University.&lt;/li&gt;\n&lt;li&gt;&lt;strong&gt;Tanner Hackett, CEO:&lt;/strong&gt; Having founded two other major startups, including Button and Lazada, Tanner now spends his time focused on mental health through his philanthropy,&lt;a href=&quot;http://openminded.org&quot;&gt; Openminded.org&lt;/a&gt;, in addition to reading, surfing, yoga, and enjoying the outdoors.&lt;/li&gt;\n&lt;li&gt;&lt;strong&gt;Satwik Mysore, Risk Engineer Territory Lead: &lt;/strong&gt;After graduating with an actuarial science degree, Satwik has spent most of his career at Travelers, where he built one of the largest and most profitable management liability books by forming strong broker relationships.&lt;/li&gt;\n&lt;li&gt;&lt;strong&gt;Brad Bahler, Risk Engineer Territory Lead:&lt;/strong&gt; Brad has over a decade of experience in management liability underwriting. He managed one of the largest books of small business management liability risks at Travelers, where he was known for his deep understanding of coverage, outstanding submission response times, and boundless enthusiasm for the space.&lt;/li&gt;\n&lt;li&gt;&lt;strong&gt;Jake O’Donnell, Risk Engineer Territory Lead:&amp;nbsp;&lt;/strong&gt;Jake started his insurance career at Chubb, where he was able to develop and grow a profitable book of private-for-profit and non-profit management liability business. Jake is known for his exceptional service to industry brokers and his extensive knowledge of management liability. Jake also is a CPCU designation recipient.&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;&lt;strong&gt;WHAT WE OFFER&lt;/strong&gt;&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;&lt;strong&gt;Fully remote workplace&lt;/strong&gt;&lt;/li&gt;\n&lt;li&gt;&lt;strong&gt;Unlimited Vacation&lt;/strong&gt;: We offer flexible time off, allowing you to take time when you need it.&lt;/li&gt;\n&lt;li&gt;&lt;strong&gt;Work from Anywhere&lt;/strong&gt;: Counterpart is a fully distributed company, meaning there is no office. We allow employees to work from wherever they do their best work, and invite the team to meet in person a couple times per year.&lt;/li&gt;\n&lt;li&gt;&lt;strong&gt;Stock Options&amp;nbsp;&lt;/strong&gt;&lt;/li&gt;\n&lt;li&gt;&lt;strong&gt;Health, Dental, and Vision Coverage&lt;/strong&gt;&lt;/li&gt;\n&lt;li&gt;&lt;strong&gt;401(k) Retirement Plan&lt;/strong&gt;&lt;/li&gt;\n&lt;li&gt;&lt;strong&gt;Parental Leave&lt;/strong&gt;&lt;/li&gt;\n&lt;li&gt;&lt;strong&gt;Home Office Allowance&lt;/strong&gt;: &lt;strong&gt;to set up your home office&lt;/strong&gt; with the necessary equipment and accessories.&lt;/li&gt;\n&lt;li&gt;&lt;strong&gt;Wellness Stipend&lt;/strong&gt;&lt;/li&gt;\n&lt;li&gt;&lt;strong&gt;Book stipend&lt;/strong&gt;&lt;/li&gt;\n&lt;li&gt;&lt;strong&gt;Professional Development Reimbursement&lt;/strong&gt;&lt;/li&gt;\n&lt;li&gt;&lt;strong&gt;No working birthdays&lt;/strong&gt;: &lt;strong&gt;Take your birthday off&lt;/strong&gt;, giving you the opportunity to relax, enjoy your special day, and spend time with loved ones.&lt;/li&gt;\n&lt;li&gt;&lt;strong&gt;Charitable Contribution Matching&lt;/strong&gt;&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;&lt;strong&gt;COUNTERPART&#39;S VALUES&lt;/strong&gt;&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;&lt;strong&gt;Conjoin Expectations&lt;/strong&gt; - it is the cornerstone of autonomy. Ensure you are aware of what is expected of you and clearly articulate what you expect of others.&amp;nbsp;&lt;/li&gt;\n&lt;li&gt;&lt;strong&gt;Speak Boldly &amp;amp; Honestly&lt;/strong&gt; - the only failure is not learning from mistakes. Don’t cheat yourself and your colleagues of the feedback needed when&amp;nbsp; expectations aren’t being met.&amp;nbsp;&lt;/li&gt;\n&lt;li&gt;&lt;strong&gt;Be Entrepreneurial&lt;/strong&gt; - control your own destiny.&amp;nbsp; Embrace action over perfection while navigating any obstacles that stand in the way of your ultimate goal.&amp;nbsp;&lt;/li&gt;\n&lt;li&gt;&lt;strong&gt;Practice Omotenashi&lt;/strong&gt; (“selfless hospitality”) - trust will follow.&amp;nbsp; Consider every interaction with internal and external partners an opportunity to develop trust by going above and beyond what is expected.&amp;nbsp;&lt;/li&gt;\n&lt;li&gt;&lt;strong&gt;Hold Nothing As Sacred&lt;/strong&gt; - create routines but modify them routinely.&lt;strong&gt;&amp;nbsp; &lt;/strong&gt;Take the time to reflect on where the business is today, where it needs to&amp;nbsp; go, and what you have to change in order to get there.&amp;nbsp;&lt;/li&gt;\n&lt;li&gt;&lt;strong&gt;Prioritize Wellness&lt;/strong&gt; - some things should never be sacrificed. We create an environment that stretches everyone to grow and improve, which is fulfilling, but is only one part of a meaningful life.&lt;br&gt;&lt;br&gt;&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;Our estimated pay range for this role is $120,000 to $170,000. Base salary is determined by a variety of factors, including but not limited to, market data, location, internal equitability, and experience.&lt;/p&gt;\n&lt;p&gt;We are committed to being a welcoming and inclusive workplace for everyone, and we are intentional about making sure people feel respected, supported and connected at work—regardless of who you are or where you come from. We value and celebrate our differences and we believe being open about who we are allows us to do the best work of our lives.&amp;nbsp;&lt;/p&gt;\n&lt;p&gt;We are an Equal Opportunity Employer. We do not discriminate against qualified applicants or employees on the basis of race, color, religion, gender identity, sex, sexual preference, sexual identity, pregnancy, national origin, ancestry, citizenship, age, marital status, physical disability, mental disability, medical condition, military status, or any other characteristic protected by federal, state, or local law, rule, or regulation.&amp;nbsp;&lt;/p&gt;\n&lt;p&gt;&lt;br&gt;&lt;br&gt;&lt;/p&gt;","tags":"[\"management\",\"engineering\"]","pubDate":"2025-01-03T21:28:16.000Z","link":"https://job-boards.greenhouse.io/counterpart/jobs/4513310005","slug":"senior-production-risk-engineer-management-liability-private-non-profit-counterpart-6467"},{"id":6909158155,"title":"Senior UI Designer","company":"Clearer","image":"https://avatars.githubusercontent.com/u/100294047?s=200&v=4","description":"<div><b style=\"font-size: 12pt;\">About Us:</b></div><div><span style=\"font-size: 12pt;\">Take the Clearer route to smart career growth. At </span><a rel=\"noopener noreferrer\" class=\"postings-link\" href=\"http://Clearer.io\"><span style=\"font-size: 12pt;\">Clearer.io</span></a><span style=\"font-size: 12pt;\">, we’re reimagining eCommerce by enhancing search, discovery, and customer engagement through a standout suite of innovative apps. Our mission is straightforward yet powerful: to empower our partners with solutions that streamline their operations, foster customer trust, and drive sustainable growth. We’re not just about technology—we’re about making eCommerce smarter, simpler, and more impactful, delivering solutions that inspire confidence and create real results.</span></div><div><span style=\"font-size: 12pt;\">With fresh investment and rapid growth, this is the perfect time to join our journey. When you become part of </span><a rel=\"noopener noreferrer\" class=\"postings-link\" href=\"http://Clearer.io\"><span style=\"font-size: 12pt;\">Clearer.io</span></a><span style=\"font-size: 12pt;\">, you step into a role where your work truly matters. Here, you’ll have the opportunity to own your projects, drive outcomes, and make an impact within a supportive, diverse team of professionals dedicated to customer success. We value clarity, results, and a customer-centric approach that keeps us focused on delivering real value to our partners every step of the way.</span></div><div><span style=\"font-size: 12pt;\">If you’re ready to cut through the clutter and focus on what really matters in a dynamic eCommerce landscape, </span><a rel=\"noopener noreferrer\" class=\"postings-link\" href=\"http://Clearer.io\"><span style=\"font-size: 12pt;\">Clearer.io</span></a><span style=\"font-size: 12pt;\"> is the place to grow, lead, and shape the future of online retail. Join us, and be part of a team that’s committed to making eCommerce clearer, more efficient, and more rewarding for everyone.</span></div><div><br></div><div><b style=\"font-size: 12pt;\">Your impact:</b></div><div><a rel=\"noopener noreferrer\" class=\"postings-link\" href=\"http://Clearer.io\"><span style=\"font-size: 12pt;\">Clearer.io</span></a><span style=\"font-size: 12pt;\"> is seeking a talented Senior UI Designer with extensive experience in UX/UI to join our Product Design team.</span></div><div><span style=\"font-size: 12pt;\">As a Senior UI Designer, you will play a pivotal role in shaping exceptional user experiences across our digital products. This role requires a blend of creativity, collaboration, and technical expertise to design and refine user interfaces that are both intuitive and visually appealing. You will work closely with cross-functional teams to deliver impactful designs that drive user satisfaction and business success.</span></div><div><b style=\"font-size: 12pt;\">About Us:</b></div><div><span style=\"font-size: 12pt;\">Take the Clearer route to smart career growth. At </span><a href=\"http://Clearer.io\" class=\"postings-link\" target=\"_blank\" rel=\"noopener noreferrer\"><span style=\"font-size: 12pt;\">Clearer.io</span></a><span style=\"font-size: 12pt;\">, we’re reimagining eCommerce by enhancing search, discovery, and customer engagement through a standout suite of innovative apps. Our mission is straightforward yet powerful: to empower our partners with solutions that streamline their operations, foster customer trust, and drive sustainable growth. We’re not just about technology—we’re about making eCommerce smarter, simpler, and more impactful, delivering solutions that inspire confidence and create real results.</span></div><div><span style=\"font-size: 12pt;\">With fresh investment and rapid growth, this is the perfect time to join our journey. When you become part of </span><a href=\"http://Clearer.io\" class=\"postings-link\" target=\"_blank\" rel=\"noopener noreferrer\"><span style=\"font-size: 12pt;\">Clearer.io</span></a><span style=\"font-size: 12pt;\">, you step into a role where your work truly matters. Here, you’ll have the opportunity to own your projects, drive outcomes, and make an impact within a supportive, diverse team of professionals dedicated to customer success. We value clarity, results, and a customer-centric approach that keeps us focused on delivering real value to our partners every step of the way.</span></div><div><span style=\"font-size: 12pt;\">If you’re ready to cut through the clutter and focus on what really matters in a dynamic eCommerce landscape, </span><a href=\"http://Clearer.io\" class=\"postings-link\" target=\"_blank\" rel=\"noopener noreferrer\"><span style=\"font-size: 12pt;\">Clearer.io</span></a><span style=\"font-size: 12pt;\"> is the place to grow, lead, and shape the future of online retail. Join us, and be part of a team that’s committed to making eCommerce clearer, more efficient, and more rewarding for everyone.</span></div><div><br></div><div><b style=\"font-size: 12pt;\">Your impact:</b></div><div><a href=\"http://Clearer.io\" class=\"postings-link\" target=\"_blank\" rel=\"noopener noreferrer\"><span style=\"font-size: 12pt;\">Clearer.io</span></a><span style=\"font-size: 12pt;\"> is seeking a talented Senior UI Designer with extensive experience in UX/UI to join our Product Design team.</span></div><div><span style=\"font-size: 12pt;\">As a Senior UI Designer, you will play a pivotal role in shaping exceptional user experiences across our digital products. This role requires a blend of creativity, collaboration, and technical expertise to design and refine user interfaces that are both intuitive and visually appealing. You will work closely with cross-functional teams to deliver impactful designs that drive user satisfaction and business success.</span></div><h3>What you’ll do:</h3><li>Craft user interfaces for our products with a strong emphasis on delivering seamless and engaging user experiences while adhering to established design systems.</li><li>Create, maintain, and enhance design system components to ensure consistency and scalability across all products.</li><li>Design graphic illustrations, icons, and AI-generated images that align with our product’s style and the overall design system.</li><li>Develop high-quality mockups and prototypes to communicate user flows, interactions, and proof of concepts effectively.</li><li>Partner with Product Managers and engineering teams throughout the development cycle to ensure design requirements are clearly defined and implemented.&nbsp;&nbsp;</li><li>Research and develop tailored design systems based on product requirements, whether for e-commerce websites, B2B applications, or other scopes.</li><li>Identify and troubleshoot UX/UI challenges, implementing user-centered solutions that elevate the design.</li><li>Stay updated on the latest design trends and propose innovative ideas to enhance our applications and marketing websites.</li><li>Deepen your understanding of our products and technologies to create simplified, highly usable, and impactful product experiences.</li><li>Leverage customer feedback and analytics data to refine and optimize the performance of new and existing features.</li><li>Demonstrate the flexibility to work effectively with global teams across different time zones and cultures.</li><li>Thrive in both independent projects and collaborative team environments, ensuring the highest quality of work.</li><h3> What you’ll bring:</h3><li>At least 3+ years of professional experience in UI Design.</li><li>A portfolio showcasing excellence in interaction design, visual design.</li><li>Proficiency in Figma, including advanced features like Components, Auto Layout, and Responsive Design.</li><li>Strong expertise in the Adobe Creative Suite for graphic and UI asset creation.</li><li>Strong English skills—both written and spoken—to effectively communicate and collaborate with global, cross-functional teams.</li><li>Bachelor’s or Master’s degree in Design, with a focus on UI, or related arts fields.</li><li>Good time management skills.A meticulous eye for detail, ensuring high-quality designs.</li><li>Demonstrated experience designing for SaaS/PaaS products.</li><li>Hands-on experience building and applying design systems to ensure consistency and scalability across products.</li><li>Deep understanding of user-centered design principles, best practices, and inclusive design.</li><li>Familiarity with accessibility standards and a strong desire to continue learning in this area.</li><li>Proven ability to manage multiple projects simultaneously while maintaining focus and delivering results.</li><h3> Why choose Clearer.io?</h3><li><b>Customer-First:</b> Everything we do is for our customers, with real people ready to listen, understand, and help them succeed.</li><li><b>Growth-Focused:</b> We’re not just selling apps—we’re delivering results. We make eCommerce growth easy and intuitive.</li><li><b>Clear and Simple:</b> Our solutions work seamlessly, so you’ll enjoy an environment that’s direct, down-to-earth, and driven by genuine connections.</li><li><b>Supportive Team: </b>You’ll join a diverse team that values collaboration, empowerment, and a shared vision for success.</li><div><br></div><div><b>Clear Benefits:</b></div><li>100% Remote Culture: Work from anywhere that brings you happiness.</li><li>Performance-based Year-End Bonus: Recognizing and rewarding your individual contributions.</li><li>Wellness Allowance: Support for classes promoting physical and mental health.</li><li>Time Off: 20 days/year, in addition to Vietnam holidays.</li><li>MacBook Provided.</li><li>Collaborative Events: Offline meet-ups, monthly gatherings, year-end party, and company trips.</li><li>Continuous Learning: Technical and general workshops and online resources.</li><li>Health and Wellness Benefits: General Health Care, annual check-up.</li><li>International Exposure: Enhance expertise and English communication skills.</li><div><br></div><div><b>Working hours: </b>8:00 AM – 5:00 PM (GMT+7), Monday to Friday.</div>","tags":"[\"management\",\"engineering\",\"b2b\"]","pubDate":"2024-12-24T02:17:01.926Z","link":"https://jobs.lever.co/Clearer/b5a3769d-36af-4cc4-b5de-e2a66f89ae84","slug":"senior-ui-designer-clearer-7024"},{"id":8693586383,"title":"Technical Product Manager","company":"Counterpart","image":"https://media.licdn.com/dms/image/v2/D560BAQEtAXn0ryOTBw/company-logo_200_200/company-logo_200_200/0/1694785555271/yourcounterpart_logo?e=1744243200&v=beta&t=-BEjbQP7PMMfAC5PtCYEgvJk4MuWZ4Bfzh54loGzpwo","description":"&lt;p&gt;Counterpart believes in small businesses and is dedicated to helping them do more with less risk. By pairing leading insurance experts with cutting-edge technology, Counterpart empowers small business owners to grow with confidence. Exceptional underwriters, trusted insurance brokers, and prominent insurance carriers come together on the Counterpart platform to support small businesses by providing AI-driven management and professional liability underwriting and claims services. That’s where you come in.&lt;/p&gt;\n&lt;p&gt;As a Technical Product Manager at Counterpart, you will play a lead role in planning, sequencing, and development of the future of the Company. You will be a primary stakeholder in the company’s product roadmap and crafting the vision of what will be valuable for the company to work on. You will help coordinate the needs of our Product, Insurance, and Engineering teams while helping to design the systems and features that shape the future of insurance. In addition, you will help evolve and better culture, rituals, and processes that underpin a high functioning engineering team and the organization more broadly.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;YOU WILL&lt;/strong&gt;&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;Design and execute launch plans for new products and integrations in collaboration with insurance, field, data, and engineering teams.&amp;nbsp;&lt;/li&gt;\n&lt;li&gt;Develop a deep understanding of existing user pain points and current systems and data flows. Use this knowledge to design practical and technically sound solutions to address user needs.&amp;nbsp;&lt;/li&gt;\n&lt;li&gt;Drive product adoption through clear documentation, training, and iterative improvements based on product usage and feedback.&lt;/li&gt;\n&lt;li&gt;Monitor and analyze product usage to identify trends, opportunities, and areas for improvement. Use these insights to inform future product development.&lt;/li&gt;\n&lt;li&gt;Conduct user feedback sessions when necessary to validate key assumptions and refine use cases.&lt;/li&gt;\n&lt;li&gt;Collaborate with business and engineering leads to define quarterly goals and objectives that align with the company’s vision and strategy..&lt;/li&gt;\n&lt;li&gt;Work cross-functionally with&amp;nbsp; engineering, design, marketing, data science, and operations, to deliver products that meet insurance market demands and business goals.&lt;/li&gt;\n&lt;li&gt;Ensure transparency and collaboration with internal and external stakeholders at every step of the product development process.&lt;/li&gt;\n&lt;li&gt;Effectively collaborate and communicate results and insights with cross-functional teams &amp;amp; external partners.&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;&lt;strong&gt;YOU HAVE&lt;/strong&gt;&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;3-5+ years experience working in operations or product management at an insure-tech or B2B SaaS&amp;nbsp; startup company&lt;/li&gt;\n&lt;li&gt;Highly effective communication skills with the ability to convey technical challenges between engineering and the various product stakeholders&lt;/li&gt;\n&lt;li&gt;History of managing successful product and feature launches from the idea to development stages&lt;/li&gt;\n&lt;li&gt;Past experience building in a fast-paced environment&lt;/li&gt;\n&lt;li&gt;Ability to inspire action and drive decision making with team members&lt;/li&gt;\n&lt;li&gt;Excitement for building and experimenting with new technologies and systems&lt;/li&gt;\n&lt;li&gt;Highly organized and detail oriented to maintain complex documentation and systems&amp;nbsp;&lt;/li&gt;\n&lt;li&gt;Solid understanding of modern technologies used by engineers&lt;/li&gt;\n&lt;li&gt;Experience working with remote team members consisting of both full-time teammates and third party contractors.&lt;/li&gt;\n&lt;li&gt;Bonus if you have a strong understanding of the insurance industry, particularly in areas like underwriting workflows, claims management, or policy administration.&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;&lt;strong&gt;WHO YOU WILL WORK WITH:&lt;/strong&gt;&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;&lt;strong&gt;Tanner Hackett, CEO &amp;amp; Founder&lt;/strong&gt;: Having founded two other major startups, including Button and Lazada, Tanner now spends his time focused on mental health through his philanthropy,&lt;a href=&quot;http://openminded.org&quot;&gt; Openminded.org&lt;/a&gt;, in addition to reading, surfing, yoga, and enjoying the outdoors.&amp;nbsp;&lt;/li&gt;\n&lt;li&gt;&lt;strong&gt;Chris Shafer, Chief of Staff&lt;/strong&gt;: Chris is a published scientific author, having studied the neural correlates of gratitude at the lauded Brain and Creativity Institute. He has since helped to launch numerous businesses in which he held a variety of critical roles from product management to business operations to strategic partnerships. Chris received his bachelor’s degree in Biological Sciences from the University of Southern California.&lt;/li&gt;\n&lt;li&gt;&lt;strong&gt;Mike Levins, Head of Insurance&lt;/strong&gt;: Mike previously was the Head of Broker Relations and US MGA Operations at Hiscox. Mike oversaw the Midwest region with ~20 underwriters offering 13 different product lines, the primary lines being management liability, professional liability, and cyber/technology. His extensive insurance career has afforded Mike strong relationships across hundreds of retail and wholesale brokers. Mike received his BS from Marquette University and MBA from Benedictine University.&lt;/li&gt;\n&lt;li&gt;&lt;strong&gt;Tobias Schuler, Head of Data Analytics&lt;/strong&gt;: After becoming a Fellow of the Casualty Actuarial Society &amp;amp; working as a consultant actuary at EY for several years, Tobias went on to drive the actuarial data &amp;amp; systems teams at QBE. He further leveraged his deep insurance &amp;amp; technical expertise at Munich Re Digital Partners in North America, where he headed data &amp;amp; analytics &amp;amp; oversaw the data infrastructure behind some of their largest programs.&lt;/li&gt;\n&lt;li&gt;&lt;strong&gt;Dave Lin, Head of Product and Engineering:&amp;nbsp;&lt;/strong&gt;Dave has built and scaled B2B platforms at Yext, Apple, Amazon, and Hookit. He received his MS and BS in Electrical Engineering from University of California, San Diego.&amp;nbsp;&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;&lt;strong&gt;WHAT WE OFFER:&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Fully remote workplace&lt;/strong&gt;&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;&lt;strong&gt;Flexible Time Off&lt;/strong&gt;: We offer flexible time off, allowing you to take time when you need it.&lt;/li&gt;\n&lt;li&gt;Work from Anywhere: Counterpart is a fully distributed company, meaning there is no office. We allow employees to work from wherever they do their best work, and invite the team to meet in person a couple of times per year.&lt;/li&gt;\n&lt;li&gt;&lt;strong&gt;Stock Options&lt;/strong&gt;&lt;/li&gt;\n&lt;li&gt;&lt;strong&gt;Wellness Stipend&lt;/strong&gt;&lt;/li&gt;\n&lt;li&gt;&lt;strong&gt;Health, Dental, and Vision Coverage&lt;/strong&gt;&lt;/li&gt;\n&lt;li&gt;&lt;strong&gt;401(k) Retirement Plan&lt;/strong&gt;&lt;/li&gt;\n&lt;li&gt;&lt;strong&gt;Parental Leave&lt;/strong&gt;&lt;/li&gt;\n&lt;li&gt;&lt;strong&gt;Home Office Allowance&lt;/strong&gt;: to set up your home office with the necessary equipment and accessories&lt;/li&gt;\n&lt;li&gt;&lt;strong&gt;Book stipend&lt;/strong&gt;&lt;/li&gt;\n&lt;li&gt;&lt;strong&gt;Wellness stipend&lt;/strong&gt;&lt;/li&gt;\n&lt;li&gt;&lt;strong&gt;Professional Development Reimbursement&lt;/strong&gt;&lt;/li&gt;\n&lt;li&gt;&lt;strong&gt;No working birthdays&lt;/strong&gt;: Take your birthday off, giving you the opportunity to relax, enjoy your special day, and spend time with loved ones&lt;/li&gt;\n&lt;li&gt;&lt;strong&gt;Charitable Contribution Matching&lt;/strong&gt;&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;&lt;strong&gt;COUNTERPART&#39;S VALUES:&lt;/strong&gt;&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;&lt;strong&gt;Conjoin Expectations&lt;/strong&gt; - it is the cornerstone of autonomy. Ensure you are aware of what is expected of you and clearly articulate what you expect of others.&amp;nbsp;&lt;/li&gt;\n&lt;li&gt;&lt;strong&gt;Speak Boldly &amp;amp; Honestly&lt;/strong&gt; - the only failure is not learning from mistakes. Don’t cheat yourself and your colleagues of the feedback needed when&amp;nbsp; expectations aren’t being met.&amp;nbsp;&lt;/li&gt;\n&lt;li&gt;&lt;strong&gt;Be Entrepreneurial&lt;/strong&gt; - control your own destiny.&amp;nbsp; Embrace action over perfection while navigating any obstacles that stand in the way of your ultimate goal.&amp;nbsp;&lt;/li&gt;\n&lt;li&gt;&lt;strong&gt;Practice Omotenashi&lt;/strong&gt; (“selfless hospitality”) - trust will follow.&amp;nbsp; Consider every interaction with internal and external partners an opportunity to develop trust by going above and beyond what is expected.&amp;nbsp;&lt;/li&gt;\n&lt;li&gt;&lt;strong&gt;Hold Nothing As Sacred&lt;/strong&gt; - create routines but modify them routinely.&amp;nbsp; Take the time to reflect on where the business is today, where it needs to&amp;nbsp; go, and what you have to change in order to get there.&amp;nbsp;&lt;/li&gt;\n&lt;li&gt;&lt;strong&gt;Prioritize Wellness&lt;/strong&gt; - some things should never be sacrificed. We create an environment that stretches everyone to grow and improve, which is fulfilling, but is only one part of a meaningful life.&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;Our estimated pay range for this role is $150,000 to $175,000. Base salary is determined by a variety of factors, including but not limited to, market data, location, internal equitability, and experience.&amp;nbsp;&lt;/p&gt;\n&lt;p&gt;We are committed to being a welcoming and inclusive workplace for everyone, and we are intentional about making sure people feel respected, supported and connected at work—regardless of who you are or where you come from. We value and celebrate our differences and we believe being open about who we are allows us to do the best work of our lives.&lt;/p&gt;\n&lt;p&gt;We are an Equal Opportunity Employer. We do not discriminate against qualified applicants or employees on the basis of race, color, religion, gender identity, sex, sexual preference, sexual identity, pregnancy, national origin, ancestry, citizenship, age, marital status, physical disability, mental disability, medical condition, military status, or any other characteristic protected by federal, state, or local law, rule, or regulation.&lt;/p&gt;","tags":"[\"management\",\"engineering\",\"b2b\"]","pubDate":"2024-12-23T20:09:48.000Z","link":"https://job-boards.greenhouse.io/counterpart/jobs/4248295005","slug":"technical-product-manager-counterpart-4514"},{"id":2585422870,"title":"(Senior) Production Risk Engineer - Management Liability (Northwest)","company":"Counterpart","image":"https://media.licdn.com/dms/image/v2/D560BAQEtAXn0ryOTBw/company-logo_200_200/company-logo_200_200/0/1694785555271/yourcounterpart_logo?e=1744243200&v=beta&t=-BEjbQP7PMMfAC5PtCYEgvJk4MuWZ4Bfzh54loGzpwo","description":"&lt;p&gt;Counterpart believes in small businesses and is dedicated to helping them do more with less risk. By pairing leading insurance experts with cutting-edge technology, Counterpart empowers small business owners to grow with confidence. Exceptional underwriters, trusted insurance brokers, and prominent insurance carriers come together on the Counterpart platform to support small businesses by providing AI-driven management and professional liability underwriting and claims services. That’s where you come in…&lt;/p&gt;\n&lt;p&gt;As a member of the risk engineering team, you will be responsible for the production of premium through proper risk analysis and effective distribution of our product. In collaboration with the engineering, design, data, and operations team, you will leverage your industry knowledge and broker relationships to develop management liability and professional liability insurance products that brokers are eager to promote to their clients.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;AS A (SENIOR) PRODUCTION RISK ENGINEER YOU WILL:&lt;/strong&gt;&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;Achieve and exceed underwriting performance and revenue goals, underwriting in accordance with our stated procedures.&lt;/li&gt;\n&lt;li&gt;Price accounts with competitive terms quickly, thoughtfully, and in accordance with our guidelines.&lt;/li&gt;\n&lt;li&gt;Manage quote related communication and questions in a thoughtful and trusting manner.&lt;/li&gt;\n&lt;li&gt;Collaborate with the underwriting team of Risk Engineers on understanding the unique exposures of complex accounts.&lt;/li&gt;\n&lt;li&gt;Provide market feedback and recommend improvements to our terms, rates, and guidelines improving our policy forms and coverages&amp;nbsp;&lt;/li&gt;\n&lt;li&gt;Bind accounts through the continuous engagement of your assigned brokers.&lt;/li&gt;\n&lt;li&gt;Represent Counterpart at broker meetings and various industry events.&amp;nbsp;&lt;/li&gt;\n&lt;li&gt;Contribute ideas and feedback on our suite of tools and services as a key stakeholder of our product roadmap.&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;&lt;strong&gt;WE LOOK FOR TEAMMATES WHO HAVE:&lt;/strong&gt;&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;4-8 years of underwriting experience in the respective product.&lt;/li&gt;\n&lt;li&gt;A network of brokers, carriers, underwriters, or clients in the management liability or professional liability insurance space.&lt;/li&gt;\n&lt;li&gt;Expertise in various aspects of specialty liability products (e.g. rating procedures, policy forms, applications and coverage endorsements).&amp;nbsp;&lt;/li&gt;\n&lt;li&gt;Ability to successfully engage with brokers to establish long-term, profitable partnerships with brokerages.&lt;/li&gt;\n&lt;li&gt;Confidence presenting to key internal and external stakeholders.&amp;nbsp;&lt;/li&gt;\n&lt;li&gt;Demonstrated success with high performing sales and account management practices.&lt;/li&gt;\n&lt;li&gt;A proven track record of success, achieving and exceeding monthly, quarterly and annual targets.&lt;/li&gt;\n&lt;li&gt;Enthusiasm for continuous challenges in a high velocity environment.&lt;/li&gt;\n&lt;li&gt;Flexibility for travel, when necessary (once per month as a minimum)&lt;/li&gt;\n&lt;li&gt;College Degree with relevant work experience of 4+ years.&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;&lt;strong&gt;WHO YOU WILL WORK WITH:&amp;nbsp;&lt;/strong&gt;&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;&lt;strong&gt;Mike Levins, Head of Insurance&lt;/strong&gt;: Mike previously was the Head of Broker Relations and US MGA Operations at Hiscox. Mike oversaw the Midwest region with ~20 underwriters offering 13 different product lines, the primary lines being management liability, professional liability, and cyber/technology. His extensive insurance career has afforded Mike strong relationships across hundreds of retail and wholesale brokers. Mike received his BS from Marquette University and MBA from Benedictine University.&lt;/li&gt;\n&lt;li&gt;&lt;strong&gt;Tanner Hackett, CEO:&lt;/strong&gt; Having founded two other major startups, including Button and Lazada, Tanner now spends his time focused on mental health through his philanthropy,&lt;a href=&quot;http://openminded.org&quot;&gt; Openminded.org&lt;/a&gt;, in addition to reading, surfing, yoga, and enjoying the outdoors.&lt;/li&gt;\n&lt;li&gt;&lt;strong&gt;Satwik Mysore, Risk Engineer Territory Lead: &lt;/strong&gt;After graduating with an actuarial science degree, Satwik has spent most of his career at Travelers, where he built one of the largest and most profitable management liability books by forming strong broker relationships.&lt;/li&gt;\n&lt;li&gt;&lt;strong&gt;Brad Bahler, Risk Engineer Territory Lead:&lt;/strong&gt; Brad has over a decade of experience in management liability underwriting. He managed one of the largest books of small business management liability risks at Travelers, where he was known for his deep understanding of coverage, outstanding submission response times, and boundless enthusiasm for the space.&lt;/li&gt;\n&lt;li&gt;&lt;strong&gt;Jake O’Donnell, Risk Engineer Territory Lead:&amp;nbsp;&lt;/strong&gt;Jake started his insurance career at Chubb, where he was able to develop and grow a profitable book of private-for-profit and non-profit management liability business. Jake is known for his exceptional service to industry brokers and his extensive knowledge of management liability. Jake also is a CPCU designation recipient.&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;&lt;strong&gt;WHAT WE OFFER&lt;/strong&gt;&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;&lt;strong&gt;Fully remote workplace&lt;/strong&gt;&lt;/li&gt;\n&lt;li&gt;&lt;strong&gt;Unlimited Vacation&lt;/strong&gt;: We offer flexible time off, allowing you to take time when you need it.&lt;/li&gt;\n&lt;li&gt;&lt;strong&gt;Work from Anywhere&lt;/strong&gt;: Counterpart is a fully distributed company, meaning there is no office. We allow employees to work from wherever they do their best work, and invite the team to meet in person a couple times per year.&lt;/li&gt;\n&lt;li&gt;&lt;strong&gt;Stock Options&amp;nbsp;&lt;/strong&gt;&lt;/li&gt;\n&lt;li&gt;&lt;strong&gt;Health, Dental, and Vision Coverage&lt;/strong&gt;&lt;/li&gt;\n&lt;li&gt;&lt;strong&gt;401(k) Retirement Plan&lt;/strong&gt;&lt;/li&gt;\n&lt;li&gt;&lt;strong&gt;Parental Leave&lt;/strong&gt;&lt;/li&gt;\n&lt;li&gt;&lt;strong&gt;Home Office Allowance&lt;/strong&gt;: &lt;strong&gt;to set up your home office&lt;/strong&gt; with the necessary equipment and accessories.&lt;/li&gt;\n&lt;li&gt;&lt;strong&gt;Wellness Stipend&lt;/strong&gt;&lt;/li&gt;\n&lt;li&gt;&lt;strong&gt;Book stipend&lt;/strong&gt;&lt;/li&gt;\n&lt;li&gt;&lt;strong&gt;Professional Development Reimbursement&lt;/strong&gt;&lt;/li&gt;\n&lt;li&gt;&lt;strong&gt;No working birthdays&lt;/strong&gt;: &lt;strong&gt;Take your birthday off&lt;/strong&gt;, giving you the opportunity to relax, enjoy your special day, and spend time with loved ones.&lt;/li&gt;\n&lt;li&gt;&lt;strong&gt;Charitable Contribution Matching&lt;/strong&gt;&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;&lt;strong&gt;COUNTERPART&#39;S VALUES&lt;/strong&gt;&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;&lt;strong&gt;Conjoin Expectations&lt;/strong&gt; - it is the cornerstone of autonomy. Ensure you are aware of what is expected of you and clearly articulate what you expect of others.&amp;nbsp;&lt;/li&gt;\n&lt;li&gt;&lt;strong&gt;Speak Boldly &amp;amp; Honestly&lt;/strong&gt; - the only failure is not learning from mistakes. Don’t cheat yourself and your colleagues of the feedback needed when&amp;nbsp; expectations aren’t being met.&amp;nbsp;&lt;/li&gt;\n&lt;li&gt;&lt;strong&gt;Be Entrepreneurial&lt;/strong&gt; - control your own destiny.&amp;nbsp; Embrace action over perfection while navigating any obstacles that stand in the way of your ultimate goal.&amp;nbsp;&lt;/li&gt;\n&lt;li&gt;&lt;strong&gt;Practice Omotenashi&lt;/strong&gt; (“selfless hospitality”) - trust will follow.&amp;nbsp; Consider every interaction with internal and external partners an opportunity to develop trust by going above and beyond what is expected.&amp;nbsp;&lt;/li&gt;\n&lt;li&gt;&lt;strong&gt;Hold Nothing As Sacred&lt;/strong&gt; - create routines but modify them routinely.&lt;strong&gt;&amp;nbsp; &lt;/strong&gt;Take the time to reflect on where the business is today, where it needs to&amp;nbsp; go, and what you have to change in order to get there.&amp;nbsp;&lt;/li&gt;\n&lt;li&gt;&lt;strong&gt;Prioritize Wellness&lt;/strong&gt; - some things should never be sacrificed. We create an environment that stretches everyone to grow and improve, which is fulfilling, but is only one part of a meaningful life.&lt;br&gt;&lt;br&gt;&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;Our estimated pay range for this role is $120,000 to $170,000. Base salary is determined by a variety of factors, including but not limited to, market data, location, internal equitability, and experience.&lt;/p&gt;\n&lt;p&gt;We are committed to being a welcoming and inclusive workplace for everyone, and we are intentional about making sure people feel respected, supported and connected at work—regardless of who you are or where you come from. We value and celebrate our differences and we believe being open about who we are allows us to do the best work of our lives.&amp;nbsp;&lt;/p&gt;\n&lt;p&gt;We are an Equal Opportunity Employer. We do not discriminate against qualified applicants or employees on the basis of race, color, religion, gender identity, sex, sexual preference, sexual identity, pregnancy, national origin, ancestry, citizenship, age, marital status, physical disability, mental disability, medical condition, military status, or any other characteristic protected by federal, state, or local law, rule, or regulation.&amp;nbsp;&lt;/p&gt;\n&lt;p&gt;&lt;br&gt;&lt;br&gt;&lt;br&gt;&lt;/p&gt;","tags":"[\"management\",\"engineering\"]","pubDate":"2024-12-18T20:09:58.000Z","link":"https://job-boards.greenhouse.io/counterpart/jobs/4503021005","slug":"senior-production-risk-engineer-management-liability-northwest-counterpart-6056"},{"id":6118149905,"title":"(Senior) Production Risk Engineer - Management Liability (Southeast)","company":"Counterpart","image":"https://media.licdn.com/dms/image/v2/D560BAQEtAXn0ryOTBw/company-logo_200_200/company-logo_200_200/0/1694785555271/yourcounterpart_logo?e=1744243200&v=beta&t=-BEjbQP7PMMfAC5PtCYEgvJk4MuWZ4Bfzh54loGzpwo","description":"&lt;p&gt;&lt;strong&gt;(SENIOR) PRODUCTION RISK ENGINEER, (Southeast)&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;Counterpart believes in small businesses and is dedicated to helping them do more with less risk. By pairing leading insurance experts with cutting-edge technology, Counterpart empowers small business owners to grow with confidence. Exceptional underwriters, trusted insurance brokers, and prominent insurance carriers come together on the Counterpart platform to support small businesses by providing AI-driven management and professional liability underwriting and claims services. That’s where you come in…&lt;/p&gt;\n&lt;p&gt;As a member of the risk engineering team, you will be responsible for the production of premium through proper risk analysis and effective distribution of our product. In collaboration with the engineering, design, data, and operations team, you will leverage your industry knowledge and broker relationships to develop management liability and professional liability insurance products that brokers are eager to promote to their clients.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;AS A (SENIOR) PRODUCTION RISK ENGINEER YOU WILL:&lt;/strong&gt;&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;Achieve and exceed underwriting performance and revenue goals, underwriting in accordance with our stated procedures.&lt;/li&gt;\n&lt;li&gt;Price accounts with competitive terms quickly, thoughtfully, and in accordance with our guidelines.&lt;/li&gt;\n&lt;li&gt;Manage quote related communication and questions in a thoughtful and trusting manner.&lt;/li&gt;\n&lt;li&gt;Collaborate with the underwriting team of Risk Engineers on understanding the unique exposures of complex accounts.&lt;/li&gt;\n&lt;li&gt;Provide market feedback and recommend improvements to our terms, rates, and guidelines improving our policy forms and coverages&amp;nbsp;&lt;/li&gt;\n&lt;li&gt;Bind accounts through the continuous engagement of your assigned brokers.&lt;/li&gt;\n&lt;li&gt;Represent Counterpart at broker meetings and various industry events.&amp;nbsp;&lt;/li&gt;\n&lt;li&gt;Contribute ideas and feedback on our suite of tools and services as a key stakeholder of our product roadmap.&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;&lt;strong&gt;WE LOOK FOR TEAMMATES WHO HAVE:&lt;/strong&gt;&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;4-8 years of underwriting experience in the respective product.&lt;/li&gt;\n&lt;li&gt;A network of brokers, carriers, underwriters, or clients in the management liability or professional liability insurance space.&lt;/li&gt;\n&lt;li&gt;Expertise in various aspects of specialty liability products (e.g. rating procedures, policy forms, applications and coverage endorsements).&amp;nbsp;&lt;/li&gt;\n&lt;li&gt;Ability to successfully engage with brokers to establish long-term, profitable partnerships with brokerages.&lt;/li&gt;\n&lt;li&gt;Confidence presenting to key internal and external stakeholders.&amp;nbsp;&lt;/li&gt;\n&lt;li&gt;Demonstrated success with high performing sales and account management practices.&lt;/li&gt;\n&lt;li&gt;A proven track record of success, achieving and exceeding monthly, quarterly and annual targets.&lt;/li&gt;\n&lt;li&gt;Enthusiasm for continuous challenges in a high velocity environment.&lt;/li&gt;\n&lt;li&gt;Flexibility for travel, when necessary (once per month as a minimum)&lt;/li&gt;\n&lt;li&gt;College Degree with relevant work experience of 4+ years.&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;&lt;strong&gt;WHO YOU WILL WORK WITH:&amp;nbsp;&lt;/strong&gt;&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;&lt;strong&gt;Mike Levins, Head of Insurance&lt;/strong&gt;: Mike previously was the Head of Broker Relations and US MGA Operations at Hiscox. Mike oversaw the Midwest region with ~20 underwriters offering 13 different product lines, the primary lines being management liability, professional liability, and cyber/technology. His extensive insurance career has afforded Mike strong relationships across hundreds of retail and wholesale brokers. Mike received his BS from Marquette University and MBA from Benedictine University.&lt;/li&gt;\n&lt;li&gt;&lt;strong&gt;Tanner Hackett, CEO:&lt;/strong&gt; Having founded two other major startups, including Button and Lazada, Tanner now spends his time focused on mental health through his philanthropy,&lt;a href=&quot;http://openminded.org&quot;&gt; Openminded.org&lt;/a&gt;, in addition to reading, surfing, yoga, and enjoying the outdoors.&lt;/li&gt;\n&lt;li&gt;&lt;strong&gt;Satwik Mysore, Risk Engineer Territory Lead: &lt;/strong&gt;After graduating with an actuarial science degree, Satwik has spent most of his career at Travelers, where he built one of the largest and most profitable management liability books by forming strong broker relationships.&lt;/li&gt;\n&lt;li&gt;&lt;strong&gt;Brad Bahler, Risk Engineer Territory Lead:&lt;/strong&gt; Brad has over a decade of experience in management liability underwriting. He managed one of the largest books of small business management liability risks at Travelers, where he was known for his deep understanding of coverage, outstanding submission response times, and boundless enthusiasm for the space.&lt;/li&gt;\n&lt;li&gt;&lt;strong&gt;Jake O’Donnell, Risk Engineer Territory Lead:&amp;nbsp;&lt;/strong&gt;Jake started his insurance career at Chubb, where he was able to develop and grow a profitable book of private-for-profit and non-profit management liability business. Jake is known for his exceptional service to industry brokers and his extensive knowledge of management liability. Jake also is a CPCU designation recipient.&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;&lt;strong&gt;WHAT WE OFFER&lt;/strong&gt;&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;&lt;strong&gt;Fully remote workplace&lt;/strong&gt;&lt;/li&gt;\n&lt;li&gt;&lt;strong&gt;Unlimited Vacation&lt;/strong&gt;: We offer flexible time off, allowing you to take time when you need it.&lt;/li&gt;\n&lt;li&gt;&lt;strong&gt;Work from Anywhere&lt;/strong&gt;: Counterpart is a fully distributed company, meaning there is no office. We allow employees to work from wherever they do their best work, and invite the team to meet in person a couple times per year.&lt;/li&gt;\n&lt;li&gt;&lt;strong&gt;Stock Options&amp;nbsp;&lt;/strong&gt;&lt;/li&gt;\n&lt;li&gt;&lt;strong&gt;Health, Dental, and Vision Coverage&lt;/strong&gt;&lt;/li&gt;\n&lt;li&gt;&lt;strong&gt;401(k) Retirement Plan&lt;/strong&gt;&lt;/li&gt;\n&lt;li&gt;&lt;strong&gt;Parental Leave&lt;/strong&gt;&lt;/li&gt;\n&lt;li&gt;&lt;strong&gt;Home Office Allowance&lt;/strong&gt;: &lt;strong&gt;to set up your home office&lt;/strong&gt; with the necessary equipment and accessories.&lt;/li&gt;\n&lt;li&gt;&lt;strong&gt;Wellness Stipend&lt;/strong&gt;&lt;/li&gt;\n&lt;li&gt;&lt;strong&gt;Book stipend&lt;/strong&gt;&lt;/li&gt;\n&lt;li&gt;&lt;strong&gt;Professional Development Reimbursement&lt;/strong&gt;&lt;/li&gt;\n&lt;li&gt;&lt;strong&gt;No working birthdays&lt;/strong&gt;: &lt;strong&gt;Take your birthday off&lt;/strong&gt;, giving you the opportunity to relax, enjoy your special day, and spend time with loved ones.&lt;/li&gt;\n&lt;li&gt;&lt;strong&gt;Charitable Contribution Matching&lt;/strong&gt;&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;&lt;strong&gt;COUNTERPART&#39;S VALUES&lt;/strong&gt;&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;&lt;strong&gt;Conjoin Expectations&lt;/strong&gt; - it is the cornerstone of autonomy. Ensure you are aware of what is expected of you and clearly articulate what you expect of others.&amp;nbsp;&lt;/li&gt;\n&lt;li&gt;&lt;strong&gt;Speak Boldly &amp;amp; Honestly&lt;/strong&gt; - the only failure is not learning from mistakes. Don’t cheat yourself and your colleagues of the feedback needed when&amp;nbsp; expectations aren’t being met.&amp;nbsp;&lt;/li&gt;\n&lt;li&gt;&lt;strong&gt;Be Entrepreneurial&lt;/strong&gt; - control your own destiny.&amp;nbsp; Embrace action over perfection while navigating any obstacles that stand in the way of your ultimate goal.&amp;nbsp;&lt;/li&gt;\n&lt;li&gt;&lt;strong&gt;Practice Omotenashi&lt;/strong&gt; (“selfless hospitality”) - trust will follow.&amp;nbsp; Consider every interaction with internal and external partners an opportunity to develop trust by going above and beyond what is expected.&amp;nbsp;&lt;/li&gt;\n&lt;li&gt;&lt;strong&gt;Hold Nothing As Sacred&lt;/strong&gt; - create routines but modify them routinely.&lt;strong&gt;&amp;nbsp; &lt;/strong&gt;Take the time to reflect on where the business is today, where it needs to&amp;nbsp; go, and what you have to change in order to get there.&amp;nbsp;&lt;/li&gt;\n&lt;li&gt;&lt;strong&gt;Prioritize Wellness&lt;/strong&gt; - some things should never be sacrificed. We create an environment that stretches everyone to grow and improve, which is fulfilling, but is only one part of a meaningful life.&lt;br&gt;&lt;br&gt;&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;Our estimated pay range for this role is $120,000 to $170,000. Base salary is determined by a variety of factors, including but not limited to, market data, location, internal equitability, and experience.&lt;/p&gt;\n&lt;p&gt;We are committed to being a welcoming and inclusive workplace for everyone, and we are intentional about making sure people feel respected, supported and connected at work—regardless of who you are or where you come from. We value and celebrate our differences and we believe being open about who we are allows us to do the best work of our lives.&amp;nbsp;&lt;/p&gt;\n&lt;p&gt;We are an Equal Opportunity Employer. We do not discriminate against qualified applicants or employees on the basis of race, color, religion, gender identity, sex, sexual preference, sexual identity, pregnancy, national origin, ancestry, citizenship, age, marital status, physical disability, mental disability, medical condition, military status, or any other characteristic protected by federal, state, or local law, rule, or regulation.&amp;nbsp;&lt;/p&gt;","tags":"[\"management\",\"engineering\"]","pubDate":"2024-12-18T20:08:58.000Z","link":"https://job-boards.greenhouse.io/counterpart/jobs/4503049005","slug":"senior-production-risk-engineer-management-liability-southeast-counterpart-9504"},{"id":3495480272,"title":"Claims Manager","company":"Counterpart","image":"https://media.licdn.com/dms/image/v2/D560BAQEtAXn0ryOTBw/company-logo_200_200/company-logo_200_200/0/1694785555271/yourcounterpart_logo?e=1744243200&v=beta&t=-BEjbQP7PMMfAC5PtCYEgvJk4MuWZ4Bfzh54loGzpwo","description":"&lt;p&gt;Counterpart is a management liability insurance platform for the 21st century workplace. We offer products and services to help companies align the risks and incentives of creating great organizations. Our platform is designed to measure risk more efficiently using the most advanced rating system in the industry, while also proactively mitigating the risks of our insureds. Ultimately, we provide businesses with frameworks to be the best versions of themselves. That’s where you come in.&lt;/p&gt;\n&lt;p&gt;As an early member of the Claims team, you will be one of the initial users of, and key feedback providers for, our active claims management processes and systems. Your input will help to shape and improve how we fulfill our mission of providing world-class service through tightly managing legal costs, making data-driven decisions when analyzing a claim’s value, and ensuring that other potentially responsible parties pay their fair share. This will necessitate close collaboration with Claims leadership, our internal Data and Engineering teams, and our carrier partners.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;YOU WILL&lt;/strong&gt;&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;Complete accurate and timely investigations into the coverage, liability, and damages for each claim assigned to you.&lt;/li&gt;\n&lt;li&gt;Actively manage each claim assigned to you in a way that produces the most timely and cost-effective resolution.&lt;/li&gt;\n&lt;li&gt;Build and maintain positive and productive working relationships with internal and external customers, including policyholders, brokers, carrier partners, and Risk Engineers.&lt;/li&gt;\n&lt;li&gt;Direct and monitor assignments to experts and outside counsel, and hold those vendors accountable for meeting or exceeding our service standards.&amp;nbsp;&lt;/li&gt;\n&lt;li&gt;Support our data collection efforts and models by effectively using the Counterpart claim system to fully and accurately capture critical details about each claim assigned to you.&lt;/li&gt;\n&lt;li&gt;Identify and escalate insights into emerging claims trends across industries, geographies, and key business segments.&lt;/li&gt;\n&lt;li&gt;Offer user-level feedback and insights to support the continuous improvement of our claim handling processes, guidelines, and systems.&lt;/li&gt;\n&lt;li&gt;Ensure that every touchpoint with our insureds and brokers is representative of our brand, mission, and vision.&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;&lt;strong&gt;YOU HAVE&lt;/strong&gt;&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;At least 3 years of professional experience, with at least 2 years of experience litigating or managing claims in one or more of the following areas:&lt;br&gt;\n&lt;ul&gt;\n&lt;li&gt;Employment Practices Liability&lt;/li&gt;\n&lt;li&gt;Miscellaneous Professional Liability&lt;/li&gt;\n&lt;li&gt;Directors and Officers Liability&lt;/li&gt;\n&lt;li&gt;Errors and Omissions Liability&lt;/li&gt;\n&lt;/ul&gt;\n&lt;/li&gt;\n&lt;li&gt;Previous carrier or broker experience is a plus&lt;/li&gt;\n&lt;li&gt;Bachelor’s degree required; law degree (J.D.) and professional designations (RPLU, AIC, etc.) highly preferred.&lt;/li&gt;\n&lt;li&gt;Must possess all required state claim adjuster licenses, or be able to obtain them within 90 days of hire.&lt;/li&gt;\n&lt;li&gt;Proven ability to work both independently on complex matters and collaboratively as a team player to assist others as needed.&lt;/li&gt;\n&lt;li&gt;High level of personal initiative and leadership skills.&lt;/li&gt;\n&lt;li&gt;Exceptional time management, problem solving and organizational skills.&lt;/li&gt;\n&lt;li&gt;Comfort and skill operating in a paperless claims environment and using Microsoft Office products (Word, Excel, etc.). Additional familiarity with Google Docs Editors suite is a plus.&lt;/li&gt;\n&lt;li&gt;Willingness to use creative thinking and data-driven insights to overcome obstacles to resolution.&lt;/li&gt;\n&lt;li&gt;Strong communication skills, both verbal and written.&lt;/li&gt;\n&lt;li&gt;Ability to succeed in a full remote workplace environment, and travel as necessary (approximately 10-15%).&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;&lt;strong&gt;WHO YOU WILL WORK WITH:&lt;/strong&gt;&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;&lt;strong&gt;Eric Marler, Head of Claims:&lt;/strong&gt; An industry veteran, Eric has more than 20 years of experience working with or for insurers offering management liability solutions. He is a licensed attorney who began his career in private practice before transitioning in-house. Prior to joining Counterpart, Eric held leadership roles at Great American Insurance Group and The Hanover Insurance Group.&lt;/li&gt;\n&lt;li&gt;&lt;strong&gt;Mike Levins, Head of Insurance&lt;/strong&gt;: Mike previously was the Head of Broker Relations and US MGA Operations at Hiscox. Mike oversaw the Midwest region with ~20 underwriters offering 13 different product lines, the primary lines being management liability, professional liability, and cyber/technology. His extensive insurance career has afforded Mike strong relationships across hundreds of retail and wholesale brokers. Mike received his BS from Marquette University and MBA from Benedictine University.&lt;/li&gt;\n&lt;li&gt;&lt;strong&gt;Tobias Schuler, Head of Data Analytics&lt;/strong&gt;: After becoming a Fellow of the Casualty Actuarial Society and working as a consultant actuary at EY for several years, Tobias went on to drive the actuarial data &amp;amp; systems teams at QBE. He further leveraged his deep insurance and technical expertise at Munich Re Digital Partners in North America, where he headed data and analytics and oversaw the data infrastructure behind some of their largest programs.&lt;/li&gt;\n&lt;li&gt;&lt;strong&gt;Chris Shafer, Special&amp;nbsp; Projects&lt;/strong&gt;: Chris is a published scientific author, having studied the neural correlates of gratitude at the lauded Brain and Creativity Institute. He has since helped to launch numerous businesses in which he held a variety of critical roles from product management to business operations to strategic partnerships. Chris received his bachelor’s degree in Biological Sciences from the University of Southern California.&lt;/li&gt;\n&lt;li&gt;&lt;strong&gt;Tanner Hackett, CEO &amp;amp; Founder&lt;/strong&gt;: Having founded two other major startups, including Button and Lazada, Tanner now spends his time focused on mental health through his philanthropy,&lt;a href=&quot;http://openminded.org&quot;&gt; Openminded.org&lt;/a&gt;, in addition to reading, surfing, yoga, and enjoying the outdoors.&amp;nbsp;&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;&lt;strong&gt;WHAT WE OFFER&lt;/strong&gt;&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;&lt;strong&gt;Unlimited Vacation&lt;/strong&gt;: We offer flexible time off, allowing you to take time when you need it.&lt;/li&gt;\n&lt;li&gt;&lt;strong&gt;Work from Anywhere&lt;/strong&gt;: Counterpart is a fully distributed company, meaning there is no office. We allow employees to work from wherever they do their best work, and invite the team to meet in person a couple times per year.&lt;/li&gt;\n&lt;li&gt;&lt;strong&gt;Stock Options&lt;/strong&gt;&lt;strong&gt;&amp;nbsp;&lt;/strong&gt;&lt;/li&gt;\n&lt;li&gt;&lt;strong&gt;Health, Dental, and Vision Coverage&lt;/strong&gt;&lt;/li&gt;\n&lt;li&gt;&lt;strong&gt;401(k) Retirement Plan&lt;/strong&gt;&lt;/li&gt;\n&lt;li&gt;&lt;strong&gt;Parental Leave&lt;/strong&gt;&lt;/li&gt;\n&lt;li&gt;&lt;strong&gt;Home Office Allowance&lt;/strong&gt;: &lt;strong&gt;to set up your home office&lt;/strong&gt; with the necessary equipment and accessories.&lt;/li&gt;\n&lt;li&gt;&lt;strong&gt;Book stipend&lt;/strong&gt;&lt;/li&gt;\n&lt;li&gt;&lt;strong&gt;Professional Development Reimbursement&lt;/strong&gt;&lt;/li&gt;\n&lt;li&gt;&lt;strong&gt;No working birthdays&lt;/strong&gt;: &lt;strong&gt;Take your birthday off&lt;/strong&gt;, giving you the opportunity to relax, enjoy your special day, and spend time with loved ones.&lt;/li&gt;\n&lt;li&gt;&lt;strong&gt;Charitable Contribution Matching&lt;/strong&gt;&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;&lt;strong&gt;COUNTERPART&#39;S VALUES&lt;/strong&gt;&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;&lt;strong&gt;Conjoin Expectations&lt;/strong&gt; - it is the cornerstone of autonomy. Ensure you are aware of what is expected of you and clearly articulate what you expect of others.&amp;nbsp;&lt;/li&gt;\n&lt;li&gt;&lt;strong&gt;Speak Boldly &amp;amp; Honestly&lt;/strong&gt; - the only failure is not learning from mistakes. Don’t cheat yourself and your colleagues of the feedback needed when&amp;nbsp; expectations aren’t being met.&amp;nbsp;&lt;/li&gt;\n&lt;li&gt;&lt;strong&gt;Be Entrepreneurial&lt;/strong&gt; - control your own destiny.&amp;nbsp; Embrace action over perfection while navigating any obstacles that stand in the way of your ultimate goal.&amp;nbsp;&lt;/li&gt;\n&lt;li&gt;&lt;strong&gt;Practice Omotenashi&lt;/strong&gt; (“selfless hospitality”) - trust will follow.&amp;nbsp; Consider every interaction with internal and external partners an opportunity to develop trust by going above and beyond what is expected.&amp;nbsp;&lt;/li&gt;\n&lt;li&gt;&lt;strong&gt;Hold Nothing As Sacred&lt;/strong&gt; - create routines but modify them routinely.&lt;strong&gt;&amp;nbsp; &lt;/strong&gt;Take the time to reflect on where the business is today, where it needs to&amp;nbsp; go, and what you have to change in order to get there.&amp;nbsp;&lt;/li&gt;\n&lt;li&gt;&lt;strong&gt;Prioritize Wellness&lt;/strong&gt; - some things should never be sacrificed. We create an environment that stretches everyone to grow and improve, which is fulfilling, but is only one part of a meaningful life.&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;Our estimated pay range for this role is $120,000 to $160,000. Base salary is determined by a variety of factors, including but not limited to, market data, location, internal equitability, and experience.&amp;nbsp;&lt;/p&gt;\n&lt;p&gt;Counterpart is committed to being a welcoming and inclusive workplace for everyone, and we are intentional about making sure people feel respected, supported and connected at work—regardless of who you are or where you come from. We value and celebrate our differences and we believe being open about who we are allows us to do the best work of our lives.&lt;/p&gt;\n&lt;p&gt;We are an Equal Opportunity Employer. We do not discriminate against qualified applicants or employees on the basis of race, color, religion, gender identity, sex, sexual preference, sexual identity, pregnancy, national origin, ancestry, citizenship, age, marital status, physical disability, mental disability, medical condition, military status, or any other characteristic protected by federal, state, or local law, rule, or regulation.&lt;/p&gt;","tags":"[\"management\",\"engineering\",\"legal\"]","pubDate":"2024-12-18T18:54:17.000Z","link":"https://job-boards.greenhouse.io/counterpart/jobs/4334134005","slug":"claims-manager-counterpart-3272"},{"id":2416640338,"title":"SaaS Solutions Architect (Post Sales Implementation)","company":"Zingtree","image":"https://avatars.githubusercontent.com/u/63677130?s=200&v=4","description":"<div><span style=\"font-size: 11pt\">Zingtree is the next gen, intelligent process automation platform that reimagines customer experience operations for top Customer Support leaders. With over 500 customers, including global enterprises like Optum, Corpay, Sony, SharkNinja, and Allianz, Zingtree transforms self-service, uncovers and implements automation opportunities, and makes every customer service agent an expert.</span></div><div><br></div><div><span style=\"font-size: 11pt\">We are seeking a </span><b style=\"font-size: 11pt\">SaaS Solutions Architect </b><span style=\"font-size: 11pt\">with project management skills. The role is an individual contributor who is a hands-on problem-solver capable of executing end-to-end implementations. In this role, you will guide clients through the technical aspects of the implementation process, from initial systems integrations to workflow design and build, to go-live. You’ll work closely with both client stakeholders and internal teams to manage project timelines, configure integrations, oversee AI workflow enablement, and ensure our solutions meet customer-specific needs. This role requires a unique blend of technical expertise, project management skills, and customer-centric mindset.&nbsp;</span></div><div><span style=\"font-size: 11pt\">Zingtree is the next gen, intelligent process automation platform that reimagines customer experience operations for top Customer Support leaders. With over 500 customers, including global enterprises like Optum, Corpay, Sony, SharkNinja, and Allianz, Zingtree transforms self-service, uncovers and implements automation opportunities, and makes every customer service agent an expert.</span></div><div><br></div><div><span style=\"font-size: 11pt\">We are seeking a </span><b style=\"font-size: 11pt\">SaaS Solutions Architect </b><span style=\"font-size: 11pt\">with project management skills. The role is an individual contributor who is a hands-on problem-solver capable of executing end-to-end implementations. In this role, you will guide clients through the technical aspects of the implementation process, from initial systems integrations to workflow design and build, to go-live. You’ll work closely with both client stakeholders and internal teams to manage project timelines, configure integrations, oversee AI workflow enablement, and ensure our solutions meet customer-specific needs. This role requires a unique blend of technical expertise, project management skills, and customer-centric mindset.&nbsp;</span></div><div><span style=\"font-size: 11pt\">Zingtree is committed to internal pay equity and offers a competitive compensation package, including base salary, equity, and benefits. Our benefits package includes premium medical, dental, and vision benefits, paid parental leave, a flexible paid time off policy, and monthly work from home stipends.&nbsp;</span></div><div><br></div><div><span style=\"font-size: 11pt\">For cash compensation, Zingtree sets standard ranges for all roles based on function, level, and geographic location, benchmarked against similar-stage growth companies. The US pay range&nbsp; for this role is $150,000 - $200,000 a year. Final offers are adjusted based on geographic location, candidate experience, and expertise.&nbsp;</span></div><div><br></div><div><span style=\"font-size: 11pt\">Zingtree provides equal employment opportunities (EEO) to all employees and applicants for employment without regard to race, color, religion, gender, gender identity, gender expression, sexual orientation, national origin, genetics, disability, age, or veteran status.</span></div><h3>Responsibilities</h3><li><b>Solution Design &amp; Customization:</b> Design, demo and build tailored AI workflows and integrations that meet customer support objectives.</li><li><b>Technical Configuration &amp; Integration:</b> Coordinate with client IT resources to oversee the technical configuration of integrations with client CRM systems, APIs, and other third-party tools, ensuring seamless data flow and system compatibility.</li><li><b>Client Onboarding &amp; Planning:</b> Participate in onboarding sessions to gather requirements, understand customer business processes, and confirm project goals and timelines.</li><li><b>Stakeholder Collaboration:</b> Act as the primary technical point of contact for clients throughout the project lifecycle, providing regular updates and managing expectations. Operate as the technical liaison to translate requirements between client business and IT resources, as well internally with team members</li><li><b>Risk &amp; Issue Management:</b> Identify and mitigate project risks; resolve technical and process-related issues to prevent project delays.</li><li><b>Testing &amp; Validation:</b> Guide UAT (User Acceptance Testing) with clients, ensuring workflows and integrations function as intended and meet defined objectives.</li><li><b>Training &amp; Enablement:</b> Participate in platform and user training sessions to ensure customers are equipped to build and maintain AI-enabled features, workflows, and reports.</li><li><b>Go-Live &amp; Post-Implementation Support:</b> Accountable for clients success through the go-live process, and ensure a smooth handoff to Customer Success and Support teams for ongoing service.</li><li><b>Project Management:</b> Coordinate and collaborate on multiple SaaS implementation projects, adhering to project timeline and scope while maintaining high-quality standards.</li><h3>Qualifications</h3><li><b>Experience:</b> 7+ years in a solutions architect, customer engineering, technical project implementation roles, with at least 4+ years in enterprise B2B SaaS, preferably in customer support or contact center solutions, and with start-up experience.</li><li><b>Technical Skills:</b> Hands-on experience with automation technologies, middleware, integration architecture patterns, authentication protocols, web services technologies, enterprise messaging patterns, APIs, SOA, ESB, BPM, SDKs, and Databases. Front-end development skills, including custom coding (JS, CSS) and data objects (JSON, ETL); ability to understand and explain technical requirements related to AI technology, large language models, prompt engineering, agentic AI-led workflows and integrations. Experience building integrations to packaged CRMs, specifically Salesforce and Zendesk are a plus.</li><li><b>Business Acumen: </b>Specializes in digesting complex business requirements and designing comprehensive and integrated workflow solutions that are flexible and adaptable to the client's needs.</li><li><b>Analytical Mindset:</b> Proficient in troubleshooting technical challenges and collaborating with cross-functional teams to find solutions. Ability to quickly understand operational processes and identify areas the technology can condense and/or optimize the processes.</li><li><b>Client-Facing Expertise:</b> Exceptional communication and interpersonal skills; experience interfacing with customers to manage expectations, resolve issues, and ensure project success. Ability to clearly articulate technical topics to a non-technical audience, including experience working with executives.</li><li><b>Project Management:</b> Strong organizational and project management skills.</li><li><b>Education:</b> Bachelor’s degree in Computer Science, Engineering, Information Technology, or related field (or equivalent work experience).</li><h3>What we offer</h3><li>Competitive Compensation with opportunity for discretionary bonus</li><li>Comprehensive Health Benefits - 100% of employee premiums and 75%-80% of dependent premiums on most health, dental, and vision insurance are covered by us</li><li>401K plans - Add to your retirement planning </li><li>Paid Parental Leave - Paid time off for parents to spend time with their new child</li><li>Unlimited PTO - Take the time you need to recharge and bring your best self to work&nbsp;</li><li>Flexible Remote Work - Work from anywhere</li><li>Co-Working Reimbursement - Expense up to $200 a month on co-working space</li><li>Home Office Stipend - Receive up to $500 to create a great work environment at home, and $100 a month for Internet, phone, etc.</li>","tags":"[\"management\",\"engineering\",\"b2b\",\"database\"]","pubDate":"2024-12-09T20:15:08.681Z","link":"https://jobs.lever.co/zingtree/798943d9-de29-45c5-a98d-24d5855888c1","slug":"saas-solutions-architect-post-sales-implementation-zingtree-2449"},{"id":6082255479,"title":"Manager of IT and Information Security","company":"Clearer","image":"https://avatars.githubusercontent.com/u/100294047?s=200&v=4","description":"<div><b style=\"font-size: 10pt;\">Take the clearer route to growth. </b></div><div><span style=\"font-size: 10pt;\">At clearer.io, we’re reimagining eCommerce with a powerful suite of apps that take search, discovery, and customer connection to the next level. Our mission? Simple: make it easy for our partners to thrive, with solutions that deliver growth, efficiency, and standout results. And we’re more than just tech—we’re here to guide, support, and empower our customers every step of the way. </span></div><div><br></div><div><span style=\"font-size: 10pt;\">Now’s the time to join clearer.io. With fresh investment and rapid growth, we’re expanding our global team of driven professionals who share a clear vision for customer success. Here, you’ll take charge of your work, make an impact, and be part of a team that values clarity, results, and real connection. If you’re ready to cut out the clutter, drive real results, and lead in a dynamic eCommerce environment, clearer.io is where you’ll find purpose, growth, and opportunity. Join us, and help shape the future of eCommerce.</span></div><div><br></div><div><b style=\"font-size: 10pt;\">Your Impact:</b></div><div><span style=\"font-size: 10pt;\">We are seeking a talented and experienced Manager of IT and Information Security to oversee and manage the company’s IT operations, including employee help desk, and the implementation and maintenance of information security strategies. This role will ensure the smooth functioning of IT services while safeguarding the organization’s digital assets and maintaining compliance with industry standards.&nbsp; You will collaborate closely with internal stakeholders, external partners, and other portfolio companies to identify security risks, implement robust security solutions, and ensure compliance with industry regulations and best practices.&nbsp; This position will report to the CTO.</span></div><div><br></div><div><br></div><div><b style=\"font-size: 10pt;\">Take the clearer route to growth. </b></div><div><span style=\"font-size: 10pt;\">At clearer.io, we’re reimagining eCommerce with a powerful suite of apps that take search, discovery, and customer connection to the next level. Our mission? Simple: make it easy for our partners to thrive, with solutions that deliver growth, efficiency, and standout results. And we’re more than just tech—we’re here to guide, support, and empower our customers every step of the way. </span></div><div><br></div><div><span style=\"font-size: 10pt;\">Now’s the time to join clearer.io. With fresh investment and rapid growth, we’re expanding our global team of driven professionals who share a clear vision for customer success. Here, you’ll take charge of your work, make an impact, and be part of a team that values clarity, results, and real connection. If you’re ready to cut out the clutter, drive real results, and lead in a dynamic eCommerce environment, clearer.io is where you’ll find purpose, growth, and opportunity. Join us, and help shape the future of eCommerce.</span></div><div><br></div><div><b style=\"font-size: 10pt;\">Your Impact:</b></div><div><span style=\"font-size: 10pt;\">We are seeking a talented and experienced Manager of IT and Information Security to oversee and manage the company’s IT operations, including employee help desk, and the implementation and maintenance of information security strategies. This role will ensure the smooth functioning of IT services while safeguarding the organization’s digital assets and maintaining compliance with industry standards.&nbsp; You will collaborate closely with internal stakeholders, external partners, and other portfolio companies to identify security risks, implement robust security solutions, and ensure compliance with industry regulations and best practices.&nbsp; This position will report to the CTO.</span></div><div><br></div><div><br></div><h3>What you'll do:</h3><li><u><b>Information Security Management</b></u></li><li>Develop and implement security policies, procedures, and standards to ensure compliance with regulatory requirements and industry best practices.</li><li>Coordinate regular security assessments, vulnerability scans, and penetration tests to identify and remediate security vulnerabilities and weaknesses.</li><li>Monitor and analyze security events and incidents, investigate security incidents, and provide incident response and remediation support as needed.</li><li> Collaborate with cross-functional teams to integrate security controls into software engineering, business processes and IT systems and provide security guidance and recommendations to various teams and portfolio companies.</li><li>Stay abreast of emerging threats, vulnerabilities, and security technologies, and provide guidance and recommendations for enhancing the company’s security posture. </li><li>Participate in security audits, assessments, and compliance reviews, and assist in responding to security-related inquiries from investors and regulatory authorities.</li><li>Train employees on security awareness and ensure adherence to security protocols.</li><li><u><b>Information Technology</b></u></li><li>Manage endpoint security, including antivirus, patch management, and encryption solutions for desktops, laptops, and mobile devices.</li><li>Ensure proper configuration and maintenance of network hardware, firewalls, VPNs, and other critical infrastructure components, working closley with our DevOps team. </li><li>Troubleshoot and resolve escalated network and connectivity issues in a timely manner.</li><li> Lead the team in providing efficient and responsive technical support to employees across the organization. </li><li>Implement and manage ticketing systems and workflows to prioritize and address IT support requests effectively. </li><li>Oversee the provisioning and decommissioning of employee devices and accounts.</li><li>Ensure timely setup, maintenance, and upgrades of hardware and software to minimize downtime and maximize productivity.</li><li>Develop and maintain a knowledge base and self-service resources for common IT support issues.</li><h3>What you'll bring: </h3><li>Bachelor’s degree in computer science, Information Security, or related field; or relevant work experience</li><li>Proven experience (5+ years) in information technology, with a focus on designing, implementing, and managing security controls and solutions in a corporate environment.</li><li>Strong knowledge of operating systems (Windows and macOS) and enterprise productivity tools (e.g., Microsoft 365, Google Workspace).</li><li>Experience with security frameworks and standards (e.g., NIST, ISO 27001, SOC 2) and regulatory compliance requirements (e.g., GDPR, PCI DSS).</li><li>Familiarity with IT service management (ITSM) tools, endpoint management, and asset tracking solutions.</li><li>Strong leadership and team management capabilities, with the ability to build and motivate a high-performing IT team.</li><li>Excellent analytical and problem-solving skills, with the ability to analyze complex security issues, prioritize tasks, and develop effective solutions.</li><li>Strong communication and interpersonal skills, with the ability to effectively communicate technical information to non-technical stakeholders and collaborate with cross-functional teams. </li><li>Ability to work independently and collaboratively in a fast-paced, dynamic environment, and manage multiple projects and priorities simultaneously.</li><li>Willing&nbsp; and able to travel to branch offices as needed.</li><h3>Why Clearer.io</h3><li><b>Customer-First:</b> Everything we do is for our customers, with real people ready to listen, understand, and help them succeed.</li><li><b>Growth-Focused:</b> We’re not just selling apps—we’re delivering results. We make eCommerce growth easy and intuitive.</li><li><b>Clear and Simple:</b> Our solutions work seamlessly, so you’ll enjoy an environment that’s direct, down-to-earth, and driven by genuine connections.</li><li><b>Supportive Team:</b> You’ll join a diverse team that values collaboration, empowerment, and a shared vision for success.</li><li><b>Clear Benefits: </b>Comprehensive private medical benefits </li><div><b style=\"font-size: 10pt;\">Be a part of clearer.io</b><span style=\"font-size: 10pt;\">—where your expertise fuels real change in eCommerce. Come and join us- it’s clear we’re the place to be!</span></div>","tags":"[\"management\",\"engineering\"]","pubDate":"2024-12-09T17:41:30.159Z","link":"https://jobs.lever.co/Clearer/368dc219-1613-4bfa-a589-0f2dc9b2a369","slug":"manager-of-it-and-information-security-clearer-6311"},{"id":1719648546,"title":"Software Engineer, Vietnam","company":"Clearer","image":"https://avatars.githubusercontent.com/u/100294047?s=200&v=4","description":"<div><b style=\"font-size: 16px;\">Take the clearer route to smart career growth.</b><span style=\"font-size: 16px;\">&nbsp;</span></div><div><span style=\"font-size: 16px;\">At Clearer.io, we’re reimagining eCommerce by enhancing search, discovery, and customer engagement through a standout suite of innovative apps. Our mission is straightforward yet powerful: to empower our partners with solutions that streamline their operations, foster customer trust, and drive sustainable growth. We’re not just about technology—we’re about making eCommerce smarter, simpler, and more impactful, delivering solutions that inspire confidence and create real results. With fresh investment and rapid growth, this is the perfect time to join our journey. When you become part of Clearer.io, you step into a role where your work truly matters. Here, you’ll have the opportunity to own your projects, drive outcomes, and make an impact within a supportive, diverse team of professionals dedicated to customer success. We value clarity, results, and a customer-centric approach that keeps us focused on delivering real value to our partners every step of the way. If you’re ready to cut through the clutter and focus on what really matters in a dynamic eCommerce landscape, Clearer.io is the place to grow, lead, and shape the future of online retail. Join us, and be part of a team that’s committed to making eCommerce clearer, more efficient, and more rewarding for everyone.</span></div><div><br></div><div><b style=\"font-size: 16px;\">Your Impact:</b></div><div><span style=\"font-size: 16px;\">You will be working on the technical stack of our returns platform, Rich Returns, which is a growing platform with the goal of providing our merchants and their customers an excellent post-sale experience. As part of our development team, you will play a vital role developing our latest features with technologies such as JavaScript, React, Express.js and React Native.&nbsp;Additionally, we utilize Amazon Web Services, PostgreSQL and Redis.</span></div><div><b style=\"font-size: 16px;\">Take the clearer route to smart career growth.</b><span style=\"font-size: 16px;\">&nbsp;</span></div><div><span style=\"font-size: 16px;\">At Clearer.io, we’re reimagining eCommerce by enhancing search, discovery, and customer engagement through a standout suite of innovative apps. Our mission is straightforward yet powerful: to empower our partners with solutions that streamline their operations, foster customer trust, and drive sustainable growth. We’re not just about technology—we’re about making eCommerce smarter, simpler, and more impactful, delivering solutions that inspire confidence and create real results. With fresh investment and rapid growth, this is the perfect time to join our journey. When you become part of Clearer.io, you step into a role where your work truly matters. Here, you’ll have the opportunity to own your projects, drive outcomes, and make an impact within a supportive, diverse team of professionals dedicated to customer success. We value clarity, results, and a customer-centric approach that keeps us focused on delivering real value to our partners every step of the way. If you’re ready to cut through the clutter and focus on what really matters in a dynamic eCommerce landscape, Clearer.io is the place to grow, lead, and shape the future of online retail. Join us, and be part of a team that’s committed to making eCommerce clearer, more efficient, and more rewarding for everyone.</span></div><div><br></div><div><b style=\"font-size: 16px;\">Your Impact:</b></div><div><span style=\"font-size: 16px;\">You will be working on the technical stack of our returns platform, Rich Returns, which is a growing platform with the goal of providing our merchants and their customers an excellent post-sale experience. As part of our development team, you will play a vital role developing our latest features with technologies such as JavaScript, React, Express.js and React Native.&nbsp;Additionally, we utilize Amazon Web Services, PostgreSQL and Redis.</span></div><h3>What you'll do: </h3><li>Coding: Write clean, maintainable, and efficient code. </li><li>Design: Participate in the design and architecture of software solutions. </li><li>Testing: Implement and run tests to ensure code quality. </li><li>Documentation: Document code, processes, and designs clearly and comprehensively. </li><li>Maintenance: Maintain and update existing software applications.</li><li>Collaboration: Work closely with other developers, designers, and product managers to deliver high-quality software.</li><li>Learning: Continuously learn and stay updated with new technologies and industry trends.</li><li>Problem-Solving: Tackle and solve moderately complex problems and provide solutions.</li><h3>What you'll bring:</h3><li>2-4 years of experience</li><li>Understanding of type safety principles is essential</li><li>In-depth knowledge of programming paradigms</li><li>Experience with Amazon Web Services or other cloud-based platforms</li><li>Experience with React, Vue or other front-end technologies</li><li>Experience with Node.js, Express.js or other JavaScript-based technologies</li><li>Experience working in an Agile-based project management framework</li><li>Ability to multitask and prioritize</li><li>To possess a high level of attention to detail and aesthetic sensibilities&nbsp;</li><li>Effective communication skills, a positive attitude, and ability to give and receive constructive feedback.</li><li>To contribute to work estimates, prioritization, and alignment with Product Management to ensure projects are well defined</li><li>Able to successfully tackle ambiguous or poorly defined problems, providing technical direction and fostering alignment with the team</li><li>Balance the trade-offs so that you can ship effective solutions that match up with long-term goals and the team’s engineering principles and patterns.</li><li>Experience with Ecommerce environments is a plus.</li><h3>Why Clearer.io? </h3><li><b>Customer-First: </b>Everything we do is for our customers, with real people ready to listen, understand, and help them succeed.</li><li><b>Growth-Focused:</b> We’re not just selling apps—we’re delivering results. We make eCommerce growth easy and intuitive.</li><li><b>Clear and Simple:</b> Our solutions work seamlessly, so you’ll enjoy an environment that’s direct, down-to-earth, and driven by genuine connections.</li><li><b>Supportive Team:</b>You’ll join a diverse team that values collaboration, empowerment, and a shared vision for success.</li><li><b>Clear Benefits:&nbsp;</b>100% Remote Culture: Work from anywhere that brings you happiness</li><li>Performance-based Year-End Bonus: Recognizing and rewarding your individual contributions.</li><li>Wellness Allowance: Support for classes promoting physical and mental health.</li><li>Time Off: 20 days/year, in addition to Vietnam holidays.</li><li>MacBookProvided.</li><li>Collaborative Events: Offline meet-ups, monthly gatherings, year-end parties, and company trips.</li><li>Continuous Learning: Technical and general workshops, online resources.</li><li>Health and Wellness Benefits: Generali Health Care, annual check-up.</li><li>International Exposure: Enhance expertise and English communication skills.</li><div>&nbsp;<b><a rel=\"noopener noreferrer\" class=\"postings-link\" href=\"http://skills.be/\">Be</a> a part of Clearer.io</b>—where your expertise fuels real change in eCommerce. Come and join us- it’s clear we’re the place to be!</div>","tags":"[\"postgres\",\"javascript\",\"management\",\"engineering\"]","pubDate":"2024-12-09T17:12:25.528Z","link":"https://jobs.lever.co/Clearer/856d794f-37c9-4e63-9c20-51a5ea6e72ec","slug":"software-engineer-vietnam-clearer-5498"}]