[{"id":5936598996,"title":"Senior Product Manager","company":"BioRender","image":"https://yt3.googleusercontent.com/8szApiN8P0n8pp0GeXj_z9R4Wh1gJBGW5OJZDocvTtvuCF69U0Q4h2lXDct74mL2_F7vuUwKMA","description":"<p style=\"min-height:1.5em\">At BioRender, our mission is to accelerate the world’s ability to learn, discover, and communicate science. We are passionate about democratizing science communication in order to accelerate scientific discovery and understanding. We're looking for amazing people to help create the world’s go-to-place where science is communicated. Come join us!</p><p style=\"min-height:1.5em\"></p><p style=\"min-height:1.5em\">You can think of BioRender as the “Figma or Canva for scientists,” with a suite of web-based graphics communication products that empower scientists to create beautiful scientific visuals and presentations with ease.</p><p style=\"min-height:1.5em\"></p><p style=\"min-height:1.5em\">As a product manager at BioRender, you will be responsible for leading a team of engineers and designers to build features that millions of scientists all over the world will use to communicate their scientific breakthroughs and discoveries. You will own a specific area of the product based on your skills, interest, and needs of BioRender. </p><p style=\"min-height:1.5em\"></p><p style=\"min-height:1.5em\">Our product team focuses on a few core missions: building tools for the scientist end-user, enabling collaboration for enterprise customers, and a self-service product led growth motion. We’re deeply user obsessed and have a best in class end-user net promoter score (NPS) that we’re very proud of.</p><p style=\"min-height:1.5em\"></p><p style=\"min-height:1.5em\"><strong>What you'll do at BioRender:</strong> </p><ul style=\"min-height:1.5em\"><li><p style=\"min-height:1.5em\">Help us continue to deliver features and products that users love</p></li><li><p style=\"min-height:1.5em\">Drive development, communication, and execution of a vision for a meaningful areaof the product</p></li><li><p style=\"min-height:1.5em\">Own the product roadmap, measurement of success, and operations for your product area</p></li><li><p style=\"min-height:1.5em\">Leverage data from millions of users to proactively assess feature opportunities and solution prioritization </p></li><li><p style=\"min-height:1.5em\">Engage in direct touch points with our users to build the right products and features </p></li><li><p style=\"min-height:1.5em\">Contribute to the team and processes that enable BioRender to be an exceptional product management organization </p></li></ul><p style=\"min-height:1.5em\"></p><p style=\"min-height:1.5em\"><strong>Your background and experiences: </strong></p><ul style=\"min-height:1.5em\"><li><p style=\"min-height:1.5em\">5+ years of product management experience, ideally at a fast growing SaaS startup</p></li><li><p style=\"min-height:1.5em\">Demonstrated ability to lead and influence teams towards an outcome oriented goal</p></li><li><p style=\"min-height:1.5em\">Experience tying together user insights with data to make the most effective product decisions</p></li><li><p style=\"min-height:1.5em\">Excellent written and verbal communication skills </p></li><li><p style=\"min-height:1.5em\">Passion for our mission, vision, and product</p></li></ul><ul style=\"min-height:1.5em\"><li><p style=\"min-height:1.5em\">A background or experience in life sciences is a plus, but not required, however a curiosity and desire to learn about science and scientists is required!</p></li></ul><p style=\"min-height:1.5em\"></p><p style=\"min-height:1.5em\"><strong>Note: </strong>We recognize that career paths vary, and your unique journey may have equipped you with the necessary skills even if you don’t meet all of the criteria above. If you believe you have what it takes to excel in this role, we encourage you to apply!</p><p style=\"min-height:1.5em\"></p><p style=\"min-height:1.5em\"><strong>Why join us?</strong></p><ul style=\"min-height:1.5em\"><li><p style=\"min-height:1.5em\">We are mission-driven, and work collaboratively towards our shared vision of improving scientific communication and accelerating scientific discovery: BioRender figures have appeared in more than 54,000 publications! </p></li><li><p style=\"min-height:1.5em\">It’s a product that users love! We have a world-class NPS and a community of loyal fans. Check out our Testimonials page to see what our customers are saying about us: <a target=\"_blank\" rel=\"noopener noreferrer nofollow\" href=\"https://biorender.com/testimonials/\">https://biorender.com/testimonials/</a> </p></li><li><p style=\"min-height:1.5em\">We are in the top quartile for profitability and year-over-year revenue growth, with users in 200+ countries.</p></li><li><p style=\"min-height:1.5em\">BioRender is an equal opportunity employer, and an inclusive hiring process and work environment is a part of our DNA. </p></li><li><p style=\"min-height:1.5em\">We’re remote-first and have team members across Canada and the United States. A physical office in Toronto is available, but you have the flexibility to work from anywhere. </p></li><li><p style=\"min-height:1.5em\">We’re backed by top investors, accelerators, and some of the most successful life science entrepreneurs and philanthropists in the world including Y Combinator, Malala Fund founders, and Fifty Years VC. </p></li><li><p style=\"min-height:1.5em\">We are committed to building a warm, inclusive, and diverse environment. Check out how we make sure <a target=\"_blank\" rel=\"noopener noreferrer nofollow\" href=\"https://careers.biorender.com/\"><u>our employees come first</u></a>.</p></li></ul><p style=\"min-height:1.5em\"></p><p style=\"min-height:1.5em\">You can read more about the <a target=\"_blank\" rel=\"noopener noreferrer nofollow\" href=\"https://biorender.notion.site/BioRender-Candidate-Resources-8255c155797f442a950720a33b4764d5\"><u>BioRender interview process and FAQs here</u></a>!</p>","tags":"[\"management\"]","pubDate":"2024-08-08 08:33:53.845","link":"https://jobs.ashbyhq.com/biorender/a80b2471-711d-45cb-82fc-787051047cc8","savedDate":"2024-08-08 08:33:53.845","slug":"senior-product-manager-biorender-4171"},{"id":9964583849,"title":"SDET / QA Automation Engineer for ELS","company":"CloudLinux","image":"https://pbs.twimg.com/profile_images/696718028084482050/ymY3OEPk_400x400.png","description":"<p></p><p>We are looking for a <strong>SDET / QA Automation Engineer</strong> to join our Extended Lifecycle Support team. The ideal candidate should possess more than just technical expertise; they should have an unwavering commitment to quality and a deep passion for Python. We're looking for someone who not only writes Python code but also lives and breathes it. This candidate should think in Python, excel in Python, and communicate in Python. If you are excited about pushing the boundaries of QA engineering with your Python prowess, we encourage you to apply.</p><p>Extended Lifecycle Support (ELS) enables organizations to continue securely using Linux distributions and software languages that have reached the end of life or no longer receive standard security support – delivering vulnerability patches for unsupported versions of CentOS, CentOS Stream, Ubuntu, Debian, Oracle Linux, PHP, Python, and Spring software development framework.</p><p>Work is fully remote, with flexible hours, where you can plan your day and work from anywhere in the world.</p><p>More details about the project you can find on the product website TuxCare.com, about the company on Cloudlinux.com</p><p><strong>As our SDET / QA Automation Engineer you will:</strong></p><ul> <li>Diagnose, isolate, and implement remedies for package failures caused by errors in our updates.</li> <li>Prepare all needed documentation sets clarifying all the aspects of the product’s environment</li> <li>Add new automated test scenarios (Python), maintaining continuous test execution (Jenkins), tracking test cycles execution results, recommending corrective actions, and working with the development engineers on resolution of problems</li> <li>Maintain and modify test environment and configuration as needed, create new test environments and configurations to meet customer-based configuration or problem reproducing requirements</li> <li>Continue to expand test automation within ELS continuous integration (CI) and continuous deployment (CD) environments</li> <li>Collaborate with c and python engineers</li> </ul><h3>Requirements: </h3><p><strong>To be successful you should have:</strong></p><ul> <li>You should speak Python, breathe Python, and think Python</li> <li>Bachelor’s degree in computer science, software engineering, or a similar field</li> <li>3+ years of experience in QA Automation (experience only in UI and/or API automation isn’t relevant for us)</li> <li>6+ years in QA</li> <li>Experience and the passion for Linux. Fluent in Linux CLI is a must!</li> <li>Strong shell scripting knowledge.</li> <li>In-depth knowledge of Python (we use 2.7 mostly) programming language is a must!</li> <li>Proficiency in object-oriented programming with Python</li> <li>Knowledge of Ansible, Docker</li> <li>Understanding of CI/CD systems, tools and approaches</li> <li>Experience in creation of Jenkins scripted/declarative pipelines</li> <li>Good understanding of DevOps principles and their relation to automation engineering</li> <li>Ability to work well with culturally diverse teams</li> <li>Proven ability to communicate well with peers and all levels of management</li> <li>Intermediate (and higher) English level</li> <li>Team player but also able to work independently using your initiative</li> <li>Happy in an agile, fast-paced environment</li> </ul><p></p><h3>Benefits: </h3><p><strong>What's in it for you?</strong></p><ul> <li>A focus on professional development; </li> <li>Interesting and challenging projects</li> <li>Flexible working hours</li> <li>Paid one month vacation per year and unlimited sick leave</li> <li>Medical insurance reimbursement</li> <li>Co-working and gym/sports reimbursement</li> <li>The opportunity to receive a reward for the most innovative idea that the company can patent</li> </ul><p><em>By applying for this position, you agree with </em><a href=\"https://cloudlinux.com/privacy-policy\" rel=\"nofollow noreferrer noopener\" class=\"external\"><em>Cloudlinux Privacy Policy</em></a><em> and give us your consent to maintain and process your personal data with this respect. Please read our Privacy Policy for more information.</em></p>","tags":"[\"management\",\"engineering\"]","pubDate":"2024-08-08 00:00:00.000","link":"https://apply.workable.com/cloudlinux-1/j/E53CB6FD56","savedDate":"2024-08-08 08:33:53.844","slug":"sdet-qa-automation-engineer-for-els-cloudlinux-884"},{"id":9395290640,"title":"PHP Security Developer/Researcher Remote - work anywhere","company":"CloudLinux","image":"https://pbs.twimg.com/profile_images/696718028084482050/ymY3OEPk_400x400.png","description":"<p>Imunify360 Security Suite is a product of CloudLinux Inc., the maker of the #1 OS in security and stability for hosting providers. Imunify is an innovative security solution designed specifically for shared and VPS/Dedicated servers. The automated, easy-to-use solution with the six-layer approach to security delivers comprehensive and complete attack prevention.</p><p>As our PHP Security Developer/Researcher, you'll be joining our dedicated research team which delivers an important part of our product: security patches. The Research team is directly responsible for analyzing vulnerabilities/threats and fix them.</p><p>As a security Developer/Researcher, you play a critical role in the organization. You will have full autonomy and responsibility in analyzing new threats (security vulnerabilities and malware) and resolving them for our customers. You will also be responsible for increasing our coverage of supported PHP applications and plugins.</p><p>Your work directly impacts the safety and workings of millions of websites around the world, so attention to detail and a high quality work standard are extremely important skills that we’re looking for. </p><p><strong>As our PHP Security Developer/Researcher, you will;<br></strong></p><ul> <li>Analyze new security vulnerabilities in open source PHP applications (such as WordPress, Joomla and Drupal) and backport upstream patches to fix those vulnerabilities in earlier versions.</li> <li>Design, build and deploy new features for our internal tooling to automate our workflows.</li> <li>Research and analyze new trends in exploitation techniques, malware approaches, etc. and develop strategies to mitigate them.</li> <li>Expand coverage of supported applications and plugins.</li> </ul><h3>Requirements: </h3><p><strong>To be successful you should have;</strong></p><ul> <li>Advanced proficiency with PHP scripting language; </li> <li>Several years of relevant work experience as a Software Tester Engineer or similar role.</li> <li>Understanding and knowledge of security vulnerabilities in web applications is a plus.</li> <li>Fluent English speaker.</li> <li>You have a true passion for the security field.</li> <li>Self-driven work ethic. You love taking initiative and seeing things through to completion.</li> <li>Passion for continuous learning. </li> </ul><h3>Benefits: </h3><p><strong>What's in it for you?</strong></p><ul> <li>A focus on professional development.</li> <li>Interesting and challenging projects.</li> <li>Fully remote work with flexible hours, allowing you to schedule your day and work from any location worldwide.</li> <li>Paid one month of vacation per year and unlimited sick leave.</li> <li>Medical insurance reimbursement.</li> <li>Co-working and gym/sports reimbursement.</li> <li>The opportunity to receive a reward for the most innovative idea that the company can patent.</li> </ul><p></p><p><em>By applying for this position, you agree with </em><a href=\"https://cloudlinux.com/privacy-policy\" rel=\"nofollow noreferrer noopener\" class=\"external\"><em>Cloudlinux Privacy Policy</em></a><em> and give us your consent to maintain and process your personal data with this respect. Please read our Privacy Policy for more information.</em></p>","tags":"[]","pubDate":"2024-08-08 00:00:00.000","link":"https://apply.workable.com/cloudlinux-1/j/7E7A8B12E1","savedDate":"2024-08-08 08:33:53.845","slug":"php-security-developer-researcher-remote-work-anywhere-cloudlinux-3003"},{"id":2834087223,"title":"Account Executive","company":"Backflip","image":"https://media.licdn.com/dms/image/D560BAQH1_SFy5Vwlhg/company-logo_200_200/0/1686838667749?e=2147483647&v=beta&t=vjEnSv9MgRj3-PLOfPnBySXxJkFKZF1SkMxzVFcxr8c","description":"<div><b>Join a fast growing start up changing the real estate investing industry!&nbsp;</b></div><div><br></div><div>Backflip is a venture-backed <b>FinTech</b> company that <b>empowers anyone to improve their life and their neighborhood through real estate investing</b>. To do that, we need people who are inspired to reimagine and rebuild an outdated and unbalanced system; to support and celebrate America’s local entrepreneurs. <a href=\"https://backflip.app.link/hdYmZF9JwLb\" class=\"postings-link\">Check out the Backflip app here to experience first hand how we're making a difference through our technology.</a></div><div><br></div><div>Backflip is seeking a dynamic&nbsp;<i><b>Account Executive</b></i>&nbsp;to drive growth and customer success within our financing business. This role combines sales and customer relationship management to acquire new investors, guide them through the loan process, and foster long-term partnerships. The ideal candidate possesses a proven track record in sales and a passion for delivering exceptional customer experiences.</div><div><br></div><div>This position is remote (U.S.) and a rare opportunity to get in on the ground floor (~60 person team) working directly with senior leaders in a well-capitalized startup with a great culture (<a href=\"https://techcrunch.com/2024/04/29/backflip-raises-15-million-to-help-real-estate-investors-flip-houses/?guccounter=1&amp;guce_referrer=aHR0cHM6Ly93d3cuZ29vZ2xlLmNvbS8&amp;guce_referrer_sig=AQAAABk3K7EzQ-RsoX2uq_YCeKN3dCJPqN1FsdwJFbmB30YwsTXb2qogu-d0mtoA_sfc9ZWtyzGW04VxvOa9iDbHgMqyiLHq5hahjz5Ym4hQ6WtWy-OfMFEBck0bSanRkxZg89Eme5WfG-lXEOjuecZ1mCfDE9DCAFFL8feoIKJ8RlsQ\" class=\"postings-link\">Check out our recently announced $15M Series A</a>).</div><div><br></div><div><b>This position is open to candidates residing in all states except for CA, UT, OR, ID, NV, ND, SD, and VT.</b></div><div><b>Join a fast growing start up changing the real estate investing industry!&nbsp;</b></div><div><br></div><div>Backflip is a venture-backed <b>FinTech</b> company that <b>empowers anyone to improve their life and their neighborhood through real estate investing</b>. To do that, we need people who are inspired to reimagine and rebuild an outdated and unbalanced system; to support and celebrate America’s local entrepreneurs. <a href=\"https://backflip.app.link/hdYmZF9JwLb\" class=\"postings-link\" target=\"_blank\" rel=\"noopener noreferrer\">Check out the Backflip app here to experience first hand how we're making a difference through our technology.</a></div><div><br></div><div>Backflip is seeking a dynamic&nbsp;<i><b>Account Executive</b></i>&nbsp;to drive growth and customer success within our financing business. This role combines sales and customer relationship management to acquire new investors, guide them through the loan process, and foster long-term partnerships. The ideal candidate possesses a proven track record in sales and a passion for delivering exceptional customer experiences.</div><div><br></div><div>This position is remote (U.S.) and a rare opportunity to get in on the ground floor (~60 person team) working directly with senior leaders in a well-capitalized startup with a great culture (<a href=\"https://techcrunch.com/2024/04/29/backflip-raises-15-million-to-help-real-estate-investors-flip-houses/?guccounter=1&amp;guce_referrer=aHR0cHM6Ly93d3cuZ29vZ2xlLmNvbS8&amp;guce_referrer_sig=AQAAABk3K7EzQ-RsoX2uq_YCeKN3dCJPqN1FsdwJFbmB30YwsTXb2qogu-d0mtoA_sfc9ZWtyzGW04VxvOa9iDbHgMqyiLHq5hahjz5Ym4hQ6WtWy-OfMFEBck0bSanRkxZg89Eme5WfG-lXEOjuecZ1mCfDE9DCAFFL8feoIKJ8RlsQ\" class=\"postings-link\" target=\"_blank\" rel=\"noopener noreferrer\">Check out our recently announced $15M Series A</a>).</div><div><br></div><div><b>This position is open to candidates residing in all states except for CA, UT, OR, ID, NV, ND, SD, and VT.</b></div><div><br></div><h3>What You’ll Do:</h3><li>Identify, recruit, and onboard high-quality Single-Family Residential (SFR) real estate investors for Backflip's investment financing products</li><li>Introduce investors to Backflip's mobile app and community, fostering long-term relationships</li><li>Drive new user acquisition through online outreach, events, and referrals</li><li>Qualify and convert high quality loan applicants into borrowers; build the relationship and nurture them into repeat borrowers</li><li>Provide exceptional customer service through various communication channels, including in-person, phone, email, and text</li><li>Maintain accurate and complete records of customer interactions and loan applications in Backflip's CRM (HubSpot)</li><li>Consistently meet and exceed sales quotas</li><li>Represent Backflip at industry events and networking opportunities, mostly locally with travel 1-2x / quarter</li><h3>Qualifications:</h3><li>3+ years of experience in sales, lending, or real estate focused on single-family residential investors</li><li>Demonstrated success in building and managing a robust sales pipeline and/or account management or customer success book</li><li>Experience representing a company at industry events and conferences</li><li>Strong aptitude for utilizing CRM and sales technology tools</li><li>Thrives in a fast-paced, remote work environment with a high degree of autonomy and flexibility</li><li>Self-motivated, results-oriented, and collaborative team player with a strong work ethic and commitment to integrity</li><li>Passionate about Backflip's mission and eager to contribute to the company's growth and success</li><h3>This candidate will champion Backflip’s culture & Core Values:</h3><li><b>Raise</b> the standard of what is possible</li><li><b>Embrace</b> being the novice to become the master</li><li><b>Work</b> only with those who want the best for us</li><li><b>Communicate</b> quickly, naturally and with radical candor</li><li><b>Test</b> new things to invent and challenge the status quo</li><li>Today, nay <b>now</b>!</li><div><i style=\"font-size: 14.6667px\">Compensation for this role includes a base salary of $85,000 plus annual expected commissions of $120,000, for a total on-target earnings (OTE) of $205,000, and is based on a variety of factors including prior experience, geographic location, stock option grant, and other factors, and may fall outside of the stated range for certain candidates. In addition to a competitive market salary, Backflip employees receive equity stock options, paid health care, and a 401K + company match, among other industry-leading benefits.</i></div><div><br></div><div><i style=\"font-size: 11pt\">All Backflip positions are Remote. Like the people we serve, we believe being free to create wherever you’re most inspired is one of life’s greatest joys. It’s better for individuals, for community, and for fostering great work to emerge. With our work-from-anywhere approach, Backflip brings together a diverse team of individuals, with passions for innovation, art, coding, AI, data, finance, film, real estate, the environment, learning and teaching. Together, we're moving fast.</i></div><div><br></div><div><i style=\"font-size: 11pt\">Backflip is an equal opportunity employer. We know that building a world-class organization is not possible without an intentional focus on recruiting, empowering, promoting and rewarding the best and brightest people of all backgrounds. Backflip focuses on hiring individuals that align with its Core Values (listed above), and consistently display a high ethical standard, both personally and professionally.</i></div><div><br></div><div><i style=\"font-size: 11pt\">This role is not eligible for visa sponsorship.</i></div>","tags":"[\"Finance\",\"management\"]","pubDate":"2024-08-07 19:58:10.312","link":"https://jobs.lever.co/backflip/6e542319-b061-448c-af13-b05183185ef0","savedDate":"2024-08-08 08:33:53.846","slug":"account-executive-backflip-7963"},{"id":5857273863,"title":"Junior QA Specialist","company":"Scandiweb","image":"https://remotive.com/job/1927479/logo","description":"<div><!--block--><em>For every person joining us for any entry-level position, there is a path and an opportunity to reach an executive role and become a company partner </em></div><div><!--block--><br></div><div><!--block--><strong>Antons Sapriko, Company Founder</strong><br>__<br><br>Video stories of colleagues who joined as Junior QA Specialists:<br><br><strong>Ilona Smatko, from a Junior QA to a QA Community Lead. Latvia.</strong><strong><span>﻿</span><figure class=\"attachment attachment--content\"><div></div><figcaption class=\"attachment__caption\"></figcaption></figure><span>﻿</span></strong></div><div><!--block--><strong>Eleonora Grigane, from a Junior QA to an expert QA. Latvia.</strong><strong><span>﻿</span><figure class=\"attachment attachment--content\"><div></div><figcaption class=\"attachment__caption\"></figcaption></figure><span>﻿</span></strong><strong>Aleksandrss Panass, from an Intern to a QA expert. Latvia.</strong><strong><span>﻿</span><figure class=\"attachment attachment--content\"><div></div><figcaption class=\"attachment__caption\"></figcaption></figure><span>﻿</span></strong></div><br><br><div class=\"h3\">How to become a Junior QA Specialist at scandiweb eCommerce expert team?</div><div><!--block-->We are a very inclusive company with colleagues across 30+ countries on all continents with the female developer ratio being among the highest in the industry. We welcome people from different paths of life, who can complete a technical test, which consists of a testing challenge. <br><br>The test does not require you to have previous QA experience, instead, it focuses on aspects like checking your attention to detail and ability to use common sense and bringing structure to a complex environment. You have the opportunity to look holistically at a project and to perform various actions that are reflective of actual QA work in Scandiweb. We also test your capability to learn during the test as we will share educational materials for some of the tasks.<br><br></div><div><!--block-->Everybody who completes the test is invited to a technical interview with a 90% chance to be employed. We are confident that if you can complete the entry-level test and successfully pass the Practical Trial Day task, you have the necessary background to let us guide you further on the path to engineering expertise and enterprise-level delivery. </div><div><!--block--><br></div><div><!--block-->Your previous experience and education do not matter; what matters is your ability to deliver results starting from the test task, and your enthusiasm and openness to embrace new knowledge and processes. You can even fail the test and redo it; we will provide you with feedback and will appreciate your ability to act on it to improve and pass. Continuous learning and acting on feedback are among our core organizational values.</div><br><br><div class=\"h3\">What are the responsibilities of a Junior QA Specialist?</div><div><!--block-->Once you start your career at scandiweb, your first responsibility is to complete onboarding in the company, setting you up in all the processes and systems. This process is set forth in our Learning System and you will be supported by an HR member of our team. </div><div><!--block--><br></div><div><!--block-->Your next responsibility is to complete the Starter Training Course to ensure that you can join a commercial project with a minimum necessary knowledge of the workflow and quality requirements. </div><div><!--block--><br>Once you start your active work in the role of Junior QA Specialist, your responsibilities will include:</div><ul style=\"\"><li style=\"\"><!--block-->Revising your active pipeline of the tasks, discussing them at Daily Standup making sure tasks are clear for you and nothing blocks you from delivering;</li><li style=\"\"><!--block-->Participating in Daily Standups with the team is crucial for understanding the project's direction, its current status, the completion of tasks, and ensuring there are no pending bugs as we enter the UAT period;</li><li style=\"\"><!--block-->Understanding the tasks, functional, and business scope not only ensures that the project is pixel-perfect and all required features are functioning correctly but also ensure that the tasks work together with the solution components;</li><li style=\"\"><!--block-->Creating test cases before starting work allows the developer assigned to the task to have a better chance of success by following your test cases. This ensures that the necessary functionality and integration for the feature are covered within the project;</li><li style=\"\"><!--block-->Identifying issues and errors on a project and reporting them following internal company quality guidelines;</li><li style=\"\"><!--block-->Performing manual quality assurance using tools, like, Browserstack, DevTools, TestLodge, Lightshot, Loom, and others;</li><li style=\"\"><!--block-->Performing various forms of manual testing: cross-browser, smoke tests, cross-device testing for different back-end and front-end scenarios, regression testing, and in some cases performance or stability testing;</li><li style=\"\"><!--block-->Applying company quality standards and practices to ensure optimum project quality and delivery;</li><li style=\"\"><!--block-->Providing daily status updates on your work and reflecting your delivery in commit messages, task comments, and time logs to facilitate transparency and teamwork;</li><li style=\"\"><!--block-->Cooperating with internal and external stakeholders in your tasks: developers, project managers, and clients;</li><li style=\"\"><!--block-->Upgrading existing competencies by taking part in relevant certification processes organized by the company.</li></ul><div><!--block--><strong>Further career growth for Junior QA Specialist<br></strong><br></div><div><!--block-->You will get support in career counseling from our HR department as each career path is unique taking into account your personal strengths and ambitions. <br><br></div><div><!--block-->A successful Junior QA usually becomes an independent QA within a year, further advancing to either a Senior manual QA or a Junior Project manager within the next 1-2 years by mastering the technological, communication, and business context of their work.<br><br></div><div><!--block-->Further steps from an independent QA role will depend on your preferences for growth and impact on the company. In the next 1-2 years you can become either a QA lead in and take ownership of the quality assurance processes in scandiweb or pursue the exciting role of Project Management. <br><br>Project Manager roles ultimately culminate in Delivery Manager and Partner positions in another 2-5 years, where you take strategic ownership over the delivery of multiple projects in your portfolio by guiding responsible Project Managers and teams ensuring good project vitals, focusing on expanding cooperation and building relations with existing and new clients.<br><br><strong>What will help you to advance in your career starting as Junior QA Specialist?</strong></div><ul style=\"\"><li style=\"\"><!--block-->Deepening your knowledge of libraries, frameworks, and platforms that are necessary for a successful delivery for customers;</li><li style=\"\"><!--block-->Understanding your success KPIs that we will share with you and setting the goals to improve them;</li><li style=\"\"><!--block-->Ability to speak up and proactively ask questions about your work, seek clarification for your tasks, and support and guidance from your senior colleagues;</li><li style=\"\"><!--block-->Ability to integrate the use of various performance optimization tools in your learning and delivery;</li><li style=\"\"><!--block-->Following the Continuous Learning process passing suggested courses internally and obtaining valuable external credentials such as globally recognized certifications that the company will arrange for you;</li><li style=\"\"><!--block-->Participating in company-organized events to foster collaboration both online and offline.</li></ul><br><br><div class=\"h3\">What is the compensation package of a Junior QA Specialist at scandiweb?</div><ul style=\"\"><li style=\"\"><!--block-->Competitive starting salary relative to the market;</li><li style=\"\"><!--block-->Salary revisions and upgrades that happen twice a year;</li><li style=\"\"><!--block-->Growth path to become an Engineer, Senior Engineer, Team Lead, and Partner </li><li style=\"\"><!--block-->Support for hardware upgrades;</li><li style=\"\"><!--block-->Core health insurance coverage and sports bonuses;</li><li style=\"\"><!--block-->A diverse multinational team of experts to learn from;</li><li style=\"\"><!--block-->Best tools for collaboration, coding, quality assurance, and communication;</li><li style=\"\"><!--block-->Company-covered training and certification;</li><li style=\"\"><!--block-->Legendary online and onsite events to celebrate our success together.</li></ul><div><!--block--><br><strong>Next steps</strong></div><ul style=\"\"><li style=\"\"><!--block-->Apply and fill in the application form</li><li style=\"\"><!--block-->Receive the test task and complete it.</li></ul><div><!--block--><br><strong>Here is what people who joined as Junior QA Specialists want to share with you:</strong></div><div><!--block--><br></div><div><!--block--><em>“I joined scandiweb 3 years ago, and since then I have grown from a Junior QA to a QA Community Lead. When I started my journey with scandiweb, I was surprised that the company provides education before joining a real project. My first project was simple but my biggest challenge was when I was an API QA for a very complex project. With the little experience I had but with the massive support of the team, the project was a success.”</em></div><div><!--block--><strong>Ilona Smatko, QA Specialist from Latvia. Joined the company on 28/4/2021</strong></div><div><!--block--><br></div><div><!--block--><em>“The most significant lesson from my early days at scandiweb – which continues to inspire my approach – is the power of curiosity and adaptability. No challenge is too big and there is always a solution waiting to be discovered. This mindset has driven my career and is a constant in my day-to-day responsibilities.<br></em><br></div><div><!--block--><em>At scandiweb, we can count on experts from various fields, enthusiasts about technology, and sharing knowledge, they are true Magento magicians spread across the world. This culture of collaboration and international contact was essential for me to grow quickly, evolving from a beginner to a Quality Assurance Specialist. Looking back, the Stephani of the past would be surprised at how much I've grown – not just in my career, but also on a personal level.”<br></em><strong>Stephani Soares, QA Specialist from Brazil. Joined the company on 6/4/2023 </strong></div><div><!--block--><br></div><div><!--block--><em>“Joining scandiweb as a Junior QA was a major turning point in my career. From the beginning, the training prepared me to tackle any project.<br></em><br></div><div><!--block--><em>At scandiweb, the team focus is on lifting each other up, which has empowered me to confidently face every challenge. This isn't just my workplace—it's where I've grown.”</em></div><div><!--block--><strong>Ajla Hasic, QA Specialist from Bosnia and Herzegovina. Joined the company on 6/2/2023</strong></div><img src=\"https://remotive.com/job/track/1927479/blank.gif?source=public_api\" alt=\"\"/>","tags":"[\"manual testing\"]","pubDate":"2024-08-07 01:20:35.000","link":"https://remotive.com/remote-jobs/qa/junior-qa-specialist-1927479","savedDate":"2024-08-08 08:33:53.839","slug":"junior-qa-specialist-scandiweb-431"},{"id":7497531288,"title":"System Analyst/Coordinator (worldwide remote, work anywhere)","company":"CloudLinux","image":"https://pbs.twimg.com/profile_images/696718028084482050/ymY3OEPk_400x400.png","description":"<p><a href=\"https://tuxcare.com/\" rel=\"nofollow noreferrer noopener\" class=\"external\">TuxCare </a>provides industry-leading enterprise-level support and security services for Linux systems, focusing on live patching, compliance management, and extended lifecycle support. Our flagship product, <a href=\"https://docs.tuxcare.com/live-patching-services/#kernelcare-simplepatch\" rel=\"nofollow noreferrer noopener\" class=\"external\">KernelCare</a>, offers seamless, reboot-free kernel updates that ensure maximum system uptime and security. Supporting a wide range of Linux distributions and architectures, TuxCare delivers timely patches for critical vulnerabilities, significantly reducing the risk of exploitation. Our solutions are trusted by global enterprises to maintain secure, compliant, and high-performing IT environments without the need for disruptive maintenance windows.</p><p></p><p><strong>The System Analyst will focus </strong>on service data analysis and the prioritization of client requests and issues, ensuring they are addressed accordingly. This role supports team leaders and senior leadership by providing data-driven insights and ensuring the effective resolution of client-related issues. Additionally, the role offers opportunities to assist with other routines and initiatives and as they arise, allowing you to contribute to the team in various impactful ways. </p><p></p><p><strong>Primary Job Responsibilities:</strong></p><ul> <li>Track key service metrics and address anomalies to mitigate client impact.</li> <li>Analyze customer feedback and data from various sources to identify trends and areas for improvement.</li> <li>Collaborate with development teams and other stakeholders to ensure client priorities are addressed.</li> <li>Work closely with the KC Group Lead, Product Manager, and Support 3.5 Team Lead to prioritize and resolve blockers.</li> <li>Provide reports on service performance, including overall throughput, speed, quality, and availability.</li> <li>Serve as a contact point for senior leadership and sales on client-related issues.</li> <li>Propose and take part in implementing ideas for improving prioritization, operational efficiency, and customer care processes.</li> <li>Actively contribute to OKRs brainstorming by providing insights from data and customer feedback.</li> <li>Maintain awareness of TuxCare services, including KernelCare, LibCare, and Extended Lifecycle Support (ELS) to understand clients’ problems and needs deeply.</li> </ul><h3>Requirements: </h3><ul> <li>Bachelor’s degree in Computer Science, Information Technology, Data Science or a related field.</li> <li>3+ years of experience in system analysis or data analysis.</li> <li>Strong analytical and problem-solving skills. </li> <li>Ability to effectively manage and prioritize tasks according to importance and urgency and handle a large amount of collaboration in a Agile, remote and async environment.</li> <li>A self-starter with a “can-do” attitude, but also a team player willing to go above and beyond standard job responsibilities.</li> <li>Strong communication skills, proficient in English for conference calls, messengers and documentation. </li> <li>Proactive in continuous learning to fill gaps in domain knowledge. </li> <li>Emotionally intelligent with balanced thinking towards client needs and engineering capabilities.<br> </li> </ul><p><strong>Nice-to-Have</strong></p><ul> <li>Previous experience in a SaaS-based product environment.</li> <li>Experience working in remote, distributes teams.</li> <li>Experience in data analysis, manipulations and visualization tools and techniques. </li> <li>Experience in contributing to OKRs brainstorming and strategic decision-making.<br> </li> </ul><p>We welcome candidates from diverse professional backgrounds for this position,  as long as you have previous experience involving system thinking and a strong analytical mindset.</p><h3>Benefits: </h3><p><strong>What's in it for you?</strong></p><ul> <li>A strong focus on professional development with opportunities for learning and growth.</li> <li>Engage in interesting and challenging initiatives that push your technical and analytical skills.</li> <li>Regular interaction with senior leadership, providing insights into strategic decision-making.</li> <li>Fully remote work with flexible hours, allowing you to schedule your day and work from any location worldwide.</li> <li>Paid one-month vacation per year and unlimited sick leave to ensure you maintain a healthy work-life balance.</li> <li>Medical insurance reimbursement to support your health needs.</li> <li>Co-working and gym/sports reimbursement to encourage a healthy and active lifestyle.</li> <li>The opportunity to receive a reward for the most innovative idea that the company can patent, fostering a culture of creativity and innovation.</li> </ul><p></p><p><em>By applying for this position, you agree with </em><a href=\"https://cloudlinux.com/privacy-policy\" rel=\"nofollow noreferrer noopener\" class=\"external\">Cloudlinux Privacy Policy</a><a href=\"https://cloudlinux.com/privacy-policy\" target=\"_blank\" rel=\"nofollow noreferrer noopener\" class=\"external\"></a><em> and give us your consent to maintain and process your personal data with this respect. Please read our Privacy Policy for more information.</em></p>","tags":"[\"management\",\"engineering\"]","pubDate":"2024-08-07 00:00:00.000","link":"https://apply.workable.com/cloudlinux-1/j/4810F5F3AE","savedDate":"2024-08-08 08:33:53.845","slug":"system-analyst-coordinator-worldwide-remote-work-anywhere-cloudlinux-5128"},{"id":1545006851,"title":"Senior Python Developer for Imunify - REMOTE/ Work Anywhere","company":"CloudLinux","image":"https://pbs.twimg.com/profile_images/696718028084482050/ymY3OEPk_400x400.png","description":"<p>We are in search of a highly skilled and experienced Senior Python Developer to be a part of our Imunify team. Join us on our exciting journey as we revolutionize the security landscape for Linux web servers with the power of Artificial Intelligence. Imunify Security, our innovative security solution, boasts a comprehensive six-layer approach, ensuring foolproof protection for shared and VPS/Dedicated servers.</p><p>As a Senior Python Developer Engineer, you will have two main focuses. Firstly, you will work on the development of web-facing applications that our employees, customers, and their end-users rely on. Secondly, you will handle the internal back-end services responsible for processing, analyzing, and acting upon the scan data submitted by our agent software on customers' web hosting servers. The component you will take responsibility of is offered as SaaS and is delivered from our own centralized infrastructure. This role is incredibly demanding and intriguing, given the scalability challenges and sensitive nature of the data we deal with. A thorough understanding of Python, message queues, large data sets, and security is crucial. Your work directly impacts the safety and functionality of millions of websites worldwide, so attention to detail and a high quality standard are paramount.</p><p></p><p><strong>What you'll be doing:</strong></p><ul> <li>Assume technical ownership of one of the Imunify360 components.</li> <li>Design, build, and deploy new features for our web-facing applications and back-end services.</li> <li>Continuously review and enhance architecture to ensure scalability as we experience remarkable growth.</li> <li>Prioritize the secure storage of sensitive data at all times through ongoing architectural improvements.</li> <li>Play an active role in architecture discussions and create comprehensive technical documents.</li> <li>Investigate reported issues from clients, partners, or our support team.</li> </ul><p></p><h3>Requirements: </h3><h3>Qualifications that make you a good fit:</h3><ul> <li>You've accumulated several years of relevant work experience as a Software Engineer.</li> <li>You have an undeniable passion for the security field.</li> <li>You possess web programming skills, especially with the Django framework.</li> <li>Experience in Linux server administration is a plus.</li> <li>Knowledge of automated testing and CI/CD systems is a plus.</li> <li>An intermediate level of English language proficiency.</li> </ul><h3>Personal skills we value:</h3><ul> <li>You are a fast learner and proactive in your approach.</li> <li>You are highly self-motivated and committed to achieving milestones.</li> <li>You excel at prioritization and embrace a flexible mindset.</li> <li>You have the ability to independently analyze tasks and find optimal solutions.</li> <li>You thrive in working with vague requirements and making independent decisions.</li> <li>You are a team player who can collaborate effectively.</li> </ul><h3>Benefits: </h3><p><strong>What's in it for you?</strong></p><ul> <li>A focus on professional development; </li> <li>Interesting and challenging projects</li> <li> Flexible working hours</li> <li>Paid one month vacation per year and unlimited sick leave</li> <li>Medical insurance reimbursement</li> <li>Co-working and gym/sports reimbursement</li> <li>The opportunity to receive a reward for the most innovative idea that the company can patent</li> </ul><p><em>By applying for this position, you agree with </em><a href=\"https://cloudlinux.com/privacy-policy\" rel=\"nofollow noreferrer noopener\" class=\"external\"><em>Cloudlinux Privacy Policy</em></a><em> and give us your consent to maintain and process your personal data with this respect. Please read our Privacy Policy for more information.</em></p>","tags":"[]","pubDate":"2024-08-07 00:00:00.000","link":"https://apply.workable.com/cloudlinux-1/j/1C4B723727","savedDate":"2024-08-08 08:33:53.845","slug":"senior-python-developer-for-imunify-remote-work-anywhere-cloudlinux-3281"},{"id":6133018819,"title":"DevOps Engineer","company":"DoraHacks","image":"https://remotive.com/job/1928411/logo","description":"<div><strong>All positions of Dora team are fully remote for this moment.</strong></div>\n<div> </div>\n<div><strong>Contact us </strong></div>\n<div>Recruiting@dorahacks.com</div>\n<div> </div>\n<div> Please note that the position is open to applicants from any location.</div>\n<p><br><br></p>\n<div class=\"h3\">Responsibility</div>\n<ul style=\"\">\n<li style=\"\">Familiar with AWS Cloud setup and troubleshooting, and responsible for website maintenance</li>\n<li style=\"\">Website configuring, operation, maintaining backup, infrastructure integration, monitoring, alerting system setup in a rountined manner</li>\n<li style=\"\">Analyze, solve, and correct issues in real time (configure and maintain database servers and processes, monitor system’s health and performance, ensure high level of performance, security, effectiveness, availability, and sustainability)</li>\n<li style=\"\">Develop and maintain up-to-date architectural templates, build an operational documentation of the technical environment</li>\n<li style=\"\">Assist developers with query tuning and schema refinement</li>\n<li style=\"\">Provide support for critical production systems</li>\n<li style=\"\">Continuously explore and research new operations, maintenance technology, operational tools to improve the enterprise Hybrid cloud</li>\n</ul>\n<p><br><br></p>\n<div class=\"h3\">Qualification</div>\n<ul style=\"\">\n<li style=\"\">Computer related majors, have a strong interest in security and DevOps, and have 3 years+ related experience in cloud operation and maintenance</li>\n<li style=\"\">Above 2 years working experience in DevOps Engineer role</li>\n<li style=\"\">Familiar with AWS products, including but not limited to ECS, ELB, RDS, IAM, network and security related services</li>\n<li style=\"\">Familiar with Linux system, proficient in at least one language such as Python/Golang, and have experience in automation tool design, development and integration</li>\n<li style=\"\">Familiar with container technology and container orchestration tools, able to use eks is preferred</li>\n<li style=\"\">Participated in the construction and maintenance of at least one cloud infrastructure, and those with Alibaba Cloud and AWS cloud service certificates are preferred</li>\n<li style=\"\">Proficient in a back-end development language, able to develop basic web services and simple management pages. Better experience in building monitoring tools </li>\n<li style=\"\">Mandarin proficiency in reading and writing and good communication ability is not a must but a plus</li>\n</ul>\n<p><br><br></p>\n<div class=\"h3\">Recruiting Process</div>\n<ul style=\"\">\n<li style=\"\">Test 1: You may be required to complete an online test or a take-home assignment to assess your skills relevant to the position</li>\n<li style=\"\">Recruiter Call: A brief 15-30 minute discussion to go over your background and the role</li>\n<li style=\"\">Test 2: You may be required to complete an online test or a take-home assignment to assess your skills relevant to the position</li>\n<li style=\"\">Team Interview: A more in-depth session lasting 45-60 minutes with the team you'll be working with, focusing on your technical skills and team fit</li>\n<li style=\"\">Final Interview: A concluding interview of approximately 45 minutes that may involve higher-level management or final decision makers</li>\n<li style=\"\">All interviews will be conducted via Zoom or Google Meeting, accommodating a fully remote recruitment process to best suit candidates globally</li>\n</ul>\n<div> </div>\n<div> </div>\n<div>DoraHacks is a global hackathon organizer and one of the world's most active developer incentive platforms. It creates a global hacker movement in blockchain, quantum computing and space tech, and provides a wide range of toolkits to help developers around the world team up and fund their ideas and BUIDLs via hackathons, bounties, grants, idea networks, developer games and more.</div>\n<div> </div>\n<div>By far, more than 8500 startup teams from the DoraHacks community have received over $40 million in grants and other forms of contributions from supporters worldwide. A large number of open source communities, companies and blockchain ecosystems are actively using Dora's infrastructure (<a class=\"postings-link\" href=\"http://dorahacks.io\" rel=\"nofollow\">http://dorahacks.io</a>) for open source funding and community governance.</div>\n<div> </div>\n<div><strong>For More Info</strong></div>\n<div>Please visit our <a class=\"postings-link\" href=\"https://dorahacks.io/\" rel=\"nofollow\">Website</a>｜<a class=\"postings-link\" href=\"https://www.linkedin.com/company/dorahacks/\" rel=\"nofollow\">LinkedIn</a>｜<a class=\"postings-link\" href=\"https://twitter.com/DoraHacks\" rel=\"nofollow\">Twitter</a>｜ <a class=\"postings-link\" href=\"https://doraresear.ch/\" rel=\"nofollow\">DORA RESEARCH BLOG</a></div>\n<div> </div>\n<div>If you need any support for the interview process, pls do not hesitate to contact us by <a class=\"postings-link\" href=\"mailto:recruiting@dorahacks.com\" rel=\"nofollow\"><strong>recruiting@dorahacks.com</strong></a></div>\n<img src=\"https://remotive.com/job/track/1928411/blank.gif?source=public_api\" alt=\"\"/>","tags":"[\"AWS\",\"python\"]","pubDate":"2024-08-06 17:20:36.000","link":"https://remotive.com/remote-jobs/devops/devops-engineer-1928411","savedDate":"2024-08-08 08:33:53.841","slug":"devops-engineer-dorahacks-2062"},{"id":6146874041,"title":"Senior Technical Writer","company":"Coder","image":"https://remotive.com/job/1928645/logo","description":"<p style=\"min-height: 1.5em;\">Coder is on a mission to build enterprise software that makes software developers’ lives easier and keeps them in flow. We’re looking to hire an experienced Technical Writer to help us mature our product documentation and other supporting materials.</p>\n<p style=\"min-height: 1.5em;\"> </p>\n<p style=\"min-height: 1.5em;\"><strong>Responsibilities</strong></p>\n<ul style=\"\">\n<li style=\"\">\n<p style=\"min-height: 1.5em;\">Defining, implementing, and enforcing an information architecture (e.g. <a href=\"https://diataxis.fr/\" rel=\"nofollow\" target=\"_blank\">Diataxis</a>) for our product documentation</p>\n</li>\n<li style=\"\">\n<p style=\"min-height: 1.5em;\">Working with the product, engineering, and marketing teams to write monthly changelogs and documentation for new features</p>\n</li>\n<li style=\"\">\n<p style=\"min-height: 1.5em;\">Continuously creating and updating documentation/information architecture based on feedback from customers, internal stakeholders, and website analytics</p>\n</li>\n<li style=\"\">\n<p style=\"min-height: 1.5em;\">Providing strategic guidance to the leadership team on how to grow the footprint of technical writing at Coder via additional hiring, training, and/or other proven methods.</p>\n</li>\n</ul>\n<p style=\"min-height: 1.5em;\"> </p>\n<p style=\"min-height: 1.5em;\"><strong>Requirements</strong></p>\n<ul style=\"\">\n<li style=\"\">\n<p style=\"min-height: 1.5em;\">3+ years of experience writing software documentation, both for new products and with existing materials</p>\n</li>\n<li style=\"\">\n<p style=\"min-height: 1.5em;\">3+ years of experience working with DevOps tooling such as observability platforms, Ci/Cd providers, cloud providers, infrastructure as code platforms, etc.</p>\n</li>\n</ul>\n<p style=\"min-height: 1.5em;\"> </p>\n<p style=\"min-height: 1.5em;\"><strong>Bonus points</strong></p>\n<ul style=\"\">\n<li style=\"\">\n<p style=\"min-height: 1.5em;\">A background doing web development, system administration, or other software engineering disciplines.</p>\n</li>\n<li style=\"\">\n<p style=\"min-height: 1.5em;\">Experience writing for both open-source communities and enterprise IT teams.</p>\n</li>\n</ul>\n<p style=\"min-height: 1.5em;\"> </p>\n<p style=\"min-height: 1.5em;\"><strong>Interview Process </strong></p>\n<p style=\"min-height: 1.5em;\">We believe that the interview process should be consistent and enjoyable. We hope to get through the interview process in two to three weeks if schedules allow. During this time, you will be able to meet a mix of individual contributors, managers, and leadership. If this position requires a take-home assessment, we will compensate you for your work and time after completion. </p>\n<p style=\"min-height: 1.5em;\"> </p>\n<p style=\"min-height: 1.5em;\"><strong>Coder is a Proud Equal Opportunity Employer</strong></p>\n<p style=\"min-height: 1.5em;\">We are committed to providing equal employment opportunities to qualified applicants and do not discriminate on the basis of race, color, ancestry, religion, sex, pregnancy, gender, gender identity, gender expression, sexual orientation, national origin, age, marital status, genetic information, disability, protected veteran status or any other characteristic protected by federal, state, or local laws.</p>\n<img src=\"https://remotive.com/job/track/1928645/blank.gif?source=public_api\" alt=\"\"/>","tags":"[\"documentation\",\"technical writing\"]","pubDate":"2024-08-06 11:21:00.000","link":"https://remotive.com/remote-jobs/writing/senior-technical-writer-1928645","savedDate":"2024-08-08 08:33:53.841","slug":"senior-technical-writer-coder-3778"},{"id":3897686383,"title":"Senior Frontend Engineer, React/Typescript (Remote)","company":"DuckDuckGo","image":"https://spreadprivacy.com/content/images/2023/05/duckduckgo-logo_wide.png","description":"<p>Hi, we’re DuckDuckGo, the Internet privacy company for everyone who wants to take back their privacy now. For over a decade, we've been building our all-in-one product, developing new privacy technology, and working with policymakers to make online privacy simple and accessible for all.</p>\n<p><br /></p>\n<p>Our browsers and extensions have been downloaded over 250 million times with our built-in private search engine, which has seen over 100 billion searches and is the 2nd largest search engine on mobile in the United States and 20 other countries, including the United Kingdom, Canada, Australia, Poland, Italy, and Spain. Our private search engine is also 3rd in market share in the U.S. and over 15 major markets. Oh, and we've been profitable since 2014, with annual revenue exceeding $100 million!</p>\n<p><br /></p>\n<p>The DuckDuckGo browser’s uniquely comprehensive privacy protections are used by tens of millions of people to protect their everyday online activities on <a href=\"https://spreadprivacy.com/introducing-duckduckgo-for-mac/\" rel=\"noopener\">Mac</a>, <a href=\"https://spreadprivacy.com/windows-browser-open-beta/\" rel=\"noopener\">Windows</a>, <a href=\"https://spreadprivacy.com/duckduckgo-privacy-browser-ios14/\" rel=\"noopener\">iOS</a>, and <a href=\"https://spreadprivacy.com/introducing-app-tracking-protection/\" rel=\"noopener\">Android</a>, from searching to browsing, emailing, and more. We also offer <a href=\"https://spreadprivacy.com/meetprivacypro/\" rel=\"noopener\">Privacy Pro</a>, a three-in-one subscription service that includes a VPN, Personal Information Removal, and Identity Theft Restoration.</p>\n<p><br /></p>\n<p>We’re looking for a <strong>Senior Frontend Engineer</strong> to help shape our all-in-one privacy solution and join our mission to show the world that protecting your privacy online can be simple.  </p>\n<p><br /></p>\n<p><strong>The Opportunity</strong> </p>\n<p>In this role, you will lead and contribute to developing new and existing products and features, demonstrating ownership over major components of our codebase while taking responsibility for their maintenance and improvement over time. By writing pragmatic, performant, and testable code that works consistently across settings, devices, and browsers, you'll play a key role in improving the frontend software architecture, all while prioritizing privacy and user experience throughout the engineering process.</p>\n<p><br /></p>\n<p>As a senior engineer, you will mentor peers and work closely with cross-functional team members through remote collaboration opportunities, including product brainstorms, technical design discussions, code reviews, and more.</p>\n<p><br /></p>\n<p><strong>What You Will Bring to DuckDuckGo</strong> </p>\n<ul><li>7+ years experience in positions where your primary responsibility was writing code.</li><li>Advanced level of JavaScript/HTML/CSS expertise.</li><li>Advanced level of React and Typescript.</li><li>Advanced level of web application architecture expertise.</li><li>Ability to lead engineering projects with little to no oversight.</li><li>Experience building large-scale web applications.</li><li>Experience identifying success criteria and metrics and validating decisions against them.</li><li>Experience collaborating with engineers on the backend and other platforms, such as Android and iOS.</li><li>Experience collaborating with product and design to build polished consumer-facing products.</li><li>Ability to contribute to technical architecture decisions for complex products.</li><li>Willingness to learn new technologies and ideas.</li></ul>\n<p><br /></p>\n<p><strong>How We Will Support You </strong> </p>\n<p>Our core values -- build trust, question assumptions, and validate direction -- underpin how we work day-to-day and the support we give our team members. We strive to empower our team members to be self-directed and self-motivated in their work.  </p>\n<p><br /></p>\n<ul><li><strong>Remote First, Always</strong>: We've always been a fully distributed company with team members all over the world. We trust you to get your work done wherever, and whenever.   </li><li><strong>Commitment to Personal Growth:</strong> Every team member has an annual budget of $1,250 USD to invest in their professional development. Every team member also has a dedicated Career Advisor, who serves as a guide to help you develop your strengths, identify your motivations, and understand your opportunities for growth. </li><li><strong>Leadership:</strong> We have many different types of leaders and possible combinations of leadership roles, so you can grow your career in a way that aligns best with your personal goals. You can seek additional leadership roles by being directly responsible for projects, taking ownership of areas of the company, developing and maintaining internal processes, or pursuing advisory roles. </li><li><strong>Work/Life Balance: </strong>Team members have the freedom and flexibility to organize their own work schedules. We want you to thrive both in and out of the office. We trust you to use good judgment and take the time off that you need to bring your best self to work.  </li></ul>\n<p><br /></p>\n<p>We also offer paid parental leave, a co-working stipend, office setup reimbursement, and a wellness stipend. More support resources can be found in our <u><a href=\"https://duckduckgo.com/assets/hiring/team_support_guide.pdf\" rel=\"noopener\">Team Member Support Guide</a></u>, which explains how we make your well-being a priority. </p>\n<p><br /></p>\n<p>For more information on how we collaborate worldwide, from leadership in our relatively flat organization to start-to-finish ownership<strong>,</strong> check out <u><a href=\"https://duckduckgo.com/how-we-work\" rel=\"noopener\">DuckDuckGo Culture: How We Work.</a></u> </p>\n<p><br /></p>\n<p><strong>Compensation</strong> </p>\n<p>Annual compensation: $176,000 USD and stock options. Compensation is the same within a professional level, regardless of geographic location or functional area, and the compensation for each professional level is transparent across the organization.</p>\n<p><br /></p>\n<p><strong>Hiring Process</strong> </p>\n<p>Hiring works best when it's a two-way street. Learn how we help you get to know DuckDuckGo and envision your future role here. Find out more about <u><a href=\"https://duckduckgo.com/how-we-hire\" rel=\"noopener\">how we hire</a></u>. </p>\n<p><br /></p>\n<p><strong>Diversity, Equity, and Inclusion</strong> </p>\n<p>DuckDuckGo provides equal work opportunities to all team members and applicants<u>,</u> and it prohibits discrimination and harassment of any type on the basis of race, color, ethnicity, caste, religion, age, sex (including pregnancy), national origin, disability status, genetics, protected veteran status, sexual orientation, gender identity or expression, or any other characteristic protected by our policies or federal, state, or local laws.</p>\n<p><br /></p>\n<p>We want to ensure that our hiring process is accessible. If you need reasonable accommodation for any part of the application process because of a medical condition or disability, please send an email to <u><a href=\"mailto:careers@duckduckgo.com\" rel=\"noopener\">careers@duckduckgo.com</a></u> to let us know the nature of your request.  </p>\n<p><br /></p>\n<p>If you think you might thrive in this environment, we would love to hear from you. </p>\n<p><br /></p>\n<p><strong>Please note that:</strong> </p>\n<ol><li>Sometimes we meet up! Expect to travel at least two times a year: once for our all-hands meetup and again for a team retreat (each around 4-5 days). While extenuating circumstances may impact attendance, everyone is strongly encouraged to attend.</li><li>While we offer a flexible work arrangement with no core hours, expect an average full-time commitment of 40 hours per week. </li><li>A successful candidate will be subject to a background check and must receive satisfactory results of the same, as a condition of joining the team. </li><li>By applying for this role, you confirm that all information submitted is accurate and complete. You further acknowledge that providing false or fraudulent information during the application process is cause for denial of an offer, revocation of any existing offer, or other adverse action, up to and including termination after the start of your commencement of work.  </li></ol>\n<p><br /></p>\n<p>#LI-DNI</p>","tags":"[\"javascript\",\"typescript\",\"engineering\",\"aws\"]","pubDate":"2024-07-11 22:52:33.000","link":"https://duckduckgo.recruitee.com/o/senior-frontend-engineer-javascript-remote-2-5","savedDate":"2024-08-08 08:33:53.844","slug":"senior-frontend-engineer-react-typescript-remote-duckduckgo-1828"}]