[{"id":8929507230,"title":"Software Engineer - Cloud Ops [IC3]","company":"Sourcegraph","image":"https://pbs.twimg.com/profile_images/1428393724527190022/4mt5PACL_400x400.png","description":"\n    <div class=\"content-intro\"><h3>ALL SOURCEGRAPH ROLES ARE FULLY REMOTE</h3>\n<h2><strong><span style=\"color: #a112ff;\">Who we are</span></strong></h2>\n<p>Our mission at Sourcegraph is to make it so that&nbsp;<a class=\"c-link\" href=\"https://sourcegraph.notion.site/Mission-values-e9d37e6b972a4ef395c3076aea2bd07d\" target=\"_blank\" data-stringify-link=\"https://handbook.sourcegraph.com/strategy-goals/strategy\" data-sk=\"tooltip_parent\">everyone can code</a>, not just ~0.1% of the population. Our code graph powers Cody, the most powerful and accurate AI coding assistant, as well as our Code Search product, which helps devs explore their entire codebase and make large-scale migrations and security fixes. We’re building software that builds software, and in doing so we’re making devs more productive and preparing for a world where a lot more code gets written.</p>\n<p>It’s an exciting time to join Sourcegraph. AI has taken over the world, and we’ve spent the last 10 years building infrastructure that’s integral to making AI generated code more powerful and accurate. Our customers include 4/5 FAANG companies, 4 of the top 10 banks, government organizations, Uber, Plaid, and many other companies building the software that pushes the world forward. We’ve raised $225M at a $2.625B valuation from <a class=\"c-link\" href=\"https://techcrunch.com/2021/07/13/sourcegraph-raises-125m-series-d-on-2-6b-valuation-for-universal-code-search-tool/\" target=\"_blank\" data-stringify-link=\"https://techcrunch.com/2021/07/13/sourcegraph-raises-125m-series-d-on-2-6b-valuation-for-universal-code-search-tool/\" data-sk=\"tooltip_parent\">a16z</a>,&nbsp;<a class=\"c-link\" href=\"https://sourcegraph.com/blog/series-c-with-sequoia/\" target=\"_blank\" data-stringify-link=\"https://about.sourcegraph.com/blog/series-c-with-sequoia/\" data-sk=\"tooltip_parent\">Sequoia</a>,&nbsp;<a class=\"c-link\" href=\"https://www.redpoint.com/companies/sourcegraph/\" target=\"_blank\" data-stringify-link=\"https://www.redpoint.com/companies/sourcegraph/\" data-sk=\"tooltip_parent\">Redpoint</a>,&nbsp;<a class=\"c-link\" href=\"https://medium.com/craft-ventures/why-we-invested-in-sourcegraph-5ace28317e3d\" target=\"_blank\" data-stringify-link=\"https://medium.com/craft-ventures/why-we-invested-in-sourcegraph-5ace28317e3d\" data-sk=\"tooltip_parent\">Craft</a>&nbsp;and others. We’re making ambitious bets on our future and we’re looking to hire exceptional people to join our team as we make Sourcegraph one of the biggest and most influential companies in the world.</p></div>\n\n    <h2><span style=\"color: rgb(161, 18, 255);\"><strong>Location</strong></span></h2>\n<p>🌎 While we are an all-remote company and hire <a href=\"https://sourcegraph.notion.site/How-we-engage-talent-outside-of-the-US-218f7193695a46cbb1ef39ef9c1f72d4\">almost anywhere</a> in the world, we have a preference for someone to reside in the following locations for this role. However, if you feel qualified, we welcome you to apply regardless of location. No matter what, working hours must overlap with EST for at least 20 hours/week.</p>\n<p><strong>Preferred locations:</strong></p>\n<ul>\n<li>Remote, EST Timezone</li>\n</ul>\n<h2><span style=\"color: rgb(161, 18, 255);\"><strong>Why this job is exciting</strong></span></h2>\n<p>Source code is at the heart of Sourcegraph. We support multiple code hosts and retrieve, store, index, and serve source code - to end users, admins, and other internal services. Our latest addition to our product catalog, Cody, reimagines how code is written and supercharges our developer customers. Sourcegraph hosts the infrastructure for our customers to manage their source code (search, insights, own, etc.) and our brand new AI Code Assistant (Cody).</p>\n<p>This role gives you the opportunity to solve complex, challenging, and highly technical problems for our customers, both internally and externally, help unleash the potential and productivity of our Engineering teams, and delight our customers with industry-leading quality software.&nbsp;</p>\n<p>The Cloud Operation team primarily focuses on building a fully managed platform for using Sourcegraph, Sourcegraph Cloud, our SaaS offering. As a member of the Cloud Ops team, you will work closely with both external customers and internal stakeholders to meet their needs. You will:</p>\n<ul>\n<li>Develop inter-cloud connectivity solutions to support enterprise customers from highly regulated industries to use Sourcegraph Cloud.</li>\n<li>Build a control plane to orchestrate a fleet of single-tenant Sourcegraph Cloud instances.&nbsp;</li>\n<li>Expose complex infrastructure as API to support internal customers to iterate faster.</li>\n<li>Dive into upstream dependencies (e.g., CDK for Terraform, Terraform providers for GCP)&nbsp; to debug and patch non-trivial problems.</li>\n<li>Be an advocate for building reliable services and work with leadership to help product teams achieve operational excellence.&nbsp;</li>\n<li>Participate in on-call rotation to uphold our contractual SLA commitments.</li>\n</ul>\n<p>📅 Within one month, you will…</p>\n<ul>\n<li>Onboard onto the Sourcegraph architecture, tooling, and development workflow.</li>\n<li>Build a solid understanding of the team’s areas of ownership, technical challenges, and problems the team solves for our customers, and know how all of these align with the top-level company goals.</li>\n<li>Actively participate in team meetings, sharing ideas and insights to contribute to the overall team goals.</li>\n<li>Start contributing to the team goals and deliverables by shipping new features, debugging issues, and fixing bugs.</li>\n</ul>\n<p>📅 Within three months, you will…</p>\n<ul>\n<li>Demonstrate a comprehensive understanding of the Cloud infrastructure, its underlying technologies, and its integration within the Sourcegraph ecosystem.</li>\n<li>Lead initiatives contributing to team goals through both discovery and delivery phases, collaborating directly with product and design partners, other engineering teams, and non-technical stakeholders from different departments.</li>\n<li>Contribute to the architectural design and implementation of new features or improvements, actively shaping the future direction of Cloud infrastructure based on customer needs.</li>\n<li>Lead initiatives contributing to team goals on the roadmap by going through the entire product development lifecycle discovery, design, implementation, and delivery.</li>\n<li>Participate in our on-call rotation.</li>\n</ul>\n<p>📅 Within six months, you will…</p>\n<ul>\n<li>Be defining long-term technical vision and strategies for new product development, scaling existing services, and managing technical debt. These plans will consist of multiple smaller milestones, which you will deliver with the team iteratively.</li>\n<li>Collaborate with the Engineering Manager on defining the team’s growth strategy based on the long-term product vision, the technical vision, and the team’s needs.</li>\n<li>Seek feedback from customers and stakeholders to identify opportunities for further improvements or new features, actively iterating on the Cloud infrastructure to ensure it continues to meet our high bar.</li>\n</ul>\n<h2><span style=\"color: rgb(161, 18, 255);\"><strong>About you</strong></span></h2>\n<p>You bring a product mindset in balancing architectural flexibility and philosophy with meeting immediate customer demand. You are an experienced software engineer who looks to solve problems through writing code rather than one-off operations. You are passionate about user experience and self-service. You balance maintaining and designing high-impact systems with a pragmatic understanding of how to make appropriate tradeoffs (e.g., cut scope, low-tech vs. custom complex solutions) to ship quickly and iterate when necessary.&nbsp;</p>\n<p>Qualifications:</p>\n<ul>\n<li>Proficiency in Go, or other strongly typed languages.</li>\n<li>Knowledge in one of the public cloud platform providers (GCP, AWS, Azure)</li>\n<li>Experience with Terraform (or similar IaC solutions) and Kubernetes to build tooling and automation.</li>\n<li>Skilled at debugging distributed systems followed by designing and implementing solutions to those problems. This means you should know your way around various OS-level primitives, e.g., network, CPU, and memory.</li>\n<li>Ability to communicate clearly and empathetically, especially in writing and documentation.</li>\n<li>Preferred time zone between UTC-8 and UTC+2</li>\n</ul>\n<p>Nice to haves:</p>\n<ul>\n<li>Built services and exposed them as API for external consumption&nbsp; (e.g., gRPC).</li>\n<li>Comfortable implementing system-level software&nbsp; (e.g., custom transport protocol) if needed or has contributed to Kubernetes controllers/operators.</li>\n<li>Published blog posts and/or tech talks about your work.</li>\n<li>Experience working on small high-performing teams, preferably tech startups.</li>\n</ul>\n<h2><span style=\"color: rgb(161, 18, 255);\"><strong>Level</strong></span></h2>\n<p>📊 This job is an IC3. You can read more about <a href=\"https://www.notion.so/sourcegraph/Leveling-Guide-0e1b5c76ada64b9caac387f8b7c4fc66\">our job leveling philosophy</a> in our Handbook.</p>\n<h2><span style=\"color: rgb(161, 18, 255);\"><strong>Compensation</strong></span></h2>\n<p><strong>💸 We pay you an above-average salary</strong> because we want to hire the best people who are fully focused on helping Sourcegraph succeed, not worried about paying bills. As an <a href=\"https://sourcegraph.notion.site/Mission-values-e9d37e6b972a4ef395c3076aea2bd07d\">open and transparent</a> company that values <a href=\"https://www.notion.so/sourcegraph/Compensation-Pay-Transparency-at-Sourcegraph-d58d0774f51b4b489d41c3628d30ff8d?pvs=4\">competitive compensation</a>, our compensation ranges are visible to every single Sourcegraph teammate.</p>\n<p>To determine your salary, we use a number of market and data-driven salary sources, along with your location zone, and target the high-end of the range to ensure we’re always paying above market regardless of where you live in the world. Both U.S. and international locations are divided into one of four zones, determined by the cost of labor index for each area. The starting salary for a successful candidate will be based on level, job-related skills, experience, qualifications, and location zone. Please note that these salary ranges may be adjusted in the future.</p>\n<p>💰The target compensation for this role is $136,000 USD base.</p>\n<ul>\n<li>Zone 2: $136,000 USD</li>\n<li>Zone 3: $102,000 USD</li>\n<li>Zone 4: $68,000 USD</li>\n</ul>\n<p>Please speak with a recruiter for additional information regarding zone locations.</p>\n<p>📈 In addition to our cash compensation, we offer equity (because when we succeed as a company, we want you to succeed, too) and generous&nbsp;<a href=\"https://sourcegraph.notion.site/Benefits-Perks-dd1da4b6b3a64780abed010a144d34ba\">perks &amp; benefits</a>.</p>\n<h2><span style=\"color: rgb(161, 18, 255);\"><strong>Interview process</strong></span></h2>\n<p><em>Below is the interview process you can expect for this role (you can read more about </em><a href=\"https://sourcegraph.notion.site/Types-of-interviews-f279f080583d49ee9f2c60e30c8cb1f7\"><em>the types of interviews</em></a><em> in our Handbook). It may look like a lot of steps, but rest assured that we move quickly and the steps are designed to help you get the information needed to determine if we’re the right fit for you… Interviewing is a two-way street, after all!&nbsp;</em></p>\n<p>We expect the interview process to take 5.5 hours in total.</p>\n<p><strong>👋 Introduction Stage</strong> - we have initial conversations to get to know you better…</p>\n<ul>\n<li>[30m] <a href=\"https://www.notion.so/sourcegraph/Types-of-interviews-sample-questions-f279f080583d49ee9f2c60e30c8cb1f7?pvs=4#99be5ff628b2414194a0ba79d9f25f13\">Recruiter Screen</a></li>\n<li>[15m] Hiring Manager Intro</li>\n</ul>\n<p><strong>🧑‍💻 Team Interview Stage</strong> - we then delve into your experience in more depth and introduce you to members of the team, including cross-functional partners…</p>\n<ul>\n<li>[Async] Take home exercise</li>\n<li>[60m] Exercise walkthrough (10-15m) &amp; System Design (45m)</li>\n<li>[60m] Pairing Exercise (45m) &amp; Infrastructure Interview (15m)</li>\n<li>[45m] Cross-functional Team Collaboration Interview</li>\n<li>[60m] Resume Deep Dive</li>\n</ul>\n<p><strong>🎉 Final Interview Stage </strong>- we move you to our final round, where you gain a better understanding of our business and values holistically…</p>\n<ul>\n<li>[30m] <a href=\"https://www.notion.so/sourcegraph/Types-of-interviews-sample-questions-f279f080583d49ee9f2c60e30c8cb1f7?pvs=4#e3a04291743048df87541a88aa8199dd\">Values</a></li>\n<li>[30m] <a href=\"https://www.notion.so/sourcegraph/How-to-work-with-Quinn-Slack-CEO-807673e0864d473f959cc4efd9642a5a?pvs=4#6f185c0e2011411eac5be9c675f9056c\">Leadership</a> with co-founder&nbsp;</li>\n<li>We check references and conduct your background check</li>\n</ul>\n<p>Please note - you are welcome to request additional conversations with anyone you would like to meet, but didn’t get to meet during the interview process.</p>\n\n    \n\n    <div class=\"content-conclusion\"><h2><strong><span style=\"color: #a112ff;\">Not sure if this is you?</span></strong></h2>\n<p><span style=\"font-weight: 400;\">We want a diverse, global team, with a broad range of experience and perspectives. If this job sounds great, but you’re not sure if you qualify, apply anyway! We carefully consider every application, and will either move forward with you, find another team that might be a better fit, keep in touch for future opportunities, or thank you for your time.</span></p>\n<h2><strong><span style=\"color: #a112ff;\">Learn more about us</span></strong></h2>\n<p><span style=\"font-weight: 400;\">To create a product that serves the needs of all developers, we are building a diverse </span><a href=\"https://sourcegraph.notion.site/All-remote-guidelines-4d1270d806294bf4ae6db7ab02911957\"><span style=\"font-weight: 400;\">all-remote team</span></a><span style=\"font-weight: 400;\"> that is </span><a href=\"https://www.notion.so/sourcegraph/7ed54d4ec4624475a4b45619901236d7?v=e06d936c673f46ca8c313a557bd4410f\"><span style=\"font-weight: 400;\">distributed across the world</span></a><span style=\"font-weight: 400;\">. Sourcegraph is an equal opportunity workplace; we welcome people from all backgrounds and communities.&nbsp;</span></p>\n<p><span style=\"font-weight: 400;\">We provide </span><a href=\"https://sourcegraph.notion.site/Compensation-Pay-Transparency-at-Sourcegraph-d58d0774f51b4b489d41c3628d30ff8d?pvs=74\"><span style=\"font-weight: 400;\">competitive compensation</span></a><span style=\"font-weight: 400;\"> and </span><a href=\"https://sourcegraph.notion.site/Benefits-Perks-dd1da4b6b3a64780abed010a144d34ba?pvs=74\"><span style=\"font-weight: 400;\">practical benefits</span></a><span style=\"font-weight: 400;\"> to keep you happy and healthy so that you can do your best work.&nbsp;</span><span style=\"font-weight: 400;\">&nbsp;</span></p>\n<p><span style=\"font-weight: 400;\">Learn more about what it is like to work at Sourcegraph by reading </span><a href=\"https://sourcegraph.notion.site/d7614e3e9dc04c09ac2d42d57f1816e6?v=2a6d426dbae14390b155120b0c029ce0\"><span style=\"font-weight: 400;\">our handbook</span></a><span style=\"font-weight: 400;\">.</span></p>\n<p><span style=\"font-weight: 400;\">We want to ensure Sourcegraph is an environment that suits your working style and empowers you to do your best work, so we are eager to answer any questions that you have about us at any point in the interview process.</span></p>\n<p><span style=\"font-weight: 400;\">Go back to the </span><a href=\"https://about.sourcegraph.com/jobs/\"><span style=\"font-weight: 400;\">careers page</span></a><span style=\"font-weight: 400;\"> for all open positions.</span></p>\n<p>&nbsp;</p>\n<p><em><span style=\"font-weight: 400;\">Sourcegraph participates in <a href=\"https://sourcegraph.notion.site/E-Verify-2ab3286dde3446d6bac2898c83610107\" target=\"_blank\">E-Verify</a> for U.S. Employees</span></em></p></div>\n","tags":"[\"engineering\",\"aws\"]","pubDate":"2024-06-23 04:01:58.474","link":"https://boards.greenhouse.io/sourcegraph91/jobs/5201427004","savedDate":"2024-06-23 04:01:58.474","slug":"software-engineer-cloud-ops-ic3-sourcegraph-9398"},{"id":5411057342,"title":"Product Design Trainee","company":"SafetyWing","image":"https://pbs.twimg.com/profile_images/1177267684574208000/54eG3WmW_400x400.jpg","description":"<h2>🧘 What we offer:</h2> <div><!--block-->We offer a 2-year fixed-term contract with an opportunity to join our team full-time if it works for both parties.<br><br>You will receive salary and equity compensation, health insurance, a laptop, a minimum of four weeks of yearly vacation, a personal development budget, and other benefits and perks.<br><br>We operate in a fully remote work environment – work from anywhere globally.&nbsp;<br><br>We have at least two annual team gatherings. The previous gatherings were in Ljubljana, San Francisco, Mexico, Bali, and Siglufjörður.<br><br>We are looking forward to hearing from you!</div> <div><!--block-->As the<strong> Product Design Trainee </strong>at <a href=\"https://safetywing.com/\"><strong>SafetyWing</strong></a>,<strong> </strong><br>you will assist in designing and developing our products. Your contributions will support creating exceptional designs and adding depth and meaning to our projects while upholding our core values.<br><br></div><div><!--block-->We are on a mission to remove the role of geographical borders as a barrier to equal opportunities and freedom for everyone. And we are doing that by creating simple health, insurance, and retirement products for remote workers worldwide as a replacement for national welfare systems.</div> <h2>👨‍🎤 As our Product Design Trainee, you will:</h2>  <ul><li><!--block-->Support product design initiatives from initial concept to final execution, ensuring all deliverables meet quality standards and timelines.</li><li><!--block-->Contribute to process improvements by helping implement and advocate for ongoing enhancements in design processes and developing strategies to elevate the quality and efficiency of design outputs.</li><li><!--block-->Collaborate closely with product managers, engineers, and other designers to maintain a cohesive and consistent design language across all products.</li><li><!--block-->Adhere to design systems by assisting in evolving and enforcing SafetyWing's design system, ensuring all design elements are aligned with established guidelines.</li><li><!--block-->Present design ideas by helping communicate and present product design concepts to cross-functional teams and senior leadership, fostering a collaborative and informed decision-making process.</li></ul> <h2>🧪 We are looking for someone who:</h2> <ul><li><!--block-->Has a passion for product design and a strong desire to learn and grow in the field.</li><li><!--block-->Holds a relevant degree and some practical experience or internship in product design.</li><li><!--block-->Has a portfolio showcasing design projects and practical experience.</li><li><!--block-->Is proficient in using design and prototyping tools such as Figma and committed to continuously learning new features.</li><li><!--block-->Can communicate design ideas clearly and champion design principles across diverse audiences, including design and non-design stakeholders.</li><li><!--block-->Is comfortable with ambiguity.</li><li><!--block-->Has a strong sense of empathy for both users and team members.</li><li><!--block-->Is interested in helping build a global social safety net.</li><li><!--block-->Thinks for themselves instead of copying others.</li><li><!--block-->Is creative and bold in the face of any problem.</li><li><!--block-->Is intellectually honest and has high integrity.</li></ul>","tags":"[]","pubDate":"2024-06-23 04:01:58.472","link":"https://safetywing.pinpointhq.com/en/jobs/209102","savedDate":"2024-06-23 04:01:58.472","slug":"product-design-trainee-safetywing-6660"},{"id":4397577458,"title":"Product Marketing Trainee","company":"SafetyWing","image":"https://pbs.twimg.com/profile_images/1177267684574208000/54eG3WmW_400x400.jpg","description":"<h2>🧘 What we offer</h2> <ul><li><!--block-->Fully remote work environment – work from anywhere globally.&nbsp;</li><li><!--block-->Competitive compensation.</li><li><!--block-->Global coverage with Remote Health and Nomad Insurance.</li><li><!--block-->A minimum of 20 days of compensated time off each year.</li><li><!--block-->Referral bonus - an incentive program rewarding you for helping us find exceptional talent to join our team.</li><li><!--block-->Opportunity to unlock more benefits as your tenure with SafetyWing grows.</li></ul><div><!--block-->We are looking forward to hearing from you!</div> <div><!--block--><strong>&nbsp;SafetyWing</strong> (YC W18) is seeking a <strong>Product Marketing Trainee</strong> to assist in streamlining our marketing strategies and enhancing the success of our insurance products. In this role, you will dive into market research, craft compelling messaging, oversee product launches, and develop tools to boost customer acquisition and retention. Your efforts will ensure our audience understands and values our products, directly contributing to our growth.<br><br></div><div><!--block-->We are on a mission to remove the role of geographical borders as a barrier to equal opportunities and freedom for everyone. We are doing that by creating simple health, insurance, and retirement products for remote workers worldwide as a replacement for national welfare systems.</div> <h2>💻 Your responsibilities will include</h2>  <ul><li><!--block-->Talking to our customers to find out why they buy our products and keeping an eye on market trends.</li><li><!--block-->Crafting clear and engaging messages that resonate with our diverse audience.</li><li><!--block-->Tracking and refining our growth, making data-driven suggestions for enhancements.</li><li><!--block-->Ensuring that both our team and customers have a deep understanding and appreciation of our product.</li><li><!--block-->Managing our website in collaboration with the design team to ensure it reflects our core messaging.</li><li><!--block-->Coordinating the launch of new features and product updates, prioritizing alignment with our product's core principles.</li><li><!--block-->Creating web pages and ads to attract and keep customers, always seeking ways to do it better.</li><li><!--block-->Collaborating with customer success to proactively tackle customer issues and refine their experience.</li></ul> <h2>🧪 We are looking for someone who</h2> <ul><li><!--block-->Has a background in product marketing, with some practical experience or internship.</li><li><!--block-->Is passionate about creating strategies that resonate with target audiences.</li><li><!--block-->Is a team player who's eager to collaborate across functions to achieve shared goals.</li><li><!--block-->Is an innovative thinker, always looking for new ways to engage customers and improve their experience with our products.</li><li><!--block-->Has a strong ability to communicate complex ideas simply and attractively.</li><li><!--block-->Is driven by data to make decisions and improve product positioning.</li></ul><div><!--block--><strong>😀 We like to work with people who:</strong></div><ul><li><!--block-->Want to help build a global social safety net.</li><li><!--block-->Think for themselves instead of copying others.</li><li><!--block-->Are willing to try new things, even with the risk of failure.</li><li><!--block-->Are intellectually curious and open to new ideas.</li><li><!--block-->Are creative and bold in the face of any problems.</li><li><!--block-->Have strong integrity and do the right thing.</li></ul>","tags":"[]","pubDate":"2024-06-23 04:01:58.472","link":"https://safetywing.pinpointhq.com/en/jobs/209170","savedDate":"2024-06-23 04:01:58.472","slug":"product-marketing-trainee-safetywing-4501"},{"id":9772348166,"title":"Account Executive ","company":"Timescale","image":"https://pbs.twimg.com/profile_images/1542681228666671107/L5LYJLAD_400x400.png","description":"&lt;p&gt;Timescale powers the next wave of computing, and we are enabling our customers to build innovative, data-centric applications powered by Timescale. As an&lt;strong&gt;&amp;nbsp;Account Executive, &lt;/strong&gt;you will interact directly with customers, answer questions, provide information, and build connections with them.&amp;nbsp;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;What you will do&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;In this role, you will be at the forefront of closing deals and providing solutions in our growing database market. You can make a meaningful impact by helping organizations harness the power of data for better decision-making, improved operations, and innovation. You will manage complex sales relationships with critical customers and effectively communicate the value of Timescale. As the company and industry expand, we see our high-growth market as an opportunity for significant sales and career advancement.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Your main responsibilities will include:&lt;/strong&gt;&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;Focus on closing Sales Qualified Leads (SQL) from the marketing team.&amp;nbsp;&lt;/li&gt;\n&lt;li&gt;Qualify leads based on their challenges and alignment with our product suite.&amp;nbsp;&lt;/li&gt;\n&lt;li&gt;Strategically prospect into CTOs, Engineering Leads, and Technical End Users.&amp;nbsp;&amp;nbsp;&lt;/li&gt;\n&lt;li&gt;Manage the full sales cycle.&amp;nbsp;&lt;/li&gt;\n&lt;li&gt;Leverage resources such as Sales Engineers and Data Architects effectively.&amp;nbsp;&lt;/li&gt;\n&lt;li&gt;Guide relevant stakeholders through the sales process to close.&amp;nbsp;&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;&lt;strong&gt;A little bit about you&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;You are a top performer with a proven track record, and you know that your success directly depends on your customers&#39; success. You always put the customer&#39;s best interests first while managing complex sales engagements and effectively leveraging resources to ensure success. You are hungry, resilient, curious, driven, and humble in your pursuit of excellence. You aren’t afraid to speak up and identify problem areas or share your ideas, and you want to be a&amp;nbsp;&lt;strong&gt;part of the solution&lt;/strong&gt;! You are a builder who is passionate about creatively trying new things and contributing to our growth by exploring innovative solutions 🙌.&amp;nbsp;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;You also have:&lt;/strong&gt;&lt;/p&gt;\n&lt;ul&gt;\n&lt;li data-stringify-indent=&quot;0&quot; data-stringify-border=&quot;0&quot;&gt;3-5 years of experience in a full-cycle quota-carrying Saas sales role&lt;/li&gt;\n&lt;li data-stringify-indent=&quot;0&quot; data-stringify-border=&quot;0&quot;&gt;Technical background with a deep understanding of database technology, data platforms, open source, and cloud ecosystems&lt;/li&gt;\n&lt;li data-stringify-indent=&quot;0&quot; data-stringify-border=&quot;0&quot;&gt;Ability to articulate the business value of complex enterprise technology&lt;/li&gt;\n&lt;li data-stringify-indent=&quot;0&quot; data-stringify-border=&quot;0&quot;&gt;Proficiency in modern sales software (e.g., Salesforce, Outreach, etc.).&lt;/li&gt;\n&lt;li data-stringify-indent=&quot;0&quot; data-stringify-border=&quot;0&quot;&gt;Proven track record of exceeding sales targets and driving revenue growth.&lt;/li&gt;\n&lt;li data-stringify-indent=&quot;0&quot; data-stringify-border=&quot;0&quot;&gt;Strong interpersonal skills with the ability to build rapport and establish trust with customers.&lt;/li&gt;\n&lt;li data-stringify-indent=&quot;0&quot; data-stringify-border=&quot;0&quot;&gt;Demonstrated ability to manage multiple priorities in a fast-paced environment effectively.&lt;/li&gt;\n&lt;li data-stringify-indent=&quot;0&quot; data-stringify-border=&quot;0&quot;&gt;Entrepreneurial mindset with a proactive approach to problem-solving.&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;&lt;strong&gt;About Timescale🐯&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span style=&quot;font-weight: 400;&quot;&gt;Timescale is the creator of TimescaleDB, the industry-leading relational database for time-series. Tens of thousands of organizations trust TimescaleDB today with their mission-critical time-series applications. The company is dedicated to serving software developers and businesses worldwide, enabling them to build exceptional data-driven products that &lt;/span&gt;&lt;strong&gt;measure everything that matters&lt;/strong&gt;&lt;span style=&quot;font-weight: 400;&quot;&gt;: software applications, industrial equipment, financial markets, blockchain activity, consumer behavior, machine learning models, climate change, and more. Analyzing data across the time dimension (“time-series data”) enables developers to understand what is happening right now, how that is changing, and why that is changing. &lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span style=&quot;font-weight: 400;&quot;&gt;Timescale is a remote-first company with a global🌎 workforce and is backed by Tiger Global, Benchmark Capital, New Enterprise Associates, Redpoint Ventures, Icon Ventures, Two Sigma Ventures, and other leading investors. For more information, visit www.timescale.com or follow @TimescaleDB.&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Working at Timescale🐯&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span style=&quot;font-weight: 400;&quot;&gt;Timescale is breaking boundaries and setting new standards in the innovating and rapidly growing time-series data industry. Built on the foundation of people-focused values and principles, Timescale makes sure integrity, mutual respect, and compassion is at the heart of everything we do. Empowered by our Co-Founders, Ajay Kulkarni (CEO) and Mike Freedman (CTO), we are challenging the norm by working with people who continuously inspire and teach us 🤝.&amp;nbsp;&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span style=&quot;font-weight: 400;&quot;&gt;Enjoy debating the crunch-factor of different chicken nuggets 🍗, sweating it out during lunch 💦, talking about your kids, whether they be actual children 👶🏽, potted plants 🪴, or four-legged creatures 🐾? You’ll fit right in at Timescale!&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;What we’re offering&lt;/strong&gt;&lt;/p&gt;\n&lt;ul&gt;\n&lt;li style=&quot;font-weight: 400;&quot;&gt;&lt;span style=&quot;font-weight: 400;&quot;&gt;Flexible PTO and family leave&lt;/span&gt;&lt;/li&gt;\n&lt;li style=&quot;font-weight: 400;&quot;&gt;&lt;span style=&quot;font-weight: 400;&quot;&gt;Summer Fridays off in August ☀️&lt;/span&gt;&lt;/li&gt;\n&lt;li style=&quot;font-weight: 400;&quot;&gt;&lt;span style=&quot;font-weight: 400;&quot;&gt;Full remote work from almost &lt;/span&gt;&lt;em&gt;&lt;span style=&quot;font-weight: 400;&quot;&gt;anywhere&lt;/span&gt;&lt;/em&gt;&lt;/li&gt;\n&lt;li style=&quot;font-weight: 400;&quot;&gt;&lt;span style=&quot;font-weight: 400;&quot;&gt;Stock options&lt;/span&gt;&lt;/li&gt;\n&lt;li style=&quot;font-weight: 400;&quot;&gt;&lt;span style=&quot;font-weight: 400;&quot;&gt;Monthly WiFi stipend&lt;/span&gt;&lt;/li&gt;\n&lt;li style=&quot;font-weight: 400;&quot;&gt;&lt;span style=&quot;font-weight: 400;&quot;&gt;Professional development &amp;amp; educational benefits&lt;/span&gt;&lt;/li&gt;\n&lt;li style=&quot;font-weight: 400;&quot;&gt;&lt;span style=&quot;font-weight: 400;&quot;&gt;Premium insurance options for you and your family &lt;/span&gt;&lt;em&gt;&lt;span style=&quot;font-weight: 400;&quot;&gt;(US employees)&lt;/span&gt;&lt;/em&gt;&lt;/li&gt;\n&lt;li style=&quot;font-weight: 400;&quot;&gt;&lt;span style=&quot;font-weight: 400;&quot;&gt;FSA/Dependent FSA plans &lt;/span&gt;&lt;em&gt;&lt;span style=&quot;font-weight: 400;&quot;&gt;(US employees)&lt;/span&gt;&lt;/em&gt;&lt;/li&gt;\n&lt;li style=&quot;font-weight: 400;&quot;&gt;401(k) retirement plan &lt;em&gt;(US employees)&lt;/em&gt;&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;&lt;em&gt;While Timescale operates primarily as a remote organization, we strongly prefer candidates located in San Francisco, CA, and New York City, NY, to facilitate frequent collaboration and connection with local team members&lt;/em&gt;&lt;/p&gt;&lt;div class=&quot;content-conclusion&quot;&gt;&lt;p&gt;By applying for this position, you are agreeing to &lt;a href=&quot;https://www.timescale.com/legal/timescale-applicant-privacy-notice&quot;&gt;Timescale&#39;s Applicant Privacy Notice.&amp;nbsp;&lt;/a&gt;&lt;/p&gt;&lt;/div&gt;","tags":"[\"engineering\",\"legal\",\"database\"]","pubDate":"2024-06-23 04:01:58.472","link":"https://www.timescale.com/careers/7507677002?gh_jid=7507677002","savedDate":"2024-06-23 04:01:58.472","slug":"account-executive-timescale-8425"},{"id":6098994937,"title":"Content Marketing Manager, Content Amplification","company":"Timescale","image":"https://pbs.twimg.com/profile_images/1542681228666671107/L5LYJLAD_400x400.png","description":"&lt;p&gt;As a&amp;nbsp;&lt;strong&gt;Content Marketing Manager &lt;/strong&gt;at Timescale🐯, you will support lead-generation efforts by collaborating across multiple departments to repurpose content for various channels and audiences. You will work closely with the Lead Generation and Content Marketing team to implement efficient processes and provide compelling and engaging written, visual, audio, and video content.&lt;/p&gt;\n&lt;p&gt;Top candidates will have a knack for transforming existing content into fresh, impactful formats, including social media posts, infographics, ad copy, and more. You will thrive in a fast-paced environment, enjoy brainstorming innovative ideas, and possess the ability to work seamlessly with content creators, designers, and other stakeholders.&lt;/p&gt;\n&lt;p&gt;In this role, your main responsibilities will be to:&amp;nbsp;&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;Transform existing blog posts, articles, and whitepapers into new formats such as long-form content, social media posts, videos, and more.&lt;/li&gt;\n&lt;li&gt;Create shorter, engaging snippets from long-form content for use on various platforms.&lt;/li&gt;\n&lt;li&gt;Work closely with teams to align and develop content specifically designed to attract and capture leads.&lt;/li&gt;\n&lt;li&gt;Monitor, analyze, and report on the performance of repurposed content to optimize lead generation efforts.&lt;/li&gt;\n&lt;li&gt;Craft compelling social media posts that drive engagement and conversions.&lt;/li&gt;\n&lt;li&gt;Create ad copy and visuals for various digital advertising platforms.&lt;/li&gt;\n&lt;li&gt;Collaborate with content creators, designers, and other team members to ensure all repurposed content adheres to brand guidelines and quality standards.&lt;/li&gt;\n&lt;li&gt;Maintain an organized library of repurposed content assets.&lt;/li&gt;\n&lt;li&gt;Bring innovative ideas to the table for repurposing content in new and engaging ways.&lt;/li&gt;\n&lt;li&gt;Experiment with different content formats and platforms to reach a wider audience.&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;&lt;em&gt;This role is remote, and English language fluency is a requirement. Due to the team&#39;s location, the ideal candidates are located in the US, Brazil, Portugal, or Ireland.&amp;nbsp;&lt;/em&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;A little bit about you&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;You are a self-starter who finds great fulfillment in getting things done—whether it’s creating an effective piece of content, or developing a new operational process—and seeing the impact of your work. You are not intimidated by a fast-moving and multi-tasking environment but rather revel in the opportunity to move quickly with autonomy. You believe that working as a team can improve your own output, and you are awesome but humble and folks look forward to working with you. You’re primarily a storyteller who has created content for technical audiences and has worked collaboratively with stakeholders, developers, and designers.&lt;/p&gt;\n&lt;p&gt;You also:&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;Have at least 4 years of experience working in content, lead generation, or a similar role.&lt;/li&gt;\n&lt;li&gt;Possess strong interpersonal and communication skills (written and verbal).&lt;/li&gt;\n&lt;li&gt;Easily pick up on technical terms and concepts and know how to explain them clearly and concisely.&lt;/li&gt;\n&lt;li&gt;Balance the needs of both the business goals and customers when creating content.&amp;nbsp;&lt;/li&gt;\n&lt;li&gt;Are a self-starter who can manage and prioritize initiatives.&lt;/li&gt;\n&lt;li&gt;Possess strong problem-solving skills combined with deep empathy for all humans.&lt;/li&gt;\n&lt;li&gt;Are able to work independently and remotely.&lt;/li&gt;\n&lt;/ul&gt;&lt;div class=&quot;content-conclusion&quot;&gt;&lt;p&gt;By applying for this position, you are agreeing to &lt;a href=&quot;https://www.timescale.com/legal/timescale-applicant-privacy-notice&quot;&gt;Timescale&#39;s Applicant Privacy Notice.&amp;nbsp;&lt;/a&gt;&lt;/p&gt;&lt;/div&gt;","tags":"[\"legal\"]","pubDate":"2024-06-23 04:01:58.472","link":"https://www.timescale.com/careers/7506572002?gh_jid=7506572002","savedDate":"2024-06-23 04:01:58.472","slug":"content-marketing-manager-content-amplification-timescale-695"},{"id":4687522486,"title":"Associate Opener/Sales Development Representative","company":"SafetyWing","image":"https://pbs.twimg.com/profile_images/1177267684574208000/54eG3WmW_400x400.jpg","description":"<h2>🧘 What we offer</h2> <ul><li><!--block-->Fully remote work environment – work from anywhere globally.&nbsp;</li><li><!--block-->Competitive compensation: base and commission.</li><li><!--block-->Global coverage with Remote Health and Nomad Insurance.</li><li><!--block-->A minimum of 20 days of compensated time off each year.</li><li><!--block-->Referral bonus - an incentive program rewarding you for helping us find exceptional talent to join our team.</li><li><!--block-->Opportunity to unlock more benefits as your tenure with SafetyWing grows.</li></ul><div><!--block--><br>We are looking forward to hearing from you!</div> <div><!--block-->We’re seeking a friendly and energetic Associate Opener to join our Direct Sales Team and help us connect with amazing customers! Your talent in pinpointing potential leads will steer <strong>SafetyWing</strong> toward achieving our goals.</div><div><!--block--><br>We are building a global social safety net, including health and retirement for remote workers worldwide, as a replacement for national welfare systems. If we succeed, we believe this will help ensure freedom and equal opportunity for everyone, and it is one of the more important tasks of our time that no one else is working on.</div> <h2>💻 Your responsibilities will include</h2>  <ul><li><!--block-->Create awareness and generate interest for Remote Health by SafetyWing among companies.</li><li><!--block-->Discover impactful leads.</li><li><!--block-->Conduct outreach through calling, emailing, and social media to engage potential clients.</li><li><!--block-->Set up qualified meetings between target buyers and our account executives (Closers).</li><li><!--block-->Assist in whipping up and executing lead-generation campaigns.</li><li><!--block-->Meticulously enter and manage sales data, ensuring accuracy and reliability in our CRM.</li></ul><div><!--block--><br></div> <h2>🧪 We are looking for someone who:</h2> <ul><li><!--block-->Has an exceptional knack for research – we value this highly!</li><li><!--block-->Has successful experience in proactive customer outreach.</li><li><!--block-->Has excellent communication skills in English, both verbal and written.</li><li><!--block-->Is tech-savvy and comfortable with Google Workspace, CRM software, and marketing automation tools.</li><li><!--block-->Is a continual learner, detailed, planning pro, and autonomous worker.</li><li><!--block-->Extra shine if you have experience in lead generation and a diploma or degree in marketing, business, or a related field.</li></ul><div><!--block--><strong>😀 We like to work with people who:</strong></div><ul><li><!--block-->Want to help build a global social safety net on the Internet.</li><li><!--block-->Think for themselves instead of copying others.</li><li><!--block-->Are willing to try new things, even with the risk of failure.</li><li><!--block-->Are intellectually curious and open to new ideas.</li><li><!--block-->Are creative and bold in the face of any problems.</li><li><!--block-->Have strong integrity and do the right thing.</li></ul>","tags":"[]","pubDate":"2024-06-23 04:01:58.471","link":"https://safetywing.pinpointhq.com/en/jobs/166731","savedDate":"2024-06-23 04:01:58.471","slug":"associate-opener-sales-development-representative-safetywing-4796"},{"id":7840222617,"title":"People Success Partner (Europe)","company":"Airalo","image":"https://lever-client-logos.s3.us-west-2.amazonaws.com/55028a36-609c-479c-9553-d4689ff2dd8c-1669620566663.png","description":"<div><b>About Airalo</b></div><div>Alo! Airalo is the world’s first eSIM store that helps people connect in over 200+ countries and regions across the globe. We are building the next digital service that revolutionizes the telecom industry. We are a travel-tech company and an equal-opportunity environment that values and executes diversity, inclusion, and equity. Our team is spread across 50+ countries and six continents. What glues us together is our commitment to changing the way you connect<span style=\"font-size: 13.3333px\">. </span></div><div><br></div><div><b>About you</b></div><div>We hope that you care deeply about the quality of your work, the intrinsic worth of tasks, and the success of your team. You are self-disciplined and do not require micromanagement in terms of your skillset and work ethic. You do your best to flourish as an individual every day while working hard to foster a collaborative team environment. You believe in the importance of being — and staying — authentic, honest, positive, and kind. You are a good interlocutor with clear and concise communication. You are able to manage multiple projects, have an analytical mind, pay keen attention to detail, and love to get your hands dirty. You are cognizant, tolerant, and welcoming of vulnerabilities and cultural differences.</div><div><br></div><div><b>About the Role</b></div><div><b>Position</b>: Full-time / Employee</div><div><b>Location:</b>&nbsp;Remote-first </div><div><b>Benefits:</b>&nbsp;Health Insurance, work-from-anywhere stipend, annual wellness &amp; learning credits, annual all-expenses-paid company retreat in a gorgeous destination &amp; other benefits</div><div><br></div><div>As a&nbsp;<b>People Success Partner</b>, you will be responsible for partnering with our Leadership team and ensuring all day-to-day People matters are handled. You’ll be working closely with our founders, C-level executives, VPs &amp; Directors of your assigned tribe, as well as the entire People &amp; Talent team.</div><h3>Responsibilities include but are not limited to:</h3><li>Assists Management in the development of solutions for current and future business needs through employee development, organizational development, cultural and process-oriented perspectives</li><li>Be knowledgeable and considerate of the complexity of supporting a fully remote team, across almost 60 countries</li><li>Support with yearly Headcount Planning &amp; Forecasts with the People Director, Talent, and Hiring Managers</li><li>Serve as a trusted advisor to team members, addressing concerns, resolving conflicts, and promoting a positive workplace culture</li><li>Ensures all areas of that team are running smoothly and that leadership in their teams feel supported</li><li>Handles all performance-related challenges, and supports their teams to be high-performing, engaged, and successful</li><li>Has strong rapport-building skills to become a trusted partner to your key stakeholders</li><li>Support leaders in ensuring People's KPIs are met, such as regular Performance Reviews, Compensation Reviews, etc.</li>,<h3>Must-haves:</h3><li>Proven experience in business partnering, with multiple stakeholders, across different countries</li><li>Possesses strong leadership skills and is resilience</li><li>Possesses strong customer-centric skills with a passion for service, ensuring all our interactions with people are handled professionally and with thorough attention to detail</li><li>Proven experience in strategic People Experience plans and solutions, dealing with organization strategies and complex business/People-related topics;</li><li>Strong stakeholder management, interpersonal, and communication skills with all levels of seniority in a cross-functional &amp; global environment</li><li>Effective &amp; analytical mindset, creative and pragmatic problem-solving skills with strong business acumen &amp; user-centric philosophy;</li><li>Self-driven, optimistic, and keen to work as part of a professional and closely-knit team while highly organized with excellent time management skills</li><li>Champion diversity and inclusion efforts, promoting a culture of respect and belonging</li>,<h3>Good to have:</h3><li>Experience in the travel tech and/or telco industry;</li><li>Relevant HR certifications (iHRP, CIPD, SHRM, etc);</li><li>Additional written/spoken languages.</li><div><i>We sincerely thank all applicants in advance for submitting their interest in this opportunity with Airalo. </i></div>","tags":"[\"management\"]","pubDate":"2024-06-21 15:33:43.860","link":"https://jobs.lever.co/airalo/f9e720c1-8633-43cd-aabd-0fcd26a413ec","savedDate":"2024-06-23 04:01:58.475","slug":"people-success-partner-europe-airalo-944"},{"id":7158255558,"title":"Data Analyst","company":"Airalo","image":"https://lever-client-logos.s3.us-west-2.amazonaws.com/55028a36-609c-479c-9553-d4689ff2dd8c-1669620566663.png","description":"<div><b>About Airalo</b></div><div>Alo! Airalo is the world’s first eSIM store that helps people connect in over 200+ countries and regions across the globe. We are building the next digital service that revolutionizes the telecom industry. We are a travel-tech company and an equal-opportunity environment that values and executes diversity, inclusion, and equity. Our team is spread across 50+ countries and six continents. What glues us together is our commitment to changing the way you connect<span style=\"font-size: 13.3333px\">. </span></div><div><br></div><div><b>About you</b></div><div>We hope that you care deeply about the quality of your work, the intrinsic worth of tasks, and the success of your team. You are self-disciplined and do not require micromanagement in terms of your skillset and work ethic. You do your best to flourish as an individual every day while working hard to foster a collaborative team environment. You believe in the importance of being — and staying — authentic, honest, positive, and kind. You are a good interlocutor with clear and concise communication. You are able to manage multiple projects, have an analytical mind, pay keen attention to detail, and love to get your hands dirty. You are cognizant, tolerant, and welcoming of vulnerabilities and cultural differences.</div><div><br></div><div><b>About the Role</b></div><div><b>Position</b>: Full-time / Employee</div><div><b>Location:</b>&nbsp;Remote-first </div><div><b>Benefits:</b>&nbsp;Health Insurance, work-from-anywhere stipend, annual wellness &amp; learning credits, annual all-expenses-paid company retreat in a gorgeous destination &amp; other benefits</div><div><br></div><div><span style=\"font-size: 11pt\">As a Data Analyst, you have strong analytical and technical skills and are comfortable collaborating with various departments including Product, Engineering, Design, Growth, Finance, and Partnerships. You will provide actionable insights to drive decision-making and help shape the Airalo strategy and roadmaps across departments. You will play a key role in further growing our Data Analytics function and help us define best practices to improve our ways of working. You’ll be the go-to person in the team to run ad-hoc analyses, find root causes of problems, and evaluate business impact.</span></div><h3>Responsibilities include, but are not limited to: </h3><li>Collaborate with multiple departments to understand their data analysis needs and provide strategic insights to support decision-making, define strategy and prioritize roadmaps</li><li>Serve as the primary point of contact for ad-hoc analyses, root cause analysis, and evaluation of business impact across the company</li><li>Partner with Product, Engineering, and Design to define tracking, AB testing strategy, and measure post-launch feature and product impact</li><li>Develop data dashboards, charts, and visual aids to support decision-making across departments</li><li>Convey insights through both reports and visual presentations.</li><li>Create documentation associated with the dashboards highlighting definitions, event schema, data models, analyses</li><li>Gather and cleanse data from primary and secondary sources</li>,<h3>Must-haves: </h3><li>4+ years of experience in a hands-on analytics role</li><li>Strong ability to synthesize data into actionable insights</li><li>Strong SQL proficiency and understanding of data modeling concepts</li><li>Experience with using data visualization tools and analytics tools</li><li>A clear understanding of A/B testing methodologies</li><li>Demonstrate curiosity and data fluency</li><li>Bachelor’s degree (or equivalent) in mathematics, computer science, economics, or statistics</li>,<h3>Good to haves:</h3><li>Experience using QuickSight, CleverTap, Hotjar, Google Analytics</li><li>Experience with consumer and SaaS products</li><li>Prior work experience in telecommunications</li><li>Knowledge of eSIM and GSMA-related technologies and services</li><div>If you are interested in this position, <b>please apply via the link.</b></div><div><br></div><div><i>We sincerely thank all applicants in advance for submitting their interest in this opportunity with Airalo. </i></div>","tags":"[\"Finance\",\"management\",\"engineering\"]","pubDate":"2024-06-21 14:46:41.883","link":"https://jobs.lever.co/airalo/f68cbd59-7c1b-486e-acb2-7708eb6c52a4","savedDate":"2024-06-23 04:01:58.475","slug":"data-analyst-airalo-9946"},{"id":9000435637,"title":"Senior Product Manager, Graphing","company":"Bio Render","image":"https://lever-client-logos.s3-us-west-2.amazonaws.com/0f4b434e-502f-4390-9819-c058d43028c1-1595260531860.png","description":"<div>At BioRender, our mission is to accelerate the world’s ability to learn, discover and communicate science. We are passionate about democratizing science communication in order to accelerate scientific discovery and understanding. We're looking for amazing people to help create the world’s go-to-place and platform where science is communicated. Come join us!</div><div><br></div><div><span style=\"font-size: 11pt\">You can think of BioRender as the “Figma or Canva for scientists,” with a suite of web-based graphics communication products that empower scientists to create beautiful scientific visuals and presentations with ease.</span></div><div><br></div><div><span style=\"font-size: 11pt\">The Graphing team’s mission is to expand what scientists are able to communicate in BioRender through the easiest-to-use and most delightful graphing and statistical analysis solution. Graphing is a new product currently in open beta, and we’re looking for a Product Manager to lead the strategic direction for the product that helps scientists analyze, visualize and present data to achieve product market fit. This is an exciting opportunity for a product builder who loves the strategic questions that come from scaling a product from 0-1, to 1-N!</span></div><h3>What you'll do at BioRender: </h3><li>Within the first 90 days, become an expert on our users, their usage behaviors and workflows, and the market landscape. Understanding the user, the market, and our product offering will be critical to your success</li><li>Own the strategy for the Graphing product and how it integrates with the rest of the BioRender product suite.</li><li>Talk to users and obsess over user feedback and usage data of beta users to build the right \t\t\t\tfeature set that will create raving fans. </li><li>Collaborate with Design and Data Science to determine what will make BioRender Graphing a critical part of industry scientists’ software stack.</li><li>Partner with marketing on the go to market strategy for the product, determining how best to spread awareness for the product to grow usage</li><li>Drive new feature development to grow user engagement KPIs&nbsp;</li><li>Launch experiments to reduce barriers to entry into the product and increase our funnel conversion rate for new and returning users</li><li>Contribute to the product strategy of BioRender. As we move from a single product company to a multiple product company, the Graphing PM will be integral to formulating our overall product expansion strategy.&nbsp;</li>,<h3>Our Ideal Fit: </h3><li>4+ years of product management experience</li><li>Proven track record of launching 0-1 products and achieving product-market fit in a market with incumbent players&nbsp;</li><li>You’ve owned the end-to-end user experience for an entire product. You have experience developing, launching and iterating a highly ambiguous and broad product surface area that may take multiple months to get adoption.</li><li>You have clear examples of transforming ambiguous user problems into clear roadmaps, and can draw on stories where you had to make a call between two divergent paths</li><li>You have experience using user quantitative (e.g., metrics, analytics) and qualitative insights (e.g., research, user feedback) to inform product prioritization and decision-making</li><li>Excellent communication skills with the ability to convey complex ideas to technical and non-technical audiences</li><li>You are detail oriented and user obsessed</li>,<h3>Nice to haves:</h3><li>Background in statistics or data science is a plus. At least, statistics or math is exciting to you. You will not need to be an expert in statistics and will partner with a data scientist, but statistics is a core part of the product and user research, so you will need to be comfortable with learning about users’ </li><li>Educational background in life sciences</li><div><br></div><div>Note: We recognize that career paths vary, and your unique journey may have equipped you with the necessary skills even if you don’t meet all of the criteria above. If you believe you have what it takes to excel in this role, we encourage you to apply!</div><div>Check out our candidate resource - <a href=\"https://biorender.notion.site/Engineering-Product-Design-66275a3c2cca42e39234412881621467\" class=\"postings-link\">Engineering, Product &amp; Design at BioRender!</a>&nbsp;</div><div>You can also read more about the <a href=\"https://biorender.notion.site/BioRender-Candidate-Resources-8255c155797f442a950720a33b4764d5\" class=\"postings-link\">BioRender interview process and FAQs here</a>! </div><div><br></div><div>Check out what it's like to work at BioRender in <a href=\"https://biorender.notion.site/biorender/Working-at-BioRender-as-a-Canada-Based-Employee-f6e12ab844154bb9948b22b32e3f0c70\" class=\"postings-link\">Canada</a> and the <a href=\"https://biorender.notion.site/biorender/Working-at-BioRender-as-a-U-S-Based-Employee-4ab2cc8e48f546f89aa98c318bccebc9\" class=\"postings-link\">US</a>!</div><div><br></div><div>#LI-KS1</div>","tags":"[\"management\",\"engineering\",\"B2C\"]","pubDate":"2024-06-21 13:46:27.017","link":"https://jobs.lever.co/biorender/ccf86dff-b665-435e-9766-63a029ea876a","savedDate":"2024-06-23 04:01:58.476","slug":"senior-product-manager-graphing-bio-render-6563"},{"id":2997460216,"title":"Social Media & Influencer Marketing Specialist (Singapore)","company":"Airalo","image":"https://lever-client-logos.s3.us-west-2.amazonaws.com/55028a36-609c-479c-9553-d4689ff2dd8c-1669620566663.png","description":"<div><b>About Airalo</b></div><div>Alo! Airalo is the world’s first eSIM store that helps people connect in over 200+ countries and regions across the globe. We are building the next digital service that revolutionizes the telecom industry. We are a travel-tech company and an equal-opportunity environment that values and executes diversity, inclusion, and equity. Our team is spread across 50+ countries and six continents. What glues us together is our commitment to changing the way you connect<span style=\"font-size: 13.3333px\">. </span></div><div><br></div><div><b>About you</b></div><div>We hope that you care deeply about the quality of your work, the intrinsic worth of tasks, and the success of your team. You are self-disciplined and do not require micromanagement in terms of your skillset and work ethic. You do your best to flourish as an individual every day while working hard to foster a collaborative team environment. You believe in the importance of being — and staying — authentic, honest, positive, and kind. You are a good interlocutor with clear and concise communication. You are able to manage multiple projects, have an analytical mind, pay keen attention to detail, and love to get your hands dirty. You are cognizant, tolerant, and welcoming of vulnerabilities and cultural differences.</div><div><br></div><div><b>About the Role</b></div><div><b>Position</b>: Full-time / Employee</div><div><b>Location:</b>&nbsp;Remote-first </div><div><b>Benefits:</b>&nbsp;Health Insurance, work-from-anywhere stipend, annual wellness &amp; learning credits, annual all-expenses-paid company retreat in a gorgeous destination &amp; other benefits</div><div><br></div><div>Airalo is seeking a talented and highly motivated <b>Social Media and Influencer Marketing Specialist</b> to join our APAC marketing team and grow the <b>Singapore market</b>.</div><div>You will be responsible for guiding the strategy and development of our entire social media ecosystem in your market and you will develop and execute influencer marketing campaigns to raise brand awareness, drive user engagement and boost conversions.</div><div>This role offers an exciting opportunity to work with some of the most influential voices in the travel and tech industry.</div><h3>Responsibilities include but are not limited to:</h3><li><b>Strategy Development and Campaign Planning:</b> Brainstorm, develop and execute end-to-end influencer marketing campaigns aligned with Airalo's goals and target audience.</li><li><b>Identify and Recruit Influencers:</b> Partner with relevant <b>Singapore</b> influencers, content creators and/or agencies to create authentic and engaging content that showcases Airalo's products.</li><li><b>Social Media Strategy:</b> Develop and execute an effective social media strategy tailored to the Singaporean market to increase brand awareness, engagement, and lead generation.</li><li><b>Community Engagement:</b> Monitor and actively engage with the Airalo community on social media platforms, respond to comments, questions, and feedback promptly, and build positive relationships with followers.</li><li><b>Performance Analysis and Reporting:</b> Monitor, analyze performance and prepare reports on the ROI and effectiveness of influencer marketing efforts, including KPIs and metrics</li><li><b>Budget Management:</b> Effectively manage the budget allocated for influencer marketing campaigns, ensuring efficient use of resources.</li><li><b>Compliance and Contracts:</b> Ensure that influencer partnerships comply with legal regulations and company policies. Manage influencer contracts and negotiations.</li><li><b>Crisis Management:</b> Handle potential social media crises effectively, maintain a positive brand image, and address customer concerns professionally</li><li><b>Stay Up-to-Date:</b> Stay informed about industry trends, emerging influencers, and new platforms to continuously adapt and enhance Airalo's influencer marketing strategies.</li>,<h3>Must-haves:</h3><li>At least 3+ years of experience in a<b> Social Media and Influencer Marketing</b> role, preferably in a startup/scale up context</li><li>Strong knowledge of the <b>Singapore market</b></li><li>General marketing experience in brand management, content, social media, influencer and market insights with an in-depth understanding of the social media and digital space</li><li>Excellent knowledge of the main social media platforms (with focus on Instagram, TikTok and Youtube) and any key platform used or emerging in your target market; abreast of social media best practices, and regional, and global trends</li><li>Superior internal/external communication &amp; cross-functional stakeholder management skills</li><li>Enjoying and excelling at handling multiple projects simultaneously in a complex environment</li><li>Good time management with an eye for perfection</li><li>Fluent English communication skills</li>,<h3>Good to have:</h3><li>Prior experience in the tech, travel, or telecommunications industry</li><li>A network of Singapore influencers or influencers agencies you already worked with</li><div>If you are interested in this position, <b>please apply via the link.</b></div><div><br></div><div><i>We sincerely thank all applicants in advance for submitting their interest in this opportunity with Airalo. </i></div>","tags":"[\"management\",\"legal\"]","pubDate":"2024-06-21 09:57:29.586","link":"https://jobs.lever.co/airalo/b21359e4-b79e-4007-83c7-58e841626117","savedDate":"2024-06-23 04:01:58.476","slug":"social-media-influencer-marketing-specialist-singapore-airalo-6979"},{"id":2574569673,"title":"Social Media & Influencer Marketing Specialist (Australia)","company":"Airalo","image":"https://lever-client-logos.s3.us-west-2.amazonaws.com/55028a36-609c-479c-9553-d4689ff2dd8c-1669620566663.png","description":"<div><b>About Airalo</b></div><div>Alo! Airalo is the world’s first eSIM store that helps people connect in over 200+ countries and regions across the globe. We are building the next digital service that revolutionizes the telecom industry. We are a travel-tech company and an equal-opportunity environment that values and executes diversity, inclusion, and equity. Our team is spread across 50+ countries and six continents. What glues us together is our commitment to changing the way you connect<span style=\"font-size: 13.3333px\">. </span></div><div><br></div><div><b>About you</b></div><div>We hope that you care deeply about the quality of your work, the intrinsic worth of tasks, and the success of your team. You are self-disciplined and do not require micromanagement in terms of your skillset and work ethic. You do your best to flourish as an individual every day while working hard to foster a collaborative team environment. You believe in the importance of being — and staying — authentic, honest, positive, and kind. You are a good interlocutor with clear and concise communication. You are able to manage multiple projects, have an analytical mind, pay keen attention to detail, and love to get your hands dirty. You are cognizant, tolerant, and welcoming of vulnerabilities and cultural differences.</div><div><br></div><div><b>About the Role</b></div><div><b>Position</b>: Full-time / Employee</div><div><b>Location:</b>&nbsp;Remote-first </div><div><b>Benefits:</b>&nbsp;Health Insurance, work-from-anywhere stipend, annual wellness &amp; learning credits, annual all-expenses-paid company retreat in a gorgeous destination &amp; other benefits</div><div><br></div><div>Airalo is seeking a talented and highly motivated <b>Social Media and Influencer Marketing Specialist</b> to join our APAC team and grow the <b>Australian market</b>.</div><div>You will be responsible for guiding the strategy and development of our entire social media ecosystem in your market and you will develop and execute influencer marketing campaigns to raise brand awareness, drive user engagement and boost conversions.</div><div>This role offers an exciting opportunity to work with some of the most influential voices in the travel and tech industry.</div><h3>Responsibilities include but are not limited to:</h3><li><b>Strategy Development and Campaign Planning:</b> Brainstorm, develop and execute end-to-end influencer marketing campaigns aligned with Airalo's goals and target audience.</li><li><b>Identify and Recruit Influencers:</b> Partner with relevant <b>Australian</b> influencers, content creators and/or agencies to create authentic and engaging content that showcases Airalo's products.</li><li><b>Social Media Strategy:</b> Develop and execute an effective social media strategy tailored to the Australian market to increase brand awareness, engagement, and lead generation.</li><li><b>Community Engagement:</b> Monitor and actively engage with the Airalo community on social media platforms, respond to comments, questions, and feedback promptly, and build positive relationships with followers.</li><li><b>Performance Analysis and Reporting:</b> Monitor, analyze performance and prepare reports on the ROI and effectiveness of influencer marketing efforts, including KPIs and metrics</li><li><b>Budget Management:</b> Effectively manage the budget allocated for influencer marketing campaigns, ensuring efficient use of resources.</li><li><b>Compliance and Contracts:</b> Ensure that influencer partnerships comply with legal regulations and company policies. Manage influencer contracts and negotiations.</li><li><b>Crisis Management:</b> Handle potential social media crises effectively, maintain a positive brand image, and address customer concerns professionally</li><li><b>Stay Up-to-Date:</b> Stay informed about industry trends, emerging influencers, and new platforms to continuously adapt and enhance Airalo's influencer marketing strategies.</li>,<h3>Must-haves:</h3><li>At least 3+ years of experience in a <b>Social Media and Influencer Marketing</b> role, preferably in a startup/scale up context</li><li>Strong knowledge of the <b>Australian market</b></li><li>General marketing experience in brand management, content, social media, influencer and market insights with an in-depth understanding of the social media and digital space</li><li>Excellent knowledge of the main social media platforms (with focus on Instagram, TikTok and Youtube) and any key platform used or emerging in your target market; abreast of social media best practices, and regional, and global trends</li><li>Superior internal/external communication &amp; cross-functional stakeholder management skills</li><li>Enjoying and excelling at handling multiple projects simultaneously in a complex environment</li><li>Good time management with an eye for perfection</li>,<h3>Good to have:</h3><li>Prior experience in the tech, travel, or telecommunications industry</li><li>A network of Australian influencers or influencer agencies you already worked with</li><div>If you are interested in this position, <b>please apply via the link.</b></div><div><br></div><div><i>We sincerely thank all applicants in advance for submitting their interest in this opportunity with Airalo. </i></div>","tags":"[\"management\",\"legal\"]","pubDate":"2024-06-21 09:42:48.537","link":"https://jobs.lever.co/airalo/3223250f-e69e-43de-9013-12d871b492a4","savedDate":"2024-06-23 04:01:58.476","slug":"social-media-influencer-marketing-specialist-australia-airalo-7453"},{"id":4070499177,"title":"Customer Success Manager (Remote)","company":"Pluto Card","image":"https://pbs.twimg.com/profile_images/1520019984780513281/qnVtutKu_400x400.jpg","description":"<h3><strong>About Pluto</strong></h3><p>Pluto is the Enterprise Spend Management platform for MENA serving the $30 Trillion+ B2B Payments market. Pluto has been awarded the \"Corporate solutions of the year\" by the Middle Eastern Fintech Association.</p><p>Pluto is backed by some of Silicon Valley’s top-tier venture capital firms. We’ve raised $7M Seed from top investors and operators, including founders from Ramp, Airbase, Plaid, Italic &amp; Senior Leadership at Shopify, Cash App, <a href=\"http://checkout.com/\" rel=\"nofollow noreferrer noopener\" class=\"external\">Checkout.com</a>, Alloy and some of the worlds most successful FinTech VCs like GFC, Graph Ventures, Soma Capital, Adapt Ventures, amongst others who’ve trusted us 🤩</p><p>With the vision of building a modern financial operating system for businesses in MENA, we’re at the tipping point of a fintech revolution. We’re a lean but impactful team that dreams big and believes in making the impossible happen - and we are looking for someone equally motivated who wants to make their mark and help us expand our horizons.</p><p></p><h3>About this role</h3><p>We are hiring for an experienced Account Manager. You will be responsible for managing ensuring that Pluto's current clients continuously increase in usage and be the front facing lead to increase adoption of our platfor. You will work directly with the COO and set the bar for what excellent account management looks like.</p><p>Pluto is growing rapidly, with over 600+ businesses using Pluto in the UAE, including some of the largest enterprise customers with over 1000 employees regularly using Pluto. When a client purchases Pluto, they must go through change management—both at the finance team level and at the broader company-wide adoption level.</p><p>You will be responsible for the change management process, onboarding, implementation, and success of Pluto’s clients. </p><p>Your KPIs will be driven by the fastest time to successfully implement Pluto across the company and positive Net Revenue Retention.</p><p></p><h3>How this role within Pluto</h3><p>You will be joining as a founding core team member of Pluto’s account management practice. This role will be responsible for ensuring positive net revenue retention across all of Pluto’s customers including free, pro &amp; essential tier customers.</p><p>Our engineering and product teams ship products at a lightning-fast cadence. It will be your responsibility to ensure the most successful enterprises in MENA adopt Pluto for finance control and compliance across their companies.</p><p></p><h3>Your responsibilities:</h3><ol> <li>Be the directly responsible individual (engagement manager) for Pluto’s clients.</li> <li>Be the go-to relationship manager for our clients.</li> <li>Ensure positive net revenue retention through upselling and driving adoption across the organization.</li> <li>Carry out training and onboarding sessions for customers and their employees as needed.</li> <li>Drive revenue by owning renewals, use case expansions, and overall growth via continuous engagement, emails, webinars, and other channels.</li> <li>Be the subject matter expert for prospects during pre-sales calls and meetings.</li> <li>Collaborate with product, design, and engineering teams during client engagements to carry out implementations of feature requests and custom integrations.</li> <li>Surface thematic product gaps and needs within your book of business.</li> </ol><h3>Requirements: </h3><h3>You are a good fit if..</h3><ol> <li>You have previously been in similar roles for at least 3+ years within B2B SaaS software</li> <li>You can go deep into understanding complex products and have the ability to effectively communicate value to customers</li> <li>You have the ability to take a systematic, process driven approach to activating and retaining clients</li> <li>You have a proven ability to build and maintain relationships with customers</li> <li>You are confident and don’t shy away from negotiations or upsells with Finance Leaders (VPs, Directors) and Controllers</li> <li>You have the ability to work cross functionality with engineering &amp; product, and communicate your requirements in a way that is easily understood</li> <li>You are on top of your inbox, have time management skills and leverage modern tools to ensure you are effective</li> <li>You understand that startups require to fill many roles and maintain high energy all throughout 💪🏽💪🏽💪🏽</li> <li>Demonstrated pipeline maintenance skills (Farming) using Sales tools such as Hubspot, Salesloft etc.</li> </ol><h3></h3><h3>Optional, but great to have:</h3><ol> <li>Basic understanding of accounting and finance ecosystem</li> <li>Experience utilizing common tools within the CS tech stack (Hubspot etc.)</li> </ol><h3>Benefits: </h3><h3>Benefits</h3><ul> <li>Hybrid and flexible work culture</li> <li>Competitive Base Pay</li> <li>Commissions &amp; bonuses on upsells and positive net revenue retention</li> </ul>","tags":"[\"Finance\",\"management\",\"engineering\",\"B2B\"]","pubDate":"2024-06-21 00:00:00.000","link":"https://apply.workable.com/pluto-card/j/DB0A89C846","savedDate":"2024-06-23 04:01:58.474","slug":"customer-success-manager-remote-pluto-card-295"},{"id":4120161209,"title":"Compliance Operations Analyst (KYB, AML, KYC)","company":"Pluto Card","image":"https://pbs.twimg.com/profile_images/1520019984780513281/qnVtutKu_400x400.jpg","description":"<p><strong>About Pluto</strong></p><p>Pluto is the Enterprise Spend Management platform for MENA serving the $30 Trillion+ B2B Payments market. Pluto has been awarded the \"Corporate solutions of the year\" by the Middle Eastern Fintech Association.</p><p>Pluto is backed by some of Silicon Valley’s top-tier venture capital firms. We’ve raised $7M Seed from top investors and operators, including founders from Ramp, Airbase, Plaid, Italic &amp; Senior Leadership at Shopify, Cash App,&nbsp;<a href=\"http://checkout.com/\" target=\"_blank\" rel=\"nofollow noreferrer noopener\" class=\"external\">Checkout.com</a>, Alloy and some of the worlds most successful FinTech VCs like GFC, Graph Ventures, Soma Capital, Adapt Ventures, amongst others who’ve trusted us 🤩</p><p>With the vision of building a modern financial operating system for businesses in MENA, we’re at the tipping point of a fintech revolution. We’re a lean but impactful team that dreams big and believes in making the impossible happen - and we are looking for someone equally motivated who wants to make their mark and help us expand our horizons.</p><p></p><p><strong>About the Role </strong></p><p>We are seeking a detail-oriented and experienced Compliance Operations Analyst to join our dynamic team. The ideal candidate will be responsible for Know Your Customer (KYC), Know Your Business (KYB), and Request for Information (RFI) management. This role is crucial in ensuring that Pluto meets regulatory requirements and maintains the highest standards of compliance.</p><p></p><p><strong>Key Responsibilities:</strong></p><ul> <li><strong>KYC Management:</strong></li> <ul> <li>Conduct thorough due diligence and verification of customer identities.</li> <li>Review and analyze customer information and documentation to ensure compliance with regulatory standards.</li> <li>Monitor and assess the risk level of customers and take appropriate actions.</li> </ul> <li><strong>KYB Management:</strong></li> <ul> <li>Perform business verification processes for corporate clients.</li> <li>Analyze business documentation, including registration details, financial statements, and beneficial ownership.</li> <li>Ensure all business clients adhere to compliance policies and procedures.</li> </ul> <li><strong>RFI Management:</strong></li> <ul> <li>Handle requests for information from regulatory bodies and internal stakeholders.</li> <li>Collect, organize, and present data in response to compliance-related inquiries.</li> <li>Maintain accurate records of all RFI activities and ensure timely responses.</li> </ul> <li><strong>Compliance Monitoring and Reporting:</strong></li> <ul> <li>Prepare and submit reports on compliance onboarding activities and findings.</li> <li>Assist in the development and implementation of compliance policies and procedures.</li> </ul> <li><strong>Customer Relationships</strong></li> <ul> <li>Develop a strong relationship with customers and promote quicker onboarding</li> <li>Work closely with other departments to ensure a cohesive approach to compliance onboarding of customers</li> <li>Provide training and support to customers for all compliance related matters</li> <li>Work closely with account management teams to ensure healthy client relationship</li> <li>Work closely with product and engineering teams to improve our processes continuously</li> </ul> </ul><h3>Requirements: </h3><ul> <li>Minimum of 3 years of experience in a compliance role, preferably within the fintech or financial services industry.</li> <li>Strong knowledge of KYC, KYB, and RFI processes and regulations.</li> <li>Excellent analytical skills and attention to detail.</li> <li>Proficiency in using compliance software and tools.</li> <li>Strong communication and interpersonal skills.</li> <li>Ability to work independently and as part of a team.</li> </ul><h3>Benefits: </h3><ul> <li>Remote Friendly Workplace </li> <li>Frequent team off sites!</li> <li>Bonuses on exceptional performance</li> </ul>","tags":"[\"management\",\"engineering\",\"B2B\"]","pubDate":"2024-06-21 00:00:00.000","link":"https://apply.workable.com/pluto-card/j/59E323B837","savedDate":"2024-06-23 04:01:58.474","slug":"compliance-operations-analyst-kyb-aml-kyc-pluto-card-4734"},{"id":4922330845,"title":"Sr. Backend Software Engineer (Remote) - México","company":"Empower","image":"https://lever-client-logos.s3.us-west-2.amazonaws.com/2e1a369c-b58f-41ac-8d86-4b0a77695e68-1687915522032.png","description":"<div><b style=\"font-size: 24px\">EMPOWER OVERVIEW</b></div><div><br></div><div>Empower is a high-growth financial technology company on a mission to expand access to fair credit to give anyone in the world the opportunity to improve their financial security and mobility. We dream up and launch one-of-a-kind features that help our members get money instantly whenever they need it, save for the future, and rewrite their financial story. Our members see Empower Cash Advance as a life-saver, Empower Automatic Savings as a game-changer, and the new Empower Thrive line of credit as a lifeline to low-cost borrowing and the only practical path to building good credit.</div><div><br></div><div>Empower México is a new venture for the company. We offer small loans ranging from $150 to $2,000 MXN to help Mexican customers in a pinch, using non-traditional data to underwrite customers. </div><div><br></div><div>Empower is backed by Sequoia Capital, Blisce, and Icon Ventures. Are we the next great place to grow your impact and accelerate your career? We think so:</div><div><br></div><div>Inc. ranked Empower #56 in the 2023 Inc. 5000 list of the fastest-growing private companies in the US (#55 in 2022). Forbes put Empower on its 2023 list of America's Best Startup Employers. Fast Company recognized the new Empower Thrive line of credit in their 2022 list of the Next Big Things in Tech. </div><div><br></div><div><b style=\"font-size: 18px\">THE EMPOWER WAY</b></div><div><b>Great Expectations</b>: We come up with bold, audacious goals for ourselves and go all out for impact</div><div><b>Owner Mindset</b>: We give every employee latitude to act independently, make smart choices, and move the business forward</div><div><b>Spirited Debate</b>: We love skeptics and seek counter opinions to challenge our personal assumptions and expand our view</div><div><b>Customer Obsession: </b>We listen to understand, empathize, and create a memorable, rewarding experience for our community</div><div><b>Inclusive Collaboration</b>: We believe diverse teams make the best decisions, and we strive to give diverse voices a seat at the table</div><div>N<b>o Jerks Allowed</b>: We value our relationships and take the time to build trust and connection and communicate respectfully</div><div><b>&nbsp;</b></div><div><b>&nbsp;</b></div><div><b style=\"font-size: 18px\">WHAT EMPOWER OFFERS</b></div><div><br></div><div>Competitive salary</div><div>Generous equity package</div><div>Full healthcare and dental benefits</div><div>Technology&nbsp; expense reimbursement</div><div>Work&nbsp; from anywhere</div><div><br></div><div><b style=\"font-size: 18px\">JOB DESCRIPTION</b></div><div>As a Backend Server Software Engineer, you’ll work on the engine that powers the Empower apps and business. You’ll engage with a collaborative, high powered team to develop solutions and lead product engineering on projects with a reach of millions. The solutions you’ll build will be robust, secure and easy to understand both for our users and your engineering peers. You’ll take end to end ownership of new features and product lines shaping work in early stages, building, deploying and running post deployment analysis to ensure we’re hitting our goals.</div><div><br></div><div>Travel for company offsites is expected at a minimum 2 times a year.</div><div><br></div><h3>Key Responsibilities</h3><li>Designing, building, and deploying server application code that interfaces with 3rd party clients and Empower</li><li>Implementing secure coding standards in accordance with the Empower Secure Development Policy</li><li>Perform on-going security testing and code review to improve software security</li><li>Monitoring the performance of the Empower server application and applying corrective action through bug fixing and improved solutions</li><li>Minimizing defects and improving reliability through: Development of automated tests, manual test validation, development of fit for purpose architecture and code, contributing to PRs</li><li>Developing and maintaining the server app build and deployment pipeline</li><li>Collaborating cross-functionally to define, design and ship new features that create customer and business value</li><li>Working with business and operations stakeholders for the definition and development of business requirements</li><li>Contributing to server/client contract API definition</li><li>Architecting solutions that interface into 3rd parties and the Empower México Android app</li><li>Maximizing effective development and identifying new technology opportunities by: Keeping across .NET development announcements, being across community best practice, discovering and evaluating new technologies</li><li>Participating in the server ops on call schedule</li>,<h3>Candidate Qualifications</h3><li>Bachelor degree or greater within Computer Science, Software Engineering or a related subject</li><li>3+ years developing web APIs within .NET (C#)</li><li>Working experience constructing and optimizing MicrosoftSQL queries using ORMs such as Entity Framework</li>,<h3>Preferred Qualifications</h3><li>Worked on a “zero to one” project taking a business from an idea to a profitable venture</li><li>Experience scaling a solution from tens of thousands to millions of customers (Scaling databases, queues, caching, monitoring and security with Azure)</li><li>Contributed to and/or owned a large, complex, critical banking or lending solution</li><div>At Empower, we hire for people that push themselves to understand others and seek out ways to challenge their personal assumptions. Our hope is that by fostering such an environment, we strengthen our business and relationships by putting people first. We are committed to building a diverse, inclusive, and equitable workspace where everyone (regardless of age, education, ethnicity, gender, sexual orientation, or any personal characteristics) feels like they belong. Even if your experience doesn’t exactly match up to our job description, you should feel empowered to apply regardless!&nbsp;</div>","tags":"[\"engineering\",\"database\"]","pubDate":"2024-06-20 21:58:10.666","link":"https://jobs.lever.co/empower.me/dac4d3cf-8c62-478f-8c18-5fbb3216cdfe","savedDate":"2024-06-23 04:01:58.475","slug":"sr-backend-software-engineer-remote-m-xico-empower-3122"},{"id":2980556962,"title":"Senior Paid Search Specialist, User Experience","company":"Airalo","image":"https://lever-client-logos.s3.us-west-2.amazonaws.com/55028a36-609c-479c-9553-d4689ff2dd8c-1669620566663.png","description":"<div><b>About Airalo</b></div><div>Alo! Airalo is the world’s first eSIM store that helps people connect in over 200+ countries and regions across the globe. We are building the next digital service that revolutionizes the telecom industry. We are a travel-tech company and an equal-opportunity environment that values and executes diversity, inclusion, and equity. Our team is spread across 50+ countries and six continents. What glues us together is our commitment to changing the way you connect<span style=\"font-size: 13.3333px\">. </span></div><div><br></div><div><b>About you</b></div><div>We hope that you care deeply about the quality of your work, the intrinsic worth of tasks, and the success of your team. You are self-disciplined and do not require micromanagement in terms of your skillset and work ethic. You do your best to flourish as an individual every day while working hard to foster a collaborative team environment. You believe in the importance of being — and staying — authentic, honest, positive, and kind. You are a good interlocutor with clear and concise communication. You are able to manage multiple projects, have an analytical mind, pay keen attention to detail, and love to get your hands dirty. You are cognizant, tolerant, and welcoming of vulnerabilities and cultural differences.</div><div><br></div><div><b>About the Role</b></div><div><b>Position</b>: Full-time / Employee</div><div><b>Location:</b>&nbsp;Remote-first </div><div><b>Benefits:</b>&nbsp;Health Insurance, work-from-anywhere stipend, annual wellness &amp; learning credits, annual all-expenses-paid company retreat in a gorgeous destination &amp; other benefits</div><div><br></div><div>As a <b>Senior Paid Search Specialist, User Experience</b>, you'll steer search strategy, centralize processes, and own growth tools, data, and reporting infrastructure supporting mobile and web search acquisition strategies across diverse regions on paid search channels.</div><div>Reporting to the <b>Growth Director, User Experience</b>, you'll lead an outcome-driven approach to app and web marketing, ensuring our paid acquisition efforts on search platforms are top-notch. With a high bar for quality, you'll emphasize attention to detail and employ experimentation frameworks to set up and optimize campaigns effectively. Support to regional counterparts will be provided through sharing best practices, learnings, and mentorship, fostering a culture of shared learning.</div><h3>Responsibilities include but are not limited to:</h3><li>Developing and executing mobile app and web acquisition campaigns across various search marketing channels.</li><li>Continuously supporting regions in testing and experimenting on acquisition campaigns to drive cost-effective user growth, meeting KPIs such as CAC, ROAS, CPS, CPP, LTV, AOV, and payback periods.</li><li>Owning the data and reporting infrastructure, analyzing user acquisition and engagement data to inform strategy, and being the go-to resource for data-related queries.</li><li>Collaborating cross-functionally with product, engineering, and brand teams to identify levers for improvement and opportunities to enhance ROI.</li><li>Conducting market and competitor research to identify innovation opportunities supporting growth targets.</li><li>Staying up-to-date with industry trends, especially in travel, and best practices in mobile app acquisition.</li>,<h3>Must-haves:</h3><li>7+ years of experience managing mobile app acquisition campaigns at scale in performance-driven, competitive verticals, with deep MarTech/MarOps experience.</li><li>Deep hands-on expertise in Search channels (Google Search, Display, Video, Discovery, Performance Max, etc.).</li><li>Strong analytical skills and MarTech expertise across various analytics and MMP tools (e.g., Google Analytics, Google Tag Manager, Looker, AppsFlyer, Adjust, etc.).</li><li>Experience in the digital advertising and mobile space, managing $MM annual ad budgets and maximizing ROI across channel mixes.</li><li>Fluency in English with impeccable verbal and written communication skills.</li><li>Superior internal and external communication and cross-functional stakeholder management skills.</li><li>Good time management with an eye for perfection and a strong operational background.</li>,<h3>Good to have:</h3><li>Prior experience in the tech, travel, or telecommunications industry.</li><li>Ad platform and analytical platform certifications.</li><li>Working knowledge of other search platforms like Bing, Naver, etc. is a plus.</li><li>Knowledge of eSIM and GSMA-related technologies and services.</li><div>If you are interested in this position, <b>please apply via the link.</b></div><div><br></div><div><i>We sincerely thank all applicants in advance for submitting their interest in this opportunity with Airalo. </i></div>","tags":"[\"management\",\"engineering\"]","pubDate":"2024-06-20 20:14:01.698","link":"https://jobs.lever.co/airalo/69d0a0fc-162d-4f30-95d1-203f41889be6","savedDate":"2024-06-23 04:01:58.475","slug":"senior-paid-search-specialist-user-experience-airalo-3516"},{"id":3394789139,"title":"Loan Processor","company":"Backflip","image":"https://lever-client-logos.s3.us-west-2.amazonaws.com/2616694d-50ee-4ca0-8184-ecbfb6dbe8a9-1686066452569.png","description":"<div><b>Come help us change residential real estate investing for the better!</b></div><div><br></div><div><b>Backflip</b> is a venture-backed real estate FinTech company that supports entrepreneurs to acquire and renovate single family homes, thereby reinvigorating the housing supply and their local communities. The company offers purpose-built technology and capital products to source, analyze and finance residential real estate investments. Backflip is an all-in-one platform providing entrepreneurs with the technology, data, and financing strategies that allows them to scale their businesses.</div><div><br></div><div>Backflip is seeking a <b>Loan Processor </b>to execute the lending process from term sheet through final review completion. Backflip originates real estate investment loans (not consumer loans). As an early addition to this team, this individual will play a critical role in ensuring Backflip has a best-in-class processing operation that is borrower-friendly, detail oriented, operationally efficient, organized and designed to scale. They will also play a key role in ensuring Backflip’s Culture continues to be enlivened in the operation.&nbsp;&nbsp;</div><div><br></div><div>This is a rare opportunity to get in on the ground floor (~60 person team) working directly with executives in a fast-paced and well-capitalized startup (Series A).</div><div><br></div><div>All Backflip positions are remote (US based). Like the people we serve, we believe being free to create wherever you’re most inspired is one of life’s greatest joys. It’s better for individuals, for the community, and for fostering great work to emerge. With our work-from-anywhere approach, Backflip brings together a diverse team of individuals, with passions for innovation, art, coding, AI, data, finance, film, real estate, the environment, learning and teaching. Together, we're moving fast.</div><div><br></div><div><b>Come help us change residential real estate investing for the better!</b></div><div><br></div><div><b>Backflip</b> is a venture-backed real estate FinTech company that supports entrepreneurs to acquire and renovate single family homes, thereby reinvigorating the housing supply and their local communities. The company offers purpose-built technology and capital products to source, analyze and finance residential real estate investments. Backflip is an all-in-one platform providing entrepreneurs with the technology, data, and financing strategies that allows them to scale their businesses.</div><div><br></div><div>Backflip is seeking a <b>Loan Processor </b>to execute the lending process from term sheet through final review completion. Backflip originates real estate investment loans (not consumer loans). As an early addition to this team, this individual will play a critical role in ensuring Backflip has a best-in-class processing operation that is borrower-friendly, detail oriented, operationally efficient, organized and designed to scale. They will also play a key role in ensuring Backflip’s Culture continues to be enlivened in the operation.&nbsp;&nbsp;</div><div><br></div><div>This is a rare opportunity to get in on the ground floor (~60 person team) working directly with executives in a fast-paced and well-capitalized startup (Series A).</div><div><br></div><div>All Backflip positions are remote (US based). Like the people we serve, we believe being free to create wherever you’re most inspired is one of life’s greatest joys. It’s better for individuals, for the community, and for fostering great work to emerge. With our work-from-anywhere approach, Backflip brings together a diverse team of individuals, with passions for innovation, art, coding, AI, data, finance, film, real estate, the environment, learning and teaching. Together, we're moving fast.</div><div><br></div><div><span style=\"font-size: 7.5pt\">*The Compensation figure above includes base salary + variable, and is based on a variety of factors including prior experience. In addition to a competitive market salary, Backflip employees receive equity stock options, 100% paid health care, a 401K + company match, among other industry-leading benefits.</span></div><h3>This candidate will champion Backflip’s culture & Core Values:</h3><li>Raise the standard of what is possible</li><li>Embrace being the novice to become the master</li><li>Work only with those who want the best for us</li><li>Communicate quickly, naturally and with radical candor</li><li>Test new things to invent and challenge the status quo</li><li>Today, nay now!</li><h3>Primary Responsibilities</h3><li>Process mortgage loan originations for residential investment properties in compliance with Backflip’s Credit Policy</li><li>Manage third parties to collect and verify documents + complete pre-closing requirements (title companies, appraisers, etc.)</li><li>Ensure an exceptional Member Experience by providing proactive communication on the status of their loan and timely responses to questions during loan processing</li><li>Communicate effectively across the teams involved in the funnel (sales, underwriting, closing, post-closing)</li><li>Review and analyze documents against Backflip’s Credit Policy; flag and mitigate discrepancies</li><li>Help Backflip’s Capital Markets team clear conditions and sell loans to third party investors</li><li>Contribute to the further implementations of standard operating procedures designed to scale operations in harmony with other departments</li><li>Enliven the company culture to ensure we deliver on our mission to the members and our peers</li><li>Other duties as assigned, including cross-departmental projects and initiatives</li><div><br></div><div><i>This role will evolve as the company grows; there will be various tasks that fall outside of the responsibilities above. </i></div><h3>Qualifications - Role Specific</h3><li>3+ years of experience in mortgage loan processing, including coordinating with 3rd parties (title companies, appraisers, etc.)</li><li>1+ year of remote work experience in a customer facing role</li><li>Prior closing experience is a plus</li><li>Experience with short-term bridge loans or construction loans is a plus</li><li>Prior experience in a customer facing role and ability to offer an elevated customer experience</li><li>Interest in real estate investing and excited about understanding our member’s investment journey</li><li>Prior work at a high-growth start-up is a plus</li><li>Experience with real estate renovations and project management is a plus</li><li>General understanding of basic real estate investment concepts (or demonstrated desire to learn); comfortable performing basic math calculations</li><li>Exemplary computer skills - demonstrated ability and desire to learn new technologies (we use Slack + Notion + Google Workspace + Front + HubSpot + more)</li><li>Basic spreadsheet skills (Excel; Google Sheets)</li><h3>People That Thrive at Backflip Have…</h3><li>A desire to learn and grow with the company; propensity to “think like an owner”</li><li>An execution-oriented “one-team” mindset with motivation and scrappiness to achieve objectives</li><li>The ability to multi-task with exceptional time management, prioritization and attention to detail</li><li>An entrepreneurial mindset and a passion for technology and innovation</li><li>The ability to work effectively in a small, relatively unstructured office environment (we work remotely)</li><li>Excellent verbal and written communication skills with appropriate urgency to various audiences</li><li>Strong self-motivation, are coachable and highly collaborative; they take ownership of tasks and pride in work product; details matter</li><li>High integrity; are dependable, accountable, humble and respectful</li><div><span style=\"font-size: 14px\">All Backflip positions are Remote. Like the people we serve, we believe being free to create wherever you’re most inspired is one of life’s greatest joys. It’s better for individuals, for the community, and for fostering great work to emerge. With our work-from-anywhere approach, </span><b style=\"font-size: 14px\">Backflip brings together a diverse team of individuals, with passions for innovation, art, coding, AI, data, finance, film, real estate, the environment, learning and teaching</b><span style=\"font-size: 14px\">. Together, we're moving fast.</span></div><div><br></div><div><span style=\"font-size: 14px\">Backflip is an equal opportunity employer. We know that </span><b style=\"font-size: 14px\">building a world-class organization is not possible without an intentional focus on recruiting, empowering, promoting and rewarding the best and brightest people of all backgrounds.</b><span style=\"font-size: 14px\"> Backflip focuses on hiring individuals that align with its Core Values (listed above), and consistently display a high ethical standard, both personally and professionally.</span></div><div><br></div><div><br></div><div><u style=\"font-size: 10px\">👇 Disclosures:</u></div><div><span style=\"font-size: 10px\">This role is not eligible for visa sponsorship</span></div>","tags":"[\"Finance\",\"management\"]","pubDate":"2024-06-20 18:01:55.824","link":"https://jobs.lever.co/backflip/5c010b9f-071b-4b39-ab48-d4121c00be7d","savedDate":"2024-06-23 04:01:58.477","slug":"loan-processor-backflip-8738"},{"id":8655053773,"title":"Post-Close Loan Processor","company":"Backflip","image":"https://lever-client-logos.s3.us-west-2.amazonaws.com/2616694d-50ee-4ca0-8184-ecbfb6dbe8a9-1686066452569.png","description":"<div><b>Come help us change residential real estate investing for the better!</b></div><div><br></div><div><b>Backflip</b> is a venture-backed real estate FinTech company that supports entrepreneurs to acquire and renovate single family homes, thereby reinvigorating the housing supply and their local communities. The company offers purpose-built technology and capital products to source, analyze and finance residential real estate investments. Backflip is an all-in-one platform providing entrepreneurs with the technology, data, and financing strategies that allows them to scale their businesses.</div><div><br></div><div>Backflip is seeking a <b>Loan Processor (Post-Close)</b> to join our Post-Close Experience Team to ensure Backflip delivers a best-in-class Member experience. As an early hire, this individual will play a critical role in ensuring Backflip has an industry leading Member Success function that is designed to scale. This hire will play a key role in ensuring Backflip’s culture continues to be enlivened in the operation.</div><div><br></div><div>This is a rare opportunity to get in on the ground floor (~60 person team) working directly with executives in a fast-paced and well-capitalized startup (Series A).</div><div><br></div><div>All Backflip positions are remote (US based). Like the people we serve, we believe being free to create wherever you’re most inspired is one of life’s greatest joys. It’s better for individuals, for the community, and for fostering great work to emerge. With our work-from-anywhere approach, Backflip brings together a diverse team of individuals, with passions for innovation, art, coding, AI, data, finance, film, real estate, the environment, learning and teaching. Together, we're moving fast.</div><div><br></div><div><b>Come help us change residential real estate investing for the better!</b></div><div><br></div><div><b>Backflip</b> is a venture-backed real estate FinTech company that supports entrepreneurs to acquire and renovate single family homes, thereby reinvigorating the housing supply and their local communities. The company offers purpose-built technology and capital products to source, analyze and finance residential real estate investments. Backflip is an all-in-one platform providing entrepreneurs with the technology, data, and financing strategies that allows them to scale their businesses.</div><div><br></div><div>Backflip is seeking a <b>Loan Processor (Post-Close)</b> to join our Post-Close Experience Team to ensure Backflip delivers a best-in-class Member experience. As an early hire, this individual will play a critical role in ensuring Backflip has an industry leading Member Success function that is designed to scale. This hire will play a key role in ensuring Backflip’s culture continues to be enlivened in the operation.</div><div><br></div><div>This is a rare opportunity to get in on the ground floor (~60 person team) working directly with executives in a fast-paced and well-capitalized startup (Series A).</div><div><br></div><div>All Backflip positions are remote (US based). Like the people we serve, we believe being free to create wherever you’re most inspired is one of life’s greatest joys. It’s better for individuals, for the community, and for fostering great work to emerge. With our work-from-anywhere approach, Backflip brings together a diverse team of individuals, with passions for innovation, art, coding, AI, data, finance, film, real estate, the environment, learning and teaching. Together, we're moving fast.</div><div><br></div><div><span style=\"font-size: 7.5pt\">*The Compensation figure above includes base salary + variable, and is based on a variety of factors including prior experience. In addition to a competitive market salary, Backflip employees receive equity stock options, 100% paid health care, a 401K + company match, among other industry-leading benefits.</span></div><h3>This candidate will champion Backflip’s culture & Core Values:</h3><li>Raise the standard of what is possible</li><li>Embrace being the novice to become the master</li><li>Work only with those who want the best for us</li><li>Communicate quickly, naturally and with radical candor</li><li>Test new things to invent and challenge the status quo</li><li>Today, nay now!</li><h3>Primary Responsibilities</h3><li>Proactively manage the post-close pipeline to ensure each Member feels valued, empowered, and is set up for success</li><li>Process rehab draws utilizing our software platform, including coordinating progress inspections and serving as the Member point of contact</li><li>Manage a loan payoff pipeline by tracking requests and facilitating the preparation of payoff statements in a timely manner</li><li>Process loan extension requests in collaboration with Backflip's Asset Management team</li><li>Communicate proactively with Members to get ahead of issues and protect Backflip’s loan performance track record</li><li>Effectively handle Member escalations, as applicable</li><li>Provide each Member with a welcome call upon their loan closing</li><li>Uphold communication SLA’s; ensure borrowers receive timely responses&nbsp;</li><li>Work with the broader team to develop opportunities to engage Members with Community and Product</li><li>Support Backflip’s Capital Markets team to complete related processing tasks and resolve investor conditions</li><div><br></div><div><i>This role will evolve as the company grows; there will be various tasks that fall outside of the responsibilities above. </i></div><h3>Qualifications - Role Specific</h3><li>2+ years of experience in a customer service position</li><li>1+ year of experience in a mortgage or FinTech operations role</li><li>Experience with short-term bridge loans or construction loans is a plus</li><li>Passionate about the Member Experience; energized by building healthy customer relationships</li><li>Interest in real estate investing and excited about understanding our member’s investment journey</li><li>Prior work at a high-growth start-up is a plus</li><li>Experience with real estate renovations and project management is a plus</li><li>General understanding of basic real estate investment concepts (or demonstrated desire to learn); comfortable performing basic math calculations</li><li>Exemplary computer skills - demonstrated ability and desire to learn new technologies (we use Slack + Notion + Google Workspace + Front + HubSpot + more)</li><li>Basic spreadsheet skills (Excel; Google Sheets)</li><h3>People That Thrive at Backflip Have…</h3><li>A desire to learn and grow with the company; propensity to “think like an owner”</li><li>An execution-oriented “one-team” mindset with motivation and scrappiness to achieve objectives</li><li>The ability to multi-task with exceptional time management, prioritization and attention to detail</li><li>An entrepreneurial mindset and a passion for technology and innovation</li><li>The ability to work effectively in a small, relatively unstructured office environment (we work remotely)</li><li>Excellent verbal and written communication skills with appropriate urgency to various audiences</li><li>Strong self-motivation, are coachable and highly collaborative; they take ownership of tasks and pride in work product; details matter</li><li>High integrity; are dependable, accountable, humble and respectful</li><div><span style=\"font-size: 14px\">All Backflip positions are Remote. Like the people we serve, we believe being free to create wherever you’re most inspired is one of life’s greatest joys. It’s better for individuals, for the community, and for fostering great work to emerge. With our work-from-anywhere approach, </span><b style=\"font-size: 14px\">Backflip brings together a diverse team of individuals, with passions for innovation, art, coding, AI, data, finance, film, real estate, the environment, learning and teaching</b><span style=\"font-size: 14px\">. Together, we're moving fast.</span></div><div><br></div><div><span style=\"font-size: 14px\">Backflip is an equal opportunity employer. We know that </span><b style=\"font-size: 14px\">building a world-class organization is not possible without an intentional focus on recruiting, empowering, promoting and rewarding the best and brightest people of all backgrounds.</b><span style=\"font-size: 14px\"> Backflip focuses on hiring individuals that align with its Core Values (listed above), and consistently display a high ethical standard, both personally and professionally.</span></div><div><br></div><div><br></div><div><u style=\"font-size: 10px\">👇 Disclosures:</u></div><div><span style=\"font-size: 10px\">This role is not eligible for visa sponsorship</span></div>","tags":"[\"Finance\",\"management\",\"aws\"]","pubDate":"2024-06-20 17:13:46.201","link":"https://jobs.lever.co/backflip/4fa6a375-4362-4891-9ef0-4ddd93be287a","savedDate":"2024-06-23 04:01:58.477","slug":"post-close-loan-processor-backflip-6337"}]