[{"id":5255527034,"title":"Technical Support Representative (Remote, PST Hours)","company":"MixRank","image":"https://pbs.twimg.com/profile_images/378800000147745937/0fac42c12b433bbbd53ff3e15cd6fca4_400x400.png","description":"<p>As a Technical Support Representative at MixRank, you will serve as the primary point of contact for our enterprise customers, ensuring their ongoing success and satisfaction. You’ll handle a wide range of technical inquiries, troubleshoot issues, and proactively share updates on new products and bug fixes. Working closely with internal teams, you’ll ensure our customers receive the highest quality support and guidance.<br>\n<br>\n<strong>Key Responsibilities:</strong></p>\n<ul>\n<li><strong>Customer Onboarding &amp; Support:</strong> Guide customers through the onboarding process, ensuring they have a clear understanding of our products and services. Build and maintain comprehensive knowledge base materials.</li>\n<li><strong>Technical Troubleshooting:</strong> Use SQL and a solid understanding of database systems to efficiently resolve common inquiries, helping customers maximize the value of our platform.</li>\n<li><strong>Issue Triage &amp; Resolution:</strong> Efficiently manage incoming support requests, prioritize critical issues, and respond promptly with clear, step-by-step troubleshooting instructions.</li>\n<li><strong>Technical Escalations &amp; Collaboration:</strong> Work closely with engineering and product teams to escalate complex or persistent issues, ensuring that root causes are identified and resolved quickly.</li>\n<li><strong>Proactive System Monitoring &amp; Improvement:</strong> Regularly monitor platform performance, identify potential issues before they escalate, and recommend enhancements or preventive measures to maintain optimal system reliability.</li>\n</ul>\n<p><strong>Qualifications:</strong></p>\n<ul>\n<li><strong>Excellent Communication:</strong> Outstanding written and verbal communication skills, capable of conveying complex technical information in an accessible manner.</li>\n<li><strong>Technical Proficiency:</strong> Strong SQL skills and a solid understanding of database concepts to investigate and resolve customer issues.</li>\n<li><strong>Client-Focused Problem Solving:</strong> Experience managing escalations and serving as a reliable, responsive point of contact for enterprise clients.</li>\n<li><strong>Project Management Skills:</strong> Ability to efficiently allocate engineering resources, prioritize tasks, and manage bug fixes to ensure timely and high-quality customer support.</li>\n<li><strong>Independent Learning &amp; Ownership:</strong> Self-directed learner with a deep sense of responsibility for delivering an exceptional customer experience.</li>\n</ul>\n<p><strong>Why Join MixRank:</strong></p>\n<p>MixRank is a world-class data intelligence platform supported by top-tier investors. We are a 100% globally distributed company since 2018, priding ourselves on delivering top-notch data solutions to Fortune 500s and other leading organizations. We emphasize a healthy work culture, asynchronous communication, and long-term growth—both for the company and our team members. With consistent year-over-year growth and a focus on customer success, MixRank offers competitive salaries, remote work flexibility, and an environment where you can truly invest your career.</p>\n<p>If you’re passionate about delivering exceptional technical support and eager to contribute to a globally distributed, customer-focused team, we’d love to hear from you!</p>\n","tags":"[\"management\",\"engineering\",\"database\"]","pubDate":"2024-12-11 15:26:57.973","link":"https://www.ycombinator.com/companies/mixrank/jobs/tkG3cYZ-technical-support-representative-remote-pst-hours","savedDate":"2024-12-11 15:26:57.973","slug":"technical-support-representative-remote-pst-hours-mixrank-7402"},{"id":6947838064,"title":"Technical Support Engineers","company":"Blue Coding","image":"https://media.licdn.com/dms/image/C4D0BAQHlK67hgnhzQw/company-logo_200_200/0/1631346154820?e=2147483647&v=beta&t=_R2Ssj7L_f4xqmSCcq0nOLCyCz0QN2lFnHssxxhj3YY","description":"<div><b style=\"font-size: 18px;\">Full-time | Hybrid in Costa Rica</b></div><div><br></div><div><span style=\"font-size: 18px;\">Who are we?</span></div><div><br></div><div>At Blue Coding we specialize in hiring amazing developers and people from all over Latin America and other parts of the world, both through staff augmentation arrangements and direct placements. For nearly a decade, we’ve helped cutting-edge companies in the United States and Canada both large and small build great development teams and develop innovative products. Online shops, digital agencies, SaaS providers, and software consulting firms are just a few of our diverse clients. Our team of over 50 engineers is distributed in more than 10 countries globally. We are a fully remote company working with a wide array of technologies and have expertise in every stage of the software development process.&nbsp;</div><div><br></div><div>In this opportunity, you would work with a leading provider of AI-powered infrastructure software. They are seeking passionate, dedicated professionals to join their team in delivering modern, secure, and efficient technology. </div><div><br></div><div><span style=\"font-size: 18px;\">What are we looking for?</span></div><div><br></div><div>In this opportunity, we are looking for Technical Support Engineers to join a global software leader. Your role will involve addressing customer inquiries, troubleshooting technical issues, and providing resolutions on time. This position plays a key role in ensuring customer satisfaction and contributing to the overall success of the support team. The ideal candidate is a detail-oriented, critical thinker with strong problem-solving and communication skills.</div><div><br></div><div><span style=\"font-size: 18px;\">What's unique about this job?</span></div><div><br></div><div>Our client is an established company specializing in advanced software solutions. They focus on empowering businesses by providing tools that streamline workflows, enhance productivity, and ensure secure operations. With a global customer base and a commitment to innovation, they are dedicated to improving working lives.</div><div>The client emphasizes a collaborative and inclusive culture, offering employees opportunities to grow and contribute meaningfully. By leveraging cutting-edge technologies, they deliver real-time solutions to meet their customers' evolving needs, enabling teams to focus on impactful work.</div><h3>Here are some of the exciting day-to-day challenges you will face in this role:</h3><li><b>Engage with Customers:</b> Handle incoming support requests through chat or voice, assisting customers with various product-related queries.</li><li><b>Problem Solving:</b> Use your technical knowledge and troubleshooting skills to diagnose and resolve issues efficiently.</li><li><b>Knowledge Building:</b> Collaborate with the team to maintain and update internal knowledge bases, creating resources that support consistent issue resolution.</li><li><b>Collaboration:</b> Work closely with peers, senior engineers, and technical leads to tackle complex challenges and provide comprehensive support.</li><li><b>Efficiency Goals:</b> Strive to resolve cases within target timeframes while maintaining high customer satisfaction.</li><li><b>Learning Opportunities:</b> Stay up to date with product updates and best practices, contributing to the improvement of support processes.</li><li><b>Metrics-Driven Work:</b> Meet performance goals related to case documentation, troubleshooting quality, and customer satisfaction.</li>,<h3>You will shine if you have these skills:</h3><li>A strong background in computing (Mac &amp; PC), networking, web browsers, and PC troubleshooting.</li><li>Excellent critical thinking and troubleshooting abilities to resolve customer issues efficiently.</li><li>Proficient verbal and written communication skills, with the ability to explain technical concepts clearly.</li><li>The ability to de-escalate challenging situations and deliver excellent customer service.</li><li>Experience with case management and maintaining detailed records of interactions.</li><li>A team-oriented mindset, thriving in a cooperative and supportive work environment.</li><li>A growth mindset, eager to learn, adapt, and embrace new challenges in a fast-paced environment.</li><li>Familiarity with tools like GSuite, Microsoft Office, and CRM systems.</li>,<h3>It doesn’t hurt if you also:</h3><li>Understanding of Windows Server roles, IIS, AD, and DNS</li><li>Knowledge of load-balancing technologies, web applications, and API troubleshooting</li><li>Familiarity with scripting languages like JavaScript, Python, or PHP</li><li>Awareness of security certificates and SSO setup issues</li>,<h3>Here are some of the perks we offer you:</h3><li>Salary in USD.</li><li>Flexible schedule (within US time zones).</li><li>100% remote.</li><li>Long-term and full-time.</li><div><span style=\"font-size: 24px;\">Hey, you are still here!</span></div><div><br></div><div>So, let us ask you a few questions: Are you able to communicate what you are thinking, point out potential pitfalls, and have no hesitation to ask for help when encountering issues? Do you have a passion for scaling business globally? Are you organized, detailed oriented, and self-started? If so, this role is waiting for you! Join us!</div>","tags":"[\"javascript\",\"management\"]","pubDate":"2024-12-11 14:49:15.580","link":"https://jobs.lever.co/bluecoding/c0f32a39-e646-4491-aa77-726eefaa7d75","savedDate":"2024-12-11 15:26:57.980","slug":"technical-support-engineers-blue-coding-4202"},{"id":9982991880,"title":"Kalite Kontrol Uzmanı (Çiçek)","company":"Ciceksepeti","image":"https://lever-client-logos.s3.us-west-2.amazonaws.com/de4eebbf-97f1-4bdb-b542-4fa65a0b48ab-1662467464737.png","description":"<div><b style=\"font-size: 15px;\">Bir teknolojisi firması olarak faaliyet gösterdiğimiz tüm pazarlarda lider olmak vizyonuyla çıktığımız yolda bize katılmak ister misin?</b></div><div><br></div><div><span style=\"font-size: 15px;\">Kurumsalın alışılagelmiş ifadelerinden ve hiyerarşiden uzak heyecan verici bir kariyere başlamak için en iyi yönlerini ortaya çıkarmaya hazır, dinamik, entelektüel açıdan meraklı genç profesyoneller arıyoruz. Hızla büyümeye devam eden bir teknoloji şirketi olarak gerçek hayatta yaşanan sorunları çözme ve profesyonel yaşamı deneyimleme imkanı sunuyoruz. Yaptığın işin tüm sorumluluğunu almak istiyorsan, işine katkı sağlayacak yeni fikirlerin olduğunda sesini duyurmak istiyorsan ve olağanüstü bir işbaşında eğitim deneyimi yaşamaya hazırsan; o zaman meydan okumaya hazırsın. Bu heyecana ortak olup başarımızı daha da ileriye taşıyacak</span><b style=\"font-size: 15px;\">&nbsp;</b><b><span style=\"font-size: 14px;\">Kalite Kontrol Uzmanı</span></b><b style=\"font-size: 15px;\">&nbsp;</b><span style=\"font-size: 15px;\">arıyoruz.</span></div><h3>🎯 Sorumluluklar</h3><li>Çiçek üreticilerinden gelen ürünlerin kalite kontrolünün yapılması</li><li>Mal kabulü yapılan ürünlerin standartlara uygun olarak depolanmasının takibi</li><li>Mal kabul &amp; depo süreçlerinin takip edilmesi ve iyileştirilmesi</li><li>Tüm çiçeklere ait envanterlerin doğru ve düzenli takip edilmesi</li><li>Sevkiyat öncesi ve sırasında ürünlerin kontrolünün yapılarak standart dışı olan ürünlerin ayrılması</li><li>Sevkiyatların en hızlı ve hatasız gerçekleştirilmesi için süreçlerin iyileştirilmesi</li><li>Sahadan gelen geri bildirimleri takip ederek kalite iyileştirme çalışmalarının yapılması</li><li>Ürünlerin kalitesinin raporlamasıMüşterilerin sipariş ettiği ürünlerin görsel aracılığı ile kalitesinin ölçümlenmesi</li><li>Çiçek arabalarının fatura ve sevk takipleri</li><li>İade kontrolleri ve kabulleri</li><li>Perakende satış noktası ile ilgili süreçlerin yürütülmesi</li>,<h3>✨ Aranan Nitelikler</h3><li>Önlisans ve lisans bölümlerinden mezun</li><li>Kalite kontrol alanında minimum 2 yıl deneyimli</li><li>Tuzla, Pendik ve Şekerpınar'da ikamet eden</li><li>Excel bilgisi iyi olan</li><li>Kesme çiçek, saksı bitkileri veya zirai ürünlerin üretim ve kalite süreçlerine hakim</li><li>Tercihen kesme çiçek, saksı bitkileri veya zirai ürünlerin üretiminde deneyimli</li><li>Yoğun çalışma temposuna ve esnek çalışma saatlerine ayak uydurabilecek</li><li>Planlama, organizasyon ve iletişim becerileri gelişmiş</li><div><b>😍 Hakkımızda</b></div><div>En kolay ve ekonomik yoldan çiçek göndermeyi sağlamak için 2006’da kurulan <u><a rel=\"noopener noreferrer\" class=\"postings-link\" href=\"http://ciceksepeti.com/\">ciceksepeti.com</a></u>, Türkiye genelinde <a rel=\"noopener noreferrer\" class=\"postings-link\" href=\"http://55.000\">55.000</a>+ iş ortağı ve 70’den fazla ile gönderimini sağladığı binlerce siparişle, Türkiye'deki en büyük online çiçekçidir.😎</div><div><br></div><div>Çiçeksepeti; çiçek aranjmanları, kek ve kurabiye buketlerinin yanı sıra kişiselleştirilmiş hediyeler ile müşterilerine binlerce alternatif sunarak özel günlerde ilk akla gelen e-ticaret firmasıdır. Türkiye'deki başarı hikayemizi, LolaFlora markası ile Meksika'da sürdürürken, bir teknoloji firması olarak, hediye alanındaki pazar liderliğimizi yeni iş modellerimize de taşımak vizyonu ile emin adımlarla ilerliyoruz. 💃</div><div><br></div><div>\"İşe alım süreçlerimizde kişisel verilerinizi nasıl işlediğimize dair bilgiye çalışan adayı aydınlatma metnimizden ulaşabilirsiniz./ Please see our candidate privacy note for information on how we process your personal data during our recruitment activities.\"</div><div><a rel=\"noopener noreferrer\" class=\"postings-link\" href=\"https://cdn03.ciceksepeti.com/editor/hr/Ciceksepeti_CS-Teknoloji-Calisan-Adayi_Aydinlatma-Metni-15092023.pdf\">https://cdn03.ciceksepeti.com/editor/hr/Ciceksepeti_CS-Teknoloji-Calisan-Adayi_Aydinlatma-Metni-15092023.pdf</a></div><div><a rel=\"noopener noreferrer\" class=\"postings-link\" href=\"https://cdn03.ciceksepeti.com/editor/hr/Ciceksepeti_CS-Teknoloji-Calisan-Adayi_Aydinlatma-Metni-15092023.docx.pdf\">https://cdn03.ciceksepeti.com/editor/hr/Ciceksepeti_CS-Teknoloji-Calisan-Adayi_Aydinlatma-Metni-15092023.docx.pdf</a></div>","tags":"[]","pubDate":"2024-12-10 14:37:15.408","link":"https://jobs.lever.co/ciceksepeti/89bf6832-16a8-443c-8e2a-72d2826447e9","savedDate":"2024-12-11 15:26:57.978","slug":"kalite-kontrol-uzman-i-ek-ciceksepeti-9476"},{"id":8462181807,"title":"Governance Facilitator","company":"Scroll","image":"https://avatars.githubusercontent.com/u/87750292?s=200&v=4","description":"&lt;div class=&quot;content-intro&quot;&gt;&lt;p&gt;Scroll is a Layer 2 scaling solution for Ethereum, specifically focusing on zkRollups. Key aspects of Scroll are zkRollup technology, Scalability, Efficiency, Security, and Developer-friendly. Overall, Scroll plays a crucial role in addressing Ethereum&#39;s scalability challenges and facilitating the growth of decentralized finance (DeFi) and other blockchain-based applications by providing a scalable and efficient Layer 2 solution.&amp;nbsp;&lt;/p&gt;&lt;/div&gt;&lt;h3&gt;&lt;strong&gt;Position Overview&lt;/strong&gt;&lt;/h3&gt;\n&lt;p&gt;Scroll Foundation is seeking an experienced and dynamic Governance Facilitator to serve as the vital link between the community and the Foundation, ensuring efficient coordination and facilitation of DAO activities. This strategic role encompasses governance, operations, logistics, and human resources to support the effective functioning of the Scroll DAO.&lt;/p&gt;\n&lt;p&gt;The ideal candidate will possess extensive experience in Web3 governance systems, DAO communities, strong relationship management skills, and a deep understanding of decentralized governance principles. Alternatively, candidates with extensive digital community experience or digital governance experience outside of Web3 will also be considered.&lt;/p&gt;\n&lt;h3&gt;&lt;strong&gt;Responsibilities&lt;/strong&gt;&lt;/h3&gt;\n&lt;ul&gt;\n&lt;li&gt;&lt;strong&gt;Collaborate with Key Stakeholders&lt;/strong&gt;: Work closely with the Scroll Foundation team, governance advisors, and in the future with delegates, and community members.&lt;/li&gt;\n&lt;li&gt;&lt;strong&gt;Day-to-Day Operations&lt;/strong&gt;: Oversee daily governance operations and track requirements from both delegates and the Foundation. Help onboard and engage delegates and various community members during and after the formation of the Scroll DAO. Help operationalize the first proposals that get approved starting December 2024.&lt;/li&gt;\n&lt;li&gt;&lt;strong&gt;Coordinate and Facilitate Governance Activities&lt;/strong&gt;: Lead and manage efforts with delegates from the Foundation’s perspective, including:\n&lt;ul&gt;\n&lt;li&gt;Communicating about active and upcoming votes, discussions, and required actions.&lt;/li&gt;\n&lt;li&gt;Receiving and acting on inputs from delegates to the Foundation.&lt;/li&gt;\n&lt;li&gt;Managing proposals that involve fund movement or contract upgrades.&lt;/li&gt;\n&lt;li&gt;Addressing issues or conflicts requiring resolution.&lt;/li&gt;\n&lt;li&gt;Moderate and facilitate inclusive and productive governance discussions.&lt;/li&gt;\n&lt;/ul&gt;\n&lt;/li&gt;\n&lt;li&gt;&lt;strong&gt;Maintain &amp;amp; Improve Governance Frameworks&lt;/strong&gt;: Collaborate with the Governance Lead and Scroll Foundation overall as well as key stakeholders to develop and implement governance frameworks and best practices. Analyze and report on governance metrics, trends, and community sentiment.&lt;/li&gt;\n&lt;/ul&gt;\n&lt;h3&gt;&lt;strong&gt;Qualifications and Experience&lt;/strong&gt;&lt;/h3&gt;\n&lt;ul&gt;\n&lt;li&gt;&lt;strong&gt;Web3 Governance&lt;/strong&gt;: Extensive knowledge of Ethereum, L2s, and decentralized governance systems is strongly preferred. Experience working within decentralized governance systems, preferably in a similar public-facing role within major DAOs.&lt;/li&gt;\n&lt;li&gt;&lt;strong&gt;Relationship Management&lt;/strong&gt;: Strong relationship management skills, with experience in client-facing roles (e.g., law, consulting, client facing roles).&lt;/li&gt;\n&lt;li&gt;&lt;strong&gt;Strong Communication Skills&lt;/strong&gt;: Excellent communication and interpersonal skills, with the ability to articulate complex matters clearly and effectively. Conflict resolution skills to navigate and mediate disputes within the community.&lt;/li&gt;\n&lt;li&gt;&lt;strong&gt;Organizational Skills&lt;/strong&gt;: Strong organizational and operational skills to manage multiple tasks and stakeholders simultaneously.&lt;/li&gt;\n&lt;li&gt;&lt;strong&gt;Independent and Proactive&lt;/strong&gt;: Ability to work independently and proactively in a fast-paced and dynamic environment.&lt;/li&gt;\n&lt;li&gt;&lt;strong&gt;Scroll Values&lt;/strong&gt;: Familiar with Scroll’s values and mission-aligned with Scroll’s vision and goals.&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;&lt;/p&gt;&lt;div class=&quot;content-conclusion&quot;&gt;&lt;h3&gt;&lt;strong&gt;About You&lt;/strong&gt;&lt;/h3&gt;\n&lt;ul&gt;\n&lt;li&gt;You are a self-starter and ability to take ownership, well organised, self-disciplined and effective when working autonomously on tasks and projects;&lt;/li&gt;\n&lt;li&gt;You are responsive, collaborative and committed person with a high work ethic;&lt;/li&gt;\n&lt;li&gt;You are a high class communicator who can articulate their views succinctly on calls or asynchronously in globally distributed, remote teams;&lt;/li&gt;\n&lt;li&gt;You relish working in an agile start-up environment;&lt;/li&gt;\n&lt;li&gt;You are a great listener who understands when to listen first and engages well with colleagues;&lt;/li&gt;\n&lt;li&gt;You are a resilient, driven individual who is willing and able to continually develop and iterate to succeed;&lt;/li&gt;\n&lt;/ul&gt;\n&lt;h3&gt;&lt;strong&gt;What We Offer&lt;/strong&gt;&lt;/h3&gt;\n&lt;ul&gt;\n&lt;li&gt;A mission-led, collaborative culture&lt;/li&gt;\n&lt;li&gt;Opportunity to work with cutting edge technology and like-minded people who are contributing to the progression of Ethereum&lt;/li&gt;\n&lt;li&gt;Competitive salary package / generous paid time off / annual growth budget&lt;/li&gt;\n&lt;li&gt;100% remote from any location with flexible hours&lt;/li&gt;\n&lt;li&gt;Home office set up / co-working membership allowance&lt;/li&gt;\n&lt;li&gt;Private healthcare in selected countries&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;&lt;em&gt;Scroll is proud to be an equal opportunity workplace. We are committed to equal employment opportunities regardless of race, color, ancestry, religion, sex, national origin, sexual orientation, age, citizenship, marital status, disability, gender identity, or Veteran status. If you have a disability or special need, please let us know and we&#39;ll do our best to accommodate.&lt;/em&gt;&lt;/p&gt;\n&lt;p&gt;&amp;nbsp;&lt;/p&gt;&lt;/div&gt;","tags":"[\"Finance\",\"management\"]","pubDate":"2024-12-09 16:18:20.000","link":"https://job-boards.eu.greenhouse.io/scrollio/jobs/4492064101","savedDate":"2024-12-11 15:26:57.977","slug":"governance-facilitator-scroll-356"},{"id":8194421328,"title":"Lighting Artist","company":"Buildarocketboy","image":"https://remotive.com/job/1954411/logo","description":"<div><!--block-->As our new Lighting Artist you will join a small but specialised team of other Lighting Artists working on our large scale, and high quality, AAA games. You will be tasked with creating visually stunning lighting that brings our virtual worlds to life.<br>You would join our team on an FTC basis. For this role you need to have experience working on in-game lighting, ideally on a project working with Unreal Engine 5. </div>\n<div><!--block--></div>\n<p><br><br></p>\n<div class=\"h3\">Key Responsibilities</div>\n<ul style=\"\">\n<li style=\"\"><!--block-->Collaborate with artists, designers, and programmers to create high-quality lighting solutions and atmospheres for games using Unreal Engine 5</li>\n<li style=\"\"><!--block-->Develop and implement lighting styles that enhance the visual appeal of characters, environments, and special effects</li>\n<li style=\"\"><!--block-->Optimize lighting setups for performance and memory usage while maintaining visual quality</li>\n<li style=\"\"><!--block-->Create custom shaders and materials as needed to achieve desired lighting effects</li>\n<li style=\"\"><!--block-->Work independently to solve complex lighting challenges and collaborate with other teams to resolve cross-functional issues</li>\n<li style=\"\"><!--block-->Communicate effectively with team members and stakeholders about progress, challenges, and solutions related to lighting design</li>\n<li style=\"\"><!--block-->Manage time efficiently to meet project deadlines while maintaining a high level of quality in your work.</li>\n</ul>\n<div><!--block--></div>\n<p><br><br></p>\n<div class=\"h3\">Skills, Knowledge &amp; Expertise</div>\n<ul style=\"\">\n<li style=\"\"><!--block-->Experience as a Lighting Artist or similar role in the game industry </li>\n<li style=\"\"><!--block-->Expertise in Unreal Engine 5 or equivalent </li>\n<li style=\"\"><!--block-->Strong understanding of colour theory, composition, and visual storytelling principles as they apply to lighting design in games </li>\n<li style=\"\"><!--block-->Proficiency in using industry-standard tools such as Maya or 3ds Max for modelling tasks related to lighting setup creation </li>\n<li style=\"\"><!--block-->Familiarity with art analysis for regular improvement </li>\n<li style=\"\"><!--block-->Photography or cinematography experience is an added advantage </li>\n<li style=\"\"><!--block-->A background in fine arts is desirable but not required </li>\n</ul>\n<p><br><br></p>\n<div class=\"h3\">Job Benefits</div>\n<div><!--block--><strong>Our Global Benefits &amp; Perks</strong></div>\n<ul style=\"\">\n<li style=\"\"><!--block--><strong>Unlimited coaching &amp; therapy</strong> — with Oliva, to support your mental health</li>\n<li style=\"\"><!--block--><strong>Stock Options</strong> — everyone owns a piece of our success</li>\n<li style=\"\"><!--block--><strong>Pension scheme</strong> — up to 5% employer matched contribution to finance those golden years</li>\n<li style=\"\"><!--block--><strong>Socials </strong>— office &amp; remote events, play sessions and company-wide parties</li>\n<li style=\"\"><!--block--><strong>And even more benefits based on your location!</strong></li>\n</ul>\n<div><!--block--><strong>If you’re based in the UK</strong></div>\n<ul style=\"\">\n<li style=\"\"><!--block--><strong>25 Annual Leave + 3 bank holidays</strong> - we’re flexible with most bank holidays so you can use the time to celebrate what’s important to you</li>\n<li style=\"\"><!--block--><strong>Private Medical Insuranc</strong>e - full cover with AXA</li>\n<li style=\"\"><!--block--><strong>Healthcare Cash Plan</strong> - Level 3 cover with Medicash</li>\n<li style=\"\"><!--block--><strong>Cycle2Work</strong> <strong>Scheme</strong> - lease a bike through us and save on tax too!</li>\n<li style=\"\"><!--block--><strong>Electric Car Charging</strong> - electric car charging at our Port office in Edinburgh, Scotland.</li>\n</ul>\n<img src=\"https://remotive.com/job/track/1954411/blank.gif?source=public_api\" alt=\"\"/>","tags":"[\"3ds Max\"]","pubDate":"2024-12-09 11:21:29.000","link":"https://remotive.com/remote-jobs/all-others/lighting-artist-1954411","savedDate":"2024-12-11 15:26:57.972","slug":"lighting-artist-buildarocketboy-4422"},{"id":1437163061,"title":"Technical Support Operator","company":"KnownHost","image":"https://remotive.com/job/1956436/logo","description":"<p><strong>THIS IS WHO YOU ARE…</strong></p>\n<p>You are our front line in the battle for exceptional customer experience at the 24/7/365 help desk.</p>\n<p>Ideally, you have experienced terrible web hosting customer service and have vowed that will never happen on your watch!</p>\n<p>You are responsible for seeing that our customers have excellent customer service by doing what you do every day -&gt; exceeding customer expectations.</p>\n<p><strong><br>WHAT DO WE NEED FROM YOU?</strong> Well, you should be customer focused, great under pressure, and ready to engage a problem with your superior analytic skills. Can you do several things at a time with amazing efficiency? Good! If you are a super ninja with web hosting applications and platforms -&gt; we need to talk.</p>\n<p><strong><br>MORE ABOUT THE POSITION</strong>. These will be your primary responsibilities in your daily goal to fight bad web hosting:</p>\n<ul style=\"\">\n<li style=\"\">Hiring for day shift employees CST. <br>Provide customers support via our 24/7 helpdesk.<br>Troubleshooting email delivery issues<br>Troubleshooting cPanel, Plesk, and DirectAdmin related issues<br>Troubleshooting DNS, FTP, SSL, Apache, and other service-related issues.</li>\n<li style=\"\">Ensuring customer satisfaction</li>\n<li style=\"\">You must know Linux like your favorite cheeseburger and fries’ combo! Here are your other amazing attributes:</li>\n<li style=\"\">Must be customer-focused, and willing to do whatever it takes to resolve customer issues. Going above and beyond is the standard at KnownHost. Our customer reviews reflect this.</li>\n<li style=\"\">Excellent written English. Technical Support Operators currently primarily provide support over email, but may occasionally be asked to pitch in with live chat and phone support.</li>\n<li style=\"\">Must be familiar with Linux shell (bash), Apache, PHP, MySQL, email (POP3/IMAP/SMTP), FTP, DNS, and other standard web hosting applications and protocols.</li>\n<li style=\"\">Must be able to work under pressure when bad stuff happens and get the job done.</li>\n<li style=\"\">Multi-tasking is a must. KnownHost has a lot going on, and multiple brands.</li>\n<li style=\"\">Must be able to ask customers for complete error message or derive the context of their problem if they provide insufficient information.</li>\n<li style=\"\">Must have working knowledge of one of the following control panels, cPanel/WHM, Plesk, and DirectAdmin is required. </li>\n<li style=\"\">Knowledge of PHP, Python, Perl, and Ruby on Rail a bonus. </li>\n<li style=\"\">Working Knowledge of Iptables firewalls (CSF, APF, etc.)</li>\n<li style=\"\">Common customer website apps, like Drupal, WordPress, MediaWiki, Magento, ZenCart, etc</li>\n<li style=\"\">MySQL commands for support or troubleshooting, like importing/dumping a database, simple SELECT statements or \"SHOW PROCESSLIST\"</li>\n</ul>\n<p><strong><br>WHY IS KNOWNHOST THE RIGHT FIT FOR YOU?</strong> We are seeking extraordinary people in a world of mediocrity. You must live and breathe web hosting. To attract and retain top-level talent, we are prepared to treat you like a VIP.</p>\n<p>With plush benefits, paid vacation time, and competitive pay, we believe that KnownHost can be your next home away from home. Here is how we let you know that you are valued on our red carpet:</p>\n<ul style=\"\">\n<li style=\"\">Competitive pay between $14 to $20 per hour (depending on experience)</li>\n<li style=\"\">Comprehensive health, dental, and vision insurance plans (US only)</li>\n<li style=\"\">Flexible scheduling, &amp; paid vacation benefits. </li>\n<li style=\"\">A variety of other perks and benefits</li>\n</ul>\n<p>All our positions are full-time employment, so we expect KnownHost to be your only hosting related job.</p>\n<p>All you should do is know your field from every position, pass the background/ drug test, and let us do the rest!</p>\n<p>Apply today and let us get to know you!  </p>\n<img src=\"https://remotive.com/job/track/1956436/blank.gif?source=public_api\" alt=\"\"/>","tags":"[\"apache\",\"drupal\",\"magento\",\"perl\",\"php\",\"python\",\"ruby/rails\",\"wordpress\",\"bash\",\"dns\",\"web hosting\",\"helpdesk\",\"MySQL\",\"technical support\",\"chat\",\"troubleshooting\",\"Linux/Unix\",\"shell\",\"REST\",\"insurance\"]","pubDate":"2024-12-09 06:53:13.000","link":"https://remotive.com/remote-jobs/customer-support/technical-support-operator-1956436","savedDate":"2024-12-11 15:26:57.972","slug":"technical-support-operator-knownhost-1550"},{"id":6350288356,"title":"Senior Data Scientist","company":"Simple","image":"https://remotive.com/job/1955784/logo","description":"<p> </p>\n<p><strong>Simple</strong> is a successful mobile product that has a user base of over 15 million people and has over 100% year-over-year revenue growth. It helps people improve their nutritional habits through personalized programs, meal tracking, and health insights, which allows them to lead healthier and happier lives.Now, we are taking the next big step and working on a new revolutionary AI product that helps each person improve their health in a fun and engaging way.</p>\n<p>We are looking for a talented<strong> Senior</strong> <strong>Data Scientist </strong>who will join our team to ensure the quality and continuous improvement of our technologies.</p>\n<div class=\"h3\"><strong>Responsibilities:</strong></div>\n<ul style=\"\">\n<li style=\"\">Develop and deploy machine learning models to production, utilizing modern data science techniques to solve business challenges, create services, and monitor pipelines;</li>\n<li style=\"\">Collaborate with development, analytics, and business teams to understand their needs and requirements.</li>\n</ul>\n<div class=\"h3\"><strong>Requirements:</strong></div>\n<ul style=\"\">\n<li style=\"\">4+ years of experience in Data Science;</li>\n<li style=\"\">Strong proficiency in machine learning algorithms;</li>\n<li style=\"\">Expertise in at least one machine learning domain (e.g., recommendation systems, tabular data and “product” ML such as LTV, dynamic pricing, time-series analysis, reinforcement learning);</li>\n<li style=\"\">Solid understanding of ML system design and architecture;</li>\n<li style=\"\">Extensive experience with Python, core ML libraries (e.g., TensorFlow, PyTorch, Scikit-learn), SQL, Git, and Docker;</li>\n<li style=\"\">Strong problem-solving skills, attention to detail, and a commitment to delivering high-quality work;</li>\n<li style=\"\">Ability to work with large language models (LLMs), including writing prompts, creating functions, and fine-tuning models when necessary;</li>\n<li style=\"\">Results-driven and impact-oriented mindset.</li>\n</ul>\n<div class=\"h3\"><strong>Preferred:</strong></div>\n<ul style=\"\">\n<li style=\"\">Experience with Go (Golang) programming.</li>\n</ul>\n<div class=\"h3\"><strong>Perks and benefits: </strong></div>\n<ul style=\"\">\n<li style=\"\">Competitive salary package commensurate with experience, plus stock options;</li>\n<li style=\"\">The equipment you need to do your job;</li>\n<li style=\"\">A premium Palta Family subscriptions (Simple, Flo, Zing etc.);</li>\n<li style=\"\">21 days annual leave, plus bank holidays;</li>\n<li style=\"\">Office in Limassol (Hybrid Work Format) or Remote Option for Candidates Residing Outside of Cyprus.</li>\n</ul>\n<img src=\"https://remotive.com/job/track/1955784/blank.gif?source=public_api\" alt=\"\"/>","tags":"[\"docker\",\"git\",\"python\",\"sql\"]","pubDate":"2024-12-08 19:20:45.000","link":"https://remotive.com/remote-jobs/software-dev/senior-data-scientist-1955784","savedDate":"2024-12-11 15:26:57.972","slug":"senior-data-scientist-simple-3779"},{"id":9388095812,"title":"Senior iOS Engineer (Remote)","company":"DuckDuckGo","image":"https://spreadprivacy.com/content/images/2023/05/duckduckgo-logo_wide.png","description":"<p>Hi, we’re DuckDuckGo, the Internet privacy company for everyone who wants to take back their privacy now. For over a decade, we've been building our all-in-one product, developing new privacy technology, and working with policymakers to make online privacy simple and accessible for all.</p>\n<p><br /></p>\n<p>Our browsers and extensions have been downloaded over 250 million times with our built-in private search engine, which has delivered over 100 billion searches and is the 2nd largest search engine on mobile in the United States and 17 other countries, including the United Kingdom, Canada, Australia, Germany, Poland, and Spain. Our private search engine is also 3rd in market share in the U.S. and over 20 major markets. Oh, and we've been profitable since 2014, with annual revenue exceeding $100 million!</p>\n<p><br /></p>\n<p>The DuckDuckGo browser’s uniquely comprehensive privacy protections are used by tens of millions of people to protect their everyday online activities on <a href=\"https://spreadprivacy.com/introducing-duckduckgo-for-mac/\" rel=\"noopener\">Mac</a>, <a href=\"https://spreadprivacy.com/windows-browser-open-beta/\" rel=\"noopener\">Windows</a>, <a href=\"https://spreadprivacy.com/duckduckgo-privacy-browser-ios14/\" rel=\"noopener\">iOS</a>, and <a href=\"https://spreadprivacy.com/introducing-app-tracking-protection/\" rel=\"noopener\">Android</a>, from searching to browsing, emailing, and more. We also offer <a href=\"https://spreadprivacy.com/meetprivacypro/\" rel=\"noopener\">Privacy Pro</a>, a three-in-one subscription service that includes a VPN, Personal Information Removal, and Identity Theft Restoration.</p>\n<p><br /></p>\n<p>We’re looking for a <em>Senior iOS engineer</em> to help shape our all-in-one privacy solution and join our mission to show the world that protecting your privacy online can be simple.  </p>\n<p><br /></p>\n<p><strong>The Opportunity</strong> </p>\n<p>In this role, you will autonomously lead highly impactful projects that scale across millions of users from proposal through to postmortem assessing vague problems, proposing high impact solutions, and executing them against a set of success criteria. You will also:</p>\n<p><br /></p>\n<ul><li>Step up to resolve product issues – large and small.</li><li>Identify opportunities to increase searches and enhance the standard of trust online.</li><li>Own major application features and take responsibility for their maintenance and improvement over time.</li><li>Collaborate with peers remotely during product brainstorms, technical design discussions, pair programming sessions and code reviews.</li><li>Write pragmatic, performant, and testable code that works consistently across devices.</li><li>Always work to improve the quality of the codebase.</li></ul>\n<p><br /></p>\n<p><strong>What You Will Bring to DuckDuckGo</strong> </p>\n<ul><li>Ability to lead and collaborate on high-impact and complex projects from proposal through post-mortem.</li><li>Skills to wrangle vague problems, propose innovative solutions, and execute them with a strong focus on metrics.</li><li>Significant iOS engineering experience (5+ years), with experience working on at least two large native iOS applications.</li><li>Experience programming in Swift.</li><li>Deep understanding of software design patterns such as MVVM, MVP, etc., mobile threading, and memory management and how they apply to mobile applications.</li><li>A fundamental understanding of complex data structures and algorithms, which enables you to develop and apply new solutions and confidently navigate and improve existing code.</li><li>Ability to leverage both quantitative and qualitative data and to collaborate with a cross-functional team to develop effective UX solutions.</li><li>Effective project management skills.</li><li>Creative problem solvers and risk takers. You like to take initiative to push projects forward but know when to involve others.</li><li>Excellent communication skills. You can validate your decisions and communicate them clearly.</li><li>Knowledge of Kotlin and willingness to do Android related work would be considered a plus.</li></ul>\n<p><br /></p>\n<p><strong>How We Will Support You </strong> </p>\n<p>Our core values -- build trust, question assumptions, and validate direction -- underpin how we work day-to-day and the support we give our team members. We strive to empower our team members to be self-directed and self-motivated in their work.  </p>\n<p><br /></p>\n<ul><li><strong>Remote First, Always</strong>: We've always been a fully distributed company with team members all over the world. We trust you to get your work done wherever, and whenever.   </li><li><strong>Commitment to Personal Growth:</strong> Every team member has an annual budget of $1,250 USD to invest in their professional development. Every team member also has a dedicated Career Advisor, who serves as a guide to help you develop your strengths, identify your motivations, and understand your opportunities for growth. </li><li><strong>Leadership:</strong> We have many different types of leaders and possible combinations of leadership roles, so you can grow your career in a way that aligns best with your personal goals. You can seek additional leadership roles by being directly responsible for projects, taking ownership of areas of the company, developing and maintaining internal processes, or pursuing advisory roles. </li><li><strong>Work/Life Balance: </strong>Team members have the freedom and flexibility to organize their own work schedules. We want you to thrive both in and out of the office. We trust you to use good judgment and take the time off that you need to bring your best self to work.  </li></ul>\n<p><br />We also offer paid parental leave, a co-working stipend, office setup reimbursement, and a wellness stipend. More support resources can be found in our <u><a href=\"https://duckduckgo.com/assets/hiring/team_support_guide.pdf\" rel=\"noopener\">Team Member Support Guide</a></u>, which explains how we make your well-being a priority. </p>\n<p><br /></p>\n<p>For more information on how we collaborate worldwide, from leadership in our relatively flat organization to start-to-finish ownership<strong>,</strong> check out <u><a href=\"https://duckduckgo.com/how-we-work\" rel=\"noopener\">DuckDuckGo Culture: How We Work.</a></u> </p>\n<p><br /></p>\n<p><strong>Compensation</strong> </p>\n<p>Annual compensation: <em><br /></em><em><strong>$178,500 </strong></em><strong>USD</strong>  and stock options. Compensation is the same within a professional level, regardless of geographic location or functional area, and the compensation for each professional level is transparent across the organization.</p>\n<p><br /></p>\n<p><strong>Hiring Process</strong> </p>\n<p>Hiring works best when it's a two-way street. Learn how we help you get to know DuckDuckGo and envision your future role here. Find out more about <u><a href=\"https://duckduckgo.com/how-we-hire\" rel=\"noopener\">how we hire</a></u>. </p>\n<p><br /></p>\n<p><strong>Diversity, Equity, and Inclusion</strong> </p>\n<p>DuckDuckGo provides equal work opportunities to all team members and applicants<u>,</u> and it prohibits discrimination and harassment of any type on the basis of race, color, ethnicity, caste, religion, age, sex (including pregnancy), national origin, disability status, genetics, protected veteran status, sexual orientation, gender identity or expression, or any other characteristic protected by our policies or federal, state, or local laws.</p>\n<p><br /></p>\n<p>We want to ensure that our hiring process is accessible. If you need reasonable accommodation for any part of the application process because of a medical condition or disability, please send an email to <u><a href=\"mailto:careers@duckduckgo.com\" rel=\"noopener\">careers@duckduckgo.com</a></u> to let us know the nature of your request.  </p>\n<p><br /></p>\n<p>If you think you might thrive in this environment, we would love to hear from you. </p>\n<p><br /></p>\n<p><strong>Please note that:</strong> </p>\n<ul><li>Sometimes we meet up! Expect to travel at least two times a year: once for our all-hands meetup and again for a team retreat (each around 4-5 days). While extenuating circumstances may impact attendance, everyone is strongly encouraged to attend.</li><li>While we offer a flexible work arrangement with no core hours, expect an average full-time commitment of 40 hours per week. </li><li>A successful candidate will be subject to a background check and must receive satisfactory results of the same, as a condition of joining the team. </li><li>By applying for this role, you confirm that all information submitted is accurate and complete. You further acknowledge that providing false or fraudulent information during the application process is cause for denial of an offer, revocation of any existing offer, or other adverse action, up to and including termination after the start of your commencement of work.</li></ul>\n<p><br /></p>","tags":"[\"management\",\"engineering\",\"aws\"]","pubDate":"2024-11-27 00:13:08.000","link":"https://duckduckgo.recruitee.com/o/ios-software","savedDate":"2024-12-11 15:26:57.973","slug":"senior-ios-engineer-remote-duckduckgo-6983"}]