[{"id":2557425156,"title":"Business Developer & Marketing Lead (Crypto Wallet)","company":"Status","image":"https://avatars.githubusercontent.com/u/11767950?s=200&v=4","description":"\n    <div class=\"content-intro\"><p style=\"text-align: justify;\"><strong>About Status</strong></p>\n<p style=\"text-align: justify;\"><span style=\"font-weight: 400;\">Status is building the tools and infrastructure for the advancement of a secure, private, and open web3.&nbsp;</span></p>\n<p style=\"text-align: justify;\"><span style=\"font-weight: 400;\">With the high level goals of preserving the right to privacy, mitigating the risk of censorship, and promoting economic trade in a transparent, open manner, Status is building a community where anyone is welcome to join and contribute.</span></p>\n<p style=\"text-align: justify;\"><span style=\"font-weight: 400;\">As an organization, Status seeks to push the web3 ecosystem forward through research, creation of developer tools, and support of the open source community.&nbsp;</span></p>\n<p style=\"text-align: justify;\"><span style=\"font-weight: 400;\">As a product, Status is an open source, Ethereum-based app that gives users the power to chat, transact, and access a revolutionary world of Apps on the decentralized web. But Status is also building foundational infrastructure for the whole Ethereum ecosystem, including the Nimbus ETH 1.0 and 2.0 clients, the Keycard hardware wallet, and the Waku messaging protocol, the p2p communication layer for Web3.</span></p>\n<p style=\"text-align: justify;\"><span style=\"font-weight: 400;\">As a team, Status has been completely distributed since inception. Our team is currently 200+ core contributors strong, and welcomes a growing number of community members from all walks of life, scattered all around the globe.&nbsp;</span></p>\n<p style=\"text-align: justify;\"><span style=\"font-weight: 400;\">We care deeply about open source, and our organizational structure has minimal hierarchy and no fixed work hours. We believe in working with a high degree of autonomy while supporting the organization's priorities.</span></p></div>\n\n    <div class=\"careers-block__trix external-panel text-left\">\n<div>\n<p><strong>The project:</strong></p>\n<p><a href=\"https://keycard.tech/\">https://keycard.tech/</a></p>\n<p>As the Business Development and Marketing Lead for ‘Keycard’ at Status Network, your primary role will be to lead the commercial planning and execution of the strategy to increase the sales of Keycard product, establish partnerships for the upcoming Keycard Pro product, and work with the comms and marketing teams to execute well-planned campaigns to achieve the sales growth objectives.</p>\n<p>This position offers a unique opportunity to lead the business development efforts for one of the fastest-growing segments in Web3 and work on exciting new Wallet and custody products. You will be at the forefront of developing a hardware wallet product that complements other wallets and integrates social and financial dapps deeply, paving the way for a new era of on-chain economic exchange.</p>\n<p>If you are driven by innovation in blockchain technology, eager to lead a cutting-edge project, and passionate about decentralisation and privacy, this role will provide you with the perfect platform to make a significant impact.</p>\n<p>&nbsp;</p>\n<p><strong>Key responsibilities:</strong></p>\n<ul>\n<li>Lead the accelerated development of a business development and marketing plan for Keycard and Keycard Pro products.&nbsp;</li>\n<li>Lead the execution of the plans and be the single point of contact for the program lead for all Business development and marketing initiatives related to Keycard.&nbsp;</li>\n<li>Lead the efforts to identify and prioritise potential partners including DeFi Apps, other software wallets, Developers, Exchanges etc. to improve their understanding of Keycard offer.</li>\n<li>Oversee end-to-end partnership and integration process from initial outreach and engagement through to negotiation, contracting, and final execution, ensuring all partnerships contribute to improving the sales potential for Keycard and improving the market share of Keycard amongst wallets.&nbsp;</li>\n<li>Conduct thorough financial analysis and due diligence on all potential deals to ensure they are not only sustainable but demonstrate the potential to scale.&nbsp;</li>\n<li>Shape the objectives of new marketing campaigns, and coordinate with communications and marketing teams to plan resources and execution of these campaigns, and report on the success measures.&nbsp;</li>\n<li>Oversee the negotiation and management of contracts with existing and potential partners to maximize benefits and ensure compliance with agreed terms.</li>\n<li>Keep internal stakeholders well-informed about the status of deals and partnerships, ensuring transparent and effective communication to facilitate informed decision-making and cohesive strategic alignment.</li>\n<li>Cultivate and nurture strong, enduring relationships with key stakeholders across the blockchain ecosystem, leveraging these relationships to support mutual growth and advance shared objectives.</li>\n<li>Assist in hiring, mentoring, and scaling a top-tier business development and partnerships team capable of meeting the ambitious goals of the network; fostering a culture of innovation and excellence.</li>\n</ul>\n<p>&nbsp;</p>\n<p><strong>You will ideally have:</strong></p>\n<ul>\n<li>5+ years of experience in leading partnerships and customer engagement for products within the tech industry, with a proven ability to manage and grow B2B relationships.&nbsp;</li>\n<li>Natural communicator and coordinator, adept at collaborating with cross-functional teams to achieve organisational goals.&nbsp;</li>\n<li>Comprehensive understanding of blockchain technology, wallets and wallet-related products and DeFi.&nbsp;</li>\n<li>Direct and proven experience in delivering partnerships with Wallets (hardware and/or software) and with the Defi ecosystem, showcasing a technical understanding and practical knowledge of the wallet-related integrations.&nbsp;</li>\n<li>Strong alignment with our organisational principles as outlined in our<a href=\"https://status.app/manifesto\"> manifesto</a>, demonstrating a commitment to privacy, decentralisation, and innovation.&nbsp;</li>\n<li>Skilled in conducting financial analysis and strategic planning, ensuring partnerships enhance key performance metrics and align with long-term objectives.&nbsp;</li>\n</ul>\n<p>&nbsp;</p>\n<p><strong>Bonus points:</strong></p>\n<ul>\n<li>Previous leadership roles or similar responsibilities with other Hardware wallets (and/or Software wallets).&nbsp;</li>\n<li>Comfort with remote and asynchronous work environments.</li>\n<li>Advocate for the crypto/blockchain community and the broader ethos of open-source contribution.</li>\n<li>Enthusiasm for decentralisation and a personal drive to promote censorship resistance within the crypto space.&nbsp;</li>\n</ul>\n<p>[Don’t worry if you don’t meet all of these criteria, we’d still love to hear from you anyway if you think you’d be a great fit for this role. Just explain to us why in your cover letter]</p>\n<p>&nbsp;</p>\n<p><strong>Hiring process:</strong></p>\n<ul>\n<li>Intro call with the Talent Team</li>\n<li>Interview with IFT BD Lead&nbsp;</li>\n<li>Compensated Task&nbsp;</li>\n<li>Pitch Interview with Keycard Lead and IFT BD Lead</li>\n<li>Interview with Co-Founder</li>\n</ul>\n<p>[The steps may change along the way if we see it makes sense to adapt the interview stages, so please consider the above as a guideline]</p>\n<p>&nbsp;</p>\n<p></p>\n<p><strong>Compensation:</strong></p>\n<p>The compensation range for this role is dependent on how we assess your skills and experience throughout our interview process. We are happy to pay in any mix of fiat/crypto.</p>\n</div>\n<p>&nbsp;</p>\n</div>\n\n    \n\n    \n","tags":"[\"management\",\"B2B\"]","pubDate":"2024-08-28 09:51:20.069","link":"https://boards.greenhouse.io/embed/job_app?for=status72&token=6207753&b=https%3A%2F%2Fjobs.status.im%2F","savedDate":"2024-08-28 09:51:20.069","slug":"business-developer-marketing-lead-crypto-wallet-status-5925"},{"id":9025122566,"title":"Blockchain Infrastructure Engineer","company":"Status","image":"https://avatars.githubusercontent.com/u/11767950?s=200&v=4","description":"\n    <div class=\"content-intro\"><p style=\"text-align: justify;\"><strong>About Status</strong></p>\n<p style=\"text-align: justify;\"><span style=\"font-weight: 400;\">Status is building the tools and infrastructure for the advancement of a secure, private, and open web3.&nbsp;</span></p>\n<p style=\"text-align: justify;\"><span style=\"font-weight: 400;\">With the high level goals of preserving the right to privacy, mitigating the risk of censorship, and promoting economic trade in a transparent, open manner, Status is building a community where anyone is welcome to join and contribute.</span></p>\n<p style=\"text-align: justify;\"><span style=\"font-weight: 400;\">As an organization, Status seeks to push the web3 ecosystem forward through research, creation of developer tools, and support of the open source community.&nbsp;</span></p>\n<p style=\"text-align: justify;\"><span style=\"font-weight: 400;\">As a product, Status is an open source, Ethereum-based app that gives users the power to chat, transact, and access a revolutionary world of Apps on the decentralized web. But Status is also building foundational infrastructure for the whole Ethereum ecosystem, including the Nimbus ETH 1.0 and 2.0 clients, the Keycard hardware wallet, and the Waku messaging protocol, the p2p communication layer for Web3.</span></p>\n<p style=\"text-align: justify;\"><span style=\"font-weight: 400;\">As a team, Status has been completely distributed since inception. Our team is currently 200+ core contributors strong, and welcomes a growing number of community members from all walks of life, scattered all around the globe.&nbsp;</span></p>\n<p style=\"text-align: justify;\"><span style=\"font-weight: 400;\">We care deeply about open source, and our organizational structure has minimal hierarchy and no fixed work hours. We believe in working with a high degree of autonomy while supporting the organization's priorities.</span></p></div>\n\n    <div class=\"careers-block__trix external-panel text-left\">\n<p></p>\n<p><strong>The role</strong></p>\n<p>DevOps is a buzzword, but it's also generic enough to encompass the breadth of tasks required in supporting development teams. There are many ways to make the lives of developers easier, and everyone has their own best way, which also means every team has their own way. There is no perfect way to make everyone happy with the same thing.</p>\n<p>Supporting developers involves debugging obscure bash scripts from years ago that nobody remembers. It means biting on a piece of wood and using data formats turned programming languages like YAML to configure CI jobs. It means tracking down minute differences between releases of packages and libraries causing unexpected crashes. It means rewriting the same Dockerfile for the 5th time to allow a project to use one more obscure library. Or tracking down absurd race conditions of multi-threaded tests running in parallel on the same host. Or pulling your hair out at a bug only to realize it works fine after the CI worker host is restarted.</p>\n<p>But fundamentally it means wrestling it all into submission and making it run smoothly... at least for as long as you're there.</p>\n<p>If you have the guts to fight against entropy and deterioration of the reality we inhabit, then you just might also be crazy enough to enjoy the struggle while it lasts, and appreciate the eventual fruits of our labour, if you value privacy, freedom, and transparency. You might even make some money, and learn a bit from all the exceptional engineers working here.</p>\n<p>&nbsp;</p>\n<p><strong>Who you are</strong></p>\n<p>You have strong Linux Fundamentals:</p>\n<ul>\n<li>Distros and package managers</li>\n<li>Good understanding of process management</li>\n</ul>\n<p>You have programming experience:</p>\n<ul>\n<li>At least a few languages and showing the ability to learn</li>\n<li>Bash as a minimum; Python would be helpful&nbsp;</li>\n</ul>\n<p>You have experience in Continuous Integration:</p>\n<ul>\n<li>Jenkins CI - Pipelines are written in Groovy</li>\n<li>GitHub Actions - PR builds, mostly</li>\n</ul>\n<p>You have experience in Security:</p>\n<ul>\n<li>Good understanding of OpenSSH</li>\n<li>GnuPG for encryption of secrets and backups</li>\n</ul>\n<p><span class=\"hljs-strong\">Distributed Systems:</span></p>\n<ul>\n<li>Experience running Ethereum nodes</li>\n<li>Knowledge of Layer 2 scaling solutions</li>\n</ul>\n<p>&nbsp;</p>\n<p><strong>Compensation</strong></p>\n<p>We are happy to pay in any mix of fiat/crypto.</p>\n<p>&nbsp;</p>\n<p><strong>Hiring process</strong></p>\n<ol>\n<li>Interview with the&nbsp;Talent team</li>\n<li>Paid task</li>\n<li>Technical interview with Head of Infra</li>\n</ol>\n<p><em>[The</em>&nbsp;<em>steps may change along the way if we see it makes sense to adapt the interview stages, so please consider the above as a guideline]</em></p>\n<p></p>\n<p>&nbsp;</p>\n</div>\n\n    \n\n    \n","tags":"[\"management\"]","pubDate":"2024-08-28 09:51:20.069","link":"https://boards.greenhouse.io/embed/job_app?for=status72&token=6211963&b=https%3A%2F%2Fjobs.status.im%2F","savedDate":"2024-08-28 09:51:20.069","slug":"blockchain-infrastructure-engineer-status-1384"},{"id":3524935064,"title":"Sales Development Representative [IC1]","company":"Sourcegraph","image":"https://pbs.twimg.com/profile_images/1428393724527190022/4mt5PACL_400x400.png","description":"\n    <div class=\"content-intro\"><h2><strong><span style=\"color: #a112ff;\">Who we are</span></strong></h2>\n<p>Our mission at Sourcegraph is to make it so that <a href=\"https://www.notion.so/sourcegraph/Mission-values-e9d37e6b972a4ef395c3076aea2bd07d?pvs=4\">everyone can code</a>, not just ~0.1% of the population. We're building the code intelligence platform that powers the world's best code search and the most popular open-source code AI tool. It’s an exciting time to join Sourcegraph—AI has taken over the world, and we aim to automate 99% of the toil in software engineering with our code understanding and code AI tools, leaving the remaining 1% to the irreplicable creative spark from humans.&nbsp;</p>\n<p>Our customers range from startups to the Fortune 500, 4/5 FAANG companies, government organizations, Uber, Plaid, and more. We’ve raised $225M at a $2.625B valuation from <a href=\"https://techcrunch.com/2021/07/13/sourcegraph-raises-125m-series-d-on-2-6b-valuation-for-universal-code-search-tool/\">a16z</a>,<a href=\"https://about.sourcegraph.com/blog/series-c-with-sequoia/\"> Sequoia</a>, <a href=\"https://www.redpoint.com/companies/sourcegraph/\">Redpoint</a>, <a href=\"https://medium.com/craft-ventures/why-we-invested-in-sourcegraph-5ace28317e3d\">Craft</a> and others. We’re making ambitious bets on our future and we’re looking to hire exceptional people to join our team as we make Sourcegraph one of the biggest and most influential companies in the world.</p></div>\n\n    <h2><span style=\"color: rgb(161, 18, 255);\"><strong>Location</strong></span></h2>\n<p>🌎 While we are an all-remote company and hire <a href=\"https://sourcegraph.notion.site/How-we-engage-talent-outside-of-the-US-218f7193695a46cbb1ef39ef9c1f72d4\">almost anywhere</a> in the world, we have a preference for someone to reside in the United States for this role. However, if you feel qualified, we welcome you to apply regardless of location. No matter what, working hours must overlap between PST &amp; EST for at least 40 hours/week.</p>\n<p><strong>Preferred locations:</strong></p>\n<ul>\n<li>United States</li>\n</ul>\n<h2><span style=\"color: rgb(161, 18, 255);\"><strong>Why this job is exciting</strong></span></h2>\n<p>As an SDR, you will have more responsibility, upside, and growth potential than anywhere else otherwise comparable. We strive to make Sourcegraph the best company where exceptionally talented people can thrive. If you join us, we know you’ll make a big impact!&nbsp; Here’s what we’re thinking:</p>\n<p>📅 Within one month, you will…</p>\n<ul>\n<li>Begin 1:1’s with your manager, understand your 30-6-90 plan, meet &amp; shadow current members of the Sourcegraph team, and delve into your territory</li>\n<li>Set your OKRs (Objectives and Key Results) with your manager and develop an action plan to achieve them</li>\n<li>Begin to prospect within your target accounts and understand how to utilize your knowledge to overcome objections</li>\n</ul>\n<p>📅 Within three months, you will…</p>\n<ul>\n<li>Have a strong understanding of Sourcegraph and feel comfortable pitching our software to prospects from self-sourced efforts</li>\n<li>Meet regularly with your assigned Account Executives, Manager, and peers to become an expert on the product, talk track and prospecting</li>\n<li>Continue your education around Sourcegraph’s competitive advantage and continue to strengthen your business acumen</li>\n<li>Consistently achieve your activity goals</li>\n<li>Become an expert on internal tools and processes</li>\n</ul>\n<p>📅 Within six months, you will…</p>\n<ul>\n<li>Consistently meet or exceed your quota</li>\n<li>Complete trainings to ensure you are up-to-date on new releases and more</li>\n<li>Continue to focus on your OKRs</li>\n<li>Assist in the development of best practices for lead generation</li>\n</ul>\n<p>📅 Within one year, you will…</p>\n<ul>\n<li>Be seen as a trusted business-advisor and Sourcegraph expert, making a significant impact on the Lead Generation team</li>\n<li>Be considered a top-performing SDR on the team by consistently exceeding your goals</li>\n<li>Work with sales and marketing to help create new campaigns to drive pipeline</li>\n<li>Set an example for new SDRs, and assist in training, onboarding and motivating new team members</li>\n</ul>\n<h2><span style=\"color: rgb(161, 18, 255);\"><strong>About you&nbsp;</strong></span></h2>\n<p>Our SDRs are hard-working, results-driven, and passionate sales professionals! We are prospecting machines - passionate about applying our hunter mentality and desire to win. We celebrate the wins together and help each other through uncharted territory.</p>\n<p>You are an enthusiastic, driven, and results-oriented SDR who shares <a href=\"https://sourcegraph.notion.site/Mission-values-e9d37e6b972a4ef395c3076aea2bd07d\">our values</a> and has a passion for all things sales. We are seeking a results-oriented, motivated and strategic ‘hunter’ who is laser-focused on building a sales pipeline without our target market.&nbsp; On a day-to-day basis, you will be responsible for cold-calling prospects and educating the market about the power of Sourcegraph and generating opportunities with net-new customers.&nbsp; You will become an expert at using lead generation tools to routinely extract contacts and craft accurate and targeted lists of prospects. You will be able to conduct sales development best practices with email, phone, and social drips to connect with new prospects.</p>\n<p>🔍 Your skill-set:</p>\n<ul>\n<li>2+ years of relevant sales experience required; internship experience will be considered</li>\n<li>Previous cold calling experience required</li>\n<li>Collaborative mentality by prioritizing ‘we’ and not focusing on ‘me’</li>\n<li>Results driven &amp; competitive nature</li>\n<li>Superb writing, communication, and listening skills; you must understand objections and defeat them by turning skeptics into ecstatic new customers</li>\n<li>Outstanding time management skills</li>\n<li>High level of empathy - it’s important for our SDR’s to be a good person to peers and prospects</li>\n<li>Proven ability to make strong connections and overcome rejection to achieve results</li>\n<li>Desire to grow in your career</li>\n</ul>\n<h2><span style=\"color: rgb(161, 18, 255);\"><strong>Level</strong></span></h2>\n<p>📊 This job is an IC1. You can read more about <a href=\"https://www.notion.so/sourcegraph/Leveling-Guide-0e1b5c76ada64b9caac387f8b7c4fc66?pvs=4\">our job leveling philosophy</a> in our Handbook.</p>\n<h2><span style=\"color: rgb(161, 18, 255);\"><strong>Compensation</strong></span></h2>\n<p><strong>💸 We pay you an above-average salary</strong> because we want to hire the best people who are fully focused on helping Sourcegraph succeed, not worried about paying bills. As an <a href=\"https://sourcegraph.notion.site/Mission-values-e9d37e6b972a4ef395c3076aea2bd07d\">open and transparent</a> company that values <a href=\"https://www.notion.so/sourcegraph/Compensation-Pay-Transparency-at-Sourcegraph-d58d0774f51b4b489d41c3628d30ff8d\">competitive compensation</a>, our compensation ranges are visible to every single Sourcegraph teammate.</p>\n<p>To determine your salary, we use a number of market and data-driven salary sources, along with your location zone, and target the high-end of the range to ensure we’re always paying above market regardless of where you live in the world. Both U.S. and international locations are divided into one of four zones, determined by the cost of labor index for each area. The starting salary for a successful candidate will be based on level, job-related skills, experience, qualifications, and location zone. Please note that these salary ranges may be adjusted in the future.</p>\n<p>💰 The target compensation for this role is $70,000 USD base + $30,000 USD variable ($100,000 USD on-target-earnings).&nbsp;</p>\n<p>📈 In addition to our cash compensation, we offer equity (because when we succeed as a company, we want you to succeed, too) and generous <a href=\"https://sourcegraph.notion.site/Benefits-Perks-dd1da4b6b3a64780abed010a144d34ba\">perks &amp; benefits</a>.</p>\n<h2><span style=\"color: rgb(161, 18, 255);\"><strong>Interview process&nbsp;</strong></span></h2>\n<p><em>Below is the interview process you can expect for this role (you can read more about <a href=\"https://sourcegraph.notion.site/Types-of-interviews-f279f080583d49ee9f2c60e30c8cb1f7\">the types of interviews</a> in our Handbook). It may look like a lot of steps, but rest assured that we move quickly and the steps are designed to help you get the information needed to determine if we’re the right fit for you… Interviewing is a two-way street, after all!&nbsp;</em></p>\n<p>We expect the interview process to take 5 hours in total.</p>\n<p><strong>👋 Introduction Stage</strong> - we have initial conversations to get to know you better…</p>\n<ul>\n<li>[30m] <a href=\"https://www.notion.so/sourcegraph/Types-of-interviews-sample-questions-f279f080583d49ee9f2c60e30c8cb1f7?pvs=4#99be5ff628b2414194a0ba79d9f25f13\">Recruiter Screen</a></li>\n<li>[45m] <a href=\"https://www.notion.so/sourcegraph/Types-of-interviews-sample-questions-f279f080583d49ee9f2c60e30c8cb1f7?pvs=4#1919882c0cf147c487eb1df40db8a694\">Hiring Manager screen</a>&nbsp;/ <a href=\"https://www.notion.so/sourcegraph/Types-of-interviews-sample-questions-f279f080583d49ee9f2c60e30c8cb1f7?pvs=4#c678a2a86e0e47e4958507e869bf7ded\">Resume Deep Dive</a></li>\n</ul>\n<p><strong>🧑‍💻 Team Interview Stage</strong> - we then delve into your experience in more depth and introduce you to members of the team, including cross-functional partners…</p>\n<ul>\n<li>[60m] We send you a <a href=\"https://www.notion.so/sourcegraph/Sales-Interview-Process-3e8dd4fe14d845ffb44e2618f303365f?pvs=4#98f75aad67a940dc971af35920cff638\">writing assignment</a> to be completed prior to your next interview.&nbsp;&nbsp;</li>\n<li>[45m] <a href=\"https://www.notion.so/sourcegraph/Sales-Interview-Process-3e8dd4fe14d845ffb44e2618f303365f?pvs=4#1a53595024d74f4ba9a27bac51ead200\">Mock Cold Call</a> / Homework assignment review&nbsp;</li>\n<li>[30m] <a href=\"https://www.notion.so/sourcegraph/Types-of-interviews-sample-questions-f279f080583d49ee9f2c60e30c8cb1f7?pvs=4#88b9f826dee04ef98afc2aeec35b877a\">Peer</a></li>\n</ul>\n<p><strong>🎉 Final Interview Stage </strong>- we move you to our final round, where you gain a better understanding of our business and values holistically…</p>\n<ul>\n<li>[30m]&nbsp;<a href=\"https://www.notion.so/sourcegraph/Types-of-interviews-sample-questions-f279f080583d49ee9f2c60e30c8cb1f7?pvs=4#e3a04291743048df87541a88aa8199dd\">Values</a></li>\n<li>[30m] <a href=\"https://www.notion.so/sourcegraph/Types-of-interviews-sample-questions-f279f080583d49ee9f2c60e30c8cb1f7?pvs=4#80e2ecaed5854b1ba510b2e391c0c67b\">Leadership</a> with VP, Sales, Brock Perko or Connor O’Brien&nbsp;</li>\n<li>We check references and conduct your background check</li>\n</ul>\n<p>Please note - you are welcome to request additional conversations with anyone you would like to meet, but didn’t get to meet during the interview process.</p>\n\n    \n\n    <div class=\"content-conclusion\"><h2><strong><span style=\"color: #a112ff;\">Not sure if this is you?</span></strong></h2>\n<p><span style=\"font-weight: 400;\">We want a diverse, global team, with a broad range of experience and perspectives. If this job sounds great, but you’re not sure if you qualify, apply anyway! We carefully consider every application, and will either move forward with you, find another team that might be a better fit, keep in touch for future opportunities, or thank you for your time.</span></p>\n<h2><strong><span style=\"color: #a112ff;\">Learn more about us</span></strong></h2>\n<p><span style=\"font-weight: 400;\">To create a product that serves the needs of all developers, we are building a diverse </span><a href=\"https://sourcegraph.notion.site/All-remote-guidelines-4d1270d806294bf4ae6db7ab02911957\"><span style=\"font-weight: 400;\">all-remote team</span></a><span style=\"font-weight: 400;\"> that is </span><a href=\"https://www.notion.so/sourcegraph/7ed54d4ec4624475a4b45619901236d7?v=e06d936c673f46ca8c313a557bd4410f\"><span style=\"font-weight: 400;\">distributed across the world</span></a><span style=\"font-weight: 400;\">. Sourcegraph is an equal opportunity workplace; we welcome people from all backgrounds and communities.&nbsp;</span></p>\n<p><span style=\"font-weight: 400;\">We provide </span><a href=\"https://sourcegraph.notion.site/Compensation-Pay-Transparency-at-Sourcegraph-d58d0774f51b4b489d41c3628d30ff8d?pvs=74\"><span style=\"font-weight: 400;\">competitive compensation</span></a><span style=\"font-weight: 400;\"> and </span><a href=\"https://sourcegraph.notion.site/Benefits-Perks-dd1da4b6b3a64780abed010a144d34ba?pvs=74\"><span style=\"font-weight: 400;\">practical benefits</span></a><span style=\"font-weight: 400;\"> to keep you happy and healthy so that you can do your best work.&nbsp;</span><span style=\"font-weight: 400;\">&nbsp;</span></p>\n<p><span style=\"font-weight: 400;\">Learn more about what it is like to work at Sourcegraph by reading </span><a href=\"https://sourcegraph.notion.site/d7614e3e9dc04c09ac2d42d57f1816e6?v=2a6d426dbae14390b155120b0c029ce0\"><span style=\"font-weight: 400;\">our handbook</span></a><span style=\"font-weight: 400;\">.</span></p>\n<p><span style=\"font-weight: 400;\">We want to ensure Sourcegraph is an environment that suits your working style and empowers you to do your best work, so we are eager to answer any questions that you have about us at any point in the interview process.</span></p>\n<p><span style=\"font-weight: 400;\">Go back to the </span><a href=\"https://about.sourcegraph.com/jobs/\"><span style=\"font-weight: 400;\">careers page</span></a><span style=\"font-weight: 400;\"> for all open positions.</span></p>\n<p><em><span style=\"font-weight: 400;\">Sourcegraph participates in <a href=\"https://sourcegraph.notion.site/E-Verify-2ab3286dde3446d6bac2898c83610107\" target=\"_blank\">E-Verify</a> for U.S. Employees</span></em></p></div>\n","tags":"[\"management\",\"engineering\"]","pubDate":"2024-08-28 09:51:20.068","link":"https://boards.greenhouse.io/sourcegraph91/jobs/5267954004","savedDate":"2024-08-28 09:51:20.069","slug":"sales-development-representative-ic1-sourcegraph-7943"},{"id":2093397802,"title":"Sandbox Lead","company":"Crytek","image":"https://pbs.twimg.com/profile_images/1031556251782705153/l7Ht7Yer_400x400.jpg","description":"<div><span style=\"font-size: 16px;\">This is an exciting opportunity for the right candidate to lead the development of the Editor within CRYENGINE. Productive, happy developers make great games, and you will play a vital role!</span></div><div><br></div><div><b><u><span style=\"font-size: 16px;\">Relocation &amp; Remote Work</span></u></b></div><div><br></div><div><span style=\"font-size: 16px;\">For this position, you have one of the following options:</span></div><div><br></div><div><span style=\"font-size: 16px;\">1. Come to our modern headquarters in Frankfurt and receive an attractive relocation package and have access to all of our benefits.</span></div><div><br></div><div><span style=\"font-size: 16px;\">2. If you are already living in one of the following countries, we are able to offer you a permanent work contract and allow you to work remotely&nbsp;as an employee&nbsp;from there.&nbsp;</span></div><div><span style=\"font-size: 16px;\">Germany</span></div><div><span style=\"font-size: 16px;\">Sweden</span></div><div><span style=\"font-size: 16px;\">United Kingdom</span></div><div><span style=\"font-size: 16px;\">Spain</span></div><div><span style=\"font-size: 16px;\">Poland</span></div><div><span style=\"font-size: 16px;\">Austria</span></div><div><br></div><div><span style=\"font-size: 16px;\">3. If you are interested in full-time remote work in any other country (max. +/- 2 hours CET), we&nbsp;can offer you&nbsp;a freelance contract arrangement.</span></div><h3>Responsibilities</h3><li>Lead the development of CRYENGINE’s editor framework.</li><li>Collaborate with the teams within Crytek to understand the requirements of our developers to create clear roadmaps for CRYENGINE Editor tooling.</li><li>Lead and mentor a diverse engine team and provide an environment setup for them to thrive and enjoy their work.</li><li>Assist production staff in planning and maintaining development schedule</li><li>Support live games with systems and regular Engine updates</li><li>Ensure reliability, stability and quality of the editor code base.</li>,<h3>Requirements</h3><li>Bachelor's Degree or equivalent experience in Computer Science or related field</li><li>Experience working on AAA game titles in a Senior or Lead technical position within Tools or Game Engine.</li><li>Strong technical background and leadership skills.</li><li>Strong written and verbal communication skills in English</li><li>C++, QT</li><li>Very good knowledge of asset creation pipelines.</li><li>Knowledge of common UI architecture strategies such as MVC, MVP, MVVM, MVI and when best to deploy them.</li><div><b style=\"font-size: 2.2rem;\">What you can expect from us</b></div><div><br></div><div><b>Career Path&nbsp;</b></div><div>Your professional development is important to us, so we have laid out a career plan to help you progress towards your goals and objectives.&nbsp;</div><div><br></div><div><b>Company Apartment&nbsp;</b></div><div>To help you get settled, we provide you with a fully furnished company apartment during your first three months in Frankfurt.*&nbsp;</div><div>&nbsp;</div><div><b>Relocation&nbsp;Support&nbsp;</b></div><div>We offer a relocation budget and full coverage of flights to Frankfurt for you and your family.&nbsp;</div><div>You can expect extensive assistance with visa, work permits, and communication with authorities during the relocation process, as well as help settling into Germany (e.g. setting up appointments with banks, government agencies, schools, landlords, finding apartments etc.).*&nbsp;</div><div><b>&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;</b></div><div><b>Public Transport Pass&nbsp;</b></div><div>Discover Frankfurt by bus, tram and metro – free of charge.*&nbsp;</div><div>&nbsp;</div><div><b>Gym Card&nbsp;</b></div><div>A healthy body is a healthy mind. We offer a membership at the premium gym chain Fitness First in Germany. Work out, join group fitness classes, or relax in the wellness facilities.</div><div>&nbsp;</div><div><b>International Environment&nbsp;</b></div><div>We truly embody diversity at Crytek. With employees from over 42 different countries, we define ourselves by our cultural diversity.&nbsp;</div><div><br></div><div><b>German Classes&nbsp;</b></div><div>Understanding the local culture will make your stay abroad more enjoyable, and Crytek supports that by offering German language courses for you and your family.&nbsp;</div><div>&nbsp;&nbsp;</div><div><b>Events</b></div><div>Join us on our exciting company events, including new starter breakfasts, summer and winter parties, our annual trip to Gamescom in Cologne, and many more!*&nbsp;</div><div>We are all gamers: stay connected and play games with your colleagues at our remote gaming parties.</div><div>&nbsp;</div><div><b>Vacation Days&nbsp;</b></div><div>At our Frankfurt office you can enjoy 24 days of vacation per year, and every 2 years you get 1 more (up to a maximum of 28 days). You will also have on average 10 public holidays on top of the days you take off. If you are working from another country, local standards apply.</div><div>&nbsp;&nbsp;</div><div>*only applicable to employees in Frankfurt.</div>","tags":"[]","pubDate":"2024-08-27 14:41:26.645","link":"https://jobs.lever.co/crytek/9941996e-f13c-4c53-a278-9274942a9319","savedDate":"2024-08-28 09:51:20.072","slug":"sandbox-lead-crytek-7801"},{"id":9966900213,"title":"Principal Software Engineer - C at CloudLinux (worldwide remote, work anywhere)","company":"CloudLinux","image":"https://pbs.twimg.com/profile_images/696718028084482050/ymY3OEPk_400x400.png","description":"<p>Join our innovative team at CloudLinux OS as a Principal Software Engineer. You'll have the opportunity to work on groundbreaking projects that are redefining enterprise cybersecurity. As a Principal Software Engineer, you'll not only drive our cutting-edge initiatives but also advance your career through our dynamic leadership programs and challenging assignments. If you're ready to take your expertise to the next level, CloudLinux is where you belong.</p><p>CloudLinux OS, our flagship product, runs on more than 50,000 production servers today, powering over 40 million websites, and is recognized as the best OS for security and efficiency in a shared hosting environment. CloudLinux OS increases server density and enhances security, thus reducing operating costs, decreasing churn rates, and increasing profitability.</p><p>Check out our website for more information about our CLOS Product&nbsp;<a href=\"https://www.cloudlinux.com/\" target=\"_blank\" rel=\"nofollow noreferrer noopener\" class=\"external\">https://www.cloudlinux.com/</a></p><p></p><p><strong>Key Responsibilities</strong></p><ul> <li>Architect, implement, and oversee server-side solutions utilizing Linux networking technologies with strong emphasis on optimization\t</li> <li>Lead the development of high-quality software products, ensuring adherence to coding standards and Agile methodologies</li> <li>Drive collaboration among development teams, testers, and stakeholders to achieve sprint objectives, providing guidance on technical priorities</li> <li>Provide accurate estimations of project effort during sprint planning, evaluate open-source alternatives, and offer strategic recommendations</li> <li>Develop and maintain comprehensive unit tests for critical software components to uphold code quality and reliability</li> <li>Champion process improvements, including coding practices, standards, and tooling, to enhance team productivity and efficiency</li> <li>Demonstrate proactive leadership in task prioritization, focusing on value delivery and meeting project deadlines</li> <li>Facilitate design and peer code reviews, offering expert insights and constructive feedback to foster a culture of excellence</li> <li>Conduct thorough technical root cause analysis and debugging to address software defects and operational challenges effectively</li> <li>Foster continuous self-improvement among team members, promoting the development of technical and communication skills</li> </ul><p></p><h3>Requirements: </h3><p><strong>To thrive in this role, we are looking for someone who has:</strong></p><ul> <li>8 years of progressive experience in software development, with a strong proficiency in C/C++</li> <li>Extensive hands-on experience in building server-side applications and services using C/C++, coupled with expertise in performance tuning</li> <li>Deep knowledge of various Web Application Firewall (WAF) implementations and experience working with them</li> <li>Hands-on experience in Linux (experience with popular distributions such as CentOS and Debian)</li> <li>A deep understanding of web server architecture, designing and building modules for Nginx and/or Apache is highly desirable</li> <li>Proven track record of designing and implementing robust server-side solutions, web servers preferably&nbsp;&nbsp;</li> <li>Deep knowledge and practical experience in network-based solutions</li> <li>Knowledge and experience with Python, Bash, C, and SQL</li> </ul><h3>Benefits: </h3><p><strong>What's in it for you?</strong></p><ul> <li>A focus on professional development</li> <li>Interesting and challenging projects</li> <li>Fully remote work with flexible working hours, that allows you to schedule your day and work from any location worldwide</li> <li>Paid 24 days of vacation per year, 10 days of national holidays, and unlimited sick leaves</li> <li>Compensation for private medical insurance</li> <li>Co-working and gym/sports reimbursement</li> <li>Budget for education</li> <li>The opportunity to receive a reward for the most innovative idea that the company can patent</li> </ul><p></p><p></p><p><em>By applying for this position, you agree with the CloudLinux Privacy Policy - </em><a href=\"https://cloudlinux.com/privacy-policy\" target=\"_blank\" rel=\"nofollow noreferrer noopener\" class=\"external\">https://cloudlinux.com/privacy-policy</a><a href=\"https://cloudlinux.com/privacy-policy\" target=\"_blank\" rel=\"nofollow noreferrer noopener\" class=\"external\"></a><em>and give us your consent to maintain and process your personal data in this respect. Please read our Privacy Policy for more information - </em><a href=\"https://cloudlinux.com/privacy-policy\" target=\"_blank\" rel=\"nofollow noreferrer noopener\" class=\"external\">https://cloudlinux.com/privacy-policy</a><em> .</em></p>","tags":"[]","pubDate":"2024-08-27 00:00:00.000","link":"https://apply.workable.com/cloudlinux-1/j/31B383177E","savedDate":"2024-08-28 09:51:20.070","slug":"principal-software-engineer-c-at-cloudlinux-worldwide-remote-work-anywhere-cloudlinux-3172"},{"id":4921416140,"title":"Front-End Developer (worldwide remote, work anywhere)","company":"CloudLinux","image":"https://pbs.twimg.com/profile_images/696718028084482050/ymY3OEPk_400x400.png","description":"<p>CloudLinux is a global remote-first company. We are driven by our principles: Do the right thing, employees first, we are remote first, and&nbsp; we deliver high volume, low-cost Linux infrastructure and security products that help companies to increase the efficiency of their operations. Every person on our team supports each other and does what we can to ensure everyone is successful. We are truly a great place to work. For more details about our company go to <a href=\"http://cloudlinux.com/\" rel=\"nofollow noreferrer noopener\" class=\"external\">CloudLinux</a>.</p><p>We are actively seeking a Front-End Developer to become an integral part of our dynamic CloudLinux Network team.</p><p>CLN is an integral SaaS platform tasked with the licensing of all CloudLinux products. It manages server operations and oversees the billing process for customers. This is a unique self-provisioning system created by CloudLinux for internal needs. The automated, easy-to-use robust solution delivers comprehensive and complete user experience. We will give you a place to strive and grow, where you will have the opportunity to work on interesting, yet challenging product. Applying your thinking to build a better system founded on intelligent technologies.</p><p>The perfect candidate will possess an in-depth understanding of Angular, complemented by prior experience in backend development and familiarity with various other frameworks.</p><p>We offer a fully remote work environment with flexible hours, allowing you the freedom to structure your day and work from any location worldwide. Join us in our mission to provide top-tier services to our valued customers.<a href=\"https://docs.cloudlinux.com/cln/introduction/\" target=\"_blank\" rel=\"nofollow noreferrer noopener\" class=\"external\"></a></p><p></p><p><strong>What you will do:</strong></p><p>As a key member of our team, you will spend approximately 80% of your time crafting a user-friendly customer portal. This platform will empower our clients to effortlessly manage their subscriptions and servers, while also providing an intuitive admin panel designed to deliver an unparalleled licensing and billing experience.</p><p>Occasionally, you will also be able to contribute to diverse front-end projects for our Extended Lifecycle Support (ELS) initiative. ELS is our commitment to helping organizations securely utilize Linux distributions and software languages that have reached their end of life or no longer receive standard security support. We provide essential vulnerability patches for unsupported versions of CentOS, CentOS Stream, Ubuntu, Debian, Oracle Linux, PHP, Python, and the Spring software development framework.</p><h3>Requirements: </h3><p><strong>To thrive in this role, we are looking for someone who has:</strong></p><ul> <li>5+ years of experience with Javascript.</li> <li>Strong knowledge of TypeScript/JavaScript, Angular.</li> <li>Experience and understanding of optimization principles.</li> <li>The practice of unit testing.</li> <li>Experience HTML &amp; CSS/SCSS.</li> <li>Knowledge of regular expressions.</li> <li>Intermediate level of English.</li> <li>Version control/code management (git).<br> </li> </ul><p><strong>It would be great if you also have:</strong></p><ul> <li>Experience in backend and PHP.</li> <li>Knowledge of NodeJS, Lumen, VueJS.</li> <li>Experience with Database IDE, such as MySQL.</li> </ul><p></p><p><strong>Personal skills:</strong></p><ul> <li>Decency, responsibility, and a high level of discipline.</li> <li>Fast-learning, proactivity.</li> <li>Desire to work in a fast-paced growing environment.</li> <li>Strong self-motivation, driven to achieve committed milestones.</li> <li>Ability to independently analyze a task and find the right solution.</li> <li>Ability to work in a team.</li> </ul><h3>Benefits: </h3><p><strong>What's in it for you?</strong></p><ul> <li>A focus on professional development</li> <li>Interesting and challenging projects</li> <li>Fully remote work with flexible working hours, that allows you to schedule your day and work from any location worldwide</li> <li>Paid 24 days of vacation per year, 10 days of national holidays, and unlimited sick leaves</li> <li>Compensation for private medical insurance</li> <li>Co-working and gym/sports reimbursement</li> <li>Budget for education</li> <li>The opportunity to receive a reward for the most innovative idea that the company can patent</li> </ul><p></p><p><em>By applying for this position, you agree with the CloudLinux Privacy Policy - </em><a href=\"https://cloudlinux.com/privacy-policy\" target=\"_blank\" rel=\"nofollow noreferrer noopener\" class=\"external\">https://cloudlinux.com/privacy-policy</a><a href=\"https://cloudlinux.com/privacy-policy\" target=\"_blank\" rel=\"nofollow noreferrer noopener\" class=\"external\"></a><em> and give us your consent to maintain and process your personal data in this respect. Please read our Privacy Policy for more information - </em><a href=\"https://cloudlinux.com/privacy-policy\" target=\"_blank\" rel=\"nofollow noreferrer noopener\" class=\"external\">https://cloudlinux.com/privacy-policy</a><em> .</em></p>","tags":"[\"javascript\",\"typescript\",\"management\",\"database\",\"mysql\"]","pubDate":"2024-08-27 00:00:00.000","link":"https://apply.workable.com/cloudlinux-1/j/9286FE20AF","savedDate":"2024-08-28 09:51:20.070","slug":"front-end-developer-worldwide-remote-work-anywhere-cloudlinux-4060"},{"id":5414631145,"title":"Solutions Architect - Fully Remote","company":"CoverGo","image":"https://pbs.twimg.com/profile_images/1382655628523364355/MWPIbbID_400x400.jpg","description":"<p><strong>Top 3 Reasons To Join Us</strong></p><ul> <li>Competitive Salary</li> <li>International Environment</li> <li>Working on the latest tech for the Insurtech Market Leader</li> </ul><p><strong>About Us</strong></p><p>At CoverGo, our mission is to empower all insurance companies to make insurance 100% digital and accessible to everyone.</p><ul> <li>We are a leading global no-code insurance platform for health, life, and P&amp;C</li> <li>We’re the winner of the Insurtech of the Year in all of Asia and other awards globally</li> <li>We work with insurance enterprise clients such as AXA, Bupa, MSIG, Dai-ichi, Bank of China Group Insurance, and many more</li> <li>We're an international, diverse team of over 120 people with 30 nationalities and team members working remotely from all over the world</li> <li>We are fully funded and backed by reputable VC funds and strategic institutional investors</li> <li>We have a global presence in Asia, EMEA and the Americas</li> <li>We’ve grown our annualized revenue by over 30x since January 2021</li> <li>We’re constantly working towards making CoverGo a workplace that you love coming to. We deeply believe that bringing together a diversity of thoughts, expressions, and perspectives is key to building the best culture for equally diverse communities all over the world</li> </ul><p><strong>About the Role</strong></p><p>A cloud technology-focused individual providing design and delivery expertise for forward-looking solutions in a modern cloud-based insurance environment. The successful candidate will work directly with clients, assessing their needs, designing tailored solutions, and supporting business initiatives in alignment with defined roadmaps. This role is technology agnostic but emphasizes solutions leveraging heavily on AWS and/or GCP environments, incorporating elements of open-source, PaaS, and SaaS components.</p><p><strong>What You Will Do</strong></p><ul> <li>Engage with clients to understand their requirements and advise on appropriate solution architectures</li> <li>Collaborate with Product Managers to ensure alignment between client needs and solution design</li> <li>Work closely with Delivery Managers to oversee the architecture approach during solution deployment</li> <li>Explore a range of possibilities and creative alternatives to identify the most effective solutions</li> <li>Ensure that designed solutions are implemented in accordance with client expectations and company standards</li> <li>Assist in identifying, specifying, and selecting off-the-shelf components to meet client needs</li> <li>Provide ongoing support and guidance to clients throughout the implementation process</li> <li>Maintain awareness of industry trends and emerging technologies to continuously improve solutions</li> </ul><p><strong>Required Skills and Knowledge</strong></p><ul> <li>At least 6 years of professional experience in solution architecture design and delivery roles in the insurance vertical with exposure to multiple lines of business</li> <li>Experienced in delivering cloud-based technology product solutions in an enterprise environment</li> <li>Ability to assist in defining and socialising a product/enterprise roadmap</li> <li>Ability to translate client requirements into actionable steps and solution architectures</li> <li>Understand business architecture models &amp; patterns</li> <li>Has designed and implemented innovative and creative solutions to business problems</li> <li>Can think \"outside the box\", but also be able to understand the business constraints that lead to “in the box” approaches</li> <li>Understand the optimum approaches for cloud-based applications with high availability and highly scalable solutions</li> <li>Experienced in designing solutions in a Relational DB and noSQL environment&nbsp;</li> <li>Experienced in designing for API &amp; Micro-services centric environments&nbsp;</li> <li>Demonstrated capability to self-learn new technology trends and approaches</li> <li>Ideally has experience or understanding of the benefits of low-code platforms&nbsp;</li> <li>While the Solution Architect is not expected to build the solutions experience of multiple development languages &amp; various DB engines will be advantageous</li> <li>Exposure to authentication and authorisation concepts (SSO, SAML integration, identity federation etc)</li> <li>Excellent communication skills, both written and verbal</li> </ul><p><strong>Required Competencies</strong></p><ul> <li>Must be equally comfortable discussing the solution strategies and enterprise roadmap with people at all levels of our organisation and CxO to project-level teams in our clients</li> <li>Strong analytical skills &amp; ability to understand and collect business requirements from corporate clients.</li> <li>Strong ability to build the value proposition and solution documents, and in some cases, the business case for a corporate client.</li> <li>Relationship management experience with corporate clients.</li> <li>Excellent organisational, interpersonal &amp; communication skills and an ability to engage audiences</li> <li>Excellent decision-making and judgment skills</li> <li>Understanding of insurance business processes across all areas and at least two lines of business</li> <li>Maintains direction and focus through proactive planning and organized approaches to work</li> <li>Certification in one architecture discipline (TOGAF, Zachman, etc.) is a distinct advantage</li> <li>Certification in one cloud environment is a distinct advantage with a broad knowledge and experience of the cloud platform’s capabilities</li> <li>A high proficiency in working in English as your primary language</li> </ul><p><strong>Why You'll Love Working Here</strong></p><ul> <li>Fully Remote</li> <li>Flexible Leave</li> <li>International Environment</li> <li>Competitive renumeration package</li> <li>Performance Bonus</li> <li>Stock Options after 6 months </li> <li>Remote work allowance</li> <li>Company activities and events</li> <li>Learning and development plan</li> </ul><p><strong>CoverGo Company</strong><a href=\"https://www.youtube.com/watch?v=YI0ezLxvFvA\" rel=\"nofollow noreferrer noopener\" class=\"external\"><strong> Video</strong></a></p><p>By submitting your application, you confirm that you have read, understood, and accepted the content of CoverGo’s <a href=\"https://apply.workable.com/covergo/gdpr_policy?lng=en\" target=\"_blank\" rel=\"nofollow noreferrer noopener\" class=\"external\">Privacy Notice</a> and you consent to the processing of your data as part of this application.</p><h3>Requirements: </h3><h3>Benefits: </h3>","tags":"[\"management\",\"aws\"]","pubDate":"2024-08-27 00:00:00.000","link":"https://apply.workable.com/covergo/j/76E67D29B9","savedDate":"2024-08-28 09:51:20.070","slug":"solutions-architect-fully-remote-covergo-4955"}]