[{"id":5272391182,"title":"Staff Engineer","company":"Canonical","image":"https://pbs.twimg.com/profile_images/1673959375340290050/x7pNtXQ7_400x400.jpg","description":"\n      <p>This is a general track for Staff Engineer or above in any team at Canonical. After the first round of interviews we will establish which teams might be an excellent fit, and progress your application with them.</p>\n<p>Canonical delivers open source to the world across every class of compute. Canonical Ubuntu is the world’s favourite Linux for cloud, desktop and IoT. Our engineering teams work on operating systems, programming languages, applications, devices, infrastructure and services. We work in Golang, Python, C, C++, and Rust for system services, and use React and Flutter on the front end.</p>\n<p>In our levelling framework, a Staff Engineer is not only an outstanding software architect and coder, they also demonstrate the leadership qualities needed to work across teams and products, enabling others to create outstanding technologies and communities. A Staff Engineer partners with an Engineering Director, who is also code-capable, and together they take responsibility for product outcomes. We hire based on academic results and proven product execution, and we select those with a passion for open-source software, innovation, and cutting-edge technology. In this role, you will make a significant contribution in Canonical's portfolio through high-quality code, technical leadership, team motivation and direction, exceptional design, and crisp documentation.</p>\n<p>As a Staff Engineer you'll drive the architecture, design and evolution of high-impact open source. Our teams work at every level of the stack. From the kernel and system software at the core of Ubuntu through to major language runtimes and the bleeding-edge of cloud automation and distributed systems, you'll have the opportunity to work on complex but highly rewarding projects. Our teams also build the services which deliver Ubuntu to the world, on cloud, devices, servers and PCs.</p>\n<p>Additionally, this role will give you the opportunity to engage with the broader open-source community. We're looking for individuals who can help build a thriving community, contribute to a broad range of technologies, and ensure seamless software operations at scale.</p>\n<p>Location: we have remote opportunities for Staff Engineers in every time zone.</p>\n<h2>What your day will look like</h2>\n<ul>\n<li>Lead design and architecture of an impactful open source project</li>\n<li>Code in Golang, Rust, Python, C/C++ or Typescript / React</li>\n<li>Collaborate proactively with a globally distributed team</li>\n<li>Mentor, develop and advise colleagues in their career progression&nbsp;</li>\n<li>Display technical leadership in Canonical and our communities&nbsp;</li>\n<li>Debug issues and produce high-quality code to fix them&nbsp;</li>\n<li>Contribute to technical documentation with the aim to make it the best of its kind&nbsp;</li>\n<li>Work from home with global travel twice annually for company events&nbsp;</li>\n</ul>\n<h2>What we are looking for in you</h2>\n<ul>\n<li>An exceptional academic track record from both high school and university</li>\n<li>Undergraduate degree in Computer Science or STEM, or a compelling narrative about your alternative path</li>\n<li>Drive and a track record of going above-and-beyond expectations</li>\n<li>Technical leadership as well as team motivation, direction and pace</li>\n<li>Well-organised, self-starting and able to deliver to schedule</li>\n<li>Professional manner interacting with colleagues, partners, and community</li>\n<li>Deep experience with at least one of Go, Rust, Python or C&nbsp;</li>\n<li>Subject matter expertise in your engineering domain</li>\n<li>Conscientiousness and detail orientation, with a focus on performance</li>\n<li>Professional written and spoken English&nbsp;</li>\n<li>Experience with Linux (Debian or Ubuntu preferred)&nbsp;</li>\n<li>Excellent interpersonal skills, curiosity, flexibility, and accountability&nbsp;</li>\n<li>Passion, thoughtfulness, and self-motivation&nbsp;</li>\n<li>Excellent communication and presentation skills&nbsp;</li>\n<li>Result-oriented, with a personal drive to meet commitments&nbsp;</li>\n<li>Ability to travel twice a year, for company events up to two weeks each</li>\n</ul>\n<h2>Additional skills that you might also bring</h2>\n<ul>\n<li>Experience with container technologies such as LXD, Docker and Kubernetes&nbsp;</li>\n<li>Experience with highly concurrent, distributed systems</li>\n<li>Experience with embedded systems&nbsp;</li>\n<li>Performance engineering – from kernel to web – benchmarks, optimisation</li>\n<li>Experience with software security – fuzzing, tabletop threat models, analysis, audit</li>\n<li>Experience build systems and toolchains, including for cross-compilation&nbsp;</li>\n<li>Experience with public clouds or OpenStack&nbsp;</li>\n<li>Experience with Debian/Ubuntu packaging&nbsp;</li>\n<li>Experience with systems programming or scalable web services&nbsp;</li>\n<li>Deep quality and test engineering</li>\n<li>Web or Flutter front-end experience</li>\n<li>REST and gRPC API experience</li>\n<li>SQL and NoSQL data store expertise</li>\n<li>Experience with public clouds or OpenStack</li>\n<li>Experience with Debian/Ubuntu packaging</li>\n<li>Experience with systems programming or scalable web services</li>\n</ul>\n<h2>What we offer you</h2>\n<p>We consider geographical location, experience, and performance in shaping compensation worldwide. We revisit compensation annually (and more often for graduates and associates) to ensure we recognise outstanding performance. In addition to base pay, we offer a performance-driven annual bonus. We provide all team members with additional benefits, which reflect our values and ideals. We balance our programs to meet local needs and ensure fairness globally.</p>\n<ul>\n<li>Distributed work environment with twice-yearly team sprints in person</li>\n<li>Personal learning and development budget of USD 2,000 per year</li>\n<li>Annual compensation review</li>\n<li>Recognition rewards</li>\n<li>Annual holiday leave</li>\n<li>Maternity and paternity leave</li>\n<li>Employee Assistance Programme</li>\n<li>Opportunity to travel to new locations to meet colleagues</li>\n<li>Priority Pass, and travel upgrades for long haul company events</li>\n</ul>\n<h2>About Canonical</h2>\n<p>Canonical is a pioneering tech firm at the forefront of the global move to open source. As the company that publishes Ubuntu, one of the most important open source projects and the platform for AI, IoT and the cloud, we are changing the world on a daily basis. We recruit globally and set a very high standard for people joining the company. We expect excellence - in order to succeed, we need to be the best at what we do. Canonical has been a remote-first company since its inception in 2004.​ Working here is a step into the future, and will challenge you to think differently, work smarter, learn new skills, and raise your game.</p>\n<h2>Canonical is an equal opportunity employer</h2>\n<p>We are proud to foster a workplace free from discrimination. Diversity of experience, perspectives, and background create a better work environment and better products.<a href=\"https://canonical.com/careers/diversity/identity\"> Whatever your identity, we will give your application fair consideration.</a></p>\n<p>#LI-remote</p>\n    ","tags":"[\"typescript\",\"engineering\"]","pubDate":"2024-05-23 05:31:13.748","link":"https://canonical.com/careers/5981483","savedDate":"2024-05-23 05:31:13.748","slug":"staff-engineer-canonical-8115"},{"id":9357930865,"title":"Engineering Manager - Cody Prime [M3]","company":"Sourcegraph","image":"https://pbs.twimg.com/profile_images/1428393724527190022/4mt5PACL_400x400.png","description":"\n    <div class=\"content-intro\"><h3>ALL SOURCEGRAPH ROLES ARE FULLY REMOTE</h3>\n<h2><strong><span style=\"color: #a112ff;\">Who we are</span></strong></h2>\n<p>Our mission at Sourcegraph is to make it so that&nbsp;<a class=\"c-link\" href=\"https://sourcegraph.notion.site/Mission-values-e9d37e6b972a4ef395c3076aea2bd07d\" target=\"_blank\" data-stringify-link=\"https://handbook.sourcegraph.com/strategy-goals/strategy\" data-sk=\"tooltip_parent\">everyone can code</a>, not just ~0.1% of the population. Our code graph powers Cody, the most powerful and accurate AI coding assistant, as well as our Code Search product, which helps devs explore their entire codebase and make large-scale migrations and security fixes. We’re building software that builds software, and in doing so we’re making devs more productive and preparing for a world where a lot more code gets written.</p>\n<p>It’s an exciting time to join Sourcegraph. AI has taken over the world, and we’ve spent the last 10 years building infrastructure that’s integral to making AI generated code more powerful and accurate. Our customers include 4/5 FAANG companies, 4 of the top 10 banks, government organizations, Uber, Plaid, and many other companies building the software that pushes the world forward. We’ve raised $225M at a $2.625B valuation from <a class=\"c-link\" href=\"https://techcrunch.com/2021/07/13/sourcegraph-raises-125m-series-d-on-2-6b-valuation-for-universal-code-search-tool/\" target=\"_blank\" data-stringify-link=\"https://techcrunch.com/2021/07/13/sourcegraph-raises-125m-series-d-on-2-6b-valuation-for-universal-code-search-tool/\" data-sk=\"tooltip_parent\">a16z</a>,&nbsp;<a class=\"c-link\" href=\"https://sourcegraph.com/blog/series-c-with-sequoia/\" target=\"_blank\" data-stringify-link=\"https://about.sourcegraph.com/blog/series-c-with-sequoia/\" data-sk=\"tooltip_parent\">Sequoia</a>,&nbsp;<a class=\"c-link\" href=\"https://www.redpoint.com/companies/sourcegraph/\" target=\"_blank\" data-stringify-link=\"https://www.redpoint.com/companies/sourcegraph/\" data-sk=\"tooltip_parent\">Redpoint</a>,&nbsp;<a class=\"c-link\" href=\"https://medium.com/craft-ventures/why-we-invested-in-sourcegraph-5ace28317e3d\" target=\"_blank\" data-stringify-link=\"https://medium.com/craft-ventures/why-we-invested-in-sourcegraph-5ace28317e3d\" data-sk=\"tooltip_parent\">Craft</a>&nbsp;and others. We’re making ambitious bets on our future and we’re looking to hire exceptional people to join our team as we make Sourcegraph one of the biggest and most influential companies in the world.</p></div>\n\n    <h2><span style=\"color: rgb(161, 18, 255);\"><strong>Location</strong></span></h2>\n<p>🌎 While we are an all-remote company and hire <a href=\"https://sourcegraph.notion.site/How-we-engage-talent-outside-of-the-US-218f7193695a46cbb1ef39ef9c1f72d4\">almost anywhere</a> in the world, we have a preference for someone to reside in the following locations for this role. However, if you feel qualified, we welcome you to apply regardless of location. No matter what, working hours must overlap with EST for at least 20 hours/week and be willing to flex to work with a globally distributed team.</p>\n<p><strong>Preferred locations:</strong></p>\n<ul>\n<li>Remote - North America, preferably east coast</li>\n</ul>\n<h2><span style=\"color: rgb(161, 18, 255);\"><strong>Why this job is exciting</strong></span></h2>\n<p>Cody aims to redefine the coding experience for individual developers, large-scale enterprises, and everyone in between. Cody is an AI coding assistant that lives in your editor. Cody can find, explain, and write code using LLMs and Sourcegraph’s code graph search engine to provide answers that eliminate toil and keep programmers in flow. The Cody Prime team is responsible for managing and monetizing the user experience. They cover everything from account management and payment processing to analytics, usage metering, and abuse detection.&nbsp;</p>\n<p>As Engineering Manager - Cody Prime, you will work closely with teams from across all of Sourcegraph. You will utilize both your leadership skills and technical acumen to identify and implement ideas that ensure a smooth, high-quality experience for both individuals and business customers. You will lead a team of high-agency, self-directed teammates. Your role will not only involve strategic planning but also the hands-on implementation of scalable solutions that align with Cody's business objectives and deliver exceptional value to both our individual and enterprise customers. You will report directly to the Head of Engineering.&nbsp;</p>\n<p>Your experience in developing and managing software projects will be instrumental in defining the operational and architectural roadmap for Cody Prime. Your expertise in areas such as product-led growth, account management, abuse, or billing will be critical in optimizing the processes and systems that support Cody Prime’s goals. By leveraging your knowledge, we aim to enhance our subscription models, improve user engagement, and ensure a secure and compliant environment against potential abuse and fraud.</p>\n<p>📅 Within one month, you will…</p>\n<ul>\n<li>Take responsibility for a distributed, FAANG-bar team, roughly 4 engineers, and lead them as a front-line manager. Your organization will grow as the company grows.</li>\n<li>Work closely with other Engineering department heads on cross-functional initiatives.</li>\n</ul>\n<p>📅 Within three months, you will…</p>\n<ul>\n<li>Identify ways to improve the effectiveness of your team and give input on any gaps you see in the Engineering org.</li>\n<li>Work closely with customers, product, and technical success to deeply understand customer needs and translate them into technical solutions.</li>\n<li>Build a variety of new features. A few examples include<br>\n<ul>\n<li>Advanced user account management, including analytics at both the individual and group level</li>\n<li>Enhanced support for teams and invitations</li>\n<li>Architectural improvements that allow us to quickly respond to changes, be they abusive use of Cody, new models on the market, or changing business requirements</li>\n</ul>\n</li>\n</ul>\n<p>📅 Within six months, you will…</p>\n<ul>\n<li>Champion customer engagement in all phases of design, development, and deployment.&nbsp;</li>\n<li>Drive a roadmap that matches business needs with technical execution</li>\n</ul>\n<p>📅 Within one year, you will…</p>\n<ul>\n<li>Have hired, retained, and grown exceptional people to make our team even more representative of the world’s population.</li>\n<li>Collaborate with product and engineering leadership to develop the next set of ambitious goals that your org should work towards.</li>\n<li>Develop a clear technical and execution strategy to achieve that next set of goals.</li>\n</ul>\n<h2><span style=\"color: rgb(161, 18, 255);\"><strong>About you</strong></span></h2>\n<p>You are a technical, customer-driven manager who works from a place of compassion and curiosity. You have experience working with highly technical customers across business sectors. You can work cross-functionally to align requirements and priorities from a broad set of engineering, product, and business stakeholders. You are strongly aligned with our <a href=\"https://handbook.sourcegraph.com/company-info-and-process/values/\">values</a>, inspired by our mission to make it so that everyone can code, and motivated to do your best work at Sourcegraph.</p>\n<p>You find joy in solving innovative, complex technical problems. You have personal domain expertise with more than one of account management systems, user analytics, billing system integrations, or abuse detection. You are eager to code and directly contribute to the team’s goals.</p>\n<ul>\n<li>💻 You have relevant domain knowledge and experience in one or more of the following areas: account management systems, user analytics, billing system integrations, or abuse detection.&nbsp;</li>\n<li>💪 You have at least 2 years of experience managing engineering teams and 5 years of hands-on coding experience.You have held a high technical bar for teammates as well as yourself.</li>\n<li>🌎 Your working hours overlap with 8am-4pm <a href=\"https://time.is/PT\">PT</a> for at least 10 hours per week so we have time to collaborate synchronously when necessary.</li>\n<li>💎 You share&nbsp;<a href=\"https://sourcegraph.notion.site/Mission-values-e9d37e6b972a4ef395c3076aea2bd07d\">our values</a>, and work in accordance with those values.</li>\n</ul>\n<p>Nice to haves:</p>\n<ul>\n<li>🛠️ You have experience with system architecture design, particularly in scalable, customer-facing environments.</li>\n<li>🚀 You have worked on products with a product-led growth strategy.</li>\n</ul>\n<h2><span style=\"color: rgb(161, 18, 255);\"><strong>Level</strong></span></h2>\n<p>📊 This job is an M3. You can read more about&nbsp;<a href=\"https://sourcegraph.notion.site/Leveling-Guide-034da6f373174eb28fc4575a45c9c1f7\">our job leveling philosophy</a> in our Handbook.</p>\n<h2><span style=\"color: rgb(161, 18, 255);\"><strong>Compensation</strong></span></h2>\n<p><strong>💸 We pay you an above-average salary</strong> because we want to hire the best people who are fully focused on helping Sourcegraph succeed, not worried about paying bills. As an <a href=\"https://sourcegraph.notion.site/Mission-values-e9d37e6b972a4ef395c3076aea2bd07d\">open and transparent</a> company that values competitive compensation, our <a href=\"https://sourcegraph.notion.site/Compensation-Pay-Transparency-at-Sourcegraph-d58d0774f51b4b489d41c3628d30ff8d\">compensation ranges are visible</a> to every single Sourcegraph teammate.</p>\n<p>To determine your salary, we use a number of market and data-driven salary sources, along with your location zone, and target the high-end of the range to ensure we’re always paying above market regardless of where you live in the world. Both U.S. and international locations are divided into one of four zones, determined by the cost of labor index for each area. The starting salary for a successful candidate will be based on level, job-related skills, experience, qualifications, and location zone. Please note that these salary ranges may be adjusted in the future.</p>\n<p>💰 The target compensation for this role is $225,000 USD base.</p>\n<ul>\n<li>Zone 1:&nbsp; $225,000 USD</li>\n<li>Zone 2: $180,000 USD</li>\n<li>Zone 3: $135,000 USD</li>\n<li>Zone 4: $90,000 USD</li>\n</ul>\n<p>Please speak with a recruiter for additional information regarding zone locations.</p>\n<p>📈 In addition to our cash compensation, we offer equity (because when we succeed as a company, we want you to succeed, too) and generous <a href=\"https://sourcegraph.notion.site/Benefits-Perks-dd1da4b6b3a64780abed010a144d34ba\">perks &amp; benefits</a>.</p>\n<h2><span style=\"color: rgb(161, 18, 255);\"><strong>Interview process</strong></span></h2>\n<p><em>Below is the interview process you can expect for this role (you can read more about </em><a href=\"https://sourcegraph.notion.site/Types-of-interviews-f279f080583d49ee9f2c60e30c8cb1f7\"><em>the types of interviews</em></a><em> in our Handbook). It may look like a lot of steps, but rest assured that we move quickly and the steps are designed to help you get the information needed to determine if we’re the right fit for you… Interviewing is a two-way street, after all!&nbsp;</em></p>\n<p>We expect the interview process to take 5.5-6 hours in total.</p>\n<p><strong>👋 Introduction Stage</strong> - we have initial conversations to get to know you better…</p>\n<ul>\n<li>[30m] <a href=\"https://www.notion.so/sourcegraph/Types-of-interviews-sample-questions-f279f080583d49ee9f2c60e30c8cb1f7?pvs=4#99be5ff628b2414194a0ba79d9f25f13\">Recruiter Screen</a>&nbsp;</li>\n<li>[60m] <a href=\"https://www.notion.so/sourcegraph/Resources-for-Candidates-Engineering-Interview-Process-c37a70dea5794085bee0c0818c9ef0b3?pvs=4#da568e7854bb4aaa9b027157088e2d71\">Technical Screen / Resume Deep Dive</a></li>\n</ul>\n<p><strong>🧑‍💻 Team Interview Stage</strong> - we then delve into your experience in more depth and introduce you to members of the team, including cross-functional partners…</p>\n<ul>\n<li>[15m] Hiring Manager Intro</li>\n<li>[60m] <a href=\"https://www.notion.so/sourcegraph/Resources-for-Candidates-Engineering-Interview-Process-c37a70dea5794085bee0c0818c9ef0b3?pvs=4#62692678ffb24443b09f42da0827955f\">Technical Interview</a></li>\n<li>[45m] <a href=\"https://www.notion.so/sourcegraph/Resources-for-Candidates-Engineering-Interview-Process-c37a70dea5794085bee0c0818c9ef0b3?pvs=4#a83e6fcd4a2b4b1ea56bc0166a0396d6\">Cross-functional Team Collaboration Interview</a></li>\n<li>[60m] <a href=\"https://www.notion.so/sourcegraph/Resources-for-Candidates-Engineering-Interview-Process-c37a70dea5794085bee0c0818c9ef0b3?pvs=4#d53b63f813994f55a14305c4d2d0dfb6\">Peer Interview</a> / <a href=\"https://handbook.sourcegraph.com/departments/people-talent/talent/process/evaluating_values/\">Values Interview</a></li>\n</ul>\n<p><strong>🎉 Final Interview Stage </strong>- we move you to our final round, where you gain a better understanding of our business and values holistically…</p>\n<ul>\n<li>[30-60m] <a href=\"https://www.notion.so/sourcegraph/Resources-for-Candidates-Engineering-Interview-Process-c37a70dea5794085bee0c0818c9ef0b3?pvs=4#5b576c3ff2a64e3f98f6574dba679fb3\">Hiring Manager Screen</a></li>\n<li>[30m] <a href=\"https://www.notion.so/sourcegraph/Resources-for-Candidates-Engineering-Interview-Process-c37a70dea5794085bee0c0818c9ef0b3?pvs=4#d644d83653b141f7873aa33d1eab9d4b\">Leadership Interview</a></li>\n<li>We check references and conduct your background check</li>\n</ul>\n<p>Please note - you are welcome to request additional conversations with anyone you would like to meet, but didn’t get to meet during the interview process.</p>\n\n    \n\n    <div class=\"content-conclusion\"><h2><strong><span style=\"color: #a112ff;\">Not sure if this is you?</span></strong></h2>\n<p><span style=\"font-weight: 400;\">We want a diverse, global team, with a broad range of experience and perspectives. If this job sounds great, but you’re not sure if you qualify, apply anyway! We carefully consider every application, and will either move forward with you, find another team that might be a better fit, keep in touch for future opportunities, or thank you for your time.</span></p>\n<h2><strong><span style=\"color: #a112ff;\">Learn more about us</span></strong></h2>\n<p><span style=\"font-weight: 400;\">To create a product that serves the needs of all developers, we are building a diverse </span><a href=\"https://sourcegraph.notion.site/All-remote-guidelines-4d1270d806294bf4ae6db7ab02911957\"><span style=\"font-weight: 400;\">all-remote team</span></a><span style=\"font-weight: 400;\"> that is </span><a href=\"https://www.notion.so/sourcegraph/7ed54d4ec4624475a4b45619901236d7?v=e06d936c673f46ca8c313a557bd4410f\"><span style=\"font-weight: 400;\">distributed across the world</span></a><span style=\"font-weight: 400;\">. Sourcegraph is an equal opportunity workplace; we welcome people from all backgrounds and communities.&nbsp;</span></p>\n<p><span style=\"font-weight: 400;\">We provide </span><a href=\"https://sourcegraph.notion.site/Compensation-Pay-Transparency-at-Sourcegraph-d58d0774f51b4b489d41c3628d30ff8d?pvs=74\"><span style=\"font-weight: 400;\">competitive compensation</span></a><span style=\"font-weight: 400;\"> and </span><a href=\"https://sourcegraph.notion.site/Benefits-Perks-dd1da4b6b3a64780abed010a144d34ba?pvs=74\"><span style=\"font-weight: 400;\">practical benefits</span></a><span style=\"font-weight: 400;\"> to keep you happy and healthy so that you can do your best work.&nbsp;</span><span style=\"font-weight: 400;\">&nbsp;</span></p>\n<p><span style=\"font-weight: 400;\">Learn more about what it is like to work at Sourcegraph by reading </span><a href=\"https://sourcegraph.notion.site/d7614e3e9dc04c09ac2d42d57f1816e6?v=2a6d426dbae14390b155120b0c029ce0\"><span style=\"font-weight: 400;\">our handbook</span></a><span style=\"font-weight: 400;\">.</span></p>\n<p><span style=\"font-weight: 400;\">We want to ensure Sourcegraph is an environment that suits your working style and empowers you to do your best work, so we are eager to answer any questions that you have about us at any point in the interview process.</span></p>\n<p><span style=\"font-weight: 400;\">Go back to the </span><a href=\"https://about.sourcegraph.com/jobs/\"><span style=\"font-weight: 400;\">careers page</span></a><span style=\"font-weight: 400;\"> for all open positions.</span></p>\n<p>&nbsp;</p>\n<p><em><span style=\"font-weight: 400;\">Sourcegraph participates in <a href=\"https://sourcegraph.notion.site/E-Verify-2ab3286dde3446d6bac2898c83610107\" target=\"_blank\">E-Verify</a> for U.S. Employees</span></em></p></div>\n","tags":"[\"management\",\"engineering\"]","pubDate":"2024-05-23 05:31:13.747","link":"https://boards.greenhouse.io/sourcegraph91/jobs/5183844004","savedDate":"2024-05-23 05:31:13.747","slug":"engineering-manager-cody-prime-m3-sourcegraph-1372"},{"id":6835131316,"title":"Business Development Representative ","company":"MixRank","image":"https://pbs.twimg.com/profile_images/378800000147745937/0fac42c12b433bbbd53ff3e15cd6fca4_400x400.png","description":"<p>MixRank (YC S11) is a data mining company that was founded in 2011.</p>\n<p>We’re a fully remote company with over 40 teammates all across the world. We have a decade of experience (in making mistakes). We turned profitable over 5 years ago, and have no plans of an exit or getting acquired for the next decade. Our team is exceptionally strong in both engineering and sales. We process over 3 petabytes of data each month, and are (surprisingly) one of the few data companies that own all our hardware and run everything bare-metal.</p>\n<p>Our customers include some of the world’s biggest sales platforms, recruitment solutions, VCs, and PE firms, to startups that just launched in the latest YC batch.</p>\n<p>We’ve worked diligently over the years to build a team and an infrastructure that is helping our customers get the most up-to-date data and help them build their own product, train AI models, or make investment decisions using it. We have everything needed to scale and we’re eager to bring a few BDRs onboard who will show up every day motivated and ready to help us get to the next level.</p>\n<p>The ideal candidate we are looking for is someone who has some experience in building their own target list, creating outbound sequences, knows how to write personalized emails, and doesn’t shy away from experimenting with video, voice, etc, to get qualified accounts interested in our data products.</p>\n<p><strong>About the role</strong></p>\n<p>Reporting directly to the BDR Manager, you will be fully in charge of creating a strong pipeline of qualified accounts for MixRank’s data products. Your role is to set us up for success as we engage with prospects and customers, helping them understand the value of MixRank data products, educating them on potential use cases, and eventually moving them along to a product demo. Our team is remote and works on Eastern Standard Time (EST).</p>\n<p>You can be anywhere and work flexibly — we value results, and not the number of hours you put in.</p>\n<p><strong>What you’ll be doing</strong></p>\n<p>We love setting big goals, and we love coaching you to get there. : )</p>\n<ul>\n<li>Build a $500k ARR pipeline of qualified, closeable business for 2024 and beyond.</li>\n<li>Use MixRank and other tools to generate high-quality outbound copy with app intel, analytics, and key competitive insights.</li>\n<li>Use cold email, LinkedIn, and other channels to reach out to the right decision-makers.</li>\n<li>Staying in the loop on trends within the data industry, build solid knowledge about our data products, and showcase its value to customers.</li>\n<li>Accurate and timely management of all sales activities, pipeline management, and opportunity management within our CRM (Attio).</li>\n</ul>\n<p></p>\n<p><strong>The skills that’ll make you stand out</strong></p>\n<ul>\n<li>1+ years of customer-facing experience (SDR/BDR in a SaaS is a +).</li>\n<li>Prospecting skills (cold emails, social selling, personalized videos) and <strong>exceptional</strong> follow-up skills.</li>\n<li>Familiarity with email sequencing tools and CRM tools such as Smartleads, Attio, Amplemarket, and/or LinkedIn Sales Navigator.</li>\n<li>Highly motivated, self-driven, and Never Give Up mentality</li>\n<li>Proven record of success and hitting KPIs.</li>\n<li>Proactive, collaborative, and <strong>coachable</strong>.</li>\n</ul>\n<p></p>\n<p><strong>How we’ll set you up</strong></p>\n<ul>\n<li>100% remote.</li>\n<li>Competitive salary.</li>\n<li>Set up your own home office with a Remote Office Grant.</li>\n<li>Health and Wellbeing Allowances.</li>\n<li>Personal Development Budget.</li>\n<li>Leave Policy: Take as many days as you need; we recommend at least 15 days a year.</li>\n</ul>\n<p></p>\n<p><strong>Next steps</strong></p>\n<p>If this looks interesting, and you want to apply, please send us answers to the following questions, either via an email or a video to jobs +gtm at <a href=\"http://mixrank.com\" target=\"_blank\">mixrank.com</a> with the subject line “{Your Name} | MixRank BDR 2024”</p>\n<ol>\n<li>One of MixRank’s data products is to provide app intelligence to vendors and technology providers. See here: <a href=\"https://mixrank.com/datasets/mobile-apps-and-sdks/\" target=\"_blank\">https://mixrank.com/datasets/mobile-apps-and-sdks/</a>. If you were pitching MixRank to New Relic, how would your first email be?</li>\n<li>You have a list of 50 leads to contact today. How would you prioritize them? What would your approach be to establish a connection and interest in MixRank?</li>\n<li>Imagine you have successfully scheduled a meeting with a potential client after multiple follow-ups. However, an hour before the meeting, they wish to reschedule it due to an emergency. How would you handle this situation?</li>\n<li>What excites you about starting a career in sales, especially in a tech company like MixRank?</li>\n<li>Sales can be a challenging field with many rejections. How do you handle rejection and maintain your motivation?</li>\n<li>Can you share an experience where you had to work closely within a team to achieve a common goal? What was your role, and how did you handle conflicts, if any?</li>\n<li>We have a culture of continuous learning and improvement at MixRank. How do you ensure you are constantly learning and staying updated in your professional life?</li>\n</ol>\n<p><strong>Things to remember</strong></p>\n<ol>\n<li><strong>Direct applications only.</strong> We strongly prefer receiving applications directly via email. Unfortunately, applications through LinkedIn or other automated hiring platforms may not be processed due to high volumes.</li>\n<li><strong>Originality in applications.</strong> At MixRank, we value originality and a personal touch in applications. While we understand the growing trend of AI assistance, we discourage the use of AI tools like ChatGPT for crafting your application responses. We’re looking for genuine, human-written anecdotes and workflows — AI-generated responses tend to be lackluster and are easy to identify. If you do choose to use AI assistance, please be transparent about it. However, know that priority will be given to applications demonstrating personal effort and original thinking.</li>\n</ol>\n","tags":"[\"management\",\"engineering\"]","pubDate":"2024-05-23 05:31:13.747","link":"https://www.ycombinator.com/companies/mixrank/jobs/le7n0YA-business-development-representative","savedDate":"2024-05-23 05:31:13.747","slug":"business-development-representative-mixrank-4163"},{"id":9457943078,"title":"Engineering Manager - Cody Core [M4]","company":"Sourcegraph","image":"https://pbs.twimg.com/profile_images/1428393724527190022/4mt5PACL_400x400.png","description":"\n    <div class=\"content-intro\"><h3>ALL SOURCEGRAPH ROLES ARE FULLY REMOTE</h3>\n<h2><strong><span style=\"color: #a112ff;\">Who we are</span></strong></h2>\n<p>Our mission at Sourcegraph is to make it so that&nbsp;<a class=\"c-link\" href=\"https://sourcegraph.notion.site/Mission-values-e9d37e6b972a4ef395c3076aea2bd07d\" target=\"_blank\" data-stringify-link=\"https://handbook.sourcegraph.com/strategy-goals/strategy\" data-sk=\"tooltip_parent\">everyone can code</a>, not just ~0.1% of the population. Our code graph powers Cody, the most powerful and accurate AI coding assistant, as well as our Code Search product, which helps devs explore their entire codebase and make large-scale migrations and security fixes. We’re building software that builds software, and in doing so we’re making devs more productive and preparing for a world where a lot more code gets written.</p>\n<p>It’s an exciting time to join Sourcegraph. AI has taken over the world, and we’ve spent the last 10 years building infrastructure that’s integral to making AI generated code more powerful and accurate. Our customers include 4/5 FAANG companies, 4 of the top 10 banks, government organizations, Uber, Plaid, and many other companies building the software that pushes the world forward. We’ve raised $225M at a $2.625B valuation from <a class=\"c-link\" href=\"https://techcrunch.com/2021/07/13/sourcegraph-raises-125m-series-d-on-2-6b-valuation-for-universal-code-search-tool/\" target=\"_blank\" data-stringify-link=\"https://techcrunch.com/2021/07/13/sourcegraph-raises-125m-series-d-on-2-6b-valuation-for-universal-code-search-tool/\" data-sk=\"tooltip_parent\">a16z</a>,&nbsp;<a class=\"c-link\" href=\"https://sourcegraph.com/blog/series-c-with-sequoia/\" target=\"_blank\" data-stringify-link=\"https://about.sourcegraph.com/blog/series-c-with-sequoia/\" data-sk=\"tooltip_parent\">Sequoia</a>,&nbsp;<a class=\"c-link\" href=\"https://www.redpoint.com/companies/sourcegraph/\" target=\"_blank\" data-stringify-link=\"https://www.redpoint.com/companies/sourcegraph/\" data-sk=\"tooltip_parent\">Redpoint</a>,&nbsp;<a class=\"c-link\" href=\"https://medium.com/craft-ventures/why-we-invested-in-sourcegraph-5ace28317e3d\" target=\"_blank\" data-stringify-link=\"https://medium.com/craft-ventures/why-we-invested-in-sourcegraph-5ace28317e3d\" data-sk=\"tooltip_parent\">Craft</a>&nbsp;and others. We’re making ambitious bets on our future and we’re looking to hire exceptional people to join our team as we make Sourcegraph one of the biggest and most influential companies in the world.</p></div>\n\n    <h2><span style=\"color: rgb(161, 18, 255);\"><strong>Location</strong></span></h2>\n<p>🌎 While we are an all-remote company and hire <a href=\"https://sourcegraph.notion.site/How-we-engage-talent-outside-of-the-US-218f7193695a46cbb1ef39ef9c1f72d4\">almost anywhere</a> in the world, we have a preference for someone to reside in the following locations for this role. However, if you feel qualified, we welcome you to apply regardless of location. No matter what, working hours must overlap with PST for at least 20 hours/week and be willing to flex to work with a globally distributed team.</p>\n<p><strong>Preferred locations:</strong></p>\n<ul>\n<li>Remote - San Francisco</li>\n</ul>\n<h2><span style=\"color: rgb(161, 18, 255);\"><strong>Why this job is exciting</strong></span></h2>\n<p>Cody aims to redefine the coding experience for individual developers, large-scale enterprises, and everyone in between. Cody is an AI coding assistant that lives in your editor. Cody can find, explain, and write code using LLMs and Sourcegraph’s code graph search engine to provide answers that eliminate toil and keep programmers in flow. The Cody Core team owns the Cody product experience across our growing set of clients, including Visual Studio Code and the JetBrains family of IDEs. They own the engine which powers all of the client experiences.&nbsp;</p>\n<p>As Engineering Manager - Cody Core, you will work closely with teams from across all of Sourcegraph, including working closely with the AI team to bring R&amp;D insights into the product. You will utilize both your leadership skills and technical acumen to identify and implement new ideas in the rapidly evolving space of AI coding assistants. You will build product experiences that meet the scalability and reliability needs of large Enterprises. You will lead a team of high-agency, self-directed teammates and will have opportunities to dive in and be deeply technical yourself. You will report directly to the Head of Engineering.&nbsp;</p>\n<p>Your deep experience in developing and managing software projects will be instrumental in defining the operational and architectural roadmap for Cody. Your expertise in building products using ML or generative AI will be critical as we pioneer new ways to integrate AI-driven features into the developer experience. Your experience with IDEs or other language tooling will be critical for helping us build a high quality user experience.&nbsp;</p>\n<p>📅 Within one month, you will…</p>\n<ul>\n<li>Take responsibility for a distributed, FAANG-bar team, roughly eleven engineers (plus contractors), and lead them as a front-line manager. Your organization will grow as the company grows.</li>\n<li>Work closely with other Engineering department heads on cross-functional initiatives.</li>\n</ul>\n<p>📅 Within three months, you will…</p>\n<ul>\n<li>Identify any gaps you see in the Engineering org and help address them in an appropriate way, bringing prior experience to bear in recommending and driving solutions.</li>\n<li>Work closely with customers, product, and technical success to deeply understand customer needs and translate them into technical solutions.</li>\n<li>Build a variety of new features. A few examples include<br>\n<ul>\n<li>Increasing the number of ways Cody can help developers</li>\n<li>Bringing a large variety of context sources into Cody</li>\n<li>Introducing features that help enterprises manage and scale their use of Cody</li>\n<li>Bringing increased automation to Cody</li>\n</ul>\n</li>\n</ul>\n<p>📅 Within six months, you will…</p>\n<ul>\n<li>Champion customer engagement in all phases of design, development, and deployment.&nbsp;</li>\n<li>Drive novel ideas that advance the developer experience through the use of AI.&nbsp;</li>\n</ul>\n<p>📅 Within one year, you will…</p>\n<ul>\n<li>Have hired, retained, and grown exceptional people to make our team even more representative of the world’s population.</li>\n<li>Collaborate with product and engineering leadership to develop the next set of ambitious goals that your org should work towards.</li>\n<li>Develop a clear technical and execution strategy to achieve that next set of goals.</li>\n</ul>\n<h2><span style=\"color: rgb(161, 18, 255);\"><strong>About you</strong></span></h2>\n<p>You are a technical, customer-driven manager who works from a place of compassion and curiosity. You have experience working with highly technical customers across business sectors. You can work across departments to align requirements and priorities from a broad set of engineering, product, and business stakeholders. You are strongly aligned with our <a href=\"https://sourcegraph.notion.site/Mission-values-e9d37e6b972a4ef395c3076aea2bd07d\">values</a>, inspired by our mission to make it so that everyone can code, and motivated to do your best work at Sourcegraph.</p>\n<p>You find joy in solving innovative, complex technical problems. You have personal domain expertise with more than one of generative AI, IDEs, or programming language tooling such as compilers, build tools, static/semantic analysis, or language servers. You can work effectively across multiple programming languages with and without prior experience. You may not code every day, but you are eager to jump into the code for anything from answering a customer question to fixing a bug to adding some new functionality.</p>\n<ul>\n<li>💻 You have experience leading teams developing projects with Machine Learning / Generative AI.</li>\n<li>🖌️ Proven experience in leading a team in the development of highly refined and intuitive UI/UX, preferably in the developer tools space.&nbsp;</li>\n<li>💪 You have at least 4 years of experience managing engineering teams and 5 years of hands-on coding experience. You have held a high technical bar for teammates as well as yourself.</li>\n<li>🌎 Your working hours overlap with 8am-4pm <a href=\"https://time.is/PT\">PT</a> for at least 10 hours per week so we have time to collaborate synchronously when necessary.</li>\n</ul>\n<p>Nice to haves:</p>\n<ul>\n<li>🛠️ You can work effectively across multiple programming languages with and without prior experience.</li>\n<li>🧠 You have hands-on Machine Learning experience, such as training or fine-tuning generative AI models.</li>\n</ul>\n<h2><span style=\"color: rgb(161, 18, 255);\"><strong>Level</strong></span></h2>\n<p>📊 This job is an M4. You can read more about&nbsp;<a href=\"https://sourcegraph.notion.site/Leveling-Guide-034da6f373174eb28fc4575a45c9c1f7\">our job leveling philosophy</a> in our Handbook.</p>\n<h2><span style=\"color: rgb(161, 18, 255);\"><strong>Compensation</strong></span></h2>\n<p><strong>💸 We pay you an above-average salary</strong> because we want to hire the best people who are fully focused on helping Sourcegraph succeed, not worried about paying bills. As an <a href=\"https://sourcegraph.notion.site/Mission-values-e9d37e6b972a4ef395c3076aea2bd07d\">open and transparent</a> company that values competitive compensation, our <a href=\"https://sourcegraph.notion.site/Compensation-Pay-Transparency-at-Sourcegraph-d58d0774f51b4b489d41c3628d30ff8d\">compensation ranges are visible</a> to every single Sourcegraph teammate.</p>\n<p>To determine your salary, we use a number of market and data-driven salary sources, along with your location zone, and target the high-end of the range to ensure we’re always paying above market regardless of where you live in the world. Both U.S. and international locations are divided into one of four zones, determined by the cost of labor index for each area. The starting salary for a successful candidate will be based on level, job-related skills, experience, qualifications, and location zone. Please note that these salary ranges may be adjusted in the future.</p>\n<p>💰The target compensation for this role is $245,000 USD base.</p>\n<ul>\n<li>Zone 1:&nbsp; $245,000 USD</li>\n<li>Zone 2: $196,000 USD</li>\n<li>Zone 3: $147,000 USD</li>\n<li>Zone 4: $98,000 USD</li>\n</ul>\n<p>Please speak with a recruiter for additional information regarding zone locations.</p>\n<p>📈 In addition to our cash compensation, we offer equity (because when we succeed as a company, we want you to succeed, too) and generous&nbsp;<a href=\"https://sourcegraph.notion.site/Benefits-Perks-dd1da4b6b3a64780abed010a144d34ba\">perks &amp; benefits</a>.</p>\n<h2><span style=\"color: rgb(161, 18, 255);\"><strong>Interview process</strong></span></h2>\n<p><em>Below is the interview process you can expect for this role (you can read more about </em><a href=\"https://sourcegraph.notion.site/Types-of-interviews-f279f080583d49ee9f2c60e30c8cb1f7\"><em>the types of interviews</em></a><em> in our Handbook). It may look like a lot of steps, but rest assured that we move quickly and the steps are designed to help you get the information needed to determine if we’re the right fit for you… Interviewing is a two-way street, after all!&nbsp;</em></p>\n<p>We expect the interview process to take 5.5-6 hours in total.</p>\n<p><strong>👋 Introduction Stage</strong> - we have initial conversations to get to know you better…</p>\n<ul>\n<li>[30m] <a href=\"https://www.notion.so/sourcegraph/Types-of-interviews-sample-questions-f279f080583d49ee9f2c60e30c8cb1f7?pvs=4#99be5ff628b2414194a0ba79d9f25f13\">Recruiter Screen</a>&nbsp;</li>\n<li>[60m] <a href=\"https://www.notion.so/sourcegraph/Resources-for-Candidates-Engineering-Interview-Process-c37a70dea5794085bee0c0818c9ef0b3?pvs=4#da568e7854bb4aaa9b027157088e2d71\">Technical Screen / Resume Deep Dive</a></li>\n</ul>\n<p><strong>🧑‍💻 Team Interview Stage</strong> - we then delve into your experience in more depth and introduce you to members of the team, including cross-functional partners…</p>\n<ul>\n<li>[15m] Hiring Manager Intro</li>\n<li>[60m] <a href=\"https://www.notion.so/sourcegraph/Resources-for-Candidates-Engineering-Interview-Process-c37a70dea5794085bee0c0818c9ef0b3?pvs=4#62692678ffb24443b09f42da0827955f\">Technical Interview</a></li>\n<li>[45m] <a href=\"https://www.notion.so/sourcegraph/Resources-for-Candidates-Engineering-Interview-Process-c37a70dea5794085bee0c0818c9ef0b3?pvs=4#a83e6fcd4a2b4b1ea56bc0166a0396d6\">Cross-functional Team Collaboration Interview</a></li>\n<li>[60m] <a href=\"https://www.notion.so/sourcegraph/Resources-for-Candidates-Engineering-Interview-Process-c37a70dea5794085bee0c0818c9ef0b3?pvs=4#d53b63f813994f55a14305c4d2d0dfb6\">Peer Interview</a> / <a href=\"https://handbook.sourcegraph.com/departments/people-talent/talent/process/evaluating_values/\">Values Interview</a></li>\n</ul>\n<p><strong>🎉 Final Interview Stage </strong>- we move you to our final round, where you gain a better understanding of our business and values holistically…</p>\n<ul>\n<li>[30-60m] <a href=\"https://www.notion.so/sourcegraph/Resources-for-Candidates-Engineering-Interview-Process-c37a70dea5794085bee0c0818c9ef0b3?pvs=4#5b576c3ff2a64e3f98f6574dba679fb3\">Hiring Manager Screen</a></li>\n<li>[30m] <a href=\"https://www.notion.so/sourcegraph/Resources-for-Candidates-Engineering-Interview-Process-c37a70dea5794085bee0c0818c9ef0b3?pvs=4#d644d83653b141f7873aa33d1eab9d4b\">Leadership Interview</a></li>\n<li>We check references and conduct your background check</li>\n</ul>\n<p>Please note - you are welcome to request additional conversations with anyone you would like to meet, but didn’t get to meet during the interview process.</p>\n\n    \n\n    <div class=\"content-conclusion\"><h2><strong><span style=\"color: #a112ff;\">Not sure if this is you?</span></strong></h2>\n<p><span style=\"font-weight: 400;\">We want a diverse, global team, with a broad range of experience and perspectives. If this job sounds great, but you’re not sure if you qualify, apply anyway! We carefully consider every application, and will either move forward with you, find another team that might be a better fit, keep in touch for future opportunities, or thank you for your time.</span></p>\n<h2><strong><span style=\"color: #a112ff;\">Learn more about us</span></strong></h2>\n<p><span style=\"font-weight: 400;\">To create a product that serves the needs of all developers, we are building a diverse </span><a href=\"https://sourcegraph.notion.site/All-remote-guidelines-4d1270d806294bf4ae6db7ab02911957\"><span style=\"font-weight: 400;\">all-remote team</span></a><span style=\"font-weight: 400;\"> that is </span><a href=\"https://www.notion.so/sourcegraph/7ed54d4ec4624475a4b45619901236d7?v=e06d936c673f46ca8c313a557bd4410f\"><span style=\"font-weight: 400;\">distributed across the world</span></a><span style=\"font-weight: 400;\">. Sourcegraph is an equal opportunity workplace; we welcome people from all backgrounds and communities.&nbsp;</span></p>\n<p><span style=\"font-weight: 400;\">We provide </span><a href=\"https://sourcegraph.notion.site/Compensation-Pay-Transparency-at-Sourcegraph-d58d0774f51b4b489d41c3628d30ff8d?pvs=74\"><span style=\"font-weight: 400;\">competitive compensation</span></a><span style=\"font-weight: 400;\"> and </span><a href=\"https://sourcegraph.notion.site/Benefits-Perks-dd1da4b6b3a64780abed010a144d34ba?pvs=74\"><span style=\"font-weight: 400;\">practical benefits</span></a><span style=\"font-weight: 400;\"> to keep you happy and healthy so that you can do your best work.&nbsp;</span><span style=\"font-weight: 400;\">&nbsp;</span></p>\n<p><span style=\"font-weight: 400;\">Learn more about what it is like to work at Sourcegraph by reading </span><a href=\"https://sourcegraph.notion.site/d7614e3e9dc04c09ac2d42d57f1816e6?v=2a6d426dbae14390b155120b0c029ce0\"><span style=\"font-weight: 400;\">our handbook</span></a><span style=\"font-weight: 400;\">.</span></p>\n<p><span style=\"font-weight: 400;\">We want to ensure Sourcegraph is an environment that suits your working style and empowers you to do your best work, so we are eager to answer any questions that you have about us at any point in the interview process.</span></p>\n<p><span style=\"font-weight: 400;\">Go back to the </span><a href=\"https://about.sourcegraph.com/jobs/\"><span style=\"font-weight: 400;\">careers page</span></a><span style=\"font-weight: 400;\"> for all open positions.</span></p>\n<p>&nbsp;</p>\n<p><em><span style=\"font-weight: 400;\">Sourcegraph participates in <a href=\"https://sourcegraph.notion.site/E-Verify-2ab3286dde3446d6bac2898c83610107\" target=\"_blank\">E-Verify</a> for U.S. Employees</span></em></p></div>\n","tags":"[\"engineering\"]","pubDate":"2024-05-23 05:31:13.744","link":"https://boards.greenhouse.io/sourcegraph91/jobs/5183850004","savedDate":"2024-05-23 05:31:13.744","slug":"engineering-manager-cody-core-m4-sourcegraph-1724"},{"id":1093792871,"title":"Product Engineer","company":"SafetyWing","image":"https://pbs.twimg.com/profile_images/1177267684574208000/54eG3WmW_400x400.jpg","description":"<h2>🧘 What we offer</h2> <div><!--block-->We operate in a fully remote work environment – work from anywhere globally.&nbsp;<br><br>You will receive salary and equity compensation, premium health insurance that works in most countries worldwide, travel insurance, a laptop, an office stipend, a minimum of four weeks of vacation per year, and a personal development budget.</div><div><!--block--><br>We also have fantastic annual team gatherings. The previous ones were in Ljubljana, San Francisco, Mexico, Bali, and Siglufjörður.</div><div><!--block--><br>We are looking forward to hearing from you!</div> <div><!--block-->Our team thrives on creativity, innovation, and collaboration, and we're seeking a skilled <strong>Product Engineer,&nbsp;</strong></div><div><!--block--><br>At <strong>SafetyWing</strong>, we do not have a strong division between tech and product—we are all part of product development and participate in strategic company decisions. We believe this is the path to creating great products.&nbsp;<br><br></div><div><!--block-->We are on a mission to remove the role of geographical borders as a barrier to equal opportunities and freedom for everyone. And we are doing that by creating simple health, insurance, and retirement products for remote workers worldwide as a replacement for national welfare systems.<br><br>In this role, you can shape our product's future and drive impactful changes.</div> <h2>💻 Languages and technologies we use:</h2>  <ul><li><!--block-->Kotlin (and some Java) with Micronaut.</li><li><!--block-->TypeScript with React and NextJS.</li><li><!--block-->State management with Redux Toolkit and React Query.</li><li><!--block-->Styled Components and Tailwind for styling.</li><li><!--block-->MySQL (with Hibernate and Liquibase).</li><li><!--block-->Hosted on Google Cloud with k8s.</li></ul> <h2>🧪 We are looking for someone who has:</h2> <ul><li><!--block-->A strong foundation in backend development with Java (Kotlin would be a great advantage).</li><li><!--block-->Hands-on experience developing product's backend services, prioritizing clean, scalable code.</li><li><!--block-->A grasp of TypeScript, React, and Next.js.</li><li><!--block-->A solid understanding of the product development lifecycle, including requirements gathering, system design, implementation, testing, deployment, and maintenance.</li><li><!--block-->Enthusiasm for staying up-to-date with the latest industry trends and a curiosity to explore and incorporate new developments into your work.</li></ul><div><!--block--><br></div><div><!--block--><br></div>","tags":"[\"typescript\",\"management\",\"mysql\"]","pubDate":"2024-05-23 05:31:13.737","link":"https://safetywing.pinpointhq.com/en/jobs/186587","savedDate":"2024-05-23 05:31:13.742","slug":"product-engineer-safetywing-1534"},{"id":3229240683,"title":"Customer Support - US Manager Digital Transformation (Remote)","company":"Empower","image":"https://lever-client-logos.s3.us-west-2.amazonaws.com/2e1a369c-b58f-41ac-8d86-4b0a77695e68-1687915522032.png","description":"<div><b style=\"font-size: 24px\">EMPOWER OVERVIEW</b></div><div><br></div><div><a href=\"http://empower.me/\">Empower</a>&nbsp;is a high-growth financial technology company on a mission to expand access to fair credit to give anyone in the world the opportunity to improve their financial security and mobility. We dream up and launch one-of-a-kind features that help our members get money instantly whenever they need it, save for the future, and rewrite their financial story. Our members see Empower Cash Advance as a life-saver, Empower Automatic Savings as a game-changer, and the new Empower Thrive line of credit as a lifeline to low-cost borrowing and the only practical path to building good credit.</div><div><br></div><div>Empower is backed by Sequoia Capital, Blisce, and Icon Ventures. Are we the next great place to grow your impact and accelerate your career? We think so:</div><div><br></div><div>Inc. ranked Empower #56 in the 2023 Inc. 5000 list of the fastest-growing private companies in the US (#55 in 2022). Forbes put Empower on its 2023 list of America's Best Startup Employers. Fast Company recognized the new Empower Thrive line of credit in their 2022 list of the Next Big Things in Tech. </div><div><br></div><div><b style=\"font-size: 18px\">THE EMPOWER WAY</b></div><div><b>Great Expectations</b>: We come up with bold, audacious goals for ourselves and go all out for impact</div><div><b>Owner Mindset</b>: We give every employee latitude to act independently, make smart choices, and move the business forward</div><div><b>Spirited Debate</b>: We love skeptics and seek counter opinions to challenge our personal assumptions and expand our view</div><div><b>Customer Obsession: </b>We listen to understand, empathize, and create a memorable, rewarding experience for our community</div><div><b>Inclusive Collaboration</b>: We believe diverse teams make the best decisions, and we strive to give diverse voices a seat at the table</div><div>N<b>o Jerks Allowed</b>: We value our relationships and take the time to build trust and connection and communicate respectfully</div><div><b>&nbsp;</b></div><div><b style=\"font-size: 18px\">&nbsp;</b></div><div><b style=\"font-size: 18px\">WHAT EMPOWER OFFERS</b></div><div>Competitive salary</div><div>Generous equity package</div><div>Full healthcare and dental benefits</div><div>Technology&nbsp; expense reimbursement</div><div>Work&nbsp; from anywhere</div><div><br></div><div><b style=\"font-size: 18px\">JOB DESCRIPTION</b></div><div><span style=\"font-size: 11pt\">In this role, you will contribute to Empower’s Automation and AI roadmap for Customer Operations and Success. You will also partner closely with&nbsp; cross functional product and technology teams to bring our Digital Customer Operations COE (center of excellence) to life. Empower strives to be at the forefront of the responsible development of automation &amp; generative AI, to significantly transform the CX journey. You will also act as a liaison between customer operations and technology to remediate incidents as identified.</span></div><div><br></div><div><span style=\"font-size: 11pt\">The ideal candidate will play a pivotal role in influencing a culture of an “AI first” mindset across the enterprise with a specific focus on leveraging Generative AI capabilities for customer success.. You will also have an imaginative mindset with experience delivering AL driven solutions and be a self-starter.</span></div><div><br></div><div>Travel for company offsites is expected at a minimum 2 times a year. </div><div><br></div><h3>Key Responsibilities</h3><li>Take charge of the early stage development of our automation &amp; AI strategy, evolving it into a sustainable initiative covering use cases such as chat, email, voice, agent “assist” and back office processes</li><li>Develop and implement the Gen AI plan, ensuring robustness and cost-effectiveness. Evaluate buy vs. build options, where appropriate</li><li>Regularly assess the AI vendor performance, Proof of Concepts (POC), Testing and overall integration of successful outcomes</li><li>Collaborate openly with the business, tech and compliance leaders to ensure the design prioritizes the overall needs to support our customer, product and regulatory requirements</li><li>Lead all aspects of AI use case development in partnership with internal collaborators from customer support, training and operations with the goal of integrating the most effective new capabilities</li><li>Maintain and escalate risks, issues, and other blockers related to the delivery of AI solutions and/or workflows including documented playbooks</li><li>Lead benefits (ROI)&nbsp; analysis to drive prioritization and implementation of the CS AI roadmap</li><li>Contribute to&nbsp; meaningful performance metrics, objectives, and key results to gauge the progress and success of initiatives and share results regularly</li><li>Act as influential authority on&nbsp; CS automation &amp; AI to ensure the requirements for IP protection and ethical use are met</li><li>Stay up-to-date with latest advancements in AI strategies and standard processes to evolve the strategy as needed</li><li>Use customer insights data to inform decisions (VOC)</li><li>Be a key contributor in building and managing opportunity and idea backlog aligned with business strategy and priorities</li>,<h3>Candidate Qualifications</h3><li>Motivated by Empower’s mission and determined to create a personable and meaningful experience for our customers</li><li>BA/BS degree in Business Management, Digital Transformation, Business Analysis or a technical field</li><li>4+ years experience in financial service operations</li><li>Specific experience with a comparable FinTech is a plus</li><li>At least 2 years supporting an intelligent automation program using AI (including LLM), Gen AI technologies and working knowledge of AI &amp; Automation process optimization and prioritization framework </li><li>Deep understanding of technical data architecture and AI applications in a business context </li><li>Familiarity with agile development methodologies and experience partnering with agile teams</li><li>Demonstrated passion for the customer experience and the ability to solve problems with a high level of empathy</li><li>Strong problem solving and analytical skills with the ability to work independently with ownership and influence to negotiate across teams</li><li>Excellent verbal and written communication skills with the ability to explain complex topics in easily understood, concise language</li><li>Experience at tech and/or product-driven companies/startups preferred</li><li>Ability to iterate rapidly to improve the experience while building core components of the AI platform</li><div>At Empower, we hire for people that push themselves to understand others and seek out ways to challenge their personal assumptions. Our hope is that by fostering such an environment, we strengthen our business and relationships by putting people first. We are committed to building a diverse, inclusive, and equitable workspace where everyone (regardless of age, education, ethnicity, gender, sexual orientation, or any personal characteristics) feels like they belong. Even if your experience doesn’t exactly match up to our job description, you should feel empowered to apply regardless!&nbsp;</div>","tags":"[\"management\"]","pubDate":"2024-05-21 22:41:18.005","link":"https://jobs.lever.co/empower.me/38fc0b12-bf29-4e2f-ab60-315fb9537b8c","savedDate":"2024-05-23 05:31:13.750","slug":"customer-support-us-manager-digital-transformation-remote-empower-3456"},{"id":1827625522,"title":"Event Business Development Representative","company":"Bio Render","image":"https://lever-client-logos.s3-us-west-2.amazonaws.com/0f4b434e-502f-4390-9819-c058d43028c1-1595260531860.png","description":"<div>At BioRender, our mission is to accelerate the world’s ability to learn, discover and communicate science. We are passionate about democratizing science communication in order to accelerate scientific discovery and understanding. We're looking for amazing people to help create the world’s go-to-place and platform where science is communicated. Come join us!</div><div><br></div><div><span style=\"font-size: 16px\">We are looking for a passionate and motivated Business Development Representative with a love for events, selling and a tenacious and methodical approach to prospecting and developing new business opportunities at conferences and field events.&nbsp;</span></div><div><br></div><div><span style=\"font-size: 16px\">We are looking for a motivated self-starter to join our sales team and play a key role in business development outreach for events, the associated strategy and logistics to grow brand awareness in the market. You’ll be working side by side with our Marketing, Sales, Customer Success, to engage with our scientific audience.&nbsp;&nbsp;</span></div><div><br></div><div><b><span style=\"font-size: 16px\">This role is remote-friendly based in the following States: Massachusetts, Connecticut, Rhode Island, Pennsylvania, New Jersey, and Maine or within Canada.</span></b></div><h3>You will be successful in this role with</h3><li><b>Exceptional customer curiosity: </b>You have a genuine interest in learning about the clients we serve, their goals, and their science communication pain points. You are curious, love asking questions, and can think outside of the box.</li><li><b>A continuous improvement approach: </b>You have a growth mindset and you’re open to coaching and continuous feedback. You are able to thrive in a fast-paced and collaborative environment with changing goals and priorities.</li><li><b>A self-starter attitude: </b>You are self-motivated, resourceful, and know how to hustle. </li><li>If you are adaptable to the evolving event landscape and technology trends.</li>,<h3>Your responsibilities</h3><li>Prospect new leads (outbound) within event platforms reaching out to speakers and attendees. Creating amazing first impressions with potential customers and partners while building a pipeline for account executives and senior management along with first meetings at onsite events. </li><li>Prospect new leads (outbound) via telephone, LinkedIn, event platforms and email tools, for scientific and business fit.</li><li>Organize, categorize, and prioritize contacts in internal databases, CRM and event registration websites to execute outreach confirming meetings and attendance at events.&nbsp;</li><li>Become an expert in the features, benefits and application of BioRender’s software.&nbsp;</li><li>Leverage prospecting tools to research companies and identify key stakeholders to invite to events at BioRender field events such as executive dinners and happy hours.</li><li>Work with Events team and Account Executives and Customer Success to drive outbound prospecting activities, including cold calling, emailing, and communicating our value proposition to decision-makers.</li><li>Draft creative email template copy and LinkedIn copy and set sequences to support outbound efforts.</li><li>Traveling representative at industry conferences and proprietary events connecting with scientists that are prospects and customers. Flexible hours will be required as event schedules are dependent.</li>,<h3>What you bring to the table</h3><li>6+ months&nbsp;of prior experience as a sales intern, business development representative, customer service representative or in a marketing role preferably in a SaaS environment</li><li>1+ years of experience in a related field (BioTech, Pharma) marketing and /or event space is a huge asset</li><li>Strong verbal and written communication skills</li><li>Not afraid to pick up the phone and cold call</li><li>Eager to collaborate across departments outside of sales, this will enhance your understanding of the broader impact your role has on BioRender's success</li><li>Committed to meet/exceed goals with a proven history of consistent high achievement. Bachelor of Science degree or equivalent is a plus (e.g. within the fields of life science including biology, biotechnology, biomedical engineering, biochemistry, etc)</li>,<h3>What you can expect from our interview process</h3><li><b>Introductory calls: </b>We will set up a 20-30 minute phone call with one of our recruiters during which you’ll have the opportunity to share more about your experience and interests. You’ll also learn more about BioRender and the team you’re interviewing with. Feel free to ask any questions throughout these calls!</li><li><b>Practical interview: </b>You’ll be completing a practical exercise so we can see your skills in action and give you a realistic role preview. This exercise will be conducted with our BD Manager.</li><li><b>Meet the team: </b>Throughout our interview process, you can expect to meet with some of your potential colleagues.</li>,<h3>Why join us?</h3><li>We are mission-driven, and work collaboratively towards our shared vision of improving scientific communication and accelerating scientific discovery: BioRender figures have appeared in more than 16,000 publications!&nbsp;</li><li>It’s a product that users love! We have a world-class NPS and a community of loyal fans. Check out our Testimonials page to see what our customers are saying about us: <a href=\"https://biorender.com/testimonials/\" class=\"postings-link\">https://biorender.com/testimonials/&nbsp;</a></li><li>We are in the top quartile for profitability and year-over-year revenue growth, with users in 200+ countries.</li><li>BioRender is an equal opportunity employer, and an inclusive hiring process and work environment is a part of our DNA.&nbsp;</li><li>We’re remote-first and have team members across Canada and the United States. A physical office in Toronto is available, but you have the flexibility to work from anywhere.&nbsp;</li><li>We’re backed by top investors, accelerators, and some of the most successful life science entrepreneurs and philanthropists in the world including Y Combinator, Malala Fund founders, and Fifty Years VC.&nbsp;</li><li>We are committed to building a warm, inclusive, and diverse environment. Check out how we make sure our <a href=\"https://www.biorender.com/biorender-careers\" class=\"postings-link\">employees come first</a>.</li><div>You can read more about the <a href=\"https://biorender.notion.site/BioRender-Candidate-Resources-8255c155797f442a950720a33b4764d5\" class=\"postings-link\">BioRender interview process and FAQs here</a>!</div>","tags":"[\"management\",\"engineering\",\"database\"]","pubDate":"2024-05-21 16:25:12.794","link":"https://jobs.lever.co/biorender/1eb71f6f-ab81-46e4-b177-7b320da94931","savedDate":"2024-05-23 05:31:13.751","slug":"event-business-development-representative-bio-render-4252"},{"id":7768020384,"title":"C Developer for popular open source projects (worldwide remote, work anywhere)","company":"CloudLinux","image":"https://pbs.twimg.com/profile_images/696718028084482050/ymY3OEPk_400x400.png","description":"<p>We are in search of a highly skilled and passionate C Developer to join our exceptional Extended Lifecycle team at CloudLinux. As a member of this team, you will have a unique opportunity to contribute to major open-source projects such as Apache HTTPD, OpenSSL, and MySQL. Your role will involve the important task of backporting crucial security fixes to ensure the stability of these projects.</p><p>By joining our team of experts, you will have the chance to collaborate with top-notch developers and have a significant impact on the open-source community. For more information about the project and our company, visit our branded websites, <a href=\"https://www.cloudlinux.com\" rel=\"nofollow noreferrer noopener\" class=\"external\">CloudLinux.com</a> and <a href=\"https://www.tuxcare.com\" rel=\"nofollow noreferrer noopener\" class=\"external\">TuxCare.com</a>.</p><p>Come be a part of CloudLinux, where every team member supports each other's success. </p><p><strong>What You Will Do:</strong></p><ul> <li>Collaborate on various open-source projects, including Apache HTTPD, Python, OpenSSL, and more.</li> <li>Backport security and bug fixes from newer upstream versions or develop patches from scratch.</li> <li>Contribute to upstream projects.</li> <li>Create reproducers and tests for vulnerabilities.</li> <li>Automate routine processes such as monitoring CVEs, applying patches, and testing.</li> </ul><h3>Requirements: </h3><p><strong>To be successful you should have;</strong></p><ul> <li>5+ years of professional experience in C programming required</li> <li>Must be proficient in GNU/Linux operating system and shell scripting</li> <li>Strong ability to work with various build systems, including autotools, make, and cmake</li> <li>Prior experience with git-based development processes preferred</li> <li>Knowledge of scripting languages like Python, Perl, or similar will be a valuable asset</li> </ul><p></p><h3>Benefits: </h3><p><strong>What's in it for you?</strong></p><ul> <li>A focus on professional development; </li> <li>Interesting and challenging projects</li> <li>Flexible working hours</li> <li>Paid one month vacation per year and unlimited sick leave</li> <li>Medical insurance reimbursement</li> <li>Co-working and gym/sports reimbursement</li> <li>The opportunity to receive a reward for the most innovative idea that the company can patent</li> </ul><p><em>By applying for this position, you agree with </em><a href=\"https://cloudlinux.com/privacy-policy\" rel=\"nofollow noreferrer noopener\" class=\"external\"><em>Cloudlinux Privacy Policy</em></a><em> and give us your consent to maintain and process your personal data with this respect. Please read our Privacy Policy for more information.</em></p>","tags":"[\"mysql\"]","pubDate":"2024-05-21 00:00:00.000","link":"https://apply.workable.com/cloudlinux-1/j/52AFCFE196","savedDate":"2024-05-23 05:31:13.749","slug":"c-developer-for-popular-open-source-projects-worldwide-remote-work-anywhere-cloudlinux-1264"},{"id":6976134725,"title":"Junior Accountant (Fully Remote)","company":"CoverGo","image":"https://pbs.twimg.com/profile_images/1382655628523364355/MWPIbbID_400x400.jpg","description":"<p><strong>Top 3 Reasons To Join Us </strong></p><ul> <li>Competitive Salary</li> <li>100% Globally Remote</li> <li>Working on the latest tech for the Insurtech Market Leader</li> </ul><p><strong>About Us</strong></p><p>At CoverGo, our mission is to empower all insurance companies to make insurance 100% digital and accessible to everyone.</p><ul> <li>We are a leading global no-code insurance platform for health, life, and P&amp;C</li> <li>We’re the winner of the Insurtech of the Year in all of Asia and other awards globally</li> <li>We work with insurance enterprise clients such as AXA, Bupa, MSIG, Dai-ichi, Bank of China Group Insurance, and many more</li> <li>We're an international, diverse team of over 120 people with 30 nationalities and team members working remotely from all over the world</li> <li>We are fully funded and backed by reputable VC funds and strategic institutional investors</li> <li>We have a global presence in Asia, EMEA and the Americas</li> <li>We’ve grown our annualized revenue by over 30x since January 2021</li> <li>We’re constantly working towards making CoverGo a workplace that you love coming to. We deeply believe that bringing together a diversity of thoughts, expressions, and perspectives is key to building the best culture for equally diverse communities all over the world</li> </ul><p><strong>What you will do:</strong></p><ul> <li>Responsible for daily accounting operations in Xero system for multiple entities</li> <li>Maintain proper and accurate records and supporting documents</li> <li>Assist with the preparation of the budget, forecast, and financial analysis</li> <li>Cash flow analysis and monthly reporting</li> <li>Daily communication with suppliers and various stakeholders on payments and accounting documentation</li> <li>Responsible for AP function of the firm</li> <li>Manage Inter-company reconciliations</li> <li>Perform ad hoc assignments and projects as required</li> </ul><p><strong>What we are looking for:</strong></p><ul> <li>Degree holder in Accounting, Finance, and related discipline</li> <li>CPA, ACCA or similar</li> <li>Minimum of 2 years of accounting experience</li> <li>Xero accounting software experience</li> <li>Excellent skills in the use of Microsoft Office</li> <li>Competent in to use of various software, App and IT solutions</li> <li>Working experience with international businesses</li> <li>Able to work independently and under pressure in a fast-paced environment with an emphasis on accuracy and timeliness</li> <li>Meticulous, well-organized and conscientious with a high level of initiative at work</li> <li>Self-motivated, hardworking, a strong sense of responsibility with a positive working attitude</li> <li>Resourceful, can-do attitude and willingness to learn and go beyond</li> <li>Good command of English is a must, knowing other languages would be an advantage</li> </ul><p><strong>Why You'll Love Working Here</strong></p><ul> <li>Fully Remote</li> <li>Flexible Leave</li> <li>International Environment</li> <li>Competitive renumeration package</li> <li>Performance Bonus</li> <li>Stock Options after 6 months </li> <li>Company activities and events</li> <li>Learning and development plan</li> </ul><p><strong>CoverGo Company</strong><a href=\"https://www.youtube.com/watch?v=YI0ezLxvFvA\" rel=\"nofollow noreferrer noopener\" class=\"external\"><strong> Video</strong></a></p><p>By submitting your application, you confirm that you have read, understood, and accepted the content of CoverGo’s <a href=\"https://apply.workable.com/covergo/gdpr_policy?lng=en\" target=\"_blank\" rel=\"nofollow noreferrer noopener\" class=\"external\">Privacy Notice</a> and you consent to the processing of your data as part of this application.</p><h3>Requirements: </h3><h3>Benefits: </h3>","tags":"[\"Finance\"]","pubDate":"2024-05-21 00:00:00.000","link":"https://apply.workable.com/covergo/j/F36BB677E8","savedDate":"2024-05-23 05:31:13.749","slug":"junior-accountant-fully-remote-covergo-813"},{"id":4651227676,"title":"Legal Assistant (Fully Remote)","company":"CoverGo","image":"https://pbs.twimg.com/profile_images/1382655628523364355/MWPIbbID_400x400.jpg","description":"<p><strong>Top 3 Reasons To Join Us</strong></p><ul> <li>Competitive Salary</li> <li>100% Remote</li> <li>International team</li> <li>Working on the latest tech for the Insurtech Market Leader</li> </ul><p><strong>About Us</strong></p><p>At CoverGo, our mission is to empower all insurance companies to make insurance 100% digital and accessible to everyone.</p><ul> <li>We are a leading global no-code insurance platform for health, life, and P&amp;C</li> <li>We’re the winner of the Insurtech of the Year in all of Asia and other awards globally</li> <li>We work with insurance enterprise clients such as AXA, Bupa, MSIG, Dai-ichi, Bank of China Group Insurance, and many more</li> <li>We're an international, diverse team of over 120 people with 30 nationalities and team members working remotely from all over the world</li> <li>We are fully funded and backed by reputable VC funds and strategic institutional investors</li> <li>We have a global presence in Asia, EMEA and the Americas</li> <li>We’ve grown our annualized revenue by over 30x since January 2021</li> <li>We’re constantly working towards making CoverGo a workplace that you love coming to. We deeply believe that bringing together a diversity of thoughts, expressions, and perspectives is key to building the best culture for equally diverse communities all over the world</li> </ul><p><strong>What You Will Do</strong></p><ul> <li>Review contracts, ensuring compliance with applicable laws and regulations.</li> <li>Suggest corrections and alternations for&nbsp; legal agreements/ contracts.</li> <li>Conduct legal research on matters related to employment or commercial law.</li> <li>Analyze legal issues and provide valuable insights to support decision-making processes.</li> <li>Maintain organized records of legal documents, contracts, and correspondence.</li> <li>Ensure the accessibility and integrity of legal files.</li> <li>Stay abreast of changes in employment and commercial laws to ensure ongoing compliance.</li> <li>Assist in developing and implementing processes to ensure adherence to legal requirements.</li> <li>Communicate effectively with internal teams, external legal entities, and clients.</li> <li>Collaborate with team members to facilitate smooth legal operations.</li> <li>Provide administrative support if needed&nbsp;</li> </ul><p><strong>What We Need</strong></p><ul> <li>Possess a legal degree from an accredited institution</li> <li>Minimum 2 years of experience in a legal assistant or similar role</li> <li>Proven experience in drafting, reviewing, and editing contracts</li> <li>Strong legal research and analytical skills</li> <li>Excellent organizational skills, with the ability to manage multiple tasks efficiently</li> <li>High proficiency in English</li> <li>Clear and effective communication skills, both written and verbal</li> <li>Keen attention to detail and accuracy in legal documentation</li> <li>Collaborative mindset with the ability to work effectively within a team</li> <li>Specialized knowledge and practical experience in employment or commercial law is a major advantage</li> <li>Physically based in the Philippines </li> </ul><p><strong>Why You'll Love Working Here</strong></p><ul> <li>Fully Remote</li> <li>Flexible Leave</li> <li>International Environment</li> <li>Competitive remuneration package</li> <li>Performance Bonus</li> <li>Stock Options after 6 months</li> <li>Company activities and events</li> <li>Learning and development plan</li> <li>Remote work allowance</li> </ul><p><strong>CoverGo Company</strong><a href=\"https://www.youtube.com/watch?v=YI0ezLxvFvA\" rel=\"nofollow noreferrer noopener\" class=\"external\"><strong> Video</strong></a></p><p>By submitting your application, you confirm that you have read, understood, and accepted the content of CoverGo’s<a href=\"https://apply.workable.com/covergo/gdpr_policy?lng=en\" rel=\"nofollow noreferrer noopener\" class=\"external\"> Privacy Notice</a> and you consent to the processing of your data as part of this application.</p><p></p><h3>Requirements: </h3><h3>Benefits: </h3>","tags":"[\"legal\",\"aws\"]","pubDate":"2024-05-21 00:00:00.000","link":"https://apply.workable.com/covergo/j/D3DC7C078A","savedDate":"2024-05-23 05:31:13.749","slug":"legal-assistant-fully-remote-covergo-4263"},{"id":6771918194,"title":"Finance Controller (Fully Remote)","company":"CoverGo","image":"https://pbs.twimg.com/profile_images/1382655628523364355/MWPIbbID_400x400.jpg","description":"<p><strong>Top 3 Reasons To Join Us</strong></p><ul> <li>Competitive Salary</li> <li>100% Remote</li> </ul><ul><li>International team</li></ul><ul><li>Working on the latest tech for the Insurtech Market Leader</li></ul><p><strong>About Us</strong></p><p>At CoverGo, our mission is to empower all insurance companies to make insurance 100% digital and accessible to everyone.</p><ul> <li>We are a leading global no-code insurance platform for health, life, and P&amp;C</li> <li>We’re the winner of the Insurtech of the Year in all of Asia and other awards globally</li> <li>We work with insurance enterprise clients such as AXA, Bupa, MSIG, Dai-ichi, Bank of China Group Insurance, and many more</li> <li>We're an international, diverse team of over 120 people with 30 nationalities and team members working remotely from all over the world</li> <li>We are fully funded and backed by reputable VC funds and strategic institutional investors</li> <li>We have a global presence in Asia, EMEA and the Americas</li> <li>We’ve grown our annualized revenue by over 30x since January 2021</li> <li>We’re constantly working towards making CoverGo a workplace that you love coming to. We deeply believe that bringing together a diversity of thoughts, expressions, and perspectives is key to building the best culture for equally diverse communities all over the world</li> </ul><p><strong>About the Role</strong></p><p>As a Finance Controller, you'll lead the financial operations of multiple entities within our group, ensuring compliance with regulations and company policies. Collaborating with executive management, you'll develop forecasts, budgets, and long-term financial plans to support our objectives, including potential IPO considerations. Your international financial expertise will guide us through cross-border complexities, while your hands-on approach will optimize cash flow management and budgeting processes. Additionally, any previous leadership experience will help you manage our existing team of accountants.</p><p><strong>What You Will Do</strong></p><ul> <li>Provide leadership in overseeing the financial operations of multiple entities within the group.</li> <li>Ensure compliance with accounting standards, financial regulations, and company policies.</li> <li>Collaborate with executive management to develop financial forecasts, budgets, and long-term financial plans aligned with the company's objectives. .</li> <li>Contribute to the development and execution of financial plans for future growth, including potential IPO considerations.</li> <li>Prepare comprehensive financial proposals, presentations, and due diligence documents to support fundraising efforts.</li> <li>Leverage extensive international financial experience to navigate the complexities of managing finances across borders.</li> <li>Handle multi-currency transactions and understand the nuances of financial regulations in various jurisdictions.</li> <li>Lead and mentor a high-performing finance team, fostering a culture of excellence and collaboration.</li> <li>Provide guidance on complex financial issues and ensure professional development within the team.</li> <li>Bring expertise in financial technology or insurtech, staying abreast of industry trends and implementing relevant technologies to enhance financial processes.</li> <li>Optimize cash flow management, working capital, and budgeting processes to maximize profitability and minimize financial risks.</li> </ul><p><strong>What We Need</strong></p><ul> <li>Bachelor's degree in Finance, Economics, or Business</li> <li>CPA or ACCA certification is mandatory</li> <li>10+ years of progressive experience in financial roles, with a strong preference for international companies</li> <li>Demonstrated experience overseeing financial operations across multiple jurisdictions</li> <li>Prior exposure to financial technology (FinTech) or insurtech is highly desirable</li> <li>Experience with initial public offerings (IPO) is a significant advantage</li> <li>Experience with Xero or Quickbooks is a plus</li> <li>Previous work experience in a Big Four accounting firm is a plus</li> <li>Able to work independently and under pressure in a fast-paced environment with an emphasis on accuracy and timeliness</li> <li>Meticulous, well-organized and conscientious with a high level of initiative at work</li> <li>Self-motivated, hardworking, a strong sense of responsibility with a positive working attitude</li> <li>Resourceful, can-do attitude and willingness to learn and go beyond</li> <li>Great English communication skills</li> <li>Based in the Philippines</li> </ul><p><strong>Why You'll Love Working Here</strong></p><ul> <li>Fully Remote</li> <li>Flexible Leave</li> <li>International Environment</li> <li>Competitive remuneration package</li> <li>Performance Bonus</li> <li>Stock Options after 6 months</li> <li>Company activities and events</li> <li>Learning and development plan</li> <li>Remote work allowance</li> </ul><p><strong>CoverGo Company</strong><a href=\"https://www.youtube.com/watch?v=YI0ezLxvFvA\" rel=\"nofollow noreferrer noopener\" class=\"external\"><strong> Video</strong></a></p><p>By submitting your application, you confirm that you have read, understood, and accepted the content of CoverGo’s<a href=\"https://apply.workable.com/covergo/gdpr_policy?lng=en\" rel=\"nofollow noreferrer noopener\" class=\"external\"> Privacy Notice</a> and you consent to the processing of your data as part of this application.</p><p></p><h3>Requirements: </h3><h3>Benefits: </h3>","tags":"[\"Finance\",\"management\"]","pubDate":"2024-05-21 00:00:00.000","link":"https://apply.workable.com/covergo/j/C5BD527F2B","savedDate":"2024-05-23 05:31:13.750","slug":"finance-controller-fully-remote-covergo-9487"},{"id":4749307501,"title":"Lead QA Engineer","company":"Circle","image":"https://lever-client-logos.s3.us-west-2.amazonaws.com/3b00b20d-12c8-4ed9-ae9e-97d8601567b2-1706111761671.png","description":"<div><b style=\"font-size: 18px\">About Us</b></div><div>Circle is building the world’s leading all-in-one platform for online communities. We make it possible for creators, coaches, educators, and businesses to bring together their audience with engaging discussions, live streams, events, chat, courses, and payments — all in one place, all under their own brand.</div><div><br></div><div>We’re proud to be a fully remote company of around 150 (and growing!) team members from 30+ countries around the world. We strive to find exceptional talent, empower them to do their best work, and in turn, have a meaningful impact in their own lives. We don’t track hours, but we manage for outcomes in an a-synchronous culture.</div><div><br></div><div>Twice a year, we bring the whole company together for incredible company retreats in beautiful places around the world!</div><div><br></div><div><b style=\"font-size: 18px\">About the role</b></div><div>We're looking for a Lead QA Engineer with a heavy mobile focus to join our Engineering team as we aim to make Circle the top choice for creator/brand-led communities.</div><div><br></div><div>This role be a player-coach, leading our QA team, while also being hands-on. In a hands-on capacity, it will focus mostly on our mobile automation test framework, but will be involved in all technical aspects of QA. In a management capacity, this role will manage the QA team of three, helping to organize and coordinate work, remove blockers, support in each individual team members growth, and more.</div><div><br></div><div><b>We have a preference for candidates in North/South American (AMER), and European (EMEA) time zones.</b></div><div><span style=\"font-size: 13.3333px\">Cash compensation is a starting point, and we want all of our team members to be able to grow in their roles. In addition to equity, benefits and perks, our cash compensation is subject to an annual review and increase on a once per year basis on the hire date anniversary.</span></div><h3>What you'll be doing</h3><li>Drive Circle’s product quality cycle, ensuring a seamless user experience.</li><li>Ship often and ship with care.</li><li>Design, develop, and implement robust test automation frameworks for Android and iOS platforms using frameworks like <b>Appium/WebdriverIO</b>, and support our web application using <b>Watir </b>(built using Ruby on Rails and React).</li><li>Work autonomously on prioritizing and defining our QA roadmap.</li><li>Improve the quality of our codebase and identify architectural deficiencies in your product area.</li><li>Engage in considerate, but robust, PR reviews with Circle's engineers.</li><li>Lead and mentor the QA team, playing a key role in hiring and managing performance.</li><li>Collaborate closely with Circle's product and design leaders to deliver exceptional user experiences.</li><li>Work closely with our engineers to create a world-class user experience and quality mindset.</li>,<h3>What you'll need to be successful</h3><li>Strong alignment with our values.&nbsp;<a href=\"https://www.notion.so/223a15ea312c4922b793593d07add7fe?pvs=21\" class=\"postings-link\">Find our values on our career page</a>&nbsp;if you haven’t read up on them yet.</li><li>You are proficient in English (spoken, written, and reading) at a&nbsp;<a href=\"https://magoosh.com/english-speaking/english-proficiency-levels-a-guide-to-determining-your-level/\" class=\"postings-link\">CEFR Level C1</a>&nbsp;/&nbsp;<a href=\"https://www.govtilr.org/\" class=\"postings-link\">ILR Level 5</a>.</li><li><b>8+ years experience working as a QA Engineer</b> on complex mobile and web applications.</li><li>Strong proficiency in mobile QA test frameworks. We currently use Appium for our React Native applications, but are open to new solutions.</li><li>Familiarity with both mobile and web test automation is necessary, but a high degree of proficiency in both is not a requirement. You should be highly proficient with mobile QA automation testing, but can be less experienced with web.</li><li><b>2+ years experience with managing and mentoring direct reports</b>&nbsp;(engineers/QA). You are a strong technical role model.</li><li>Ability to coordinate/project-manage work and keep the team organized combined with proactive communication and excellent judgment.</li><li>A desire to work in an environment which values speed of iteration and individual autonomy, while also embracing personal accountability and the ability to collaborate effectively as part of a dynamic team.</li><li>Motivation to understand the business and user needs, delivering impactful results.</li><li>Comfortable in a fast-paced environment with a certain level of ambiguity.</li><li>Adaptable with the ability to change direction quickly if necessary.</li><li>Familiar with agile software development principles.</li><li>Strong judgement and attention to detail when it comes to architectural, product, design, and process decisions. Your judgement should inspire a high level of trust within the team</li>,<h3>Bonus points</h3><li>Experience with <b>Elasticsearch</b> / <b>Sidekiq</b> / <b>Kafka</b> / <b>GraphQL</b></li><li>Previous experience working with community platforms.</li><li>Experience working on CRM/Marketing tools, with email deliverability, or in the creator space.</li><li>Experience at a fast-growing start-up.</li><div><b style=\"font-size: 18px\">The fun stuff</b></div><div><b>Fully remote:</b>&nbsp;work from anywhere in the world!</div><div><b>Autonomy and trust to do your job:</b>&nbsp;we care about outcomes over everything else.</div><div><b>Paid time away:</b>&nbsp;all employees are given 35 days of PTO annually. We also offer a paid sabbatical after 5 years.</div><div><b>Generous U.S. benchmarked compensation</b>&nbsp;and startup equity no matter where you are in the world.*</div><div><b>Awesome medical coverage</b>&nbsp;with 100% coverage for you and your family, or medical reimbursement options where applicable!*</div><div><b>Parental leave</b> for parents expanding their family, or just starting one.</div><div><b>Home office stipend</b>&nbsp;to help you get up and running.</div><div><b>Learning &amp; development stipend</b>&nbsp;to help you level up your professional skills.</div><div><b>Annual bonus potential</b>&nbsp;for roles that don't already receive variable income or commission.</div><div><b>Company retreats:</b>&nbsp;Twice a year, the Circle team gets together for a fully paid company retreat in incredible places around the world! We’ve had past retreats in Colombia, Portugal, and Mexico, with more planned on the horizon.</div><div><b>Check out our&nbsp;<a href=\"https://careers.circle.so/\" class=\"postings-link\">Careers</a>&nbsp;page for more.</b></div><div><span style=\"font-size: 10px\">*</span><i style=\"font-size: 10px\">Your role, location and unique circumstance may affect this.</i></div><div><br></div><div><b>Diversity, Equity &amp; Inclusion</b></div><div>As a fully-remote international company, diversity is baked into our DNA. Here’s how our CEO, Sid Yadav, frames our hiring mission: “let’s find talent in underserved and under-represented corners of the world, set them up to do the best work of their lives, and in turn, change their life.” To achieve this hiring mission, we offer competitive&nbsp;<a href=\"http://u.s.-benchmarked/\" class=\"postings-link\">U.S.-benchmarked</a>&nbsp;compensation no matter where someone’s located in the world, and we proactively seek candidates who expand representation of backgrounds, cultures and lived experiences in our teams.</div><div><br></div><div><b>Equal Employment Opportunity</b></div><div>Circle is an equal opportunity employer and as such, we do not discriminate on the basis of race, color, religion, sex, sexual orientation, gender identity, national origin, age, disability, or any other characteristic protected by applicable laws.</div><div>If you require any accommodations during the recruitment process, please let us know and we will work with you to meet your needs.</div><div><br></div>","tags":"[\"management\",\"engineering\",\"aws\"]","pubDate":"2024-05-17 19:22:40.257","link":"https://jobs.lever.co/circleco/7b6bdd9f-d841-40ea-ba85-0165003ad84b","savedDate":"2024-05-23 05:31:13.750","slug":"lead-qa-engineer-circle-1105"},{"id":4853218670,"title":"Channel Sales Specialist (UAE)","company":"Airalo","image":"https://lever-client-logos.s3.us-west-2.amazonaws.com/55028a36-609c-479c-9553-d4689ff2dd8c-1669620566663.png","description":"<div><b>About Airalo</b></div><div>Alo! Airalo is the world’s first eSIM store that helps people connect in over 200+ countries and regions across the globe. We are building the next digital service that revolutionizes the telecom industry. We are a travel-tech company and an equal-opportunity environment that values and executes diversity, inclusion, and equity. Our team is spread across 50+ countries and six continents. What glues us together is our commitment to changing the way you connect<span style=\"font-size: 13.3333px\">. </span></div><div><br></div><div><b>About you</b></div><div>We hope that you care deeply about the quality of your work, the intrinsic worth of tasks, and the success of your team. You are self-disciplined and do not require micromanagement in terms of your skillset and work ethic. You do your best to flourish as an individual every day while working hard to foster a collaborative team environment. You believe in the importance of being — and staying — authentic, honest, positive, and kind. You are a good interlocutor with clear and concise communication. You are able to manage multiple projects, have an analytical mind, pay keen attention to detail, and love to get your hands dirty. You are cognizant, tolerant, and welcoming of vulnerabilities and cultural differences.</div><div><br></div><div><b>About the Role</b></div><div><b>Position</b>: Full-time / Employee</div><div><b>Location:</b>&nbsp;Remote-first </div><div><b>Benefits:</b>&nbsp;Health Insurance, work-from-anywhere stipend, annual wellness &amp; learning credits, annual all-expenses-paid company retreat in a gorgeous destination &amp; other benefits</div><div><br></div><div>Airalo is looking for a retail <b>Channel Sales Specialist</b> to join the <b>Airalo Partnerships</b> department.</div><div>Physical SIM cards are passe. The future of connectivity, especially for travelers, is through eSIMs. As the undisputed industry leader in the B2C segment, we are now looking to expand our presence in the retail and traditional telecom sales channels to bring the eSIM revolution to hundreds of thousands of telecom retailers globally.</div><div>As the <b>Channel Sales Specialist</b> for UAE, you will own Airalo’s retail distribution strategy and execution to ensure Airalo’s presence across branded and unorganized travel, telecom and general retail stores.</div><h3>Responsibilities include but are not limited to:</h3><li>Work closely with the <b>Channel Sales Manager, Arabia &amp; Africa</b> and other team members in the department</li><li>Market mapping of the travel agent and telecom retail universe in key cities across UAE and creating a distribution roadmap to achieve maximum penetration across the universe</li><li>Onboard and support new partners as they join the Airalo partner community</li><li>Build and maintain fruitful relationships with the store managers / owners to drive mutual growth</li><li>Drive visibility and brand awareness for Airalo at point of sale through merchandising / employee training</li><li>Design and manage a program to educate retailers and travel agents on eSIM adoption</li><li>Conduct competitive research and define the Airalo retail distribution roadmap to maintain Airalo’s status as the preferred provider across partners</li><li>Collaborate and work with different internal and external stakeholders to develop and execute projects/opportunities successfully</li><li>Own and deliver monthly, quarterly and annual OKRs for your channel with regular tracking and progress reports</li><li>As a core member of the UAE squad, always explore ways and means to further consolidate Airalo’s dominance in UAE</li>,<h3>Must-haves:</h3><li>2+ years of experience in retail channel sales or business development in the travel or telecom industry</li><li>Good understanding of the retail (preferably the travel and / or telecom retail) channel in UAE</li><li>This is a largely relationship driven channel. You must be able to forge and nurture relationships with stakeholders across the channel</li><li>Ability to narrate a good story - Airalo’s unique story and the problem we solve for our users makes it a compelling pitch for partners</li><li>Ability to employ sales techniques, including effective questioning, objection handling, consultative selling, and solution selling</li><li>Ability to multi-task</li><li>Experience with sales and partnerships tools</li><li>Perfect verbal and written communication skills in English and Arabic.</li>,<h3>Good to have:</h3><li>Familiarity with the travel or telecom industry</li><li>Prior work experience in the travel or telecom industry</li><li>Knowledge of eSIM and GSMA-related technologies and services</li><li>Certificates and courses in sales and partnerships</li><div>If you are interested in this position, <b>please apply via the link.</b></div><div><br></div><div><i>We sincerely thank all applicants in advance for submitting their interest in this opportunity with Airalo. </i></div>","tags":"[\"management\",\"B2C\"]","pubDate":"2024-05-08 07:44:26.116","link":"https://jobs.lever.co/airalo/c2d0a493-ec3d-4850-a3a8-92479bc835e2","savedDate":"2024-05-23 05:31:13.751","slug":"channel-sales-specialist-uae-airalo-8849"}]