[{"id":5405695638,"title":"Junior Software Engineers — No Degree Required, Self-Taught & Hobbyists Welcome!","company":"MixRank","image":"https://pbs.twimg.com/profile_images/378800000147745937/0fac42c12b433bbbd53ff3e15cd6fca4_400x400.png","description":"<p>At MixRank, we create B2B SaaS products that enable sales, marketing, finance, and business intelligence teams to accelerate their business with data and insights into their customers. One that provides the most comprehensive database of mobile apps and websites, technographics, companies, and decision makers. It's a platform created with the sole purpose of providing the fastest way for sales reps to build prospect lists, prioritize leads, and contact decision-makers.</p>\n<p>We’re looking for remote engineers—no degree required, self-taught &amp; hobbyists welcome! If you’re passionate about programming and love it as a hobby, this is the place for you. This is an open-ended, entry-level role with mentorship and diverse opportunities to work on all areas of our product—databases, distributed systems, infrastructure and tooling, data analysis, machine learning, frontend and backend web development, APIs, data mining, data modeling, and more.</p>\n<p>Our code base is very friendly to new contributors. You'll have a fully-functional development environment within hours (fully automated) and be pushing commits on your first day. Deployments to production happen multiple times per day and finish in less than 2 minutes. Effectively all of our codebase is written in Python, SQL, and Javascript/TypeScript. The core technologies you'll need familiarity with to be productive are Python, PostgreSQL, Linux, and Git.</p>\n<p>Why Join MixRank? Fully-remote, no HQ office. Team of 44 people across 15+ countries. Invested in by Y Combinator, 500 Startups, Mark Cuban. Profitable and growing 50% every year.</p>\n<p>Please include your updated resume when applying for this role.</p>\n<p><strong>Important:</strong> Only accept job offers from emails ending in @<a href=\"http://mixrank.com\" target=\"_blank\">mixrank.com</a>. Offers from any other email addresses are fraudulent. Do not share personal information with unverified senders.</p>\n","tags":"[\"postgres\",\"javascript\",\"typescript\",\"finance\",\"b2b\",\"database\"]","pubDate":"2025-01-16T09:12:56.284Z","link":"https://www.ycombinator.com/companies/mixrank/jobs/cHh6Nc0-junior-software-engineers-no-degree-required-self-taught-hobbyists-welcome","slug":"junior-software-engineers-no-degree-required-self-taught-hobbyists-welcome-mixrank-1558"},{"id":5852271219,"title":"Head of Revenue Excellence","company":"Aiwyn","image":"https://media.licdn.com/dms/image/v2/D4E0BAQEvDOFt9VDmfg/company-logo_200_200/company-logo_200_200/0/1714673337921/aiwyn_logo?e=1743033600&v=beta&t=0yqXd-p9YeUPxD_oaEkvrGENa6XLG5S4Q4dDXCettEY","description":"<div><b>Who is Aiwyn and what do we do?</b></div><div><br></div><div>Aiwyn is the fastest-growing software company serving the accounting profession.&nbsp;Founded in 2020, we now work with 100+ of the largest CPA firms in the world.&nbsp;Our “Job to be done”: speed up cash flow, save Partner time, &amp; deliver best-in-class client experiences. We do this by automating day-to-day firm operations with our Practice Automation solutions. Aiwyn is led by serial entrepreneurs with multiple exits and funded by top-tier investors (Bessemer, KKR, &amp; Revolution). We're passionate about building a remarkable company with world-class people, processes, and technology.</div><div><br></div><div>To learn more, visit our <a rel=\"noopener noreferrer\" class=\"postings-link\" href=\"https://aiwyn.ai/\"><b>website</b></a></div><div><br></div><div><b>This role: </b></div><div><br></div><div>We are looking for a Head of Revenue Excellence to partner closely with our CRO to design, implement, and manage Aiwyn’s approach to delivering world-class revenue enablement. This is an exciting opportunity for a strategic yet hands-on leader to build and own a modern enablement function at a top-quartile growth company.</div><div><br></div><div>As Aiwyn continues delivering substantial year over year growth, you will play a critical role in building and scaling the training, onboarding, and revenue programs required to de-risk and accelerate our Go-To-Market strategy through the next stages of growth.</div><div><br></div><div>In this role, you’ll be responsible for architecting, implementing, and optimizing the enablement processes, systems, and content needed to power Aiwyn’s revenue growth. While serving as a strategic leader, you will also be very hands-on—driving the scoping, design, and delivery of our enablement programs as we ramp up.</div><div><br></div><div>You will start as a “team of one” but have the opportunity to build a world-class Revenue Excellence team over time. This is a unique opportunity for someone who has led or heavily contributed to the buildout of Revenue Excellence/Enablement programs and is ready to own and scale these functions from the ground up.</div><div><br></div><div>If you are passionate about the future of revenue enablement—particularly with how AI is reshaping GTM practices—and are hungry to leave your mark, we’d love to talk.</div><div><b>Who is Aiwyn and what do we do?</b></div><div><br></div><div>Aiwyn is the fastest-growing software company serving the accounting profession.&nbsp;Founded in 2020, we now work with 100+ of the largest CPA firms in the world.&nbsp;Our “Job to be done”: speed up cash flow, save Partner time, &amp; deliver best-in-class client experiences. We do this by automating day-to-day firm operations with our Practice Automation solutions. Aiwyn is led by serial entrepreneurs with multiple exits and funded by top-tier investors (Bessemer, KKR, &amp; Revolution). We're passionate about building a remarkable company with world-class people, processes, and technology.</div><div><br></div><div>To learn more, visit our <a href=\"https://aiwyn.ai/\" class=\"postings-link\" target=\"_blank\" rel=\"noopener noreferrer\"><b>website</b></a></div><div><br></div><div><b>This role: </b></div><div><br></div><div>We are looking for a Head of Revenue Excellence to partner closely with our CRO to design, implement, and manage Aiwyn’s approach to delivering world-class revenue enablement. This is an exciting opportunity for a strategic yet hands-on leader to build and own a modern enablement function at a top-quartile growth company.</div><div><br></div><div>As Aiwyn continues delivering substantial year over year growth, you will play a critical role in building and scaling the training, onboarding, and revenue programs required to de-risk and accelerate our Go-To-Market strategy through the next stages of growth.</div><div><br></div><div>In this role, you’ll be responsible for architecting, implementing, and optimizing the enablement processes, systems, and content needed to power Aiwyn’s revenue growth. While serving as a strategic leader, you will also be very hands-on—driving the scoping, design, and delivery of our enablement programs as we ramp up.</div><div><br></div><div>You will start as a “team of one” but have the opportunity to build a world-class Revenue Excellence team over time. This is a unique opportunity for someone who has led or heavily contributed to the buildout of Revenue Excellence/Enablement programs and is ready to own and scale these functions from the ground up.</div><div><br></div><div>If you are passionate about the future of revenue enablement—particularly with how AI is reshaping GTM practices—and are hungry to leave your mark, we’d love to talk.</div><h3>What You'll Impact:</h3><li>Develop and execute a comprehensive revenue enablement strategy, aligning closely with the CRO and functional leaders across Sales, Marketing, and Customer Success.</li><li>Define a roadmap for training, onboarding, and ongoing sales enablement programs to support rapid growth.</li><li>Leverage scale-up stage start-up experience to de-risk projects and accelerate time to value, thinking about scalable solutions</li><li>Manage multiple projects with clear deliverables and develop a steady cadence of communication across all revenue stakeholders</li><li>Design and deliver a world-class onboarding experience for new sales hires, ensuring they quickly attain the skills, knowledge, and behaviors necessary to succeed.</li><li>Continuously optimize training content to address evolving product features, market trends, and buyer needs.</li><li>Create specialized training tracks for different sales roles (e.g., SDRs, AEs, Renewals/Expansion).</li><li>Build a centralized repository of sales content (playbooks, battle cards, presentations, scripts, etc.) in collaboration with Product Marketing and Sales Leadership.</li><li>Drive consistent messaging and positioning for all customer-facing teams, ensuring alignment and easy access to enablement materials.</li><li>Develop and manage ongoing enablement programs (e.g., weekly skill sessions, quarterly kick-offs, product updates) to keep the revenue team informed, motivated, and at the top of their game.</li><li>Partner with Marketing and Product teams to incorporate relevant product, market, and competitive intelligence into sales curricula.</li><li>Work with RevOps to establish key metrics and reporting (e.g., time-to-productivity, win rates, sales cycle times, ASPs) to quantify the impact of enablement initiatives.</li><li>Leverage data and feedback loops to refine and improve programs, ensuring alignment with revenue targets and company objectives.</li><li>Collaborate with Revenue Operations, Marketing, Product, and Customer Success to identify process improvements and drive consistency across all GTM teams.</li><li>Serve as a thought partner to leadership, bringing insights on new training technologies, methodologies, and AI-driven solutions.</li><li>Evaluate, implement, and manage the tools needed to deliver and measure enablement programs (e.g., Hightspot, LMS, conversation intelligence, etc).</li><li>Champion the use of AI and other modern technologies to deliver engaging, personalized training experiences at scale.</li><li>Expert user of cross functional workforce management tools such as Monday.com, Asana, etc.&nbsp;</li><li>As the team grows, hire, manage, and develop a high-performing enablement function.</li><li>Cultivate a culture of curiosity, innovation, and continuous learning within the revenue organization.</li><h3>What You'll Bring From Past Experience:</h3><li>5+ years of experience in Sales Enablement, Revenue Excellence, or related roles, preferably within high-growth B2B SaaS companies.</li><li>Proven track record of designing and executing effective enablement programs that measurably impact revenue performance.</li><li>Strong instructional design and facilitation skills, with the ability to engage diverse learning styles and job roles.</li><li>Mastery of, and desire to continue learning, modern selling techniques and frameworks (sales methodologies, best practices, and the unique evolving challenges of the B2B SaaS landscape)</li><li>Comfortable with CRM systems (Salesforce, HubSpot) and sales automation tools.</li><li>Expertise with modern enablement technologies (LMS, conversation intelligence, content management) and best practices.</li><li>Ability to adapt quickly to new technologies, including AI-driven solutions for training and coaching.</li><li>Exceptional communication skills—written, verbal, and interpersonal—with the ability to influence without direct authority.</li><li>Experience managing (or being ready to manage) small teams and working with cross-functional stakeholders at all levels.</li><li>Able to think big-picture while also rolling up sleeves to execute training sessions, develop content, and perform data analyses.</li><li>A “builder” mindset—eager to create a function from the ground up in a fast-paced environment.</li><li>Humble, curious, and excited to continue growing/learning</li><li>Eager to help others around you make massive impact&nbsp;</li><li>First principles thinker</li><li>Exceptional communication &amp; dynamic presentation skills—clear, concise, and engaging.</li><div><br></div><div><b>Why is This Opportunity Special?</b></div><li><b>Impact</b>: You’ll be the architect of the modern Revenue Excellence programs in one of the fastest growing vertical SaaS companies on the planet</li><li><b>Ownership</b>: A high-visibility role with the opportunity to directly shape GTM strategy at the executive level</li><li><b>Growth</b>: Join a world-class leadership &amp; GTM team, and be at the forefront of redefining revenue enablement with AI and other cutting-edge technologies</li><li><b>Culture</b>: Everyone checks titles &amp; egos at the door in the interest of creating remarkable impact/experiences together, for both our customers and our teammates</li><li><b>Compensation &amp; Benefits</b>: Highly competitive salary, equity, and benefits, reflecting our commitment to attracting and retaining the very best talent in the world</li><h3>Benefits and Perks:</h3><li>The big-picture value proposition of this role is simple: join us, and you'll be paid competitively to have freedom in solving worthwhile, challenging problems alongside other A-players at a fast growing SaaS startup led by an experienced and successful co-founding team with industry experience. </li><div><br></div><div>Other benefits include:</div><li><b>Adventure travel stipend</b> - you receive a $1,000 travel reimbursement on your work anniversary each year. We encourage our team to recharge and explore the world beyond their home office walls.</li><li><b>Remote, work-from-anywhere culture</b></li><li><b>Flexible PTO</b></li><li><b>World Class health benefits</b> - we believe in fostering flourishing teams by providing benefits that go beyond the usual standards - Health, vision, dental, HSA/FSA, and mental health support.</li><li><b>Stock options</b> - every Full Time Employee has ownership in Aiwyn's future and success.</li><li><b>401(k) matching</b></li><h3>Our Values:</h3><li><b>Trust</b> - We champion transparency, welcome differing perspectives, uphold accountability, and trust that others have good intentions</li><li><b>Courage</b> - We have the courage to take calculated risks and embrace change, knowing what worked in the past won’t always work in the future</li><li><b>Impact</b> - Rooted in determination and innovation, we chase extraordinary outcomes and impactful results</li><li><b>Relentlessness</b> - We approach challenges with an unwavering resolve, never settling for mediocrity, and always striving to surpass expectations</li><h3>Learn more about Aiwyn:</h3><li><b><a rel=\"noopener noreferrer\" class=\"postings-link\" href=\"https://www.aiwyn.ai/about\">About us</a></b></li><li><b><a rel=\"noopener noreferrer\" class=\"postings-link\" href=\"https://www.aiwyn.ai/why-aiwyn\">Why Aiwyn</a></b></li><li><b><a rel=\"noopener noreferrer\" class=\"postings-link\" href=\"https://www.youtube.com/@AiwynAI\">YouTube page</a></b></li><div>Aiwyn is an equal opportunity employer. All qualified applicants will receive consideration for employment without regard to age, ancestry, color, family or medical care leave, gender identity or expression, genetic information, marital status, medical condition, national origin, physical or mental disability, political affiliation, protected veteran status, race, religion, sex (including pregnancy), sexual orientation, or any other characteristic protected by applicable laws, regulations and ordinances.</div><div><br></div><div>Candidate information will be treated in accordance with our CCPA privacy notice which can be found here: <a rel=\"noopener noreferrer\" class=\"postings-link\" href=\"https://www.aiwyn.ai/ccpa\">https://www.aiwyn.ai/ccpa</a></div>","tags":"[\"management\",\"b2b\",\"aws\"]","pubDate":"2025-01-16T02:19:03.471Z","link":"https://jobs.lever.co/aiwyn/f38dc003-1940-41e5-9b90-e895dcbe2ebe","slug":"head-of-revenue-excellence-aiwyn-4502"},{"id":1356955833,"title":"Head of Revenue Operations","company":"Aiwyn","image":"https://media.licdn.com/dms/image/v2/D4E0BAQEvDOFt9VDmfg/company-logo_200_200/company-logo_200_200/0/1714673337921/aiwyn_logo?e=1743033600&v=beta&t=0yqXd-p9YeUPxD_oaEkvrGENa6XLG5S4Q4dDXCettEY","description":"<div><b>Who is Aiwyn and what do we do?</b></div><div><br></div><div>Aiwyn is the fastest-growing software company serving the accounting profession.&nbsp;Founded in 2020, we now work with 100+ of the largest CPA firms in the world.&nbsp;Our “Job to be done”: speed up cash flow, save Partner time, &amp; deliver best-in-class client experiences. We do this by automating day-to-day firm operations with our Practice Automation solutions. Aiwyn is led by serial entrepreneurs with multiple exits and funded by top-tier investors (Bessemer, KKR, &amp; Revolution). We're passionate about building a remarkable company with world-class people, processes, and technology.</div><div><br></div><div>To learn more, visit our <b><a class=\"postings-link\" href=\"https://aiwyn.ai/\">website</a></b></div><div><br></div><div><b>This role: </b></div><div><br></div><div>We are looking for a Head of Revenue Operations to partner closely with our Chief Revenue Officer (CRO) to design, implement, and manage the backbone of our go-to-market engine. This is an exciting opportunity for a strategic and hands-on leader to build and own a modern Revenue Operations function at a top-quartile growth company.</div><div><br></div><div>As Aiwyn continues to deliver substantial year over year growth, you will play a critical role in building/scaling the revenue processes &amp; supporting instrumentation that will help de-risk/accelerate our Go-To-Market strategy through our next stages of growth.</div><div><br></div><div>As the Head of Revenue Operations, you will report directly to our CRO and will be responsible for architecting, implementing, and optimizing the processes, systems, and analytics that power Aiwyn’s revenue growth.</div><div><br></div><div>In this role we are looking for a strategic leader who is also hands-on, diving into the data, configuration, and design alongside your team.&nbsp;</div><div><br></div><div>This is a unique opportunity for someone who has led the build out of RevOps at similar stages of growth, or a leader that has been an owner of these functions / projects and is ready to step up into a role owning/building the RevOps department from the ground up.</div><div><br></div><div>If you’re passionate about the future of GTM operations—particularly with how AI is reshaping the future—and are hungry to leave your mark, we’d love to talk.&nbsp;</div><div><b>Who is Aiwyn and what do we do?</b></div><div><br></div><div>Aiwyn is the fastest-growing software company serving the accounting profession.&nbsp;Founded in 2020, we now work with 100+ of the largest CPA firms in the world.&nbsp;Our “Job to be done”: speed up cash flow, save Partner time, &amp; deliver best-in-class client experiences. We do this by automating day-to-day firm operations with our Practice Automation solutions. Aiwyn is led by serial entrepreneurs with multiple exits and funded by top-tier investors (Bessemer, KKR, &amp; Revolution). We're passionate about building a remarkable company with world-class people, processes, and technology.</div><div><br></div><div>To learn more, visit our <b><a href=\"https://aiwyn.ai/\" class=\"postings-link\">website</a></b></div><div><br></div><div><b>This role: </b></div><div><br></div><div>We are looking for a Head of Revenue Operations to partner closely with our Chief Revenue Officer (CRO) to design, implement, and manage the backbone of our go-to-market engine. This is an exciting opportunity for a strategic and hands-on leader to build and own a modern Revenue Operations function at a top-quartile growth company.</div><div><br></div><div>As Aiwyn continues to deliver substantial year over year growth, you will play a critical role in building/scaling the revenue processes &amp; supporting instrumentation that will help de-risk/accelerate our Go-To-Market strategy through our next stages of growth.</div><div><br></div><div>As the Head of Revenue Operations, you will report directly to our CRO and will be responsible for architecting, implementing, and optimizing the processes, systems, and analytics that power Aiwyn’s revenue growth.</div><div><br></div><div>In this role we are looking for a strategic leader who is also hands-on, diving into the data, configuration, and design alongside your team.&nbsp;</div><div><br></div><div>This is a unique opportunity for someone who has led the build out of RevOps at similar stages of growth, or a leader that has been an owner of these functions / projects and is ready to step up into a role owning/building the RevOps department from the ground up.</div><div><br></div><div>If you’re passionate about the future of GTM operations—particularly with how AI is reshaping the future—and are hungry to leave your mark, we’d love to talk.&nbsp;</div><h3>What You'll Impact:</h3><li>Work closely with the CRO, Head of Marketing, Head of CS, Finance team, and executive leadership to define and execute the GTM roadmap.</li><li>Act as a thought partner and advocate for modern revenue operations, staying ahead of industry trends and AI innovations.</li><li>Leverage scale-up stage start-up experience to de-risk projects and accelerate time to value, thinking about scalable solutions</li><li>Manage and mentor a small but growing team of operations professionals.</li><li>Identify and coordinate with external consultants or agencies when needed to achieve strategic goals.</li><li>Foster a culture of continuous learning, innovation, and excellence.</li><li>Lead the migration from HubSpot CRM to <a href=\"http://Salesforce.com\">Salesforce.com</a>, ensuring data integrity and minimal disruption.</li><li>Evaluate, implement, and manage critical tools such as Clari, sales engagement, conversational intelligence, and other GTM/RevOps technologies.</li><li>Oversee system integrations to create a seamless end-to-end revenue funnel, with a focus on user experience, speed, accuracy, and actionable insights.</li><li>Manage multiple projects with clear deliverables and develop a steady cadence of communication across all revenue stakeholders</li><li>Work with finance to forecast and plan for future revenue team headcount needs&nbsp;</li><li>Ensure the organizational structure and roles are positioned to scale effectively with a focus on world-class efficiency metrics</li><li>Develop and optimize comp plans that support both standard SaaS subscriptions and merchant processing/payments revenue streams.</li><li>Partner with Finance, HR, and Sales to align compensation structures with business objectives.</li><li>Use data and analytics to model comp plan scenarios and measure performance against targets.</li><li>Lead the design and implementation of a territory framework as we shift from a geo-based approach to named accounts.</li><li>Collaborate with Sales Leadership to ensure territories are well-balanced and focusing capacity on the right types of selling motions</li><li>Continuously iterate on territory plans to maximize coverage, pipeline generation, and revenue.</li><li>Establish reporting and analytics frameworks to monitor the entire revenue cycle (top of funnel, pipeline, expansion, retention, and efficiency).</li><li>Leverage AI-driven insights and predictive analytics to forecast revenue, identify trends, and drive strategic decisions.</li><li>Develop and continuously refine core revenue processes (e.g., lead routing, opportunity management, pipeline inspection, forecasting, etc).</li><li>Collaborate with Marketing Ops and CS Ops to ensure handoffs are seamless and client touchpoints are well-orchestrated.</li><h3>What You'll Bring From Past Experience:</h3><li>8+ years in Revenue Operations, Sales Operations, or related roles within a scale-up B2B SaaS environment</li><li>2+ years of leadership experience building/leading/developing a team</li><li>Demonstrated success in building or significantly influencing the scale up of RevOps processes and systems.</li><li>Familiarity with payment processing/merchant services revenue models is highly preferred</li><li>Hands-on experience with <a href=\"http://Salesforce.com\">Salesforce.com</a> administration and implementation.</li><li>Direct experience migrating from one CRM to another (HubSpot to <a href=\"http://Salesforce.com\">Salesforce.com</a> is a plus).</li><li>Proficiency with a modern GTM tech stack (e.g. Clari, Conversation intelligence, Sales Engagement, Sales Enablement, BI - Looker, etc) and data sources (LSN, ZoomInfo, 6sense, etc)&nbsp;</li><li>Expert user of cross functional workforce management tools such as <a href=\"http://Monday.com\">Monday.com</a>, Asana, etc.&nbsp;</li><li>Expert Excel/Google Sheets skills</li><li>Ability to set the strategy but also get in the weeds—“hands on keyboard” with data, tools, and process documentation.</li><li>Proven track record of building scalable processes in a high-growth environment.</li><li>Exceptional cross functional program management skills&nbsp;</li><li>A builder mindset: excited about creating a function from scratch and seeing it scale.</li><li>Skilled at cross-functional collaboration, particularly with Sales, Marketing, CS, and Finance.</li><li>Experience managing and mentoring a small team or a strong desire to lead and develop people.</li><li>Humble, curious, and excited to continue growing/learning</li><li>Eager to help others around you make massive impact&nbsp;</li><li>First principles thinker</li><li>Exceptional communication skills—clear, concise, and engaging.</li><li>Highly analytical &amp; detail-oriented.</li><div><br></div><div><b>Why is This Opportunity Special?</b></div><li><b>Impact</b>: You’ll be the architect of the modern Revenue Operations engine in one of the fastest growing vertical SaaS companies on the planet</li><li><b>Ownership</b>: A high-visibility role with the opportunity to directly shape strategy at the executive level</li><li><b>Growth</b>: Join a world-class leadership &amp; GTM team, and be at the forefront of redefining revenue operations with AI and other cutting-edge technologies.</li><li><b>Culture</b>: Everyone checks titles &amp; egos at the door in the interest of creating remarkable impact/experiences together, for both our customers and our teammates&nbsp;</li><li><b>Compensation &amp; Benefits</b>: Highly competitive salary, equity, and benefits, reflecting our commitment to attracting and retaining the very best talent in the world</li><h3>Benefits and Perks:</h3><li>The big-picture value proposition of this role is simple: join us, and you'll be paid competitively to have freedom in solving worthwhile, challenging problems alongside other A-players at a fast growing SaaS startup led by an experienced and successful co-founding team with industry experience. </li><div><br></div><div>Other benefits include:</div><li><b>Adventure travel stipend</b> - you receive a $1,000 travel reimbursement on your work anniversary each year. We encourage our team to recharge and explore the world beyond their home office walls.</li><li><b>Remote, work-from-anywhere culture</b></li><li><b>Flexible PTO</b></li><li><b>World Class health benefits</b> - we believe in fostering flourishing teams by providing benefits that go beyond the usual standards - Health, vision, dental, HSA/FSA, and mental health support.</li><li><b>Stock options</b> - every Full Time Employee has ownership in Aiwyn's future and success.</li><li><b>401(k) matching</b></li><h3>Our Values:</h3><li><b>Trust</b> - We champion transparency, welcome differing perspectives, uphold accountability, and trust that others have good intentions</li><li><b>Courage</b> - We have the courage to take calculated risks and embrace change, knowing what worked in the past won’t always work in the future</li><li><b>Impact</b> - Rooted in determination and innovation, we chase extraordinary outcomes and impactful results</li><li><b>Relentlessness</b> - We approach challenges with an unwavering resolve, never settling for mediocrity, and always striving to surpass expectations</li><h3>Learn more about Aiwyn:</h3><li><a class=\"postings-link\" href=\"https://www.aiwyn.ai/about\"><b>About us</b></a></li><li><a class=\"postings-link\" href=\"https://www.aiwyn.ai/why-aiwyn\"><b>Why Aiwyn</b></a></li><li><a class=\"postings-link\" href=\"https://www.youtube.com/@AiwynAI\"><b>YouTube page</b></a></li><div>Aiwyn is an equal opportunity employer. All qualified applicants will receive consideration for employment without regard to age, ancestry, color, family or medical care leave, gender identity or expression, genetic information, marital status, medical condition, national origin, physical or mental disability, political affiliation, protected veteran status, race, religion, sex (including pregnancy), sexual orientation, or any other characteristic protected by applicable laws, regulations and ordinances.</div><div><br></div><div>Candidate information will be treated in accordance with our CCPA privacy notice which can be found here: <a class=\"postings-link\" href=\"https://www.aiwyn.ai/ccpa\">https://www.aiwyn.ai/ccpa</a></div>","tags":"[\"finance\",\"management\",\"b2b\",\"aws\"]","pubDate":"2025-01-16T02:09:48.545Z","link":"https://jobs.lever.co/aiwyn/865cf387-2b5b-457e-ad1a-c841e0bd93a9","slug":"head-of-revenue-operations-aiwyn-3615"},{"id":5284707792,"title":"Growth Marketing Manager","company":"Empower","image":"https://lever-client-logos.s3.us-west-2.amazonaws.com/2e1a369c-b58f-41ac-8d86-4b0a77695e68-1687915522032.png","description":"<p style=\"min-height:1.5em\"><strong>EMPOWER OVERVIEW</strong></p><p style=\"min-height:1.5em\"><a target=\"_blank\" rel=\"noopener noreferrer nofollow\" href=\"http://empower.me/\">Empower</a> is shaking up an outdated financial system by providing real opportunity for our customers: the opportunity to get the cash they need, to access fair credit, and to change their financial story. Today, we’re helping millions of people find financial security through machine learning models that evaluate creditworthiness using a more inclusive lens and mobile-first products: Cash Advance, Thrive line of credit, and Petal credit cards. Tomorrow? Creating even more financial paths for our customers (and their wallets) to succeed.</p><p style=\"min-height:1.5em\">This year, Empower ranked #65 on Inc. 5000’s Fastest-Growing Private Companies list — our third year in a row cracking the top 100 — and was named by Forbes as one of the 25 Next Billion-Dollar Startups for 2024. Empower was also featured by Forbes on America’s Best Startup Employers list in 2023, and our Thrive line of credit product was named by Fast Company as one of 2022’s Next Big Things in Tech.</p><p style=\"min-height:1.5em\">Empower is backed by Sequoia Capital, Blisce, and Icon Ventures. Ready to grow your impact and accelerate your career? Take a look at our open roles — we can’t wait to meet you.</p><p style=\"min-height:1.5em\"></p><p style=\"min-height:1.5em\"><strong>THE EMPOWER WAY</strong></p><p style=\"min-height:1.5em\"><strong>Great Expectations</strong>: We come up with bold, audacious goals for ourselves and go all out for impact</p><p style=\"min-height:1.5em\"><strong>Owner Mindset</strong>: We give every employee latitude to act independently, make smart choices, and move the business forward</p><p style=\"min-height:1.5em\"><strong>Spirited Debate</strong>: We love skeptics and seek counter opinions to challenge our personal assumptions and expand our view</p><p style=\"min-height:1.5em\"><strong>Customer Obsession:</strong> We listen to understand, empathize, and create a memorable, rewarding experience for our community</p><p style=\"min-height:1.5em\"><strong>Inclusive Collaboration</strong>: We believe diverse teams make the best decisions, and we strive to give diverse voices a seat at the table</p><p style=\"min-height:1.5em\"><strong>No Jerks Allowed</strong>: We value our relationships and take the time to build trust and connection and communicate respectfully</p><p style=\"min-height:1.5em\"></p><p style=\"min-height:1.5em\"><strong>WHAT EMPOWER OFFERS</strong></p><p style=\"min-height:1.5em\">Competitive salary</p><p style=\"min-height:1.5em\">Generous equity package</p><p style=\"min-height:1.5em\">Full healthcare benefits</p><p style=\"min-height:1.5em\">Technology expense reimbursement</p><p style=\"min-height:1.5em\">Virtual first environment</p><p style=\"min-height:1.5em\"></p><p style=\"min-height:1.5em\"></p><h2><strong>JOB DESCRIPTION</strong><br /></h2><p style=\"min-height:1.5em\"><strong>Empower</strong> is seeking a <strong>Growth Marketing Manager</strong> to deploy, measure, and optimize a multimillion advertising budget more efficiently for paid social and other digital channels. This hybrid role combines the deep analytical rigor of a Business Analyst with the strategic execution of a Media Buyer to drive measurable impact in our marketing efforts.</p><p style=\"min-height:1.5em\">The ideal candidate excels at using data and analytics to solve complex problems and identify new opportunities that fuel business growth. They will collaborate across marketing, product, and design teams to develop agile solutions that maximize the value of our digital advertising campaigns. We welcome candidates with limited or no prior experience in digital marketing but possess an analytics-first mindset, technical aptitude, exceptional initiative, and a passion for learning and growing in the field.</p><p style=\"min-height:1.5em\"><strong>Travel</strong> for company offsites is expected at a minimum of 2 times a year.</p><p style=\"min-height:1.5em\"></p><h2><strong>KEY RESPONSIBILITIES</strong></h2><ul style=\"min-height:1.5em\"><li><p style=\"min-height:1.5em\">Own and manage paid media campaigns across key platforms (e.g., Meta, Google, TikTok) to drive optimal performance and alignment with business goals.</p></li><li><p style=\"min-height:1.5em\">Analyze campaign and channel-level marketing performance to uncover insights that inform strategic decision-making.</p></li><li><p style=\"min-height:1.5em\">Design and execute A/B and multivariate tests to measure the effectiveness of new strategies, campaigns, and budget allocations.</p></li><li><p style=\"min-height:1.5em\">Influence marketing budget allocation through data-driven recommendations and business intuition.</p></li><li><p style=\"min-height:1.5em\">Collaborate with cross-functional teams—Product, Marketing Analytics, and Design—to seamlessly align media buying strategies with broader business goals, driving meaningful and measurable outcomes.</p></li></ul><p style=\"min-height:1.5em\"></p><h2></h2><h2><strong>QUALIFICATIONS</strong></h2><ul style=\"min-height:1.5em\"><li><p style=\"min-height:1.5em\">B.S. in engineering, business, finance, computer science, mathematics, or related field.</p></li><li><p style=\"min-height:1.5em\">3+ years of industry experience in data analytics, marketing analytics, or media buying.</p></li><li><p style=\"min-height:1.5em\">Highly adaptable to new tools, platforms, and analytical methods.</p></li><li><p style=\"min-height:1.5em\">Strong problem-solving skills with a structured approach.</p></li><li><p style=\"min-height:1.5em\">Ability to communicate complex topics effectively using frameworks.</p></li><li><p style=\"min-height:1.5em\">Comfort working with cross-functional partners in marketing, tech, and business teams.</p></li><li><p style=\"min-height:1.5em\">(Preferred) Hands-on experience managing paid campaigns on platforms like Meta, Google, and TikTok.</p></li><li><p style=\"min-height:1.5em\">(Preferred) Experience in FinTech or banking with exposure to credit or marketing analytics.</p></li><li><p style=\"min-height:1.5em\">(Preferred) Strong SQL abilities with high accuracy and attention to detail, experience with Python is a plus</p></li></ul><p style=\"min-height:1.5em\"></p><p style=\"min-height:1.5em\">At Empower, we hire for people that push themselves to understand others and seek out ways to challenge their personal assumptions. Our hope is that by fostering such an environment, we strengthen our business and relationships by putting people first. We are committed to building a diverse, inclusive, and equitable workspace where everyone (regardless of age, education, ethnicity, gender, sexual orientation, or any personal characteristics) feels like they belong. Even if your experience doesn’t exactly match up to our job description, you should feel empowered to apply regardless!</p>","tags":"[\"finance\",\"engineering\"]","pubDate":"2025-01-15T19:37:25.223Z","link":"https://jobs.ashbyhq.com/empower%20finance/08bd88bb-f1db-436a-a35a-6ae1b42f9eff","slug":"growth-marketing-manager-empower-2600"},{"id":7661549100,"title":"Support Engineer (Americas)","company":"Supabase","image":"https://avatars.githubusercontent.com/u/54469796?s=200&v=4","description":"<p style=\"min-height:1.5em\">Supabase is an open-source database platform built by developers for developers. Supabase adds auth, realtime, storage, restful APIs, and edge functions to Postgres.</p><p style=\"min-height:1.5em\">We are seeking Support Engineers to provide world-class <strong>developer support</strong> for anyone experiencing issues or seeking guidance when using Supabase. The support team is globally distributed with a strong focus on minimizing time to fix, and works closely with the product engineering and growth teams.</p><p style=\"min-height:1.5em\"><strong>You will:</strong></p><ul style=\"min-height:1.5em\"><li><p style=\"min-height:1.5em\">Provide initial and timely responses to all support cases for a variety of topics, from billing or pre-sales requests to optimization or implementation questions.</p></li><li><p style=\"min-height:1.5em\">Triage support cases including directing users to previous answers, code examples, documentation, or escalating to specific technical or business team members.</p></li><li><p style=\"min-height:1.5em\">Monitor multiple feedback channels, e.g. Github Issues &amp; Discussions (check them here: <a target=\"_blank\" rel=\"noopener noreferrer nofollow\" href=\"https://github.com/supabase/supabase/issues\">https://github.com/supabase/supabase/issues</a>).</p></li><li><p style=\"min-height:1.5em\">Identify where internal tooling might be developed or obtained to improve support efficiency.</p></li><li><p style=\"min-height:1.5em\">Reproduce issues, create test cases and improve test coverage, if you have experience with testing.</p></li></ul><p style=\"min-height:1.5em\"><strong>You are:</strong></p><ul style=\"min-height:1.5em\"><li><p style=\"min-height:1.5em\">Experienced in customer support, with 3+ years of experience providing developer support to technical customers.</p></li><li><p style=\"min-height:1.5em\">Proficient in SQL (ideally PostgreSQL). You feel comfortable with complex SQL queries. If you have a database administration experience, it’s a plus.</p></li><li><p style=\"min-height:1.5em\">Excellent communication skills and fluency in English.</p></li><li><p style=\"min-height:1.5em\">Skilled in using Linux/Unix operating systems and the command line.</p></li><li><p style=\"min-height:1.5em\">Experienced working with GitHub Issues and Discussions.</p></li><li><p style=\"min-height:1.5em\">Bonus points if you're familiar with popular JavaScript frameworks like React, Vue, and Svelte and have some experience with Node.js.</p></li><li><p style=\"min-height:1.5em\">Having a degree in Computer Science is a plus too.</p></li></ul><h3>Timezones &amp; Logistics</h3><ul style=\"min-height:1.5em\"><li><p style=\"min-height:1.5em\">It’s a full-time position with a required location in North American time zones (we don’t believe in sustainability of overnight shifts).</p></li></ul><h3>We offer</h3><ul style=\"min-height:1.5em\"><li><p style=\"min-height:1.5em\">100% remote work. No location-based adjustment to your salary.</p></li><li><p style=\"min-height:1.5em\">Autonomous work. We work collaboratively on projects, but you set your own pace.</p></li><li><p style=\"min-height:1.5em\">Health, Vision and Dental benefits. Supabase covers 100% of the cost for employees and 80% for dependents</p></li><li><p style=\"min-height:1.5em\">Tech Allowance for any office setup you need</p></li><li><p style=\"min-height:1.5em\">Annual Education Allowance</p></li><li><p style=\"min-height:1.5em\">Annually run off-sites.</p></li></ul><h2>About the team</h2><ul style=\"min-height:1.5em\"><li><p style=\"min-height:1.5em\">We're a startup. It's unstructured.</p></li><li><p style=\"min-height:1.5em\">Collectively founded more than 30 startups.</p></li><li><p style=\"min-height:1.5em\">Globally distributed team with more than 30 different nationalities.</p></li><li><p style=\"min-height:1.5em\">We deeply believe in <a target=\"_blank\" rel=\"noopener noreferrer nofollow\" href=\"https://supabase.com/blog/2022/03/25/should-i-open-source-my-company\">the efficacy of collaborative open source</a>. We support existing communities and tools, rather than building \"yet another xx\".</p></li><li><p style=\"min-height:1.5em\">We \"dogfood\" everything. If you use it in your project, we use it in Supabase.</p></li></ul><h2>Process</h2><ul style=\"min-height:1.5em\"><li><p style=\"min-height:1.5em\">The entire process is fully remote and all communication will happen over email or via video chat.</p></li><li><p style=\"min-height:1.5em\">Once you've submitted your application, the team will review your submission and may reach out for a short screening interview over a video call.</p></li><li><p style=\"min-height:1.5em\">If you pass the screen you will be invited to up to four follow-up interviews. </p></li><li><p style=\"min-height:1.5em\">The calls:</p><ul style=\"min-height:1.5em\"><li><p style=\"min-height:1.5em\">usually take between 20-45 minutes each depending on the interviewer.</p></li><li><p style=\"min-height:1.5em\">most of the time, are all 1:1.</p></li><li><p style=\"min-height:1.5em\">will be with the founders, a member of either the growth or engineering team (depending on the role) and usually one other person from your immediate team or function.</p></li></ul></li><li><p style=\"min-height:1.5em\">Once the interviews are over, the team will meet to discuss several roles and candidates and may:</p><ul style=\"min-height:1.5em\"><li><p style=\"min-height:1.5em\">ask one or two follow-up questions over email or a quick call.</p></li><li><p style=\"min-height:1.5em\">go directly to making an offer.</p></li></ul></li></ul>","tags":"[\"postgres\",\"javascript\",\"engineering\",\"database\"]","pubDate":"2025-01-15T16:41:31.938Z","link":"https://jobs.ashbyhq.com/supabase/e4e3ccb7-7b7d-42a2-be0f-26cbb5ae4abd","slug":"support-engineer-americas-supabase-3002"},{"id":8617583722,"title":"Support Engineer (EMEA)","company":"Supabase","image":"https://avatars.githubusercontent.com/u/54469796?s=200&v=4","description":"<p style=\"min-height:1.5em\">Supabase is an open-source database platform built by developers for developers. Supabase adds auth, realtime, storage, restful APIs, and edge functions to Postgres.</p><p style=\"min-height:1.5em\">We are seeking Support Engineers to provide world-class <strong>developer support</strong> for anyone experiencing issues or seeking guidance when using Supabase. The support team is globally distributed with a strong focus on minimizing time to fix and works closely with the product engineering and growth teams.</p><p style=\"min-height:1.5em\"><strong>You will:</strong></p><ul style=\"min-height:1.5em\"><li><p style=\"min-height:1.5em\">Provide initial and timely responses to all support cases for a variety of topics, from billing or pre-sales requests to optimization or implementation questions.</p></li><li><p style=\"min-height:1.5em\">Triage support cases including directing users to previous answers, code examples, documentation, or escalating to specific technical or business team members.</p></li><li><p style=\"min-height:1.5em\">Monitor multiple feedback channels, e.g. Github Issues &amp; Discussions (check them here: <a target=\"_blank\" rel=\"noopener noreferrer nofollow\" href=\"https://github.com/supabase/supabase/issues\">https://github.com/supabase/supabase/issues</a>).</p></li><li><p style=\"min-height:1.5em\">Identify where internal tooling might be developed or obtained to improve support efficiency.</p></li><li><p style=\"min-height:1.5em\">Reproduce issues, create test cases and improve test coverage, if you have experience with testing.</p></li></ul><p style=\"min-height:1.5em\"><strong>You are:</strong></p><ul style=\"min-height:1.5em\"><li><p style=\"min-height:1.5em\">Experienced in customer support, with 3+ years of experience providing developer support to technical customers.</p></li><li><p style=\"min-height:1.5em\">Proficient in SQL (ideally PostgreSQL). You feel comfortable with complex SQL queries. If you have a database administration experience, it’s a plus.</p></li><li><p style=\"min-height:1.5em\">Excellent communication skills and fluency in English.</p></li><li><p style=\"min-height:1.5em\">Skilled in using Linux/Unix operating systems and the command line.</p></li><li><p style=\"min-height:1.5em\">Experienced working with GitHub Issues and Discussions.</p></li><li><p style=\"min-height:1.5em\">Bonus points if you're familiar with popular JavaScript frameworks like React, Vue, and Svelte and have some experience with Node.js.</p></li><li><p style=\"min-height:1.5em\">Bonus points if you're familiar with authorization and authentication.</p></li></ul><h3>Timezones &amp; Logistics</h3><ul style=\"min-height:1.5em\"><li><p style=\"min-height:1.5em\">It’s a full-time position covering workdays Monday to Friday during EMEA Hours: 08:00-18:00 UTC</p></li><li><p style=\"min-height:1.5em\">We are primarily looking for someone in Europe, Africa, or Middle Eastern time zones for this shift.</p></li></ul><h3>We offer</h3><ul style=\"min-height:1.5em\"><li><p style=\"min-height:1.5em\">100% remote work. No location-based adjustment to your salary.</p></li><li><p style=\"min-height:1.5em\">Autonomous work. We work collaboratively on projects, but you set your own pace.</p></li><li><p style=\"min-height:1.5em\">Health, Vision and Dental benefits. Supabase covers 100% of the cost for employees and 80% for dependents</p></li><li><p style=\"min-height:1.5em\">Tech Allowance for any office setup you need</p></li><li><p style=\"min-height:1.5em\">Annual Education Allowance</p></li><li><p style=\"min-height:1.5em\">Annually run off-sites.</p></li></ul><h2>About the team</h2><ul style=\"min-height:1.5em\"><li><p style=\"min-height:1.5em\">We're a startup. It's unstructured.</p></li><li><p style=\"min-height:1.5em\">Collectively founded more than 30 startups.</p></li><li><p style=\"min-height:1.5em\">Globally distributed team with more than 30 different nationalities.</p></li><li><p style=\"min-height:1.5em\">We deeply believe in <a target=\"_blank\" rel=\"noopener noreferrer nofollow\" href=\"https://supabase.com/blog/2022/03/25/should-i-open-source-my-company\">the efficacy of collaborative open source</a>. We support existing communities and tools, rather than building \"yet another xx\".</p></li><li><p style=\"min-height:1.5em\">We \"dogfood\" everything. If you use it in your project, we use it in Supabase.</p></li></ul><h2>Process</h2><ul style=\"min-height:1.5em\"><li><p style=\"min-height:1.5em\">The entire process is fully remote and all communication will happen over email or via video chat.</p></li><li><p style=\"min-height:1.5em\">Once you've submitted your application, the team will review your submission and may reach out for a short screening interview over a video call.</p></li><li><p style=\"min-height:1.5em\">If you pass the screen you will be invited to up to four follow-up interviews. </p></li><li><p style=\"min-height:1.5em\">The calls:</p><ul style=\"min-height:1.5em\"><li><p style=\"min-height:1.5em\">usually take between 20-45 minutes each depending on the interviewer.</p></li><li><p style=\"min-height:1.5em\">most of the time, are all 1:1.</p></li><li><p style=\"min-height:1.5em\">will be with the founders, a member of either the growth or engineering team (depending on the role) and usually one other person from your immediate team or function.</p></li></ul></li><li><p style=\"min-height:1.5em\">Once the interviews are over, the team will meet to discuss several roles and candidates and may:</p><ul style=\"min-height:1.5em\"><li><p style=\"min-height:1.5em\">ask one or two follow-up questions over email or a quick call.</p></li><li><p style=\"min-height:1.5em\">go directly to making an offer.</p></li></ul></li></ul>","tags":"[\"postgres\",\"javascript\",\"engineering\",\"database\"]","pubDate":"2025-01-15T16:40:55.708Z","link":"https://jobs.ashbyhq.com/supabase/b540328f-eaeb-45a8-a07c-c22125b8b1b6","slug":"support-engineer-emea-supabase-6738"},{"id":8259642706,"title":"Support Engineer [IC2]","company":"Sourcegraph","image":"https://avatars.githubusercontent.com/u/3979584?s=200&v=4","description":"&lt;div class=&quot;content-intro&quot;&gt;&lt;h2&gt;&lt;strong&gt;&lt;span style=&quot;color: #a112ff;&quot;&gt;Who we are&lt;/span&gt;&lt;/strong&gt;&lt;/h2&gt;\n&lt;p&gt;Our mission at Sourcegraph is to make it so that &lt;a href=&quot;https://www.notion.so/sourcegraph/Mission-values-e9d37e6b972a4ef395c3076aea2bd07d?pvs=4&quot;&gt;everyone can code&lt;/a&gt;, not just ~0.1% of the population.&amp;nbsp;&lt;/p&gt;\n&lt;p&gt;We are transforming how the world’s most important companies build software by industrializing development with AI. Today, most professional developers spend a disproportionate amount of time understanding code and performing repetitive, low-level tasks—leaving less time for innovation and meaningful impact.&lt;/p&gt;\n&lt;p&gt;We’re changing that. Sourcegraph brings AI-powered search and agents to the enterprise, helping teams automate the mundane and amplify what developers do best— solving hard problems and creating great products.&lt;/p&gt;\n&lt;p&gt;Here’s how we’re making a difference:&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;&lt;strong&gt;Accelerating developers &lt;/strong&gt;with AI agents that deliver insights and precision—enabling 5x faster test creation, 30% increase in merge requests, and saving 20 minutes per developer daily.&lt;/li&gt;\n&lt;li&gt;&lt;strong&gt;Automating repetitive tasks,&lt;/strong&gt; from remediating vulnerabilities (saving teams 1,000+ hours annually) to speeding up migrations that would take years to months.&amp;nbsp;&lt;/li&gt;\n&lt;li&gt;&lt;strong&gt;Enabling innovation&lt;/strong&gt; by addressing complex problems like automated bug triage, vulnerability detection, and AI-driven code reviews seamlessly integrated into workflows.&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;Trusted by 7/10 top software companies by market cap, 4/6 top US banks and many of the companies leading global innovation, like Stripe, Indeed, Tesla, and 1Password, and with $225M in funding from investors like &lt;a href=&quot;https://techcrunch.com/2021/07/13/sourcegraph-raises-125m-series-d-on-2-6b-valuation-for-universal-code-search-tool/&quot;&gt;a16z&lt;/a&gt;, &lt;a href=&quot;https://about.sourcegraph.com/blog/series-c-with-sequoia/&quot;&gt;Sequoia&lt;/a&gt;, and &lt;a href=&quot;https://www.redpoint.com/companies/sourcegraph/&quot;&gt;Redpoint&lt;/a&gt;, we are building the tools that will define the next era of enterprise software development.&lt;/p&gt;\n&lt;p&gt;If you’re passionate about solving the hardest problems in software and shaping the future of technology, join us. Let’s build something extraordinary together.&lt;/p&gt;&lt;/div&gt;&lt;h2&gt;&lt;span style=&quot;color: rgb(161, 18, 255);&quot;&gt;&lt;strong&gt;Working hours&lt;/strong&gt;&lt;/span&gt;&lt;/h2&gt;\n&lt;p&gt;🌎 While we are an all-remote company and hire &lt;a href=&quot;https://sourcegraph.notion.site/How-we-engage-talent-outside-of-the-US-218f7193695a46cbb1ef39ef9c1f72d4&quot;&gt;almost anywhere&lt;/a&gt; in the world, we have a preference for someone to reside in the following locations for this role. However, if you feel qualified, we welcome you to apply regardless of location. No matter what, the expected working hours for this position is 9:00am - 5:00pm Central Standard Time.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Preferred locations:&lt;/strong&gt;&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;North America: CST or MST required&lt;/li&gt;\n&lt;/ul&gt;\n&lt;h2&gt;&lt;span style=&quot;color: rgb(161, 18, 255);&quot;&gt;&lt;strong&gt;Why this job is exciting&lt;/strong&gt;&lt;/span&gt;&lt;/h2&gt;\n&lt;p&gt;As part of the Technical Success organization, Support Engineering (SE) is at the forefront of the customer experience. Our customers simply wouldn’t be successful, happy, long term customers without the important work this team does! SE exists to not only resolve technical issues but educate our customers by answering reactive questions, and by importantly identifying improvements we can make to help improve the product. Our customers are developers and we help them throughout their customer journey.&lt;/p&gt;\n&lt;p&gt;Within one month you will…&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;Learn about our product, our value propositions, our customers, our team, and our practices.&lt;/li&gt;\n&lt;li&gt;Learn how Code Search is deployed (e.g., Kubernetes, scaling, and more), product configuration and integrations, our code base, and common user needs.&lt;/li&gt;\n&lt;li&gt;Learn how Cody works, the problem it solves and how our customers use it day to day&lt;/li&gt;\n&lt;li&gt;Meet for an initial chat with the teammates you will work with most&lt;/li&gt;\n&lt;li&gt;Start working with customers to troubleshoot and solve reported issues (with lots of support and help from your team).&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;Within three months you will…&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;Work with customers to troubleshoot and solve reported issues&lt;/li&gt;\n&lt;li&gt;Contribute to improving our product and handbook documentation&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;Within six months you will…&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;Observe trends causing issues for our customers and suggest remedies (for example, what consistent things happen that we can write tooling for...)&lt;/li&gt;\n&lt;li&gt;Suggest (and take responsibility for) improvements for team onboarding and ongoing enablement, improving the customer experience, and/or improving the product&lt;/li&gt;\n&lt;/ul&gt;\n&lt;h2&gt;&lt;span style=&quot;color: rgb(161, 18, 255);&quot;&gt;&lt;strong&gt;About you&lt;/strong&gt;&lt;/span&gt;&lt;/h2&gt;\n&lt;p&gt;You are curious and compassionate. You are a problem solver - you love the moment where you “figure it out”. You enjoy trying new technologies, breaking them and helping fix them. You want to be part of a technical organization while talking with customers.&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;Profound curiosity to figure out why something works the way it does / to learn more&lt;/li&gt;\n&lt;li&gt;Experience with Unix/Linux and/or Bash&lt;/li&gt;\n&lt;li&gt;Familiarity with Kubernetes containerized solutions&lt;/li&gt;\n&lt;li&gt;Familiarity with code hosts such as GitHub, GitLab and BitBucket&lt;/li&gt;\n&lt;li&gt;Compassion to meet our customers (who are all developers themselves) where they are, understand their issues, and be compelled to action&lt;/li&gt;\n&lt;li&gt;Experience collaborating with cross-functional teams to solve difficult problems for customers&lt;/li&gt;\n&lt;li&gt;Proficiency in communicating complex technical ideas and decisions to a variety of audiences (both technical and non-technical)&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;Nice to have&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;Understanding of databases, especially SQL&amp;nbsp;&lt;/li&gt;\n&lt;li&gt;Proficiency in working independently, figuring things out when there aren’t a lot of people to ask real-time&lt;/li&gt;\n&lt;li&gt;Foundational knowledge of APIs and/or Git&lt;/li&gt;\n&lt;li&gt;Experience or training (formal or self-taught) with Kubernetes (or other container orchestration framework)&amp;nbsp;&lt;/li&gt;\n&lt;li&gt;Experience writing code in Go or another language&lt;/li&gt;\n&lt;li&gt;Experience supporting AI products or knowledge about LLMs&lt;/li&gt;\n&lt;/ul&gt;\n&lt;h2&gt;&lt;span style=&quot;color: rgb(161, 18, 255);&quot;&gt;&lt;strong&gt;Level&lt;/strong&gt;&lt;/span&gt;&lt;/h2&gt;\n&lt;p&gt;📊 This job is an IC2. You can read more about&amp;nbsp;&lt;a href=&quot;https://www.notion.so/sourcegraph/Leveling-Guide-0e1b5c76ada64b9caac387f8b7c4fc66?pvs=4&quot;&gt;our job leveling philosophy&lt;/a&gt; in our Handbook.&lt;/p&gt;\n&lt;h2&gt;&lt;span style=&quot;color: rgb(161, 18, 255);&quot;&gt;&lt;strong&gt;Compensation&lt;/strong&gt;&lt;/span&gt;&lt;/h2&gt;\n&lt;p&gt;&lt;strong&gt;💸 We pay you an above-average salary&lt;/strong&gt; because we want to hire the best people who are fully focused on helping Sourcegraph succeed, not worried about paying bills. As an &lt;a href=&quot;https://sourcegraph.notion.site/Mission-values-e9d37e6b972a4ef395c3076aea2bd07d&quot;&gt;open and transparent&lt;/a&gt; company that values &lt;a href=&quot;https://www.notion.so/sourcegraph/Compensation-Pay-Transparency-at-Sourcegraph-d58d0774f51b4b489d41c3628d30ff8d&quot;&gt;competitive compensation&lt;/a&gt;, our compensation ranges are visible to every single Sourcegraph teammate. Your salary is determined by your pay band for the IC2 job level. For determining pay bands, we use a number of market and data-driven salary sources, along with your location zone, and target the high-end of the range to ensure we’re always paying above market regardless of where you live in the world. Both U.S. and international locations are divided into one of four zones, determined by the cost of labor index for each area. The salary for a successful candidate will be based on level, job-related skills, experience, qualifications, and location zone. Please note that the salaries below may be adjusted in the future.&lt;/p&gt;\n&lt;p&gt;💰 The target compensation for this role is $84,800 USD&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;Zone 2: $84,800 USD&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;📈 In addition to our cash compensation, we offer equity (because when we succeed as a company, we want you to succeed, too) and generous &lt;a href=&quot;https://sourcegraph.notion.site/Benefits-Perks-dd1da4b6b3a64780abed010a144d34ba&quot;&gt;perks &amp;amp; benefits&lt;/a&gt;.&lt;/p&gt;\n&lt;h2&gt;&lt;span style=&quot;color: rgb(161, 18, 255);&quot;&gt;&lt;strong&gt;Interview process&lt;/strong&gt;&lt;/span&gt;&lt;/h2&gt;\n&lt;p&gt;&lt;em&gt;Below is the interview process you can expect for this role (you can read more about &lt;a href=&quot;https://sourcegraph.notion.site/Types-of-interviews-f279f080583d49ee9f2c60e30c8cb1f7&quot;&gt;the types of interviews&lt;/a&gt; in our Handbook). It may look like a lot of steps, but rest assured that we move quickly and the steps are designed to help you get the information needed to determine if we’re the right fit for you… Interviewing is a two-way street, after all!&amp;nbsp;&lt;/em&gt;&lt;/p&gt;\n&lt;p&gt;We expect the interview process to take 5 hours in total.&lt;/p&gt;\n&lt;p&gt;👋 Introduction Stage - we have initial conversations to get to know you better…&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;[30m] &lt;a href=&quot;https://www.notion.so/sourcegraph/Types-of-interviews-sample-questions-f279f080583d49ee9f2c60e30c8cb1f7?pvs=4#99be5ff628b2414194a0ba79d9f25f13&quot;&gt;Recruiter Screen&lt;/a&gt;&lt;/li&gt;\n&lt;li&gt;[60m] &lt;a href=&quot;https://www.notion.so/sourcegraph/Types-of-interviews-sample-questions-f279f080583d49ee9f2c60e30c8cb1f7?pvs=4#1919882c0cf147c487eb1df40db8a694&quot;&gt;Hiring Manager Screen&lt;/a&gt; / &lt;a href=&quot;https://www.notion.so/sourcegraph/Types-of-interviews-sample-questions-f279f080583d49ee9f2c60e30c8cb1f7?pvs=4#c678a2a86e0e47e4958507e869bf7ded&quot;&gt;Resume Deep Dive&lt;/a&gt;&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;🧑‍💻 Team Interview Stage - we then delve into your experience in more depth and introduce you to members of the team, including cross-functional partners…&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;[1.5hr] Async take-home project&lt;/li&gt;\n&lt;li&gt;[1hr] &lt;a href=&quot;https://sourcegraph.notion.site/Types-of-interviews-sample-questions-f279f080583d49ee9f2c60e30c8cb1f7#88b9f826dee04ef98afc2aeec35b877a&quot;&gt;Peer Interview&lt;/a&gt; - Review project and follow-up questions&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;🎉 Final Interview Stage - we move you to our final round, where you gain a better understanding of our business and values holistically…&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;[30m] &lt;a href=&quot;https://www.notion.so/sourcegraph/Types-of-interviews-sample-questions-f279f080583d49ee9f2c60e30c8cb1f7?pvs=4#e3a04291743048df87541a88aa8199dd&quot;&gt;Values&lt;/a&gt;&lt;/li&gt;\n&lt;li&gt;[30m] &lt;a href=&quot;https://www.notion.so/sourcegraph/How-to-work-with-Quinn-Slack-CEO-807673e0864d473f959cc4efd9642a5a?pvs=4#6f185c0e2011411eac5be9c675f9056c&quot;&gt;Leadership Interview&lt;/a&gt; with co-founder&lt;/li&gt;\n&lt;li&gt;We check references and conduct your background check&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;Please note - you are welcome to request additional conversations with anyone you would like to meet, but didn’t get to meet during the interview process.&lt;/p&gt;&lt;div class=&quot;content-conclusion&quot;&gt;&lt;h2&gt;&lt;strong&gt;&lt;span style=&quot;color: #a112ff;&quot;&gt;Learn more about us&lt;/span&gt;&lt;/strong&gt;&lt;/h2&gt;\n&lt;p&gt;You can learn more about what it is like to work at Sourcegraph by reading &lt;a href=&quot;https://sourcegraph.notion.site/d7614e3e9dc04c09ac2d42d57f1816e6?v=2a6d426dbae14390b155120b0c029ce0&quot;&gt;our handbook&lt;/a&gt;.&lt;/p&gt;\n&lt;p&gt;We are an ambitious team who are collectively working hard to build the most influential company in the world.&amp;nbsp; You can read more about our &lt;a href=&quot;https://sourcegraph.notion.site/What-it-s-like-working-at-Sourcegraph-119a8e11265880b18911eee4d9b7c460#119a8e1126588062b935fc66104b6115&quot;&gt;culture&lt;/a&gt;, &lt;a href=&quot;https://sourcegraph.notion.site/Compensation-Pay-Transparency-at-Sourcegraph-d58d0774f51b4b489d41c3628d30ff8d?pvs=74&quot;&gt;competitive compensation&lt;/a&gt; and &lt;a href=&quot;https://sourcegraph.notion.site/Benefits-Perks-dd1da4b6b3a64780abed010a144d34ba?pvs=74&quot;&gt;benefits&lt;/a&gt; here&lt;/p&gt;\n&lt;p&gt;Sourcegraph is an equal opportunity workplace; we welcome people from all backgrounds.&amp;nbsp;&lt;/p&gt;\n&lt;p&gt;&lt;em&gt;Sourcegraph participates in &lt;/em&gt;&lt;a href=&quot;https://sourcegraph.notion.site/E-Verify-2ab3286dde3446d6bac2898c83610107&quot;&gt;&lt;em&gt;E-Verify&lt;/em&gt;&lt;/a&gt;&lt;em&gt; for U.S. Employees. &lt;/em&gt;&lt;/p&gt;&lt;/div&gt;","tags":"[\"engineering\",\"database\"]","pubDate":"2025-01-15T16:03:58.000Z","link":"https://boards.greenhouse.io/sourcegraph91/jobs/5282491004","slug":"support-engineer-ic2-sourcegraph-9257"},{"id":1084364474,"title":" Tech Recruiter","company":"Ruby Labs","image":"https://media.licdn.com/dms/image/v2/D4D0BAQF7VVv61POIFw/company-logo_200_200/company-logo_200_200/0/1721937953426?e=1743033600&v=beta&t=_qAkZ_qGO7Du2NSUdHDNbUKIbz28Y1HDm1g9mwNIOnk","description":"<h1><strong>About us</strong></h1><p style=\"min-height:1.5em\">Ruby Labs is a leading tech company that creates and operates innovative consumer products. We offer a diverse range of opportunities across the health, education, and entertainment industries. Our innovative teams are driving the future of consumer-led products, and we're always looking for passionate individuals to join us. Learn more about our story at: <a target=\"_blank\" rel=\"noopener noreferrer nofollow\" href=\"https://rubylabs.com/about-us/\">https://rubylabs.com/about-us/</a></p><p style=\"min-height:1.5em\"></p><h1><strong>About the role</strong></h1><p style=\"min-height:1.5em\">Join Ruby Labs as a <strong>Community Recruiter</strong> and play a key role in shaping our rapidly expanding team! You will be a vital partner in recruitment, working closely with hiring managers across product, marketing, and engineering to attract top talent from diverse backgrounds. This is a fantastic opportunity for someone with a passion for building relationships within tech communities and sourcing high-quality candidates through platforms like Discord, Reddit, GitHub, and other niche networks. If you’re creative, proactive, and excited about recruitment in the tech space, this role is for you!</p><p style=\"min-height:1.5em\"></p><h1><strong>Key Responsibilities</strong></h1><ul style=\"min-height:1.5em\"><li><p style=\"min-height:1.5em\"><strong>Source Candidates through Tech Communities:</strong> Utilize platforms such as <strong>Discord</strong>, <strong>GitHub</strong>, <strong>Reddit</strong>, and other tech-focused networks to identify and engage high-potential candidates. Build relationships within these communities to create a talent pipeline and foster Ruby Labs’ brand as a top employer in the tech space.</p></li><li><p style=\"min-height:1.5em\"><strong>Lead End-to-End Recruitment:</strong> Manage the full recruitment cycle, from sourcing and screening resumes to interviews, pipeline management, and ensuring a seamless and positive candidate experience.</p></li><li><p style=\"min-height:1.5em\"><strong>Expand Ruby Labs’ Presence in Tech Communities:</strong> Be proactive in enhancing Ruby Labs’ presence in niche communities on <strong>Discord</strong>, <strong>GitHub</strong>, and other relevant platforms. Engage with active and passive candidates, promote our employer brand, and establish Ruby Labs as a leading choice for tech talent.</p></li><li><p style=\"min-height:1.5em\"><strong>Optimize ATS Workflows:</strong> Manage and optimize our Applicant Tracking System (ATS) to ensure efficient and accurate tracking of candidate progress through platforms such as <strong>Greenhouse</strong>, <strong>Lever</strong>, <strong>Ashby</strong>, or others.</p></li><li><p style=\"min-height:1.5em\"><strong>Provide Feedback to Candidates:</strong> Communicate promptly with candidates, offering constructive feedback and ensuring a positive and professional recruitment experience.</p></li><li><p style=\"min-height:1.5em\"><strong>Collaborate with Hiring Managers:</strong> Build strong relationships with hiring managers across departments, understanding their recruitment needs and customizing strategies to meet those needs effectively.</p></li></ul><h1><strong>Qualifications</strong></h1><ul style=\"min-height:1.5em\"><li><p style=\"min-height:1.5em\"><strong>Tech Community Experience:</strong> Proficient in sourcing candidates from <strong>niche tech communities</strong> (such as <strong>Discord</strong>, <strong>GitHub</strong>, <strong>Reddit</strong>), with a deep understanding of how to engage with tech talent in these spaces.</p></li><li><p style=\"min-height:1.5em\"><strong>Experience:</strong> 2-3 years in talent acquisition, ideally within a tech-focused environment.</p></li><li><p style=\"min-height:1.5em\"><strong>ATS Proficiency:</strong> Experience with <strong>ATS platforms</strong> like <strong>Greenhouse</strong>, <strong>Lever</strong>, <strong>Ashby</strong>, etc., and able to optimize recruitment workflows effectively.</p></li><li><p style=\"min-height:1.5em\"><strong>Organizational Skills:</strong> Strong project management and organizational skills to handle multiple requisitions and recruitment tasks simultaneously.</p></li><li><p style=\"min-height:1.5em\"><strong>Communication Skills:</strong> Excellent written and verbal communication skills in English, with the ability to build relationships and provide constructive feedback to candidates and stakeholders.</p></li><li><p style=\"min-height:1.5em\"><strong>Independent &amp; Collaborative:</strong> Ability to work autonomously, as well as collaborate effectively within a team-driven, dynamic environment.</p></li><li><p style=\"min-height:1.5em\"><strong>Passion for Talent Acquisition:</strong> You are enthusiastic about connecting with candidates and fostering positive relationships, with a keen eye for detail and a commitment to delivering an outstanding candidate experience.</p></li></ul><h1></h1><h1><strong>Location</strong></h1><p style=\"min-height:1.5em\">Ruby Labs operates within the CET (Central European Time) zone. Applicants from any country are welcome to apply for the position as long as they are located within approximately ± 4 hours of CET. This ensures optimal collaboration and communication during working hours.</p><p style=\"min-height:1.5em\"></p><h1><strong>Benefits</strong></h1><p style=\"min-height:1.5em\">Discover the perks of being part of our vibrant team! We offer:</p><ul style=\"min-height:1.5em\"><li><p style=\"min-height:1.5em\"><strong>Remote Work Environment:</strong> Embrace the freedom to work from anywhere, anytime, promoting a healthy work-life balance. 🏡⏰</p></li><li><p style=\"min-height:1.5em\"><strong>Unlimited PTO:</strong> Enjoy unlimited paid time off to recharge and prioritize your well-being, without counting days. 🌴💼</p></li><li><p style=\"min-height:1.5em\"><strong>Paid National Holidays:</strong> Celebrate and relax on national holidays with paid time off to unwind and recharge. 🎉🌟</p></li><li><p style=\"min-height:1.5em\"><strong>Company-provided MacBook:</strong> Experience seamless productivity with top-notch Apple MacBooks provided to all employees who need them. 💻🚀</p></li><li><p style=\"min-height:1.5em\"><strong>Flexible Independent Contractor Agreement:</strong> Unlock the benefits of flexibility, autonomy, and entrepreneurial opportunities. Benefit from tax advantages, networking opportunities, reduced employment obligations, and the freedom to work from anywhere. Read more about it here: <a target=\"_blank\" rel=\"noopener noreferrer nofollow\" href=\"https://docs.google.com/document/d/1dHF4ctKlez75whdn-ybUwP5d5Wr0BdwVrorrm_fM40Q/preview\">https://docs.google.com/document/d/1dHF4ctKlez75whdn-ybUwP5d5Wr0BdwVrorrm_fM40Q/preview</a> 📈💼</p></li></ul><p style=\"min-height:1.5em\">Be part of our fast-growing team and seize this excellent opportunity for personal and professional growth!</p><p style=\"min-height:1.5em\"></p><h1><strong>Interview Process</strong></h1><p style=\"min-height:1.5em\">After submitting your application, we conduct a thorough review which typically takes 3 to 5 days, but may occasionally take longer due to the volume of applications received. If we see a potential fit, we proceed with the following steps:</p><ul style=\"min-height:1.5em\"><li><p style=\"min-height:1.5em\">Recruiter Screening (40 minutes)</p></li><li><p style=\"min-height:1.5em\">Technical Interview (60 minutes)</p></li><li><p style=\"min-height:1.5em\">Final Interview (60 minutes)</p></li></ul><p style=\"min-height:1.5em\"></p><h1><strong>Life at Ruby Labs</strong></h1><p style=\"min-height:1.5em\">At Ruby Labs, we are more than a team; we're a community united in pushing the boundaries of technology and innovation. Our combined passion fuels our ambition for excellence, driving impact that resonates around the globe.</p><p style=\"min-height:1.5em\">We are an equal-opportunity employer and celebrate diversity, recognizing that a diversity of thought and backgrounds builds stronger teams. We approach diversity and inclusion seriously and thoughtfully. We do not discriminate based on race, ethnicity, religion, color, place of birth, sex, gender identity or expression, sexual orientation, age, marital status, military service status, or disability status. Join us and be part of a company that is crafting the future of technology across multiple industries.</p><p style=\"min-height:1.5em\"></p><p style=\"min-height:1.5em\">#Li-Remote</p>","tags":"[\"management\",\"engineering\"]","pubDate":"2025-01-15T09:15:25.092Z","link":"https://jobs.ashbyhq.com/ruby-labs/28a90507-58fb-4ec6-9c27-a7afb1733c1c","slug":"tech-recruiter-ruby-labs-2430"},{"id":5470236327,"title":"Quality Assurance / Testing Manager","company":"Shardeum Foundation","image":"https://remotive.com/job/1962282/logo","description":"<div class='\"content-intro\"'><p><strong>About the Company</strong>: </p>\n<p><span style='\"font-weight:'>Shardeum is building a layer 1, EVM-based, linearly scalable, smart contract platform that provides low gas fees forever while maintaining true decentralization and solid security through dynamic state sharding. Shardeum aims to be a chain capable of onboarding over a billion people to the crypto revolution, while also democratizing accessibility to decentralization.</span></p>\n<p><span style='\"font-weight:'>Shardeum’s mission is supported by prominent Venture Capitalists in the blockchain space, and we are on track to become one of the most widely used and well known smart contract platforms in blockchain history.</span><span style='\"font-weight:'><br></span><span style='\"font-weight:'><br></span><span style='\"font-weight:'>We encourage you to browse our <a href=\"%22https://shardeum.org/%22\" rel=\"nofollow\" target='\"_blank\"'>website</a>, <a href=\"%22https://shardeum.org/Shardeum_Whitepaper.pdf%22\" rel=\"nofollow\">Whitepaper</a>, <a href=\"%22https://discord.com/invite/shardeum%22\" rel=\"nofollow\" target='\"_blank\"'>Discord</a> and <a href=\"%22https://www.youtube.com/c/Shardeum%22\" rel=\"nofollow\" target='\"_blank\"'>YouTube channel</a> to learn more about the project. You can even try <a href=\"%22https://docs.shardeum.org/node/run/validator%22\" rel=\"nofollow\" target='\"_blank\"'>downloading our validator software</a> and joining our Testnet.</span></p>\n<p><span style='\"font-weight:'>We encourage people of all backgrounds to apply. Your talent and potential is what matters most to us. Shardeum is committed to creating an inclusive culture.</span></p></div><p><strong>About The Role:</strong></p>\n<p>The Engineering team at Shardeum is responsible for delivering the Shardeum Mainnet, and developing the smart contract platform, the consensus layer and the protocol layer. We focus on building scalable, performant, secure and reliable software that can be downloaded by thousands of node operators to actualize the Shardeum network.</p>\n<p>In this position, you’ll have the opportunity to share and cultivate your ideas while innovating to enhance testing methodologies and various components of the Shardeum platform.  We tackle unique challenges that are yet to be addressed, making this role both exciting and rewarding. If you're eager to contribute to a project that holds significance in the global Web3 landscape, check out the details below:</p>\n<p><strong>What You'll Be Doing:</strong></p>\n<ul style=\"\">\n<li style=\"\">Own and manage the entire QA function and team, consisting of QA Testers and automation engineers.</li>\n<li style=\"\">Develop and implement comprehensive QA strategies to ensure the quality of Shardeum’s decentralized platform.</li>\n<li style=\"\">Design, develop, and maintain automated testing frameworks and suites.</li>\n<li style=\"\">Conduct manual testing as needed, including: white box, integration, system and regression testing.</li>\n<li style=\"\">Collaborate closely with development teams to integrate testing into the development workflow.</li>\n<li style=\"\">Identify, document, and track bugs and issues until they are resolved.</li>\n<li style=\"\">Perform regular reviews and audits of QA processes and standards.</li>\n<li style=\"\">Participate in daily and weekly stand-ups, sprint planning and retrospectives with cross-functional teams, including development, product management, and operations, to maintain quality throughout the software development lifecycle.</li>\n<li style=\"\">Stay updated on the latest industry trends and technologies to keep Shardeum’s QA practices at the forefront.</li>\n</ul>\n<p><strong>What We're Looking For:</strong></p>\n<ul style=\"\">\n<li style=\"\">10+ years of experience in Quality Assurance, including 3+ years in a managerial role.</li>\n<li style=\"\">Extensive knowledge of QA methodologies, tools, and processes.</li>\n<li style=\"\">Proficiency in creating and managing automated test scripts using automation tools.</li>\n<li style=\"\">Extensive experience with manual testing, and meticulous in ensuring comprehensive feature coverage.</li>\n<li style=\"\">You excel in problem-solving and debugging.</li>\n<li style=\"\">Experienced in Agile/Scrum methodologies.</li>\n<li style=\"\">A solid understanding of the software development lifecycle and the role of QA within it.</li>\n<li style=\"\">You demonstrate strong leadership, ownership and management skills.</li>\n<li style=\"\">Strong communication skills - both verbal and written.</li>\n</ul>\n<p><strong>We'd Love If You Have:</strong></p>\n<ul style=\"\">\n<li style=\"\">Experience in the blockchain or decentralized applications space.</li>\n<li style=\"\">You possess experience in programming languages like Node.js, Typescript or Rust.</li>\n<li style=\"\">You’ve made contributions to open-source projects in the areas of QA and/or testing.</li>\n<li style=\"\">You have a strong interest in Blockchain, Web3, AI, or Distributed Networks.</li>\n<li style=\"\">Experience with consensus protocols and other blockchains</li>\n<li style=\"\">Experience running a node in a blockchain network</li>\n<li style=\"\">Familiarity with the<a href=\"%22https://gitlab.com/shardeum/server%22\" rel=\"nofollow\"> Shardeum</a> open source repos </li>\n<li style=\"\">Read the Bitcoin and Ethereum whitepapers</li>\n</ul><div class='\"content-conclusion\"'><div class='\"styles_description__uLHQ_\"'>\n<p><em>We are building the infrastructure for Web 3.0. It's going to be a rollercoaster ride but promises to be fun.</em></p>\n</div></div><img src=\"https://remotive.com/job/track/1962282/blank.gif?source=public_api\" alt=\"\"/>","tags":"[\"C\",\"crypto\",\"excel\",\"node.js\",\"scrum\",\"security\",\"open source\",\"blockchain\",\"AI/ML\",\"agile\",\"automation\",\"rust\",\"product management\",\"Ethereum\",\"youtube\",\"Typescript \",\"bitcoin\",\"onboarding\",\"mainnet\",\"SOLID\",\"debugging\",\"manual testing\",\"testing\",\"infrastructure\"]","pubDate":"2025-01-15T01:51:06.000Z","link":"https://remotive.com/remote-jobs/qa/quality-assurance-testing-manager-1962282","slug":"quality-assurance-testing-manager-shardeum-foundation-5646"},{"id":6672547098,"title":"Executive Producer","company":"Mozilla","image":"https://remotive.com/job/1963425/logo","description":"<p><a href=\"%22https:/foundation.mozilla.org/en/%22\" rel=\"nofollow\">The Mozilla Foundation</a> is a nonprofit public benefit organization. Our mission is to ensure that the Internet is a global public resource, open and accessible to all. Join us and become part of our mission to promote openness, innovation, and opportunity online!</p>\n<p><strong>Team Summary: </strong></p>\n<p>The Mozilla Strategic Communications team is responsible for leading the Foundation’s conversation with the wider world. We ensure Mozilla is always speaking with a consistent, compelling voice that meets the moment. We serve as a trusted internal periscope into the audiences, channels, trends, and products relevant to Mozilla’s programs, mission and values – and generate appealing, inclusive, evergreen dialogues that build a global community of support for and engagement with the foundation.</p>\n<p><strong>Position Summary:</strong> </p>\n<p>The Executive Producer will be a multi-faceted creative strategist supporting the foundation in the design, launch, and efficient operations of an in-house content studio, with a focus on concept development, copywriting, editing, community building and management. Their brief is to deliver high end, innovative and impactful editorial projects keyed to trends, products, and audiences that align with the Foundation’s mission. Among other things they will dream up, the Executive Producer will reimagine Privacy Not Included, the award-winning product review website, as well as commission and launch narrative and nonfiction storytelling in text, photo, and video form. </p>\n<p>Mozilla is looking for a versatile, fluid team leader, ideally with deep tech and business-writing expertise. As a writer and producer, they are creative, resourceful, and curious. As an editor, they are scrupulous and quick. As an advisor to executives and junior staff, they are sensitive, communicative, and digitally native -- and not afraid to ask ‘why’ enough times to get the message right. This role offers a seasoned editorial leader the chance to design and lead an influential in-house digital magazine—all while working in a highly collaborative, fast-paced environment that’s both flexible and supportive. </p>\n<div class=\"h2\"><strong>As an Executive Producer at Mozilla Foundation, you will work on…</strong></div>\n<p><strong>Editorial Programming</strong> - 30 % of time</p>\n<ul style=\"\">\n<li style=\"\">With the VP of Strategic Communications and other internal stakeholders, establish the volume and structure of editorial outputs and target metrics for success.</li>\n<li style=\"\">Work with internal teams to build storylines, sharpen messages, and turn quantitative analysis into crisp, digestible narratives.</li>\n<li style=\"\">Develop and maintain an editorial content calendar, informed by organizational key dates and milestones. Define repeatable and scalable formats for Foundation dialogue with key audiences. </li>\n<li style=\"\">WIth the brand communications team, refine and project the Foundation point of view, seeking opportunities to extend editorial strategy into live events, partnerships, and alternative media formats.</li>\n</ul>\n<p><strong>Editorial production</strong> - 50% of time</p>\n<ul style=\"\">\n<li style=\"\">Produce, edit and commission as needed a pipeline of short and long-form content through outlining, drafting, revising, approvals, production, and launch, independently managing relevant freelance/agency resources.</li>\n<li style=\"\">Collaborate with communications, marketing, production and design colleagues to create social media assets, video scripts and other multimedia content. </li>\n<li style=\"\">Own the end to end creative process to ensure that all in house projects are delivered on time, on budget, with the most efficient workflow and allocation of resources.</li>\n<li style=\"\">Develop and enforce the Foundation’s voice as well as adhering to quality, risk, and style guidelines. </li>\n</ul>\n<p><strong>Team Leadership </strong>- 20% of time</p>\n<ul style=\"\">\n<li style=\"\">Managing junior marketing and production colleagues as part of their and your career development.</li>\n</ul>\n<div class=\"h2\"><strong>Qualifications</strong></div>\n<ul style=\"\">\n<li style=\"\">10+ years of professional writing and editing experience, including digital publishing, preferably for a tech or business publication.</li>\n</ul>\n<div class=\"h2\"><strong>Competencies</strong></div>\n<ul style=\"\">\n<li style=\"\">Exceptional editorial skills including experience creating and editing blogs, articles, podcasts, social media copy, executive talking points, brand messaging or similar for a business and consumer audience.</li>\n<li style=\"\">Proficiency and fluency in verbal and written English, with other language skills a plus.</li>\n<li style=\"\">Data, economics and business literacy, with ability to rapidly absorb complex ideas and distill them into accessible copy for global audiences </li>\n<li style=\"\">Strong news judgment and broad understanding of current events and trends in economics, business, policy, and technology. </li>\n<li style=\"\">Excellent communication skills (oral, written, presentation)</li>\n</ul>\n<div class=\"h2\"><strong>Salary and Benefits Information:</strong></div>\n<p>The Mozilla Foundation is dedicated to fair and equitable compensation for our staff. We aim to pay a competitive and market-based salary based on the responsibilities and requirements of the role. <strong>We do not ask for, or take into account, salary histories in our offer process.</strong></p>\n<p>The starting salary ranges for this role are listed below. </p>\n<ul style=\"\">\n<li style=\"\">Canada: [$174,960 - $196,611] [target salary offer - $180,427]</li>\n<li style=\"\">US: [$129,600 - $145,638] [target salary offer - $133,650]</li>\n<li style=\"\">UK:[ £83,980.80-£94,373.42 ] [target salary offer - £86,605.20]</li>\n<li style=\"\">Germany, Belgium, Ireland, Italy: [ €91,572.20-€102,851.53 ] [target salary offer - €94,385.45]</li>\n<li style=\"\">Kenya: [ Ksh12,869,280.00-Ksh14,461,853.40 ] [target salary offer - Ksh13,271,445.00]</li>\n<li style=\"\">South Africa: [ R1,732,104.00-R1,946,451.87 ] [target salary offer - R1,786,232.25]</li>\n<li style=\"\">Zimbabwe: [ $31,298,400-$35,171,577 ] [target salary offer - $32,276,475]</li>\n</ul>\n<p>Some regions fall into a higher salary market and this is reflected in the example ranges below: </p>\n<ul style=\"\">\n<li style=\"\">New York and San Francisco :  [$162,000.00 - $182,047.50] [target salary offer - $167,062.50]</li>\n<li style=\"\">London [ £104,976.00-£117,966.78 ] [target salary offer - £108,256.50]</li>\n</ul>\n<p>The range for your specific location will be discussed in screening conversations if your application is successful.</p>\n<div class=\"h3\"><strong>We offer the following benefits:</strong></div>\n<ul style=\"\">\n<li style=\"\">Private Medical Insurance</li>\n<li style=\"\">Extended Sick Leave</li>\n<li style=\"\">Global Employee Assistance Program (EAP)</li>\n<li style=\"\">Retirement Plan contributions</li>\n<li style=\"\">Paid Time Off: 20 days annual leave + sick days and your birthday  </li>\n<li style=\"\">Company Holidays + Shutdown</li>\n<li style=\"\">Wellness budget</li>\n<li style=\"\">Professional Development budget</li>\n<li style=\"\">Top up program for Pregnancy and Parental leaves</li>\n</ul>\n<p>Benefits are subject to change at any time at the discretion of Mozilla Foundation.</p>\n<div class=\"h2\"><strong>Mozilla Foundation Hiring Practices:</strong></div>\n<p>Mozilla understands that valuing diverse creative practices and forms of knowledge are crucial to and enrich the company’s core mission. We encourage applications from everyone, including members of all equity-seeking communities, such as (but certainly not limited to) women, racialized and Indigenous persons, persons with disabilities, and persons of all sexual orientations and gender identities and expressions.</p>\n<p>We are an equal opportunity employer and value diversity. We do not discriminate on the basis of race, religion, color, national origin, gender, sexual orientation, age, marital status, veteran status, or disability status.</p>\n<p>We will ensure that individuals with disabilities are provided reasonable accommodation to participate in the job application or interview process, to perform essential job functions, and to receive other benefits and privileges of employment. Please contact us to request accommodation at <a href=\"%22mailto:accommodation@mozillafoundation.org%22\" rel=\"nofollow\">accommodation@mozillafoundation.org</a>.</p>\n<p>Group: C</p>\n<p>#LI-REMOTE</p>\n<p> </p>\n<img src=\"https://remotive.com/job/track/1963425/blank.gif?source=public_api\" alt=\"\"/>","tags":"[\"content strategy\",\"editing\"]","pubDate":"2025-01-14T21:51:00.000Z","link":"https://remotive.com/remote-jobs/all-others/executive-producer-1963425","slug":"executive-producer-mozilla-8420"}]