[{"id":8202604178,"title":"Lead User Researcher ","company":"Atticus","image":"https://media.licdn.com/dms/image/v2/D560BAQHWkZ4dfdnqcQ/company-logo_200_200/company-logo_200_200/0/1667241664749/atticushq_logo?e=1743033600&v=beta&t=IKimC8hb4UT-bQFVefDOJ5jfW_yxRN7of8ZLj5GtZ4Q","description":"<h2><strong>About Atticus</strong></h2><p style=\"min-height:1.5em\">At any given time, 16 million Americans are experiencing a crisis that requires urgent help from our legal system or government. The right assistance could transform their lives. But today, most never get it. Atticus makes it easy for any sick or injured person in crisis to get the life-changing aid they deserve. In just five years, we’ve become the leading platform connecting people with disabilities to government benefits. We also help victims of accidents, misconduct, and violence get compensation from insurance. So far, we’ve gotten thousands of people access to over $2B in life-changing aid (see our <a target=\"_blank\" rel=\"noopener noreferrer nofollow\" href=\"https://www.trustpilot.com/review/atticus.com\"><u>12,000+ five-star reviews</u></a>), and we’re just getting started.</p><p style=\"min-height:1.5em\">We’ve raised more than $50 million from top VC firms like Forerunner, GV (Google Ventures), and True Ventures. We're small but moving fast — our team grew from 89 to 151 last year and we expect to grow again in 2025.<br /></p><p style=\"min-height:1.5em\"></p><h2><strong>The Job</strong></h2><p style=\"min-height:1.5em\">To successfully help Americans in crisis, we need to understand two audiences: 1) our clients trying to navigate a complex and scary system, and 2) our lawyers and internal teams working to provide best-in-class service. We've so far built experiences that clients love, but we need to scale these experiences to serve millions of people.</p><p style=\"min-height:1.5em\">As our Lead User Researcher, you'll build a function at Atticus to deepen our understanding across all user journeys. You'll establish and champion our research practice, using sophisticated mixed-methods expertise to directly influence product decisions and business outcomes. Working independently and with minimal supervision, you'll create the systems and processes that help us systematically understand user needs and validate solutions at scale.</p><p style=\"min-height:1.5em\">Your leadership will transform how the entire organization connects with our users, ensuring that as we grow, we maintain the human touch that makes Atticus special. This is a unique opportunity to shape how a fast-growing company thinks about and uses research to drive better outcomes for people in need.<br /></p><p style=\"min-height:1.5em\"></p><h2><strong>Responsibilities</strong></h2><ul style=\"min-height:1.5em\"><li><p style=\"min-height:1.5em\">Own and lead research initiatives across the entire organization</p></li><li><p style=\"min-height:1.5em\">Establish and manage our comprehensive research practice and repository</p></li><li><p style=\"min-height:1.5em\">Plan and execute mixed-method research for cross-functional stakeholders</p></li><li><p style=\"min-height:1.5em\">Build process for regular user feedback collection and synthesis</p></li><li><p style=\"min-height:1.5em\">Develop framework for measuring and tracking UX improvements</p></li><li><p style=\"min-height:1.5em\">Translate research insights into actionable recommendations that influence product roadmaps</p></li><li><p style=\"min-height:1.5em\">Work independently with minimal supervision, leading research initiatives from conception to implementation</p></li></ul><h2><br /><strong>Required Qualifications</strong></h2><ul style=\"min-height:1.5em\"><li><p style=\"min-height:1.5em\">5+ years experience planning, conducting, and synthesizing research</p></li><li><p style=\"min-height:1.5em\">Proven track record of implementing and scaling research practices within organizations</p></li><li><p style=\"min-height:1.5em\">Strong expertise in both qualitative and quantitative research methodologies</p></li><li><p style=\"min-height:1.5em\">Experience working as a primary/solo researcher with minimal supervision</p></li><li><p style=\"min-height:1.5em\">Proficiency with research tools such as <a target=\"_blank\" rel=\"noopener noreferrer nofollow\" href=\"http://UserInterviews.com\">UserInterviews.com</a>, <a target=\"_blank\" rel=\"noopener noreferrer nofollow\" href=\"http://Maze.co\">Maze.co</a>, <a target=\"_blank\" rel=\"noopener noreferrer nofollow\" href=\"http://UserTesting.com\">UserTesting.com</a>, Lookback, Looker, and Qualtrics</p></li><li><p style=\"min-height:1.5em\">Portfolio of high-impact research that directly influenced a product roadmap</p></li><li><p style=\"min-height:1.5em\">Excellent written and verbal communication skills</p></li><li><p style=\"min-height:1.5em\">Bonus: Early-stage startup experience - complex consumer business, two-sided marketplace, and/or B2B product</p></li></ul><h2><br /><strong>Salary and Benefits</strong></h2><p style=\"min-height:1.5em\">This is a rare opportunity to join a startup that has strong traction (substantial funding, well-respected backers, tremendous growth, and many happy customers) but is still small enough that you can have a huge impact and play a role in shaping our culture. We’re a certified B Corporation tackling a critical social problem. Our mission to help people in need drives everything we do, and your work here will touch many lives.<br /></p><p style=\"min-height:1.5em\">We offer competitive pay — including equity — and generous benefits:</p><ul style=\"min-height:1.5em\"><li><p style=\"min-height:1.5em\">Medical and dental insurance with 100% of employee premiums covered</p></li><li><p style=\"min-height:1.5em\">15 vacation days &amp; 16 paid holidays each year</p></li><li><p style=\"min-height:1.5em\">Free membership to OneMedical</p></li><li><p style=\"min-height:1.5em\">$1,000/year reimbursable stipend for education and training outside of work</p></li><li><p style=\"min-height:1.5em\">$600/year stipend for internet service</p></li><li><p style=\"min-height:1.5em\">Up to $1,200/year student loan repayment assistance</p></li><li><p style=\"min-height:1.5em\">401(k) and optional HSA</p></li><li><p style=\"min-height:1.5em\">Free snacks, drinks, weekly lunches, and regular team dinners/events/retreats</p></li><li><p style=\"min-height:1.5em\">Humble, thoughtful, smart, fun colleagues</p></li></ul><h2><br /><strong>Location</strong></h2><p style=\"min-height:1.5em\">This job is fully remote and we're committed to empowering everyone with flexibility. Live wherever, work remotely, and travel to LA (on the company dime) as needed to be with your colleagues —somewhere between quarterly and yearly. We care a lot about building a great culture and we think some interactions need to happen in person, so we put a lot of thought into retreats, offsites, and other ways to gather.</p><p style=\"min-height:1.5em\">We are strongly committed to building a diverse team. If you're from a background that's underrepresented in tech, we'd particularly love to meet you.</p>","tags":"[\"b2b\",\"legal\"]","pubDate":"2025-03-28T04:13:10.565Z","link":"https://jobs.ashbyhq.com/atticus/c1d34132-762d-4156-a5f3-451d8fae18f1","slug":"lead-user-researcher-atticus-2425"},{"id":8105076096,"title":"Senior Product Manager - AI Solutions","company":"Zingtree","image":"https://avatars.githubusercontent.com/u/63677130?s=200&v=4","description":"<div>Zingtree is the next gen, intelligent process automation platform that reimagines customer experience operations for top Customer Support leaders. With over 500 customers, including global enterprises like Optum, Corpay, Sony, SharkNinja and Allianz, Zingtree transforms self-service, uncovers and implements automation opportunities, and makes every customer service agent an expert.</div><div><br></div><div>We are looking for a dynamic and experienced <b>Senior Product Manager</b> to drive the growth and innovation of our AI-powered process automation solutions. In this role, you will be responsible for expanding and enhancing our product portfolio, developing new AI-driven solutions that maximize customer value, and optimizing our existing offerings. Your work will directly contribute to delivering exceptional user experiences and measurable ROI for our customers. You’ll play a key role in identifying opportunities by deeply understanding our customers, prospects, and partners. This means analyzing market trends, assessing competitive dynamics, and leveraging AI advancements to shape Zingtree’s product strategy.</div><div><br></div><div>Success in this role requires strong interpersonal skills, a deep understanding of AI technologies, and experience in customer support, call centers, or process automation. You should be comfortable navigating a fast-paced, data-driven environment where strategic decision-making is backed by market insights and analytics.</div><div><br></div><div>If you’re passionate about AI, process automation, and building cutting-edge products that transform the way businesses operate, we’d love to hear from you!</div><div>Zingtree is the next gen, intelligent process automation platform that reimagines customer experience operations for top Customer Support leaders. With over 500 customers, including global enterprises like Optum, Corpay, Sony, SharkNinja and Allianz, Zingtree transforms self-service, uncovers and implements automation opportunities, and makes every customer service agent an expert.</div><div><br></div><div>We are looking for a dynamic and experienced <b>Senior Product Manager</b> to drive the growth and innovation of our AI-powered process automation solutions. In this role, you will be responsible for expanding and enhancing our product portfolio, developing new AI-driven solutions that maximize customer value, and optimizing our existing offerings. Your work will directly contribute to delivering exceptional user experiences and measurable ROI for our customers. You’ll play a key role in identifying opportunities by deeply understanding our customers, prospects, and partners. This means analyzing market trends, assessing competitive dynamics, and leveraging AI advancements to shape Zingtree’s product strategy.</div><div><br></div><div>Success in this role requires strong interpersonal skills, a deep understanding of AI technologies, and experience in customer support, call centers, or process automation. You should be comfortable navigating a fast-paced, data-driven environment where strategic decision-making is backed by market insights and analytics.</div><div><br></div><div>If you’re passionate about AI, process automation, and building cutting-edge products that transform the way businesses operate, we’d love to hear from you!</div><h3>What You'll Do</h3><li><b>Innovate and Build:</b> Play a key role in designing and developing new products and features that go beyond customer expectations, ensuring they deliver real value and a seamless user experience.</li><li><b>Collaborate with Engineering:</b> Work closely with the Engineering team to bring innovative products to market, optimize existing features, and ensure smooth integration of enhancements.</li><li><b>Understand Our Customers:</b> Deeply analyze Zingtree’s customer base, their needs, pain points, and behaviors to drive product decisions and strategic growth.</li><li><b>Develop Strategic Business Plans:</b> Identify and evaluate new opportunities, crafting data-driven business plans that align with market needs and company objectives.</li><li><b>Engage Cross-Functionally:</b> Work effectively with diverse teams—including sales, marketing, engineering, and customer success—to align goals and drive initiatives forward.</li><li><b>Gather and Apply Stakeholder Feedback:</b> Actively listen to customers, partners, and internal teams to refine products and ensure we’re meeting market demands.</li><li><b>Stay Ahead of AI Trends:</b> Keep up with the latest advancements in AI technology, identifying opportunities to incorporate cutting-edge innovations into our products.</li><li><b>Monitor Market and Competition:</b> Continuously assess the competitive landscape, industry trends, and key market shifts to inform strategic decisions.</li><li><b>Make Data-Driven Decisions:</b> Leverage data, analytics, and research to validate assumptions, optimize performance, and guide critical business strategies.</li><h3>Who You Are</h3><li><b>Experience &amp; Expertise:</b> 5+ years in roles such as Product Manager or Technical Product Manager, with a strong track record of driving product success.</li><li><b>AI Enablement &amp; Innovation:</b> Proven experience in leveraging AI capabilities, coordinating data flows, optimizing business processes, managing workflows, and integrating systems to enhance product functionality.</li><li><b>Technical Execution &amp; Collaboration:</b> Demonstrated ability to work closely with engineering teams to execute product roadmaps, ensuring seamless development and delivery.</li><li><b>B2B Product Success:</b> A history of developing, launching, and scaling successful B2B products, particularly in SaaS and enterprise environments.</li><li><b>AI &amp; Machine Learning Knowledge:</b> Strong understanding of AI technologies, including Large Language Models (LLMs), AI Agents, and modern machine learning techniques.</li><li><b>System Integrations:</b> Hands-on experience integrating with CRMs, CCaaS platforms, and other enterprise systems to create seamless user experiences.</li><li><b>Customer Engagement &amp; Communication:</b> Ability to effectively present and demo products to customers in both pre-sales and post-sales settings.</li><li><b>Market &amp; User Research:</b> Experience owning user research, conducting competitive market analysis, and translating insights into strategic product decisions.</li><li><b>Detail-Oriented Execution:</b> Strong focus on documentation, release management, and milestone tracking for both internal teams and external stakeholders.</li><li><b>Cross-Functional Leadership:</b> Exceptional communication skills with the ability to align and collaborate across engineering, sales, marketing, and customer success teams.</li><li><b>Business &amp; Analytical Acumen:</b> Strategic thinker with strong business instincts, data-driven decision-making skills, and technical fluency.</li><li><b>Industry Expertise:</b> Deep experience in SaaS, Customer Support, and Call Center/Contact Center technologies is required; experience in Process Automation is a plus.</li><li><b>Start-Up Mindset:</b> Prior experience in a fast-paced startup environment is a plus—thriving in a dynamic, high-growth setting where hustle, agility, and execution are key.</li><h3>What We Offer</h3><li>Competitive Compensation - We offer fair compensation packages&nbsp;</li><li>Comprehensive health insurance for employees and dependents</li><li>Provident Fund contributions in compliance with EPF guidelines</li><li>Generous Paid Parental Leave - Paid time off for parents to spend time with their new child</li><li>Unlimited PTO - Take the time you need to recharge and bring your best self to work&nbsp;</li><li>Flexible Remote Work - Work from anywhere</li><li>Home Office Stipend - Receive up to $500 to create a great work environment at home, and $100 a month for Internet, phone, etc.</li><li>Co-Working Reimbursement - Expense up to $200 a month on co-working space</li><h3>Our Values</h3><li><b>Lead with action:&nbsp;</b>We are doers. We move fast with purpose, fearlessly blaze new trails, and fail fast and learn quickly, to achieve positive outcomes for our customers and the business.&nbsp;</li><li><b>People really matter:&nbsp;</b>We win as a team. We care about all humans—our customers and our employees—achieving professional greatness&nbsp;and making a meaningful impact on the world.</li><li><b>Ownership leads to results:</b>&nbsp;When we say we’ll deliver, we deliver. We act responsibly with integrity, high standards, and hold ourselves accountable to the results of our actions.</li><li><b>Expertise creates value:</b>&nbsp;We are learners. We continuously build and share knowledge, invest in growing ourselves, and put expertise into action to fully realize our potential and goals.</li><li><b>Transparency builds trust:&nbsp;</b>We respectfully tell it as it is. We are direct, honest, and open with the information that matters, and communicate in a caring way that builds stronger trusted relationships with each other.</li>","tags":"[\"management\",\"engineering\",\"b2b\"]","pubDate":"2025-03-27T21:58:20.019Z","link":"https://jobs.lever.co/zingtree/4e10af62-ee30-4d34-a577-0a4511942220","slug":"senior-product-manager-ai-solutions-zingtree-7948"},{"id":6544820756,"title":"Implementations Lead","company":"Kit","image":"https://avatars.githubusercontent.com/u/10557747?s=200&v=4","description":"&lt;div class=&quot;content-intro&quot;&gt;&lt;h4&gt;Description&lt;/h4&gt;\n&lt;div&gt;\n&lt;p class=&quot;p1&quot;&gt;Kit is an email-first operating system for creators who mean business. We help creators grow and monetize their audience with ease. For coaches, YouTubers, authors, podcasters, and other creatives, there isn’t a better marketing hub to rely on to grow audiences, automate email marketing, and sell digital products - all within one platform. More importantly, there isn’t a team more committed to helping creators earn a living.&lt;/p&gt;\n&lt;p&gt;We’re on a mission to help creators earn $1 billion using our creator marketing platform. We have always been 100% independent and 100% remote. We are proud to have built a product that our customers love, and we look for people who have enthusiasm and belief in our mission, vision, and values to join our team.&lt;/p&gt;\n&lt;p&gt;The Kit culture is one where emotional intelligence is valued, radical candor is encouraged, and where everyone works together to uphold a set of shared team principles.&lt;/p&gt;\n&lt;hr&gt;\n&lt;p&gt;&amp;nbsp;&lt;/p&gt;\n&lt;/div&gt;&lt;/div&gt;&lt;h4&gt;&lt;strong&gt;The role&lt;/strong&gt;&lt;/h4&gt;\n&lt;p&gt;We are looking for an Implementations Lead to help creators seamlessly migrate from their current email service provider (ESP) to Kit. Creators rely on Kit for their financial livelihood, so providing a personable, accurate, and fast migration experience that minimizes impact on their deliverability and open rates is critical.&lt;/p&gt;\n&lt;p&gt;This is an individual contributor role with leadership responsibilities, including managing and coordinating work with contractors, reporting to the Director of Sales. It is ideal for someone who thrives at the intersection of customer experience, technical project management, and strategic consulting.&lt;/p&gt;\n&lt;h4&gt;&lt;strong&gt;Responsibilities&lt;/strong&gt;&lt;/h4&gt;\n&lt;ul&gt;\n&lt;li&gt;Own the implementation strategy for new Kit customers in a client-facing capacity (~65% of time), while ensuring seamless technical migrations that drive retention and revenue (~35% of time).&lt;/li&gt;\n&lt;li&gt;Act as a solutions consultant for large, complex migrations, advising customers on the best approach to transition their business to Kit.&lt;/li&gt;\n&lt;li&gt;Conduct technical audits of leads and incoming creators, scoping migration complexity and requirements.&lt;/li&gt;\n&lt;li&gt;Develop migration project plans, setting clear milestones, expectations, and completion timelines for each implementation.&lt;/li&gt;\n&lt;li&gt;Manage a team of migrations contractors, providing leadership, guidance, and performance oversight.&lt;/li&gt;\n&lt;li&gt;Align with Sales, Creator Growth, and Customer Success to ensure a smooth handoff between teams during the customer journey.&lt;/li&gt;\n&lt;li&gt;Drive operational excellence by optimizing existing migration processes, identifying efficiencies, and implementing automation strategies to streamline the migration process, with the ultimate goal of driving more deal volume, reducing migration time, and ensuring that each creator is provided a concierge-level service&lt;/li&gt;\n&lt;li&gt;Enhance Kit’s implementation framework by developing SOPs, playbooks, and standardized migration templates.&lt;/li&gt;\n&lt;li&gt;Document complex workflows and create educational resources to support the migration process.&lt;/li&gt;\n&lt;li&gt;Lead reporting efforts on migration performance, key KPIs, and project timelines to inform strategic decision-making.&lt;/li&gt;\n&lt;li&gt;Create high-quality email templates and landing pages within Kit using Figma designs.&lt;/li&gt;\n&lt;li&gt;Continuously refine the migration experience based on creator feedback to improve satisfaction and streamline the overall process.&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;&amp;nbsp;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Requirements&lt;/strong&gt;&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;4+ years of experience in customer implementations, technical onboarding, or professional services (preferably in SaaS, marketing tech, or email platforms)&lt;/li&gt;\n&lt;li&gt;Specific experience working with Email Service Providers (ESPs) such as ActiveCampaign, Mailchimp, Klaviyo, or similar platforms is required&lt;/li&gt;\n&lt;li&gt;Experience optimizing migration processes, implementing automation, driving deal volume, reducing migration time, and providing a concierge-level service for creators.&lt;/li&gt;\n&lt;li&gt;Excellent problem-solving and consultative selling skills, especially when working with high-profile creators&lt;/li&gt;\n&lt;li&gt;Excellent communication and collaboration skills&lt;/li&gt;\n&lt;li&gt;Curiosity and growth mindset to continuously improve our processes&lt;/li&gt;\n&lt;li&gt;2+ years of team management or contractor oversight experience&lt;/li&gt;\n&lt;li&gt;Experience leading large-scale migrations for enterprise or high-profile customers&lt;/li&gt;\n&lt;li&gt;Strong project management skills, with the ability to scope, execute, and deliver complex projects on time&lt;/li&gt;\n&lt;li&gt;Ability to create or use designs from Figma to create email templates, landing pages, and other deliverables within Kit&lt;/li&gt;\n&lt;li&gt;Understanding of technical integrations, APIs, and ESP-related configurations to provide high-level strategic recommendations&lt;/li&gt;\n&lt;li&gt;Strong ability to balance customer needs with Kit’s business objectives to drive adoption and retention&lt;/li&gt;\n&lt;li&gt;Experience using CRM and project management tools (Hubspot, Notion, Arrows, etc.) to track implementations and optimize workflows&lt;/li&gt;\n&lt;li&gt;Passion for the creator economy and a customer-first mindset&lt;/li&gt;\n&lt;li&gt;Be autonomous and self-motivated to work effectively in a 100% remote company.&lt;/li&gt;\n&lt;li&gt;Have enthusiasm for and belief in our &lt;a href=&quot;https://kit.com/mission&quot;&gt;mission, vision, and values&lt;/a&gt;.&lt;/li&gt;\n&lt;li&gt;Attend our bi-annual company retreats&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;&amp;nbsp;&lt;/p&gt;\n&lt;h4&gt;&lt;strong&gt;Compensation + Benefits&lt;/strong&gt;&lt;/h4&gt;\n&lt;p&gt;Kit has standardized salaries based on position, no matter where you live. For this role, we’re hiring at our level 4 level ($145,000). Level is determined based on experience and our interview process.&amp;nbsp;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Perks + benefits include:&lt;/strong&gt;&lt;/p&gt;\n&lt;ul&gt;\n&lt;li data-stringify-indent=&quot;0&quot; data-stringify-border=&quot;0&quot;&gt;\n&lt;div&gt;&lt;a class=&quot;c-link&quot; href=&quot;https://www.linkedin.com/posts/nathanbarry_convertkit-compensation-model-activity-6991414959247147008-i9V3/?utm_source=share&amp;amp;utm_medium=member_desktop&quot; target=&quot;_blank&quot; data-stringify-link=&quot;https://www.linkedin.com/posts/nathanbarry_convertkit-compensation-model-activity-6991414959247147008-i9V3/?utm_source=share&amp;amp;utm_medium=member_desktop&quot; data-sk=&quot;tooltip_parent&quot;&gt;Profit Sharing&lt;/a&gt;&lt;/div&gt;\n&lt;/li&gt;\n&lt;li data-stringify-indent=&quot;0&quot; data-stringify-border=&quot;0&quot;&gt;Kit equity&lt;/li&gt;\n&lt;li data-stringify-indent=&quot;0&quot; data-stringify-border=&quot;0&quot;&gt;401k with a 5% match&lt;/li&gt;\n&lt;li&gt;We cover up to $1,950 per month toward medical premiums, with dental and vision premiums fully covered. We offer Health Insurance plans through Aetna.&lt;/li&gt;\n&lt;li data-stringify-indent=&quot;0&quot; data-stringify-border=&quot;0&quot;&gt;$4,000 equipment allowance for your first two years, $3,000 budget every following two years&lt;/li&gt;\n&lt;li data-stringify-indent=&quot;0&quot; data-stringify-border=&quot;0&quot;&gt;Individual learning + development budget ($3,500/year)&lt;/li&gt;\n&lt;li data-stringify-indent=&quot;0&quot; data-stringify-border=&quot;0&quot;&gt;Gender affirming benefits&lt;/li&gt;\n&lt;li data-stringify-indent=&quot;0&quot; data-stringify-border=&quot;0&quot;&gt;Childcare benefit up to $3,000 annually&lt;/li&gt;\n&lt;li data-stringify-indent=&quot;0&quot; data-stringify-border=&quot;0&quot;&gt;Twenty (20) days of paid time off during each year of employment&lt;/li&gt;\n&lt;li data-stringify-indent=&quot;0&quot; data-stringify-border=&quot;0&quot;&gt;Paid paid vacation: An after-tax bonus of $1,000 for taking five consecutive days of vacation where you’re fully unplugged from work&lt;/li&gt;\n&lt;li data-stringify-indent=&quot;0&quot; data-stringify-border=&quot;0&quot;&gt;Ten (10) paid holidays a year&lt;/li&gt;\n&lt;li data-stringify-indent=&quot;0&quot; data-stringify-border=&quot;0&quot;&gt;Two weeks of paid sick time each year, including mental health + well being days&lt;/li&gt;\n&lt;li data-stringify-indent=&quot;0&quot; data-stringify-border=&quot;0&quot;&gt;Twelve (12) weeks paid parental leave and flexible scheduling in your child’s first year&lt;/li&gt;\n&lt;li data-stringify-indent=&quot;0&quot; data-stringify-border=&quot;0&quot;&gt;Up to six weeks of paid bereavement leave, medical leave, and disaster after six months of employment, two weeks of each paid leave in your first six months&lt;/li&gt;\n&lt;li data-stringify-indent=&quot;0&quot; data-stringify-border=&quot;0&quot;&gt;Winter Break Closure: Kit closes for a week at the end of December, giving everyone a collective break to enjoy the holiday season.&amp;nbsp;&lt;em data-stringify-type=&quot;italic&quot;&gt;Essential support services remain available, with teams coordinating to ensure coverage during this period&lt;/em&gt;&lt;/li&gt;\n&lt;li data-stringify-indent=&quot;0&quot; data-stringify-border=&quot;0&quot;&gt;Four-week, paid sabbatical after five years with the team&lt;/li&gt;\n&lt;li&gt;Fantastic in-person or virtual retreats with the team twice a year&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;&amp;nbsp;&lt;/p&gt;\n&lt;p&gt;&amp;nbsp;&lt;/p&gt;\n&lt;h4&gt;&lt;strong&gt;How to Apply&lt;/strong&gt;&lt;/h4&gt;\n&lt;p&gt;We usually receive a large number of applications, and our goal is to follow up with you within two weeks. You’ll hear from us either way. Here’s what you can expect from the rest of our hiring process:&lt;/p&gt;\n&lt;ol&gt;\n&lt;li&gt;A phone screen with our recruiter&lt;/li&gt;\n&lt;li&gt;Hiring manager interview&lt;/li&gt;\n&lt;li&gt;Work sample&lt;/li&gt;\n&lt;li&gt;A technical interview to discuss your work sample and your technical knowledge&lt;/li&gt;\n&lt;/ol&gt;\n&lt;p&gt;&amp;nbsp;&lt;/p&gt;\n&lt;p&gt;We’ll keep you informed through every step. To get started, complete this application, including a cover letter and answers to the questions on the next page. We read every single application, and your cover letter and responses help put your experience into context.&lt;/p&gt;&lt;div class=&quot;content-conclusion&quot;&gt;&lt;hr&gt;\n&lt;p&gt;&amp;nbsp;&lt;/p&gt;\n&lt;p&gt;Kit is an equal opportunity employer. We value diversity in all of its forms, and we hire the best person we can for each role, no matter your personal background. Research tells us that applicants who are female or non-binary, as well as applicants who are people of color, are less likely to apply for roles they do not feel 100% qualified for. If you think you meet more than 50% of our requirements but fewer than 100% of them, please apply. We’re imperfect communicators, so think of our job postings as the starting point for discussion rather than proof that you shouldn’t apply.&lt;/p&gt;\n&lt;p&gt;Kit does not discriminate on the basis of race, sex, color, religion, age, national origin, marital status, disability, veteran status, genetic information, sexual orientation, gender identity or any other reason prohibited by law in provision of employment opportunities and benefits.&lt;/p&gt;&lt;/div&gt;","tags":"[\"management\"]","pubDate":"2025-03-27T20:44:04.000Z","link":"https://job-boards.greenhouse.io/kit/jobs/4691628007","slug":"implementations-lead-kit-6725"},{"id":8827801793,"title":"Implementations Lead","company":"Kit","image":"https://avatars.githubusercontent.com/u/10557747?s=200&v=4","description":"&lt;div class=&quot;content-intro&quot;&gt;&lt;h4&gt;Description&lt;/h4&gt;\n&lt;div&gt;\n&lt;p class=&quot;p1&quot;&gt;Kit is an email-first operating system for creators who mean business. We help creators grow and monetize their audience with ease. For coaches, YouTubers, authors, podcasters, and other creatives, there isn’t a better marketing hub to rely on to grow audiences, automate email marketing, and sell digital products - all within one platform. More importantly, there isn’t a team more committed to helping creators earn a living.&lt;/p&gt;\n&lt;p&gt;We’re on a mission to help creators earn $1 billion using our creator marketing platform. We have always been 100% independent and 100% remote. We are proud to have built a product that our customers love, and we look for people who have enthusiasm and belief in our mission, vision, and values to join our team.&lt;/p&gt;\n&lt;p&gt;The Kit culture is one where emotional intelligence is valued, radical candor is encouraged, and where everyone works together to uphold a set of shared team principles.&lt;/p&gt;\n&lt;hr&gt;\n&lt;p&gt;&amp;nbsp;&lt;/p&gt;\n&lt;/div&gt;&lt;/div&gt;&lt;h4&gt;&lt;strong&gt;The role&lt;/strong&gt;&lt;/h4&gt;\n&lt;p&gt;We are looking for an Implementations Lead to help creators seamlessly migrate from their current email service provider (ESP) to Kit. Creators rely on Kit for their financial livelihood, so providing a personable, accurate, and fast migration experience that minimizes impact on their deliverability and open rates is critical.&lt;/p&gt;\n&lt;p&gt;This is an individual contributor role with leadership responsibilities, including managing and coordinating work with contractors, reporting to the Director of Sales. It is ideal for someone who thrives at the intersection of customer experience, technical project management, and strategic consulting.&lt;/p&gt;\n&lt;h4&gt;&lt;strong&gt;Responsibilities&lt;/strong&gt;&lt;/h4&gt;\n&lt;ul&gt;\n&lt;li&gt;Own the implementation strategy for new Kit customers in a client-facing capacity (~65% of time), while ensuring seamless technical migrations that drive retention and revenue (~35% of time).&lt;/li&gt;\n&lt;li&gt;Act as a solutions consultant for large, complex migrations, advising customers on the best approach to transition their business to Kit.&lt;/li&gt;\n&lt;li&gt;Conduct technical audits of leads and incoming creators, scoping migration complexity and requirements.&lt;/li&gt;\n&lt;li&gt;Develop migration project plans, setting clear milestones, expectations, and completion timelines for each implementation.&lt;/li&gt;\n&lt;li&gt;Manage a team of migrations contractors, providing leadership, guidance, and performance oversight.&lt;/li&gt;\n&lt;li&gt;Align with Sales, Creator Growth, and Customer Success to ensure a smooth handoff between teams during the customer journey.&lt;/li&gt;\n&lt;li&gt;Drive operational excellence by optimizing existing migration processes, identifying efficiencies, and implementing automation strategies to streamline the migration process, with the ultimate goal of driving more deal volume, reducing migration time, and ensuring that each creator is provided a concierge-level service&lt;/li&gt;\n&lt;li&gt;Enhance Kit’s implementation framework by developing SOPs, playbooks, and standardized migration templates.&lt;/li&gt;\n&lt;li&gt;Document complex workflows and create educational resources to support the migration process.&lt;/li&gt;\n&lt;li&gt;Lead reporting efforts on migration performance, key KPIs, and project timelines to inform strategic decision-making.&lt;/li&gt;\n&lt;li&gt;Create high-quality email templates and landing pages within Kit using Figma designs.&lt;/li&gt;\n&lt;li&gt;Continuously refine the migration experience based on creator feedback to improve satisfaction and streamline the overall process.&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;&amp;nbsp;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Requirements&lt;/strong&gt;&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;4+ years of experience in customer implementations, technical onboarding, or professional services (preferably in SaaS, marketing tech, or email platforms)&lt;/li&gt;\n&lt;li&gt;Specific experience working with Email Service Providers (ESPs) such as ActiveCampaign, Mailchimp, Klaviyo, or similar platforms is required&lt;/li&gt;\n&lt;li&gt;Experience optimizing migration processes, implementing automation, driving deal volume, reducing migration time, and providing a concierge-level service for creators.&lt;/li&gt;\n&lt;li&gt;Excellent problem-solving and consultative selling skills, especially when working with high-profile creators&lt;/li&gt;\n&lt;li&gt;Excellent communication and collaboration skills&lt;/li&gt;\n&lt;li&gt;Curiosity and growth mindset to continuously improve our processes&lt;/li&gt;\n&lt;li&gt;2+ years of team management or contractor oversight experience&lt;/li&gt;\n&lt;li&gt;Experience leading large-scale migrations for enterprise or high-profile customers&lt;/li&gt;\n&lt;li&gt;Strong project management skills, with the ability to scope, execute, and deliver complex projects on time&lt;/li&gt;\n&lt;li&gt;Ability to create or use designs from Figma to create email templates, landing pages, and other deliverables within Kit&lt;/li&gt;\n&lt;li&gt;Understanding of technical integrations, APIs, and ESP-related configurations to provide high-level strategic recommendations&lt;/li&gt;\n&lt;li&gt;Strong ability to balance customer needs with Kit’s business objectives to drive adoption and retention&lt;/li&gt;\n&lt;li&gt;Experience using CRM and project management tools (Hubspot, Notion, Arrows, etc.) to track implementations and optimize workflows&lt;/li&gt;\n&lt;li&gt;Passion for the creator economy and a customer-first mindset&lt;/li&gt;\n&lt;li&gt;Be autonomous and self-motivated to work effectively in a 100% remote company.&lt;/li&gt;\n&lt;li&gt;Have enthusiasm for and belief in our &lt;a href=&quot;https://kit.com/mission&quot;&gt;mission, vision, and values&lt;/a&gt;.&lt;/li&gt;\n&lt;li&gt;Attend our bi-annual company retreats&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;&amp;nbsp;&lt;/p&gt;\n&lt;h4&gt;&lt;strong&gt;Compensation + Benefits&lt;/strong&gt;&lt;/h4&gt;\n&lt;p&gt;Kit has standardized salaries based on position, no matter where you live. For this role, we’re hiring at our level 4 level ($145,000). Level is determined based on experience and our interview process.&amp;nbsp;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Perks + benefits include:&lt;/strong&gt;&lt;/p&gt;\n&lt;ul&gt;\n&lt;li data-stringify-indent=&quot;0&quot; data-stringify-border=&quot;0&quot;&gt;\n&lt;div&gt;&lt;a class=&quot;c-link&quot; href=&quot;https://www.linkedin.com/posts/nathanbarry_convertkit-compensation-model-activity-6991414959247147008-i9V3/?utm_source=share&amp;amp;utm_medium=member_desktop&quot; target=&quot;_blank&quot; data-stringify-link=&quot;https://www.linkedin.com/posts/nathanbarry_convertkit-compensation-model-activity-6991414959247147008-i9V3/?utm_source=share&amp;amp;utm_medium=member_desktop&quot; data-sk=&quot;tooltip_parent&quot;&gt;Profit Sharing&lt;/a&gt;&lt;/div&gt;\n&lt;/li&gt;\n&lt;li data-stringify-indent=&quot;0&quot; data-stringify-border=&quot;0&quot;&gt;Kit equity&lt;/li&gt;\n&lt;li data-stringify-indent=&quot;0&quot; data-stringify-border=&quot;0&quot;&gt;401k with a 5% match&lt;/li&gt;\n&lt;li&gt;We cover up to $1,950 per month toward medical premiums, with dental and vision premiums fully covered. We offer Health Insurance plans through Aetna.&lt;/li&gt;\n&lt;li data-stringify-indent=&quot;0&quot; data-stringify-border=&quot;0&quot;&gt;$4,000 equipment allowance for your first two years, $3,000 budget every following two years&lt;/li&gt;\n&lt;li data-stringify-indent=&quot;0&quot; data-stringify-border=&quot;0&quot;&gt;Individual learning + development budget ($3,500/year)&lt;/li&gt;\n&lt;li data-stringify-indent=&quot;0&quot; data-stringify-border=&quot;0&quot;&gt;Gender affirming benefits&lt;/li&gt;\n&lt;li data-stringify-indent=&quot;0&quot; data-stringify-border=&quot;0&quot;&gt;Childcare benefit up to $3,000 annually&lt;/li&gt;\n&lt;li data-stringify-indent=&quot;0&quot; data-stringify-border=&quot;0&quot;&gt;Twenty (20) days of paid time off during each year of employment&lt;/li&gt;\n&lt;li data-stringify-indent=&quot;0&quot; data-stringify-border=&quot;0&quot;&gt;Paid paid vacation: An after-tax bonus of $1,000 for taking five consecutive days of vacation where you’re fully unplugged from work&lt;/li&gt;\n&lt;li data-stringify-indent=&quot;0&quot; data-stringify-border=&quot;0&quot;&gt;Ten (10) paid holidays a year&lt;/li&gt;\n&lt;li data-stringify-indent=&quot;0&quot; data-stringify-border=&quot;0&quot;&gt;Two weeks of paid sick time each year, including mental health + well being days&lt;/li&gt;\n&lt;li data-stringify-indent=&quot;0&quot; data-stringify-border=&quot;0&quot;&gt;Twelve (12) weeks paid parental leave and flexible scheduling in your child’s first year&lt;/li&gt;\n&lt;li data-stringify-indent=&quot;0&quot; data-stringify-border=&quot;0&quot;&gt;Up to six weeks of paid bereavement leave, medical leave, and disaster after six months of employment, two weeks of each paid leave in your first six months&lt;/li&gt;\n&lt;li data-stringify-indent=&quot;0&quot; data-stringify-border=&quot;0&quot;&gt;Winter Break Closure: Kit closes for a week at the end of December, giving everyone a collective break to enjoy the holiday season.&amp;nbsp;&lt;em data-stringify-type=&quot;italic&quot;&gt;Essential support services remain available, with teams coordinating to ensure coverage during this period&lt;/em&gt;&lt;/li&gt;\n&lt;li data-stringify-indent=&quot;0&quot; data-stringify-border=&quot;0&quot;&gt;Four-week, paid sabbatical after five years with the team&lt;/li&gt;\n&lt;li&gt;Fantastic in-person or virtual retreats with the team twice a year&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;&amp;nbsp;&lt;/p&gt;\n&lt;p&gt;&amp;nbsp;&lt;/p&gt;\n&lt;h4&gt;&lt;strong&gt;How to Apply&lt;/strong&gt;&lt;/h4&gt;\n&lt;p&gt;We usually receive a large number of applications, and our goal is to follow up with you within two weeks. You’ll hear from us either way. Here’s what you can expect from the rest of our hiring process:&lt;/p&gt;\n&lt;ol&gt;\n&lt;li&gt;A phone screen with our recruiter&lt;/li&gt;\n&lt;li&gt;Hiring manager interview&lt;/li&gt;\n&lt;li&gt;Work sample&lt;/li&gt;\n&lt;li&gt;A technical interview to discuss your work sample and your technical knowledge&lt;/li&gt;\n&lt;/ol&gt;\n&lt;p&gt;&amp;nbsp;&lt;/p&gt;\n&lt;p&gt;We’ll keep you informed through every step. To get started, complete this application, including a cover letter and answers to the questions on the next page. We read every single application, and your cover letter and responses help put your experience into context.&lt;/p&gt;&lt;div class=&quot;content-conclusion&quot;&gt;&lt;hr&gt;\n&lt;p&gt;&amp;nbsp;&lt;/p&gt;\n&lt;p&gt;Kit is an equal opportunity employer. We value diversity in all of its forms, and we hire the best person we can for each role, no matter your personal background. Research tells us that applicants who are female or non-binary, as well as applicants who are people of color, are less likely to apply for roles they do not feel 100% qualified for. If you think you meet more than 50% of our requirements but fewer than 100% of them, please apply. We’re imperfect communicators, so think of our job postings as the starting point for discussion rather than proof that you shouldn’t apply.&lt;/p&gt;\n&lt;p&gt;Kit does not discriminate on the basis of race, sex, color, religion, age, national origin, marital status, disability, veteran status, genetic information, sexual orientation, gender identity or any other reason prohibited by law in provision of employment opportunities and benefits.&lt;/p&gt;&lt;/div&gt;","tags":"[\"management\"]","pubDate":"2025-03-27T20:43:54.000Z","link":"https://job-boards.greenhouse.io/kit/jobs/4691625007","slug":"implementations-lead-kit-7386"},{"id":1784940051,"title":"Implementations Lead","company":"Kit","image":"https://avatars.githubusercontent.com/u/10557747?s=200&v=4","description":"&lt;div class=&quot;content-intro&quot;&gt;&lt;h4&gt;Description&lt;/h4&gt;\n&lt;div&gt;\n&lt;p class=&quot;p1&quot;&gt;Kit is an email-first operating system for creators who mean business. We help creators grow and monetize their audience with ease. For coaches, YouTubers, authors, podcasters, and other creatives, there isn’t a better marketing hub to rely on to grow audiences, automate email marketing, and sell digital products - all within one platform. More importantly, there isn’t a team more committed to helping creators earn a living.&lt;/p&gt;\n&lt;p&gt;We’re on a mission to help creators earn $1 billion using our creator marketing platform. We have always been 100% independent and 100% remote. We are proud to have built a product that our customers love, and we look for people who have enthusiasm and belief in our mission, vision, and values to join our team.&lt;/p&gt;\n&lt;p&gt;The Kit culture is one where emotional intelligence is valued, radical candor is encouraged, and where everyone works together to uphold a set of shared team principles.&lt;/p&gt;\n&lt;hr&gt;\n&lt;p&gt;&amp;nbsp;&lt;/p&gt;\n&lt;/div&gt;&lt;/div&gt;&lt;h4&gt;&lt;strong&gt;The role&lt;/strong&gt;&lt;/h4&gt;\n&lt;p&gt;We are looking for an Implementations Lead to help creators seamlessly migrate from their current email service provider (ESP) to Kit. Creators rely on Kit for their financial livelihood, so providing a personable, accurate, and fast migration experience that minimizes impact on their deliverability and open rates is critical.&lt;/p&gt;\n&lt;p&gt;This is an individual contributor role with leadership responsibilities, including managing and coordinating work with contractors, reporting to the Director of Sales. It is ideal for someone who thrives at the intersection of customer experience, technical project management, and strategic consulting.&lt;/p&gt;\n&lt;h4&gt;&lt;strong&gt;Responsibilities&lt;/strong&gt;&lt;/h4&gt;\n&lt;ul&gt;\n&lt;li&gt;Own the implementation strategy for new Kit customers in a client-facing capacity (~65% of time), while ensuring seamless technical migrations that drive retention and revenue (~35% of time).&lt;/li&gt;\n&lt;li&gt;Act as a solutions consultant for large, complex migrations, advising customers on the best approach to transition their business to Kit.&lt;/li&gt;\n&lt;li&gt;Conduct technical audits of leads and incoming creators, scoping migration complexity and requirements.&lt;/li&gt;\n&lt;li&gt;Develop migration project plans, setting clear milestones, expectations, and completion timelines for each implementation.&lt;/li&gt;\n&lt;li&gt;Manage a team of migrations contractors, providing leadership, guidance, and performance oversight.&lt;/li&gt;\n&lt;li&gt;Align with Sales, Creator Growth, and Customer Success to ensure a smooth handoff between teams during the customer journey.&lt;/li&gt;\n&lt;li&gt;Drive operational excellence by optimizing existing migration processes, identifying efficiencies, and implementing automation strategies to streamline the migration process, with the ultimate goal of driving more deal volume, reducing migration time, and ensuring that each creator is provided a concierge-level service&lt;/li&gt;\n&lt;li&gt;Enhance Kit’s implementation framework by developing SOPs, playbooks, and standardized migration templates.&lt;/li&gt;\n&lt;li&gt;Document complex workflows and create educational resources to support the migration process.&lt;/li&gt;\n&lt;li&gt;Lead reporting efforts on migration performance, key KPIs, and project timelines to inform strategic decision-making.&lt;/li&gt;\n&lt;li&gt;Create high-quality email templates and landing pages within Kit using Figma designs.&lt;/li&gt;\n&lt;li&gt;Continuously refine the migration experience based on creator feedback to improve satisfaction and streamline the overall process.&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;&amp;nbsp;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Requirements&lt;/strong&gt;&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;4+ years of experience in customer implementations, technical onboarding, or professional services (preferably in SaaS, marketing tech, or email platforms)&lt;/li&gt;\n&lt;li&gt;Specific experience working with Email Service Providers (ESPs) such as ActiveCampaign, Mailchimp, Klaviyo, or similar platforms is required&lt;/li&gt;\n&lt;li&gt;Experience optimizing migration processes, implementing automation, driving deal volume, reducing migration time, and providing a concierge-level service for creators.&lt;/li&gt;\n&lt;li&gt;Excellent problem-solving and consultative selling skills, especially when working with high-profile creators&lt;/li&gt;\n&lt;li&gt;Excellent communication and collaboration skills&lt;/li&gt;\n&lt;li&gt;Curiosity and growth mindset to continuously improve our processes&lt;/li&gt;\n&lt;li&gt;2+ years of team management or contractor oversight experience&lt;/li&gt;\n&lt;li&gt;Experience leading large-scale migrations for enterprise or high-profile customers&lt;/li&gt;\n&lt;li&gt;Strong project management skills, with the ability to scope, execute, and deliver complex projects on time&lt;/li&gt;\n&lt;li&gt;Ability to create or use designs from Figma to create email templates, landing pages, and other deliverables within Kit&lt;/li&gt;\n&lt;li&gt;Understanding of technical integrations, APIs, and ESP-related configurations to provide high-level strategic recommendations&lt;/li&gt;\n&lt;li&gt;Strong ability to balance customer needs with Kit’s business objectives to drive adoption and retention&lt;/li&gt;\n&lt;li&gt;Experience using CRM and project management tools (Hubspot, Notion, Arrows, etc.) to track implementations and optimize workflows&lt;/li&gt;\n&lt;li&gt;Passion for the creator economy and a customer-first mindset&lt;/li&gt;\n&lt;li&gt;Be autonomous and self-motivated to work effectively in a 100% remote company.&lt;/li&gt;\n&lt;li&gt;Have enthusiasm for and belief in our &lt;a href=&quot;https://kit.com/mission&quot;&gt;mission, vision, and values&lt;/a&gt;.&lt;/li&gt;\n&lt;li&gt;Attend our bi-annual company retreats&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;&amp;nbsp;&lt;/p&gt;\n&lt;h4&gt;&lt;strong&gt;Compensation + Benefits&lt;/strong&gt;&lt;/h4&gt;\n&lt;p&gt;Kit has standardized salaries based on position, no matter where you live. For this role, we’re hiring at our level 4 level ($145,000). Level is determined based on experience and our interview process.&amp;nbsp;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Perks + benefits include:&lt;/strong&gt;&lt;/p&gt;\n&lt;ul&gt;\n&lt;li data-stringify-indent=&quot;0&quot; data-stringify-border=&quot;0&quot;&gt;\n&lt;div&gt;&lt;a class=&quot;c-link&quot; href=&quot;https://www.linkedin.com/posts/nathanbarry_convertkit-compensation-model-activity-6991414959247147008-i9V3/?utm_source=share&amp;amp;utm_medium=member_desktop&quot; target=&quot;_blank&quot; data-stringify-link=&quot;https://www.linkedin.com/posts/nathanbarry_convertkit-compensation-model-activity-6991414959247147008-i9V3/?utm_source=share&amp;amp;utm_medium=member_desktop&quot; data-sk=&quot;tooltip_parent&quot;&gt;Profit Sharing&lt;/a&gt;&lt;/div&gt;\n&lt;/li&gt;\n&lt;li data-stringify-indent=&quot;0&quot; data-stringify-border=&quot;0&quot;&gt;Kit equity&lt;/li&gt;\n&lt;li data-stringify-indent=&quot;0&quot; data-stringify-border=&quot;0&quot;&gt;401k with a 5% match&lt;/li&gt;\n&lt;li&gt;We cover up to $1,950 per month toward medical premiums, with dental and vision premiums fully covered. We offer Health Insurance plans through Aetna.&lt;/li&gt;\n&lt;li data-stringify-indent=&quot;0&quot; data-stringify-border=&quot;0&quot;&gt;$4,000 equipment allowance for your first two years, $3,000 budget every following two years&lt;/li&gt;\n&lt;li data-stringify-indent=&quot;0&quot; data-stringify-border=&quot;0&quot;&gt;Individual learning + development budget ($3,500/year)&lt;/li&gt;\n&lt;li data-stringify-indent=&quot;0&quot; data-stringify-border=&quot;0&quot;&gt;Gender affirming benefits&lt;/li&gt;\n&lt;li data-stringify-indent=&quot;0&quot; data-stringify-border=&quot;0&quot;&gt;Childcare benefit up to $3,000 annually&lt;/li&gt;\n&lt;li data-stringify-indent=&quot;0&quot; data-stringify-border=&quot;0&quot;&gt;Twenty (20) days of paid time off during each year of employment&lt;/li&gt;\n&lt;li data-stringify-indent=&quot;0&quot; data-stringify-border=&quot;0&quot;&gt;Paid paid vacation: An after-tax bonus of $1,000 for taking five consecutive days of vacation where you’re fully unplugged from work&lt;/li&gt;\n&lt;li data-stringify-indent=&quot;0&quot; data-stringify-border=&quot;0&quot;&gt;Ten (10) paid holidays a year&lt;/li&gt;\n&lt;li data-stringify-indent=&quot;0&quot; data-stringify-border=&quot;0&quot;&gt;Two weeks of paid sick time each year, including mental health + well being days&lt;/li&gt;\n&lt;li data-stringify-indent=&quot;0&quot; data-stringify-border=&quot;0&quot;&gt;Twelve (12) weeks paid parental leave and flexible scheduling in your child’s first year&lt;/li&gt;\n&lt;li data-stringify-indent=&quot;0&quot; data-stringify-border=&quot;0&quot;&gt;Up to six weeks of paid bereavement leave, medical leave, and disaster after six months of employment, two weeks of each paid leave in your first six months&lt;/li&gt;\n&lt;li data-stringify-indent=&quot;0&quot; data-stringify-border=&quot;0&quot;&gt;Winter Break Closure: Kit closes for a week at the end of December, giving everyone a collective break to enjoy the holiday season.&amp;nbsp;&lt;em data-stringify-type=&quot;italic&quot;&gt;Essential support services remain available, with teams coordinating to ensure coverage during this period&lt;/em&gt;&lt;/li&gt;\n&lt;li data-stringify-indent=&quot;0&quot; data-stringify-border=&quot;0&quot;&gt;Four-week, paid sabbatical after five years with the team&lt;/li&gt;\n&lt;li&gt;Fantastic in-person or virtual retreats with the team twice a year&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;&amp;nbsp;&lt;/p&gt;\n&lt;p&gt;&amp;nbsp;&lt;/p&gt;\n&lt;h4&gt;&lt;strong&gt;How to Apply&lt;/strong&gt;&lt;/h4&gt;\n&lt;p&gt;We usually receive a large number of applications, and our goal is to follow up with you within two weeks. You’ll hear from us either way. Here’s what you can expect from the rest of our hiring process:&lt;/p&gt;\n&lt;ol&gt;\n&lt;li&gt;A phone screen with our recruiter&lt;/li&gt;\n&lt;li&gt;Hiring manager interview&lt;/li&gt;\n&lt;li&gt;Work sample&lt;/li&gt;\n&lt;li&gt;A technical interview to discuss your work sample and your technical knowledge&lt;/li&gt;\n&lt;/ol&gt;\n&lt;p&gt;&amp;nbsp;&lt;/p&gt;\n&lt;p&gt;We’ll keep you informed through every step. To get started, complete this application, including a cover letter and answers to the questions on the next page. We read every single application, and your cover letter and responses help put your experience into context.&lt;/p&gt;&lt;div class=&quot;content-conclusion&quot;&gt;&lt;hr&gt;\n&lt;p&gt;&amp;nbsp;&lt;/p&gt;\n&lt;p&gt;Kit is an equal opportunity employer. We value diversity in all of its forms, and we hire the best person we can for each role, no matter your personal background. Research tells us that applicants who are female or non-binary, as well as applicants who are people of color, are less likely to apply for roles they do not feel 100% qualified for. If you think you meet more than 50% of our requirements but fewer than 100% of them, please apply. We’re imperfect communicators, so think of our job postings as the starting point for discussion rather than proof that you shouldn’t apply.&lt;/p&gt;\n&lt;p&gt;Kit does not discriminate on the basis of race, sex, color, religion, age, national origin, marital status, disability, veteran status, genetic information, sexual orientation, gender identity or any other reason prohibited by law in provision of employment opportunities and benefits.&lt;/p&gt;&lt;/div&gt;","tags":"[\"management\"]","pubDate":"2025-03-27T20:43:38.000Z","link":"https://job-boards.greenhouse.io/kit/jobs/4691609007","slug":"implementations-lead-kit-8660"},{"id":8811474400,"title":"Senior Product Marketing Manager","company":"Kit","image":"https://avatars.githubusercontent.com/u/10557747?s=200&v=4","description":"&lt;div class=&quot;content-intro&quot;&gt;&lt;h4&gt;Description&lt;/h4&gt;\n&lt;div&gt;\n&lt;p class=&quot;p1&quot;&gt;Kit is an email-first operating system for creators who mean business. We help creators grow and monetize their audience with ease. For coaches, YouTubers, authors, podcasters, and other creatives, there isn’t a better marketing hub to rely on to grow audiences, automate email marketing, and sell digital products - all within one platform. More importantly, there isn’t a team more committed to helping creators earn a living.&lt;/p&gt;\n&lt;p&gt;We’re on a mission to help creators earn $1 billion using our creator marketing platform. We have always been 100% independent and 100% remote. We are proud to have built a product that our customers love, and we look for people who have enthusiasm and belief in our mission, vision, and values to join our team.&lt;/p&gt;\n&lt;p&gt;The Kit culture is one where emotional intelligence is valued, radical candor is encouraged, and where everyone works together to uphold a set of shared team principles.&lt;/p&gt;\n&lt;hr&gt;\n&lt;p&gt;&amp;nbsp;&lt;/p&gt;\n&lt;/div&gt;&lt;/div&gt;&lt;div class=&quot;page&quot;&gt;\n&lt;div class=&quot;section&quot;&gt;\n&lt;div class=&quot;layoutArea&quot;&gt;\n&lt;div class=&quot;column&quot;&gt;\n&lt;h2&gt;&lt;strong&gt;The role&lt;/strong&gt;&lt;/h2&gt;\n&lt;p&gt;We&#39;re seeking an exceptional Senior Product Marketing Manager who will play a key role in shaping the narrative around our suite of tools designed for the modern creator. In this dynamic role, you’ll balance the positioning and messaging of individual features while crafting a cohesive, compelling story for Kit as a whole.&lt;/p&gt;\n&lt;p&gt;You’ll dive deep into the diverse world of creators—from artists and bloggers to educators and entrepreneurs, uncovering their unique needs through customer research, data, and competitive insight. You’ll translate those insights into clear, differentiated messaging that resonates across the full spectrum of our audience.&lt;/p&gt;\n&lt;p&gt;This role requires a rare blend of &lt;strong&gt;strategic thinking, storytelling, and scrappy execution&lt;/strong&gt;. You know how to connect product capabilities to market opportunities, test and iterate quickly, and communicate with clarity—whether you&#39;re enabling a sales team, shaping a go-to-market plan, or influencing product direction. You thrive in cross-functional environments and bring others along with context and conviction. Join us and play a pivotal role in a team committed to empowering creators with tools that turn passion into livelihood—by telling the right stories, to the right people, at the right time.&lt;/p&gt;\n&lt;p&gt;&amp;nbsp;&lt;/p&gt;\n&lt;h2&gt;&lt;strong&gt;Responsibilities&lt;/strong&gt;&lt;/h2&gt;\n&lt;h3&gt;&lt;strong&gt;Research&lt;/strong&gt;&lt;/h3&gt;\n&lt;ul&gt;\n&lt;li&gt;Proactively gather insights from customer research, sales calls, data, and competitors to educate internal stakeholders and help inform product strategy, roadmap, pricing, and packaging.&lt;/li&gt;\n&lt;li&gt;Lead win/loss user research efforts and act as the voice of the creators we serve.&lt;/li&gt;\n&lt;/ul&gt;\n&lt;h3&gt;&lt;strong&gt;Positioning, messaging, and narrative design&lt;/strong&gt;&lt;/h3&gt;\n&lt;ul&gt;\n&lt;li&gt;Refine our target personas and value propositions. Identify product use cases that enable creators to grow their audience, connect with their audiences, and earn a living online.&lt;/li&gt;\n&lt;li&gt;Iteratively improve our positioning and messaging so that it clearly communicates our product’s value. Distill complexity into crisp messaging&lt;/li&gt;\n&lt;li&gt;Help us define a new market category for the creator space and collaboratively shape a narrative that clearly communicates the value of our offerings.&lt;/li&gt;\n&lt;/ul&gt;\n&lt;h3&gt;&lt;strong&gt;Planning and execution&lt;/strong&gt;&lt;/h3&gt;\n&lt;ul&gt;\n&lt;li&gt;Leverage and improve our go-to-market playbooks and lead the execution of product launches, ongoing feature releases, and new partnerships.&lt;/li&gt;\n&lt;li&gt;Collaborate and influence internal stakeholders, including Product, Marketing, Sales, and Support teams, to identify and support their unique needs.&lt;/li&gt;\n&lt;li&gt;Create customer-facing material, including web copy, videos, emails, case studies, blog posts, FAQs, tutorials, etc.&lt;/li&gt;\n&lt;/ul&gt;\n&lt;h3&gt;&lt;strong&gt;Analysis&lt;/strong&gt;&lt;/h3&gt;\n&lt;ul&gt;\n&lt;li&gt;Measure product marketing performance through key metrics such as revenue growth, conversion rates, monthly active users, and feature adoption.&lt;/li&gt;\n&lt;li&gt;Use large data sets to create high-confidence forecasts and growth plans to achieve company goals.&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;&amp;nbsp;&lt;/p&gt;\n&lt;p&gt;&amp;nbsp;&lt;/p&gt;\n&lt;h2&gt;The right candidate has&lt;/h2&gt;\n&lt;ul&gt;\n&lt;li&gt;Multiple years of in-house experience in product marketing for SaaS, B2C tech companies. B2B experience is a plus.&lt;/li&gt;\n&lt;li&gt;Proven understanding of segmentation strategies, developing buyer personas, articulating customer pain points, and crafting customer-facing messaging&lt;/li&gt;\n&lt;li&gt;Exceptional visual, written, spoken communication, and presentation skills&lt;/li&gt;\n&lt;li&gt;Proven Product-Led Growth (PLG) marketing experience with strong research and analytical skills&lt;/li&gt;\n&lt;li&gt;Experience supporting sales enablement through effective messaging, collateral, and tools that drive revenue and improve sales performance&lt;/li&gt;\n&lt;li&gt;Demonstrated ability to work as a team player, confidently collaborate with senior executives, and build consensus among multiple stakeholders and teams&lt;/li&gt;\n&lt;li&gt;Ability to thrive in an ambiguous, fast-paced, and flexible environment with a high degree of autonomy&lt;/li&gt;\n&lt;li&gt;Bias towards action and an operator mindset, with an understanding for the most important metrics and how to produce measurable results&lt;/li&gt;\n&lt;li&gt;Self-motivated, organized, and communicative, capable of working effectively in a 100% remote work environment&lt;/li&gt;\n&lt;li&gt;Have enthusiasm and belief in our &lt;a href=&quot;https://convertkit.com/mission&quot;&gt;mission, vision, and values&lt;/a&gt;&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;&amp;nbsp;&lt;/p&gt;\n&lt;h3&gt;Compensation and benefits&lt;/h3&gt;\n&lt;p&gt;Kit has standardized salaries based on position, no matter where you live. For this role, we’re hiring at a Level 4 ($158,000). The level is determined based on experience and our interview process.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Perks + benefits include:&lt;/strong&gt;&lt;/p&gt;\n&lt;ul&gt;\n&lt;li data-stringify-indent=&quot;0&quot; data-stringify-border=&quot;0&quot;&gt;\n&lt;div&gt;&lt;a class=&quot;c-link&quot; href=&quot;https://www.linkedin.com/posts/nathanbarry_convertkit-compensation-model-activity-6991414959247147008-i9V3/?utm_source=share&amp;amp;utm_medium=member_desktop&quot; target=&quot;_blank&quot; data-stringify-link=&quot;https://www.linkedin.com/posts/nathanbarry_convertkit-compensation-model-activity-6991414959247147008-i9V3/?utm_source=share&amp;amp;utm_medium=member_desktop&quot; data-sk=&quot;tooltip_parent&quot;&gt;Profit Sharing&lt;/a&gt;&lt;/div&gt;\n&lt;/li&gt;\n&lt;li data-stringify-indent=&quot;0&quot; data-stringify-border=&quot;0&quot;&gt;Kit equity&lt;/li&gt;\n&lt;li data-stringify-indent=&quot;0&quot; data-stringify-border=&quot;0&quot;&gt;401k with a 5% match&lt;/li&gt;\n&lt;li&gt;We cover up to $1,950 per month toward medical premiums, with dental and vision premiums fully covered. We offer Health Insurance plans through Aetna.&lt;/li&gt;\n&lt;li data-stringify-indent=&quot;0&quot; data-stringify-border=&quot;0&quot;&gt;$4,000 equipment allowance for your first two years, $3,000 budget every following two years&lt;/li&gt;\n&lt;li data-stringify-indent=&quot;0&quot; data-stringify-border=&quot;0&quot;&gt;Individual learning + development budget ($3,500/year)&lt;/li&gt;\n&lt;li data-stringify-indent=&quot;0&quot; data-stringify-border=&quot;0&quot;&gt;Gender affirming benefits&lt;/li&gt;\n&lt;li data-stringify-indent=&quot;0&quot; data-stringify-border=&quot;0&quot;&gt;Childcare benefit up to $3,000 annually&lt;/li&gt;\n&lt;li data-stringify-indent=&quot;0&quot; data-stringify-border=&quot;0&quot;&gt;Twenty (20) days of paid time off during each year of employment&lt;/li&gt;\n&lt;li data-stringify-indent=&quot;0&quot; data-stringify-border=&quot;0&quot;&gt;Paid paid vacation: An after-tax bonus of $1,000 for taking five consecutive days of vacation where you’re fully unplugged from work&lt;/li&gt;\n&lt;li data-stringify-indent=&quot;0&quot; data-stringify-border=&quot;0&quot;&gt;Ten (10) paid holidays a year&lt;/li&gt;\n&lt;li data-stringify-indent=&quot;0&quot; data-stringify-border=&quot;0&quot;&gt;Two weeks of paid sick time each year, including mental health + well being days&lt;/li&gt;\n&lt;li data-stringify-indent=&quot;0&quot; data-stringify-border=&quot;0&quot;&gt;Twelve (12) weeks paid parental leave and flexible scheduling in your child’s first year&lt;/li&gt;\n&lt;li data-stringify-indent=&quot;0&quot; data-stringify-border=&quot;0&quot;&gt;Up to six weeks of paid bereavement leave, medical leave, and disaster after six months of employment, two weeks of each paid leave in your first six months&lt;/li&gt;\n&lt;li data-stringify-indent=&quot;0&quot; data-stringify-border=&quot;0&quot;&gt;Winter Break Closure: Kit closes for a week at the end of December, giving everyone a collective break to enjoy the holiday season.&amp;nbsp;&lt;em data-stringify-type=&quot;italic&quot;&gt;Essential support services remain available, with teams coordinating to ensure coverage during this period&lt;/em&gt;&lt;/li&gt;\n&lt;li data-stringify-indent=&quot;0&quot; data-stringify-border=&quot;0&quot;&gt;Four-week, paid sabbatical after five years with the team&lt;/li&gt;\n&lt;li&gt;Fantastic in-person or virtual retreats with the team twice a year&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;&amp;nbsp;&lt;/p&gt;\n&lt;h2&gt;&lt;strong&gt;How to apply&lt;/strong&gt;&lt;/h2&gt;\n&lt;p&gt;We know that most interviewing is tough. We aim to make it as good of an experience as we can, and part of that includes keeping you informed during the process.&lt;/p&gt;\n&lt;p&gt;We usually receive a large number of applications, but hope to get through them within two weeks of the post date for the role. Don’t worry, you’ll hear from us either way.&lt;/p&gt;\n&lt;p&gt;Here’s what you can expect from our hiring process:&lt;/p&gt;\n&lt;ol&gt;\n&lt;li&gt;Recruiter phone screen&lt;/li&gt;\n&lt;li&gt;Hiring manager interview&lt;/li&gt;\n&lt;li&gt;Work Sample&lt;/li&gt;\n&lt;li&gt;A technical interview to discuss the work sample and your technical knowledge&lt;/li&gt;\n&lt;/ol&gt;\n&lt;p&gt;To get started, complete this application, including answers to the questions on the next page. &lt;strong&gt;We read every single application, and your responses to our application questions help put your experience into context.&lt;/strong&gt; We’ll keep you informed through every step.&lt;/p&gt;\n&lt;/div&gt;\n&lt;/div&gt;\n&lt;/div&gt;\n&lt;/div&gt;&lt;div class=&quot;content-conclusion&quot;&gt;&lt;hr&gt;\n&lt;p&gt;&amp;nbsp;&lt;/p&gt;\n&lt;p&gt;Kit is an equal opportunity employer. We value diversity in all of its forms, and we hire the best person we can for each role, no matter your personal background. Research tells us that applicants who are female or non-binary, as well as applicants who are people of color, are less likely to apply for roles they do not feel 100% qualified for. If you think you meet more than 50% of our requirements but fewer than 100% of them, please apply. We’re imperfect communicators, so think of our job postings as the starting point for discussion rather than proof that you shouldn’t apply.&lt;/p&gt;\n&lt;p&gt;Kit does not discriminate on the basis of race, sex, color, religion, age, national origin, marital status, disability, veteran status, genetic information, sexual orientation, gender identity or any other reason prohibited by law in provision of employment opportunities and benefits.&lt;/p&gt;&lt;/div&gt;","tags":"[\"b2c\",\"b2b\"]","pubDate":"2025-03-27T20:43:18.000Z","link":"https://job-boards.greenhouse.io/kit/jobs/4691605007","slug":"senior-product-marketing-manager-kit-3059"},{"id":7198069995,"title":"Senior Product Marketing Manager","company":"Kit","image":"https://avatars.githubusercontent.com/u/10557747?s=200&v=4","description":"&lt;div class=&quot;content-intro&quot;&gt;&lt;h4&gt;Description&lt;/h4&gt;\n&lt;div&gt;\n&lt;p class=&quot;p1&quot;&gt;Kit is an email-first operating system for creators who mean business. We help creators grow and monetize their audience with ease. For coaches, YouTubers, authors, podcasters, and other creatives, there isn’t a better marketing hub to rely on to grow audiences, automate email marketing, and sell digital products - all within one platform. More importantly, there isn’t a team more committed to helping creators earn a living.&lt;/p&gt;\n&lt;p&gt;We’re on a mission to help creators earn $1 billion using our creator marketing platform. We have always been 100% independent and 100% remote. We are proud to have built a product that our customers love, and we look for people who have enthusiasm and belief in our mission, vision, and values to join our team.&lt;/p&gt;\n&lt;p&gt;The Kit culture is one where emotional intelligence is valued, radical candor is encouraged, and where everyone works together to uphold a set of shared team principles.&lt;/p&gt;\n&lt;hr&gt;\n&lt;p&gt;&amp;nbsp;&lt;/p&gt;\n&lt;/div&gt;&lt;/div&gt;&lt;div class=&quot;page&quot;&gt;\n&lt;div class=&quot;section&quot;&gt;\n&lt;div class=&quot;layoutArea&quot;&gt;\n&lt;div class=&quot;column&quot;&gt;\n&lt;h2&gt;&lt;strong&gt;The role&lt;/strong&gt;&lt;/h2&gt;\n&lt;p&gt;We&#39;re seeking an exceptional Senior Product Marketing Manager who will play a key role in shaping the narrative around our suite of tools designed for the modern creator. In this dynamic role, you’ll balance the positioning and messaging of individual features while crafting a cohesive, compelling story for Kit as a whole.&lt;/p&gt;\n&lt;p&gt;You’ll dive deep into the diverse world of creators—from artists and bloggers to educators and entrepreneurs, uncovering their unique needs through customer research, data, and competitive insight. You’ll translate those insights into clear, differentiated messaging that resonates across the full spectrum of our audience.&lt;/p&gt;\n&lt;p&gt;This role requires a rare blend of &lt;strong&gt;strategic thinking, storytelling, and scrappy execution&lt;/strong&gt;. You know how to connect product capabilities to market opportunities, test and iterate quickly, and communicate with clarity—whether you&#39;re enabling a sales team, shaping a go-to-market plan, or influencing product direction. You thrive in cross-functional environments and bring others along with context and conviction. Join us and play a pivotal role in a team committed to empowering creators with tools that turn passion into livelihood—by telling the right stories, to the right people, at the right time.&lt;/p&gt;\n&lt;p&gt;&amp;nbsp;&lt;/p&gt;\n&lt;h2&gt;&lt;strong&gt;Responsibilities&lt;/strong&gt;&lt;/h2&gt;\n&lt;h3&gt;&lt;strong&gt;Research&lt;/strong&gt;&lt;/h3&gt;\n&lt;ul&gt;\n&lt;li&gt;Proactively gather insights from customer research, sales calls, data, and competitors to educate internal stakeholders and help inform product strategy, roadmap, pricing, and packaging.&lt;/li&gt;\n&lt;li&gt;Lead win/loss user research efforts and act as the voice of the creators we serve.&lt;/li&gt;\n&lt;/ul&gt;\n&lt;h3&gt;&lt;strong&gt;Positioning, messaging, and narrative design&lt;/strong&gt;&lt;/h3&gt;\n&lt;ul&gt;\n&lt;li&gt;Refine our target personas and value propositions. Identify product use cases that enable creators to grow their audience, connect with their audiences, and earn a living online.&lt;/li&gt;\n&lt;li&gt;Iteratively improve our positioning and messaging so that it clearly communicates our product’s value. Distill complexity into crisp messaging&lt;/li&gt;\n&lt;li&gt;Help us define a new market category for the creator space and collaboratively shape a narrative that clearly communicates the value of our offerings.&lt;/li&gt;\n&lt;/ul&gt;\n&lt;h3&gt;&lt;strong&gt;Planning and execution&lt;/strong&gt;&lt;/h3&gt;\n&lt;ul&gt;\n&lt;li&gt;Leverage and improve our go-to-market playbooks and lead the execution of product launches, ongoing feature releases, and new partnerships.&lt;/li&gt;\n&lt;li&gt;Collaborate and influence internal stakeholders, including Product, Marketing, Sales, and Support teams, to identify and support their unique needs.&lt;/li&gt;\n&lt;li&gt;Create customer-facing material, including web copy, videos, emails, case studies, blog posts, FAQs, tutorials, etc.&lt;/li&gt;\n&lt;/ul&gt;\n&lt;h3&gt;&lt;strong&gt;Analysis&lt;/strong&gt;&lt;/h3&gt;\n&lt;ul&gt;\n&lt;li&gt;Measure product marketing performance through key metrics such as revenue growth, conversion rates, monthly active users, and feature adoption.&lt;/li&gt;\n&lt;li&gt;Use large data sets to create high-confidence forecasts and growth plans to achieve company goals.&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;&amp;nbsp;&lt;/p&gt;\n&lt;p&gt;&amp;nbsp;&lt;/p&gt;\n&lt;h2&gt;The right candidate has&lt;/h2&gt;\n&lt;ul&gt;\n&lt;li&gt;Multiple years of in-house experience in product marketing for SaaS, B2C tech companies. B2B experience is a plus.&lt;/li&gt;\n&lt;li&gt;Proven understanding of segmentation strategies, developing buyer personas, articulating customer pain points, and crafting customer-facing messaging&lt;/li&gt;\n&lt;li&gt;Exceptional visual, written, spoken communication, and presentation skills&lt;/li&gt;\n&lt;li&gt;Proven Product-Led Growth (PLG) marketing experience with strong research and analytical skills&lt;/li&gt;\n&lt;li&gt;Experience supporting sales enablement through effective messaging, collateral, and tools that drive revenue and improve sales performance&lt;/li&gt;\n&lt;li&gt;Demonstrated ability to work as a team player, confidently collaborate with senior executives, and build consensus among multiple stakeholders and teams&lt;/li&gt;\n&lt;li&gt;Ability to thrive in an ambiguous, fast-paced, and flexible environment with a high degree of autonomy&lt;/li&gt;\n&lt;li&gt;Bias towards action and an operator mindset, with an understanding for the most important metrics and how to produce measurable results&lt;/li&gt;\n&lt;li&gt;Self-motivated, organized, and communicative, capable of working effectively in a 100% remote work environment&lt;/li&gt;\n&lt;li&gt;Have enthusiasm and belief in our &lt;a href=&quot;https://convertkit.com/mission&quot;&gt;mission, vision, and values&lt;/a&gt;&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;&amp;nbsp;&lt;/p&gt;\n&lt;h3&gt;Compensation and benefits&lt;/h3&gt;\n&lt;p&gt;Kit has standardized salaries based on position, no matter where you live. For this role, we’re hiring at a Level 4 ($158,000). The level is determined based on experience and our interview process.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Perks + benefits include:&lt;/strong&gt;&lt;/p&gt;\n&lt;ul&gt;\n&lt;li data-stringify-indent=&quot;0&quot; data-stringify-border=&quot;0&quot;&gt;\n&lt;div&gt;&lt;a class=&quot;c-link&quot; href=&quot;https://www.linkedin.com/posts/nathanbarry_convertkit-compensation-model-activity-6991414959247147008-i9V3/?utm_source=share&amp;amp;utm_medium=member_desktop&quot; target=&quot;_blank&quot; data-stringify-link=&quot;https://www.linkedin.com/posts/nathanbarry_convertkit-compensation-model-activity-6991414959247147008-i9V3/?utm_source=share&amp;amp;utm_medium=member_desktop&quot; data-sk=&quot;tooltip_parent&quot;&gt;Profit Sharing&lt;/a&gt;&lt;/div&gt;\n&lt;/li&gt;\n&lt;li data-stringify-indent=&quot;0&quot; data-stringify-border=&quot;0&quot;&gt;Kit equity&lt;/li&gt;\n&lt;li data-stringify-indent=&quot;0&quot; data-stringify-border=&quot;0&quot;&gt;401k with a 5% match&lt;/li&gt;\n&lt;li&gt;We cover up to $1,950 per month toward medical premiums, with dental and vision premiums fully covered. We offer Health Insurance plans through Aetna.&lt;/li&gt;\n&lt;li data-stringify-indent=&quot;0&quot; data-stringify-border=&quot;0&quot;&gt;$4,000 equipment allowance for your first two years, $3,000 budget every following two years&lt;/li&gt;\n&lt;li data-stringify-indent=&quot;0&quot; data-stringify-border=&quot;0&quot;&gt;Individual learning + development budget ($3,500/year)&lt;/li&gt;\n&lt;li data-stringify-indent=&quot;0&quot; data-stringify-border=&quot;0&quot;&gt;Gender affirming benefits&lt;/li&gt;\n&lt;li data-stringify-indent=&quot;0&quot; data-stringify-border=&quot;0&quot;&gt;Childcare benefit up to $3,000 annually&lt;/li&gt;\n&lt;li data-stringify-indent=&quot;0&quot; data-stringify-border=&quot;0&quot;&gt;Twenty (20) days of paid time off during each year of employment&lt;/li&gt;\n&lt;li data-stringify-indent=&quot;0&quot; data-stringify-border=&quot;0&quot;&gt;Paid paid vacation: An after-tax bonus of $1,000 for taking five consecutive days of vacation where you’re fully unplugged from work&lt;/li&gt;\n&lt;li data-stringify-indent=&quot;0&quot; data-stringify-border=&quot;0&quot;&gt;Ten (10) paid holidays a year&lt;/li&gt;\n&lt;li data-stringify-indent=&quot;0&quot; data-stringify-border=&quot;0&quot;&gt;Two weeks of paid sick time each year, including mental health + well being days&lt;/li&gt;\n&lt;li data-stringify-indent=&quot;0&quot; data-stringify-border=&quot;0&quot;&gt;Twelve (12) weeks paid parental leave and flexible scheduling in your child’s first year&lt;/li&gt;\n&lt;li data-stringify-indent=&quot;0&quot; data-stringify-border=&quot;0&quot;&gt;Up to six weeks of paid bereavement leave, medical leave, and disaster after six months of employment, two weeks of each paid leave in your first six months&lt;/li&gt;\n&lt;li data-stringify-indent=&quot;0&quot; data-stringify-border=&quot;0&quot;&gt;Winter Break Closure: Kit closes for a week at the end of December, giving everyone a collective break to enjoy the holiday season.&amp;nbsp;&lt;em data-stringify-type=&quot;italic&quot;&gt;Essential support services remain available, with teams coordinating to ensure coverage during this period&lt;/em&gt;&lt;/li&gt;\n&lt;li data-stringify-indent=&quot;0&quot; data-stringify-border=&quot;0&quot;&gt;Four-week, paid sabbatical after five years with the team&lt;/li&gt;\n&lt;li&gt;Fantastic in-person or virtual retreats with the team twice a year&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;&amp;nbsp;&lt;/p&gt;\n&lt;h2&gt;&lt;strong&gt;How to apply&lt;/strong&gt;&lt;/h2&gt;\n&lt;p&gt;We know that most interviewing is tough. We aim to make it as good of an experience as we can, and part of that includes keeping you informed during the process.&lt;/p&gt;\n&lt;p&gt;We usually receive a large number of applications, but hope to get through them within two weeks of the post date for the role. Don’t worry, you’ll hear from us either way.&lt;/p&gt;\n&lt;p&gt;Here’s what you can expect from our hiring process:&lt;/p&gt;\n&lt;ol&gt;\n&lt;li&gt;Recruiter phone screen&lt;/li&gt;\n&lt;li&gt;Hiring manager interview&lt;/li&gt;\n&lt;li&gt;Work Sample&lt;/li&gt;\n&lt;li&gt;A technical interview to discuss the work sample and your technical knowledge&lt;/li&gt;\n&lt;/ol&gt;\n&lt;p&gt;To get started, complete this application, including answers to the questions on the next page. &lt;strong&gt;We read every single application, and your responses to our application questions help put your experience into context.&lt;/strong&gt; We’ll keep you informed through every step.&lt;/p&gt;\n&lt;/div&gt;\n&lt;/div&gt;\n&lt;/div&gt;\n&lt;/div&gt;&lt;div class=&quot;content-conclusion&quot;&gt;&lt;hr&gt;\n&lt;p&gt;&amp;nbsp;&lt;/p&gt;\n&lt;p&gt;Kit is an equal opportunity employer. We value diversity in all of its forms, and we hire the best person we can for each role, no matter your personal background. Research tells us that applicants who are female or non-binary, as well as applicants who are people of color, are less likely to apply for roles they do not feel 100% qualified for. If you think you meet more than 50% of our requirements but fewer than 100% of them, please apply. We’re imperfect communicators, so think of our job postings as the starting point for discussion rather than proof that you shouldn’t apply.&lt;/p&gt;\n&lt;p&gt;Kit does not discriminate on the basis of race, sex, color, religion, age, national origin, marital status, disability, veteran status, genetic information, sexual orientation, gender identity or any other reason prohibited by law in provision of employment opportunities and benefits.&lt;/p&gt;&lt;/div&gt;","tags":"[\"b2c\",\"b2b\"]","pubDate":"2025-03-27T20:43:06.000Z","link":"https://job-boards.greenhouse.io/kit/jobs/4691603007","slug":"senior-product-marketing-manager-kit-7183"},{"id":9426865091,"title":"Senior Product Marketing Manager","company":"Kit","image":"https://avatars.githubusercontent.com/u/10557747?s=200&v=4","description":"&lt;div class=&quot;content-intro&quot;&gt;&lt;h4&gt;Description&lt;/h4&gt;\n&lt;div&gt;\n&lt;p class=&quot;p1&quot;&gt;Kit is an email-first operating system for creators who mean business. We help creators grow and monetize their audience with ease. For coaches, YouTubers, authors, podcasters, and other creatives, there isn’t a better marketing hub to rely on to grow audiences, automate email marketing, and sell digital products - all within one platform. More importantly, there isn’t a team more committed to helping creators earn a living.&lt;/p&gt;\n&lt;p&gt;We’re on a mission to help creators earn $1 billion using our creator marketing platform. We have always been 100% independent and 100% remote. We are proud to have built a product that our customers love, and we look for people who have enthusiasm and belief in our mission, vision, and values to join our team.&lt;/p&gt;\n&lt;p&gt;The Kit culture is one where emotional intelligence is valued, radical candor is encouraged, and where everyone works together to uphold a set of shared team principles.&lt;/p&gt;\n&lt;hr&gt;\n&lt;p&gt;&amp;nbsp;&lt;/p&gt;\n&lt;/div&gt;&lt;/div&gt;&lt;div class=&quot;page&quot;&gt;\n&lt;div class=&quot;section&quot;&gt;\n&lt;div class=&quot;layoutArea&quot;&gt;\n&lt;div class=&quot;column&quot;&gt;\n&lt;h2&gt;&lt;strong&gt;The role&lt;/strong&gt;&lt;/h2&gt;\n&lt;p&gt;We&#39;re seeking an exceptional Senior Product Marketing Manager who will play a key role in shaping the narrative around our suite of tools designed for the modern creator. In this dynamic role, you’ll balance the positioning and messaging of individual features while crafting a cohesive, compelling story for Kit as a whole.&lt;/p&gt;\n&lt;p&gt;You’ll dive deep into the diverse world of creators—from artists and bloggers to educators and entrepreneurs, uncovering their unique needs through customer research, data, and competitive insight. You’ll translate those insights into clear, differentiated messaging that resonates across the full spectrum of our audience.&lt;/p&gt;\n&lt;p&gt;This role requires a rare blend of &lt;strong&gt;strategic thinking, storytelling, and scrappy execution&lt;/strong&gt;. You know how to connect product capabilities to market opportunities, test and iterate quickly, and communicate with clarity—whether you&#39;re enabling a sales team, shaping a go-to-market plan, or influencing product direction. You thrive in cross-functional environments and bring others along with context and conviction. Join us and play a pivotal role in a team committed to empowering creators with tools that turn passion into livelihood—by telling the right stories, to the right people, at the right time.&lt;/p&gt;\n&lt;p&gt;&amp;nbsp;&lt;/p&gt;\n&lt;h2&gt;&lt;strong&gt;Responsibilities&lt;/strong&gt;&lt;/h2&gt;\n&lt;h3&gt;&lt;strong&gt;Research&lt;/strong&gt;&lt;/h3&gt;\n&lt;ul&gt;\n&lt;li&gt;Proactively gather insights from customer research, sales calls, data, and competitors to educate internal stakeholders and help inform product strategy, roadmap, pricing, and packaging.&lt;/li&gt;\n&lt;li&gt;Lead win/loss user research efforts and act as the voice of the creators we serve.&lt;/li&gt;\n&lt;/ul&gt;\n&lt;h3&gt;&lt;strong&gt;Positioning, messaging, and narrative design&lt;/strong&gt;&lt;/h3&gt;\n&lt;ul&gt;\n&lt;li&gt;Refine our target personas and value propositions. Identify product use cases that enable creators to grow their audience, connect with their audiences, and earn a living online.&lt;/li&gt;\n&lt;li&gt;Iteratively improve our positioning and messaging so that it clearly communicates our product’s value. Distill complexity into crisp messaging&lt;/li&gt;\n&lt;li&gt;Help us define a new market category for the creator space and collaboratively shape a narrative that clearly communicates the value of our offerings.&lt;/li&gt;\n&lt;/ul&gt;\n&lt;h3&gt;&lt;strong&gt;Planning and execution&lt;/strong&gt;&lt;/h3&gt;\n&lt;ul&gt;\n&lt;li&gt;Leverage and improve our go-to-market playbooks and lead the execution of product launches, ongoing feature releases, and new partnerships.&lt;/li&gt;\n&lt;li&gt;Collaborate and influence internal stakeholders, including Product, Marketing, Sales, and Support teams, to identify and support their unique needs.&lt;/li&gt;\n&lt;li&gt;Create customer-facing material, including web copy, videos, emails, case studies, blog posts, FAQs, tutorials, etc.&lt;/li&gt;\n&lt;/ul&gt;\n&lt;h3&gt;&lt;strong&gt;Analysis&lt;/strong&gt;&lt;/h3&gt;\n&lt;ul&gt;\n&lt;li&gt;Measure product marketing performance through key metrics such as revenue growth, conversion rates, monthly active users, and feature adoption.&lt;/li&gt;\n&lt;li&gt;Use large data sets to create high-confidence forecasts and growth plans to achieve company goals.&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;&amp;nbsp;&lt;/p&gt;\n&lt;p&gt;&amp;nbsp;&lt;/p&gt;\n&lt;h2&gt;The right candidate has&lt;/h2&gt;\n&lt;ul&gt;\n&lt;li&gt;Multiple years of in-house experience in product marketing for SaaS, B2C tech companies. B2B experience is a plus.&lt;/li&gt;\n&lt;li&gt;Proven understanding of segmentation strategies, developing buyer personas, articulating customer pain points, and crafting customer-facing messaging&lt;/li&gt;\n&lt;li&gt;Exceptional visual, written, spoken communication, and presentation skills&lt;/li&gt;\n&lt;li&gt;Proven Product-Led Growth (PLG) marketing experience with strong research and analytical skills&lt;/li&gt;\n&lt;li&gt;Experience supporting sales enablement through effective messaging, collateral, and tools that drive revenue and improve sales performance&lt;/li&gt;\n&lt;li&gt;Demonstrated ability to work as a team player, confidently collaborate with senior executives, and build consensus among multiple stakeholders and teams&lt;/li&gt;\n&lt;li&gt;Ability to thrive in an ambiguous, fast-paced, and flexible environment with a high degree of autonomy&lt;/li&gt;\n&lt;li&gt;Bias towards action and an operator mindset, with an understanding for the most important metrics and how to produce measurable results&lt;/li&gt;\n&lt;li&gt;Self-motivated, organized, and communicative, capable of working effectively in a 100% remote work environment&lt;/li&gt;\n&lt;li&gt;Have enthusiasm and belief in our &lt;a href=&quot;https://convertkit.com/mission&quot;&gt;mission, vision, and values&lt;/a&gt;&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;&amp;nbsp;&lt;/p&gt;\n&lt;h3&gt;Compensation and benefits&lt;/h3&gt;\n&lt;p&gt;Kit has standardized salaries based on position, no matter where you live. For this role, we’re hiring at a Level 4 ($158,000). The level is determined based on experience and our interview process.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Perks + benefits include:&lt;/strong&gt;&lt;/p&gt;\n&lt;ul&gt;\n&lt;li data-stringify-indent=&quot;0&quot; data-stringify-border=&quot;0&quot;&gt;\n&lt;div&gt;&lt;a class=&quot;c-link&quot; href=&quot;https://www.linkedin.com/posts/nathanbarry_convertkit-compensation-model-activity-6991414959247147008-i9V3/?utm_source=share&amp;amp;utm_medium=member_desktop&quot; target=&quot;_blank&quot; data-stringify-link=&quot;https://www.linkedin.com/posts/nathanbarry_convertkit-compensation-model-activity-6991414959247147008-i9V3/?utm_source=share&amp;amp;utm_medium=member_desktop&quot; data-sk=&quot;tooltip_parent&quot;&gt;Profit Sharing&lt;/a&gt;&lt;/div&gt;\n&lt;/li&gt;\n&lt;li data-stringify-indent=&quot;0&quot; data-stringify-border=&quot;0&quot;&gt;Kit equity&lt;/li&gt;\n&lt;li data-stringify-indent=&quot;0&quot; data-stringify-border=&quot;0&quot;&gt;401k with a 5% match&lt;/li&gt;\n&lt;li&gt;We cover up to $1,950 per month toward medical premiums, with dental and vision premiums fully covered. We offer Health Insurance plans through Aetna.&lt;/li&gt;\n&lt;li data-stringify-indent=&quot;0&quot; data-stringify-border=&quot;0&quot;&gt;$4,000 equipment allowance for your first two years, $3,000 budget every following two years&lt;/li&gt;\n&lt;li data-stringify-indent=&quot;0&quot; data-stringify-border=&quot;0&quot;&gt;Individual learning + development budget ($3,500/year)&lt;/li&gt;\n&lt;li data-stringify-indent=&quot;0&quot; data-stringify-border=&quot;0&quot;&gt;Gender affirming benefits&lt;/li&gt;\n&lt;li data-stringify-indent=&quot;0&quot; data-stringify-border=&quot;0&quot;&gt;Childcare benefit up to $3,000 annually&lt;/li&gt;\n&lt;li data-stringify-indent=&quot;0&quot; data-stringify-border=&quot;0&quot;&gt;Twenty (20) days of paid time off during each year of employment&lt;/li&gt;\n&lt;li data-stringify-indent=&quot;0&quot; data-stringify-border=&quot;0&quot;&gt;Paid paid vacation: An after-tax bonus of $1,000 for taking five consecutive days of vacation where you’re fully unplugged from work&lt;/li&gt;\n&lt;li data-stringify-indent=&quot;0&quot; data-stringify-border=&quot;0&quot;&gt;Ten (10) paid holidays a year&lt;/li&gt;\n&lt;li data-stringify-indent=&quot;0&quot; data-stringify-border=&quot;0&quot;&gt;Two weeks of paid sick time each year, including mental health + well being days&lt;/li&gt;\n&lt;li data-stringify-indent=&quot;0&quot; data-stringify-border=&quot;0&quot;&gt;Twelve (12) weeks paid parental leave and flexible scheduling in your child’s first year&lt;/li&gt;\n&lt;li data-stringify-indent=&quot;0&quot; data-stringify-border=&quot;0&quot;&gt;Up to six weeks of paid bereavement leave, medical leave, and disaster after six months of employment, two weeks of each paid leave in your first six months&lt;/li&gt;\n&lt;li data-stringify-indent=&quot;0&quot; data-stringify-border=&quot;0&quot;&gt;Winter Break Closure: Kit closes for a week at the end of December, giving everyone a collective break to enjoy the holiday season.&amp;nbsp;&lt;em data-stringify-type=&quot;italic&quot;&gt;Essential support services remain available, with teams coordinating to ensure coverage during this period&lt;/em&gt;&lt;/li&gt;\n&lt;li data-stringify-indent=&quot;0&quot; data-stringify-border=&quot;0&quot;&gt;Four-week, paid sabbatical after five years with the team&lt;/li&gt;\n&lt;li&gt;Fantastic in-person or virtual retreats with the team twice a year&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;&amp;nbsp;&lt;/p&gt;\n&lt;h2&gt;&lt;strong&gt;How to apply&lt;/strong&gt;&lt;/h2&gt;\n&lt;p&gt;We know that most interviewing is tough. We aim to make it as good of an experience as we can, and part of that includes keeping you informed during the process.&lt;/p&gt;\n&lt;p&gt;We usually receive a large number of applications, but hope to get through them within two weeks of the post date for the role. Don’t worry, you’ll hear from us either way.&lt;/p&gt;\n&lt;p&gt;Here’s what you can expect from our hiring process:&lt;/p&gt;\n&lt;ol&gt;\n&lt;li&gt;Recruiter phone screen&lt;/li&gt;\n&lt;li&gt;Hiring manager interview&lt;/li&gt;\n&lt;li&gt;Work Sample&lt;/li&gt;\n&lt;li&gt;A technical interview to discuss the work sample and your technical knowledge&lt;/li&gt;\n&lt;/ol&gt;\n&lt;p&gt;To get started, complete this application, including answers to the questions on the next page. &lt;strong&gt;We read every single application, and your responses to our application questions help put your experience into context.&lt;/strong&gt; We’ll keep you informed through every step.&lt;/p&gt;\n&lt;/div&gt;\n&lt;/div&gt;\n&lt;/div&gt;\n&lt;/div&gt;&lt;div class=&quot;content-conclusion&quot;&gt;&lt;hr&gt;\n&lt;p&gt;&amp;nbsp;&lt;/p&gt;\n&lt;p&gt;Kit is an equal opportunity employer. We value diversity in all of its forms, and we hire the best person we can for each role, no matter your personal background. Research tells us that applicants who are female or non-binary, as well as applicants who are people of color, are less likely to apply for roles they do not feel 100% qualified for. If you think you meet more than 50% of our requirements but fewer than 100% of them, please apply. We’re imperfect communicators, so think of our job postings as the starting point for discussion rather than proof that you shouldn’t apply.&lt;/p&gt;\n&lt;p&gt;Kit does not discriminate on the basis of race, sex, color, religion, age, national origin, marital status, disability, veteran status, genetic information, sexual orientation, gender identity or any other reason prohibited by law in provision of employment opportunities and benefits.&lt;/p&gt;&lt;/div&gt;","tags":"[\"b2c\",\"b2b\"]","pubDate":"2025-03-27T20:42:50.000Z","link":"https://job-boards.greenhouse.io/kit/jobs/4691574007","slug":"senior-product-marketing-manager-kit-6749"},{"id":8330621316,"title":"Senior Account Executive","company":"Instrumentl","image":"https://avatars.githubusercontent.com/u/43759528?s=200&v=4","description":"<div><b style=\"font-size: 24px\">Hello, we’re Instrumentl.</b></div><div><span style=\"font-size: 16px\">We’re a mission-driven startup helping the nonprofit sector to drive impact, and we’re well on our way to becoming the most-loved grant discovery and management tool. To help us get there, we’re hiring a remote <b>Senior </b></span><b style=\"font-size: 16px\">Account Executive</b><span style=\"font-size: 16px\"> to be the face of our brand for prospective customers. Our new Account Executive will have a key role in shaping the future of the Sales team, working directly with the AE Sales Manager and Head of Sales.</span></div><div><br></div><div><b style=\"font-size: 18px\">About us:</b><span style=\"font-size: 18px\">&nbsp;</span></div><div><span style=\"font-size: 16px\">Instrumentl is a hypergrowth YC-backed startup with over 3,000 nonprofit clients, from local homeless shelters to larger organizations like the San Diego Zoo and the University of Alaska. We are building the future of fundraising automation, helping nonprofits to discover, track, and manage grants efficiently through our SaaS platform.</span></div><div><br></div><div><span style=\"font-size: 16px\">Our charts are dramatically up-and-to-the-right 📈 — we’re cash flow positive and doubling year-over-year, with customers who love us (NPS is 65+ and Ellis PMF survey is 60+). Join us on this rocket ship!</span></div><div><br></div><div><b style=\"font-size: 18px\">About the role: </b></div><div><span style=\"font-size: 16px\">As a Senior Account Executive at Instrumentl, you'll deliver a&nbsp;consultative sales experience for our prospective customers. You'll be speaking to busy Executive Directors, Development Directors, Grants Managers, and professional grant writing consultants. We’ll expect you to convey warmth, kindness and competence in your approach. These folks are out there raising money to achieve their missions and you’ll help them leverage Instrumentl to get there faster!</span></div><div><br></div><div><span style=\"font-size: 16px\">Get to know us at </span><a class=\"postings-link\" style=\"font-size: 16px\" href=\"https://www.instrumentl.com/about\">instrumentl.com/about</a>.</div><div><br></div><div><span style=\"font-size: 16px\">For this position, we are looking for someone based in the continental US.</span></div><div><b style=\"font-size: 24px\">Hello, we’re Instrumentl.</b></div><div><span style=\"font-size: 16px\">We’re a mission-driven startup helping the nonprofit sector to drive impact, and we’re well on our way to becoming the most-loved grant discovery and management tool. To help us get there, we’re hiring a remote <b>Senior </b></span><b style=\"font-size: 16px\">Account Executive</b><span style=\"font-size: 16px\"> to be the face of our brand for prospective customers. Our new Account Executive will have a key role in shaping the future of the Sales team, working directly with the AE Sales Manager and Head of Sales.</span></div><div><br></div><div><b style=\"font-size: 18px\">About us:</b><span style=\"font-size: 18px\">&nbsp;</span></div><div><span style=\"font-size: 16px\">Instrumentl is a hypergrowth YC-backed startup with over 3,000 nonprofit clients, from local homeless shelters to larger organizations like the San Diego Zoo and the University of Alaska. We are building the future of fundraising automation, helping nonprofits to discover, track, and manage grants efficiently through our SaaS platform.</span></div><div><br></div><div><span style=\"font-size: 16px\">Our charts are dramatically up-and-to-the-right 📈 — we’re cash flow positive and doubling year-over-year, with customers who love us (NPS is 65+ and Ellis PMF survey is 60+). Join us on this rocket ship!</span></div><div><br></div><div><b style=\"font-size: 18px\">About the role: </b></div><div><span style=\"font-size: 16px\">As a Senior Account Executive at Instrumentl, you'll deliver a&nbsp;consultative sales experience for our prospective customers. You'll be speaking to busy Executive Directors, Development Directors, Grants Managers, and professional grant writing consultants. We’ll expect you to convey warmth, kindness and competence in your approach. These folks are out there raising money to achieve their missions and you’ll help them leverage Instrumentl to get there faster!</span></div><div><br></div><div><span style=\"font-size: 16px\">Get to know us at </span><a href=\"https://www.instrumentl.com/about\" style=\"font-size: 16px\" class=\"postings-link\">instrumentl.com/about</a>.</div><div><br></div><div><span style=\"font-size: 16px\">For this position, we are looking for someone based in the continental US.</span></div><h3>What you'll get to do:</h3><li>Become an expert on grants/institutional fundraising</li><li>Take 40-50 30-min onboarding sessions per month</li><li>Outbound into your book of business using creative tactics</li><li>Travel - we have a track record of success at conferences and industry events</li><li>Upgrade our customers’ institutional fundraising workflows and help them love the Instrumentl brand</li><li>Experiment with new onboarding flows and sales pitches to accelerate growth</li><li>Follow up with prospects and be highly responsive to their questions</li><li>Provide design and product input to the first-time user experience</li><h3>What we're looking for: </h3><li><b>Experience:</b> You have 3-4+ years of closing experience in a high-velocity customer-facing role at a SaaS company (or in a similar environment).</li><li><b>Empathy: </b>You are driven to solve the actual, underlying problem for customers, especially problems that go unsaid.</li><li><b>Curiosity:&nbsp; </b>You make an effort to understand the true nature of the problem your customers want to address so you can provide the best possible solution.</li><li><b>Grit: </b>You understand that mastery of any role requires hard work and coaching, and enjoy that challenge and journey.</li><li><b>Communication:</b> You pride yourself on your ability to communicate complex topics easily in person and in writing.</li><li><b>Drive: </b>You want to take control of your own success and build on the processes already in place.</li><li><b>Friendliness: </b>You are warm and approachable, and you genuinely enjoy communicating with others.</li><li><b>Tech savviness: </b>You have used tools like G Suite, Zoom, Slack, and Close.io, and pride yourself on adopting new technologies quickly.</li><h3>Bonus skills:</h3><li>Experience selling into the nonprofit market</li><li>Experience working in fundraising for nonprofits</li><li>Experience working in a startup environment</li><li>Experience working remotely</li><h3>Compensation & benefits: </h3><li>$90,000/year base salary + equity + uncapped commission (OTE $180,000/year)</li><li>100% covered health, dental, and vision insurance for employees, 50% for dependents</li><li>Generous PTO policy, including parental leave</li><li>401(k)</li><li>Company laptop + stipend to set up your home workstation</li><li>Company retreats for in-person time with your colleagues</li><li>Work with awesome nonprofits around the US. We partner with incredible organizations doing meaningful work, and you get to help power their success.</li><div><b style=\"font-size: 18px\">Why join Instrumentl?</b></div><div><span style=\"font-size: 16px\">Instrumentl is evolving rapidly. You’ll always have new challenges and opportunities to grow in your role - you won’t be bored! You’ll be an early member of our small but mighty team, playing a huge part in shaping our culture for the years and teammates to come.</span></div><div><br></div><div><b style=\"font-size: 16px\">At Instrumentl:</b></div><div><br></div><div><b style=\"font-size: 16px\">- We’re customer-focused. </b><span style=\"font-size: 16px\">We routinely seek feedback from our customers to improve the Instrumentl experience for everyone. Our first company value is \"The customer is the hero\" and we mean it.</span></div><div><b style=\"font-size: 16px\">- We love to experiment.</b><span style=\"font-size: 16px\"> We are constantly generating new concepts and iterating to see what works - ideation and experimentation are essential here. \"Bend the curve\" is another key company value.</span></div><div><b style=\"font-size: 16px\">- We appreciate authenticity. </b><span style=\"font-size: 16px\">We have a diverse range of life experiences, and we encourage open, clear communication with each other about the things that matter most to us.</span></div><div><b style=\"font-size: 16px\">- We’re approachable and collaborative.</b><span style=\"font-size: 16px\"> Everyone has a voice, and we’re all building Instrumentl together.</span></div><div><b style=\"font-size: 16px\">- We kick it every day with some of the nicest people in the world.</b><span style=\"font-size: 16px\"> No joke, our customers are often on the front lines educating kids, saving endangered species, and restoring watersheds. In helping them take advantage of Instrumentl’s technology, you’re helping them move the world forward.</span></div><div><br></div><div><b style=\"font-size: 18px\">Ready to apply?</b></div><div><span style=\"font-size: 16px\">Using the Apply button, please submit your responses to the prompts below:&nbsp;</span></div><div><br></div><div><b style=\"font-size: 16px\">1. Why are you interested in Instrumentl &amp; this role?</b></div><div><br></div><div><b style=\"font-size: 16px\">2. Please describe your past experience related to this role. </b><span style=\"font-size: 16px\">We are interested in learning more about your quota (or equivalent) at your most recent sales job, your performance, the customer profiles and contract sizes you’ve worked with in the past, and the highest number of customers you've closed or worked with in a single month.&nbsp;</span></div><div><br></div><div><span style=\"font-size: 16px\">If this would be your first sales role, please explain why you're interested in making the transition and how your past experience has prepared you for the AE position.</span></div><div><br></div><div><b style=\"font-size: 16px\">3. Where did you hear about this role?</b></div><div><br></div><div><span style=\"font-size: 16px\">Along with your responses, please attach your CV or resume.</span></div><div><br></div><div><i style=\"font-size: 16px\">At Instrumentl, we pride ourselves on building a diverse team from the ground up. Every role is an opportunity to teach, learn, and create some of your best work - if you’re excited to grow along with us, we encourage you to apply!</i></div>","tags":"[\"management\"]","pubDate":"2025-03-27T20:32:21.624Z","link":"https://jobs.lever.co/Instrumentl/3ff6002f-49d5-49b1-b50b-3f64ad3c2bbf","slug":"senior-account-executive-instrumentl-3333"},{"id":8292614829,"title":"Senior Product Manager","company":"Primer","image":"https://pbs.twimg.com/profile_images/1533245276764372993/AtyqkzHz_400x400.jpg","description":"<h2><strong>An Introduction to Primer</strong></h2><p style=\"min-height:1.5em\">The 21st century has witnessed remarkable expansion within the payments ecosystem with the introduction of new payment services, growth in cross-border commerce, and the development of multi-payment processor payment strategies.</p><p style=\"min-height:1.5em\">The bottom line is that payment is no longer just another step in the purchasing funnel but a strategic asset that can drive business growth and innovation.</p><p style=\"min-height:1.5em\">Enter Primer - the world's first unified payment infrastructure, empowering businesses worldwide to unleash their payment potential. By choosing our platform, merchants can take control over their payment stack, create unique commerce experiences, accelerate their roadmap and increase payment success.</p><p style=\"min-height:1.5em\">Primer's enterprise-grade infrastructure, frameworks, and tooling allow merchants to unify their disparate payment solutions and services to build optimised payment flows tailored to their unique business needs with no code or additional complexity. We strive to make something complex incredibly simple and intuitive.</p><p style=\"min-height:1.5em\">Our success so far has been reflected in the trust placed in us by category leaders such as Printify, NewLook, Voi, and Dabble, who are using Primer to transform their payments into a growth lever. Moreover, the world's top investors, including Accel, Balderton, Iconiq, and Tencent, have also invested in Primer's vision to rebuild payments and commerce from the ground up.</p><p style=\"min-height:1.5em\">Join us in shaping the future of payments and commerce. Let's pave the way for a world where businesses can fully realise their payment potential.</p><p style=\"min-height:1.5em\"></p><p style=\"min-height:1.5em\"><strong>What are we looking for?</strong></p><ul style=\"min-height:1.5em\"><li><p style=\"min-height:1.5em\"><strong>A Senior Product Manager</strong> with deep domain knowledge in treasury, accounting, finance automation, and revenue operations, especially in areas like AR/AP and FX</p></li><li><p style=\"min-height:1.5em\"><strong>Hands-on builder mentality</strong> to take a product from MVP to scale, owning the full product lifecycle in a high-impact, high-autonomy role</p></li><li><p style=\"min-height:1.5em\"><strong>Strategic thinker and doer</strong> capable of defining and executing a multi-year product strategy in a high-potential area</p></li><li><p style=\"min-height:1.5em\"><strong>End-to-end ownership</strong> of one of our two core product builds — you'll be the sole PM, shaping the roadmap, setting priorities, and driving delivery</p></li><li><p style=\"min-height:1.5em\"><strong>Experience in early-stage product environments</strong> where ambiguity is embraced and customer feedback drives rapid iteration</p></li><li><p style=\"min-height:1.5em\"><strong>Strong communicator and collaborator</strong> who can work with a domain-heavy team and bring clarity to complex product and technical decisions</p></li><li><p style=\"min-height:1.5em\"><strong>Leadership potential</strong> - while this role is currently individual contributor and hands-on, there's room to grow into a team lead as the function scales</p></li><li><p style=\"min-height:1.5em\"><strong>Prior experience in Integrations or Finance-related SaaS</strong> products is a huge plus, especially if you've worked in or adjacent to modern finance or accounting teams</p><p style=\"min-height:1.5em\"></p><p style=\"min-height:1.5em\">This position can be based <strong>ANYWHERE in Europe</strong>, working remotely 100% of the time</p><p style=\"min-height:1.5em\">Our Product &amp; Engineering teams work fully remotely across Europe and operate within local timezones - if you are not based in Europe but would still like to apply please let us know in your application</p><p style=\"min-height:1.5em\">Unfortunately we are unable to offer VISA sponsorships or relocation packages at this time<br /><br /><strong>Our interview process</strong></p><ul style=\"min-height:1.5em\"><li><p style=\"min-height:1.5em\">30 minute call with a Talent Partner</p></li><li><p style=\"min-height:1.5em\">45 minute interview with the Hiring Manager</p></li><li><p style=\"min-height:1.5em\">Take home task, followed by a 1 hr presentation</p></li><li><p style=\"min-height:1.5em\">60 minute final stage culture interview</p></li></ul></li></ul><p style=\"min-height:1.5em\"></p><h2><strong>What’s the culture like at Primer?</strong></h2><p style=\"min-height:1.5em\">We’re building a culture where people can come and do their best work and enjoy it. We want our people to be proud of the impact that they have at Primer, and of the work that they are doing. You will be working with a team of people who are mission-driven, smart, and reflective, and who are invested in building exceptional products and delivering success for our merchants <em>(and we also know how to have fun along the way).</em></p><p style=\"min-height:1.5em\">We work remotely. We believe that building a successful, profitable company goes beyond proximity. We invest in our relationships with each other through great remote working practices and thoughtfully designed face-to-face time together. Our heads-together time comes in the form of workstations, our annual company retreat, and co-working space access worldwide.</p><p style=\"min-height:1.5em\">Finally, let’s go ahead and say it. The work that we do is challenging. Startups are a challenge, building category defining products is a challenge. You should be prepared for a challenge at Primer. But, there’s a big difference between a challenge and a struggle. The key difference is that the right challenge comes with the right support structures, an acceptance that not everything always goes to plan, a collaborative environment, and a great team around you. It’s never a challenge that you will face alone.</p><p style=\"min-height:1.5em\"></p><h2><strong>Our benefits:</strong></h2><ul style=\"min-height:1.5em\"><li><p style=\"min-height:1.5em\">We are fully remote</p></li><li><p style=\"min-height:1.5em\">Competitive share options</p></li><li><p style=\"min-height:1.5em\">Uncapped holiday, with 25 days minimum to be taken</p></li><li><p style=\"min-height:1.5em\">Co-working space access</p></li><li><p style=\"min-height:1.5em\">Workations &amp; company retreat</p></li><li><p style=\"min-height:1.5em\">The best equipment for your role</p></li><li><p style=\"min-height:1.5em\">£500 towards your home office setup</p></li><li><p style=\"min-height:1.5em\">Generous learning budget</p></li><li><p style=\"min-height:1.5em\">Medical insurance</p></li><li><p style=\"min-height:1.5em\">A broad set of additional perks and benefits (<em>depending on location)</em></p></li></ul><p style=\"min-height:1.5em\"></p><h2><strong>Don’t meet every single requirement?</strong></h2><p style=\"min-height:1.5em\">At Primer, we’re dedicated to building a diverse, inclusive, and authentic workplace. If you’re excited about this role but your past experience doesn’t align perfectly with every qualification in the job description, we encourage you to apply. You may be the right candidate for this or other roles. Primer is committed to the equal treatment of all current and prospective employees, regardless of background or beliefs—see our diversity commitment statement for more details</p><p style=\"min-height:1.5em\"><a target=\"_blank\" rel=\"noopener noreferrer nofollow\" href=\"https://www.notion.so/Equity-diversity-inclusion-and-belonging-policy-7904d43d137848fda9cdc19772e43cec?pvs=21\"><strong>Equity, diversity, inclusion and belonging policy</strong></a></p><p style=\"min-height:1.5em\">Primer adopts a zero-tolerance approach to discrimination.</p><p style=\"min-height:1.5em\">We are committed to providing equal opportunities to all current and prospective employees regardless of age, disability, sex, sexual orientation, pregnancy and maternity, race or ethnicity, religion or belief, gender identity, or marriage and civil partnership.</p>","tags":"[\"finance\",\"engineering\"]","pubDate":"2025-03-27T20:31:20.671Z","link":"https://jobs.ashbyhq.com/primer.io/6a5e6bfb-171d-4460-891e-78aa37463737","slug":"senior-product-manager-primer-7084"},{"id":5771926659,"title":"Senior Product Designer","company":"Clutch","image":"https://app.ashbyhq.com/api/images/org-theme-logo/87f6e542-ae68-4ff1-ab48-f05e9dab1964/e24aecd5-3955-404a-8728-c08806c78730.png","description":"<p style=\"min-height:1.5em\"><strong>About the Role</strong></p><p style=\"min-height:1.5em\">Clutch is expanding its design team! We're seeking a seasoned senior product designer to help innovate in the fintech space, revolutionizing how credit unions operate and attract a new generation of customers.</p><p style=\"min-height:1.5em\">We appreciate designers who think deeply about people and processes, not just pixels, and love getting their hands dirty with customer research. The ideal candidate for this team has experience with building both business tools and service-oriented consumer products.</p><p style=\"min-height:1.5em\">The role requires the ability to wrangle large and complex projects all the way from co-defining the product strategy down to sweating the fine design details..</p><p style=\"min-height:1.5em\"><strong>About the Team</strong></p><p style=\"min-height:1.5em\">At Clutch, design isn't just a department—it's the driving force behind our mission. We believe a seamless user experience can empower credit unions to compete and offer superior banking to everyday people. By crafting intuitive experiences, we help credit unions guide their members toward financial freedom. </p><p style=\"min-height:1.5em\">Our growing design team is fully remote in the U.S. and Brazil. It is diverse, collaborative, ambitious and empowered to take on our company’s biggest challenges.</p><p style=\"min-height:1.5em\"><strong>What You’ll Do</strong></p><p style=\"min-height:1.5em\"><strong>Within 3 months you will:</strong></p><ul style=\"min-height:1.5em\"><li><p style=\"min-height:1.5em\"><strong>Acquire Deep Domain &amp; Process knowledge:</strong> Get fully onboarded with the credit union fintech domain, company vision, user needs, and design processes.</p></li><li><p style=\"min-height:1.5em\"><strong>Build Relationships:</strong> Establish strong collaboration with cross-functional teams, including Product, Engineering, and Customer Success</p></li><li><p style=\"min-height:1.5em\"><strong>Contribute Early:</strong> Begin contributing to ongoing design projects, in discovery, exploration, build and test phases.</p></li></ul><p style=\"min-height:1.5em\"><strong>Within 6 months you will:</strong></p><ul style=\"min-height:1.5em\"><li><p style=\"min-height:1.5em\"><strong>Lead Key Design Initiatives:</strong> Take full ownership of larger, more ambiguous, higher-impact design projects. You’ll lead end-to-end design efforts, from concept to execution, working closely with Product and Engineering teams to deliver solutions.</p></li><li><p style=\"min-height:1.5em\"><strong>Unify Products:</strong> Shape design guidelines, patterns, and best practices to ensure consistency across products. Help connect the dots across products by identifying common needs.</p></li><li><p style=\"min-height:1.5em\"><strong>Mentorship &amp; Thought Leadership:</strong> Mentor junior designers and facilitate strategic workshops and complex reviews.</p></li><li><p style=\"min-height:1.5em\"><strong>Impact on Product Roadmap:</strong> Provide key insights and design direction that help shape the product roadmap based on user research.</p></li><li><p style=\"min-height:1.5em\"><strong>Help grow the team:</strong> Interview senior candidates</p></li></ul><p style=\"min-height:1.5em\"><strong>Within 9 months, you will:</strong></p><ul style=\"min-height:1.5em\"><li><p style=\"min-height:1.5em\"><strong>Shape Design Culture:</strong> Take on an initiative around improving design culture and/or refining team processes.</p></li><li><p style=\"min-height:1.5em\"><strong>Shape Company Strategy and Roadmaps:</strong> Help identify strategic product opportunities by organizing and running vision and product exploration workshops, while aligning design goals with business objectives.</p></li><li><p style=\"min-height:1.5em\"><strong>Creative Influence Across Teams:</strong> Have a strong voice in cross-functional leadership discussions, influencing product direction and priorities.</p></li></ul><p style=\"min-height:1.5em\"><strong>What You’ll Bring</strong></p><ul style=\"min-height:1.5em\"><li><p style=\"min-height:1.5em\"><strong>Experience:</strong> At least 6 years of relevant experience as an individual contributor on an in-house product design/experience design team.</p></li><li><p style=\"min-height:1.5em\"><strong>Portfolio:</strong> A portfolio with native and/or web projects that highlights your approach to problem-solving, as well as the solutions themselves. Case studies should demonstrate your skills in research, user experience, visual design, and interaction design.</p></li><li><p style=\"min-height:1.5em\"><strong>Communication:</strong> Excellent communication and storytelling skills, in writing and in speaking. Has a well-defined design process.</p></li><li><p style=\"min-height:1.5em\"><strong>Teamwork &amp; Leadership:</strong> Experience partnering with Product, Engineering, and Sales to craft broader product strategy and execute against it.</p></li><li><p style=\"min-height:1.5em\"><strong>Mentoring:</strong> Coaching more junior designers</p></li><li><p style=\"min-height:1.5em\"><strong>Scrappiness and ambition:</strong> Ability to make a big impact in a fast-paced, can do, startup environment</p></li></ul><p style=\"min-height:1.5em\"><strong>Bonus Points:</strong></p><ul style=\"min-height:1.5em\"><li><p style=\"min-height:1.5em\">Experience with <strong>fintechs</strong> and/or <strong>credit unions</strong></p></li><li><p style=\"min-height:1.5em\">Experience designing <strong>AI Agent experiences</strong> or any aspect of designing for AI</p></li><li><p style=\"min-height:1.5em\"><strong>Service Design</strong> experience</p></li><li><p style=\"min-height:1.5em\"><strong>Systems Thinking, Systems Design</strong> experience</p></li></ul><p style=\"min-height:1.5em\"><em>Please note that this role may evolve as our business needs change, so we appreciate your flexibility and adaptability.</em></p><p style=\"min-height:1.5em\"><strong>What’s In It For You?</strong></p><ul style=\"min-height:1.5em\"><li><p style=\"min-height:1.5em\"><strong>Remote Flexibility:</strong> Enjoy the freedom of remote work from anywhere, balancing life and career seamlessly.</p></li><li><p style=\"min-height:1.5em\"><strong>Unforgettable Off-Sites:</strong> Twice a year, bond with colleagues in exciting destinations, fostering teamwork and fresh ideas.</p></li><li><p style=\"min-height:1.5em\"><strong>Paid Time Off:</strong> Enjoy flexible PTO days yearly for relaxation and rejuvenation.</p></li><li><p style=\"min-height:1.5em\"><strong>Stock Options:</strong> Joining us means having a stake in our success, so you'll receive stock options as part of your compensation package.</p></li><li><p style=\"min-height:1.5em\"><strong>Home Office Setup:</strong> Create your ideal workspace with a dedicated budget for home office essentials.</p></li><li><p style=\"min-height:1.5em\"><strong>Work Trip Budget:</strong> Grow personally and professionally with a budget for work-related trips and co-working.</p></li><li><p style=\"min-height:1.5em\"><strong>Health Coverage:</strong> Prioritize your well-being with comprehensive health and dental insurance plans.</p></li></ul><p style=\"min-height:1.5em\"><strong>About Us</strong></p><p style=\"min-height:1.5em\"><strong>Clutch</strong> is a revolutionary vertical SaaS company, proudly backed by Andreessen Horowitz (A16z), aimed at revolutionizing the way Credit Unions engage and change the lives of their members. As a champion of financial well-being, we address the urgent need for affordable lending solutions in an era where the average American grapples with over $155,000 in household debt.  Unlike traditional financial institutions, Clutch develops software to turn Credit Unions into FinTech lenders and leverage their balance sheets to responsibly lend to over 130M Americans. Our mission extends beyond mere financial transactions; we strive to fundamentally enhance the way credit unions interact with their members. By integrating cutting-edge technologies and user-centric designs, we help credit unions provide seamless digital experiences that are on par with leading tech companies. This approach not only preserves but revitalizes the longstanding tradition of community and member-focused service inherent to credit unions.</p><p style=\"min-height:1.5em\">Clutch is an equal opportunity employer. All applicants will be considered for employment without attention to race, color, religion, sex, sexual orientation, gender identity, national origin, veteran or disability status. </p><p style=\"min-height:1.5em\"><em>Our organization participates in E-Verify. Click </em><a target=\"_blank\" rel=\"noopener noreferrer\" class=\"notion-link-token notion-focusable-token notion-enable-hover\" href=\"https://www.e-verify.gov/about-e-verify/what-is-e-verify\"><em>here</em></a><em> to learn about E-Verify.</em></p>","tags":"[\"engineering\"]","pubDate":"2025-03-27T19:09:32.850Z","link":"https://jobs.ashbyhq.com/withclutch/4401609e-4550-406b-830f-44deedbd655f","slug":"senior-product-designer-clutch-433"},{"id":8458973086,"title":"Senior Salesforce Developer","company":"Blue Coding","image":"https://media.licdn.com/dms/image/C4D0BAQHlK67hgnhzQw/company-logo_200_200/0/1631346154820?e=2147483647&v=beta&t=_R2Ssj7L_f4xqmSCcq0nOLCyCz0QN2lFnHssxxhj3YY","description":"<div><i style=\"font-size: 18px\">Do you want to earn a salary in USD?&nbsp;</i></div><div><i style=\"font-size: 18px\">Would you like to work from wherever you want?</i></div><div><i style=\"font-size: 18px\">Would you like to be a part of the leading next-gen software developers?&nbsp;</i></div><div><br></div><div><b style=\"font-size: 24px\">Hi, you finally found us!</b><span style=\"font-size: 24px\">&nbsp;</span></div><div><br></div><div><b style=\"font-size: 24px\">Why work at Blue Coding?</b><span style=\"font-size: 24px\">&nbsp;</span></div><div><br></div><div>At Blue Coding we specialize in hiring excellent developers and amazing people from all over Latin America and other parts of the world. For the past 10 years, we’ve helped cutting-edge companies in the United States and Canada -both large and small, build great development teams and develop great products. Online shops, digital agencies, SaaS providers, and software consulting firms are a few of our clients. Our team of over 100 engineers is distributed in more than 10 countries across the Americas. We are a fully remote company working with a wide array of technologies and have expertise in every stage of the software development process.&nbsp;&nbsp;</div><div><br></div><div>Our team is highly connected, united, and culturally diverse, and our collaborators are involved in many initiatives around the world, from wildlife preservation to volunteering at local charities. We also participate in group activities like movie nights, trivia, and meme competitions. We stand for honesty, fairness, respect, efficiency, hard work, and cooperation.</div><div><br></div><div><b style=\"font-size: 16px;\">What are we looking for?</b></div><div><br></div><div><span style=\"font-size: 16px;\">We’re currently looking for an </span><b style=\"font-size: 16px;\">expert-level Salesforce developer</b><span style=\"font-size: 16px;\">&nbsp;to join the team of one of our international clients, who is&nbsp;a global leader in delivering customized Salesforce-based solutions for the mortgage industry. This company helps mid to large enterprises transform their operations through innovative cloud-based platforms and strategic consulting.</span></div><div><span style=\"font-size: 16px;\">The ideal candidate will have extensive experience with </span><b style=\"font-size: 16px;\">Lightning Web Components (LWC), Aura, Flows, and Apex</b><span style=\"font-size: 16px;\">, and a deep understanding of the Salesforce platform. You’ll be responsible for designing and building scalable, high-performing solutions that generate real business value.</span></div><div><span style=\"font-size: 16px;\">If you're independent, a strong communicator, a creative problem-solver, and meticulous with detail, this role could be perfect for you. All positions are </span><b style=\"font-size: 16px;\">fully remote</b><span style=\"font-size: 16px;\">, so as long as you can deliver great work, you can work from anywhere in the listed countries.</span></div><h3>Here are some of the exciting day-to-day challenges you will face in this role:</h3><li>Design, develop, and deploy Lightning components (LWC and Aura) that adhere to Salesforce best practices and design patterns</li><li>Create advanced automation solutions using Flow Builder and other declarative tools</li><li>Write efficient, maintainable Apex code for complex business requirements that cannot be met through declarative development</li><li>Troubleshoot and resolve complex technical issues in production environments</li><li>Collaborate with architects, admins, and other developers to design and implement comprehensive solutions</li><li>Stay current with Salesforce releases and implement new features where appropriate</li>,<h3>You will shine if you have:</h3><li>Expert-level proficiency in Lightning Web Components (LWC) and Aura framework</li><li>Advanced knowledge of Salesforce Flow Builder and automation tools</li><li>Strong Apex programming skills with experience optimizing code for performance and bulkification</li><li>Proficiency in JavaScript, HTML5, and CSS3</li><li>Experience with version control systems (Git) and CI/CD pipelines</li><li>Experience with integrations using REST/SOAP APIs, Apex callouts, and external systems</li><li>Excellent communication skills.</li>,<h3>Here are some of the perks we offer you:</h3><li>Salary in USD</li><li>Long-term</li><li>Flexible schedule (within US Time zones)</li><li>100% Remote</li><div><b style=\"font-size: 24px\">Hey, you are still here!</b><span style=\"font-size: 24px\">&nbsp;</span></div><div><br></div><div>So, let us ask a few questions. Do you like working in a friendly environment? Are you fluent in English? Do you have a strong work ethic, are detail-oriented and have an ownership mentality? And most importantly do you love music and puppies? If so, then what are you waiting for? Come join our team and become part of this awesome company! We will be expecting you.</div>","tags":"[\"javascript\"]","pubDate":"2025-03-27T18:52:12.549Z","link":"https://jobs.lever.co/bluecoding/29d44bdb-051f-4a89-85b4-b23e1d45f7bb","slug":"senior-salesforce-developer-blue-coding-8254"},{"id":7679019827,"title":"Chief Operating Officer (COO)","company":"Kit","image":"https://avatars.githubusercontent.com/u/10557747?s=200&v=4","description":"&lt;div class=&quot;content-intro&quot;&gt;&lt;h4&gt;Description&lt;/h4&gt;\n&lt;div&gt;\n&lt;p class=&quot;p1&quot;&gt;Kit is an email-first operating system for creators who mean business. We help creators grow and monetize their audience with ease. For coaches, YouTubers, authors, podcasters, and other creatives, there isn’t a better marketing hub to rely on to grow audiences, automate email marketing, and sell digital products - all within one platform. More importantly, there isn’t a team more committed to helping creators earn a living.&lt;/p&gt;\n&lt;p&gt;We’re on a mission to help creators earn $1 billion using our creator marketing platform. We have always been 100% independent and 100% remote. We are proud to have built a product that our customers love, and we look for people who have enthusiasm and belief in our mission, vision, and values to join our team.&lt;/p&gt;\n&lt;p&gt;The Kit culture is one where emotional intelligence is valued, radical candor is encouraged, and where everyone works together to uphold a set of shared team principles.&lt;/p&gt;\n&lt;hr&gt;\n&lt;p&gt;&amp;nbsp;&lt;/p&gt;\n&lt;/div&gt;&lt;/div&gt;&lt;h3&gt;&lt;strong&gt;The role&lt;/strong&gt;&lt;/h3&gt;\n&lt;p&gt;Kit is at an inflection point in our growth story and we’re looking for a &lt;strong&gt;Chief Operating Officer (COO)&lt;/strong&gt; to scale our financial and business operations. As COO, you will be the right hand to our CEO, translating vision into execution, maturing our operating systems, and ensuring we’re making smart, data-driven decisions to fuel sustainable growth.&lt;/p&gt;\n&lt;h3&gt;&lt;strong&gt;The team&lt;/strong&gt;&lt;/h3&gt;\n&lt;p&gt;You will work as a strategist (60%), coach (20%), and player (20%). You’ll have 3 direct reports (VP Operations, Director of Finance, Head of Data and Analytics) and 8 indirect reports across people operations, legal, and data. You can see the org chart the COO&#39;s &lt;a href=&quot;https://drive.google.com/file/d/1P6MbzKTetk-tGShGqSvoqsuMCyaN6WUz/view?usp=sharing&quot;&gt;future team here&lt;/a&gt;.&amp;nbsp;&lt;/p&gt;\n&lt;h3&gt;Your support system&lt;/h3&gt;\n&lt;p&gt;You will serve as a member of our executive team, reporting to our CEO Nathan Barry. You will have wonderful partners in our CRO, VP Product, VP Operations, and Director of Engineering as members of the executive team.&lt;/p&gt;\n&lt;h3&gt;What you&#39;ll do&lt;/h3&gt;\n&lt;ul&gt;\n&lt;li&gt;&lt;strong&gt;First week:&lt;/strong&gt; Get up to speed on Kit’s product, customers, and financial model. Meet the team and build relationships with key cross-functional partners. Assess our current financial and operational infrastructure.&lt;/li&gt;\n&lt;li&gt;&lt;strong&gt;First month:&lt;/strong&gt; Develop a clear understanding of our growth levers, key business risks, and immediate operational needs. Begin refining our financial models, linking finance and growth metrics to inform decision-making. Establish an initial perspective on operating cadences, reporting structures, and strategic planning processes.&lt;/li&gt;\n&lt;li&gt;&lt;strong&gt;First six months:&lt;/strong&gt; Implement scalable financial and operational processes that improve decision-making. Determine how we can more effectively use data to inform and drive growth. Partner with legal and compliance teams to navigate strategic and regulatory considerations. Support strategic initiatives such as evaluating M&amp;amp;A opportunities or launching new revenue streams.&lt;/li&gt;\n&lt;li&gt;&lt;strong&gt;First year:&lt;/strong&gt; Elevate Kit’s financial and operational rigor to new heights, improve how data, finance, and product support one another’s work, and set us up for sustainable, profitable growth while delivering excellent customer and team member experiences. Serve as a trusted partner to the CEO, acting as a stand-in representative when needed. In short, help us build a workplace where both people and business thrive.&lt;/li&gt;\n&lt;/ul&gt;\n&lt;h3&gt;&lt;strong&gt;What will S.E.T. you up for success&lt;/strong&gt;&lt;/h3&gt;\n&lt;p&gt;&lt;strong&gt;Skills&lt;/strong&gt;&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;Strong finance expertise, including FP&amp;amp;A, accounting, and financial modeling&lt;/li&gt;\n&lt;li&gt;Deep understanding of SaaS metrics and business health indicators&lt;/li&gt;\n&lt;li&gt;Ability to translate data into clear, actionable strategies&lt;/li&gt;\n&lt;li&gt;Strong operational leadership, with experience establishing scalable systems and frameworks&lt;/li&gt;\n&lt;li&gt;Ability to balance legal, financial, and business risk while protecting Kit’s values and commitments to customers and employees&lt;/li&gt;\n&lt;li&gt;Ability to represent the CEO in critical team and customer conversations&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;&lt;strong&gt;Experiences&lt;/strong&gt;&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;Experience leading business operations at a growing tech company ($50-100M ARR preferred)&lt;/li&gt;\n&lt;li&gt;Prior leadership experience in roles such as COO, CFO, VP of Operations, or Head of Business Operations&lt;/li&gt;\n&lt;li&gt;Built and improved strategic planning and goal-setting processes at a company of similar size&lt;/li&gt;\n&lt;li&gt;Implemented and optimized operating cadences, including meeting structures and cross-functional communication&lt;/li&gt;\n&lt;li&gt;Experience overseeing finance, data, HR, and legal teams, including managing managers&lt;/li&gt;\n&lt;li&gt;Worked in a remote-first, distributed environment, leveraging documentation and asynchronous communication effectively&lt;/li&gt;\n&lt;li&gt;Experience in bootstrapped and profitable businesses, or environments where impact was delivered with lean resources&lt;/li&gt;\n&lt;li&gt;Exposure to M&amp;amp;A, including evaluating, structuring, and integrating acquisitions&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;&lt;strong&gt;Traits&lt;/strong&gt;&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;Strategic yet hands-on and able to function as a mix of strategist, coach, and individual contributor as needed&lt;/li&gt;\n&lt;li&gt;Systems thinker who will design scalable, efficient processes that support Kit’s high-autonomy culture&lt;/li&gt;\n&lt;li&gt;Comfortable diving deep to solve problems and mobilizing resources for long-term solutions&lt;/li&gt;\n&lt;li&gt;Collaborative leader who fosters high-performance while maintaining high psychological safety&lt;/li&gt;\n&lt;li&gt;Creator economy enthusiast who is deeply interested in our mission. Bonus points for being a creator yourself&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;&lt;strong&gt;What won&#39;t set you up for success&lt;/strong&gt;&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;Wanting to build a massive team overnight—we’re a small team with a large surface area that values a high revenue per FTE&lt;/li&gt;\n&lt;li&gt;Needing rigid structure—we offer a high degree of autonomy to our team members&lt;/li&gt;\n&lt;li&gt;Expecting a big budget—we’re 100% independent, frugal, and profitable&lt;/li&gt;\n&lt;/ul&gt;\n&lt;h3&gt;Working hours and location&lt;/h3&gt;\n&lt;p&gt;We&#39;re 100% remote with team members across the globe. For this role, we’re looking for someone &lt;strong&gt;located in the United States or Canada.&lt;/strong&gt;&lt;/p&gt;\n&lt;h3&gt;Compensation and benefits&lt;/h3&gt;\n&lt;p&gt;Kit has standardized salaries based on position, no matter where you live. This role is an&amp;nbsp;&lt;strong&gt;executive level 9 ($340,000)&lt;/strong&gt;. Our other perks and benefits include:&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;&lt;a href=&quot;https://www.linkedin.com/posts/nathanbarry_convertkit-compensation-model-activity-6991414959247147008-i9V3/?utm_source=share&amp;amp;utm_medium=member_desktop&quot;&gt;Profit Sharing&lt;/a&gt;&lt;/li&gt;\n&lt;li&gt;Kit equity&lt;/li&gt;\n&lt;li&gt;401k with a 5% match&lt;/li&gt;\n&lt;li&gt;We cover up to $1,950 per month toward medical premiums, with dental and vision fully covered. We offer health insurance plans through Aetna.&lt;/li&gt;\n&lt;li&gt;$4,000 equipment allowance for your first two years, $3,000 every two years after&lt;/li&gt;\n&lt;li&gt;$3,500 annual learning and development budget&lt;/li&gt;\n&lt;li&gt;$3,000 annual childcare benefit&lt;/li&gt;\n&lt;li&gt;20 days paid time off per year&lt;/li&gt;\n&lt;li&gt;Paid paid vacation: $1,000 bonus for taking five consecutive days full unplugged&lt;/li&gt;\n&lt;li&gt;10 paid holidays per year&lt;/li&gt;\n&lt;li&gt;2 weeks of paid sick time each year, including mental health days&lt;/li&gt;\n&lt;li&gt;12 weeks paid parental leave with flexible scheduling&lt;/li&gt;\n&lt;li&gt;Up to 6 weeks of paid bereavement, medical, and disaster leave&lt;/li&gt;\n&lt;li&gt;Winter Break: Kit closes for a week at the end of December to give everyone a collective break to enjoy the holiday season.&amp;nbsp;&lt;em&gt;Essential support services remain available, with teams coordinating to ensure coverage during this period&lt;/em&gt;&lt;/li&gt;\n&lt;li&gt;4 week paid sabbatical after 5 years with the team&lt;/li&gt;\n&lt;li&gt;Fantastic in-person team retreats 2x per year&lt;/li&gt;\n&lt;/ul&gt;\n&lt;h3&gt;Interview process&lt;/h3&gt;\n&lt;p&gt;This is an important strategic hire for us. We want it to be a two-way conversation. Here’s our expected (but flexible) interview process:&lt;/p&gt;\n&lt;ol&gt;\n&lt;li&gt;Phone call with our Head of People Operations, Melissa Theiss&lt;/li&gt;\n&lt;li&gt;Conversation with our CEO, Nathan Barry&lt;/li&gt;\n&lt;li&gt;Cross-functional conversations with folks like our CRO, Dave Altarescu, and VP Product, Katie Swett-Miller&lt;/li&gt;\n&lt;li&gt;Work sample presentation to our Executive Team, plus a conversation with a Board advisor&lt;/li&gt;\n&lt;li&gt;In-person dinner with Nathan in Boise, Idaho&lt;/li&gt;\n&lt;/ol&gt;\n&lt;p&gt;To apply, we want you to answer a few written questions and submit a 3-5 minute Loom video along with your application. &lt;strong&gt;Why?&lt;/strong&gt; Because we want to hear directly from you—your thought process, communication style, and what excites you about Kit.&lt;/p&gt;\n&lt;p&gt;We’re working with an executive recruiting agency to source strong candidates, so this public application is for those who are truly invested in joining our team. If you’re excited by our mission and ready to bring operational excellence to Kit, we’d love to hear from you.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Our Head of People Operations will personally review every application within 2 weeks.&lt;/strong&gt;&lt;/p&gt;\n&lt;h3&gt;Application questions&lt;/h3&gt;\n&lt;p&gt;⏰&amp;nbsp;The deadline to apply is &lt;strong&gt;11:59 PM Pacific Time on Friday, April 11, 2025.&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Video submission&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;We want to get a sense of your career story, what drives you, and why Kit makes sense as a next step. In a 3-5 minute Loom video, please cover the following:&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;&lt;strong&gt;Your background &amp;amp; experience:&lt;/strong&gt; Share a high-level overview of your experience in finance, operations, and scaling SaaS businesses. We’re really looking for your career story and what drives you — not what we can and will read on your resume.&lt;/li&gt;\n&lt;li&gt;&lt;strong&gt;Your fit for Kit:&lt;/strong&gt; Why are you interested in this role? What excites you about Kit?&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;We’re not looking for a perfectly scripted video—just a clear, authentic response that helps us understand how you think and lead. And, if you advance in our interview process, we&#39;ll send you a Loom from our CEO, Nathan, talking about Kit&#39;s business lines, challenges, and opportunities in more detail.&amp;nbsp;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Written application questions&lt;/strong&gt;&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;Kit is a bootstrapped and profitable company that needs to make financially disciplined decisions. Walk us through a time when you developed a financial model that influenced a key business decision. How did you ensure it was accurate and actionable?&lt;/li&gt;\n&lt;li&gt;We’re looking for a COO who can mature our operational rigor as we scale. Describe a time when you implemented an operating cadence (e.g., meeting structures, planning cycles, reporting frameworks) that improved organizational effectiveness. What was the impact?&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;&amp;nbsp;&lt;/p&gt;&lt;div class=&quot;content-conclusion&quot;&gt;&lt;hr&gt;\n&lt;p&gt;&amp;nbsp;&lt;/p&gt;\n&lt;p&gt;Kit is an equal opportunity employer. We value diversity in all of its forms, and we hire the best person we can for each role, no matter your personal background. Research tells us that applicants who are female or non-binary, as well as applicants who are people of color, are less likely to apply for roles they do not feel 100% qualified for. If you think you meet more than 50% of our requirements but fewer than 100% of them, please apply. We’re imperfect communicators, so think of our job postings as the starting point for discussion rather than proof that you shouldn’t apply.&lt;/p&gt;\n&lt;p&gt;Kit does not discriminate on the basis of race, sex, color, religion, age, national origin, marital status, disability, veteran status, genetic information, sexual orientation, gender identity or any other reason prohibited by law in provision of employment opportunities and benefits.&lt;/p&gt;&lt;/div&gt;","tags":"[\"finance\",\"engineering\",\"legal\"]","pubDate":"2025-03-27T18:28:10.000Z","link":"https://job-boards.greenhouse.io/kit/jobs/4687407007","slug":"chief-operating-officer-coo-kit-9767"},{"id":2736875377,"title":"Head of Business Services","company":"Counterpart","image":"https://media.licdn.com/dms/image/v2/D560BAQEtAXn0ryOTBw/company-logo_200_200/company-logo_200_200/0/1694785555271/yourcounterpart_logo?e=1744243200&v=beta&t=-BEjbQP7PMMfAC5PtCYEgvJk4MuWZ4Bfzh54loGzpwo","description":"&lt;p&gt;&lt;strong&gt;Job Description&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;Counterpart is a management liability insurance platform for the 21st century workplace. We offer products and services to help companies align the risks and incentives of creating great organizations. Our platform is designed to measure risk more efficiently using the most advanced rating system in the industry, while also proactively mitigating the risks of our insureds.&lt;/p&gt;\n&lt;p&gt;This is a foundational role that requires strong go-to-market instincts, customer-first thinking, and a hands-on approach to building scalable programs. As Head of Business Services, you will own how we acquire, activate, and retain small business customers—from outbound sales and lifecycle marketing to onboarding, support, and partner enablement. You’ll craft and evolve our value proposition, launch multi-channel campaigns, and engage directly with customers and distribution partners to inform strategy and execution. Your work will directly impact how small businesses discover, experience, and stay with Counterpart.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;YOU WILL:&lt;/strong&gt;&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;Design &amp;amp; execute a full-funnel acquisition strategy with a strong emphasis on outbound sales &amp;amp; marketing (email, content, product).&amp;nbsp;&amp;nbsp;&lt;/li&gt;\n&lt;li&gt;Craft &amp;amp; evolve clear, compelling value propositions tailored to different small business segments.&lt;/li&gt;\n&lt;li&gt;Develop &amp;amp; optimize the customer engagement lifecycle, including onboarding, renewal, &amp;amp; post-claim experiences.&lt;/li&gt;\n&lt;li&gt;Leverage direct customer conversations, usage data, &amp;amp; industry insights to shape product strategy, enhance user experience, and refine go-to-market efforts.&lt;/li&gt;\n&lt;li&gt;Enable distribution partners to drive growth, through co-marketing initiatives, sales collateral, performance insights, and ongoing training.&lt;/li&gt;\n&lt;li&gt;Oversee the customer support experience, with a focus on scaling through partnerships, self-serve automation, and AI.&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;&lt;strong&gt;WE LOOK FOR TEAMMATES WHO ARE:&lt;/strong&gt;&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;Customer-Obsessed – Actively seeks to directly engage and understand small business customers to guide strategy and execution.&lt;/li&gt;\n&lt;li&gt;Builders – Thrives in ambiguity, enjoys creating from scratch, and iterates quickly without needing fully defined systems or handoffs.&lt;/li&gt;\n&lt;li&gt;Full-Funnel Thinkers – Connects the dots between acquisition, activation, retention, and advocacy — always thinking about the end-to-end customer journey.&lt;/li&gt;\n&lt;li&gt;Scrappy – Finds creative ways to make things happen with limited resources, whether that’s bootstrapping a campaign or testing messaging live.&lt;/li&gt;\n&lt;li&gt;Experimenters – Uses data to inform decisions, but doesn’t get stuck in analysis; has a strong bias toward launching and learning.&lt;/li&gt;\n&lt;li&gt;Collaborative – Comfortable working across Product, Sales, Marketing, and Support to get the full picture and drive aligned execution.&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;&lt;strong&gt;WHO YOU WILL WORK WITH:&lt;/strong&gt;&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;&lt;strong&gt;Tanner Hackett, CEO &amp;amp; Founder&lt;/strong&gt;: Having founded two other major startups, including Button and Lazada, Tanner now spends his time focused on mental health through his philanthropy,&lt;a href=&quot;http://openminded.org&quot;&gt; Openminded.org&lt;/a&gt;, in addition to reading, surfing, yoga, and enjoying the outdoors.&amp;nbsp;&lt;/li&gt;\n&lt;li&gt;&lt;strong&gt;Chris Shafer, Chief of Staff&lt;/strong&gt;: Chris is a published scientific author, having studied the neural correlates of gratitude at the lauded Brain and Creativity Institute. He has since helped to launch numerous businesses in which he held a variety of critical roles from product management to business operations to strategic partnerships. Chris received his bachelor’s degree in Biological Sciences from the University of Southern California.&lt;/li&gt;\n&lt;li&gt;&lt;strong&gt;Dave Lin, Product Lead: &lt;/strong&gt;Prior to joining Counterpart, Dave spent the last decade building and scaling products at Yext, Apple, Amazon, and Hookit (a San Diego-based sport sponsorship data analytics startup that was ultimately acquired). He has a MS and a BS in Electrical Engineering from University of California, San Diego.&amp;nbsp;&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;We are committed to being a welcoming and inclusive workplace for everyone, and we are intentional about making sure people feel respected, supported and connected at work—regardless of who you are or where you come from. We value and celebrate our differences and we believe being open about who we are allows us to do the best work of our lives.&lt;/p&gt;\n&lt;p&gt;We are an Equal Opportunity Employer. We do not discriminate against qualified applicants or employees on the basis of race, color, religion, gender identity, sex, sexual preference, sexual identity, pregnancy, national origin, ancestry, citizenship, age, marital status, physical disability, mental disability, medical condition, military status, or any other characteristic protected by federal, state, or local law, rule, or regulation.&lt;/p&gt;","tags":"[\"management\",\"engineering\"]","pubDate":"2025-03-27T18:22:51.000Z","link":"https://job-boards.greenhouse.io/counterpart/jobs/4315069005","slug":"head-of-business-services-counterpart-419"},{"id":6214964063,"title":"FP&A Analyst (Remote - Work from Anywhere)","company":"Xapo Bank","image":"https://avatars.githubusercontent.com/u/6930305?s=200&v=4","description":"&lt;div class=&quot;content-intro&quot;&gt;&lt;p style=&quot;text-align: left;&quot;&gt;&lt;span style=&quot;font-weight: 900;&quot;&gt;Work from anywhere, impact everywhere&amp;nbsp;&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;Diversity is at the heart of who we are at Xapo Bank. We’re a fully distributed team of over 140 Xapiens that work remotely from 40+ countries around the world.&amp;nbsp;&lt;/p&gt;\n&lt;p&gt;Our beginning: A world that enjoys economic freedom and wealth protection, no matter where you live or who is running your country.&lt;/p&gt;\n&lt;p&gt;To achieve that, we search the world for the best people for the job. We work hard, think globally, and inspire each other to learn and grow. We are committed to changing the way things are done.&lt;/p&gt;\n&lt;p&gt;&amp;nbsp;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Risk is inherent in all of our business activities and managing risk well is the responsibility of every Xapien. Sound risk management enables us to serve our customers and deliver value for our shareholders, and helps make Xapo a great place to work.&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&amp;nbsp;&lt;/p&gt;\n&lt;p style=&quot;text-align: left;&quot;&gt;&lt;em&gt;&lt;span style=&quot;font-weight: 500;&quot;&gt;Although we are headquartered in Gibraltar, this is a full time, 100% remote position&amp;nbsp;&lt;br&gt;&lt;/span&gt;&lt;/em&gt;&lt;em&gt;&lt;span style=&quot;font-weight: 500;&quot;&gt;Work from anywhere!&lt;/span&gt;&lt;/em&gt;&lt;/p&gt;\n&lt;p style=&quot;text-align: left;&quot;&gt;&amp;nbsp;&lt;/p&gt;&lt;/div&gt;&lt;p&gt;&lt;strong&gt;&lt;em&gt;Position overview&lt;/em&gt;&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;We are seeking a highly motivated and detail-oriented FP&amp;amp;A Analyst to join our growing Finance team. This role will provide critical support in financial planning, forecasting, and analysis, contributing to the strategic decision-making process. The ideal candidate will possess strong analytical skills, a passion for data and crypto, and a desire to learn and grow within a fast-paced environment.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;&lt;em&gt;Responsibilities&lt;/em&gt;&lt;/strong&gt;&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;Assist in the preparation of monthly, quarterly, and annual financial forecasts and budgets.&lt;/li&gt;\n&lt;li&gt;Analyze financial data, identify trends, and provide insights to support business decisions.&lt;/li&gt;\n&lt;li&gt;Prepare and distribute regular financial reports, including variance analysis and performance dashboards.&lt;/li&gt;\n&lt;li&gt;Support the development and maintenance of financial models and forecasting tools.&lt;/li&gt;\n&lt;li&gt;Assist in the preparation of presentations for senior management and stakeholders.&lt;/li&gt;\n&lt;li&gt;Conduct ad-hoc financial analysis and reporting as needed.&lt;/li&gt;\n&lt;li&gt;Assist in the preparation of business cases for new initiatives and investments.&lt;/li&gt;\n&lt;li&gt;Collaborate with cross-functional teams to gather financial data and ensure data accuracy.&lt;/li&gt;\n&lt;li&gt;Monitor and track key performance indicators (KPIs) and provide recommendations for improvement.&lt;/li&gt;\n&lt;li&gt;Assist with the month-end and year-end closing processes.&lt;/li&gt;\n&lt;li&gt;Contribute to the continuous improvement of FP&amp;amp;A processes and procedures.&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;&lt;strong&gt;&lt;em&gt;Skills needed&lt;/em&gt;&lt;/strong&gt;&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;Education: Bachelor&#39;s degree in Finance, Accounting, Economics, or a related field.&lt;/li&gt;\n&lt;li&gt;Experience: 2-3 years of experience in financial analysis, preferably in the fintech or financial services industry.&amp;nbsp;&amp;nbsp;&lt;/li&gt;\n&lt;li&gt;Experience with financial modeling and data analysis.&lt;/li&gt;\n&lt;li&gt;Experience with financial reporting.&lt;/li&gt;\n&lt;li&gt;Experience working with Excel is essential.&lt;/li&gt;\n&lt;li&gt;Strong analytical and problem-solving skills.&lt;/li&gt;\n&lt;li&gt;Proficiency in Microsoft Excel/ Google sheets, including financial modeling and data analysis.&lt;/li&gt;\n&lt;li&gt;Familiarity with financial reporting and accounting principles.&lt;/li&gt;\n&lt;li&gt;Excellent communication and interpersonal skills.&lt;/li&gt;\n&lt;li&gt;Ability to work independently and as part of a team.&amp;nbsp;&amp;nbsp;&lt;/li&gt;\n&lt;li&gt;Strong attention to detail and accuracy.&amp;nbsp;&amp;nbsp;&lt;/li&gt;\n&lt;li&gt;Passion for fintech and the crypto space and a desire to learn about the financial services industry.&lt;/li&gt;\n&lt;li&gt;Experience with financial planning software (e.g.Anaplan) is a plus.&lt;/li&gt;\n&lt;li&gt;Experience with ERP software (e.g.Netsuite) is a plus.&lt;/li&gt;\n&lt;li&gt;Experience with data software (e.g.Looker) is a plus.&lt;/li&gt;\n&lt;li&gt;Basic knowledge of SQL or other database querying languages is a plus.&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;&lt;strong&gt;&lt;em&gt;Other requirements&lt;/em&gt;&lt;/strong&gt;&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;A dedicated workspace.&lt;/li&gt;\n&lt;li&gt;A reliable internet connection with the fastest speed possible in your area.&lt;/li&gt;\n&lt;li&gt;Devices and other essential equipment that meet minimal technical specifications.&lt;/li&gt;\n&lt;li&gt;Alignment with Our Values and the Xapo Values-Driven Leadership principles.&lt;/li&gt;\n&lt;/ul&gt;&lt;div class=&quot;content-conclusion&quot;&gt;&lt;p&gt;&lt;span style=&quot;font-size: 12pt;&quot;&gt;&lt;strong&gt;Why work for Xapo?&lt;/strong&gt;&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span style=&quot;font-weight: 500; font-size: 10pt;&quot;&gt;IMPACT GLOBALLY, WORK REMOTELY.&lt;/span&gt;&lt;/p&gt;\n&lt;ul&gt;\n&lt;li style=&quot;font-weight: 500;&quot;&gt;&lt;strong&gt;Shape the Future:&lt;/strong&gt;&lt;span style=&quot;font-weight: 500;&quot;&gt; Improve lives through cutting-edge technology, work 100% remotely from anywhere in the world.&lt;/span&gt;&lt;/li&gt;\n&lt;li style=&quot;font-weight: 500;&quot;&gt;&lt;strong&gt;Great work-life balance:&lt;/strong&gt;&lt;span style=&quot;font-weight: 500;&quot;&gt; &lt;/span&gt;&lt;span style=&quot;font-weight: 500;&quot;&gt;Build amazing things with a balance of autonomy and collaborative teamwork. Set your own work schedule and make use of a flexible PTO plan when you need to recharge.&lt;/span&gt;&lt;span style=&quot;font-weight: 500;&quot;&gt;&amp;nbsp;&lt;/span&gt;&lt;/li&gt;\n&lt;li style=&quot;font-weight: 500;&quot;&gt;&lt;strong&gt;Expect Excellence:&lt;/strong&gt;&lt;span style=&quot;font-weight: 500;&quot;&gt; Collaborate, learn, and grow with a high-performance team. Learn&lt;/span&gt;&lt;span style=&quot;font-weight: 500;&quot;&gt; how you learn best - from books to conferences, you’ll get a yearly budget for your individual learning and development goals.&lt;/span&gt;&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;&lt;strong&gt;At Xapo, we prioritize consumer protection and adhere to regulatory requirements by ensuring that all Xapiens are accountable for upholding principles of fair treatment, transparency, and ethical conduct in their interactions with customers and stakeholders.&lt;br&gt;&lt;br&gt;&lt;span style=&quot;text-decoration: underline;&quot;&gt;Xapo Device Policy&lt;br&gt;&lt;/span&gt;&lt;/strong&gt;Consultants joining Xapo Bank must comply with the Xapo Device Policy, which governs the use of corporate-approved laptops under Corporate-Owned, Personally Purchased Device (reimbursed up to $1,500) or Corporate-Owned, Personally Enabled Device (personal device with enforced security controls).&lt;br&gt;All devices must meet security requirements, enroll in Xapo’s Mobile Device Management (MDM), and adhere to compliance rules. COPPD devices remain Xapo property with buyback options upon exit. COPED users agree to data control measures, including mandatory corporate data wipes.&lt;br&gt;Compliance with the Xapo Device Policy is mandatory for all consultants, onboarding will not proceed without adherence to the policy.&lt;strong&gt;&lt;br&gt;&lt;br&gt;&lt;/strong&gt;&lt;/p&gt;&lt;/div&gt;","tags":"[\"finance\",\"management\",\"database\"]","pubDate":"2025-03-27T17:15:33.000Z","link":"https://job-boards.greenhouse.io/xapo61/jobs/6512385003","slug":"fp-a-analyst-remote-work-from-anywhere-xapo-bank-5100"},{"id":6022069138,"title":"Support Engineer (APAC - Weekends)","company":"Supabase","image":"https://avatars.githubusercontent.com/u/54469796?s=200&v=4","description":"<p style=\"min-height:1.5em\">Supabase is an open-source database platform built by developers for developers. Supabase adds auth, realtime, storage, restful APIs, and edge functions to Postgres.</p><p style=\"min-height:1.5em\">We are seeking Support Engineers to provide world-class <strong>developer support</strong> for anyone experiencing issues or seeking guidance when using Supabase. The support team is globally distributed with a strong focus on minimizing time to fix, and works closely with the product engineering and growth teams.</p><p style=\"min-height:1.5em\"><strong>You will:</strong></p><ul style=\"min-height:1.5em\"><li><p style=\"min-height:1.5em\">Provide initial and timely responses to all support cases for a variety of topics, from billing or pre-sales requests to optimization or implementation questions.</p></li><li><p style=\"min-height:1.5em\">Triage support cases including directing users to previous answers, code examples, documentation, or escalating to specific technical or business team members.</p></li><li><p style=\"min-height:1.5em\">Monitor multiple feedback channels, e.g. Github Issues &amp; Discussions (check them here: <a target=\"_blank\" rel=\"noopener noreferrer nofollow\" href=\"https://github.com/supabase/supabase/issues\">https://github.com/supabase/supabase/issues</a>).</p></li><li><p style=\"min-height:1.5em\">Identify where internal tooling might be developed or obtained to improve support efficiency.</p></li><li><p style=\"min-height:1.5em\">Reproduce issues, create test cases and improve test coverage, if you have experience with testing.</p></li></ul><p style=\"min-height:1.5em\"><strong>You are:</strong></p><ul style=\"min-height:1.5em\"><li><p style=\"min-height:1.5em\">Experienced in customer support, with 3+ years of experience providing developer support to technical customers.</p></li><li><p style=\"min-height:1.5em\">Proficient in SQL (ideally PostgreSQL). You feel comfortable with complex SQL queries. If you have a database administration experience, it’s a plus.</p></li><li><p style=\"min-height:1.5em\">Excellent communication skills and fluency in English.</p></li><li><p style=\"min-height:1.5em\">Skilled in using Linux/Unix operating systems and the command line.</p></li><li><p style=\"min-height:1.5em\">Experienced working with GitHub Issues and Discussions.</p></li><li><p style=\"min-height:1.5em\">Bonus points if you're familiar with popular JavaScript frameworks like React, Vue, and Svelte and have some experience with Node.js.</p></li><li><p style=\"min-height:1.5em\">Having a degree in Computer Science is a plus too.</p></li></ul><h3>Timezones &amp; Logistics</h3><ul style=\"min-height:1.5em\"><li><p style=\"min-height:1.5em\">It’s a full-time position permanently, with four 10-hour shifts covering weekends during APAC Hours: 00:00-10:00 UTC</p></li><li><p style=\"min-height:1.5em\">We are primarily looking for someone in Southeast Asia or India time zones for this shift.</p></li><li><p style=\"min-height:1.5em\">This position covers Friday → Monday based on the above UTC times, so this may vary slightly for your specific timezone.</p></li></ul><h3>We offer</h3><ul style=\"min-height:1.5em\"><li><p style=\"min-height:1.5em\">100% remote work. No location-based adjustment to your salary.</p></li><li><p style=\"min-height:1.5em\">Autonomous work. We work collaboratively on projects, but you set your own pace.</p></li><li><p style=\"min-height:1.5em\">Health, Vision and Dental benefits. Supabase covers 100% of the cost for employees and 80% for dependents</p></li><li><p style=\"min-height:1.5em\">Tech Allowance for any office setup you need</p></li><li><p style=\"min-height:1.5em\">Annual Education Allowance</p></li><li><p style=\"min-height:1.5em\">Annually run off-sites.</p></li></ul><h2>About the team</h2><ul style=\"min-height:1.5em\"><li><p style=\"min-height:1.5em\">We're a startup. It's unstructured.</p></li><li><p style=\"min-height:1.5em\">Collectively founded more than 30 startups.</p></li><li><p style=\"min-height:1.5em\">Globally distributed team with more than 30 different nationalities.</p></li><li><p style=\"min-height:1.5em\">We deeply believe in <a target=\"_blank\" rel=\"noopener noreferrer nofollow\" href=\"https://supabase.com/blog/2022/03/25/should-i-open-source-my-company\">the efficacy of collaborative open source</a>. We support existing communities and tools, rather than building \"yet another xx\".</p></li><li><p style=\"min-height:1.5em\">We \"dogfood\" everything. If you use it in your project, we use it in Supabase.</p></li></ul><h2>Process</h2><ul style=\"min-height:1.5em\"><li><p style=\"min-height:1.5em\">The entire process is fully remote and all communication will happen over email or via video chat.</p></li><li><p style=\"min-height:1.5em\">Once you've submitted your application, the team will review your submission and may reach out for a short screening interview over a video call.</p></li><li><p style=\"min-height:1.5em\">If you pass the screen you will be invited to up to four follow-up interviews. </p></li><li><p style=\"min-height:1.5em\">The calls:</p><ul style=\"min-height:1.5em\"><li><p style=\"min-height:1.5em\">usually take between 20-45 minutes each depending on the interviewer.</p></li><li><p style=\"min-height:1.5em\">most of the time, are all 1:1.</p></li><li><p style=\"min-height:1.5em\">will be with the founders, a member of either the growth or engineering team (depending on the role) and usually one other person from your immediate team or function.</p></li></ul></li><li><p style=\"min-height:1.5em\">Once the interviews are over, the team will meet to discuss several roles and candidates and may:</p><ul style=\"min-height:1.5em\"><li><p style=\"min-height:1.5em\">ask one or two follow-up questions over email or a quick call.</p></li><li><p style=\"min-height:1.5em\">go directly to making an offer.</p></li></ul></li></ul>","tags":"[\"postgres\",\"javascript\",\"engineering\",\"database\"]","pubDate":"2025-03-27T16:07:38.260Z","link":"https://jobs.ashbyhq.com/supabase/4857bb69-da99-4027-87f1-a6a4d03699b3","slug":"support-engineer-apac-weekends-supabase-1577"},{"id":7766287850,"title":"US Board-Certified Physician (with Medical License in Puerto Rico)","company":"Winona","image":"https://yt3.googleusercontent.com/k45HnnNMWgPv-xF3D-u2ThxmesDOeU0p02rNJpbRWLes2Z18WpkLgXEE7XuBLkkzN_38AFnp3A=s160-c-k-c0x00ffffff-no-rj","description":"<p style=\"min-height:1.5em\"><strong>About Winona:</strong></p><p style=\"min-height:1.5em\"><a target=\"_blank\" rel=\"noopener noreferrer nofollow\" href=\"https://bywinona.com/\">Winona</a> is one of the leading telemedicine companies providing HRT for women in menopause. We’ve built all of our technology in house including an EHR, patient care admin system, patient portal, website, marketing technology etc. Winona has two compounding pharmacies and a team of in house physicians providing world-class care via a fully vertically integrated business model.</p><p style=\"min-height:1.5em\"></p><p style=\"min-height:1.5em\"><strong>About the role:</strong></p><p style=\"min-height:1.5em\">Winona is looking to hire a <strong>part-time remote US Board-Certified Physician (with Medical License in Puerto Rico)</strong>. For this role, you will assist and manage patients’ health concerns and conditions. This is asynchronous telehealth, which is fully remote and can be done at your leisure, with no real-time patient interaction. The expectation on your availability will only be 1 hour per day or less.</p><p style=\"min-height:1.5em\"></p><p style=\"min-height:1.5em\"><strong>Seniority Level: </strong>Senior Executive</p><p style=\"min-height:1.5em\"></p><p style=\"min-height:1.5em\"><strong>Responsibilities:</strong></p><ul style=\"min-height:1.5em\"><li><p style=\"min-height:1.5em\">Discussing and reviewing patients’ medical history, symptoms, allergies, and current medications.</p></li><li><p style=\"min-height:1.5em\">Asking patients situation-specific questions to formulate accurate diagnoses.</p></li><li><p style=\"min-height:1.5em\">Formulating suitable treatment plans to address non-threatening conditions.</p></li><li><p style=\"min-height:1.5em\">Prescribing various diagnostic tests to aid in providing accurate diagnoses.</p></li><li><p style=\"min-height:1.5em\">Analyzing diagnostic test results and explaining them to patients.</p></li><li><p style=\"min-height:1.5em\">Prescribing suitable medications to patients and providing proper dosage and administration instructions.</p></li><li><p style=\"min-height:1.5em\">Maintaining accurate records of patient’s contact details, medical history, prescribed medications, allergies, diagnoses, and progress.</p></li><li><p style=\"min-height:1.5em\">Advising patients on suitable diets and exercise regimens to improve their overall health.</p></li><li><p style=\"min-height:1.5em\">Assisting patients in managing health conditions.</p><p style=\"min-height:1.5em\"></p></li></ul><p style=\"min-height:1.5em\"><strong>Requirements:</strong></p><ul style=\"min-height:1.5em\"><li><p style=\"min-height:1.5em\">US board-certified physician</p></li><li><p style=\"min-height:1.5em\">Medical license in Puerto Rico</p></li><li><p style=\"min-height:1.5em\">Sound medical knowledge</p></li><li><p style=\"min-height:1.5em\">The ability to consult with patients through virtual communication channels</p></li><li><p style=\"min-height:1.5em\">Excellent analytical and problem-solving skills</p></li><li><p style=\"min-height:1.5em\">Exceptional communication skills</p></li><li><p style=\"min-height:1.5em\">A patient and compassionate disposition</p></li><li><p style=\"min-height:1.5em\">Detail-oriented</p><p style=\"min-height:1.5em\"></p></li></ul><p style=\"min-height:1.5em\"><strong>Nice to have:</strong></p><ul style=\"min-height:1.5em\"><li><p style=\"min-height:1.5em\">Multiple medical licenses</p></li></ul><p style=\"min-height:1.5em\"></p><p style=\"min-height:1.5em\"><strong>What’s in it for you?</strong></p><p style=\"min-height:1.5em\">As a part-time member of our team, you’ll enjoy:</p><ul style=\"min-height:1.5em\"><li><p style=\"min-height:1.5em\">Flexible hours</p></li><li><p style=\"min-height:1.5em\">Work wherever you choose</p></li><li><p style=\"min-height:1.5em\">Performance-based bonuses</p></li><li><p style=\"min-height:1.5em\">Referral bonuses</p></li><li><p style=\"min-height:1.5em\">Fun and casual work environment</p></li><li><p style=\"min-height:1.5em\">Employee engagement activities and virtual gatherings</p></li><li><p style=\"min-height:1.5em\">We are a diverse, global team! 🌍</p></li></ul><p style=\"min-height:1.5em\"></p><p style=\"min-height:1.5em\"><em><strong>Equal Employment Opportunity</strong></em></p><p style=\"min-height:1.5em\"><em>Winona provides equal employment opportunities to all qualified individuals without regard to race, color, religion, sex, gender identity, sexual orientation, pregnancy, age, national origin, physical or mental disability, military or veteran status, genetic information, or any other protected classification. Equal employment opportunity extends to all aspects of employment including, but not limited to, recruitment, hiring, training, promotion, demotion, transfer, leaves of absence, and termination. Winona takes allegations of discrimination, harassment, and retaliation seriously and will promptly investigate such behaviors.</em></p>","tags":"[]","pubDate":"2025-03-27T15:31:19.704Z","link":"https://jobs.ashbyhq.com/winona/41506594-d0cf-4506-b566-1790beb1004a","slug":"us-board-certified-physician-with-medical-license-in-puerto-rico-winona-4519"},{"id":9690450228,"title":"Financial Accountant","company":"Nethermind","image":"https://avatars.githubusercontent.com/u/43478154?s=200&v=4","description":"&lt;div class=&quot;content-intro&quot;&gt;&lt;h2&gt;What are we all about?&lt;/h2&gt;\n&lt;p&gt;We are a team of builders and researchers on a mission to empower enterprises and developers worldwide to access and build on decentralized systems.&lt;/p&gt;\n&lt;p&gt;Our expertise covers several domains: Ethereum and Starknet protocol engineering, layer-2, AI, cryptography research, protocol research, decentralized finance (DeFi), security auditing, formal verification, real-time monitoring, smart contract development, and dapps and enterprise engineering.&lt;/p&gt;\n&lt;p&gt;Working to solve some of the most challenging problems in the blockchain space, we frequently collaborate with renowned companies, such as Ethereum Foundation, Starknet Foundation, Gnosis Chain, Flashbots, Forta Protocol, Lido, EigenLayer, Open Zeppelin, RISCZero, Aleph Zero, and many more.&lt;/p&gt;\n&lt;p&gt;Today, we are a 350+ strong team working remotely across 66+ countries.&lt;/p&gt;\n&lt;p&gt;View all our open positions here: &lt;a href=&quot;https://www.nethermind.io/open-roles&quot;&gt;https://www.nethermind.io/open-roles&amp;nbsp;&lt;/a&gt;&lt;/p&gt;&lt;/div&gt;&lt;p&gt;The Financial Accountant is&amp;nbsp;&lt;strong&gt;r&lt;/strong&gt;esponsible for assisting the Head of the Finance and Operations team with the day-to-day running of the finance function;&lt;/p&gt;\n&lt;h3&gt;Objectives:&lt;/h3&gt;\n&lt;ul&gt;\n&lt;li&gt;To ensure the company has accurate financial books and records that are up-to-date&lt;/li&gt;\n&lt;li&gt;To ensure that the company has the right data to be able to make informed decisions&lt;/li&gt;\n&lt;li&gt;To assist the Head of Finance in building a scalable, efficient, and successful finance function and team&lt;/li&gt;\n&lt;/ul&gt;\n&lt;h3&gt;Responsibilities:&lt;/h3&gt;\n&lt;ul&gt;\n&lt;li&gt;Bookkeeping: Maintain accurate and up-to-date financial records by recording transactions in journals, ledgers, and accounting software.&lt;/li&gt;\n&lt;li&gt;Accounts Payable: Process invoices from suppliers, verify expenses, and prepare payments in a timely manner.&lt;/li&gt;\n&lt;li&gt;Accounts Receivable: Issue invoices to customers, track receivables, and follow up on overdue payments.&lt;/li&gt;\n&lt;li&gt;Bank Reconciliation: Reconcile bank statements with general ledger accounts to ensure accuracy and identify discrepancies.&lt;/li&gt;\n&lt;li&gt;Assisting with Month-End Close: Prepare journal entries, accruals, and prepayments to facilitate the month-end closing process.&lt;/li&gt;\n&lt;li&gt;Financial Reporting: Assist in the preparation of financial statements, including profit and loss statements, balance sheets, and cash flow statements.&lt;/li&gt;\n&lt;li&gt;VAT Returns: Calculate and submit Value Added Tax (VAT) returns to HM Revenue &amp;amp; Customs (HMRC) in compliance with regulations.&lt;/li&gt;\n&lt;li&gt;Expense Management: Review employee expense reports, ensure compliance with company policies, and process reimbursements.&lt;/li&gt;\n&lt;li&gt;Assisting with Audits: Provide support during internal and external audits by preparing audit schedules, gathering documentation, and addressing auditor inquiries.&lt;/li&gt;\n&lt;li&gt;Ad Hoc Financial Analysis: Assist senior accountants or management with ad hoc financial analysis, budgeting, and forecasting tasks as required.&lt;/li&gt;\n&lt;li&gt;Compliance: Stay updated on changes in accounting regulations and ensure compliance with UK Generally Accepted Accounting Principles (UK GAAP) or International Financial Reporting Standards (IFRS).&lt;/li&gt;\n&lt;li&gt;Communication: Collaborate with colleagues in finance, as well as other departments, to address accounting-related queries and provide financial information as needed.&lt;/li&gt;\n&lt;li&gt;Process Improvement: Identify opportunities to streamline accounting processes, enhance efficiency, and strengthen internal controls.&lt;/li&gt;\n&lt;li&gt;Software Proficiency: Utilize accounting software (e.g., QuickBooks, Xero) and Microsoft Excel proficiently to perform tasks efficiently and accurately.&lt;/li&gt;\n&lt;li&gt;Professional Development: Pursue continuous learning and development opportunities to enhance accounting knowledge and skills.&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;&lt;strong&gt;Skills:&lt;/strong&gt;&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;Bachelor’s degree in finance or any related field with 2 years of post qualification experience&lt;/li&gt;\n&lt;li&gt;Big 4 Background or equivalent&lt;/li&gt;\n&lt;li&gt;Knowledge of UK tax law and HMRC&lt;/li&gt;\n&lt;li&gt;Knowledge of IFRS&lt;/li&gt;\n&lt;li&gt;Strong numerical skills to help drive Nethermind&#39;s financial operations and improve financial performance&lt;/li&gt;\n&lt;li&gt;Ability to collaborate with all levels of management to organize, plan and achieve Nethermind’s financial goals&lt;/li&gt;\n&lt;li&gt;Proficiency in financial management software (including Xero and MS Excel)&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;&lt;strong&gt;Would be beneficial if you had:&lt;/strong&gt;&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;Experience in blockchain (especially Ethereum) or crypto industry&lt;/li&gt;\n&lt;li&gt;Experience in Fintech&lt;/li&gt;\n&lt;li&gt;Previous experience with in-house accounting in a start-up environment&lt;/li&gt;\n&lt;li&gt;Fully remote setting work experience&lt;/li&gt;\n&lt;li&gt;Knowledge of US GAAP&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;&amp;nbsp;&lt;/p&gt;\n&lt;p&gt;&amp;nbsp;&lt;/p&gt;&lt;div class=&quot;content-conclusion&quot;&gt;&lt;div&gt;&lt;span style=&quot;font-size: 8pt;&quot;&gt;&lt;em&gt;&lt;span style=&quot;text-decoration: underline;&quot;&gt;&lt;strong&gt;Disclaimer&lt;/strong&gt;&lt;/span&gt;: I hereby consent to my personal information being stored and processed by Demerzel Solutions Limited (t/a Nethermind) (the “Company”) for recruitment purposes in relation to both the selected job role and any other role the Company considers me a qualified candidate for. All data storing and processing by the Company takes place in accordance with the UK GDPR. Kindly refer to our privacy policy for more details.&amp;nbsp;&lt;/em&gt;&lt;/span&gt;&lt;br&gt;&lt;span style=&quot;font-size: 8pt;&quot;&gt;&lt;em&gt;Your consent to share personal information is entirely voluntary, and you may withdraw your consent at any time. Should you have any questions about this process, or wish to withdraw your consent please contact: legalnotices@nethermind.io&amp;nbsp;&lt;/em&gt;&lt;/span&gt;&lt;br&gt;&lt;br&gt;Keep up to date on what we are working on by following&amp;nbsp;&lt;span class=&quot;il&quot;&gt;us&lt;/span&gt;&amp;nbsp;on &lt;strong&gt;our social channels&lt;br&gt;&lt;br&gt;&lt;/strong&gt;&lt;/div&gt;\n&lt;div&gt;&lt;a href=&quot;https://twitter.com/nethermindeth&quot; target=&quot;_blank&quot;&gt;&lt;img src=&quot;https://cdn4.iconfinder.com/data/icons/social-media-icons-the-circle-set/48/twitter_circle-512.png&quot; alt=&quot;&quot; width=&quot;50&quot; height=&quot;50&quot;&gt;&lt;/a&gt; &amp;nbsp; &lt;a href=&quot;https://discord.com/invite/PaCMRFdvWT&quot; target=&quot;_blank&quot;&gt;&lt;img src=&quot;https://cdn3.iconfinder.com/data/icons/popular-services-brands-vol-2/512/discord-1024.png&quot; alt=&quot;&quot; width=&quot;49&quot; height=&quot;49&quot;&gt;&lt;/a&gt; &amp;nbsp; &lt;a href=&quot;https://www.linkedin.com/company/nethermind/mycompany/&quot; target=&quot;_blank&quot;&gt;&lt;img src=&quot;https://cdn1.iconfinder.com/data/icons/logotypes/32/circle-linkedin-1024.png&quot; alt=&quot;&quot; width=&quot;49&quot; height=&quot;49&quot;&gt;&lt;/a&gt;&lt;/div&gt;\n&lt;div&gt;&amp;nbsp;&lt;/div&gt;\n&lt;div&gt;&lt;strong&gt;&lt;a href=&quot;https://www.nethermind.io/legal&quot; target=&quot;_blank&quot;&gt;&lt;em&gt;Click here to view our Privacy Policy.&lt;/em&gt;&lt;/a&gt;&lt;/strong&gt;&lt;/div&gt;&lt;/div&gt;","tags":"[\"finance\",\"management\",\"engineering\",\"legal\"]","pubDate":"2025-03-27T08:53:48.000Z","link":"https://job-boards.eu.greenhouse.io/nethermind/jobs/4564435101","slug":"financial-accountant-nethermind-9908"},{"id":5568271211,"title":"Senior Product Manager","company":"Tabby","image":"https://remotive.com/job/1988823/logo","description":"<div><!--block--><strong>Tabby</strong> creates financial freedom in the way people shop, earn, and save, by reshaping their relationship with money.</div>\n<div><!--block--></div>\n<div><!--block-->The company’s flagship offering allows shoppers to split their payments online and in-store with no interest or fees. Over 32,000 global brands and small businesses, including Amazon, Noon, IKEA, and Shein use Tabby to accelerate growth and gain loyal customers by offering easy and flexible payments online and in stores.</div>\n<div><!--block--></div>\n<div><!--block-->Tabby has generated over $7 billion in transaction volume for its partner brands and is the highest-rated, most-reviewed, largest, and fastest-growing app of any fintech in the GCC region.</div>\n<div><!--block--></div>\n<div><!--block-->Tabby launched operations in 2020 and has raised +$1 billion in equity and debt funding from global and regional investors.<br><br></div>\n<div class=\"h3\"><!--block--><strong>About the role</strong></div>\n<div><!--block-->We are looking for a <strong>Senior Product Manager</strong> to work in our Customer Happiness stream which is responsible for the internal tools and processes that help specialists and agents increase productivity and efficiency. We're working on internal solutions that help us to meet our high standards for customer service.</div>\n<div><!--block--></div>\n<div><!--block-->You’ll work in a fast-paced, data-driven environment, collaborating with Engineering, Customer Experience, Data Science, and other key stakeholders to deliver exceptional outcomes for our users.</div>\n<p><br><br></p>\n<div class=\"h3\">Key Responsibilities</div>\n<ul style=\"\">\n<li style=\"\"><!--block-->Build an internal platform to organize the support workflows and journey;</li>\n<li style=\"\"><!--block-->Provide the right tools to integrate internal processes into our internal platform;</li>\n<li style=\"\"><!--block-->Implement solutions that help decrease the costs of visualizing business processes in the platform;</li>\n<li style=\"\"><!--block-->Work with internal stakeholders and build products &amp; platforms to increase the efficiency of our Customer Support agents;</li>\n</ul>\n<p><br><br></p>\n<div class=\"h3\">We’re looking for someone with:</div>\n<ul style=\"\">\n<li style=\"\"><!--block--><strong>Experience:</strong> <strong>4+</strong> years of Product Management experience, preferably in internal tools or operations-heavy products and processes;</li>\n<li style=\"\"><!--block-->Experience in building platform solutions – has worked/built process automation and integrations;</li>\n<li style=\"\"><!--block-->Strong understanding of Support / Customer Experience / Operations; knows how customer support works, understands the challenges of agents and users;</li>\n<li style=\"\"><!--block--><strong>Strategic mindset:</strong> Can analyze requests and identify scalable solutions instead of just solving isolated issues;</li>\n<li style=\"\"><!--block--><strong>Product &amp; tech knowledge:</strong> Understands APIs, basic integrations, and solution architecture;</li>\n<li style=\"\"><!--block--><strong>Communication:</strong> Fluent in English with excellent communication skills to articulate vision and influence stakeholders;</li>\n<li style=\"\"><!--block--><strong>Technical Aptitude:</strong> Familiarity with experimentation tools, analytics platforms, and product design frameworks;</li>\n<li style=\"\"><!--block--><strong>Adaptability:</strong> Comfortable working in a fast-moving, dynamic environment;</li>\n<li style=\"\"><!--block--><strong>Leadership:</strong> Proven ability to independently lead cross-functional teams and drive impactful results.</li>\n</ul>\n<p><br><br></p>\n<div class=\"h3\">Job Benefits</div>\n<div><!--block--><strong>Relocation and Employment</strong></div>\n<div><!--block--><br>We offer remote work from anywhere in the world (our schedule is based on Dubai time though) and are happy to work out an individual relocation plan for you.<br><br></div>\n<div><!--block-->Our employees have the opportunity to choose a country for registration; at the moment, those are Armenia, Georgia, Serbia, Portugal, Spain, the UAE, and Remote.</div>\n<div><!--block--></div>\n<div class=\"h3\"><!--block--><strong>What you can expect</strong></div>\n<ul style=\"\">\n<li style=\"\"><!--block-->We offer flexible working hours and trust you to work enough hours to do your job well, at times that suit you and your team.</li>\n<li style=\"\"><!--block-->A working environment that gives you autonomy and responsibility from day one.</li>\n<li style=\"\"><!--block-->You should be comfortable with the idea that the quality of your work will influence the shape of your career.</li>\n<li style=\"\"><!--block-->Participation in the company’s employee stock options program.</li>\n<li style=\"\"><!--block-->Health Insurance</li>\n</ul>\n<div><!--block-->We are passionate about creating an inclusive, high-performing workplace that gives people from all backgrounds the support they need to thrive, grow, and meet their goals (whatever they may be).</div>\n<div><!--block--><br>If this sounds exciting to you, we’d love to hear from you!</div>\n<img src=\"https://remotive.com/job/track/1988823/blank.gif?source=public_api\" alt=\"\"/>","tags":"[\"product management\"]","pubDate":"2025-03-27T01:51:15.000Z","link":"https://remotive.com/remote-jobs/product/senior-product-manager-1988823","slug":"senior-product-manager-tabby-6268"},{"id":2634238746,"title":"Treasury Analyst","company":"Xapo Bank","image":"https://remotive.com/job/1989110/logo","description":"<div class='\"content-intro\"'>\n<p>Work from anywhere, impact everywhere </p>\n<p>Diversity is at the heart of who we are at Xapo Bank. We’re a fully distributed team of over 140 Xapiens that work remotely from 40+ countries around the world. </p>\n<p>Our beginning: A world that enjoys economic freedom and wealth protection, no matter where you live or who is running your country. This is the dream that drove Wences Casares, our Founder and Chairman, to quietly transform the world of banking.</p>\n<p>To achieve that, we search the world for the best people for the job. We work hard, think globally, and inspire each other to learn and grow. We are committed to changing the way things are done.</p>\n<p><strong>Risk is inherent in all of our business activities and managing risk well is the responsibility of every Xapien. Sound risk management enables us to serve our customers and deliver value for our shareholders, and helps make Xapo a great place to work.</strong></p>\n<p> </p>\n<p><em>Although we are headquartered in Gibraltar, this is a full time, 100% remote position <br></em><em>Work from anywhere!</em></p>\n<p> </p>\n</div>\n<p><strong><em>Position overview</em></strong></p>\n<p>We are seeking a highly motivated and detail-oriented Treasury Analyst to join our Treasury team. This role will focus on supporting the team with management information, reporting, and daily treasury operations. The ideal candidate will possess strong analytical skills, a solid understanding of treasury functions, and the ability to work in a fast-paced environment.</p>\n<p><strong><em>Responsibilities</em></strong></p>\n<ul style=\"\">\n<li style=\"\">Prepare and deliver accurate and timely management information (MI) and reporting to support decision-making.</li>\n<li style=\"\">Oversee and execute daily treasury operations, including cash management, liquidity monitoring, and payment processes.</li>\n<li style=\"\">Assist in the preparation of treasury-related reports for senior management.</li>\n<li style=\"\">Collaborate with internal teams (e.g., Finance, Accounting, Operations) to ensure data accuracy and alignment with reporting standards.</li>\n<li style=\"\">Identify opportunities to improve efficiency and automation in treasury operations and reporting.</li>\n<li style=\"\">Support ad-hoc treasury initiatives as required.</li>\n</ul>\n<p><strong><em>Skills needed</em></strong></p>\n<ul style=\"\">\n<li style=\"\">Attention to detail and a high level of accuracy in reporting.</li>\n<li style=\"\">Ability to manage multiple priorities and deliver under tight deadlines.</li>\n<li style=\"\">Excellent analytical and problem-solving abilities.</li>\n<li style=\"\">Advanced Excel skills and the ability to handle large datasets effectively.</li>\n<li style=\"\">Strong communication skills, with the ability to present information clearly and concisely.</li>\n<li style=\"\">Knowledge of financial instruments, foreign exchange, and hedging strategies.</li>\n<li style=\"\">Experience in process improvement and automation projects.</li>\n<li style=\"\">Understanding of regulatory frameworks related to treasury operations.</li>\n</ul>\n<p><strong><em>Other requirements</em></strong></p>\n<ul style=\"\">\n<li style=\"\">A dedicated workspace.</li>\n<li style=\"\">A reliable internet connection with the fastest speed possible in your area.</li>\n<li style=\"\">Devices and other essential equipment that meet minimal technical specifications.</li>\n<li style=\"\">Alignment with Our Values and the Xapo Values-Driven Leadership principles.</li>\n</ul>\n<div class='\"content-conclusion\"'>\n<p><strong>Why work for Xapo?</strong></p>\n<p>IMPACT GLOBALLY, WORK REMOTELY.</p>\n<ul style=\"\">\n<li style=\"\"><strong>Shape the Future:</strong> Improve lives through cutting-edge technology, work 100% remotely from anywhere in the world.</li>\n<li style=\"\"><strong>Great work-life balance:</strong> Build amazing things with a balance of autonomy and collaborative teamwork. Set your own work schedule and make use of a flexible PTO plan when you need to recharge. </li>\n<li style=\"\"><strong>Expect Excellence:</strong> Collaborate, learn, and grow with a high-performance team. Learn how you learn best - from books to conferences, you’ll get a yearly budget for your individual learning and development goals.</li>\n</ul>\n<p><strong>At Xapo, we prioritize consumer protection and adhere to regulatory requirements by ensuring that all Xapiens are accountable for upholding principles of fair treatment, transparency, and ethical conduct in their interactions with customers and stakeholders.</strong></p>\n</div>\n<img src=\"https://remotive.com/job/track/1989110/blank.gif?source=public_api\" alt=\"\"/>","tags":"[\"accounting\",\"excel\",\"automation\",\"SOLID\",\"risk management\",\"diversity\",\"treasury\",\"banking\"]","pubDate":"2025-03-26T07:50:34.000Z","link":"https://remotive.com/remote-jobs/finance-legal/treasury-analyst-1989110","slug":"treasury-analyst-xapo-bank-5870"},{"id":7350170110,"title":"Senior .NET Engineer (A)","company":"Blue Coding","image":"https://media.licdn.com/dms/image/C4D0BAQHlK67hgnhzQw/company-logo_200_200/0/1631346154820?e=2147483647&v=beta&t=_R2Ssj7L_f4xqmSCcq0nOLCyCz0QN2lFnHssxxhj3YY","description":"<div><i style=\"font-size: 18px\">Do you want to earn a salary in USD?&nbsp;</i></div><div><i style=\"font-size: 18px\">Would you like to work from wherever you want?</i></div><div><i style=\"font-size: 18px\">Would you like to be a part of the leading next-gen software developers?&nbsp;</i></div><div><br></div><div><b style=\"font-size: 24px\">Hi, you finally found us!</b><span style=\"font-size: 24px\">&nbsp;</span></div><div><br></div><div><b style=\"font-size: 24px\">Why work at Blue Coding?</b><span style=\"font-size: 24px\">&nbsp;</span></div><div><br></div><div>At Blue Coding we specialize in hiring excellent developers and amazing people from all over Latin America and other parts of the world. For the past 10 years, we’ve helped cutting-edge companies in the United States and Canada -both large and small, build great development teams and develop great products. Online shops, digital agencies, SaaS providers, and software consulting firms are a few of our clients. Our team of over 100 engineers is distributed in more than 10 countries across the Americas. We are a fully remote company working with a wide array of technologies and have expertise in every stage of the software development process.&nbsp;&nbsp;</div><div><br></div><div>Our team is highly connected, united, and culturally diverse, and our collaborators are involved in many initiatives around the world, from wildlife preservation to volunteering at local charities. We also participate in group activities like movie nights, trivia, and meme competitions. We stand for honesty, fairness, respect, efficiency, hard work, and cooperation.</div><div><br></div><div><b>What are we looking for?</b></div><div>In this opportunity, we are looking for a Senior .Net Developer to work with one of our foreign clients, who is a market leader in the consultation, design, procurement, implementation, and ongoing managed services for technology services for mid to large global enterprises. As a Telecom Managed Service company, they partner with over 300 service providers globally to help customers with technology design and find the best solutions to meet their needs.</div><div>If you are independent, a great communicator, a problem solver, and have strong attention to detail, this is a great fit for you! Our jobs are fully remote – as long as you have the skills and can get the work done well, you can work anywhere in the listed countries you want.</div><div>If you have the skills and can get the job done, join us and work from anywhere you want!</div><h3>Here are some of the exciting day-to-day challenges you will face in this role:</h3><li>You'll participate in doing a transition and migrate all existing functionality from Ruby to .Net Core MVC.</li><li>All of the migration will be done using Agile methodologies and Scrum.</li><li>Rebuilding the UI based on the client's design standards which are based in Bootstrap 5.</li>,<h3>You will shine if you have these:</h3><li>Strong hands-on experience with .Net Core and MVC frameworks.</li><li>Experience with HTML, CSS, and Javascript.</li><li>Strong experience with SQL Databases.</li><li>Experience with Agile methodologies such as Scrum, and Kanban.</li><li>Experience with cloud environments like Azure or similar.</li><div><b style=\"font-size: 24px\">Hey, you are still here!</b><span style=\"font-size: 24px\">&nbsp;</span></div><div><br></div><div>So, let us ask a few questions. Do you like working in a friendly environment? Are you fluent in English? Do you have a strong work ethic, are detail-oriented and have an ownership mentality? And most importantly do you love music and puppies? If so, then what are you waiting for? Come join our team and become part of this awesome company! We will be expecting you.</div>","tags":"[\"javascript\",\"database\"]","pubDate":"2025-03-25T21:03:51.461Z","link":"https://jobs.lever.co/bluecoding/a3f77034-f051-40b3-a1b4-d20b65942df8","slug":"senior-net-engineer-a-blue-coding-2196"}]