[{"id":8603592203,"title":"Junior Software Engineer - Remote","company":"MixRank","image":"https://pbs.twimg.com/profile_images/378800000147745937/0fac42c12b433bbbd53ff3e15cd6fca4_400x400.png","description":"<p>At MixRank, we create B2B SaaS products that enable sales, marketing, finance, and business intelligence teams to accelerate their business with data and insights into their customers. One that provides the most comprehensive database of mobile apps and websites, technographics, companies, and decision makers. It's a platform created with the sole purpose of providing the fastest way for sales reps to build prospect lists, prioritize leads, and contact decision-makers.</p>\n<p>We're looking for remote engineers that have finished school within the last 2 years or will finish in the next 6 months. This is an open-ended entry-level role with mentorship, and diverse opportunities to work on all areas of our product: databases, distributed systems, infrastructure and tooling, data analysis, machine learning, frontend and backend web development, APIs, data mining, data modeling, and more.</p>\n<p>Our code base is very friendly to new contributors. You'll have a fully-functional development environment within hours (fully automated) and be pushing commits on your first day. Deployments to production happen multiple times per day and finish in less than 2 minutes. Effectively all of our codebase is written in Python, SQL, and Javascript/TypeScript. The core technologies you'll need familiarity with to be productive are Python, PostgreSQL, Linux, and Git.</p>\n<p>Why Join MixRank? Fully-remote, no HQ office. Team of 40 people across 15+ countries. Invested in by Y Combinator, 500 Startups, Mark Cuban. Profitable and growing 50% every year.</p>\n<p>Please include your updated resume when applying for this role.</p>\n<p><strong>Important:</strong> Only accept job offers from emails ending in @<a href=\"http://mixrank.com\" target=\"_blank\">mixrank.com</a>. Offers from any other email addresses are fraudulent. Do not share personal information with unverified senders.</p>\n","tags":"[\"postgres\",\"javascript\",\"typescript\",\"finance\",\"b2b\",\"database\"]","pubDate":"2025-01-30T09:12:54.777Z","link":"https://www.ycombinator.com/companies/mixrank/jobs/Fnwsojk-junior-software-engineer-remote","slug":"junior-software-engineer-remote-mixrank-3338"},{"id":2674746493,"title":"Cloud Field Engineer - Worldwide","company":"Canonical","image":"https://pbs.twimg.com/profile_images/1673959375340290050/x7pNtXQ7_400x400.jpg","description":"\n      <p>Help global companies embrace the latest private cloud infrastructure, Linux and cloud native operations, and open source applications. Our team applies expert insights to real-world customer problems, enabling the enterprise adoption of Linux Ubuntu, OpenStack, Kubernetes and a wide range of associated technology.</p>\n<p>This role has very diverse responsibilities. The team members are Linux and cloud solutions architects for our customers, designing private and public cloud solutions fitting their workload needs. They are the cloud consultants who work hands-on with the technologies by deploying, testing and handing over the solution to our support or managed services team at the end of a project. They are also software engineers who use Python to develop Kubernetes operators and Linux open source infrastructure-as-code.</p>\n<p>The people who love this role are developers who like to solve customer problems through architecture, presentations and training.</p>\n<p><strong>Location:</strong> This role will be home based.</p>\n<p><strong>What your day will look like</strong></p>\n<ul>\n<li>Work across the entire Linux stack, from kernel, networking, storage, to applications</li>\n<li>Work in Python to design and deliver open source code</li>\n<li>Architect cloud infrastructure solutions like OpenStack, Kubernetes, Ceph, Hadoop and Spark either On-Premises or in Public Cloud (AWS, Azure, Google Cloud)</li>\n<li>Coach and develop your colleagues where you have insights</li>\n<li>Grow a healthy, collaborative engineering culture in line with the company values</li>\n<li>Work from the comfort of your home</li>\n<li>Global travel up to 25% of time for internal and external events</li>\n</ul>\n<p><strong>What we are looking for in you</strong></p>\n<ul>\n<li>University degree in Computer Science or related software engineering expertise</li>\n<li>You have sound knowledge of cloud computing concepts &amp; technologies, such as Kubernetes, OpenStack, AWS, GCP, Azure, Ceph, etc.</li>\n<li>You have practical knowledge of Linux and networking</li>\n<li>You have Intermediate to Advanced level of Python programming skills</li>\n<li>You are a dynamic person who loves to jump in new projects and interact with people</li>\n<li>You have a demonstrated drive for continual learning</li>\n<li>Excellent communication and presentation skills (English)</li>\n<li>You have great organisational skills and follow-up reliably on commitments</li>\n<li>(Optional) You speak a second language</li>\n</ul>\n<p><strong>What you’ll learn</strong></p>\n<ul>\n<li>OpenStack and Kubernetes infrastructure</li>\n<li>Linux Ubuntu and networking knowledge</li>\n<li>Wide range of open source applications and skills</li>\n<li>Work directly with customers in a range of different businesses&nbsp;</li>\n<li>Real-life and hands-on exposure to a wide range of emerging technologies and tools&nbsp;</li>\n</ul>\n<p><strong>What we offer you</strong></p>\n<p>We consider geographical location, experience, and performance in shaping compensation worldwide. We revisit compensation annually (and more often for graduates and associates) to ensure we recognise outstanding performance. In addition to base pay, we offer a performance-driven quarterly bonus. We provide all team members with additional benefits, which reflect our values and ideals. We balance our programs to meet local needs and ensure fairness globally.</p>\n<ul>\n<li>Distributed work environment with twice-yearly team sprints in person - we’ve been working remotely since 2004!</li>\n<li>Personal learning and development budget of USD 2,000 per year</li>\n<li>Annual compensation review</li>\n<li>Recognition rewards</li>\n<li>Annual holiday leave</li>\n<li>Maternity and paternity leave</li>\n<li>Employee Assistance Programme</li>\n<li>Opportunity to travel to new locations to meet colleagues from your team and others</li>\n<li>Priority Pass for travel and travel upgrades for long haul company events</li>\n</ul>\n<p><strong>About Canonical</strong></p>\n<p>Canonical is a pioneering tech firm that is at the forefront of the global move to open source. As the company that publishes Ubuntu, one of the most important open source projects and the platform for AI, IoT and the cloud, we are changing the world on a daily basis. We recruit on a global basis and set a very high standard for people joining the company. We expect excellence - in order to succeed, we need to be the best at what we do.</p>\n<p>Canonical has been a remote-first company since its inception in 2004.​ Work at Canonical is a step into the future, and will challenge you to think differently, work smarter, learn new skills, and raise your game. Canonical provides a unique window into the world of 21st-century digital business.</p>\n<p><strong>Canonical is an equal opportunity employer</strong></p>\n<p>We are proud to foster a workplace free from discrimination. Diversity of experience, perspectives, and background create a better work environment and better products. <a href=\"https://canonical.com/careers/diversity/identity\">Whatever your identity, we will give your application fair consideration.</a></p>\n\n<p>#LI-Remote</p>\n<p>#stack</p>\n\n<p>Requisition ID: 522</p><p></p>\n    ","tags":"[\"engineering\",\"aws\"]","pubDate":"2025-01-30T09:12:54.777Z","link":"https://canonical.com/careers/6132532","slug":"cloud-field-engineer-worldwide-canonical-8074"},{"id":4339368326,"title":"Staff Software Engineer","company":"Aiwyn","image":"https://media.licdn.com/dms/image/v2/D4E0BAQEvDOFt9VDmfg/company-logo_200_200/company-logo_200_200/0/1714673337921/aiwyn_logo?e=1743033600&v=beta&t=0yqXd-p9YeUPxD_oaEkvrGENa6XLG5S4Q4dDXCettEY","description":"<div><b>Who is Aiwyn and what do we do?</b></div><div><br></div><div>Aiwyn is the fastest-growing software company serving the accounting profession.&nbsp;Founded in 2020, we now work with 100+ of the largest CPA firms in the world.&nbsp;Our “Job to be done”: speed up cash flow, save Partner time, &amp; deliver best-in-class client experiences. We do this by automating day-to-day firm operations with our Practice Automation solutions. Aiwyn is led by serial entrepreneurs with multiple exits and funded by top-tier investors (Bessemer, KKR, &amp; Revolution). We're passionate about building a remarkable company with world-class people, processes, and technology.</div><div><br></div><div>To learn more, visit our <b><a class=\"postings-link\" href=\"https://aiwyn.ai/\">website</a></b></div><div><b>Who is Aiwyn and what do we do?</b></div><div><br></div><div>Aiwyn is the fastest-growing software company serving the accounting profession.&nbsp;Founded in 2020, we now work with 100+ of the largest CPA firms in the world.&nbsp;Our “Job to be done”: speed up cash flow, save Partner time, &amp; deliver best-in-class client experiences. We do this by automating day-to-day firm operations with our Practice Automation solutions. Aiwyn is led by serial entrepreneurs with multiple exits and funded by top-tier investors (Bessemer, KKR, &amp; Revolution). We're passionate about building a remarkable company with world-class people, processes, and technology.</div><div><br></div><div>To learn more, visit our <b><a href=\"https://aiwyn.ai/\" class=\"postings-link\">website</a></b></div><h3>What You'll Do:</h3><li><b>Technical Strategy &amp; Vision</b> - Help define and drive technical strategy across multiple teams or systems. Shape architectural decisions that impact major portions of our platform while ensuring scalability, reliability, and maintainability of our software.</li><li><b>Design &amp; Mentor</b> - Lead the design of complex technical solutions spanning multiple services and data pipelines. Mentor senior engineers, influence engineering practices, and drive technical excellence across the organization.</li><li><b>Solve &amp; Scale</b> - Tackle our most challenging optimization problems. Identify systemic issues, implement solutions that scale, and drive improvements in performance, reliability, and engineering efficiency.</li><h3>What We Need:</h3><li><b>Technical Leadership</b> - Exceptional engineering skills with deep expertise in Java/Kotlin and Spring Boot solutions. Proven ability to deliver complex, large-scale technical solutions leveraging cloud services. Experience making high-impact technical decisions that affect multiple data processing systems and teams.</li><li><b>Strategic Thinking</b> - Demonstrated ability to understand business context and translate it into technical strategy for engineering teams. Experience in making architectural decisions that balance immediate needs with long-term technical health of an ecosystem.</li><li><b>System Design</b> - Deep understanding of distributed systems and data pipeline architectures. Proven track record of designing and implementing system-wide improvements to ETL processes and data validation frameworks that significantly impact engineering efficiency.</li><li><b>Technical Influence</b> - Strong ability to influence technical direction across teams through mentorship in software development, technical documentation, and leadership. Experience in driving adoption of engineering best practices and standards across multiple teams.</li><li><b>Quality &amp; Testing Excellence</b> - Relentless focus on quality with deep expertise in test automation. Experience building robust test frameworks, implementing comprehensive testing strategies, and fostering a test-first development culture.&nbsp;</li><li><b>Cross-team Collaboration</b> - Track record of successfully driving technical initiatives that span multiple teams working on different aspects of a software platform. Ability to build consensus around technical decisions and navigate complex trade-offs.</li><li><b>Engineering Excellence</b> - Deep understanding of software engineering principles, with particular emphasis on data processing patterns and practices. Proven ability to establish and maintain high engineering standards while driving innovation.</li><li>The ability to travel occasionally for onsite Company meetings</li><h3>Preferred:</h3><li>12+ years of software engineering experience</li><li>Kotlin expertise</li><li>Expertise with Angular or other front end technologies</li><li>Expertise with large-scale Spring Boot architectures</li><li>Expertise in Google Cloud Platform services including BigQuery</li><li>Expertise in designing and building PostgreSQL databases</li><li>Expertise with data pipelines and ETL processes</li><li>Expertise in GraphQL architecture patterns and implementation</li><li>Experience building solutions that leverage LLMs</li><li>Expertise with continuous integration and deployment practices</li><li>Experience in technical risk assessment and mitigation in data-intensive systems</li><li>Background in mentoring senior engineers</li><h3>Why Work at Aiwyn?</h3><li>The big-picture value proposition of this role is simple: join us, and you'll be paid competitively to have freedom in solving worthwhile, challenging problems alongside other A-players at a fast-growing SaaS startup led by an experienced and successful team with industry experience.</li><div><br></div><div>Other benefits include:</div><li><b>Adventure travel stipend</b> - you receive a $1,000 travel reimbursement on your work anniversary each year. We encourage our team to recharge and explore the world beyond their home office walls.</li><li><b>Remote, work-from-anywhere culture</b></li><li><b>Flexible PTO</b></li><li><b>World Class health benefits</b> - we believe in fostering flourishing teams by providing benefits that go beyond the usual standards - Health, vision, dental, HSA/FSA, and mental health support.</li><li><b>Stock options</b> - every Full Time Employee has ownership in Aiwyn's future and success.</li><li><b>401(k) matching</b></li><h3>Our Values:</h3><li><b>Trust</b> - We champion transparency, welcome differing perspectives, uphold accountability, and trust that others have good intentions</li><li><b>Courage</b> - We have the courage to take calculated risks and embrace change, knowing what worked in the past won’t always work in the future</li><li><b>Impact</b> - Rooted in determination and innovation, we chase extraordinary outcomes and impactful results</li><li><b>Relentlessness</b> - We approach challenges with an unwavering resolve, never settling for mediocrity, and always striving to surpass expectations</li><h3>Learn more about Aiwyn</h3><li><a class=\"postings-link\" href=\"https://www.aiwyn.ai/about\"><b>About us</b></a></li><li><a class=\"postings-link\" href=\"https://www.aiwyn.ai/why-aiwyn\"><b>Why Aiwyn</b></a></li><li><a class=\"postings-link\" href=\"https://www.youtube.com/@AiwynAI\"><b>YouTube page</b></a></li><div>Aiwyn is an equal opportunity employer. All qualified applicants will receive consideration for employment without regard to age, ancestry, color, family or medical care leave, gender identity or expression, genetic information, marital status, medical condition, national origin, physical or mental disability, political affiliation, protected veteran status, race, religion, sex (including pregnancy), sexual orientation, or any other characteristic protected by applicable laws, regulations and ordinances.</div><div><br></div><div>Candidate information will be treated in accordance with our CCPA privacy notice which can be found here: <a class=\"postings-link\" href=\"https://www.aiwyn.ai/ccpa\">https://www.aiwyn.ai/ccpa</a></div>","tags":"[\"postgres\",\"engineering\",\"database\",\"aws\"]","pubDate":"2025-01-30T06:00:40.149Z","link":"https://jobs.lever.co/aiwyn/de4fa392-835d-43e5-8deb-225a309b0cf5","slug":"staff-software-engineer-aiwyn-9172"},{"id":3540330786,"title":"Staff Angular Software Engineer","company":"Aiwyn","image":"https://media.licdn.com/dms/image/v2/D4E0BAQEvDOFt9VDmfg/company-logo_200_200/company-logo_200_200/0/1714673337921/aiwyn_logo?e=1743033600&v=beta&t=0yqXd-p9YeUPxD_oaEkvrGENa6XLG5S4Q4dDXCettEY","description":"<div><b>Who is Aiwyn and what do we do?</b></div><div><br></div><div>Aiwyn is the fastest-growing software company serving the accounting profession.&nbsp;Founded in 2020, we now work with 100+ of the largest CPA firms in the world.&nbsp;Our “Job to be done”: speed up cash flow, save Partner time, &amp; deliver best-in-class client experiences. We do this by automating day-to-day firm operations with our Practice Automation solutions. Aiwyn is led by serial entrepreneurs with multiple exits and funded by top-tier investors (Bessemer, KKR, &amp; Revolution). We're passionate about building a remarkable company with world-class people, processes, and technology.</div><div><br></div><div>To learn more, visit our <b><a class=\"postings-link\" href=\"https://aiwyn.ai/\">website</a></b></div><div><b>Who is Aiwyn and what do we do?</b></div><div><br></div><div>Aiwyn is the fastest-growing software company serving the accounting profession.&nbsp;Founded in 2020, we now work with 100+ of the largest CPA firms in the world.&nbsp;Our “Job to be done”: speed up cash flow, save Partner time, &amp; deliver best-in-class client experiences. We do this by automating day-to-day firm operations with our Practice Automation solutions. Aiwyn is led by serial entrepreneurs with multiple exits and funded by top-tier investors (Bessemer, KKR, &amp; Revolution). We're passionate about building a remarkable company with world-class people, processes, and technology.</div><div><br></div><div>To learn more, visit our <b><a href=\"https://aiwyn.ai/\" class=\"postings-link\">website</a></b></div><h3>What You'll Do:</h3><li><b>Technical Strategy &amp; Vision</b> - Shape and drive the technical direction of our frontend platform across multiple teams. Make critical architectural decisions that affect the entire frontend ecosystem, establishing patterns and practices that scale across applications.</li><li><b>Design System Architecture</b> - Lead the evolution of our component library and design system architecture. Define standards for reusability, accessibility, and performance that impact all frontend applications.</li><li><b>Drive Innovation</b> - Identify and champion transformative frontend initiatives. Lead the adoption of new technologies and approaches that significantly improve developer productivity and application performance across teams.</li><li><b>Technical Leadership</b> - Provide technical leadership across teams, mentor senior engineers, and influence organization-wide frontend practices. Be a key technical advisor to product and engineering leadership.</li><h3>What We Need:</h3><li><b>Advanced Technical Expertise</b> - Deep mastery of Angular, RxJS, and modern frontend architecture patterns. Proven track record of solving complex technical challenges and introducing innovative solutions at scale. Expert-level understanding of JavaScript/TypeScript internals and performance optimization.</li><li><b>Enterprise Architecture</b> - Extensive experience designing and implementing large-scale Angular applications serving significant user bases. Deep understanding of micro-frontend architectures, module federation, and scalable state management approaches.</li><li><b>UI Architecture Excellence</b> - Expert knowledge of advanced CSS architecture patterns, design systems, and web performance optimization. Strong background in establishing standards for accessibility, responsive design, and cross-browser compatibility at an organizational level.</li><li><b>Quality &amp; Testing Leadership</b> - Proven ability to establish testing strategies and frameworks that scale across multiple teams. Experience building automated testing infrastructures and implementing effective testing patterns for complex Angular applications.</li><li><b>Performance &amp; Optimization</b> - Deep expertise in frontend performance optimization, bundle size management, and application scalability. Experience with advanced debugging and profiling techniques.</li><li><b>Technical Strategy</b> - Demonstrated ability to create and execute technical roadmaps that align with business objectives. Experience making architectural decisions that balance immediate needs with long-term technical health.</li><li><b>Cross-team Impact</b> - Track record of successfully leading technical initiatives that span multiple teams and applications. Ability to drive consensus on complex technical decisions across engineering organizations.</li><li>The ability to travel occasionally for onsite Company meetings</li><h3>Preferred:</h3><li>12+ years of software engineering experience</li><li>Deep expertise in GraphQL architecture patterns and implementation</li><li>Experience with Google Cloud Platform services and cloud-native architectures</li><li>Deep expertise in build tooling optimization and deployment strategies</li><li>Advanced knowledge of browser internals and web performance</li><li>Background in implementing large-scale design systems</li><li>Experience with advanced Angular patterns like custom decorators and meta-programming</li><li>Expertise in frontend security best practices and implementation</li><li>Track record of mentoring senior engineers and technical leads</li><li>Experience with frontend architecture in cloud-native environments</li><h3>Why Work at Aiwyn?</h3><li>The big-picture value proposition of this role is simple: join us, and you'll be paid competitively to have freedom in solving worthwhile, challenging problems alongside other A-players at a fast-growing SaaS startup led by an experienced and successful team with industry experience.</li><div><br></div><div>Other benefits include:</div><li><b>Adventure travel stipend</b> - you receive a $1,000 travel reimbursement on your work anniversary each year. We encourage our team to recharge and explore the world beyond their home office walls.</li><li><b>Remote, work-from-anywhere culture</b></li><li><b>Flexible PTO</b></li><li><b>World Class health benefits</b> - we believe in fostering flourishing teams by providing benefits that go beyond the usual standards - Health, vision, dental, HSA/FSA, and mental health support.</li><li><b>Stock options</b> - every Full Time Employee has ownership in Aiwyn's future and success.</li><li><b>401(k) matching</b></li><h3>Our Values:</h3><li><b>Trust</b> - We champion transparency, welcome differing perspectives, uphold accountability, and trust that others have good intentions</li><li><b>Courage</b> - We have the courage to take calculated risks and embrace change, knowing what worked in the past won’t always work in the future</li><li><b>Impact</b> - Rooted in determination and innovation, we chase extraordinary outcomes and impactful results</li><li><b>Relentlessness</b> - We approach challenges with an unwavering resolve, never settling for mediocrity, and always striving to surpass expectations</li><h3>Learn more about Aiwyn</h3><li><a class=\"postings-link\" href=\"https://www.aiwyn.ai/about\"><b>About us</b></a></li><li><a class=\"postings-link\" href=\"https://www.aiwyn.ai/why-aiwyn\"><b>Why Aiwyn</b></a></li><li><a class=\"postings-link\" href=\"https://www.youtube.com/@AiwynAI\"><b>YouTube page</b></a></li><div>Aiwyn is an equal opportunity employer. All qualified applicants will receive consideration for employment without regard to age, ancestry, color, family or medical care leave, gender identity or expression, genetic information, marital status, medical condition, national origin, physical or mental disability, political affiliation, protected veteran status, race, religion, sex (including pregnancy), sexual orientation, or any other characteristic protected by applicable laws, regulations and ordinances.</div><div><br></div><div>Candidate information will be treated in accordance with our CCPA privacy notice which can be found here: <a class=\"postings-link\" href=\"https://www.aiwyn.ai/ccpa\">https://www.aiwyn.ai/ccpa</a></div>","tags":"[\"javascript\",\"typescript\",\"management\",\"engineering\",\"aws\"]","pubDate":"2025-01-30T05:50:31.087Z","link":"https://jobs.lever.co/aiwyn/dc5cd1de-fc7f-40f5-a208-68b6a78649d4","slug":"staff-angular-software-engineer-aiwyn-7881"},{"id":1949979831,"title":"Events Coordinator","company":"Aiwyn","image":"https://media.licdn.com/dms/image/v2/D4E0BAQEvDOFt9VDmfg/company-logo_200_200/company-logo_200_200/0/1714673337921/aiwyn_logo?e=1743033600&v=beta&t=0yqXd-p9YeUPxD_oaEkvrGENa6XLG5S4Q4dDXCettEY","description":"<div><b>Who is Aiwyn and what do we do?</b></div><div><br></div><div>Aiwyn is the fastest-growing software company serving the accounting profession.&nbsp;Founded in 2020, we now work with 100+ of the largest CPA firms in the world.&nbsp;Our “Job to be done”: speed up cash flow, save Partner time, &amp; deliver best-in-class client experiences. We do this by automating day-to-day firm operations with our Practice Automation solutions. Aiwyn is led by serial entrepreneurs with multiple exits and funded by top-tier investors (Bessemer, KKR, &amp; Revolution). We're passionate about building a remarkable company with world-class people, processes, and technology.</div><div><br></div><div>To learn more, visit our <b><a rel=\"noopener noreferrer\" class=\"postings-link\" href=\"https://aiwyn.ai/\">website</a></b></div><div><b>Who is Aiwyn and what do we do?</b></div><div><br></div><div>Aiwyn is the fastest-growing software company serving the accounting profession.&nbsp;Founded in 2020, we now work with 100+ of the largest CPA firms in the world.&nbsp;Our “Job to be done”: speed up cash flow, save Partner time, &amp; deliver best-in-class client experiences. We do this by automating day-to-day firm operations with our Practice Automation solutions. Aiwyn is led by serial entrepreneurs with multiple exits and funded by top-tier investors (Bessemer, KKR, &amp; Revolution). We're passionate about building a remarkable company with world-class people, processes, and technology.</div><div><br></div><div>To learn more, visit our <b><a href=\"https://aiwyn.ai/\" class=\"postings-link\" target=\"_blank\" rel=\"noopener noreferrer\">website</a></b></div><h3>What you'll do:</h3><li>Organize travel and share accommodation info for Aiwyn team members attending events.</li><li>Own the end-to-end logistics for the event, including booth selection, printing and shipping materials and swag, and printing marketing collateral.</li><li>Help create registration pages using Hubspot, from content creation to testing and publishing, as well as Calendly creation for booth demos and meetings.&nbsp;</li><li>Create and share “Know Before You Go” (KBYG) documents for each event to outline roles and responsibilities for on-site team members. Conduct meetings to set expectations pre-show.</li><li>When on-site, help with booth setup, materials, and keeping things (and people!) organized and aligned to assigned responsibilities.&nbsp;</li><li>Gather attendee lists from event organizers and work with sales to prepare sellers’ notes before collaborating with operations to report on event success.&nbsp;</li><li>Work with product marketing and demand generation functions to support account executives and sales development representatives in pre-event outreach.</li><h3>What we need:</h3><li><b>Experience in event coordination</b>: 1-3 years of experience in events, marketing, or related fields preferred.</li><li><b>Willingness to Travel</b>: 15% travel involved with this role (the majority of travel will happen in May-June)</li><li><b>Highly organized multitasker</b>: You can juggle multiple responsibilities and keep all the details in check. You can not only start multiple projects at once, but you can push each project&nbsp; over the finish line.</li><li><b>Curiosity:</b> You want to learn more about marketing, specifically how demand generation, operations, and sales play a role together to drive high-quality leads for the business.</li><li><b>Problem solver</b>: You anticipate potential challenges and proactively address them to keep events running smoothly. You can operate without detailed direction.</li><li><b>Strong communicator</b>: You can clearly convey information to both internal teams and external vendors. You are great at explaining the why behind things and rally people together.&nbsp;</li><li><b>Team player</b>: You enjoy collaborating with cross-functional teams to ensure event success. You actively listen and try to understand each team’s perspective.</li><li><b>Detail-oriented</b>: You have an eye for the small details that make a big difference in event execution. You enjoy design and are picky about brand guidelines.</li><h3>Benefits and Perks:</h3><li>The big-picture value proposition of this role is simple: join us, and you'll be paid competitively to have freedom in solving worthwhile, challenging problems alongside other A-players at a fast growing SaaS startup led by an experienced and successful co-founding team with industry experience. </li><div><br></div><div>Other benefits include:</div><li><b>Adventure travel stipend</b> - you receive a $1,000 travel reimbursement on your work anniversary each year. We encourage our team to recharge and explore the world beyond their home office walls.</li><li><b>Remote, work-from-anywhere culture</b></li><li><b>Flexible PTO</b></li><li><b>World Class health benefits</b> - we believe in fostering flourishing teams by providing benefits that go beyond the usual standards - Health, vision, dental, HSA/FSA, and mental health support.</li><li><b>Stock options</b> - every Full Time Employee has ownership in Aiwyn's future and success.</li><li><b>401(k) matching</b></li><h3>Our Values:</h3><li><b>Trust</b> - We champion transparency, welcome differing perspectives, uphold accountability, and trust that others have good intentions</li><li><b>Courage</b> - We have the courage to take calculated risks and embrace change, knowing what worked in the past won’t always work in the future</li><li><b>Impact</b> - Rooted in determination and innovation, we chase extraordinary outcomes and impactful results</li><li><b>Relentlessness</b> - We approach challenges with an unwavering resolve, never settling for mediocrity, and always striving to surpass expectations</li><h3>Learn more about Aiwyn:</h3><li><a rel=\"noopener noreferrer\" class=\"postings-link\" href=\"https://www.aiwyn.ai/about\"><b>About us</b></a></li><li><a rel=\"noopener noreferrer\" class=\"postings-link\" href=\"https://www.aiwyn.ai/why-aiwyn\"><b>Why Aiwyn</b></a></li><li><a rel=\"noopener noreferrer\" class=\"postings-link\" href=\"https://www.youtube.com/@AiwynAI\"><b>YouTube page</b></a></li><div>Aiwyn is an equal opportunity employer. All qualified applicants will receive consideration for employment without regard to age, ancestry, color, family or medical care leave, gender identity or expression, genetic information, marital status, medical condition, national origin, physical or mental disability, political affiliation, protected veteran status, race, religion, sex (including pregnancy), sexual orientation, or any other characteristic protected by applicable laws, regulations and ordinances.</div><div><br></div><div>Candidate information will be treated in accordance with our CCPA privacy notice which can be found here: <a rel=\"noopener noreferrer\" class=\"postings-link\" href=\"https://www.aiwyn.ai/ccpa\">https://www.aiwyn.ai/ccpa</a></div>","tags":"[\"aws\"]","pubDate":"2025-01-30T05:33:22.723Z","link":"https://jobs.lever.co/aiwyn/a2881038-a0f9-4d5a-b420-74e1792930db","slug":"events-coordinator-aiwyn-1541"},{"id":2610346868,"title":"Sr. Event Marketing Manager","company":"Aiwyn","image":"https://media.licdn.com/dms/image/v2/D4E0BAQEvDOFt9VDmfg/company-logo_200_200/company-logo_200_200/0/1714673337921/aiwyn_logo?e=1743033600&v=beta&t=0yqXd-p9YeUPxD_oaEkvrGENa6XLG5S4Q4dDXCettEY","description":"<div><b>Who is Aiwyn and what do we do?</b></div><div><br></div><div>Aiwyn is the fastest-growing software company serving the accounting profession.&nbsp;Founded in 2020, we now work with 100+ of the largest CPA firms in the world.&nbsp;Our “Job to be done”: speed up cash flow, save Partner time, &amp; deliver best-in-class client experiences. We do this by automating day-to-day firm operations with our Practice Automation solutions. Aiwyn is led by serial entrepreneurs with multiple exits and funded by top-tier investors (Bessemer, KKR, &amp; Revolution). We're passionate about building a remarkable company with world-class people, processes, and technology.</div><div><br></div><div>To learn more, visit our <b><a rel=\"noopener noreferrer\" class=\"postings-link\" href=\"https://aiwyn.ai/\">website</a></b></div><div><b>Who is Aiwyn and what do we do?</b></div><div><br></div><div>Aiwyn is the fastest-growing software company serving the accounting profession.&nbsp;Founded in 2020, we now work with 100+ of the largest CPA firms in the world.&nbsp;Our “Job to be done”: speed up cash flow, save Partner time, &amp; deliver best-in-class client experiences. We do this by automating day-to-day firm operations with our Practice Automation solutions. Aiwyn is led by serial entrepreneurs with multiple exits and funded by top-tier investors (Bessemer, KKR, &amp; Revolution). We're passionate about building a remarkable company with world-class people, processes, and technology.</div><div><br></div><div>To learn more, visit our <b><a href=\"https://aiwyn.ai/\" class=\"postings-link\" target=\"_blank\" rel=\"noopener noreferrer\">website</a></b></div><h3>What you'll do:</h3><li><b>Lead end-to-end event management</b>: Plan, coordinate, and execute in-person events, ranging from 2,000+ person trade shows to owned events such as our annual user conference and multi-city roadshow.</li><li><b>Develop event strategies</b>: Align event goals with broader marketing and business objectives, ensuring each event has clear messaging and outcomes based on the specific audience of the event.</li><li><b>Track and measure success</b>: Report on events, working closely with operations to understand which events created and influenced revenue. Establish a set process to collect feedback and provide insights to optimize future events.</li><li><b>Manage budgets and timelines</b>: Develop detailed budgets, negotiate with vendors, and ensure events are delivered on time and within scope. Ability to manage multiple events at once.</li><li><b>Collaborate across teams</b>: Work closely with marketing, sales, product, and leadership to educate each team member on their roles and responsibilities at each event and provide support and answer questions pre-show and on-site.</li><li><b>Ensure scalability</b>: Establish best practices, processes, and templates for the events team as we continue to grow.</li><h3>What we need:</h3><li>5-7+ years of experience managing B2B events, with a focus on conferences, trade shows, and executive experiences.</li><li>Exceptional ability to juggle multiple priorities, stay organized, and manage complex timelines. Aiwyn attends 25+ events each year!</li><li>Willingness to travel 25% of the time (the majority of travel will happen from May-June)</li><li>Strong eye for detail and design to maximize brand exposure. Continue to position Aiwyn as a premium brand in the accounting vertical.&nbsp;</li><li>Skilled in negotiating contracts and managing budgets efficiently, acting as key point of contact for our vendors.</li><li>Proficiency in event management tools. Hubspot experience a plus.&nbsp;</li><li>Excellent written and verbal communication skills, with the ability to engage and influence stakeholders at all levels.&nbsp;</li><li>Comfortable with data and analytics to track ROI, engagement, and event success metrics.</li><li>Thrives in fast-paced environments and handles last-minute changes with ease.</li><li>Collaborative mindset with a strong sense of ownership and accountability.</li><h3>Benefits and Perks:</h3><li>The big-picture value proposition of this role is simple: join us, and you'll be paid competitively to have freedom in solving worthwhile, challenging problems alongside other A-players at a fast growing SaaS startup led by an experienced and successful co-founding team with industry experience. </li><div><br></div><div>Other benefits include:</div><li><b>Adventure travel stipend</b> - you receive a $1,000 travel reimbursement on your work anniversary each year. We encourage our team to recharge and explore the world beyond their home office walls.</li><li><b>Remote, work-from-anywhere culture</b></li><li><b>Flexible PTO</b></li><li><b>World Class health benefits</b> - we believe in fostering flourishing teams by providing benefits that go beyond the usual standards - Health, vision, dental, HSA/FSA, and mental health support.</li><li><b>Stock options</b> - every Full Time Employee has ownership in Aiwyn's future and success.</li><li><b>401(k) matching</b></li><h3>Our Values:</h3><li><b>Trust</b> - We champion transparency, welcome differing perspectives, uphold accountability, and trust that others have good intentions</li><li><b>Courage</b> - We have the courage to take calculated risks and embrace change, knowing what worked in the past won’t always work in the future</li><li><b>Impact</b> - Rooted in determination and innovation, we chase extraordinary outcomes and impactful results</li><li><b>Relentlessness</b> - We approach challenges with an unwavering resolve, never settling for mediocrity, and always striving to surpass expectations</li><h3>Learn more about Aiwyn:</h3><li><a rel=\"noopener noreferrer\" class=\"postings-link\" href=\"https://www.aiwyn.ai/about\"><b>About us</b></a></li><li><a rel=\"noopener noreferrer\" class=\"postings-link\" href=\"https://www.aiwyn.ai/why-aiwyn\"><b>Why Aiwyn</b></a></li><li><a rel=\"noopener noreferrer\" class=\"postings-link\" href=\"https://www.youtube.com/@AiwynAI\"><b>YouTube page</b></a></li><div>Aiwyn is an equal opportunity employer. All qualified applicants will receive consideration for employment without regard to age, ancestry, color, family or medical care leave, gender identity or expression, genetic information, marital status, medical condition, national origin, physical or mental disability, political affiliation, protected veteran status, race, religion, sex (including pregnancy), sexual orientation, or any other characteristic protected by applicable laws, regulations and ordinances.</div><div><br></div><div>Candidate information will be treated in accordance with our CCPA privacy notice which can be found here: <a rel=\"noopener noreferrer\" class=\"postings-link\" href=\"https://www.aiwyn.ai/ccpa\">https://www.aiwyn.ai/ccpa</a></div>","tags":"[\"management\",\"b2b\",\"aws\"]","pubDate":"2025-01-30T05:19:48.081Z","link":"https://jobs.lever.co/aiwyn/650cdf82-ed37-4423-8c03-d33f8744f292","slug":"sr-event-marketing-manager-aiwyn-5529"},{"id":6727004287,"title":"Controller","company":"Sardine","image":"https://avatars.githubusercontent.com/u/65879301?s=200&v=4","description":"<p style=\"min-height:1.5em\"><strong>Who we are:</strong></p><p style=\"min-height:1.5em\">We are a leader in fraud prevention and AML compliance. Our platform uses device intelligence, behavior biometrics, machine learning, and AI to stop fraud before it happens. Today, over 300 banks, retailers, and fintechs worldwide use Sardine to stop identity fraud, payment fraud, account takeovers, and social engineering scams. We have raised $75M from world-class investors including Andreessen Horowitz, Visa, Experian, FIS, and Google Ventures.</p><p style=\"min-height:1.5em\"></p><p style=\"min-height:1.5em\"><strong>Our culture:</strong></p><ul style=\"min-height:1.5em\"><li><p style=\"min-height:1.5em\">We have hubs in the Bay Area, NYC, Austin, and Toronto. However, we maintain a remote-first work culture. #WorkFromAnywhere</p></li><li><p style=\"min-height:1.5em\">We hire talented, self-motivated individuals with extreme ownership and high growth orientation. </p></li><li><p style=\"min-height:1.5em\">We value performance and not hours worked. We believe you shouldn't have to miss your family dinner, your kid's school play, friends get-together, or doctor's appointments for the sake of adhering to an arbitrary work schedule.</p></li></ul><p style=\"min-height:1.5em\"></p><p style=\"min-height:1.5em\"><strong>Location:</strong></p><ul style=\"min-height:1.5em\"><li><p style=\"min-height:1.5em\">US or Canada (East Coast Preferred) - Remote</p></li></ul><ul style=\"min-height:1.5em\"><li><p style=\"min-height:1.5em\">From Home / Beach / Mountain / Cafe / Anywhere!</p></li><li><p style=\"min-height:1.5em\">We are a remote-first company with a globally distributed team. So you can find your productive zone and work from there.</p></li></ul><p style=\"min-height:1.5em\"></p><p style=\"min-height:1.5em\"><strong>About the Role:</strong></p><p style=\"min-height:1.5em\">We are looking for a highly skilled and experienced Controller to lead our accounting team. This role will oversee the accounting for the company, including all subsidiaries. Additionally, the individual will be heavily involved in cross-departmental initiatives and strategic decisions. A core responsibility will also include managing the relationship with our auditors and tax accountants and facilitating information sharing with our board and investors. The ideal candidate will possess deep accounting knowledge, experience in a SaaS business, strong leadership capabilities, and excellent communication skills.</p><p style=\"min-height:1.5em\"></p><p style=\"min-height:1.5em\"><strong>Key Responsibilities:</strong></p><ul style=\"min-height:1.5em\"><li><p style=\"min-height:1.5em\">Oversee the operations of the accounting department.</p></li><li><p style=\"min-height:1.5em\">Successfully run audits for our parent company and subsidiaries.</p></li><li><p style=\"min-height:1.5em\">Manage financial reporting for the company and prepare materials for the board on a quarterly basis.</p></li><li><p style=\"min-height:1.5em\">Assist with regular reporting for regulators and investors.</p></li><li><p style=\"min-height:1.5em\">Enhance and implement financial systems to ensure uninterrupted service as the company grows.</p></li><li><p style=\"min-height:1.5em\">Implement and strengthen internal controls and processes to continuously protect company assets.</p></li><li><p style=\"min-height:1.5em\">Support cross-functional teams in making key decisions regarding spending, profitability, ROI, and process improvements.</p></li><li><p style=\"min-height:1.5em\">Oversee accounts payable and accounts receivable functions.</p></li></ul><p style=\"min-height:1.5em\"></p><p style=\"min-height:1.5em\"><strong>Qualifications:</strong></p><ul style=\"min-height:1.5em\"><li><p style=\"min-height:1.5em\">Over 10 years of experience in accounting and/or auditing</p></li><li><p style=\"min-height:1.5em\">Experience managing a small, high-performing team</p></li><li><p style=\"min-height:1.5em\">Experience working at a SaaS company or providing services to a SaaS company</p></li><li><p style=\"min-height:1.5em\">In-depth understanding of GAAP</p></li><li><p style=\"min-height:1.5em\">Experience with system implementations</p></li><li><p style=\"min-height:1.5em\">CPA certification is required</p></li><li><p style=\"min-height:1.5em\">Strong attention to detail</p></li><li><p style=\"min-height:1.5em\">Ability to communicate complex concepts to both technical and non-technical audiences, including C-suite executives</p></li><li><p style=\"min-height:1.5em\">Capacity to work effectively with cross-functional teams and external stakeholders</p></li></ul><p style=\"min-height:1.5em\"></p><p style=\"min-height:1.5em\"><strong>Compensation:</strong> Base pay range of $160,000 - $210,000 + equity with tremendous upside potential + Attractive benefits</p><p style=\"min-height:1.5em\"></p><p style=\"min-height:1.5em\"><strong>Benefits we offer:</strong></p><ul style=\"min-height:1.5em\"><li><p style=\"min-height:1.5em\">Generous compensation in cash and equity</p></li><li><p style=\"min-height:1.5em\">Early exercise for all options, including pre-vested</p></li><li><p style=\"min-height:1.5em\">Work from anywhere: Remote-first Culture</p></li><li><p style=\"min-height:1.5em\">Flexible paid time off, Year-end break, Self care days off</p></li><li><p style=\"min-height:1.5em\">Health insurance, dental, and vision coverage for employees and dependents - <em>US and Canada specific</em></p></li><li><p style=\"min-height:1.5em\">4% matching in 401k / RRSP - <em>US and Canada specific</em></p></li><li><p style=\"min-height:1.5em\">MacBook Pro delivered to your door</p></li><li><p style=\"min-height:1.5em\">One-time stipend to set up a home office — desk, chair, screen, etc.</p></li><li><p style=\"min-height:1.5em\">Monthly meal stipend</p></li><li><p style=\"min-height:1.5em\">Monthly social meet-up stipend</p></li><li><p style=\"min-height:1.5em\">Annual health and wellness stipend</p></li><li><p style=\"min-height:1.5em\">Annual Learning stipend</p></li><li><p style=\"min-height:1.5em\">Unlimited access to an expert financial advisory</p></li></ul><p style=\"min-height:1.5em\"></p><p style=\"min-height:1.5em\">Join a fast-growing company with world-class professionals from around the world. If you are seeking a meaningful career, you found the right place, and we would love to hear from you.</p>","tags":"[\"engineering\"]","pubDate":"2025-01-30T03:09:58.911Z","link":"https://jobs.ashbyhq.com/sardine/75c89333-c244-4080-a21e-7991b7817ed9","slug":"controller-sardine-5854"},{"id":3501715676,"title":"Head of Data","company":"HappyCo","image":"https://avatars.githubusercontent.com/u/1021150?s=200&v=4","description":"<div><b style=\"font-size: 11pt\">HappyCo is a company where people can grow their careers and work with like minded people, with no egos or politics. HappyCo is values driven and offers a flexible, supportive culture. Join HappyCo and </b><a class=\"postings-link\" href=\"https://happy.co/media/make-work-happy\"><b style=\"font-size: 11pt\">Make Work Happy</b></a><b style=\"font-size: 11pt\">!</b></div><div><br></div><div><span style=\"font-size: 10pt;\">We’re looking for an experienced </span><b style=\"font-size: 10pt;\">Head of Data</b><span style=\"font-size: 10pt;\"> to join our team.</span></div><div><br></div><div><b style=\"font-size: 10pt;\">The Position</b></div><div><br></div><div><span style=\"font-size: 10pt;\">HappyCo is seeking an experienced and visionary Head of Data to lead the development and execution of our data strategy, ensuring alignment with the company’s goals and product roadmap. This role will set the technical direction for data-related initiatives, overseeing architecture, warehousing, analytics, and reporting to unlock the full potential of data-driven decision-making.</span></div><div><br></div><div><span style=\"font-size: 10pt;\">As a key collaborator, the Head of Data will work across departments to understand organizational data needs, developing and maintaining scalable data infrastructure to support storage, reporting, and security requirements. This role will implement best practices for ETL/ELT pipelines, data governance, and cost-effective utilization of cloud services and tooling. This person will also provide leadership and mentorship to the data team members and others in Product and Engineering, fostering growth and innovation while promoting a culture of excellence.</span></div><div><span style=\"font-size: 10pt;\">We’re looking for an experienced </span><b style=\"font-size: 10pt;\">Head of Data</b><span style=\"font-size: 10pt;\"> to join our team.</span></div><div><br></div><div><b style=\"font-size: 10pt;\">The Position</b></div><div><br></div><div><span style=\"font-size: 10pt;\">HappyCo is seeking an experienced and visionary Head of Data to lead the development and execution of our data strategy, ensuring alignment with the company’s goals and product roadmap. This role will set the technical direction for data-related initiatives, overseeing architecture, warehousing, analytics, and reporting to unlock the full potential of data-driven decision-making.</span></div><div><br></div><div><span style=\"font-size: 10pt;\">As a key collaborator, the Head of Data will work across departments to understand organizational data needs, developing and maintaining scalable data infrastructure to support storage, reporting, and security requirements. This role will implement best practices for ETL/ELT pipelines, data governance, and cost-effective utilization of cloud services and tooling. This person will also provide leadership and mentorship to the data team members and others in Product and Engineering, fostering growth and innovation while promoting a culture of excellence.</span></div><h3>Core Responsibilities</h3><li>Define and drive the data strategy to support the company’s overall goals and product roadmap</li><li>Set technical and product direction for data-related initiatives including data architecture, warehousing, analytics, and reporting</li><li>Collaborate with stakeholders across company departments to understand data and insight needs</li><li>Develop and maintain scalable data architecture and infrastructure that meets current and future needs for storage, reporting, security</li><li>Implement best practices for secure and scalable ETL/ELT pipelines and data governance</li><li>Provide mentorship and leadership for data team members, fostering an environment of growth and individual development</li><li>Monitor and effectively manage utilization and cost of data products, cloud services, and third-party tooling</li><h3>What we think you need to be successful</h3><li>At least 7&nbsp; years of proven experience delivering and executing on a strategic vision in data engineering, data warehousing, or enterprise reporting</li><li>Experience with BI and data warehouse tools, databases and data modeling, (relational, document SQL or NoSQL)</li><li>Excellence in data modeling techniques and strategies</li><li>Programming and scripting skills (python, bash preferred) </li><li>Experience working in cloud platforms such as AWS, Azure, GCP (preferred)</li><li>Experience managing and mentoring junior data engineers and/or analysts</li><li>Identifies and addresses improvements and efficiencies</li><li>Excellent oral and written communication skills, including the ability to explain technology solutions in business terms, establish rapport and persuade others</li><li>Broad knowledge of current and emerging technologies, technology directions, and strategic application to business needs</li><h3>Technologies Used</h3><li>Google Cloud Platform (GCP): Cloud Storage, BigQuery, Datastream, CloudSQL, PubSub, Functions, etc.</li><li>Databricks</li><li>Relational databases: Postgresql</li><li>AI and ML: GCP Vertex, GCP Gemini AI, OpenAI</li><li>Looker and LookML</li><div><b style=\"font-size: 11pt\">About HappyCo</b>&nbsp;</div><div>Founded in 2011, HappyCo (<a class=\"postings-link\" href=\"http://happy.co\">happy.co</a>) builds mobile and cloud solutions to enable real-time property data. Our flagship product suite 'Happy Property’ has 3.5M units on its platform and has captured more than 400 million photos.&nbsp;</div><div><br></div><div>We’re everyday people with a shared purpose — improving the lives of others. Our team is made up of thinkers, talkers, planners, makers, builders and everything in between. Together, we’re turning our passions into happier communities!&nbsp;&nbsp;</div><div><br></div><div>When customers use our software, their communities get stronger. Our tools empower everyone in multifamily property management to improve their operations and maximize returns, which means they’re building better experiences for their residents. Learn more about our <a class=\"postings-link\" href=\"https://happyco-inc.wistia.com/medias/1va4woy4m3\">Product Vision</a> here!</div><div><br></div><div><b style=\"font-size: 11pt\">Our HappyCo Culture</b></div><div>HappyCo strives to build better communities. So naturally, we are dedicated to making our own community an enjoyable place that allows us do our best work. We’re devoted to building an inclusive, supportive culture that empowers each HappyCo’er to succeed and grow. To learn more about our culture, check out our <a class=\"postings-link\" href=\"https://happy.co/company/careers\">careers page</a>!&nbsp;</div><div><br></div><div><b>We Offer:</b></div><div>- Work from anywhere supported by a flexible company culture</div><div>- Opportunity to work for one of the fastest growing technology companies in the PropTech industry</div><div>- Unlimited vacation time</div><div>- Generous paid parental leave</div><div>- Competitive and equitable pay, including stock options</div><div>- Monthly stipends to support Wellness and Home Office expenses</div><div><br></div><div>Find out more about our <a class=\"postings-link\" href=\"https://happy.co/company/careers/employee-benefits-usa\">US Employee Benefits</a> here!</div><div><br></div><div><i style=\"font-size: 11pt\">We believe in supporting people to do their best work and thrive, and building a diverse, equitable, and inclusive company is core to our mission. Our goal is to ensure that HappyCo upholds an inclusive environment where all people feel that they are equally respected and valued, whether they are applying for an open position or working at the company. We welcome applicants of any educational background, gender identity and expression, sexual orientation, religion, ethnicity, age, citizenship, socioeconomic status, disability, and veteran status. HappyCo is also committed to providing reasonable accommodations for qualified individuals with disabilities and disabled veterans in our job application procedures.</i></div><div><br></div><div><i style=\"font-size: 11pt\">A note to Recruitment Agencies: Please don’t reach out to us about our roles -- we’ve got it covered. We don’t accept unsolicited agency resumes and HappyCo is not responsible for any fees related to unsolicited resumes.</i></div><div><b style=\"font-size: 11pt\">HappyCo is a company where people can grow their careers and work with like minded people, with no egos or politics. HappyCo is values driven and offers a flexible, supportive culture. Join HappyCo and </b><a href=\"https://happy.co/media/make-work-happy\" class=\"postings-link\"><b style=\"font-size: 11pt\">Make Work Happy</b></a><b style=\"font-size: 11pt\">!</b></div>","tags":"[\"postgres\",\"management\",\"engineering\",\"database\",\"aws\"]","pubDate":"2025-01-30T00:50:49.036Z","link":"https://jobs.lever.co/happyco/38297af3-c0d3-4ed1-96ab-2db9ccc8f7be","slug":"head-of-data-happyco-9986"},{"id":3987531563,"title":"Digital Insurance Project Manager (Fully Remote)","company":"CoverGo","image":"https://pbs.twimg.com/profile_images/1382655628523364355/MWPIbbID_400x400.jpg","description":"<p><strong>Top 3 Reasons To Join Us</strong></p><ul> <li>Competitive Salary</li> <li>100% Remote</li> <li>Working on the latest tech for the Insurtech Market Leader</li> </ul><p><strong>About Us</strong></p><p>At CoverGo, our mission is to empower all insurance companies to make insurance 100% digital and accessible to everyone.</p><ul> <li>We are a leading global no-code insurance platform for health, life, and P&amp;C</li> <li>We’re the winner of the Insurtech of the Year in all of Asia and other awards globally</li> <li>We work with insurance enterprise clients such as AXA, Bupa, MSIG, Dai-ichi, Bank of China Group Insurance, and many more</li> <li>We're an international, diverse team of over 120 people with 30 nationalities and team members working remotely from all over the world</li> <li>We are fully funded and backed by reputable VC funds and strategic institutional investors</li> <li>We have a global presence in Asia, EMEA and the Americas</li> <li>We’ve grown our annualized revenue by over 30x since January 2021</li> <li>We’re constantly working towards making CoverGo a workplace that you love coming to. We deeply believe that bringing together a diversity of thoughts, expressions, and perspectives is key to building the best culture for equally diverse communities all over the world and a workplace that you love coming to. We deeply believe that bringing together a diversity of thoughts, expressions, and perspectives is key to building the best culture for equally diverse communities all over the world</li> </ul><p><strong>About the Role</strong></p><p>As a Digital Insurance Project Manager, your core responsibility will be to oversee and manage the implementation of new and/or existing projects within CoverGo's operations. This role presents an exciting opportunity for an individual with a strong drive to lead transformative projects in the insurtech industry. </p><p><strong>What You Will Do</strong></p><ul> <li>Engage and manage relationships with clients and stakeholders</li> <li>Lead project planning sessions with the internal team and client's staff</li> <li>Support solution proposals for client pursuits, proposals, and PoCs</li> <li>Participate in proposal and POC processes (i.e. design, submission, and review)</li> <li>Support the creation of contracts and related communication with clients</li> <li>Identify and help secure growth opportunities for existing clients</li> <li>Manage project progress and adapt work as required</li> <li>Ensure projects meet deadlines</li> <li>Manage relationships with clients and stakeholders</li> <li>Host regular/weekly project review and create reports with key metrics about team and project status using company standard metrics</li> <li>Oversee all incoming and outgoing project documentation</li> <li>Identify and manage issues, risks, assumptions, and dependencies</li> <li>Continuously optimize and improve processes and the overall approach where necessary</li> </ul><p><strong>What We Need</strong></p><ul> <li>Bachelor's degree in computer science or a related technical field is a plus</li> <li>5+ years experience as a Project Manager</li> <li>Insurance domain knowledge is a must</li> <li>Strong client facing experience is a must</li> <li>Technical skills are a plus</li> <li>Has experience seeing projects through the full life cycle</li> <li>Excellent analytical skills and problem-solving skills</li> <li>Strong interpersonal skills and extremely resourceful</li> <li>Proven ability to complete projects according to outlined scope, budget, and timeline</li> <li>Self-motivated and able to work independently</li> <li>Able, willing, and excited to work in a fast-paced collaborative startup environment</li> <li>Must be based in the Philippines</li> </ul><p><strong>Why You'll Love Working Here</strong></p><ul> <li>Fully Remote</li> <li>Flexible Leave</li> <li>International Environment</li> <li>Competitive renumeration package</li> <li>Performance Bonus</li> <li>Stock Options after 6 months</li> <li>Company activities and events</li> <li>Learning and development plan</li> <li>Remote work allowance</li> </ul><p><strong>CoverGo Company </strong><a href=\"https://www.youtube.com/watch?v=YI0ezLxvFvA\" rel=\"nofollow noreferrer noopener\" class=\"external\"><strong>Video</strong></a></p><p>By submitting your application, you confirm that you have read, understood, and accepted the content of CoverGo’s <a href=\"https://apply.workable.com/covergo/gdpr_policy?lng=en\" target=\"_blank\" rel=\"nofollow noreferrer noopener\" class=\"external\">Privacy Notice</a> and you consent to the processing of your data as part of this application.</p><p><a href=\"https://www.youtube.com/watch?v=YI0ezLxvFvA\" rel=\"nofollow noreferrer noopener\" class=\"external\"></a></p><h3>Requirements: </h3><h3>Benefits: </h3>","tags":"[]","pubDate":"2025-01-30T00:00:00.000Z","link":"https://apply.workable.com/covergo/j/8F609C7217","slug":"digital-insurance-project-manager-fully-remote-covergo-7062"},{"id":6425192387,"title":"Staff iOS Engineer","company":"Empower","image":"https://lever-client-logos.s3.us-west-2.amazonaws.com/2e1a369c-b58f-41ac-8d86-4b0a77695e68-1687915522032.png","description":"<p style=\"min-height:1.5em\"><strong>EMPOWER OVERVIEW</strong></p><p style=\"min-height:1.5em\"><a target=\"_blank\" rel=\"noopener noreferrer nofollow\" href=\"http://empower.me/\">Empower</a> is shaking up an outdated financial system by providing real opportunity for our customers: the opportunity to get the cash they need, to access fair credit, and to change their financial story. Today, we’re helping millions of people find financial security through machine learning models that evaluate creditworthiness using a more inclusive lens and mobile-first products: Cash Advance, Thrive line of credit, and Petal credit cards. Tomorrow? Creating even more financial paths for our customers (and their wallets) to succeed.</p><p style=\"min-height:1.5em\">This year, Empower ranked #65 on Inc. 5000’s Fastest-Growing Private Companies list — our third year in a row cracking the top 100 — and was named by Forbes as one of the 25 Next Billion-Dollar Startups for 2024. Empower was also featured by Forbes on America’s Best Startup Employers list in 2023, and our Thrive line of credit product was named by Fast Company as one of 2022’s Next Big Things in Tech.</p><p style=\"min-height:1.5em\">Empower is backed by Sequoia Capital, Blisce, and Icon Ventures. Ready to grow your impact and accelerate your career? Take a look at our open roles — we can’t wait to meet you.</p><p style=\"min-height:1.5em\"></p><p style=\"min-height:1.5em\"><strong>THE EMPOWER WAY</strong></p><p style=\"min-height:1.5em\"><strong>Great Expectations</strong>: We come up with bold, audacious goals for ourselves and go all out for impact</p><p style=\"min-height:1.5em\"><strong>Owner Mindset</strong>: We give every employee latitude to act independently, make smart choices, and move the business forward</p><p style=\"min-height:1.5em\"><strong>Spirited Debate</strong>: We love skeptics and seek counter opinions to challenge our personal assumptions and expand our view</p><p style=\"min-height:1.5em\"><strong>Customer Obsession:</strong> We listen to understand, empathize, and create a memorable, rewarding experience for our community</p><p style=\"min-height:1.5em\"><strong>Inclusive Collaboration</strong>: We believe diverse teams make the best decisions, and we strive to give diverse voices a seat at the table</p><p style=\"min-height:1.5em\"><strong>No Jerks Allowed</strong>: We value our relationships and take the time to build trust and connection and communicate respectfully</p><p style=\"min-height:1.5em\"></p><p style=\"min-height:1.5em\"><strong>WHAT EMPOWER OFFERS</strong></p><p style=\"min-height:1.5em\">Competitive salary</p><p style=\"min-height:1.5em\">Generous equity package</p><p style=\"min-height:1.5em\">Full healthcare benefits</p><p style=\"min-height:1.5em\">Technology expense reimbursement</p><p style=\"min-height:1.5em\">Virtual first environment</p><p style=\"min-height:1.5em\"><strong>JOB DESCRIPTION</strong></p><p style=\"min-height:1.5em\"></p><p style=\"min-height:1.5em\">We’re looking for an iOS Engineer to join our close-knit team and play a key role in the development of our Thrive product. This is a unique opportunity to help us rethink how Thrive provides access to credit for millions of underserved users. As a key member of a small, fast-paced team, you'll have the opportunity to take ownership of critical features, pitch experiments, and design features that directly impact our users.  If you’re excited about tackling meaningful challenges, shaping product strategy, and delivering innovative solutions in a hands-on setting, we’d love to meet you!<br /><br />Travel for company offsites is expected at a minimum 2 times a year.</p><p style=\"min-height:1.5em\"></p><p style=\"min-height:1.5em\"><strong>Key Responsibilities</strong></p><ul style=\"min-height:1.5em\"><li><p style=\"min-height:1.5em\">Collaborate with product managers, backend engineers, and other team members to define, design and ship new features that create customer and business value.</p></li><li><p style=\"min-height:1.5em\">Analyze user feedback, app analytics, and performance metrics to help prioritize features or improvements.</p></li><li><p style=\"min-height:1.5em\">Participate in code reviews to ensure quality, performance, and maintainability.</p></li><li><p style=\"min-height:1.5em\">Minimizing defects and improving reliability through: Development of automated tests, manual test validation, development of fit for purpose architecture and code, contributing to PRs</p></li><li><p style=\"min-height:1.5em\">Improve and maintain our iOS build and release process</p></li><li><p style=\"min-height:1.5em\">Adopt and evangelize the use of AI tooling to improve the speed and efficiency of software development</p></li><li><p style=\"min-height:1.5em\">Continuously learn and adopt new iOS technologies, frameworks, and tools (e.g., SwiftUI, Combine, Core Data).</p></li><li><p style=\"min-height:1.5em\">Drive technical excellence across teams by establishing architectural patterns and best practices that scale with our growing user base.</p></li><li><p style=\"min-height:1.5em\">Shape and evangelise the technical vision for our iOS platform while mentoring engineers to level up their technical capabilities</p></li><li><p style=\"min-height:1.5em\">Partner with engineering leadership to identify and resolve technical debt, while balancing short-term delivery needs with long-term platform health</p></li></ul><p style=\"min-height:1.5em\"></p><p style=\"min-height:1.5em\"><strong>Candidate Qualifications</strong></p><ul style=\"min-height:1.5em\"><li><p style=\"min-height:1.5em\">5+ years developing consumer facing iOS apps</p></li><li><p style=\"min-height:1.5em\">Experience working in Swift and iOS UI Frameworks</p></li></ul><p style=\"min-height:1.5em\">At Empower, we hire for people that push themselves to understand others and seek out ways to challenge their personal assumptions. Our hope is that by fostering such an environment, we strengthen our business and relationships by putting people first. We are committed to building a diverse, inclusive, and equitable workspace where everyone (regardless of age, education, ethnicity, gender, sexual orientation, or any personal characteristics) feels like they belong. Even if your experience doesn’t exactly match up to our job description, you should feel empowered to apply regardless!</p>","tags":"[\"engineering\"]","pubDate":"2025-01-29T18:56:44.218Z","link":"https://jobs.ashbyhq.com/empower%20finance/0dd3d526-092b-46ed-b595-21790032f02f","slug":"staff-ios-engineer-empower-5894"},{"id":3829647951,"title":"Senior DevOps Engineer","company":"Counterpart","image":"https://media.licdn.com/dms/image/v2/D560BAQEtAXn0ryOTBw/company-logo_200_200/company-logo_200_200/0/1694785555271/yourcounterpart_logo?e=1744243200&v=beta&t=-BEjbQP7PMMfAC5PtCYEgvJk4MuWZ4Bfzh54loGzpwo","description":"&lt;p&gt;&lt;strong&gt;SENIOR DEVOPS ENGINEER&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;Counterpart is a modern management &amp;amp; professional liability insurance platform for the 21st century workplace. We offer products and services to help companies align the risks and incentives of creating great organizations. Our platform is designed to measure risk more efficiently using the most advanced rating system in the industry, while also proactively mitigating the risks of our insureds. Ultimately, we provide businesses with the framework to be the best versions of themselves. That’s where you come in.&lt;/p&gt;\n&lt;p&gt;As a Senior DevOps Engineer, you will be a thought leader and prolific individual contributor to the infrastructure, dynamic data services, and tooling that we are leveraging to shape the future of insurance. You will help bridge the gap between Product, Insurance, and Data while architecting the infrastructure underneath our systems and ensuring we are prepared in production and ready to disrupt the industry. Think of the words Automation, Platform, Security, and Observability. In addition, you will interact with multiple development teams and help to set the culture, rituals, and processes that underpin a high functioning engineering team and the organization more broadly.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;YOU WILL&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;Below are some key projects we are working on. You will be a part of one or more of these objectives:&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;&lt;strong&gt;Modernize insurance application workflows&lt;/strong&gt;. We are enhancing our Django system to update and automate workflows for our Risk Engineering team. You will be responsible for migrating key parts of the UI and enhancing the backend to support the best user experience possible.&lt;/li&gt;\n&lt;li&gt;&lt;strong&gt;Increase efficiency with AI&lt;/strong&gt;. Collaborate with the Data and Risk Engineering teams to leverage AI across our products via a React frontend. Process documents into actionable, structured information.&lt;/li&gt;\n&lt;li&gt;&lt;strong&gt;Enable small businesses to manage HR with modern software&lt;/strong&gt;. Enhance our HR application to support its next phase of growth.&lt;/li&gt;\n&lt;li&gt;&lt;strong&gt;Emerging Products&lt;/strong&gt;. Create new services to enable our Claims team to process a larger volume of complex claims across many different insurance lines.&lt;/li&gt;\n&lt;li&gt;&lt;strong&gt;Standardize development processes&lt;/strong&gt;. Work with engineering leaders to create documentation, examples, and training for the wider team. Our goal is to standardize how we do work in our Python and Javascript code bases. This will have a huge impact on our quality as we grow.&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;&lt;strong&gt;YOU HAVE&lt;/strong&gt;&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;A passion for programming and a love of building and experimentation&lt;/li&gt;\n&lt;li&gt;5+ years of experience with AWS&lt;/li&gt;\n&lt;li&gt;3+ years of experience with Python&lt;/li&gt;\n&lt;li&gt;2+ years of experience with relational databases&lt;/li&gt;\n&lt;li&gt;Experience with Terraform&lt;/li&gt;\n&lt;li&gt;Effective communication &amp;amp; documentation skills&lt;/li&gt;\n&lt;li&gt;Experience working on a remote team&lt;/li&gt;\n&lt;li&gt;Experience leading infrastructure architecture and optimization.&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;&lt;strong&gt;Who you will work with&lt;/strong&gt;&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;&lt;strong&gt;Derrick Franco, Engineering Manager:&lt;/strong&gt; After teaching himself to code at 13, Derrick went on to co-found Jumpstart in addition to building out the technical divisions at InvestorsAlley and Phinaz Media Group. Nowadays Derrick spends his time reading, with his wife, and working on his podcast The Future of Work Project.&lt;/li&gt;\n&lt;li&gt;&lt;strong&gt;Julian Prokay, Engineering Manager: &lt;/strong&gt;A veteran of the SaaS space with experience working on both student systems and construction management software. In his free time, he enjoys history podcasts and fantasy literature.&lt;/li&gt;\n&lt;li&gt;&lt;strong&gt;Ron Alexessen, Engineering Manager: &lt;/strong&gt;Ron has experience at large companies like Hewlett-Packard, New Relic, and Rackspace and feels most impactful at small firms and startups. Embracing a chaordic style, both at work and home, is just right. For balance, Ron climbs, runs, and plays a supporting role for his active teenagers.&lt;/li&gt;\n&lt;li&gt;&lt;strong&gt;David Drake, Engineering Manager: &lt;/strong&gt;David combines a theatre degree, a programming degree, and 17 years of professional software experience to bring heart and technical expertise to his engineering teams. A former founder with a Commodore 64 tattoo, he balances his passion for technology with time spent with his partner and 9-year-old daughter, as well as hobbies like reading, meditation, cooking, and exploring the outdoors.&lt;/li&gt;\n&lt;li&gt;&lt;strong&gt;Newton Troung, Engineering Manager&lt;/strong&gt;: Newton joins Counterpart with 7+ years of experience in platform and data engineering. In his last company Thrive Market, he had a hand in building out new microservices and architecting data pipelines with Airflow and Spark. He&#39;s vegetarian and loves trying new restaurants when traveling. Nowadays he&#39;s busy keeping up with his 2-year-old and doing outdoor activities with his family.&amp;nbsp;&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;Our estimated pay range for this role is $185,000 to $220,000. Base salary is determined by a variety of factors, including but not limited to, market data, location, internal equitability, and experience.&lt;/p&gt;\n&lt;p&gt;We are committed to being a welcoming and inclusive workplace for everyone, and we are intentional about making sure people feel respected, supported and connected at work—regardless of who you are or where you come from. We value and celebrate our differences and we believe being open about who we are allows us to do the best work of our lives.&lt;/p&gt;\n&lt;p&gt;We are an Equal Opportunity Employer. We do not discriminate against qualified applicants or employees on the basis of race, color, religion, gender identity, sex, sexual preference, sexual identity, pregnancy, national origin, ancestry, citizenship, age, marital status, physical disability, mental disability, medical condition, military status, or any other characteristic protected by federal, state, or local law, rule, or regulation.&lt;/p&gt;","tags":"[\"javascript\",\"management\",\"engineering\",\"database\",\"aws\"]","pubDate":"2025-01-29T17:11:10.000Z","link":"https://job-boards.greenhouse.io/counterpart/jobs/4517224005","slug":"senior-devops-engineer-counterpart-5578"},{"id":6784476535,"title":"Product Manager - Engagement and Subscriptions (Remote Work from Anywhere)","company":"Xapo Bank","image":"https://avatars.githubusercontent.com/u/6930305?s=200&v=4","description":"&lt;div class=&quot;content-intro&quot;&gt;&lt;p style=&quot;text-align: left;&quot;&gt;&lt;span style=&quot;font-weight: 900;&quot;&gt;Work from anywhere, impact everywhere&amp;nbsp;&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;Diversity is at the heart of who we are at Xapo Bank. We’re a fully distributed team of over 140 Xapiens that work remotely from 40+ countries around the world.&amp;nbsp;&lt;/p&gt;\n&lt;p&gt;Our beginning: A world that enjoys economic freedom and wealth protection, no matter where you live or who is running your country. This is the dream that drove Wences Casares, our Founder and Chairman, to quietly transform the world of banking.&lt;/p&gt;\n&lt;p&gt;To achieve that, we search the world for the best people for the job. We work hard, think globally, and inspire each other to learn and grow. We are committed to changing the way things are done.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Risk is inherent in all of our business activities and managing risk well is the responsibility of every Xapien. Sound risk management enables us to serve our customers and deliver value for our shareholders, and helps make Xapo a great place to work.&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&amp;nbsp;&lt;/p&gt;\n&lt;p style=&quot;text-align: left;&quot;&gt;&lt;em&gt;&lt;span style=&quot;font-weight: 500;&quot;&gt;Although we are headquartered in Gibraltar, this is a full time, 100% remote position&amp;nbsp;&lt;br&gt;&lt;/span&gt;&lt;/em&gt;&lt;em&gt;&lt;span style=&quot;font-weight: 500;&quot;&gt;Work from anywhere!&lt;/span&gt;&lt;/em&gt;&lt;/p&gt;\n&lt;p style=&quot;text-align: left;&quot;&gt;&amp;nbsp;&lt;/p&gt;&lt;/div&gt;&lt;p&gt;&lt;strong&gt;&lt;em&gt;Position overview&lt;/em&gt;&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;We are seeking an exceptional Product Manager for Engagement, and Subscriptions to lead the discovery and execution of initiatives that drive engagement and boost product adoption while providing a premium customer experience. As a Product Manager at our company, you will act as the CEO of your area, driving outcomes that balance member experience, business goals, and member retention.&lt;/p&gt;\n&lt;p&gt;Mission&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;Provide our members with a best-in-class, seamless experience across all touchpoints of their journey with our product.&lt;/li&gt;\n&lt;li&gt;Develop and execute comprehensive engagement strategies that maximize activation, retention, and subscription rates while fostering a deep connection between our members and our product.&amp;nbsp;&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;This role is ideal for a proactive, data-driven thinker with a passion for member-centricity and a go-getting attitude. You will navigate challenges autonomously and drive impactful solutions in a dynamic environment. This demands a hands-on approach, sharp analytical skills, and a strategic vision for your area. You’ll have to independently tackle challenges while excelling in a collaborative environment across multiple domains.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;&lt;em&gt;Responsibilities&lt;/em&gt;&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;Product Discovery &amp;amp; Strategy&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;Define a vision and strategy, and prioritize initiatives that drive activation, engagement and growth.&amp;nbsp;&lt;/li&gt;\n&lt;li&gt;Engage with members, stakeholders (including C-level), and cross-functional teams to identify challenges and opportunities.&lt;/li&gt;\n&lt;li&gt;Use qualitative (e.g., user interviews) and quantitative (e.g., engagement metrics) insights to pinpoint improvement opportunities.&lt;/li&gt;\n&lt;li&gt;Design and implement robust A/B tests and experimentation frameworks to validate hypotheses and optimize activation, engagement and growth.&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;Product Execution&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;Develop and optimize member journeys to maximize activation, engagement, and subscription rates.&lt;/li&gt;\n&lt;li&gt;Lead cross-functional teams (mobile/backend engineers, product designer) to plan, execute, and iterate on impactful product changes and engagement campaigns.&lt;/li&gt;\n&lt;li&gt;Use data-driven insights to refine features and measure success through metrics like member activation rates, engagement levels, and subscription growth.&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;Thought Leadership&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;Act as the go-to expert in your product area, ensuring clear alignment of goals and priorities among all stakeholders. We want you to be a thought leader, both internally as well as externally.&amp;nbsp;&lt;/li&gt;\n&lt;li&gt;Stay informed and up-to-date on industry trends, best practices in user engagement, and innovative communication strategies.&lt;/li&gt;\n&lt;li&gt;Translate technical concepts into user-friendly language for both internal and external communications.&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;&lt;strong&gt;&lt;em&gt;Skills needed&lt;/em&gt;&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;Experience&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;3+ years of experience, preferably in technology-driven fintech, regtech, or digital banking companies.&lt;/li&gt;\n&lt;li&gt;Proven track record of delivering user-focused products in complex domains.&lt;/li&gt;\n&lt;li&gt;Strong analytical skills with experience using data analytics tools, particularly Amplitude.&lt;/li&gt;\n&lt;li&gt;Experience with agile methodologies and product development processes&lt;/li&gt;\n&lt;li&gt;Experience in designing, implementing, and analyzing A/B tests or other experimental methodologies.&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;Domain Knowledge&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;Expertise in user engagement strategies, customer retention, and subscription-based business models.&lt;/li&gt;\n&lt;li&gt;Deep understanding of various communication channels and tools, including email marketing, push notifications, and in-app messaging.&lt;/li&gt;\n&lt;li&gt;Familiarity with user behavior analytics, cohort analysis, and engagement metrics.&lt;/li&gt;\n&lt;li&gt;Strong grasp of product lifecycle management and user journey optimization.&lt;/li&gt;\n&lt;li&gt;Knowledge of A/B testing methodologies and experimentation frameworks.&lt;/li&gt;\n&lt;li&gt;Understanding of data privacy regulations and best practices in user communications.&lt;/li&gt;\n&lt;li&gt;Familiarity with CRM systems and marketing automation platforms is a strong plus.&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;Product Skills&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;An entrepreneurial mindset, proactive, and you are outcome-driven.&lt;/li&gt;\n&lt;li&gt;Track record of successfully shipping products in a fast-paced, collaborative environment.&lt;/li&gt;\n&lt;li&gt;Know how to drive clarity and communicate horizontally and vertically to stakeholders that have vastly different backgrounds.&lt;/li&gt;\n&lt;li&gt;You make data-informed decisions and challenge the status quo using first principles thinking.&amp;nbsp;&lt;/li&gt;\n&lt;li&gt;A deep understanding of Agile methodologies and/or modern product management frameworks (Reforge, SVPG).&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;&lt;strong&gt;&lt;em&gt;Other requirements&lt;/em&gt;&lt;/strong&gt;&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;Passion for Bitcoin and a strong understanding of its role in financial freedom (orange-pilled mindset preferred!)&lt;/li&gt;\n&lt;li&gt;A dedicated workspace.&lt;/li&gt;\n&lt;li&gt;A reliable internet connection with the fastest speed possible in your area.&lt;/li&gt;\n&lt;li&gt;Devices and other essential equipment that meet minimal technical specifications.&lt;/li&gt;\n&lt;li&gt;Alignment with Our Values and the Xapo Values-Driven Leadership principles.&lt;/li&gt;\n&lt;/ul&gt;&lt;div class=&quot;content-conclusion&quot;&gt;&lt;p&gt;&lt;span style=&quot;font-size: 12pt;&quot;&gt;&lt;strong&gt;Why work for Xapo?&lt;/strong&gt;&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span style=&quot;font-weight: 500; font-size: 10pt;&quot;&gt;IMPACT GLOBALLY, WORK REMOTELY.&lt;/span&gt;&lt;/p&gt;\n&lt;ul&gt;\n&lt;li style=&quot;font-weight: 500;&quot;&gt;&lt;strong&gt;Shape the Future:&lt;/strong&gt;&lt;span style=&quot;font-weight: 500;&quot;&gt; Improve lives through cutting-edge technology, work 100% remotely from anywhere in the world.&lt;/span&gt;&lt;/li&gt;\n&lt;li style=&quot;font-weight: 500;&quot;&gt;&lt;strong&gt;Great work-life balance:&lt;/strong&gt;&lt;span style=&quot;font-weight: 500;&quot;&gt; &lt;/span&gt;&lt;span style=&quot;font-weight: 500;&quot;&gt;Build amazing things with a balance of autonomy and collaborative teamwork. Set your own work schedule and make use of a flexible PTO plan when you need to recharge.&lt;/span&gt;&lt;span style=&quot;font-weight: 500;&quot;&gt;&amp;nbsp;&lt;/span&gt;&lt;/li&gt;\n&lt;li style=&quot;font-weight: 500;&quot;&gt;&lt;strong&gt;Expect Excellence:&lt;/strong&gt;&lt;span style=&quot;font-weight: 500;&quot;&gt; Collaborate, learn, and grow with a high-performance team. Learn&lt;/span&gt;&lt;span style=&quot;font-weight: 500;&quot;&gt; how you learn best - from books to conferences, you’ll get a yearly budget for your individual learning and development goals.&lt;/span&gt;&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;&lt;strong&gt;At Xapo, we prioritize consumer protection and adhere to regulatory requirements by ensuring that all Xapiens are accountable for upholding principles of fair treatment, transparency, and ethical conduct in their interactions with customers and stakeholders.&lt;/strong&gt;&lt;/p&gt;&lt;/div&gt;","tags":"[\"management\"]","pubDate":"2025-01-29T14:50:47.000Z","link":"https://job-boards.greenhouse.io/xapo61/jobs/6333927003","slug":"product-manager-engagement-and-subscriptions-remote-work-from-anywhere-xapo-bank-9047"},{"id":9340490181,"title":"Product Manager - Customer Onboarding & Ongoing Due Diligence (Remote Work from Anywhere)","company":"Xapo Bank","image":"https://avatars.githubusercontent.com/u/6930305?s=200&v=4","description":"&lt;div class=&quot;content-intro&quot;&gt;&lt;p style=&quot;text-align: left;&quot;&gt;&lt;span style=&quot;font-weight: 900;&quot;&gt;Work from anywhere, impact everywhere&amp;nbsp;&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;Diversity is at the heart of who we are at Xapo Bank. We’re a fully distributed team of over 140 Xapiens that work remotely from 40+ countries around the world.&amp;nbsp;&lt;/p&gt;\n&lt;p&gt;Our beginning: A world that enjoys economic freedom and wealth protection, no matter where you live or who is running your country. This is the dream that drove Wences Casares, our Founder and Chairman, to quietly transform the world of banking.&lt;/p&gt;\n&lt;p&gt;To achieve that, we search the world for the best people for the job. We work hard, think globally, and inspire each other to learn and grow. We are committed to changing the way things are done.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Risk is inherent in all of our business activities and managing risk well is the responsibility of every Xapien. Sound risk management enables us to serve our customers and deliver value for our shareholders, and helps make Xapo a great place to work.&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&amp;nbsp;&lt;/p&gt;\n&lt;p style=&quot;text-align: left;&quot;&gt;&lt;em&gt;&lt;span style=&quot;font-weight: 500;&quot;&gt;Although we are headquartered in Gibraltar, this is a full time, 100% remote position&amp;nbsp;&lt;br&gt;&lt;/span&gt;&lt;/em&gt;&lt;em&gt;&lt;span style=&quot;font-weight: 500;&quot;&gt;Work from anywhere!&lt;/span&gt;&lt;/em&gt;&lt;/p&gt;\n&lt;p style=&quot;text-align: left;&quot;&gt;&amp;nbsp;&lt;/p&gt;&lt;/div&gt;&lt;p&gt;&lt;strong&gt;&lt;em&gt;Position overview&lt;/em&gt;&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;We are seeking an exceptional Product Manager to lead the discovery and execution of initiatives within the product space that covers KYC, onboarding, due diligence and fraud prevention. As a Product Manager at Xapo Bank, you will act as the CEO of your area, driving outcomes that balance user experience, Xapo’s business goals, as well as regulatory compliance.&lt;/p&gt;\n&lt;p&gt;Mission&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;Provide new applicants with a best-in-class, seamless onboarding journey.&lt;/li&gt;\n&lt;li&gt;Protect our existing members’ wealth and our business by delivering best-in-class transaction monitoring and ongoing due diligence capabilities. We truly want to know our customers and think along with them.&amp;nbsp;&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;This role is ideal for a proactive, entrepreneurial thinker with a go-getting attitude. You will navigate challenges autonomously and drive impactful solutions. This demands a hands-on approach, sharp analytical skills while having a strategic vision on your area.You’ll have to independently tackle challenges while excelling in a collaborative environment within Xapo’s regulated financial domains.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;&lt;em&gt;Responsibilities&lt;/em&gt;&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;Product Discovery &amp;amp; Strategy&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;Engage with users, stakeholders (including C-level), compliance, and anti-financial crime experts to identify challenges.&lt;/li&gt;\n&lt;li&gt;Use qualitative (e.g., user interviews) and quantitative (e.g., funnel metrics) insights to pinpoint improvement opportunities.&lt;/li&gt;\n&lt;li&gt;Define a vision and strategy, and prioritize initiatives within your product domain.&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;Product Execution&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;Lead a team consisting of (backend/mobile) engineers and a designer to plan, execute, and iterate on impactful product changes.&lt;/li&gt;\n&lt;li&gt;Translate regulatory requirements into best-in-class, user-friendly experiences that align with compliance standards and best practices in the market.&lt;/li&gt;\n&lt;li&gt;Use data-driven insights to refine features and measure success through metrics like onboarding completion rates and false positives.&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;Thought Leadership&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;Act as the go-to expert in your product area, ensuring clear alignment of goals and priorities among all stakeholders. We want you to be a thought leader, both internally as well as externally.&amp;nbsp;&lt;/li&gt;\n&lt;li&gt;As such, you are always informed and up-to-date on anti-financial crime regulations, best practices and the trends in due diligence and beyond.&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;&lt;strong&gt;&lt;em&gt;Skills needed&lt;/em&gt;&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;Experience&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;3+ years of experience in technology-driven fintech, regtech, or digital banking companies.&lt;/li&gt;\n&lt;li&gt;Proven track record of delivering user-focused products in complex domains.&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;Domain Knowledge&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;Expertise in fintech/regtech products like KYC, AML, fraud prevention, and transaction monitoring.&lt;/li&gt;\n&lt;li&gt;Familiarity with regulatory frameworks and anti-financial crime best practices is a strong plus.&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;Product Skills&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;An entrepreneurial mindset, proactive, and you are outcome-driven.&lt;/li&gt;\n&lt;li&gt;Track record of successfully shipping products in a fast-paced, collaborative environment.&lt;/li&gt;\n&lt;li&gt;Know how to drive clarity and communicate horizontally and vertically to stakeholders that have vastly different backgrounds.&lt;/li&gt;\n&lt;li&gt;You make data-informed decisions and challenge the status quo using first principles thinking.&amp;nbsp;&lt;/li&gt;\n&lt;li&gt;A deep understanding of Agile methodologies and/or modern product management frameworks (Reforge, SVPG).&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;&lt;strong&gt;&lt;em&gt;Other requirements&lt;/em&gt;&lt;/strong&gt;&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;Passion for Bitcoin and a strong understanding of its role in financial freedom (orange-pilled mindset preferred!)&lt;/li&gt;\n&lt;li&gt;A dedicated workspace.&lt;/li&gt;\n&lt;li&gt;A reliable internet connection with the fastest speed possible in your area.&lt;/li&gt;\n&lt;li&gt;Devices and other essential equipment that meet minimal technical specifications.&lt;/li&gt;\n&lt;li&gt;Alignment with Our Values and the Xapo Values-Driven Leadership principles.&lt;/li&gt;\n&lt;/ul&gt;&lt;div class=&quot;content-conclusion&quot;&gt;&lt;p&gt;&lt;span style=&quot;font-size: 12pt;&quot;&gt;&lt;strong&gt;Why work for Xapo?&lt;/strong&gt;&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span style=&quot;font-weight: 500; font-size: 10pt;&quot;&gt;IMPACT GLOBALLY, WORK REMOTELY.&lt;/span&gt;&lt;/p&gt;\n&lt;ul&gt;\n&lt;li style=&quot;font-weight: 500;&quot;&gt;&lt;strong&gt;Shape the Future:&lt;/strong&gt;&lt;span style=&quot;font-weight: 500;&quot;&gt; Improve lives through cutting-edge technology, work 100% remotely from anywhere in the world.&lt;/span&gt;&lt;/li&gt;\n&lt;li style=&quot;font-weight: 500;&quot;&gt;&lt;strong&gt;Great work-life balance:&lt;/strong&gt;&lt;span style=&quot;font-weight: 500;&quot;&gt; &lt;/span&gt;&lt;span style=&quot;font-weight: 500;&quot;&gt;Build amazing things with a balance of autonomy and collaborative teamwork. Set your own work schedule and make use of a flexible PTO plan when you need to recharge.&lt;/span&gt;&lt;span style=&quot;font-weight: 500;&quot;&gt;&amp;nbsp;&lt;/span&gt;&lt;/li&gt;\n&lt;li style=&quot;font-weight: 500;&quot;&gt;&lt;strong&gt;Expect Excellence:&lt;/strong&gt;&lt;span style=&quot;font-weight: 500;&quot;&gt; Collaborate, learn, and grow with a high-performance team. Learn&lt;/span&gt;&lt;span style=&quot;font-weight: 500;&quot;&gt; how you learn best - from books to conferences, you’ll get a yearly budget for your individual learning and development goals.&lt;/span&gt;&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;&lt;strong&gt;At Xapo, we prioritize consumer protection and adhere to regulatory requirements by ensuring that all Xapiens are accountable for upholding principles of fair treatment, transparency, and ethical conduct in their interactions with customers and stakeholders.&lt;/strong&gt;&lt;/p&gt;&lt;/div&gt;","tags":"[\"management\"]","pubDate":"2025-01-29T14:49:59.000Z","link":"https://job-boards.greenhouse.io/xapo61/jobs/6333921003","slug":"product-manager-customer-onboarding-ongoing-due-diligence-remote-work-from-anywhere-xapo-bank-6802"},{"id":3503579025,"title":"Full-Stack Lead Engineer for Code Reviewer Project","company":"CloudLinux","image":"https://pbs.twimg.com/profile_images/696718028084482050/ymY3OEPk_400x400.png","description":"<p>We are seeking a <strong>senior software engineer</strong> to lead the development of a <strong>robust, multi-language code reviewer</strong>. The ideal candidate should excel in <strong>agile workflows</strong>, <strong>code review best practices</strong>, and <strong>software engineering life cycles</strong>. You will work with stakeholders to refine requirements and deliver an adaptable review tool that <strong>integrates seamlessly</strong> with various CI/CD pipelines (GitLab, GitHub, Gerrit, Jenkins) and supports <strong>deep code analysis</strong>—potentially leveraging <strong>AI/LLM</strong> techniques where beneficial.</p><h3>Key Responsibilities</h3><ol><li><strong>Code Reviewer Development</strong></li></ol><ul><ul> <li>Design and implement a system capable of reviewing code across multiple languages and projects.</li> <li>Incorporate advanced <strong>code analysis</strong> techniques (e.g., <strong>AST parsing, control flow analysis</strong>) to identify bugs, style inconsistencies, and potential security and performance issues.</li> <li>Ensure the reviewer can be <strong>extended</strong> or <strong>customized</strong> based on evolving requirements from diverse teams.</li> </ul></ul><ol><li><strong>Agile &amp; DevOps Integration</strong></li></ol><ul><ul> <li>Employ <strong>agile methodologies</strong> (Scrum/Kanban) to plan, track, and iterate on new features.</li> <li>Integrate seamlessly with <strong>CI/CD</strong> pipelines (GitHub, GitLab, Gerrit, Jenkins), making the reviewer easily adoptable by various R&amp;D teams.</li> <li>Collaborate with DevOps to ensure smooth deployment and maintenance.</li> </ul></ul><ol><li><strong>Expert Code Review Practices</strong></li></ol><ul><ul> <li>Define and maintain <strong>code review standards</strong>, including style guidelines, security checks, and performance considerations.</li> <li>Work with development teams to refine <strong>pull/merge request processes</strong>, fostering a culture of high-quality code.</li> <li>Provide <strong>comprehensive review feedback</strong> and assist in automating repetitive checks to streamline manual review efforts.</li> </ul></ul><ol><li><strong>Cross-Team Collaboration</strong></li></ol><ul><ul> <li>Engage with stakeholders and engineering teams to gather feedback and requirements.</li> <li>Communicate progress clearly and adapt the solution based on iterative input.</li> <li>Advocate for best practices, teaching others how to maximize the value of automated reviews.</li> </ul></ul><ol><li><strong>Research &amp; Prototyping</strong></li></ol><ul><ul> <li>Investigate emerging tools and methodologies in <strong>static analysis</strong>, <strong>linting</strong>, and <strong>machine learning</strong> for potential integration.</li> <li>Prototype new features or approaches including <strong>AI/LLM</strong> usage to for code reviewing and unstructured data handling.</li> </ul></ul><h3>Requirements: </h3><ul><li><strong>Software Engineering Lifecycle Expertise</strong></li></ul><ul><ul><li>Proven ability to take a project from concept through to production, including requirements gathering, design, testing, and maintenance.</li></ul></ul><ul><li><strong>Agile Methodologies &amp; Tools</strong></li></ul><ul><ul> <li>Experience with Jira (or similar) for task management, sprint planning, and reporting.</li> <li>Comfortable with iterative development, frequent releases, and fast feedback cycles.</li> </ul></ul><ul><li><strong>Version Control &amp; CI/CD</strong></li></ul><ul><ul> <li>Proficiency in Git-based workflows (GitHub, GitLab, or Gerrit) and CI/CD setups (Jenkins, etc.).</li> <li>Strong knowledge of how to integrate automated checks and tests into pipelines.</li> </ul></ul><ul><li><strong>Advanced Code Review</strong></li></ul><ul><ul> <li>In-depth understanding of <strong>what makes a code review effective</strong>, including detection of security vulnerabilities, logical errors, performance bottlenecks, and style issues.</li> <li>Familiarity with <strong>AST-based</strong> or <strong>control-flow</strong> techniques to enable deeper analysis.</li> </ul></ul><ul><li><strong>Multi-Language Proficiency</strong></li></ul><ul><ul><li>Competency in at least one major language (e.g., Python, Java, C++, JavaScript), with an awareness of <strong>common design patterns</strong>, best practices, and typical pitfalls across various tech stacks.</li></ul></ul><ul><li><strong>Research &amp; Prototyping Skills</strong></li></ul><ul><ul><li>Ability to independently explore new libraries or methods—especially around static analysis and potential <strong>AI-based</strong> enhancements—to continually improve the reviewer.</li></ul></ul><h3>Nice-to-Have</h3><ul> <li><strong>LLM/AI Exposure</strong></li> <ul><li>Experience applying Large Language Models or other AI/ML techniques to code analysis.</li></ul> <li><strong>Customization Experience</strong></li> <ul><li>Prior work extending or tailoring static analysis tools to match domain-specific requirements.</li></ul> <li><strong>Performance &amp; Security Audits</strong></li> <ul><li>Background in detecting performance regressions or security vulnerabilities through automated scanning and analysis.</li></ul> <li><strong>Startup or Fast-Paced Environment</strong></li> <ul><li>Comfortable with rapid change, limited requirements, and tight delivery timelines.</li></ul> </ul><h3>Benefits: </h3><p><strong>What's in it for you?</strong></p><ul> <li>A focus on professional development</li> <li>Interesting and challenging projects</li> <li>Fully remote work with flexible working hours, that allows you to schedule your day and work from any location worldwide</li> <li>Paid 24 days of vacation per year, 10 days of national holidays, and unlimited sick leaves</li> <li>Compensation for private medical insurance</li> <li>Co-working and gym/sports reimbursement</li> <li>Budget for education</li> <li>The opportunity to receive a reward for the most innovative idea that the company can patent</li> </ul><p></p><p><em>By applying for this position, you consent to the processing of your personal data as described in our Privacy Policy (</em><a href=\"https://cloudlinux.com/candidate-privacy-notice\" target=\"_blank\" rel=\"nofollow noreferrer noopener\" class=\"external\"><em>https://cloudlinux.com/candidate-privacy-notice</em></a><em>), which provides detailed information on how we maintain and handle your data.</em></p>","tags":"[\"javascript\",\"management\",\"engineering\"]","pubDate":"2025-01-29T00:00:00.000Z","link":"https://apply.workable.com/cloudlinux-1/j/8E811BDB93","slug":"full-stack-lead-engineer-for-code-reviewer-project-cloudlinux-1802"},{"id":5969564420,"title":"Full Stack Engineer II","company":"Outliant","image":"https://remotive.com/job/1966421/logo","description":"<p style=\"min-height: 1.5em;\"><strong>About us:</strong></p>\n<p style=\"min-height: 1.5em;\">Outliant is a fully-remote, US-based, digital product development and startup consulting company, with a team of culturally diverse creators whose exceptional skills and talents help conceive seamless digital products. Our teams exhibit work-play energy that supports individual growth, as well as encourages the freedom of creativity and “thinking outside the box.”</p>\n<p style=\"min-height: 1.5em;\"><br><strong>Our Core Values:</strong></p>\n<ul style=\"\">\n<li style=\"\">\n<p style=\"min-height: 1.5em;\"><strong>Pursuit of Excellence: </strong>We are extremely competitive, ambitious, and driven to be exceptional – as individuals, teams, and as an organization. There is no standard high enough and we will never settle. We aspire to attract, retain, and empower the very best people.</p>\n</li>\n<li style=\"\">\n<p style=\"min-height: 1.5em;\"><strong>Startup Mentality: </strong>Outliant began with 5 startup founders, and startup culture is deep in our DNA. It’s a critical advantage that allows us to move faster, be more resourceful, and empower our team at all levels. We are in the early chapters of our journey.</p>\n</li>\n<li style=\"\">\n<p style=\"min-height: 1.5em;\"><strong>World-Class Remote Collaboration: </strong>Outliant is (and always has been) a 100% remote company – we have no offices and our teams are distributed around the world. Given the freedom and autonomy this provides, we require that our people excel in this remote structure.</p>\n</li>\n</ul>\n<p style=\"min-height: 1.5em;\"> </p>\n<p style=\"min-height: 1.5em;\"><strong>About the role:</strong></p>\n<p style=\"min-height: 1.5em;\">As a <strong>Full-Stack Engineer II</strong>, you will apply your skills and knowledge to assist in the development and enhancement of both the frontend and backend of our applications. You will work on a variety of tasks under the guidance of more senior engineers, contributing to projects that allow you to build your technical expertise. Your contributions will be invaluable as you collaborate with a supportive team to deliver high-quality solutions. </p>\n<p style=\"min-height: 1.5em;\"> </p>\n<p style=\"min-height: 1.5em;\"><strong>Seniority Level: </strong>Mid-Level</p>\n<p style=\"min-height: 1.5em;\"> </p>\n<p style=\"min-height: 1.5em;\"><strong>Responsibilities:</strong></p>\n<ul style=\"\">\n<li style=\"\">\n<p style=\"min-height: 1.5em;\"><strong>Advanced Fullstack Development: </strong>Design, implement, and maintain complex frontend and backend systems</p>\n</li>\n<li style=\"\">\n<p style=\"min-height: 1.5em;\"><strong>Optimization: </strong>Ensure high performance and scalability across both the frontend and backend</p>\n</li>\n<li style=\"\">\n<p style=\"min-height: 1.5em;\"><strong>Component Development: </strong>Develop reusable components and services for the full-stack</p>\n</li>\n<li style=\"\">\n<p style=\"min-height: 1.5em;\"><strong>Security Implementation: </strong>Apply best practices to secure both frontend and backend systems</p>\n</li>\n<li style=\"\">\n<p style=\"min-height: 1.5em;\"><strong>Problem Solving: </strong>Identify and resolve complex issues across the full-stack</p>\n</li>\n<li style=\"\">\n<p style=\"min-height: 1.5em;\"><strong>Mentorship: </strong>Provide guidance to junior full-stack engineers</p>\n</li>\n<li style=\"\">\n<p style=\"min-height: 1.5em;\"><strong>Collaboration</strong>: Collaborate with engineers, product managers, designers, and cross-functional teammates to build end-to-end features for millions of users</p>\n</li>\n</ul>\n<p style=\"min-height: 1.5em;\"> </p>\n<p style=\"min-height: 1.5em;\"><strong>Requirements:</strong></p>\n<ul style=\"\">\n<li style=\"\">\n<p style=\"min-height: 1.5em;\">3-4 years of professional experience working as a software engineer</p>\n</li>\n<li style=\"\">\n<p style=\"min-height: 1.5em;\">Proven proficiency with frontend technologies (Typescript, ReactJS) and backend technologies (NodeJS)</p>\n</li>\n<li style=\"\">\n<p style=\"min-height: 1.5em;\">Proficiency with NextJS and AWS</p>\n</li>\n<li style=\"\">\n<p style=\"min-height: 1.5em;\">Proficiency in working with Contentful</p>\n</li>\n<li style=\"\">\n<p style=\"min-height: 1.5em;\">Strong communication skills (spoken and written)</p>\n</li>\n<li style=\"\">\n<p style=\"min-height: 1.5em;\">Positive recommendations from your previous managers and teammates</p>\n</li>\n</ul>\n<p style=\"min-height: 1.5em;\"> </p>\n<p style=\"min-height: 1.5em;\"><strong>Nice-to-have</strong></p>\n<ul style=\"\">\n<li style=\"\">\n<p style=\"min-height: 1.5em;\">Experience with Webflow and/or other CMS platforms</p>\n</li>\n<li style=\"\">\n<p style=\"min-height: 1.5em;\">Experience working in an agency environment</p>\n</li>\n</ul>\n<p style=\"min-height: 1.5em;\"> </p>\n<p style=\"min-height: 1.5em;\"><strong>What’s in it for you?</strong></p>\n<p style=\"min-height: 1.5em;\">As a full-time member of our team, you’ll enjoy:</p>\n<ul style=\"\">\n<li style=\"\">\n<p style=\"min-height: 1.5em;\">Flexible hours, work wherever you choose.</p>\n</li>\n<li style=\"\">\n<p style=\"min-height: 1.5em;\">Unlimited PTO.</p>\n</li>\n<li style=\"\">\n<p style=\"min-height: 1.5em;\">Non-working holidays per country of residence.</p>\n</li>\n<li style=\"\">\n<p style=\"min-height: 1.5em;\">Salary increases and performance-based bonuses.</p>\n</li>\n<li style=\"\">\n<p style=\"min-height: 1.5em;\">Referral bonuses.</p>\n</li>\n<li style=\"\">\n<p style=\"min-height: 1.5em;\">Mental health and well-being programs.</p>\n</li>\n<li style=\"\">\n<p style=\"min-height: 1.5em;\">Fun and casual work environment.</p>\n</li>\n<li style=\"\">\n<p style=\"min-height: 1.5em;\">Employee engagement activities and virtual gatherings.</p>\n</li>\n<li style=\"\">\n<p style=\"min-height: 1.5em;\">We are a diverse, global team! 🌍</p>\n</li>\n</ul>\n<p style=\"min-height: 1.5em;\"> </p>\n<p style=\"min-height: 1.5em;\"> </p>\n<p style=\"min-height: 1.5em;\"><strong>Important Notice</strong></p>\n<p style=\"min-height: 1.5em;\">To ensure the legitimacy of job opportunities, we strongly recommend that you solely rely on positions posted here on our official website: <a href=\"http://outliant.com/careers\" rel=\"nofollow\" target=\"_blank\"><strong>outliant.com/careers</strong></a>.</p>\n<p style=\"min-height: 1.5em;\"> </p>\n<p style=\"min-height: 1.5em;\">All our current job openings require video interviews conducted in either or both synchronous (via Google Meet) and asynchronous (via Willo) formats. Kindly refrain from accepting offers that appear suspicious. For any inquiries or concerns, feel free to reach out to us via email at <a href=\"mailto:recruitment@outliant.com\" rel=\"nofollow\" target=\"_blank\"><strong>recruitment@outliant.com</strong></a>.</p>\n<p style=\"min-height: 1.5em;\"> </p>\n<p style=\"min-height: 1.5em;\">Please be assured that we are fully committed to maintaining integrity in our hiring process.</p>\n<img src=\"https://remotive.com/job/track/1966421/blank.gif?source=public_api\" alt=\"\"/>","tags":"[\"AWS\"]","pubDate":"2025-01-28T19:50:53.000Z","link":"https://remotive.com/remote-jobs/software-dev/full-stack-engineer-ii-1966421","slug":"full-stack-engineer-ii-outliant-8882"},{"id":7609639810,"title":"Software Engineer","company":"Orderlynetwork","image":"https://remotive.com/job/1966500/logo","description":"<div class=\"h2\" style='\"text-align:'><strong>Work with the best</strong></div>\n<p>We are Orderly, the ultimate destination for decentralized trading platforms. We are not satisfied with the limitations of centralized exchanges or the complexities of building decentralized order books. We aim to make trading easy, fast, and secure for everyone. How? By fusing the simplicity of CeFi with the power of DeFi.<br><br>At the heart of the issue lies “liquidity”. Builders often grapple with a paradox; traders need liquidity, but liquidity demands traders. Our solution is simple as is bold –<span class='\"text-primary-100'>concentrate all liquidity into one order book. One order book that connects all the liquidity in the crypto space.</span><br><br>Our ambition doesn't stop there. We're omnichain, championing chain abstraction. We envision seamless transactions, where the underlying blockchain is merely a detail. By concentrating liquidity, we aim to redefine the crypto landscape, making bridging and wrapped assets a thing of the past.<br><br>We are Orderly, and we are here to revolutionize DeFi, democratizing access to financial opportunities and fostering a fair, equitable paradigm for all.</p>\n<div class=\"h2\" style='\"text-align:'><strong>A Glimpse into Your Future at Orderly Network</strong></div>\n<ul style=\"\">\n<li style=\"\"><span style='\"text-decoration:'><em>What will you be working on?</em></span>\n<ul style=\"\">\n<li style=\"\">Develop the core functions of the Internet financial platform, and build the technology infrastructure that supports digital asset trading on the internet.</li>\n<li style=\"\">Implement RestFul and WebSocket API interfaces to support customers to receive market data and execute orders.</li>\n<li style=\"\">Establish a robust, efficient and concurrent trading system to ensure 7x24 hours uninterrupted operation.</li>\n</ul>\n</li>\n<li style=\"\"><span style='\"text-decoration:'><em>Who will you be working with?</em></span>\n<ul style=\"\">\n<li style=\"\">Actively conduct efficient communication with product team and business development team to collect requirements and participate in product planning and system design.</li>\n</ul>\n</li>\n<li style=\"\"><span style='\"text-decoration:'><em>What challenges will you face?</em></span>\n<ul style=\"\">\n<li style=\"\">Fast-paced working environment.</li>\n<li style=\"\">Propose practical and feasible solutions and produce technical documents independently.</li>\n<li style=\"\">System analyzing, abstract thinking, and system designing.</li>\n</ul>\n</li>\n<li style=\"\"><span style='\"text-decoration:'><em>What tech stacks/skills will you be using?</em></span>\n<ul style=\"\">\n<li style=\"\">Java programming - frequently</li>\n<li style=\"\">Large-scale, multithreading, and high-performance distributed system - frequently</li>\n<li style=\"\">Data structures, design patterns, multi-threaded programming, and JVM principles - frequently</li>\n<li style=\"\">Java Web, microservice development, and frameworks like SpringBoot, Spring Cloud, and MyBatis - frequently</li>\n<li style=\"\">Caching, message queuing, and searching tools like Redis, Kafka, and Elasticsearch - frequently</li>\n<li style=\"\">Linux - frequently</li>\n<li style=\"\">Performance tuning, jmetrics, and grafana - sometimes</li>\n</ul>\n</li>\n</ul>\n<div class=\"h2\" style='\"text-align:'><strong>Interested in Learning More?</strong></div>\n<ul style=\"\">\n<li style=\"\">Our hiring process begins by meeting with our People Team, who help facilitate the process of placing you in your new role. You can expect to share your experience and ideas in online video interviews with our hiring team, made up of management and potential new colleagues.</li>\n<li style=\"\">If you have experience in developing trading systems or financial-related products is a plus.</li>\n<li style=\"\">You can prepare for this interview by mentally organizing your strategies and opinions on topics such as Web3, cryptocurrency trading platforms, and your vision of how to succeed. </li>\n<li style=\"\">Share this! Don’t be afraid of friends or co-workers stealing this job! If you are amazing and smart we will find a place for you. Check out our <a href=\"%22https://boards.greenhouse.io/orderlynetwork/jobs/5170520003%22\" rel=\"nofollow\" target='\"_blank\"'>External Referral Incentives Program</a> as well. </li>\n</ul><img src=\"https://remotive.com/job/track/1966500/blank.gif?source=public_api\" alt=\"\"/>","tags":"[\"distributed systems\"]","pubDate":"2025-01-28T19:50:52.000Z","link":"https://remotive.com/remote-jobs/software-dev/software-engineer-1966500","slug":"software-engineer-orderlynetwork-9883"},{"id":4370102693,"title":"Project Manager","company":"Mozaiq","image":"https://remotive.com/job/1964769/logo","description":"<p dir=\"ltr\"><strong>🚀 Join Our Team: Project Manager at Mozaiq</strong></p>\n<p dir=\"ltr\">Hey, we’re Mozaiq, a fast-growing team with roots in the US and Europe. We specialize in building amazing and incredible global teams that work cohesively together to provide support for some of the most sophisticated marketing organizations, typically in the tech industry. By joining our team, you’ll become part of an exceptional group of professionals, have the opportunity for professional growth, and play a key role in creating incredible things.</p>\n<p dir=\"ltr\">We seek an innovative and dedicated <strong>Project Manager</strong> to join our vibrant and international team. As a Project Manager, you will be at the forefront of crafting outstanding digital experiences that drive results for our diverse range of high-profile clients.<br><br><strong>Why Mozaiq?</strong></p>\n<ul style=\"\">\n<li dir=\"ltr\" style=\"\">\n<p dir=\"ltr\"><strong>Global Family</strong>: We’re a tight-knit and diverse group, representing multiple nationalities and cultures. Working with us means joining a global family that supports and learns from each other.</p>\n</li>\n<li dir=\"ltr\" style=\"\">\n<p dir=\"ltr\"><strong>Passionate Work</strong>: We’re passionate about what we do, and we’re committed to delivering exceptional work that makes our clients shine.</p>\n</li>\n<li dir=\"ltr\" style=\"\">\n<p dir=\"ltr\"><strong>Inclusive Culture</strong>: Our culture is inclusive, diverse, and always evolving. We believe in fostering an environment where everyone can thrive, learn, and grow.</p>\n</li>\n</ul>\n<p> </p>\n<p dir=\"ltr\"><strong>About the role:</strong><br>As a Project Manager at Mozaiq, your role will be both strategic and hands-on. You will be responsible for designing and implementing high-quality PM solutions. We are looking for someone who is passionate about managing projects and aspires to take on a leadership role within the team.<br><br><strong>Responsibilities:</strong></p>\n<p dir=\"ltr\">Asana Import and Setup</p>\n<ul style=\"\">\n<li dir=\"ltr\" style=\"\">Build a production schedule incorporating all stages of the process and corresponding stakeholders/assignees:\n<ul style=\"\">\n<li dir=\"ltr\" style=\"\">\n<p dir=\"ltr\">Content deadlines</p>\n</li>\n<li dir=\"ltr\" style=\"\">\n<p dir=\"ltr\">Web deadlines</p>\n</li>\n<li dir=\"ltr\" style=\"\">\n<p dir=\"ltr\">Design deadlines</p>\n</li>\n<li dir=\"ltr\" style=\"\">\n<p dir=\"ltr\">MOPs deadlines</p>\n</li>\n</ul>\n</li>\n<li dir=\"ltr\" style=\"\">\n<p dir=\"ltr\">Manage approvals</p>\n</li>\n<li dir=\"ltr\" style=\"\">\n<p dir=\"ltr\">Import the finalized schedules into Asana.</p>\n</li>\n<li dir=\"ltr\" style=\"\">QA the campaign board to ensure accuracy in:\n<ul style=\"\">\n<li dir=\"ltr\" style=\"\">\n<p dir=\"ltr\">Assignees</p>\n</li>\n<li dir=\"ltr\" style=\"\">\n<p dir=\"ltr\">Automations</p>\n</li>\n<li dir=\"ltr\" style=\"\">\n<p dir=\"ltr\">Dates<br><br></p>\n</li>\n</ul>\n</li>\n</ul>\n<p dir=\"ltr\">Oversee Asset Production</p>\n<ul style=\"\">\n<li dir=\"ltr\" style=\"\">\n<p dir=\"ltr\">Manage and update tasks on the campaign board for anchor assets.</p>\n</li>\n<li dir=\"ltr\" style=\"\">\n<p dir=\"ltr\">Adjust tasks and deadlines as necessary to address changes.</p>\n</li>\n<li dir=\"ltr\" style=\"\">\n<p dir=\"ltr\">Ensure all deadlines are met and proactively flag any potential slowdowns.</p>\n</li>\n<li dir=\"ltr\" style=\"\">\n<p dir=\"ltr\">Confirm automations are in place and functioning properly.</p>\n</li>\n<li dir=\"ltr\" style=\"\">\n<p dir=\"ltr\">Coordinate between stakeholders and assignees to ensure asset delivery.</p>\n</li>\n<li dir=\"ltr\" style=\"\">\n<p dir=\"ltr\">Provide support to external users, especially across different time zones.</p>\n</li>\n<li dir=\"ltr\" style=\"\">\n<p dir=\"ltr\">Track progress and keep team members on schedule.<br><br></p>\n</li>\n</ul>\n<p dir=\"ltr\">Oversee Supporting Asset Production</p>\n<ul style=\"\">\n<li dir=\"ltr\" style=\"\">\n<p dir=\"ltr\">Manage and update tasks on the campaign board for supporting assets.</p>\n</li>\n<li dir=\"ltr\" style=\"\">\n<p dir=\"ltr\">Adjust tasks and deadlines as necessary to address changes.</p>\n</li>\n<li dir=\"ltr\" style=\"\">\n<p dir=\"ltr\">Ensure all deadlines are met and proactively flag any potential slowdowns.</p>\n</li>\n<li dir=\"ltr\" style=\"\">\n<p dir=\"ltr\">Confirm automations are in place and functioning properly.</p>\n</li>\n<li dir=\"ltr\" style=\"\">\n<p dir=\"ltr\">Coordinate between stakeholders and assignees to ensure smooth delivery of assets.</p>\n</li>\n<li dir=\"ltr\" style=\"\">\n<p dir=\"ltr\">Provide support to external users, especially across different time zones.</p>\n</li>\n<li dir=\"ltr\" style=\"\">\n<p dir=\"ltr\">Track progress and ensure team members remain aligned with timelines.</p>\n</li>\n</ul>\n<p dir=\"ltr\"><br>Managing the backend process of uploading, scheduling, and reviewing published blog content with a focus on design consistency and quality assurance.<br><br></p>\n<ul style=\"\">\n<li dir=\"ltr\" style=\"\">\n<p dir=\"ltr\">Conduct thorough QA to minimize post-publishing corrections</p>\n</li>\n<li dir=\"ltr\" style=\"\">\n<p dir=\"ltr\">Create new UTMs with every new asset and update editor manual with them</p>\n</li>\n<li dir=\"ltr\" style=\"\">\n<p dir=\"ltr\">Ensure article CTAs have the correct asset UTM (text vs inpost)</p>\n</li>\n<li dir=\"ltr\" style=\"\">\n<p dir=\"ltr\">Maintain CTA library</p>\n</li>\n<li dir=\"ltr\" style=\"\">\n<p dir=\"ltr\">Update the homepage experience for main Intake site</p>\n</li>\n<li dir=\"ltr\" style=\"\">\n<p dir=\"ltr\">Upload CTA blocks</p>\n</li>\n<li dir=\"ltr\" style=\"\">\n<p dir=\"ltr\">Provide general content support as needed, including troubleshooting formatting issues and implementing updates + QA-ing published content</p>\n</li>\n</ul>\n<p dir=\"ltr\"><strong>Requirements:</strong></p>\n<ul style=\"\">\n<li dir=\"ltr\" style=\"\">\n<p dir=\"ltr\">At least 4 years of professional experience as a Web Project Manager/Digital Project Manager.</p>\n</li>\n<li dir=\"ltr\" style=\"\">\n<p dir=\"ltr\">Proven experience in team management and web project delivery.</p>\n</li>\n<li dir=\"ltr\" style=\"\">\n<p dir=\"ltr\">Solid understanding of web technologies, especially WordPress.</p>\n</li>\n<li dir=\"ltr\" style=\"\">\n<p dir=\"ltr\">Strong leadership skills and ambition to progress into a team leader role.</p>\n</li>\n<li dir=\"ltr\" style=\"\">\n<p dir=\"ltr\">Fluent in English, both written and spoken.</p>\n</li>\n<li dir=\"ltr\" style=\"\">\n<p dir=\"ltr\">Excellent communication skills, as all internal communications are in English.</p>\n</li>\n<li dir=\"ltr\" style=\"\">\n<p dir=\"ltr\">Ability to work both independently and as part of a global team.</p>\n</li>\n<li dir=\"ltr\" style=\"\">\n<p dir=\"ltr\">Excellent problem-solving skills with a keen attention to detail.</p>\n</li>\n</ul>\n<p dir=\"ltr\"><br><strong>Benefits (dependent on your country):</strong></p>\n<ul style=\"\">\n<li dir=\"ltr\" style=\"\">\n<p dir=\"ltr\">Work from anywhere culture</p>\n</li>\n<li dir=\"ltr\" style=\"\">\n<p dir=\"ltr\">Flexible time off policy</p>\n</li>\n<li dir=\"ltr\" style=\"\">\n<p dir=\"ltr\">Ample paid leave</p>\n</li>\n<li dir=\"ltr\" style=\"\">\n<p dir=\"ltr\">In-person team-building vacations</p>\n</li>\n<li dir=\"ltr\" style=\"\">\n<p dir=\"ltr\">Supplemental healthcare insurance coverage</p>\n</li>\n<li dir=\"ltr\" style=\"\">\n<p dir=\"ltr\">Subsidized Sports and fitness membership</p>\n</li>\n</ul>\n<p><br>The work is remote as our team is spread across the continents. We are open to flexible hours, however we may need you to be online between 18:00 and 20:30 CET (as part of the marketing team is US based, 6-9 hours behind).</p>\n<p><br><br></p>\n<img src=\"https://remotive.com/job/track/1964769/blank.gif?source=public_api\" alt=\"\"/>","tags":"[\"team management\"]","pubDate":"2025-01-28T11:50:59.000Z","link":"https://remotive.com/remote-jobs/project-management/project-manager-1964769","slug":"project-manager-mozaiq-4772"}]