[{"id":7393229608,"title":"Sales Engineer - UK / Europe","company":"Sardine","image":"https://avatars.githubusercontent.com/u/65879301?s=200&v=4","description":"<p style=\"min-height:1.5em\"><strong>Who we are:</strong></p><p style=\"min-height:1.5em\">We are a leader in fraud prevention and AML compliance. Our platform uses device intelligence, behavior biometrics, machine learning, and AI to stop fraud before it happens. Today, over 300 banks, retailers, and fintechs worldwide use Sardine to stop identity fraud, payment fraud, account takeovers, and social engineering scams. We have raised $75M from world-class investors including Andreessen Horowitz, Visa, Experian, FIS, and Google Ventures.</p><p style=\"min-height:1.5em\"></p><p style=\"min-height:1.5em\"><strong>Our culture:</strong></p><ul style=\"min-height:1.5em\"><li><p style=\"min-height:1.5em\">We have hubs in the Bay Area, NYC, Austin, and Toronto. However, we have a remote-first work culture. #WorkFromAnywhere</p></li><li><p style=\"min-height:1.5em\">We hire talented, self-motivated people and get out of their way</p></li><li><p style=\"min-height:1.5em\">We value performance and not hours worked. We believe you shouldn't have to miss your family dinner, your kid's school play, or doctor's appointments for the sake of adhering to an arbitrary work schedule.</p></li></ul><p style=\"min-height:1.5em\"></p><p style=\"min-height:1.5em\"><strong>Location:</strong></p><ul style=\"min-height:1.5em\"><li><p style=\"min-height:1.5em\">UK / Germany / Bulgaria</p></li><li><p style=\"min-height:1.5em\">From Home / Beach / Mountain / Cafe / Anywhere!</p></li><li><p style=\"min-height:1.5em\">We are a remote-first company with a globally distributed team. You can find your productive zone and work from there.</p></li></ul><p style=\"min-height:1.5em\"></p><p style=\"min-height:1.5em\"><strong>About the role:</strong></p><p style=\"min-height:1.5em\">Sales Engineering is a team of subject matter experts who serve as the trusted technical advisor to prospective customers. You will lead prospects through the sales process by connecting their needs to Sardine’s value to win new customers and drive revenue growth. You will deliver best in class product demonstrations, fill out RFPs, and win over our prospective customer’s technical teams with your thought leadership and consultative approach. Internally, your insights from the field will help shape our product roadmap and will pave the way for future customers.  You will play a key role in our commitment to customer excellence and allow Sardine to stay ahead of market trends.</p><p style=\"min-height:1.5em\"></p><p style=\"min-height:1.5em\">The SE team is a high visibility and high impact team. At the intersection of our Go-To-Market and Product and Engineering teams, we serve as the link between our customer’s needs and the Sardine’s capabilities, ensuring our platform is always adding value to our customer’s Fraud and Compliance stack.  It's a great role for someone who enjoys learning the intricacies of a product to drive value to prospects, and leading through innovative problem-solving to convert prospects into customers. Variety, ambiguity, innovation, and ownership of complex problems are all big components of this role.</p><p style=\"min-height:1.5em\"><br /><strong>As a Sales Engineer, you will:</strong></p><ul style=\"min-height:1.5em\"><li><p style=\"min-height:1.5em\">Support Account Executives in identifying a prospect’s fraud and compliance needs.</p></li><li><p style=\"min-height:1.5em\">Prepare and deliver customized demos that showcase the impact of Sardine’s platform.</p></li><li><p style=\"min-height:1.5em\">Interface with Security teams to articulate our security posture and successfully complete security reviews.</p></li><li><p style=\"min-height:1.5em\">Complete RFPs for competitive opportunities.</p></li><li><p style=\"min-height:1.5em\">Create comprehensive Solution Designs that address our prospect’s needs.</p></li><li><p style=\"min-height:1.5em\">Collaborate with peers to improve all processes within the Sales Engineering team.</p></li><li><p style=\"min-height:1.5em\">Work together with our product and engineering teams to identify areas for improvement in our product suite and help prioritize and design solutions.</p></li></ul><p style=\"min-height:1.5em\"></p><p style=\"min-height:1.5em\"><strong>What you’ll bring to Sardine:</strong></p><ul style=\"min-height:1.5em\"><li><p style=\"min-height:1.5em\">7+ years prior experience as a Sales Engineer, System Engineer, Solutions Engineer, or similar roles</p></li><li><p style=\"min-height:1.5em\">Prior experience in similar roles within the Risk, Fraud, or Compliance domain</p></li><li><p style=\"min-height:1.5em\">Experience with APIs, a strong understanding of JSON, and proficiency in one or more of the following languages: Python, JavaScript, Ruby, Go, or Java. Bonus points for knowledge of web development principles and/or the ability to build internal tools using one of these languages.</p></li><li><p style=\"min-height:1.5em\">Strong analytical skills: you can dig into the technical details of a problem and turn it into a proposed solution</p></li><li><p style=\"min-height:1.5em\">Ability to thrive in a fast-paced remote environment working with global clients</p></li><li><p style=\"min-height:1.5em\">Excellent written and verbal communication skills, including the ability to communicate complex technical and business concepts to technical and non-technical personas.</p></li></ul><p style=\"min-height:1.5em\"></p><p style=\"min-height:1.5em\"><strong>Compensation: </strong>Base pay range of $90,000 - $120,000 + Equity with tremendous upside potential + Attractive benefits</p><p style=\"min-height:1.5em\"></p><p style=\"min-height:1.5em\"><strong>Benefits we offer:</strong></p><ul style=\"min-height:1.5em\"><li><p style=\"min-height:1.5em\">Generous compensation in cash and equity</p></li><li><p style=\"min-height:1.5em\">Early exercise for all options, including pre-vested</p></li><li><p style=\"min-height:1.5em\">Work from anywhere: Remote-first Culture</p></li><li><p style=\"min-height:1.5em\">Flexible paid time off, Year-end break, Self care days off</p></li><li><p style=\"min-height:1.5em\">Health insurance, dental, and vision coverage for employees and dependents - <em>US and Canada specific</em></p></li><li><p style=\"min-height:1.5em\">4% matching in 401k / RRSP - <em>US and Canada specific</em></p></li><li><p style=\"min-height:1.5em\">MacBook Pro delivered to your door</p></li><li><p style=\"min-height:1.5em\">One-time stipend to set up a home office — desk, chair, screen, etc.</p></li><li><p style=\"min-height:1.5em\">Monthly meal stipend</p></li><li><p style=\"min-height:1.5em\">Monthly social meet-up stipend</p></li><li><p style=\"min-height:1.5em\">Annual health and wellness stipend</p></li><li><p style=\"min-height:1.5em\">Annual Learning stipend</p></li><li><p style=\"min-height:1.5em\">Unlimited access to an expert financial advisory</p></li></ul><p style=\"min-height:1.5em\"></p><p style=\"min-height:1.5em\">Join a fast-growing company with world-class professionals from around the world. If you are seeking a meaningful career, you found the right place, and we would love to hear from you.</p>","tags":"[\"javascript\",\"engineering\"]","pubDate":"2025-01-03T23:41:28.613Z","link":"https://jobs.ashbyhq.com/sardine/8b6f21a2-71f3-4242-afdd-927fb9041dda","slug":"sales-engineer-uk-europe-sardine-8124"},{"id":4542543395,"title":"Senior Director of Implementation","company":"Aiwyn","image":"https://media.licdn.com/dms/image/v2/D4E0BAQEvDOFt9VDmfg/company-logo_200_200/company-logo_200_200/0/1714673337921/aiwyn_logo?e=1743033600&v=beta&t=0yqXd-p9YeUPxD_oaEkvrGENa6XLG5S4Q4dDXCettEY","description":"<div><b>Who is Aiwyn and what do we do?</b></div><div><br></div><div>Aiwyn is the fastest-growing software company serving the accounting profession.&nbsp;Founded in 2020, we now work with 100+ of the largest CPA firms in the world.&nbsp;Our “Job to be done”: speed up cash flow, save Partner time, &amp; deliver best-in-class client experiences. We do this by automating day-to-day firm operations with our Practice Automation solutions. Aiwyn is led by serial entrepreneurs with multiple exits and funded by a Top 10 fintech VC.</div><div><br></div><div>To learn more, visit our <a rel=\"noopener noreferrer\" class=\"postings-link\" href=\"https://aiwyn.ai/\"><b>website</b></a></div><div><br></div><div><b>This role: </b></div><div><br></div><div><span style=\"font-size: 10pt;\">As the Senior Director of Implementation, you will lead the implementation team as a player-coach. You will be responsible for our clients’ implementation success in a timely manner while ensuring our clients have an incredible customer experience..&nbsp; You will collaborate closely with cross-functional teams and leaders, including sales, customer success, support and product development, to deliver seamless and customized implementations that exceed client expectations.&nbsp; In this role you will lead, mentor, inspire and promote a high-performing client centric team that thrives on exceeding client expectations.</span></div><div><b>Who is Aiwyn and what do we do?</b></div><div><br></div><div>Aiwyn is the fastest-growing software company serving the accounting profession.&nbsp;Founded in 2020, we now work with 100+ of the largest CPA firms in the world.&nbsp;Our “Job to be done”: speed up cash flow, save Partner time, &amp; deliver best-in-class client experiences. We do this by automating day-to-day firm operations with our Practice Automation solutions. Aiwyn is led by serial entrepreneurs with multiple exits and funded by a Top 10 fintech VC.</div><div><br></div><div>To learn more, visit our <a href=\"https://aiwyn.ai/\" class=\"postings-link\" target=\"_blank\" rel=\"noopener noreferrer\"><b>website</b></a></div><div><br></div><div><b>This role: </b></div><div><br></div><div><span style=\"font-size: 10pt;\">As the Senior Director of Implementation, you will lead the implementation team as a player-coach. You will be responsible for our clients’ implementation success in a timely manner while ensuring our clients have an incredible customer experience..&nbsp; You will collaborate closely with cross-functional teams and leaders, including sales, customer success, support and product development, to deliver seamless and customized implementations that exceed client expectations.&nbsp; In this role you will lead, mentor, inspire and promote a high-performing client centric team that thrives on exceeding client expectations.</span></div><h3>Key Responsibilities:</h3><li>Responsible for team members to manage projects effectively and identify critical dependencies throughout the implementation process.</li><li>Ensure team members are embracing and routinely updating our project management tool for visibility and transparency to each project and proactively communicating updates as the primary contact for clients.</li><li>Continuously refine our internal playbook and repeatable processes to streamline client onboarding for the implementation and testing of Aiwyn’s solutions.</li><li>Oversee the onboarding and training process for hiring Implementation team members as we grow our team to 6-10 team members.</li><li>As a player coach, you will lead end-to-end implementation processes for new clients, ensuring a smooth transition from sales to go live.</li><li>Work closely with clients to understand their specific needs and configure the SaaS platform to meet those requirements.</li><li>Conduct testing and training sessions for clients to ensure they fully understand the features and capabilities of the SaaS solution.</li><li>Monitor project quality, team capacity, timeline, risk, and performance of each project and team member.</li><li>Work closely with sales to understand client requirements and develop tailored implementation plans.</li><li>Collaborate with internal teams to address any roadblocks, ensure timely project delivery and effectively manage escalations when needed.</li><div><br></div><div><b>The ideal candidate:</b></div><li>Obsesses over the customer experience</li><li>Becomes curious when things don’t work as expected</li><li>Runs towards challenges, not away from them</li><li>Relentlessly pursues excellence for the customer, the company, and our team</li><li>Has the courage to speak up when they disagree or have a better idea</li><li>Builds trust with direct teammates, members of other teams, and our customers by seamlessly blending execution, empathy, and transparency</li><li>Balances taking ownership over their realm by being open to feedback and new ideas</li><h3>Qualifications:</h3><li>Proven experience of 7+years within an early stage or growth company implementing and leading a team for SaaS solutions, preferably in the tax and accounting or related industry.</li><li>Strong project management skills with the ability to manage and oversee a team with multiple implementations concurrently.</li><li>Excellent problem solving, communication and interpersonal skills with internal and external team members of all levels.</li><li>Understanding of integrations between SaaS and software platforms.</li><li>Knowledge of tax and accounting processes is a plus.</li><li>The ability to travel occasionally for onsite Company meetings</li><li>The ability to travel occasionally for onsite Company meetings</li><div><br></div><div><b>Preferred:</b></div><li>Working in the accounting firm industry</li><li>Experience with <a rel=\"noopener noreferrer\" class=\"postings-link\" href=\"http://Monday.com\">Monday.com</a> Work Management Software</li><li>Working with Hubspot, Zendesk and Jira</li><h3>Benefits and Perks:</h3><li>The big-picture value proposition of this role is simple: join us, and you'll be paid competitively to have freedom in solving worthwhile, challenging problems alongside other A-players at a fast growing SaaS startup led by an experienced and successful co-founding team with industry experience. </li><div><br></div><div>Other benefits include:</div><li><b>Adventure travel stipend</b> - you receive a $1,000 travel reimbursement on your work anniversary each year. We encourage our team to recharge and explore the world beyond their home office walls.</li><li><b>Remote, work-from-anywhere culture</b></li><li><b>Flexible PTO</b></li><li><b>World Class health benefits</b> - we believe in fostering flourishing teams by providing benefits that go beyond the usual standards - Health, vision, dental, HSA/FSA, and mental health support.</li><li><b>Stock options</b> - every Full Time Employee has ownership in Aiwyn's future and success.</li><li><b>401(k) matching</b></li><h3>Our Values:</h3><li><b>Trust</b> - We champion transparency, welcome differing perspectives, uphold accountability, and trust that others have good intentions</li><li><b>Courage</b> - We have the courage to take calculated risks and embrace change, knowing what worked in the past won’t always work in the future</li><li><b>Impact</b> - Rooted in determination and innovation, we chase extraordinary outcomes and impactful results</li><li><b>Relentlessness</b> - We approach challenges with an unwavering resolve, never settling for mediocrity, and always striving to surpass expectations</li><h3>Learn more about Aiwyn:</h3><li><b><a rel=\"noopener noreferrer\" class=\"postings-link\" href=\"https://www.aiwyn.ai/about\">About us</a></b></li><li><b><a rel=\"noopener noreferrer\" class=\"postings-link\" href=\"https://www.aiwyn.ai/why-aiwyn\">Why Aiwyn</a></b></li><li><b><a rel=\"noopener noreferrer\" class=\"postings-link\" href=\"https://www.youtube.com/@AiwynAI\">YouTube page</a></b></li><div>Aiwyn is an equal opportunity employer. All qualified applicants will receive consideration for employment without regard to age, ancestry, color, family or medical care leave, gender identity or expression, genetic information, marital status, medical condition, national origin, physical or mental disability, political affiliation, protected veteran status, race, religion, sex (including pregnancy), sexual orientation, or any other characteristic protected by applicable laws, regulations and ordinances.</div><div><br></div><div>Candidate information will be treated in accordance with our CCPA privacy notice which can be found here: <a rel=\"noopener noreferrer\" class=\"postings-link\" href=\"https://www.aiwyn.ai/ccpa\">https://www.aiwyn.ai/ccpa</a></div>","tags":"[\"management\",\"aws\"]","pubDate":"2025-01-03T23:11:34.532Z","link":"https://jobs.lever.co/aiwyn/152128a3-1111-42d6-b1b1-7c955bc15d69","slug":"senior-director-of-implementation-aiwyn-2866"},{"id":8790549030,"title":"Customer Engineer","company":"Aiwyn","image":"https://media.licdn.com/dms/image/v2/D4E0BAQEvDOFt9VDmfg/company-logo_200_200/company-logo_200_200/0/1714673337921/aiwyn_logo?e=1743033600&v=beta&t=0yqXd-p9YeUPxD_oaEkvrGENa6XLG5S4Q4dDXCettEY","description":"<div><b>Who is Aiwyn and what do we do?</b></div><div><br></div><div>Aiwyn is the fastest-growing software company serving the accounting profession.&nbsp;Founded in 2020, we now work with 100+ of the largest CPA firms in the world.&nbsp;Our “Job to be done”: speed up cash flow, save Partner time, &amp; deliver best-in-class client experiences. We do this by automating day-to-day firm operations with our Practice Automation solutions. Aiwyn is led by serial entrepreneurs with multiple exits and funded by a Top 10 fintech VC.</div><div><br></div><div>To learn more, visit our <b><a rel=\"noopener noreferrer\" class=\"postings-link\" href=\"https://aiwyn.ai/\">website</a></b></div><div><br></div><div><b>This role: </b></div><div><br></div><div><span style=\"font-size: 11pt;\">At Aiwyn, our Support team plays a key role in our success. As a Customer Engineer, you’ll be responsible for resolving complex technical issues and acting as a Tier 3 Engineering point of contact. You will work with internal teams and customers from enterprise CPA firms to ensure smooth product and service delivery.</span></div><div><b>Who is Aiwyn and what do we do?</b></div><div><br></div><div>Aiwyn is the fastest-growing software company serving the accounting profession.&nbsp;Founded in 2020, we now work with 100+ of the largest CPA firms in the world.&nbsp;Our “Job to be done”: speed up cash flow, save Partner time, &amp; deliver best-in-class client experiences. We do this by automating day-to-day firm operations with our Practice Automation solutions. Aiwyn is led by serial entrepreneurs with multiple exits and funded by a Top 10 fintech VC.</div><div><br></div><div>To learn more, visit our <b><a href=\"https://aiwyn.ai/\" class=\"postings-link\" target=\"_blank\" rel=\"noopener noreferrer\">website</a></b></div><div><br></div><div><b>This role: </b></div><div><br></div><div><span style=\"font-size: 11pt;\">At Aiwyn, our Support team plays a key role in our success. As a Customer Engineer, you’ll be responsible for resolving complex technical issues and acting as a Tier 3 Engineering point of contact. You will work with internal teams and customers from enterprise CPA firms to ensure smooth product and service delivery.</span></div><h3>Key Responsibilities:</h3><li>Identify and troubleshoot complex customer issues in unique configurations.</li><li>Analyze patterns in customer interactions to drive product and service improvements.</li><li>Educate customers on Aiwyn products, becoming an SME (Subject Matter Expert) on key features.</li><li>Act as the technical liaison between teams like Support, Customer Success and Engineering, resolving escalations at the Tier 3 level.</li><li>Investigate technical problems using tools like LogRocket and Logs Explorer, leveraging logs and data for insights.</li><li>Develop scalable support processes based on customer feedback to improve workflows.</li><li>Provide exceptional support via emails, chats, or calls for both routine and advanced technical issues.</li><li>Occasionally use GitHub to investigate code-related issues or make small fixes as needed.</li><h3>Qualifications:</h3><li>Proven experience in product or technical support within a SaaS environment.</li><li>Strong knowledge of databases and SQL for troubleshooting technical issues.</li><li>Familiarity with web development, APIs, and tools like LogRocket for problem resolution.</li><li>Excellent communication skills, with the ability to simplify complex technical topics for customers and internal teams.</li><li>Ability to thrive in a fast-paced environment while managing multiple issues.</li><li>The ability to travel occasionally for onsite Company meetings</li><h3>Benefits and Perks:</h3><li>The big-picture value proposition of this role is simple: join us, and you'll be paid competitively to have freedom in solving worthwhile, challenging problems alongside other A-players at a fast growing SaaS startup led by an experienced and successful co-founding team with industry experience. </li><div><br></div><div>Other benefits include:</div><li><b>Adventure travel stipend</b> - you receive a $1,000 travel reimbursement on your work anniversary each year. We encourage our team to recharge and explore the world beyond their home office walls.</li><li><b>Remote, work-from-anywhere culture</b></li><li><b>Flexible PTO</b></li><li><b>World Class health benefits</b> - we believe in fostering flourishing teams by providing benefits that go beyond the usual standards - Health, vision, dental, HSA/FSA, and mental health support.</li><li><b>Stock options</b> - every Full Time Employee has ownership in Aiwyn's future and success.</li><li><b>401(k) matching</b></li><h3>Our Values:</h3><li><b>Trust</b> - We champion transparency, welcome differing perspectives, uphold accountability, and trust that others have good intentions</li><li><b>Courage</b> - We have the courage to take calculated risks and embrace change, knowing what worked in the past won’t always work in the future</li><li><b>Impact</b> - Rooted in determination and innovation, we chase extraordinary outcomes and impactful results</li><li><b>Relentlessness</b> - We approach challenges with an unwavering resolve, never settling for mediocrity, and always striving to surpass expectations</li><h3>Learn more about Aiwyn:</h3><li><a rel=\"noopener noreferrer\" class=\"postings-link\" href=\"https://www.aiwyn.ai/about\"><b>About us</b></a></li><li><a rel=\"noopener noreferrer\" class=\"postings-link\" href=\"https://www.aiwyn.ai/why-aiwyn\"><b>Why Aiwyn</b></a></li><li><a rel=\"noopener noreferrer\" class=\"postings-link\" href=\"https://www.youtube.com/@AiwynAI\"><b>YouTube page</b></a></li><div>Aiwyn is an equal opportunity employer. All qualified applicants will receive consideration for employment without regard to age, ancestry, color, family or medical care leave, gender identity or expression, genetic information, marital status, medical condition, national origin, physical or mental disability, political affiliation, protected veteran status, race, religion, sex (including pregnancy), sexual orientation, or any other characteristic protected by applicable laws, regulations and ordinances.</div><div><br></div><div>Candidate information will be treated in accordance with our CCPA privacy notice which can be found here: <a rel=\"noopener noreferrer\" class=\"postings-link\" href=\"https://www.aiwyn.ai/ccpa\">https://www.aiwyn.ai/ccpa</a></div>","tags":"[\"engineering\",\"database\",\"aws\"]","pubDate":"2025-01-03T23:05:02.643Z","link":"https://jobs.lever.co/aiwyn/4ceed96a-d04f-4a6b-97fb-5ab64364f44b","slug":"customer-engineer-aiwyn-4767"},{"id":3826415217,"title":"Assistant Controller","company":"Aiwyn","image":"https://media.licdn.com/dms/image/v2/D4E0BAQEvDOFt9VDmfg/company-logo_200_200/company-logo_200_200/0/1714673337921/aiwyn_logo?e=1743033600&v=beta&t=0yqXd-p9YeUPxD_oaEkvrGENa6XLG5S4Q4dDXCettEY","description":"<div><b>Who is Aiwyn, and what do we do?</b></div><div><br></div><div><span style=\"font-size: 16px\">Aiwyn is the fastest-growing software company serving the accounting profession.&nbsp;Founded in 2020, we now work with 100+ of the largest CPA firms in the world.&nbsp;Our “Job to be done”: speed up cash flow, save Partner time, &amp; deliver best-in-class client experiences. We do this by automating day-to-day firm operations with our Practice Automation solutions. Aiwyn is led by serial entrepreneurs with multiple exits and funded by a Top 10 fintech VC.</span></div><div><br></div><div><span style=\"font-size: 16px\">To learn more, visit our </span><b style=\"font-size: 16px\"><a class=\"postings-link\" href=\"https://aiwyn.ai/\">website</a></b></div><div><br></div><div><b>Who is Aiwyn, and what do we do?</b></div><div><br></div><div><span style=\"font-size: 16px\">Aiwyn is the fastest-growing software company serving the accounting profession.&nbsp;Founded in 2020, we now work with 100+ of the largest CPA firms in the world.&nbsp;Our “Job to be done”: speed up cash flow, save Partner time, &amp; deliver best-in-class client experiences. We do this by automating day-to-day firm operations with our Practice Automation solutions. Aiwyn is led by serial entrepreneurs with multiple exits and funded by a Top 10 fintech VC.</span></div><div><br></div><div><span style=\"font-size: 16px\">To learn more, visit our </span><b style=\"font-size: 16px\"><a href=\"https://aiwyn.ai/\" class=\"postings-link\">website</a></b></div><div><br></div><h3>Key Responsibilities:</h3><li><b><i>Technical Accounting &amp; Compliance: </i></b></li><li>Draft detailed accounting memos to address complex transactions and ensure compliance with GAAP and other applicable standards.</li><li>Collaborate with auditors to support annual audits and prepare required documentation.</li><div><br></div><li><b><i>Process Design &amp; Improvement:</i></b></li><li>Assist in designing and implementing new processes, workflows, and reconciliations to improve efficiency and scalability.</li><li>Partner with cross-functional teams to refine billing, accounts payable (AP), and accounts receivable (AR) processes.</li><div><br></div><li><b>AP, AR &amp; Billing Oversight:</b></li><li>Monitor daily AP and AR activities, ensuring accurate and timely processing.</li><li>Assist in responding to customer inquiries related to billing and payments.</li><li>Ensure adherence to internal controls and company policies for spend and collections.</li><div><br></div><li><b>Month-End Close Support:</b></li><li>Actively manage the close process to ensure month-end tasks are performed timely and accurately.</li><li>Complete advanced reconciliations and journal entries as needed.</li><li>Perform preliminary review of monthly close activities, including journal entries, reconciliations, and variance analysis.</li><li>Identify and resolve discrepancies and provide recommendations for process enhancements.</li><div><br></div><li><b><i>Tax Compliance:</i></b></li><li>Oversee and ensure compliance with sales and use tax regulations, including maintaining accurate tax records, preparing filings, and managing exemptions.</li><li>Assist the VP of Accounting in monitoring and managing franchise tax, income tax, and other applicable tax filings.</li><li>Research and stay up-to-date on tax law changes and ensure proper implementation of necessary adjustments.</li><li>Respond to tax authority inquiries or audits.</li><div><br></div><li><b>Team Collaboration &amp; Leadership:</b></li><li>Support the VP of Accounting in mentoring and developing team members, providing training on new processes, and ensuring alignment with company <a href=\"http://goals.Serve\">goals.</a></li><li>Serve as a key point of contact for internal and external stakeholders on financial matters.</li><div><br></div><h3>Qualifications:</h3><li>5+ years of experience in accounting, preferably with a mix of public accounting (Big 4 or mid-tier) and industry experience in a SaaS or technology company.</li><li>Bachelor’s degree in Accounting, Finance, or related field; CPA or CPA candidate strongly preferred.</li><li>Strong understanding of GAAP and technical accounting concepts.</li><li>Experience drafting technical accounting memos and working with auditors.</li><li>Proven ability to design and improve processes and reconciliations in a scaling environment.</li><li>Advanced proficiency in Microsoft Excel; experience with ERP systems (e.g., NetSuite) is a plus.</li><li>Excellent organizational, communication, problem solving and analytical skills.</li><li>Ability to work in a fast-paced environment, manage multiple priorities, and meet deadlines.</li><li>The ability to travel occasionally for onsite Company meetings</li><h3>Benefits and Perks:</h3><li>The big-picture value proposition of this role is simple: join us, and you'll be paid competitively to have freedom in solving worthwhile, challenging problems alongside other A-players at a fast-growing SaaS startup led by an experienced and successful co-founding team with industry experience. </li><div><br></div><div>Other benefits include:</div><li><b>Adventure travel stipend</b> - You receive a $1,000 travel reimbursement on your work anniversary each year. We encourage our team to recharge and explore the world beyond their home office walls.</li><li><b>Remote, work-from-anywhere culture</b></li><li><b>Flexible PTO</b></li><li><b>World Class health benefits</b> - We believe in fostering flourishing teams by providing benefits beyond the usual standards, such as health, vision, dental, HSA/FSA, and mental health support.</li><li><b>Stock options</b> - every Full Time Employee owns Aiwyn's future and success.</li><li><b>401(k) matching</b></li><h3>Our Values:</h3><li><b>Trust</b> - We champion transparency, welcome differing perspectives, uphold accountability, and trust that others have good intentions</li><li><b>Courage</b> - We have the courage to take calculated risks and embrace change, knowing what worked in the past won’t always work in the future</li><li><b>Impact</b> - Rooted in determination and innovation, we chase extraordinary outcomes and impactful results</li><li><b>Relentlessness</b> - We approach challenges with an unwavering resolve, never settling for mediocrity, and always striving to surpass expectations</li><h3>Learn more about Aiwyn:</h3><li><a class=\"postings-link\" href=\"https://www.aiwyn.ai/about\"><b>About us</b></a></li><li><a class=\"postings-link\" href=\"https://www.aiwyn.ai/why-aiwyn\"><b>Why Aiwyn</b></a></li><li><a class=\"postings-link\" href=\"https://www.youtube.com/@AiwynAI\"><b>YouTube page</b></a></li><div>Aiwyn is an equal opportunity employer. All qualified applicants will receive consideration for employment without regard to age, ancestry, color, family or medical care leave, gender identity or expression, genetic information, marital status, medical condition, national origin, physical or mental disability, political affiliation, protected veteran status, race, religion, sex (including pregnancy), sexual orientation, or any other characteristic protected by applicable laws, regulations and ordinances.</div><div><br></div><div>Candidate information will be treated in accordance with our CCPA privacy notice which can be found here: <a class=\"postings-link\" href=\"https://www.aiwyn.ai/ccpa\">https://www.aiwyn.ai/ccpa</a></div>","tags":"[\"finance\",\"aws\"]","pubDate":"2025-01-03T22:56:00.999Z","link":"https://jobs.lever.co/aiwyn/f2942953-2772-400b-b0b6-c50b98aaebbe","slug":"assistant-controller-aiwyn-4381"},{"id":3289139414,"title":"Peopleops Coordinator","company":"Supabase","image":"https://avatars.githubusercontent.com/u/54469796?s=200&v=4","description":"<p style=\"min-height:1.5em\"><br />An exciting new role, we are looking for a PeopleOps Coordinator to join our team.  Are you highly organized? Do you enjoy a variety in your role? Are you passionate about employe experience? In this role, you will play a key part in supporting our people and creating people processes. <br /><br /><strong>As a People Operations Coordinator, you will:</strong></p><ul style=\"min-height:1.5em\"><li><p style=\"min-height:1.5em\">Manage key admin people processes such as preparing offer letters, updating employee records, and maintaining HR systems</p></li><li><p style=\"min-height:1.5em\">Bring energy and creativity to team events, offsites, and engagement initiatives that make our workplace fun and inclusive</p></li><li><p style=\"min-height:1.5em\">Be the go-to person for employee questions, helping to create a smooth and supportive experience for everyone.</p></li><li><p style=\"min-height:1.5em\">Coordinate performance review processes, ensuring smooth scheduling and follow-ups.</p></li><li><p style=\"min-height:1.5em\">Support driving impactful projects and process improvements that shape our growing company.</p></li></ul><p style=\"min-height:1.5em\"><strong>You are:</strong></p><ul style=\"min-height:1.5em\"><li><p style=\"min-height:1.5em\">A self-starter who thrives in a fast-paced, ever-changing environment.</p></li><li><p style=\"min-height:1.5em\">Organized and detail-oriented, with a knack for juggling multiple tasks and keeping things running smoothly.</p></li><li><p style=\"min-height:1.5em\">A great communicator who builds trust and handles sensitive information with care - you’ll be working across our whole team</p></li><li><p style=\"min-height:1.5em\">Excited to learn and grow in a startup where you can make a real impact from day one.</p></li><li><p style=\"min-height:1.5em\">Have 3+ years of PeopleOps role, ideally in a global remote company</p></li></ul><h3><strong>We offer:</strong></h3><ul style=\"min-height:1.5em\"><li><p style=\"min-height:1.5em\">100% remote work from anywhere in the world, with no location-based salary adjustments;</p></li><li><p style=\"min-height:1.5em\">Autonomous work—while we collaborate on projects, you set your own pace;</p></li><li><p style=\"min-height:1.5em\">Health, vision, and dental benefits—Supabase covers 100% for employees and 80% for dependents;</p></li><li><p style=\"min-height:1.5em\">A generous tech allowance for any work setup you need;</p></li><li><p style=\"min-height:1.5em\">An annual education allowance;</p></li><li><p style=\"min-height:1.5em\">Company offsites held annually.</p></li></ul><p style=\"min-height:1.5em\"></p><p style=\"min-height:1.5em\">Note: we will not be reviewing applications till mid Jan 2025</p><h2>About the team</h2><ul style=\"min-height:1.5em\"><li><p style=\"min-height:1.5em\">We're a startup. It's unstructured.</p></li><li><p style=\"min-height:1.5em\">Collectively founded more than 30 startups.</p></li><li><p style=\"min-height:1.5em\">Globally distributed team with more than 30 different nationalities.</p></li><li><p style=\"min-height:1.5em\">We deeply believe in <a target=\"_blank\" rel=\"noopener noreferrer nofollow\" href=\"https://supabase.com/blog/2022/03/25/should-i-open-source-my-company\">the efficacy of collaborative open source</a>. We support existing communities and tools, rather than building \"yet another xx\".</p></li><li><p style=\"min-height:1.5em\">We \"dogfood\" everything. If you use it in your project, we use it in Supabase.</p></li></ul><h2>Process</h2><ul style=\"min-height:1.5em\"><li><p style=\"min-height:1.5em\">The entire process is fully remote and all communication will happen over email or via video chat.</p></li><li><p style=\"min-height:1.5em\">Once you've submitted your application, the team will review your submission and may reach out for a short screening interview over a video call.</p></li><li><p style=\"min-height:1.5em\">If you pass the screen you will be invited to up to four follow-up interviews. </p></li><li><p style=\"min-height:1.5em\">The calls:</p><ul style=\"min-height:1.5em\"><li><p style=\"min-height:1.5em\">usually take between 20-45 minutes each depending on the interviewer.</p></li><li><p style=\"min-height:1.5em\">most of the time, are all 1:1.</p></li><li><p style=\"min-height:1.5em\">will be with the founders, a member of either the growth or engineering team (depending on the role) and usually one other person from your immediate team or function.</p></li></ul></li><li><p style=\"min-height:1.5em\">Once the interviews are over, the team will meet to discuss several roles and candidates and may:</p><ul style=\"min-height:1.5em\"><li><p style=\"min-height:1.5em\">ask one or two follow-up questions over email or a quick call.</p></li><li><p style=\"min-height:1.5em\">go directly to making an offer.</p></li></ul></li></ul>","tags":"[\"engineering\"]","pubDate":"2025-01-03T20:46:14.108Z","link":"https://jobs.ashbyhq.com/supabase/33d1b088-acec-400a-9eea-488f709ccae3","slug":"peopleops-coordinator-supabase-4388"},{"id":9140906466,"title":"Senior Product Marketing Manager","company":"Aiwyn","image":"https://media.licdn.com/dms/image/v2/D4E0BAQEvDOFt9VDmfg/company-logo_200_200/company-logo_200_200/0/1714673337921/aiwyn_logo?e=1743033600&v=beta&t=0yqXd-p9YeUPxD_oaEkvrGENa6XLG5S4Q4dDXCettEY","description":"<div><b>Who is Aiwyn and what do we do?</b></div><div><br></div><div>Aiwyn is the fastest-growing software company serving the accounting profession.&nbsp;Founded in 2020, we now work with 100+ of the largest CPA firms in the world.&nbsp;Our “Job to be done”: speed up cash flow, save Partner time, &amp; deliver best-in-class client experiences. We do this by automating day-to-day firm operations with our Practice Automation solutions. Aiwyn is led by serial entrepreneurs with multiple exits and funded by a Top 10 fintech VC.</div><div><br></div><div>To learn more, visit our <a class=\"postings-link\" href=\"https://aiwyn.ai/\"><b>website</b></a></div><div><b>Who is Aiwyn and what do we do?</b></div><div><br></div><div>Aiwyn is the fastest-growing software company serving the accounting profession.&nbsp;Founded in 2020, we now work with 100+ of the largest CPA firms in the world.&nbsp;Our “Job to be done”: speed up cash flow, save Partner time, &amp; deliver best-in-class client experiences. We do this by automating day-to-day firm operations with our Practice Automation solutions. Aiwyn is led by serial entrepreneurs with multiple exits and funded by a Top 10 fintech VC.</div><div><br></div><div>To learn more, visit our <a href=\"https://aiwyn.ai/\" class=\"postings-link\"><b>website</b></a></div><h3>Key Responsibilities:</h3><li>With collaboration from product and sales teams, own and refine product messaging, value proposition, and positioning of the PracticeOS platform.</li><li>Create and manage sales enablement materials and training on our products and services for the sales and GTM teams.</li><li>Help develop a deep understanding of our buyer persona by continuously conducting research and gathering insights, including pain points, channels, and purchasing decisions, and socializing those insights with marketing, sales, and R&amp;D.</li><li>In partnership with marketing, strategize and execute content and campaign strategies centered on go to market strategy and firm buying needs.</li><li>Responsible for developing, socializing, and executing documents such as market requirements, marketing plans, sales enablement plans, and launch plans.</li><li>Implement a customer marketing strategy, gathering customer references, testimonials and case studies for external and internal use, establishing strategies to drive retention, engaging the Aiwyn customer community, and upsell and cross-sell for products across the technology platform.</li><li>Work with marketing colleagues, sales, and sales operations to provide reporting on the PracticeOS platform, including revenue, marketing influenced pipeline, sales velocity, win/loss ratio, and monitor this ongoing to assess and address gaps in performance.</li><h3>Qualifications:</h3><li>5-7 years of strong Product Marketing experience</li><li>3+ years of experience in the areas of Accounting or Marketing in small-to-mid scale businesses</li><li>Bachelor’s degree in business, marketing, or relevant experience</li><li>Familiarity with account-based marketing</li><li>Familiarity with vertical SaaS/Platform organizations</li><li>Experience working in a fast-paced, startup environment</li><li>Strong attention to detail and excellent problem-solving skills</li><li>Ability to think strategically and execute with a high degree of precision</li><li>Strong cross functional leadership and communication skills</li><li>The ability to travel occasionally for onsite Company meetings</li><h3>Benefits and Perks:</h3><li>The big-picture value proposition of this role is simple: join us, and you'll be paid competitively to have freedom in solving worthwhile, challenging problems alongside other A-players at a fast growing SaaS startup led by an experienced and successful co-founding team with industry experience. </li><div><br></div><div>Other benefits include:</div><li><b>Adventure travel stipend</b> - you receive a $1,000 travel reimbursement on your work anniversary each year. We encourage our team to recharge and explore the world beyond their home office walls.</li><li><b>Remote, work-from-anywhere culture</b></li><li><b>Flexible PTO</b></li><li><b>World Class health benefits</b> - we believe in fostering flourishing teams by providing benefits that go beyond the usual standards - Health, vision, dental, HSA/FSA, and mental health support.</li><li><b>Stock options</b> - every Full Time Employee has ownership in Aiwyn's future and success.</li><li><b>401(k) matching</b></li><h3>Our Values:</h3><li><b>Trust</b> - We champion transparency, welcome differing perspectives, uphold accountability, and trust that others have good intentions</li><li><b>Courage</b> - We have the courage to take calculated risks and embrace change, knowing what worked in the past won’t always work in the future</li><li><b>Impact</b> - Rooted in determination and innovation, we chase extraordinary outcomes and impactful results</li><li><b>Relentlessness</b> - We approach challenges with an unwavering resolve, never settling for mediocrity, and always striving to surpass expectations</li><h3>Learn more about Aiwyn:</h3><li><b><a class=\"postings-link\" href=\"https://www.aiwyn.ai/about\">About us</a></b></li><li><b><a class=\"postings-link\" href=\"https://www.aiwyn.ai/why-aiwyn\">Why Aiwyn</a></b></li><li><b><a class=\"postings-link\" href=\"https://www.youtube.com/@AiwynAI\">YouTube page</a></b></li><div>Aiwyn is an equal opportunity employer. All qualified applicants will receive consideration for employment without regard to age, ancestry, color, family or medical care leave, gender identity or expression, genetic information, marital status, medical condition, national origin, physical or mental disability, political affiliation, protected veteran status, race, religion, sex (including pregnancy), sexual orientation, or any other characteristic protected by applicable laws, regulations and ordinances.</div><div><br></div><div>Candidate information will be treated in accordance with our CCPA privacy notice which can be found here: <a class=\"postings-link\" href=\"https://www.aiwyn.ai/ccpa\">https://www.aiwyn.ai/ccpa</a></div>","tags":"[\"aws\"]","pubDate":"2025-01-03T19:51:31.883Z","link":"https://jobs.lever.co/aiwyn/8792c1a7-632f-412e-b062-73a8a3089300","slug":"senior-product-marketing-manager-aiwyn-3035"},{"id":4205274323,"title":"Forward Deployed Engineer","company":"Sourcegraph","image":"https://avatars.githubusercontent.com/u/3979584?s=200&v=4","description":"&lt;div class=&quot;content-intro&quot;&gt;&lt;h2&gt;&lt;strong&gt;&lt;span style=&quot;color: #a112ff;&quot;&gt;Who we are&lt;/span&gt;&lt;/strong&gt;&lt;/h2&gt;\n&lt;p&gt;Our mission at Sourcegraph is to make it so that &lt;a href=&quot;https://www.notion.so/sourcegraph/Mission-values-e9d37e6b972a4ef395c3076aea2bd07d?pvs=4&quot;&gt;everyone can code&lt;/a&gt;, not just ~0.1% of the population.&amp;nbsp;&lt;/p&gt;\n&lt;p&gt;We are transforming how the world’s most important companies build software by industrializing development with AI. Today, most professional developers spend a disproportionate amount of time understanding code and performing repetitive, low-level tasks—leaving less time for innovation and meaningful impact.&lt;/p&gt;\n&lt;p&gt;We’re changing that. Sourcegraph brings AI-powered search and agents to the enterprise, helping teams automate the mundane and amplify what developers do best— solving hard problems and creating great products.&lt;/p&gt;\n&lt;p&gt;Here’s how we’re making a difference:&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;&lt;strong&gt;Accelerating developers &lt;/strong&gt;with AI agents that deliver insights and precision—enabling 5x faster test creation, 30% increase in merge requests, and saving 20 minutes per developer daily.&lt;/li&gt;\n&lt;li&gt;&lt;strong&gt;Automating repetitive tasks,&lt;/strong&gt; from remediating vulnerabilities (saving teams 1,000+ hours annually) to speeding up migrations that would take years to months.&amp;nbsp;&lt;/li&gt;\n&lt;li&gt;&lt;strong&gt;Enabling innovation&lt;/strong&gt; by addressing complex problems like automated bug triage, vulnerability detection, and AI-driven code reviews seamlessly integrated into workflows.&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;Trusted by 7/10 top software companies by market cap, 4/6 top US banks and many of the companies leading global innovation, like Stripe, Indeed, Tesla, and 1Password, and with $225M in funding from investors like &lt;a href=&quot;https://techcrunch.com/2021/07/13/sourcegraph-raises-125m-series-d-on-2-6b-valuation-for-universal-code-search-tool/&quot;&gt;a16z&lt;/a&gt;, &lt;a href=&quot;https://about.sourcegraph.com/blog/series-c-with-sequoia/&quot;&gt;Sequoia&lt;/a&gt;, and &lt;a href=&quot;https://www.redpoint.com/companies/sourcegraph/&quot;&gt;Redpoint&lt;/a&gt;, we are building the tools that will define the next era of enterprise software development.&lt;/p&gt;\n&lt;p&gt;If you’re passionate about solving the hardest problems in software and shaping the future of technology, join us. Let’s build something extraordinary together.&lt;/p&gt;&lt;/div&gt;&lt;h2&gt;&lt;span style=&quot;color: rgb(161, 18, 255);&quot;&gt;&lt;strong&gt;Location&lt;/strong&gt;&lt;/span&gt;&lt;/h2&gt;\n&lt;p&gt;🌎 This role is based in our San Francisco headquarters. However, please note that this position requires extensive travel, typically up to 80% of the time (Monday-Thursday) for on-site customer engagements. When not traveling, you&#39;ll work from our &lt;a href=&quot;https://www.notion.so/sourcegraph/Interviewing-at-our-SF-office-c3517d0d136043519aaf1fe12d5bbf9f#2ede76d240164d19965626765b651f02&quot;&gt;SF office&lt;/a&gt;. &lt;span style=&quot;color: rgb(161, 18, 255);&quot;&gt;&lt;strong&gt;Why this job is exciting&lt;/strong&gt;&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;As a Forward Deployed Engineer (FDE) at Sourcegraph, you’ll report directly to our CEO and get to work with the most successful and sophisticated software companies in the world (&lt;a href=&quot;https://sourcegraph.com/case-studies&quot;&gt;our customers&lt;/a&gt;) and build code AI capabilities that all of their devs love and use in ways far beyond anything else out there. Your code will be informed by what our biggest customers need and will ship to all customers and users, so you must have exacting standards. You’ll be working directly with our biggest customers, so you need to know how to work with eng leaders and devs and pitch and sell and react on the fly. You’ll learn and do more in your first 6 months of being an FDE here than you will anywhere else.&lt;/p&gt;\n&lt;h4&gt;📅 Within one month, you will…&lt;/h4&gt;\n&lt;ul&gt;\n&lt;li&gt;Get yourself intimately familiar with our entire tech stack and product feature set&lt;/li&gt;\n&lt;li&gt;Shadow experienced team members FDE, Engineering, and Technical Success to learn about customer engagements&lt;/li&gt;\n&lt;li&gt;Learn how to pitch our product and familiarize yourself with our go-to-market motion to understand how FDEs fit into the larger customer success strategy&lt;/li&gt;\n&lt;li&gt;Get deployed to your first customer to lead an engagement from end-to-end&lt;/li&gt;\n&lt;/ul&gt;\n&lt;h4&gt;📅 Within six months, you will…&lt;/h4&gt;\n&lt;ul&gt;\n&lt;li&gt;Work with our largest and most sophisticated customers, building new capabilities and improving existing capabilities in our product&lt;/li&gt;\n&lt;li&gt;Identify and capitalize on new opportunities across all of our customers&lt;/li&gt;\n&lt;li&gt;Contribute to the refinement and scaling of the FDE program based on your experiences&lt;/li&gt;\n&lt;li&gt;Become a go-to expert for complex customer integrations and technical challenges&lt;/li&gt;\n&lt;li&gt;Grow our customers&#39; love for Sourcegraph&lt;/li&gt;\n&lt;/ul&gt;\n&lt;h2&gt;&lt;span style=&quot;color: rgb(161, 18, 255);&quot;&gt;&lt;strong&gt;About you&lt;/strong&gt;&lt;/span&gt;&lt;/h2&gt;\n&lt;p&gt;You are a driven engineer who thrives with customers, loves working with cutting-edge technology, and is excited about shaping the future of developer tools:&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;You&#39;re passionate about developer tools and solving complex technical challenges&lt;/li&gt;\n&lt;li&gt;You excel in fast-paced, changing environments and enjoy working directly with customers&lt;/li&gt;\n&lt;li&gt;You&#39;re comfortable balancing technical work with relationship building and strategic thinking&lt;/li&gt;\n&lt;li&gt;You&#39;re excited about the prospect of frequent travel and intense on-site engagements&lt;/li&gt;\n&lt;li&gt;You&#39;re eager to learn and adapt to diverse technologies and business environments&lt;/li&gt;\n&lt;li&gt;You enjoy the idea of having a direct impact on product development and company growth&lt;/li&gt;\n&lt;li&gt;You have a strong software engineering background with hands-on coding experience&lt;/li&gt;\n&lt;li&gt;You possess excellent problem-solving skills and ability to think on your feet&lt;/li&gt;\n&lt;li&gt;You have strong communication skills, both technical and non-technical&lt;/li&gt;\n&lt;li&gt;You have experience with developer tools, code search, and AI-assisted coding&lt;/li&gt;\n&lt;/ul&gt;\n&lt;h2&gt;&lt;span style=&quot;color: rgb(161, 18, 255);&quot;&gt;&lt;strong&gt;Level&lt;/strong&gt;&lt;/span&gt;&lt;/h2&gt;\n&lt;p&gt;📊 This job is an IC1-IC5.&amp;nbsp; You can read more about &lt;a href=&quot;https://www.notion.so/sourcegraph/Leveling-Guide-0e1b5c76ada64b9caac387f8b7c4fc66&quot;&gt;our job leveling philosophy&lt;/a&gt; in our Handbook.&lt;/p&gt;\n&lt;p&gt;&lt;br&gt;We&#39;re open to candidates at various experience levels, but this is a highly demanding role that requires a lot of autonomy and high-agency. You’ll be interacting with some of the world’s most powerful and influential technical leaders. If using your strong technical skills and ability to communicate to world-class executives to deliver high-impact solutions to previously unsolved problems sounds like a fun challenge then this job may be a great fit for you!&lt;/p&gt;\n&lt;h2&gt;&lt;span style=&quot;color: rgb(161, 18, 255);&quot;&gt;&lt;strong&gt;Compensation&lt;/strong&gt;&lt;/span&gt;&lt;/h2&gt;\n&lt;p&gt;&lt;strong&gt;💸 We pay you an above-average salary&lt;/strong&gt; because we want to hire the best people who are fully focused on helping Sourcegraph succeed, not worried about paying bills. As an &lt;a href=&quot;https://sourcegraph.notion.site/Mission-values-e9d37e6b972a4ef395c3076aea2bd07d&quot;&gt;open and transparent&lt;/a&gt; company that values &lt;a href=&quot;https://www.notion.so/sourcegraph/Compensation-Pay-Transparency-at-Sourcegraph-d58d0774f51b4b489d41c3628d30ff8d?pvs=4&quot;&gt;competitive compensation&lt;/a&gt;, our compensation ranges are visible to every single Sourcegraph teammate.&lt;/p&gt;\n&lt;p&gt;Your salary is determined by your pay band for the IC1-IC5 job level. For determining pay bands, we use a number of market and data-driven salary sources, along with your location zone, and target the high-end of the range to ensure we’re always paying above market regardless of where you live in the world. Both U.S. and international locations are divided into one of four zones, determined by the cost of labor index for each area. The salary for a successful candidate will be based on level, job-related skills, experience, qualifications, and location zone. Please note that the salaries below may be adjusted in the future.&lt;/p&gt;\n&lt;p&gt;💰 The target compensation for this role is based on the IC1-IC5 pay band for your zone. The start of the IC1-IC5 &amp;nbsp;pay band for each zone is listed below:&lt;/p&gt;\n&lt;p&gt;IC1: $129,500&lt;br&gt;IC2: $145,000&lt;br&gt;IC3: $170,000&lt;br&gt;IC4: $200,000&lt;br&gt;IC5: $225,000&lt;/p&gt;\n&lt;p&gt;Please speak with a recruiter for additional information regarding zone locations.&lt;/p&gt;\n&lt;p&gt;📈 In addition to our cash compensation, we offer equity (because when we succeed as a company, we want you to succeed, too) and generous&amp;nbsp;&lt;a href=&quot;https://sourcegraph.notion.site/Benefits-Perks-dd1da4b6b3a64780abed010a144d34ba&quot;&gt;perks &amp;amp; benefits&lt;/a&gt;.&lt;/p&gt;\n&lt;h2&gt;&lt;span style=&quot;color: rgb(161, 18, 255);&quot;&gt;&lt;strong&gt;Interview process&lt;/strong&gt;&lt;/span&gt;&lt;/h2&gt;\n&lt;p&gt;&lt;em&gt;Below is the interview process you can expect for this role (you can read more about &lt;/em&gt;&lt;a href=&quot;https://sourcegraph.notion.site/Types-of-interviews-f279f080583d49ee9f2c60e30c8cb1f7&quot;&gt;&lt;em&gt;the types of interviews&lt;/em&gt;&lt;/a&gt;&lt;em&gt; in our Handbook). It may look like a lot of steps, but rest assured that we move quickly and the steps are designed to help you get the information needed to determine if we’re the right fit for you… Interviewing is a two-way street, after all!&amp;nbsp;&lt;/em&gt;&lt;/p&gt;\n&lt;p&gt;We expect the interview process to take 3.5 hours in total.&amp;nbsp;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;👋 Introduction Stage&lt;/strong&gt; - we have initial conversations to get to know you better…&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;[30m]&amp;nbsp;&lt;a href=&quot;https://www.notion.so/sourcegraph/Types-of-interviews-sample-questions-f279f080583d49ee9f2c60e30c8cb1f7?pvs=4#99be5ff628b2414194a0ba79d9f25f13&quot;&gt;Recruiter Screen&lt;/a&gt;&lt;/li&gt;\n&lt;li&gt;[30m] &lt;a href=&quot;https://www.notion.so/sourcegraph/Types-of-interviews-sample-questions-f279f080583d49ee9f2c60e30c8cb1f7?pvs=4#1919882c0cf147c487eb1df40db8a694&quot;&gt;Hiring Manager Screen&lt;/a&gt; with CEO/Co-founder&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;&lt;strong&gt;🧑‍💻 Team Interview Stage&lt;/strong&gt; - we then schedule an all-day onsite interview to delve into your experience in more depth and introduce you to members of the team, including cross-functional partners…&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;[60m] &lt;a href=&quot;https://www.notion.so/sourcegraph/Resources-for-Candidates-Engineering-Interview-Process-c37a70dea5794085bee0c0818c9ef0b3?pvs=4#e83edd987754460e839138a4bbfd592e&quot;&gt;Coding exercise&lt;/a&gt;&lt;/li&gt;\n&lt;li&gt;[45m] &lt;a href=&quot;https://www.notion.so/sourcegraph/Types-of-interviews-sample-questions-f279f080583d49ee9f2c60e30c8cb1f7?pvs=4#cb00697e95304550a146c32563c0255d&quot;&gt;Cross-functional team collaboration&lt;/a&gt; / &lt;a href=&quot;https://www.notion.so/sourcegraph/Types-of-interviews-sample-questions-f279f080583d49ee9f2c60e30c8cb1f7?pvs=4#e3a04291743048df87541a88aa8199dd&quot;&gt;Values&lt;/a&gt;&lt;/li&gt;\n&lt;li&gt;[45m] Decomp interview with CEO/Co-founder&lt;/li&gt;\n&lt;li&gt;We check references and conduct your background check&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;Please note - you are welcome to request additional conversations with anyone you would like to meet, but didn’t get to meet during the interview process.&lt;/p&gt;&lt;div class=&quot;content-conclusion&quot;&gt;&lt;h2&gt;&lt;strong&gt;&lt;span style=&quot;color: #a112ff;&quot;&gt;Learn more about us&lt;/span&gt;&lt;/strong&gt;&lt;/h2&gt;\n&lt;p&gt;You can learn more about what it is like to work at Sourcegraph by reading &lt;a href=&quot;https://sourcegraph.notion.site/d7614e3e9dc04c09ac2d42d57f1816e6?v=2a6d426dbae14390b155120b0c029ce0&quot;&gt;our handbook&lt;/a&gt;.&lt;/p&gt;\n&lt;p&gt;We are an ambitious team who are collectively working hard to build the most influential company in the world.&amp;nbsp; You can read more about our &lt;a href=&quot;https://sourcegraph.notion.site/What-it-s-like-working-at-Sourcegraph-119a8e11265880b18911eee4d9b7c460#119a8e1126588062b935fc66104b6115&quot;&gt;culture&lt;/a&gt;, &lt;a href=&quot;https://sourcegraph.notion.site/Compensation-Pay-Transparency-at-Sourcegraph-d58d0774f51b4b489d41c3628d30ff8d?pvs=74&quot;&gt;competitive compensation&lt;/a&gt; and &lt;a href=&quot;https://sourcegraph.notion.site/Benefits-Perks-dd1da4b6b3a64780abed010a144d34ba?pvs=74&quot;&gt;benefits&lt;/a&gt; here&lt;/p&gt;\n&lt;p&gt;Sourcegraph is an equal opportunity workplace; we welcome people from all backgrounds.&amp;nbsp;&lt;/p&gt;\n&lt;p&gt;&lt;em&gt;Sourcegraph participates in &lt;/em&gt;&lt;a href=&quot;https://sourcegraph.notion.site/E-Verify-2ab3286dde3446d6bac2898c83610107&quot;&gt;&lt;em&gt;E-Verify&lt;/em&gt;&lt;/a&gt;&lt;em&gt; for U.S. Employees. &lt;/em&gt;&lt;/p&gt;&lt;/div&gt;","tags":"[\"engineering\"]","pubDate":"2025-01-03T16:15:02.000Z","link":"https://boards.greenhouse.io/sourcegraph91/jobs/5371418004","slug":"forward-deployed-engineer-sourcegraph-8792"},{"id":5712994201,"title":"🇫🇷 Social Media Manager - French Fluent","company":"Paradox","image":"https://media.licdn.com/dms/image/v2/D4D0BAQEmydwDkZ6NPw/company-logo_200_200/company-logo_200_200/0/1711612675702/weareparadox_en_logo?e=1743033600&v=beta&t=w-Hh_tfeKg8KOPSA6AHYXlcEcUm84UVSnDoP8KaF7L0","description":"<p style=\"min-height:1.5em\"><strong>Wait a minute. </strong></p><p style=\"min-height:1.5em\"></p><h3><em>Deep inside you are looking for a new adventure with 🗽Freedom, 🔥Ambition and 😍Impact</em></h3><p style=\"min-height:1.5em\"><em>Are you driven to create and execute impactful social media strategies for a company poised to influence millions worldwide?</em></p><p style=\"min-height:1.5em\"><em>Do you have the ambition to manage and grow international communities across platforms, turning followers into engaged advocates?</em></p><p style=\"min-height:1.5em\"><em>Do you thrive on crafting innovative campaigns, scaling social media presence, and shaping trends ?</em></p><p style=\"min-height:1.5em\"><em>Do you want to channel your creativity and passion for excellence into building a brand that inspires, empowers, and truly changes lives?</em></p><p style=\"min-height:1.5em\"><em>Are you inspired in being a key player in building a massive EdTech company that will empower millions of people?</em></p><p style=\"min-height:1.5em\"></p><p style=\"min-height:1.5em\"><strong>That’s great because we want to inspire people and empower them to be the better version of themselves. By people, we mean millions of people and internationally. </strong>🚀</p><p style=\"min-height:1.5em\"></p><p style=\"min-height:1.5em\"><strong>Deep inside you are looking for a new adventure with… </strong></p><ul style=\"min-height:1.5em\"><li><p style=\"min-height:1.5em\"><strong>🗽 Freedom: feeling free to work remotely or hybrid and being trusted to deliver</strong></p></li><li><p style=\"min-height:1.5em\">🔥 <strong>Ambition:</strong> growing up surrounded by smart colleagues driven to create an iconic brand like Nike, Apple or Disney</p></li><li><p style=\"min-height:1.5em\">😍 <strong>Impact:</strong> contributing to transform people lives at scale and feel your own impact in the company</p><p style=\"min-height:1.5em\"></p></li></ul><p style=\"min-height:1.5em\"> <strong>And you deserve it because:</strong></p><ul style=\"min-height:1.5em\"><li><p style=\"min-height:1.5em\"><strong>A strategic pirate, </strong>you imagine and develop innovative concepts that align with business goals and drive notoriety, engagement, and conversions.</p></li></ul><p style=\"min-height:1.5em\"></p><ul style=\"min-height:1.5em\"><li><p style=\"min-height:1.5em\"><strong>A creative storyteller, passionate by human psychology, with excellent writing, editing, and interpersonal skills, and is able to create and curate engaging content that reflects the brand's personality and messaging.</strong></p></li></ul><p style=\"min-height:1.5em\"></p><ul style=\"min-height:1.5em\"><li><p style=\"min-height:1.5em\"><strong>A strong leader,</strong> able to lead a top performing team of social media specialists, provide guidance and support, and foster a positive and collaborative team culture. You are able to attract new talents to reach new, ambitious, social media goals. </p></li></ul><p style=\"min-height:1.5em\"></p><ul style=\"min-height:1.5em\"><li><p style=\"min-height:1.5em\"><strong>An algorithm freak</strong>, obsessed with influence, storytelling, and with an appetite for design. <strong>Deep understanding of each platform's subtleties and continuous updates </strong>almost before Adam Mosseri does.</p></li></ul><p style=\"min-height:1.5em\"></p><ul style=\"min-height:1.5em\"><li><p style=\"min-height:1.5em\"><strong>Data-driven hacker</strong>: At ease with numbers, and able to create dashboards to follow KPIs </p></li></ul><p style=\"min-height:1.5em\"></p><p style=\"min-height:1.5em\">You are <strong>La Crème de la Crème</strong> of the SMMs eager to build the world’s largest community of ambitious people. You want to <strong>reach new heights,</strong> engage with millions of followers, and drive impactful results. You have a <strong>drive to succeed.</strong></p><p style=\"min-height:1.5em\">You also happen to want to use your experience as an awesome SMM to contribute to impacting the lives of thousands of people? Then, you have found the next adventure that will fulfill you !</p><p style=\"min-height:1.5em\"></p><p style=\"min-height:1.5em\"><strong>This is a full-time position, carried out from our beautiful offices in Dubaï, Lisbon or from the comfort of your couch! French and English fluency is required.</strong></p><p style=\"min-height:1.5em\"></p><h2>YOUR MISSION 🚀 </h2><p style=\"min-height:1.5em\">-------------------------------</p><p style=\"min-height:1.5em\"><strong>🎯 </strong>Reporting to the VP Marketing, you’ll be in charge of building a badass social media team, planning the social media strategy, creating innovative concepts and developing David Laroche’s and Paradox’s social media presence. </p><p style=\"min-height:1.5em\"></p><p style=\"min-height:1.5em\">Our sources of inspiration are Apple, Nike, Disney for their obsession of excelling and having a worldwide impact. You will be playing a pivotal role in making Paradox play at that level and becoming an iconic brand.</p><p style=\"min-height:1.5em\"></p><p style=\"min-height:1.5em\">To do so, here are your 6 responsibilities : </p><p style=\"min-height:1.5em\"></p><h3>1 |  Win two YouTube distinct battles: David Laroche &amp; Paradox</h3><ul style=\"min-height:1.5em\"><li><p style=\"min-height:1.5em\">Leverage your in-depth knowledge of YouTube to create and deliver groundbreaking content ideas.</p></li><li><p style=\"min-height:1.5em\">Direct and empower partnerships with agencies and video editors to ensure all video productions are high-quality and aligned with our brand vision.</p></li><li><p style=\"min-height:1.5em\">Own and drive the editorial calendar with precision and creativity, ensuring consistent and impactful publication.</p></li><li><p style=\"min-height:1.5em\">Innovate and deliver scroll-stopping thumbnails that elevate engagement (strong design skills required).</p></li><li><p style=\"min-height:1.5em\">Craft impactful shorts using basic editing skills (Premiere Pro) or AI tools, delivering captivating content at scale.</p></li><li><p style=\"min-height:1.5em\">Recruit a passionate writer and researcher to craft compelling scripts for documentaries and innovative video formats.</p></li></ul><p style=\"min-height:1.5em\"></p><h3>2 | Create hype on David Laroche’s Instagram account and develop Paradox’s Instagram</h3><ul style=\"min-height:1.5em\"><li><p style=\"min-height:1.5em\">Deliver outstanding content by owning the creation process entirely and autonomous</p></li><li><p style=\"min-height:1.5em\">Curate and repurpose key video content into innovative formats (Carousels, posts, infographics…) </p></li><li><p style=\"min-height:1.5em\">Craft a forward-thinking editorial calendar aligned with overarching marketing strategies</p></li><li><p style=\"min-height:1.5em\">Implement a robust iteration &amp; testing protocols to crack the next viral content format</p></li><li><p style=\"min-height:1.5em\">Foster meaningful connections with subscribers and partners through impactful, empathetic, and brand-aligned communication (comments &amp; private messages)</p><p style=\"min-height:1.5em\"></p></li></ul><h3>3 | Elevate our community engagement to unprecedented levels </h3><ul style=\"min-height:1.5em\"><li><p style=\"min-height:1.5em\">Design and implement forward-thinking content strategies, taking into account the various growth factors (audience peak, formats naturally boosted by the algorithm and so on).</p></li><li><p style=\"min-height:1.5em\">Play with new trends and keep up to date with the news to adapt our content and be as much as possible in resonance with our audience and its current issues or envies.</p></li></ul><p style=\"min-height:1.5em\"></p><h3>4 | Systemize excellence</h3><ul style=\"min-height:1.5em\"><li><p style=\"min-height:1.5em\">Delve into analytics to extract actionable insights from KPIs, report weekly and monthly on your successes and failures, systemize what works in the form of processes</p></li><li><p style=\"min-height:1.5em\">Relentlessly seek and test high-performing content formats. Once found, you systemize them to use them at scale while still keep breaking their patterns regularly to surprise our audience. Test new videos headlines, thumbnails, post captions and many other factors to improve engagement and reach</p></li><li><p style=\"min-height:1.5em\">Craft a seamless process for optimizing and redistributing top content regularly and across different platforms</p></li><li><p style=\"min-height:1.5em\">Keep a pulse on industry shifts, competitor actions, and new avenues for audience engagement.</p><p style=\"min-height:1.5em\"></p></li></ul><h3>5 I Be the first point of contact and our first ambassador</h3><ul style=\"min-height:1.5em\"><li><p style=\"min-height:1.5em\">Lead the development of a robust online community through impactful engagement, collaboration, and relationship-building.</p></li><li><p style=\"min-height:1.5em\">Manage and resolve customer concerns through social media with efficiency and care.</p><p style=\"min-height:1.5em\"></p></li></ul><h3> 6 I Attract, find &amp; Hire Great Talents &amp; Lead them to excellence </h3><ul style=\"min-height:1.5em\"><li><p style=\"min-height:1.5em\">Source yourself talent in your own network and be proactive to create a machine to attract talent - at Paradox, hiring in the hands of the Heads more than the HR.</p></li><li><p style=\"min-height:1.5em\">Inspire and empower a team of social media specialists through strategic guidance, skill development, and resource allocation.</p></li><li><p style=\"min-height:1.5em\">Set ambitious yet achievable targets, guide improvement with feedback, and maintain team accountability for meeting and exceeding results.</p></li><li><p style=\"min-height:1.5em\">Champion a culture of positivity, synergy, and impact, where creative ideas and collaboration flourish.</p></li><li><p style=\"min-height:1.5em\">Continuously optimize team structure, operations, and resources to adapt to shifting business priorities.</p></li></ul><p style=\"min-height:1.5em\"></p><h2>DO YOU RECOGNIZE YOURSELF? 😍</h2><h3>-------------------------------</h3><ul style=\"min-height:1.5em\"><li><p style=\"min-height:1.5em\">Bachelor's or Master’s degree in marketing, communications, or a related field.</p></li><li><p style=\"min-height:1.5em\">5+ years of experience in social media management, with a proven track record of success in a similar role.</p></li><li><p style=\"min-height:1.5em\">Strong understanding of social media platforms, trends, and best practices.</p></li><li><p style=\"min-height:1.5em\">Excellent writing, editing, and interpersonal skills.</p></li><li><p style=\"min-height:1.5em\">Ability to work effectively in a fast-paced, deadline-driven environment.</p></li></ul><p style=\"min-height:1.5em\"></p><h3><strong>Must Have</strong></h3><p style=\"min-height:1.5em\"></p><ul style=\"min-height:1.5em\"><li><p style=\"min-height:1.5em\"><em>Strategic thinking: </em>You have the ability to create and execute a comprehensive social media strategy that aligns with Paradox’s business goals and drives engagement, traffic, and conversions.</p></li></ul><p style=\"min-height:1.5em\"></p><ul style=\"min-height:1.5em\"><li><p style=\"min-height:1.5em\"><em>Excellent interpersonal skills: </em>As a skilled Senior Social Media Manager, you must have excellent writing, editing, and interpersonal skills to engage with followers and build strong relationships with key stakeholders.</p></li></ul><p style=\"min-height:1.5em\"></p><ul style=\"min-height:1.5em\"><li><p style=\"min-height:1.5em\"><em>Results-oriented approach:</em> You’re results-oriented, able to track performance, measure the effectiveness of social media efforts, and continuously evaluate and optimize your approach to achieve optimal return on investment.</p></li></ul><p style=\"min-height:1.5em\"></p><ul style=\"min-height:1.5em\"><li><p style=\"min-height:1.5em\"><em>Creative storytelling: </em>you have a passion for storytelling and the ability to create and curate engaging content that reflects our brand's personality and messaging.</p></li></ul><p style=\"min-height:1.5em\"></p><ul style=\"min-height:1.5em\"><li><p style=\"min-height:1.5em\"><em>Team leadership:</em><strong> </strong>You have experience leading a team of social media specialists, providing guidance and support, and fostering a positive and collaborative team culture. You must be able to effectively manage resources and delegate tasks to ensure team success.</p></li></ul><p style=\"min-height:1.5em\"></p><p style=\"min-height:1.5em\"><strong>TECH STACK:</strong></p><ul style=\"min-height:1.5em\"><li><p style=\"min-height:1.5em\">Hootsuite, Sprout Social, Buffer, or other similar platforms <em>to manage and schedule posts, track performance, and engage with followers across multiple social media channels.</em></p></li><li><p style=\"min-height:1.5em\">Google Analytics, SEMrush, Hootsuite Insights, or other similar tools <em>to track social media performance, website traffic, and conversions.</em></p></li><li><p style=\"min-height:1.5em\">Hubspot, Salesforce, Zoho CRM, or other similar platforms to manage and track customer interactions, automate marketing and sales processes, and drive growth.</p></li><li><p style=\"min-height:1.5em\">Brand24, Mention, Synthesio, or other similar tools to <em>monitor brand mentions, track sentiment, and respond to customer inquiries and complaints.</em></p></li><li><p style=\"min-height:1.5em\">ManyChat, Tars, MobileMonkey, or other similar tools <em>to automate customer service and engagement processes, and improve customer experience.</em></p></li><li><p style=\"min-height:1.5em\">Marketo, Pardot, Hubspot, or other similar platforms <em>to automate repetitive marketing tasks, personalize communication, and increase lead generation and conversion rates.</em></p></li><li><p style=\"min-height:1.5em\">Asana, Trello, Slack, or other similar tools <em>to manage project workflows, collaborate with teams, and streamline communication and file sharing.</em></p></li></ul><p style=\"min-height:1.5em\"></p><h3><strong>Personality</strong></h3><ul style=\"min-height:1.5em\"><li><p style=\"min-height:1.5em\"><em>Drive &amp; Problem Solver:</em> You’re ambitious, You work hard because you love it, you own things and get them done </p></li><li><p style=\"min-height:1.5em\"><em>Analytical Mind: </em>you challenge your assumptions, able to quickly identify and formulate problems, and support your analysis with data</p></li><li><p style=\"min-height:1.5em\"><em>Growth over Ego:</em> You are eager to learn, and receive hard feedback to grow. You let others speak and seek to understand their viewpoints.</p></li><li><p style=\"min-height:1.5em\"><em>Team Player: </em>you love to work as a team, share and win together. ( Victory and Failure are “We” words )</p></li><li><p style=\"min-height:1.5em\">Strong Desire to <em>create Wow</em></p></li></ul><p style=\"min-height:1.5em\"></p><h3><strong>Language</strong></h3><p style=\"min-height:1.5em\">French:native</p><p style=\"min-height:1.5em\">English: fluent</p><h3><em>Currently, 10% of the team is English-speaking, a % which will continue to grow.</em></h3><p style=\"min-height:1.5em\"></p><p style=\"min-height:1.5em\"><strong>REAL NICE TO HAVE : </strong></p><ul style=\"min-height:1.5em\"><li><p style=\"min-height:1.5em\">You love the field of coaching, personal development and/or business.</p></li></ul><p style=\"min-height:1.5em\"></p><h2>IT MIGHT NOT BE FOR YOU 🙅‍♀️</h2><h3>-------------------------------</h3><p style=\"min-height:1.5em\">Let’s be clear, we are looking for someone who is not just Great, and for whom Paradox ambition isn’t just another cool project; but a true mission.</p><p style=\"min-height:1.5em\"></p><p style=\"min-height:1.5em\">So if those <strong>personal interests :</strong> personal development / coaching / professional growth / education / edtech / teaching / edutainment<strong> are not things you REALLY love, let’s forget it!</strong></p><p style=\"min-height:1.5em\"></p><p style=\"min-height:1.5em\">Let’s forget about it also if,</p><ul style=\"min-height:1.5em\"><li><p style=\"min-height:1.5em\">You <strong>don’t like to be challenged</strong> and grow in your job</p></li><li><p style=\"min-height:1.5em\">You don't like <strong>receiving or giving tough feedbacks</strong></p></li><li><p style=\"min-height:1.5em\">You <strong>don’t question the status quo: </strong>the process are there for a reason, we have always done it this way</p></li><li><p style=\"min-height:1.5em\">You <strong>like to have very specific &amp; fixed tasks</strong> assigned to you. Be told what to do and how to do it.</p></li><li><p style=\"min-height:1.5em\"><strong>Your only driver is joining a full-remote company</strong>: yes, our company culture is cool, but we want people to care about our mission, products, and their job!</p></li></ul><p style=\"min-height:1.5em\"></p><h2>🤩 JOIN US IF YOU CRAVE</h2><h3>-------------------------------</h3><p style=\"min-height:1.5em\"></p><h3><em><strong>Growth &amp; Ambition 🚀</strong></em></h3><p style=\"min-height:1.5em\"><em><strong><br /></strong></em>🏅 We hire only the best, it’s exhilarating to be <strong>surrounded by A-players who strive to perform</strong> <strong>whilst being in a good mood. You'll be working with some of the best minds. We understand that \"A\" people attract \"A\" people.</strong></p><p style=\"min-height:1.5em\">🏋️‍♀️ No more bosses, but ongoing conversations to support your professional development.</p><p style=\"min-height:1.5em\">⚡️ Being part of an ambitious company with a lot of growth opportunities</p><p style=\"min-height:1.5em\"></p><p style=\"min-height:1.5em\"><em><strong>Impact &amp; Meaning </strong></em><strong>🔥</strong></p><p style=\"min-height:1.5em\">🦄 <strong>Playing a crucial role in the development of a company</strong> whose content and products are enjoyed by millions of people<br /><strong>🤩 Waking up in the morning knowing you are making a difference:</strong> <em>we receive messages every day from clients who have successfully lost weight, quit smoking, reach a mile stone in their business, built better relationships, and made positive changes in their lives.<br /><br /><strong>But that’s not all, we believe that driven people deserve…</strong></em></p><p style=\"min-height:1.5em\"></p><p style=\"min-height:1.5em\"><em><strong>Freedom &amp; Well Being 🗽☀️</strong></em></p><p style=\"min-height:1.5em\">😎 <strong>A company culture based on autonomy &amp; accountability<br /></strong>🗽 <strong>Flexible working hours<br /></strong>🌎 <strong>A remote culture from day one with the freedom to work from wherever you want<br /></strong>🏤 <strong>Magnificent offices in Dubai and Lisbon:</strong> you’re at home worldwide<br /><strong>⌨️ Standing desks</strong> paid by the company, if you live far from our offices<br />💻 <strong>Macbook:</strong> <em>to be the most efficient in your work<br /></em>🏀 <strong>350€ per year paid by the company to take care of yourself</strong> <em>(for your gym, or dance class or whatever make you feel great)<br /></em>📚 <strong>150€ per year paid by the company to boost your knowledge</strong> (books, education): we are passionate about learning and want to support your growth)<br />🤝 <strong>1:1 coachings</strong>: a Paradox coach supporting you personally or professionally to live your best life<br />✈️ <strong>Team buildings</strong></p><p style=\"min-height:1.5em\"><em>* those benefits are only for full-time employees</em></p><p style=\"min-height:1.5em\"></p><h2>HIRING PROCESS 📃</h2><h3>-------------------------------</h3><p style=\"min-height:1.5em\"></p><p style=\"min-height:1.5em\">That job description resonated with you?</p><h3><strong>Here is your tailor made hiring process</strong></h3><p style=\"min-height:1.5em\"><strong>📃 A 6 to 8 minutes application survey (with a short video assignment) </strong></p><p style=\"min-height:1.5em\"><strong>📃 A 15/20 minutes what’s app call </strong>with <strong>Chloé</strong>, our Talent Manager, to tell you more about the challenge and see if it fits with your experience and expectations,</p><p style=\"min-height:1.5em\">💻 <strong>A video call</strong> with <strong>Chloé</strong> to do a deep dive into your career path and your ambition,</p><p style=\"min-height:1.5em\">💻 <strong>A video call</strong> with <strong>Quentin, the Hiring Manager</strong> to dive deeper into your technical skills, see how we can match your desires with our needs and for you both to understand how you could fit in Paradox’s social media team.</p><p style=\"min-height:1.5em\">💻<strong> A culture-fit video call </strong>with <strong>Timy</strong> - our culture coach - to check in depth the alignment between you and our values and culture</p><p style=\"min-height:1.5em\">💻A Take home<strong> Case Study, </strong>so we can learn more about your vision and understand if we can write the success story together.</p><p style=\"min-height:1.5em\">💼 <strong>Reference check</strong> to get in-depth insights about how you work in different environments, make your onboarding easier, and give everybody on the team the insurance to be surrounded by A-Players.</p><p style=\"min-height:1.5em\"><strong>🫵🚀</strong> <strong>Welcome aboard!</strong></p><p style=\"min-height:1.5em\"></p><h3><strong>About our hiring process</strong></h3><p style=\"min-height:1.5em\">Our recruitment process is tailored to do our best to avoid that you or us realize that we’re not a perfect fit. Every step serves a purpose and will allow us to get to know you better as much as it’ll help you understand more where you’ll be stepping in.</p><p style=\"min-height:1.5em\">We also want you to have time to ask all of your questions regarding the mission, the long-term vision of your team and the company, our values, with the relevant interlocutor in front of you.</p><p style=\"min-height:1.5em\"></p><h2>But maybe YOU WONDER WHAT’S OUR STORY ? 😉</h2><p style=\"min-height:1.5em\">-------------------------------</p><p style=\"min-height:1.5em\">At Paradox, we are convinced that people do not want “just a job” anymore.</p><p style=\"min-height:1.5em\">We are all craving to have an impact through our professional journey. Some want to start their own venture, some want to become an intrapreneur in their current organization, some others just want their day-to-day tasks to have more meaning.</p><p style=\"min-height:1.5em\"><strong>🎯 PARADOX HAS ONE GOAL: TO EMPOWER PEOPLE AND ORGANIZATIONS TO LIVE THEIR TRUE AMBITIONS.</strong></p><p style=\"min-height:1.5em\">But where do we start?</p><p style=\"min-height:1.5em\">If you have an interest in personal development, you probably already know that:</p><ul style=\"min-height:1.5em\"><li><p style=\"min-height:1.5em\">Making things happen is a real struggle when you don’t know what truly inspires you and how to get there ;</p></li><li><p style=\"min-height:1.5em\">Available resources are either boring 😴 or full of crazy unsubstantiated theories 🤪.</p></li></ul><p style=\"min-height:1.5em\">It needs to change, and we’re here to make it happen!</p><p style=\"min-height:1.5em\"><strong>⭐️ OUR AMBITION IS TO MAKE SUCCESS THE ONLY POSSIBLE OUTCOME FOR OUR CLIENTS (WHATEVER SUCCESS MEANS FOR THEM), BY CRAFTING INNOVATIVE &amp; CAPTIVATING BREAKTHROUGH EXPERIENCES.</strong></p><p style=\"min-height:1.5em\">In other words, we want to make personal growth <strong>as entertaining as watching Netflix.</strong></p><p style=\"min-height:1.5em\">How, you might be wondering?</p><ul style=\"min-height:1.5em\"><li><p style=\"min-height:1.5em\">We travel the world and surround ourselves with <strong>top entrepreneurs</strong> <em>(Richard Branson - Founder of Virgin, Marc Simoncini - Founder of Meeting, Fred Mazzella - Founder of BlablaCar)</em>, <strong>world</strong> <strong>athletes</strong> <em>(Tony Parker - Hall of fame NBA Player, Frederick Bousquet - World record in 50m free swimming, Frank Leboeuf - WorldCup Footballer)</em>, and <strong>artists</strong> <em>(Gad Elmaleh - Comedian, Franck Dubosc, Barry Osborne - Producer of Lord of the Rings and Matrix)</em> ✊;</p></li><li><p style=\"min-height:1.5em\">We reverse engineer their <strong>strategies for achieving success</strong> and fulfillment and lean on the <strong>latest researches</strong> about neurosciences ⚙️;</p></li><li><p style=\"min-height:1.5em\">We deliver trainings &amp; educational contents around Power Skills (critical thinking, productivity, leadership, public speaking, coaching, stress management, etc.), <strong>self-growth and performance</strong>, through a balanced set of <strong>e-learning programs, events and edutainment videos</strong> 💡.</p></li></ul><p style=\"min-height:1.5em\">From one well-known<a target=\"_blank\" rel=\"noopener noreferrer nofollow\" href=\"https://www.linkedin.com/in/davidlarochefr/\"> <u>Founder</u></a> to a team of +40 people today (and counting!), this approach has paid off and enabled us to exceed 2 million followers on social networks, and to have thousands of people attending our online events and training courses.</p><p style=\"min-height:1.5em\"></p><p style=\"min-height:1.5em\"><strong>🔥 TOGETHER, WE ARE DRIVEN BY ONE DREAM:</strong></p><ol style=\"min-height:1.5em\"><li><p style=\"min-height:1.5em\">Helping 100 000 people achieve their dream and display their pictures on what we call the “100 000 dreams wall” ;</p></li><li><p style=\"min-height:1.5em\">Giving our clients access to constant personal growth by reinventing their learning experience ;</p></li><li><p style=\"min-height:1.5em\">Leverage AI and other technology to provide an outstanding customized experience to millions of people for them to transform their lives. </p></li></ol><p style=\"min-height:1.5em\"></p><p style=\"min-height:1.5em\"><strong>And that’s where you come in. Join the Paradox Revolution !</strong></p>","tags":"[\"management\"]","pubDate":"2025-01-03T11:41:30.441Z","link":"https://jobs.ashbyhq.com/paradox/37371f7b-c1c9-4e79-9a42-d220c5564580","slug":"social-media-manager-french-fluent-paradox-1932"},{"id":1069064188,"title":"Fractional CFO","company":"Escalon Services","image":"https://remotive.com/job/1959799/logo","description":"<div><!--block--><strong> </strong></div><div><!--block--><strong>What does it mean to be a Fractional CFO within the Escalon team? </strong></div><div><!--block-->As a fractional CFO you could spend a few hours a month up to full time availably applying your technical and account management skill set across a variety of clients and industries.</div><div><!--block--> </div><div><!--block--><strong>Are you an Industry Expert – Let us know!</strong></div><div><!--block-->Our client serving teams offer industry focused verticals that span over; SaaS, Media &amp; Entertainment, Consumer Packaged Goods, Life Sciences, Non-Profit and Private Equity specialties.</div><div><!--block--> </div><div><!--block--><strong> </strong></div><div><!--block--><strong>What You’ll Do:  </strong></div><div><!--block--> </div><div><!--block-->The primary objective of the Fractional CFO is to oversee enterprise accounting and provide financial information about client company’s activities that will assist the client and its shareholders in making economic company decisions. This position is proactive and solution oriented, offering depth of experience to our clients in the fast-paced world of start-up accounting.  </div><div><!--block--> </div><div><!--block-->This position will afford you a high degree of flexibility, the ability to focus on CFO-level work (with a US and global team who will handle the bookkeeping and transactional accounting), an opportunity to work with exciting companies, and a support network of experienced financial professionals.</div><div><!--block--> </div><div><!--block-->We are looking for stellar CFOs who have the experience, skills and desire to support a diverse and intriguing mix of businesses while building and managing strong client relationships.  If you are ready to work with cutting-edge startup companies, founders, investors and stakeholders focused on results, this opportunity is designed for you. </div><div><!--block--> </div><div><!--block--><strong>Day-to-Day Responsibilities also include: </strong></div><ul style=\"\"><li style=\"\"><!--block-->Provide insightful and trusted counsel to business leadership and the senior management team on both financial and broad-based business issues related to the overall performance of the company.</li><li style=\"\"><!--block-->Serve as a key member of the executive team in providing input regarding the financial implications of all major business decisions, as well as strategic input in shaping the company’s business objectives.</li><li style=\"\"><!--block-->Direct the work of an offshore team in all financial reporting including the provision of comprehensive monthly financial statements, and the development of forecasts and budgets.</li><li style=\"\"><!--block-->Enable aligned direction and value creation through effective short and long-range budgeting and forecasting</li><li style=\"\"><!--block-->Lead the treasury function including optimizing cash flow, providing guidance on debt facilities and supporting fundraising activity.</li><li style=\"\"><!--block-->Identify opportunities for improvement, cost reduction, and systems enhancement.</li><li style=\"\"><!--block-->Manage external relationships with auditors and tax preparers and oversee risk management, including insurance</li><li style=\"\"><!--block-->Oversee Corporate Governance and internal controls.</li><li style=\"\"><!--block-->Provide support on mergers and acquisitions and due diligence processes.</li><li style=\"\"><!--block-->Create and nurture partnerships across functional roles within our organization including our OneShore team located in India</li></ul><br><br><div class=\"h3\">What You'll Bring</div><div><!--block--><br></div><div><!--block--><strong>Must Haves: </strong></div><ul style=\"\"><li style=\"\"><!--block-->10+ years in a financial role with at least 3+ years as a CFO</li><li style=\"\"><!--block-->Experience working with Venture- and Private Equity-backed companies</li><li style=\"\"><!--block-->Strong understanding of equity and debt financing</li><li style=\"\"><!--block-->Proven track record in successfully supporting growth using strong analytical skills and effective financial modeling</li><li style=\"\"><!--block-->Experience leading financial budgeting and financial planning process</li><li style=\"\"><!--block-->Ability to develop, improve, oversee and review corporate accounting functions</li><li style=\"\"><!--block-->Solid understanding of financial compliance requirements and experience implementing and managing financial policies</li><li style=\"\"><!--block-->Above average knowledge and understanding of GAAP</li><li style=\"\"><!--block-->High level of energy and ability to thrive in fast-paced, dynamic business environments</li><li style=\"\"><!--block-->Significant experience working with external auditors, internal controls, systems implementation and compliance. </li><li style=\"\"><!--block-->Successful at executing on business development, networking, and sales activities to build client base</li><li style=\"\"><!--block-->Above average communication and presentation skills</li><li style=\"\"><!--block-->Exceptional Leadership and team management skills, preferably globally focused leveraging an offshore team</li></ul><div><!--block--> </div><div><!--block--><strong>Nice to Haves: </strong></div><ul style=\"\"><li style=\"\"><!--block-->CPA and/or Master’s Degree preferred</li></ul><br><br><div class=\"h3\">More about us: </div><div><!--block-->Escalon Services is a Business Process Management (BPM) company that provides Essential Business Services (EBS) through a tech-enabled platform to small- and medium-sized businesses (SMBs) and startups. The Company enables its clients to spend less time on \"back office\" functions and provides the value and insight that enables clients to spend more time focusing on delivering value and moving their businesses forward. With a US-based remote workforce and global delivery team in India, Escalon’s solution fills a widening service gap in the SMB market, underpinned by (i) increasing demand for quality insights in an increasingly competitive marketplace (ii) decreasing supply of CPAs and quality in-house talent and (iii) the cost frictions associated with scaling internal back-office teams as businesses grow. For more information on Escalon: <a href=\"https://escalon.services/\" rel=\"nofollow\">https://escalon.services/</a>  </div><div><!--block-->Since founding, the company has executed both on an organic and M&amp;A strategy to expand service offerings and drive revenue expansion opportunity through cross-sell/up-sell. Before partnering with New Harbor Capital in late 2022, Escalon completed two significant acquisitions which tripled the revenue of the company and expanded the FinOps capabilities of the platform. Continued corporate development is a key value driver for the business going forward, with a highly fragmented market of service providers, often individually unable to scale due to lack of technology-enablement and offshore capabilities. </div><div><!--block-->In late 2022, New Harbor Capital made a growth equity investment in Escalon Services. <br> </div><div><!--block-->About New Harbor Capital </div><div><!--block-->New Harbor Capital is an experienced, lower middle-market private equity firm that seeks to partner with growth-minded, founder-owned companies. Based out of Chicago, New Harbor Capital is committed to optimizing the growth potential of its portfolio companies while respecting their long-term visions. The firm was founded on the belief that mutual respect and collaboration lead to successful outcomes. New Harbor recognizes the importance of finding the right partner, and the firm is committed to helping its portfolio companies and their leadership maximize both personal and financial goals.  <br> </div><div><!--block-->As a strategic partner, New Harbor taps into decades of experience to guide businesses through challenging economic cycles and market conditions. New Harbor Capital has raised over $750M in capital across three funds and focuses on tech-enabled services, healthcare, and education services.  </div><div><!--block--> </div><img src=\"https://remotive.com/job/track/1959799/blank.gif?source=public_api\" alt=\"\"/>","tags":"[\"accounting\",\"saas\",\"healthcare\",\"business development\",\"bookkeeping\",\"account management\",\"partnerships\",\"team management\",\"SOLID\",\"startup\",\"risk management\",\"GAAP\",\"marketplace\",\"fundraising\",\"CPA\",\"treasury\",\"insurance\"]","pubDate":"2025-01-03T03:50:33.000Z","link":"https://remotive.com/remote-jobs/finance-legal/fractional-cfo-1959799","slug":"fractional-cfo-escalon-services-4406"},{"id":9596240433,"title":"Product Manager","company":"Blum","image":"https://remotive.com/job/1959876/logo","description":"<div><strong>Blum</strong> is a cutting-edge hybrid exchange tailored for Telegram and mobile platforms. Our team is passionate about technology and dedicated to pushing the boundaries of what's possible in the trading world. We are revolutionizing the way trading is done, providing seamless and secure services to both individual users and businesses. By leveraging the power of Telegram, we offer a unique and accessible approach to trading, catering to a global audience.</div>\n<div> </div>\n<div>Launched in April, <strong>Blum</strong> has gathered over 80 million users and has become one of the top 3 most popular apps on Telegram worldwide. Our experienced team brings years of expertise from leading crypto projects, including Binance, Trust Wallet, <a href=\"http://Crypto.com\" rel=\"nofollow\">Crypto.com</a>, Bitget, and more.</div>\n<div> </div>\n<div>We are seeking a talented <strong>Product Manager</strong> to join our innovative team and contribute to our mission.</div>\n<p><br><br></p>\n<div class=\"h3\">Responsibilities</div>\n<ul style=\"\">\n<li style=\"\"><strong>Product Strategy Development: </strong>Develop and refine product strategy aligned with user needs and industry trends within the cryptocurrency sector.</li>\n<li style=\"\"><strong>Market Research and Analysis:</strong> Conduct market research, competitor analysis, and customer insights to inform product improvements and introduce new features.</li>\n<li style=\"\"><strong>Feature Planning and Prioritization: </strong>Manage the product roadmap, set priorities for development, and assign tasks for the design and engineering teams.</li>\n<li style=\"\"><strong>User Engagement and UX Enhancement: </strong>Conduct user interviews, gather feedback, and work to continuously improve the user experience</li>\n<li style=\"\"><strong>Feature Launch and Management:</strong> Coordinate feature launches, including planning, testing, performance analysis, and strategy adjustment based on results.</li>\n<li style=\"\"><strong>Cross-functional Collaboration:</strong> Work closely with development and marketing teams to ensure coordinated efforts and meet deadlines.</li>\n<li style=\"\"><strong>Product Analytics and Optimization: </strong>Monitor key metrics (user growth, engagement, retention), create product dashboards, and optimize the product based on data to achieve business goals.</li>\n<li style=\"\"><strong>Post-Release Analysis and Feature Effectiveness</strong>: Сonduct post-release analysis based on metrics, and evaluate the effectiveness of launched features to inform future improvements.</li>\n</ul>\n<p><br><br></p>\n<div class=\"h3\">Requirements</div>\n<ul style=\"\">\n<li style=\"\"><strong>DeFi Product Management Experience:</strong> Demonstrated experience in product management within the DeFi industry, with a strong understanding of its unique dynamics.</li>\n<li style=\"\"><strong>Degen Enthusiast</strong>: Passionate about crypto, deeply engaged in space, and familiar with trends and terminology within the community.</li>\n<li style=\"\"><strong>Autonomous and Proactive:</strong> Able to work independently, take initiative, and drive projects forward without extensive guidance.</li>\n<li style=\"\"><strong>Advanced Problem-Solving Skills:</strong> Skilled at identifying priorities and addressing challenges in a proactive and efficient manner.</li>\n<li style=\"\"><strong>Process Improvement Focus: </strong>Committed to refining processes and paying attention to details to enhance workflow and productivity.</li>\n<li style=\"\"><strong>Strong Sense of Ownership: </strong>High level of accountability with a proven track record of effective, results-oriented performance.</li>\n</ul>\n<p><br><br></p>\n<div class=\"h3\">With Blum you will</div>\n<ul style=\"\">\n<li style=\"\">Join one of the largest projects within Telegram and make an impact in the blockchain ecosystem</li>\n<li style=\"\">Work with a talented and diverse team in a dynamic environment that encourages continuous learning and professional development</li>\n<li style=\"\">Enjoy flexible working hours, unlimited vacation days and a remote-first approach</li>\n<li style=\"\">Receive compensation for: equipment, education, sports and coworking</li>\n<li style=\"\">Have opportunities for professional growth in high-load systems and web3 technology</li>\n<li style=\"\">Take on challenging and complex tasks that push the boundaries of your expertise</li>\n<li style=\"\">Get competitive monthly salary, based on experience and skills</li>\n</ul>\n<div><strong>Ready to join us? Send your CV and become part of our exciting journey!</strong></div>\n<img src=\"https://remotive.com/job/track/1959876/blank.gif?source=public_api\" alt=\"\"/>","tags":"[\"market research\"]","pubDate":"2025-01-03T03:50:23.000Z","link":"https://remotive.com/remote-jobs/product/product-manager-1959876","slug":"product-manager-blum-5793"},{"id":1924045527,"title":"Copywriter","company":"Coalition Technologies ","image":"https://remotive.com/job/1749306/logo","description":"<p class=\"h3\"></p><div class=\"h3\">WHO WE'RE LOOKING FOR</div><div class=\"h3\">The ideal copywriter has excellent English writing skills and is excited to write high-quality, SEO-driven content that aligns with detailed, client-specific guidelines. Projects most commonly include writing web pages for eCommerce and lead generation business sites such as category pages, product descriptions, and blog posts. Our clientele is constantly evolving. We produce content for these and many other industry verticals:</div><div class=\"h3\"><br></div><div class=\"h3\">Fashion (both mass-market and luxury)</div><div class=\"h3\">Skincare &amp; Beauty</div><div class=\"h3\">Tech &amp; Software**</div><div class=\"h3\">Finance &amp; Investing**</div><div class=\"h3\">Law (family law, product liability, divorce, etc.)**</div><div class=\"h3\">Education</div><div class=\"h3\">Home Improvement</div><div class=\"h3\">Automobiles &amp; Motorcycles (OEM and aftermarket accessories)</div><div class=\"h3\">Health and Wellness**</div><div class=\"h3\">Medical / Clinical**</div><div class=\"h3\">Digital Marketing</div><div class=\"h3\">SEO / PR / Advertising / Marketing**</div><div class=\"h3\">**Writers with a background in these highly specialized fields are strongly encouraged to apply.</div><div class=\"h3\">The ideal candidate for this position is a multifaceted technical and creative writer with at least two to four years of professional, non-academic experience. Candidates should understand how to write content that effortlessly blends SEO best practices and brand priorities for finished work that’s engaging, creative, and ROI-driven. Candidates should also be willing and able to complete careful research in order to gain a strong understanding of various industries. Candidates should be prepared to provide portfolios featuring published work. Once an offer has been extended, writers will be asked to take a brief training course.</div><div class=\"h3\"><br></div><div class=\"h3\">Compensation</div><div class=\"h3\">Writers are paid on a per-word basis. The rate is assessed according to our KPI rubric (key performance indicators) with an automatic raise after 400 and 800 pages have gone live on our client's websites.</div><div class=\"h3\">Initial compensation is up to $0.06 per word with $0.034 per word being the most typical compensation level. This is $30 or $17 per page of 500 words.</div><div class=\"h3\">After 400 pages live, the top marginal rate increases to $0.064 per word with the most typical rate of $0.038 per word, or $32 and $19 per page. After 800 pages live, the top marginal rate increases to $0.07 per word with $0.044 per word being the most typical, or $35 and $22 per page.</div>\n<img src=\"https://remotive.com/job/track/1749306/blank.gif?source=public_api\" alt=\"\"/>","tags":"[\"accounting\",\"excel\",\"research\",\"data analysis\",\"bookkeeping\",\"google sheets\",\"quickbooks\",\"data entry\",\"insurance\",\"G Suite\"]","pubDate":"2025-01-02T19:01:13.000Z","link":"https://remotive.com/remote-jobs/writing/copywriter-1749306","slug":"copywriter-coalition-technologies-5566"}]