[{"id":4988354745,"title":"Customer Success Manager, Circle Plus","company":"Circle","image":"https://circle.so/apple-icon.png","description":"&lt;div class=&quot;content-intro&quot;&gt;&lt;h2&gt;About Us&lt;/h2&gt;\n&lt;p&gt;Circle is building the world’s leading all-in-one platform for online communities. We make it possible for creators, coaches, educators, and businesses to bring together their audience with engaging discussions, live streams, events, chat, courses, and payments — all in one place, all under their own brand.&lt;/p&gt;\n&lt;p&gt;We’re proud to be a fully remote company of around 180 (and growing!) team members from 30+ countries around the world. We seek exceptional individuals around the world, set them up to do the best work of their lives, and in turn, create a meaningful impact in their own lives. We don&#39;t track hours, but we do manage for high expectations very closely. We collaborate across time zones, are highly async, and like to document a lot.&lt;/p&gt;\n&lt;p&gt;Twice a year, we bring the whole company together in beautiful places around the world for our company offsites. So far, we’ve hosted offsites in Turkey, Portugal, Mexico, Thailand, Colombia, Italy, Ireland, and more, with still more to come!&lt;/p&gt;&lt;/div&gt;&lt;h2&gt;About the role&lt;/h2&gt;\n&lt;p&gt;&lt;/p&gt;\n&lt;p&gt;We have over 12k paying communities powered by Circle, and that number is growing significantly month-over-month. Our Circle Plus customer base in particular is growing incredibly fast and our highest tier plan. This plan gives our customers the capability to offer a fully branded mobile app offering to their customers alongside a white-labeled community experience. Alongside the more advanced product functionality, these customers unlock a higher service tier which gives us an opportunity to partner together more closely on their journey with Circle.&lt;/p&gt;\n&lt;p&gt;As a Customer Success Manager, you&#39;ll be helping not only serve as a main point of contact for our Circle Plus customers, but will also have the opportunity to help us define the CS function, test &amp;amp; build new processes and work with us to design a team that delivers value consistently. Note, our Circle Plus customers are those that are subscribed to a Circle Plus plan, but can include small and medium-sized businesses, as well at truly enterprise scale.&lt;/p&gt;\n&lt;p&gt;You’ll support customers in effectively rolling out Circle, ensure they’ve adopted all relevant functionality, and are continuously gaining value from our products. You’ll work to proactively identify opportunities to solve needs for our customers, and will partner closely with internal teams to engage 1:1 with customers during key moments in their lifecycle. As their primary point of contact and trusted partner, you’ll have responsibility of serving them through their entire lifecycle from onboarding through their renewal. Equipped with the knowledge of what it takes for customers to succeed with Circle, you will serve as the voice of your customers cross-functionally, providing feedback to the Product team and broader business.&lt;/p&gt;\n&lt;p&gt;We have a strong preference for candidates based between the approximate time zones of Eastern time (UTC-5) and Central European time (UTC+1) to best align with our customers.&lt;/p&gt;\n&lt;p&gt;&lt;/p&gt;\n&lt;h2&gt;What you&#39;ll be doing&lt;/h2&gt;\n&lt;p&gt;&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;You’ll be passionate about building relationships, helping our customers succeed in building an engaging community, and establishing yourself as a trusted advisor along their journey. Over the course of your first year you’ll ramp in to serving 75-100+ customers&lt;/li&gt;\n&lt;li&gt;You will be responsible for onboarding 6-10 new customers per month, which typically entails delivering strategy and implementation guidance over a series of 6 or so meetings in their first 90 days as a customer. Following their successful launch you’ll move to monthly strategy sessions&lt;/li&gt;\n&lt;li&gt;Developing strong relationships with both new and existing customers to understand their goals, and consult on the best ways to achieve them using Circle to drive product adoption, revenue growth and retention across your book of customers&lt;/li&gt;\n&lt;li&gt;Analyzing customer usage across your book of business to identify risks and opportunities, create accurate forecasts, then take ownership of designing and executing engagement campaigns to action in support of them&lt;/li&gt;\n&lt;li&gt;Communicating thoughtfully with your clients and internal stakeholders to ensure prompt answers that can be understood by both technical and non-technical recipients&lt;/li&gt;\n&lt;li&gt;Maintaining a deep understanding of the Circle platform, our branded app capabilities, and online community building strategies to make recommendations on how customers can accelerate their desired outcomes&lt;/li&gt;\n&lt;li&gt;Partnering closely with other internal stakeholders to share customer stories &amp;amp; experiences that help build deeper understanding of customers goals, use cases and outcomes&lt;/li&gt;\n&lt;li&gt;Acting as an internal advocate for customers by consistently contributing feedback to product &amp;amp; engineering on areas for improvement to enhance the customers experience&lt;/li&gt;\n&lt;li&gt;Contributing to the ongoing improvement of our customer success processes and methodologies&lt;/li&gt;\n&lt;li&gt;Working with customers through their renewal and re-consideration windows to help them understand how Circle can support their business strategy and future planning&lt;/li&gt;\n&lt;/ul&gt;\n&lt;h2&gt;What you&#39;ll need to be successful&lt;/h2&gt;\n&lt;ul&gt;\n&lt;li&gt;Strong alignment with our values, &lt;a href=&quot;https://circle.so/careers&quot;&gt;find our values on our career page&lt;/a&gt; if you haven’t read up on them yet&lt;/li&gt;\n&lt;li&gt;You are proficient in English (spoken, written, and reading) at a &lt;a href=&quot;https://magoosh.com/english-speaking/english-proficiency-levels-a-guide-to-determining-your-level/&quot;&gt;CEFR Level C2&lt;/a&gt; / &lt;a href=&quot;https://www.govtilr.org/&quot;&gt;ILR Level 5&lt;/a&gt;&lt;/li&gt;\n&lt;li&gt;You either have 4+ years working directly with creators or a company in a community management role, or you have 4+ years of experience in SaaS customer success working with SMB customers to drive product adoptions, expansion, and retention&lt;/li&gt;\n&lt;li&gt;You have experience serving customers and navigating the complexity of tight timelines, complex processes and managing relationships with multiple stakeholders both internally and externally&lt;/li&gt;\n&lt;li&gt;You are comfortable learning and understanding business models across various industries/segments. You will often be driving the conversation to help your customers define what success means for their community&lt;/li&gt;\n&lt;li&gt;You have a growth mindset and are willing to share and receive feedback in a constructive, respectful and empathetic manner. We care deeply about getting better as individuals and as a team every day&lt;/li&gt;\n&lt;li&gt;You&#39;re driven &amp;amp; process-oriented. You’re able to effectively balance competing priorities and make decisions that best support the customer, the team, and Circle&lt;/li&gt;\n&lt;li&gt;You’re able and comfortable with needing to efficiently switch contexts from responding to customer emails, to leading a product training, to running a quarterly community review, to meeting with the Product team about an upcoming feature&lt;/li&gt;\n&lt;li&gt;You are a team player with a high level of integrity and desire to assist your team. When you find processes that work, you will document them through playbooks, teach others and champion wider adoption&lt;/li&gt;\n&lt;li&gt;You have an aptitude for digesting and effectively communicating technical concepts across audiences of varying technical ability&lt;/li&gt;\n&lt;li&gt;You’re resourceful. You may not have all the answers, but you know how to find them&lt;/li&gt;\n&lt;li&gt;You&#39;re a self-motivated, proactive team player. You bias towards action and work effectively in a highly ambiguous, ever-changing environment. You’re able to hone in on granular details and also take a step back to understand the larger strategy and philosophy of how and why decisions are made&lt;/li&gt;\n&lt;li&gt;You have experience leveraging product usage data in your approach to engaging, expanding, and prioritizing your accounts&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;&lt;/p&gt;\n&lt;h2&gt;Bonus points&lt;/h2&gt;\n&lt;p&gt;&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;Familiarity and proficiency with HubSpot, Zapier, Notion, Canva, Google Suite.&lt;/li&gt;\n&lt;li&gt;Have experience serving and working with successful Creators&lt;/li&gt;\n&lt;li&gt;Are familiar with the Circle Product&lt;/li&gt;\n&lt;/ul&gt;\n&lt;h2&gt;&lt;/h2&gt;\n&lt;h2&gt;$110,000 - $120,000 USD per year OTE (base + variable)&lt;/h2&gt;\n&lt;p&gt;&lt;em&gt;The cash compensation range shown is a starting point. In addition to equity, benefits and perks, your cash compensation is subject to an annual review and increase on a once per year basis.&lt;/em&gt;&lt;/p&gt;\n&lt;p&gt;&amp;nbsp;&lt;/p&gt;&lt;div class=&quot;content-conclusion&quot;&gt;&lt;h2&gt;The fun stuff&lt;/h2&gt;\n&lt;ul&gt;\n&lt;li&gt;Fully remote:&amp;nbsp;work from anywhere in the world!&lt;/li&gt;\n&lt;li&gt;Autonomy and trust to do your job:&amp;nbsp;we care about outcomes over everything else.&lt;/li&gt;\n&lt;li&gt;Paid time away:&amp;nbsp;all employees are given 35 days of PTO annually. We also offer a paid sabbatical after 5 years.&lt;/li&gt;\n&lt;li&gt;Generous U.S. benchmarked compensation&amp;nbsp;and startup equity no matter where you are in the world.*&lt;/li&gt;\n&lt;li&gt;Awesome medical coverage&amp;nbsp;with 100% coverage for you and your family, or medical reimbursement options where applicable!*&lt;/li&gt;\n&lt;li&gt;Parental leave&amp;nbsp;for parents expanding their family, or just starting one.&lt;/li&gt;\n&lt;li&gt;Home office stipend&amp;nbsp;to help you get up and running.&lt;/li&gt;\n&lt;li&gt;Learning &amp;amp; development stipend&amp;nbsp;to help you level up your professional skills.&lt;/li&gt;\n&lt;li&gt;Annual bonus potential&amp;nbsp;for roles that don&#39;t already receive variable income or commission.&lt;/li&gt;\n&lt;li&gt;Company retreats:&amp;nbsp;Twice a year, the Circle team gets together for a fully paid company retreat in incredible places around the world! We’ve had past retreats in Colombia, Portugal, and Mexico, with more planned on the horizon.&lt;/li&gt;\n&lt;li&gt;Check out our&amp;nbsp;&lt;a href=&quot;https://careers.circle.so/&quot;&gt;Careers&lt;/a&gt;&amp;nbsp;page for more.&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;&lt;span style=&quot;font-size: 10pt;&quot;&gt;*&lt;em&gt;Your role, location and unique circumstance may affect this.&lt;/em&gt;&lt;/span&gt;&lt;/p&gt;\n&lt;h3&gt;Diversity, Equity &amp;amp; Inclusion&lt;/h3&gt;\n&lt;p&gt;As a fully-remote international company, diversity is baked into our DNA. Here’s how our CEO, Sid Yadav, frames our hiring mission: “let’s find talent in underserved and under-represented corners of the world, set them up to do the best work of their lives, and in turn, change their life.” To achieve this hiring mission, we offer competitive&amp;nbsp;U.S. benchmarked&amp;nbsp;compensation no matter where someone’s located in the world, and we proactively seek candidates who expand representation of backgrounds, cultures and lived experiences in our teams.&lt;/p&gt;\n&lt;h3&gt;Equal Employment Opportunity&lt;/h3&gt;\n&lt;p&gt;Circle is an equal opportunity employer and as such, we do not discriminate on the basis of race, color, religion, sex, sexual orientation, gender identity, national origin, age, disability, or any other characteristic protected by applicable laws.&amp;nbsp;If you require any accommodations during the recruitment process, please let us know and we will work with you to meet your needs.&lt;/p&gt;\n&lt;div class=&quot;&quot;&gt;\n&lt;h3 class=&quot;&quot;&gt;How We Use Candidate Data&lt;/h3&gt;\n&lt;p&gt;At Circle, we are committed to protecting your personal information. As a job applicant, the personal data you provide to us is collected and processed in accordance with the&amp;nbsp;&lt;strong&gt;General Data Protection Regulation (GDPR)&lt;/strong&gt; in the EU and the &lt;strong&gt;California Consumer Privacy Act (CCPA)&lt;/strong&gt;. This notice outlines the types of personal information we collect, the purpose for collecting it, and your rights.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Information We Collect:&lt;/strong&gt; We collect the following categories of personal information from job applicants:&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;Contact information (such as name, email address, phone number)&lt;/li&gt;\n&lt;li&gt;Employment history and qualifications&lt;/li&gt;\n&lt;li&gt;Education history&lt;/li&gt;\n&lt;li&gt;References and any other information you choose to share with us during the application process&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;&lt;strong&gt;Purpose of Collection:&lt;/strong&gt; We collect this information for the following purposes:&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;To assess your qualifications and suitability for the position&lt;/li&gt;\n&lt;li&gt;To communicate with you during the recruitment process&lt;/li&gt;\n&lt;li&gt;To comply with legal and regulatory obligations&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;&lt;strong&gt;Your Rights Under GDPR and CCPA:&lt;/strong&gt; You have the following rights regarding your personal information:&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;The right to request access to the personal information we hold about you.&lt;/li&gt;\n&lt;li&gt;The right to request the deletion of your personal information, subject to certain legal exceptions.&lt;/li&gt;\n&lt;li&gt;The right to opt out of the sale of your personal information (Note: We do not sell personal information).&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;For more information about how we handle your personal data or to exercise your rights, please refer to our full &lt;a href=&quot;https://circle.so/privacy&quot; target=&quot;_blank&quot;&gt;Privacy Policy&lt;/a&gt;.&lt;/p&gt;\n&lt;p&gt;By submitting your application, you acknowledge that you have read and understood this privacy notice.&lt;/p&gt;\n&lt;/div&gt;&lt;/div&gt;","tags":"[\"management\",\"engineering\",\"legal\",\"aws\"]","pubDate":"2025-05-15T02:14:45.000Z","link":"https://job-boards.greenhouse.io/circleso/jobs/4685579008","slug":"customer-success-manager-circle-plus-circle-5773"},{"id":8131724325,"title":"UX UI Designer/Visual Designer","company":"Clearer","image":"https://avatars.githubusercontent.com/u/100294047?s=200&v=4","description":"<div><b style=\"font-size: 16px;\">About Us: </b><span style=\"font-size: 16px;\">Take the Clearer route to smart career growth. At </span><a rel=\"noopener noreferrer\" class=\"postings-link\" href=\"http://Clearer.io\"><span style=\"font-size: 16px;\">Clearer.io</span></a><span style=\"font-size: 16px;\">, we’re reimagining eCommerce by enhancing search, discovery, and customer engagement through a standout suite of innovative apps. Our mission is straightforward yet powerful: to empower our partners with solutions that streamline their operations, foster customer trust, and drive sustainable growth. We’re not just about technology—we’re about making eCommerce smarter, simpler, and more impactful, delivering solutions that inspire confidence and create real results.</span></div><div><span style=\"font-size: 16px;\">With fresh investment and rapid growth, this is the perfect time to join our journey. When you become part of </span><a rel=\"noopener noreferrer\" class=\"postings-link\" href=\"http://Clearer.io\"><span style=\"font-size: 16px;\">Clearer.io</span></a><span style=\"font-size: 16px;\">, you step into a role where your work truly matters. Here, you’ll have the opportunity to own your projects, drive outcomes, and make an impact within a supportive, diverse team of professionals dedicated to customer success. We value clarity, results, and a customer-centric approach that keeps us focused on delivering real value to our partners every step of the way.</span></div><div><span style=\"font-size: 16px;\">If you’re ready to cut through the clutter and focus on what really matters in a dynamic eCommerce landscape, </span><a rel=\"noopener noreferrer\" class=\"postings-link\" href=\"http://Clearer.io\"><span style=\"font-size: 16px;\">Clearer.io</span></a><span style=\"font-size: 16px;\"> is the place to grow, lead, and shape the future of online retail. Join us, and be part of a team that’s committed to making eCommerce clearer, more efficient, and more rewarding for everyone.</span></div><div><br></div><div><b style=\"font-size: 16px;\">Your impact: </b><a rel=\"noopener noreferrer\" class=\"postings-link\" href=\"http://Clearer.io\"><span style=\"font-size: 16px;\">Clearer.io</span></a><span style=\"font-size: 16px;\"> is seeking a talented UX UI Designer/Visual Designer with extensive experience in UX/UI to join our Product Design team.</span></div><div><span style=\"font-size: 16px;\">As a UX UI Designer/Visual Designer, you will play a pivotal role in shaping exceptional user experiences across our digital products. This role requires a blend of creativity, collaboration, and technical expertise to design and refine user interfaces that are both intuitive and visually appealing. You will work closely with cross-functional teams to deliver impactful designs that drive user satisfaction and business success.</span></div><div><b style=\"font-size: 16px;\">About Us: </b><span style=\"font-size: 16px;\">Take the Clearer route to smart career growth. At </span><a href=\"http://Clearer.io\" class=\"postings-link\" target=\"_blank\" rel=\"noopener noreferrer\"><span style=\"font-size: 16px;\">Clearer.io</span></a><span style=\"font-size: 16px;\">, we’re reimagining eCommerce by enhancing search, discovery, and customer engagement through a standout suite of innovative apps. Our mission is straightforward yet powerful: to empower our partners with solutions that streamline their operations, foster customer trust, and drive sustainable growth. We’re not just about technology—we’re about making eCommerce smarter, simpler, and more impactful, delivering solutions that inspire confidence and create real results.</span></div><div><span style=\"font-size: 16px;\">With fresh investment and rapid growth, this is the perfect time to join our journey. When you become part of </span><a href=\"http://Clearer.io\" class=\"postings-link\" target=\"_blank\" rel=\"noopener noreferrer\"><span style=\"font-size: 16px;\">Clearer.io</span></a><span style=\"font-size: 16px;\">, you step into a role where your work truly matters. Here, you’ll have the opportunity to own your projects, drive outcomes, and make an impact within a supportive, diverse team of professionals dedicated to customer success. We value clarity, results, and a customer-centric approach that keeps us focused on delivering real value to our partners every step of the way.</span></div><div><span style=\"font-size: 16px;\">If you’re ready to cut through the clutter and focus on what really matters in a dynamic eCommerce landscape, </span><a href=\"http://Clearer.io\" class=\"postings-link\" target=\"_blank\" rel=\"noopener noreferrer\"><span style=\"font-size: 16px;\">Clearer.io</span></a><span style=\"font-size: 16px;\"> is the place to grow, lead, and shape the future of online retail. Join us, and be part of a team that’s committed to making eCommerce clearer, more efficient, and more rewarding for everyone.</span></div><div><br></div><div><b style=\"font-size: 16px;\">Your impact: </b><a href=\"http://Clearer.io\" class=\"postings-link\" target=\"_blank\" rel=\"noopener noreferrer\"><span style=\"font-size: 16px;\">Clearer.io</span></a><span style=\"font-size: 16px;\"> is seeking a talented UX UI Designer/Visual Designer with extensive experience in UX/UI to join our Product Design team.</span></div><div><span style=\"font-size: 16px;\">As a UX UI Designer/Visual Designer, you will play a pivotal role in shaping exceptional user experiences across our digital products. This role requires a blend of creativity, collaboration, and technical expertise to design and refine user interfaces that are both intuitive and visually appealing. You will work closely with cross-functional teams to deliver impactful designs that drive user satisfaction and business success.</span></div><h3>What you’ll do:</h3><li>Craft user interfaces for our products with a strong emphasis on delivering seamless and engaging user experiences while adhering to established design systems.</li><li>Create, maintain, and enhance design system components to ensure consistency and scalability across all products.</li><li>Design graphic illustrations, icons, and AI-generated images that align with our product’s style and the overall design system.</li><li>Develop high-quality mockups and prototypes to communicate user flows, interactions, and proof of concepts effectively.</li><li>Partner with Product Managers and engineering teams throughout the development cycle to ensure design requirements are clearly defined and implemented.&nbsp;&nbsp;</li><li>Research and develop tailored design systems based on product requirements, whether for e-commerce websites, B2B applications, or other scopes.</li><li>Identify and troubleshoot UX/UI challenges, implementing user-centered solutions that elevate the design.</li><li>Stay updated on the latest design trends and propose innovative ideas to enhance our applications and marketing websites.</li><li>Deepen your understanding of our products and technologies to create simplified, highly usable, and impactful product experiences.</li><li>Leverage customer feedback and analytics data to refine and optimize the performance of new and existing features.</li><li>Demonstrate the flexibility to work effectively with global teams across different time zones and cultures.</li><li>Thrive in both independent projects and collaborative team environments, ensuring the highest quality of work.</li><h3>What you’ll bring:</h3><li>At least 1+ years of professional experience in UI Design.</li><li>A portfolio showcasing excellence in interaction design, visual design.</li><li>Proficiency in Figma, including advanced features like Components, Auto Layout, and Responsive Design.</li><li>Strong expertise in the Adobe Creative Suite for graphic and UI asset creation.</li><li>Strong English skills—both written and spoken—to effectively communicate and collaborate with global, cross-functional teams.</li><li>Bachelor’s or Master’s degree in Design, with a focus on UI, or related arts fields.</li><li>Good time management skills.</li><li>A meticulous eye for detail, ensuring high-quality designs.</li><li>Demonstrated experience designing for SaaS/PaaS products.</li><li>Hands-on experience building and applying design systems to ensure consistency and scalability across products.</li><li>Deep understanding of user-centered design principles, best practices, and inclusive design.</li><li>Familiarity with accessibility standards and a strong desire to continue learning in this area.</li><li>Proven ability to manage multiple projects simultaneously while maintaining focus and delivering results.</li><h3>Why choose Clearer.io?</h3><li><b>Customers at the heart</b>: We make our customers the stars of our show and help them thrive. When they grow, so do we. We obsess over their needs so we can dream big on their behalf.</li><li><b>Purposeful progress:</b> We harness our ingenuity to keep leveling up and growing stronger. We take initiative, think boldly, and don’t settle for the status quo. Every risk teaches us something new.</li><li><b>Endless innovation: </b>We take action, refine our work, and drive meaningful growth for each other and our customers. Humble in our pursuit, we continuously seek to improve. We ask ‘How can we help?’ striving always to make a meaningful.</li><li><b>Always open:</b> With transparency we simplify the complex, collaborate globally and empower everyone. We believe openness in our communication - with customers, partners, and team members - is essential for building strong relationships.</li><div><br></div><div><b>Clear Benefits:&nbsp;</b></div><li>100% Remote Culture: Work from anywhere that brings you happiness.</li><li>Performance-based Year-End Bonus: Recognizing and rewarding your individual contributions.</li><li>Wellness Allowance: Support for classes promoting physical and mental health.</li><li>Time Off: 20 days/year, in addition to Vietnam holidays.</li><li>MacBook Provided.</li><li>Collaborative Events: Offline meet-ups, monthly gatherings, year-end party, and company trips.</li><li>Continuous Learning: Technical and general workshops, online resources.</li><li>Health and Wellness Benefits: Generali Health Care, annual check-up.</li><li>International Exposure: Enhance expertise and English communication skills.</li><div><br></div><div><b>Be a part of </b><a rel=\"noopener noreferrer\" class=\"postings-link\" href=\"http://Clearer.io\"><b>Clearer.io</b></a>—where your expertise fuels real change in eCommerce. Come and join us- it’s clear we’re the place to be!</div>","tags":"[\"management\",\"engineering\",\"b2b\"]","pubDate":"2025-05-15T01:28:45.533Z","link":"https://jobs.lever.co/Clearer/811f56e8-2541-489e-a9fe-e738f66d2085","slug":"ux-ui-designer-visual-designer-clearer-1500"},{"id":5436298114,"title":"Senior Typescript Engineer","company":"Fingerprint","image":"https://avatars.githubusercontent.com/u/67208791?s=200&v=4","description":"&lt;div class=&quot;content-intro&quot;&gt;&lt;p&gt;&lt;strong&gt;Fingerprint&lt;/strong&gt;&amp;nbsp;empowers developers to stop online fraud at the source.&lt;/p&gt;\n&lt;p&gt;We work on turning radical new ideas in the fraud detection space into reality. Our products are developer-focused and our clients range from solo developers to publicly traded companies.&amp;nbsp;&lt;strong&gt;We are a globally dispersed, 100% remote company&lt;/strong&gt; with a strong open-source focus. Our flagship open-source project is &lt;a class=&quot;c-link c-link--focus-visible&quot; href=&quot;https://github.com/fingerprintjs/fingerprintjs&quot; target=&quot;_blank&quot; data-stringify-link=&quot;https://github.com/fingerprintjs/fingerprintjs&quot; data-sk=&quot;tooltip_parent&quot;&gt;FingerprintJS&lt;/a&gt; (20K stars on GitHub).&lt;/p&gt;\n&lt;p&gt;&lt;a class=&quot;c-link c-link--focus-visible&quot; href=&quot;https://www.crunchbase.com/organization/fingerprintjs&quot; target=&quot;_blank&quot; data-stringify-link=&quot;https://www.crunchbase.com/organization/fingerprintjs&quot; data-sk=&quot;tooltip_parent&quot;&gt;We have raised $77M&amp;nbsp;&lt;/a&gt;and are backed by Craft Ventures (previously invested in&amp;nbsp;&lt;a class=&quot;c-link c-link--focus-visible&quot; href=&quot;https://www.tesla.com/&quot; target=&quot;_blank&quot; data-stringify-link=&quot;https://www.tesla.com/&quot; data-sk=&quot;tooltip_parent&quot;&gt;Tesla,&amp;nbsp;&lt;/a&gt;&lt;a class=&quot;c-link c-link--focus-visible&quot; href=&quot;https://facebook.com/&quot; target=&quot;_blank&quot; data-stringify-link=&quot;https://facebook.com/&quot; data-sk=&quot;tooltip_parent&quot;&gt;Facebook,&amp;nbsp;&lt;/a&gt;&lt;a class=&quot;c-link c-link--focus-visible&quot; href=&quot;https://www.airbnb.com/&quot; target=&quot;_blank&quot; data-stringify-link=&quot;https://www.airbnb.com/&quot; data-sk=&quot;tooltip_parent&quot;&gt;Airbnb&amp;nbsp;&lt;/a&gt;), Nexus Venture Partners (previously invested in &lt;a href=&quot;https://www.postman.com/&quot;&gt;Postman&lt;/a&gt;, &lt;a href=&quot;https://www.apollo.io/&quot;&gt;Apollo.io,&lt;/a&gt; &lt;a href=&quot;https://min.io/&quot;&gt;MinIO&lt;/a&gt;, Druva)&amp;nbsp;and Uncorrelated Ventures (previously invested in&amp;nbsp;&lt;a class=&quot;c-link c-link--focus-visible&quot; href=&quot;https://redis.io/&quot; target=&quot;_blank&quot; data-stringify-link=&quot;https://redis.io/&quot; data-sk=&quot;tooltip_parent&quot;&gt;Redis,&amp;nbsp;&lt;/a&gt;&lt;a class=&quot;c-link c-link--focus-visible&quot; href=&quot;https://rollbar.com/&quot; target=&quot;_blank&quot; data-stringify-link=&quot;https://rollbar.com/&quot; data-sk=&quot;tooltip_parent&quot;&gt;Rollbar&amp;nbsp;&lt;/a&gt;&amp;amp;&lt;a class=&quot;c-link c-link--focus-visible&quot; href=&quot;https://gradle.org/&quot; target=&quot;_blank&quot; data-stringify-link=&quot;https://gradle.org/&quot; data-sk=&quot;tooltip_parent&quot;&gt;&amp;nbsp;Gradle&lt;/a&gt;).&lt;/p&gt;\n&lt;p&gt;&lt;em&gt;We have noticed a rise in recruiting impersonations across the industry, where scammers attempt to access candidates&#39; personal and financial information through fake interviews and offers. All Fingerprint recruiting email communications will always come from the @fingerprint.com domain. Any outreach claiming to be from Fingerprint via other sources should be ignored.&lt;/em&gt;&lt;/p&gt;\n&lt;p&gt;&amp;nbsp;&lt;/p&gt;\n&lt;hr&gt;\n&lt;p&gt;&amp;nbsp;&lt;/p&gt;\n&lt;p&gt;&amp;nbsp;&lt;/p&gt;\n&lt;p&gt;&amp;nbsp;&lt;/p&gt;&lt;/div&gt;&lt;p&gt;We’re seeking a &lt;strong&gt;Senior TypeScript Engineer&lt;/strong&gt; to help lead the development of our browser-based technologies—including our JavaScript agent, Pro CDN, and other performance-critical components. In this role, you’ll build high-integrity, privacy-aware, and tamper-resistant code that runs across diverse browser environments and powers advanced device intelligence and security solutions.&lt;/p&gt;\n&lt;p&gt;This position is ideal for engineers who thrive in deeply technical environments and enjoy working close to the metal in the browser runtime.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;What You’ll Do&lt;/strong&gt;&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;Build and maintain our browser-side TypeScript/JavaScript agent used for device identification, bot detection, and risk assessment&lt;/li&gt;\n&lt;li&gt;Contribute to a widely-used open-source project with 24K+ GitHub stars and 25B+ monthly usages&lt;/li&gt;\n&lt;li&gt;Engineer for stealth, resilience, and performance—minimizing footprint, resisting detection, and maintaining compatibility across browsers&lt;/li&gt;\n&lt;li&gt;Optimize for both code size and execution speed in complex, adversarial environments&lt;/li&gt;\n&lt;li&gt;Stay ahead of browser changes, plugin behaviors, and fingerprinting techniques&lt;/li&gt;\n&lt;li&gt;Collaborate with backend, security, and data science teams to align signal capture with detection logic&lt;/li&gt;\n&lt;li&gt;Write comprehensive tests and contribute to CI pipelines that ensure functionality across a wide range of platforms and devices&lt;br&gt;&lt;br&gt;&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;&lt;strong&gt;What You Bring&lt;/strong&gt;&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;Expert-level JavaScript and TypeScript experience, especially in browser environments&lt;/li&gt;\n&lt;li&gt;Deep understanding of browser APIs, DOM behavior, timing attacks, and anti-debugging techniques&lt;/li&gt;\n&lt;li&gt;Proficiency with build tools like Webpack, and (or) Rollup, Esbuild, including code obfuscation and minification&lt;/li&gt;\n&lt;li&gt;Experience with modern testing frameworks such as Jasmine, Jest, or similar&lt;/li&gt;\n&lt;li&gt;Strong sense of ownership and autonomy—comfortable working in fast-paced environments without rigid specifications&lt;/li&gt;\n&lt;li&gt;Clear written and verbal communication skills in English&lt;/li&gt;\n&lt;li&gt;Familiarity with security principles, privacy best practices, and adversarial engineering&lt;/li&gt;\n&lt;li&gt;High level of personal ownership and autonomy, which requires experience working without clearly defined requirements&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;&lt;strong&gt;Nice to Have&lt;/strong&gt;&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;Contributions to open-source projects, especially in the JavaScript/TypeScript ecosystem&lt;/li&gt;\n&lt;li&gt;Experience with WebAssembly, browser extensions, or remote debugging&lt;/li&gt;\n&lt;li&gt;Familiarity with AWS services such as Lambda, CloudFront, and DynamoDB&lt;/li&gt;\n&lt;li&gt;Browser automation experience&lt;/li&gt;\n&lt;/ul&gt;&lt;div class=&quot;content-conclusion&quot;&gt;&lt;p&gt;&lt;em&gt;We have noticed a rise in recruiting impersonations across the industry, where scammers attempt to access candidates&#39; personal and financial information through fake interviews and offers. All Fingerprint recruiting email communications will always come from the @fingerprint.com domain. Any outreach claiming to be from Fingerprint via other sources should be ignored.&lt;/em&gt;&lt;/p&gt;\n&lt;p&gt;Offers vary depending on, but not limited to, relevant experience, education, certifications/licenses, skills, training, and market conditions.&amp;nbsp;&lt;/p&gt;\n&lt;p&gt;Due to regulatory and security reasons, there’s a small number of countries where we cannot have Fingerprint teammates based.&amp;nbsp;&lt;strong data-stringify-type=&quot;bold&quot;&gt;Additionally, because Fingerprint is an all-remote company and people can join our workforce from almost any country, we do not sponsor visas. Fingerprint teammates need to be authorized to work from their home location&lt;/strong&gt;.&lt;/p&gt;\n&lt;p&gt;We are dedicated to creating an inclusive work environment for everyone. We embrace and celebrate the unique experiences, perspectives and cultural backgrounds that each employee brings to our workplace. Fingerprint strives to foster an environment where our employees feel respected, valued and empowered, and our team members are at the forefront in helping us promote and sustain an inclusive workplace. We highly encourage people from underrepresented groups in tech to apply.&lt;/p&gt;\n&lt;p&gt;If you are applying as a resident of California, please read our CCPA notice &lt;a href=&quot;https://dev.fingerprint.com/docs/dpa-ccpa&quot; target=&quot;_blank&quot;&gt;here&lt;/a&gt;&lt;/p&gt;\n&lt;p&gt;If you are applying as a resident of the EU, please read our GDPR notice &lt;a href=&quot;https://dev.fingerprint.com/docs/dpa-gdpr&quot; target=&quot;_blank&quot;&gt;here&lt;/a&gt;&lt;/p&gt;&lt;/div&gt;","tags":"[\"javascript\",\"typescript\",\"engineering\",\"aws\"]","pubDate":"2025-05-14T16:19:56.000Z","link":"https://fingerprint.com/careers/jobs/apply/?gh_jid=5537076004","slug":"senior-typescript-engineer-fingerprint-2902"},{"id":3816638661,"title":"Software Engineer ","company":"Clutch","image":"https://avatars.githubusercontent.com/u/69215121?s=200&v=4","description":"<h1><strong>About the Role</strong></h1><ul style=\"min-height:1.5em\"><li><p style=\"min-height:1.5em\">Own small-to-medium integration projects from discovery to deployment, partnering with Product, clients, and Implementation to ship pragmatic solutions.</p></li><li><p style=\"min-height:1.5em\">Debug and resolve issues autonomously, escalating only when truly blocked.</p></li><li><p style=\"min-height:1.5em\">Communicate progress and blockers early and often—through tickets, stand-ups, and async updates—to give the team and stakeholders total visibility.</p></li><li><p style=\"min-height:1.5em\">Review peers’ pull requests, uphold our coding standards, and share knowledge to elevate overall code quality.</p></li><li><p style=\"min-height:1.5em\">Spot friction in day-to-day workflows and propose concrete process or tooling improvements that keep us moving fast.</p></li></ul><p style=\"min-height:1.5em\"></p><h1><strong>About the Team</strong></h1><ul style=\"min-height:1.5em\"><li><p style=\"min-height:1.5em\">A fast-moving Integration squad connecting banking COREs and LOSs to Clutch’s platform.</p></li><li><p style=\"min-height:1.5em\">Success hinges less on raw code complexity and more on understanding product context, making sound trade-offs, and coordinating with multiple parties.</p></li><li><p style=\"min-height:1.5em\">We collaborate closely with Product, clients, and other engineering teams to deliver production-ready integrations quickly.</p></li><li><p style=\"min-height:1.5em\">Transparency and balanced workload are core values: everyone is expected to surface blockers early and help redistribute work when needed.</p></li><li><p style=\"min-height:1.5em\">We champion autonomy—engineers are trusted to take initiative, switch contexts effectively, and push changes all the way to production.</p></li></ul><p style=\"min-height:1.5em\"></p><h1><strong>What You’ll Do</strong></h1><p style=\"min-height:1.5em\"></p><h2>Within 3 months, you will:</h2><ul style=\"min-height:1.5em\"><li><p style=\"min-height:1.5em\">Independently debug issues and identify root causes.</p></li><li><p style=\"min-height:1.5em\">Pair with other engineers to gain context and contribute to smaller tasks.</p></li><li><p style=\"min-height:1.5em\">Learn the core systems we integrate with and how they impact our product.</p></li><li><p style=\"min-height:1.5em\">Ask questions and challenge requirements to clarify the scope before starting work.</p></li></ul><h2>Within 6 months, you will:</h2><ul style=\"min-height:1.5em\"><li><p style=\"min-height:1.5em\">Proactively communicate progress and surface blockers early.</p></li><li><p style=\"min-height:1.5em\">Confidently shift between integration contexts and understand tradeoffs.</p></li><li><p style=\"min-height:1.5em\">Support partners through successful go-lives.</p></li><li><p style=\"min-height:1.5em\">Manage scope and push back when requirements are unclear or misaligned.</p></li><li><p style=\"min-height:1.5em\">Contribute thoughtful code reviews and help maintain simple and extensible code quality.</p></li></ul><h2>Within 9 months, you will:</h2><ul style=\"min-height:1.5em\"><li><p style=\"min-height:1.5em\">Lead and deliver a small-scoped project independently.</p></li><li><p style=\"min-height:1.5em\">Build trust with external stakeholders by communicating technical constraints effectively.</p></li><li><p style=\"min-height:1.5em\">Suggest and drive improvements to team processes and workflows.</p></li></ul><p style=\"min-height:1.5em\"></p><h1><strong>What You’ll Bring</strong></h1><ul style=\"min-height:1.5em\"><li><p style=\"min-height:1.5em\">Heavy product-oriented mindset;</p></li><li><p style=\"min-height:1.5em\">Capable of debugging and working on issues alone;</p></li><li><p style=\"min-height:1.5em\">Capable of collaborating with other teams to get the job done;</p></li><li><p style=\"min-height:1.5em\">Capable of owning end-to-end projects;</p></li><li><p style=\"min-height:1.5em\">Plus: Previously worked with Integrations</p></li></ul><p style=\"min-height:1.5em\"><em>Please note that this role may evolve as our business needs change, so we appreciate your flexibility and adaptability.</em></p><p style=\"min-height:1.5em\"><strong>What’s In It For You?</strong></p><ul style=\"min-height:1.5em\"><li><p style=\"min-height:1.5em\"><strong>Remote Flexibility:</strong> Enjoy the freedom of remote work from anywhere, balancing life and career seamlessly.</p></li><li><p style=\"min-height:1.5em\"><strong>Unforgettable Off-Sites:</strong> Twice a year, bond with colleagues in exciting destinations, fostering teamwork and fresh ideas.</p></li><li><p style=\"min-height:1.5em\"><strong>Paid Time Off and National Holidays:</strong> Enjoy 20 PTO days yearly and the National Holidays for relaxation and rejuvenation.</p></li><li><p style=\"min-height:1.5em\"><strong>Stock Options:</strong> Joining us means having a stake in our success, so you'll receive stock options as part of your compensation package.</p></li><li><p style=\"min-height:1.5em\"><strong>Home Office Setup:</strong> Create your ideal workspace with a dedicated budget for home office essentials.</p></li><li><p style=\"min-height:1.5em\"><strong>Work Trip Budget:</strong> Grow personally and professionally with a budget for work-related trips and co-working.</p></li></ul><p style=\"min-height:1.5em\"><strong>About Us</strong></p><p style=\"min-height:1.5em\"><strong>Clutch</strong> is a revolutionary vertical SaaS company, proudly backed by Andreessen Horowitz (A16z), aimed at revolutionizing the way Credit Unions engage and change the lives of their members. As a champion of financial well-being, we address the urgent need for affordable lending solutions in an era where the average American grapples with over $155,000 in household debt.  Unlike traditional financial institutions, Clutch develops software to turn Credit Unions into FinTech lenders and leverage their balance sheets to responsibly lend to over 130M Americans. Our mission extends beyond mere financial transactions; we strive to fundamentally enhance the way credit unions interact with their members. By integrating cutting-edge technologies and user-centric designs, we help credit unions provide seamless digital experiences that are on par with leading tech companies. This approach not only preserves but revitalizes the longstanding tradition of community and member-focused service inherent to credit unions.</p><p style=\"min-height:1.5em\"><strong>Please note:</strong> This position is offered on a contractor basis. Applicants must have the necessary documentation and authorization to work in the country where the job is located. Clutch cannot provide sponsorship or assist with obtaining work permits for this role.<br /><br /><strong>A Note About AI at Clutch</strong><br />We love AI. We use it often and encourage our team to creatively and effectively leverage AI tools in their work. If you join Clutch, we hope you'll bring the same enthusiasm for exploring how AI can amplify impact, productivity, and innovation.<br /><br />That said, during the interview process, <strong>we want to hear </strong><em><strong>your</strong></em><strong> thoughts</strong>. Please approach interviews without the use of AI tools—our goal is to get to know how <em>you</em> think, solve problems, and communicate. Once you're in the seat, bring on the prompts!</p>","tags":"[\"engineering\"]","pubDate":"2025-05-14T15:24:45.642Z","link":"https://jobs.ashbyhq.com/withclutch/a71a6e6b-eece-4b4a-87a9-3415f3bcecbe","slug":"software-engineer-clutch-5395"},{"id":6835590563,"title":"Enterprise BDR","company":"Sardine","image":"https://avatars.githubusercontent.com/u/65879301?s=200&v=4","description":"<p style=\"min-height:1.5em\"><strong>Who we are:</strong></p><p style=\"min-height:1.5em\">We are a leader in fraud prevention and AML compliance. Our platform uses device intelligence, behavior biometrics, machine learning, and AI to stop fraud before it happens. Today, over 300 banks, retailers, and fintechs worldwide use Sardine to stop identity fraud, payment fraud, account takeovers, and social engineering scams. We have raised $145M from world-class investors, including Andreessen Horowitz, Activant, Visa, Experian, FIS, and Google Ventures.</p><p style=\"min-height:1.5em\"></p><p style=\"min-height:1.5em\"><strong>Our culture:</strong></p><ul style=\"min-height:1.5em\"><li><p style=\"min-height:1.5em\">We have hubs in the Bay Area, NYC, Austin, and Toronto. However, we maintain a remote-first work culture. #WorkFromAnywhere</p></li><li><p style=\"min-height:1.5em\">We hire talented, self-motivated individuals with extreme ownership and high growth orientation. </p></li><li><p style=\"min-height:1.5em\">We value performance and not hours worked. We believe you shouldn't have to miss your family dinner, your kid's school play, friends get-together, or doctor's appointments for the sake of adhering to an arbitrary work schedule.</p></li></ul><p style=\"min-height:1.5em\"></p><p style=\"min-height:1.5em\"><strong>Location:</strong></p><ul style=\"min-height:1.5em\"><li><p style=\"min-height:1.5em\">Remote - United States or Canada</p></li><li><p style=\"min-height:1.5em\">From Home / Beach / Mountain / Cafe / Anywhere!</p></li><li><p style=\"min-height:1.5em\">We are a remote-first company with a globally distributed team. You can find your productive zone and work from there.</p><p style=\"min-height:1.5em\"></p></li></ul><p style=\"min-height:1.5em\"><strong>About the Role</strong></p><p style=\"min-height:1.5em\">We are seeking a highly motivated Enterprise Business Development Representative to focus on researching and strategizing target account lists. This role is crucial for expanding our presence in enterprise companies, specifically within the fintech, financial services, marketplaces, ecommerce, and high-risk verticals. The ideal candidate should possess an insatiable curiosity, a strong drive for success, and a collaborative spirit.</p><p style=\"min-height:1.5em\">This is not a traditional BDR role. It's a highly strategic position with a focus on quality, not quantity. We don't believe in imposing daily KPIs like most sales organizations where BDRs are cold calling and emailing people every day just to hit their numbers. Instead, we emphasize personalization and high-quality leads. This approach allows our Enterprise Business Development Representatives to make a significant impact on our growth in key verticals.</p><p style=\"min-height:1.5em\"></p><p style=\"min-height:1.5em\"><strong>What you’ll be doing:</strong></p><ul style=\"min-height:1.5em\"><li><p style=\"min-height:1.5em\">Develop and implement strategies for targeting enterprise account lists in specified verticals.</p></li><li><p style=\"min-height:1.5em\">Confidently overcome objections and guide prospects through the sales funnel.</p></li><li><p style=\"min-height:1.5em\">Support a sales team of 10 AEs for a smooth transition of outbound leads.</p></li><li><p style=\"min-height:1.5em\">Use CRM and sales automation tools to optimize prospecting, tracking, and account management.</p></li><li><p style=\"min-height:1.5em\">Identify key accounts and event attendees, proactively reaching out to schedule meetings for the team in advance.</p></li><li><p style=\"min-height:1.5em\">Partner with Sales Operations to streamline and optimize sales processes through automation.</p><p style=\"min-height:1.5em\"></p></li></ul><p style=\"min-height:1.5em\"><strong>What you’ll need :</strong></p><ul style=\"min-height:1.5em\"><li><p style=\"min-height:1.5em\">2+ years experience in an enterprise BDR role, preferably within the fraud, risk, or compliance space.</p></li><li><p style=\"min-height:1.5em\">In-depth knowledge of financial institutions and the FinTech landscape.</p></li><li><p style=\"min-height:1.5em\">Proficiency in outbound sales processes and sales tools (e.g., Salesforce, Apollo, Zoominfo and HubSpot).</p></li><li><p style=\"min-height:1.5em\">Ability to thrive in a fast-paced environment.</p></li><li><p style=\"min-height:1.5em\">Highly motivated and hungry for success.</p></li><li><p style=\"min-height:1.5em\">Creative problem-solver with the ability to find innovative ways to break into top accounts.</p></li><li><p style=\"min-height:1.5em\">Excellent time management, communication skills (both written and verbal), and interpersonal abilities.</p></li><li><p style=\"min-height:1.5em\">Process-oriented mindset with a track record in prospecting and scheduling meetings with potential clients.</p></li><li><p style=\"min-height:1.5em\">Willingness to travel (10-20%) for conferences and industry events.</p></li></ul><p style=\"min-height:1.5em\"></p><p style=\"min-height:1.5em\"><strong>Compensation: </strong>Base pay range of $60k - $75k + commission + equity with tremendous upside potential + Attractive benefits</p><p style=\"min-height:1.5em\"></p><p style=\"min-height:1.5em\">The compensation offered for this role will depend on various factors, including the candidate's location, qualifications, work history, and interview performance, and may differ from the stated range.</p><p style=\"min-height:1.5em\"></p><p style=\"min-height:1.5em\">The compensation offered for this role will depend on various factors, including the candidate's location, qualifications, work history, and interview performance, and may differ from the stated range.</p><p style=\"min-height:1.5em\"></p><p style=\"min-height:1.5em\"><strong>Benefits we offer:</strong></p><ul style=\"min-height:1.5em\"><li><p style=\"min-height:1.5em\">Generous compensation in cash and equity</p></li><li><p style=\"min-height:1.5em\">Early exercise for all options, including pre-vested</p></li><li><p style=\"min-height:1.5em\">Work from anywhere: Remote-first Culture</p></li><li><p style=\"min-height:1.5em\">Flexible paid time off, Year-end break, Self care days off</p></li><li><p style=\"min-height:1.5em\">Health insurance, dental, and vision coverage for employees and dependents - <em>US and Canada specific</em></p></li><li><p style=\"min-height:1.5em\">4% matching in 401k / RRSP - <em>US and Canada specific</em></p></li><li><p style=\"min-height:1.5em\">MacBook Pro delivered to your door</p></li><li><p style=\"min-height:1.5em\">One-time stipend to set up a home office — desk, chair, screen, etc.</p></li><li><p style=\"min-height:1.5em\">Monthly meal stipend</p></li><li><p style=\"min-height:1.5em\">Monthly social meet-up stipend</p></li><li><p style=\"min-height:1.5em\">Annual health and wellness stipend</p></li><li><p style=\"min-height:1.5em\">Annual Learning stipend</p></li><li><p style=\"min-height:1.5em\">Unlimited access to an expert financial advisory</p></li></ul><p style=\"min-height:1.5em\"></p><p style=\"min-height:1.5em\">Join a fast-growing company with world-class professionals from around the world. If you are seeking a meaningful career, you found the right place, and we would love to hear from you.</p><p style=\"min-height:1.5em\"></p><p style=\"min-height:1.5em\"><em>To learn more about how we process your personal information and your rights in regards to your personal information as an applicant and Sardine employee, please visit our </em><a target=\"_blank\" rel=\"noopener noreferrer nofollow\" class=\"text-link-blue\" href=\"https://www.sardine.ai/applicant-and-worker-privacy-notice\"><em>Applicant and Worker Privacy Notice</em></a><em>.</em></p>","tags":"[\"management\",\"engineering\"]","pubDate":"2025-05-14T12:18:00.375Z","link":"https://jobs.ashbyhq.com/sardine/d913dd28-070b-45c9-8ebf-20f0a2233ed6","slug":"enterprise-bdr-sardine-3300"},{"id":1743909968,"title":"Technical Product Marketing Manager - Linux Focus (REMOTE- Work Anywhere)","company":"CloudLinux","image":"https://avatars.githubusercontent.com/u/16290369?s=200&v=4","description":"<p>We are seeking a motivated and technically-minded Product Marketing Manager to join our growing team and focus on our core security solutions. As a Technical Product Marketing Manager, you will play a key role in shaping the go-to-market strategy, messaging, and positioning for TuxCare's flagship products: KernelCare Enterprise, Enterprise Support for AlmaLinux, and ELS for Distributions. You will leverage your Linux system administration experience to understand our customers' needs and effectively communicate the value of our offerings. You will report to and work closely with the senior marketing leadership to develop and execute marketing plans that drive awareness, demand, and adoption of TuxCare solutions.</p><p>TuxCare is a subsidiary of CloudLinux. It offers a portfolio of security solutions for Linux and open-source software aimed at enterprise organizations. With TuxCare, enterprises can automate live vulnerability patching, minimize downtime, keep their applications secure and compliant, and get support from a team that knows Linux security best, covering the most popular Linux distributions, end-of-life systems, programming languages, and much more.&nbsp;&nbsp;</p><p>For more information, visit our website:<a href=\"https://tuxcare.com/\" rel=\"nofollow noreferrer noopener\" class=\"external\"> https://tuxcare.com/</a></p><p></p><p><strong>As our Technical Product Marketing Manager, you will be responsible for:</strong></p><ul> <li>Developing compelling product positioning and messaging for KernelCare Enterprise, Enterprise Support for AlmaLinux, and ELS for Distributions, highlighting their unique value propositions.</li> <li>Creating a wide range of engaging marketing and sales enablement content, including writing blog posts, articles, website copy, datasheets, case studies, white papers, and scripts for presentations and videos.</li> <li>Developing and delivering engaging presentations and demonstrations for internal teams, webinars, and industry events.</li> <li>Conceptualizing, scripting, and assisting in producing YouTube videos and other video content for the company to explain product features, benefits, and use cases.</li> <li>Conducting market research to identify customer needs, market trends, and competitive landscape for our core products.</li> <li>Collaborating with product management and engineering teams to understand product roadmaps and translate technical features into customer benefits.</li> <li>Supporting the sales team with product training, competitive positioning, and materials to sell our solutions effectively.</li> <li>Assisting in the development and execution of marketing campaigns to generate leads and build brand awareness.</li> <li>Analyzing the performance of marketing initiatives and providing insights for optimization.</li> <li>Representing TuxCare by attending and actively participating in industry events, conferences, and webinars, including delivering presentations.</li> <li>Monitoring and reporting on key product marketing metrics.</li> </ul><p><strong>Requirements</strong></p><p><strong>To be successful in this role, you should have:</strong></p><ul><ul> <li>A minimum of 3 years of hands-on experience as a Linux Systems Administrator or in a similar technical role.</li> <li>Experience with enterprise Linux distributions (like RHEL, CentOS, AlmaLinux, or similar) is highly desirable.</li> <li>Demonstrable understanding of Linux environments, kernel operations, and system security principles.</li> <li>Familiarity with enterprise IT infrastructure and the challenges faced by IT operations and security teams.</li> <li>Excellent written and verbal communication skills, ability to explain complex technical concepts clearly and concisely to various audiences, and a flair for creating engaging content.&nbsp;&nbsp;</li> <li>Proven ability to develop and deliver effective presentations.</li> <li>Strong analytical and problem-solving skills with a keen attention to detail.</li> <li>A passion for technology and a desire to learn about cybersecurity and open-source solutions.</li> <li>Ability to work independently and manage multiple projects simultaneously in a fast-paced environment.</li> <li>A collaborative mindset with experience working effectively across different teams.</li> <li>Basic understanding of product marketing principles and practices is a plus.</li> <li>Comfort with being on camera for video content is a plus.</li> <li>Willingness to learn and adapt to new challenges and technologies.</li> <li>Willingness to travel for industry events as needed.</li> </ul></ul><p><strong>Benefits</strong></p><p><strong>What's in it for you?</strong></p><ul> <li>A strong focus on professional development with opportunities for learning and growth:</li> <ul> <li>Interesting and challenging projects,</li> <li>Mentor and other knowledge-exchange programs, </li> </ul> <li>Fully remote work with flexible working hours, that allows you to schedule your day and work from any location worldwide;</li> <li>Paid 24 days of vacation per year, 10 days of national holidays, and unlimited sick leaves to ensure you maintain a healthy work-life balance;</li> <li>Compensation for private medical insurance;</li> <li>Co-working and gym/sports reimbursement;</li> <li>The opportunity to receive a reward for the most innovative idea that the company can patent, fostering a culture of creativity and innovation.</li> </ul><p></p><p><em>By applying for this position, you consent to the processing of your personal data as described in our Privacy Policy (</em><a href=\"https://cloudlinux.com/candidate-privacy-notice\" target=\"_blank\" rel=\"nofollow noreferrer noopener\" class=\"external\"><em>https://cloudlinux.com/candidate-privacy-notice</em></a><em>), which provides detailed information on how we maintain and handle your data.</em></p>","tags":"[\"management\",\"engineering\"]","pubDate":"2025-05-14T00:00:00.000Z","link":"https://apply.workable.com/j/C781B62DA1","slug":"technical-product-marketing-manager-linux-focus-remote-work-anywhere-cloudlinux-9557"},{"id":1386750846,"title":"Technical Product Marketing Manager - Linux Focus (REMOTE- Work Anywhere)","company":"CloudLinux","image":"https://avatars.githubusercontent.com/u/16290369?s=200&v=4","description":"<p>We are seeking a motivated and technically-minded Product Marketing Manager to join our growing team and focus on our core security solutions. As a Technical Product Marketing Manager, you will play a key role in shaping the go-to-market strategy, messaging, and positioning for TuxCare's flagship products: KernelCare Enterprise, Enterprise Support for AlmaLinux, and ELS for Distributions. You will leverage your Linux system administration experience to understand our customers' needs and effectively communicate the value of our offerings. You will report to and work closely with the senior marketing leadership to develop and execute marketing plans that drive awareness, demand, and adoption of TuxCare solutions.</p><p>TuxCare is a subsidiary of CloudLinux. It offers a portfolio of security solutions for Linux and open-source software aimed at enterprise organizations. With TuxCare, enterprises can automate live vulnerability patching, minimize downtime, keep their applications secure and compliant, and get support from a team that knows Linux security best, covering the most popular Linux distributions, end-of-life systems, programming languages, and much more.&nbsp;&nbsp;</p><p>For more information, visit our website:<a href=\"https://tuxcare.com/\" rel=\"nofollow noreferrer noopener\" class=\"external\"> https://tuxcare.com/</a></p><p></p><p><strong>As our Technical Product Marketing Manager, you will be responsible for:</strong></p><ul> <li>Developing compelling product positioning and messaging for KernelCare Enterprise, Enterprise Support for AlmaLinux, and ELS for Distributions, highlighting their unique value propositions.</li> <li>Creating a wide range of engaging marketing and sales enablement content, including writing blog posts, articles, website copy, datasheets, case studies, white papers, and scripts for presentations and videos.</li> <li>Developing and delivering engaging presentations and demonstrations for internal teams, webinars, and industry events.</li> <li>Conceptualizing, scripting, and assisting in producing YouTube videos and other video content for the company to explain product features, benefits, and use cases.</li> <li>Conducting market research to identify customer needs, market trends, and competitive landscape for our core products.</li> <li>Collaborating with product management and engineering teams to understand product roadmaps and translate technical features into customer benefits.</li> <li>Supporting the sales team with product training, competitive positioning, and materials to sell our solutions effectively.</li> <li>Assisting in the development and execution of marketing campaigns to generate leads and build brand awareness.</li> <li>Analyzing the performance of marketing initiatives and providing insights for optimization.</li> <li>Representing TuxCare by attending and actively participating in industry events, conferences, and webinars, including delivering presentations.</li> <li>Monitoring and reporting on key product marketing metrics.</li> </ul><p><strong>Requirements</strong></p><p><strong>To be successful in this role, you should have:</strong></p><ul><ul> <li>A minimum of 3 years of hands-on experience as a Linux Systems Administrator or in a similar technical role.</li> <li>Experience with enterprise Linux distributions (like RHEL, CentOS, AlmaLinux, or similar) is highly desirable.</li> <li>Demonstrable understanding of Linux environments, kernel operations, and system security principles.</li> <li>Familiarity with enterprise IT infrastructure and the challenges faced by IT operations and security teams.</li> <li>Excellent written and verbal communication skills, ability to explain complex technical concepts clearly and concisely to various audiences, and a flair for creating engaging content.&nbsp;&nbsp;</li> <li>Proven ability to develop and deliver effective presentations.</li> <li>Strong analytical and problem-solving skills with a keen attention to detail.</li> <li>A passion for technology and a desire to learn about cybersecurity and open-source solutions.</li> <li>Ability to work independently and manage multiple projects simultaneously in a fast-paced environment.</li> <li>A collaborative mindset with experience working effectively across different teams.</li> <li>Basic understanding of product marketing principles and practices is a plus.</li> <li>Comfort with being on camera for video content is a plus.</li> <li>Willingness to learn and adapt to new challenges and technologies.</li> <li>Willingness to travel for industry events as needed.</li> </ul></ul><p><strong>Benefits</strong></p><p><strong>What's in it for you?</strong></p><ul> <li>A strong focus on professional development with opportunities for learning and growth:</li> <ul> <li>Interesting and challenging projects,</li> <li>Mentor and other knowledge-exchange programs, </li> </ul> <li>Fully remote work with flexible working hours, that allows you to schedule your day and work from any location worldwide;</li> <li>Paid 24 days of vacation per year, 10 days of national holidays, and unlimited sick leaves to ensure you maintain a healthy work-life balance;</li> <li>Compensation for private medical insurance;</li> <li>Co-working and gym/sports reimbursement;</li> <li>The opportunity to receive a reward for the most innovative idea that the company can patent, fostering a culture of creativity and innovation.</li> </ul><p></p><p><em>By applying for this position, you consent to the processing of your personal data as described in our Privacy Policy (</em><a href=\"https://cloudlinux.com/candidate-privacy-notice\" target=\"_blank\" rel=\"nofollow noreferrer noopener\" class=\"external\"><em>https://cloudlinux.com/candidate-privacy-notice</em></a><em>), which provides detailed information on how we maintain and handle your data.</em></p>","tags":"[\"management\",\"engineering\"]","pubDate":"2025-05-14T00:00:00.000Z","link":"https://apply.workable.com/j/C781B62DA1","slug":"technical-product-marketing-manager-linux-focus-remote-work-anywhere-cloudlinux-6965"},{"id":1987791754,"title":"Technical Product Marketing Manager - Linux Focus (REMOTE- Work Anywhere)","company":"CloudLinux","image":"https://avatars.githubusercontent.com/u/16290369?s=200&v=4","description":"<p>We are seeking a motivated and technically-minded Product Marketing Manager to join our growing team and focus on our core security solutions. As a Technical Product Marketing Manager, you will play a key role in shaping the go-to-market strategy, messaging, and positioning for TuxCare's flagship products: KernelCare Enterprise, Enterprise Support for AlmaLinux, and ELS for Distributions. You will leverage your Linux system administration experience to understand our customers' needs and effectively communicate the value of our offerings. You will report to and work closely with the senior marketing leadership to develop and execute marketing plans that drive awareness, demand, and adoption of TuxCare solutions.</p><p>TuxCare is a subsidiary of CloudLinux. It offers a portfolio of security solutions for Linux and open-source software aimed at enterprise organizations. With TuxCare, enterprises can automate live vulnerability patching, minimize downtime, keep their applications secure and compliant, and get support from a team that knows Linux security best, covering the most popular Linux distributions, end-of-life systems, programming languages, and much more.&nbsp;&nbsp;</p><p>For more information, visit our website:<a href=\"https://tuxcare.com/\" rel=\"nofollow noreferrer noopener\" class=\"external\"> https://tuxcare.com/</a></p><p></p><p><strong>As our Technical Product Marketing Manager, you will be responsible for:</strong></p><ul> <li>Developing compelling product positioning and messaging for KernelCare Enterprise, Enterprise Support for AlmaLinux, and ELS for Distributions, highlighting their unique value propositions.</li> <li>Creating a wide range of engaging marketing and sales enablement content, including writing blog posts, articles, website copy, datasheets, case studies, white papers, and scripts for presentations and videos.</li> <li>Developing and delivering engaging presentations and demonstrations for internal teams, webinars, and industry events.</li> <li>Conceptualizing, scripting, and assisting in producing YouTube videos and other video content for the company to explain product features, benefits, and use cases.</li> <li>Conducting market research to identify customer needs, market trends, and competitive landscape for our core products.</li> <li>Collaborating with product management and engineering teams to understand product roadmaps and translate technical features into customer benefits.</li> <li>Supporting the sales team with product training, competitive positioning, and materials to sell our solutions effectively.</li> <li>Assisting in the development and execution of marketing campaigns to generate leads and build brand awareness.</li> <li>Analyzing the performance of marketing initiatives and providing insights for optimization.</li> <li>Representing TuxCare by attending and actively participating in industry events, conferences, and webinars, including delivering presentations.</li> <li>Monitoring and reporting on key product marketing metrics.</li> </ul><p><strong>Requirements</strong></p><p><strong>To be successful in this role, you should have:</strong></p><ul><ul> <li>A minimum of 3 years of hands-on experience as a Linux Systems Administrator or in a similar technical role.</li> <li>Experience with enterprise Linux distributions (like RHEL, CentOS, AlmaLinux, or similar) is highly desirable.</li> <li>Demonstrable understanding of Linux environments, kernel operations, and system security principles.</li> <li>Familiarity with enterprise IT infrastructure and the challenges faced by IT operations and security teams.</li> <li>Excellent written and verbal communication skills, ability to explain complex technical concepts clearly and concisely to various audiences, and a flair for creating engaging content.&nbsp;&nbsp;</li> <li>Proven ability to develop and deliver effective presentations.</li> <li>Strong analytical and problem-solving skills with a keen attention to detail.</li> <li>A passion for technology and a desire to learn about cybersecurity and open-source solutions.</li> <li>Ability to work independently and manage multiple projects simultaneously in a fast-paced environment.</li> <li>A collaborative mindset with experience working effectively across different teams.</li> <li>Basic understanding of product marketing principles and practices is a plus.</li> <li>Comfort with being on camera for video content is a plus.</li> <li>Willingness to learn and adapt to new challenges and technologies.</li> <li>Willingness to travel for industry events as needed.</li> </ul></ul><p><strong>Benefits</strong></p><p><strong>What's in it for you?</strong></p><ul> <li>A strong focus on professional development with opportunities for learning and growth:</li> <ul> <li>Interesting and challenging projects,</li> <li>Mentor and other knowledge-exchange programs, </li> </ul> <li>Fully remote work with flexible working hours, that allows you to schedule your day and work from any location worldwide;</li> <li>Paid 24 days of vacation per year, 10 days of national holidays, and unlimited sick leaves to ensure you maintain a healthy work-life balance;</li> <li>Compensation for private medical insurance;</li> <li>Co-working and gym/sports reimbursement;</li> <li>The opportunity to receive a reward for the most innovative idea that the company can patent, fostering a culture of creativity and innovation.</li> </ul><p></p><p><em>By applying for this position, you consent to the processing of your personal data as described in our Privacy Policy (</em><a href=\"https://cloudlinux.com/candidate-privacy-notice\" target=\"_blank\" rel=\"nofollow noreferrer noopener\" class=\"external\"><em>https://cloudlinux.com/candidate-privacy-notice</em></a><em>), which provides detailed information on how we maintain and handle your data.</em></p>","tags":"[\"management\",\"engineering\"]","pubDate":"2025-05-14T00:00:00.000Z","link":"https://apply.workable.com/j/C781B62DA1","slug":"technical-product-marketing-manager-linux-focus-remote-work-anywhere-cloudlinux-1329"},{"id":2819044170,"title":"Technical Product Marketing Manager - Linux Focus (REMOTE- Work Anywhere)","company":"CloudLinux","image":"https://avatars.githubusercontent.com/u/16290369?s=200&v=4","description":"<p>We are seeking a motivated and technically-minded Product Marketing Manager to join our growing team and focus on our core security solutions. As a Technical Product Marketing Manager, you will play a key role in shaping the go-to-market strategy, messaging, and positioning for TuxCare's flagship products: KernelCare Enterprise, Enterprise Support for AlmaLinux, and ELS for Distributions. You will leverage your Linux system administration experience to understand our customers' needs and effectively communicate the value of our offerings. You will report to and work closely with the senior marketing leadership to develop and execute marketing plans that drive awareness, demand, and adoption of TuxCare solutions.</p><p>TuxCare is a subsidiary of CloudLinux. It offers a portfolio of security solutions for Linux and open-source software aimed at enterprise organizations. With TuxCare, enterprises can automate live vulnerability patching, minimize downtime, keep their applications secure and compliant, and get support from a team that knows Linux security best, covering the most popular Linux distributions, end-of-life systems, programming languages, and much more.&nbsp;&nbsp;</p><p>For more information, visit our website:<a href=\"https://tuxcare.com/\" rel=\"nofollow noreferrer noopener\" class=\"external\"> https://tuxcare.com/</a></p><p></p><p><strong>As our Technical Product Marketing Manager, you will be responsible for:</strong></p><ul> <li>Developing compelling product positioning and messaging for KernelCare Enterprise, Enterprise Support for AlmaLinux, and ELS for Distributions, highlighting their unique value propositions.</li> <li>Creating a wide range of engaging marketing and sales enablement content, including writing blog posts, articles, website copy, datasheets, case studies, white papers, and scripts for presentations and videos.</li> <li>Developing and delivering engaging presentations and demonstrations for internal teams, webinars, and industry events.</li> <li>Conceptualizing, scripting, and assisting in producing YouTube videos and other video content for the company to explain product features, benefits, and use cases.</li> <li>Conducting market research to identify customer needs, market trends, and competitive landscape for our core products.</li> <li>Collaborating with product management and engineering teams to understand product roadmaps and translate technical features into customer benefits.</li> <li>Supporting the sales team with product training, competitive positioning, and materials to sell our solutions effectively.</li> <li>Assisting in the development and execution of marketing campaigns to generate leads and build brand awareness.</li> <li>Analyzing the performance of marketing initiatives and providing insights for optimization.</li> <li>Representing TuxCare by attending and actively participating in industry events, conferences, and webinars, including delivering presentations.</li> <li>Monitoring and reporting on key product marketing metrics.</li> </ul><p><strong>Requirements</strong></p><p><strong>To be successful in this role, you should have:</strong></p><ul><ul> <li>A minimum of 3 years of hands-on experience as a Linux Systems Administrator or in a similar technical role.</li> <li>Experience with enterprise Linux distributions (like RHEL, CentOS, AlmaLinux, or similar) is highly desirable.</li> <li>Demonstrable understanding of Linux environments, kernel operations, and system security principles.</li> <li>Familiarity with enterprise IT infrastructure and the challenges faced by IT operations and security teams.</li> <li>Excellent written and verbal communication skills, ability to explain complex technical concepts clearly and concisely to various audiences, and a flair for creating engaging content.&nbsp;&nbsp;</li> <li>Proven ability to develop and deliver effective presentations.</li> <li>Strong analytical and problem-solving skills with a keen attention to detail.</li> <li>A passion for technology and a desire to learn about cybersecurity and open-source solutions.</li> <li>Ability to work independently and manage multiple projects simultaneously in a fast-paced environment.</li> <li>A collaborative mindset with experience working effectively across different teams.</li> <li>Basic understanding of product marketing principles and practices is a plus.</li> <li>Comfort with being on camera for video content is a plus.</li> <li>Willingness to learn and adapt to new challenges and technologies.</li> <li>Willingness to travel for industry events as needed.</li> </ul></ul><p><strong>Benefits</strong></p><p><strong>What's in it for you?</strong></p><ul> <li>A strong focus on professional development with opportunities for learning and growth:</li> <ul> <li>Interesting and challenging projects,</li> <li>Mentor and other knowledge-exchange programs, </li> </ul> <li>Fully remote work with flexible working hours, that allows you to schedule your day and work from any location worldwide;</li> <li>Paid 24 days of vacation per year, 10 days of national holidays, and unlimited sick leaves to ensure you maintain a healthy work-life balance;</li> <li>Compensation for private medical insurance;</li> <li>Co-working and gym/sports reimbursement;</li> <li>The opportunity to receive a reward for the most innovative idea that the company can patent, fostering a culture of creativity and innovation.</li> </ul><p></p><p><em>By applying for this position, you consent to the processing of your personal data as described in our Privacy Policy (</em><a href=\"https://cloudlinux.com/candidate-privacy-notice\" target=\"_blank\" rel=\"nofollow noreferrer noopener\" class=\"external\"><em>https://cloudlinux.com/candidate-privacy-notice</em></a><em>), which provides detailed information on how we maintain and handle your data.</em></p>","tags":"[\"management\",\"engineering\"]","pubDate":"2025-05-14T00:00:00.000Z","link":"https://apply.workable.com/j/C781B62DA1","slug":"technical-product-marketing-manager-linux-focus-remote-work-anywhere-cloudlinux-9330"},{"id":9949650179,"title":"AI Software Engineer","company":"Buyers Edge Platform","image":"https://remotive.com/job/2007924/logo","description":"<p><strong>Who are we?</strong></p>\n<p>Buyers Edge Platform stands at the forefront of revolutionizing the foodservice industry through technology, purchasing power and partnerships. We are dedicated to empowering stakeholders across the entire foodservice ecosystem (operators, distributors, manufacturers) with efficiency and unprecedented visibility. With a diverse portfolio of over a dozen brands, our mission is clear: to reduce costs, streamline the foodservice supply chain, and propel the industry from manual to automated.  </p>\n<p>Today, we are one of the largest players in foodservice, with over 200K operator locations across North America and over $50 billion of aggregated spend volume. Our commitment to foodservice excellence is proven in four distinct areas of value: Digital Procurement Network, Fresh Solutions, Supply Chain Management, and Software. Buyers Edge Platform is not just a provider – we are a strategic partner on the journey towards a more efficient, connected, and automated future for the foodservice industry.</p>\n<p><strong>This position is remotely based. We are unable to offer work sponsorship for this role. </strong></p>\n<p>We are seeking an <strong>AI Software Engineer</strong> who will implement and maintain API integrations that connect various data sources to support intelligent software agents and AI models. Ideal candidates have experience performing backend API development with specializations in Node.js, TypeScript, and Python. They have a basic familiarity with relational databases, modern cloud technologies, and with the emerging AI technology landscape. They can collaborate effectively to implement solutions under the guidance of senior team members. They have a passion to explore emerging AI technologies to pursue new creative solutions for the business.</p>\n<p><strong>Your impact:</strong></p>\n<p> </p>\n<ul style=\"\">\n<li style=\"\">Work with AI teams to integrate APIs into agentic software and LLM-powered tools</li>\n<li style=\"\">Develop and maintain RESTful APIs with proper error handling, validation, and authentication</li>\n<li style=\"\">Implement data retrieval functions from databases like Redshift, MySQL, and PostgreSQL</li>\n<li style=\"\">Deploy API updates to existing services using containerized environments (Docker, AWS)</li>\n<li style=\"\">Assist in troubleshooting API performance and reliability issues</li>\n<li style=\"\">Write clean, maintainable code with appropriate documentation</li>\n<li style=\"\">Participate in code reviews and follow team development standards</li>\n<li style=\"\">Collaborate with cross-functional teams to understand requirements and deliver solutions</li>\n</ul>\n<p><strong>About you:</strong></p>\n<p> </p>\n<ul style=\"\">\n<li style=\"\">Bachelor's degree in Computer Science, Engineering, or related field, or equivalent practical experience</li>\n<li style=\"\">3+ years of relevant software engineering experience with APIs and backend development</li>\n<li style=\"\">Proficiency with Python, JavaScript/TypeScript/Node.js, and Express.js framework</li>\n<li style=\"\">Experience with RESTful API development and integration</li>\n<li style=\"\">Working knowledge of SQL and experience with at least one relational database system</li>\n<li style=\"\">Basic knowledge of containerization (Docker) and cloud services (AWS)</li>\n<li style=\"\">Familiarity with version control systems (Git) and CI/CD practices</li>\n<li style=\"\">Strong problem-solving and debugging skills</li>\n<li style=\"\">A passion for emerging AI technologies and an understanding of the current offerings from leading AI platforms such as OpenAI</li>\n</ul>\n<p> </p>\n<p> </p>\n<p>Preferred Skills:</p>\n<p> </p>\n<ul style=\"\">\n<li style=\"\">Familiarity with Python Pandas or similar data analysis tools</li>\n<li style=\"\">Understanding of security best practices for API development</li>\n<li style=\"\">Experience with AWS services (Lambda, ECR, ECS)</li>\n<li style=\"\">Understanding of authentication mechanisms (JWT, OAuth)</li>\n<li style=\"\">Knowledge of Knex.js or similar query builders/ORMs</li>\n<li style=\"\">Experience with Agile development methodologies</li>\n</ul>\n<p> </p>\n<p>Don’t meet every requirement mentioned here? Studies have shown that women, communities of color and historically underrepresented talent are less likely to apply to jobs unless they meet every single qualification. At Buyers Edge Platform and our subsidiary brands, we are dedicated to building a diverse, inclusive and authentic workplace. So, if you’re excited about this role but your past experience doesn’t align perfectly with every qualification in the job description, we strongly encourage you to apply. You may be just the right candidate for this position or others with us!</p>\n<p><strong>What's in this for you? </strong></p>\n<p><strong>Amazing coverages to start.</strong> Medical, dental, and vision coverages are just the beginning! We also offer ancillary plans, such as flexible spending accounts for both health and dependent care, critical illness, accident, and voluntary life as well as company paid life and long-term-disability plans! On top of this, we also offer a 401(k) plan with company match.</p>\n<p><strong>Invest in your success.</strong> We will provide you with a thorough training and development program; and offer competitive compensation.</p>\n<p><strong>Live well = Work well.</strong> Relax with our Personal Responsibility Paid Time Off policy where you don’t have to accrue time off in order to take it! We also offer half-day Summer Fridays!</p>\n<div class='\"content-conclusion\"'>\n<p>We welcome all.</p>\n<p>We are committed to creating a diverse environment and are proud to be an equal opportunity employer. All qualified applicants will receive consideration for employment without regard to actual or perceived race, color, creed, religion, national origin, ancestry, citizenship status, age, sex or gender (including pregnancy, childbirth and pregnancy-related conditions), gender identity or expression (including transgender status), sexual orientation, marital status, military service and veteran status, physical or mental disability, genetic information, or any other characteristic protected by applicable federal, state or local laws and ordinances.</p>\n</div>\n<img src=\"https://remotive.com/job/track/2007924/blank.gif?source=public_api\" alt=\"\"/>","tags":"[\"node.js\",\"python\"]","pubDate":"2025-05-13T12:51:01.000Z","link":"https://remotive.com/remote-jobs/software-dev/ai-software-engineer-2007924","slug":"ai-software-engineer-buyers-edge-platform-5298"},{"id":6068195900,"title":"Senior Backend Developer (Node.js)","company":"Tether","image":"https://remotive.com/job/1984510/logo","description":"<p class=\"sc-1fwbcuw-0 khAsaN\"></p><p></p><p><strong><em>Join Tether and Shape the Future of Digital Finance</em></strong><br>At\r\n Tether, we’re not just building products, we’re pioneering a global \r\nfinancial revolution. Our cutting-edge solutions empower businesses—from\r\n exchanges and wallets to payment processors and ATMs—to seamlessly \r\nintegrate reserve-backed tokens across blockchains. By harnessing the \r\npower of blockchain technology, Tether enables you to store, send, and \r\nreceive digital tokens instantly, securely, and globally, all at a \r\nfraction of the cost. Transparency is the bedrock of everything we do, \r\nensuring trust in every transaction.</p><p><strong><em><br></em></strong></p><p><strong><em>Innovate with Tether</em></strong><br><strong>Tether Finance: </strong>Our innovative product suite features the world’s most trusted stablecoin, <strong>USDT</strong>, relied upon by hundreds of millions worldwide, alongside pioneering digital asset tokenization services.<br>But that’s just the beginning:<strong><br></strong></p><p><strong>Tether Power: </strong>Driving\r\n sustainable growth, our energy solutions optimize excess power for \r\nBitcoin mining using eco-friendly practices in state-of-the-art, \r\ngeo-diverse facilities.<br><strong>Tether Data: </strong>Fueling \r\nbreakthroughs in AI and peer-to-peer technology, we reduce \r\ninfrastructure costs and enhance global communications with cutting-edge\r\n solutions like <strong>KEET</strong>, our flagship app that redefines secure and private data sharing.<br><strong>Tether Education</strong>:\r\n Democratizing access to top-tier digital learning, we empower \r\nindividuals to thrive in the digital and gig economies, driving global \r\ngrowth and opportunity.<br><strong>Tether Evolution</strong>: At the \r\nintersection of technology and human potential, we are pushing the \r\nboundaries of what is possible, crafting a future where innovation and \r\nhuman capabilities merge in powerful, unprecedented ways.<strong><em><br></em></strong></p>\n<p><strong><em>Why Join Us?</em></strong><br>Our team is a global talent\r\n powerhouse, working remotely from every corner of the world. If you’re \r\npassionate about making a mark in the fintech space, this is your \r\nopportunity to collaborate with some of the brightest minds, pushing \r\nboundaries and setting new standards. We’ve grown fast, stayed lean, and\r\n secured our place as a leader in the industry.<br>If you have excellent\r\n English communication skills and are ready to contribute to the most \r\ninnovative platform on the planet, Tether is the place for you.<br>Are you ready to be part of the future?</p>\n<p dir=\"ltr\"><strong><br>About the job</strong><br></p>\n<p dir=\"ltr\">As a <strong>Senior Backend Developer,</strong> you will be a part of the team that works on the development of Tether backend components.</p><p dir=\"ltr\"><br></p>\n<p dir=\"ltr\"><strong>New Products and Features -</strong> Tether \r\ncontinuously strives to create innovative new features in order to \r\nprovide the most professional trading experience for customers. These \r\nare developed and deployed using agile methodologies, to ensure the user\r\n experience remains the best in the industry.</p>\n<p dir=\"ltr\"><br></p>\n<p dir=\"ltr\"><strong>Scalability </strong>- all backend services that \r\npower Tether must remain effortlessly smooth, responsive, and real-time \r\nfor customers as the platform continues to scale to accommodate new user\r\n growth.</p>\n<p dir=\"ltr\"><br></p>\n<p dir=\"ltr\"><strong>Security -</strong> Security is the most important \r\nfeature. The Backend Development team is responsible for building all \r\nthe services and core processes with the highest security principles and\r\n standard, in order to protect the safety of the entire user base.<br><br></p><div class=\"h2\">Job requirements</div><p class=\"sc-1fwbcuw-0 khAsaN\"></p><p></p><ul style=\"\"><li dir=\"ltr\" style=\"\"><p dir=\"ltr\">+6 years of experience working with Nodejs/JavaScript.</p></li><li dir=\"ltr\" style=\"\"><p dir=\"ltr\">Familiar with microservices architecture</p></li><li dir=\"ltr\" style=\"\"><p dir=\"ltr\">Have actively participated in the development of a complex platform</p></li><li dir=\"ltr\" style=\"\"><p dir=\"ltr\">Familiar with Peer-to-Peer technologies</p></li><li dir=\"ltr\" style=\"\"><p dir=\"ltr\">Good experience in interacting with databases (MySQL, MongoDB)</p></li><li dir=\"ltr\" style=\"\"><p dir=\"ltr\">Ability to quickly learn new technologies</p></li><li dir=\"ltr\" style=\"\"><p dir=\"ltr\">Good understanding of security practices</p></li></ul>\n<p><br></p>\n<div class=\"h4\" dir=\"ltr\"><strong>Nice to have</strong></div>\n<ul style=\"\"><li dir=\"ltr\" style=\"\"><p dir=\"ltr\">Experience with blockchain integration</p></li><li dir=\"ltr\" style=\"\"><p dir=\"ltr\">Comfortable with high-availability concepts</p></li><li dir=\"ltr\" style=\"\"><p dir=\"ltr\">Ruby, Rust or C++ skills are a plus</p></li><li dir=\"ltr\" style=\"\"><p dir=\"ltr\">Other technologies of interest: Message queues (Redis), Caches and Job Queues</p></li></ul><p><br></p>\n<img src=\"https://remotive.com/job/track/1984510/blank.gif?source=public_api\" alt=\"\"/>","tags":"[\"backend\",\"C++\",\"javascript\",\"mongoDB\",\"node.js\",\"ruby/rails\",\"security\",\"blockchain\",\"AI/ML\",\"agile\",\"rust\",\"Redis\",\"bitcoin\",\"MySQL\",\"trading\",\"responsive\",\"fintech\",\"Micro services\",\"infrastructure\"]","pubDate":"2025-05-13T10:46:44.000Z","link":"https://remotive.com/remote-jobs/software-dev/senior-backend-developer-node-js-1984510","slug":"senior-backend-developer-node-js-tether-246"},{"id":4832981736,"title":"Senior Content Marketer","company":"Animalz","image":"https://remotive.com/job/2007322/logo","description":"<p class=\"h2\" dir=\"ltr\" style=\"line-height: 1.38; margin-top: 18pt; margin-bottom: 6pt;\"><span style=\"color: #000000; background-color: transparent; font-weight: 400; font-style: normal; font-variant: normal; text-decoration: none; vertical-align: baseline; white-space: pre-wrap;\">About Animalz</span></p>\n<p dir=\"ltr\" style=\"line-height: 1.38; margin-top: 0pt; margin-bottom: 0pt;\"><span style=\"color: #000000; background-color: transparent; font-weight: 400; font-style: normal; font-variant: normal; text-decoration: none; vertical-align: baseline; white-space: pre-wrap;\">Animalz is a content marketing agency that partners with B2B SaaS companies, venture capital firms, and other tech organizations to drive long-term, sustainable growth through high-quality content. </span></p>\n<p><strong> </strong></p>\n<p dir=\"ltr\" style=\"line-height: 1.38; margin-top: 0pt; margin-bottom: 0pt;\"><span style=\"color: #000000; background-color: transparent; font-weight: 400; font-style: normal; font-variant: normal; text-decoration: none; vertical-align: baseline; white-space: pre-wrap;\">Our fully remote team of strategists and content marketers delivers content strategies tailored to each customer's goals and context. We pride ourselves on our deep interest and understanding of software products and audiences, our commitment to thought leadership, and our relentless pursuit of mastering our craft.</span></p>\n<p><strong> </strong></p>\n<p dir=\"ltr\" style=\"line-height: 1.38; margin-top: 0pt; margin-bottom: 0pt;\"><span style=\"color: #000000; background-color: transparent; font-weight: 400; font-style: normal; font-variant: normal; text-decoration: none; vertical-align: baseline; white-space: pre-wrap;\">Our customers include industry leaders like Amplitude, Ramp, and Wistia, as well as high-growth early-stage startups.</span></p>\n<p class=\"h2\" dir=\"ltr\" style=\"line-height: 1.38; margin-top: 18pt; margin-bottom: 6pt;\"><span style=\"color: #000000; background-color: transparent; font-weight: 400; font-style: normal; font-variant: normal; text-decoration: none; vertical-align: baseline; white-space: pre-wrap;\">About the Role</span></p>\n<p dir=\"ltr\" style=\"line-height: 1.38; margin-top: 0pt; margin-bottom: 0pt;\"><span style=\"color: #000000; background-color: transparent; font-weight: 400; font-style: normal; font-variant: normal; text-decoration: none; vertical-align: baseline; white-space: pre-wrap;\">As a Senior Content Marketer at Animalz, you'll take ownership of executing and maintaining content strategies for a portfolio of high-growth B2B technology customers. You'll be responsible for producing compelling, audience-focused content that drives measurable business outcomes.</span></p>\n<p><strong> </strong></p>\n<p dir=\"ltr\" style=\"line-height: 1.38; margin-top: 0pt; margin-bottom: 0pt;\"><span style=\"color: #000000; background-color: transparent; font-weight: 400; font-style: normal; font-variant: normal; text-decoration: none; vertical-align: baseline; white-space: pre-wrap;\">This isn't just a writing role. You'll oversee content pipelines, assign work to freelancers, collaborate with design, and act as a trusted partner to customers. You'll work closely with the Heads of Content to translate strategy into action and work with editors and subject matter experts to ensure everything you ship is thoughtful, useful, and aligned with business outcomes.</span></p>\n<p class=\"h2\" dir=\"ltr\" style=\"line-height: 1.38; margin-top: 18pt; margin-bottom: 6pt;\"><span style=\"color: #000000; background-color: transparent; font-weight: 400; font-style: normal; font-variant: normal; text-decoration: none; vertical-align: baseline; white-space: pre-wrap;\">What You'll Do</span></p>\n<ul style=\"\">\n<li dir=\"ltr\" style=\"\">\n<p dir=\"ltr\" style=\"line-height: 1.38; margin-top: 0pt; margin-bottom: 0pt;\"><span style=\"color: #000000; background-color: transparent; font-weight: bold; font-style: normal; font-variant: normal; text-decoration: none; vertical-align: baseline; white-space: pre-wrap;\">Execute and maintain content strategies</span><span style=\"color: #000000; background-color: transparent; font-weight: 400; font-style: normal; font-variant: normal; text-decoration: none; vertical-align: baseline; white-space: pre-wrap;\"> developed by Heads of Content, adapting them to evolving customer needs and feedback  </span></p>\n</li>\n<li dir=\"ltr\" style=\"\">\n<p dir=\"ltr\" style=\"line-height: 1.38; margin-top: 0pt; margin-bottom: 0pt;\"><span style=\"color: #000000; background-color: transparent; font-weight: bold; font-style: normal; font-variant: normal; text-decoration: none; vertical-align: baseline; white-space: pre-wrap;\">Create high-performing content</span><span style=\"color: #000000; background-color: transparent; font-weight: 400; font-style: normal; font-variant: normal; text-decoration: none; vertical-align: baseline; white-space: pre-wrap;\">—blogs, guides, landing pages, email nurtures, and more—that aligns with SEO best practices and customer intent  </span></p>\n</li>\n<li dir=\"ltr\" style=\"\">\n<p dir=\"ltr\" style=\"line-height: 1.38; margin-top: 0pt; margin-bottom: 0pt;\"><span style=\"color: #000000; background-color: transparent; font-weight: bold; font-style: normal; font-variant: normal; text-decoration: none; vertical-align: baseline; white-space: pre-wrap;\">Assign and manage freelance writers</span><span style=\"color: #000000; background-color: transparent; font-weight: 400; font-style: normal; font-variant: normal; text-decoration: none; vertical-align: baseline; white-space: pre-wrap;\">, ensuring timely, high-quality delivery for the accounts and strategies you support  </span></p>\n</li>\n<li dir=\"ltr\" style=\"\">\n<p dir=\"ltr\" style=\"line-height: 1.38; margin-top: 0pt; margin-bottom: 0pt;\"><span style=\"color: #000000; background-color: transparent; font-weight: bold; font-style: normal; font-variant: normal; text-decoration: none; vertical-align: baseline; white-space: pre-wrap;\">Collaborate with design </span><span style=\"color: #000000; background-color: transparent; font-weight: 400; font-style: normal; font-variant: normal; text-decoration: none; vertical-align: baseline; white-space: pre-wrap;\">to create graphics for various deliverables (create design briefs, explain concepts, etc)…</span></p>\n</li>\n<li dir=\"ltr\" style=\"\">\n<p dir=\"ltr\" style=\"line-height: 1.38; margin-top: 0pt; margin-bottom: 0pt;\"><span style=\"color: #000000; background-color: transparent; font-weight: bold; font-style: normal; font-variant: normal; text-decoration: none; vertical-align: baseline; white-space: pre-wrap;\">Audit, refresh, and optimize</span><span style=\"color: #000000; background-color: transparent; font-weight: 400; font-style: normal; font-variant: normal; text-decoration: none; vertical-align: baseline; white-space: pre-wrap;\"> existing content to improve performance across search, conversion, and engagement metrics  </span></p>\n</li>\n<li dir=\"ltr\" style=\"\">\n<p dir=\"ltr\" style=\"line-height: 1.38; margin-top: 0pt; margin-bottom: 0pt;\"><span style=\"color: #000000; background-color: transparent; font-weight: bold; font-style: normal; font-variant: normal; text-decoration: none; vertical-align: baseline; white-space: pre-wrap;\">Manage content calendars and delivery pipelines</span><span style=\"color: #000000; background-color: transparent; font-weight: 400; font-style: normal; font-variant: normal; text-decoration: none; vertical-align: baseline; white-space: pre-wrap;\">, balancing quality with high-volume output  </span></p>\n</li>\n<li dir=\"ltr\" style=\"\">\n<p dir=\"ltr\" style=\"line-height: 1.38; margin-top: 0pt; margin-bottom: 0pt;\"><span style=\"color: #000000; background-color: transparent; font-weight: bold; font-style: normal; font-variant: normal; text-decoration: none; vertical-align: baseline; white-space: pre-wrap;\">Create monthly performance reports</span><span style=\"color: #000000; background-color: transparent; font-weight: 400; font-style: normal; font-variant: normal; text-decoration: none; vertical-align: baseline; white-space: pre-wrap;\"> for the customers you manage, communicate key results and insights, and ensure content is aligned with customer goals and target outcomes.</span></p>\n</li>\n<li dir=\"ltr\" style=\"\">\n<p dir=\"ltr\" style=\"line-height: 1.38; margin-top: 0pt; margin-bottom: 0pt;\"><span style=\"color: #000000; background-color: transparent; font-weight: bold; font-style: normal; font-variant: normal; text-decoration: none; vertical-align: baseline; white-space: pre-wrap;\">Participate in knowledge-sharing within the team, </span><span style=\"color: #000000; background-color: transparent; font-weight: 400; font-style: normal; font-variant: normal; text-decoration: none; vertical-align: baseline; white-space: pre-wrap;\">contributing expertise while learning from others in a collaborative environment</span></p>\n</li>\n<li dir=\"ltr\" style=\"\">\n<p dir=\"ltr\" style=\"line-height: 1.38; margin-top: 0pt; margin-bottom: 12pt;\"><span style=\"color: #000000; background-color: transparent; font-weight: bold; font-style: normal; font-variant: normal; text-decoration: none; vertical-align: baseline; white-space: pre-wrap;\">Contribute to internal initiatives</span><span style=\"color: #000000; background-color: transparent; font-weight: 400; font-style: normal; font-variant: normal; text-decoration: none; vertical-align: baseline; white-space: pre-wrap;\">, from researching and piloting new service offerings to improving AI-assisted content workflows </span></p>\n</li>\n</ul>\n<p class=\"h2\" dir=\"ltr\" style=\"line-height: 1.38; margin-top: 18pt; margin-bottom: 6pt;\"><span style=\"color: #000000; background-color: transparent; font-weight: 400; font-style: normal; font-variant: normal; text-decoration: none; vertical-align: baseline; white-space: pre-wrap;\">Core Competencies</span></p>\n<ul style=\"\">\n<li dir=\"ltr\" style=\"\">\n<p dir=\"ltr\" style=\"line-height: 1.38; margin-top: 0pt; margin-bottom: 0pt;\"><span style=\"color: #000000; background-color: transparent; font-weight: bold; font-style: normal; font-variant: normal; text-decoration: none; vertical-align: baseline; white-space: pre-wrap;\">Strategic Execution</span><span style=\"color: #000000; background-color: transparent; font-weight: 400; font-style: normal; font-variant: normal; text-decoration: none; vertical-align: baseline; white-space: pre-wrap;\">: You can translate an established strategy into consistent, high-quality execution, adjusting tactics based on results and feedback</span></p>\n</li>\n<li dir=\"ltr\" style=\"\">\n<p dir=\"ltr\" style=\"line-height: 1.38; margin-top: 0pt; margin-bottom: 0pt;\"><span style=\"color: #000000; background-color: transparent; font-weight: bold; font-style: normal; font-variant: normal; text-decoration: none; vertical-align: baseline; white-space: pre-wrap;\">Editorial Judgment</span><span style=\"color: #000000; background-color: transparent; font-weight: 400; font-style: normal; font-variant: normal; text-decoration: none; vertical-align: baseline; white-space: pre-wrap;\">: You understand how to craft effective B2B content across formats, funnel stages, and buyer personas—and you help others do the same</span></p>\n</li>\n<li dir=\"ltr\" style=\"\">\n<p dir=\"ltr\" style=\"line-height: 1.38; margin-top: 0pt; margin-bottom: 0pt;\"><span style=\"color: #000000; background-color: transparent; font-weight: bold; font-style: normal; font-variant: normal; text-decoration: none; vertical-align: baseline; white-space: pre-wrap;\">Customer Empathy</span><span style=\"color: #000000; background-color: transparent; font-weight: 400; font-style: normal; font-variant: normal; text-decoration: none; vertical-align: baseline; white-space: pre-wrap;\">: You communicate clearly, manage expectations, and build trust with customers through insight and transparency</span></p>\n</li>\n<li dir=\"ltr\" style=\"\">\n<p dir=\"ltr\" style=\"line-height: 1.38; margin-top: 0pt; margin-bottom: 0pt;\"><span style=\"color: #000000; background-color: transparent; font-weight: bold; font-style: normal; font-variant: normal; text-decoration: none; vertical-align: baseline; white-space: pre-wrap;\">Technical Curiosity:</span><span style=\"color: #000000; background-color: transparent; font-weight: 400; font-style: normal; font-variant: normal; text-decoration: none; vertical-align: baseline; white-space: pre-wrap;\"> You have a strong grasp of technology and software team dynamics, and a genuine interest in learning how complex products work so you can explain them clearly and persuasively.</span></p>\n</li>\n<li dir=\"ltr\" style=\"\">\n<p dir=\"ltr\" style=\"line-height: 1.38; margin-top: 0pt; margin-bottom: 0pt;\"><span style=\"color: #000000; background-color: transparent; font-weight: bold; font-style: normal; font-variant: normal; text-decoration: none; vertical-align: baseline; white-space: pre-wrap;\">Executional Excellence</span><span style=\"color: #000000; background-color: transparent; font-weight: 400; font-style: normal; font-variant: normal; text-decoration: none; vertical-align: baseline; white-space: pre-wrap;\">: You reliably deliver quality content on time—even when managing multiple accounts, content types, and contributors</span></p>\n</li>\n<li dir=\"ltr\" style=\"\">\n<p dir=\"ltr\" style=\"line-height: 1.38; margin-top: 0pt; margin-bottom: 0pt;\"><span style=\"color: #000000; background-color: transparent; font-weight: bold; font-style: normal; font-variant: normal; text-decoration: none; vertical-align: baseline; white-space: pre-wrap;\">AI Fluency</span><span style=\"color: #000000; background-color: transparent; font-weight: 400; font-style: normal; font-variant: normal; text-decoration: none; vertical-align: baseline; white-space: pre-wrap;\">: You know how to use AI tools to support content workflows responsibly and efficiently, and stay current on emerging best practices</span></p>\n</li>\n<li dir=\"ltr\" style=\"\">\n<p dir=\"ltr\" style=\"line-height: 1.38; margin-top: 0pt; margin-bottom: 0pt;\"><span style=\"color: #000000; background-color: transparent; font-weight: bold; font-style: normal; font-variant: normal; text-decoration: none; vertical-align: baseline; white-space: pre-wrap;\">Analytical Thinking</span><span style=\"color: #000000; background-color: transparent; font-weight: 400; font-style: normal; font-variant: normal; text-decoration: none; vertical-align: baseline; white-space: pre-wrap;\">: You know how to assess content performance using tools like Google Analytics, Google Search Console, and Ahrefs, and how to iterate for better results</span></p>\n</li>\n<li dir=\"ltr\" style=\"\">\n<p dir=\"ltr\" style=\"line-height: 1.38; margin-top: 0pt; margin-bottom: 0pt;\"><span style=\"color: #000000; background-color: transparent; font-weight: bold; font-style: normal; font-variant: normal; text-decoration: none; vertical-align: baseline; white-space: pre-wrap;\">Freelancer Management &amp; Feedback Loop: </span><span style=\"color: #000000; background-color: transparent; font-weight: 400; font-style: normal; font-variant: normal; text-decoration: none; vertical-align: baseline; white-space: pre-wrap;\">You assign work to freelancers, communicate customer feedback effectively, and ensure deliverables meet account standards while collaborating with editors throughout the process</span></p>\n</li>\n<li dir=\"ltr\" style=\"\">\n<p dir=\"ltr\" style=\"line-height: 1.38; margin-top: 0pt; margin-bottom: 0pt;\"><span style=\"color: #000000; background-color: transparent; font-weight: bold; font-style: normal; font-variant: normal; text-decoration: none; vertical-align: baseline; white-space: pre-wrap;\">Adaptability</span><span style=\"color: #000000; background-color: transparent; font-weight: 400; font-style: normal; font-variant: normal; text-decoration: none; vertical-align: baseline; white-space: pre-wrap;\">: You're comfortable navigating ambiguity, trying new tools or formats, and adjusting your approach when priorities shift</span></p>\n</li>\n<li dir=\"ltr\" style=\"\">\n<p dir=\"ltr\" style=\"line-height: 1.38; margin-top: 0pt; margin-bottom: 0pt;\"><span style=\"color: #000000; background-color: transparent; font-weight: bold; font-style: normal; font-variant: normal; text-decoration: none; vertical-align: baseline; white-space: pre-wrap;\">Value-Driven Thinking</span><span style=\"color: #000000; background-color: transparent; font-weight: 400; font-style: normal; font-variant: normal; text-decoration: none; vertical-align: baseline; white-space: pre-wrap;\">: You optimize for long-term impact over short-term wins, and focus on solving for our customers’ customers</span></p>\n</li>\n<li dir=\"ltr\" style=\"\">\n<p dir=\"ltr\" style=\"line-height: 1.38; margin-top: 0pt; margin-bottom: 0pt;\"><span style=\"color: #000000; background-color: transparent; font-weight: bold; font-style: normal; font-variant: normal; text-decoration: none; vertical-align: baseline; white-space: pre-wrap;\">Growth Mindset</span><span style=\"color: #000000; background-color: transparent; font-weight: 400; font-style: normal; font-variant: normal; text-decoration: none; vertical-align: baseline; white-space: pre-wrap;\">: You invest in your own development and actively bring back insights that elevate the team's thinking and output</span></p>\n</li>\n</ul>\n<p class=\"h2\" dir=\"ltr\" style=\"line-height: 1.38; margin-top: 18pt; margin-bottom: 6pt;\"><span style=\"color: #000000; background-color: transparent; font-weight: 400; font-style: normal; font-variant: normal; text-decoration: none; vertical-align: baseline; white-space: pre-wrap;\">What We're Looking For</span></p>\n<ul style=\"\">\n<li dir=\"ltr\" style=\"\">\n<p dir=\"ltr\" style=\"line-height: 1.38; margin-top: 0pt; margin-bottom: 0pt;\"><span style=\"color: #000000; background-color: transparent; font-weight: 400; font-style: normal; font-variant: normal; text-decoration: none; vertical-align: baseline; white-space: pre-wrap;\">4–6 years of experience in content marketing, preferably in a B2B SaaS or agency setting  </span></p>\n</li>\n<li dir=\"ltr\" style=\"\">\n<p dir=\"ltr\" style=\"line-height: 1.38; margin-top: 0pt; margin-bottom: 0pt;\"><span style=\"color: #000000; background-color: transparent; font-weight: 400; font-style: normal; font-variant: normal; text-decoration: none; vertical-align: baseline; white-space: pre-wrap;\">Proven ability to execute content strategies that support business goals—traffic, conversions, engagement, or retention  </span></p>\n</li>\n<li dir=\"ltr\" style=\"\">\n<p dir=\"ltr\" style=\"line-height: 1.38; margin-top: 0pt; margin-bottom: 0pt;\"><span style=\"color: #000000; background-color: transparent; font-weight: 400; font-style: normal; font-variant: normal; text-decoration: none; vertical-align: baseline; white-space: pre-wrap;\">Strong customer management skills, including the ability to communicate proactively, manage feedback loops, and build trust across multiple accounts  </span></p>\n</li>\n<li dir=\"ltr\" style=\"\">\n<p dir=\"ltr\" style=\"line-height: 1.38; margin-top: 0pt; margin-bottom: 0pt;\"><span style=\"color: #000000; background-color: transparent; font-weight: 400; font-style: normal; font-variant: normal; text-decoration: none; vertical-align: baseline; white-space: pre-wrap;\">Exceptional writing and editing skills, with a strong grasp of SEO and narrative clarity  </span></p>\n</li>\n<li dir=\"ltr\" style=\"\">\n<p dir=\"ltr\" style=\"line-height: 1.38; margin-top: 0pt; margin-bottom: 0pt;\"><span style=\"color: #000000; background-color: transparent; font-weight: 400; font-style: normal; font-variant: normal; text-decoration: none; vertical-align: baseline; white-space: pre-wrap;\">Experience assigning work to and managing freelance writers in a fast-paced editorial environment  </span></p>\n</li>\n<li dir=\"ltr\" style=\"\">\n<p dir=\"ltr\" style=\"line-height: 1.38; margin-top: 0pt; margin-bottom: 0pt;\"><span style=\"color: #000000; background-color: transparent; font-weight: 400; font-style: normal; font-variant: normal; text-decoration: none; vertical-align: baseline; white-space: pre-wrap;\">Familiarity with AI tools (e.g., ChatGPT, Perplexity, Claude) and the ability to use them to enhance—not replace—human editorial quality  </span></p>\n</li>\n<li dir=\"ltr\" style=\"\">\n<p dir=\"ltr\" style=\"line-height: 1.38; margin-top: 0pt; margin-bottom: 0pt;\"><span style=\"color: #000000; background-color: transparent; font-weight: 400; font-style: normal; font-variant: normal; text-decoration: none; vertical-align: baseline; white-space: pre-wrap;\">Strong command of content tools and analytics platforms (e.g., Google Analytics, Ahrefs, HubSpot, Clearscope)  </span></p>\n</li>\n<li dir=\"ltr\" style=\"\">\n<p dir=\"ltr\" style=\"line-height: 1.38; margin-top: 0pt; margin-bottom: 0pt;\"><span style=\"color: #000000; background-color: transparent; font-weight: 400; font-style: normal; font-variant: normal; text-decoration: none; vertical-align: baseline; white-space: pre-wrap;\">Experience collaborating with other content professionals and helping refine internal processes  </span></p>\n</li>\n<li dir=\"ltr\" style=\"\">\n<p dir=\"ltr\" style=\"line-height: 1.38; margin-top: 0pt; margin-bottom: 0pt;\"><span style=\"color: #000000; background-color: transparent; font-weight: 400; font-style: normal; font-variant: normal; text-decoration: none; vertical-align: baseline; white-space: pre-wrap;\">Excellent communication, organization, and remote collaboration skills  </span></p>\n</li>\n<li dir=\"ltr\" style=\"\">\n<p dir=\"ltr\" style=\"line-height: 1.38; margin-top: 0pt; margin-bottom: 0pt;\"><span style=\"color: #000000; background-color: transparent; font-weight: 400; font-style: normal; font-variant: normal; text-decoration: none; vertical-align: baseline; white-space: pre-wrap;\">Curiosity and a commitment to continuous learning in the evolving world of content and content strategy  </span></p>\n</li>\n</ul>\n<p class=\"h2\" dir=\"ltr\" style=\"line-height: 1.38; margin-top: 18pt; margin-bottom: 6pt;\"><span style=\"color: #000000; background-color: transparent; font-weight: 400; font-style: normal; font-variant: normal; text-decoration: none; vertical-align: baseline; white-space: pre-wrap;\">Our Values</span></p>\n<p dir=\"ltr\" style=\"line-height: 1.38; margin-top: 0pt; margin-bottom: 0pt;\"><span style=\"color: #000000; background-color: transparent; font-weight: 400; font-style: normal; font-variant: normal; text-decoration: none; vertical-align: baseline; white-space: pre-wrap;\">At Animalz, our values guide how we show up for our customers, our teammates, and the content we create. We’re looking for team members who embody these principles and want to grow within them.</span></p>\n<p><strong> </strong></p>\n<ul style=\"\">\n<li dir=\"ltr\" style=\"\">\n<p dir=\"ltr\" style=\"line-height: 1.38; margin-top: 0pt; margin-bottom: 0pt;\"><span style=\"color: #000000; background-color: transparent; font-weight: bold; font-style: normal; font-variant: normal; text-decoration: none; vertical-align: baseline; white-space: pre-wrap;\">Value Over Vanity</span><span style=\"color: #000000; background-color: transparent; font-weight: 400; font-style: normal; font-variant: normal; text-decoration: none; vertical-align: baseline; white-space: pre-wrap;\">: We measure our success in customer impact, not surface-level praise. We focus on content that drives sustainable, long-term results by understanding and serving our customers’ customers.</span></p>\n</li>\n<li dir=\"ltr\" style=\"\">\n<p dir=\"ltr\" style=\"line-height: 1.38; margin-top: 0pt; margin-bottom: 0pt;\"><span style=\"color: #000000; background-color: transparent; font-weight: bold; font-style: normal; font-variant: normal; text-decoration: none; vertical-align: baseline; white-space: pre-wrap;\">Two Steps Ahead</span><span style=\"color: #000000; background-color: transparent; font-weight: 400; font-style: normal; font-variant: normal; text-decoration: none; vertical-align: baseline; white-space: pre-wrap;\">: Great work anticipates needs before they arise. We’re proactive and strategic, always looking for ways to solve problems before they become blockers.</span></p>\n</li>\n<li dir=\"ltr\" style=\"\">\n<p dir=\"ltr\" style=\"line-height: 1.38; margin-top: 0pt; margin-bottom: 0pt;\"><span style=\"color: #000000; background-color: transparent; font-weight: bold; font-style: normal; font-variant: normal; text-decoration: none; vertical-align: baseline; white-space: pre-wrap;\">Power Source; Not Power Trip</span><span style=\"color: #000000; background-color: transparent; font-weight: 400; font-style: normal; font-variant: normal; text-decoration: none; vertical-align: baseline; white-space: pre-wrap;\">: We lead through service, not authority. We energize our teammates and customers, convert obstacles into momentum, and focus on elevating others.</span></p>\n</li>\n<li dir=\"ltr\" style=\"\">\n<p dir=\"ltr\" style=\"line-height: 1.38; margin-top: 0pt; margin-bottom: 0pt;\"><span style=\"color: #000000; background-color: transparent; font-weight: bold; font-style: normal; font-variant: normal; text-decoration: none; vertical-align: baseline; white-space: pre-wrap;\">Pursue Mastery</span><span style=\"color: #000000; background-color: transparent; font-weight: 400; font-style: normal; font-variant: normal; text-decoration: none; vertical-align: baseline; white-space: pre-wrap;\">: We believe great work comes from deliberate practice, open collaboration, and constant curiosity. We’re always learning, evolving, and testing new approaches.</span></p>\n</li>\n<li dir=\"ltr\" style=\"\">\n<p dir=\"ltr\" style=\"line-height: 1.38; margin-top: 0pt; margin-bottom: 0pt;\"><span style=\"color: #000000; background-color: transparent; font-weight: bold; font-style: normal; font-variant: normal; text-decoration: none; vertical-align: baseline; white-space: pre-wrap;\">Left Brain, Right Brain, Robot Brain</span><span style=\"color: #000000; background-color: transparent; font-weight: 400; font-style: normal; font-variant: normal; text-decoration: none; vertical-align: baseline; white-space: pre-wrap;\">: Our best work blends creativity, analysis, and smart use of technology—including AI—to drive meaningful outcomes without sacrificing humanity or voice.</span></p>\n</li>\n<li dir=\"ltr\" style=\"\">\n<p dir=\"ltr\" style=\"line-height: 1.38; margin-top: 0pt; margin-bottom: 0pt;\"><span style=\"color: #000000; background-color: transparent; font-weight: bold; font-style: normal; font-variant: normal; text-decoration: none; vertical-align: baseline; white-space: pre-wrap;\">In the Arena</span><span style=\"color: #000000; background-color: transparent; font-weight: 400; font-style: normal; font-variant: normal; text-decoration: none; vertical-align: baseline; white-space: pre-wrap;\">: We’re not spectators. We experiment boldly, contribute to thought leadership, and stay immersed in our customers’ industries so we can lead from experience, not theory.</span></p>\n</li>\n</ul>\n<p class=\"h2\" dir=\"ltr\" style=\"line-height: 1.38; margin-top: 18pt; margin-bottom: 4pt;\"><span style=\"color: #000000; background-color: transparent; font-weight: 400; font-style: normal; font-variant: normal; text-decoration: none; vertical-align: baseline; white-space: pre-wrap;\">Your First 90 Days</span></p>\n<p dir=\"ltr\" style=\"line-height: 1.38; margin-top: 12pt; margin-bottom: 12pt;\"><span style=\"color: #000000; background-color: transparent; font-weight: bold; font-style: normal; font-variant: normal; text-decoration: none; vertical-align: baseline; white-space: pre-wrap;\">Days 1-30: Learn &amp; Integrate</span></p>\n<ul style=\"\">\n<li dir=\"ltr\" style=\"\">\n<p dir=\"ltr\" style=\"line-height: 1.38; margin-top: 12pt; margin-bottom: 0pt;\"><span style=\"color: #000000; background-color: transparent; font-weight: 400; font-style: normal; font-variant: normal; text-decoration: none; vertical-align: baseline; white-space: pre-wrap;\">Complete onboarding and master our tools and processes</span></p>\n</li>\n<li dir=\"ltr\" style=\"\">\n<p dir=\"ltr\" style=\"line-height: 1.38; margin-top: 0pt; margin-bottom: 0pt;\"><span style=\"color: #000000; background-color: transparent; font-weight: 400; font-style: normal; font-variant: normal; text-decoration: none; vertical-align: baseline; white-space: pre-wrap;\">Deep dive into your assigned customer accounts</span></p>\n</li>\n<li dir=\"ltr\" style=\"\">\n<p dir=\"ltr\" style=\"line-height: 1.38; margin-top: 0pt; margin-bottom: 0pt;\"><span style=\"color: #000000; background-color: transparent; font-weight: 400; font-style: normal; font-variant: normal; text-decoration: none; vertical-align: baseline; white-space: pre-wrap;\">Create your first content deliverables with guidance</span></p>\n</li>\n<li dir=\"ltr\" style=\"\">\n<p dir=\"ltr\" style=\"line-height: 1.38; margin-top: 0pt; margin-bottom: 12pt;\"><span style=\"color: #000000; background-color: transparent; font-weight: 400; font-style: normal; font-variant: normal; text-decoration: none; vertical-align: baseline; white-space: pre-wrap;\">Build relationships with your team and customers</span></p>\n</li>\n</ul>\n<p dir=\"ltr\" style=\"line-height: 1.38; margin-top: 12pt; margin-bottom: 12pt;\"><span style=\"color: #000000; background-color: transparent; font-weight: bold; font-style: normal; font-variant: normal; text-decoration: none; vertical-align: baseline; white-space: pre-wrap;\">Days 31-60: Execute &amp; Own</span></p>\n<ul style=\"\">\n<li dir=\"ltr\" style=\"\">\n<p dir=\"ltr\" style=\"line-height: 1.38; margin-top: 12pt; margin-bottom: 0pt;\"><span style=\"color: #000000; background-color: transparent; font-weight: 400; font-style: normal; font-variant: normal; text-decoration: none; vertical-align: baseline; white-space: pre-wrap;\">Take ownership of 1-2 customer accounts</span></p>\n</li>\n<li dir=\"ltr\" style=\"\">\n<p dir=\"ltr\" style=\"line-height: 1.38; margin-top: 0pt; margin-bottom: 0pt;\"><span style=\"color: #000000; background-color: transparent; font-weight: 400; font-style: normal; font-variant: normal; text-decoration: none; vertical-align: baseline; white-space: pre-wrap;\">Start managing freelance writers and content calendars</span></p>\n</li>\n<li dir=\"ltr\" style=\"\">\n<p dir=\"ltr\" style=\"line-height: 1.38; margin-top: 0pt; margin-bottom: 0pt;\"><span style=\"color: #000000; background-color: transparent; font-weight: 400; font-style: normal; font-variant: normal; text-decoration: none; vertical-align: baseline; white-space: pre-wrap;\">Present your first performance reports to customers</span></p>\n</li>\n<li dir=\"ltr\" style=\"\">\n<p dir=\"ltr\" style=\"line-height: 1.38; margin-top: 0pt; margin-bottom: 12pt;\"><span style=\"color: #000000; background-color: transparent; font-weight: 400; font-style: normal; font-variant: normal; text-decoration: none; vertical-align: baseline; white-space: pre-wrap;\">Contribute to team meetings and internal initiatives</span></p>\n</li>\n</ul>\n<p dir=\"ltr\" style=\"line-height: 1.38; margin-top: 12pt; margin-bottom: 12pt;\"><span style=\"color: #000000; background-color: transparent; font-weight: bold; font-style: normal; font-variant: normal; text-decoration: none; vertical-align: baseline; white-space: pre-wrap;\">Days 61-90: Drive Impact</span></p>\n<ul style=\"\">\n<li dir=\"ltr\" style=\"\">\n<p dir=\"ltr\" style=\"line-height: 1.38; margin-top: 12pt; margin-bottom: 0pt;\"><span style=\"color: #000000; background-color: transparent; font-weight: 400; font-style: normal; font-variant: normal; text-decoration: none; vertical-align: baseline; white-space: pre-wrap;\">Own content execution for 3-4 customer accounts</span></p>\n</li>\n<li dir=\"ltr\" style=\"\">\n<p dir=\"ltr\" style=\"line-height: 1.38; margin-top: 0pt; margin-bottom: 0pt;\"><span style=\"color: #000000; background-color: transparent; font-weight: 400; font-style: normal; font-variant: normal; text-decoration: none; vertical-align: baseline; white-space: pre-wrap;\">Lead strategy refinements based on data</span></p>\n</li>\n<li dir=\"ltr\" style=\"\">\n<p dir=\"ltr\" style=\"line-height: 1.38; margin-top: 0pt; margin-bottom: 0pt;\"><span style=\"color: #000000; background-color: transparent; font-weight: 400; font-style: normal; font-variant: normal; text-decoration: none; vertical-align: baseline; white-space: pre-wrap;\">Share your expertise and improve our processes</span></p>\n</li>\n<li dir=\"ltr\" style=\"\">\n<p dir=\"ltr\" style=\"line-height: 1.38; margin-top: 0pt; margin-bottom: 12pt;\"><span style=\"color: #000000; background-color: transparent; font-weight: 400; font-style: normal; font-variant: normal; text-decoration: none; vertical-align: baseline; white-space: pre-wrap;\">Demonstrate measurable improvements in content performance for your customers</span></p>\n</li>\n</ul>\n<p class=\"h2\" dir=\"ltr\" style=\"line-height: 1.38; margin-top: 18pt; margin-bottom: 6pt;\"><span style=\"color: #000000; background-color: transparent; font-weight: 400; font-style: normal; font-variant: normal; text-decoration: none; vertical-align: baseline; white-space: pre-wrap;\">Working Arrangements</span></p>\n<p dir=\"ltr\" style=\"line-height: 1.38; margin-top: 0pt; margin-bottom: 0pt;\"><span style=\"color: #000000; background-color: transparent; font-weight: bold; font-style: normal; font-variant: normal; text-decoration: none; vertical-align: baseline; white-space: pre-wrap;\">Location:</span><span style=\"color: #000000; background-color: transparent; font-weight: 400; font-style: normal; font-variant: normal; text-decoration: none; vertical-align: baseline; white-space: pre-wrap;\"> Fully remote, anywhere in the world  </span></p>\n<p dir=\"ltr\" style=\"line-height: 1.38; margin-top: 0pt; margin-bottom: 0pt;\"><span style=\"color: #000000; background-color: transparent; font-weight: bold; font-style: normal; font-variant: normal; text-decoration: none; vertical-align: baseline; white-space: pre-wrap;\">Timezone Requirements:</span><span style=\"color: #000000; background-color: transparent; font-weight: 400; font-style: normal; font-variant: normal; text-decoration: none; vertical-align: baseline; white-space: pre-wrap;\"> We ask for at least 4 hours of overlap with US timezones (EST/PST) to collaborate effectively with our team and customers</span></p>\n<p class=\"h2\" dir=\"ltr\" style=\"line-height: 1.38; margin-top: 18pt; margin-bottom: 6pt;\"><span style=\"color: #000000; background-color: transparent; font-weight: 400; font-style: normal; font-variant: normal; text-decoration: none; vertical-align: baseline; white-space: pre-wrap;\">Compensation &amp; Benefits</span></p>\n<p dir=\"ltr\" style=\"line-height: 1.38; margin-top: 12pt; margin-bottom: 12pt;\"><span style=\"color: #000000; background-color: transparent; font-weight: bold; font-style: normal; font-variant: normal; text-decoration: none; vertical-align: baseline; white-space: pre-wrap;\">Salary Range</span><span style=\"color: #000000; background-color: transparent; font-weight: 400; font-style: normal; font-variant: normal; text-decoration: none; vertical-align: baseline; white-space: pre-wrap;\">: $70,000 - $85,000 USD annually</span></p>\n<p dir=\"ltr\" style=\"line-height: 1.38; margin-top: 12pt; margin-bottom: 12pt;\"><span style=\"color: #000000; background-color: transparent; font-weight: 400; font-style: normal; font-variant: normal; text-decoration: none; vertical-align: baseline; white-space: pre-wrap;\">This role offers competitive compensation with placement within the range based on experience, skills, and demonstrated impact in previous content marketing roles.</span></p>\n<ul style=\"\">\n<li dir=\"ltr\" style=\"\">\n<p dir=\"ltr\" style=\"line-height: 1.38; margin-top: 0pt; margin-bottom: 0pt;\"><span style=\"color: #000000; background-color: transparent; font-weight: 400; font-style: normal; font-variant: normal; text-decoration: none; vertical-align: baseline; white-space: pre-wrap;\">Health &amp; vision insurance (or wellness stipend for non-US team members)</span></p>\n</li>\n<li dir=\"ltr\" style=\"\">\n<p dir=\"ltr\" style=\"line-height: 1.38; margin-top: 0pt; margin-bottom: 0pt;\"><span style=\"color: #000000; background-color: transparent; font-weight: 400; font-style: normal; font-variant: normal; text-decoration: none; vertical-align: baseline; white-space: pre-wrap;\">401(k) retirement plan (US only)</span></p>\n</li>\n<li dir=\"ltr\" style=\"\">\n<p dir=\"ltr\" style=\"line-height: 1.38; margin-top: 0pt; margin-bottom: 0pt;\"><span style=\"color: #000000; background-color: transparent; font-weight: 400; font-style: normal; font-variant: normal; text-decoration: none; vertical-align: baseline; white-space: pre-wrap;\">Unlimited PTO policy</span></p>\n</li>\n<li dir=\"ltr\" style=\"\">\n<p dir=\"ltr\" style=\"line-height: 1.38; margin-top: 0pt; margin-bottom: 0pt;\"><span style=\"color: #000000; background-color: transparent; font-weight: 400; font-style: normal; font-variant: normal; text-decoration: none; vertical-align: baseline; white-space: pre-wrap;\">Flexible working schedule</span></p>\n</li>\n<li dir=\"ltr\" style=\"\">\n<p dir=\"ltr\" style=\"line-height: 1.38; margin-top: 0pt; margin-bottom: 0pt;\"><span style=\"color: #000000; background-color: transparent; font-weight: 400; font-style: normal; font-variant: normal; text-decoration: none; vertical-align: baseline; white-space: pre-wrap;\">Team lunch stipend</span></p>\n</li>\n</ul>\n<p class=\"h2\" dir=\"ltr\" style=\"line-height: 1.38; margin-top: 18pt; margin-bottom: 6pt;\"><span style=\"color: #000000; background-color: transparent; font-weight: 400; font-style: normal; font-variant: normal; text-decoration: none; vertical-align: baseline; white-space: pre-wrap;\">Diversity, Equity &amp; Inclusion</span></p>\n<p dir=\"ltr\" style=\"line-height: 1.38; margin-top: 0pt; margin-bottom: 0pt;\"><span style=\"color: #000000; background-color: transparent; font-weight: 400; font-style: normal; font-variant: normal; text-decoration: none; vertical-align: baseline; white-space: pre-wrap;\">At Animalz, we believe diverse perspectives make us stronger. We're committed to building an inclusive workplace where people of all backgrounds, experiences, and identities can thrive. We particularly encourage applications from historically underrepresented groups in tech and marketing, including people of color, women, LGBTQ+ individuals, people with disabilities, and those from varied socioeconomic backgrounds.</span></p>\n<p class=\"h2\" dir=\"ltr\" style=\"line-height: 1.38; margin-top: 18pt; margin-bottom: 6pt;\"><span style=\"color: #000000; background-color: transparent; font-weight: 400; font-style: normal; font-variant: normal; text-decoration: none; vertical-align: baseline; white-space: pre-wrap;\">Equal Opportunity</span></p>\n<p dir=\"ltr\" style=\"line-height: 1.38; margin-top: 0pt; margin-bottom: 0pt;\"><span style=\"color: #000000; background-color: transparent; font-weight: 400; font-style: normal; font-variant: normal; text-decoration: none; vertical-align: baseline; white-space: pre-wrap;\">Animalz is an equal opportunity employer. We do not discriminate based on race, religion, color, national origin, sex, sexual orientation, gender identity, age, status as a protected veteran, status as an individual with a disability, or other applicable legally protected characteristics.</span></p>\n<p><span style=\"color: #000000; background-color: transparent; font-weight: 400; font-style: normal; font-variant: normal; text-decoration: none; vertical-align: baseline; white-space: pre-wrap;\"> </span></p>\n<p><span style=\"color: #000000; background-color: transparent; font-weight: 400; font-style: normal; font-variant: normal; text-decoration: none; vertical-align: baseline; white-space: pre-wrap;\">We're excited to meet you!</span></p>\n<img src=\"https://remotive.com/job/track/2007322/blank.gif?source=public_api\" alt=\"\"/>","tags":"[\"saas\",\"seo\",\"AI/ML\",\"content marketing\",\"analytics\",\"google analytics\",\"content strategy\",\"editing\",\"amplitude\",\"onboarding\",\"hubspot\",\"testing\",\"diversity\",\"insurance\"]","pubDate":"2025-05-09T11:08:33.000Z","link":"https://remotive.com/remote-jobs/marketing/senior-content-marketer-2007322","slug":"senior-content-marketer-animalz-4890"}]