[{"id":1039783629,"title":"CUSTOMER SUCCESS OPERATIONS ANALYST (Work from anywhere in the world)","company":"Wishpond","image":"https://scontent.fcmb4-2.fna.fbcdn.net/v/t39.30808-6/273499217_5218973671480777_3308731762242867065_n.jpg?_nc_cat=110&ccb=1-7&_nc_sid=efb6e6&_nc_ohc=YDi_Wd17RD8AX9wXcyR&_nc_zt=23&_nc_ht=scontent.fcmb4-2.fna&oh=00_AfB4sOOYpj6VyDSuvvuqhVnZbH22m89SqG99HwaOa-uslw&oe=65BE4336","description":"<div><b style=\"font-size: 18px\">Wishpond Technologies currently has the position of CUSTOMER SUCCESS OPERATIONS ANALYST available and we’re excited to tell you about it !</b></div><div><br></div><div><b style=\"font-size: 24px\">OVERVIEW</b></div><div><span style=\"font-size: 16px\">The Customer Success Operations Analyst will be focusing on the technical and behavioral development of the Customer Success and Customer Support teams, for all Wishpond products. Their main goal will be ensuring process efficiency by improving all practices that impact the customer experience and the team’s performance. It is their direct responsibility to ensure that the teams have the proper knowledge to know what and how to do in their daily activities, including proficiency in the service models, retention and expansion processes, tools, etc.</span></div><div><br></div><div><b style=\"font-size: 24px\">RESPONSIBILITIES</b></div><div>• <span style=\"font-size: 16px\">Review all Customer Success and Support processes to identify improvement opportunities that might leverage the team’s performance.</span></div><div>• <span style=\"font-size: 16px\">Help define system requirements for the Customer Success and Support departments.</span></div><div>• <span style=\"font-size: 16px\">Support system implementation for the Customer Success and Support departments.</span></div><div>•<span style=\"font-size: 16px\">Review and update system’s settings and requirements, ensuring their full functionality and best efficiency.</span></div><div>• <span style=\"font-size: 16px\">Support the dispute and the delinquency mitigation processes by ensuring that all systems are fully effective and that all team members have the necessary information on time.</span></div><div>• <span style=\"font-size: 16px\">Work closely with the Customer Education Analyst to ensure that all one-to-many customer education activities are executed properly and achieve the best possible results.</span></div><div>• <span style=\"font-size: 16px\">Review retention cases and identify best practices and improvement opportunities.</span></div><div>• <span style=\"font-size: 16px\">Support the execution of the expansion and retention pipelines, ensuring the achievement of the established goals, the reliability of information in the pipelines and the resolution of cases in the pipelines within deadlines and in line with the expected quality.</span></div><div>• <span style=\"font-size: 16px\">Keep track of the preventive and corrective action taken by Customer Success Analysts.</span></div><div>• <span style=\"font-size: 16px\">Define or review processes related to revenue expansion and retention, in order to make operations more efficient and customer-oriented.</span></div><div>•<span style=\"font-size: 16px\">Generate data and perform segmented performance analysis (by SaaS product, customer tier, service, period, etc), contributing to the refinement of the company's commercial strategy.</span></div><div>•<span style=\"font-size: 16px\">Develop product and service training programs for all team members.</span></div><div>•<span style=\"font-size: 16px\">Help define performance KPIs for all team members according to the role of the customer journey and career path level.</span></div><div>•<span style=\"font-size: 16px\">Help define onboarding milestones and certification programs for team members.</span></div><div>• <span style=\"font-size: 16px\">If necessary, assist the Support Rep to answer customer requests and lead customer training sessions.</span></div><div>• <span style=\"font-size: 16px\">Other duties as assigned.</span></div><div><br></div><div><b style=\"font-size: 24px\">QUALIFICATIONS</b></div><div>• <span style=\"font-size: 16px\">1+ year of experience in a Customer Operations role or similar back office position in a customer-facing department, preferably in a SaaS organization.</span></div><div>• <span style=\"font-size: 16px\">Digital Marketing knowledge, including paid Ads, landing page optimization, email marketing and social media, is considered an asset.</span></div><div>• <span style=\"font-size: 16px\">Strong project management skills, including the ability to scope projects, create and execute project plans, and manage multiple priorities and deadlines.</span></div><div>• <span style=\"font-size: 16px\">Fluent in English (spoken and written). Knowledge of a second language is considered an asset.</span></div><div>• <span style=\"font-size: 16px\">Experience working with a range of customer demographics, knowledge and understanding of adult learning principles.</span></div><div>• <span style=\"font-size: 16px\">Ability to communicate effectively with customers, cross-functional teams, and other stakeholders.</span></div><div>• <span style=\"font-size: 16px\">Strong organizational and time management skills.</span></div><div>• <span style=\"font-size: 16px\">Strong commitment to continuous learning and skill development.</span></div><div>• <span style=\"font-size: 16px\">A degree or diploma that contributes to the organization or role is considered an asset.</span></div><div>• <span style=\"font-size: 16px\">Self-motivated with the ability to establish and maintain solid relationships through a client-first mentality.</span></div><div>• <span style=\"font-size: 16px\">As part of a diverse team, ability to work both independently and collaboratively.</span></div><div>• <span style=\"font-size: 16px\">Must be technical, analytical, results-driven and have the ability to multi-task in a fast-paced environment.</span></div><div>• <span style=\"font-size: 16px\">Organized, administratively strong, and have solid writing, phone, and general communication skills.</span></div><div>• <span style=\"font-size: 16px\">Willing to participate in ongoing education and training for the role.</span></div><div><br></div><div><b style=\"font-size: 16px\">Bonus skills:</b></div><div>• <span style=\"font-size: 16px\">Experience with other marketing automation platforms</span></div><div>• <span style=\"font-size: 16px\">Knowledge of CRM platforms</span></div><div><br></div><div><b style=\"font-size: 24px\">WORK ENVIRONMENT</b></div><div><span style=\"font-size: 16px\">• It is expected that the successful candidate will provide their own workstation, computer, and headset, and have a fast and reliable internet connection.&nbsp;Certain roles will be required to utilize and or download company-approved software.</span></div><div><span style=\"font-size: 16px\">• The individual must be prepared to work standard business hours on EST or PST</span></div><div><span style=\"font-size: 16px\">• Due to the nature of this role, we may verify backgrounds including conducting employment references, criminal record, and credit checks.</span></div><div><span style=\"font-size: 16px\">• Once hired, the successful candidate must provide a valid government-issued photo ID and proof of residential address as part of their onboarding process.</span></div><div><br></div><div><b style=\"font-size: 24px\">GREAT REASONS TO JOIN OUR TEAM !</b></div><div><span style=\"font-size: 16px\">• Fully remote position allowing you to </span><b style=\"font-size: 16px\">work from your home anywhere in the world !</b></div><div><span style=\"font-size: 16px\">• Exciting and dynamic environment with a great leadership team&nbsp;</span></div><div><span style=\"font-size: 16px\">• Comprehensive training program and regular performance reviews to facilitate your success</span></div><div><span style=\"font-size: 16px\">• Competitive compensation based on experience and proven abilities</span></div><div><span style=\"font-size: 16px\">• Great referral programs with incentives and bonuses</span></div><div><span style=\"font-size: 16px\">• Unbelievable product discounts when you use our products for your own business</span></div><div><span style=\"font-size: 16px\">• A global workforce of multi-cultural and talented colleagues&nbsp;</span></div><div><span style=\"font-size: 16px\">• A close-knit operation with amazing growth opportunities for your personal development</span></div><div><span style=\"font-size: 16px\">• A high growth SaaS technology company publicly traded on the TSX Venture Exchange</span></div><div><span style=\"font-size: 16px\">• Corporate headquarters in beautiful Vancouver, British Columbia, Canada</span></div><div><span style=\"font-size: 16px\">• Access to our education credits program and so much more !</span></div><div><br></div><div><b style=\"font-size: 24px\">ABOUT US</b></div><div><span style=\"font-size: 16px\">Founded in 2009, Wishpond is a rapidly growing technology company providing digital marketing solutions targeted at small businesses.&nbsp; The cloud-based platform includes landing pages, social promotions, website pop-ups, online forms, and lead activity tracking. Wishpond has a dedicated team of professional project managers, designers, copywriters, and developers who provide marketing services tailored to our individual clients.</span></div><div><span style=\"font-size: 16px\">&nbsp;</span></div><div><span style=\"font-size: 16px\">Wishpond serves over 3,000 customers in various industries and sizes, from startups to large Fortune 500 companies. Wishpond has a rapidly growing global headcount and continues to hire dedicated and qualified employees and contractors who have what it takes to scale a successful software company.</span></div><div><br></div><div><span style=\"font-size: 16px\">To learn more about Wishpond Technologies, please visit our website or any of our social media platforms:</span></div><div><br></div><div><span style=\"font-size: 16px\">• Website: </span><a href=\"http://www.wishpond.com/\" style=\"font-size: 16px\" class=\"postings-link\">www.wishpond.com</a></div><div><span style=\"font-size: 16px\">• Instagram: @wishpondofficial</span></div><div><span style=\"font-size: 16px\">• Twitter: Wishpond</span></div><div><span style=\"font-size: 16px\">• Youtube: Thewishpond</span></div><div><span style=\"font-size: 16px\">• LinkedIn : Wishpond</span></div><div><br></div><div><b style=\"font-size: 24px\">APPLICATION PROCESS</b></div><div><b style=\"font-size: 16px\">If you are interested in applying for this exciting opportunity, please provide an updated resume in English (PDF or Word formats only), quoting the position title in the subject line of your cover letter</b></div><div><span style=\"font-size: 16px\">&nbsp;</span><b style=\"font-size: 16px\">&nbsp;</b></div><div><span style=\"font-size: 16px\">Wishpond Technologies is an equal-opportunity employer committed to hiring a diverse workforce and sustaining an inclusive culture that does not discriminate on the basis of disability, status, or any other basis protected under legislation</span></div><div><span style=\"font-size: 16px\">&nbsp;</span></div><div><span style=\"font-size: 16px\">We thank all applicants in advance for their interest in this position however due to the volume of applications we receive, we are unable to respond to phone, email, or agency inquiries.</span></div>","tags":"[\"management\"]","pubDate":"2024-01-23 22:42:48.353","link":"https://jobs.lever.co/wishpond/b2d64371-f984-4cdd-a2b1-74fedf485801","savedDate":"2024-01-31 09:15:11.985","slug":"customer-success-operations-analyst-work-from-anywhere-in-the-world-wishpond-2051"},{"id":1874297460,"title":"CUSTOMER EDUCATION ANALYST (Work from anywhere in the world)","company":"Wishpond","image":"https://scontent.fcmb4-2.fna.fbcdn.net/v/t39.30808-6/273499217_5218973671480777_3308731762242867065_n.jpg?_nc_cat=110&ccb=1-7&_nc_sid=efb6e6&_nc_ohc=YDi_Wd17RD8AX9wXcyR&_nc_zt=23&_nc_ht=scontent.fcmb4-2.fna&oh=00_AfB4sOOYpj6VyDSuvvuqhVnZbH22m89SqG99HwaOa-uslw&oe=65BE4336","description":"<div><b style=\"font-size: 18px\">Wishpond Technologies currently has the position of Customer Education Analyst available and we’re excited to tell you about it!</b></div><div><br></div><div><b style=\"font-size: 24px\">OVERVIEW</b></div><div><span style=\"font-size: 16px\">The Customer Education Analyst for the Low Touch service model is responsible for the definition and execution of all one-to-many initiatives, including engagement strategies to boost product usage and to increase the knowledge level of clients regarding digital marketing (methodologies, disciplines, tools, etc). This role is also responsible to help define strategies and actions to improve client retention (churn mitigation), expansion (upsell + cross-sells) and risk prevention (identification and correction of specific bottlenecks/red flags that may lead to churn if not properly treated), as well as Voice of Customer initiatives. The Customer Education Analyst for the Low Touch service model will work with low touch and self service clients.</span></div><div><br></div><div><b style=\"font-size: 24px\">RESPONSIBILITIES</b></div><div>•<span style=\"font-size: 16px\">Help identify key client needs, product usage and customer performance data that will serve as the basis for all initiatives targeting low touch and self service clients.</span></div><div>• <span style=\"font-size: 16px\">Lead the creation of a training program for low-touch and self-service customers by helping define training scope and agenda, target audience, KPIs, surveys, etc.</span></div><div>• <span style=\"font-size: 16px\">Define all knowledge and education trails necessary to properly enable all low touch and self service clients to use Wishpond products while improving their digital marketing expertise over time.</span></div><div>• <span style=\"font-size: 16px\">Define the calendar for all training, engagement campaigns and assessments/surveys targeting low touch and self service clients.</span></div><div>• <span style=\"font-size: 16px\">Create and execute project plans that encompass the creation of all content necessary to build the knowledge and education trails.</span></div><div>• <span style=\"font-size: 16px\">Engage internal stakeholders to support the creation of all knowledge and education trails while following up to ensure that all deliveries are on time (including their attendance to training sessions that they will lead).</span></div><div>• <span style=\"font-size: 16px\">Support the creation of content for all knowledge and education trails (including training materials, engagement email campaigns, etc), as necessary.</span></div><div>• <span style=\"font-size: 16px\">Prepare and enable trainers/presenters to ensure their best performance while leading training sessions for clients.</span></div><div>• <span style=\"font-size: 16px\">Lead training sessions for clients, if necessary.</span></div><div>• <span style=\"font-size: 16px\">Support the creation of retention and expansion strategies to mitigate churn and develop revenue growth opportunities.</span></div><div>• <span style=\"font-size: 16px\">Support the creation of the Voice of Customer program, that aims to collect customer feedback and turn it into relevant business insights, by helping define what will be recurring and transactional surveys and helping execute them, if necessary.</span></div><div>• <span style=\"font-size: 16px\">Coordinate the customer feedback gathering processes, surveying customers in different stages of their life cycle, ensuring preventive and corrective action and providing reports to the company.</span></div><div>• <span style=\"font-size: 16px\">Define or review processes related to customer experience, ensuring that the survey methodologies are aligned with the stages of the journey (customer life cycle) and that risks and opportunities identified are handled properly.</span></div><div>• <span style=\"font-size: 16px\">Analyze product usage and customer performance data to identify use behaviors, retention risks and growth opportunities in the customer base.</span></div><div><br></div><div><b style=\"font-size: 24px\">QUALIFICATIONS</b></div><div>• <span style=\"font-size: 16px\">2+ years of experience in a Customer Marketing/Education role, preferably in a SaaS organization.</span></div><div>• <span style=\"font-size: 16px\">Digital Marketing knowledge, including paid Ads, landing page optimization, email marketing and social media is considered an asset.</span></div><div>• <span style=\"font-size: 16px\">Strong project management skills, including the ability to scope projects, create and execute project plans, and manage multiple priorities and deadlines.</span></div><div>• <span style=\"font-size: 16px\">Fluent in English (spoken and written). Knowledge of a second language is considered an asset.</span></div><div>• <span style=\"font-size: 16px\">Experience working with a range of customer demographics, knowledge and understanding of adult learning principles.</span></div><div>• <span style=\"font-size: 16px\">Ability to communicate effectively with customers, cross-functional teams, and other stakeholders.</span></div><div>• <span style=\"font-size: 16px\">Strong organizational and time management skills.</span></div><div>• <span style=\"font-size: 16px\">Strong commitment to continuous learning and skill development.</span></div><div>• <span style=\"font-size: 16px\">A degree or diploma that contributes to the organization or role is considered an asset.</span></div><div>• <span style=\"font-size: 16px\">Self-motivated with the ability to establish and maintain solid relationships through a client-first mentality.</span></div><div>• <span style=\"font-size: 16px\">As part of a diverse team, ability to work both independently and collaboratively.</span></div><div>• <span style=\"font-size: 16px\">Must be technical, analytical, results-driven and have the ability to multi-task in a fast-paced environment.</span></div><div>• <span style=\"font-size: 16px\">Organized, administratively strong, and have solid writing, phone, and general communication </span><a href=\"http://skills.Experience\" style=\"font-size: 16px\" class=\"postings-link\">skills.</a></div><div>• <span style=\"font-size: 16px\">Experience using Shopify is preferred.</span></div><div>• <span style=\"font-size: 16px\">Willing to participate in ongoing education and training for the role.</span></div><div><b style=\"font-size: 16px\">Bonus skills:</b><span style=\"font-size: 16px\">&nbsp;</span></div><div>• <span style=\"font-size: 16px\">Experience with other marketing automation platforms</span></div><div>• <span style=\"font-size: 16px\">Knowledge of CRM platforms</span></div><div><br></div><div><b style=\"font-size: 24px\">WORK ENVIRONMENT</b></div><div><span style=\"font-size: 16px\">• It is expected that the successful candidate will provide their own workstation, computer, and headset, and have a fast and reliable internet connection.&nbsp;Certain roles will be required to utilize and or download company-approved software.</span></div><div><span style=\"font-size: 16px\">• The individual must be prepared to work standard business hours on EST or PST</span></div><div><span style=\"font-size: 16px\">• Due to the nature of this role, we may verify backgrounds including conducting employment references, criminal record, and credit checks.</span></div><div><span style=\"font-size: 16px\">• Once hired, the successful candidate must provide a valid government-issued photo ID and proof of residential address as part of their onboarding process.</span></div><div><br></div><div><b style=\"font-size: 24px\">GREAT REASONS TO JOIN OUR TEAM !</b></div><div><span style=\"font-size: 16px\">• Fully remote position allowing you to </span><b style=\"font-size: 16px\">work from your home anywhere in the world !</b></div><div><span style=\"font-size: 16px\">• Exciting and dynamic environment with a great leadership team&nbsp;</span></div><div><span style=\"font-size: 16px\">• Comprehensive training program and regular performance reviews to facilitate your success</span></div><div><span style=\"font-size: 16px\">• Competitive compensation based on experience and proven abilities</span></div><div><span style=\"font-size: 16px\">• Great referral programs with incentives and bonuses</span></div><div><span style=\"font-size: 16px\">• Unbelievable product discounts when you use our products for your own business</span></div><div><span style=\"font-size: 16px\">• A global workforce of multi-cultural and talented colleagues&nbsp;</span></div><div><span style=\"font-size: 16px\">• A close-knit operation with amazing growth opportunities for your personal development</span></div><div><span style=\"font-size: 16px\">• A high growth SaaS technology company publicly traded on the TSX Venture Exchange</span></div><div><span style=\"font-size: 16px\">• Corporate headquarters in beautiful Vancouver, British Columbia, Canada</span></div><div><span style=\"font-size: 16px\">• Access to our education credits program and so much more !</span></div><div><br></div><div><b style=\"font-size: 24px\">ABOUT US</b></div><div><span style=\"font-size: 16px\">Founded in 2009, Wishpond is a rapidly growing technology company providing digital marketing solutions targeted at small businesses.&nbsp; The cloud-based platform includes landing pages, social promotions, website pop-ups, online forms, and lead activity tracking. Wishpond has a dedicated team of professional project managers, designers, copywriters, and developers who provide marketing services tailored to our individual clients.</span></div><div><span style=\"font-size: 16px\">&nbsp;</span></div><div><span style=\"font-size: 16px\">Wishpond serves over 3,000 customers in various industries and sizes, from startups to large Fortune 500 companies. Wishpond has a rapidly growing global headcount and continues to hire dedicated and qualified employees and contractors who have what it takes to scale a successful software company.</span></div><div><br></div><div><span style=\"font-size: 16px\">To learn more about Wishpond Technologies, please visit our website or any of our social media platforms:</span></div><div><br></div><div><span style=\"font-size: 16px\">• Website: </span><a href=\"http://www.wishpond.com/\" style=\"font-size: 16px\" class=\"postings-link\">www.wishpond.com</a></div><div><span style=\"font-size: 16px\">• Instagram: @wishpondofficial</span></div><div><span style=\"font-size: 16px\">• Twitter: Wishpond</span></div><div><span style=\"font-size: 16px\">• Youtube: Thewishpond</span></div><div><span style=\"font-size: 16px\">• LinkedIn : Wishpond</span></div><div><br></div><div><b style=\"font-size: 24px\">APPLICATION PROCESS</b></div><div><b>If you are interested in applying for this exciting opportunity, please provide an updated resume in English (PDF or Word formats only), quoting the position title in the subject line of your cover letter</b></div><div>&nbsp;<b>&nbsp;</b></div><div>Wishpond Technologies is an equal-opportunity employer committed to hiring a diverse workforce and sustaining an inclusive culture that does not discriminate on the basis of disability, status, or any other basis protected under legislation</div><div>&nbsp;</div><div>We thank all applicants in advance for their interest in this position however due to the volume of applications we receive, we are unable to respond to phone, email, or agency inquiries.</div><div><br></div>","tags":"[\"management\"]","pubDate":"2024-01-10 19:58:25.927","link":"https://jobs.lever.co/wishpond/8dcc4c0d-20cd-41d1-81b2-9e6da4adc24a","savedDate":"2024-01-31 09:15:11.984","slug":"customer-education-analyst-work-from-anywhere-in-the-world-wishpond-1868"}]