[{"id":5387403424,"title":"Senior AML Analyst","company":"Sardine","image":"https://avatars.githubusercontent.com/u/65879301?s=200&v=4","description":"<p style=\"min-height:1.5em\"><strong>Who we are:</strong></p><p style=\"min-height:1.5em\">We are a leader in fraud prevention and AML compliance. Our platform uses device intelligence, behavior biometrics, machine learning, and AI to stop fraud before it happens. Today, over 300 banks, retailers, and fintechs worldwide use Sardine to stop identity fraud, payment fraud, account takeovers, and social engineering scams. We have raised $145M from world-class investors, including Andreessen Horowitz, Activant, Visa, Experian, FIS, and Google Ventures.</p><p style=\"min-height:1.5em\"></p><p style=\"min-height:1.5em\"><strong>Our culture:</strong></p><ul style=\"min-height:1.5em\"><li><p style=\"min-height:1.5em\">We have hubs in the Bay Area, NYC, Austin, and Toronto. However, we maintain a remote-first work culture. #WorkFromAnywhere</p></li><li><p style=\"min-height:1.5em\">We hire talented, self-motivated individuals with extreme ownership and high growth orientation. </p></li><li><p style=\"min-height:1.5em\">We value performance and not hours worked. We believe you shouldn't have to miss your family dinner, your kid's school play, friends get-together, or doctor's appointments for the sake of adhering to an arbitrary work schedule.</p></li></ul><p style=\"min-height:1.5em\"></p><p style=\"min-height:1.5em\"><strong>Location:</strong></p><ul style=\"min-height:1.5em\"><li><p style=\"min-height:1.5em\">This role is fully remote and must be located in Lithuania.</p></li><li><p style=\"min-height:1.5em\">From Home / Beach / Mountain / Cafe / Anywhere!</p></li><li><p style=\"min-height:1.5em\">We are a remote-first company with a globally distributed team. You can find your productive zone and work from there.</p></li></ul><p style=\"min-height:1.5em\"></p><p style=\"min-height:1.5em\"><strong>About the Role</strong></p><p style=\"min-height:1.5em\">We’re hiring a Senior AML Analyst to lead investigations, manage compliance operations, and ensure our EU program meets all regulatory expectations. This role will focus on crypto and fiat transaction monitoring for our payments business and ensure our compliance framework aligns with evolving EU regulations. You’ll also collaborate with product, engineering, and sales to support Sardine’s compliance platform and assist EU-based clients. </p><p style=\"min-height:1.5em\"></p><p style=\"min-height:1.5em\"><em><strong>This is a 6-month contract role (part-time or full-time), with the potential to extend based on business needs.</strong></em></p><p style=\"min-height:1.5em\"></p><p style=\"min-height:1.5em\"><strong>What you’ll be doing</strong></p><ul style=\"min-height:1.5em\"><li><p style=\"min-height:1.5em\">Investigate suspicious crypto and fiat activity; submit UARs when needed</p></li><li><p style=\"min-height:1.5em\">Manage sanctions/PEP screening, adverse media reviews, and EDD for high-risk users and partners</p></li><li><p style=\"min-height:1.5em\">Ensure timely resolution of compliance tickets and support Customer Support escalations</p></li><li><p style=\"min-height:1.5em\">Maintain EU-specific AML/CTF policies, procedures, and risk assessments</p></li><li><p style=\"min-height:1.5em\">Track regulatory developments (e.g. MiCA) and assist with licensing prep</p></li><li><p style=\"min-height:1.5em\">Collaborate with product, engineering, and sales to support compliance capabilities and EU-based clients</p><p style=\"min-height:1.5em\"></p></li></ul><p style=\"min-height:1.5em\"><strong>What you’ll need </strong></p><ul style=\"min-height:1.5em\"><li><p style=\"min-height:1.5em\">5+ years in AML, including 2+ in blockchain investigations</p></li><li><p style=\"min-height:1.5em\">Strong understanding of EU AML/CTF frameworks and digital asset compliance</p></li><li><p style=\"min-height:1.5em\">Experience with blockchain analytics tools (e.g. TRM, Chainalysis) and proficiency in SQL</p></li><li><p style=\"min-height:1.5em\">CAMS or equivalent certification preferred</p></li></ul><p style=\"min-height:1.5em\"></p><p style=\"min-height:1.5em\"><strong>Compensation: </strong>4,000-5,300 EUROS paid monthly (full-time; 40 hours/week)</p><p style=\"min-height:1.5em\"></p><p style=\"min-height:1.5em\">The compensation offered for this role will depend on various factors, including the candidate's location, qualifications, work history, and interview performance, and may differ from the stated range.</p><p style=\"min-height:1.5em\"></p><p style=\"min-height:1.5em\"><strong>Benefits we offer:</strong></p><ul style=\"min-height:1.5em\"><li><p style=\"min-height:1.5em\">Generous compensation in cash and equity</p></li><li><p style=\"min-height:1.5em\">Early exercise for all options, including pre-vested</p></li><li><p style=\"min-height:1.5em\">Work from anywhere: Remote-first Culture</p></li><li><p style=\"min-height:1.5em\">Flexible paid time off, Year-end break, Self care days off</p></li><li><p style=\"min-height:1.5em\">Health insurance, dental, and vision coverage for employees and dependents - <em>US and Canada specific</em></p></li><li><p style=\"min-height:1.5em\">4% matching in 401k / RRSP - <em>US and Canada specific</em></p></li><li><p style=\"min-height:1.5em\">MacBook Pro delivered to your door</p></li><li><p style=\"min-height:1.5em\">One-time stipend to set up a home office — desk, chair, screen, etc.</p></li><li><p style=\"min-height:1.5em\">Monthly meal stipend</p></li><li><p style=\"min-height:1.5em\">Monthly social meet-up stipend</p></li><li><p style=\"min-height:1.5em\">Annual health and wellness stipend</p></li><li><p style=\"min-height:1.5em\">Annual Learning stipend</p></li><li><p style=\"min-height:1.5em\">Unlimited access to an expert financial advisory</p></li></ul><p style=\"min-height:1.5em\"></p><p style=\"min-height:1.5em\">Join a fast-growing company with world-class professionals from around the world. If you are seeking a meaningful career, you found the right place, and we would love to hear from you.</p><p style=\"min-height:1.5em\"></p><p style=\"min-height:1.5em\"><em>To learn more about how we process your personal information and your rights in regards to your personal information as an applicant and Sardine employee, please visit our </em><a target=\"_blank\" rel=\"noopener noreferrer nofollow\" class=\"text-link-blue\" href=\"https://www.sardine.ai/applicant-and-worker-privacy-notice\"><em>Applicant and Worker Privacy Notice</em></a><em>.</em></p>","tags":"[\"engineering\"]","pubDate":"2025-05-08T22:23:23.251Z","link":"https://jobs.ashbyhq.com/sardine/de3f269e-cde5-4ede-9d44-35f052fa13df","slug":"senior-aml-analyst-sardine-9999"},{"id":3498988262,"title":"Partnerships Development Manager - USA","company":"Supabase","image":"https://avatars.githubusercontent.com/u/54469796?s=200&v=4","description":"<p style=\"min-height:1.5em\">We are looking for a <strong>Partnerships Development Manager </strong>to lead our efforts in identifying, engaging, and scaling high-impact partnerships that drive revenue. This is a strategic, high-visibility role where you’ll work cross-functionally to define partnership models, explore whitespace opportunities, and engage with some of the most exciting companies in the tech landscape.</p><p style=\"min-height:1.5em\">This role is ideal for someone who thrives in ambiguity, has an entrepreneurial mindset, and is excited to be at the forefront of shaping Supabase’s market-facing strategy. </p><p style=\"min-height:1.5em\"></p><h3><strong>What You’ll Own:</strong></h3><ul style=\"min-height:1.5em\"><li><p style=\"min-height:1.5em\">Define and lead the strategic roadmap for partnerships and market development aligned with Supabase’s growth objectives.</p></li><li><p style=\"min-height:1.5em\">Identify and evaluate high-potential companies and technology partners—particularly those in the open-source, developer tools and startup ecosystems.</p></li><li><p style=\"min-height:1.5em\">Build and nurture revenue-generating partnerships, including affiliate programs and marketplace integrations.</p></li><li><p style=\"min-height:1.5em\">Craft and negotiate partnership models and terms that drive competitive differentiation and long-term value creation.</p></li><li><p style=\"min-height:1.5em\">Collaborate with Product, Marketing, and GTM teams to launch partner initiatives that increase customer adoption and engagement.</p></li><li><p style=\"min-height:1.5em\">Drive ongoing market analysis to surface new partnership opportunities and derisk strategic bets.</p></li><li><p style=\"min-height:1.5em\">Act as a thought leader internally and externally—representing Supabase in conversations with founders, VCs, and emerging tech leaders.</p></li></ul><h3><strong>Who You Are:</strong></h3><ul style=\"min-height:1.5em\"><li><p style=\"min-height:1.5em\">5+ years of experience in startup business development, strategic partnerships, corporate development, or venture capital. </p></li><li><p style=\"min-height:1.5em\">MBA or equivalent entrepreneurial/operator experience is strongly preferred.</p></li><li><p style=\"min-height:1.5em\">Deep understanding of the startup and developer ecosystems; familiarity with open-source business models and cloud infrastructure is a plus.</p></li><li><p style=\"min-height:1.5em\">Demonstrated ability to define strategy and execute with a high degree of autonomy.</p></li><li><p style=\"min-height:1.5em\">Experience designing and negotiating revenue-generating partnerships with a strong analytical foundation.</p></li><li><p style=\"min-height:1.5em\">Excellent communicator with the ability to engage with executive stakeholders and represent the company externally.</p></li><li><p style=\"min-height:1.5em\">Naturally curious, proactive, and energized by exploring new opportunities and building from zero-to-one.</p></li><li><p style=\"min-height:1.5em\">California, or west coast preferred. </p></li></ul><p style=\"min-height:1.5em\"></p><h3><strong>Why This Role is Different:</strong></h3><ul style=\"min-height:1.5em\"><li><p style=\"min-height:1.5em\"><strong>Chart Your Own Path:</strong> We’re at the cutting edge of open-source tech—this role offers the opportunity to define and execute a partnership strategy that shapes the future of Supabase and the broader ecosystem.</p></li><li><p style=\"min-height:1.5em\"><strong>High-Impact &amp; High-Visibility:</strong> Your work will directly drive revenue and influence how Supabase shows up in the market.</p></li><li><p style=\"min-height:1.5em\"><strong>Engage with the Next Generation:</strong> Work closely with startup founders, developer-first companies, and technical leaders who are building what’s next.</p></li><li><p style=\"min-height:1.5em\"><strong>Remote &amp; Global:</strong> Work from anywhere in the world with a team that values autonomy, trust, and flexibility.<br /></p></li></ul><h3><strong>We Offer:</strong></h3><ul style=\"min-height:1.5em\"><li><p style=\"min-height:1.5em\">100% remote work</p></li><li><p style=\"min-height:1.5em\">Autonomy to own your roadmap and execution.</p></li><li><p style=\"min-height:1.5em\">Comprehensive health, vision, and dental coverage.</p></li><li><p style=\"min-height:1.5em\">Generous tech and education allowances to support your growth.</p></li><li><p style=\"min-height:1.5em\">Annual off-sites with the global Supabase team.</p></li></ul><h2>About the team</h2><ul style=\"min-height:1.5em\"><li><p style=\"min-height:1.5em\">We're a startup. It's unstructured.</p></li><li><p style=\"min-height:1.5em\">Collectively founded more than 30 startups.</p></li><li><p style=\"min-height:1.5em\">Globally distributed team with more than 30 different nationalities.</p></li><li><p style=\"min-height:1.5em\">We deeply believe in <a target=\"_blank\" rel=\"noopener noreferrer nofollow\" href=\"https://supabase.com/blog/2022/03/25/should-i-open-source-my-company\">the efficacy of collaborative open source</a>. We support existing communities and tools, rather than building \"yet another xx\".</p></li><li><p style=\"min-height:1.5em\">We \"dogfood\" everything. If you use it in your project, we use it in Supabase.</p></li></ul><h2>Process</h2><ul style=\"min-height:1.5em\"><li><p style=\"min-height:1.5em\">The entire process is fully remote and all communication will happen over email or via video chat.</p></li><li><p style=\"min-height:1.5em\">Once you've submitted your application, the team will review your submission and may reach out for a short screening interview over a video call.</p></li><li><p style=\"min-height:1.5em\">If you pass the screen you will be invited to up to four follow-up interviews. </p></li><li><p style=\"min-height:1.5em\">The calls:</p><ul style=\"min-height:1.5em\"><li><p style=\"min-height:1.5em\">usually take between 20-45 minutes each depending on the interviewer.</p></li><li><p style=\"min-height:1.5em\">most of the time, are all 1:1.</p></li><li><p style=\"min-height:1.5em\">will be with the founders, a member of either the growth or engineering team (depending on the role) and usually one other person from your immediate team or function.</p></li></ul></li><li><p style=\"min-height:1.5em\">Once the interviews are over, the team will meet to discuss several roles and candidates and may:</p><ul style=\"min-height:1.5em\"><li><p style=\"min-height:1.5em\">ask one or two follow-up questions over email or a quick call.</p></li><li><p style=\"min-height:1.5em\">go directly to making an offer.</p></li></ul></li></ul>","tags":"[\"engineering\"]","pubDate":"2025-05-08T21:13:19.113Z","link":"https://jobs.ashbyhq.com/supabase/62277f1d-eea4-4a95-98d8-ea4487548635","slug":"partnerships-development-manager-usa-supabase-6288"},{"id":3872461540,"title":"Senior Full-stack Engineer, Applied AI","company":"Circle","image":"https://media.licdn.com/dms/image/v2/D4E0BAQGsuyBYT8Wy1A/company-logo_200_200/company-logo_200_200/0/1709246393415/circleco_logo?e=1746662400&v=beta&t=KH2t1NJ7bcXknchnvYTCh2X0_q0BdXf-vERJqIz2p1k","description":"&lt;div class=&quot;content-intro&quot;&gt;&lt;h2&gt;About Us&lt;/h2&gt;\n&lt;p&gt;Circle is building the world’s leading all-in-one platform for online communities. We make it possible for creators, coaches, educators, and businesses to bring together their audience with engaging discussions, live streams, events, chat, courses, and payments — all in one place, all under their own brand.&lt;/p&gt;\n&lt;p&gt;We’re proud to be a fully remote company of around 180 (and growing!) team members from 30+ countries around the world. We seek exceptional individuals around the world, set them up to do the best work of their lives, and in turn, create a meaningful impact in their own lives. We don&#39;t track hours, but we do manage for high expectations very closely. We collaborate across time zones, are highly async, and like to document a lot.&lt;/p&gt;\n&lt;p&gt;Twice a year, we bring the whole company together in beautiful places around the world for our company offsites. So far, we’ve hosted offsites in Turkey, Portugal, Mexico, Thailand, Colombia, Italy, Ireland, and more, with still more to come!&lt;/p&gt;&lt;/div&gt;&lt;h2&gt;About the role&lt;/h2&gt;\n&lt;p&gt;The Applied AI team at Circle is at the forefront of leveraging AI to drive innovation across our company.&lt;/p&gt;\n&lt;p&gt;We&#39;re looking for a Senior Full-stack Engineer, Applied AI, to help drive the development of AI solutions that enhance user experiences across our platform, both internally and externally.&lt;/p&gt;\n&lt;p&gt;If you&#39;re passionate about working on real production use cases of large language models (LLMs) and want to contribute to transformative AI applications, this role is for you.&lt;/p&gt;\n&lt;h2&gt;What you&#39;ll be doing&lt;/h2&gt;\n&lt;ul&gt;\n&lt;li&gt;Ship full-stack AI projects end to end - exciting projects such as AI Agents, Retrieval-Augmented Generation (RAG), Structured Extraction, internal tooling for customer-facing teams, and build infrastructure for LLM inference.&lt;/li&gt;\n&lt;li&gt;Help guide the end-to-end architecture and technical strategy for AI solutions.&lt;/li&gt;\n&lt;li&gt;Improve processes, tools, and systems to scale AI solutions across Circle.&lt;/li&gt;\n&lt;li&gt;Optimize AI infrastructure for performance, reliability, and cost-efficiency.&lt;/li&gt;\n&lt;li&gt;Help us stay up-to-date with the cutting-edge AI research, techniques, and tools.&lt;/li&gt;\n&lt;/ul&gt;\n&lt;h2&gt;What you&#39;ll need to be successful&lt;/h2&gt;\n&lt;ul&gt;\n&lt;li&gt;&lt;strong&gt;5+ years experience&lt;/strong&gt;&amp;nbsp;working as a full-stack engineer on complex web applications.&lt;/li&gt;\n&lt;li&gt;Strong proficiency in&amp;nbsp;&lt;strong&gt;Ruby on Rails, MySQL/Postgresql, ReactJS.&lt;/strong&gt; Familiarity with both frontend and backend is necessary, but a high degree of proficiency in both is not a requirement.&lt;/li&gt;\n&lt;li&gt;Strong proficiency in at least one programming language commonly used for AI development (&lt;strong&gt;Python, JavaScript, TypeScript&lt;/strong&gt;).&lt;/li&gt;\n&lt;li&gt;You have deployed at least one AI Agent to production, with a deep understanding of the entire development lifecycle — from initial concept to final deployment with customer feedback loops.&lt;/li&gt;\n&lt;li&gt;Hands-on experience with AI frameworks and tools, such as OpenAI, Anthropic, Hugging Face, LangChain, and vector databases.&lt;/li&gt;\n&lt;li&gt;Strong understanding of NLP, ML, and LLM fundamentals - including modern LLM technologies, RAG, and prompt engineering techniques.&lt;/li&gt;\n&lt;li&gt;A desire to work in an environment which values speed of iteration and individual autonomy, while also embracing personal accountability and the ability to collaborate effectively as part of a dynamic team.&lt;/li&gt;\n&lt;/ul&gt;\n&lt;h2&gt;Bonus points&lt;/h2&gt;\n&lt;ul&gt;\n&lt;li&gt;You have contributed to open-source AI/ML projects.&lt;/li&gt;\n&lt;/ul&gt;\n&lt;h2&gt;$130,000 - $140,000 USD per year&lt;/h2&gt;\n&lt;p&gt;&lt;em&gt;The cash compensation range shown is a starting point. In addition to equity, benefits and perks, your cash compensation is subject to an annual review and increase on a once per year basis.&lt;/em&gt;&lt;/p&gt;\n&lt;p&gt;&amp;nbsp;&lt;/p&gt;&lt;div class=&quot;content-conclusion&quot;&gt;&lt;h2&gt;The fun stuff&lt;/h2&gt;\n&lt;ul&gt;\n&lt;li&gt;Fully remote:&amp;nbsp;work from anywhere in the world!&lt;/li&gt;\n&lt;li&gt;Autonomy and trust to do your job:&amp;nbsp;we care about outcomes over everything else.&lt;/li&gt;\n&lt;li&gt;Paid time away:&amp;nbsp;all employees are given 35 days of PTO annually. We also offer a paid sabbatical after 5 years.&lt;/li&gt;\n&lt;li&gt;Generous U.S. benchmarked compensation&amp;nbsp;and startup equity no matter where you are in the world.*&lt;/li&gt;\n&lt;li&gt;Awesome medical coverage&amp;nbsp;with 100% coverage for you and your family, or medical reimbursement options where applicable!*&lt;/li&gt;\n&lt;li&gt;Parental leave&amp;nbsp;for parents expanding their family, or just starting one.&lt;/li&gt;\n&lt;li&gt;Home office stipend&amp;nbsp;to help you get up and running.&lt;/li&gt;\n&lt;li&gt;Learning &amp;amp; development stipend&amp;nbsp;to help you level up your professional skills.&lt;/li&gt;\n&lt;li&gt;Annual bonus potential&amp;nbsp;for roles that don&#39;t already receive variable income or commission.&lt;/li&gt;\n&lt;li&gt;Company retreats:&amp;nbsp;Twice a year, the Circle team gets together for a fully paid company retreat in incredible places around the world! We’ve had past retreats in Colombia, Portugal, and Mexico, with more planned on the horizon.&lt;/li&gt;\n&lt;li&gt;Check out our&amp;nbsp;&lt;a href=&quot;https://careers.circle.so/&quot;&gt;Careers&lt;/a&gt;&amp;nbsp;page for more.&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;&lt;span style=&quot;font-size: 10pt;&quot;&gt;*&lt;em&gt;Your role, location and unique circumstance may affect this.&lt;/em&gt;&lt;/span&gt;&lt;/p&gt;\n&lt;h3&gt;Diversity, Equity &amp;amp; Inclusion&lt;/h3&gt;\n&lt;p&gt;As a fully-remote international company, diversity is baked into our DNA. Here’s how our CEO, Sid Yadav, frames our hiring mission: “let’s find talent in underserved and under-represented corners of the world, set them up to do the best work of their lives, and in turn, change their life.” To achieve this hiring mission, we offer competitive&amp;nbsp;U.S. benchmarked&amp;nbsp;compensation no matter where someone’s located in the world, and we proactively seek candidates who expand representation of backgrounds, cultures and lived experiences in our teams.&lt;/p&gt;\n&lt;h3&gt;Equal Employment Opportunity&lt;/h3&gt;\n&lt;p&gt;Circle is an equal opportunity employer and as such, we do not discriminate on the basis of race, color, religion, sex, sexual orientation, gender identity, national origin, age, disability, or any other characteristic protected by applicable laws.&amp;nbsp;If you require any accommodations during the recruitment process, please let us know and we will work with you to meet your needs.&lt;/p&gt;\n&lt;div class=&quot;&quot;&gt;\n&lt;h3 class=&quot;&quot;&gt;How We Use Candidate Data&lt;/h3&gt;\n&lt;p&gt;At Circle, we are committed to protecting your personal information. As a job applicant, the personal data you provide to us is collected and processed in accordance with the&amp;nbsp;&lt;strong&gt;General Data Protection Regulation (GDPR)&lt;/strong&gt; in the EU and the &lt;strong&gt;California Consumer Privacy Act (CCPA)&lt;/strong&gt;. This notice outlines the types of personal information we collect, the purpose for collecting it, and your rights.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Information We Collect:&lt;/strong&gt; We collect the following categories of personal information from job applicants:&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;Contact information (such as name, email address, phone number)&lt;/li&gt;\n&lt;li&gt;Employment history and qualifications&lt;/li&gt;\n&lt;li&gt;Education history&lt;/li&gt;\n&lt;li&gt;References and any other information you choose to share with us during the application process&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;&lt;strong&gt;Purpose of Collection:&lt;/strong&gt; We collect this information for the following purposes:&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;To assess your qualifications and suitability for the position&lt;/li&gt;\n&lt;li&gt;To communicate with you during the recruitment process&lt;/li&gt;\n&lt;li&gt;To comply with legal and regulatory obligations&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;&lt;strong&gt;Your Rights Under GDPR and CCPA:&lt;/strong&gt; You have the following rights regarding your personal information:&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;The right to request access to the personal information we hold about you.&lt;/li&gt;\n&lt;li&gt;The right to request the deletion of your personal information, subject to certain legal exceptions.&lt;/li&gt;\n&lt;li&gt;The right to opt out of the sale of your personal information (Note: We do not sell personal information).&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;For more information about how we handle your personal data or to exercise your rights, please refer to our full &lt;a href=&quot;https://circle.so/privacy&quot; target=&quot;_blank&quot;&gt;Privacy Policy&lt;/a&gt;.&lt;/p&gt;\n&lt;p&gt;By submitting your application, you acknowledge that you have read and understood this privacy notice.&lt;/p&gt;\n&lt;/div&gt;&lt;/div&gt;","tags":"[\"postgres\",\"javascript\",\"typescript\",\"engineering\",\"legal\",\"database\",\"mysql\",\"aws\"]","pubDate":"2025-05-08T20:01:21.000Z","link":"https://job-boards.greenhouse.io/circleso/jobs/4678909008","slug":"senior-full-stack-engineer-applied-ai-circle-3496"},{"id":2188352880,"title":"Enterprise Sales Engineer","company":"Sardine","image":"https://avatars.githubusercontent.com/u/65879301?s=200&v=4","description":"<p style=\"min-height:1.5em\"><strong>Who we are:</strong></p><p style=\"min-height:1.5em\">We are a leader in fraud prevention and AML compliance. Our platform uses device intelligence, behavior biometrics, machine learning, and AI to stop fraud before it happens. Today, over 300 banks, retailers, and fintechs worldwide use Sardine to stop identity fraud, payment fraud, account takeovers, and social engineering scams. We have raised $145M from world-class investors, including Andreessen Horowitz, Activant, Visa, Experian, FIS, and Google Ventures.</p><p style=\"min-height:1.5em\"></p><p style=\"min-height:1.5em\"><strong>Our culture:</strong></p><ul style=\"min-height:1.5em\"><li><p style=\"min-height:1.5em\">We have hubs in the Bay Area, NYC, Austin, and Toronto. However, we maintain a remote-first work culture. #WorkFromAnywhere</p></li><li><p style=\"min-height:1.5em\">We hire talented, self-motivated individuals with extreme ownership and high growth orientation. </p></li><li><p style=\"min-height:1.5em\">We value performance and not hours worked. We believe you shouldn't have to miss your family dinner, your kid's school play, friends get-together, or doctor's appointments for the sake of adhering to an arbitrary work schedule.</p></li></ul><p style=\"min-height:1.5em\"></p><p style=\"min-height:1.5em\"><strong>Location:</strong></p><ul style=\"min-height:1.5em\"><li><p style=\"min-height:1.5em\">US / Canada </p></li><li><p style=\"min-height:1.5em\">From Home / Beach / Mountain / Cafe / Anywhere!</p></li><li><p style=\"min-height:1.5em\">We are a remote-first company with a globally distributed team. You can find your productive zone and work from there.</p></li></ul><p style=\"min-height:1.5em\"></p><p style=\"min-height:1.5em\"><strong>About the role:</strong></p><p style=\"min-height:1.5em\">Sales Engineering is a team of subject matter experts who serve as the trusted technical advisors to prospective customers. You will lead prospects through the sales process by connecting their needs to Sardine’s value to win new customers and drive revenue growth. You will deliver best-in-class product demonstrations, fill out RFPs, and win over our prospective customer’s technical teams with your thought leadership and consultative approach. <br /></p><p style=\"min-height:1.5em\">Internally, your insights from the field will help shape our product roadmap and will pave the way for future customers. You will play a key role in our commitment to customer excellence and allow Sardine to stay ahead of market trends.</p><p style=\"min-height:1.5em\"></p><p style=\"min-height:1.5em\">The Sales Engineering team is a high-visibility and high-impact team. At the intersection of our Go-To-Market and Product &amp; Engineering teams, we serve as the link between our customer’s needs and Sardine’s capabilities, ensuring our platform is always adding value to our customer’s Fraud and Compliance stack. It's a great role for someone who enjoys learning the intricacies of a product to drive value to prospects, and leading through innovative problem-solving to convert prospects into customers. Variety, ambiguity, innovation, and ownership of complex problems are all big components of this role.</p><p style=\"min-height:1.5em\"><br /><strong>As an Enterprise Sales Engineer, you will:</strong></p><ul style=\"min-height:1.5em\"><li><p style=\"min-height:1.5em\">Support Account Executives in identifying a prospect’s fraud and compliance needs.</p></li><li><p style=\"min-height:1.5em\">Prepare and deliver customized demos that showcase the impact of Sardine’s platform.</p></li><li><p style=\"min-height:1.5em\">Interface with Security teams to articulate our security posture and successfully complete security reviews.</p></li><li><p style=\"min-height:1.5em\">Complete RFPs for competitive opportunities.</p></li><li><p style=\"min-height:1.5em\">Create comprehensive Solution Designs that address our prospect’s needs.</p></li><li><p style=\"min-height:1.5em\">Collaborate with peers to improve all processes within the Sales Engineering team.</p></li><li><p style=\"min-height:1.5em\">Work together with our product and engineering teams to identify areas for improvement in our product suite and help prioritize and design solutions.</p></li></ul><p style=\"min-height:1.5em\"></p><p style=\"min-height:1.5em\"><strong>What you’ll bring to Sardine:</strong></p><ul style=\"min-height:1.5em\"><li><p style=\"min-height:1.5em\">7+ years prior experience as a Sales Engineer, Solutions Engineer, or similar roles supporting enterprise customers.</p></li><li><p style=\"min-height:1.5em\">Prior experience within the Risk, Fraud, or Compliance domain.</p></li><li><p style=\"min-height:1.5em\">Proven success working with large financial institutions, banks or global enterprises.</p></li><li><p style=\"min-height:1.5em\">Experience with API based products, a strong understanding of JSON, the ability to read and understand code, and familiarity with one or more of the following languages: Python, JavaScript, Ruby, Go, or Java. Bonus points for knowledge of web development principles and/or the ability to build internal tools using one of the above languages.</p></li><li><p style=\"min-height:1.5em\">Strong analytical skills: you can dig into the technical details of a problem and turn it into a proposed solution.</p></li><li><p style=\"min-height:1.5em\">Ability to thrive in a fast-paced remote environment working with global clients.</p></li><li><p style=\"min-height:1.5em\">Excellent written and verbal communication skills, including the ability to communicate complex technical and business concepts to technical and non-technical personas, and to tailor your communication to their role and seniority.</p></li></ul><p style=\"min-height:1.5em\"><br /><strong>Compensation: </strong>On Target Earnings(OTE) of $200,000 - $240,000 + Equity with tremendous upside potential + Attractive benefits</p><p style=\"min-height:1.5em\"></p><p style=\"min-height:1.5em\"></p><p style=\"min-height:1.5em\">The compensation offered for this role will depend on various factors, including the candidate's location, qualifications, work history, and interview performance, and may differ from the stated range.</p><p style=\"min-height:1.5em\"></p><p style=\"min-height:1.5em\"><strong>Benefits we offer:</strong></p><ul style=\"min-height:1.5em\"><li><p style=\"min-height:1.5em\">Generous compensation in cash and equity</p></li><li><p style=\"min-height:1.5em\">Early exercise for all options, including pre-vested</p></li><li><p style=\"min-height:1.5em\">Work from anywhere: Remote-first Culture</p></li><li><p style=\"min-height:1.5em\">Flexible paid time off, Year-end break, Self care days off</p></li><li><p style=\"min-height:1.5em\">Health insurance, dental, and vision coverage for employees and dependents - <em>US and Canada specific</em></p></li><li><p style=\"min-height:1.5em\">4% matching in 401k / RRSP - <em>US and Canada specific</em></p></li><li><p style=\"min-height:1.5em\">MacBook Pro delivered to your door</p></li><li><p style=\"min-height:1.5em\">One-time stipend to set up a home office — desk, chair, screen, etc.</p></li><li><p style=\"min-height:1.5em\">Monthly meal stipend</p></li><li><p style=\"min-height:1.5em\">Monthly social meet-up stipend</p></li><li><p style=\"min-height:1.5em\">Annual health and wellness stipend</p></li><li><p style=\"min-height:1.5em\">Annual Learning stipend</p></li><li><p style=\"min-height:1.5em\">Unlimited access to an expert financial advisory</p></li></ul><p style=\"min-height:1.5em\"></p><p style=\"min-height:1.5em\">Join a fast-growing company with world-class professionals from around the world. If you are seeking a meaningful career, you found the right place, and we would love to hear from you.</p><p style=\"min-height:1.5em\"></p><p style=\"min-height:1.5em\"><em>To learn more about how we process your personal information and your rights in regards to your personal information as an applicant and Sardine employee, please visit our </em><a target=\"_blank\" rel=\"noopener noreferrer nofollow\" class=\"text-link-blue\" href=\"https://www.sardine.ai/applicant-and-worker-privacy-notice\"><em>Applicant and Worker Privacy Notice</em></a><em>.</em></p>","tags":"[\"javascript\",\"engineering\"]","pubDate":"2025-05-08T19:30:48.939Z","link":"https://jobs.ashbyhq.com/sardine/850f5ea2-0d73-4b9c-be41-8e23f8ba24bb","slug":"enterprise-sales-engineer-sardine-2482"},{"id":3985167090,"title":"Software Engineer - Integrations and Developer Experience team","company":"Fingerprint","image":"https://avatars.githubusercontent.com/u/67208791?s=200&v=4","description":"&lt;div class=&quot;content-intro&quot;&gt;&lt;p&gt;&lt;strong&gt;Fingerprint&lt;/strong&gt;&amp;nbsp;empowers developers to stop online fraud at the source.&lt;/p&gt;\n&lt;p&gt;We work on turning radical new ideas in the fraud detection space into reality. Our products are developer-focused and our clients range from solo developers to publicly traded companies.&amp;nbsp;&lt;strong&gt;We are a globally dispersed, 100% remote company&lt;/strong&gt; with a strong open-source focus. Our flagship open-source project is &lt;a class=&quot;c-link c-link--focus-visible&quot; href=&quot;https://github.com/fingerprintjs/fingerprintjs&quot; target=&quot;_blank&quot; data-stringify-link=&quot;https://github.com/fingerprintjs/fingerprintjs&quot; data-sk=&quot;tooltip_parent&quot;&gt;FingerprintJS&lt;/a&gt; (20K stars on GitHub).&lt;/p&gt;\n&lt;p&gt;&lt;a class=&quot;c-link c-link--focus-visible&quot; href=&quot;https://www.crunchbase.com/organization/fingerprintjs&quot; target=&quot;_blank&quot; data-stringify-link=&quot;https://www.crunchbase.com/organization/fingerprintjs&quot; data-sk=&quot;tooltip_parent&quot;&gt;We have raised $77M&amp;nbsp;&lt;/a&gt;and are backed by Craft Ventures (previously invested in&amp;nbsp;&lt;a class=&quot;c-link c-link--focus-visible&quot; href=&quot;https://www.tesla.com/&quot; target=&quot;_blank&quot; data-stringify-link=&quot;https://www.tesla.com/&quot; data-sk=&quot;tooltip_parent&quot;&gt;Tesla,&amp;nbsp;&lt;/a&gt;&lt;a class=&quot;c-link c-link--focus-visible&quot; href=&quot;https://facebook.com/&quot; target=&quot;_blank&quot; data-stringify-link=&quot;https://facebook.com/&quot; data-sk=&quot;tooltip_parent&quot;&gt;Facebook,&amp;nbsp;&lt;/a&gt;&lt;a class=&quot;c-link c-link--focus-visible&quot; href=&quot;https://www.airbnb.com/&quot; target=&quot;_blank&quot; data-stringify-link=&quot;https://www.airbnb.com/&quot; data-sk=&quot;tooltip_parent&quot;&gt;Airbnb&amp;nbsp;&lt;/a&gt;), Nexus Venture Partners (previously invested in &lt;a href=&quot;https://www.postman.com/&quot;&gt;Postman&lt;/a&gt;, &lt;a href=&quot;https://www.apollo.io/&quot;&gt;Apollo.io,&lt;/a&gt; &lt;a href=&quot;https://min.io/&quot;&gt;MinIO&lt;/a&gt;, Druva)&amp;nbsp;and Uncorrelated Ventures (previously invested in&amp;nbsp;&lt;a class=&quot;c-link c-link--focus-visible&quot; href=&quot;https://redis.io/&quot; target=&quot;_blank&quot; data-stringify-link=&quot;https://redis.io/&quot; data-sk=&quot;tooltip_parent&quot;&gt;Redis,&amp;nbsp;&lt;/a&gt;&lt;a class=&quot;c-link c-link--focus-visible&quot; href=&quot;https://rollbar.com/&quot; target=&quot;_blank&quot; data-stringify-link=&quot;https://rollbar.com/&quot; data-sk=&quot;tooltip_parent&quot;&gt;Rollbar&amp;nbsp;&lt;/a&gt;&amp;amp;&lt;a class=&quot;c-link c-link--focus-visible&quot; href=&quot;https://gradle.org/&quot; target=&quot;_blank&quot; data-stringify-link=&quot;https://gradle.org/&quot; data-sk=&quot;tooltip_parent&quot;&gt;&amp;nbsp;Gradle&lt;/a&gt;).&lt;/p&gt;\n&lt;p&gt;&lt;em&gt;We have noticed a rise in recruiting impersonations across the industry, where scammers attempt to access candidates&#39; personal and financial information through fake interviews and offers. All Fingerprint recruiting email communications will always come from the @fingerprint.com domain. Any outreach claiming to be from Fingerprint via other sources should be ignored.&lt;/em&gt;&lt;/p&gt;\n&lt;p&gt;&amp;nbsp;&lt;/p&gt;\n&lt;hr&gt;\n&lt;p&gt;&amp;nbsp;&lt;/p&gt;\n&lt;p&gt;&amp;nbsp;&lt;/p&gt;\n&lt;p&gt;&amp;nbsp;&lt;/p&gt;&lt;/div&gt;&lt;p&gt;As a Software Engineer on the Developer Experience and Integrations team, you will be responsible for building and maintaining customer-facing integrations between Fingerprint and third-party cloud providers, such as Cloudflare, AWS, Fastly, and Akamai. Your work will enable customers to seamlessly integrate Fingerprint’s device intelligence solutions into their existing infrastructure, enhancing security not only for authentication but for any critical action or transaction that requires protection.&lt;/p&gt;\n&lt;p&gt;You will contribute to both backend integrations (Cloudflare Workers, AWS Lambda, API-driven security measures) and customer-facing features in our dashboard, which is primarily written in React and Node.js, with some backend services in Go. Additionally, you will play a key role in maintaining and improving our open-source ecosystem, including a wide range of Server API SDKs, frontend libraries, and mobile libraries.&lt;/p&gt;\n&lt;p&gt;Your code will be executed millions of times daily, ensuring accurate device intelligence and seamless protection for our customers’ most sensitive workflows.&lt;/p&gt;\n&lt;h3&gt;Responsibilities:&lt;/h3&gt;\n&lt;ul&gt;\n&lt;li&gt;Develop and maintain customer-facing integrations between Fingerprint and cloud platforms like Cloudflare, AWS, Akamai, and Fastly.&lt;/li&gt;\n&lt;li&gt;Enhance the Fingerprint dashboard (React, Node.js) to provide customers with intuitive ways to configure integrations.&lt;/li&gt;\n&lt;li&gt;Implement API-based and edge-based security logic, ensuring seamless communication between Fingerprint, cloud services, and customers’ infrastructure.&lt;/li&gt;\n&lt;li&gt;Maintain and improve our open-source ecosystem, including Server API SDKs, frontend libraries, and mobile libraries to ensure seamless developer adoption.&lt;/li&gt;\n&lt;li&gt;Work with SDKs and open-source projects that enable customers to integrate Fingerprint’s device intelligence into their workflows.&lt;/li&gt;\n&lt;li&gt;Collaborate with product managers, engineers, and designers to improve customer experience and technical performance.&lt;/li&gt;\n&lt;li&gt;Write internal and public documentation to guide customers in integrating Fingerprint with third-party cloud platforms.&lt;/li&gt;\n&lt;/ul&gt;\n&lt;h3&gt;Qualifications:&lt;/h3&gt;\n&lt;ul&gt;\n&lt;li&gt;3-5 years of experience with at least a subset of the following technologies: JavaScript, TypeScript, Java, Go.&lt;/li&gt;\n&lt;li&gt;2-3 years of experience working with Cloudflare Workers, AWS Lambda, or similar edge computing platforms.&lt;/li&gt;\n&lt;li&gt;Experience integrating third-party services and APIs.&lt;/li&gt;\n&lt;li&gt;Experience working on customer-facing products, such as dashboards, SDKs, or developer tools.&lt;/li&gt;\n&lt;li&gt;Familiarity with SDK and library development.&lt;/li&gt;\n&lt;li&gt;Ability to work asynchronously in a remote-based team, with excellent communication skills and attention to detail.&lt;/li&gt;\n&lt;li&gt;Deep interest in cloud platforms, open-source development, and developer experience.&lt;/li&gt;\n&lt;li style=&quot;font-weight: bold;&quot;&gt;&lt;strong&gt;To demonstrate your attention to detail, please include the current major version of the Fingerprint Pro Server Python SDK into the box below&lt;/strong&gt;&lt;/li&gt;\n&lt;/ul&gt;\n&lt;h3&gt;Nice to have:&lt;/h3&gt;\n&lt;ul&gt;\n&lt;li&gt;Experience working with additional cloud platforms, such as Akamai, Fastly, Azure Functions.&lt;/li&gt;\n&lt;li&gt;Contributions to open-source projects or published technical content related to integrations.&lt;/li&gt;\n&lt;li&gt;Experience in technical writing for API and integration documentation.&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;This role is ideal for someone passionate about customer-facing integrations, cloud security, edge computing, and developer experience, while also maintaining and improving our open-source ecosystem and existing integrations.&lt;/p&gt;\n&lt;p&gt;&amp;nbsp;&lt;/p&gt;&lt;div class=&quot;content-conclusion&quot;&gt;&lt;p&gt;&lt;em&gt;We have noticed a rise in recruiting impersonations across the industry, where scammers attempt to access candidates&#39; personal and financial information through fake interviews and offers. All Fingerprint recruiting email communications will always come from the @fingerprint.com domain. Any outreach claiming to be from Fingerprint via other sources should be ignored.&lt;/em&gt;&lt;/p&gt;\n&lt;p&gt;Offers vary depending on, but not limited to, relevant experience, education, certifications/licenses, skills, training, and market conditions.&amp;nbsp;&lt;/p&gt;\n&lt;p&gt;Due to regulatory and security reasons, there’s a small number of countries where we cannot have Fingerprint teammates based.&amp;nbsp;&lt;strong data-stringify-type=&quot;bold&quot;&gt;Additionally, because Fingerprint is an all-remote company and people can join our workforce from almost any country, we do not sponsor visas. Fingerprint teammates need to be authorized to work from their home location&lt;/strong&gt;.&lt;/p&gt;\n&lt;p&gt;We are dedicated to creating an inclusive work environment for everyone. We embrace and celebrate the unique experiences, perspectives and cultural backgrounds that each employee brings to our workplace. Fingerprint strives to foster an environment where our employees feel respected, valued and empowered, and our team members are at the forefront in helping us promote and sustain an inclusive workplace. We highly encourage people from underrepresented groups in tech to apply.&lt;/p&gt;\n&lt;p&gt;If you are applying as a resident of California, please read our CCPA notice &lt;a href=&quot;https://dev.fingerprint.com/docs/dpa-ccpa&quot; target=&quot;_blank&quot;&gt;here&lt;/a&gt;&lt;/p&gt;\n&lt;p&gt;If you are applying as a resident of the EU, please read our GDPR notice &lt;a href=&quot;https://dev.fingerprint.com/docs/dpa-gdpr&quot; target=&quot;_blank&quot;&gt;here&lt;/a&gt;&lt;/p&gt;&lt;/div&gt;","tags":"[\"javascript\",\"typescript\",\"aws\"]","pubDate":"2025-05-08T18:04:28.000Z","link":"https://fingerprint.com/careers/jobs/apply/?gh_jid=5484505004","slug":"software-engineer-integrations-and-developer-experience-team-fingerprint-6175"},{"id":3303613159,"title":"Senior Manager, FP&A","company":"Empower","image":"https://lever-client-logos.s3.us-west-2.amazonaws.com/2e1a369c-b58f-41ac-8d86-4b0a77695e68-1687915522032.png","description":"<p style=\"min-height:1.5em\"><strong>EMPOWER OVERVIEW</strong></p><p style=\"min-height:1.5em\"><a target=\"_blank\" rel=\"noopener noreferrer nofollow\" href=\"http://empower.me/\">Empower</a> is shaking up an outdated financial system by providing real opportunity for our customers: the opportunity to get the cash they need, to access fair credit, and to change their financial story. Today, we’re helping millions of people find financial security through machine learning models that evaluate creditworthiness using a more inclusive lens and mobile-first products: Cash Advance, Thrive line of credit, and Petal credit cards. Tomorrow? Creating even more financial paths for our customers (and their wallets) to succeed.</p><p style=\"min-height:1.5em\">This year, Empower ranked #65 on Inc. 5000’s Fastest-Growing Private Companies list — our third year in a row cracking the top 100 — and was named by Forbes as one of the 25 Next Billion-Dollar Startups for 2024. Empower was also featured by Forbes on America’s Best Startup Employers list in 2023, and our Thrive line of credit product was named by Fast Company as one of 2022’s Next Big Things in Tech.</p><p style=\"min-height:1.5em\">Empower is backed by Sequoia Capital, Blisce, and Icon Ventures. Ready to grow your impact and accelerate your career? Take a look at our open roles — we can’t wait to meet you.</p><p style=\"min-height:1.5em\"></p><h2>The Opportunity: Senior Manager, FP&amp;A</h2><p style=\"min-height:1.5em\">Empower is seeking a Senior Manager of FP&amp;A to play a key part in charting our company's strategic and financial direction. In this role, you’ll build financial models to project the performance of our various business lines, assess revenue trajectories, align costs, and calibrate capital requirements. You’ll partner with cross-functional leaders on data-driven, strategic decision-making, including annual planning and influencing product, credit, people, and marketing levers across the business. The ideal candidate can bring clarity to complexity, ensure we have a firm grasp on our actuals versus forecasts, and collaborate across different departments to fuse their plans with our financial narrative. This role will report to our Head of Strategic Finance.<br /><br />Empower is a remote-first company. We drive connectivity through regular company offsites. Travel for company offsites is expected at a minimum 2 times a year.</p><p style=\"min-height:1.5em\"></p><h2>How You’ll Make an Impact</h2><ul style=\"min-height:1.5em\"><li><p style=\"min-height:1.5em\"><strong>Financial modeling: </strong>Develop comprehensive financial models that reflect our budget allocation and closely monitor expenditures across Empower’s multiple product lines. Oversee our long-term financial planning to ensure strategies are aligned with the company's overarching objectives.</p></li><li><p style=\"min-height:1.5em\"><strong>Data analysis:</strong> Analyze financial data to accurately project future revenues and expenses. Prepare and deliver monthly, quarterly, and annual forecast reports while evaluating financial performance against actual results and forecasts. Recommend actions by identifying trends to improve financial status. Present these findings to senior management and external stakeholders.</p></li><li><p style=\"min-height:1.5em\"><strong>Cross-functional collaboration:</strong> Partner with teams such as People, Accounting, Product, Credit, and Marketing to ensure alignment of financial objectives with departmental strategies. </p></li><li><p style=\"min-height:1.5em\"><strong>Presentation materials</strong>: Prepare quarterly Board materials and executive presentations to communicate business results and forecasts.</p></li><li><p style=\"min-height:1.5em\"><strong>Strategic initiatives:</strong> Contribute to initiatives such as new location and market strategy, M&amp;A transactions, and fundraising efforts.</p></li><li><p style=\"min-height:1.5em\"><strong>Process improvement: </strong>Own the implementation and adoption of future-forward FP&amp;A and analytics tools and processes.</p></li></ul><h2><br />Why You’re a Great Fit</h2><ul style=\"min-height:1.5em\"><li><p style=\"min-height:1.5em\">7+ years of experience in corporate finance (FP&amp;A, investment banking, equity research, or other relevant fields)</p></li><li><p style=\"min-height:1.5em\">Expertise in creating and managing complex 3-statement financial models</p></li><li><p style=\"min-height:1.5em\">Background in fintech/consumer lending is a plus but not required</p></li><li><p style=\"min-height:1.5em\">Strong communication skills, with the ability to present financial analyses to senior executives and external stakeholders</p></li><li><p style=\"min-height:1.5em\">SQL experience is a plus but not required</p></li></ul><p style=\"min-height:1.5em\"></p><h2>Our Interview Process</h2><ol style=\"min-height:1.5em\"><li><p style=\"min-height:1.5em\"><strong>Initial Recruiter Call:</strong> A conversation to learn about your experience and what you're looking for in your next role.</p></li><li><p style=\"min-height:1.5em\"><strong>Hiring Manager Interview:</strong> A deeper discussion about your background and the Senior Manager, FP&amp;A opportunity.</p></li><li><p style=\"min-height:1.5em\"><strong>Skills Panel:</strong> Meet with Empower team members to discuss your expertise and problem-solving approach.</p></li><li><p style=\"min-height:1.5em\"><strong>Leadership Conversation:</strong> A final conversation with our CEO to discuss how you'll contribute to Empower's mission (and how we can help you achieve your career goals along the way).</p></li></ol><p style=\"min-height:1.5em\"><strong>Don't meet every qualification? If you're excited about this challenge and driven to innovate, we still want to hear from you!</strong></p><p style=\"min-height:1.5em\"></p><h2>What You'll Get at Empower</h2><ul style=\"min-height:1.5em\"><li><p style=\"min-height:1.5em\"><strong>Meaningful Ownership:</strong> Competitive salary and generous equity in a profitable, fast growing company.</p></li><li><p style=\"min-height:1.5em\"><strong>Complete Support:</strong> 100% coverage for medical, dental, vision, and life insurance, plus a generous WFH reimbursement.</p></li><li><p style=\"min-height:1.5em\"><strong>High-Impact Teams:</strong> The chance to thrive in a small, focused team where your contributions directly shape outcomes for our business and customers.</p></li><li><p style=\"min-height:1.5em\"><strong>Remote First:</strong> A virtual first environment built on trust and outcomes.</p></li><li><p style=\"min-height:1.5em\"><strong>Team Connection:</strong> Twice-yearly company onsites where we come together to connect, learn, and build for the future (our last few have been in San Diego, Vail, and Flagstaff)!</p></li><li><p style=\"min-height:1.5em\"><strong>Growth Path:</strong> Ongoing opportunities for development in a dynamic, supportive, and creative environment.</p></li></ul><p style=\"min-height:1.5em\"></p><h2>The Empower Way</h2><p style=\"min-height:1.5em\">The Empower Way is one where bold ambition meets an owner mindset, where open dialogue and spirited debate are encouraged, and where everyone works together to put our customers first. We believe diverse voices lead to the best ideas, and we foster an environment where every individual is valued, heard, and supported as part of one unified team working to change lives and build a more inclusive future.</p><p style=\"min-height:1.5em\"><strong>If that sounds like you, join us and be part of a team that's helping millions of people reshape their financial futures.</strong></p>","tags":"[\"finance\",\"management\"]","pubDate":"2025-05-08T17:44:11.018Z","link":"https://jobs.ashbyhq.com/empower%20finance/6203e284-3256-44e9-acac-714fd9fc4338","slug":"senior-manager-fp-a-empower-8693"},{"id":2729434011,"title":"Sales Development Representative","company":"Aiwyn","image":"https://www.aiwyn.ai/hubfs/Aiwyn%20Favicon.jpg","description":"<div><b style=\"font-size: 16px\">Who is Aiwyn and what do we do?</b></div><div><br></div><div><span style=\"font-size: 11pt;\">Aiwyn is transforming the way accounting firms manage the entire revenue lifecycle. Backed by top-tier investors like Bessemer, KKR, and Revolution, we’re one of the fastest-growing scale-up SaaS companies in the world. We build category-defining technology—and we’re doing it with world-class people, processes, and products.</span></div><div><br></div><div><span style=\"font-size: 16px\">To learn more, visit our </span><b><a class=\"postings-link\" style=\"font-size: 16px\" href=\"https://aiwyn.ai/\">website</a></b></div><div><br></div><div><b style=\"font-size: 16px\">About the Role</b></div><div><br></div><div><span style=\"font-size: 11pt\">This isn’t your average SDR job. At Aiwyn, Sales Development is a craft. We’re looking for a sharp, strategic prospector who understands how to build meaningful conversations—not just book meetings. You’ll partner closely with AEs, Solutions Engineers, and Marketing to break into the Top 500 CPA firms. Your success will come from thoughtful account prioritization, creative outreach, multi-threaded engagement, and a long-term approach to relationship-building. This is a role for someone who enjoys the process as much as the results—and wants to become one of the best in the business</span></div><div><br></div><div><span style=\"font-size: 11pt\"><a href=\"http://business.You\">You</a>’ll report to the Senior Director of Sales and can work remotely from anywhere in the US.</span></div><div><b style=\"font-size: 16px\">Who is Aiwyn and what do we do?</b></div><div><br></div><div><span style=\"font-size: 11pt;\">Aiwyn is transforming the way accounting firms manage the entire revenue lifecycle. Backed by top-tier investors like Bessemer, KKR, and Revolution, we’re one of the fastest-growing scale-up SaaS companies in the world. We build category-defining technology—and we’re doing it with world-class people, processes, and products.</span></div><div><br></div><div><span style=\"font-size: 16px\">To learn more, visit our </span><b><a href=\"https://aiwyn.ai/\" style=\"font-size: 16px\" class=\"postings-link\">website</a></b></div><div><br></div><div><b style=\"font-size: 16px\">About the Role</b></div><div><br></div><div><span style=\"font-size: 11pt\">This isn’t your average SDR job. At Aiwyn, Sales Development is a craft. We’re looking for a sharp, strategic prospector who understands how to build meaningful conversations—not just book meetings. You’ll partner closely with AEs, Solutions Engineers, and Marketing to break into the Top 500 CPA firms. Your success will come from thoughtful account prioritization, creative outreach, multi-threaded engagement, and a long-term approach to relationship-building. This is a role for someone who enjoys the process as much as the results—and wants to become one of the best in the business</span></div><div><br></div><div><span style=\"font-size: 11pt\"><a href=\"http://business.You\">You</a>’ll report to the Senior Director of Sales and can work remotely from anywhere in the US.</span></div><h3>What You'll Impact:</h3><li>Build and execute strategic prospecting plans across a named account list</li><li>Leverage research, trigger events, and industry insights to create high-conversion outreach</li><li>Initiate conversations across email, phone, LinkedIn, and industry events</li><li>Identify whitespace and map key personas across multi-layered orgs</li><li>Collaborate closely with Sales and Marketing to refine messaging and campaign strategies</li><li>Maintain clean, accurate records in Hubspot and support reporting on top-of-funnel metrics</li><li>Stay current on industry shifts, job changes, and firm priorities to keep relationships warm</li><li>Travel up to 20% to conferences, tradeshows, and networking events</li><h3>What You'll Bring From Past Experience:</h3><li>1–3 years in a Sales Development or similar role (preferably in SaaS)</li><li>Experience with account-based prospecting and multi-channel outreach</li><li>Excellent written and verbal communication skills</li><li>Strong research instincts and curiosity about the customer</li><li>Driven, self-motivated, and comfortable operating independently</li><li>Familiarity with Hubspot, Salesforce, LinkedIn Sales Navigator, Google Suite</li><li><b>Bonus:</b> Familiarity with the accounting or professional services space</li><li><b>Bonus:</b> Experience working in an early-stage or rapidly scaling startup environment</li><li><b>Bonus:</b> Experience working with a multi-product company with the ability to position all products as an integrated platform solution</li><h3>Benefits and Perks:</h3><li>The big-picture value proposition of this role is simple: join us, and you'll be paid competitively to have freedom in solving worthwhile, challenging problems alongside other A-players at a fast growing SaaS startup led by an experienced and successful co-founding team with industry experience. </li><div><br></div><div>Other benefits include:</div><li><b>Adventure travel stipend</b> - you receive a $1,000 travel reimbursement on your work anniversary each year. We encourage our team to recharge and explore the world beyond their home office walls.</li><li><b>Remote, work-from-anywhere culture</b></li><li><b>Flexible PTO</b></li><li><b>World Class health benefits</b> - we believe in fostering flourishing teams by providing benefits that go beyond the usual standards - Health, vision, dental, HSA/FSA, and mental health support.</li><li><b>Stock options</b> - every Full Time Employee has ownership in Aiwyn's future and success.</li><li><b>401(k) matching</b></li><h3>Our Values:</h3><li><b>Trust</b> - We champion transparency, welcome differing perspectives, uphold accountability, and trust that others have good intentions</li><li><b>Courage</b> - We have the courage to take calculated risks and embrace change, knowing what worked in the past won’t always work in the future</li><li><b>Impact</b> - Rooted in determination and innovation, we chase extraordinary outcomes and impactful results</li><li><b>Relentlessness</b> - We approach challenges with an unwavering resolve, never settling for mediocrity, and always striving to surpass expectations</li><h3>Learn more about Aiwyn:</h3><li><a class=\"postings-link\" href=\"https://www.aiwyn.ai/about\"><b>About us</b></a></li><li><a class=\"postings-link\" href=\"https://www.aiwyn.ai/why-aiwyn\"><b>Why Aiwyn</b></a></li><li><a class=\"postings-link\" href=\"https://www.youtube.com/@AiwynAI\"><b>YouTube page</b></a></li><div>Aiwyn is an equal opportunity employer. All qualified applicants will receive consideration for employment without regard to age, ancestry, color, family or medical care leave, gender identity or expression, genetic information, marital status, medical condition, national origin, physical or mental disability, political affiliation, protected veteran status, race, religion, sex (including pregnancy), sexual orientation, or any other characteristic protected by applicable laws, regulations and ordinances.</div><div><br></div><div>Candidate information will be treated in accordance with our CCPA privacy notice which can be found here: <a class=\"postings-link\" href=\"https://www.aiwyn.ai/ccpa\">https://www.aiwyn.ai/ccpa</a></div>","tags":"[\"aws\"]","pubDate":"2025-05-08T17:39:16.721Z","link":"https://jobs.lever.co/aiwyn/66117c65-faf6-4be6-88d8-1a8da00ac37e","slug":"sales-development-representative-aiwyn-7740"},{"id":2907538775,"title":"Sales Manager - coming soon ✨","company":"Owner","image":"https://avatars.githubusercontent.com/u/87661266?s=200&v=4","description":"<div><b><span style=\"font-size: 32px;\">Sales Manager</span></b></div><div><span style=\"font-size: 15px;\">We expect to open this role in H2 2025 - please feel free to submit your resume in advance to express interest. More specific details on this opportunity coming soon!&nbsp;</span></div><div><br></div><div><br></div><div><span style=\"font-size: 13pt;\">👋&nbsp;</span><b style=\"font-size: 13pt;\">About&nbsp;</b><b><a rel=\"noopener noreferrer\" class=\"postings-link\" style=\"font-size: 13pt;\" href=\"http://owner.com/\">Owner.com</a></b></div><div><span style=\"font-size: 11pt;\">Owner is the all-in-one platform that restaurants use to succeed online.&nbsp;</span></div><div><br></div><div><span style=\"font-size: 11pt;\">Thousands of restaurant owners use our tools to build their website, drive online orders, create their own branded app, manage their customer relationships, and set up marketing automations.&nbsp;</span></div><div><br></div><div><span style=\"font-size: 14.6667px;\">You can think of it as Shopify meets HubSpot, but specifically for restaurants.&nbsp;</span></div><div><br></div><div><span style=\"font-size: 11pt;\">Learn more about the problems we are solving for our customers&nbsp;</span><a rel=\"noopener noreferrer\" class=\"postings-link\" style=\"font-size: 11pt;\" href=\"https://www.owner.com/our-story\">here</a><span style=\"font-size: 11pt;\">.&nbsp;</span></div><div><br></div><div><span style=\"font-size: 13pt;\">🌎&nbsp;</span><b style=\"font-size: 13pt;\">Our vision</b></div><div><span style=\"font-size: 11pt;\">We’re starting by helping independent restaurants succeed online.</span></div><div><br></div><div><span style=\"font-size: 11pt;\">But it’s not just restaurants that need our help. All local service-based businesses are struggling with these same problems. Huge technology corporations are taking their customers, bleeding their profits, and making it hard for them to survive.</span></div><div><br></div><div><span style=\"font-size: 11pt;\">So, once we nail the solution for restaurants&nbsp;–&nbsp;we’ll scale it into every other local business type.</span></div><div><br></div><div><span style=\"font-size: 11pt;\">In the future we envision, we’ll build the technology that tens of millions of local business owners need to succeed in the digital age.</span></div><div><br></div><div><br></div><div><span style=\"font-size: 13pt;\">⭐&nbsp;</span><b style=\"font-size: 13pt;\">Our team</b></div><div><span style=\"font-size: 15px;\">We’ve got top talent from the most successful companies in SMB software like Shopify, HubSpot, DoorDash, Procore, and ServiceTitan.</span></div><div><br></div><div><span style=\"font-size: 15px;\">We’re scaling even faster in 2025 to keep pace with our customer growth.</span></div><div><br></div><div><br></div><div><b style=\"font-size: 13pt;\">🚀&nbsp;Our traction</b></div><div><span style=\"font-size: 11pt;\">In just over 3 years we've generated&nbsp;</span><span style=\"font-size: 15px;\">tens of millions in revenue, served millions of guests, and have processed hundreds of millions of orders.</span></div><div><br></div><div><span style=\"font-size: 11pt;\">More importantly, we’ve helped thousands of restaurant owners save their businesses - and not&nbsp; only survive, but thrive.</span></div><div><br></div><div><br></div><div><span style=\"font-size: 18px;\">🌆&nbsp;</span><b style=\"font-size: 18px;\">Where we work</b></div><div>Owner is a remote-first, global company headquartered in San Francisco, with a sales hub in Toronto. For a few of our roles we prioritize in-person collaboration at one of our office locations. Most of our employees are distributed throughout the globe. Please review the job description and discuss with your recruiter for more details on role location.</div><div><b><span style=\"font-size: 32px;\">Sales Manager</span></b></div><div><span style=\"font-size: 15px;\">We expect to open this role in H2 2025 - please feel free to submit your resume in advance to express interest. More specific details on this opportunity coming soon!&nbsp;</span></div><div><br></div><div><br></div><div><span style=\"font-size: 13pt;\">👋&nbsp;</span><b style=\"font-size: 13pt;\">About&nbsp;</b><b><a href=\"http://owner.com/\" style=\"font-size: 13pt;\" class=\"postings-link\" target=\"_blank\" rel=\"noopener noreferrer\">Owner.com</a></b></div><div><span style=\"font-size: 11pt;\">Owner is the all-in-one platform that restaurants use to succeed online.&nbsp;</span></div><div><br></div><div><span style=\"font-size: 11pt;\">Thousands of restaurant owners use our tools to build their website, drive online orders, create their own branded app, manage their customer relationships, and set up marketing automations.&nbsp;</span></div><div><br></div><div><span style=\"font-size: 14.6667px;\">You can think of it as Shopify meets HubSpot, but specifically for restaurants.&nbsp;</span></div><div><br></div><div><span style=\"font-size: 11pt;\">Learn more about the problems we are solving for our customers&nbsp;</span><a href=\"https://www.owner.com/our-story\" style=\"font-size: 11pt;\" class=\"postings-link\" target=\"_blank\" rel=\"noopener noreferrer\">here</a><span style=\"font-size: 11pt;\">.&nbsp;</span></div><div><br></div><div><span style=\"font-size: 13pt;\">🌎&nbsp;</span><b style=\"font-size: 13pt;\">Our vision</b></div><div><span style=\"font-size: 11pt;\">We’re starting by helping independent restaurants succeed online.</span></div><div><br></div><div><span style=\"font-size: 11pt;\">But it’s not just restaurants that need our help. All local service-based businesses are struggling with these same problems. Huge technology corporations are taking their customers, bleeding their profits, and making it hard for them to survive.</span></div><div><br></div><div><span style=\"font-size: 11pt;\">So, once we nail the solution for restaurants&nbsp;–&nbsp;we’ll scale it into every other local business type.</span></div><div><br></div><div><span style=\"font-size: 11pt;\">In the future we envision, we’ll build the technology that tens of millions of local business owners need to succeed in the digital age.</span></div><div><br></div><div><br></div><div><span style=\"font-size: 13pt;\">⭐&nbsp;</span><b style=\"font-size: 13pt;\">Our team</b></div><div><span style=\"font-size: 15px;\">We’ve got top talent from the most successful companies in SMB software like Shopify, HubSpot, DoorDash, Procore, and ServiceTitan.</span></div><div><br></div><div><span style=\"font-size: 15px;\">We’re scaling even faster in 2025 to keep pace with our customer growth.</span></div><div><br></div><div><br></div><div><b style=\"font-size: 13pt;\">🚀&nbsp;Our traction</b></div><div><span style=\"font-size: 11pt;\">In just over 3 years we've generated&nbsp;</span><span style=\"font-size: 15px;\">tens of millions in revenue, served millions of guests, and have processed hundreds of millions of orders.</span></div><div><br></div><div><span style=\"font-size: 11pt;\">More importantly, we’ve helped thousands of restaurant owners save their businesses - and not&nbsp; only survive, but thrive.</span></div><div><br></div><div><br></div><div><span style=\"font-size: 18px;\">🌆&nbsp;</span><b style=\"font-size: 18px;\">Where we work</b></div><div>Owner is a remote-first, global company headquartered in San Francisco, with a sales hub in Toronto. For a few of our roles we prioritize in-person collaboration at one of our office locations. Most of our employees are distributed throughout the globe. Please review the job description and discuss with your recruiter for more details on role location.</div>","tags":"[]","pubDate":"2025-05-08T17:33:22.826Z","link":"https://jobs.lever.co/owner/3392e287-d022-4c35-a73e-9b6e379a1bd7","slug":"sales-manager-coming-soon-owner-6307"},{"id":9071441692,"title":"Senior Marketing Operations Manager","company":"Circle","image":"https://media.licdn.com/dms/image/v2/D4E0BAQGsuyBYT8Wy1A/company-logo_200_200/company-logo_200_200/0/1709246393415/circleco_logo?e=1746662400&v=beta&t=KH2t1NJ7bcXknchnvYTCh2X0_q0BdXf-vERJqIz2p1k","description":"&lt;div class=&quot;content-intro&quot;&gt;&lt;h2&gt;About Us&lt;/h2&gt;\n&lt;p&gt;Circle is building the world’s leading all-in-one platform for online communities. We make it possible for creators, coaches, educators, and businesses to bring together their audience with engaging discussions, live streams, events, chat, courses, and payments — all in one place, all under their own brand.&lt;/p&gt;\n&lt;p&gt;We’re proud to be a fully remote company of around 180 (and growing!) team members from 30+ countries around the world. We seek exceptional individuals around the world, set them up to do the best work of their lives, and in turn, create a meaningful impact in their own lives. We don&#39;t track hours, but we do manage for high expectations very closely. We collaborate across time zones, are highly async, and like to document a lot.&lt;/p&gt;\n&lt;p&gt;Twice a year, we bring the whole company together in beautiful places around the world for our company offsites. So far, we’ve hosted offsites in Turkey, Portugal, Mexico, Thailand, Colombia, Italy, Ireland, and more, with still more to come!&lt;/p&gt;&lt;/div&gt;&lt;h2&gt;About the role&lt;/h2&gt;\n&lt;p&gt;Our RevOps team is just getting started, and already making an impact! We design, configure, and build the systems and processes that enable our go-to-market and growth functions. As a Senior Marketing Operations Manager, your role is critical to the success of our Marketing team, driving demand generation and performance marketing initiatives. You will be the driving force behind our marketing technology stack and processes.&lt;/p&gt;\n&lt;p&gt;We are looking for someone with deep experience in marketing operations, demand generation, and performance marketing, who can optimize our systems and drive revenue growth.&lt;/p&gt;\n&lt;h2&gt;What you&#39;ll be doing&lt;/h2&gt;\n&lt;ul&gt;\n&lt;li&gt;Develop and execute marketing operations strategies to drive lead generation, nurture campaigns, and maximize marketing ROI&lt;/li&gt;\n&lt;li&gt;Manage and optimize our marketing technology stack, including HubSpot (for marketing automation and CRM), Chili Piper (for lead routing), Clay (for data enrichment), and Google Analytics (for web analytics)&lt;/li&gt;\n&lt;li&gt;Implement and manage UTM tracking and conversion data integration to accurately measure campaign performance and tie traffic and ad clicks to actual revenue&lt;/li&gt;\n&lt;li&gt;Support performance marketing initiatives including paid advertising campaigns, conversion testing, and optimization from an infrastructure and implementation standpoint&lt;/li&gt;\n&lt;li&gt;Utilize analytics and reporting tools, including Google Analytics, to track key marketing performance metrics, identify trends, and develop better marketing ops strategies with key stakeholders&lt;/li&gt;\n&lt;li&gt;Conduct regular analysis of the marketing operations function, and its priorities, to identify areas for improvement and inform the roadmap&lt;/li&gt;\n&lt;li&gt;Collaborate with cross-functional teams, including sales, finance, and customer success, to align strategies and streamline processes&lt;/li&gt;\n&lt;li&gt;Create, maintain, and analyze customer segments within HubSpot to improve targeting and personalization&lt;/li&gt;\n&lt;li&gt;Ensure our marketing tech stack is fully optimized, and provide support to all teams utilizing our marketing tools&lt;/li&gt;\n&lt;li&gt;Maintain documentation of our evolving marketing processes and customer engagement motions&lt;/li&gt;\n&lt;li&gt;Take ownership of change management planning, and implementing new/existing marketing processes across teams&lt;/li&gt;\n&lt;li&gt;Partner closely with team members on the front lines to ensure our systems, data, and processes are increasing their effectiveness and efficiency&lt;/li&gt;\n&lt;/ul&gt;\n&lt;h2&gt;What you&#39;ll need to be successful&lt;/h2&gt;\n&lt;ul&gt;\n&lt;li&gt;Strong alignment with our values, &lt;a href=&quot;https://circle.so/careers&quot;&gt;find our values on our career page&lt;/a&gt; if you haven’t read up on them yet&lt;/li&gt;\n&lt;li&gt;You are proficient in English (spoken, written, and reading) at a &lt;a href=&quot;https://magoosh.com/english-speaking/english-proficiency-levels-a-guide-to-determining-your-level/&quot;&gt;CEFR Level C2&lt;/a&gt; / &lt;a href=&quot;https://www.govtilr.org/&quot;&gt;ILR Level 5&lt;/a&gt;&lt;/li&gt;\n&lt;li&gt;Deep understanding of performance marketing, including paid advertising, conversion testing, and marketing data tagging and integration including UTMs, conversion pixels, passing deals and other user_id type data to integrate various sources of marketing data, etc&lt;/li&gt;\n&lt;li&gt;Experience with HubSpot, Chili Piper (or another lead routing software), Clay (or another data enrichment tool), and Google Analytics&lt;/li&gt;\n&lt;li&gt;You have run software evaluations, and implemented integrated solutions across marketing teams&lt;/li&gt;\n&lt;li&gt;Firm understanding of the entire customer journey, and the impact of marketing systems and tools at each stage&lt;/li&gt;\n&lt;li&gt;Ability to interpret process gaps, and propose solutions to their underlying causes&lt;/li&gt;\n&lt;li&gt;Experience with a large tech stack, and technical ability to optimize systems integrations&lt;/li&gt;\n&lt;li&gt;A holistic thinker, able to manage multiple objectives/assignments while supporting initiatives across several cross-functional teams&lt;/li&gt;\n&lt;li&gt;Able to quickly grasp new concepts, and work in a high-performing, fast-paced environment&lt;/li&gt;\n&lt;li&gt;User-centric, empathetic approach to introducing business change&lt;/li&gt;\n&lt;li&gt;Detail-oriented, taking into consideration each moving part of the system before taking action or recommending a solution&lt;/li&gt;\n&lt;li&gt;Excellent verbal and written communication skills&lt;/li&gt;\n&lt;li&gt;Self-starter; highly analytical; capable of delivering on goals with minimal supervision&lt;/li&gt;\n&lt;/ul&gt;\n&lt;h2&gt;Bonus points&lt;/h2&gt;\n&lt;ul&gt;\n&lt;li&gt;Advanced with Microsoft Excel/Google Sheets for modeling purposes&lt;/li&gt;\n&lt;li&gt;Experience in integrating product usage data into go-to-market tools and processes&lt;/li&gt;\n&lt;li&gt;Have worked in transactional SaaS or in Product Led Growth (PLG) with a freemium or free trial experience&lt;/li&gt;\n&lt;li&gt;A working knowledge of SQL and a BI tool (Tableau, Metabase, Looker, PowerBI etc.)&lt;/li&gt;\n&lt;/ul&gt;\n&lt;h2&gt;$150,000 - $160,000 USD per year&lt;/h2&gt;\n&lt;p&gt;&lt;em&gt;The cash compensation range shown is a starting point. In addition to equity, benefits and perks, your cash compensation is subject to an annual review and increase on a once per year basis.&lt;/em&gt;&lt;/p&gt;\n&lt;p&gt;&amp;nbsp;&lt;/p&gt;&lt;div class=&quot;content-conclusion&quot;&gt;&lt;h2&gt;The fun stuff&lt;/h2&gt;\n&lt;ul&gt;\n&lt;li&gt;Fully remote:&amp;nbsp;work from anywhere in the world!&lt;/li&gt;\n&lt;li&gt;Autonomy and trust to do your job:&amp;nbsp;we care about outcomes over everything else.&lt;/li&gt;\n&lt;li&gt;Paid time away:&amp;nbsp;all employees are given 35 days of PTO annually. We also offer a paid sabbatical after 5 years.&lt;/li&gt;\n&lt;li&gt;Generous U.S. benchmarked compensation&amp;nbsp;and startup equity no matter where you are in the world.*&lt;/li&gt;\n&lt;li&gt;Awesome medical coverage&amp;nbsp;with 100% coverage for you and your family, or medical reimbursement options where applicable!*&lt;/li&gt;\n&lt;li&gt;Parental leave&amp;nbsp;for parents expanding their family, or just starting one.&lt;/li&gt;\n&lt;li&gt;Home office stipend&amp;nbsp;to help you get up and running.&lt;/li&gt;\n&lt;li&gt;Learning &amp;amp; development stipend&amp;nbsp;to help you level up your professional skills.&lt;/li&gt;\n&lt;li&gt;Annual bonus potential&amp;nbsp;for roles that don&#39;t already receive variable income or commission.&lt;/li&gt;\n&lt;li&gt;Company retreats:&amp;nbsp;Twice a year, the Circle team gets together for a fully paid company retreat in incredible places around the world! We’ve had past retreats in Colombia, Portugal, and Mexico, with more planned on the horizon.&lt;/li&gt;\n&lt;li&gt;Check out our&amp;nbsp;&lt;a href=&quot;https://careers.circle.so/&quot;&gt;Careers&lt;/a&gt;&amp;nbsp;page for more.&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;&lt;span style=&quot;font-size: 10pt;&quot;&gt;*&lt;em&gt;Your role, location and unique circumstance may affect this.&lt;/em&gt;&lt;/span&gt;&lt;/p&gt;\n&lt;h3&gt;Diversity, Equity &amp;amp; Inclusion&lt;/h3&gt;\n&lt;p&gt;As a fully-remote international company, diversity is baked into our DNA. Here’s how our CEO, Sid Yadav, frames our hiring mission: “let’s find talent in underserved and under-represented corners of the world, set them up to do the best work of their lives, and in turn, change their life.” To achieve this hiring mission, we offer competitive&amp;nbsp;U.S. benchmarked&amp;nbsp;compensation no matter where someone’s located in the world, and we proactively seek candidates who expand representation of backgrounds, cultures and lived experiences in our teams.&lt;/p&gt;\n&lt;h3&gt;Equal Employment Opportunity&lt;/h3&gt;\n&lt;p&gt;Circle is an equal opportunity employer and as such, we do not discriminate on the basis of race, color, religion, sex, sexual orientation, gender identity, national origin, age, disability, or any other characteristic protected by applicable laws.&amp;nbsp;If you require any accommodations during the recruitment process, please let us know and we will work with you to meet your needs.&lt;/p&gt;\n&lt;div class=&quot;&quot;&gt;\n&lt;h3 class=&quot;&quot;&gt;How We Use Candidate Data&lt;/h3&gt;\n&lt;p&gt;At Circle, we are committed to protecting your personal information. As a job applicant, the personal data you provide to us is collected and processed in accordance with the&amp;nbsp;&lt;strong&gt;General Data Protection Regulation (GDPR)&lt;/strong&gt; in the EU and the &lt;strong&gt;California Consumer Privacy Act (CCPA)&lt;/strong&gt;. This notice outlines the types of personal information we collect, the purpose for collecting it, and your rights.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Information We Collect:&lt;/strong&gt; We collect the following categories of personal information from job applicants:&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;Contact information (such as name, email address, phone number)&lt;/li&gt;\n&lt;li&gt;Employment history and qualifications&lt;/li&gt;\n&lt;li&gt;Education history&lt;/li&gt;\n&lt;li&gt;References and any other information you choose to share with us during the application process&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;&lt;strong&gt;Purpose of Collection:&lt;/strong&gt; We collect this information for the following purposes:&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;To assess your qualifications and suitability for the position&lt;/li&gt;\n&lt;li&gt;To communicate with you during the recruitment process&lt;/li&gt;\n&lt;li&gt;To comply with legal and regulatory obligations&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;&lt;strong&gt;Your Rights Under GDPR and CCPA:&lt;/strong&gt; You have the following rights regarding your personal information:&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;The right to request access to the personal information we hold about you.&lt;/li&gt;\n&lt;li&gt;The right to request the deletion of your personal information, subject to certain legal exceptions.&lt;/li&gt;\n&lt;li&gt;The right to opt out of the sale of your personal information (Note: We do not sell personal information).&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;For more information about how we handle your personal data or to exercise your rights, please refer to our full &lt;a href=&quot;https://circle.so/privacy&quot; target=&quot;_blank&quot;&gt;Privacy Policy&lt;/a&gt;.&lt;/p&gt;\n&lt;p&gt;By submitting your application, you acknowledge that you have read and understood this privacy notice.&lt;/p&gt;\n&lt;/div&gt;&lt;/div&gt;","tags":"[\"finance\",\"management\",\"legal\",\"aws\"]","pubDate":"2025-05-08T17:04:45.000Z","link":"https://job-boards.greenhouse.io/circleso/jobs/4678526008","slug":"senior-marketing-operations-manager-circle-3911"},{"id":4448977424,"title":"Senior Backend Engineer (Pl)","company":"Blue Coding","image":"https://media.licdn.com/dms/image/C4D0BAQHlK67hgnhzQw/company-logo_200_200/0/1631346154820?e=2147483647&v=beta&t=_R2Ssj7L_f4xqmSCcq0nOLCyCz0QN2lFnHssxxhj3YY","description":"<div><i style=\"font-size: 18px\">Do you want to earn a salary in USD?&nbsp;</i></div><div><i style=\"font-size: 18px\">Would you like to work from wherever you want?</i></div><div><i style=\"font-size: 18px\">Would you like to be a part of the leading next-gen software developers?&nbsp;</i></div><div><br></div><div><b style=\"font-size: 24px\">Hi, you finally found us!</b><span style=\"font-size: 24px\">&nbsp;</span></div><div><br></div><div><b style=\"font-size: 24px\">Why work at Blue Coding?</b><span style=\"font-size: 24px\">&nbsp;</span></div><div><br></div><div>At Blue Coding we specialize in hiring excellent developers and amazing people from all over Latin America and other parts of the world. For the past 10 years, we’ve helped cutting-edge companies in the United States and Canada -both large and small, build great development teams and develop great products. Online shops, digital agencies, SaaS providers, and software consulting firms are a few of our clients. Our team of over 100 engineers is distributed in more than 10 countries across the Americas. We are a fully remote company working with a wide array of technologies and have expertise in every stage of the software development process.&nbsp;&nbsp;</div><div><br></div><div>Our team is highly connected, united, and culturally diverse, and our collaborators are involved in many initiatives around the world, from wildlife preservation to volunteering at local charities. We also participate in group activities like movie nights, trivia, and meme competitions. We stand for honesty, fairness, respect, efficiency, hard work, and cooperation.</div><div><br></div><div><b style=\"font-size: 13pt\">What are we looking for?</b></div><div>In this opportunity, we are looking for a Software Developer to work with one of our foreign clients. This tech company is looking to reinvent the portfolio management of mortgage trading and asset management.</div><div><br></div><div>If you are independent, a great communicator, a problem solver, and have a strong attention to detail, this is a great fit for you! Our jobs are fully remote – as long as you have the skills and can get the work done well, you can work anywhere in the listed countries you want.</div><div>So if you have the skills and can get the job done, join us and work from anywhere you want!</div><div><br></div><h3>Here are some of the exciting day-to-day challenges you will face in this role:</h3><li>Design, develop, and maintain the client's platform, using TypeScript and Node.js</li><li>Build and consume RESTful APIs for efficient and secure client-server communication</li><li>Design clear, versioned API endpoints and maintain comprehensive internal documentation</li><li>Integrate with third-party APIs and external systems as needed</li><li>Work with containerised services in Docker and SQL in their Postgres databases</li><li>Collaborate closely with product, design, and engineering teams to deliver end-to-end features</li><li>Write clean, maintainable, and well-tested code</li><li>Participate in code reviews and contribute to architectural decisions</li><li>Utilize CI/CD pipelines (Github Actions) and cloud services (AWS) for deployment and operations</li>,<h3>You will shine if you have these:</h3><li>Strong hands-on experience with TypeScript, NodeJS</li><li>Experience with PostgreSQL, Sequelize</li><li>Experience with React</li><li>Experience with Docker</li><li>Testing experience with Playwright</li><li>Familiarity or knowledge with AWS</li><li>Strong communication, client services, and interpersonal skills</li><li>Knowledge or experience with either credit, mortgages, trading platforms, or environments is a plus.</li>,<h3>Here are some of the perks we offer you:</h3><li>Salary in USD</li><li>Long-term</li><li>Flexible schedule (within US Time zones)</li><li>100% Remote</li><div><b style=\"font-size: 24px\">Hey, you are still here!</b><span style=\"font-size: 24px\">&nbsp;</span></div><div><br></div><div>So, let us ask a few questions. Do you like working in a friendly environment? Are you fluent in English? Do you have a strong work ethic, are detail-oriented and have an ownership mentality? And most importantly do you love music and puppies? If so, then what are you waiting for? Come join our team and become part of this awesome company! We will be expecting you.</div>","tags":"[\"postgres\",\"typescript\",\"management\",\"engineering\",\"database\",\"aws\"]","pubDate":"2025-05-08T16:39:54.480Z","link":"https://jobs.lever.co/bluecoding/0ebcf0b1-08b8-4095-8066-c01ee630401b","slug":"senior-backend-engineer-pl-blue-coding-7981"},{"id":4473159068,"title":"Senior Risk Data Analyst","company":"Sardine","image":"https://avatars.githubusercontent.com/u/65879301?s=200&v=4","description":"<p style=\"min-height:1.5em\"><strong>Who we are:</strong></p><p style=\"min-height:1.5em\">We are a leader in fraud prevention and AML compliance. Our platform uses device intelligence, behavior biometrics, machine learning, and AI to stop fraud before it happens. Today, over 300 banks, retailers, and fintechs worldwide use Sardine to stop identity fraud, payment fraud, account takeovers, and social engineering scams. We have raised $145M from world-class investors, including Andreessen Horowitz, Activant, Visa, Experian, FIS, and Google Ventures.</p><p style=\"min-height:1.5em\"></p><p style=\"min-height:1.5em\"><strong>Our culture:</strong></p><ul style=\"min-height:1.5em\"><li><p style=\"min-height:1.5em\">We have hubs in the Bay Area, NYC, Austin, and Toronto. However, we maintain a remote-first work culture. #WorkFromAnywhere</p></li><li><p style=\"min-height:1.5em\">We hire talented, self-motivated individuals with extreme ownership and high growth orientation. </p></li><li><p style=\"min-height:1.5em\">We value performance and not hours worked. We believe you shouldn't have to miss your family dinner, your kid's school play, friends get-together, or doctor's appointments for the sake of adhering to an arbitrary work schedule.</p></li></ul><p style=\"min-height:1.5em\"></p><p style=\"min-height:1.5em\"><strong>About the role:</strong></p><p style=\"min-height:1.5em\">We’re looking for a data-driven professional to help us measure, understand, and improve the performance of our risk strategies. In this role, you’ll analyze complex datasets, design metrics, build dashboards, and collaborate closely with stakeholders across the business to drive decision-making and optimize outcomes.</p><p style=\"min-height:1.5em\"></p><p style=\"min-height:1.5em\"><strong>What you’ll be doing:</strong></p><ul style=\"min-height:1.5em\"><li><p style=\"min-height:1.5em\">Develop and track metrics to measure and monitor the performance of our risk products and the effectiveness of risk management strategies.</p></li><li><p style=\"min-height:1.5em\">Conduct in-depth analyses to uncover valuable insights contributing to fraud reduction and higher approval rates for our clients.</p></li><li><p style=\"min-height:1.5em\">Serve as a client-facing partner by translating complex data insights into clear, actionable recommendations </p></li><li><p style=\"min-height:1.5em\">Build and experiment with ML models to identify fraudulent patterns and enhance fraud detection capabilities.</p></li><li><p style=\"min-height:1.5em\">Work with engineers on data instrumentation.</p></li><li><p style=\"min-height:1.5em\">Create and automate self-serve dashboards leveraging BI tools.</p></li><li><p style=\"min-height:1.5em\">Collaborate with cross-functional teams (Business, Product, and Engineering) to understand and translate business requirements into actionable data-driven solutions.</p></li><li><p style=\"min-height:1.5em\">Collaborate on implementing risk mitigation solutions, ensuring alignment with business goals.</p></li></ul><p style=\"min-height:1.5em\"><strong>What you’ll need:</strong></p><ul style=\"min-height:1.5em\"><li><p style=\"min-height:1.5em\">Strong technical background with 7+ years of experience demonstrating high impact in a data-focused role such as product analytics, business analytics, or data science</p></li><li><p style=\"min-height:1.5em\">Prior experience in the Fraud/Risk domain</p></li><li><p style=\"min-height:1.5em\">Hands-on experience in SQL and Python</p></li><li><p style=\"min-height:1.5em\">Expertise in BI tools such as Tableau/Sigma/Metabase</p></li><li><p style=\"min-height:1.5em\">Exposure to building ML models to address business challenges</p></li><li><p style=\"min-height:1.5em\">Ability to structure and analyze data, leveraging techniques like EDA and cohort analysis, transform them into understandable and actionable recommendations, and then communicate them effectively across the organization and clients.</p></li><li><p style=\"min-height:1.5em\">Proficiency in defining, utilizing, and communicating performance metrics</p></li><li><p style=\"min-height:1.5em\">Creative problem-solving, strong critical thinking, and a getting-things-done approach</p></li></ul><p style=\"min-height:1.5em\"><br /><strong>Compensation:</strong> Base pay range of $150K - $170K + equity with tremendous upside potential + Attractive benefits</p><p style=\"min-height:1.5em\"></p><p style=\"min-height:1.5em\">The compensation offered for this role will depend on various factors, including the candidate's location, qualifications, work history, and interview performance, and may differ from the stated range.</p><p style=\"min-height:1.5em\"></p><p style=\"min-height:1.5em\"><strong>Benefits we offer:</strong></p><ul style=\"min-height:1.5em\"><li><p style=\"min-height:1.5em\">Generous compensation in cash and equity</p></li><li><p style=\"min-height:1.5em\">Early exercise for all options, including pre-vested</p></li><li><p style=\"min-height:1.5em\">Work from anywhere: Remote-first Culture</p></li><li><p style=\"min-height:1.5em\">Flexible paid time off, Year-end break, Self care days off</p></li><li><p style=\"min-height:1.5em\">Health insurance, dental, and vision coverage for employees and dependents - <em>US and Canada specific</em></p></li><li><p style=\"min-height:1.5em\">4% matching in 401k / RRSP - <em>US and Canada specific</em></p></li><li><p style=\"min-height:1.5em\">MacBook Pro delivered to your door</p></li><li><p style=\"min-height:1.5em\">One-time stipend to set up a home office — desk, chair, screen, etc.</p></li><li><p style=\"min-height:1.5em\">Monthly meal stipend</p></li><li><p style=\"min-height:1.5em\">Monthly social meet-up stipend</p></li><li><p style=\"min-height:1.5em\">Annual health and wellness stipend</p></li><li><p style=\"min-height:1.5em\">Annual Learning stipend</p></li><li><p style=\"min-height:1.5em\">Unlimited access to an expert financial advisory</p></li></ul><p style=\"min-height:1.5em\"></p><p style=\"min-height:1.5em\">Join a fast-growing company with world-class professionals from around the world. If you are seeking a meaningful career, you found the right place, and we would love to hear from you.</p><p style=\"min-height:1.5em\"></p><p style=\"min-height:1.5em\"><em>To learn more about how we process your personal information and your rights in regards to your personal information as an applicant and Sardine employee, please visit our </em><a target=\"_blank\" rel=\"noopener noreferrer nofollow\" class=\"text-link-blue\" href=\"https://www.sardine.ai/applicant-and-worker-privacy-notice\"><em>Applicant and Worker Privacy Notice</em></a><em>.</em></p>","tags":"[\"management\",\"engineering\"]","pubDate":"2025-05-08T12:57:37.035Z","link":"https://jobs.ashbyhq.com/sardine/030e9a89-d3f9-4021-9b5d-3b2b386beebc","slug":"senior-risk-data-analyst-sardine-7445"},{"id":9263656111,"title":"Lead Engineer - India","company":"Empower","image":"https://lever-client-logos.s3.us-west-2.amazonaws.com/2e1a369c-b58f-41ac-8d86-4b0a77695e68-1687915522032.png","description":"<p style=\"min-height:1.5em\"><strong>EMPOWER OVERVIEW</strong></p><p style=\"min-height:1.5em\"><a target=\"_blank\" rel=\"noopener noreferrer nofollow\" href=\"http://empower.me/\">Empower</a> is shaking up an outdated financial system by providing real opportunity for our customers: the opportunity to get the cash they need, to access fair credit, and to change their financial story. Today, we’re helping millions of people find financial security through machine learning models that evaluate creditworthiness using a more inclusive lens and mobile-first products: Cash Advance, Thrive line of credit, and Petal credit cards. Tomorrow? Creating even more financial paths for our customers (and their wallets) to succeed.</p><p style=\"min-height:1.5em\">This year, Empower ranked #65 on Inc. 5000’s Fastest-Growing Private Companies list — our third year in a row cracking the top 100 — and was named by Forbes as one of the 25 Next Billion-Dollar Startups for 2024. Empower was also featured by Forbes on America’s Best Startup Employers list in 2023, and our Thrive line of credit product was named by Fast Company as one of 2022’s Next Big Things in Tech.</p><p style=\"min-height:1.5em\">Empower is backed by Sequoia Capital, Blisce, and Icon Ventures. Ready to grow your impact and accelerate your career? Take a look at our open roles — we can’t wait to meet you.</p><p style=\"min-height:1.5em\"></p><h1>The Opportunity: Lead Engineer - India</h1><p style=\"min-height:1.5em\">Empower is looking for a hands-on technical expert to spearhead the system redesign of NIRA,  our newly acquired credit business, in India. This is a senior IC role, not a people management one.</p><p style=\"min-height:1.5em\">NIRA is building the leading financial brand for Middle India—a market of 200 million people underserved by traditional banks. With customers in 5,000+ cities &amp; with growth engine on, they process 15,000 new loan applications daily, growing 12-15% MoM. NIRA is solving a massive problem with technology-first lending, offering instant credit via their mobile app. </p><p style=\"min-height:1.5em\">As Lead Engineer at NIRA, you will design, build and scale production systems that power real-time credit decision engines, loan origination, and loan management throughout the loan lifecycle to repayments and resizing of credit lines. You'll be instrumental in building the tech stack for credit and other relevant products for NIRA’s customers built on the innovative public financial rails,  the India Stack. This will be an in office role that will report to NIRA’s founders in India, while partnering with global engineering teams at Empower including US, LatAm, and SE Asia.</p><p style=\"min-height:1.5em\">The ideal candidate is someone who has the experience of scaling a product from a few millions to tens of millions of users in an individual contributor role. Your work would have enabled decision making &amp; deployment of  product iterations based on purpose fit A/B testing or other decision systems. Your work would have also led to rapid prototypes and integrations  on both the demand and supply side of the business. </p><p style=\"min-height:1.5em\"></p><h2>How You'll Make an Impact</h2><ul style=\"min-height:1.5em\"><li><p style=\"min-height:1.5em\"><strong>Architect &amp; Scale:</strong> Own the end-to-end design, development, and deployment of our highest impact systems across loan lifecycle including credit decision, loan origination and management.</p></li><li><p style=\"min-height:1.5em\"><strong>Calculated risk taking:</strong> Within a small  group, prototype, integrate, and deploy new technologies, solutions and rewrites that allow us to run the ongoing business while also pushing the envelope on redesigning for future scale. </p></li><li><p style=\"min-height:1.5em\"><strong>Collaborate with Credit &amp; Partner Lender team:</strong> Build system capability to rapidly iterate in two dimensions: a) addition of new data sources, segments and credit decision components, and b) addition of new lending partners.</p></li><li><p style=\"min-height:1.5em\"><strong>Build internal platform tools</strong>: To support and catalyse recurring engineering workloads in the team. </p></li><li><p style=\"min-height:1.5em\"><strong>Mentor &amp; Lead:</strong> Primarily by example, but also undertake team  coaching initiatives aimed at striving for engineering high road. </p></li><li><p style=\"min-height:1.5em\"><strong>Partner</strong> with other engineering teams operating internationally and in the US to identify transferable learnings, and common artefacts that can be utilized across all businesses.</p></li></ul><h2>Why You're a Great Fit</h2><ul style=\"min-height:1.5em\"><li><p style=\"min-height:1.5em\">Bachelor’s degree in Engineering, Computer Science, Mathematics or a similar  quantitative field</p></li><li><p style=\"min-height:1.5em\">6+ years of industry experience in backend development on large-scale, high-traffic production systems</p></li><li><p style=\"min-height:1.5em\">Strong hands-on expertise in databases (open source &amp; managed), APIs, servers and backend architecture</p></li><li><p style=\"min-height:1.5em\">Communicate effectively about details but also zoom out and convey impact to executive audience </p></li></ul><p style=\"min-height:1.5em\"><strong>Don't meet every qualification? If you're excited about this challenge and driven to innovate, we still want to hear from you!</strong></p><p style=\"min-height:1.5em\"></p><h2>Our Tech Stack</h2><ul style=\"min-height:1.5em\"><li><p style=\"min-height:1.5em\"><strong>Backend: </strong>Modular microservices (serverless deployment)</p></li><li><p style=\"min-height:1.5em\"><strong>Languages:</strong> Java, Python, NodeJS</p></li><li><p style=\"min-height:1.5em\"><strong>Databases:</strong> DynamoDB (primary), AWS Glue + Athena (secondary)</p></li><li><p style=\"min-height:1.5em\"><strong>Data Science &amp; Decisioning: </strong>Python-based models deployed on serverless architecture</p></li><li><p style=\"min-height:1.5em\"><strong>Internal Tools: </strong>NodeJS for Operations workflow management</p></li></ul><p style=\"min-height:1.5em\"><em>Note that this is a full-time, in-office role based in Bangalore, India (few days a week can be WFH)</em></p><p style=\"min-height:1.5em\"></p><h2>Our Interview Process</h2><ol style=\"min-height:1.5em\"><li><p style=\"min-height:1.5em\"><strong>Initial Recruiter Call:</strong> A conversation to learn about your experience and what you're looking for in your next role.</p></li><li><p style=\"min-height:1.5em\"><strong>Hiring Manager Interview:</strong> A deeper discussion about your background and approach to solving challenges.</p></li><li><p style=\"min-height:1.5em\"><strong>Skills Panel:</strong> Meet with Empower engineers to discuss your expertise and problem-solving approach through real-world scenarios.</p></li><li><p style=\"min-height:1.5em\"><strong>Leadership Conversation:</strong> A final conversation with the Co-Founder of NIRA to discuss our mission and how you could contribute to it (and how we can help you achieve your career goals along the way).</p></li></ol><p style=\"min-height:1.5em\"><strong>Don't meet every qualification? If you're excited about this challenge and driven to innovate, we still want to hear from you!</strong></p><p style=\"min-height:1.5em\"></p><h2>What You'll Get at Empower</h2><ul style=\"min-height:1.5em\"><li><p style=\"min-height:1.5em\"><strong>Meaningful Ownership:</strong> Competitive salary and generous equity in a profitable, fast growing company.</p></li><li><p style=\"min-height:1.5em\"><strong>Complete Support:</strong> 100% coverage for medical, dental, vision, and life insurance, plus a generous WFH reimbursement.</p></li><li><p style=\"min-height:1.5em\"><strong>High-Impact Teams:</strong> The chance to thrive in a small, focused team where your contributions directly shape outcomes for our business and customers.</p></li><li><p style=\"min-height:1.5em\"><strong>Remote First:</strong> A virtual first environment built on trust and outcomes.</p></li><li><p style=\"min-height:1.5em\"><strong>Team Connection:</strong> Twice-yearly company onsites where we come together to connect, learn, and build for the future (our last few have been in San Diego, Vail, and Flagstaff)!</p></li><li><p style=\"min-height:1.5em\"><strong>Growth Path:</strong> Ongoing opportunities for development in a dynamic, supportive, and creative environment.</p></li></ul><p style=\"min-height:1.5em\"></p><h2>The Empower Way</h2><p style=\"min-height:1.5em\">The Empower Way is one where bold ambition meets an owner mindset, where open dialogue and spirited debate are encouraged, and where everyone works together to put our customers first. We believe diverse voices lead to the best ideas, and we foster an environment where every individual is valued, heard, and supported as part of one unified team working to change lives and build a more inclusive future.</p><p style=\"min-height:1.5em\"><strong>If that sounds like you, join us and be part of a team that's helping millions of people reshape their financial futures.</strong></p>","tags":"[\"management\",\"engineering\",\"database\",\"aws\"]","pubDate":"2025-05-08T06:09:37.419Z","link":"https://jobs.ashbyhq.com/empower%20finance/e2e6030e-8289-4f4d-b23f-de36ee62df81","slug":"lead-engineer-india-empower-7368"},{"id":3473908684,"title":"Web3 Marketing Manager (Content-Focused)","company":"Manta Network","image":"https://avatars.githubusercontent.com/u/74517090?s=200&v=4","description":"<div>Web3 Marketing Manager (Content-Focused)</div><div><b>Position:</b> Web3 Marketing Manager</div><div><b>Type:</b> Full-time / Remote</div><div>🎯 Overview</div><div>We’re looking for a content-driven marketer to amplify our Web3 products through high-quality writing and strong personal branding. You will drive product visibility by producing research, insights, and updates via social media—especially your own Twitter/X presence.</div><div>📌 Key Responsibilities</div><div>Create in-depth Web3 content: product breakdowns, market insights, research</div><div>Actively promote our products and vision on your Twitter/X</div><div>Host or join AMAs, Twitter Spaces, and public discussions</div><div>Collaborate with product and community teams for launch content</div><div>Align messaging across public channels</div><div>✅ Requirements</div><div>1+ year experience in Web3 marketing or content creation</div><div>Strong writing and research ability in English</div><div>5,000+ Twitter/X followers; active and authentic voice</div><div>Familiarity with multi-chain ecosystems and emerging trends</div><div>Self-motivated with a passion for storytelling in Web3</div><div>Web3 Marketing Manager (Content-Focused)</div><div><b>Position:</b> Web3 Marketing Manager</div><div><b>Type:</b> Full-time / Remote</div><div>🎯 Overview</div><div>We’re looking for a content-driven marketer to amplify our Web3 products through high-quality writing and strong personal branding. You will drive product visibility by producing research, insights, and updates via social media—especially your own Twitter/X presence.</div><div>📌 Key Responsibilities</div><div>Create in-depth Web3 content: product breakdowns, market insights, research</div><div>Actively promote our products and vision on your Twitter/X</div><div>Host or join AMAs, Twitter Spaces, and public discussions</div><div>Collaborate with product and community teams for launch content</div><div>Align messaging across public channels</div><div>✅ Requirements</div><div>1+ year experience in Web3 marketing or content creation</div><div>Strong writing and research ability in English</div><div>5,000+ Twitter/X followers; active and authentic voice</div><div>Familiarity with multi-chain ecosystems and emerging trends</div><div>Self-motivated with a passion for storytelling in Web3</div>","tags":"[]","pubDate":"2025-05-08T05:56:58.654Z","link":"https://jobs.lever.co/MantaNetwork/839df0d7-a637-4bf1-b331-6e05032dc77a","slug":"web3-marketing-manager-content-focused-manta-network-7130"},{"id":3711366726,"title":"Junior QA Automation Engineer","company":"Gr8tech","image":"https://remotive.com/job/2004604/logo","description":"<div class='\"content-intro\"'><p><strong>GR8 Tech is a global product company that provides innovative, scalable platforms and business solutions for the iGaming industry.</strong></p>\n<p>We have а great experience: GR8 Tech platform successfully handles millions of active players and offers best practices to develop and grow in the gambling industry. We are here to provide great gaming tech to satisfy even greater ambition!</p>\n<p>We develop complete tech coverage for gambling businesses worldwide, including iGaming platform solutions, consulting, integration, and long-lasting operation services.</p>\n<p><strong>We are driven by our ambition to make a great product with great people! Together we move the world of iGaming forward — join!</strong></p></div><p>We are seeking a <strong>Junior C# Automation QA Engineer </strong>to join our team. You will play a crucial role in ensuring the quality and reliability of our software products by developing and executing automated and manual tests. You will have the opportunity to improve your skills during testing high-load microservices and other interesting tasks. Your expertise will help us enhance our testing processes and contribute to the overall success of our projects.</p>\n<div class=\"h2\">About your key responsibilities and impact:</div>\n<ul style=\"\">\n<li style=\"\">Manual Testing: Execute test cases (manual) and analyze results. Identifying, recording, documenting thoroughly, and tracking bugs. Reviewing requirements, specifications, and technical design documents to provide timely and meaningful feedback;</li>\n<li style=\"\">Developing and Maintaining Automated Tests: Designing, implementing, and maintaining automated test scripts using C#, Docker, Kafka, MongoDB, GitLab, etc;</li>\n<li style=\"\">Executing Automation Tests: Running automated tests, analyzing results, and reporting findings. Investigate defects and work closely with the development team to ensure issues are resolved;</li>\n<li style=\"\">Continuous Improvement: Staying updated on the latest testing tools and methodologies. Participating in code reviews and contributing to the improvement of test automation processes;</li>\n<li style=\"\">Agile Collaboration: Working closely with cross-functional teams in an Agile environment, participating in daily stand-ups and sprint planning.</li>\n</ul>\n<div class=\"h2\">Essential professional experience:</div>\n<p><strong>Technical Proficiency:</strong></p>\n<ul style=\"\">\n<li style=\"\">Experience in C# and the .NET framework;</li>\n<li style=\"\">Familiarity with automation testing tools and frameworks (NUnit, XUnit, etc.);</li>\n<li style=\"\">Experience with any DB (MongoDB, PostgreSQL, MySQL, etc);</li>\n<li style=\"\">Experience with any message broker(Kafka, RabbitMQ etc);</li>\n<li style=\"\">Experience with Docker.</li>\n</ul>\n<p><strong>Testing Knowledge:</strong></p>\n<ul style=\"\">\n<li style=\"\">Understanding of different testing methodologies (functional, regression, performance);</li>\n<li style=\"\">Experience with API testing and tools (e.g., Postman, RestSharp).</li>\n</ul>\n<p><strong>Version Control:</strong></p>\n<ul style=\"\">\n<li style=\"\">Knowledge of any CI/CD(GitLab, GitHub, etc.);</li>\n<li style=\"\">Knowledge of Git or similar version control systems.</li>\n</ul>\n<p><strong>Soft Skills:</strong></p>\n<ul style=\"\">\n<li style=\"\">Good problem-solving and analytical skills;</li>\n<li style=\"\">Strong communication skills to effectively collaborate with team members;</li>\n<li style=\"\">Ability to work independently and as part of a team;</li>\n<li style=\"\">Fluent Ukrainian proficiency is a must.</li>\n</ul><div class='\"content-conclusion\"'><p> </p>\n<div class=\"h2\"><strong>What we offer:</strong></div>\n<p><strong>Benefits Cafeteria:</strong></p>\n<ul style=\"\">\n<li style=\"\">Sports compensation;</li>\n<li style=\"\">Medical coverage;</li>\n<li style=\"\">Psychological support;</li>\n<li style=\"\">Home-office coverage.</li>\n</ul>\n<p><strong>Work-life:</strong></p>\n<ul style=\"\">\n<li style=\"\">Remote work, Coworking compensation;</li>\n<li style=\"\">Childcare budget;</li>\n<li style=\"\">Maternity leave;</li>\n<li style=\"\">Paternity leave;</li>\n<li style=\"\">Additional 2 days for family events.</li>\n</ul>\n<p><strong>Our GR8 Culture:</strong></p>\n<ul style=\"\">\n<li style=\"\">Open feedback and transparent direct communications;</li>\n<li style=\"\">Growth and development: better every day;</li>\n<li style=\"\">High tolerance to experiment and mistakes;</li>\n<li style=\"\">Supportive friendly environment.</li>\n</ul>\n<p> </p>\n<p> </p>\n<p>Data Protection Information regarding the processing of your personal data in connection with the recruitment and selection process can be found in the Candidate Privacy Notice at <a class='\"c-link\"' href=\"%22https://gr8.tech/candidate-privacy-notice/%22\" rel=\"nofollow\" target='\"_blank\"'>https://gr8.tech/candidate-privacy-notice/</a>.</p></div><img src=\"https://remotive.com/job/track/2004604/blank.gif?source=public_api\" alt=\"\"/>","tags":"[\"C#\",\"docker\",\"mongoDB\",\"agile\"]","pubDate":"2025-05-07T00:51:52.000Z","link":"https://remotive.com/remote-jobs/qa/junior-qa-automation-engineer-2004604","slug":"junior-qa-automation-engineer-gr8tech-4594"}]