[{"id":2092740304,"title":"Writer/Editor (Publishing)","company":"Pip Decks","image":"https://remotive.com/job/1872627/logo","description":"<p><strong>Pip Decks</strong> is in search of a hyper-organised, detail-oriented <strong>Writer/Editor</strong> to help us produce more written materials to support our customers, and to ensure we maintain the high standard of quality people expect from us.</p>\n<p>In a typical week you’ll be writing fun, educational video scripts, punchy prompts for digital whiteboards, effective alt text for our image library and SEO-led blogs on everything from team dynamics and imposter syndrome through to innovation and breakthrough moves by big brands. You will also, of course, be proof-reading our all-important Tactics decks.</p>\n<p>You’ll have the opportunity to work closely with AI, using it to streamline your work, generate ideas and do some of the ‘heavy lifting’ involved in working as part of a busy publishing team. Just like everyone else at Pip Decks, you’ll be able to put forward new ideas and bring them to life, too. If you love variety and a good challenge, you’ll thrive here.</p>\n<p>At Pip Decks, the power of the written word is never under-estimated. Your curiosity, ability to learn and interpret, and meticulous attention to detail will play a pivotal role in ensuring the wisdom our decks impart reaches everyone who could benefit from it. With over 100,000 customers (and many more fans), your words will have a huge impact.</p>\n<p>This role will suit an established writer who has experience creating content that <em>explains</em> concepts. You’ll need to interpret the problems our decks are designed to solve and explain them in writing in a variety of different formats. Experience in proofreading is an absolute requirement, as you’ll play a vital role in ensuring the quality of our decks before they go to print.</p>\n<p>And if you’re fluent in French or German? Well, that would be a bonus!</p>\n<p>If this role and the culture described below resonates with your career goals, we’d love to hear from you.</p>\n<p>Salary: (depending on experience) £34,000 - £40,000 p/a</p>\n<p>Contract type: Full-Time Employment (UK) or Contract (Rest of World)</p>\n<p>Location: Fully remote. Preferred timezone GMT/CET</p>\n<p><strong>Requirements</strong></p>\n<div class=\"h3\"><strong>At Pip Decks, our culture thrives on:</strong></div>\n<ul style=\"\">\n<li style=\"\">Trust: We trust you to manage your time and deadlines efficiently.</li>\n<li style=\"\">Autonomy: We offer tools, freedom, and education to empower you to take full charge of your projects and grow in your role.</li>\n<li style=\"\">Outcome-driven: Quality and impact are our focus, not just the hours you clock.</li>\n<li style=\"\">Proactivity: Take full ownership of your goals and tasks.</li>\n<li style=\"\">Short toes: Proactively identify areas of improvement, with no worry about overstepping.</li>\n</ul>\n<div class=\"h3\"><strong>Responsibilities:</strong></div>\n<p>These responsibilities are often shared among other members of the team, so you could be writing, editing or proofing any of the below.</p>\n<ul style=\"\">\n<li style=\"\">Writing video scripts for short (3-min) videos to explain each Tactic in our decks.</li>\n<li style=\"\">Creating digital whiteboards (e.g., Miro, Figma) rich with examples and clear instructions for each Tactic.</li>\n<li style=\"\">Producing accessibility-focused alt text for the images on our website and app.</li>\n<li style=\"\">Writing and editing our Guides that explain how to use multiple tactics in sequence, complete with creative examples to bring them to life.</li>\n<li style=\"\">Writing SEO blogs that answer the most common questions people have about the areas our decks focus on.</li>\n<li style=\"\">Sub-editing and proofing new decks and expansion packs in InDesign.</li>\n<li style=\"\">Using the knowledge of the decks you acquire to inform our marketing team of new angles and insights to highlight in ads and other materials.</li>\n<li style=\"\">Writing up Standard Operating Procedures (SOPs) and Notion wiki pages to document our processes.</li>\n<li style=\"\">Proofing all of the above when the materials have been written by others on the team.</li>\n<li style=\"\">Ensuring consistency in our brand voice, style and messaging and keeping our style guide up to date.</li>\n<li style=\"\">Applying new tech (such as AI) to streamline working practices and increase our capacity to produce materials that support our customers.</li>\n<li style=\"\">Analysing and summarising customer research to ensure everyone at Pip Decks understands our audience and their challenges.</li>\n<li style=\"\">Briefing the marketing team when new landing pages etc are required for upcoming decks</li>\n<li style=\"\">Proofing/reviewing content across platforms including the app</li>\n</ul>\n<div class=\"h3\">Tools we use</div>\n<ul style=\"\">\n<li style=\"\">Slack: For team communication.</li>\n<li style=\"\">G Suite: For team and external communication.</li>\n<li style=\"\">Loom videos: To convey training and demonstrations.</li>\n<li style=\"\">Notion: To document ideas and processes.</li>\n<li style=\"\">Miro and/or other digital whiteboards: Experience not required.</li>\n<li style=\"\">Adobe Acrobat: for marking up PDFs. Experience desirable but not required.</li>\n<li style=\"\">GPT4: To support various processes across the team.</li>\n<li style=\"\">InDesign: for lay-out of our printed materials. Experience desirable but not required.</li>\n</ul>\n<p> </p>\n<div class=\"h3\">⭐️ About you</div>\n<ul style=\"\">\n<li style=\"\">Five years’ proven experience as a writer, editor and proofreader.</li>\n<li style=\"\">Keen eye for detail and dedication to ensuring top-quality materials.</li>\n<li style=\"\">Able to quickly grasp a concept and apply it to new situations.</li>\n<li style=\"\">Understanding of how to explain concepts in writing.</li>\n<li style=\"\">Strong understanding of accessibility and inclusivity in writing.</li>\n<li style=\"\">Adaptable to new tools and technologies.</li>\n<li style=\"\">A curious mindset, always eager to learn and adapt.</li>\n<li style=\"\">Ability to work with cross-functional teams and interpret feedback.</li>\n<li style=\"\">Excellent organisational and time-management skills.</li>\n<li style=\"\">Creative mindset with the ability to suggest improvements and new ideas.</li>\n</ul>\n<p><strong>Benefits</strong></p>\n<ul style=\"\">\n<li style=\"\">A first look at and opportunity to shape the content of every new deck that we produce.</li>\n<li style=\"\">A fully remote work environment with a focus on asynchronous collaboration.</li>\n<li style=\"\">Competitive compensation in line with industry standards.</li>\n<li style=\"\">A supportive environment, where you are given the tools, freedom, and education to enhance your skills and professional growth.</li>\n<li style=\"\">A team that values personal growth, collaboration, and a shared vision.</li>\n</ul>\n<p> </p>\n<p>If this sounds like the perfect role for you please apply, with a cover letter, ensuring to add the word \"Raspberry\" in the cover letter.</p>\n<img src=\"https://remotive.com/job/track/1872627/blank.gif?source=public_api\" alt=\"\"/>","tags":"[\"go\",\"seo\",\"video\",\"AI/ML\",\"Figma\",\"research\",\"editing\",\"InDesign\",\"REST\",\"G Suite\"]","pubDate":"2023-12-23 23:20:06.000","link":"https://remotive.com/remote-jobs/writing/writer-editor-publishing-1872627","savedDate":"2023-12-25 06:04:05.858","slug":"writer-editor-publishing-pip-decks-7298"},{"id":4377488343,"title":"Product Manager","company":"Siena","image":"https://remotive.com/job/1862167/logo","description":"<div class=\"h2\">About us</div>\n<p style=\"min-height: 1.5em;\">At Siena we are revolutionizing the customer service industry with the world's first autonomous AI customer service agents. We are a remote-first startup that's passionate about enabling machines to engage in delightful and empathic conversations. Siena is the first of its kind, designed to work out-of-the-box to interact with customers across all channels from a single platform.</p>\n<p style=\"min-height: 1.5em;\">If you're excited about AI and the intersection of human-to-machine communications, and want to be part of a team who is driving innovation and making a real impact, then come join us in pushing the boundaries of AI and CX.</p>\n<p style=\"min-height: 1.5em;\"> </p>\n<div class=\"h2\"><strong>Some of our values</strong></div>\n<ul style=\"\">\n<li style=\"\">\n<p style=\"min-height: 1.5em;\"><strong>Customer First</strong>: It's not just about solving issues or closing deals. We're in the business of understanding our customers so well that we can anticipate their needs and blow their minds.</p>\n</li>\n<li style=\"\">\n<p style=\"min-height: 1.5em;\"><strong>Straight Talk: </strong>Communication isn't just a checkbox for us—it's our operating system. We say what we mean, mean what we say, and have no hidden agendas or sugar-coating..</p>\n</li>\n<li style=\"\">\n<p style=\"min-height: 1.5em;\"><strong>Question &amp; Disrupt: </strong>We do things that have never been done before—not for the sake of being different but for being radically better.</p>\n</li>\n</ul>\n<ul style=\"\">\n<li style=\"\">\n<p style=\"min-height: 1.5em;\"><strong>Act with Agency:</strong> We don't wait for permission or perfect conditions. We evaluate the situation, make our best call, and go for it.</p>\n</li>\n<li style=\"\">\n<p style=\"min-height: 1.5em;\"><strong>Raise the Bar:</strong> We're not just meeting standards, we're aiming for setting them.</p>\n</li>\n<li style=\"\">\n<p style=\"min-height: 1.5em;\"><strong>Fast &amp; Fearless: </strong>We move quickly but thoughtfully, and view mistakes and failures as stepping stones, not setbacks.</p>\n</li>\n<li style=\"\">\n<p style=\"min-height: 1.5em;\"><strong>Driven by Curiosity, Fueled by Growth:</strong> We ask the questions no one else is asking, dive deep, and come out the other side better for it.</p>\n</li>\n<li style=\"\">\n<p style=\"min-height: 1.5em;\"><strong>Synergy Over Solo: </strong>We value collaboration over individual achievement. When we work together, we're unstoppable. We're not just co-workers; we're co-creators.</p>\n</li>\n</ul>\n<p style=\"min-height: 1.5em;\"> </p>\n<div class=\"h2\">The Role &amp; What You'll Be Doing:</div>\n<p style=\"min-height: 1.5em;\">As the first Product Manager at Siena, you will be pivotal in guiding our AI customer service products from conception to launch. Here’s what you’ll do:</p>\n<ul style=\"\">\n<li style=\"\">\n<p style=\"min-height: 1.5em;\"><strong>Strategic Development and Execution:</strong> You will own projects end-to-end, ensuring that our product not only meets but exceeds customer expectations and aligns with our business goals.</p>\n</li>\n<li style=\"\">\n<p style=\"min-height: 1.5em;\"><strong>Collaborative Ideation:</strong> Actively contribute ideas and provide constructive feedback throughout the product development process, from the roadmap to architectural decisions.</p>\n</li>\n<li style=\"\">\n<p style=\"min-height: 1.5em;\"><strong>Hands-On Involvement:</strong> Work closely with the engineering and design teams to slice and dice scope, ensuring efficient and effective delivery of each product component.</p>\n</li>\n<li style=\"\">\n<p style=\"min-height: 1.5em;\"><strong>Product Building:</strong> Dedicate around 80% of your time to developing new software products or enhancing existing features, always aiming for innovation and excellence.</p>\n</li>\n<li style=\"\">\n<p style=\"min-height: 1.5em;\"><strong>Mentorship &amp; Leadership:</strong> If inclined, spend approximately 20% of your time mentoring and leading other team members, sharing your knowledge and expertise to foster growth.</p>\n</li>\n<li style=\"\">\n<p style=\"min-height: 1.5em;\"><strong>Problem-Solving:</strong> Be the go-to person for unblocking challenges, helping both yourself and your team overcome any hurdles in the product development process.</p>\n</li>\n</ul>\n<div class=\"h2\">Join the Team if You:</div>\n<ul style=\"\">\n<li style=\"\">\n<p style=\"min-height: 1.5em;\">4+ years of experience in product management. Experience building with LLMs is a huge plus.</p>\n</li>\n<li style=\"\">\n<p style=\"min-height: 1.5em;\">Have a strong technical understanding, even if not a coder yourself. Familiarity with NodeJS, Typescript, Express, and AWS is a plus.</p>\n</li>\n<li style=\"\">\n<p style=\"min-height: 1.5em;\">Demonstrate experience in using data-driven approaches for product development, including familiarity with tools for analytics, A/B testing, and user feedback.</p>\n</li>\n<li style=\"\">\n<p style=\"min-height: 1.5em;\">Show a proven track record of managing all aspects of a successful product throughout its lifecycle.</p>\n</li>\n<li style=\"\">\n<p style=\"min-height: 1.5em;\">Have a deep understanding of customer needs and the ability to translate these into product features.</p>\n</li>\n<li style=\"\">\n<p style=\"min-height: 1.5em;\">Are adept at working in a fast-paced, remote environment, thriving under pressure and ambiguity.</p>\n</li>\n<li style=\"\">\n<p style=\"min-height: 1.5em;\">Have outstanding communication and leadership skills, capable of articulating complex concepts to a diverse range of stakeholders.</p>\n</li>\n</ul>\n<div class=\"h2\">Impress Us Even Further:</div>\n<ul style=\"\">\n<li style=\"\">\n<p style=\"min-height: 1.5em;\">If you've played a significant role in scaling systems or products in your previous roles.</p>\n</li>\n<li style=\"\">\n<p style=\"min-height: 1.5em;\">Your experience in a startup environment, ideally from an early stage to a significant growth phase.</p>\n</li>\n<li style=\"\">\n<p style=\"min-height: 1.5em;\">Proven success in working with remote teams, demonstrating effective collaboration and communication in a distributed setting.</p>\n</li>\n</ul>\n<p style=\"min-height: 1.5em;\"> </p>\n<div class=\"h2\">Benefits</div>\n<p style=\"min-height: 1.5em;\">🏠 <strong>The flexibility to work from anywhere</strong>. Even if it's just from the comfort of your own bed (because let's face it, who doesn't love a good WFH situation?)</p>\n<p style=\"min-height: 1.5em;\">🌞 <strong>Flexible working hours</strong>. Because who said you can't design your day on your terms?</p>\n<p style=\"min-height: 1.5em;\">💸  <strong>Competitive salary and stock options</strong>. We offer highly competitive salaries and equity, because we're building this together.</p>\n<p style=\"min-height: 1.5em;\">🌴 <strong>Unlimited PTO</strong>. With unlimited paid time off and a minimum of 15 days off per year, you'll have plenty of time to explore the world (or just your couch).</p>\n<p style=\"min-height: 1.5em;\">📖 <strong>Growth stipend</strong>. An annual budget to continue learning and expanding your horizons. It's like getting a raise without having to ask for it. We invest in you, so you can continue to invest in yourself.</p>\n<p style=\"min-height: 1.5em;\"> </p>\n<p style=\"min-height: 1.5em;\">At Siena, we’re not just looking for people who can do a job. We’re looking for people who want to break boundaries, create the future, and reshape industries. If that’s you, we look forward to your application.</p>\n<p style=\"min-height: 1.5em;\"> </p>\n<p style=\"min-height: 1.5em;\">Siena provides equal employment opportunities (EEO) to all employees and applicants for employment without regard to race, color, religion, sex, national origin, age, disability, genetics, sexual orientation, gender identity, or gender expression. We are committed to a diverse and inclusive workforce and welcome people from all backgrounds, experiences, perspectives, and abilities.</p>\n<img src=\"https://remotive.com/job/track/1862167/blank.gif?source=public_api\" alt=\"\"/>","tags":"[\"AWS\",\"go\",\"node.js\",\"AI/ML\",\"CX\",\"product management\",\"product development\",\"analytics\",\"mentoring\",\"Typescript \",\"A/B Testing\",\"startup\",\"testing\"]","pubDate":"2023-12-23 21:21:19.000","link":"https://remotive.com/remote-jobs/product/product-manager-1862167","savedDate":"2023-12-25 06:04:05.858","slug":"product-manager-siena-28"},{"id":5205414760,"title":"Equity, Diversity & Inclusion Team Lead","company":"Greenpeace","image":"https://remotive.com/job/1866241/logo","description":"<p dir=\"ltr\"><em><br></em>12 month fixed term contract / full time<br><br></p>\n<p dir=\"ltr\"><strong>Location: The successful candidate may be based in a country where one of the independent National/Regional Greenpeace organisations (NRO’s) is located. See the locations </strong><a href=\"https://www.greenpeace.org/international/explore/about/worldwide/\" rel=\"nofollow\"><strong>here</strong></a><strong>. </strong>[<em>Please note that we are currently unable to host new staff in a number of NRO's at this present time, due to various restrictions. We are unable to support hosting in the US, in addition to some other NRO locations. The recruitment team may reach out to you to provide an update as necessary, depending on your location].<br><br></em></p>\n<p dir=\"ltr\">As the Equity, Diversity &amp; Inclusion Team Lead at Greenpeace International, you will play a pivotal role in driving the implementation of the JEDIS (Justice, Equity, Diversity, Inclusion, and Safety) journey for GPI and the Greenpeace network (please note that the role is known internally as JEDIS Team Lead).<br><br></p>\n<p dir=\"ltr\">In this role you will act as a thought leader, convener, and catalyst for change, fostering a more just, equitable, diverse, and inclusive organization. By collaborating with internal stakeholders and leveraging internal and external expertise, you will contribute to the transformation of Greenpeace's culture and actively support achievement of our JEDIS commitments.<br><br></p>\n<p dir=\"ltr\"><strong>In this role you will:<br><br></strong></p>\n<p dir=\"ltr\">Advance JEDIS Vision and Strategy:</p>\n<ul style=\"\">\n<li dir=\"ltr\" style=\"\">\n<p dir=\"ltr\">Ensure the continuous evolution and implementation of the JEDIS (Justice, Equity, Diversity, Inclusion, and Safety) vision and strategy.</p>\n</li>\n<li dir=\"ltr\" style=\"\">\n<p dir=\"ltr\">Facilitate and drive conversations among stakeholders and leaders to instigate cultural shifts.</p>\n</li>\n<li dir=\"ltr\" style=\"\">\n<p dir=\"ltr\">Collaborate closely with internal and global stakeholder groups, to align strategies and foster a cohesive approach.</p>\n</li>\n</ul>\n<p dir=\"ltr\">Support National and Regional Organizations (NROs):</p>\n<ul style=\"\">\n<li dir=\"ltr\" style=\"\">\n<p dir=\"ltr\">Form strategic partnerships with NROs to facilitate JEDIS implementation</p>\n</li>\n<li dir=\"ltr\" style=\"\">\n<p dir=\"ltr\">Advocate for the significance of JEDIS implementation with executive directors and senior management teams.</p>\n</li>\n</ul>\n<p dir=\"ltr\">Support Community Building:</p>\n<ul style=\"\">\n<li dir=\"ltr\" style=\"\">\n<p dir=\"ltr\">Cultivate and ensure space for the growth of internal community groups, such as Employee Resource Groups (ERGs).</p>\n</li>\n<li dir=\"ltr\" style=\"\">\n<p dir=\"ltr\">Contribute to the creation of community spaces that encourage meaningful conversations and mutual support.</p>\n</li>\n<li dir=\"ltr\" style=\"\">\n<p dir=\"ltr\">Participate in community activities, potentially hosting and facilitating virtual JEDIS meetings and calls.</p>\n</li>\n</ul>\n<p dir=\"ltr\">Team Management:</p>\n<ul style=\"\">\n<li dir=\"ltr\" style=\"\">\n<p dir=\"ltr\">Lead the JEDIS team with a supportive and empowering approach, emphasizing critical strategies.</p>\n</li>\n<li dir=\"ltr\" style=\"\">\n<p dir=\"ltr\">Collaborate with global teams and units to integrate JEDIS principles into broader organizational functions.</p>\n</li>\n<li dir=\"ltr\" style=\"\">\n<p dir=\"ltr\">Engage with external parties to bring in knowledge and implement shared practices.</p>\n</li>\n<li dir=\"ltr\" style=\"\">\n<p dir=\"ltr\">Effectively manage the budget allocated for JEDIS work, ensuring prudent allocation and transparency.</p>\n</li>\n</ul>\n<p dir=\"ltr\">JEDIS Development:</p>\n<ul style=\"\">\n<li dir=\"ltr\" style=\"\">\n<p dir=\"ltr\">Continuously learn and gather feedback to refine and enhance the effectiveness of the JEDIS function.</p>\n</li>\n<li dir=\"ltr\" style=\"\">\n<p dir=\"ltr\">Collaborate with teams and stakeholders to further develop the JEDIS commitment within GPI and Global Function.</p>\n</li>\n<li dir=\"ltr\" style=\"\">\n<p dir=\"ltr\">Establish and adhere to accountability practices, regularly reporting to the IED, Board, and People Committee.</p>\n</li>\n<li dir=\"ltr\" style=\"\">\n<p dir=\"ltr\">Implement evidence-based mechanisms, including data collection and analysis, to inform strategic decisions.</p>\n</li>\n<li dir=\"ltr\" style=\"\">\n<p dir=\"ltr\">Build and curate a trusted resources library, fostering the accessibility and sharing of expertise across teams and communities.</p>\n</li>\n<li dir=\"ltr\" style=\"\">\n<p dir=\"ltr\">Establish a robust impact framework to measure and evaluate the effectiveness of JEDIS initiatives.<br><br></p>\n</li>\n</ul>\n<p dir=\"ltr\"><strong>For further information about this role, please see the full job description by clicking <a href=\"https://drive.google.com/file/d/1uwHm0dsdGFyU6QrWzmqLN4RNkMMfN9e9/view?usp=sharing\" rel=\"nofollow\" target=\"_blank\">HERE</a>.</strong></p>\n<p dir=\"ltr\"><strong>What we’re looking for:<br></strong></p>\n<p dir=\"ltr\">Remember no one has every skill or experience needed for this role and you’ll have the opportunity to learn a lot from the team. We believe someone who has a few of these is well suited to exceed in this role:</p>\n<ul style=\"\">\n<li dir=\"ltr\" style=\"\">\n<p dir=\"ltr\">Demonstrated JEDIS (Justice, Equity, Diversity, Inclusion &amp; Safety) experience</p>\n</li>\n<li dir=\"ltr\" style=\"\">\n<p dir=\"ltr\">Strong people management and project management skills.</p>\n</li>\n<li dir=\"ltr\" style=\"\">\n<p dir=\"ltr\">Track record in engaging with various communities of practice.</p>\n</li>\n<li dir=\"ltr\" style=\"\">\n<p dir=\"ltr\">Ability to build strong relationships and networks.</p>\n</li>\n<li dir=\"ltr\" style=\"\">\n<p dir=\"ltr\">Proven ability to work remotely with a virtual and diverse team.</p>\n</li>\n<li dir=\"ltr\" style=\"\">\n<p dir=\"ltr\">Virtual and on-site facilitation skills.</p>\n</li>\n<li dir=\"ltr\" style=\"\">\n<p dir=\"ltr\">Excellent communication and organizational skills.</p>\n</li>\n<li dir=\"ltr\" style=\"\">\n<p dir=\"ltr\">Digital literacy skills, familiarity with G-Suite, Slack, and Zoom is an advantage.</p>\n</li>\n<li dir=\"ltr\" style=\"\">\n<p dir=\"ltr\">Ability to demonstrate support for and belief in Greenpeace core aims &amp; values.</p>\n</li>\n</ul>\n<p dir=\"ltr\">Attitudes/Behaviours:</p>\n<ul style=\"\">\n<li dir=\"ltr\" style=\"\">\n<p dir=\"ltr\">Values diversity, trust, transparency, integrity.</p>\n</li>\n<li dir=\"ltr\" style=\"\">\n<p dir=\"ltr\">Inclusive behavior and cross-cultural sensitivity.</p>\n</li>\n<li dir=\"ltr\" style=\"\">\n<p dir=\"ltr\">Curious and solutions-oriented mindset.</p>\n</li>\n<li dir=\"ltr\" style=\"\">\n<p dir=\"ltr\">Systems change mindset.</p>\n</li>\n<li dir=\"ltr\" style=\"\">\n<p dir=\"ltr\">Self-driven and proactive.</p>\n</li>\n<li dir=\"ltr\" style=\"\">\n<p dir=\"ltr\">Actively seeks and provides feedback.</p>\n</li>\n<li dir=\"ltr\" style=\"\">\n<p dir=\"ltr\">Shares knowledge and practices active listening.</p>\n</li>\n</ul>\n<p> </p>\n<p dir=\"ltr\"><br><strong>What you can expect:</strong><br><br></p>\n<p dir=\"ltr\">You’ll be encouraged to develop both personally and professionally, taking advantage of the wide range of learning and development opportunities available to our staff. Staff can also access various wellbeing initiatives and also have the opportunity to join our global Equity, Diversity &amp; Inclusion staff communities.<br><br></p>\n<p dir=\"ltr\"><strong>Please visit the careers site </strong><a href=\"https://greenpeace1.recruitee.com/\" rel=\"nofollow\" target=\"_blank\"><strong>here</strong></a><strong>,</strong> to learn more about working for Greenpeace.<br><br><strong>To Apply</strong></p>\n<p> </p>\n<p dir=\"ltr\">We welcome everyone to apply for our positions. We understand that some candidates hesitate to apply unless they meet 100% of the criteria. However, we strongly encourage you to apply if you meet some of the key criteria for our roles. We’d love to know how your unique experience can bring value to our team. We believe in people power and having representation from many different communities to effect change.</p>\n<p dir=\"ltr\">If you share our vision, please click<strong> 'apply for this job'</strong> below, to begin your application.</p>\n<p dir=\"ltr\"> </p>\n<p dir=\"ltr\">To apply for this role, we require you to answer a selection of key criteria and upload your CV (<strong>in English</strong>) via our online application form.</p>\n<p dir=\"ltr\"> </p>\n<p dir=\"ltr\">Addressing the key criteria is an important part of your application. We will be looking for evidence that demonstrates your skills and experience in these areas. Use examples where possible, to draw attention to experience, knowledge, achievements and skills gained in past employment or voluntary/leisure activities, provided they are relevant to the post.</p>\n<p dir=\"ltr\"> </p>\n<p dir=\"ltr\">It’s advisable to prepare your responses to the key criteria before starting your online application, as you are unable to save and return to it at a later date.</p>\n<p dir=\"ltr\"> </p>\n<p dir=\"ltr\">If you have any questions about this vacancy or the application process, please email us at recruitment.int@greenpeace.org. Please note that all applications have to be filled out via the website and can't be submitted via this email.</p>\n<p dir=\"ltr\"> </p>\n<p dir=\"ltr\"><em>Greenpeace International is an equal opportunity employer with a longstanding commitment of providing a work environment that respects the dignity and worth of each individual. We recognise and value the benefits and strengths that diversity brings to our employees and the whole organisation and we thrive in an environment that encourages respect and trust. We do not discriminate in employment opportunities or practices on the basis of age, ancestry, citizenship, colour, disability, ethnicity, family or marital status, gender identity or expression, national origin, political affiliation, race, religion, sex, sexual orientation and would like to invite you especially to apply!</em></p>\n<p dir=\"ltr\"> </p>\n<p dir=\"ltr\"><strong>CLOSING DATE</strong>:<strong> Tuesday 9th January 2024, 23:59 (CEST)</strong></p>\n<p> </p>\n<img src=\"https://remotive.com/job/track/1866241/blank.gif?source=public_api\" alt=\"\"/>","tags":"[\"project management\",\"community management\",\"partnerships\",\"people management\",\"team management\",\"team lead\",\"diversity\",\"catalyst\",\"G Suite\"]","pubDate":"2023-12-23 01:20:47.000","link":"https://remotive.com/remote-jobs/hr/equity-diversity-inclusion-team-lead-1866241","savedDate":"2023-12-25 06:04:05.859","slug":"equity-diversity-inclusion-team-lead-greenpeace-6304"},{"id":9047709970,"title":"Marketing Designer for Sora Union ","company":"All Turtles","image":"https://remotive.com/job/1870094/logo","description":"<div class=\"h3\">Talent is everywhere, opportunity is not. Sora Union changes that.</div>\n<p>Sora Union is a professional services company specializing  in design, localization, engineering, staffing and QA projects for businesses, organizations and governments. The Sora Union team is globally distributed and made up of diverse and talented professionals impacted by or at risk of displacement due to conflict or climate change.</p>\n<p>We are looking for a creative and skilled Marketing Designer to enhance our marketing efforts through exceptional design. The ideal candidate will have a strong background in graphic design and a keen understanding of marketing principles. As a Marketing Designer, you will be responsible for creating visually engaging and strategically driven designs that effectively communicate our brand message and resonate with our target audiences.</p>\n<p><strong>YOU’LL BE RESPONSIBLE FOR:</strong></p>\n<ul style=\"\">\n<li style=\"\">Design compelling marketing materials, including digital ads, social media graphics, email campaigns, brochures, and presentations.</li>\n<li style=\"\">Collaborate closely with the marketing team to develop creative concepts and strategies that align with our brand and marketing objectives.</li>\n<li style=\"\">Ensure brand consistency across all marketing materials.</li>\n<li style=\"\">Stay current with design trends and marketing best practices, incorporating them into your work to keep our marketing efforts fresh and relevant.</li>\n<li style=\"\">Manage multiple design projects simultaneously, from concept to completion, within tight deadlines.</li>\n<li style=\"\">Provide input on marketing campaigns, offering creative design solutions to maximize impact.</li>\n<li style=\"\">Utilize and maintain a library of design assets, templates, and brand guidelines.</li>\n</ul>\n<p><strong>IDEALLY, YOU’LL HAVE:</strong></p>\n<ul style=\"\">\n<li style=\"\">A minimum of 5+ years of professional design experience in brand identity.</li>\n<li style=\"\">Proven experience in a Marketing Designer role or similar, with a strong portfolio showcasing design work in various marketing channels.</li>\n<li style=\"\">Proficiency in design software such as Adobe Creative Suite (Figma, Illustrator, Photoshop, InDesign) and familiarity with web design tools.</li>\n<li style=\"\">Excellent understanding of marketing principles and how design impacts audience engagement and conversion.</li>\n<li style=\"\">Strong creative thinking and problem-solving skills.</li>\n<li style=\"\">Excellent communication and collaboration skills, with the ability to work well in a remote team environment.</li>\n<li style=\"\">Bachelor's degree in Graphic Design, Marketing, or a related field is preferred.</li>\n</ul>\n<p>The Marketing Designer role is a full-time, 6 month contract position initially reporting to Design Manager, with a direct working relationship within a design pod. This role is a distributed position, and can be based in any location.</p>\n<p>Sora Union is committed to creating and fostering a diverse team. We encourage people from underrepresented backgrounds and all walks of life to apply. We are committed to providing reasonable accommodations to all applicants throughout the application process.</p>\n<img src=\"https://remotive.com/job/track/1870094/blank.gif?source=public_api\" alt=\"\"/>","tags":"[\"illustrator\",\"photoshop\",\"social media\",\"Figma\",\"adobe creative suite\",\"brand design\",\"graphic design\",\"InDesign\"]","pubDate":"2023-12-22 13:20:36.000","link":"https://remotive.com/remote-jobs/design/marketing-designer-for-sora-union-1870094","savedDate":"2023-12-25 06:04:05.859","slug":"marketing-designer-for-sora-union-all-turtles-4268"}]