[{"id":7694027664,"title":"UI/UX Designer","company":"Scroll","image":"https://avatars.githubusercontent.com/u/87750292?s=200&v=4","description":"&lt;div class=&quot;content-intro&quot;&gt;&lt;p&gt;Scroll is a Layer 2 scaling solution for Ethereum, specifically focusing on zkRollups. Key aspects of Scroll are zkRollup technology, Scalability, Efficiency, Security, and Developer-friendly. Overall, Scroll plays a crucial role in addressing Ethereum&#39;s scalability challenges and facilitating the growth of decentralized finance (DeFi) and other blockchain-based applications by providing a scalable and efficient Layer 2 solution.&amp;nbsp;&lt;/p&gt;&lt;/div&gt;&lt;h3&gt;&lt;strong&gt;Position Overview&lt;/strong&gt;&lt;/h3&gt;\n&lt;p&gt;Proficient UX/UI Designer to help us design user-friendly application and website complementary to the team’s needs. The ideal candidate shall have a strong knowledge of design principles, excellent graphic design skills, and high proficiency in Figma, and other relevant design software tools.&lt;/p&gt;\n&lt;h2&gt;Job requirement:&lt;/h2&gt;\n&lt;ul&gt;\n&lt;li&gt;Build wireframes, prototypes, and user flows to visualise design of application and website.&lt;/li&gt;\n&lt;li&gt;Design interactive and engaging graphics for various platforms, including websites, and application.&lt;/li&gt;\n&lt;li&gt;Remain current with design trends, tools, and technologies.&lt;/li&gt;\n&lt;li&gt;1-2 years of experience in UX and graphic design.&lt;/li&gt;\n&lt;li&gt;Proven portfolio showcasing a range of design projects and successful outcomes&lt;/li&gt;\n&lt;li&gt;Proficiency in design software such as Figma, Adobe Creative Suite.&lt;/li&gt;\n&lt;li&gt;Able to work in a highly dynamic environment&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;&lt;/p&gt;&lt;div class=&quot;content-conclusion&quot;&gt;&lt;h3&gt;&lt;strong&gt;About You&lt;/strong&gt;&lt;/h3&gt;\n&lt;ul&gt;\n&lt;li&gt;You are a self-starter and ability to take ownership, well organised, self-disciplined and effective when working autonomously on tasks and projects;&lt;/li&gt;\n&lt;li&gt;You are responsive, collaborative and committed person with a high work ethic;&lt;/li&gt;\n&lt;li&gt;You are a high class communicator who can articulate their views succinctly on calls or asynchronously in globally distributed, remote teams;&lt;/li&gt;\n&lt;li&gt;You relish working in an agile start-up environment;&lt;/li&gt;\n&lt;li&gt;You are a great listener who understands when to listen first and engages well with colleagues;&lt;/li&gt;\n&lt;li&gt;You are a resilient, driven individual who is willing and able to continually develop and iterate to succeed;&lt;/li&gt;\n&lt;/ul&gt;\n&lt;h3&gt;&lt;strong&gt;What We Offer&lt;/strong&gt;&lt;/h3&gt;\n&lt;ul&gt;\n&lt;li&gt;A mission-led, collaborative culture&lt;/li&gt;\n&lt;li&gt;Opportunity to work with cutting edge technology and like-minded people who are contributing to the progression of Ethereum&lt;/li&gt;\n&lt;li&gt;Competitive salary package / generous paid time off / annual growth budget&lt;/li&gt;\n&lt;li&gt;100% remote from any location with flexible hours&lt;/li&gt;\n&lt;li&gt;Home office set up / co-working membership allowance&lt;/li&gt;\n&lt;li&gt;Private healthcare in selected countries&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;&lt;em&gt;Scroll is proud to be an equal opportunity workplace. We are committed to equal employment opportunities regardless of race, color, ancestry, religion, sex, national origin, sexual orientation, age, citizenship, marital status, disability, gender identity, or Veteran status. If you have a disability or special need, please let us know and we&#39;ll do our best to accommodate.&lt;/em&gt;&lt;/p&gt;\n&lt;p&gt;&amp;nbsp;&lt;/p&gt;&lt;/div&gt;","tags":"[\"Finance\"]","pubDate":"2024-12-23T04:48:35.000Z","link":"https://job-boards.eu.greenhouse.io/scrollio/jobs/4500637101","slug":"ui-ux-designer-scroll-3058"},{"id":3636367691,"title":"SDET / QA Automation Engineer for ELS (remote-only opportunity, location - Euro)","company":"CloudLinux","image":"https://pbs.twimg.com/profile_images/696718028084482050/ymY3OEPk_400x400.png","description":"<p></p><p>We are looking for a<strong> SDET / QA Automation Engineer </strong>to join our Extended Lifecycle Support team. The ideal candidate should possess more than just technical expertise; they should have an unwavering commitment to quality and a deep passion for Python. We're looking for someone who not only writes Python code but also lives and breathes it. This candidate should think in Python, excel in Python, and communicate in Python. If you are excited about pushing the boundaries of QA engineering with your Python prowess, we encourage you to apply.</p><p>ELS (Extended Lifecycle Support) is a division of TuxCare, specializing in managing end-of-life Linux distributions. ELS offers services that automate and simplify Linux operations, reducing management tasks and patch delay risks through live patching. This approach ensures security and stability without the need for complex service migrations, even in high-availability environments.&nbsp;</p><p>Work is fully remote, with flexible hours, where you can plan your day and work from anywhere in the world.</p><p>More details about the project you can find on the product website TuxCare.com, about the company on Cloudlinux.com</p><p>As our SDET / QA Automation Engineer you will:</p><ul> <li>Diagnose, isolate, and implement remedies for package failures caused by errors in our updates.</li> <li>Prepare all needed documentation sets clarifying all the aspects of the product’s environment</li> <li>Add new automated test scenarios (Python), maintain continuous test execution (Jenkins), tracking test cycles execution results, recommending corrective actions, and working with the development engineers on resolution of problems</li> <li>Maintain and modify test environment and configuration as needed, create new test environments and configurations to meet customer-based configuration or problem reproducing requirements</li> <li>Continue to expand test automation within ELS continuous integration (CI) and continuous deployment (CD) environments</li> <li>Collaborate with c and python engineers</li> </ul><h3>Requirements: </h3><p><strong>To be successful you should have:</strong></p><ul> <li>You should speak Python, breathe Python, and think Python</li> <li>Bachelor’s degree in computer science, software engineering, or a similar field</li> <li>3+ years of experience in QA Automation (experience only in UI and/or API automation isn’t relevant for us)</li> <li>6+ years in QA</li> <li>Experience and the passion for Linux. Fluent in Linux CLI is a must!</li> <li>Strong shell scripting knowledge.</li> <li>In-depth knowledge of Python (we use 2.7 mostly) programming language is a must!</li> <li>Proficiency in object-oriented programming with Python</li> <li>Knowledge of Ansible, Docker</li> <li>Understanding of CI/CD systems, tools and approaches</li> <li>Experience in creation of Jenkins scripted/declarative pipelines</li> <li>Good understanding of DevOps principles and their relation to automation engineering</li> <li>Ability to work well with culturally diverse teams</li> <li>Proven ability to communicate well with peers and all levels of management</li> <li>Intermediate (and higher) English level</li> <li>Team player but also able to work independently using your initiative</li> <li>Happy in an agile, fast-paced environment</li> </ul><h3>Benefits: </h3><p><strong>What's in it for you?</strong></p><ul> <li>A focus on professional development.</li> <li>Interesting and challenging projects.</li> <li>Fully remote work with flexible working hours, that allows you to schedule your day and work from any location worldwide.</li> <li>Paid 24 days of vacation per year, 10 days of national holidays, and unlimited sick leaves.</li> <li>Compensation for private medical insurance.</li> <li>Co-working and gym/sports reimbursement.</li> <li>Budget for education.</li> <li>The opportunity to receive a reward for the most innovative idea that the company can patent.</li> </ul><p><br><em>By applying for this position, you consent to the processing of your personal data as described in our Privacy Policy (</em><a href=\"https://cloudlinux.com/candidate-privacy-notice\" target=\"_blank\" rel=\"nofollow noreferrer noopener\" class=\"external\"><em>https://cloudlinux.com/candidate-privacy-notice</em></a><em>), which provides detailed information on how we maintain and handle your data.</em></p>","tags":"[\"management\",\"engineering\"]","pubDate":"2024-12-23T00:00:00.000Z","link":"https://apply.workable.com/cloudlinux-1/j/105D814D1B","slug":"sdet-qa-automation-engineer-for-els-remote-only-opportunity-location-euro-cloudlinux-5502"},{"id":1836770879,"title":"Product Designer","company":"PandaDoc","image":"https://remotive.com/job/1957467/logo","description":"<div>We are seeking a Product Designer to join our dynamic Usability Team. This role is pivotal in transforming complex workflows into seamless, intuitive, and delightful user experiences.</div>\n<div>As a  Product Designer, you will focus on designing innovative solutions that enhance user satisfaction, adoption, and performance across the PandaDoc platform. By working closely with multidisciplinary teams, you will shape the future of usability and contribute to achieving our ambitious goals.</div>\n<div>The design team currently consists of a bunch of 23 designers, 5 researchers and one copywriter. We're spread across the globe, from Portugal, Spain, Poland, Ukraine and the U.S. </div>\n<div class=\"h2\">App Platform</div>\n<div>Our mission is to build a robust and adaptable platform foundation that provides essential building blocks for core functions such as billing and user management. We aim to drive seamless customer experiences and empower our internal teams to innovate and unlock value rapidly.</div>\n<div>Key Focus Areas</div>\n<ul style=\"\">\n<li style=\"\">Platform Robustness: We are committed to enhancing reliability, performance, and security, ensuring our platform meets the highest standards of operational excellence.</li>\n<li style=\"\">Customer Experience (CX): We strive to achieve high satisfaction and ease of use, making our platform the preferred choice for our users.</li>\n<li style=\"\">Value: We focus on generating substantial business growth, increasing revenue tied to the platform, and achieving cost-efficiency.</li>\n</ul>\n<div>The Usability Team plays a critical role in developing PandaDoc into a workflow-centric, reliable, and intelligent platform. We aim to:</div>\n<div>• Deliver value to users by creating streamlined, intuitive interfaces and workflows.</div>\n<div>• Establish reusable, modular foundations for scalable, consistent user experiences.</div>\n<div><br>Usability Leads</div>\n<ul style=\"\">\n<li style=\"\">Lydia Markwick – Principal Product Manager | <a href=\"%22https:/www.linkedin.com/in/lydiamarkwick/%22\" rel=\"nofollow\">LinkedIn</a></li>\n<li style=\"\">Taras Kuba – Senior Director, Product Design Architect | <a href=\"%22https:/www.linkedin.com/in/taraskuba/%22\" rel=\"nofollow\">LinkedIn</a></li>\n<li style=\"\">Darya Sobal (me 🤘) –  Head of Design | <a href=\"%22https:/www.linkedin.com/in/daryasobal/%22\" rel=\"nofollow\">LinkedIn</a> |</li>\n</ul>\n<div class=\"h1\">Role responsibilities</div>\n<ul style=\"\">\n<li style=\"\">Research: Proactively conducts usability testing and analyzing its results. Facilitates usability testing and interviews, and takes detailed notes during sessions. Capable of creating common research tools on their own: interview scripts, personas, customer journey maps, and research reports.</li>\n<li style=\"\">End-to-end Process: Conducts research and applies design methodologies with some autonomy. Begins to understand the importance of each stage in the design process, from ideation to prototyping and user feedback.</li>\n<li style=\"\">Communication and Facilitation: Engages in more effective verbal and written communication, improving clarity and persuasiveness. Starts to facilitate small group discussions and contributes to team meetings with confidence. English level - B2+.</li>\n<li style=\"\">Visual Design: Develops functional and flexible layouts seamlessly extending across various products. Balances type and color, creating visually appealing interface designs that articulate product capabilities. Evolving inclusion of motion demonstrates growing independence in enhancing user interaction.</li>\n<li style=\"\">User Experience: Crafts user journeys expressing product behavior aligned with user needs and basic workflows. Prototypes with design system components and meaningful data for interaction validation. While demonstrating increased independence, may seek guidance to ensure designs are accessible and adhere to standards.</li>\n<li style=\"\">Design System: Demonstrates confidence in using and complying with the design system. Clearly understands when to introduce custom components and styles, justifying the decision. Successfully contributes to the design system periodically. Experienced in creating local components or component libraries independently.</li>\n</ul>\n<div class=\"h1\">Who you are?</div>\n<ul style=\"\">\n<li style=\"\">You have a strong product portfolio</li>\n<li style=\"\">Knows diverse customer research methodologies</li>\n<li style=\"\">Recognize how solving real user problems positively impacts the business</li>\n<li style=\"\">Know the value of not only data but also looking beyond numbers</li>\n<li style=\"\">Good interpersonal and communication skills — your colleagues enjoy working with you</li>\n<li style=\"\">Capable of formally presenting to an audience in a clear, compelling manner</li>\n<li style=\"\">Verbal and written English skills are at an upper-intermediate level</li>\n</ul>\n<div class=\"h1\">Our tech stack</div>\n<ul style=\"\">\n<li style=\"\">Figma for craft and store design component library</li>\n<li style=\"\">Coda for our internal kitchen: processes, checklists, playbooks, etc.</li>\n<li style=\"\">Slack and Zoom for communication</li>\n<li style=\"\">Miro for collaboration</li>\n<li style=\"\">Zeroheight for design documentation</li>\n<li style=\"\">Amplitude, Uservoice, Rally and more for listening our users</li>\n<li style=\"\">Anything, you think would be valuable for us, can be tested</li>\n</ul>\n<div class=\"h1\">Hiring process</div>\n<div>Prepare your CV and portfolio and if you are ready to apply, please, use the form below.</div>\n<div>Then we'll have a few steps to make sure that we’re a perfect match for each other:</div>\n<ol style=\"\">\n<li style=\"\">You'll interview with a member of our recruiting team (20 min).</li>\n<li style=\"\">You'll then interview with me as a Hiring Manager (45 min).</li>\n<li style=\"\">During the next call with Product Leaders, we'll ask you to share a case study—without polished slides, just real design work, iterations, rejects, etc. (60 min)</li>\n<li style=\"\">We'll have a fun chance to see what it feels like to work together in a Jam session. (120 min)</li>\n<li style=\"\">Finally, you'll interview with the Vice President of Design (30 min).</li>\n</ol>\n<p>And will get your Offer letter!</p>\n<div class=\"h1\"><strong>Company Overview:</strong></div>\n<p>PandaDoc empowers more than 50,000 growing organizations to thrive by taking the work out of document workflow. PandaDoc provides an all-in-one document workflow automation platform that helps fast scaling teams accelerate the ability to create, manage, and sign digital documents including proposals, quotes, contracts, and more. For more information, please visit <a href=\"%22https:/www.pandadoc.com/%22\" rel=\"nofollow\" target='\"_blank\"'>https://www.pandadoc.com</a>.</p>\n<div class=\"h1\"><strong>Company Culture:</strong></div>\n<p>We’re known for our work-life balance, kind co-workers, &amp; creative virtual team-bonding events. And although our Pandas are located across the globe, we stay connected with the help of technology and ensure that everyone on our team feels, well, like a team.</p>\n<p>Pandas work best when they’re happy. We retain our talent by upholding our values of integrity &amp; transparency, and selling a product that changes the lives of our customers.</p>\n<div class=\"h1\">Benefits</div>\n<ul style=\"\">\n<li style=\"\">An honest, open culture that emphasizes feedback and promotes professional and personal development</li>\n<li style=\"\">An opportunity to work from anywhere — our team is distributed worldwide, from Lisbon to Manila, from Florida to California</li>\n<li style=\"\">6 self-care days</li>\n<li style=\"\">A competitive salary</li>\n<li style=\"\">And much more!</li>\n</ul>\n<img src=\"https://remotive.com/job/track/1957467/blank.gif?source=public_api\" alt=\"\"/>","tags":"[\"visual design\",\"prototyping\"]","pubDate":"2024-12-21T15:50:21.000Z","link":"https://remotive.com/remote-jobs/design/product-designer-1957467","slug":"product-designer-pandadoc-606"}]