[{"id":1697773198,"title":"Senior Android Engineer (Remote)","company":"DuckDuckGo","image":"https://spreadprivacy.com/content/images/2023/05/duckduckgo-logo_wide.png","description":"<p>Hi, we’re DuckDuckGo, the Internet privacy company for everyone who wants to take back their privacy now. For over a decade, we've been building our all-in-one product, developing new privacy technology, and working with policymakers to make online privacy simple and accessible for all.  </p>\n<p><br />Our app is now downloaded more than 78M times a year, and our private search engine packaged with it has become the #2 search engine on mobile in the United States and 18 other countries, including the United Kingdom, Canada, Australia, Germany, and the Netherlands. Oh, and we've been profitable since 2014, with revenue exceeding $100 million a year! Now, we’re rolling out a suite of new privacy solutions, including <u><a target=\"_blank\" rel=\"noopener\" href=\"https://www.spreadprivacy.com/introducing-email-protection-beta/\">Email Protection</a></u>,  <u><a target=\"_blank\" rel=\"noopener\" href=\"https://spreadprivacy.com/introducing-app-tracking-protection/\">App Tracking Protection</a></u> and our first-ever Desktop Apps for <u><a target=\"_blank\" rel=\"noopener\" href=\"https://spreadprivacy.com/introducing-duckduckgo-for-mac/\">Mac</a></u><a target=\"_blank\" rel=\"noopener\" href=\"https://spreadprivacy.com/introducing-duckduckgo-for-mac/\"> </a>and <u><a target=\"_blank\" rel=\"noopener\" href=\"https://spreadprivacy.com/windows-browser-open-beta/\">Windows</a></u>.<br /></p>\n<p><br /></p>\n<p>We’re looking for a <strong>Senior Android Engineer</strong> to help shape our all-in-one privacy solution and join our mission to show the world that protecting your privacy online can be simple.  </p>\n<p><br /></p>\n<p><strong>The Opportunity</strong> </p>\n<p>As a member of our Native Apps team, you'll be leading projects from proposal through postmortem, and taking ownership of delivering, maintaining and improving major application features. In our remote and collaborative environment, you'll also work with stakeholders from Product, Design and many other business areas as we work to raise the standard of trust online. <br /></p>\n<p><br /></p>\n<p><strong>What You Will Bring to DuckDuckGo</strong> </p>\n<ul><li>Ability to lead and collaborate on high-impact and complex projects from proposal through post-mortem.  </li><li>Skills to wrangle vague problems, propose innovative solutions, and execute them with a strong focus on metrics. </li><li>Significant Android engineering experience (7+ years) with experience working on at least two large native Android applications. </li><li>Solid experience programming in Kotlin.</li><li>Deep understanding of MV concepts, mobile threading, and memory management and how they apply to mobile applications.</li><li>A fundamental understanding of complex data structures and algorithms.</li><li>Ability to leverage both quantitative and qualitative data and collaborate with a cross-functional team to develop effective UX solutions.</li><li>Creative problem-solvers and risk-takers. You like to take initiative to push projects forward but know when to involve others.</li><li>Excellent communication skills. You can validate your decisions and communicate them clearly.</li></ul>\n<p><br /></p>\n<p><strong>How We Will Support You </strong> </p>\n<p>Our core values -- build trust, question assumptions, and validate direction -- underpin how we work day-to-day and the support we give our team members. We strive to empower our team members to be self-directed and self-motivated in their work.  </p>\n<p><br /></p>\n<ul><li><strong>Remote First, Always</strong>: We've always been a fully distributed company with team members all over the world. We trust you to get your work done wherever, whenever.</li></ul>\n<ul><li><strong>Commitment to Personal Growth:</strong> Every team member has an annual budget of $1,250 USD to invest in their professional development. Every team member also has a dedicated Career Advisor, who serves as a guide to help you develop your strengths, identify your motivations, and understand your opportunities for growth.</li></ul>\n<ul><li><strong>Leadership:</strong> We have many different types of leaders and possible combinations of leadership roles, so you can grow your career in a way that aligns best with your personal goals. You can seek additional leadership roles by being directly responsible for projects, taking ownership of areas of the company, developing and maintaining internal processes, or pursuing advisory roles.</li></ul>\n<ul><li><strong>Work/Life Balance: </strong>Team members have the freedom and flexibility to organize their own work schedules. We want you to thrive both in and out of the office. We trust you to use good judgment and take the time off that you need to bring your best self to work.  </li></ul>\n<p><br /></p>\n<p>We also offer <strong>paid parental leave, a co-working stipend, office setup reimbursement, </strong>and<strong> a wellness stipend.</strong> More support resources can be found in our, <u><a href=\"https://duckduckgo.com/assets/hiring/team_support_guide.pdf\" rel=\"noopener\">Team Member Support Guide</a></u>, which explains how we make your well-being a priority. </p>\n<p><br /></p>\n<p>For more information on how we collaborate worldwide, from <strong>leadership in our relatively flat organization </strong>to <strong>start-to-finish ownership,</strong> check out <u><a href=\"https://duckduckgo.com/assets/hiring/how_we_work.pdf\" rel=\"noopener\">DuckDuckGo Culture: How We Work.</a></u> </p>\n<p><br /></p>\n<p><strong>Compensation</strong> </p>\n<p>Annual compensation: <strong>$176,000 </strong>USD and stock options.  Compensation is the same within a professional level, regardless of geographic location or functional area, and the compensation for each professional level is transparent across the organization.</p>\n<p><br /></p>\n<p><strong>Hiring Process</strong> </p>\n<p>Hiring works best when it's a two-way street. Learn how we help you get to know DuckDuckGo and envision your future role here. Find out more about <u><a href=\"https://duckduckgo.com/assets/hiring/how_we_hire.pdf\" rel=\"noopener\">how we hire</a></u>. </p>\n<p><br /></p>\n<p><strong>Diversity, Equity, and Inclusion</strong> </p>\n<p>DuckDuckGo provides equal work opportunities to all team members and applicants<u>,</u> and it prohibits discrimination and harassment of any type on the basis of race, color, ethnicity, caste, religion, age, sex (including pregnancy), national origin, disability status, genetics, protected veteran status, sexual orientation, gender identity or expression, or any other characteristic protected by our policies or federal, state, or local laws.</p>\n<p><br /></p>\n<p>We want to ensure that our hiring process is accessible. If you need reasonable accommodation for any part of the application process because of a medical condition or disability, please send an email to <u><a href=\"mailto:careers@duckduckgo.com\" rel=\"noopener\">careers@duckduckgo.com</a></u> to let us know the nature of your request.  </p>\n<p><br /></p>\n<p>If you think you might thrive in this environment, we would love to hear from you. </p>\n<p><br /></p>\n<p><strong>Please note that:</strong> </p>\n<ul><li><p>Sometimes we meet up! Expect to travel at least two times a year: once for our all-hands meetup and again for a team retreat (each around 4-5 days). While extenuating circumstances may impact attendance, everyone is strongly encouraged to attend.</p></li><li>While we offer a flexible work arrangement with no core hours, expect an average full-time commitment of 40 hours per week. </li><li>A successful candidate will be subject to a background check and must receive satisfactory results of the same, as a condition of joining the team. </li><li>By applying for this role, you confirm that all information submitted is accurate and complete. You further acknowledge that providing false or fraudulent information during the application process is cause for denial of an offer, revocation of any existing offer, or other adverse action, up to and including termination after the start of your commencement of work.</li></ul>","tags":"[\"management\",\"engineering\",\"aws\"]","pubDate":"2024-01-04 10:03:32.000","link":"https://duckduckgo.recruitee.com/o/senior-android-engineer-remote-2024","savedDate":"2024-02-01 06:00:25.937","slug":"senior-android-engineer-remote-duckduckgo-7439"}]