[{"id":8914315464,"title":"Senior Project Director","company":"Deepsky","image":"https://remotive.com/job/2001188/logo","description":"<div>Deep Sky is at the forefront of addressing one of the most pressing challenges of our time: climate change. At Deep Sky, we are dedicated to developing and implementing Direct Air Capture (DAC) technologies that effectively remove excess carbon dioxide (CO2) from the atmosphere. We are actively working on a series of commercial scale facilities across Canada - come build with us!</div>\n<div> </div>\n<div>As the <strong>Senior Project Director</strong>, you will spearhead the development and delivery of Deep Sky's critical infrastructure projects, including Direct Air Capture (DAC) facilities and sequestration sites. This role demands strong leadership, technical expertise, and exceptional project management skills to oversee all project phases—from concept design to commissioning and startup. You will also play a critical role in building organizational capabilities, ensuring the team is equipped to execute mega-projects in the future. This includes a strategic focus on developing internal skills and aligning project development expertise with risk mitigation practices.</div>\n<p><br><br></p>\n<div class=\"h3\">Project Development:</div>\n<ul style=\"\">\n<li style=\"\">Lead teams through design and execution planning, delivering cost and schedule estimates ahead of Final Investment Decision (FID).</li>\n<li style=\"\">Manage site selection, power sourcing, structuring, and contracting for renewable energy integration.</li>\n<li style=\"\">Drive pre-FEED, FEED, and detailed design efforts to support project milestones and deliverables.</li>\n<li style=\"\">Collaborate with financial teams to develop and refine financial models for project viability.</li>\n<li style=\"\">Provide strategic recommendations to invest in team development, ensuring readiness for future mega-projects by building foundational experience and expertise.</li>\n</ul>\n<p><br><br></p>\n<div class=\"h3\">Execution and Delivery:</div>\n<ul style=\"\">\n<li style=\"\">Oversee procurement, construction, and commissioning phases, ensuring alignment with budgets, schedules, and project objectives.</li>\n<li style=\"\">Manage EPC contractors to ensure seamless execution, quality control, and safety compliance.</li>\n<li style=\"\">Provide a proven track record in leading large-scale construction projects, particularly in the energy, infrastructure, or industrial sectors.</li>\n</ul>\n<p><br><br></p>\n<div class=\"h3\">Strategic Focus on Depth and Breadth:</div>\n<ul style=\"\">\n<li style=\"\">Develop project development expertise holistically, including site selection, power structuring, financial modelling, and contracting, to prepare for future projects.</li>\n<li style=\"\">Ensure alignment of risks across project phases by integrating key elements such as off-take agreements and sequestration contracts.</li>\n<li style=\"\">Recommend and implement strategic over-investment in team building and development to establish organizational readiness for large-scale, high-complexity projects.</li>\n</ul>\n<p><br><br></p>\n<div class=\"h3\">Stakeholder and Community Management:</div>\n<ul style=\"\">\n<li style=\"\">Engage with local communities and government agencies to build and maintain strong relationships.</li>\n<li style=\"\">Act as the primary interface with stakeholders, ensuring transparency and alignment on project goals and progress.</li>\n</ul>\n<p><br><br></p>\n<div class=\"h3\">Team and Culture:</div>\n<ul style=\"\">\n<li style=\"\">Build, mentor, and lead teams to achieve project objectives.</li>\n<li style=\"\">Foster a culture of collaboration, innovation, and accountability across the organization.</li>\n<li style=\"\">Be available on-site as required to support project milestones and operational readiness.</li>\n</ul>\n<div><strong>Education</strong></div>\n<div>Bachelor’s or Master’s degree in Engineering, Environmental Science, Project Management, or related field.</div>\n<div> </div>\n<div><strong>Experience</strong></div>\n<div><strong>- Project Development</strong>: Extensive experience leading teams through design and execution plans, including cost and schedule estimation.</div>\n<div><strong>- Pre-FEED and FEED</strong>: Demonstrated ability to manage pre-FEED and FEED phases with successful outcomes.</div>\n<div><strong>- Construction</strong>: Proven expertise in managing large-scale energy, infrastructure, or industrial construction projects.</div>\n<div><strong>- EPC Management</strong>: Deep understanding of Engineering, Procurement, and Construction processes.</div>\n<div><strong>- Commissioning and Startup</strong>: Hands-on experience leading commissioning and startup phases of major projects.</div>\n<div><strong>- Community and Government Engagement</strong>: Proficiency in managing relationships with local communities and government agencies.</div>\n<div> </div>\n<div><strong>Skills</strong></div>\n<div>- Strong knowledge of site selection, power sourcing, structuring, and contracting strategies.</div>\n<div>- Financial acumen, including proficiency in financial modelling and CAPEX management</div>\n<div>- Ability to manage multidisciplinary teams with a collaborative leadership style.</div>\n<div>- Proactive in identifying and mitigating project risks across all phases, with a focus on aligning off-take and sequestration contracts.</div>\n<div>- Willingness to spend time on-site as needed to ensure project success.</div>\n<div> </div>\n<div><strong>Culture Fit</strong></div>\n<div>- Alignment with Deep Sky mission and values.</div>\n<div>- A natural collaborator who thrives in fast-paced, high-impact environments.</div>\n<img src=\"https://remotive.com/job/track/2001188/blank.gif?source=public_api\" alt=\"\"/>","tags":"[\"project management\",\"community management\",\"startup\",\"infrastructure\"]","pubDate":"2025-04-26T12:50:29.000Z","link":"https://remotive.com/remote-jobs/project-management/senior-project-director-2001188","slug":"senior-project-director-deepsky-8404"},{"id":5624926609,"title":"C# Application Developer","company":"Spektrum","image":"https://remotive.com/job/1999050/logo","description":"<div class='\"content-intro\"'>\n<p>Spektrum have a wide range of exciting opportunities in several global locations.</p>\n<p>We are always looking to add great new talent to our team and look forward to hearing from you.</p>\n</div>\n<p>Spektrum supports apex purchasers (NATO, UN, EU, and National Government and Defence) and their Tier 1 supplier ecosystem with a wide range of specialist services. We provide our clients with professional services, specialised aerospace and defence sales, delivery, and operational subject matter expertise. We are looking for personnel to join our team and support key client projects.</p>\n<hr>\n<p><strong>Who we are supporting</strong><strong> </strong></p>\n<p>The NATO Communication and Information Agency (NCIA) is responsible for providing secure and effective communications and information technology (IT) services to NATO's member countries and its partners. The agency was established in 2012 and is headquartered in Brussels, Belgium.</p>\n<p>The NCIA provides a wide range of services, including:</p>\n<ul style=\"\">\n<li style=\"\">Cyber Security: The NCIA provides advanced cybersecurity solutions to protect NATO's communication networks and information systems against cyber threats.</li>\n<li style=\"\">Command and Control Systems: The NCIA develops and maintains the systems used by NATO's military commanders to plan and execute operations.</li>\n<li style=\"\">Satellite Communications: The NCIA provides satellite communications services to enable secure and reliable communications between NATO forces.</li>\n<li style=\"\">Electronic Warfare: The NCIA provides electronic warfare services to support NATO's mission to detect, deny, and defeat threats to its communication networks.</li>\n<li style=\"\">Information Management: The NCIA manages NATO's information technology infrastructure, including its databases, applications, and servers.</li>\n</ul>\n<p>Overall, the NCIA plays a critical role in ensuring the security and effectiveness of NATO's communication and information technology capabilities.</p>\n<p><strong>The program </strong></p>\n<p><strong>Assistance and Advisory Service (AAS)</strong></p>\n<p>The NATO Communications and Information Agency (NCI Agency) is NATO’s principal C3 capability deliverer and CIS service provider. It provides, maintains and defends the NATO enterprise-wide information technology infrastructure to enable Allies to consult together under Article IV, and, when required, stand together in the face of attack under Article V.</p>\n<p>To provide these critical services, in the modern evolving dynamic environment the NCI Agency needs to build and maintain high performance-engaged workforce. The NCI Agency workforce strategically consists of three major categorise's: NATO International Civilians (NIC)'s, Military (Mil), and Interim Workforce Consultants (IWC)'s. The IWCs are a critical part of the overall NCI Agency workforce and make up approximately 15 percent of the total workforce.</p>\n<hr>\n<p><strong>Role Background</strong></p>\n<p>The NATO Information and Communication Agency (NCI Agency) located in The Hague, The Netherlands, is currently involved in the development of new capabilities for NATO as well as in the support of existing capabilities. In the light of these activities, the C2 Centre is looking for one full stack C# desktop developer with experience in developing Windows desktop applications and with strong user interface proficiency.</p>\n<p>The Full Stack C# Desktop Developer will provide the technical subject matter expertise to enable and guide the design and development of integrated solutions that meet current and future business needs. More specifically, the work will support the full software development cycle of TOPFAS.</p>\n<p>The main objective of this statement of work is the development of new capabilities and the enhancement of existing features in the existing NATO TOPFAS Service.</p>\n<p>Delivery of the services under this SoW requires skills of ONE Desktop Software Developer to update TOPFAS functionality and data structures to meet the mid-term requirements for enabling inter- operability between TOPFAS and other systems.</p>\n<p><strong>Role Duties and Responsibilities</strong></p>\n<ul style=\"\">\n<li style=\"\">Implement and review software changes as required using Azure DevOps.</li>\n<li style=\"\">Support the development of the front-end application and communication with back end services.</li>\n<li style=\"\">Implement new interfaces and improve existing interfaces with other systems, both file based and online real time.</li>\n<li style=\"\">Coordinate the technical work with the teams and systems required to integrate, including integration testing.</li>\n<li style=\"\">Create user stories, including acceptance criteria and test cases to evaluate the functionality.</li>\n<li style=\"\">Support bug fixing and stability improvements.</li>\n<li style=\"\">Create and update documentation.</li>\n<li style=\"\">Conduct impact analysis, to investigate which are the best ways to solve a certain problem, their effort estimation, document and present their pros and cons to the team.</li>\n</ul>\n<p><strong>Essential Skills and Experience</strong></p>\n<p>Required minimum qualifications are;</p>\n<ul style=\"\">\n<li style=\"\">More than 10 years of experience as Software Developer, in which at least 5 are in C#.</li>\n<li style=\"\">Strong experience (at least 5 years) in WinForms (Microsoft desktop application development).</li>\n<li style=\"\">In depth knowledge of C#</li>\n<li style=\"\">Proficient with third party UI frameworks</li>\n<li style=\"\">Solid understanding of async programming / multi-thread applications</li>\n<li style=\"\">Good understanding of integration patterns and message exchange formats such as JSON and XML.</li>\n<li style=\"\">Strong knowledge of OO principles and patterns</li>\n<li style=\"\">Strong knowledge of APIs development, both as consumer and provider.</li>\n<li style=\"\">Experience with Git version source control</li>\n<li style=\"\">Basic knowledge of SQL Server and database querying</li>\n</ul>\n<p>Preferable qualifications are:</p>\n<ul style=\"\">\n<li style=\"\">Experience with Azure DevOps</li>\n<li style=\"\">Experience with Playwright or other test automation tools.</li>\n<li style=\"\">Strong experience (at least 4 years) with DevExpress</li>\n<li style=\"\">Experience building (graph) diagrams using GoJS or similar Javascript libraries.</li>\n<li style=\"\">Experience with HTML5, JavaScript and CSS3 is a plus</li>\n</ul>\n<p>Relevant soft skills are:</p>\n<ul style=\"\">\n<li style=\"\">Very good presentation skills, taking in consideration the target audience.</li>\n<li style=\"\">Team player, friendly and always willing to help others and to share knowledge.</li>\n<li style=\"\">Good collaboration skills, with the ability to work in a multinational and diverse team</li>\n<li style=\"\">Growth mind set, always wanting to improve and to learn.</li>\n<li style=\"\">Proactivity and taking ownership at all times.</li>\n</ul>\n<p><strong>Language Proficiency</strong></p>\n<ul style=\"\">\n<li style=\"\">Business English</li>\n</ul>\n<p><strong>Education</strong></p>\n<ul style=\"\">\n<li style=\"\">Master’s degree in Computer Science/Engineering or equivalent.</li>\n</ul>\n<p><strong>Working Location</strong></p>\n<ul style=\"\">\n<li style=\"\">Remote</li>\n</ul>\n<p><strong>Working Policy</strong></p>\n<ul style=\"\">\n<li style=\"\">Off-Site</li>\n</ul>\n<p><strong>Travel</strong></p>\n<ul style=\"\">\n<li style=\"\">Some travel to other NATO sites may be required</li>\n</ul>\n<p><strong>Security Clearance</strong></p>\n<ul style=\"\">\n<li style=\"\">Valid National or NATO Secret personal security clearance</li>\n</ul>\n<div class='\"content-conclusion\"'>\n<p>We never know what new opportunities might be just over the horizon. If this opportunity isn't for you please feel free to send us your resume anyway and be the first to know if something suitable for your skills and experience comes up. </p>\n</div>\n<img src=\"https://remotive.com/job/track/1999050/blank.gif?source=public_api\" alt=\"\"/>","tags":"[\"C#\",\"SQL Server\"]","pubDate":"2025-04-26T00:50:22.000Z","link":"https://remotive.com/remote-jobs/software-dev/c-application-developer-1999050","slug":"c-application-developer-spektrum-4515"}]