[{"id":7401097647,"title":"R&D Software Engineer","company":"Mechanical Orchard","image":"https://pbs.twimg.com/profile_images/1592609773958025216/CaG1yAqK_400x400.png","description":"<div class=\"section page-centered\" data-qa=\"job-description\"><div><span style=\"font-size: 11pt\">Mechanical Orchard is a fast-growing startup that takes a fresh view on old problems. We replace legacy computing systems for the Global 2000, with a focus on mitigating risk and creating a genuinely solid foundation for innovating and adapting.&nbsp;</span></div><div><br></div><div><span style=\"font-size: 11pt\">Our background in software development and the impact on the industry is well known, and we've literally helped write the book on XP and other impactful agile practices. We’re applying the same thoughtfulness and rigor in weaving AI into everything we do. We believe in the durable principles behind agile, and embrace the power of cross-functional teams, collective ownership, test driven development, short feedback loops, and continuous improvement.</span></div><div><br></div><div><span style=\"font-size: 11pt\">We are Generous, Ethical, Effective, and Kind.</span></div><div><br></div><div><span style=\"font-size: 11pt\">Mechanical Orchard takes a disciplined approach to legacy modernization, starting with a focused, collaborative discovery phase to create a shared understanding of the existing system.&nbsp;This is followed by a “steel thread” that paves a path to production, cutting through integration, testing, access, and organizational hurdles for the first modernized job or application workload. We then scale up and accelerate the modernization process, gradually reducing risk and steadily unlocking innovation for our customers.</span></div><div><br></div><div><span style=\"font-size: 11pt\">Our R&amp;D team is leading the way in using generative AI and other technology to accelerate this legacy modernization journey.</span></div><div><br></div><div><span style=\"font-size: 11pt\">We’re starting with comprehension tools to facilitate reverse engineering, with AI-generated source summaries, interactive dependency visualizations, and LLM agents that empower our delivery teams and allow them to hit the ground running.</span></div><div><br></div><div><span style=\"font-size: 11pt\">Here’s what Jeff Schomay, our staff AI engineer has to say about it:</span></div><div><br></div><div><i style=\"font-size: 11pt\">“Working on the R&amp;D team offers constant fun and interesting challenges.&nbsp; Legacy code bases are hard enough to understand by trained software engineers, let alone AIs, and the traditional code-aware models and embedding techniques don’t work so well with COBOL, so we have to make innovative inroads to the problems that build upon each other.&nbsp; But the effort is worth it and we feel like wizards when our clients start realizing that we can show them insights into their own systems that they’ve been working on for over 30 years that they’ve never seen before.”</i></div><div><br></div><div><span style=\"font-size: 11pt\">Our vision is an AI-first platform that streamlines the entire modernization process from discovery through to production operations. This platform aims to augment the capabilities of our delivery teams, offer unparalleled transparency for our customers, and firmly establish Mechanical Orchard as a disruptive force in the legacy modernization industry.</span></div><div><br></div><div><span style=\"font-size: 11pt\">As a Software Engineer on the Mechanical Orchard R&amp;D team, you will work as part of a cross functional team developing internal and/or customer facing tools and/or products using Elixir, python or other programming languages, across the entire vertical web or API application stack.</span></div><div><br></div><div><span style=\"font-size: 11pt\">In this role, you will be expected to:</span></div><div><br></div><div><span style=\"font-size: 11pt\">-  Collaborate closely with other engineers and other roles such as product managers, data scientists or ML researchers, or product designers</span></div><div><span style=\"font-size: 11pt\">-  Use Extreme Programming practices such as as pair programming, test-driven development, refactoring, continuous integration and continuous delivery</span></div><div><span style=\"font-size: 11pt\">-  Operate and support production platforms and applications as a team in the context of the agile DevOps model</span></div><div><span style=\"font-size: 11pt\">-  Collaborate with other teams at Mechanical Orchard, including client delivery and sales teams on technical discovery efforts for existing customer systems including legacy applications</span></div><div><span style=\"font-size: 11pt\">-  Continuously learn about relevant emerging technologies or practices and foster the growth of the team and organization through mentorship, tech talks, and other means</span></div><div><br></div><div><span style=\"font-size: 11pt\">As the ideal candidate, you have at least 3 years of experience as a software engineer in a professional, team based environment, with exposure or demonstrated passion for XP practices such as pair programming and test driven development.&nbsp;</span></div><div><br></div><div><span style=\"font-size: 11pt\">You are comfortable as a full stack developer, have expertise in at least one modern programming language and application framework, built on a foundation of theoretical knowledge about computer science and software engineering.</span></div><div><br></div><div><span style=\"font-size: 11pt\">Strong communication and collaboration skills as well as empathy are essential for working closely with the R&amp;D team, our internal and external customers, and others at Mechanical Orchard.</span></div><div><br></div><div><span style=\"font-size: 11pt\">This is a full time, remote position, and we’re looking for candidates in the US Eastern, US Central, or (EU) CET time zones.</span></div><div><br></div><div><span style=\"font-size: 11pt\">Occasional travel may be required for customer visits or team gatherings.&nbsp;</span></div></div><div class=\"section page-centered\" data-qa=\"closing-description\"><div><span style=\"font-size: 11pt\">Mechanical Orchard, Inc. is an Equal Opportunity Employer and Prohibits Discrimination and Harassment of Any Kind. Mechanical Orchard, Inc. is committed to the principle of equal employment opportunity for all employees and to providing employees with a work environment free of discrimination and harassment. All employment decisions at Mechanical Orchard, Inc. are based on business needs, job requirements and individual qualifications, without regard to race, color, religion or belief, national, social or ethnic origin, sex (including pregnancy), age, physical, mental or sensory disability, HIV Status, sexual orientation, gender identity and/or expression, marital, civil union or domestic partnership status, past or present military service, family medical history or genetic information, family or parental status, or any other status protected by the laws or regulations in the locations where we operate. Mechanical Orchard, Inc. will not tolerate discrimination or harassment based on any of these characteristics. Mechanical Orchard, Inc. encourages applicants of all ages. Mechanical Orchard, Inc. will provide reasonable accommodation to employees who have protected disabilities consistent with local law.</span></div><div><br></div><div>We look forward to reviewing your application. Thanks!</div></div><div class=\"section page-centered last-section-apply\" data-qa=\"btn-apply-bottom\"><a class=\"postings-btn template-btn-submit hex-color\" data-qa=\"show-page-apply\" href=\"https://jobs.lever.co/mechanicalorchard/36272549-143a-43fc-af4a-1124f324c57e/apply\">Apply for this job</a></div>","tags":"[\"elixir\",\"engineering\",\"aws\"]","pubDate":"2024-02-10 02:57:34.162","link":"https://jobs.lever.co/mechanicalorchard/36272549-143a-43fc-af4a-1124f324c57e","savedDate":"2024-02-10 02:57:34.162","slug":"r-d-software-engineer-mechanical-orchard-3646"},{"id":5625164648,"title":"Freelance | Contract Senior Web Engineer","company":"10up","image":"https://pbs.twimg.com/profile_images/2738508979/760be3edebfa0195e36fb3dba07297c1_400x400.png","description":"<div class=\"section page-centered\" data-qa=\"job-description\"><div><b>Location: Remote - Anywhere </b>(Open to applicants located anywhere around the globe.)</div><div><br></div><div>At 10up, we call developers like you engineers because you aren't just a \"coder\": you're an innovative problem solver that uses web programming skills to divine smart, creative solutions to client challenges.&nbsp;</div><div><br></div><div>As a leading digital agency, 10up's client roster spans from innovative startups and impactful non-profits to some of the biggest names in the industry, such as ESPN, Google, The New York Times Co., Microsoft, and The Nobel Prize Committee. 10uppers have been pushing the boundaries of web experiences for over 12 years—become an engineer that innovates the internet by building exciting projects alongside a top-in-the-field team.</div><div><br></div><div>As a 10up contractor, you have options for flexible and alternative work schedules. Intentionally remote since day one, spanning six continents and 40 countries, 10up fully embraces the benefits of distributed work.</div><div><br></div></div><div class=\"section page-centered\"><div><h3>What you will do: </h3><ul class=\"posting-requirements plain-list\"><ul><li>Develop enterprise-level WordPress plugins and/or themes primarily using PHP and Gutenberg blocks in <a href=\"http://React.js\" class=\"postings-link\">React.js</a>.</li><li>Provide code reviews.</li><li>Drive strategy and lead back-end technical vision on large-scale projects.</li><li>Solve complex problems in simple yet elegant ways.</li><li>Ultimately you will make the web better by finely crafting websites, apps, and tools that reach millions of online visitors every day.</li><div><br></div></ul></ul></div></div><div class=\"section page-centered\"><div><h3>About you: </h3><ul class=\"posting-requirements plain-list\"><ul><li>You love perfecting your skills in WordPress engineering and Gutenberg.</li><li>You have a code portfolio. Link us to your best WordPress work on GitHub and you’ll never have to do any live coding or whiteboard testing!&nbsp;</li><li>You are comfortable talking to clients and team members to clearly present your thoughts.</li><li>You have extensive Git workflow experience in back-end-focused web development.</li><li>You have the ability to expertly debug performance and caching issues.</li><li>You prefer to work fully remote and are effective at engaging in a distributed team from the location of your choosing.</li></ul></ul></div></div><div class=\"section page-centered\" data-qa=\"closing-description\"><div><b style=\"font-size: 18px\">Join our team!&nbsp;</b></div><div><br></div><div>If you are passionate about 10up's mission and think you have what it takes to be successful in this role even if you don't check all the boxes, please apply. We'd appreciate the opportunity to personally review your application. Everyone gets a response.</div><div><br></div><div>Read more about <a href=\"https://drive.google.com/file/d/1nQ9yWRqfDAdrriYRnBNzYo7w59auYxMe/view\" class=\"postings-link\">What to Expect</a> through our Recruiting process.</div><div><br></div><div>Upon meeting the necessary criteria, you'll join the 10up contractor network. This grants you access to project invitations tailored to your expertise and time availability, although project opportunities may not arise instantly.</div><div><br></div></div><div class=\"section page-centered last-section-apply\" data-qa=\"btn-apply-bottom\"><a class=\"postings-btn template-btn-submit hex-color\" data-qa=\"show-page-apply\" href=\"https://jobs.lever.co/10up-2/a1337c77-8c0e-4402-ad68-505c33639208/apply\">Apply for this job</a></div>","tags":"[\"engineering\"]","pubDate":"2024-02-10 02:57:34.161","link":"https://jobs.lever.co/10up-2/a1337c77-8c0e-4402-ad68-505c33639208","savedDate":"2024-02-10 02:57:34.161","slug":"freelance-contract-senior-web-engineer-10up-3934"},{"id":1447802562,"title":"R&D Product Designer","company":"Mechanical Orchard","image":"https://pbs.twimg.com/profile_images/1592609773958025216/CaG1yAqK_400x400.png","description":"<div class=\"section page-centered\" data-qa=\"job-description\"><div><span style=\"font-size: 11pt\">Mechanical Orchard is a fast-growing startup that takes a fresh view on old problems. We replace legacy computing systems for the Global 2000, with a focus on mitigating risk and creating a genuinely solid foundation for innovating and adapting.&nbsp;</span></div><div><br></div><div><span style=\"font-size: 11pt\">Our background in software development and the impact on the industry is well known, and we've literally helped write the book on XP and other impactful agile practices. We’re applying the same thoughtfulness and rigor in weaving AI into everything we do. We believe in the durable principles behind agile, and embrace the power of cross-functional teams, collective ownership, test driven development, short feedback loops, and continuous improvement.</span></div><div><br></div><div><span style=\"font-size: 11pt\">We are Generous, Ethical, Effective, and Kind.</span></div><div><br></div><div><span style=\"font-size: 11pt\">Mechanical Orchard takes a disciplined approach to legacy modernization, starting with a focused, collaborative discovery phase to create a shared understanding of the existing system.&nbsp;This is followed by a “steel thread” that paves a path to production, cutting through integration, testing, access, and organizational hurdles for the first modernized job or application workload. We then scale up and accelerate the modernization process, gradually reducing risk and steadily unlocking innovation for our customers.</span></div><div><br></div><div><span style=\"font-size: 11pt\">Our R&amp;D team is leading the way in using generative AI and other technology to accelerate this legacy modernization journey.</span></div><div><br></div><div><span style=\"font-size: 11pt\">We’re starting with comprehension tools to facilitate reverse engineering, with AI-generated source summaries, interactive dependency visualizations, and LLM agents that empower our delivery teams and allow them to hit the ground running.</span></div><div><br></div><div><span style=\"font-size: 11pt\">Here’s what Jeff Schomay, our staff AI engineer has to say about it:</span></div><div><br></div><div><i style=\"font-size: 11pt\">“Working on the R&amp;D team offers constant fun and interesting challenges.&nbsp; Legacy code bases are hard enough to understand by trained software engineers, let alone AIs, and the traditional code-aware models and embedding techniques don’t work so well with COBOL, so we have to make innovative inroads to the problems that build upon each other.&nbsp; But the effort is worth it and we feel like wizards when our clients start realizing that we can show them insights into their own systems that they’ve been working on for over 30 years that they’ve never seen before.”</i></div><div><br></div><div><span style=\"font-size: 11pt\">Our vision is an AI-first platform that streamlines the entire modernization process from discovery through to production operations. This platform aims to augment the capabilities of our delivery teams, offer unparalleled transparency for our customers, and firmly establish Mechanical Orchard as a disruptive force in the legacy modernization industry.</span></div><div><br></div><div><span style=\"font-size: 11pt\">As an R&amp;D Product Designer at Mechanical Orchard, you will work as part of a cross functional research and development team, building tools and products that help internal and external customers understand complex legacy systems and accelerate modernization efforts.</span></div><div><br></div><div><span style=\"font-size: 11pt\">In this role, you will be expected to:</span></div><div><br></div><div><span style=\"font-size: 11pt\">-  Collaborate closely with product managers, engineers, AI researchers and other roles on the team</span></div><div><span style=\"font-size: 11pt\">-  Engage closely with customer delivery teams, external customers, and business stakeholders to understand their needs, and leverage this understanding to come up with potential solutions</span></div><div><span style=\"font-size: 11pt\">-  Conduct user research, create wireframes and prototypes, and test designs to ensure they are effective and solve the desired problemIterate on designs based on qualitative and quantitative feedback from users, customers, and the development team&nbsp;</span></div><div><span style=\"font-size: 11pt\">-  Facilitate brainstorming sessions and collaborative design workshops with remote teamsPair with engineers as needed to help with implementation of designs&nbsp;</span></div><div><span style=\"font-size: 11pt\">-  Apply a systems level thought approach when needed</span></div><div><span style=\"font-size: 11pt\">-  Apply and advocate for modern product design practices including lean UX and user centered design</span></div><div><br></div><div><span style=\"font-size: 11pt\">As the ideal candidate, you have at least 3 years of experience as a product designer in a professional, team-based environment, with a portfolio of previous design work and a deep understanding of user-centered design principles.&nbsp;</span></div><div><br></div><div><span style=\"font-size: 11pt\">You are comfortable with a variety of design tools, including Figma.&nbsp;</span></div><div><br></div><div><span style=\"font-size: 11pt\">Experience designing complex user interfaces and/or data visualizations will be helpful for this role, and having worked as part of highly collaborative agile or Extreme Programming teams is a strong bonus.</span></div><div><br></div><div><span style=\"font-size: 11pt\">Strong communication and collaboration skills are critical, as is the ability to empathize and engage effectively with a diverse team including the immediate development team, domain experts, customers, and other stakeholders within Mechanical Orchard.</span></div><div><br></div><div><span style=\"font-size: 11pt\">This is a full time, remote position, and we’re looking for candidates in the US Eastern, US Central, or the (Europe) CET time zone.</span></div><div><br></div><div><span style=\"font-size: 11pt\">Occasional travel may be required for customer visits or team gatherings.&nbsp;</span></div></div><div class=\"section page-centered\" data-qa=\"closing-description\"><div><span style=\"font-size: 11pt\">Mechanical Orchard, Inc. is an Equal Opportunity Employer and Prohibits Discrimination and Harassment of Any Kind. Mechanical Orchard, Inc. is committed to the principle of equal employment opportunity for all employees and to providing employees with a work environment free of discrimination and harassment. All employment decisions at Mechanical Orchard, Inc. are based on business needs, job requirements and individual qualifications, without regard to race, color, religion or belief, national, social or ethnic origin, sex (including pregnancy), age, physical, mental or sensory disability, HIV Status, sexual orientation, gender identity and/or expression, marital, civil union or domestic partnership status, past or present military service, family medical history or genetic information, family or parental status, or any other status protected by the laws or regulations in the locations where we operate. Mechanical Orchard, Inc. will not tolerate discrimination or harassment based on any of these characteristics. Mechanical Orchard, Inc. encourages applicants of all ages. Mechanical Orchard, Inc. will provide reasonable accommodation to employees who have protected disabilities consistent with local law.</span></div><div><br></div><div>We look forward to reviewing your application. Thanks!</div></div><div class=\"section page-centered last-section-apply\" data-qa=\"btn-apply-bottom\"><a class=\"postings-btn template-btn-submit hex-color\" data-qa=\"show-page-apply\" href=\"https://jobs.lever.co/mechanicalorchard/a129c091-64fa-407c-a5fc-00464df065ab/apply\">Apply for this job</a></div>","tags":"[\"engineering\",\"aws\"]","pubDate":"2024-02-10 02:57:34.161","link":"https://jobs.lever.co/mechanicalorchard/a129c091-64fa-407c-a5fc-00464df065ab","savedDate":"2024-02-10 02:57:34.161","slug":"r-d-product-designer-mechanical-orchard-8334"},{"id":6440562030,"title":"Freelance | Contract Senior Front End Engineer","company":"10up","image":"https://pbs.twimg.com/profile_images/2738508979/760be3edebfa0195e36fb3dba07297c1_400x400.png","description":"<div class=\"section page-centered\" data-qa=\"job-description\"><div><b>Location: Remote - Anywhere</b> (Open to applicants located anywhere around the globe.)</div><div><br></div><div>At 10up, we call developers like you engineers because you aren't just a \"coder\": you're an innovative problem solver that uses web programming skills to divine smart, creative solutions to client challenges.&nbsp;</div><div><br></div><div>As a leading digital agency, 10up's client roster spans from innovative startups and impactful non-profits to some of the biggest names in the industry, such as ESPN, Google, The New York Times Co., Microsoft, and The Nobel Prize Committee. 10uppers have been pushing the boundaries of web experiences for over 12 years—become an engineer that innovates the internet by building exciting projects alongside a top-in-the-field team.</div><div><br></div><div>As a 10up contractor, you have options for flexible and alternative work schedules. Intentionally remote since day one, spanning six continents and 40 countries, 10up fully embraces the benefits of distributed work.</div><div><br></div></div><div class=\"section page-centered\"><div><h3>What you will do: </h3><ul class=\"posting-requirements plain-list\"><ul><li>Develop large-scale modular applications with advanced knowledge of HTML, CSS, and JavaScript.</li><li>Provide code reviews.</li><li>Bring art direction to life on the web through quality craftsmanship defined by performance, accessibility, maintainability, and aesthetic refinement on large-scale projects.</li><li>Solve complex problems in simple yet elegant ways.</li><li>Ultimately you will make the web better by finely crafting websites, apps, and tools that reach millions of online visitors every day.</li></ul></ul></div></div><div class=\"section page-centered\"><div><h3>About you: </h3><ul class=\"posting-requirements plain-list\"><ul><li>You love perfecting your skills in cross-browser/device front-end engineering through crafting custom UI components in either React or a WordPress (block editor) stack.</li><li>You have a code portfolio of real-world samples showcasing your technical abilities. Link us to your best custom work on GitHub and you’ll never have to do any live coding or whiteboard testing!&nbsp;</li><li>You are comfortable talking to clients and team members to clearly present your thoughts.</li><li>You’re proficient at building coded style guides and creating highly componentized systems.</li><li>You prefer to work fully remote and are effectively engaging in a distributed team from the location of your choosing.</li></ul></ul></div></div><div class=\"section page-centered\" data-qa=\"closing-description\"><div>If you are passionate about 10up's mission and think you have what it takes to be successful in this role even if you don't check all the boxes, please apply. We'd appreciate the opportunity to personally review your application. Everyone gets a response.</div><div><br></div><div>Read more about <a href=\"https://drive.google.com/file/d/1nQ9yWRqfDAdrriYRnBNzYo7w59auYxMe/view\">What to Expect</a> through our Recruiting process.</div><div><br></div><div>Upon meeting the necessary criteria, you'll join the 10up contractor network. This grants you access to project invitations tailored to your expertise and time availability, although project opportunities may not arise instantly.</div><div><br></div></div><div class=\"section page-centered last-section-apply\" data-qa=\"btn-apply-bottom\"><a class=\"postings-btn template-btn-submit hex-color\" data-qa=\"show-page-apply\" href=\"https://jobs.lever.co/10up-2/8d65f45b-1231-4d64-8ddc-d291a2d687ac/apply\">Apply for this job</a></div>","tags":"[\"javascript\",\"engineering\"]","pubDate":"2024-02-10 02:57:34.160","link":"https://jobs.lever.co/10up-2/8d65f45b-1231-4d64-8ddc-d291a2d687ac","savedDate":"2024-02-10 02:57:34.160","slug":"freelance-contract-senior-front-end-engineer-10up-4877"},{"id":5381114415,"title":"Freelance | Contract Senior JavaScript Engineer","company":"10up","image":"https://pbs.twimg.com/profile_images/2738508979/760be3edebfa0195e36fb3dba07297c1_400x400.png","description":"<div class=\"section page-centered\" data-qa=\"job-description\"><div><b>Location: Remote - Anywhere</b> (Open to applicants located anywhere around the globe.)</div><div><br></div><div>At 10up, we call developers like you engineers because you aren't just a \"coder\": you're an innovative problem solver that uses web programming skills to divine smart, creative solutions to client challenges.&nbsp;</div><div><br></div><div>As a leading digital agency, 10up's client roster spans from innovative startups and impactful non-profits to some of the biggest names in the industry, such as ESPN, Google, The New York Times Co., Microsoft, and The Nobel Prize Committee. 10uppers have been pushing the boundaries of web experiences for over 12 years—become an engineer that innovates the internet by building exciting projects alongside a top-in-the-field team.</div><div><br></div><div>As a 10up contractor, you have options for flexible and alternative work schedules. Intentionally remote since day one, spanning six continents and 40 countries, 10up fully embraces the benefits of distributed work.</div><div><br></div></div><div class=\"section page-centered\"><div><h3>What you will do: </h3><ul class=\"posting-requirements plain-list\"><ul><li>Lead, architect, and build React projects with modern JavaScript.</li><li>Estimate JavaScript work and modularize goals into clearly defined, executable tasks.</li><li>Provide code reviews.</li><li>Skillfully connect engineering deliverables to client business objectives.</li><li>Ultimately you will make the web better by finely crafting apps, and tools that reach millions of online visitors every day.</li></ul></ul></div></div><div class=\"section page-centered\"><div><h3>About you: </h3><ul class=\"posting-requirements plain-list\"><ul><li>You love building scalable web-based JavaScript applications with ES6+, React, and Node.</li><li>You are well-versed with the architectural concepts behind React - state and data management, JSX, creating a componentized system, and JavaScript tooling.</li><li>You are knowledgeable of WordPress as a platform, including custom post types, taxonomies, and use of WordPress beyond typical “blog” use cases.</li><li>You have a code portfolio of real-world samples. Link us to your best custom work on GitHub and you’ll never have to do any live coding or whiteboard testing!&nbsp;</li><li>You prefer to work fully remote and are effectively engaging in a distributed team from the location of your choosing.</li></ul></ul></div></div><div class=\"section page-centered\" data-qa=\"closing-description\"><div><b style=\"font-size: 18px\">Join our team!&nbsp;</b></div><div><br></div><div>If you are passionate about 10up's mission and think you have what it takes to be successful in this role even if you don't check all the boxes, please apply. We'd appreciate the opportunity to personally review your application. Everyone gets a response.</div><div><br></div><div>Read more about <a href=\"https://drive.google.com/file/d/1nQ9yWRqfDAdrriYRnBNzYo7w59auYxMe/view\" class=\"postings-link\">What to Expect</a> through our Recruiting process.</div><div><br></div><div>Upon meeting the necessary criteria, you'll join the 10up contractor network. This grants you access to project invitations tailored to your expertise and time availability, although project opportunities may not arise instantly.</div><div><br></div><div>We don't want you to miss any communication from us! To ensure you receive updates on your application, please add jobs@10up.com to your contacts list! #LI-Remote</div><div><br></div></div><div class=\"section page-centered last-section-apply\" data-qa=\"btn-apply-bottom\"><a class=\"postings-btn template-btn-submit hex-color\" data-qa=\"show-page-apply\" href=\"https://jobs.lever.co/10up-2/6aa0f28a-756c-4ab8-a06d-7f34de4f5ef4/apply\">Apply for this job</a></div>","tags":"[\"javascript\",\"management\",\"engineering\"]","pubDate":"2024-02-10 02:57:34.160","link":"https://jobs.lever.co/10up-2/6aa0f28a-756c-4ab8-a06d-7f34de4f5ef4","savedDate":"2024-02-10 02:57:34.160","slug":"freelance-contract-senior-javascript-engineer-10up-909"},{"id":9662651170,"title":"Lead Product Designer","company":"SafetyWing","image":"https://pbs.twimg.com/profile_images/1177267684574208000/54eG3WmW_400x400.jpg","description":"<h2>🧘 What we offer:</h2> <div><!--block-->We operate in a fully remote work environment – work from anywhere globally.&nbsp;<br><br>You will receive salary and equity compensation, health insurance, a laptop, a minimum of four weeks of yearly vacation, personal development budget, attendance of professional conferences and more.<br><br>We have a minimum of two annual team gatherings where you will join us. The previous gatherings were in Ljubljana, San Francisco, and Mexico.<br><br>We are looking forward to hearing from you!</div> <div><!--block-->As the <strong>Lead Product Designer </strong>at <a href=\"https://safetywing.com/\"><strong>SafetyWing</strong></a>,<strong> </strong>you will drive the design and development of our products, particularly within the insurance-tech industry for B2B. Your role extends beyond crafting exceptional designs; it's about adding depth and meaning to our projects while maintaining our core values. You'll be working alongside a diverse group of stakeholders and will serve as a guiding force in the realm of product design, providing direction, imparting knowledge, and quality assurance.</div> <h2> 👨‍🎤 Your responsibilities will include:</h2>  <ul><li><!--block-->Lead product design initiatives from conception to final execution.</li><li><!--block-->Offer mentorship to other designers, providing guidance, direction and fostering growth.</li><li><!--block-->Lead regular design reviews, ensuring feedback is constructive and aligned with our vision and principles.</li><li><!--block-->Drive continuous improvements in our design processes, proposing strategies to elevate the quality of outputs.</li><li><!--block-->Ensure consistency in design outputs by collaborating closely with other designers and engineers.</li><li><!--block-->Drive the evolution and adherence to SafetyWing's design system.</li><li><!--block-->Serve as the pivotal bridge between design and other functions, ensuring that the design perspective is influential in product and strategic discussions.</li></ul> <h2>🧪 We are looking for someone who:</h2> <ul><li><!--block-->Has an advanced product design experience demonstrated through a portfolio of impactful design solutions.</li><li><!--block-->Has proven experience and dedication in guiding and mentoring designers to achieve their best work.</li><li><!--block-->Has background designing user experiences within sectors such as insurance, finance, or B2B space would be considered an asset.</li><li><!--block-->Has extensive experience with design and prototyping tools such as Figma and is committed to continuous learning of new features.</li><li><!--block-->Is experienced in conducting user research and usability testing.</li><li><!--block-->Has the ability to communicate design ideas clearly and to champion design principles across diverse audiences, including both design and non-design stakeholders.</li><li><!--block-->Can think beyond the immediate design task and understand the bigger business and product strategy.</li><li><!--block-->Is comfortable with ambiguity.</li><li><!--block-->Has strong sense of empathy for both the user and team members.</li><li><!--block-->Is interested in building a global social safety net.</li><li><!--block-->Thinks for themselves instead of copying others.</li><li><!--block-->Creative and bold in the face of any problem.</li><li><!--block-->Intellectually honest and has high integrity.</li><li><!--block-->Has experience working in globally distributed and remote teams in a tech start-up environment would be a bonus.</li></ul>","tags":"[\"Finance\",\"B2B\"]","pubDate":"2024-02-10 02:57:34.159","link":"https://safetywing.pinpointhq.com/en/jobs/146706","savedDate":"2024-02-10 02:57:34.159","slug":"lead-product-designer-safetywing-2193"},{"id":4844674656,"title":"Senior Front-End Engineer ","company":"Timescale","image":"https://pbs.twimg.com/profile_images/1542681228666671107/L5LYJLAD_400x400.png","description":"&lt;p&gt;Timescale is looking for an experienced Senior Front-End Engineer with a track record of building great SaaS and cloud services.&lt;/p&gt;\n&lt;p&gt;This is an exciting opportunity to play a central role in developing the next great cloud-native data platform. You will be responsible for playing a core role in developing and implementing the UI/UX for our cloud platform (&lt;a href=&quot;https://www.timescale.com/cloud&quot;&gt;https://www.timescale.com&lt;/a&gt;), from operationally managing services to data visualization and analysis. If you are passionate about both developer tools and great design and want to help empower developers worldwide, then this is the role for you.&lt;/p&gt;\n&lt;p&gt;Timescale is a fully remote organization; this is a full-time position. Due to the location of the team, the ideal candidate would be located in the United States East Coast timezone, Brazil, or Argentina.&amp;nbsp;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Responsibilities&lt;/strong&gt;&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;Play a central role in developing and implementing SaaS product experience, including UI / UX for managed cloud services and data-driven visualization&lt;/li&gt;\n&lt;li&gt;Writing production-level code in Typescript with React&lt;/li&gt;\n&lt;li&gt;Strong experience with and commitment to testing (&lt;a href=&quot;https://www.cypress.io/&quot;&gt;Cypress&lt;/a&gt; is our tool of choice)&lt;/li&gt;\n&lt;li&gt;Work in a modern development environment on GitHub using a git workflow&lt;/li&gt;\n&lt;li&gt;Work with product, design, and backend engineers to deliver capabilities&lt;/li&gt;\n&lt;li&gt;Strong self-driven execution, ownership, and delivery&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;&lt;strong&gt;Skills &amp;amp; Requirements&lt;/strong&gt;&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;5+ years of UI/UX or front-end development work&lt;/li&gt;\n&lt;li&gt;Strong Typescript programming skills and modern JS frameworks experience (React strongly preferred)&lt;/li&gt;\n&lt;li&gt;Cares about the smallest details of look &amp;amp; feel, user flows, and UI/UX&lt;/li&gt;\n&lt;li&gt;Experience with data-driven visualization&amp;nbsp;&lt;/li&gt;\n&lt;li&gt;Some familiarity with SQL or other data-driven query languages&amp;nbsp;&lt;/li&gt;\n&lt;li&gt;Ability to work in a fast-paced start-up environment&lt;/li&gt;\n&lt;li&gt;Excellent verbal and written communication skills in English&lt;/li&gt;\n&lt;/ul&gt;&lt;div class=&quot;content-conclusion&quot;&gt;&lt;p&gt;By applying for this position, you are agreeing to &lt;a href=&quot;https://www.timescale.com/legal/timescale-applicant-privacy-note&quot; target=&quot;_blank&quot;&gt;Timescale&#39;s Applicant Privacy Notice.&lt;/a&gt;&amp;nbsp;&lt;/p&gt;&lt;/div&gt;","tags":"[\"typescript\",\"legal\"]","pubDate":"2024-02-10 02:57:34.159","link":"https://www.timescale.com/careers/7204740002?gh_jid=7204740002","savedDate":"2024-02-10 02:57:34.159","slug":"senior-front-end-engineer-timescale-2263"},{"id":5886355974,"title":"Solutions Engineer (East Coast, USA)","company":"Timescale","image":"https://pbs.twimg.com/profile_images/1542681228666671107/L5LYJLAD_400x400.png","description":"&lt;p&gt;Timescale is hiring a &lt;strong&gt;Solutions Engineer &lt;/strong&gt;for our growing international team! Our Solutions Engineers strongly impact the customer journey by ensuring a smooth post-sales experience and implementation and empowering our clients to derive maximum value from our technology. The right candidate will be comfortable providing deep technical assistance in implementing data models and schemas in various customer architectures and situations. You should have experience with implementing relational databases (PostgreSQL is a strong plus!) and must quickly gain a detailed understanding of TimescaleDB and how to use its advanced features to set customers up for success. You should have a “can do it” attitude, where helping the user comes first.&amp;nbsp;&lt;/p&gt;\n&lt;p&gt;Timescale is a remote-first organization; this is a full-time position with a target location in the East Coast North American timezone.&amp;nbsp;&lt;/p&gt;\n&lt;h3&gt;&lt;strong&gt;What You Will Do:&lt;/strong&gt;&lt;/h3&gt;\n&lt;ul&gt;\n&lt;li&gt;Be integrated into customer teams, helping them execute and succeed as they get started with Timescaledb on our hosted platforms.&lt;/li&gt;\n&lt;li&gt;Collaborate with the engineering team to address technical challenges and improve product features based on client feedback&lt;/li&gt;\n&lt;li&gt;Work with our Solutions Architects and customers to create a plan for schema, compression, and continuous aggregates and how to integrate those features into their existing workflows.&lt;/li&gt;\n&lt;li&gt;Help develop educational content based on customer needs and desires.&lt;/li&gt;\n&lt;li&gt;Stay updated on industry trends and competitive offerings to maintain a competitive edge in the market.&lt;/li&gt;\n&lt;li&gt;Understand Timescale&#39;s features, capabilities, and value proposition.&lt;/li&gt;\n&lt;/ul&gt;\n&lt;h3&gt;&lt;strong&gt;What You Need:&lt;/strong&gt;&lt;/h3&gt;\n&lt;ul&gt;\n&lt;li&gt;Bachelor’s degree in computer science, information systems, or equivalent experience.&lt;/li&gt;\n&lt;li&gt;Relational DB experience at scale: administration, data modeling, query optimization&lt;/li&gt;\n&lt;li&gt;Experience as a technical support professional, Technical Account Manager, Solutions Architect, Consultant, or similar role with external customers and deep integration work with their systems.&lt;/li&gt;\n&lt;li&gt;Engage with prospects through presentations, demos, and technical discussions.&lt;/li&gt;\n&lt;li&gt;Strong aptitude for understanding and learning new software products.&lt;/li&gt;\n&lt;li&gt;Strong communication skills and the ability to express complex technical concepts to a varied audience.&lt;/li&gt;\n&lt;li&gt;A thorough and holistic approach to data platforms, data analysis, and infrastructure.&lt;/li&gt;\n&lt;/ul&gt;\n&lt;h3&gt;&lt;strong&gt;Other Things that Will Help:&amp;nbsp;&lt;/strong&gt;&lt;/h3&gt;\n&lt;ul&gt;\n&lt;li style=&quot;font-weight: bold;&quot;&gt;&lt;strong&gt;Be familiar with TimescaleDB! You should download and test it out before you apply: https://docs.timescale.com/tutorials/latest/nyc-taxi-cab/&lt;/strong&gt;&lt;/li&gt;\n&lt;li&gt;Familiarity with broad cloud computing concepts and experience with AWS, GCP, and Azure.&lt;/li&gt;\n&lt;li&gt;Experience with Relational databases, NoSQL databases, data modeling tools, ETL Pipelines, and data lifecycle management.&lt;/li&gt;\n&lt;li&gt;Familiarity with Postgresql, including best practices, Query Plan analysis, backup/restore, migrations, etc&lt;/li&gt;\n&lt;/ul&gt;&lt;div class=&quot;content-conclusion&quot;&gt;&lt;p&gt;By applying for this position, you are agreeing to &lt;a href=&quot;https://www.timescale.com/legal/timescale-applicant-privacy-note&quot; target=&quot;_blank&quot;&gt;Timescale&#39;s Applicant Privacy Notice.&lt;/a&gt;&amp;nbsp;&lt;/p&gt;&lt;/div&gt;","tags":"[\"postgres\",\"management\",\"engineering\",\"legal\",\"database\",\"aws\"]","pubDate":"2024-02-10 02:57:34.159","link":"https://www.timescale.com/careers/7213418002?gh_jid=7213418002","savedDate":"2024-02-10 02:57:34.159","slug":"solutions-engineer-east-coast-usa-timescale-1574"},{"id":7616100400,"title":"Paid Social Specialist (Europe)","company":"Airalo","image":"https://lever-client-logos.s3.us-west-2.amazonaws.com/55028a36-609c-479c-9553-d4689ff2dd8c-1669620566663.png","description":"<div><b>About Airalo</b></div><div>Alo! Airalo is the world’s first eSIM store that helps people connect in over 200+ countries and regions across the globe. We are building the next digital service that revolutionizes the telecom industry. We are a travel-tech company and an equal-opportunity environment that values and executes diversity, inclusion, and equity. Our team is spread across 40+ countries and six continents. What glues us together is our commitment to changing the way you connect<span style=\"font-size: 13.3333px\">. </span></div><div><br></div><div><b>About you</b></div><div>We hope that you care deeply about the quality of your work, the intrinsic worth of tasks, and the success of your team. You are self-disciplined and do not require micromanagement in terms of your skillset and work ethic. You do your best to flourish as an individual every day while working hard to foster a collaborative team environment. You believe in the importance of being — and staying — authentic, honest, positive, and kind. You are a good interlocutor with clear and concise communication. You are able to manage multiple projects, have an analytical mind, pay keen attention to detail, and love to get your hands dirty. You are cognizant, tolerant, and welcoming of vulnerabilities and cultural differences.</div><div><br></div><div><b>About the Role</b></div><div><b>Position</b>: Full-time / Employee</div><div><b>Location:</b>&nbsp;Remote-first </div><div><b>Benefits:</b>&nbsp;Health Insurance, work-from-anywhere stipend, annual wellness &amp; learning credits, annual all-expenses-paid company retreat in a gorgeous destination &amp; other benefits</div><div><br></div><div>As a <b>Paid Social Specialist,</b> you will be responsible for guiding the strategy and development, and then executing our mobile app acquisition strategy across European markets on paid social channels.</div><div>Reporting to the <b>Director of Growth</b>; you will lead an outcome driven approach on app marketing and ensure that our paid acquisition efforts on social platforms are best in class. You will have a high bar for the quality of our paid social marketing efforts and drive the deep attention to detail needed to ensure our campaigns are set up well and optimized efficiently.</div><h3>Responsibilities include but are not limited to:</h3><li>Developing and executing mobile app acquisition campaigns across a variety of social marketing channels</li><li>Continuously testing and experimenting on acquisition campaigns to drive cost-effective user growth</li><li>Analyzing user acquisition and engagement data to inform acquisition strategy and decision making</li><li>Working with and coordinating with external agencies and internal teams to drive direction and ensure execution excellence</li><li>Working cross functionally with product, engineering and brand/creative teams to effectively drive paid social marketing strategy and outcomes</li><li>Conducting market and competitor research to identify new acquisition opportunities</li><li>Staying up to date with industry trends, especially in travel and best practices in mobile app acquisition</li>,<h3>Must-haves:</h3><li>5+ years of experience in managing mobile app acquisition campaigns at scale in performance-driven competitive verticals such as gaming, tech, travel etc.</li><li>Hands-on expertise in the Meta ads stack and TikTok ads stack. Well-versed with performance levers -  audience, targeting, messaging, measurement, creative, budgeting, and bidding</li><li>Strong analytical skills and expertise in Analytics and MMP tools (e.g. Google Analytics, AppsFlyer, Adjust, etc.)</li><li>Experience working in the digital advertising and mobile space, with experience in performance solutions, competitive landscape and local markets.</li><li>Fluency in English, with impeccable verbal and written communication skills</li><li>Superior internal &amp; external communication &amp; cross-functional stakeholder management skills</li><li>Good time management with an eye for perfection &amp; a strong operational background</li>,<h3>Good to have:</h3><li>Ad platform and Analytical platform certifications</li><li>Working knowledge on other social media platforms like Twitter, LinkedIn etc.</li><li>Prior experience in the tech, travel or telecommunications industry</li><li>Knowledge of eSIM and GSMA-related technologies and services</li><div>If you are interested in this position, please<b> apply via the link.</b></div><div><br></div><div><i>We sincerely thank all applicants in advance for submitting their interest in this opportunity with Airalo. </i></div>","tags":"[\"management\",\"engineering\"]","pubDate":"2024-02-09 15:23:57.372","link":"https://jobs.lever.co/airalo/9c484688-c00d-44ea-844d-53bf0c631955","savedDate":"2024-02-10 02:57:34.168","slug":"paid-social-specialist-europe-airalo-6429"},{"id":2895604680,"title":"Content Specialist, Arabia & Africa (Arabic)","company":"Airalo","image":"https://lever-client-logos.s3.us-west-2.amazonaws.com/55028a36-609c-479c-9553-d4689ff2dd8c-1669620566663.png","description":"<div><b>About Airalo</b></div><div>Alo! Airalo is the world’s first eSIM store that helps people connect in over 200+ countries and regions across the globe. We are building the next digital service that revolutionizes the telecom industry. We are a travel-tech company and an equal-opportunity environment that values and executes diversity, inclusion, and equity. Our team is spread across 40+ countries and six continents. What glues us together is our commitment to changing the way you connect<span style=\"font-size: 13.3333px\">. </span></div><div><br></div><div><b>About you</b></div><div>We hope that you care deeply about the quality of your work, the intrinsic worth of tasks, and the success of your team. You are self-disciplined and do not require micromanagement in terms of your skillset and work ethic. You do your best to flourish as an individual every day while working hard to foster a collaborative team environment. You believe in the importance of being — and staying — authentic, honest, positive, and kind. You are a good interlocutor with clear and concise communication. You are able to manage multiple projects, have an analytical mind, pay keen attention to detail, and love to get your hands dirty. You are cognizant, tolerant, and welcoming of vulnerabilities and cultural differences.</div><div><br></div><div><b>About the Role</b></div><div><b>Position</b>: Full-time / Employee</div><div><b>Location:</b>&nbsp;Remote-first </div><div><b>Benefits:</b>&nbsp;Health Insurance, work-from-anywhere stipend, annual wellness &amp; learning credits, annual all-expenses-paid company retreat in a gorgeous destination &amp; other benefits</div><div><br></div><div>As <b>Content Specialist, Arabia &amp; Africa (Arabic)</b> at Airalo, you will work closely with the rest of the Growth, User Experience, Brand and Regional divisions to apply the best practices and write long-form blog articles, web and social content, technical video script writing, SEO, and ASO. The role will be responsible for developing and writing for different content channels and track on results. You are also comfortable with using AI to automate work and produce content at scale.</div><div><br></div><div>You will be owning and leading the entire content processes from the creative stage to writing, publishing, and reporting on results to stakeholders. You will drive our content strategy, creation, and distribution across various channels. You'll keep our brand voice consistent and in tune with our mission. Not only will you be great with words, but you'll also be able to geek out over the latest SEO and ASO strategies, make friends with data, and love dipping your toes in various CMS platforms.</div><h3>Responsibilities include but are not limited to:</h3><li>Reporting to and working directly with the Content Manager (Arabia) and growth team.</li><li>Content strategy: Plan and execute content strategies aligned with Airalo's short-term and long-term country targets (driving high engagement across all our digital platforms).</li><li>Blog: Full ownership of the blog and increasing traffic for Arabia and Arabic content. This includes writing, SEO research, and publishing. You will be developing an editorial calendar.</li><li>Publishing and writing content: Create compelling and informative content that makes even the techiest eSIM jargon relatable.</li><li>SEO and ASO: Optimize content for search engines (SEO) and app stores (ASO). A knack for consistent high rankings? You're our person.</li><li>CMS skills: Navigate various Content Management Systems like a pro.</li><li>Data literacy: Make sense of the numbers and use data to drive content that hits. Use content management systems (like Ahrefs and GA4) to analyze website traffic and user engagement metrics.</li><li>Brand consistency: Keep our brand voice consistent across all channels.</li><li>Distribution: Make sure our content reaches the right ears at the right time. Determine the best distribution channels for each piece of content, and suggest how to repurpose long-from content into shorter pieces that can work for different channels.</li><li>Project management: Balance multiple projects, meet deadlines, and maintain high-quality work.</li><li>Multimedia: You can write and switch between different forms of content and in different styles, like writing for video, graphics, and other rich media content.</li><li>AI literacy: We have big aspirations for our content machine and we'll need your help to make it smarter, and use AI to produce content at scale.</li>,<h3>Must-haves:</h3><li>Bachelor’s degree &amp; 3+ years of proven Content, SEO, and ASO achievement with a large B2C and B2B2C audience</li><li>Comfortable using AI and experience scaling content</li><li>Excellent understanding of SEO and ASO channel management and best practices</li><li>A strong understanding of keyword research with excellent analytical skills</li><li>Experience in writing and managing blog content end-to-end</li><li>Experience in creating multimedia content, including blog, podcast, social and video production</li><li>Experience with analytics tools and/or other market research tools, e.g. SEMrush, Ahrefs, GA4</li><li>Fluency in Arabic and English, with impeccable verbal and written communication skills</li>,<h3>Good to have:</h3><li>Experience writing app descriptions and titles using researched ASO keywords</li><li>Ability to assess campaign performance, identify consumer behavior and creative opportunities, and manage cost-per-acquisition targets</li><li>Experience working on international brands</li><li>Experience working on cross-functional teams in an agile environment</li><li>Experience in the travel industry</li><li>Knowledge of eSIM and GSMA-related technologies and services</li><div>If you are interested in this position, <b>please apply via the link.</b></div><div><br></div><div><i>We sincerely thank all applicants in advance for submitting their interest in this opportunity with Airalo. </i></div>","tags":"[\"management\",\"B2C\",\"B2B\"]","pubDate":"2024-02-09 08:53:19.982","link":"https://jobs.lever.co/airalo/3df13c01-2d0a-47b0-bdc4-2eabc9fa7351","savedDate":"2024-02-10 02:57:34.167","slug":"content-specialist-arabia-africa-arabic-airalo-8554"},{"id":3332824119,"title":"Content Specialist, Arabia & Africa (English)","company":"Airalo","image":"https://lever-client-logos.s3.us-west-2.amazonaws.com/55028a36-609c-479c-9553-d4689ff2dd8c-1669620566663.png","description":"<div><b>About Airalo</b></div><div>Alo! Airalo is the world’s first eSIM store that helps people connect in over 200+ countries and regions across the globe. We are building the next digital service that revolutionizes the telecom industry. We are a travel-tech company and an equal-opportunity environment that values and executes diversity, inclusion, and equity. Our team is spread across 40+ countries and six continents. What glues us together is our commitment to changing the way you connect<span style=\"font-size: 13.3333px\">. </span></div><div><br></div><div><b>About you</b></div><div>We hope that you care deeply about the quality of your work, the intrinsic worth of tasks, and the success of your team. You are self-disciplined and do not require micromanagement in terms of your skillset and work ethic. You do your best to flourish as an individual every day while working hard to foster a collaborative team environment. You believe in the importance of being — and staying — authentic, honest, positive, and kind. You are a good interlocutor with clear and concise communication. You are able to manage multiple projects, have an analytical mind, pay keen attention to detail, and love to get your hands dirty. You are cognizant, tolerant, and welcoming of vulnerabilities and cultural differences.</div><div><br></div><div><b>About the Role</b></div><div><b>Position</b>: Full-time / Employee</div><div><b>Location:</b>&nbsp;Remote-first </div><div><b>Benefits:</b>&nbsp;Health Insurance, work-from-anywhere stipend, annual wellness &amp; learning credits, annual all-expenses-paid company retreat in a gorgeous destination &amp; other benefits</div><div><br></div><div><span style=\"font-size: 12pt\">As </span><b><span style=\"font-size: 12pt\">Content Specialist, Arabia</span></b><span style=\"font-size: 12pt\">&nbsp;<b>&amp; Africa (English)</b> at Airalo, you will work closely with the rest of the Growth, User Experience, Brand, and Regional divisions to apply the best practices and write long-form blog articles, web and social content, technical video script writing, SEO, and ASO. The role will be responsible for developing and writing for different content channels and track on results. You are also comfortable with using AI to automate work and produce content at scale.</span></div><div><br></div><div><span style=\"font-size: 12pt\">You will be owning and leading the entire content processes from the creative stage to writing, publishing, and reporting on results to stakeholders. You will drive our content strategy, creation, and distribution across various channels. You'll keep our brand voice consistent and in tune with our mission. Not only will you be great with words, but you'll also be able to geek out over the latest SEO and ASO strategies, make friends with data, and love dipping your toes in various CMS platforms.</span></div><h3>Responsibilities include but are not limited to:</h3><li>Reporting to and working directly with the Content Manager (Arabia) and growth team.</li><li>Content strategy: Plan and execute content strategies aligned with Airalo's short-term and long-term country targets (driving high engagement across all our digital platforms).</li><li>Blog: Full ownership of the blog and increasing traffic for Arabia and English content. This includes writing, SEO research, and publishing. You will be developing an editorial calendar.</li><li>Publishing and writing content: Create compelling and informative content that makes even the techiest eSIM jargon relatable.</li><li>SEO and ASO: Optimize content for search engines (SEO) and app stores (ASO). A knack for consistent high rankings? You're our person.</li><li>CMS skills: Navigate various Content Management Systems like a pro.</li><li>Data literacy: Make sense of the numbers and use data to drive content that hits. Use content management systems (like Ahrefs and GA4) to analyze website traffic and user engagement metrics.</li><li>Brand consistency: Keep our brand voice consistent across all channels.</li><li>Distribution: Make sure our content reaches the right ears at the right time. Determine the best distribution channels for each piece of content, and suggest how to repurpose long-from content into shorter pieces that can work for different channels.</li><li>Project management: Balance multiple projects, meet deadlines, and maintain high-quality work.</li><li>Multimedia: You can write and switch between different forms of content and in different styles, like writing for video, graphics, and other rich media content.</li><li>AI literacy: We have big aspirations for our content machine and we'll need your help to make it smarter, and use AI to produce content at scale.</li>,<h3>Must-haves:</h3><li>Bachelor’s degree &amp; 3+ years of proven Content, SEO, and ASO achievement with a large B2C and B2B2C audience</li><li>Comfortable using AI and experience scaling content</li><li>Excellent understanding of SEO and ASO channel management and best practices</li><li>A strong understanding of keyword research with excellent analytical skills</li><li>Experience in writing and managing blog content end-to-end</li><li>Experience in creating multimedia content, including blog, podcast, social and video production</li><li>Experience with analytics tools and/or other market research tools, e.g. SEMrush, Ahrefs, GA4</li><li>Fluency in Arabic and English, with impeccable verbal and written communication skills in English</li>,<h3>Good to have:</h3><li>Experience writing app descriptions and titles using researched ASO keywords</li><li>Ability to assess campaign performance, identify consumer behavior and creative opportunities, and manage cost-per-acquisition targets</li><li>Experience working on international brands</li><li>Experience working on cross-functional teams in an agile environment</li><li>Experience in the travel industry</li><li>Knowledge of eSIM and GSMA-related technologies and services</li><div>If you are interested in this position, <b>please apply via the link.</b></div><div><br></div><div><i>We sincerely thank all applicants in advance for submitting their interest in this opportunity with Airalo. </i></div>","tags":"[\"management\",\"B2C\",\"B2B\"]","pubDate":"2024-02-09 08:28:34.998","link":"https://jobs.lever.co/airalo/ada1dc0b-8fda-48ad-a861-953222ea49d3","savedDate":"2024-02-10 02:57:34.167","slug":"content-specialist-arabia-africa-english-airalo-4742"},{"id":9254821146,"title":"Cyber Security Analyst","company":"CoverGo","image":"https://pbs.twimg.com/profile_images/1382655628523364355/MWPIbbID_400x400.jpg","description":"<p><strong>Top 3 Reasons To Join Us</strong></p><ul> <li>Competitive Salary</li> <li>100% Remote</li> <li>Working on the latest tech for the Insurtech Market Leader</li> </ul><p><strong>About Us</strong></p><p>At CoverGo, our mission is to empower all insurance companies to make insurance 100% digital and accessible to everyone.</p><ul> <li>We are a leading global no-code insurance platform for health, life, and P&amp;C</li> <li>We’re the winner of the Insurtech of the Year in all of Asia and other awards globally</li> <li>We work with insurance enterprise clients such as AXA, Bupa, MSIG, Dai-ichi, Bank of China Group Insurance, and many more</li> <li>We're an international, diverse team of over 120 people with 30 nationalities and team members working remotely from all over the world</li> <li>We are fully funded and backed by reputable VC funds and strategic institutional investors</li> <li>We have a global presence in Asia, EMEA and the Americas</li> <li>We’ve grown our annualized revenue by over 30x since January 2021</li> <li>We’re constantly working towards making CoverGo a workplace that you love coming to. We deeply believe that bringing together a diversity of thoughts, expressions, and perspectives is key to building the best culture for equally diverse communities all over the world</li> </ul><p><strong>About the Role</strong></p><p>As a Cyber Security Analyst, your primary duties will involve handling operational security tasks to enhance CoverGo's overall cybersecurity posture. This opportunity is ideal for someone with the determination and passion to safeguard a startup company against contemporary cyber threats. Initially, you will focus on your areas of expertise, gradually expanding your proficiency across multiple domains.</p><p><strong>What You Will Do</strong></p><ul> <li>Oversee and run different operational security tasks, ranging from SOC L1/L2 analyst duties and employee awareness campaigns to ensuring compliance control performance</li> <li>Efficiently address day-to-day cybersecurity challenges</li> <li>Effectively communicate, solicit feedback, and be proactive in working on the company’s cyber security practices</li> <li>Perform daily tasks which consist of some of the following activities: agile team ceremonies, SIEM alert validation, incident management, providing training &amp; awareness, performance of ISO 27001 compliance controls</li> <li>Other tasks that depend on your previous experience on the following security domains:</li> </ul><ol> <li>ISO 27001 or SOC2 (or similar) internal control performance and experience in passing external audits</li> <li>Security Operations Center Experience in an in-house Security Operations Center (threat analysis, SIEM configuration, incident management)</li> <li>Infrastructure security (vulnerability scanning, Kubernetes security)</li> <li>Secure software development and DevSecOps practices (SAST, DAST, AppSec requirements)</li> </ol><li>Join our cybersecurity team with a direct report to the Head of Security</li><li>Perform ad hoc cyber security related assignments and projects as required</li><p><strong>What We Need</strong></p><ul> <li>At least 1 year of experience as a Cyber Security Analyst or in a similar role</li> <li>Hands-on experience in at least 1 of the following 4 security domains:</li> <ul> <li>ISO 27001 or SOC2 (or similar) internal control performance and experience in passing external audits</li> <li>Security Operations Center Experience in an in-house Security Operations Center (threat analysis, SIEM configuration, incident management)</li> <li>Infrastructure security (vulnerability scanning, Kubernetes security)</li> <li>Secure software development and DevSecOps practices (SAST, DAST, AppSec requirements)</li> </ul> <li>​​A university degree in Computer Science, or any relevant science or engineering discipline; alternatively a track record in cyber security upskilling</li> <li>Relevant experience in pentesting, internal audit, and actual software development experience is an advantage</li> <li>Fully remote position but must be currently based in the Philippines due to timezone requirements</li> <li>Excellent English skills, both written and spoken</li> <li>Ability to work independently, be a self starter, and have a solution-driven approach, actively solving problems and driving positive change in the organization</li> <li>Ability to obtain organizational buy-in and explain security concepts to both engineers and business people</li> <li>Someone who understands accountability and who is well-organized and conscientious with a high level of initiative at work</li> </ul><p><strong>Why You'll Love Working Here</strong></p><ul> <li>Fully Remote</li> <li>Flexible Leave</li> <li>International Environment</li> <li>Competitive renumeration package</li> <li>Performance Bonus</li> <li>Stock Options after 6 months </li> <li>Company activities and events</li> <li>Learning and development plan</li> </ul><p><strong>CoverGo Company </strong><a href=\"https://www.youtube.com/watch?v=YI0ezLxvFvA\" rel=\"nofollow noreferrer noopener\" class=\"external\"><strong>Video</strong></a></p><p>By submitting your application, you confirm that you have read, understood, and accepted the content of CoverGo’s <a href=\"https://apply.workable.com/covergo/gdpr_policy?lng=en\" target=\"_blank\" rel=\"nofollow noreferrer noopener\" class=\"external\">Privacy Notice</a> and you consent to the processing of your data as part of this application.</p><h3>Requirements: </h3><h3>Benefits: </h3>","tags":"[\"management\",\"engineering\",\"cyber security\"]","pubDate":"2024-02-08 00:00:00.000","link":"https://apply.workable.com/covergo/j/1BACCCCCF8","savedDate":"2024-02-10 02:57:34.164","slug":"cyber-security-analyst-covergo-1379"},{"id":4712698157,"title":"Paid Ads Specialist","company":"Talent Disruptors","image":"https://remotive.com/job/1894532/logo","description":"<p style=\"min-height:1.5em\">We are in search of a skilled Media Buyer with expertise in digital advertising across platforms like Facebook, Google, TikTok, and Instagram. In this crucial role, you will strategize, execute, and manage ad campaigns that effectively reach our target audience and drive conversions. Your deep understanding of different advertising platforms and ability to optimize ad spend will be key in maximizing our marketing ROI. If you have a passion for digital media and a track record of successful ad campaigns, you’re the ideal candidate to help propel our brand's online presence and success.</p><p style=\"min-height:1.5em\"><strong>What You’ll Be Doing</strong></p><ul style=\"\"><li style=\"\"><p style=\"min-height:1.5em\">Multi-Platform Ad Campaigns: Develop and manage ad campaigns across various platforms including Facebook, Google Ads, TikTok, and Instagram.</p></li><li style=\"\"><p style=\"min-height:1.5em\">Budget Management: Allocate and optimize ad spend to achieve maximum ROI while adhering to budget constraints.</p></li><li style=\"\"><p style=\"min-height:1.5em\">Target Audience Analysis: Identify and target key audience segments effectively across different platforms.</p></li><li style=\"\"><p style=\"min-height:1.5em\">Performance Tracking and Analytics: Monitor campaign performance using analytics tools, adjusting strategies as needed for optimal results.</p></li><li style=\"\"><p style=\"min-height:1.5em\">Creative Collaboration: Work with creative teams to develop compelling ad content tailored for each platform.</p></li><li style=\"\"><p style=\"min-height:1.5em\">A/B Testing: Conduct A/B tests to determine the most effective ad variations for each audience and platform.</p></li><li style=\"\"><p style=\"min-height:1.5em\">Market Research and Trends: Stay updated with the latest trends and best practices in digital advertising to keep our strategies cutting-edge.</p></li></ul><p style=\"min-height:1.5em\"><strong>Who You Are</strong></p><ul style=\"\"><li style=\"\"><p style=\"min-height:1.5em\">Experienced Media Buyer: You have proven experience in buying media and managing ad campaigns across platforms like Facebook, Google Ads, TikTok, and Instagram.</p></li><li style=\"\"><p style=\"min-height:1.5em\">Analytical and Data-Driven: You are adept at analyzing campaign data to make informed decisions and improve ad performance.</p></li><li style=\"\"><p style=\"min-height:1.5em\">Budget-Savvy: You possess strong skills in budget management and are adept at maximizing ROI within set financial parameters.</p></li><li style=\"\"><p style=\"min-height:1.5em\">Creative and Strategic Thinker: You can think creatively about ad placement and strategy to effectively reach target audiences.</p></li><li style=\"\"><p style=\"min-height:1.5em\">Adaptable and Current: You stay informed about the latest trends in digital advertising and are adaptable to the constantly evolving digital landscape.</p></li><li style=\"\"><p style=\"min-height:1.5em\">Detail-Oriented: You have a keen eye for detail, ensuring that all aspects of ad campaigns are meticulously managed and optimized.</p></li><li style=\"\"><p style=\"min-height:1.5em\">Collaborative Team Player: You work effectively with both creative and analytical teams to develop and execute successful ad campaigns</p></li></ul><img src=\"https://remotive.com/job/track/1894532/blank.gif?source=public_api\" alt=\"\"/>","tags":"[\"analytics\",\"campaign management\",\"Digital advertising\"]","pubDate":"2024-02-07 17:21:02.000","link":"https://remotive.com/remote-jobs/marketing/paid-ads-specialist-1894532","savedDate":"2024-02-10 02:57:34.157","slug":"paid-ads-specialist-talent-disruptors-9784"},{"id":6022899251,"title":"Enterprise Marketing Manager","company":"Bio Render","image":"https://lever-client-logos.s3-us-west-2.amazonaws.com/0f4b434e-502f-4390-9819-c058d43028c1-1595260531860.png","description":"<div>At BioRender, our mission is to accelerate the world’s ability to learn, discover and communicate science. We are passionate about democratizing science communication in order to accelerate scientific discovery and understanding. We're looking for amazing people to help create the world’s go-to-place and platform where science is communicated. Come join us!</div><div><br></div><div><span style=\"font-size: 11pt\">Are you a strategic thinker who wants to be a key player at a fast-growing, world-changing company in the next 2-4 years? If so, you might be a great fit for BioRender’s Enterprise Marketing Manager!</span></div><div><span style=\"font-size: 11pt\">We are looking for a motivated self-starter to join our Marketing team and play a key role in leading and implementing a robust demand generation and Account-Based Marketing (ABM) program for BioRender. Your ABM program will help build a strong sales pipeline, support sales and customer success teams, and contribute to overall revenue growth by acquiring new business and expanding existing accounts. You’ll be working side by side with our Marketing, Sales, Customer Success and RevOps teams!</span></div><div><br></div><div><span style=\"font-size: 11pt\">This is a </span><b style=\"font-size: 11pt\">remote </b><span style=\"font-size: 11pt\">role, based in Canada or the US.&nbsp;</span></div><h3>Our ideal fit</h3><li><b>Results-Driven Mindset: </b>You are resourceful and can work independently and move projects forward without the internal support of a dedicated team. You are known for your ability to be hands-on at both planning and executing.</li><li><b>Team-oriented approach:</b> You can easily build relationships with diverse stakeholders and understand the needs and dynamics of distinct teams as well as the business. You have proven success collaborating with various teams on a diverse array of collaborative projects.</li><li><b>Detail-oriented and data-focused approach: </b>You are known for being process-oriented and always looking for ways to improve and scale marketing strategies and initiatives.</li>,<h3>Your responsibilities</h3><li><b>Demand Generation and ABM Strategy: </b>Own the strategy and execution of full-funnel demand generation and ABM campaigns in alignment with Sales and Customer Success growth objectives to enhance market presence, increase footprint and drive higher revenue expansions from our key accounts. ABM activities should include across web, email, digital advertising, events and other channels.</li><li><b>Strategic Partnership: </b>Collaborate closely with Sales and Customer Success to design and implement Go-To-Market (GTM) strategies for specific account segments. This involves mapping stakeholder journeys, creating ABM strategies based on insights, and setting key milestones for achieving business outcomes.</li><li><b>Orchestration of ABM Activities: </b>Coordinate ABM activities across various channels, including web, email, digital advertising, and events, ensuring consistent messaging for key accounts. Showcase cross-team collaboration and alignment with sales and customer success.</li><li><b>Collaboration with Product Marketing: </b>Work alongside Product Marketing to create tailored experiences for key accounts, addressing their pain points, and boosting engagement to accelerate pipeline growth. This should result in increased engagement, more inbound leads, opportunities, and growth in the sales pipeline.</li><li><b>Collaboration with Revenue Ops and Marketing Ops: </b>Collaborate with Revenue Ops to establish a signal-based framework for ABM success, guiding account selection and prioritization. Work with Marketing Operations to seamlessly integrate ABM tools and conduct tests for continuous improvement.</li>,<h3>What you bring to the table</h3><li>5+ years of hands-on experience in executing and managing demand generation and cross-functional marketing programs.&nbsp;</li><li>2+ years of experience in executing ABM campaigns and managing related platforms (i.e. Pathfactory, 6sense, or equivalent).</li><li><b>Skills:</b> Proficiency in ABM and demand generation martech, digital marketing trends, and best practices. Experience in digital marketing, including paid ads and paid social programs. Familiarity with marketing automation tools like HubSpot or Marketo.</li><li><b>Collaboration:</b> Demonstrated success in building strong working relationships with internal and external partners across Sales, Customer Success, Marketing, and Creative agencies.</li><li><b>Project Management:</b> Strong project and program management skills with a keen attention to detail. Ability to drive both planning and execution.</li><li><b>Data-Driven: </b>Demonstrated success in leveraging data insights and metrics to measure impact and determine improvements.</li>,<h3>What you can expect from our interview process</h3><li><b>Introductory calls: </b>We will set up a 30-minute phone call with one of our recruiters and our Director of Revenue Marketing, during which you’ll have the opportunity to share more about your experience and interests. You’ll also learn more about BioRender and the team you’re interviewing with. Feel free to ask any questions throughout these calls!</li><li><b>Practical interview: </b>You’ll be completing a practical exercise so we can see your skills in action and give you a realistic role preview. This exercise will be conducted with our Director of Revenue Marketing and Head of Marketing.</li><li><b>Work history interview: </b>This is a conversational interview with our Leadership team. They will review your past work and educational experiences in chronological order -<a href=\"https://biorender.notion.site/biorender/Candidate-Guide-to-the-BioRender-Chronological-Interview-54c6e465502042a3870dddd614708c20\" class=\"postings-link\">you can read more about how to prepare for this interview here</a>!</li><li><b>Meet the team: </b>Throughout our interview process, you can expect to meet with some of your potential colleagues.</li>,<h3>Why join us?</h3><li>We are mission-driven, and work collaboratively towards our shared vision of improving scientific communication and accelerating scientific discovery: BioRender figures have appeared in more than 16,000 publications!</li><li>It’s a product that users love! We have a world-class NPS and a community of loyal fans. Check out our Testimonials page to see what our customers are saying about us: <a href=\"https://biorender.com/testimonials/\" class=\"postings-link\">https://biorender.com/testimonials/</a>&nbsp;</li><li>We are profitable, funded solely by user growth, and growing more than 200% YoY with users in 200+ countries.</li><li>We're proud that half of our team members are women (including those in leadership positions), and 65% of our team are BIPOC! BioRender is an equal-opportunity employer, and an inclusive hiring process and work environment are a part of our DNA</li><li>We’re remote-first and have team members across Canada and the United States. A physical office in Toronto is available, but you have the flexibility to work from anywhere.</li><li>We’re backed by top investors, accelerators, and some of the most successful life science entrepreneurs and philanthropists in the world, including Y Combinator, Malala Fund founders, and Fifty Years VC.</li><li>We are committed to building a warm, inclusive, and diverse environment. Check out how we make sure our <a href=\"https://biorender.com/careers/\" class=\"postings-link\">employees come first</a>.</li><div><br></div><div>You can read more about the <a href=\"https://biorender.notion.site/BioRender-Candidate-Resources-8255c155797f442a950720a33b4764d5\" class=\"postings-link\">BioRender interview process and FAQs here</a>!</div>","tags":"[\"management\"]","pubDate":"2024-02-07 17:14:10.486","link":"https://jobs.lever.co/biorender/d63a21cb-37a9-4f15-8518-1d2990b330f3","savedDate":"2024-02-10 02:57:34.168","slug":"enterprise-marketing-manager-bio-render-4068"},{"id":8032347734,"title":"Middle/Senior Python Developer - Remote/Work Anywhere","company":"CloudLinux","image":"https://pbs.twimg.com/profile_images/696718028084482050/ymY3OEPk_400x400.png","description":"<p>Imunify Security is a cutting-edge security solution that harnesses the power of Artificial Intelligence to protect Linux web servers. It is specifically tailored for shared and VPS/Dedicated servers, ensuring top-notch security. With its user-friendly interface and advanced six-layer security approach, Imunify delivers a comprehensive and foolproof defense against any type of attack.</p><p>Join our team as a Python developer engineer and take on exciting challenges:</p><ul> <li>Contribute to the creation of effective malware detection and remediation mechanisms</li> <li>Create high-performance and scalable code for processing big data</li> <li>Collaborate in analytics brainstorms and shape the team's backlog with your own vision</li> <li>Analyze data to prioritize tasks and maximize efficiency</li> <li>Participate in architecture discussions and contribute to writing technical documents</li> <li>Investigate and address reported issues from our clients, partners, or support team</li> </ul><p></p><p></p><h3>Requirements: </h3><p><strong>To thrive in this role, we are looking for someone who:</strong></p><ul> <li>Brings extensive experience as a Software Engineer to the table</li> <li>Embodies a genuine passion for the field of security</li> <li>Can easily distinguish between a virus and a web shell</li> <li>Has knowledge in Linux server administration (an added advantage!)</li> <li>Has additional proficiency in PHP and JS (also a plus!)</li> <li>Has hands-on experience with Apache Airflow (another plus!)</li> <li>Has a solid foundation in SQL (an added advantage!)</li> <li>Is familiar with automated testing and CI/CD systems (a definite plus!)</li> <li>Demonstrates at least an intermediate level of proficiency in the English language</li> </ul><p></p><p><strong>Aside from the technical requirements, we also value these personal skills:</strong></p><ul> <li>Quick to learn and proactive in approach</li> <li>Highly self-motivated, with a determination to achieve milestones</li> <li>Exceptional prioritization skills and a flexible mindset</li> <li>Able to independently analyze tasks and find optimal solutions</li> <li>Capable of working with ambiguous requirements and making independent decisions</li> <li>An effective team player</li> </ul><p></p><p>At CloudLinux, we are not just a company, but a close-knit community that values our employees above all. With our remote-first approach, each team member is empowered to excel in their roles, knowing that they have the support they need. Our high-performance, cost-effective Linux infrastructure and security products enable companies to streamline their operations and boost efficiency.</p><p>At CloudLinux, we believe that teamwork and collaboration are the keys to success. We foster an environment where everyone can thrive and contribute to each other's success. Here, you'll find a workplace that is truly outstanding.</p><p>For more information about our company, please visit <a href=\"http://cloudlinux.com/\" rel=\"nofollow noreferrer noopener\" class=\"external\">Cloudlinux.com</a>.</p><p></p><p></p><h3>Benefits: </h3><p><strong>What's in it for you?</strong></p><ul> <li>A focus on professional development; </li> <li>Interesting and challenging projects</li> <li>Flexible working hours</li> <li>Paid one month vacation per year and unlimited sick leave</li> <li>Medical insurance reimbursement</li> <li>Co-working and gym/sports reimbursement</li> <li>The opportunity to receive a reward for the most innovative idea that the company can patent</li> </ul><p><em>By applying for this position, you agree with </em><a href=\"https://cloudlinux.com/privacy-policy\" rel=\"nofollow noreferrer noopener\" class=\"external\"><em>Cloudlinux Privacy Policy</em></a><em> and give us your consent to maintain and process your personal data with this respect. Please read our Privacy Policy for more information.</em></p>","tags":"[]","pubDate":"2024-02-07 00:00:00.000","link":"https://apply.workable.com/cloudlinux-1/j/1F899D66BB","savedDate":"2024-02-10 02:57:34.163","slug":"middle-senior-python-developer-remote-work-anywhere-cloudlinux-176"},{"id":6119091781,"title":"Malicious URL Analyst Remote/WorkAnywhere","company":"CloudLinux","image":"https://pbs.twimg.com/profile_images/696718028084482050/ymY3OEPk_400x400.png","description":"<p>Join our growing Imunify Security team as a Malicious URL Analyst! In this exciting role, you will be responsible for scouring multiple URLs and domains to identify any malicious ones.</p><p>Imunify360 Security Suite, brought to you by CloudLinux Inc., the renowned creator of the #1 OS for security and stability in hosting providers, is the powerful solution you'll be working with. Designed specifically for shared and VPS/Dedicated servers, this innovative security tool boasts a six-layer approach to comprehensive attack prevention.</p><p>At Imunify, work isn't confined to a single location. Enjoy the freedom of a fully remote position with flexible hours that allow you to work from anywhere in the world. Find out more about the project by visiting our product website at imunify360.com. Join us today and be a part of making a difference!</p><p>As a Malicious URL Analyst, your responsibilities will include:</p><ul> <li>Thoroughly analyzing various types of URLs and domains</li> <li>Developing and enhancing methods to detect and analyze malicious URLs and domains</li> <li>Conducting and publishing research on the latest security threats</li> </ul><p></p><p></p><h3>Requirements: </h3><p>To excel in this role, you should:</p><ul> <li>Have a strong grasp of web server software and hosting systems architectures, especially Linux/UNIX-based platforms.</li> <li>Possess a deep understanding of HTML and JavaScript as it relates to malware detection, including techniques like redirection, cloaking, SEO spam, and phishing.</li> <li>Have a basic knowledge of PHP and fundamental programming principles.</li> <li>Demonstrate strong analytical skills to effectively detect and address security issues.</li> <li>Be proficient in English, at least at an Intermediate level.</li> </ul><p>Preferred qualifications include:</p><ul> <li>Experience in developing security tools, automation, and frameworks.</li> <li>Proven expertise in cleaning up websites that have been compromised by malware.</li> <li>Skills in web-based malware reverse engineering, specifically in JS deobfuscation and PHP deobfuscation.</li> </ul><h3>Benefits: </h3><p><strong>What's in it for you?</strong></p><ul> <li>A focus on professional development; </li> <li>Interesting and challenging projects</li> <li>Flexible working hours</li> <li>Paid one month vacation per year and unlimited sick leave</li> <li>Medical insurance reimbursement</li> <li>Co-working and gym/sports reimbursement</li> <li>The opportunity to receive a reward for the most innovative idea that the company can patent</li> </ul><p><em>By applying for this position, you agree with </em><a href=\"https://cloudlinux.com/privacy-policy\" rel=\"nofollow noreferrer noopener\" class=\"external\"><em>Cloudlinux Privacy Policy</em></a><em> and give us your consent to maintain and process your personal data with this respect. Please read our Privacy Policy for more information.</em></p>","tags":"[\"javascript\",\"engineering\"]","pubDate":"2024-02-07 00:00:00.000","link":"https://apply.workable.com/cloudlinux-1/j/3CD380A386","savedDate":"2024-02-10 02:57:34.163","slug":"malicious-url-analyst-remote-workanywhere-cloudlinux-5505"},{"id":4737231941,"title":"Senior Full Stack Engineer (Fully Remote)","company":"CoverGo","image":"https://pbs.twimg.com/profile_images/1382655628523364355/MWPIbbID_400x400.jpg","description":"<p><strong>Top 3 Reasons To Join Us</strong></p><ul> <li>Competitive Salary</li> <li>100% Remote</li> <li>Working on the latest tech for the Insurtech Market Leader</li> </ul><p><strong>About Us</strong></p><p>At CoverGo, our mission is to empower all insurance companies to make insurance 100% digital and accessible to everyone.</p><ul> <li>We are a leading global no-code insurance platform for health, life, and P&amp;C</li> <li>We’re the winner of the Insurtech of the Year in all of Asia and other awards globally</li> <li>We work with insurance enterprise clients such as AXA, Bupa, MSIG, Dai-ichi, Bank of China Group Insurance, and many more</li> <li>We're an international, diverse team of over 120 people with 30 nationalities and team members working remotely from all over the world</li> <li>We are fully funded and backed by reputable VC funds and strategic institutional investors</li> <li>We have a global presence in Asia, EMEA and the Americas</li> <li>We’ve grown our annualized revenue by over 30x since January 2021</li> <li>We’re constantly working towards making CoverGo a workplace that you love coming to. We deeply believe that bringing together a diversity of thoughts, expressions, and perspectives is key to building the best culture for equally diverse communities all over the world</li> </ul><p><strong>About the Role</strong></p><p>As the Senior Full Stack Engineer at CoverGo, you will play a vital role in developing and maintaining our innovative insurance enterprise software solutions. You will contribute to the design, implementation, and maintenance of new features, showcasing your proficiency in both back-end and front-end frameworks. Collaborate with cross-functional teams, participate in code reviews, and maintain code quality through testing. Your role will also involve investigating and addressing bugs promptly, ensuring the reliability and security of our platform.</p><p><strong>What You Will Do</strong></p><ul> <li>Design, implement and maintain new features and functionalities for our SaaS platform, understanding the requirements of insurance businesses and translating them into scalable and efficient software solutions</li> <li>Work on both the front-end and back-end of the application, demonstrating expertise in various technologies, frameworks, and programming languages</li> <li>Work collaboratively with product, design, engineering teams, and UX designers to understand end-user requirements, use cases, and technical concepts, translating them into a cohesive and effective solution while ensuring a seamless user experience.</li> <li>Optimize the performance of the application to handle large amounts of data and high user traffic, delivering a smooth user experience</li> <li>Participate in code reviews and enforce best coding practices, while also writing and executing unit tests and integration tests to maintain code quality</li> <li>Investigate and promptly fix bugs to maintain the reliability of the platform</li> <li>Ensure security and compliance by following best practices for securing web applications and adhering to relevant regulations in handling sensitive customer data</li> <li>Stay up-to-date with the latest technologies, frameworks, and best practices to ensure we remain competitive and innovative&nbsp;</li> <li>Design the platform with scalability and flexibility in mind, accommodating new features and changes as the number of clients and users grows</li> <li>Provide mentorship to junior developers, aiding in their technical growth and effective contribution to the team's goals</li> </ul><p><strong>What We Need</strong></p><ul> <li>Proven experience of 6+ years as a Full Stack Engineer, working on complex SaaS applications</li> <li>Strong technical background with proficiency in front-end and back-end technologies, such as Java, Kotlin, Spring, Hibernate, Vue/React, PostgreSQL, MongoDB, Docker, and Kubernetes</li> <li>Familiarity with cloud platforms like AWS, Azure, or Google Cloud for building scalable applications</li> <li>Thorough understanding and practical experience with Test-Driven Development (TDD) to ensure robust and well-tested code</li> <li>Experience with unit, integration and function testing using front-end and back-end testing libraries</li> <li>In-depth knowledge of web security best practices and experience in ensuring compliance with industry regulations</li> <li>Demonstrated experience in performance optimization for high-traffic web applications</li> <li>Experience with container technologies like Docker and a good understanding of cloud infrastructure and solutions.</li> <li>Experience in collaborating with cross-functional teams</li> <li>Excellent problem-solving skills and a proactive approach to troubleshooting and bug-fixing</li> <li>Strong communication skills to effectively interact with both technical and non-technical team members with diverse backgrounds</li> <li>A passion for staying updated with the latest trends, technologies, and best practices in software development</li> </ul><p><strong>Why You'll Love Working Here</strong></p><ul> <li>Fully Remote</li> <li>Flexible Leave</li> <li>International Environment</li> <li>Competitive renumeration package</li> <li>Performance Bonus</li> <li>Stock Options after 6 months </li> <li>Company activities and events</li> <li>Learning and development plan</li> </ul><p><strong>CoverGo Company</strong><a href=\"https://www.youtube.com/watch?v=YI0ezLxvFvA\" rel=\"nofollow noreferrer noopener\" class=\"external\"><strong> Video</strong></a></p><p>By submitting your application, you confirm that you have read, understood, and accepted the content of CoverGo’s <a href=\"https://apply.workable.com/covergo/gdpr_policy?lng=en\" target=\"_blank\" rel=\"nofollow noreferrer noopener\" class=\"external\">Privacy Notice</a> and you consent to the processing of your data as part of this application.</p><p><a href=\"https://www.youtube.com/watch?v=YI0ezLxvFvA\" rel=\"nofollow noreferrer noopener\" class=\"external\"></a></p><h3>Requirements: </h3><h3>Benefits: </h3>","tags":"[\"postgres\",\"engineering\",\"mongo\",\"aws\"]","pubDate":"2024-02-06 00:00:00.000","link":"https://apply.workable.com/covergo/j/B4A1EC3BDC","savedDate":"2024-02-10 02:57:34.164","slug":"senior-full-stack-engineer-fully-remote-covergo-7160"},{"id":2545341811,"title":"Senior DevOps Engineer","company":"CoverGo","image":"https://pbs.twimg.com/profile_images/1382655628523364355/MWPIbbID_400x400.jpg","description":"<p><strong>Top 3 Reasons To Join Us</strong></p><ul> <li>Competitive Salary</li> <li>100% Remote</li> <li>Working on the latest tech for the Insurtech Market Leader</li> </ul><p><strong>About Us</strong></p><p>At CoverGo, our mission is to empower all insurance companies to make insurance 100% digital and accessible to everyone.</p><ul> <li>We are a leading global no-code insurance platform for health, life, and P&amp;C</li> <li>We’re the winner of the Insurtech of the Year in all of Asia and other awards globally</li> <li>We work with insurance enterprise clients such as AXA, Bupa, MSIG, Dai-ichi, Bank of China Group Insurance, and many more</li> <li>We're an international, diverse team of over 120 people with 30 nationalities and team members working remotely from all over the world</li> <li>We are fully funded and backed by reputable VC funds and strategic institutional investors</li> <li>We have a global presence in Asia, EMEA and the Americas</li> <li>We’ve grown our annualized revenue by over 30x since January 2021</li> <li>We’re constantly working towards making CoverGo a workplace that you love coming to. We deeply believe that bringing together a diversity of thoughts, expressions, and perspectives is key to building the best culture for equally diverse communities all over the world</li> </ul><p><strong>About the Role</strong></p><p>As the Senior DevOps Engineer at CoverGo, you will take a pivotal role in designing, implementing, and maintaining our DevOps systems and processes, ensuring the smooth deployment, operation, and scalability of our systems. You will focus on enhancing the efficiency and security of our IT infrastructure and guide the design, automation, and deployment of software changes, ensuring continuous, secure, and bug-free delivery. Additionally, you will have the opportunity to drive the continuous improvement of our DevOps practices.</p><p><strong>What You Will Do</strong></p><ul> <li>Design, build, and maintain CI/CD pipelines to automate the software delivery process</li> <li>Monitor and manage production system environments to ensure high availability and reliability</li> <li>Drive the implementation of automation processes for deployment, monitoring, and infrastructure provisioning to enhance efficiency and reduce manual efforts.</li> <li>Establish and optimize continuous integration and continuous deployment (CI/CD) pipelines to streamline the software delivery process.</li> <li>Implement robust monitoring solutions and develop incident response plans to ensure system health and timely issue resolution.</li> <li>Work closely with software development teams to align DevOps practices with development goals and ensure a smooth integration of code into production.</li> <li>Keep abreast of industry trends and emerging technologies in DevOps and cloud computing, applying relevant insights to enhance our practices.</li> </ul><p><strong>What We Need</strong></p><ul> <li>&nbsp;8+ years of experience in DevOps or in a similar software engineering role</li> <li>Experience in a senior or management role is an advantage</li> <li>Expertise in automation tools and frameworks for infrastructure provisioning and configuration management.</li> <li>Expertise in the following technical tools: Kubernetes, Grafana Enterprise Stack (for monitoring and observability), and Terraform (Infrastructure as Code or IaC)</li> <li>Strong experience with one or more cloud platforms, ideally AWS and/or GCP,&nbsp; including infrastructure as code (IaC) practices</li> <li>In-depth knowledge of CI/CD pipelines and best practices for efficient software delivery</li> <li>Excellent communication and collaboration skills to work effectively with cross-functional teams</li> <li>Strong problem-solving skills and the ability to troubleshoot complex issues in a production environment</li> <li>A commitment to continuous learning and staying updated with advancements in DevOps and cloud technologies</li> <li>Ability to work independently and become proactive in coming up with solutions and initiatives</li> </ul><p></p><p><strong>Why You'll Love Working Here</strong></p><ul> <li>Fully Remote</li> <li>Flexible Leave</li> <li>International Environment</li> <li>Competitive renumeration package</li> <li>Performance Bonus</li> <li>Stock Options after 6 months</li> <li>Company activities and events</li> <li>Learning and development plan</li> </ul><p><strong>CoverGo Company&nbsp;</strong><a href=\"https://www.youtube.com/watch?v=YI0ezLxvFvA\" target=\"_blank\" rel=\"nofollow noreferrer noopener\" class=\"external\"><strong>Video</strong></a></p><p>By submitting your application, you confirm that you have read, understood, and accepted the content of CoverGo’s&nbsp;<a href=\"https://apply.workable.com/covergo/gdpr_policy?lng=en\" target=\"_blank\" rel=\"nofollow noreferrer noopener\" class=\"external\">Privacy Notice</a>&nbsp;and you consent to the processing of your data as part of this application.</p><h3>Requirements: </h3><h3>Benefits: </h3>","tags":"[\"management\",\"engineering\",\"aws\"]","pubDate":"2024-02-06 00:00:00.000","link":"https://apply.workable.com/covergo/j/47648E20F6","savedDate":"2024-02-10 02:57:34.164","slug":"senior-devops-engineer-covergo-7052"},{"id":6474448700,"title":"Senior DevOps Engineer","company":"CoverGo","image":"https://pbs.twimg.com/profile_images/1382655628523364355/MWPIbbID_400x400.jpg","description":"<p><strong>Top 3 Reasons To Join Us</strong></p><ul> <li>Competitive Salary</li> <li>100% Remote</li> <li>Working on the latest tech for the Insurtech Market Leader</li> </ul><p><strong>About Us</strong></p><p>At CoverGo, our mission is to empower all insurance companies to make insurance 100% digital and accessible to everyone.</p><ul> <li>We are a leading global no-code insurance platform for health, life, and P&amp;C</li> <li>We’re the winner of the Insurtech of the Year in all of Asia and other awards globally</li> <li>We work with insurance enterprise clients such as AXA, Bupa, MSIG, Dai-ichi, Bank of China Group Insurance, and many more</li> <li>We're an international, diverse team of over 120 people with 30 nationalities and team members working remotely from all over the world</li> <li>We are fully funded and backed by reputable VC funds and strategic institutional investors</li> <li>We have a global presence in Asia, EMEA and the Americas</li> <li>We’ve grown our annualized revenue by over 30x since January 2021</li> <li>We’re constantly working towards making CoverGo a workplace that you love coming to. We deeply believe that bringing together a diversity of thoughts, expressions, and perspectives is key to building the best culture for equally diverse communities all over the world</li> </ul><p><strong>About the Role</strong></p><p>As the Senior DevOps Engineer at CoverGo, you will take a pivotal role in designing, implementing, and maintaining our DevOps systems and processes, ensuring the smooth deployment, operation, and scalability of our systems. You will focus on enhancing the efficiency and security of our IT infrastructure and guide the design, automation, and deployment of software changes, ensuring continuous, secure, and bug-free delivery. Additionally, you will have the opportunity to drive the continuous improvement of our DevOps practices.</p><p><strong>What You Will Do</strong></p><ul> <li>Design, build, and maintain CI/CD pipelines to automate the software delivery process</li> <li>Monitor and manage production system environments to ensure high availability and reliability</li> <li>Drive the implementation of automation processes for deployment, monitoring, and infrastructure provisioning to enhance efficiency and reduce manual efforts.</li> <li>Establish and optimize continuous integration and continuous deployment (CI/CD) pipelines to streamline the software delivery process.</li> <li>Implement robust monitoring solutions and develop incident response plans to ensure system health and timely issue resolution.</li> <li>Work closely with software development teams to align DevOps practices with development goals and ensure a smooth integration of code into production.</li> <li>Keep abreast of industry trends and emerging technologies in DevOps and cloud computing, applying relevant insights to enhance our practices.</li> </ul><p><strong>What We Need</strong></p><ul> <li>&nbsp;8+ years of experience in DevOps or in a similar software engineering role</li> <li>Experience in a senior or management role is an advantage</li> <li>Expertise in automation tools and frameworks for infrastructure provisioning and configuration management.</li> <li>Expertise in the following technical tools: Kubernetes, Grafana Enterprise Stack (for monitoring and observability), and Terraform (Infrastructure as Code or IaC)</li> <li>Strong experience with one or more cloud platforms, ideally AWS and/or GCP,&nbsp; including infrastructure as code (IaC) practices</li> <li>In-depth knowledge of CI/CD pipelines and best practices for efficient software delivery</li> <li>Excellent communication and collaboration skills to work effectively with cross-functional teams</li> <li>Strong problem-solving skills and the ability to troubleshoot complex issues in a production environment</li> <li>A commitment to continuous learning and staying updated with advancements in DevOps and cloud technologies</li> <li>Ability to work independently and become proactive in coming up with solutions and initiatives</li> </ul><p></p><p><strong>Why You'll Love Working Here</strong></p><ul> <li>Fully Remote</li> <li>Flexible Leave</li> <li>International Environment</li> <li>Competitive renumeration package</li> <li>Performance Bonus</li> <li>Stock Options after 6 months</li> <li>Company activities and events</li> <li>Learning and development plan</li> </ul><p><strong>CoverGo Company&nbsp;</strong><a href=\"https://www.youtube.com/watch?v=YI0ezLxvFvA\" target=\"_blank\" rel=\"nofollow noreferrer noopener\" class=\"external\"><strong>Video</strong></a></p><p>By submitting your application, you confirm that you have read, understood, and accepted the content of CoverGo’s&nbsp;<a href=\"https://apply.workable.com/covergo/gdpr_policy?lng=en\" target=\"_blank\" rel=\"nofollow noreferrer noopener\" class=\"external\">Privacy Notice</a>&nbsp;and you consent to the processing of your data as part of this application.</p><h3>Requirements: </h3><h3>Benefits: </h3>","tags":"[\"management\",\"engineering\",\"aws\"]","pubDate":"2024-02-06 00:00:00.000","link":"https://apply.workable.com/covergo/j/FD1C00A18A","savedDate":"2024-02-10 02:57:34.164","slug":"senior-devops-engineer-covergo-2543"},{"id":4088060934,"title":"Senior Full Stack Engineer (Fully Remote)","company":"CoverGo","image":"https://pbs.twimg.com/profile_images/1382655628523364355/MWPIbbID_400x400.jpg","description":"<p><strong>Top 3 Reasons To Join Us</strong></p><ul> <li>Competitive Salary</li> <li>100% Remote</li> <li>Working on the latest tech for the Insurtech Market Leader</li> </ul><p><strong>About Us</strong></p><p>At CoverGo, our mission is to empower all insurance companies to make insurance 100% digital and accessible to everyone.</p><ul> <li>We are a leading global no-code insurance platform for health, life, and P&amp;C</li> <li>We’re the winner of the Insurtech of the Year in all of Asia and other awards globally</li> <li>We work with insurance enterprise clients such as AXA, Bupa, MSIG, Dai-ichi, Bank of China Group Insurance, and many more</li> <li>We're an international, diverse team of over 120 people with 30 nationalities and team members working remotely from all over the world</li> <li>We are fully funded and backed by reputable VC funds and strategic institutional investors</li> <li>We have a global presence in Asia, EMEA and the Americas</li> <li>We’ve grown our annualized revenue by over 30x since January 2021</li> <li>We’re constantly working towards making CoverGo a workplace that you love coming to. We deeply believe that bringing together a diversity of thoughts, expressions, and perspectives is key to building the best culture for equally diverse communities all over the world</li> </ul><p><strong>About the Role</strong></p><p>As the Senior Full Stack Engineer at CoverGo, you will play a vital role in developing and maintaining our innovative insurance enterprise software solutions. You will contribute to the design, implementation, and maintenance of new features, showcasing your proficiency in both back-end and front-end frameworks. Collaborate with cross-functional teams, participate in code reviews, and maintain code quality through testing. Your role will also involve investigating and addressing bugs promptly, ensuring the reliability and security of our platform.</p><p><strong>What You Will Do</strong></p><ul> <li>Design, implement and maintain new features and functionalities for our SaaS platform, understanding the requirements of insurance businesses and translating them into scalable and efficient software solutions</li> <li>Work on both the front-end and back-end of the application, demonstrating expertise in various technologies, frameworks, and programming languages</li> <li>Work collaboratively with product, design, engineering teams, and UX designers to understand end-user requirements, use cases, and technical concepts, translating them into a cohesive and effective solution while ensuring a seamless user experience.</li> <li>Optimize the performance of the application to handle large amounts of data and high user traffic, delivering a smooth user experience</li> <li>Participate in code reviews and enforce best coding practices, while also writing and executing unit tests and integration tests to maintain code quality</li> <li>Investigate and promptly fix bugs to maintain the reliability of the platform</li> <li>Ensure security and compliance by following best practices for securing web applications and adhering to relevant regulations in handling sensitive customer data</li> <li>Stay up-to-date with the latest technologies, frameworks, and best practices to ensure we remain competitive and innovative&nbsp;</li> <li>Design the platform with scalability and flexibility in mind, accommodating new features and changes as the number of clients and users grows</li> <li>Provide mentorship to junior developers, aiding in their technical growth and effective contribution to the team's goals</li> </ul><p><strong>What We Need</strong></p><ul> <li>Proven experience of 6+ years as a Full Stack Engineer, working on complex SaaS applications</li> <li>Strong technical background with proficiency in front-end and back-end technologies, such as Java, Kotlin, Spring, Hibernate, Vue/React, PostgreSQL, MongoDB, Docker, and Kubernetes</li> <li>Familiarity with cloud platforms like AWS, Azure, or Google Cloud for building scalable applications</li> <li>Thorough understanding and practical experience with Test-Driven Development (TDD) to ensure robust and well-tested code</li> <li>Experience with unit, integration and function testing using front-end and back-end testing libraries</li> <li>In-depth knowledge of web security best practices and experience in ensuring compliance with industry regulations</li> <li>Demonstrated experience in performance optimization for high-traffic web applications</li> <li>Experience with container technologies like Docker and a good understanding of cloud infrastructure and solutions.</li> <li>Experience in collaborating with cross-functional teams</li> <li>Excellent problem-solving skills and a proactive approach to troubleshooting and bug-fixing</li> <li>Strong communication skills to effectively interact with both technical and non-technical team members with diverse backgrounds</li> <li>A passion for staying updated with the latest trends, technologies, and best practices in software development</li> </ul><p><strong>Why You'll Love Working Here</strong></p><ul> <li>Fully Remote</li> <li>Flexible Leave</li> <li>International Environment</li> <li>Competitive renumeration package</li> <li>Performance Bonus</li> <li>Stock Options after 6 months </li> <li>Company activities and events</li> <li>Learning and development plan</li> </ul><p><strong>CoverGo Company</strong><a href=\"https://www.youtube.com/watch?v=YI0ezLxvFvA\" rel=\"nofollow noreferrer noopener\" class=\"external\"><strong> Video</strong></a></p><p>By submitting your application, you confirm that you have read, understood, and accepted the content of CoverGo’s <a href=\"https://apply.workable.com/covergo/gdpr_policy?lng=en\" target=\"_blank\" rel=\"nofollow noreferrer noopener\" class=\"external\">Privacy Notice</a> and you consent to the processing of your data as part of this application.</p><p><a href=\"https://www.youtube.com/watch?v=YI0ezLxvFvA\" rel=\"nofollow noreferrer noopener\" class=\"external\"></a></p><h3>Requirements: </h3><h3>Benefits: </h3>","tags":"[\"postgres\",\"engineering\",\"mongo\",\"aws\"]","pubDate":"2024-02-06 00:00:00.000","link":"https://apply.workable.com/covergo/j/FB306275FD","savedDate":"2024-02-10 02:57:34.165","slug":"senior-full-stack-engineer-fully-remote-covergo-5349"},{"id":2971530810,"title":"Lead Full Stack Engineer (Fully Remote)","company":"CoverGo","image":"https://pbs.twimg.com/profile_images/1382655628523364355/MWPIbbID_400x400.jpg","description":"<p><strong>Top 3 Reasons To Join Us</strong></p><ul> <li>Competitive Salary</li> <li>100% Remote</li> <li>Working on the latest tech for the Insurtech Market Leader</li> </ul><p><strong>About Us</strong></p><p>At CoverGo, our mission is to empower all insurance companies to make insurance 100% digital and accessible to everyone.</p><ul> <li>We are a leading global no-code insurance platform for health, life, and P&amp;C</li> <li>We’re the winner of the Insurtech of the Year in all of Asia and other awards globally</li> <li>We work with insurance enterprise clients such as AXA, Bupa, MSIG, Dai-ichi, Bank of China Group Insurance, and many more</li> <li>We're an international, diverse team of over 120 people with 30 nationalities and team members working remotely from all over the world</li> <li>We are fully funded and backed by reputable VC funds and strategic institutional investors</li> <li>We have a global presence in Asia, EMEA and the Americas</li> <li>We’ve grown our annualized revenue by over 30x since January 2021</li> <li>We’re constantly working towards making CoverGo a workplace that you love coming to. We deeply believe that bringing together a diversity of thoughts, expressions, and perspectives is key to building the best culture for equally diverse communities all over the world</li> </ul><p><strong>About the Role</strong></p><p>As the Lead Full Stack Engineer at CoverGo, you will take on a pivotal role in guiding the design, implementation, and maintenance of our innovative insurance enterprise software solutions. You will be responsible for providing direction to the team, working on both the front-end and back-end technologies, and ensuring scalable and efficient software solutions. Collaborate closely with cross-functional teams to understand end-user requirements, optimize application performance, and enforce coding best practices. Your role will encompass mentoring junior developers, driving innovation, and ensuring the continuous growth and success of our platform.</p><p><strong>What You Will Do</strong></p><ul> <li>Lead the design, implementation, and maintenance of our insurance enterprise software solutions, providing technical direction to the team.</li> <li>Demonstrate expertise in both front-end and back-end technologies, offering guidance on technology selection, architecture, and best practices.</li> <li>Collaborate with product, design, and engineering teams to understand requirements and technical concepts, ensuring cohesive and effective solutions with a seamless user experience.</li> <li>Optimize platform performance to handle large datasets and high user traffic, ensuring a smooth and responsive user experience.</li> <li>Conduct and lead code reviews, enforce best coding practices, and drive the adoption of standards to maintain high code quality.</li> <li>Investigate and promptly address bugs to uphold platform reliability.</li> <li>Ensure security and compliance by following best practices for securing web applications and adhering to relevant regulations.</li> <li>Stay abreast of the latest technologies, frameworks, and best practices, guiding the team in remaining competitive and innovative.</li> <li>Design the platform with scalability and flexibility, accommodating evolving features and changes as the user base grows.</li> <li>Provide mentorship and technical leadership to junior developers, fostering their growth and contribution to the team's objectives.</li> </ul><p><strong>What We Need</strong></p><ul> <li>Proven experience of 8+ years as a Full Stack Engineer, with a track record of leading complex SaaS applications.</li> <li>Strong technical background with proficiency in front-end and back-end technologies, such as Java, Kotlin, Spring, Hibernate, Vue/React, PostgreSQL, MongoDB, Docker, and Kubernetes</li> <li>Strong background in RESTful API design patterns with specifications in OpenAPI and Swagger. Familiarity with API Gateways provided by cloud platforms and others, such as Spring Cloud Gateway.&nbsp;</li> <li>Familiarity with cloud platforms like AWS, Azure, or Google Cloud for building scalable applications</li> <li>Minimum of 2 years in a senior or management role, with the ability to guide and inspire development teams</li> <li>Thorough understanding and practical experience with Test-Driven Development (TDD) to ensure robust and well-tested code</li> <li>Experience with unit, integration and function testing using front-end and back-end testing libraries</li> <li>In-depth knowledge of web security best practices and experience in ensuring compliance with industry regulations</li> <li>Demonstrated experience in performance optimization for high-traffic web applications</li> <li>Experience with container technologies like Docker and a very good understanding of cloud infrastructure and solutions.</li> <li>Experience in collaborating with cross-functional teams</li> <li>Excellent problem-solving skills and a proactive approach to troubleshooting and bug-fixing</li> <li>Strong communication skills to effectively interact with both technical and non-technical team members with diverse backgrounds</li> <li>A passion for staying updated with the latest trends, technologies, and best practices in software development</li> </ul><p><strong>Why You'll Love Working Here</strong></p><ul> <li>Fully Remote</li> <li>Flexible Leave</li> <li>International Environment</li> <li>Competitive renumeration package</li> <li>Performance Bonus</li> <li>Stock Options after 6 months </li> <li>Company activities and events</li> <li>Learning and development plan</li> </ul><p><strong>CoverGo Company</strong><a href=\"https://www.youtube.com/watch?v=YI0ezLxvFvA\" rel=\"nofollow noreferrer noopener\" class=\"external\"><strong> Video</strong></a></p><p>By submitting your application, you confirm that you have read, understood, and accepted the content of CoverGo’s <a href=\"https://apply.workable.com/covergo/gdpr_policy?lng=en\" target=\"_blank\" rel=\"nofollow noreferrer noopener\" class=\"external\">Privacy Notice</a> and you consent to the processing of your data as part of this application.</p><p><a href=\"https://www.youtube.com/watch?v=YI0ezLxvFvA\" rel=\"nofollow noreferrer noopener\" class=\"external\"></a></p><h3>Requirements: </h3><h3>Benefits: </h3>","tags":"[\"postgres\",\"management\",\"engineering\",\"mongo\",\"aws\"]","pubDate":"2024-02-06 00:00:00.000","link":"https://apply.workable.com/covergo/j/A159569E77","savedDate":"2024-02-10 02:57:34.165","slug":"lead-full-stack-engineer-fully-remote-covergo-2943"},{"id":8379438962,"title":"Lead Full Stack Engineer (Fully Remote)","company":"CoverGo","image":"https://pbs.twimg.com/profile_images/1382655628523364355/MWPIbbID_400x400.jpg","description":"<p><strong>Top 3 Reasons To Join Us</strong></p><ul> <li>Competitive Salary</li> <li>100% Remote</li> <li>Working on the latest tech for the Insurtech Market Leader</li> </ul><p><strong>About Us</strong></p><p>At CoverGo, our mission is to empower all insurance companies to make insurance 100% digital and accessible to everyone.</p><ul> <li>We are a leading global no-code insurance platform for health, life, and P&amp;C</li> <li>We’re the winner of the Insurtech of the Year in all of Asia and other awards globally</li> <li>We work with insurance enterprise clients such as AXA, Bupa, MSIG, Dai-ichi, Bank of China Group Insurance, and many more</li> <li>We're an international, diverse team of over 120 people with 30 nationalities and team members working remotely from all over the world</li> <li>We are fully funded and backed by reputable VC funds and strategic institutional investors</li> <li>We have a global presence in Asia, EMEA and the Americas</li> <li>We’ve grown our annualized revenue by over 30x since January 2021</li> <li>We’re constantly working towards making CoverGo a workplace that you love coming to. We deeply believe that bringing together a diversity of thoughts, expressions, and perspectives is key to building the best culture for equally diverse communities all over the world</li> </ul><p><strong>About the Role</strong></p><p>As the Lead Full Stack Engineer at CoverGo, you will take on a pivotal role in guiding the design, implementation, and maintenance of our innovative insurance enterprise software solutions. You will be responsible for providing direction to the team, working on both the front-end and back-end technologies, and ensuring scalable and efficient software solutions. Collaborate closely with cross-functional teams to understand end-user requirements, optimize application performance, and enforce coding best practices. Your role will encompass mentoring junior developers, driving innovation, and ensuring the continuous growth and success of our platform.</p><p><strong>What You Will Do</strong></p><ul> <li>Lead the design, implementation, and maintenance of our insurance enterprise software solutions, providing technical direction to the team.</li> <li>Demonstrate expertise in both front-end and back-end technologies, offering guidance on technology selection, architecture, and best practices.</li> <li>Collaborate with product, design, and engineering teams to understand requirements and technical concepts, ensuring cohesive and effective solutions with a seamless user experience.</li> <li>Optimize platform performance to handle large datasets and high user traffic, ensuring a smooth and responsive user experience.</li> <li>Conduct and lead code reviews, enforce best coding practices, and drive the adoption of standards to maintain high code quality.</li> <li>Investigate and promptly address bugs to uphold platform reliability.</li> <li>Ensure security and compliance by following best practices for securing web applications and adhering to relevant regulations.</li> <li>Stay abreast of the latest technologies, frameworks, and best practices, guiding the team in remaining competitive and innovative.</li> <li>Design the platform with scalability and flexibility, accommodating evolving features and changes as the user base grows.</li> <li>Provide mentorship and technical leadership to junior developers, fostering their growth and contribution to the team's objectives.</li> </ul><p><strong>What We Need</strong></p><ul> <li>Proven experience of 8+ years as a Full Stack Engineer, with a track record of leading complex SaaS applications.</li> <li>Strong technical background with proficiency in front-end and back-end technologies, such as Java, Kotlin, Spring, Hibernate, Vue/React, PostgreSQL, MongoDB, Docker, and Kubernetes</li> <li>Strong background in RESTful API design patterns with specifications in OpenAPI and Swagger. Familiarity with API Gateways provided by cloud platforms and others, such as Spring Cloud Gateway.&nbsp;</li> <li>Familiarity with cloud platforms like AWS, Azure, or Google Cloud for building scalable applications</li> <li>Minimum of 2 years in a senior or management role, with the ability to guide and inspire development teams</li> <li>Thorough understanding and practical experience with Test-Driven Development (TDD) to ensure robust and well-tested code</li> <li>Experience with unit, integration and function testing using front-end and back-end testing libraries</li> <li>In-depth knowledge of web security best practices and experience in ensuring compliance with industry regulations</li> <li>Demonstrated experience in performance optimization for high-traffic web applications</li> <li>Experience with container technologies like Docker and a very good understanding of cloud infrastructure and solutions.</li> <li>Experience in collaborating with cross-functional teams</li> <li>Excellent problem-solving skills and a proactive approach to troubleshooting and bug-fixing</li> <li>Strong communication skills to effectively interact with both technical and non-technical team members with diverse backgrounds</li> <li>A passion for staying updated with the latest trends, technologies, and best practices in software development</li> </ul><p><strong>Why You'll Love Working Here</strong></p><ul> <li>Fully Remote</li> <li>Flexible Leave</li> <li>International Environment</li> <li>Competitive renumeration package</li> <li>Performance Bonus</li> <li>Stock Options after 6 months </li> <li>Company activities and events</li> <li>Learning and development plan</li> </ul><p><strong>CoverGo Company</strong><a href=\"https://www.youtube.com/watch?v=YI0ezLxvFvA\" rel=\"nofollow noreferrer noopener\" class=\"external\"><strong> Video</strong></a></p><p>By submitting your application, you confirm that you have read, understood, and accepted the content of CoverGo’s <a href=\"https://apply.workable.com/covergo/gdpr_policy?lng=en\" target=\"_blank\" rel=\"nofollow noreferrer noopener\" class=\"external\">Privacy Notice</a> and you consent to the processing of your data as part of this application.</p><p><a href=\"https://www.youtube.com/watch?v=YI0ezLxvFvA\" rel=\"nofollow noreferrer noopener\" class=\"external\"></a></p><h3>Requirements: </h3><h3>Benefits: </h3>","tags":"[\"postgres\",\"management\",\"engineering\",\"mongo\",\"aws\"]","pubDate":"2024-02-06 00:00:00.000","link":"https://apply.workable.com/covergo/j/5431EC1512","savedDate":"2024-02-10 02:57:34.166","slug":"lead-full-stack-engineer-fully-remote-covergo-5836"},{"id":2961520320,"title":"Full Stack Engineer (Fully Remote)","company":"CoverGo","image":"https://pbs.twimg.com/profile_images/1382655628523364355/MWPIbbID_400x400.jpg","description":"<p><strong>Top 3 Reasons To Join Us</strong></p><ul> <li>Competitive Salary</li> <li>100% Remote</li> <li>Working on the latest tech for the Insurtech Market Leader</li> </ul><p><strong>About Us</strong></p><p>At CoverGo, our mission is to empower all insurance companies to make insurance 100% digital and accessible to everyone.</p><ul> <li>We are a leading global no-code insurance platform for health, life, and P&amp;C</li> <li>We’re the winner of the Insurtech of the Year in all of Asia and other awards globally</li> <li>We work with insurance enterprise clients such as AXA, Bupa, MSIG, Dai-ichi, Bank of China Group Insurance, and many more</li> <li>We're an international, diverse team of over 120 people with 30 nationalities and team members working remotely from all over the world</li> <li>We are fully funded and backed by reputable VC funds and strategic institutional investors</li> <li>We have a global presence in Asia, EMEA and the Americas</li> <li>We’ve grown our annualized revenue by over 30x since January 2021</li> <li>We’re constantly working towards making CoverGo a workplace that you love coming to. We deeply believe that bringing together a diversity of thoughts, expressions, and perspectives is key to building the best culture for equally diverse communities all over the world</li> </ul><p><strong>About the Role</strong></p><p>As a Full Stack Engineer at CoverGo, you will contribute to the ongoing development and enhancement of our innovative insurance enterprise software solutions. Showcase your proficiency with both front-end and back-end technologies. Collaborate with cross-functional teams, participate in code reviews, and contribute to maintaining code quality through testing. Investigate and address bugs promptly to ensure the reliability and security of our platform while staying informed about the latest technologies and best practices in software development.</p><p><strong>What You Will Do</strong></p><ul> <li>Contribute to the design, implementation, and maintenance of new features and functionalities for our SaaSplatform.</li> <li>Work with both front-end and back-end technologies.</li> <li>Collaborate with cross-functional teams to understand end-user requirements, translating them into scalable and efficient software solutions.</li> <li>Participate in code reviews, adhere to coding best practices, and contribute to maintaining code quality through unit and integration testing.</li> <li>Investigate and address bugs promptly to ensure the reliability of the platform.</li> <li>Contribute to ensuring security and compliance by following best practices and adhering to industry regulations.</li> <li>Stay informed about the latest technologies, frameworks, and best practices in software development.</li> </ul><p><strong>What We Need</strong></p><ul> <li>Proven experience of 4+ years as a Full Stack Engineer, with experience working on SaaS applications.</li> <li>Strong technical background with proficiency in front-end and back-end technologies, such as Java, Kotlin, Spring, Hibernate, Vue/React, PostgreSQL, and MongoDB. Experience with Docker and Kubernetes is advantageous.</li> <li>Familiarity with cloud platforms like AWS, Azure, or Google Cloud for building scalable applications</li> <li>Understanding of Test-Driven Development (TDD) principles.</li> <li>Experience with unit, integration and function testing using front-end and back-end testing libraries</li> <li>Understanding of web security best practices and compliance with industry regulations.</li> <li>Familiarity with container technologies like Docker and cloud infrastructure solutions.</li> <li>Experience in collaborating with cross-functional teams</li> <li>Excellent problem-solving skills and a proactive approach to troubleshooting and bug-fixing</li> <li>Strong communication skills to effectively interact with both technical and non-technical team members with diverse backgrounds</li> <li>A passion for staying updated with the latest trends, technologies, and best practices in software development</li> </ul><p><strong>Why You'll Love Working Here</strong></p><ul> <li>Fully Remote</li> <li>Flexible Leave</li> <li>International Environment</li> <li>Competitive renumeration package</li> <li>Performance Bonus</li> <li>Stock Options after 6 months </li> <li>Company activities and events</li> <li>Learning and development plan</li> </ul><p><strong>CoverGo Company</strong><a href=\"https://www.youtube.com/watch?v=YI0ezLxvFvA\" rel=\"nofollow noreferrer noopener\" class=\"external\"><strong> Video</strong></a></p><p>By submitting your application, you confirm that you have read, understood, and accepted the content of CoverGo’s <a href=\"https://apply.workable.com/covergo/gdpr_policy?lng=en\" target=\"_blank\" rel=\"nofollow noreferrer noopener\" class=\"external\">Privacy Notice</a> and you consent to the processing of your data as part of this application.</p><p><a href=\"https://www.youtube.com/watch?v=YI0ezLxvFvA\" rel=\"nofollow noreferrer noopener\" class=\"external\"></a></p><h3>Requirements: </h3><h3>Benefits: </h3>","tags":"[\"postgres\",\"mongo\",\"aws\"]","pubDate":"2024-02-06 00:00:00.000","link":"https://apply.workable.com/covergo/j/A989A2E8EE","savedDate":"2024-02-10 02:57:34.166","slug":"full-stack-engineer-fully-remote-covergo-3179"},{"id":5468215930,"title":"Full Stack Engineer (Fully Remote)","company":"CoverGo","image":"https://pbs.twimg.com/profile_images/1382655628523364355/MWPIbbID_400x400.jpg","description":"<p><strong>Top 3 Reasons To Join Us</strong></p><ul> <li>Competitive Salary</li> <li>100% Remote</li> <li>Working on the latest tech for the Insurtech Market Leader</li> </ul><p><strong>About Us</strong></p><p>At CoverGo, our mission is to empower all insurance companies to make insurance 100% digital and accessible to everyone.</p><ul> <li>We are a leading global no-code insurance platform for health, life, and P&amp;C</li> <li>We’re the winner of the Insurtech of the Year in all of Asia and other awards globally</li> <li>We work with insurance enterprise clients such as AXA, Bupa, MSIG, Dai-ichi, Bank of China Group Insurance, and many more</li> <li>We're an international, diverse team of over 120 people with 30 nationalities and team members working remotely from all over the world</li> <li>We are fully funded and backed by reputable VC funds and strategic institutional investors</li> <li>We have a global presence in Asia, EMEA and the Americas</li> <li>We’ve grown our annualized revenue by over 30x since January 2021</li> <li>We’re constantly working towards making CoverGo a workplace that you love coming to. We deeply believe that bringing together a diversity of thoughts, expressions, and perspectives is key to building the best culture for equally diverse communities all over the world</li> </ul><p><strong>About the Role</strong></p><p>As a Full Stack Engineer at CoverGo, you will contribute to the ongoing development and enhancement of our innovative insurance enterprise software solutions. Showcase your proficiency with both front-end and back-end technologies. Collaborate with cross-functional teams, participate in code reviews, and contribute to maintaining code quality through testing. Investigate and address bugs promptly to ensure the reliability and security of our platform while staying informed about the latest technologies and best practices in software development.</p><p><strong>What You Will Do</strong></p><ul> <li>Contribute to the design, implementation, and maintenance of new features and functionalities for our SaaSplatform.</li> <li>Work with both front-end and back-end technologies.</li> <li>Collaborate with cross-functional teams to understand end-user requirements, translating them into scalable and efficient software solutions.</li> <li>Participate in code reviews, adhere to coding best practices, and contribute to maintaining code quality through unit and integration testing.</li> <li>Investigate and address bugs promptly to ensure the reliability of the platform.</li> <li>Contribute to ensuring security and compliance by following best practices and adhering to industry regulations.</li> <li>Stay informed about the latest technologies, frameworks, and best practices in software development.</li> </ul><p><strong>What We Need</strong></p><ul> <li>Proven experience of 4+ years as a Full Stack Engineer, with experience working on SaaS applications.</li> <li>Strong technical background with proficiency in front-end and back-end technologies, such as Java, Kotlin, Spring, Hibernate, Vue/React, PostgreSQL, and MongoDB. Experience with Docker and Kubernetes is advantageous.</li> <li>Familiarity with cloud platforms like AWS, Azure, or Google Cloud for building scalable applications</li> <li>Understanding of Test-Driven Development (TDD) principles.</li> <li>Experience with unit, integration and function testing using front-end and back-end testing libraries</li> <li>Understanding of web security best practices and compliance with industry regulations.</li> <li>Familiarity with container technologies like Docker and cloud infrastructure solutions.</li> <li>Experience in collaborating with cross-functional teams</li> <li>Excellent problem-solving skills and a proactive approach to troubleshooting and bug-fixing</li> <li>Strong communication skills to effectively interact with both technical and non-technical team members with diverse backgrounds</li> <li>A passion for staying updated with the latest trends, technologies, and best practices in software development</li> </ul><p><strong>Why You'll Love Working Here</strong></p><ul> <li>Fully Remote</li> <li>Flexible Leave</li> <li>International Environment</li> <li>Competitive renumeration package</li> <li>Performance Bonus</li> <li>Stock Options after 6 months </li> <li>Company activities and events</li> <li>Learning and development plan</li> </ul><p><strong>CoverGo Company</strong><a href=\"https://www.youtube.com/watch?v=YI0ezLxvFvA\" rel=\"nofollow noreferrer noopener\" class=\"external\"><strong> Video</strong></a></p><p>By submitting your application, you confirm that you have read, understood, and accepted the content of CoverGo’s <a href=\"https://apply.workable.com/covergo/gdpr_policy?lng=en\" target=\"_blank\" rel=\"nofollow noreferrer noopener\" class=\"external\">Privacy Notice</a> and you consent to the processing of your data as part of this application.</p><p><a href=\"https://www.youtube.com/watch?v=YI0ezLxvFvA\" rel=\"nofollow noreferrer noopener\" class=\"external\"></a></p><h3>Requirements: </h3><h3>Benefits: </h3>","tags":"[\"postgres\",\"mongo\",\"aws\"]","pubDate":"2024-02-06 00:00:00.000","link":"https://apply.workable.com/covergo/j/E19999D641","savedDate":"2024-02-10 02:57:34.166","slug":"full-stack-engineer-fully-remote-covergo-4645"},{"id":5985088783,"title":"Senior Front End Engineer (Fully Remote)","company":"CoverGo","image":"https://pbs.twimg.com/profile_images/1382655628523364355/MWPIbbID_400x400.jpg","description":"<p><strong>Top 3 Reasons To Join Us</strong></p><ul> <li>Competitive Salary</li> <li>100% Remote</li> <li>Working on the latest tech for the Insurtech Market Leader</li> </ul><p><strong>About Us</strong></p><p>At CoverGo, our mission is to empower all insurance companies to make insurance 100% digital and accessible to everyone.</p><ul> <li>We are a leading global no-code insurance platform for health, life, and P&amp;C</li> <li>We’re the winner of the Insurtech of the Year in all of Asia and other awards globally</li> <li>We work with insurance enterprise clients such as AXA, Bupa, MSIG, Dai-ichi, Bank of China Group Insurance, and many more</li> <li>We're an international, diverse team of over 120 people with 30 nationalities and team members working remotely from all over the world</li> <li>We are fully funded and backed by reputable VC funds and strategic institutional investors</li> <li>We have a global presence in Asia, EMEA and the Americas</li> <li>We’ve grown our annualized revenue by over 30x since January 2021</li> <li>We’re constantly working towards making CoverGo a workplace that you love coming to. We deeply believe that bringing together a diversity of thoughts, expressions, and perspectives is key to building the best culture for equally diverse communities all over the world</li> </ul><p><strong>About the Role</strong></p><p>As a Senior Front End Engineer at CoverGo, you will play a vital role in advancing the development of core product features. You will contribute to the design, implementation, and maintenance of new features, showcasing your proficiency in front-end frameworks. You will focus on crafting intuitive interfaces, leveraging your expertise to refine and optimize existing codebases. Collaborate with cross-functional teams, participate in code reviews, and maintain code quality through testing. Your role will also involve investigating and addressing bugs promptly, ensuring the reliability and security of our platform.</p><p><strong>What You Will Do</strong></p><ul> <li>As a Senior Front End Engineer, you'll work on core product features of the CoverGo platform</li> <li>Work on challenging frontend problems in multi-tenant and cloud-agnostic architectures</li> <li>Crafting no-code editors, tools and visual rules engines</li> <li>Fully own features from ideation with design and product, to working on iterations and improvements</li> <li>Improving and refactoring our current codebases</li> <li>Evaluating new technologies for the platform</li> <li>Participate in code reviews and enforce best coding practices, while also writing and executing unit tests and integration tests to maintain code quality</li> <li>Build relationships and work closely with engineers, product, design, architects and BAs across all product teams in CoverGo</li> <li>Ensure security and compliance by following best practices for securing web applications and adhering to relevant regulations in handling sensitive customer data</li> <li>Stay up-to-date with the latest technologies, frameworks, and best practices to ensure we remain competitive and innovative&nbsp;</li> <li>Provide mentorship to junior developers, aiding in their technical growth and effective contribution to the team's goals</li> </ul><p><strong>What We Need</strong></p><ul> <li>Minimum 5+ years of experience in frontend engineering</li> <li>Excellent knowledge of JavaScript, TypeScript, HTML5, and CSS3</li> <li>Experience in Vue and/or React with a willingness to learn</li> <li>Good understanding of code versioning with Git</li> <li>Very good knowledge of web security best practices and experience in ensuring compliance with industry regulations</li> <li>Strong communication skills to effectively interact with both technical and non-technical team members with diverse backgrounds</li> <li>Strong attention to detail with excellent analytical and problem-solving skills and a proactive approach to troubleshooting and bug-fixing</li> <li>Positive, hard-working, and committed team player</li> <li>Self-motivated and able to work independently</li> <li>Fast learner who enjoys coding and working with the latest tech</li> <li>Able, willing and excited to work in a fast-paced, collaborative startup environment</li> </ul><p><strong>Why You'll Love Working Here</strong></p><ul> <li>Fully Remote</li> <li>Flexible Leave</li> <li>International Environment</li> <li>Competitive renumeration package</li> <li>Performance Bonus</li> <li>Stock Options after 6 months </li> <li>Company activities and events</li> <li>Learning and development plan</li> </ul><p><strong>CoverGo Company</strong><a href=\"https://www.youtube.com/watch?v=YI0ezLxvFvA\" rel=\"nofollow noreferrer noopener\" class=\"external\"><strong> Video</strong></a></p><p>By submitting your application, you confirm that you have read, understood, and accepted the content of CoverGo’s <a href=\"https://apply.workable.com/covergo/gdpr_policy?lng=en\" target=\"_blank\" rel=\"nofollow noreferrer noopener\" class=\"external\">Privacy Notice</a> and you consent to the processing of your data as part of this application.</p><p><a href=\"https://www.youtube.com/watch?v=YI0ezLxvFvA\" rel=\"nofollow noreferrer noopener\" class=\"external\"></a></p><h3>Requirements: </h3><h3>Benefits: </h3>","tags":"[\"javascript\",\"typescript\",\"engineering\"]","pubDate":"2024-02-06 00:00:00.000","link":"https://apply.workable.com/covergo/j/A2578E71D3","savedDate":"2024-02-10 02:57:34.167","slug":"senior-front-end-engineer-fully-remote-covergo-7974"},{"id":6115967209,"title":"Senior Software Quality Engineer","company":"Truepiccareers","image":"https://remotive.com/job/1894897/logo","description":"<p>We’re looking for a Senior Software Quality Engineer to help us grow and expand our enterprise software product, Truepic Vision, and the potential of its core technology, Truepic Lens.  This role will be primarily focused on 1) contributing to an automated test framework to validate the security, quality, reliability, and performance of core components, 2) manually testing Web, API, and Mobile components with a critical and creative eye to ensure the absolute best user experience, and 3) continuing to raise the bar by integrating the latest in software quality industry concepts, technologies, and processes. The Truepic Vision and Truepic Lens products are leveraged by a growing and diverse array of enterprise clients and this role will have a high impact on our company top and bottom line from day one!</p>\n<p>R<span style='\"text-decoration:'><strong>esponsibilities</strong></span>: </p>\n<ul style=\"\">\n<li style=\"\">Develop, implement and evolve test automation suites, tools, and services to ensure that every software release is consistently deployed with confidence</li>\n<li style=\"\">Contribute to manual integration testing of core Web and Mobile components with a critical and creative eye to ensure the absolute best user experience</li>\n<li style=\"\">Identify key quality metrics and communicate the results to a cross-functional team</li>\n<li style=\"\">Work towards debugging customer support questions to help identify gaps in existing test suites</li>\n<li style=\"\">Document internal test cases</li>\n<li style=\"\">Troubleshoot customer issues to drive towards root cause identification and resolution</li>\n<li style=\"\">Approve new software releases for deployment to the Production environment</li>\n<li style=\"\">Partner closely with our Engineering Team, helping us consistently raise the bar by implementing the latest in modern QA practices</li>\n</ul>\n<p><span style='\"text-decoration:'><strong>Qualifications</strong></span>:</p>\n<ul style=\"\">\n<li style=\"\">5+ years experience in SaaS web and mobile quality engineering</li>\n<li style=\"\">Mobile (Android and iOS), API, and SaaS Web Application testing experience</li>\n<li style=\"\">An understanding of security, quality, reliability, and performance best practices in the testing of modern Mobile and SaaS software platforms</li>\n<li style=\"\">Contributed to and built:</li>\n<ul style=\"\">\n<li style=\"\">an API-focused automated test suite</li>\n<li style=\"\">a Cypress-based automated web UI test suite</li>\n<li style=\"\">an automated mobile UI test suite</li>\n</ul>\n<li style=\"\">Experience writing effective test plans for brand new features and functionality</li>\n<li style=\"\">The ability to write clear and concise software defects with reproducible scenarios that are easy to understand and perform</li>\n<li style=\"\">Bonus points if you also have:</li>\n<ul style=\"\">\n<li style=\"\">Software development and engineering background</li>\n<li style=\"\">Experience with Python or comparable script-based languages</li>\n<li style=\"\">Experience within Basecamp’s Shape Up SDLC</li>\n</ul>\n</ul>\n<p><span style='\"text-decoration:'><strong>Who we are</strong></span>:</p>\n<p>Truepic is a Series B startup backed by Microsoft, Adobe, Sony and Hearst.  Our team is fully distributed which means we place a heavy focus on outcomes and value trust, transparency, and autonomy in the way we operate. Truepic provides two critical services for maintaining order and authenticity in the era of AI:  securing and verifying images at the point of capture with our <a href=\"%22https://truepic.com/truepic-vision/%22\" rel=\"nofollow\">Vision</a> and <a href=\"%22https://truepic.com/truepic-lens/%22\" rel=\"nofollow\">Lens</a> products, and creating transparency across the internet through the <a href=\"%22https://truepic.com/truepic-sign/%22\" rel=\"nofollow\">Sign</a> and <a href=\"%22https://truepic.com/truepic-display/%22\" rel=\"nofollow\">Display</a> of digital content.</p>\n<p>Not only is our technology proprietary but we’re building a strong community at the forefront of the image authenticity movement.  As founding members of the Coalition for Content Provenance and Authenticity (C2PA), we’re working alongside companies like Intel, Microsoft and Adobe to develop a set of technical standards for certifying the source and history of media content.  Our controlled capture technology is the world’s first <a href=\"%22https://www.forbes.com/sites/emmawoollacott/2022/01/27/new-standard-aims-to-protect-against-deepfakes/?sh=7f7bcdd265ab%22\" rel=\"nofollow\">C2PA compliant camera</a> which sets a new standard for how we consume and accept images across the internet. We also created the <a href=\"%22https://truepic.com/revel/%22\" rel=\"nofollow\">world's first openly digital transparent Artificial Intelligence video</a> to highlight the need for transparency within all digital content, including the Generative AI space.</p>\n<p><span style='\"text-decoration:'><strong>Diversity and Equality</strong></span>:</p>\n<p>Truepic is an equal opportunity employer, meaning all applicants will be considered for employment without attention to race, color, religion, sex, sexual orientation, gender identity, national origin, veteran, or disability status.  We ensure that all individuals with disabilities are provided reasonable accommodation to participate in the job application and interview process, to perform essential job functions, and to receive other benefits and privileges of employment. Please contact us to request accommodation.</p><img src=\"https://remotive.com/job/track/1894897/blank.gif?source=public_api\" alt=\"\"/>","tags":"[\"manual testing\"]","pubDate":"2024-02-05 13:21:32.000","link":"https://remotive.com/remote-jobs/qa/senior-software-quality-engineer-1894897","savedDate":"2024-02-10 02:57:34.158","slug":"senior-software-quality-engineer-truepiccareers-5487"},{"id":1162335065,"title":"Security Analyst","company":"Scroll","image":"https://avatars.githubusercontent.com/u/87750292?s=200&v=4","description":"<div>*Scroll has a remote-first work culture, our staff base is globally distributed and we are location agnostic. We make hiring decisions based on talent, culture fit and role suitability. If you have the skills and experience requested by this job description then please APPLY!</div><div>At Scroll, we operate on the bleeding edge of a fast-moving frontier of zk technology, research and innovation. The security analyst will be responsible for helping monitor Scroll’s internal and external infrastructure for attacks, educate our staff and community on security best practices, implement security controls and manage our IT systems. The role is ideal for an individual who thrives in a start-up environment, a self-starter that is dynamic and comfortable to take on responsibilities and can work effectively within a remote setup.</div><div><br></div><div><b>About Scroll…</b></div><div>Scroll is building an open source, bytecode level compatible zkEVM layer 2 solution for Ethereum. Our mission is to scale Ethereum while maintaining our values of credible neutrality, openness, and community driven.</div><div><br></div><h3>Responsibilities</h3><li>Setup and manage threat monitoring workflows</li><li>Contribute to security incident response</li><li>Deploy security controls to mitigate cyber security risks</li><li>Help educate the Scroll staff and our community on security best practices</li><li>Assist in managing and troubleshooting IT</li>,<h3>Requirements</h3><li>Degree in Computer Science or broad knowledge of computer science and system security</li><li>Knowledge in scripting languages such as Python, JavaScript, Go</li><li>Experience automating workflows and SAAS integrations</li><li>Familiar with security tools such as anti-virus, firewalls, and IDS</li><li>Nice to Haves</li><li>Familiarity with security frameworks and standards such as ISO-27001 and MITRE ATT&amp;CK</li><li>Understanding of Rust or C++</li><li>Experience working in a security operations centre</li><li>Trained in data science with a practical understanding of machine learning or artificial intelligence and security implications</li>,<h3>About You</h3><li>You are a self-starter and ability to take ownership, well organised, self-disciplined and effective when working autonomously on tasks and projects;</li><li>You are responsive, collaborative and committed person with a high work ethic;</li><li>You are a high class communicator who can articulate their views succinctly on calls or asynchronously in globally distributed, remote teams;</li><li>You relish working in an agile start-up environment;</li><li>You are a great listener who understands when to listen first and engages well with colleagues;</li><li>You are a resilient, driven individual who is willing and able to continually develop and iterate to succeed;</li>,<h3>What We Offer</h3><li>A mission-led, collaborative culture</li><li>Opportunity to work with cutting edge technology and like-minded people who are contributing to the progression of Ethereum</li><li>Competitive salary package / generous paid time off / annual growth budget</li><li>Remote from any location with flexible hours</li><li>Home office set up / co-working membership allowance</li><li>Private healthcare in selected countries</li><div>Scroll is proud to be an equal opportunity workplace. We are committed to equal employment opportunities regardless of race, color, ancestry, religion, sex, national origin, sexual orientation, age, citizenship, marital status, disability, gender identity, or Veteran status. If you have a disability or special need, please let us know and we'll do our best to accommodate.</div>","tags":"[\"javascript\",\"cyber security\"]","pubDate":"2024-02-02 15:45:12.147","link":"https://jobs.lever.co/ScrollFoundation/f35651b3-21d2-45f0-972d-299e6c3514ed","savedDate":"2024-02-10 02:57:34.167","slug":"security-analyst-scroll-91"},{"id":3627979761,"title":"Communications Lead","company":"Crytek","image":"https://lever-client-logos.s3-us-west-2.amazonaws.com/2a61cdfd-29d3-4707-b965-c4527aa67d0c-1593500521772.png","description":"<div>We are looking for a highly motivated <b>Communications Lead </b>to join our Hunt: Showdown team. In this role, you lead a team of social media, community, and customer support specialists and actively drive the development and execution of communication strategies for the Hunt: Showdown brand. </div><h3>Responsibilities</h3><li>Development and execution of communication strategies, including social media,community management, influencer relationships, and PR.&nbsp;&nbsp;</li><li>Leading the social media, community, and support teams to plan and implement the strategy, keeping in mind the vision and the KPIs.&nbsp;</li><li>Strong collaboration with the marketing, publishing, and game development team.&nbsp;</li><li>Support of live events, such as industry events and trade shows.&nbsp;</li><li>Management of influencer and content creator programs.&nbsp;</li>,<h3>Requirements</h3><li>6+ years of professional experience in communications management within the video games industry.&nbsp;</li><li>Proven experience with published games, ideally live service games.&nbsp;</li><li>Experience with social media, games support, and customer interaction.&nbsp;</li><li>Experience with leadership and managing teams <b>OR</b> strong leadership ambitions.&nbsp;</li><li>A passion for gaming including a good understanding of the gaming industry and current trends.&nbsp;</li><li>Excellent written and verbal English communication skills.</li><div><b style=\"font-size: 2.2rem\">What you can expect from us</b></div><div><br></div><div><b>Home Office&nbsp;</b></div><div>Work-life balance is not just a hollow term for us. At Crytek, we offer you the option to either work from home or in our studio.&nbsp;</div><div>&nbsp;</div><div><b>Career Path&nbsp;</b></div><div>Your professional development is important to us, so we have laid out a career plan to help you progress towards your goals and objectives.&nbsp;</div><div>&nbsp;</div><div><b>Company Apartment&nbsp;</b></div><div>To help you get settled, we provide you with a fully furnished company apartment during your first three months in Frankfurt.*&nbsp;</div><div><span style=\"font-size: 11pt\">&nbsp;</span></div><div><b>Relocation&nbsp;Support&nbsp;</b></div><div>We offer a relocation budget and full coverage of flights to Frankfurt for you and your family.&nbsp;</div><div>You can expect extensive assistance with visa, work permits, and communication with authorities during the relocation process, as well as help settling into Germany (e.g. setting up appointments with banks, government agencies, schools, landlords, finding apartments etc.).*&nbsp;</div><div><b style=\"font-size: 11pt\">&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;</b></div><div><b>Public Transport Pass&nbsp;</b></div><div>Discover Frankfurt by bus, tram and metro – free of charge.*&nbsp;</div><div><span style=\"font-size: 11pt\">&nbsp;</span></div><div><b>Gym Card&nbsp;</b></div><div>A healthy body is a healthy mind. We offer a membership at the premium gym chain Fitness First in Germany. Work out, join group fitness classes, or relax in the wellness facilities.</div><div><span style=\"font-size: 11pt\">&nbsp;</span></div><div><b>International Environment&nbsp;</b></div><div>We truly embody diversity at Crytek. With employees from over 42 different countries, we define ourselves by our cultural diversity.&nbsp;</div><div>&nbsp;</div><div><b>German Classes&nbsp;</b></div><div>Understanding the local culture will make your stay abroad more enjoyable, and Crytek supports that by offering German language courses for you and your family.&nbsp;</div><div><span style=\"font-size: 11pt\">&nbsp;&nbsp;</span></div><div><b>Events</b></div><div>Join us on our exciting company events, including new starter breakfasts, summer and winter parties, our annual trip to Gamescom in Cologne, and many more!*&nbsp;</div><div>We are all gamers: stay connected and play games with your colleagues at our remote gaming parties.</div><div><span style=\"font-size: 11pt\">&nbsp; &nbsp;</span></div><div><b>Vacation Days&nbsp;</b></div><div>At our Frankfurt office you can enjoy 24 days of vacation per year, and every 2 years you get 1 more (up to a maximum of 28 days). You will also have on average 10 public holidays on top of the days you take off. If you are working from another country, local standards apply.</div><div><span style=\"font-size: 11pt\">&nbsp;&nbsp;</span></div><div>*only applicable to employees in Frankfurt.</div>","tags":"[\"management\"]","pubDate":"2024-02-02 09:34:54.218","link":"https://jobs.lever.co/crytek/a6013fe8-f41a-4016-ae6c-adee41f35faa","savedDate":"2024-02-10 02:57:34.168","slug":"communications-lead-crytek-3095"}]