[{"id":3126177731,"title":"Operations Manager (Remote)","company":"Empower","image":"https://lever-client-logos.s3.us-west-2.amazonaws.com/2e1a369c-b58f-41ac-8d86-4b0a77695e68-1687915522032.png","description":"<div><b style=\"font-size: 24px\">EMPOWER OVERVIEW</b></div><div><br></div><div><a href=\"http://empower.me/\" class=\"postings-link\">Empower</a>&nbsp;is a high-growth financial technology company on a mission to expand access to fair credit to give anyone in the world the opportunity to improve their financial security and mobility. We dream up and launch one-of-a-kind features that help our members get money instantly whenever they need it, save for the future, and rewrite their financial story. Our members see Empower Cash Advance as a life-saver and the new Empower Thrive line of credit (currently in beta, launching soon) as a lifeline to low-cost borrowing and the only practical path to building good credit.</div><div><br></div><div>Empower is backed by Sequoia Capital, Blisce, and Icon Ventures. Are we the next great place to grow your impact and accelerate your career? We think so:</div><div><br></div><div>Inc. ranked Empower #56 in the 2023 Inc. 5000 list of the fastest-growing private companies in the US (#55 in 2022). Forbes put Empower on its 2023 list of America's Best Startup Employers. Fast Company recognized the new Empower Thrive line of credit in their 2022 list of the Next Big Things in Tech. </div><div><br></div><div><b style=\"font-size: 18px\">THE EMPOWER WAY</b></div><div><b>Great Expectations</b>: We come up with bold, audacious goals for ourselves and go all out for impact</div><div><b>Owner Mindset</b>: We give every employee latitude to act independently, make smart choices, and move the business forward</div><div><b>Spirited Debate</b>: We love skeptics and seek counter opinions to challenge our personal assumptions and expand our view</div><div><b>Customer Obsession: </b>We listen to understand, empathize, and create a memorable, rewarding experience for our community</div><div><b>Inclusive Collaboration</b>: We believe diverse teams make the best decisions, and we strive to give diverse voices a seat at the table</div><div>N<b>o Jerks Allowed</b>: We value our relationships and take the time to build trust and connection and communicate respectfully</div><div><span style=\"font-size: 12pt\">&nbsp;</span></div><div><br></div><div><b style=\"font-size: 18px\">WHAT EMPOWER OFFERS</b></div><div><br></div><div>Competitive salary</div><div>Generous equity package</div><div>Full healthcare and dental benefits</div><div>Technology expense reimbursement</div><div>Work from anywhere</div><div><span style=\"font-size: 12pt\">&nbsp;</span></div><div><br></div><div>&nbsp;</div><div><b style=\"font-size: 18px\">JOB DESCRIPTION</b></div><div><span style=\"font-size: 11pt\">In this role, you will help run Empower’s back office operations across all products and services. You will manage a small team of dedicated operations specialists responsible for completing fraud investigations, responding to disputed transactions, KYC reviews and other internal procedures. </span></div><div><br></div><div><span style=\"font-size: 10.5pt\">Empower is a remote-first company. We drive connectivity through regular company offsites. Travel for company offsites is expected at a minimum 2 times a year.</span></div><div>This salary range includes several career levels at Empower and will be discussed further during the interview process. The salary range is based on a variety of factors such as candidate experience, qualifications, and business needs. The base pay range is subject to change and may be modified in the future. </div><h3>Key Responsibilities </h3><li>Prepares performance reports by collecting and analyzing available data</li><li>Evaluates individual performance reviews and overall team effectiveness with upper management</li><li>Helps agents with challenging/escalated customer service issues</li><li>Monitors team performance and provide tools if necessary</li><li>Determines operational strategies by evaluating team results and objectives</li><li>Maintains and improves operations by monitoring system performance and identifying and resolving problems</li><li>Identifies opportunities for automation and works directly with with product and engineering teams</li><li>Periodically forecasts volume and anticipates staffing needs of the team</li><li>Directly manages team of 5 and provides coaching</li><li>Helps with recruiting and training new team members</li>,<h3>Candidate Qualifications</h3><li>BA/BS degree or 5+ years equivalent experience in banking operations</li><li>Motivated by Empower’s mission and determined to create a personable and meaningful experience for our customers</li><li>Direct experience with BSA/AML programs particularly within credit cards</li><li>Direct experience with KYC programs</li><li>Familiarity with banking regulations and payment processes (e.g.s Reg E, Reg Z, Reg B, UDAAP, FCRA)</li><li>Specific experience with a comparable FinTech is a plus</li><li>Demonstrated passion for the customer experience and the ability to solve problems with a short turnaround time for customers with a high level of empathy</li><li>Proven leadership skills with project management, planning, presenting, and communication skills</li><li>Ability to adapt rapidly to changing work environments, work priorities, and organizational needs</li><li>Excellent verbal and written communication skills with the ability to explain complex topics in easily understood, concise language</li><div>At Empower, we hire for people that push themselves to understand others and seek out ways to challenge their personal assumptions. Our hope is that by fostering such an environment, we strengthen our business and relationships by putting people first. We are committed to building a diverse, inclusive, and equitable workspace where everyone (regardless of age, education, ethnicity, gender, sexual orientation, or any personal characteristics) feels like they belong. Even if your experience doesn’t exactly match up to our job description, you should feel empowered to apply regardless!&nbsp;</div>","tags":"[\"management\",\"engineering\"]","pubDate":"2024-01-23 00:42:49.019","link":"https://jobs.lever.co/empower.me/fcf3806b-1a49-4155-9fe5-61b81ee4f819","savedDate":"2024-01-31 09:38:50.499","slug":"operations-manager-remote-empower-6598"},{"id":4079643796,"title":"Senior Recruiter (Remote)","company":"Empower","image":"https://lever-client-logos.s3.us-west-2.amazonaws.com/2e1a369c-b58f-41ac-8d86-4b0a77695e68-1687915522032.png","description":"<div><b style=\"font-size: 24px\">EMPOWER OVERVIEW</b></div><div><br></div><div><a href=\"http://empower.me/\" class=\"postings-link\">Empower</a>&nbsp;is a high-growth financial technology company on a mission to expand access to fair credit to give anyone in the world the opportunity to improve their financial security and mobility. We dream up and launch one-of-a-kind features that help our members get money instantly whenever they need it, save for the future, and rewrite their financial story. Our members see Empower Cash Advance as a life-saver, Empower Automatic Savings as a game-changer, and the new Empower Thrive line of credit (currently in beta, launching soon) as a lifeline to low-cost borrowing and the only practical path to building good credit.</div><div><br></div><div>Empower is backed by Sequoia Capital, Blisce, and Icon Ventures. Are we the next great place to grow your impact and accelerate your career? We think so:</div><div><br></div><div>Inc. ranked Empower #56 in the 2023 Inc. 5000 list of the fastest-growing private companies in the US (#55 in 2022). Forbes put Empower on its 2023 list of America's Best Startup Employers. Fast Company recognized the new Empower Thrive line of credit in their 2022 list of the Next Big Things in Tech. </div><div><br></div><div><b style=\"font-size: 18px\">THE EMPOWER WAY</b></div><div><b>Great Expectations</b>: We come up with bold, audacious goals for ourselves and go all out for impact</div><div><b>Owner Mindset</b>: We give every employee latitude to act independently, make smart choices, and move the business forward</div><div><b>Spirited Debate</b>: We love skeptics and seek counter opinions to challenge our personal assumptions and expand our view</div><div><b>Customer Obsession: </b>We listen to understand, empathize, and create a memorable, rewarding experience for our community</div><div><b>Inclusive Collaboration</b>: We believe diverse teams make the best decisions, and we strive to give diverse voices a seat at the table</div><div>N<b>o Jerks Allowed</b>: We value our relationships and take the time to build trust and connection and communicate respectfully</div><div><b>&nbsp;</b></div><div><b>&nbsp;</b></div><div><b style=\"font-size: 18px\">WHAT EMPOWER OFFERS</b></div><div>Competitive salary</div><div>Generous equity package</div><div>Full healthcare and dental benefits</div><div>Technology&nbsp; expense reimbursement</div><div>Work&nbsp; from anywhere</div><div><br></div><div><b style=\"font-size: 18px\">JOB DESCRIPTION</b></div><div><br></div><div>As a Senior Recruiter, your contributions will be instrumental in shaping our team and culture. You'll collaborate closely with our leadership team, hiring managers, and cross-functional units to drive the end-to-end recruitment process and deliver an exceptional candidate experience. Your key responsibilities will encompass:</div><div><br></div><div><b>Strategic Ownership:</b> Lead end-to-end recruitment lifecycle - from initiating new searches, crafting compelling job descriptions, designing comprehensive evaluation strategies, to sourcing and closing top-tier candidates.</div><div><b>Seamless Recruitment Process:</b> Create and manage a streamlined recruitment process that caters to diverse hiring needs across various teams, engineering units, and business functions.</div><div><b>Innovative Sourcing:</b> Employ inventive sourcing strategies to identify both passive and active candidates using channels like online job boards, social media, networking events, and industry symposiums.</div><div><b>Mentorship and Leadership:</b> Provide guidance and mentorship on recruitment best practices, acting as an indirect leader within the team.</div><div><b>Diversity Champion:</b> Execute unique sourcing approaches that cultivate diverse candidate pools, reflecting our commitment to inclusion.</div><div><b>Interview Coordination:</b> Manage the scheduling and orchestration of technical and non-technical interviews, facilitating constructive feedback loops between interviewers and candidates.</div><div><b>Negotiation and Collaboration:</b> Collaborate with leaders to craft competitive job offers and compensation packages that attract top talent.</div><div><b>Talent Pipeline Management:</b> Cultivate and nurture a robust pipeline of potential candidates for present and future hiring needs.</div><div><b>Industry Insight:</b> Stay informed about the latest trends and best practices in technical recruitment, integrating insights to enhance our hiring process.</div><div><b>Data-Driven Approach:</b> Develop recruiting dashboards that monitor key metrics, enabling data-backed decisions and actionable refinements.</div><div><b>Process Enhancement:</b> Continuously refine and augment recruitment processes to ensure efficiency and efficacy.</div><div><br></div><div>Empower is a remote-first company. We drive connectivity through regular company offsites. Travel for company offsites is expected at a minimum 2 times a year.</div><div>This salary range includes several career levels at Empower and will be discussed further during the interview process. The salary range is based on a variety of factors such as candidate experience, qualifications, and business needs. The base pay range is subject to change and may be modified in the future. </div><h3>Candidate Qualifications</h3><li>5+ years of full cycle recruiting experience for an innovative and scaling organization (startup experience preferred) </li><li>Ability to build rapport and establish trust with individuals in a highly competitive market </li><li>Ability to navigate ambiguity and solve complex problems while collaborating with business partners to achieve a common goal </li><li>Ability to thrive in a data and metrics driven environment </li><li>Consultative communication skills while working with internal and external stakeholders at all levels of an organization </li><li>A positive and team-oriented approach to your work</li><li>Proficiency in leveraging an ATS</li>","tags":"[\"management\",\"engineering\"]","pubDate":"2024-01-22 20:10:24.860","link":"https://jobs.lever.co/empower.me/35102a73-3173-456b-8725-2e918430a7e1","savedDate":"2024-01-31 09:38:50.501","slug":"senior-recruiter-remote-empower-9029"},{"id":7391814479,"title":"Head of Customer Operations (Remote)","company":"Empower","image":"https://lever-client-logos.s3.us-west-2.amazonaws.com/2e1a369c-b58f-41ac-8d86-4b0a77695e68-1687915522032.png","description":"<div><b style=\"font-size: 24px\">EMPOWER OVERVIEW</b></div><div><br></div><div><a href=\"http://empower.me/\" class=\"postings-link\">Empower</a>&nbsp;is a high-growth financial technology company on a mission to expand access to fair credit to give anyone in the world the opportunity to improve their financial security and mobility. We dream up and launch one-of-a-kind features that help our members get money instantly whenever they need it, save for the future, and rewrite their financial story. Our members see Empower Cash Advance as a life-saver and the new Empower Thrive line of credit (currently in beta, launching soon) as a lifeline to low-cost borrowing and the only practical path to building good credit.</div><div><br></div><div>Empower is backed by Sequoia Capital, Blisce, and Icon Ventures. Are we the next great place to grow your impact and accelerate your career? We think so:</div><div><br></div><div>Inc. ranked Empower #56 in the 2023 Inc. 5000 list of the fastest-growing private companies in the US (#55 in 2022). Forbes put Empower on its 2023 list of America's Best Startup Employers. Fast Company recognized the new Empower Thrive line of credit in their 2022 list of the Next Big Things in Tech. </div><div><br></div><div><b style=\"font-size: 18px\">THE EMPOWER WAY</b></div><div><b>Great Expectations</b>: We come up with bold, audacious goals for ourselves and go all out for impact</div><div><b>Owner Mindset</b>: We give every employee latitude to act independently, make smart choices, and move the business forward</div><div><b>Spirited Debate</b>: We love skeptics and seek counter opinions to challenge our personal assumptions and expand our view</div><div><b>Customer Obsession: </b>We listen to understand, empathize, and create a memorable, rewarding experience for our community</div><div><b>Inclusive Collaboration</b>: We believe diverse teams make the best decisions, and we strive to give diverse voices a seat at the table</div><div>N<b>o Jerks Allowed</b>: We value our relationships and take the time to build trust and connection and communicate respectfully</div><div><span style=\"font-size: 12pt\">&nbsp;</span></div><div><br></div><div><b style=\"font-size: 18px\">WHAT EMPOWER OFFERS</b></div><div><br></div><div>Competitive salary</div><div>Generous equity package</div><div>Full healthcare and dental benefits</div><div>Technology expense reimbursement</div><div>Work from anywhere</div><div><br></div><div>As Head of Customer Operations, you will report fo the CFO and be responsible for both front and back of house operations, </div><div><br></div><div><span style=\"font-size: 10.5pt\">Empower is a remote-first company. We drive connectivity through regular company offsites. Travel for company offsites is expected at a minimum 2 times a year.</span></div><div>For US based employee's, this salary range includes several career levels of consideration and will be discussed further during the interview process. The salary range is based on a variety of factors such as candidate experience, qualifications, and business needs. The base pay range is subject to change and may be modified in the future. </div><h3>Key Responsibilities </h3><li>Lead, manage, and develop both front and back of house customer operations teams.</li><li>Foster a culture of excellence, collaboration, and continuous improvement across all operational areas.</li><li>Develop and implement comprehensive strategies for customer service operations aligned with company objectives.</li><li>Ensure effective integration of front and back office functions to provide a seamless customer experience.</li><li>Oversee outsourced support operations, ensuring vendors meet contractual obligations and service level agreements.</li><li>Regularly evaluate outsourcing arrangements and make recommendations for improvements or changes as needed.</li><li>Monitor and enhance customer satisfaction metrics and implement strategies to improve customer experience.</li><li>Ensure quality control standards are met in all customer interactions and operational processes.</li><li>Continuously review and improve operational processes for greater efficiency and effectiveness.</li><li>Leverage technology and innovation to streamline operations and enhance customer service.</li><li>Ensure all customer operations comply with relevant regulations and internal policies.</li><li>Identify and mitigate operational risks, particularly those related to customer data and privacy.</li><li>Work closely with internal teams, including product, credit, and engineering, to enhance customer operations.</li><li>Represent the customer operations department in executive meetings and provide regular reports to the CFO and other stakeholders.</li><div><br></div>,<h3>Candidate Qualifications</h3><li>Bachelor’s degree</li><li>Minimum of 8 years of experience in operational leadership roles, preferably in a credit or FinTech environment.</li><li>Proven track record of managing both front and back of house operations.</li><li>Experience in managing outsourced support operations.</li><li>Strong leadership and team management skills.</li><li>Excellent communication, negotiation, and interpersonal skills.</li><li>Proficient in data analysis and performance metrics.</li><li>Knowledge of financial regulations and compliance standards relevant to the banking industry.</li><div><br></div><div>At Empower, we hire for people that push themselves to understand others and seek out ways to challenge their personal assumptions. Our hope is that by fostering such an environment, we strengthen our business and relationships by putting people first. We are committed to building a diverse, inclusive, and equitable workspace where everyone (regardless of age, education, ethnicity, gender, sexual orientation, or any personal characteristics) feels like they belong. Even if your experience doesn’t exactly match up to our job description, you should feel empowered to apply regardless!&nbsp;</div>","tags":"[\"management\",\"engineering\"]","pubDate":"2024-01-22 19:30:24.601","link":"https://jobs.lever.co/empower.me/5f3b32cd-b0d9-40eb-85a6-057ac44f5f09","savedDate":"2024-01-31 09:38:50.499","slug":"head-of-customer-operations-remote-empower-8057"},{"id":2942286752,"title":"Product Manager (Remote)","company":"Empower","image":"https://lever-client-logos.s3.us-west-2.amazonaws.com/2e1a369c-b58f-41ac-8d86-4b0a77695e68-1687915522032.png","description":"<div><b style=\"font-size: 24px\">EMPOWER OVERVIEW</b></div><div><br></div><div><a href=\"http://empower.me/\" class=\"postings-link\">Empower</a>&nbsp;is a high-growth financial technology company on a mission to expand access to fair credit to give anyone in the world the opportunity to improve their financial security and mobility. We dream up and launch one-of-a-kind features that help our members get money instantly whenever they need it, save for the future, and rewrite their financial story. Our members see Empower Cash Advance as a life-saver and the new Empower Thrive line of credit (currently in beta, launching soon) as a lifeline to low-cost borrowing and the only practical path to building good credit.</div><div><br></div><div>Empower is backed by Sequoia Capital, Blisce, and Icon Ventures. Are we the next great place to grow your impact and accelerate your career? We think so:</div><div><br></div><div>Inc. ranked Empower #56 in the 2023 Inc. 5000 list of the fastest-growing private companies in the US (#55 in 2022). Forbes put Empower on its 2023 list of America's Best Startup Employers. Fast Company recognized the new Empower Thrive line of credit in their 2022 list of the Next Big Things in Tech. </div><div><br></div><div><b style=\"font-size: 18px\">THE EMPOWER WAY</b></div><div><b>Great Expectations</b>: We come up with bold, audacious goals for ourselves and go all out for impact</div><div><b>Owner Mindset</b>: We give every employee latitude to act independently, make smart choices, and move the business forward</div><div><b>Spirited Debate</b>: We love skeptics and seek counter opinions to challenge our personal assumptions and expand our view</div><div><b>Customer Obsession: </b>We listen to understand, empathize, and create a memorable, rewarding experience for our community</div><div><b>Inclusive Collaboration</b>: We believe diverse teams make the best decisions, and we strive to give diverse voices a seat at the table</div><div>N<b>o Jerks Allowed</b>: We value our relationships and take the time to build trust and connection and communicate respectfully</div><div><span style=\"font-size: 12pt\">&nbsp;</span></div><div><br></div><div><b style=\"font-size: 18px\">WHAT EMPOWER OFFERS</b></div><div><br></div><div>Competitive salary</div><div>Generous equity package</div><div>Full healthcare and dental benefits</div><div>Technology expense reimbursement</div><div>Work from anywhere</div><div><span style=\"font-size: 12pt\">&nbsp;</span></div><div><br></div><div>&nbsp;</div><div><b style=\"font-size: 18px\">JOB DESCRIPTION</b></div><div>We’re looking for extraordinary people to help lead product development as Empower continues to scale. Our product leaders are customer-centric, collaborate intensely with other key disciplines, and make decisions with an eye towards Empower’s business. Successful product managers are ambitious and resourceful -- willing to do whatever it takes to deliver value to our customers.</div><div>More specifically, members of the product team drive the strategy, tactics, and delivery timelines for all Empower features and products. They identify opportunities and develop perspectives on the most impactful things we should be building for our customers, and then they go do the work required to build those experiences by getting cross-functional support, designing specs, overseeing development and measuring outcomes. Empower product managers are experts in cross-functional partnership, constantly engaging colleagues in Operations, Marketing, Finance, Compliance, Support, and other Product areas in order to deliver on their goals and maximize impact. If you’re looking for a role where you can have massive impact and a wide scope, you’ll find this role compelling, challenging, and rewarding.</div><div><br></div><div><span style=\"font-size: 10.5pt\">Empower is a remote-first company. We drive connectivity through regular company offsites. Travel for company offsites is expected at a minimum 2 times a year.</span></div><div>For US based employee's, this salary range includes several career levels of consideration and will be discussed further during the interview process. The salary range is based on a variety of factors such as candidate experience, qualifications, and business needs. The base pay range is subject to change and may be modified in the future. </div><h3>Qualifications</h3><li>We are looking for product  managers and product leaders with varying levels of experience (minimum of 3+ years work experience in product management or management consulting/investment banking)</li><li>Bachelor’s degree (or greater) in an analytical or technical discipline (e.g., Engineering, Computer Science, Economics)</li><li>Strong analytical abilities and are comfortable defining and measuring goals consistently</li><li>Strong customer empathy and experience shaping product direction and execution based on customer needs</li><li>A get-it-done mindset; you’re resourceful and happy to be hands on and in the weeds</li><li>A interest in addressing  complicated and impactful product &amp; business problems</li><li>Experience delivering complex, cross-functional product initiatives&nbsp;</li><li>Strong strategic thinking, problem solving, and logical structuring abilities</li><li>Comfort with ambiguity; the ability to independently lay out and test clear hypotheses, and solve      problems without well-defined direction</li><li>Excellent verbal and written communication skills</li><div>At Empower, we hire for people that push themselves to understand others and seek out ways to challenge their personal assumptions. Our hope is that by fostering such an environment, we strengthen our business and relationships by putting people first. We are committed to building a diverse, inclusive, and equitable workspace where everyone (regardless of age, education, ethnicity, gender, sexual orientation, or any personal characteristics) feels like they belong. Even if your experience doesn’t exactly match up to our job description, you should feel empowered to apply regardless!&nbsp;</div>","tags":"[\"Finance\",\"management\",\"engineering\"]","pubDate":"2024-01-12 00:59:34.257","link":"https://jobs.lever.co/empower.me/68872be8-ae71-4b68-a606-84cd03d47ad6","savedDate":"2024-01-31 09:38:50.500","slug":"product-manager-remote-empower-4392"},{"id":8739548429,"title":"Sr. QA Engineer (Remote)","company":"Empower","image":"https://lever-client-logos.s3.us-west-2.amazonaws.com/2e1a369c-b58f-41ac-8d86-4b0a77695e68-1687915522032.png","description":"<div><b style=\"font-size: 24px\">EMPOWER OVERVIEW</b></div><div><br></div><div><a href=\"http://empower.me/\" class=\"postings-link\">Empower</a>&nbsp;is a high-growth financial technology company on a mission to expand access to fair credit to give anyone in the world the opportunity to improve their financial security and mobility. We dream up and launch one-of-a-kind features that help our members get money instantly whenever they need it, save for the future, and rewrite their financial story. Our members see Empower Cash Advance as a life-saver, Empower Automatic Savings as a game-changer, and the new Empower Thrive line of credit (currently in beta, launching soon) as a lifeline to low-cost borrowing and the only practical path to building good credit.</div><div><br></div><div>Empower is backed by Sequoia Capital, Blisce, and Icon Ventures. Are we the next great place to grow your impact and accelerate your career? We think so:</div><div><br></div><div>Inc. ranked Empower #56 in the 2023 Inc. 5000 list of the fastest-growing private companies in the US (#55 in 2022). Forbes put Empower on its 2023 list of America's Best Startup Employers. Fast Company recognized the new Empower Thrive line of credit in their 2022 list of the Next Big Things in Tech. </div><div><br></div><div><b style=\"font-size: 18px\">THE EMPOWER WAY</b></div><div><b>Great Expectations</b>: We come up with bold, audacious goals for ourselves and go all out for impact</div><div><b>Owner Mindset</b>: We give every employee latitude to act independently, make smart choices, and move the business forward</div><div><b>Spirited Debate</b>: We love skeptics and seek counter opinions to challenge our personal assumptions and expand our view</div><div><b>Customer Obsession: </b>We listen to understand, empathize, and create a memorable, rewarding experience for our community</div><div><b>Inclusive Collaboration</b>: We believe diverse teams make the best decisions, and we strive to give diverse voices a seat at the table</div><div>N<b>o Jerks Allowed</b>: We value our relationships and take the time to build trust and connection and communicate respectfully</div><div><b>&nbsp;</b></div><div><b>&nbsp;</b></div><div><b style=\"font-size: 18px\">WHAT EMPOWER OFFERS</b></div><div>Competitive salary</div><div>Generous equity package</div><div>Full healthcare and dental benefits</div><div>Technology&nbsp; expense reimbursement</div><div>Work&nbsp; from anywhere</div><div><br></div><div><b style=\"font-size: 18px\">JOB DESCRIPTION</b></div><div><span style=\"font-size: 10.5pt\">As a Quality Assurance Engineer, you’ll work to ensure only our best work makes it to our customers. You’ll engage with a collaborative, high powered team to develop and execute test plans and automation suites for projects with a reach of millions. The solutions you’ll test will ensure robustness, and integrity for our customers and business. The automation you'll create will enhance our agility as we continue to scale. You’ll take end to end ownership of new features and product lines shaping work in early stages, instrumenting our ability to test, coordinating with stakeholders for deployment to ensure we’re hitting our goals.</span></div><div><br></div><div>Travel for company offsites is expected at a minimum 2 times a year. </div><h3>Key Responsibilities</h3><li>Be the Quality Advocate to ensure delivery of the products as per Empower quality standards</li><li>Contribute to quality product specification by reviewing and identifying requirement gaps</li><li>Identify, Define, Setup test data and Execute complex test scenarios to validate the product specifications</li><li>Execute, Maintain and Develop test automation scripts to validate REST API and Mobile Applications</li><li>Propose process &amp; performance improvements in Manual and Automated Testing</li><li>Take ownership of quality feature delivery liaising with Product Owners, Developers and QA Engineers</li><li><br></li>,<h3>Candidate Qualifications</h3><li>6+ years of expertise in Mobile and/or REST API manual testing</li><li>5+ years of expertise in REST API automation in Python/JavaScript etc</li><li>Intermediate or greater programming level in one or more of: Python, Bash scripting</li><li>Knowledge of CI/CD, DevOps in cloud platforms like Azure/AWS is preferable</li><li>Knowledge of API Performance and Load Testing is a plus.</li><li>Experience working within an Agile Continuous Delivery team</li><div>At Empower, we hire for people that push themselves to understand others and seek out ways to challenge their personal assumptions. Our hope is that by fostering such an environment, we strengthen our business and relationships by putting people first. We are committed to building a diverse, inclusive, and equitable workspace where everyone (regardless of age, education, ethnicity, gender, sexual orientation, or any personal characteristics) feels like they belong. Even if your experience doesn’t exactly match up to our job description, you should feel empowered to apply regardless!&nbsp;</div>","tags":"[\"javascript\",\"aws\"]","pubDate":"2024-01-11 00:16:06.540","link":"https://jobs.lever.co/empower.me/74bc1ac3-50da-4fd3-8016-a51e2b9457d6","savedDate":"2024-01-31 09:38:50.502","slug":"sr-qa-engineer-remote-empower-6643"},{"id":4908772452,"title":"Customer Support Operations Analyst (Remote)","company":"Empower","image":"https://lever-client-logos.s3.us-west-2.amazonaws.com/2e1a369c-b58f-41ac-8d86-4b0a77695e68-1687915522032.png","description":"<div><b style=\"font-size: 24px\">EMPOWER OVERVIEW</b></div><div><br></div><div><a href=\"http://empower.me/\">Empower</a>&nbsp;is a high-growth financial technology company on a mission to expand access to fair credit to give anyone in the world the opportunity to improve their financial security and mobility. We dream up and launch one-of-a-kind features that help our members get money instantly whenever they need it, save for the future, and rewrite their financial story. Our members see Empower Cash Advance as a life-saver, Empower Automatic Savings as a game-changer, and the new Empower Thrive line of credit (currently in beta, launching soon) as a lifeline to low-cost borrowing and the only practical path to building good credit.</div><div><br></div><div>Empower is backed by Sequoia Capital, Blisce, and Icon Ventures. Are we the next great place to grow your impact and accelerate your career? We think so:</div><div><br></div><div>Inc. ranked Empower #56 in the 2023 Inc. 5000 list of the fastest-growing private companies in the US (#55 in 2022). Forbes put Empower on its 2023 list of America's Best Startup Employers. Fast Company recognized the new Empower Thrive line of credit in their 2022 list of the Next Big Things in Tech. </div><div><br></div><div><b style=\"font-size: 18px\">THE EMPOWER WAY</b></div><div><b>Great Expectations</b>: We come up with bold, audacious goals for ourselves and go all out for impact</div><div><b>Owner Mindset</b>: We give every employee latitude to act independently, make smart choices, and move the business forward</div><div><b>Spirited Debate</b>: We love skeptics and seek counter opinions to challenge our personal assumptions and expand our view</div><div><b>Customer Obsession: </b>We listen to understand, empathize, and create a memorable, rewarding experience for our community</div><div><b>Inclusive Collaboration</b>: We believe diverse teams make the best decisions, and we strive to give diverse voices a seat at the table</div><div>N<b>o Jerks Allowed</b>: We value our relationships and take the time to build trust and connection and communicate respectfully</div><div><b>&nbsp;</b></div><div><b>&nbsp;</b></div><div><b style=\"font-size: 18px\">WHAT EMPOWER OFFERS</b></div><div>Competitive salary</div><div>Generous equity package</div><div>Full healthcare and dental benefits</div><div>Technology&nbsp; expense reimbursement</div><div>Work&nbsp; from anywhere</div><div><br></div><div><br></div><div><b style=\"font-size: 18px\">JOB DESCRIPTION</b></div><div><br></div><div><span style=\"font-size: 11pt\">As a Customer Support Analyst, you’ll help provide account and technical support to Empower’s&nbsp;rapidly growing membership base. As part of the Customer Support team, you will play a key role in ensuring success with our products, tools, and procedures by helping consumers with technical and account issues. </span></div><h3>Key Responsibilities</h3><li>Help consumers achieve their financial goals. You will do this by assisting our members in successfully utilizing tools and features that can help them improve their financial lives - always with their best interests in mind</li><li>Work on the frontline of the business: support calls, chat, and emails from our users</li><li>Create and document procedures by collaborating with our customer support team to open up opportunities for greater efficiency</li><li>Monitor and manage the team's performance on key performance indicators (KPIs) related to customer experience, such as customer satisfaction scores, response, and QA.</li><li>Be a strategic partner with our support team, users and cross functional members by tracking and surfacing consumer trends to inform cross functional partners in an effort to improve our product &amp; experience</li>,<h3>Candidate Qualifications</h3><li>2+ years of experience in customer support role, preferably in the fintech industry</li><li>Strong communication, both written and verbal</li><li>Demonstrated passion for the customer experience and the ability to solve problems with a short turnaround time for customers while maintaining a high level of empathy</li><li>Ability to adapt and learn quickly in a fast paced environment</li>","tags":"[]","pubDate":"2024-01-10 00:25:22.706","link":"https://jobs.lever.co/empower.me/20fa2a03-2e5f-4846-950d-c060200d67db","savedDate":"2024-01-31 09:38:50.498","slug":"customer-support-operations-analyst-remote-empower-5719"},{"id":1869588719,"title":"Staff Backend Software Engineer (Remote)","company":"Empower","image":"https://lever-client-logos.s3.us-west-2.amazonaws.com/2e1a369c-b58f-41ac-8d86-4b0a77695e68-1687915522032.png","description":"<div><b style=\"font-size: 24px\">EMPOWER OVERVIEW</b></div><div><br></div><div><a href=\"http://empower.me/\" class=\"postings-link\">Empower</a>&nbsp;is a high-growth financial technology company on a mission to expand access to fair credit to give anyone in the world the opportunity to improve their financial security and mobility. We dream up and launch one-of-a-kind features that help our members get money instantly whenever they need it, save for the future, and rewrite their financial story. Our members see Empower Cash Advance as a life-saver, Empower Automatic Savings as a game-changer, and the new Empower Thrive line of credit (currently in beta, launching soon) as a lifeline to low-cost borrowing and the only practical path to building good credit.</div><div><br></div><div>Empower is backed by Sequoia Capital, Blisce, and Icon Ventures. Are we the next great place to grow your impact and accelerate your career? We think so:</div><div><br></div><div>Inc. ranked Empower #56 in the 2023 Inc. 5000 list of the fastest-growing private companies in the US (#55 in 2022). Forbes put Empower on its 2023 list of America's Best Startup Employers. Fast Company recognized the new Empower Thrive line of credit in their 2022 list of the Next Big Things in Tech. </div><div><br></div><div><b style=\"font-size: 18px\">THE EMPOWER WAY</b></div><div><b>Great Expectations</b>: We come up with bold, audacious goals for ourselves and go all out for impact</div><div><b>Owner Mindset</b>: We give every employee latitude to act independently, make smart choices, and move the business forward</div><div><b>Spirited Debate</b>: We love skeptics and seek counter opinions to challenge our personal assumptions and expand our view</div><div><b>Customer Obsession: </b>We listen to understand, empathize, and create a memorable, rewarding experience for our community</div><div><b>Inclusive Collaboration</b>: We believe diverse teams make the best decisions, and we strive to give diverse voices a seat at the table</div><div>N<b>o Jerks Allowed</b>: We value our relationships and take the time to build trust and connection and communicate respectfully</div><div><b>&nbsp;</b></div><div><b>&nbsp;</b></div><div><b style=\"font-size: 18px\">WHAT EMPOWER OFFERS</b></div><div><br></div><div>Competitive salary</div><div>Generous equity package</div><div>Full healthcare and dental benefits</div><div>Technology&nbsp; expense reimbursement</div><div>Work&nbsp; from anywhere</div><div><br></div><div><b style=\"font-size: 18px\">JOB DESCRIPTION</b></div><div><span style=\"font-size: 11pt\">As a Staff Backend Engineer, you will play a pivotal role in shaping the technical direction of our solutions. You will identify strategic technical needs, lead large-scale and complex product initiatives, and optimize our engineering processes. You will also take ownership of technological initiatives, from management and execution to solution design and progress reporting. In addition, you will serve as a lead interviewer, mentor other engineers, and lead incident responses.&nbsp;</span></div><div><br></div><div><span style=\"font-size: 11pt\">Your role will also involve designing, building, and deploying server application code, implementing secure coding standards, and meeting sprint goals. You will monitor the performance of our server application, participate in the server ops on-call schedule, and work towards minimizing defects and improving reliability.</span></div><div><br></div><div>Travel for company offsites is expected at a minimum 2 times a year. </div><div>For US based employee's, this salary range includes several career levels of consideration and will be discussed further during the interview process. The salary range is based on a variety of factors such as candidate experience, qualifications, and business needs. The base pay range is subject to change and may be modified in the future. </div><h3>Key Responsibilities</h3><li>Identify opportunities to foster optimal product direction, collaborate closely with business stakeholders to streamline and simplify designs, and proactively identify areas of risk and tradeoffs that can be enhanced.</li><li>Ownership of technical initiatives, being accountable for the initiative's outcome, managing and executing the project, designing the solution and defining its requirements, reporting on the initiative's progress, and coordinating resources.</li><li>Perform as a lead technical interviewer</li><li>Lead technical reviewer of Empower Engineering blog posts</li><li>Mentor Engineers up to and including Senior levels</li><li>Lead SEV1 and lower incident response through to resolution</li><li>Lead engineering of&nbsp; large scale and complex product initiatives</li><li>Culture leader across the engineering organization, delivery team and platform team</li>,<h3>Candidate Qualifications</h3><li>Minimum 10 years, ideally 15+ years developing web APIs within .NET (C#)</li><li>Working experience with ORMs such as Entity Framework</li><li>Working experience constructing and optimising RDMS queries</li><li>Working experience within the asynchronous programming model</li><li>General knowledge of Messaging Queues eg. AMQP</li><li>General knowledge of PaaS environments eg. Azure</li><div>At Empower, we hire for people that push themselves to understand others and seek out ways to challenge their personal assumptions. Our hope is that by fostering such an environment, we strengthen our business and relationships by putting people first. We are committed to building a diverse, inclusive, and equitable workspace where everyone (regardless of age, education, ethnicity, gender, sexual orientation, or any personal characteristics) feels like they belong. Even if your experience doesn’t exactly match up to our job description, you should feel empowered to apply regardless!&nbsp;</div>","tags":"[\"management\",\"engineering\"]","pubDate":"2024-01-04 19:28:03.939","link":"https://jobs.lever.co/empower.me/f8bd8f79-b7ce-46d9-a197-eb2c30f7bf0b","savedDate":"2024-01-31 09:38:50.503","slug":"staff-backend-software-engineer-remote-empower-5669"},{"id":7121335227,"title":"Backend Software Engineer (Remote)","company":"Empower","image":"https://lever-client-logos.s3.us-west-2.amazonaws.com/2e1a369c-b58f-41ac-8d86-4b0a77695e68-1687915522032.png","description":"<div><b style=\"font-size: 24px\">EMPOWER OVERVIEW</b></div><div><br></div><div><a href=\"http://empower.me/\" class=\"postings-link\">Empower</a>&nbsp;is a high-growth financial technology company on a mission to expand access to fair credit to give anyone in the world the opportunity to improve their financial security and mobility. We dream up and launch one-of-a-kind features that help our members get money instantly whenever they need it, save for the future, and rewrite their financial story. Our members see Empower Cash Advance as a life-saver, Empower Automatic Savings as a game-changer, and the new Empower Thrive line of credit (currently in beta, launching soon) as a lifeline to low-cost borrowing and the only practical path to building good credit.</div><div><br></div><div>Empower is backed by Sequoia Capital, Blisce, and Icon Ventures. Are we the next great place to grow your impact and accelerate your career? We think so:</div><div><br></div><div>Inc. ranked Empower #56 in the 2023 Inc. 5000 list of the fastest-growing private companies in the US (#55 in 2022). Forbes put Empower on its 2023 list of America's Best Startup Employers. Fast Company recognized the new Empower Thrive line of credit in their 2022 list of the Next Big Things in Tech. </div><div><br></div><div><b style=\"font-size: 18px\">THE EMPOWER WAY</b></div><div><b>Great Expectations</b>: We come up with bold, audacious goals for ourselves and go all out for impact</div><div><b>Owner Mindset</b>: We give every employee latitude to act independently, make smart choices, and move the business forward</div><div><b>Spirited Debate</b>: We love skeptics and seek counter opinions to challenge our personal assumptions and expand our view</div><div><b>Customer Obsession: </b>We listen to understand, empathize, and create a memorable, rewarding experience for our community</div><div><b>Inclusive Collaboration</b>: We believe diverse teams make the best decisions, and we strive to give diverse voices a seat at the table</div><div>N<b>o Jerks Allowed</b>: We value our relationships and take the time to build trust and connection and communicate respectfully</div><div><b>&nbsp;</b></div><div><b>&nbsp;</b></div><div><b style=\"font-size: 18px\">WHAT EMPOWER OFFERS</b></div><div>Competitive salary</div><div>Generous equity package</div><div>Full healthcare and dental benefits</div><div>Technology&nbsp; expense reimbursement</div><div>Work&nbsp; from anywhere</div><div><br></div><div><b style=\"font-size: 18px\">JOB DESCRIPTION</b></div><div>As a Backend Server Software Engineer, you’ll work on the engine that powers the Empower apps and business. You’ll engage with a collaborative, high powered team to develop solutions and lead product engineering on projects with a reach of millions. The solutions you’ll build will be robust, secure and easy to understand both for our users and your engineering peers.&nbsp;You’ll take end to end ownership of new features and product lines shaping work in early stages, building, deploying and running post deployment analysis to ensure we’re hitting our goals.</div><div><br></div><div>Travel for company offsites is expected at a minimum 2 times a year. </div><div>For US based employee's, this salary range includes several career levels of consideration and will be discussed further during the interview process. The salary range is based on a variety of factors such as candidate experience, qualifications, and business needs. The base pay range is subject to change and may be modified in the future. </div><h3>Key Responsibilities</h3><li>Designing, building, and deploying server application code that interfaces with 3rd party clients and Empower</li><li>Implementing secure coding standards in accordance with the Empower Secure Development Policy</li><li>Perform on-going security testing and code review to improve software security</li><li>Monitoring the performance of the Empower server application and applying corrective action through bug fixing and improved solutions</li><li>Minimising defects and improving reliability through: Development of automated tests, manual test validation, development of fit for purpose architecture and code, contributing to PRs</li><li>Developing and maintaining the server app build and deployment pipeline</li><li>Collaborating cross-functionally to define, design and ship new features that create customer and business value</li><li>Working with business and operations stakeholders for the definition and development of business requirements</li><li>Contributing to server/client contract API definition</li><li>Architecting solutions that interface into 3rd parties and the Empower mobile client</li><li>Maximising effective development and identifying new technology opportunities by: Keeping across .NET development announcements, being across community best practice, discovering and evaluating new technologies</li><li>Participating in the server ops on call schedule</li>,<h3>Candidate Qualifications</h3><li>Bachelor degree or greater within Computer Science, Software Engineering or a related subject</li><li>3+ years developing web APIs within .NET (C#)</li><li>Working experience with ORMs such as Entity Framework</li><li>Working experience constructing and optimising RDMS queries</li><li>Working experience within the asynchronous programming model</li><div>At Empower, we hire for people that push themselves to understand others and seek out ways to challenge their personal assumptions. Our hope is that by fostering such an environment, we strengthen our business and relationships by putting people first. We are committed to building a diverse, inclusive, and equitable workspace where everyone (regardless of age, education, ethnicity, gender, sexual orientation, or any personal characteristics) feels like they belong. Even if your experience doesn’t exactly match up to our job description, you should feel empowered to apply regardless!&nbsp;</div>","tags":"[\"engineering\"]","pubDate":"2024-01-04 19:27:24.652","link":"https://jobs.lever.co/empower.me/a5d88cd9-1374-44fe-be59-4dab83a7f77c","savedDate":"2024-01-31 09:38:50.497","slug":"backend-software-engineer-remote-empower-4384"},{"id":7751083820,"title":"Assistant Controller (Remote)","company":"Empower","image":"https://lever-client-logos.s3.us-west-2.amazonaws.com/2e1a369c-b58f-41ac-8d86-4b0a77695e68-1687915522032.png","description":"<div><b style=\"font-size: 24px\">EMPOWER OVERVIEW</b></div><div><br></div><div><a href=\"http://empower.me/\" class=\"postings-link\">Empower</a> is a financial technology company on a mission to expand access to fair credit and give anyone in the world the opportunity to improve their financial security and mobility. Our vision is to underwrite the next billion people in the world using alternative data and machine learning to assess financial responsibility more thoughtfully and equitably. Through innovative credit products, offered in a user-friendly mobile experience, we’re making credit more accessible and inclusive and providing more people the chance they deserve to participate in our financial system.</div><div><br></div><div>Empower is backed by Sequoia Capital, Blisce, and Icon Ventures. Are we the next great place for you to increase your impact and accelerate your career? We think so:</div><div>Inc. ranked Empower #56 in the 2023 Inc. 5000 list of the fastest-growing private companies in the US (#55 in 2022). Forbes put Empower on its 2023 list of America's Best Startup Employers. Fast Company recognized the new Empower Thrive line of credit in their 2022 list of the Next Big Things in Tech.&nbsp;</div><div><br></div><div><b style=\"font-size: 18px\">THE EMPOWER WAY</b></div><div><b>Great Expectations</b>: We come up with bold, audacious goals for ourselves and go all out for impact</div><div><b>Owner Mindset</b>: We give every employee latitude to act independently, make smart choices, and move the business forward</div><div><b>Spirited Debate</b>: We love skeptics and seek counter opinions to challenge our personal assumptions and expand our view</div><div><b>Customer Obsession: </b>We listen to understand, empathize, and create a memorable, rewarding experience for our community</div><div><b>Inclusive Collaboration</b>: We believe diverse teams make the best decisions, and we strive to give diverse voices a seat at the table</div><div>N<b>o Jerks Allowed</b>: We value our relationships and take the time to build trust and connection and communicate respectfully</div><div><br></div><div><br></div><div><b style=\"font-size: 18px\">WHAT EMPOWER OFFERS</b></div><div><br></div><div>Competitive salary</div><div>Generous equity package</div><div>Full healthcare benefits</div><div>Technology expense reimbursement</div><div>Work from anywhere</div><div><br></div><div><br></div><div><b style=\"font-size: 18px\">JOB DESCRIPTION</b></div><div><br></div><div><span style=\"font-size: 11pt\">As an Assistant Controller, you will report to the Controller of the company and will be responsible for preparing accurate and timely reports for investors and lenders. You will play a key role in ensuring our financial disclosures meet applicable standards, and you will collaborate with various stakeholders to gather and analyze financial data. As Empower is still a growing company, the ideal candidate would not be afraid to roll up their sleeves and dive into the weeds and participate in monthly and annual close procedures. </span></div><div><br></div><div>Travel for company offsites is expected at a minimum 2 times a year. </div><div>For US based employee's, this salary range includes several career levels of consideration and will be discussed further during the interview process. The salary range is based on a variety of factors such as candidate experience, qualifications, and business needs. The base pay range is subject to change and may be modified in the future. </div><h3>Key Responsibilities</h3><li>Prepare and review financial statements, footnotes, and other disclosures aligned with GAAP standards</li><li>Research, determine, and document appropriate company accounting standard application</li><li>Collaborate with cross-functional teams to collect and validate financial and non-financial data for reporting purposes.</li><li>Conduct research and analysis to support disclosure requirements and disclosures related to significant events.</li><li>Support external auditors and legal counsel during the audit and review process.</li><li>Assist in the development and maintenance of internal controls related to future PCAAB standards.</li><li>Collaborate with other finance and accounting professionals on special projects as needed.</li><li>Support monthly and annual close procedures</li>,<h3>Candidate Qualifications</h3><li>Bachelor's degree in Accounting, Finance, or related field</li><li>3-5 years of public accounting and/or financial reporting experience. </li><li>Strong knowledge of U.S. Generally Accepted Accounting Principles (GAAP) </li><li>Experience with working with external auditors. </li><li>Excellent attention to detail and analytical skills.</li><li>Proficiency in Microsoft Excel, Word, and PowerPoint.</li><li>Effective communication and interpersonal skills, with the ability to work collaboratively in a team environment.</li><li>Ability to manage multiple priorities and meet deadlines in a fast-paced environment.</li><li>Strong problem-solving skills and a proactive approach to identifying and resolving issues.</li>,<h3>Preferred Qualifications</h3><li>CPA certification </li><li>Financial services experience</li><li>IFRS experience</li><div>At Empower, we hire for people that push themselves to understand others and seek out ways to challenge their personal assumptions. Our hope is that by fostering such an environment, we strengthen our business and relationships by putting people first. We are committed to building a diverse, inclusive, and equitable workspace where everyone (regardless of age, education, ethnicity, gender, sexual orientation, or any personal characteristics) feels like they belong. Even if your experience doesn’t exactly match up to our job description, you should feel empowered to apply regardless!&nbsp;</div>","tags":"[\"Finance\",\"legal\"]","pubDate":"2024-01-04 00:26:04.118","link":"https://jobs.lever.co/empower.me/109c7db2-8070-45f3-91a7-c99be129b64b","savedDate":"2024-01-31 09:38:50.497","slug":"assistant-controller-remote-empower-5956"}]