[{"id":3444747792,"title":"Rust Developer/Promoter (Remote/Anywhere)","company":"Collabora","image":"https://media.licdn.com/dms/image/D4E0BAQFdRsd49YG4fQ/company-logo_200_200/0/1688735422027/collabora_logo?e=2147483647&v=beta&t=COQKgdesE_abHpZN-7BjhNZ1IKm2nhQyHB637TbP88E","description":"<div class=\"section page-centered\" data-qa=\"job-description\"><div><span style=\"font-size: 14px;\">Are you looking for a job as a Rust developer and advocate to promote and develop with the programming language within Open-Source projects?</span></div><div><br></div><div><span style=\"font-size: 14px;\">The Rust programming language is increasingly gaining momentum and we, at Collabora, share the vision that it is going to have a bright future, with adoption across different OSS projects including but not limited to Operating Systems, GStreamer, the Linux Kernel and more.</span></div><div><br></div><div><span style=\"font-size: 14px;\">As a result, we are looking for a Rust developer advocate who will help us shaping a strategy, growing its usage within the company across different SW components and layers, identifying and documenting the best practices, and the last but not the least helping our clients building safe, reliable and efficient Rust-enabled products.</span></div></div><div class=\"section page-centered\"><div><h3>Key responsibilites</h3><ul class=\"posting-requirements plain-list\"><ul><li>Internally disseminate the knowledge and the expertise about the Rust programming language</li><li>Experience with Embedded Linux systems</li><li>Train the other Collaborans on Rust and help them adopting it for their respective projects whenever that makes sense</li><li>Shape a compelling strategy around Rust which would provide added value to our clients projects and open-source projects we are currently focusing on</li><li>Help connecting the engineering organization with the Rust ecosystem at large</li><li>Contribute publicly to open source Rust-based projects to ensure Collabora's continuing technical leadership</li><li>Discuss with and promote Rust-based solutions to our clients and represent Collabora at conferences and trade shows to demonstrate and promote our leadership in the open source arena</li><li>Gain working knowledge of customers’ products, applications, technical and business strengths and target markets</li></ul></ul></div></div><div class=\"section page-centered\"><div><h3>Required skills</h3><ul class=\"posting-requirements plain-list\"><ul><li>Proficient in Rust and familiar with writing low and high-level code</li><li>Knowledge of open source development methodologies and relevant open source communities</li><li>Being passionate about helping other developers</li><li>Good English language skills (both verbal and written)</li><li>Ability to work and communicate in an online fully distributed environment</li><li>Strong collaboration and listening skills, able to solicit honest feedback early and often</li></ul></ul></div></div><div class=\"section page-centered\"><div><h3>Desired skills</h3><ul class=\"posting-requirements plain-list\"><ul><li>Self learning skill to get sufficient knowledge of Collabora's services, business model, project delivery life cycle and other related technical domains</li><li>BS/BA or experience in the role of Engineer</li></ul></ul></div></div><div class=\"section page-centered\" data-qa=\"closing-description\"><div><span style=\"font-size: 14px;\">Collabora is a software consultancy specializing in bringing companies and the Open Source community together. We combine years of Open Source software leadership with an understanding of the challenges that businesses, non-profits, and governments face. Collabora brings deep technical expertise in system integration &amp; architecture, graphics, multimedia, web engines and communications to a number of market verticals, including mobile, IVI / automotive, set top box / smart TV, and a range of other specialized embedded applications.</span></div><div><span style=\"font-size: 14px;\">Collabora has the unique business model of enabling enterprises to leverage Open Source software in their solutions. Having worked with notable industry leading companies in the automotive, aerospace and handset mobile verticals amongst many others, Collabora has established a broad customer portfolio.</span></div><div><br></div><div><br></div><div><br></div><div>#LI-Remote</div></div><div class=\"section page-centered last-section-apply\" data-qa=\"btn-apply-bottom\"><a class=\"postings-btn template-btn-submit hex-color\" data-qa=\"show-page-apply\" href=\"https://jobs.lever.co/collabora/0cd179c2-2aa8-49e0-8563-f4436f0e547c/apply\">Apply for this job</a></div>","tags":"[\"engineering\"]","pubDate":"2024-11-21 04:40:16.468","link":"https://jobs.lever.co/collabora/0cd179c2-2aa8-49e0-8563-f4436f0e547c","savedDate":"2024-11-21 04:40:16.468","slug":"rust-developer-promoter-remote-anywhere-collabora-411"},{"id":6517929605,"title":"Software Engineer - Remote (Global)","company":"MixRank","image":"https://pbs.twimg.com/profile_images/378800000147745937/0fac42c12b433bbbd53ff3e15cd6fca4_400x400.png","description":"<p><strong>Who we are</strong></p>\n<p>MixRank processes petabytes of data every month from web crawling. We have hundreds of customers using our data products including Google, Amazon, Facebook, Intel, and Adobe, across industries Sales, Marketing, Finance, and Security.</p>\n<p>Team is 40 full-time, full-remote from 20+ countries. We're growing, profitable, employee-owned, no dependence on outside funding. Applicants from all geographies and backgrounds are welcome.</p>\n<p>We are looking for passionate individuals for whom programming is not just a job but it’s something they love to do. We're obsessed with computers, programming, big data, databases, compilers, hardware, math, data science, and the internet. Does this sound like you? Please apply to join our team.</p>\n<p>Our code base is very friendly to new contributors. You'll have a fully-functional development environment within hours (fully automated) and be pushing commits on your first day. Deployments to production happen multiple times per day and finish in less than 2 minutes. Effectively all of our codebase is written in Python, Rust, SQL, Javascript/TypeScript, and Nix. The core technologies you'll need familiarity with to be productive are Python, PostgreSQL, Linux, and Git.</p>\n<p>We operate at a larger scale than typical startups. We operate two datacenters with high performance servers we've built that are capable of dealing with the volumes of data we process. We've implemented our own distributed file system. We do full-scale web crawls. We download and perform static analysis on the entire universe of Android APKs and iOS IPAs that are published. Unlike a typical startup where you'll spend half of your time in meetings, and the other half fixing bugs from Jira tickets— at MixRank you'll get to challenge yourself with difficult technical problems that will help you to grow as an individual.</p>\n<p><strong>Who we’re looking for</strong></p>\n<p>We're hiring generalist software engineers to work on web applications, data mining, machine learning/data science, data transformation/ETL, data modeling, database scaling, infrastructure, devops, and more. We'll cater the role to whatever subset of these areas match your interests.</p>\n<p>Beneficial experience includes PostgreSQL, Python, Rust, Linux, TypeScript, Nix, frontend/backend web development, and data mining.</p>\n<p>Please include your updated resume when applying for this role.</p>\n<p><strong>Important:</strong> Only accept job offers from emails ending in @<a href=\"http://mixrank.com\" target=\"_blank\">mixrank.com</a><a href=\"http://mixrank.com/\" target=\"_blank\">. Offers fr</a>om any other email addresses are fraudulent. Do not share personal information with unverified senders.</p>\n","tags":"[\"postgres\",\"javascript\",\"typescript\",\"Finance\",\"database\"]","pubDate":"2024-11-21 04:40:16.467","link":"https://www.ycombinator.com/companies/mixrank/jobs/RXQspen-software-engineer-remote-global","savedDate":"2024-11-21 04:40:16.467","slug":"software-engineer-remote-global-mixrank-4236"},{"id":2635566311,"title":"Principal Engineer","company":"Avara","image":"https://pbs.twimg.com/profile_images/1725197105923293184/0HcwlDMy_400x400.jpg","description":"<div><b style=\"font-size: 16px;\">About us: </b></div><div><br></div><div><span style=\"font-size: 16px;\">Avara builds innovative products leveraging blockchain technologies. Avara's suite includes the Aave Protocol, along with the native stablecoin GHO, Lens, an open social network, and Family, a design-first mobile crypto wallet. Avara's vision is to build a people-powered internet that benefits all.</span></div><div><br></div><div><b style=\"font-size: 16px;\">Our culture:</b></div><div><br></div><div><span style=\"font-size: 16px;\">Having cultivated a thriving, collaborative culture, our team is kind, welcoming and passionate about what we are building. We celebrate differences and seek to develop and retain the most talented people from a diverse candidate pool from all over the world. No matter where you are based, no ghost will be left behind and we appreciate every moment we get to work and have fun together.&nbsp;</span></div><div><br></div><div><b style=\"font-size: 16px;\">About the Role:</b></div><div><br></div><div><span style=\"font-size: 16px;\">As a Principal Engineer at Avara, you will lead the design and implementation of regulated payments infrastructure. Your expertise will enable seamless money movement and high-conversion payment acceptance across Avara’s products and partner ecosystem. Together, we will build bridges, remove toll booths, and increase financial access for billions of people.</span></div><div><br></div><div><b style=\"font-size: 16px;\">About us: </b></div><div><br></div><div><span style=\"font-size: 16px;\">Avara builds innovative products leveraging blockchain technologies. Avara's suite includes the Aave Protocol, along with the native stablecoin GHO, Lens, an open social network, and Family, a design-first mobile crypto wallet. Avara's vision is to build a people-powered internet that benefits all.</span></div><div><br></div><div><b style=\"font-size: 16px;\">Our culture:</b></div><div><br></div><div><span style=\"font-size: 16px;\">Having cultivated a thriving, collaborative culture, our team is kind, welcoming and passionate about what we are building. We celebrate differences and seek to develop and retain the most talented people from a diverse candidate pool from all over the world. No matter where you are based, no ghost will be left behind and we appreciate every moment we get to work and have fun together.&nbsp;</span></div><div><br></div><div><b style=\"font-size: 16px;\">About the Role:</b></div><div><br></div><div><span style=\"font-size: 16px;\">As a Principal Engineer at Avara, you will lead the design and implementation of regulated payments infrastructure. Your expertise will enable seamless money movement and high-conversion payment acceptance across Avara’s products and partner ecosystem. Together, we will build bridges, remove toll booths, and increase financial access for billions of people.</span></div><div><br></div><h3>How you can make an impact:</h3><li>Oversee the end-to-end process of designing, implementing, and deploying regulated payments infrastructure</li><li>Ask questions, uncover edge cases, and tend to our documentation</li><li>Go fast, be agile, but also know when to slow down.  As a regulated payments business, we need to take some decisions slowly in order to design for zero-defects and massive scale</li><li>Obsess over transaction processing speed and clear communication with Customers. This is how we build trust.</li><li>Maintain short feedback cycles through communicating priorities, failing forward, and learn as a team</li><h3>Let's connect if:</h3><li>Minimum of 3 years in a Staff or Principal Engineering role, with a strong preference for experience in Fintech and Payments</li><li>Advanced proficiency in TypeScript, Postgres, GraphQL, Restful and distributed backend system design</li><li>Solid grasp of transaction processing and ledgering and asynchronous risk monitoring</li><li>Experience building mission critical, API-first, services in a production environment for enterprise-scale customers</li><li>Thrive in a dynamic, fast-paced environment</li><li>Driven by the opportunity to make decentralized finance the backbone of fintech and to contribute meaningfully to its practical application in the real world</li><div>Haven’t quite met all the criteria? Let’s not miss out on the chance to speak. Whilst you might not meet every single requirement, you might bring other, more exciting skills to the companies!&nbsp;&nbsp;</div><div><br></div><div><b style=\"font-size: 18px;\">Equal opportunity statement:</b></div><div><br></div><div>Avara celebrates diversity and view each and every team member as a separate individual with their own unique identity. No matter your race, religion, gender, ethnicity, age, (dis)ability, sexual orientation or even the wallet you use, we welcome you at Avara.&nbsp;</div><div>&nbsp;</div><div>As an equal opportunities employer, we take accountability and believe in everyone's potential to build, create and inspire changes. With a mission to build a diverse workforce, we are proud to foster a working environment in which everyone can feel safe and valued for who they are.&nbsp;</div>","tags":"[\"postgres\",\"typescript\",\"Finance\",\"engineering\"]","pubDate":"2024-11-19 16:19:03.033","link":"https://jobs.eu.lever.co/avara/6a353cc2-6f3b-41a5-b16c-7d559c22ca73","savedDate":"2024-11-21 04:40:16.470","slug":"principal-engineer-avara-4591"},{"id":6225904311,"title":"Senior DevSecOps Engineer","company":"Airalo","image":"https://lever-client-logos.s3.us-west-2.amazonaws.com/55028a36-609c-479c-9553-d4689ff2dd8c-1669620566663.png","description":"<div><b>About Airalo</b></div><div>Alo! Airalo is the world’s first eSIM store that helps people connect in over 200+ countries and regions across the globe. We are building the next digital service that revolutionizes the telecom industry. We are a travel-tech company and an equal-opportunity environment that values and executes diversity, inclusion, and equity. Our team is spread across 50+ countries and six continents. What glues us together is our commitment to changing the way you connect<span style=\"font-size: 13.3333px\">. </span></div><div><br></div><div><b>About you</b></div><div>We hope that you care deeply about the quality of your work, the intrinsic worth of tasks, and the success of your team. You are self-disciplined and do not require micromanagement in terms of your skillset and work ethic. You do your best to flourish as an individual every day while working hard to foster a collaborative team environment. You believe in the importance of being — and staying — authentic, honest, positive, and kind. You are a good interlocutor with clear and concise communication. You are able to manage multiple projects, have an analytical mind, pay keen attention to detail, and love to get your hands dirty. You are cognizant, tolerant, and welcoming of vulnerabilities and cultural differences.</div><div><br></div><div><b>About the Role</b></div><div><b>Position</b>: Full-time / Employee</div><div><b>Location:</b>&nbsp;Remote-first </div><div><b>Benefits:</b>&nbsp;Health Insurance, work-from-anywhere stipend, annual wellness &amp; learning credits, annual all-expenses-paid company retreat in a gorgeous destination &amp; other benefits</div><div><br></div><div><b>About Airalo</b></div><div>Alo! Airalo is the world’s first eSIM store that helps people connect in over 200+ countries and regions across the globe. We are building the next digital service that revolutionizes the telecom industry. We are a travel-tech company and an equal-opportunity environment that values and executes diversity, inclusion, and equity. Our team is spread across 50+ countries and six continents. What glues us together is our commitment to changing the way you connect<span style=\"font-size: 13.3333px;\">.</span></div><div><br></div><div><b>About you</b></div><div>We hope that you care deeply about the quality of your work, the intrinsic worth of tasks, and the success of your team. You are self-disciplined and do not require micromanagement in terms of your skillset and work ethic. You do your best to flourish as an individual every day while working hard to foster a collaborative team environment. You believe in the importance of being — and staying — authentic, honest, positive, and kind. You are a good interlocutor with clear and concise communication. You are able to manage multiple projects, have an analytical mind, pay keen attention to detail, and love to get your hands dirty. You are cognizant, tolerant, and welcoming of vulnerabilities and cultural differences.</div><div><br></div><div><b>About the Role</b></div><div>Position: Full-time / Employee</div><div>Location:&nbsp;Remote-first</div><div>Benefits:&nbsp;Health Insurance, work-from-anywhere stipend, annual wellness &amp; learning credits, annual all-expenses-paid company retreat in a gorgeous destination &amp; other benefits</div><h3>Responsibilities include, but are not limited to:</h3><li>Design, implement, and manage security solutions across the entire software development lifecycle (SDLC), with a focus on automation and continuous integration/continuous delivery (CI/CD) pipelines, including robust API security measures and authentication protocols.</li><li>Champion security best practices within engineering, DevOps, SRE, and IT teams, fostering a culture of shared responsibility for security.</li><li>Proactively identify and remediate security vulnerabilities in applications, mitigating OWASP Top 10 vulnerabilities, infrastructure, and cloud services through threat modeling, vulnerability assessments, and penetration testing.</li><li>Develop and maintain security monitoring and alerting solutions to detect and respond to potential security incidents in real-time and prevent common cyber attacks such as DDoS, injection attacks, and credential stuffing.</li><li>Define and enforce secure coding standards and provide training and mentorship to development teams on DevSecOps principles.</li><li>Lead compliance initiatives by contributing to security policies, controls, and audit readiness for SOC 2, ISO 27001, GDPR, and other relevant regulations.</li>,<h3>Must-haves:</h3><li>Bachelor's degree in Computer Science, Cybersecurity, or a related field.</li><li>5+ years of experience in DevSecOps, Security Engineering, or a similar role with a strong focus on cloud security.</li><li>3+ years of hands-on experience with AWS services, including expertise in container orchestration, IAM, and security best practices.</li><li>2+ years of experience with Kubernetes, including securing Kubernetes clusters and deployments.</li><li>Deep understanding of SAST, DAST, and container security solutions, API security testing tools, with experience implementing and managing these tools.</li><li>Proven experience in vulnerability assessment, threat modeling, and remediation techniques.</li><li>Experience with security incident response, including developing incident response plans and conducting post-mortems.</li><li>Proficiency in at least one programming language (Python, Go, Java, etc.) for automation and tooling.</li><li>Proficiency in infrastructure-as-code tools (e.g., Terraform) and CI/CD platforms (e.g., GitHub Actions, Jenkins).</li><li>Excellent communication and collaboration skills with the ability to work effectively in a fast-paced environment.</li>,<h3>Good to have:</h3><li>Relevant certifications (AWS Security Specialty, CISSP, CEH, Security+).</li><li>Experience with AI-driven security tools for anomaly detection.</li><li>Experience with Zero Trust principles and implementations.</li><li>Experience in securing PHP - Laravel/Symfony, JS - NuxtJS applications.</li><li>Proficiency in network security, firewall management, VPNs, and network segmentation.</li><li>Contributions to open-source security projects or communities.</li><li>Experience in the telecommunications industry with knowledge of eSIM and GSMA technologies.</li><div>If you are interested in this position, <b>please apply via the link.</b></div><div><br></div><div><i style=\"font-size: 15px;\">Please note that our Platform team works in the CET timezone, so candidates will need to reside in countries with the same time zone or similar to it and will need to already have permit to work in the country where they are based.</i></div><div><br></div><div>We sincerely thank all applicants in advance for submitting their interest in this opportunity. Airalo is an equal opportunity employer and values diversity, equity &amp; inclusion. We do not discriminate on the basis of race, religion, national origin, gender, sexual orientation, age, marital status, veteran status, or disability status. We are committed to providing reasonable accommodations upon request for individuals with disabilities throughout our job interview process.</div>","tags":"[\"management\",\"engineering\",\"aws\"]","pubDate":"2024-11-19 12:01:44.594","link":"https://jobs.lever.co/airalo/0f8fb6ac-fca4-4bb4-bb74-f75af9266636","savedDate":"2024-11-21 04:40:16.469","slug":"senior-devsecops-engineer-airalo-3896"},{"id":7557574875,"title":"Graduate Incident Manager (Remote - Work from Anywhere)","company":"Xapo Bank","image":"https://avatars.githubusercontent.com/u/6930305?s=200&v=4","description":"&lt;div class=&quot;content-intro&quot;&gt;&lt;p style=&quot;text-align: left;&quot;&gt;&lt;span style=&quot;font-weight: 900;&quot;&gt;Work from anywhere, impact everywhere&amp;nbsp;&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;Diversity is at the heart of who we are at Xapo Bank. We’re a fully distributed team of over 140 Xapiens that work remotely from 40+ countries around the world.&amp;nbsp;&lt;/p&gt;\n&lt;p&gt;Our beginning: A world that enjoys economic freedom and wealth protection, no matter where you live or who is running your country. This is the dream that drove Wences Casares, our Founder and Chairman, to quietly transform the world of banking.&lt;/p&gt;\n&lt;p&gt;To achieve that, we search the world for the best people for the job. We work hard, think globally, and inspire each other to learn and grow. We are committed to changing the way things are done.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Risk is inherent in all of our business activities and managing risk well is the responsibility of every Xapien. Sound risk management enables us to serve our customers and deliver value for our shareholders, and helps make Xapo a great place to work.&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&amp;nbsp;&lt;/p&gt;\n&lt;p style=&quot;text-align: left;&quot;&gt;&lt;em&gt;&lt;span style=&quot;font-weight: 500;&quot;&gt;Although we are headquartered in Gibraltar, this is a full time, 100% remote position&amp;nbsp;&lt;br&gt;&lt;/span&gt;&lt;/em&gt;&lt;em&gt;&lt;span style=&quot;font-weight: 500;&quot;&gt;Work from anywhere!&lt;/span&gt;&lt;/em&gt;&lt;/p&gt;\n&lt;p style=&quot;text-align: left;&quot;&gt;&amp;nbsp;&lt;/p&gt;&lt;/div&gt;&lt;p&gt;&lt;strong&gt;&lt;em&gt;Position overview&lt;/em&gt;&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;We are seeking a motivated Graduate Incident Manager to join our dynamic team at Xapo Bank. In this role, you will support the Continuous Improvement team to effectively monitor, manage and resolve incidents to ensure minimal impact on business operations. You will work closely with engineering, security, operations and customer success teams to record, classify and communicate Incidents and coordinate efforts to restore services as quickly as possible.&lt;/p&gt;\n&lt;p&gt;This entry-level position is perfect for recent graduates, or individuals starting their careers in IT service management or digital operations, to gain hands-on experience in a fast-paced environment.&amp;nbsp; &lt;br&gt;You will be trained on our incident management, response and reporting processes where you will gain exposure to industry-standard tools.&amp;nbsp;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;&lt;em&gt;Responsibilities&lt;/em&gt;&lt;/strong&gt;&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;&lt;strong&gt;Incident Reporting and Response&lt;/strong&gt;: Ensure that incidents are promptly reported, accurately classified and response actions are swiftly initiated.&lt;/li&gt;\n&lt;li&gt;&lt;strong&gt;Escalation Support&lt;/strong&gt;: Learn to apply the company’s escalation protocols, ensuring incidents are efficiently prioritised and directed to the right teams.&lt;/li&gt;\n&lt;li&gt;&lt;strong&gt;Stakeholder Communication&lt;/strong&gt;: Assist in notifying relevant stakeholders of incidents and provide regular status updates as directed by senior team members.&lt;/li&gt;\n&lt;li&gt;&lt;strong&gt;Recovery: &lt;/strong&gt;Work with responding teams to drive incident recovery and restore services, ensuring that normal operations resume within target SLA’s.&lt;/li&gt;\n&lt;li&gt;&lt;strong&gt;Closure and Post-Incident Review:&lt;/strong&gt; Verify that the incident has been fully resolved and document the incident including impact, key metrics, Root Cause Analysis, lessons learned and improvement actions.&lt;/li&gt;\n&lt;li&gt;&lt;strong&gt;Data Tracking &amp;amp; Analysis: &lt;/strong&gt;Assist with incident data tracking and analysis, helping to improve data collection at a more granular level, that can be used to enhance reporting.&lt;/li&gt;\n&lt;li&gt;&lt;strong&gt;Reporting &amp;amp; Metrics: &lt;/strong&gt;Create monthly and quarterly incident reports to track key metrics, identify trends and provide actionable insights.&lt;/li&gt;\n&lt;li&gt;&lt;strong&gt;Collaboration&lt;/strong&gt;: Work closely with various technical teams to understand the company’s infrastructure, gaining exposure to proactive problem-solving.&lt;/li&gt;\n&lt;li&gt;&lt;strong&gt;Continuous Improvement&lt;/strong&gt;: Provide feedback to the senior team on potential process improvements, contributing to enhancing incident management procedures.&amp;nbsp; You will also need to effectively monitor and drive the completion of improvement actions from PIR’s.&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;&lt;strong&gt;&lt;em&gt;Skills needed&lt;/em&gt;&lt;/strong&gt;&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;&lt;strong&gt;Education&lt;/strong&gt;: Bachelor’s degree in Information Technology, Computer Science, or a related field, or equivalent practical experience.&lt;/li&gt;\n&lt;li&gt;&lt;strong&gt;Knowledge of ITIL/ITSM&lt;/strong&gt;: Basic understanding of IT service management principles (familiarity with ITIL is an advantage).&lt;/li&gt;\n&lt;li&gt;&lt;strong&gt;Technical Aptitude&lt;/strong&gt;: Interest in IT infrastructure, incident management tools, and monitoring software.&lt;/li&gt;\n&lt;li&gt;&lt;strong&gt;Communication Skills&lt;/strong&gt;: Strong written and verbal communication skills, able to assist in clear, concise incident reporting.&lt;/li&gt;\n&lt;li&gt;&lt;strong&gt;Analytical Mindset&lt;/strong&gt;: A detail-oriented approach with an eagerness to learn and apply problem-solving skills.&lt;/li&gt;\n&lt;li&gt;&lt;strong&gt;Team Collaboration&lt;/strong&gt;: Ability to work well within a team environment and contribute to shared team goals.&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;&lt;strong&gt;&lt;em&gt;Other requirements&lt;/em&gt;&lt;/strong&gt;&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;A dedicated workspace.&lt;/li&gt;\n&lt;li&gt;A reliable internet connection with the fastest speed possible in your area.&lt;/li&gt;\n&lt;li&gt;Devices and other essential equipment that meet minimal technical specifications.&lt;/li&gt;\n&lt;li&gt;Alignment with Our Values and the Xapo Values-Driven Leadership principles.&lt;/li&gt;\n&lt;/ul&gt;&lt;div class=&quot;content-conclusion&quot;&gt;&lt;p&gt;&lt;span style=&quot;font-size: 12pt;&quot;&gt;&lt;strong&gt;Why work for Xapo?&lt;/strong&gt;&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span style=&quot;font-weight: 500; font-size: 10pt;&quot;&gt;IMPACT GLOBALLY, WORK REMOTELY.&lt;/span&gt;&lt;/p&gt;\n&lt;ul&gt;\n&lt;li style=&quot;font-weight: 500;&quot;&gt;&lt;strong&gt;Shape the Future:&lt;/strong&gt;&lt;span style=&quot;font-weight: 500;&quot;&gt; Improve lives through cutting-edge technology, work 100% remotely from anywhere in the world.&lt;/span&gt;&lt;/li&gt;\n&lt;li style=&quot;font-weight: 500;&quot;&gt;&lt;strong&gt;Great work-life balance:&lt;/strong&gt;&lt;span style=&quot;font-weight: 500;&quot;&gt; &lt;/span&gt;&lt;span style=&quot;font-weight: 500;&quot;&gt;Build amazing things with a balance of autonomy and collaborative teamwork. Set your own work schedule and make use of a flexible PTO plan when you need to recharge.&lt;/span&gt;&lt;span style=&quot;font-weight: 500;&quot;&gt;&amp;nbsp;&lt;/span&gt;&lt;/li&gt;\n&lt;li style=&quot;font-weight: 500;&quot;&gt;&lt;strong&gt;Expect Excellence:&lt;/strong&gt;&lt;span style=&quot;font-weight: 500;&quot;&gt; Collaborate, learn, and grow with a high-performance team. Learn&lt;/span&gt;&lt;span style=&quot;font-weight: 500;&quot;&gt; how you learn best - from books to conferences, you’ll get a yearly budget for your individual learning and development goals.&lt;/span&gt;&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;&lt;strong&gt;At Xapo, we prioritize consumer protection and adhere to regulatory requirements by ensuring that all Xapiens are accountable for upholding principles of fair treatment, transparency, and ethical conduct in their interactions with customers and stakeholders.&lt;/strong&gt;&lt;/p&gt;&lt;/div&gt;","tags":"[\"management\",\"engineering\"]","pubDate":"2024-11-19 08:39:04.000","link":"https://job-boards.greenhouse.io/xapo61/jobs/6268412003","savedDate":"2024-11-21 04:40:16.470","slug":"graduate-incident-manager-remote-work-from-anywhere-xapo-bank-9950"},{"id":9330395959,"title":"Infrastructure Engineer","company":"Nethermind","image":"https://remotive.com/job/1951047/logo","description":"<div class='\"content-intro\"'><div class=\"h2\">What are we all about?</div>\n<p>We are a team of builders and researchers on a mission to empower enterprises and developers worldwide to access and build on decentralized systems.</p>\n<p>Our expertise covers several domains: Ethereum and Starknet protocol engineering, layer-2, cryptography research, protocol research, decentralized finance (DeFi), security auditing, formal verification, real-time monitoring, smart contract development, and dapps and enterprise engineering.</p>\n<p>Working to solve some of the most challenging problems in the blockchain space, we frequently collaborate with renowned companies, such as Ethereum Foundation, Starknet Foundation, Gnosis Chain, Flashbots, Forta Protocol, Lido, EigenLayer, Open Zeppelin, RISCZero, Aleph Zero, and many more.</p>\n<p>Today, we are a 350+ strong team working remotely across 66+ countries.</p>\n<p>View all our open positions here: https://www.nethermind.io/open-roles</p>\n<p><br><br></p></div><p><strong>Are you the one?</strong></p>\n<div class=\"h3\"><strong>The Role:</strong></div>\n<p>We are currently seeking a highly skilled and experienced Infrastructure Engineer to join our dynamic team. The ideal candidate will have a strong background in task automation, integration setup, and cloud infrastructure maintenance, and the ability to collaborate seamlessly with the DevOps Lead.</p>\n<p>Your commitment to delivering top-notch solutions and exceptional support to our internal products will be crucial in this role. Additionally, your alignment with Nethermind's vision of leading in blockchain technology, promoting innovation, and nurturing growth within the industry is essential.</p>\n<p><strong>Responsibilities</strong>:</p>\n<ul style=\"\">\n<li style=\"\">Lead the implementation and optimization of Okta for seamless identity and access management with a strong focus on automation, collaborating closely with the DevOps Lead and team.</li>\n<li style=\"\">Foster communication across departments to ensure smooth integration deliveries, actively engage with stakeholders to gather requirements and provide regular progress updates.</li>\n<li style=\"\">Develop and maintain tailored integrations across various platforms and technologies, continually optimizing them for enhanced performance and reliability.</li>\n<li style=\"\">Implement and manage GitHub CI/CD pipelines for streamlined development workflows, working closely with development teams to ensure efficient code integration, delivery, and security.</li>\n<li style=\"\">Create comprehensive technical documentation for configurations, integrations, and CI/CD pipelines, while mentoring and guiding junior team members to foster skill development and knowledge transfer.</li>\n</ul>\n<p><strong>Skills:</strong></p>\n<ul style=\"\">\n<li style=\"\">2-5 + years of experience in a DevOps/Infrastructure/Cloud Engineer role</li>\n<li style=\"\">Strong experience with<span class='\"Apple-converted-space\"'> </span><strong>setting up Okta</strong><span class='\"Apple-converted-space\"'> </span>on multiple services and platforms, including Cloud Providers, SaaS, and GSuite**.**</li>\n<li style=\"\">Strong experience with designing and building CICD pipelines</li>\n<li style=\"\">Strong experience with IaC technologies, for example, Terraform and Ansible.</li>\n<li style=\"\">Proficiency in AWS &amp; GCP services.</li>\n<li style=\"\">Strong troubleshooting skills.</li>\n<li style=\"\">Good communication skills and stakeholder management experience</li>\n<li style=\"\">Experience producing operational and design documentation for the things you build.</li>\n<li style=\"\">Experience with continuous integration and continuous delivery tools, like GitHub Actions.</li>\n<li style=\"\">Proficiency in any high-level programming languages (preferably Python/Go).</li>\n</ul>\n<p><strong>Nice to have:</strong></p>\n<ul style=\"\">\n<li style=\"\">Any blockchain experience is a plus.</li>\n<li style=\"\">Experience with JFrog integrations and package deployments.</li>\n</ul><div class='\"content-conclusion\"'><div><span style='\"font-size:'><em><span style='\"text-decoration:'><strong>Disclaimer</strong></span>: I hereby consent to my personal information being stored and processed by Demerzel Solutions Limited (t/a Nethermind) (the “Company”) for recruitment purposes in relation to both the selected job role and any other role the Company considers me a qualified candidate for. All data storing and processing by the Company takes place in accordance with the UK GDPR. Kindly refer to our privacy policy for more details. </em></span><br><span style='\"font-size:'><em>Your consent to share personal information is entirely voluntary, and you may withdraw your consent at any time. Should you have any questions about this process, or wish to withdraw your consent please contact: legalnotices@nethermind.io </em></span><br><br>Keep up to date on what we are working on by following <span class='\"il\"'>us</span> on <strong>our social channels<br><br></strong></div>\n<div><a href=\"%22https://twitter.com/nethermindeth%22\" rel=\"nofollow\" target='\"_blank\"'><img alt='\"\"' height='\"50\"' src=\"%22https://cdn4.iconfinder.com/data/icons/social-media-icons-the-circle-set/48/twitter_circle-512.png%22\" width='\"50\"'></a>   <a href=\"%22https://discord.com/invite/PaCMRFdvWT%22\" rel=\"nofollow\" target='\"_blank\"'><img alt='\"\"' height='\"49\"' src=\"%22https://cdn3.iconfinder.com/data/icons/popular-services-brands-vol-2/512/discord-1024.png%22\" width='\"49\"'></a>   <a href=\"%22https://www.linkedin.com/company/nethermind/mycompany/%22\" rel=\"nofollow\" target='\"_blank\"'><img alt='\"\"' height='\"49\"' src=\"%22https://cdn1.iconfinder.com/data/icons/logotypes/32/circle-linkedin-1024.png%22\" width='\"49\"'></a></div>\n<div> </div>\n<div><strong><a href=\"%22https://www.nethermind.io/legal%22\" rel=\"nofollow\" target='\"_blank\"'><em>Click here to view our Privacy Policy.</em></a></strong></div></div><img src=\"https://remotive.com/job/track/1951047/blank.gif?source=public_api\" alt=\"\"/>","tags":"[\"automation\",\"okta\"]","pubDate":"2024-11-19 03:21:17.000","link":"https://remotive.com/remote-jobs/devops/infrastructure-engineer-1951047","savedDate":"2024-11-21 04:40:16.467","slug":"infrastructure-engineer-nethermind-4956"},{"id":4705203657,"title":"Senior QA Automation Engineer (worldwide remote, work anywhere)","company":"CloudLinux","image":"https://pbs.twimg.com/profile_images/696718028084482050/ymY3OEPk_400x400.png","description":"<p>CloudLinux is a global company with a remote-first approach. Our guiding principles include doing the right thing, putting employees first, prioritizing remote work, and delivering affordable, high-quality Linux infrastructure and security products that optimize businesses' operations. At CloudLinux, we foster a supportive team environment where everyone thrives and contributes to each other's success. We pride ourselves on being an exceptional workplace. For more information about our company, you can visit the website - <a href=\"https://cloudlinux.com/\" target=\"_blank\" rel=\"nofollow noreferrer noopener\" class=\"external\">https://cloudlinux.com/</a>.</p><p>We are looking for a Senior QA Automation Engineer to join our CLN team. CLN is a vital SaaS platform responsible for licensing all CloudLinux products. It manages server operations and streamlines the billing process for our customers. This innovative self-provisioning system was designed internally by CloudLinux to meet our specific needs. With its automated, user-friendly features, this robust solution delivers a comprehensive and seamless user experience. We offer an environment that encourages growth and advancement, giving you the opportunity to work on exciting and challenging projects. Join us and make a difference!</p><p></p><p><strong>Key Responsibilities</strong></p><p><strong>Test Management and Execution:</strong></p><p><strong>-</strong> Be involved in designing, developing, and maintaining test automation frameworks using tools such as Selenium, Cypress, Playwright, TestNG, JUnit, or Cucumber</p><p>- Develop, implement, and maintain comprehensive test plans, scenarios, and cases</p><p>- Posses strong knowledge of API testing tools like Postman, RestAssured, or SoapUI</p><p>- Be able to work with performance testing tools like JMeter, Gatling, or LoadRunner</p><p>- Oversee all aspects of quality assurance, including establishing metrics and developing new tools and processes to achieve quality goals</p><p>- Diagnose and isolate issues, implementing techniques to stabilize the test system</p><p>- Develop new automated test scenarios using Java and maintain continuous test execution in Gitlab CI/CD</p><p></p><p><strong>CI/CD and DevOps:</strong></p><p>- Integrate automated tests into CI/CD pipelines (e.g., Jenkins, GitLab CI/CD, Azure DevOps, or CircleCI)</p><p>- Be able to work with version control systems like Git</p><p>- Posses strong knowledge of containerization and orchestration tools like Docker and Kubernetes</p><p></p><p><strong>Collaboration and Communication:</strong></p><p>- Collaborate with cross-functional teams to ensure high-quality product releases</p><p>- Serve as the key contact for all QA release activities, coordinating QA resources internally and externally</p><p>- Prepare documentation detailing all aspects of the product environment</p><p></p><p><strong>Process Improvement:</strong></p><p>- Establish and refine formal QA processes, ensuring adherence to industry best practices</p><p>- Continuously improve and enhance testing processes and methodologies</p><h3>Requirements: </h3><p><strong>To thrive in this role, we are looking for someone who has:</strong></p><p>- Extensive knowledge of Java programming, including object-oriented design</p><p>- 3+ years of experience in QA Automation beyond just UI and/or API automation</p><p>- 6+ years of overall experience in QA</p><p>- Proven experience with Linux and command-line interfaces (CLI) is essential</p><p>- Strong shell scripting skills and hands-on experience with automated testing tools</p><p>- Deep understanding of CI/CD systems, tools, and methodologies</p><p>- Experience in managing test cases, test plans, and defect tracking</p><p>- Experience with stress testing, load testing, and identifying performance bottlenecks</p><p>- Ability to write and execute complex SQL queries</p><p>- Experience with Agile/Scrum development processes</p><p></p><p><strong>It would be great if you also have:</strong></p><p>- Familiarity with Python/JavaScript (as source tests may involve various languages)</p><p>- Experience with Ansible, Docker</p><p>- Experience with security testing</p><p></p><p><strong>Communication and Interpersonal skills:</strong></p><p>- Proven ability to communicate effectively with peers and at all management levels</p><p>- Ability to work effectively in culturally diverse teams</p><p>- Proficiency in English at an intermediate level or higher</p><p></p><p><strong>Personal Qualities:</strong></p><p>- Strong problem-solving skills and attention to detail</p><p>- Excellent communication and teamwork abilities</p><p>- Strong organizational skills and ability to manage multiple tasks simultaneously</p><p>- Leadership skills</p><p>- Critical thinking and commitment to high-quality standards</p><p>- High level of initiative and ability to work independently while being a team player</p><p>- Adaptability to a fast-changing agile environment</p><h3>Benefits: </h3><p></p><p><strong>What's in it for you?</strong></p><ul> <li>A focus on professional development</li> <li>Interesting and challenging projects</li> <li>Fully remote work with flexible working hours, that allows you to schedule your day and work from any location worldwide</li> <li>Paid 24 days of vacation per year, 10 days of national holidays, and unlimited sick leaves</li> <li>Compensation for private medical insurance</li> <li>Co-working and gym/sports reimbursement</li> <li>Budget for education</li> <li>The opportunity to receive a reward for the most innovative idea that the company can patent</li> </ul><p></p><p><em>By applying for this position, you consent to the processing of your personal data as described in our Privacy Policy (</em><a href=\"https://cloudlinux.com/candidate-privacy-notice\" target=\"_blank\" rel=\"nofollow noreferrer noopener\" class=\"external\"><em>https://cloudlinux.com/candidate-privacy-notice</em></a><em>), which provides detailed information on how we maintain and handle your data.</em><a href=\"https://apply.workable.com/cloudlinux-1/j/C8414E3D57/apply/\" rel=\"nofollow noreferrer noopener\" class=\"external\"></a></p><p></p><p><br> </p>","tags":"[\"javascript\",\"management\"]","pubDate":"2024-11-19 00:00:00.000","link":"https://apply.workable.com/cloudlinux-1/j/3D22F69D76","savedDate":"2024-11-21 04:40:16.468","slug":"senior-qa-automation-engineer-worldwide-remote-work-anywhere-cloudlinux-910"},{"id":2966874908,"title":"HR Assistant (remote-only opportunity, location - Europe & CIS)","company":"CloudLinux","image":"https://pbs.twimg.com/profile_images/696718028084482050/ymY3OEPk_400x400.png","description":"<p>CloudLinux is a global remote-first company. We are driven by our principles: do the right thing, employees first, we are remote first, and we deliver high volume, low-cost Linux infrastructure and security products that help companies to increase the efficiency of their operations. Every person on our team supports each other and does what we can to ensure we all are successful.</p><p>We are truly a great place to work.</p><p>Check out our website for more information <a href=\"https://cloudlinux.com/\" rel=\"nofollow noreferrer noopener\" class=\"external\">https://cloudlinux.com/</a></p><p>We are seeking a dynamic <strong>HR Assistant</strong> who has a passion for Human Resources and is looking to grow with our team!&nbsp;</p><p>The ideal candidate should have strong organizational skills, capable of critical thinking, handling multiple tasks simultaneously with precision and maintaining patience in complex situations. This position offers a remarkable opportunity for the candidate to grow within all areas of HR, contributing to and learning from a team dedicated to excellence.</p><h3>Key Responsibilities:</h3><ul> <li>Assist with day to day operations of the HR functions and duties</li> <li>Assist with employee relations issues and employee requests regarding human resources issues, rules, and regulations</li> <li>Processes incoming HR emails by answering them and directing them to the relevant team members.</li> <li>Support the Talent Business Partners with onboarding and offboarding activities</li> <li>Maintain records of personnel-related data (personal information, job details, PTO, etc.) in the HRIS</li> <li>Prepare HR-related reports as needed</li> <li>Liaise with other departments or functions (Finance, Operations, Infrastructure, etc.)</li> <li>Other HR duties as assigned</li> </ul><p></p><p></p><h3>Requirements: </h3><ul><li>At least 2 years of experience as an HR Assistant or relevant human resources/administrative position</li></ul><ul> <li>Bachelor's degree in Human Resources, Linguistics or related discipline</li> <li>Fluency in English (upper-intermediate or higher) and Russian is a must</li> <li>Good knowledge of Excel and/or Google Sheets&nbsp;is a plus</li> <li>Hands-on experience with an HRIS (BambooHR, HiBob or others) is a plus</li> <li>Familiarity with ATS software and resume databases is a plus</li> <li>Exceptional interpersonal and communication skills</li> <li>Great attention to detail</li> <li>Ability to handle highly confidential information in a professional manner</li> <li>Self-starter, with a \"let's get things done\" attitude</li> <li>Strong ability to multi-task and work well in an environment subject to changing priorities and demands</li> <li>Ability to work as a part of team as well as work independently, prioritizing and organizing workload to meet deadlines</li> <li>Initiative, driven to grow and learn</li> </ul><h3>Benefits: </h3><p></p><ul> <li>A strong focus on professional development with opportunities for learning and growth:</li> <ul> <li>Interesting and challenging projects,</li> <li>Mentor and other knowledge-exchange programs,&nbsp;</li> </ul> <li>Fully remote work with flexible working hours, that allows you to schedule your day and work from any location worldwide;</li> <li>Paid 24 days of vacation per year, 10 days of national holidays, and unlimited sick leaves to ensure you maintain a healthy work-life balance;</li> <li>Compensation for private medical insurance;</li> <li>Co-working and gym/sports reimbursement;</li> <li>The opportunity to receive a reward for the most innovative idea that the company can patent, fostering a culture of creativity and innovation.</li> </ul><p></p><p>By applying for this position, you consent to the processing of your personal data as described in our Privacy Policy (<a href=\"https://cloudlinux.com/candidate-privacy-notice\" rel=\"nofollow noreferrer noopener\" class=\"external\">https://cloudlinux.com/candidate-privacy-notice</a>), which provides detailed information on how we maintain and handle your data.</p>","tags":"[\"Finance\",\"database\"]","pubDate":"2024-11-19 00:00:00.000","link":"https://apply.workable.com/cloudlinux-1/j/BD4272853D","savedDate":"2024-11-21 04:40:16.468","slug":"hr-assistant-remote-only-opportunity-location-europe-cis-cloudlinux-8980"},{"id":2921250279,"title":"SEO Outreach Specialist","company":"Skrapp.io","image":"https://remotive.com/job/1951743/logo","description":"<p>Skrapp.io is seeking a proactive and strategic <strong>Outreach Specialist</strong> to join our team. This role is pivotal in building and maintaining relationships that drive the success of our SEO and digital marketing initiatives. The ideal candidate is a natural networker, highly organized, and has a strong understanding of SEO and link-building strategies.</p>\n<p> </p>\n<p><strong>Key Responsibilities:</strong></p>\n<p><strong> </strong></p>\n<p><strong>Backlink Acquisition</strong></p>\n<ul style=\"\">\n<li style=\"\">Identify opportunities for gaining high-quality backlinks by reaching out to relevant websites, influencers, and bloggers.</li>\n<li style=\"\">Develop personalized outreach strategies to ensure maximum success in backlink acquisition efforts.</li>\n</ul>\n<p><strong>Relationship Building</strong></p>\n<ul style=\"\">\n<li style=\"\">Establish and nurture connections with webmasters, bloggers, and industry influencers.</li>\n<li style=\"\">Negotiate guest posting opportunities, content collaborations, or mention placements to build mutually beneficial relationships.</li>\n</ul>\n<p><strong>Content Promotion</strong></p>\n<ul style=\"\">\n<li style=\"\">Promote content to external platforms to expand its reach and visibility.</li>\n<li style=\"\">Pitch shareable content to relevant websites for syndication or sharing.</li>\n</ul>\n<p><strong>Guest Blogging</strong></p>\n<ul style=\"\">\n<li style=\"\">Write or coordinate the creation of guest posts on third-party websites that strategically include backlinks to our target website.</li>\n</ul>\n<p><strong>Competitor Research</strong></p>\n<ul style=\"\">\n<li style=\"\">Analyze competitor backlink profiles to uncover potential opportunities and refine outreach strategies.</li>\n<li style=\"\">Identify and leverage content or backlink gaps for a competitive edge.</li>\n</ul>\n<p><strong>Link Monitoring and Reporting</strong></p>\n<ul style=\"\">\n<li style=\"\">Track acquired backlinks to ensure they remain active and valuable.</li>\n<li style=\"\">Regularly report on outreach effectiveness and the impact of link-building campaigns.</li>\n</ul>\n<p><strong>Collaboration with Content Teams</strong></p>\n<ul style=\"\">\n<li style=\"\">Work closely with content creators to develop high-quality, shareable content that adds value to external websites and audiences.</li>\n</ul>\n<p><strong>Competitor Analysis</strong></p>\n<ul style=\"\">\n<li style=\"\">Examine SEO strategies of competitors to uncover new opportunities and innovative approaches.</li>\n<li style=\"\">Identify and act on content or backlink opportunities based on competitor research.</li>\n</ul>\n<p><strong>Monitoring and Reporting</strong></p>\n<ul style=\"\">\n<li style=\"\">Track metrics such as rankings, organic traffic, click-through rates (CTR), and conversion rates.</li>\n<li style=\"\">Provide stakeholders with actionable reports on SEO performance and adjust strategies based on data insights.</li>\n</ul>\n<p><strong>Staying Updated with SEO Trends</strong></p>\n<ul style=\"\">\n<li style=\"\">Keep up-to-date with search engine algorithm changes and industry trends.</li>\n<li style=\"\">Adjust outreach and SEO strategies to align with the latest updates and best practices.</li>\n<li style=\"\">Attend industry conferences, participate in online communities, and follow authoritative SEO resources to stay ahead.</li>\n</ul>\n<p><strong> </strong></p>\n<p><strong>Requirements</strong></p>\n<ul style=\"\">\n<li style=\"\">5-10 years of experience in successfully executing SEO outreach strategies and other aspects of SEO.</li>\n<li style=\"\">Understanding of search engine algorithms and ranking methods.</li>\n<li style=\"\">Experience with SEO industry programs, such as Google Analytics.</li>\n<li style=\"\">Knowledge of keyword research and data mining tools.</li>\n<li style=\"\">Able to complete competitive analysis of other companies within the industry.</li>\n<li style=\"\">Excellent written and verbal communication skills (email, phone, etc.).</li>\n<li style=\"\">Comfortable analyzing high volumes of data on a daily basis.</li>\n<li style=\"\">Familiarity with SEO tools like SEMrush, AHrefs, Similarweb, Moz, and Google Search Console.</li>\n<li style=\"\">Experience with other aspects of marketing, such as customer growth and promotion, is a plus.</li>\n</ul>\n<p><strong> </strong></p>\n<p><strong>Benefits</strong></p>\n<p><strong><em><u> </u></em></strong></p>\n<p><em><u>Contract</u></em></p>\n<p>We only offer contractor/freelancer contracts to our team members with yearly paid days off:</p>\n<p><strong>- 25</strong> days per year</p>\n<p><strong>- 5</strong> national days off per year per choice depending on your country of residence</p>\n<p>The contractor will pay for your local health insurance and retirement plan independently.<em><br><br><u>Work Environment</u></em></p>\n<p>We are a team of young professionals working remotely from Spain, France, Egypt, India, Brazil, USA, and the United Arab Emirates. The position is fully remote; you will enjoy flexible working hours from anywhere worldwide.</p>\n<p><u> </u></p>\n<p><strong>Note</strong></p>\n<p>Please be aware that the default job country listed in our job posting is a requirement of our Applicant Tracking System (ATS) and does not reflect any geographic restrictions for this position.</p>\n<p>We welcome applications from candidates <strong>worldwide</strong>, regardless of location. This role is open to individuals from all countries.</p>\n<img src=\"https://remotive.com/job/track/1951743/blank.gif?source=public_api\" alt=\"\"/>","tags":"[\"seo\",\"research\",\"analytics\",\"digital marketing\",\"google analytics\",\"ATS\",\"SEMRush\",\"insurance\"]","pubDate":"2024-11-18 16:13:01.000","link":"https://remotive.com/remote-jobs/marketing/seo-outreach-specialist-1951743","savedDate":"2024-11-21 04:40:16.467","slug":"seo-outreach-specialist-skrapp-io-1898"},{"id":8774888221,"title":"Senior C Developer (worldwide remote, work anywhere)","company":"CloudLinux","image":"https://pbs.twimg.com/profile_images/696718028084482050/ymY3OEPk_400x400.png","description":"<p>CloudLinux is a global remote-first company. We are driven by our principles: do the right thing, employees first, we are remote first, and we deliver high volume, low-cost Linux infrastructure and security products that help companies to increase the efficiency of their operations. Every person on our team supports each other and does what we can to ensure we all are successful.&nbsp;</p><p>CloudLinux OS, our flagship product, runs on over 50,000 production servers today, powering over 40 million websites, and is recognised as the best OS for security and efficiency in a shared hosting environment. CloudLinux OS increases server density and enhances security, thus reducing operating costs, decreasing churn rates, and increasing profitability.</p><p>We are looking for a talented Senior C Developer to join our CloudLinuxOS team. The supported projects include:</p><ul> <li>Apache2Nginx</li> <li>Mod_lsapi</li> <li>MySQL Governor with MySQL/MariaDB support</li> <li>Mod_hosting_limits – for limiting incoming requests</li> <li>Python/NodeJS/Ruby selectors, part related to Passenger</li> </ul><p></p><p>More details about the project can be found on the <a href=\"https://cloudlinux.com/\" rel=\"nofollow noreferrer noopener\" class=\"external\">product website</a> and<a href=\"https://docs.cloudlinux.com/cloudlinuxos/cloudlinux_os_components/\" rel=\"nofollow noreferrer noopener\" class=\"external\"> our documentation.</a></p><h3>Requirements: </h3><p><strong>To thrive in this role, we are looking for someone who has:</strong></p><ul> <li>5+ years of experience in C.</li> <li>Good Linux/Unix proficiency, with experience in RHEL/CentOS/AlmaLinux.</li> <li>Experience with POSIX programming in C.</li> <li>Experience with thread programming in C.</li> <li>Ability to work with various build systems like autotools, make and cmake.</li> <li>Experience in debugging (mostly gdb and command line).</li> <li>Experience with Shell scripting.</li> <li>Strong knowledge of Linux development tools and Linux system software development.</li> <li>Hands-on profiling tools like Linux perf, etc.</li> <li>Experience in the development of multi-threaded applications and IPC.</li> <li>Knowledge, understanding, and ability to select and analyze the performance of classical algorithms and data structures.</li> <li>Strong understanding of the network stack, particularly TCP/IP and HTTP.</li> <li>Experience in monitoring deployments and application performance.</li> <li>Ability to identify and troubleshoot emerging issues and optimize the application for performance and scalability.</li> <li>Proficient in Git.</li> <li>Knowledge of English at upper-intermediate and higher levels.<br> </li> </ul><p><strong>Would be a plus:</strong></p><ul> <li>Experience in system programming.</li> <li>Experience in the development of web-server modules: Nginx, Apache/OpenLiteSpeed and understanding of the web-server architecture and workflow.</li> <li>Experience with Coraza, ModSecurity.</li> <li>Knowledge of Python and/or Go.</li> <li>Experience in modifying/maintaining open-source projects.</li> <li>Knowledge of Internet security basics.</li> </ul><h3>Benefits: </h3><p><strong>What's in it for you?</strong></p><ul><ul> <li>A focus on professional development.</li> <li>Interesting and challenging projects.</li> <li>Fully remote work with flexible working hours, that allows you to schedule your day and work from any location worldwide.</li> <li>Paid 24 days of vacation per year, 10 days of national holidays, and unlimited sick leaves.</li> <li>Compensation for private medical insurance.</li> <li>Co-working and gym/sports reimbursement.</li> <li>Budget for education.</li> <li>The opportunity to receive a reward for the most innovative idea that the company can patent.</li> </ul></ul><p></p><p><em>By applying for this position, you consent to the processing of your personal data as described in our Privacy Policy (</em><a href=\"https://cloudlinux.com/candidate-privacy-notice\" target=\"_blank\" rel=\"nofollow noreferrer noopener\" class=\"external\"><em>https://cloudlinux.com/candidate-privacy-notice</em></a><em>), which provides detailed information on how we maintain and handle your data.</em></p>","tags":"[\"mysql\"]","pubDate":"2024-11-18 00:00:00.000","link":"https://apply.workable.com/cloudlinux-1/j/294331364A","savedDate":"2024-11-21 04:40:16.468","slug":"senior-c-developer-worldwide-remote-work-anywhere-cloudlinux-350"},{"id":4840820014,"title":"Senior Business Analyst - Insurance (Fully Remote)","company":"CoverGo","image":"https://pbs.twimg.com/profile_images/1382655628523364355/MWPIbbID_400x400.jpg","description":"<h3><strong>Top 3 Reasons To Join Us</strong></h3><ul> <li>Competitive Salary</li> <li>100% Remote</li> <li>Working on the latest tech for the Insurtech Market Leader</li> </ul><h3><strong>About Us</strong></h3><p>At CoverGo, our mission is to empower all insurance companies to make insurance 100% digital and accessible to everyone.</p><ul> <li>We are a leading global no-code insurance platform for health, life, and P&amp;C</li> <li>We’re the winner of the Insurtech of the Year in all of Asia and other awards globally</li> <li>We work with insurance enterprise clients such as AXA, Bupa, MSIG, Dai-ichi, Bank of China Group Insurance, and many more</li> <li>We're an international, diverse team of over 120 people with 30 nationalities and team members working remotely from all over the world</li> <li>We are fully funded and backed by reputable VC funds and strategic institutional investors</li> <li>We have a global presence in Asia, EMEA and the Americas</li> <li>We’ve grown our annualized revenue by over 30x since January 2021</li> <li>We’re constantly working towards making CoverGo a workplace that you love coming to. We deeply believe that bringing together a diversity of thoughts, expressions, and perspectives is key to building the best culture for equally diverse communities all over the world</li> </ul><h3><strong>What You Will Do:</strong></h3><ul> <li>Work with clients and technical resources to identify their business problems and develop the right approach and analytical solution</li> <li>Plan and design simple to semi-complex business processes and system modifications</li> <li>Make recommendations to improve and support business activities</li> <li>Gather business requirements through a variety of techniques such as work sessions and interviews then analyze and document client complex business requirements and processes; communicate these requirements to appropriate parties</li> <li>Create complex test case scenarios to be used in testing; monitor/oversee the testing of business applications to verify that all client requirements are incorporated into the system design</li> <li>Develop business requirements documents/user stories to support the required modifications</li> <li>May plan, allocate and monitor work of other business analysts</li> <li>Understand simple to complex systems and related data to surface actionable insights, demonstrate sound judgment and decision-making skills</li> <li>Assist in providing time estimates for project related tasks</li> <li>Aid in updating process and procedural documentation</li> <li>Develop basic understanding of technical development cycle of mobile application or web portals</li> <li>Support QA, UAT and Release phases of the project via defect analysis, change maintenance, etc.</li> <li>Any other task that may be assigned</li> </ul><h3><strong>What We Need:</strong></h3><ul> <li>Minimum 5 years of experience as Business Analyst</li> <li>A degree in Business, IT or any relevant field</li> <li>Previous experience working in the insurance industry (health, life, P&amp;C) is required </li> <li>Insurtech experience is preferred</li> <li>Health Insurance-related domain certification from INS/LOMA or III is an added advantage</li> <li>Knowledge of business analysis concepts of defining requirements, translating to technical solutions, and Agile approach to prioritizing work to epics, sprints</li> <li>Business analysis skills including facilitation, process documentation, requirements gathering and user acceptance testing</li> <li>Good organizational/time management skills to prioritize work and meet deadlines within defined timeframes</li> <li>Experience in an Agile and/or Scrum environment is a must</li> <li>Basic knowledge in generating process documentation, and document system functionality, data integration, and workflow</li> <li>Excellent written and verbal communication skills in English</li> <li>Technical writing skills is a plus</li> </ul><h3><strong>Why You'll Love Working Here</strong></h3><ul> <li>Fully Remote</li> <li>Flexible Leave</li> <li>International Environment</li> <li>Competitive renumeration package</li> <li>Performance Bonus</li> <li>Stock Options after 6 months </li> <li>Company activities and events</li> <li>Learning and development plan</li> <li>Remote work allowance</li> </ul><p><strong>CoverGo Company </strong><a href=\"https://www.youtube.com/watch?v=YI0ezLxvFvA\" rel=\"nofollow noreferrer noopener\" class=\"external\"><strong>Video</strong></a></p><p>By submitting your application, you confirm that you have read, understood, and accepted the content of CoverGo’s <a href=\"https://apply.workable.com/covergo/gdpr_policy?lng=en\" target=\"_blank\" rel=\"nofollow noreferrer noopener\" class=\"external\">Privacy Notice</a> and you consent to the processing of your data as part of this application.</p><p><a href=\"https://www.youtube.com/watch?v=YI0ezLxvFvA\" rel=\"nofollow noreferrer noopener\" class=\"external\"></a></p><h3>Requirements: </h3><h3>Benefits: </h3>","tags":"[\"management\"]","pubDate":"2024-11-18 00:00:00.000","link":"https://apply.workable.com/covergo/j/54DC5859AA","savedDate":"2024-11-21 04:40:16.469","slug":"senior-business-analyst-insurance-fully-remote-covergo-4173"}]