[{"id":4945074708,"title":"Investment Analyst (Blockchain)","company":"Status","image":"https://pbs.twimg.com/profile_images/966759182589308928/s5rZXoWk_400x400.jpg","description":"\n    <div class=\"content-intro\"><p style=\"text-align: justify;\"><strong>About Status</strong></p>\n<p style=\"text-align: justify;\"><span style=\"font-weight: 400;\">Status is building the tools and infrastructure for the advancement of a secure, private, and open web3.&nbsp;</span></p>\n<p style=\"text-align: justify;\"><span style=\"font-weight: 400;\">With the high level goals of preserving the right to privacy, mitigating the risk of censorship, and promoting economic trade in a transparent, open manner, Status is building a community where anyone is welcome to join and contribute.</span></p>\n<p style=\"text-align: justify;\"><span style=\"font-weight: 400;\">As an organization, Status seeks to push the web3 ecosystem forward through research, creation of developer tools, and support of the open source community.&nbsp;</span></p>\n<p style=\"text-align: justify;\"><span style=\"font-weight: 400;\">As a product, Status is an open source, Ethereum-based app that gives users the power to chat, transact, and access a revolutionary world of DApps on the decentralized web. But Status is also building foundational infrastructure for the whole Ethereum ecosystem, including the Nimbus ETH 1.0 and 2.0 clients, the Keycard hardware wallet, and the Waku messaging protocol; the p2p communication layer for Web3.</span></p>\n<p style=\"text-align: justify;\"><span style=\"font-weight: 400;\">As a team, Status has been completely distributed since inception.&nbsp; Our team is currently 200+ core contributors strong, and welcomes a growing number of community members from all walks of life, scattered all around the globe.&nbsp;</span></p>\n<p style=\"text-align: justify;\"><span style=\"font-weight: 400;\">We care deeply about open source, and our organizational structure has minimal hierarchy and no fixed work hours. We believe in working with a high degree of autonomy while supporting the organization's priorities.</span></p></div>\n\n    <div class=\"careers-block__trix external-panel text-left\">\n<p>&nbsp;</p>\n<p>&nbsp;</p>\n<p><strong>Key responsibilities:</strong></p>\n<ul>\n<li>Research the market and identify, qualify and perform deep-dive analysis on new web3 investment opportunities, both including tradeable tokens and early-stage VC-style investments;</li>\n<li>Gather information from industry experts and be an SME within the team for industry and market trends;</li>\n<li>Screen for deals, conduct calls with management teams, and prepare call notes;</li>\n<li>Prepare investment memos for review and decision;</li>\n<li>Execute and then monitor agreed investments, providing reports and updates as required by the organisation;</li>\n<li>Develop and maintain relationships with peers in other projects, foundations and venture capital firms.</li>\n</ul>\n<p><strong>You ideally will have:</strong></p>\n<ul>\n<li>Experience in, and passion for, blockchain technology;</li>\n<li>A strong alignment to our principles:<a href=\"https://status.im/about/#our-principles\"> https://status.im/about/#our-principles</a>;</li>\n<li>Strong financial maths skills, including cash flow modelling, investment valuation techniques, return metrics, APY;</li>\n<li>Outstanding research and analytical skills;</li>\n<li>Ability to produce well designed and structured written materials with clear messaging and decision points;</li>\n<li>At least 1 year of professional investment experience (in the field of investment analysis of a Cryptocurrency Organisation, Venture Capital, Private Equity or Investment Banking Company);</li>\n<li>Hands-on experience trading crypto assets (and be willing to provide evidence of this);</li>\n<li>A deep understanding of DeFi and its underlying technology;</li>\n<li>A security mindset and knowledge and experience of risk management, including how to identify, quantify and hedge relevant risks.</li>\n</ul>\n<p><strong>Bonus points if:</strong></p>\n<ul>\n<li>You have experience working for an open-source organisation;</li>\n<li>You have working knowledge of a programming language (e.g. Python) and developer tools and workflows (e.g. Markdown, Git);</li>\n<li>You have experience of end-to-end deal making, from research of opportunities to final execution of the deal.</li>\n</ul>\n<p><em>[Don’t worry if you don’t meet all of these criteria, we’d still love to hear from you anyway if you think you’d be a great fit for this role. Just explain to us why in your cover letter].</em></p>\n<p><strong>Hiring process:</strong></p>\n<ol>\n<li>Introduction call with the Talent team</li>\n<li>Interview with Head of Finance and Finance team member</li>\n<li>Paid project (2-3 hours of work)</li>\n<li>Interview co-founder</li>\n</ol>\n<p><strong>Compensation:</strong></p>\n<p>We are happy to pay in either 100% fiat or any mix of fiat and/or crypto.</p>\n</div>\n\n    \n\n    \n","tags":"[\"Finance\",\"management\"]","pubDate":"2023-11-25 14:15:23.080","link":"https://boards.greenhouse.io/embed/job_app?for=status72&token=5509837&b=https%3A%2F%2Fjobs.status.im%2F","savedDate":"2023-11-25 14:15:23.080","slug":"investment-analyst-blockchain-status-1238"},{"id":7421460858,"title":"Test Infrastructure Technical Lead (Remote/Anywhere)","company":"Collabora","image":"https://pbs.twimg.com/profile_images/1545121577632763912/7FMnABb0_400x400.jpg","description":"<div class=\"section page-centered\" data-qa=\"job-description\"><div>Collabora is looking for a strong technical leader to help further develop and grow the existing Test Infrastructure efforts.</div><div><br></div><div>The  team's primary focus is the development, integration and deployment of  Open Source Continuous Integration and Automated Testing systems within  upstream projects. </div></div><div class=\"section page-centered\"><div><h3> Responsibilities</h3><ul class=\"posting-requirements plain-list\"><ul><li>Monitor and identify areas of improvement for existing upstream Continuous Integration systems</li><li>Implement the CI system by integrating the required dependencies, building the  code at test, deploying it to the device under testing, executing the  tests and distributing and presenting the results</li><li>Understand client needs and reconcile time constraints, available technologies and resources and Open Source best practices</li><li>Ability to define technical approach/architecture of a project and maintain the proper documentation</li><li>Ability to make day-to-day technical decisions for a project and align them with the overall strategy</li><li>Leadership and exemplary representation within the Open Source community</li><li>Ability to act as primary point of contact during client calls for technical matters</li><li>Ownership of the estimation process and ability to write thorough technical proposals</li><li>Represent Collabora at conferences and trade shows to demonstrate and promote our leadership in the open source arena</li></ul></ul></div></div><div class=\"section page-centered\"><div><h3>Required Skills</h3><ul class=\"posting-requirements plain-list\"><ul><li>Good understanding of Continuous Integration systems</li><li>Experience with Web Services Architecture and Implementation</li><li>Experience with GitLab CI/CD and/or GitHub Actions</li><li>Experience with Python and Python Web frameworks such as Django, Flask, FastAPI etc.</li><li>Knowledge of open source development methodologies and relevant open source communities</li><li>Good English language skills (both verbal and written)</li><li>Ability to work and communicate in a fully distributed environment, completely online</li></ul></ul></div></div><div class=\"section page-centered\"><div><h3>Desirable Skills</h3><ul class=\"posting-requirements plain-list\"><ul><li>Familiarity with the upstream Linux kernel development workflow</li><li>Embedded development experience (firmware, bootloaders, kernel, BSP)</li><li>SysAdmin/DevOps experience</li><li>Fluency with Kubernetes</li></ul></ul></div></div><!--[2022-11-28] [GOLD-2535] Remove payTransparencyV1 when feature flag is fully removed--><div class=\"section page-centered\" data-qa=\"closing-description\"><div>Collabora  is a software consultancy specialising in bringing companies and the  Open Source community together. We combine years of Open Source software  leadership with an understanding of the challenges that businesses,  non-profits and governments face. Collabora brings deep technical  expertise in system integration &amp; architecture, graphics,  multimedia, web engines and communications to a number of market  verticals, including mobile, IVI / automotive, set top box / smart TV,  and a range of other specialised embedded applications.</div><div><br></div><div>Collabora  has the unique business model of enabling enterprises to leverage Open  Source software in their solutions. Having worked with notable industry  leading companies in the automotive, aerospace and handset mobile  verticals amongst many others, Collabora has established a broad  customer portfolio.</div><div><br></div><div><br></div><div><br></div><div><br></div><div>#LI-Remote</div><div><br></div><div><br></div></div><div class=\"section page-centered last-section-apply\" data-qa=\"btn-apply-bottom\"><a class=\"postings-btn template-btn-submit hex-color\" data-qa=\"show-page-apply\" href=\"https://jobs.lever.co/collabora/ffa46210-7d97-4882-8f71-496d38c622d6/apply\">Apply for this job</a></div>","tags":"[]","pubDate":"2023-11-25 14:15:23.080","link":"https://jobs.lever.co/collabora/ffa46210-7d97-4882-8f71-496d38c622d6","savedDate":"2023-11-25 14:15:23.080","slug":"test-infrastructure-technical-lead-remote-anywhere-collabora-6572"},{"id":1441490601,"title":"Data Analyst ","company":"Sourcegraph","image":"https://pbs.twimg.com/profile_images/1428393724527190022/4mt5PACL_400x400.png","description":"\n    <div class=\"content-intro\"><h3>ALL SOURCEGRAPH ROLES ARE FULLY REMOTE</h3>\n<h2><span style=\"color: #a112ff;\">Who we are</span></h2>\n<p>Our mission at Sourcegraph is to make it so that&nbsp;<a class=\"c-link\" href=\"https://handbook.sourcegraph.com/strategy-goals/strategy\" target=\"_blank\" data-stringify-link=\"https://handbook.sourcegraph.com/strategy-goals/strategy\" data-sk=\"tooltip_parent\">everyone can code</a>, not just ~0.1% of the population. Our code graph powers Cody, the most powerful and accurate AI coding assistant, as well as our Code Search product, which helps devs explore their entire codebase and make large-scale migrations and security fixes. We’re building software that builds software, and in doing so we’re making devs more productive and preparing for a world where a lot more code gets written.</p>\n<p>It’s an exciting time to join Sourcegraph. AI has taken over the world, and we’ve spent the last 10 years building infrastructure that’s integral to making AI generated code more powerful and accurate. Our customers include 4/5 FAANG companies, 4 of the top 10 banks, government organizations, Uber, Plaid, and many other companies building the software that pushes the world forward. We’ve raised $225M at a $2.625B valuation from <a class=\"c-link\" href=\"https://techcrunch.com/2021/07/13/sourcegraph-raises-125m-series-d-on-2-6b-valuation-for-universal-code-search-tool/\" target=\"_blank\" data-stringify-link=\"https://techcrunch.com/2021/07/13/sourcegraph-raises-125m-series-d-on-2-6b-valuation-for-universal-code-search-tool/\" data-sk=\"tooltip_parent\">Andreessen Horowitz</a>,&nbsp;<a class=\"c-link\" href=\"https://about.sourcegraph.com/blog/series-c-with-sequoia/\" target=\"_blank\" data-stringify-link=\"https://about.sourcegraph.com/blog/series-c-with-sequoia/\" data-sk=\"tooltip_parent\">Sequoia</a>,&nbsp;<a class=\"c-link\" href=\"https://www.redpoint.com/companies/sourcegraph/\" target=\"_blank\" data-stringify-link=\"https://www.redpoint.com/companies/sourcegraph/\" data-sk=\"tooltip_parent\">Redpoint</a>,&nbsp;<a class=\"c-link\" href=\"https://medium.com/craft-ventures/why-we-invested-in-sourcegraph-5ace28317e3d\" target=\"_blank\" data-stringify-link=\"https://medium.com/craft-ventures/why-we-invested-in-sourcegraph-5ace28317e3d\" data-sk=\"tooltip_parent\">Craft</a>&nbsp;and others. We’re making ambitious bets on our future and we’re looking to hire exceptional people to join our team as we make Sourcegraph one of the biggest and most influential companies in the world.</p></div>\n\n    <h2><span style=\"color: rgb(140, 51, 236);\"><strong>Working hours</strong></span></h2>\n<p>🌎 Given that we are an all-remote company and hire <a href=\"https://handbook.sourcegraph.com/departments/people-ops/process/how-we-engage-talent-outside-the-us/\">almost anywhere</a> in the world, we don’t have a location requirement for this role. However, your working hours must overlap with 9am - 6pm EST for at least 20 hours/week.</p>\n<h2><span style=\"color: rgb(140, 51, 236);\"><strong>Why this job is exciting</strong></span></h2>\n<p>We’re looking for a Data Analyst to help grow our values-driven, all-remote team. In this role, you will have the opportunity to make an impact on the direction of our business at a critical moment both for us, and for the industry. The demand for data and analytics at Sourcegraph is growing rapidly, and you will help our team level-up by scaling our tools, technology, and processes to meet the need.&nbsp;<br><br>Your analysis will be used by nearly every team at the company - including executive-level decision-makers - to make mission critical decisions and answer our company’s most important questions. This could involve work like:&nbsp;</p>\n<ul>\n<li>&nbsp;Analyzing user retention to understand why some users come back, but others don’t</li>\n<li>Completing&nbsp; an analysis dropoff in our signup funnel, with the goal of getting more users to try our product</li>\n<li>Providing our marketing stakeholders with an analysis of inbound traffic from marketing campaigns to determine which sources offer the best ROI</li>\n</ul>\n<p>There’s a wide variety of work to be done, and there will be room for you to choose projects that interest you, and make decisions about where your contributions will be the most impactful. We strive to make Sourcegraph the best company where exceptionally talented people can thrive. If you join us, we know you’ll make a big impact!&nbsp; Here’s what we’re thinking:.&nbsp;</p>\n<p>📅 Within one month, you will…</p>\n<ul>\n<li>Become familiar with our product and value propositions by completing demos, shadowing team members, attending training sessions, and exploring our data</li>\n<li>Onboard onto our current company metrics and reporting, team priorities, and data infrastructure</li>\n<li>Get to know members of the Data &amp; Analytics and Operations teams, as well as the other members of teams you will be supporting (such as Product, Marketing, Sales, Technical Success, )</li>\n<li>Complete an onboarding project that reinforces your learnings from the first month (e.g. work with the product teams to understand usage around a particular feature )</li>\n</ul>\n<p>📅 Within three months, you will…</p>\n<ul>\n<li>Take on projects that support our key stakeholders across the business in making great, informed decisions</li>\n<li>Monitor our company’s key performance indicators, and proactively&nbsp; investigate and communicate changes</li>\n<li>Answer ad hoc data questions and requests from teams across the company</li>\n</ul>\n<p>📅 Within six months, you will…</p>\n<ul>\n<li>Build and maintain data pipelines, dashboards, and reporting for various teams to help them understand progress towards key metrics and goals</li>\n<li>Proactively offer analysis and recommendations to other teams, based on your familiarity with our data and with our company’s key priorities</li>\n<li>Help improve our data enablement efforts to make it easier for everyone to effectively use our data tools</li>\n</ul>\n<p>📅 Within one year, you will…</p>\n<ul>\n<li>Become a go-to expert on our analytics stack - writing efficient data transformations, analyzing and visualizing many different types of data for a variety of stakeholders, and enabling others at the company to do the same</li>\n<li>Help define the future state of our analytics organization!</li>\n</ul>\n<h2><span style=\"color: rgb(140, 51, 236);\"><strong>About you&nbsp;</strong></span></h2>\n<p>You are interested in driving business decisions with quantitative data and contributing to Sourcegraph’s journey to be a data-informed organization. You’re motivated by helping others answer their toughest questions. You love jumping into complex problems and finding innovative solutions.&nbsp; You have a knack for juggling competing priorities.&nbsp; You are strongly aligned with our values, inspired by our mission to make it so that everyone can code, and motivated to do your best work at Sourcegraph.</p>\n<p>Qualifications:</p>\n<ul>\n<li>You have relevant domain knowledge and experience in analytical roles (analytics, operations, data engineering, data science, etc.)</li>\n<li>You have experience working with SQL and business intelligence tools, such as Looker or Tableau</li>\n<li>You’re familiar with datasets from a multitude of sources, such as Salesforce, HubSpot or Zendesk</li>\n<li>You’re an independent self-starter who can prioritize and execute multiple tasks simultaneously</li>\n<li>You have excellent verbal/written communication and presentation skills, including an ability to effectively communicate with both business and technical teams</li>\n<li>Your working hours overlap with 9am-5pm EST for at least 20 hours per week, so we have time to collaborate synchronously when necessary</li>\n</ul>\n<p>Nice to haves:</p>\n<ul>\n<li>Experience working with product, engineering, and design team stakeholders to understand in-product user behavior (i.e retention analysis, user funnels, etc)</li>\n<li>Experience with ETL processes and tooling&nbsp;</li>\n<li>Experience working remotely, with stakeholders in different time zones</li>\n<li>Understanding of software development tools, technologies, and processes</li>\n</ul>\n<h2><span style=\"color: rgb(140, 51, 236);\"><strong>Level</strong></span></h2>\n<p>📊 This job is an IC1.&nbsp; You can read more about <a href=\"https://handbook.sourcegraph.com/benefits-pay-perks/pay-expenses/compensation/leveling-guide/\">our job leveling philosophy</a> in our Handbook.</p>\n<h2><span style=\"color: rgb(140, 51, 236);\"><strong>Compensation</strong></span></h2>\n<p><strong>💸 We pay you an above-average salary</strong> because we want to hire the best people who are fully focused on helping Sourcegraph succeed, not worried about paying bills. You will have the flexibility to work and live anywhere in the world<em> (unless specified otherwise in the job description)</em>, and we’ll never take your location or current/past salary information into account when determining your compensation.&nbsp; As an <a href=\"https://handbook.sourcegraph.com/company-info-and-process/values/#sts=Open%20and%20transparent\">open and transparent </a>company that values equitable and competitive compensation for everyone, our <a href=\"https://handbook.sourcegraph.com/benefits-pay-perks/pay-expenses/compensation/\">compensation ranges are visible</a> to every single Sourcegraph Teammate. To determine your salary, we use a number of market and data-driven salary sources and target the high-end of the range, ensuring that we’re always paying above market regardless of where you live in the world.&nbsp;&nbsp;</p>\n<p>💰 The target compensation for this role is $ $96,609.00 USD base.</p>\n<p>📈 In addition to our cash compensation, we offer equity (because when we succeed as a company, we want you to succeed, too) and generous <a href=\"https://handbook.sourcegraph.com/benefits-pay-perks/benefits-perks/\">perks &amp; benefits</a>.</p>\n<h2><span style=\"color: rgb(140, 51, 236);\"><strong>Interview process&nbsp;</strong></span></h2>\n<p><em>Below is the interview process you can expect for this role (you can read more about </em><a href=\"https://handbook.sourcegraph.com/talent/types_of_interviews\"><em>the types of interviews</em></a><em> in our Handbook). It may look like a lot of steps, but rest assured that we move quickly and the steps are designed to help you get the information needed to determine if we’re the right fit for you… Interviewing is a two-way street, after all!&nbsp;</em></p>\n<p>We expect the interview process to take 4.5 hours in total.</p>\n<p><strong>👋 Introduction Stage</strong> - we have initial conversations to get to know you better…</p>\n<ul>\n<li>[30m] <a href=\"https://handbook.sourcegraph.com/departments/people-talent/talent/process/types_of_interviews/#recruiter-screen\">Recruiter Screen</a> - Kelsey Nagel</li>\n<li>[60m] <a href=\"https://handbook.sourcegraph.com/departments/people-talent/talent/process/types_of_interviews/#hiring-manager-screen\">Hiring Manager Screen</a> / <a href=\"https://handbook.sourcegraph.com/departments/people-talent/talent/process/types_of_interviews/#resume-deep-dive\">Resume Deep Dive</a> - Kelsey Brown</li>\n</ul>\n<p><strong>🧑‍💻 Team Interview Stage</strong> - we then delve into your experience in more depth and introduce you to members of the team, including cross-functional partners…</p>\n<ul>\n<li>[60m] Take-home project review (requires preparation)</li>\n<li>[60m] Cross-functional interview</li>\n</ul>\n<p><strong>🎉 Final Interview Stage </strong>- we move you to our final round, where you gain a better understanding of our business and values holistically…</p>\n<ul>\n<li>[30m] <a href=\"https://handbook.sourcegraph.com/departments/people-talent/talent/process/types_of_interviews/#values-interview\">Values Interview</a></li>\n<li>[30m] <a href=\"https://handbook.sourcegraph.com/departments/people-talent/talent/process/types_of_interviews/#leadership-interview\">Leadership Interview</a> with a member of the executive team&nbsp;</li>\n<li>We check references and conduct your background check</li>\n</ul>\n<p>Please note - you are welcome to request additional conversations with anyone you would like to meet, but didn’t get to meet during the interview process.</p>\n\n    \n\n    <div class=\"content-conclusion\"><h2><span style=\"color: #a112ff;\">Not sure if this is you?</span></h2>\n<p><span style=\"font-weight: 400;\">We want a diverse, global team, with a broad range of experience and perspectives. If this job sounds great, but you’re not sure if you qualify, apply anyway! We carefully consider every application, and will either move forward with you, find another team that might be a better fit, keep in touch for future opportunities, or thank you for your time.</span></p>\n<h2><span style=\"color: #a112ff;\">Learn more about us</span></h2>\n<p><span style=\"font-weight: 400;\">To create a product that serves the needs of all developers, we are building a diverse </span><a href=\"https://handbook.sourcegraph.com/company-info-and-process/remote\"><span style=\"font-weight: 400;\">all-remote team</span></a><span style=\"font-weight: 400;\"> that is </span><a href=\"https://handbook.sourcegraph.com/team\"><span style=\"font-weight: 400;\">distributed across the world</span></a><span style=\"font-weight: 400;\">. Sourcegraph is an equal opportunity workplace; we welcome people from all backgrounds and communities.&nbsp;</span></p>\n<p><span style=\"font-weight: 400;\">We provide </span><a href=\"https://about.sourcegraph.com/handbook/people-ops/compensation\"><span style=\"font-weight: 400;\">competitive compensation</span></a><span style=\"font-weight: 400;\"> and </span><a href=\"https://about.sourcegraph.com/handbook/people-ops/benefits-and-perks\"><span style=\"font-weight: 400;\">practical benefits</span></a><span style=\"font-weight: 400;\"> to keep you happy and healthy so that you can do your best work.&nbsp;</span><span style=\"font-weight: 400;\">&nbsp;</span></p>\n<p><span style=\"font-weight: 400;\">Learn more about what it is like to work at Sourcegraph by reading </span><a href=\"https://about.sourcegraph.com/handbook/\"><span style=\"font-weight: 400;\">our handbook</span></a><span style=\"font-weight: 400;\">.</span></p>\n<p><span style=\"font-weight: 400;\">We want to ensure Sourcegraph is an environment that suits your working style and empowers you to do your best work, so we are eager to answer any questions that you have about us at any point in the interview process.</span></p>\n<p><span style=\"font-weight: 400;\">Go back to the </span><a href=\"https://about.sourcegraph.com/jobs/\"><span style=\"font-weight: 400;\">careers page</span></a><span style=\"font-weight: 400;\"> for all open positions.</span></p>\n<p>&nbsp;</p>\n<p><em><span style=\"font-weight: 400;\">Sourcegraph participates in <a href=\"https://handbook.sourcegraph.com/departments/people-talent/e-verify/\" target=\"_blank\">E-Verify</a> for U.S. Employees</span></em></p></div>\n","tags":"[\"engineering\"]","pubDate":"2023-11-25 14:15:23.079","link":"https://boards.greenhouse.io/sourcegraph91/jobs/5025981004","savedDate":"2023-11-25 14:15:23.079","slug":"data-analyst-sourcegraph-646"},{"id":5198461465,"title":"Developer Advocate (based in San Francisco, CA)","company":"Sourcegraph","image":"https://pbs.twimg.com/profile_images/1428393724527190022/4mt5PACL_400x400.png","description":"\n    <div class=\"content-intro\"><h3>ALL SOURCEGRAPH ROLES ARE FULLY REMOTE</h3>\n<h2><span style=\"color: #a112ff;\">Who we are</span></h2>\n<p>Our mission at Sourcegraph is to make it so that&nbsp;<a class=\"c-link\" href=\"https://handbook.sourcegraph.com/strategy-goals/strategy\" target=\"_blank\" data-stringify-link=\"https://handbook.sourcegraph.com/strategy-goals/strategy\" data-sk=\"tooltip_parent\">everyone can code</a>, not just ~0.1% of the population. Our code graph powers Cody, the most powerful and accurate AI coding assistant, as well as our Code Search product, which helps devs explore their entire codebase and make large-scale migrations and security fixes. We’re building software that builds software, and in doing so we’re making devs more productive and preparing for a world where a lot more code gets written.</p>\n<p>It’s an exciting time to join Sourcegraph. AI has taken over the world, and we’ve spent the last 10 years building infrastructure that’s integral to making AI generated code more powerful and accurate. Our customers include 4/5 FAANG companies, 4 of the top 10 banks, government organizations, Uber, Plaid, and many other companies building the software that pushes the world forward. We’ve raised $225M at a $2.625B valuation from <a class=\"c-link\" href=\"https://techcrunch.com/2021/07/13/sourcegraph-raises-125m-series-d-on-2-6b-valuation-for-universal-code-search-tool/\" target=\"_blank\" data-stringify-link=\"https://techcrunch.com/2021/07/13/sourcegraph-raises-125m-series-d-on-2-6b-valuation-for-universal-code-search-tool/\" data-sk=\"tooltip_parent\">Andreessen Horowitz</a>,&nbsp;<a class=\"c-link\" href=\"https://about.sourcegraph.com/blog/series-c-with-sequoia/\" target=\"_blank\" data-stringify-link=\"https://about.sourcegraph.com/blog/series-c-with-sequoia/\" data-sk=\"tooltip_parent\">Sequoia</a>,&nbsp;<a class=\"c-link\" href=\"https://www.redpoint.com/companies/sourcegraph/\" target=\"_blank\" data-stringify-link=\"https://www.redpoint.com/companies/sourcegraph/\" data-sk=\"tooltip_parent\">Redpoint</a>,&nbsp;<a class=\"c-link\" href=\"https://medium.com/craft-ventures/why-we-invested-in-sourcegraph-5ace28317e3d\" target=\"_blank\" data-stringify-link=\"https://medium.com/craft-ventures/why-we-invested-in-sourcegraph-5ace28317e3d\" data-sk=\"tooltip_parent\">Craft</a>&nbsp;and others. We’re making ambitious bets on our future and we’re looking to hire exceptional people to join our team as we make Sourcegraph one of the biggest and most influential companies in the world.</p></div>\n\n    <h2><span style=\"color: rgb(140, 51, 236);\">Working hours</span></h2>\n<p>While Sourcegraph is fully remote, we require the successful candidate for this role to reside in San Francisco, California. Regular attendance at weekly Developer and AI events in the city is an essential aspect of this position.</p>\n<h2><span style=\"color: rgb(140, 51, 236);\">Why this job is exciting</span></h2>\n<p><a href=\"https://about.sourcegraph.com/cody?utm_source=google&amp;utm_medium=cpc&amp;utm_campaign=19895311885&amp;utm_term=sourcegraph%20cody&amp;gclid=CjwKCAjw0ZiiBhBKEiwA4PT9z9jbT-6ncbQS5bLcQHfuIy9Je5bCogDwICrbbZ8Z9TkwiKkenGMuFRoCptEQAvD_BwE\">Cody</a> is the best AI coding assistant today, and you'll get to help build it and get it in the hands of millions of devs. (It's also open source and built in public.) AI applied to software engineering will change the world more than any single other technology. We're perfectly positioned to keep building the best coding AI because of our large-scale, deep understanding of code inside the most advanced companies in the world and across the world of public code.</p>\n<p>As a Developer Advocate, you will spend 75% of your time engaging with Developers at events in person and 25% of your time creating content and recording videos.</p>\n<h2><span style=\"color: rgb(140, 51, 236);\">Job responsibilities</span></h2>\n<ul>\n<li>Attend 1-3 meet-ups and events in San Francisco weekly</li>\n<li>Represent our user community within Sourcegraph</li>\n<li>Build apps with Cody in public</li>\n<li>Build integrations on top of Cody (such as teaching Cody how to use and gather information from other dev tools, including logging, perf, etc., tools)</li>\n<li>Livestream and record demos of what you build, for Twitter, YouTube, Twitch, etc.</li>\n<li>Be an incredibly helpful and inspirational member of our dev community yourself and help grow it</li>\n<li>Write awesome technical blog posts</li>\n<li>Promote Sourcegraph on social media</li>\n<li>Help connect our user community growth to our product-led growth engine</li>\n<li>Overall, help define what dev advocacy means at Sourcegraph</li>\n</ul>\n<h2><span style=\"color: rgb(140, 51, 236);\">Skills and experience</span></h2>\n<p>Your skill-set:</p>\n<ul>\n<li>You are intrinsically motivated by Sourcegraph’s mission and <a href=\"https://about.sourcegraph.com/cody?utm_source=google&amp;utm_medium=cpc&amp;utm_campaign=19895311885&amp;utm_term=sourcegraph%20cody&amp;gclid=CjwKCAjw0ZiiBhBKEiwA4PT9z9jbT-6ncbQS5bLcQHfuIy9Je5bCogDwICrbbZ8Z9TkwiKkenGMuFRoCptEQAvD_BwE\">Cody</a>.&nbsp;</li>\n<li>Experience as a software engineer or prolific coding</li>\n<li>TypeScript skills (<a href=\"https://sourcegraph.com/github.com/sourcegraph/sourcegraph/-/tree/client/cody\">Cody's code</a> is open source)</li>\n<li>Able to communicate technical concepts in a simple and engaging way</li>\n<li>Experience creating high-quality technical writing and videos</li>\n<li>Experience working in a high-agency environment that requires ownership</li>\n</ul>\n<p>&nbsp;Bonus Points:</p>\n<ul>\n<li>You’ve established a strong following on social media platforms</li>\n</ul>\n<h2><span style=\"color: rgb(140, 51, 236);\">Level</span></h2>\n<p>This job is an IC2-IC3.&nbsp; You can read more about <a href=\"https://handbook.sourcegraph.com/benefits-pay-perks/pay-expenses/compensation/leveling-guide/\">our job leveling philosophy</a> in our Handbook.</p>\n<h2><span style=\"color: rgb(140, 51, 236);\">Compensation</span></h2>\n<p><strong>We pay you an above-average salary</strong> because we want to hire the best people who are fully focused on helping Sourcegraph succeed, not worried about paying bills. You will have the flexibility to work and live anywhere in the world<em> (unless specified otherwise in the job description)</em>, and we’ll never take your location or current/past salary information into account when determining your compensation.&nbsp; As an <a href=\"https://handbook.sourcegraph.com/company-info-and-process/values/#sts=Open%20and%20transparent\">open and transparent </a>company that values equitable and competitive compensation for everyone, our <a href=\"https://handbook.sourcegraph.com/benefits-pay-perks/pay-expenses/compensation/\">compensation ranges are visible</a> to every single Sourcegraph Teammate. To determine your salary, we use a number of market and data-driven salary sources and target the high-end of the range, ensuring that we’re always paying above market regardless of where you live in the world.&nbsp;&nbsp;</p>\n<p>The target compensation for this role is $128,314 USD (IC2) and $158,404 (IC3)&nbsp; base.</p>\n<p>&nbsp;In addition to our cash compensation, we offer equity (because when we succeed as a company, we want you to succeed, too) and generous <a href=\"https://handbook.sourcegraph.com/benefits-pay-perks/benefits-perks/\">perks &amp; benefits</a>.</p>\n<h2><strong><span style=\"color: #8c33ec;\">Interview process</span>&nbsp;</strong></h2>\n<p><em><span style=\"font-weight: 400;\">Below is the interview process you can expect for this role (you can read more about </span></em><a href=\"https://handbook.sourcegraph.com/talent/types_of_interviews\"><em><span style=\"font-weight: 400;\">the types of interviews</span></em></a><em><span style=\"font-weight: 400;\"> in our Handbook). It may look like a lot of steps, but rest assured that we move quickly and the steps are designed to help you get the information needed to determine if we’re the right fit for you… Interviewing is a two-way street, after all!&nbsp;</span></em></p>\n<p><span style=\"font-weight: 400;\">We expect the interview process to take 4.5</span><span style=\"font-weight: 400;\">&nbsp;</span><span style=\"font-weight: 400;\">hours in total.</span><span style=\"font-weight: 400;\">&nbsp;</span><span style=\"font-weight: 400;\"><br><br></span></p>\n<p><strong>👋 Introduction Stage</strong><span style=\"font-weight: 400;\"> - we have initial conversations to get to know you better…</span></p>\n<ul>\n<li style=\"font-weight: 400;\"><span style=\"font-weight: 400;\">[30m] </span><a href=\"https://handbook.sourcegraph.com/departments/people-talent/talent/process/types_of_interviews/#recruiter-screen\"><span style=\"font-weight: 400;\">Recruiter Screen</span></a><span style=\"font-weight: 400;\"> with Kelsey Nagel</span></li>\n<li style=\"font-weight: 400;\"><span style=\"font-weight: 400;\">[30m] </span><a href=\"https://handbook.sourcegraph.com/departments/people-talent/talent/process/types_of_interviews/#hiring-manager-screen\"><span style=\"font-weight: 400;\">Hiring Manager Screen</span></a> with Ado Kukic</li>\n</ul>\n<p><strong>🧑‍💻 Team Interview Stage</strong><span style=\"font-weight: 400;\"> - we then delve into your experience in more depth and introduce you to members of the team…</span></p>\n<ul>\n<li style=\"font-weight: 400;\"><span style=\"font-weight: 400;\">[60m] </span><a href=\"https://handbook.sourcegraph.com/departments/people-talent/talent/process/types_of_interviews/#resume-deep-dive\"><span style=\"font-weight: 400;\">Resume Deep Dive</span></a> with Kelsey Nagel and Ado Kukic</li>\n<li>[60m]&nbsp;<a href=\"https://handbook.sourcegraph.com/departments/people-talent/talent/process/types_of_interviews/#developer-relations-working-session\">Working Session</a>&nbsp;with Alex Isken, Justin Dorfman, Raman Sharma, Beyang Liu, Ado Kukic, Amie Rotherham</li>\n<li>[45m]&nbsp;<a href=\"https://about.sourcegraph.com/handbook/talent/types_of_interviews#cross-functional-team-collaboration-interview\">Cross-functional team collaboration</a>&nbsp;with Justin Dorfman and Amie Rotherham&nbsp;</li>\n</ul>\n<p><strong>🎉 Final Interview Stage </strong><span style=\"font-weight: 400;\">- we move you to our final round, where you meet cross-functional partners and gain a better understanding of our business and values holistically…</span></p>\n<ul>\n<li style=\"font-weight: 400;\"><span style=\"font-weight: 400;\">[30m] </span><a href=\"https://handbook.sourcegraph.com/departments/people-talent/talent/process/types_of_interviews/#values-interview\"><span style=\"font-weight: 400;\">Values Interview</span></a></li>\n<li style=\"font-weight: 400;\"><span style=\"font-weight: 400;\">[30m] </span><a href=\"https://handbook.sourcegraph.com/departments/people-talent/talent/process/types_of_interviews/#leadership-interview\"><span style=\"font-weight: 400;\">Leadership Interview</span></a><span style=\"font-weight: 400;\"> with Quinn Slack or Beyang Liu&nbsp;</span></li>\n<li style=\"font-weight: 400;\"><span style=\"font-weight: 400;\">We check references and conduct your background check</span></li>\n</ul>\n<p><span style=\"font-weight: 400;\">Please note - you are welcome to request additional conversations with anyone you would like to meet, but didn’t get to meet during the interview process. You can learn more about the team&nbsp;<a href=\"https://handbook.sourcegraph.com/team/\">here</a>.&nbsp;</span></p>\n\n    \n\n    <div class=\"content-conclusion\"><h2><span style=\"color: #a112ff;\">Not sure if this is you?</span></h2>\n<p><span style=\"font-weight: 400;\">We want a diverse, global team, with a broad range of experience and perspectives. If this job sounds great, but you’re not sure if you qualify, apply anyway! We carefully consider every application, and will either move forward with you, find another team that might be a better fit, keep in touch for future opportunities, or thank you for your time.</span></p>\n<h2><span style=\"color: #a112ff;\">Learn more about us</span></h2>\n<p><span style=\"font-weight: 400;\">To create a product that serves the needs of all developers, we are building a diverse </span><a href=\"https://handbook.sourcegraph.com/company-info-and-process/remote\"><span style=\"font-weight: 400;\">all-remote team</span></a><span style=\"font-weight: 400;\"> that is </span><a href=\"https://handbook.sourcegraph.com/team\"><span style=\"font-weight: 400;\">distributed across the world</span></a><span style=\"font-weight: 400;\">. Sourcegraph is an equal opportunity workplace; we welcome people from all backgrounds and communities.&nbsp;</span></p>\n<p><span style=\"font-weight: 400;\">We provide </span><a href=\"https://about.sourcegraph.com/handbook/people-ops/compensation\"><span style=\"font-weight: 400;\">competitive compensation</span></a><span style=\"font-weight: 400;\"> and </span><a href=\"https://about.sourcegraph.com/handbook/people-ops/benefits-and-perks\"><span style=\"font-weight: 400;\">practical benefits</span></a><span style=\"font-weight: 400;\"> to keep you happy and healthy so that you can do your best work.&nbsp;</span><span style=\"font-weight: 400;\">&nbsp;</span></p>\n<p><span style=\"font-weight: 400;\">Learn more about what it is like to work at Sourcegraph by reading </span><a href=\"https://about.sourcegraph.com/handbook/\"><span style=\"font-weight: 400;\">our handbook</span></a><span style=\"font-weight: 400;\">.</span></p>\n<p><span style=\"font-weight: 400;\">We want to ensure Sourcegraph is an environment that suits your working style and empowers you to do your best work, so we are eager to answer any questions that you have about us at any point in the interview process.</span></p>\n<p><span style=\"font-weight: 400;\">Go back to the </span><a href=\"https://about.sourcegraph.com/jobs/\"><span style=\"font-weight: 400;\">careers page</span></a><span style=\"font-weight: 400;\"> for all open positions.</span></p>\n<p>&nbsp;</p>\n<p><em><span style=\"font-weight: 400;\">Sourcegraph participates in <a href=\"https://handbook.sourcegraph.com/departments/people-talent/e-verify/\" target=\"_blank\">E-Verify</a> for U.S. Employees</span></em></p></div>\n","tags":"[\"typescript\",\"engineering\"]","pubDate":"2023-11-25 14:15:23.078","link":"https://boards.greenhouse.io/sourcegraph91/jobs/4913314004","savedDate":"2023-11-25 14:15:23.078","slug":"developer-advocate-based-in-san-francisco-ca-sourcegraph-4194"},{"id":3606028525,"title":"Full Stack Developer (Python) - Internal Projects & AI - Remote","company":"CloudLinux","image":"https://pbs.twimg.com/profile_images/696718028084482050/ymY3OEPk_400x400.png","description":"<p>We are seeking a highly skilled and motivated Full Stack Developer with strong analytical skills and expertise in Python and JavaScript to join our team. In this role, you will be working on various internal projects, including projects involving the integration of systems and the use of OpenAI to automate aspects of work. Most projects will be small in scope, and the ability to write clear, easy-to-understand code and complete projects quickly is essential. You will be talking directly with stakeholders, and figuring out the best way to solve the problem. You will go for \"works well enough\" instead of perfection. Quick, prototype quality work will be preferred to fully engineered projects</p><p>As a Full Stack Developer at our company, you will play a crucial role in developing innovative solutions to help optimize internal processes and replace manual tasks with automated solutions. <br></p><p><strong>As our Full Stack Developer you will;</strong></p><ul> <li>Design, develop, and maintain Python and JavaScript applications for internal projects</li> <li>Talk to stakeholders, and figure out the best way to solve their problems</li> <li>Integrate various systems and work on projects involving the use of OpenAI to automate tasks</li> <li>Write clear, well-structured, and maintainable code that is easy to understand and modify</li> <li>Collaborate with cross-functional teams to develop innovative solutions and optimize internal processes</li> <li>Participate in code reviews to ensure high-quality code and identify areas for improvement</li> <li>Ensure projects are completed quickly and efficiently without compromising quality</li> </ul><h3>Requirements: </h3><ul> <li>Strong analytical and communication skills</li> <li>Ability to pinpoint the problem and come up with the solution</li> <li>Strong expertise in Python and JavaScript programming languages</li> <li>Proficiency in Git for version control</li> <li>Experience with shell scripting and Linux operating system</li> <li>Ability to communicate effectively in English, both in writing and verbally</li> <li>Demonstrated problem-solving skills and ability to work independently as well as in a team environment</li> <li>Quick learner</li> </ul><h3>Benefits: </h3><p><strong>What's in it for you?</strong></p><ul> <li>A focus on professional development;<ul> <li>Training reimbursements</li> <li>Mentor programs</li> <li>Knowledge-Exchange programs</li> <li>Interesting and challenging projects</li> </ul> </li> <li>Flexible working hours</li> <li>Paid 24 days of vacation per year and unlimited sick leave</li> <li>Medical insurance reimbursement</li> <li>Co-working and gym/sports reimbursement</li> <li>The opportunity to receive a reward for the most innovative idea that the company can patent.</li> </ul><em>By applying for this position, you agree with </em><a href=\"https://cloudlinux.com/privacy-policy\" rel=\"nofollow noreferrer noopener\" class=\"external\"><em>Cloudlinux Privacy Policy</em></a><em> and give us your consent to maintain and process your personal data with this respect. Please read our Privacy Policy for more information.</em>","tags":"[\"javascript\"]","pubDate":"2023-11-24 00:00:00.000","link":"https://apply.workable.com/cloudlinux-1/j/5AC92872CE","savedDate":"2023-11-25 14:15:23.080","slug":"full-stack-developer-python-internal-projects-ai-remote-cloudlinux-9267"},{"id":8234702921,"title":"Enterprise Architect (Fully Remote)","company":"CoverGo","image":"https://pbs.twimg.com/profile_images/1382655628523364355/MWPIbbID_400x400.jpg","description":"<p></p><p><strong>Top 3 Reasons To Join Us</strong></p><ul> <li>Competitive Salary</li> <li>100% Remote</li> <li>Working on the latest tech for the Insurtech Market Leader</li> </ul><p><strong>About Us</strong></p><p>At CoverGo, our mission is to empower all insurance companies to make insurance 100% digital and accessible to everyone.</p><ul> <li>We are a leading global no-code insurance platform for health, life, and P&amp;C</li> <li>We’re the winner of the Insurtech of the Year in all of Asia and other awards globally</li> <li>We work with insurance enterprise clients such as AXA, Bupa, MSIG, Dai-ichi, Bank of China Group Insurance, and many more</li> <li>We're an international, diverse team of over 120 people with 30 nationalities and team members working remotely from all over the world</li> <li>We are fully funded and backed by reputable VC funds and strategic institutional investors</li> <li>We have a global presence in Asia, EMEA and the Americas</li> <li>We’ve grown our annualized revenue by over 30x since January 2021</li> <li>We’re constantly working towards making CoverGo a workplace that you love coming to. We deeply believe that bringing together a diversity of thoughts, expressions, and perspectives is key to building the best culture for equally diverse communities all over the world</li> </ul><p><strong>About the Role</strong></p><p>The Enterprise Architect is responsible for assisting in building a holistic view of the CoverHealth Platform strategy, processes, information, and technology assets. Their principle job is to ensure that the business and IT plans and strategies are in alignment. They will operate across organisational boundaries to develop and gain agreement to architectural principles and models that show how the current and future needs of an organisation will be met in an efficient, sustainable and adaptable manner.</p><p>The Enterprise Architect balances the investment and need for lasting, strategic solutions v's rapid payback opportunities of a more tactical nature. The Enterprise Architect conducts and supports the development and maintenance of information technology (IT) and Enterprise Architecture (EA) plans. This position is responsible for the CoverHealth platform architecture and implementation of platform service-oriented and component-based architectures plans. This position supports development of standards, policies and guidelines to ensure appropriate application, implementation, and compatibility with company-wide information architectural and technical standards.</p><p>The Enterprise Architect reports to the CTO, manages the architecture team, works closely with Covergo-product and customer-project stakeholders  </p><p>The ideal candidate is a cloud technology focused individual who has demonstrated design &amp; delivery expertise in forward looking solutions in a modern cloud based insurance environment.  The successful candidate will be technology agnostic but with a bias towards solutions leveraging heavily on the AWS environment that comprise elements of open-source, PaaS and SaaS components.</p><p><strong>Key Areas of Focus</strong></p><ul> <li>Build out and lead the Enterprise Architecture team</li> <li>Manage and maintain the Enterprise Architecture and IT Standards for the business</li> <li>Govern technical and product standards; ensuring adherence to the reference architecture</li> <li>Work closely with the CTO to build out the enterprise strategy for specific components of the CoverHealth Insurance Capability Framework in consultation with Product Team and Client business needs </li> <li>Ensure Architecture is aligned with Product Owners, Sales, and Marketing</li> <li>Accountable for all deliverables of the architecture team</li> </ul><p><strong>What You Will Do</strong></p><ul> <li>Owns and manages the framework for Enterprise Architecture</li> <li>Owns and manages Architectural Governance of internal Architectural Control Points</li> <li>Directs solution deployment roadmaps</li> <li>Lead in designing, specifying and selecting off-the-shelf components, considering functionality, data, security, integration, infrastructure and performance for areas of teh solution we wish to buy rather than build</li> <li>Identifying which Technology Components to incorporate into the overall designs based on suitability for purpose, cost benefit analysis and research</li> <li>Where applicable, evaluate vendors for architectural recommendations</li> <li>Breaking down large scale initiatives into manageable easily deliverable chunks</li> <li>Industry and architecture knowledge transfer for architects, business analysts and engineers </li> <li>Maintain an awareness of business solution components that align with our current and future operational needs to prevent developing non-core IP areas within our product offering</li> <li>Rapidly gain an in-depth understanding of the “as is” architecture landscape and understand our future direction</li> </ul><p><strong>Required Experience and Knowledge</strong></p><ul> <li>At least 10 years of experience in senior architecture roles in the insurance industry with a current position of Enterprise Architect held for at least 3 years</li> <li>Insurance Industry can be end-client or software / services vendor focused</li> <li>Understanding of insurance business processes across all areas and at least two lines of business</li> <li>Proven experience in a cloud first environment for the insurance vertical</li> <li>Understands business architecture models &amp; patterns</li> <li>Experience with data architecture</li> <li>Experience with service and integration architecture </li> <li>Experience in defining and socialising the enterprise roadmaps and translating the roadmap into  implementable steps</li> <li>Demonstrable success in implementation innovative and creative solutions to business problems</li> <li>Encourages and expects others to think \"outside the box\" and not be limited by existing methods and procedures, but also be able to understand the business constraints that lead to “in the box” approaches</li> <li>Experienced in working in environments that are waterfall &amp; agile, lean, dev-sec-ops focused</li> <li>Excellent communication and interpersonal skills, with the ability to work effectively with cross-functional teams</li> </ul><p><strong>Required Competencies</strong></p><ul> <li>Strong leadership and mentoring skills</li> <li>Excellent communication skills (written and verbal)</li> <li>Must be equally comfortable discussing the architecture strategies and enterprise roadmap with people at all levels of our organisation and CxO to project level teams in our clients</li> <li>Ability to effectively communicate in a multicultural, multinational environment</li> <li>Excellent ability to listen and interpret requirements correctly</li> <li>Excellent presentation skills and an ability to engage audiences</li> <li>Excellent decision making and judgment skills</li> <li>Certification in one architecture discipline (TOGAF, Zachman, etc.) is a distinct advantage</li> <li>Certification in one cloud environment is a distinct advantage with a broad knowledge and experience of the cloud platform’s capabilities</li> <li>A high proficiency in working in English as your primary language</li> </ul><p><strong>Why You'll Love Working Here</strong></p><ul> <li>Fully Remote</li> <li>Flexible Leave</li> <li>International Environment</li> <li>Competitive renumeration package</li> <li>Performance Bonus</li> <li>Stock Options after 6 months </li> <li>Company activities and events</li> <li>Learning and development plan</li> </ul><p><strong>CoverGo Company</strong><a href=\"https://www.youtube.com/watch?v=YI0ezLxvFvA\" rel=\"nofollow noreferrer noopener\" class=\"external\"><strong> Video</strong></a></p><p>By submitting your application, you confirm that you have read, understood, and accepted the content of CoverGo’s <a href=\"https://apply.workable.com/covergo/gdpr_policy?lng=en\" target=\"_blank\" rel=\"nofollow noreferrer noopener\" class=\"external\">Privacy Notice</a> and you consent to the processing of your data as part of this application.</p><h3>Requirements: </h3><h3>Benefits: </h3>","tags":"[\"aws\"]","pubDate":"2023-11-24 00:00:00.000","link":"https://apply.workable.com/covergo/j/4AF72D0CBB","savedDate":"2023-11-25 14:15:23.082","slug":"enterprise-architect-fully-remote-covergo-1224"},{"id":2740600107,"title":"Enterprise Architect (Fully Remote)","company":"CoverGo","image":"https://pbs.twimg.com/profile_images/1382655628523364355/MWPIbbID_400x400.jpg","description":"<p></p><p><strong>Top 3 Reasons To Join Us</strong></p><ul> <li>Competitive Salary</li> <li>100% Remote</li> <li>Working on the latest tech for the Insurtech Market Leader</li> </ul><p><strong>About Us</strong></p><p>At CoverGo, our mission is to empower all insurance companies to make insurance 100% digital and accessible to everyone.</p><ul> <li>We are a leading global no-code insurance platform for health, life, and P&amp;C</li> <li>We’re the winner of the Insurtech of the Year in all of Asia and other awards globally</li> <li>We work with insurance enterprise clients such as AXA, Bupa, MSIG, Dai-ichi, Bank of China Group Insurance, and many more</li> <li>We're an international, diverse team of over 120 people with 30 nationalities and team members working remotely from all over the world</li> <li>We are fully funded and backed by reputable VC funds and strategic institutional investors</li> <li>We have a global presence in Asia, EMEA and the Americas</li> <li>We’ve grown our annualized revenue by over 30x since January 2021</li> <li>We’re constantly working towards making CoverGo a workplace that you love coming to. We deeply believe that bringing together a diversity of thoughts, expressions, and perspectives is key to building the best culture for equally diverse communities all over the world</li> </ul><p><strong>About the Role</strong></p><p>The Enterprise Architect is responsible for assisting in building a holistic view of the CoverHealth Platform strategy, processes, information, and technology assets. Their principle job is to ensure that the business and IT plans and strategies are in alignment. They will operate across organisational boundaries to develop and gain agreement to architectural principles and models that show how the current and future needs of an organisation will be met in an efficient, sustainable and adaptable manner.</p><p>The Enterprise Architect balances the investment and need for lasting, strategic solutions v's rapid payback opportunities of a more tactical nature. The Enterprise Architect conducts and supports the development and maintenance of information technology (IT) and Enterprise Architecture (EA) plans. This position is responsible for the CoverHealth platform architecture and implementation of platform service-oriented and component-based architectures plans. This position supports development of standards, policies and guidelines to ensure appropriate application, implementation, and compatibility with company-wide information architectural and technical standards.</p><p>The Enterprise Architect reports to the CTO, manages the architecture team, works closely with Covergo-product and customer-project stakeholders  </p><p>The ideal candidate is a cloud technology focused individual who has demonstrated design &amp; delivery expertise in forward looking solutions in a modern cloud based insurance environment.  The successful candidate will be technology agnostic but with a bias towards solutions leveraging heavily on the AWS environment that comprise elements of open-source, PaaS and SaaS components.</p><p><strong>Key Areas of Focus</strong></p><ul> <li>Build out and lead the Enterprise Architecture team</li> <li>Manage and maintain the Enterprise Architecture and IT Standards for the business</li> <li>Govern technical and product standards; ensuring adherence to the reference architecture</li> <li>Work closely with the CTO to build out the enterprise strategy for specific components of the CoverHealth Insurance Capability Framework in consultation with Product Team and Client business needs </li> <li>Ensure Architecture is aligned with Product Owners, Sales, and Marketing</li> <li>Accountable for all deliverables of the architecture team</li> </ul><p><strong>What You Will Do</strong></p><ul> <li>Owns and manages the framework for Enterprise Architecture</li> <li>Owns and manages Architectural Governance of internal Architectural Control Points</li> <li>Directs solution deployment roadmaps</li> <li>Lead in designing, specifying and selecting off-the-shelf components, considering functionality, data, security, integration, infrastructure and performance for areas of teh solution we wish to buy rather than build</li> <li>Identifying which Technology Components to incorporate into the overall designs based on suitability for purpose, cost benefit analysis and research</li> <li>Where applicable, evaluate vendors for architectural recommendations</li> <li>Breaking down large scale initiatives into manageable easily deliverable chunks</li> <li>Industry and architecture knowledge transfer for architects, business analysts and engineers </li> <li>Maintain an awareness of business solution components that align with our current and future operational needs to prevent developing non-core IP areas within our product offering</li> <li>Rapidly gain an in-depth understanding of the “as is” architecture landscape and understand our future direction</li> </ul><p><strong>Required Experience and Knowledge</strong></p><ul> <li>At least 10 years of experience in senior architecture roles in the insurance industry with a current position of Enterprise Architect held for at least 3 years</li> <li>Insurance Industry can be end-client or software / services vendor focused</li> <li>Understanding of insurance business processes across all areas and at least two lines of business</li> <li>Proven experience in a cloud first environment for the insurance vertical</li> <li>Understands business architecture models &amp; patterns</li> <li>Experience with data architecture</li> <li>Experience with service and integration architecture </li> <li>Experience in defining and socialising the enterprise roadmaps and translating the roadmap into  implementable steps</li> <li>Demonstrable success in implementation innovative and creative solutions to business problems</li> <li>Encourages and expects others to think \"outside the box\" and not be limited by existing methods and procedures, but also be able to understand the business constraints that lead to “in the box” approaches</li> <li>Experienced in working in environments that are waterfall &amp; agile, lean, dev-sec-ops focused</li> <li>Excellent communication and interpersonal skills, with the ability to work effectively with cross-functional teams</li> </ul><p><strong>Required Competencies</strong></p><ul> <li>Strong leadership and mentoring skills</li> <li>Excellent communication skills (written and verbal)</li> <li>Must be equally comfortable discussing the architecture strategies and enterprise roadmap with people at all levels of our organisation and CxO to project level teams in our clients</li> <li>Ability to effectively communicate in a multicultural, multinational environment</li> <li>Excellent ability to listen and interpret requirements correctly</li> <li>Excellent presentation skills and an ability to engage audiences</li> <li>Excellent decision making and judgment skills</li> <li>Certification in one architecture discipline (TOGAF, Zachman, etc.) is a distinct advantage</li> <li>Certification in one cloud environment is a distinct advantage with a broad knowledge and experience of the cloud platform’s capabilities</li> <li>A high proficiency in working in English as your primary language</li> </ul><p><strong>Why You'll Love Working Here</strong></p><ul> <li>Fully Remote</li> <li>Flexible Leave</li> <li>International Environment</li> <li>Competitive renumeration package</li> <li>Performance Bonus</li> <li>Stock Options after 6 months </li> <li>Company activities and events</li> <li>Learning and development plan</li> </ul><p><strong>CoverGo Company</strong><a href=\"https://www.youtube.com/watch?v=YI0ezLxvFvA\" rel=\"nofollow noreferrer noopener\" class=\"external\"><strong> Video</strong></a></p><p>By submitting your application, you confirm that you have read, understood, and accepted the content of CoverGo’s <a href=\"https://apply.workable.com/covergo/gdpr_policy?lng=en\" target=\"_blank\" rel=\"nofollow noreferrer noopener\" class=\"external\">Privacy Notice</a> and you consent to the processing of your data as part of this application.</p><h3>Requirements: </h3><h3>Benefits: </h3>","tags":"[\"aws\"]","pubDate":"2023-11-24 00:00:00.000","link":"https://apply.workable.com/covergo/j/81E65E501C","savedDate":"2023-11-25 14:15:23.083","slug":"enterprise-architect-fully-remote-covergo-5867"},{"id":6371680645,"title":"Senior Python Developer AI/ML/NLP - REMOTE/Work Anywhere","company":"CloudLinux","image":"https://pbs.twimg.com/profile_images/696718028084482050/ymY3OEPk_400x400.png","description":"<p>CloudLinux stands as a pioneering remote-first entity, deeply committed to its core values: integrity, employee-centricity, embracing remote work, and delivering cost-effective, high-performance Linux infrastructure and security products. Our team is united in mutual support, striving for collective success and fostering a thriving work environment. Discover more at Cloudlinux.com.</p><p></p><p>We are looking for someone who embodies our&nbsp;<strong>company values</strong>:</p><ul> <li> <strong>Curious:</strong>&nbsp;Be willing to do research and design experiments by being hands-on</li> <li> <strong>Tenacious:</strong>&nbsp;Creating something new is hard work, and our Analytics team never gives up</li> <li> <strong>Customer Passion:</strong>&nbsp;Be the backbone of our solution and help us stay ahead of malware developers.</li> <li> <strong>Design for Scale:</strong>&nbsp;Work with the rest of the analytics and engineering team to make web-protection at scale possible</li> <li> <strong>Agile:</strong>&nbsp;Some days you may spend researching and designing experiments while others are spent using your analytical toolbox to surface insights into real-time incidents and file infection.</li> <li> <strong>Roll Up Your Sleeves:</strong>&nbsp;Partner closely internally to learn from others, and succeed as a team.</li> </ul><p></p><p><strong>How you’ll have an impact:</strong></p><ul> <li>Develop automation services using AI/ML/NLP and Large Language Model integrations (code generation, code review, workflow automation) to streamline the company's workflows.</li> <li>Design and prototype new algorithms for code generation, code analysis, and code review with a touch of AI. </li> <li>Review and enhance Python-based services, and their CI/CD workflows.</li> </ul><p></p><p><strong>The benefits you get:</strong></p><ul> <li> <strong>Independence in Action:</strong> We welcome candidates who thrive on working autonomously, taking projects from inception to completion with a self-driven approach.</li> <li> <strong>End-to-End Ownership:</strong> Ideal for those who enjoy overseeing all aspects of a project, ensuring every detail is handled with care and precision.</li> <li> <strong>Dynamic Environment:</strong> If you excel in rapidly changing contexts and can juggle multiple tasks effectively, this role is for you.</li> <li> <strong>Quick Learners Welcome:</strong> Perfect for individuals who can rapidly assimilate new information and skills, adapting to evolving challenges with ease.</li> <li> <strong>Variety and Challenge:</strong> Suited for those who seek a constantly evolving workload, offering a diverse range of tasks and learning opportunities.</li> </ul><h3>Requirements: </h3><p><strong>Past experience you’ll need:</strong></p><ul> <li>5+ years of experience as a Python developer</li> <li>Ability to read/review ANSI C source code</li> <li>Writing code and reviewing others in a shared codebase in Python</li> <li>Understanding and experience in CI/CD workflow using GitLab and git, and automated testing</li> <li>Familiarity with the Linux command line</li> <li>Ability to speak, read, and write in English C1 or better</li> <li>LLM/NLP/ML expertise would be a plus</li> <li>Practical SQL knowledge would be a plus</li> </ul><h3>Benefits: </h3><p><strong>What's in it for you?</strong></p><ul> <li>A focus on professional development; </li> <li>Interesting and challenging projects</li> <li> Flexible working hours</li> <li>Paid one month vacation per year and unlimited sick leave</li> <li>Medical insurance reimbursement</li> <li>Co-working and gym/sports reimbursement</li> <li>The opportunity to receive a reward for the most innovative idea that the company can patent</li> </ul><p><em>By applying for this position, you agree with </em><a href=\"https://cloudlinux.com/privacy-policy\" rel=\"nofollow noreferrer noopener\" class=\"external\"><em>Cloudlinux Privacy Policy</em></a><em> and give us your consent to maintain and process your personal data with this respect. Please read our Privacy Policy for more information.</em></p>","tags":"[\"engineering\"]","pubDate":"2023-11-23 00:00:00.000","link":"https://apply.workable.com/cloudlinux-1/j/10E2D9BB03","savedDate":"2023-11-25 14:15:23.081","slug":"senior-python-developer-ai-ml-nlp-remote-work-anywhere-cloudlinux-7332"},{"id":6443769831,"title":"Business Analyst - Health Insurance (Fully Remote)","company":"CoverGo","image":"https://pbs.twimg.com/profile_images/1382655628523364355/MWPIbbID_400x400.jpg","description":"<h3>Top 3 Reasons To Join Us</h3><ul> <li>Share Option Plan</li> <li>100% Globally Remote </li> <li>Insurtech industry leader worldwide </li> </ul><h3>About us:</h3><ul> <li>At CoverGo, our mission is to empower all insurance companies to make insurance 100% digital and accessible to everyone.</li> <li>We are a leading global no-code insurance platform for health, life, and P&amp;C</li> <li>We’re the winner of the Insurtech of the Year in all of Asia and other awards globally</li> <li>We work with insurance enterprise clients such as AXA, Bupa, MSIG, Dai-ichi, Bank of China Group Insurance, and many more</li> <li>We’re an international, diverse team of over 120 people with 30 nationalities and team members working remotely from all over the world</li> <li>We are fully funded and backed by reputable VC funds and strategic institutional investors</li> <li>We have a global presence in Asia, EMEA and the Americas</li> <li>We’ve grown our annualized revenue by over 30x since January 2021</li> <li>We’re constantly working towards making CoverGo a workplace that you love coming to. We deeply believe that bringing together a diversity of thoughts, expressions, and perspectives is key to building the best culture for equally diverse communities all over the world</li> </ul><p><strong>What You Will Do:</strong></p><ul> <li>Plans and designs simple to semi-complex business processes and system modifications. Makes recommendations to improve and support business activities.</li> <li>Gathers business requirements through a variety of techniques such as work sessions and interviews. Analyzes and documents client complex business requirements and processes; communicates these requirements to appropriate parties.</li> <li>Creates complex test case scenarios to be used in testing; monitors/oversees the testing of business applications to verify that all client requirements are incorporated into the system design.</li> <li>Provides input into developing and modifying systems to meet client needs. </li> <li>Develops business requirements documents/user stories to support the required modifications.</li> <li>Coordinates and facilitates meetings with clients to gather and document requirements and explore potential solutions.</li> <li>Coordinates business analyst tasks on information technology projects and provides project team member guidance and support. May plan, allocate and monitor work of other business analysts.</li> <li>Assist in providing time estimates for project related tasks.</li> <li>Aids in updating process and procedural documentation</li> <li>Work with clients and technical resources to identify their business problems and develop the right approach and analytical solution</li> <li>Basic understanding of technical development cycle of mobile application or web portals</li> <li>Experience participating in successful projects with cross-functional teams</li> <li>Agile/Scrum Framework for Project Planning &amp; Release Management is a must</li> <li>Ability to understand simple to complex systems and related data to surface actionable insights, demonstrate sound judgment and decision-making skills</li> <li>Business analysis skills including facilitation, process documentation, requirements gathering and user acceptance testing</li> <li>Good organizational/time management skills to prioritize work and meet deadlines within defined timeframes</li> <li>Performing/interpreting requirement analysis to identify value creation opportunities for clients</li> <li>Design and document new process and system changes</li> <li>Support QA, UAT and Release phases of the project via defect analysis, change maintenance, etc.</li> <li>Any  other task as may be assigned</li> </ul><p><strong>What We Need:</strong></p><ul> <li>Minimum 3 years of experience as Business Analyst</li> <li>A degree in Business, IT or any relevant field</li> <li>Previous experience working in the insurance industry or Insuretech is a preferred </li> <li>Life Insurance domain certification from INS/LOMA or III is an added advantage</li> <li>Proven experience in eliciting requirements and testing.</li> <li>Analytical and Critical thinking ability.</li> <li>Experience in an Agile and/or Scrum environment is a must.</li> <li>Basic knowledge in generating process documentation.</li> <li>Good written and verbal communication skills in English.</li> <li>Technical Writing and Other languages (Chinese) is a plus</li> <li>Should be able to own the tasks and communicate effectively within the team.</li> <li>Good attitude and self-motivation.</li> <li>Knowledge of business analysis concepts of defining requirements, translating to technical solutions, and Agile approach to prioritizing work to epics, sprints</li> <li>Ability to document system functionality, data integration and workflow</li> </ul><p><strong>Why You'll Love Working Here</strong></p><ul> <li>Fully Remote</li> <li>Flexible Leave</li> <li>International Environment</li> <li>Competitive renumeration package</li> <li>Performance Bonus</li> <li>Stock Options after 6 months </li> <li>Company activities and events</li> <li>Learning and development plan</li> </ul><p><strong>CoverGo Company</strong><a href=\"https://www.youtube.com/watch?v=YI0ezLxvFvA\" rel=\"nofollow noreferrer noopener\" class=\"external\"><strong> Video</strong></a></p><p>By clicking “Apply to this job” and “Submit application”, you confirm that you have read, understood and accepted the content of CoverGo’s <a href=\"https://apply.workable.com/covergo/gdpr_policy?lng=en\" rel=\"nofollow noreferrer noopener\" class=\"external\">Privacy Notice</a> and you consent to the processing of your data as part of this application.</p><p><a href=\"https://www.youtube.com/watch?v=YI0ezLxvFvA\" rel=\"nofollow noreferrer noopener\" class=\"external\"></a></p><h3>Requirements: </h3><h3>Benefits: </h3>","tags":"[\"management\"]","pubDate":"2023-11-22 00:00:00.000","link":"https://apply.workable.com/covergo/j/015F58ED92","savedDate":"2023-11-25 14:15:23.083","slug":"business-analyst-health-insurance-fully-remote-covergo-3443"},{"id":1569056202,"title":"Digital Insurance Project Manager (Fully Remote)","company":"CoverGo","image":"https://pbs.twimg.com/profile_images/1382655628523364355/MWPIbbID_400x400.jpg","description":"<p><strong>Top 3 Reasons To Join Us</strong></p><ul> <li>Share Option Plan</li> <li>100% Remote </li> <li>Insurtech industry leader worldwide </li> </ul><p><strong>About Us</strong></p><p>At CoverGo, our mission is to empower all insurance companies to make insurance 100% digital and accessible to everyone.</p><ul> <li>We are a leading global no-code insurance platform for health, life, and P&amp;C</li> <li>We’re the winner of the Insurtech of the Year in all of Asia and other awards globally</li> <li>We work with insurance enterprise clients such as AXA, Bupa, MSIG, Dai-ichi, Bank of China Group Insurance, and many more</li> <li>We're an international, diverse team of over 120 people with 30 nationalities and team members working remotely from all over the world</li> <li>We are fully funded and backed by reputable VC funds and strategic institutional investors</li> <li>We have a global presence in Asia, EMEA and the Americas</li> <li>We’ve grown our annualized revenue by over 30x since January 2021</li> <li>We’re constantly working towards making CoverGo a workplace that you love coming to. We deeply believe that bringing together a diversity of thoughts, expressions, and perspectives is key to building the best culture for equally diverse communities all over the world</li> </ul><p><strong>What You Will Do</strong></p><ul> <li>Engage and manage relationships with clients and stakeholders</li> <li>Leading project planning sessions with internal and client staff</li> <li>Support solution proposals for client pursuits, proposals, and PoCs</li> <li>Participating in proposal and POC processes (i.e. design, submission and review)</li> <li>Support the creation of contracts and related communication with clients</li> <li>Identifying and helping secure growth opportunities for existing clients</li> <li>Managing project progress and adapting work as required</li> <li>Ensuring projects meet deadlines</li> <li>Managing relationships with clients and stakeholders</li> <li>Lead the team to reach objectives and manage resources in an Agile way (Scrum \\ Kanban) using backlogs, planning, retrospectives</li> <li>Regular/weekly project review and creating reports with key metrics about team and project status using company standard metrics</li> <li>Overseeing all incoming and outgoing project documentation</li> <li>Identify and manage issues, risks, assumptions, and dependencies</li> <li>Continuously optimize and improve processes and the overall approach where necessary</li> </ul><p><strong>What We Need</strong></p><ul> <li>Bachelor's degree in computer science or a related technical field is a plus</li> <li>5+ years experience as a Project Manager</li> <li>Insurance domain knowledge in general is an advantage</li> <li>Strong Client facing experience is a plus</li> <li>Technical skills is a plus</li> <li>Experience seeing projects through the full life cycle</li> <li>Excellent analytical skills and problem-solving skills</li> <li>Strong interpersonal skills and extremely resourceful</li> <li>Proven ability to complete projects according to outlined scope, budget, and timeline</li> <li>Self-motivated and able to work independently</li> <li>Able, willing and excited to work in a fast-paced collaborative startup environment</li> </ul><p><a href=\"https://www.youtube.com/watch?v=YI0ezLxvFvA\" rel=\"nofollow noreferrer noopener\" class=\"external\"></a><strong>Why You'll Love Working Here</strong></p><ul> <li>Fully Remote</li> <li>Flexible Leave</li> <li>International Environment</li> <li>Competitive renumeration package</li> <li>Performance Bonus</li> <li>Stock Options after 6 months </li> <li>Company activities and events</li> <li>Learning and development plan</li> </ul><p><strong>CoverGo Company </strong><a href=\"https://www.youtube.com/watch?v=YI0ezLxvFvA\" rel=\"nofollow noreferrer noopener\" class=\"external\"><strong>Video</strong></a></p><p>By submitting your application, you confirm that you have read, understood, and accepted the content of CoverGo’s <a href=\"https://apply.workable.com/covergo/gdpr_policy?lng=en\" target=\"_blank\" rel=\"nofollow noreferrer noopener\" class=\"external\">Privacy Notice</a> and you consent to the processing of your data as part of this application.</p><p><a href=\"https://www.youtube.com/watch?v=YI0ezLxvFvA\" rel=\"nofollow noreferrer noopener\" class=\"external\"></a></p><h3>Requirements: </h3><h3>Benefits: </h3>","tags":"[]","pubDate":"2023-11-22 00:00:00.000","link":"https://apply.workable.com/covergo/j/257FCEF8E3","savedDate":"2023-11-25 14:15:23.084","slug":"digital-insurance-project-manager-fully-remote-covergo-5704"},{"id":5713363307,"title":"Digital Insurance Project Manager (Fully Remote)","company":"CoverGo","image":"https://pbs.twimg.com/profile_images/1382655628523364355/MWPIbbID_400x400.jpg","description":"<p><strong>Top 3 Reasons To Join Us</strong></p><ul> <li>Share Option Plan</li> <li>100% Remote </li> <li>Insurtech industry leader worldwide </li> </ul><p><strong>About Us</strong></p><p>At CoverGo, our mission is to empower all insurance companies to make insurance 100% digital and accessible to everyone.</p><ul> <li>We are a leading global no-code insurance platform for health, life, and P&amp;C</li> <li>We’re the winner of the Insurtech of the Year in all of Asia and other awards globally</li> <li>We work with insurance enterprise clients such as AXA, Bupa, MSIG, Dai-ichi, Bank of China Group Insurance, and many more</li> <li>We're an international, diverse team of over 120 people with 30 nationalities and team members working remotely from all over the world</li> <li>We are fully funded and backed by reputable VC funds and strategic institutional investors</li> <li>We have a global presence in Asia, EMEA and the Americas</li> <li>We’ve grown our annualized revenue by over 30x since January 2021</li> <li>We’re constantly working towards making CoverGo a workplace that you love coming to. We deeply believe that bringing together a diversity of thoughts, expressions, and perspectives is key to building the best culture for equally diverse communities all over the world</li> </ul><p><strong>What You Will Do</strong></p><ul> <li>Engage and manage relationships with clients and stakeholders</li> <li>Leading project planning sessions with internal and client staff</li> <li>Support solution proposals for client pursuits, proposals, and PoCs</li> <li>Participating in proposal and POC processes (i.e. design, submission and review)</li> <li>Support the creation of contracts and related communication with clients</li> <li>Identifying and helping secure growth opportunities for existing clients</li> <li>Managing project progress and adapting work as required</li> <li>Ensuring projects meet deadlines</li> <li>Managing relationships with clients and stakeholders</li> <li>Lead the team to reach objectives and manage resources in an Agile way (Scrum \\ Kanban) using backlogs, planning, retrospectives</li> <li>Regular/weekly project review and creating reports with key metrics about team and project status using company standard metrics</li> <li>Overseeing all incoming and outgoing project documentation</li> <li>Identify and manage issues, risks, assumptions, and dependencies</li> <li>Continuously optimize and improve processes and the overall approach where necessary</li> </ul><p><strong>What We Need</strong></p><ul> <li>Bachelor's degree in computer science or a related technical field is a plus</li> <li>5+ years experience as a Project Manager</li> <li>Insurance domain knowledge in general is an advantage</li> <li>Strong Client facing experience is a plus</li> <li>Technical skills is a plus</li> <li>Experience seeing projects through the full life cycle</li> <li>Excellent analytical skills and problem-solving skills</li> <li>Strong interpersonal skills and extremely resourceful</li> <li>Proven ability to complete projects according to outlined scope, budget, and timeline</li> <li>Self-motivated and able to work independently</li> <li>Able, willing and excited to work in a fast-paced collaborative startup environment</li> </ul><p><a href=\"https://www.youtube.com/watch?v=YI0ezLxvFvA\" rel=\"nofollow noreferrer noopener\" class=\"external\"></a><strong>Why You'll Love Working Here</strong></p><ul> <li>Fully Remote</li> <li>Flexible Leave</li> <li>International Environment</li> <li>Competitive renumeration package</li> <li>Performance Bonus</li> <li>Stock Options after 6 months </li> <li>Company activities and events</li> <li>Learning and development plan</li> </ul><p><strong>CoverGo Company </strong><a href=\"https://www.youtube.com/watch?v=YI0ezLxvFvA\" rel=\"nofollow noreferrer noopener\" class=\"external\"><strong>Video</strong></a></p><p>By submitting your application, you confirm that you have read, understood, and accepted the content of CoverGo’s <a href=\"https://apply.workable.com/covergo/gdpr_policy?lng=en\" target=\"_blank\" rel=\"nofollow noreferrer noopener\" class=\"external\">Privacy Notice</a> and you consent to the processing of your data as part of this application.</p><p><a href=\"https://www.youtube.com/watch?v=YI0ezLxvFvA\" rel=\"nofollow noreferrer noopener\" class=\"external\"></a></p><h3>Requirements: </h3><h3>Benefits: </h3>","tags":"[]","pubDate":"2023-11-22 00:00:00.000","link":"https://apply.workable.com/covergo/j/610C60BA5A","savedDate":"2023-11-25 14:15:23.084","slug":"digital-insurance-project-manager-fully-remote-covergo-5791"},{"id":4713824672,"title":"Digital Insurance Project Manager (Fully Remote)","company":"CoverGo","image":"https://pbs.twimg.com/profile_images/1382655628523364355/MWPIbbID_400x400.jpg","description":"<p><strong>Top 3 Reasons To Join Us</strong></p><ul> <li>Share Option Plan</li> <li>100% Remote </li> <li>Insurtech industry leader worldwide </li> </ul><p><strong>About Us</strong></p><p>At CoverGo, our mission is to empower all insurance companies to make insurance 100% digital and accessible to everyone.</p><ul> <li>We are a leading global no-code insurance platform for health, life, and P&amp;C</li> <li>We’re the winner of the Insurtech of the Year in all of Asia and other awards globally</li> <li>We work with insurance enterprise clients such as AXA, Bupa, MSIG, Dai-ichi, Bank of China Group Insurance, and many more</li> <li>We're an international, diverse team of over 120 people with 30 nationalities and team members working remotely from all over the world</li> <li>We are fully funded and backed by reputable VC funds and strategic institutional investors</li> <li>We have a global presence in Asia, EMEA and the Americas</li> <li>We’ve grown our annualized revenue by over 30x since January 2021</li> <li>We’re constantly working towards making CoverGo a workplace that you love coming to. We deeply believe that bringing together a diversity of thoughts, expressions, and perspectives is key to building the best culture for equally diverse communities all over the world</li> </ul><p><strong>What You Will Do</strong></p><ul> <li>Engage and manage relationships with clients and stakeholders</li> <li>Leading project planning sessions with internal and client staff</li> <li>Support solution proposals for client pursuits, proposals, and PoCs</li> <li>Participating in proposal and POC processes (i.e. design, submission and review)</li> <li>Support the creation of contracts and related communication with clients</li> <li>Identifying and helping secure growth opportunities for existing clients</li> <li>Managing project progress and adapting work as required</li> <li>Ensuring projects meet deadlines</li> <li>Managing relationships with clients and stakeholders</li> <li>Lead the team to reach objectives and manage resources in an Agile way (Scrum \\ Kanban) using backlogs, planning, retrospectives</li> <li>Regular/weekly project review and creating reports with key metrics about team and project status using company standard metrics</li> <li>Overseeing all incoming and outgoing project documentation</li> <li>Identify and manage issues, risks, assumptions, and dependencies</li> <li>Continuously optimize and improve processes and the overall approach where necessary</li> </ul><p><strong>What We Need</strong></p><ul> <li>Bachelor's degree in computer science or a related technical field is a plus</li> <li>5+ years experience as a Project Manager</li> <li>Insurance domain knowledge in general is an advantage</li> <li>Strong Client facing experience is a plus</li> <li>Technical skills is a plus</li> <li>Experience seeing projects through the full life cycle</li> <li>Excellent analytical skills and problem-solving skills</li> <li>Strong interpersonal skills and extremely resourceful</li> <li>Proven ability to complete projects according to outlined scope, budget, and timeline</li> <li>Self-motivated and able to work independently</li> <li>Able, willing and excited to work in a fast-paced collaborative startup environment</li> </ul><p><a href=\"https://www.youtube.com/watch?v=YI0ezLxvFvA\" rel=\"nofollow noreferrer noopener\" class=\"external\"></a><strong>Why You'll Love Working Here</strong></p><ul> <li>Fully Remote</li> <li>Flexible Leave</li> <li>International Environment</li> <li>Competitive renumeration package</li> <li>Performance Bonus</li> <li>Stock Options after 6 months </li> <li>Company activities and events</li> <li>Learning and development plan</li> </ul><p><strong>CoverGo Company </strong><a href=\"https://www.youtube.com/watch?v=YI0ezLxvFvA\" rel=\"nofollow noreferrer noopener\" class=\"external\"><strong>Video</strong></a></p><p>By submitting your application, you confirm that you have read, understood, and accepted the content of CoverGo’s <a href=\"https://apply.workable.com/covergo/gdpr_policy?lng=en\" target=\"_blank\" rel=\"nofollow noreferrer noopener\" class=\"external\">Privacy Notice</a> and you consent to the processing of your data as part of this application.</p><p><a href=\"https://www.youtube.com/watch?v=YI0ezLxvFvA\" rel=\"nofollow noreferrer noopener\" class=\"external\"></a></p><h3>Requirements: </h3><h3>Benefits: </h3>","tags":"[]","pubDate":"2023-11-22 00:00:00.000","link":"https://apply.workable.com/covergo/j/D7F47EBF79","savedDate":"2023-11-25 14:15:23.084","slug":"digital-insurance-project-manager-fully-remote-covergo-449"},{"id":7257032328,"title":"Digital Insurance Project Manager (Fully Remote)","company":"CoverGo","image":"https://pbs.twimg.com/profile_images/1382655628523364355/MWPIbbID_400x400.jpg","description":"<p><strong>Top 3 Reasons To Join Us</strong></p><ul> <li>Share Option Plan</li> <li>100% Remote </li> <li>Insurtech industry leader worldwide </li> </ul><p><strong>About Us</strong></p><p>At CoverGo, our mission is to empower all insurance companies to make insurance 100% digital and accessible to everyone.</p><ul> <li>We are a leading global no-code insurance platform for health, life, and P&amp;C</li> <li>We’re the winner of the Insurtech of the Year in all of Asia and other awards globally</li> <li>We work with insurance enterprise clients such as AXA, Bupa, MSIG, Dai-ichi, Bank of China Group Insurance, and many more</li> <li>We're an international, diverse team of over 120 people with 30 nationalities and team members working remotely from all over the world</li> <li>We are fully funded and backed by reputable VC funds and strategic institutional investors</li> <li>We have a global presence in Asia, EMEA and the Americas</li> <li>We’ve grown our annualized revenue by over 30x since January 2021</li> <li>We’re constantly working towards making CoverGo a workplace that you love coming to. We deeply believe that bringing together a diversity of thoughts, expressions, and perspectives is key to building the best culture for equally diverse communities all over the world</li> </ul><p><strong>What You Will Do</strong></p><ul> <li>Engage and manage relationships with clients and stakeholders</li> <li>Leading project planning sessions with internal and client staff</li> <li>Support solution proposals for client pursuits, proposals, and PoCs</li> <li>Participating in proposal and POC processes (i.e. design, submission and review)</li> <li>Support the creation of contracts and related communication with clients</li> <li>Identifying and helping secure growth opportunities for existing clients</li> <li>Managing project progress and adapting work as required</li> <li>Ensuring projects meet deadlines</li> <li>Managing relationships with clients and stakeholders</li> <li>Lead the team to reach objectives and manage resources in an Agile way (Scrum \\ Kanban) using backlogs, planning, retrospectives</li> <li>Regular/weekly project review and creating reports with key metrics about team and project status using company standard metrics</li> <li>Overseeing all incoming and outgoing project documentation</li> <li>Identify and manage issues, risks, assumptions, and dependencies</li> <li>Continuously optimize and improve processes and the overall approach where necessary</li> </ul><p><strong>What We Need</strong></p><ul> <li>Bachelor's degree in computer science or a related technical field is a plus</li> <li>5+ years experience as a Project Manager</li> <li>Insurance domain knowledge in general is an advantage</li> <li>Strong Client facing experience is a plus</li> <li>Technical skills is a plus</li> <li>Experience seeing projects through the full life cycle</li> <li>Excellent analytical skills and problem-solving skills</li> <li>Strong interpersonal skills and extremely resourceful</li> <li>Proven ability to complete projects according to outlined scope, budget, and timeline</li> <li>Self-motivated and able to work independently</li> <li>Able, willing and excited to work in a fast-paced collaborative startup environment</li> </ul><p><a href=\"https://www.youtube.com/watch?v=YI0ezLxvFvA\" rel=\"nofollow noreferrer noopener\" class=\"external\"></a><strong>Why You'll Love Working Here</strong></p><ul> <li>Fully Remote</li> <li>Flexible Leave</li> <li>International Environment</li> <li>Competitive renumeration package</li> <li>Performance Bonus</li> <li>Stock Options after 6 months </li> <li>Company activities and events</li> <li>Learning and development plan</li> </ul><p><strong>CoverGo Company </strong><a href=\"https://www.youtube.com/watch?v=YI0ezLxvFvA\" rel=\"nofollow noreferrer noopener\" class=\"external\"><strong>Video</strong></a></p><p>By submitting your application, you confirm that you have read, understood, and accepted the content of CoverGo’s <a href=\"https://apply.workable.com/covergo/gdpr_policy?lng=en\" target=\"_blank\" rel=\"nofollow noreferrer noopener\" class=\"external\">Privacy Notice</a> and you consent to the processing of your data as part of this application.</p><p><a href=\"https://www.youtube.com/watch?v=YI0ezLxvFvA\" rel=\"nofollow noreferrer noopener\" class=\"external\"></a></p><h3>Requirements: </h3><h3>Benefits: </h3>","tags":"[]","pubDate":"2023-11-22 00:00:00.000","link":"https://apply.workable.com/covergo/j/F60CD9900F","savedDate":"2023-11-25 14:15:23.084","slug":"digital-insurance-project-manager-fully-remote-covergo-7644"},{"id":3682441017,"title":"Senior Business Analyst - Health Insurance (Fully Remote)","company":"CoverGo","image":"https://pbs.twimg.com/profile_images/1382655628523364355/MWPIbbID_400x400.jpg","description":"<h3></h3><p><strong>Top 3 Reasons To Join Us</strong> </p><ul> <li>Competitive Salary</li> <li>100% Globally Remote</li> <li>Working on the latest tech for the Insurtech Market Leader</li> </ul><p><strong>About Us</strong></p><p>At CoverGo, our mission is to empower all insurance companies to make insurance 100% digital and accessible to everyone.</p><ul> <li>We are a leading global no-code insurance platform for health, life, and P&amp;C</li> <li>We’re the winner of the Insurtech of the Year in all of Asia and other awards globally</li> <li>We work with insurance enterprise clients such as AXA, Bupa, MSIG, Dai-ichi, Bank of China Group Insurance, and many more</li> <li>We're an international, diverse team of over 120 people with 30 nationalities and team members working remotely from all over the world</li> <li>We are fully funded and backed by reputable VC funds and strategic institutional investors</li> <li>We have a global presence in Asia, EMEA and the Americas</li> <li>We’ve grown our annualized revenue by over 30x since January 2021</li> <li>We’re constantly working towards making CoverGo a workplace that you love coming to. We deeply believe that bringing together a diversity of thoughts, expressions, and perspectives is key to building the best culture for equally diverse communities all over the world</li> </ul><p><strong>What you will do:</strong></p><ul> <li>Applies appropriate methodologies and tools for analyzing a range of standard, functional and/or cross-functional issues</li> <li>Assists in identifying process gaps and issues</li> <li>Plans and designs simple to complex business processes and system modifications. Makes recommendations to improve and support business activities.</li> <li>Gathers business requirements through a variety of techniques such as work sessions and interviews. Analyzes and documents client simple to complex business requirements and processes; communicates these requirements to appropriate parties.</li> <li>Creates complex test case scenarios to be used in testing; monitors/oversees the testing of business applications to verify that all client requirements are incorporated into the system design.</li> <li>Provides input into developing and modifying systems to meet client needs. </li> <li>Develops business requirements documents/user stories to support the required modifications.</li> <li>Coordinates and facilitates meetings with clients to gather and document requirements and explore potential solutions.</li> <li>Coordinates business analyst tasks on information technology projects and provides project team member guidance and support. May plan, allocate and monitor work of other business analysts.</li> <li>Provides time estimates for project related tasks.</li> <li>Provides leadership and work guidance to less experienced personnel.</li> <li>Aids in updating process and procedural documentation</li> <li>Work with clients and technical resources to identify their business problems and develop the right approach and analytical solution</li> <li>Basic understanding of technical development cycle of mobile application or web portals</li> <li>Experience participating in successful projects with cross-functional teams</li> <li>Agile/Scrum Framework for Project Planning &amp; Release Management is a must</li> <li>Ability to understand complex systems and related data to surface actionable insights, demonstrate sound judgment and decision-making skills</li> <li>Business analysis skills including facilitation, process documentation, requirements gathering and user acceptance testing</li> <li>Strong organizational/time management skills to prioritize work and meet deadlines within defined timeframes</li> <li>Performing/interpreting requirement analysis to identify value creation opportunities for clients</li> <li>Design and document new process and system changes</li> <li>Support QA, UAT and Release phases of the project via defect analysis, change maintenance, etc.</li> <li>Any  other task as may be assigned</li> </ul><h3>Requirements: </h3><p><strong>What we need:</strong><br></p><ul> <li>At least 5+ years of experience in a BA role</li> <li>A degree in Business, IT or any relevant field</li> <li>Previous experience working in the insurance industry or Insurtech is a must.</li> <li>Proven experience in eliciting requirements and testing.</li> <li>Experience in an Agile and/or Scrum environment is a must.</li> <li>Basic knowledge in generating process documentation.</li> <li>Strong written and verbal communication skills in English.</li> </ul><p></p><h3>Benefits: </h3><p><strong>Why You'll Love Working Here</strong></p><ul> <li>Fully Remote</li> <li>Flexible Leave</li> <li>International Environment</li> <li>Competitive renumeration package</li> <li>Performance Bonus</li> <li>Stock Options after 6 months</li> <li>Company activities and events</li> <li>Learning and development plan</li> </ul><p><strong>CoverGo Company</strong><a href=\"https://www.youtube.com/watch?v=YI0ezLxvFvA\" rel=\"nofollow noreferrer noopener\" class=\"external\"><strong> Video</strong></a></p><p>By submitting your application, you confirm that you have read, understood, and accepted the content of CoverGo’s <a href=\"https://apply.workable.com/covergo/gdpr_policy?lng=en\" target=\"_blank\" rel=\"nofollow noreferrer noopener\" class=\"external\">Privacy Notice</a> and you consent to the processing of your data as part of this application.</p>","tags":"[\"management\"]","pubDate":"2023-11-22 00:00:00.000","link":"https://apply.workable.com/covergo/j/D6820B934B","savedDate":"2023-11-25 14:15:23.084","slug":"senior-business-analyst-health-insurance-fully-remote-covergo-6424"},{"id":1054444458,"title":"Senior Business Analyst - Health Insurance (Fully Remote)","company":"CoverGo","image":"https://pbs.twimg.com/profile_images/1382655628523364355/MWPIbbID_400x400.jpg","description":"<h3></h3><p><strong>Top 3 Reasons To Join Us</strong> </p><ul> <li>Competitive Salary</li> <li>100% Globally Remote</li> <li>Working on the latest tech for the Insurtech Market Leader</li> </ul><p><strong>About Us</strong></p><p>At CoverGo, our mission is to empower all insurance companies to make insurance 100% digital and accessible to everyone.</p><ul> <li>We are a leading global no-code insurance platform for health, life, and P&amp;C</li> <li>We’re the winner of the Insurtech of the Year in all of Asia and other awards globally</li> <li>We work with insurance enterprise clients such as AXA, Bupa, MSIG, Dai-ichi, Bank of China Group Insurance, and many more</li> <li>We're an international, diverse team of over 120 people with 30 nationalities and team members working remotely from all over the world</li> <li>We are fully funded and backed by reputable VC funds and strategic institutional investors</li> <li>We have a global presence in Asia, EMEA and the Americas</li> <li>We’ve grown our annualized revenue by over 30x since January 2021</li> <li>We’re constantly working towards making CoverGo a workplace that you love coming to. We deeply believe that bringing together a diversity of thoughts, expressions, and perspectives is key to building the best culture for equally diverse communities all over the world</li> </ul><p><strong>What you will do:</strong></p><ul> <li>Applies appropriate methodologies and tools for analyzing a range of standard, functional and/or cross-functional issues</li> <li>Assists in identifying process gaps and issues</li> <li>Plans and designs simple to complex business processes and system modifications. Makes recommendations to improve and support business activities.</li> <li>Gathers business requirements through a variety of techniques such as work sessions and interviews. Analyzes and documents client simple to complex business requirements and processes; communicates these requirements to appropriate parties.</li> <li>Creates complex test case scenarios to be used in testing; monitors/oversees the testing of business applications to verify that all client requirements are incorporated into the system design.</li> <li>Provides input into developing and modifying systems to meet client needs. </li> <li>Develops business requirements documents/user stories to support the required modifications.</li> <li>Coordinates and facilitates meetings with clients to gather and document requirements and explore potential solutions.</li> <li>Coordinates business analyst tasks on information technology projects and provides project team member guidance and support. May plan, allocate and monitor work of other business analysts.</li> <li>Provides time estimates for project related tasks.</li> <li>Provides leadership and work guidance to less experienced personnel.</li> <li>Aids in updating process and procedural documentation</li> <li>Work with clients and technical resources to identify their business problems and develop the right approach and analytical solution</li> <li>Basic understanding of technical development cycle of mobile application or web portals</li> <li>Experience participating in successful projects with cross-functional teams</li> <li>Agile/Scrum Framework for Project Planning &amp; Release Management is a must</li> <li>Ability to understand complex systems and related data to surface actionable insights, demonstrate sound judgment and decision-making skills</li> <li>Business analysis skills including facilitation, process documentation, requirements gathering and user acceptance testing</li> <li>Strong organizational/time management skills to prioritize work and meet deadlines within defined timeframes</li> <li>Performing/interpreting requirement analysis to identify value creation opportunities for clients</li> <li>Design and document new process and system changes</li> <li>Support QA, UAT and Release phases of the project via defect analysis, change maintenance, etc.</li> <li>Any  other task as may be assigned</li> </ul><h3>Requirements: </h3><p><strong>What we need:</strong><br></p><ul> <li>At least 5+ years of experience in a BA role</li> <li>A degree in Business, IT or any relevant field</li> <li>Previous experience working in the insurance industry or Insurtech is a must.</li> <li>Proven experience in eliciting requirements and testing.</li> <li>Experience in an Agile and/or Scrum environment is a must.</li> <li>Basic knowledge in generating process documentation.</li> <li>Strong written and verbal communication skills in English.</li> </ul><p></p><h3>Benefits: </h3><p><strong>Why You'll Love Working Here</strong></p><ul> <li>Fully Remote</li> <li>Flexible Leave</li> <li>International Environment</li> <li>Competitive renumeration package</li> <li>Performance Bonus</li> <li>Stock Options after 6 months</li> <li>Company activities and events</li> <li>Learning and development plan</li> </ul><p><strong>CoverGo Company</strong><a href=\"https://www.youtube.com/watch?v=YI0ezLxvFvA\" rel=\"nofollow noreferrer noopener\" class=\"external\"><strong> Video</strong></a></p><p>By submitting your application, you confirm that you have read, understood, and accepted the content of CoverGo’s <a href=\"https://apply.workable.com/covergo/gdpr_policy?lng=en\" target=\"_blank\" rel=\"nofollow noreferrer noopener\" class=\"external\">Privacy Notice</a> and you consent to the processing of your data as part of this application.</p>","tags":"[\"management\"]","pubDate":"2023-11-22 00:00:00.000","link":"https://apply.workable.com/covergo/j/75EDD45B32","savedDate":"2023-11-25 14:15:23.085","slug":"senior-business-analyst-health-insurance-fully-remote-covergo-4622"},{"id":3324815989,"title":"Senior Business Analyst - Health Insurance (Fully Remote)","company":"CoverGo","image":"https://pbs.twimg.com/profile_images/1382655628523364355/MWPIbbID_400x400.jpg","description":"<h3></h3><p><strong>Top 3 Reasons To Join Us</strong> </p><ul> <li>Competitive Salary</li> <li>100% Globally Remote</li> <li>Working on the latest tech for the Insurtech Market Leader</li> </ul><p><strong>About Us</strong></p><p>At CoverGo, our mission is to empower all insurance companies to make insurance 100% digital and accessible to everyone.</p><ul> <li>We are a leading global no-code insurance platform for health, life, and P&amp;C</li> <li>We’re the winner of the Insurtech of the Year in all of Asia and other awards globally</li> <li>We work with insurance enterprise clients such as AXA, Bupa, MSIG, Dai-ichi, Bank of China Group Insurance, and many more</li> <li>We're an international, diverse team of over 120 people with 30 nationalities and team members working remotely from all over the world</li> <li>We are fully funded and backed by reputable VC funds and strategic institutional investors</li> <li>We have a global presence in Asia, EMEA and the Americas</li> <li>We’ve grown our annualized revenue by over 30x since January 2021</li> <li>We’re constantly working towards making CoverGo a workplace that you love coming to. We deeply believe that bringing together a diversity of thoughts, expressions, and perspectives is key to building the best culture for equally diverse communities all over the world</li> </ul><p><strong>What you will do:</strong></p><ul> <li>Applies appropriate methodologies and tools for analyzing a range of standard, functional and/or cross-functional issues</li> <li>Assists in identifying process gaps and issues</li> <li>Plans and designs simple to complex business processes and system modifications. Makes recommendations to improve and support business activities.</li> <li>Gathers business requirements through a variety of techniques such as work sessions and interviews. Analyzes and documents client simple to complex business requirements and processes; communicates these requirements to appropriate parties.</li> <li>Creates complex test case scenarios to be used in testing; monitors/oversees the testing of business applications to verify that all client requirements are incorporated into the system design.</li> <li>Provides input into developing and modifying systems to meet client needs. </li> <li>Develops business requirements documents/user stories to support the required modifications.</li> <li>Coordinates and facilitates meetings with clients to gather and document requirements and explore potential solutions.</li> <li>Coordinates business analyst tasks on information technology projects and provides project team member guidance and support. May plan, allocate and monitor work of other business analysts.</li> <li>Provides time estimates for project related tasks.</li> <li>Provides leadership and work guidance to less experienced personnel.</li> <li>Aids in updating process and procedural documentation</li> <li>Work with clients and technical resources to identify their business problems and develop the right approach and analytical solution</li> <li>Basic understanding of technical development cycle of mobile application or web portals</li> <li>Experience participating in successful projects with cross-functional teams</li> <li>Agile/Scrum Framework for Project Planning &amp; Release Management is a must</li> <li>Ability to understand complex systems and related data to surface actionable insights, demonstrate sound judgment and decision-making skills</li> <li>Business analysis skills including facilitation, process documentation, requirements gathering and user acceptance testing</li> <li>Strong organizational/time management skills to prioritize work and meet deadlines within defined timeframes</li> <li>Performing/interpreting requirement analysis to identify value creation opportunities for clients</li> <li>Design and document new process and system changes</li> <li>Support QA, UAT and Release phases of the project via defect analysis, change maintenance, etc.</li> <li>Any  other task as may be assigned</li> </ul><h3>Requirements: </h3><p><strong>What we need:</strong><br></p><ul> <li>At least 5+ years of experience in a BA role</li> <li>A degree in Business, IT or any relevant field</li> <li>Previous experience working in the insurance industry or Insurtech is a must.</li> <li>Proven experience in eliciting requirements and testing.</li> <li>Experience in an Agile and/or Scrum environment is a must.</li> <li>Basic knowledge in generating process documentation.</li> <li>Strong written and verbal communication skills in English.</li> </ul><p></p><h3>Benefits: </h3><p><strong>Why You'll Love Working Here</strong></p><ul> <li>Fully Remote</li> <li>Flexible Leave</li> <li>International Environment</li> <li>Competitive renumeration package</li> <li>Performance Bonus</li> <li>Stock Options after 6 months</li> <li>Company activities and events</li> <li>Learning and development plan</li> </ul><p><strong>CoverGo Company</strong><a href=\"https://www.youtube.com/watch?v=YI0ezLxvFvA\" rel=\"nofollow noreferrer noopener\" class=\"external\"><strong> Video</strong></a></p><p>By submitting your application, you confirm that you have read, understood, and accepted the content of CoverGo’s <a href=\"https://apply.workable.com/covergo/gdpr_policy?lng=en\" target=\"_blank\" rel=\"nofollow noreferrer noopener\" class=\"external\">Privacy Notice</a> and you consent to the processing of your data as part of this application.</p>","tags":"[\"management\"]","pubDate":"2023-11-22 00:00:00.000","link":"https://apply.workable.com/covergo/j/A4AA04FD7B","savedDate":"2023-11-25 14:15:23.085","slug":"senior-business-analyst-health-insurance-fully-remote-covergo-3908"},{"id":4397234724,"title":"Data Annotator - Work Anywhere/Remote","company":"CloudLinux","image":"https://pbs.twimg.com/profile_images/696718028084482050/ymY3OEPk_400x400.png","description":"<p></p><p>Our Imunify team is seeking a Data Annotator.&nbsp; The Imunify Email team is a small but dedicated team to the Imunify Email project. Our mission is to create an advanced email protection system with cutting-edge filtering features designed to protect hosts’ reputations and reduce administrative burden. With its robust data processing capabilities, Imunify Email is a versatile tool for analyzing email traffic, and we’re excited to have you on board.</p><p>About our Imunify Team</p><p>Imunify360 Security Suite is a product of CloudLinux Inc., the maker of the #1 OS in security and stability for hosting providers. Imunify is an innovative security solution designed specifically for shared and VPS/Dedicated servers. The automated, easy-to-use solution with the six-layer approach to security delivers comprehensive and complete attack prevention. Check out our website for more information about our Imunify Product <a href=\"https://www.imunify360.com/\" target=\"_blank\" rel=\"nofollow noreferrer noopener\" class=\"external\">https://www.imunify360.com/</a></p><p>As our Data Annotator you’ll dive into the world of email messages. Your key focus is to extract, examine, and label interesting data from various sources. You will actively participate in our brainstorming sessions and share your insights to continually enhance our product.</p><p></p><h3>As our Data Annotator you will</h3><ul> <li>Expertly classify emails as spam or non-spam (ham) based on their content</li> <li>Identify trends and patterns in spam emails, helping us stay one step ahead of the game</li> <li>Contribute your valuable feedback to ensure top-notch data quality</li> <li>Be the process improvement champion by reporting and documenting issues</li> </ul><p></p><p></p><p></p><p></p><p></p><h3>Requirements: </h3><h3>To be successful you should have</h3><ul> <li>Previous experience in data annotation and data labeling</li> <li>Familiarity with using the command line</li> <li>Knowledge of the SMTP protocol and its extensions</li> <li>A strong commitment to reliability and attention to detail</li> <li>Solid organization skills to keep things running smoothly</li> <li>The ability to work independently and efficiently</li> <li>Proficiency in both written and spoken English;&nbsp;</li> <li>Strong consideration for candidates who are proficient in other languages</li> </ul><h3>Benefits: </h3><p><strong>What's in it for you?</strong></p><ul> <li>A focus on professional development; </li> <li>An interesting and challenging projects</li> <li>Flexible working hours</li> <li>Paid one month of vacation per year and unlimited sick leave</li> <li>Medical insurance reimbursement</li> <li>Co-working and gym/sports reimbursement</li> <li>The opportunity to receive a reward for the most innovative idea that the company can patent.</li> </ul><p><em>By applying for this position, you agree with </em><a href=\"https://cloudlinux.com/privacy-policy\" rel=\"nofollow noreferrer noopener\" class=\"external\"><em>Cloudlinux Privacy Policy</em></a><em> and give us your consent to maintain and process your personal data with this respect. Please read our Privacy Policy for more information.</em></p>","tags":"[]","pubDate":"2023-11-13 00:00:00.000","link":"https://apply.workable.com/cloudlinux-1/j/E189C469E0","savedDate":"2023-11-25 14:15:23.081","slug":"data-annotator-work-anywhere-remote-cloudlinux-4396"}]