[{"id":4297080045,"title":"Social Media Marketing Manager","company":"Rainfall","image":"https://remotive.com/job/1994045/logo","description":"<p><strong>Social Media Marketing Manager – Instagram Focus (Remote)</strong></p>\n<p> </p>\n<p><strong>About Us</strong></p>\n<p>We're a fast-moving, mission-driven team at the intersection of AI, Web3, and data ownership. Our platform empowers individuals to 'self-own' their Personal AI and unlock the benefits, and we're building a world-class community around that vision. We're looking for a creative and strategic <strong>Social Media Marketer</strong> with a focus on <strong>Instagram</strong> to help us grow our presence, drive engagement, and amplify partnerships with major celebrities.</p>\n<p> </p>\n<p><strong>The Role</strong></p>\n<p>We're seeking a content-savvy, results-oriented <strong>Social Media Marketer</strong> to own and execute our Instagram strategy. You'll be at the forefront of our social efforts—crafting compelling content, coordinating with high-profile partners, and helping define our presence on Instagram. This role requires someone who is equal parts strategic thinker and hands-on creator, with the ability to work independently while collaborating closely with internal and external stakeholders.</p>\n<p> </p>\n<p><strong>What You'll Do</strong></p>\n<p>• Lead the development and execution of our Instagram content strategy—including Reels, Stories, carousels, and posts.</p>\n<p>• Create engaging, high-quality content that speaks to our community, product, and broader cultural relevance.</p>\n<p>• Collaborate with design teammates to develop short-form video and visual assets.</p>\n<p>• Coordinate closely with <strong>celebrity partners and their social media teams</strong> to co-create and schedule aligned content across channels.</p>\n<p>• Write concise, impactful copy and stories that reflects our voice and values.</p>\n<p>• Track performance and provide insights to refine and evolve our strategy.</p>\n<p>• Take ownership, move fast, and bring ideas to life with minimal oversight—while being open and responsive to feedback.</p>\n<p> </p>\n<p><strong>What We're Looking For</strong></p>\n<p>• 5+ years of experience managing Instagram content for tech, Web3, blockchain, or culture-forward brands.</p>\n<p>• Proven success creating engaging content (written and video) that resonates and drives action.</p>\n<p>• Experience working directly with <strong>entertainment or music industry partners</strong> and coordinating with their teams.</p>\n<p>• Deep understanding of Instagram trends, audience behavior, and best practices for high-growth accounts.</p>\n<p>• Comfortable using tools like CapCut, Canva, Adobe Suite, and native IG video editing tools.</p>\n<p>• Self-starter who thrives in a fast-paced environment and can juggle multiple projects with ease.</p>\n<p>• Strategic mindset with an eye for detail, creative quality, and brand consistency.</p>\n<p>• Excellent communication and interpersonal skills, especially when interfacing with high-profile stakeholders.</p>\n<p> </p>\n<p><strong>Nice to Have</strong></p>\n<p>• Experience with multi-platform campaigns (Twitter/X, TikTok, YouTube Shorts, etc.).</p>\n<p>• Background in influencer marketing or talent partnerships.</p>\n<p>• Familiarity with Web3, decentralization, or the creator economy space.</p>\n<p> </p>\n<p><strong>Location</strong></p>\n<p>Remote – open to candidates globally, with some availability to overlap with US time zones.</p>\n<img src=\"https://remotive.com/job/track/1994045/blank.gif?source=public_api\" alt=\"\"/>","tags":"[\"social media\",\"video\",\"blockchain\",\"AI/ML\",\"youtube\",\"partnerships\",\"editing\",\"responsive\",\"adobe suite\"]","pubDate":"2025-04-12T00:50:35.000Z","link":"https://remotive.com/remote-jobs/marketing/social-media-marketing-manager-1994045","slug":"social-media-marketing-manager-rainfall-1456"},{"id":2270263311,"title":"Office Assistant","company":"Coalition Technologies ","image":"https://remotive.com/job/1680495/logo","description":"<p class=\"h3\">WHY YOU SHOULD APPLY:</p>\n<p> </p>\n<p>Coalition Technologies is devoted to delivering clients the highest quality work while providing our team a fun, thriving, and innovative environment. Along with the opportunity for tremendous career growth and rapid advancement, CT offers:</p>\n<ul style=\"\">\n<li style=\"\">The most competitive profit-sharing bonus plan in the industry, paying up to 50% of company profits to full-time employees each month!</li>\n<li style=\"\">A highly competitive Paid Time Off plan, promoting quality work-life balance.</li>\n<li style=\"\">Subsidized gym memberships to help team members feel their best.</li>\n<li style=\"\">Medical, dental, vision, and life insurance packages for all US-based team members.</li>\n<li style=\"\">International Health Insurance Reimbursement Program for all international team members, a benefit unique to Coalition.</li>\n<li style=\"\">Device upgrade and learning reimbursement programs.</li>\n<li style=\"\">Motivating career development plans with clearly defined goals and rewards.</li>\n<li style=\"\">Additional job-specific incentives and bonuses.<br><br></li>\n</ul>\n<p>Plus, 100% of our team works remotely with the support of time tracking software. Our company culture specializes in supporting remote team members, and we’ve been doing so for more than a decade. CT welcomes your application, wherever in the world it's coming from!</p>\n<p class=\"h3\"> </p>\n<p class=\"h3\">YOU SHOULD HAVE:</p>\n<p> </p>\n<ul style=\"\">\n<li style=\"\">Willingness to learn, grow, and collaborate with the team and company as a whole.</li><li style=\"\">Excellent verbal and written communication skills.</li><li style=\"\">A high level of discretion, ethics, and trustworthiness.</li><li style=\"\">Intermediate spreadsheet skills (preferred)</li><li style=\"\">Innovative thinking and a willingness to challenge existing methods where improvement is possible.</li><li style=\"\">Experience in bookkeeping / financial record keeping (preferred).</li><li style=\"\">Experience with Google Sheets or Excel, Quickbooks Online, and G-Suite (preferred).</li><li style=\"\">The availability to work 40 hours per week from 9:00 am to 6:00 pm PST.</li><li style=\"\">A reliable space to work remotely with a fast computer, quality internet, camera, microphone, and speakers.</li>\n</ul>\n<p class=\"h3\"> </p>\n<p class=\"h3\">YOUR DUTIES AND TASKS:</p>\n<p> </p>\n<ul style=\"\">\n<li style=\"\">Answering phones and emails.</li><li style=\"\">Completing entry-level bookkeeping, including recording expenses, organizing receipts, and completing other transaction records.</li><li style=\"\">Resolving billing issues with clients and internal team members.</li><li style=\"\">Providing account access, usage reports, data analysis, and other ad hoc requests for team members.</li><li style=\"\">Supporting quality assurance checks of various internal and client facing reporting.</li><li style=\"\">Organizing new client contracts, create invoices, and process client payments.</li><li style=\"\">Contributing to internal database maintenance, upkeep and data entry.</li><li style=\"\">Researching, ordering, &amp; distributing company-wide gifts (2-3 times per year).</li><li style=\"\">Organizing company events, competitions, and special projects throughout the year.</li><li style=\"\">Facilitating company holiday, time off, and schedule variation calendars.</li>\n</ul>\n<p class=\"h5\"> </p>\n<p class=\"h5\">We are looking for talented and diligent candidates who excel in our skills tests, and will consider these candidates even if past experience or educational background criteria aren't met.</p>\n<p class=\"h5\"> </p>\n<p>*California, New York, Washington, and Colorado: starting base pay for this position ranges between $15 - $25 per hour.</p>\n<p>Compensation may vary based on factors such as experience, qualifications, skills test performance, geographic location, and seniority of the position offered. Outside of California, New York, Washington, and Colorado compensation may fall outside the above ranges.</p>\n<img src=\"https://remotive.com/job/track/1680495/blank.gif?source=public_api\" alt=\"\"/>","tags":"[\"CSS\",\"excel\",\"frontend\",\"git\",\"html\",\"illustrator\",\"magento\",\"photoshop\",\"php\",\"shopify\",\"wordpress\",\"MySQL\",\"startup\",\"responsive\",\"themes\",\"bootstrap\",\"insurance\",\"jQuery\",\"Ajax\"]","pubDate":"2025-04-11T18:30:56.000Z","link":"https://remotive.com/remote-jobs/marketing/office-assistant-1680495","slug":"office-assistant-coalition-technologies-1728"},{"id":6633036021,"title":"Senior Software Engineer C++","company":"Tether","image":"https://remotive.com/job/1996157/logo","description":"<p><strong>Join Tether and Shape the Future of Digital Finance</strong></p><p>At\r\n Tether, we’re not just building products, we’re pioneering a global \r\nfinancial revolution. Our cutting-edge solutions empower businesses—from\r\n exchanges and wallets to payment processors and ATMs—to seamlessly \r\nintegrate reserve-backed tokens across blockchains. By harnessing the \r\npower of blockchain technology, Tether enables you to store, send, and \r\nreceive digital tokens instantly, securely, and globally, all at a \r\nfraction of the cost. Transparency is the bedrock of everything we do, \r\nensuring trust in every transaction.</p><p><strong><em><br>Innovate with Tether</em></strong><br><strong>Tether Finance: </strong>Our innovative product suite features the world’s most trusted stablecoin, <strong>USDT</strong>, relied upon by hundreds of millions worldwide, alongside pioneering digital asset tokenization services.<br>But that’s just the beginning:<br><strong>Tether Power: </strong>Driving\r\n sustainable growth, our energy solutions optimize excess power for \r\nBitcoin mining using eco-friendly practices in state-of-the-art, \r\ngeo-diverse facilities.<br><strong>Tether Data: </strong>Fueling \r\nbreakthroughs in AI and peer-to-peer technology, we reduce \r\ninfrastructure costs and enhance global communications with cutting-edge\r\n solutions like <strong>KEET</strong>, our flagship app that redefines secure and private data sharing.<br><strong>Tether Education</strong>:\r\n Democratizing access to top-tier digital learning, we empower \r\nindividuals to thrive in the digital and gig economies, driving global \r\ngrowth and opportunity.<br><strong>Tether Evolution</strong>: At the \r\nintersection of technology and human potential, we are pushing the \r\nboundaries of what is possible, crafting a future where innovation and \r\nhuman capabilities merge in powerful, unprecedented ways.<br><br><strong><em>Why Join Us?</em></strong><br>Our\r\n team is a global talent powerhouse, working remotely from every corner \r\nof the world. If you’re passionate about making a mark in the fintech \r\nspace, this is your opportunity to collaborate with some of the \r\nbrightest minds, pushing boundaries and setting new standards. We’ve \r\ngrown fast, stayed lean, and secured our place as a leader in the \r\nindustry.<br>If you have excellent English communication skills and are \r\nready to contribute to the most innovative platform on the planet, \r\nTether is the place for you.<br><strong><br>Are you ready to be part of the future?</strong></p><p><strong><br></strong></p><div class=\"h1\"><strong>About the job:</strong></div><p>At\r\n Tether, we're committed to making advanced AI technologies more \r\naccessible. Thanks to its investment in AI infrastructure, starting from\r\n Northern Data, Tether is now in a prime position to tackle ambitious AI\r\n projects. Our goal is to build the next generation of AI models, \r\nleading innovation in AI, through an accessible, transparent and privacy\r\n preserving approach. <br> <br>The role involves building AI solutions \r\nacross the spectrum from large-scale models designed for advanced \r\napplications to smaller, highly performant models tailored for \r\nefficiency on edge devices such as mobile phones and laptops. <br> <br>Our\r\n dynamic team operates entirely remotely, uniting talent from every \r\ncorner of the globe. Our journey has been marked by rapid growth and \r\nefficient operations, firmly establishing us as pioneers within the \r\nindustry. Join us in building AI models and solutions that not only \r\ncompete with but exceed the capabilities of current leaders, driving \r\nboth technological advancement and broad accessibility.</p><p><br></p><p><strong>Responsibilities:</strong></p><ul style=\"\"><li style=\"\"><p>Work on low level libraries and modules in various domains.</p></li><li style=\"\"><p>Collaborate\r\n closely with researchers to assist in coding, training and \r\ntransitioning models from research to production environments.</p></li><li style=\"\"><p>Integrate AI features into existing products, enriching them with the latest advancements in machine learning.</p></li></ul><p class=\"h2\"><br></p><p class=\"h2\">Job requirements</p><ul style=\"\"><li style=\"\"><p><strong>5+ years of experience</strong> working with C and C++.</p></li><li style=\"\"><p>Experience working in low level OS / Systems / Kernel development.</p></li><li style=\"\"><p>Experience in low level networking.</p></li><li style=\"\"><p>Knowledge of other languages such as Rust and Javascript is a nice to have.</p></li><li style=\"\"><p>Demonstrated ability to rapidly assimilate new technologies and techniques.</p></li><li style=\"\"><p>A degree in Computer Science complemented by a solid track record in development.</p></li></ul>\n<img src=\"https://remotive.com/job/track/1996157/blank.gif?source=public_api\" alt=\"\"/>","tags":"[\"C\",\"C++\",\"javascript\",\"blockchain\",\"AI/ML\",\"research\",\"rust\",\"bitcoin\",\"SOLID\",\"kernel\",\"fintech\",\"computer science\",\"infrastructure\"]","pubDate":"2025-04-11T10:38:53.000Z","link":"https://remotive.com/remote-jobs/software-dev/senior-software-engineer-c-1996157","slug":"senior-software-engineer-c-tether-2805"}]