[{"id":5594037853,"title":"Community Manager, Nomad Citizen","company":"SafetyWing","image":"https://pbs.twimg.com/profile_images/1177267684574208000/54eG3WmW_400x400.jpg","description":"<h2>🧘 Why Join SafetyWing?</h2> <ul><li><!--block-->You’ll be at the <strong>forefront of building a new kind of citizenship</strong>.</li><li><!--block-->Work with a <strong>mission-driven, international team</strong> creating a borderless world.</li><li><!--block-->Fully <strong>remote role</strong>—work from anywhere.</li><li><!--block-->Competitive <strong>salary and benefits</strong>.</li><li><!--block-->The opportunity to <strong>help shape an early-stage product</strong> with direct influence on its success.</li></ul><div><!--block--><br>🚀 We look forward to hearing from you!</div> <div><!--block-->At SafetyWing, we are building a <strong>global social safety net</strong> designed for remote workers, digital nomads, and global citizens. Our mission is to create a <strong>borderless world</strong> where everyone has access to essential services, no matter where they live or work.</div><div><!--block--><br>We started with <strong>Nomad Insurance</strong> and <strong>Remote Health</strong>, offering healthcare solutions for remote teams and individuals. Now, we’re launching <strong>Nomad Citizen</strong>—a borderless, digital subscription product that includes:</div><ul><li><!--block-->A <strong>global social safety net</strong> of insurance products.</li><li><!--block-->Access to <strong>nomad visas and residency pathways</strong> worldwide.</li><li><!--block-->Exclusive <strong>media and content for global citizens</strong>.</li></ul><div><!--block-->We’re looking for a <strong>Community</strong> <strong>Manager </strong>to <strong>find, onboard, and engage our first 500 Nomad Citizens</strong>, shaping the foundation of this new product category.</div> <h2>💻 About the role</h2>  <div><!--block-->As <strong>Community Manager, Nomad Citizen</strong>, your role is to <strong>identify and build deep relationships</strong> with our early adopters and create a thriving, interconnected community. You’ll be the <strong>first point of contact</strong>, acting as the connector, champion, and voice of our members—helping them navigate the experience, find relevant opportunities to better serve our members, and meet each other.<br><br>This role is highly <strong>experimental</strong>—we’re looking for someone who will <strong>do things that don’t scale</strong> in the early stages. You’ll need to understand the <strong>ecosystem of digital nomads, global citizens, and longevity enthusiasts</strong>, tapping into existing platforms and communities rather than trying to build something entirely new from scratch.<br><br><strong>&nbsp;🧪 Your Responsibilities</strong></div><ul><li><!--block--><strong>Find and recruit the first 500 Nomad Citizens</strong> by engaging in key circles (digital nomads, global citizens, longevity enthusiasts, etc.).</li><li><!--block--><strong>Onboard and support new members</strong>, ensuring they have a seamless and joyful experience.</li><li><!--block-->Act as an <strong>account manager</strong>, being the go-to person for any questions, support, and feedback.</li><li><!--block--><strong>Create meaningful connections</strong> between members by facilitating introductions, meetups, and collaborations.</li><li><!--block-->Track where people are and <strong>connect them when they’re in the same location</strong>.</li><li><!--block-->Leverage <strong>existing platforms and communities</strong> to engage members—no need to build new ones.</li><li><!--block-->Work closely with <strong>product and communications teams</strong> to integrate community ideas and feedback into development and messaging.</li><li><!--block-->Experiment with <strong>creative ways to engage members</strong>, prioritizing relationships over scale.</li><li><!--block-->Be the <strong>champion of community</strong>, ensuring it aligns with SafetyWing’s mission and values.</li></ul> <h2>😀 You Might Be a Good Fit If You:</h2> <ul><li><!--block-->Have <strong>experience in community building, product development, or growth</strong>.</li><li><!--block-->Are well-connected in digital <strong>nomad, global citizen, or longevity circles</strong> (or know how to break into them).</li><li><!--block-->Keen to develop a strong <strong>vision of potential target audiences</strong> for this product.</li><li><!--block-->Love <strong>connecting people</strong>—you’re a natural <strong>human switchboard</strong> who knows who should meet whom.</li><li><!--block-->Are proactive, <strong>independent, and comfortable with ambiguity</strong>—you thrive in experimental roles.</li><li><!--block-->Enjoy building <strong>deep, personal relationships</strong> with users and being an advocate for their needs.</li><li><!--block-->Can <strong>work across multiple teams</strong> (product, marketing, comms) to integrate community insights.</li></ul>","tags":"[]","pubDate":"2025-02-14T11:47:48.334Z","link":"https://safetywing.pinpointhq.com/en/jobs/313718","slug":"community-manager-nomad-citizen-safetywing-3292"},{"id":3938174481,"title":"Linux Kernel Engineer","company":"Canonical","image":"https://pbs.twimg.com/profile_images/1673959375340290050/x7pNtXQ7_400x400.jpg","description":"\n      <p>This is a general track for applications to any team at Canonical that works with the Linux kernel, across all seniority levels. Apply here if you are an exceptional software engineer who wants to work on both stable and cutting edge Linux kernels for Ubuntu and its wider ecosystem.</p>\n<p>Canonical has a large and rapidly growing kernel team that underpins Ubuntu and open source more widely across a very wide range of hardware and use cases. We partner with the biggest kernel contributors - the silicon companies - to ensure that their work reaches the widest possible audience as quickly&nbsp; as possible, with a 10 year enterprise security commitment.</p>\n<p>The Canonical Linux Kernel Organization has teams in every time zone. We have opportunities for technical leadership, engineering management, and engineering directorships. The team is responsible for all supported Ubuntu Linux kernels, on all platforms and architectures from small embedded devices to standard desktop/server systems to large scale cloud environments, mainframes and supercomputers.</p>\n<p>We care most about hardware and virtualization enablement, security, reliability and performance. There are a number of areas where we lead upstream, but for the most part we are interested in ensuring production readiness and performance for the latest patchsets, rather than subsystem maintenance or evolution.</p>\n<p>Kernel Team projects include but are not limited to:</p>\n<ul>\n<li>Ubuntu Linux kernel plan, execution, benchmarking and stress testing</li>\n<li>Optimised kernels for key silicon and cloud partners</li>\n<li>Confidential computing and next-generation security primitives</li>\n<li>Developer platforms such as Raspberry Pi and RISC-V</li>\n<li>Enabling Ubuntu on a wide range of embedded systems</li>\n<li>Kernel Livepatch, which delivers critical kernel fixes without rebooting</li>\n<li>FIPS compliance</li>\n<li>Real-Time and Low Latency kernel variants and patchsets</li>\n<li>Virtualisation or abstraction engines</li>\n<li>Container technology</li>\n<li>Security with AppArmor, SECCOMP, namespaces and more</li>\n<li>Networking - in particular performance and security</li>\n<li>Storage - we are particularly interested in Ceph and DRBD</li>\n</ul>\n<p>We hire candidates of all experience levels from recent university graduates through seasoned industry experts. We select those who are enthusiastic to work in multiple areas including security mitigation, feature development, patching and test.&nbsp; You must have outstanding academic results, a background in software engineering, be motivated to work in a distributed team and willing to travel globally twice a year for company engineering events.</p>\n<p><strong>Location:</strong> Working from home, worldwide.&nbsp; &nbsp;We have kernel teams and openings in every time zone and with the notable exception of Taipei, Taiwan, have no offices and therefore no pressure to work from an office.</p>\n<h2>What your day will look like</h2>\n<ul>\n<li>Collaborate regularly and proactively with a globally distributed team&nbsp;</li>\n<li>Work closely with silicon, cloud, or hardware manufacturers</li>\n<li>Diagnose and resolve issues in the kernel</li>\n<li>Take personal responsibility for a flavour of the Ubuntu Linux kernel</li>\n<li>Improve tooling and automation for delivery and test of Ubuntu Linux kernels</li>\n<li>Submit, review, and apply kernel patches</li>\n</ul>\n<h2>What we are looking for in you</h2>\n<ul>\n<li>An exceptional academic track record from both high school and university</li>\n<li>Undergraduate degree in Computer Science or STEM, or a compelling narrative about your alternative path</li>\n<li>Drive and a track record of going above-and-beyond expectations</li>\n<li>Well-organised, self-starting and able to deliver to fixed schedules</li>\n<li>Professional manner interacting with colleagues, partners, and community</li>\n<li>Ability to communicate effectively in English, both written and oral</li>\n<li>Significant programming experience in C</li>\n<li>Solid background with git</li>\n<li>Broad knowledge of the Linux kernel and kernel subsystems</li>\n<li>Demonstrated experience with kernel patching and debugging</li>\n<li>Understanding of Linux kernel upstream processes and release cycle</li>\n<li>Strong grasp of device drivers, BSP’s, and other low level system engineering</li>\n<li>Professional written and spoken English&nbsp;</li>\n<li>Experience with Linux (Debian or Ubuntu preferred)&nbsp;</li>\n<li>Excellent interpersonal skills, curiosity, flexibility, and accountability&nbsp;</li>\n<li>Passion, thoughtfulness, and self-motivation&nbsp;</li>\n<li>Excellent communication and presentation skills&nbsp;</li>\n<li>Result-oriented, with a personal drive to meet commitments&nbsp;</li>\n<li>Ability to travel twice a year, for company events up to two weeks each</li>\n</ul>\n<h2>Additional skills that you might also bring</h2>\n<ul>\n<li>Python and Bash scripting</li>\n<li>Prior experience with Ubuntu/Debian/Snap packaging</li>\n<li>Performance engineering and security experience</li>\n</ul>\n<h2>What we offer you</h2>\n<p>We consider geographical location, experience, and performance in shaping compensation worldwide. We revisit compensation annually (and more often for graduates and associates) to ensure we recognise outstanding performance. In addition to base pay, we offer a performance-driven annual bonus. We provide all team members with additional benefits, which reflect our values and ideals. We balance our programs to meet local needs and ensure fairness globally.</p>\n<ul>\n<li>Distributed work environment with twice-yearly team sprints in person</li>\n<li>Personal learning and development budget of USD 2,000 per year</li>\n<li>Annual compensation review</li>\n<li>Recognition rewards</li>\n<li>Annual holiday leave</li>\n<li>Maternity and paternity leave</li>\n<li>Employee Assistance Programme</li>\n<li>Opportunity to travel to new locations to meet colleagues</li>\n<li>Priority Pass, and travel upgrades for long haul company events</li>\n</ul>\n<h2>About Canonical</h2>\n<p>Canonical is a pioneering tech firm at the forefront of the global move to open source. As the company that publishes Ubuntu, one of the most important open source projects and the platform for AI, IoT and the cloud, we are changing the world on a daily basis. We recruit on a global basis and set a very high standard for people joining the company. We expect excellence - in order to succeed, we need to be the best at what we do. Canonical has been a remote-first company since its inception in 2004.​ Working here is a step into the future, and will challenge you to think differently, work smarter, learn new skills, and raise your game.</p>\n<h2>Canonical is an equal opportunity employer</h2>\n<p>We are proud to foster a workplace free from discrimination. Diversity of experience, perspectives, and background create a better work environment and better products.<a href=\"https://canonical.com/careers/diversity/identity\"> Whatever your identity, we will give your application fair consideration.</a></p>\n<p>#LI-remote</p><p>Requisition ID: 1091</p><p></p>\n    ","tags":"[\"management\",\"engineering\"]","pubDate":"2025-02-14T11:47:48.334Z","link":"https://canonical.com/careers/5151903","slug":"linux-kernel-engineer-canonical-28"},{"id":8790410807,"title":"Director of Engineering, Vietnam","company":"Clearer","image":"https://avatars.githubusercontent.com/u/100294047?s=200&v=4","description":"<div><b>Take the Clearer route to smart career growth.</b>&nbsp;At&nbsp;<a rel=\"noopener noreferrer\" class=\"postings-link\" href=\"http://clearer.io/\">Clearer.io</a>, we’re reimagining eCommerce by enhancing search, discovery, and customer engagement through a standout suite of innovative apps. Our mission is straightforward yet powerful: to empower our partners with solutions that streamline their operations, foster customer trust, and drive sustainable growth. We’re not just about technology—we’re about making eCommerce smarter, simpler, and more impactful, delivering solutions that inspire confidence and create real results.</div><div>With fresh investment and rapid growth, this is the perfect time to join our journey. When you become part of&nbsp;<a rel=\"noopener noreferrer\" class=\"postings-link\" href=\"http://clearer.io/\">Clearer.io</a>, you step into a role where your work truly matters. Here, you’ll have the opportunity to own your projects, drive outcomes, and make an impact within a supportive, diverse team of professionals dedicated to customer success. We value clarity, results, and a customer-centric approach that keeps us focused on delivering real value to our partners every step of the way.</div><div>If you’re ready to cut through the clutter and focus on what really matters in a dynamic eCommerce landscape,&nbsp;<a rel=\"noopener noreferrer\" class=\"postings-link\" href=\"http://clearer.io/\">Clearer.io</a>&nbsp;is the place to grow, lead, and shape the future of online retail. Join us, and be part of a team that’s committed to making eCommerce clearer, more efficient, and more rewarding for everyone.</div><div><br></div><div><b>Your Impact:</b></div><div><a rel=\"noopener noreferrer\" class=\"postings-link\" href=\"http://clearer.io/\">Clearer.io</a>&nbsp;is looking for an exceptional Director of Engineering to lead and inspire our Vietnam Engineering teams, serving as the senior leader in the country and a key bridge across our global organization. In this leadership role, you’ll shape the future of our product development efforts, driving innovation on both current and upcoming products. You’ll lead a high-performing, fully remote team of engineering leaders and individual contributors, leveraging your expertise in building cutting-edge SaaS solutions on AWS. With a focus on agile development, you'll foster a culture of continuous improvement while overcoming cross-departmental challenges and ensuring alignment with our strategic goals. If you're a visionary leader with a passion for SaaS, a deep understanding of global team dynamics, and the ability to guide teams toward success in a remote-first environment, we want to hear from you!</div><div><b>Take the Clearer route to smart career growth.</b>&nbsp;At&nbsp;<a href=\"http://clearer.io/\" class=\"postings-link\" target=\"_blank\" rel=\"noopener noreferrer\">Clearer.io</a>, we’re reimagining eCommerce by enhancing search, discovery, and customer engagement through a standout suite of innovative apps. Our mission is straightforward yet powerful: to empower our partners with solutions that streamline their operations, foster customer trust, and drive sustainable growth. We’re not just about technology—we’re about making eCommerce smarter, simpler, and more impactful, delivering solutions that inspire confidence and create real results.</div><div>With fresh investment and rapid growth, this is the perfect time to join our journey. When you become part of&nbsp;<a href=\"http://clearer.io/\" class=\"postings-link\" target=\"_blank\" rel=\"noopener noreferrer\">Clearer.io</a>, you step into a role where your work truly matters. Here, you’ll have the opportunity to own your projects, drive outcomes, and make an impact within a supportive, diverse team of professionals dedicated to customer success. We value clarity, results, and a customer-centric approach that keeps us focused on delivering real value to our partners every step of the way.</div><div>If you’re ready to cut through the clutter and focus on what really matters in a dynamic eCommerce landscape,&nbsp;<a href=\"http://clearer.io/\" class=\"postings-link\" target=\"_blank\" rel=\"noopener noreferrer\">Clearer.io</a>&nbsp;is the place to grow, lead, and shape the future of online retail. Join us, and be part of a team that’s committed to making eCommerce clearer, more efficient, and more rewarding for everyone.</div><div><br></div><div><b>Your Impact:</b></div><div><a href=\"http://clearer.io/\" class=\"postings-link\" target=\"_blank\" rel=\"noopener noreferrer\">Clearer.io</a>&nbsp;is looking for an exceptional Director of Engineering to lead and inspire our Vietnam Engineering teams, serving as the senior leader in the country and a key bridge across our global organization. In this leadership role, you’ll shape the future of our product development efforts, driving innovation on both current and upcoming products. You’ll lead a high-performing, fully remote team of engineering leaders and individual contributors, leveraging your expertise in building cutting-edge SaaS solutions on AWS. With a focus on agile development, you'll foster a culture of continuous improvement while overcoming cross-departmental challenges and ensuring alignment with our strategic goals. If you're a visionary leader with a passion for SaaS, a deep understanding of global team dynamics, and the ability to guide teams toward success in a remote-first environment, we want to hear from you!</div><h3>What you’ll do:</h3><li>Lead a team of engineering leaders and individual contributors, organizing resources against product areas and providing direction and performance management.</li><li>Provide technical direction to the teams, including the identification and application of modern technologies and design patterns with an emphasis on scalability, data and AI.</li><li>Apply agile development practices, collaborating closely with Product Management, QA, and DevOps to rapidly deliver high value features.</li><li>Partner with Customer Support and Success to understand customer concerns and guide the teams to continuously improve.</li><li>Lead the effort in sizing large feature development as part of the quarterly planning process (and in some cases, potential future efforts that need to be evaluated).</li><li>Measure team and individual KPIs, including lead time to introduce new functionality, deployment frequency, mean time to restore service, and defect rate; identify and address impediments and gaps affecting these KPIs.</li><li>Participate in establishing coding and test standards applied by the team.</li><li>Provide input on team hiring needs, driving the selection process and onboarding for new hires.</li><li>Address and resolve escalated production issues in a timely manner, conducting post mortems and root cause analysis and implementing mitigation strategies based on what was learned.</li><li>Work with other team leads/managers to establish and apply software development technology and process standards.</li><div><br></div><div><b>Requirements:</b></div><li>A Bachelor’s degree in Computer Science, Engineering, or equivalent; or equivalent experience with 10+ years of experience in software development, including at least 5 years in a leadership role with direct and indirect reports.</li><li>High level experience in AI/ML fundamentals and up-to-date knowledge of AI/ML technologies and their trends, including various libraries and tools.</li><li>In-depth knowledge of software development methodologies, tools, and technologies and a strong understanding of various programming languages, frameworks and databases.</li><li>Strong experience and knowledge in SaaS, including product management, integration, and industry trends.</li><li>Proven experience in managing complex software projects, including budgeting, resource allocation, and timeline management.</li><li>Excellent communication skills, both verbal and written in English and Vietnamese—able to convey complex technical ideas clearly to diverse audiences across global and local teams.</li><li>Strong leadership and team-building abilities, with the capacity to motivate and guide a diverse group of engineers.</li><li>Ability to analyze complex technical challenges and make sound decisions under pressure.</li><li>Ability to align technical strategies with the overall business goals and objectives of the organization.</li><li>Willingness and ability to adapt to changing technologies, methodologies, and industry trends.</li><li>Familiarity with the specific industry or domain in which the organization operates can be a plus.</li><li>Experience in managing remote teams with global presence&nbsp;Experience in the eCommerce industry is preferred.</li><div><br></div><div><b>Site Leader Responsibilities:</b></div><li>Cross-Departmental Collaboration: Foster a collaborative work environment and partner closely with functional leaders globally to support team collaboration. Proactively identify and escalate cross-departmental issues that may impact the site and product’s overall performance.&nbsp;</li><li>Cultural Adaptation &amp; Alignment: Adapt and integrate global corporate culture with local practices, ensuring a cohesive work environment, fostering a culture of respect, inclusion, and mutual understanding across diverse teams.</li><li>Build and Foster Team Culture: Cultivate a positive and inclusive work environment, aligning with Clearer’s values and fostering a strong team culture within the Vietnam team.</li><li>Cross-functional Collaboration: Act as a liaison between the Vietnam team and global counterparts to ensure alignment on goals, processes, and projects. Help facilitate clear communication and collaboration across departments when needed.</li><li>Mentorship and Leadership Development: Provide coaching, mentorship, and support to team members, fostering their professional growth and preparing them for leadership opportunities.</li><li>Employee Engagement and Retention: Lead initiatives to boost employee engagement and satisfaction within the Vietnam team, including organizing local events and recognition programs.</li><li>Community and Brand Representation: Represent Clearer in the local tech community, participating in networking events, conferences, and partnerships to strengthen the company’s local brand presence.</li><li>Innovation &amp; Change Management: Serve as regional lead for change management initiatives to drive innovation, adaptability, and continuous improvement.&nbsp;</li><li>Technology &amp; Digitalization: Lead efforts in technology integration and digital transformation to enhance operational efficiency and competitiveness.&nbsp;</li><li>Legal Representative Responsibility: Work closely with HR, Finance, and our legal team to ensure full compliance with local laws and regulations, including business registrations, contracts, and other legal matters related to operations within Vietnam. Act as the point of contact for any legal matters requiring attention from local authorities, ensuring that the company adheres to all applicable laws.</li><li>Travel Requirements: Be prepared to travel within Vietnam and internationally as required (US, UK, Australia).</li><div><br></div><div><b>Qualities:&nbsp;</b></div><div>What other characteristics do we look for? Leadership for sure. But what does that mean? Well, some of the attributes we appreciate include:</div><li>Strong Communicator&nbsp;- You explain highly technical concepts to engineers and non-engineers, on your team and across other teams and functions.</li><li>Pragmatic and Organized&nbsp;- You apply resources and organize work to optimally deliver value to the business. You make informed “do it now” vs. “do it later” decisions.</li><li>Thoughtful Urgency&nbsp;- You seek out and eliminate impediments to team throughput while maintaining a sustainable cadence.</li><li>Technical Expertise&nbsp;- You leverage deep technical experience and knowledge to make decisions and provide direction.</li><li>Quality Minded&nbsp;- You feel responsible for the quality of the product your team produces and put in place appropriate development and test practices to manage risk.</li><li>Mentor and Coach&nbsp;- You invest in the development of your team members, providing them feedback and guidance to help them achieve their professional goals while meeting the needs of the business.</li><div><br></div><div><b>Why Choose Clearer?</b></div><li>Customers at the heart:&nbsp;We make our customers the stars of our show and help them thrive.&nbsp;When they grow, so do we. We obsess over their needs so we can dream big on their behalf.</li><li>Purposeful progress:&nbsp;We harness our ingenuity to keep leveling up and growing stronger.&nbsp;We take initiative, think boldly, and don’t settle for the status quo. Every risk teaches us something new.</li><li>Endless innovation:&nbsp;We take action, refine our work, and drive meaningful growth for each other and our customers.&nbsp;Humble in our pursuit, we continuously seek to improve. We ask ‘How can we help?’ striving always to make a meaningful.</li><li>Always open:&nbsp;With transparency we simplify the complex, collaborate globally and empower everyone.&nbsp;We believe openness in our communication—with customers, partners, and team members—is essential for building strong relationships.</li><div><br></div><div><b>Clear Benefits:</b></div><li><b>&nbsp;</b>100% Remote Culture: Work from anywhere that brings you happiness.</li><li>Performance-based Year-End Bonus: Recognizing and rewarding your individual contributions.</li><li>Wellness Allowance: Support for classes promoting physical and mental health.</li><li>Time Off: 20 days/year, in addition to Vietnam holidays.</li><li>MacBook Provided.</li><li>Collaborative Events: Offline meet-ups, monthly gatherings, year-end party, and company trips.</li><li>Continuous Learning: Technical and general workshops, online resources.</li><li>Health and Wellness Benefits: Generali Health Care, annual check-up.</li><li>International Exposure: Enhance expertise and English communication skills.</li><div><br></div><li>Location: Ho Chi Minh City, Vietnam</li><li>Reports to: CTO</li>","tags":"[\"finance\",\"management\",\"engineering\",\"legal\",\"database\",\"aws\"]","pubDate":"2025-02-14T07:39:59.503Z","link":"https://jobs.lever.co/Clearer/8d813821-d0c2-4cec-8b09-95a5c68d118f","slug":"director-of-engineering-vietnam-clearer-8998"},{"id":5167351730,"title":"AI Engineer","company":"BioRender","image":"https://avatars.githubusercontent.com/u/46490948?s=200&v=4","description":"<p style=\"min-height:1.5em\">At BioRender, we don’t settle for average, and neither should you. We’re building tools that transform how scientists communicate complex ideas, and we need someone who’s ready to turn ambitious ideas into lovable and usable products.</p><p style=\"min-height:1.5em\">This role is for someone who thrives on solving hard problems, learning fast, and creating solutions that others said couldn’t be done. If you’re ready to prove you’ve got what it takes to take on this challenge, we want to hear from you.</p><p style=\"min-height:1.5em\"></p><p style=\"min-height:1.5em\"><strong>What you'll be doing :</strong></p><p style=\"min-height:1.5em\">We need an ambitious builder that gets stuff shipped. Here’s how you’ll show us what you’re made of:</p><ul style=\"min-height:1.5em\"><li><p style=\"min-height:1.5em\"><u>Invent the Future</u>: Leverage ML/AI to tackle real-world problems in scientific visualization, data analysis, or image processing.</p></li><li><p style=\"min-height:1.5em\"><u>Think Beyond the Obvious</u>: Dive deep into challenges, explore unconventional solutions, and deliver results that exceed expectations.</p></li><li><p style=\"min-height:1.5em\"><u>Collaborate with the Best</u>: Work alongside world-class engineers and domain experts who will push you to grow every day.</p></li><li><p style=\"min-height:1.5em\"><u>Own Your Work:</u> Take full end-to-end ownership of customer problems—from data gathering to production solutions</p></li><li><p style=\"min-height:1.5em\"><u>Stay Ahead of the Curve</u>: Keep up with cutting-edge research in AI and find ways to apply it in ways no one else has thought of yet.</p></li></ul><p style=\"min-height:1.5em\"><strong>Our ideal fit brings:</strong></p><p style=\"min-height:1.5em\">Here’s what we expect from someone extraordinary:</p><ul style=\"min-height:1.5em\"><li><p style=\"min-height:1.5em\"><u>Technical Chops</u>: You’ve got a solid foundation in machine learning concepts (e.g., neural networks, supervised/unsupervised learning) and proficiency in Python and building fullstack products that leverage them. You’ve worked with TensorFlow, PyTorch and single page apps on top of cloud platforms like AWS/GCP.</p></li><li><p style=\"min-height:1.5em\"><u>A Portfolio That Speaks for Itself</u>: Show us what you’ve built—whether it’s a GitHub repo, Kaggle competition results, or a personal project that pushed your limits.</p></li><li><p style=\"min-height:1.5em\"><u>Curiosity Meets Grit</u>: You don’t just solve problems—you obsess over them until they’re cracked wide open. You learn fast, adapt faster, and never back down from a challenge.</p></li><li><p style=\"min-height:1.5em\"><u>A Builder’s Mentality</u>: You don’t wait for someone else to tell you what to do—you take the initiative and figure it out yourself.</p></li><li><p style=\"min-height:1.5em\"><u>Team Player with an Edge</u>: You collaborate well but aren’t afraid to challenge ideas (including your own) to get to the best solution.</p></li></ul><p style=\"min-height:1.5em\"></p><p style=\"min-height:1.5em\"><strong>Why This Role is Different</strong></p><p style=\"min-height:1.5em\">You’ll be given real responsibility from day one because we trust you to rise to the occasion. If that excites you more than it intimidates you—this is where you belong.</p><p style=\"min-height:1.5em\"></p><p style=\"min-height:1.5em\"><strong>Why join us?</strong></p><p style=\"min-height:1.5em\">At BioRender, we offer more than just a job:</p><ul style=\"min-height:1.5em\"><li><p style=\"min-height:1.5em\"><u>A Mission That Matters</u>: Your work will directly impact the scientific community</p></li><li><p style=\"min-height:1.5em\"><u>Growth Without Limits</u>: Learn from senior engineers and take on challenges that accelerate your career faster than anywhere else.</p></li><li><p style=\"min-height:1.5em\"><u>A Culture of Excellence</u>: Join a team that sets high standards—and helps each other meet them every day.</p></li><li><p style=\"min-height:1.5em\"><u>Flexibility Without Compromise</u>: We’re remote-first but deeply connected as a team through collaboration and shared purpose.</p></li></ul><p style=\"min-height:1.5em\"></p><p style=\"min-height:1.5em\"><strong>Apply Now</strong></p><p style=\"min-height:1.5em\">Show us your best work and what makes you amazing:</p><ol style=\"min-height:1.5em\"><li><p style=\"min-height:1.5em\">Submit your resume</p></li><li><p style=\"min-height:1.5em\">Share links to projects or code that demonstrate your skills (GitHub repos are gold)</p></li><li><p style=\"min-height:1.5em\">Tell us why you’re excited about this role—and why we should be excited about <em>you</em></p></li></ol><p style=\"min-height:1.5em\">This is your chance to work on some impactful problems. Are you ready?</p><p style=\"min-height:1.5em\"></p><p style=\"min-height:1.5em\">BioRender is an Equal Opportunity Employer. We celebrate diversity and are committed to creating an inclusive environment for all employees. All qualified applicants will receive consideration for employment without regard to race, color, religion, sex, sexual orientation, gender identity, national origin, disability, or veteran status.</p>","tags":"[\"aws\"]","pubDate":"2025-02-13T23:50:06.830Z","link":"https://jobs.ashbyhq.com/biorender/b92aa20e-de40-4c9d-b8da-ec69eb6a8f01","slug":"ai-engineer-biorender-8207"},{"id":3638211151,"title":"Community Virtual Assistant","company":"Winona","image":"https://yt3.googleusercontent.com/k45HnnNMWgPv-xF3D-u2ThxmesDOeU0p02rNJpbRWLes2Z18WpkLgXEE7XuBLkkzN_38AFnp3A=s160-c-k-c0x00ffffff-no-rj","description":"<p style=\"min-height:1.5em\"><strong>About Winona:</strong></p><p style=\"min-height:1.5em\"><a target=\"_blank\" rel=\"noopener noreferrer nofollow\" href=\"https://bywinona.com\">Winona</a> is one of the leading telemedicine companies providing HRT for women in menopause. We’ve built all of our technology in house including an EHR, patient care admin system, patient portal, website, marketing technology etc. Winona has two compounding pharmacies and a team of in house physicians providing world-class care via a fully vertically integrated business model.</p><p style=\"min-height:1.5em\"></p><p style=\"min-height:1.5em\"><strong>About the role:</strong></p><p style=\"min-height:1.5em\">Winona is seeking a passionate and organized full-time, remote <strong>Community Virtual Assistant</strong> to play a key role in managing and growing our online community. This role is crucial for fostering a positive and supportive environment for women, driving engagement, and ensuring a thriving community presence. The ideal candidate is a highly motivated self-starter with excellent communication skills, a genuine desire to connect with and serve our community, and experience in community moderation and customer service.</p><p style=\"min-height:1.5em\"></p><p style=\"min-height:1.5em\"><strong>Seniority Level:</strong> Junior-Mid level</p><p style=\"min-height:1.5em\"></p><p style=\"min-height:1.5em\"><strong>Responsibilities:</strong></p><p style=\"min-height:1.5em\">Community Management:</p><ul style=\"min-height:1.5em\"><li><p style=\"min-height:1.5em\">Actively participate in community discussions, fostering a welcoming and inclusive environment.</p></li><li><p style=\"min-height:1.5em\">Respond to questions and engage with community members, providing support and building relationships.</p></li><li><p style=\"min-height:1.5em\">Organize and facilitate community events and activities to encourage interaction and connection.</p></li><li><p style=\"min-height:1.5em\">Keep a pulse on the community's sentiment and identify areas for improvement.</p></li></ul><p style=\"min-height:1.5em\">Moderation:</p><ul style=\"min-height:1.5em\"><li><p style=\"min-height:1.5em\">Oversee community interactions and ensure compliance with community guidelines.</p></li><li><p style=\"min-height:1.5em\">Address any inappropriate behavior or conflicts in a calm and professional manner.</p></li><li><p style=\"min-height:1.5em\">Proactively identify and address potential conflicts or issues within the community.</p></li></ul><p style=\"min-height:1.5em\">Customer Support:</p><ul style=\"min-height:1.5em\"><li><p style=\"min-height:1.5em\">Monitor and respond to customer inquiries in a timely and professional manner.</p></li><li><p style=\"min-height:1.5em\">Provide assistance and support to community members, addressing their concerns and needs.</p></li></ul><p style=\"min-height:1.5em\">Community Presence &amp; Growth:</p><ul style=\"min-height:1.5em\"><li><p style=\"min-height:1.5em\">Contribute to strategies for increasing community engagement and attracting new members.</p></li><li><p style=\"min-height:1.5em\">Identify opportunities to highlight community successes and member contributions.</p></li><li><p style=\"min-height:1.5em\">Maintain a consistent and positive brand voice within the community.</p></li></ul><p style=\"min-height:1.5em\">Data &amp; Reporting:</p><ul style=\"min-height:1.5em\"><li><p style=\"min-height:1.5em\">Gather data and prepare reports to track community engagement and performance insights.</p></li><li><p style=\"min-height:1.5em\">Analyze data to identify trends and opportunities for improving community engagement.</p></li></ul><p style=\"min-height:1.5em\"></p><p style=\"min-height:1.5em\"><strong>Requirements</strong>:</p><ul style=\"min-height:1.5em\"><li><p style=\"min-height:1.5em\">Strong communication skills, both written and verbal.</p></li><li><p style=\"min-height:1.5em\">Experience in community management, customer service, or a related field.</p></li><li><p style=\"min-height:1.5em\">Ability to work independently and manage multiple tasks simultaneously.</p></li><li><p style=\"min-height:1.5em\">Proficiency with community management tools and platforms.</p></li><li><p style=\"min-height:1.5em\">A passion for building and nurturing online communities.</p></li><li><p style=\"min-height:1.5em\">Knowledge of industry trends and best practices in community management.</p></li><li><p style=\"min-height:1.5em\">A computer with a reliable internet connection.</p></li><li><p style=\"min-height:1.5em\">Experience with <a target=\"_blank\" rel=\"noopener noreferrer nofollow\" href=\"http://Circle.so\">Circle.so</a> is considered an advantage.</p></li></ul><p style=\"min-height:1.5em\"></p><p style=\"min-height:1.5em\"><strong>What’s in it for you?</strong></p><p style=\"min-height:1.5em\">As a full-time member of our team, you’ll enjoy:</p><ul style=\"min-height:1.5em\"><li><p style=\"min-height:1.5em\">Flexible hours, work wherever you choose</p></li><li><p style=\"min-height:1.5em\">Unlimited PTO</p></li><li><p style=\"min-height:1.5em\">Non-working holidays per country of residence</p></li><li><p style=\"min-height:1.5em\">Pro-rated 13th-month bonus in select regions</p></li><li><p style=\"min-height:1.5em\">Referral bonuses</p></li><li><p style=\"min-height:1.5em\">Financial support for online courses</p></li><li><p style=\"min-height:1.5em\">Fun and casual work environment</p></li><li><p style=\"min-height:1.5em\">Employee engagement activities and virtual gatherings</p></li><li><p style=\"min-height:1.5em\">We are a diverse, global team! 🌍</p></li></ul>","tags":"[\"management\"]","pubDate":"2025-02-13T20:08:41.155Z","link":"https://jobs.ashbyhq.com/winona/e3ac1684-6f1f-4410-abf1-d4ab11b9f7e9","slug":"community-virtual-assistant-winona-8401"},{"id":2374578309,"title":"Senior Growth Manager","company":"Didask","image":"https://avatars.githubusercontent.com/u/14350668?s=200&v=4","description":"<p style=\"min-height:1.5em\"><em>🇫🇷 La langue de travail à Didask est l'anglais et sa maîtrise est requise pour nous rejoindre. Néanmoins, nous publions l'intégralité de nos offres d'emploi en français et en anglais. Vous pouvez retrouver toutes nos offres d'emploi sur </em><a target=\"_blank\" rel=\"noopener noreferrer nofollow\" href=\"https://jobs.ashbyhq.com/didask\"><em>cette page</em></a><em>, ainsi que plus d'informations sur Didask, notre culture et nos avantages.</em></p><p style=\"min-height:1.5em\"></p><p style=\"min-height:1.5em\"><em>🇬🇧🇺🇸 While English is our working language at Didask and proficiency is required to join us, we publish all our job openings in both English and French. You can find all our positions on </em><a target=\"_blank\" rel=\"noopener noreferrer nofollow\" href=\"https://jobs.ashbyhq.com/didask\"><em>this page</em></a><em>, along with more information about Didask, our culture and benefits.</em></p><h1><strong>Missions</strong></h1><p style=\"min-height:1.5em\">Rattaché⸱e à la direction Marketing, votre mission sera d’accompagner l’équipe marketing et le funnel d’acquisition afin <strong>d’optimiser la conversion à chaque étape et générer des opportunités de business pour les sales</strong>. </p><p style=\"min-height:1.5em\">Pour cela, vous utiliserez la data pour identifier <strong>leviers et</strong> <strong>freins à la conversion</strong> sur <strong>l’ensemble du funnel d’acquisition</strong> (canaux d’acquisition, landing pages, site web, nurturing, follow-up leads, marketing automation…). </p><p style=\"min-height:1.5em\">Vous interviendrez <strong>en sprints</strong>, sur des problématiques précises, avec une approche <strong>data-first et ROIste</strong>.</p><p style=\"min-height:1.5em\">Ce poste requiert un fort degré d’autonomie, de responsabilité et d’être à la fois <strong>stratège analytique (business/ drive) et “doer” (mise en oeuvre).</strong></p><p style=\"min-height:1.5em\"></p><h1><strong>Vos principales responsabilités seront :<br /></strong></h1><h2><strong>Explorer et analyser la data</strong></h2><ul style=\"min-height:1.5em\"><li><p style=\"min-height:1.5em\">Auditer la <strong>performance des canaux d’acquisition</strong>, identifier les opportunités et prioriser les actions.</p></li><li><p style=\"min-height:1.5em\">Mettre en place et optimiser les <strong>dashboards de suivi</strong> (trafic, conversion, engagement, savoir faire requêtes SQL…).</p></li><li><p style=\"min-height:1.5em\">Creuser la data pour <strong>identifier les goulots d’étranglement</strong> et optimiser la conversion.</p></li></ul><h2><strong>Optimiser chaque étape du funnel</strong></h2><p style=\"min-height:1.5em\"><strong>Type de projets :</strong></p><ul style=\"min-height:1.5em\"><li><p style=\"min-height:1.5em\"><strong>Améliorer l’authority score</strong> du site web et booster notre SEO via des optimisations techniques et de contenu.</p></li><li><p style=\"min-height:1.5em\">Définir un <strong>process scalable</strong> pour fluidifier la création de <strong>backlinks</strong> avec partenaires et clients.</p></li><li><p style=\"min-height:1.5em\"><strong>Nettoyer &amp; segmenter la base marketing</strong>, pour un nurturing et un scoring plus précis.</p></li><li><p style=\"min-height:1.5em\">Optimiser les <strong>campagnes d’acquisition &amp; de nurturing</strong> (emailing, ads, automation…) pour maximiser la génération de leads qualifiés.</p></li><li><p style=\"min-height:1.5em\">Optimiser les LP pour la conversion.</p></li><li><p style=\"min-height:1.5em\"><strong>Augmenter le volume d’inscrits aux webinaires</strong> et optimiser les taux de participation et conversion.</p></li><li><p style=\"min-height:1.5em\">Vision intégrale du funnel avec un gros focus sur l’acquisition jusque dans le suivi des leads auprès des BDR.</p></li></ul><h2><strong>Expérimenter &amp; scaler les bonnes pratiques</strong></h2><ul style=\"min-height:1.5em\"><li><p style=\"min-height:1.5em\">Mettre en place un <strong>process de test &amp; learn</strong>, avec des sprints d’optimisation sur des KPIs clés.</p></li><li><p style=\"min-height:1.5em\">A/B tester en continu les <strong>landing pages, contenus, séquences de nurturing et call-to-actions</strong>.</p></li><li><p style=\"min-height:1.5em\">Collaborer avec l’équipe marketing &amp; sales pour aligner les actions growth avec les objectifs business.</p></li></ul><h1></h1><h1><strong>Profil recherché</strong></h1><p style=\"min-height:1.5em\">Nous recherchons un·e candidat·e très autonome, à la fois stratège et “doer”, orienté·e business et data-driven, avec une forte expertise en payant.</p><ul style=\"min-height:1.5em\"><li><p style=\"min-height:1.5em\"><strong>Profil :</strong></p><ul style=\"min-height:1.5em\"><li><p style=\"min-height:1.5em\"><strong>Motivé·e : nous recherchons avant tout un·e candidat·e passionné·e par notre mission, par l’IA, l’ed tech, et qui est stimulé·e par l’ambiance start up.</strong></p></li><li><p style=\"min-height:1.5em\"><strong>Expérience</strong> : Au moins 5 ans d’expérience en growth marketing, demand generation ou performance marketing dans le domaine BtoB ou dans une startup en croissance</p></li><li><p style=\"min-height:1.5em\">Une expérience pour augmenter<strong> l’authority score d’un site</strong> (politique et mise en oeuvre backlinks, sujets techniques du site internet etc.) serait apprécié</p></li><li><p style=\"min-height:1.5em\"><strong>Ultra data-driven</strong> <strong>et</strong> <strong>esprit analytique</strong> : capacité à analyser les données, ajuster les stratégies en conséquence, et démontrer un impact. Vous partez toujours de la data pour prioriser vos actions et optimiser la performance.</p></li><li><p style=\"min-height:1.5em\"><strong>Esprit hacker &amp; mindset entrepreneurial</strong>, avec un focus sur l’impact vous lancez des projets ambitieux. Toujours à la recherche de nouvelles idées pour accélérer la croissance, hyper doer et problem solver. <strong>Capacité à tester rapidement et scaler ce qui fonctionne</strong>, avec une approche agile et ROIste.</p></li><li><p style=\"min-height:1.5em\"><strong>Excellente maîtrise des outils</strong> :  Vous avez un profil technique et une appétence forte pour les nouveaux outils :</p><ul style=\"min-height:1.5em\"><li><p style=\"min-height:1.5em\">Acquisition : vous avez de solides connaissances dans les outils et leviers digitaux (SEA, social ads, Linkedin, webflow); <strong> </strong></p></li><li><p style=\"min-height:1.5em\">SQL et data : vous êtes capable de réaliser des requêtes SQL et de sortir, analyser et utiliser la data de nos outils (GA4, metabase) manière autonome.</p></li><li><p style=\"min-height:1.5em\">Expertise marketing automation et CRM : vous êtes expert·e et autonome sur l’utilisation d’outil de marketing automation (n8n, Make, Zapier) et avez une compréhension approfondie des logiques CRM (object-base, structure, workflows, segmentation)</p></li></ul></li><li><p style=\"min-height:1.5em\"><strong>Organisation et gestion de projet</strong> : capacité à gérer plusieurs campagnes simultanément, à coordonner différents experts internes et externes, et à travailler dans un environnement rapide et dynamique.</p></li><li><p style=\"min-height:1.5em\"><strong>Autonomie et leadership</strong>, capable de piloter des sprints growth et d’aligner les parties prenantes.</p></li></ul></li></ul><p style=\"min-height:1.5em\"></p><ul style=\"min-height:1.5em\"><li><p style=\"min-height:1.5em\"><strong>Nos outils de travail :</strong></p><ul style=\"min-height:1.5em\"><li><p style=\"min-height:1.5em\">Slack, Notion (outils de communication entreprise)</p></li><li><p style=\"min-height:1.5em\">Webflow, hubspot, meta (analytics), semrush, GA4, hotjar</p></li></ul></li></ul><h1><br /></h1><h1><strong>Pourquoi nous rejoindre ?</strong></h1><p style=\"min-height:1.5em\"></p><p style=\"min-height:1.5em\">Si vous souhaitez évoluer dans un environnement stimulant, en très forte croissance, et contribuer à la structuration et au développement de l’activité </p><ul style=\"min-height:1.5em\"><li><p style=\"min-height:1.5em\">L’opportunité de jouer un rôle clé au sein d’une start-up de taille humaine de 60 personnes, en croissance rapide, et d’y prendre des responsabilités importantes.</p></li><li><p style=\"min-height:1.5em\">Évoluer au sein d’une équipe de passionné·e·s, soudée et bienveillante.</p></li><li><p style=\"min-height:1.5em\">Une organisation horizontale basée sur la confiance, la transparence et la responsabilisation, avec un véritable <em>ownership</em> distribué entre tous les collaborateurs.</p></li><li><p style=\"min-height:1.5em\">Un mode de fonctionnement où les réunions sont réduites au maximum, les échanges et décisions étant réalisés par écrit de manière transparente.</p></li><li><p style=\"min-height:1.5em\">Une flexibilité totale en télétravail et/ou un cadre de travail magnifique entre une maison avec jardin en proche banlieue parisienne.</p></li><li><p style=\"min-height:1.5em\">Œuvrer pour un projet d’utilité sociale forte : permettre à tout le monde de bien transmettre et bien apprendre.</p></li><li><p style=\"min-height:1.5em\">Rejoindre une entreprise de la Tech avec une solution hyper innovante qui a un temps d’avance sur son marché </p></li></ul><h1><strong>Déroulé</strong></h1><ul style=\"min-height:1.5em\"><li><p style=\"min-height:1.5em\">Une visio pour se rencontrer (1h)</p></li><li><p style=\"min-height:1.5em\">Un business case </p></li><li><p style=\"min-height:1.5em\">Une seconde visio pour échanger sur votre business case (1h30)</p></li></ul><p style=\"min-height:1.5em\"></p><h1><strong>Informations complémentaires</strong></h1><ul style=\"min-height:1.5em\"><li><p style=\"min-height:1.5em\">Type de contrat : CDI</p></li><li><p style=\"min-height:1.5em\">Rémunération indicative : 60-85 k€ composé de 80% de fixe + 20% variable </p></li><li><p style=\"min-height:1.5em\">Bureau : Paris / Bagnolet, à 8 minutes à pieds de la station Gallieni (Metro ligne 3)</p></li><li><p style=\"min-height:1.5em\">Télétravail autorisé à 100%</p></li><li><p style=\"min-height:1.5em\">Mutuelle Sidecare prise en charge à 100% (employé·e &amp; enfants)</p></li><li><p style=\"min-height:1.5em\">Carte de transport prise en charge 50%</p></li><li><p style=\"min-height:1.5em\">Carte Restaurant Swile - 9,25€ par jour dont 5,55€ pris en charge par l’employeur</p></li><li><p style=\"min-height:1.5em\">Budget matériel télétravail </p></li><li><p style=\"min-height:1.5em\">Disponibilité : Dès que possible</p></li></ul><p style=\"min-height:1.5em\"><em>🇫🇷 Sauf mention contraire, toutes nos offres sont accessibles en télétravail complet à condition de travailler dans un fuseau horaire proche de celui de Paris et de disposer des bonnes conditions de travail (notamment connexion Internet). Attention, nous ne pouvons à l'heure actuelle embaucher que des résidents fiscaux français.</em></p><p style=\"min-height:1.5em\"><em>🇬🇧🇺🇸 Unless specified otherwise, all positions are fully remote, provided you work in a timezone close to Paris and have suitable working conditions (including Internet connection). Please note that we can currently only hire French tax residents.</em></p>","tags":"[]","pubDate":"2025-02-13T12:29:17.188Z","link":"https://jobs.ashbyhq.com/didask/5431478d-7fbc-41b2-ae65-89be322f3c6f","slug":"senior-growth-manager-didask-5629"},{"id":8833176060,"title":"Chief Revenue Officer","company":"Float","image":"https://avatars.githubusercontent.com/u/5396037?s=200&v=4","description":"<h3><strong>Who We Are</strong></h3><p>Float is the world’s leading software for teams to plan their time. Launched in 2012, we’ve grown every year since, and remain proudly independent, self-funded and profitable. As a certified B Corporation, we’re committed to making a positive contribution to our team, customers, the environment, and the remote community. We’re a team of 56 working 100% remotely. You’ll partner with team members globally, including Australia, Mexico, Italy, Nigeria, Canada, and the USA. Review our data security guidelines about our employment or service contracts <a href=\"https://www.notion.so/Data-security-and-protection-guidelines-5a44ff7c04bb4a55a05873f6d5d7743b?pvs=21\" rel=\"nofollow noreferrer noopener\" class=\"external\">here</a>. Hear what our team has to say by browsing <a href=\"https://www.float.com/blog/\" rel=\"nofollow noreferrer noopener\" class=\"external\">our blog</a>, or reading our <a href=\"https://www.glassdoor.com/Overview/Working-at-Float-EI_IE2055330.11,16.htm\" rel=\"nofollow noreferrer noopener\" class=\"external\">Glassdoor reviews</a>. Check out what our customers think of Float <a href=\"https://www.g2.com/products/float-float/reviews\" rel=\"nofollow noreferrer noopener\" class=\"external\">from our G2 reviews</a>.</p><p>We’re on a scale up journey, and we’re seeking people who thrive in this stage. We want Float to be the place where you have the autonomy and the opportunity to do the best work of your career. Demand for <a href=\"https://trends.google.com/trends/explore?date=2010-01-01%202024-05-31&amp;q=%2Fm%2F02jv7&amp;hl=en\" rel=\"nofollow noreferrer noopener\" class=\"external\">resource planning</a> is growing as organizations seek greater efficiencies from their global and more decentralized networks. Our goal is to build a $100M+ ARR business and be the central hub for how global Professional Services organizations match people to client work profitably. </p><p></p><h3><strong>Why We’re Hiring For This Role</strong></h3><p>We started out supporting a predominantly SMB audience who used Float as a 30-day free trial that was self-serve and purchased via credit card. Word-of-mouth and high-intent Google searches remain our strongest lead sources. As our product has matured to support scaling, global organizations, our fastest-growing segment is our Mid-Market ICP. This segment typically requires longer buying cycles, more complicated stakeholder management, and greater compliance and security needs, benefitting from a Sales-assisted buying journey. We’ve also grown our Customer Success teams to set these larger organizations up for successful onboarding and rollout. This last year, we’ve been moving to orientate our revenue organization, marketing channel mix, and plans &amp; packaging around our growth momentum.</p><p>To this point, we’ve been <strong>entirely self-funded</strong> and <strong>profitable every quarter</strong>. We have no board or external advisors.</p><p>For this next stage in our journey, we’re seeking to move faster to meet our goal, prioritizing revenue growth and retention. That’s where you come in.</p><p>Today, Glenn manages our Product, Revenue, People, and Operations departments. Since 2011, co-founders Glenn (CEO) and Lars (CTO) have led the business as the sole executives. We’re domiciled in the US, but our team of 56 works fully remote across 20 countries, predominately in EMEA, the UK, Canada, Australia, and New Zealand. Glenn is based in Melbourne, Australia, and Lars in Seattle, USA.</p><p>We’re seeking a Chief Revenue Officer to partner with Glenn. You’ll be a thought partner, help define our strategic bets, scale our organization, and most importantly, you will lead and manage revenue. Today, that consists of 4 leaders and 15 contributors across Marketing, Sales, Success, and Support.</p><p>You’ll be working asynchronously with a bright, dedicated team from across the globe, with a strong focus on taking complex problems and creating solutions that feel simple and intuitive for our customers.</p><p></p><h3><strong>What You’ll Be Responsible For</strong></h3><p>Once established in your role, you’ll partner with Glenn on our growth strategy, and lead an action plan for how we can achieve our annual revenue goals. You’ll explore accelerating momentum in areas including:</p><ul> <li> <strong>Logo expansion:</strong> Our Sales team currently focuses entirely on servicing inbound leads. You’ll explore how we expand these logos, and reach similar organizations via outbound.</li> <li> <strong>Partnerships</strong>: Identifying new opportunities to drive scale via partnerships, building on current momentum with integration referrals and resellers.</li> <li> <strong>Pricing and packaging:</strong> Optimize plans and pricing for cross and upsell Sales opportunities, including experimentation with our Sales-led Enterprise plan.</li> <li> <strong>Channel:</strong> New channel investments, working with Marketing to scale and nurture prospects beyond our high-intent leads.</li> </ul><p>Behind these initiatives, you will be accountable for:</p><ul> <li> <strong>Managing budgets</strong>: Allocating channel budgets to scale qualified leads sustainably, where managing cash and payback period metrics is critical.</li> <li> <strong>Setting quotas &amp; incentives</strong>: Working in collaboration with Finance to set and optimize the Sales and Success team’s targets.</li> <li> <strong>Reporting:</strong> Setting up regular reporting on leading and lagging indicators, ensuring data is accurate and actionable across the GTM.</li> <li> <strong>Team management</strong>: Managing and mentoring your team, growing your departments, and building our next generation of revenue leaders.</li> <li> <strong>Leadership and communication</strong>: The face of the Revenue org, you’ll meet regularly with the Leadership team and present at our regular Town Halls.</li> </ul><p></p><p>It’s an incredibly exciting time to explore how data and AI can optimize our revenue workflows. As a relatively small team, we have the opportunity to lean into new ways of working, without the weight of legacy, bloated teams and processes. You’ll embrace a progressive tool set and consistently seek ways to innovate in Marketing, Sales, and communication.</p><p></p><p>Fortunately, you’ll join with strong foundations and a seasoned team, including a comprehensive ICP and established data and analytics stack. Our Marketing leader has been with us for more than five years, and our Sales leader for more than three.</p><p></p><h3><strong>What You’ll Need To Be Successful</strong></h3><p>We want you to love your work and believe that these skills will allow you to succeed in the role. Applying these skills requires:</p><p><strong>Scale-up experience:</strong> You have led organizations through a scale-up journey between 80 and 300 people. You’re energized working at this stage with a growing, high-performing organization, which requires a blend of strategic thinking, and tactical hands-on work. You thrive being on the field, and playing an active hand in our success, as coach, captain, and player.</p><p><strong>Partnering with our Leaders:</strong> You enjoy partnering with a product-led founder CEO at this stage in the journey, taking ownership, and maturing revenue and operational processes for the next stage in growth. This will be our first C-suite hire who isn’t a founder.</p><p><strong>Metrics-driven growth:</strong> You’re experienced in SaaS subscription metrics and where to focus energy to grow revenue across new, expansion, and retention. You use data to deliver actionable insights that drive further investment. Our industry is moving incredibly fast - you understand that to improve requires ongoing experimentation and iteration.</p><p><strong>Marketing &amp; Sales Background:</strong> You’ve spent a good part of your career scaling Marketing and Sales organizations, acquiring a deep and nuanced understanding of the respective roles and specializations.</p><p><strong>Strong Leader:</strong> Your past direct reports will tell us, you’re an influential and effective leader and manager, leading by example, and supporting your team in their growth journeys. We’re fully remote, and to be successful, you’re particularly effective in async communication.</p><p>Above all, you’re seeking the opportunity to have an outsized impact on a global technology growth story in the next 3 to 5 years.</p><p>As a fully remote team, we’re looking for someone comfortable with asynchronous communication as the default, which means you have previous remote experience and are comfortable using tools like Slack, Loom, and Linear to communicate as needed. Don’t worry—you will have significant deep work time since we have <a href=\"https://www.float.com/blog/how-to-create-a-culture-with-fewer-meetings/\" rel=\"nofollow noreferrer noopener\" class=\"external\">very few meetings</a>.</p><p></p><h3>More about us</h3><p>We’re a global <a href=\"https://www.float.com/blog/giving-our-team-agency-over-their-time/\" rel=\"nofollow noreferrer noopener\" class=\"external\">async remote team</a> who find that working at Float allows us to live our <a href=\"https://www.float.com/blog/\" rel=\"nofollow noreferrer noopener\" class=\"external\">best work life</a>. We share our <a href=\"https://www.notion.so/Float-Handbook-9bf7a6a869744d41b2adfaa1c9131746?pvs=21\" rel=\"nofollow noreferrer noopener\" class=\"external\">Float Handbook</a> publicly so potential new team members can see first hand our <a href=\"https://www.notion.so/Pay-Perks-Benefits-and-Time-Away-From-Work-67c2928515af45729501aaf7d5195d8c?pvs=21\" rel=\"nofollow noreferrer noopener\" class=\"external\">perks &amp; benefits</a> as well as our <a href=\"https://www.notion.so/How-we-work-4727bfc669f647e790f2809efa92f8fe?pvs=21\" rel=\"nofollow noreferrer noopener\" class=\"external\">ways of working</a>. If you feel like you can thrive at Float to do your best work, we would love to hear from you.</p>","tags":"[\"finance\",\"management\"]","pubDate":"2025-02-13T00:00:00.000Z","link":"https://apply.workable.com/j/EC24E8309C","slug":"chief-revenue-officer-float-5642"}]