[{"id":7965570375,"title":"Site Reliability Engineer III, Observability","company":"Wikimedia","image":"https://remotive.com/job/1894475/logo","description":"<p><strong>Site Reliability Engineer III, Observability</strong></p>\n<p><strong>Summary</strong></p>\n<p>Wikimedia Foundation is hiring a Site Reliability Engineer (SRE) to join our SRE team, where we take care of the infrastructure that runs wikipedia.org and other Wikimedia Foundation projects. We are responsible for the entire infrastructure stack, from multiple data centers through networking and interconnects to thousands of servers and the application stack that runs on them.</p>\n<p>We are a diverse, distributed team of engineers with a drive to explore, experiment, and embrace new technologies. We are transitioning our platform from a monolith to a hybrid microservices architecture and have implemented these microservices on our on-premises Kubernetes platform with an in-house designed deployment pipeline. We’ve adopted the Elastic Stack and Prometheus as our de facto logging and monitoring platforms. We automate the operational tasks with various technologies, mainly Python and Puppet. We ensure the availability and reliability of one of the most used sites on the Internet and develop the software we need to achieve these goals - for example, our automation platform “spicerack” (<a href=\"%22https://github.com/wikimedia/operations-software-spicerack%22\" rel=\"nofollow\">https://github.com/wikimedia/operations-software-spicerack</a>), which we use to develop cookbooks for repeatable tasks (we ❤️ automation).</p>\n<p>We work in the open and document our activities on our task management system (<a href=\"%22https://phabricator.wikimedia.org%22\" rel=\"nofollow\">https://phabricator.wikimedia.org</a>) and our technical wiki (<a href=\"%22https://wikitech.wikimedia.org%22\" rel=\"nofollow\">https://wikitech.wikimedia.org</a>). Last but not least, our Grafana instance is publicly available! (<a href=\"%22https://grafana.wikimedia.org%22\" rel=\"nofollow\">https://grafana.wikimedia.org</a>) Feel free to check out our work there.</p>\n<p>We are avid supporters of open-source software. If you have interesting open-source contributions, let us know!</p>\n<p>If you find what we do exciting and enjoy working with a globally distributed team that runs a Top-15 website, we may be the place you’re looking for.</p>\n<p>As an engineer in the SRE team, you will be involved in defining and running the infrastructure and services that form the base of Wikimedia Foundation projects. This will include frequent work with other SRE members to improve our scalability, high availability, recoverability, monitoring, and logging infrastructure. You will participate in incident response and the on-call rotation. You will also frequently interact with people not in SRE, like Security, Release, and Software Engineers, who all strive to improve MediaWiki and related software. </p>\n<p>We use more technologies than we can list here and are interested in your experience, even if it doesn’t exactly match the keywords listed here.</p>\n<div class=\"h5\">Responsibilities:</div>\n<ul style=\"\">\n<li style=\"\">Implementation and maintenance of Internet-facing infrastructure and services</li>\n<li style=\"\">Use of configuration management and deployment tools</li>\n<li style=\"\">Monitoring of systems and services, optimization of performance, and resource utilization</li>\n<li style=\"\">Typical operating system-level tasks such as logging and backup / restore</li>\n<li style=\"\">Cookbook/runbook implementation for everyday maintenance actions</li>\n<li style=\"\">Incident response, diagnosis, and follow-up on system outages or alerts</li>\n<li style=\"\">Collaborating with a global and asynchronously communicating team (don’t worry if you have never worked remotely; we’ll help you get used to it)</li>\n</ul>\n<div class=\"h5\">Qualifications:</div>\n<ul style=\"\">\n<li style=\"\">2+ years experience in an SRE/Operations/DevOps role</li>\n<li style=\"\">Experience with operating highly available infrastructure</li>\n<li style=\"\">Comfortable with shell and a programming language used in an SRE/Operations engineering context (Python, Go, Ruby, etc.)</li>\n<li style=\"\">Experience with package management for operating systems (Debian, etc.)</li>\n<li style=\"\">Comfortable with Open Source configuration management and orchestration tools (Puppet, Ansible, TerraForm, etc.)</li>\n<li style=\"\">Past exposure to automation and streamlining of tasks</li>\n<li style=\"\">Communicative technical English</li>\n</ul>\n<div class=\"h5\">We would love it if you have:</div>\n<ul style=\"\">\n<li style=\"\">A history of contributing to Open Source projects</li>\n<li style=\"\">Prior participation in the Wikimedia movement</li>\n<li style=\"\">Hands-on experience with Observability related tools practices (tracing, logging, metrics, performance monitoring, SLOs, and alerting)</li>\n</ul>\n<div class=\"h4\">About the Wikimedia Foundation</div>\n<p>The Wikimedia Foundation is the nonprofit organization that operates Wikipedia and the other Wikimedia free knowledge projects. Our vision is a world in which every single human can freely share in the sum of all knowledge. We believe that everyone has the potential to contribute something to our shared knowledge, and that everyone should be able to access that knowledge freely. We host Wikipedia and the Wikimedia projects, build software experiences for reading, contributing, and sharing Wikimedia content, support the volunteer communities and partners who make Wikimedia possible, and advocate for policies that enable Wikimedia and free knowledge to thrive. </p>\n<p>The Wikimedia Foundation is a charitable, not-for-profit organization that relies on donations. We receive donations from millions of individuals around the world, with an average donation of about $15. We also receive donations through institutional grants and gifts. The Wikimedia Foundation is a United States 501(c)(3) tax-exempt organization with offices in San Francisco, California, USA.</p>\n<p><em><strong>As an equal opportunity employer, the Wikimedia Foundation values having a diverse workforce and continuously strives to maintain an inclusive and equitable workplace. We encourage people with a diverse range of backgrounds to apply. We do not discriminate against any person based upon their race, traits historically associated with race, religion, color, national origin, sex, pregnancy or related medical conditions, parental status, sexual orientation, gender identity, gender expression, age, status as a protected veteran, status as an individual with a disability, genetic information, or any other legally protected characteristics.</strong></em></p>\n<p>The Wikimedia Foundation is a remote-first organization with staff members including contractors based in more than 50 countries. Salaries at the Wikimedia Foundation are set in a way that is competitive, equitable, and consistent with our values and culture. The anticipated annual pay range of this position for applicants based within the United States is US$85,925  to US$134,289  with multiple individualized factors, including cost of living in the location, being the determinants of the offered pay. For applicants located outside of the US, the pay range will be adjusted to the country of hire. We neither ask for nor take into consideration the salary history of applicants. The compensation for a successful applicant will be based on their skills, experience and location. </p>\n<p>All applicants can reach out to their recruiter to understand more about the specific pay range for their location during the interview process.</p>\n<p><em><strong>If you are a qualified applicant requiring assistance or an accommodation to complete any step of the application process due to a disability, you may contact us at recruiting@wikimedia.org or +1 (415) 839-6885.</strong></em></p>\n<p><strong>More information</strong></p>\n<p><a href=\"%22https://wikimediafoundation.org/about/jobs/#section-12%22\" rel=\"nofollow\"><strong>U.S. Benefits &amp; Perks</strong></a><br><a href=\"%22https://wikimediafoundation.org/%22\" rel=\"nofollow\"><strong>Wikimedia Foundation</strong></a><br><a href=\"%22https://foundation.wikimedia.org/wiki/Applicant_privacy_policy%22\" rel=\"nofollow\"><strong>Applicant Privacy Policy</strong></a><br><a href=\"%22https://diff.wikimedia.org/%22\" rel=\"nofollow\"><strong>News from across the Wikimedia movement</strong></a><br><a href=\"%22https://wikimediafoundation.org/news/%22\" rel=\"nofollow\"><strong>Blog</strong></a><br><a href=\"%22https://meta.wikimedia.org/wiki/Strategy/Wikimedia_movement/2017%22\" rel=\"nofollow\"><strong>Wikimedia 2030</strong></a><br><a href=\"%22https://medium.com/freely-sharing-the-sum-of-all-knowledge/we-stand-for-racial-justice-49c31afbabca%22\" rel=\"nofollow\"><strong>Our Commitment to Equity</strong></a><br><a href=\"%22https://www.youtube.com/watch?v=OQzZI0l3IOw%22\" rel=\"nofollow\"><strong>This is Wikimedia Foundation</strong></a><strong> </strong><br><a href=\"%22https://www.youtube.com/watch?v=xQ4ba28-oGs%22\" rel=\"nofollow\"><strong>Facts Matter</strong></a><br><a href=\"%22https://wikimediafoundation.org/wiki/Our_projects%22\" rel=\"nofollow\"><strong>Our Projects</strong></a><br><a href=\"%22https://techblog.wikimedia.org/%22\" rel=\"nofollow\"><strong>Our Tech Stack</strong></a></p>\n<div id='\"l-content\"'></div><img src=\"https://remotive.com/job/track/1894475/blank.gif?source=public_api\" alt=\"\"/>","tags":"[\"kubernetes\",\"python\"]","pubDate":"2024-01-27 01:21:31.000","link":"https://remotive.com/remote-jobs/devops/site-reliability-engineer-iii-observability-1894475","savedDate":"2024-01-28 15:46:18.904","slug":"site-reliability-engineer-iii-observability-wikimedia-9789"},{"id":3229200324,"title":"Senior Go Developer for network security Remote/Work Anywhere","company":"CloudLinux","image":"https://pbs.twimg.com/profile_images/696718028084482050/ymY3OEPk_400x400.png","description":"<p>CloudLinux OS, our flagship product, powers over 45 million websites and is widely recognized as the best operating system for security and efficiency in the shared hosting industry. Running on more than 50,000 production servers, CloudLinux OS increases server density and enhances security, resulting in reduced operating costs, lower churn rates, and increased profitability.</p><p>As part of this exciting opportunity, you will be working on the Apache2Nginx project. This project involves setting up NGINX on the server and automatically converting .htaccess files into corresponding NGINX configuration.</p><p>You can find more details about the Apache2Nginx project on our product website <a href=\"https://cloudlinux.com\" rel=\"nofollow noreferrer noopener\" class=\"external\">https://cloudlinux.com</a> and in our documentation at <a href=\"https://docs.cloudlinux.com/shared/apache2nginx/\" rel=\"nofollow noreferrer noopener\" class=\"external\">https://docs.cloudlinux.com/shared/apache2nginx/</a>. Get to know more about our company at <a href=\"https://www.cloudlinux.com/\" rel=\"nofollow noreferrer noopener\" class=\"external\">Cloudlinux.com</a>.</p><h3>Requirements: </h3><p>To be successful you should have:</p><ul> <li>At least 5 years of hands-on experience in software development</li> <li>Extensive knowledge and proficiency with Linux, with at least 5 years of experience</li> <li>Strong understanding and ability to analyze the performance of classical algorithms and data structures</li> <li>Proficient in writing and maintaining code following the Go style guide</li> <li>Proven experience in multithreaded programming and developing asynchronous applications</li> <li>Thorough understanding of the network stack, particularly TCP/IP and HTTP</li> <li>Familiarity with Go-testing and debugging tools</li> <li>Skilled in performance analysis and optimization</li> <li>Ability to patch and modify existing Go solutions</li> <li>Excellent knowledge and understanding of Nginx/Apache architecture for developing additional components</li> <li>Proficiency in using Git for version control</li> <li>Strong Linux/Unix skills, preferably with experience in RHEL/CentOS/Almalinux</li> <li>Experience with Shell scripting</li> <li>Great teamwork skills</li> <li>Ability to read and understand code written by others</li> <li>Good command of the English language, including reading technical documentation</li> </ul><h3>Benefits: </h3><p><strong>What's in it for you?</strong></p><ul> <li>A focus on professional development; </li> <li>Interesting and challenging projects</li> <li>Flexible working hours</li> <li>Paid one month vacation per year and unlimited sick leave</li> <li>Medical insurance reimbursement</li> <li>Co-working and gym/sports reimbursement</li> <li>The opportunity to receive a reward for the most innovative idea that the company can patent</li> </ul><p><em>By applying for this position, you agree with </em><a href=\"https://cloudlinux.com/privacy-policy\" rel=\"nofollow noreferrer noopener\" class=\"external\"><em>Cloudlinux Privacy Policy</em></a><em> and give us your consent to maintain and process your personal data with this respect. Please read our Privacy Policy for more information.</em></p>","tags":"[]","pubDate":"2024-01-26 00:00:00.000","link":"https://apply.workable.com/cloudlinux-1/j/7ED876B846","savedDate":"2024-01-28 15:46:18.905","slug":"senior-go-developer-for-network-security-remote-work-anywhere-cloudlinux-9865"},{"id":8250983056,"title":"C/C++ Developer I Remote/Work Anywhere","company":"CloudLinux","image":"https://pbs.twimg.com/profile_images/696718028084482050/ymY3OEPk_400x400.png","description":"<p>This is your chance to join Cloud Linux Inc. - the creators of the #1 OS for web-hosting providers. We are a company dedicated to using the most cutting-edge technologies to develop our products - CloudLinux OS, KernelCare, Imunify360, and Imunify Email. Our software is trusted by thousands of renowned companies worldwide, including Dell, GoDaddy, IBM, Zoom, and many others.</p><p>We are currently seeking a talented C/C++ Developer to join our team. This is a full-time, remote position that offers incredible opportunities for growth and advancement. As a programmer, you will have the chance to expand your skill set and knowledge by taking on increasingly challenging tasks as you progress within our company.</p><p>One of the major highlights of working with us is the opportunity to work with exciting technologies, experiment, and continuously learn. You will have the chance to work with modules and plugins for Apache, MySQL, PHP, and other open-source products. Additionally, you will have hands-on experience in debugging services and creating your own daemons.</p><p></p><h3>Requirements: </h3><p>To be successful you should have:</p><ul> <ul> <li>Extensive knowledge of Linux development tools and Linux system software development</li> <li>Strong familiarity with Linux - 2-3 years of experience</li> <li>Proven expertise in programming under Linux using C/C++ - 2 years of experience</li> <li>Experience with RHEL and CentOS</li> <li>Thorough understanding of data storage algorithms</li> <li>Hands-on experience with profiling tools like Linux perf, etc</li> <li>Proficiency in developing multi-threaded applications and IPC</li> <li>Knowledge of shell scripting is a plus</li> <li>Desirable knowledge of Python</li> <li>Able to decipher code</li> <li>Ability to read and write in English</li> </ul> <li>The responsibilities include:</li> <ul> <li>Creating patches and supporting modules for Apache</li> <li>Developing patches and supporting MySQL/MariaDB services</li> <li>Setting up and managing test environments for existing and newly created modules</li> </ul> <li>Your Experience and Qualifications:</li> <ul><li>Bachelor's or Master's degree in Computer Science, Computer Security, Mathematics, or a related discipline from an accredited college or university is desired</li></ul> <li>Personal skills:</li> <ul> <li>Demonstrated ability to quickly learn and adapt to new technologies</li> <li>Strong self-motivation, with the ability to deliver results with minimal supervision</li> <li>Strong teamwork and independent work capabilities</li> <li>Ability to formulate innovative ideas, approaches, and designs</li> <li>Openness to collaboration and feedback from others</li> <li>Ability to make informed decisions and take responsibility for them</li> <li>Capable of independently analyzing tasks and finding optimal solutions</li> <li>Adaptability and ability to thrive in a fast-paced, ever-changing environment</li> </ul> </ul><h3>Benefits: </h3><p><strong>What's in it for you?</strong></p><ul> <li>A focus on professional development; </li> <li>Interesting and challenging projects</li> <li>Flexible working hours</li> <li>Paid one month vacation per year and unlimited sick leave</li> <li>Medical insurance reimbursement</li> <li>Co-working and gym/sports reimbursement</li> <li>The opportunity to receive a reward for the most innovative idea that the company can patent</li> </ul><p><em>By applying for this position, you agree with </em><a href=\"https://cloudlinux.com/privacy-policy\" rel=\"nofollow noreferrer noopener\" class=\"external\"><em>Cloudlinux Privacy Policy</em></a><em> and give us your consent to maintain and process your personal data with this respect. Please read our Privacy Policy for more information.</em></p>","tags":"[\"mysql\"]","pubDate":"2024-01-25 00:00:00.000","link":"https://apply.workable.com/cloudlinux-1/j/F45212B4F0","savedDate":"2024-01-28 15:46:18.905","slug":"c-c-developer-i-remote-work-anywhere-cloudlinux-5969"}]