[{"id":3342574490,"title":"Business Development Representative","company":"BioRender","image":"https://yt3.googleusercontent.com/8szApiN8P0n8pp0GeXj_z9R4Wh1gJBGW5OJZDocvTtvuCF69U0Q4h2lXDct74mL2_F7vuUwKMA","description":"<p style=\"min-height:1.5em\">At BioRender, our mission is to accelerate the world’s ability to learn, discover and communicate science. We are passionate about democratizing science communication in order to accelerate scientific discovery and understanding. We're looking for amazing people to help create the world’s go-to-place and platform where science is communicated. Come join us!</p><p style=\"min-height:1.5em\">As our Enterprise Business Development Representative you will be working and calling into some of the biggest pharmaceutical companies on the planet. Working with your dedicated Account Executives, you will strategize, plan and  break into these accounts by finding new business opportunities. You will be instrumental in helping book BioRender on-sites by getting in touch with both end-user and Senior Leadership. The Enterprise BDR plays a key role in bringing BioRender to the next phase of it’s growth.</p><p style=\"min-height:1.5em\"></p><p style=\"min-height:1.5em\">This role is remote-friendly within Canada.</p><p style=\"min-height:1.5em\"></p><p style=\"min-height:1.5em\"><strong>You will be successful in this role with</strong></p><ul style=\"min-height:1.5em\"><li><p style=\"min-height:1.5em\"><strong>Exceptional customer curiosity: </strong>You have a genuine interest in learning about the clients we serve, their goals, and their science communication pain points. You are curious, love asking questions, and can think outside of the box.</p></li></ul><ul style=\"min-height:1.5em\"><li><p style=\"min-height:1.5em\"><strong>A continuous improvement approach: </strong>You have a growth mindset and you’re open to coaching and continuous feedback. You are able to thrive in a fast-paced and collaborative environment with changing goals and priorities.</p></li><li><p style=\"min-height:1.5em\"><strong>A self-starter attitude: </strong>You are hunter, self-motivated, resourceful, and know how to hustle.</p></li></ul><p style=\"min-height:1.5em\"></p><p style=\"min-height:1.5em\"><strong>Your responsibilities:</strong></p><ul style=\"min-height:1.5em\"><li><p style=\"min-height:1.5em\"><strong>Lead Generation &amp; Pipeline Development</strong>: Focus on identifying current BioRender users as well as generating new leads through various methods to target Top 30 pharma accounts </p></li><li><p style=\"min-height:1.5em\"><strong>Relationship Building</strong>: Engage with senior executives (C-level leaders) to develop meaningful relationships that contribute to sales growth</p></li><li><p style=\"min-height:1.5em\"><strong>Sales Process Management</strong>: Manage the initial stages of the sales cycle by prospecting and qualifying leads and passing them on to Senior Account Executives and Enterprise Customer Success Managers</p></li><li><p style=\"min-height:1.5em\"><strong>Collaboration with Internal Teams</strong>: Work closely with sales, marketing, and business development teams to execute effective outreach strategies </p></li><li><p style=\"min-height:1.5em\"><strong>Performance Tracking</strong>: Use data tools to analyze performance metrics and optimize outreach efforts, ensuring that strategies align with business goals</p></li></ul><p style=\"min-height:1.5em\"></p><p style=\"min-height:1.5em\"><strong>What you bring to the table</strong></p><ul style=\"min-height:1.5em\"><li><p style=\"min-height:1.5em\">1+ year of experience in a Business Development or Sales role, ideally within a SaaS or B2B environment with a focus on enterprise clients </p></li></ul><ul style=\"min-height:1.5em\"><li><p style=\"min-height:1.5em\">Exceptional verbal and written communication skills, with an ability to engage senior-level executives</p></li><li><p style=\"min-height:1.5em\">Strong working knowledge of ZoomInfo, building lead lists and finding the right contacts/leads</p></li><li><p style=\"min-height:1.5em\">You love running discovery calls. You can ask the tough questions, find pain and connect the value of the product to solve those customer problems</p></li><li><p style=\"min-height:1.5em\">Fearless approach to cold outreach, with a proven ability to make high-volume calls and initiate client relationships</p></li><li><p style=\"min-height:1.5em\">Track record of consistently meeting or exceeding targets, with a strong focus on results</p></li><li><p style=\"min-height:1.5em\">Highly self-motivated, adaptable, and willing to go above and beyond typical responsibilities</p></li><li><p style=\"min-height:1.5em\">Bachelor’s degree in a related field (e.g., life sciences, biotechnology, or similar) is a plus</p></li></ul><p style=\"min-height:1.5em\">Note: We recognize that career paths vary, and your unique journey may have equipped you with the necessary skills even if you don’t meet all of the criteria above. If you believe you have what it takes to excel in this role, we encourage you to apply!</p><p style=\"min-height:1.5em\"></p><p style=\"min-height:1.5em\"><strong>What you can expect from our interview process</strong></p><p style=\"min-height:1.5em\"><strong>Introductory calls: </strong>We will set up a 20-30 minute phone call with one of our recruiters during which you’ll have the opportunity to share more about your experience and interests. You’ll also learn more about BioRender and the team you’re interviewing with. Feel free to ask any questions throughout these calls!</p><p style=\"min-height:1.5em\"><strong>Practical interview: </strong>You’ll be completing a practical exercise so we can see your skills in action and give you a realistic role preview. This exercise will be conducted with our BD Manager</p><p style=\"min-height:1.5em\"><strong>Meet the team: </strong>Throughout our interview process, you can expect to meet with some of your potential colleagues.</p><p style=\"min-height:1.5em\"></p><p style=\"min-height:1.5em\"></p><p style=\"min-height:1.5em\"><strong>Why join us?</strong></p><p></p><ul style=\"min-height:1.5em\"><li><p style=\"min-height:1.5em\">We are mission-driven, and work collaboratively towards our shared vision of improving scientific communication and accelerating scientific discovery: BioRender figures have appeared in more than 16,000 publications! </p></li><li><p style=\"min-height:1.5em\">It’s a product that users love! We have a world-class NPS and a community of loyal fans. Check out our Testimonials page to see what our customers are saying about us: <a target=\"_blank\" rel=\"noopener noreferrer\" class=\"postings-link\" href=\"https://biorender.com/testimonials/\">https://biorender.com/testimonials/ </a></p></li><li><p style=\"min-height:1.5em\">We are in the top quartile for profitability and year-over-year revenue growth, with users in 200+ countries.</p></li><li><p style=\"min-height:1.5em\">BioRender is an equal opportunity employer, and an inclusive hiring process and work environment is a part of our DNA. </p></li><li><p style=\"min-height:1.5em\">We’re remote-first and have team members across Canada and the United States. A physical office in Toronto is available, but you have the flexibility to work from anywhere. </p></li><li><p style=\"min-height:1.5em\">We’re backed by top investors, accelerators, and some of the most successful life science entrepreneurs and philanthropists in the world including Y Combinator, Malala Fund founders, and Fifty Years VC. </p></li><li><p style=\"min-height:1.5em\">We are committed to building a warm, inclusive, and diverse environment. Check out how we make sure our <a target=\"_blank\" rel=\"noopener noreferrer\" class=\"postings-link\" href=\"https://www.biorender.com/biorender-careers\">employees come first</a>.</p></li></ul><p style=\"min-height:1.5em\"></p><p style=\"min-height:1.5em\">You can read more about the <a target=\"_blank\" rel=\"noopener noreferrer\" class=\"postings-link\" href=\"https://biorender.notion.site/BioRender-Candidate-Resources-8255c155797f442a950720a33b4764d5\">BioRender interview process and FAQs here</a>!</p><p></p>","tags":"[\"management\",\"B2B\"]","pubDate":"2024-10-18 01:01:28.141","link":"https://jobs.ashbyhq.com/biorender/c28f7c2e-3a21-4444-a170-c9865b18977a","savedDate":"2024-10-18 01:01:28.141","slug":"business-development-representative-biorender-4510"},{"id":1031815403,"title":"Cryptographic Software Engineer (C/C++) (remote-only position)","company":"CloudLinux","image":"https://pbs.twimg.com/profile_images/696718028084482050/ymY3OEPk_400x400.png","description":"<p>CloudLinux is a leading global company specializing in high-volume, low-cost Linux infrastructure and security products. We prioritize our employees and embrace remote working, ensuring a supportive and collaborative work environment. At CloudLinux, we pride ourselves on making a meaningful impact in the Linux and hosting industry.</p><p>We are seeking a talented and motivated Cryptographic Software Engineer to join our team. This role will provide the opportunity to work closely with experienced engineers to gain hands-on experience in the cybersecurity and cryptographic fields, focusing on compliance and technical excellence.</p><p>The Cryptographic Software Engineerwill assist in the development, testing, and documentation of cryptographic modules and systems in compliance with Federal Information Processing Standards (FIPS). The role requires a keen attention to detail, strong communication skills, and a passion for cybersecurity and technical documentation.</p><h3>Key Responsibilities:</h3><ul> <li>Support the FIPS 140-3 certification process for cryptographic modules.</li> <li>Assist in building, testing, and maintaining RPM packages for various cryptographic libraries.</li> <li>Collaborate with senior engineers and external labs to write and review technical documentation, ensuring clarity and compliance with standards.</li> <li>Work with AlmaLinux, CentOS Stream, or RHEL in a development and testing environment.</li> <li>Contribute to the security engineering team by applying knowledge of cryptographic concepts, such as encryption, key exchange, and hashing.</li> <li>Learn and apply best practices in cybersecurity, specifically relating to cryptographic libraries like OpenSSL and GnuTLS.</li> </ul><h3>Requirements: </h3><h3>Must-Have Qualifications:</h3><ul> <li>Proficiency in C/C++.</li> <li>Experience or knowledge in building RPM packages.</li> <li>Basic knowledge of mathematics and cybersecurity concepts.</li> <li>Experience with AlmaLinux, CentOS Stream, or RHEL.</li> <li>Strong proficiency in spoken and written English.</li> <li>High attention to detail and ability to work with technical documentation.</li> <li>A passion for writing and reviewing technical materials.</li> </ul><h3>Nice-to-Have Qualifications:</h3><ul> <li>Experience with debugging tools (e.g., GDB, VS Code).</li> <li>Familiarity with OpenSSL, NSS, Libgcrypt, GnuTLS.</li> <li>Cybersecurity certification (e.g., ISC2, CompTIA).</li> <li>Understanding of cryptographic concepts, including encryption, key exchange, hashing, PKI, entropy, and random number generators (RNGs).</li> <li>Knowledge of encrypted protocols (e.g., SSH, IPsec, TLS).</li> </ul><h3>Benefits: </h3><p><strong>What's in it for you?</strong></p><ul> <li>A focus on professional development</li> <li>Interesting and challenging projects</li> <li>Fully remote work with flexible working hours, that allows you to schedule your day and work from any location worldwide</li> <li>Paid 24 days of vacation per year, 10 days of national holidays, and unlimited sick leaves</li> <li>Compensation for private medical insurance </li> <li>Co-working and gym/sports reimbursement</li> <li>Budget for education</li> <li>The opportunity to receive a reward for the most innovative idea that the company can patent</li> </ul><p></p><p></p><p><em>By applying for this position, you agree with </em><a href=\"https://cloudlinux.com/privacy-policy%20\" rel=\"nofollow noreferrer noopener\" class=\"external\">the Cloudlinux Privacy Policy</a><em>and give us your consent to maintain and process your personal data in this respect. Please read our Privacy Policy for more information.</em></p>","tags":"[\"engineering\"]","pubDate":"2024-10-17 00:00:00.000","link":"https://apply.workable.com/cloudlinux-1/j/0E99C878CB","savedDate":"2024-10-18 01:01:28.138","slug":"cryptographic-software-engineer-c-c-remote-only-position-cloudlinux-3392"},{"id":1525808825,"title":"IT Intern for DevOps team (remote-only opportunity, location - Europe&CIS)","company":"CloudLinux","image":"https://pbs.twimg.com/profile_images/696718028084482050/ymY3OEPk_400x400.png","description":"<p>We are looking for an Intern to to become a member of the CloudLinux infrastructure team. Our team is entrusted with a wide range of responsibilities, from managing access and providing compute resources and services to everyone in the company, to developing our own infrastructure projects and automations.</p><p>This is a remote internship opportunity, allowing you to work from anywhere and have a flexible schedule. No prior work experience is required for this internship opportunity. If you are a passionate individual interested in gaining practical experience in Internal IT and contributing to meaningful projects, we would love to hear from you!</p><p>Apply now and kick-start your career with CloudLinux!</p><p>CloudLinux is a global remote-first company. We are driven by our principles: Do the right thing, \temployees first, we are remote first, and we deliver high volume, low-cost Linux infrastructure and security products that help companies to increase the efficiency of their operations. Every person on our team supports each other and does what we can to ensure we all are successful.&nbsp;</p><p>We are truly a great place to work. </p><p></p><p><strong>&nbsp;&nbsp;Responsibilities:</strong></p><ul> <li>Assist end-users with technical issues, troubleshooting software problems, and providing timely resolutions, including remote users</li> <li>Participate in maintaining and upgrading the company's IT infrastructure</li> <li>Contribute to ongoing IT projects</li> <li>Assist with Attlassian family products administration</li> <li>Assist with VPN, domain, DNS records administration</li> </ul><h3>Requirements: </h3><ul> <li>Currently enrolled in or recently graduated from a bachelor's program in Computer Science, Information Technology, or a related field.</li> <li>Basic knowledge of Linux OS family</li> <li>Basic understanding of IT principles, including software, networking, and cybersecurity.</li> <li>Strong problem-solving skills and an eagerness to learn new technologies.</li> <li>Fluency in English and Russian.</li> <li>Strong analytical skills and attention to detail.</li> <li>Passion for technology.</li> <li>Git knowledge</li> <li>Basic scripting ability</li> </ul><h3>Benefits: </h3><p><strong>What's in it for you?</strong></p><ul> <li>Work on real project tasks in an Agile team</li> <li>A dedicated mentor who's always ready to answer your questions</li> </ul><ul> <li>A focus on professional development;</li> <ul> <li>Training reimbursements</li> <li>Mentor programs</li> <li>Knowledge-Exchange programs</li> <li>Interesting and challenging projects</li> </ul> <li>Flexible working hours in fully remote environment\t</li> </ul><p></p><p>By applying for this position, you agree with CloudLinux Privacy Policy - <a href=\"https://cloudlinux.com/privacy-policy\" rel=\"nofollow noreferrer noopener\" class=\"external\">https://cloudlinux.com/privacy-policy</a> and give us your consent to maintain and process your personal data in this respect. Please read our Privacy Policy for more information.</p>","tags":"[]","pubDate":"2024-10-17 00:00:00.000","link":"https://apply.workable.com/cloudlinux-1/j/B428912727","savedDate":"2024-10-18 01:01:28.138","slug":"it-intern-for-devops-team-remote-only-opportunity-location-europe-cis-cloudlinux-924"},{"id":1530484173,"title":"Database Administrator (Clickhouse)","company":"CloudLinux","image":"https://pbs.twimg.com/profile_images/696718028084482050/ymY3OEPk_400x400.png","description":"<p></p><p>We are looking for a highly skilled and knowledgeable Database Administrator (DBA) to join our Infrastructure Team. In this role, you will be responsible for configuring and maintaining highly available PostgreSQL and Clickhouse databases. Your expertise will play a crucial role in ensuring the reliability, performance, and scalability of our database systems.</p><p>CloudLinux is a global remote-first company. We are driven by our principles: Do the right thing, employees first, we are remote first, and&nbsp; we deliver high volume, low-cost Linux infrastructure and security products that help companies to increase the efficiency of their operations. Every person on our team supports each other and does what we can to ensure everyone is successful. We are truly a great place to work.&nbsp;</p><p>You can find more details about the company on our branded website at <a href=\"http://cloudlinux.com/\" rel=\"nofollow noreferrer noopener\" class=\"external\">cloudlinux.com</a></p><p><strong>What you’ll do:</strong></p><ul> <li>Perform regular database maintenance, search for weak points (shortcomings) of the existing architecture, provide solutions or workarounds and help implement them</li> <li>Configure database backups and prepare recovery plans</li> <li>Describe database infrastructure as a code</li> <li>Document databases of existing services and applications</li> <li>Maintain user access rights and security of databases</li> <li>Define key database monitoring metrics and define action plans to avoid/fix possible problems</li> <li>Write standard operating procedures for recurring tasks, maintenance and recovery works</li> <li>Advise users on the subject of database optimization and writing DB queries</li> </ul><p></p><p></p><h3>Requirements: </h3><p><strong>To be successful you should have:</strong></p><ul> <li>1+ years of ClickHouse DB administration experience</li> <li>1+ years of PostgresSQL DB administration experience</li> <li>Experience in configuring a database in a high availability architecture</li> <li>Experience in database backup and recovery</li> <li>Experience in database optimization for different load profiles</li> <li>Intermediate level of English knowledge</li> </ul><p><strong>Will be a plus:</strong></p><ul> <li>Experience in automating data loading from different sources.</li> <li>Experience with Ansible, Terraform</li> <li>Experience with k8s and clouds (AWS/GCP).</li> </ul><h3>Benefits: </h3><p><strong>What's in it for you?</strong></p><ul> <li>A focus on professional development; </li> <li>Interesting and challenging projects</li> <li>Flexible working hours</li> <li>Paid one month vacation per year and unlimited sick leave</li> <li>Medical insurance reimbursement</li> <li>Co-working and gym/sports reimbursement</li> <li>The opportunity to receive a reward for the most innovative idea that the company can patent</li> </ul><p><em>By applying for this position, you agree with </em><a href=\"https://cloudlinux.com/privacy-policy\" rel=\"nofollow noreferrer noopener\" class=\"external\"><em>Cloudlinux Privacy Policy</em></a><em> and give us your consent to maintain and process your personal data with this respect. Please read our Privacy Policy for more information.</em></p>","tags":"[\"postgres\",\"database\",\"aws\"]","pubDate":"2024-10-17 00:00:00.000","link":"https://apply.workable.com/cloudlinux-1/j/AADB4154FF","savedDate":"2024-10-18 01:01:28.139","slug":"database-administrator-clickhouse-cloudlinux-5320"},{"id":7787713942,"title":"Full Stack Engineer III","company":"Outliant","image":"https://remotive.com/job/1943562/logo","description":"<p style=\"min-height: 1.5em;\"><strong>About us:</strong></p>\n<p style=\"min-height: 1.5em;\">Outliant is a fully-remote, US-based, digital product development and startup consulting company, with a team of culturally diverse creators whose exceptional skills and talents help conceive seamless digital products. Our teams exhibit work-play energy that supports individual growth, as well as encourages the freedom of creativity and “thinking outside the box.”</p>\n<p style=\"min-height: 1.5em;\"><br><strong>Our Core Values:</strong></p>\n<ul style=\"\">\n<li style=\"\">\n<p style=\"min-height: 1.5em;\"><strong>Pursuit of Excellence: </strong>We are extremely competitive, ambitious, and driven to be exceptional – as individuals, teams, and as an organization. There is no standard high enough and we will never settle. We aspire to attract, retain, and empower the very best people.</p>\n</li>\n<li style=\"\">\n<p style=\"min-height: 1.5em;\"><strong>Startup Mentality: </strong>Outliant began with 5 startup founders, and startup culture is deep in our DNA. It’s a critical advantage that allows us to move faster, be more resourceful, and empower our team at all levels. We are in the early chapters of our journey.</p>\n</li>\n<li style=\"\">\n<p style=\"min-height: 1.5em;\"><strong>World-Class Remote Collaboration: </strong>Outliant is (and always has been) a 100% remote company – we have no offices and our teams are distributed around the world. Given the freedom and autonomy this provides, we require that our people excel in this remote structure.</p>\n</li>\n</ul>\n<p style=\"min-height: 1.5em;\"> </p>\n<p style=\"min-height: 1.5em;\"><strong>About the role:</strong></p>\n<p style=\"min-height: 1.5em;\">As a Full Stack Engineer III with Webflow experience, you will apply a diverse range of advanced skills and concepts to develop and maintain robust frontend and backend systems. You will tackle assignments that require innovative solutions and take ownership of the planning and execution of these tasks. Your role will involve guiding and mentoring junior teammates, fostering collaboration within the team. You will also make contributions in improving code quality, process efficiency, and project delivery timelines, helping to enhance overall team performance.</p>\n<p style=\"min-height: 1.5em;\"> </p>\n<p style=\"min-height: 1.5em;\"><strong>Seniority Level: </strong>Senior</p>\n<p style=\"min-height: 1.5em;\"> </p>\n<p style=\"min-height: 1.5em;\"><strong>Responsibilities:</strong></p>\n<ul style=\"\">\n<li style=\"\">\n<p style=\"min-height: 1.5em;\"><strong>Innovative Fullstack Development</strong>: Lead the design and implementation of cutting-edge frontend and backend systems.</p>\n</li>\n<li style=\"\">\n<p style=\"min-height: 1.5em;\"><strong>Performance Optimization</strong>: Use innovative techniques to maximize efficiency and performance across the full stack.</p>\n</li>\n<li style=\"\">\n<p style=\"min-height: 1.5em;\"><strong>Advanced Component Development: </strong>Create and maintain advanced, reusable components and services.</p>\n</li>\n<li style=\"\">\n<p style=\"min-height: 1.5em;\"><strong>Strategic Planning:</strong> Plan and execute complex assignments with a focus on innovative solutions.</p>\n</li>\n<li style=\"\">\n<p style=\"min-height: 1.5em;\"><strong>Leadership and Mentorship:</strong> Mentor junior engineers and lead technical initiatives.</p>\n</li>\n<li style=\"\">\n<p style=\"min-height: 1.5em;\"><strong>Cross-Functional Leadership:</strong> Coordinate with various teams to ensure seamless project integration.</p>\n</li>\n</ul>\n<p style=\"min-height: 1.5em;\"> </p>\n<p style=\"min-height: 1.5em;\"><strong>Requirements:</strong></p>\n<ul style=\"\">\n<li style=\"\">\n<p style=\"min-height: 1.5em;\">5-7 years of professional experience working as a software engineer in a team environment</p>\n</li>\n<li style=\"\">\n<p style=\"min-height: 1.5em;\">Experience working with Webflow projects</p>\n</li>\n<li style=\"\">\n<p style=\"min-height: 1.5em;\">Demonstrated passion for consulting, improving, good conflict resolution and criteria</p>\n</li>\n<li style=\"\">\n<p style=\"min-height: 1.5em;\">Strong communication skills</p>\n</li>\n<li style=\"\">\n<p style=\"min-height: 1.5em;\">Positive recommendations from your previous managers and teammates</p>\n</li>\n<li style=\"\">\n<p style=\"min-height: 1.5em;\">Proven proficiency with frontend technologies (like React, Flutter, Angular, React Native, Vue) and backend technologies (like Firebase, AWS, NodeJS, C#, Rust, Databases)</p>\n</li>\n<li style=\"\">\n<p style=\"min-height: 1.5em;\">Strong understanding of software development at scale and product mindset</p>\n</li>\n<li style=\"\">\n<p style=\"min-height: 1.5em;\">Strong communication skills</p>\n</li>\n<li style=\"\">\n<p style=\"min-height: 1.5em;\">College education is a plus</p>\n</li>\n<li style=\"\">\n<p style=\"min-height: 1.5em;\">Must be able to work in the EST timezone</p>\n<p style=\"min-height: 1.5em;\"> </p>\n</li>\n</ul>\n<p style=\"min-height: 1.5em;\"><strong>Nice-to-have</strong></p>\n<ul style=\"\">\n<li style=\"\">\n<p style=\"min-height: 1.5em;\">Proficiency with NextJS and AWS</p>\n</li>\n<li style=\"\">\n<p style=\"min-height: 1.5em;\">Have experience with working on internationalization and localization</p>\n</li>\n<li style=\"\">\n<p style=\"min-height: 1.5em;\">Experience working in a startup environment</p>\n<p style=\"min-height: 1.5em;\"> </p>\n</li>\n</ul>\n<p style=\"min-height: 1.5em;\"><strong>What’s in it for you?</strong></p>\n<p style=\"min-height: 1.5em;\">As a full-time member of our team, you’ll enjoy:</p>\n<ul style=\"\">\n<li style=\"\">\n<p style=\"min-height: 1.5em;\">Unlimited PTO.</p>\n</li>\n<li style=\"\">\n<p style=\"min-height: 1.5em;\">Non-working holidays per country of residence.</p>\n</li>\n<li style=\"\">\n<p style=\"min-height: 1.5em;\">Pro-rated 13th-month bonus in select regions.</p>\n</li>\n<li style=\"\">\n<p style=\"min-height: 1.5em;\">Salary increases and performance-based bonuses.</p>\n</li>\n<li style=\"\">\n<p style=\"min-height: 1.5em;\">Referral bonuses.</p>\n</li>\n<li style=\"\">\n<p style=\"min-height: 1.5em;\">Mental health and well-being programs.</p>\n</li>\n<li style=\"\">\n<p style=\"min-height: 1.5em;\">Fun and casual work environment.</p>\n</li>\n<li style=\"\">\n<p style=\"min-height: 1.5em;\">Employee engagement activities and virtual gatherings.</p>\n</li>\n<li style=\"\">\n<p style=\"min-height: 1.5em;\">We are a diverse, global team! 🌍</p>\n</li>\n</ul>\n<p style=\"min-height: 1.5em;\"> </p>\n<p style=\"min-height: 1.5em;\"> </p>\n<p style=\"min-height: 1.5em;\"><strong>Important Notice</strong></p>\n<p style=\"min-height: 1.5em;\">To ensure the legitimacy of job opportunities, we strongly recommend that you solely rely on positions posted here on our official website: <a href=\"http://outliant.com/careers\" rel=\"nofollow\" target=\"_blank\"><strong>outliant.com/careers</strong></a>.</p>\n<p style=\"min-height: 1.5em;\"> </p>\n<p style=\"min-height: 1.5em;\">All our current job openings require video interviews conducted in either or both synchronous (via Google Meet) and asynchronous (via Willo) formats. Kindly refrain from accepting offers that appear suspicious. For any inquiries or concerns, feel free to reach out to us via email at <a href=\"mailto:recruitment@outliant.com\" rel=\"nofollow\" target=\"_blank\"><strong>recruitment@outliant.com</strong></a>.</p>\n<p style=\"min-height: 1.5em;\"> </p>\n<p style=\"min-height: 1.5em;\">Please be assured that we are fully committed to maintaining integrity in our hiring process.</p>\n<img src=\"https://remotive.com/job/track/1943562/blank.gif?source=public_api\" alt=\"\"/>","tags":"[\"AWS\",\"react\"]","pubDate":"2024-10-16 11:20:13.000","link":"https://remotive.com/remote-jobs/software-dev/full-stack-engineer-iii-1943562","savedDate":"2024-10-18 01:01:28.136","slug":"full-stack-engineer-iii-outliant-9072"},{"id":9288538147,"title":"Nightshift Spanish Player Support Advocate","company":"PTW","image":"https://remotive.com/job/1944001/logo","description":"<p><strong>Title</strong>: Player Support Advocate</p>\n<p><strong>Location:</strong> Remote | Work from Home</p>\n<p><strong>Familiarisation/Training:</strong> Fully Paid</p>\n<p>Candidates with a strong passion for games, customer service, technical support, languages, linguistics, translation, localization, Player Support, QA, LQA, or those wanting to gain entry into a fascinating and growing industry, are invited to apply! </p>\n<p>As one of our Player Support Advocates, you will be an ambassador for our brand and your role will be to provide world-class support to gamers and loyal customers. You should be passionate about customer service, confidently calm, technically minded, and have a pro-active and positive \"can do\" attitude. Whilst working with a global operation across multiple languages, your goal will be to make the customer journey seamless and positive. You are provided with full training and ongoing support with the opportunity to progress through levels to become either a Tier 2 Advocate, Language Specialist, Coach, Team Manager, Subject Matter Expert, or even a Game Master! You would be communicating in the language you are applying for, and English.</p>\n<p><strong>What you’ll be doing:</strong></p>\n<ul style=\"\">\n<li style=\"\">Ensuring customers' queries are answered with the aim of a first-time resolution and ensuring that all responses are provided with excellent attention to detail, care, and professionalism.</li>\n<li style=\"\">Ensuring queries are responded to within our agreed response times and that all customer communications are dealt with to provide solutions as a priority whilst protecting confidentiality.</li>\n<li style=\"\">Resolving all technical issues raised by customers, particularly via live chat, by carrying out fault finding analysis and offering appropriate solutions that resolve the customers issue. Although the majority of the role is based on non-voice communications, you will be trained and expected to communicate with customers via telephone (call backs for example).</li>\n<li style=\"\">You will communicate effectively while working within a dynamic team structure with individual and shared team objectives, as it is your responsibility as a team member to ensure the best customer care experience is given to all customers.</li>\n<li style=\"\">Maintaining a world class, dedicated service, focused on exceptional responses and excellent, outstanding quality.</li>\n<li style=\"\">Working with your colleagues across the wider global customer community to identify any trends in any customer queries.</li>\n<li style=\"\">Although you may be working anywhere in the World, all candidates will generally work UK hours and shift patterns.</li>\n</ul>\n<p><strong>Requirements</strong></p>\n<p><strong>What we’re looking for:</strong></p>\n<ul style=\"\">\n<li style=\"\">Fluency in the language you are applying for &amp; English, particularly reading &amp; writing.</li>\n<li style=\"\">Excellent attention to detail, strong communication skills, and knowledge of Computers.</li>\n<li style=\"\">Self-motivated, a proactive attitude with the ability to work productively and collaboratively within a multilingual team.</li>\n<li style=\"\">A logical, methodical approach with good analytical and problem-solving skills.</li>\n<li style=\"\">Excellent observation and attention to detail skills with patience, perseverance, and good concentration.</li>\n<li style=\"\">Experience in playing consoles and or PC gaming advantageous.</li>\n<li style=\"\">Be comfortable discussing technical faults/issues relating to game consoles/PCs.</li>\n<li style=\"\">Experience of someone IT literate, with a tech-savvy mind, or coming from a Customer Service, Technical IT /PC support background is advantageous, although we provide excellent training and on-going support.</li>\n<li style=\"\">Our Advocates must be able to multitask, be comfortable taking multiple chats, emails and calls per hour, ensuring an amazing-accurate service is provided 100% of the time.</li>\n<li style=\"\">All candidates should possess a desire to help, support and provide the best customer experience possible.</li>\n</ul>\n<p><strong>PC requirements:</strong></p>\n<ul style=\"\">\n<ul style=\"\">\n<li style=\"\">An internet speed minimum of 10 Mb/s download and 1.7 Mb/s upload internationally.</li>\n<li style=\"\">A minimum of 4 GB RAM memory.</li>\n<li style=\"\">Your computer should run at least a 64-bit version of Windows 10 or newer or a recently released version of macOS.</li>\n<li style=\"\">An i5 processor (2,4 GHz or faster), or better/ similar, max. 3 years old.</li>\n<li style=\"\">A screen with at least a 1080p Full HD display. External monitors are acceptable.</li>\n<li style=\"\">A (smart)phone usable for two-factor authentication that runs at least:</li>\n<li style=\"\">Android 9 or newer.</li>\n<li style=\"\">Apple iOS 15 or newer.</li>\n<li style=\"\">Your own Webcam, Headset and Laptop/PC.</li>\n<li style=\"\">Your own separate and private working area with a comfortable table and chair.</li>\n</ul>\n</ul>\n<p> </p>\n<p><strong>Applicants Requirements:</strong></p>\n<ul style=\"\">\n<li style=\"\">Candidates living in Poland must have the Right To Work (Citizenship, valid working VISA or permit) and will usually be offered a PTW Employee Employment Contract.</li>\n<li style=\"\">All candidates must adhere to confidentiality and security protocols, at all times.</li>\n<li style=\"\">All candidates will be required to pass an online language and skills test, including a final competency based live interview.</li>\n<li style=\"\">All applications should submit their CV in English.</li>\n</ul>\n<p><strong>Training</strong></p>\n<ul style=\"\">\n<li style=\"\">All candidates whether full or part time will complete a mandatory online paid familiarisation course to ensure you have the necessary skills and knowledge to do your role, running Monday to Friday 0900-1730 UK. Thereafter you will work on your given shift pattern and have access to continued support. All working hours are UK based.</li>\n</ul>\n<p><strong>Benefits</strong></p>\n<p> </p>\n<ul style=\"\">\n<li style=\"\">You will be working for the pre-eminent global provider of specialist services to the games industry and provided with full training and the opportunity to work on some of the biggest game clients, titles, projects, and tech in the world.</li>\n<li style=\"\">Attractive remuneration, holidays, regular team competitions with great prizes; and inclusion into an extensive social calendar. Our environments thrive with collaborative team-work with people from all around the world, different nationalities, and languages.</li>\n<li style=\"\">A supportive community inclusive of LGBTQ+, and any age, ethnicity, religion, or disability. We care about the wellbeing of our employees and have a dedicated employee wellbeing programme. We empower our people and offer regular progression opportunities to ensure our employees flourish.</li>\n<li style=\"\">Remote/Homeworking with flexible working schedules, a fun environment, and a relaxing culture, including the opportunity to work with the leading technology and creative minds in the world.</li>\n<li style=\"\">Learn as you work and be part of something real that changes the face of gaming - forever</li>\n<li style=\"\">Working with a global multi-lingual workforce with superb training and promotion and progression opportunities.</li>\n</ul>\n<p><strong>Who we are</strong></p>\n<p>PTW is a boutique games services company that provides custom solutions worldwide. We believe in accelerating innovation across the globe. We started more than 25 years ago and since then, have grown exponentially year-on-year to who we are today. Our history is in gaming, and we are still gamers at heart. In our time within the games industry, we have worked on over 1,500 titles across all genres and all platforms.</p>\n<p>We have grown rapidly over the past few years and now have 16 sites spanning the globe. The PTW umbrella of companies includes SIDE, 1518, OR Esports, and Entalize. SIDE works at the cutting edge of interactive media as a provider of audio services for the global entertainment market. 1518 is known industry wide for world-class art and is also our in-house game and product development studio.</p>\n<p>Basically, anywhere in the world, any platform, any genre, we can help come up with a custom solution to make games run better, get to market faster, and enhance the lives of more players.</p>\n<p>In summary, we connect and bring fun to the world.</p>\n<p><strong>Welcome to PTW!</strong></p>\n<p><br><br></p>\n<div class=\"h2\">About the company</div>\n<p> </p>\n<p><img alt=\"\"><img alt=\"\">Established in 1994, we have over 20 years of experience in providing Quality Assurance, Engineering, Voice &amp; Audio Production, Localization, Translation, and Customer Support services. Our linguistic services cover over 40 of the world’s languages.</p>\n<p>Originally founded in Japan, we’ve expanded throughout the world and our global footprint now consists of over 35+ studios spanning 11 countries on 3 continents. With our corporate headquarters in San Francisco, USA, and Nagoya, Japan, we have studios in the UK, US, Canada, Romania, Japan, India, Korea, China, Taiwan, Malaysia, and Singapore.</p>\n<p>Our people make our company special. We’re brilliant, because our people shine. We’re passionate, because our people love what they do. And we’re innovative, because our people always want to do things better. We’d love you to join us. So why not get in touch?</p>\n<p><strong>We’re people focused</strong></p>\n<p>We support our people, and create strong relationships founded on mutual respect.</p>\n<p><strong>We’re client committed</strong></p>\n<p>Our main aim is to advance our clients’ businesses, and enhance their customers’ satisfaction.</p>\n<p><strong>We’re innovative</strong></p>\n<p>We create unique solutions that are brimming with ideas, backed up by effective problem solving for even the most challenging requirements.</p>\n<p> </p>\n<p><a class=\"external\" href=\"http://www.ptw.com\" rel=\"nofollow\">http://www.ptw.com</a></p>\n<p> </p>\n<img src=\"https://remotive.com/job/track/1944001/blank.gif?source=public_api\" alt=\"\"/>","tags":"[\"technical support\"]","pubDate":"2024-10-16 01:20:53.000","link":"https://remotive.com/remote-jobs/customer-support/nightshift-spanish-player-support-advocate-1944001","savedDate":"2024-10-18 01:01:28.137","slug":"nightshift-spanish-player-support-advocate-ptw-9523"},{"id":4511818906,"title":"TECHNICAL ACCOUNT MANAGER (Work from anywhere in the world)","company":"Wishpond","image":"https://z-p3-scontent.fcmb7-1.fna.fbcdn.net/v/t39.30808-1/273499217_5218973671480777_3308731762242867065_n.jpg?stp=dst-jpg_p480x480&_nc_cat=110&ccb=1-7&_nc_sid=f4b9fd&_nc_ohc=3DMJ3XqIYG0Q7kNvgGKFDdD&_nc_ht=z-p3-scontent.fcmb7-1.fna&oh=00_AYCFwVF3LAhXkdLkiRsiYs5IpriXQ9zO7QmKQWcwuQQDIQ&oe=66AAD238","description":"<div><b style=\"font-size: 18px;\">Wishpond Technologies currently has the position of&nbsp;Technical Account Manager available, and we’re excited to tell you about it !</b></div><div><span style=\"font-size: 22px;\">&nbsp;</span></div><div><b style=\"font-size: 24px;\">OVERVIEW</b></div><div><span style=\"font-size: 14px;\">As a </span>Technical Account Manager&nbsp;<b>(with fluent English skills)</b><span style=\"font-size: 14px;\">, your primary focus will be on building and optimizing AI-driven automation that enhances the efficiency and productivity of our sales team. You will also join sales calls to provide technical insight and help close deals, ensuring prospects understand the value of our solutions.&nbsp;</span></div><div><br></div><div><span style=\"font-size: 14px;\">Additionally, you will be responsible for QA, ensuring all systems and agents perform flawlessly in live environments. At Wishpond, we specialize in providing cutting-edge solutions for modern sales teams, enabling them to work smarter and close deals faster. We are seeking a </span>Technical Account Manager<span style=\"font-size: 14px;\"> with a unique blend of technical expertise and sales acumen to design and build automation. This is a new role for us, and we’re excited about it.</span></div><div><br></div><div><b style=\"font-size: 24px;\">RESPONSIBILITIES</b></div><div>• <span style=\"font-size: 14px;\">Sales Call Support: Join sales calls to provide technical expertise, address customer concerns, and help close deals by demonstrating how chat agents and other solutions meet client needs.</span></div><div>• <span style=\"font-size: 14px;\">Quality Assurance (QA): Test and review chat agents and other sales solutions to ensure they are functioning as intended, troubleshooting any issues and implementing necessary fixes.</span></div><div>• <span style=\"font-size: 14px;\">Solution Customization: Work with sales agents and clients to customize chat agent behavior and responses to align with specific customer workflows and business objectives.</span></div><div>• <span style=\"font-size: 14px;\">Sales Enablement: Collaborate with the sales team to ensure they understand how to effectively use the chat agents you develop, providing training and technical support as needed.</span></div><div>• <span style=\"font-size: 14px;\">Client Engagement: Act as a point of contact for technical questions during client meetings, presenting solutions that are tailored to customer requirements.</span></div><div>• <span style=\"font-size: 14px;\">Feedback Loop: Collect feedback from both sales teams and clients to continuously improve chat agents and other sales technologies.</span></div><div>• <span style=\"font-size: 14px;\">Documentation: Create clear and comprehensive documentation for chat agents, including their setup, capabilities, and any troubleshooting guides.</span></div><div>• Other duties as assigned</div><div><br></div><div><b style=\"font-size: 24px;\">QUALIFICATIONS</b></div><div>• <span style=\"font-size: 14px;\">Bachelor’s Degree in Engineering, Information Technology, Computer Science, or related fields (or equivalent experience)</span></div><div>• <span style=\"font-size: 14px;\">Strong communication skills, capable of presenting technical information on sales calls in a clear and compelling manner</span></div><div>• <span style=\"font-size: 14px;\">Experience in Quality Assurance (QA) testing and troubleshooting, ensuring reliable performance in real-world settings</span></div><div>• <span style=\"font-size: 14px;\">Experience working with sales teams in a fast-paced, tech-driven environment.</span></div><div>• <span style=\"font-size: 14px;\">Familiarity with customer service automation and its application in sales processes.</span></div><div>• <span style=\"font-size: 14px;\">A problem-solving mindset with a focus on continuous improvement of sales and technical workflows</span></div><div>• As part of a diverse team, ability to work both independently and collaboratively&nbsp;in a fast-paced, results-oriented environment</div><div>• Organized, administratively strong,&nbsp;great time management, and have solid writing, phone, and general communication skills</div><div>• Fluent in English (spoken and written). Knowledge of a second language is considered an asset</div><div>• Willing to participate in ongoing education and training for the role</div><div><br></div><div><b style=\"font-size: 24px;\">WORK ENVIRONMENT</b></div><div>• I<span style=\"font-size: 14px;\">t is expected that the successful candidate will provide their own workstation, computer, and headset, and have a fast and reliable internet connection. This position may be required to download and utilize company software</span></div><div>• The individual must be prepared to work standard business hours based on Pacific Time Zone</div><div>• Due to the nature of this role, we may verify backgrounds including conducting employment references, criminal record, and credit checks</div><div>• Once hired, the successful candidate must provide valid government-issued photo ID, proof of SIN and proof of residential address as part of their onboarding process</div><div><br></div><div><b style=\"font-size: 24px;\">GREAT REASONS TO JOIN OUR TEAM</b></div><div>• Fully remote position allowing you to <b>work from your home anywhere in the world !</b></div><div>• Exciting and dynamic environment with a great leadership team&nbsp;</div><div>• Comprehensive training program and regular performance reviews to facilitate your success</div><div>• Competitive compensation based on experience and proven abilities</div><div>• Great referral programs with incentives and bonuses</div><div>• Unbelievable product discounts when you use our products for your own business</div><div>• A global workforce of multi-cultural and talented colleagues&nbsp;</div><div>• A close-knit operation with amazing growth opportunities for your personal development</div><div>• A high growth SaaS technology company publicly traded on the TSX Venture Exchange</div><div>• Corporate headquarters in beautiful Vancouver, British Columbia, Canada</div><div>• Access to our education credits program and so much more !</div><div><br></div><div><b style=\"font-size: 24px;\">ABOUT US</b></div><div><span style=\"font-size: 15px;\">Founded in 2009, Wishpond is a rapidly growing technology company providing digital marketing solutions targeted at small businesses.&nbsp; The cloud-based platform includes landing pages, social promotions, website pop-ups, online forms, and lead activity tracking. Wishpond has a dedicated team of professional project managers, designers, copywriters, and developers who provide marketing services tailored to our individual clients.</span></div><div><span style=\"font-size: 16px;\">&nbsp;</span></div><div><span style=\"font-size: 15px;\">Wishpond serves over 3,000 customers in various industries and sizes, from startups to large fortune 500 companies. Wishpond has a rapidly growing global headcount and continues to hire dedicated and qualified employees and contractors who have what it takes to scale a successful software company.</span></div><div><br></div><div><span style=\"font-size: 16px;\">To learn more about Wishpond Technologies, please visit our website or any of our social media platforms:</span></div><div><br></div><div><span style=\"font-size: 16px;\">• Website: </span><a rel=\"noopener noreferrer\" class=\"postings-link\" style=\"font-size: 16px;\" href=\"http://www.wishpond.com/\">www.wishpond.com</a></div><div><span style=\"font-size: 16px;\">• Glassdoor: Wishpond Technologies</span></div><div><span style=\"font-size: 16px;\">• Instagram: @wishpondofficial</span></div><div><span style=\"font-size: 16px;\">• Twitter: Wishpond</span></div><div><span style=\"font-size: 16px;\">• Youtube: Thewishpond</span></div><div><span style=\"font-size: 16px;\">• LinkedIn : Wishpond</span></div><div><br></div><div><b style=\"font-size: 24px;\">APPLICATION PROCESS</b></div><div>&nbsp;<b style=\"font-size: 16px;\">If you are interested in applying for this exciting opportunity, please provide an updated resume in English (PDF or Word formats only), quoting the position title in the subject line of your cover letter</b></div><div><span style=\"font-size: 16px;\">&nbsp;</span></div><div><span style=\"font-size: 15px;\">Wishpond Technologies is an equal opportunity employer committed to hiring a diverse workforce and sustaining an inclusive culture that does not discriminate on the basis of disability, status or any other basis protected under legislation</span></div><div><span style=\"font-size: 16px;\">&nbsp;</span></div><div><span style=\"font-size: 15px;\">We thank all applicants in advance for their interest in this position however due to the volume of applications we receive, we are unable to respond to phone, email, or agency inquiries</span></div>","tags":"[\"management\",\"engineering\"]","pubDate":"2024-10-15 20:54:11.182","link":"https://jobs.lever.co/wishpond/c9d3bb15-7d03-45c8-9eeb-6a12788dd1ba","savedDate":"2024-10-18 01:01:28.139","slug":"technical-account-manager-work-from-anywhere-in-the-world-wishpond-4685"},{"id":1302326058,"title":"Blockchain Data Engineer","company":"Scroll","image":"https://avatars.githubusercontent.com/u/87750292?s=200&v=4","description":"&lt;div class=&quot;content-intro&quot;&gt;&lt;p&gt;Scroll is a Layer 2 scaling solution for Ethereum, specifically focusing on zkRollups. Key aspects of Scroll are zkRollup technology, Scalability, Efficiency, Security, and Developer-friendly. Overall, Scroll plays a crucial role in addressing Ethereum&#39;s scalability challenges and facilitating the growth of decentralized finance (DeFi) and other blockchain-based applications by providing a scalable and efficient Layer 2 solution.&amp;nbsp;&lt;/p&gt;&lt;/div&gt;&lt;p&gt;&lt;strong&gt;About the Team&lt;/strong&gt;&lt;br&gt;&lt;br&gt;You will join a fast-paced, dynamic, and highly skilled engineering team dedicated to building one of the most cutting-edge Layer 2 solutions in the blockchain space. As a blockchain data integrations engineer, you’ll be collecting, analyzing, and building dashboards around Scroll’s on-chain data.&lt;/p&gt;\n&lt;p&gt;If you&#39;re passionate about Ethereum, excited about working with zkEVMs, and want to play a critical role in building the future of scalable blockchain infrastructure, this role is for you.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;What you’ll do:&lt;/strong&gt;&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;Manage and optimize databases to store blockchain data&lt;/li&gt;\n&lt;li&gt;Create and manage automated ETL (Extract, Transform, Load) workflows to extract and transform raw blockchain data into structured and accessible formats.&lt;/li&gt;\n&lt;li&gt;Update Scroll’s website to surface import insights gathered from blockchain data&lt;/li&gt;\n&lt;li&gt;Collaborate closely with the product and growth teams to ensure seamless integration and feature development.&lt;/li&gt;\n&lt;li&gt;Write clean, efficient, and well-documented code that follows best practices.&lt;/li&gt;\n&lt;li&gt;Debug, troubleshoot, and optimize existing code to improve performance and scalability.&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;&lt;strong&gt;Requirements:&lt;/strong&gt;&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;2+ years as a data engineer&lt;/li&gt;\n&lt;li&gt;Understanding of blockchain data structures and smart contract event data&lt;/li&gt;\n&lt;li&gt;Experience in creating and managing automated ETL (Extract, Transform, Load) workflows to extract, transform, and organize raw blockchain data into structured formats for analysis and reporting&lt;/li&gt;\n&lt;li&gt;Experience with programming languages such as Python and SQL.&lt;/li&gt;\n&lt;li&gt;Experience with cloud platforms such as AWS, Azure, or Google Cloud.&lt;/li&gt;\n&lt;li&gt;Strong understanding of JavaScript, TypeScript, and modern web development tools.&lt;/li&gt;\n&lt;li&gt;Experience with building RESTful APIs and working with databases&lt;/li&gt;\n&lt;li&gt;Ability to work independently and strong communication skills to gather requirements cross-functionally with internal and external stakeholders&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;&lt;strong&gt;Nice to haves:&lt;/strong&gt;&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;Experience working with Layer 2 solutions.&lt;/li&gt;\n&lt;li&gt;Mastered building on and with Dune&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;&amp;nbsp;&lt;/p&gt;&lt;div class=&quot;content-conclusion&quot;&gt;&lt;h3&gt;&lt;strong&gt;About You&lt;/strong&gt;&lt;/h3&gt;\n&lt;ul&gt;\n&lt;li&gt;You are a self-starter and ability to take ownership, well organised, self-disciplined and effective when working autonomously on tasks and projects;&lt;/li&gt;\n&lt;li&gt;You are responsive, collaborative and committed person with a high work ethic;&lt;/li&gt;\n&lt;li&gt;You are a high class communicator who can articulate their views succinctly on calls or asynchronously in globally distributed, remote teams;&lt;/li&gt;\n&lt;li&gt;You relish working in an agile start-up environment;&lt;/li&gt;\n&lt;li&gt;You are a great listener who understands when to listen first and engages well with colleagues;&lt;/li&gt;\n&lt;li&gt;You are a resilient, driven individual who is willing and able to continually develop and iterate to succeed;&lt;/li&gt;\n&lt;/ul&gt;\n&lt;h3&gt;&lt;strong&gt;What We Offer&lt;/strong&gt;&lt;/h3&gt;\n&lt;ul&gt;\n&lt;li&gt;A mission-led, collaborative culture&lt;/li&gt;\n&lt;li&gt;Opportunity to work with cutting edge technology and like-minded people who are contributing to the progression of Ethereum&lt;/li&gt;\n&lt;li&gt;Competitive salary package / generous paid time off / annual growth budget&lt;/li&gt;\n&lt;li&gt;100% remote from any location with flexible hours&lt;/li&gt;\n&lt;li&gt;Home office set up / co-working membership allowance&lt;/li&gt;\n&lt;li&gt;Private healthcare in selected countries&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;&lt;em&gt;Scroll is proud to be an equal opportunity workplace. We are committed to equal employment opportunities regardless of race, color, ancestry, religion, sex, national origin, sexual orientation, age, citizenship, marital status, disability, gender identity, or Veteran status. If you have a disability or special need, please let us know and we&#39;ll do our best to accommodate.&lt;/em&gt;&lt;/p&gt;\n&lt;p&gt;&amp;nbsp;&lt;/p&gt;&lt;/div&gt;","tags":"[\"javascript\",\"typescript\",\"Finance\",\"engineering\",\"database\",\"aws\"]","pubDate":"2024-10-15 09:49:07.000","link":"https://job-boards.eu.greenhouse.io/scrollio/jobs/4423871101","savedDate":"2024-10-18 01:01:28.139","slug":"blockchain-data-engineer-scroll-1154"},{"id":7974057642,"title":"Freelance Applied Linguistics Expert (AI Tutor)","company":"Mindrift","image":"https://remotive.com/job/1944202/logo","description":"<p><strong>About the Company</strong></p>\n<p>Welcome to <a href=\"https://mindrift.ai\" rel=\"nofollow\">Mindrift </a>— a space where innovation meets opportunity. We’re a pioneering platform dedicated to advancing the field of artificial intelligence through collaborative online projects. We focus on creating data for Generative AI, offering a unique chance for freelancers to contribute to AI development from anywhere, at any time - without the need to be developers.</p>\n<p>At <a href=\"https://mindrift.ai\" rel=\"nofollow\">Mindrift</a>, we believe in the power of collective intelligence to ethically shape the future of AI. Our platform allows users to dive into a variety of tasks — ranging from creating training prompts for AI models to refining AI responses for better relevance.<br><br></p>\n<p><strong>About the Role</strong></p>\n<p>Generative AI models are improving very quickly, and one of our goals is to make them capable of addressing increasingly specialized questions and achieving extremely complex reasoning skills. We are developing a dataset consisting of question-answer pairs within highly specialized domains, including linguistics. Therefore, we are looking for <strong>AI Tutors - Linguistics Experts</strong>.</p>\n<p>Your role will involve creating and refining content to ensure accuracy and relevance across a wide array of topics within applied linguistics, tradumatics, and related fields. Your contributions will help shape an AI that educates, inspires curiosity, and promotes a deeper understanding of linguistics! The main requirement for this role is to be highly specialized in the domain of Linguistics and possess strong reasoning and writing skills.</p>\n<p><br><br><strong>Requirements</strong><br><br></p>\n<ul style=\"\">\n<li style=\"\">You have a <strong>MA+ degree</strong> in Applied Linguistics, Computational Linguistics, Computer Science, Tradumatics (Translation Technologies), Communication, Translation Studies, or related fields. Professional experience in those fields is an advantage.</li>\n<li style=\"\"><strong>English C1+ / Native speaker level</strong>.</li>\n<li style=\"\">A strong passion for writing, editing, and the field of Applied Linguistics.</li>\n<li style=\"\">You are ready to learn new methods, able to switch between tasks and topics quickly and sometimes work with challenging, complex guidelines.</li>\n<li style=\"\">Our freelance role is fully remote so, you just need a laptop, internet connection, time available and enthusiasm to take on a challenge.</li>\n</ul>\n<p><br><br><strong>Benefits</strong><br><br></p>\n<ul style=\"\">\n<li style=\"\">Take part in part-time, remote, freelance projects (10 - 20 hours per week) that respect your primary professional or academic commitments.</li>\n<li style=\"\">Have a schedule that’s convenient for you.</li>\n<li style=\"\">Try your hand at an AI project and enrich your portfolio with new experiences.</li>\n<li style=\"\">Make a tangible impact on the quality of AI.</li>\n</ul>\n<img src=\"https://remotive.com/job/track/1944202/blank.gif?source=public_api\" alt=\"\"/>","tags":"[\"AI/ML\",\"linguistics\",\"editing\",\"computer science\"]","pubDate":"2024-10-15 07:17:21.000","link":"https://remotive.com/remote-jobs/software-dev/freelance-applied-linguistics-expert-ai-tutor-1944202","savedDate":"2024-10-18 01:01:28.137","slug":"freelance-applied-linguistics-expert-ai-tutor-mindrift-8006"},{"id":8065102936,"title":"Freelance Applied Linguistics Expert (AI Tutor)","company":"Mindrift","image":"https://remotive.com/job/1944195/logo","description":"<p><strong>About the Company</strong></p>\n<p>Welcome to <a href=\"https://mindrift.ai\" rel=\"nofollow\">Mindrift </a>— a space where innovation meets opportunity. We’re a pioneering platform dedicated to advancing the field of artificial intelligence through collaborative online projects. We focus on creating data for Generative AI, offering a unique chance for freelancers to contribute to AI development from anywhere, at any time - without the need to be developers.</p>\n<p>At <a href=\"https://mindrift.ai\" rel=\"nofollow\">Mindrift</a>, we believe in the power of collective intelligence to ethically shape the future of AI. Our platform allows users to dive into a variety of tasks — ranging from creating training prompts for AI models to refining AI responses for better relevance.<br><br></p>\n<p><strong>About the Role</strong></p>\n<p>Generative AI models are improving very quickly, and one of our goals is to make them capable of addressing increasingly specialized questions and achieving extremely complex reasoning skills. We are developing a dataset consisting of question-answer pairs within highly specialized domains, including linguistics. Therefore, we are looking for <strong>AI Tutors - Linguistics Experts</strong>.</p>\n<p>Your role will involve creating and refining content to ensure accuracy and relevance across a wide array of topics within applied linguistics, tradumatics, and related fields. Your contributions will help shape an AI that educates, inspires curiosity, and promotes a deeper understanding of linguistics! The main requirement for this role is to be highly specialized in the domain of Linguistics and possess strong reasoning and writing skills.</p>\n<p><br><br><strong>Requirements</strong><br><br></p>\n<ul style=\"\">\n<li style=\"\">You have a <strong>MA+ degree</strong> in Applied Linguistics, Computational Linguistics, Computer Science, Tradumatics (Translation Technologies), Communication, Translation Studies, or related fields. Professional experience in those fields is an advantage.</li>\n<li style=\"\"><strong>English C1+ / Native speaker level</strong>.</li>\n<li style=\"\">A strong passion for writing, editing, and the field of Applied Linguistics.</li>\n<li style=\"\">You are ready to learn new methods, able to switch between tasks and topics quickly and sometimes work with challenging, complex guidelines.</li>\n<li style=\"\">Our freelance role is fully remote so, you just need a laptop, internet connection, time available and enthusiasm to take on a challenge.</li>\n</ul>\n<p><br><br><strong>Benefits</strong><br><br></p>\n<ul style=\"\">\n<li style=\"\">Take part in part-time, remote, freelance projects (10 - 20 hours per week) that respect your primary professional or academic commitments.</li>\n<li style=\"\">Have a schedule that’s convenient for you.</li>\n<li style=\"\">Try your hand at an AI project and enrich your portfolio with new experiences.</li>\n<li style=\"\">Make a tangible impact on the quality of AI.</li>\n</ul>\n<img src=\"https://remotive.com/job/track/1944195/blank.gif?source=public_api\" alt=\"\"/>","tags":"[\"AI/ML\",\"linguistics\",\"editing\",\"computer science\"]","pubDate":"2024-10-15 06:38:28.000","link":"https://remotive.com/remote-jobs/all-others/freelance-applied-linguistics-expert-ai-tutor-1944195","savedDate":"2024-10-18 01:01:28.137","slug":"freelance-applied-linguistics-expert-ai-tutor-mindrift-4168"},{"id":6483184220,"title":"IT Intern for Infrastructure team (remote-only opportunity)","company":"CloudLinux","image":"https://pbs.twimg.com/profile_images/696718028084482050/ymY3OEPk_400x400.png","description":"<p></p><p>We are looking for an Intern to to become a member of the CloudLinux infrastructure team. Our team is entrusted with a wide range of responsibilities, from managing access and providing compute resources and services to everyone in the company, to developing our own infrastructure projects and automations.</p><p></p><p>This is a remote internship opportunity, allowing you to work from anywhere and have a flexible schedule. No prior work experience is required for this internship opportunity. If you are a passionate individual interested in gaining practical experience in Internal IT and contributing to meaningful projects, we would love to hear from you!</p><p></p><p>Apply now and kick-start your career with CloudLinux!</p><p></p><p>CloudLinux is a global remote-first company. We are driven by our principles: Do the right thing, \temployees first, we are remote first, and we deliver high volume, low-cost Linux infrastructure and security products that help companies to increase the efficiency of their operations. Every person on our team supports each other and does what we can to ensure we all are successful.&nbsp;</p><p></p><p>We are truly a great place to work. </p><p></p><p><strong>Key responsibilities:</strong></p><ul> <li>Assist end-users with technical issues, troubleshooting software problems, and providing timely resolutions, including remote users</li> <li>Participate in maintaining and upgrading the company's IT infrastructure</li> <li>Contribute to ongoing IT projects</li> <li>Assist with Attlassian family products administration</li> <li>Assist with VPN, domain, DNS records administration</li> </ul><h3>Requirements: </h3><ul> <li>Currently enrolled in or recently graduated from a bachelor's program in Computer Science, Information Technology, or a related field.</li> <li>Basic knowledge of Linux OS family</li> <li>Basic understanding of IT principles, including software, networking, and cybersecurity.</li> <li>Strong problem-solving skills and an eagerness to learn new technologies.</li> <li>Fluency in English and Russian.</li> <li>Strong analytical skills and attention to detail.</li> <li>Passion for technology.</li> <li>Git knowledge</li> <li>Basic scripting ability</li> </ul><h3>Benefits: </h3><ul> <li>Work on real project tasks in an Agile team</li> <li>A dedicated mentor who's always ready to answer your questions</li> <li>Flexible working hours in fully remote environment\t</li> <li>A focus on professional development;</li> <ul> <li>Training reimbursements</li> <li>Mentor programs</li> <li>Knowledge-Exchange programs</li> <li>Interesting and challenging projects</li> </ul> </ul><p>By applying for this position, you agree with Cloudlinux Privacy Policy - <a href=\"https://cloudlinux.com/privacy-policy\" rel=\"nofollow noreferrer noopener\" class=\"external\">https://cloudlinux.com/privacy-policy</a> and give us your consent to maintain and process your personal data in this respect. Please read our Privacy Policy for more information.</p>","tags":"[]","pubDate":"2024-10-15 00:00:00.000","link":"https://apply.workable.com/cloudlinux-1/j/225484F3D8","savedDate":"2024-10-18 01:01:28.139","slug":"it-intern-for-infrastructure-team-remote-only-opportunity-cloudlinux-4867"},{"id":9627311040,"title":"Customer Support Specialist","company":"Clipboardhealth","image":"https://remotive.com/job/1943962/logo","description":"<p class='\"content-intro\"'> </p>\n<div class=\"h2\"><strong>About the Role:</strong></div>\n<p>We are seeking experienced customer support specialists with a focus on providing high-quality service to <em><strong>Enterprise-level Customers (Healthcare Facilities)</strong></em>. You’ll be responsible for owning and resolving issues raised by these clients, ensuring that they receive prompt, tailored solutions that meet their specific needs.<br><br></p>\n<p><strong>Key Responsibilities:</strong></p>\n<ul style=\"\">\n<li style=\"\">Manage and resolve escalated queries from business customers via phone, chat, and email.</li>\n<li style=\"\">Collaborate with internal teams (e.g., legal, billing, operations, etc.) to solve complex customer issues and ensure timely resolution.</li>\n<li style=\"\">Ensure all customer interactions are tracked, and issues are resolved within established service-level agreements (SLAs).</li>\n<li style=\"\">Provide professional, empathetic service to enterprise clients, particularly during high-stakes situations.<br><br></li>\n</ul>\n<p><strong>Skills and Experience:</strong></p>\n<ul style=\"\">\n<li style=\"\">3-4+ years of experience providing <em><strong>specialized customer support</strong></em>, B2B preferred, ideally within a SaaS or enterprise software environment.</li>\n<li style=\"\">Proven experience <em><strong>managing escalations</strong></em> and maintaining strong relationships with business customers.</li>\n<li style=\"\">Experience working towards <em><strong>High CSAT (&gt;90%)</strong></em> and QA scores in B2B environments.</li>\n<li style=\"\">Ability to handle an average of <em><strong>30+ calls and 15+ emails daily</strong></em>, with a focus on resolution and customer satisfaction.</li>\n<li style=\"\">Familiarity with SLA management and complex customer issue resolution.<br><br></li>\n</ul>\n<p><strong>Why Work at CBH?</strong></p>\n<ul style=\"\">\n<li style=\"\">Join a fast-paced, innovative startup unicorn that is making a difference in the lives of tens of thousands of customers.</li>\n<li style=\"\">Work remotely with a diverse team from around the world.</li>\n<li style=\"\">Access opportunities for personal and professional growth, with support to develop new skills and explore different areas of the business.<br><br></li>\n</ul>\n<p><strong>System Requirements:</strong></p>\n<ul style=\"\">\n<li style=\"\">A reliable laptop/desktop (no Chromebooks or Linux OS).</li>\n<li style=\"\">Minimum 20 Mbps wired internet connection.</li>\n<li style=\"\">Wired headset.</li>\n<li style=\"\">Quiet, distraction-free working environment.</li>\n<li style=\"\">Stable power and internet connectivity.<br><br></li>\n</ul>\n<p><em>If you're excited to provide excellent customer service and thrive in a fast-paced environment, we encourage you to apply today!<br></em></p>\n<img src=\"https://remotive.com/job/track/1943962/blank.gif?source=public_api\" alt=\"\"/>","tags":"[\"saas\",\"healthcare\",\"chat\",\"startup\",\"Linux/Unix\",\"SLA\"]","pubDate":"2024-10-13 06:16:25.000","link":"https://remotive.com/remote-jobs/customer-support/customer-support-specialist-1943962","savedDate":"2024-10-18 01:01:28.137","slug":"customer-support-specialist-clipboardhealth-826"},{"id":1363285913,"title":"PR Manager, EU & CIS","company":"Airalo","image":"https://lever-client-logos.s3.us-west-2.amazonaws.com/55028a36-609c-479c-9553-d4689ff2dd8c-1669620566663.png","description":"<div><b>About Airalo</b></div><div>Alo! Airalo is the world’s first eSIM store that helps people connect in over 200+ countries and regions across the globe. We are building the next digital service that revolutionizes the telecom industry. We are a travel-tech company and an equal-opportunity environment that values and executes diversity, inclusion, and equity. Our team is spread across 50+ countries and six continents. What glues us together is our commitment to changing the way you connect<span style=\"font-size: 13.3333px\">. </span></div><div><br></div><div><b>About you</b></div><div>We hope that you care deeply about the quality of your work, the intrinsic worth of tasks, and the success of your team. You are self-disciplined and do not require micromanagement in terms of your skillset and work ethic. You do your best to flourish as an individual every day while working hard to foster a collaborative team environment. You believe in the importance of being — and staying — authentic, honest, positive, and kind. You are a good interlocutor with clear and concise communication. You are able to manage multiple projects, have an analytical mind, pay keen attention to detail, and love to get your hands dirty. You are cognizant, tolerant, and welcoming of vulnerabilities and cultural differences.</div><div><br></div><div><b>About the Role</b></div><div><b>Position</b>: Full-time / Employee</div><div><b>Location:</b>&nbsp;Remote-first </div><div><b>Benefits:</b>&nbsp;Health Insurance, work-from-anywhere stipend, annual wellness &amp; learning credits, annual all-expenses-paid company retreat in a gorgeous destination &amp; other benefits</div><div><br></div><div><span style=\"font-size: 11pt;\">Airalo is seeking a talented and highly motivated </span><b style=\"font-size: 11pt;\">PR Manager, EU &amp; CIS</b><span style=\"font-size: 11pt;\"> to join our team. You will play a crucial role in shaping the external communication strategy and driving PR efforts across the Europe &amp; CIS regions. You will collaborate closely with internal teams and PR agencies to craft compelling narratives, build brand awareness, and position Airalo as a leader in the telecom and travel-tech space.</span></div><h3>Responsibilities Include</h3><li>Work closely with our internal teams (specifically our Content team) to design and implement a comprehensive PR plan for the EU &amp; CIS regions to support Airalo’s business objectives and enhance brand visibility.</li><li>Identify top performing PR agencies to collaborate with in each EU &amp; CIS country, based on the business priorities and critical countries to prioritise. Then partner with these agencies to amplify campaigns, ensure alignment with Airalo’s messaging, optimize results and track performance.</li><li>Build and maintain strong relationships with key media outlets, journalists, and influencers across Europe &amp; CIS. Serve as the primary point of contact for media inquiries.</li><li>Craft compelling press releases, speeches, and bylined articles to effectively communicate Airalo’s mission, values, and achievements to external audiences.</li><li>Lead efforts in managing potential PR crises with a calm, strategic approach, ensuring a positive and consistent brand image.</li><li>Initially, this will be an Individual Contributor role. As we grow and scale, there will be an opportunity for you to hire, mentor and lead a growing PR team in Europe &amp; CIS, fostering a culture of collaboration, creativity, and continuous learning.</li><li>Work closely with the Marketing, Growth, and Content teams to ensure a unified and consistent message across all channels.</li><li>Leverage your in-depth knowledge of the Europe &amp; CIS markets to tailor messaging, identify local trends, and capitalize on media opportunities.</li><li>Monitor and measure the impact of PR campaigns, analyzing media coverage, sentiment, and engagement to continuously refine strategies.</li><li>Stay informed about industry trends, media shifts, and emerging PR tactics to keep Airalo’s communications fresh and relevant.</li>,<h3>Must Haves</h3><li>7-10 years of PR experience, with a proven track record in corporate communications and PR strategy for high-profile and scaling companies.</li><li>Previous PR experience with a specific focus on developing PR strategies at European level and adapting global strategies for regional audiences. A strong understanding of the Europe and CIS markets is a critical requirement for this role.&nbsp;Extensive experience collaborating with PR agencies and driving successful campaigns.</li><li>Excellent verbal and written communication skills in English; fluency in an additional European language is a plus.</li><li>Ability to manage multiple projects and deadlines in a dynamic environment.</li><li>Strong crisis communication skills and ability to navigate complex situations with professionalism.</li>,<h3>Nice to Haves</h3><li>Experience in managing, building, and mentoring PR teams.</li><li>Experience in the telecom or travel-tech industry.</li><li>Knowledge of eSIM technology and its impact on global connectivity.</li><li>Experience working with cross-functional teams in a remote-first or startup environment.</li><li>Proficiency in using media monitoring and analytics tools like Meltwater, Cision, or Brandwatch.</li><div>We sincerely thank all applicants in advance for submitting their interest in this opportunity. Airalo is an equal opportunity employer and values diversity, equity &amp; inclusion. We do not discriminate on the basis of race, religion, national origin, gender, sexual orientation, age, marital status, veteran status, or disability status. We are committed to providing reasonable accommodations upon request for individuals with disabilities throughout our job interview process.</div>","tags":"[\"management\"]","pubDate":"2024-10-10 20:05:07.364","link":"https://jobs.lever.co/airalo/90a42439-696b-4251-8a13-0d4a41beb4e2","savedDate":"2024-10-18 01:01:28.140","slug":"pr-manager-eu-cis-airalo-5717"}]