[{"id":3769940557,"title":"Event & Partner Manager","company":"Didask","image":"https://avatars.githubusercontent.com/u/14350668?s=200&v=4","description":"<p style=\"min-height:1.5em\"><em>🇫🇷 La langue de travail à Didask est l'anglais et sa maîtrise est requise pour nous rejoindre. Néanmoins, nous publions l'intégralité de nos offres d'emploi en français et en anglais. Vous pouvez retrouver toutes nos offres d'emploi sur </em><a target=\"_blank\" rel=\"noopener noreferrer nofollow\" href=\"https://jobs.ashbyhq.com/didask\"><em>cette page</em></a><em>, ainsi que plus d'informations sur Didask, notre culture et nos avantages.</em></p><p style=\"min-height:1.5em\"></p><p style=\"min-height:1.5em\"><em>🇬🇧🇺🇸 While English is our working language at Didask and proficiency is required to join us, we publish all our job openings in both English and French. You can find all our positions on </em><a target=\"_blank\" rel=\"noopener noreferrer nofollow\" href=\"https://jobs.ashbyhq.com/didask\"><em>this page</em></a><em>, along with more information about Didask, our culture and benefits.</em></p><h1><strong>Missions</strong></h1><p style=\"min-height:1.5em\">Rattaché⸱e au Directeur Marketing, votre mission sera de <strong>définir la stratégie event et partners et de la déployer </strong> afin de<strong> générer des opportunités de business pour les sales</strong>. </p><p style=\"min-height:1.5em\">Votre rôle englobe la définition de la stratégie, la création des events, la gestion des campagnes d’invitations aux events, des contenus associés et des landings pages, le suivi des leads issus des webinaires, events et actions avec nos partenaires, la gestion des partenaires pour optimiser les actions conjointes.</p><p style=\"min-height:1.5em\">Ce poste requiert un fort degré d’autonomie et de responsabilité et d’être à la fois un·e stratège et un·e “doer”.</p><p style=\"min-height:1.5em\"></p><h2><strong>Vos principales responsabilités seront :</strong></h2><p style=\"min-height:1.5em\"><strong>Orchestrer les événements &amp; webinaires</strong></p><ul style=\"min-height:1.5em\"><li><p style=\"min-height:1.5em\">Concevoir et piloter une <strong>stratégie événementielle</strong> alignée avec les objectifs de notoriété et de génération de leads.</p></li><li><p style=\"min-height:1.5em\">Gérer l’ensemble du cycle des webinaires et événements : <strong>définition des sujets, coordination des intervenants (clients, partenaires, experts internes), logistique, communication, suivi post-événement</strong>.</p></li><li><p style=\"min-height:1.5em\">Collaborer avec des experts internes, clients et partenaires afin de produire des contenus événementiels de qualité permettant de generer de l’engagement et des opportunités business.</p></li><li><p style=\"min-height:1.5em\">Assurer une <strong>expérience impactante</strong> tout au long du funnel (promo, lp, event, follow up leads) pour maximiser l’engagement et la conversion.</p></li></ul><p style=\"min-height:1.5em\"><strong>Développer et activer les partenariats</strong></p><ul style=\"min-height:1.5em\"><li><p style=\"min-height:1.5em\">Identifier et activer des <strong>partenariats stratégiques</strong> (LMS, HR Tech, organismes de formation…) pour co-créer des événements à forte valeur ajoutée et élargir notre audience.</p></li><li><p style=\"min-height:1.5em\">Mesurer et optimiser la <strong>performance des initiatives partenariales</strong>.</p></li></ul><p style=\"min-height:1.5em\"><strong>Optimiser l’impact et scaler les actions</strong></p><ul style=\"min-height:1.5em\"><li><p style=\"min-height:1.5em\">Renforcer et AB tester les actions de promotion et partenariats pour <strong>optimiser le volume d’inscrits et de participants</strong> aux webinaires et events.</p></li><li><p style=\"min-height:1.5em\">Mettre en place des <strong>process &amp; outils</strong> pour industrialiser et optimiser la production des webinaires et événements.</p></li><li><p style=\"min-height:1.5em\">Définir et suivre des <strong>KPIs précis</strong> (participation, engagement, leads générés, conversion en opportunités…).</p></li><li><p style=\"min-height:1.5em\">Transformer les événements en <strong>leviers de contenu</strong> (replays, articles, cas clients, snippets vidéo…).</p></li></ul><p style=\"min-height:1.5em\"></p><h1><strong>Profil recherché</strong></h1><p style=\"min-height:1.5em\">Nous recherchons un·e candidat·e très autonome, à la fois stratège et “doer”, orienté·e business et data-driven, avec une forte expertise en payant.</p><ul style=\"min-height:1.5em\"><li><p style=\"min-height:1.5em\"><strong>Expérience senior (4-5 ans)</strong> en gestion d’événements B2B, marketing de partenariat ou lead generation.</p></li><li><p style=\"min-height:1.5em\">Excellentes <strong>compétences en storytelling</strong> : savoir captiver une audience et valoriser nos sujets stratégiques.</p></li><li><p style=\"min-height:1.5em\">Forte capacité <strong>analytique et data-driven</strong> : mesurer l’impact et optimiser les actions en continu.</p></li><li><p style=\"min-height:1.5em\">Ultra <strong>organisé·e et structuré·e</strong> pour piloter plusieurs projets en parallèle et les scaler efficacement. </p></li><li><p style=\"min-height:1.5em\"><strong>Esprit entrepreneurial &amp; curiosité</strong> : aller au-delà du scope, proposer des formats innovants et tester de nouvelles approches.</p></li></ul><p style=\"min-height:1.5em\"></p><h1><strong>Pourquoi nous rejoindre ?</strong></h1><p style=\"min-height:1.5em\"></p><p style=\"min-height:1.5em\">Si vous souhaitez évoluer dans un environnement stimulant, en très forte croissance, et contribuer à la structuration et au développement de l’activité </p><ul style=\"min-height:1.5em\"><li><p style=\"min-height:1.5em\">L’opportunité de jouer un rôle clé au sein d’une start-up de taille humaine de 70 personnes, en croissance rapide, et d’y prendre des responsabilités importantes.</p></li><li><p style=\"min-height:1.5em\">Évoluer au sein d’une équipe de passionné·e·s, soudée et bienveillante.</p></li><li><p style=\"min-height:1.5em\">Une organisation horizontale basée sur la confiance, la transparence et la responsabilisation, avec un véritable <em>ownership</em> distribué entre tous les collaborateurs.</p></li><li><p style=\"min-height:1.5em\">Un mode de fonctionnement où les réunions sont réduites au maximum, les échanges et décisions étant réalisés par écrit de manière transparente.</p></li><li><p style=\"min-height:1.5em\">Une flexibilité totale en télétravail et/ou un cadre de travail magnifique entre une maison avec jardin en proche banlieue parisienne.</p></li><li><p style=\"min-height:1.5em\">Œuvrer pour un projet d’utilité sociale forte : permettre à tout le monde de bien transmettre et bien apprendre.</p></li><li><p style=\"min-height:1.5em\">Rejoindre une entreprise de la Tech avec une solution hyper innovante qui a un temps d’avance sur son marché </p><p style=\"min-height:1.5em\"></p></li></ul><h1><strong>Déroulé</strong></h1><ul style=\"min-height:1.5em\"><li><p style=\"min-height:1.5em\">Une visio pour se rencontrer (1h)</p></li><li><p style=\"min-height:1.5em\">Un business case </p></li><li><p style=\"min-height:1.5em\">Une seconde visio pour échanger sur votre business case (1h30)</p></li></ul><p style=\"min-height:1.5em\"></p><h1><strong>Informations complémentaires</strong></h1><ul style=\"min-height:1.5em\"><li><p style=\"min-height:1.5em\">Type de contrat : CDI</p></li><li><p style=\"min-height:1.5em\">Rémunération indicative : 50-65 k€ composé de 80% de fixe + 20% variable </p></li><li><p style=\"min-height:1.5em\">Bureau : Paris / Bagnolet, à 8 minutes à pieds de la station Gallieni (Metro ligne 3)</p></li><li><p style=\"min-height:1.5em\">Télétravail autorisé à 100%</p></li><li><p style=\"min-height:1.5em\">Mutuelle Sidecare prise en charge à 100% (employé·e &amp; enfants)</p></li><li><p style=\"min-height:1.5em\">Carte de transport prise en charge 50%</p></li><li><p style=\"min-height:1.5em\">Carte Restaurant Swile - 9,25€ par jour dont 5,55€ pris en charge par l’employeur</p></li><li><p style=\"min-height:1.5em\">Budget matériel télétravail </p></li><li><p style=\"min-height:1.5em\">Disponibilité : Dès que possible</p></li></ul><p style=\"min-height:1.5em\"><em>🇫🇷 Sauf mention contraire, toutes nos offres sont accessibles en télétravail complet à condition de travailler dans un fuseau horaire proche de celui de Paris et de disposer des bonnes conditions de travail (notamment connexion Internet). Attention, nous ne pouvons à l'heure actuelle embaucher que des résidents fiscaux français.</em></p><p style=\"min-height:1.5em\"><em>🇬🇧🇺🇸 Unless specified otherwise, all positions are fully remote, provided you work in a timezone close to Paris and have suitable working conditions (including Internet connection). Please note that we can currently only hire French tax residents.</em></p>","tags":"[\"b2b\"]","pubDate":"2025-02-13T11:36:11.856Z","link":"https://jobs.ashbyhq.com/didask/b6820157-2371-4010-b632-958833b7ae6f","slug":"event-partner-manager-didask-3020"},{"id":2095326667,"title":"AI Creative Engineer","company":"Ruby Labs","image":"https://media.licdn.com/dms/image/v2/D4D0BAQF7VVv61POIFw/company-logo_200_200/company-logo_200_200/0/1721937953426?e=1743033600&v=beta&t=_qAkZ_qGO7Du2NSUdHDNbUKIbz28Y1HDm1g9mwNIOnk","description":"<h1><strong>About us</strong></h1><p style=\"min-height:1.5em\">Ruby Labs is a leading tech company that creates and operates innovative consumer products. We offer a diverse range of opportunities across the health, education, and entertainment industries. Our innovative teams are driving the future of consumer-led products, and we're always looking for passionate individuals to join us. Learn more about our story at: <a target=\"_blank\" rel=\"noopener noreferrer nofollow\" href=\"https://rubylabs.com/about-us/\">https://rubylabs.com/about-us/</a></p><p style=\"min-height:1.5em\"></p><h1><strong>About the role</strong></h1><p style=\"min-height:1.5em\">We are seeking an experienced and talented AI Prompt Engineer to join our Ad Labs team at Ruby Labs. This full-time role is crucial for scaling our ad production using AI tools for video and image generation. You will report directly to the Ad Creative Director and collaborate closely with our creative and technical teams to develop innovative advertising creatives.</p><p style=\"min-height:1.5em\"></p><h1><strong>Key Responsibilities</strong></h1><ul style=\"min-height:1.5em\"><li><p style=\"min-height:1.5em\"><strong>AI Creative Leadership:</strong> Oversee the use of AI tools to produce ad creatives (static images and videos), enhancing scalability and efficiency. Lead the entire AI-generated creative process from concept to execution.</p></li><li><p style=\"min-height:1.5em\"><strong>Strategic Collaboration:</strong> Partner with the Ad Creative Director and creative teams to transform advertising concepts into high-quality, ready-to-launch AI-generated visuals and videos.</p></li><li><p style=\"min-height:1.5em\"><strong>Innovative Development:</strong> Remain at the cutting edge of AI technology, proactively exploring and integrating new tools and methods to elevate ad quality and streamline production processes.</p></li><li><p style=\"min-height:1.5em\"><strong>Performance Optimization:</strong> Continuously monitor and analyze the effectiveness of AI-generated ads, utilizing performance data to drive creative improvements and report on outcomes.</p></li></ul><p style=\"min-height:1.5em\"></p><h1><strong>Qualifications</strong></h1><ul style=\"min-height:1.5em\"><li><p style=\"min-height:1.5em\"><strong>Experience:</strong> At least 1 year of experience in an AI-focused role, bonus points if it is within the advertising or creative industry.</p></li><li><p style=\"min-height:1.5em\"><strong>Technical Skills:</strong> Proficient with AI content generation tools like Sora AI, Midjourney, Runway, Arcads, ElevenLabs, Pika AI, ChatGPT, among others. Strong understanding of the advertising production process.</p></li><li><p style=\"min-height:1.5em\"><strong>Education:</strong> Bachelor's degree in Computer Science, AI, Marketing, or related field preferred.</p></li><li><p style=\"min-height:1.5em\"><strong>Portfolio:</strong> Must submit a portfolio showcasing past projects with AI tools, ideally related to advertising.</p></li></ul><p style=\"min-height:1.5em\"></p><h1><strong>Location</strong></h1><p style=\"min-height:1.5em\">Ruby Labs operates within the CET (Central European Time) zone. Applicants from any country are welcome to apply for the position as long as they are located within approximately ± 4 hours of CET. This ensures optimal collaboration and communication during working hours.</p><p style=\"min-height:1.5em\"></p><h1><strong>Benefits</strong></h1><p style=\"min-height:1.5em\">Discover the perks of being part of our vibrant team! We offer:</p><ul style=\"min-height:1.5em\"><li><p style=\"min-height:1.5em\"><strong>Remote Work Environment:</strong> Embrace the freedom to work from anywhere, anytime, promoting a healthy work-life balance. 🏡⏰</p></li><li><p style=\"min-height:1.5em\"><strong>Unlimited PTO:</strong> Enjoy unlimited paid time off to recharge and prioritize your well-being, without counting days. 🌴💼</p></li><li><p style=\"min-height:1.5em\"><strong>Paid National Holidays:</strong> Celebrate and relax on national holidays with paid time off to unwind and recharge. 🎉🌟</p></li><li><p style=\"min-height:1.5em\"><strong>Company-provided MacBook:</strong> Experience seamless productivity with top-notch Apple MacBooks provided to all employees who need them. 💻🚀</p></li><li><p style=\"min-height:1.5em\"><strong>Flexible Independent Contractor Agreement:</strong> Unlock the benefits of flexibility, autonomy, and entrepreneurial opportunities. Benefit from tax advantages, networking opportunities, reduced employment obligations, and the freedom to work from anywhere. Read more about it here: <a target=\"_blank\" rel=\"noopener noreferrer nofollow\" href=\"https://docs.google.com/document/d/1dHF4ctKlez75whdn-ybUwP5d5Wr0BdwVrorrm_fM40Q/preview\">https://docs.google.com/document/d/1dHF4ctKlez75whdn-ybUwP5d5Wr0BdwVrorrm_fM40Q/preview</a> 📈💼</p></li></ul><p style=\"min-height:1.5em\">Be part of our fast-growing team and seize this excellent opportunity for personal and professional growth!</p><p style=\"min-height:1.5em\"></p><h1><strong>Interview Process</strong></h1><ul style=\"min-height:1.5em\"><li><p style=\"min-height:1.5em\"><strong>Application Submission:</strong> Provide your CV along with a portfolio showcasing a variety of AI-generated projects.</p></li><li><p style=\"min-height:1.5em\"><strong>Recruiter Screening (30 minutes):</strong> Discuss your background, experience, and fit for the role.</p></li><li><p style=\"min-height:1.5em\"><strong>Task Assignment:</strong> Demonstrate your skills with AI tools through a practical task related to ad production.</p></li><li><p style=\"min-height:1.5em\"><strong>Final Interview (60 minutes):</strong> Meet with the Ad Creative Director and CEO to discuss your vision for the role and potential impact at Ruby Labs.</p></li></ul><p style=\"min-height:1.5em\"></p><h1><strong>Life at Ruby Labs</strong></h1><p style=\"min-height:1.5em\">At Ruby Labs, we are more than a team; we're a community united in pushing the boundaries of technology and innovation. Our combined passion fuels our ambition for excellence, driving impact that resonates around the globe.</p><p style=\"min-height:1.5em\">We are an equal-opportunity employer and celebrate diversity, recognizing that a diversity of thought and backgrounds builds stronger teams. We approach diversity and inclusion seriously and thoughtfully. We do not discriminate based on race, ethnicity, religion, color, place of birth, sex, gender identity or expression, sexual orientation, age, marital status, military service status, or disability status. Join us and be part of a company that is crafting the future of technology across multiple industries.</p><p style=\"min-height:1.5em\"></p><p style=\"min-height:1.5em\">#Li-Remote</p>","tags":"[]","pubDate":"2025-02-13T10:31:10.604Z","link":"https://jobs.ashbyhq.com/ruby-labs/bf53baf2-5582-453d-baa8-5aa6be83998a","slug":"ai-creative-engineer-ruby-labs-8466"},{"id":6059881527,"title":"Senior Golang  Backend Engineer","company":"Ruby Labs","image":"https://media.licdn.com/dms/image/v2/D4D0BAQF7VVv61POIFw/company-logo_200_200/company-logo_200_200/0/1721937953426?e=1743033600&v=beta&t=_qAkZ_qGO7Du2NSUdHDNbUKIbz28Y1HDm1g9mwNIOnk","description":"<h1><strong>About us</strong></h1><p style=\"min-height:1.5em\">Ruby Labs is a leading tech company that creates and operates innovative consumer products. We offer a diverse range of opportunities across the health, education, and entertainment industries. Our innovative teams are driving the future of consumer-led products, and we're always looking for passionate individuals to join us. Learn more about our story at:<a target=\"_blank\" rel=\"noopener noreferrer nofollow\" href=\"https://rubylabs.com/about-us/\"><u>https://rubylabs.com/about-us/</u></a></p><p style=\"min-height:1.5em\"></p><h1><strong>About the role</strong></h1><p style=\"min-height:1.5em\">Ruby Labs is looking for a Senior Backend Engineer - Golang &amp; Billing Systems who will be responsible for building scalable and high-performing backend services. You will develop, test, maintain, and improve our billing system. As a part of a cross-functional team, including engineers and product managers, you will focus on delivering results in a consistent and sustainable way. The successful candidate will have a passion for innovation, stay up-to-date with emerging technologies, and possess excellent communication and collaboration skills to work effectively in a remote environment.</p><p style=\"min-height:1.5em\"></p><h1><strong>Key Responsibilities</strong></h1><ul style=\"min-height:1.5em\"><li><p style=\"min-height:1.5em\">Participate in the solution development and maintenance of high-performance backend services and applications using Golang.</p></li><li><p style=\"min-height:1.5em\">Architect, implement, and optimize microservices-based applications, ensuring scalability, reliability, and maintainability.</p></li><li><p style=\"min-height:1.5em\">Collaborate with the DevOps team to deploy and manage Golang applications in Kubernetes clusters using Helm for efficient package management.</p></li><li><p style=\"min-height:1.5em\">Design and optimize database schemas, queries, and transactions, specifically using Postgres. Ensure data integrity, performance, and scalability. Additionally, use Redis to improve application performance.</p></li><li><p style=\"min-height:1.5em\">Develop and enhance the billing system to ensure accurate and timely processing of financial transactions.</p></li><li><p style=\"min-height:1.5em\">Conduct code reviews to ensure code quality, best practices, and adherence to coding standards.</p></li><li><p style=\"min-height:1.5em\">Collaborate within the cross-functional team, including DevOps, backend and frontend developers, QA, and product management, to understand requirements and deliver high-quality software solutions.</p></li><li><p style=\"min-height:1.5em\">Maintain comprehensive documentation for code, architecture, and processes to facilitate knowledge transfer and onboarding of team members.</p></li><li><p style=\"min-height:1.5em\">Ensure adequate unit test coverage of the applications and participate in keeping the autotest suite up-to-date.</p></li></ul><p style=\"min-height:1.5em\"></p><h1><strong>Qualifications</strong></h1><ul style=\"min-height:1.5em\"><li><p style=\"min-height:1.5em\">Minimum of 4 years of professional experience in development and at least 2 years as a Golang developer, with a proven track record of delivering scalable and robust solutions.</p></li><li><p style=\"min-height:1.5em\">Expertise in Golang, with a deep understanding of its concurrency model, frameworks, and best practices.</p></li><li><p style=\"min-height:1.5em\">Strong experience in designing, developing, and maintaining microservices architectures.</p></li><li><p style=\"min-height:1.5em\">Hands-on experience with Kubernetes and Helm for deploying and managing containerized applications.</p></li><li><p style=\"min-height:1.5em\">Proficient in designing and optimizing databases, particularly with Postgres.</p></li><li><p style=\"min-height:1.5em\">Excellent communication skills and the ability to work collaboratively in a team environment.</p></li><li><p style=\"min-height:1.5em\">Strong problem-solving skills and the ability to think critically about complex technical challenges.</p></li></ul><p style=\"min-height:1.5em\"></p><h1><strong>Nice to have</strong></h1><ul style=\"min-height:1.5em\"><li><p style=\"min-height:1.5em\">Previous involvement in the development and maintenance of billing systems.</p></li><li><p style=\"min-height:1.5em\">Experience using GCP services.</p></li><li><p style=\"min-height:1.5em\">Experience using NoSQL databases.</p></li></ul><p style=\"min-height:1.5em\"></p><h1><strong>Location</strong></h1><p style=\"min-height:1.5em\">Ruby Labs operates within the CET (Central European Time) zone. Applicants from any country are welcome to apply for the position as long as they are located within approximately ± 4 hours of CET. This ensures optimal collaboration and communication during working hours.</p><p style=\"min-height:1.5em\"></p><h1><strong>Benefits</strong></h1><p style=\"min-height:1.5em\">Discover the perks of being part of our vibrant team! We offer:</p><ul style=\"min-height:1.5em\"><li><p style=\"min-height:1.5em\"><strong>Remote Work Environment</strong>: Embrace the freedom to work from anywhere, anytime, promoting a healthy work-life balance. 🏡⏰</p></li><li><p style=\"min-height:1.5em\"><strong>Unlimited PTO</strong>: Enjoy unlimited paid time off to recharge and prioritize your well-being, without counting days. 🌴💼</p></li><li><p style=\"min-height:1.5em\"><strong>Paid National Holidays</strong>: Celebrate and relax on national holidays with paid time off to unwind and recharge. 🎉🌟</p></li><li><p style=\"min-height:1.5em\"><strong>Company-provided MacBook</strong>: Experience seamless productivity with top-notch Apple MacBooks provided to all employees who need them. 💻🚀</p></li><li><p style=\"min-height:1.5em\"><strong>Flexible Independent Contractor Agreement</strong>: Unlock the benefits of flexibility, autonomy, and entrepreneurial opportunities. Benefit from tax advantages, networking opportunities, reduced employment obligations, and the freedom to work from anywhere. Read more about it here: <a target=\"_blank\" rel=\"noopener noreferrer nofollow\" href=\"https://wiki.rubylabs.com/s/b11227c3-fa74-4c39-bd1d-3e59056a2cf4\">https://wiki.rubylabs.com/s/b11227c3-fa74-4c39-bd1d-3e59056a2cf4</a> 📈💼</p></li></ul><p style=\"min-height:1.5em\">Be part of our fast-growing team and seize this excellent opportunity for personal and professional growth!</p><p style=\"min-height:1.5em\"></p><h1><strong>Interview Process</strong></h1><p style=\"min-height:1.5em\">After submitting your application, we conduct a thorough review which typically takes 3 to 5 days, but may occasionally take longer due to the volume of applications received. If we see a potential fit, we proceed with the following steps:</p><ul style=\"min-height:1.5em\"><li><p style=\"min-height:1.5em\">Recruiter Screening (30 minutes)</p></li><li><p style=\"min-height:1.5em\">Logical Thinking Assessment (40 minutes)</p></li><li><p style=\"min-height:1.5em\">Technical Interview (60-90 minutes)</p></li><li><p style=\"min-height:1.5em\">Final Interview (30 minutes)</p></li></ul><p style=\"min-height:1.5em\"></p><h1><strong>Life at Ruby Labs</strong></h1><p style=\"min-height:1.5em\">At Ruby Labs, we are more than a team; we're a community united in pushing the boundaries of technology and innovation. Our combined passion fuels our ambition for excellence, driving impact that resonates around the globe.</p><p style=\"min-height:1.5em\">We are an equal opportunity employer and celebrate diversity, recognizing that a diversity of thought and backgrounds builds stronger teams. We approach diversity and inclusion seriously and thoughtfully. We do not discriminate based on race, ethnicity, religion, color, place of birth, sex, gender identity or expression, sexual orientation, age, marital status, military service status, or disability status. Join us and be part of a company that is crafting the future of technology across multiple industries.</p><p style=\"min-height:1.5em\"></p><p style=\"min-height:1.5em\">#Li-Remote</p>","tags":"[\"postgres\",\"management\",\"database\"]","pubDate":"2025-02-13T09:33:02.998Z","link":"https://jobs.ashbyhq.com/ruby-labs/b2fefdc0-33c9-4613-8da8-c7287d544774","slug":"senior-golang-backend-engineer-ruby-labs-8898"},{"id":5671032639,"title":"Senior Golang Developer ","company":"Ruby Labs","image":"https://media.licdn.com/dms/image/v2/D4D0BAQF7VVv61POIFw/company-logo_200_200/company-logo_200_200/0/1721937953426?e=1743033600&v=beta&t=_qAkZ_qGO7Du2NSUdHDNbUKIbz28Y1HDm1g9mwNIOnk","description":"<h1><strong>About us</strong></h1><p style=\"min-height:1.5em\">Ruby Labs is a leading tech company that creates and operates innovative consumer products. We offer a diverse range of opportunities across the health, education, and entertainment industries. Our innovative teams are driving the future of consumer-led products, and we're always looking for passionate individuals to join us. Learn more about our story at:<a target=\"_blank\" rel=\"noopener noreferrer nofollow\" href=\"https://rubylabs.com/about-us/\"><u>https://rubylabs.com/about-us/</u></a></p><p style=\"min-height:1.5em\"></p><h1><strong>About the role</strong></h1><p style=\"min-height:1.5em\">Ruby Labs is looking for a Senior Backend Engineer - Golang &amp; Billing Systems who will be responsible for building scalable and high-performing backend services. You will develop, test, maintain, and improve our billing system. As a part of a cross-functional team, including engineers and product managers, you will focus on delivering results in a consistent and sustainable way. The successful candidate will have a passion for innovation, stay up-to-date with emerging technologies, and possess excellent communication and collaboration skills to work effectively in a remote environment.</p><p style=\"min-height:1.5em\"></p><h1><strong>Key Responsibilities</strong></h1><ul style=\"min-height:1.5em\"><li><p style=\"min-height:1.5em\">Participate in the solution development and maintenance of high-performance backend services and applications using Golang.</p></li><li><p style=\"min-height:1.5em\">Architect, implement, and optimize microservices-based applications, ensuring scalability, reliability, and maintainability.</p></li><li><p style=\"min-height:1.5em\">Collaborate with the DevOps team to deploy and manage Golang applications in Kubernetes clusters using Helm for efficient package management.</p></li><li><p style=\"min-height:1.5em\">Design and optimize database schemas, queries, and transactions, specifically using Postgres. Ensure data integrity, performance, and scalability. Additionally, use Redis to improve application performance.</p></li><li><p style=\"min-height:1.5em\">Develop and enhance the billing system to ensure accurate and timely processing of financial transactions.</p></li><li><p style=\"min-height:1.5em\">Conduct code reviews to ensure code quality, best practices, and adherence to coding standards.</p></li><li><p style=\"min-height:1.5em\">Collaborate within the cross-functional team, including DevOps, backend and frontend developers, QA, and product management, to understand requirements and deliver high-quality software solutions.</p></li><li><p style=\"min-height:1.5em\">Maintain comprehensive documentation for code, architecture, and processes to facilitate knowledge transfer and onboarding of team members.</p></li><li><p style=\"min-height:1.5em\">Ensure adequate unit test coverage of the applications and participate in keeping the autotest suite up-to-date.</p></li></ul><p style=\"min-height:1.5em\"></p><h1><strong>Qualifications</strong></h1><ul style=\"min-height:1.5em\"><li><p style=\"min-height:1.5em\">Minimum of 4 years of professional experience in development and at least 2 years as a Golang developer, with a proven track record of delivering scalable and robust solutions.</p></li><li><p style=\"min-height:1.5em\">Expertise in Golang, with a deep understanding of its concurrency model, frameworks, and best practices.</p></li><li><p style=\"min-height:1.5em\">Strong experience in designing, developing, and maintaining microservices architectures.</p></li><li><p style=\"min-height:1.5em\">Hands-on experience with Kubernetes and Helm for deploying and managing containerized applications.</p></li><li><p style=\"min-height:1.5em\">Proficient in designing and optimizing databases, particularly with Postgres.</p></li><li><p style=\"min-height:1.5em\">Excellent communication skills and the ability to work collaboratively in a team environment.</p></li><li><p style=\"min-height:1.5em\">Strong problem-solving skills and the ability to think critically about complex technical challenges.</p></li></ul><p style=\"min-height:1.5em\"></p><h1><strong>Nice to have</strong></h1><ul style=\"min-height:1.5em\"><li><p style=\"min-height:1.5em\">Previous involvement in the development and maintenance of billing systems.</p></li><li><p style=\"min-height:1.5em\">Experience using GCP services.</p></li><li><p style=\"min-height:1.5em\">Experience using NoSQL databases.</p></li></ul><p style=\"min-height:1.5em\"></p><h1><strong>Location</strong></h1><p style=\"min-height:1.5em\">Ruby Labs operates within the CET (Central European Time) zone. Applicants from any country are welcome to apply for the position as long as they are located within approximately ± 4 hours of CET. This ensures optimal collaboration and communication during working hours.</p><p style=\"min-height:1.5em\"></p><h1><strong>Benefits</strong></h1><p style=\"min-height:1.5em\">Discover the perks of being part of our vibrant team! We offer:</p><ul style=\"min-height:1.5em\"><li><p style=\"min-height:1.5em\"><strong>Remote Work Environment</strong>: Embrace the freedom to work from anywhere, anytime, promoting a healthy work-life balance. 🏡⏰</p></li><li><p style=\"min-height:1.5em\"><strong>Unlimited PTO</strong>: Enjoy unlimited paid time off to recharge and prioritize your well-being, without counting days. 🌴💼</p></li><li><p style=\"min-height:1.5em\"><strong>Paid National Holidays</strong>: Celebrate and relax on national holidays with paid time off to unwind and recharge. 🎉🌟</p></li><li><p style=\"min-height:1.5em\"><strong>Company-provided MacBook</strong>: Experience seamless productivity with top-notch Apple MacBooks provided to all employees who need them. 💻🚀</p></li><li><p style=\"min-height:1.5em\"><strong>Flexible Independent Contractor Agreement</strong>: Unlock the benefits of flexibility, autonomy, and entrepreneurial opportunities. Benefit from tax advantages, networking opportunities, reduced employment obligations, and the freedom to work from anywhere. Read more about it here: <a target=\"_blank\" rel=\"noopener noreferrer nofollow\" href=\"https://wiki.rubylabs.com/s/b11227c3-fa74-4c39-bd1d-3e59056a2cf4\">https://wiki.rubylabs.com/s/b11227c3-fa74-4c39-bd1d-3e59056a2cf4</a> 📈💼</p></li></ul><p style=\"min-height:1.5em\">Be part of our fast-growing team and seize this excellent opportunity for personal and professional growth!</p><p style=\"min-height:1.5em\"></p><h1><strong>Interview Process</strong></h1><p style=\"min-height:1.5em\">After submitting your application, we conduct a thorough review which typically takes 3 to 5 days, but may occasionally take longer due to the volume of applications received. If we see a potential fit, we proceed with the following steps:</p><ul style=\"min-height:1.5em\"><li><p style=\"min-height:1.5em\">Recruiter Screening (30 minutes)</p></li><li><p style=\"min-height:1.5em\">Logical Thinking Assessment (40 minutes)</p></li><li><p style=\"min-height:1.5em\">Technical Interview (60-90 minutes)</p></li><li><p style=\"min-height:1.5em\">Final Interview (30 minutes)</p></li></ul><p style=\"min-height:1.5em\"></p><h1><strong>Life at Ruby Labs</strong></h1><p style=\"min-height:1.5em\">At Ruby Labs, we are more than a team; we're a community united in pushing the boundaries of technology and innovation. Our combined passion fuels our ambition for excellence, driving impact that resonates around the globe.</p><p style=\"min-height:1.5em\">We are an equal opportunity employer and celebrate diversity, recognizing that a diversity of thought and backgrounds builds stronger teams. We approach diversity and inclusion seriously and thoughtfully. We do not discriminate based on race, ethnicity, religion, color, place of birth, sex, gender identity or expression, sexual orientation, age, marital status, military service status, or disability status. Join us and be part of a company that is crafting the future of technology across multiple industries.</p><p style=\"min-height:1.5em\"></p><p style=\"min-height:1.5em\">#Li-Remote</p>","tags":"[\"postgres\",\"management\",\"database\"]","pubDate":"2025-02-13T09:32:22.670Z","link":"https://jobs.ashbyhq.com/ruby-labs/a6c2a50d-32de-4c67-9a84-2c56c6bf1292","slug":"senior-golang-developer-ruby-labs-3871"},{"id":3268723621,"title":"Senior Backend Engineer - Golang & Billing Systems | Ruby Labs","company":"Ruby Labs","image":"https://media.licdn.com/dms/image/v2/D4D0BAQF7VVv61POIFw/company-logo_200_200/company-logo_200_200/0/1721937953426?e=1743033600&v=beta&t=_qAkZ_qGO7Du2NSUdHDNbUKIbz28Y1HDm1g9mwNIOnk","description":"<h1><strong>About us</strong></h1><p style=\"min-height:1.5em\">Ruby Labs is a leading tech company that creates and operates innovative consumer products. We offer a diverse range of opportunities across the health, education, and entertainment industries. Our innovative teams are driving the future of consumer-led products, and we're always looking for passionate individuals to join us. Learn more about our story at:<a target=\"_blank\" rel=\"noopener noreferrer nofollow\" href=\"https://rubylabs.com/about-us/\"><u>https://rubylabs.com/about-us/</u></a></p><p style=\"min-height:1.5em\"></p><h1><strong>About the role</strong></h1><p style=\"min-height:1.5em\">Ruby Labs is looking for a Senior Backend Engineer - Golang &amp; Billing Systems who will be responsible for building scalable and high-performing backend services. You will develop, test, maintain, and improve our billing system. As a part of a cross-functional team, including engineers and product managers, you will focus on delivering results in a consistent and sustainable way. The successful candidate will have a passion for innovation, stay up-to-date with emerging technologies, and possess excellent communication and collaboration skills to work effectively in a remote environment.</p><p style=\"min-height:1.5em\"></p><h1><strong>Key Responsibilities</strong></h1><ul style=\"min-height:1.5em\"><li><p style=\"min-height:1.5em\">Participate in the solution development and maintenance of high-performance backend services and applications using Golang.</p></li><li><p style=\"min-height:1.5em\">Architect, implement, and optimize microservices-based applications, ensuring scalability, reliability, and maintainability.</p></li><li><p style=\"min-height:1.5em\">Collaborate with the DevOps team to deploy and manage Golang applications in Kubernetes clusters using Helm for efficient package management.</p></li><li><p style=\"min-height:1.5em\">Design and optimize database schemas, queries, and transactions, specifically using Postgres. Ensure data integrity, performance, and scalability. Additionally, use Redis to improve application performance.</p></li><li><p style=\"min-height:1.5em\">Develop and enhance the billing system to ensure accurate and timely processing of financial transactions.</p></li><li><p style=\"min-height:1.5em\">Conduct code reviews to ensure code quality, best practices, and adherence to coding standards.</p></li><li><p style=\"min-height:1.5em\">Collaborate within the cross-functional team, including DevOps, backend and frontend developers, QA, and product management, to understand requirements and deliver high-quality software solutions.</p></li><li><p style=\"min-height:1.5em\">Maintain comprehensive documentation for code, architecture, and processes to facilitate knowledge transfer and onboarding of team members.</p></li><li><p style=\"min-height:1.5em\">Ensure adequate unit test coverage of the applications and participate in keeping the autotest suite up-to-date.</p></li></ul><p style=\"min-height:1.5em\"></p><h1><strong>Qualifications</strong></h1><ul style=\"min-height:1.5em\"><li><p style=\"min-height:1.5em\">Minimum of 4 years of professional experience in development and at least 2 years as a Golang developer, with a proven track record of delivering scalable and robust solutions.</p></li><li><p style=\"min-height:1.5em\">Expertise in Golang, with a deep understanding of its concurrency model, frameworks, and best practices.</p></li><li><p style=\"min-height:1.5em\">Strong experience in designing, developing, and maintaining microservices architectures.</p></li><li><p style=\"min-height:1.5em\">Hands-on experience with Kubernetes and Helm for deploying and managing containerized applications.</p></li><li><p style=\"min-height:1.5em\">Proficient in designing and optimizing databases, particularly with Postgres.</p></li><li><p style=\"min-height:1.5em\">Excellent communication skills and the ability to work collaboratively in a team environment.</p></li><li><p style=\"min-height:1.5em\">Strong problem-solving skills and the ability to think critically about complex technical challenges.</p></li></ul><p style=\"min-height:1.5em\"></p><h1><strong>Nice to have</strong></h1><ul style=\"min-height:1.5em\"><li><p style=\"min-height:1.5em\">Previous involvement in the development and maintenance of billing systems.</p></li><li><p style=\"min-height:1.5em\">Experience using GCP services.</p></li><li><p style=\"min-height:1.5em\">Experience using NoSQL databases.</p></li></ul><p style=\"min-height:1.5em\"></p><h1><strong>Location</strong></h1><p style=\"min-height:1.5em\">Ruby Labs operates within the CET (Central European Time) zone. Applicants from any country are welcome to apply for the position as long as they are located within approximately ± 4 hours of CET. This ensures optimal collaboration and communication during working hours.</p><p style=\"min-height:1.5em\"></p><h1><strong>Benefits</strong></h1><p style=\"min-height:1.5em\">Discover the perks of being part of our vibrant team! We offer:</p><ul style=\"min-height:1.5em\"><li><p style=\"min-height:1.5em\"><strong>Remote Work Environment</strong>: Embrace the freedom to work from anywhere, anytime, promoting a healthy work-life balance. 🏡⏰</p></li><li><p style=\"min-height:1.5em\"><strong>Unlimited PTO</strong>: Enjoy unlimited paid time off to recharge and prioritize your well-being, without counting days. 🌴💼</p></li><li><p style=\"min-height:1.5em\"><strong>Paid National Holidays</strong>: Celebrate and relax on national holidays with paid time off to unwind and recharge. 🎉🌟</p></li><li><p style=\"min-height:1.5em\"><strong>Company-provided MacBook</strong>: Experience seamless productivity with top-notch Apple MacBooks provided to all employees who need them. 💻🚀</p></li><li><p style=\"min-height:1.5em\"><strong>Flexible Independent Contractor Agreement</strong>: Unlock the benefits of flexibility, autonomy, and entrepreneurial opportunities. Benefit from tax advantages, networking opportunities, reduced employment obligations, and the freedom to work from anywhere. Read more about it here: <a target=\"_blank\" rel=\"noopener noreferrer nofollow\" href=\"https://wiki.rubylabs.com/s/b11227c3-fa74-4c39-bd1d-3e59056a2cf4\">https://wiki.rubylabs.com/s/b11227c3-fa74-4c39-bd1d-3e59056a2cf4</a> 📈💼</p></li></ul><p style=\"min-height:1.5em\">Be part of our fast-growing team and seize this excellent opportunity for personal and professional growth!</p><p style=\"min-height:1.5em\"></p><h1><strong>Interview Process</strong></h1><p style=\"min-height:1.5em\">After submitting your application, we conduct a thorough review which typically takes 3 to 5 days, but may occasionally take longer due to the volume of applications received. If we see a potential fit, we proceed with the following steps:</p><ul style=\"min-height:1.5em\"><li><p style=\"min-height:1.5em\">Recruiter Screening (30 minutes)</p></li><li><p style=\"min-height:1.5em\">Logical Thinking Assessment (40 minutes)</p></li><li><p style=\"min-height:1.5em\">Technical Interview (60-90 minutes)</p></li><li><p style=\"min-height:1.5em\">Final Interview (30 minutes)</p></li></ul><p style=\"min-height:1.5em\"></p><h1><strong>Life at Ruby Labs</strong></h1><p style=\"min-height:1.5em\">At Ruby Labs, we are more than a team; we're a community united in pushing the boundaries of technology and innovation. Our combined passion fuels our ambition for excellence, driving impact that resonates around the globe.</p><p style=\"min-height:1.5em\">We are an equal opportunity employer and celebrate diversity, recognizing that a diversity of thought and backgrounds builds stronger teams. We approach diversity and inclusion seriously and thoughtfully. We do not discriminate based on race, ethnicity, religion, color, place of birth, sex, gender identity or expression, sexual orientation, age, marital status, military service status, or disability status. Join us and be part of a company that is crafting the future of technology across multiple industries.</p><p style=\"min-height:1.5em\"></p><p style=\"min-height:1.5em\">#Li-Remote</p>","tags":"[\"postgres\",\"management\",\"database\"]","pubDate":"2025-02-13T09:31:33.810Z","link":"https://jobs.ashbyhq.com/ruby-labs/a8a5a525-7a82-4821-8d8d-a3136157b06f","slug":"senior-backend-engineer-golang-billing-systems-ruby-labs-ruby-labs-2387"},{"id":5409535862,"title":"Senior / Staff Site Reliability Engineer","company":"Scroll","image":"https://avatars.githubusercontent.com/u/87750292?s=200&v=4","description":"&lt;div class=&quot;content-intro&quot;&gt;&lt;p&gt;Scroll is a Layer 2 scaling solution for Ethereum, specifically focusing on zkRollups. Key aspects of Scroll are zkRollup technology, Scalability, Efficiency, Security, and Developer-friendly. Overall, Scroll plays a crucial role in addressing Ethereum&#39;s scalability challenges and facilitating the growth of decentralized finance (DeFi) and other blockchain-based applications by providing a scalable and efficient Layer 2 solution.&amp;nbsp;&lt;/p&gt;&lt;/div&gt;&lt;h2&gt;&lt;strong&gt;Position Overview&lt;/strong&gt;&lt;/h2&gt;\n&lt;p&gt;We are looking for a Senior or Staff Site Reliability Engineer to lead the design, implementation, and management of our infrastructure and development operations to ensure the best reliability, security, and scalability. You will work closely with our development team to build and maintain automated deployment pipelines, monitor and analyze system performance, and identify and resolve issues before they impact our users. You are expected to become SRE team lead after 3 month probation period.&lt;/p&gt;\n&lt;p&gt;This is a dynamic role in a fast-paced blockchain environment, ideal for someone embracing ownership and autonomy to grow with us.&lt;/p&gt;\n&lt;h2&gt;&lt;strong&gt;Responsibilities&lt;/strong&gt;&lt;/h2&gt;\n&lt;ul&gt;\n&lt;li&gt;&lt;strong&gt;Platform Engineering &amp;amp; Developer Enablement&lt;/strong&gt;\n&lt;ul&gt;\n&lt;li&gt;Design, build, and maintain internal developer tools to improve developer lifecycle, including building, testing, and deploying.&lt;/li&gt;\n&lt;li&gt;Create tools that streamline developer workflows, including monitoring, logging, and debugging utilities.&lt;/li&gt;\n&lt;/ul&gt;\n&lt;/li&gt;\n&lt;li&gt;&lt;strong&gt;Infrastructure &amp;amp; System Architecture&lt;/strong&gt;\n&lt;ul&gt;\n&lt;li&gt;Design, provision, and maintain cloud environments focused on scalability, reliability, and security.&lt;/li&gt;\n&lt;li&gt;Automate deployment and maintenance processes ensuring seamless integration and rapid iteration.&lt;/li&gt;\n&lt;/ul&gt;\n&lt;/li&gt;\n&lt;li&gt;&lt;strong&gt;Reliability, Monitoring &amp;amp; Security&lt;/strong&gt;\n&lt;ul&gt;\n&lt;li&gt;Implement observability solutions to gain actionable insights, enhance performance, and ensure high availability of blockchain services.&lt;/li&gt;\n&lt;li&gt;Work closely with the security team to harden infrastructure and mitigate potential threats.&lt;/li&gt;\n&lt;li&gt;Operate and maintain a fleet of hundreds of GPU-based zk provers. Track prover health, detect failures, and optimize performance in real time.&lt;/li&gt;\n&lt;/ul&gt;\n&lt;/li&gt;\n&lt;/ul&gt;\n&lt;h2&gt;&lt;strong&gt;Requirements&lt;/strong&gt;&lt;/h2&gt;\n&lt;ul&gt;\n&lt;li&gt;5+ years of experience as a DevOps, Infrastructure, Site Reliability or Cloud Engineer&lt;/li&gt;\n&lt;li&gt;3+ years of experience as Backend Developer&lt;/li&gt;\n&lt;li&gt;Familiarity with hybrid cloud environments (AWS, Azure, GCP,&amp;nbsp;etc.) and the ability to design, provision, and maintain them securely and efficiently.&lt;/li&gt;\n&lt;li&gt;Good at any modern programming language (Go, Rust, Python). You need to be a good programmer for custom tooling.&lt;/li&gt;\n&lt;li&gt;Linux&amp;nbsp;administration experience, from hardware optimizations to advanced OS-level configurations.&lt;/li&gt;\n&lt;li&gt;Experience working with configuration management tools like Terraform and Ansible&lt;/li&gt;\n&lt;li&gt;Experience working with containers and using them in production systems&lt;/li&gt;\n&lt;li&gt;Self-motivated individual with enthusiasm for learning and building things&lt;/li&gt;\n&lt;li&gt;Collaborative, communicative, and confident in their abilities to work well with all team members at all seniority and skill levels&lt;/li&gt;\n&lt;/ul&gt;\n&lt;h2&gt;&lt;strong&gt;Preferred Qualifications&lt;/strong&gt;&lt;/h2&gt;\n&lt;ul&gt;\n&lt;li&gt;Understand system architecture and business&lt;/li&gt;\n&lt;li&gt;Previous experience as a platform engineer&lt;/li&gt;\n&lt;li&gt;Previous experience as a tech lead&lt;/li&gt;\n&lt;li&gt;Previous experience with Kubernetes, microservices, and GitOps tooling.&lt;/li&gt;\n&lt;li&gt;Previous experience in a blockchain company&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;&lt;/p&gt;\n&lt;p&gt;&lt;/p&gt;&lt;div class=&quot;content-conclusion&quot;&gt;&lt;h4&gt;&lt;strong data-stringify-type=&quot;bold&quot;&gt;What We Offer&lt;/strong&gt;&lt;/h4&gt;\n&lt;ul class=&quot;p-rich_text_list p-rich_text_list__bullet p-rich_text_list--nested&quot; data-stringify-type=&quot;unordered-list&quot; data-list-tree=&quot;true&quot; data-indent=&quot;0&quot; data-border=&quot;0&quot;&gt;\n&lt;li data-stringify-indent=&quot;0&quot; data-stringify-border=&quot;0&quot;&gt;Mission-Driven, Collaborative, and Innovative Environment:&amp;nbsp;Join a team united by a shared vision, working with like-minded individuals and cutting-edge technology to advance Ethereum and blockchain innovation.&lt;/li&gt;\n&lt;li data-stringify-indent=&quot;0&quot; data-stringify-border=&quot;0&quot;&gt;Comprehensive Compensation and Remote Flexibility:&amp;nbsp;Benefit from a competitive salary package and generous discretionary benefits, while enjoying the remote work from anywhere with flexible hours. Additionally, receive support for your workspace with a home office setup allowance and monthly co-working membership stipend.&lt;/li&gt;\n&lt;li data-stringify-indent=&quot;0&quot; data-stringify-border=&quot;0&quot;&gt;Remote Hiring: For team members outside the US, UK, Canada, and Hong Kong, we engage under an independent consulting arrangement, offering the flexibility of payment (in Fiat, USDC, or etc).&lt;/li&gt;\n&lt;li data-stringify-indent=&quot;0&quot; data-stringify-border=&quot;0&quot;&gt;Private Healthcare Benefits:&amp;nbsp;Private healthcare benefits through the Employer of Record (EoR) are only available in the US, UK, Canada, and Hong Kong.&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;&lt;em&gt;Scroll is proud to be an equal opportunity workplace. We are committed to equal employment opportunities regardless of race, color, ancestry, religion, sex, national origin, sexual orientation, age, citizenship, marital status, disability, gender identity, or Veteran status. If you have a disability or special need, please let us know and we&#39;ll do our best to accommodate.&lt;/em&gt;&lt;/p&gt;\n&lt;p&gt;&amp;nbsp;&lt;/p&gt;&lt;/div&gt;","tags":"[\"finance\",\"management\",\"engineering\",\"aws\"]","pubDate":"2025-02-13T09:21:29.000Z","link":"https://job-boards.eu.greenhouse.io/scrollio/jobs/4535465101","slug":"senior-staff-site-reliability-engineer-scroll-866"},{"id":7881725904,"title":"Content Manager (Remote - Work from Anywhere)","company":"Xapo Bank","image":"https://avatars.githubusercontent.com/u/6930305?s=200&v=4","description":"&lt;div class=&quot;content-intro&quot;&gt;&lt;p style=&quot;text-align: left;&quot;&gt;&lt;span style=&quot;font-weight: 900;&quot;&gt;Work from anywhere, impact everywhere&amp;nbsp;&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;Diversity is at the heart of who we are at Xapo Bank. We’re a fully distributed team of over 140 Xapiens that work remotely from 40+ countries around the world.&amp;nbsp;&lt;/p&gt;\n&lt;p&gt;Our beginning: A world that enjoys economic freedom and wealth protection, no matter where you live or who is running your country. This is the dream that drove Wences Casares, our Founder and Chairman, to quietly transform the world of banking.&lt;/p&gt;\n&lt;p&gt;To achieve that, we search the world for the best people for the job. We work hard, think globally, and inspire each other to learn and grow. We are committed to changing the way things are done.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Risk is inherent in all of our business activities and managing risk well is the responsibility of every Xapien. Sound risk management enables us to serve our customers and deliver value for our shareholders, and helps make Xapo a great place to work.&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&amp;nbsp;&lt;/p&gt;\n&lt;p style=&quot;text-align: left;&quot;&gt;&lt;em&gt;&lt;span style=&quot;font-weight: 500;&quot;&gt;Although we are headquartered in Gibraltar, this is a full time, 100% remote position&amp;nbsp;&lt;br&gt;&lt;/span&gt;&lt;/em&gt;&lt;em&gt;&lt;span style=&quot;font-weight: 500;&quot;&gt;Work from anywhere!&lt;/span&gt;&lt;/em&gt;&lt;/p&gt;\n&lt;p style=&quot;text-align: left;&quot;&gt;&amp;nbsp;&lt;/p&gt;&lt;/div&gt;&lt;p&gt;&lt;strong&gt;&lt;em&gt;Position overview&lt;/em&gt;&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;The Content Manager, reporting into the VP of Marketing, will play a crucial role in developing and executing Xapo Bank’s content strategy to drive brand awareness, engagement, and ultimately, conversions.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;&lt;em&gt;Responsibilities&lt;/em&gt;&lt;/strong&gt;&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;Develop and implement a comprehensive content marketing strategy that aligns with the company’s growth objectives and brand positioning.&lt;/li&gt;\n&lt;li&gt;Lead SEO efforts to increase visibility and organic search rankings, collaborating closely with web developers.&lt;/li&gt;\n&lt;li&gt;Manage content production across various formats including blogs, white papers, video, and social media, ensuring all content is on-brand, consistent in terms of style, quality, and tone of voice, and optimized for search and user experience.&lt;/li&gt;\n&lt;li&gt;Oversee the editorial calendar and ensure content is scheduled, produced, and published in a timely manner.&lt;/li&gt;\n&lt;li&gt;Analyze content marketing data and SEO performance to continually refine strategies and tactics, maximizing effectiveness and ROI.&lt;/li&gt;\n&lt;li&gt;Own the content and design for Xapo Bank&#39;s website&lt;/li&gt;\n&lt;li&gt;Collaborate with cross-functional teams, including product, PR, and digital marketing, to create synergies and leverage content across all channels.&lt;/li&gt;\n&lt;li&gt;Lead and expand the content marketing team, nurturing talent and developing skills to meet evolving market and organizational demands.&lt;/li&gt;\n&lt;li&gt;Foster relationships with key influencers, thought leaders, and external partners to amplify outreach and content distribution efforts.&lt;/li&gt;\n&lt;li&gt;Stay current with industry trends and competitor strategies to ensure that our content is ahead of the curve.&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;&lt;strong&gt;&lt;em&gt;Skills needed&lt;/em&gt;&lt;/strong&gt;&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;At least 6 years of experience in a similar role spanning content and organic marketing&lt;/li&gt;\n&lt;li&gt;Bachelor’s degree in Marketing, Communications, Journalism, or a related field. Advanced degree preferred.&lt;/li&gt;\n&lt;li&gt;Proven experience in content marketing and SEO, with a strong track record of enhancing organic search and engagement.&lt;/li&gt;\n&lt;li&gt;Video content creation, video production and editing skills would be highly beneficial.&amp;nbsp;&lt;/li&gt;\n&lt;li&gt;Strong analytical skills with an ability to interpret data to make informed content decisions.&lt;/li&gt;\n&lt;li&gt;Exceptional writing and editing skills, with a keen understanding of what resonates with target audiences.&lt;/li&gt;\n&lt;li&gt;Experience with content management systems, SEO tools (e.g., SEMrush, Ahrefs), and analytics platforms (e.g., GA4, Search Console).&lt;/li&gt;\n&lt;li&gt;Experience having worked in the Crypto industry.&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;&lt;strong&gt;&lt;em&gt;Other requirements&lt;/em&gt;&lt;/strong&gt;&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;A dedicated workspace.&lt;/li&gt;\n&lt;li&gt;A reliable internet connection with the fastest speed possible in your area.&lt;/li&gt;\n&lt;li&gt;Devices and other essential equipment that meet minimal technical specifications.&lt;/li&gt;\n&lt;li&gt;Alignment with Our Values and the Xapo Values-Driven Leadership principles.&lt;/li&gt;\n&lt;/ul&gt;&lt;div class=&quot;content-conclusion&quot;&gt;&lt;p&gt;&lt;span style=&quot;font-size: 12pt;&quot;&gt;&lt;strong&gt;Why work for Xapo?&lt;/strong&gt;&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span style=&quot;font-weight: 500; font-size: 10pt;&quot;&gt;IMPACT GLOBALLY, WORK REMOTELY.&lt;/span&gt;&lt;/p&gt;\n&lt;ul&gt;\n&lt;li style=&quot;font-weight: 500;&quot;&gt;&lt;strong&gt;Shape the Future:&lt;/strong&gt;&lt;span style=&quot;font-weight: 500;&quot;&gt; Improve lives through cutting-edge technology, work 100% remotely from anywhere in the world.&lt;/span&gt;&lt;/li&gt;\n&lt;li style=&quot;font-weight: 500;&quot;&gt;&lt;strong&gt;Great work-life balance:&lt;/strong&gt;&lt;span style=&quot;font-weight: 500;&quot;&gt; &lt;/span&gt;&lt;span style=&quot;font-weight: 500;&quot;&gt;Build amazing things with a balance of autonomy and collaborative teamwork. Set your own work schedule and make use of a flexible PTO plan when you need to recharge.&lt;/span&gt;&lt;span style=&quot;font-weight: 500;&quot;&gt;&amp;nbsp;&lt;/span&gt;&lt;/li&gt;\n&lt;li style=&quot;font-weight: 500;&quot;&gt;&lt;strong&gt;Expect Excellence:&lt;/strong&gt;&lt;span style=&quot;font-weight: 500;&quot;&gt; Collaborate, learn, and grow with a high-performance team. Learn&lt;/span&gt;&lt;span style=&quot;font-weight: 500;&quot;&gt; how you learn best - from books to conferences, you’ll get a yearly budget for your individual learning and development goals.&lt;/span&gt;&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;&lt;strong&gt;At Xapo, we prioritize consumer protection and adhere to regulatory requirements by ensuring that all Xapiens are accountable for upholding principles of fair treatment, transparency, and ethical conduct in their interactions with customers and stakeholders.&lt;/strong&gt;&lt;/p&gt;&lt;/div&gt;","tags":"[\"management\"]","pubDate":"2025-02-13T07:31:59.000Z","link":"https://job-boards.greenhouse.io/xapo61/jobs/6341088003","slug":"content-manager-remote-work-from-anywhere-xapo-bank-8084"},{"id":8984345628,"title":"Strategy & Finance Manager, International Expansion","company":"Empower","image":"https://lever-client-logos.s3.us-west-2.amazonaws.com/2e1a369c-b58f-41ac-8d86-4b0a77695e68-1687915522032.png","description":"<p style=\"min-height:1.5em\"><strong>EMPOWER OVERVIEW</strong></p><p style=\"min-height:1.5em\"><a target=\"_blank\" rel=\"noopener noreferrer nofollow\" href=\"http://empower.me/\">Empower</a> is shaking up an outdated financial system by providing real opportunity for our customers: the opportunity to get the cash they need, to access fair credit, and to change their financial story. Today, we’re helping millions of people find financial security through machine learning models that evaluate creditworthiness using a more inclusive lens and mobile-first products: Cash Advance, Thrive line of credit, and Petal credit cards. Tomorrow? Creating even more financial paths for our customers (and their wallets) to succeed.</p><p style=\"min-height:1.5em\">This year, Empower ranked #65 on Inc. 5000’s Fastest-Growing Private Companies list — our third year in a row cracking the top 100 — and was named by Forbes as one of the 25 Next Billion-Dollar Startups for 2024. Empower was also featured by Forbes on America’s Best Startup Employers list in 2023, and our Thrive line of credit product was named by Fast Company as one of 2022’s Next Big Things in Tech.</p><p style=\"min-height:1.5em\">Empower is backed by Sequoia Capital, Blisce, and Icon Ventures. Ready to grow your impact and accelerate your career? Take a look at our open roles — we can’t wait to meet you.</p><p style=\"min-height:1.5em\"></p><p style=\"min-height:1.5em\"><strong>THE EMPOWER WAY</strong></p><p style=\"min-height:1.5em\"><strong>Great Expectations</strong>: We come up with bold, audacious goals for ourselves and go all out for impact</p><p style=\"min-height:1.5em\"><strong>Owner Mindset</strong>: We give every employee latitude to act independently, make smart choices, and move the business forward</p><p style=\"min-height:1.5em\"><strong>Spirited Debate</strong>: We love skeptics and seek counter opinions to challenge our personal assumptions and expand our view</p><p style=\"min-height:1.5em\"><strong>Customer Obsession:</strong> We listen to understand, empathize, and create a memorable, rewarding experience for our community</p><p style=\"min-height:1.5em\"><strong>Inclusive Collaboration</strong>: We believe diverse teams make the best decisions, and we strive to give diverse voices a seat at the table</p><p style=\"min-height:1.5em\"><strong>No Jerks Allowed</strong>: We value our relationships and take the time to build trust and connection and communicate respectfully</p><p style=\"min-height:1.5em\"></p><p style=\"min-height:1.5em\"><strong>WHAT EMPOWER OFFERS</strong></p><p style=\"min-height:1.5em\">Competitive salary</p><p style=\"min-height:1.5em\">Generous equity package</p><p style=\"min-height:1.5em\">Full healthcare benefits</p><p style=\"min-height:1.5em\">Technology expense reimbursement</p><p style=\"min-height:1.5em\">Virtual first environment</p><p style=\"min-height:1.5em\">Empower is looking for a Finance and Strategy Manager, International Expansion to lead our international growth efforts. In this role, you will design our strategic framework for new market entry, leading market research, business planning, and analytics workstreams to determine where and how we should expand into new geographies. You will collaborate cross-functionally with senior executives to develop and share recommendations to our board and critical stakeholders. After creating the strategy, you will then lead the execution of those recommendations, including M&amp;A &amp; on-the-ground integration and business planning. If you’re excited by the idea of leading international growth end-to-end for a high-growth startup expanding access to fair credit, this could be the role for you.</p><p style=\"min-height:1.5em\">This is a remote role with a preference for individuals in an Asia Pacific time zone (GMT +5-11). Occasional travel will be required for company onsites and market visits (minimum 4-6 times per year).</p><p style=\"min-height:1.5em\"></p><p style=\"min-height:1.5em\"><strong>RESPONSIBILITIES</strong></p><p style=\"min-height:1.5em\">Set strategic priorities: Conduct market research, competitive analysis, and data analyses to create our evaluation framework to evaluate new markets</p><p style=\"min-height:1.5em\">Conduct target scans for potential acquisition opportunities</p><p style=\"min-height:1.5em\">Lead in-depth due diligence processes for M&amp;A targets, including owning evaluations of financials, operations, talent, and legal risks</p><p style=\"min-height:1.5em\">Build forecast models to guide decision-making, collaborating across credit, product, and marketing teams to refine assumptions</p><p style=\"min-height:1.5em\">Represent Empower with senior external counterparties (e.g., regulators, investors)</p><p style=\"min-height:1.5em\">Help drive market entry strategy: Leverage customer &amp; credit data to inform product positioning and optimize our scaling efforts. Lead complex analyses on our products, develop case studies, and design experiments to improve performance.</p><p style=\"min-height:1.5em\">Establish on-ground presence, relationships, and operations in new markets</p><p style=\"min-height:1.5em\">Develop data-driven frameworks and monitor key KPIs for new markets</p><p style=\"min-height:1.5em\"></p><p style=\"min-height:1.5em\"><strong>QUALIFICATIONS</strong></p><p style=\"min-height:1.5em\">Minimum of 4+ years of work experience in management consulting, investment banking, corporate development.</p><p style=\"min-height:1.5em\">Strong strategic thinking, problem-solving, and logical structuring abilities</p><p style=\"min-height:1.5em\">A get-it-done mindset; you’re resourceful and happy to be hands-on and in the weeds</p><p style=\"min-height:1.5em\">Strong analytical abilities and are comfortable defining and measuring goals consistently</p><p style=\"min-height:1.5em\">Comfort with ambiguity; the ability to independently layout and test clear hypotheses, and solve problems without well-defined direction</p><p style=\"min-height:1.5em\">Strong financial modeling experience and ability to create data-driven decision making frameworks</p><p style=\"min-height:1.5em\">M&amp;A experience is a plus</p><p style=\"min-height:1.5em\">At Empower, we hire for people that push themselves to understand others and seek out ways to challenge their personal assumptions. Our hope is that by fostering such an environment, we strengthen our business and relationships by putting people first. We are committed to building a diverse, inclusive, and equitable workspace where everyone (regardless of age, education, ethnicity, gender, sexual orientation, or any personal characteristics) feels like they belong. Even if your experience doesn’t exactly match up to our job description, you should feel empowered to apply regardless!</p>","tags":"[\"finance\",\"management\",\"legal\"]","pubDate":"2025-02-13T03:41:42.787Z","link":"https://jobs.ashbyhq.com/empower%20finance/803ac5a9-2ba7-47bf-9db4-34ae97000ad7","slug":"strategy-finance-manager-international-expansion-empower-8186"},{"id":8775565209,"title":"Technical Recruiter - Contract ","company":"Sardine","image":"https://avatars.githubusercontent.com/u/65879301?s=200&v=4","description":"<p style=\"min-height:1.5em\"><strong>Who we are:</strong></p><p style=\"min-height:1.5em\">We are a leader in fraud prevention and AML compliance. Our platform uses device intelligence, behavior biometrics, machine learning, and AI to stop fraud before it happens. Today, over 300 banks, retailers, and fintechs worldwide use Sardine to stop identity fraud, payment fraud, account takeovers, and social engineering scams. We have raised $145M from world-class investors, including Andreessen Horowitz, Activant, Visa, Experian, FIS, and Google Ventures.</p><p style=\"min-height:1.5em\"></p><p style=\"min-height:1.5em\"><strong>Our culture:</strong></p><ul style=\"min-height:1.5em\"><li><p style=\"min-height:1.5em\">We have hubs in the Bay Area, NYC, Austin, and Toronto. However, we maintain a remote-first work culture. #WorkFromAnywhere</p></li><li><p style=\"min-height:1.5em\">We hire talented, self-motivated individuals with extreme ownership and high growth orientation. </p></li><li><p style=\"min-height:1.5em\">We value performance and not hours worked. We believe you shouldn't have to miss your family dinner, your kid's school play, friends get-together, or doctor's appointments for the sake of adhering to an arbitrary work schedule.</p></li></ul><p style=\"min-height:1.5em\"></p><p style=\"min-height:1.5em\">We’re looking for a Technical Recruiter (Contractor) to help us scale our team with world-class talent. This is more than just filling roles—you’ll be a strategic hiring partner, working closely with our engineering, product, and leadership teams to attract top-tier technical talent. If you love the challenge of building teams in a high-growth, fast-moving environment, we’d love to have you on board.</p><p style=\"min-height:1.5em\"></p><p style=\"min-height:1.5em\"><strong>What you’ll be doing </strong></p><ul style=\"min-height:1.5em\"><li><p style=\"min-height:1.5em\">Own the end-to-end recruitment process—from sourcing and engaging top talent to closing offers.</p></li><li><p style=\"min-height:1.5em\">Partner with hiring managers to understand their needs and craft hiring strategies that bring in the best talent.</p></li><li><p style=\"min-height:1.5em\">Build relationships with passive and active candidates, keeping our talent pipeline strong for both current and future roles.</p></li><li><p style=\"min-height:1.5em\">Enhance our hiring processes to be efficient, candidate-friendly, and scalable as we grow.</p></li><li><p style=\"min-height:1.5em\">Champion an exceptional candidate experience, ensuring that every interaction with Sardine reflects our values and mission.</p></li></ul><p style=\"min-height:1.5em\"></p><p style=\"min-height:1.5em\"><strong>What you’ll need</strong></p><ul style=\"min-height:1.5em\"><li><p style=\"min-height:1.5em\">4+ years of experience in technical recruiting and sourcing within high-growth environments.</p></li><li><p style=\"min-height:1.5em\">Deep understanding of technical roles, skills, and hiring best practices, ideally within fintech, AI, or security domains.</p></li><li><p style=\"min-height:1.5em\">Proven experience sourcing and engaging passive talent using creative strategies.</p></li><li><p style=\"min-height:1.5em\">Ability to use data to drive hiring decisions and improve processes.</p></li><li><p style=\"min-height:1.5em\">Experience with Ashby, LinkedIn Recruiter, and Notion is a plus!</p></li></ul><p style=\"min-height:1.5em\"></p><p style=\"min-height:1.5em\">The contract rate for this fully remote position in the US or Canada is up to $10,000/Month for 40 hours a week. This is a 3-month contract with the possibility of extension depending on business needs. </p><p style=\"min-height:1.5em\"></p><p style=\"min-height:1.5em\"><strong>Benefits we offer:</strong></p><ul style=\"min-height:1.5em\"><li><p style=\"min-height:1.5em\">Generous compensation in cash and equity</p></li><li><p style=\"min-height:1.5em\">Early exercise for all options, including pre-vested</p></li><li><p style=\"min-height:1.5em\">Work from anywhere: Remote-first Culture</p></li><li><p style=\"min-height:1.5em\">Flexible paid time off, Year-end break, Self care days off</p></li><li><p style=\"min-height:1.5em\">Health insurance, dental, and vision coverage for employees and dependents - <em>US and Canada specific</em></p></li><li><p style=\"min-height:1.5em\">4% matching in 401k / RRSP - <em>US and Canada specific</em></p></li><li><p style=\"min-height:1.5em\">MacBook Pro delivered to your door</p></li><li><p style=\"min-height:1.5em\">One-time stipend to set up a home office — desk, chair, screen, etc.</p></li><li><p style=\"min-height:1.5em\">Monthly meal stipend</p></li><li><p style=\"min-height:1.5em\">Monthly social meet-up stipend</p></li><li><p style=\"min-height:1.5em\">Annual health and wellness stipend</p></li><li><p style=\"min-height:1.5em\">Annual Learning stipend</p></li><li><p style=\"min-height:1.5em\">Unlimited access to an expert financial advisory</p></li></ul><p style=\"min-height:1.5em\"></p><p style=\"min-height:1.5em\">Join a fast-growing company with world-class professionals from around the world. If you are seeking a meaningful career, you found the right place, and we would love to hear from you.</p>","tags":"[\"engineering\"]","pubDate":"2025-02-13T02:24:13.273Z","link":"https://jobs.ashbyhq.com/sardine/337528ec-be48-437f-9d41-5b18e3e4647f","slug":"technical-recruiter-contract-sardine-6240"},{"id":1428007383,"title":"Payments Lead (Product & GTM)","company":"Sardine","image":"https://avatars.githubusercontent.com/u/65879301?s=200&v=4","description":"<p style=\"min-height:1.5em\"><strong>Who we are:</strong></p><p style=\"min-height:1.5em\">We are a leader in fraud prevention and AML compliance. Our platform uses device intelligence, behavior biometrics, machine learning, and AI to stop fraud before it happens. Today, over 300 banks, retailers, and fintechs worldwide use Sardine to stop identity fraud, payment fraud, account takeovers, and social engineering scams. We have raised $145M from world-class investors, including Andreessen Horowitz, Activant, Visa, Experian, FIS, and Google Ventures.</p><p style=\"min-height:1.5em\"></p><p style=\"min-height:1.5em\"><strong>Our culture:</strong></p><ul style=\"min-height:1.5em\"><li><p style=\"min-height:1.5em\">We have hubs in the Bay Area, NYC, Austin, and Toronto. However, we maintain a remote-first work culture. #WorkFromAnywhere</p></li><li><p style=\"min-height:1.5em\">We hire talented, self-motivated individuals with extreme ownership and high growth orientation. </p></li><li><p style=\"min-height:1.5em\">We value performance and not hours worked. We believe you shouldn't have to miss your family dinner, your kid's school play, friends get-together, or doctor's appointments for the sake of adhering to an arbitrary work schedule.</p></li></ul><p style=\"min-height:1.5em\"></p><p style=\"min-height:1.5em\"><strong>About the Role</strong></p><p style=\"min-height:1.5em\">We're looking for a Payments Lead (Product &amp; GTM) to drive the next generation of payment solutions, including crypto, NFTs, and payroll integrations. This role is ideal for a hands-on leader eager to build and scale a payments business from the ground up in a hyper-growth environment.</p><p style=\"min-height:1.5em\">As Payments Lead, you will own the end-to-end payments strategy, spanning product development, engineering, and go-to-market execution. You’ll play a pivotal role in shaping our payments ecosystem, ensuring seamless integration across products and markets.</p><p style=\"min-height:1.5em\">Reporting directly to the Co-founder &amp; COO, this role works closely with the leadership team. A high-impact, high-visibility opportunity—ideal for future entrepreneurs looking to build and scale innovative payment solutions. </p><p style=\"min-height:1.5em\"></p><p style=\"min-height:1.5em\"><strong>What you’ll be doing</strong></p><ul style=\"min-height:1.5em\"><li><p style=\"min-height:1.5em\">Defining and executing the strategy to build and scale our payments vertical from the ground up</p></li><li><p style=\"min-height:1.5em\">Leading the end-to-end product lifecycle, from ideation and market research to launch and continuous iteration</p></li><li><p style=\"min-height:1.5em\">Researching industry trends, emerging payment technologies, and best practices</p></li><li><p style=\"min-height:1.5em\">Driving the commercial strategy for new payment products to maximize growth and profitability</p></li><li><p style=\"min-height:1.5em\">Building and optimizing scalable processes to ensure efficient and compliant operations</p></li><li><p style=\"min-height:1.5em\">Managing P&amp;L, setting financial targets, and forecasting revenue to ensure sustainable growth</p></li><li><p style=\"min-height:1.5em\">Identifying, evaluating, and negotiating partnerships with banks, PSPs, card networks, and fintech partners</p></li><li><p style=\"min-height:1.5em\">Collaborating with cross-functional teams (engineering, design, compliance) to deliver high-quality payment solutions</p></li><li><p style=\"min-height:1.5em\">Scaling payment products to new markets and geographies</p></li><li><p style=\"min-height:1.5em\">Leveraging data-driven insights to optimize product performance, pricing, and user experience</p></li><li><p style=\"min-height:1.5em\">Work day to day with compliance and fraud teams </p></li><li><p style=\"min-height:1.5em\">Work with engineering and design teams </p></li></ul><p style=\"min-height:1.5em\"></p><p style=\"min-height:1.5em\"><strong>What you'll need</strong></p><ul style=\"min-height:1.5em\"><li><p style=\"min-height:1.5em\">4+ years building successful payment products or businesses in payments or fintech</p></li><li><p style=\"min-height:1.5em\">Deep knowledge of card networks, acquiring/issuing processes, alternative payment methods, and emerging payment technologies</p></li><li><p style=\"min-height:1.5em\">Proven ability to manage P&amp;L and deliver product and business results</p></li><li><p style=\"min-height:1.5em\">Strong ability to drive product vision, user experience, and lifecycle management, with technical fluency to collaborate effectively with engineering teams</p></li><li><p style=\"min-height:1.5em\">Proven negotiation and partnership management skills within the payments ecosystem</p></li><li><p style=\"min-height:1.5em\">A knack for breaking complex problems into smaller, manageable pieces</p></li><li><p style=\"min-height:1.5em\">Data-driven decision-making skills with a strong grasp of KPIs and financial modeling</p></li><li><p style=\"min-height:1.5em\">Natural curiosity, a passion for innovation, and a desire to make an impact</p></li><li><p style=\"min-height:1.5em\">Excellent leadership presence, communication, and collaboration skills to unite cross-functional teams</p></li></ul><p style=\"min-height:1.5em\"></p><p style=\"min-height:1.5em\"><strong>Nice to have</strong></p><ul style=\"min-height:1.5em\"><li><p style=\"min-height:1.5em\">Experience working in the crypto industry or with blockchain-based payment solutions</p></li><li><p style=\"min-height:1.5em\">Prior experience in high-growth environments such as startups, investment banking, or consulting</p></li><li><p style=\"min-height:1.5em\">Technical skills in SQL or Python for data analysis</p></li></ul><p style=\"min-height:1.5em\"></p><p style=\"min-height:1.5em\"><strong>Benefits we offer:</strong></p><ul style=\"min-height:1.5em\"><li><p style=\"min-height:1.5em\">Generous compensation in cash and equity</p></li><li><p style=\"min-height:1.5em\">Early exercise for all options, including pre-vested</p></li><li><p style=\"min-height:1.5em\">Work from anywhere: Remote-first Culture</p></li><li><p style=\"min-height:1.5em\">Flexible paid time off, Year-end break, Self care days off</p></li><li><p style=\"min-height:1.5em\">Health insurance, dental, and vision coverage for employees and dependents - <em>US and Canada specific</em></p></li><li><p style=\"min-height:1.5em\">4% matching in 401k / RRSP - <em>US and Canada specific</em></p></li><li><p style=\"min-height:1.5em\">MacBook Pro delivered to your door</p></li><li><p style=\"min-height:1.5em\">One-time stipend to set up a home office — desk, chair, screen, etc.</p></li><li><p style=\"min-height:1.5em\">Monthly meal stipend</p></li><li><p style=\"min-height:1.5em\">Monthly social meet-up stipend</p></li><li><p style=\"min-height:1.5em\">Annual health and wellness stipend</p></li><li><p style=\"min-height:1.5em\">Annual Learning stipend</p></li><li><p style=\"min-height:1.5em\">Unlimited access to an expert financial advisory</p></li></ul><p style=\"min-height:1.5em\"></p><p style=\"min-height:1.5em\">Join a fast-growing company with world-class professionals from around the world. If you are seeking a meaningful career, you found the right place, and we would love to hear from you.</p>","tags":"[\"management\",\"engineering\"]","pubDate":"2025-02-13T02:21:55.193Z","link":"https://jobs.ashbyhq.com/sardine/d08c93ea-8d42-4547-80b9-e3a59d98fc14","slug":"payments-lead-product-gtm-sardine-8744"},{"id":9551231583,"title":"Customer Success Manager","company":"Fingerprint","image":"https://avatars.githubusercontent.com/u/67208791?s=200&v=4","description":"&lt;div class=&quot;content-intro&quot;&gt;&lt;p&gt;&lt;strong&gt;Fingerprint&lt;/strong&gt;&amp;nbsp;empowers developers to stop online fraud at the source.&lt;/p&gt;\n&lt;p&gt;We work on turning radical new ideas in the fraud detection space into reality. Our products are developer-focused and our clients range from solo developers to publicly traded companies.&amp;nbsp;&lt;strong&gt;We are a globally dispersed, 100% remote company&lt;/strong&gt; with a strong open-source focus. Our flagship open-source project is &lt;a class=&quot;c-link c-link--focus-visible&quot; href=&quot;https://github.com/fingerprintjs/fingerprintjs&quot; target=&quot;_blank&quot; data-stringify-link=&quot;https://github.com/fingerprintjs/fingerprintjs&quot; data-sk=&quot;tooltip_parent&quot;&gt;FingerprintJS&lt;/a&gt; (20K stars on GitHub).&lt;/p&gt;\n&lt;p&gt;&lt;a class=&quot;c-link c-link--focus-visible&quot; href=&quot;https://www.crunchbase.com/organization/fingerprintjs&quot; target=&quot;_blank&quot; data-stringify-link=&quot;https://www.crunchbase.com/organization/fingerprintjs&quot; data-sk=&quot;tooltip_parent&quot;&gt;We have raised $77M&amp;nbsp;&lt;/a&gt;and are backed by Craft Ventures (previously invested in&amp;nbsp;&lt;a class=&quot;c-link c-link--focus-visible&quot; href=&quot;https://www.tesla.com/&quot; target=&quot;_blank&quot; data-stringify-link=&quot;https://www.tesla.com/&quot; data-sk=&quot;tooltip_parent&quot;&gt;Tesla,&amp;nbsp;&lt;/a&gt;&lt;a class=&quot;c-link c-link--focus-visible&quot; href=&quot;https://facebook.com/&quot; target=&quot;_blank&quot; data-stringify-link=&quot;https://facebook.com/&quot; data-sk=&quot;tooltip_parent&quot;&gt;Facebook,&amp;nbsp;&lt;/a&gt;&lt;a class=&quot;c-link c-link--focus-visible&quot; href=&quot;https://www.airbnb.com/&quot; target=&quot;_blank&quot; data-stringify-link=&quot;https://www.airbnb.com/&quot; data-sk=&quot;tooltip_parent&quot;&gt;Airbnb&amp;nbsp;&lt;/a&gt;), Nexus Venture Partners (previously invested in &lt;a href=&quot;https://www.postman.com/&quot;&gt;Postman&lt;/a&gt;, &lt;a href=&quot;https://www.apollo.io/&quot;&gt;Apollo.io,&lt;/a&gt; &lt;a href=&quot;https://min.io/&quot;&gt;MinIO&lt;/a&gt;, Druva)&amp;nbsp;and Uncorrelated Ventures (previously invested in&amp;nbsp;&lt;a class=&quot;c-link c-link--focus-visible&quot; href=&quot;https://redis.io/&quot; target=&quot;_blank&quot; data-stringify-link=&quot;https://redis.io/&quot; data-sk=&quot;tooltip_parent&quot;&gt;Redis,&amp;nbsp;&lt;/a&gt;&lt;a class=&quot;c-link c-link--focus-visible&quot; href=&quot;https://rollbar.com/&quot; target=&quot;_blank&quot; data-stringify-link=&quot;https://rollbar.com/&quot; data-sk=&quot;tooltip_parent&quot;&gt;Rollbar&amp;nbsp;&lt;/a&gt;&amp;amp;&lt;a class=&quot;c-link c-link--focus-visible&quot; href=&quot;https://gradle.org/&quot; target=&quot;_blank&quot; data-stringify-link=&quot;https://gradle.org/&quot; data-sk=&quot;tooltip_parent&quot;&gt;&amp;nbsp;Gradle&lt;/a&gt;).&lt;/p&gt;&lt;/div&gt;&lt;p&gt;The Customer Success Team is the trusted advisor for building relationships, driving product adoption, and empowering our customers to achieve their goals. The Customer Success Manager acts as a trusted advisor for a variety of customers who represent various industries. You will support them on their journey to successfully onboard, increase user adoption and ultimately ensure a positive renewal outcome.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;What you’ll be doing:&lt;/strong&gt;&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;Facilitate the transition out of implementation to go-live&lt;/li&gt;\n&lt;li&gt;Manage a portfolio of clients and make certain a high level of satisfaction with the product is achieved&lt;/li&gt;\n&lt;li&gt;Create a plan to ensure client success&lt;/li&gt;\n&lt;li&gt;Conduct regular meetings with clients to make recommendations on using the product and future product enhancements to provide continuous success in business processes&lt;/li&gt;\n&lt;li&gt;Provide best practice recommendations, expert-level application support and assist in solving point-in-time challenges&lt;/li&gt;\n&lt;li&gt;Work with product development and technical support to resolve customer issues/concerns&lt;/li&gt;\n&lt;li&gt;Proactively monitor the health of your client portfolio and identify/manage escalations and churn risks&lt;/li&gt;\n&lt;li&gt;Experience conducting virtual meetings with internal and external customers&lt;/li&gt;\n&lt;li&gt;Travel may be required&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;&lt;strong&gt;Who you are&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;Essential:&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;2-3 years experience in a Mid-Market/Enterprise SaaS Customer Success role&lt;/li&gt;\n&lt;li&gt;Experience with Zendesk and Salesforce are a huge plus&lt;/li&gt;\n&lt;li&gt;Based anywhere within North America&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;Nice to haves:&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;Effectively prioritizes, multitasks, and engages with customers&lt;/li&gt;\n&lt;li&gt;Effective at leading and facilitating meetings ranging from admin/owners to executive level&lt;/li&gt;\n&lt;li&gt;Strong communication skills; you pride yourself on being personable, concise and compelling communicator - in writing, in conversation and in front of an audience&lt;/li&gt;\n&lt;li&gt;Empathy, diplomacy, and poise under pressure when working through customer concerns&lt;/li&gt;\n&lt;li&gt;Put team above yourself - elevating the group&#39;s performance through proactive collaboration and knowledge-sharing&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;&lt;strong&gt;&lt;em&gt;Compensation Range&lt;/em&gt;&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;em&gt;$130k - $150k OTE For cash compensation, we set standard ranges for all &lt;/em&gt;&lt;strong&gt;&lt;em&gt;US based roles based&lt;/em&gt;&lt;/strong&gt;&lt;em&gt;&amp;nbsp;on function, level and geographic location, benchmarked against similar stage growth companies. In order to be compliant with local legislation, as well as to provide greater transparency to candidates, we share salary ranges on all job postings regardless of desired hiring location.&lt;/em&gt;&lt;strong&gt;&lt;em&gt;&amp;nbsp;Final offer amounts are determined by multiple factors including geographic location as well as candidate experience and expertise, and may vary from the amounts listed above.&lt;/em&gt;&lt;/strong&gt;&lt;/p&gt;&lt;div class=&quot;content-conclusion&quot;&gt;&lt;p&gt;Offers vary depending on, but not limited to, relevant experience, education, certifications/licenses, skills, training, and market conditions.&amp;nbsp;&lt;/p&gt;\n&lt;p&gt;Due to regulatory and security reasons, there’s a small number of countries where we cannot have Fingerprint teammates based.&amp;nbsp;&lt;strong data-stringify-type=&quot;bold&quot;&gt;Additionally, because Fingerprint is an all-remote company and people can join our workforce from almost any country, we do not sponsor visas. Fingerprint teammates need to be authorized to work from their home location&lt;/strong&gt;.&lt;/p&gt;\n&lt;p&gt;We are dedicated to creating an inclusive work environment for everyone. We embrace and celebrate the unique experiences, perspectives and cultural backgrounds that each employee brings to our workplace. Fingerprint strives to foster an environment where our employees feel respected, valued and empowered, and our team members are at the forefront in helping us promote and sustain an inclusive workplace. We highly encourage people from underrepresented groups in tech to apply.&lt;/p&gt;\n&lt;p&gt;If you are applying as a resident of California, please read our CCPA notice &lt;a href=&quot;https://dev.fingerprint.com/docs/dpa-ccpa&quot; target=&quot;_blank&quot;&gt;here&lt;/a&gt;&lt;/p&gt;\n&lt;p&gt;If you are applying as a resident of the EU, please read our GDPR notice &lt;a href=&quot;https://dev.fingerprint.com/docs/dpa-gdpr&quot; target=&quot;_blank&quot;&gt;here&lt;/a&gt;&lt;/p&gt;&lt;/div&gt;","tags":"[]","pubDate":"2025-02-12T20:11:32.000Z","link":"https://fingerprint.com/careers/jobs/apply/?gh_jid=5424303004","slug":"customer-success-manager-fingerprint-6224"},{"id":6052979112,"title":"SR SDET -  Software Development Engineer In Test","company":"ília","image":"https://avatars.githubusercontent.com/u/35933823?s=200&v=4","description":"&lt;p&gt;Aqui na ília nossas vagas estão sempre abertas para todas as pessoas e não se restringem quanto a gênero, etnia, orientação sexual, fatores sociais, condições físicas ou intelectuais (PCD) etc. Incentivamos a candidatura de integrantes de todos os grupos minoritários!&lt;/p&gt;\n&lt;h3&gt;&lt;strong&gt;Sobre a ília&lt;/strong&gt;&lt;/h3&gt;\n&lt;p&gt;Somos especialistas em tecnologia, dados e design, impulsionando a transformação digital de grandes players do mercado há mais de 10 anos, nos setores financeiro, seguros e mobilidade. Com mais de 450 profissionais, estamos presentes no Brasil e Europa, atendendo aos mercados da América Latina, Europa e América do Norte, desenvolvendo produtos digitais de alta qualidade e com foco em resultados de negócios. Somos uma equipe inovadora, criativa e apaixonada por tecnologia.&amp;nbsp;&lt;/p&gt;\n&lt;p&gt;Certificada pelo 5° ano consecutivo como Great Place to work aqui na ília acreditamos que pessoas mudam o mundo, e investimos nelas. Nossas awesome deliveries são feitas de pessoas para pessoas, afinal awesome people make awesome deliveries!&amp;nbsp;&lt;/p&gt;\n&lt;p&gt;#Vempraília!&lt;/p&gt;\n&lt;h3&gt;&lt;strong&gt;Sobre a vaga:&lt;br&gt;&lt;/strong&gt;&lt;/h3&gt;\n&lt;p&gt;Atuar em parceria juntos aos stakeholders internos de negócios. Trabalhar com equipes multifuncionais para garantir a qualidade ao longo do ciclo de desenvolvimento de software. Olhar atento aos detalhes e excelentes habilidades de comunicação.&amp;nbsp;&lt;/p&gt;\n&lt;h3&gt;&lt;strong&gt;Responsabilidades&lt;/strong&gt;:&lt;/h3&gt;\n&lt;p&gt;&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;Fazer parte de uma equipe multidisciplinar para construir softwares e soluções next-gen;&lt;/li&gt;\n&lt;li&gt;Participar de um processo de desenvolvimento totalmente ágil com lançamentos constantes;&lt;/li&gt;\n&lt;li&gt;Revisar e analisar especificações de sistema;&lt;/li&gt;\n&lt;li&gt;Realizar testes funcionais, API e testes end-to-end;&lt;/li&gt;\n&lt;li&gt;Criar planos de teste de forma eficaz, projetar casos de teste e executar testes para novos recursos e solicitações de mudança, além de revisar os resultados;&lt;/li&gt;\n&lt;li&gt;Analisar problemas detectados durante a execução dos testes e trabalhar em estreita colaboração com os desenvolvedores para validar problemas corrigidos e mudanças de software;&lt;/li&gt;\n&lt;li&gt;Encontrar bugs através de testes manuais, e comunicar as descobertas de forma clara e eficaz.&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;&lt;/p&gt;\n&lt;h3&gt;&lt;strong&gt;Requisitos:&lt;/strong&gt;&lt;/h3&gt;\n&lt;p&gt;&lt;/p&gt;\n&lt;ul&gt;\n&lt;li style=&quot;font-weight: bold;&quot;&gt;&lt;strong&gt;Inglês avançado para conversação (projeto internacional);&lt;/strong&gt;&lt;/li&gt;\n&lt;li&gt;Experiência sólida em Testes de Software, especificamente com scripts automatizados;&lt;/li&gt;\n&lt;li&gt;Habilidades de programação em Javascript;&lt;/li&gt;\n&lt;li&gt;Experiência na implementação de frameworks de automação para testes de API usando Supertest ou outras bibliotecas;&lt;/li&gt;\n&lt;li&gt;Experiência no desenvolvimento de testes automatizados usando Selenium, Cypress, ou outras bibliotecas de testes;&lt;/li&gt;\n&lt;li&gt;Experiência no design de frameworks de automação;&lt;/li&gt;\n&lt;li&gt;Experiência prévia com Continuous Integration.&lt;/li&gt;\n&lt;/ul&gt;\n&lt;h3 style=&quot;line-height: 1.5;&quot;&gt;&lt;strong&gt;Diferenciais:&amp;nbsp;&lt;/strong&gt;&lt;/h3&gt;\n&lt;ul&gt;\n&lt;li&gt;Habilidades de programação em TypeScript;&lt;/li&gt;\n&lt;li&gt;Experiência com framework Playwright.&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;&lt;/p&gt;\n&lt;h3&gt;&lt;strong&gt;Benefícios e Incentivos:&lt;/strong&gt;&lt;/h3&gt;\n&lt;p&gt;Nossa contratação é CLT- 40h semanais com jornada flexível, sendo executada 100% de forma remota. Os benefícios da ília são pensados para proporcionar uma experiência AWESOME para cada ílian, abaixo você encontra os benefícios de forma resumida. #vempraília&lt;/p&gt;\n&lt;p&gt;Para Saúde e bem-estar:&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;Plano de Saúde e Odontológico SulAmérica extensivo a dependentes;&lt;/li&gt;\n&lt;li&gt;Vale Alimentação/Refeição em cartão fléxivel Picpay benefícios&amp;nbsp;&lt;/li&gt;\n&lt;li&gt;Seguro de Vida;&lt;/li&gt;\n&lt;li&gt;Auxílio Home-Office em cartão fléxivel Picpay benefícios;&lt;/li&gt;\n&lt;li&gt;Wellhub (Gympass)&lt;/li&gt;\n&lt;li&gt;TotalPass&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;Para o seu Desenvolvimento:&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;ília University: Universidade Corporativa com mais de 20 mil cursos disponíveis para desenvolvimento pessoal e profissional;&lt;/li&gt;\n&lt;li&gt;Language Academy: Escola de idiomas para ílians;&lt;/li&gt;\n&lt;li&gt;í-talks e Chapter: Momentos e cerimônias em que o time compartilha práticas, estudos, projetos e ideias. Nas chapters ainda se reúnem pessoas com skills similares para compartilhamento de ideias, práticas e experiências;&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;Gostamos de ir além no cuidado com as nossas pessoas, então dispomos também de alguns benefícios não convencionais:&amp;nbsp;&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;Plano de Saúde PET- Guapeco&amp;nbsp;&lt;/li&gt;\n&lt;li&gt;BYOD- Alugamos o seu notebook pessoal te pagando um valor mensal para que você o use, mas disponibilizamos também máquinas de trabalho para ílians. Você quem decide!&lt;/li&gt;\n&lt;li&gt;Seu Niver, seu bolo!&lt;/li&gt;\n&lt;li&gt;Seu Networking Vale Prêmio- Programa de premiação a indicação de novos funcionários.&lt;/li&gt;\n&lt;/ul&gt;","tags":"[\"javascript\",\"typescript\",\"finance\"]","pubDate":"2025-02-12T17:52:08.000Z","link":"https://boards.greenhouse.io/ilia/jobs/5447415004","slug":"sr-sdet-software-development-engineer-in-test-lia-1048"},{"id":1143926305,"title":"Technical Project Manager","company":"Nethermind","image":"https://avatars.githubusercontent.com/u/43478154?s=200&v=4","description":"&lt;div class=&quot;content-intro&quot;&gt;&lt;h2&gt;What are we all about?&lt;/h2&gt;\n&lt;p&gt;We are a team of builders and researchers on a mission to empower enterprises and developers worldwide to access and build on decentralized systems.&lt;/p&gt;\n&lt;p&gt;Our expertise covers several domains: Ethereum and Starknet protocol engineering, layer-2, AI, cryptography research, protocol research, decentralized finance (DeFi), security auditing, formal verification, real-time monitoring, smart contract development, and dapps and enterprise engineering.&lt;/p&gt;\n&lt;p&gt;Working to solve some of the most challenging problems in the blockchain space, we frequently collaborate with renowned companies, such as Ethereum Foundation, Starknet Foundation, Gnosis Chain, Flashbots, Forta Protocol, Lido, EigenLayer, Open Zeppelin, RISCZero, Aleph Zero, and many more.&lt;/p&gt;\n&lt;p&gt;Today, we are a 350+ strong team working remotely across 66+ countries.&lt;/p&gt;\n&lt;p&gt;View all our open positions here: &lt;a href=&quot;https://www.nethermind.io/open-roles&quot;&gt;https://www.nethermind.io/open-roles&amp;nbsp;&lt;/a&gt;&lt;/p&gt;&lt;/div&gt;&lt;p&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Are you the one?&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;We are looking for a Technical Project Manager who will support various teams &amp;amp; projects at Nethermind. Work alongside some of the greatest minds in the blockchain ecosystem and build the future of Web3 together with us!&lt;/p&gt;\n&lt;p&gt;If you never stop thinking about how to optimize, align, structure, adjust and improve ways of working then we are onto something.&lt;/p&gt;\n&lt;p&gt;If you have a passion for building the future of Ethereum and understand the secrets that glue the best blockchain teams and instill a high-performing team culture, then we are getting closer.&lt;/p&gt;\n&lt;p&gt;If you are comfortable understanding the full picture of projects from multiple angles and working with numerous engineering teams at once, then we would love to talk to you!&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Responsibilities:&lt;/strong&gt;&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;Manage the relationship and communication with clients and all stakeholders, ensuring projects are delivered to their satisfaction. (Communication &amp;amp; Leadership)&lt;/li&gt;\n&lt;li&gt;Remove blockers &amp;amp; impediments to create a work environment where teams can grow and strive. (Work Organization)&lt;/li&gt;\n&lt;li&gt;Excel in transparent and direct, yet professional communication. (Communication &amp;amp; Leadership)&lt;/li&gt;\n&lt;li&gt;Ensure project management and programming craft best practices are followed in the team. (PMO)&lt;/li&gt;\n&lt;li&gt;Facilitate project goal setting, planning, estimating, retrospectives, and backlog grooming meetings where those are needed. (Work Organization)&lt;/li&gt;\n&lt;li&gt;Analyze, plan, gather, elicit and develop requirements &amp;amp; specifications in reference to scheduled projects. (PM&amp;amp;BA)&lt;/li&gt;\n&lt;li&gt;Ensure that your project teams are engaged and consistently improving by providing a regular feedback loop.&lt;/li&gt;\n&lt;li&gt;Manage up to ensure the relevant people are always informed about key activities and developments in teams &amp;amp; projects.&lt;/li&gt;\n&lt;li&gt;Create a transparent way to follow the project updates and share reports with stakeholders. (PM&amp;amp;BA)&lt;/li&gt;\n&lt;li&gt;Lead and manage the hiring &amp;amp; staffing process effectively so that team’s strategic goals are met. (PMO)&lt;/li&gt;\n&lt;li&gt;Maintain and manage project financials. (PM&amp;amp;BA)&lt;/li&gt;\n&lt;li&gt;Help team with prioritising the task backlog and lead the product roadmap initiative. (work organisation)&lt;/li&gt;\n&lt;li&gt;Hold regular technical team meetings to determine progress and handle any inquiries or challenges regarding projects. (Work Organization)&lt;/li&gt;\n&lt;li&gt;Contribute to the company&#39;s project management best practices. (PMO)&lt;/li&gt;\n&lt;li&gt;Identify and mitigate potential risks. (PM&amp;amp;BA)&lt;/li&gt;\n&lt;li&gt;Support &amp;amp; integrate interns within relevant teams, and promote your projects to increase intern inflow. (Work Organization)&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;&lt;strong&gt;Must Haves:&lt;/strong&gt;&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;A great communicator with effective client management &amp;amp; conflict resolution skills. (Communication &amp;amp; Leadership)&lt;/li&gt;\n&lt;li&gt;Be a good team player and an effective leader who is able to motivate their project team. (Communication &amp;amp; Leadership)&lt;/li&gt;\n&lt;li&gt;Business &amp;amp; commercial acumen and excellent stakeholder management skills. (PM&amp;amp;BA)&lt;/li&gt;\n&lt;li&gt;Strong familiarity with project management software tools, methodologies &amp;amp; best practices. (PM&amp;amp;BA/Work Organization)&lt;/li&gt;\n&lt;li&gt;Knowledge of the entire Software Development Life Cycle and software architecture. (Technical Skills)&lt;/li&gt;\n&lt;li&gt;Understanding of blockchain architecture, Web3 ecosystem, and main products across the industry (DeFi, Security, Infra, L2s, Meta + NFTs). (Technical Skills)&lt;/li&gt;\n&lt;li&gt;Experience mentoring, coaching, and developing rising talent in the technology field. (PMO)&lt;/li&gt;\n&lt;li&gt;Strong analytical, reporting, and budgeting skills. (PM&amp;amp;BA)&lt;/li&gt;\n&lt;li&gt;Good time management skills and the ability to juggle multiple tasks at once. (Work Organization)&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;&lt;strong&gt;Nice to Haves:&lt;/strong&gt;&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;Managed blockchain projects, especially on the Ethereum ecosystem&lt;/li&gt;\n&lt;li&gt;Experience working as a developer&lt;/li&gt;\n&lt;li&gt;Product Management experience and understanding of Ethereum Roadmap&lt;/li&gt;\n&lt;li&gt;Comprehensive understanding of financial markets principles&lt;/li&gt;\n&lt;/ul&gt;&lt;div class=&quot;content-conclusion&quot;&gt;&lt;div&gt;&lt;span style=&quot;font-size: 8pt;&quot;&gt;&lt;em&gt;&lt;span style=&quot;text-decoration: underline;&quot;&gt;&lt;strong&gt;Disclaimer&lt;/strong&gt;&lt;/span&gt;: I hereby consent to my personal information being stored and processed by Demerzel Solutions Limited (t/a Nethermind) (the “Company”) for recruitment purposes in relation to both the selected job role and any other role the Company considers me a qualified candidate for. All data storing and processing by the Company takes place in accordance with the UK GDPR. Kindly refer to our privacy policy for more details.&amp;nbsp;&lt;/em&gt;&lt;/span&gt;&lt;br&gt;&lt;span style=&quot;font-size: 8pt;&quot;&gt;&lt;em&gt;Your consent to share personal information is entirely voluntary, and you may withdraw your consent at any time. Should you have any questions about this process, or wish to withdraw your consent please contact: legalnotices@nethermind.io&amp;nbsp;&lt;/em&gt;&lt;/span&gt;&lt;br&gt;&lt;br&gt;Keep up to date on what we are working on by following&amp;nbsp;&lt;span class=&quot;il&quot;&gt;us&lt;/span&gt;&amp;nbsp;on &lt;strong&gt;our social channels&lt;br&gt;&lt;br&gt;&lt;/strong&gt;&lt;/div&gt;\n&lt;div&gt;&lt;a href=&quot;https://twitter.com/nethermindeth&quot; target=&quot;_blank&quot;&gt;&lt;img src=&quot;https://cdn4.iconfinder.com/data/icons/social-media-icons-the-circle-set/48/twitter_circle-512.png&quot; alt=&quot;&quot; width=&quot;50&quot; height=&quot;50&quot;&gt;&lt;/a&gt; &amp;nbsp; &lt;a href=&quot;https://discord.com/invite/PaCMRFdvWT&quot; target=&quot;_blank&quot;&gt;&lt;img src=&quot;https://cdn3.iconfinder.com/data/icons/popular-services-brands-vol-2/512/discord-1024.png&quot; alt=&quot;&quot; width=&quot;49&quot; height=&quot;49&quot;&gt;&lt;/a&gt; &amp;nbsp; &lt;a href=&quot;https://www.linkedin.com/company/nethermind/mycompany/&quot; target=&quot;_blank&quot;&gt;&lt;img src=&quot;https://cdn1.iconfinder.com/data/icons/logotypes/32/circle-linkedin-1024.png&quot; alt=&quot;&quot; width=&quot;49&quot; height=&quot;49&quot;&gt;&lt;/a&gt;&lt;/div&gt;\n&lt;div&gt;&amp;nbsp;&lt;/div&gt;\n&lt;div&gt;&lt;strong&gt;&lt;a href=&quot;https://www.nethermind.io/legal&quot; target=&quot;_blank&quot;&gt;&lt;em&gt;Click here to view our Privacy Policy.&lt;/em&gt;&lt;/a&gt;&lt;/strong&gt;&lt;/div&gt;&lt;/div&gt;","tags":"[\"finance\",\"management\",\"engineering\",\"legal\"]","pubDate":"2025-02-12T16:44:46.000Z","link":"https://job-boards.eu.greenhouse.io/nethermind/jobs/4535192101","slug":"technical-project-manager-nethermind-4740"},{"id":6952996772,"title":"Freelance Analytics and DNS Specialist","company":"OneLocal","image":"https://photos.wellfound.com/startups/i/257661-3abe9f68928f2e0407dca967aca86e67-medium_jpg.jpg","description":"&lt;p&gt;The &lt;strong&gt;Freelance Analytics and DNS Specialist&lt;/strong&gt; will manage DNS infrastructure and configure Google products (BigQuery, Analytics, Search Console, Business Profile). This role requires DNS management expertise and web traffic analysis skills to enhance site performance and security. The ideal candidate has problem-solving skills, DNS configuration knowledge, and experience with web analytics platforms.&lt;/p&gt;\n&lt;p&gt;&lt;strong data-stringify-type=&quot;bold&quot;&gt;Key Responsibilities:&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;- Maintain, monitor, and troubleshoot DNS infrastructure&lt;br&gt;- Ensure DNS configurations support site availability, security, and performance&lt;br&gt;- Manage domain transfers, implementing security measures (DNSSEC)&lt;br&gt;- Configure and manage web analytics tools to track traffic and user behavior&lt;br&gt;- Develop dashboards and reports for stakeholders&lt;br&gt;- Collaborate with IT and security teams to monitor DNS performance&lt;br&gt;- Document DNS configurations, processes, and policies&lt;br&gt;- Continuously evaluate and improve DNS and analytics processes&lt;/p&gt;\n&lt;p&gt;&lt;strong data-stringify-type=&quot;bold&quot;&gt;Qualifications:&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;- 2-5 years in DNS management and web analytics tools&lt;br&gt;- Experience with DNS security protocols (DNSSEC, DDoS Protection)&lt;br&gt;- Proficiency with web analytics platforms like Google Analytics or Adobe Analytics&lt;br&gt;- Strong problem-solving and troubleshooting skills&lt;/p&gt;\n&lt;p&gt;&lt;strong data-stringify-type=&quot;bold&quot;&gt;Preferred Qualifications:&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;- DNS and web analytics certifications (e.g., Google Analytics)&lt;br&gt;- Experience with cloud-based DNS services like AWS Route 53, Cloudflare&lt;/p&gt;\n&lt;p&gt;We will be paying at a rate of USD $10 per hour.&lt;/p&gt;\n&lt;p&gt;Note: OneLocal pays freelancers using Direct Deposit. Please only apply for this position if you can get paid via Direct Deposit. Thank you!&lt;/p&gt;","tags":"[\"management\",\"aws\"]","pubDate":"2025-02-12T16:42:40.000Z","link":"https://boards.greenhouse.io/onelocal/jobs/5376902004","slug":"freelance-analytics-and-dns-specialist-onelocal-8506"},{"id":8214279871,"title":"Staff/Principal Designer","company":"VRChat","image":"https://avatars.githubusercontent.com/u/7309826?s=200&v=4","description":"<div><span style=\"font-size: 11pt;\">VRChat offers a first-of-its-kind, game-changing platform that provides an endless collection of social VR experiences and gives the power of creation to its robust community. With over 250,000 worlds and growing, VRChat’s vision is to enable users to bring their imaginations to life and help shape the metaverse anywhere in the world on any device.&nbsp;VRChat has raised around $100M to date with the support of our investors, which include: Makers Fund, Anthos Capital and HTC. We have a great team which includes people from: Netflix, Twitter, Meta, Microsoft, Roblox, Google, Amazon, Unity, Spotify, Discord, Uber, eBay, Robinhood, Twitch, Zynga and TikTok.&nbsp;</span></div><div><br></div><div><span style=\"font-size: 11pt;\">Come and join the mission!</span></div><div><br></div><div><span style=\"font-size: 11pt;\">As a Staff/Principal Designer, you will help define and prototype future use cases, driving our vision for new social experiences across VR and our expansion to other platforms. You’ll collaborate with the VP of Design, design leadership, and cross-functional partners to imagine what’s next for VRChat, leveraging your expertise in spatial design, visual storytelling, and rapid iteration. While the role is vision-oriented, you will integrate insights and feedback from ongoing execution, experimentation, and user research to establish visions grounded in the realities of our user needs and tech capabilities. This work will ultimately inform roadmaps and future investments.</span></div><h3>Responsibilities</h3><li>Visualize Possibilities: Communicate compelling possibilities for VRChat’s future, focusing on new social experiences across VR and other platforms</li><li>Prototyping &amp; Exploration: Create mockups and prototypes to explore future use cases and concepts that will inform our strategies</li><li>Iterate with Insights: Collaborate with user research and execution teams to inform and refine directions.</li><li>Immersion across Platforms: Bring your expertise in cross-platform design to innovate on how immersive social translates across lower-immersion platforms</li><li>Collaborate Across Teams: Align with design, engineering, and product teams to ensure the vision is feasible and aligns with VRChat’s goals</li><li>Inclusive Design: Foster collaboration and inclusivity, ensuring diverse perspectives shape the design process</li>,<h3>Preferred Skills and Experience</h3><li>Extensive experience in product design, with a portfolio showcasing innovation and strong visual storytelling</li><li>Experience integrating user research into design decisions and iterating based on feedback</li><li>Proven ability to lead design efforts, with a strong bias toward collaboration</li><li>Understanding of user-centered design principles, particularly as applied to social platforms and virtual worlds</li><li>Comfortable working in ambiguous environments, adapting designs as new insights emerge</li><li>Excellent communication skills to articulate complex ideas to cross-functional teams</li>,<h3>Bonus Points</h3><li>Experience designing for VR, AR, as well as mobile, desktop and other platforms</li><li>Familiarity with user research methodologies and testing</li><li>Experience in a similar space, designing for virtual worlds and social interaction</li><li>Experience with Unity or other game engine technologies</li>,<h3>Benefits</h3><li>Work from anywhere! VRChat is a 100% remote company offering flexible working hours in combination with core hours supporting real-time collaboration</li><li>Health Benefits</li><li>401K for US &amp; Group RRSP for Canadian Employees</li><li>Stock Options</li><li>Generous paid holiday schedule</li><li>Unlimited/Flexible vacation time</li><li>Paid parental leave benefits</li><div><span style=\"font-size: 10px;\">VRChat is an equal-opportunity employer, and we welcome applicants from all backgrounds. VRChat fosters a diverse, creative, and collaborative environment where anyone can contribute to any of the ongoing projects or direction of the roadmap at any time.&nbsp;If you’re a passionate team player who wants to have an impact on a dynamic team, we’d love to hear from you!</span></div><div><br></div><div><span style=\"font-size: 10px;\">All job offers are subject to satisfactory referencing and background checks.</span></div>","tags":"[\"engineering\"]","pubDate":"2025-02-12T16:14:44.358Z","link":"https://jobs.lever.co/vrchat/76854b3c-76bf-4102-b76d-239adf48fe06","slug":"staff-principal-designer-vrchat-6773"},{"id":4688382495,"title":"Research Project Manager","company":"Nethermind","image":"https://avatars.githubusercontent.com/u/43478154?s=200&v=4","description":"&lt;div class=&quot;content-intro&quot;&gt;&lt;h2&gt;What are we all about?&lt;/h2&gt;\n&lt;p&gt;We are a team of builders and researchers on a mission to empower enterprises and developers worldwide to access and build on decentralized systems.&lt;/p&gt;\n&lt;p&gt;Our expertise covers several domains: Ethereum and Starknet protocol engineering, layer-2, AI, cryptography research, protocol research, decentralized finance (DeFi), security auditing, formal verification, real-time monitoring, smart contract development, and dapps and enterprise engineering.&lt;/p&gt;\n&lt;p&gt;Working to solve some of the most challenging problems in the blockchain space, we frequently collaborate with renowned companies, such as Ethereum Foundation, Starknet Foundation, Gnosis Chain, Flashbots, Forta Protocol, Lido, EigenLayer, Open Zeppelin, RISCZero, Aleph Zero, and many more.&lt;/p&gt;\n&lt;p&gt;Today, we are a 350+ strong team working remotely across 66+ countries.&lt;/p&gt;\n&lt;p&gt;View all our open positions here: &lt;a href=&quot;https://www.nethermind.io/open-roles&quot;&gt;https://www.nethermind.io/open-roles&amp;nbsp;&lt;/a&gt;&lt;/p&gt;&lt;/div&gt;&lt;p&gt;&lt;strong&gt;Are you the one?&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;Nethermind Research looking for a Research Project Manager. Work alongside some of the great minds in the blockchain ecosystem and build the future of Web3 together with us!&amp;nbsp;&lt;br&gt;&lt;br&gt;If you never stop thinking about how to optimize, align, structure, adjust and improve ways of working then we are onto something.&lt;br&gt;If you are passionate about research, building the future of Ethereum and understand the secrets that glue the best blockchain teams and instill a high-performing team culture, then we are getting closer.&lt;br&gt;If you are comfortable understanding the full picture of research projects from multiple angles, the significance of research to advance technology and working with numerous research teams at once, then we would love to talk to you!&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;About Nethermind Research&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;Nethermind Research is the research arm of Nethermind that covers multiple R&amp;amp;D areas, like&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;&lt;strong&gt;Cryptography. &lt;/strong&gt;Our work mostly focuses on topics related to zero-knowledge proofs and how to make them more secure and efficient. Our recent efforts are centered around folding schemes and cryptographic primitives for ML.&lt;/li&gt;\n&lt;li&gt;&lt;strong&gt;ZK engineering.&lt;/strong&gt; Our zk engineering team works on optimizing zkVMs, builds proof of concepts for the research team and pushes the envelope in the efficient and secure zk implementations.&lt;/li&gt;\n&lt;li&gt;&lt;strong&gt;Protocol research.&lt;/strong&gt; Our protocol research team specializes in L1 and L2 designs and topics like preconfirmations, based rollups, zk rollups and all related research areas like incentivizations, auctions, game theory, consensus research.&lt;/li&gt;\n&lt;li&gt;&lt;strong&gt;DeFi research.&lt;/strong&gt; Our DeFi research team works on tokenomics, advises on RWA and prepares market analyses for company’s clients and stakeholders.&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;&lt;strong&gt;Responsibilities:&lt;/strong&gt;&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;Facilitate project goal setting, planning, estimating, retrospectives, and backlog grooming meetings where needed. (Work Organization)&lt;/li&gt;\n&lt;li&gt;Remove blockers &amp;amp; impediments to create a work environment where teams can grow and strive. (Work Organization)&lt;/li&gt;\n&lt;li&gt;Manage the relationship and communication with clients and all stakeholders, ensuring projects are delivered to their satisfaction. (Communication &amp;amp; Leadership)&lt;/li&gt;\n&lt;li&gt;Excel in transparent and direct yet professional communication. (Communication &amp;amp; Leadership)&lt;/li&gt;\n&lt;li&gt;Ensure project management best practices are followed in the team. (PMO)&lt;/li&gt;\n&lt;li&gt;Analyze, plan, gather, elicit and develop requirements &amp;amp; specifications in reference to scheduled projects. (PM&amp;amp;BA)&lt;/li&gt;\n&lt;li&gt;Ensure your project teams are engaged and consistently improving by providing a regular feedback loop.&lt;/li&gt;\n&lt;li&gt;Manage up to ensure the relevant people are always informed about key activities and developments in teams &amp;amp; projects.&lt;/li&gt;\n&lt;li&gt;Create a transparent way to follow the project updates and share reports with stakeholders. (PM&amp;amp;BA)&lt;/li&gt;\n&lt;li&gt;Lead and manage the hiring &amp;amp; staffing process effectively so that team’s strategic goals are met. (PMO)&lt;/li&gt;\n&lt;li&gt;Maintain and manage project financials. (PM&amp;amp;BA)&lt;/li&gt;\n&lt;li&gt;Helped the team prioritise the task backlog and led the product roadmap initiative. (work organisation)&lt;/li&gt;\n&lt;li&gt;Hold regular technical team meetings to determine progress and handle any inquiries or challenges regarding projects. (Work Organization)&lt;/li&gt;\n&lt;li&gt;Contribute to the company&#39;s project management best practices. (PMO)&lt;/li&gt;\n&lt;li&gt;Identify and mitigate potential risks. (PM&amp;amp;BA)&lt;/li&gt;\n&lt;li&gt;Support &amp;amp; integrate interns within relevant teams, and promote your projects to increase intern inflow. (Work Organization)&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;&lt;strong&gt;Must haves:&lt;/strong&gt;&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;A great communicator with effective client management &amp;amp; conflict resolution skills. (Communication &amp;amp; Leadership)&lt;/li&gt;\n&lt;li&gt;Be a good team player and an effective leader who is able to motivate their project team. (Communication &amp;amp; Leadership)&lt;/li&gt;\n&lt;li&gt;Business &amp;amp; commercial acumen and excellent stakeholder management skills. (PM&amp;amp;BA)&lt;/li&gt;\n&lt;li&gt;Strong familiarity with project management software tools, methodologies &amp;amp; best practices. (PM&amp;amp;BA/Work Organization)&lt;/li&gt;\n&lt;li&gt;Understanding of blockchain architecture, Web3 ecosystem, and main products across the industry (DeFi, Security, Infra, L2s, Meta + NFTs). (Technical Skills)&lt;/li&gt;\n&lt;li&gt;Experience mentoring, coaching, and developing rising talent in the technology field. (PMO)&lt;/li&gt;\n&lt;li&gt;Strong analytical, reporting, and budgeting skills. (PM&amp;amp;BA)&lt;/li&gt;\n&lt;li&gt;Good time management skills and the ability to juggle multiple tasks at once. (Work Organization)&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;&lt;strong&gt;Nice to have:&lt;/strong&gt;&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;Managed research projects either in academia or industry&lt;/li&gt;\n&lt;li&gt;Managed blockchain projects, especially on the Ethereum ecosystem&lt;/li&gt;\n&lt;li&gt;Product Management experience and understanding of Ethereum Roadmap&lt;/li&gt;\n&lt;li&gt;Working understanding of either cryptography, decentralized finance, decentralized protocols&lt;/li&gt;\n&lt;/ul&gt;&lt;div class=&quot;content-conclusion&quot;&gt;&lt;div&gt;&lt;span style=&quot;font-size: 8pt;&quot;&gt;&lt;em&gt;&lt;span style=&quot;text-decoration: underline;&quot;&gt;&lt;strong&gt;Disclaimer&lt;/strong&gt;&lt;/span&gt;: I hereby consent to my personal information being stored and processed by Demerzel Solutions Limited (t/a Nethermind) (the “Company”) for recruitment purposes in relation to both the selected job role and any other role the Company considers me a qualified candidate for. All data storing and processing by the Company takes place in accordance with the UK GDPR. Kindly refer to our privacy policy for more details.&amp;nbsp;&lt;/em&gt;&lt;/span&gt;&lt;br&gt;&lt;span style=&quot;font-size: 8pt;&quot;&gt;&lt;em&gt;Your consent to share personal information is entirely voluntary, and you may withdraw your consent at any time. Should you have any questions about this process, or wish to withdraw your consent please contact: legalnotices@nethermind.io&amp;nbsp;&lt;/em&gt;&lt;/span&gt;&lt;br&gt;&lt;br&gt;Keep up to date on what we are working on by following&amp;nbsp;&lt;span class=&quot;il&quot;&gt;us&lt;/span&gt;&amp;nbsp;on &lt;strong&gt;our social channels&lt;br&gt;&lt;br&gt;&lt;/strong&gt;&lt;/div&gt;\n&lt;div&gt;&lt;a href=&quot;https://twitter.com/nethermindeth&quot; target=&quot;_blank&quot;&gt;&lt;img src=&quot;https://cdn4.iconfinder.com/data/icons/social-media-icons-the-circle-set/48/twitter_circle-512.png&quot; alt=&quot;&quot; width=&quot;50&quot; height=&quot;50&quot;&gt;&lt;/a&gt; &amp;nbsp; &lt;a href=&quot;https://discord.com/invite/PaCMRFdvWT&quot; target=&quot;_blank&quot;&gt;&lt;img src=&quot;https://cdn3.iconfinder.com/data/icons/popular-services-brands-vol-2/512/discord-1024.png&quot; alt=&quot;&quot; width=&quot;49&quot; height=&quot;49&quot;&gt;&lt;/a&gt; &amp;nbsp; &lt;a href=&quot;https://www.linkedin.com/company/nethermind/mycompany/&quot; target=&quot;_blank&quot;&gt;&lt;img src=&quot;https://cdn1.iconfinder.com/data/icons/logotypes/32/circle-linkedin-1024.png&quot; alt=&quot;&quot; width=&quot;49&quot; height=&quot;49&quot;&gt;&lt;/a&gt;&lt;/div&gt;\n&lt;div&gt;&amp;nbsp;&lt;/div&gt;\n&lt;div&gt;&lt;strong&gt;&lt;a href=&quot;https://www.nethermind.io/legal&quot; target=&quot;_blank&quot;&gt;&lt;em&gt;Click here to view our Privacy Policy.&lt;/em&gt;&lt;/a&gt;&lt;/strong&gt;&lt;/div&gt;&lt;/div&gt;","tags":"[\"finance\",\"management\",\"engineering\",\"legal\"]","pubDate":"2025-02-12T16:10:40.000Z","link":"https://job-boards.eu.greenhouse.io/nethermind/jobs/4535079101","slug":"research-project-manager-nethermind-4017"},{"id":9227167133,"title":"Growth Engineer","company":"Clerk","image":"https://avatars.githubusercontent.com/u/49538330?s=200&v=4","description":"<h2>About Clerk</h2><p style=\"min-height:1.5em\">Clerk is a globally-distributed team dedicated to providing a best-in-class developer experience, with obsessive attention to every detail. Today, we provide developers with React components like <a target=\"_blank\" rel=\"noopener noreferrer nofollow\" href=\"https://clerk.dev/components/sign-up\">&lt;SignUp/&gt;</a>, <a target=\"_blank\" rel=\"noopener noreferrer nofollow\" href=\"https://clerk.dev/components/sign-in\">&lt;SignIn/&gt;</a>, and <a target=\"_blank\" rel=\"noopener noreferrer nofollow\" href=\"https://clerk.dev/components/user-profile\">&lt;UserProfile/&gt;</a>. These components allow developers to drop authentication and user management into their applications. We believe that <a target=\"_blank\" rel=\"noopener noreferrer nofollow\" href=\"https://youtube.com/watch?v=enUuBY3HXh4\">a component is worth a thousand APIs</a>.</p><p style=\"min-height:1.5em\"></p><h2>About the Role</h2><p style=\"min-height:1.5em\">We’re on the lookout for a skilled Growth Enginee<em>r</em> to join our team at Clerk! If you’re passionate about building impactful features, experimenting with new ideas, and using data to drive decisions, this is your chance to help shape the future of Clerk’s growth. In this role, you’ll work with a collaborative team to create solutions that improve user experience and accelerate growth.</p><p style=\"min-height:1.5em\"></p><h2>What You’ll Do</h2><ul style=\"min-height:1.5em\"><li><p style=\"min-height:1.5em\">Collaborate with small, cross-functional teams to create and implement features and improvements that help drive growth.</p></li><li><p style=\"min-height:1.5em\">Implement experiments to improve onboarding, activation, conversion rates and adoption.</p></li><li><p style=\"min-height:1.5em\">Use data to identify opportunities, and drive feedback loops to learn from experiments.</p></li><li><p style=\"min-height:1.5em\">Work closely with Marketing and other teams to conduct experiments to improve our understanding of Clerk’s ideal customers and smooth over friction points in Clerk’s adoption funnel.</p></li></ul><h2>Who You Are</h2><ul style=\"min-height:1.5em\"><li><p style=\"min-height:1.5em\">You have 5+ years of experience building performant, reliable web applications. You’re proficient in Next.js, React, Typescript, and Node.</p></li><li><p style=\"min-height:1.5em\">You have strong analytical skills and are comfortable using data to guide decisions and measure the success of your work.</p></li><li><p style=\"min-height:1.5em\">You enjoy running experiments, testing hypotheses, and iterating based on results. You’re comfortable with rapid experimentation, understanding that failure is part of the process.</p></li><li><p style=\"min-height:1.5em\">You’re driven by a desire to improve the user experience. You’re comfortable engaging with customers directly through support channels, conversations, and feedback loops.</p></li></ul><h2>The Qualities We Value</h2><ul style=\"min-height:1.5em\"><li><p style=\"min-height:1.5em\"><strong>Entrepreneurial</strong> - You take an interest in Clerk’s business and finding ways to improve it. You want to see the bigger picture so that you can connect your work to it.</p></li><li><p style=\"min-height:1.5em\"><strong>Experimental</strong> - You take a science-like approach of forming a hypothesis based on signals, creating experiments to test them and evaluating the outcomes.</p></li><li><p style=\"min-height:1.5em\"><strong>Data-driven</strong> - You understand the importance of data - both using it to help drive decisions and directions, and the engineering work needed to create high-quality data signals. We’re only as good as our feedback loops allow us to be.</p></li><li><p style=\"min-height:1.5em\"><strong>Curious</strong> - You’re motivated by learning new things. Growth Engineers work across a range of systems and need to be able to pick-up something new quickly and effectively enough to accomplish a goal.</p></li></ul><h2>Benefits:</h2><ul style=\"min-height:1.5em\"><li><p style=\"min-height:1.5em\">We want you to know that we value the skills and experience you bring to the table. We go out of our way to make sure that you feel fairly compensated.</p></li><li><p style=\"min-height:1.5em\">At Clerk, we believe in shared success. That's why we offer a stock option plan so that everyone can benefit from the growth and prosperity of the company.</p></li><li><p style=\"min-height:1.5em\">We care about your well-being. That's why we offer top-tier health insurance to ensure that your health needs are fully met.</p></li><li><p style=\"min-height:1.5em\">Set up your ideal home office with the gear of your choice. At Clerk, we want to ensure that you have everything you need to perform at your best.</p></li><li><p style=\"min-height:1.5em\">We believe in work-life balance and trust you to take the time you need. Although we recommend 25 days per year, our vacation policy is unlimited. This is in addition to observing national holidays specific to your country of residence.</p></li><li><p style=\"min-height:1.5em\">Join our exceptional and globally distributed team at Clerk. We are committed to fostering an inclusive environment where everyone can contribute their best in building impactful products and tools for the modern web.</p></li></ul>","tags":"[\"typescript\",\"management\",\"engineering\"]","pubDate":"2025-02-12T15:14:22.814Z","link":"https://jobs.ashbyhq.com/clerk/c1ea6103-b154-48a0-aa37-742959873ba5","slug":"growth-engineer-clerk-1244"},{"id":9050347126,"title":"Senior Data Engineer","company":"Clutch","image":"https://app.ashbyhq.com/api/images/org-theme-logo/87f6e542-ae68-4ff1-ab48-f05e9dab1964/e24aecd5-3955-404a-8728-c08806c78730.png","description":"<h1><strong>About the Role</strong></h1><ol style=\"min-height:1.5em\"><li><p style=\"min-height:1.5em\">Building Scalable Data Infrastructure</p></li></ol><p style=\"min-height:1.5em\">As our Senior Data Engineer, you will be the foundation of our data team, designing and implementing scalable, secure, and well-structured data infrastructure. You will lead the adoption of best practices in data engineering, ensuring our pipelines—both real-time and incremental streaming—are efficient, resilient, and aligned with the needs of analysts, data scientists, and external customers.</p><ol style=\"min-height:1.5em\" start=\"2\"><li><p style=\"min-height:1.5em\">Leading Data Governance &amp; Best Practices</p></li></ol><p style=\"min-height:1.5em\">You will establish and maintain our data catalogs, governance frameworks, and best practices for managing and transforming data. Your expertise in Databricks, Unity Catalog, Terraform (AWS + Databricks), Docker, Python, and DBT or flypipe will drive the team's success. Your role extends beyond just infrastructure-you will ensure that data accessibility, security, and documentation empower analysts and data scientists to extract maximum value.</p><ol style=\"min-height:1.5em\" start=\"3\"><li><p style=\"min-height:1.5em\">Hands-On Technical Leadership</p></li></ol><p style=\"min-height:1.5em\">We are looking for a hands-on leader who thrives on challenges. As we build our data engineering team, you will mentor and guide engineers in creating high-performance streaming and batch pipelines, optimizing transformations. Your willingness to challenge the status quo, experiment with new technologies, and foster a culture of innovation will be key to our success.</p><p style=\"min-height:1.5em\"></p><h1><strong>About the Team</strong></h1><ol style=\"min-height:1.5em\"><li><p style=\"min-height:1.5em\">Small but High-Impact Team</p></li></ol><p style=\"min-height:1.5em\">We are a lean, highly technical data team with a strong foundation. As we build our data infrastructure from the ground up, we focus on practical, hands-on execution while ensuring our work aligns with both internal and customer needs. Every team member plays a crucial role in shaping the future of data at the company.</p><ol style=\"min-height:1.5em\" start=\"2\"><li><p style=\"min-height:1.5em\">Collaborative &amp; Cross-Functional</p></li></ol><p style=\"min-height:1.5em\">Our team operates at the intersection of technology, product, and business strategy. The Director of Data is hands-on, ensuring the team has the right toolset and direction. The Product Manager connects data initiatives with business goals, while our Data Scientist is focused on building ML models to enhance our product offerings. We work side by side to ensure data is actionable, scalable, and impactful.</p><ol style=\"min-height:1.5em\" start=\"3\"><li><p style=\"min-height:1.5em\">Building from Scratch, Together</p></li></ol><p style=\"min-height:1.5em\">Right now, we’re in build mode—laying the foundation for a scalable, well-governed data ecosystem. This means a lot of coding, experimentation, and defining best practices. As we grow, we are looking for team players who are eager to shape this infrastructure, challenge assumptions, and help us build a best-in-class data environment.</p><p style=\"min-height:1.5em\"></p><h1><strong>What You’ll Do</strong></h1><p style=\"min-height:1.5em\"></p><h2>Within 3 months, you will:</h2><ul style=\"min-height:1.5em\"><li><p style=\"min-height:1.5em\">Assess &amp; Prioritize Data Needs – Identify key data sources for ingestion, evaluate infrastructure security, setup, and scalability, and define a roadmap for implementation.</p></li><li><p style=\"min-height:1.5em\">Improve Data Pipelines &amp; Governance – Ensure pipelines, catalogs, and dictionaries are structured, well-documented, and support both internal and external dashboard accessibility.</p></li><li><p style=\"min-height:1.5em\">Identify &amp; Solve Technical Challenges – Quickly raise concerns, propose and implement technical solutions to improve data reliability, performance, and security.</p></li><li><p style=\"min-height:1.5em\">Engage with Key Stakeholders – Build strong relationships with engineering and product teams to align data infrastructure with business needs and ensure smooth collaboration.</p></li></ul><h2>Within 6 months, you will:</h2><ul style=\"min-height:1.5em\"><li><p style=\"min-height:1.5em\">Own the Technical Strategy for Data Engineering – Take full ownership of data infrastructure, pipelines, and governance, ensuring they are secure, scalable, and aligned with best practices.</p></li><li><p style=\"min-height:1.5em\">Lead &amp; Mentor the Data Engineering Team – Guide other data engineers, establish coding standards, and drive technical excellence in pipeline development, modeling, and transformation.</p></li><li><p style=\"min-height:1.5em\">Adapt Data Systems to Business &amp; Product Needs – Stay informed about product and business changes, proactively adjusting data models and infrastructure to support evolving requirements.</p></li><li><p style=\"min-height:1.5em\">Optimize Performance &amp; Cost Efficiency – Continuously refine data pipelines and modeling to balance cost, performance, and scalability, ensuring smooth workflows for data scientists and analysts.</p></li></ul><h2>Within 9 months, you will:</h2><ul style=\"min-height:1.5em\"><li><p style=\"min-height:1.5em\">Own &amp; Drive Data Engineering Strategy – Oversee the technical direction of data engineering, ensuring infrastructure, pipelines, and models evolve based on how users interact with data.</p></li><li><p style=\"min-height:1.5em\">Optimize Costs &amp; Performance Continuously – Implement cost-effective solutions while maintaining high-performance pipelines and scalable infrastructure for analytics and ML workloads.</p></li><li><p style=\"min-height:1.5em\">Ensure Reliable &amp; Well-Structured Data Models – Maintain and refine data models and engineering toolsets to provide data scientists, analysts, and engineers with the right foundation for their work.</p></li><li><p style=\"min-height:1.5em\">Scale the Team &amp; Maintain Data Operations – Lead onboarding and mentorship of new team members, ensuring smooth development and production operations while adapting to new data sources and evolving business needs.</p></li></ul><p style=\"min-height:1.5em\"></p><h1><strong>What You’ll Bring</strong></h1><ul style=\"min-height:1.5em\"><li><p style=\"min-height:1.5em\">5+ years as data engineer, working in a fast-paced environment, preferably in Fintech</p></li><li><p style=\"min-height:1.5em\">Expertise in Data Infrastructure &amp; Pipelines – Strong experience in building, optimizing, and maintaining data pipelines (incremental &amp; real-time/streaming) with a focus on scalability, security, and performance.</p></li><li><p style=\"min-height:1.5em\">Deep Knowledge of Databricks &amp; Unity Catalog – Hands-on experience with Databricks, Unity Catalog, and data governance best practices for secure and organized data access (Databricks Data engineer Professional certificate is a plus!)</p></li><li><p style=\"min-height:1.5em\">Proficiency in Terraform &amp; Cloud Infrastructure (AWS) – Strong ability to manage Databricks + AWS setup using Terraform, ensuring a scalable and well-managed infrastructure.</p></li><li><p style=\"min-height:1.5em\">Strong Python &amp; DBT Skills – Extensive experience in Python for data engineering tasks and DBT for transformation and data modeling.</p></li><li><p style=\"min-height:1.5em\">Data Modeling &amp; Governance Expertise – Proven ability to design efficient data models, implement data dictionaries/catalogs, and ensure high-quality, accessible data for analysts and data scientists.</p></li><li><p style=\"min-height:1.5em\">Ability to Guide &amp; Mentor Data Engineers – Leadership in setting best practices, reviewing code, and mentoring engineers, ensuring a high technical standard within the team.</p></li><li><p style=\"min-height:1.5em\">Familiarity with Docker &amp; CI/CD Pipelines – Experience with containerization and CI/CD for managing data engineering workflows.</p></li><li><p style=\"min-height:1.5em\">Experience with External Data Sharing &amp; Security – Understanding of data security and access management for both internal and external stakeholders.</p></li><li><p style=\"min-height:1.5em\">ML Pipeline Deployment Knowledge – Understanding of ML models in production and how to optimize pipelines for data scientists.</p></li></ul><p style=\"min-height:1.5em\"><em>Please note that this role may evolve as our business needs change, so we appreciate your flexibility and adaptability.</em></p><p style=\"min-height:1.5em\"><strong>What’s In It For You?</strong></p><ul style=\"min-height:1.5em\"><li><p style=\"min-height:1.5em\"><strong>Remote Flexibility:</strong> Enjoy the freedom of remote work from anywhere, balancing life and career seamlessly.</p></li><li><p style=\"min-height:1.5em\"><strong>Unforgettable Off-Sites:</strong> Twice a year, bond with colleagues in exciting destinations, fostering teamwork and fresh ideas.</p></li><li><p style=\"min-height:1.5em\"><strong>Paid Time Off and National Holidays:</strong> Enjoy 20 PTO days yearly and the National Holidays for relaxation and rejuvenation.</p></li><li><p style=\"min-height:1.5em\"><strong>Stock Options:</strong> Joining us means having a stake in our success, so you'll receive stock options as part of your compensation package.</p></li><li><p style=\"min-height:1.5em\"><strong>Home Office Setup:</strong> Create your ideal workspace with a dedicated budget for home office essentials.</p></li><li><p style=\"min-height:1.5em\"><strong>Work Trip Budget:</strong> Grow personally and professionally with a budget for work-related trips and co-working.</p></li></ul><p style=\"min-height:1.5em\"><strong>About Us</strong></p><p style=\"min-height:1.5em\"><strong>Clutch</strong> is a revolutionary vertical SaaS company, proudly backed by Andreessen Horowitz (A16z), aimed at revolutionizing the way Credit Unions engage and change the lives of their members. As a champion of financial well-being, we address the urgent need for affordable lending solutions in an era where the average American grapples with over $155,000 in household debt.  Unlike traditional financial institutions, Clutch develops software to turn Credit Unions into FinTech lenders and leverage their balance sheets to responsibly lend to over 130M Americans. Our mission extends beyond mere financial transactions; we strive to fundamentally enhance the way credit unions interact with their members. By integrating cutting-edge technologies and user-centric designs, we help credit unions provide seamless digital experiences that are on par with leading tech companies. This approach not only preserves but revitalizes the longstanding tradition of community and member-focused service inherent to credit unions.</p><p style=\"min-height:1.5em\"><strong>Please note:</strong> This position is offered on a contractor basis. Applicants must have the necessary documentation and authorization to work in the country where the job is located. Clutch cannot provide sponsorship or assist with obtaining work permits for this role.</p>","tags":"[\"management\",\"engineering\",\"aws\"]","pubDate":"2025-02-12T14:06:36.045Z","link":"https://jobs.ashbyhq.com/withclutch/9aa9a4a4-9316-40e2-9689-e8028e419e18","slug":"senior-data-engineer-clutch-762"},{"id":1949015008,"title":"Senior DevSecOps (Full Time, Canada)","company":"Quantstamp","image":"https://avatars.githubusercontent.com/u/30974158?s=200&v=4","description":"<p style=\"min-height:1.5em\">As a Senior DevSecOps Engineer you will bridge our infrastructure and security teams, taking ownership of security-focused initiatives and helping us provide around-the-clock support as part of our on-call rotation.</p><p style=\"min-height:1.5em\"></p><p style=\"min-height:1.5em\"><strong>Candidate Profile</strong></p><ul style=\"min-height:1.5em\"><li><p style=\"min-height:1.5em\">Background in Computer Science or related field</p></li><li><p style=\"min-height:1.5em\">5 years of professional experience as a DevSecOps engineer</p></li><li><p style=\"min-height:1.5em\">Proven experience in securing AWS-based setups and Kubernetes clusters</p></li><li><p style=\"min-height:1.5em\">Proven experience with CI/CD pipelines, automation, and TerraForm</p></li><li><p style=\"min-height:1.5em\">Strong understanding of how PKI works, as well as SSL and TLS protocols</p></li><li><p style=\"min-height:1.5em\">Hands-on experience with security tools (e.g., OWASP ZAP, Nessus, Qualys)</p></li><li><p style=\"min-height:1.5em\">Familiarity with SIEM and other security platforms</p></li><li><p style=\"min-height:1.5em\">Knowledge of relevant regulatory standards (e.g., GDPR, SOC 2, ISO/IEC 27001)</p></li></ul><p style=\"min-height:1.5em\"></p><p style=\"min-height:1.5em\"><strong>Nice to Have</strong></p><ul style=\"min-height:1.5em\"><li><p style=\"min-height:1.5em\">Security certifications such as CISSP, CCSP, GCSA, CDP, OSCP, CEH, or GIAC</p></li><li><p style=\"min-height:1.5em\">Cloud security certifications like AWS Certified Security Specialty</p></li></ul><p style=\"min-height:1.5em\"></p><p style=\"min-height:1.5em\"><strong>Responsibilities</strong></p><ul style=\"min-height:1.5em\"><li><p style=\"min-height:1.5em\">Implement and manage security tools within our CI/CD pipelines, including DAST, SAST, and container scanning solutions.</p></li><li><p style=\"min-height:1.5em\">Secure our cloud environments with a focus on IAM, secrets management, and workload protection</p></li><li><p style=\"min-height:1.5em\">Provide expert opinions to inform decisions and assist in evaluating, selecting, and implementing security tools and frameworks (SIEM, CNAPP, SSPM, SOAR, XDR).</p></li><li><p style=\"min-height:1.5em\">Participate in the existing on-call rotation to maintain 24/7 coverage</p></li><li><p style=\"min-height:1.5em\">Work closely with team members across APAC, Europe, and North America to ensure seamless integration of security practices</p></li><li><p style=\"min-height:1.5em\">Detect, mitigate, and respond to security incidents, utilizing log analysis tools and contributing to incident post-mortems</p></li><li><p style=\"min-height:1.5em\">Participate in our on-call rotation</p></li><li><p style=\"min-height:1.5em\">Ensure our systems comply with relevant regulatory standards</p></li></ul><p style=\"min-height:1.5em\"></p><p style=\"min-height:1.5em\"><strong>Compensation &amp; Perks</strong></p><ul style=\"min-height:1.5em\"><li><p style=\"min-height:1.5em\">Competitive compensation package (commensurate to experience) + performance and referral bonuses</p></li><li><p style=\"min-height:1.5em\">100% remote and flexible working hours</p></li><li><p style=\"min-height:1.5em\">Work from anywhere in the world</p></li><li><p style=\"min-height:1.5em\">Generous paid time off, including maternity/paternity leave</p></li><li><p style=\"min-height:1.5em\">Retirement/pension plan</p></li><li><p style=\"min-height:1.5em\">Equity</p></li><li><p style=\"min-height:1.5em\">Rent your own desk in a co-working space or work from anywhere at any time</p></li><li><p style=\"min-height:1.5em\">Free gym membership or any virtual alternative of your choice</p></li><li><p style=\"min-height:1.5em\">Learn about the hottest and newest products and trends in the crypto space before they appear on any news outlets</p></li><li><p style=\"min-height:1.5em\">Join quarterly all-expenses-paid retreats in exotic/exclusive locations with the team</p></li></ul>","tags":"[\"management\",\"aws\"]","pubDate":"2025-02-12T13:22:13.885Z","link":"https://jobs.ashbyhq.com/quantstamp/cff8b505-bea5-4c29-8ce5-f3a26a15912b","slug":"senior-devsecops-full-time-canada-quantstamp-8206"},{"id":3118992261,"title":"Recruiter","company":"Coalition Technologies ","image":"https://remotive.com/job/1680495/logo","description":"<p class=\"h3\">WHY YOU SHOULD APPLY:</p>\n<p> </p>\n<p>Coalition Technologies is devoted to delivering clients the highest quality work while providing our team a fun, thriving, and innovative environment. Along with the opportunity for tremendous career growth and rapid advancement, CT offers:</p>\n<ul style=\"\">\n<li style=\"\">The most competitive profit-sharing bonus plan in the industry, paying up to 50% of company profits to full-time employees each month!</li>\n<li style=\"\">A highly competitive Paid Time Off plan, promoting quality work-life balance.</li>\n<li style=\"\">Subsidized gym memberships to help team members feel their best.</li>\n<li style=\"\">Medical, dental, vision, and life insurance packages for all US-based team members.</li>\n<li style=\"\">International Health Insurance Reimbursement Program for all international team members, a benefit unique to Coalition.</li>\n<li style=\"\">Device upgrade and learning reimbursement programs.</li>\n<li style=\"\">Motivating career development plans with clearly defined goals and rewards.</li>\n<li style=\"\">Additional job-specific incentives and bonuses.</li>\n</ul>\n<p>Plus, 100% of our team works remotely with the support of time tracking software. Our company culture specializes in supporting remote team members, and we’ve been doing so for more than a decade. CT welcomes your application, wherever in the world it's coming from!</p>\n<p class=\"h3\"> </p>\n<p class=\"h3\">YOU SHOULD HAVE:</p>\n<p> </p>\n<ul style=\"\">\n<li style=\"\">Prior experience with recruitment, sourcing, screening, hiring etc. International recruiting experience is a plus.</li>\n<li style=\"\">Passion for recruitment and human resources.</li>\n<li style=\"\">Great interpersonal, analytical, problem-solving, negotiating, influencing, facilitation, decision-making, and conflict resolution skills.</li>\n<li style=\"\">The ability to stay highly organized with great attention to detail.</li>\n<li style=\"\">The ability to maintain strict confidentiality and discretion.</li>\n<li style=\"\">Excellent written and spoken English.</li>\n<li style=\"\">The availability to work 40 hours per week from 9:00 am to 6:00 pm PST.</li>\n<li style=\"\">Passion to build a startup.</li>\n<li style=\"\">An outgoing and friendly disposition.</li>\n<li style=\"\">A reliable workstation with a fast computer, microphone and speakers, reliable internet and power if working remotely.</li>\n</ul>\n<p class=\"h3\"> </p>\n<p class=\"h3\">YOUR DUTIES AND TASKS:</p>\n<p> </p>\n<ul style=\"\">\n<li style=\"\">Drafting and posting job ads.</li>\n<li style=\"\">Reviewing resumes and screening candidates.</li>\n<li style=\"\">Scheduling interviews and skills tests by coordinating appointments.</li>\n<li style=\"\">Conducting interviews with candidates on Zoom.</li>\n<li style=\"\">Administering skills tests.</li>\n<li style=\"\">Inputting, updating and maintaining data in the recruiting database.</li>\n<li style=\"\">Conducting exit interviews in the event that an employee leaves the company.</li>\n<li style=\"\">Assisting management with personnel issues and employee development.</li>\n<li style=\"\">Assisting management with organizing and coordinating employee training workshops.</li>\n<li style=\"\">Planning and executing company events.</li>\n<li style=\"\">Protecting operations by keeping human resource information confidential.</li>\n<li style=\"\">Providing horizontal support to other staff members of the recruitment team.</li>\n</ul>\n<p class=\"h5\"> </p>\n<p class=\"h5\">We are looking for talented and diligent candidates who excel in our skills tests, and will consider these candidates even if past experience or educational background criteria aren't met.</p>\n<p class=\"h5\"> </p>\n<p>*California, New York, Washington, and Colorado: starting base pay for this position ranges between $15 - $35 per hour.</p>\n<p>Compensation may vary based on factors such as experience, qualifications, skills test performance, geographic location, and seniority of the position offered. Outside of California, New York, Washington, and Colorado compensation may fall outside the above ranges.</p>\n<img src=\"https://remotive.com/job/track/1680495/blank.gif?source=public_api\" alt=\"\"/>","tags":"[\"CSS\",\"excel\",\"frontend\",\"git\",\"html\",\"illustrator\",\"magento\",\"photoshop\",\"php\",\"shopify\",\"wordpress\",\"MySQL\",\"startup\",\"responsive\",\"themes\",\"bootstrap\",\"insurance\",\"jQuery\",\"Ajax\"]","pubDate":"2025-02-11T19:31:12.000Z","link":"https://remotive.com/remote-jobs/hr/recruiter-1680495","slug":"recruiter-coalition-technologies-8571"},{"id":4423689103,"title":"Creative Director","company":"Realiste AI","image":"https://remotive.com/job/1971888/logo","description":"<p style=\"font-style: normal; font-variant-caps: normal; font-stretch: normal;  line-height: normal;   font-kerning: auto; font-variant-alternates: normal; font-variant-ligatures: normal; font-variant-numeric: normal; font-variant-east-asian: normal; font-variant-position: normal; font-variant-emoji: normal; font-feature-settings: normal; font-optical-sizing: auto; font-variation-settings: normal; color: rgb(0, 0, 0);\"><strong>Who We Are:  </strong></p><p style=\"font-style: normal; font-variant-caps: normal; font-stretch: normal;  line-height: normal;   font-kerning: auto; font-variant-alternates: normal; font-variant-ligatures: normal; font-variant-numeric: normal; font-variant-east-asian: normal; font-variant-position: normal; font-variant-emoji: normal; font-feature-settings: normal; font-optical-sizing: auto; font-variation-settings: normal; color: rgb(0, 0, 0);\">Realiste (<span style=\"color: #1f6bc0\">https://realiste.ai</span>) is years ahead of the industry. No one in the world has built what we’ve already launched. Our AI technology is setting the new standard in real estate—and in a few years, the entire world will be using our products as the industry norm. We’re not just innovating; we’re defining the future of real estate investment. </p><p style=\"font-style: normal; font-variant-caps: normal; font-stretch: normal;  line-height: normal;   font-kerning: auto; font-variant-alternates: normal; font-variant-ligatures: normal; font-variant-numeric: normal; font-variant-east-asian: normal; font-variant-position: normal; font-variant-emoji: normal; font-feature-settings: normal; font-optical-sizing: auto; font-variation-settings: normal; color: rgb(0, 0, 0); min-height: 15px;\"><br></p><p style=\"font-style: normal; font-variant-caps: normal; font-stretch: normal;  line-height: normal;   font-kerning: auto; font-variant-alternates: normal; font-variant-ligatures: normal; font-variant-numeric: normal; font-variant-east-asian: normal; font-variant-position: normal; font-variant-emoji: normal; font-feature-settings: normal; font-optical-sizing: auto; font-variation-settings: normal; color: rgb(0, 0, 0);\"><strong>Your Mission:  </strong></p><p style=\"font-style: normal; font-variant-caps: normal; font-stretch: normal;  line-height: normal;   font-kerning: auto; font-variant-alternates: normal; font-variant-ligatures: normal; font-variant-numeric: normal; font-variant-east-asian: normal; font-variant-position: normal; font-variant-emoji: normal; font-feature-settings: normal; font-optical-sizing: auto; font-variation-settings: normal; color: rgb(0, 0, 0);\">We need a Creative Mind / Director to help tell our game-changing story through engaging video content.  </p><p style=\"font-style: normal; font-variant-caps: normal; font-stretch: normal;  line-height: normal;   font-kerning: auto; font-variant-alternates: normal; font-variant-ligatures: normal; font-variant-numeric: normal; font-variant-east-asian: normal; font-variant-position: normal; font-variant-emoji: normal; font-feature-settings: normal; font-optical-sizing: auto; font-variation-settings: normal; color: rgb(0, 0, 0);\"></p><ul style=\"\"><li style=\"\">Develop bold ideas, themes, and formats for Reels, interviews, and deep dives.  </li><li style=\"\">Elevate our company, our CEO’s presence, and our AI-driven products.  </li><li style=\"\">Prepare for high-volume content production—we’re shooting a lot!  </li></ul><p style=\"font-style: normal; font-variant-caps: normal; font-stretch: normal;  line-height: normal;   font-kerning: auto; font-variant-alternates: normal; font-variant-ligatures: normal; font-variant-numeric: normal; font-variant-east-asian: normal; font-variant-position: normal; font-variant-emoji: normal; font-feature-settings: normal; font-optical-sizing: auto; font-variation-settings: normal; color: rgb(0, 0, 0); min-height: 15px;\"><br></p><p style=\"font-style: normal; font-variant-caps: normal; font-stretch: normal;  line-height: normal;   font-kerning: auto; font-variant-alternates: normal; font-variant-ligatures: normal; font-variant-numeric: normal; font-variant-east-asian: normal; font-variant-position: normal; font-variant-emoji: normal; font-feature-settings: normal; font-optical-sizing: auto; font-variation-settings: normal; color: rgb(0, 0, 0); min-height: 15px;\"><strong>Why You Should Join Us: </strong> </p><p style=\"font-style: normal; font-variant-caps: normal; font-stretch: normal;  line-height: normal;   font-kerning: auto; font-variant-alternates: normal; font-variant-ligatures: normal; font-variant-numeric: normal; font-variant-east-asian: normal; font-variant-position: normal; font-variant-emoji: normal; font-feature-settings: normal; font-optical-sizing: auto; font-variation-settings: normal; color: rgb(0, 0, 0);\"></p><ul style=\"\"><li style=\"\">Be part of a global revolution.  </li><li style=\"\">Your content will set the narrative for an industry-changing AI company.  </li><li style=\"\">Shape the future of how people buy, sell, and invest in real estate.  </li></ul><p style=\"font-style: normal; font-variant-caps: normal; font-stretch: normal;  line-height: normal;   font-kerning: auto; font-variant-alternates: normal; font-variant-ligatures: normal; font-variant-numeric: normal; font-variant-east-asian: normal; font-variant-position: normal; font-variant-emoji: normal; font-feature-settings: normal; font-optical-sizing: auto; font-variation-settings: normal; color: rgb(0, 0, 0); min-height: 15px;\"><br></p><p style=\"font-style: normal; font-variant-caps: normal; font-stretch: normal;  line-height: normal;   font-kerning: auto; font-variant-alternates: normal; font-variant-ligatures: normal; font-variant-numeric: normal; font-variant-east-asian: normal; font-variant-position: normal; font-variant-emoji: normal; font-feature-settings: normal; font-optical-sizing: auto; font-variation-settings: normal; color: rgb(0, 0, 0);\"><strong>Compensation &amp; Perks: </strong> </p><p style=\"font-style: normal; font-variant-caps: normal; font-stretch: normal;  line-height: normal;   font-kerning: auto; font-variant-alternates: normal; font-variant-ligatures: normal; font-variant-numeric: normal; font-variant-east-asian: normal; font-variant-position: normal; font-variant-emoji: normal; font-feature-settings: normal; font-optical-sizing: auto; font-variation-settings: normal; color: rgb(0, 0, 0);\"></p><ul style=\"\"><li style=\"\">Base salary: $2K – $5K  </li><li style=\"\">Bonuses based on views &amp; engagement  </li><li style=\"\">Sales-based bonuses—your creativity drives revenue!  </li></ul><p style=\"font-style: normal; font-variant-caps: normal; font-stretch: normal;  line-height: normal;   font-kerning: auto; font-variant-alternates: normal; font-variant-ligatures: normal; font-variant-numeric: normal; font-variant-east-asian: normal; font-variant-position: normal; font-variant-emoji: normal; font-feature-settings: normal; font-optical-sizing: auto; font-variation-settings: normal; color: rgb(0, 0, 0); min-height: 15px;\"><br></p><p style=\"font-style: normal; font-variant-caps: normal; font-stretch: normal;  line-height: normal;   font-kerning: auto; font-variant-alternates: normal; font-variant-ligatures: normal; font-variant-numeric: normal; font-variant-east-asian: normal; font-variant-position: normal; font-variant-emoji: normal; font-feature-settings: normal; font-optical-sizing: auto; font-variation-settings: normal; color: rgb(0, 0, 0);\">We want someone with big, fresh ideas—so ditch the boring cover letter! Instead, send your best cases and a creative intro to <span style=\"color: #1f6bc0\">https://t.me/HE1GA</span></p><p style=\"font-style: normal; font-variant-caps: normal; font-stretch: normal;  line-height: normal;   font-kerning: auto; font-variant-alternates: normal; font-variant-ligatures: normal; font-variant-numeric: normal; font-variant-east-asian: normal; font-variant-position: normal; font-variant-emoji: normal; font-feature-settings: normal; font-optical-sizing: auto; font-variation-settings: normal; color: rgb(0, 0, 0); min-height: 15px;\"><br></p><p style=\"font-style: normal; font-variant-caps: normal; font-stretch: normal;  line-height: normal;   font-kerning: auto; font-variant-alternates: normal; font-variant-ligatures: normal; font-variant-numeric: normal; font-variant-east-asian: normal; font-variant-position: normal; font-variant-emoji: normal; font-feature-settings: normal; font-optical-sizing: auto; font-variation-settings: normal; color: rgb(0, 0, 0);\">Let’s build the future together!</p>\n<img src=\"https://remotive.com/job/track/1971888/blank.gif?source=public_api\" alt=\"\"/>","tags":"[\"video\",\"AI/ML\",\"themes\"]","pubDate":"2025-02-11T16:38:31.000Z","link":"https://remotive.com/remote-jobs/marketing/creative-director-1971888","slug":"creative-director-realiste-ai-2885"},{"id":6428711329,"title":"Product Owner","company":"BREEDJ","image":"https://remotive.com/job/1971682/logo","description":"<p>As a <strong>Product Owner</strong>, you’ll lead the development and continuous improvement of our AI-driven platform. You’ll work closely with developers, designers, and business stakeholders to enhance our matching algorithms, improve user engagement, and refine monetization strategies.</p>\n<div class=\"h3\"><strong>🔹 What You’ll Do</strong></div>\n<ul style=\"\">\n<li style=\"\">Define and communicate the product vision, roadmap, and priorities.</li>\n<li style=\"\">Gather insights from users, stakeholders, and market trends to shape new features.</li>\n<li style=\"\">Work with developers and AI specialists to improve matching algorithms and automation.</li>\n<li style=\"\">Optimize user experience, onboarding flows, and engagement strategies.</li>\n<li style=\"\">Set clear KPIs and measure the success of product initiatives.</li>\n<li style=\"\">Collaborate with marketing, sales, and operations teams to ensure alignment.</li>\n<li style=\"\">Stay ahead of industry trends and emerging AI technologies.</li>\n</ul>\n<div class=\"h3\"><strong>🎯 What We’re Looking For</strong></div>\n<ul style=\"\">\n<li style=\"\"><strong>Experience</strong>: 3+ years in Product Ownership, Product Management, or similar roles.</li>\n<li style=\"\"><strong>Marketplace Knowledge</strong>: Experience working with two-sided platforms (B2B or B2C).</li>\n<li style=\"\"><strong>AI &amp; Data-Driven Mindset</strong>: Familiarity with AI applications, data analytics, and automation.</li>\n<li style=\"\"><strong>Agile Methodology</strong>: Strong experience with Agile, Scrum, or Kanban frameworks.</li>\n<li style=\"\"><strong>Tech-Savvy</strong>: Understanding of APIs, UX principles, and software development processes.</li>\n<li style=\"\"><strong>Problem-Solver</strong>: Ability to prioritize, execute, and iterate quickly.</li>\n<li style=\"\"><strong>Communication Skills</strong>: Fluent in English, with strong stakeholder management skills.</li>\n</ul>\n<img src=\"https://remotive.com/job/track/1971682/blank.gif?source=public_api\" alt=\"\"/>","tags":"[\"api\",\"scrum\",\"UI/UX\",\"AI/ML\",\"agile\",\"automation\",\"product management\",\"analytics\",\"product owner\",\"onboarding\",\"marketplace\"]","pubDate":"2025-02-11T15:52:06.000Z","link":"https://remotive.com/remote-jobs/product/product-owner-1971682","slug":"product-owner-breedj-5091"},{"id":7484326637,"title":"Data Ops Analyst","company":"PEARL GmbH","image":"https://remotive.com/job/1970310/logo","description":"<p><strong>Hiring need</strong>: Data Entry Specialist</p>\n<p><strong>Hours per week</strong>: 40 per week</p>\n<p><strong>Expected Work Schedule:</strong> 6 days a week</p>\n<p><strong>Schedule</strong>: Monday to Friday, 9:00 AM to 6:00 PM PST</p>\n<p><strong>Time zone needed</strong>: PST</p>\n<p><strong>Holiday Adherence (UAE/UK/US/PH): US</strong></p>\n<p><strong>PTO Entitlement: 14 days</strong></p>\n<p> </p>\n<p><strong>About the company:<br></strong>A premier law firm specializing in personal injury cases, dedicated to advocating for individuals seeking justice and fair compensation. With a client-centered approach, the firm’s experienced legal team navigates complex cases with precision, integrity, and unwavering dedication. Emphasizing clear communication, empathy, and strategic advocacy, the firm upholds the highest ethical and professional standards to deliver exceptional legal representation.</p>\n<p> </p>\n<p><strong>Role Overview: Legal Data &amp; Automation Specialist</strong></p>\n<p>This role focuses on optimizing document management, automating workflows, and ensuring the accuracy of client records within the firm’s database. The ideal candidate will bring strong organizational skills, attention to detail, and the ability to streamline legal processes through automation and data management.</p>\n<p><strong>Key Responsibilities:</strong></p>\n<ul style=\"\">\n<li style=\"\"><strong>Automations &amp; Reporting</strong> – Develop and maintain reports to track case progress and documentation status.</li>\n<li style=\"\"><strong>Database Management</strong> – Organize, digitize, and maintain legal documents, ensuring accuracy in client records.</li>\n<li style=\"\"><strong>Workflow Optimization</strong> – Create standard operating procedures (SOPs) for improved efficiency in legal processes.</li>\n<li style=\"\"><strong>Tracker Development</strong> – Build and manage tracking systems to monitor case files and key legal documentation.</li>\n<li style=\"\"><strong>Data Accuracy</strong> – Verify and update client records, ensuring consistency across all platforms.</li>\n<li style=\"\"><strong>Technology &amp; Communication Integration</strong> – Assist in migrating communication and document-sharing processes to Slack.</li>\n<li style=\"\"><strong>Attorney Support</strong> – Retrieve, format, and manage client information for legal teams.</li>\n</ul>\n<p><strong>Immediate Priorities (Week 1):</strong></p>\n<ul style=\"\">\n<li style=\"\">Gain proficiency in the firm’s database and document management tools.</li>\n<li style=\"\">Organize and digitize backlogged case files for accurate data entry.</li>\n<li style=\"\">Collaborate with the legal team to understand documentation requirements and workflow processes.</li>\n</ul>\n<p><strong>Requirements</strong></p>\n<ul style=\"\">\n<li style=\"\">2+ years of experience in data operations, with a strong focus on automation and process optimization.</li>\n<li style=\"\">Proficiency in data management tools and automation platforms (e.g., Microsoft Excel, Google Sheets, CRMs, Python, SQL, Zapier, or similar workflow automation tools).</li>\n<li style=\"\">Exceptional attention to detail and ability to manage sensitive data with strict confidentiality.</li>\n<li style=\"\">Strong organizational and multitasking skills, with a proven ability to meet deadlines in fast-paced environments.</li>\n</ul>\n<p><strong>Preferred:</strong></p>\n<ul style=\"\">\n<li style=\"\">Experience in a legal, administrative, or compliance-driven setting.</li>\n<li style=\"\">Familiarity with legal terminology or prior work in a law firm.</li>\n<li style=\"\">Knowledge of case management systems like Clio or similar platforms.</li>\n</ul>\n<p><strong>Benefits</strong></p>\n<p> </p>\n<ul style=\"\">\n<li style=\"\">Fully Remote Work: Work from anywhere within the required time zones.</li>\n<li style=\"\">Dynamic Work Environment: Join a fast-growing startup with a collaborative team.</li>\n<li style=\"\">Flexible Hours: Enjoy flexibility in your schedule with occasional weekend availability.</li>\n<li style=\"\">Professional Development: Gain exposure to executive-level projects and opportunities for growth</li>\n<li style=\"\">Holiday Orientation: U.S. Based holidays</li>\n</ul>\n<p> </p>\n<p><br><br></p>\n<div class=\"h2\">About the company</div>\n<p> </p>\n<p>Pearl Talent is a US-based start-up that helps the <strong>top 1% of talent worldwide</strong> land long-term roles at fast-growing companies in the <strong>US</strong> and <strong>EU. </strong></p>\n<p>Founded by Monty Ngan and Isaac Kassab, Pearl Talent helps operators all around the Philippines, Latin America, and South Africa get staffed into companies backed by Y Combinator, Sequoia, a16z, General Catalyst, and more.</p>\n<p><strong><em>We believe that even though opportunity isn’t created equal in the world, ambitious talent is.</em></strong></p>\n<img src=\"https://remotive.com/job/track/1970310/blank.gif?source=public_api\" alt=\"\"/>","tags":"[\"sql\",\"automation\",\"google sheets\"]","pubDate":"2025-02-11T11:50:53.000Z","link":"https://remotive.com/remote-jobs/data/data-ops-analyst-1970310","slug":"data-ops-analyst-pearl-gmbh-880"}]