[{"id":6366792527,"title":"Field Engineering Manager - Cloud Technologies","company":"Canonical","image":"https://pbs.twimg.com/profile_images/1673959375340290050/x7pNtXQ7_400x400.jpg","description":"\n      <p>This is an opportunity to run a field engineering team, helping customers understand and implement Canonical's open source solutions in public clouds and in their own data centers. We work across the entire spectrum of cloud offerings, from Ubuntu itself to virtualisation and private cloud, Kubernetes, and the implementation of sophisticated open source solutions such as MLops platforms, data platforms and more. We are rapidly expanding the range of open source solutions we offer and deliver to customers, as we move into new industries like telco, finance, health care and media we design and develop new open source solutions to meet their needs.</p>\n<p>We believe that Engineering Managers should be outstanding engineers themselves. They should feel completely at home troubleshooting technical issues and having technical presales conversations with customers. They should contribute to project delivery themselves, but know that the technical contributions they bring are far less significant than their ability to shape the whole team’s direction, focus and delivery. We grow management skills and train engineers, who are interested in soft skills, to be managers.</p>\n<p>We believe that open source is just starting to transform the tech sector and enterprise compute. Our goal is to make open source easier, more reliable and more secure for deployment and development. We strive to be the provider of ‘most software to most companies’. To deliver on that ambition, our engineers are carefully selected from the applicants across the globe. We select for brilliance and motivation to take open source to the next level. Our engineering managers help teams achieve more than they realised they could, and feel proud of the result.</p>\n<p><strong>The role of a Cloud Field Engineering Manager at Canonical</strong></p>\n<p>The Field Engineering team is our team of cloud solutions architects at Canonical, working directly with our customers, designing private and public cloud solutions fitting their workload needs. The portfolio of products includes on-premise cloud solutions such as Openstack, MicroCloud and Ceph, and solutions that could be deployed either on-premises or in public clouds such as Kubernetes, Kubeflow, Spark, PostgreSQL, etc.&nbsp; The team works hands-on with the technologies by deploying, testing and handing over the solution to our support or managed services team at the end of a project. Managers and team members also take part in presales conversations to provide technical advice during the sales process.&nbsp;</p>\n<p>A Cloud Field Engineering Manager is responsible for line management and career guidance. The ability to develop engineering talent, to represent your team from a technical perspective, and to drive collaboration with other teams and customers are all critical to success in this role. You are also expected to actively participate in technical presales to help our department achieve our quarterly goals.</p>\n<p><strong>Location:&nbsp;</strong>This role will be home based, managing a team in your time zone.</p>\n<p><strong>What your day will look like</strong></p>\n<ul>\n<li>Lead and develop a team of engineers, ranging from graduate to senior</li>\n<li>Work remotely in a single major time zone</li>\n<li>Coach, mentor, and offer career development feedback</li>\n<li>Identify and measure team health indicators</li>\n<li>Implement disciplined engineering processes</li>\n<li>Represent your team and product to stakeholders, partners, and customers&nbsp;</li>\n<li>Develop and evangelise great engineering and organisational practices</li>\n<li>Plan and manage progress on agreed goals and projects</li>\n<li>Be an active part of the leadership team, collaborating with other leaders</li>\n</ul>\n<p><strong>What we are looking for in you</strong></p>\n<ul>\n<li>Knowledge of cloud computing concepts &amp; technologies, such as Kubernetes, Openstack, AWS, GCP, Azure, Ceph, etc.</li>\n<li>Practical knowledge of Linux and networking</li>\n<li>Experience in technical presales</li>\n<li>You are a dynamic person who loves to jump in new projects and interact with people</li>\n<li>Excellent verbal and written communication skills in English</li>\n<li>Passion and a track record of developing and growing people</li>\n<li>Experience in leading, coaching and mentoring engineers</li>\n<li>Organised and able to ensure your team delivers timely, high quality results</li>\n<li>&nbsp;An exceptional academic track record from high school and, preferably, university as well</li>\n<li>&nbsp;Willingness to travel up to 40% of the time. Field Engineers attend internal company events, external tech events and customer meetings.</li>\n</ul>\n<p><strong>Additional skills that you might also bring</strong></p>\n<ul>\n<li>Second language - Spanish/French/German/Arabic</li>\n<li>Python knowledge</li>\n<li>Experience collaborating with external partners</li>\n<li>Experience collaborating with several internal teams and providing stakeholder feedback for engineering roadmaps</li>\n</ul>\n<p><strong>What we offer you</strong></p>\n<p>We consider geographical location, experience, and performance in shaping compensation worldwide. We revisit compensation annually (and more often for graduates and associates) to ensure we recognise outstanding performance. In addition to base pay, we offer a performance-driven annual bonus. We provide all team members with additional benefits, which reflect our values and ideals. We balance our programs to meet local needs and ensure fairness globally.</p>\n<ul>\n<li>Distributed work environment with twice-yearly team sprints in person</li>\n<li>Personal learning and development budget of USD 2,000 per year</li>\n<li>Annual compensation review</li>\n<li>Recognition rewards</li>\n<li>Annual holiday leave</li>\n<li>Maternity and paternity leave</li>\n<li>Employee Assistance Programme</li>\n<li>Opportunity to travel to new locations to meet colleagues from your team and others</li>\n<li>Priority Pass for travel and travel upgrades for long haul company events</li>\n</ul>\n<p><strong>About Canonical</strong></p>\n<p>Canonical is a pioneering tech firm that is at the forefront of the global move to open source. As the company that publishes Ubuntu, one of the most important open source projects and the platform for AI, IoT and the cloud, we are changing the world on a daily basis. We recruit on a global basis and set a very high standard for people joining the company. We expect excellence - in order to succeed, we need to be the best at what we do.</p>\n<p>Canonical has been a remote-first company since its inception in 2004.​ Work at Canonical is a step into the future, and will challenge you to think differently, work smarter, learn new skills, and raise your game. Canonical provides a unique window into the world of 21st-century digital business.</p>\n<p><strong>Canonical is an equal opportunity employer</strong></p>\n<p>We are proud to foster a workplace free from discrimination. Diversity of experience, perspectives, and background create a better work environment and better products. <a href=\"https://canonical.com/careers/diversity/identity\">Whatever your identity, we will give your application fair consideration.</a></p>\n\n<p>#LI-remote&nbsp;</p>\n<p><br><br></p>\n    ","tags":"[\"postgres\",\"Finance\",\"management\",\"engineering\",\"aws\"]","pubDate":"2024-02-13 03:08:25.287","link":"https://canonical.com/careers/5516858","savedDate":"2024-02-13 03:08:25.287","slug":"field-engineering-manager-cloud-technologies-canonical-3024"},{"id":6568241766,"title":"Product Marketing Manager","company":"Instrumentl","image":"https://pbs.twimg.com/profile_images/1263546899153502209/ObHsQoNr_400x400.jpg","description":"<div class=\"section page-centered\" data-qa=\"job-description\"><div><b style=\"font-size: 18px\">Hello, we’re Instrumentl.</b></div><div><br></div><div><span style=\"font-size: 16px\">We’re a mission-driven startup helping the nonprofit sector to drive impact, and we’re well on our way to becoming the #1 most-loved grant discovery and management tool. To help us get there, we’re hiring an intellectually curious </span><b style=\"font-size: 16px\">Product Marketing Manager</b><span style=\"font-size: 16px\"> to shape product positioning, craft messaging, and drive various go-to-market initiatives. </span></div><div><br></div><div><span style=\"font-size: 16px\">Are you passionate about shaping and promoting SaaS products that truly make a difference in the world? Does developing strategic marketing plans to drive product demand and engagement excite you? If you have a flair for storytelling and a keen understanding of market dynamics, we have the perfect opportunity for you.</span></div><div><br></div><div><b style=\"font-size: 18px\">About us:</b></div><div><br></div><div><span style=\"font-size: 16px\">Instrumentl is a hypergrowth YC-backed startup with over 3,000 nonprofit clients, from local homeless shelters to larger organizations like the San Diego Zoo and the University of Alaska. We are building the future of fundraising automation, helping nonprofits to discover, track, and manage grants efficiently through our SaaS platform.</span></div><div><br></div><div><span style=\"font-size: 16px\">Our charts are dramatically up-and-to-the-right 📈 — we’re cash flow positive and doubling year-over-year, with customers who love us (NPS is 65+ and Ellis PMF survey is 60+). Join us on this rocket ship to Mars!</span></div><div><br></div><div><b style=\"font-size: 18px\">About the role: </b></div><div><br></div><div><span style=\"font-size: 16px\">As our Product Marketing Manager, you'll be at the forefront of defining and executing strategies that drive demand, adoption, and revenue growth. Through collaboration with cross-functional teams, you'll craft compelling messaging, conduct market research, and lead go-to-market (GTM) initiatives that resonate with our diverse customer base.</span></div><div><br></div><div><span style=\"font-size: 16px\">As a Growth team member, you'll work closely with: </span></div><div><br></div><div><span style=\"font-size: 16px\">- Will, Head of Growth</span></div><div><span style=\"font-size: 16px\">- Mia, Growth Strategist</span></div><div><span style=\"font-size: 16px\">- Ryan, Content Marketer</span></div><div><span style=\"font-size: 16px\">- Rachel, Events &amp; Community Manager</span></div><div><span style=\"font-size: 16px\">- Emily, Growth Product Designer</span></div><div><br></div><div><span style=\"font-size: 16px\">Get to know us at&nbsp;</span><a href=\"https://www.instrumentl.com/about\" style=\"font-size: 16px\" class=\"postings-link\">instrumentl.com/about</a><span style=\"font-size: 16px\">! We can’t wait to meet you.</span></div><div><br></div><div><span style=\"font-size: 16px\">We are fully distributed</span><b style=\"font-size: 16px\"> (read: no office!)</b><span style=\"font-size: 16px\">. For this position, we are looking for someone based in the continental US, but open to candidates who have substantial overlap with&nbsp;standard working hours in the Central Time Zone.&nbsp;</span></div></div><div class=\"section page-centered\"><div><h3>What you'll do:</h3><ul class=\"posting-requirements plain-list\"><ul><li>Revamp and operationalize Instrumentl's Ideal Customer Profile (ICP) and personas.</li><li>Leverage customer and market insights to inform product positioning and messaging.</li><li>Plan and execute GTM strategies, ensuring alignment across product, growth, marketing, sales, and customer success teams.</li><li>Communicate how Instrumentl solves specific problems or fulfills needs better than its competitors using written, visual, and video content</li><li>Analyze customer feedback to continuously refine our product and messaging.</li><li>Conduct thorough market research to understand our target audience, competition, and industry trends</li><li>Develop marketing collateral, product videos, and promotional materials</li><li>Establish a feedback loop between Growth &amp; Marketing and other departments to continuously improve product and marketing efforts</li></ul></ul></div></div><div class=\"section page-centered\"><div><h3>What we're looking for:</h3><ul class=\"posting-requirements plain-list\"><ul><li><b>5+ years of full-time work experience: </b>SaaS product marketing specific experience. You have a proven track record of impactful go-to-market strategies. &nbsp;We are prioritizing experienced hires.&nbsp;</li><li><b>Exceptional storytelling: a</b>bility to craft compelling narratives and messages that resonate with different target audiences</li><li><b>Strong business acumen</b>: you can answer unstructured business questions and interpret qualitative and quantitative data to drive projects to conclusion.&nbsp;</li><li><b>Excellent analytical skills</b>: you spot trends quickly, and are highly comfortable with tracking KPIs and forecasting future performance.</li><li><b>Clear communication</b>: you pride yourself on your ability to communicate complex topics easily in person (or on video) and in writing.&nbsp;</li><li><b>Effective execution</b>: you work efficiently, meet deadlines, stay organized, and have a reputation for being incredibly dependable. It pains you to miss a goal or milestone.&nbsp;&nbsp;</li><li><b>Resourcefulness</b>: you are able to conduct research and figure out solutions to new problems,&nbsp; given general direction and guidance.&nbsp;</li><li><b>Tech savviness:</b> you love using tools like G Suite, Zoom, Slack, <a href=\"http://Close.io\" class=\"postings-link\">Close.io</a>, and Canva. You’re a fan of shortcuts and can name your favorites off the top of your head.</li><li><b>Growth mindset: </b>you’re a self-motivated learner, and you welcome the chance to exchange constructive feedback with colleagues.&nbsp;</li><li><b>Friendly demeanor</b>: you are warm and approachable, easy to work with, and genuinely enjoy connecting with others.</li><li><b>Bonus: </b>experience working in early-stage startups and being comfortable (even thriving!) with ambiguity.</li><li><b>Bonus</b>: experience in the nonprofit sector, especially with grants.</li></ul></ul></div></div><div class=\"section page-centered\"><div><h3>Compensation &amp; Benefits</h3><ul class=\"posting-requirements plain-list\"><ul><li>Competitive salary and equity ($100,000 - $140,000/year)</li><li>100% covered health, dental, and vision insurance for employees (50% for dependents)</li><li>Generous PTO policy, including parental leave</li><li>401(k)</li><li>Company laptop + stipend to set up your home workstation</li><li>Company retreats for in-person time with your colleagues</li><li>Work with awesome nonprofits around the US! We partner with incredible organizations doing meaningful work, and you get to help power their success.</li></ul></ul></div></div><div class=\"section page-centered\" data-qa=\"salary-range\"><div>$100,000 - $140,000 a year</div></div><div class=\"section page-centered\" data-qa=\"closing-description\"><div><b style=\"font-size: 18px\">Why join Instrumentl?</b></div><div><br></div><div><span style=\"font-size: 16px\">Instrumentl is evolving rapidly. You’ll always have new challenges and opportunities to grow in your role here - you won’t be bored! You’ll be an early member of our small but mighty team, playing a huge part in shaping our culture for the years and teammates to come.</span></div><div><br></div><div><b style=\"font-size: 16px\">At Instrumentl:</b></div><div><br></div><div><span style=\"font-size: 16px\">- </span><b style=\"font-size: 16px\">We’re customer-focused.</b><span style=\"font-size: 16px\"> We routinely seek feedback from our customers to improve the Instrumentl experience for everyone. Our first company value is \"The customer is the hero\" and we mean it.</span></div><div><span style=\"font-size: 16px\">- </span><b style=\"font-size: 16px\">We love to experiment.</b><span style=\"font-size: 16px\"> Our team is constantly generating new concepts and iterating to see what works - ideation and experimentation are essential here. \"Bend the curve\" is another key company value.</span></div><div><span style=\"font-size: 16px\">- </span><b style=\"font-size: 16px\">We’re approachable and collaborative. </b><span style=\"font-size: 16px\">Everyone has a voice, and we’re all building Instrumentl together.</span></div><div><span style=\"font-size: 16px\">- </span><b style=\"font-size: 16px\">We kick it every day with some of the nicest people in the world.</b><span style=\"font-size: 16px\"> No joke, our customers are often on the front lines educating kids, saving endangered species, and restoring watersheds. In helping them take advantage of Instrumentl’s technology, you’re helping them move the world forward.</span></div><div><br></div><div><b style=\"font-size: 18px\">Ready to apply?</b></div><div><br></div><div><span style=\"font-size: 16px\">Using the 'Apply' button below, please submit the following materials:</span></div><div><br></div><div><span style=\"font-size: 16px\">1. A cover letter or a short Loom video addressing your past experience and 3 traits that make you an ideal candidate for the Product Marketing Manager role. Highlight specific examples! </span></div><div><br></div><div><span style=\"font-size: 16px\">2. A link to your portfolio or a selection of work samples.</span></div><div><br></div><div><span style=\"font-size: 16px\">3. Include the word</span><b style=\"font-size: 16px\"> avocados </b><span style=\"font-size: 16px\">in your response to show you read this from start to finish! </span></div><div><br></div><div><span style=\"font-size: 16px\">Along with your application materials, please attach your CV/resume.</span></div><div><br></div><div><i style=\"font-size: 16px\">At Instrumentl, we pride ourselves on building a diverse team from the ground up. Every role is an opportunity to teach, learn, and create some of your best work - if you’re excited to grow along with us, we encourage you to apply!</i></div></div><div class=\"section page-centered last-section-apply\" data-qa=\"btn-apply-bottom\"><a class=\"postings-btn template-btn-submit hex-color\" data-qa=\"show-page-apply\" href=\"https://jobs.lever.co/Instrumentl/bffaa961-6e78-4061-8b2c-8d830f5604c0/apply\">Apply for this job</a></div>","tags":"[\"management\",\"B2C\"]","pubDate":"2024-02-13 03:08:25.286","link":"https://jobs.lever.co/Instrumentl/bffaa961-6e78-4061-8b2c-8d830f5604c0","savedDate":"2024-02-13 03:08:25.286","slug":"product-marketing-manager-instrumentl-7943"},{"id":1211814218,"title":"WEB DESIGNER (Work from anywhere in the world)","company":"Wishpond","image":"https://scontent.fcmb4-2.fna.fbcdn.net/v/t39.30808-6/273499217_5218973671480777_3308731762242867065_n.jpg?_nc_cat=110&ccb=1-7&_nc_sid=efb6e6&_nc_ohc=YDi_Wd17RD8AX9wXcyR&_nc_zt=23&_nc_ht=scontent.fcmb4-2.fna&oh=00_AfB4sOOYpj6VyDSuvvuqhVnZbH22m89SqG99HwaOa-uslw&oe=65BE4336","description":"<div><b style=\"font-size: 18px\">Wishpond Technologies currently has the position of&nbsp;Web Designer available and we’re excited to tell you about it!</b></div><div><span style=\"font-size: 22px\">&nbsp;</span></div><div><b style=\"font-size: 24px\">OVERVIEW</b></div><div><span style=\"font-size: 16px\">We are searching for a Web Designer to join our team on a full-time basis.&nbsp; This is a fully remote position and the successful individual could be based anywhere in the world. You will work with an amazing remote team servicing and building&nbsp;relationships with&nbsp;clients based in the US and Canada.&nbsp;In collaboration with the Design Team and all departments, the&nbsp;Web Designer&nbsp;is responsible for the success of Wishpond Technologies Ltd.</span></div><div><span style=\"font-size: 22px\">&nbsp;</span></div><div><b style=\"font-size: 24px\">RESPONSIBILITIES</b></div><div>•<span style=\"font-size: 16px\">Creating a variety of marketing material, including websites, landing pages, email templates, and pop-ups.</span></div><div>•U<span style=\"font-size: 16px\">sing Wishpond's platform and front-end coding.</span></div><div>•<span style=\"font-size: 16px\">Designing graphic assets for branding and social media.</span></div><div>•<span style=\"font-size: 16px\">Working on WordPress and Shopify sites when required.</span></div><div>•<span style=\"font-size: 16px\">Collaborating with project managers and occasionally with clients directly.</span></div><div>•<span style=\"font-size: 16px\">Generating day-to-day small pieces of design for blogs, website pages, and software updates.</span></div><div>•Other duties as assigned.</div><div><br></div><div><b style=\"font-size: 24px\">QUALIFICATIONS</b></div><div>•<span style=\"font-size: 16px\">Extensive knowledge of HTML and CSS is required.</span></div><div>•<span style=\"font-size: 16px\">Experience with e-commerce and website creation platforms (Shopify and WordPress).</span></div><div>•<span style=\"font-size: 16px\">Solid experience in Web Design/Landing Page Design and Graphic Design.</span></div><div>•<span style=\"font-size: 16px\">JS, JQuery and PHP optional but sought after.</span></div><div>•<span style=\"font-size: 16px\">Proficiency in Adobe's creative suite, primarily Photoshop, Illustrator and Adobe Xd.</span></div><div>•<span style=\"font-size: 16px\">Good sense of contemporary design trends.</span></div><div>•<span style=\"font-size: 16px\">Knowledge of design theory (typography, colour theory etc.).</span></div><div>•<span style=\"font-size: 16px\">A degree or diploma that contributes to the organization or role is considered an asset.</span></div><div>•<span style=\"font-size: 16px\">Must be detail-oriented, creative and have a passion for helping others achieve their goals.</span></div><div>•<span style=\"font-size: 16px\">Self-motivated with the ability to establish and maintain solid relationships through a client-first mentality.&nbsp;</span></div><div>•<span style=\"font-size: 16px\">As part of a diverse team, ability to work both independently and collaboratively&nbsp;in a fast-paced, results-oriented environment.</span></div><div>•<span style=\"font-size: 16px\">Must be&nbsp;technical, analytical, and have the ability to manage&nbsp;complex projects seamlessly.</span></div><div>•<span style=\"font-size: 16px\">Organized, administratively strong,&nbsp;great time management, and have solid writing, phone, and general communication skills.</span></div><div>•<span style=\"font-size: 16px\">Fluent in English (spoken and written). Knowledge of a second language is considered an asset</span></div><div>•<span style=\"font-size: 16px\">Willing to participate in ongoing education and training for the role.</span></div><div><br></div><div><b style=\"font-size: 24px\">WORK ENVIRONMENT</b></div><div><span style=\"font-size: 16px\">• It is expected that the successful candidate will provide their own workstation, computer, and headset and have a fast and reliable internet connection.&nbsp;Certain roles will be required to utilize and or download company-approved software.</span></div><div><span style=\"font-size: 16px\">• The individual must be prepared to work standard business hours on EST or PST</span></div><div><span style=\"font-size: 16px\">• Due to the nature of this role, we may verify backgrounds, including conducting employment references, criminal record, and credit checks.</span></div><div><span style=\"font-size: 16px\">• Once hired, the successful candidate must provide a valid government-issued photo ID and proof of residential address as part of their onboarding process.</span></div><div><br></div><div><b style=\"font-size: 24px\">GREAT REASONS TO JOIN OUR TEAM!</b></div><div><span style=\"font-size: 16px\">• Fully remote position allowing you to </span><b style=\"font-size: 16px\">work from your home anywhere in the world!</b></div><div><span style=\"font-size: 16px\">• Exciting and dynamic environment with a great leadership team&nbsp;</span></div><div><span style=\"font-size: 16px\">• Comprehensive training program and regular performance reviews to facilitate your success</span></div><div><span style=\"font-size: 16px\">• Competitive compensation based on experience and proven abilities</span></div><div><span style=\"font-size: 16px\">• Great referral programs with incentives and bonuses</span></div><div><span style=\"font-size: 16px\">• Unbelievable product discounts when you use our products for your own business</span></div><div><span style=\"font-size: 16px\">• A global workforce of multi-cultural and talented colleagues&nbsp;</span></div><div><span style=\"font-size: 16px\">• A close-knit operation with amazing growth opportunities for your personal development</span></div><div><span style=\"font-size: 16px\">• A high growth SaaS technology company publicly traded on the TSX Venture Exchange</span></div><div><span style=\"font-size: 16px\">• Corporate headquarters in beautiful Vancouver, British Columbia, Canada</span></div><div><span style=\"font-size: 16px\">• Access to our education credits program and so much more !</span></div><div><br></div><div><b style=\"font-size: 24px\">ABOUT US</b></div><div><span style=\"font-size: 16px\">Founded in 2009, Wishpond is a rapidly growing technology company providing digital marketing solutions targeted at small businesses.&nbsp; The cloud-based platform includes landing pages, social promotions, website pop-ups, online forms, and lead activity tracking. Wishpond has a dedicated team of professional project managers, designers, copywriters, and developers who provide marketing services tailored to our individual clients.</span></div><div><span style=\"font-size: 16px\">&nbsp;</span></div><div><span style=\"font-size: 16px\">Wishpond serves over 3,000 customers in various industries and sizes, from startups to large Fortune 500 companies. Wishpond has a rapidly growing global headcount and continues to hire dedicated and qualified employees and contractors who have what it takes to scale a successful software company.</span></div><div><br></div><div><span style=\"font-size: 16px\">To learn more about Wishpond Technologies, please visit our website or any of our social media platforms:</span></div><div><br></div><div><span style=\"font-size: 16px\">• Website: </span><a href=\"http://www.wishpond.com/\" style=\"font-size: 16px\" class=\"postings-link\">www.wishpond.com</a></div><div><span style=\"font-size: 16px\">• Instagram: @wishpondofficial</span></div><div><span style=\"font-size: 16px\">• Twitter: Wishpond</span></div><div><span style=\"font-size: 16px\">• Youtube: Thewishpond</span></div><div><span style=\"font-size: 16px\">• LinkedIn: Wishpond</span></div><div><br></div><div><b style=\"font-size: 24px\">APPLICATION PROCESS</b></div><div><b>If you are interested in applying for this exciting opportunity, please provide an updated resume in English (PDF or Word formats only), quoting the position title in the subject line of your cover letter.</b></div><div>&nbsp;<b>&nbsp;</b></div><div>Wishpond Technologies is an equal-opportunity employer committed to hiring a diverse workforce and sustaining an inclusive culture that does not discriminate on the basis of disability, status, or any other basis protected under legislation</div><div>&nbsp;</div><div>We thank all applicants in advance for their interest in this position however, due to the volume of applications we receive, we are unable to respond to phone, email, or agency inquiries.</div><div><br></div>","tags":"[\"management\"]","pubDate":"2024-02-12 17:25:07.370","link":"https://jobs.lever.co/wishpond/73ccb930-87cf-490d-bf91-9c744c269b56","savedDate":"2024-02-13 03:08:25.288","slug":"web-designer-work-from-anywhere-in-the-world-wishpond-1139"},{"id":4739325482,"title":"Community Manager - Turkiye (Contractor)","company":"Scroll","image":"https://avatars.githubusercontent.com/u/87750292?s=200&v=4","description":"<div>Scroll has a remote-first work culture, our staff base is globally distributed and we are location agnostic. We make hiring decisions based on talent, culture fit and role suitability. If you have the skills and experience requested by this job description then please APPLY! </div><div><br></div><div>We are hiring the Community Manager for Turkiye to build and support a next-level community. We are looking for a talented Community Manager who excels in engaging and growing our community. You will be managing the social channels of Scroll Turkiye such as Twitter, Telegram and Discord with coordination of teams such as Coms, BD and DevRel. The role is ideal for an individual who thrives in a start-up environment, a self-starter that is dynamic and comfortable to take on responsibilities and can work effectively within a remote setup.</div><div><br></div><h3>Requirements</h3><li>Bachelor's or Master's degree or extensive experience in this area;</li><li>Proven track record of executing community management plans in previous jobs; You come from either a ambassador background or a community manager background;</li><li>Solid knowledge in different community-building methodologies to communicate effectively with our community across various platforms.</li><li>Great writing skills on socials and great translation skills for localization; You are able to not only to craft great messages but also address the nuances in tone of the messages.</li><li>Great experience in working with cross functional teams and being able to effectively communicate with stakeholders to understand their challenges and needs, build narratives;</li><li>Excellent executing skills including leading the community to successfully deliver the end result;</li><li>Excellent English skills in both written and speaking especially is a must for this role</li><li>Experience of planning and participating in both online and offline events in the Turkish crypto space</li><li>Great knowledge for L2 and Ethereum ecosystem for effective community management</li><li>Excellent onchain user knowledge to address and resolve customer concerns as part of serving the community</li>,<h3>About You</h3><li>You are a self-starter and ability to take ownership, well organised, self-disciplined and effective when working autonomously on tasks and projects;</li><li>You are responsive, collaborative and committed person with a high work ethic;</li><li>You are a high class communicator who can articulate their views succinctly on calls or asynchronously in globally distributed, remote teams;</li><li>You relish working in an agile start-up environment;</li><li>You are a great listener who understands when to listen first and engages well with colleagues;</li><li>You are a resilient, driven individual who is willing and able to continually develop and iterate to succeed;</li><li>This position is ideal for someone who is passionate about building and nurturing online communities, has a keen interest in the crypto space, and is eager to take on a dynamic and multifaceted role. If you are a natural communicator who loves connecting with people and organizing events, we would love to hear from you.</li>,<h3>About Scroll</h3><li>Scroll is building an open source, bytecode level compatible zkEVM layer 2 solution for Ethereum. Our mission is to scale Ethereum while maintaining our values of credible neutrality, open-ness, and execution.</li>,<h3>What We Offer</h3><li>A mission-led, collaborative culture</li><li>Opportunity to work with cutting edge technology and like-minded people who are contributing to the progression of Ethereum</li><li>Competitive salary package / generous paid time off </li><li>Home office set up </li><li>Private healthcare in selected countries</li><li>Scroll is proud to be an equal opportunity workplace. We are committed to equal employment opportunities regardless of race, color, ancestry, religion, sex, national origin, sexual orientation, age, citizenship, marital status, disability, gender identity, or Veteran status. If you have a disability or special need, please let us know and we'll do our best to accommodate.</li>","tags":"[\"management\"]","pubDate":"2024-02-12 15:42:31.740","link":"https://jobs.lever.co/ScrollFoundation/00d77a22-8712-4dc9-8163-deaa395143a8","savedDate":"2024-02-13 03:08:25.288","slug":"community-manager-turkiye-contractor-scroll-8044"},{"id":5449904579,"title":"Technical Director - Tools","company":"Crytek","image":"https://lever-client-logos.s3-us-west-2.amazonaws.com/2a61cdfd-29d3-4707-b965-c4527aa67d0c-1593500521772.png","description":"<div>Crytek is looking for an experienced and innovative technical director for tools development in the CRYENGINE team. You would guide the development and maintenance of production tools and development processes that enable the creation of high-quality games in collaboration with the engine and game teams. </div><div><br></div><div><b style=\"font-size: inherit\"><u>Relocation &amp; Remote Work</u></b></div><div><br></div><div><span style=\"font-size: inherit\">For this position, you have the following options:&nbsp;</span></div><div><br></div><div><span style=\"font-size: inherit\">1. Come to our modern headquarters in Frankfurt and receive an attractive relocation package and have access to all of our benefits.&nbsp;</span></div><div><span style=\"font-size: inherit\">2. Work remotely and visit our headquarters in Frankfurt on a regular basis. Details will be discussed during the recruitment process.&nbsp;&nbsp;</span></div><h3>Responsibilities</h3><li>Analyze Crytek's current use of internal and external development tools.</li><li>Improve production and development workflows to create a smooth streamlined pipeline.</li><li>Drive technical decisions and roadmap priorities for tools based on user and developer requirements.</li><li>Cooperate with stakeholders in games and engine to define and balance goals for short- and long-term technical direction.</li><li>Work with production staff and leads to scope tasks and requirements.</li><li>Provide technical guidance and direction for tools engineering to ensure quality, performance, usability and stability of pipelines              and workflows.</li><li>Keep up to date with the latest tool technology and investigate how  to use it to improve our engine.</li><li>Take time to participate hands-on in architecture and development.</li>,<h3>Requirements</h3><li>10+ years of experience as a software engineer for games or tools software.</li><li>3+ years of experience leading a team of software engineers.</li><li>Experience with multiple game engines.</li><li>In-depth understanding of asset creation workflows and their integration in game engine projects.</li><li>Experience in developing tools for content creation packages  such as Maya, Blender, Houdini etc.</li><li>Experience with Perforce version control software.</li><li>Experience with tools for creating graphical user interfaces and cross-platform applications.</li><li>Experience in debugging and troubleshooting complex technical issues.</li><li>Experience with technical architecture and design.</li><li>Good understanding of modern C++</li><li>Excellent communication and collaboration skills </li>,<h3>Pluses</h3><li>Experience with CRYENGINE.</li><li>Experience with scripting languages, visual scripting and entity entitent component system architecture.</li><li>Shipped AAA games on multiple hardware platforms, including Gen 9 consoles.</li><li>Shipped a live service game with a large number of concurrent users.</li><div><b style=\"font-size: 2.2rem\">What you can expect from us</b></div><div><br></div><div><b>Career Path&nbsp;</b></div><div>Your professional development is important to us, so we have laid out a career plan to help you progress towards your goals and objectives.&nbsp;</div><div>&nbsp;</div><div><b>Company Apartment&nbsp;</b></div><div>To help you get settled, we provide you with a fully furnished company apartment during your first three months in Frankfurt.*&nbsp;</div><div><span style=\"font-size: 11pt\">&nbsp;</span></div><div><b>Relocation&nbsp;Support&nbsp;</b></div><div>We offer a relocation budget and full coverage of flights to Frankfurt for you and your family.&nbsp;</div><div>You can expect extensive assistance with visa, work permits, and communication with authorities during the relocation process, as well as help settling into Germany (e.g. setting up appointments with banks, government agencies, schools, landlords, finding apartments etc.).*&nbsp;</div><div><b style=\"font-size: 11pt\">&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;</b></div><div><b>Public Transport Pass&nbsp;</b></div><div>Discover Frankfurt by bus, tram and metro – free of charge.*&nbsp;</div><div><span style=\"font-size: 11pt\">&nbsp;</span></div><div><b>Gym Card&nbsp;</b></div><div>A healthy body is a healthy mind. We offer a membership at the premium gym chain Fitness First in Germany. Work out, join group fitness classes, or relax in the wellness facilities.</div><div><span style=\"font-size: 11pt\">&nbsp;</span></div><div><b>International Environment&nbsp;</b></div><div>We truly embody diversity at Crytek. With employees from over 42 different countries, we define ourselves by our cultural diversity.&nbsp;</div><div>&nbsp;</div><div><b>German Classes&nbsp;</b></div><div>Understanding the local culture will make your stay abroad more enjoyable, and Crytek supports that by offering German language courses for you and your family.&nbsp;</div><div><span style=\"font-size: 11pt\">&nbsp;&nbsp;</span></div><div><b>Events</b></div><div>Join us on our exciting company events, including new starter breakfasts, summer and winter parties, our annual trip to Gamescom in Cologne, and many more!*&nbsp;</div><div>We are all gamers: stay connected and play games with your colleagues at our remote gaming parties.</div><div><span style=\"font-size: 11pt\">&nbsp; &nbsp;</span></div><div><b>Vacation Days&nbsp;</b></div><div>At our Frankfurt office you can enjoy 24 days of vacation per year, and every 2 years you get 1 more (up to a maximum of 28 days). You will also have on average 10 public holidays on top of the days you take off. If you are working from another country, local standards apply.</div><div><span style=\"font-size: 11pt\">&nbsp;&nbsp;</span></div><div>*only applicable to employees in Frankfurt.</div>","tags":"[\"engineering\"]","pubDate":"2024-02-12 14:26:36.051","link":"https://jobs.lever.co/crytek/bd87e6d2-b8b2-46b9-9391-ab754f045e01","savedDate":"2024-02-13 03:08:25.289","slug":"technical-director-tools-crytek-4029"},{"id":7142251557,"title":"Online Hungarian teacher","company":"Academia Europea International","image":"https://remotive.com/job/1888014/logo","description":"<p>We're looking for new teachers to join the oldest and most prestigious academy in the Americas. Experience is not necessary, we teach you how to teach under our methodology, work from the safety of your home and teach with Academia Europea with the largest educational community and from all over the world.<br><br>Languages: Hungarian<br><br></p>\n<p>Our virtual platform offers you a job and stable income. Our classes are every day from Monday to Friday at the same time!!!<br><br><span style=\"font-weight: 600; color: #000000; letter-spacing: 0.75px;\">An opportunity with us also includes:</span><br>CAREER ADVANCEMENT: Many opportunities will be available in the future for growth and movement into more senior positions.</p>\n<p> </p>\n<img src=\"https://remotive.com/job/track/1888014/blank.gif?source=public_api\" alt=\"\"/>","tags":"[\"teaching\"]","pubDate":"2024-02-11 19:45:39.000","link":"https://remotive.com/remote-jobs/all-others/online-hungarian-teacher-1888014","savedDate":"2024-02-13 03:08:25.282","slug":"online-hungarian-teacher-academia-europea-international-2322"},{"id":8278901119,"title":"Portuguese speaking IT recruiter (m/f/d)","company":"Transparent Hiring","image":"https://remotive.com/job/1895671/logo","description":"<p>Are you a skilled IT recruiter with a passion for technology? Do you have a proven track record of identifying and attracting top talent? We are seeking an <strong>IT recruiter (m/f/d)</strong> to join our team and help us continue to grow and thrive.</p>\n<div class=\"h2\">About us</div><p>Transparent Hiring changes people's lives by helping them find a job and relocate to well-developed countries with the highest quality of life in the world, and making this process as smooth as possible.</p>\n<p>We are an IT recruiting and relocation company specializing in hiring English-speaking IT talents for German companies and relocating them to Germany. We work with large established German enterprises as well as young and dynamic start-ups, hiring for a wide variety of tech roles. We help our candidates find a job in Germany, secure an attractive job offer, obtain a visa and relocate to Germany. We also support them extensively after relocation, making sure that everyone gets a smooth start in a new country and on a new job.</p>\n<p>Our headquarters are in Bavaria, Germany, our team is distributed from Portugal to Kazakhstan. We operate 100% remotely and accept candidates from anywhere, given that your working hours sufficiently overlap with ours.</p>\n<div class=\"h2\">About the role</div>\n<p>In this role, you will be responsible for identifying, attracting, and hiring top technology professionals for a variety of roles. This will involve understanding the specific staffing needs of our clients, finding qualified candidates, and supporting them along the application process.</p>\n<p>We look for someone who is as passionate as us about helping people find jobs and start a new life in a new country. If you want to shape the future of the small, but growing company, proactively contribute to the way we work, and grow together - you've found the right place.</p>\n<div class=\"h3\">Your responsibilities</div>\n<ul style=\"\"><li style=\"\">Screen and interview candidates to assess their skills, experience, and fit for the role</li><li style=\"\">Source candidates for positions that can't be closed with incoming job applications alone</li><li style=\"\">Provide guidance and support to candidates throughout the hiring process</li><li style=\"\">Coordinate job offers and negotiations with candidates</li><li style=\"\">Maintain accurate records and tracking metrics to measure the effectiveness of recruiting efforts</li><li style=\"\">Optimize recruiting processes and tools to improve efficiency</li><li style=\"\">Use social networks like Linkedin or Xing to promote the company and open roles</li></ul>\n<div class=\"h3\">Required qualifications</div>\n<ul style=\"\"><li style=\"\">Strong communication and interpersonal skills, ability to establish trust with people</li><li style=\"\">Experience as an IT recruiter in a staffing agency</li><li style=\"\">Good understanding of the technology industry</li><li style=\"\">Fluent English and Portuguese C1+</li><li style=\"\">Availability of 30-40 hours per week</li></ul>\n<div class=\"h3\">Benefits</div>\n<p>Want the flexibility of working from anywhere? Want to work with people that love and enjoy what they do? Join our young international team and become part of a friendly and collaborative environment, with zero bureaucracy, and quick decision-making. You will work directly with the founding team and get an opportunity to shape the company in its early days. We offer a competitive compensation package tailored to your needs, hiring for permanent employment as well as on a freelance basis.</p>\n<p>If you are a skilled IT recruiter with a passion for technology, we want to hear from you. Apply now to join our team and help us continue to grow and thrive.</p><img src=\"https://remotive.com/job/track/1895671/blank.gif?source=public_api\" alt=\"\"/>","tags":"[]","pubDate":"2024-02-11 17:20:55.000","link":"https://remotive.com/remote-jobs/hr/portuguese-speaking-it-recruiter-m-f-d-1895671","savedDate":"2024-02-13 03:08:25.282","slug":"portuguese-speaking-it-recruiter-m-f-d-transparent-hiring-4609"},{"id":6952681489,"title":"Front End Developer","company":"Coalition Technologies ","image":"https://remotive.com/job/1680495/logo","description":"<p class=\"h3\">WHY YOU SHOULD APPLY:</p>\n<p> </p>\n<p>Coalition Technologies is devoted to delivering clients the highest quality work while providing our team a fun, thriving, and innovative environment. Along with the opportunity for tremendous career growth and rapid advancement, CT offers:</p>\n<ul style=\"\">\n<li style=\"\">The most competitive profit-sharing bonus plan in the industry, paying up to 50% of company profits to full-time employees each month!</li>\n<li style=\"\">A highly competitive Paid Time Off plan, promoting quality work-life balance.</li>\n<li style=\"\">Subsidized gym memberships to help team members feel their best.</li>\n<li style=\"\">Medical, dental, vision, and life insurance packages for all US-based team members.</li>\n<li style=\"\">International Health Insurance Reimbursement Program for all international team members, a benefit unique to Coalition.</li>\n<li style=\"\">Device upgrade and learning reimbursement programs.</li>\n<li style=\"\">Motivating career development plans with clearly defined goals and rewards.</li>\n<li style=\"\">Additional job-specific incentives and bonuses.</li>\n</ul>\n<p>Plus, 100% of our team works remotely with the support of time tracking software. Our company culture specializes in supporting remote team members, and we’ve been doing so for more than a decade. CT welcomes your application, wherever in the world it's coming from!</p>\n<p class=\"h3\"> </p>\n<p class=\"h3\">YOU SHOULD HAVE:</p>\n<p> </p>\n<ul style=\"\">\n<li style=\"\">An expertise in HTML5, CSS3 and jQuery</li>\n<li style=\"\">A thorough understanding of cross-browser compatibility issues</li>\n<li style=\"\">Experience with media queries</li>\n<li style=\"\">A knowledge of CSS platforms such as Twitter’s Bootstrap</li>\n<li style=\"\">An ability to multi-task on multiple projects and tasks at the same time</li>\n<li style=\"\">Great attention to detail and be highly organized</li>\n<li style=\"\">A positive and upbeat attitude with the ability to learn quickly</li>\n<li style=\"\">Proficiency in PHP/MYSQL and AJAX (preferred)</li>\n<li style=\"\">Experience with WordPress, BigCommerce, Magento, and Shopify (preferred)</li>\n<li style=\"\">Excellent written and spoken English</li>\n<li style=\"\">The availability to work 40 hours per week from 9:00 am to 6:00 pm PST</li>\n<li style=\"\">The ability to adapt to a diverse and multicultural environment</li>\n<li style=\"\">Passion to build a startup</li>\n<li style=\"\">Reliable transportation if working in-house</li>\n<li style=\"\">A reliable workstation with a fast computer, microphone and speakers, reliable internet and power if working remotely</li>\n</ul>\n<p class=\"h3\"> </p>\n<p class=\"h3\">YOUR DUTIES AND TASKS:</p>\n<p> </p>\n<ul style=\"\">\n<li style=\"\">Transforming complex layout PSDs into pixel-perfect presentation-layer HTML5/CSS3 templates</li>\n<li style=\"\">Creating responsive website designs</li>\n<li style=\"\">Building websites with WordPress, extending and developing plugins and themes</li>\n<li style=\"\">Working with Photoshop, Illustrator, and Fireworks to create images optimized for the web</li>\n<li style=\"\">Working with version control systems such as GIT / SVN</li>\n<li style=\"\">Working under tight deadlines</li>\n<li style=\"\">Handling multiple projects at the same time</li>\n<li style=\"\">Producing high quality of work with a strong focus on detail</li>\n</ul>\n<p class=\"h5\"> </p>\n<p class=\"h5\">We are looking for talented and diligent candidates who excel in our skills tests, and will consider these candidates even if past experience or educational background criteria aren't met.</p><p class=\"h5\"><br></p><p>*California, New York, Washington, and Colorado: starting base pay for this position ranges between $15 - $35 per hour.</p>\n<p>Compensation may vary based on factors such as experience, \r\nqualifications, skills test performance, geographic location, and \r\nseniority of the position offered. Outside of California, New York, \r\nWashington, and Colorado compensation may fall outside the above ranges.</p>\n<img src=\"https://remotive.com/job/track/1680495/blank.gif?source=public_api\" alt=\"\"/>","tags":"[\"CSS\",\"excel\",\"frontend\",\"git\",\"html\",\"illustrator\",\"magento\",\"photoshop\",\"php\",\"shopify\",\"wordpress\",\"MySQL\",\"startup\",\"responsive\",\"themes\",\"bootstrap\",\"insurance\",\"jQuery\",\"Ajax\"]","pubDate":"2024-02-11 15:01:17.000","link":"https://remotive.com/remote-jobs/software-dev/front-end-developer-1680495","savedDate":"2024-02-13 03:08:25.284","slug":"front-end-developer-coalition-technologies-7207"},{"id":7581486242,"title":"HR Manager (Singapore)","company":"Airalo","image":"https://lever-client-logos.s3.us-west-2.amazonaws.com/55028a36-609c-479c-9553-d4689ff2dd8c-1669620566663.png","description":"<div><b>About Airalo</b></div><div>Alo! Airalo is the world’s first eSIM store that helps people connect in over 200+ countries and regions across the globe. We are building the next digital service that revolutionizes the telecom industry. We are a travel-tech company and an equal-opportunity environment that values and executes diversity, inclusion, and equity. Our team is spread across 40+ countries and six continents. What glues us together is our commitment to changing the way you connect<span style=\"font-size: 13.3333px\">. </span></div><div><br></div><div><b>About you</b></div><div>We hope that you care deeply about the quality of your work, the intrinsic worth of tasks, and the success of your team. You are self-disciplined and do not require micromanagement in terms of your skillset and work ethic. You do your best to flourish as an individual every day while working hard to foster a collaborative team environment. You believe in the importance of being — and staying — authentic, honest, positive, and kind. You are a good interlocutor with clear and concise communication. You are able to manage multiple projects, have an analytical mind, pay keen attention to detail, and love to get your hands dirty. You are cognizant, tolerant, and welcoming of vulnerabilities and cultural differences.</div><div><br></div><div><b>About the Role</b></div><div><b>Position</b>: Full-time / Employee</div><div><b>Location:</b>&nbsp;Remote-first </div><div><b>Benefits:</b>&nbsp;Health Insurance, work-from-anywhere stipend, annual wellness &amp; learning credits, annual all-expenses-paid company retreat in a gorgeous destination &amp; other benefits</div><div><br></div><div>As an <b>HR Manager</b>, you will be responsible for all day-to-day people-partnering matters within your tribe and be a key driver for change &amp; operational excellence, aligning business &amp; people strategies to develop a pleasant, rewarding &amp; high-performance culture within Airalo. You’ll be working closely with our founders, C-level executives, VPs &amp; Directors of your assigned tribe, as well as the entire People &amp; Talent team.&nbsp;</div><h3>Responsibilities include but are not limited to:</h3><li>Drive Airalo’s global HR strategy in close collaboration with the VP, People, Director of People Operations, department heads &amp; key stakeholders;</li><li>Support with yearly Headcount Planning &amp; Forecasts with the People Director, Talent, and Hiring Managers;</li><li>Assists senior management in the development of solutions for current and future business needs through employee development, organizational development, cultural and process-oriented perspectives;</li><li>Offer an optimal, welcoming &amp; automated onboarding experience to all our staff. Work with our partners to establish employment contracts for all our new joiners, ensuring full compliance with local regulations;</li><li>Documentation: Centralize &amp; maintain all employees’ personal &amp; professional information/documentation on various HCM tools &amp; systems;</li><li>Reporting: Provide regular &amp; metrics to your tribe managers: Performance, Employee Engagement, Pulse Study, Employee Retention, etc;</li><li>L&amp;D: Act as an integral consultant &amp; train your tribe leaders &amp; managers on best management practices, performance management, labor regulations, etc;</li><li>Conflict Management: consult with employees &amp; managers to address &amp; resolve the root causes of any human resources issues objectively &amp; impartially;</li><li>Participates in company-wide programs &amp; initiatives (ie. salary review, workforce planning, organizational change, ESOP, C&amp;B, etc).</li>,<h3>Must-haves:</h3><li>Bachelor’s degree in human resources, business administration, or similar relevant field &amp; a minimum of 4 years of experience in HR business partnering role;</li><li>Proven experience in taking charge of projects and guiding them to successful completion;</li><li>Possesses strong leadership skills and is resilient;</li><li>Possesses strong customer-centric skills with a passion for service, ensuring all our interactions with people are handled professionally and with thorough attention to detail;</li><li>Proven experience in strategic HR plans and solutions, dealing with organization strategies and complex business/HR-related topics;</li><li>Strong stakeholder management, interpersonal, and communication skills with all levels of seniority in a cross-functional &amp; global environment;</li><li>Effective &amp; analytical mindset, creative and pragmatic problem-solving skills with strong business acumen &amp; user-centric philosophy;</li><li>Self-driven, optimistic, and keen to work as part of a professional and closely-knit team while highly organized with excellent time management skills;</li><li>Experience with HRIS, HCM &amp; other tools, ensuring the highest level of confidentiality &amp; accuracy on personal &amp; professional information.</li>,<h3>Good to have:</h3><li>Experience in the travel tech and/or telco industry;</li><li>Relevant HR certifications (iHRP, CIPD, SHRM, etc);</li><li>Additional written/spoken languages.</li><div><i>We sincerely thank all applicants in advance for submitting their interest in this opportunity with Airalo. </i></div>","tags":"[\"management\"]","pubDate":"2024-01-24 14:28:16.828","link":"https://jobs.lever.co/airalo/4329e822-4566-41c9-87f9-d52dabbff1f0","savedDate":"2024-02-13 03:08:25.288","slug":"hr-manager-singapore-airalo-5742"}]