[{"id":7471710181,"title":"Business Developer (Crypto Wallet)","company":"Status","image":"https://avatars.githubusercontent.com/u/11767950?s=200&v=4","description":"\n    <div class=\"content-intro\"><p style=\"text-align: justify;\"><strong>About Status</strong></p>\n<p style=\"text-align: justify;\"><span style=\"font-weight: 400;\">Status is building the tools and infrastructure for the advancement of a secure, private, and open web3.&nbsp;</span></p>\n<p style=\"text-align: justify;\"><span style=\"font-weight: 400;\">With the high level goals of preserving the right to privacy, mitigating the risk of censorship, and promoting economic trade in a transparent, open manner, Status is building a community where anyone is welcome to join and contribute.</span></p>\n<p style=\"text-align: justify;\"><span style=\"font-weight: 400;\">As an organization, Status seeks to push the web3 ecosystem forward through research, creation of developer tools, and support of the open source community.&nbsp;</span></p>\n<p style=\"text-align: justify;\"><span style=\"font-weight: 400;\">As a product, Status is an open source, Ethereum-based app that gives users the power to chat, transact, and access a revolutionary world of Apps on the decentralized web. But Status is also building foundational infrastructure for the whole Ethereum ecosystem, including the Nimbus ETH 1.0 and 2.0 clients, the Keycard hardware wallet, and the Waku messaging protocol, the p2p communication layer for Web3.</span></p>\n<p style=\"text-align: justify;\"><span style=\"font-weight: 400;\">As a team, Status has been completely distributed since inception. Our team is currently 200+ core contributors strong, and welcomes a growing number of community members from all walks of life, scattered all around the globe.&nbsp;</span></p>\n<p style=\"text-align: justify;\"><span style=\"font-weight: 400;\">We care deeply about open source, and our organizational structure has minimal hierarchy and no fixed work hours. We believe in working with a high degree of autonomy while supporting the organization's priorities.</span></p></div>\n\n    <div class=\"careers-block__trix external-panel text-left\">\n<div>\n<p><strong>The project:</strong></p>\n<p><a href=\"https://keycard.tech/\">https://keycard.tech/</a></p>\n<p>As the Business Development and Marketing Lead for ‘Keycard’ at Status Network, your primary role will be to lead the commercial planning and execution of the strategy to increase the sales of Keycard product, establish partnerships for the upcoming Keycard Pro product, and work with the comms and marketing teams to execute well-planned campaigns to achieve the sales growth objectives.</p>\n<p>This position offers a unique opportunity to lead the business development efforts for one of the fastest-growing segments in Web3 and work on exciting new Wallet and custody products. You will be at the forefront of developing a hardware wallet product that complements other wallets and integrates social and financial dapps deeply, paving the way for a new era of on-chain economic exchange.</p>\n<p>If you are driven by innovation in blockchain technology, eager to lead a cutting-edge project, and passionate about decentralisation and privacy, this role will provide you with the perfect platform to make a significant impact.</p>\n<p>&nbsp;</p>\n<p><strong>Key responsibilities:</strong></p>\n<ul>\n<li>Lead the accelerated development of a business development and marketing plan for Keycard and Keycard Pro products.&nbsp;</li>\n<li>Lead the execution of the plans and be the single point of contact for the program lead for all Business development and marketing initiatives related to Keycard.&nbsp;</li>\n<li>Lead the efforts to identify and prioritise potential partners including DeFi Apps, other software wallets, Developers, Exchanges etc. to improve their understanding of Keycard offer.</li>\n<li>Oversee end-to-end partnership and integration process from initial outreach and engagement through to negotiation, contracting, and final execution, ensuring all partnerships contribute to improving the sales potential for Keycard and improving the market share of Keycard amongst wallets.&nbsp;</li>\n<li>Conduct thorough financial analysis and due diligence on all potential deals to ensure they are not only sustainable but demonstrate the potential to scale.&nbsp;</li>\n<li>Shape the objectives of new marketing campaigns, and coordinate with communications and marketing teams to plan resources and execution of these campaigns, and report on the success measures.&nbsp;</li>\n<li>Oversee the negotiation and management of contracts with existing and potential partners to maximize benefits and ensure compliance with agreed terms.</li>\n<li>Keep internal stakeholders well-informed about the status of deals and partnerships, ensuring transparent and effective communication to facilitate informed decision-making and cohesive strategic alignment.</li>\n<li>Cultivate and nurture strong, enduring relationships with key stakeholders across the blockchain ecosystem, leveraging these relationships to support mutual growth and advance shared objectives.</li>\n<li>Assist in hiring, mentoring, and scaling a top-tier business development and partnerships team capable of meeting the ambitious goals of the network; fostering a culture of innovation and excellence.</li>\n</ul>\n<p>&nbsp;</p>\n<p><strong>You will ideally have:</strong></p>\n<ul>\n<li>5+ years of experience in leading partnerships and customer engagement for products within the tech industry, with a proven ability to manage and grow B2B relationships.&nbsp;</li>\n<li>Natural communicator and coordinator, adept at collaborating with cross-functional teams to achieve organisational goals.&nbsp;</li>\n<li>Comprehensive understanding of blockchain technology, wallets and wallet-related products and DeFi.&nbsp;</li>\n<li>Direct and proven experience in delivering partnerships in the DeFi ecosystem and with Wallets and (non-custodial, custodial, browser extensions, hardware wallets, web3 connectors for dApps, wallet connect type of connectors for dApps, smart-contract wallets etc.)</li>\n<li>Strong alignment with our organisational principles as outlined in our<a href=\"https://status.app/manifesto\"> manifesto</a>, demonstrating a commitment to privacy, decentralisation, and innovation.&nbsp;</li>\n<li>Skilled in conducting financial analysis and strategic planning, ensuring partnerships enhance key performance metrics and align with long-term objectives.&nbsp;</li>\n</ul>\n<p>&nbsp;</p>\n<p><strong>Bonus points:</strong></p>\n<ul>\n<li>Previous leadership roles or similar responsibilities with other Hardware wallets (and/or Software wallets).&nbsp;</li>\n<li>Comfort with remote and asynchronous work environments.</li>\n<li>Advocate for the crypto/blockchain community and the broader ethos of open-source contribution.</li>\n<li>Enthusiasm for decentralisation and a personal drive to promote censorship resistance within the crypto space.&nbsp;</li>\n</ul>\n<p>[Don’t worry if you don’t meet all of these criteria, we’d still love to hear from you anyway if you think you’d be a great fit for this role. Just explain to us why in your cover letter]</p>\n<p>&nbsp;</p>\n<p><strong>Hiring process:</strong></p>\n<ul>\n<li>Intro call with the Talent Team</li>\n<li>Interview with IFT BD Lead&nbsp;</li>\n<li>Compensated Task&nbsp;</li>\n<li>Pitch Interview with Keycard Lead and IFT BD Lead</li>\n<li>Interview with Co-Founder</li>\n</ul>\n<p>[The steps may change along the way if we see it makes sense to adapt the interview stages, so please consider the above as a guideline]</p>\n<p>&nbsp;</p>\n<p><strong>Compensation:</strong></p>\n<p>The compensation range for this role is dependent on how we assess your skills and experience throughout our interview process. We are happy to pay in any mix of fiat/crypto.</p>\n</div>\n<p>&nbsp;</p>\n</div>\n\n    \n\n    \n","tags":"[\"management\",\"B2B\"]","pubDate":"2024-10-04 05:05:20.687","link":"https://boards.greenhouse.io/embed/job_app?for=status72&token=6296621&b=https%3A%2F%2Fjobs.status.im%2F","savedDate":"2024-10-04 05:05:20.687","slug":"business-developer-crypto-wallet-status-9316"},{"id":2263899184,"title":"System Software Engineer - GCC/LLVM compiler, tooling, and ecosystem","company":"Canonical","image":"https://pbs.twimg.com/profile_images/1673959375340290050/x7pNtXQ7_400x400.jpg","description":"\n      <p>We are building a team to focus on the modern C and C++ programming language and their ecosystem on Ubuntu. They will deliver the best possible GCC and LLVM runtimes, developer experience and supporting tooling in Ubuntu. They will&nbsp; ensure that the cutting edge of modern programming languages innovation is available to Ubuntu users, to lay the foundation for future inventions and open source communities.</p>\n<p>This is an exciting opportunity for a software engineer with a hard core passion for compilers, runtimes and tool chains. You will have excellent competencies in modern C/C++, Linux distributions, software architectures and&nbsp; open source software.&nbsp; Come build a rewarding, meaningful career working with the best and brightest people in open source technology at Canonical, a growing international software company and make Ubuntu the best operating system to develop and run C/C++ applications in the cloud, in datacenters, in containers, directly on the operating system, and anywhere Ubuntu can run.</p>\n<p>The Ubuntu Foundations Team delivers the core Ubuntu system, the base for the entire Ubuntu family of products and services. Ubuntu strives to deliver the latest-best free software components, in an easy to use and highly reliable form. We build on the technical excellence of keystone open source software like GNU and Debian and bring additional focus and shape to the solutions we offer the industry.</p>\n<p>Part of the Ubuntu Foundations team, you will work on one of the most critical toolchains involved in the making of Ubuntu and the &nbsp; pillars of the modern software ecosystem. You will leverage your competencies&nbsp; and experience&nbsp; in C, C++ to make Ubuntu the best platform to develop, distribute and consume software built with GCC and LLVM. You will be passionate about the future of C, C++, of Ubuntu, mindful of the dynamics of the open-source ecosystem, and equally aware of the needs of large but innovative organizations. You will drive the best in class integration in Ubuntu from desktop to cloud in a secure, reliable, performing, efficient and future-proof fashion.</p>\n<p>You will be discussing design with other team members , mentor less senior engineers, and participate in code reviews and design reviews.&nbsp; You will also be working with other teams to ensure architecture decisions improve the overall performance and experience of Ubuntu. Your role as part of the Ubuntu Foundations team will have an impact on every aspect of Ubuntu from Desktop, Server, Ubuntu Core and also cloud images.</p>\n<h3>What you will do</h3>\n<ul>\n<li>Collaborate proactively with a distributed team</li>\n<li>Select, integrate and package best-of-breed tooling with Ubuntu to improve developer and operator experience with GCC and LLVM</li>\n<li>Write high-quality code to create new features</li>\n<li>Debug issues and produce high-quality code to fix them</li>\n<li>Review code produced by other engineers</li>\n<li>Discuss ideas and collaborate on finding good solutions</li>\n<li>Work from home with global travel 2 to 4 weeks a year for internal and external events</li>\n</ul>\n<h3>Who you are</h3>\n<ul>\n<li>You love technology and working with brilliant people</li>\n<li>You are passionate, curious, flexible, articulate, and accountable</li>\n<li>You are a long-time Linux user</li>\n<li>You have experience in packaging software for Debian and Ubuntu</li>\n<li>You have relevant GCC or LLVM experience, ideally in the world of cloud-native software and Linux</li>\n<li>You have a Bachelors or equivalent in Computer Science, STEM or similar degree</li>\n<li>You value soft skills and are passionate, enterprising, thoughtful, and self-motivated</li>\n</ul>\n<p>Canonical is a growing international software company that works with the open-source community to deliver Ubuntu, the world’s best free software platform. Our services help businesses worldwide reduce costs, improve efficiency and enhance security with Ubuntu.</p>\n<p><em>We are proud to foster a workplace free from discrimination. Diversity of experience, perspectives, and background create a better work environment and better products. Whatever your <a href=\"https://canonical.com/careers/diversity/identity\">identity</a> we will give your application fair consideration.</em></p>\n<p>#LI-remote</p><p>Requisition ID: 933</p><p></p>\n    ","tags":"[]","pubDate":"2024-10-04 05:05:20.687","link":"https://canonical.com/careers/6302748","savedDate":"2024-10-04 05:05:20.687","slug":"system-software-engineer-gcc-llvm-compiler-tooling-and-ecosystem-canonical-531"},{"id":4252520752,"title":"Chief Security Officer (CSO) (worldwide remote, work anywhere)","company":"CloudLinux","image":"https://pbs.twimg.com/profile_images/696718028084482050/ymY3OEPk_400x400.png","description":"<p>CloudLinux is a global remote-first company. We are driven by our principles: do the right thing, employees first, we are remote first, and we deliver high volume, low-cost Linux infrastructure and security products that help companies to increase the efficiency of their operations. Every person on our team supports each other and does what we can to ensure we all are successful. We are truly a great place to work.</p><p>Check out our website for more information <a href=\"https://cloudlinux.com/\" rel=\"nofollow noreferrer noopener\" class=\"external\">https://cloudlinux.com/</a></p><p>We are looking for a Chief Security Officer (CSO) who will lead the technical implementation of security measures across the company's infrastructure and software products. This role requires a deep understanding of security architecture, hands-on implementation, and operational security, and will be central in driving technical decisions that protect the company’s assets.</p><p></p><p><strong>Key Responsibilities:</strong></p><ul> <li>Provide strategic leadership of the CloudLinux information security program and team. Promote collaborative, effective security working relationships across CloudLinux</li> <li>Perform necessary actions to strengthen the current security environment</li> <li>Take reasonable steps to guard against loss or compromise of the company's critical, valuable, and sensitive information and to effectively detect, respond to, and recover from information security incidents</li> <li>Support a team of highly capable engineers that help product and infrastructure keep their code free from security bugs. Partner with engineering leaders across the company to help them prioritize security issues in their products and balance business goals</li> <li>Interact directly with the security community regarding vulnerabilities and threats. Analyze, assess, and respond to various internet threats</li> <li>Keep CloudLinux safe through active operation and defense of critical network infrastructure</li> </ul><h3>Requirements: </h3><p><strong>To thrive in this role, we are looking for someone who has:</strong></p><ul> <li>5+ years of experience in information security</li> <li>In-depth understanding of Linux/UNIX based systems</li> <li>Solid understanding of programming languages such as C, PHP, Python, Golang, etc.</li> <li>Strong understanding of network security and commonly used protocols</li> <li>Proven experience leading a security team, or demonstrated ability to lead and collaborate with cross-functional teams</li> <li>Experience in security research and hands-on penetration testing</li> <li>Strong communication skills in English</li> </ul><p></p><p></p><p><strong>Personal Qualities:</strong></p><ul> <li>Strong problem-solving skills and attention to detail</li> <li>Excellent communication skills</li> <li>Ability to work under pressure and maintain a positive attitude</li> <li>Strong organizational skills and ability to manage multiple tasks simultaneously</li> <li>Critical thinking and commitment to high-quality standards</li> <li>High level of initiative and ability to work independently while being a team player</li> </ul><p></p><h3>Benefits: </h3><p><strong>What's in it for you?</strong></p><ul> <li>A focus on professional development</li> <li>Interesting and challenging projects</li> <li>Fully remote work with flexible working hours, that allows you to schedule your day and work from any location worldwide</li> <li>Paid 24 days of vacation per year, 10 days of national holidays, and unlimited sick leaves</li> <li>Compensation for private medical insurance</li> <li>Co-working and gym/sports reimbursement</li> <li>Budget for education</li> <li>The opportunity to receive a reward for the most innovative idea that the company can patent</li> </ul><p><br><br></p><p>By applying for this position, you agree with the Cloudlinux Privacy Policy - <a href=\"https://cloudlinux.com/privacy-policy\" rel=\"nofollow noreferrer noopener\" class=\"external\">https://cloudlinux.com/privacy-policy</a> - and give us your consent to maintain and process your personal data in this respect. Please read our Privacy Policy for more information.</p><p></p>","tags":"[\"engineering\"]","pubDate":"2024-10-02 00:00:00.000","link":"https://apply.workable.com/cloudlinux-1/j/A890F7A03C","savedDate":"2024-10-04 05:05:20.687","slug":"chief-security-officer-cso-worldwide-remote-work-anywhere-cloudlinux-9443"},{"id":2138736904,"title":"Senior Accounts Payable Specialist","company":"Airalo","image":"https://lever-client-logos.s3.us-west-2.amazonaws.com/55028a36-609c-479c-9553-d4689ff2dd8c-1669620566663.png","description":"<div><b>About Airalo</b></div><div>Alo! Airalo is the world’s first eSIM store that helps people connect in over 200+ countries and regions across the globe. We are building the next digital service that revolutionizes the telecom industry. We are a travel-tech company and an equal-opportunity environment that values and executes diversity, inclusion, and equity. Our team is spread across 50+ countries and six continents. What glues us together is our commitment to changing the way you connect<span style=\"font-size: 13.3333px\">. </span></div><div><br></div><div><b>About you</b></div><div>We hope that you care deeply about the quality of your work, the intrinsic worth of tasks, and the success of your team. You are self-disciplined and do not require micromanagement in terms of your skillset and work ethic. You do your best to flourish as an individual every day while working hard to foster a collaborative team environment. You believe in the importance of being — and staying — authentic, honest, positive, and kind. You are a good interlocutor with clear and concise communication. You are able to manage multiple projects, have an analytical mind, pay keen attention to detail, and love to get your hands dirty. You are cognizant, tolerant, and welcoming of vulnerabilities and cultural differences.</div><div><br></div><div><b>About the Role</b></div><div><b>Position</b>: Full-time / Employee</div><div><b>Location:</b>&nbsp;Remote-first </div><div><b>Benefits:</b>&nbsp;Health Insurance, work-from-anywhere stipend, annual wellness &amp; learning credits, annual all-expenses-paid company retreat in a gorgeous destination &amp; other benefits</div><div><br></div><div><span style=\"font-size: 11pt;\">You will be overseeing the accounts payable process, ensuring accurate and timely processing of invoices, managing vendors, and maintaining compliance with company policies and procedures. You possess strong organizational skills, exceptional attention to detail, and a proven track record of effectively managing a high-volume accounts payable function.</span></div><h3>Responsibilities include but are not limited to:</h3><li>Oversee the end-to-end accounts payable process, including the accurate and timely processing of invoices</li><li>Establish and maintain positive relationships with vendors, addressing inquiries and discrepancies, resolving payment issues, and negotiating favorable payment terms</li><li>Continuously assess and enhance accounts payable processes, identifying opportunities for automation, streamlining workflows, and implementing best practices to optimize efficiency</li><li>Implement and maintain strong internal controls and ensure compliance with company policies and relevant regulations</li><li>Conduct analysis related to accounts payable metrics, cash flow, aging reports, and vendor performance</li><li>Collaborate cross-functionally with procurement, finance, and other departments to ensure seamless communication, accurate data sharing, and efficient invoice processing</li><li>Own the month-end and year-end closing processes for accounts payable, reconciling accounts, preparing accruals, and providing accurate financial data to support reporting requirements</li>,<h3>Must Haves:</h3><li>5+ years in managing accounts payable processes</li><li>Bachelor's degree in Accounting, Finance, or a related field</li><li>Prior work experience in telecommunications is an advantage</li><li>Understanding of generally accepted accounting principles (GAAP) and accounts payable best practices</li><li>Proficiency in accounting software and ERP systemsExcellent communication and interpersonal skills</li><li>Analytical mindset with the ability to identify process inefficiencies and implement solutions</li><li>Detail-oriented with strong organizational and time management skills</li><li>Strong problem-solving skills and the ability to work well under pressure</li><li>High level of integrity and ethical conduct in handling confidential financial information</li><div><span style=\"font-size: 11pt;\">If you are interested in this position, please apply via the link.</span></div><div><br></div><div>We sincerely thank all applicants in advance for submitting their interest in this opportunity. Airalo is an equal opportunity employer and values diversity, equity &amp; inclusion. We do not discriminate on the basis of race, religion, national origin, gender, sexual orientation, age, marital status, veteran status, or disability status. We are committed to providing reasonable accommodations upon request for individuals with disabilities throughout our job interview process.</div>","tags":"[\"Finance\",\"management\"]","pubDate":"2024-10-01 21:21:29.386","link":"https://jobs.lever.co/airalo/bc719d04-7e52-4691-90d5-75d7224b729b","savedDate":"2024-10-04 05:05:20.689","slug":"senior-accounts-payable-specialist-airalo-826"},{"id":5900702366,"title":"Head of Strategic Partnerships (Telecom) - Africa & Arabia","company":"Airalo","image":"https://lever-client-logos.s3.us-west-2.amazonaws.com/55028a36-609c-479c-9553-d4689ff2dd8c-1669620566663.png","description":"<div><b>About Airalo</b></div><div>Alo! Airalo is the world’s first eSIM store that helps people connect in over 200+ countries and regions across the globe. We are building the next digital service that revolutionizes the telecom industry. We are a travel-tech company and an equal-opportunity environment that values and executes diversity, inclusion, and equity. Our team is spread across 50+ countries and six continents. What glues us together is our commitment to changing the way you connect<span style=\"font-size: 13.3333px\">. </span></div><div><br></div><div><b>About you</b></div><div>We hope that you care deeply about the quality of your work, the intrinsic worth of tasks, and the success of your team. You are self-disciplined and do not require micromanagement in terms of your skillset and work ethic. You do your best to flourish as an individual every day while working hard to foster a collaborative team environment. You believe in the importance of being — and staying — authentic, honest, positive, and kind. You are a good interlocutor with clear and concise communication. You are able to manage multiple projects, have an analytical mind, pay keen attention to detail, and love to get your hands dirty. You are cognizant, tolerant, and welcoming of vulnerabilities and cultural differences.</div><div><br></div><div><b>About the Role</b></div><div><b>Position</b>: Full-time / Employee</div><div><b>Location:</b>&nbsp;Remote-first </div><div><b>Benefits:</b>&nbsp;Health Insurance, work-from-anywhere stipend, annual wellness &amp; learning credits, annual all-expenses-paid company retreat in a gorgeous destination &amp; other benefits</div><div><br></div><div>We are looking for a partnerships superstar to join the <b>Airalo Partnerships</b> department.</div><div>The undisputed industry leader in the B2C segment in the eSIM industry, we are now looking to expand our presence in the B2B2C and B2B space to bring the eSIM revolution to adjacent industries.</div><div>As the <b>Head of Strategic Partnerships for Africa &amp; Arabia</b>, you will lead partnerships with medium to large businesses in <b>the African &amp; Arabian region</b> across the Telecom vertical and other adjacent industries to offer Airalo’s travel connectivity solutions to their end customers.</div><h3>Responsibilities include but are not limited to:</h3><li>Work closely with our Director/VP of Partnerships and other team members in the department</li><li>Find, identify, prospect and lead negotiations with potential partners to support Airalo’s market penetration efforts</li><li>Onboard and support new partners as they join the Airalo partner community</li><li>Maintain relationships with key partners to drive partner profitability and grow the B2B/B2B2C channel contribution to the business</li><li>Conduct competitive research and refine the Airalo Partnerships roadmap to maintain Airalo’s status as the preferred provider across industry partners</li><li>Collaborate and work with different internal and external stakeholders to develop and execute projects/opportunities successfully</li><li>Represent Airalo at travel and telecom events and conferences</li><li>Own the Airalo Strategic Partnerships OKRs</li>,<h3>Must Haves:</h3><li>7+ years of experience in partnerships, sales, account management or business development in the Telecom industry in a B2B and/or B2B2C environment</li><li>Partner-first mentality and a genuine passion to help your stakeholders succeed while creating a win-win relationships</li><li>Ability to narrate a good story - Airalo’s unique story and the problem we solve for our users makes it a compelling partnership proposition</li><li>Ability to employ sales techniques, including effective questioning, objection handling, consultative selling, and solution selling</li><li>Ability to develop thought leadership skills and build trust with stakeholders</li><li>Ability to multi-task in a complex &amp; matrix environment</li><li>Experience with sales and partnerships tools</li><li>Perfect verbal and written communication skills in English</li><div><br></div><div><b>Good to have:</b></div><li>Prior work experience in a consumer tech company</li><li>Experience in building and leading a team</li><li>Graduate degree in a related field</li><li>Certificates and courses in sales and partnerships</li><li>Verbal and written ability in additional languages</li><div>If you are interested in this position, <b>please apply via the link.</b></div><div><br></div><div>We sincerely thank all applicants in advance for submitting their interest in this opportunity. Airalo is an equal opportunity employer and values diversity, equity &amp; inclusion. We do not discriminate on the basis of race, religion, national origin, gender, sexual orientation, age, marital status, veteran status, or disability status. We are committed to providing reasonable accommodations upon request for individuals with disabilities throughout our job interview process.</div>","tags":"[\"management\",\"B2C\",\"B2B\"]","pubDate":"2024-10-01 21:06:31.101","link":"https://jobs.lever.co/airalo/13be743e-a512-4529-9f03-0de2787d91f0","savedDate":"2024-10-04 05:05:20.689","slug":"head-of-strategic-partnerships-telecom-africa-arabia-airalo-706"},{"id":9624633801,"title":"Senior Go Developer for CloudLinuxOS (worldwide remote, work anywhere)","company":"CloudLinux","image":"https://pbs.twimg.com/profile_images/696718028084482050/ymY3OEPk_400x400.png","description":"<p>CloudLinux OS, our flagship product, runs on over 50,000 production servers today, powering over 40 million websites, and is recognized as the best OS for security and efficiency in a shared hosting environment. CloudLinux OS increases server density and enhances security, thus reducing operating costs, decreasing churn rates, and increasing profitability. Check out our website for more information about our CLOS Product: <a href=\"https://www.cloudlinux.com/\" target=\"_blank\" rel=\"nofollow noreferrer noopener\" class=\"external\">https://www.cloudlinux.com/</a> </p><p>We are seeking a talented <strong>Senior Golang Developer</strong> to join our CloudLinuxOS team. </p><p>You will work on the interesting project Apache2Nginx, which sets up NGINX on the server and automatically converts .htaccess files into the corresponding NGINX configuration.</p><p>Work is fully remote, with flexible hours, where you can plan your day and work from anywhere. </p><p>More details about the project can be found on the <a href=\"https://cloudlinux.com/\" target=\"_blank\" rel=\"nofollow noreferrer noopener\" class=\"external\">product website</a> <a href=\"https://cloudlinux.com/\" rel=\"nofollow noreferrer noopener\" class=\"external\"></a>and <a href=\"https://docs.cloudlinux.com/shared/apache2nginx/\" rel=\"nofollow noreferrer noopener\" class=\"external\">our documentation</a>.</p><h3>Requirements: </h3><p><strong>To thrive in this role, we are looking for someone who has:</strong></p><ul> <li>5+ years of experience in Go.</li> <li>Good Linux/Unix proficiency, with experience in RHEL/CentOS/AlmaLinux.</li> <li>Experience with WAFs, particularly ModSecurity.</li> <li>Knowledge, understanding, and ability to select and analyze the performance of classical algorithms and data structures.</li> <li>Ability to write and maintain code in accordance with the Go style guide.</li> <li>Experience in multithreaded programming and the development of asynchronous applications.</li> <li>Strong understanding of the network stack, particularly TCP/IP and HTTP.</li> <li>Knowledge of Go testing and debugging tools.</li> <li>Experience in monitoring deployments and application performance.</li> <li>Ability to identify and troubleshoot emerging issues and optimize the application for performance and scalability.</li> <li>Experience patching upstream solutions written in Go.</li> <li>Strong knowledge and understanding of Nginx/Apache architecture for developing additional components that modify core behaviour.</li> <li>Proficient in Git.</li> <li>Experience with Shell scripting.</li> <li>Strong teamwork skills.</li> <li>Ability to read and understand others' code.</li> <li>English at an upper-intermediate level.</li> </ul><p><strong><br>Would be a plus: </strong></p><ul> <li>Experience in system programming.</li> <li>Experience with Coraza.</li> <li>Knowledge of Python, C/C++ or any other programming language.</li> <li>Experience in open-source projects.</li> <li>Knowledge of Internet security basics.</li> <li>Knowledge and ability to select suitable data serialization algorithms.</li> <li>Familiarity with embedded databases (storage engines) such as BoltDB, LevelDB, and/or others.</li> <li>Integration with C code and libraries.</li> </ul><h3>Benefits: </h3><p><strong>What's in it for you?</strong></p><ul> <li>A focus on professional development.</li> <li>Interesting and challenging projects.</li> <li>Fully remote work with flexible working hours, that allows you to schedule your day and work from any location worldwide.</li> <li>Paid 24 days of vacation per year, 10 days of national holidays, and unlimited sick leaves.</li> <li>Compensation for private medical insurance.</li> <li>Co-working and gym/sports reimbursement.</li> <li>Budget for education.</li> <li>The opportunity to receive a reward for the most innovative idea that the company can patent.<br><br> </li> </ul><p><em>By applying for this position, you agree with the </em><a href=\"https://cloudlinux.com/privacy-policy\" target=\"_blank\" rel=\"nofollow noreferrer noopener\" class=\"external\">CloudLinux Privacy Policy</a><a href=\"https://cloudlinux.com/privacy-policy\" target=\"_blank\" rel=\"nofollow noreferrer noopener\" class=\"external\"></a><em>and give us your consent to maintain and process your personal data in this respect. Please read our </em><a href=\"https://cloudlinux.com/privacy-policy\" target=\"_blank\" rel=\"nofollow noreferrer noopener\" class=\"external\">Privacy Policy</a><em> for more information.</em></p>","tags":"[\"database\"]","pubDate":"2024-10-01 00:00:00.000","link":"https://apply.workable.com/cloudlinux-1/j/27E11FFB61","savedDate":"2024-10-04 05:05:20.687","slug":"senior-go-developer-for-cloudlinuxos-worldwide-remote-work-anywhere-cloudlinux-1337"},{"id":7090096628,"title":"Middle SDET/QA Automation Engineer (worldwide remote)","company":"CloudLinux","image":"https://pbs.twimg.com/profile_images/696718028084482050/ymY3OEPk_400x400.png","description":"<p></p><p>We are looking for a SDET/QA Automation Engineer to join our KernelCare team. The ideal candidate should possess not just technical expertise but an unwavering commitment to quality and a deep passion for Python. We're looking for someone who not only writes Python code but also lives and breathes it. This candidate should think in Python, excel in Python, and communicate in Python. If you are excited about pushing the boundaries of QA engineering with your Python prowess, we encourage you to apply.</p><p>KernelCare, CloudLinux's fastest-growing product, provides automated kernel security updates without reboots for the most popular Linux distributions. It ensures optimal performance and uptime by allowing hosting providers and enterprises to keep kernels up-to-date with all security patches while keeping servers online.</p><p>The work is fully remote, with flexible hours, so you can plan your day and work from anywhere in the world.</p><p>More details about the project can be found on the product website<a href=\"https://kernelcare.com\" rel=\"nofollow noreferrer noopener\" class=\"external\"> KernelCare.com</a>, and about the company at<a href=\"https://cloudlinux.com\" rel=\"nofollow noreferrer noopener\" class=\"external\"> Cloudlinux.com</a>.</p><p></p><h3>As our SDET/QA Automation Engineer, you will:</h3><ul> <li>Maintain and debug the current test framework and automated tests.</li> <li>Support existing CI/CD pipelines under the guidance of Senior SDETs.</li> <li>Prepare all needed documentation clarifying the product's environment.</li> <li>Update and fix automated test scenarios (Python/Bash), maintain continuous test execution (Jenkins), track test cycle results, recommend corrective actions, and collaborate with development engineers to resolve issues.</li> <li>Maintain and modify the test environment and configuration as needed.</li> <li>Continue to expand test automation within KernelCare’s continuous integration (CI) and continuous deployment (CD) environments.</li> <li>Collaborate with kernel, support, and Python engineers.</li> </ul><h3>Requirements: </h3><p></p><h3>To be successful, you should have:</h3><ul> <li>Proficiency in Python for writing, maintaining, and debugging test scripts.</li> <li>Strong foundation in object-oriented programming with Python.</li> <li>A bachelor's degree in computer science, software engineering, or a similar field.</li> <li>2+ years of experience in QA Automation (experience only in UI and/or API automation is not relevant for this role).</li> <li>4+ years of QA experience, with a passion for Linux.</li> <li>Fluency in Linux CLI and proficiency in shell scripting.</li> <li>Basic Linux administration knowledge, including handling kernel booting and package installation.</li> <li>Familiarity with Ansible and Docker.</li> <li>Experience working with Jenkins (scripted or declarative pipelines).</li> <li>A basic understanding of DevOps practices, particularly in relation to test automation.</li> <li>The ability to work well with culturally diverse teams.</li> <li>Proven ability to communicate effectively with peers and all levels of management.</li> <li>Intermediate or higher English level.</li> <li>A team player mentality but also the ability to work independently using your initiative.</li> <li>Comfort working in an agile, fast-paced environment.</li> </ul><p></p><p></p><h3>Guidance &amp; Growth:</h3><p>You will be mentored by Senior SDETs, with the opportunity to develop advanced skills in Python, automation, and Linux system management.</p><h3>90-Day Trial Period Tasks</h3><h3>Objective:</h3><p>The goal of the first 90 days is to familiarize yourself with the core products, tools, and processes used within KernelCare, and to contribute to the improvement of the testing framework and pipelines.</p><p></p><h3>Key Responsibilities and Tasks:</h3><h3>1. Master Core Products</h3><ul> <li>KernelCare and Libcare:</li> <ul><li>Gain an in-depth understanding of how our key products, KernelCare and Libcare, work from a user perspective.</li></ul> </ul><h3>2. Understand the Testing Framework</h3><ul> <li>Testing Framework Mastery:</li> <ul> <li>Develop a thorough understanding of the testing framework used for KernelCare and Libcare.</li> <li>Identify the core components that make up the framework.</li> <li>Learn the different modes and environments in which the framework operates and conducts product testing.</li> <li>Investigate how different test cases and scenarios are integrated into the framework for continuous testing.</li> </ul> </ul><h3>3. Familiarize with CI Pipelines</h3><ul> <li>Continuous Integration (CI) Pipelines:</li> <ul> <li>Acquaint yourself with the primary CI pipelines that are in use.</li> <li>Understand their role in the overall development and release process.</li> <li>Identify key pipeline stages and how they interact with the testing framework.</li> </ul> </ul><h3>4. Problem Analysis and Pre-Release Pipeline Involvement</h3><ul> <li>Pre-Release Pipeline Problem Solving:</li> <ul> <li>Participate in analyzing issues that arise in the pre-release pipeline.</li> <li>Work collaboratively with other engineers to diagnose and resolve pipeline-related problems.</li> <li>Make necessary adjustments to ensure the correct operation of the testing framework and automated tests on new environments.</li> <li>Implement improvements based on feedback and observed issues to enhance pipeline stability and efficiency.</li> </ul> </ul><p></p><h3>Benefits: </h3><p></p><p><strong>What's in it for you?</strong></p><ul> <li>A focus on professional development</li> <li>Interesting and challenging projects</li> <li>Fully remote work with flexible working hours, that allows you to schedule your day and work from any location worldwide</li> <li>Paid 24 days of vacation per year, 10 days of national holidays, and unlimited sick leaves</li> <li>Compensation for private medical insurance</li> <li>Co-working and gym/sports reimbursement</li> <li>Budget for education</li> <li>The opportunity to receive a reward for the most innovative idea that the company can patent</li> </ul><p></p><p></p><p><em>By applying for this position, you agree with&nbsp;</em>the Cloudlinux Privacy Policy&nbsp;<a href=\"https://cloudlinux.com/privacy-policy\" target=\"_blank\" rel=\"nofollow noreferrer noopener\" class=\"external\">https://cloudlinux.com/privacy-policy</a><em>&nbsp;and give us your consent to maintain and process your personal data in this respect. Please read our Privacy Policy for more information.</em></p><p><a href=\"https://apply.workable.com/cloudlinux-1/j/35886A3A9A/apply/\" rel=\"nofollow noreferrer noopener\" class=\"external\">Apply for this job</a></p><p></p>","tags":"[\"management\",\"engineering\"]","pubDate":"2024-10-01 00:00:00.000","link":"https://apply.workable.com/cloudlinux-1/j/71755C8BDB","savedDate":"2024-10-04 05:05:20.688","slug":"middle-sdet-qa-automation-engineer-worldwide-remote-cloudlinux-1892"},{"id":3972957843,"title":"智能合约开发工程师 TON","company":"Manta Network","image":"https://avatars.githubusercontent.com/u/74517090?s=200&v=4","description":"<div><b>岗位职责：</b></div><div><span style=\"font-size: 15px;\">负责TON和Ethereum上的Dapp开发工作.</span></div><div><b>任职要求：</b></div><div>掌握Ethereum智能合约开发，熟悉Solidity及可升级合约的设计与实现。</div><div>理解并能使用Uniswap V2/V3、NFT marketplace、LST、restake合约.</div><div>掌握TON的TVM架构和funC, 理解cell的数据结构,&nbsp; 理解message发送的原理，掌握TL-B.</div><div>理解TON钱包合约的实现, 以及Jetton和NFT的原理.</div><div>熟练掌握TON相关sdk和合约进行交互.</div><div>对区块链安全性及最佳实践有深刻理解，能够优化智能合约的性能与安全性。</div><div>良好的团队协作能力和沟通能力，能够在远程环境下高效工作。</div><div><b>加分项:</b></div><div>有TON上mini app的开发经验是加分项.</div><div>会Solana开发, 熟悉Rust、Anchor框架等Solana生态工具。</div><div><b>岗位职责：</b></div><div><span style=\"font-size: 15px;\">负责TON和Ethereum上的Dapp开发工作.</span></div><div><b>任职要求：</b></div><div>掌握Ethereum智能合约开发，熟悉Solidity及可升级合约的设计与实现。</div><div>理解并能使用Uniswap V2/V3、NFT marketplace、LST、restake合约.</div><div>掌握TON的TVM架构和funC, 理解cell的数据结构,&nbsp; 理解message发送的原理，掌握TL-B.</div><div>理解TON钱包合约的实现, 以及Jetton和NFT的原理.</div><div>熟练掌握TON相关sdk和合约进行交互.</div><div>对区块链安全性及最佳实践有深刻理解，能够优化智能合约的性能与安全性。</div><div>良好的团队协作能力和沟通能力，能够在远程环境下高效工作。</div><div><b>加分项:</b></div><div>有TON上mini app的开发经验是加分项.</div><div>会Solana开发, 熟悉Rust、Anchor框架等Solana生态工具。</div>","tags":"[]","pubDate":"2024-09-29 09:33:44.280","link":"https://jobs.lever.co/MantaNetwork/614179a5-97ce-4457-a831-71537704512e","savedDate":"2024-10-04 05:05:20.689","slug":"ton-manta-network-5746"}]