[{"id":7695385654,"title":"Growth Lead - Paid Social","company":"Atticus","image":"https://images.atticus.com/logos/og_logo.png","description":"<h2><strong>About Atticus</strong></h2><p style=\"min-height:1.5em\">At any given time, 16 million Americans are experiencing a crisis that requires urgent help from our legal system or government. The right assistance could transform their lives. But today, most never get it. </p><p style=\"min-height:1.5em\">Atticus makes it easy for any sick or injured person in crisis to get the life-changing aid they deserve. In the last 6 years we’ve become the leading platform connecting people with disabilities to government benefits. We also help victims of accidents, misconduct, and violence get compensation from insurance. So far, we’ve gotten thousands of people access to over $4B in life-changing aid, and we’re just getting started.</p><p style=\"min-height:1.5em\">We've helped more than 110,000 people in need (see our 13,000+ five-star reviews) and raised more than $100 million from top VC firms like Fika, Forerunner, GV (Google Ventures), and True Ventures. (We closed our Series C round in April 2025, so we're well-funded for the foreseeable future.) We're a small but growing team — we expanded from 89 to over 151 members last year, and we anticipate further growth in 2025.</p><h2><strong>The Job</strong></h2><p style=\"min-height:1.5em\">Growing the number of clients we serve at Atticus is one of the hardest and most rewarding</p><p style=\"min-height:1.5em\">things we do. Because the legal marketing space is highly competitive and heavily</p><p style=\"min-height:1.5em\">regulated, we seek innovative ways to reach our clients during the biggest crises of their</p><p style=\"min-height:1.5em\">lives while also setting Atticus apart from sketchy billboard lawyers and sell-your-info</p><p style=\"min-height:1.5em\">schemes.</p><p style=\"min-height:1.5em\">The Growth Lead role mixes traditional marketing and acquisition (testing new platforms,</p><p style=\"min-height:1.5em\">managing campaigns, gathering and analyzing data) with responsibilities unique to a quickly</p><p style=\"min-height:1.5em\">scaling a tech company (developing partnerships, working with product leaders to tailor our</p><p style=\"min-height:1.5em\">UX to different audiences, creative briefing, and building our data infrastructure). In a typical</p><p style=\"min-height:1.5em\">week, you might do any or all of the following:</p><ul style=\"min-height:1.5em\"><li><p style=\"min-height:1.5em\">Launch and monitor new marketing campaigns on paid social channels</p></li><li><p style=\"min-height:1.5em\"> Partner with Creative to drive our paid social creative process, from concept development &amp; briefing to test roadmap creation</p></li><li><p style=\"min-height:1.5em\">Leverage contractors or creative agencies as needed to augment our internal capabilities</p></li><li><p style=\"min-height:1.5em\">Work with Product and Engineering teams to tailor client product experience to the needs of our unique audience</p></li><li><p style=\"min-height:1.5em\">Help create the strategy for growing our client acquisition machine as we scale Atticus from Series B to owning the market</p></li></ul><p style=\"min-height:1.5em\">The role is a rare opportunity to join a fast-growing Series B startup in a position that mixes growth marketing execution and innovation, encourages mentorship from leaders across a variety of disciplines, and prioritizes autonomy to shape our acquisition strategy as we</p><p style=\"min-height:1.5em\">scale.</p><h2><strong>Qualifications:</strong></h2><p style=\"min-height:1.5em\">Required:</p><ul style=\"min-height:1.5em\"><li><p style=\"min-height:1.5em\">You joined a top digital advertising agency or growth-marketing organization out of college and have been promoted because of your stellar performance.</p></li><li><p style=\"min-height:1.5em\">You have strong quantitative analytical skills and are comfortable working in data analytics platforms and data visualization software.</p></li><li><p style=\"min-height:1.5em\">You’re an ambitious self-starter. You thrive in ambiguous environments and enjoy a strategic challenge.</p></li><li><p style=\"min-height:1.5em\">You’re a kind and thoughtful colleague who knows how to shape a great team culture and thoughtfully analyze data and communicate insights.</p></li><li><p style=\"min-height:1.5em\">You have a demonstrated commitment to doing good and helping people.</p></li></ul><p style=\"min-height:1.5em\"><strong>Bonus / Nice-to-Have:</strong></p><ul style=\"min-height:1.5em\"><li><p style=\"min-height:1.5em\">Experience using Looker, SQL, Google Analytics, and Google Tag Manager</p></li><li><p style=\"min-height:1.5em\">Experience using Google and Meta Ads and have a track record of improving paid media campaigns.</p></li><li><p style=\"min-height:1.5em\">Experience using digital marketing platforms (e.g., Google and Meta Ads) and have a track record of improving paid media campaigns</p></li><li><p style=\"min-height:1.5em\">Experience designing and producing digital ads</p></li><li><p style=\"min-height:1.5em\">We are strongly committed to building a diverse team. If you’re from a background that’s underrepresented in tech, we’d love to meet you.</p></li></ul><h2><strong>Salary and Benefits</strong></h2><p style=\"min-height:1.5em\">This is a rare opportunity to join a startup that has strong traction (substantial funding, well-respected backers, tremendous growth, and many happy customers) but is still small enough that you can have a huge impact and play a role in shaping our culture.</p><p style=\"min-height:1.5em\">We’re a certified B Corporation tackling a critical social problem. Our mission to help people in need drives everything we do, and your work here will touch many lives.</p><p style=\"min-height:1.5em\">We offer competitive pay — including equity — and generous benefits:</p><ul style=\"min-height:1.5em\"><li><p style=\"min-height:1.5em\">Medical and dental insurance with 100% of employee premiums covered</p></li><li><p style=\"min-height:1.5em\">15 vacation days &amp; ~19 paid holidays each year (including two weeks at end-of-year)</p></li><li><p style=\"min-height:1.5em\">Free membership to OneMedical</p></li><li><p style=\"min-height:1.5em\">$600/year reimbursable stipend for internet service</p></li><li><p style=\"min-height:1.5em\">$1,000 reimbursable stipend for education and training outside of work</p></li><li><p style=\"min-height:1.5em\">Up to $1,200/year student loan repayment assistance</p></li><li><p style=\"min-height:1.5em\">401(k) and optional HSA/FSA</p></li><li><p style=\"min-height:1.5em\">Humble, thoughtful, smart, fun colleagues </p></li></ul><p style=\"min-height:1.5em\">We anticipate the base salary band for this role will be between $130,000 to $155,000 in addition to equity and benefits. The salary at offer will be determined by a number of factors such as candidate’s experience, knowledge, skills and abilities, as well as internal equity among our team.</p><h2><strong>Location</strong></h2><p style=\"min-height:1.5em\">This job is fully remote and we’re committed to empowering everyone with flexibility. Live wherever, work remotely, and travel to LA (on the company dime) as needed to be with your colleagues —somewhere between quarterly and yearly. We care a lot about building a great culture and we think some interactions need to happen in person, so we put a lot of thought into retreats, offsites, and other ways to gather.</p>","tags":"[\"engineering\",\"legal\"]","pubDate":"2025-05-01T21:20:30.366Z","link":"https://jobs.ashbyhq.com/atticus/8b2a79af-a220-488d-9e08-f6db910b0b79","slug":"growth-lead-paid-social-atticus-1043"},{"id":8818610713,"title":"Senior Backend Engineer (Node.js)","company":"Fingerprint","image":"https://avatars.githubusercontent.com/u/67208791?s=200&v=4","description":"&lt;div class=&quot;content-intro&quot;&gt;&lt;p&gt;&lt;strong&gt;Fingerprint&lt;/strong&gt;&amp;nbsp;empowers developers to stop online fraud at the source.&lt;/p&gt;\n&lt;p&gt;We work on turning radical new ideas in the fraud detection space into reality. Our products are developer-focused and our clients range from solo developers to publicly traded companies.&amp;nbsp;&lt;strong&gt;We are a globally dispersed, 100% remote company&lt;/strong&gt; with a strong open-source focus. Our flagship open-source project is &lt;a class=&quot;c-link c-link--focus-visible&quot; href=&quot;https://github.com/fingerprintjs/fingerprintjs&quot; target=&quot;_blank&quot; data-stringify-link=&quot;https://github.com/fingerprintjs/fingerprintjs&quot; data-sk=&quot;tooltip_parent&quot;&gt;FingerprintJS&lt;/a&gt; (20K stars on GitHub).&lt;/p&gt;\n&lt;p&gt;&lt;a class=&quot;c-link c-link--focus-visible&quot; href=&quot;https://www.crunchbase.com/organization/fingerprintjs&quot; target=&quot;_blank&quot; data-stringify-link=&quot;https://www.crunchbase.com/organization/fingerprintjs&quot; data-sk=&quot;tooltip_parent&quot;&gt;We have raised $77M&amp;nbsp;&lt;/a&gt;and are backed by Craft Ventures (previously invested in&amp;nbsp;&lt;a class=&quot;c-link c-link--focus-visible&quot; href=&quot;https://www.tesla.com/&quot; target=&quot;_blank&quot; data-stringify-link=&quot;https://www.tesla.com/&quot; data-sk=&quot;tooltip_parent&quot;&gt;Tesla,&amp;nbsp;&lt;/a&gt;&lt;a class=&quot;c-link c-link--focus-visible&quot; href=&quot;https://facebook.com/&quot; target=&quot;_blank&quot; data-stringify-link=&quot;https://facebook.com/&quot; data-sk=&quot;tooltip_parent&quot;&gt;Facebook,&amp;nbsp;&lt;/a&gt;&lt;a class=&quot;c-link c-link--focus-visible&quot; href=&quot;https://www.airbnb.com/&quot; target=&quot;_blank&quot; data-stringify-link=&quot;https://www.airbnb.com/&quot; data-sk=&quot;tooltip_parent&quot;&gt;Airbnb&amp;nbsp;&lt;/a&gt;), Nexus Venture Partners (previously invested in &lt;a href=&quot;https://www.postman.com/&quot;&gt;Postman&lt;/a&gt;, &lt;a href=&quot;https://www.apollo.io/&quot;&gt;Apollo.io,&lt;/a&gt; &lt;a href=&quot;https://min.io/&quot;&gt;MinIO&lt;/a&gt;, Druva)&amp;nbsp;and Uncorrelated Ventures (previously invested in&amp;nbsp;&lt;a class=&quot;c-link c-link--focus-visible&quot; href=&quot;https://redis.io/&quot; target=&quot;_blank&quot; data-stringify-link=&quot;https://redis.io/&quot; data-sk=&quot;tooltip_parent&quot;&gt;Redis,&amp;nbsp;&lt;/a&gt;&lt;a class=&quot;c-link c-link--focus-visible&quot; href=&quot;https://rollbar.com/&quot; target=&quot;_blank&quot; data-stringify-link=&quot;https://rollbar.com/&quot; data-sk=&quot;tooltip_parent&quot;&gt;Rollbar&amp;nbsp;&lt;/a&gt;&amp;amp;&lt;a class=&quot;c-link c-link--focus-visible&quot; href=&quot;https://gradle.org/&quot; target=&quot;_blank&quot; data-stringify-link=&quot;https://gradle.org/&quot; data-sk=&quot;tooltip_parent&quot;&gt;&amp;nbsp;Gradle&lt;/a&gt;).&lt;/p&gt;\n&lt;p&gt;&lt;em&gt;We have noticed a rise in recruiting impersonations across the industry, where scammers attempt to access candidates&#39; personal and financial information through fake interviews and offers. All Fingerprint recruiting email communications will always come from the @fingerprint.com domain. Any outreach claiming to be from Fingerprint via other sources should be ignored.&lt;/em&gt;&lt;/p&gt;\n&lt;p&gt;&amp;nbsp;&lt;/p&gt;\n&lt;hr&gt;\n&lt;p&gt;&amp;nbsp;&lt;/p&gt;\n&lt;p&gt;&amp;nbsp;&lt;/p&gt;\n&lt;p&gt;&amp;nbsp;&lt;/p&gt;&lt;/div&gt;&lt;p&gt;We’re looking for a &lt;strong&gt;Senior back-end engineer&lt;/strong&gt; to help us build a high performance, high accuracy online fraud prevention service. We need someone who has experience building server-side APIs using Node.js.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Responsibilities:&lt;/strong&gt;&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;Design, implement, and maintain robust backend services and APIs that support our customer dashboard, public-facing management APIs, and internal back-office tools, including billing and subscription lifecycle management.&lt;/li&gt;\n&lt;li&gt;Lead and participate in technical and functional discussions, contributing to architectural decisions and owning backend components from design to deployment in a high-performing team environment.&lt;/li&gt;\n&lt;li&gt;Collaborate effectively with cross-functional teams, delivering high-quality backend solutions within fast-paced and sometimes time-constrained development cycles.&lt;/li&gt;\n&lt;li&gt;Work closely with product managers, designers, and frontend engineers to understand requirements, provide backend perspective, and ensure seamless integration of backend services with other systems.&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;&lt;strong&gt;Qualifications:&lt;/strong&gt;&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;Excellent understanding of Internet security &amp;amp; privacy mechanisms.&lt;/li&gt;\n&lt;li&gt;Proven experience of API architecture and implementation.&lt;/li&gt;\n&lt;li&gt;Understanding of Hexagonal Architecture and Domain-Driven Design.&lt;/li&gt;\n&lt;li&gt;Experience using AWS for production deployments.&lt;/li&gt;\n&lt;li&gt;Good understanding of PostgreSQL 🐘.&lt;/li&gt;\n&lt;li&gt;Familiarity with message queues.&lt;/li&gt;\n&lt;li&gt;Test-driven mindset.&lt;/li&gt;\n&lt;li&gt;Good English.&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;&lt;strong&gt;An ideal candidate will also have:&lt;/strong&gt;&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;Familiarity with React.&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;&lt;strong&gt;Our stack:&lt;/strong&gt;&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;Backend: TypeScript, Node, Express.&lt;/li&gt;\n&lt;li&gt;Frontend: TypeScript, React, Storybook.&lt;/li&gt;\n&lt;li&gt;Infrastructure: k8s.&lt;/li&gt;\n&lt;li&gt;AWS (Elastic Beanstalk, RDS/Aurora, SQS).&lt;/li&gt;\n&lt;li&gt;Netlify/CloudFront.&lt;/li&gt;\n&lt;li&gt;PostgreSQL.&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;&amp;nbsp;&lt;/p&gt;&lt;div class=&quot;content-conclusion&quot;&gt;&lt;p&gt;&lt;em&gt;We have noticed a rise in recruiting impersonations across the industry, where scammers attempt to access candidates&#39; personal and financial information through fake interviews and offers. All Fingerprint recruiting email communications will always come from the @fingerprint.com domain. Any outreach claiming to be from Fingerprint via other sources should be ignored.&lt;/em&gt;&lt;/p&gt;\n&lt;p&gt;Offers vary depending on, but not limited to, relevant experience, education, certifications/licenses, skills, training, and market conditions.&amp;nbsp;&lt;/p&gt;\n&lt;p&gt;Due to regulatory and security reasons, there’s a small number of countries where we cannot have Fingerprint teammates based.&amp;nbsp;&lt;strong data-stringify-type=&quot;bold&quot;&gt;Additionally, because Fingerprint is an all-remote company and people can join our workforce from almost any country, we do not sponsor visas. Fingerprint teammates need to be authorized to work from their home location&lt;/strong&gt;.&lt;/p&gt;\n&lt;p&gt;We are dedicated to creating an inclusive work environment for everyone. We embrace and celebrate the unique experiences, perspectives and cultural backgrounds that each employee brings to our workplace. Fingerprint strives to foster an environment where our employees feel respected, valued and empowered, and our team members are at the forefront in helping us promote and sustain an inclusive workplace. We highly encourage people from underrepresented groups in tech to apply.&lt;/p&gt;\n&lt;p&gt;If you are applying as a resident of California, please read our CCPA notice &lt;a href=&quot;https://dev.fingerprint.com/docs/dpa-ccpa&quot; target=&quot;_blank&quot;&gt;here&lt;/a&gt;&lt;/p&gt;\n&lt;p&gt;If you are applying as a resident of the EU, please read our GDPR notice &lt;a href=&quot;https://dev.fingerprint.com/docs/dpa-gdpr&quot; target=&quot;_blank&quot;&gt;here&lt;/a&gt;&lt;/p&gt;&lt;/div&gt;","tags":"[\"postgres\",\"typescript\",\"management\",\"aws\"]","pubDate":"2025-05-01T20:45:34.000Z","link":"https://fingerprint.com/careers/jobs/apply/?gh_jid=5526874004","slug":"senior-backend-engineer-node-js-fingerprint-7272"},{"id":9410493552,"title":"Trust & Safety Manager","company":"Kindred","image":"https://pbs.twimg.com/profile_images/1515067066750885890/jAQEhnud_400x400.jpg","description":"<p style=\"min-height:1.5em\">Kindred is a members-only home swapping network that unlocks the ability to live a travel-rich lifestyle through the power of community. By exchanging primary residences with trusted peers, renters and owners alike can match with Kindred spirits and explore new destinations without breaking the bank.</p><p style=\"min-height:1.5em\">We are on a mission to build a sharing economy that lives up to the name, and we’ve raised significant capital from some of the best investors in Silicon Valley, including Index Ventures, Andreessen Horowitz, New Enterprise Associates, Bessemer Venture Partners, Caffeinated Capital, Elad Gil, and the founders of Opendoor, Figma, ClassPass, Clubhouse, Divvy, Gem, and Homebound.</p><p style=\"min-height:1.5em\">The co-founders are proven leaders from the early team at proptech company Opendoor ($15B+ exit) and have each separately built and scaled products that today do $1B+ annual revenue combined.</p><p style=\"min-height:1.5em\">We’re looking for the world’s top builders, executors, and believers to join us on this ride.</p><p style=\"min-height:1.5em\">You can learn more about us in <a target=\"_blank\" rel=\"noopener noreferrer nofollow\" href=\"https://www.forbes.com/sites/bridgetarsenault/2022/06/10/a-new-home-swapping-platform-allows-you-to-travel-the-world-like-cameron-diaz-and-kate-winslet/?sh=203a5d0722cb\">Forbes</a> and <a target=\"_blank\" rel=\"noopener noreferrer nofollow\" href=\"https://techcrunch.com/2023/04/19/opendoor-alums-raise-15m-for-kindred-a-home-swapping-network/\">TechCrunch</a>.</p><p style=\"min-height:1.5em\"><strong>The Role:</strong></p><p style=\"min-height:1.5em\">At Kindred, operations is at the heart of everything we do. We’re looking for a Trust &amp; Safety Manager to lead initiatives that helps Kindred maintain a high bar for customer experience and efficiency as we scale. This role will report directly into our Head of Operations and will help develop our Trust &amp; Safety strategy focused on incident response, policy management and implementing risk mitigation solutions. Your mission is to ensure a seamless and secure experience for all users, fostering trust and confidence in our platform.</p><p style=\"min-height:1.5em\"><strong>You Will:</strong></p><ul style=\"min-height:1.5em\"><li><p style=\"min-height:1.5em\">Work closely with our leadership team to develop and execute a comprehensive trust and safety strategy that addresses current challenges while anticipating future needs.</p></li><li><p style=\"min-height:1.5em\">Work closely with stakeholders across Ops, PED, &amp; Growth to execute initiatives that drive Trust &amp; Safety improvements within our OKR structure.</p></li><li><p style=\"min-height:1.5em\">Develop and maintain reporting &amp; analytics to help measure our member experience, Operations, and PED feature impact.</p></li><li><p style=\"min-height:1.5em\">Develop and maintain community standards and platform policies, balancing user experience with risk management.</p></li><li><p style=\"min-height:1.5em\">Proactively identify risks and vulnerabilities within the platform, and work cross-functionally to mitigate these risks through product, policy, or operational improvements.</p></li><li><p style=\"min-height:1.5em\">Develop &amp; monitor policy-related performance trends to measure the effectiveness of Trust &amp; Safety policies and initiatives — such as resolution rate, resolution cost, policy adherence rate.</p></li><li><p style=\"min-height:1.5em\">Work closely with the Operations team on incident support, ensuring timely and effective resolution, maintaining policy performance, while upholding member trust and safety throughout the travel experience.</p></li></ul><p style=\"min-height:1.5em\"><strong>You may be a fit for this role if you:</strong></p><ul style=\"min-height:1.5em\"><li><p style=\"min-height:1.5em\">6+ years of experience in trust and safety, risk management, or a related field, with 3+ years in a leadership role, preferably at a consumer tech or travel company.</p></li><li><p style=\"min-height:1.5em\">In-depth knowledge of trust and safety best practices and regulatory requirements for online platforms.</p></li><li><p style=\"min-height:1.5em\">Ability to work collaboratively with cross-functional teams such as Ops, Growth, &amp; PED.</p></li><li><p style=\"min-height:1.5em\">Strong analytical skills, with the ability to use metrics to inform decisions &amp; drive improvements.</p></li><li><p style=\"min-height:1.5em\">Excellent written and verbal communication, with the ability to handle sensitive topics and articulate complex concepts clearly.</p></li><li><p style=\"min-height:1.5em\">Experience in handling crisis situations with composure and a strategic mindset.</p></li><li><p style=\"min-height:1.5em\">Familiarity with the latest technologies and tools used in safety and risk management.</p></li></ul><p style=\"min-height:1.5em\"><strong>Bonus points if you:</strong></p><ul style=\"min-height:1.5em\"><li><p style=\"min-height:1.5em\">Experience working in a travel or shared-economy platform.</p></li><li><p style=\"min-height:1.5em\">Background in user behavior analysis, content moderation, or regulatory compliance.</p></li><li><p style=\"min-height:1.5em\">Experience managing trust &amp; safety on a global scale.</p></li><li><p style=\"min-height:1.5em\">Strong reporting &amp; analytical skills — SQL proficiency strongly preferred.</p></li></ul><h1><strong>Our Benefits:</strong></h1><p style=\"min-height:1.5em\">At Kindred, we know that good things happen when we look out for one another. We offer our employees the following benefits:</p><ul style=\"min-height:1.5em\"><li><p style=\"min-height:1.5em\">Our opening spans more than one career level. The base salary offered depends on many factors, such as work experience, transferable skills, business needs and impact, and market demands.</p></li><li><p style=\"min-height:1.5em\">A vibrant, inclusive, and highly skilled team that ferociously protects team chemistry</p></li><li><p style=\"min-height:1.5em\">A culture of championship (vs. just mentorship), feedback, and continual development</p></li><li><p style=\"min-height:1.5em\">Competitive cash compensation and equity</p></li><li><p style=\"min-height:1.5em\">Comprehensive health benefits</p></li><li><p style=\"min-height:1.5em\">Flexible vacation policy</p></li><li><p style=\"min-height:1.5em\">Unlimited credits to stay at Kindred homes during your time as an employee</p></li><li><p style=\"min-height:1.5em\">$4,000 annual travel stipend to use toward travel costs to stay at a Kindred home</p></li><li><p style=\"min-height:1.5em\">Remote-flexible work environment. We encourage team members to travel and adventure, including working from Kindred HQ in San Francisco!</p></li><li><p style=\"min-height:1.5em\">Regular offsites to co-locate with the team</p></li></ul><p style=\"min-height:1.5em\"><em>We are committed to providing equal employment opportunities for all applicants and employees. Kindred does not discriminate on the basis of any protected characteristic, including race, color, ancestry, national origin, religion, creed, age, disability, sex, gender, sexual orientation, gender identity, gender expression, medical condition, genetic information, family care or medical leave status, marital status, domestic partner status, military and veteran status, or any other characteristic protected by US federal, state or local laws, or the laws of the country or jurisdiction where you work. Pursuant to the San Francisco Fair Chance Ordinance, we will consider for employment qualified applicants with arrest and conviction records.</em></p>","tags":"[\"management\",\"aws\"]","pubDate":"2025-05-01T17:25:50.287Z","link":"https://jobs.ashbyhq.com/kindred/9c78a937-c145-45ae-ab2e-ccec8c5f76ba","slug":"trust-safety-manager-kindred-7284"},{"id":4319643515,"title":"Business Operations Manager","company":"Kindred","image":"https://pbs.twimg.com/profile_images/1515067066750885890/jAQEhnud_400x400.jpg","description":"<p style=\"min-height:1.5em\">Kindred is a members-only home swapping network that unlocks the ability to live a travel-rich lifestyle through the power of community. By exchanging primary residences with trusted peers, renters and owners alike can match with Kindred spirits and explore new destinations without breaking the bank.</p><p style=\"min-height:1.5em\">We are on a mission to build a sharing economy that lives up to the name, and we’ve raised significant capital from some of the best investors in Silicon Valley, including Index Ventures, Andreessen Horowitz, New Enterprise Associates, Bessemer Venture Partners, Caffeinated Capital, Elad Gil, and the founders of Opendoor, Figma, ClassPass, Clubhouse, Divvy, Gem, and Homebound.</p><p style=\"min-height:1.5em\">The co-founders are proven leaders from the early team at proptech company Opendoor ($15B+ exit) and have each separately built and scaled products that today do $1B+ annual revenue combined.</p><p style=\"min-height:1.5em\">We’re looking for the world’s top builders, executors, and believers to join us on this ride.</p><p style=\"min-height:1.5em\">You can learn more about us in <a target=\"_blank\" rel=\"noopener noreferrer nofollow\" href=\"https://www.forbes.com/sites/bridgetarsenault/2022/06/10/a-new-home-swapping-platform-allows-you-to-travel-the-world-like-cameron-diaz-and-kate-winslet/?sh=203a5d0722cb\">Forbes</a> and <a target=\"_blank\" rel=\"noopener noreferrer nofollow\" href=\"https://techcrunch.com/2023/04/19/opendoor-alums-raise-15m-for-kindred-a-home-swapping-network/\">TechCrunch</a>.</p><p style=\"min-height:1.5em\"><strong>The Role:</strong></p><p style=\"min-height:1.5em\">At Kindred, operations is at the heart of everything we do. We’re looking for a Business Operations Manager to lead initiatives that helps Kindred maintain a high bar for customer experience and efficiency as we scale. This role will report directly into our Head of Operations and will help develop our Trust &amp; Safety strategy focused on incident response, policy management and implementing risk mitigation solutions. Your mission is to ensure a seamless and secure experience for all users, fostering trust and confidence in our platform.</p><p style=\"min-height:1.5em\"><strong>You Will:</strong></p><ul style=\"min-height:1.5em\"><li><p style=\"min-height:1.5em\">Work closely with our leadership team to develop and execute a comprehensive trust and safety strategy that addresses current challenges while anticipating future needs.</p></li><li><p style=\"min-height:1.5em\">Work closely with stakeholders across Ops, PED, &amp; Growth to execute initiatives that drive Trust &amp; Safety improvements within our OKR structure.</p></li><li><p style=\"min-height:1.5em\">Develop and maintain reporting &amp; analytics to help measure our member experience, Operations, and PED feature impact.</p></li><li><p style=\"min-height:1.5em\">Develop and maintain community standards and platform policies, balancing user experience with risk management.</p></li><li><p style=\"min-height:1.5em\">Proactively identify risks and vulnerabilities within the platform, and work cross-functionally to mitigate these risks through product, policy, or operational improvements.</p></li><li><p style=\"min-height:1.5em\">Develop &amp; monitor policy-related performance trends to measure the effectiveness of Trust &amp; Safety policies and initiatives — such as resolution rate, resolution cost, policy adherence rate.</p></li><li><p style=\"min-height:1.5em\">Work closely with the Operations team on incident support, ensuring timely and effective resolution, maintaining policy performance, while upholding member trust and safety throughout the travel experience.</p></li></ul><p style=\"min-height:1.5em\"><strong>You may be a fit for this role if you:</strong></p><ul style=\"min-height:1.5em\"><li><p style=\"min-height:1.5em\">Are a strategic thinker with at least 5+ years of experience in business operations.</p></li><li><p style=\"min-height:1.5em\">Strong operator with a track record of driving improvements in efficiency, customer experience, and risk management — preferably at a consumer tech or travel company.</p></li><li><p style=\"min-height:1.5em\">Ability to work collaboratively with cross-functional teams such as Ops, Growth, &amp; PED.</p></li><li><p style=\"min-height:1.5em\">Strong project management skills with excellent communication and interpersonal skills.</p></li><li><p style=\"min-height:1.5em\">Strong reporting &amp; analytical skills — SQL proficiency strongly preferred.</p></li><li><p style=\"min-height:1.5em\">Excels in solving problems in a fast-paced environment.</p></li></ul><p style=\"min-height:1.5em\"><strong>Bonus points if you:</strong></p><ul style=\"min-height:1.5em\"><li><p style=\"min-height:1.5em\">Experience in trust and safety best practices and regulatory requirements for online platforms.</p></li><li><p style=\"min-height:1.5em\">Experience working in a travel or shared-economy platform.</p></li><li><p style=\"min-height:1.5em\">Background in user behavior analysis, content moderation, or regulatory compliance.</p></li></ul><h1><strong>Our Benefits:</strong></h1><p style=\"min-height:1.5em\">At Kindred, we know that good things happen when we look out for one another. We offer our employees the following benefits:</p><ul style=\"min-height:1.5em\"><li><p style=\"min-height:1.5em\">Our opening spans more than one career level. The base salary offered depends on many factors, such as work experience, transferable skills, business needs and impact, and market demands.</p></li><li><p style=\"min-height:1.5em\">A vibrant, inclusive, and highly skilled team that ferociously protects team chemistry</p></li><li><p style=\"min-height:1.5em\">A culture of championship (vs. just mentorship), feedback, and continual development</p></li><li><p style=\"min-height:1.5em\">Competitive cash compensation and equity</p></li><li><p style=\"min-height:1.5em\">Comprehensive health benefits</p></li><li><p style=\"min-height:1.5em\">Flexible vacation policy</p></li><li><p style=\"min-height:1.5em\">Unlimited credits to stay at Kindred homes during your time as an employee</p></li><li><p style=\"min-height:1.5em\">$4,000 annual travel stipend to use toward travel costs to stay at a Kindred home</p></li><li><p style=\"min-height:1.5em\">Remote-flexible work environment. We encourage team members to travel and adventure, including working from Kindred HQ in San Francisco!</p></li><li><p style=\"min-height:1.5em\">Regular offsites to co-locate with the team</p></li></ul><p style=\"min-height:1.5em\"><em>We are committed to providing equal employment opportunities for all applicants and employees. Kindred does not discriminate on the basis of any protected characteristic, including race, color, ancestry, national origin, religion, creed, age, disability, sex, gender, sexual orientation, gender identity, gender expression, medical condition, genetic information, family care or medical leave status, marital status, domestic partner status, military and veteran status, or any other characteristic protected by US federal, state or local laws, or the laws of the country or jurisdiction where you work. Pursuant to the San Francisco Fair Chance Ordinance, we will consider for employment qualified applicants with arrest and conviction records.</em></p>","tags":"[\"management\",\"aws\"]","pubDate":"2025-05-01T17:20:00.924Z","link":"https://jobs.ashbyhq.com/kindred/c7dca9b2-cdeb-40ac-aaa5-1ad02c56fe15","slug":"business-operations-manager-kindred-6088"},{"id":8377093513,"title":"Support Engineering Manager","company":"Canonical","image":"https://avatars.githubusercontent.com/u/53057619?s=200&v=4","description":"&lt;p&gt;Canonical is a leading provider of open source software and operating systems to the global enterprise and technology markets. Our platform, Ubuntu, is very widely used in breakthrough enterprise initiatives such as public cloud, data science, AI, engineering innovation, and IoT. Our customers include the world&#39;s leading public cloud and silicon providers, and industry leaders in many sectors. The company is a pioneer of global distributed collaboration, with 1200+ colleagues in 75+ countries and very few office-based roles. Teams meet two to four times yearly in person, in interesting locations around the world, to align on strategy and execution.&lt;/p&gt;\n&lt;p&gt;The company is founder-led, profitable, and growing.&lt;/p&gt;\n&lt;p&gt;Our regional Support Managers run world-class Support teams – solving deep technical problems for customers around the world on Ubuntu Server, Ubuntu Desktop and on the public cloud. They demonstrate two key attributes: customer focus – ensuring that customers are always satisfied with the service they are receiving, and technical excellence – ensuring that the support team is always up to date with the our technology, and that they perform sound and quick troubleshooting. We are looking for managers for both of our support groups; Cloud Support Group and Devices Support Group.&lt;/p&gt;\n&lt;p&gt;You&#39;ll need to be comfortable in a fast paced environment, able to take responsibility for delivering to customers and enjoy challenges. You will also need to care deeply about your team, their skills, and their career development.&lt;/p&gt;\n&lt;h2&gt;&lt;strong&gt;The role entails&lt;/strong&gt;&lt;/h2&gt;\n&lt;ul&gt;\n&lt;li&gt;Management of a professional support team, including skills development and performance management&lt;/li&gt;\n&lt;li&gt;Operational control, shift scheduling, accountability for key performance indicators (KPIs)&lt;/li&gt;\n&lt;li&gt;Ensures that all customer cases are responded to within the SLA, and in a professional manner&lt;/li&gt;\n&lt;li&gt;Act as the customer escalation contact, and ensure that such escalations are addressed appropriately&lt;/li&gt;\n&lt;li&gt;Accountability for customer satisfaction&lt;/li&gt;\n&lt;li&gt;Contribution to the support knowledge base&lt;/li&gt;\n&lt;li&gt;Continuous improvement to the team&#39;s processes and support service delivery&lt;/li&gt;\n&lt;li&gt;Hire, develop and train support team to match business requirements&lt;/li&gt;\n&lt;li&gt;Work with the leadership team to drive growth and transformation initiatives&lt;/li&gt;\n&lt;/ul&gt;\n&lt;h2&gt;&lt;strong&gt;What are we looking for in you&lt;/strong&gt;&lt;/h2&gt;\n&lt;ul&gt;\n&lt;li&gt;Extensive CLI experience with Linux at a technical level (Support, Development, Implementation)&lt;/li&gt;\n&lt;li&gt;Leadership experience, and preferably team management experience&lt;/li&gt;\n&lt;li&gt;Confidence under pressure, with proven track record of high customer focus&lt;/li&gt;\n&lt;li&gt;Preferably fluent in two languages, English being primary one&lt;/li&gt;\n&lt;li&gt;Excellent communication skills (verbal and written)&lt;/li&gt;\n&lt;li&gt;Experience or knowledge of Linux Desktop, OpenStack, Public Cloud or Virtualization technologies&lt;/li&gt;\n&lt;li&gt;Proven track record of contributing to Open Source projects&lt;/li&gt;\n&lt;li&gt;Software development experience&lt;/li&gt;\n&lt;li&gt;Experience in working in support organizations&lt;/li&gt;\n&lt;li&gt;Hands on experience with Canonical&#39;s products&lt;/li&gt;\n&lt;/ul&gt;\n&lt;h2&gt;&lt;strong&gt;What we offer colleagues&lt;/strong&gt;&lt;/h2&gt;\n&lt;p&gt;We consider geographical location, experience, and performance in shaping compensation worldwide. We revisit compensation annually (and more often for graduates and associates) to ensure we recognise outstanding performance. In addition to base pay, we offer a performance-driven annual bonus or commission. We provide all team members with additional benefits, which reflect our values and ideals. We balance our programs to meet local needs and ensure fairness globally.&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;Distributed work environment with twice-yearly team sprints in person&lt;/li&gt;\n&lt;li&gt;Personal learning and development budget of USD 2,000 per year&lt;/li&gt;\n&lt;li&gt;Annual compensation review&lt;/li&gt;\n&lt;li&gt;Recognition rewards&lt;/li&gt;\n&lt;li&gt;Annual holiday leave&lt;/li&gt;\n&lt;li&gt;Maternity and paternity leave&lt;/li&gt;\n&lt;li&gt;Employee Assistance Programme&lt;/li&gt;\n&lt;li&gt;Opportunity to travel to new locations to meet colleagues&lt;/li&gt;\n&lt;li&gt;Priority Pass, and travel upgrades for long haul company events&lt;/li&gt;\n&lt;/ul&gt;\n&lt;h3&gt;&lt;strong&gt;About Canonical&lt;/strong&gt;&lt;/h3&gt;\n&lt;p&gt;Canonical is a pioneering tech firm at the forefront of the global move to open source. As the company that publishes Ubuntu, one of the most important open source projects and the platform for AI, IoT and the cloud, we are changing the world of software. We recruit on a global basis and set a very high standard for people joining the company. We expect excellence - in order to succeed, we need to be the best at what we do. Most colleagues at Canonical have worked from home since its inception in 2004.​ Working here is a step into the future, and will challenge you to think differently, work smarter, learn new skills, and raise your game.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Canonical is an equal opportunity employer&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;We are proud to foster a workplace free from discrimination. Diversity of experience, perspectives, and background create a better work environment and better products.&lt;a href=&quot;https://canonical.com/careers/diversity/identity&quot;&gt; Whatever your identity, we will give your application fair consideration.&lt;/a&gt;&lt;/p&gt;\n&lt;p&gt;#LI-remote&lt;/p&gt;","tags":"[\"management\",\"engineering\"]","pubDate":"2025-05-01T16:05:23.000Z","link":"https://job-boards.greenhouse.io/canonical/jobs/6854119","slug":"support-engineering-manager-canonical-1785"},{"id":6721587171,"title":"Core Network Engineer","company":"Airalo","image":"https://lever-client-logos.s3.us-west-2.amazonaws.com/55028a36-609c-479c-9553-d4689ff2dd8c-1669620566663.png","description":"<div><b>About Airalo</b></div><div>Alo! Airalo is the world’s first eSIM store that helps people connect in over 200+ countries and regions across the globe. We are building the next digital service that revolutionizes the telecom industry. We are a travel-tech company and an equal-opportunity environment that values and executes diversity, inclusion, and equity. Our team is spread across 50+ countries and six continents. What glues us together is our commitment to changing the way you connect<span style=\"font-size: 13.3333px\">. </span></div><div><br></div><div><b>About you</b></div><div>We hope that you care deeply about the quality of your work, the intrinsic worth of tasks, and the success of your team. You are self-disciplined and do not require micromanagement in terms of your skillset and work ethic. You do your best to flourish as an individual every day while working hard to foster a collaborative team environment. You believe in the importance of being — and staying — authentic, honest, positive, and kind. You are a good interlocutor with clear and concise communication. You are able to manage multiple projects, have an analytical mind, pay keen attention to detail, and love to get your hands dirty. You are cognizant, tolerant, and welcoming of vulnerabilities and cultural differences.</div><div><br></div><div><b>About the Role</b></div><div><b>Position</b>: Full-time / Employee</div><div><b>Location:</b>&nbsp;Remote-first </div><div><b>Benefits:</b>&nbsp;Health Insurance, work-from-anywhere stipend, annual wellness &amp; learning credits, annual all-expenses-paid company retreat in a gorgeous destination &amp; other benefits</div><h3>Responsibilities include but are not limited to:</h3><li>Designing the IP infrastructure of our multi-site data centers</li><li>Designing the GRX/IPX interconnectivity and global PoP structure to access mobile partner networks</li><li>Defining the WAN network strategy</li><li>Leading and realization of the data centre LAN and WAN networks, specifically the configuration of DRAs, GTPs, GGSN/PGW, SBC, FW, Routers</li><li>Integrating direct roaming agreements and sponsored roaming agreements</li><li>Tracing of signalling and user plane transport for debug issues</li><li>Acting as a primary interface between the Core Network team and Airalo’s Platform team, Airalo’s Network Operations team and technology partners (vendors, roaming partners)</li><li>Core network optimisation and enhancement</li><li>Supports the operations team in regards to:</li><li>Deployments and rollouts</li><li>Performance improvements</li><li>Perform trainings</li><li>Supporting the partner’s operations team</li>,<h3>Must-haves:</h3><li>Technical Degree in Engineering or Telecommunications preferred or equivalent experience demonstrated</li><li>3 - 5 years minimum relevant experience in the telecom core field</li><li>3+ years experience with network elements such as: Packet Gateway GGSN/PGW/DPI, direct and sponsored roaming (HLR/HSS), diameter routing and GTP, GRX</li><li>3+ years experience with these protocols; Sigtran: MAP (Mobile Application Protocol), Sigtran: CAP (Camel 1-3), Diameter (Ro, Gx, Gy, Gn, Gi), REST API, BGP</li><li>Excellent verbal and written communication skills</li>,<h3>Good to have:</h3><li>IREG Testing experience is preferred</li><li>International working experience is ideal</li><div>If you are interested in this position, <b>please apply via the link. </b></div><div><span style=\"font-size: 10px;\"><i>#LI-TE1 </i></span></div><div><br></div><div>We sincerely thank all applicants in advance for submitting their interest in this opportunity. Airalo is an equal opportunity employer and values diversity, equity &amp; inclusion. We do not discriminate on the basis of race, religion, national origin, gender, sexual orientation, age, marital status, veteran status, or disability status. We are committed to providing reasonable accommodations upon request for individuals with disabilities throughout our job interview process.</div>","tags":"[\"management\",\"engineering\"]","pubDate":"2025-05-01T09:36:37.206Z","link":"https://jobs.lever.co/airalo/7754ff56-a86c-4d39-9ae3-1ee28b4d39f6","slug":"core-network-engineer-airalo-6115"},{"id":4961621145,"title":"EUX Engineer","company":"Greenpages","image":"https://remotive.com/job/2002105/logo","description":"<div><!--block-->The EUX Engineer L2 position offers support to Managed Services contract clients, handling first-level ticket support and serving as the escalation point for more complex issues. Additionally, this role provides guidance and support to the Level I team. The ideal candidate will have a proactive attitude, be a team player, and be willing to go the extra mile to assist team members and resolve client issues.</div>\n<p><br><br></p>\n<div class=\"h3\">Key Responsibilities</div>\n<ul style=\"\">\n<li style=\"\"><!--block-->Resolve problems reported to the call center by phone or web tickets.</li>\n<li style=\"\"><!--block-->Provide first-level contact and problem resolution for customer issues.</li>\n<li style=\"\"><!--block-->Provide timely communication on service ticket status and resolution.</li>\n<li style=\"\"><!--block-->Assist Level I technicians with escalated issues. </li>\n<li style=\"\"><!--block-->Update and maintain Help Desk Documentation and knowledgebase articles. </li>\n<li style=\"\"><!--block-->Review and update Help Desk documentation as assigned.</li>\n<li style=\"\"><!--block-->Review and create KB articles.</li>\n</ul>\n<div><!--block--><strong>Other functions as directed by management.</strong></div>\n<ul style=\"\">\n<li style=\"\"><!--block-->Answer phone calls entered into the call center by the SLA.  Resolve or escalated as needed.</li>\n<li style=\"\"><!--block-->Acknowledge and work on incoming Help Desk web tickets by the SLA guidelines.  Resolve or escalate as needed.</li>\n<li style=\"\"><!--block-->Work on tickets escalated by Level I engineers.</li>\n<li style=\"\"><!--block-->Create tickets and return calls to customer within the timeframe stipulated in the standard SLA.</li>\n<li style=\"\"><!--block-->Quickly and effectively communicate with customers within the SLA timeframe.</li>\n<li style=\"\"><!--block-->Work with vendor to resolve issues as required.</li>\n<li style=\"\"><!--block-->Configure/image desktops or laptops as needed.</li>\n<li style=\"\"><!--block-->Continually update and improve customer network documentation.</li>\n<li style=\"\"><!--block-->Continuously improve upon technical skills sets within assigned areas of expertise.</li>\n<li style=\"\"><!--block-->Continuously improve upon soft skill sets required to deliver outstanding customer service in a fast paced environment.</li>\n<li style=\"\"><!--block-->Regular, predictable and punctual attendance. </li>\n<li style=\"\"><!--block-->May occasionally need to work on holidays.</li>\n</ul>\n<div><!--block--><strong>Additional / Non-Essential Responsibilities:</strong></div>\n<ul style=\"\">\n<li style=\"\"><!--block-->Research and contribute technical information to the internal knowledgebase.</li>\n<li style=\"\"><!--block-->Develop expertise with GreenPages products and services to be used when working with customers.</li>\n</ul>\n<div><!--block--></div>\n<p><br><br></p>\n<div class=\"h3\">Skills, Knowledge &amp; Expertise</div>\n<ul style=\"\">\n<li style=\"\"><!--block-->3-5+ years Technical Call Center/Help Desk experience </li>\n<li style=\"\"><!--block-->Comfortable with working on multiple open tickets simultaneously.</li>\n<li style=\"\"><!--block-->Comfortable with investigating, analyzing and troubleshooting client issues. </li>\n<li style=\"\"><!--block-->Able to make decisions on service ticket resolution without supervision.</li>\n<li style=\"\"><!--block-->Provide training to fellow team members and Level I engineers.</li>\n<li style=\"\"><!--block-->Proficient in at the following:</li>\n<li style=\"\"><!--block-->Windows Operating systems – Windows, 10-11</li>\n<li style=\"\"><!--block-->MS Office applications (Outlook, Word, Excel, PowerPoint, Visio, Project) </li>\n<li style=\"\"><!--block-->M365 and EntraID administration</li>\n<li style=\"\"><!--block-->Intermediate network support:</li>\n<li style=\"\"><!--block-->Understanding of a domain/corporate IT environment including PC/Laptop setup and troubleshooting steps.</li>\n<li style=\"\"><!--block--> Basic knowledge of network technologies (LAN, WAN, wireless)</li>\n<li style=\"\"><!--block-->VPN clients (Cisco, SonicWall, Fortinet, etc.)</li>\n</ul>\n<div><!--block--><strong>Computer hardware support:</strong></div>\n<ul style=\"\">\n<li style=\"\"><!--block-->Troubleshoot issues with laptops, desktops, and thin clients</li>\n<li style=\"\"><!--block-->USB device support and other peripherals</li>\n</ul>\n<div><!--block--><strong>Security support:</strong></div>\n<ul style=\"\">\n<li style=\"\"><!--block-->Basic knowledge of security principals and best practices </li>\n<li style=\"\"><!--block-->Virus and malware identification and remediation.</li>\n<li style=\"\"><!--block-->Antivirus and Next Gen Antivirus tools (Sophos, Vipre, Crowdstrike, etc.)</li>\n</ul>\n<div><!--block--><strong>Printer support:</strong></div>\n<ul style=\"\">\n<li style=\"\"><!--block-->Setup/install local, wireless, and network printers</li>\n<li style=\"\"><!--block-->Troubleshoot hardware printer issues</li>\n</ul>\n<div><!--block--><strong>Mobile device support:</strong></div>\n<ul style=\"\">\n<li style=\"\"><!--block-->Setup and troubleshoot issue with iPhone, Windows Mobile, Android, etc. </li>\n<li style=\"\"><!--block-->Install and troubleshoot broadband wireless devices and software. </li>\n</ul>\n<div><!--block--><strong>Active Directory Administration:</strong></div>\n<ul style=\"\">\n<li style=\"\"><!--block-->Maintain user accounts in Active Directory</li>\n<li style=\"\"><!--block-->Security Group creation</li>\n<li style=\"\"><!--block-->Maintain user accounts for VPN sessions</li>\n</ul>\n<div><!--block--><strong>Security:</strong></div>\n<ul style=\"\">\n<li style=\"\"><!--block-->Setup and troubleshoot issue with iPhone, Windows Mobile, Android, etc. </li>\n<li style=\"\"><!--block-->Install and troubleshoot broadband wireless devices and software</li>\n<li style=\"\"><!--block-->Familiarity with Security Applications (Sophos, Rapid7, etc.)</li>\n<li style=\"\"><!--block-->Strong understanding of Spam applications (Defender, Mimecast, Proofpoint)</li>\n</ul>\n<div><!--block--></div>\n<ul style=\"\">\n<li style=\"\"><!--block-->Associates Degree in Information Technology or equivalent experience.</li>\n<li style=\"\"><!--block-->At least 1 of the following relevant industry certifications is preferred:</li>\n<li style=\"\"><!--block-->CompTIA  A+</li>\n<li style=\"\"><!--block-->Network+</li>\n<li style=\"\"><!--block-->MCDST</li>\n<li style=\"\"><!--block-->HDI-SCA – HDI Support Center Analyst</li>\n</ul>\n<div><!--block--><br>Blue Mantis is an Equal Opportunity Employer. We celebrate diversity and are committed to creating an inclusive environment for all employees. All qualified applicants will receive consideration for employment without regard to race, color, religion, sex, sexual orientation, gender identity, national origin, disability, veteran status, or any other legally protected characteristic.<br><br><strong>Agencies/3 Parties may not solicit to any employee of Blue Mantis. Any candidate information received from any Agency/3 Party will be considered a gift and property of Blue Mantis, unless the Agency/3 Party is an Authorized Vendor of Blue Mantis with an up-to-date Blue Mantis Contract in hand signed by Blue Mantis Talent Acquisition. No payment will be made to any Agency/3 Party who is not an Authorized Vendor, nor has specific approval in writing from Blue Mantis Talent Acquisition to engage in recruitment efforts for Blue Mantis. At this time we have no interest in onboarding any new staffing partners.</strong></div>\n<div><!--block--></div>\n<img src=\"https://remotive.com/job/track/2002105/blank.gif?source=public_api\" alt=\"\"/>","tags":"[\"android\",\"cisco\",\"excel\",\"go\",\"security\",\"research\",\"documentation\",\"hardware\",\"vpn\",\"onboarding\",\"MS Office\",\"troubleshooting\",\"SLA\",\"operating systems\",\"LAN\",\"diversity\",\"information technology\",\"outlook\"]","pubDate":"2025-04-30T22:50:33.000Z","link":"https://remotive.com/remote-jobs/customer-support/eux-engineer-2002105","slug":"eux-engineer-greenpages-4209"},{"id":2876667581,"title":"DevOps Engineer","company":"Mob Entertainment","image":"https://remotive.com/job/2002963/logo","description":"<div class='\"content-intro\"'>\n<p><strong>Mob Entertainment </strong>is a startup multimedia studio that is best known for our hit indie horror game \"<strong>Poppy Playtime\"</strong>.  This franchise is one of the hottest new properties in gaming, and our team is naturally expanding as our ambition expands.  <strong>To give a taste of our brand's popularity, more than 100 billion YouTube views of Poppy Playtime related content have occured since the game's launch 4 years ago. </strong></p>\n<p> </p>\n</div>\n<p>Mob Entertainment is seeking a Junior or Mid-Level DevOps Engineer to join our growing Developer Operations team. This role will directly support the infrastructure, tooling, and workflows that power development across all of Mob’s games - including our flagship Poppy Playtime franchise and upcoming original titles.</p>\n<p> </p>\n<p>You’ll work alongside our lead DevOps engineer to maintain, scale, and improve our build and deployment pipelines, reduce iteration times, and unlock greater velocity for all development teams. This role is critical to ensuring that engineers, designers, artists, and QA can move quickly, safely, and efficiently throughout the production cycle.</p>\n<p>If you’re a builder at heart with a passion for tooling, automation, and solving real-world production problems, we want to hear from you.</p>\n<p> </p>\n<p><strong>Responsibilities:</strong></p>\n<ul style=\"\">\n<li style=\"\">Support and maintain CI/CD pipelines, including automation for build generation, testing, and deployment across multiple projects.</li>\n<li style=\"\">Assist with managing Perforce source control, including branching strategies, access, and sync issues.</li>\n<li style=\"\">Monitor, troubleshoot, and improve build stability, lighting compilation, PCV issues, and packaging workflows.</li>\n<li style=\"\">Work closely with the Lead DevOps Engineer to implement systems such as Gauntlet, UGS or UGS-like tools, derived data cache infrastructure, and future-proofed automation layers.</li>\n<li style=\"\">Help deliver builds to QA and production teams with consistency, clarity, and minimal turnaround time.</li>\n<li style=\"\">Participate in release planning and serve as a key partner during patch integration and shipping milestones.</li>\n<li style=\"\">Ensure uptime and continuity of tools and infrastructure - reducing single-point-of-failure risks and increasing build redundancy.</li>\n<li style=\"\">Proactively identify workflow bottlenecks and contribute to new tooling or automation that improves day-to-day development across the studio.</li>\n<li style=\"\">Support studio cybersecurity readiness and incident response processes as needed.</li>\n</ul>\n<p><strong>Requirements:</strong></p>\n<ul style=\"\">\n<li style=\"\">1–4 years of experience in a DevOps, Build Engineering, or Systems Engineering role (games or adjacent industries).</li>\n<li style=\"\">Working knowledge of CI/CD systems (e.g., Jenkins, TeamCity, GitLab CI, etc.) and build automation scripting (e.g., PowerShell, Python, Bash).</li>\n<li style=\"\">Experience with Unreal Engine.</li>\n<li style=\"\">Experience with Perforce or other VCS tools, and comfort navigating large repositories.</li>\n<li style=\"\">Familiarity with build pipelines, packaging systems, and engine-specific data compilation (e.g., lightmaps, shaders, PCVs).</li>\n<li style=\"\">Strong troubleshooting skills and a methodical approach to diagnosing and resolving technical issues.</li>\n<li style=\"\">Excellent communication and documentation skills; able to collaborate effectively with cross-disciplinary teams.</li>\n<li style=\"\">Eagerness to learn, grow, and adapt in a fast-paced, multi-project environment.</li>\n</ul>\n<p><strong>Pluses</strong>:</p>\n<ul style=\"\">\n<li style=\"\">Experience supporting Unreal Engine build systems in a shipped game environment.</li>\n<li style=\"\">Familiarity with UGS (Unreal Game Sync), Gauntlet, or similar automated build/distribution tools.</li>\n<li style=\"\">Understanding of derived data cache (DDC) optimization and configuration.</li>\n<li style=\"\">Scripting or tool development experience in C#, Python, or similar.</li>\n<li style=\"\">Interest or experience in cybersecurity / infrastructure monitoring is a bonus.</li>\n</ul>\n<p><strong>Performance Expectations:</strong></p>\n<ul style=\"\">\n<li style=\"\">Increase studio build reliability and speed, reducing bottlenecks and downtime for other departments.</li>\n<li style=\"\">Help create redundancy in DevOps support, reducing dependency on a single engineer.</li>\n<li style=\"\">Maintain clear documentation, clean build logs, and accessible tools for team-wide usage.</li>\n<li style=\"\">Proactively participate in infrastructure improvements to unlock long-term velocity across all game teams.</li>\n</ul>\n<p><strong>Reporting &amp; Oversight:</strong></p>\n<ul style=\"\">\n<li style=\"\"><strong>Reports to:</strong> Lead DevOps Engineer</li>\n<li style=\"\"><strong>Works closely with:</strong> Engineering, QA, Technical Design, Production</li>\n<li style=\"\"><strong>Communication Tools:</strong> Slack, Jira, Confluence</li>\n</ul>\n<p>If you're ready to help build the systems that build the games, and you want to make a studio-wide impact by supporting every team, this role is a critical part of Mob’s next chapter.</p>\n<p> </p>\n<p>#LI-remote</p>\n<div class='\"content-conclusion\"'>\n<p>Mob Entertainment is an equal opportunity employer. We do not discriminate on the basis of race, color, religion or religious creed, sexual orientation, gender, gender identity, marital status, family or parental status, disability, military or veteran status, or any other basis protected by law. All employment decisions are based on a person’s merit, business needs, and role requirements. If you require further accommodations or have questions regarding accessibility of our roles, please reach out to info@mobentertainment.com</p>\n</div>\n<img src=\"https://remotive.com/job/track/2002963/blank.gif?source=public_api\" alt=\"\"/>","tags":"[\"troubleshooting\"]","pubDate":"2025-04-30T20:50:44.000Z","link":"https://remotive.com/remote-jobs/devops/devops-engineer-2002963","slug":"devops-engineer-mob-entertainment-8880"},{"id":9317942078,"title":"Full-Stack Software Engineer","company":"Gradient AI","image":"https://remotive.com/job/2003128/logo","description":"<p><strong><em>This is a fully remote opportunity</em></strong></p>\n<p><strong>Gradient AI:  </strong>  </p>\n<p>Gradient AI is revolutionizing Group Health and P&amp;C insurance with AI-powered solutions that help insurers predict risk more accurately, improve profitability, and automate underwriting and claims. Our SaaS platform taps into one of the industry’s largest data lakes—tens of millions of policies and claims—to deliver deep, actionable insights. Trusted by leading carriers, MGAs, TPAs, and self-insured employers, Gradient AI has grown rapidly since our founding in 2018. Backed by $56M in Series C funding, we're scaling fast—and it's an exciting time to join the team. </p>\n<p><strong>About the Role:  </strong>  </p>\n<p>If you want to work on cutting edge technology with friendly, intelligent people in a highly collaborative environment, then Gradient AI is the right place for you. We’re looking for a Full-Stack Software Engineer to join our team and help build scalable, client-facing applications. The ideal candidate is a life-long learner who knows Python, with strong analytical skills and an interest in the insurance industry.  </p>\n<p><strong>How you will make an impact:</strong></p>\n<ul style=\"\">\n<li style=\"\">Build and maintain client-facing web applications using React for the front end and Flask for the back end.</li>\n<li style=\"\">Collaborate with the product team to design, develop, and deploy new features and functionality for our web apps and SaaS products.</li>\n<li style=\"\">Develop and maintain APIs that integrate seamlessly with front-end interfaces and support client needs.</li>\n<li style=\"\">Work closely with our data science and data engineering teams to build robust data pipelines and workflows.</li>\n<li style=\"\">Develop intuitive dashboards and business intelligence tools that help our clients make data-driven decisions.</li>\n</ul>\n<p> <strong>Skills needed to succeed:</strong></p>\n<ul style=\"\">\n<li style=\"\">3+ years of experience as a full-stack developer, with deep expertise in React (component-based architecture, state management, hooks) and Python (Flask, API development).</li>\n<li style=\"\">Strong experience in JavaScript/TypeScript and modern front-end technologies like Vite.</li>\n<li style=\"\">Proficiency with relational databases, including schema design, query optimization, and performance tuning.</li>\n<li style=\"\">Experience with CI/CD pipelines and containerization technologies like Docker and Kubernetes.</li>\n<li style=\"\">A high degree of organization and the ability to manage multiple projects simultaneously while meeting deadlines.</li>\n</ul>\n<p><strong>What We Offer:</strong>  </p>\n<ul style=\"\">\n<li style=\"\">A fun, team-oriented startup culture.  </li>\n<li style=\"\">Generous stock options - we all get to own a piece of what we’re building.  </li>\n<li style=\"\">Unlimited vacation days.  </li>\n<li style=\"\">Flexible schedule that supports working from home.  </li>\n<li style=\"\">Full benefits package includes medical, dental, vision, 401k, paid paternal leave, and more.  </li>\n<li style=\"\">Ample opportunities to learn and take on new responsibilities.  </li>\n</ul>\n<p>We are an equal opportunity employer. </p>\n<img src=\"https://remotive.com/job/track/2003128/blank.gif?source=public_api\" alt=\"\"/>","tags":"[\"docker\",\"javascript\",\"python\",\"react\"]","pubDate":"2025-04-30T16:50:13.000Z","link":"https://remotive.com/remote-jobs/software-dev/full-stack-software-engineer-2003128","slug":"full-stack-software-engineer-gradient-ai-9423"},{"id":7710630147,"title":"Video Editor","company":"Stockpile ","image":"https://remotive.com/job/2000809/logo","description":"<div>Stockpile is on a mission to make investing more accessible, educational, and engaging—especially for families and first-time investors. We’re looking for a <strong>creative, detail-oriented, and fast-moving video editor </strong>to help us bring our content to life. </div>\n<div> </div>\n<div>You’ll be the editing brain behind our long form <strong>YouTube content </strong>and <strong>paid ad campaigns</strong>, helping us deliver high-quality, on-brand content that educates, entertains, and converts. </div>\n<div> </div>\n<div><strong>PLEASE INCLUDE A PORTFOLIO IN YOUR APPLICATION. ANY APPLICATIONS WITHOUT PORTFOLIOS WILL NOT BE SELECTED. </strong></div>\n<div> </div>\n<div><strong>What You’ll Do: </strong></div>\n<div> </div>\n<div>● Edit <strong>long-form YouTube videos </strong>(10–20 mins), including interviews, tutorials, and series-style content. </div>\n<div>● Create <strong>high-performing ad creatives </strong>for YouTube and Google using existing and new footage. </div>\n<div>● Collaborate with our marketing team to ensure storytelling aligns with Stockpile’s tone and goals. </div>\n<div>● Add motion graphics, captions, and light animations to enhance content and improve viewer retention. </div>\n<div>● Implement feedback quickly and deliver drafts on a tight schedule. </div>\n<div>● Optimize videos for platform-specific formats and trends.</div>\n<div>○ <a class=\"postings-link\" href=\"https://www.youtube.com/watch?v=0_im-dqxfgI&amp;ab_channel=Kittl\" rel=\"nofollow\">Example video 1 </a></div>\n<div>○ <a class=\"postings-link\" href=\"https://www.youtube.com/watch?v=NLypiQlLgyU&amp;ab_channel=Wix\" rel=\"nofollow\">Example video 2 </a></div>\n<div> </div>\n<div> <strong>What We’re Looking For: </strong></div>\n<div>● Proven experience editing <strong>long-form YouTube content </strong>and <strong>digital ads </strong>(portfolio required). </div>\n<div>● Strong command of pacing, narrative structure, and visual storytelling. </div>\n<div>● Skilled in Premiere Pro, After Effects, or similar professional tools. </div>\n<div>● Familiarity with <strong>YouTube SEO best practices</strong>, CTAs, and visual hooks. </div>\n<div>● <strong>Bonus</strong>: Experience with <strong>finance, fintech, or educational content</strong>. </div>\n<div>● Excellent communication, responsiveness, and ability to self-manage. </div>\n<div> </div>\n<div><strong>Perks: </strong></div>\n<div>● Competitive hourly/project-based rate </div>\n<div>● Flexible, remote work </div>\n<div>● Opportunity to shape the visual direction of a growing brand </div>\n<div>● Work on content that genuinely helps people build financial literacy and confidence </div>\n<div> </div>\n<div><strong>Apply Now: </strong></div>\n<div>Send your <strong>portfolio, rates, and availability </strong>and let’s make money talk cool, clear, and clickable. </div>\n<img src=\"https://remotive.com/job/track/2000809/blank.gif?source=public_api\" alt=\"\"/>","tags":"[\"after effects\",\"video editing\"]","pubDate":"2025-04-30T14:51:33.000Z","link":"https://remotive.com/remote-jobs/all-others/video-editor-2000809","slug":"video-editor-stockpile-9691"},{"id":1549554893,"title":"Junior Risk Analyst","company":"Tabby","image":"https://remotive.com/job/2002197/logo","description":"<div><!--block-->About Us:<br><br>Tabby creates financial freedom in the way people shop, earn and save by reshaping their relationship with money. The company’s flagship offering allows shoppers to split their payments online and in-store with no interest or fees. Over 32,000 global brands and small businesses, including Amazon, Noon, IKEA and Shein, use Tabby to accelerate growth and gain loyal customers by offering easy and flexible payments online and in stores. Tabby has generated over $7 billion in transaction volume for its partner brands and has the highest-rated, most-reviewed, largest and fastest-growing app of any fintech in the GCC region. Tabby launched operations in 2020 and has raised +$1 billion in equity and debt funding from global and regional investors.<br><br>About the Role:<br><br>We’re looking for a smart and driven Junior Risk Analyst to join our Risk team. You don’t need years of experience — just strong analytical thinking, attention to detail, and a willingness to learn. This is a great opportunity for someone early in their career who wants to grow fast in a data-driven fintech environment.<br><br><br></div><br><br><div class=\"h3\">Key Responsibilities</div><ul style=\"\"><li style=\"\"><!--block-->Support the team with risk analysis, reporting, and monitoring</li><li style=\"\"><!--block-->Learn how credit and fraud risk is managed in a BNPL product</li><li style=\"\"><!--block-->Run queries, analyze trends, and help improve risk processes</li><li style=\"\"><!--block-->Collaborate with Data, Product, and Operations to understand business needs</li><li style=\"\"><!--block-->Contribute to experimentation and testing of risk policies</li></ul><br><br><div class=\"h3\">Skills, Knowledge &amp; Expertise</div><ul style=\"\"><li style=\"\"><!--block-->0–1 years of experience</li><li style=\"\"><!--block-->Strong interest in data and risk analytics</li><li style=\"\"><!--block-->Basic knowledge of SQL and Tableau</li><li style=\"\"><!--block-->Organized, curious, and eager to solve problems</li><li style=\"\"><!--block-->Good communication skills and team spirit</li></ul><br><br><div class=\"h3\">Job Benefits</div><ul style=\"\"><li style=\"\"><!--block-->A competitive salary dependent upon experience</li><li style=\"\"><!--block-->Excellent health benefits</li><li style=\"\"><!--block-->We offer flexible working hours and trust you to work enough hours to do your job well at times that suit you and your team.</li><li style=\"\"><!--block-->A working environment that gives you autonomy and responsibility from day one</li><li style=\"\"><!--block-->You should be comfortable with the idea that the quality of your work will influence the shape of your career.</li><li style=\"\"><!--block-->We are passionate about creating an equitable, high-performing workplace that gives people from all backgrounds the support they need to thrive, grow, and meet their goals (whatever they may be)</li><li style=\"\"><!--block-->Participation in the company’s employee stock options program.</li></ul><div><!--block--><br></div><img src=\"https://remotive.com/job/track/2002197/blank.gif?source=public_api\" alt=\"\"/>","tags":"[\"sql\",\"tableau\"]","pubDate":"2025-04-30T14:51:25.000Z","link":"https://remotive.com/remote-jobs/data/junior-risk-analyst-2002197","slug":"junior-risk-analyst-tabby-7236"},{"id":7663144683,"title":"Sales / Account Manager","company":"IspeedToLead","image":"https://remotive.com/job/2003136/logo","description":"<p>Are you looking for a <strong>high-energy sales role</strong> with <strong>unlimited revenue-based bonuses</strong>, <strong>rapid career growth</strong>, and <strong>trustworthy solutions</strong>? Join <strong>iSpeedToLead</strong>, the leader in <strong>PropTech and SaaS for real estate</strong>. We’re hiring for inbound roles because we have <strong>too many leads to call</strong> and outbound roles because it’s a <strong>superior opportunity</strong> in the most responsive industry for cold outreach.</p><p><br></p><p><strong>Why Join iSpeedToLead?</strong></p><p>✅<strong>Proven Track Record</strong>: 7+ years in the industry, trusted by 29,000+ users, and highly rated on Trustpilot.</p><p>✅ <strong>Explosive, Profitable Growth</strong>: 100% year-over-year growth, debt-free, seed-free, and approaching 8 figures.</p><p>✅ <strong>Unlimited Earnings</strong>: Competitive base salary plus uncapped commissions paid bi-weekly.</p><p>✅<strong>Innovative Solutions</strong>: Sell cutting-edge PropTech and SaaS tools that <strong>transform lives</strong>. With solutions tailored for every budget, you’ll never have to sell what people don’t need.</p><p>✅ <strong>Fast Hiring Process</strong>: Apply today, complete your application, interview with our VP of Sales, and get a <strong>job offer or valuable feedback on the spot</strong>.</p><p>✅ <strong>Personal Branding</strong>: Build your reputation in a thriving industry with our support.</p><p>✅ <strong>Transparent Onboarding</strong>: Get clear, actionable feedback and the tools you need to succeed.</p><p><strong><br></strong></p><p><strong>Who We’re Looking For</strong> This isn’t just any sales role—it's for people who thrive on <strong>success, growth, and achieving more.</strong> If you’re someone who doesn’t stop at «good enough» and is always hungry for the next win, this is for you.</p><ul style=\"\"><li style=\"\"><p><strong>Driven individuals</strong> who love sales and the thrill of closing deals.</p></li><li style=\"\"><p><strong>Strong communicators</strong> who build trust and bring energy to every interaction.</p></li><li style=\"\"><p>People with a <strong>relentless drive</strong> to win, grow, and create impact.</p></li><li style=\"\"><p>Leaders who want to scale results in a <strong>fast-growing, high-performance company</strong>.</p></li><li style=\"\"><p>Real estate knowledge is a bonus but not required—training provided.</p></li></ul><p><strong><br></strong></p><p><strong>What You’ll Do</strong></p><ul style=\"\"><li style=\"\"><p><strong>Inbound Roles</strong>: Engage warm leads from our robust pipeline to close deals quickly.</p></li><li style=\"\"><p><strong>Outbound Roles</strong>: Build relationships with real estate investors in an industry where cold outreach thrives.</p></li><li style=\"\"><p><strong>Drive Results</strong>: Exceed targets while helping clients achieve their investment goals.</p></li><li style=\"\"><p><strong>Management Roles</strong>: Build and lead a high-performing team while shaping processes and strategy.</p></li></ul><p><strong><br></strong></p><p><strong>Explore More &amp; Apply Now</strong> Find <strong>employee reviews</strong>, detailed job descriptions, and inspiring videos from clients whose lives we’ve transformed here.</p><p><strong><br></strong></p><p><strong>About us:</strong></p><p><strong>iSpeedToLead </strong>is a leading <strong>real estate SaaS company</strong> that has revolutionized the industry by inventing the live lead marketplace model. We have bootstrapped from 0 to an 8-figure company in just three years and keep growing — fast. <strong>We are a marketing and technology company</strong> that helps real estate professionals not worry about marketing for leads — we generate all the leads for them and they can pick out ones they like from hundreds of leads daily. We also built an ecosystem of helpful products for both real estate investors and now also real estate agents.</p><p>Our goal is to be the <strong>#1 tech company in real estate</strong> — and we are looking for those who like that vision. Our culture is energetic — and we like high achievers who are emotionally strong and prepared for fast growth and everything that comes with it — demanding deadlines, failures along the way, frequent criticism and improvement feedback, and exhilarating massive wins at the end.</p>\n<img src=\"https://remotive.com/job/track/2003136/blank.gif?source=public_api\" alt=\"\"/>","tags":"[\"saas\",\"brand design\",\"onboarding\",\"marketplace\",\"responsive\"]","pubDate":"2025-04-30T14:16:32.000Z","link":"https://remotive.com/remote-jobs/sales-business/sales-account-manager-2003136","slug":"sales-account-manager-ispeedtolead-6157"},{"id":9539203396,"title":"Marketing Operations Manager","company":"Lumos","image":"https://remotive.com/job/2001323/logo","description":"<div class='\"content-intro\"'>\n<div>Imagine having an enterprise-grade AppStore at work — one that ensures you can easily search, request, and gain access to any app you need, precisely when you need it. No more long waiting times with outstanding IT requests. Lumos is solving the app and access management challenges for organizations of all sizes through a unified platform. Our fast-growing startup is pioneering the way to untangle the complex web of app and access management by building the critical infrastructure that defines relationships between app, identities and data.</div>\n<div> </div>\n<div><strong>Why Lumos?</strong></div>\n<div>\n<ul style=\"\">\n<li style=\"\"><strong>Jump on a Rocketship:</strong> Since launching out of stealth mode just over 2 years ago, our team has grown from 20 to ~100 people and our customer base has 10x’ed with companies like GitHub, MongoDB and Major League Baseball!</li>\n<li style=\"\"><strong>Build with Renowned Investor Backing: </strong>Andreessen Horowitz (a16z) backed us since the beginning and we've raised over $65m from Scale, Neo, Greg Brockman (President at OpenAI), Phil Venables (CISO at Google), and others.</li>\n<li style=\"\"><strong>Thrive in a Unique Culture: </strong>You’ll join an early-stage company where you have actual influence on the trajectory of the company. We deeply care about our people and the philosophy we live by - check out <a href=\"%22https:/blog.lumos.com/p/the-anatomy-of-an-alchemist%22\" rel=\"nofollow\" target='\"_blank\"'>our values here</a>.</li>\n</ul>\n</div>\n</div>\n<div class=\"h3\">🌎 About the Role:</div>\n<p>The Marketing Operations Manager is the force multiplier of the marketing team. Your mission to is orchestrate the many moving parts of marketing into a cohesive force, enabling each and every member of your team to accomplish their goals through the 3 P’s of marketing operations. Through your efforts, you will essentially create a marketing machine that can meet the needs of a rapidly scaling company. </p>\n<div class=\"h3\">✨ <strong>Your Responsibilities</strong></div>\n<ul style=\"\">\n<li style=\"\"><strong>Own the Marketing tech stack and budget -</strong> Assess, procure, and manage all marketing tech and vendors, as well as shared GTM tech and vendors. You will assure that every vendor we engage with is strategically and financially aligned with our GTM goals, while reducing and eliminating spend where it is not. Responsible for the deployment, configuration, and administration of both net new and existing tools.</li>\n<li style=\"\"><strong>Analytics, Reporting, Dashboarding -</strong> Build reports and dashboards that measure key metrics for your business stakeholders. You should not only be able to review those success metrics, but combine them with your insights and analysis to make recommendations to accelerate deliverable success and avoid pitfalls.</li>\n<li style=\"\"><strong>Be the Bridge to GTM -</strong> Partner with key cross functional stakeholders in other departments such as Sales, RevOps, CS, and Finance to ensure the team is aligned in how we target, measure, and respond. You will often be the resource that people throughout the company will reach out to tackle new and existing challenges.</li>\n<li style=\"\"><strong>Create Scalable Processes and Frameworks -</strong> Enable the team to go faster by creating and adjusting processes. Everything you create should have an eye towards scalability and growth.</li>\n</ul>\n<div class=\"h3\">🙌 <strong>What We Value</strong></div>\n<p>We value leaders with a proven track record of building and scaling early-stage B2B marketing teams. Someone who understands how to drive results through processes, structure, and repeatability. This individual is collaborative and adaptable, able to leverage all the tools at their disposal to accelerate the results of their respective partners. You’re deeply analytical and bring a data informed mindset. You’re not afraid to give input where it’s needed, but can do so in a respectful manner that fosters teamwork and cooperation.</p>\n<p>Thanks for considering Lumos! We can’t wait to explore your impact and vision.</p>\n<p> </p>\n<p> </p>\n<div class='\"content-conclusion\"'>\n<div class=\"h3\">💸 Benefits and Perks:</div>\n<ul style=\"\">\n<li style=\"\">💯 Remote work culture (+/-4 hours Pacific Time)</li>\n<li style=\"\">⛑ Medical, Vision, &amp; Dental coverage covered by Lumos</li>\n<li style=\"\">🛩 Company and team bonding trips throughout the year fully covered by Lumos</li>\n<li style=\"\">💻 Optimal WFH setup to set you up for success</li>\n<li style=\"\">🌴 Unlimited PTO, with <em>minimum time off</em> to make sure you are rested and able to be at your best</li>\n<li style=\"\">👶🏽 Up to 16 weeks for expecting parents</li>\n<li style=\"\">💰 Wellness stipend to keep you awesome and healthy</li>\n<li style=\"\">🏦 401k matching plan </li>\n</ul>\n</div>\n<img src=\"https://remotive.com/job/track/2001323/blank.gif?source=public_api\" alt=\"\"/>","tags":"[\"go\",\"mongoDB\",\"analytics\",\"marketing operations\",\"startup\",\"infrastructure\",\"github\"]","pubDate":"2025-04-30T12:50:14.000Z","link":"https://remotive.com/remote-jobs/marketing/marketing-operations-manager-2001323","slug":"marketing-operations-manager-lumos-5479"},{"id":9400517203,"title":"Design Engineer","company":"Istari","image":"https://assets-global.website-files.com/63b69f7a133ca74eec1ac0a1/64f73c95526a7efe5ce7e208_Istari-white.svg","description":"<div>[ABOUT ISTARI DIGITAL]</div><div><span style=\"font-size: 11pt\">Istari is a digital engineering software company enabling our customers to turn the physical world into the digital to accomplish their specific mission or business objectives.</span></div><div><br></div><div><span style=\"font-size: 11pt\">Istari was founded with the vision of making open, scalable digital engineering ecosystems a reality – where new technologies and systems are created digitally, free from the real-world constraints of costs and schedules. We are creating the world’s best engineering model sharing platform, allowing our customers to simply and securely integrate their models across different engineering disciplines, organizations, and security levels.</span></div><div><br></div><div><span style=\"font-size: 11pt\">At Istari, we are passionate about our mission of creating the world's first open and scalable industrial metaverse. Whether our customers are designing prototypes, performing virtual testing, or training AI and autonomy for complex systems, we know that going digital will save them time, resources, and reduce their environmental impact.&nbsp;&nbsp;</span></div><div><br></div><div><span style=\"font-size: 11pt\">While we are a distributed team with most team-members working remotely, we place an emphasis on staying connected and collaborative, prioritizing in-person opportunities to build trust as a team. At Istari, we still believe that trust is best built in-person. To do this, we have an engineering headquarters in Cambridge, MA for focused technical development and several times per year we gather for an off-site that allows us to develop our professional skills and our team relationships.</span></div><div><br></div><div>[VALUES]</div><div>At Istari, we live by our values, which include:</div><div><br></div><div><b>Purposeful Autonomy</b></div><div>We value letting people self-organize and self-motivate.&nbsp;</div><div>Our flat structure and lack of meeting clutter are meant to empower individuals and teams to be proactive.</div><div>Our autonomy is measured, goal-oriented, and results-driven –&nbsp;not meandering. </div><div>Clear objectives help us prioritize our time.</div><div><br></div><div><b>Smart Transparency</b></div><div>We believe in honest-but-kind communication, transparency, and open-door policies. </div><div>We love learning about challenges and tackling them early, not hearing good or bad news late. </div><div>We share work-in-progress across our team.&nbsp;</div><div>Fast feedback keeps autonomy purposeful.</div><div><br></div><div><b>Continual Curiosity</b></div><div>At Istari, we love learning to do things ourselves. </div><div>We ask, read, share, teach – even watch YouTube videos – to learn new skills to solve problems. </div><div>When we make breakthroughs, we write them down.&nbsp; &nbsp;</div><div>Writing focuses ideas, helps us learn, and helps us share.</div><div><br></div><div><b>Equal Opportunity </b></div><div>Istari is an Equal Opportunity/Affirmative Action Employer. All qualified applicants will receive consideration for employment without regard to race, color, religion, sex, pregnancy, sexual orientation, gender identity, national origin, age, protected veteran status, or disability status.</div><div><br></div><div><br></div><div>An exceptional opportunity for a mid-career designer to shape the user experience of complex infrastructure systems. In this role, you will create intuitive interfaces that make sophisticated cloud, security, and data technologies accessible to users with varying technical backgrounds. Your designs will help organizations effectively manage critical infrastructure resources while maintaining security, compliance, and operational efficiency.</div><div><br></div><div>As a Design Technologist specializing in enterprise systems, you will apply user-centered design principles to complex technical environments. You'll work at the intersection of design and technology, building upon your experience simplifying complex scenarios. Your designs will directly impact how organizations deploy, secure, and leverage their mission-critical products in the digital engineering space.</div><div>An exceptional opportunity for a mid-career designer to shape the user experience of complex infrastructure systems. In this role, you will create intuitive interfaces that make sophisticated cloud, security, and data technologies accessible to users with varying technical backgrounds. Your designs will help organizations effectively manage critical infrastructure resources while maintaining security, compliance, and operational efficiency.</div><div><br></div><div>As a Design Technologist specializing in enterprise systems, you will apply user-centered design principles to complex technical environments. You'll work at the intersection of design and technology, building upon your experience simplifying complex scenarios. Your designs will directly impact how organizations deploy, secure, and leverage their mission-critical products in the digital engineering space.</div><h3>Key Responsibilities</h3><li>You will collaborate with cross-functional teams of product managers, engineers, and customer success professionals to identify user needs and create elegant solutions for infrastructure management. This process begins with conducting user research to understand the workflows, pain points, and mental models of digital engineering specialists. You will translate these insights into wireframes, prototypes, and high-fidelity designs that address complex challenges while maintaining simplicity and usability.</li><li>Creating intuitive visualizations is central to this role. You will design interfaces that represent complex workflows, relationships, permission models, understand system status and make informed decisions. This includes designing dashboards, configuration interfaces, and workflow experiences that balance power with accessibility. You will need to effectively present technical concepts through thoughtful information architecture and visual design.</li><li>Working closely with engineering teams, you will ensure your designs are implemented with fidelity. This involves creating detailed specifications, collaborating during development, and validating the final product against design intentions. You will also contribute to our design system, creating reusable patterns and components specific to infrastructure workflows that promote consistency and accelerate development.</li><li>Throughout the product development cycle, you will conduct usability testing to validate design decisions and iterate based on real user feedback. This requires synthesizing feedback from technical and non-technical users alike to create experiences that serve diverse audiences. You will advocate for user needs while balancing technical constraints and business requirements.</li><h3>Qualifications</h3><li>Bachelor's degree in Design, Human-Computer Interaction, or related field (equivalent practical experience will be considered)</li><li>2-6 years of experience designing digital products, with demonstrated work on technical or enterprise software</li><li>Experience with cloud platforms (AWS, Azure, GCP), security tools, or data management solutions highly valued</li><li>Portfolio showcasing ability to simplify complex technical concepts through thoughtful design</li><li>Experience designing systems for access control, resource management, or data governance</li><li>Proficiency with modern design tools such as Figma, Sketch.</li><li>Familiarity with user research methodologies and usability testing techniques</li><li>Knowledge of design systems and component libraries</li><li>Understanding of web technologies (HTML, CSS, JavaScript)</li><li>Experience with data visualization techniques advantageous but not required</li><li>Knowledge of specific infrastructure technologies (AWS services, security protocols, data platforms like Snowflake) beneficial</li><h3>Skills and Attributes</h3><li>Exceptional interaction design skills with focus on creating intuitive user flows for complex applications</li><li>Strong visual design abilities with attention to detail and consistency across interfaces</li><li>Advanced problem-solving capabilities to address challenging user experience problems in technical environments</li><li>Excellent communication skills for articulating design decisions to diverse stakeholders</li><li>Collaborative team player who thrives in cross-functional environments</li><li>Willingness to embrace feedback as part of the design process</li><li>Curiosity about infrastructure technology and willingness to learn complex technical concepts</li><li>Empathy for users dealing with sophisticated technical systems</li><li>Ability to balance innovation with practicality</li><li>Passion for making complex infrastructure more accessible through thoughtful design</li><div><span style=\"font-size: 24px\">BENEFITS</span></div><div>We offer highly competitive benefits, including:</div><div><br></div><div><span style=\"font-size: 18px\">Health and Family</span></div><div>- Medical/Dental/Vision</div><div>- Employee Premiums are 100% Company Paid</div><div>- Life Insurance</div><div>- Flexible Work Hours&nbsp;</div><div>- Unlimited Paid Time Off (PTO) with federal government holidays</div><div><br></div><div><span style=\"font-size: 18px\">Financial</span></div><div>- Competitive Compensation&nbsp;</div><div>- 401k&nbsp;</div><div>- Company Stock Options</div><div>- Home Office Setup Budget</div><div><br></div><div><span style=\"font-size: 18px\">Learning</span></div><div>- Reimbursement for approved trainings and subscriptions</div><div>- Conferences (travel, lodging, and fees)</div><div><br></div><div>Note - some benefits are not available to interns or contractors.</div><div><br></div><div>Thank you for your interest in Istari. Expect to hear back from us soon with next steps.</div><div>[ABOUT ISTARI DIGITAL]</div><div><span style=\"font-size: 11pt\">Istari is a digital engineering software company enabling our customers to turn the physical world into the digital to accomplish their specific mission or business objectives.</span></div><div><br></div><div><span style=\"font-size: 11pt\">Istari was founded with the vision of making open, scalable digital engineering ecosystems a reality – where new technologies and systems are created digitally, free from the real-world constraints of costs and schedules. We are creating the world’s best engineering model sharing platform, allowing our customers to simply and securely integrate their models across different engineering disciplines, organizations, and security levels.</span></div><div><br></div><div><span style=\"font-size: 11pt\">At Istari, we are passionate about our mission of creating the world's first open and scalable industrial metaverse. Whether our customers are designing prototypes, performing virtual testing, or training AI and autonomy for complex systems, we know that going digital will save them time, resources, and reduce their environmental impact.&nbsp;&nbsp;</span></div><div><br></div><div><span style=\"font-size: 11pt\">While we are a distributed team with most team-members working remotely, we place an emphasis on staying connected and collaborative, prioritizing in-person opportunities to build trust as a team. At Istari, we still believe that trust is best built in-person. To do this, we have an engineering headquarters in Cambridge, MA for focused technical development and several times per year we gather for an off-site that allows us to develop our professional skills and our team relationships.</span></div><div><br></div><div>[VALUES]</div><div>At Istari, we live by our values, which include:</div><div><br></div><div><b>Purposeful Autonomy</b></div><div>We value letting people self-organize and self-motivate.&nbsp;</div><div>Our flat structure and lack of meeting clutter are meant to empower individuals and teams to be proactive.</div><div>Our autonomy is measured, goal-oriented, and results-driven –&nbsp;not meandering. </div><div>Clear objectives help us prioritize our time.</div><div><br></div><div><b>Smart Transparency</b></div><div>We believe in honest-but-kind communication, transparency, and open-door policies. </div><div>We love learning about challenges and tackling them early, not hearing good or bad news late. </div><div>We share work-in-progress across our team.&nbsp;</div><div>Fast feedback keeps autonomy purposeful.</div><div><br></div><div><b>Continual Curiosity</b></div><div>At Istari, we love learning to do things ourselves. </div><div>We ask, read, share, teach – even watch YouTube videos – to learn new skills to solve problems. </div><div>When we make breakthroughs, we write them down.&nbsp; &nbsp;</div><div>Writing focuses ideas, helps us learn, and helps us share.</div><div><br></div><div><b>Equal Opportunity </b></div><div>Istari is an Equal Opportunity/Affirmative Action Employer. All qualified applicants will receive consideration for employment without regard to race, color, religion, sex, pregnancy, sexual orientation, gender identity, national origin, age, protected veteran status, or disability status.</div><div><br></div>","tags":"[\"javascript\",\"management\",\"engineering\",\"aws\"]","pubDate":"2025-04-09T19:06:39.589Z","link":"https://jobs.lever.co/istaridigital.ai/75f02ab4-4c43-40b0-9ef4-05b75a1eb846","slug":"design-engineer-istari-1302"}]