[{"id":5129392734,"title":"Executive Assistant and Event Planner (Part-time/Contract)","company":"Timescale","image":"https://pbs.twimg.com/profile_images/1542681228666671107/L5LYJLAD_400x400.png","description":"&lt;p&gt;Timescale is looking for an experienced &lt;strong&gt;Executive Assistant and Event Planner&lt;/strong&gt; with a successful track record of providing administrative support to a CEO and managing company event organization. The ideal candidate will bring a proven track record of planning and executing diverse company events. We are looking for a hands-on person with experience fostering strong relationships with vendors, sponsors, and venues to ensure smooth collaboration and successful events.&lt;/p&gt;\n&lt;p&gt;This is a part-time, 10-month contract position that is remote with some travel. The current workload is 20 hours a week, but it could ramp up to 40 hours per week and convert to a full-time position.&amp;nbsp;&lt;/p&gt;\n&lt;p&gt;This is an exciting opportunity to build the next great cloud database company for the 25 million developers worldwide. Today, Timescale is an excellent database with a clear product-market fit in the time series market, and we are expanding our offerings to target additional use cases.&amp;nbsp;You&#39;ll succeed at Timescale if you are entrepreneurial, bold, scrappy, decisive, fired up in front of challenges and uncertainty, and get things done.&lt;/p&gt;\n&lt;h3&gt;Responsibilities:&lt;/h3&gt;\n&lt;ul&gt;\n&lt;li&gt;Provide high-level administrative support to the CEO, including managing schedules, arranging meetings, handling correspondence, and prioritizing tasks.&lt;/li&gt;\n&lt;li&gt;Act as a liaison between the executive and internal/external stakeholders, effectively managing communications and requests.&lt;/li&gt;\n&lt;li&gt;Plan, coordinate, and execute all internal company events, including team offsites, board meetings, and all-company gatherings.&lt;/li&gt;\n&lt;li&gt;Take ownership of event projects from conception to completion, ensuring seamless execution within deadlines.&lt;/li&gt;\n&lt;li&gt;Manage each event within budget constraints, prioritizing cost-effectiveness without compromising on quality or value.&lt;/li&gt;\n&lt;li&gt;Communicate event details and updates effectively to all stakeholders, including executives, employees, and external partners.&lt;/li&gt;\n&lt;li&gt;Oversee event promotion and communication to ensure maximum participation and engagement.&lt;/li&gt;\n&lt;li&gt;Handle confidential information with discretion and maintain the highest level of professionalism in all interactions.&lt;/li&gt;\n&lt;li&gt;Identify areas for improvement in event processes and implement enhancements to streamline workflows and increase efficiency.&lt;/li&gt;\n&lt;/ul&gt;\n&lt;h3&gt;Qualifications:&lt;/h3&gt;\n&lt;ul&gt;\n&lt;li&gt;5+ years of experience in executive assistance and event planning.&lt;/li&gt;\n&lt;li&gt;Proficiency in all aspects of event planning, including budgeting, venue selection, vendor negotiation, logistics coordination, and post-event evaluation.&lt;/li&gt;\n&lt;li&gt;Ability to effectively manage multiple projects simultaneously, prioritize tasks, set timelines, allocate resources, and ensure timely delivery of results.&lt;/li&gt;\n&lt;li&gt;Strong organizational skills to manage calendars, schedules, emails, and other administrative tasks efficiently. Proficiency in office software such as Google Workspace.&lt;/li&gt;\n&lt;li&gt;Knowledge of budgeting principles to create and manage event budgets effectively, monitor expenses, and ensure cost-control measures are in place.&lt;/li&gt;\n&lt;li&gt;Excellent written and verbal communication skills to convey information clearly and professionally to internal and external stakeholders. Ability to tailor communication styles based on the audience.&lt;/li&gt;\n&lt;li&gt;Meticulous attention to detail to ensure accuracy in all aspects of event planning, including scheduling, logistics, guest lists, and communications.&lt;/li&gt;\n&lt;li&gt;Strong interpersonal skills to build positive relationships with executives, colleagues, vendors, and other stakeholders. Ability to work collaboratively in a team-oriented environment.&lt;/li&gt;\n&lt;li&gt;Strong problem-solving abilities to anticipate potential issues, identify solutions, and resolve challenges that may arise before, during, or after events.&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;Timescale is a fully remote organization with team members all over the world! Due to the people, this role will be supporting, we are hiring for this role in the United States.&amp;nbsp;&lt;/p&gt;\n&lt;p&gt;Compensation:&amp;nbsp;The target compensation for this role is $44/hour.&lt;/p&gt;&lt;div class=&quot;content-conclusion&quot;&gt;&lt;p&gt;By applying for this position, you are agreeing to &lt;a href=&quot;https://www.timescale.com/legal/timescale-applicant-privacy-notice&quot;&gt;Timescale&#39;s Applicant Privacy Notice.&amp;nbsp;&lt;/a&gt;&lt;/p&gt;&lt;/div&gt;","tags":"[\"legal\",\"database\"]","pubDate":"2024-05-18 15:39:41.766","link":"https://www.timescale.com/careers/7455581002?gh_jid=7455581002","savedDate":"2024-05-18 15:39:41.766","slug":"executive-assistant-and-event-planner-part-time-contract-timescale-8942"},{"id":1403621097,"title":"Lead Backend Engineer (Nodejs) - FS","company":"Yassir","image":"https://remotive.com/job/1912900/logo","description":"<div><strong><span style=\"\">Yassir</span></strong><span style=\"\"> is the leading super App in the Maghreb region set to changing the way daily services are provided. It currently operates in </span><strong><span style=\"\">45 cities across Algeria, Morocco and Tunisia with recent expansions into France, Canada and Sub-Saharan Africa</span></strong><span style=\"\">. It is backed (~</span><strong><span style=\"\">$200M in funding</span></strong><span style=\"\">) by VCs from Silicon Valley, Europe and other parts of the world. </span></div>\n<div><span style=\"\">We offer on-demand services such as ride-hailing and last-mile delivery. Building on this infrastructure, we are now introducing financial services to help our users pay, save and borrow digitally. </span></div>\n<div><span style=\"\">Helping usher the continent into a digital economy era. We’re not just about serving people - we’re about creating a marketplace to bring people what they need while infusing social values.</span></div>\n<div> </div>\n<div><span style=\"\">About the role</span></div>\n<div>As a Backend Staff/lead Engineer, you will drive the technical standards for the Backend across our consumer domain, working with multiple squads inside the domain. You will lead Backend engineers with tech roadmaps, architecture decisions, and feature development and release cycle. You will mentor junior developers. You will contribute to scaling up Backend engineers in multiple squads and bringing great talents on board by conducting technical interviews.</div>\n<p><br><br></p>\n<div class=\"h3\">About your role as Staff Engineer, Backend (Nodejs)</div>\n<ul style=\"\">\n<li style=\"\">Design, build and maintain features for the domain applications</li>\n<li style=\"\">Provide technical leadership and manage dependencies</li>\n<li style=\"\">Conduct design and code reviews</li>\n<li style=\"\">Help the domain team members with technical blockers supporting them and helping them grow</li>\n<li style=\"\">Continuously discover, evaluate, and implement new technologies to maximize efficiency</li>\n<li style=\"\">Participate in architecture and design discussions</li>\n<li style=\"\">Participate strongly in building the technical roadmap</li>\n<li style=\"\">Conduct technical interviews</li>\n<li style=\"\">Help Improving engineering standards, tooling, and processes</li>\n</ul>\n<p><br><br></p>\n<div class=\"h3\">Owner of these projects</div>\n<ul style=\"\">\n<li style=\"\">Perform feasibility studies to validate capability and functionality</li>\n<li style=\"\">Draft and submit intellectual property</li>\n<li style=\"\">Research and assess current technologies</li>\n<li style=\"\">Develop and execute complex, multi-tier distributed software search applications</li>\n<li style=\"\">Create technical and domain expertise and apply to products and problems</li>\n<li style=\"\">Assess and write code to improve or extend application</li>\n<li style=\"\">Manage and assist current software applications</li>\n<li style=\"\">Experience providing technical leadership, and mentoring others</li>\n</ul>\n<p><br><br></p>\n<div class=\"h3\">About your experience</div>\n<ul style=\"\">\n<li style=\"\">At least 10 years of experience in backend engineering with NodeJS</li>\n<li style=\"\">Strong foundation in programming fundamentals</li>\n<li style=\"\">Excellent communication skills</li>\n<li style=\"\">Enjoy solving problems and helping others meet their goals</li>\n<li style=\"\">Substantial experience with Git in a team environment</li>\n<li style=\"\">Experience writing testable code and unit tests</li>\n<li style=\"\">Experience in a fast-growing startup in a the on-demand services space is a plus</li>\n<li style=\"\">Have a deep knowledge of React and NodeJS, and you have experience developing products with it</li>\n<li style=\"\">Experience using modern JavaScript and tooling in a full-stack setting</li>\n<li style=\"\">Extensive experience with A/B experiments and have a data-driven attitude toward product development</li>\n</ul>\n<div>😎 You will be part of one of the first Algerian startups to go through the Y Combinator program and one of the fastest-growing tech companies in North Africa. We are current in +30 cities (Algeria, Tunisia, Morocco, Senegal, France and Germany)</div>\n<div>💸 Attractive salary and you even get a stake in the company</div>\n<div>🚉 Subsidized public transit pass</div>\n<div>🤙🏽Have a lasting impact on our company's culture</div>\n<div>🚀 Perfect timing with renowned investors to build something great</div>\n<div>📈 Extremely steep learning curve with own responsibility and intensive guidance</div>\n<div>💯 Make a real impact on the world by helping us bring affordable financial and on-demand services to millions of Africans</div>\n<div> </div>\n<div>At Yassir, we believe in the power of diversity and the importance of an inclusive culture. So, if you're ready to bring your unique perspective and experiences to the table, then we're excited to listen.</div>\n<div> </div>\n<div>Don't just apply for a job, come and be a part of our journey. Let's create a better tomorrow together.</div>\n<div> </div>\n<div>We look forward to receiving your application!</div>\n<div> </div>\n<div>Best of luck,</div>\n<div>Your Yassir TA Team</div>\n<div> </div>\n<div> </div>\n<img src=\"https://remotive.com/job/track/1912900/blank.gif?source=public_api\" alt=\"\"/>","tags":"[\"git\",\"react\"]","pubDate":"2024-05-16 07:20:47.000","link":"https://remotive.com/remote-jobs/software-dev/lead-backend-engineer-nodejs-fs-1912900","savedDate":"2024-05-18 15:39:41.765","slug":"lead-backend-engineer-nodejs-fs-yassir-4117"},{"id":1553550405,"title":"Database Administrator (MongoDB & Apache Cassandra)","company":"Zipdev","image":"https://remotive.com/job/1912814/logo","description":"<p>Zipdev is looking for a DBA for our client, who is a leading Compliance Software company dedicated to being the most trusted software in the Petroleum Industry. </p>\n<p><strong>Responsibilities:</strong></p>\n<ul style=\"\">\n<li style=\"\">Manage and administer MongoDB and Apache Cassandra databases, ensuring high availability, performance, and security.</li>\n<li style=\"\">Design, implement, and maintain database architectures to support the organization's applications and services.</li>\n<li style=\"\">Collaborate with cross-functional teams to understand data requirements and optimize database performance.</li>\n<li style=\"\">Monitor and troubleshoot database issues, ensuring timely resolution and minimal downtime.</li>\n<li style=\"\">Implement and manage database backup and recovery processes.</li>\n<li style=\"\">Work on database optimization, including query performance tuning and index optimization.</li>\n<li style=\"\">Collaborate with developers to design efficient and scalable database schemas.</li>\n<li style=\"\">Implement and enforce security policies for database access and data integrity.</li>\n<li style=\"\">Stay informed about emerging trends and best practices in MongoDB and Apache Cassandra databases.</li>\n</ul>\n<p> </p>\n<p><strong>Requirements</strong></p>\n<ul style=\"\">\n<li style=\"\">Proven experience, from 3 to 5 years, as a Database Administrator, specifically with MongoDB and Apache Cassandra.</li>\n</ul>\n<ul style=\"\">\n<li style=\"\">In-depth knowledge of database architecture, design, and optimization.</li>\n<li style=\"\">Experience with database performance tuning and troubleshooting.</li>\n<li style=\"\">Strong understanding of data security and privacy best practices.</li>\n<li style=\"\">Proficiency in scripting languages (e.g., Python, Shell) for automation tasks.</li>\n<li style=\"\">Familiarity with cloud platforms (e.g., AWS, Azure) and containerization (e.g., Docker).</li>\n<li style=\"\">Excellent communication and collaboration skills.</li>\n<li style=\"\">Bachelor's degree in Computer Science, Information Technology, or related field.</li>\n</ul>\n<p><strong>Preferred Qualifications:</strong></p>\n<ul style=\"\">\n<li style=\"\">Certification in MongoDB or Apache Cassandra.</li>\n<li style=\"\">Experience with database migrations and upgrades.</li>\n<li style=\"\">Knowledge of NoSQL database technologies beyond MongoDB and Apache Cassandra.</li>\n</ul>\n<p><strong>Benefits</strong></p>\n<ul style=\"\">\n<li style=\"\">Work remotely Monday - Friday, 40 hours a week (no weekends)</li>\n<li style=\"\">Vacation: 10 business days a year</li>\n<li style=\"\">Holidays: 5 National Holidays a year</li>\n<li style=\"\">Company Holidays: 5 Company Holidays a year (Christmas Eve, Christmas Day, New Year's Eve, New Year's Day, Zipdev Day)</li>\n<li style=\"\">Parental Leave</li>\n<li style=\"\">Health Care Reimbursement</li>\n<li style=\"\">Active Lifestyle Reimbursement</li>\n<li style=\"\">Quarterly Home Office Reimbursement</li>\n<li style=\"\">Payroll Deduction Purchase Plans</li>\n<li style=\"\">Longevity Bonus</li>\n<li style=\"\">Continuous Learning Bonus</li>\n<li style=\"\">Access to Training and Professional Development Platforms</li>\n<li style=\"\">Did we mention it's REMOTE?!!</li>\n</ul>\n<p><br><br></p>\n<div class=\"h2\">About the company</div>\n<p> </p>\n<p>Zipdev offers the opportunity to work remotely with clients based in the United States. Zipdev recruits and hires the best Developers, Designers, QA Testers, and Project Managers in Latin America. If you have been successful working remotely, work well with remote teams and understand the importance of communication, contact us right away.</p>\n<p> </p>\n<p> </p>\n<img src=\"https://remotive.com/job/track/1912814/blank.gif?source=public_api\" alt=\"\"/>","tags":"[\"mongoDB\",\"data security\"]","pubDate":"2024-05-16 03:20:52.000","link":"https://remotive.com/remote-jobs/devops/database-administrator-mongodb-apache-cassandra-1912814","savedDate":"2024-05-18 15:39:41.765","slug":"database-administrator-mongodb-apache-cassandra-zipdev-7805"},{"id":9441569535,"title":"IT Operations Manager / DevOps (remote-only opportunity, location - Europe&CIS)","company":"CloudLinux","image":"https://pbs.twimg.com/profile_images/696718028084482050/ymY3OEPk_400x400.png","description":"<p>We are looking for an IT Operations Manager to oversee a group of engineers who support our internal infrastructure, and employees’ technical issues. The ideal candidate will have a deep understanding of DevOps methodology and be able to work autonomously and effectively in a remote environment. They should be able to help support their employees with development and training. This person should also be strategic by providing guidance as we scale up.&nbsp;</p><p>CloudLinux is a global remote-first company. We are driven by our principles: Do the right thing, employees first, we are remote first, and&nbsp; we deliver high volume, low-cost Linux infrastructure and security products that help companies to increase the efficiency of their operations. Every person on our team supports each other and does what we can to ensure everyone is successful. We are truly a great place to work.&nbsp;</p><p>Become part of the team of experts and work with top-notch developers to contribute to open source. You can find more details about the project and the company on our branded websites at <a href=\"http://cloudlinux.com/\" rel=\"nofollow noreferrer noopener\" class=\"external\">cloudlinux.com</a></p><p><strong>What you will do:</strong></p><ul> <li>Develop and lead a team of IT engineers that support our internal staff and global systems.&nbsp;</li> <li>Manage the infrastructure operations and lead the team of DevOps experts to manage the CloudLinux R&amp;D tools (software, hardware, OS, peripherals).</li> <li>Plan and budget the investment in CloudLinux internal delivery platform (hybrid environments)&nbsp; to ensure effective software delivery and developer productivity.</li> <li>Organize and prioritize work to ensure critical issues are being addressed in an acceptable timeframe and in compliance with internal SLA's.</li> <li>Responsible for managing, planning, coordinating, and monitoring of Service functions, personnel, and software.</li> <li>Manage the Jira system for tracking incidents, problems, change, assets, and knowledge base; addressing any issues; and making recommendations for improvement.</li> <li>Maintain the security of the infrastructure at the level of certification requirements</li> <li>Purchase efficient and cost-effective technological equipment and software.&nbsp;</li> <li>Communicate with the vendors, oversee the budget.&nbsp;</li> </ul><h3>Requirements: </h3><p><strong>To be successful you should have:</strong></p><ul> <li>5+ years of operational experience in R&amp;D support and in IT Infrastructure.</li> <li>3+ years of IT management experience including communication with hardware vendors and data centers&nbsp;</li> <li>Deep understanding of DevOps methodology.</li> <li>Deep understanding of supporting Linux platform (on premise and cloud)</li> <li>R&amp;D-focused, with an ability to understand and manage engineers expectations.</li> </ul><h3>Benefits: </h3><p><strong>What's in it for you?</strong></p><ul> <li>A focus on professional development; </li> <li>Interesting and challenging projects</li> <li>Flexible working hours</li> <li>Paid one month vacation per year and unlimited sick leave</li> <li>Medical insurance reimbursement</li> <li>Co-working and gym/sports reimbursement</li> <li>The opportunity to receive a reward for the most innovative idea that the company can patent</li> </ul><p></p><p><em>By applying for this position, you agree with </em><a href=\"https://cloudlinux.com/privacy-policy\" rel=\"nofollow noreferrer noopener\" class=\"external\"><em>Cloudlinux Privacy Policy</em></a><em> and give us your consent to maintain and process your personal data with this respect. Please read our Privacy Policy for more information.</em></p>","tags":"[\"management\"]","pubDate":"2024-05-16 00:00:00.000","link":"https://apply.workable.com/cloudlinux-1/j/ABC11230EA","savedDate":"2024-05-18 15:39:41.766","slug":"it-operations-manager-devops-remote-only-opportunity-location-europe-cis-cloudlinux-2165"},{"id":5764647439,"title":"Front-end Developer (VM)","company":"Blue Coding","image":"https://lever-client-logos.s3.us-west-2.amazonaws.com/3c1d9ac7-6738-46c5-b6ca-a35fa2a0df57-1666278594128.png","description":"<div><i style=\"font-size: 18px\">Do you want to earn a salary in USD?&nbsp;</i></div><div><i style=\"font-size: 18px\">Would you like to work from wherever you want?</i></div><div><i style=\"font-size: 18px\">Would you like to be a part of the leading next-gen software developers?&nbsp;</i></div><div><br></div><div><b style=\"font-size: 24px\">Hi, you finally found us!</b><span style=\"font-size: 24px\">&nbsp;</span></div><div><br></div><div><b style=\"font-size: 24px\">Why work at Blue Coding?</b><span style=\"font-size: 24px\">&nbsp;</span></div><div><br></div><div>At Blue Coding we specialize in hiring excellent developers and amazing people from all over Latin America and other parts of the world. For the past 9 years, we’ve helped cutting-edge companies in the United States and Canada -both large and small, build great development teams and develop great products. Online shops, digital agencies, SaaS providers, and software consulting firms are a few of our clients. Our team of over 100 engineers is distributed in more than 10 countries across the Americas. We are a fully remote company working with a wide array of technologies and have expertise in every stage of the software development process.&nbsp;&nbsp;</div><div><br></div><div>Our team is highly connected, united, and culturally diverse, and our collaborators are involved in many initiatives around the world, from wildlife preservation to volunteering at local charities. We also participate in group activities like movie nights, trivia, and meme competitions. We stand for honesty, fairness, respect, efficiency, hard work, and cooperation.</div><div><br></div><div><b style=\"font-size: 18px\">What are we looking for?</b></div><div><br></div><div><span style=\"font-size: 16px\">In this opportunity, we are looking for a Front-end Developer to work with one of our foreign clients, who is a market leader in the consultation, design, procurement, implementation, and ongoing managed services for technology services for mid to large global enterprises. As a Telecom Managed Service company, they partner with over 300 service providers globally to help customers with technology design and find the best solutions to meet their needs.</span></div><div><br></div><div><span style=\"font-size: 16px\">If you are independent, a great communicator, a problem solver, and have strong attention to detail, this is a great fit for you! Our jobs are fully remote – as long as you have the skills and can get the work done well, you can work anywhere in the listed countries you want.</span></div><div><span style=\"font-size: 16px\">If you have the skills and can get the job done, join us and work from anywhere you want!</span></div><h3>You will shine if you have:</h3><li>Strong hands-on experience with HTML, CSS, Javascript and <a href=\"http://Vue.js\" class=\"postings-link\">Vue.js</a>.</li><li>Experience with Agile methodologies such as Scrum, and Kanban.</li><li>Experience with cloud environments like Azure or similar.</li><li>Knowledge or experience working or reading React or Typescript is plus</li>,<h3>Here are some of the perks we offer you:</h3><li>Salary in USD</li><li>Long-term</li><li>Flexible schedule (within US Time zones)</li><li>100% Remote</li><div><b style=\"font-size: 24px\">Hey, you are still here!</b><span style=\"font-size: 24px\">&nbsp;</span></div><div><br></div><div>So, let us ask a few questions. Do you like working in a friendly environment? Are you fluent in English? Do you have a strong work ethic, are detail-oriented and have an ownership mentality? And most importantly do you love music and puppies? If so, then what are you waiting for? Come join our team and become part of this awesome company! We will be expecting you.</div>","tags":"[\"javascript\",\"typescript\"]","pubDate":"2024-05-03 19:50:05.696","link":"https://jobs.lever.co/bluecoding/8358aab8-2d33-411c-802f-8cd71fdaf03c","savedDate":"2024-05-18 15:39:41.767","slug":"front-end-developer-vm-blue-coding-3549"}]