[{"id":1875188364,"title":"Controller (Remote)","company":"Empower","image":"https://lever-client-logos.s3.us-west-2.amazonaws.com/2e1a369c-b58f-41ac-8d86-4b0a77695e68-1687915522032.png","description":"<p style=\"min-height:1.5em\"><strong>EMPOWER OVERVIEW</strong></p><p style=\"min-height:1.5em\"><a target=\"_blank\" rel=\"noopener noreferrer nofollow\" href=\"http://empower.me/\">Empower</a> is shaking up an outdated financial system by providing real opportunity for our customers: the opportunity to get the cash they need, to access fair credit, and to change their financial story. Today, we’re helping millions of people find financial security through machine learning models that evaluate creditworthiness using a more inclusive lens and mobile-first products: Cash Advance, Thrive line of credit, and Petal credit cards. Tomorrow? Creating even more financial paths for our customers (and their wallets) to succeed.</p><p style=\"min-height:1.5em\">This year, Empower ranked #65 on Inc. 5000’s Fastest-Growing Private Companies list — our third year in a row cracking the top 100 — and was named by Forbes as one of the 25 Next Billion-Dollar Startups for 2024. Empower was also featured by Forbes on America’s Best Startup Employers list in 2023, and our Thrive line of credit product was named by Fast Company as one of 2022’s Next Big Things in Tech.</p><p style=\"min-height:1.5em\">Empower is backed by Sequoia Capital, Blisce, and Icon Ventures. Ready to grow your impact and accelerate your career? Take a look at our open roles — we can’t wait to meet you.</p><p style=\"min-height:1.5em\"></p><p style=\"min-height:1.5em\"><strong>THE EMPOWER WAY</strong></p><p style=\"min-height:1.5em\"><strong>Great Expectations</strong>: We come up with bold, audacious goals for ourselves and go all out for impact</p><p style=\"min-height:1.5em\"><strong>Owner Mindset</strong>: We give every employee latitude to act independently, make smart choices, and move the business forward</p><p style=\"min-height:1.5em\"><strong>Spirited Debate</strong>: We love skeptics and seek counter opinions to challenge our personal assumptions and expand our view</p><p style=\"min-height:1.5em\"><strong>Customer Obsession:</strong> We listen to understand, empathize, and create a memorable, rewarding experience for our community</p><p style=\"min-height:1.5em\"><strong>Inclusive Collaboration</strong>: We believe diverse teams make the best decisions, and we strive to give diverse voices a seat at the table</p><p style=\"min-height:1.5em\"><strong>No Jerks Allowed</strong>: We value our relationships and take the time to build trust and connection and communicate respectfully</p><p style=\"min-height:1.5em\"></p><p style=\"min-height:1.5em\"><strong>WHAT EMPOWER OFFERS</strong></p><p style=\"min-height:1.5em\">Competitive salary</p><p style=\"min-height:1.5em\">Generous equity package</p><p style=\"min-height:1.5em\">Full healthcare benefits</p><p style=\"min-height:1.5em\">Technology expense reimbursement</p><p style=\"min-height:1.5em\">Work from anywhere</p><p style=\"min-height:1.5em\"></p><p style=\"min-height:1.5em\"><strong>JOB DESCRIPTION</strong></p><p style=\"min-height:1.5em\">As Controller, you will report to the CFO and be responsible for ensuring the integrity, accuracy, and transparency of our financial reporting. The ideal candidate will have a proven track record of leadership in financial control within the FinTech or related industries, with experience guiding companies through significant growth phases and public offerings.<br />Travel for company offsites is expected at a minimum 2 times a year.</p><p style=\"min-height:1.5em\"></p><p style=\"min-height:1.5em\"><strong>Key Responsibilities</strong></p><p></p><ul style=\"min-height:1.5em\"><li><p style=\"min-height:1.5em\">Financial Leadership: Lead the accounting function, ensuring accurate and timely financial reporting in accordance with GAAP, as well as compliance with SEC regulations and other applicable laws.</p></li><li><p style=\"min-height:1.5em\">Strategic Planning: Work closely with the CFO and FP&amp;A team to develop financial strategies that support the company’s growth objectives.</p></li><li><p style=\"min-height:1.5em\">Internal Controls and Compliance: Design, implement, and maintain a robust system of internal controls to safeguard company assets and ensure the accuracy of financial statements.</p></li><li><p style=\"min-height:1.5em\">Team Management and Development: Build, lead, and mentor a high-performing accounting team capable of supporting the company’s growth and adaptability through its scaling and IPO journey.</p></li><li><p style=\"min-height:1.5em\">Stakeholder Communication: Act as a key liaison with external auditors, regulatory bodies, and investors, ensuring clear and transparent communication of the company’s financial status and outlook.</p></li><li><p style=\"min-height:1.5em\">Process Improvement: Continuously assess and improve financial and accounting processes and systems to increase efficiency, reduce risk, and support scaling operations.</p></li></ul><p style=\"min-height:1.5em\"><strong>Candidate Qualifications</strong></p><ul style=\"min-height:1.5em\"><li><p style=\"min-height:1.5em\">Bachelor's degree in Accounting, Finance, or related field. </p></li><li><p style=\"min-height:1.5em\">CPA or equivalent certification is required.</p></li><li><p style=\"min-height:1.5em\">10+ years of progressive experience in accounting and finance, with at least 5 years in a leadership role within a FinTech or fast-growing tech company.</p></li><li><p style=\"min-height:1.5em\">Demonstrated experience leading a company through significant growth phases.</p></li><li><p style=\"min-height:1.5em\">Strong knowledge of GAAP, SEC reporting, and regulatory compliance requirements in the financial services industry.</p></li><li><p style=\"min-height:1.5em\">Exceptional leadership skills with the ability to develop and mentor a team.</p></li><li><p style=\"min-height:1.5em\">Strategic thinker with excellent analytical, organizational, and problem-solving skills.</p></li><li><p style=\"min-height:1.5em\">Outstanding communication and interpersonal abilities to engage with all levels of the organization and external stakeholders.</p></li><li><p style=\"min-height:1.5em\">Proficient in financial software and systems (including NetSuite), with a keen eye for leveraging technology to improve operational efficiency.<br /></p></li></ul><p style=\"min-height:1.5em\">At Empower, we hire for people that push themselves to understand others and seek out ways to challenge their personal assumptions. Our hope is that by fostering such an environment, we strengthen our business and relationships by putting people first. We are committed to building a diverse, inclusive, and equitable workspace where everyone (regardless of age, education, ethnicity, gender, sexual orientation, or any personal characteristics) feels like they belong. Even if your experience doesn’t exactly match up to our job description, you should feel empowered to apply regardless!</p>","tags":"[\"Finance\",\"management\",\"aws\"]","pubDate":"2024-12-27T22:02:07.068Z","link":"https://jobs.ashbyhq.com/empower%20finance/873e481e-a42d-4ecd-9f06-88ee67d4689c","slug":"controller-remote-empower-8664"},{"id":9203667295,"title":"IT Security Administrator (Part-time)","company":"Blue Coding","image":"https://media.licdn.com/dms/image/C4D0BAQHlK67hgnhzQw/company-logo_200_200/0/1631346154820?e=2147483647&v=beta&t=_R2Ssj7L_f4xqmSCcq0nOLCyCz0QN2lFnHssxxhj3YY","description":"<div><span style=\"font-size: 24px;\">Hi, you finally found us!&nbsp;</span></div><div><br></div><div><span style=\"font-size: 24px;\">Why work at Blue Coding?&nbsp;</span></div><div><br></div><div>At Blue Coding we specialize in hiring excellent developers and amazing people from all over Latin America and other parts of the world. For the past 10 years, we’ve helped cutting-edge companies in the United States and Canada -both large and small, build great development teams and develop great products. Online shops, digital agencies, SaaS providers, and software consulting firms are a few of our clients. Our team of over 100 engineers is distributed in more than 10 countries across the Americas. We are a fully remote company working with a wide array of technologies and have expertise in every stage of the software development process.&nbsp;&nbsp;</div><div><br></div><div>Our team is highly connected, united, and culturally diverse, and our collaborators are involved in many initiatives around the world, from wildlife preservation to volunteering at local charities. We also participate in group activities like movie nights, trivia, and meme competitions. We stand for honesty, fairness, respect, efficiency, hard work, and cooperation.</div><div><br></div><div><span style=\"font-size: 12pt;\">We are seeking a part-time </span><b style=\"font-size: 12pt;\">IT Security Administrator</b><span style=\"font-size: 12pt;\"> to assist in the implementation and management of our company’s security policy. This role involves working closely with internal teams to enforce best practices in data protection, access control, collaborator security training, compliance, and auditing. The ideal candidate will have a strong background in IT, combined with a solid understanding of security frameworks and a proactive approach to administrative and organizational tasks.</span></div><div><br></div><div>This position is expected to be based in the LATAM region.</div><h3>Responsibilities</h3><li><b>Security Policy Implementation:</b> Assist in deploying and enforcing company-wide security policies, ensuring adherence to data protection standards, access control protocols, and other security measures.</li><li><b>Access Control Management:</b> Administer and monitor access rights for collaborators and external vendors, ensuring compliance with the principle of least privilege.</li><li><b>Data Protection:</b> Oversee the secure storage (backup) and transfer of sensitive data, ensuring compliance with applicable data protection regulations (GDPR, CCPA, etc.).</li><li><b>Collaborator Training:</b> Collaborate with HR and IT to organize and conduct regular security awareness training sessions for all employees.</li><li><b>Compliance &amp; Auditing:</b> Conduct regular security audits, prepare reports for management, and ensure compliance with industry standards and internal policies.</li>,<h3>You will shine if you have these skills:</h3><li>Bachelor’s degree in Information Technology, Cybersecurity, or a related field.</li><li>Minimum of 3 years of experience in IT administration with a focus on security.</li><li>Familiarity with security frameworks (ISO 27001, NIST, etc.) and regulations (GDPR, HIPAA, etc.).Experience with access control management, user permissions, and role-based access systems.</li><li>Strong organizational skills with the ability to manage multiple tasks and priorities.</li><li>Excellent communication skills for coordinating with cross-functional teams.</li><li>Comfortable with administrative tasks.&nbsp;</li><li>You are located in Latam.</li>,<h3>Why Join Us</h3><li>Be part of a dynamic team dedicated to safeguarding company data and ensuring the security of our operations.</li><li>Opportunity to contribute to a growing company and have a direct impact on shaping security best practices.</li>","tags":"[\"management\"]","pubDate":"2024-12-27T15:28:25.032Z","link":"https://jobs.lever.co/bluecoding/c942861a-363c-4674-ba59-cb812e4e2a85","slug":"it-security-administrator-part-time-blue-coding-1918"},{"id":9804447269,"title":"ETL Data Engineer","company":"Skywarditsolutions","image":"https://remotive.com/job/1959835/logo","description":"<div><strong>**This position is contingent on contract award**</strong></div>\n<div> </div>\n<div><strong>We are Skyward.</strong></div>\n<div>That is, a love for people, for improvement, for human advancement through information technology. We are a people-centered business with a desire to serve others. We are diverse and unified; creative and collaborative; a collection of complementary, not competing talents. And though on the surface we remain relaxed, beneath, a torrent of energy links us to our civic tech mission.</div>\n<div> </div>\n<div>We stand by our values, and we won’t compromise on any of them.</div>\n<div> </div>\n<div><strong>Integrity:</strong> We’re conscientious, intentional, and empathetic. Our words and actions align. That’s our character. Please don’t ask us to play another part, we’re poor actors.   </div>\n<div><strong>Compassionate:</strong> If we may borrow a quote from Theodore Roosevelt: “No one cares how much you know until they know how much you care.” Because our team is thoughtful and supportive, caring deeply for each other, our clients, and our work, this comes naturally. </div>\n<div><strong>Inquisitive:</strong> We remain students by failing openly and turning lessons into solutions.</div>\n<div><strong>Unconventional:</strong> For us, life isn’t what happens outside of work. Work happens inside of life and our culture erases the line often dividing the two.   </div>\n<div><strong>Authentic:</strong> Made possible only because we embody the values listed above. We’re relaxed and fun yet intensely curious and driven. Team members are placed with thought, care, and precision to ensure that Trust, Truth, and Transparency continue to represent our brand.</div>\n<div> </div>\n<div>Because of that, we continue Onward, Upward, and Skyward.</div>\n<div> </div>\n<div><strong>We need an ETL Data Engineer.</strong></div>\n<div>Do you have a knack for transforming raw data into gold? Do you thrive on building seamless data pipelines and ensuring the right data flows where it needs to go? If you love solving data challenges, optimizing processes, and turning complex information into actionable insights, then apply now.</div>\n<div> </div>\n<div>Come join us if you're motivated to learn from others, to learn from mistakes, to be part of a future-looking and growth-oriented team.</div>\n<div> </div>\n<div>Let's go Skyward together.</div>\n<p><br><br></p>\n<div class=\"h3\">What you'll do:</div>\n<ul style=\"\">\n<li style=\"\">Be part of a team that is supporting the Centers for Medicare and Medicaid Services (CMS) by disseminating data to researchers who are studying ways to improve the quality and reduce the cost of care provided to chronically ill Medicare beneficiaries. (No big deal).</li>\n<li style=\"\">Support data warehouse architecture development across one or more data warehouse solutions (such as Snowflake).</li>\n<li style=\"\">Provide rotation-based production support for ETL batch loads including off-hours and weekends.</li>\n<li style=\"\">Analyze and resolve complex hardware/software compatibility and interface design considerations.</li>\n<li style=\"\">Conduct investigations and tests of considerable complexity.</li>\n<li style=\"\">Maintain data documentation on processes and procedures.</li>\n<li style=\"\">Track multiple data feeds, business rules, and statuses to ensure management receives accurate data and information.</li>\n</ul>\n<p><br><br></p>\n<div class=\"h3\">What we'd like you to have:</div>\n<ul style=\"\">\n<li style=\"\">Bachelor’s degree and at least 2 years of experience in data engineering.</li>\n<li style=\"\">Experience with one or more ETL tools like Informatica PowerCenter, Microsoft SSIS (SQL Server Integration Services), Talend, Pentaho, or Apache NiFi.</li>\n<li style=\"\">Strong understanding of relational databases (such as MySQL, Oracle, and SQL Server) and knowledge of SQL.</li>\n<li style=\"\">Experience with NoSQL databases like MongoDB or Cassandra.</li>\n<li style=\"\">Familiarity with data warehousing architectures (such as Kimball and Inmon) and technologies like Amazon Redshift, Google BigQuery, and Snowflake.</li>\n<li style=\"\">Excellent knowledge of scripting and programming languages for data manipulation and transformation.</li>\n<li style=\"\">Strong oral and written communication skills for collaborating with team members and stakeholders, documenting ETL processes, and explaining technical details clearly.</li>\n<li style=\"\">Precision. You are always ensuring the accuracy and integrity of data.</li>\n</ul>\n<p><br><br></p>\n<div class=\"h3\">What would blow us away:</div>\n<ul style=\"\">\n<li style=\"\">Your entire experience has been supporting the Centers for Medicare and Medicaid Services (CMS).</li>\n</ul>\n<div> </div>\n<div><em>Even if you don’t meet 100% of the qualifications, we encourage you to apply. At Skyward, we’re focused on hiring individuals with the right skills and passion to grow, not just checking off every box.</em></div>\n<p><br><br></p>\n<div class=\"h3\">And now the important part. What we offer you:</div>\n<ul style=\"\">\n<li style=\"\">Medical, dental, vision insurance (fully paid for employees)</li>\n<li style=\"\">15 days of paid leave</li>\n<li style=\"\">7 days of sick leave</li>\n<li style=\"\">2 days bereavement leave</li>\n<li style=\"\">11 paid Federal holidays</li>\n<li style=\"\">Up to 40 hours for jury duty</li>\n<li style=\"\">401K with 4% employer contribution (and no vesting period)</li>\n<li style=\"\">Up to 4 weeks of paid paternity and maternity leave</li>\n<li style=\"\">Company provided laptop</li>\n<li style=\"\">$5,000 per year for professional development</li>\n<li style=\"\">$600 per year for technical supplies and equipment</li>\n<li style=\"\">$2,000 referral bonus</li>\n<li style=\"\">Life and disability insurance</li>\n<li style=\"\">HSA and FSA</li>\n<li style=\"\">Legal Shield and ID Shield Voluntary Benefits</li>\n<li style=\"\">Opportunity to work in a collaborative, motivated team focused on modernizing government services with cutting-edge technology and innovative solutions. Who says government work can't be exciting!</li>\n</ul>\n<div>At Skyward, we believe diverse teams are the key to innovation and success. We are committed to creating an inclusive and equitable environment where everyone, regardless of gender, race, ethnicity, sexual orientation, disability, or background, can thrive. We strongly encourage applications from women, people of color, veterans, individuals with disabilities, and members of the LGBTQ+ community.</div>\n<div> </div>\n<div>We support flexible working hours and remote opportunities to help maintain a healthy work-life balance for all employees, including caregivers and those with unique needs.</div>\n<div> </div>\n<div><strong>Applicants must have the ability to obtain and maintain a Public Trust security clearance due to the nature of our work as a government contractor.</strong></div>\n<div> </div>\n<div><strong>Offers of employment with Skyward are contingent upon acceptable results of a background investigation.  </strong></div>\n<img src=\"https://remotive.com/job/track/1959835/blank.gif?source=public_api\" alt=\"\"/>","tags":"[\"sql\",\"data warehousing\"]","pubDate":"2024-12-27T05:51:09.000Z","link":"https://remotive.com/remote-jobs/software-dev/etl-data-engineer-1959835","slug":"etl-data-engineer-skywarditsolutions-9702"},{"id":5541513978,"title":"Platform Engineer","company":"Wealthwizards","image":"https://remotive.com/job/1959419/logo","description":"<div><!--block--><em>** Please note that any applications submitted for this role will not be reviewed until January 2025**<br></em><br>At Wealth Wizards our vision is a future where everybody in society has access to financial advice and guidance. Our Software as a Service (SaaS) platform provides engaging digital experiences for consumers and powerful tools for financial advisers.<br><br>We are a true Fintech with a strong engineering culture and focus on innovation and agile methodology.<br><br>We welcome individuals from all walks of life and strive to build a culture where all voices are heard, differences are embraced, and everyone has equal access to opportunities. We encourage applications from individuals of all races, ethnicities, genders, sexual orientations, ages, abilities, and backgrounds.</div><div><!--block--><br>If you require any reasonable adjustments to be made during the application or interview process, please let us know, and we will be happy to help.<br><br><strong>Job purpose</strong><br><br>To design, build, and maintain the underlying infrastructure and software systems for Wealth Wizards to host automated online financial advice. This role focuses on creating robust, scalable, and efficient platforms that enable developers to deploy, manage, and monitor their applications easily.</div><br><br><div class=\"h3\">Key Responsibilities</div><div><!--block--><strong>What you'll be doing...</strong></div><ul style=\"\"><li style=\"\"><!--block-->Executing operational work within an Agile team.</li><li style=\"\"><!--block-->Providing guidance on best-practice to ensure that the platform meets security and compliance requirements by implementing security controls, with best practices without compromising agility and innovation.</li><li style=\"\"><!--block-->Shared ownership of team status board.</li><li style=\"\"><!--block-->Building and maintaining CI/CD pipelines to automate software delivery, testing, and deployment processes to aid deployment of software releases to customer environments.</li><li style=\"\"><!--block-->Code/peer review of colleagues' work.</li><li style=\"\"><!--block-->Documenting the platform architecture, configurations, and processes, and sharing knowledge with other team members to facilitate collaboration and troubleshooting.</li><li style=\"\"><!--block-->Implement monitoring solutions to track system performance, identify bottlenecks, and optimise resource usage.</li><li style=\"\"><!--block-->Adhere to all Information Security policies and procedures</li></ul><br><br><div class=\"h3\">About You</div><div><!--block--><strong>Your skills<br><br></strong>When it comes to skills and experience, the ideal candidate would have:</div><ul style=\"\"><li style=\"\"><!--block-->Demonstrate Wealth Wizards core values (PEARH).</li><li style=\"\"><!--block-->Experience in key technologies such as <strong>AWS</strong>, <strong>Terraform</strong>, Linux, Containers, Kubernetes and IaaS.</li><li style=\"\"><!--block-->Ability to automate repetitive tasks.</li><li style=\"\"><!--block-->Good attention to detail.</li><li style=\"\"><!--block-->Excellent organisation/time management skills highly desirable.</li><li style=\"\"><!--block-->Strong understanding of AWS and experience in deploying and managing cloud-based infrastructure.</li><li style=\"\"><!--block-->Genuine interest and enthusiasm for technology, with a desire to stay updated with the latest trends and advancements in the field.</li></ul><div><!--block--><strong>Your experience </strong></div><ul style=\"\"><li style=\"\"><!--block-->Proven experience of Service Delivery and Service Monitoring within a commercial environment.</li><li style=\"\"><!--block-->Considerable experience in participating in agile teams.</li><li style=\"\"><!--block-->Practical experience with Docker for containerisation and Kubernetes for container orchestration, including deploying and scaling containerised applications.</li><li style=\"\"><!--block-->Hands-on experience with <strong>AWS</strong> for deploying and managing infrastructure and services.</li><li style=\"\"><!--block-->Previous exposure to setting up monitoring and logging solutions, such as Prometheus and Grafana to monitor system performance and troubleshoot issues.</li><li style=\"\"><!--block-->Practical knowledge of implementing security best practices.</li><li style=\"\"><!--block-->Knowledge of setting up and maintaining CI/CD pipelines for automating software delivery.</li><li style=\"\"><!--block-->Worked independently on a continuous improvement related project.</li></ul><div><!--block--><br><strong>Characteristics</strong></div><ul style=\"\"><li style=\"\"><!--block--><strong>Pioneering </strong>| Self-motivated and enthusiastic team player. Proactive, innovative, resilient and energetic.</li><li style=\"\"><!--block--><strong>Expert </strong>| Constantly seeking new learning/ self-development opportunities.</li><li style=\"\"><!--block--><strong>Accessible</strong> | Adaptable and enjoys a challenge. Builds strong collaborative relationships. Flexibility to work in a fast-moving business which is developing rapidly.</li><li style=\"\"><!--block--><strong>Reliable </strong>| Total trustworthiness essential. Highly organised, methodical, meticulous and disciplined.</li><li style=\"\"><!--block--><strong>Hungry </strong>| Understands and supports key priorities</li></ul><div><!--block--><br>Not sure if you tick every box? Don’t worry. If you think you have most of what we’re looking for, go ahead and apply. We’d love to hear from you.</div><br><br><div class=\"h3\">Our Perks</div><ul style=\"\"><li style=\"\"><!--block-->Flexible working</li><li style=\"\"><!--block-->We prioritise a sustainable work/life balance</li><li style=\"\"><!--block-->We have a collaborative learning culture that promotes psychological safety</li><li style=\"\"><!--block-->25 days annual leave plus every bank holiday</li><li style=\"\"><!--block-->Company pension (up to 10% employer contribution)</li><li style=\"\"><!--block-->Company performance based Bonus scheme</li><li style=\"\"><!--block-->Paid day off to celebrate your birthday</li><li style=\"\"><!--block-->Additional holiday purchase (up to 5 days per year)</li><li style=\"\"><!--block-->Additional holidays for length of service (up to 3 days)</li><li style=\"\"><!--block-->Private medical insurance</li><li style=\"\"><!--block-->Dental and health cash plans</li><li style=\"\"><!--block-->Enhanced parental leave and pay</li><li style=\"\"><!--block-->Discounts on gym membership and health screening</li><li style=\"\"><!--block-->Employee assistance programme</li><li style=\"\"><!--block-->Life assurance of 4x basic salary</li><li style=\"\"><!--block-->£500 pension advice per year</li><li style=\"\"><!--block-->6 paid days per year for self development</li><li style=\"\"><!--block-->Individual training budget per year</li><li style=\"\"><!--block-->Professional memberships funded</li><li style=\"\"><!--block-->Salary sacrifice car scheme</li><li style=\"\"><!--block-->Cycle, Home &amp; Tech scheme</li></ul><div><!--block--><em>** Please note that any applications submitted for this role will not be reviewed until January 2025**</em></div><img src=\"https://remotive.com/job/track/1959419/blank.gif?source=public_api\" alt=\"\"/>","tags":"[\"AWS\",\"kubernetes\",\"terraform\"]","pubDate":"2024-12-26T15:50:07.000Z","link":"https://remotive.com/remote-jobs/devops/platform-engineer-1959419","slug":"platform-engineer-wealthwizards-3671"}]