[{"id":7239256800,"title":"Embedded Linux Field Engineering Manager","company":"Canonical","image":"https://pbs.twimg.com/profile_images/1673959375340290050/x7pNtXQ7_400x400.jpg","description":"\n      <p>Canonical is a leading provider of open source software and operating systems to the global enterprise and technology markets. Our platform, Ubuntu, is very widely used in breakthrough enterprise initiatives such as public cloud, data science, AI, engineering innovation and IoT. Our customers include the world's leading public cloud and silicon providers, and industry leaders in many sectors. The company is a pioneer of global distributed collaboration, with 1200+ colleagues in 75+ countries and very few office based roles. Teams meet two to four times yearly in person, in interesting locations around the world, to align on strategy and execution.</p>\n<p>The company is founder-led, profitable and growing.</p>\n<p>We are hiring an <strong>Embedded Linux Field Engineering Manager</strong> to lead a regionally-focused team of Field engineers in Presales and Professional Services activities, by helping customers with solution architecture, design and delivery.</p>\n<p><strong>Location: </strong>This is a remote role, running a team in one of three Geos, Americas, EMEA or APAC. You will therefore need to be located in one of those three Geos to manage that specific team that spans few timezones from you</p>\n<p>Our Internet of Things mission is to enable companies to make fleets of very secure connected devices. Canonical provides the base Ubuntu OS and kernel, with secure update and management mechanisms. Our customers create mission-critical control systems, gateways and appliances that need to meet stringent quality and security requirements, and we aspire to bring this level of security to the wider consumer electronics and device market.</p>\n<p>Our Field Engineers are thought leaders helping our customers solve hard problems. They are accomplished technologists that take a hands-on approach to embedded Linux strategy and delivery. They have a passion to help customers achieve ambitious technical and business goals, and to show how the Canonical approach to open source and connected devices brings best-of-breed thinking to the emerging field of edge compute. They also care to develop their colleagues, helping them deepen their understanding of the technology, their ability to manage time, and their awareness of customer business thinking for continuous improvement and personal development.</p>\n<p>This career opportunity requires a unique blend of skills. Successful candidates will know Linux well and be proficient coders and scripters. They will have experience of low-level Linux boot, BIOS, firmware and embedded software development methodologies. They also enjoy the pace of change and diversity of client engagements with driven and ambitious technology entrepreneurs. Competitive, business-focused technologists at heart, they are also team drivers that take pride in team and company wins.</p>\n<h3>The role entails</h3>\n<ul>\n<li>Lead and develop a team of Field engineers, ranging from graduate to senior, in the areas of Presales and Professional Services</li>\n<li>Solve customer problems by promoting our technologies and being a trusted advisor</li>\n<li>Work remotely in a single major time zone</li>\n<li>Coach, mentor, and offer career development feedback</li>\n<li>Identify and measure team health indicators</li>\n<li>Implement disciplined engineering processes</li>\n<li>Represent your team and product to stakeholders, partners, and customers&nbsp;</li>\n<li>Develop and evangelise great engineering and organisational practices</li>\n<li>Plan and manage progress on agreed goals and projects</li>\n<li>Be an active part of the leadership team, collaborating with other leaders</li>\n</ul>\n<h3>What we are looking for in you</h3>\n<ul>\n<li>Exceptional academic track record from both high school and university</li>\n<li>Bachelors degree in Computer Science or related technical field</li>\n<li>Extensive embedded Linux experience - Yocto or other</li>\n<li>Extensive Linux experience - Debian or Ubuntu preferred</li>\n<li>Fluency in at least one of Golang, Python, C, C++, or Rust</li>\n<li>Ability to manage a small team</li>\n<li>Experience with customer engagements</li>\n<li>Professional written and spoken English</li>\n<li>Excellent interpersonal skills, curiosity, flexibility, and accountability</li>\n<li>Result-oriented, with a personal drive to meet commitments&nbsp;</li>\n<li>An ability to communicate the business benefits of technology</li>\n<li>An humble learner and quick study</li>\n</ul>\n<p>Other desirable traits include RTOS experience, additional languages (both the programming and human kinds), and previous experience working in a remote-first, diverse, distributed company.</p>\n<h3>What we offer you</h3>\n<p>We consider geographical location, experience, and performance in shaping compensation worldwide. We revisit compensation annually (and more often for graduates and associates) to ensure we recognise outstanding performance. In addition to base pay, we offer a performance-driven annual bonus or commission. We provide all team members with additional benefits, which reflect our values and ideals. We balance our programs to meet local needs and ensure fairness globally.</p>\n<ul>\n<li>Distributed work environment with twice-yearly team sprints in person</li>\n<li>Personal learning and development budget of USD 2,000 per year</li>\n<li>Annual compensation review</li>\n<li>Recognition rewards</li>\n<li>Annual holiday leave</li>\n<li>Maternity and paternity leave</li>\n<li>Employee Assistance Programme</li>\n<li>Opportunity to travel to new locations to meet colleagues from your team and others</li>\n<li>Priority Pass, and travel upgrades for long haul company events</li>\n</ul>\n<h3>About Canonical</h3>\n<p>Canonical is a pioneering tech firm at the forefront of the global move to open source. As the company that publishes Ubuntu, one of the most important open source projects and the platform for AI, IoT and the cloud, we are changing the world of software. We recruit on a global basis and set a very high standard for people joining the company. We expect excellence - in order to succeed, we need to be the best at what we do. Most colleagues at Canonical have worked from home since its inception in 2004.​ Working here is a step into the future, and will challenge you to think differently, work smarter, learn new skills, and raise your game.</p>\n<p><strong>Canonical is an equal opportunity employer</strong></p>\n<p>We are proud to foster a workplace free from discrimination. Diversity of experience, perspectives, and background create a better work environment and better products.&nbsp;<a href=\"https://canonical.com/careers/diversity/identity\">Whatever your identity, we will give your application fair consideration.</a></p>\n<p>#LI-remote</p>\n<p>Requisition ID: 753</p><p></p>\n    ","tags":"[\"management\",\"engineering\"]","pubDate":"2024-11-26 15:12:07.255","link":"https://canonical.com/careers/3756791","savedDate":"2024-11-26 15:12:07.255","slug":"embedded-linux-field-engineering-manager-canonical-895"},{"id":3819014514,"title":"Engineering Manager - Snap Store & Charmhub","company":"Canonical","image":"https://pbs.twimg.com/profile_images/1673959375340290050/x7pNtXQ7_400x400.jpg","description":"\n      <p>This is a technical management role to lead a team that develops Python and Golang micro-services that power our global software distribution engine. The world sees it as the <a href=\"https://snapcraft.io/store\">Snap Store</a> and <a href=\"https://charmhub.io/\">Charmhub.io</a> marketplaces, behind the scenes it is a unified system that understands key concepts in software distribution - architectures, releases, betas, release candidates, stable releases, branches and more. We are on a journey to transform the experience that people all over the world have with their open source software by significantly expanding the range of software we can deliver through this system. If you have a passion for clean APIs, believe that great engineers ship software calmly and regularly against an agile plan, and know that tests are the key to higher velocity and reliability, you'll fit right in.</p>\n<p>This is a great opportunity to take part in engineering a highly scalable SaaS product (think about the load on our systems when one of our largest Ubuntu Desktop snaps is updated by the publisher, for instance). In addition, you will have the opportunity to learn from Canonical's world-class security team as we work collectively to deliver this capability, safely, to our customers around the world.</p>\n<p>As an Engineering Manager at Canonical, you must be technically strong, but your main responsibility is to run an effective team and develop the colleagues you manage. You will develop and review code as a leader, but know that the best way to improve the product is to ensure that the whole team is focused, productive and unblocked. You are expected to help them grow as engineers, do meaningful work, do it outstandingly well, find professional and personal satisfaction, and work well with colleagues and the community. You will also be expected to be a positive influence on culture, facilitate technical delivery, and regularly reflect with your team on strategy and execution. You will collaborate closely with other Engineering Managers, product managers, and architects, producing an engineering roadmap with ambitious and achievable goals.</p>\n<p>We expect Engineering Managers to be fluent in the programming language, architecture, and components that their team uses. Code reviews and architectural leadership are part of the job. The commitment to healthy engineering practices, documentation, quality and performance optimisation is as important, as is the requirement for fair and clear management, and the obligation to ensure a high-performing team.</p>\n<p>This is a great opportunity to really learn how to do engineering of a highly-scalable SaaS product (think about the load on our systems when one of our largest Ubuntu Desktop snaps is updated by the publisher, for instance).&nbsp; In addition, you will have the opportunity to learn from Canonical's world-class security team as we work collectively to deliver this capability, safely, to our customers around the world.</p>\n<p><strong>Location</strong>: This role may be based remotely in the Americas, Europe, Middle East or Africa time zones.</p>\n<h2>What your day will look like</h2>\n<ul>\n<li>Lead a remote team of engineers in your time zone</li>\n<li>Develop talent through coaching, mentoring, feedback, and hands-on career development</li>\n<li>Set and manage expectations with other engineering teams, management, and external stakeholders</li>\n<li>Be an active part of the leadership team and collaborate with other leaders in the organisation</li>\n<li>With your team, build clean web service APIs to support both CLI and web frontend clients, using Python (and optionally Golang).</li>\n<li>Engage with many other teams at Canonical, as well as the open-source community and commercial partners</li>\n</ul>\n<h2>What we are looking for in you</h2>\n<ul>\n<li>Good experience in leading modern, agile software development practices</li>\n<li>Experience in forming a healthy, collaborative engineering culture in line with the company values</li>\n<li>Demonstrative experience of being a role model for sound engineering principles and directly contributing toward your team's goals</li>\n<li>Willingness to travel up to 4 times a year for internal events</li>\n<li>You love to mentor, develop and grow people, and have a track record of doing it</li>\n<li>You are knowledgeable and passionate about software development</li>\n<li>You are focused on success and the timely delivery of high-quality software</li>\n<li>You value and nurture great team culture and spirit</li>\n<li>You have experience and commitment to agile development methodologies</li>\n<li>Software development experience in Python (experience in Golang in addition to that would be a big plus)</li>\n<li>Effective written and verbal communication skills</li>\n<li>Practical experience with Linux system administration</li>\n</ul>\n<h2>What we offer you</h2>\n<p>Your base pay will depend on various factors including your geographical location, level of experience, knowledge and skills. In addition to the benefits above, certain roles are also eligible for additional benefits and rewards including annual bonuses and sales incentives based on revenue or utilisation. Our compensation philosophy is to ensure equity right across our global workforce.</p>\n<p>In addition to a competitive base pay, we provide all team members with additional benefits, which reflect our values and ideals. Please note that additional benefits may apply depending on the work location and, for more information on these, you can ask in the later stages of the recruitment process.</p>\n<ul>\n<li>Fully remote working environment - we’ve been working remotely since 2004!</li>\n<li>Personal learning and development budget of 2,000USD per annum</li>\n<li>Annual compensation review</li>\n<li>Recognition rewards</li>\n<li>Annual holiday leave</li>\n<li>Parental leave</li>\n<li>Employee Assistance Programme</li>\n<li>Opportunity to travel to new locations to meet colleagues at ‘sprints’</li>\n<li>Priority Pass for travel and travel upgrades for long haul company events</li>\n</ul>\n<h2>About Canonical</h2>\n<p>Canonical is a pioneering tech firm that is at the forefront of the global move to open source. As the company that publishes Ubuntu, one of the most important open source projects and the platform for AI, IoT and the cloud, we are changing the world on a daily basis. We recruit on a global basis and set a very high standard for people joining the company. We expect excellence - in order to succeed, we need to be the best at what we do.</p>\n<p>Canonical has been a remote-first company since its inception in 2004.​ Work at Canonical is a step into the future, and will challenge you to think differently, work smarter, learn new skills, and raise your game. Canonical provides a unique window into the world of 21st-century digital business.</p>\n<h2>Canonical is an equal opportunity employer</h2>\n<p>We are proud to foster a workplace free from discrimination. Diversity of experience, perspectives, and background create a better work environment and better products. <a href=\"https://canonical.com/careers/diversity/identity\">Whatever your identity, we will give your application fair consideration.</a></p>\n<p>#LI-remote&nbsp;</p><p>Requisition ID: 1071</p><p></p>\n    ","tags":"[\"management\",\"engineering\"]","pubDate":"2024-11-26 15:12:07.255","link":"https://canonical.com/careers/5127399","savedDate":"2024-11-26 15:12:07.255","slug":"engineering-manager-snap-store-charmhub-canonical-9785"},{"id":8373658568,"title":"Software Developer in Test (Low Level Programming)","company":"Status","image":"https://avatars.githubusercontent.com/u/11767950?s=200&v=4","description":"\n    <div class=\"content-intro\"><p style=\"text-align: justify;\"><strong>About Status</strong></p>\n<p style=\"text-align: justify;\"><span style=\"font-weight: 400;\">Status is building the tools and infrastructure for the advancement of a secure, private, and open web3.&nbsp;</span></p>\n<p style=\"text-align: justify;\"><span style=\"font-weight: 400;\">With the high level goals of preserving the right to privacy, mitigating the risk of censorship, and promoting economic trade in a transparent, open manner, Status is building a community where anyone is welcome to join and contribute.</span></p>\n<p style=\"text-align: justify;\"><span style=\"font-weight: 400;\">As an organization, Status seeks to push the web3 ecosystem forward through research, creation of developer tools, and support of the open source community.&nbsp;</span></p>\n<p style=\"text-align: justify;\"><span style=\"font-weight: 400;\">As a product, Status is an open source, Ethereum-based app that gives users the power to chat, transact, and access a revolutionary world of Apps on the decentralized web. But Status is also building foundational infrastructure for the whole Ethereum ecosystem, including the Nimbus ETH 1.0 and 2.0 clients, the Keycard hardware wallet, and the Waku messaging protocol, the p2p communication layer for Web3.</span></p>\n<p style=\"text-align: justify;\"><span style=\"font-weight: 400;\">As a team, Status has been completely distributed since inception. Our team is currently 200+ core contributors strong, and welcomes a growing number of community members from all walks of life, scattered all around the globe.&nbsp;</span></p>\n<p style=\"text-align: justify;\"><span style=\"font-weight: 400;\">We care deeply about open source, and our organizational structure has minimal hierarchy and no fixed work hours. We believe in working with a high degree of autonomy while supporting the organization's priorities.</span></p></div>\n\n    <div class=\"careers-block__trix external-panel text-left\">\n<div class=\"careers-block__trix external-panel text-left\">\n<div class=\"careers-block__trix external-panel text-left\">\n<div>\n<h3><strong>About Vac</strong></h3>\n<p class=\"part\" data-startline=\"5\" data-endline=\"6\"><a href=\"https://vac.dev/\" target=\"_blank\">Vac</a>&nbsp;builds&nbsp;<a href=\"https://en.wikipedia.org/wiki/Public_good\" target=\"_blank\">public good protocols</a> for the decentralized web.&nbsp;We do applied research based on which we build protocols, libraries and publications.</p>\n<h3 id=\"The-role\" class=\"part\" data-startline=\"11\" data-endline=\"11\">The role</h3>\n<p class=\"part\" data-startline=\"13\" data-endline=\"16\">We are seeking a skilled and passionate Software Developer in Test with experience in Low Level Programming to join our Vac QA team. As a Test Automation Engineer, you will play a crucial role in ensuring the reliability, performance, and scalability of distributed systems within Vac and the <a href=\"https://free.technology/\" target=\"_blank\">IFT</a>.</p>\n<p class=\"part\" data-startline=\"13\" data-endline=\"16\">Your responsibilities will include automating comprehensive test plans, as well as contributing to the identification and resolution of complex issues.&nbsp;Leveraging your expertise in programming and systems knowledge, you will help validating the functionality of distributed systems.</p>\n<h3 id=\"Key-responsibilities\" class=\"part\" data-startline=\"18\" data-endline=\"18\">Key responsibilities</h3>\n<ul class=\"part\" data-startline=\"20\" data-endline=\"24\">\n<li class=\"\" data-startline=\"20\" data-endline=\"20\">Implement (Nim, Rust, TS, Python), and maintain integration tests in collaboration with other QAs and Devs.</li>\n<li class=\"\" data-startline=\"21\" data-endline=\"21\">Execute and automate test plans, test cases, and test scripts to validate the functionality, performance, and scalability of distributed systems.</li>\n<li class=\"\" data-startline=\"22\" data-endline=\"22\">Identify, reproduce, and debug complex issues in distributed systems, working closely with Logos development teams.</li>\n<li class=\"\" data-startline=\"23\" data-endline=\"23\">Work with Docker, Kubernetes, and POSIX-like systems.</li>\n<li class=\"\" data-startline=\"24\" data-endline=\"24\">Create and maintain scalable test automation frameworks.</li>\n<li class=\"\" data-startline=\"25\" data-endline=\"26\">Integrate automated tests into CI pipelines using tools like Github Actions.</li>\n</ul>\n<h3 id=\"You-ideally-will-have\" class=\"part\" data-startline=\"25\" data-endline=\"25\">You ideally will have</h3>\n<ul class=\"part\" data-startline=\"27\" data-endline=\"31\">\n<li class=\"\" data-startline=\"29\" data-endline=\"29\">Solid experience with systems programming languages like Rust, Nim, Go.</li>\n<li class=\"\" data-startline=\"30\" data-endline=\"30\">Working knowledge of Docker, Kubernetes, and POSIX-like systems.</li>\n<li class=\"\" data-startline=\"31\" data-endline=\"31\">Experience with scripting languages like Python.</li>\n<li class=\"\" data-startline=\"32\" data-endline=\"32\">Knowledge of tests automation tools, best practices and design patterns.</li>\n<li class=\"\" data-startline=\"33\" data-endline=\"33\">Excellent written and conversational communication skills.</li>\n<li class=\"\" data-startline=\"34\" data-endline=\"35\">Alignment with our core values and principles.</li>\n</ul>\n<h3 id=\"Bonus-points\" class=\"part\" data-startline=\"32\" data-endline=\"32\">Bonus points</h3>\n<ul class=\"part\" data-startline=\"34\" data-endline=\"38\">\n<li class=\"\" data-startline=\"38\" data-endline=\"38\">Experience with off-the-shelf networking stacks such as libp2p.</li>\n<li class=\"\" data-startline=\"39\" data-endline=\"39\">Experience in blockchain technology.</li>\n<li class=\"\" data-startline=\"40\" data-endline=\"40\">Experience working for an open-source organization.</li>\n<li class=\"\" data-startline=\"41\" data-endline=\"42\">Experience with desktop UI automation.</li>\n</ul>\n</div>\n<p>[Don’t worry if you don’t meet all of these criteria, we’d still love to hear from you anyway if you think you’d be a great fit for this role. Just explain to us why in your cover letter].</p>\n<p><strong>Hiring process&nbsp;</strong></p>\n<p>The hiring process for this role will be:</p>\n<ol>\n<li>Interview with our POps team</li>\n<li>Interview with team member from the Vac QA team</li>\n<li>Take home assignment &amp; interview with team member from the Vac QA team</li>\n<li>Interview with Vac team lead</li>\n</ol>\n<p>The steps may change along the way if we see it makes sense to adapt the interview stages, so please consider the above as a guideline.</p>\n<p><strong>Compensation</strong></p>\n<p>The expected compensation range for this role is negotiable, dependent on how we assess your skills and experience throughout our interview process. We are happy to pay in any mix of fiat/crypto.</p>\n</div>\n</div>\n</div>\n\n    \n\n    \n","tags":"[]","pubDate":"2024-11-26 15:12:07.254","link":"https://boards.greenhouse.io/embed/job_app?for=status72&token=6393565&b=https%3A%2F%2Fjobs.status.im%2F","savedDate":"2024-11-26 15:12:07.254","slug":"software-developer-in-test-low-level-programming-status-8526"},{"id":2338022988,"title":"Senior Product Manager","company":"Instrumentl","image":"https://pbs.twimg.com/profile_images/1263546899153502209/ObHsQoNr_400x400.jpg","description":"<div class=\"section page-centered\" data-qa=\"job-description\"><div><b>Hello, we’re Instrumentl.&nbsp;</b></div><div>We’re a mission-driven startup helping the nonprofit sector to drive impact, and we’re well on our way to becoming the #1 most-loved grant discovery and management tool. To help us get there, we’re hiring a senior product manager to build innovative technology for our nonprofit customers.</div><div><br></div><div>Instrumentl is fully distributed but has a significant percentage of the senior team in the SF Bay Area. If you're not based in the Bay Area, you're open to traveling to the Oakland, California office once or twice a year for a week of in-person work.</div><div><br></div><div><b>About us</b></div><div>Instrumentl (YC S16) is the best platform for nonprofits and grant writing consultants looking to grow revenue. We help over 4,000 organizations win more grants by bringing discovery, research and tracking to one place. Our customers are on the front lines educating kids, saving endangered species, and restoring watersheds. By supporting their grant discovery and management on Instrumentl, you’ll help move the world forward. 🌎✨</div><div><br></div><div>Our charts are dramatically up-and-to-the-right 📈 — we’re cash flow positive and doubling year-over-year, with customers who love us (NPS is 65+ and Ellis PMF survey is 60+). Join us on this rocket ship! Get to know the team more at <a rel=\"noopener noreferrer\" class=\"postings-link\" href=\"http://instrumentl.com/about\">instrumentl.com/about</a>! We can’t wait to meet you.</div><div><br></div><div><b>About the role</b></div><div>As a Senior Product Manager at Instrumentl,  you will be partnering closely with design and engineering to create, own, and execute the product vision for both (1) transforming our existing, beloved grant discovery product to an AI-native experience as well as (2) evolving our current AI-native grant writing product. For the former, you’ll be partnering with another PM internally but will be the product lead on the initiative.&nbsp;</div><div><br></div><div>This role reports to Instrumentl's Head of Product, Ishita Arora, and is a part of the broader product and design team. You’ll be the 3rd product manager at Instrumentl and belong to an EPD org of 3 designers and ~20 (and growing!) engineers.&nbsp;</div></div><div class=\"section page-centered\"><div><h3>What you’ll do</h3><ul class=\"posting-requirements plain-list\"><ul><li><b>Lead Apply's evolution: </b>Work closely with design and engineering to drive the strategy and execution for Apply in 2025, focusing on revolutionizing how nonprofits manage their grant application process. This involves both development of the customer-facing product as well as the internal tooling that supports application form building for customers.&nbsp;</li><li><b>Launch our AI Prospecting Co-pilot:</b> Drive the development of our Discover Co-pilot, creating an AI-powered prospecting co-pilot that delivers personalized, high-quality prospecting strategies.&nbsp;</li><li><b>Champion integration:</b> Ensure seamless connectivity between Apply and our broader platform, particularly with our Document Library, to create a cohesive user experience.</li><li><b>Generate revenue impact</b>: Work closely without GTM teams (marketing, sales and CS teams) to ensure that the product we ship drives tangible business outcomes. </li></ul></ul></div></div><div class=\"section page-centered\"><div><h3>Who you are</h3><ul class=\"posting-requirements plain-list\"><ul><li><b>Experienced:</b> At least 6+ years of product management experience with at least 3+ years in B2B SaaS and at least 1+ year focused on AI-powered products.</li><li><b>“Full-stack”: </b>You comfortably traverse the product stack–whether it’s strategic planning and prioritization for the product roadmap or zooming in at the 1 inch view to ensure we’ve thought through all the edge cases for a feature. </li><li><b>On the cutting edge: </b>You stay current with emerging product and technology capabilities like autonomous AI agents, emergent model capabilities, and evaluation frameworks. You are discerning between hype and genuine innovation and can translate these cutting edge developments into delivering real user value.</li><li><b>Customer-obsessed: </b>You believe customers are the hero of the story, and integrate customer feedback throughout the product development process–whether it’s teaming up with design to conduct user research or hopping on sales or customer success calls to get the insight you need.</li><li><b>Cross-functionally collaborative: </b>You excel at fostering relationships across the organization, from engineering and design to sales, marketing, and customer success because you understand that the best solutions come from the intersection of different perspectives, and you harness this collective wisdom to drive the product forward.</li><li><b>Detail-oriented: </b>You believe in sweating the details to ensure we deliver the right experience to customers and have a track record of delivering complex, high quality products. </li></ul></ul></div></div><div class=\"section page-centered\"><div><h3>Compensation and Benefits</h3><ul class=\"posting-requirements plain-list\"><ul><li>$150,000-$180,000 + equity&nbsp;</li><li>100% covered health, dental, and vision insurance for employees (50% for dependents)</li><li>Generous PTO policy, including parental leave</li><li>401(k)</li><li>Company laptop + stipend to set up your home workstation</li><li>Company retreats for in-person time with your colleagues</li><li>Work with awesome nonprofits around the US. We partner with incredible organizations doing meaningful work, and you get to help power their success!</li><div><br></div><div>The pay range listed for this position assumes residency in California; however, base pay offered may vary depending on job-related knowledge, skills, candidate location, and experience.</div><div><br></div><div><br></div><div>Applicants must be authorized to work for ANY employer in the U.S. We are unable to sponsor or take over sponsorship of an employment Visa at this time.</div><div><br></div></ul></ul></div></div><div class=\"section page-centered\" data-qa=\"salary-range\"><div>$150,000 - $180,000 a year</div></div><div class=\"section page-centered last-section-apply\" data-qa=\"btn-apply-bottom\"><a class=\"postings-btn template-btn-submit hex-color\" data-qa=\"show-page-apply\" href=\"https://jobs.lever.co/Instrumentl/70263c35-5fad-419c-9158-2109f3c140ee/apply\">Apply for this job</a></div>","tags":"[\"management\",\"engineering\",\"B2B\"]","pubDate":"2024-11-26 15:12:07.253","link":"https://jobs.lever.co/Instrumentl/70263c35-5fad-419c-9158-2109f3c140ee","savedDate":"2024-11-26 15:12:07.253","slug":"senior-product-manager-instrumentl-2349"},{"id":2636090716,"title":"Web Developer","company":"Status","image":"https://avatars.githubusercontent.com/u/11767950?s=200&v=4","description":"\n    <div class=\"content-intro\"><p style=\"text-align: justify;\"><strong>About Status</strong></p>\n<p style=\"text-align: justify;\"><span style=\"font-weight: 400;\">Status is building the tools and infrastructure for the advancement of a secure, private, and open web3.&nbsp;</span></p>\n<p style=\"text-align: justify;\"><span style=\"font-weight: 400;\">With the high level goals of preserving the right to privacy, mitigating the risk of censorship, and promoting economic trade in a transparent, open manner, Status is building a community where anyone is welcome to join and contribute.</span></p>\n<p style=\"text-align: justify;\"><span style=\"font-weight: 400;\">As an organization, Status seeks to push the web3 ecosystem forward through research, creation of developer tools, and support of the open source community.&nbsp;</span></p>\n<p style=\"text-align: justify;\"><span style=\"font-weight: 400;\">As a product, Status is an open source, Ethereum-based app that gives users the power to chat, transact, and access a revolutionary world of Apps on the decentralized web. But Status is also building foundational infrastructure for the whole Ethereum ecosystem, including the Nimbus ETH 1.0 and 2.0 clients, the Keycard hardware wallet, and the Waku messaging protocol, the p2p communication layer for Web3.</span></p>\n<p style=\"text-align: justify;\"><span style=\"font-weight: 400;\">As a team, Status has been completely distributed since inception. Our team is currently 200+ core contributors strong, and welcomes a growing number of community members from all walks of life, scattered all around the globe.&nbsp;</span></p>\n<p style=\"text-align: justify;\"><span style=\"font-weight: 400;\">We care deeply about open source, and our organizational structure has minimal hierarchy and no fixed work hours. We believe in working with a high degree of autonomy while supporting the organization's priorities.</span></p></div>\n\n    <p><strong>Who are we?</strong></p>\n<p>IFT is a pioneering force in the Web3 ecosystem, committed to the development, adoption, and accessibility of solutions to digital age problems; guided by our principles: liberty, censorship resistance, security, privacy, and inclusivity. Our mission is to build public goods to safeguard civil liberties in the digital age.</p>\n<p>&nbsp;</p>\n<p><strong>The role</strong></p>\n<p>As a Web Developer at IFT, you will be responsible for As a Web Developer, you will be responsible for the development and technical maintenance of various web-based projects in the studio. Your role will involve decision-making for code architecture, writing tests, choosing the right technology stack, and any other related tasks. You will work closely with the development team, project management, studio lead, and design team to bring our web projects to life.</p>\n<p>&nbsp;</p>\n<p><strong>Key responsibilities:</strong>&nbsp;</p>\n<ul>\n<li>You will take care of all technical aspects of all web projects (from development and testing to deployment and maintenance)</li>\n<li>You will be developing and implementing websites, internal tools and our design systems implementation in React.</li>\n<li>You will co-write documentation for all the above mentioned products/projects</li>\n<li>You will be responsible for maintaining our open-sourced codebases on Github.</li>\n</ul>\n<p>&nbsp;</p>\n<p><strong>You will ideally have:&nbsp;</strong></p>\n<ul>\n<li>Proficiency in Design Tools: Extensive experience with design tools that cater to UX, UI, and micro-interactions, such as Figma and Framer.</li>\n<li>Frontend and Backend Expertise: Experience in implementation of frontend libraries and design systems (ReactJS, NextJS), and backend (NodeJs, NestJS), all in Typescript</li>\n<li>Software Architecture Knowledge: Solid understanding of software architecture principles, ensuring scalable and maintainable code.</li>\n<li>DevOps and Deployment Experience: Hands-on experience with Git, Docker, coupled with expertise in deployment platforms like Vercel.</li>\n<li>MDX-Based Content Management: Knowledgeable in managing content using MDX with Docusaurus.</li>\n<li>Experience with JAMstack: Familiarity with JAMstack architecture, including static site generators, headless CMS, and modern web technologies.</li>\n<li>Alignment with our principles: Strong alignment with our core principles: <a href=\"https://status.app/manifesto\">https://status.app/manifesto</a></li>\n</ul>\n<p>&nbsp;</p>\n<p><strong>Bonus points:&nbsp;</strong></p>\n<ul>\n<li>You are comfortable working remotely and asynchronously</li>\n<li>You have experience working for an open-source organisation</li>\n<li>You have exposure to creative coding (processing, openframeworks, WebGL, writing shaders, p5js)</li>\n</ul>\n<p><em>[Don’t worry if you don’t meet all of these criteria, we’d still love to hear from you anyway if you think you’d be a great fit for this role. Just explain to us why in your cover letter].</em></p>\n<p>&nbsp;</p>\n<p><strong>Hiring process:</strong></p>\n<ol>\n<li>Interview with our People Ops team</li>\n<li>Interview with Jerry</li>\n<li>Interview with Jinho</li>\n<li>Assessment<a href=\"https://docs.google.com/document/d/1-KCt5RPaSZ-E1h8CRJUHw8jDfAZThVombgNLdARdpds/edit\"> </a></li>\n<li>Interview with Nick</li>\n</ol>\n<p><em>The steps may change along the way if we see it makes sense to adapt the interview stages, so please consider the above as a guideline.&nbsp;</em></p>\n<p><strong><br></strong><strong>Compensation</strong></p>\n<p>We are happy to pay in any mix of fiat/crypto.</p>\n\n    \n\n    \n","tags":"[\"typescript\",\"management\"]","pubDate":"2024-11-26 15:12:07.253","link":"https://boards.greenhouse.io/embed/job_app?for=status72&token=6242476&b=https%3A%2F%2Fjobs.status.im%2F","savedDate":"2024-11-26 15:12:07.253","slug":"web-developer-status-7356"},{"id":6164609552,"title":"Data Engineer","company":"Status","image":"https://avatars.githubusercontent.com/u/11767950?s=200&v=4","description":"\n    <div class=\"content-intro\"><p style=\"text-align: justify;\"><strong>About Status</strong></p>\n<p style=\"text-align: justify;\"><span style=\"font-weight: 400;\">Status is building the tools and infrastructure for the advancement of a secure, private, and open web3.&nbsp;</span></p>\n<p style=\"text-align: justify;\"><span style=\"font-weight: 400;\">With the high level goals of preserving the right to privacy, mitigating the risk of censorship, and promoting economic trade in a transparent, open manner, Status is building a community where anyone is welcome to join and contribute.</span></p>\n<p style=\"text-align: justify;\"><span style=\"font-weight: 400;\">As an organization, Status seeks to push the web3 ecosystem forward through research, creation of developer tools, and support of the open source community.&nbsp;</span></p>\n<p style=\"text-align: justify;\"><span style=\"font-weight: 400;\">As a product, Status is an open source, Ethereum-based app that gives users the power to chat, transact, and access a revolutionary world of Apps on the decentralized web. But Status is also building foundational infrastructure for the whole Ethereum ecosystem, including the Nimbus ETH 1.0 and 2.0 clients, the Keycard hardware wallet, and the Waku messaging protocol, the p2p communication layer for Web3.</span></p>\n<p style=\"text-align: justify;\"><span style=\"font-weight: 400;\">As a team, Status has been completely distributed since inception. Our team is currently 200+ core contributors strong, and welcomes a growing number of community members from all walks of life, scattered all around the globe.&nbsp;</span></p>\n<p style=\"text-align: justify;\"><span style=\"font-weight: 400;\">We care deeply about open source, and our organizational structure has minimal hierarchy and no fixed work hours. We believe in working with a high degree of autonomy while supporting the organization's priorities.</span></p></div>\n\n    <p><strong>About the Infrastructure Team</strong></p>\n<p>We’re a team scattered across the world, supporting teams building various things, from decentralized messaging protocols, through chat wallet applications for all platforms, to core components of Ethereum network infrastructure. We work asynchronously, with a high level of independence.</p>\n<p><br>We are seeking a Data Engineer to construct and maintain dynamic dashboards for to help with managing multiple software projects, handling financial portfolios, and coordinating social campaigns. The successful candidate will collect, analyze, and interpret data to provide actionable insights, enabling us to effectively track and improve our project progress.</p>\n<p>&nbsp;</p>\n<p><strong>Key responsibilities</strong></p>\n<ul>\n<li>Develop and implement data pipelines for Open Source Project development, communication campaigns, and finance overview</li>\n<li>Build visualization tools to track and analyze project progress, communication effectiveness, and financial health</li>\n<li>Accompany teams lead to identify key elements for KPI analysis</li>\n<li>Manage Data Warehouse to maintain data quality</li>\n</ul>\n<p><strong>You ideally will have&nbsp;</strong></p>\n<ul>\n<li>Experience with Data Pipeline implementation (DBT, Airflow, Airbyte)</li>\n<li>Experience with SQL optimization</li>\n<li>Experience with Python or other scripting languages</li>\n<li>Experience with Grafana or other visualization tools</li>\n<li>Experience in, and passion for, blockchain technology</li>\n<li>A strong alignment to our principles:&nbsp;<a href=\"https://status.app/manifesto\">https://status.app/manifesto</a></li>\n</ul>\n<p>&nbsp;</p>\n<p><strong>Bonus points if&nbsp;</strong></p>\n<ul>\n<li>Comfortable working remotely and asynchronously</li>\n<li>Experience working for an open source organization.&nbsp;&nbsp;</li>\n<li>Experience with Linux, Docker</li>\n<li>Experience with LLM fine-tuning</li>\n</ul>\n<p><em><span style=\"font-weight: 400;\">[Don’t worry if you don’t meet all of these criteria, we’d still love to hear from you anyway if you think you’d be a great fit for this role. Just explain to us why in your cover letter]</span></em></p>\n<p>&nbsp;</p>\n<p><strong>Hiring Process&nbsp;</strong></p>\n<ol>\n<li style=\"font-weight: 400;\"><span style=\"font-weight: 400;\">Interview with People Ops team</span></li>\n<li style=\"font-weight: 400;\"><span style=\"font-weight: 400;\">Technical Task</span></li>\n<li style=\"font-weight: 400;\"><span style=\"font-weight: 400;\">Interview with BI Team Lead</span></li>\n<li style=\"font-weight: 400;\"><span style=\"font-weight: 400;\">Interview with Infra Team Lead<br><br></span></li>\n</ol>\n<p><strong>Compensation</strong></p>\n<p>We are happy to pay in any mix of fiat/crypto.</p>\n\n    \n\n    \n","tags":"[\"Finance\"]","pubDate":"2024-11-26 15:12:07.253","link":"https://boards.greenhouse.io/embed/job_app?for=status72&token=6308385&b=https%3A%2F%2Fjobs.status.im%2F","savedDate":"2024-11-26 15:12:07.253","slug":"data-engineer-status-6629"},{"id":9618902627,"title":"Category Management Intern","company":"Ciceksepeti","image":"https://lever-client-logos.s3.us-west-2.amazonaws.com/de4eebbf-97f1-4bdb-b542-4fa65a0b48ab-1662467464737.png","description":"<div><b>Want to join us as we move closer to be a leader in all markets in which we operate, as a pioneering tech company?</b>&nbsp;</div><div><br></div><div><span style=\"font-size: 10.5pt;\">We’re looking for bright, intellectually curious professionals ready to bring out the best in themselves devoid of corporate buzzwords and bureaucracy in a global environment. We offer real-life cases to resolve and a true taste of professional life in a high-growth, high-speed tech company.</span></div><div><span style=\"font-size: 10.5pt;\">If you want to hold full accountability of your work, if you want to be heard when you have new ideas to contribute to the business, and if you’re ready to experience exceptional on-the-job training; then you’re ready for the challenge.</span></div><h3>🎯Your Journey Begins: Embrace the Exciting Adventure Ahead!</h3><li>Developing and maintaining fruitful relations with vendors in line with company policy and commercial objectives</li><li>Continuously searching for new vendors, products and sub-categories to further develop the business and increase customer satisfaction</li><li>Conducting competitor analysis &amp; market research studies to present the optimum pricing options for our customers</li><li>Always keeping an eye on global e-tailers for best practices</li><div><br></div>,<h3>✨Let Your Skills Shine with Us!</h3><li><b>We need a strategic team player who won’t hesitate to roll up their sleeves to get results. We know that sounds ambitious, therefore the minimum requirements to handle the challenge are as follows:</b></li><li>Minimum 3-4 days per week is required for this position</li><li>Able to work on site 1 or 2 days per week </li><li>Based in İstanbul</li><li>Advanced skills in MS Office Programs</li><li>Strong communication and negotiation skills</li><div><br></div>,<h3>😎What’s in here for you?</h3><li>🎉Fun and Adventure Await: Get ready for exhilarating team adventures and unforgettable company activities that will create memories to cherish!&nbsp;🌈</li><li>🛍️Take excellent care of yourself : HiDoctor, Momento, and More!&nbsp;👩🏻‍⚕️</li><li>🎩Express Your Unique Style: No more stuffy suits or uncomfortable attire. Embrace your personal style and wear whatever makes you feel confident and comfortable. 👗👕</li><li>📚Unlock Your Potential: Biweekly Learning Hours and a Vast Training Library Await! 🎓 Never stop learning and growing! With unlimited access to top-notch training resources like Udemy and more, your professional growth knows no limits! 🚀</li><li>🥰Join Vibrant Social Clubs: Connect, Collaborate, and Create Lifelong Friendships!🎉Be part of our vibrant social clubs, where you can engage with colleagues who share your passions and interests. Cultivate meaningful connections, foster collaboration, and create memories that extend beyond the workplace.🤝</li><li>🤝Seamless Onboarding: Receive a Warm Welcome and a Smooth Transition! 📋 Our dedicated onboarding process ensures you feel supported and empowered from day one. We provide comprehensive training and resources to help you settle into your role quickly and effectively. 🌟</li><li>Join us on this exciting journey a dynamic work ecosystem, thrilling team activities, entertainment galore, a flexible dress code, and endless learning opportunities await you! It’s time to unleash your full potential and embrace the future of work!&nbsp;💃</li><div><b>😍About Us</b></div><div><br></div><div>As a pioneering tech company in gifts, our vision is to be a leader in all markets in which we operate. We create lifelong value in the lives of our employees, customers and all our business partners! 💪</div><div><br></div><div>Founded in 2006 by Emre Aydın, <a rel=\"noopener noreferrer\" class=\"postings-link\" href=\"http://ciceksepeti.com/\">Ciceksepeti.com</a> offers the broadest selection of flowers &amp; gifts delivered same day within a single experience. We are very proud to have created a culture of celebration among people with our gift arrangements and our brand Bonnyfood. We are committed to continuing this tradition by making every special day memorable. In addition to our original mission of bringing a new perspective to the e-commerce sector in Turkey and making shipping faster and easier, now we offer a diverse range of products under various categories, such as electronics, home &amp; living, personal care, supermarket, cosmetics, fashion, sports &amp; outdoor, hobby, pet shop, jewelry &amp; accessories, as well as flowers and edible flowers since 2019.</div><div><br></div><div><a rel=\"noopener noreferrer\" class=\"postings-link\" href=\"http://ciceksepeti.com/\">Ciceksepeti.com</a> is the most visited floral and gifting website according to SimilarWeb data, having 4 times more visitors than the second largest player in the world. 😎</div><div><br></div><div>Besides covering 70+ cities in Turkey through 55.000+ vendors and 24x7 customer support, Ciceksepeti has expanded into Mexico with its international brand, LolaFlora.💃</div><div><br></div><div>We are so happy and proud to have been selected the Best Employer Brand at LinkedIn Turkey Talent Awards in 2019 and 2022! 🥳</div><div><br></div><div>Headquartered in İstanbul, we’re a young, nimble, dedicated team of professionals, who are not only hard workers but also smart workers; who know how to get things done in the right way, as well as getting the right things done for our customers. Moreover, we’re on the verge of an exciting episode in our journey as we simultaneously set foot on international markets and grow further in the domestic market.</div><div><br></div><div>\"İşe alım süreçlerimizde kişisel verilerinizi nasıl işlediğimize dair bilgiye çalışan adayı aydınlatma metnimizden ulaşabilirsiniz./ Please see our candidate privacy note for information on how we process your personal data during our recruitment activities.\"</div><div><a rel=\"noopener noreferrer\" class=\"postings-link\" style=\"font-size: 15px;\" href=\"https://cdn03.ciceksepeti.com/editor/hr/Ciceksepeti_Calisan_Adayi_Aydinlatma_Metni_2024-08-29.pdf\">https://cdn03.ciceksepeti.com/editor/hr/Ciceksepeti_Calisan_Adayi_Aydinlatma_Metni_2024-08-29.pdf</a></div><div><a rel=\"noopener noreferrer\" class=\"postings-link\" style=\"font-size: 15px;\" href=\"https://cdn03.ciceksepeti.com/editor/hr/CS_Teknoloji_Calisan_Adayi_Aydinlatma_Metni_2024-08-29.pdf\">https://cdn03.ciceksepeti.com/editor/hr/CS_Teknoloji_Calisan_Adayi_Aydinlatma_Metni_2024-08-29.pdf</a></div>","tags":"[]","pubDate":"2024-11-26 14:02:12.980","link":"https://jobs.lever.co/ciceksepeti/7616fcfb-bad0-4c69-8b53-50a3e120202a","savedDate":"2024-11-26 15:12:07.269","slug":"category-management-intern-ciceksepeti-3198"},{"id":8106899505,"title":"Senior Data Scientist - Product Analytics","company":"VRChat","image":"https://pbs.twimg.com/profile_images/1719900921793003520/qPc3pV09_400x400.jpg","description":"<div><b style=\"font-size: 24px;\">Join the VRChat Team!</b></div><div><br></div><div><span style=\"font-size: 11pt;\">VRChat offers a first-of-its-kind, game-changing platform that provides an endless collection of social VR experiences and gives the power of creation to its robust community. With over 250,000 worlds and growing, VRChat’s vision is to allow users to bring their imaginations to life and help shape the metaverse anywhere in the world on any device.&nbsp;VRChat has raised around $100M to date with the support of our investors, which include: Makers Fund, Anthos Capital and HTC. We have a great team which includes people from: Netflix, Twitter, Meta, Microsoft, Roblox, Google, Amazon, Unity, Spotify, Discord, Uber, eBay, Robinhood, Twitch, Zynga and TikTok.&nbsp;</span></div><div><br></div><div><span style=\"font-size: 11pt;\">Come and join the mission!</span></div><div><br></div><div><b style=\"font-size: 24px;\">Job Overview</b></div><div><br></div><div><span style=\"font-size: 11pt;\">As a Senior Data Scientist on VRChat’s Data Team, you will play a key role in driving strategic product decisions and advancing our product roadmap across growth, user experience, creator, and economy verticals. The ideal candidate will have a background in a technical field, will have experience working with large production data sets, and will have some experience delivering data products on a fast-paced team.&nbsp;</span></div><div><br></div><div><span style=\"font-size: 11pt;\">This position will be full-time and remote.</span></div><h3>Duties and Responsibilities</h3><li>Partner with Product, Engineering, Design, and Marketing teams to scope, design, execute, measure, and improve the impact of product features and campaigns</li><li>Conduct quantitative analysis, deliver insights, and influence product decision making through an understanding of user behavior and our platform ecosystem</li><li>Design and monitor core metrics; perform root cause analysis to explain drivers</li><li>Identify trends and opportunities to drive growth, retention, and monetization initiatives</li><li>Create a healthy ecosystem for content creators, users, and consumers</li><li>Design and analyze experiments to inform and influence product investments</li><li>Acquire new data from various production systems and databases</li>,<h3>Experience, Skills, and Qualifications</h3><li>4+ years of experience in data science, data analytics, product analytics, or quantitative analysis</li><li>Expert background in utilizing SQL/Python to extract, manipulate, and analyze datasets</li><li>Work cross functionally to translate business problems into ones that can be solved and informed by experimentation and data analysis</li><li>Experience with creating data visualizations to communicate metric performance</li><li>Develop models of usage, user behavior &amp; business behavior to make recommendations and influence the product roadmap</li><li>Conduct A/B testing - design, execute, and analyze experiments to understand impact of product feature deployments and changes</li><li>Ability to effectively communicate complex analyses and insights to non-technical audiences</li>,<h3>Bonus Points</h3><li>Previous experience in data science, data analytics, or product analytics at a social or gaming company</li><li>Have curiosity and apply analytical skills to dive deep into data to find key insights that impact the business</li><li>Experience in stakeholder management, relationship building, and influencing senior audiences</li><li>Adaptability, tendency toward simple, creative solutions, and ability to effectively prioritize work in a demanding and changing environment</li>,<h3>Benefits</h3><li>Work from anywhere! VRChat is a 100% remote company</li><li>Health Benefits</li><li>401K for US &amp; RRSP for Canadian Employees</li><li>Stock Options</li><li>Generous paid holiday schedule</li><li>Unlimited/Flexible vacation time</li><li>Paid parental leave benefits&nbsp;</li><div><span style=\"font-size: 8pt;\">VRChat is an equal-opportunity employer, and we welcome applicants from all backgrounds. VRChat fosters a diverse, creative, and collaborative environment where anyone can contribute to any of the ongoing projects or direction of the roadmap at any time. If you’re a passionate team player who wants to have an impact on a dynamic team, we’d love to hear from you!</span></div><div><br></div><div><span style=\"font-size: 8pt;\">All job offers are subject to satisfactory referencing and background checks.</span></div>","tags":"[\"management\",\"engineering\",\"database\"]","pubDate":"2024-11-25 21:23:04.662","link":"https://jobs.lever.co/vrchat/457919bc-7e9c-4885-adc8-08532207f6c1","savedDate":"2024-11-26 15:12:07.257","slug":"senior-data-scientist-product-analytics-vrchat-2374"},{"id":2112925383,"title":"Loan Processor","company":"Backflip","image":"https://media.licdn.com/dms/image/D560BAQH1_SFy5Vwlhg/company-logo_200_200/0/1686838667749?e=2147483647&v=beta&t=vjEnSv9MgRj3-PLOfPnBySXxJkFKZF1SkMxzVFcxr8c","description":"<div><b style=\"font-size: 11pt;\">Join a fast growing start up changing the real estate investing industry!</b></div><div><br></div><div><a rel=\"noopener noreferrer\" class=\"postings-link\" style=\"font-size: 11pt;\" href=\"https://dobackflip.com/\">Backflip</a><span style=\"font-size: 11pt;\"> is a venture-backed </span><b style=\"font-size: 11pt;\">FinTech</b><span style=\"font-size: 11pt;\"> company that </span><b style=\"font-size: 11pt;\">empowers anyone to improve their life and their neighborhood through real estate investing</b><span style=\"font-size: 11pt;\">. To do that, we need people who are inspired to reimagine and rebuild an outdated and unbalanced system; to support and celebrate America’s local entrepreneurs. </span><a rel=\"noopener noreferrer\" class=\"postings-link\" style=\"font-size: 11pt;\" href=\"https://backflip.app.link/hdYmZF9JwLb\">Check out the Backflip app here to experience first hand how we're making a difference through our technology</a><span style=\"font-size: 11pt;\">.</span></div><div><br></div><div><span style=\"font-size: 11pt;\">Backflip is seeking a </span><i><b style=\"font-size: 11pt;\">Loan Processor</b></i><span style=\"font-size: 11pt;\"> to execute the lending process from term sheet through final review completion. Backflip originates real estate investment loans (not consumer loans). As an early addition to this team, this individual will play a critical role in ensuring Backflip has a best-in-class processing operation that is borrower-friendly, detail oriented, operationally efficient, organized and designed to scale.</span></div><div><br></div><div><span style=\"font-size: 11pt;\">This position is remote (U.S.) and a rare opportunity to get in on the ground floor (~75 person team) working directly with senior leaders in a well-capitalized startup with a great culture (</span><a rel=\"noopener noreferrer\" class=\"postings-link\" style=\"font-size: 11pt;\" href=\"https://techcrunch.com/2024/04/29/backflip-raises-15-million-to-help-real-estate-investors-flip-houses/?guccounter=1&amp;guce_referrer=aHR0cHM6Ly93d3cuZ29vZ2xlLmNvbS8&amp;guce_referrer_sig=AQAAABk3K7EzQ-RsoX2uq_YCeKN3dCJPqN1FsdwJFbmB30YwsTXb2qogu-d0mtoA_sfc9ZWtyzGW04VxvOa9iDbHgMqyiLHq5hahjz5Ym4hQ6WtWy-OfMFEBck0bSanRkxZg89Eme5WfG-lXEOjuecZ1mCfDE9DCAFFL8feoIKJ8RlsQ\">Check out our recently announced $15M Series A</a><span style=\"font-size: 11pt;\">).</span></div><div><b style=\"font-size: 11pt;\">Join a fast growing start up changing the real estate investing industry!</b></div><div><br></div><div><a href=\"https://dobackflip.com/\" style=\"font-size: 11pt;\" class=\"postings-link\" target=\"_blank\" rel=\"noopener noreferrer\">Backflip</a><span style=\"font-size: 11pt;\"> is a venture-backed </span><b style=\"font-size: 11pt;\">FinTech</b><span style=\"font-size: 11pt;\"> company that </span><b style=\"font-size: 11pt;\">empowers anyone to improve their life and their neighborhood through real estate investing</b><span style=\"font-size: 11pt;\">. To do that, we need people who are inspired to reimagine and rebuild an outdated and unbalanced system; to support and celebrate America’s local entrepreneurs. </span><a href=\"https://backflip.app.link/hdYmZF9JwLb\" style=\"font-size: 11pt;\" class=\"postings-link\" target=\"_blank\" rel=\"noopener noreferrer\">Check out the Backflip app here to experience first hand how we're making a difference through our technology</a><span style=\"font-size: 11pt;\">.</span></div><div><br></div><div><span style=\"font-size: 11pt;\">Backflip is seeking a </span><i><b style=\"font-size: 11pt;\">Loan Processor</b></i><span style=\"font-size: 11pt;\"> to execute the lending process from term sheet through final review completion. Backflip originates real estate investment loans (not consumer loans). As an early addition to this team, this individual will play a critical role in ensuring Backflip has a best-in-class processing operation that is borrower-friendly, detail oriented, operationally efficient, organized and designed to scale.</span></div><div><br></div><div><span style=\"font-size: 11pt;\">This position is remote (U.S.) and a rare opportunity to get in on the ground floor (~75 person team) working directly with senior leaders in a well-capitalized startup with a great culture (</span><a href=\"https://techcrunch.com/2024/04/29/backflip-raises-15-million-to-help-real-estate-investors-flip-houses/?guccounter=1&amp;guce_referrer=aHR0cHM6Ly93d3cuZ29vZ2xlLmNvbS8&amp;guce_referrer_sig=AQAAABk3K7EzQ-RsoX2uq_YCeKN3dCJPqN1FsdwJFbmB30YwsTXb2qogu-d0mtoA_sfc9ZWtyzGW04VxvOa9iDbHgMqyiLHq5hahjz5Ym4hQ6WtWy-OfMFEBck0bSanRkxZg89Eme5WfG-lXEOjuecZ1mCfDE9DCAFFL8feoIKJ8RlsQ\" style=\"font-size: 11pt;\" class=\"postings-link\" target=\"_blank\" rel=\"noopener noreferrer\">Check out our recently announced $15M Series A</a><span style=\"font-size: 11pt;\">).</span></div><h3>What You’ll Do:</h3><li>Process mortgage loan originations for residential investment properties in compliance with Backflip’s Credit Policy</li><li>Manage third parties to collect and verify documents + complete pre-closing requirements (title companies, appraisers, etc.)</li><li>Ensure an exceptional Member Experience by providing proactive communication on the status of their loan and timely responses to questions during loan processing</li><li>Communicate effectively across the teams involved in the funnel (sales, underwriting, closing, post-closing)</li><li>Review and analyze documents against Backflip’s Credit Policy; flag and mitigate discrepancies</li><li>Help Backflip’s Capital Markets team clear conditions and sell loans to third party investors</li><li>Contribute to the further implementations of standard operating procedures designed to scale operations in harmony with other departments</li><li>Enliven the company culture to ensure we deliver on our mission to the members and our peers</li><li>Other duties as assigned, including cross-departmental projects and initiatives</li><h3>Qualifications:</h3><li>3+ years of experience in mortgage loan processing, including coordinating with 3rd parties (title companies, appraisers, etc.)</li><li>1+ year of remote work experience in&nbsp;a customer facing role and the ability to offer an elevated customer experience</li><li>Prior experience in a FinTech or PropTech environment a plus</li><li>Prior closing experience is a plus</li><li>Experience with short-term bridge loans or construction loans is a plus</li><li>Interest in real estate investing and excited about understanding our member’s investment journey</li><li>General understanding of basic real estate investment concepts (or demonstrated desire to learn); comfortable performing basic math calculations</li><li>Exemplary computer skills - demonstrated ability and desire to learn new technologies (we use Slack + Notion + Google Workspace + Front + HubSpot + more)</li><li>Basic spreadsheet skills (Excel; Google Sheets)</li><h3>This candidate will champion Backflip’s culture & Core Values:</h3><li><b>Raise</b> the standard of what is possible</li><li><b>Embrace</b> being the novice to become the master</li><li><b>Work</b> only with those who want the best for us</li><li><b>Communicate</b> quickly, naturally and with radical candor</li><li><b>Test</b> new things to invent and challenge the status quo</li><li>Today, nay <b>now</b>!</li><div><i>Compensation for this role includes a $70,000 annual salary with a $115 per loan processed monthly productivity bonus, and is based on a variety of factors including prior experience, geographic location, stock option grant, and other factors, and may fall outside of the stated range for certain candidates. In addition to a competitive market salary, Backflip employees receive equity stock options, paid health care, and a 401K + company match, among other industry-leading benefits.</i></div><div><br></div><div><i>All Backflip positions are Remote. Like the people we serve, we believe being free to create wherever you’re most inspired is one of life’s greatest joys. It’s better for individuals, for community, and for fostering great work to emerge. With our work-from-anywhere approach, Backflip brings together a diverse team of individuals, with passions for innovation, art, coding, AI, data, finance, film, real estate, the environment, learning and teaching. Together, we're moving fast.</i></div><div><br></div><div><i>Backflip is an equal opportunity employer. We know that building a world-class organization is not possible without an intentional focus on recruiting, empowering, promoting and rewarding the best and brightest people of all backgrounds. Backflip focuses on hiring individuals that align with its Core Values (listed above), and consistently display a high ethical standard, both personally and professionally.</i></div><div><br></div><div><i>This role is not eligible for visa sponsorship.</i></div>","tags":"[\"Finance\"]","pubDate":"2024-11-25 16:54:26.334","link":"https://jobs.lever.co/backflip/98413ece-06ab-4941-bd42-558a6aeb02ea","savedDate":"2024-11-26 15:12:07.271","slug":"loan-processor-backflip-2302"},{"id":4356890057,"title":"Lead VFX Artist","company":"Buildarocketboy","image":"https://remotive.com/job/1950985/logo","description":"<div><!--block-->As our new Lead VFX Artist, you will be responsible for overseeing the performance and output of a talented team of visual effects artists, guiding them to create visually stunning and technically proficient effects that align with the artistic vision and gameplay mechanics of our AAA projects. You will manage the VFX team, delegate tasks efficiently, and ensure that all VFX work is delivered on time and to the highest quality standard. You will also be hands-on, providing mentorship and actively contributing to the VFX pipeline when necessary.<br><br></div><br><br><div class=\"h3\">Key Responsibilities</div><div><!--block--><strong>Key Responsibilities:</strong></div><ul style=\"\"><li style=\"\"><!--block-->Lead and manage the VFX team, ensuring high-quality work output and timely delivery of assets. Ensuring that all visual effects align with the project’s artistic vision and technical requirements.</li><li style=\"\"><!--block-->Cascade direction from upper management across the team, ensuring alignment with studio and project goals.</li><li style=\"\"><!--block-->Mentor, provide feedback, and create career development opportunities for team members, fostering an environment of growth and collaboration.</li><li style=\"\"><!--block-->Effectively delegate tasks based on team members' strengths, ensuring optimal performance.</li><li style=\"\"><!--block-->Oversee the creation of complex, multi-disciplinary visual effects features, from concept to implementation.</li><li style=\"\"><!--block-->Provide high-level artistic feedback to the team and maintain consistency in the quality of all visual effects.</li><li style=\"\"><!--block-->Hands-on involvement with the creation of high-quality VFX assets as needed.</li><li style=\"\"><!--block-->Integrate new tools and technologies into the VFX pipeline, with a focus on improving quality and efficiency.</li><li style=\"\"><!--block-->Ensure all VFX assets are optimized for performance, particularly for Unreal Engine 5 (Niagara/Blueprint).</li><li style=\"\"><!--block-->Troubleshoot and resolve any technical issues related to the art production pipeline, optimizing workflows for maximum efficiency.</li><li style=\"\"><!--block-->Serve as a key liaison between the VFX team and other relevant departments, such as design, engineering, and production, ensuring smooth collaboration and alignment on project goals.</li><li style=\"\"><!--block-->Communicate risks, mitigations, and updates clearly and diplomatically, maintaining strong working relationships across the studio.</li><li style=\"\"><!--block-->Oversee and ensure outsourced VFX components are aligned with the studio’s quality standards and integrated seamlessly into the project.</li></ul><br><br><div class=\"h3\">Requirements</div><div><!--block--><strong>Artistic and Technical Expertise:</strong></div><ul style=\"\"><li style=\"\"><!--block-->Prior experience working on a major AAA game title.</li><li style=\"\"><!--block-->Extensive experience in creating real-time visual effects for AAA games.</li><li style=\"\"><!--block-->Mastery of industry-standard software including Houdini, Maya/Max, Photoshop/Substance, Embergen, and Unreal Engine 5 (Niagara/Blueprint).</li><li style=\"\"><!--block-->Proven ability to deliver visually stunning and technically proficient VFX that enhance the gameplay experience.</li><li style=\"\"><!--block-->Experience with VFX pipeline automation.</li></ul><div><!--block--> <br><strong>Leadership Skills:</strong></div><ul style=\"\"><li style=\"\"><!--block--> Previous experience leading and managing a team of VFX artists.</li><li style=\"\"><!--block--> Strong organizational and delegation skills, with the ability to balance both operational responsibilities and management tasks.</li><li style=\"\"><!--block--> Demonstrated ability to lead a team through complex, multi-disciplinary features from start to finish, ensuring successful delivery. </li><li style=\"\"><!--block-->Familiarity with outsourcing workflows and managing external teams.</li></ul><div><!--block--><strong>Communication &amp; Collaboration: </strong></div><ul style=\"\"><li style=\"\"><!--block-->Excellent communication skills, both written and verbal, with the ability to work effectively with multiple departments and teams.</li><li style=\"\"><!--block--> Active listening skills, enabling you to understand the needs and concerns of your team and address them effectively.</li><li style=\"\"><!--block--> Ability to diplomatically address feedback, risks, and concerns, while maintaining a solution-oriented approach.</li></ul><br><br><div class=\"h3\">Benefits</div><div><!--block--><strong>Our Global Benefits &amp; Perks</strong></div><ul style=\"\"><li style=\"\"><!--block--><strong>Unlimited coaching &amp; therapy</strong> — with Oliva, to support your mental health</li><li style=\"\"><!--block--><strong>Stock Options</strong> — everyone owns a piece of our success</li><li style=\"\"><!--block--><strong>Pension scheme</strong> — up to 5% employer matched contribution to finance those golden years</li><li style=\"\"><!--block--><strong>Socials </strong>—<strong> </strong>office &amp; remote events, play sessions and company-wide parties</li><li style=\"\"><!--block--><strong>And even more benefits based on your location!</strong></li></ul><div><!--block--><br></div><div><!--block--><strong>If you’re based in the UK</strong></div><ul style=\"\"><li style=\"\"><!--block--><strong>25 Annual Leave + 3 bank holidays</strong> - we’re flexible with most bank holidays so you can use the time to celebrate what’s important to you</li><li style=\"\"><!--block--><strong>Private Medical Insuranc</strong>e - full cover with AXA</li><li style=\"\"><!--block--><strong>Healthcare Cash Plan</strong> - Level 3 cover with Medicash</li><li style=\"\"><!--block--><strong>Cycle2Work</strong> <strong>Scheme</strong> - lease a bike through us and save on tax too!</li><li style=\"\"><!--block--><strong>Electric Car Charging</strong> - electric car charging at our Port office in Edinburgh, Scotland.</li></ul><img src=\"https://remotive.com/job/track/1950985/blank.gif?source=public_api\" alt=\"\"/>","tags":"[\"photoshop\",\"automation\",\"healthcare\",\"mental health\"]","pubDate":"2024-11-24 13:20:30.000","link":"https://remotive.com/remote-jobs/design/lead-vfx-artist-1950985","savedDate":"2024-11-26 15:12:07.251","slug":"lead-vfx-artist-buildarocketboy-7805"},{"id":3078705506,"title":"Lead Game Designer - Hole.io","company":"voodoo","image":"https://remotive.com/job/1951249/logo","description":"<div><span style=\"\">Founded in 2013, Voodoo is a tech company that creates mobile games and apps with a mission to entertain the world. Gathering 800 employees, 7 billion downloads, and over 200 million active users, Voodoo is the #3 mobile publisher worldwide in terms of downloads after Google and Meta. Our portfolio includes chart-topping games like Mob Control and Block Jam, alongside popular apps such as BeReal and Wizz.</span></div>\n<div> </div>\n<div>Fully remote is accepted globally.</div>\n<div> </div>\n<div><strong>Team</strong></div>\n<div> </div>\n<div>Our Gaming team is made up of hybrid-casual, casual and mid-core experts. Our 'Core' games team supports internal and external studios worldwide in creating, developing and launching new hit games, whilst our 'Live' games team focuses on delivering higher engagement on our existing and successful games.</div>\n<div> </div>\n<div>Voodoo is creating a new Casual Studio with a big mission: find the next best way to entertain the world by taking our best hits to a new level. You will join a team that is growing but still small, composed of veterans from the industry, where you will participate in every aspect of development, from ideation to testing the casual games in the market.</div>\n<div> </div>\n<div>The Studio is working on Hole.io, one of our most promising games.</div>\n<div> </div>\n<p><br><br></p>\n<div class=\"h3\">Role</div>\n<ul style=\"\">\n<li style=\"\">Design and optimize meta gameplay features, such as progression systems, time-limited events, new game modes, quests, or player-driven goals, ensuring they contribute to monetization and player engagement.</li>\n<li style=\"\">Continuously analyze in-game data to identify opportunities for optimizing and growing game economies.</li>\n<li style=\"\">Create and maintain models of in-game economies, considering player progression, currency flow, and reward systems.</li>\n<li style=\"\">Deliver designs of A/B tests to experiment with different economic models and features, analyzing results to implement the most effective solutions; Monitor test performance and iterate on strategies based on data-driven insights.</li>\n<li style=\"\">Drive close collaboration with other Game Designers, Developers, Artists and Analysts to align feature strategies with game design goals and clear KPIs that prove success;Ensure that game economy models are scalable and adaptable to new game features or changes in player behavior.</li>\n<li style=\"\">Regularly present findings and recommendations to stakeholders, including the General Manager and Game Designers, to drive informed decision-making</li>\n<li style=\"\">Stay up-to-date with industry trends and competitor strategies in midcore games to identify opportunities for innovation and differentiation.</li>\n<li style=\"\">Apply industry best practices and learnings to enhance game monetization and player experiences.</li>\n</ul>\n<p><br><br></p>\n<div class=\"h3\">Profile</div>\n<ul style=\"\">\n<li style=\"\">4+ years of experience as a Game Designer, ideally on a Puzzle or Match-3 game.</li>\n<li style=\"\">Track record of working with games that achieve long-term player engagement and retention.</li>\n<li style=\"\">Demonstrated experience in defining and maintaining Live Ops strategies to drive sustained engagement and monetization.</li>\n<li style=\"\">Experience working on F2P Match3 or Puzzle mobile games creating economy and monetization loops, and maintaining their balancing.</li>\n<li style=\"\">Demonstrated success in leading multidisciplinary teams to achieve design excellence and deliver engaging player experiences</li>\n<li style=\"\">Clear communication skills in English, both written and verbal; Clear and concise.</li>\n<li style=\"\">Entrepreneurial mindset essential</li>\n</ul>\n<p><br><br></p>\n<div class=\"h3\">Benefits</div>\n<ul style=\"\">\n<li style=\"\">Best-in-class compensation</li>\n<li style=\"\">Other benefits according to the country you reside</li>\n</ul>\n<img src=\"https://remotive.com/job/track/1951249/blank.gif?source=public_api\" alt=\"\"/>","tags":"[\"game design\"]","pubDate":"2024-11-24 03:21:04.000","link":"https://remotive.com/remote-jobs/design/lead-game-designer-hole-io-1951249","savedDate":"2024-11-26 15:12:07.252","slug":"lead-game-designer-hole-io-voodoo-6884"},{"id":1771170457,"title":"Senior Paid Search Specialist, User Experience","company":"Airalo","image":"https://lever-client-logos.s3.us-west-2.amazonaws.com/55028a36-609c-479c-9553-d4689ff2dd8c-1669620566663.png","description":"<div><b>About Airalo</b></div><div>Alo! Airalo is the world’s first eSIM store that helps people connect in over 200+ countries and regions across the globe. We are building the next digital service that revolutionizes the telecom industry. We are a travel-tech company and an equal-opportunity environment that values and executes diversity, inclusion, and equity. Our team is spread across 50+ countries and six continents. What glues us together is our commitment to changing the way you connect<span style=\"font-size: 13.3333px\">. </span></div><div><br></div><div><b>About you</b></div><div>We hope that you care deeply about the quality of your work, the intrinsic worth of tasks, and the success of your team. You are self-disciplined and do not require micromanagement in terms of your skillset and work ethic. You do your best to flourish as an individual every day while working hard to foster a collaborative team environment. You believe in the importance of being — and staying — authentic, honest, positive, and kind. You are a good interlocutor with clear and concise communication. You are able to manage multiple projects, have an analytical mind, pay keen attention to detail, and love to get your hands dirty. You are cognizant, tolerant, and welcoming of vulnerabilities and cultural differences.</div><div><br></div><div><b>About the Role</b></div><div><b>Position</b>: Full-time / Employee</div><div><b>Location:</b>&nbsp;Remote-first </div><div><b>Benefits:</b>&nbsp;Health Insurance, work-from-anywhere stipend, annual wellness &amp; learning credits, annual all-expenses-paid company retreat in a gorgeous destination &amp; other benefits</div><h3>Responsibilities include but are not limited to:</h3><li>Developing and executing mobile app and web acquisition campaigns across various search marketing channels.</li><li>Continuously supporting regions in testing and experimenting on acquisition campaigns to drive cost-effective user growth, meeting KPIs such as CAC, ROAS, CPS, CPP, LTV, AOV, and payback periods.</li><li>Owning the data and reporting infrastructure, analyzing user acquisition and engagement data to inform strategy, and being the go-to resource for data-related queries.</li><li>Collaborating cross-functionally with product, engineering, and brand teams to identify levers for improvement and opportunities to enhance ROI.</li><li>Conducting market and competitor research to identify innovation opportunities supporting growth targets.</li><li>Staying up-to-date with industry trends, especially in travel, and best practices in mobile app acquisition.</li>,<h3>Must-haves:</h3><li>7+ years of experience managing mobile app acquisition campaigns at scale in performance-driven, competitive verticals, with deep MarTech/MarOps experience.</li><li>Deep hands-on expertise in Search channels (Google Search, Display, Video, Discovery, Performance Max, etc.).</li><li>Strong analytical skills and MarTech expertise across various analytics and MMP tools (e.g., Google Analytics, Google Tag Manager, Looker, AppsFlyer, Adjust, etc.).</li><li>Experience in the digital advertising and mobile space, managing $MM annual ad budgets and maximizing ROI across channel mixes.</li><li>Fluency in English with impeccable verbal and written communication skills.</li><li>Superior internal and external communication and cross-functional stakeholder management skills.</li><li>Good time management with an eye for perfection and a strong operational background.</li>,<h3>Good to have:</h3><li>Prior experience in the tech, travel, or telecommunications industry.</li><li>Ad platform and analytical platform certifications.</li><li>Working knowledge of other search platforms like Bing, Naver, etc. is a plus.</li><li>Knowledge of eSIM and GSMA-related technologies and services.</li><li>Proficient in optimizing advertising campaigns through AI-powered platforms like Google Ads or Facebook Ads Manager, utilizing automated bidding strategies, audience targeting, and performance analysis</li><div>We sincerely thank all applicants in advance for submitting their interest in this opportunity. Airalo is an equal opportunity employer and values diversity, equity &amp; inclusion. We do not discriminate on the basis of race, religion, national origin, gender, sexual orientation, age, marital status, veteran status, or disability status. We are committed to providing reasonable accommodations upon request for individuals with disabilities throughout our job interview process.</div>","tags":"[\"management\",\"engineering\"]","pubDate":"2024-11-22 19:29:34.319","link":"https://jobs.lever.co/airalo/31685623-e995-432a-825c-0af16ffe2b12","savedDate":"2024-11-26 15:12:07.268","slug":"senior-paid-search-specialist-user-experience-airalo-2450"},{"id":4572795219,"title":"Junior Accountant (Fully Remote)","company":"CoverGo","image":"https://pbs.twimg.com/profile_images/1382655628523364355/MWPIbbID_400x400.jpg","description":"<p><strong>Top 3 Reasons To Join Us </strong></p><ul> <li>Competitive Salary</li> <li>100% Remote</li> <li>Working on the latest tech for the Insurtech Market Leader</li> </ul><p><strong>About Us</strong></p><p>At CoverGo, our mission is to empower all insurance companies to make insurance 100% digital and accessible to everyone.</p><ul> <li>We are a leading global no-code insurance platform for health, life, and P&amp;C</li> <li>We’re the winner of the Insurtech of the Year in all of Asia and other awards globally</li> <li>We work with insurance enterprise clients such as AXA, Bupa, MSIG, Dai-ichi, Bank of China Group Insurance, and many more</li> <li>We're an international, diverse team of over 120 people with 30 nationalities and team members working remotely from all over the world</li> <li>We are fully funded and backed by reputable VC funds and strategic institutional investors</li> <li>We have a global presence in Asia, EMEA and the Americas</li> <li>We’ve grown our annualized revenue by over 30x since January 2021</li> <li>We’re constantly working towards making CoverGo a workplace that you love coming to. We deeply believe that bringing together a diversity of thoughts, expressions, and perspectives is key to building the best culture for equally diverse communities all over the world</li> </ul><p><strong>What you will do:</strong></p><ul> <li>Responsible for managing daily accounting operations in Xero for multiple entities, maintaining accurate and up-to-date records</li> <li>Responsible for payroll processing including ensuring compliance with tax regulations and coordinating with relevant parties as needed</li> <li>Responsible for AP function including handling communications and keeping all related records and documentations up to date</li> <li>Manage inter-company reconciliations</li> <li>Assist with the preparation of the budget and financial analysis and reporting</li> <li>Provide support in closing processes to ensure timely and accurate financial reporting</li> <li>Undertake ad hoc assignments, manage projects and execute operational duties as required, ensuring support across various functions</li> </ul><p><strong>What we are looking for:</strong></p><ul> <li>Degree holder in Accounting, Finance, and related discipline</li> <li>CPA, ACCA or similar</li> <li>Minimum of 2 years of accounting experience, preferably in General Ledger functions</li> <li>Hands on experience with Xero accounting software</li> <li>Strong problem-solving and analytical skills</li> <li>Experience working in an international business environment with strong cross-cultural communication skills</li> <li>Proficient in Microsoft Office and aptitude with different IT solutions</li> <li>Capable of working independently and efficiently under pressure in a fast-paced environment, ensuring accuracy and meeting deadlines</li> <li>Meticulous, well-organized and proactive with a strong sense of accountability</li> <li>Self-motivated and dedicated, consistently with a positive and results-oriented attitude</li> <li>Resourceful and adaptable, with willingness to take initiative and continuously develop skills</li> <li>Good command of English is a must, knowing other languages would be an advantage</li> </ul><p><strong>Why You'll Love Working Here</strong></p><ul> <li>Fully Remote</li> <li>Flexible Leave</li> <li>International Environment</li> <li>Competitive renumeration package</li> <li>Performance Bonus</li> <li>Company activities and events</li> <li>Learning and development plan</li> </ul><p><strong>CoverGo Company </strong><a href=\"https://www.youtube.com/watch?v=YI0ezLxvFvA\" rel=\"nofollow noreferrer noopener\" class=\"external\"><strong>Video</strong></a></p><p>By submitting your application, you confirm that you have read, understood, and accepted the content of CoverGo’s <a href=\"https://apply.workable.com/covergo/gdpr_policy?lng=en\" target=\"_blank\" rel=\"nofollow noreferrer noopener\" class=\"external\">Privacy Notice</a> and you consent to the processing of your data as part of this application.</p><h3>Requirements: </h3><h3>Benefits: </h3>","tags":"[\"Finance\"]","pubDate":"2024-11-22 00:00:00.000","link":"https://apply.workable.com/covergo/j/7575891874","savedDate":"2024-11-26 15:12:07.256","slug":"junior-accountant-fully-remote-covergo-4184"},{"id":6167377173,"title":"Accountant (Fully Remote)","company":"CoverGo","image":"https://pbs.twimg.com/profile_images/1382655628523364355/MWPIbbID_400x400.jpg","description":"<p><strong>Top 3 Reasons To Join Us </strong></p><ul> <li>Competitive Salary</li> <li>100% Remote</li> <li>Working on the latest tech for the Insurtech Market Leader</li> </ul><p><strong>About Us</strong></p><p>At CoverGo, our mission is to empower all insurance companies to make insurance 100% digital and accessible to everyone.</p><ul> <li>We are a leading global no-code insurance platform for health, life, and P&amp;C</li> <li>We’re the winner of the Insurtech of the Year in all of Asia and other awards globally</li> <li>We work with insurance enterprise clients such as AXA, Bupa, MSIG, Dai-ichi, Bank of China Group Insurance, and many more</li> <li>We're an international, diverse team of over 120 people with 30 nationalities and team members working remotely from all over the world</li> <li>We are fully funded and backed by reputable VC funds and strategic institutional investors</li> <li>We have a global presence in Asia, EMEA and the Americas</li> <li>We’ve grown our annualized revenue by over 30x since January 2021</li> <li>We’re constantly working towards making CoverGo a workplace that you love coming to. We deeply believe that bringing together a diversity of thoughts, expressions, and perspectives is key to building the best culture for equally diverse communities all over the world</li> </ul><p><strong>What you will do:</strong></p><ul> <li>Responsible for managing daily accounting operations in Xero for multiple entities, maintaining accurate and up-to-date records</li> <li>Responsible for payroll processing including ensuring compliance with tax regulations and coordinating with relevant parties as needed</li> <li>Responsible for AP function including handling communications and keeping all related records and documentations up to date</li> <li>Manage inter-company reconciliations</li> <li>Assist with the preparation of the budget and financial analysis and reporting</li> <li>Provide support in closing processes to ensure timely and accurate financial reporting</li> <li>Undertake ad hoc assignments, manage projects and execute operational duties as required, ensuring support across various functions</li> </ul><p><strong>What we are looking for:</strong></p><ul> <li>Degree holder in Accounting, Finance, and related discipline</li> <li>CPA, ACCA or similar</li> <li>Minimum of 3 years of accounting experience, preferably in General Ledger functions</li> <li>Hands on experience with Xero accounting software</li> <li>Strong problem-solving and analytical skills</li> <li>Experience working in an international business environment with strong cross-cultural communication skills</li> <li>Proficient in Microsoft Office and aptitude with different IT solutions</li> <li>Capable of working independently and efficiently under pressure in a fast-paced environment, ensuring accuracy and meeting deadlines</li> <li>Meticulous, well-organized and proactive with a strong sense of accountability</li> <li>Self-motivated and dedicated, consistently with a positive and results-oriented attitude</li> <li>Resourceful and adaptable, with willingness to take initiative and continuously develop skills</li> <li>Good command of English is a must, knowing other languages would be an advantage</li> </ul><p><strong>Why You'll Love Working Here</strong></p><ul> <li>Fully Remote</li> <li>Flexible Leave</li> <li>International Environment</li> <li>Competitive renumeration package</li> <li>Performance Bonus</li> <li>Company activities and events</li> <li>Learning and development plan</li> </ul><p><strong>CoverGo Company </strong><a href=\"https://www.youtube.com/watch?v=YI0ezLxvFvA\" rel=\"nofollow noreferrer noopener\" class=\"external\"><strong>Video</strong></a></p><p>By submitting your application, you confirm that you have read, understood, and accepted the content of CoverGo’s <a href=\"https://apply.workable.com/covergo/gdpr_policy?lng=en\" target=\"_blank\" rel=\"nofollow noreferrer noopener\" class=\"external\">Privacy Notice</a> and you consent to the processing of your data as part of this application.</p><h3>Requirements: </h3><h3>Benefits: </h3>","tags":"[\"Finance\"]","pubDate":"2024-11-22 00:00:00.000","link":"https://apply.workable.com/covergo/j/4C6E48B652","savedDate":"2024-11-26 15:12:07.256","slug":"accountant-fully-remote-covergo-6164"},{"id":4187739258,"title":"DevSecOps Engineer","company":"VRChat","image":"https://pbs.twimg.com/profile_images/1719900921793003520/qPc3pV09_400x400.jpg","description":"<div><span style=\"font-size: 24px;\">Join the VRChat Team!</span></div><div><br></div><div><span style=\"font-size: 11pt;\">VRChat offers a first-of-its-kind, game-changing platform that provides an endless collection of social VR experiences and gives the power of creation to its robust community. With over 250,000 worlds and growing, VRChat’s vision is to allow users to bring their imaginations to life and help shape the metaverse anywhere in the world on any device. VRChat has raised $100M to date with the support of investors Makers Fund, Anthos Capital and HTC.&nbsp;</span></div><div><br></div><div><span style=\"font-size: 11pt;\">We have a great team which includes people from: Netflix, Twitter, Meta, Microsoft, Roblox, Google, Amazon, Unity, Spotify, Discord, Uber, eBay, Robinhood, Twitch, Zynga and TikTok.</span></div><div><span style=\"font-size: 11pt;\">Come and join the mission!</span></div><div><br></div><div><span style=\"font-size: 24px;\">Job Overview</span></div><div><br></div><div><span style=\"font-size: 11pt;\">We are looking for a DevOps Engineer with security experience to join our passionate DevOps team ensuring the smooth operation and security of the VRChat infrastructure. In this role you’ll be accountable for the uptime, security, proper operation and cost effectiveness of our infrastructure supporting millions of active users and petabytes of UGC content.</span></div><div><br></div><div><span style=\"font-size: 11pt;\">Help us run and secure our platform that allows our users to connect and create their part of the VRChat universe. If you’re interested in keeping the machinery behind the scenes humming and finely tuned, then this role could be right up your alley.</span></div><div><br></div><div><span style=\"font-size: 11pt;\">The role reports to the VP of Engineering at VRChat. This Engineer will work closely with the IT and Development teams, as well as the heads of various functions to plan and deploy infrastructure.</span></div><div><br></div><h3>Duties & Responsibilities</h3><li>Day to day operation and maintenance of our infrastructure to keep our services running with high reliability, security and cost effectiveness</li><li>Incident management and root cause analysis, sometimes during off hours</li><li>Ensure the implementation and maintenance of robust security controls and practices</li><li>Design, plan and implementation of IT infrastructure in a hybrid cloud environment to support the evolution of our platform</li><li>Automate and improve our monitoring systems and tools</li><li>Coordination and communication within the team and with internal stakeholders</li><li>Work with external vendors to resolve issues and coordinate projects</li>,<h3>Experience, Skills & Qualifications</h3><li>Proven experience (8+ years) in a DevOps role, within a high-growth consumer-facing company, preferably in a fast-paced startup environment</li><li>Experience with hybrid cloud environments and infrastructure as code tools such as Terraform and OpenTofu</li><li>Experience with highly reliable networking and tools such as Wireguard and Tailscale</li><li>Experience with content delivery &amp; CDNs</li><li>Knowledge of setup, configuration and operation of data stores such as MongoDB &amp; Redis</li><li>Experience participating in proactive system hardening, engaging in technical security audits, and threat-hunting across multiple interconnected systems</li><li>Experience in rapidly responding to and mitigating operational &amp; security incidents, including coordinating with internal security, legal, and public relations teams</li><li>Strong knowledge of web application, API security and scripting knowledge, including <a href=\"http://Node.js\">Node.js</a> &amp; Golang</li><li>Experience with realtime multiplayer game engines, Photon or other real-time networking, MMORPG or C# application security is desirable.</li><li>Familiarity with common Cybersecurity and Information Technology frameworks and standards such as MITRE ATT&amp;CK, COBIT, and ITIL.&nbsp;</li><li>Knowledge of ISO27001/27002, SOC2, IG2 certifications and standards</li><li>Preferably expertise in building security infrastructure that conforms to FTC guidance and international privacy laws such as the GDPR</li><li>Exceptional communication skills with the ability to articulate and evangelize concepts to technical and non-technical stakeholders</li>,<h3>Benefits </h3><li>Work from anywhere! VRChat is a 100% remote company</li><li>Health Benefits</li><li>401K for US &amp; RRSP for Canadian Employees</li><li>Stock Options</li><li>Generous paid holiday schedule</li><li>Unlimited/Flexible vacation time</li><li>Paid parental leave benefits</li><div><span style=\"font-size: 10px;\">VRChat is an equal-opportunity employer, and we welcome applicants from all backgrounds. VRChat fosters a diverse, creative, and collaborative environment where anyone can contribute to any of the ongoing projects or direction of the roadmap at any time. If you’re a passionate team player who wants to have an impact on a dynamic team, we’d love to hear from you! </span></div>","tags":"[\"management\",\"engineering\",\"legal\",\"mongo\",\"aws\"]","pubDate":"2024-11-21 18:27:11.112","link":"https://jobs.lever.co/vrchat/206c4546-964a-4821-a4cb-fa6749270416","savedDate":"2024-11-26 15:12:07.256","slug":"devsecops-engineer-vrchat-8887"},{"id":3556379116,"title":"Senior iOS Engineer","company":"Avara","image":"https://pbs.twimg.com/profile_images/1725197105923293184/0HcwlDMy_400x400.jpg","description":"<div><b style=\"font-size: 16px\">About us: </b></div><div><br></div><div><span style=\"font-size: 16px\">Avara builds innovative products leveraging blockchain technologies. Avara's suite includes the Aave Protocol, along with the native stablecoin GHO, Lens, an open social network, and Family, a design-first mobile crypto wallet. Avara's vision is to build a people-powered internet that benefits all.</span></div><div><br></div><div><b style=\"font-size: 16px\">Our culture:</b></div><div><br></div><div><span style=\"font-size: 16px\">Having cultivated a thriving, collaborative culture, our team is kind, welcoming and passionate about what we are building. We celebrate differences and seek to develop and retain the most talented people from a diverse candidate pool from all over the world. No matter where you are based, no ghost will be left behind and we appreciate every moment we get to work and have fun together.&nbsp;</span></div><div><br></div><div><b style=\"font-size: 16px\">About the Role:</b></div><div><br></div><div><span style=\"font-size: 16px\">As a Senior iOS Engineer at Avara, you will lead the development of an SDK that enables seamless fiat-to-crypto money movement and high-converting card payments across Avara's products and partner ecosystem. Together, we will build bridges, remove toll booths, and increase financial access for billions of people.</span></div><div><b style=\"font-size: 16px\">About us: </b></div><div><br></div><div><span style=\"font-size: 16px\">Avara builds innovative products leveraging blockchain technologies. Avara's suite includes the Aave Protocol, along with the native stablecoin GHO, Lens, an open social network, and Family, a design-first mobile crypto wallet. Avara's vision is to build a people-powered internet that benefits all.</span></div><div><br></div><div><b style=\"font-size: 16px\">Our culture:</b></div><div><br></div><div><span style=\"font-size: 16px\">Having cultivated a thriving, collaborative culture, our team is kind, welcoming and passionate about what we are building. We celebrate differences and seek to develop and retain the most talented people from a diverse candidate pool from all over the world. No matter where you are based, no ghost will be left behind and we appreciate every moment we get to work and have fun together.&nbsp;</span></div><div><br></div><div><b style=\"font-size: 16px\">About the Role:</b></div><div><br></div><div><span style=\"font-size: 16px\">As a Senior iOS Engineer at Avara, you will lead the development of an SDK that enables seamless fiat-to-crypto money movement and high-converting card payments across Avara's products and partner ecosystem. Together, we will build bridges, remove toll booths, and increase financial access for billions of people.</span></div><h3>How you can make an impact:</h3><li>Oversee the end-to-end process of building and supporting an iOS SDK that will be used by some of the most demanding product teams in crypto</li><li>Ask questions, uncover edge cases, and maintain our documentation</li><li>Obsess over transaction processing speed and clear communication with customers – this is how we build trust</li><li>Maintain short feedback cycles through demos</li><h3>Let's connect if:</h3><li>Minimum of 8 years in progressively more senior iOS engineering roles, with a strong preference for fintech and crypto domain experience</li><li>Drive to make decentralized finance the backbone of fintech and contribute meaningfully to its practical application in the real world</li><li>Advanced programming skills in Swift and UIKit, and a passion for developing phenomenal user experiences. TypeScript and React Native knowledge is a plus</li><li>Strong background in designing consistent and convenient APIs for client adoption</li><li>Experience building mission-critical software used by internal or external developers</li><div>Haven’t quite met all the criteria? Let’s not miss out on the chance to speak. Whilst you might not meet every single requirement, you might bring other, more exciting skills to the companies!&nbsp;&nbsp;</div><div><br></div><div><b style=\"font-size: 18px\">Equal opportunity statement:</b></div><div><br></div><div>Avara celebrates diversity and view each and every team member as a separate individual with their own unique identity. No matter your race, religion, gender, ethnicity, age, (dis)ability, sexual orientation or even the wallet you use, we welcome you at Avara.&nbsp;</div><div>&nbsp;</div><div>As an equal opportunities employer, we take accountability and believe in everyone's potential to build, create and inspire changes. With a mission to build a diverse workforce, we are proud to foster a working environment in which everyone can feel safe and valued for who they are.&nbsp;</div>","tags":"[\"typescript\",\"Finance\",\"engineering\"]","pubDate":"2024-11-21 10:39:37.146","link":"https://jobs.eu.lever.co/avara/ac8479e6-a77c-40ce-8c9d-d224055192d2","savedDate":"2024-11-26 15:12:07.269","slug":"senior-ios-engineer-avara-2715"},{"id":2591847991,"title":"Product Director","company":"Crytek","image":"https://pbs.twimg.com/profile_images/1031556251782705153/l7Ht7Yer_400x400.jpg","description":"<div><b style=\"font-size: 16px;\">Join Crytek’s Journey to Excellence</b><span style=\"font-size: 16px;\">&nbsp;</span></div><div><span style=\"font-size: 16px;\">Crytek is on a mission to become one of the top 10 AAA boutique game development studios in the world. As our Product Director, you’ll join leading the charge in creating and operating games that captivate players, build trust, and deliver outstanding player value.&nbsp;</span></div><div><br></div><div><b style=\"font-size: 16px;\">Your Mission</b><span style=\"font-size: 16px;\">&nbsp;</span></div><div><span style=\"font-size: 16px;\">As Product Director, you’ll ensure Crytek’s games are built for the right market, launched effectively, and operated as compelling live services. Collaborating with our game, dvelopment, and technical directors, you’ll drive our brand strategy, align commercial objectives, and ensure an exceptional player experience throughout a game’s lifecycle.&nbsp;</span></div><h3>Key Responsibilities</h3><li>Define and own the <b>Franchise Brand DNA</b>, ensuring all game development aligns with its vision, market position, and emotional player resonance.&nbsp;</li><li>Lead the <b>commercial product strategy</b>, balancing player value, monetization, and business goals.&nbsp;</li><li>Oversee <b>live operations</b>, from driving player engagement and retention to optimizing content updates and performance marketing.&nbsp;</li><li>Foster <b>strategic partnerships</b> with platforms and technology partners to expand Crytek’s reach and innovation.&nbsp;</li><li><b>Lead</b> and align <b>cross</b>-<b>functional teams</b>, including community management, brand, analytics, and more, to achieve commercial and creative success.&nbsp;</li>,<h3>What Success Looks Like</h3><li>A strong, market-tested <b>brand identity</b> that resonates with players.&nbsp;</li><li>Exceptional <b>player engagement</b> with high DAU/MAU, retention, and satisfaction.&nbsp;</li><li><b>Commercial success</b> through sustainable monetization and ROI achievement.&nbsp;</li><li><b>Seamless live</b>-<b>service</b> operations delivering reliable performance and regular content updates.&nbsp;</li>,<h3>Your Expertise</h3><li>Strong proven experience in <b>product management </b>of<b> live-service games </b>, live-service operations, and brand leadership in gaming.&nbsp;</li><li>Strategic thinker with a deep understanding of <b>market trends</b>, <b>player behaviours</b>, and competitive dynamics.&nbsp;</li><li>Strong leadership skills with the ability to align and inspire <b>cross-disciplinary teams</b>.&nbsp;</li><li>A player-first mindset, focused on delivering both value and trust.&nbsp;</li><div><b style=\"font-size: 16px;\">Why Join Crytek?</b><span style=\"font-size: 16px;\">&nbsp;</span></div><div><span style=\"font-size: 16px;\">At Crytek, we are driven by the mission to be one of the </span><b style=\"font-size: 16px;\">top 10 AAA boutique game development studios in the world</b><span style=\"font-size: 16px;\">. As </span><b style=\"font-size: 16px;\">Product Director</b><span style=\"font-size: 16px;\">, you will be at the heart of this mission, shaping games that deliver exceptional player experiences while achieving commercial success. Collaborating with some of the most talented teams in the industry, you’ll play a critical role in defining the future of gaming at Crytek.&nbsp;</span></div>","tags":"[\"management\"]","pubDate":"2024-11-19 10:28:35.213","link":"https://jobs.lever.co/crytek/5a00afc4-6c3b-46a0-8db7-02cd52f25d89","savedDate":"2024-11-26 15:12:07.269","slug":"product-director-crytek-4263"},{"id":4519588316,"title":"Software Engineer - Backend Python","company":"Empower","image":"https://lever-client-logos.s3.us-west-2.amazonaws.com/2e1a369c-b58f-41ac-8d86-4b0a77695e68-1687915522032.png","description":"<p style=\"min-height:1.5em\"><strong>EMPOWER OVERVIEW</strong></p><p style=\"min-height:1.5em\"><a target=\"_blank\" rel=\"noopener noreferrer nofollow\" href=\"http://empower.me\">Empower</a> is shaking up an outdated financial system by providing real opportunity for our customers: the opportunity to get the cash they need, to access fair credit, and to change their financial story. Today, we’re helping millions of people find financial security through machine learning models that evaluate creditworthiness using a more inclusive lens and mobile-first products: Cash Advance, Thrive line of credit, and Petal credit cards. Tomorrow? Creating even more financial paths for our customers (and their wallets) to succeed. </p><p style=\"min-height:1.5em\"></p><p style=\"min-height:1.5em\">This year, Empower ranked #65 on Inc. 5000’s Fastest-Growing Private Companies list — our third year in a row cracking the top 100 — and was named by Forbes as one of the 25 Next Billion-Dollar Startups for 2024. Empower was also featured by Forbes on America’s Best Startup Employers list in 2023, and our Thrive line of credit product was named by Fast Company as one of 2022’s Next Big Things in Tech.  </p><p style=\"min-height:1.5em\"></p><p style=\"min-height:1.5em\">Empower is backed by Sequoia Capital, Blisce, and Icon Ventures. Ready to grow your impact and accelerate your career? Take a look at our open roles — we can’t wait to meet you.</p><p style=\"min-height:1.5em\"></p><p style=\"min-height:1.5em\"><strong>THE EMPOWER WAY</strong></p><p style=\"min-height:1.5em\"><strong>Great Expectations</strong>: We come up with bold, audacious goals for ourselves and go all out for impact</p><p style=\"min-height:1.5em\"><strong>Owner Mindset</strong>: We give every employee latitude to act independently, make smart choices, and move the business forward</p><p style=\"min-height:1.5em\"><strong>Spirited Debate</strong>: We love skeptics and seek counter opinions to challenge our personal assumptions and expand our view</p><p style=\"min-height:1.5em\"><strong>Customer Obsession:</strong> We listen to understand, empathize, and create a memorable, rewarding experience for our community</p><p style=\"min-height:1.5em\"><strong>Inclusive Collaboration</strong>: We believe diverse teams make the best decisions, and we strive to give diverse voices a seat at the table</p><p style=\"min-height:1.5em\"><strong>No Jerks Allowed</strong>: We value our relationships and take the time to build trust and connection and communicate respectfully</p><p style=\"min-height:1.5em\"></p><p style=\"min-height:1.5em\"><strong>WHAT EMPOWER OFFERS</strong></p><p style=\"min-height:1.5em\">Competitive salary</p><p style=\"min-height:1.5em\">Generous equity package</p><p style=\"min-height:1.5em\">Full healthcare benefits</p><p style=\"min-height:1.5em\">Technology expense reimbursement</p><p style=\"min-height:1.5em\">Work from anywhere</p><p style=\"min-height:1.5em\"><strong>JOB DESCRIPTION</strong></p><p style=\"min-height:1.5em\"></p><p style=\"min-height:1.5em\">As a Python Backend Engineer, you’ll work on the engine that powers the Empower apps and business. You’ll engage with a collaborative, high powered team to develop solutions and lead product engineering on projects with a reach of millions. The solutions you’ll build will be robust, secure and easy to understand both for our users and your engineering peers. </p><p style=\"min-height:1.5em\"></p><p style=\"min-height:1.5em\">You’ll take end to end ownership of new features and product lines shaping work in early stages, building, deploying and running post deployment analysis to ensure we’re hitting our goals.</p><p style=\"min-height:1.5em\"></p><p style=\"min-height:1.5em\">Empower is a remote-first company. We drive connectivity through regular company offsites. Travel for company offsites is expected at a minimum 2 times a year.</p><h2></h2><p style=\"min-height:1.5em\"><strong>Responsibilities</strong></p><p style=\"min-height:1.5em\">- Write high-quality, well-tested server-side code that run smoothly in production and elevates the standards across the team</p><p style=\"min-height:1.5em\">- Teach across the broader engineering organization to improve best practices and influence system design</p><p style=\"min-height:1.5em\">- Lead complex projects, influence product design and make business vs technology trade-offs during all phases of the project lifecycle, consistently delivering on time</p><p style=\"min-height:1.5em\">- Help other engineers on the team increase their productivity through mentorship, coaching, and unblocking</p><p style=\"min-height:1.5em\"></p><h2>Basic Qualifications</h2><p style=\"min-height:1.5em\"></p><ul style=\"min-height:1.5em\"><li><p style=\"min-height:1.5em\">Bachelor degree or greater within Computer Science, Software Engineering or a related subject</p></li><li><p style=\"min-height:1.5em\">3+ years developing Web APIs within Python (Flask)</p></li><li><p style=\"min-height:1.5em\">Working experience with ORMs or SQL RDBMSes</p></li><li><p style=\"min-height:1.5em\">Working experience constructing and optimising RDBMS queries</p></li><li><p style=\"min-height:1.5em\">Working experience within the asynchronous programming model</p><p style=\"min-height:1.5em\"></p></li></ul><p style=\"min-height:1.5em\">At Empower, we hire for people that push themselves to understand others and seek out ways to challenge their personal assumptions. Our hope is that by fostering such an environment, we strengthen our business and relationships by putting people first. We are committed to building a diverse, inclusive, and equitable workspace where everyone (regardless of age, education, ethnicity, gender, sexual orientation, or any personal characteristics) feels like they belong. Even if your experience doesn’t exactly match up to our job description, you should feel empowered to apply regardless!</p>","tags":"[\"engineering\"]","pubDate":"2024-11-18 18:32:35.632","link":"https://jobs.ashbyhq.com/empower%20finance/bf0f74b3-41cc-4252-88ab-29bc10517c4a","savedDate":"2024-11-26 15:12:07.264","slug":"software-engineer-backend-python-empower-7675"},{"id":3806468326,"title":"Software Development Engineer in Test","company":"Empower","image":"https://lever-client-logos.s3.us-west-2.amazonaws.com/2e1a369c-b58f-41ac-8d86-4b0a77695e68-1687915522032.png","description":"<p style=\"min-height:1.5em\"><strong>EMPOWER OVERVIEW</strong></p><p style=\"min-height:1.5em\"><a target=\"_blank\" rel=\"noopener noreferrer nofollow\" href=\"http://empower.me\">Empower</a> is shaking up an outdated financial system by providing real opportunity for our customers: the opportunity to get the cash they need, to access fair credit, and to change their financial story. Today, we’re helping millions of people find financial security through machine learning models that evaluate creditworthiness using a more inclusive lens and mobile-first products: Cash Advance, Thrive line of credit, and Petal credit cards. Tomorrow? Creating even more financial paths for our customers (and their wallets) to succeed. </p><p style=\"min-height:1.5em\"></p><p style=\"min-height:1.5em\">This year, Empower ranked #65 on Inc. 5000’s Fastest-Growing Private Companies list — our third year in a row cracking the top 100 — and was named by Forbes as one of the 25 Next Billion-Dollar Startups for 2024. Empower was also featured by Forbes on America’s Best Startup Employers list in 2023, and our Thrive line of credit product was named by Fast Company as one of 2022’s Next Big Things in Tech.  </p><p style=\"min-height:1.5em\"></p><p style=\"min-height:1.5em\">Empower is backed by Sequoia Capital, Blisce, and Icon Ventures. Ready to grow your impact and accelerate your career? Take a look at our open roles — we can’t wait to meet you.</p><p style=\"min-height:1.5em\"></p><p style=\"min-height:1.5em\"><strong>THE EMPOWER WAY</strong></p><p style=\"min-height:1.5em\"><strong>Great Expectations</strong>: We come up with bold, audacious goals for ourselves and go all out for impact</p><p style=\"min-height:1.5em\"><strong>Owner Mindset</strong>: We give every employee latitude to act independently, make smart choices, and move the business forward</p><p style=\"min-height:1.5em\"><strong>Spirited Debate</strong>: We love skeptics and seek counter opinions to challenge our personal assumptions and expand our view</p><p style=\"min-height:1.5em\"><strong>Customer Obsession:</strong> We listen to understand, empathize, and create a memorable, rewarding experience for our community</p><p style=\"min-height:1.5em\"><strong>Inclusive Collaboration</strong>: We believe diverse teams make the best decisions, and we strive to give diverse voices a seat at the table</p><p style=\"min-height:1.5em\"><strong>No Jerks Allowed</strong>: We value our relationships and take the time to build trust and connection and communicate respectfully</p><p style=\"min-height:1.5em\"></p><p style=\"min-height:1.5em\"><strong>WHAT EMPOWER OFFERS</strong></p><p style=\"min-height:1.5em\">Competitive salary</p><p style=\"min-height:1.5em\">Generous equity package</p><p style=\"min-height:1.5em\">Full healthcare benefits</p><p style=\"min-height:1.5em\">Technology expense reimbursement</p><p style=\"min-height:1.5em\">Work from anywhere</p><p style=\"min-height:1.5em\"><strong>JOB DESCRIPTION</strong></p><p style=\"min-height:1.5em\">As a Software Development Engineer in Test, you’ll work to ensure only our best work makes it to our customers. You’ll engage with a collaborative, high powered team to develop and execute test plans and automation suites for projects with a reach of millions. The solutions you’ll test will ensure robustness, and integrity for our customers and business. The automation you'll create will enhance our agility as we continue to scale. You’ll take end to end ownership of new features and product lines shaping work in early stages, instrumenting our ability to test, coordinating with stakeholders for deployment to ensure we’re hitting our goals.</p><p style=\"min-height:1.5em\">Travel for company offsites is expected at a minimum 2 times a year.</p><p style=\"min-height:1.5em\"></p><p style=\"min-height:1.5em\"><strong>Key Responsibilities<br />Test Automation:</strong></p><ul style=\"min-height:1.5em\"><li><p style=\"min-height:1.5em\">Design, develop, and maintain automated test scripts and frameworks.</p></li><li><p style=\"min-height:1.5em\">Develop Test Tools to compliment manual testing where necessary. </p></li><li><p style=\"min-height:1.5em\">Integrate automated tests into the continuous integration/continuous deployment (CI/CD) pipeline.</p></li></ul><p style=\"min-height:1.5em\"><strong>Test Planning and Design</strong>:</p><ul style=\"min-height:1.5em\"><li><p style=\"min-height:1.5em\">Collaborate with developers and product managers to understand requirements and design test plans.</p></li><li><p style=\"min-height:1.5em\">Identify test scenarios and create detailed test cases.</p></li></ul><p style=\"min-height:1.5em\"><strong>Quality Assurance</strong>:</p><ul style=\"min-height:1.5em\"><li><p style=\"min-height:1.5em\">Perform manual testing when necessary to ensure comprehensive test coverage.</p></li><li><p style=\"min-height:1.5em\">Conduct performance, load, and stress testing to ensure system reliability under various conditions.</p></li></ul><p style=\"min-height:1.5em\"><strong>Defect Tracking and Management</strong>:</p><ul style=\"min-height:1.5em\"><li><p style=\"min-height:1.5em\">Identify, document, and track defects using bug tracking tools.</p></li><li><p style=\"min-height:1.5em\">Work with development teams to resolve issues and verify fixes.</p></li></ul><p style=\"min-height:1.5em\"><strong>Code Review and Development</strong>:</p><ul style=\"min-height:1.5em\"><li><p style=\"min-height:1.5em\">Participate in code reviews to ensure testability and adherence to quality standards.</p></li><li><p style=\"min-height:1.5em\">Contribute to the development of software features, focusing on testability and quality.</p></li></ul><p style=\"min-height:1.5em\"><strong>Continuous Improvement</strong>:</p><ul style=\"min-height:1.5em\"><li><p style=\"min-height:1.5em\">Analyze test results and metrics to identify areas for improvement in the testing process.</p></li><li><p style=\"min-height:1.5em\">Stay updated with the latest testing tools, techniques, and industry trends.</p></li></ul><p style=\"min-height:1.5em\"><strong>Collaboration and Communication</strong>:</p><ul style=\"min-height:1.5em\"><li><p style=\"min-height:1.5em\">Work closely with cross-functional teams, including developers, product managers, and operations, to ensure quality throughout the software development lifecycle.</p></li><li><p style=\"min-height:1.5em\">Communicate testing progress, results, and issues to stakeholders.</p></li></ul><p style=\"min-height:1.5em\"><strong>Environment Management</strong>:</p><ul style=\"min-height:1.5em\"><li><p style=\"min-height:1.5em\">Set up and maintain test environments, including test data and configurations.</p></li></ul><p style=\"min-height:1.5em\"><strong>Security Testing:</strong></p><ul style=\"min-height:1.5em\"><li><p style=\"min-height:1.5em\">Conduct security testing to identify vulnerabilities and ensure compliance with security standards.</p></li></ul><p style=\"min-height:1.5em\"></p><p style=\"min-height:1.5em\"><strong>Candidate Qualifications</strong></p><ul style=\"min-height:1.5em\"><li><p style=\"min-height:1.5em\">6+ years of expertise in Mobile and/or REST API manual testing</p></li><li><p style=\"min-height:1.5em\">5+ years of expertise in REST API automation in Python/JavaScript etc</p></li><li><p style=\"min-height:1.5em\">Intermediate or greater programming level in one or more of: Python, Bash scripting</p></li><li><p style=\"min-height:1.5em\">Knowledge of CI/CD, DevOps in cloud platforms like Azure/AWS is preferable</p></li><li><p style=\"min-height:1.5em\">Knowledge of API Performance and Load Testing is a plus.</p></li><li><p style=\"min-height:1.5em\">Experience working within an Agile Continuous Delivery team</p><p style=\"min-height:1.5em\"></p></li></ul><p style=\"min-height:1.5em\">At Empower, we hire for people that push themselves to understand others and seek out ways to challenge their personal assumptions. Our hope is that by fostering such an environment, we strengthen our business and relationships by putting people first. We are committed to building a diverse, inclusive, and equitable workspace where everyone (regardless of age, education, ethnicity, gender, sexual orientation, or any personal characteristics) feels like they belong. Even if your experience doesn’t exactly match up to our job description, you should feel empowered to apply regardless!</p>","tags":"[\"javascript\",\"management\",\"aws\"]","pubDate":"2024-11-15 23:40:42.444","link":"https://jobs.ashbyhq.com/empower%20finance/3c100f03-b686-44e3-bab5-6809cca0592e","savedDate":"2024-11-26 15:12:07.267","slug":"software-development-engineer-in-test-empower-4415"},{"id":6825248517,"title":"Sr. Android Engineer - Remote","company":"Empower","image":"https://lever-client-logos.s3.us-west-2.amazonaws.com/2e1a369c-b58f-41ac-8d86-4b0a77695e68-1687915522032.png","description":"<p style=\"min-height:1.5em\"><strong>EMPOWER OVERVIEW</strong></p><p style=\"min-height:1.5em\"><a target=\"_blank\" rel=\"noopener noreferrer nofollow\" href=\"http://empower.me\">Empower</a> is shaking up an outdated financial system by providing real opportunity for our customers: the opportunity to get the cash they need, to access fair credit, and to change their financial story. Today, we’re helping millions of people find financial security through machine learning models that evaluate creditworthiness using a more inclusive lens and mobile-first products: Cash Advance, Thrive line of credit, and Petal credit cards. Tomorrow? Creating even more financial paths for our customers (and their wallets) to succeed. </p><p style=\"min-height:1.5em\"></p><p style=\"min-height:1.5em\">This year, Empower ranked #65 on Inc. 5000’s Fastest-Growing Private Companies list — our third year in a row cracking the top 100 — and was named by Forbes as one of the 25 Next Billion-Dollar Startups for 2024. Empower was also featured by Forbes on America’s Best Startup Employers list in 2023, and our Thrive line of credit product was named by Fast Company as one of 2022’s Next Big Things in Tech.  </p><p style=\"min-height:1.5em\"></p><p style=\"min-height:1.5em\">Empower is backed by Sequoia Capital, Blisce, and Icon Ventures. Ready to grow your impact and accelerate your career? Take a look at our open roles — we can’t wait to meet you.</p><p style=\"min-height:1.5em\"></p><p style=\"min-height:1.5em\"><strong>THE EMPOWER WAY</strong></p><p style=\"min-height:1.5em\"><strong>Great Expectations</strong>: We come up with bold, audacious goals for ourselves and go all out for impact</p><p style=\"min-height:1.5em\"><strong>Owner Mindset</strong>: We give every employee latitude to act independently, make smart choices, and move the business forward</p><p style=\"min-height:1.5em\"><strong>Spirited Debate</strong>: We love skeptics and seek counter opinions to challenge our personal assumptions and expand our view</p><p style=\"min-height:1.5em\"><strong>Customer Obsession:</strong> We listen to understand, empathize, and create a memorable, rewarding experience for our community</p><p style=\"min-height:1.5em\"><strong>Inclusive Collaboration</strong>: We believe diverse teams make the best decisions, and we strive to give diverse voices a seat at the table</p><p style=\"min-height:1.5em\"><strong>No Jerks Allowed</strong>: We value our relationships and take the time to build trust and connection and communicate respectfully</p><p style=\"min-height:1.5em\"></p><p style=\"min-height:1.5em\"><strong>WHAT EMPOWER OFFERS</strong></p><p style=\"min-height:1.5em\">Competitive salary</p><p style=\"min-height:1.5em\">Generous equity package</p><p style=\"min-height:1.5em\">Full healthcare benefits</p><p style=\"min-height:1.5em\">Technology expense reimbursement</p><p style=\"min-height:1.5em\">Work from anywhere</p><p style=\"min-height:1.5em\"><strong>JOB DESCRIPTION</strong></p><p style=\"min-height:1.5em\">As an Android Software Engineer, you’ll create the Android mobile app that powers the Empower customer experience. You’ll engage with a collaborative, high powered team to develop solutions and lead product engineering on projects with a reach of millions. The solutions you’ll build will be robust, secure and easy to understand both for our users and your engineering peers. You’ll take end to end ownership of new features and product lines shaping work in early stages, building, deploying and running post deployment analysis to ensure we’re hitting our goals.</p><p style=\"min-height:1.5em\"></p><p style=\"min-height:1.5em\">Travel for company offsites is expected at a minimum 2 times a year.</p><p style=\"min-height:1.5em\"><strong>Key Responsibilities</strong></p><ul style=\"min-height:1.5em\"><li><p style=\"min-height:1.5em\">Designing and building Android mobile apps</p></li><li><p style=\"min-height:1.5em\">Contribution and adherence to software engineering standards and practices</p></li><li><p style=\"min-height:1.5em\">Implementing secure coding standards in accordance with the Empower Secure Development Policy</p></li><li><p style=\"min-height:1.5em\">Perform on-going security testing and code review to improve software security</p></li><li><p style=\"min-height:1.5em\">Meeting sprint goals</p></li><li><p style=\"min-height:1.5em\">Leading and/or supporting feature specification activities (Product Engineering)</p></li><li><p style=\"min-height:1.5em\">Monitoring the performance of the Empower mobile app and applying corrective action through bug fixing and general improvement.</p></li><li><p style=\"min-height:1.5em\">Minimizing defects and improving reliability through: Development of automated tests, manual test validation, development of fit for purpose architecture and code, contributing to PRs</p></li><li><p style=\"min-height:1.5em\">Developing and maintaining the Android app build pipeline</p></li><li><p style=\"min-height:1.5em\">Publishing the App to the Google Play Store</p></li><li><p style=\"min-height:1.5em\">Collaborating cross-functionally to define, design and ship new features that create customer and business value.</p></li><li><p style=\"min-height:1.5em\">Playing an active role in advising and collaborating with design and product to flesh out the specifications of each epic.</p></li><li><p style=\"min-height:1.5em\">Writing engineering specs, including acceptance criteria and server contracts</p></li><li><p style=\"min-height:1.5em\">Grooming stories for upcoming sprints</p></li><li><p style=\"min-height:1.5em\">Maximising effective development and identifying new technology opportunities by: Keeping across Android development announcements, being across community best practice, discovering and evaluating new technologies</p></li></ul><p style=\"min-height:1.5em\"></p><p style=\"min-height:1.5em\"></p><p style=\"min-height:1.5em\"><strong>Candidate Qualifications</strong></p><ul style=\"min-height:1.5em\"><li><p style=\"min-height:1.5em\">Bachelor degree or greater within Computer Science, Software Engineering or a related subject</p></li><li><p style=\"min-height:1.5em\">5+ years developing consumer facing Android apps</p></li><li><p style=\"min-height:1.5em\">Working experience in Kotlin and Android UI Frameworks</p><p style=\"min-height:1.5em\"></p></li></ul><p style=\"min-height:1.5em\">At Empower, we hire for people that push themselves to understand others and seek out ways to challenge their personal assumptions. Our hope is that by fostering such an environment, we strengthen our business and relationships by putting people first. We are committed to building a diverse, inclusive, and equitable workspace where everyone (regardless of age, education, ethnicity, gender, sexual orientation, or any personal characteristics) feels like they belong. Even if your experience doesn’t exactly match up to our job description, you should feel empowered to apply regardless!</p>","tags":"[\"engineering\"]","pubDate":"2024-11-14 22:20:54.689","link":"https://jobs.ashbyhq.com/empower%20finance/e4724a82-11e1-42c3-b1ac-08e21fa6564a","savedDate":"2024-11-26 15:12:07.263","slug":"sr-android-engineer-remote-empower-2663"},{"id":4488583787,"title":"Customer Support Associate - Empower Mexico","company":"Empower","image":"https://lever-client-logos.s3.us-west-2.amazonaws.com/2e1a369c-b58f-41ac-8d86-4b0a77695e68-1687915522032.png","description":"<p style=\"min-height:1.5em\"><strong>EMPOWER OVERVIEW</strong></p><p style=\"min-height:1.5em\"><a target=\"_blank\" rel=\"noopener noreferrer nofollow\" href=\"http://empower.me\">Empower</a> is shaking up an outdated financial system by providing real opportunity for our customers: the opportunity to get the cash they need, to access fair credit, and to change their financial story. Today, we’re helping millions of people find financial security through machine learning models that evaluate creditworthiness using a more inclusive lens and mobile-first products: Cash Advance, Thrive line of credit, and Petal credit cards. Tomorrow? Creating even more financial paths for our customers (and their wallets) to succeed. </p><p style=\"min-height:1.5em\"></p><p style=\"min-height:1.5em\">This year, Empower ranked #65 on Inc. 5000’s Fastest-Growing Private Companies list — our third year in a row cracking the top 100 — and was named by Forbes as one of the 25 Next Billion-Dollar Startups for 2024. Empower was also featured by Forbes on America’s Best Startup Employers list in 2023, and our Thrive line of credit product was named by Fast Company as one of 2022’s Next Big Things in Tech.  </p><p style=\"min-height:1.5em\"></p><p style=\"min-height:1.5em\">Empower is backed by Sequoia Capital, Blisce, and Icon Ventures. Ready to grow your impact and accelerate your career? Take a look at our open roles — we can’t wait to meet you.</p><p style=\"min-height:1.5em\"></p><p style=\"min-height:1.5em\"><strong>THE EMPOWER WAY</strong></p><p style=\"min-height:1.5em\"><strong>Great Expectations</strong>: We come up with bold, audacious goals for ourselves and go all out for impact</p><p style=\"min-height:1.5em\"><strong>Owner Mindset</strong>: We give every employee latitude to act independently, make smart choices, and move the business forward</p><p style=\"min-height:1.5em\"><strong>Spirited Debate</strong>: We love skeptics and seek counter opinions to challenge our personal assumptions and expand our view</p><p style=\"min-height:1.5em\"><strong>Customer Obsession:</strong> We listen to understand, empathize, and create a memorable, rewarding experience for our community</p><p style=\"min-height:1.5em\"><strong>Inclusive Collaboration</strong>: We believe diverse teams make the best decisions, and we strive to give diverse voices a seat at the table</p><p style=\"min-height:1.5em\"><strong>No Jerks Allowed</strong>: We value our relationships and take the time to build trust and connection and communicate respectfully</p><p style=\"min-height:1.5em\"></p><p style=\"min-height:1.5em\"><strong>WHAT EMPOWER OFFERS</strong></p><p style=\"min-height:1.5em\">Competitive salary</p><p style=\"min-height:1.5em\">Generous equity package</p><p style=\"min-height:1.5em\">Full healthcare benefits</p><p style=\"min-height:1.5em\">Technology expense reimbursement</p><p style=\"min-height:1.5em\">Work from anywhere</p><p style=\"min-height:1.5em\"></p><p style=\"min-height:1.5em\"><strong>Customer Support Associate</strong><br />Remote, Mexico<br />(Bilingual in English and Spanish)</p><p style=\"min-height:1.5em\"></p><p style=\"min-height:1.5em\"><strong>JOB DESCRIPTION</strong></p><p style=\"min-height:1.5em\">Empower is looking for a Customer Support Associate in Mexico. You will be supporting our customers by providing customer-focused assistance, handling customer inquiries on a daily basis, and helping with enhancing the customer experience at Empower. In addition, you will escalate leading trends and drivers and engage proactively with the team to help with improving both the product and the customer experience. You will work as part of a small cross-functional team within the company that is exclusively dedicated to the Mexico operation. </p><p style=\"min-height:1.5em\"></p><p style=\"min-height:1.5em\">Empower is a remote-first company. We drive connectivity through regular company offsites. Travel for company offsites is expected at a minimum 2 times a year.</p><p style=\"min-height:1.5em\"></p><p style=\"min-height:1.5em\"><strong>RESPONSIBILITIES</strong></p><ul style=\"min-height:1.5em\"><li><p style=\"min-height:1.5em\">Work on the frontline of the business: support calls, chat, and emails from our users</p></li><li><p style=\"min-height:1.5em\">Resolve a customer's issue with active listening and knowledge of our products and services</p></li><li><p style=\"min-height:1.5em\">Become knowledgeable of any pain points in Customer Support that our customers or team members are experiencing</p></li><li><p style=\"min-height:1.5em\">Advocate for customers from within the organization and drive changes that can improve their experience</p></li><li><p style=\"min-height:1.5em\">Create a seamless support experience for our customer base </p><p style=\"min-height:1.5em\"></p></li></ul><p style=\"min-height:1.5em\"><strong>QUALIFICATIONS</strong></p><ul style=\"min-height:1.5em\"><li><p style=\"min-height:1.5em\">Fluent written and verbal communication in both Spanish and English</p></li><li><p style=\"min-height:1.5em\">Work authorization in Mexico </p></li><li><p style=\"min-height:1.5em\">A BA/BS degree, 6+ months in a customer support role (a plus if within a fintech company)</p></li><li><p style=\"min-height:1.5em\">Excellent verbal and written communication skills with the ability to explain complex topics in easily understood, concise language</p></li><li><p style=\"min-height:1.5em\">Demonstrated passion for the customer experience and the ability to solve problems with a short turnaround time for customers while maintaining a high level of empathy</p></li><li><p style=\"min-height:1.5em\">Ability to communicate cross-functionally and globally</p></li><li><p style=\"min-height:1.5em\">Availability on some weekends and holidays when needed</p></li></ul><p style=\"min-height:1.5em\"></p><p style=\"min-height:1.5em\"><strong>A strong plus if you:</strong></p><ul style=\"min-height:1.5em\"><li><p style=\"min-height:1.5em\">Have expertise in Zendesk</p></li><li><p style=\"min-height:1.5em\">Are familiar with the Mexican customer and have a basic understanding of the Mexican payments and financial environment  </p><p style=\"min-height:1.5em\"></p></li></ul><p style=\"min-height:1.5em\">At Empower, we hire for people that push themselves to understand others and seek out ways to challenge their personal assumptions. Our hope is that by fostering such an environment, we strengthen our business and relationships by putting people first. We are committed to building a diverse, inclusive, and equitable workspace where everyone (regardless of age, education, ethnicity, gender, sexual orientation, or any personal characteristics) feels like they belong. Even if your experience doesn’t exactly match up to our job description, you should feel empowered to apply regardless!</p>","tags":"[]","pubDate":"2024-11-13 17:55:50.210","link":"https://jobs.ashbyhq.com/empower%20finance/144b273d-db60-4348-bc87-2856d1c7bb18","savedDate":"2024-11-26 15:12:07.265","slug":"customer-support-associate-empower-mexico-empower-39"},{"id":6381421715,"title":"Recruiter","company":"Coalition Technologies ","image":"https://remotive.com/job/1680495/logo","description":"<p class=\"h3\">WHY YOU SHOULD APPLY:</p>\n<p> </p>\n<p>Coalition Technologies is devoted to delivering clients the highest quality work while providing our team a fun, thriving, and innovative environment. Along with the opportunity for tremendous career growth and rapid advancement, CT offers:</p>\n<ul style=\"\">\n<li style=\"\">The most competitive profit-sharing bonus plan in the industry, paying up to 50% of company profits to full-time employees each month!</li>\n<li style=\"\">A highly competitive Paid Time Off plan, promoting quality work-life balance.</li>\n<li style=\"\">Subsidized gym memberships to help team members feel their best.</li>\n<li style=\"\">Medical, dental, vision, and life insurance packages for all US-based team members.</li>\n<li style=\"\">International Health Insurance Reimbursement Program for all international team members, a benefit unique to Coalition.</li>\n<li style=\"\">Device upgrade and learning reimbursement programs.</li>\n<li style=\"\">Motivating career development plans with clearly defined goals and rewards.</li>\n<li style=\"\">Additional job-specific incentives and bonuses.</li>\n</ul>\n<p>Plus, 100% of our team works remotely with the support of time tracking software. Our company culture specializes in supporting remote team members, and we’ve been doing so for more than a decade. CT welcomes your application, wherever in the world it's coming from!</p>\n<p class=\"h3\"> </p>\n<p class=\"h3\">YOU SHOULD HAVE:</p>\n<p> </p>\n<ul style=\"\">\n<li style=\"\"><li style=\"\">Prior experience with recruitment, sourcing, screening, hiring etc. International recruiting experience is a plus.</li><li style=\"\">Passion for recruitment and human resources.</li><li style=\"\">Great interpersonal, analytical, problem-solving, negotiating, influencing, facilitation, decision-making, and conflict resolution skills.</li><li style=\"\">The ability to stay highly organized with great attention to detail.</li><li style=\"\">The ability to maintain strict confidentiality and discretion.</li><li style=\"\">Excellent written and spoken English.</li><li style=\"\">The availability to work 40 hours per week from 9:00 am to 6:00 pm PST.</li><li style=\"\">Passion to build a startup.</li><li style=\"\">An outgoing and friendly disposition.</li><li style=\"\">A reliable workstation with a fast computer, microphone and speakers, reliable internet and power if working remotely.</li>\n</ul>\n<p class=\"h3\"> </p>\n<p class=\"h3\">YOUR DUTIES AND TASKS:</p>\n<p> </p>\n<ul style=\"\">\n<li style=\"\"><li style=\"\">Drafting and posting job ads.</li><li style=\"\">Reviewing resumes and screening candidates.</li><li style=\"\">Scheduling interviews and skills tests by coordinating appointments.</li><li style=\"\">Conducting interviews with candidates on Zoom.</li><li style=\"\">Administering skills tests.</li><li style=\"\">Inputting, updating and maintaining data in the recruiting database.</li><li style=\"\">Conducting exit interviews in the event that an employee leaves the company.</li><li style=\"\">Assisting management with personnel issues and employee development.</li><li style=\"\">Assisting management with organizing and coordinating employee training workshops.</li><li style=\"\">Planning and executing company events.</li><li style=\"\">Protecting operations by keeping human resource information confidential.</li><li style=\"\">Providing horizontal support to other staff members of the recruitment team.</li>\n</ul>\n<p class=\"h5\"> </p>\n<p class=\"h5\">We are looking for talented and diligent candidates who excel in our skills tests, and will consider these candidates even if past experience or educational background criteria aren't met.</p><p class=\"h5\"><br></p><p>*California, New York, Washington, and Colorado: starting base pay for this position ranges between $15 - $35 per hour.</p>\n<p>Compensation may vary based on factors such as experience, \r\nqualifications, skills test performance, geographic location, and \r\nseniority of the position offered. Outside of California, New York, \r\nWashington, and Colorado compensation may fall outside the above ranges.</p>\n<img src=\"https://remotive.com/job/track/1680495/blank.gif?source=public_api\" alt=\"\"/>","tags":"[\"CSS\",\"excel\",\"frontend\",\"git\",\"html\",\"illustrator\",\"magento\",\"photoshop\",\"php\",\"shopify\",\"wordpress\",\"MySQL\",\"startup\",\"responsive\",\"themes\",\"bootstrap\",\"insurance\",\"jQuery\",\"Ajax\"]","pubDate":"2024-11-11 15:00:39.000","link":"https://remotive.com/remote-jobs/hr/recruiter-1680495","savedDate":"2024-11-26 15:12:07.252","slug":"recruiter-coalition-technologies-3632"},{"id":2312339440,"title":"Head of International Credit and Data Science - Remote Global","company":"Empower","image":"https://lever-client-logos.s3.us-west-2.amazonaws.com/2e1a369c-b58f-41ac-8d86-4b0a77695e68-1687915522032.png","description":"<p style=\"min-height:1.5em\"><strong>EMPOWER OVERVIEW</strong></p><p style=\"min-height:1.5em\"><a target=\"_blank\" rel=\"noopener noreferrer nofollow\" href=\"http://empower.me\">Empower</a> is shaking up an outdated financial system by providing real opportunity for our customers: the opportunity to get the cash they need, to access fair credit, and to change their financial story. Today, we’re helping millions of people find financial security through machine learning models that evaluate creditworthiness using a more inclusive lens and mobile-first products: Cash Advance, Thrive line of credit, and Petal credit cards. Tomorrow? Creating even more financial paths for our customers (and their wallets) to succeed. </p><p style=\"min-height:1.5em\"></p><p style=\"min-height:1.5em\">This year, Empower ranked #65 on Inc. 5000’s Fastest-Growing Private Companies list — our third year in a row cracking the top 100 — and was named by Forbes as one of the 25 Next Billion-Dollar Startups for 2024. Empower was also featured by Forbes on America’s Best Startup Employers list in 2023, and our Thrive line of credit product was named by Fast Company as one of 2022’s Next Big Things in Tech.  </p><p style=\"min-height:1.5em\"></p><p style=\"min-height:1.5em\">Empower is backed by Sequoia Capital, Blisce, and Icon Ventures. Ready to grow your impact and accelerate your career? Take a look at our open roles — we can’t wait to meet you.</p><p style=\"min-height:1.5em\"></p><p style=\"min-height:1.5em\"><strong>THE EMPOWER WAY</strong></p><p style=\"min-height:1.5em\"><strong>Great Expectations</strong>: We come up with bold, audacious goals for ourselves and go all out for impact</p><p style=\"min-height:1.5em\"><strong>Owner Mindset</strong>: We give every employee latitude to act independently, make smart choices, and move the business forward</p><p style=\"min-height:1.5em\"><strong>Spirited Debate</strong>: We love skeptics and seek counter opinions to challenge our personal assumptions and expand our view</p><p style=\"min-height:1.5em\"><strong>Customer Obsession:</strong> We listen to understand, empathize, and create a memorable, rewarding experience for our community</p><p style=\"min-height:1.5em\"><strong>Inclusive Collaboration</strong>: We believe diverse teams make the best decisions, and we strive to give diverse voices a seat at the table</p><p style=\"min-height:1.5em\"><strong>No Jerks Allowed</strong>: We value our relationships and take the time to build trust and connection and communicate respectfully</p><p style=\"min-height:1.5em\"></p><p style=\"min-height:1.5em\"><strong>WHAT EMPOWER OFFERS</strong></p><p style=\"min-height:1.5em\">Competitive salary</p><p style=\"min-height:1.5em\">Generous equity package</p><p style=\"min-height:1.5em\">Full healthcare benefits</p><p style=\"min-height:1.5em\">Technology expense reimbursement</p><p style=\"min-height:1.5em\">Work from anywhere</p><p style=\"min-height:1.5em\"><strong>JOB DESCRIPTION</strong></p><p style=\"min-height:1.5em\">Empower is looking for an experienced analytics leader to join our fintech startup and own the Credit and Data Science functions for our international businesses in Latin America and South East Asia. This role presents an exciting opportunity to be an early team member in these geographies as we build a winning strategy. As part of the Credit and Data Science team, you will develop and iterate on risk models and credit policies that drive underwriting as a competitive advantage for Empower and launch innovative products that solve customer problems. This role will report to Empower’s Head of Credit.</p><p style=\"min-height:1.5em\">The ideal candidate is driven by a passion for leveraging data and analytics to fuel business growth and improve customer financial well-being. This individual will lead teams and workstreams that seek to understand consumer needs and behaviors and develop solutions to allow Empower to resiliently offer the right products. This role involves the additional challenge of solving problems across different markets where the frameworks will need to be adapted based on the available data and customer needs. The right candidate thrives on tackling complex challenges and is proficient in utilizing a wide range of technical tools to achieve impactful outcomes.</p><p style=\"min-height:1.5em\"></p><p style=\"min-height:1.5em\">Empower is a remote-first company. We drive connectivity through regular company offsites. Travel for company offsites is expected at a minimum 2 times a year.</p><p style=\"min-height:1.5em\"></p><p style=\"min-height:1.5em\"><strong>RESPONSIBILITIES</strong></p><ul style=\"min-height:1.5em\"><li><p style=\"min-height:1.5em\">Develop and review proposals for new credit policies and risk models for Empower’s international businesses</p></li><li><p style=\"min-height:1.5em\">Build out frameworks, infrastructure, and controls to manage credit programs with high quality</p></li><li><p style=\"min-height:1.5em\">Work with Empower’s leadership team to build out strategy and growth plans while managing financial outcomes</p></li><li><p style=\"min-height:1.5em\">Partner with geography leaders in product, engineering, marketing, and finance to ensure that the team’s work fits within the larger picture</p></li><li><p style=\"min-height:1.5em\">Mentor junior and mid level analysts and data scientists to grow and develop</p></li><li><p style=\"min-height:1.5em\">Hire talented team to staff new projects as the business grows</p><p style=\"min-height:1.5em\"></p></li></ul><p style=\"min-height:1.5em\"><strong>QUALIFICATIONS</strong></p><ul style=\"min-height:1.5em\"><li><p style=\"min-height:1.5em\">Bachelor’s degree in Engineering, Business, Finance, Computer Science, or Mathematics</p></li><li><p style=\"min-height:1.5em\">8+ years of industry experience in data analytics and credit risk management</p></li><li><p style=\"min-height:1.5em\">4+ years leading teams of analysts</p></li><li><p style=\"min-height:1.5em\">Experience either building models from scratch or leading teams that have done so</p></li><li><p style=\"min-height:1.5em\">Experience solving credit problems in Latin American or South East Asian markets</p></li><li><p style=\"min-height:1.5em\">Eagerness to learn new tools and analytical methods, staying up to date with innovative trends and new products in the industry</p></li><li><p style=\"min-height:1.5em\">Exceptionally strong problem solving and communication with the ability to both get in the weeds and communicate to an executive audience</p></li><li><p style=\"min-height:1.5em\">Preference for candidates located in Pacific Time (PT) or Asia time zones such as Singapore (SGT), Hong Kong (HKT), or Japan (JST) to facilitate collaboration across regions.</p><p style=\"min-height:1.5em\"></p></li></ul><p style=\"min-height:1.5em\">At Empower, we hire for people that push themselves to understand others and seek out ways to challenge their personal assumptions. Our hope is that by fostering such an environment, we strengthen our business and relationships by putting people first. We are committed to building a diverse, inclusive, and equitable workspace where everyone (regardless of age, education, ethnicity, gender, sexual orientation, or any personal characteristics) feels like they belong. Even if your experience doesn’t exactly match up to our job description, you should feel empowered to apply regardless!</p>","tags":"[\"Finance\",\"management\",\"engineering\"]","pubDate":"2024-11-05 19:21:40.614","link":"https://jobs.ashbyhq.com/empower%20finance/dc4b545b-a8cc-4715-a9b1-e4a36574b2b7","savedDate":"2024-11-26 15:12:07.261","slug":"head-of-international-credit-and-data-science-remote-global-empower-9085"},{"id":5609037458,"title":"Copywriter","company":"Coalition Technologies ","image":"https://remotive.com/job/1749306/logo","description":"<p class=\"h3\"></p><div class=\"h3\">WHO WE'RE LOOKING FOR</div><div class=\"h3\">The ideal copywriter has excellent English writing skills and is excited to write high-quality, SEO-driven content that aligns with detailed, client-specific guidelines. Projects most commonly include writing web pages for eCommerce and lead generation business sites such as category pages, product descriptions, and blog posts. Our clientele is constantly evolving. We produce content for these and many other industry verticals:</div><div class=\"h3\"><br></div><div class=\"h3\">Fashion (both mass-market and luxury)</div><div class=\"h3\">Skincare &amp; Beauty</div><div class=\"h3\">Tech &amp; Software**</div><div class=\"h3\">Finance &amp; Investing**</div><div class=\"h3\">Law (family law, product liability, divorce, etc.)**</div><div class=\"h3\">Education</div><div class=\"h3\">Home Improvement</div><div class=\"h3\">Automobiles &amp; Motorcycles (OEM and aftermarket accessories)</div><div class=\"h3\">Health and Wellness**</div><div class=\"h3\">Medical / Clinical**</div><div class=\"h3\">Digital Marketing</div><div class=\"h3\">SEO / PR / Advertising / Marketing**</div><div class=\"h3\">**Writers with a background in these highly specialized fields are strongly encouraged to apply.</div><div class=\"h3\">The ideal candidate for this position is a multifaceted technical and creative writer with at least two to four years of professional, non-academic experience. Candidates should understand how to write content that effortlessly blends SEO best practices and brand priorities for finished work that’s engaging, creative, and ROI-driven. Candidates should also be willing and able to complete careful research in order to gain a strong understanding of various industries. Candidates should be prepared to provide portfolios featuring published work. Once an offer has been extended, writers will be asked to take a brief training course.</div><div class=\"h3\"><br></div><div class=\"h3\">Compensation</div><div class=\"h3\">Writers are paid on a per-word basis. The rate is assessed according to our KPI rubric (key performance indicators) with an automatic raise after 400 and 800 pages have gone live on our client's websites.</div><div class=\"h3\">Initial compensation is up to $0.06 per word with $0.034 per word being the most typical compensation level. This is $30 or $17 per page of 500 words.</div><div class=\"h3\">After 400 pages live, the top marginal rate increases to $0.064 per word with the most typical rate of $0.038 per word, or $32 and $19 per page. After 800 pages live, the top marginal rate increases to $0.07 per word with $0.044 per word being the most typical, or $35 and $22 per page.</div>\n<img src=\"https://remotive.com/job/track/1749306/blank.gif?source=public_api\" alt=\"\"/>","tags":"[\"accounting\",\"excel\",\"research\",\"data analysis\",\"bookkeeping\",\"google sheets\",\"quickbooks\",\"data entry\",\"insurance\",\"G Suite\"]","pubDate":"2024-11-02 14:46:01.000","link":"https://remotive.com/remote-jobs/writing/copywriter-1749306","savedDate":"2024-11-26 15:12:07.252","slug":"copywriter-coalition-technologies-5551"},{"id":3385788034,"title":"Finance & Strategy Manager","company":"Empower","image":"https://lever-client-logos.s3.us-west-2.amazonaws.com/2e1a369c-b58f-41ac-8d86-4b0a77695e68-1687915522032.png","description":"<p style=\"min-height:1.5em\"><strong>EMPOWER OVERVIEW</strong></p><p style=\"min-height:1.5em\"><a target=\"_blank\" rel=\"noopener noreferrer nofollow\" href=\"http://empower.me\">Empower</a> is shaking up an outdated financial system by providing real opportunity for our customers: the opportunity to get the cash they need, to access fair credit, and to change their financial story. Today, we’re helping millions of people find financial security through machine learning models that evaluate creditworthiness using a more inclusive lens and mobile-first products: Cash Advance, Thrive line of credit, and Petal credit cards. Tomorrow? Creating even more financial paths for our customers (and their wallets) to succeed. </p><p style=\"min-height:1.5em\"></p><p style=\"min-height:1.5em\">This year, Empower ranked #65 on Inc. 5000’s Fastest-Growing Private Companies list — our third year in a row cracking the top 100 — and was named by Forbes as one of the 25 Next Billion-Dollar Startups for 2024. Empower was also featured by Forbes on America’s Best Startup Employers list in 2023, and our Thrive line of credit product was named by Fast Company as one of 2022’s Next Big Things in Tech.  </p><p style=\"min-height:1.5em\"></p><p style=\"min-height:1.5em\">Empower is backed by Sequoia Capital, Blisce, and Icon Ventures. Ready to grow your impact and accelerate your career? Take a look at our open roles — we can’t wait to meet you.</p><p style=\"min-height:1.5em\"></p><p style=\"min-height:1.5em\"><strong>THE EMPOWER WAY</strong></p><p style=\"min-height:1.5em\"><strong>Great Expectations</strong>: We come up with bold, audacious goals for ourselves and go all out for impact</p><p style=\"min-height:1.5em\"><strong>Owner Mindset</strong>: We give every employee latitude to act independently, make smart choices, and move the business forward</p><p style=\"min-height:1.5em\"><strong>Spirited Debate</strong>: We love skeptics and seek counter opinions to challenge our personal assumptions and expand our view</p><p style=\"min-height:1.5em\"><strong>Customer Obsession:</strong> We listen to understand, empathize, and create a memorable, rewarding experience for our community</p><p style=\"min-height:1.5em\"><strong>Inclusive Collaboration</strong>: We believe diverse teams make the best decisions, and we strive to give diverse voices a seat at the table</p><p style=\"min-height:1.5em\"><strong>No Jerks Allowed</strong>: We value our relationships and take the time to build trust and connection and communicate respectfully</p><p style=\"min-height:1.5em\"></p><p style=\"min-height:1.5em\"><strong>WHAT EMPOWER OFFERS</strong></p><p style=\"min-height:1.5em\">Competitive salary</p><p style=\"min-height:1.5em\">Generous equity package</p><p style=\"min-height:1.5em\">Full healthcare benefits</p><p style=\"min-height:1.5em\">Technology expense reimbursement</p><p style=\"min-height:1.5em\">Work from anywhere</p><p style=\"min-height:1.5em\"><br /><strong>JOB DESCRIPTION</strong></p><p style=\"min-height:1.5em\">Empower is looking for a Finance and Strategy Manager, who will help build out Empower’s analytical capabilities, business planning, and share strategic recommendations and data-based insights for products and programs critical to Empower’s growth, customer acquisition, and customer retention. You will partner closely with our executive leadership team and board to develop and present insights. Your insights will build the foundation for Empower’s scaled success as we bring new products to market and scale programs impactful to Empower’s core business.</p><p style=\"min-height:1.5em\"></p><p style=\"min-height:1.5em\">Empower is a remote-first company. We drive connectivity through regular company offsites. Travel for company offsites is expected at a minimum 2 times a year.</p><p style=\"min-height:1.5em\"></p><p style=\"min-height:1.5em\"><strong>RESPONSIBILITIES</strong></p><ul style=\"min-height:1.5em\"><li><p style=\"min-height:1.5em\">Build analytical tools: Surface data-based insights through dashboards, automated reporting, and presentations that give both our internal stakeholders information critical to make decisions. Drive improvements to our data analysis infrastructure and processes. </p></li><li><p style=\"min-height:1.5em\">Forecast business: Develop and maintain Empower’s long-term financial plan and incorporate various strategic initiatives.</p></li><li><p style=\"min-height:1.5em\">Set strategic priorities: Conduct market research, competitive analysis, and data analyses to inform strategic priorities for Empower.</p></li><li><p style=\"min-height:1.5em\">Represent finance in cross-functional teams: Partner with credit, product, and marketing teams to build business cases, conduct unit economics and tradeoff analyses to inform operational decision-making</p></li><li><p style=\"min-height:1.5em\">Help drive product positioning: Leverage customer data to inform product positioning and optimize our scaling efforts. Lead complex analyses on our products, develop case studies, and design experiments to improve product performance.</p></li><li><p style=\"min-height:1.5em\">Lead cross-functional initiatives: Collaborate with cross-functional colleagues in Product, Data Science, Marketing, and Engineering.</p><p style=\"min-height:1.5em\"></p></li></ul><p style=\"min-height:1.5em\"><strong>QUALIFICATIONS</strong></p><ul style=\"min-height:1.5em\"><li><p style=\"min-height:1.5em\">​​Minimum of  4+ years of work experience in strategic finance, management consulting, and/or investment banking</p></li><li><p style=\"min-height:1.5em\">Strong analytical abilities and are comfortable defining and measuring goals consistently</p></li><li><p style=\"min-height:1.5em\">Strong customer empathy and experience shaping product direction and execution based on customer needs</p></li><li><p style=\"min-height:1.5em\">Strong financial modeling and unit economics modeling experience</p></li><li><p style=\"min-height:1.5em\">Comfortable with SQL, or a strong desire to develop SQL expertise</p></li><li><p style=\"min-height:1.5em\">A get-it-done mindset; you’re resourceful and happy to be hands-on and in the weeds</p></li><li><p style=\"min-height:1.5em\">An interest in addressing complicated and impactful product &amp; business problems</p></li><li><p style=\"min-height:1.5em\">Experience delivering complex, cross-functional product initiatives </p></li><li><p style=\"min-height:1.5em\">Strong strategic thinking, problem-solving, and logical structuring abilities</p></li><li><p style=\"min-height:1.5em\">Comfort with ambiguity; the ability to independently layout and test clear hypotheses, and solve problems without well-defined direction</p></li><li><p style=\"min-height:1.5em\">Excellent verbal and written communication skills</p></li></ul><p style=\"min-height:1.5em\">At Empower, we hire for people that push themselves to understand others and seek out ways to challenge their personal assumptions. Our hope is that by fostering such an environment, we strengthen our business and relationships by putting people first. We are committed to building a diverse, inclusive, and equitable workspace where everyone (regardless of age, education, ethnicity, gender, sexual orientation, or any personal characteristics) feels like they belong. Even if your experience doesn’t exactly match up to our job description, you should feel empowered to apply regardless!</p>","tags":"[\"Finance\",\"management\",\"engineering\"]","pubDate":"2024-10-29 15:24:03.249","link":"https://jobs.ashbyhq.com/empower%20finance/3e4500a1-af37-458f-869d-7384710a2a99","savedDate":"2024-11-26 15:12:07.264","slug":"finance-strategy-manager-empower-7227"}]