[{"id":2239306904,"title":"Account Executive (Remote Canada & US)","company":"BioRender","image":"https://yt3.googleusercontent.com/8szApiN8P0n8pp0GeXj_z9R4Wh1gJBGW5OJZDocvTtvuCF69U0Q4h2lXDct74mL2_F7vuUwKMA","description":"<p style=\"min-height:1.5em\">At BioRender, our mission is to accelerate the world’s ability to learn, discover and communicate science. We are passionate about democratizing science communication in order to accelerate scientific discovery and understanding. We're looking for amazing people to help create the world’s go-to-place and platform where science is communicated. Come join us!</p><p style=\"min-height:1.5em\">We are looking for a motivated Account Executive that has a tenacious, methodical approach to developing new business opportunities. You will work closely with members of our Leadership, Customer Success, and Business Development teams to find the right approach that ensures a great customer experience while maximizing revenue growth.</p><p style=\"min-height:1.5em\"></p><p style=\"min-height:1.5em\"><strong>Our ideal fit</strong></p><p></p><ul style=\"min-height:1.5em\"><li><p style=\"min-height:1.5em\"><strong>Exceptional customer curiosity: </strong>You have a genuine interest in learning about the clients we serve, their goals, and their science communication pain points. You are curious, love asking questions, and can think outside of the box.</p></li><li><p style=\"min-height:1.5em\"><strong>Team-oriented approach:</strong> You thrive in a fast-paced environment and love working on a diverse array of collaborative projects with different internal teams. </p></li><li><p style=\"min-height:1.5em\"><strong>Detail-oriented and data-focused approach:</strong> You are someone who is always looking for ways to improve and scale sales strategies, outreaches and playbooks.</p></li></ul><p style=\"min-height:1.5em\"></p><p style=\"min-height:1.5em\"><strong>Your responsibilities </strong></p><p></p><ul style=\"min-height:1.5em\"><li><p style=\"min-height:1.5em\">Manage the full sales cycle, selling to academic institutions and industry companies across the globe</p></li><li><p style=\"min-height:1.5em\">Become an expert in BioRender’s features, benefits, and use cases</p></li><li><p style=\"min-height:1.5em\">Consistently attain and exceed all revenue and booking targets within assigned territory or category</p></li><li><p style=\"min-height:1.5em\">Organize, categorize, and prioritize sales leads in CRM — measure lead conversion and performance against quota</p></li><li><p style=\"min-height:1.5em\">Develop and execute on strategic account expansion plans for named enterprise accounts in assigned territory</p></li><li><p style=\"min-height:1.5em\">Partner with Marketing, Customer Success, Product and other internal teams to continue to improve and iterate on what’s required to succeed</p></li></ul><p style=\"min-height:1.5em\"></p><p style=\"min-height:1.5em\"><strong>What you bring to the table</strong></p><p></p><ul style=\"min-height:1.5em\"><li><p style=\"min-height:1.5em\">2+ years of previous experience in full-cycle SaaS sales</p></li><li><p style=\"min-height:1.5em\">Bachelor’s degree in a life science discipline or prior life sciences experience (e.g. biology, biotechnology, biomedical engineering, biochemistry) OR experience selling highly technical products in SaaS environments</p></li><li><p style=\"min-height:1.5em\">History of consistently achieving or exceeding sales targets and have experience working on deals with multiple stakeholders</p></li><li><p style=\"min-height:1.5em\">Strong communication skills and the ability to connect effectively with a range of stakeholders, including scientists, team project liaisons, and industry executives</p></li><li><p style=\"min-height:1.5em\">Gritty and resourceful; you leverage tools and technology to sell strategically and efficiently</p></li><li><p style=\"min-height:1.5em\">Strong ability to interpret feedback and apply coaching quickly</p></li></ul><p style=\"min-height:1.5em\"></p><p style=\"min-height:1.5em\"><strong>What you can expect from our interview process</strong></p><p></p><ul style=\"min-height:1.5em\"><li><p style=\"min-height:1.5em\"><strong>Introductory calls: </strong>We will set up a 30-minute phone call with one of our recruiters and/or our Sales Leaders, during which you’ll have the opportunity to share more about your experience and interests. You’ll also learn more about BioRender and the team you’re interviewing with. Feel free to ask any questions throughout these calls!</p></li><li><p style=\"min-height:1.5em\"><strong>Practical interview: </strong>You’ll be completing a practical exercise so we can see your skills in action and give you a realistic role preview. This exercise will be conducted with our Sales Leaders.</p></li><li><p style=\"min-height:1.5em\"><strong>Work history interview: </strong>This is a conversational interview with our Sales Leaders. They will review your past work and educational experiences in chronological order - <a target=\"_blank\" rel=\"noopener noreferrer\" class=\"postings-link\" href=\"https://biorender.notion.site/biorender/Candidate-Guide-to-the-BioRender-Chronological-Interview-54c6e465502042a3870dddd614708c20\">you can read more about how to prepare for this interview here</a>!</p></li><li><p style=\"min-height:1.5em\"><strong>Meet the team: </strong>Throughout our interview process, you can expect to meet with some of your potential colleagues.</p></li></ul><p style=\"min-height:1.5em\"></p><p style=\"min-height:1.5em\"><strong>Why join us?</strong></p><p></p><ul style=\"min-height:1.5em\"><li><p style=\"min-height:1.5em\">We are mission-driven, and work collaboratively towards our shared vision of improving scientific communication and accelerating scientific discovery: BioRender figures have appeared in more than 16,000 publications! </p></li><li><p style=\"min-height:1.5em\">It’s a product that users love! We have a world-class NPS and a community of loyal fans. Check out our Testimonials page to see what our customers are saying about us: <a target=\"_blank\" rel=\"noopener noreferrer\" class=\"postings-link\" href=\"https://biorender.com/testimonials/\">https://biorender.com/testimonials/ </a></p></li><li><p style=\"min-height:1.5em\">We are in the top quartile for profitability and year-over-year revenue growth, with users in 200+ countries.</p></li><li><p style=\"min-height:1.5em\">BioRender is an equal opportunity employer, and an inclusive hiring process and work environment is a part of our DNA. </p></li><li><p style=\"min-height:1.5em\">We’re remote-first and have team members across Canada and the United States. A physical office in Toronto is available, but you have the flexibility to work from anywhere. </p></li><li><p style=\"min-height:1.5em\">We’re backed by top investors, accelerators, and some of the most successful life science entrepreneurs and philanthropists in the world including Y Combinator, Malala Fund founders, and Fifty Years VC. </p></li><li><p style=\"min-height:1.5em\">We are committed to building a warm, inclusive, and diverse environment. Check out how we make sure our <a target=\"_blank\" rel=\"noopener noreferrer\" class=\"postings-link\" href=\"https://www.biorender.com/biorender-careers\">employees come first</a>.</p></li></ul><p style=\"min-height:1.5em\"></p><p style=\"min-height:1.5em\">You can read more about the <a target=\"_blank\" rel=\"noopener noreferrer\" class=\"postings-link\" href=\"https://biorender.notion.site/BioRender-Candidate-Resources-8255c155797f442a950720a33b4764d5\">BioRender interview process and FAQs here</a>!</p><p></p>","tags":"[\"engineering\"]","pubDate":"2024-10-09 07:44:23.053","link":"https://jobs.ashbyhq.com/biorender/14469410-ed44-4288-8f6d-8c067d2afc76","savedDate":"2024-10-09 07:44:23.053","slug":"account-executive-remote-canada-us-biorender-7024"},{"id":8471334862,"title":"Enterprise Account Executive, US - West [IC5]","company":"Sourcegraph","image":"https://pbs.twimg.com/profile_images/1428393724527190022/4mt5PACL_400x400.png","description":"\n    <div class=\"content-intro\"><h2><strong><span style=\"color: #a112ff;\">Who we are</span></strong></h2>\n<p>Our mission at Sourcegraph is to make it so that <a href=\"https://www.notion.so/sourcegraph/Mission-values-e9d37e6b972a4ef395c3076aea2bd07d?pvs=4\">everyone can code</a>, not just ~0.1% of the population. We're building the code intelligence platform that powers the world's best code search and the most popular open-source code AI tool. It’s an exciting time to join Sourcegraph—AI has taken over the world, and we aim to automate 99% of the toil in software engineering with our code understanding and code AI tools, leaving the remaining 1% to the irreplicable creative spark from humans.&nbsp;</p>\n<p>Our customers range from startups to the Fortune 500, 4/5 FAANG companies, government organizations, Uber, Plaid, and more. We’ve raised $225M at a $2.625B valuation from <a href=\"https://techcrunch.com/2021/07/13/sourcegraph-raises-125m-series-d-on-2-6b-valuation-for-universal-code-search-tool/\">a16z</a>,<a href=\"https://about.sourcegraph.com/blog/series-c-with-sequoia/\"> Sequoia</a>, <a href=\"https://www.redpoint.com/companies/sourcegraph/\">Redpoint</a>, <a href=\"https://medium.com/craft-ventures/why-we-invested-in-sourcegraph-5ace28317e3d\">Craft</a> and others. We’re making ambitious bets on our future and we’re looking to hire exceptional people to join our team as we make Sourcegraph one of the biggest and most influential companies in the world.</p></div>\n\n    <h2><span style=\"color: rgb(161, 18, 255);\"><strong>Working hours&nbsp;</strong></span></h2>\n<p>🌎 While we are an all-remote company and hire <a href=\"https://sourcegraph.notion.site/How-we-engage-talent-outside-of-the-US-218f7193695a46cbb1ef39ef9c1f72d4\">almost anywhere</a> in the world, we do require successful candidates to be located in the United States, specifically on the West Coast.</p>\n<p><strong>Preferred location:</strong></p>\n<ul>\n<li>USA - West\n<ul>\n<li>San Francisco, CA</li>\n<li>Seattle, WA</li>\n<li>Denver, CO</li>\n<li>Austin, TX</li>\n</ul>\n</li>\n</ul>\n<h2><span style=\"color: rgb(161, 18, 255);\"><strong>Why this job is exciting</strong></span></h2>\n<p>As an Enterprise Account Executive, you will have more responsibility, upside, and growth potential than anywhere else otherwise comparable. We strive to make Sourcegraph the best company where exceptionally talented people can thrive. If you join us, we know you’ll make a big impact!&nbsp; Here’s what we’re thinking:</p>\n<p>Within one month, you will…&nbsp;</p>\n<ul>\n<li>Begin 1:1’s with your manager, understand your 30-60-90 plan, meet &amp; shadow current members of the Sourcegraph team, understand your quota, and delve into your territory.</li>\n<li>Build your territory plan to penetrate net-new logo accounts with a heavy emphasis on outbound and growing the footprint of your existing customers.</li>\n<li>Meet key partners in Customer Engineering, Technical Success, Product, Legal and Engineering teams - they will be key relationships for you throughout your deal cycle.</li>\n</ul>\n<p>Within three months, you will…</p>\n<ul>\n<li>Understand the superpowers that Sourcegraph provides a development organization, and create compelling strategies to align Sourcegraph value to your prospect’s goals, needs, and objectives.</li>\n<li>Be a product expert, perfect your storytelling of use cases, demonstrate the product and convey real-world success stories of customers</li>\n<li>Identify champions, influencers, and key stakeholders in the decision process, and build trusted advisor relationships with them to help bring more engineering organizations onto the Sourcegraph platform.&nbsp;</li>\n<li>Leverage a consistent sales process to continuously build and move pipeline forward (while regularly and accurately capturing updates and pipeline forecasts).</li>\n<li>Develop and negotiate complex enterprise level proposals and contracts.</li>\n<li>Work with our product team to be the voice of the customer and bring market insights to our roadmap.</li>\n<li>Consistently achieve your activity goals.&nbsp;</li>\n</ul>\n<p>Within six months, you will…</p>\n<ul>\n<li>Handle the full sales cycle to consistently meet and exceed pipeline and revenue objectives.</li>\n<li>Collaborate cross-functionally with Customer Engineering, Product, Legal and Engineering to successfully drive technically unique or complex Enterprise deals forward to completion.</li>\n<li>Deliver customer feedback to our teammates, including our engineers (who are the most customer-driven engineers you'll ever see--they care about making customers happy and closing deals!).</li>\n</ul>\n<p>Within one year, you will…</p>\n<ul>\n<li>Be considered a top-performing Account Executive on the team by consistently exceeding your goals.</li>\n<li>Set an example for new Account Executives, and assist in training, onboarding and motivating new Teammates.</li>\n</ul>\n<h2><strong><span style=\"color: rgb(161, 18, 255);\">About you</span>&nbsp;</strong></h2>\n<p>You are a results-oriented, motivated, and strategic ‘hunter’ who shares<a href=\"https://sourcegraph.notion.site/Mission-values-e9d37e6b972a4ef395c3076aea2bd07d\"> our values</a> and has a passion for all things sales. You are laser-focused on generating new greenfield business and expanding customer accounts as the world of CodeAI is in focus across the world’s leading enterprises. Specifically, you will play a pivotal role in helping us achieve our goals by winning high visibility deals and crushing your annual quota.&nbsp;&nbsp;</p>\n<p>You are a self-starter and thrive in an independent environment.&nbsp; You possess internal motivations to be the best at what you do and perform at the top of the leaderboard.</p>\n<p>Your skill-set:</p>\n<ul>\n<li>5+ years of enterprise technical sales experience, SaaS preferred</li>\n<li>Proven track record of exceeding sales quotas, while leading with empathy</li>\n<li>Experience selling products with ASP &gt;= $100k</li>\n<li>Stellar interpersonal, presentation, verbal, and written communication skills, across all levels and personas (be it with a developer, a CTO, another salesperson, or anyone in-between)</li>\n<li>Passionate about our mission and the potential for developers to improve the world</li>\n</ul>\n<p>Nice to haves:</p>\n<ul>\n<li>Selling developer products and working closely with developers</li>\n<li>Proficiency with software development concepts</li>\n<li>Converting freemium or trial usage to large commercial contracts</li>\n<li>Experience with complex multi-year contracts</li>\n<li>Proficiency with security, licensing, and compliance requirements</li>\n</ul>\n<h2><span style=\"color: rgb(161, 18, 255);\"><strong>Level</strong></span></h2>\n<p>📊 This job is an IC5. You can read more about <a href=\"https://www.notion.so/sourcegraph/Leveling-Guide-0e1b5c76ada64b9caac387f8b7c4fc66?pvs=4\">our job leveling philosophy</a> in our Handbook.</p>\n<h2><span style=\"color: rgb(161, 18, 255);\"><strong>Compensation</strong></span></h2>\n<p><strong>💸 We pay you an above-average salary</strong> because we want to hire the best people who are fully focused on helping Sourcegraph succeed, not worried about paying bills. As an <a href=\"https://sourcegraph.notion.site/Mission-values-e9d37e6b972a4ef395c3076aea2bd07d\">open and transparent</a> company that values <a href=\"https://www.notion.so/sourcegraph/Compensation-Pay-Transparency-at-Sourcegraph-d58d0774f51b4b489d41c3628d30ff8d\">competitive compensation</a>, our compensation ranges are visible to every single Sourcegraph teammate.&nbsp;To determine your salary, we use a number of market and data-driven salary sources, along with your location zone, and target the high-end of the range to ensure we’re always paying above market regardless of where you live in the world.&nbsp;</p>\n<p>💰The target compensation for this role is $165,000 USD base + $165,000 USD variable ($330,000 USD on-target-earnings).&nbsp;</p>\n<p>📈 In addition to our cash compensation, we offer equity (because when we succeed as a company, we want you to succeed, too) and generous <a href=\"https://sourcegraph.notion.site/Benefits-Perks-dd1da4b6b3a64780abed010a144d34ba\">perks &amp; benefits</a>.</p>\n<h2><span style=\"color: rgb(161, 18, 255);\"><strong>Interview process</strong></span></h2>\n<p><em>Below is the interview process you can expect for this role (you can read more about <a href=\"https://sourcegraph.notion.site/Types-of-interviews-f279f080583d49ee9f2c60e30c8cb1f7\">the types of interviews</a> in our Handbook). It may look like a lot of steps, but rest assured that we move quickly and the steps are designed to help you get the information needed to determine if we’re the right fit for you… Interviewing is a two-way street, after all!&nbsp;</em></p>\n<p>We expect the interview process to take 5.5 hours in total.</p>\n<p><strong>👋 Introduction Stage</strong> - we have initial conversations to get to know you better…</p>\n<ul>\n<li>[30 min] <a href=\"https://www.notion.so/sourcegraph/Types-of-interviews-sample-questions-f279f080583d49ee9f2c60e30c8cb1f7?pvs=4#99be5ff628b2414194a0ba79d9f25f13\">Recruiter Screen</a>&nbsp;with Kelsey Nagel</li>\n<li>[60 min]&nbsp;<a href=\"https://www.notion.so/sourcegraph/Types-of-interviews-sample-questions-f279f080583d49ee9f2c60e30c8cb1f7?pvs=4#1919882c0cf147c487eb1df40db8a694\">Hiring Manager screen</a> / <a href=\"https://www.notion.so/sourcegraph/Types-of-interviews-sample-questions-f279f080583d49ee9f2c60e30c8cb1f7?pvs=4#c678a2a86e0e47e4958507e869bf7ded\">Resume Deep Dive</a>&nbsp;with Jon Kishpaugh</li>\n</ul>\n<p><strong>🧑‍💻 Team Interview Stage</strong> - we then delve into your experience in more depth and introduce you to members of the team, including cross-functional partners…</p>\n<ul>\n<li>[30 min]&nbsp;<a href=\"https://www.notion.so/sourcegraph/Types-of-interviews-sample-questions-f279f080583d49ee9f2c60e30c8cb1f7?pvs=4#e3a04291743048df87541a88aa8199dd\">Values</a></li>\n<li>[45 min] <a href=\"https://www.notion.so/sourcegraph/Types-of-interviews-sample-questions-f279f080583d49ee9f2c60e30c8cb1f7?pvs=4#88b9f826dee04ef98afc2aeec35b877a\">Peer</a>&nbsp;with an Account Executive &amp; Customer Engineer</li>\n<li>[45 min] <a href=\"https://www.notion.so/sourcegraph/Sales-Interview-Process-3e8dd4fe14d845ffb44e2618f303365f?pvs=4#3eaf05ce8bb44b3584a14dd4c2d03fe9\">Sales Presentation</a> with Jon Kishpaugh, Account Executive &amp; Customer Engineer</li>\n</ul>\n<p><strong>🎉 Final Interview Stage </strong>- we move you to our final round, where you gain a better understanding of our business and values holistically</p>\n<ul>\n<li>30 min] <a href=\"https://www.notion.so/sourcegraph/Types-of-interviews-sample-questions-f279f080583d49ee9f2c60e30c8cb1f7?pvs=4#80e2ecaed5854b1ba510b2e391c0c67b\">Leadership</a> with VP, Sales, Brock Perko</li>\n<li>[30 min] <a href=\"https://www.notion.so/sourcegraph/How-to-work-with-Quinn-Slack-CEO-807673e0864d473f959cc4efd9642a5a?pvs=4#6f185c0e2011411eac5be9c675f9056c\">Co-founder &amp; CEO</a> with Quinn Slack</li>\n<li>We check references and conduct your background check</li>\n</ul>\n<p>Please note - you are welcome to request additional conversations with anyone you would like to meet, but didn’t get to meet during the interview process.</p>\n\n    \n\n    <div class=\"content-conclusion\"><h2><strong><span style=\"color: #a112ff;\">Learn more about us</span></strong></h2>\n<p>We want to ensure Sourcegraph is an environment that suits your working style and empowers you to do your best work, so we are eager to answer any questions that you have about us at any point in the interview process. You can learn more about what it is like to work at Sourcegraph by reading <a href=\"https://sourcegraph.notion.site/d7614e3e9dc04c09ac2d42d57f1816e6?v=2a6d426dbae14390b155120b0c029ce0\">our handbook</a>.</p>\n<p><span style=\"font-weight: 400;\">We provide </span><a href=\"https://sourcegraph.notion.site/Compensation-Pay-Transparency-at-Sourcegraph-d58d0774f51b4b489d41c3628d30ff8d?pvs=74\"><span style=\"font-weight: 400;\">competitive compensation</span></a><span style=\"font-weight: 400;\"> and </span><a href=\"https://sourcegraph.notion.site/Benefits-Perks-dd1da4b6b3a64780abed010a144d34ba?pvs=74\"><span style=\"font-weight: 400;\">practical benefits</span></a><span style=\"font-weight: 400;\"> to keep you happy and healthy so that you can do your best work.&nbsp;</span><span style=\"font-weight: 400;\">&nbsp;</span></p>\n<p>Sourcegraph is an equal opportunity workplace; we welcome people from all backgrounds.&nbsp;</p>\n<p><em>Sourcegraph participates in&nbsp;<a href=\"https://sourcegraph.notion.site/E-Verify-2ab3286dde3446d6bac2898c83610107\">E-Verify</a> for U.S. Employees.&nbsp;</em></p></div>\n","tags":"[\"engineering\",\"legal\"]","pubDate":"2024-10-09 07:44:23.049","link":"https://boards.greenhouse.io/sourcegraph91/jobs/5349205004","savedDate":"2024-10-09 07:44:23.049","slug":"enterprise-account-executive-us-west-ic5-sourcegraph-6148"},{"id":1568818637,"title":"Data Engineer","company":"Status","image":"https://avatars.githubusercontent.com/u/11767950?s=200&v=4","description":"\n    <div class=\"content-intro\"><p style=\"text-align: justify;\"><strong>About Status</strong></p>\n<p style=\"text-align: justify;\"><span style=\"font-weight: 400;\">Status is building the tools and infrastructure for the advancement of a secure, private, and open web3.&nbsp;</span></p>\n<p style=\"text-align: justify;\"><span style=\"font-weight: 400;\">With the high level goals of preserving the right to privacy, mitigating the risk of censorship, and promoting economic trade in a transparent, open manner, Status is building a community where anyone is welcome to join and contribute.</span></p>\n<p style=\"text-align: justify;\"><span style=\"font-weight: 400;\">As an organization, Status seeks to push the web3 ecosystem forward through research, creation of developer tools, and support of the open source community.&nbsp;</span></p>\n<p style=\"text-align: justify;\"><span style=\"font-weight: 400;\">As a product, Status is an open source, Ethereum-based app that gives users the power to chat, transact, and access a revolutionary world of Apps on the decentralized web. But Status is also building foundational infrastructure for the whole Ethereum ecosystem, including the Nimbus ETH 1.0 and 2.0 clients, the Keycard hardware wallet, and the Waku messaging protocol, the p2p communication layer for Web3.</span></p>\n<p style=\"text-align: justify;\"><span style=\"font-weight: 400;\">As a team, Status has been completely distributed since inception. Our team is currently 200+ core contributors strong, and welcomes a growing number of community members from all walks of life, scattered all around the globe.&nbsp;</span></p>\n<p style=\"text-align: justify;\"><span style=\"font-weight: 400;\">We care deeply about open source, and our organizational structure has minimal hierarchy and no fixed work hours. We believe in working with a high degree of autonomy while supporting the organization's priorities.</span></p></div>\n\n    <p><strong>About the Infrastructure Team</strong></p>\n<p>We’re a team scattered across the world, working to provide various tools and services for the projects in the company. We work asynchronously, with a high level of independence.</p>\n<p>We are seeking a Data Engineer to construct and maintain dynamic dashboards for our Open Source projects. The successful candidate will collect, analyze, and interpret data to provide actionable insights, enabling us to effectively track and improve our project progress.</p>\n<p>&nbsp;</p>\n<p><strong>Key responsibilities</strong></p>\n<ul>\n<li>Develop and implement data pipelines for Open Source Project development, communication campaigns, and finance overview</li>\n<li>Build visualization tools to track and analyze project progress, communication effectiveness, and financial health</li>\n<li>Accompany teams lead to identify key elements for KPI analysis</li>\n<li>Manage Data Warehouse to maintain data quality</li>\n</ul>\n<p><strong>You ideally will have&nbsp;</strong></p>\n<ul>\n<li>Experience with Data Pipeline implementation (DBT, Airflow, Airbyte)</li>\n<li>Experience with SQL optimization</li>\n<li>Experience with Python or other scripting languages</li>\n<li>Experience with Grafana or other visualization tools</li>\n<li>Experience in, and passion for, blockchain technology</li>\n<li>A strong alignment to our principles:&nbsp;<a href=\"https://status.app/manifesto\">https://status.app/manifesto</a></li>\n</ul>\n<p>&nbsp;</p>\n<p><strong>Bonus points if&nbsp;</strong></p>\n<ul>\n<li>Comfortable working remotely and asynchronously</li>\n<li>Experience working for an open source organization.&nbsp;&nbsp;</li>\n<li>Experience with Linux, Docker</li>\n<li>Experience with LLM fine-tuning</li>\n</ul>\n<p><em><span style=\"font-weight: 400;\">[Don’t worry if you don’t meet all of these criteria, we’d still love to hear from you anyway if you think you’d be a great fit for this role. Just explain to us why in your cover letter]</span></em></p>\n<p>&nbsp;</p>\n<p><strong>Hiring Process&nbsp;</strong></p>\n<ol>\n<li style=\"font-weight: 400;\"><span style=\"font-weight: 400;\">Interview with People Ops team</span></li>\n<li style=\"font-weight: 400;\"><span style=\"font-weight: 400;\">Technical Task</span></li>\n<li style=\"font-weight: 400;\"><span style=\"font-weight: 400;\">Interview with BI Team Lead</span></li>\n<li style=\"font-weight: 400;\"><span style=\"font-weight: 400;\">Interview with Infra Team Lead<br><br></span></li>\n</ol>\n<p><strong>Compensation</strong></p>\n<p>We are happy to pay in any mix of fiat/crypto.</p>\n\n    \n\n    \n","tags":"[\"Finance\"]","pubDate":"2024-10-09 07:44:23.049","link":"https://boards.greenhouse.io/embed/job_app?for=status72&token=6308385&b=https%3A%2F%2Fjobs.status.im%2F","savedDate":"2024-10-09 07:44:23.049","slug":"data-engineer-status-4117"},{"id":6902000603,"title":"CI/Testing Infrastructure Developer (Remote/Anywhere)","company":"Collabora","image":"https://media.licdn.com/dms/image/D4E0BAQFdRsd49YG4fQ/company-logo_200_200/0/1688735422027/collabora_logo?e=2147483647&v=beta&t=COQKgdesE_abHpZN-7BjhNZ1IKm2nhQyHB637TbP88E","description":"<div class=\"section page-centered\" data-qa=\"job-description\"><div>Collabora is currently looking for a very technically capable, enthusiastic and passionate Continuous Integration (CI) &amp; Testing Developer to join its ever-growing engineering team.</div><div><br></div><div>As a member of the CI &amp; Testing  team, your primary focus will be to participate in the development,  integration and deployment of Open Source Continuous Integration and  Automated Testing systems in upstream projects. The scope of the work ranges from hardware automation through LAVA, to systems like KernelCI and Mesa CI.</div></div><div class=\"section page-centered\"><div><h3>Responsibilities</h3><ul class=\"posting-requirements plain-list\"><ul><li>Analyse  a project's needs for automated testing and design an implementation plan to discuss with the upstream community and Collabora's customers</li><li>Monitor and identify areas of improvement for existing upstream Continuous Integration systems</li><li>Implement  the CI system by integrating the required dependencies, building the  code at test, deploying it to the device under testing, executing the  tests and distributing and presenting the results</li><li>Represent Collabora at conferences and trade shows to demonstrate and promote our leadership in the open source arena</li><li>Understand client needs and reconcile time constraints, available technologies and resources, and Open Source best practices</li></ul></ul></div></div><div class=\"section page-centered\"><div><h3>Desired Skills</h3><ul class=\"posting-requirements plain-list\"><ul><li>Good understanding of Continuous Integration systems</li><li>Experience with Gitlab CI/CD and/or GitHub Actions</li><li>Experience with Python and Python frameworks such as Django, Flask, FastAPI</li><li>Knowledge of open source development methodologies and relevant open source communities</li><li>Good English language skills (both verbal and written)</li><li>Ability to work and communicate in a fully distributed environment, completely online</li></ul></ul></div></div><div class=\"section page-centered\"><div><h3>Additional Skills - for some projects, possessing any of these skills can be very helpful</h3><ul class=\"posting-requirements plain-list\"><ul><li>Familiarity with the upstream Linux kernel development workflow</li><li>Embedded development experience (firmware, bootloaders, kernel, BSP)</li><li>Knowledge about OpenGL and/or Vulkan GPU drivers</li><li>Sysadmin/DevOps experience</li><li>Fluency with Kubernetes</li></ul></ul></div></div><div class=\"section page-centered\" data-qa=\"closing-description\"><div>Collabora  is a software consultancy specialising in bringing companies and the  Open Source community together. We combine years of Open Source software  leadership with an understanding of the challenges that businesses, non-profits and governments face. Collabora brings deep technical expertise in  system integration &amp; architecture, graphics, multimedia, web engines  and communications to a number of market verticals, including mobile,  IVI / automotive, set top box / smart TV, and a range of other  specialised embedded applications.</div><div><br></div><div>Collabora  has the unique business model of enabling enterprises to leverage Open  Source software in their solutions. Having worked with notable industry  leading companies in the automotive, aerospace and handset mobile  verticals amongst many others, Collabora has established a broad  customer portfolio.</div><div><br></div><div>#LI-Remote</div></div><div class=\"section page-centered last-section-apply\" data-qa=\"btn-apply-bottom\"><a class=\"postings-btn template-btn-submit hex-color\" data-qa=\"show-page-apply\" href=\"https://jobs.lever.co/collabora/7dd88e28-ffd5-4d6c-b54b-8a6c42cd7e85/apply\">Apply for this job</a></div>","tags":"[\"engineering\"]","pubDate":"2024-10-09 07:44:23.049","link":"https://jobs.lever.co/collabora/7dd88e28-ffd5-4d6c-b54b-8a6c42cd7e85","savedDate":"2024-10-09 07:44:23.049","slug":"ci-testing-infrastructure-developer-remote-anywhere-collabora-1677"},{"id":6898267593,"title":"Enterprise Account Executive, US - West [IC5]","company":"Sourcegraph","image":"https://pbs.twimg.com/profile_images/1428393724527190022/4mt5PACL_400x400.png","description":"\n    <div class=\"content-intro\"><h2><strong><span style=\"color: #a112ff;\">Who we are</span></strong></h2>\n<p>Our mission at Sourcegraph is to make it so that <a href=\"https://www.notion.so/sourcegraph/Mission-values-e9d37e6b972a4ef395c3076aea2bd07d?pvs=4\">everyone can code</a>, not just ~0.1% of the population. We're building the code intelligence platform that powers the world's best code search and the most popular open-source code AI tool. It’s an exciting time to join Sourcegraph—AI has taken over the world, and we aim to automate 99% of the toil in software engineering with our code understanding and code AI tools, leaving the remaining 1% to the irreplicable creative spark from humans.&nbsp;</p>\n<p>Our customers range from startups to the Fortune 500, 4/5 FAANG companies, government organizations, Uber, Plaid, and more. We’ve raised $225M at a $2.625B valuation from <a href=\"https://techcrunch.com/2021/07/13/sourcegraph-raises-125m-series-d-on-2-6b-valuation-for-universal-code-search-tool/\">a16z</a>,<a href=\"https://about.sourcegraph.com/blog/series-c-with-sequoia/\"> Sequoia</a>, <a href=\"https://www.redpoint.com/companies/sourcegraph/\">Redpoint</a>, <a href=\"https://medium.com/craft-ventures/why-we-invested-in-sourcegraph-5ace28317e3d\">Craft</a> and others. We’re making ambitious bets on our future and we’re looking to hire exceptional people to join our team as we make Sourcegraph one of the biggest and most influential companies in the world.</p></div>\n\n    <h2><span style=\"color: rgb(161, 18, 255);\"><strong>Working hours&nbsp;</strong></span></h2>\n<p>🌎 While we are an all-remote company and hire <a href=\"https://sourcegraph.notion.site/How-we-engage-talent-outside-of-the-US-218f7193695a46cbb1ef39ef9c1f72d4\">almost anywhere</a> in the world, we do require successful candidates to be located in the United States, specifically on the West Coast.</p>\n<p><strong>Preferred location:</strong></p>\n<ul>\n<li>USA - West\n<ul>\n<li>San Francisco, CA</li>\n<li>Seattle, WA</li>\n<li>Denver, CO</li>\n<li>Austin, TX</li>\n</ul>\n</li>\n</ul>\n<h2><span style=\"color: rgb(161, 18, 255);\"><strong>Why this job is exciting</strong></span></h2>\n<p>As an Enterprise Account Executive, you will have more responsibility, upside, and growth potential than anywhere else otherwise comparable. We strive to make Sourcegraph the best company where exceptionally talented people can thrive. If you join us, we know you’ll make a big impact!&nbsp; Here’s what we’re thinking:</p>\n<p>Within one month, you will…&nbsp;</p>\n<ul>\n<li>Begin 1:1’s with your manager, understand your 30-60-90 plan, meet &amp; shadow current members of the Sourcegraph team, understand your quota, and delve into your territory.</li>\n<li>Build your territory plan to penetrate net-new logo accounts with a heavy emphasis on outbound and growing the footprint of your existing customers.</li>\n<li>Meet key partners in Customer Engineering, Technical Success, Product, Legal and Engineering teams - they will be key relationships for you throughout your deal cycle.</li>\n</ul>\n<p>Within three months, you will…</p>\n<ul>\n<li>Understand the superpowers that Sourcegraph provides a development organization, and create compelling strategies to align Sourcegraph value to your prospect’s goals, needs, and objectives.</li>\n<li>Be a product expert, perfect your storytelling of use cases, demonstrate the product and convey real-world success stories of customers</li>\n<li>Identify champions, influencers, and key stakeholders in the decision process, and build trusted advisor relationships with them to help bring more engineering organizations onto the Sourcegraph platform.&nbsp;</li>\n<li>Leverage a consistent sales process to continuously build and move pipeline forward (while regularly and accurately capturing updates and pipeline forecasts).</li>\n<li>Develop and negotiate complex enterprise level proposals and contracts.</li>\n<li>Work with our product team to be the voice of the customer and bring market insights to our roadmap.</li>\n<li>Consistently achieve your activity goals.&nbsp;</li>\n</ul>\n<p>Within six months, you will…</p>\n<ul>\n<li>Handle the full sales cycle to consistently meet and exceed pipeline and revenue objectives.</li>\n<li>Collaborate cross-functionally with Customer Engineering, Product, Legal and Engineering to successfully drive technically unique or complex Enterprise deals forward to completion.</li>\n<li>Deliver customer feedback to our teammates, including our engineers (who are the most customer-driven engineers you'll ever see--they care about making customers happy and closing deals!).</li>\n</ul>\n<p>Within one year, you will…</p>\n<ul>\n<li>Be considered a top-performing Account Executive on the team by consistently exceeding your goals.</li>\n<li>Set an example for new Account Executives, and assist in training, onboarding and motivating new Teammates.</li>\n</ul>\n<h2><strong><span style=\"color: rgb(161, 18, 255);\">About you</span>&nbsp;</strong></h2>\n<p>You are a results-oriented, motivated, and strategic ‘hunter’ who shares<a href=\"https://sourcegraph.notion.site/Mission-values-e9d37e6b972a4ef395c3076aea2bd07d\"> our values</a> and has a passion for all things sales. You are laser-focused on generating new greenfield business and expanding customer accounts as the world of CodeAI is in focus across the world’s leading enterprises. Specifically, you will play a pivotal role in helping us achieve our goals by winning high visibility deals and crushing your annual quota.&nbsp;&nbsp;</p>\n<p>You are a self-starter and thrive in an independent environment.&nbsp; You possess internal motivations to be the best at what you do and perform at the top of the leaderboard.</p>\n<p>Your skill-set:</p>\n<ul>\n<li>5+ years of enterprise technical sales experience, SaaS preferred</li>\n<li>Proven track record of exceeding sales quotas, while leading with empathy</li>\n<li>Experience selling products with ASP &gt;= $100k</li>\n<li>Stellar interpersonal, presentation, verbal, and written communication skills, across all levels and personas (be it with a developer, a CTO, another salesperson, or anyone in-between)</li>\n<li>Passionate about our mission and the potential for developers to improve the world</li>\n</ul>\n<p>Nice to haves:</p>\n<ul>\n<li>Selling developer products and working closely with developers</li>\n<li>Proficiency with software development concepts</li>\n<li>Converting freemium or trial usage to large commercial contracts</li>\n<li>Experience with complex multi-year contracts</li>\n<li>Proficiency with security, licensing, and compliance requirements</li>\n</ul>\n<h2><span style=\"color: rgb(161, 18, 255);\"><strong>Level</strong></span></h2>\n<p>📊 This job is an IC5. You can read more about <a href=\"https://www.notion.so/sourcegraph/Leveling-Guide-0e1b5c76ada64b9caac387f8b7c4fc66?pvs=4\">our job leveling philosophy</a> in our Handbook.</p>\n<h2><span style=\"color: rgb(161, 18, 255);\"><strong>Compensation</strong></span></h2>\n<p><strong>💸 We pay you an above-average salary</strong> because we want to hire the best people who are fully focused on helping Sourcegraph succeed, not worried about paying bills. As an <a href=\"https://sourcegraph.notion.site/Mission-values-e9d37e6b972a4ef395c3076aea2bd07d\">open and transparent</a> company that values <a href=\"https://www.notion.so/sourcegraph/Compensation-Pay-Transparency-at-Sourcegraph-d58d0774f51b4b489d41c3628d30ff8d\">competitive compensation</a>, our compensation ranges are visible to every single Sourcegraph teammate.&nbsp;To determine your salary, we use a number of market and data-driven salary sources, along with your location zone, and target the high-end of the range to ensure we’re always paying above market regardless of where you live in the world.&nbsp;</p>\n<p>💰The target compensation for this role is $165,000 USD base + $165,000 USD variable ($330,000 USD on-target-earnings).&nbsp;</p>\n<p>📈 In addition to our cash compensation, we offer equity (because when we succeed as a company, we want you to succeed, too) and generous <a href=\"https://sourcegraph.notion.site/Benefits-Perks-dd1da4b6b3a64780abed010a144d34ba\">perks &amp; benefits</a>.</p>\n<h2><span style=\"color: rgb(161, 18, 255);\"><strong>Interview process</strong></span></h2>\n<p><em>Below is the interview process you can expect for this role (you can read more about <a href=\"https://sourcegraph.notion.site/Types-of-interviews-f279f080583d49ee9f2c60e30c8cb1f7\">the types of interviews</a> in our Handbook). It may look like a lot of steps, but rest assured that we move quickly and the steps are designed to help you get the information needed to determine if we’re the right fit for you… Interviewing is a two-way street, after all!&nbsp;</em></p>\n<p>We expect the interview process to take 5.5 hours in total.</p>\n<p><strong>👋 Introduction Stage</strong> - we have initial conversations to get to know you better…</p>\n<ul>\n<li>[30 min] <a href=\"https://www.notion.so/sourcegraph/Types-of-interviews-sample-questions-f279f080583d49ee9f2c60e30c8cb1f7?pvs=4#99be5ff628b2414194a0ba79d9f25f13\">Recruiter Screen</a>&nbsp;with Kelsey Nagel</li>\n<li>[60 min]&nbsp;<a href=\"https://www.notion.so/sourcegraph/Types-of-interviews-sample-questions-f279f080583d49ee9f2c60e30c8cb1f7?pvs=4#1919882c0cf147c487eb1df40db8a694\">Hiring Manager screen</a> / <a href=\"https://www.notion.so/sourcegraph/Types-of-interviews-sample-questions-f279f080583d49ee9f2c60e30c8cb1f7?pvs=4#c678a2a86e0e47e4958507e869bf7ded\">Resume Deep Dive</a>&nbsp;with Jon Kishpaugh</li>\n</ul>\n<p><strong>🧑‍💻 Team Interview Stage</strong> - we then delve into your experience in more depth and introduce you to members of the team, including cross-functional partners…</p>\n<ul>\n<li>[30 min]&nbsp;<a href=\"https://www.notion.so/sourcegraph/Types-of-interviews-sample-questions-f279f080583d49ee9f2c60e30c8cb1f7?pvs=4#e3a04291743048df87541a88aa8199dd\">Values</a></li>\n<li>[45 min] <a href=\"https://www.notion.so/sourcegraph/Types-of-interviews-sample-questions-f279f080583d49ee9f2c60e30c8cb1f7?pvs=4#88b9f826dee04ef98afc2aeec35b877a\">Peer</a>&nbsp;with an Account Executive &amp; Customer Engineer</li>\n<li>[45 min] <a href=\"https://www.notion.so/sourcegraph/Sales-Interview-Process-3e8dd4fe14d845ffb44e2618f303365f?pvs=4#3eaf05ce8bb44b3584a14dd4c2d03fe9\">Sales Presentation</a> with Jon Kishpaugh, Account Executive &amp; Customer Engineer</li>\n</ul>\n<p><strong>🎉 Final Interview Stage </strong>- we move you to our final round, where you gain a better understanding of our business and values holistically...</p>\n<ul>\n<li>[30 min]&nbsp;<a href=\"https://www.notion.so/sourcegraph/Types-of-interviews-sample-questions-f279f080583d49ee9f2c60e30c8cb1f7?pvs=4#80e2ecaed5854b1ba510b2e391c0c67b\">Leadership</a> with VP, Sales, Brock Perko</li>\n<li>[30 min] <a href=\"https://www.notion.so/sourcegraph/How-to-work-with-Quinn-Slack-CEO-807673e0864d473f959cc4efd9642a5a?pvs=4#6f185c0e2011411eac5be9c675f9056c\">Co-founder &amp; CEO</a> with Quinn Slack&nbsp;</li>\n<li>We check references and conduct your background check</li>\n</ul>\n<p>Please note - you are welcome to request additional conversations with anyone you would like to meet, but didn’t get to meet during the interview process.</p>\n\n    \n\n    <div class=\"content-conclusion\"><h2><strong><span style=\"color: #a112ff;\">Learn more about us</span></strong></h2>\n<p>We want to ensure Sourcegraph is an environment that suits your working style and empowers you to do your best work, so we are eager to answer any questions that you have about us at any point in the interview process. You can learn more about what it is like to work at Sourcegraph by reading <a href=\"https://sourcegraph.notion.site/d7614e3e9dc04c09ac2d42d57f1816e6?v=2a6d426dbae14390b155120b0c029ce0\">our handbook</a>.</p>\n<p><span style=\"font-weight: 400;\">We provide </span><a href=\"https://sourcegraph.notion.site/Compensation-Pay-Transparency-at-Sourcegraph-d58d0774f51b4b489d41c3628d30ff8d?pvs=74\"><span style=\"font-weight: 400;\">competitive compensation</span></a><span style=\"font-weight: 400;\"> and </span><a href=\"https://sourcegraph.notion.site/Benefits-Perks-dd1da4b6b3a64780abed010a144d34ba?pvs=74\"><span style=\"font-weight: 400;\">practical benefits</span></a><span style=\"font-weight: 400;\"> to keep you happy and healthy so that you can do your best work.&nbsp;</span><span style=\"font-weight: 400;\">&nbsp;</span></p>\n<p>Sourcegraph is an equal opportunity workplace; we welcome people from all backgrounds.&nbsp;</p>\n<p><em>Sourcegraph participates in&nbsp;<a href=\"https://sourcegraph.notion.site/E-Verify-2ab3286dde3446d6bac2898c83610107\">E-Verify</a> for U.S. Employees.&nbsp;</em></p></div>\n","tags":"[\"engineering\",\"legal\"]","pubDate":"2024-10-09 07:44:23.048","link":"https://boards.greenhouse.io/sourcegraph91/jobs/5349197004","savedDate":"2024-10-09 07:44:23.048","slug":"enterprise-account-executive-us-west-ic5-sourcegraph-6293"},{"id":3201855400,"title":"QA Tester","company":"Gameplaygalaxy","image":"https://remotive.com/job/1938722/logo","description":"<div><!--block-->We are looking for a detail-oriented <strong>QA Tester</strong> with experience in mobile games to join our team and who will be responsible for testing our games, identifying bugs and ensuring a smooth player experience. You’ll collaborate closely with the team to uphold our quality standards and contribute to creating a polished final product.</div><br><br><div class=\"h3\">All the responsibilities we'll trust you with:</div><ul style=\"\"><li style=\"\"><!--block-->You'll test the mobile game across various platforms (iOS, Android) to identify and report bugs, glitches, and gameplay issues.</li><li style=\"\"><!--block-->You’ll perform functional, regression, and performance testing to ensure game quality and stability.</li><li style=\"\"><!--block-->You’ll collaborate closely with developers, designers, and other QA team members to understand game features, mechanics, and design goals.</li><li style=\"\"><!--block-->You’ll write clear and detailed bug reports, including reproduction steps, expected results, and actual results.</li><li style=\"\"><!--block-->You’ll execute test plans, test cases, and checklists throughout the development cycle.</li><li style=\"\"><!--block-->You’ll participate in daily stand-ups, sprint planning, and team meetings to provide updates on testing progress and issues.</li><li style=\"\"><!--block-->You’ll ensure the game meets platform-specific guidelines and requirements (Apple, Google).</li><li style=\"\"><!--block-->You’ll conduct usability testing to ensure a smooth and enjoyable user experience.</li><li style=\"\"><!--block-->You’ll stay up-to-date with the latest trends in mobile gaming and QA methodologies.</li></ul><div><!--block--><br></div><br><br><div class=\"h3\">What you'll bring to the team:</div><ul style=\"\"><li style=\"\"><!--block-->At least 2 years of experience in QA for mobile games.</li><li style=\"\"><!--block-->Experience working with mobile devices, emulators, and debugging tools.</li><li style=\"\"><!--block-->Strong understanding of mobile platforms (iOS, Android) and their testing environments.</li><li style=\"\"><!--block-->Proficiency in bug tracking tool JIRA.</li><li style=\"\"><!--block-->Excellent attention to detail, with the ability to spot subtle issues in gameplay and UI.</li><li style=\"\"><!--block-->Knowledge of game development pipelines and agile workflows.</li><li style=\"\"><!--block-->Excellent English proficiency to collaborate effectively with our international team.</li><li style=\"\"><!--block-->Strong communication skills to effectively report and discuss issues with the development team.</li><li style=\"\"><!--block-->Passion for gaming, with a solid understanding of game mechanics and user experience principles.</li></ul><br><br><div class=\"h3\">Why you'll love working with us:</div><ul style=\"\"><li style=\"\"><!--block-->We’re 100% remote, work wherever you want forever!</li><li style=\"\"><!--block-->We offer unlimited holidays and sick days. Take as much time off as you need, to spend time with your family and friends or just because you feel like playing games all day. We trust our team and want to offer a modern work life balance that allows you to thrive both at work and in your personal life.</li><li style=\"\"><!--block-->You’ll be able to make an impact, to work closely with the rest of the team and its leads to work on one of the most promising upcoming games in the mobile gaming industry and the Web3 space.</li><li style=\"\"><!--block-->You’ll have a comfortable work schedule and stable workload. With a variety of tasks that will allow your constant professional development.</li><li style=\"\"><!--block-->We want our team to grow personally and professionally and support learning opportunities, especially with a focus around new AI tools and methods. </li><li style=\"\"><!--block-->We have a culture that puts our people first. We believe in open communication, creativity and the value of unique contributions from everyone in the team.</li><li style=\"\"><!--block-->We offer a competitive salary in addition to equity option plans.</li></ul><img src=\"https://remotive.com/job/track/1938722/blank.gif?source=public_api\" alt=\"\"/>","tags":"[\"android\",\"ios\",\"UI/UX\",\"AI/ML\",\"agile\",\"jira\",\"SOLID\",\"mobile gaming\",\"debugging\",\"apple\",\"testing\",\"REST\"]","pubDate":"2024-10-07 15:21:11.000","link":"https://remotive.com/remote-jobs/qa/qa-tester-1938722","savedDate":"2024-10-09 07:44:23.045","slug":"qa-tester-gameplaygalaxy-2375"},{"id":6048714723,"title":"Multilingual Sales Representative","company":"Jibble Group","image":"https://remotive.com/job/1941503/logo","description":"<div class=\"h2\"><strong>Our Mission</strong></div>\n<p>To help businesses save time and money, and unleash their human potential. Our vision is to power and empower millions of businesses with our software.</p>\n<div class=\"h2\"><strong>About Jibble Group</strong></div>\n<p>We're a scale-up in the Workforce Management space that has fully embraced remote work since 2017. Headquartered in London, UK, we have close to 80 staff in 16 different countries.<br><br>We launched PayrollPanda.my and Jibble.io in 2016 and 2017 respectively. PayrollPanda has become Malaysia's leading cloud payroll software, and Jibble an award-winning time clock solution, each with thousands of paying customers.<br><br><strong>About The Job</strong></p>\n<p>We are seeking eager, motivated Multilingual Sales Representative to join our growing organization.</p>\n<p>As a Sales Development Representative, you'll be the ultimate business matchmaker. You'll use your powers of persuasion and research to connect with new clients, build relationships, and create exciting opportunities for our sales team.  </p>\n<div class=\"h3\">Who we are looking for:</div>\n<ul style=\"\">\n<li style=\"\">Able to speak fluent English, Spanish, Portuguese and other languages</li>\n<li style=\"\">A motivated and self-driven individual with a startup-hustle mentality</li>\n<li style=\"\">Self-driven, analytical, structured and high attention to details</li>\n<li style=\"\">Great communication skills, enjoy talking to clients via the phone</li>\n<li style=\"\">Experience in B2B lead generation and sales is a plus</li>\n<li style=\"\">Excellent written and verbal communication skills</li>\n<li style=\"\">Possess a sales hunter personality</li>\n</ul>\n<div class=\"h3\">Your responsibilities will include:</div>\n<ul style=\"\">\n<li style=\"\">Research and identify new opportunities in key regions and verticals</li>\n<li style=\"\">Serve as a bridge between departments in order to optimise key business opportunities</li>\n<li style=\"\">To prepare and provide timely accurate reports and analysis to Management</li>\n<li style=\"\">Sell a portfolio of products demo by tailored with clients need</li>\n<li style=\"\">To do other task or jobs as assigned by the Management</li>\n</ul>\n<img src=\"https://remotive.com/job/track/1941503/blank.gif?source=public_api\" alt=\"\"/>","tags":"[\"cloud\",\"research\",\"payroll\",\"sales development\",\"startup\",\"lead generation\"]","pubDate":"2024-10-07 11:20:57.000","link":"https://remotive.com/remote-jobs/sales-business/multilingual-sales-representative-1941503","savedDate":"2024-10-09 07:44:23.045","slug":"multilingual-sales-representative-jibble-group-7614"},{"id":5395475198,"title":"Senior General Ledger Specialist","company":"Airalo","image":"https://lever-client-logos.s3.us-west-2.amazonaws.com/55028a36-609c-479c-9553-d4689ff2dd8c-1669620566663.png","description":"<div><b>About Airalo</b></div><div>Alo! Airalo is the world’s first eSIM store that helps people connect in over 200+ countries and regions across the globe. We are building the next digital service that revolutionizes the telecom industry. We are a travel-tech company and an equal-opportunity environment that values and executes diversity, inclusion, and equity. Our team is spread across 50+ countries and six continents. What glues us together is our commitment to changing the way you connect<span style=\"font-size: 13.3333px\">. </span></div><div><br></div><div><b>About you</b></div><div>We hope that you care deeply about the quality of your work, the intrinsic worth of tasks, and the success of your team. You are self-disciplined and do not require micromanagement in terms of your skillset and work ethic. You do your best to flourish as an individual every day while working hard to foster a collaborative team environment. You believe in the importance of being — and staying — authentic, honest, positive, and kind. You are a good interlocutor with clear and concise communication. You are able to manage multiple projects, have an analytical mind, pay keen attention to detail, and love to get your hands dirty. You are cognizant, tolerant, and welcoming of vulnerabilities and cultural differences.</div><div><br></div><div><b>About the Role</b></div><div><b>Position</b>: Full-time / Employee</div><div><b>Location:</b>&nbsp;Remote-first </div><div><b>Benefits:</b>&nbsp;Health Insurance, work-from-anywhere stipend, annual wellness &amp; learning credits, annual all-expenses-paid company retreat in a gorgeous destination &amp; other benefits</div><div><br></div><div><span style=\"font-size: 11pt;\">Airalo is seeking a GL pro to join our Finance team. Our finance team plays the huge role of ensuring the accurate and timely recording of finance information to assist the company in making strategic decisions.&nbsp; As Senior General Ledger Specialist at Airalo, you will be responsible for managing and overseeing all aspects of the general ledger accounting process, ensuring the accurate and timely recording of financial transactions and seeking ways to drive improvements and efficiencies to make your mark.&nbsp; </span></div><h3>Responsibilities include but are not limited to:</h3><li>Maintain and reconcile the general ledger accounts on a timely basis as well as, the preparation and posting of journal entries, accruals, and prepayments.</li><li>Manage the month-end and year-end close processes, ensuring deadlines are met and identify areas for improvement and efficiencies.</li><li>Generate and analyze financial reports, providing insights to support decision-making.</li><li>Reconcile balance sheet accounts, including bank reconciliations.</li><li>Investigate and resolve discrepancies, collaborating with other departments as needed.</li><li>Ensure compliance with accounting policies, procedures, and regulatory requirements.</li><li>Stay informed about changes in accounting standards and implement updates as necessary.</li><li>Collaborate with other departments to obtain necessary information and support financial reporting and management of statutory and internal audits.</li><li>Provide assistance to other finance team members as needed, including accounts receivable and accounts payable functions and, Mentor and provide guidance to junior accounting staff as needed.</li>,<h3>Must Haves</h3><li>Bachelor's degree in Accounting, Finance, or related field (with an accounting qualification (ACA, ACCA, etc)</li><li>5+ years of experience in general ledger accounting or a similar role.</li><li>Strong knowledge of accounting principles (GAAP/IFRS) and financial reporting.</li><li>Excellent analytical and problem-solving skills with high attention to detail.</li><li>Ability to collaborate effectively with cross-functional teams and manage multiple priorities.</li><li>Strong communication skills and the ability to meet tight deadlines.</li><div><span style=\"font-size: 11pt;\">If you are interested in this position, please apply via the link.</span></div><div><br></div><div>We sincerely thank all applicants in advance for submitting their interest in this opportunity. Airalo is an equal opportunity employer and values diversity, equity &amp; inclusion. We do not discriminate on the basis of race, religion, national origin, gender, sexual orientation, age, marital status, veteran status, or disability status. We are committed to providing reasonable accommodations upon request for individuals with disabilities throughout our job interview process.</div>","tags":"[\"Finance\",\"management\"]","pubDate":"2024-10-07 08:58:34.177","link":"https://jobs.lever.co/airalo/15a72ba6-cfa0-498c-aad9-9737bb48a14d","savedDate":"2024-10-09 07:44:23.053","slug":"senior-general-ledger-specialist-airalo-261"},{"id":9461906665,"title":"Security Architect (worldwide remote, work anywhere)","company":"CloudLinux","image":"https://pbs.twimg.com/profile_images/696718028084482050/ymY3OEPk_400x400.png","description":"<p>CloudLinux is a global remote-first company. We are driven by our principles: do the right thing, employees first, we are remote first, and we deliver high-volume, low-cost Linux infrastructure and security products that help companies to increase the efficiency of their operations. Every person on our team supports each other and does what we can to ensure we all are successful. We are truly a great place to work.</p><p>Check out our website for more information <a href=\"https://cloudlinux.com/\" rel=\"nofollow noreferrer noopener\" class=\"external\">https://cloudlinux.com/</a></p><p>We are looking for a Security Architect to lead the technical implementation of security measures across the company's infrastructure and software products. This role requires a deep understanding of security architecture, hands-on implementation, and operational security and will be central in driving technical decisions that protect the company’s assets.<br></p><p><strong>Key Responsibilities:</strong></p><ul> <li>Provide strategic leadership of the CloudLinux information security program and team. Promote collaborative, effective security working relationships across CloudLinux.</li> <li>Perform necessary actions to strengthen the current security environment.</li> <li>Take reasonable steps to guard against loss or compromise of the company's critical, valuable, and sensitive information and to effectively detect, respond to, and recover from information security incidents.</li> <li>Support a team of highly capable engineers that help product and infrastructure keep their code free from security bugs. Partner with engineering leaders across the company to help them prioritize security issues in their products and balance business goals.</li> <li>Interact directly with the security community regarding vulnerabilities and threats. Analyze, assess, and respond to various internet threats.</li> <li>Keep CloudLinux safe through active operation and defense of critical network infrastructure.</li> </ul><h3>Requirements: </h3><p><strong>To thrive in this role, we are looking for someone who has:</strong></p><ul> <li>5+ years of experience in information security.</li> <li>In-depth understanding of Linux/UNIX based systems.</li> <li>Solid understanding of programming languages such as C, PHP, Python, Golang, etc.</li> <li>Strong understanding of network security and commonly used protocols.</li> <li>Proven experience leading a security team, or demonstrated ability to lead and collaborate with cross-functional teams.</li> <li>Experience in security research and hands-on penetration testing.</li> <li>Strong communication skills in English.</li> </ul><p><br><strong>Personal Qualities:</strong></p><ul> <li>Strong problem-solving skills and attention to detail.</li> <li>Excellent communication skills.</li> <li>Ability to work under pressure and maintain a positive attitude.</li> <li>Strong organizational skills and ability to manage multiple tasks simultaneously.</li> <li>Critical thinking and commitment to high-quality standards.</li> <li>High level of initiative and ability to work independently while being a team player.</li> </ul><h3>Benefits: </h3><p><strong>What's in it for you?</strong></p><ul> <li>A focus on professional development.</li> <li>Interesting and challenging projects.</li> <li>Fully remote work with flexible working hours, that allows you to schedule your day and work from any location worldwide.</li> <li>Paid 24 days of vacation per year, 10 days of national holidays, and unlimited sick leaves.</li> <li>Compensation for private medical insurance.</li> <li>Co-working and gym/sports reimbursement.</li> <li>Budget for education.</li> <li>The opportunity to receive a reward for the most innovative idea that the company can patent.</li> </ul><p></p><p>By applying for this position, you agree with the <a href=\"https://cloudlinux.com/privacy-policy\" target=\"_blank\" rel=\"nofollow noreferrer noopener\" class=\"external\">Cloudlinux Privacy Policy</a> - <a href=\"https://cloudlinux.com/privacy-policy\" target=\"_blank\" rel=\"nofollow noreferrer noopener\" class=\"external\">https://cloudlinux.com/privacy-policy</a> and give us your consent to maintain and process your personal data in this respect. Please read our <a href=\"https://cloudlinux.com/privacy-policy\" target=\"_blank\" rel=\"nofollow noreferrer noopener\" class=\"external\">Privacy Policy</a> for more information.</p>","tags":"[\"engineering\"]","pubDate":"2024-10-07 00:00:00.000","link":"https://apply.workable.com/cloudlinux-1/j/911E11AE3C","savedDate":"2024-10-09 07:44:23.050","slug":"security-architect-worldwide-remote-work-anywhere-cloudlinux-7079"},{"id":3266266013,"title":"Solutions Architect (Insurance) - Fully Remote","company":"CoverGo","image":"https://pbs.twimg.com/profile_images/1382655628523364355/MWPIbbID_400x400.jpg","description":"<p><strong>Top 3 Reasons To Join Us</strong></p><ul> <li>International Environment</li> <li>Fully Remote</li> <li>Working on the latest tech for the Insurtech Market Leader</li> </ul><p><strong>About Us</strong></p><p>At CoverGo, our mission is to empower all insurance companies to make insurance 100% digital and accessible to everyone.</p><ul> <li>We are a leading global no-code insurance platform for health, life, and P&amp;C</li> <li>We’re the winner of the Insurtech of the Year in all of Asia and other awards globally</li> <li>We work with insurance enterprise clients such as AXA, Bupa, MSIG, Dai-ichi, Bank of China Group Insurance, and many more</li> <li>We're an international, diverse team of over 120 people with 30 nationalities and team members working remotely from all over the world</li> <li>We are fully funded and backed by reputable VC funds and strategic institutional investors</li> <li>We have a global presence in Asia, EMEA and the Americas</li> <li>We’ve grown our annualized revenue by over 30x since January 2021</li> <li>We’re constantly working towards making CoverGo a workplace that you love coming to. We deeply believe that bringing together a diversity of thoughts, expressions, and perspectives is key to building the best culture for equally diverse communities all over the world</li> </ul><p><strong>About the Role</strong></p><p>A cloud technology-focused individual providing design and delivery expertise for forward-looking solutions in a modern cloud-based insurance environment. The successful candidate will work directly with clients, assessing their needs, designing tailored solutions, and supporting business initiatives in alignment with defined roadmaps. This role is technology agnostic but emphasizes solutions leveraging heavily on AWS and/or GCP environments, incorporating elements of open-source, PaaS, and SaaS components.</p><p><strong>What You Will Do</strong></p><ul> <li>Engage with clients to understand their requirements and advise on appropriate solution architectures</li> <li>Collaborate with Product Managers to ensure alignment between client needs and solution design</li> <li>Work closely with Delivery Managers to oversee the architecture approach during solution deployment</li> <li>Explore a range of possibilities and creative alternatives to identify the most effective solutions</li> <li>Ensure that designed solutions are implemented in accordance with client expectations and company standards</li> <li>Assist in identifying, specifying, and selecting off-the-shelf components to meet client needs</li> <li>Provide ongoing support and guidance to clients throughout the implementation process</li> <li>Maintain awareness of industry trends and emerging technologies to continuously improve solutions</li> </ul><p><strong>Required Skills and Knowledge</strong></p><ul> <li>At least 6 years of professional experience in solution architecture design and delivery roles in the insurance vertical with exposure to multiple lines of business</li> <li>Experienced in delivering cloud-based technology product solutions in an enterprise environment</li> <li>Ability to assist in defining and socialising a product/enterprise roadmap</li> <li>Ability to translate client requirements into actionable steps and solution architectures</li> <li>Understand business architecture models &amp; patterns</li> <li>Has designed and implemented innovative and creative solutions to business problems</li> <li>Can think \"outside the box\", but also be able to understand the business constraints that lead to “in the box” approaches</li> <li>Understand the optimum approaches for cloud-based applications with high availability and highly scalable solutions</li> <li>Experienced in designing solutions in a Relational DB and noSQL environment&nbsp;</li> <li>Experienced in designing for API &amp; Micro-services centric environments&nbsp;</li> <li>Demonstrated capability to self-learn new technology trends and approaches</li> <li>Ideally has experience or understanding of the benefits of low-code platforms&nbsp;</li> <li>While the Solution Architect is not expected to build the solutions experience of multiple development languages &amp; various DB engines will be advantageous</li> <li>Exposure to authentication and authorisation concepts (SSO, SAML integration, identity federation etc)</li> <li>Excellent communication skills, both written and verbal</li> </ul><p><strong>Required Competencies</strong></p><ul> <li>Must be equally comfortable discussing the solution strategies and enterprise roadmap with people at all levels of our organisation and CxO to project-level teams in our clients</li> <li>Strong analytical skills &amp; ability to understand and collect business requirements from corporate clients.</li> <li>Strong ability to build the value proposition and solution documents, and in some cases, the business case for a corporate client.</li> <li>Relationship management experience with corporate clients.</li> <li>Excellent organisational, interpersonal &amp; communication skills and an ability to engage audiences</li> <li>Excellent decision-making and judgment skills</li> <li>Understanding of insurance business processes across all areas and at least two lines of business</li> <li>Maintains direction and focus through proactive planning and organized approaches to work</li> <li>Certification in one architecture discipline (TOGAF, Zachman, etc.) is a distinct advantage</li> <li>Certification in one cloud environment is a distinct advantage with a broad knowledge and experience of the cloud platform’s capabilities</li> <li>A high proficiency in working in English as your primary language</li> </ul><p><strong>Why You'll Love Working Here</strong></p><ul> <li>Competitive remuneration package</li> <li>15 days annual leave</li> <li>Annual Performance Bonus</li> <li>Stock Options after 6 months</li> <li>Company activities and events</li> <li>Learning and development plan</li> <li>Remote work allowance</li> <li>Anniversary Bonus</li> </ul><p><strong>CoverGo Company</strong><a href=\"https://www.youtube.com/watch?v=YI0ezLxvFvA\" rel=\"nofollow noreferrer noopener\" class=\"external\"><strong> Video</strong></a></p><p>By submitting your application, you confirm that you have read, understood, and accepted the content of CoverGo’s <a href=\"https://apply.workable.com/covergo/gdpr_policy?lng=en\" target=\"_blank\" rel=\"nofollow noreferrer noopener\" class=\"external\">Privacy Notice</a> and you consent to the processing of your data as part of this application.</p><h3>Requirements: </h3><h3>Benefits: </h3>","tags":"[\"management\",\"aws\"]","pubDate":"2024-10-04 00:00:00.000","link":"https://apply.workable.com/covergo/j/B4E7A10269","savedDate":"2024-10-09 07:44:23.051","slug":"solutions-architect-insurance-fully-remote-covergo-7723"},{"id":8256802637,"title":"Solutions Architect (Insurance) - Fully Remote","company":"CoverGo","image":"https://pbs.twimg.com/profile_images/1382655628523364355/MWPIbbID_400x400.jpg","description":"<p><strong>Top 3 Reasons To Join Us</strong></p><ul> <li>International Environment</li> <li>Fully Remote</li> <li>Working on the latest tech for the Insurtech Market Leader</li> </ul><p><strong>About Us</strong></p><p>At CoverGo, our mission is to empower all insurance companies to make insurance 100% digital and accessible to everyone.</p><ul> <li>We are a leading global no-code insurance platform for health, life, and P&amp;C</li> <li>We’re the winner of the Insurtech of the Year in all of Asia and other awards globally</li> <li>We work with insurance enterprise clients such as AXA, Bupa, MSIG, Dai-ichi, Bank of China Group Insurance, and many more</li> <li>We're an international, diverse team of over 120 people with 30 nationalities and team members working remotely from all over the world</li> <li>We are fully funded and backed by reputable VC funds and strategic institutional investors</li> <li>We have a global presence in Asia, EMEA and the Americas</li> <li>We’ve grown our annualized revenue by over 30x since January 2021</li> <li>We’re constantly working towards making CoverGo a workplace that you love coming to. We deeply believe that bringing together a diversity of thoughts, expressions, and perspectives is key to building the best culture for equally diverse communities all over the world</li> </ul><p><strong>About the Role</strong></p><p>A cloud technology-focused individual providing design and delivery expertise for forward-looking solutions in a modern cloud-based insurance environment. The successful candidate will work directly with clients, assessing their needs, designing tailored solutions, and supporting business initiatives in alignment with defined roadmaps. This role is technology agnostic but emphasizes solutions leveraging heavily on AWS and/or GCP environments, incorporating elements of open-source, PaaS, and SaaS components.</p><p><strong>What You Will Do</strong></p><ul> <li>Engage with clients to understand their requirements and advise on appropriate solution architectures</li> <li>Collaborate with Product Managers to ensure alignment between client needs and solution design</li> <li>Work closely with Delivery Managers to oversee the architecture approach during solution deployment</li> <li>Explore a range of possibilities and creative alternatives to identify the most effective solutions</li> <li>Ensure that designed solutions are implemented in accordance with client expectations and company standards</li> <li>Assist in identifying, specifying, and selecting off-the-shelf components to meet client needs</li> <li>Provide ongoing support and guidance to clients throughout the implementation process</li> <li>Maintain awareness of industry trends and emerging technologies to continuously improve solutions</li> </ul><p><strong>Required Skills and Knowledge</strong></p><ul> <li>At least 6 years of professional experience in solution architecture design and delivery roles in the insurance vertical with exposure to multiple lines of business</li> <li>Experienced in delivering cloud-based technology product solutions in an enterprise environment</li> <li>Ability to assist in defining and socialising a product/enterprise roadmap</li> <li>Ability to translate client requirements into actionable steps and solution architectures</li> <li>Understand business architecture models &amp; patterns</li> <li>Has designed and implemented innovative and creative solutions to business problems</li> <li>Can think \"outside the box\", but also be able to understand the business constraints that lead to “in the box” approaches</li> <li>Understand the optimum approaches for cloud-based applications with high availability and highly scalable solutions</li> <li>Experienced in designing solutions in a Relational DB and noSQL environment&nbsp;</li> <li>Experienced in designing for API &amp; Micro-services centric environments&nbsp;</li> <li>Demonstrated capability to self-learn new technology trends and approaches</li> <li>Ideally has experience or understanding of the benefits of low-code platforms&nbsp;</li> <li>While the Solution Architect is not expected to build the solutions experience of multiple development languages &amp; various DB engines will be advantageous</li> <li>Exposure to authentication and authorisation concepts (SSO, SAML integration, identity federation etc)</li> <li>Excellent communication skills, both written and verbal</li> </ul><p><strong>Required Competencies</strong></p><ul> <li>Must be equally comfortable discussing the solution strategies and enterprise roadmap with people at all levels of our organisation and CxO to project-level teams in our clients</li> <li>Strong analytical skills &amp; ability to understand and collect business requirements from corporate clients.</li> <li>Strong ability to build the value proposition and solution documents, and in some cases, the business case for a corporate client.</li> <li>Relationship management experience with corporate clients.</li> <li>Excellent organisational, interpersonal &amp; communication skills and an ability to engage audiences</li> <li>Excellent decision-making and judgment skills</li> <li>Understanding of insurance business processes across all areas and at least two lines of business</li> <li>Maintains direction and focus through proactive planning and organized approaches to work</li> <li>Certification in one architecture discipline (TOGAF, Zachman, etc.) is a distinct advantage</li> <li>Certification in one cloud environment is a distinct advantage with a broad knowledge and experience of the cloud platform’s capabilities</li> <li>A high proficiency in working in English as your primary language</li> </ul><p><strong>Why You'll Love Working Here</strong></p><ul> <li>Competitive remuneration package</li> <li>15 days annual leave</li> <li>Annual Performance Bonus</li> <li>Stock Options after 6 months</li> <li>Company activities and events</li> <li>Learning and development plan</li> <li>Remote work allowance</li> <li>Anniversary Bonus</li> </ul><p><strong>CoverGo Company</strong><a href=\"https://www.youtube.com/watch?v=YI0ezLxvFvA\" rel=\"nofollow noreferrer noopener\" class=\"external\"><strong> Video</strong></a></p><p>By submitting your application, you confirm that you have read, understood, and accepted the content of CoverGo’s <a href=\"https://apply.workable.com/covergo/gdpr_policy?lng=en\" target=\"_blank\" rel=\"nofollow noreferrer noopener\" class=\"external\">Privacy Notice</a> and you consent to the processing of your data as part of this application.</p><h3>Requirements: </h3><h3>Benefits: </h3>","tags":"[\"management\",\"aws\"]","pubDate":"2024-10-04 00:00:00.000","link":"https://apply.workable.com/covergo/j/0952735D27","savedDate":"2024-10-09 07:44:23.051","slug":"solutions-architect-insurance-fully-remote-covergo-3252"},{"id":5539710758,"title":"Marketing Intern - Immediate Hire (Fully Remote)","company":"CoverGo","image":"https://pbs.twimg.com/profile_images/1382655628523364355/MWPIbbID_400x400.jpg","description":"<p><strong>Top 3 Reasons To Join Us</strong></p><ul> <li>International Environment</li> <li>100% Remote</li> <li>Working on the latest tech for the Insurtech Market Leader</li> </ul><p><strong>About Us</strong></p><p>At CoverGo, our mission is to empower all insurance companies to make insurance 100% digital and accessible to everyone.</p><ul> <li>We are a leading global no-code insurance platform for health, life, and P&amp;C</li> <li>We’re the winner of the Insurtech of the Year in all of Asia and other awards globally</li> <li>We work with insurance enterprise clients such as AXA, Bupa, MSIG, Dai-ichi, Bank of China Group Insurance, and many more</li> <li>We're an international, diverse team of over 120 people with 30 nationalities and team members working remotely from all over the world</li> <li>We are fully funded and backed by reputable VC funds and strategic institutional investors</li> <li>We have a global presence in Asia, EMEA and the Americas</li> <li>We’ve grown our annualized revenue by over 30x since January 2021</li> <li>We’re constantly working towards making CoverGo a workplace that you love coming to. We deeply believe that bringing together a diversity of thoughts, expressions, and perspectives is key to building the best culture for equally diverse communities all over the world and a workplace that you love coming to. We deeply believe that bringing together a diversity of thoughts, expressions, and perspectives is key to building the best culture for equally diverse communities all over the world</li> </ul><p><strong>About the Role</strong></p><p>As a Marketing Intern, you will support the development and execution of brand and product marketing strategies to enhance awareness and engagement. Your responsibilities will include conducting market research, creating marketing materials, and maintaining the company’s digital presence for consistent messaging. You will also participate in brainstorming sessions and monitor campaign performance to contribute innovative ideas to the team.</p><p><strong>What You Will Do</strong></p><ul> <li>Assist in the development and execution of brand and product marketing strategies to enhance brand awareness, product knowledge&nbsp; and engagement.</li> <li>Support the marketing team with research and analysis of market trends, competitor activities, and customer preferences.</li> <li>Collaborate on the creation of marketing materials, including social media content, newsletters, product marketing collaterals, and promotional campaigns.</li> <li>Help maintain and update the company's digital presence, ensuring consistency in brand messaging across all platforms.</li> <li>Participate in team brainstorming sessions to generate fresh ideas for marketing initiatives.</li> <li>Monitor and report on the performance of marketing campaigns, providing insights for improvement.</li> <li>Stay informed about current marketing trends and best practices to contribute innovative ideas to the team.</li> </ul><p><strong>What We Need</strong></p><ul> <li>Currently pursuing or recently completed a degree in Marketing, Communications, Business, or a related field.</li> <li>Previous internship or experience in marketing, branding, or a related area is a plus.</li> <li>Strong understanding of digital marketing strategies.</li> <li>Excellent verbal and written communication skills.</li> <li>Detail-oriented with the ability to manage multiple tasks and deadlines in a fast-paced environment.</li> <li>Proficient in Google Workspace; familiarity with design tools (e.g., Canva, Adobe Creative Suite) is a plus.</li> <li>A proactive attitude and willingness to learn and grow within the field.</li> </ul><p>Note: This internship opportunity is unpaid.</p><p><strong>Why You'll Love Working Here</strong></p><ul> <li>Fully Remote</li> <li>International team</li> <li>Company activities and events</li> </ul><p><strong>CoverGo Company&nbsp;</strong><a href=\"https://www.youtube.com/watch?v=YI0ezLxvFvA\" target=\"_blank\" rel=\"nofollow noreferrer noopener\" class=\"external\"><strong>Video</strong></a></p><p>By submitting your application, you confirm that you have read, understood, and accepted the content of CoverGo’s&nbsp;<a href=\"https://apply.workable.com/covergo/gdpr_policy?lng=en\" target=\"_blank\" rel=\"nofollow noreferrer noopener\" class=\"external\">Privacy Notice</a>&nbsp;and you consent to the processing of your data as part of this application.<a href=\"https://apply.workable.com/covergo/j/B86D963384/apply/\" rel=\"nofollow noreferrer noopener\" class=\"external\"></a></p><h3>Requirements: </h3><h3>Benefits: </h3>","tags":"[]","pubDate":"2024-10-04 00:00:00.000","link":"https://apply.workable.com/covergo/j/82AA53B1A1","savedDate":"2024-10-09 07:44:23.052","slug":"marketing-intern-immediate-hire-fully-remote-covergo-519"},{"id":1013892399,"title":"Head of Strategic Partnerships (Telecom) - APAC","company":"Airalo","image":"https://lever-client-logos.s3.us-west-2.amazonaws.com/55028a36-609c-479c-9553-d4689ff2dd8c-1669620566663.png","description":"<div><b>About Airalo</b></div><div>Alo! Airalo is the world’s first eSIM store that helps people connect in over 200+ countries and regions across the globe. We are building the next digital service that revolutionizes the telecom industry. We are a travel-tech company and an equal-opportunity environment that values and executes diversity, inclusion, and equity. Our team is spread across 50+ countries and six continents. What glues us together is our commitment to changing the way you connect<span style=\"font-size: 13.3333px\">. </span></div><div><br></div><div><b>About you</b></div><div>We hope that you care deeply about the quality of your work, the intrinsic worth of tasks, and the success of your team. You are self-disciplined and do not require micromanagement in terms of your skillset and work ethic. You do your best to flourish as an individual every day while working hard to foster a collaborative team environment. You believe in the importance of being — and staying — authentic, honest, positive, and kind. You are a good interlocutor with clear and concise communication. You are able to manage multiple projects, have an analytical mind, pay keen attention to detail, and love to get your hands dirty. You are cognizant, tolerant, and welcoming of vulnerabilities and cultural differences.</div><div><br></div><div><b>About the Role</b></div><div><b>Position</b>: Full-time / Employee</div><div><b>Location:</b>&nbsp;Remote-first </div><div><b>Benefits:</b>&nbsp;Health Insurance, work-from-anywhere stipend, annual wellness &amp; learning credits, annual all-expenses-paid company retreat in a gorgeous destination &amp; other benefits</div><div><br></div><div>We are looking for a partnerships superstar to join the Airalo Partnerships department.</div><div>The undisputed industry leader in the B2C segment in the eSIM industry, we are now looking to expand our presence in the B2B2C and B2B space to bring the eSIM revolution to adjacent industries.</div><div>As the Head of Strategic Partnerships for APAC, you will lead partnerships with medium to large businesses in APAC across the telecom and other adjacent industries to offer Airalo’s travel connectivity solutions to their end customers.</div><h3>Responsibilities include but are not limited to:</h3><li>Work closely with our Director/VP of Partnerships and other team members in the department</li><li>Find, identify, prospect and lead negotiations with potential partners to support Airalo’s market penetration efforts</li><li>Onboard and support new partners as they join the Airalo partner community</li><li>Maintain relationships with key partners to drive partner profitability and grow the B2B/B2B2C channel contribution to the business</li><li>Conduct competitive research and refine the Airalo Partnerships roadmap to maintain Airalo’s status as the preferred provider across industry partners</li><li>Collaborate and work with different internal and external stakeholders to develop and execute projects/opportunities successfully</li><li>Represent Airalo at travel and telecom events and conferences</li><li>Own the Airalo Strategic Partnerships OKRs</li>,<h3>Must Have:</h3><li>7+ years of experience in partnerships, sales, account management or business development in the Telecom industry in a B2B and/or B2B2C environment</li><li>Partner-first mentality and a genuine passion to help your stakeholders succeed while creating a win-win relationships</li><li>Ability to narrate a good story - Airalo’s unique story and the problem we solve for our users makes it a compelling partnership proposition</li><li>Ability to employ sales techniques, including effective questioning, objection handling, consultative selling, and solution selling</li><li>Ability to develop thought leadership skills and build trust with stakeholders</li><li>Ability to multi-task in a complex &amp; matrix environment</li><li>Experience with sales and partnerships tools</li><li>Perfect verbal and written communication skills in English</li><div><br></div><li><b>Good to have:</b></li><li>Prior work experience in a consumer tech company</li><li>Experience in building and leading a team</li><li>Graduate degree in a related field</li><li>Certificates and courses in sales and partnerships</li><li>Verbal and written ability in additional languages</li><div>If you are interested in this position, <b>please apply via the link.</b></div><div><br></div><div>We sincerely thank all applicants in advance for submitting their interest in this opportunity. Airalo is an equal opportunity employer and values diversity, equity &amp; inclusion. We do not discriminate on the basis of race, religion, national origin, gender, sexual orientation, age, marital status, veteran status, or disability status. We are committed to providing reasonable accommodations upon request for individuals with disabilities throughout our job interview process.</div>","tags":"[\"management\",\"B2C\",\"B2B\"]","pubDate":"2024-09-24 08:58:26.517","link":"https://jobs.lever.co/airalo/941f3ea4-e63b-47c5-aaad-f5d6fa1232f5","savedDate":"2024-10-09 07:44:23.052","slug":"head-of-strategic-partnerships-telecom-apac-airalo-6856"}]