[{"id":9232316811,"title":"Account Manager","company":"Empower","image":"https://lever-client-logos.s3.us-west-2.amazonaws.com/2e1a369c-b58f-41ac-8d86-4b0a77695e68-1687915522032.png","description":"<p style=\"min-height:1.5em\"><strong>EMPOWER OVERVIEW</strong></p><p style=\"min-height:1.5em\"><a target=\"_blank\" rel=\"noopener noreferrer nofollow\" href=\"http://empower.me/\">Empower</a> is shaking up an outdated financial system by providing real opportunity for our customers: the opportunity to get the cash they need, to access fair credit, and to change their financial story. Today, we’re helping millions of people find financial security through machine learning models that evaluate creditworthiness using a more inclusive lens and mobile-first products: Cash Advance, Thrive line of credit, and Petal credit cards. Tomorrow? Creating even more financial paths for our customers (and their wallets) to succeed.</p><p style=\"min-height:1.5em\">This year, Empower ranked #65 on Inc. 5000’s Fastest-Growing Private Companies list — our third year in a row cracking the top 100 — and was named by Forbes as one of the 25 Next Billion-Dollar Startups for 2024. Empower was also featured by Forbes on America’s Best Startup Employers list in 2023, and our Thrive line of credit product was named by Fast Company as one of 2022’s Next Big Things in Tech.</p><p style=\"min-height:1.5em\">Empower is backed by Sequoia Capital, Blisce, and Icon Ventures. Ready to grow your impact and accelerate your career? Take a look at our open roles — we can’t wait to meet you.</p><p style=\"min-height:1.5em\"></p><p style=\"min-height:1.5em\"><strong>THE EMPOWER WAY</strong></p><p style=\"min-height:1.5em\"><strong>Great Expectations</strong>: We come up with bold, audacious goals for ourselves and go all out for impact</p><p style=\"min-height:1.5em\"><strong>Owner Mindset</strong>: We give every employee latitude to act independently, make smart choices, and move the business forward</p><p style=\"min-height:1.5em\"><strong>Spirited Debate</strong>: We love skeptics and seek counter opinions to challenge our personal assumptions and expand our view</p><p style=\"min-height:1.5em\"><strong>Customer Obsession:</strong> We listen to understand, empathize, and create a memorable, rewarding experience for our community</p><p style=\"min-height:1.5em\"><strong>Inclusive Collaboration</strong>: We believe diverse teams make the best decisions, and we strive to give diverse voices a seat at the table</p><p style=\"min-height:1.5em\"><strong>No Jerks Allowed</strong>: We value our relationships and take the time to build trust and connection and communicate respectfully</p><p style=\"min-height:1.5em\"></p><p style=\"min-height:1.5em\"><strong>WHAT EMPOWER OFFERS</strong></p><p style=\"min-height:1.5em\">Competitive salary</p><p style=\"min-height:1.5em\">Generous equity package</p><p style=\"min-height:1.5em\">Full healthcare benefits</p><p style=\"min-height:1.5em\">Technology expense reimbursement</p><p style=\"min-height:1.5em\">Work from anywhere</p><p style=\"min-height:1.5em\"></p><p style=\"min-height:1.5em\"><strong>THE ROLE</strong></p><p style=\"min-height:1.5em\">Join our Finance team as an Account Manager and play a pivotal role in constructing a top-notch accounting foundation alongside our Chief Accounting Officer. You'll be more than just a member of the team; you'll be at the forefront, shaping the growth and success of our accounting department. Embrace the chance to make a lasting impact within a team that values your contribution and enables you to carve out a significant place in our evolving financial landscape.</p><p style=\"min-height:1.5em\"></p><p style=\"min-height:1.5em\"><strong>RESPONSIBILITIES</strong></p><ul style=\"min-height:1.5em\"><li><p style=\"min-height:1.5em\">Prepare and review journal entries as part of constructing a well-developed accounting framework in collaboration with the Chief Accounting Officer.</p></li><li><p style=\"min-height:1.5em\">Prepare and meticulously review account reconciliations, and take action in researching and resolving any discrepancies you discover.</p></li><li><p style=\"min-height:1.5em\">Assist with the management of department projects by implementing new systems and spearheading process improvement initiatives to bolster the efficiency and performance of our accounting practices.</p></li><li><p style=\"min-height:1.5em\">Evaluate staffing needs and make hiring recommendations for the accounting team. Manage and develop the accounting staff to support the strategic growth and success of the department.</p></li></ul><p style=\"min-height:1.5em\"></p><p style=\"min-height:1.5em\"><strong>REQUIREMENTS AND SKILLS</strong></p><ul style=\"min-height:1.5em\"><li><p style=\"min-height:1.5em\">Experience working with Netsuite required.</p></li><li><p style=\"min-height:1.5em\">Robust Excel skills required and experience working with databases preferred.</p></li><li><p style=\"min-height:1.5em\">Experience hiring, managing and developing staff.</p></li><li><p style=\"min-height:1.5em\">Proven track record in preparing reliable financial statements</p></li><li><p style=\"min-height:1.5em\">Demonstrated ability to lead successful accounting project initiatives</p></li><li><p style=\"min-height:1.5em\">History of successfully collaborating with financial leadership</p></li><li><p style=\"min-height:1.5em\">Success in implementing new accounting systems and processes</p></li></ul><p style=\"min-height:1.5em\">At Empower, we hire for people that push themselves to understand others and seek out ways to challenge their personal assumptions. Our hope is that by fostering such an environment, we strengthen our business and relationships by putting people first. We are committed to building a diverse, inclusive, and equitable workspace where everyone (regardless of age, education, ethnicity, gender, sexual orientation, or any personal characteristics) feels like they belong. Even if your experience doesn’t exactly match up to our job description, you should feel empowered to apply regardless!</p>","tags":"[\"Finance\",\"management\",\"database\"]","pubDate":"2024-12-20T20:45:52.710Z","link":"https://jobs.ashbyhq.com/empower%20finance/e645a529-2133-422a-ab0f-9254d994ab79","slug":"account-manager-empower-4488"},{"id":9071798812,"title":"Principal Recruiter - Remote","company":"Empower","image":"https://lever-client-logos.s3.us-west-2.amazonaws.com/2e1a369c-b58f-41ac-8d86-4b0a77695e68-1687915522032.png","description":"<p style=\"min-height:1.5em\"><strong>EMPOWER OVERVIEW</strong></p><p style=\"min-height:1.5em\"><a target=\"_blank\" rel=\"noopener noreferrer nofollow\" href=\"http://empower.me/\">Empower</a> is shaking up an outdated financial system by providing real opportunity for our customers: the opportunity to get the cash they need, to access fair credit, and to change their financial story. Today, we’re helping millions of people find financial security through machine learning models that evaluate creditworthiness using a more inclusive lens and mobile-first products: Cash Advance, Thrive line of credit, and Petal credit cards. Tomorrow? Creating even more financial paths for our customers (and their wallets) to succeed.</p><p style=\"min-height:1.5em\">This year, Empower ranked #65 on Inc. 5000’s Fastest-Growing Private Companies list — our third year in a row cracking the top 100 — and was named by Forbes as one of the 25 Next Billion-Dollar Startups for 2024. Empower was also featured by Forbes on America’s Best Startup Employers list in 2023, and our Thrive line of credit product was named by Fast Company as one of 2022’s Next Big Things in Tech.</p><p style=\"min-height:1.5em\">Empower is backed by Sequoia Capital, Blisce, and Icon Ventures. Ready to grow your impact and accelerate your career? Take a look at our open roles — we can’t wait to meet you.</p><p style=\"min-height:1.5em\"></p><p style=\"min-height:1.5em\"><strong>THE EMPOWER WAY</strong></p><p style=\"min-height:1.5em\"><strong>Great Expectations</strong>: We come up with bold, audacious goals for ourselves and go all out for impact</p><p style=\"min-height:1.5em\"><strong>Owner Mindset</strong>: We give every employee latitude to act independently, make smart choices, and move the business forward</p><p style=\"min-height:1.5em\"><strong>Spirited Debate</strong>: We love skeptics and seek counter opinions to challenge our personal assumptions and expand our view</p><p style=\"min-height:1.5em\"><strong>Customer Obsession:</strong> We listen to understand, empathize, and create a memorable, rewarding experience for our community</p><p style=\"min-height:1.5em\"><strong>Inclusive Collaboration</strong>: We believe diverse teams make the best decisions, and we strive to give diverse voices a seat at the table</p><p style=\"min-height:1.5em\"><strong>No Jerks Allowed</strong>: We value our relationships and take the time to build trust and connection and communicate respectfully</p><p style=\"min-height:1.5em\"></p><p style=\"min-height:1.5em\"><strong>WHAT EMPOWER OFFERS</strong></p><p style=\"min-height:1.5em\">Competitive salary</p><p style=\"min-height:1.5em\">Generous equity package</p><p style=\"min-height:1.5em\">Full healthcare benefits</p><p style=\"min-height:1.5em\">Technology expense reimbursement</p><p style=\"min-height:1.5em\">Work from anywhere</p><h3></h3><p style=\"min-height:1.5em\"><strong>JOB DESCRIPTION</strong></p><p style=\"min-height:1.5em\">As a Recruitment Lead, you will play a pivotal role in hiring the people who will drive Empower’s mission forward. In this role, you will spend approximately 80% of your time on hands-on recruiting activities, working closely with stakeholders and candidates to tackle business-critical hiring, and 20% of your time strengthening the process and performance of our Talent Acquisition (TA) team.</p><p style=\"min-height:1.5em\"></p><p style=\"min-height:1.5em\">Empower is a remote-first company. We drive connectivity through regular company offsites. Travel for company offsites is expected at a minimum 2 times a year.<br /><br /><strong>Your Hands-on Recruiting Activities Will Include</strong></p><ul style=\"min-height:1.5em\"><li><p style=\"min-height:1.5em\"><em>Full-Cycle Recruiting:</em> Manage the full recruitment cycle for several leadership, technical, and business (corporate) roles, from sourcing to offer.</p></li><li><p style=\"min-height:1.5em\"><em>Stakeholder Collaboration:</em> Act as a partner to hiring managers, delivering a great experience to both candidates and hiring managers.</p></li><li><p style=\"min-height:1.5em\"><em>Sourcing and Attracting Talent:</em> Proactively source, pipeline, attract, interview, and close candidates</p></li><li><p style=\"min-height:1.5em\"><em>Market Understanding:</em> Develop and cultivate a strong understanding of our target talent markets, including trends in compensation, evaluation, and talent branding.</p></li><li><p style=\"min-height:1.5em\"><em>Recruitment Strategy:</em> Develop and implement effective sourcing &amp; recruiting strategies to attract top talent, adjusting as needed to achieve hiring goals.</p></li><li><p style=\"min-height:1.5em\"><em>Reporting and Analytics:</em> Track and report on recruitment metrics, providing regular updates and insights to senior management.</p></li></ul><p style=\"min-height:1.5em\"><strong>What You Will Need to Be Successful in This Role</strong></p><ul style=\"min-height:1.5em\"><li><p style=\"min-height:1.5em\">Track record (7+ years) of building successful TA pipelines, processes, and partnerships with business leaders, with increasing responsibility and complexity over time</p></li><li><p style=\"min-height:1.5em\">Experience hiring for a range of specialized or technical roles (Engineering, Data Science, Credit Risk); prior experience with general / corporate sourcing a plus</p></li><li><p style=\"min-height:1.5em\">People-oriented systems thinker: understands how to connect the dots between company culture, candidate experience, and TA operations (workflows, tools, etc.)</p></li><li><p style=\"min-height:1.5em\">Curious and analytical thinker: solves the problem at hand using quantitative data whenever possible</p></li><li><p style=\"min-height:1.5em\">Can keep the bar high and will never sacrifice quality for speed</p></li><li><p style=\"min-height:1.5em\">Negotiates for the business and the candidate</p></li></ul><p style=\"min-height:1.5em\">At Empower, we hire for people that push themselves to understand others and seek out ways to challenge their personal assumptions. Our hope is that by fostering such an environment, we strengthen our business and relationships by putting people first. We are committed to building a diverse, inclusive, and equitable workspace where everyone (regardless of age, education, ethnicity, gender, sexual orientation, or any personal characteristics) feels like they belong. Even if your experience doesn’t exactly match up to our job description, you should feel empowered to apply regardless!</p>","tags":"[\"management\",\"engineering\"]","pubDate":"2024-12-20T17:12:19.571Z","link":"https://jobs.ashbyhq.com/empower%20finance/caa38377-debb-4134-a857-0b090bef380d","slug":"principal-recruiter-remote-empower-4049"},{"id":7796384092,"title":"Brand Designer - Contractor","company":"Kit","image":"https://avatars.githubusercontent.com/u/10557747?s=200&v=4","description":"&lt;div class=&quot;content-intro&quot;&gt;&lt;h4&gt;Description&lt;/h4&gt;\n&lt;div&gt;\n&lt;p class=&quot;p1&quot;&gt;Kit is an email-first operating system for creators who mean business. We help creators grow and monetize their audience with ease. For coaches, YouTubers, authors, podcasters, and other creatives, there isn’t a better marketing hub to rely on to grow audiences, automate email marketing, and sell digital products - all within one platform. More importantly, there isn’t a team more committed to helping creators earn a living.&lt;/p&gt;\n&lt;p&gt;We’re on a mission to help creators earn $1 billion using our creator marketing platform. We have always been 100% independent and 100% remote. We are proud to have built a product that our customers love, and we look for people who have enthusiasm and belief in our mission, vision, and values to join our team.&lt;/p&gt;\n&lt;p&gt;The Kit culture is one where emotional intelligence is valued, radical candor is encouraged, and where everyone works together to uphold a set of shared team principles.&lt;/p&gt;\n&lt;hr&gt;\n&lt;p&gt;&amp;nbsp;&lt;/p&gt;\n&lt;/div&gt;&lt;/div&gt;&lt;h4&gt;&lt;strong&gt;The Role&lt;/strong&gt;&lt;/h4&gt;\n&lt;p&gt;We need a Brand Designer with a generalist visual communication design skillset to help us produce assets that market Kit as the email-first operating system for creators who mean business.&lt;/p&gt;\n&lt;p&gt;Working alongside our remote Brand Studio team you’ll design:&amp;nbsp;&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;graphics that promote our product features and content&lt;/li&gt;\n&lt;li&gt;compelling slide decks for workshops and sales calls&lt;/li&gt;\n&lt;li&gt;imagery for our blog and YouTube content&lt;/li&gt;\n&lt;li&gt;web landing pages or microsites for our sub-brands and special projects&amp;nbsp;&lt;/li&gt;\n&lt;li&gt;assets like simple illustrations, icons or siloed photographs for our brand design system&lt;/li&gt;\n&lt;li&gt;merch and other collateral for our in-person events&lt;/li&gt;\n&lt;li&gt;PDF playbooks or reports that give creators a great reading experience&lt;/li&gt;\n&lt;li&gt;Kit email templates and landing pages to demo our features&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;We’re looking for a freelance designer with a high level of craft and experience using our product who can work within tight deadlines in weekly sprints to help us meet the design needs of the Kit team. You’ll collaborate closely with our in-house Senior Brand Designer, who manages design requests from across the company.&lt;/p&gt;\n&lt;h4&gt;&lt;strong&gt;The Work&lt;/strong&gt;&lt;/h4&gt;\n&lt;p&gt;The Brand Designer will be responsible for:&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;Creating original and effective designs – both digital and print – for marketing collateral across our content, social media, advertising, email, events, training and sales channels as detailed above.&amp;nbsp;&lt;/li&gt;\n&lt;li&gt;Ensuring that the assets they design meet the needs of the request and adhere to the Kit brand guidelines.&lt;/li&gt;\n&lt;li&gt;Meeting deadlines for projects, incorporating at least one business day for feedback at each stage of a project.&lt;/li&gt;\n&lt;li&gt;Creating and using components in our Figma brand design system and templates in Figma Slides to build and maintain brand consistency.&lt;/li&gt;\n&lt;li&gt;Keeping the status of their assigned projects up to date in our project management tool (Notion) and communicating with stakeholders in Notion and Slack about feedback and project status.&lt;/li&gt;\n&lt;li&gt;Providing multiple options or iterations on projects when briefed to&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;&lt;strong&gt;Requirements&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;The right designer for this role has:&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;Prior experience designing assets to market a SaaS product&lt;/li&gt;\n&lt;li&gt;A portfolio of work that showcases your ability to design creative and effective assets for various marketing channels&lt;/li&gt;\n&lt;li&gt;A keen eye for design details like typography, iconography, illustration and motion.&lt;/li&gt;\n&lt;li&gt;The ability to respond well to feedback and communicate design decisions&lt;/li&gt;\n&lt;li&gt;Strong project management and communication skills to keep stakeholders proactively informed on project status&lt;/li&gt;\n&lt;li&gt;Confidence designing and creating systems in Figma&lt;/li&gt;\n&lt;li&gt;Experience using, and a good understanding of, the Kit product&lt;/li&gt;\n&lt;li&gt;The ability to be autonomous and self-motivated in a remote work environment.&lt;/li&gt;\n&lt;li&gt;The ability to collaborate effectively with our team based in US/Europe time zones, including joining occasional Zoom calls&lt;/li&gt;\n&lt;li&gt;Belief in our&amp;nbsp;&lt;a href=&quot;https://convertkit.com/mission&quot;&gt;mission, vision and values&lt;/a&gt;&lt;/li&gt;\n&lt;/ul&gt;\n&lt;h4&gt;Compensation and Contract Details&lt;/h4&gt;\n&lt;ul&gt;\n&lt;li&gt;This contract is for 12 months, with the possibility of extending a further 12 months.&lt;/li&gt;\n&lt;li&gt;A monthly retainer for an average of 20 hours/week spread across at least 4 days each week.&lt;/li&gt;\n&lt;li&gt;The pay rate will be between $4,500 - $5,500/month, based on experience&lt;/li&gt;\n&lt;/ul&gt;\n&lt;h4&gt;&lt;strong&gt;How to Apply&lt;/strong&gt;&lt;/h4&gt;\n&lt;p&gt;We usually receive a large number of applications, and our goal is to follow up with you within two weeks (however applications submitted before the new year may take a little longer to be reviewed due to the winter break). You’ll hear from us either way. Here’s what you can expect from the rest of our hiring process:&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;A phone screen with someone from our hiring team&lt;/li&gt;\n&lt;li&gt;A technical interview with our Creative Director and Senior Brand Designer&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;We’ll keep you informed through every step. To get started, complete this application, including a link to your portfolio and answers to the questions on the next page. We read every single application, and your responses help put your experience into context.&lt;/p&gt;&lt;div class=&quot;content-conclusion&quot;&gt;&lt;hr&gt;\n&lt;p&gt;&amp;nbsp;&lt;/p&gt;\n&lt;p&gt;Kit is an equal opportunity employer. We value diversity in all of its forms, and we hire the best person we can for each role, no matter your personal background. Research tells us that applicants who are female or non-binary, as well as applicants who are people of color, are less likely to apply for roles they do not feel 100% qualified for. If you think you meet more than 50% of our requirements but fewer than 100% of them, please apply. We’re imperfect communicators, so think of our job postings as the starting point for discussion rather than proof that you shouldn’t apply.&lt;/p&gt;\n&lt;p&gt;Kit does not discriminate on the basis of race, sex, color, religion, age, national origin, marital status, disability, veteran status, genetic information, sexual orientation, gender identity or any other reason prohibited by law in provision of employment opportunities and benefits.&lt;/p&gt;&lt;/div&gt;","tags":"[\"management\"]","pubDate":"2024-12-20T13:15:46.000Z","link":"https://job-boards.greenhouse.io/convertkit/jobs/4608713007","slug":"brand-designer-contractor-kit-1131"},{"id":9096125686,"title":"Data Senior Manager, Growth","company":"Airalo","image":"https://lever-client-logos.s3.us-west-2.amazonaws.com/55028a36-609c-479c-9553-d4689ff2dd8c-1669620566663.png","description":"<div><b>About Airalo</b></div><div>Alo! Airalo is the world’s first eSIM store that helps people connect in over 200+ countries and regions across the globe. We are building the next digital service that revolutionizes the telecom industry. We are a travel-tech company and an equal-opportunity environment that values and executes diversity, inclusion, and equity. Our team is spread across 50+ countries and six continents. What glues us together is our commitment to changing the way you connect<span style=\"font-size: 13.3333px\">. </span></div><div><br></div><div><b>About you</b></div><div>We hope that you care deeply about the quality of your work, the intrinsic worth of tasks, and the success of your team. You are self-disciplined and do not require micromanagement in terms of your skillset and work ethic. You do your best to flourish as an individual every day while working hard to foster a collaborative team environment. You believe in the importance of being — and staying — authentic, honest, positive, and kind. You are a good interlocutor with clear and concise communication. You are able to manage multiple projects, have an analytical mind, pay keen attention to detail, and love to get your hands dirty. You are cognizant, tolerant, and welcoming of vulnerabilities and cultural differences.</div><div><br></div><div><b>About the Role</b></div><div><b>Position</b>: Full-time / Employee</div><div><b>Location:</b>&nbsp;Remote-first </div><div><b>Benefits:</b>&nbsp;Health Insurance, work-from-anywhere stipend, annual wellness &amp; learning credits, annual all-expenses-paid company retreat in a gorgeous destination &amp; other benefits</div><div><br></div><div>Are you passionate about leveraging data to fuel business growth and optimize decision-making? Do you thrive in hands-on environments where your technical expertise drives tangible outcomes? We are looking for a <b>Data Senior Manager, Growth</b> to take ownership of growth-related analytics, laying the groundwork for scalable, data-driven insights. This role is perfect for someone who combines technical skills with strategic thinking and is ready to roll up their sleeves. Your work will directly impact our growth strategies. Your first mission: integrate touchpoint and conversion data in our warehouse, determine the optimal attribution window and MTA model, and calculate channel-level CACs. If you’re ready to make a direct impact and enjoy both strategic and hands-on work, we’d love to hear from you.</div><h3>Your main responsibilities will be to:</h3><li>Partner with Growth to identify critical business questions and translate them into data requirements and actionable frameworks</li><li>Own Growth/Data initiatives, ensuring the delivery of insights that drive measurable business outcomes</li><li>Design and execute experiments, leveraging statistical methods to measure campaign effectiveness and inform resource allocation</li><li>Develop and implement attribution models, including experimentation with multi-touch attribution and determining optimal attribution windows</li><li>Calculate and continuously optimize channel-level CACs and other key Growth metrics</li><li>Develop dashboards and reporting mechanisms for leadership, providing clear insights into Growth performance and opportunities</li><li>Stay ahead of industry trends and tools to ensure best-in-class Growth measurement practices</li>,<h3>Does this sound like you?</h3><li>5+ years of experience in marketing analytics, with deep understanding of attribution modeling and calculating metrics like channel-level CAC, LTV, churn</li><li>Proficiency in designing experiments and applying statistical methods to business challenges, with a proven track record of influencing Growth decision-making</li><li>Expertise in SQL and Python</li><li>Experience with modern warehousing solutions like BigQuery or Snowflake</li><li>Familiarity with platforms such as Adjust, CleverTap, Funnel, GA4, Google Ads, Meta Ads, TikTok Ads</li><li>Clear and direct communication skills about complex, technical topics</li><li>A proactive, self-starter mindset with a passion for working in fast-paced, high-impact environments</li>,<h3>It's a bonus if you have:</h3><li>Experience with data visualization tools like Looker Studio, Tableau,or similar</li><li>Experience working with telco, MNOs &amp; MNVOs</li><div><span style=\"font-size: 15px;\">If you are interested in this position,&nbsp;</span><b style=\"font-size: 15px;\">please apply via the link.</b></div><div><br></div><div><i style=\"font-size: 15px;\">Please note that our Engineering &amp; Product team works in the CET timezone, so candidates will need to reside in countries with the same time zone or similar to it and will need to already have permit to work in the country where they are based.</i></div><div><br></div><div>We sincerely thank all applicants in advance for submitting their interest in this opportunity. Airalo is an equal opportunity employer and values diversity, equity &amp; inclusion. We do not discriminate on the basis of race, religion, national origin, gender, sexual orientation, age, marital status, veteran status, or disability status. We are committed to providing reasonable accommodations upon request for individuals with disabilities throughout our job interview process.</div>","tags":"[\"management\",\"engineering\"]","pubDate":"2024-12-20T10:09:49.805Z","link":"https://jobs.lever.co/airalo/c65a39ea-25ce-4ef7-8c01-24e60458917e","slug":"data-senior-manager-growth-airalo-501"},{"id":6560957762,"title":"Automation QA Engineer","company":"Remofirst","image":"https://remotive.com/job/1957568/logo","description":"<div><strong>Remofirst</strong> empowers employers to be free from geographical boundaries when accessing talent, allowing employees to pursue opportunities wherever they may exist. We are on a mission to be the FIRST to truly revolutionise the industry and be a generational company.</div>\n<div> </div>\n<div>Our platform offers a full-range people management tool, employee benefits like health insurance, and financial benefits, and enabling clients to hire anyone from anywhere with one click. Remofirst manages employees and contractors for Fortune 500 companies (e.g., Microsoft, Mastercard) and the best startups worldwide (e.g., TransferGo). </div>\n<div> </div>\n<div>We are a small but strong team of 100+ people (and growing) hyper-focussed on delivering a world-class platform and unparalleled service with our industry-leading partnerships. To help accelerate our growth and pace of delivery, we are looking for talented <strong>Automation QA Engineer</strong> to help spearhead the overall look and feel of our features and services.</div>\n<div> </div>\n<div>As s <strong>Automation QA Engineer</strong>, you will be responsible for creating and executing test plans, performing manual and automated testing, and actively participating in the software development life cycle.</div>\n<p><br><br></p>\n<div class=\"h3\">What you'll be doing:</div>\n<ul style=\"\">\n<li style=\"\">Develop and maintain automated test scripts for functional, regression, and performance testing.</li>\n<li style=\"\">Collaborate with developers, product managers, and QA teams to define test requirements and objectives.</li>\n<li style=\"\">Identify, document, and track bugs, ensuring timely resolution.</li>\n<li style=\"\">Monitor and analyze test results, providing detailed reports to stakeholders.</li>\n<li style=\"\">Ensure high test coverage and contribute to achieving software quality goals.</li>\n</ul>\n<p><br><br></p>\n<div class=\"h3\">What you’ll need:</div>\n<ul style=\"\">\n<li style=\"\">2+ years of experience working with JS/Node.</li>\n<li style=\"\">2+ years of experience with Playwright.</li>\n<li style=\"\">Experience with AWS - Lambda/S3/Cloudwatch/Step functions.</li>\n<li style=\"\">Experience with Gitlab.</li>\n<li style=\"\">API/UI tests.</li>\n<li style=\"\">Nice to have: experience with docker.</li>\n</ul>\n<p><br><br></p>\n<div class=\"h3\">Why work at Remofirst?</div>\n<ul style=\"\">\n<li style=\"\"><strong>Startup environment. </strong>Remofirst is an early-stage start-up.  You have a voice and can influence and grow rapidly.</li>\n<li style=\"\"><strong>Build &amp; Scale From Scratch. </strong>Experience hyper-growth scale and help us build a great team of professionals worldwide that can help us achieve this ambitious vision. </li>\n<li style=\"\"><strong>Work for a Market Leader. </strong>Scale a project that counts market-leading companies like Microsoft, Mastercard, and more as happy customers. </li>\n<li style=\"\"><strong>Compensation and perks are great! </strong>Competitive compensation. Work equipment of your choice. 100% remote work. PTO regulated by local statutory.</li>\n<li style=\"\"><strong>Culture. </strong>We lead with respect, kindness, and the right to fail. We value hard yet smart work. Diversity and inclusion are part of our DNA.  As we grow and evolve, we welcome your input to help us define our culture further. </li>\n</ul>\n<img src=\"https://remotive.com/job/track/1957568/blank.gif?source=public_api\" alt=\"\"/>","tags":"[\"AWS\",\"gitlab\"]","pubDate":"2024-12-20T05:51:50.000Z","link":"https://remotive.com/remote-jobs/qa/automation-qa-engineer-1957568","slug":"automation-qa-engineer-remofirst-9666"},{"id":1170796272,"title":"Technical Support Analyst","company":"Coursedog","image":"https://remotive.com/job/1958517/logo","description":"<div><!--block-->We are looking for a technical, detail-oriented, strategic new team member to join our Support Team. We need someone who’s comfortable working in a complex and ambiguous environment with excellent organization and communication skills. You’ll own customer issues directly, and collaborate internally to increase Coursedog’s ability to fix issues quickly and effectively. You’ll work cross-functionally with Customer Success, Product, Engineering, and User Education to deliver incredible experiences and and share customer feedback to drive product improvements. </div><br><br><div class=\"h3\">Key Responsibilities</div><ul style=\"\"><li style=\"\"><!--block--><strong>Technical Support:</strong> Assist users through our ticketing app (Freshdesk) by providing clear instructions, guidance and solutions to technical problems. Keep customers informed of progress and estimated resolution times on defects.</li><li style=\"\"><!--block--><strong>Troubleshooting:</strong> Investigate and analyze tickets by asking probing and root cause analysis questions. Identify resolutions in Product or Integration Configuration while determining any downstream impacts.</li><li style=\"\"><!--block--><strong>Collaboration:</strong> Work closely with Product, Engineering, Customer Success and User Education to resolve complex technical issues. Document and escalate issues to the Product Engineering or Data Engineering teams, and actively monitor the resolution progress.</li><li style=\"\"><!--block--><strong>Prioritization:</strong> Prioritize tickets and manage time efficiently, while achieving productivity-related targets including support tickets resolved, average response time, average resolution time, customer satisfaction, etc.</li><li style=\"\"><!--block--><strong>Documentation:</strong> Document issues with screenshots and clear, concise notes for efficient cross-functional communication to determine and resolve issues. Actively contribute to our Knowledge Base by working with the User Education Team to improve knowledge and address knowledge gaps.</li><li style=\"\"><!--block--><strong>Quality Assurance:</strong> Communicate product configuration updates and defect fixes after verification in QA/Staging and confirm resolution.</li></ul><br><br><div class=\"h3\">Skills, Knowledge, and Expertise</div><div><!--block--><strong>Required </strong></div><ul style=\"\"><li style=\"\"><!--block-->2-5+ years providing technical support for an enterprise SaaS organization</li><li style=\"\"><!--block-->Strong understanding of client/server technology, SSO, JSON, AWS.</li><li style=\"\"><!--block-->General experience troubleshooting where data is synchronized across multiple systems.</li><li style=\"\"><!--block-->Driven self-starter with ownership mentality and a proven record of multi-tasking.</li><li style=\"\"><!--block-->Excellent analytical, problem-solving, and communication skills, with a bias for action and a growth mindset.</li><li style=\"\"><!--block-->Customer-facing experience (you have dealt with customers directly, and you are a \"people-person\" who knows how to talk to clients).</li><li style=\"\"><!--block-->Thrives in a fast-paced environment with the flexibility to adapt to changing priorities and requirements.</li><li style=\"\"><!--block-->Ability to work 8:30 AM to 5:30 PM CST.</li></ul><div><!--block--><strong>Preferred </strong></div><ul style=\"\"><li style=\"\"><!--block-->Experience with Student Information Systems is a plus.</li><li style=\"\"><!--block-->Experience with Quality Assurance testing in software development lifecycle is a plus.</li><li style=\"\"><!--block-->Familiarity with APIs and API tools (e.g. Postman, cURL) a strong plus.</li></ul><br><br><div class=\"h3\">Working at Coursedog </div><div><!--block--><strong>Employee</strong> <strong>Benefits</strong></div><ul style=\"\"><li style=\"\"><!--block--><strong>Healthcare:</strong> We pay 99% of your medical, dental, and vision coverage and 75% of the premium for your spouse and/or dependents</li><li style=\"\"><!--block--><strong>Retirement: </strong>We offer a 401k plan on day one of your employment.</li><li style=\"\"><!--block--><strong>Paid Time Off:</strong> We value work-life balance and provide a high amount of autonomy. In service to this, our Paid Time Off policy has no annual limit.</li><li style=\"\"><!--block--><strong>Remote-First: </strong>We value flexible working hours over set hours, results over number of hours, and asynchronous communication focused on transparency over need-to-know access.</li><li style=\"\"><!--block--><strong>Equity: </strong>You’ll be contributing to the team's success, so you deserve to share in it. Every employee on our team gets a meaningful equity allocation.</li><li style=\"\"><!--block--><strong>Parental Leave</strong>: To help support new parents in the workplace, we offer up to 10 weeks of paid parental leave.</li></ul><div><!--block--><strong>Diversity, Equity, and Inclusion</strong><br><br>Coursedog is an equal opportunity employer committed to hiring a diverse workforce at all levels of the organization and creating an inclusive environment for all.<br><br>We value and encourage the contributions of our employees and strive to create an environment where everyone can reach their full potential and drive outstanding results. We draw strength from our range of interests, backgrounds, and perspectives<br><br>We strongly encourage applicants from all backgrounds to apply.<br><br>All qualified applicants will receive consideration for employment without regard to race, national origin, age, sex, religion, disability, sexual orientation, marital status, veteran status, gender identity or expression, or any other basis protected by local, state, or federal law.<br><br><strong>Accommodations</strong><br><br>Accommodations are available for applicants with disabilities in all phases of the application and employment process. On your application, you will be prompted to inform us If you need any accommodation during this process.</div><img src=\"https://remotive.com/job/track/1958517/blank.gif?source=public_api\" alt=\"\"/>","tags":"[\"documentation\",\"technical support\",\"troubleshooting\"]","pubDate":"2024-12-20T05:51:06.000Z","link":"https://remotive.com/remote-jobs/customer-support/technical-support-analyst-1958517","slug":"technical-support-analyst-coursedog-6116"},{"id":9650133965,"title":"QA Tester","company":"Deca Games","image":"https://remotive.com/job/1957688/logo","description":"<div class=\"h1\"><strong>About DECA Games</strong></div>\n<p>We believe that games should be played for decades but many are abandoned even when a loyal community is screaming to keep them alive. <strong>DECA</strong> specializes in acquiring games from other developers and reinvigorating them to continue to entertain for decades. When other studios see an old game, we see a fantastic set of problems to solve and a huge opportunity. </p>\n<p><strong>DECA</strong> is a remote company with over 290 people in over 31 countries globally. DECA has been profitable since our inception in 2016. <strong>DECA</strong> is also a part of the Embracer Group, the largest public gaming company in Europe.</p>\n<div class=\"h1\"><strong>About our culture</strong></div>\n<p>We've managed to maintain a small company feel with the stability and resources of a much larger one. We fully believe in the flexibility of a remote workplace. Team members are trusted to manage their time and get things done independently. We think that egos and politics need to be checked at the virtual door. That means no jerks are allowed, that no job is too small for anyone, and an openness to help and learn from each other is required. We love the challenge of working within constraints and love when we succeed as a team. Check out more about us and our values on our website (<a href=\"http://www.decagames.com/\" rel=\"nofollow\">www.decagames.com</a>).</p>\n<p>This is a <strong>remote</strong> position. Our working schedule is in the CET timezone (9 a.m. - 6 p.m. CET).</p>\n<p> </p>\n<div class=\"h1\"><strong>Job Description</strong></div>\n<p>We are looking for a QA Tester with experience in the Video Game industry to work with our multi-talented team to ensure the delivery of high-quality products to our customers. <br>With a keen eye for detail and excellent communication skills, you will ensure that our games, features, and systems work as expected and that we deliver bug-free content on time. Working together with the rest of the QA team, the development department as well and the various stakeholders, you will have the opportunity to understand all the internal dynamics and impact the way we build our product processes.</p>\n<p>In this role you will have the opportunity to work with many other disciplines such as design, LiveOps, business intelligence, and development engineering, to build and test products that meet the overall business needs. This is a dynamic role with high exposure to many aspects of developing and running a unique game.</p>\n<p><br>If this sounds like you, we would love to meet you and discuss it further!</p>\n<p> </p>\n<div class=\"h2\"><strong>Responsibilities</strong></div>\n<ul style=\"\">\n<li style=\"\">Perform manual functional testing across the company's PC, web, and mobile platforms (iOS, Android): Dev Testing, LiveOps Production testing, Development testing functionality and Manual Testing, smoke tests, Unit Testing, regression as well as any additional ad hoc tests both in development, Production and Live Phase. </li>\n<li style=\"\">Report in real-time proactively with stakeholders regarding QA operations with game defects, and Quality concerns from an end-user perspective including complete steps, identification of root cause, and expected results into communication channels and appropriate bug tracking software along with back-to-back follow-ups until the regression phase.</li>\n<li style=\"\">Creating and sending test reports upon completion of test activities and actively involved in planning and solving with stakeholders. </li>\n<li style=\"\">Follow up on issues with the team to ensure that they are fixed and delivered to end users.</li>\n<li style=\"\">Developing test plans with a strategic selection of test methodologies in advance during the development phase. </li>\n<li style=\"\">Proactively communicate concerns and risks to Product Teams in a professional manner.</li>\n<li style=\"\">Creation and maintenance of written documentation of knowledge and processes.</li>\n<li style=\"\">Assist in backlog and defect grooming with the Producers and Cross Department Leads.</li>\n<li style=\"\">Owning features and ensuring they are tested thoroughly with assurance of the Quality of the product to be shipped globally.</li>\n</ul>\n<div class=\"h2\"><strong>Requirements</strong></div>\n<ul style=\"\">\n<li style=\"\">1 - 2 years experience in quality control and assurance of Video Games.</li>\n<li style=\"\">Experience in Coordinating QA operations with the Production Team and other Departments. </li>\n<li style=\"\">Good knowledge of Jira.</li>\n<li style=\"\">Experience in a remote working culture is a must. </li>\n<li style=\"\">Experienced in at least one bug-tracking software and the ability to create detailed and efficient documentation.</li>\n<li style=\"\">Fluent in English and a good communicator, both written and spoken.</li>\n<li style=\"\">Proven ability to handle stressful situations, prioritize tasks, and meet tight deadlines.</li>\n<li style=\"\">Strong interpersonal skills with high motivation, drive to improve, and capacity to learn.</li>\n<li style=\"\">Able to work independently, adjust to last-minute changes, and understanding of how to prioritize tasks.</li>\n<li style=\"\">Fully functional PC/laptop - Windows with stable Internet connection with minimum 50Mbps.</li>\n<li style=\"\">Android and iOS devices dedicated to QA testing. </li>\n</ul>\n<div class=\"h2\"><strong>Nice to have</strong></div>\n<ul style=\"\">\n<li style=\"\">Experience with mobile, MMO, and free-to-play games.</li>\n<li style=\"\">Competency in MS Office and Google Suite.</li>\n<li style=\"\">Knowledge of the Game Development Process.</li>\n<li style=\"\">Passion for gaming in various game genres and having played them on various platforms.</li>\n<li style=\"\">ISTQB certification.</li>\n</ul>\n<div class=\"h1\"> </div>\n<div class=\"h1\"><strong>Benefits</strong></div>\n<ul style=\"\">\n<li style=\"\">Remote first company culture.</li>\n<li style=\"\">Flexible work hours to support personal work-life balance.</li>\n<li style=\"\">Weekly remote Embodiment@Work breathing and workout exercises.</li>\n<li style=\"\">Online language classes: English, German, French, Spanish, etc.</li>\n<li style=\"\">Working in a multicultural environment with people from over 31 different countries.</li>\n<li style=\"\">Flat hierarchies with an open-door policy.</li>\n</ul>\n<img src=\"https://remotive.com/job/track/1957688/blank.gif?source=public_api\" alt=\"\"/>","tags":"[\"jira\",\"testing\"]","pubDate":"2024-12-19T09:51:08.000Z","link":"https://remotive.com/remote-jobs/qa/qa-tester-1957688","slug":"qa-tester-deca-games-7546"}]