[{"id":8305229034,"title":"Business Development Representative","company":"Coalesce","image":"https://pbs.twimg.com/profile_images/1470600385861611521/zGMS9sPM_400x400.png","description":"<div class=\"section page-centered\" data-qa=\"job-description\"><div><span style=\"font-size: 12pt\">We are seeking a highly motivated Business Development Representative to join our fast-growing team. In this dynamic role, you will play a critical part in driving revenue growth by identifying and engaging with potential customers, helping to open new markets/verticals, and setting up successful sales conversations. A key part of Coalesce’s rapid growth has been our high-output Business Development team which has helped lay the foundation of our go-to-market strategy.</span></div><div><br></div><div><span style=\"font-size: 12pt\">Since founding Coalesce, our mission has remained the same: to improve the lives of data professionals by helping them transform data as efficiently as possible. We aim to bring an end to the days of arduous manual coding and inflexible GUIs by providing a best-of-both-worlds solution. Data transformations are at the very heart of the data analytics lifecycle and we believe that this long-neglected area finally deserved a modern-day transformation, no pun intended.</span></div><div><br></div><div><span style=\"font-size: 12pt\">Extremely competitive compensation package, equity, and benefits. All final pay rates will be determined by the candidate's specific, experience, knowledge, skills, and abilities..</span></div></div><div class=\"section page-centered\"><div><h3>Key Responsibilities</h3><ul class=\"posting-requirements plain-list\"><ul><li>Research and identify prospective customers through various methods such as LinkedIn, ZoomInfo, and industry-wide events.</li><li>Qualify and nurture leads by understanding the client's needs, and positioning our solutions as the ideal fit where appropriate.</li><li>Strategize prospecting strategies via list building, account prioritization and develop messaging in collaboration with the Sales team.</li><li>Reach out to prospective clients via email, phone, and LinkedIn to generate interest and qualified leads.</li><li>Drive both virtual and in-person event attendance.</li><li>Attend industry and partner-led events and webinars to expand your network and identify new sales opportunities.</li><li>Collaborate cross-organizationally to formulate new sales strategies.</li></ul></ul></div></div><div class=\"section page-centered\"><div><h3>Qualifications</h3><ul class=\"posting-requirements plain-list\"><ul><li>1+ year of xDR experience or an equivalent role with positive results</li><li>Familiarity with ZoomInfo, Outreach/Salesloft, Salesforce</li><li>Growth mindset, ability to receive feedback and implement it</li><li>Fearlessness; can’t be afraid to pick up the phone and make cold calls</li><li>Takes initiative and willingness to help out cross-functionally</li><li>Team player, motivated by team wins just as much as individual wins&nbsp;</li><li>Ability to adapt to a high-growth and rapidly changing job environment</li><li>Positive attitude, likes to work hard and celebrate company wins</li></ul></ul></div></div><div class=\"section page-centered\"><div><h3>Bonus Skills</h3><ul class=\"posting-requirements plain-list\"><ul><li>Familiarity with ELT/ETL space and major data warehousing players</li><li>Past experience in a cold-calling, or door-to-door sales position</li><li>Past experience thriving in a remote work environment</li></ul></ul></div></div><!--[2022-11-28] [GOLD-2535] Remove payTransparencyV1 when feature flag is fully removed--><div class=\"section page-centered\" data-qa=\"closing-description\"><div>Coalesce is a culture-first company. We strongly believe that our culture is what allows us to not only recruit world-class talent, but also retain it. At Coalesce, you can expect to experience radical honesty and trust in the workplace. Empathy for yourself and others. Support for continuous learning and improvement. Finally, last but not least, to have fun!</div><div><br></div><div>We’re always on the lookout for new team members that can make an impact. Aside from a competitive compensation and benefits package, Coalesce also offers an opportunity to work on solving a big problem that virtually all data-driven companies are struggling to solve.</div><div><br></div></div><div class=\"section page-centered last-section-apply\" data-qa=\"btn-apply-bottom\"><a class=\"postings-btn template-btn-submit cerulean\" data-qa=\"show-page-apply\" href=\"https://jobs.lever.co/coalesce.io/58999ded-4f8d-4188-baf3-82ea1803360a/apply\">Apply for this job</a></div>","tags":"[]","pubDate":"2023-11-21 04:48:20.047","link":"https://jobs.lever.co/coalesce.io/58999ded-4f8d-4188-baf3-82ea1803360a","savedDate":"2023-11-21 04:48:20.047","slug":"business-development-representative-coalesce-1425"},{"id":9584235907,"title":"Senior Site Reliability / Gitops Engineer","company":"Canonical","image":"https://pbs.twimg.com/profile_images/1673959375340290050/x7pNtXQ7_400x400.jpg","description":"\n      <p>This role is an opportunity for a hands-on, but literally hands-off, senior technologist with a passion for Linux to build a career with Canonical and drive the success with those leveraging Ubuntu and open source products.&nbsp; If you have experience of IT operations automation, Infrastructure as Code and a passion for technology, then you will enjoy working with some of the best people in the industry at Canonical.</p>\n<h2><strong>Job Summary</strong></h2>\n<p>The IS team at Canonical supports and maintains all of Canonical’s IT production services. The team is in charge of running services used by over 60 million Ubuntu users.</p>\n<p>As an Senior SRE &amp; Gitops engineer you’ll be in a unique position to drive operations automation to the next level, both in our own private clouds as well as in the public clouds. We do this by utilizing the best of open source infrastructure as code software, software development practices such as CI/CD pipelines, and Canonical’s leading products for software operation automation.</p>\n<p>In addition to defining the infrastructure as code, you will improve Canonical products and the open-source technologies they’re based on by providing critical feedback to developers on how their products operate at scale. This is done by submitting bugs (and sometimes writing pull requests) and collaborating on design and implementations with other teams within the company.</p>\n<p>You’ll be part of a global team of SREs that work together and support each other to provide the best possible services to our company, Canonical’s customers and the Ubuntu Community.</p>\n<h2><strong>As a Senior Site Reliability / Gitops Engineer engineer you will</strong></h2>\n<ul>\n<li>Drive the development of automation, Gitops in your team as an embedded tech lead</li>\n<li>Closely collaborate with the IS architect to align your solutions with the IS architecture vision</li>\n<li>Design and architect services that IS can offer to the organization as products</li>\n<li>Apply your experience of IaC to develop infrastructure as code practice within IS by constantly increasing automation and improving IaC processes</li>\n<li>Automate software operations for re-usability and consistency across private and public clouds, taking into consideration the complexities of distributed systems</li>\n<li>Maintain operational responsibility for all of Canonical’s core services, networks, and infrastructure</li>\n<li>Develop skills in troubleshooting, capacity planning, and performance investigation, Setting up, maintaining and using observability tools such as Prometheus, Grafana, and Elasticsearch; design, implement and maintain monitoring and alerting for various systems and services</li>\n<li>Provide assistance and work with globally distributed engineering, operations, and support peers</li>\n<li>Be given uninterrupted development time to focus on larger projects and automation of manual tasks</li>\n<li>Share your experience, know-how and best practices with other team members in design sessions, mentorship and ‘doing work together’</li>\n<li>Carry final responsibility for time-critical escalations</li>\n</ul>\n<h2>What we are looking for in you</h2>\n<ul>\n<li>A modern view on hosting architecture, driven by infrastructure as code across both private and public clouds.</li>\n<li>A product mindset thriving to develop products rather than solutions.</li>\n<li>Python software development experience, with large projects</li>\n<li>Experience working with Kubernetes or other container orchestration systems.</li>\n<li>Proven exposure to manage and deploy cloud infrastructure with code.&nbsp;&nbsp;</li>\n<li>Practical knowledge of Linux networking, routing, and firewalls</li>\n<li>Affinity with various forms of Linux storage, from Ceph to Databases</li>\n<li>Hands-on experience administering enterprise Linux servers</li>\n<li>Extensive knowledge of cloud computing concepts and technologies</li>\n<li>Bachelor's degree or greater, preferably in computer science or related engineering field</li>\n<li>Able to communicate clearly and effectively in English over email, chat, video or voice calls and in-person</li>\n<li>Motivated and able to troubleshoot from kernel to web, and willing to ask others when appropriate</li>\n<li>A willingness to be flexible and able to learn new things quickly</li>\n<li>Be inspired by the needs of fast-changing environments</li>\n<li>Happy to work within distributed teams</li>\n<li>Be passionate and familiarized about open-source, especially Ubuntu or Debian</li>\n</ul>\n<h2>What we offer you</h2>\n<p>Your base pay will depend on various factors including your geographical location, level of experience, knowledge and skills. In addition to the benefits above, certain roles are also eligible for additional benefits and rewards including annual bonuses and sales incentives based on revenue or utilization. Our compensation philosophy is to ensure equity right across our global workforce.&nbsp;&nbsp;</p>\n<p>In addition to a competitive base pay, we provide all team members with additional benefits, which reflect our values and ideals. Please note that additional benefits may apply depending on the work location and, for more information on these, you can ask in the later stages of the recruitment process.</p>\n<ul>\n<li>Fully remote working environment - we’ve been working remotely since 2004!</li>\n<li>Personal learning and development budget of 2,000USD per annum</li>\n<li>Annual compensation review</li>\n<li>Recognition rewards</li>\n<li>Annual holiday leave</li>\n<li>Parental Leave</li>\n<li>Employee Assistance Programme</li>\n<li>Opportunity to travel to new locations to meet colleagues at ‘sprints’</li>\n<li>Priority Pass for travel and travel upgrades for long haul company events</li>\n</ul>\n<h2>About Canonical</h2>\n<p>Canonical is a pioneering tech firm that is at the forefront of the global move to open source. As the company that publishes Ubuntu, one of the most important open source projects and the platform for AI, IoT and the cloud, we are changing the world on a daily basis. We recruit on a global basis and set a very high standard for people joining the company. We expect excellence - in order to succeed, we need to be the best at what we do.</p>\n<p>Canonical has been a remote-first company since its inception in 2004.​ Work at Canonical is a step into the future, and will challenge you to think differently, work smarter, learn new skills, and raise your game. Canonical provides a unique window into the world of 21st-century digital business.</p>\n<h2>Canonical is an equal opportunity employer</h2>\n<p>We are proud to foster a workplace free from discrimination. Diversity of experience, perspectives, and background create a better work environment and better products. <a href=\"https://canonical.com/careers/diversity/identity\">Whatever your identity, we will give your application fair consideration.</a></p>\n<p>#LI-remote&nbsp;</p>\n<p>Requisition ID: 263</p><p></p>\n    ","tags":"[\"engineering\",\"database\"]","pubDate":"2023-11-21 04:48:20.045","link":"https://canonical.com/careers/5517891","savedDate":"2023-11-21 04:48:20.045","slug":"senior-site-reliability-gitops-engineer-canonical-7653"},{"id":4744743470,"title":"Business Operations Manager","company":"Getro","image":"https://pbs.twimg.com/profile_images/1346314882648444928/c0g2OpD7_400x400.jpg","description":"\n    \n\n    <p>Getro’s Operations team led the charge in building a healthy SaaS business in<a href=\"https://www.linkedin.com/posts/evanwalden_startups-end-a-bruising-2022-stare-down-activity-7016085407658295296-_Q7I?utm_source=share&amp;utm_medium=member_desktop\"> 2022</a>. Come join a mission-oriented company where Operations is empowered to make a meaningful business impact. In this pivotal moment, we’re seeking an experienced Business Operations Manager to form part of our core team (first 30 employees).&nbsp; This role will report to the COO.<strong>&nbsp; Note: this is a part time role to begin.</strong></p>\n<h2>What’s Getro:&nbsp;</h2>\n<p>Getro helps people connect to life changing professional opportunities through trusted networks. Who’s a trusted network?&nbsp;</p>\n<h3>Our customers:&nbsp;</h3>\n<p>We help 700+ independent professional networks — including venture capital funds (<a href=\"https://jobs.lererhippeau.com/jobs\">Lerer Hippeau</a>), web3 organizations (<a href=\"https://www.polygon.technology/ecosystem-jobs\">Polygon</a>), accelerators (<a href=\"https://jobs.techstars.com/jobs\">Techstars</a>), membership communities (<a href=\"https://queertech.getro.com/jobs\">QueerTech</a>), economic development organizations&nbsp; (<a href=\"https://careers.thisiscny.com/jobs\">Good Life CNY</a>), universities (<a href=\"https://jobs.entrepreneurs.utoronto.ca/jobs\">University of Toronto</a>), and more — make better introductions for their member and measure the outcomes of the introductions they make in their networks. How?</p>\n<p>Our Products:</p>\n<ul>\n<li>GetroJobs, which automatically aggregates jobs across a network of companies, making network opportunities visible;</li>\n<li>GetroConnect, which allows talent within the network to connect with those opportunities and companies, facilitating introductions and referrals.&nbsp;</li>\n</ul>\n<p>If you’ve ever hired or been hired through a referral, you know how powerful the right introduction can be. That’s the power of Getro.&nbsp;&nbsp;</p>\n<h2>You, as a person:&nbsp;</h2>\n<ul>\n<li>You are a passionate person, and care about combining human technology and empathy</li>\n<li>You are highly driven and proactive - you make things happen</li>\n<li>You practice committed ownership - you own your projects from beginning to end, you ask for buy-in to make better decisions, but aren’t paralyzed without it. When things go wrong, you accept accountability for your part without blaming others, and share your learnings openly</li>\n<li>You are detail &amp; process oriented</li>\n<li>You are a proactive communicator and team player</li>\n<li>You make decisions with facts</li>\n<li>You work between the CT and CEST time zones&nbsp;</li>\n<li>Equal parts human / analytical</li>\n</ul>\n<h2><strong>&nbsp;</strong>You, as an expert:&nbsp;</h2>\n<ul>\n<li>Experience working at a pre Series B company</li>\n<li>Min. 3 years in startup operations, finance, consulting, general management, backoffice, data, or other analytical roles (we can adjust the role scope if you're coming with more than that)</li>\n<li>Effective written communicator&nbsp;</li>\n<li>Strong data orientation / analytical skills</li>\n<li>Plus: you self define as someone who gets things done</li>\n</ul>\n<h2>A Week in the Life of a Biz Ops Manager at Getro:</h2>\n<ul>\n<li>Async Loom alignment with our COO to prioritize open projects you're working on&nbsp;</li>\n<li>Running a meeting with our external accountants (we work with Zeni) to dig into a 30% jump in Operating Expenses last month, and make the journal entries in Quickbooks to close the books&nbsp;</li>\n<li>Presenting a cost / benefit analysis with your recommendation on which HR platform for distributed workforces is best for Getro&nbsp;</li>\n<li>Finishing a Vendor Order form to help Sales Close a new Deal&nbsp;&nbsp;</li>\n<li>Leading onboarding for a new Employee, levering our internal knowledge center, which you own (we use Guru)&nbsp;&nbsp;&nbsp;</li>\n<li>Preparing KPIs for the next board meeting and the next company All Hands Presentation</li>\n</ul>\n<h2>Perks:</h2>\n<ul>\n<li>100%<a href=\"https://www.getro.com/blog/5-benefits-of-remote-working/\"> remote</a>, 100% flexible: We trust each member of our team to work when they wish, and from a location they choose (between the CT and CEST time zones). We believe in working smarter, not harder.&nbsp;</li>\n<li>Salary: $42-60k for 20 hours / week</li>\n<ul>\n<li>Why the range? We decide salaries based on the<a href=\"https://www.getro.com/blog/the-future-of-remote-working-and-cost-of-living-adjustments-cola/\"> cost of living</a> where you're based&nbsp;</li>\n</ul>\n<li>$200 / month cash coworking stipend&nbsp;</li>\n<li>Generous Employee Stock Options with an attractive strike price</li>\n<li><a href=\"https://www.getro.com/about-us/\">Unique culture</a>: we are humans first and believe that work is more fulfilling when we can show our full selves to the people we work with</li>\n<li>Make an impact: help shape the path of an early-stage team</li>\n</ul>\n<h2>About Getro:&nbsp;</h2>\n<h3>Our team:&nbsp;</h3>\n<ul>\n<li>Techstars 2017 graduates</li>\n<li>Our co-founders have been working together in the recruiting space for the last 10 years and are multi-time founders</li>\n<li>Remote-first company since 2018&nbsp;</li>\n<li>21 team members across 7+ countries (<a href=\"https://www.linkedin.com/feed/update/urn:li:activity:6967436011714846720?utm_source=share&amp;utm_medium=member_desktop\">Hear from Ted</a> &amp;<a href=\"https://www.linkedin.com/posts/getro-com_get-to-know-thomas-activity-6971090675580719104-v0ta?utm_source=share&amp;utm_medium=member_desktop\"> meet Thomas</a> from our team)&nbsp;</li>\n<li>As a fully remote company, we don't have offices, but we do get together virtually and in-person for Summits (Germany, Cape Town, San Fran, Portugal...)&nbsp;</li>\n</ul>\n<h3>How we work:</h3>\n<p>We're ambitious but realistic - we know anything worth doing takes time. We trust each member of our team to work when they wish, and from a location they choose. We believe in working smarter, not harder - we don't value presenteeism and we're not impressed by long working hours. Above all, we value the contribution of each individual and take seriously our responsibility to enable you to work on things you love. These aren't just words - they're part of everything we do, including how we design our products.</p>\n<h3>One last thing:</h3>\n<p>Don’t meet every single requirement? Studies have shown that women and people of color are less likely to apply to jobs unless they meet every single qualification. At Getro we are dedicated to building a diverse, inclusive and authentic workplace, so if you’re excited about this role but your past experience doesn’t align perfectly with every qualification in the job description, we encourage you to apply anyway. You may be just the right candidate for this role, or others. :)</p>\n\n    \n\n    \n","tags":"[\"Finance\",\"management\"]","pubDate":"2023-11-21 04:48:20.044","link":"https://boards.greenhouse.io/getro/jobs/5812252003","savedDate":"2023-11-21 04:48:20.044","slug":"business-operations-manager-getro-2154"},{"id":6825694386,"title":"\n            Senior People Operations Manager (Remote)\n          ","company":"DuckDuckGo","image":"https://spreadprivacy.com/content/images/2023/05/duckduckgo-logo_wide.png","description":"\n            <p>Hi, we’re DuckDuckGo, the Internet privacy company for everyone who wants to take back their privacy now. For over a decade, we've been building our all-in-one product, developing new privacy technology, and working with policymakers to make online privacy simple and accessible for all. </p>\n<p><br></p>\n<p>Our app is now downloaded more than 78M times a year, and our private search engine packaged with it has become the #2 search engine on mobile in the United States and 18 other countries, including the United Kingdom, Canada, Australia, Germany, and the Netherlands. Oh, and we've been profitable since 2014, with revenue exceeding $100 million a year! Now, we’re rolling out a suite of new privacy solutions, including <u><a href=\"https://www.spreadprivacy.com/introducing-email-protection-beta/\" rel=\"noopener\">Email Protection</a></u>,  <u><a href=\"https://spreadprivacy.com/introducing-app-tracking-protection/\" rel=\"noopener\">App Tracking Protection</a></u> and our first-ever Desktop Apps for <u><a href=\"https://spreadprivacy.com/introducing-duckduckgo-for-mac/\" rel=\"noopener\">Mac</a></u><a href=\"https://spreadprivacy.com/introducing-duckduckgo-for-mac/\" rel=\"noopener\"> </a>and <u><a href=\"https://spreadprivacy.com/windows-browser-open-beta/\" rel=\"noopener\">Windows</a></u>.</p>\n<p><br></p>\n<p>We’re looking for a Senior People Operations Manager to help shape our all-in-one privacy solution and join our mission to show the world that protecting your privacy online can be simple.  </p>\n<p><br></p>\n<p><strong>The Opportunity</strong> </p>\n<p>In this role, you will leverage your empathy, critical thinking, and wealth of experience to empower individuals and teams across DuckDuckGo to achieve our goals. </p>\n<p><br></p>\n<p>Our People Ops organization is hands-on and committed to providing a high level of service, which is scaling with the company. You'll provide guidance through high-touch performance management, which will require you to constantly learn about new domains in order to provide exceptional support. You'll apply this same quality bar to your support of Functional Teams as they navigate the changes that come with a scaling tech organization. </p>\n<p><br></p>\n<p>DuckDuckGo operates on a distributed leadership model that will ask you to question your assumptions and creatively apply your knowledge in forward-thinking ways to serve the team as you identify and execute projects to serve the organization. We've got team members in 20+ countries working on unique challenges in online privacy, and the People Operations team provides them with the support they need to succeed.</p>\n<p><br></p>\n<p><strong>What You Will Bring to DuckDuckGo</strong> </p>\n<ul>\n<li>7+ years of People Operations experience working in a tech-driven organization, with deep experience in professional development, performance management, organizational behavior, employee relations, and labor law and compliance.&nbsp;</li>\n<li>Ability to effectively resolve complex engagement, performance, and employee relations issues with discretion, humanity, and critical thinking.</li>\n<li>Ability to adapt an HR Business Partner mindset to a distributed environment and identify the highest-leverage ways to serve our teams.</li>\n<li>Experience leading projects, process improvements, and substantive change within high-growth organizations.</li>\n<li>Ability to lead and collaborate on high-impact and complex projects from proposal through postmortem.  </li>\n<li>Skills to wrangle vague problems, propose innovative solutions, and execute them with a strong focus on metrics. </li>\n<li>Proven conflict resolution skills and keen emotional intelligence.</li>\n<li>Exceptional verbal and written communication skills.</li>\n</ul>\n<p><br></p>\n<p><strong>How We Will Support You </strong> </p>\n<p>Our core values -- build trust, question assumptions, and validate direction -- underpin how we work day-to-day and the support we give our team members. We strive to empower our team members to be self-directed and self-motivated in their work.  </p>\n<p><br></p>\n<ul>\n<li>\n<strong>Remote First, Always</strong>: We've always been a fully distributed company with team members all over the world. We trust you to get your work done wherever, and whenever.   </li>\n<li>\n<strong>Commitment to Personal Growth:</strong> Every team member has an annual budget of $1,250 USD to invest in their professional development. &nbsp;Every team member also has a dedicated Career Advisor, who serves as a guide to help you develop your strengths, identify your motivations, and understand your opportunities for growth. </li>\n<li>\n<strong>Leadership:</strong> We have many different types of leaders and possible combinations of leadership roles, so you can grow your career in a way that aligns best with your personal goals. You can seek additional leadership roles by being directly responsible for projects, taking ownership of areas of the company, developing and maintaining internal processes, or pursuing advisory roles. </li>\n<li>\n<strong>Work/Life Balance: </strong>Team members have the freedom and flexibility to organize their own work schedules. We want you to thrive both in and out of the office. We trust you to use good judgment and take the time off that you need to bring your best self to work.  </li>\n</ul>\n<p><br></p>\n<p>We also offer paid parental leave, a co-working stipend, office setup reimbursement, and a wellness stipend. More support resources can be found in our <u><a href=\"https://duckduckgo.com/assets/hiring/team_support_guide.pdf\" rel=\"noopener\">Team Member Support Guide</a></u>, which explains how we make your well-being a priority. </p>\n<p><br></p>\n<p>For more information on how we collaborate worldwide, from leadership in our relatively flat organization to start-to-finish ownership<strong>,</strong> check out <u><a href=\"https://duckduckgo.com/assets/hiring/how_we_work.pdf\" rel=\"noopener\">DuckDuckGo Culture: How We Work.</a></u> </p>\n<p><br></p>\n<p><strong>Compensation</strong> </p>\n<p>Annual compensation: $176,000 USD and stock options. Compensation is the same within a professional level, regardless of geographic location or functional area, and the compensation for each professional level is transparent across the organization.</p>\n<p><br></p>\n<p><strong>Hiring Process</strong> </p>\n<p>Hiring works best when it's a two-way street. Learn how we help you get to know DuckDuckGo and envision your future role here. Find out more about <u><a href=\"https://duckduckgo.com/assets/hiring/how_we_hire.pdf\" rel=\"noopener\">how we hire</a></u>. </p>\n<p><br></p>\n<p><strong>Diversity, Equity, and Inclusion</strong> </p>\n<p>DuckDuckGo provides equal work opportunities to all team members and applicants<u>,</u> and it prohibits discrimination and harassment of any type on the basis of race, color, ethnicity, caste, religion, age, sex (including pregnancy), national origin, disability status, genetics, protected veteran status, sexual orientation, gender identity or expression, or any other characteristic protected by our policies or federal, state, or local laws.</p>\n<p><br></p>\n<p>We want to ensure that our hiring process is accessible. If you need reasonable accommodation for any part of the application process because of a medical condition or disability, please send an email to <u><a href=\"mailto:careers@duckduckgo.com\" rel=\"noopener\">careers@duckduckgo.com</a></u> to let us know the nature of your request.  </p>\n<p><br></p>\n<p>If you think you might thrive in this environment, we would love to hear from you. </p>\n<p><br></p>\n<p><strong>Please note that:</strong> </p>\n<ol>\n<li>Sometimes we meet up! Expect to travel at least two times a year: once for our all-hands meetup and again for a team retreat (each around 4-5 days). While extenuating circumstances may impact attendance, everyone is strongly encouraged to attend.</li>\n<li>While we offer a flexible work arrangement with no core hours, expect an average full-time commitment of 40 hours per week. </li>\n<li>A successful candidate will be subject to a background check and must receive satisfactory results of the same, as a condition of joining the team. </li>\n<li>By applying for this role, you confirm that all information submitted is accurate and complete. You further acknowledge that providing false or fraudulent information during the application process is cause for denial of an offer, revocation of any existing offer, or other adverse action, up to and including termination after the start of your commencement of work.  </li>\n</ol>\n<p><br></p>\n<p>#LI-DNI</p>\n          ","tags":"[\"management\",\"aws\"]","pubDate":"2023-11-21 04:48:20.043","link":"https://duckduckgo.recruitee.com/o/senior-people-operations-manager","savedDate":"2023-11-21 04:48:20.043","slug":"senior-people-operations-manager-remote-duckduckgo-7787"},{"id":2856116894,"title":"Sr. Product Marketing Manager","company":"Timescale","image":"https://pbs.twimg.com/profile_images/1542681228666671107/L5LYJLAD_400x400.png","description":"&lt;p&gt;&lt;strong&gt;Sr. Product Marketing Manager&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;We are looking for a Sr. Product Marketing Manager to help us take our category-defining PostgreSQL database platform to market. The new hire will be responsible for equipping our sales and marketing teams with the tools, resources and knowledge they need to effectively communicate the value of Timescale&#39;s products to our customers.&lt;/p&gt;\n&lt;p&gt;The ideal candidate will have a strong background in working with technical products, particularly developer tools, possess the ability to craft compelling narratives that resonate with developers and business buyers and have extensive experience doing sales and marketing enablement.&lt;/p&gt;\n&lt;p&gt;&lt;em&gt;This role is remote, and English language fluency is a requirement. Due to the location of our team and customers, the ideal candidate would be located in the Eastern North American time zone.&amp;nbsp;&amp;nbsp;&lt;/em&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Responsibilities&lt;/strong&gt;&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;Develop and execute the sales enablement strategy, including writing and organizing our sales enablement materials and rolling them out to our sales team.&lt;/li&gt;\n&lt;li&gt;Develop buyer personas and customer segments and adapt our product positioning for different audiences.&lt;/li&gt;\n&lt;li&gt;Work with our amazing customers to create customer success stories.&lt;/li&gt;\n&lt;li&gt;Research and stay informed about industry trends, competitor activities, and customer needs to shape effective sales strategies.&lt;/li&gt;\n&lt;li&gt;Collect and analyze data that supports our solutions in the market to buyers.&lt;/li&gt;\n&lt;li&gt;Collaborate with product management, sales, and marketing teams to ensure alignment on messaging,positioning, and go-to-market activities.&lt;/li&gt;\n&lt;li&gt;Find our customer advocates through relationships with sales reps and via social media, then nurture them and help them promote our cause.&lt;/li&gt;\n&lt;li&gt;Work closely with the demand generation team to develop campaigns that support sales objectives.&lt;/li&gt;\n&lt;li&gt;Use data (including social media experiments, user research, market insights, and product understanding) to hone messaging, identify the best go-to-market strategies, and segment the market most effectively.&amp;nbsp;&lt;/li&gt;\n&lt;li&gt;Partner with sales to run win / loss analysis and identify improvements across product, marketing and sales to increase our win rate.&lt;/li&gt;\n&lt;li&gt;Work with marketing and product to write compelling content (e.g. blogs, website copy) for our audience.&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;&lt;strong&gt;Experience and Skills&lt;/strong&gt;&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;5+ years of product marketing experience, with a focus on sales and marketing enablement. At least 2 years of experience with &lt;strong&gt;technical products for developers&lt;/strong&gt;.&lt;/li&gt;\n&lt;li&gt;3+ years of experience working remotely with a globally distributed team.&lt;/li&gt;\n&lt;li&gt;Proven track record of developing and executing successful sales enablement programs.&lt;/li&gt;\n&lt;li&gt;&lt;strong&gt;Entrepreneurial mindset&lt;/strong&gt; with a strong sense of ownership, urgency and problem-solving skills - Timescale is moving fast, and so should you. Trying things, making mistakes, and quickly improving are in our DNA.&lt;/li&gt;\n&lt;li&gt;Excellent written and verbal communication skills with the ability to convey complex technical concepts in a clear and compelling manner to both internal audience and target customer audiences.&lt;/li&gt;\n&lt;li&gt;Ability to work collaboratively in a fast-paced, cross-functional environment.&lt;/li&gt;\n&lt;/ul&gt;&lt;div class=&quot;content-conclusion&quot;&gt;&lt;p&gt;By applying for this position, you are agreeing to &lt;a href=&quot;https://www.timescale.com/legal/timescale-applicant-privacy-note&quot; target=&quot;_blank&quot;&gt;Timescale&#39;s Applicant Privacy Notice.&lt;/a&gt;&amp;nbsp;&lt;/p&gt;&lt;/div&gt;","tags":"[\"postgres\",\"management\",\"legal\",\"database\"]","pubDate":"2023-11-21 04:48:20.043","link":"https://www.timescale.com/careers/7028461002?gh_jid=7028461002","savedDate":"2023-11-21 04:48:20.043","slug":"sr-product-marketing-manager-timescale-1346"},{"id":9175160405,"title":"Account Executive - REMOTE/ Work Anywhere","company":"CloudLinux","image":"https://pbs.twimg.com/profile_images/696718028084482050/ymY3OEPk_400x400.png","description":"<p>CloudLinux is a global remote-first company. We are driven by our principles: Do the right thing, employees first, we are remote first, and we deliver high volume, low-cost Linux infrastructure and security products that help companies to increase the efficiency of their operations. Every person on our team supports each other and does what we can to ensure everyone is successful. We are truly a great place to work.</p><p></p><p>The TuxCare division of CloudLinux Inc. is on a mission to minimize the world’s risk of cyber exploitation. Through its automated live security patching solutions and extended lifecycle support services for Linux and open-source software and languages, TuxCare allows thousands of organizations to rapidly remediate vulnerabilities for increased security and compliance.&nbsp; The world’s largest enterprises, government agencies, service providers, universities, and research institutions are protected by TuxCare on over one million workloads and growing.&nbsp; For more information, go to <a href=\"http://tuxcare.com/\" rel=\"nofollow noreferrer noopener\" class=\"external\">tuxcare.com</a>.</p><p></p><p>We are looking for an experienced Enterprise sales person with a strong background in selling Linux products. As our Account Executive, you will work directly with the Chief Revenue Officer and have the opportunity to drive the growth of our Enterprise business. Your ability to work independently and manage complex sales will be valued.&nbsp;</p><p></p><p><strong>As our TuxCare Account Executive you will:</strong></p><ul> <li>Research, plan, and implement new target market initiatives</li> <li>Create development plans, forecast sales targets, and growth projections</li> <li>Move solid leads through the marketing funnel, and close business</li> <li>Discover and build multiple Champions in multiple departments to ensure successful sales</li> <li>Create cost justifications to meet each of department’s needs</li> <li>Collaborate with the CRO to ensure the company's goals and targets are met</li> <li>Identify market opportunities through meetings, networking and other channels</li> <li>Meet existing and potential clients and building positive relationships</li> <li>Attend events such as exhibitions and conferences</li> <li>Prepare sales presentations and participate in sales meetings</li> <li>Produce reports for management</li> <li>Research prospective accounts in target markets</li> </ul><h3>Requirements: </h3><p><strong>As our TuxCare Account Executive you will:</strong></p><ul> <li>Research, plan, and implement new target market initiatives</li> <li>Create development plans, forecast sales targets, and growth projections</li> <li>Move solid leads through the marketing funnel, and close business</li> <li>Discover and build multiple Champions in multiple departments to ensure successful sales</li> <li>Create cost justifications to meet each of department’s needs</li> <li>Collaborate with the CRO to ensure the company's goals and targets are met</li> <li>Identify market opportunities through meetings, networking and other channels</li> <li>Meet existing and potential clients and building positive relationships</li> <li>Attend events such as exhibitions and conferences</li> <li>Prepare sales presentations and participate in sales meetings</li> <li>Produce reports for management</li> <li>Research prospective accounts in target markets</li> </ul><p></p><p><strong>To be successful you should have;</strong></p><ul> <li>Proven experience selling Enterprise SaaS products preferably within the Linux, Cyber Security industry</li> <li>Deep understanding of the Linux industry</li> <li>Strong drive to build and grow business&nbsp;</li> <li>Ability to lead and mentor junior team members </li> </ul><h3>Benefits: </h3><p><strong>What's in it for you?</strong></p><ul> <li>A focus on professional development;</li> <li>Training reimbursements</li> <li>Mentor programs</li> <li>Knowledge-Exchange programs</li> <li>Interesting and challenging projects </li> <li>Flexible working hours</li> <li>Paid 24 days of vacation per year and unlimited sick leave</li> <li>Medical insurance reimbursement</li> <li>Co-working and gym/sports reimbursement</li> <li>The opportunity to receive a reward for the most innovative idea that the company can patent.</li> </ul><p><em>By applying for this position, you agree with </em><a href=\"https://cloudlinux.com/privacy-policy\" rel=\"nofollow noreferrer noopener\" class=\"external\"><em>Cloudlinux Privacy Policy</em></a><em> and give us your consent to maintain and process your personal data with this respect. Please read our Privacy Policy for more information.</em></p>","tags":"[\"management\",\"cyber security\"]","pubDate":"2023-11-20 00:00:00.000","link":"https://apply.workable.com/cloudlinux-1/j/8AE8E5AE1B","savedDate":"2023-11-21 04:48:20.048","slug":"account-executive-remote-work-anywhere-cloudlinux-6844"},{"id":1516308588,"title":"Business Systems Analyst","company":"Nitka","image":"https://remotive.com/job/1839462/logo","description":"<p><strong>Nitka Technologies</strong>'s developing software for customers in the US and Europe and brings together about 300 professionals from Eastern Europe, North and South America, Armenia, Georgia and Kazakhstan.</p>\n<p>We are looking for an experienced<strong> Business Systems Analyst </strong>on a long-term project. The customer is an American real estate company. </p>\n<p><strong>The main task</strong> is to help build, advise, and orchestrate the development of its specific enterprise data warehouse platform on a big data platform (both data lake and<br>lake house).</p>\n<p><strong>About the project</strong>: the most visited site in the US for the sale, purchase, rental of real estate.</p>\n<p><strong>We offer 100% full-time remote work with a flexible schedule.</strong></p>\n<p><strong>Requirements:</strong></p>\n<ul style=\"\">\n<li style=\"\">5+ years of business systems experience within a consumer lending institution<br>5+ years of experience collaborating across multiple functional/technical teams to deliver projects</li>\n<li style=\"\">Experience with the database side of line of business applications such as Workday, Loan Origination Systems such as Encompass, Salesforce CRM</li>\n<li style=\"\">Agile/SCRUM or agile-variant software development methodologies, JIRA experience preferred.</li>\n<li style=\"\">Hands on experience required with any one or more reporting tools like Power BI, Tableau, Airflow, DBT or other ETL tool</li>\n<li style=\"\">Hands on experience with SQL &amp; scripting ETL workflows</li>\n<li style=\"\">Strong experience building, writing and executing test cases</li>\n<li style=\"\">Spoken English at Intermediate level and above for communication with the customer and the team</li>\n</ul>\n<p><strong>Working conditions:</strong></p>\n<ul style=\"\">\n<li style=\"\">Remote work</li>\n<li style=\"\">Full-time (8 hours/day)</li>\n<li style=\"\">Flexible schedule, but presence at the workplace is required from 10 to 14 PST (Los Angeles time)</li>\n<li style=\"\">Attractive USD compensation</li>\n<li style=\"\">Paid vacation, holidays</li>\n</ul><img src=\"https://remotive.com/job/track/1839462/blank.gif?source=public_api\" alt=\"\"/>","tags":"[\"big data\",\"salesforce\",\"scrum\",\"sql\",\"agile\",\"jira\",\"CRM\",\"tableau\",\"ETL\",\"warehouse\",\"scripting\",\"workday\"]","pubDate":"2023-11-18 11:20:58.000","link":"https://remotive.com/remote-jobs/business/business-systems-analyst-1839462","savedDate":"2023-11-21 04:48:20.039","slug":"business-systems-analyst-nitka-3241"},{"id":9408177863,"title":"Jr. Security Engineer","company":"MURAL","image":"https://remotive.com/job/1834373/logo","description":"<div class='\"content-intro\"'>\n<div class=\"h2\"><img alt='\"\"' height='\"120\"' src=\"%22https:/i.imgur.com/CoZ3lG4.png%22\" width='\"700\"'></div>\n<div class=\"h2\">We’re on a mission to empower innovation through a culture of collaboration by providing teams the means and methods to turn ideas and insights into reality.</div>\n<p>Founded in 2011, Mural is a leading innovator in visual collaboration for hybrid, remote, and distributed teams. We believe in what we build, and our team of more than 400 “Muralistas” around the world collaborate in the Mural® app. Our values guide our intentionally inclusive product and culture, which includes collaboration design education and a flexible monthly stipend for learning, wellness, and coworking.<br><br>Mural has raised $200M to date and is growing rapidly to fulfill our mission. The company is trusted by 95% of the Fortune 100, including innovative teams at IBM, Intuit, GitLab, Microsoft, and Atlassian.</p>\n</div>\n<div class=\"h3\">ABOUT THE TEAM</div>\n<p>The Infrastructure Security team plays a vital role in identifying and mitigating risks within the Mural infrastructure as well as partnering with other engineering teams to recommend updates and features that enhance security for our customers.</p>\n<div class=\"h3\">YOUR MISSION</div>\n<p>As a Jr Security Engineer, you will work within the security team to help maintain and support the organization's security posture. The primary responsibility is to assist in implementing, maintaining, monitoring and troubleshooting security tools and technologies for protecting the organization's assets against internal and external threats.</p>\n<div class=\"h3\">WHAT YOU'LL DO</div>\n<p>The top candidate will bring experience working with small to medium, high growth, global tech companies:</p>\n<ul style=\"\">\n<li style=\"\">Monitor security alerts, events, and incidents, and provide initial analysis and response.</li>\n<li style=\"\">Respond to security incidents and provide analysis and remediation recommendations.</li>\n<li style=\"\">Assist in maintaining security systems and tools, SIEM, vulnerability management, DLP and antivirus software.</li>\n<li style=\"\">Conduct regular vulnerability assessments and penetration testing of the organization's infrastructure and systems.</li>\n<li style=\"\">Participate in the development and implementation of security policies, procedures, and controls.</li>\n<li style=\"\">Provide support for security-related audits and compliance initiatives.</li>\n<li style=\"\">Educate end-users on safe security practices and policies.</li>\n<li style=\"\">Keep up-to-date on the latest security trends, threats, and technologies.</li>\n<li style=\"\">Excellent command of English, both written and verbal</li>\n</ul>\n<div class=\"h3\">WHAT YOU'LL BRING</div>\n<ul style=\"\">\n<li style=\"\">Understanding of SaaS environments</li>\n<li style=\"\">Experience with log analytics and threat hunting</li>\n<li style=\"\">Experience with vulnerability assessment tools and techniques</li>\n<li style=\"\">Experience with Docker and Kubernetes</li>\n<li style=\"\">Fair understanding of Linux, Networking, and Cryptography fundamentals</li>\n<li style=\"\">Experience with CI/CD pipelines</li>\n<li style=\"\">Strong analytical skills with the ability to identify and resolve security issues</li>\n<li style=\"\">Experience with incident response activities</li>\n</ul>\n<p>If you have participated in public or private Bug Bounty programs, or have any other open source or community contributions, presentations, or blog posts in the security space, please share it with us!</p>\n<p>For roles based in New York City, California, Colorado, and Washington, the base salary for this role ranges from $105,400 - $125,800 + equity + benefits. Compensation offered will be determined by factors such as location, level, job-related knowledge, skills, and experience. Certain roles may be eligible for variable compensation.</p>\n<div class='\"content-conclusion\"'>\n<div class=\"h3\">Equal Opportunity </div>\n<p>We will ensure that individuals with disabilities are provided reasonable accommodation to participate in the job application or interview process, to perform essential job functions, and to receive other benefits and privileges of employment. Please contact us to request accommodation.</p>\n</div>\n<img src=\"https://remotive.com/job/track/1834373/blank.gif?source=public_api\" alt=\"\"/>","tags":"[\"crypto\",\"docker\",\"kubernetes\",\"saas\",\"security\",\"open source\",\"CI/CD\",\"analytics\",\"gitlab\",\"troubleshooting\",\"Linux/Unix\",\"infrastructure security\",\"testing\",\"infrastructure\",\"vulnerability management \"]","pubDate":"2023-11-18 09:21:24.000","link":"https://remotive.com/remote-jobs/devops/jr-security-engineer-1834373","savedDate":"2023-11-21 04:48:20.040","slug":"jr-security-engineer-mural-8114"},{"id":2921240466,"title":"PPC Manager","company":"Recruiter4you","image":"https://remotive.com/job/1838129/logo","description":"<p>Our client is a full remote Marketing company working primarily with iGaming which is looking for an experienced and result-driven PPC Manager to join their remote team.<br><br><strong>Responsibilities:</strong></p>\n<ul style=\"\">\n<li style=\"\">Highly proficient with the execution and creation of PPC campaigns.</li>\n<li style=\"\">The ability to clearly demonstrate and communicate marketing strategies.</li>\n<li style=\"\">Delivery of “best in class’” media strategy.</li>\n<li style=\"\">Stay up to date with the latest technologies and best practices.</li>\n<li style=\"\">Thorough understanding of how to measure ROI within the marketing mix.</li>\n<li style=\"\">Deliver recommendations and plans for the most effective use of client’s marketing budgets.</li>\n<li style=\"\">Highly proficient with Google Analytics .</li>\n<li style=\"\">Day-to-day execution of Tag Management platforms.</li>\n<li style=\"\">Motivate the digital marketing team to achieve goals.</li>\n<li style=\"\">Monitor competition and provide suggestions for improvement.</li>\n</ul>\n<p><strong>Requirements:</strong></p>\n<ul style=\"\">\n<li style=\"\">2+ years of experience as a PPC Specialist/Digital Marketing Specialist/Account Manager managing Google Ads</li>\n<li style=\"\">Expert knowledge of different digital marketing channels.</li>\n<li style=\"\">Knowledge and experience with online marketing tools and best practices.</li>\n<li style=\"\">Interest in becoming more knowledgeable across the entire marketing mix</li>\n<li style=\"\">Sense of ownership and pride in your performance and its impact on a company’s success</li>\n<li style=\"\">Critical thinker and problem-solving skills</li>\n<li style=\"\">Team player</li>\n<li style=\"\">Good time-management skills</li>\n<li style=\"\">Great interpersonal and communication skills</li>\n</ul>\n<img src=\"https://remotive.com/job/track/1838129/blank.gif?source=public_api\" alt=\"\"/>","tags":"[\"analytics\",\"digital marketing\",\"PPC\",\"google analytics\",\"google ads\"]","pubDate":"2023-11-17 23:21:04.000","link":"https://remotive.com/remote-jobs/all-others/ppc-manager-1838129","savedDate":"2023-11-21 04:48:20.040","slug":"ppc-manager-recruiter4you-2575"},{"id":6489102954,"title":"Tax Specialist (she/he/they)","company":"Trafilea","image":"https://remotive.com/job/1837171/logo","description":"<p dir=\"ltr\"><strong>About Trafilea</strong></p>\n<p dir=\"ltr\">Trafilea is a dynamic and innovative Tech E-commerce Group that operates multiple direct-to-consumer brands in the intimate apparel and beauty sectors, with a focus on using data-driven strategies to scale their businesses. In addition to our products, we have our own online community dedicated to promoting body positivity. As a rapidly growing global player, Trafilea is committed to creating high-quality products and services that enhance the customer experience and drive long-term growth.</p>\n<p dir=\"ltr\"><a href=\"https://truekind.com/\" rel=\"nofollow\"> </a></p>\n<p dir=\"ltr\"><strong>Finance @ Trafilea</strong> At Trafilea, we foster a culture of collaboration, innovation, and continuous learning. We believe in investing in our people, providing them with the support and development opportunities they need to grow both personally and professionally. With our remote-first approach, you'll have the freedom to work from anywhere in the world, surrounded by a diverse and talented team that spans the globe.<em><br></em></p>\n<p dir=\"ltr\"> </p>\n<p dir=\"ltr\"><em>We are looking for a <em>Tax Specialist</em> who will have a tremendous opportunity for impact and ownership from day one, bridging new ideas to the company and helping us build a tax compliance foundation that scales with our growth.</em><em><br></em></p>\n<p><strong><strong><br></strong></strong><strong>Expected outcomes &amp; responsibilities</strong></p>\n<ul style=\"\">\n<li dir=\"ltr\" style=\"\">\n<p dir=\"ltr\">Monitor any new tax regulations that might affect the company worldwide.</p>\n</li>\n<li dir=\"ltr\" style=\"\">\n<p dir=\"ltr\">Participate in new business projects as a business partner providing tax insights.</p>\n</li>\n<li dir=\"ltr\" style=\"\">\n<p dir=\"ltr\">Participate in tax processes definition and implementation related to the tax team.</p>\n</li>\n<li dir=\"ltr\" style=\"\">\n<p dir=\"ltr\">Attend potential tax audits and external audit requests, providing tax documentation.</p>\n</li>\n<li dir=\"ltr\" style=\"\">\n<p dir=\"ltr\">Compile and review monthly, quarterly, and annual tax data for tax return filings managed by external advisors.</p>\n</li>\n<li dir=\"ltr\" style=\"\">\n<p dir=\"ltr\">Ensure the property tax collection accuracy, addressing and following up any possible issue.</p>\n</li>\n<li dir=\"ltr\" style=\"\">\n<p dir=\"ltr\">Control of the monthly tax reconciliation from different sales platforms with the accounting balances.</p>\n</li>\n<li dir=\"ltr\" style=\"\">\n<p dir=\"ltr\">Monthly tax payments estimations for cash flow analysis.</p>\n</li>\n<li dir=\"ltr\" style=\"\">\n<p dir=\"ltr\">Support in the accounting closing process, to accomplish month-end, quarter-end, and year-end close procedures for the tax accounts.</p>\n</li>\n<li dir=\"ltr\" style=\"\">\n<p dir=\"ltr\">Compile and review monthly invoicing information of the different sales channels assigned.</p>\n</li>\n</ul>\n<div><strong>Experience/ Qualifications</strong></div>\n<ul style=\"\">\n<li style=\"\">Academic Level: Bachelor’s Degree in Accounting, Finance, or Equivalent to (Accounting and Finance).</li>\n<li style=\"\">Minimum 6 years of experience in a tax position. Big Four experience as Tax Consultant + tax experience in a Multinational Company will be valued.</li>\n<li style=\"\">Tax experience in Value Added Tax, Corporate Income Tax, Transfer Pricing and Tax Withholdings is a must.</li>\n<li style=\"\">Preferably experience in international taxes and knowledge of tax treaties applications</li>\n<li style=\"\">US, Canadian and Uruguayan tax knowledge is a plus</li>\n<li style=\"\">Advanced Excel is a must</li>\n<li style=\"\">Excellent spoken and written English is a must.</li>\n<li style=\"\">Ecommerce and retail experience is a plus.</li>\n<li style=\"\">Experience using Netsuite or another ERP is a plus.</li>\n<li style=\"\">Experience using Shopify, BigCommerce or Amazon platform is a plus.</li>\n</ul>\n<p dir=\"ltr\"><strong>What We Have to Offer</strong></p>\n<ul style=\"\">\n<li dir=\"ltr\" style=\"\">\n<p dir=\"ltr\">A rich experience including the opportunity to collaborate with world-class talents. Encouraging transparency and open communication to all.</p>\n</li>\n<li dir=\"ltr\" style=\"\">\n<p dir=\"ltr\">A data-driven, dynamic, energetic work environment, full of talented, goal-oriented, and empathetic people working together to grow and develop both as professionals and human beings.</p>\n</li>\n<li dir=\"ltr\" style=\"\">\n<p dir=\"ltr\">A safe space to be who you truly are. We embrace and support diversity, and equity and work hard every day to keep becoming more inclusive.</p>\n</li>\n<li dir=\"ltr\" style=\"\">\n<p dir=\"ltr\">Openness to new ideas and initiatives: You can always join a squad, tribe, or committee, and start new ones. Bring your hobbies and passions and transform them into projects!</p>\n</li>\n</ul>\n<p>We've been recognized by Forbes and FlexJobs as one of the Top 25 Companies for Remote Workers. <strong>Apply now!</strong></p>\n<img src=\"https://remotive.com/job/track/1837171/blank.gif?source=public_api\" alt=\"\"/>","tags":"[\"accounting\",\"amazon\",\"ecommerce\",\"excel\",\"shopify\",\"documentation\",\"retail\",\"NetSuite\",\"diversity\"]","pubDate":"2023-11-17 23:20:52.000","link":"https://remotive.com/remote-jobs/finance-legal/tax-specialist-she-he-they-1837171","savedDate":"2023-11-21 04:48:20.041","slug":"tax-specialist-she-he-they-trafilea-6703"},{"id":9954965689,"title":"Backend Software Engineer","company":"Quinncia Inc.","image":"https://remotive.com/job/1838115/logo","description":"<p> </p>\n<p class=\"styles_sidebar__dp6GL _h_cellSpan_8\" style=\"--tw-border-spacing-x: 0; --tw-border-spacing-y: 0; --tw-translate-x: 0; --tw-translate-y: 0; --tw-rotate: 0; --tw-skew-x: 0; --tw-skew-y: 0; --tw-scale-x: 1; --tw-scale-y: 1; --tw-scroll-snap-strictness: proximity; --tw-ring-offset-width: 0px; --tw-ring-offset-color: #fff; --tw-ring-color: rgba(15,111,255,.5); --tw-ring-offset-shadow: 0 0 #0000; --tw-ring-shadow: 0 0 #0000; --tw-shadow: 0 0 #0000; --tw-shadow-colored: 0 0 #0000; border-width: 0px; border-style: solid; box-sizing: inherit; flex-basis: 368px; flex-shrink: 3; width: 224px; margin-right: 0px; color: #050c26; font-style: normal; font-variant-ligatures: normal; font-variant-caps: normal; font-weight: 400; letter-spacing: normal; orphans: 2; text-align: start; text-indent: 0px; text-transform: none; widows: 2; word-spacing: 0px; -webkit-text-stroke-width: 0px; white-space: normal; background-color: #ffffff; text-decoration-thickness: initial; text-decoration-style: initial; text-decoration-color: initial;\"> </p>\n<div class=\"break-words\" style=\"--tw-border-spacing-x: 0; --tw-border-spacing-y: 0; --tw-translate-x: 0; --tw-translate-y: 0; --tw-rotate: 0; --tw-skew-x: 0; --tw-skew-y: 0; --tw-scale-x: 1; --tw-scale-y: 1; --tw-scroll-snap-strictness: proximity; --tw-ring-offset-width: 0px; --tw-ring-offset-color: #fff; --tw-ring-color: rgba(15,111,255,.5); --tw-ring-offset-shadow: 0 0 #0000; --tw-ring-shadow: 0 0 #0000; --tw-shadow: 0 0 #0000; --tw-shadow-colored: 0 0 #0000; border-width: 0px; border-style: solid; box-sizing: inherit; overflow-wrap: break-word;\"> </div>\n<div class=\"_h_cellSpan_16\" style=\"--tw-border-spacing-x: 0; --tw-border-spacing-y: 0; --tw-translate-x: 0; --tw-translate-y: 0; --tw-rotate: 0; --tw-skew-x: 0; --tw-skew-y: 0; --tw-scale-x: 1; --tw-scale-y: 1; --tw-scroll-snap-strictness: proximity; --tw-ring-offset-width: 0px; --tw-ring-offset-color: #fff; --tw-ring-color: rgba(15,111,255,.5); --tw-ring-offset-shadow: 0 0 #0000; --tw-ring-shadow: 0 0 #0000; --tw-shadow: 0 0 #0000; --tw-shadow-colored: 0 0 #0000; border-width: 0px; border-style: solid; box-sizing: inherit; flex-basis: 752px; flex-shrink: 1.5; width: 752px; margin-right: 16px; color: #050c26; font-style: normal; font-variant-ligatures: normal; font-variant-caps: normal; font-weight: 400; letter-spacing: normal; orphans: 2; text-align: start; text-indent: 0px; text-transform: none; widows: 2; word-spacing: 0px; -webkit-text-stroke-width: 0px; white-space: normal; background-color: #ffffff; text-decoration-thickness: initial; text-decoration-style: initial; text-decoration-color: initial;\">\n<div class=\"styles_description__YKfkn\" style=\"--tw-border-spacing-x: 0; --tw-border-spacing-y: 0; --tw-translate-x: 0; --tw-translate-y: 0; --tw-rotate: 0; --tw-skew-x: 0; --tw-skew-y: 0; --tw-scale-x: 1; --tw-scale-y: 1; --tw-scroll-snap-strictness: proximity; --tw-ring-offset-width: 0px; --tw-ring-offset-color: #fff; --tw-ring-color: rgba(15,111,255,.5); --tw-ring-offset-shadow: 0 0 #0000; --tw-ring-shadow: 0 0 #0000; --tw-shadow: 0 0 #0000; --tw-shadow-colored: 0 0 #0000; border-width: 0px; border-style: solid; box-sizing: inherit; word-break: break-word;\">\n<p style=\"--tw-border-spacing-x: 0; --tw-border-spacing-y: 0; --tw-translate-x: 0; --tw-translate-y: 0; --tw-rotate: 0; --tw-skew-x: 0; --tw-skew-y: 0; --tw-scale-x: 1; --tw-scale-y: 1; --tw-scroll-snap-strictness: proximity; --tw-ring-offset-width: 0px; --tw-ring-offset-color: #fff; --tw-ring-color: rgba(15,111,255,.5); --tw-ring-offset-shadow: 0 0 #0000; --tw-ring-shadow: 0 0 #0000; --tw-shadow: 0 0 #0000; --tw-shadow-colored: 0 0 #0000; border-width: 0px; border-style: solid; box-sizing: inherit; margin: 0px 0px 16px; padding: 0px;\"><strong style=\"--tw-border-spacing-x: 0; --tw-border-spacing-y: 0; --tw-translate-x: 0; --tw-translate-y: 0; --tw-rotate: 0; --tw-skew-x: 0; --tw-skew-y: 0; --tw-scale-x: 1; --tw-scale-y: 1; --tw-scroll-snap-strictness: proximity; --tw-ring-offset-width: 0px; --tw-ring-offset-color: #fff; --tw-ring-color: rgba(15,111,255,.5); --tw-ring-offset-shadow: 0 0 #0000; --tw-ring-shadow: 0 0 #0000; --tw-shadow: 0 0 #0000; --tw-shadow-colored: 0 0 #0000; border-width: 0px; border-style: solid; box-sizing: inherit; font-weight: 600;\">(All applications will be considered ONLY through Wellfound. Please do not contact any employee of the company as no such contact/connection will be considered as an application for the job.)</strong></p>\n<p style=\"--tw-border-spacing-x: 0; --tw-border-spacing-y: 0; --tw-translate-x: 0; --tw-translate-y: 0; --tw-rotate: 0; --tw-skew-x: 0; --tw-skew-y: 0; --tw-scale-x: 1; --tw-scale-y: 1; --tw-scroll-snap-strictness: proximity; --tw-ring-offset-width: 0px; --tw-ring-offset-color: #fff; --tw-ring-color: rgba(15,111,255,.5); --tw-ring-offset-shadow: 0 0 #0000; --tw-ring-shadow: 0 0 #0000; --tw-shadow: 0 0 #0000; --tw-shadow-colored: 0 0 #0000; border-width: 0px; border-style: solid; box-sizing: inherit; margin: 0px 0px 16px; padding: 0px;\">This posting is for a Backend Software Engineer. We are a fully remote team and it does not matter which country or time zone you are in, as long as you are available from 10 AM to 1 PM EST. We are not looking for part-time contractors, so please only apply if you're looking for a full-time position.</p>\n<p style=\"--tw-border-spacing-x: 0; --tw-border-spacing-y: 0; --tw-translate-x: 0; --tw-translate-y: 0; --tw-rotate: 0; --tw-skew-x: 0; --tw-skew-y: 0; --tw-scale-x: 1; --tw-scale-y: 1; --tw-scroll-snap-strictness: proximity; --tw-ring-offset-width: 0px; --tw-ring-offset-color: #fff; --tw-ring-color: rgba(15,111,255,.5); --tw-ring-offset-shadow: 0 0 #0000; --tw-ring-shadow: 0 0 #0000; --tw-shadow: 0 0 #0000; --tw-shadow-colored: 0 0 #0000; border-width: 0px; border-style: solid; box-sizing: inherit; margin: 0px 0px 16px; padding: 0px;\">Quinncia is a career readiness platform that improves college student outcomes by improving students' resumes and interview skills using our AI. Quinncia allows career service to scale their offerings allowing each student to get personalized feedback on their resume and interviewing skills. With over 60% unemployment or underemployment rate recently graduated students, our goal is to integrate career readiness into the academic curriculum and make sure every student has a job within 90 days of graduation.</p>\n<p style=\"--tw-border-spacing-x: 0; --tw-border-spacing-y: 0; --tw-translate-x: 0; --tw-translate-y: 0; --tw-rotate: 0; --tw-skew-x: 0; --tw-skew-y: 0; --tw-scale-x: 1; --tw-scale-y: 1; --tw-scroll-snap-strictness: proximity; --tw-ring-offset-width: 0px; --tw-ring-offset-color: #fff; --tw-ring-color: rgba(15,111,255,.5); --tw-ring-offset-shadow: 0 0 #0000; --tw-ring-shadow: 0 0 #0000; --tw-shadow: 0 0 #0000; --tw-shadow-colored: 0 0 #0000; border-width: 0px; border-style: solid; box-sizing: inherit; margin: 0px 0px 16px; padding: 0px;\">We're focused on enhancing our product for our clients and their users, as well as streamlining operations and improving our technical foundation. You will work on improving existing features and working on streamlining client implementations through improved tools Improving our technical architecture and building out a continuous integration pipeline</p>\n<p style=\"--tw-border-spacing-x: 0; --tw-border-spacing-y: 0; --tw-translate-x: 0; --tw-translate-y: 0; --tw-rotate: 0; --tw-skew-x: 0; --tw-skew-y: 0; --tw-scale-x: 1; --tw-scale-y: 1; --tw-scroll-snap-strictness: proximity; --tw-ring-offset-width: 0px; --tw-ring-offset-color: #fff; --tw-ring-color: rgba(15,111,255,.5); --tw-ring-offset-shadow: 0 0 #0000; --tw-ring-shadow: 0 0 #0000; --tw-shadow: 0 0 #0000; --tw-shadow-colored: 0 0 #0000; border-width: 0px; border-style: solid; box-sizing: inherit; margin: 0px 0px 16px; padding: 0px;\"><strong style=\"--tw-border-spacing-x: 0; --tw-border-spacing-y: 0; --tw-translate-x: 0; --tw-translate-y: 0; --tw-rotate: 0; --tw-skew-x: 0; --tw-skew-y: 0; --tw-scale-x: 1; --tw-scale-y: 1; --tw-scroll-snap-strictness: proximity; --tw-ring-offset-width: 0px; --tw-ring-offset-color: #fff; --tw-ring-color: rgba(15,111,255,.5); --tw-ring-offset-shadow: 0 0 #0000; --tw-ring-shadow: 0 0 #0000; --tw-shadow: 0 0 #0000; --tw-shadow-colored: 0 0 #0000; border-width: 0px; border-style: solid; box-sizing: inherit; font-weight: 600;\">Requirements:</strong></p>\n<ul style=\"\">\n<li style=\"\">3+ years of backend development experience</li>\n<li style=\"\">Experience with a programming language: NodeJS/Python/Golang/Ruby</li>\n<li style=\"\">Understanding of database fundamentals</li>\n<li style=\"\">Understanding of software design patterns</li>\n<li style=\"\">Experience working with algorithms</li>\n<li style=\"\">Experience using the following tools/packages: Git, Docker, NPM, eslint</li>\n<li style=\"\">Experience writing REST APIs</li>\n</ul>\n<p style=\"--tw-border-spacing-x: 0; --tw-border-spacing-y: 0; --tw-translate-x: 0; --tw-translate-y: 0; --tw-rotate: 0; --tw-skew-x: 0; --tw-skew-y: 0; --tw-scale-x: 1; --tw-scale-y: 1; --tw-scroll-snap-strictness: proximity; --tw-ring-offset-width: 0px; --tw-ring-offset-color: #fff; --tw-ring-color: rgba(15,111,255,.5); --tw-ring-offset-shadow: 0 0 #0000; --tw-ring-shadow: 0 0 #0000; --tw-shadow: 0 0 #0000; --tw-shadow-colored: 0 0 #0000; border-width: 0px; border-style: solid; box-sizing: inherit; margin: 0px 0px 16px; padding: 0px;\"><strong style=\"--tw-border-spacing-x: 0; --tw-border-spacing-y: 0; --tw-translate-x: 0; --tw-translate-y: 0; --tw-rotate: 0; --tw-skew-x: 0; --tw-skew-y: 0; --tw-scale-x: 1; --tw-scale-y: 1; --tw-scroll-snap-strictness: proximity; --tw-ring-offset-width: 0px; --tw-ring-offset-color: #fff; --tw-ring-color: rgba(15,111,255,.5); --tw-ring-offset-shadow: 0 0 #0000; --tw-ring-shadow: 0 0 #0000; --tw-shadow: 0 0 #0000; --tw-shadow-colored: 0 0 #0000; border-width: 0px; border-style: solid; box-sizing: inherit; font-weight: 600;\">Desired:</strong></p>\n<ul style=\"\">\n<li style=\"\">Functional programming experience with libraries such as lodash/fp, ramda, remeda (in the case of JS)</li>\n<li style=\"\">Experience working with Google Cloud, such as Google Functions, Cloud Run, Buckets, etc</li>\n<li style=\"\">Strong ability to break down a problem into fundamentals and resolve it in an elegant way</li>\n<li style=\"\">Experience with WebRTC, gRPC</li>\n</ul>\n<p style=\"--tw-border-spacing-x: 0; --tw-border-spacing-y: 0; --tw-translate-x: 0; --tw-translate-y: 0; --tw-rotate: 0; --tw-skew-x: 0; --tw-skew-y: 0; --tw-scale-x: 1; --tw-scale-y: 1; --tw-scroll-snap-strictness: proximity; --tw-ring-offset-width: 0px; --tw-ring-offset-color: #fff; --tw-ring-color: rgba(15,111,255,.5); --tw-ring-offset-shadow: 0 0 #0000; --tw-ring-shadow: 0 0 #0000; --tw-shadow: 0 0 #0000; --tw-shadow-colored: 0 0 #0000; border-width: 0px; border-style: solid; box-sizing: inherit; margin: 0px 0px 16px; padding: 0px;\"><strong style=\"--tw-border-spacing-x: 0; --tw-border-spacing-y: 0; --tw-translate-x: 0; --tw-translate-y: 0; --tw-rotate: 0; --tw-skew-x: 0; --tw-skew-y: 0; --tw-scale-x: 1; --tw-scale-y: 1; --tw-scroll-snap-strictness: proximity; --tw-ring-offset-width: 0px; --tw-ring-offset-color: #fff; --tw-ring-color: rgba(15,111,255,.5); --tw-ring-offset-shadow: 0 0 #0000; --tw-ring-shadow: 0 0 #0000; --tw-shadow: 0 0 #0000; --tw-shadow-colored: 0 0 #0000; border-width: 0px; border-style: solid; box-sizing: inherit; font-weight: 600;\">Our stack:</strong></p>\n<ul style=\"\">\n<li style=\"\">NodeJS (pure JS)/Koa</li>\n<li style=\"\">MongoDB/Mongoose</li>\n<li style=\"\">Python/Flask</li>\n<li style=\"\">GraphQL</li>\n</ul>\n<p style=\"--tw-border-spacing-x: 0; --tw-border-spacing-y: 0; --tw-translate-x: 0; --tw-translate-y: 0; --tw-rotate: 0; --tw-skew-x: 0; --tw-skew-y: 0; --tw-scale-x: 1; --tw-scale-y: 1; --tw-scroll-snap-strictness: proximity; --tw-ring-offset-width: 0px; --tw-ring-offset-color: #fff; --tw-ring-color: rgba(15,111,255,.5); --tw-ring-offset-shadow: 0 0 #0000; --tw-ring-shadow: 0 0 #0000; --tw-shadow: 0 0 #0000; --tw-shadow-colored: 0 0 #0000; border-width: 0px; border-style: solid; box-sizing: inherit; margin: 0px 0px 16px; padding: 0px;\">Whatever else you decide - we're constantly re-evaluating our stack and tools. Having prior experience with the technologies is a plus, but not mandatory for skilled candidates.</p>\n<p style=\"--tw-border-spacing-x: 0; --tw-border-spacing-y: 0; --tw-translate-x: 0; --tw-translate-y: 0; --tw-rotate: 0; --tw-skew-x: 0; --tw-skew-y: 0; --tw-scale-x: 1; --tw-scale-y: 1; --tw-scroll-snap-strictness: proximity; --tw-ring-offset-width: 0px; --tw-ring-offset-color: #fff; --tw-ring-color: rgba(15,111,255,.5); --tw-ring-offset-shadow: 0 0 #0000; --tw-ring-shadow: 0 0 #0000; --tw-shadow: 0 0 #0000; --tw-shadow-colored: 0 0 #0000; border-width: 0px; border-style: solid; box-sizing: inherit; margin: 0px 0px 16px; padding: 0px;\">PS: Please add your Github account link to your application, as it will make the evaluation process easier and more robust.</p>\n</div>\n</div>\n<img src=\"https://remotive.com/job/track/1838115/blank.gif?source=public_api\" alt=\"\"/>","tags":"[\"api\",\"backend\",\"cloud\",\"docker\",\"git\",\"golang\",\"graphql\",\"javascript\",\"mongoDB\",\"node.js\",\"python\",\"ruby/rails\",\"AI/ML\",\"flask\",\"functional programming\",\"google cloud\",\"WebRTC\",\"github\",\"REST\"]","pubDate":"2023-11-17 07:32:26.000","link":"https://remotive.com/remote-jobs/software-dev/backend-software-engineer-1838115","savedDate":"2023-11-21 04:48:20.041","slug":"backend-software-engineer-quinncia-inc-6859"}]