[{"id":2958228068,"title":"Head of Marketing","company":"Ethena Labs","image":"https://remotive.com/job/1974003/logo","description":"<div><strong style=\"\">Who We Are:</strong></div>\n<div><span style=\"\">Ethena Labs is building the first crypto-based reward-accruing synthetic dollar protocol. Arthur Hayes is a founding advisor and the team has deep experience across traditional finance and crypto engineering from firms such as Cerberus, Wintermute, BITMEX, Flow Traders, Deribit, Paradigm, GMX, Zircuit, Chainlink and Kaiko. We are backed by every major exchange and trading entity in the space.</span></div>\n<div> </div>\n<div><strong style=\"\">What we are Doing:</strong></div>\n<div><span style=\"\">We are building two interlinked products: a crypto-native synthetic dollar (USDe) and an Internet Bond (sUSDe) accruing rewards via a delta-neutral derivatives portfolio.</span></div>\n<div> </div>\n<div><span style=\"\">We believe creating a synthetic dollar which is not reliant on existing banking infrastructure is the single most important problem to solve and the largest opportunity in crypto today.</span></div>\n<div> </div>\n<div><span style=\"\">USDe will form the first part of a broader ecosystem of products we are building including fixed and floating rate Internet bonds and composable repo markets.</span></div>\n<div> </div>\n<div><span style=\"\">Join us!!</span></div>\n<div> </div>\n<div><strong>The Role</strong></div>\n<div>The Head of Marketing at Ethena will be responsible for shaping and executing Ethena’s marketing strategy to enhance brand visibility, community engagement, and product adoption. </div>\n<div> </div>\n<div>This role requires you to have, or at least have the ability to develop, a deep understanding of the crypto ecosystem and institutional finance, including trends and audience behaviors, to drive sustainable growth. The Head of Marketing will work closely with Leadership Product Engineering, Business Development, and Research Teams to align marketing efforts with Ethena’s extraordinarily bold business objectives.</div>\n<div> </div>\n<p><br><br></p>\n<div class=\"h3\">What You’ll Do</div>\n<ul style=\"\">\n<li style=\"\">Take ownership of, and lead on, all of Ethena’s Marketing initiatives</li>\n<li style=\"\">Develop, formalize, implement and deliver a comprehensive marketing strategy to support and drive Ethena’s vision and business objectives</li>\n<li style=\"\">Elevate Ethena’s products, including the newly launching Ethena Network ecosystem, across all channels &amp; platforms possible</li>\n<li style=\"\">Help Ethena Network apps with their go-to-market marketing strategy and align content with Ethena’s brand</li>\n<li style=\"\">Writing content for Ethena blog posts and launch announcements.</li>\n<li style=\"\">Collaborate with internal and external designers to enhance branding, content and marketing materials, particularly with regards to X/Twitter.</li>\n<li style=\"\">Construct &amp; maintain a marketing calendar and content pipeline to ensure consistent and strategic outreach. Coordinating these with the wider organisation</li>\n<li style=\"\">Act as a mentor/advisor to ecosystem teams. Ensuring Ethena’s brand tones/standards are felt throughout it, while allowing the projects to have distinct identities.</li>\n<li style=\"\">Organize &amp; host Ethena business &amp; community events at conferences as well as other forums like X spaces, Discord etc.</li>\n<li style=\"\">Work with key partners to continue to build an industry-leading community and their engagement.</li>\n<li style=\"\">Collaborate with &amp; manage external PR teams, journalists &amp; KOL’s</li>\n</ul>\n<p><br><br></p>\n<div class=\"h3\">What We’re Looking For</div>\n<ul style=\"\">\n<li style=\"\">Extensive experience in a variety of marketing sectors in Tech or Finance</li>\n<li style=\"\">Proven track record of driving brand growth, user acquisition, and community engagement in the crypto/digital assets/web3</li>\n<li style=\"\">Deep understanding of crypto industry trends and active engagement with crypto communities, especially on platforms like Crypto Twitter.</li>\n<li style=\"\">Ability to communicate complex crypto and technical concepts to diverse audiences.</li>\n<li style=\"\">Experience with graphic design tools like Figma to support content production.</li>\n<li style=\"\">Exceptional written and verbal communication skills in English, with a talent for storytelling.</li>\n</ul>\n<div><strong><span style=\"\">Why Ethena Labs?</span></strong></div>\n<div> </div>\n<div><span style=\"\">Join a forward-thinking, crypto-native company with a mission to revolutionize decentralized finance.</span></div>\n<div><span style=\"\">Work alongside a passionate and innovative team that values collaboration and creativity.</span></div>\n<div><span style=\"\">Enjoy a flexible, remote-friendly work environment with opportunities for growth and learning.</span></div>\n<div> </div>\n<div><span style=\"\">If you subscribe to the mission of separating the dollar from the state, then we want to hear from you!</span></div>\n<div> </div>\n<div><span style=\"\">We look forward to receiving your application and will be in touch after having a chance to review. </span></div>\n<div> </div>\n<div><strong style=\"\">In the meantime, here are some links to more information about Ethena Labs to help you check us out:</strong></div>\n<div><a class=\"postings-link\" href=\"https://www.ethena.fi/\" rel=\"nofollow\"><strong><span style=\"\">Website</span></strong></a></div>\n<div><a class=\"postings-link\" href=\"https://twitter.com/ethena_labs?s=21&amp;t=axGgKq-f7xtb_IGY1vq9gA\" rel=\"nofollow\"><strong><span style=\"\">Twitter</span></strong></a></div>\n<div><a class=\"postings-link\" href=\"https://www.linkedin.com/company/ethena-labs\" rel=\"nofollow\"><strong><span style=\"\">LinkedIn</span></strong></a></div>\n<img src=\"https://remotive.com/job/track/1974003/blank.gif?source=public_api\" alt=\"\"/>","tags":"[\"marketing strategy\"]","pubDate":"2025-02-22T03:51:10.000Z","link":"https://remotive.com/remote-jobs/marketing/head-of-marketing-1974003","slug":"head-of-marketing-ethena-labs-2857"},{"id":2019245884,"title":"Account Manager","company":"GrowthX Labs","image":"https://remotive.com/job/1974626/logo","description":"<p><strong>👉 IMPORTANT: Upload your resume as a PDF. Resumes in other formats (e.g., DOC or DOCX) will be automatically disqualified by our AI systems.</strong></p>\n<p>We're seeking an Account Manager (SEO + Content) who's passionate about digital growth strategies and innovative solutions. At GrowthX, you'll collaborate with dynamic businesses and strategists to drive impactful digital expansion.</p>\n<p>(This is a fully remote role. We require a minimum of 4 hours overlap with U.S. Pacific Time.)</p>\n<div class=\"h3\">Quick Intro</div>\n<p>At GrowthX, we design growth systems that integrate AI automation and expert guidance to help marketing teams with content creation, distribution, and conversion. Since our founding in 2024, we’ve hit seven-figure annual revenue in just five months, grown by double digits month-over-month, and teamed up with incredible partners like Reddit, Ramp, and HeyGen to drive their growth.</p>\n<div class=\"h3\">The Role: Account Manager (SEO + Content)</div>\n<p>We're seeking an Account Manager (SEO + Content) to manage and enhance client relationships through strategic SEO and content initiatives, working closely with our innovative team of writers and strategists. You will ensure client satisfaction and drive content that aligns with our AI-driven methodologies.</p>\n<div class=\"h3\">Who You'll Work With</div>\n<p>As the Account Manager (SEO + Content), you'll have the support of:</p>\n<ul style=\"\">\n<li style=\"\">Managing Editors: To refine content and ensure alignment with client goals.</li>\n<li style=\"\">SEO Strategists: To incorporate effective SEO techniques into client strategies.</li>\n<li style=\"\">AI Automation Experts: To streamline content creation and implementation.</li>\n</ul>\n<div class=\"h3\">Day-to-Day expectations</div>\n<p>Here's how you can expect to spend your time each week:</p>\n<p>40% – Client Management: Build and maintain strong client relationships, ensuring satisfaction and project alignment.<br>30% – Strategy Development: Collaborate on creating SEO and content strategies tailored to client needs.<br>20% – Team Collaboration: Work with internal teams to integrate AI and human insights into content workflows.<br>10% – Performance Analysis: Monitor and report on SEO and content performance, providing insights for improvement.</p>\n<div class=\"h3\">Requirements</div>\n<div class=\"h3\">Key Responsibilities &amp; Skills Needed</div>\n<ul style=\"\">\n<li style=\"\">Client Relationship Management: Proven ability to build and maintain robust client relationships, ensuring alignment and satisfaction.</li>\n<li style=\"\">SEO Expertise: Strong understanding of SEO principles, including keyword research, on-page SEO, and analytics.</li>\n<li style=\"\">Content Strategy: Experience in developing content strategies that leverage AI insights and human creativity for client growth.</li>\n<li style=\"\">Communication &amp; Collaboration: Excellent communication skills with the ability to work collaboratively within dynamic teams.</li>\n</ul>\n<div class=\"h3\">Nice to Haves</div>\n<ul style=\"\">\n<li style=\"\">Experience with AI Tools: Familiarity with AI-driven content creation tools and practices.</li>\n<li style=\"\">Industry Knowledge: Insights into key industries such as healthcare, finance, or travel.</li>\n<li style=\"\">Multilingual Skills: Proficiency in additional languages to enhance global client outreach.</li>\n</ul>\n<div class=\"h3\">Benefits</div>\n<ul style=\"\">\n<li style=\"\">Salary: Competitive, based on experience and expertise.</li>\n<li style=\"\">Fully Remote: Flexibility to work from anywhere with coordination in PST hours.</li>\n<li style=\"\">Professional Development: Access to ongoing training in AI technologies and editorial practices.</li>\n<li style=\"\">Diverse Culture: Engage with a team of industry-leading experts passionate about digital innovation.</li>\n</ul>\n<p><br><br></p>\n<div class=\"h2\">About the company</div>\n<p><br>We build end-to-end growth engines with expert-guided AI workflows. From content to distribution to conversion. <br><br>We're not another software company.<br>We're not trying to be an agency.<br>We're building something entirely different:<br><br></p>\n<ul style=\"\">\n<li style=\"\">AI-powered workflows that adapt to our clients</li>\n<li style=\"\">Expert guidance every step of the way</li>\n<li style=\"\">Zero burden on our clients team</li>\n<li style=\"\">Results that compound over time</li>\n</ul>\n<p><br><strong>Why?<br></strong><br>Because traditional options aren't cutting it:<br><br></p>\n<ul style=\"\">\n<li style=\"\">Agencies are expensive and often disconnected from your brand's reality.</li>\n<li style=\"\">Freelancers can be hit or miss, hard to manage, and challenging to retain.</li>\n<li style=\"\">In-house teams are costly to build and often bogged down by internal processes.</li>\n<li style=\"\">AI alone lacks the nuance and contextual understanding that human expertise brings.</li>\n<li style=\"\">Software tools require your team to do all the heavy lifting.</li>\n</ul>\n<p><br>We believe in combining the best of both worlds—AI and experts—to drive real growth.<br><br>Already, 25 incredible companies – from seed startups to public giants – are growing with us.<br><br>And we're just getting started... 🚀</p>\n<img src=\"https://remotive.com/job/track/1974626/blank.gif?source=public_api\" alt=\"\"/>","tags":"[\"content strategy\"]","pubDate":"2025-02-21T11:51:14.000Z","link":"https://remotive.com/remote-jobs/sales-business/account-manager-1974626","slug":"account-manager-growthx-labs-3395"}]