[{"id":2901312795,"title":"Customer Success Manager, Scaled","company":"Bio Render","image":"https://lever-client-logos.s3-us-west-2.amazonaws.com/0f4b434e-502f-4390-9819-c058d43028c1-1595260531860.png","description":"<div>At BioRender, our mission is to accelerate the world’s ability to learn, discover and communicate science. We are passionate about democratizing science communication in order to accelerate scientific discovery and understanding. We're looking for amazing people to help create the world’s go-to-place and platform where science is communicated. Come join us!</div><div><br></div><div><span style=\"font-size: 16px\">We are looking for a proactive individual, who is dedicated to building a product users love and wants to revolutionize how science is communicated around the world, to join our company as a Customer Success Manager, Scaled! You will work closely with BioRender users to focus on customer satisfaction, customer retention, customer referenceability and revenue growth.</span></div><h3>You will be successful in this role with:  </h3><li><b>Excellent Prioritization and Strategic Account Management: </b>Implement a mix of high-touch and digital customer engagement strategies. Articulate the value realized by customers and help them achieve their business objectives and deliver on BioRender’s commercial outcomes</li><li><b>A continuous improvement approach: </b>having a growth mindset that is open to continuous feedback and can help drive internal process improvements&nbsp;</li><li><b>Exceptional customer curiosity: </b>You have a genuine interest in learning about the clients we serve, their goals, and their science communication pain points</li><li><b>Resilience and an Owner Mindset</b>: uses a compelling process to stay productive and focused in the face of adversity, while honouring their commitments to customers and our internal teams</li>,<h3>What you'll be doing:</h3><li>Managing a scaled portofolio to deliver on commercial outcomes - Retention, Expansion, CSQL’s as well as build customer advocacy</li><li>Leveraging multiple tools to proactively manage a book of business comprising SMB clients at scale and position yourself as a trusted, strategic partner&nbsp;</li><li>Uncover client needs, facilitate training, track adoption and engagement, deliver on client objectives to secure renewal of annual subscription and growth within accounts.</li><li>Understand user satisfaction and track NPS scores and customer health to prevent churn and understand where we can improve and address user requests</li><li>Onboard end users to the platform and demonstrate platform features to senior decision makers</li><li>Cultivate customer advocates, develop case studies, and engage with customers for speaking opportunities and other marketing activities</li><li>Liaise with various teams (i.e. medical illustration team, product, marketing, etc.) to ensure the customers’ needs are being fulfilled&nbsp;</li><li>Seek out opportunities to enhance the customer success playbook, contribute to the product, and assist other teams</li>,<h3>What you bring to the table:</h3><li>3+ years of experience in customer success or account management for a SaaS company</li><li>Demonstrable track record of delivering and exceeding expectations on key commercial metrics like Retention and Expansion</li><li>Excellent organizational skills and ability to manage a scaled portfolio</li><li>Strong interpersonal skills and attention to detail</li><li>Comfortability communicating with stakeholders at varying levels</li><li>Experience in Biotechnology or working with Academic institutions is an asset</li>,<h3>Why Join Us?</h3><li>We are mission-driven, and work collaboratively towards our shared vision of improving scientific communication and accelerating scientific discovery: BioRender figures have appeared in more than 16,000 publications!&nbsp;</li><li>It’s a product that users love! We have a world-class NPS and a community of loyal fans. Check out our Testimonials page to see what our customers are saying about us: <a href=\"https://biorender.com/testimonials/\" class=\"postings-link\">https://biorender.com/testimonials/&nbsp;</a></li><li>We are in the top quartile for profitability and year-over-year revenue growth, with users in 200+ countries.</li><li>BioRender is an equal opportunity employer, and an inclusive hiring process and work environment is a part of our DNA.&nbsp;</li><li>We’re remote-first and have team members across Canada and the United States. A physical office in Toronto is available, but you have the flexibility to work from anywhere.&nbsp;</li><li>We’re backed by top investors, accelerators, and some of the most successful life science entrepreneurs and philanthropists in the world including Y Combinator, Malala Fund founders, and Fifty Years VC.&nbsp;</li><li>We are committed to building a warm, inclusive, and diverse environment. Check out how we make sure our <a href=\"https://www.biorender.com/biorender-careers\" class=\"postings-link\">employees come first</a>.</li><div>You can read more about the <a href=\"https://biorender.notion.site/BioRender-Candidate-Resources-8255c155797f442a950720a33b4764d5\" class=\"postings-link\">BioRender interview process and FAQs here</a>!</div><div><br></div><div>Check out what it's like to work at BioRender in <a href=\"https://biorender.notion.site/biorender/Working-at-BioRender-as-a-Canada-Based-Employee-f6e12ab844154bb9948b22b32e3f0c70\" class=\"postings-link\">Canada</a> and the <a href=\"https://biorender.notion.site/biorender/Working-at-BioRender-as-a-U-S-Based-Employee-4ab2cc8e48f546f89aa98c318bccebc9\" class=\"postings-link\">US</a>!</div>","tags":"[\"management\",\"B2C\"]","pubDate":"2024-01-24 20:13:17.513","link":"https://jobs.lever.co/biorender/3d68bf2d-bbdd-41bb-8e79-85f773411c76","savedDate":"2024-01-31 11:26:05.320","slug":"customer-success-manager-scaled-bio-render-6121"},{"id":4815479922,"title":"Payroll & Benefits Specialist","company":"Bio Render","image":"https://lever-client-logos.s3-us-west-2.amazonaws.com/0f4b434e-502f-4390-9819-c058d43028c1-1595260531860.png","description":"<div>At BioRender, our mission is to accelerate the world’s ability to learn, discover and communicate science. We are passionate about democratizing science communication in order to accelerate scientific discovery and understanding. We're looking for amazing people to help create the world’s go-to-place and platform where science is communicated. Come join us!</div><div><br></div><div><span style=\"font-size: 11pt\">The Payroll and Benefits Specialist plays a crucial role in managing and administering the payroll and benefits programs for employees within Canada and the United States. This role would be responsible for managing year-end processing for payroll, compliance with relevant laws and regulations and the administration of the benefits integration with ADP. The Payroll and Benefits Specialist will work closely with HR, Finance, and external vendors to deliver exceptional service to employees.</span></div><div><br></div><div><span style=\"font-size: 11pt\">This role is remote! </span></div><h3>Our ideal fit</h3><li><b>High Attention to Detail: </b>You are someone who would be considered detail-oriented, process-oriented, and data-focused.</li><li><b>Honesty/Integrity: </b>You can easily earn trust from the teams and maintain confidence while speaking plainly and truthfully. You can handle sensitive information with confidentiality.&nbsp;</li><li><b>Problem Solver at Heart: </b>You enjoy building processes with a continuous improvement mindset and want to grow and own the US payroll and benefits function for the US and Canada. </li>,<h3>Your responsibilities </h3><li><b>Payroll Processing</b> - Accurately managing the bi-weekly payroll processing across the US (over 15 states) and Canada. You will handle complex payroll calculations, including benefits, salary adjustments, overtime, and deductions and help resolve any payroll discrepancies and issues.</li><li><b>Year-End Processing: </b>Prepare and reconcile year-end payroll tax forms (ie. T4s and W-2s)&nbsp; for employees and ensure accurate and timely submission of required year-end reports to government agencies.&nbsp; Work closely with Accounting for any audits related to payroll (ie. grants, benefits, 401K etc.).</li><li><b>Benefits Administration </b>- Manage the administration of employee benefits programs related to payroll deductions and premiums. Liaise with benefit providers, ensuring timely enrollment, terminations and coverage changes are processed. Ensure monthly reconciliation for all benefit providers’ invoices to ensure discrepancies are addressed and resolved.&nbsp;</li><li><b>Compliance and Reporting</b>- register and ensure compliance with all relevant US state payroll tax, deductions, and benefits regulations. You will work closely with ADP, Accounting, Tax&nbsp; &amp; other functions. You’ll also support the payroll setup of new states and entities.</li><li><b>Process Improvement </b>- Identify opportunities for process improvement and efficiency within the payroll and benefits administration functions and make suggestions and enhancements to payroll and benefits systems.</li>,<h3>What you bring to the table</h3><li>5+ years of full-cycle payroll experience</li><li>Knowledge of both US and Canadian payroll processes (i.e. multi-state payroll processing)</li><li>Strong understanding of US federal and state employment laws and regulations</li><li>Experience with ADP or other payroll and HR software</li><li>Intermediate to advanced knowledge of MS Excel</li><li>Certified Payroll Professional (CPP) or similar certification is an asset</li><li>Post-secondary education in accounting, business administration or equivalent</li>,<h3>What you can expect from our interview process</h3><li><b>Introductory calls: </b>We will set up a phone call with one of our recruiters and/or our Controller, Carman, during which you’ll have the opportunity to share more about your experience and interests. You’ll also learn more about BioRender and the team you’re interviewing with. Feel free to ask any questions throughout these calls!</li><li><b>Practical interview: </b>You’ll be completing a practical exercise so we can see your skills in action and give you a realistic role preview of some role responsibilities. This exercise will be conducted with Carman and our HR Manager, Mairead.</li><li><b>Work history interview: </b>This is a conversational interview with Carman and our Head of Finance, Phillip. They will review your past work and educational experiences in chronological order - <a href=\"https://biorender.notion.site/biorender/Candidate-Guide-to-the-BioRender-Chronological-Interview-54c6e465502042a3870dddd614708c20\" class=\"postings-link\">you can read more about how to prepare for this interview here</a>!</li><li><b>Meet the team: </b>Throughout our interview process, you can expect to meet with some of your potential colleagues, as well as our Head of People, Meghana.</li>,<h3>Why join us?</h3><li>We are mission-driven, and work collaboratively towards our shared vision of improving scientific communication and accelerating scientific discovery: BioRender figures have appeared in more than 16,000 publications!&nbsp;</li><li>It’s a product that users love! We have a world-class NPS and a community of loyal fans. Check out our Testimonials page to see what our customers are saying about us: <a href=\"https://biorender.com/testimonials/\" class=\"postings-link\">https://biorender.com/testimonials/&nbsp;</a></li><li>We are in the top quartile for profitability and year-over-year revenue growth, with users in 200+ countries.</li><li>BioRender is an equal opportunity employer, and an inclusive hiring process and work environment is a part of our DNA.&nbsp;</li><li>We’re remote-first and have team members across Canada and the United States. A physical office in Toronto is available, but you have the flexibility to work from anywhere.&nbsp;</li><li>We’re backed by top investors, accelerators, and some of the most successful life science entrepreneurs and philanthropists in the world including Y Combinator, Malala Fund founders, and Fifty Years VC.&nbsp;</li><li>We are committed to building a warm, inclusive, and diverse environment. Check out how we make sure our <a href=\"https://www.biorender.com/biorender-careers\" class=\"postings-link\">employees come first</a>.</li><div>You can read more about the <a href=\"https://biorender.notion.site/BioRender-Candidate-Resources-8255c155797f442a950720a33b4764d5\" class=\"postings-link\">BioRender interview process and FAQs here</a>!</div>","tags":"[\"Finance\",\"aws\"]","pubDate":"2024-01-24 00:02:13.369","link":"https://jobs.lever.co/biorender/4d30d05b-5c29-41b2-9e4c-2d9e2a653143","savedDate":"2024-01-31 11:26:05.322","slug":"payroll-benefits-specialist-bio-render-7256"},{"id":6910994604,"title":"Engineering Manager, Product Engineering","company":"Bio Render","image":"https://lever-client-logos.s3-us-west-2.amazonaws.com/0f4b434e-502f-4390-9819-c058d43028c1-1595260531860.png","description":"<div>At BioRender, our mission is to accelerate the world’s ability to learn, discover and communicate science. We are passionate about democratizing science communication in order to accelerate scientific discovery and understanding. We're looking for amazing people to help create the world’s go-to-place and platform where science is communicated. Come join us!</div><div><br></div><div><span style=\"font-size: 11pt\">As an Engineering manager, you’ll lead a core product team and collaborate with product managers, designers, and scientists to ship web-based products and features that equip our users with the necessary tools to communicate science faster. This is a great opportunity for a leader who’s passionate about fostering a culture of empathy, empowerment, trust, and of course, building core features users love. If this sounds like you and you also love empowering engineers to do the best work of their lives, come say hello!&nbsp;</span></div><div><br></div><div><span style=\"font-size: 11pt\">We’re currently hiring Engineering Managers in the following area:</span></div><div><br></div><div><b style=\"font-size: 11pt\">Figure Expansion: </b><span style=\"font-size: 11pt\">The Figure Expansion team’s mission is to make visual science communication more efficient by allowing scientists to easily create all that they need in one tool. They own Graphing and Analysis, the Poster Builder feature, and innovation of new use cases to expand BioRender core functionality.</span></div><h3>You will: </h3><li>Set direction for the team and own the team’s delivery against objectives</li><li>Build a high-performing team to deliver an incredible amount of user value</li><li>Partner with the team to develop the technical strategy to accelerate the development of the product roadmap</li><li>Drive business outcomes through major product advancements and engineering unlocks</li><li>Collaborate with product and design to deeply understand the user, the product problem space, and how engineering can accelerate product advancements</li>,<h3>What you bring to the table:</h3><li>Successful track record managing a high performing product engineering team of 5-8 engineers and consistently delivering value to users (2+ years of management experience)</li><li>Previous experience working on a large-scale web-based product, ideally in React. A technical background that gives you the ability to relate to the team's problems, facilitate discussion, and guide/coach engineers when making tradeoffs and technical decisions (7+ years of software engineering experience)</li><li>Successful track record establishing processes or introducing tools that enable the team to move significantly faster</li>,<h3>Why join us?</h3><li>We are <b>mission-driven</b>, and work collaboratively towards our shared vision of improving scientific communication and accelerating scientific discovery: BioRender figures have appeared in more than 16,000 publications!&nbsp;</li><li>It’s a<b> product that users love</b>! We have a world-class NPS and a community of loyal fans. Check out our Testimonials page to see what our customers are saying about us:&nbsp;<a href=\"https://biorender.com/testimonials/\" class=\"postings-link\">https://biorender.com/testimonials/&nbsp;</a></li><li>We are in the <b>top quartile for profitability</b> and year-over-year revenue growth, with users in 200+ countries.</li><li>BioRender is an equal opportunity employer, and an inclusive hiring process and work environment is a part of our DNA.&nbsp;</li><li>We’re <b>remote-first </b>and have team members across Canada and the United States. A physical office in Toronto is available, but you have the flexibility to work from anywhere.&nbsp;</li><li>We’re backed by top investors, accelerators, and some of the most successful life science entrepreneurs and philanthropists in the world including Y Combinator, Malala Fund founders, and Fifty Years VC.&nbsp;</li><li>We are committed to building a <b>warm, inclusive, and diverse environment</b>. Check out how we make sure our&nbsp;<a href=\"https://www.biorender.com/biorender-careers\" class=\"postings-link\">employees come first</a>.</li><div>Check out our candidate resource - <a href=\"https://biorender.notion.site/Engineering-Product-Design-66275a3c2cca42e39234412881621467\" class=\"postings-link\">Engineering, Product &amp; Design at BioRender!</a>&nbsp;</div><div>You can also read more about the <a href=\"https://biorender.notion.site/BioRender-Candidate-Resources-8255c155797f442a950720a33b4764d5\" class=\"postings-link\">BioRender interview process and FAQs here</a>! </div><div><br></div>","tags":"[\"management\",\"engineering\"]","pubDate":"2024-01-19 01:50:14.929","link":"https://jobs.lever.co/biorender/c5ea602a-60b2-4a2b-8436-2311b6fdbbcc","savedDate":"2024-01-31 11:26:05.320","slug":"engineering-manager-product-engineering-bio-render-7242"},{"id":6329981068,"title":"Senior Data Scientist - Statistics & R Development","company":"Bio Render","image":"https://lever-client-logos.s3-us-west-2.amazonaws.com/0f4b434e-502f-4390-9819-c058d43028c1-1595260531860.png","description":"<div>At BioRender, our mission is to accelerate the world’s ability to learn, discover and communicate science. We are passionate about democratizing science communication in order to accelerate scientific discovery and understanding. We're looking for amazing people to help create the world’s go-to-place and platform where science is communicated. Come join us!</div><div><br></div><div><span style=\"font-size: 11pt\">We are looking for a Senior Data Scientist with strong Biostatistic, Statistic and R development experience to join our mission-driven, fast-growing company to help scientists around the world create and share beautiful, professional scientific figures.&nbsp;</span></div><div><br></div><div><span style=\"font-size: 11pt\">As the statistical expert at BioRender, you will be part of a Data Science team and will partner with the Graph Product, Engineering, and Design team to expand visual sci-comm (science communication) use cases through our stat services. You will own Graph product analytics and partner with business owners to help shape its direction. You will help build and ship widely used statistical analyses and graphs, write and maintain scalable R code to support the statistical functionalities with robust testing fixtures, QA analyses and graphing product features.&nbsp;&nbsp;</span></div><h3>Qualifications</h3><li>2+ years of experience post academia, working in an analytical role or closely with product, engineering and design (EPD) team&nbsp;</li><li>Proficiency in R programming, ideally production level skill (e.g. package development)</li><li>Strong Biostatistics/Statistics training (Master or above level)</li><li>Familiarity with Git, Docker and Devops best practices</li><li>SQL and data visualization tools&nbsp;</li><li>Strong written and verbal communication skills&nbsp;</li><li>Quick learner, and stay up to date with the latest technologies and research methodologies</li><li>[Bonus] Experience with advanced statistical methodologies including A/B and quasi-experimentations</li><li>[Bonus] Teaching or research experience in Bio-related fields&nbsp;&nbsp;</li>,<h3>What You'll Be Doing </h3><li>Be the go-to data and statistics owner and subject matter expertise for the BioRender Graph team, collaborating with product managers, product designers, and software engineers. </li><li>Build and ship widely used statistical analyses and graphs, write and maintain scalable R code to support the statistical functionalities with robust testing fixtures, QA analyses and graphing product features.&nbsp;&nbsp;</li><li>Develop metrics and dashboards to streamline data reports for the Graph team on critical business results and drive the impact of data-driven decisions</li><li>Facilitate quantitative and qualitative research to define product requirements</li><li>Contribute and socialize team enablement content</li><li>Contribute to BioRender Data Science brand and strategy</li><div><br></div><div>We typically expect candidates to have 4+ years of experience to achieve these accomplishments. However, we recognize that career paths vary, and your unique journey may have equipped you with the necessary skills. If you believe you have what it takes to excel in this role, we encourage you to apply!</div><div><br></div>,<h3>Why join us?</h3><li>We are mission-driven, and work collaboratively towards our shared vision of improving scientific communication and accelerating scientific discovery: BioRender figures have appeared in more than 16,000 publications!&nbsp;</li><li>It’s a product that users love! We have a world-class NPS and a community of loyal fans. Check out our Testimonials page to see what our customers are saying about us: <a href=\"https://biorender.com/testimonials/\" class=\"postings-link\">https://biorender.com/testimonials/&nbsp;</a></li><li>We are in the top quartile for profitability and year-over-year revenue growth, with users in 200+ countries.</li><li>BioRender is an equal opportunity employer, and an inclusive hiring process and work environment is a part of our DNA.&nbsp;</li><li>We’re remote-first and have team members across Canada and the United States. A physical office in Toronto is available, but you have the flexibility to work from anywhere.&nbsp;</li><li>We’re backed by top investors, accelerators, and some of the most successful life science entrepreneurs and philanthropists in the world including Y Combinator, Malala Fund founders, and Fifty Years VC.&nbsp;</li><li>We are committed to building a warm, inclusive, and diverse environment. Check out how we make sure our <a href=\"https://www.biorender.com/biorender-careers\" class=\"postings-link\">employees come first</a>.</li><div><span style=\"font-size: 16px\">Check out our candidate resource - </span><a href=\"https://biorender.notion.site/Engineering-Product-Design-66275a3c2cca42e39234412881621467\" style=\"font-size: 16px\" class=\"postings-link\">Engineering, Product &amp; Design at BioRender!</a><span style=\"font-size: 16px\">&nbsp;</span></div><div><span style=\"font-size: 16px\">You can also read more about the </span><a href=\"https://biorender.notion.site/BioRender-Candidate-Resources-8255c155797f442a950720a33b4764d5\" style=\"font-size: 16px\" class=\"postings-link\">BioRender interview process and FAQs here</a><span style=\"font-size: 16px\">!</span></div><div><span style=\"font-size: 16px\">Check out what it's like to work at BioRender in </span><a href=\"https://biorender.notion.site/biorender/Working-at-BioRender-as-a-Canada-Based-Employee-f6e12ab844154bb9948b22b32e3f0c70\" style=\"font-size: 16px\" class=\"postings-link\">Canada</a><span style=\"font-size: 16px\"> and the </span><a href=\"https://biorender.notion.site/biorender/Working-at-BioRender-as-a-U-S-Based-Employee-4ab2cc8e48f546f89aa98c318bccebc9\" style=\"font-size: 16px\" class=\"postings-link\">US</a><span style=\"font-size: 16px\">!</span></div>","tags":"[\"engineering\",\"B2C\"]","pubDate":"2024-01-15 20:33:21.237","link":"https://jobs.lever.co/biorender/60982b2d-d633-47a3-bf2b-92327a3653a2","savedDate":"2024-01-31 11:26:05.324","slug":"senior-data-scientist-statistics-r-development-bio-render-5087"},{"id":5459077468,"title":"Human Resources Operations Manager","company":"Bio Render","image":"https://lever-client-logos.s3-us-west-2.amazonaws.com/0f4b434e-502f-4390-9819-c058d43028c1-1595260531860.png","description":"<div>At BioRender, our mission is to accelerate the world’s ability to learn, discover and communicate science. We are passionate about democratizing science communication in order to accelerate scientific discovery and understanding. We're looking for amazing people to help create the world’s go-to-place and platform where science is communicated. Come join us!</div><div><br></div><div>As our Manager of HR Operations, you’ll play a critical role in providing a great employee experience as we scale. You’ll build and lead a team that ensures that we are able to provide:</div><div><br></div><div>• Streamlined and easy to use processes for employees throughout their time at BioRender, from hire to exit&nbsp;</div><div>• Quick resolution to questions that employees may have</div><div>• Reliable and accurate data and can be used reliably by our leadership and cross-functional partners&nbsp;</div><h3>What you'll be doing:</h3><li>Implement and maintain efficient HRIS systems, ensuring data accuracy, integrity, and compliance</li><li>Streamline and enhance onboarding, offboarding and leave processes to provide a seamless employee experience.</li><li>Act as a primary point of contact for employee queries, providing timely and accurate resolutions</li><li>Own HR data and metrics across systems (HR, Employee Surveys, Performance, Compensation) that are used for decision-making around people programs&nbsp;</li><li>Own the Canadian and US Benefits Program which includes set-up, administration, renewal, automation</li><li>Collaborate closely with Talent, IT and Finance teams to integrate HR systems, troubleshoot issues, and optimize processes</li><li>Lead and mentor the HR operations team, fostering a culture of continuous improvement and excellence.</li>,<h3>What you bring to the table:</h3><li>Proven experience (4+ years) in leading HR operations teams in a startup environment&nbsp;</li><li>Strong understanding of HR systems and experience owning key HR processes including onboarding, offboarding and leave management</li><li>Detail-oriented approach with a commitment to maintaining data accuracy and confidentiality</li><li>Strong communicator and cross-functional partner, able to build collaborative relationships across the organization</li><li>Expertise in US and/or Canadian benefits a plus</li>,<h3>Why join us?</h3><li>We are mission-driven, and work collaboratively towards our shared vision of improving scientific communication and accelerating scientific discovery: BioRender figures have appeared in more than 16,000 publications!</li><li>It’s a product that users love! We have a world-class NPS and a community of loyal fans. Check out our Testimonials page to see what our customers are saying about us: <u><a href=\"https://biorender.com/testimonials/\" class=\"postings-link\">https://biorender.com/testimonials/</a>&nbsp;</u></li><li>We are profitable, funded solely by user growth, and growing more than 200% YoY with users in 200+ countries.</li><li>We're proud that half of our team members are women (including those in leadership positions), and 65% of our team are BIPOC! BioRender is an equal opportunity employer, and an inclusive hiring process and work environment is a part of our DNA</li><li>We’re remote-first and have team members across Canada and the United States. A physical office in Toronto is available, but you have the flexibility to work from anywhere.</li><li>We’re backed by top investors, accelerators, and some of the most successful life science entrepreneurs and philanthropists in the world including Y Combinator, Malala Fund founders, and Fifty Years VC.</li><li>We are committed to building a warm, inclusive, and diverse environment. Check out how we make sure our <u><a href=\"https://biorender.com/careers/\" class=\"postings-link\">employees come first</a>.</u></li><div><br></div><div><span style=\"font-size: 16px\">You can read more about our </span><a href=\"https://biorender.notion.site/BioRender-Candidate-Resources-8255c155797f442a950720a33b4764d5\" style=\"font-size: 16px\" class=\"postings-link\">interview process here</a><u style=\"font-size: 16px\">!</u></div>","tags":"[\"Finance\",\"management\"]","pubDate":"2024-01-08 23:06:45.369","link":"https://jobs.lever.co/biorender/952fe8bb-422b-4437-a7bf-92f41de4f12d","savedDate":"2024-01-31 11:26:05.320","slug":"human-resources-operations-manager-bio-render-7123"},{"id":5553565545,"title":"Talent Acquisition Operations Manager","company":"Bio Render","image":"https://lever-client-logos.s3-us-west-2.amazonaws.com/0f4b434e-502f-4390-9819-c058d43028c1-1595260531860.png","description":"<div>At BioRender, our mission is to accelerate the world’s ability to learn, discover and communicate science. We are passionate about democratizing science communication in order to accelerate scientific discovery and understanding. We're looking for amazing people to help create the world’s go-to-place and platform where science is communicated. Come join us!</div><div><br></div><div><span style=\"font-size: 16px\">As the first Talent Operations Manager at BioRender, reporting to our head of People, you’ll partner with our executive teams, hiring managers, and talent acquisition teams to bring operational rigor to all our talent processes and provide a stellar experience to candidates. You will lead a team of talent coordinators and operations specialists to improve and develop new programs, establish processes that make sense at our scale, and evaluate systems and tools to ensure we have the right applications in place.</span></div><h3>What you'll be doing</h3><li>Own, manage and implement modern recruiting tech stack. Ensure consistent use and data hygiene of all our tools</li><li>Build out reports and dashboards to measure recruiting performance and inform recruiting strategy and processes</li><li>Lead our team of talent coordinators, providing seamless experience for candidates and interviewers</li><li>Build and manage talent enablement programs which include interview training and documentation</li><li>Manage our employer brand, collaborating with marketing and HR teams to showcase our company culture and values to candidates</li><li>Oversee employee referral programs to maximize their impact on recruitment effort</li><li>Develop and manage relationships with recruiting partners and vendors</li>,<h3>What you bring to the table</h3><li>Proven experience (6+ years) in talent acquisition or recruiting operations, within teams that support 100+ hires per year</li><li>Experience leading teams of coordinators, operations specialists, and project/program managers</li><li>Experience implementing and managing modern talent tools including Lever, Ashby, Gem, LinkedIn Recruiter, Modernloop, Google Analytics at an admin-level access</li><li>Strong analytical skills with the ability to build and interpret reports and metrics related to recruitment performance</li><li>Experience in designing and delivering talent enablement programs, including interview training and documentation</li><li>Knowledge of employer branding strategies and their impact on attracting top talent</li>,<h3>Why join us?</h3><li>We are mission-driven, and work collaboratively towards our shared vision of improving scientific communication and accelerating scientific discovery: BioRender figures have appeared in more than 16,000 publications!&nbsp;</li><li>It’s a product that users love! We have a world-class NPS and a community of loyal fans. Check out our Testimonials page to see what our customers are saying about us: <a href=\"https://biorender.com/testimonials/\" class=\"postings-link\">https://biorender.com/testimonials/&nbsp;</a></li><li>We are in the top quartile for profitability and year-over-year revenue growth, with users in 200+ countries.</li><li>BioRender is an equal opportunity employer, and an inclusive hiring process and work environment is a part of our DNA.&nbsp;</li><li>We’re remote-first and have team members across Canada and the United States. A physical office in Toronto is available, but you have the flexibility to work from anywhere.&nbsp;</li><li>We’re backed by top investors, accelerators, and some of the most successful life science entrepreneurs and philanthropists in the world including Y Combinator, Malala Fund founders, and Fifty Years VC.&nbsp;</li><li>We are committed to building a warm, inclusive, and diverse environment. Check out how we make sure our <a href=\"https://www.biorender.com/biorender-careers\" class=\"postings-link\">employees come first</a>.</li><div>You can read more about the <a href=\"https://biorender.notion.site/BioRender-Candidate-Resources-8255c155797f442a950720a33b4764d5\" class=\"postings-link\">BioRender interview process and FAQs here!</a></div><div>Check out what it's like to work at BioRender in <a href=\"https://biorender.notion.site/biorender/Working-at-BioRender-as-a-Canada-Based-Employee-f6e12ab844154bb9948b22b32e3f0c70\" class=\"postings-link\">Canada</a> and the <a href=\"https://biorender.notion.site/biorender/Working-at-BioRender-as-a-U-S-Based-Employee-4ab2cc8e48f546f89aa98c318bccebc9\" class=\"postings-link\">US</a>!</div>","tags":"[\"B2C\"]","pubDate":"2024-01-04 18:03:55.403","link":"https://jobs.lever.co/biorender/849632cb-2faf-4ce7-9fcb-187e791edcf2","savedDate":"2024-01-31 11:26:05.325","slug":"talent-acquisition-operations-manager-bio-render-1696"},{"id":8613086963,"title":"Software Engineer, Growth (Senior / Staff)","company":"Bio Render","image":"https://lever-client-logos.s3-us-west-2.amazonaws.com/0f4b434e-502f-4390-9819-c058d43028c1-1595260531860.png","description":"<div>At BioRender, our mission is to accelerate the world’s ability to learn, discover and communicate science. We are passionate about democratizing science communication in order to accelerate scientific discovery and understanding. We're looking for amazing people to help create the world’s go-to-place and platform where science is communicated. Come join us!</div><div><br></div><div><span style=\"font-size: 16px\">This is a big, ambitious goal. We’re looking for passionate product-minded engineers who are motivated by obsessing over customer problems and building products to solve them in a collaborative team environment. By joining us, you’ll get an opportunity to collaborate closely with product managers, designers and scientists to ship products and features that equip our users with the necessary tools to communicate science faster.&nbsp;</span></div><div><br></div><div><span style=\"font-size: 16px\">We're currently hiring </span><b style=\"font-size: 16px\">Senior or Staff Software Engineers</b><span style=\"font-size: 16px\"> for our</span><b style=\"font-size: 16px\"> Growth team</b><span style=\"font-size: 16px\">. The Growth team aims to discover and unlock value for our users, focusing on different aspects of the user journey. They use rapid product experimentation to drive user acquisition/engagement/retention/revenue, optimize the user experience, and drive forward sales pipeline.</span></div><h3>You will:</h3><li>Work closely with your product manager and product designer to inform your team’s roadmap and to plan out projects and initiatives</li><li>Help make everything around you better in areas you feel passionate about - for example - improving team processes, hiring/onboarding processes, our product’s quality or the ease of use/flexibility of our codebase, our growth team experimentation technology and processes&nbsp;</li><li>Work iteratively doing&nbsp; rapid experimentation and 0-1 projects within various growth opportunity spaces&nbsp;</li><li>Hypothesize, build, test and measure your own while continuously improving knowledge of the scientist pain points, workflow and journey&nbsp;</li><li>Design systems that create leverage for other teams to efficiently experiment in their domains</li>,<h3>Our ideal fit:</h3><li>At least 5+ years of professional experience as a full-stack engineer</li><li>Demonstrated strong proficiency in: ReactJS (or other similar JS frontend frameworks), NodeJS and ExpressJS (or other similar Node based API frameworks), NoSQL databases (MongoDB a plus), and cloud infrastructure (eg. AWS)</li><li>Designed systems (entire features, services) that were simple, scalable, secure, performant, and maintainable by other engineers</li><li>Has demonstrated expertise in their areas of ownership</li><li>Prior experience on a growth team (bonus)&nbsp;</li><li>Experience with experimentation and analytics (bonus)</li>,<h3>Why join us?</h3><li>We are mission-driven, and work collaboratively towards our shared vision of improving scientific communication and accelerating scientific discovery: BioRender figures have appeared in more than 16,000 publications!&nbsp;</li><li>It’s a product that users love! We have a world-class NPS and a community of loyal fans. Check out our Testimonials page to see what our customers are saying about us: <a href=\"https://biorender.com/testimonials/\" class=\"postings-link\">https://biorender.com/testimonials/&nbsp;</a></li><li>We are in the top quartile for profitability and year-over-year revenue growth, with users in 200+ countries.</li><li>BioRender is an equal opportunity employer, and an inclusive hiring process and work environment is a part of our DNA.&nbsp;</li><li>We’re remote-first and have team members across Canada and the United States. A physical office in Toronto is available, but you have the flexibility to work from anywhere.&nbsp;</li><li>We’re backed by top investors, accelerators, and some of the most successful life science entrepreneurs and philanthropists in the world including Y Combinator, Malala Fund founders, and Fifty Years VC.&nbsp;</li><li>We are committed to building a warm, inclusive, and diverse environment. Check out how we make sure our <a href=\"https://www.biorender.com/biorender-careers\" class=\"postings-link\">employees come first</a>.</li><div>Check out our candidate resource - <a href=\"https://biorender.notion.site/Engineering-Product-Design-66275a3c2cca42e39234412881621467\" class=\"postings-link\">Engineering, Product &amp; Design at BioRender!</a>&nbsp;</div><div>You can also read more about the <a href=\"https://biorender.notion.site/BioRender-Candidate-Resources-8255c155797f442a950720a33b4764d5\" class=\"postings-link\">BioRender interview process and FAQs here</a>! </div><div>Check out what it's like to work at BioRender in <a href=\"https://biorender.notion.site/biorender/Working-at-BioRender-as-a-Canada-Based-Employee-f6e12ab844154bb9948b22b32e3f0c70\" class=\"postings-link\">Canada</a> and the <a href=\"https://biorender.notion.site/biorender/Working-at-BioRender-as-a-U-S-Based-Employee-4ab2cc8e48f546f89aa98c318bccebc9\" class=\"postings-link\">US</a>!</div><div><br></div><div><i>Please note that in Canada, only those companies licensed by a provincial or territorial engineering regulator may refer to themselves as an “engineer” and therefore, this role will be titled \"developer\" internally at BioRender.&nbsp;</i></div>","tags":"[\"engineering\",\"B2C\",\"database\",\"mongo\",\"aws\"]","pubDate":"2024-01-03 15:36:33.257","link":"https://jobs.lever.co/biorender/b286f43f-a39e-4cd1-946b-d8dce108d83b","savedDate":"2024-01-31 11:26:05.325","slug":"software-engineer-growth-senior-staff-bio-render-545"}]