[{"id":5784721657,"title":"Senior Python/Go Developer (DL)","company":"Blue Coding","image":"https://lever-client-logos.s3.us-west-2.amazonaws.com/3c1d9ac7-6738-46c5-b6ca-a35fa2a0df57-1666278594128.png","description":"<div><i style=\"font-size: 18px\">Do you want to earn a salary in USD?&nbsp;</i></div><div><i style=\"font-size: 18px\">Would you like to work from wherever you want?</i></div><div><i style=\"font-size: 18px\">Would you like to be a part of the leading next-gen software developers?&nbsp;</i></div><div><br></div><div><b style=\"font-size: 24px\">Hi, you finally found us!</b><span style=\"font-size: 24px\">&nbsp;</span></div><div><br></div><div><b style=\"font-size: 24px\">Why work at Blue Coding?</b><span style=\"font-size: 24px\">&nbsp;</span></div><div><br></div><div>At Blue Coding we specialize in hiring excellent developers and amazing people from all over Latin America and other parts of the world. For the past 9 years, we’ve helped cutting-edge companies in the United States and Canada -both large and small, build great development teams and develop great products. Online shops, digital agencies, SaaS providers, and software consulting firms are a few of our clients. Our team of over 100 engineers is distributed in more than 10 countries across the Americas. We are a fully remote company working with a wide array of technologies and have expertise in every stage of the software development process.&nbsp;&nbsp;</div><div><br></div><div>Our team is highly connected, united, and culturally diverse, and our collaborators are involved in many initiatives around the world, from wildlife preservation to volunteering at local charities. We also participate in group activities like movie nights, trivia, and meme competitions. We stand for honesty, fairness, respect, efficiency, hard work, and cooperation.</div><div><br></div><div><b>What are we looking for?</b></div><div>In this opportunity, we are looking for a Senior Python and Go Developer to work with one of our foreign clients, which is an up-and-coming startup focusing on a mission to redefine the shopping experience by leveraging cutting-edge AI technology. They are working with thousands of brands to improve the shopping experience.</div><div>If you are independent, a great communicator, a problem solver, and have strong attention to detail, this is a great fit for you! Our jobs are fully remote – as long as you have the skills and can get the work done well, you can work anywhere in the listed countries you want.</div><div>If you have the skills and can get the job done, join us and work from anywhere you want!</div><h3>Here are some of the exciting day-to-day challenges you will face in this role:</h3><li>Helping with onboarding new data feeds into their platform.</li><li>You'll need to process the data for each brand they are working with using different tools.</li><li>Keeping up with new trends in software development.</li><li>Bring any suggestions that could improve the process.</li>,<h3>You will shine if you have these:</h3><li>Strong hands-on experience with both Python and Go (Golang).</li><li>Experience using Google Cloud or similar cloud platforms.</li>,<h3>It doesn't hurt if you also have:</h3><li>Experience or working knowledge of Docker and Kubernetes.</li>,<h3>Here are some of the perks we offer you:</h3><li>Salary in USD</li><li>Long-term</li><li>Flexible schedule (within US Time zones)</li><li>100% Remote</li><div><b style=\"font-size: 24px\">Hey, you are still here!</b><span style=\"font-size: 24px\">&nbsp;</span></div><div><br></div><div>So, let us ask a few questions. Do you like working in a friendly environment? Are you fluent in English? Do you have a strong work ethic, are detail-oriented and have an ownership mentality? And most importantly do you love music and puppies? If so, then what are you waiting for? Come join our team and become part of this awesome company! We will be expecting you.</div>","tags":"[]","pubDate":"2024-04-25 14:14:28.825","link":"https://jobs.lever.co/bluecoding/317e4a58-a9c3-4920-a52a-aef4fdc22231","savedDate":"2024-05-09 13:00:01.836","slug":"senior-python-go-developer-dl-blue-coding-7279"}]