[{"id":7881905624,"title":"Head of Platforms","company":"SafetyWing","image":"https://pbs.twimg.com/profile_images/1177267684574208000/54eG3WmW_400x400.jpg","description":"<h2>🧘 What we offer</h2> <ul><li><!--block-->Fully remote work environment – work from anywhere globally</li><li><!--block-->Competitive salary and equity compensation</li><li><!--block-->Premium health insurance that travels with you</li><li><!--block-->A personal development budget</li><li><!--block-->Laptop and office stipends</li><li><!--block-->A minimum of four weeks of vacation per year</li><li><!--block-->Travel insurance any time you travel</li><li><!--block-->Multiple team gatherings per year in amazing locations—our previous meetups were in Mexico, Bali, Siglufjörður and Hoi An</li></ul><div><!--block-->We are looking forward to hearing from you!</div> <div><!--block--><strong>SafetyWing</strong> is seeking a <strong>Head of Platforms</strong> to lead and grow relationships with our platform accounts, ensuring they deliver exceptional value to their users. This role combines strategic account management, growth-driven initiatives, and customer advocacy to create a seamless, scalable platform experience. As a key leader, you’ll balance big-picture thinking with hands-on execution, working directly with platform partners to optimize their success while driving our company’s growth.<br><br></div><div><!--block-->We are on a mission to remove the role of geographical borders as a barrier to equal opportunities and freedom for everyone. And we are doing that by creating simple health, insurance, and retirement products for remote workers worldwide as a replacement for national welfare systems.</div> <h2>💻 Your responsibilities will include</h2>  <ul><li><!--block-->Managing and owning strategic relationships with platform partners to drive growth and retention</li><li><!--block-->Developing and executing strategies to scale the platform channel effectively</li><li><!--block-->Running education and adoption campaigns for platform partners and their users</li><li><!--block-->Delivering a proactive customer experience by resolving issues and predicting/removing roadblocks</li><li><!--block-->Collaborating cross-functionally to implement feedback and improve platform API functionality</li><li><!--block-->Analyzing key metrics to identify opportunities for growth and improvement</li></ul> <h2>🧪 We are looking for someone who</h2> <ul><li><!--block-->Has multiple years of experience in a B2B customer/partner success role, ideally working with platforms or benefits-related products</li><li><!--block-->Has experience creating and executing scalable strategies and driving growth initiatives</li><li><!--block-->Is comfortable with API-led products and capable of communicating their value to clients</li><li><!--block-->Thrives in ambiguity, takes initiative, and solves complex problems independently</li><li><!--block-->Excels at cross-functional collaboration and has strong communication and interpersonal skills</li><li><!--block-->Has strong analytical skills, with the ability to read and interpret data, identify trends, and use insights to drive strategic decisions</li><li><!--block-->Can anticipate customer needs and act as a trusted advisor to high-impact platform partners<br><br></li></ul><div><!--block--><strong>😀 We like to work with people who:</strong></div><ul><li><!--block-->Want to help build a global social safety net on the Internet.</li><li><!--block-->Think for themselves instead of copying others.</li><li><!--block-->Are willing to try new things, even with the risk of failure.</li><li><!--block-->Are intellectually curious and open to new ideas.</li><li><!--block-->Are creative and bold in the face of any problems.</li><li><!--block-->Have strong integrity and do the right thing.</li></ul>","tags":"[\"management\",\"b2b\"]","pubDate":"2025-03-05T07:56:10.559Z","link":"https://safetywing.pinpointhq.com/en/jobs/314598","slug":"head-of-platforms-safetywing-5576"},{"id":3972736788,"title":"Chargé(e) de projet Care Build Operations – En alternance","company":"Didask","image":"https://avatars.githubusercontent.com/u/14350668?s=200&v=4","description":"<p style=\"min-height:1.5em\"><em>🇫🇷 La langue de travail à Didask est l'anglais et sa maîtrise est requise pour nous rejoindre. Néanmoins, nous publions l'intégralité de nos offres d'emploi en français et en anglais. Vous pouvez retrouver toutes nos offres d'emploi sur </em><a target=\"_blank\" rel=\"noopener noreferrer nofollow\" href=\"https://jobs.ashbyhq.com/didask\"><em>cette page</em></a><em>, ainsi que plus d'informations sur Didask, notre culture et nos avantages.</em></p><p style=\"min-height:1.5em\"></p><p style=\"min-height:1.5em\"><em>🇬🇧🇺🇸 While English is our working language at Didask and proficiency is required to join us, we publish all our job openings in both English and French. You can find all our positions on </em><a target=\"_blank\" rel=\"noopener noreferrer nofollow\" href=\"https://jobs.ashbyhq.com/didask\"><em>this page</em></a><em>, along with more information about Didask, our culture and benefits.</em></p><h2><strong>🚀 Ton rôle au sein du Care :</strong></h2><ul style=\"min-height:1.5em\"><li><p style=\"min-height:1.5em\">Tu prendras en charge les différents paramétrages d’intercom, tu optimiseras les workflows du launcher, la qualification des données en lien avec les demandes clients, et mettras en place les utilities (survey, product tour…). </p></li><li><p style=\"min-height:1.5em\">Tu seras amené(e) à travailler en collaboration avec l’équipe OPS/Data pour assurer de la bonne remontée des datas dans intercom Tu travailleras en collaboration avec les équipes CSM, technique et Produit, pour enrichir la roadmap grâce aux retours clients. </p></li><li><p style=\"min-height:1.5em\">Tu seras force de proposition pour faire évoluer méthodes et outils pour rendre notre Service Clients toujours plus performant. </p></li><li><p style=\"min-height:1.5em\">Tu seras amené(e) à prendre quelques tours de support sur intercom et tu offriras une assistance d’excellence aux clients Didask A la manière d’un Sherlock, tu retourneras leurs demandes dans tous les sens pour trouver la solution qui les rendra heureux ! </p></li><li><p style=\"min-height:1.5em\">Tu enrichiras le centre d'aide en ligne en collaboration avec le Care Knowledge, pour la montée en compétence et en autonomie des clients et partenaires.</p></li></ul><p style=\"min-height:1.5em\"></p><h2><strong>🎯 Vos missions principales :</strong></h2><p style=\"min-height:1.5em\"><strong>Gestion et optimisation de l’outil Intercom</strong></p><ul style=\"min-height:1.5em\"><li><p style=\"min-height:1.5em\"><strong>Définition et mise en place des stratégies d’automatisation et de gestion des flux conversationnels et des utilities</strong> (chatbots, email, product tour, series, tooltips, ...) pour <strong>les clients français et internationaux.</strong></p></li><li><p style=\"min-height:1.5em\"><strong>Optimisation de l’architecture et de la donnée sur Intercom</strong> : structuration des workflows, gestion des volumes et amélioration des performances.</p></li><li><p style=\"min-height:1.5em\"><strong>Mise en conformité des usages d’Intercom</strong> avec la réglementation CNIL &amp; RGPD.</p></li><li><p style=\"min-height:1.5em\"><strong>Formation et accompagnement des équipes métier</strong> pour une utilisation efficace de l’outil.</p></li></ul><p style=\"min-height:1.5em\"><strong>Pilotage des projets stratégiques Build Operations</strong></p><ul style=\"min-height:1.5em\"><li><p style=\"min-height:1.5em\"><strong>Gestion de projets transverses :</strong> amélioration de l’expérience client via Intercom, intégration de nouveaux canaux automatisés (in-app, notifications, bannières on-site, ...).</p></li><li><p style=\"min-height:1.5em\"><strong>Collaboration avec les équipes CSM, Data, Product, Dev</strong>, pour garantir une bonne implémentation des solutions.</p></li><li><p style=\"min-height:1.5em\"><strong>Mise en place d’indicateurs de performance</strong> et suivi des résultats via dashboards (Notion, Metabase…).</p></li></ul><p style=\"min-height:1.5em\"><strong>Garant de la performance et des bonnes pratiques</strong></p><ul style=\"min-height:1.5em\"><li><p style=\"min-height:1.5em\">Recueil des besoins, cadrage des projets et rédaction des spécifications technico-fonctionnelles.</p></li><li><p style=\"min-height:1.5em\">Pilotage des étapes clés : tests, recette, mise en production, monitoring post-déploiement et analyse de performance.</p></li><li><p style=\"min-height:1.5em\">Maintien et enrichissement du référentiel documentaire interne, animation de formations et d’ateliers utilisateurs.</p></li><li><p style=\"min-height:1.5em\">Relation avec les prestataires et veille technologique sur les évolutions d’Intercom et des outils associés.</p></li></ul><p style=\"min-height:1.5em\"><strong>🤝🏻 Vos Missions annexes : </strong></p><p style=\"min-height:1.5em\"><strong>Support clients via intercom</strong></p><ul style=\"min-height:1.5em\"><li><p style=\"min-height:1.5em\">Prise en charge de tours de support via Intercom </p></li><li><p style=\"min-height:1.5em\">Réponse aux demandes des clients pour résoudre les problèmes rapidement</p></li><li><p style=\"min-height:1.5em\">Création des tickets et escalade des tickets complexes aux équipes concernées</p></li><li><p style=\"min-height:1.5em\">Suivi des conversations pour s'assurer que les demandes des clients sont bien traitées</p></li><li><p style=\"min-height:1.5em\">Amélioration continue en identifiant les problèmes récurrents et en proposant des solutions</p></li><li><p style=\"min-height:1.5em\">Remontée des demandes d’amélioration auprès de produit via l’outil Cycle</p></li><li><p style=\"min-height:1.5em\">Mise à jour de la base de connaissances en collaboration avec le Care Knowledge, en fonction des questions fréquentes et des retours clients</p><p style=\"min-height:1.5em\"></p></li></ul><h2><strong>🕵️‍♂️ Profil recherché :</strong></h2><ul style=\"min-height:1.5em\"><li><p style=\"min-height:1.5em\">Autonomie, proactivité et pragmatisme</p></li><li><p style=\"min-height:1.5em\">Communication positive à l’oral comme à l’écrit (culture de l’écrit et du feedback primordial sur Slack)</p></li><li><p style=\"min-height:1.5em\">Capacité à travailler en équipe et à collaborer efficacement </p></li></ul><ul style=\"min-height:1.5em\"><li><p style=\"min-height:1.5em\"><strong>Adéquation avec les valeurs de Didask :</strong> transparence, bienveillance, ownership, travail collaboratif, soutien et communication positive</p></li></ul><ul style=\"min-height:1.5em\"><li><p style=\"min-height:1.5em\">Expérience en <strong>gestion de projet CRM ou CX</strong>, avec une expertise sur <strong>Intercom ou une plateforme de service client propulsée par l'IA</strong></p></li><li><p style=\"min-height:1.5em\">Compétences en <strong>automatisation de workflows, data management et gestion de la délivrabilité</strong></p></li><li><p style=\"min-height:1.5em\">Orienté(e) <strong>Data analytics,</strong> tu es capable d’optimiser la qualification des demandes clients et <strong>de faire parler la donnée</strong></p></li><li><p style=\"min-height:1.5em\">Connaissances des enjeux techniques (API, intégrations, gestion des flux de données) appréciées</p></li><li><p style=\"min-height:1.5em\">Expérience dans le domaine du e-learning (LMS, outil auteur) appréciée. </p></li><li><p style=\"min-height:1.5em\">Dans le cadre <strong>d’une internationalisation imminente</strong>, Didask a déjà opéré une transition vers l'anglais à écrit. Il est donc nécessaire d’avoir bonne maîtrise de l’anglais (B2/C1), pour les échanges en interne et le traitement des tickets clients internationaux</p></li><li><p style=\"min-height:1.5em\">Capacité à travailler en transversal avec plusieurs équipes et à vulgariser des sujets techniques.</p></li><li><p style=\"min-height:1.5em\">Forte appétence pour l’optimisation des processus et l’amélioration continue.</p><p style=\"min-height:1.5em\"></p></li></ul><p style=\"min-height:1.5em\"><strong>🫵 Disponibilité : ASAP</strong></p><p style=\"min-height:1.5em\"></p><p style=\"min-height:1.5em\"><strong>Ce que Nous Offrons :</strong><br />👉 Type de contrat : Apprentissage (1 à 2 ans)<br />💰 Rémunération : Basé sur le salaire légal de l'apprentissage<br />👩🏻‍⚕️ Couverture santé à 100%<br />🍴 Carte repas (Swile) : 11,96 € par jour<br />🚇 Remboursement à 50% du pass de transport public<br />🧑🏻‍💻 Allocation télétravail pour des conditions de bureau à domicile optimisées</p><p style=\"min-height:1.5em\"></p><p style=\"min-height:1.5em\"><strong>🌟 Culture et Avantages :</strong><br />1️⃣ Accès à des réductions d'entreprise (magasins divers, divertissements, avantages culturels)<br />2️⃣ Budget annuel pour des activités culturelles et achats<br />3️⃣ Organisation de travail flexible :<br /><em>- </em>Bureau à Paris / Bagnolet (à 8 minutes à pied de Gallieni - Métro ligne 3)<br />- Télétravail à 100% possible (doit résider en France à des fins fiscales)<br />4️⃣ Réunion mensuelle en personne à la Maison Didask (Paris)<br />5️⃣ Séminaire annuel de l'équipe dans un lieu attractif</p><p style=\"min-height:1.5em\"></p><p style=\"min-height:1.5em\"><strong>Déroulement des entretiens : </strong></p><p style=\"min-height:1.5em\">🧑🏻‍💻 Visio de 30-40 minutes avec le Team Lead Care et un membre du Care Didask pour faire connaissance<br />📄 Business case à faire chez soi pour comprendre ton approche client<br />💻 Visio pour un feedback au sujet du cas rendu et entretien final avec les membres de l’équipe Care et la Head of Customer</p><p style=\"min-height:1.5em\"></p><p style=\"min-height:1.5em\"><strong>Vous êtes motivé(e) par l'idée de rejoindre une équipe dynamique et vous souhaitez jouer un rôle clé dans l’amélioration de l’expérience client et l’optimisation des outils de gestion de la relation clients ? </strong></p><p style=\"min-height:1.5em\"><strong>Alors rejoignez-nous vite! 🚀</strong></p><p style=\"min-height:1.5em\"><em>🇫🇷 Sauf mention contraire, toutes nos offres sont accessibles en télétravail complet à condition de travailler dans un fuseau horaire proche de celui de Paris et de disposer des bonnes conditions de travail (notamment connexion Internet). Attention, nous ne pouvons à l'heure actuelle embaucher que des résidents fiscaux français.</em></p><p style=\"min-height:1.5em\"><em>🇬🇧🇺🇸 Unless specified otherwise, all positions are fully remote, provided you work in a timezone close to Paris and have suitable working conditions (including Internet connection). Please note that we can currently only hire French tax residents.</em></p>","tags":"[\"management\"]","pubDate":"2025-03-04T21:36:24.054Z","link":"https://jobs.ashbyhq.com/didask/096e1004-7255-43cf-9f75-14925dec6bae","slug":"charg-e-de-projet-care-build-operations-en-alternance-didask-4533"},{"id":2524685101,"title":"HR Manager","company":"Coalesce","image":"https://avatars.githubusercontent.com/u/114246237?s=200&v=4","description":"<p style=\"min-height:1.5em\"><strong>Job Summary:</strong><br />As an HR Manager at Coalesce, you will be responsible for overseeing various aspects of the HR function, including performance management, employee engagement, HRIS, and payroll. This position requires strong analytical, organizational, and interpersonal skills. The HR Manager will report directly to the VP of Finance and work closely with cross-functional teams to drive HR initiatives that support the company's growth and success.</p><p style=\"min-height:1.5em\"><strong>Key Responsibilities:</strong></p><ul style=\"min-height:1.5em\"><li><p style=\"min-height:1.5em\"><strong>Performance Reviews:</strong></p><ul style=\"min-height:1.5em\"><li><p style=\"min-height:1.5em\">Manage the performance review process, ensuring that reviews are timely, comprehensive, and aligned with company goals.</p></li><li><p style=\"min-height:1.5em\">Provide guidance and support to managers and employees on performance evaluation criteria, goal setting, and feedback delivery.</p></li><li><p style=\"min-height:1.5em\">Assist in identifying areas for improvement and implementing strategies to enhance individual and team performance.</p></li></ul></li><li><p style=\"min-height:1.5em\"><strong>Employee Engagement Surveys:</strong></p><ul style=\"min-height:1.5em\"><li><p style=\"min-height:1.5em\">Oversee the planning, distribution, and analysis of employee engagement surveys.</p></li><li><p style=\"min-height:1.5em\">Provide actionable insights and recommendations based on survey data to enhance employee satisfaction and retention.</p></li><li><p style=\"min-height:1.5em\">Work with leadership to implement programs and initiatives designed to improve employee engagement and morale.</p></li></ul></li><li><p style=\"min-height:1.5em\"><strong>HRIS Management:</strong></p><ul style=\"min-height:1.5em\"><li><p style=\"min-height:1.5em\">Administer and maintain the Human Resource Information System (HRIS), ensuring accuracy of employee data.</p></li><li><p style=\"min-height:1.5em\">Manage HR system upgrades and implementations, ensuring alignment with business needs.</p></li><li><p style=\"min-height:1.5em\">Leverage HRIS data to generate reports, track key metrics, and provide insights to senior management.</p></li></ul></li><li><p style=\"min-height:1.5em\"><strong>Payroll:</strong></p><ul style=\"min-height:1.5em\"><li><p style=\"min-height:1.5em\">Oversee and ensure timely and accurate processing of payroll, working closely with the finance team to ensure compliance with all federal and state regulations.</p></li><li><p style=\"min-height:1.5em\">Address payroll-related inquiries and resolve any discrepancies promptly.</p></li><li><p style=\"min-height:1.5em\">Collaborate with VP of Finance to align payroll processes with budgeting and financial reporting.</p></li></ul></li><li><p style=\"min-height:1.5em\"><strong>General HR Support:</strong></p><ul style=\"min-height:1.5em\"><li><p style=\"min-height:1.5em\">Provide HR guidance on a variety of topics, including employee relations, compliance, benefits, and company policies.</p></li><li><p style=\"min-height:1.5em\">Partner with leadership to develop and execute HR strategies that align with organizational goals.</p></li><li><p style=\"min-height:1.5em\">Ensure compliance with labor laws, regulations, and internal policies.</p></li></ul></li></ul><p style=\"min-height:1.5em\"><strong>Qualifications:</strong></p><ul style=\"min-height:1.5em\"><li><p style=\"min-height:1.5em\">Bachelor's degree in Human Resources, Business Administration, or a related field.</p></li><li><p style=\"min-height:1.5em\">5+ years of experience in HR management, with a strong background in performance management, payroll, HRIS, and employee engagement.</p></li><li><p style=\"min-height:1.5em\">Proven experience working in a fast-paced environment and managing multiple priorities.</p></li><li><p style=\"min-height:1.5em\">Strong understanding of HRIS platforms and payroll systems.</p></li><li><p style=\"min-height:1.5em\">Excellent communication and interpersonal skills, with the ability to build relationships across all levels of the organization.</p></li><li><p style=\"min-height:1.5em\">Strong analytical skills and the ability to translate data into actionable insights.</p></li><li><p style=\"min-height:1.5em\">High level of discretion and confidentiality.</p></li></ul><p style=\"min-height:1.5em\"><strong>Preferred Qualifications:</strong></p><ul style=\"min-height:1.5em\"><li><p style=\"min-height:1.5em\">SHRM-CP, PHR, or similar HR certification.</p></li><li><p style=\"min-height:1.5em\">Experience with Rippling, Ashby, Deel, and Leapsome</p></li></ul><p style=\"min-height:1.5em\">Since founding Coalesce in 2020, our mission has remained the same: to improve the lives of data professionals by helping them transform data as efficiently as possible. We aim to bring an end to the days of arduous manual coding and inflexible GUIs by providing a best of both worlds solution. </p><p style=\"min-height:1.5em\"></p><p style=\"min-height:1.5em\">Coalesce is a fully remote and culture-first company. We believe that our culture is what allows us to not only recruit world-class talent, but also retain it. At Coalesce, you can expect to experience radical honesty, trust in the workplace empathy for yourself and others, and support for continuous learning and improvement.</p><p style=\"min-height:1.5em\"></p><p style=\"min-height:1.5em\"><em>US Benefits: Coalesce offers the following benefits for this position, subject to applicable eligibility requirements: Medical insurance; Dental insurance; Vision insurance; Life, AD&amp;D, and Disability Insurance; Unlimited Paid Time off, Paid Sick Time, Equity, Internet Reimbursement, WFH Office Set-Up Reimbursement, 401(k) retirement plan, and Company Annual Leave between December 26- January 2. </em></p>","tags":"[\"finance\",\"management\",\"aws\"]","pubDate":"2025-03-04T18:38:54.375Z","link":"https://jobs.ashbyhq.com/coalesce/fce9df4e-972c-45d0-bee2-53b072c9ac08","slug":"hr-manager-coalesce-4994"},{"id":2480498684,"title":"Sr. Manager, Brand + Product Marketing","company":"Empower","image":"https://lever-client-logos.s3.us-west-2.amazonaws.com/2e1a369c-b58f-41ac-8d86-4b0a77695e68-1687915522032.png","description":"<p style=\"min-height:1.5em\"><strong>EMPOWER OVERVIEW</strong></p><p style=\"min-height:1.5em\"><a target=\"_blank\" rel=\"noopener noreferrer nofollow\" href=\"http://empower.me/\">Empower</a> is shaking up an outdated financial system by providing real opportunity for our customers: the opportunity to get the cash they need, to access fair credit, and to change their financial story. Today, we’re helping millions of people find financial security through machine learning models that evaluate creditworthiness using a more inclusive lens and mobile-first products: Cash Advance, Thrive line of credit, and Petal credit cards. Tomorrow? Creating even more financial paths for our customers (and their wallets) to succeed.</p><p style=\"min-height:1.5em\">This year, Empower ranked #65 on Inc. 5000’s Fastest-Growing Private Companies list — our third year in a row cracking the top 100 — and was named by Forbes as one of the 25 Next Billion-Dollar Startups for 2024. Empower was also featured by Forbes on America’s Best Startup Employers list in 2023, and our Thrive line of credit product was named by Fast Company as one of 2022’s Next Big Things in Tech.</p><p style=\"min-height:1.5em\">Empower is backed by Sequoia Capital, Blisce, and Icon Ventures. Ready to grow your impact and accelerate your career? Take a look at our open roles — we can’t wait to meet you.</p><p style=\"min-height:1.5em\"></p><p style=\"min-height:1.5em\"><strong>THE EMPOWER WAY</strong></p><p style=\"min-height:1.5em\"><strong>Great Expectations</strong>: We come up with bold, audacious goals for ourselves and go all out for impact</p><p style=\"min-height:1.5em\"><strong>Owner Mindset</strong>: We give every employee latitude to act independently, make smart choices, and move the business forward</p><p style=\"min-height:1.5em\"><strong>Spirited Debate</strong>: We love skeptics and seek counter opinions to challenge our personal assumptions and expand our view</p><p style=\"min-height:1.5em\"><strong>Customer Obsession:</strong> We listen to understand, empathize, and create a memorable, rewarding experience for our community</p><p style=\"min-height:1.5em\"><strong>Inclusive Collaboration</strong>: We believe diverse teams make the best decisions, and we strive to give diverse voices a seat at the table</p><p style=\"min-height:1.5em\"><strong>No Jerks Allowed</strong>: We value our relationships and take the time to build trust and connection and communicate respectfully</p><p style=\"min-height:1.5em\"></p><p style=\"min-height:1.5em\"><strong>WHAT EMPOWER OFFERS</strong></p><p style=\"min-height:1.5em\">Competitive salary</p><p style=\"min-height:1.5em\">Generous equity package</p><p style=\"min-height:1.5em\">Full healthcare benefits</p><p style=\"min-height:1.5em\">Technology expense reimbursement</p><p style=\"min-height:1.5em\">Virtual first environment</p><p style=\"min-height:1.5em\"></p><h3><strong>ABOUT THE ROLE</strong></h3><p style=\"min-height:1.5em\">Empower is seeking a Senior Manager of Brand and Product Marketing to grow our brand. This individual will be responsible for developing and executing high-impact brand and product marketing strategies, campaigns, and communications to improve awareness and affinity, differentiate us from the competition, and generate word of mouth. The ideal candidate comes with a track record of flawless execution, exceptional cross-functional go-to-market leadership, and fearless creativity.</p><p style=\"min-height:1.5em\"></p><h3><strong>RESPONSIBILITIES</strong></h3><ul style=\"min-height:1.5em\"><li><p style=\"min-height:1.5em\">Develop and implement a <strong>comprehensive brand strategy</strong> that aligns with the company's vision and short-term/long-term business goals</p></li><li><p style=\"min-height:1.5em\">Develop and execute <strong>product marketing strategies</strong> that effectively communicate and distinguish the positioning and value proposition of our cash and credit products</p></li><li><p style=\"min-height:1.5em\">Collaborate with cross-functional teams to plan and execute successful product launches and <strong>go-to-market campaigns</strong></p></li><li><p style=\"min-height:1.5em\"><strong>Oversee implementation and refinement of our brand voice and partner with the design team to activate the brand fully in market, ensuring consistency and breakthrough</strong></p></li><li><p style=\"min-height:1.5em\">Nurture and maintain <strong>editorial relationships</strong> to amplify the brand and position our products advantageously with target audiences and influencers</p></li><li><p style=\"min-height:1.5em\"><strong>Set and actively track performance against KPIs to evaluate the effectiveness of brand and product marketing initiatives</strong></p></li></ul><p style=\"min-height:1.5em\"></p><h3><strong>REQUIREMENTS + SKILLS</strong></h3><ul style=\"min-height:1.5em\"><li><p style=\"min-height:1.5em\">BA required</p></li><li><p style=\"min-height:1.5em\">7+ years in brand marketing &amp; product marketing for consumer tech brands</p></li><li><p style=\"min-height:1.5em\">Exceptional communication skills, with a talent for influencing and inspiring others</p></li><li><p style=\"min-height:1.5em\">Meticulous attention to detail and consummate execution of ideas</p></li><li><p style=\"min-height:1.5em\">Resourceful problem solving</p></li><li><p style=\"min-height:1.5em\">Ability to balance deliberation with speed and agility</p></li></ul><p style=\"min-height:1.5em\"></p><p style=\"min-height:1.5em\">At Empower, we hire for people that push themselves to understand others and seek out ways to challenge their personal assumptions. Our hope is that by fostering such an environment, we strengthen our business and relationships by putting people first. We are committed to building a diverse, inclusive, and equitable workspace where everyone (regardless of age, education, ethnicity, gender, sexual orientation, or any personal characteristics) feels like they belong. Even if your experience doesn’t exactly match up to our job description, you should feel empowered to apply regardless!</p>","tags":"[]","pubDate":"2025-03-04T16:33:06.833Z","link":"https://jobs.ashbyhq.com/empower%20finance/7ec6b769-71ee-4cc9-9c96-ff35891e897e","slug":"sr-manager-brand-product-marketing-empower-4227"},{"id":6191005644,"title":"Full Stack Engineer - Growth","company":"Fingerprint","image":"https://avatars.githubusercontent.com/u/67208791?s=200&v=4","description":"&lt;div class=&quot;content-intro&quot;&gt;&lt;p&gt;&lt;strong&gt;Fingerprint&lt;/strong&gt;&amp;nbsp;empowers developers to stop online fraud at the source.&lt;/p&gt;\n&lt;p&gt;We work on turning radical new ideas in the fraud detection space into reality. Our products are developer-focused and our clients range from solo developers to publicly traded companies.&amp;nbsp;&lt;strong&gt;We are a globally dispersed, 100% remote company&lt;/strong&gt; with a strong open-source focus. Our flagship open-source project is &lt;a class=&quot;c-link c-link--focus-visible&quot; href=&quot;https://github.com/fingerprintjs/fingerprintjs&quot; target=&quot;_blank&quot; data-stringify-link=&quot;https://github.com/fingerprintjs/fingerprintjs&quot; data-sk=&quot;tooltip_parent&quot;&gt;FingerprintJS&lt;/a&gt; (20K stars on GitHub).&lt;/p&gt;\n&lt;p&gt;&lt;a class=&quot;c-link c-link--focus-visible&quot; href=&quot;https://www.crunchbase.com/organization/fingerprintjs&quot; target=&quot;_blank&quot; data-stringify-link=&quot;https://www.crunchbase.com/organization/fingerprintjs&quot; data-sk=&quot;tooltip_parent&quot;&gt;We have raised $77M&amp;nbsp;&lt;/a&gt;and are backed by Craft Ventures (previously invested in&amp;nbsp;&lt;a class=&quot;c-link c-link--focus-visible&quot; href=&quot;https://www.tesla.com/&quot; target=&quot;_blank&quot; data-stringify-link=&quot;https://www.tesla.com/&quot; data-sk=&quot;tooltip_parent&quot;&gt;Tesla,&amp;nbsp;&lt;/a&gt;&lt;a class=&quot;c-link c-link--focus-visible&quot; href=&quot;https://facebook.com/&quot; target=&quot;_blank&quot; data-stringify-link=&quot;https://facebook.com/&quot; data-sk=&quot;tooltip_parent&quot;&gt;Facebook,&amp;nbsp;&lt;/a&gt;&lt;a class=&quot;c-link c-link--focus-visible&quot; href=&quot;https://www.airbnb.com/&quot; target=&quot;_blank&quot; data-stringify-link=&quot;https://www.airbnb.com/&quot; data-sk=&quot;tooltip_parent&quot;&gt;Airbnb&amp;nbsp;&lt;/a&gt;), Nexus Venture Partners (previously invested in &lt;a href=&quot;https://www.postman.com/&quot;&gt;Postman&lt;/a&gt;, &lt;a href=&quot;https://www.apollo.io/&quot;&gt;Apollo.io,&lt;/a&gt; &lt;a href=&quot;https://min.io/&quot;&gt;MinIO&lt;/a&gt;, Druva)&amp;nbsp;and Uncorrelated Ventures (previously invested in&amp;nbsp;&lt;a class=&quot;c-link c-link--focus-visible&quot; href=&quot;https://redis.io/&quot; target=&quot;_blank&quot; data-stringify-link=&quot;https://redis.io/&quot; data-sk=&quot;tooltip_parent&quot;&gt;Redis,&amp;nbsp;&lt;/a&gt;&lt;a class=&quot;c-link c-link--focus-visible&quot; href=&quot;https://rollbar.com/&quot; target=&quot;_blank&quot; data-stringify-link=&quot;https://rollbar.com/&quot; data-sk=&quot;tooltip_parent&quot;&gt;Rollbar&amp;nbsp;&lt;/a&gt;&amp;amp;&lt;a class=&quot;c-link c-link--focus-visible&quot; href=&quot;https://gradle.org/&quot; target=&quot;_blank&quot; data-stringify-link=&quot;https://gradle.org/&quot; data-sk=&quot;tooltip_parent&quot;&gt;&amp;nbsp;Gradle&lt;/a&gt;).&lt;/p&gt;\n&lt;p&gt;&lt;em&gt;We have noticed a rise in recruiting impersonations across the industry, where scammers attempt to access candidates&#39; personal and financial information through fake interviews and offers. All Fingerprint recruiting email communications will always come from the @fingerprint domain. Any outreach claiming to be from Fingerprint via other sources should be ignored.&lt;/em&gt;&lt;/p&gt;\n&lt;p&gt;&amp;nbsp;&lt;/p&gt;\n&lt;hr&gt;\n&lt;p&gt;&amp;nbsp;&lt;/p&gt;\n&lt;p&gt;&amp;nbsp;&lt;/p&gt;\n&lt;p&gt;&amp;nbsp;&lt;/p&gt;&lt;/div&gt;&lt;p&gt;We are seeking a &lt;strong&gt;Full Stack Engineer&lt;/strong&gt;&amp;nbsp;to join our &lt;strong&gt;Growth team to&lt;/strong&gt; play a critical role in driving product-led growth through engineering initiatives. You will work closely with product managers, designers, and data scientists to build, iterate, and scale experiments that improve user activation, retention, and conversion.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;What you’ll do:&lt;/strong&gt;&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;Design, develop, and maintain &lt;strong&gt;full stack applications and growth experiments&lt;/strong&gt; that enhance onboarding, adoption, and user engagement.&lt;/li&gt;\n&lt;li&gt;Build and optimize &lt;strong&gt;experiment-driven features&lt;/strong&gt; like A/B tests, user flows, and UI/UX changes to maximize signups, activation rates, and conversions.&lt;/li&gt;\n&lt;li&gt;Develop and maintain our self-serve user experience, working on our dashboard, onboarding flows, pricing pages, and checkout systems.&lt;/li&gt;\n&lt;li&gt;Collaborate with the Growth, Product, and Data teams to analyze experiment results and iterate based on findings.&lt;/li&gt;\n&lt;li&gt;Implement and optimize &lt;strong&gt;tracking, analytics, and logging&lt;/strong&gt; to ensure we have clear visibility into user behavior.&lt;/li&gt;\n&lt;li&gt;Ensure a &lt;strong&gt;seamless integration&lt;/strong&gt; between frontend and backend services, working across our stack to ship end-to-end features efficiently.&lt;/li&gt;\n&lt;li&gt;Work on backend systems to improve API efficiency, authentication, and data processing to support scaling self-serve growth.&lt;/li&gt;\n&lt;li&gt;Actively contribute to improving engineering best practices, testing, and performance optimization.&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;&lt;strong&gt;What we’re looking for:&lt;/strong&gt;&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;&lt;strong&gt;5+ years of experience&lt;/strong&gt; as a full stack engineer, with a strong foundation in both frontend and backend development.&lt;/li&gt;\n&lt;li&gt;Experience working with &lt;strong&gt;React, TypeScript, and Node.js&lt;/strong&gt; (or similar modern frontend and backend frameworks).&lt;/li&gt;\n&lt;li&gt;Experience designing and running &lt;strong&gt;experiments (A/B testing, feature flags, user cohorts)&lt;/strong&gt; using &lt;strong&gt;Amplitude, PostHog, or similar analytics platforms&lt;/strong&gt;.&lt;/li&gt;\n&lt;li&gt;Familiarity with &lt;strong&gt;Stripe&lt;/strong&gt; or other payment platforms for checkout and billing improvements.&lt;/li&gt;\n&lt;li&gt;Proficiency in databases such as &lt;strong&gt;PostgreSQL, DynamoDB, Redis&lt;/strong&gt;, or similar.&lt;/li&gt;\n&lt;li&gt;Familiarity with &lt;strong&gt;cloud infrastructure (AWS, GCP, or Azure)&lt;/strong&gt; and CI/CD pipelines.&lt;/li&gt;\n&lt;li&gt;Strong understanding of &lt;strong&gt;product growth metrics&lt;/strong&gt; (activation rate, conversion rate, retention, etc.) and experience using data to drive engineering decisions.&lt;/li&gt;\n&lt;li&gt;Proficiency in working cross-functionally with &lt;strong&gt;Product, Design, and Data Science&lt;/strong&gt; teams to execute growth initiatives.&lt;/li&gt;\n&lt;li&gt;Excellent communication skills and ability to thrive in a fast-paced, remote-first environment.&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;&lt;strong&gt;Nice to Have:&lt;/strong&gt;&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;Knowledge of &lt;strong&gt;server-side rendering&lt;/strong&gt; and modern web performance optimizations.&lt;/li&gt;\n&lt;li&gt;Experience working on &lt;strong&gt;developer-focused or API-first products&lt;/strong&gt;.&lt;/li&gt;\n&lt;li&gt;Experience with &lt;strong&gt;infrastructure-as-code (Terraform, AWS CloudFormation)&lt;/strong&gt; and containerization (Docker, Kubernetes).&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;&lt;em&gt;$120-140k OTE For cash compensation, we set standard ranges for all &lt;/em&gt;&lt;strong&gt;&lt;em&gt;US based roles based&lt;/em&gt;&lt;/strong&gt;&lt;em&gt;&amp;nbsp;on function, level and geographic location, benchmarked against similar stage growth companies. In order to be compliant with local legislation, as well as to provide greater transparency to candidates, we share salary ranges on all job postings regardless of desired hiring location.&lt;/em&gt;&lt;strong&gt;&lt;em&gt;&amp;nbsp;Final offer amounts are determined by multiple factors including geographic location as well as candidate experience and expertise, and may vary from the amounts listed above.&lt;/em&gt;&lt;/strong&gt;&lt;/p&gt;&lt;div class=&quot;content-conclusion&quot;&gt;&lt;p&gt;&lt;em&gt;We have noticed a rise in recruiting impersonations across the industry, where scammers attempt to access candidates&#39; personal and financial information through fake interviews and offers. All Fingerprint recruiting email communications will always come from the @fingerprint domain. Any outreach claiming to be from Fingerprint via other sources should be ignored.&lt;/em&gt;&lt;/p&gt;\n&lt;p&gt;Offers vary depending on, but not limited to, relevant experience, education, certifications/licenses, skills, training, and market conditions.&amp;nbsp;&lt;/p&gt;\n&lt;p&gt;Due to regulatory and security reasons, there’s a small number of countries where we cannot have Fingerprint teammates based.&amp;nbsp;&lt;strong data-stringify-type=&quot;bold&quot;&gt;Additionally, because Fingerprint is an all-remote company and people can join our workforce from almost any country, we do not sponsor visas. Fingerprint teammates need to be authorized to work from their home location&lt;/strong&gt;.&lt;/p&gt;\n&lt;p&gt;We are dedicated to creating an inclusive work environment for everyone. We embrace and celebrate the unique experiences, perspectives and cultural backgrounds that each employee brings to our workplace. Fingerprint strives to foster an environment where our employees feel respected, valued and empowered, and our team members are at the forefront in helping us promote and sustain an inclusive workplace. We highly encourage people from underrepresented groups in tech to apply.&lt;/p&gt;\n&lt;p&gt;If you are applying as a resident of California, please read our CCPA notice &lt;a href=&quot;https://dev.fingerprint.com/docs/dpa-ccpa&quot; target=&quot;_blank&quot;&gt;here&lt;/a&gt;&lt;/p&gt;\n&lt;p&gt;If you are applying as a resident of the EU, please read our GDPR notice &lt;a href=&quot;https://dev.fingerprint.com/docs/dpa-gdpr&quot; target=&quot;_blank&quot;&gt;here&lt;/a&gt;&lt;/p&gt;&lt;/div&gt;","tags":"[\"postgres\",\"typescript\",\"engineering\",\"database\",\"aws\"]","pubDate":"2025-03-04T14:49:12.000Z","link":"https://fingerprint.com/careers/jobs/apply/?gh_jid=5461337004","slug":"full-stack-engineer-growth-fingerprint-191"},{"id":2028884136,"title":"Account Executive Bilingual (English & Spanish)","company":"Bobtail","image":"https://media.licdn.com/dms/image/v2/D560BAQHzAQXggf5uQg/company-logo_200_200/company-logo_200_200/0/1688643230676/bobtail_logo?e=1742428800&v=beta&t=P9gHgDHOknAHShwQR1JsLMYGaVscLGTzwmWViGMvnbE","description":"&lt;h2&gt;&lt;strong&gt;About Bobtail&lt;/strong&gt;&lt;/h2&gt;\n&lt;p&gt;Bobtail is dedicated to increasing happiness for our customers by eliminating inefficiencies in the supply chain. We envision a supply chain without friction, fraud, waste, and abuse where companies succeed based on the value they create.&lt;/p&gt;\n&lt;p&gt;&amp;nbsp;&lt;/p&gt;\n&lt;p&gt;We work uniquely at Bobtail, where we value teams over individuals and encourage experimentation and iteration to constantly improve. Teams are given flexibility in working towards a shared purpose and given the freedom to decide how they will accomplish their goals.&lt;/p&gt;\n&lt;p&gt;If you are an out-of-the-box thinker who takes a proactive approach to collaborating with others to solve problems and achieve your goals - we would love to talk to you.&lt;/p&gt;\n&lt;p&gt;The things we value:&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;Mission&lt;/li&gt;\n&lt;li&gt;Teams over individuals&lt;/li&gt;\n&lt;li&gt;Collaboration&lt;/li&gt;\n&lt;li&gt;Communication&lt;/li&gt;\n&lt;li&gt;Iteration&lt;/li&gt;\n&lt;li&gt;Experimentation and failing fast&lt;/li&gt;\n&lt;li&gt;Initiative and solutions-oriented approach&lt;/li&gt;\n&lt;li&gt;Documentation&lt;/li&gt;\n&lt;li&gt;Data&lt;/li&gt;\n&lt;li&gt;Mental health and work-life balance&lt;/li&gt;\n&lt;li&gt;Diversity&lt;/li&gt;\n&lt;li&gt;Transparency&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;&lt;strong&gt;You should apply if you have:&lt;/strong&gt;&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;3 years of B2B cold calling &amp;amp; outbound sales experience&lt;/li&gt;\n&lt;li&gt;Bilingual (English/Spanish) is a must&lt;/li&gt;\n&lt;li&gt;Software as a Service (SaaS) Nice to have&amp;nbsp;&lt;/li&gt;\n&lt;li&gt;US Trucking Industry knowledge is a plus&lt;/li&gt;\n&lt;li&gt;CRM usage experience is preferred (Salesforce is a plus)&lt;/li&gt;\n&lt;li&gt;Start-up experience is a plus&lt;/li&gt;\n&lt;li&gt;Ability to quickly learn in a fast-paced environment,&lt;/li&gt;\n&lt;li&gt;Consistent track record of achievement and hitting quotas&lt;/li&gt;\n&lt;li&gt;Confidence, as well as strong verbal &amp;amp; written communication skills when interacting with clients&lt;/li&gt;\n&lt;li&gt;Ability to discover and understand customer needs and propose solutions&lt;/li&gt;\n&lt;li&gt;Dependable team player&lt;/li&gt;\n&lt;li&gt;A motivated, driven, self-starter… We love those with grit and accountability!&lt;/li&gt;\n&lt;li&gt;You must own a modern laptop with a working camera that is not older than 3 years.&lt;/li&gt;\n&lt;li&gt;An Internet Speed of 50 Mbps is required&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;&amp;nbsp;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;You will be responsible for:&lt;/strong&gt;&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;Making daily cold calls &amp;amp; sending emails/text to connect with prospects&lt;/li&gt;\n&lt;li&gt;Converting prospects &amp;amp; leads into Bobtail clients&lt;/li&gt;\n&lt;li&gt;Collaborating as a team to accomplish individual, team, and company-wide goals&lt;/li&gt;\n&lt;li&gt;Maintaining a pipeline of leads and opportunities using our CRM (Salesforce)&lt;/li&gt;\n&lt;li&gt;Effectively using other sales tools to track progress and improve your performance&lt;/li&gt;\n&lt;li&gt;Learning about each client’s needs, industry, and competitors.&lt;/li&gt;\n&lt;li&gt;Building long-lasting, mutually beneficial relationships with prospects and clients to create a better customer experience.&lt;/li&gt;\n&lt;li&gt;Following up with prospects throughout the sales cycle to continue nurturing them.&lt;/li&gt;\n&lt;li&gt;Presenting the value of Bobtail products and services to prospects&lt;/li&gt;\n&lt;li&gt;Staying current on company offerings and industry trends.&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;&lt;strong&gt;Educational background:&lt;/strong&gt;&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;Bachelor’s degree preferred&lt;/li&gt;\n&lt;li&gt;Sales or business education/certification preferred&lt;/li&gt;\n&lt;li&gt;Completed studies preferred&lt;br&gt;&lt;br&gt;&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;&lt;strong&gt;Benefits:&lt;/strong&gt;&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;Monthly Mental Break Day&lt;/li&gt;\n&lt;li&gt;Paid Time Off&lt;/li&gt;\n&lt;li&gt;Work from home (or wherever)&lt;/li&gt;\n&lt;li&gt;Parental leave&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;&lt;br&gt;Creating a diverse and inclusive workplace is Bobtail’s nucleus. We are an equal opportunity employer and embrace people of different backgrounds, cultures, religions, national origins, races, colors, genders, gender expressions, sexual orientations, ages, marital status, veteran status, experiences, abilities, and perspectives.&lt;/p&gt;\n&lt;p&gt;&lt;br&gt;&lt;br&gt;&lt;/p&gt;","tags":"[\"b2b\"]","pubDate":"2025-03-04T12:43:31.000Z","link":"https://job-boards.greenhouse.io/bobtail/jobs/4536151005","slug":"account-executive-bilingual-english-spanish-bobtail-8509"},{"id":9052038592,"title":"Engineering Manager","company":"Wikimedia Foundation","image":"https://remotive.com/job/1978420/logo","description":"<p><strong>Summary</strong></p>\n<p>The Wikimedia Foundation is looking for an experienced Engineering Manager to lead our Testing Platform team. The team purpose is to provide the foundation for software engineers to self-service on quality practices by providing tools and frameworks to write tests and testing environments to execute them.<br><br>We’re committed to making knowledge available to everyone globally. This is an opportunity to do good while building technology that empowers the current and future generations of developers across the globe to build high quality software that scales with our mission. </p>\n<p>This role supports a geographically distributed team of 5-7 software engineers who are building and operating cloud testing environments, visual regression and end-to-end testing frameworks, code quality tools and other testing frameworks that ensures quality of the software that runs Wikipedia and its sister projects. </p>\n<p>Our team builds a platform layer that enables our staff &amp; communities to achieve our Vision: a world in which every single human being can freely share in the sum of all knowledge.  </p>\n<p>The Wikimedia Foundation values diversity and recognizes that employees from a broad range of perspectives are essential to creating a knowledge source that benefits everyone. We are committed to inclusion, diversifying tech, and advocating for diversity in our employees, their experiences, and the people we serve.</p>\n<p><strong>You are responsible for:</strong></p>\n<ul style=\"\">\n<li style=\"\">Collaborating with your team and cross-functional stakeholders to plan, prioritize, and delegate work, balancing project goals with technical requirements and team skill sets.</li>\n<li style=\"\">Driving execution–ensuring projects are on track, key performance metrics are being met, and work is being actively unblocked.</li>\n<li style=\"\">Communicating proactively on progress, risks, and outcomes to stakeholders.</li>\n<li style=\"\">Ensuring the engineering team is engaged and productive, and understands the big picture of the project and how their efforts contribute to it.</li>\n<li style=\"\">Coaching your team, conducting performance reviews, providing career guidance, and building a professional and inclusive work culture.</li>\n<li style=\"\">Managing risk and succession planning for the project, documenting and implementing lifecycle management and best practices for the software we build.</li>\n<li style=\"\">Interviewing, hiring, onboarding, and mentoring engineers with the goal of quickly making them productive and engaged members of your team.</li>\n</ul>\n<p><strong>Skills and Experience:</strong></p>\n<ul style=\"\">\n<li style=\"\">Several years of engineering experience, including multiple years in a technical management or leadership role. </li>\n<li style=\"\">Several years of hands-on experience developing, designing and reviewing web applications using languages such as Go, Python, PHP or other object oriented programming languages.</li>\n<li style=\"\">Experience in building and operating resilient, reliable software systems and services utilizing scalable infrastructure technologies (e.g. Kubernetes).</li>\n<li style=\"\">Excellent verbal and written communication skills in English, with the ability to articulate complex technical topics and solutions clearly and concisely.</li>\n<li style=\"\">An established track record and prior success in working with a multicultural, remote and distributed high-performing team.</li>\n<li style=\"\">Robust analytical, problem-solving, and conceptual skills with the ability to deliver on detail as well as strategy.</li>\n<li style=\"\">Work flexible hours with core overlap time from 2-6 pm UTC.</li>\n</ul>\n<p><strong>Qualities that are important to us:</strong></p>\n<ul style=\"\">\n<li style=\"\">Alignment with our mission and values.</li>\n<li style=\"\">Experience with open source development methodologies and open source community.</li>\n<li style=\"\">Excellent communication and follow-up skills. You’re actively engaged, and your team feels involved and well-informed about what’s happening in the team and broader organization.</li>\n<li style=\"\">Experience with remote work and the level of engagement and communication it takes to build a geographically distributed team that is functional and healthy.</li>\n<li style=\"\">Experience with large-scale, global developer ecosystems and platforms and managing the risks and opportunities associated with them.</li>\n<li style=\"\">Resilience—we work on new and interesting problems in public and collaborative ways.</li>\n<li style=\"\">Working together for outcomes, and being willing to change course.</li>\n<li style=\"\">Passionate about developing people and platforms, with a focus on fostering a strong product-minded culture.</li>\n</ul>\n<p><strong>Additionally, we’d love it if you have:</strong></p>\n<ul style=\"\">\n<li style=\"\">Experience working in platform teams and scaling impact across the organization. </li>\n<li style=\"\">Experience editing Wikipedia or with the Wikipedia, Wikidata, or Wikimedia Commons communities or other collaborative enterprises.</li>\n<li style=\"\">Familiarity with MediaWiki.</li>\n</ul>\n<div class=\"h4\">About the Wikimedia Foundation</div>\n<p>The Wikimedia Foundation is the nonprofit organization that operates Wikipedia and the other Wikimedia free knowledge projects. Our vision is a world in which every single human can freely share in the sum of all knowledge. We believe that everyone has the potential to contribute something to our shared knowledge, and that everyone should be able to access that knowledge freely. We host Wikipedia and the Wikimedia projects, build software experiences for reading, contributing, and sharing Wikimedia content, support the volunteer communities and partners who make Wikimedia possible, and advocate for policies that enable Wikimedia and free knowledge to thrive. </p>\n<p>The Wikimedia Foundation is a charitable, not-for-profit organization that relies on donations. We receive donations from millions of individuals around the world, with an average donation of about $15. We also receive donations through institutional grants and gifts. The Wikimedia Foundation is a United States 501(c)(3) tax-exempt organization with offices in San Francisco, California, USA.</p>\n<p><em><strong>As an equal opportunity employer, the Wikimedia Foundation values having a diverse workforce and continuously strives to maintain an inclusive and equitable workplace. We encourage people with a diverse range of backgrounds to apply. We do not discriminate against any person based upon their race, traits historically associated with race, religion, color, national origin, sex, pregnancy or related medical conditions, parental status, sexual orientation, gender identity, gender expression, age, status as a protected veteran, status as an individual with a disability, genetic information, or any other legally protected characteristics.</strong></em></p>\n<p>The Wikimedia Foundation is a remote-first organization with staff members including contractors based 40+ countries<strong>*</strong>. Salaries at the Wikimedia Foundation are set in a way that is competitive, equitable, and consistent with our values and culture. The anticipated annual pay range of this position for applicants based within the United States is US$127,714  to US$200,943 with multiple individualized factors, including cost of living in the location, being the determinants of the offered pay. For applicants located outside of the US, the pay range will be adjusted to the country of hire. We neither ask for nor take into consideration the salary history of applicants. The compensation for a successful applicant will be based on their skills, experience and location. </p>\n<p><strong>*Please note that we are currently able to hire in the following countries: </strong>Australia, Austria, Bangladesh, Belgium, Brazil, Canada, Colombia, Costa Rica, Croatia, Czech Republic, Denmark, Egypt, Estonia, Finland, France, Germany, Ghana, Greece, India, Indonesia, Ireland, Israel, Italy, Kenya, Mexico, Netherlands, Nigeria, Peru, Poland, Singapore, South Africa, Spain, Sweden, Switzerland, Uganda, United Arab Emirates, United Kingdom, United States of America and Uruguay.  Our non-US employees are hired through a local third party Employer of Record (EOR). </p>\n<p>We periodically review this list to streamline to ensure alignment with our hiring requirements. </p>\n<p>All applicants can reach out to their recruiter to understand more about the specific pay range for their location during the interview process.</p>\n<p><em><strong>If you are a qualified applicant requiring assistance or an accommodation to complete any step of the application process due to a disability, you may contact us at recruiting@wikimedia.org or +1 (415) 839-6885.</strong></em></p>\n<p><strong>More information</strong></p>\n<p><a href=\"%22https:/wikimediafoundation.org/about/jobs/#section-12%22\" rel=\"nofollow\"><strong>U.S. Benefits &amp; Perks</strong></a></p>\n<p><a href=\"%22https:/foundation.wikimedia.org/wiki/Applicant_privacy_policy%22\" rel=\"nofollow\"><strong>Applicant Privacy Policy</strong></a></p>\n<p><a href=\"%22https:/wikimediafoundation.org/%22\" rel=\"nofollow\"><strong>Wikimedia Foundation</strong></a></p>\n<p><a href=\"%22https:/www.youtube.com/watch?v=8mvPYF_erNA&amp;list=PLVx9pX-VnGVh9Akb-O-SAKZ-GDTVTHZqS&amp;index=8%22\" rel=\"nofollow\"><strong>What does the Wikimedia Foundation do?</strong></a></p>\n<p><a href=\"%22https:/www.youtube.com/watch?v=7gATwhhGrPk&amp;list=PLVx9pX-VnGVh9Akb-O-SAKZ-GDTVTHZqS&amp;index=1%22\" rel=\"nofollow\"><strong>What makes Wikipedia different from social media platforms?</strong></a></p>\n<p><a href=\"%22https:/wikimediafoundation.org/wiki/Our_projects%22\" rel=\"nofollow\"><strong>Our Projects</strong></a></p>\n<p><a href=\"%22https:/techblog.wikimedia.org/%22\" rel=\"nofollow\"><strong>Our Tech Stack</strong></a></p>\n<p><a href=\"%22https:/wikimediafoundation.org/news/%22\" rel=\"nofollow\"><strong>News from across the Wikimedia movement</strong></a></p>\n<p><a href=\"%22https:/diff.wikimedia.org/%22\" rel=\"nofollow\"><strong>Wikimedia Blog</strong></a></p>\n<p><a href=\"%22https:/meta.wikimedia.org/wiki/Strategy/Wikimedia_movement/2017%22\" rel=\"nofollow\"><strong>Wikimedia 2030</strong></a></p>\n<p> </p>\n<div id='\"l-content\"'> </div>\n<img src=\"https://remotive.com/job/track/1978420/blank.gif?source=public_api\" alt=\"\"/>","tags":"[\"engineering management\"]","pubDate":"2025-03-03T15:51:33.000Z","link":"https://remotive.com/remote-jobs/project-management/engineering-manager-1978420","slug":"engineering-manager-wikimedia-foundation-8608"},{"id":6555973682,"title":"Senior Marketing Data Engineer/Analytics Engineer","company":"Automattic Careers","image":"https://remotive.com/job/1975471/logo","description":"<p>At Automattic, the company behind WordPress.com, WooCommerce, Jetpack, and Tumblr, we’re building an internal marketing automation platform to streamline how we handle marketing data and tools. As such, we’re looking for a Marketing Data Engineer to join our Growth Infra team. This role requires a unique blend of data engineering and analytics engineering. You’ll play a critical part in creating robust ETLs, ensuring data quality, and establishing scalable data architecture to unify marketing data across the company. By joining us, you’ll have the opportunity to work on innovative projects, collaborate across teams, and directly impact the efficiency and effectiveness of marketing at Automattic.</p>\n<p><strong>Responsibilities</strong></p>\n<ul style=\"\">\n<li style=\"\">Design, develop, and maintain ETL (extract, transform, and load) pipelines: Build and manage scalable ETL pipelines and data integration processes using tools like Meltano, Fivetran, or custom-built solutions.</li>\n<li style=\"\">Data Quality Assurance: Implement robust data validation checks and mechanisms to ensure the integrity, quality, and reliability of marketing data.</li>\n<li style=\"\">Data Modeling: Architect and develop data models to support marketing segmentation, personalization, and automation.</li>\n<li style=\"\">Collaboration: Partner with stakeholders, including marketers, analysts, and engineers, to gather requirements, define solutions, and deliver reusable data models for marketing campaigns.</li>\n<li style=\"\">Monitoring and Optimization: Monitor, troubleshoot, and optimize ETL pipelines to ensure efficiency and reliability over time.</li>\n<li style=\"\">Data Architecture: Contribute to the design and implementation of data architecture supporting the internal marketing automation platform.</li>\n<li style=\"\">Compliance: Ensure all solutions adhere to security, privacy, and compliance standards.</li>\n<li style=\"\">Knowledge Sharing: Participate in code reviews, documentation efforts, and knowledge-sharing activities to foster collaboration and continuous learning.</li>\n<li style=\"\">Process Improvement: Identify opportunities to streamline processes, reduce technical debt, and promote best practices for data engineering.</li>\n<li style=\"\">Stay Current: Keep informed about emerging trends and technologies in data engineering and marketing automation.</li>\n</ul>\n<p><strong>Requirements</strong></p>\n<ul style=\"\">\n<li style=\"\">Proven experience designing and maintaining ETL pipelines using tools such as Meltano, Fivetran, Airflow, or similar.</li>\n<li style=\"\">Strong proficiency in SQL, including advanced concepts like window functions and CTEs (Common Table Expressions).</li>\n<li style=\"\">Experience with data validation, testing, and ensuring high data quality in complex workflows.</li>\n<li style=\"\">Solid understanding of data architecture principles, including building scalable and efficient models for marketing and analytics.</li>\n<li style=\"\">Familiarity with marketing data and segments, including CRM, attribution, and campaign performance metrics.</li>\n<li style=\"\">Strong programming skills in Python or a similar language commonly used in data engineering.</li>\n<li style=\"\">Excellent problem-solving skills and a proactive approach to identifying and resolving pipeline issues.</li>\n<li style=\"\">Exceptional communication skills to explain technical concepts to both technical and non-technical stakeholders.</li>\n<li style=\"\">A commitment to documenting processes and promoting best practices for maintainable data infrastructure.</li>\n</ul>\n<p><strong>Salary range: $90,000-$150,000 USD.</strong>  Please note that salary ranges are global, regardless of location, and we pay in local currency.</p>\n<p>We are searching for high-caliber candidates with the skills and qualities to have a net positive for Automattic. Pay will reflect the potential contribution and the impact you can bring, which may, in some cases, go beyond the range stated.</p>\n<p>This isn’t your typical work-from-home job—we are a fully-remote company with an open vacation policy. Read more about our<a href=\"%22https:/automattic.com/compensation/%22\" rel=\"nofollow\"> compensation philosophy</a>. To see a full list of benefits by country, consult our <a href=\"%22https:/automattic.com/benefits/%22\" rel=\"nofollow\">Benefits Page</a>. And check out these links to learn more about <a href=\"%22https:/automattic.com/how-we-hire/%22\" rel=\"nofollow\">How We Hire</a> and <a href=\"%22https:/automattic.com/expectations/%22\" rel=\"nofollow\">What We Expect from Ourselves</a>.</p>\n<div class='\"content-conclusion\"'>\n<p><strong>About Automattic</strong> </p>\n<p>We are the people behind <a href=\"%22http:/wordpress.com/%22\" rel=\"nofollow\">WordPress.com</a>, <a href=\"%22http:/woocommerce.com/%22\" rel=\"nofollow\">WooCommerce</a>, <a href=\"%22https:/www.tumblr.com/%22\" rel=\"nofollow\">Tumblr</a>, <a href=\"%22http:/simplenote.com/%22\" rel=\"nofollow\">Simplenote</a>, <a href=\"%22http:/jetpack.com/%22\" rel=\"nofollow\">Jetpack</a>, <a href=\"%22http:/longreads.com/%22\" rel=\"nofollow\">Longreads</a>, <a href=\"%22https:/dayoneapp.com/%22\" rel=\"nofollow\">Day One</a>, <a href=\"%22https:/www.pocketcasts.com/%22\" rel=\"nofollow\">Pocket Casts</a>, and more. We believe in making the web a better place.</p>\n<p>We’re a distributed company with more than 1700 Automatticians in 92 countries speaking 110+ different languages. And, even more than growth and profitability (although we’re plenty profitable), above all, we’re driven by a mission:  We democratize publishing and commerce so anyone with a story can tell it, and anyone with a product can sell it, regardless of income, gender, politics, language, or country.</p>\n<p><a href=\"%22https:/github.com/Automattic%22\" rel=\"nofollow\">We believe in Open Source</a>, and the vast majority of our work is available under the <a href=\"%22https:/en.wikipedia.org/wiki/GNU_General_Public_License%22\" rel=\"nofollow\">GPL</a>.</p>\n<p><strong>Diversity, Equity, &amp; Inclusion at Automattic</strong> </p>\n<p>We’re improving diversity in the tech industry. At Automattic, we want people to love their work and show respect and empathy to all. We welcome differences and strive to increase participation from traditionally underrepresented groups. Our DEI committee involves Automatticians across the company and drives grassroots change. For example, this group has helped facilitate private online spaces for affiliated Automatticians to gather and helps run a monthly DEI People Lab series for further learning. DEI is a priority at Automattic, though our dedication influences far more than just Automatticians: We make our products freely available and translate our products into and offer customer support in numerous languages. We require unconscious bias training for our hiring teams and ensure our products are accessible across different bandwidths and devices. </p>\n<p>Automattic is a <a href=\"%22https:/mostlovedworkplace.com/companies/automattic-inc/%22\" rel=\"nofollow\">Most Loved Company</a> and <a href=\"%22https:/disabilityconfident.campaign.gov.uk/%22\" rel=\"nofollow\">Disability Confident Committed</a>. (<a href=\"%22https:/happinessengineer.blog/2022/09/08/happiness-for-everyone-working-with-a-disability-at-automattic/%22\" rel=\"nofollow\">Here’s what that might mean for you</a>.) Learn more about our dedication to <a href=\"%22https:/href.li/?https://automattic.com/diversity-and-inclusion/%22\" rel=\"nofollow\">diversity, equity, and inclusion</a> and our <a href=\"%22https:/automattic.com/automattician-resource-groups/%22\" rel=\"nofollow\">Employee Resource Groups</a>.</p>\n<p>If you need disability-related accommodations during the application or interview process, please <a href=\"%22https:/automattic.com/disability-related-accommodation-request/%22\" rel=\"nofollow\" target='\"_blank\"'>fill out this form</a>. We are committed to ensuring an accessible hiring process for all candidates.</p>\n<p><em>All qualified applicants will receive consideration for employment without regard to race, color, religion, sex, sexual orientation, gender identity, national origin, disability, or status as a protected veteran.</em></p>\n</div>\n<img src=\"https://remotive.com/job/track/1975471/blank.gif?source=public_api\" alt=\"\"/>","tags":"[\"python\",\"sql\"]","pubDate":"2025-03-03T13:50:15.000Z","link":"https://remotive.com/remote-jobs/software-dev/senior-marketing-data-engineer-analytics-engineer-1975471","slug":"senior-marketing-data-engineer-analytics-engineer-automattic-careers-487"}]