[{"id":4800468823,"title":"Product Manager","company":"Nethermind","image":"https://avatars.githubusercontent.com/u/43478154?s=200&v=4","description":"&lt;div class=&quot;content-intro&quot;&gt;&lt;h2&gt;What are we all about?&lt;/h2&gt;\n&lt;p&gt;We are a team of builders and researchers on a mission to empower enterprises and developers worldwide to access and build on decentralized systems.&lt;/p&gt;\n&lt;p&gt;Our expertise covers several domains: Ethereum and Starknet protocol engineering, layer-2, AI, cryptography research, protocol research, decentralized finance (DeFi), security auditing, formal verification, real-time monitoring, smart contract development, and dapps and enterprise engineering.&lt;/p&gt;\n&lt;p&gt;Working to solve some of the most challenging problems in the blockchain space, we frequently collaborate with renowned companies, such as Ethereum Foundation, Starknet Foundation, Gnosis Chain, Flashbots, Forta Protocol, Lido, EigenLayer, Open Zeppelin, RISCZero, Aleph Zero, and many more.&lt;/p&gt;\n&lt;p&gt;Today, we are a 350+ strong team working remotely across 66+ countries.&lt;/p&gt;\n&lt;p&gt;View all our open positions here: &lt;a href=&quot;https://www.nethermind.io/open-roles&quot;&gt;https://www.nethermind.io/open-roles&amp;nbsp;&lt;/a&gt;&lt;/p&gt;&lt;/div&gt;&lt;p&gt;&lt;strong&gt;What We Need&lt;/strong&gt;&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;A proactive and hands-on product manager to lead the product strategy for one of our business groups.&lt;/li&gt;\n&lt;li&gt;Strong domain knowledge in the Ethereum ecosystem.&lt;/li&gt;\n&lt;li&gt;A willingness to work remotely. You will be working with a globally distributed team of talented engineers and researchers, as well as many industry-leading partners.&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;&lt;strong&gt;Role &amp;amp; Responsibilities&lt;/strong&gt;&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;Own the mission and vision for each of the group’s products.&lt;/li&gt;\n&lt;li&gt;Own the product strategy for the group: determine which products we should build next, with whom, and why.&lt;/li&gt;\n&lt;li&gt;Deeply understand our users&#39; needs by using our products, conducting research, and engaging with the community.&lt;/li&gt;\n&lt;li&gt;Maintain a clear and prioritized roadmap for each product, balancing user needs with developer resources and technical feasibility.&lt;/li&gt;\n&lt;li&gt;Work with UX/UI designers, project managers, engineers, marketing, and legal to ensure successful product development and launch.&lt;/li&gt;\n&lt;li&gt;Track key financial metrics, including burn rate, revenue projections, and unit economics.&lt;/li&gt;\n&lt;li&gt;Have deep insight into the ecosystems around the blockchains that we are helping to build.&lt;/li&gt;\n&lt;li&gt;Have empathy with developers: write clear, complete product requirements that help devs be productive.&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;&lt;strong&gt;Requirements&lt;/strong&gt;&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;At least two years of experience in the crypto industry&lt;/li&gt;\n&lt;li&gt;At least two years of experience working in a product role&lt;/li&gt;\n&lt;li&gt;Strong English communication skills&lt;/li&gt;\n&lt;li&gt;Some hands-on experience in software development&lt;/li&gt;\n&lt;li&gt;Bachelor&#39;s degree or equivalent practical experience&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;&lt;strong&gt;Nice to have&lt;/strong&gt;&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;Prior involvement in one or more Ethereum L2 blockchains&lt;/li&gt;\n&lt;li&gt;Some basic smart contract development experience&lt;/li&gt;\n&lt;li&gt;Understanding of the DeFi landscape, such as lending protocols, AMMs, Perps and stablecoins.&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;&lt;/p&gt;&lt;div class=&quot;content-conclusion&quot;&gt;&lt;div&gt;&lt;span style=&quot;font-size: 8pt;&quot;&gt;&lt;em&gt;&lt;span style=&quot;text-decoration: underline;&quot;&gt;&lt;strong&gt;Disclaimer&lt;/strong&gt;&lt;/span&gt;: I hereby consent to my personal information being stored and processed by Demerzel Solutions Limited (t/a Nethermind) (the “Company”) for recruitment purposes in relation to both the selected job role and any other role the Company considers me a qualified candidate for. All data storing and processing by the Company takes place in accordance with the UK GDPR. Kindly refer to our privacy policy for more details.&amp;nbsp;&lt;/em&gt;&lt;/span&gt;&lt;br&gt;&lt;span style=&quot;font-size: 8pt;&quot;&gt;&lt;em&gt;Your consent to share personal information is entirely voluntary, and you may withdraw your consent at any time. Should you have any questions about this process, or wish to withdraw your consent please contact: legalnotices@nethermind.io&amp;nbsp;&lt;/em&gt;&lt;/span&gt;&lt;br&gt;&lt;br&gt;Keep up to date on what we are working on by following&amp;nbsp;&lt;span class=&quot;il&quot;&gt;us&lt;/span&gt;&amp;nbsp;on &lt;strong&gt;our social channels&lt;br&gt;&lt;br&gt;&lt;/strong&gt;&lt;/div&gt;\n&lt;div&gt;&lt;a href=&quot;https://twitter.com/nethermindeth&quot; target=&quot;_blank&quot;&gt;&lt;img src=&quot;https://cdn4.iconfinder.com/data/icons/social-media-icons-the-circle-set/48/twitter_circle-512.png&quot; alt=&quot;&quot; width=&quot;50&quot; height=&quot;50&quot;&gt;&lt;/a&gt; &amp;nbsp; &lt;a href=&quot;https://discord.com/invite/PaCMRFdvWT&quot; target=&quot;_blank&quot;&gt;&lt;img src=&quot;https://cdn3.iconfinder.com/data/icons/popular-services-brands-vol-2/512/discord-1024.png&quot; alt=&quot;&quot; width=&quot;49&quot; height=&quot;49&quot;&gt;&lt;/a&gt; &amp;nbsp; &lt;a href=&quot;https://www.linkedin.com/company/nethermind/mycompany/&quot; target=&quot;_blank&quot;&gt;&lt;img src=&quot;https://cdn1.iconfinder.com/data/icons/logotypes/32/circle-linkedin-1024.png&quot; alt=&quot;&quot; width=&quot;49&quot; height=&quot;49&quot;&gt;&lt;/a&gt;&lt;/div&gt;\n&lt;div&gt;&amp;nbsp;&lt;/div&gt;\n&lt;div&gt;&lt;strong&gt;&lt;a href=&quot;https://www.nethermind.io/legal&quot; target=&quot;_blank&quot;&gt;&lt;em&gt;Click here to view our Privacy Policy.&lt;/em&gt;&lt;/a&gt;&lt;/strong&gt;&lt;/div&gt;&lt;/div&gt;","tags":"[\"finance\",\"engineering\",\"legal\"]","pubDate":"2025-02-18T03:13:15.000Z","link":"https://job-boards.eu.greenhouse.io/nethermind/jobs/4536953101","slug":"product-manager-nethermind-8019"},{"id":9435126130,"title":"Legal Counsel","company":"Circle","image":"https://media.licdn.com/dms/image/v2/D4E0BAQGsuyBYT8Wy1A/company-logo_200_200/company-logo_200_200/0/1709246393415/circleco_logo?e=1746662400&v=beta&t=KH2t1NJ7bcXknchnvYTCh2X0_q0BdXf-vERJqIz2p1k","description":"&lt;div class=&quot;content-intro&quot;&gt;&lt;h2&gt;About Us&lt;/h2&gt;\n&lt;p&gt;Circle is building the world’s leading all-in-one platform for online communities. We make it possible for creators, coaches, educators, and businesses to bring together their audience with engaging discussions, live streams, events, chat, courses, and payments — all in one place, all under their own brand.&lt;/p&gt;\n&lt;p&gt;We’re proud to be a fully remote company of around 170 (and growing!) team members from 30+ countries around the world. We seek exceptional individuals around the world, set them up to do the best work of their lives, and in turn, create a meaningful impact in their own lives. We don&#39;t track hours, but we do manage for high expectations very closely. We collaborate across time zones, are highly async, and like to document a lot.&lt;/p&gt;\n&lt;p&gt;Twice a year, we bring the whole company together in beautiful places around the world for our company offsites. So far, we’ve hosted offsites in Turkey, Portugal, Mexico, Thailand, Colombia, Italy, Ireland, and more, with still more to come!&lt;/p&gt;&lt;/div&gt;&lt;h2&gt;About the role&lt;/h2&gt;\n&lt;p&gt;We are looking for an experienced and dynamic Legal Counsel who excels in a fast-paced environment and can provide practical and solution-based guidance to help drive business outcomes. As the first hire, you will hold a broad range of responsibilities providing legal guidance on product development and new programs and managing compliance initiatives. The ideal candidate will have some experience in product counseling, regulatory compliance, or privacy law, but also be eager to learn and master new areas of the law.&lt;/p&gt;\n&lt;p&gt;This role is a rare opportunity. Circle is an incredibly fast-growing PLG company with an expanding international market, an expanding suite of products and a world-class culture. The person that takes on this role, will be integral to Circle&#39;s success.&lt;/p&gt;\n&lt;p&gt;&lt;/p&gt;\n&lt;h2&gt;What you&#39;ll be doing&lt;/h2&gt;\n&lt;ul&gt;\n&lt;li&gt;Draft, review, and maintain foundational documents for our products and services such as terms of use, product and support policies, and customer contracts and disclosures.&lt;/li&gt;\n&lt;li&gt;Act as a key point of contact to the Sales, Customer Success, and Customer Support teams for questions arising during the RFP stage, contract negotiation and renewals, customer onboarding or other changes in the product releases and GTM function that may have implications for the way we interact with our customers.&lt;/li&gt;\n&lt;li&gt;Support Circle’s privacy program compliance, including maintaining GDPR compliance, and improve the effectiveness of critical privacy compliance processes.&lt;/li&gt;\n&lt;li&gt;Collaborate closely with Circle’s HR and engineering team to help the company achieve and maintain SOC2 Type II compliance.&lt;/li&gt;\n&lt;li&gt;Stay up to date on relevant regulations, standards, and best practices, and help adapt Circle’s governance, risk, and compliance (GRC) program accordingly.&lt;/li&gt;\n&lt;li&gt;Build scalable and effective legal processes and resources, including delivering training, developing guides/playbooks, and creating new templates.&lt;/li&gt;\n&lt;li&gt;Help Circle take on new challenges and business initiatives in a thoughtful, compliant, and efficient way.&lt;/li&gt;\n&lt;/ul&gt;\n&lt;h2&gt;What you&#39;ll need to be successful&lt;/h2&gt;\n&lt;ul&gt;\n&lt;li&gt;At least 4-6 years of relevant legal experience, including time spent in-house at startup or growth-stage company, ideally in the tech/SaaS space.&lt;/li&gt;\n&lt;li&gt;Strong work ethic and team-player mindset, with a willingness to do the job that needs to be done at any given time and adapt as business priorities change and new challenges emerge.&lt;/li&gt;\n&lt;li&gt;Proven ability to thrive in a fast-paced environment with a high level of autonomy and accountability.&lt;/li&gt;\n&lt;li&gt;Exceptional communication skills (both written and oral) and the ability to explain complex ideas in a succinct and digestible manner.&lt;/li&gt;\n&lt;li&gt;JD from an accredited law school and admission to the bar in the relevant jurisdiction.&lt;/li&gt;\n&lt;li&gt;Strong alignment with our values. &lt;a href=&quot;https://www.notion.so/Circle-Careers-223a15ea312c4922b793593d07add7fe?pvs=21&quot;&gt;Find our values on our career page&lt;/a&gt; if you haven’t read up on them yet.&lt;/li&gt;\n&lt;li&gt;You are proficient in English (spoken, written, and reading) at a &lt;a href=&quot;https://magoosh.com/english-speaking/english-proficiency-levels-a-guide-to-determining-your-level/&quot;&gt;CEFR Level C2&lt;/a&gt; / &lt;a href=&quot;https://www.govtilr.org/&quot;&gt;ILR Level 5&lt;/a&gt;.&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;&lt;/p&gt;\n&lt;h2&gt;Bonus points&lt;/h2&gt;\n&lt;ul&gt;\n&lt;li&gt;You have extensive knowledge of GRC best practices for SaaS organizations.&lt;/li&gt;\n&lt;li&gt;You’ve helped a SaaS product achieve compliance with one or more security standards before (i.e. SOC 2 or ISO 27001).&lt;/li&gt;\n&lt;/ul&gt;\n&lt;h2&gt;$170,000 - $200,000 USD per year&lt;/h2&gt;\n&lt;p&gt;&lt;em&gt;The cash compensation range shown is a starting point. In addition to equity, benefits and perks, your cash compensation is subject to an annual review and increase on a once per year basis.&lt;/em&gt;&lt;/p&gt;\n&lt;p&gt;&amp;nbsp;&lt;/p&gt;&lt;div class=&quot;content-conclusion&quot;&gt;&lt;h2&gt;The fun stuff&lt;/h2&gt;\n&lt;ul&gt;\n&lt;li&gt;Fully remote:&amp;nbsp;work from anywhere in the world!&lt;/li&gt;\n&lt;li&gt;Autonomy and trust to do your job:&amp;nbsp;we care about outcomes over everything else.&lt;/li&gt;\n&lt;li&gt;Paid time away:&amp;nbsp;all employees are given 35 days of PTO annually. We also offer a paid sabbatical after 5 years.&lt;/li&gt;\n&lt;li&gt;Generous U.S. benchmarked compensation&amp;nbsp;and startup equity no matter where you are in the world.*&lt;/li&gt;\n&lt;li&gt;Awesome medical coverage&amp;nbsp;with 100% coverage for you and your family, or medical reimbursement options where applicable!*&lt;/li&gt;\n&lt;li&gt;Parental leave&amp;nbsp;for parents expanding their family, or just starting one.&lt;/li&gt;\n&lt;li&gt;Home office stipend&amp;nbsp;to help you get up and running.&lt;/li&gt;\n&lt;li&gt;Learning &amp;amp; development stipend&amp;nbsp;to help you level up your professional skills.&lt;/li&gt;\n&lt;li&gt;Annual bonus potential&amp;nbsp;for roles that don&#39;t already receive variable income or commission.&lt;/li&gt;\n&lt;li&gt;Company retreats:&amp;nbsp;Twice a year, the Circle team gets together for a fully paid company retreat in incredible places around the world! We’ve had past retreats in Colombia, Portugal, and Mexico, with more planned on the horizon.&lt;/li&gt;\n&lt;li&gt;Check out our&amp;nbsp;&lt;a href=&quot;https://careers.circle.so/&quot;&gt;Careers&lt;/a&gt;&amp;nbsp;page for more.&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;&lt;span style=&quot;font-size: 10pt;&quot;&gt;*&lt;em&gt;Your role, location and unique circumstance may affect this.&lt;/em&gt;&lt;/span&gt;&lt;/p&gt;\n&lt;h3&gt;Diversity, Equity &amp;amp; Inclusion&lt;/h3&gt;\n&lt;p&gt;As a fully-remote international company, diversity is baked into our DNA. Here’s how our CEO, Sid Yadav, frames our hiring mission: “let’s find talent in underserved and under-represented corners of the world, set them up to do the best work of their lives, and in turn, change their life.” To achieve this hiring mission, we offer competitive&amp;nbsp;U.S. benchmarked&amp;nbsp;compensation no matter where someone’s located in the world, and we proactively seek candidates who expand representation of backgrounds, cultures and lived experiences in our teams.&lt;/p&gt;\n&lt;h3&gt;Equal Employment Opportunity&lt;/h3&gt;\n&lt;p&gt;Circle is an equal opportunity employer and as such, we do not discriminate on the basis of race, color, religion, sex, sexual orientation, gender identity, national origin, age, disability, or any other characteristic protected by applicable laws.&amp;nbsp;If you require any accommodations during the recruitment process, please let us know and we will work with you to meet your needs.&lt;/p&gt;\n&lt;div class=&quot;&quot;&gt;\n&lt;h3 class=&quot;&quot;&gt;How We Use Candidate Data&lt;/h3&gt;\n&lt;p&gt;At Circle, we are committed to protecting your personal information. As a job applicant, the personal data you provide to us is collected and processed in accordance with the&amp;nbsp;&lt;strong&gt;General Data Protection Regulation (GDPR)&lt;/strong&gt; in the EU and the &lt;strong&gt;California Consumer Privacy Act (CCPA)&lt;/strong&gt;. This notice outlines the types of personal information we collect, the purpose for collecting it, and your rights.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Information We Collect:&lt;/strong&gt; We collect the following categories of personal information from job applicants:&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;Contact information (such as name, email address, phone number)&lt;/li&gt;\n&lt;li&gt;Employment history and qualifications&lt;/li&gt;\n&lt;li&gt;Education history&lt;/li&gt;\n&lt;li&gt;References and any other information you choose to share with us during the application process&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;&lt;strong&gt;Purpose of Collection:&lt;/strong&gt; We collect this information for the following purposes:&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;To assess your qualifications and suitability for the position&lt;/li&gt;\n&lt;li&gt;To communicate with you during the recruitment process&lt;/li&gt;\n&lt;li&gt;To comply with legal and regulatory obligations&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;&lt;strong&gt;Your Rights Under GDPR and CCPA:&lt;/strong&gt; You have the following rights regarding your personal information:&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;The right to request access to the personal information we hold about you.&lt;/li&gt;\n&lt;li&gt;The right to request the deletion of your personal information, subject to certain legal exceptions.&lt;/li&gt;\n&lt;li&gt;The right to opt out of the sale of your personal information (Note: We do not sell personal information).&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;For more information about how we handle your personal data or to exercise your rights, please refer to our full &lt;a href=&quot;https://circle.so/privacy&quot; target=&quot;_blank&quot;&gt;Privacy Policy&lt;/a&gt;.&lt;/p&gt;\n&lt;p&gt;By submitting your application, you acknowledge that you have read and understood this privacy notice.&lt;/p&gt;\n&lt;/div&gt;&lt;/div&gt;","tags":"[\"engineering\",\"legal\",\"aws\"]","pubDate":"2025-02-18T01:58:14.000Z","link":"https://job-boards.greenhouse.io/circleso/jobs/4547815008","slug":"legal-counsel-circle-6513"},{"id":4047048016,"title":"Director of Collections Analytics & Strategy (APAC, Remote)","company":"Empower","image":"https://lever-client-logos.s3.us-west-2.amazonaws.com/2e1a369c-b58f-41ac-8d86-4b0a77695e68-1687915522032.png","description":"<p style=\"min-height:1.5em\"><strong>EMPOWER OVERVIEW</strong></p><p style=\"min-height:1.5em\"><a target=\"_blank\" rel=\"noopener noreferrer nofollow\" href=\"http://empower.me/\">Empower</a> is shaking up an outdated financial system by providing real opportunity for our customers: the opportunity to get the cash they need, to access fair credit, and to change their financial story. Today, we’re helping millions of people find financial security through machine learning models that evaluate creditworthiness using a more inclusive lens and mobile-first products: Cash Advance, Thrive line of credit, and Petal credit cards. Tomorrow? Creating even more financial paths for our customers (and their wallets) to succeed.</p><p style=\"min-height:1.5em\">This year, Empower ranked #65 on Inc. 5000’s Fastest-Growing Private Companies list — our third year in a row cracking the top 100 — and was named by Forbes as one of the 25 Next Billion-Dollar Startups for 2024. Empower was also featured by Forbes on America’s Best Startup Employers list in 2023, and our Thrive line of credit product was named by Fast Company as one of 2022’s Next Big Things in Tech.</p><p style=\"min-height:1.5em\">Empower is backed by Sequoia Capital, Blisce, and Icon Ventures. Ready to grow your impact and accelerate your career? Take a look at our open roles — we can’t wait to meet you.</p><p style=\"min-height:1.5em\"></p><p style=\"min-height:1.5em\"><strong>THE EMPOWER WAY</strong></p><p style=\"min-height:1.5em\"><strong>Great Expectations</strong>: We come up with bold, audacious goals for ourselves and go all out for impact</p><p style=\"min-height:1.5em\"><strong>Owner Mindset</strong>: We give every employee latitude to act independently, make smart choices, and move the business forward</p><p style=\"min-height:1.5em\"><strong>Spirited Debate</strong>: We love skeptics and seek counter opinions to challenge our personal assumptions and expand our view</p><p style=\"min-height:1.5em\"><strong>Customer Obsession:</strong> We listen to understand, empathize, and create a memorable, rewarding experience for our community</p><p style=\"min-height:1.5em\"><strong>Inclusive Collaboration</strong>: We believe diverse teams make the best decisions, and we strive to give diverse voices a seat at the table</p><p style=\"min-height:1.5em\"><strong>No Jerks Allowed</strong>: We value our relationships and take the time to build trust and connection and communicate respectfully</p><p style=\"min-height:1.5em\"></p><p style=\"min-height:1.5em\"><strong>WHAT EMPOWER OFFERS</strong></p><p style=\"min-height:1.5em\">Competitive salary</p><p style=\"min-height:1.5em\">Generous equity package</p><p style=\"min-height:1.5em\">Full healthcare benefits</p><p style=\"min-height:1.5em\">Technology expense reimbursement</p><p style=\"min-height:1.5em\">Virtual first environment</p><p style=\"min-height:1.5em\"><strong>JOB DESCRIPTION</strong></p><p style=\"min-height:1.5em\">Cashalo, an Empower company and leading fintech in the Philippines, is seeking a Director of Collections Strategy &amp; Analytics to build a world-class collections function. This is a rare opportunity to take full ownership of collections strategy, risk segmentation, outreach channels, and analytics in a fast-growing, high- impact environment. If you’re looking for a foundational role where you can have massive impact scaling operations that expand financial inclusion, and a wide scope within a high performing team, this is the role for you.</p><p style=\"min-height:1.5em\">The ideal candidate is a strategic thinker with deep expertise in collections, risk, and analytics. They will have the opportunity to shape the vision, design best-in-class collections strategies, and eventually lead a high-performing team. This individual should be excited about getting in the weeds and hands-on leading analyses. They will drive experimentation, optimize collections performance, and implement data-driven decision-making across all aspects of the function.</p><p style=\"min-height:1.5em\">This is a remote role with a preference for individuals in an Asia Pacific time zone (GMT +5-11). Occasional travel will be required for company onsites and market visits (minimum 4-6 times per year).</p><p style=\"min-height:1.5em\"><strong>RESPONSIBILITIES</strong></p><ul style=\"min-height:1.5em\"><li><p style=\"min-height:1.5em\">Test and iterate rapidly on different collections strategies, testing new outreach techniques, incentives, and risk-based approaches.</p></li><li><p style=\"min-height:1.5em\">Design and implement predictive collections scoring and automation, leveraging segmentation, data analytics, machine learning, and vendors to optimize recovery rates.</p></li><li><p style=\"min-height:1.5em\">Develop and scale collections outreach models—across digital, automated, and agent-led channels—to maximize efficiency and performance.</p></li><li><p style=\"min-height:1.5em\">Build and lead a high-performing collections strategy and analytics team, ensuring best-in-class execution and continuous improvement.</p></li><li><p style=\"min-height:1.5em\">Work cross-functionally with Credit, Data Science, Product, Growth, and Operations teams to refine collections strategy, enhance underwriting insights, and drive innovation.</p></li><li><p style=\"min-height:1.5em\">Own key collections KPIs, including delinquency rates, recovery efficiency, and overall portfolio performance, ensuring financial targets are met.</p></li><li><p style=\"min-height:1.5em\">Ensure compliance with all relevant regulatory requirements in the Philippines and future Southeast Asian markets.</p></li></ul><p style=\"min-height:1.5em\"><strong>QUALIFICATIONS</strong></p><ul style=\"min-height:1.5em\"><li><p style=\"min-height:1.5em\">8+ years of experience in collections strategy, risk analytics, and credit risk management in financial services, preferably in consumer lending fintech.</p></li><li><p style=\"min-height:1.5em\">Proven expertise in data-driven collections strategies, risk segmentation, and model-driven outreach optimization. Deep familiarity with AI-driven collections scoring, automation, and optimization techniques is highly preferred.</p></li><li><p style=\"min-height:1.5em\">Strong technical skills—proficiency in SQL, Python, and analytics platforms.</p></li><li><p style=\"min-height:1.5em\">Happy to be hands-on and in the weeds driving analysis themselves.</p></li><li><p style=\"min-height:1.5em\">Experience leading cross-functional teams and managing complex initiatives in high-growth, fast-scaling environments.</p></li><li><p style=\"min-height:1.5em\">Strategic thinker with a strong execution mindset—able to translate high-level business objectives into clear, data-backed action plans. </p></li><li><p style=\"min-height:1.5em\">Excellent verbal and written communication skills, ability to communicate to an executive audience.</p></li><li><p style=\"min-height:1.5em\">Experience working with regulatory frameworks and compliance requirements in lending/collections is a plus.</p></li><li><p style=\"min-height:1.5em\">Located in an Asia-Pacific time zone to facilitate collaboration across regions.</p></li></ul><p style=\"min-height:1.5em\">At Empower, we hire for people that push themselves to understand others and seek out ways to challenge their personal assumptions. Our hope is that by fostering such an environment, we strengthen our business and relationships by putting people first. We are committed to building a diverse, inclusive, and equitable workspace where everyone (regardless of age, education, ethnicity, gender, sexual orientation, or any personal characteristics) feels like they belong. Even if your experience doesn’t exactly match up to our job description, you should feel empowered to apply regardless!</p>","tags":"[\"management\"]","pubDate":"2025-02-18T00:45:16.665Z","link":"https://jobs.ashbyhq.com/empower%20finance/6b63d3cb-8360-4cb4-b1f3-8e967736f3be","slug":"director-of-collections-analytics-strategy-apac-remote-empower-148"},{"id":1332870566,"title":"SR Engenharia de Software (Java e React.js) ","company":"ília","image":"https://avatars.githubusercontent.com/u/35933823?s=200&v=4","description":"&lt;p&gt;Aqui na ília nossas vagas estão sempre abertas para todas as pessoas e não se restringem quanto a gênero, etnia, orientação sexual, fatores sociais, condições físicas ou intelectuais (PCD) etc. Incentivamos a candidatura de integrantes de todos os grupos minoritários!&lt;/p&gt;\n&lt;h3&gt;&lt;strong&gt;Sobre a ília&lt;/strong&gt;&lt;/h3&gt;\n&lt;p&gt;Somos especialistas em tecnologia, dados e design, impulsionando a transformação digital de grandes players do mercado há mais de 10 anos, nos setores financeiro, seguros e mobilidade. Com mais de 450 profissionais, estamos presentes no Brasil e Europa, atendendo aos mercados da América Latina, Europa e América do Norte, desenvolvendo produtos digitais de alta qualidade e com foco em resultados de negócios. Somos uma equipe inovadora, criativa e apaixonada por tecnologia.&amp;nbsp;&lt;/p&gt;\n&lt;p&gt;Certificada pelo 5° ano consecutivo como Great Place to work aqui na ília acreditamos que pessoas mudam o mundo, e investimos nelas. Nossas awesome deliveries são feitas de pessoas para pessoas, afinal awesome people make awesome deliveries!&amp;nbsp;&lt;/p&gt;\n&lt;p&gt;#Vempraília&lt;/p&gt;\n&lt;h3&gt;&lt;strong&gt;Sobre a vaga&lt;/strong&gt;&lt;/h3&gt;\n&lt;ul&gt;\n&lt;li&gt;Desenvolver soluções escaláveis e resilientes;&amp;nbsp;&amp;nbsp;&amp;nbsp;&lt;/li&gt;\n&lt;li&gt;Apresentar melhorias nos sistemas existentes e garantir a qualidade nas entregas;&amp;nbsp;&lt;/li&gt;\n&lt;li&gt;Manter a qualidade do software verificando os processos, ferramentas e boas práticas disponíveis para o produto e tecnologia utilizados;&amp;nbsp;&amp;nbsp;&amp;nbsp;&lt;/li&gt;\n&lt;li&gt;Orientar desenvolvedores de menor senioridade apoiando suas dúvidas, disseminando seu conhecimento,&amp;nbsp;desenhando e arquitetando soluções ou indicando documentação de apoio;&lt;/li&gt;\n&lt;li&gt;Criar testes de alta complexidade, sejam estes manuais ou automatizados, que cubram o comportamento desejado dos componentes técnicos desenvolvidos utilizando os requisitos e ferramentas de testes&lt;/li&gt;\n&lt;/ul&gt;\n&lt;h3&gt;&lt;strong&gt;Requisitos:&lt;/strong&gt;&lt;/h3&gt;\n&lt;ul&gt;\n&lt;li&gt;Experiência em linguagens de programação Java.&lt;/li&gt;\n&lt;li&gt;Experiência em ReactNative e/ou ReactJS&amp;nbsp;&lt;/li&gt;\n&lt;li&gt;Conhecimento sólido em boas práticas de desenvolvimento;&lt;/li&gt;\n&lt;li&gt;Conhecimento sólido em Testes unitários e integrados;&amp;nbsp;&lt;/li&gt;\n&lt;li&gt;Design de APIs REST;&lt;/li&gt;\n&lt;li&gt;Compreensão e entendimento de arquitetura de microsserviços;&lt;/li&gt;\n&lt;li&gt;Experiência em metodologias ágeis.&lt;/li&gt;\n&lt;li&gt;Conhecimentos em bancos de dados (SQL e NoSQL&lt;/li&gt;\n&lt;/ul&gt;\n&lt;h3&gt;&lt;strong&gt;Benefícios e Incentivos:&lt;/strong&gt;&lt;/h3&gt;\n&lt;p&gt;Nossa contratação é CLT- 40h semanais com jornada flexível, sendo executada 100% de forma remota. Os benefícios da ília são pensados para proporcionar uma experiência AWESOME para cada ílian, abaixo você encontra os benefícios de forma resumida. #vempraília&lt;/p&gt;\n&lt;p&gt;Para Saúde e bem-estar:&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;Plano de Saúde e Odontológico SulAmérica extensivo a dependentes;&lt;/li&gt;\n&lt;li&gt;Vale Alimentação/Refeição em cartão fléxivel Picpay benefícios&amp;nbsp;&lt;/li&gt;\n&lt;li&gt;Seguro de Vida;&lt;/li&gt;\n&lt;li&gt;Auxílio Home-Office em cartão fléxivel Picpay benefícios;&lt;/li&gt;\n&lt;li&gt;Wellhub (Gympass)&lt;/li&gt;\n&lt;li&gt;TotalPass&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;Para o seu Desenvolvimento:&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;ília University: Universidade Corporativa com mais de 20 mil cursos disponíveis para desenvolvimento pessoal e profissional;&lt;/li&gt;\n&lt;li&gt;Language Academy: Escola de idiomas para ílians;&lt;/li&gt;\n&lt;li&gt;í-talks e Chapter: Momentos e cerimônias em que o time compartilha práticas, estudos, projetos e ideias. Nas chapters ainda se reúnem pessoas com skills similares para compartilhamento de ideias, práticas e experiências;&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;Gostamos de ir além no cuidado com as nossas pessoas, então dispomos também de alguns benefícios não convencionais:&amp;nbsp;&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;Plano de Saúde PET- Guapeco&amp;nbsp;&lt;/li&gt;\n&lt;li&gt;BYOD- Alugamos o seu notebook pessoal te pagando um valor mensal para que você o use, mas disponibilizamos também máquinas de trabalho para ílians. Você quem decide!&lt;/li&gt;\n&lt;li&gt;Seu Niver, seu bolo!&lt;/li&gt;\n&lt;li&gt;Seu Networking Vale Prêmio- Programa de premiação a indicação de novos funcionários.&lt;/li&gt;\n&lt;/ul&gt;","tags":"[\"finance\"]","pubDate":"2025-02-17T21:34:55.000Z","link":"https://boards.greenhouse.io/ilia/jobs/5452514004","slug":"sr-engenharia-de-software-java-e-react-js-lia-1887"},{"id":2111883952,"title":"PL Desenvolvimento Mobile (React Native)","company":"ília","image":"https://avatars.githubusercontent.com/u/35933823?s=200&v=4","description":"&lt;p&gt;Aqui na ília nossas vagas estão sempre abertas para todas as pessoas e não se restringem quanto a gênero, etnia, orientação sexual, fatores sociais, condições físicas ou intelectuais (PCD) etc. Incentivamos a candidatura de integrantes de todos os grupos minoritários!&lt;/p&gt;\n&lt;h3&gt;&lt;strong&gt;Sobre a ília&lt;/strong&gt;&lt;/h3&gt;\n&lt;p&gt;Somos especialistas em tecnologia, dados e design, impulsionando a transformação digital de grandes players do mercado há mais de 10 anos, nos setores financeiro, seguros e mobilidade. Com mais de 450 profissionais, estamos presentes no Brasil e Europa, atendendo aos mercados da América Latina, Europa e América do Norte, desenvolvendo produtos digitais de alta qualidade e com foco em resultados de negócios. Somos uma equipe inovadora, criativa e apaixonada por tecnologia.&amp;nbsp;&lt;br&gt;Certificada pelo 5° ano consecutivo como Great Place to work aqui na ília acreditamos que pessoas mudam o mundo, e investimos nelas. Nossas awesome deliveries são feitas de pessoas para pessoas, afinal awesome people make awesome deliveries!&lt;/p&gt;\n&lt;p&gt;#Vempraília&lt;/p&gt;\n&lt;h3&gt;&lt;strong&gt;Sobre a vaga&lt;/strong&gt;&lt;/h3&gt;\n&lt;ul&gt;\n&lt;li&gt;Desenvolver e manter aplicativos mobile utilizando React Native;&amp;nbsp;&lt;/li&gt;\n&lt;li&gt;Implementar interfaces de usuário complexas e integrar com APIs RESTful;&lt;/li&gt;\n&lt;li&gt;Atualizações de versão de bibliotecas Nativas e Híbridas;&lt;/li&gt;\n&lt;li&gt;Escrever código limpo, eficiente e testável, seguindo as melhores práticas de desenvolvimento;&lt;/li&gt;\n&lt;li&gt;Colaborar com a equipe de design para garantir a melhor experiência para o usuário;&lt;/li&gt;\n&lt;li&gt;Realizar testes unitários e de integração para garantir a qualidade do código;&lt;/li&gt;\n&lt;li&gt;Participar ativamente de todo o ciclo de vida do desenvolvimento de software;&amp;nbsp;&lt;/li&gt;\n&lt;li&gt;Manter-se atualizado com as novas tecnologias e tendências em desenvolvimento mobile;&lt;/li&gt;\n&lt;/ul&gt;\n&lt;h3&gt;&lt;strong&gt;Requisitos: &lt;/strong&gt;&lt;/h3&gt;\n&lt;ul&gt;\n&lt;li&gt;Experiência sólida em desenvolvimento mobile com React Native;&lt;/li&gt;\n&lt;li&gt;Domínio de JavaScript, TypeScript;&lt;/li&gt;\n&lt;li&gt;Familiaridade com APIs RESTful e integrações com back-end;&lt;/li&gt;\n&lt;li&gt;Conhecimento de ferramentas de versionamento de código (Git);&lt;/li&gt;\n&lt;li&gt;Experiência com testes unitários e de integração;&lt;/li&gt;\n&lt;li&gt;Boas práticas de desenvolvimento de software (SOLID, Clean Code);&lt;/li&gt;\n&lt;li&gt;Conhecimento em Node.js; &amp;nbsp;&lt;/li&gt;\n&lt;/ul&gt;\n&lt;h3&gt;&lt;strong&gt;Diferenciais: &lt;/strong&gt;&lt;/h3&gt;\n&lt;ul&gt;\n&lt;li&gt;Experiência com desenvolvimento nativo Android (Java/Kotlin) ou iOS (Swift/Objective-C);&lt;/li&gt;\n&lt;li&gt;Conhecimento de frameworks de testes como Jest;&lt;/li&gt;\n&lt;li&gt;Familiaridade com ferramentas de CI/CD;&amp;nbsp;&lt;/li&gt;\n&lt;/ul&gt;\n&lt;h3&gt;&lt;strong&gt;Benefícios e Incentivos:&lt;/strong&gt;&lt;/h3&gt;\n&lt;p&gt;Nossa contratação é CLT- 40h semanais com jornada flexível, sendo executada 100% de forma remota. Os benefícios da ília são pensados para proporcionar uma experiência AWESOME para cada ílian, abaixo você encontra os benefícios de forma resumida. #vempraília&lt;/p&gt;\n&lt;p&gt;Para Saúde e bem-estar:&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;Plano de Saúde e Odontológico SulAmérica extensivo a dependentes;&lt;/li&gt;\n&lt;li&gt;Vale Alimentação/Refeição em cartão fléxivel Picpay benefícios&amp;nbsp;&lt;/li&gt;\n&lt;li&gt;Seguro de Vida;&lt;/li&gt;\n&lt;li&gt;Auxílio Home-Office em cartão fléxivel Picpay benefícios;&lt;/li&gt;\n&lt;li&gt;Wellhub (Gympass)&lt;/li&gt;\n&lt;li&gt;TotalPass&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;Para o seu Desenvolvimento:&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;ília University: Universidade Corporativa com mais de 20 mil cursos disponíveis para desenvolvimento pessoal e profissional;&lt;/li&gt;\n&lt;li&gt;Language Academy: Escola de idiomas para ílians;&lt;/li&gt;\n&lt;li&gt;í-talks e Chapter: Momentos e cerimônias em que o time compartilha práticas, estudos, projetos e ideias. Nas chapters ainda se reúnem pessoas com skills similares para compartilhamento de ideias, práticas e experiências;&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;Gostamos de ir além no cuidado com as nossas pessoas, então dispomos também de alguns benefícios não convencionais:&amp;nbsp;&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;Plano de Saúde PET- Guapeco&amp;nbsp;&lt;/li&gt;\n&lt;li&gt;BYOD- Alugamos o seu notebook pessoal te pagando um valor mensal para que você o use, mas disponibilizamos também máquinas de trabalho para ílians. Você quem decide!&lt;/li&gt;\n&lt;li&gt;Seu Niver, seu bolo!&lt;/li&gt;\n&lt;li&gt;Seu Networking Vale Prêmio- Programa de premiação a indicação de novos funcionários.&lt;/li&gt;\n&lt;/ul&gt;","tags":"[\"javascript\",\"typescript\",\"finance\"]","pubDate":"2025-02-17T19:39:39.000Z","link":"https://boards.greenhouse.io/ilia/jobs/5452178004","slug":"pl-desenvolvimento-mobile-react-native-lia-7974"},{"id":1533462425,"title":"Customer Success & Operations Manager (EdTech)","company":"Didask","image":"https://avatars.githubusercontent.com/u/14350668?s=200&v=4","description":"<p style=\"min-height:1.5em\"><em>🇫🇷 La langue de travail à Didask est l'anglais et sa maîtrise est requise pour nous rejoindre. Néanmoins, nous publions l'intégralité de nos offres d'emploi en français et en anglais. Vous pouvez retrouver toutes nos offres d'emploi sur </em><a target=\"_blank\" rel=\"noopener noreferrer nofollow\" href=\"https://jobs.ashbyhq.com/didask\"><em>cette page</em></a><em>, ainsi que plus d'informations sur Didask, notre culture et nos avantages.</em></p><p style=\"min-height:1.5em\"></p><p style=\"min-height:1.5em\"><em>🇬🇧🇺🇸 While English is our working language at Didask and proficiency is required to join us, we publish all our job openings in both English and French. You can find all our positions on </em><a target=\"_blank\" rel=\"noopener noreferrer nofollow\" href=\"https://jobs.ashbyhq.com/didask\"><em>this page</em></a><em>, along with more information about Didask, our culture and benefits.</em></p><p style=\"min-height:1.5em\">We strongly encourage applications from candidates of all backgrounds, including those who may not have deep technical expertise but are eager to learn and bring strong problem-solving, customer engagement, and organizational skills. If you are excited about this role but don’t meet 100% of the criteria, we encourage you to apply! </p><p style=\"min-height:1.5em\"></p><h2><strong>About the Role</strong></h2><p style=\"min-height:1.5em\">As part of the development of our <strong>Customer Success team</strong>, we are looking for an experienced <strong>Customer Success &amp; Operations Manager</strong> to help <strong>structure, optimize, and streamline</strong> our customer engagement processes for <strong>SMB clients</strong> (~1M d’ARR). This role is key in ensuring operational excellence, enhancing customer experience at scale, and contributing to our overall retention strategy.</p><p style=\"min-height:1.5em\">This position <strong>blends problem-solving, process improvement, and customer engagement.</strong> You will design and implement scalable solutions while staying customer-centric, ensuring SMB clients successfully leverage Didask’s platform.</p><p style=\"min-height:1.5em\"></p><h2><strong>Why Join Us?</strong></h2><ul style=\"min-height:1.5em\"><li><p style=\"min-height:1.5em\">🥰 <strong>Engage with 100s of professionals</strong> passionate about training and knowledge-sharing, supporting diverse organizations (L&amp;D teams, training providers, consultants, startups, associations).</p></li><li><p style=\"min-height:1.5em\">🚀 <strong>Shape our Customer Success strategy</strong> at a pivotal moment in our growth, contributing directly to Didask’s expansion.</p></li><li><p style=\"min-height:1.5em\">🏡 <strong>Be at the heart of the company</strong>—working cross-functionally with <strong>Customer Success, Care, Product, Sales,</strong> while staying in close touch with customers.</p></li></ul><p style=\"min-height:1.5em\"></p><h2><strong>Our Customer Success Team</strong></h2><p style=\"min-height:1.5em\">Our team is structured into two key areas:</p><ul style=\"min-height:1.5em\"><li><p style=\"min-height:1.5em\"><strong>Customer Success Management (CSM) :</strong> which this role is part of (4 people)</p></li><li><p style=\"min-height:1.5em\"><strong>Care :</strong> which consists of 3 dedicated team members.</p></li></ul><p style=\"min-height:1.5em\"></p><h2><strong>Your Key Responsibilities</strong></h2><h3><strong>1. Customer Success Strategy &amp; Process Optimization</strong></h3><ul style=\"min-height:1.5em\"><li><p style=\"min-height:1.5em\"><strong>Develop and refine scalable customer engagement strategies</strong> to improve retention and satisfaction.</p></li><li><p style=\"min-height:1.5em\"><strong>Own and implement smart process improvements</strong> using <strong>Skalin, Intercom</strong>, and other relevant tools to enhance efficiency.</p></li><li><p style=\"min-height:1.5em\">Monitor and <strong>track key customer engagement indicators on Skalin and Hubspot</strong> (Product Usage, Health Score, CSAT, NPS) and create reports and ensure good communication with Revenue team</p></li><li><p style=\"min-height:1.5em\">Work with the <strong>CSMs, Care and Product teams</strong> to develop a <strong>100% digital support experience</strong> for SMB clients.</p></li><li><p style=\"min-height:1.5em\">Create <strong>structured playbooks and workflows</strong> that make it easier for customers to succeed independently.</p></li></ul><h3><strong>2. Customer Engagement &amp; Success</strong></h3><ul style=\"min-height:1.5em\"><li><p style=\"min-height:1.5em\">Manage a <strong>portfolio of SMB clients</strong> and drive customer retention through proactive engagement.</p></li><li><p style=\"min-height:1.5em\">Provide <strong>strategic guidance</strong> to clients on how to effectively use Didask to build impactful e-learning programs.</p></li><li><p style=\"min-height:1.5em\">Regularly analyze <strong>customer engagement data</strong> (ROI, completion rates, satisfaction scores) and identify opportunities for improvement.</p></li><li><p style=\"min-height:1.5em\">Create engaging <strong>written content</strong> (newsletter, emailing)</p></li><li><p style=\"min-height:1.5em\">Share <strong>customer success stories</strong> internally with <strong>Marketing</strong> (case studies, webinars, testimonials) to reinforce our brand and product value.</p></li></ul><h3><strong>3. Process &amp; Collaboration Enhancements</strong></h3><ul style=\"min-height:1.5em\"><li><p style=\"min-height:1.5em\">Identify and <strong>standardize recurring actions</strong> within the Customer Success team and Care team to drive efficiency.</p></li><li><p style=\"min-height:1.5em\">Serve as the <strong>owner of</strong> Skalin (CSP platform), ensuring continuous content improvement.</p></li><li><p style=\"min-height:1.5em\">Work closely with the <strong>Data team</strong> to generate insights and create meaningful reports that guide decision-making.</p></li><li><p style=\"min-height:1.5em\">Collect and share <strong>customer feedback</strong> to support <strong>product roadmap decisions</strong>.</p></li></ul><h3><strong>Tools We Use:</strong></h3><ul style=\"min-height:1.5em\"><li><p style=\"min-height:1.5em\"><strong>CSM Tools:</strong> Skalin, Intercom, Hubspot, Metabase</p></li><li><p style=\"min-height:1.5em\"><strong>Company Communication Tools:</strong> Slack, Notion</p></li></ul><p style=\"min-height:1.5em\"></p><h2><strong>Your Profile</strong></h2><h3><strong>Must-Have Skills &amp; Experience:</strong></h3><p style=\"min-height:1.5em\">✔️ <strong>3+ years of experience in Customer Success, Process Optimization, or Marketing/Growth roles</strong> in a SaaS or e-learning environment.</p><p style=\"min-height:1.5em\">✔️ Has already demonstrated the ability to <strong>manage the onboarding process for a large volume of clients</strong> (between 100 and 300 clients).</p><p style=\"min-height:1.5em\">✔️ Interest in <strong>understanding customer behaviors and identifying patterns</strong> to enhance their experience.</p><p style=\"min-height:1.5em\">✔️ Experience in <strong>streamlining processes and making work easier</strong> through smart tools and automation.</p><p style=\"min-height:1.5em\">✔️ <strong>Autonomous and proactive</strong>, with a strong sense of initiative and a love for teamwork and challenges.</p><p style=\"min-height:1.5em\">✔️ Excellent <strong>communication and relationship-building</strong> skills.</p><p style=\"min-height:1.5em\">✔️ <strong>Ability to manage multiple projects simultaneously</strong> and prioritize effectively.</p><p style=\"min-height:1.5em\">✔️ A strong <strong>problem-solving mindset</strong>, eager to improve workflows and create impactful solutions.</p><p style=\"min-height:1.5em\">✔️ <strong>Fluent in French, proficient in English.</strong></p><p style=\"min-height:1.5em\">✔️ <strong>Interest in technology, SaaS B2B, and AI</strong>, and ability to quickly learn and adapt to a fast-evolving tech environment.</p><p style=\"min-height:1.5em\"></p><h3><strong>Nice-to-Have:</strong></h3><p style=\"min-height:1.5em\">➕ <strong>Basic SQL knowledge</strong> to support data-informed decision-making.</p><p style=\"min-height:1.5em\">➕ Familiarity with <strong>customer journey mapping and engagement strategies</strong>.</p><p style=\"min-height:1.5em\">➕ Previous experience <strong>leading customer training or educational workshops</strong>.</p><p style=\"min-height:1.5em\"></p><h2><strong>Package and Benefits</strong></h2><h3><strong>Compensation:</strong></h3><ul style=\"min-height:1.5em\"><li><p style=\"min-height:1.5em\"><strong>Contract type:</strong> Permanent (CDI)</p></li><li><p style=\"min-height:1.5em\"><strong>Estimated Base Salary:</strong> depending on your experience €44k-55k</p></li><li><p style=\"min-height:1.5em\"><strong>BSPCE</strong> (stock options)</p></li><li><p style=\"min-height:1.5em\"><strong>100% health insurance coverage </strong>(for employees &amp; children)</p></li><li><p style=\"min-height:1.5em\"><strong>Meal card (Swile):</strong> €11.96 per day</p></li><li><p style=\"min-height:1.5em\"><strong>Transportation pass:</strong> 50% covered</p></li><li><p style=\"min-height:1.5em\"><strong>Remote work allowance</strong> for optimal working conditions</p></li><li><p style=\"min-height:1.5em\"><strong>Culture &amp; Lifestyle Benefits</strong> : Access <strong>corporate discounts</strong> on various stores and entertainment, along with an <strong>annual stipend</strong> for cultural activities and purchases.</p></li></ul><p style=\"min-height:1.5em\"></p><h3><strong>Work Organization:</strong></h3><ul style=\"min-height:1.5em\"><li><p style=\"min-height:1.5em\"><strong>Office location:</strong> Paris / Bagnolet, an 8-minute walk from Gallieni station (Metro line 3)</p></li><li><p style=\"min-height:1.5em\"><strong>Remote work:</strong> full remote possible (tax residence in France)</p></li><li><p style=\"min-height:1.5em\"><strong>Monthly meeting</strong> at Maison Didask (Paris)</p></li><li><p style=\"min-height:1.5em\"><strong>Annual seminar </strong>in attractive locations</p></li></ul><p style=\"min-height:1.5em\"></p><h2><strong>Recruitment Process</strong></h2><ol style=\"min-height:1.5em\"><li><p style=\"min-height:1.5em\">A video call to get to know each other</p></li><li><p style=\"min-height:1.5em\">A business case to understand your approach to client interactions</p></li><li><p style=\"min-height:1.5em\">A second interview to discuss your business case and administrative details</p></li><li><p style=\"min-height:1.5em\">Job offer</p><p style=\"min-height:1.5em\"></p></li></ol><p style=\"min-height:1.5em\"><strong>Availability:</strong> As soon as possible</p><p style=\"min-height:1.5em\"><em>🇫🇷 Sauf mention contraire, toutes nos offres sont accessibles en télétravail complet à condition de travailler dans un fuseau horaire proche de celui de Paris et de disposer des bonnes conditions de travail (notamment connexion Internet). Attention, nous ne pouvons à l'heure actuelle embaucher que des résidents fiscaux français.</em></p><p style=\"min-height:1.5em\"><em>🇬🇧🇺🇸 Unless specified otherwise, all positions are fully remote, provided you work in a timezone close to Paris and have suitable working conditions (including Internet connection). Please note that we can currently only hire French tax residents.</em></p>","tags":"[\"management\",\"b2b\"]","pubDate":"2025-02-17T15:26:57.486Z","link":"https://jobs.ashbyhq.com/didask/1f77d7d0-9880-4a31-bf69-e8c1aeccbdcd","slug":"customer-success-operations-manager-edtech-didask-7469"},{"id":2340184776,"title":"Content Writer","company":"omniscient","image":"https://remotive.com/job/1972738/logo","description":"<p style=\"min-height:1.5em\"><strong>About Omniscient Digital</strong></p><p style=\"min-height:1.5em\">Omniscient Digital is an organic growth agency helping B2B software companies turn SEO and content into growth channels. We’ve helped build content and SEO programs for companies like Jasper, Adobe, Loom, <a href=\"http://Order.co\" rel=\"nofollow\" target=\"_blank\">Order.co</a>, Vendr, Hotjar, and more.</p><p style=\"min-height:1.5em\">Our work has been featured on websites like HubSpot, Shopify, Intercom, and CXL, and our strategies are used by many of the top content marketing teams around the world.</p><p style=\"min-height:1.5em\">Our team is 100% remote. Learn about the<a href=\"https://beomniscient.com/principles/\" rel=\"nofollow\" target=\"_blank\"> <u>core values</u></a> that drive how we work and build a company.</p><p style=\"min-height:1.5em\"><strong>About this role<br></strong>Omniscient Digital is growing quickly, and we’re committed to building SEO and content programs that deliver business results. This requires content based on subject matter expertise that speaks to to the pain points and challenges of our clients’ target audiences.  We’re taking on an increasing number of technical clients and are seeking a stellar writer with expertise in technical writing to create exceptional content for these clients. We’re seeking a writer with experience working with or writing on topics related to <strong>data science and analytics</strong>.</p><p style=\"min-height:1.5em\">As a <strong>Content Writer</strong>, you’ll create compelling content that resonates with our target audience of data scientists, analysts, and data leaders. You’ll dive into the technical challenges these professionals face and contribute to positioning the client as a thought leader in the data space. <strong>The ideal candidate has hands-on experience in data science or analytics, coupled with strong writing skills.</strong></p><p style=\"min-height:1.5em\"><em>*Please note that we don’t work with writers who subcontract their work.</em></p><p style=\"min-height:1.5em\"><strong>Responsibilities:</strong></p><ul style=\"\"><li style=\"\"><p style=\"min-height:1.5em\"><strong>Research, write, and edit</strong> high-quality content, including blog posts, case studies, whitepapers, tutorials, and thought leadership pieces.</p></li><li style=\"\"><p style=\"min-height:1.5em\"><strong>Break down complex technical topics</strong> for data professionals while maintaining accuracy and depth.</p></li><li style=\"\"><p style=\"min-height:1.5em\"><strong>Collaborate with the client’s team</strong> to align content with product features, audience needs, and SEO goals.</p></li><li style=\"\"><p style=\"min-height:1.5em\"><strong>Stay updated on trends</strong>, challenges, and tools in the data science and analytics industry.</p></li><li style=\"\"><p style=\"min-height:1.5em\"><strong>Develop content</strong> that speaks to the unique needs and pain points of the client’s target audience.</p></li><li style=\"\"><p style=\"min-height:1.5em\"><strong>Optimize content for SEO</strong>, ensuring high visibility and relevance.</p></li><li style=\"\"><p style=\"min-height:1.5em\"><strong>Ensure projects are completed on time</strong> and meet quality standards.</p></li><li style=\"\"><p style=\"min-height:1.5em\"><strong>Implement complex client documentation, feedback, and changes </strong>whenever possible.</p></li><li style=\"\"><p style=\"min-height:1.5em\"><strong>Use company brand voice and messaging</strong> for written pieces to reinforce the company culture</p></li></ul><p style=\"min-height:1.5em\"><strong>Qualifications:</strong></p><ul style=\"\"><li style=\"\"><p style=\"min-height:1.5em\"><strong>2+ years of professional experience as a data scientist, data analyst, or in a related technical role. </strong>This experience has given you a deep understanding of data workflows, analytics processes, and the challenges faced by professionals working with data. You can draw on this expertise to write content that resonates with a data-savvy audience, reflecting the real-world applications and nuances of data-driven roles.</p></li><li style=\"\"><p style=\"min-height:1.5em\"><strong>Proven track record of writing technical content for a data-savvy audience. </strong>Whether through blogs, white papers, or tutorials, your content reflects an ability to engage readers who understand the technical intricacies of data workflows, tools, and methodologies. Your writing is clear, concise, and informed by your technical expertise.</p></li><li style=\"\"><p style=\"min-height:1.5em\"><strong>Strong understanding of SQL, Python, and modern data workflows. </strong>Your familiarity with these tools allows you to write content that speaks to professionals who use them daily. You can explain technical concepts like database queries, data transformations, and scripting for analysis in a way that is accurate yet approachable for your audience.</p></li><li style=\"\"><p style=\"min-height:1.5em\"><strong>Familiarity with data tools (e.g., dbt, Snowflake, Databricks) and industry trends.</strong> This familiarity enables you to write content that reflects current best practices and emerging technologies in the data ecosystem. You can confidently explore data pipeline optimization, cloud-based data warehousing, and machine learning workflows.</p></li><li style=\"\"><p style=\"min-height:1.5em\"><strong>Ability to translate technical concepts into clear, engaging narratives. </strong>Your ability to bridge the gap between technical depth and reader engagement ensures your content is both informative and easy to understand. Whether addressing a beginner audience or seasoned professionals, your writing effectively conveys technical information in a way that keeps readers engaged and informed.</p></li><li style=\"\"><p style=\"min-height:1.5em\"><strong>Excellent written and verbal communication skills, and healthy analytical and critical thinking skills.</strong> You turn complex concepts into compelling narratives. You’re skilled at finding the story within complicated topics and can capture our client’s brand voice in every piece of writing.</p></li><li style=\"\"><p style=\"min-height:1.5em\"><strong>SEO experience, content strategy, and digital marketing are a plus.</strong> You know how to search-optimize your content without sacrificing quality, and can balance the needs of both your client and reader within your content. </p></li><li style=\"\"><p style=\"min-height:1.5em\"><strong>Experience interviewing subject matter experts.</strong> You’re comfortable independently conducting SME interviews to add industry opinion and narrative to your content. You know how to draft questions to get the information you need and how to structure stories around the answers.</p></li><li style=\"\"><p style=\"min-height:1.5em\"><strong>Time management and organizational skills. </strong>You always meet your deadlines—or communicate in advance when you may need a deadline pushed back. </p></li></ul><ul style=\"\"><li style=\"\"><p style=\"min-height:1.5em\"><strong>Positive attitude.</strong> You’re kind, passionate, curious, and friendly! You’re open to exploring new ideas, keep updated on trending topics in the infrastructure management software industry, and feel passionately about crafting excellent content. You welcome feedback and love learning how to improve your craft. </p></li></ul><p style=\"min-height:1.5em\"><strong>Portfolio</strong></p><p style=\"min-height:1.5em\">A recent portfolio with relevant writing experience is a must. Please submit 3-5 sample articles that have been published within the past three years for consideration, at least 2 of which relate to data. Older samples will be accepted only if accompanied by newer works. </p><p style=\"min-height:1.5em\"><strong>Our hiring process</strong></p><p style=\"min-height:1.5em\">We read every application and do our best to get back to each applicant within a few weeks of submission. However, response times may vary depending on the time of year, number of applicants, and other factors. </p><p style=\"min-height:1.5em\"><strong>Note: </strong>We’re urgently hiring for this role. If we’re interested in moving forward with your application, we’ll likely reach out sooner via email. </p><p style=\"min-height:1.5em\"><strong>Ready to apply?</strong></p><p style=\"min-height:1.5em\">Keep scrolling to submit your information. We’re excited to meet you! 😎</p><p style=\"min-height:1.5em\"><em>Confidence can sometimes hold us back from applying for a job. But there’s no such thing as a \"perfect\" candidate. Omniscient Digital is a place where everyone can grow. So however you identify and whatever background you bring with you, please apply if the idea of this role excites you.</em></p><img src=\"https://remotive.com/job/track/1972738/blank.gif?source=public_api\" alt=\"\"/>","tags":"[\"data science\",\"seo\",\"technical writing\",\"content strategy\"]","pubDate":"2025-02-17T09:51:28.000Z","link":"https://remotive.com/remote-jobs/writing/content-writer-1972738","slug":"content-writer-omniscient-54"},{"id":9090842586,"title":"Research Engineer Intern (IRE Research)","company":"CloudLinux","image":"https://avatars.githubusercontent.com/u/16290369?s=200&v=4","description":"<p></p><p>We are seeking a Research Engineer to accelerate our work on automating patch backporting. The role focuses on solving complex research tasks in parallel with the current patch adaptation efforts. You will tackle critical challenges such as improving patch discovery and building a patch review service.</p><h3>Responsibilities:</h3><ul> <li>Investigate and resolve issues with patch discovery and upstream patch correctness.</li> <li>Explore methods for evaluating and ranking patch adaptations, contributing to a future code review service.</li> <li>Develop proof-of-concept (PoC) solutions for research problems rather than production-ready services.</li> <li>Collaborate with the team to experiment with various approaches and evaluate their effectiveness.</li> </ul><p><strong>Requirements</strong></p><p></p><h3>Qualifications:</h3><ul> <li>Python coding skills, with experience writing code, tests, and basic data processing.</li> <li>Strong problem-solving skills and ability to generate and test ideas quickly.</li> <li>Comfortable with exploring complex problems independently and over extended periods.</li> <li>Versatile technical background with experience across multiple technologies.</li> <li>Fluent English is a must</li> </ul><h3>Preferred Qualifications:</h3><ul> <li>Familiarity with C, with the ability to read and interpret patch code.</li> <li>Basic understanding of core computer science concepts (HTTP, APIs, networks, compilers).</li> <li>Experience with large language models (LLMs) or AI-related projects.</li> </ul><h3>Who You Are:</h3><ul> <li>A fast learner, capable of quickly adapting to new technologies and challenges.</li> <li>A creative problem solver who thrives on experimentation and iteration.</li> <li>Persistent and motivated, inspired by challenging tasks.</li> <li>A generalist with diverse experience, ready to tackle problems with a wide range of tools and approaches.</li> </ul><p><strong>Benefits</strong></p><p><strong>What's in it for you?</strong></p><ul> <li>A strong focus on professional development with opportunities for learning and growth:</li> <ul> <li>Interesting and challenging projects,</li> <li>Mentor and other knowledge-exchange programs.</li> </ul> <li>Fully remote work with flexible working hours, that allows you to schedule your day and work from any location worldwide.</li> <li>Paid 24 days of vacation per year, 10 days of national holidays, and unlimited sick leaves to ensure you maintain a healthy work-life balance.</li> <li>Compensation for private medical insurance.</li> <li>Co-working and gym/sports reimbursement.</li> <li>The opportunity to receive a reward for the most innovative idea that the company can patent, fostering a culture of creativity and innovation.</li> </ul><p></p><p><em>By applying for this position, you consent to the processing of your personal data as described in our Privacy Policy (</em><a href=\"https://cloudlinux.com/candidate-privacy-notice\" target=\"_blank\" rel=\"nofollow noreferrer noopener\" class=\"external\"><em>https://cloudlinux.com/candidate-privacy-notice</em></a><em>), which provides detailed information on how we maintain and handle your data.</em></p>","tags":"[]","pubDate":"2025-02-17T00:00:00.000Z","link":"https://apply.workable.com/j/BE75924ADF","slug":"research-engineer-intern-ire-research-cloudlinux-2324"},{"id":4818018421,"title":"Staff Software Engineer, Full-Stack","company":"Owner","image":"https://avatars.githubusercontent.com/u/87661266?s=200&v=4","description":"<div><span style=\"font-size: 24px;\">👋&nbsp;</span><b><span style=\"font-size: 24px;\">About&nbsp;</span></b><a href=\"http://owner.com/\"><b><span style=\"font-size: 24px;\">Owner.com</span></b></a></div><div>Owner is the all-in-one platform that restaurants use to succeed online.</div><div><br></div><div>Thousands of restaurant owners use our tools to build their website, drive online orders, create their own branded app, manage their customer relationships, and set up marketing automations.</div><div><br></div><div>You can think of it as Shopify meets HubSpot, but specifically for restaurants.</div><div><br></div><div>Learn more about the problems we are solving for our customers&nbsp;<a href=\"https://www.owner.com/our-story\">here</a>.</div><div><br></div><div><span style=\"font-size: 24px;\">🌎&nbsp;</span><b><span style=\"font-size: 24px;\">Our vision</span></b></div><div>We’re starting by helping independent restaurants succeed online.</div><div><br></div><div>But it’s not just restaurants that need our help. Most local businesses are struggling with these same problems. Huge technology corporations are taking their customers, bleeding their profits, and making it hard for them to survive.</div><div><br></div><div>Once we nail the solution for restaurants&nbsp;–&nbsp;we’ll scale it into every other local business type.</div><div><br></div><div>In the future we envision, tens of millions of local business owners will use our technology to succeed in the digital age.</div><div><br></div><div><span style=\"font-size: 24px;\">🚀&nbsp;</span><b><span style=\"font-size: 24px;\">Our traction</span></b></div><div>In just over 3 years we've generated&nbsp;tens of millions in revenue, served millions of guests, and processed hundreds of millions of online orders.</div><div><br></div><div>More importantly, we’ve helped thousands of restaurant owners save their businesses - and not&nbsp; only survive, but thrive.</div><div><br></div><div><span style=\"font-size: 24px;\">⭐&nbsp;</span><b><span style=\"font-size: 24px;\">Our team</span></b></div><div>Our team grew from under 100 to nearly 200 talented people in 2024. We’ve got top talent from the most successful companies in SMB software, including: Shopify, HubSpot, DoorDash, ServiceTitan, Rappi, Faire and Stripe.</div><div><br></div><div>We’ll be scaling even faster in 2025 to keep pace with our customer growth.</div><div><br></div><div><span style=\"font-size: 24px;\">🌆&nbsp;</span><b><span style=\"font-size: 24px;\">Where we work</span></b></div><div>Owner is a remote-first, global company headquartered in San Francisco, with a sales hub in Toronto. For a few of our roles we prioritize in-person collaboration at one of our office locations. Most of our employees are distributed throughout the globe. Please review the role description and discuss with your recruiter for more details on location!</div><div><br></div><div><span style=\"font-size: 24px;\">🔍 </span><b style=\"font-size: 24px;\">Why we’re looking for you</b></div><div>We are looking for a mission-driven Staff engineer who is passionate about their craft and committed to building incredible products for our customers. </div><div><br></div><div>This role is 100% remote and can be based anywhere in the United States or Canada. For San Francisco-based candidates: we have a new HQ in the Presidio for optional in-person collaboration opportunities!</div><div><br></div><div><b>Our Tech Stack:</b></div><div>Frontend: [React,&nbsp;<a rel=\"noopener noreferrer\" class=\"postings-link\" href=\"http://next.js/\">Next.js</a>, Vue]</div><div>Backend: [<a rel=\"noopener noreferrer\" class=\"postings-link\" href=\"http://node.js/\">Node.js</a>, Mongo]</div><div>Typescript everywhere</div><div><span style=\"font-size: 24px;\">🔍 </span><b style=\"font-size: 24px;\">Why we’re looking for you</b></div><div>We are looking for a mission-driven Staff engineer who is passionate about their craft and committed to building incredible products for our customers. </div><div><br></div><div>This role is 100% remote and can be based anywhere in the United States or Canada. For San Francisco-based candidates: we have a new HQ in the Presidio for optional in-person collaboration opportunities!</div><div><br></div><div><b>Our Tech Stack:</b></div><div>Frontend: [React,&nbsp;<a href=\"http://next.js/\" class=\"postings-link\" target=\"_blank\" rel=\"noopener noreferrer\">Next.js</a>, Vue]</div><div>Backend: [<a href=\"http://node.js/\" class=\"postings-link\" target=\"_blank\" rel=\"noopener noreferrer\">Node.js</a>, Mongo]</div><div>Typescript everywhere</div><h3>💥 The impact you will have</h3><li>Build new products and features 0 to 1</li><li>Take ownership of projects from conception all the way to shipping, ensuring modular, maintainable, and high-quality code</li><li>Deliver value to our end users across our entire system, while maintaining a high bar for code quality, testing, and design discussions</li><li>Shape our product direction by talking to users and collaborating with other teammates in feature brainstorms/roadmap planning</li><li>Mentor more junior teammates and help elevate the skills and expertise of those around you</li><li>Help us build a great team — interview candidates, refer great engineers, and contribute to improving our engineering culture</li><h3>✅ What we’re looking for</h3><li>8+ years of experience building applications</li><li>Extensive Typescript experience</li><li>Experience scaling with frontend stack (React,&nbsp;<a rel=\"noopener noreferrer\" class=\"postings-link\" href=\"http://next.js/\">Next.js</a>, etc.) and/or our backend stack (Nodejs, Mongo, AWS)</li><li>Experience at product-focused startup/scale-up or technology company</li><li>High degree of cross-functional collaboration and leadership. Product managers, designers and business leaders from past roles would speak positively and highly of you</li><li>Dedicated to continuous professional development and possessing a lifelong-learner mindset</li><li>Strong sense of ownership and drive, excellent communication, and a proactive approach to identifying and mitigating risks</li><h3>🏆 Pay and benefits</h3><li>The estimated starting base salary range for this role is $190K-$230K depending on level, location and experience, plus a generous pre-IPO equity package</li><li>Other benefits include comprehensive health coverage, work from anywhere (remote-first workplace), unlimited PTO - plus extra fun perks!</li><div><br></div><div><b><span style=\"font-size: 10px\">🚩 Notice - Employment Scams</span></b></div><div><span style=\"font-size: 10px\">Communication from our team regarding job opportunities will only be made by an Owner employee with an @owner.com email address.</span></div><div><span style=\"font-size: 10px\">We do not conduct interviews over email or chat platforms, and we will never ask you to provide personal or financial information such as your mailing address, social security number, credit card numbers or banking information.&nbsp; If you believe you are being contacted by scammer, please mark the communication as \"phishing\" or “spam” and do not respond.</span></div><div><span style=\"font-size: 24px;\">👋&nbsp;</span><b><span style=\"font-size: 24px;\">About&nbsp;</span></b><a href=\"http://owner.com/\"><b><span style=\"font-size: 24px;\">Owner.com</span></b></a></div><div>Owner is the all-in-one platform that restaurants use to succeed online.</div><div><br></div><div>Thousands of restaurant owners use our tools to build their website, drive online orders, create their own branded app, manage their customer relationships, and set up marketing automations.</div><div><br></div><div>You can think of it as Shopify meets HubSpot, but specifically for restaurants.</div><div><br></div><div>Learn more about the problems we are solving for our customers&nbsp;<a href=\"https://www.owner.com/our-story\">here</a>.</div><div><br></div><div><span style=\"font-size: 24px;\">🌎&nbsp;</span><b><span style=\"font-size: 24px;\">Our vision</span></b></div><div>We’re starting by helping independent restaurants succeed online.</div><div><br></div><div>But it’s not just restaurants that need our help. Most local businesses are struggling with these same problems. Huge technology corporations are taking their customers, bleeding their profits, and making it hard for them to survive.</div><div><br></div><div>Once we nail the solution for restaurants&nbsp;–&nbsp;we’ll scale it into every other local business type.</div><div><br></div><div>In the future we envision, tens of millions of local business owners will use our technology to succeed in the digital age.</div><div><br></div><div><span style=\"font-size: 24px;\">🚀&nbsp;</span><b><span style=\"font-size: 24px;\">Our traction</span></b></div><div>In just over 3 years we've generated&nbsp;tens of millions in revenue, served millions of guests, and processed hundreds of millions of online orders.</div><div><br></div><div>More importantly, we’ve helped thousands of restaurant owners save their businesses - and not&nbsp; only survive, but thrive.</div><div><br></div><div><span style=\"font-size: 24px;\">⭐&nbsp;</span><b><span style=\"font-size: 24px;\">Our team</span></b></div><div>Our team grew from under 100 to nearly 200 talented people in 2024. We’ve got top talent from the most successful companies in SMB software, including: Shopify, HubSpot, DoorDash, ServiceTitan, Rappi, Faire and Stripe.</div><div><br></div><div>We’ll be scaling even faster in 2025 to keep pace with our customer growth.</div><div><br></div><div><span style=\"font-size: 24px;\">🌆&nbsp;</span><b><span style=\"font-size: 24px;\">Where we work</span></b></div><div>Owner is a remote-first, global company headquartered in San Francisco, with a sales hub in Toronto. For a few of our roles we prioritize in-person collaboration at one of our office locations. Most of our employees are distributed throughout the globe. Please review the role description and discuss with your recruiter for more details on location!</div>","tags":"[\"typescript\",\"engineering\",\"mongo\",\"aws\"]","pubDate":"2025-02-14T21:53:17.419Z","link":"https://jobs.lever.co/owner/a50c8e21-f712-4ac5-b0f4-1e47c1de7479","slug":"staff-software-engineer-full-stack-owner-2217"},{"id":6087512967,"title":"Senior Software Engineer, Full-Stack","company":"Owner","image":"https://avatars.githubusercontent.com/u/87661266?s=200&v=4","description":"<div><span style=\"font-size: 24px;\">👋&nbsp;</span><b><span style=\"font-size: 24px;\">About&nbsp;</span></b><a href=\"http://owner.com/\"><b><span style=\"font-size: 24px;\">Owner.com</span></b></a></div><div>Owner is the all-in-one platform that restaurants use to succeed online.</div><div><br></div><div>Thousands of restaurant owners use our tools to build their website, drive online orders, create their own branded app, manage their customer relationships, and set up marketing automations.</div><div><br></div><div>You can think of it as Shopify meets HubSpot, but specifically for restaurants.</div><div><br></div><div>Learn more about the problems we are solving for our customers&nbsp;<a href=\"https://www.owner.com/our-story\">here</a>.</div><div><br></div><div><span style=\"font-size: 24px;\">🌎&nbsp;</span><b><span style=\"font-size: 24px;\">Our vision</span></b></div><div>We’re starting by helping independent restaurants succeed online.</div><div><br></div><div>But it’s not just restaurants that need our help. Most local businesses are struggling with these same problems. Huge technology corporations are taking their customers, bleeding their profits, and making it hard for them to survive.</div><div><br></div><div>Once we nail the solution for restaurants&nbsp;–&nbsp;we’ll scale it into every other local business type.</div><div><br></div><div>In the future we envision, tens of millions of local business owners will use our technology to succeed in the digital age.</div><div><br></div><div><span style=\"font-size: 24px;\">🚀&nbsp;</span><b><span style=\"font-size: 24px;\">Our traction</span></b></div><div>In just over 3 years we've generated&nbsp;tens of millions in revenue, served millions of guests, and processed hundreds of millions of online orders.</div><div><br></div><div>More importantly, we’ve helped thousands of restaurant owners save their businesses - and not&nbsp; only survive, but thrive.</div><div><br></div><div><span style=\"font-size: 24px;\">⭐&nbsp;</span><b><span style=\"font-size: 24px;\">Our team</span></b></div><div>Our team grew from under 100 to nearly 200 talented people in 2024. We’ve got top talent from the most successful companies in SMB software, including: Shopify, HubSpot, DoorDash, ServiceTitan, Rappi, Faire and Stripe.</div><div><br></div><div>We’ll be scaling even faster in 2025 to keep pace with our customer growth.</div><div><br></div><div><span style=\"font-size: 24px;\">🌆&nbsp;</span><b><span style=\"font-size: 24px;\">Where we work</span></b></div><div>Owner is a remote-first, global company headquartered in San Francisco, with a sales hub in Toronto. For a few of our roles we prioritize in-person collaboration at one of our office locations. Most of our employees are distributed throughout the globe. Please review the role description and discuss with your recruiter for more details on location!</div><div><br></div><div><span style=\"font-size: 24px;\">🔍 </span><b style=\"font-size: 24px;\">Why we’re looking for you</b></div><div>We are looking for a mission-driven senior engineer who is passionate about their craft and committed to building incredible products for our customers.</div><div><br></div><div>This role is 100% remote and can be based anywhere in the United States or Canada. For San Francisco-based candidates: we have a new HQ in the Presidio for optional in-person collaboration opportunities!</div><div><br></div><div><b>Our Tech Stack:</b></div><div>Frontend: [React,&nbsp;<a rel=\"noopener noreferrer\" class=\"postings-link\" href=\"http://next.js/\">Next.js</a>, Vue]</div><div>Backend: [<a rel=\"noopener noreferrer\" class=\"postings-link\" href=\"http://node.js/\">Node.js</a>, Mongo]</div><div>Typescript everywhere</div><div><span style=\"font-size: 24px;\">🔍 </span><b style=\"font-size: 24px;\">Why we’re looking for you</b></div><div>We are looking for a mission-driven senior engineer who is passionate about their craft and committed to building incredible products for our customers.</div><div><br></div><div>This role is 100% remote and can be based anywhere in the United States or Canada. For San Francisco-based candidates: we have a new HQ in the Presidio for optional in-person collaboration opportunities!</div><div><br></div><div><b>Our Tech Stack:</b></div><div>Frontend: [React,&nbsp;<a href=\"http://next.js/\" class=\"postings-link\" target=\"_blank\" rel=\"noopener noreferrer\">Next.js</a>, Vue]</div><div>Backend: [<a href=\"http://node.js/\" class=\"postings-link\" target=\"_blank\" rel=\"noopener noreferrer\">Node.js</a>, Mongo]</div><div>Typescript everywhere</div><h3>💥 The impact you will have</h3><li>Build new products and features 0 to 1</li><li>Take ownership of projects from conception all the way to shipping, ensuring modular, maintainable, and high-quality code</li><li>Deliver value to our end users across our entire system while considering performance, scale, security, and maintainability</li><li>Shape our product direction by talking to users and collaborating with other teammates in feature brainstorms/roadmap planning</li><li>Provide thoughtful code reviews and technical guidance to peers, helping to improve overall team quality</li><li>Help us build a great team — interview candidates, refer great engineers, etc.</li><h3>✅ What we’re looking for</h3><li>5+ years of experience building applications</li><li>Extensive Typescript experience</li><li>Experience scaling with frontend stack (React,&nbsp;<a rel=\"noopener noreferrer\" class=\"postings-link\" href=\"http://next.js/\">Next.js</a>, etc.) and/or our backend stack (Nodejs, Mongo, AWS)</li><li>Experience at product-focused startup/scale-up or technology company</li><li>High degree of cross-functional collaboration—past colleagues in product, design, and business would speak highly of your teamwork</li><li>Dedicated to continuous professional development and possessing a lifelong-learner mindset</li><li>Strong sense of ownership and drive, excellent communication, and a proactive approach to identifying and solving problems</li><h3>🏆 Pay and benefits</h3><li>The estimated starting base salary range for this role is $170K-200K depending on level, location and experience, plus a generous pre-IPO equity package</li><li>Other benefits include comprehensive health coverage, work from anywhere (remote-first workplace), unlimited PTO - plus extra fun perks!</li><div><br></div><div><b><span style=\"font-size: 10px\">🚩 Notice - Employment Scams</span></b></div><div><span style=\"font-size: 10px\">Communication from our team regarding job opportunities will only be made by an Owner employee with an @owner.com email address.</span></div><div><span style=\"font-size: 10px\">We do not conduct interviews over email or chat platforms, and we will never ask you to provide personal or financial information such as your mailing address, social security number, credit card numbers or banking information.&nbsp; If you believe you are being contacted by scammer, please mark the communication as \"phishing\" or “spam” and do not respond.</span></div><div><span style=\"font-size: 24px;\">👋&nbsp;</span><b><span style=\"font-size: 24px;\">About&nbsp;</span></b><a href=\"http://owner.com/\"><b><span style=\"font-size: 24px;\">Owner.com</span></b></a></div><div>Owner is the all-in-one platform that restaurants use to succeed online.</div><div><br></div><div>Thousands of restaurant owners use our tools to build their website, drive online orders, create their own branded app, manage their customer relationships, and set up marketing automations.</div><div><br></div><div>You can think of it as Shopify meets HubSpot, but specifically for restaurants.</div><div><br></div><div>Learn more about the problems we are solving for our customers&nbsp;<a href=\"https://www.owner.com/our-story\">here</a>.</div><div><br></div><div><span style=\"font-size: 24px;\">🌎&nbsp;</span><b><span style=\"font-size: 24px;\">Our vision</span></b></div><div>We’re starting by helping independent restaurants succeed online.</div><div><br></div><div>But it’s not just restaurants that need our help. Most local businesses are struggling with these same problems. Huge technology corporations are taking their customers, bleeding their profits, and making it hard for them to survive.</div><div><br></div><div>Once we nail the solution for restaurants&nbsp;–&nbsp;we’ll scale it into every other local business type.</div><div><br></div><div>In the future we envision, tens of millions of local business owners will use our technology to succeed in the digital age.</div><div><br></div><div><span style=\"font-size: 24px;\">🚀&nbsp;</span><b><span style=\"font-size: 24px;\">Our traction</span></b></div><div>In just over 3 years we've generated&nbsp;tens of millions in revenue, served millions of guests, and processed hundreds of millions of online orders.</div><div><br></div><div>More importantly, we’ve helped thousands of restaurant owners save their businesses - and not&nbsp; only survive, but thrive.</div><div><br></div><div><span style=\"font-size: 24px;\">⭐&nbsp;</span><b><span style=\"font-size: 24px;\">Our team</span></b></div><div>Our team grew from under 100 to nearly 200 talented people in 2024. We’ve got top talent from the most successful companies in SMB software, including: Shopify, HubSpot, DoorDash, ServiceTitan, Rappi, Faire and Stripe.</div><div><br></div><div>We’ll be scaling even faster in 2025 to keep pace with our customer growth.</div><div><br></div><div><span style=\"font-size: 24px;\">🌆&nbsp;</span><b><span style=\"font-size: 24px;\">Where we work</span></b></div><div>Owner is a remote-first, global company headquartered in San Francisco, with a sales hub in Toronto. For a few of our roles we prioritize in-person collaboration at one of our office locations. Most of our employees are distributed throughout the globe. Please review the role description and discuss with your recruiter for more details on location!</div>","tags":"[\"typescript\",\"mongo\",\"aws\"]","pubDate":"2025-02-14T21:52:32.317Z","link":"https://jobs.lever.co/owner/a72058a0-6d4a-4310-8e01-68b950decf82","slug":"senior-software-engineer-full-stack-owner-6090"},{"id":9377272493,"title":"Software Engineer, Full-Stack","company":"Owner","image":"https://avatars.githubusercontent.com/u/87661266?s=200&v=4","description":"<div><span style=\"font-size: 24px;\">👋&nbsp;</span><b><span style=\"font-size: 24px;\">About&nbsp;</span></b><a href=\"http://owner.com/\"><b><span style=\"font-size: 24px;\">Owner.com</span></b></a></div><div>Owner is the all-in-one platform that restaurants use to succeed online.</div><div><br></div><div>Thousands of restaurant owners use our tools to build their website, drive online orders, create their own branded app, manage their customer relationships, and set up marketing automations.</div><div><br></div><div>You can think of it as Shopify meets HubSpot, but specifically for restaurants.</div><div><br></div><div>Learn more about the problems we are solving for our customers&nbsp;<a href=\"https://www.owner.com/our-story\">here</a>.</div><div><br></div><div><span style=\"font-size: 24px;\">🌎&nbsp;</span><b><span style=\"font-size: 24px;\">Our vision</span></b></div><div>We’re starting by helping independent restaurants succeed online.</div><div><br></div><div>But it’s not just restaurants that need our help. Most local businesses are struggling with these same problems. Huge technology corporations are taking their customers, bleeding their profits, and making it hard for them to survive.</div><div><br></div><div>Once we nail the solution for restaurants&nbsp;–&nbsp;we’ll scale it into every other local business type.</div><div><br></div><div>In the future we envision, tens of millions of local business owners will use our technology to succeed in the digital age.</div><div><br></div><div><span style=\"font-size: 24px;\">🚀&nbsp;</span><b><span style=\"font-size: 24px;\">Our traction</span></b></div><div>In just over 3 years we've generated&nbsp;tens of millions in revenue, served millions of guests, and processed hundreds of millions of online orders.</div><div><br></div><div>More importantly, we’ve helped thousands of restaurant owners save their businesses - and not&nbsp; only survive, but thrive.</div><div><br></div><div><span style=\"font-size: 24px;\">⭐&nbsp;</span><b><span style=\"font-size: 24px;\">Our team</span></b></div><div>Our team grew from under 100 to nearly 200 talented people in 2024. We’ve got top talent from the most successful companies in SMB software, including: Shopify, HubSpot, DoorDash, ServiceTitan, Rappi, Faire and Stripe.</div><div><br></div><div>We’ll be scaling even faster in 2025 to keep pace with our customer growth.</div><div><br></div><div><span style=\"font-size: 24px;\">🌆&nbsp;</span><b><span style=\"font-size: 24px;\">Where we work</span></b></div><div>Owner is a remote-first, global company headquartered in San Francisco, with a sales hub in Toronto. For a few of our roles we prioritize in-person collaboration at one of our office locations. Most of our employees are distributed throughout the globe. Please review the role description and discuss with your recruiter for more details on location!</div><div><br></div><div><span style=\"font-size: 24px;\">🔍 </span><b style=\"font-size: 24px;\">Why we’re looking for you</b></div><div>We are looking for a mission-driven engineer who is passionate about their craft and committed to building incredible products for our customers.</div><div><br></div><div>This role is 100% remote and can be based anywhere in the United States or Canada. For San Francisco-based candidates: we have a new HQ in the Presidio for optional in-person collaboration opportunities!</div><div><br></div><div><b>Our Tech Stack:</b></div><div>Frontend: [React,&nbsp;<a rel=\"noopener noreferrer\" class=\"postings-link\" href=\"http://next.js/\">Next.js</a>, Vue]</div><div>Backend: [<a rel=\"noopener noreferrer\" class=\"postings-link\" href=\"http://node.js/\">Node.js</a>, Mongo]</div><div>Typescript everywhere</div><div><span style=\"font-size: 24px;\">🔍 </span><b style=\"font-size: 24px;\">Why we’re looking for you</b></div><div>We are looking for a mission-driven engineer who is passionate about their craft and committed to building incredible products for our customers.</div><div><br></div><div>This role is 100% remote and can be based anywhere in the United States or Canada. For San Francisco-based candidates: we have a new HQ in the Presidio for optional in-person collaboration opportunities!</div><div><br></div><div><b>Our Tech Stack:</b></div><div>Frontend: [React,&nbsp;<a href=\"http://next.js/\" class=\"postings-link\" target=\"_blank\" rel=\"noopener noreferrer\">Next.js</a>, Vue]</div><div>Backend: [<a href=\"http://node.js/\" class=\"postings-link\" target=\"_blank\" rel=\"noopener noreferrer\">Node.js</a>, Mongo]</div><div>Typescript everywhere</div><h3>💥 The impact you will have</h3><li>Build new products and features 0 to 1</li><li>Take ownership of projects from conception all the way to shipping</li><li>Deliver value to our end users across our entire system</li><li>Shape our product direction by talking to users and collaborating with other teammates in feature brainstorms/roadmap planning</li><li>Help us build a great team — interview candidates, refer great engineers, etc.</li><h3>✅ What we’re looking for</h3><li>3+ years of experience building applications</li><li>Typescript experience</li><li>Experience scaling with frontend stack (React,&nbsp;<a rel=\"noopener noreferrer\" class=\"postings-link\" href=\"http://next.js/\">Next.js</a>, etc.) and/or our backend stack (Nodejs, Mongo, AWS)</li><li>Experience at product-focused startup/scale-up or technology company</li><li>High degree of cross-functional collaboration and leadership. Product managers, designers and business leaders from past roles would speak positively and highly of you</li><li>Strong sense of ownership, excellent communication, and a proactive mindset</li><h3>🏆 Pay and benefits</h3><li>The estimated starting base salary range for this role is $140K-180K depending on level, location and experience, plus a generous pre-IPO equity package</li><li>Other benefits include comprehensive health coverage, work from anywhere (remote-first workplace), unlimited PTO - plus extra fun perks!</li><div><br></div><div><b><span style=\"font-size: 10px\">🚩 Notice - Employment Scams</span></b></div><div><span style=\"font-size: 10px\">Communication from our team regarding job opportunities will only be made by an Owner employee with an @owner.com email address.</span></div><div><span style=\"font-size: 10px\">We do not conduct interviews over email or chat platforms, and we will never ask you to provide personal or financial information such as your mailing address, social security number, credit card numbers or banking information.&nbsp; If you believe you are being contacted by scammer, please mark the communication as \"phishing\" or “spam” and do not respond.</span></div><div><span style=\"font-size: 24px;\">👋&nbsp;</span><b><span style=\"font-size: 24px;\">About&nbsp;</span></b><a href=\"http://owner.com/\"><b><span style=\"font-size: 24px;\">Owner.com</span></b></a></div><div>Owner is the all-in-one platform that restaurants use to succeed online.</div><div><br></div><div>Thousands of restaurant owners use our tools to build their website, drive online orders, create their own branded app, manage their customer relationships, and set up marketing automations.</div><div><br></div><div>You can think of it as Shopify meets HubSpot, but specifically for restaurants.</div><div><br></div><div>Learn more about the problems we are solving for our customers&nbsp;<a href=\"https://www.owner.com/our-story\">here</a>.</div><div><br></div><div><span style=\"font-size: 24px;\">🌎&nbsp;</span><b><span style=\"font-size: 24px;\">Our vision</span></b></div><div>We’re starting by helping independent restaurants succeed online.</div><div><br></div><div>But it’s not just restaurants that need our help. Most local businesses are struggling with these same problems. Huge technology corporations are taking their customers, bleeding their profits, and making it hard for them to survive.</div><div><br></div><div>Once we nail the solution for restaurants&nbsp;–&nbsp;we’ll scale it into every other local business type.</div><div><br></div><div>In the future we envision, tens of millions of local business owners will use our technology to succeed in the digital age.</div><div><br></div><div><span style=\"font-size: 24px;\">🚀&nbsp;</span><b><span style=\"font-size: 24px;\">Our traction</span></b></div><div>In just over 3 years we've generated&nbsp;tens of millions in revenue, served millions of guests, and processed hundreds of millions of online orders.</div><div><br></div><div>More importantly, we’ve helped thousands of restaurant owners save their businesses - and not&nbsp; only survive, but thrive.</div><div><br></div><div><span style=\"font-size: 24px;\">⭐&nbsp;</span><b><span style=\"font-size: 24px;\">Our team</span></b></div><div>Our team grew from under 100 to nearly 200 talented people in 2024. We’ve got top talent from the most successful companies in SMB software, including: Shopify, HubSpot, DoorDash, ServiceTitan, Rappi, Faire and Stripe.</div><div><br></div><div>We’ll be scaling even faster in 2025 to keep pace with our customer growth.</div><div><br></div><div><span style=\"font-size: 24px;\">🌆&nbsp;</span><b><span style=\"font-size: 24px;\">Where we work</span></b></div><div>Owner is a remote-first, global company headquartered in San Francisco, with a sales hub in Toronto. For a few of our roles we prioritize in-person collaboration at one of our office locations. Most of our employees are distributed throughout the globe. Please review the role description and discuss with your recruiter for more details on location!</div>","tags":"[\"typescript\",\"mongo\",\"aws\"]","pubDate":"2025-02-14T21:19:58.913Z","link":"https://jobs.lever.co/owner/7501bad4-5f21-45ea-8332-64e8fc5d52bf","slug":"software-engineer-full-stack-owner-6021"}]