[{"id":9446304551,"title":"Talent Sourcer","company":"bunny.net","image":"https://remotive.com/job/1892053/logo","description":"<p><strong><a href=\"http://bunny.net/\" rel=\"nofollow\" target=\"_blank\">bunny.net</a> is where individual imaginations gather together to solve next-generation internet challenges. Join a team of experts and, together, help shape the future of the internet. Here, you'll do more than join something — you'll add something.</strong></p>\n<p>We're not just saying that, but our culture really hops. We have established values that enable our fluffle to grow stronger with each new team member who joins us: <strong>Integrity. Innovation. Impact. Diversity. Kindness. Transparency &amp; open communication. </strong>And, of course, we learn &amp; improve every single day. Did we mention that all our positions are 100% remote? There's no need to relocate if you would like to join us!</p>\n<div class=\"h3\">Talent Sourcer</div>\n<p>As a Talent Sourcer at <a href=\"http://bunny.net/\" rel=\"nofollow\" target=\"_blank\">bunny.net</a>, your role is pivotal in supporting the growth of our international team. Working closely with management and our Talent Acquisition Specialists, you will play a crucial role in identifying and nurturing talent, ensuring we have the right people to achieve our ambitious goals. </p>\n<div class=\"h3\">What will you do? </div>\n<ul style=\"\">\n<li style=\"\">Assist in developing and executing recruitment strategies.</li>\n<li style=\"\">Support candidate sourcing through various channels, including job boards and social media.</li>\n<li style=\"\">Help manage the hiring process in our Applicant Tracking System (ATS).</li>\n<li style=\"\">Aid in screening resumes, vetting candidates, and conducting preliminary interviews.</li>\n<li style=\"\">Contribute to the feedback loop to continuously refine recruitment strategies.</li>\n<li style=\"\">Foster and maintain relationships with potential candidates for future key positions.</li>\n</ul>\n<div class=\"h3\">What will you add:</div>\n<ul style=\"\">\n<li style=\"\">Proven experience in supporting recruitment strategies.</li>\n<li style=\"\">Ability to understand and identify key skills required for various roles, particularly in the tech sector.</li>\n<li style=\"\">Quick learner, able to adapt to evaluating candidates for diverse positions.</li>\n<li style=\"\">Basic understanding of programming or IT experience is beneficial.</li>\n<li style=\"\">Excellent interpersonal and communication skills.</li>\n<li style=\"\">Data-driven mindset.</li>\n<li style=\"\">Fluency in English, both spoken and written.</li>\n</ul>\n<div class=\"h3\">What is in it for you?</div>\n<p>At <a href=\"http://bunny.net/\" rel=\"nofollow\" target=\"_blank\">bunny.net</a>, we invest in you. We want to provide significant benefits while also helping you maintain a healthy work &amp; personal life.</p>\n<ul style=\"\">\n<li style=\"\"><strong>A competitive salary. </strong>You can expect above-average industry salaries.</li>\n<li style=\"\"><strong>100% flexible working hours. </strong>Work from anywhere, at your own schedule.</li>\n<li style=\"\"><strong>Paid Time Off.</strong> Love visiting the seaside? No problem - us, too. We offer 25 days of paid vacation (plus your local public holidays on top).</li>\n<li style=\"\"><strong>Parental Leave.</strong> Bonding with the little ones is super important, so we offer parental leave and flexible scheduling to ease your way into parenthood.</li>\n<li style=\"\"><strong>Home Office Budget.</strong> We believe everyone is more efficient working in a comfortable office, and we're happy to help.</li>\n<li style=\"\"><strong>Paid Sick Leave.</strong> Feeling ill? Take time off and get back to 100% without worrying about your finances.</li>\n<li style=\"\"><strong>Mental Health Support.</strong> Feeling down? We've got your back. <a href=\"http://bunny.net/\" rel=\"nofollow\" target=\"_blank\">bunny.net</a> provides mental health resources and help via our external partner.</li>\n<li style=\"\"><strong>Educational Budget. </strong>Dedicated yearly learning and educational budget for books, seminars, and online courses.</li>\n<li style=\"\"><strong>Wellbeing Budget:</strong> A yearly budget to invest in your personal health and wellness.</li>\n</ul>\n<img src=\"https://remotive.com/job/track/1892053/blank.gif?source=public_api\" alt=\"\"/>","tags":"[\"social media\",\"ATS\",\"diversity\",\"mental health\"]","pubDate":"2024-01-20 19:23:51.000","link":"https://remotive.com/remote-jobs/hr/talent-sourcer-1892053","savedDate":"2024-01-22 07:26:00.413","slug":"talent-sourcer-bunny-net-7335"},{"id":4509863103,"title":"Recruiter at Hire5","company":"Hire5","image":"https://remotive.com/job/1892059/logo","description":"<p dir=\"ltr\" style=\"text-align: center;\"><strong>Recruiter at Hire5 - a California-based company helping global talents enhance their careers in US startups (remote).</strong></p>\n<p> </p>\n<p dir=\"ltr\"><a href=\"https://career.hire5.co/\" rel=\"nofollow\"><strong>Hire5</strong></a> (formerly Grintern) is a team of enthusiastic people who provide aspiring talents worldwide with remote opportunities to enhance their careers in the startups of Silicon Valley and other US-based companies.</p>\n<p> </p>\n<p dir=\"ltr\">We connect with high-potential US startups that need help and are ready to take junior, middle, or senior-level global remote talents to join their team. We deliver a fast, client-centric, cost-effective, and risk-free hiring process, and thus, we organize those win-win situations. And you’ll be surprised - our whole process from discussing the client’s needs to the new team member’s first working day takes no longer than 2 weeks!</p>\n<p> </p>\n<p dir=\"ltr\">Now, we are looking for a <strong>Recruiter </strong>who will be responsible for careful understanding of clients’ needs, sourcing new candidates, walking them through the selection process, assessing their skills, identifying risks, and presenting the best ones to our clients.</p>\n<p> </p>\n<p dir=\"ltr\"><strong>Is that you who we are looking for? Apply now! </strong></p>\n<p> </p>\n<p dir=\"ltr\"><strong>By joining Hire5</strong>, you'll become part of a small &amp; efficient team of 10 passionate professionals and a thriving community of 300+ successful startups that have discovered their team members through Hire5. This is an excellent opportunity for you to excel in Recruitment within the US market, make a meaningful contribution to our mission, witness the daily impact of your work, and experience personal and professional growth alongside our experienced team.<br><br></p>\n<p dir=\"ltr\"><strong>What will you do in our team?</strong></p>\n<p dir=\"ltr\">— <strong>Understand the needs of US startup founders </strong>interested in hiring middle and senior talents remotely. The most typical spheres of the roles we hire for are sales, analytics, software development, finance, graphic design, video editing, research, business and personal assistance, and more.</p>\n<p dir=\"ltr\">— <strong>Identify the needed skills and compose interview scripts and test assignments </strong>to make sure your assessments are matching with the client’s needs.</p>\n<p dir=\"ltr\">— <strong>Source relevant candidates</strong> via LinkedIn search and other platforms and techniques that should be already in your skill set.</p>\n<p dir=\"ltr\">— <strong>Conduct structured interviews </strong>to assess the candidates based on the client’s needs and requirements. All the interviews (as well as everything we do on a daily basis) are held in English.</p>\n<p dir=\"ltr\">— <strong>Select the best-fit candidates</strong>, fill in the showcase spreadsheet report for a client to demonstrate why exactly those candidates were chosen, and organize the interviews for them.</p>\n<p dir=\"ltr\">—<strong> Moderate client-talent interviews</strong>, help a client to make a final decision or gather the client’s feedback, and continue searching for the best-fit candidates.</p>\n<p dir=\"ltr\">— <strong>Maintain Applicant Tracking System and various databases </strong>during the whole process to track each step and all the needed information.</p>\n<p dir=\"ltr\">—<strong> Develop a LinkedIn network</strong> of potential candidates to attract more and more people to the talent pool, increase brand awareness, and quickly find new candidates for the new positions.</p>\n<p dir=\"ltr\">— <strong>Help the team</strong> with other possible tasks or projects if they appear.<br><br></p>\n<p dir=\"ltr\"><strong>What will set you up for success?</strong></p>\n<p dir=\"ltr\">— <strong>Fluent written and spoken English</strong> - you will be representing Hire5 for both clients and talents, so we are looking for a person for whom grammar/spelling/typing/other mistakes are not tolerable.</p>\n<p dir=\"ltr\">— <strong>Expertise in sourcing &amp; recruitment of middle and senior specialists</strong> - you need to know how to find and attract professionals all over the world, assess various hard &amp; soft, feel confident about two-way communication with senior candidates (not only asking them questions but answering their questions about the position and companies as well), and feel confident representing and justifying your choice to a client, etc.</p>\n<p dir=\"ltr\">— <strong>Passion to communicate</strong> <strong>&amp; increase network</strong>- seriously, there will be a looooot of communication (both oral and written), and we definitely look for a person who will only get more and more energetic after spending 8 hours per day communicating.</p>\n<p dir=\"ltr\">— <strong>Empathy and love for people</strong> - if you are a person who can sincerely adore other people (but at the same time critically think and see potential drawbacks), that’s your role. We truly care about our candidates’ experience going through our selection process, and value our employer branding.</p>\n<p dir=\"ltr\">— <strong>Excellent organizing skills</strong> - you keep all the tasks in Google Calendar, track each step in the system, always check that everything is done on time, never forget about clients or talents, proactively follow them up, always put all the needed information into the needed folders/databases, etc. We have a fast-paced environment, are you ready for that?</p>\n<p dir=\"ltr\">— <strong>Super attention to detail</strong> - we love it when everything is structured and double-checked. Does your eye start twitching when you see a double space or a missing comma?</p>\n<p> </p>\n<p dir=\"ltr\"><strong>Not required but will be an advantage:</strong></p>\n<p dir=\"ltr\">— Experience <strong>working for or with US startups</strong> and understanding of their needs and founders’ mindsets.</p>\n<p dir=\"ltr\">— Experience finding remote specialists in spheres of sales, analytics, software development, finance, and others all over the world <strong>within a couple of days</strong>.</p>\n<p dir=\"ltr\">— <strong>Network</strong> of thousands of specialists connected with you <strong>on LinkedIn</strong>.</p>\n<p> </p>\n<p dir=\"ltr\"><strong>Working hours:</strong></p>\n<p dir=\"ltr\">Our team has to be available for both candidates (mostly in Eastern Europe &amp; Central Asia) and clients (in the US) and adjust to such a schedule. So, an ideal schedule for a recruiter will be working <strong>between 12:00 and 20:00 Turkey time (or 8 am to 4 pm Argentina time</strong>, if you are located in Latin America) while sometimes starting the day later and having final interviews with the US clients till around 22:00-23:00 Turkey time (5 pm Argentina time).</p>\n<p> </p>\n<p dir=\"ltr\"><strong>What we offer:</strong></p>\n<p dir=\"ltr\">— <strong>Full-time or part-time job. </strong>We are ready to consider both candidates looking for a full-time commitment, as well as candidates who are eager to apply their expertise on a part-time basis (for example, recruiters who are currently on maternity leave, etc).</p>\n<p dir=\"ltr\">— <strong>Fully remote work</strong>. You may be located in almost any country or city, as all of our team members are. Our team now consists of 10 people and we are located all over the world - US, Argentina, Brazil, Poland, Turkey, Montenegro, Georgia, Belarus, and other countries. You just need to have a great internet connection, a powerful computer to work from, and an opportunity to adjust your working hours to the needed schedule.</p>\n<p dir=\"ltr\">— Opportunity to start a career in a <strong>US company with an inspiring mission</strong>.</p>\n<p dir=\"ltr\">— Opportunity to <strong>learn from a talented team</strong> of people who love their job.</p>\n<p dir=\"ltr\">— Opportunity to <strong>see the results of your work</strong>, contribute, and help Hire5 achieve new heights.</p>\n<p dir=\"ltr\">— <strong>Salary is paid in USD</strong>, your expectations will be discussed during the interview.</p>\n<p> </p>\n<p dir=\"ltr\"><strong>Application process and timeline:</strong></p>\n<p dir=\"ltr\">We are planning to hire this new team member in February 2024, so we’ll first collect the base of applications during January 2024, and further, will start a quick selection process:</p>\n<p dir=\"ltr\">1. Fill in the application form - attach your resume;</p>\n<p dir=\"ltr\">2. Complete the test assignment;</p>\n<p dir=\"ltr\">3. Have a Zoom interview with our Recruiter;</p>\n<p dir=\"ltr\">4. Have a Zoom interview with our Head of HR &amp; Recruitment;</p>\n<p dir=\"ltr\">5. Get hired!</p>\n<p dir=\"ltr\"><em>_________________________<br></em></p>\n<p dir=\"ltr\"><a href=\"https://career.hire5.co/?utm_source=vacancies&amp;utm_medium=jobdescription\" rel=\"nofollow\">Hire5</a> provides aspiring talents worldwide with remote opportunities to enhance their careers in Silicon Valley startups and other US-based companies. <br><br>Interested in joining one of the most promising US startups? <br><br><a href=\"https://career.hire5.co/?utm_source=vacancies&amp;utm_medium=jobdescription\" rel=\"nofollow\">Press here to apply now or click “connect” on career.hire5.co</a> to subscribe for future opportunities in your desired profession!</p>\n<img src=\"https://remotive.com/job/track/1892059/blank.gif?source=public_api\" alt=\"\"/>","tags":"[\"excel\",\"video\",\"research\",\"analytics\",\"brand design\",\"graphic design\",\"editing\",\"startup\"]","pubDate":"2024-01-19 19:20:29.000","link":"https://remotive.com/remote-jobs/hr/recruiter-at-hire5-1892059","savedDate":"2024-01-22 07:26:00.414","slug":"recruiter-at-hire5-hire5-5661"},{"id":5478662016,"title":"JavaScript Developer","company":"Akasha","image":"https://remotive.com/job/1891624/logo","description":"<p style=\"border: 0px; font-variant-numeric: inherit; font-variant-east-asian: inherit; font-variant-alternates: inherit; font-variant-position: inherit; font-stretch: inherit; line-height: 30px; font-optical-sizing: inherit; font-kerning: inherit; font-feature-settings: inherit; font-variation-settings: inherit; margin: 0px auto 26px; padding: 0px; vertical-align: baseline; -webkit-font-smoothing: antialiased; text-align: center; background-color: #ffffff;\"><span style=\"border: 0px; font-variant-alternates: inherit; font-variant-numeric: inherit; font-variant-east-asian: inherit; font-variant-position: inherit; font-stretch: inherit; line-height: inherit; font-optical-sizing: inherit; font-kerning: inherit; font-feature-settings: inherit; font-variation-settings: inherit; margin: 0px; padding: 0px; vertical-align: baseline;\">If you're seeking an exciting career opportunity or an authentic chance to learn new technologies and feel that you are up to the challenge please get in touch: </span></p>\n<p style=\"border: 0px; font-variant-numeric: inherit; font-variant-east-asian: inherit; font-variant-alternates: inherit; font-variant-position: inherit; font-stretch: inherit; line-height: 30px; font-optical-sizing: inherit; font-kerning: inherit; font-feature-settings: inherit; font-variation-settings: inherit; margin: 0px auto 26px; padding: 0px; vertical-align: baseline; -webkit-font-smoothing: antialiased; text-align: center; background-color: #ffffff;\"><span style=\"border: 0px; font-variant-alternates: inherit; font-variant-numeric: inherit; font-variant-east-asian: inherit; font-variant-position: inherit; font-stretch: inherit; line-height: inherit; font-optical-sizing: inherit; font-kerning: inherit; font-feature-settings: inherit; font-variation-settings: inherit; margin: 0px; padding: 0px; vertical-align: baseline;\"><span style=\"color: #333333; font-style: inherit; font-variant-ligatures: inherit; font-variant-caps: inherit; font-weight: bold;\"><em>YOU </em></span><span style=\"color: #333333;\"><span style=\"font-style: inherit; font-variant-ligatures: inherit; font-variant-caps: inherit;\">have a place in this team and project!</span></span><br><br><strong><span style=\"color: #333333;\">(preferred time zones UTC to UTC +3)</span></strong><br><br></span></p>\n<div class=\"h4\" style=\"border: 0px; font-variant-numeric: inherit; font-variant-east-asian: inherit; font-variant-alternates: inherit; font-variant-position: inherit; font-stretch: inherit; line-height: 30px; font-optical-sizing: inherit; font-kerning: inherit; font-feature-settings: inherit; font-variation-settings: inherit; margin: 0px auto 26px; padding: 0px; vertical-align: baseline; -webkit-font-smoothing: antialiased; background-color: #ffffff; text-align: left;\">Project Overview</div>\n<p style=\"border: 0px; font-variant-numeric: inherit; font-variant-east-asian: inherit; font-variant-alternates: inherit; font-variant-position: inherit; font-stretch: inherit; line-height: 30px; font-optical-sizing: inherit; font-kerning: inherit; font-feature-settings: inherit; font-variation-settings: inherit; margin: 0px auto 26px; padding: 0px; vertical-align: baseline; -webkit-font-smoothing: antialiased; background-color: #ffffff; text-align: left;\">By combining blockchain technologies such as Ethereum and the Inter Planetary File System (IPFS), AKASHA has the potential to change the way ideas, thoughts and experiences are shared and stored on the Internet.</p>\n<p style=\"border: 0px; font-variant-numeric: inherit; font-variant-east-asian: inherit; font-variant-alternates: inherit; font-variant-position: inherit; font-stretch: inherit; line-height: 30px; font-optical-sizing: inherit; font-kerning: inherit; font-feature-settings: inherit; font-variation-settings: inherit; margin: 0px auto 26px; padding: 0px; vertical-align: baseline; -webkit-font-smoothing: antialiased; background-color: #ffffff; text-align: left;\">As part of our remote team distributed across the globe, you will work with some of the brightest minds in the blockchain tech space on unique and challenging ideas. You will also be in direct contact with the development and user community at large, actively participating in open discussions and brainstorming sessions.</p>\n<p style=\"border: 0px; font-variant-numeric: inherit; font-variant-east-asian: inherit; font-variant-alternates: inherit; font-variant-position: inherit; font-stretch: inherit; line-height: 30px; font-optical-sizing: inherit; font-kerning: inherit; font-feature-settings: inherit; font-variation-settings: inherit; margin: 0px auto 26px; padding: 0px; vertical-align: baseline; -webkit-font-smoothing: antialiased; text-align: center; background-color: #ffffff;\"> </p>\n<div class=\"h4\" style=\"border: 0px; font-variant-numeric: inherit; font-variant-east-asian: inherit; font-variant-alternates: inherit; font-variant-position: inherit; font-stretch: inherit; line-height: 30px; font-optical-sizing: inherit; font-kerning: inherit; font-feature-settings: inherit; font-variation-settings: inherit; margin: 0px auto 26px; padding: 0px; vertical-align: baseline; -webkit-font-smoothing: antialiased; background-color: #ffffff; text-align: left;\">Requirements</div>\n<ul style=\"\">\n<li style=\"\">3+ years JavaScript development experience</li>\n<li style=\"\">Ability to work as a teammate in a fast-paced team</li>\n<li style=\"\">Experience with software testing and continuous integration</li>\n<li style=\"\">Eye for detail</li>\n<li style=\"\">Good English skills written and spoken</li>\n</ul>\n<div class=\"h4\" style=\"border: 0px; font-variant-numeric: inherit; font-variant-east-asian: inherit; font-variant-alternates: inherit; font-variant-position: inherit; font-stretch: inherit; line-height: 30px; font-optical-sizing: inherit; font-kerning: inherit; font-feature-settings: inherit; font-variation-settings: inherit; margin: 0px auto 26px; padding: 0px; vertical-align: baseline; -webkit-font-smoothing: antialiased; background-color: #ffffff; text-align: left;\"> </div>\n<div class=\"h4\" style=\"border: 0px; font-variant-numeric: inherit; font-variant-east-asian: inherit; font-variant-alternates: inherit; font-variant-position: inherit; font-stretch: inherit; line-height: 30px; font-optical-sizing: inherit; font-kerning: inherit; font-feature-settings: inherit; font-variation-settings: inherit; margin: 0px auto 26px; padding: 0px; vertical-align: baseline; -webkit-font-smoothing: antialiased; background-color: #ffffff; text-align: left;\">Knowledge of</div>\n<ul style=\"\">\n<li style=\"\">Software design patterns</li>\n<li style=\"\">React</li>\n<li style=\"\">Typescript</li>\n<li style=\"\">React hooks</li>\n<li style=\"\">React Query</li>\n<li style=\"\">Jest/Cypress</li>\n<li style=\"\">GraphQL</li>\n<li style=\"\">Micro-Frontend architecture</li>\n<li style=\"\">Webpack</li>\n<li style=\"\">IndexedDB</li>\n</ul>\n<div class=\"h4\" style=\"border: 0px; font-variant-numeric: inherit; font-variant-east-asian: inherit; font-variant-alternates: inherit; font-variant-position: inherit; font-stretch: inherit; line-height: 30px; font-optical-sizing: inherit; font-kerning: inherit; font-feature-settings: inherit; font-variation-settings: inherit; margin: 0px auto 26px; padding: 0px; vertical-align: baseline; -webkit-font-smoothing: antialiased; background-color: #ffffff; text-align: left;\"> </div>\n<div class=\"h4\" style=\"border: 0px; font-variant-numeric: inherit; font-variant-east-asian: inherit; font-variant-alternates: inherit; font-variant-position: inherit; font-stretch: inherit; line-height: 30px; font-optical-sizing: inherit; font-kerning: inherit; font-feature-settings: inherit; font-variation-settings: inherit; margin: 0px auto 26px; padding: 0px; vertical-align: baseline; -webkit-font-smoothing: antialiased; background-color: #ffffff; text-align: left;\">Nice to have</div>\n<ul style=\"\">\n<li style=\"\">5+ years JavaScript experience</li>\n<li style=\"\">Knowledge of blockchain technologies (Ethereum, IPFS, Filecoin, etc)</li>\n<li style=\"\">Experience in open source projects</li>\n<li style=\"\">A university degree in information technology</li>\n</ul>\n<div class=\"h4\" style=\"border: 0px; font-variant-numeric: inherit; font-variant-east-asian: inherit; font-variant-alternates: inherit; font-variant-position: inherit; font-stretch: inherit; line-height: 30px; font-optical-sizing: inherit; font-kerning: inherit; font-feature-settings: inherit; font-variation-settings: inherit; margin: 0px auto 26px; padding: 0px; vertical-align: baseline; -webkit-font-smoothing: antialiased; background-color: #ffffff; text-align: left;\"> </div>\n<div class=\"h4\" style=\"border: 0px; font-variant-numeric: inherit; font-variant-east-asian: inherit; font-variant-alternates: inherit; font-variant-position: inherit; font-stretch: inherit; line-height: 30px; font-optical-sizing: inherit; font-kerning: inherit; font-feature-settings: inherit; font-variation-settings: inherit; margin: 0px auto 26px; padding: 0px; vertical-align: baseline; -webkit-font-smoothing: antialiased; background-color: #ffffff; text-align: left;\">What We Offer</div>\n<ul style=\"\">\n<li style=\"\">The opportunity to make a positive impact in the world</li>\n<li style=\"\">A meaningful job in a young, dynamic and friendly team</li>\n<li style=\"\">A work environment inspiring excellence and creativity</li>\n<li style=\"\">Competitive compensation based on experience and performance</li>\n<li style=\"\">The chance to play with ideas that could reshape entire industries</li>\n<li style=\"\">Continuous learning opportunities and unique challenges to take on</li>\n<li style=\"\">Traveling opportunities to various blockchain events and conferences</li>\n<li style=\"\">Flexible schedule</li>\n</ul>\n<div class=\"h4\" style=\"border: 0px; font-variant-numeric: inherit; font-variant-east-asian: inherit; font-variant-alternates: inherit; font-variant-position: inherit; font-stretch: inherit; line-height: 30px; font-optical-sizing: inherit; font-kerning: inherit; font-feature-settings: inherit; font-variation-settings: inherit; margin: 0px auto 26px; padding: 0px; vertical-align: baseline; -webkit-font-smoothing: antialiased; background-color: #ffffff; text-align: left;\"> </div>\n<div class=\"h4\" style=\"border: 0px; font-variant-numeric: inherit; font-variant-east-asian: inherit; font-variant-alternates: inherit; font-variant-position: inherit; font-stretch: inherit; line-height: 30px; font-optical-sizing: inherit; font-kerning: inherit; font-feature-settings: inherit; font-variation-settings: inherit; margin: 0px auto 26px; padding: 0px; vertical-align: baseline; -webkit-font-smoothing: antialiased; background-color: #ffffff; text-align: left;\">The Company</div>\n<p style=\"border: 0px; font-variant-numeric: inherit; font-variant-east-asian: inherit; font-variant-alternates: inherit; font-variant-position: inherit; font-stretch: inherit; line-height: 30px; font-optical-sizing: inherit; font-kerning: inherit; font-feature-settings: inherit; font-variation-settings: inherit; margin: 0px auto 26px; padding: 0px; vertical-align: baseline; -webkit-font-smoothing: antialiased; background-color: #ffffff; text-align: left;\">Together with a group of independent thinkers hacking under the Swiss AKASHA Foundation umbrella, we are bravely experimenting with new technologies in the search for solutions that can transform the Web into an ecosystem in service of humanity.</p>\n<p style=\"border: 0px; font-variant-numeric: inherit; font-variant-east-asian: inherit; font-variant-alternates: inherit; font-variant-position: inherit; font-stretch: inherit; line-height: 30px; font-optical-sizing: inherit; font-kerning: inherit; font-feature-settings: inherit; font-variation-settings: inherit; margin: 0px auto 26px; padding: 0px; vertical-align: baseline; -webkit-font-smoothing: antialiased; background-color: #ffffff; text-align: left;\">On this note, we are an equal opportunity employer and value diversity at our company. We do not discriminate on the basis of race, religion, color, national origin, gender, sexual orientation, age, marital status, veteran status, or disability status.</p>\n<p style=\"border: 0px; font-variant-numeric: inherit; font-variant-east-asian: inherit; font-variant-alternates: inherit; font-variant-position: inherit; font-stretch: inherit; line-height: 30px; font-optical-sizing: inherit; font-kerning: inherit; font-feature-settings: inherit; font-variation-settings: inherit; margin: 0px auto 26px; padding: 0px; vertical-align: baseline; -webkit-font-smoothing: antialiased; background-color: #ffffff; text-align: left;\">What's meaningful to us is being a friendly, passionate person resonating with our purpose and genuinely interested in doing a phenomenal job towards a better world through technology, while also having fun along the way :)</p>\n<div class=\"h4\" style=\"border: 0px; font-variant-numeric: inherit; font-variant-east-asian: inherit; font-variant-alternates: inherit; font-variant-position: inherit; font-stretch: inherit; line-height: 30px; font-optical-sizing: inherit; font-kerning: inherit; font-feature-settings: inherit; font-variation-settings: inherit; margin: 0px auto 26px; padding: 0px; vertical-align: baseline; -webkit-font-smoothing: antialiased; background-color: #ffffff; text-align: left;\">Everyone's Welcome</div>\n<p style=\"border: 0px; font-variant-numeric: inherit; font-variant-east-asian: inherit; font-variant-alternates: inherit; font-variant-position: inherit; font-stretch: inherit; line-height: 30px; font-optical-sizing: inherit; font-kerning: inherit; font-feature-settings: inherit; font-variation-settings: inherit; margin: 0px auto 26px; padding: 0px; vertical-align: baseline; -webkit-font-smoothing: antialiased; background-color: #ffffff; text-align: left;\">Don't tick every box for this role but still think you'd be a great fit for our team? We'd love to hear from you! Just shoot us your application and let us know how you can make a difference at AKASHA. We're all about fresh ideas and new perspectives, so tell us about yours. Can't wait to see what you bring to the table!</p>\n<img src=\"https://remotive.com/job/track/1891624/blank.gif?source=public_api\" alt=\"\"/>","tags":"[\"frontend\",\"graphql\",\"javascript\",\"react\",\"open source\",\"blockchain\",\"Ethereum\",\"Typescript \",\"cypress\",\"testing\",\"diversity\",\"information technology\",\"Webpack\",\"jest\"]","pubDate":"2024-01-19 06:59:24.000","link":"https://remotive.com/remote-jobs/software-dev/javascript-developer-1891624","savedDate":"2024-01-22 07:26:00.414","slug":"javascript-developer-akasha-9837"}]