[{"id":3451786615,"title":"Community Moderator","company":"Supraoracles","image":"https://remotive.com/job/1958481/logo","description":"<div class='\"content-intro\"'>\n<div class=\"h1\"><strong>Who We Are</strong></div>\n<p>Supra is pioneering the future of information services in global markets. As an exciting, ambitious, and well-funded startup with unique technical capabilities, we aim to be a future leader in decentralized data. Our team includes professionals, academics, and advisors with experience from leading institutions such as Purdue University, University of Cambridge, University of Pennsylvania, Columbia University, and University of Oxford. Additionally, our industry experience includes prestigious companies like JPMorgan Chase &amp; Co., Qualcomm, ConsenSys, and Binance. Based in Switzerland with a remote-first policy, our globally distributed team spans over 35 countries. We are dedicated to solving the Oracle Dilemma through innovative solutions in consensus mechanisms, real-time data services, decentralized finance (DeFi), and Layer 1 (L1) technologies.</p>\n<p>Trust, kindness, honesty, and a commitment to ethical, decentralized technologies are the cornerstones of our culture.</p>\n<p> </p>\n</div>\n<div class=\"h1\"><strong>Who We Are</strong></div>\n<p>Supra is pioneering the future of information services in global markets. As an exciting, ambitious, and well-funded startup with unique technical capabilities, we aim to be a future leader in decentralized data. Our team includes professionals, academics, and advisors with experience from leading institutions such as Purdue University, the University of Cambridge, the University of Pennsylvania, Columbia University, and the University of Oxford.</p>\n<p>Additionally, our industry experience includes prestigious companies like JPMorgan Chase &amp; Co., Qualcomm, ConsenSys, and Binance. Based in Switzerland with a remote-first policy, our globally distributed team spans over 35 countries. We are dedicated to solving the Oracle Dilemma through innovative solutions in consensus mechanisms, real-time data services, decentralized finance (DeFi), and Layer 1 (L1) technologies.</p>\n<p>Trust, kindness, honesty, and a commitment to ethical, decentralized technologies are the cornerstones of our culture.</p>\n<div class=\"h1\"><strong>What we're looking for</strong></div>\n<p>Our team is looking for a talented and experienced community lead to help grow and engage our community. You’ll establish strong relationships with the community through various initiatives and community support. The candidate will have an opportunity to interact with the brightest Cryptography researchers and work with highly talented teammates while nurturing a growing blockchain community. The candidate will get to apply their growth strategies for our community while contributing to the establishment of an industry-leading customer success program.<br><br></p>\n<p><strong>Responsibilities</strong></p>\n<ul style=\"\">\n<li style=\"\">Moderate and ensure that the rules of our various social platforms are followed.</li>\n<li style=\"\">Manage Discord/Telegram channels and execute community initiatives</li>\n<li style=\"\">Pleasantly engage with users and ensure a productive active environment.</li>\n<li style=\"\">Troubleshoot and assist with bots, integrations, and other technical dependencies for Discord/Telegram.</li>\n<li style=\"\">Engage in building camaraderie with our user base by having genuine interactions with people.</li>\n<li style=\"\">Provide community support through Discord/Telegram</li>\n<li style=\"\">Provide support through a support ticketing system for various products</li>\n</ul>\n<div class=\"h2\"><strong>Are you the right person for this role?</strong></div>\n<p>The ideal candidate for us has:</p>\n<ul style=\"\">\n<li style=\"\">Experience building and managing communities </li>\n<li style=\"\">Experience engaging with Web3 communities</li>\n<li style=\"\">Experience setting up Discord/Telegram bots</li>\n<li style=\"\">Experience in customer service/success</li>\n<li style=\"\">Excellent written and verbal communication skills</li>\n<li style=\"\">Ability to communicate effectively and be conscientious. </li>\n</ul>\n<p><br><br><br></p>\n<div class='\"content-conclusion\"'>\n<div class=\"h1\"><strong>What's In It For You</strong></div>\n<p>Joining Supra means joining a fast-growing startup with a diverse and dynamic team. Every role is impactful, allowing you to engage in meaningful work that contributes to our success.</p>\n<p>You will enjoy the flexibility of a fully remote environment with adaptable working hours, enabling you to work from anywhere globally.</p>\n<ul style=\"\">\n<li style=\"\"><strong>Competitive Compensation:</strong> We offer competitive compensation packages aligned with market standards.</li>\n<li style=\"\"><strong>Work-Life Balance:</strong> Eligible team members have access to flexible paid time off, sick leave, and other time-off options, adjusted in line with local regulations.</li>\n<li style=\"\"><strong>National Holidays:</strong> We recognize national holidays specific to each team member’s country and provide paid leave in accordance with local guidelines.</li>\n<li style=\"\"><strong>Health Benefits:</strong> Comprehensive health coverage options, including medical, dental, and vision benefits, are available to full-time employees where applicable.</li>\n</ul>\n<p><strong>Getting Started with Supra</strong></p>\n<p>We believe in giving you the space to settle in. Your first month is about orientation and learning:</p>\n<ul style=\"\">\n<li style=\"\">Engage with your team to understand our business, vision, mission, and strategic goals.</li>\n<li style=\"\">Enhance your skills to navigate the evolving DeFi landscape.</li>\n<li style=\"\">Absorb our core values and establish connections with your colleagues through one-on-one meetings.</li>\n<li style=\"\">Familiarize yourself with the tools and processes vital to our operations.</li>\n<li style=\"\">Analyze our product offerings and contribute to discussions that shape our future.</li>\n</ul>\n<p>We're here to support your integration and ensure you have the resources you need!</p>\n<p><strong>Looking Ahead</strong></p>\n<p>Regular check-ins with your manager will help align your priorities with our team and company goals, setting you up for success. At Supra, you're not just joining a company but embarking on a journey to enhance blockchain technology with a team of exceptional individuals.</p>\n</div>\n<img src=\"https://remotive.com/job/track/1958481/blank.gif?source=public_api\" alt=\"\"/>","tags":"[\"community management\"]","pubDate":"2024-12-20T19:50:51.000Z","link":"https://remotive.com/remote-jobs/customer-support/community-moderator-1958481","slug":"community-moderator-supraoracles-6667"}]