[{"id":8997265998,"title":"Staff Software Test Automation Engineer","company":"Aiwyn","image":"https://media.licdn.com/dms/image/v2/D4E0BAQEvDOFt9VDmfg/company-logo_200_200/company-logo_200_200/0/1714673337921/aiwyn_logo?e=1743033600&v=beta&t=0yqXd-p9YeUPxD_oaEkvrGENa6XLG5S4Q4dDXCettEY","description":"<div><b>Who is Aiwyn and what do we do?</b></div><div><br></div><div>Aiwyn is the fastest-growing software company serving the accounting profession.&nbsp;Founded in 2020, we now work with 100+ of the largest CPA firms in the world.&nbsp;Our “Job to be done”: speed up cash flow, save Partner time, &amp; deliver best-in-class client experiences. We do this by automating day-to-day firm operations with our Practice Automation solutions. Aiwyn is led by serial entrepreneurs with multiple exits and funded by top-tier investors (Bessemer, KKR, &amp; Revolution). We're passionate about building a remarkable company with world-class people, processes, and technology.</div><div><br></div><div>To learn more, visit our <b><a rel=\"noopener noreferrer\" class=\"postings-link\" href=\"https://aiwyn.ai/\">website</a></b></div><div><br></div><div><b>Who You Are:</b></div><div><br></div><div>You are a highly skilled and experienced automation engineer who excels at designing and scaling <b>test automation frameworks</b>. You have a deep understanding of <b>CI/CD integration</b>, <b>test strategy development</b>, and <b>best practices in automation</b>. Your expertise allows you to drive automation initiatives, improve test coverage, and help mentor the QA team in automation methodologies. You are passionate about increasing efficiency and ensuring the team has the tools and processes in place to maintain high software quality. You are self-driven and will consider how what you are working on can best serve future iterations. You have helped transition manual quality assurance teams to automated testing in the past.</div><div><b>Who is Aiwyn and what do we do?</b></div><div><br></div><div>Aiwyn is the fastest-growing software company serving the accounting profession.&nbsp;Founded in 2020, we now work with 100+ of the largest CPA firms in the world.&nbsp;Our “Job to be done”: speed up cash flow, save Partner time, &amp; deliver best-in-class client experiences. We do this by automating day-to-day firm operations with our Practice Automation solutions. Aiwyn is led by serial entrepreneurs with multiple exits and funded by top-tier investors (Bessemer, KKR, &amp; Revolution). We're passionate about building a remarkable company with world-class people, processes, and technology.</div><div><br></div><div>To learn more, visit our <b><a href=\"https://aiwyn.ai/\" class=\"postings-link\" target=\"_blank\" rel=\"noopener noreferrer\">website</a></b></div><div><br></div><div><b>Who You Are:</b></div><div><br></div><div>You are a highly skilled and experienced automation engineer who excels at designing and scaling <b>test automation frameworks</b>. You have a deep understanding of <b>CI/CD integration</b>, <b>test strategy development</b>, and <b>best practices in automation</b>. Your expertise allows you to drive automation initiatives, improve test coverage, and help mentor the QA team in automation methodologies. You are passionate about increasing efficiency and ensuring the team has the tools and processes in place to maintain high software quality. You are self-driven and will consider how what you are working on can best serve future iterations. You have helped transition manual quality assurance teams to automated testing in the past.</div><h3>Key Responsibilities:</h3><li>Lead efforts to design, develop, and maintain <b>Playwright automation frameworks</b>.</li><li>Help make improvements to an existing <b>Playwright</b> Test Automation Suite.</li><li>Establish and enforce <b>automation coding standards</b> to ensure maintainability and efficiency.</li><li>Develop strategies to <b>reduce manual testing efforts</b> and increase test automation coverage.</li><li>Work closely with DevOps to <b>integrate automated testing into the CI/CD pipeline</b>.</li><li>Perform <b>database testing</b> using SQL to ensure data integrity and accuracy.</li><li>Dive deeply into our existing application to gain a thorough understanding of how it works.</li><li>Drive <b>automation backlog reduction</b>, ensuring high-priority test coverage.</li><li>Conduct <b>email and payment testing</b>, verifying transactions with Stripe.</li><li>Create and maintain <b>comprehensive test documentation</b>, including automation strategies and best practices.</li><li>Generate reports on <b>test coverage, defect trends, and automation progress</b> using TestRail.</li><li>Mentor and guide <b>QA team members</b> in automation best practices and coding standards.</li><li>Work closely with the QA Lead to achieve the best outcomes for the QA department.</li><h3>What We Need:</h3><li><b>Automation Expertise</b>: Extensive experience building and maintaining automation frameworks in <b>Playwright</b>.</li><li><b>CI/CD &amp; DevOps Knowledge</b>: Experience integrating automation into <b>GitHub and CI/CD pipelines</b>.</li><li><b>SQL Proficiency</b>: Ability to perform <b>database validation</b> and execute queries for data integrity.</li><li><b>Technical Leadership</b>: Ability to <b>set automation standards</b>, define best practices, and drive team-wide improvements.</li><li><b>Problem-Solving Skills</b>: Strong analytical skills to identify inefficiencies and propose automation solutions.</li><li><b>Reporting and Documentation</b>: Ability to track test coverage and generate automation reports.</li><li><b>Mentorship Skills</b>: Experience training and coaching QA team members on automation best practices.</li><li><b>Startup Experience</b>: Ability to <b>thrive in a fast-paced startup environment</b>, adapting quickly to changing priorities and tight deadlines.</li><h3>Qualifications:</h3><li><b>Payment Systems Testing</b>: Strong experience with <b>Stripe transaction validation</b>.</li><li><b>Google Cloud SDK</b>: Familiarity with authentication testing and identity management.</li><li><b>Accounting Knowledge</b>: Understanding of financial workflows and Practice Management software.</li><li><b>Industry Experience</b>: 8+ years in test automation with a focus on <b>scaling and optimizing test frameworks</b>.</li><div><b>Why Work at Aiwyn?</b></div><div><br></div><div>The big-picture value proposition of this role is simple: join us, and you'll be paid competitively to have freedom in solving worthwhile, challenging problems alongside other A-players at a fast-growing SaaS startup led by an experienced and successful team with industry experience.</div><div><br></div><div>Other benefits include:</div><div><b>Adventure travel stipend</b> - you receive a $1,000 travel reimbursement on your work anniversary each year. We encourage our team to recharge and explore the world beyond their home office walls.</div><div><b>Remote, work-from-anywhere culture</b></div><div><b>Flexible PTO</b></div><div><b>World Class health benefits</b> - we believe in fostering flourishing teams by providing benefits that go beyond the usual standards - Health, vision, dental, HSA/FSA, and mental health support.</div><div><b>Stock options</b> - every Full Time Employee has ownership in Aiwyn's future and success.</div><div><b>401(k) matching</b></div><div><br></div><div>Our Values:</div><div><b>Trust</b> - We champion transparency, welcome differing perspectives, uphold accountability, and trust that others have good intentions</div><div><b>Courage</b> - We have the courage to take calculated risks and embrace change, knowing what worked in the past won’t always work in the future</div><div><b>Impact</b> - Rooted in determination and innovation, we chase extraordinary outcomes and impactful results</div><div><b>Relentlessness</b> - We approach challenges with an unwavering resolve, never settling for mediocrity, and always striving to surpass expectations</div><div><br></div><div>Learn more about Aiwyn:</div><div><a rel=\"noopener noreferrer\" class=\"postings-link\" href=\"https://www.aiwyn.ai/about\"><b>About us</b></a></div><div><a rel=\"noopener noreferrer\" class=\"postings-link\" href=\"https://www.aiwyn.ai/why-aiwyn\"><b>Why Aiwyn</b></a></div><div><a rel=\"noopener noreferrer\" class=\"postings-link\" href=\"https://www.youtube.com/@AiwynAI\"><b>YouTube page</b></a></div>","tags":"[\"management\",\"database\"]","pubDate":"2025-03-13T19:44:53.708Z","link":"https://jobs.lever.co/aiwyn/5a9b05dd-3d82-41e5-9b75-5a8d73429195","slug":"staff-software-test-automation-engineer-aiwyn-1443"},{"id":1062976221,"title":"PL Engenharia de Software Full Stack (React Native) | Afirmativa para Pessoas com Deficiência (PCD)","company":"ília","image":"https://avatars.githubusercontent.com/u/35933823?s=200&v=4","description":"&lt;p&gt;&lt;strong data-start=&quot;478&quot; data-end=&quot;554&quot;&gt;Essa é uma vaga afirmativa exclusiva para pessoas com deficiência (PCD).&lt;/strong&gt; Aqui na ília, valorizamos a diversidade e acreditamos no poder da inclusão para construir times mais fortes e inovadores. Estamos comprometidos em criar um ambiente acessível, acolhedor e respeitoso para todas as pessoas.&lt;/p&gt;\n&lt;h3&gt;&lt;strong&gt;Sobre a ília&lt;/strong&gt;&lt;/h3&gt;\n&lt;p&gt;Somos especialistas em tecnologia, dados e design, impulsionando a transformação digital de grandes players do mercado há mais de 10 anos, nos setores financeiro, seguros e mobilidade. Com mais de 450 profissionais, estamos presentes no Brasil e Europa, atendendo aos mercados da América Latina, Europa e América do Norte, desenvolvendo produtos digitais de alta qualidade e com foco em resultados de negócios. Somos uma equipe inovadora, criativa e apaixonada por tecnologia.&amp;nbsp;&lt;/p&gt;\n&lt;p&gt;Certificada pelo 5° ano consecutivo como Great Place to work aqui na ília acreditamos que pessoas mudam o mundo, e investimos nelas. Nossas awesome deliveries são feitas de pessoas para pessoas, afinal awesome people make awesome deliveries!&amp;nbsp;&lt;/p&gt;\n&lt;p&gt;#Vempraília!&lt;/p&gt;\n&lt;h3&gt;&lt;strong&gt;Sobre a Vaga:&lt;/strong&gt;&lt;/h3&gt;\n&lt;ul&gt;\n&lt;li&gt;Colaborar com equipes multifuncionais para definir, projetar e lançar novos recursos;&lt;/li&gt;\n&lt;li&gt;Elaborar e conduzir refinamentos técnicos de demandas trazidas pelo time de produtos;&lt;/li&gt;\n&lt;li&gt;Atuar na manutenção da saúde e qualidade do codebase, equilibrando novas funcionalidades com resolução de débitos técnicos;&lt;/li&gt;\n&lt;li&gt;Desenvolver soluções escaláveis e que irão ser utilizadas por milhões de usuários;&lt;/li&gt;\n&lt;li&gt;Ser crítico em relação a Observabilidade;&lt;/li&gt;\n&lt;li&gt;Atuar na manutenção dos testes automatizados, incluindo criação de novos;&lt;/li&gt;\n&lt;li&gt;Orientar desenvolvedores de menor senioridade e auxiliar no desenvolvimento destes;&lt;/li&gt;\n&lt;li&gt;Elaboração de documentação técnica de novas funcionalidades;&lt;/li&gt;\n&lt;li&gt;Traduzir designs em código de alta qualidade;&lt;/li&gt;\n&lt;li&gt;Participar das cerimônias junto com os demais integrantes da equipe.&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp;&amp;nbsp;&lt;/li&gt;\n&lt;/ul&gt;\n&lt;h3&gt;&lt;strong&gt;Requisitos:&amp;nbsp;&lt;/strong&gt;&lt;/h3&gt;\n&lt;ul&gt;\n&lt;li&gt;Experiência com Java 17 (11, 8), Spring Boot e Hibernate;&lt;/li&gt;\n&lt;li&gt;Experiência com NodeJS + NestJS;&lt;/li&gt;\n&lt;li&gt;Experiência Bancos de Dados (SQL e NoSQL), Oracle , MongoDB, RDS;&amp;nbsp;&lt;/li&gt;\n&lt;li&gt;Compreensão e entendimento de arquitetura de microsserviços;&lt;/li&gt;\n&lt;li&gt;Experiência com Design de APIs REST;&lt;/li&gt;\n&lt;li&gt;Experiência com Testes Unitários (jUnit 5), Integração e Contrato;&lt;/li&gt;\n&lt;li&gt;Experiência com Axway - API Gateway;&lt;/li&gt;\n&lt;li&gt;Experiência com Git e Versionamento de Código;&lt;/li&gt;\n&lt;li&gt;Experiência com comunicação por mensageria (RabbitMQ e SQS);&lt;/li&gt;\n&lt;li&gt;Experiência com Grafana e Dynatrace;&lt;/li&gt;\n&lt;li&gt;Conhecimento de Clean Code, Clean Architecture e Modularização;&lt;/li&gt;\n&lt;li&gt;Boas práticas de código, documentação e desenvolvimento de telas e componentes;&lt;/li&gt;\n&lt;li&gt;Experiência com em metodologias ágeis;&lt;/li&gt;\n&lt;li&gt;Experiência com Selenium + Cucumber ou framework&lt;/li&gt;\n&lt;/ul&gt;\n&lt;h3&gt;&amp;nbsp;&lt;/h3&gt;\n&lt;h3&gt;&lt;strong&gt;Benefícios e Incentivos:&lt;/strong&gt;&lt;/h3&gt;\n&lt;p&gt;Nossa contratação é CLT- 40h semanais com jornada flexível, sendo executada 100% de forma remota. Os benefícios da ília são pensados para proporcionar uma experiência AWESOME para cada ílian, abaixo você encontra os benefícios de forma resumida.&amp;nbsp;&lt;/p&gt;\n&lt;p&gt;&lt;em&gt;Para Saúde e bem-estar:&lt;/em&gt;&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;Plano de Saúde e Odontológico SulAmérica extensivo a dependentes;&lt;/li&gt;\n&lt;li&gt;Vale Alimentação/Refeição em cartão fléxivel Picpay benefíciosSeguro de Vida;&lt;/li&gt;\n&lt;li&gt;Auxílio Home-Office em cartão fléxivel Picpay benefícios;&lt;/li&gt;\n&lt;li&gt;Wellhub (Gympass);&lt;/li&gt;\n&lt;li&gt;TotalPass.&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;&lt;em&gt;Para o seu Desenvolvimento:&lt;/em&gt;&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;ília University: Universidade Corporativa com mais de 20 mil cursos disponíveis para desenvolvimento pessoal e profissional;&lt;/li&gt;\n&lt;li&gt;Language Academy: Escola de idiomas para ílians;&lt;/li&gt;\n&lt;li&gt;í-talks e Chapter: Momentos e cerimônias em que o time compartilha práticas, estudos, projetos e ideias. Nas chapters ainda se reúnem pessoas com skills similares para compartilhamento de ideias, práticas e experiências;&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;&lt;em&gt;Gostamos de ir além no cuidado com as nossas pessoas, então dispomos também de alguns benefícios não convencionais:&lt;/em&gt;&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;Plano de Saúde PET - Guapeco;&lt;/li&gt;\n&lt;li&gt;Seu Niver, seu bolo!&lt;/li&gt;\n&lt;li&gt;Seu Networking Vale Prêmio -&amp;nbsp;Programa de premiação a indicação de novos funcionários.&lt;/li&gt;\n&lt;/ul&gt;","tags":"[\"finance\",\"mongo\"]","pubDate":"2025-03-13T18:23:21.000Z","link":"https://job-boards.greenhouse.io/ilia/jobs/5408880004","slug":"pl-engenharia-de-software-full-stack-react-native-afirmativa-para-pessoas-com-defici-ncia-pcd-lia-9319"},{"id":4364986162,"title":"Frontend Engineer","company":"Atticus","image":"https://media.licdn.com/dms/image/v2/D560BAQHWkZ4dfdnqcQ/company-logo_200_200/company-logo_200_200/0/1667241664749/atticushq_logo?e=1743033600&v=beta&t=IKimC8hb4UT-bQFVefDOJ5jfW_yxRN7of8ZLj5GtZ4Q","description":"<h1> <strong>About Atticus</strong></h1><p style=\"min-height:1.5em\">At any given time, 16 million Americans are experiencing a crisis that requires urgent help from our legal system or government. The right assistance could transform their lives. But today, most never get it. </p><p style=\"min-height:1.5em\">Atticus makes it easy for any sick or injured person in crisis to get the life-changing aid they deserve. In just three years, we’ve become the leading platform connecting people with disabilities to government benefits. We also help victims of accidents, misconduct, and violence get compensation from insurance. So far, we’ve gotten thousands of people access to over $2B in life-changing aid, and we’re just getting started.</p><p style=\"min-height:1.5em\">We've helped more than 20,000 people in need (see our <a target=\"_blank\" rel=\"noopener noreferrer nofollow\" href=\"https://www.trustpilot.com/review/atticus.com\">12,000+ five-star reviews</a>) and raised more than $50 million from top VC firms like Forerunner, GV (Google Ventures), and True Ventures. (We just closed our Series B round in May 2023, so we're well-funded for the foreseeable future.) We're small but moving fast — our team grew from 89 to 151 last year and we expect to grow again in 2025.</p><p style=\"min-height:1.5em\"></p><h2>The Job</h2><p style=\"min-height:1.5em\">Atticus works in an industry dominated by outdated technology that is ripe for fresh thinking: our core competitors rely on massive call centers to screen clients, antiquated CRMs to track and manage cases, and paper checks to get paid (provided they’re sent to the right address). </p><p style=\"min-height:1.5em\">Conversely, as a VC-backed tech company our product &amp; engineering department powers everything we do: from creating an engaging online experience for people in crisis to providing tools for our network lawyers as they serve our clients, Atticus relies on technology to fulfill our mission. </p><p style=\"min-height:1.5em\">We’re looking for Software Engineers to join our team. You’ll work on the front-end, and will partner with every department at Atticus as we continue to grow our platform to help people in need find trusted legal support.  </p><p style=\"min-height:1.5em\"></p><h2><strong>What You'll Do:</strong></h2><ul style=\"min-height:1.5em\"><li><p style=\"min-height:1.5em\">Design, build and operate Atticus’ front-end applications written in React with a focus on performance, modularity, extensibility, and reliability.</p></li><li><p style=\"min-height:1.5em\">Work with product and software architects to plan and deliver features, fixes, and performance enhancements</p></li><li><p style=\"min-height:1.5em\">Leverage your peers as multipliers for your skills to create excellent products and services.</p></li></ul><p style=\"min-height:1.5em\">The role is a rare opportunity to join a fast-growing Series B startup that doubles as a B-corp social enterprise. Every project you take on will help clients in need get the help they deserve, and you’ll shape our company culture as we scale. We’re looking for engineers who are excited about our mission and the challenges it entails.</p><p style=\"min-height:1.5em\"></p><h2><strong>Qualifications</strong></h2><p style=\"min-height:1.5em\">Required:</p><ul style=\"min-height:1.5em\"><li><p style=\"min-height:1.5em\">You have 3+ years of experience writing idiomatic JavaScript/ Node.js</p></li><li><p style=\"min-height:1.5em\">You have experience and love for building React applications</p></li><li><p style=\"min-height:1.5em\">You speak CSS and HTML</p></li><li><p style=\"min-height:1.5em\">You enjoy working with UI and UX experts to build compelling user experiences</p></li><li><p style=\"min-height:1.5em\">You use a modern version-control system for your source code repository (Git, Mercurial, GitHub, BitBucket).</p></li><li><p style=\"min-height:1.5em\">You lint all your code or know you should.</p></li><li><p style=\"min-height:1.5em\">You know what parts of your code require tests and you write those tests.</p></li><li><p style=\"min-height:1.5em\">You are versed in cloud computing systems (GCP, AWS, etc.) and SAAS concepts.</p></li></ul><p style=\"min-height:1.5em\">Bonus / Nice-to-Have</p><ul style=\"min-height:1.5em\"><li><p style=\"min-height:1.5em\">You have experience with Golang, Java, Python, Scala, or Ruby</p></li><li><p style=\"min-height:1.5em\">You like working or want to work with Google Cloud Platform, Kubernetes, Docker, Git, Golang, Java</p></li><li><p style=\"min-height:1.5em\">You are well versed in working with or want to work with GraphQL, GraphQL Federation, REST APIs and supporting network protocols</p></li><li><p style=\"min-height:1.5em\">You can read or build a Webpack configuration</p></li></ul><p style=\"min-height:1.5em\">We are strongly committed to building a diverse team. If you’re from a background that’s underrepresented in tech, we’d love to meet you.</p><p style=\"min-height:1.5em\"></p><h2><strong>Salary &amp; Benefits</strong></h2><p style=\"min-height:1.5em\">This is a rare opportunity to join a startup that has strong traction (substantial funding, well-respected backers, tremendous growth, and many happy customers) but is still small enough that you can have a huge impact and play a role in shaping our culture.</p><p style=\"min-height:1.5em\">We’re a certified B Corporation tackling a critical social problem. Our mission to help people in need drives everything we do, and your work here will touch many lives.</p><p style=\"min-height:1.5em\">We offer competitive pay — including equity — and generous benefits:</p><ul style=\"min-height:1.5em\"><li><p style=\"min-height:1.5em\">Medical and dental insurance with 100% of employee premiums covered</p></li><li><p style=\"min-height:1.5em\">15 vacation days &amp; 16 paid holidays each year</p></li><li><p style=\"min-height:1.5em\">Free membership to OneMedical</p></li><li><p style=\"min-height:1.5em\">$1,000/year reimbursable stipend for education and training outside of work </p></li><li><p style=\"min-height:1.5em\">$600/year reimbursable stipend for internet service</p></li><li><p style=\"min-height:1.5em\">Up to $1,200/year student loan repayment assistance</p></li><li><p style=\"min-height:1.5em\">401(k) and optional HSA</p></li><li><p style=\"min-height:1.5em\">Free snacks, drinks, weekly lunches, and regular team dinners/events/retreats</p></li><li><p style=\"min-height:1.5em\">Humble, thoughtful, smart, fun colleagues</p></li></ul><p style=\"min-height:1.5em\">We anticipate the base salary band for this role will be between $115,000 and $180,000 in addition to equity and benefits. The salary at offer will be determined by a number of factors such as candidate’s experience, knowledge, skills and abilities, as well as internal equity among our team.</p><p style=\"min-height:1.5em\"></p><h2><strong>Location </strong></h2><p style=\"min-height:1.5em\">Today, about half of our team are in Los Angeles and half are fully remote and spread across the U.S. There are two options for this job:</p><ol style=\"min-height:1.5em\"><li><p style=\"min-height:1.5em\">Live in Los Angeles, work a few days a week (or more) out of our beautiful office in the Arts District.</p></li><li><p style=\"min-height:1.5em\">Live wherever, work remotely (Ideally PST hours), and travel to LA (on the company dime) as needed to be with your colleagues —somewhere between monthly and quarterly.</p></li></ol><p style=\"min-height:1.5em\">In short: You can do this job well remotely, and we’re committed to empowering everyone with flexibility. But we care a lot about building a great culture and we think some interactions need to happen in person, so we put a lot of thought into retreats, offsites, and other ways to gather.</p>","tags":"[\"javascript\",\"engineering\",\"legal\",\"aws\"]","pubDate":"2025-03-13T17:14:43.657Z","link":"https://jobs.ashbyhq.com/atticus/efa8c205-bafd-4feb-b4b4-f6dbd582ef77","slug":"frontend-engineer-atticus-5839"},{"id":8507676970,"title":"Backend Engineer","company":"Atticus","image":"https://media.licdn.com/dms/image/v2/D560BAQHWkZ4dfdnqcQ/company-logo_200_200/company-logo_200_200/0/1667241664749/atticushq_logo?e=1743033600&v=beta&t=IKimC8hb4UT-bQFVefDOJ5jfW_yxRN7of8ZLj5GtZ4Q","description":"<h1><strong>About Atticus</strong></h1><p style=\"min-height:1.5em\">At any given time, 16 million Americans are experiencing a crisis that requires urgent help from our legal system or government. The right assistance could transform their lives. But today, most never get it. </p><p style=\"min-height:1.5em\">Atticus makes it easy for any sick or injured person in crisis to get the life-changing aid they deserve. In just three years, we’ve become the leading platform connecting people with disabilities to government benefits. We also help victims of accidents, misconduct, and violence get compensation from insurance. So far, we’ve gotten thousands of people access to over $2B in life-changing aid, and we’re just getting started.</p><p style=\"min-height:1.5em\">We've helped more than 20,000 people in need (see our <a target=\"_blank\" rel=\"noopener noreferrer nofollow\" href=\"https://www.trustpilot.com/review/atticus.com\">12,000+ five-star reviews</a>) and raised more than $50 million from top VC firms like Forerunner, GV (Google Ventures), and True Ventures. (We just closed our Series B round in May 2023, so we're well-funded for the foreseeable future.) We're small but moving fast — our team grew from 89 to 151 last year and we expect to grow again in 2025.</p><p style=\"min-height:1.5em\"></p><h2>The Job</h2><p style=\"min-height:1.5em\">Atticus works in an industry dominated by outdated technology that is ripe for fresh thinking: our core competitors rely on massive call centers to screen clients, antiquated CRMs to track and manage cases, and paper checks to get paid (provided they’re sent to the right address). </p><p style=\"min-height:1.5em\">Conversely, as a VC-backed tech company our product &amp; engineering department powers everything we do: from creating an engaging online experience for people in crisis to providing tools for our network lawyers as they serve our clients, Atticus relies on technology to fulfill our mission. </p><p style=\"min-height:1.5em\">We’re looking for Software Engineers to join our team. You’ll work on the back-end, and will partner with every department at Atticus as we continue to grow our platform in an effort to help people in need find trusted legal support.  </p><p style=\"min-height:1.5em\"></p><h2><strong>What You'll Do:</strong></h2><ul style=\"min-height:1.5em\"><li><p style=\"min-height:1.5em\">Design, build, and operate Atticus’ APIs with a focus on performance, modularity, extensibility, and reliability.</p></li><li><p style=\"min-height:1.5em\">Work with product and software architects to plan and deliver features, fixes, and performance enhancements</p></li><li><p style=\"min-height:1.5em\">Leverage your peers as multipliers for your skills to create excellent products and services.</p></li></ul><p style=\"min-height:1.5em\">The role is a rare opportunity to join a fast-growing Series A startup that doubles as a B-corp social enterprise. Every project you take on will help clients in need get the help they deserve, and you’ll shape our company culture as we scale. We’re looking for engineers who are excited about our mission and the challenges it entails.</p><p style=\"min-height:1.5em\"></p><h2><strong>Who You Are:</strong></h2><ul style=\"min-height:1.5em\"><li><p style=\"min-height:1.5em\">You have 3+ years of experience writing idiomatic JavaScript/Node.js, Golang, Java, Python, Scala, or Ruby</p></li><li><p style=\"min-height:1.5em\">You use a modern version-control system for your source code repository (Git, Mercurial, GitHub, BitBucket).</p></li><li><p style=\"min-height:1.5em\">You lint all your code or know you should.</p></li><li><p style=\"min-height:1.5em\">You know what parts of your code require tests and you write those tests.</p></li><li><p style=\"min-height:1.5em\">You use objective judgement in leveraging the right frameworks and technologies.</p></li><li><p style=\"min-height:1.5em\">You are versed in cloud computing systems (GCP, AWS, etc.) and SAAS concepts.</p></li><li><p style=\"min-height:1.5em\">You build modern, resilient and operationally sane backend systems exemplifying industry standards (HTTP REST, GraphQL, Stream processing, Big Data).</p></li><li><p style=\"min-height:1.5em\">You leverage continuous integration systems to their full extent (CircleCI, Bamboo, Jenkins, TravisCI).</p></li><li><p style=\"min-height:1.5em\">You plan for, build, evolve and scrutinize monitoring and alerting for your production systems.</p></li><li><p style=\"min-height:1.5em\">You are willing and able to deploy, troubleshoot, and maintain your systems in production and staging environments.</p></li></ul><h2><strong>Extra Credit:</strong></h2><ul style=\"min-height:1.5em\"><li><p style=\"min-height:1.5em\">Experience with Google Cloud Platform, Kubernetes, Docker, CircleCI, Git, Golang, Java</p></li><li><p style=\"min-height:1.5em\">Experience with GraphQL, GraphQL Federation, REST APIs and supporting network protocols</p></li><li><p style=\"min-height:1.5em\">Experience with a distributed SQL platform like CockroachDB or Google Spanner</p></li><li><p style=\"min-height:1.5em\">Experience with Hadoop, MapReduce, or other “Big Data” systems</p></li></ul><p style=\"min-height:1.5em\">We are strongly committed to building a diverse team. If you’re from a background that’s underrepresented in tech, we’d love to meet you!</p><p style=\"min-height:1.5em\"></p><h2><strong>Salary &amp; Benefits</strong></h2><p style=\"min-height:1.5em\">This is a rare opportunity to join a startup that has strong traction (substantial funding, well-respected backers, tremendous growth, and many happy customers) but is still small enough that you can have a huge impact and play a role in shaping our culture.</p><p style=\"min-height:1.5em\">We’re a certified B Corporation tackling a critical social problem. Our mission to help people in need drives everything we do, and your work here will touch many lives.</p><p style=\"min-height:1.5em\">We offer competitive pay — including equity — and generous benefits:</p><ul style=\"min-height:1.5em\"><li><p style=\"min-height:1.5em\">Medical and dental insurance with 100% of employee premiums covered</p></li><li><p style=\"min-height:1.5em\">15 vacation days &amp; ~19 paid holidays each year (including two weeks at end-of-year)</p></li><li><p style=\"min-height:1.5em\">Free memberships to ClassPass and OneMedical</p></li><li><p style=\"min-height:1.5em\">$1,000 reimbursable stipend for education and training outside of work</p></li><li><p style=\"min-height:1.5em\">Student loan repayment assistance, 401(k), and optional HSA</p></li><li><p style=\"min-height:1.5em\">Free snacks, drinks, weekly lunches, and regular team dinners/events/retreats</p></li><li><p style=\"min-height:1.5em\">Humble, thoughtful, smart, fun colleagues</p></li></ul><p style=\"min-height:1.5em\">We anticipate the base salary band for this role will be between $115,000 and $180,000 in addition to equity and benefits. The salary at offer will be determined by a number of factors such as candidate’s experience, knowledge, skills and abilities, as well as internal equity among our team.</p><h2></h2><h2><strong>Location </strong></h2><p style=\"min-height:1.5em\">Today, about half of our team are in Los Angeles and half are fully remote and spread across the U.S. There are two options for this job:</p><ol style=\"min-height:1.5em\"><li><p style=\"min-height:1.5em\">Live in Los Angeles, work a few days a week (or more) out of our beautiful office in the Arts District.</p></li><li><p style=\"min-height:1.5em\">Live wherever, work remotely (Ideally PST hours), and travel to LA (on the company dime) as needed to be with your colleagues —somewhere between monthly and quarterly.</p></li></ol><p style=\"min-height:1.5em\">In short: You can do this job well remotely, and we’re committed to empowering everyone with flexibility. But we care a lot about building a great culture and we think some interactions need to happen in person, so we put a lot of thought into retreats, offsites, and other ways to gather.</p>","tags":"[\"javascript\",\"engineering\",\"legal\",\"aws\"]","pubDate":"2025-03-13T17:14:23.801Z","link":"https://jobs.ashbyhq.com/atticus/b98fbc02-3b26-4a96-a62e-d0c453b550c5","slug":"backend-engineer-atticus-2408"},{"id":5879051882,"title":"Senior Quality Engineer","company":"Circle","image":"https://media.licdn.com/dms/image/v2/D4E0BAQGsuyBYT8Wy1A/company-logo_200_200/company-logo_200_200/0/1709246393415/circleco_logo?e=1746662400&v=beta&t=KH2t1NJ7bcXknchnvYTCh2X0_q0BdXf-vERJqIz2p1k","description":"&lt;div class=&quot;content-intro&quot;&gt;&lt;h2&gt;About Us&lt;/h2&gt;\n&lt;p&gt;Circle is building the world’s leading all-in-one platform for online communities. We make it possible for creators, coaches, educators, and businesses to bring together their audience with engaging discussions, live streams, events, chat, courses, and payments — all in one place, all under their own brand.&lt;/p&gt;\n&lt;p&gt;We’re proud to be a fully remote company of around 180 (and growing!) team members from 30+ countries around the world. We seek exceptional individuals around the world, set them up to do the best work of their lives, and in turn, create a meaningful impact in their own lives. We don&#39;t track hours, but we do manage for high expectations very closely. We collaborate across time zones, are highly async, and like to document a lot.&lt;/p&gt;\n&lt;p&gt;Twice a year, we bring the whole company together in beautiful places around the world for our company offsites. So far, we’ve hosted offsites in Turkey, Portugal, Mexico, Thailand, Colombia, Italy, Ireland, and more, with still more to come!&lt;/p&gt;&lt;/div&gt;&lt;h2&gt;About the role&lt;/h2&gt;\n&lt;p&gt;We’re looking for a Senior Quality Engineer to join Circle, where you’ll be part of a small, agile Quality Engineering team that plays a key role in supporting our all of our engineering teams. From the design phase to product release, you’ll be driving quality practices and ensuring that we deliver the best possible product. As someone with strong technical judgment, you will play a pivotal role in fostering a “shift-left” approach to quality, helping to implement high standards and best practices while staying nimble in a fast-paced environment.&lt;/p&gt;\n&lt;h2&gt;What you&#39;ll be doing&lt;/h2&gt;\n&lt;p&gt;&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;Collaborating with cross-functional teams (design, product, engineering) from the start of projects to ensure quality is integrated throughout the process.&lt;/li&gt;\n&lt;li&gt;Leading quality initiatives and driving test automation practices to ensure robust and scalable solutions.&lt;/li&gt;\n&lt;li&gt;Developing and maintaining automated tests across web and mobile using tools likes Playwright, Appium, and WebdriverIO with JavaScript/TypeScript.&lt;/li&gt;\n&lt;li&gt;Working with existing data factories and API’s to utilize data points to create new tests.&lt;/li&gt;\n&lt;li&gt;Creating new architectural functionality to support automated test creation (example: Stripe, Buy Now Pay Later, ApplePay/GPay, etc.)&lt;/li&gt;\n&lt;li&gt;Implementing CI changes and debugging failing tests&lt;/li&gt;\n&lt;li&gt;Identifying and driving improvements to our quality processes, tools, and frameworks.&lt;/li&gt;\n&lt;li&gt;Participating in code reviews and sharing your expertise to improve team practices around testing and quality.&lt;/li&gt;\n&lt;li&gt;Help in driving standards and best practices around test automation, quality, and development processes.&lt;/li&gt;\n&lt;li&gt;Continuously evaluating and exploring innovative testing approaches, including AI-powered testing strategies.&lt;/li&gt;\n&lt;li&gt;Taking ownership of end-to-end test strategies, from design to execution, in a constantly evolving environment.&lt;/li&gt;\n&lt;li&gt;Take project requirements and quickly turn those into test cases for traceability of system requirements and aid with test automation.&lt;/li&gt;\n&lt;li&gt;Perform at a high level for project testing from requirements and design analysis, feature testing, exploratory testing, regression testing and UI/UX.&lt;/li&gt;\n&lt;/ul&gt;\n&lt;h2&gt;What you&#39;ll need to be successful&lt;/h2&gt;\n&lt;ul&gt;\n&lt;li&gt;Strong alignment with our values, &lt;a href=&quot;https://circle.so/careers&quot;&gt;find our values on our career page&lt;/a&gt; if you haven’t read up on them yet&lt;/li&gt;\n&lt;li&gt;You are proficient in English (spoken, written, and reading) at a &lt;a href=&quot;https://magoosh.com/english-speaking/english-proficiency-levels-a-guide-to-determining-your-level/&quot;&gt;CEFR Level C2&lt;/a&gt; / &lt;a href=&quot;https://www.govtilr.org/&quot;&gt;ILR Level 5&lt;/a&gt;.&lt;/li&gt;\n&lt;li&gt;&lt;strong&gt;5+ years&lt;/strong&gt; of experience in test automation, with a strong emphasis on web applications. Experience with mobile applications is a plus.&lt;/li&gt;\n&lt;li&gt;Have a proven track record of implementing technical projects from an architectural level.&lt;/li&gt;\n&lt;li&gt;Strong hands-on experience with &lt;strong&gt;Playwright&lt;/strong&gt;, &lt;strong&gt;Cypress&lt;/strong&gt;, or &lt;strong&gt;WebdriverIO&lt;/strong&gt;.&lt;/li&gt;\n&lt;li&gt;High proficiency in &lt;strong&gt;JavaScript&lt;/strong&gt; and &lt;strong&gt;TypeScript&lt;/strong&gt;.&lt;/li&gt;\n&lt;li&gt;Experience with implementing, maintaining, and debugging CI (We use &lt;strong&gt;BuildKite&lt;/strong&gt;)&lt;/li&gt;\n&lt;li&gt;Proven track record of delivering quality quickly in a fast-moving environment with shifting priorities.&lt;/li&gt;\n&lt;li&gt;Strong technical judgment, with a deep understanding of quality best practices, including experience implementing these practices in teams with fast-paced, evolving needs.&lt;/li&gt;\n&lt;li&gt;Demonstrated ability to take the lead on quality initiatives, working closely with design, product, and engineering teams to ensure quality is baked in from the start.&lt;/li&gt;\n&lt;li&gt;Proactive approach to quality with a &lt;strong&gt;“shift-left”&lt;/strong&gt; mindset, identifying potential issues early, and solving them before they become problems.&lt;/li&gt;\n&lt;li&gt;Familiarity or a keen interest in AI-driven testing approaches and emerging technologies in quality engineering.&lt;/li&gt;\n&lt;li&gt;Natural curiosity and a keen eye for detail — you ask the right questions, dive deep into problems, and never let anything slip through the cracks.&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;&lt;/p&gt;\n&lt;h2&gt;$110,000 - $130,000 USD per year&lt;/h2&gt;\n&lt;p&gt;&lt;em&gt;The cash compensation range shown is a starting point. In addition to equity, benefits and perks, your cash compensation is subject to an annual review and increase on a once per year basis.&lt;/em&gt;&lt;/p&gt;\n&lt;p&gt;&amp;nbsp;&lt;/p&gt;&lt;div class=&quot;content-conclusion&quot;&gt;&lt;h2&gt;The fun stuff&lt;/h2&gt;\n&lt;ul&gt;\n&lt;li&gt;Fully remote:&amp;nbsp;work from anywhere in the world!&lt;/li&gt;\n&lt;li&gt;Autonomy and trust to do your job:&amp;nbsp;we care about outcomes over everything else.&lt;/li&gt;\n&lt;li&gt;Paid time away:&amp;nbsp;all employees are given 35 days of PTO annually. We also offer a paid sabbatical after 5 years.&lt;/li&gt;\n&lt;li&gt;Generous U.S. benchmarked compensation&amp;nbsp;and startup equity no matter where you are in the world.*&lt;/li&gt;\n&lt;li&gt;Awesome medical coverage&amp;nbsp;with 100% coverage for you and your family, or medical reimbursement options where applicable!*&lt;/li&gt;\n&lt;li&gt;Parental leave&amp;nbsp;for parents expanding their family, or just starting one.&lt;/li&gt;\n&lt;li&gt;Home office stipend&amp;nbsp;to help you get up and running.&lt;/li&gt;\n&lt;li&gt;Learning &amp;amp; development stipend&amp;nbsp;to help you level up your professional skills.&lt;/li&gt;\n&lt;li&gt;Annual bonus potential&amp;nbsp;for roles that don&#39;t already receive variable income or commission.&lt;/li&gt;\n&lt;li&gt;Company retreats:&amp;nbsp;Twice a year, the Circle team gets together for a fully paid company retreat in incredible places around the world! We’ve had past retreats in Colombia, Portugal, and Mexico, with more planned on the horizon.&lt;/li&gt;\n&lt;li&gt;Check out our&amp;nbsp;&lt;a href=&quot;https://careers.circle.so/&quot;&gt;Careers&lt;/a&gt;&amp;nbsp;page for more.&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;&lt;span style=&quot;font-size: 10pt;&quot;&gt;*&lt;em&gt;Your role, location and unique circumstance may affect this.&lt;/em&gt;&lt;/span&gt;&lt;/p&gt;\n&lt;h3&gt;Diversity, Equity &amp;amp; Inclusion&lt;/h3&gt;\n&lt;p&gt;As a fully-remote international company, diversity is baked into our DNA. Here’s how our CEO, Sid Yadav, frames our hiring mission: “let’s find talent in underserved and under-represented corners of the world, set them up to do the best work of their lives, and in turn, change their life.” To achieve this hiring mission, we offer competitive&amp;nbsp;U.S. benchmarked&amp;nbsp;compensation no matter where someone’s located in the world, and we proactively seek candidates who expand representation of backgrounds, cultures and lived experiences in our teams.&lt;/p&gt;\n&lt;h3&gt;Equal Employment Opportunity&lt;/h3&gt;\n&lt;p&gt;Circle is an equal opportunity employer and as such, we do not discriminate on the basis of race, color, religion, sex, sexual orientation, gender identity, national origin, age, disability, or any other characteristic protected by applicable laws.&amp;nbsp;If you require any accommodations during the recruitment process, please let us know and we will work with you to meet your needs.&lt;/p&gt;\n&lt;div class=&quot;&quot;&gt;\n&lt;h3 class=&quot;&quot;&gt;How We Use Candidate Data&lt;/h3&gt;\n&lt;p&gt;At Circle, we are committed to protecting your personal information. As a job applicant, the personal data you provide to us is collected and processed in accordance with the&amp;nbsp;&lt;strong&gt;General Data Protection Regulation (GDPR)&lt;/strong&gt; in the EU and the &lt;strong&gt;California Consumer Privacy Act (CCPA)&lt;/strong&gt;. This notice outlines the types of personal information we collect, the purpose for collecting it, and your rights.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Information We Collect:&lt;/strong&gt; We collect the following categories of personal information from job applicants:&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;Contact information (such as name, email address, phone number)&lt;/li&gt;\n&lt;li&gt;Employment history and qualifications&lt;/li&gt;\n&lt;li&gt;Education history&lt;/li&gt;\n&lt;li&gt;References and any other information you choose to share with us during the application process&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;&lt;strong&gt;Purpose of Collection:&lt;/strong&gt; We collect this information for the following purposes:&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;To assess your qualifications and suitability for the position&lt;/li&gt;\n&lt;li&gt;To communicate with you during the recruitment process&lt;/li&gt;\n&lt;li&gt;To comply with legal and regulatory obligations&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;&lt;strong&gt;Your Rights Under GDPR and CCPA:&lt;/strong&gt; You have the following rights regarding your personal information:&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;The right to request access to the personal information we hold about you.&lt;/li&gt;\n&lt;li&gt;The right to request the deletion of your personal information, subject to certain legal exceptions.&lt;/li&gt;\n&lt;li&gt;The right to opt out of the sale of your personal information (Note: We do not sell personal information).&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;For more information about how we handle your personal data or to exercise your rights, please refer to our full &lt;a href=&quot;https://circle.so/privacy&quot; target=&quot;_blank&quot;&gt;Privacy Policy&lt;/a&gt;.&lt;/p&gt;\n&lt;p&gt;By submitting your application, you acknowledge that you have read and understood this privacy notice.&lt;/p&gt;\n&lt;/div&gt;&lt;/div&gt;","tags":"[\"javascript\",\"typescript\",\"engineering\",\"legal\",\"aws\"]","pubDate":"2025-03-13T16:35:08.000Z","link":"https://job-boards.greenhouse.io/circleso/jobs/4580714008","slug":"senior-quality-engineer-circle-4045"},{"id":9756368611,"title":"SR Software Engineer (Node.js and React) | Afirmativa para Pessoas com Deficiência (PCD) ","company":"ília","image":"https://avatars.githubusercontent.com/u/35933823?s=200&v=4","description":"&lt;p&gt;&lt;strong data-start=&quot;478&quot; data-end=&quot;554&quot;&gt;Essa é uma vaga afirmativa exclusiva para pessoas com deficiência (PCD).&lt;/strong&gt; Aqui na ília, valorizamos a diversidade e acreditamos no poder da inclusão para construir times mais fortes e inovadores. Estamos comprometidos em criar um ambiente acessível, acolhedor e respeitoso para todas as pessoas.&lt;/p&gt;\n&lt;h3&gt;&lt;strong&gt;Sobre a ília&lt;/strong&gt;&lt;/h3&gt;\n&lt;p&gt;Somos especialistas em tecnologia, dados e design, impulsionando a transformação digital de grandes players do mercado há mais de 10 anos, nos setores financeiro, seguros e mobilidade. Com mais de 450 profissionais, estamos presentes no Brasil e Europa, atendendo aos mercados da América Latina, Europa e América do Norte, desenvolvendo produtos digitais de alta qualidade e com foco em resultados de negócios. Somos uma equipe inovadora, criativa e apaixonada por tecnologia.&amp;nbsp;&lt;/p&gt;\n&lt;p&gt;Certificada pelo 5° ano consecutivo como Great Place to work aqui na ília acreditamos que pessoas mudam o mundo, e investimos nelas. Nossas awesome deliveries são feitas de pessoas para pessoas, afinal awesome people make awesome deliveries!&amp;nbsp;&lt;/p&gt;\n&lt;p&gt;#Vempraília!&lt;/p&gt;\n&lt;h3&gt;&lt;strong&gt;Sobre a vaga:&lt;br&gt;&lt;/strong&gt;&lt;/h3&gt;\n&lt;p&gt;Como FullStack, você será um membro fundamental de uma equipe de engenharia fullstack e multifuncional. Você colaborará com líderes de Engenharia, Design, Produto, QA e equipes de negócios para desenvolver e entregar soluções de software de alta qualidade, escaláveis e flexíveis. Além disso, terá a oportunidade de orientar engenheiros de nível júnior a pleno.&lt;/p&gt;\n&lt;p&gt;Nosso objetivo é fomentar uma cultura de Engenharia que valoriza equipes de desenvolvimento full stack, capacitando-as a tomar o máximo de decisões possível sobre sua direção técnica e processos.&lt;/p&gt;\n&lt;h3&gt;&lt;strong&gt;Requisitos:&lt;/strong&gt;&lt;/h3&gt;\n&lt;ul&gt;\n&lt;li&gt;Disponibilidade para trabalhar no horário EST&lt;/li&gt;\n&lt;li&gt;Inglês Avançado para conversação, leitura e escrita.&amp;nbsp;&lt;/li&gt;\n&lt;li&gt;Experiência profissional trabalhando em equipes de engenharia de software&lt;/li&gt;\n&lt;li&gt;5+ anos de experiência relevante em desenvolvimento web full-stack em produção, utilizando NodeJS/Typescript e React&lt;/li&gt;\n&lt;li&gt;Histórico de sucesso na execução de projetos&lt;/li&gt;\n&lt;li&gt;Experiência em dividir requisitos de produto em tarefas de engenharia gerenciáveis e trabalhar com a equipe para concluí-las&lt;/li&gt;\n&lt;li&gt;Disposição para transformar necessidades e problemas de negócios abstratos em tarefas concretas, em colaboração com os times de produto e engenharia&lt;/li&gt;\n&lt;li&gt;Disposição para defender as necessidades da equipe e se envolver em decisões estratégicas&lt;/li&gt;\n&lt;li&gt;Experiência sólida com tecnologias de API&lt;/li&gt;\n&lt;li&gt;Experiência sólida com tecnologias RDBMS&lt;/li&gt;\n&lt;li&gt;Experiência trabalhando com AWS&lt;/li&gt;\n&lt;li&gt;Experiência com aplicações web de alto tráfego&lt;/li&gt;\n&lt;li&gt;Compreensão de design de sistemas, estruturas de dados e algoritmos, além de experiência na criação e avaliação de documentos técnicos de design&lt;/li&gt;\n&lt;/ul&gt;\n&lt;h3&gt;Diferenciais:&amp;nbsp;&lt;/h3&gt;\n&lt;ul&gt;\n&lt;li&gt;Experiência trabalhando com equipes full-stack que suportam uma fatia vertical do produto&lt;/li&gt;\n&lt;li&gt;Experiência na construção de APIs REST backend usando Golang&lt;/li&gt;\n&lt;li&gt;Familiaridade com as melhores práticas de SRE (como SLOs, KPIs, post-mortems, gerenciamento de incidentes, redução de toil, etc.)&lt;/li&gt;\n&lt;li&gt;Compreensão de metodologias ágeis (preferencialmente Scrum) e disposição para adaptar e definir processos de desenvolvimento de software&lt;/li&gt;\n&lt;li&gt;Experiência na definição de roadmaps técnicos e iniciativas, além de liderança em guildas entre equipes&lt;/li&gt;\n&lt;/ul&gt;\n&lt;h3&gt;&lt;strong&gt;Benefícios e Incentivos:&lt;/strong&gt;&lt;/h3&gt;\n&lt;p&gt;Nossa contratação é CLT- 40h semanais com jornada flexível, sendo executada 100% de forma remota. Os benefícios da ília são pensados para proporcionar uma experiência AWESOME para cada ílian, abaixo você encontra os benefícios de forma resumida. #vempraília&lt;/p&gt;\n&lt;p&gt;Para Saúde e bem-estar:&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;Plano de Saúde e Odontológico SulAmérica extensivo a dependentes;&lt;/li&gt;\n&lt;li&gt;Vale Alimentação/Refeição em cartão fléxivel Picpay benefícios&amp;nbsp;&lt;/li&gt;\n&lt;li&gt;Seguro de Vida;&lt;/li&gt;\n&lt;li&gt;Auxílio Home-Office em cartão fléxivel Picpay benefícios;&lt;/li&gt;\n&lt;li&gt;Wellhub (Gympass)&lt;/li&gt;\n&lt;li&gt;TotalPass&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;Para o seu Desenvolvimento:&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;ília University: Universidade Corporativa com mais de 20 mil cursos disponíveis para desenvolvimento pessoal e profissional;&lt;/li&gt;\n&lt;li&gt;Language Academy: Escola de idiomas para ílians;&lt;/li&gt;\n&lt;li&gt;í-talks e Chapter: Momentos e cerimônias em que o time compartilha práticas, estudos, projetos e ideias. Nas chapters ainda se reúnem pessoas com skills similares para compartilhamento de ideias, práticas e experiências;&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;Gostamos de ir além no cuidado com as nossas pessoas, então dispomos também de alguns benefícios não convencionais:&amp;nbsp;&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;Plano de Saúde PET- Guapeco&amp;nbsp;&lt;/li&gt;\n&lt;li&gt;BYOD- Alugamos o seu notebook pessoal te pagando um valor mensal para que você o use, mas disponibilizamos também máquinas de trabalho para ílians. Você quem decide!&lt;/li&gt;\n&lt;li&gt;Seu Niver, seu bolo!&lt;/li&gt;\n&lt;li&gt;Seu Networking Vale Prêmio- Programa de premiação a indicação de novos funcionários.&lt;/li&gt;\n&lt;/ul&gt;","tags":"[\"typescript\",\"finance\",\"aws\"]","pubDate":"2025-03-13T14:44:37.000Z","link":"https://job-boards.greenhouse.io/ilia/jobs/5470798004","slug":"sr-software-engineer-node-js-and-react-afirmativa-para-pessoas-com-defici-ncia-pcd-lia-2703"},{"id":8627219435,"title":"Full Stack Engineer","company":"Primer","image":"https://pbs.twimg.com/profile_images/1533245276764372993/AtyqkzHz_400x400.jpg","description":"<p style=\"min-height:1.5em\"><strong>An Introduction to Primer</strong></p><p style=\"min-height:1.5em\">The 21st century has witnessed remarkable expansion within the payments ecosystem with the introduction of new payment services, growth in cross-border commerce, and the development of multi-payment processor payment strategies.</p><p style=\"min-height:1.5em\">The bottom line is that payment is no longer just another step in the purchasing funnel but a strategic asset that can drive business growth and innovation.</p><p style=\"min-height:1.5em\">Enter Primer - the world's first unified payment infrastructure, empowering businesses worldwide to unleash their payment potential. By choosing our platform, merchants can take control over their payment stack, create unique commerce experiences, accelerate their roadmap and increase payment success.</p><p style=\"min-height:1.5em\">Primer's enterprise-grade infrastructure, frameworks, and tooling allow merchants to unify their disparate payment solutions and services to build optimised payment flows tailored to their unique business needs with no code or additional complexity. We strive to make something complex incredibly simple and intuitive.</p><p style=\"min-height:1.5em\">Our success so far has been reflected in the trust placed in us by category leaders such as Printify, NewLook, Voi, and Dabble, who are using Primer to transform their payments into a growth lever. Moreover, the world's top investors, including Accel, Balderton, Iconiq, and Tencent, have also invested in Primer's vision to rebuild payments and commerce from the ground up.</p><p style=\"min-height:1.5em\">Join us in shaping the future of payments and commerce. Let's pave the way for a world where businesses can fully realise their payment potential.<br /><br /><strong>Our engineering teams work fully remotely across Europe but we are focusing our hiring strategy on these locations: UK </strong>🇬🇧<strong>, Hungary </strong>🇭🇺<strong>, Romania </strong>🇷🇴<strong>, Serbia </strong>🇷🇸<strong>, Turkey </strong>🇹🇷<strong>, Bosnia </strong>🇧🇦<strong>, and Greece </strong>🇬🇷<strong>.</strong></p><p style=\"min-height:1.5em\"><strong>Unfortunately we are unable to offer VISA sponsorships or relocation packages at this time.</strong></p><p style=\"min-height:1.5em\"></p><p style=\"min-height:1.5em\"><strong>What will the role involve?</strong></p><ul style=\"min-height:1.5em\"><li><p style=\"min-height:1.5em\">Improve and optimize fallback mechanisms to ensure seamless payment processing.</p></li><li><p style=\"min-height:1.5em\">Enhance reliability by implementing smart routing and failover strategies.</p></li><li><p style=\"min-height:1.5em\">Redesign data pipelines to improve monitoring, tracking, and real-time insights.</p></li><li><p style=\"min-height:1.5em\">Ensure data accuracy and integrity across payment systems.</p></li><li><p style=\"min-height:1.5em\">Build and refine an <strong>A/B testing framework</strong> to test different payment flows.</p></li><li><p style=\"min-height:1.5em\">Develop <strong>if X, then Y</strong> decision-based logic to optimize transaction success rates.</p></li><li><p style=\"min-height:1.5em\">Enable rapid iteration and data-driven improvements in the payments experience.</p></li></ul><p style=\"min-height:1.5em\"><strong>What are we looking for?</strong></p><ul style=\"min-height:1.5em\"><li><p style=\"min-height:1.5em\">A <strong>Full-Stack Developer</strong> with a strong focus on <strong>Frontend development</strong> (JavaScript/TypeScript + React).</p></li><li><p style=\"min-height:1.5em\">Someone comfortable working across the stack, with <strong>some backend experience (Python preferred)</strong> but primarily frontend-heavy.</p></li><li><p style=\"min-height:1.5em\">Experience with <strong>testing frameworks</strong> and a good approach to writing testable, maintainable code.</p></li><li><p style=\"min-height:1.5em\">Be willing to set goals, success metrics, driving and setting up sprints and driving refinement sessions of the tickets and driving delivery side on a day to day basis.</p></li><li><p style=\"min-height:1.5em\">In-depth understanding of the entire development process (design, development and deployment)</p></li><li><p style=\"min-height:1.5em\">Highly motivated self-starter who values autonomy and getting things done</p></li><li><p style=\"min-height:1.5em\">Excellent verbal and written communication skills</p></li><li><p style=\"min-height:1.5em\">Experience working in a fast-paced environment.<br /><br /><strong>Our interview process</strong></p><ul style=\"min-height:1.5em\"><li><p style=\"min-height:1.5em\">30 minute call with a Talent Partner</p></li><li><p style=\"min-height:1.5em\">45 minute interview with an Engineering Manager</p></li><li><p style=\"min-height:1.5em\">90 minute pair programming interview</p></li><li><p style=\"min-height:1.5em\">60 minute systems design interview</p></li><li><p style=\"min-height:1.5em\">60 minute final stage culture interview</p></li></ul></li></ul><p style=\"min-height:1.5em\"></p><p style=\"min-height:1.5em\"><strong>What’s the culture like at Primer?</strong></p><p style=\"min-height:1.5em\">We’re building a culture where people can come and do their best work and enjoy it. We want our people to be proud of the impact that they have at Primer, and of the work that they are doing. You will be working with a team of people who are mission-driven, smart, and reflective, and who are invested in building exceptional products and delivering success for our merchants <em>(and we also know how to have fun along the way).</em></p><p style=\"min-height:1.5em\">We work remotely. We believe that building a successful, profitable company goes beyond proximity. We invest in our relationships with each other through great remote working practices and thoughtfully designed face-to-face time together. Our heads-together time comes in the form of workstations, our annual company retreat, and co-working space access worldwide.</p><p style=\"min-height:1.5em\">Finally, let’s go ahead and say it. The work that we do is challenging. Startups are a challenge, building category defining products is a challenge. You should be prepared for a challenge at Primer. But, there’s a big difference between a challenge and a struggle. The key difference is that the right challenge comes with the right support structures, an acceptance that not everything always goes to plan, a collaborative environment, and a great team around you. It’s never a challenge that you will face alone.</p><p style=\"min-height:1.5em\"></p><p style=\"min-height:1.5em\"><strong>Our benefits:</strong></p><ul style=\"min-height:1.5em\"><li><p style=\"min-height:1.5em\">We are fully remote</p></li><li><p style=\"min-height:1.5em\">Competitive share options</p></li><li><p style=\"min-height:1.5em\">Uncapped holiday, with 25 days minimum to be taken</p></li><li><p style=\"min-height:1.5em\">Co-working space access</p></li><li><p style=\"min-height:1.5em\">Workations &amp; company retreat</p></li><li><p style=\"min-height:1.5em\">The best equipment for your role</p></li><li><p style=\"min-height:1.5em\">£500 towards your home office setup</p></li><li><p style=\"min-height:1.5em\">Generous learning budget</p></li><li><p style=\"min-height:1.5em\">Medical insurance</p></li><li><p style=\"min-height:1.5em\">A broad set of additional perks and benefits (<em>depending on location)</em></p></li></ul><p style=\"min-height:1.5em\"></p><p style=\"min-height:1.5em\"><strong>Don’t meet every single requirement?</strong></p><p style=\"min-height:1.5em\">At Primer, we’re dedicated to building a diverse, inclusive, and authentic workplace. If you’re excited about this role but your past experience doesn’t align perfectly with every qualification in the job description, we encourage you to apply. You may be the right candidate for this or other roles. Primer is committed to the equal treatment of all current and prospective employees, regardless of background or beliefs—see our diversity commitment statement for more details</p><p style=\"min-height:1.5em\"><a target=\"_blank\" rel=\"noopener noreferrer nofollow\" href=\"https://www.notion.so/Equity-diversity-inclusion-and-belonging-policy-7904d43d137848fda9cdc19772e43cec?pvs=21\"><strong>Equity, diversity, inclusion and belonging policy</strong></a></p><p style=\"min-height:1.5em\">Primer adopts a zero-tolerance approach to discrimination.</p><p style=\"min-height:1.5em\">We are committed to providing equal opportunities to all current and prospective employees regardless of age, disability, sex, sexual orientation, pregnancy and maternity, race or ethnicity, religion or belief, gender identity, or marriage and civil partnership.</p>","tags":"[\"javascript\",\"typescript\",\"engineering\"]","pubDate":"2025-03-13T14:32:54.161Z","link":"https://jobs.ashbyhq.com/primer.io/ab16c1c4-c81b-4b8e-bc2d-9d9a2ef12a2c","slug":"full-stack-engineer-primer-1173"},{"id":2548852758,"title":"Senior Python Developer (worldwide remote, work from anywhere)","company":"CloudLinux","image":"https://avatars.githubusercontent.com/u/16290369?s=200&v=4","description":"<p>KernelCare, CloudLinux’s fastest-growing product, provides automated kernel security updates without reboots for the most popular Linux distributions. It ensures optimal performance and uptime by enabling hosting providers and enterprises to keep their kernels up-to-date with all the latest security patches while keeping their servers online. </p><p>Work is fully remote, with flexible hours, allowing you to plan your day and work from anywhere in the world. </p><p>For more details about the project, please visit the product website at <a href=\"https://tuxcare.com/\" target=\"_blank\" rel=\"nofollow noreferrer noopener\" class=\"external\">TuxCare.com. </a></p><p></p><p><strong>As our Senior Python Developer, you will: </strong></p><p>- Get hands-on experience developing our cutting-edge KernelCare products using Python. </p><p>- Ensure the quality of your code by writing comprehensive unit tests with Python and/or functional tests. </p><p>- Collaborate with your colleagues by reviewing their code through Gerrit. </p><p>- Contribute to the growth of our products through architectural development and creating detailed technical documentation for new features. </p><p>- Dive into reported issues from our clients, partners, or support team to investigate and find solutions. </p><p>- Work closely with our 3rd level support team, providing consultations and assistance on matters related to KernelCare products.</p><p><strong>Requirements</strong></p><p><strong>To thrive in this role, you should possess the following: </strong></p><p>- 4+ years of Python programming experience. </p><p>- Experience with System programming, including Sockets, filesystem, and process management. </p><p>- Proficiency in GNU/Linux operating system and shell scripting. </p><p>- Experience with git-based development processes. </p><p>- Knowledge of PyTest. </p><p>- Intermediate or higher level of English language proficiency. </p><p></p><p><strong>It would be great if you also have:</strong></p><p>- Familiarity with Ansible and Jenkins. </p><p>- Experience with ClickHouse. </p><p>- Experience in rpm/deb package management (writing rpm spec, deb rules). </p><p>- Understanding of C language. </p><p>- Proficiency in Python frameworks such as Flask and SQLAlchemy. </p><p>- Knowledge of NGINX. </p><p></p><p><strong>In addition, it is essential that you: </strong></p><p>- Are quick to learn and proactive. </p><p>- Are highly self-motivated and determined to accomplish set goals. </p><p>- Can independently analyze tasks and identify optimal solutions. </p><p>- Are skilled at collaboration and working effectively in teams.</p><p><strong>Benefits</strong></p><p></p><p><strong>What's in it for you?</strong></p><ul> <li>A focus on professional development.</li> <li>Interesting and challenging projects.</li> <li>Fully remote work with flexible working hours, that allows you to schedule your day and work from any location worldwide.</li> <li>Paid 24 days of vacation per year, 10 days of national holidays, and unlimited sick leaves.</li> <li>Compensation for private medical insurance.</li> <li>Co-working and gym/sports reimbursement.</li> <li>Budget for education.</li> <li>The opportunity to receive a reward for the most innovative idea that the company can patent.</li> </ul><p></p><p></p><p></p><p><em>By applying for this position, you consent to the processing of your personal data as described in our Privacy Policy (</em><a href=\"https://cloudlinux.com/candidate-privacy-notice\" target=\"_blank\" rel=\"nofollow noreferrer noopener\" class=\"external\"><em>https://cloudlinux.com/candidate-privacy-notice</em></a><em>), which provides detailed information on how we maintain and handle your data.</em><a href=\"https://apply.workable.com/cloudlinux-1/j/70F2AF1366/apply/\" rel=\"nofollow noreferrer noopener\" class=\"external\"></a></p><p></p><p><br> </p>","tags":"[\"management\"]","pubDate":"2025-03-13T00:00:00.000Z","link":"https://apply.workable.com/j/886EDBA3F0","slug":"senior-python-developer-worldwide-remote-work-from-anywhere-cloudlinux-7233"},{"id":5630734180,"title":"Senior Python Developer (worldwide remote, work from anywhere)","company":"CloudLinux","image":"https://avatars.githubusercontent.com/u/16290369?s=200&v=4","description":"<p>KernelCare, CloudLinux’s fastest-growing product, provides automated kernel security updates without reboots for the most popular Linux distributions. It ensures optimal performance and uptime by enabling hosting providers and enterprises to keep their kernels up-to-date with all the latest security patches while keeping their servers online. </p><p>Work is fully remote, with flexible hours, allowing you to plan your day and work from anywhere in the world. </p><p>For more details about the project, please visit the product website at <a href=\"https://tuxcare.com/\" target=\"_blank\" rel=\"nofollow noreferrer noopener\" class=\"external\">TuxCare.com. </a></p><p></p><p><strong>As our Senior Python Developer, you will: </strong></p><p>- Get hands-on experience developing our cutting-edge KernelCare products using Python. </p><p>- Ensure the quality of your code by writing comprehensive unit tests with Python and/or functional tests. </p><p>- Collaborate with your colleagues by reviewing their code through Gerrit. </p><p>- Contribute to the growth of our products through architectural development and creating detailed technical documentation for new features. </p><p>- Dive into reported issues from our clients, partners, or support team to investigate and find solutions. </p><p>- Work closely with our 3rd level support team, providing consultations and assistance on matters related to KernelCare products.</p><p><strong>Requirements</strong></p><p><strong>To thrive in this role, you should possess the following: </strong></p><p>- 4+ years of Python programming experience. </p><p>- Experience with System programming, including Sockets, filesystem, and process management. </p><p>- Proficiency in GNU/Linux operating system and shell scripting. </p><p>- Experience with git-based development processes. </p><p>- Knowledge of PyTest. </p><p>- Intermediate or higher level of English language proficiency. </p><p></p><p><strong>It would be great if you also have:</strong></p><p>- Familiarity with Ansible and Jenkins. </p><p>- Experience with ClickHouse. </p><p>- Experience in rpm/deb package management (writing rpm spec, deb rules). </p><p>- Understanding of C language. </p><p>- Proficiency in Python frameworks such as Flask and SQLAlchemy. </p><p>- Knowledge of NGINX. </p><p></p><p><strong>In addition, it is essential that you: </strong></p><p>- Are quick to learn and proactive. </p><p>- Are highly self-motivated and determined to accomplish set goals. </p><p>- Can independently analyze tasks and identify optimal solutions. </p><p>- Are skilled at collaboration and working effectively in teams.</p><p><strong>Benefits</strong></p><p></p><p><strong>What's in it for you?</strong></p><ul> <li>A focus on professional development.</li> <li>Interesting and challenging projects.</li> <li>Fully remote work with flexible working hours, that allows you to schedule your day and work from any location worldwide.</li> <li>Paid 24 days of vacation per year, 10 days of national holidays, and unlimited sick leaves.</li> <li>Compensation for private medical insurance.</li> <li>Co-working and gym/sports reimbursement.</li> <li>Budget for education.</li> <li>The opportunity to receive a reward for the most innovative idea that the company can patent.</li> </ul><p></p><p></p><p></p><p><em>By applying for this position, you consent to the processing of your personal data as described in our Privacy Policy (</em><a href=\"https://cloudlinux.com/candidate-privacy-notice\" target=\"_blank\" rel=\"nofollow noreferrer noopener\" class=\"external\"><em>https://cloudlinux.com/candidate-privacy-notice</em></a><em>), which provides detailed information on how we maintain and handle your data.</em><a href=\"https://apply.workable.com/cloudlinux-1/j/70F2AF1366/apply/\" rel=\"nofollow noreferrer noopener\" class=\"external\"></a></p><p></p><p><br> </p>","tags":"[\"management\"]","pubDate":"2025-03-13T00:00:00.000Z","link":"https://apply.workable.com/j/886EDBA3F0","slug":"senior-python-developer-worldwide-remote-work-from-anywhere-cloudlinux-2182"},{"id":6621248308,"title":"Senior Python Developer (worldwide remote, work from anywhere)","company":"CloudLinux","image":"https://avatars.githubusercontent.com/u/16290369?s=200&v=4","description":"<p>KernelCare, CloudLinux’s fastest-growing product, provides automated kernel security updates without reboots for the most popular Linux distributions. It ensures optimal performance and uptime by enabling hosting providers and enterprises to keep their kernels up-to-date with all the latest security patches while keeping their servers online. </p><p>Work is fully remote, with flexible hours, allowing you to plan your day and work from anywhere in the world. </p><p>For more details about the project, please visit the product website at <a href=\"https://tuxcare.com/\" target=\"_blank\" rel=\"nofollow noreferrer noopener\" class=\"external\">TuxCare.com. </a></p><p></p><p><strong>As our Senior Python Developer, you will: </strong></p><p>- Get hands-on experience developing our cutting-edge KernelCare products using Python. </p><p>- Ensure the quality of your code by writing comprehensive unit tests with Python and/or functional tests. </p><p>- Collaborate with your colleagues by reviewing their code through Gerrit. </p><p>- Contribute to the growth of our products through architectural development and creating detailed technical documentation for new features. </p><p>- Dive into reported issues from our clients, partners, or support team to investigate and find solutions. </p><p>- Work closely with our 3rd level support team, providing consultations and assistance on matters related to KernelCare products.</p><p><strong>Requirements</strong></p><p><strong>To thrive in this role, you should possess the following: </strong></p><p>- 4+ years of Python programming experience. </p><p>- Experience with System programming, including Sockets, filesystem, and process management. </p><p>- Proficiency in GNU/Linux operating system and shell scripting. </p><p>- Experience with git-based development processes. </p><p>- Knowledge of PyTest. </p><p>- Intermediate or higher level of English language proficiency. </p><p></p><p><strong>It would be great if you also have:</strong></p><p>- Familiarity with Ansible and Jenkins. </p><p>- Experience with ClickHouse. </p><p>- Experience in rpm/deb package management (writing rpm spec, deb rules). </p><p>- Understanding of C language. </p><p>- Proficiency in Python frameworks such as Flask and SQLAlchemy. </p><p>- Knowledge of NGINX. </p><p></p><p><strong>In addition, it is essential that you: </strong></p><p>- Are quick to learn and proactive. </p><p>- Are highly self-motivated and determined to accomplish set goals. </p><p>- Can independently analyze tasks and identify optimal solutions. </p><p>- Are skilled at collaboration and working effectively in teams.</p><p><strong>Benefits</strong></p><p></p><p><strong>What's in it for you?</strong></p><ul> <li>A focus on professional development.</li> <li>Interesting and challenging projects.</li> <li>Fully remote work with flexible working hours, that allows you to schedule your day and work from any location worldwide.</li> <li>Paid 24 days of vacation per year, 10 days of national holidays, and unlimited sick leaves.</li> <li>Compensation for private medical insurance.</li> <li>Co-working and gym/sports reimbursement.</li> <li>Budget for education.</li> <li>The opportunity to receive a reward for the most innovative idea that the company can patent.</li> </ul><p></p><p></p><p></p><p><em>By applying for this position, you consent to the processing of your personal data as described in our Privacy Policy (</em><a href=\"https://cloudlinux.com/candidate-privacy-notice\" target=\"_blank\" rel=\"nofollow noreferrer noopener\" class=\"external\"><em>https://cloudlinux.com/candidate-privacy-notice</em></a><em>), which provides detailed information on how we maintain and handle your data.</em><a href=\"https://apply.workable.com/cloudlinux-1/j/70F2AF1366/apply/\" rel=\"nofollow noreferrer noopener\" class=\"external\"></a></p><p></p><p><br> </p>","tags":"[\"management\"]","pubDate":"2025-03-13T00:00:00.000Z","link":"https://apply.workable.com/j/886EDBA3F0","slug":"senior-python-developer-worldwide-remote-work-from-anywhere-cloudlinux-3614"},{"id":4632852169,"title":"Senior Python Developer (worldwide remote, work from anywhere)","company":"CloudLinux","image":"https://avatars.githubusercontent.com/u/16290369?s=200&v=4","description":"<p>KernelCare, CloudLinux’s fastest-growing product, provides automated kernel security updates without reboots for the most popular Linux distributions. It ensures optimal performance and uptime by enabling hosting providers and enterprises to keep their kernels up-to-date with all the latest security patches while keeping their servers online. </p><p>Work is fully remote, with flexible hours, allowing you to plan your day and work from anywhere in the world. </p><p>For more details about the project, please visit the product website at <a href=\"https://tuxcare.com/\" target=\"_blank\" rel=\"nofollow noreferrer noopener\" class=\"external\">TuxCare.com. </a></p><p></p><p><strong>As our Senior Python Developer, you will: </strong></p><p>- Get hands-on experience developing our cutting-edge KernelCare products using Python. </p><p>- Ensure the quality of your code by writing comprehensive unit tests with Python and/or functional tests. </p><p>- Collaborate with your colleagues by reviewing their code through Gerrit. </p><p>- Contribute to the growth of our products through architectural development and creating detailed technical documentation for new features. </p><p>- Dive into reported issues from our clients, partners, or support team to investigate and find solutions. </p><p>- Work closely with our 3rd level support team, providing consultations and assistance on matters related to KernelCare products.</p><p><strong>Requirements</strong></p><p><strong>To thrive in this role, you should possess the following: </strong></p><p>- 4+ years of Python programming experience. </p><p>- Experience with System programming, including Sockets, filesystem, and process management. </p><p>- Proficiency in GNU/Linux operating system and shell scripting. </p><p>- Experience with git-based development processes. </p><p>- Knowledge of PyTest. </p><p>- Intermediate or higher level of English language proficiency. </p><p></p><p><strong>It would be great if you also have:</strong></p><p>- Familiarity with Ansible and Jenkins. </p><p>- Experience with ClickHouse. </p><p>- Experience in rpm/deb package management (writing rpm spec, deb rules). </p><p>- Understanding of C language. </p><p>- Proficiency in Python frameworks such as Flask and SQLAlchemy. </p><p>- Knowledge of NGINX. </p><p></p><p><strong>In addition, it is essential that you: </strong></p><p>- Are quick to learn and proactive. </p><p>- Are highly self-motivated and determined to accomplish set goals. </p><p>- Can independently analyze tasks and identify optimal solutions. </p><p>- Are skilled at collaboration and working effectively in teams.</p><p><strong>Benefits</strong></p><p></p><p><strong>What's in it for you?</strong></p><ul> <li>A focus on professional development.</li> <li>Interesting and challenging projects.</li> <li>Fully remote work with flexible working hours, that allows you to schedule your day and work from any location worldwide.</li> <li>Paid 24 days of vacation per year, 10 days of national holidays, and unlimited sick leaves.</li> <li>Compensation for private medical insurance.</li> <li>Co-working and gym/sports reimbursement.</li> <li>Budget for education.</li> <li>The opportunity to receive a reward for the most innovative idea that the company can patent.</li> </ul><p></p><p></p><p></p><p><em>By applying for this position, you consent to the processing of your personal data as described in our Privacy Policy (</em><a href=\"https://cloudlinux.com/candidate-privacy-notice\" target=\"_blank\" rel=\"nofollow noreferrer noopener\" class=\"external\"><em>https://cloudlinux.com/candidate-privacy-notice</em></a><em>), which provides detailed information on how we maintain and handle your data.</em><a href=\"https://apply.workable.com/cloudlinux-1/j/70F2AF1366/apply/\" rel=\"nofollow noreferrer noopener\" class=\"external\"></a></p><p></p><p><br> </p>","tags":"[\"management\"]","pubDate":"2025-03-13T00:00:00.000Z","link":"https://apply.workable.com/j/886EDBA3F0","slug":"senior-python-developer-worldwide-remote-work-from-anywhere-cloudlinux-9422"},{"id":6982259764,"title":"Senior Python Developer (worldwide remote, work from anywhere)","company":"CloudLinux","image":"https://avatars.githubusercontent.com/u/16290369?s=200&v=4","description":"<p>KernelCare, CloudLinux’s fastest-growing product, provides automated kernel security updates without reboots for the most popular Linux distributions. It ensures optimal performance and uptime by enabling hosting providers and enterprises to keep their kernels up-to-date with all the latest security patches while keeping their servers online. </p><p>Work is fully remote, with flexible hours, allowing you to plan your day and work from anywhere in the world. </p><p>For more details about the project, please visit the product website at <a href=\"https://tuxcare.com/\" target=\"_blank\" rel=\"nofollow noreferrer noopener\" class=\"external\">TuxCare.com. </a></p><p></p><p><strong>As our Senior Python Developer, you will: </strong></p><p>- Get hands-on experience developing our cutting-edge KernelCare products using Python. </p><p>- Ensure the quality of your code by writing comprehensive unit tests with Python and/or functional tests. </p><p>- Collaborate with your colleagues by reviewing their code through Gerrit. </p><p>- Contribute to the growth of our products through architectural development and creating detailed technical documentation for new features. </p><p>- Dive into reported issues from our clients, partners, or support team to investigate and find solutions. </p><p>- Work closely with our 3rd level support team, providing consultations and assistance on matters related to KernelCare products.</p><p><strong>Requirements</strong></p><p><strong>To thrive in this role, you should possess the following: </strong></p><p>- 4+ years of Python programming experience. </p><p>- Experience with System programming, including Sockets, filesystem, and process management. </p><p>- Proficiency in GNU/Linux operating system and shell scripting. </p><p>- Experience with git-based development processes. </p><p>- Knowledge of PyTest. </p><p>- Intermediate or higher level of English language proficiency. </p><p></p><p><strong>It would be great if you also have:</strong></p><p>- Familiarity with Ansible and Jenkins. </p><p>- Experience with ClickHouse. </p><p>- Experience in rpm/deb package management (writing rpm spec, deb rules). </p><p>- Understanding of C language. </p><p>- Proficiency in Python frameworks such as Flask and SQLAlchemy. </p><p>- Knowledge of NGINX. </p><p></p><p><strong>In addition, it is essential that you: </strong></p><p>- Are quick to learn and proactive. </p><p>- Are highly self-motivated and determined to accomplish set goals. </p><p>- Can independently analyze tasks and identify optimal solutions. </p><p>- Are skilled at collaboration and working effectively in teams.</p><p><strong>Benefits</strong></p><p></p><p><strong>What's in it for you?</strong></p><ul> <li>A focus on professional development.</li> <li>Interesting and challenging projects.</li> <li>Fully remote work with flexible working hours, that allows you to schedule your day and work from any location worldwide.</li> <li>Paid 24 days of vacation per year, 10 days of national holidays, and unlimited sick leaves.</li> <li>Compensation for private medical insurance.</li> <li>Co-working and gym/sports reimbursement.</li> <li>Budget for education.</li> <li>The opportunity to receive a reward for the most innovative idea that the company can patent.</li> </ul><p></p><p></p><p></p><p><em>By applying for this position, you consent to the processing of your personal data as described in our Privacy Policy (</em><a href=\"https://cloudlinux.com/candidate-privacy-notice\" target=\"_blank\" rel=\"nofollow noreferrer noopener\" class=\"external\"><em>https://cloudlinux.com/candidate-privacy-notice</em></a><em>), which provides detailed information on how we maintain and handle your data.</em><a href=\"https://apply.workable.com/cloudlinux-1/j/70F2AF1366/apply/\" rel=\"nofollow noreferrer noopener\" class=\"external\"></a></p><p></p><p><br> </p>","tags":"[\"management\"]","pubDate":"2025-03-13T00:00:00.000Z","link":"https://apply.workable.com/j/886EDBA3F0","slug":"senior-python-developer-worldwide-remote-work-from-anywhere-cloudlinux-234"},{"id":4801965203,"title":"Senior Backend Developer — Typescript","company":"Mimo GmbH","image":"https://remotive.com/job/1983726/logo","description":"<p>We’re looking for someone based within the <strong>UTC 0 to UTC+2 time zones</strong>.</p>\n<p> </p>\n<p><strong>Our mission</strong></p>\n<p>At Mimo, we believe that coding can open doors to careers and opportunities like few other skills. We aim to provide the <strong>most accessible and enjoyable way to learn to code</strong> while providing our learners the tools to become <strong>creators on our platform</strong>.</p>\n<p><strong> </strong></p>\n<p><strong>About the team</strong></p>\n<p>We're looking for a <strong>Senior</strong> <strong>backend developer</strong> to join our cross-functional <strong>app team</strong>. You’ll build the backend to help us create a world where creating software is as easy and accessible as describing what you want and sharing your work is as simple as clicking a button.</p>\n<p> </p>\n<p><strong>What you’ll be doing</strong></p>\n<ul style=\"\">\n<li style=\"\">You’ll use <strong>TypeScript</strong> to design, build, and ship a <strong>completely new</strong> user-facing product in collaboration with product managers, designers, and developers.</li>\n<li style=\"\">You’ll develop scalable backend infrastructure with <strong>Bun</strong>, <strong>Node.js,</strong> and <strong>K8s</strong>.</li>\n<li style=\"\">You’ll build and operate <strong>APIs and infrastructure</strong>, taking operational ownership of the services.</li>\n</ul>\n<p> </p>\n<p><strong>You’ll thrive in this role if</strong></p>\n<ul style=\"\">\n<li style=\"\"><strong>You’re a seasoned developer</strong>. You have four (or more) years of experience as a backend developer shipping features for large-scale and real-time applications using <strong>Typescript</strong>, building consumer-facing products.</li>\n<li style=\"\"><strong>You're framework-agnostic. </strong>You’re open to getting familiar with <strong>C# and .NET</strong> for parts of our backend stack.</li>\n<li style=\"\"><strong>You have a bias for action.</strong> You have a strong sense of urgency; when you see a problem, you solve it. You don't have time to waste on analysis paralysis and prefer to learn from your mistakes as you go.</li>\n<li style=\"\"><strong>You’re excited about AI and its potential.</strong> You’re deeply curious about AI and AI tooling and eager to explore how they can unlock new possibilities and make a real impact.</li>\n<li style=\"\"><strong>You’ve built and maintained APIs.</strong> You hold yourself and others to a high bar when working with production systems, bringing a sound understanding of API design and best practices.</li>\n<li style=\"\"><strong>You care about code quality.</strong> You follow engineering best practices, such as code reviews, to ensure and maintain excellent application performance and code quality.</li>\n<li style=\"\"><strong>You take the lead to ensure reliability</strong>. Practical experience securing, monitoring, log analysis, and conducting investigations in cloud-based environments (we use GCP).</li>\n<li style=\"\"><strong>You pay excellent attention to detail.</strong> When reasoning trade-offs, you’ll put the user first and care deeply about the details.</li>\n<li style=\"\"><strong>You ooze the values of the DevOps mindset.</strong> You’re intensely curious and passionate about running software in DevOps environments and eager to explore DevOps and SRE more.</li>\n<li style=\"\"><strong>You know a thing or two about architecture, containerization, and orchestration.</strong> You’re keen to learn/or use container systems like Docker, Kubernetes, and/or Platform as a Service.</li>\n<li style=\"\"><strong>You bring a strong sense of ownership</strong>. You believe in solving a problem entirely rather than simply shipping a solution. You operate autonomously and follow through on your commitments.</li>\n</ul>\n<p> </p>\n<p><strong>How we work</strong></p>\n<ul style=\"\">\n<li style=\"\">We ask you to be in the time zone UTC ±0 to UTC +2 for this role.</li>\n<li style=\"\">If you’re located outside this time zone range and want to move to the company’s official headquarters in Austria, we’ll handle the <strong>work permit process</strong> and cover travel expenses.</li>\n<li style=\"\">If you prefer to work outside your home, we offer a physical location in Vienna and <strong>co-working stipends</strong> in other cities.</li>\n<li style=\"\">We love <strong>working async.</strong> You can set your own pace and schedule.</li>\n</ul>\n<p> </p>\n<p><strong>Our global perks and benefits</strong></p>\n<ul style=\"\">\n<li style=\"\">We have a <strong>remote-first mentality</strong> and give everyone a home-office budget.</li>\n<li style=\"\"><strong>25 days of paid vacation</strong> in addition to your local public holidays and <strong>paid sick leave</strong>.</li>\n<li style=\"\">We sponsor <strong>team retreats</strong> throughout Europe and remote-friendly activities, like hack weeks and coffee breaks.</li>\n<li style=\"\">To further develop yourself, use our <strong>€1k growth budget</strong> for books, online courses, conferences, or anything else that supports your development.</li>\n<li style=\"\">To give our menstruating team members the time off to cater to their health when needed during their menstrual cycle, we offer up to <strong>2 days of paid menstrual leave</strong> per month.</li>\n<li style=\"\">Depending on your level, your annual gross salary will be <strong>€74k</strong> (Senior), or <strong>€87k</strong> (Principal) gross annually, which will <strong>automatically increase by 5% yearly.</strong> No questions asked.</li>\n<li style=\"\">The chance to build a world-class product, positively impact millions of aspiring developers, and be a virtual owner of the company with <strong>equity</strong> (phantom stock).</li>\n</ul>\n<p> </p>\n<p><strong>Our 4-step hiring process, in a nutshell</strong></p>\n<ul style=\"\">\n<li style=\"\">You’ll first have a video call with a member of the People team for a <strong>quick get-to-know chat.</strong></li>\n<li style=\"\">Then, <strong>you’ll be given a take-home challenge</strong> to work on. Don’t worry; we know you have many things on your plate and good things take time. You won’t be given a deadline.</li>\n<li style=\"\">Next <span style=\"box-sizing: border-box; margin: 0px; padding: 0px;\">is the <strong>technical interview</strong> to show </span>your skills to the hiring manager.</li>\n<li style=\"\">Lastly, you’ll meet your <strong>potential future peers</strong> for a laid-back conversation.</li>\n<li style=\"\">If everything goes smoothly, you’ll receive an <strong>offer</strong> from us shortly after. Fingers crossed!</li>\n</ul>\n<img src=\"https://remotive.com/job/track/1983726/blank.gif?source=public_api\" alt=\"\"/>","tags":"[\".Net\",\"api\",\"backend\",\"C\",\"C#\",\"cloud\",\"docker\",\"go\",\"kubernetes\",\"node.js\",\"video\",\"SRE\",\"AI/ML\",\"Typescript \",\"GCP\",\"chat\",\"infrastructure\",\"travel\"]","pubDate":"2025-03-12T11:02:57.000Z","link":"https://remotive.com/remote-jobs/software-dev/senior-backend-developer-typescript-1983726","slug":"senior-backend-developer-typescript-mimo-gmbh-294"}]