[{"id":9538198684,"title":"Senior Software Engineer, Media","company":"Livekit","image":"https://avatars.githubusercontent.com/u/69438833?s=200&v=4","description":"<p style=\"min-height:1.5em\">At LiveKit, we build open-source APIs to power the future of computing. We are a company of engineers building software stacks for other engineers.</p><p style=\"min-height:1.5em\"></p><p style=\"min-height:1.5em\"><strong>You'll thrive at LiveKit if you:</strong></p><ul style=\"min-height:1.5em\"><li><p style=\"min-height:1.5em\">obsess with crafting code that is fast, reliable and practical for the problem</p></li><li><p style=\"min-height:1.5em\">are known as the go-to person for tackling tough technical problems</p></li><li><p style=\"min-height:1.5em\">work hard and can both build <em>and</em> ship fast</p></li><li><p style=\"min-height:1.5em\">can clearly explain complex technical concepts to others</p></li><li><p style=\"min-height:1.5em\">are a fast learner, frequently picking up new languages and tools</p></li></ul><p style=\"min-height:1.5em\">The best way to impress us is with thoughtful Issues and/or PRs on our Github repos 😊</p><p style=\"min-height:1.5em\"></p><p style=\"min-height:1.5em\"><strong>About this role:</strong></p><p style=\"min-height:1.5em\">Are you passionate about shaping the future of AI and technology? We’re looking for a talented engineer to join the Agents team. This is your chance to work on groundbreaking innovations in Agentic computing, contributing to the development of the software stack that will drive the next wave of technological advancement. If you're eager to make a lasting impact, we want to hear from you!</p><p style=\"min-height:1.5em\"></p><p style=\"min-height:1.5em\"><strong>What You'll Do</strong></p><ul style=\"min-height:1.5em\"><li><p style=\"min-height:1.5em\">Architect and build services like LiveKit Ingress, Egress, and SIP that bridge the LiveKit core infrastructure to the wider media and telecommunications ecosystems</p></li><li><p style=\"min-height:1.5em\">Ideate new ways to incorporate low latency real time media into existing media workflows</p></li><li><p style=\"min-height:1.5em\">Architect systems that anticipate failure and are resilient</p></li><li><p style=\"min-height:1.5em\">Actively monitor, maintain, optimize and strengthen the long-term health of critical systems</p></li><li><p style=\"min-height:1.5em\">Technologies you will work with include: Golang, <a target=\"_blank\" rel=\"noopener noreferrer nofollow\" href=\"https://github.com/livekit/psrpc/\">psrpc</a>, GStreamer, RTP, SIP, WHIP, HLS/DASH, media codecs such as H.264, HEVC, VP9, AV1, Opus</p></li></ul><p style=\"min-height:1.5em\"><strong>Who you are</strong></p><ul style=\"min-height:1.5em\"><li><p style=\"min-height:1.5em\">You are well versed in media processing and video encoding technologies and their trade offs</p></li><li><p style=\"min-height:1.5em\">You are passionate about learning new media technologies and using them in novel ways</p></li><li><p style=\"min-height:1.5em\">You are familiar with challenges of distributed consensus and synchronization and the specificities of distributed media processing systems</p></li><li><p style=\"min-height:1.5em\">You strive to understand how systems work down to the bits</p></li><li><p style=\"min-height:1.5em\">You can hold a lot of complexity in your head</p></li></ul><p style=\"min-height:1.5em\"></p><h2>Our Commitments to You</h2><h3>We offer</h3><ul style=\"min-height:1.5em\"><li><p style=\"min-height:1.5em\">An opportunity to build something truly impactful to the world</p></li><li><p style=\"min-height:1.5em\">Contribute to open source alongside world-class engineers</p></li><li><p style=\"min-height:1.5em\">Competitive salary and equity package</p></li><li><p style=\"min-height:1.5em\">Work anywhere in the world</p></li><li><p style=\"min-height:1.5em\">Health, dental, and vision benefits</p></li><li><p style=\"min-height:1.5em\">Flexible vacation policy</p></li></ul><p style=\"min-height:1.5em\"></p>","tags":"[]","pubDate":"2025-03-16T14:47:04.407Z","link":"https://jobs.ashbyhq.com/livekit/744df57b-f71b-44bc-9400-f497c7b727d0","slug":"senior-software-engineer-media-livekit-5815"},{"id":6234674859,"title":"Marketing Manager","company":"Gameplaygalaxy","image":"https://remotive.com/job/1984911/logo","description":"<div><!--block-->We are looking for a talented and experienced <strong>Marketing Manager</strong> to drive the development of product marketing and content for the most promising project in the Web3 gaming innovation space. We’re seeking someone passionate about brand, content creation and social media engagement to work closely with stakeholders and ensure our games are widely recognized for how great they are.</div><br><br><div class=\"h3\">All the responsibilities we'll trust you with:</div><ul style=\"\"><li style=\"\"><!--block-->You’ll work cross-functionally to define and execute our Web3 brand marketing strategy and content creation, mapping it to quarterly goals.</li><li style=\"\"><!--block-->You’ll develop and lead content planning, storytelling, campaign management and go-to-market strategies for new features, partnerships, and launches.</li><li style=\"\"><!--block-->You’ll be working closely with, and leading a team of experts who will collaborate with the product team and project leads to identify the team and project’s uniqueness and distinct, ‘never heard before’ voice.</li><li style=\"\"><!--block-->You’ll measure content performance across marketing channels, optimizing strategies based on data, engagement, and campaign success.</li><li style=\"\"><!--block-->You’ll work with the global team to meet the defined objectives and provide regular reporting of the results. </li><li style=\"\"><!--block-->You’ll tap into trending industry narratives, encouraging fan and talent engagement through content and community management, ensuring our marketing efforts resonate with target audiences.</li><li style=\"\"><!--block-->You’ll lead cross-functional marketing initiatives across social media platforms, ensuring alignment with gaming and pop culture trends to drive brand adoption and loyalty.</li></ul><br><br><div class=\"h3\">What you'll bring to the team:</div><ul style=\"\"><li style=\"\"><!--block-->At least 4 years of experience in leading marketing strategy and brand recognition, with direct experience in the gaming industry, ideally in Web3 and blockchain gaming.</li><li style=\"\"><!--block-->Excellent storytelling skills with the ability to translate traditional marketing content into engaging and brand relevant conversations.</li><li style=\"\"><!--block-->Passion for community engagement and creating outstanding social experiences.</li><li style=\"\"><!--block-->Strong understanding of digital analytics and performance tracking, both on- and off- chain.</li><li style=\"\"><!--block-->Experience with Web3 marketing platforms, including on-chain analytics, NFT campaigns, token-based engagement, and decentralized media collaborations.</li><li style=\"\"><!--block-->Expertises in social media platforms and ability to adapt quickly to new trends and technologies.</li><li style=\"\"><!--block-->Highly organized, detail-oriented, and accountable in managing multiple projects.</li><li style=\"\"><!--block-->A creative, proactive and experimental mindset, and the ability to test, iterate, and refine marketing strategies based on real-time feedback in a fast-moving, constantly evolving Web3 landscape.</li><li style=\"\"><!--block-->Polished communication and presentation skills in English.</li></ul><br><br><div class=\"h3\">Why you'll love working with us:</div><ul style=\"\"><li style=\"\"><!--block-->We’re 100% remote, work wherever you want forever!</li><li style=\"\"><!--block-->We offer unlimited holidays and sick days. Take as much time off as you need, to spend time with your family and friends or just because you feel like playing games all day. We trust our team and want to offer a modern work life balance that allows you to thrive both at work and in your personal life.</li><li style=\"\"><!--block-->You’ll be able to make an impact, to work closely with the rest of the team and its leads to work on one of the most promising upcoming games in the mobile gaming industry and the Web3 space.</li><li style=\"\"><!--block-->You’ll have a comfortable work schedule and stable workload. With a variety of tasks that will allow your constant professional development.</li><li style=\"\"><!--block-->We want our team to grow personally and professionally and support learning opportunities, especially with a focus around new AI tools and methods. </li><li style=\"\"><!--block-->We have a culture that puts our people first. We believe in open communication, creativity and the value of unique contributions from everyone in the team.</li><li style=\"\"><!--block-->We offer a competitive salary in addition to equity option plans.</li></ul><img src=\"https://remotive.com/job/track/1984911/blank.gif?source=public_api\" alt=\"\"/>","tags":"[\"social media\",\"marketing strategy\",\"digital analytics\"]","pubDate":"2025-03-15T21:51:06.000Z","link":"https://remotive.com/remote-jobs/marketing/marketing-manager-1984911","slug":"marketing-manager-gameplaygalaxy-662"}]