[{"id":1947709031,"title":"Brand & Content Growth Marketing Lead","company":"Pluto Card","image":"https://workablehr.s3.amazonaws.com/uploads/account/logo/548021/logo","description":"<h3>About Pluto </h3><p>Every executive/business owner loves to make more revenue &amp; close more deals, but do you know what the top 3 reasons for a company to shut down is? Poor Cash Flow Management. Overspending, lack of controls 💸🔥.</p><p>But if this is so important, then why don't companies focus on it? </p><p>Because&nbsp;controllinghow you spend money is an excruciatingly boring task compared to figuring out how to earn more. This is made even worse with companies using outdated ERPs, manual processes, tons of excel sheets and more to be able to control their &amp; their employee's spending. Employees hate the process, finance team members are swamped piecing together 100s of manual tools, executives get annoyed during budget planning. </p><p><em>This is what Pluto was built to solve.</em></p><p>Pluto is a MENA's Leading Corporate Card &amp; Spend Management Platform built to bring modern finance &amp; cash management (see the 400+ reviews on G2). Sitting at the intersection of AI, FinTech &amp; B2B SaaS, We’ve raised $6M Seed from top investors and operators, including founders from Ramp<a href=\"http://www.tryramp.com/\" rel=\"nofollow noreferrer noopener\" class=\"external\"></a>, Airbase<a href=\"http://www.airbase.io/\" rel=\"nofollow noreferrer noopener\" class=\"external\"></a>, Plaid<a href=\"http://www.plaid.com/\" rel=\"nofollow noreferrer noopener\" class=\"external\"></a>, Italic<a href=\"https://italic.com/\" rel=\"nofollow noreferrer noopener\" class=\"external\"></a> &amp; Senior Leadership at Shopify<a href=\"http://www.shopify.com/\" rel=\"nofollow noreferrer noopener\" class=\"external\"></a>, Cash App, Checkout.com, Alloy and some of the worlds most successful FinTech VCs like GFC, Graph Ventures, Soma Capital, Adapt Ventures, amongst others who’ve trusted us with their funds 🤩</p><p>We are reinventing corporate finance for the modern age and are solving challenging problems in the B2B payments space.</p><p></p><h3>About the Role </h3><p>This is an extremely unique role. You will be the founding Brand &amp; Content Growth Marketing Lead who will make Pluto into the MOST LOVED finance platform in MENA and beyond. If these emoji's describe you&nbsp;🪄🎨 📣🏴‍☠️🚀 then you should reach out! </p><p>As Pluto's founding Brand &amp; Content Growth Marketing Lead you will help us bring Pluto's brand in front of every ICP in MENA &amp; beyond. You will help us take us from 1000+ businesses who use our products to 1M+ businesses through organic brand &amp; social media growth content strategies. </p><p><strong>Your goal: drive top of funnel impressions by whatever means necessary. </strong></p><p><strong>Here is a scary secret..</strong></p><p>..this is NOT going to be an easy role. There is TONS to do, and we will be expecting a LOT from you. You will be pushed to take your creative energy to new heights and our brand will be in your hands 😬</p><p></p><h3>This role is not for you, if:</h3><ul> <li>Your content work is boring 😴</li> <li>You have only grown a brand before via paid channels</li> <li>You are camera shy</li> <li>You do not have experience being an all-round creative: video editing, canva etc. </li> <li>You rely on many other folks to bring your vision to reality</li> <li>You don't actively rely on data to change your strategies</li> </ul><p></p><h3>What you will be working on: </h3><ul> <li>Creating an experimentation-oriented Brand &amp; Content strategy that will drive our virality across organic channels. </li> <li>Setup marketing operations to re-engage our customers in the most efficient way.</li> <li>Social Media &amp; Brand content creation via mixed channels (Instagram, LinkedIn, TikTok): UGC, videos, webinars, podcasts and more! You will experiment and double down on our top channels. </li> <li>IRL Events: select or build the most impactful events and help Pluto stand out.</li> <li>E-mail marketing: create a marketing strategy that helps us reengage our customers via E-mail marketing </li> <li>Viral activations</li> <li>Innovative and fun marketing initiatives that delight our prospects </li> </ul><p></p><p>⚠️ Pluto is a fast growing startup, the above are examples. Your key KPI is top of funnel exponential growth - how you do this may change based on what you learn!</p><p></p><h3>Requirements: </h3><ul> <li><strong>What is not needed: </strong></li> <ul> <li>Fintech Experience </li> <li>B2B SaaS Experience </li> </ul> <li><strong>You will stand out if: </strong></li> <ul> <li>You have previously lead the growth of your brand, or any other brands (any industry) and taken them to new heights.</li> <li>You have experience working at a high growth startup or a exploding DTC brand. </li> </ul> <li><strong>Core requirements:</strong></li> <ul> <li>A social media/content portfolio is a must.</li> <li><strong>Creative &amp; Brand Development</strong></li> <ul> <li>Strong positioning, storytelling and copywriting abilities to craft brand narratives</li> <li>Experience defining and developing a consistent brand identity (tone, voice, visuals)</li> <li>Expertise in creating engaging content for various platforms (e.g., TikTok, Instagram, YouTube, and LinkedIn).</li> <li>Proficiency with design tools like Figma, Canva, Adobe Creative Suite (Photoshop, Illustrator, Premiere Pro, After Effects).</li> <li>Video editing skills to create short-form and long-form video content (capcut) etc.</li> </ul> <li><strong>Social Media Marketing</strong></li> <ul> <li>Deep understanding of platform algorithms, trends, and audience behaviors (especially LinkedIn, Instagram Reels, and YouTube Shorts)</li> <li>Experience with community building and user engagement strategies</li> </ul> </ul> <ul> <li><strong>Paid Advertising Support</strong></li> <ul> <li>Ability to work with our Paid Advertisement team and help with their creative strategy </li> <li>Knowledge of running boosted posts, influencer and paid campaigns on Meta, LinkedIn &amp; Google Ads</li> <li>Ability to analyze ad performance</li> </ul> <li>Analytics and Data-Driven Decision Making by tracking metrics like engagement, reach, impression, CTRs, etc.</li> </ul> </ul><h3>Benefits: </h3><p><strong>Why join us? </strong></p><ul> <li>Join a fast growing global startup with teammates in USA, UAE, KSA, Canada &amp; more who have worked at some of the best companies in the world like Shopify, Square, Cash App , Google &amp; more. </li> <li>Be a key founding member who will have a huge opportunity to play a strong part in building our future. </li> <li>Equity for every founding member. </li> </ul>","tags":"[\"finance\",\"management\",\"b2b\"]","pubDate":"2025-01-17T00:00:00.000Z","link":"https://apply.workable.com/pluto-card/j/64E0CF076D","slug":"brand-content-growth-marketing-lead-pluto-card-3838"},{"id":3753383183,"title":"Strategic Account Manager (Post-Sales)","company":"Sardine","image":"https://avatars.githubusercontent.com/u/65879301?s=200&v=4","description":"<p style=\"min-height:1.5em\"><strong>Who we are:</strong></p><p style=\"min-height:1.5em\">We are a leader in fraud prevention and AML compliance. Our platform uses device intelligence, behavior biometrics, machine learning, and AI to stop fraud before it happens. Today, over 300 banks, retailers, and fintechs worldwide use Sardine to stop identity fraud, payment fraud, account takeovers, and social engineering scams. We have raised $75M from world-class investors including Andreessen Horowitz, Visa, Experian, FIS, and Google Ventures.</p><p style=\"min-height:1.5em\"></p><p style=\"min-height:1.5em\"><strong>Our culture:</strong></p><ul style=\"min-height:1.5em\"><li><p style=\"min-height:1.5em\">We have hubs in the Bay Area, NYC, Austin, and Toronto. However, we maintain a remote-first work culture. #WorkFromAnywhere</p></li><li><p style=\"min-height:1.5em\">We hire talented, self-motivated individuals with extreme ownership and high growth orientation. </p></li><li><p style=\"min-height:1.5em\">We value performance and not hours worked. We believe you shouldn't have to miss your family dinner, your kid's school play, friends get-together, or doctor's appointments for the sake of adhering to an arbitrary work schedule.</p></li></ul><p style=\"min-height:1.5em\"></p><p style=\"min-height:1.5em\"><strong>Location:</strong></p><ul style=\"min-height:1.5em\"><li><p style=\"min-height:1.5em\">US or Canada (East Coast only) - Remote</p></li><li><p style=\"min-height:1.5em\">From Home / Beach / Mountain / Cafe / Anywhere!</p></li><li><p style=\"min-height:1.5em\">We are a remote-first company with a globally distributed team. So you can find your productive zone and work from there.</p><p style=\"min-height:1.5em\"></p></li></ul><p style=\"min-height:1.5em\"><strong>About the Role:</strong></p><p style=\"min-height:1.5em\">Sardine is rapidly acquiring new customers and executing on an ambitious roadmap. As a result, we're building a world-class customer success team to support our fraud, payments, and compliance-related products as we grow. This role is a combination of Account Manager and Solution Architect. You'll manage a handful of customers and act as their stakeholder within Sardine, helping maximize the value of our products and services. In addition, you will collaborate daily with Sardine teams to help customers meet their risk, fraud, compliance, and payment needs, including risk analytics, data science, integrations, and products.  </p><p style=\"min-height:1.5em\"></p><p style=\"min-height:1.5em\"><strong>You will:</strong></p><ul style=\"min-height:1.5em\"><li><p style=\"min-height:1.5em\">Be the primary point of contact for our customers, attending to day-to-day and 'big picture' problems and opportunities and helping maximize the customer's ROI in Sardine</p></li><li><p style=\"min-height:1.5em\">Build a thorough understanding of our product, technology, and strategy and be able to message these succinctly to customers.</p></li><li><p style=\"min-height:1.5em\">Translate complex product and technology problems into simple and actionable solutions. Be able to manage the solution process both internally and externally.</p></li><li><p style=\"min-height:1.5em\">Speak knowledgeably and advise on best practices relating to fraud and compliance</p></li><li><p style=\"min-height:1.5em\">Build, monitor, and communicate KPIs to clients.</p></li><li><p style=\"min-height:1.5em\">Provide strategic analysis and critical thinking as we plan long-term expansion.</p></li><li><p style=\"min-height:1.5em\">Work with Sardine's risk analytics teams to proactively solve new fraud typologies and actively communicate findings to customers.</p></li></ul><p style=\"min-height:1.5em\"><br /><strong>You are an ideal candidate if:</strong></p><ul style=\"min-height:1.5em\"><li><p style=\"min-height:1.5em\">You've 5+ years of experience in Account Management, Customer Success, Risk Management, or Solutions Architect team</p></li><li><p style=\"min-height:1.5em\">You've Previous compliance, fintech, or AML/KYC experience</p></li><li><p style=\"min-height:1.5em\">You have prior work experience with a B2B company - You understand how customers would integrate API</p></li><li><p style=\"min-height:1.5em\">You have a technical degree or a technical working background</p></li><li><p style=\"min-height:1.5em\">Your analytical skills are second to none; you excel at number crunching and drawing insights</p></li><li><p style=\"min-height:1.5em\">You've working knowledge of SQL and can write basic analysis query</p></li><li><p style=\"min-height:1.5em\">You're capable of translating complex strategies into actionable processes and outcomes</p></li><li><p style=\"min-height:1.5em\">You're a natural at building relationships and collaborating with others</p></li><li><p style=\"min-height:1.5em\">You've got strong presentation skills for both virtual and in-person meetings with various stakeholders</p></li><li><p style=\"min-height:1.5em\">You've previous customer-facing experience, preferably with a technical product</p></li><li><p style=\"min-height:1.5em\">You're an exceptional project manager, synthesizing all inputs and balancing the needs of multiple stakeholders</p></li><li><p style=\"min-height:1.5em\">You constantly think about ways to improve processes</p></li><li><p style=\"min-height:1.5em\">You love making customers more efficient as much as we do!</p></li></ul><p style=\"min-height:1.5em\"></p><p style=\"min-height:1.5em\"><strong>Compensation:</strong> Base pay range of $150,000 - $180,000 + equity with tremendous upside potential + Attractive benefits</p><p style=\"min-height:1.5em\"></p><p style=\"min-height:1.5em\"><strong>Benefits we offer:</strong></p><ul style=\"min-height:1.5em\"><li><p style=\"min-height:1.5em\">Generous compensation in cash and equity</p></li><li><p style=\"min-height:1.5em\">Early exercise for all options, including pre-vested</p></li><li><p style=\"min-height:1.5em\">Work from anywhere: Remote-first Culture</p></li><li><p style=\"min-height:1.5em\">Flexible paid time off, Year-end break, Self care days off</p></li><li><p style=\"min-height:1.5em\">Health insurance, dental, and vision coverage for employees and dependents - <em>US and Canada specific</em></p></li><li><p style=\"min-height:1.5em\">4% matching in 401k / RRSP - <em>US and Canada specific</em></p></li><li><p style=\"min-height:1.5em\">MacBook Pro delivered to your door</p></li><li><p style=\"min-height:1.5em\">One-time stipend to set up a home office — desk, chair, screen, etc.</p></li><li><p style=\"min-height:1.5em\">Monthly meal stipend</p></li><li><p style=\"min-height:1.5em\">Monthly social meet-up stipend</p></li><li><p style=\"min-height:1.5em\">Annual health and wellness stipend</p></li><li><p style=\"min-height:1.5em\">Annual Learning stipend</p></li><li><p style=\"min-height:1.5em\">Unlimited access to an expert financial advisory</p></li></ul><p style=\"min-height:1.5em\"></p><p style=\"min-height:1.5em\">Join a fast-growing company with world-class professionals from around the world. If you are seeking a meaningful career, you found the right place, and we would love to hear from you.</p>","tags":"[\"management\",\"engineering\",\"b2b\"]","pubDate":"2025-01-16T21:11:54.438Z","link":"https://jobs.ashbyhq.com/sardine/9d6e2797-71e3-4244-9cf0-7ccbf0f707da","slug":"strategic-account-manager-post-sales-sardine-2913"},{"id":3390650792,"title":"Design Engineer ","company":"Livekit","image":"https://avatars.githubusercontent.com/u/69438833?s=200&v=4","description":"<p style=\"min-height:1.5em\">LiveKit is revolutionizing the AI landscape by providing the essential network infrastructure that powers multimodal AI interfaces, enabling seamless audio and visual interactions. Founded in 2021, LiveKit has rapidly grown to support over 20,000 developers, including industry giants like OpenAI, Character AI, Spotify, and Meta. Our open-source tools facilitate real-time audio and video applications across various sectors, from customer support to autonomous farming. With a recent $22.7 million Series A funding led by Altimeter Capital, LiveKit is valued at $110 million and continues to drive innovation in AI's \"nervous system,\" ensuring efficient and scalable data transfer to enhance AI capabilities.</p><p style=\"min-height:1.5em\"></p><p style=\"min-height:1.5em\"><strong>Why LiveKit</strong></p><p style=\"min-height:1.5em\">While LiveKit operates as an infrastructure company, we believe that every detail matters—from backend to frontend, from a single line of code to a single pixel. Design is not just how it looks, but how all the pieces work and fit together — from a developer landing on our homepage to connecting and interacting with our APIs for the first time.</p><p style=\"min-height:1.5em\">We’re in search of a Design Engineer to join our design team. The ideal candidate will have experience building highly immersive, interactive, and performant experiences for the web, and is excited about the future of realtime voice and video AI.</p><p style=\"min-height:1.5em\"></p><p style=\"min-height:1.5em\"><strong>What you’ll do</strong></p><ul style=\"min-height:1.5em\"><li><p style=\"min-height:1.5em\">Transform static designs into dynamic, interactive web experiences using core web technologies like HTML, JavaScript, CSS, SVG, and WebGL.</p></li><li><p style=\"min-height:1.5em\">Bring designs to life with tools and frameworks such as Motion (formerly Framer Motion), Lottie, Rive, Three.js, and shaders.</p></li><li><p style=\"min-height:1.5em\">Define and implement best practices for building, optimizing, and maintaining key features across LiveKit’s marketing web surfaces, ensuring accessibility and responsiveness across different viewport sizes.</p></li><li><p style=\"min-height:1.5em\">Proactively identify and prioritize opportunities to improve LiveKit’s marketing surfaces, driving continuous refinement and innovation.</p></li><li><p style=\"min-height:1.5em\">Partner closely with other designers to elevate the quality of design and user experience across all LiveKit projects.</p></li><li><p style=\"min-height:1.5em\">Make things ✨.</p></li></ul><p style=\"min-height:1.5em\"></p><p style=\"min-height:1.5em\"><strong>Who you are</strong></p><ul style=\"min-height:1.5em\"><li><p style=\"min-height:1.5em\">5+ years of experience creating polished, interactive web experiences with a focus on both interaction and motion design.</p></li><li><p style=\"min-height:1.5em\">Skilled in React, Tailwind, TypeScript, and Next.js, with an understanding of modern web standards including a11y.</p></li><li><p style=\"min-height:1.5em\">A portfolio that demonstrates your ability to craft high-performance, thoughtfully designed web experiences, showcasing your interaction and motion sensibilities.</p></li><li><p style=\"min-height:1.5em\">A strong sense of aesthetics and a keen eye for all facets of design, including user experience (UX), visual design, interaction, and motion.</p></li><li><p style=\"min-height:1.5em\">A collaborative problem-solver who thrives in partnerships with developers, designers, and stakeholders, contributing to every phase of a project.</p></li><li><p style=\"min-height:1.5em\">Adaptable and resourceful, with the ability to navigate the ambiguity of a fast-paced startup environment while maintaining a high-quality bar.</p></li><li><p style=\"min-height:1.5em\">Deeply curious about technology—not just the tools of your craft, but also its evolving role in areas like AI, voice, and interactive experiences.</p></li><li><p style=\"min-height:1.5em\">Proficient with design tools like Figma and others that help you turn ideas into reality.</p></li></ul><p style=\"min-height:1.5em\"><strong>Bonus</strong></p><ul style=\"min-height:1.5em\"><li><p style=\"min-height:1.5em\">Experience building for OSS, developer tooling, or similar fields.</p></li><li><p style=\"min-height:1.5em\">Experience designing new experiences based on established patterns or a design system.</p></li></ul><p style=\"min-height:1.5em\">If this sounds like your kind of challenge, we’d love to hear from you. Come join us to build the future of realtime voice and video AI.</p>","tags":"[\"javascript\",\"typescript\"]","pubDate":"2025-01-16T18:17:09.669Z","link":"https://jobs.ashbyhq.com/livekit/e4837514-935a-4a0d-a126-cc8308ad6133","slug":"design-engineer-livekit-6562"},{"id":7206145108,"title":"Growth Analytics","company":"Empower","image":"https://lever-client-logos.s3.us-west-2.amazonaws.com/2e1a369c-b58f-41ac-8d86-4b0a77695e68-1687915522032.png","description":"<p style=\"min-height:1.5em\"><strong>EMPOWER OVERVIEW</strong></p><p style=\"min-height:1.5em\"><a target=\"_blank\" rel=\"noopener noreferrer nofollow\" href=\"http://empower.me/\">Empower</a> is shaking up an outdated financial system by providing real opportunity for our customers: the opportunity to get the cash they need, to access fair credit, and to change their financial story. Today, we’re helping millions of people find financial security through machine learning models that evaluate creditworthiness using a more inclusive lens and mobile-first products: Cash Advance, Thrive line of credit, and Petal credit cards. Tomorrow? Creating even more financial paths for our customers (and their wallets) to succeed.</p><p style=\"min-height:1.5em\">This year, Empower ranked #65 on Inc. 5000’s Fastest-Growing Private Companies list — our third year in a row cracking the top 100 — and was named by Forbes as one of the 25 Next Billion-Dollar Startups for 2024. Empower was also featured by Forbes on America’s Best Startup Employers list in 2023, and our Thrive line of credit product was named by Fast Company as one of 2022’s Next Big Things in Tech.</p><p style=\"min-height:1.5em\">Empower is backed by Sequoia Capital, Blisce, and Icon Ventures. Ready to grow your impact and accelerate your career? Take a look at our open roles — we can’t wait to meet you.</p><p style=\"min-height:1.5em\"></p><p style=\"min-height:1.5em\"><strong>THE EMPOWER WAY</strong></p><p style=\"min-height:1.5em\"><strong>Great Expectations</strong>: We come up with bold, audacious goals for ourselves and go all out for impact</p><p style=\"min-height:1.5em\"><strong>Owner Mindset</strong>: We give every employee latitude to act independently, make smart choices, and move the business forward</p><p style=\"min-height:1.5em\"><strong>Spirited Debate</strong>: We love skeptics and seek counter opinions to challenge our personal assumptions and expand our view</p><p style=\"min-height:1.5em\"><strong>Customer Obsession:</strong> We listen to understand, empathize, and create a memorable, rewarding experience for our community</p><p style=\"min-height:1.5em\"><strong>Inclusive Collaboration</strong>: We believe diverse teams make the best decisions, and we strive to give diverse voices a seat at the table</p><p style=\"min-height:1.5em\"><strong>No Jerks Allowed</strong>: We value our relationships and take the time to build trust and connection and communicate respectfully</p><p style=\"min-height:1.5em\"></p><p style=\"min-height:1.5em\"><strong>WHAT EMPOWER OFFERS</strong></p><p style=\"min-height:1.5em\">Competitive salary</p><p style=\"min-height:1.5em\">Generous equity package</p><p style=\"min-height:1.5em\">Full healthcare benefits</p><p style=\"min-height:1.5em\">Technology expense reimbursement</p><p style=\"min-height:1.5em\">Virtual first environment</p><p style=\"min-height:1.5em\">Empower recently launched in Southeast Asia through our acquisition of Cashalo, the leading online lending platform in the Philippines. Our mission to expand access to credit in the region will take creativity, passion, and drive. Are you in?<br /><br />This Growth Analytics role will focus on analyzing customer acquisition, the user conversion funnel, and customer retention, as well as identifying growth opportunities and providing actionable insights to support decision-making. This opportunity involves cross-functional collaboration, a deep understanding of user behavior, and a strong passion for leveraging data to drive meaningful outcomes. <br /><strong> <br />Key Responsibilities </strong><br />• Take ownership of analyzing user acquisition efforts (e.g., paid media, referral programs), user conversion funnels, customer retention, and ROI, proactively identifying insights and driving strategies to optimize performance and achieve business goals. <br />• Collaborate with the Product and Technology teams to resolve issues impacting conversion rates. <br />• Develop dashboards and reports to monitor key performance indicators (KPIs) for business and marketing efforts. <br />• Identify trends, opportunities, and areas for optimization within marketing strategies and initiatives. <br />• Conduct market research and competitive analysis to inform growth strategies. <br />• Partner with product and technology teams to ensure seamless implementation of data tracking and analytics tools. <br />• Assist in creating financial models and forecasting for marketing initiatives. <br />• Present insights and recommendations to stakeholders, driving data-backed decision-making. <br />• Continuously identify and suggest innovative growth opportunities<br /></p><p style=\"min-height:1.5em\"><br /><strong>Qualifications</strong></p><p style=\"min-height:1.5em\">• Bachelor’s degree in Business Administration, Marketing, Data Analytics, or a related field. <br />• Proven experience as a Business Analyst, preferably in a growth, marketing, or fintech industry. <br />• Strong analytical skills and proficiency in tools such as SQL, Excel, Tableau. <br />• Experience with digital marketing metrics, tools (e.g., Google Analytics, Facebook Ads Manager), and strategies. <br />• Knowledge of financial modeling and ROI analysis. <br />• Excellent and pro-active in communication and strong presentation skills, with the ability to explain complex insights clearly. <br />• Ability to work in a quick and multi-cultural environment. <br />• Leadership ability to align and convince stakeholders with solid insights <br />• Self-motivated, detail-oriented, and capable of managing multiple priorities in a fast-paced environment. <br />• Familiarity with the lending industry or fintech is a plus<br /><br />This Growth Analytics role is required to be on-site based on assigned work arrangements and schedules. The said schedule may differ from full onsite to hybrid onsite and work from home whichever fits the business exigencies.<br /></p><p style=\"min-height:1.5em\">At Empower, we hire for people that push themselves to understand others and seek out ways to challenge their personal assumptions. Our hope is that by fostering such an environment, we strengthen our business and relationships by putting people first. We are committed to building a diverse, inclusive, and equitable workspace where everyone (regardless of age, education, ethnicity, gender, sexual orientation, or any personal characteristics) feels like they belong. Even if your experience doesn’t exactly match up to our job description, you should feel empowered to apply regardless!</p>","tags":"[]","pubDate":"2025-01-16T16:55:23.884Z","link":"https://jobs.ashbyhq.com/empower%20finance/4ff965b6-d28c-4764-9176-ab738f883303","slug":"growth-analytics-empower-3105"},{"id":9491841655,"title":"RESEARCH ASSOCIATE (Work from anywhere in the world)","company":"Wishpond","image":"https://yt3.googleusercontent.com/godmUZWusLdpmQ_8MgednMJQy7ZInLrCJ0KkUxuHnx3jeZubp774PPTdp_8MAWcWlbjYx9SX=s160-c-k-c0x00ffffff-no-rj","description":"<div><b style=\"font-size: 18px\">Wishpond Technologies currently has the position of RESEARCH ASSOCIATE available and we’re excited to tell you about it !</b></div><div><br></div><div><b style=\"font-size: 24px\">OVERVIEW</b></div><div>We are searching for a&nbsp;Research Associate&nbsp;to join our growing team on a full-time basis. This is a fully remote position and the successful individual could be based anywhere in the world. You will work with an amazing remote team servicing and building relationships with clients based in the US and Canada. As a&nbsp;Research Associate, you will determine whether or not potential Small and Medium sizes business (SMB) candidates meet our filtering criteria. In collaboration with the entire Team, the Research Associate is responsible for the success of Wishpond Technologies.</div><div><br></div><div><b style=\"font-size: 24px\">RESPONSIBILITIES&nbsp;&nbsp;</b></div><div>• Gather and enter data from multiple sources for suitable SMBs that meet our filtering criteria</div><div>• Use critical thinking and problem-solving skills in order to manage situations or prospects which do not meet our standard procedures</div><div>• Find alternate sources for information including emails, FB profiles, Twitter profiles, Instagram and other Social Media platforms</div><div>• Meet specific goals and deadlines in a high volume data research environment</div><div>• Create and maintain email marketing campaigns using sales automation tools</div><div>• Monitor the activity of email accounts</div><div>• Handle administrative tasks as required</div><div>• Collaborate with and support the Sales and Email Deliverability teams</div><div>• Other duties as assigned</div><div><br></div><div><b style=\"font-size: 24px\">QUALIFICATIONS</b></div><div>• Proficient in the usage of Google Sheets</div><div>• Meticulous data entry and research skills</div><div>• As part of a diverse team, the ability to work both independently and collaboratively</div><div>• Must be detail oriented and have a passion for data research</div><div>• Self-motivated with the ability to establish and maintain solid relationships through a client-first mentality&nbsp;</div><div>• Must be technical, analytical, results-driven, and have the ability to multi-task in a fast-paced environment</div><div>• Organized, administratively strong, and have solid writing, phone, and general communication skills</div><div>• Fluent in English (spoken and written). Knowledge of a second language is considered an asset</div><div>• Willing to participate in ongoing education and training for the role</div><div>• Email marketing / outbound marketing background&nbsp; would be an asset</div><div><br></div><div><b style=\"font-size: 24px\">WORK ENVIRONMENT</b></div><div>• It is expected that the successful candidate will provide their own workstation, computer, camera (not keyboard version), headset, and have a fast and reliable internet connection. Certain roles will be required to utilize and or download company-approved software.</div><div>• The individual must be prepared to work on Pacific Standard Time (PST) / Pacific Daylight Time (PDT)</div><div>• Due to the nature of this role, we may verify backgrounds, including conducting employment references, criminal record, and credit checks.</div><div>• Once hired, the successful candidate must provide a valid government-issued photo ID as part of their onboarding process.</div><div>&nbsp;</div><div><b style=\"font-size: 24px\">GREAT REASONS TO APPLY FOR THIS ROLE</b></div><div>• Fully remote position allowing you to work from your home anywhere in the world</div><div>• Exciting and dynamic environment with a great leadership team&nbsp;</div><div>• Comprehensive training program and regular performance reviews to facilitate your success</div><div>• Competitive compensation based on experience and proven abilities</div><div>• Great referral programs with incentives and bonuses</div><div>• Unbelievable product discounts when you use our products for your own business</div><div>• A global workforce of multi-cultural and talented colleagues&nbsp;</div><div>• A close-knit operation with amazing growth opportunities for your personal development</div><div>• A high growth SaaS company publicly traded on the TSX Venture Exchange</div><div>• Corporate headquarters in beautiful Vancouver, British Columbia, Canada</div><div>• Access to our education credits program and so much more !</div><div><br></div><div><b style=\"font-size: 24px\">ABOUT US</b></div><div>Founded in 2009, Wishpond is a rapidly growing technology company providing digital marketing solutions targeted at small businesses.&nbsp; The cloud-based platform includes landing pages, social promotions, website pop-ups, online forms, and lead activity tracking. Wishpond has a dedicated team of professional project managers, designers, copywriters, and developers who provide marketing services tailored to our individual clients.</div><div>&nbsp;</div><div>Wishpond serves over 3,000 customers in various industries and sizes, from startups to large fortune 500 companies. Wishpond has a rapidly growing global headcount and continues to hire dedicated and qualified employees and contractors who have what it takes to scale a successful software company.</div><div><br></div><div>To learn more about Wishpond Technologies, please visit our website or any of our social media platforms:</div><div><br></div><div>• Website: <a href=\"http://www.wishpond.com/\">www.wishpond.com</a></div><div>• Instagram: @wishpondofficial</div><div>• Twitter: Wishpond</div><div>• Youtube: Thewishpond</div><div>• LinkedIn: Wishpond</div><div><br></div><div><b style=\"font-size: 24px\">APPLICATION PROCESS</b></div><div><b>&nbsp;If you are interested in applying for this exciting opportunity, please provide an updated resume in English (PDF or Word formats only), quoting the position title in the subject line of your cover letter</b></div><div><br></div><div>Wishpond Technologies is an equal opportunity employer committed to hiring a diverse workforce and sustaining an inclusive culture that does not discriminate on the basis of disability, status or any other basis protected under legislation</div><div>&nbsp;</div><div>We thank all applicants in advance for their interest in this position however, due to the volume of applications we receive, we are unable to respond to phone, email, or agency inquiries.</div><div><br></div><div>Please note that applications will be accepted from current Team Members until Wednesday, January 22, 2025, at 5:00 p.m. Pacific time zone.</div>","tags":"[]","pubDate":"2025-01-16T16:18:34.079Z","link":"https://jobs.lever.co/wishpond/f628b97d-87c5-42fd-b12f-818b7048cb8a","slug":"research-associate-work-from-anywhere-in-the-world-wishpond-9411"},{"id":5541332034,"title":"Junior Accountant | Ruby Labs","company":"Ruby Labs","image":"https://media.licdn.com/dms/image/v2/D4D0BAQF7VVv61POIFw/company-logo_200_200/company-logo_200_200/0/1721937953426?e=1743033600&v=beta&t=_qAkZ_qGO7Du2NSUdHDNbUKIbz28Y1HDm1g9mwNIOnk","description":"<p style=\"min-height:1.5em\"></p><div style=\"text-align:center\"><img style=\"max-width:100%\" src=\"https://app.ashbyhq.com/api/images/user-content/49307af8-ad4e-48bf-ab90-4953176fd044/227f800c-4c16-4a97-b4a6-a110a2a90538/image.png\" width=\"600\" /></div><h1><br /><strong>About us</strong></h1><p style=\"min-height:1.5em\">Ruby Labs is a leading tech company that creates and operates innovative consumer products. We offer a diverse range of opportunities across the health, education, and entertainment industries. Our innovative teams are driving the future of consumer-led products, and we're always looking for passionate individuals to join us. Learn more about our story at: <a target=\"_blank\" rel=\"noopener noreferrer nofollow\" href=\"https://rubylabs.com/about-us/\">https://rubylabs.com/about-us/</a></p><p style=\"min-height:1.5em\"></p><h1><strong>About the role</strong></h1><p style=\"min-height:1.5em\">We are looking for a Junior Accountant who will be responsible for day-to-day accounting, monthly close, and assisting the team with ad-hoc projects.</p><p style=\"min-height:1.5em\"></p><h1><strong>Key Responsibilities</strong></h1><ul style=\"min-height:1.5em\"><li><p style=\"min-height:1.5em\">Post and process journal entries to ensure all business transactions are recorded</p></li><li><p style=\"min-height:1.5em\">Record day-to-day financial transactions and perform reconciliations</p></li><li><p style=\"min-height:1.5em\">Enter data and maintain records</p></li><li><p style=\"min-height:1.5em\">Perform other tasks to assist the team such as processing payments, reviewing expenses, and processing invoices</p></li><li><p style=\"min-height:1.5em\">Assist the Supervisor Accountant in the preparation of monthly closings</p></li><li><p style=\"min-height:1.5em\">Perform other job-related duties as assigned</p></li></ul><h1><strong>Qualifications</strong></h1><ul style=\"min-height:1.5em\"><li><p style=\"min-height:1.5em\">Bachelor's degree in Accounting &amp; Finance or similar</p></li><li><p style=\"min-height:1.5em\">1-3 years of experience</p></li><li><p style=\"min-height:1.5em\">Knowledge of accounting principles and practices</p></li><li><p style=\"min-height:1.5em\">Excel / Google Sheets knowledge</p></li><li><p style=\"min-height:1.5em\">Analytical thinking skills and attention to detail</p></li><li><p style=\"min-height:1.5em\">Ability to work well in a remote setting</p></li></ul><h1><strong>Nice to have</strong></h1><ul style=\"min-height:1.5em\"><li><p style=\"min-height:1.5em\">Experience with Sage Intacct</p></li></ul><h1><strong>Location</strong></h1><p style=\"min-height:1.5em\">Ruby Labs operates within the CET (Central European Time) zone. Applicants from any country are welcome to apply for the position as long as they are located within approximately ± 4 hours of CET. This ensures optimal collaboration and communication during working hours.</p><p style=\"min-height:1.5em\"></p><h1><strong>Benefits</strong></h1><p style=\"min-height:1.5em\">Discover the perks of being part of our vibrant team! We offer:</p><ul style=\"min-height:1.5em\"><li><p style=\"min-height:1.5em\"><strong>Remote Work Environment:</strong> Embrace the freedom to work from anywhere, anytime, promoting a healthy work-life balance. 🏡⏰</p></li><li><p style=\"min-height:1.5em\"><strong>Unlimited PTO:</strong> Enjoy unlimited paid time off to recharge and prioritize your well-being, without counting days. 🌴💼</p></li><li><p style=\"min-height:1.5em\"><strong>Paid National Holidays:</strong> Celebrate and relax on national holidays with paid time off to unwind and recharge. 🎉🌟</p></li><li><p style=\"min-height:1.5em\"><strong>Company-provided MacBook:</strong> Experience seamless productivity with top-notch Apple MacBooks provided to all employees who need them. 💻🚀</p></li><li><p style=\"min-height:1.5em\"><strong>Flexible Independent Contractor Agreement:</strong> Unlock the benefits of flexibility, autonomy, and entrepreneurial opportunities. Benefit from tax advantages, networking opportunities, reduced employment obligations, and the freedom to work from anywhere. Read more about it here: <a target=\"_blank\" rel=\"noopener noreferrer nofollow\" href=\"https://docs.google.com/document/d/1dHF4ctKlez75whdn-ybUwP5d5Wr0BdwVrorrm_fM40Q/preview\">https://docs.google.com/document/d/1dHF4ctKlez75whdn-ybUwP5d5Wr0BdwVrorrm_fM40Q/preview</a> 📈💼</p></li></ul><p style=\"min-height:1.5em\">Be part of our fast-growing team and seize this excellent opportunity for personal and professional growth!</p><p style=\"min-height:1.5em\"></p><h1><strong>Interview Process</strong></h1><p style=\"min-height:1.5em\">After submitting your application, we conduct a thorough review which typically takes 3 to 5 days, but may occasionally take longer due to the volume of applications received. If we see a potential fit, we proceed with the following steps:</p><ul style=\"min-height:1.5em\"><li><p style=\"min-height:1.5em\">Recruiter Screening (40 minutes)</p></li><li><p style=\"min-height:1.5em\">Technical Interview (60 minutes)</p></li><li><p style=\"min-height:1.5em\">Final Interview (30 minutes)</p></li></ul><p style=\"min-height:1.5em\"></p><h1><strong>Life at Ruby Labs</strong></h1><p style=\"min-height:1.5em\">At Ruby Labs, we are more than a team; we're a community united in pushing the boundaries of technology and innovation. Our combined passion fuels our ambition for excellence, driving impact that resonates around the globe.</p><p style=\"min-height:1.5em\">We are an equal-opportunity employer and celebrate diversity, recognizing that a diversity of thought and backgrounds builds stronger teams. We approach diversity and inclusion seriously and thoughtfully. We do not discriminate based on race, ethnicity, religion, color, place of birth, sex, gender identity or expression, sexual orientation, age, marital status, military service status, or disability status. Join us and be part of a company that is crafting the future of technology across multiple industries.</p><p style=\"min-height:1.5em\"></p><p style=\"min-height:1.5em\">#Li-Remote</p>","tags":"[\"finance\"]","pubDate":"2025-01-16T15:52:55.304Z","link":"https://jobs.ashbyhq.com/ruby-labs/9d42a39c-c241-4b47-a62b-158a01791cf6","slug":"junior-accountant-ruby-labs-ruby-labs-9268"},{"id":6800198240,"title":"Data Engineer","company":"Supabase","image":"https://avatars.githubusercontent.com/u/54469796?s=200&v=4","description":"<p style=\"min-height:1.5em\">Supabase is an Open Source and fully remote company building developer tools for databases. We are seeking a Data Engineer.</p><p style=\"min-height:1.5em\"><strong>You will:</strong></p><ul style=\"min-height:1.5em\"><li><p style=\"min-height:1.5em\">Create, refactor, and test Airflow jobs syncing data among various input sources, Hubspot, and dbt reporting models.</p></li><li><p style=\"min-height:1.5em\">Create, refactor, and test our DBT models with the goal of developing a single source of truth for each data feature.</p></li><li><p style=\"min-height:1.5em\">Develop reports based on DBT model outputs.</p></li></ul><p style=\"min-height:1.5em\"><strong>You are:</strong></p><ul style=\"min-height:1.5em\"><li><p style=\"min-height:1.5em\">A data engineer with experience in complex DBT models, managing Airflow pipelines, and infrastructure as code (ideally Pulumi).</p></li><li><p style=\"min-height:1.5em\">Comfortable refactoring data systems in-place with high uptime.</p></li><li><p style=\"min-height:1.5em\">Highly autonomous and able to translate business needs into concrete metrics.</p></li><li><p style=\"min-height:1.5em\">Experienced in cross-functional collaboration, you can deliver insights for Product and Business teams.</p></li></ul><p style=\"min-height:1.5em\"><strong>We offer:</strong></p><ul style=\"min-height:1.5em\"><li><p style=\"min-height:1.5em\">100% remote work from anywhere in the world. No location-based adjustment to your salary.</p></li><li><p style=\"min-height:1.5em\">Autonomous work. We work collaboratively on projects, but you set your own pace.</p></li><li><p style=\"min-height:1.5em\">Health, Vision and Dental benefits. Supabase covers 100% of the cost for employees and 80% for dependents</p></li><li><p style=\"min-height:1.5em\">Generous Tech Allowance for any office setup you need</p></li><li><p style=\"min-height:1.5em\">Annual Education Allowance</p></li><li><p style=\"min-height:1.5em\">Annually run off-sites.</p></li></ul><h2>About the team</h2><ul style=\"min-height:1.5em\"><li><p style=\"min-height:1.5em\">We're a startup. It's unstructured.</p></li><li><p style=\"min-height:1.5em\">Collectively founded more than 30 startups.</p></li><li><p style=\"min-height:1.5em\">Globally distributed team with more than 30 different nationalities.</p></li><li><p style=\"min-height:1.5em\">We deeply believe in <a target=\"_blank\" rel=\"noopener noreferrer nofollow\" href=\"https://supabase.com/blog/2022/03/25/should-i-open-source-my-company\">the efficacy of collaborative open source</a>. We support existing communities and tools, rather than building \"yet another xx\".</p></li><li><p style=\"min-height:1.5em\">We \"dogfood\" everything. If you use it in your project, we use it in Supabase.</p></li></ul><h2>Process</h2><ul style=\"min-height:1.5em\"><li><p style=\"min-height:1.5em\">The entire process is fully remote and all communication will happen over email or via video chat.</p></li><li><p style=\"min-height:1.5em\">Once you've submitted your application, the team will review your submission and may reach out for a short screening interview over a video call.</p></li><li><p style=\"min-height:1.5em\">If you pass the screen you will be invited to up to four follow-up interviews. </p></li><li><p style=\"min-height:1.5em\">The calls:</p><ul style=\"min-height:1.5em\"><li><p style=\"min-height:1.5em\">usually take between 20-45 minutes each depending on the interviewer.</p></li><li><p style=\"min-height:1.5em\">most of the time, are all 1:1.</p></li><li><p style=\"min-height:1.5em\">will be with the founders, a member of either the growth or engineering team (depending on the role) and usually one other person from your immediate team or function.</p></li></ul></li><li><p style=\"min-height:1.5em\">Once the interviews are over, the team will meet to discuss several roles and candidates and may:</p><ul style=\"min-height:1.5em\"><li><p style=\"min-height:1.5em\">ask one or two follow-up questions over email or a quick call.</p></li><li><p style=\"min-height:1.5em\">go directly to making an offer.</p></li></ul></li></ul>","tags":"[\"pulumi\",\"engineering\",\"database\"]","pubDate":"2025-01-16T15:43:15.459Z","link":"https://jobs.ashbyhq.com/supabase/f083c0b7-d19c-4375-b882-7947b294b993","slug":"data-engineer-supabase-2129"},{"id":8177799969,"title":"Senior Product Manager","company":"Airalo","image":"https://lever-client-logos.s3.us-west-2.amazonaws.com/55028a36-609c-479c-9553-d4689ff2dd8c-1669620566663.png","description":"<div><b>About Airalo</b></div><div>Alo! Airalo is the world’s first eSIM store that helps people connect in over 200+ countries and regions across the globe. We are building the next digital service that revolutionizes the telecom industry. We are a travel-tech company and an equal-opportunity environment that values and executes diversity, inclusion, and equity. Our team is spread across 50+ countries and six continents. What glues us together is our commitment to changing the way you connect<span style=\"font-size: 13.3333px\">. </span></div><div><br></div><div><b>About you</b></div><div>We hope that you care deeply about the quality of your work, the intrinsic worth of tasks, and the success of your team. You are self-disciplined and do not require micromanagement in terms of your skillset and work ethic. You do your best to flourish as an individual every day while working hard to foster a collaborative team environment. You believe in the importance of being — and staying — authentic, honest, positive, and kind. You are a good interlocutor with clear and concise communication. You are able to manage multiple projects, have an analytical mind, pay keen attention to detail, and love to get your hands dirty. You are cognizant, tolerant, and welcoming of vulnerabilities and cultural differences.</div><div><br></div><div><b>About the Role</b></div><div><b>Position</b>: Full-time / Employee</div><div><b>Location:</b>&nbsp;Remote-first </div><div><b>Benefits:</b>&nbsp;Health Insurance, work-from-anywhere stipend, annual wellness &amp; learning credits, annual all-expenses-paid company retreat in a gorgeous destination &amp; other benefits</div><div><br></div><div>As a Senior Product Manager, you will drive the strategy and execution of our product roadmap, focusing on delivering an unparalleled user experience to international travelers. Your role will be crucial in identifying and responding to the dynamic needs of our users, leading the charge in the development and implementation of innovative features. By orchestrating cross-functional teams, you will ensure the successful development, launch, and growth of our products, making every journey more seamless and connected.</div><div><br></div><div>To successfully accomplish this, you will partner closely with Engineering, Research, Design, Support, and Growth teams.</div><div>You are curious, humble and take pride in seeing others succeed as a result of your support and leadership. You are an excellent collaborator, with cross-discipline experience working to successfully deploy products and work streams.</div><h3>Your main responsibilities will be to:</h3><li>Work closely with the Director of Product and other team members in the department</li><li>Define, analyze and optimise the KPIs to grow your Product area while measuring impact and reporting on progress</li><li>Apply product management best practices incorporating working backwards, thorough product discovery and data insights to have a strong understanding of our users and identify new product opportunities</li><li>Own, prioritise and manage a backlog with clear Product Requirements Documents while ensuring successful and high quality product delivery</li><li>Work closely with&nbsp;Engineering, Product, Support, Growth and other departments to gather insights from our users and suggest improvements</li><li>Understand the needs of users and convert them into requirements for the engineering team</li><li>Ensure that the development team has a clear understanding of the product vision, goals, and priorities</li><li>Manage and mentor a designer within the product team, ensuring that design efforts align closely with product strategies and user experience goals, fostering collaboration between design and product development processes.</li>,<h3>Does this sound like you?</h3><li>5+ years of building world-class products as a Product Manager or Product Owner or relevant experience</li><li>Experience in defining, building, and shipping complex, technical products</li><li>Experience in collaborating with and designers, engineers, Q/A in an agile environment</li><li>Experience in creating and iterating product roadmaps</li><li>Experience in facilitating technical discussions about products and features and providing feedback for technical designs</li><li>Strong analytical and problem-solving skills and data-driven decision-making</li><li>Extraordinary attention to detail by thinking the beauty is hidden in them</li><li>Proven experience in user-centered design and research, with the ability to understand user needs and design products to meet those needs</li><li>Experience in Lean process as well as experience with agile/scrum methodology</li><li>Excellent verbal and written communication skills</li>,<h3>Good-to-have:</h3><li>Product experience in e-commerce, marketplace platforms, and mobile applications</li><li>Experience with Jira, Figma, QuickSight, Tableau, Dovetail, Google Analytics, Hotjar</li><li>Prior work experience in telecommunications or travel-tech</li><li>Knowledge of eSIM and GSMA-related technologies and services</li><div>If you are interested in this position, <b>please apply via the link.</b></div><div><br></div><div><i style=\"font-size: 15px;\">Please note that our Product team works in the CET timezone, so candidates will need to reside in countries with the same time zone or similar to it and will need to already have permit to work in the country where they are based.</i></div><div><br></div><div>We sincerely thank all applicants in advance for submitting their interest in this opportunity. Airalo is an equal opportunity employer and values diversity, equity &amp; inclusion. We do not discriminate on the basis of race, religion, national origin, gender, sexual orientation, age, marital status, veteran status, or disability status. We are committed to providing reasonable accommodations upon request for individuals with disabilities throughout our job interview process.</div>","tags":"[\"management\",\"engineering\"]","pubDate":"2024-12-18T10:04:19.392Z","link":"https://jobs.lever.co/airalo/c072434b-2ba1-4d73-914b-768957399b22","slug":"senior-product-manager-airalo-6146"}]