[{"id":9425538817,"title":"Senior Mobile ClojureScript UI Developer ","company":"Status","image":"https://pbs.twimg.com/profile_images/966759182589308928/s5rZXoWk_400x400.jpg","description":"\n    <div class=\"content-intro\"><p style=\"text-align: justify;\"><strong>About Status</strong></p>\n<p style=\"text-align: justify;\"><span style=\"font-weight: 400;\">Status is building the tools and infrastructure for the advancement of a secure, private, and open web3.&nbsp;</span></p>\n<p style=\"text-align: justify;\"><span style=\"font-weight: 400;\">With the high level goals of preserving the right to privacy, mitigating the risk of censorship, and promoting economic trade in a transparent, open manner, Status is building a community where anyone is welcome to join and contribute.</span></p>\n<p style=\"text-align: justify;\"><span style=\"font-weight: 400;\">As an organization, Status seeks to push the web3 ecosystem forward through research, creation of developer tools, and support of the open source community.&nbsp;</span></p>\n<p style=\"text-align: justify;\"><span style=\"font-weight: 400;\">As a product, Status is an open source, Ethereum-based app that gives users the power to chat, transact, and access a revolutionary world of DApps on the decentralized web. But Status is also building foundational infrastructure for the whole Ethereum ecosystem, including the Nimbus ETH 1.0 and 2.0 clients, the Keycard hardware wallet, and the Waku messaging protocol; the p2p communication layer for Web3.</span></p>\n<p style=\"text-align: justify;\"><span style=\"font-weight: 400;\">As a team, Status has been completely distributed since inception.&nbsp; Our team is currently 200+ core contributors strong, and welcomes a growing number of community members from all walks of life, scattered all around the globe.&nbsp;</span></p>\n<p style=\"text-align: justify;\"><span style=\"font-weight: 400;\">We care deeply about open source, and our organizational structure has minimal hierarchy and no fixed work hours. We believe in working with a high degree of autonomy while supporting the organization's priorities.</span></p></div>\n\n    <p class=\"p1\"><strong>The role</strong></p>\n<p class=\"p1\">We're growing our mobile development team. Join us in building a fully decentralized, censorship resistant, privacy first group chat platform that leverages the Ethereum blockchain to enable individuals and groups worldwide to communicate and transact with one another freely without restriction.</p>\n<p class=\"p1\">Status is looking for a Clojure UI Engineer to join our mobile development team who will work closely with Design to transform UI specifications into beautiful, smooth, performant and near pixel perfect interactive interfaces. The ideal person will be comfortable working on features end-to-end, has an eye for design and visual detail, enjoys working with designers as well as developers, and who can transform reused UI patterns such as list items into reusable UI components. &nbsp;The ideal candidate will love finessing UI implementations to the highest levels of quality and will care deeply about things like code cleanliness, reusability, maintainability, performance, and UI layout accuracy - as well as doing whatever needed to create a best-in-class user experience for Status’s users.</p>\n<p class=\"p1\">Willingness to both learn and share your knowledge with others, product-orientation, and making sure all team members are aligned when developing new features, will make you successful in the role. Status is a fast-paced, flat organization, working on cutting edge blockchain and decentralized messaging technologies in a dynamic landscape. We look forward to meeting you!</p>\n<p class=\"p1\"><strong>Key responsibilities:</strong></p>\n<ul class=\"ul1\">\n<li class=\"li1\">Implement new features end to end.&nbsp;</li>\n<li class=\"li1\">Collaborate closely with the Design team around both the designs and the implementation of the designs.</li>\n<li class=\"li1\">Craft eye catching UIs and propose improvements to our code base.</li>\n<li class=\"li1\">Sense checking with the team and prioritizing work from our backlog.</li>\n</ul>\n<p class=\"p1\"><strong>You ideally will have:</strong></p>\n<ul class=\"ul1\">\n<li class=\"li1\">Experience working with ClojureScript and React Native</li>\n<li class=\"li1\">Eye for detail; point us to completed implementation work.</li>\n<li class=\"li1\">3+ years of experience working on complex UI applications.</li>\n<li class=\"li1\">Experience in, and passion for, blockchain technology.</li>\n<li class=\"li1\">A strong alignment to our principles:&nbsp;<a href=\"https://status.im/about/#our-principles\"><span class=\"s2\">https://status.im/about/#our-principle</span></a></li>\n</ul>\n<p class=\"p1\"><strong>Bonus points if:</strong></p>\n<ul class=\"ul1\">\n<li class=\"li1\">Experience working remotely.&nbsp;</li>\n<li class=\"li1\">Experience working for an open source organization.&nbsp;&nbsp;</li>\n</ul>\n<p class=\"p1\">[Don’t worry if you don’t meet all of these criteria, we’d still love to hear from you anyway if you think you’d be a great fit for this role. Just explain to us why in your cover letter].</p>\n<p class=\"p1\"><strong>Compensation:&nbsp;</strong></p>\n<p class=\"p1\">We are happy to pay in either 100% fiat or any mix of fiat and/or crypto.</p>\n\n    \n\n    \n","tags":"[]","pubDate":"2024-01-09 05:06:53.228","link":"https://boards.greenhouse.io/embed/job_app?for=status72&token=3702173&b=https%3A%2F%2Fjobs.status.im%2F","savedDate":"2024-01-09 05:06:53.228","slug":"senior-mobile-clojurescript-ui-developer-status-9052"},{"id":5246140953,"title":"Embedded Linux Field Engineer","company":"Canonical","image":"https://pbs.twimg.com/profile_images/1673959375340290050/x7pNtXQ7_400x400.jpg","description":"\n      <h2>The role of a Embedded Linux Field Engineer at Canonical</h2>\n<p>Our flagship product in IoT, Ubuntu Core, is <strong>unique</strong>. It is Linux reinvented for optimal reliability, security and footprint. Our customers come from a wide variety of industries - Automotive, Customer Electronics, Medical Devices, Industrial Systems, Robotics, Gateways, and so many more - but they all have this in common: they strive to meet stringent quality and security requirements.&nbsp;&nbsp;</p>\n<p>To cope with our rapid expansion, we are looking to expand our team of Field Engineers in the Devices division. This critical position is a tremendous career builder for the right candidate, as you would be required to learn quickly new technologies and help our customers devise solutions at the bleeding edge of many industries.</p>\n<p>Our Field Engineers do <em>what is right for the client</em>. They are accomplished technologists that take a hands-on approach to field engineering leadership. They have a passion to help customers achieve ambitious technical and business goals, and to show how the Canonical approach to open source and connected devices brings best-of-breed thinking to the emerging field of edge compute. They also care to develop their colleagues, helping them deepen their understanding of the technology, their ability to manage time, and their awareness of customer business thinking for continuous improvement and personal development.</p>\n<p>This career opportunity requires a unique blend of skills. Successful candidates will know Linux well and be proficient coders and scripters. They will have experience of low-level Linux boot, BIOS, firmware and embedded software development methodologies. They also enjoy the pace of change and diversity of client engagements with driven and ambitious technology entrepreneurs. Competitive, business-focused technologists at heart, they are also dedicated team players that take pride in team and company wins.</p>\n<p><strong>Location:</strong> <em>This position is currently open in the following regions and countries only: Japan, South Korea, EMEA and North America</em><em><br></em></p>\n<p>What your day will look like</p>\n<ul>\n<li>Engage customers during presales to gather requirements and explain our technology</li>\n<li>Elaborate solutions to be proposed to prospective clients</li>\n<li>Participate to the delivery of select projects related to Embedded Linux</li>\n<li>Convey market requirements to key stakeholders in our organization, and sometimes participate to the development or refining of generic solutions to unlock market potential</li>\n<li>Be both a customer advocate and a trusted advisor to Canonical</li>\n</ul>\n<h2>What we are looking for in you</h2>\n<ul>\n<li>Bachelors degree in Computer Science or related technical field</li>\n<li>Extensive Linux experience - Debian or Ubuntu preferred</li>\n<li>Solid embedded Linux experience - Yocto or RTOS</li>\n<li>Fluency in at least one of Golang, Python, C, C++, or Rust</li>\n<li>Professional written and spoken English in addition to the local language</li>\n<li>Excellent communication and presentation skills</li>\n<li>Result-oriented, ability to multi-task</li>\n<li>A personal drive to meet commitments</li>\n<li>An humble learner and quick study</li>\n<li>Albeit many projects can be done remotely, the successful candidate will be willing to&nbsp; travel up to 30% of the time for customer meetings, company events, and conferences</li>\n<li><strong>For all positions, the successful candidates will be located in one of the following territories: AMER, EMEA, Japan or South Korea</strong></li>\n<li><strong>For positions in Japan and South Korea, the successful candidates will also be able to speak and write Japanese/Korean at a professional level.</strong></li>\n</ul>\n<h2>Additional skills that you might also bring</h2>\n<ul>\n<li>Experience with customer engagements a plus</li>\n</ul>\n<h2>What we offer you</h2>\n<p>Your base pay will depend on various factors including your geographical location, level of experience, knowledge and skills. In addition to the benefits below, certain roles are also eligible for additional benefits and rewards including annual bonuses and sales incentives based on revenue or utilisation. Our compensation philosophy is to ensure equity right across our global workforce.&nbsp;&nbsp;</p>\n<p>In addition to a competitive base pay, we provide all team members with additional benefits, which reflect our values and ideals. Please note that additional benefits may apply depending on the work location and, for more information on these, you can ask in the later stages of the recruitment process.</p>\n<ul>\n<li>Fully remote working environment - we’ve been working remotely since 2004!</li>\n<li>Personal learning and development budget of 2,000USD per annum</li>\n<li>Annual compensation review</li>\n<li>Recognition rewards</li>\n<li>Annual holiday leave</li>\n<li>Parental Leave</li>\n<li>Employee Assistance Programme</li>\n<li>Opportunity to travel to new locations to meet colleagues at ‘sprints’</li>\n<li>Priority Pass for travel and travel upgrades for long haul company events</li>\n</ul>\n<h2>About Canonical</h2>\n<p>Canonical is a pioneering tech firm that is at the forefront of the global move to open source. As the company that publishes Ubuntu, one of the most important open source projects and the platform for AI, IoT and the cloud, we are changing the world on a daily basis. We recruit on a global basis and set a very high standard for people joining the company. We expect excellence - in order to succeed, we need to be the best at what we do.</p>\n<p>Canonical has been a remote-first company since its inception in 2004.​ Work at Canonical is a step into the future, and will challenge you to think differently, work smarter, learn new skills, and raise your game. Canonical provides a unique window into the world of 21st-century digital business.</p>\n<h2>Canonical is an equal opportunity employer</h2>\n<p>We are proud to foster a workplace free from discrimination. Diversity of experience, perspectives, and background create a better work environment and better products. <a href=\"https://canonical.com/careers/diversity/identity\">Whatever your identity, we will give your application fair consideration.</a></p>\n<p>#LI-remote </p>\n    ","tags":"[\"engineering\"]","pubDate":"2024-01-09 05:06:53.228","link":"https://canonical.com/careers/3362765","savedDate":"2024-01-09 05:06:53.228","slug":"embedded-linux-field-engineer-canonical-9600"},{"id":3912217486,"title":"Head of Integrations","company":"SafetyWing","image":"https://pbs.twimg.com/profile_images/1177267684574208000/54eG3WmW_400x400.jpg","description":"<h2>🧘 What we offer</h2> <div><!--block-->We operate in a fully remote work environment – work from anywhere globally.&nbsp;<br><br>You will receive salary and equity compensation, health insurance, a laptop, a minimum of four weeks of yearly vacation, a personal development budget, and attendance in professional conferences.&nbsp;<br><br>We have a minimum of two annual team gatherings where you will join us. The previous gatherings were in Ljubljana, San Francisco, Mexico, Bali and Siglufjörður.<br><br>We are looking forward to hearing from you!</div> <div><!--block--><strong>SafetyWing</strong> (YC W18) is seeking an ambitious, unshakeable and creative person to make our platform channel grow exponentially, thereby significantly impacting the future of work. We believe remote work enables a fundamental shift in the global labour market. Platforms as intermediaries will be very important in this world, and many of the benefits that are provided by an employer or national government will be provided by such platforms.<br><br>We have had some success already and have a number of great partners. However, we want to switch gears and unleash the enormous potential of this channel. To some degree, this means building something that doesn’t currently exist but should. We seek someone with a “founder mentality” who is relentlessly resourceful, optimistic and visionary.</div> <h2>💻 Your responsibilities will include</h2>  <ul><li><!--block-->Taking full responsibility for ensuring the successful operation of the SafetyWing Remote Health Insurance API channel.</li><li><!--block-->Collaborating closely with the platform sales team to identify and recommend new integration prospects, introducing new partners to the benefits of embedding SafetyWing insurance products.</li><li><!--block-->Work closely with customer product teams to identify and qualify market-fit opportunities for integrating SafetyWing insurance products into platform partner offerings.</li><li><!--block-->Utilizing your knowledge of APIs to promote and prioritize customer product requirements, working closely with the engineering team to ensure seamless integration.</li></ul> <h2>🧪 We are looking for someone who</h2> <ul><li><!--block-->Has embedded products within other value propositions, preferably via APIs.</li><li><!--block-->Has a background in selling integrated solutions to B2B service providers.</li><li><!--block-->Has managed engineering resources or at least worked closely one-on-one with developers.</li><li><!--block-->Ideally, has an engineering background and has worked directly with a proprietary codebase.</li><li><!--block-->Has a good understanding of how intermediary platforms operate and what drives purchase decisions. Having experience from having built or had a leadership role in a freelancer platform would be a great advantage.</li><li><!--block-->Has experience with product management and sales and has been responsible for performance of a product/channel.</li><li><!--block-->Understands how to build and scale a revenue channel.</li></ul><div><!--block--><strong>😀 We like to work with people who:</strong></div><ul><li><!--block-->Think for themselves instead of copying others.</li><li><!--block-->Are willing to try new things, even with the risk of failure.</li><li><!--block-->Are intellectually curious and open to new ideas.</li><li><!--block-->Are creative and bold in the face of any problems.</li><li><!--block-->Have strong integrity and do the right thing.</li></ul>","tags":"[\"management\",\"engineering\",\"B2B\"]","pubDate":"2024-01-09 05:06:53.226","link":"https://safetywing.pinpointhq.com/en/jobs/163494","savedDate":"2024-01-09 05:06:53.226","slug":"head-of-integrations-safetywing-3120"},{"id":3491098789,"title":"Outreach Manager","company":"SafetyWing","image":"https://pbs.twimg.com/profile_images/1177267684574208000/54eG3WmW_400x400.jpg","description":"<h2>🧘 What we offer</h2> <ul><li><!--block-->Fully remote work environment – work from anywhere globally.&nbsp;</li><li><!--block-->Competitive compensation.</li><li><!--block-->Global coverage with Remote Health and Nomad Insurance.</li><li><!--block-->A minimum of 20 days of compensated time off each year.</li><li><!--block-->Referral bonus - an incentive program rewarding you for helping us find exceptional talent to join our team.</li><li><!--block-->Opportunity to unlock more benefits as your tenure with SafetyWing grows.</li><li><!--block-->We are looking forward to hearing from you!</li></ul><div><!--block--><br></div> <div><!--block--><strong>SafetyWing</strong> (YC W18) seeks an <strong>Outreach Manager (YouTube)</strong>&nbsp; to support our growing Partnerships team and our network of Ambassadors with care and personalized attention as we scale the program.<br><br></div><div><!--block-->Partnerships with affiliates and content creators have successfully supported the tremendous growth of SafetyWing since the launch of the Nomad Insurance product in 2019.<br><br></div><div><!--block-->Our influencer program (the ambassador program) was created in-house and designed according to our unique values of authenticity and simplicity. As a result, it became the most strategic growth channel for Nomad Insurance, accounting for more than 35% of sales.</div> <h2>💻 Your responsibilities will include</h2>  <ul><li><!--block-->Identifying the best YouTube creators that could fit our affiliate program well.</li><li><!--block-->Reaching out to these creators using genuine outreach/messaging.</li><li><!--block-->Signing up ambassadors through 1:1 calls and pitch presentations.</li><li><!--block-->Helping them create the first piece of content that includes SafetyWing products.</li><li><!--block-->Monitoring the results from both the outreach efforts and the Ambassadors’ successes.</li><li><!--block-->Helping in finding creative ways to scale the acquisition of quality ambassadors for SafetyWing.</li></ul> <h2>🧪 We are looking for someone who</h2> <ul><li><!--block-->Has experience and a strong interest in developing in the sales/partnerships field.</li><li><!--block-->Has hands-on experience working with YouTube content creators.</li><li><!--block-->Has experience working autonomously and understands remote work specifics.</li><li><!--block-->Has excellent written and verbal communication skills.</li><li><!--block-->Understands influence marketing, blogging and SEO.</li><li><!--block-->Has a “go-getter attitude”: an entrepreneurial spirit who creatively solves problems and works independently.</li></ul><div><!--block--><strong>😀 We like to work with people who:</strong></div><ul><li><!--block-->Want to help build a global social safety net on the Internet.</li><li><!--block-->Think for themselves instead of copying others.</li><li><!--block-->Are willing to try new things, even with the risk of failure.</li><li><!--block-->Are intellectually curious and open to new ideas.</li><li><!--block-->Are creative and bold in the face of any problems.</li><li><!--block-->Have strong integrity and do the right thing.</li></ul><div><!--block--><br></div>","tags":"[]","pubDate":"2024-01-09 05:06:53.226","link":"https://safetywing.pinpointhq.com/en/jobs/163522","savedDate":"2024-01-09 05:06:53.226","slug":"outreach-manager-safetywing-3145"},{"id":5486637006,"title":"Mid-Senior Frontend Engineer","company":"B","image":"https://remotive.com/job/1881826/logo","description":"<br><br><div class=\"h3\">Company Description</div><p>Trust Wallet is the world’s most inclusive, chain-agnostic, self-custody wallet that serves tens of millions users globally. Trust Wallet provides a secure, seamless and intuitive gateway to the crypto and NFT ecosystems. Our users are able to send, receive, stake, mint and store across 4.5+ million cryptocurrencies on 66+ blockchains, including Ethereum, BSC, Polygon, Solana, Avalanche, etc. Our developer community of different projects relies on us to reach millions of their users, build their own wallets, and grow crypto adoption.</p><p> </p><p>We are looking for experienced Frontend Engineers passionate about delivering amazing crypto products that people love and motivated to deliver the next generation of Trust Wallet for the web. </p><br><br><div class=\"h3\">Job Description</div><p>Responsibilities:</p><ul style=\"\"><li style=\"\"><ul style=\"\"><li style=\"\">Lead the development of our Chrome Browser Extension, working closely with Product to define the experience</li><li style=\"\">Drive new  initiatives to add support for many blockchains ecosystem features and launch new complementary products</li><li style=\"\">Interfacing directly with end-users and developers</li><li style=\"\">Supporting them and collecting feedback to inform the direction of the product</li></ul></li></ul><br><br><div class=\"h3\">Qualifications</div><p>Qualifications:</p><ul style=\"\"><li style=\"\"><ul style=\"\"><li style=\"\">3-5+ years full-time experience as a front-end developer</li><li style=\"\">1+ years full-time experience in a blockchain based project</li><li style=\"\">Strong ReactJS experience  with TypeScript</li><li style=\"\">Deep understanding of state management and routing with Redux</li><li style=\"\">Experience with QA automation with Cypress and Unit tests with Jest</li></ul></li></ul><br><br><div class=\"h3\">Additional Information</div><p><strong>Working at Trust Wallet</strong></p><ul style=\"\"><li style=\"\">Do something meaningful; Be a part of the future of finance technology and the no.1 company in the industry</li><li style=\"\">Fast moving, challenging and unique business problems</li><li style=\"\">International work environment, flat organization, flexible working hours</li><li style=\"\">Great career development opportunities in a growing company</li><li style=\"\">Possibility for relocation and international transfers mid-career</li><li style=\"\">Competitive salary</li></ul><div></div><p><strong>Why work at Trust Wallet?</strong></p><ul style=\"\"><li style=\"\">Be a part of the world’s leading blockchain ecosystem that continues to grow and offers excellent career development opportunities.</li><li style=\"\">Work alongside diverse, world-class talent, in an environment where learning and growth opportunities are endless.</li><li style=\"\">Tackle fast-paced, challenging and unique projects.</li><li style=\"\">Work in a truly global organization, with international teams and a flat organizational structure.</li><li style=\"\">Enjoy competitive salary and benefits.</li><li style=\"\">Balance life and work with flexible working hours and casual work attire.</li></ul><p>Apply today to join our team in building the world’s most trusted and secure crypto wallet and enable a decentralized future for everyone.<br>\n<br>\nTrust Wallet is committed to being an equal opportunity employer. We believe that having a diverse workforce is fundamental to our success.</p><p><em>By submitting a job application, you confirm that you have read and agree to our <a href=\"https://trustwallet.com/candidate-privacy-notice\" rel=\"nofollow\">Candidate Privacy Notice</a>.</em></p><img src=\"https://remotive.com/job/track/1881826/blank.gif?source=public_api\" alt=\"\"/>","tags":"[\"crypto\",\"frontend\",\"react js\",\"redux\",\"blockchain\",\"automation\",\"Ethereum\",\"Typescript \",\"cypress\",\"jest\"]","pubDate":"2024-01-07 23:20:53.000","link":"https://remotive.com/remote-jobs/software-dev/mid-senior-frontend-engineer-1881826","savedDate":"2024-01-09 05:06:53.223","slug":"mid-senior-frontend-engineer-b-6566"},{"id":8088031545,"title":"Senior Android Engineer","company":"B","image":"https://remotive.com/job/1881828/logo","description":"<br><br><div class=\"h3\">Company Description</div><p><strong>Trust Wallet</strong> is the world’s most inclusive, chain-agnostic, self-custody wallet that serves tens of millions users globally. Trust Wallet provides a secure, seamless and intuitive gateway to the crypto and NFT ecosystems. Our users are able to send, receive, stake, mint and store across 4.5+ million cryptocurrencies on 66+ blockchains, including Ethereum, BSC, Polygon, Solana, Avalanche, etc. Our developer community of different projects relies on us to reach millions of their users, build their own wallets, and grow crypto adoption.</p><br><br><div class=\"h3\">Job Description</div><p>We’re looking for experienced Android Developers passionate about building amazing crypto products that people love and excited to deliver the next generation of our Trust Wallet application.</p><p>Responsibilities:</p><ul style=\"\"><li style=\"\">Participate in the development of client-server solutions for mobile platforms</li><li style=\"\">Create and troubleshoot the code, participate in designing solution architecture</li><li style=\"\">Research new technologies, platforms and development tools</li><li style=\"\">Be a part of a highly skilled and creative development team</li></ul><br><br><div class=\"h3\">Qualifications</div><ul style=\"\"><li style=\"\">At least 5 years of experience in developing mobile applications using Kotlin and Java, Android SDK</li><li style=\"\">Experience writing auto tests</li><li style=\"\">Ability to solve problems independently, without constant mentoring</li><li style=\"\">Knowledge of the features of various versions of Android</li><li style=\"\">Experience in developing client-server applications</li><li style=\"\">Understanding the principles of building multi-threaded applications</li><li style=\"\">Understanding the major patterns of mobile applications design (MVC, MVP, MVVM, MVI)</li><li style=\"\">Experience with git and gitflow, gradle understanding</li><li style=\"\">Experience with Realm, SQLite Databases</li><li style=\"\">Android Architecture components</li></ul><p> </p><br><br><div class=\"h3\">Additional Information</div><p><strong>Working at Trust Wallet</strong></p><ul style=\"\"><li style=\"\">Do something meaningful; Be a part of the future of finance technology and the no.1 company in the industry</li><li style=\"\">Fast moving, challenging and unique business problems</li><li style=\"\">International work environment, flat organization, flexible working hours</li><li style=\"\">Great career development opportunities in a growing company</li><li style=\"\">Possibility for relocation and international transfers mid-career</li><li style=\"\">Competitive salary</li></ul><div></div><p><strong>Why work at Trust Wallet?</strong></p><ul style=\"\"><li style=\"\">Be a part of the world’s leading blockchain ecosystem that continues to grow and offers excellent career development opportunities.</li><li style=\"\">Work alongside diverse, world-class talent, in an environment where learning and growth opportunities are endless.</li><li style=\"\">Tackle fast-paced, challenging and unique projects.</li><li style=\"\">Work in a truly global organization, with international teams and a flat organizational structure.</li><li style=\"\">Enjoy competitive salary and benefits.</li><li style=\"\">Balance life and work with flexible working hours and casual work attire.</li></ul><p>Apply today to join our team in building the world’s most trusted and secure crypto wallet and enable a decentralized future for everyone.<br>\n<br>\nTrust Wallet is committed to being an equal opportunity employer. We believe that having a diverse workforce is fundamental to our success.</p><p><em>By submitting a job application, you confirm that you have read and agree to our <a href=\"https://trustwallet.com/candidate-privacy-notice\" rel=\"nofollow\">Candidate Privacy Notice</a>.</em></p><img src=\"https://remotive.com/job/track/1881828/blank.gif?source=public_api\" alt=\"\"/>","tags":"[\"android\",\"crypto\",\"git\",\"java\",\"blockchain\",\"kotlin\",\"research\",\"mentoring\",\"Ethereum\",\"SQLite\",\"gitflow\",\"Android SDK\",\"gradle\",\"MVVM\"]","pubDate":"2024-01-07 17:20:28.000","link":"https://remotive.com/remote-jobs/software-dev/senior-android-engineer-1881828","savedDate":"2024-01-09 05:06:53.224","slug":"senior-android-engineer-b-5135"},{"id":8916326529,"title":"Solidity Smart Contracts Developer","company":"Nitka","image":"https://remotive.com/job/1882749/logo","description":"<p><strong>Nitka Technologies</strong>'s developing software for customers in the US and Europe and brings together about 300 professionals from Eastern Europe, North and South America, Armenia, Georgia and Kazakhstan.</p>\n<p>We are looking for an experienced<strong> Solidity Smart Contracts Developer </strong>to work<strong> </strong>in the project <span style=\"font-weight: 400;\">in the education sector.</span></p>\n<p><span style=\"font-weight: 400;\"><strong>We offer 100% full-time remote work with a flexible schedule.</strong></span></p>\n<p><span style=\"font-weight: 400;\"><strong>Main task: </strong>The scope of work encompasses the development of smart contracts tailored for educational applications. This includes managing credentials, streamlining payments, automating various aspects of the learning process, and issuing digital certificates. Additionally, the role involves engaging in innovative and challenging tasks aimed at shaping the future of education. The developer will also explore the integration of blockchain technology in enhancing student engagement, tracking academic progress, and facilitating secure and transparent academic record-keeping. This role is pivotal in revolutionizing how educational services are delivered and accessed, leveraging the unique capabilities of blockchain to offer cutting-edge solutions in the educational landscape.</span></p>\n<p><strong>Skills required</strong>:</p>\n<ul style=\"\">\n<li style=\"\">1+ year of development experience in Solidity (Examples of completed works are required)</li>\n<li style=\"\">3+ years of programming experience</li>\n<li style=\"\">Strong spoken and written English skills (Intermediate level and more)</li>\n<li style=\"\"><span lang=\"ru-BY\" style=\" line-height: 107%;  mso-ascii-theme-font: minor-latin; mso-fareast- mso-fareast-theme-font: minor-latin; mso-hansi-theme-font: minor-latin; mso-bidi- mso-bidi-theme-font: minor-bidi; mso-ansi-language: #0C00; mso-fareast-language: EN-US; mso-bidi-language: AR-SA;\">Passion to develop blockchain projects</span></li>\n</ul>\n<p><strong>Working conditions:</strong></p>\n<ul style=\"\">\n<li style=\"\">Remote work</li>\n<li style=\"\">Full-time (8 hours/day)</li>\n<li style=\"\">Interaction with a team from the USA (а few times a week calls're in the evening, around 19:00 - 21:00 GTM+3 (morning on the US West Coast))</li>\n<li style=\"\">Flexible schedule without time trackers</li>\n<li style=\"\">Attractive USD compensation</li>\n<li style=\"\">Paid vacation, holidays</li>\n</ul>\n<p> </p><img src=\"https://remotive.com/job/track/1882749/blank.gif?source=public_api\" alt=\"\"/>","tags":"[\"blockchain\",\"solidity\"]","pubDate":"2024-01-06 21:20:23.000","link":"https://remotive.com/remote-jobs/software-dev/solidity-smart-contracts-developer-1882749","savedDate":"2024-01-09 05:06:53.224","slug":"solidity-smart-contracts-developer-nitka-7303"},{"id":8798381501,"title":"Senior QA Engineer","company":"B","image":"https://remotive.com/job/1881827/logo","description":"<br><br><div class=\"h3\">Company Description</div><p>Trust Wallet is the world’s most inclusive, chain-agnostic, self-custody wallet that serves tens of millions users globally. Trust Wallet provides a secure, seamless and intuitive gateway to the crypto and NFT ecosystems. Our users are able to send, receive, stake, mint and store across 4.5+ million cryptocurrencies on 66+ blockchains, including Ethereum, BSC, Polygon, Solana, Avalanche, etc. Our developer community of different projects relies on us to reach millions of their users, build their own wallets, and grow crypto adoption.</p><p><strong>Position Overview</strong></p><p>We are seeking a highly skilled and experienced Senior QA Engineer to join our team. The ideal candidate will be a team player who has a strong background in quality assurance methodologies, excellent problem-solving abilities, and attention to detail. The Senior QA Engineer will play a pivotal role in ensuring the quality and reliability of our products through comprehensive testing procedures and methodologies, and will have solid experience with automation testing tools for mobile apps, web, and API testing.</p><br><br><div class=\"h3\">Job Description</div><ul style=\"\"><li style=\"\"><p>Collaborate with cross-functional teams including developers, product managers, and other stakeholders to understand project requirements and deliver high-quality solutions</p></li><li style=\"\"><p>Design, create, and execute manual and automated test cases to identify software defects and ensure adherence to quality standards</p></li><li style=\"\"><p>Conduct thorough regression and performance testing to guarantee the stability and reliability of systems</p></li><li style=\"\"><p>Analyze test results, identify issues, and collaborate with the development team to resolve defects in a timely manner</p></li><li style=\"\"><p>Mentor and guide junior QA engineers, providing technical expertise and support in testing methodologies and best practices</p></li><li style=\"\"><p>Continuously improve QA processes and methodologies to enhance efficiency and effectiveness</p></li><li style=\"\"><p>Stay updated with industry trends and emerging technologies related to cryptocurrency security and QA methodologies</p></li></ul><br><br><div class=\"h3\">Qualifications</div><ul style=\"\"><li style=\"\"><p>Bachelor's degree in Computer Science, Engineering, or a related field</p></li><li style=\"\"><p>Over 8 years of proven experience as a QA Engineer, preferably in the fintech or cryptocurrency industry</p></li><li style=\"\"><p>Strong expertise in test automation tools and frameworks, such as Appium, Selenium or similar tools</p></li><li style=\"\"><p>Experience in API testing with tools such as Postman, Charles or Proxyman</p></li><li style=\"\"><p>Proficiency in Java programming language</p></li><li style=\"\"><p>Solid understanding of cryptocurrency and blockchain technology is highly advantageous</p></li><li style=\"\"><p>Solid understanding of SDLC, Agile methodologies, and best practices in software testing</p></li><li style=\"\"><p>Excellent analytical and problem-solving skills, with meticulous attention to detail</p></li><li style=\"\"><p>Strong communication skills and ability to collaborate effectively with cross-functional teams</p></li></ul><br><br><div class=\"h3\">Additional Information</div><p>All your information will be kept confidential according to EEO guidelines.</p><div></div><p><strong>Why work at Trust Wallet?</strong></p><ul style=\"\"><li style=\"\">Be a part of the world’s leading blockchain ecosystem that continues to grow and offers excellent career development opportunities.</li><li style=\"\">Work alongside diverse, world-class talent, in an environment where learning and growth opportunities are endless.</li><li style=\"\">Tackle fast-paced, challenging and unique projects.</li><li style=\"\">Work in a truly global organization, with international teams and a flat organizational structure.</li><li style=\"\">Enjoy competitive salary and benefits.</li><li style=\"\">Balance life and work with flexible working hours and casual work attire.</li></ul><p>Apply today to join our team in building the world’s most trusted and secure crypto wallet and enable a decentralized future for everyone.<br>\n<br>\nTrust Wallet is committed to being an equal opportunity employer. We believe that having a diverse workforce is fundamental to our success.</p><p><em>By submitting a job application, you confirm that you have read and agree to our <a href=\"https://trustwallet.com/candidate-privacy-notice\" rel=\"nofollow\">Candidate Privacy Notice</a>.</em></p><img src=\"https://remotive.com/job/track/1881827/blank.gif?source=public_api\" alt=\"\"/>","tags":"[\"api\",\"crypto\",\"java\",\"security\",\"blockchain\",\"agile\",\"automation\",\"Ethereum\",\"test automation\",\"selenium\",\"SDLC\",\"SOLID\",\"appium\",\"Postman\",\"fintech\",\"testing\",\"computer science\"]","pubDate":"2024-01-06 17:21:32.000","link":"https://remotive.com/remote-jobs/qa/senior-qa-engineer-1881827","savedDate":"2024-01-09 05:06:53.225","slug":"senior-qa-engineer-b-9994"},{"id":8794192041,"title":"Manual Software QA Engineer (Fully Remote)","company":"CoverGo","image":"https://pbs.twimg.com/profile_images/1382655628523364355/MWPIbbID_400x400.jpg","description":"<p><strong>Top 3 Reasons To Join Us</strong></p><ul> <li>Competitive Salary</li> <li>100% Remote</li> <li>Working on the latest tech for the Insurtech Market Leader</li> </ul><p><strong>About Us</strong></p><p>At CoverGo, our mission is to empower all insurance companies to make insurance 100% digital and accessible to everyone.</p><ul> <li>We are a leading global no-code insurance platform for health, life, and P&amp;C</li> <li>We’re the winner of the Insurtech of the Year in all of Asia and other awards globally</li> <li>We work with insurance enterprise clients such as AXA, Bupa, MSIG, Dai-ichi, Bank of China Group Insurance, and many more</li> <li>We're an international, diverse team of over 120 people with 30 nationalities and team members working remotely from all over the world</li> <li>We are fully funded and backed by reputable VC funds and strategic institutional investors</li> <li>We have a global presence in Asia, EMEA and the Americas</li> <li>We’ve grown our annualized revenue by over 30x since January 2021</li> <li>We’re constantly working towards making CoverGo a workplace that you love coming to. We deeply believe that bringing together a diversity of thoughts, expressions, and perspectives is key to building the best culture for equally diverse communities all over the world</li> </ul><p><strong>What You Will Do</strong></p><ul> <li>Perform manual testing on new technologies</li> <li>Identify and resolve simple quality process issues with little to no supervision and guidance </li> <li>Write tests scenarios and run them during the testing process</li> <li>Identify bugs and report it according to bug template with sufficient detail so that developers can investigate further</li> <li>Report status to cross-functional teams</li> <li>Execute on defined tasks according to guidelines and contribute to solving problems with defined solutions</li> <li>Provide support with the team proactively</li> <li>Mastering your craft and leveraging it for greater impact</li> </ul><p><strong>What We Need</strong></p><ul> <li>At least 2 years of experience in using manual testing tools and procedures in an agile environment</li> <li>Deep understanding of QA theory</li> <li>Good level of understanding of the software development life cycle and lean/agile QA methodologies</li> <li>Enjoy working in a group and collaborating with cross-functional teams to get things done</li> <li>Good communication in English is a must</li> <li>Continuous learning of innovative approaches to testing and best-practices around it</li> <li>Share new ideas and can adapt to work when circumstances change</li> </ul><p><a href=\"https://www.youtube.com/watch?v=YI0ezLxvFvA\" rel=\"nofollow noreferrer noopener\" class=\"external\"></a><strong>Why You'll Love Working Here</strong></p><ul> <li>Fully Remote</li> <li>Flexible Leave</li> <li>International Environment</li> <li>Competitive renumeration package</li> <li>Performance Bonus</li> <li>Stock Options after 6 months </li> <li>Company activities and events</li> <li>Learning and development plan</li> </ul><p><strong>CoverGo Company</strong><a href=\"https://www.youtube.com/watch?v=YI0ezLxvFvA\" rel=\"nofollow noreferrer noopener\" class=\"external\"><strong> Video</strong></a></p><p>By submitting your application, you confirm that you have read, understood, and accepted the content of CoverGo’s <a href=\"https://apply.workable.com/covergo/gdpr_policy?lng=en\" target=\"_blank\" rel=\"nofollow noreferrer noopener\" class=\"external\">Privacy Notice</a> and you consent to the processing of your data as part of this application.</p><h3>Requirements: </h3><h3>Benefits: </h3>","tags":"[]","pubDate":"2024-01-04 00:00:00.000","link":"https://apply.workable.com/covergo/j/58A63303A8","savedDate":"2024-01-09 05:06:53.228","slug":"manual-software-qa-engineer-fully-remote-covergo-7051"},{"id":1119900553,"title":"Manual Software QA Engineer (Fully Remote)","company":"CoverGo","image":"https://pbs.twimg.com/profile_images/1382655628523364355/MWPIbbID_400x400.jpg","description":"<p><strong>Top 3 Reasons To Join Us</strong></p><ul> <li>Competitive Salary</li> <li>100% Remote</li> <li>Working on the latest tech for the Insurtech Market Leader</li> </ul><p><strong>About Us</strong></p><p>At CoverGo, our mission is to empower all insurance companies to make insurance 100% digital and accessible to everyone.</p><ul> <li>We are a leading global no-code insurance platform for health, life, and P&amp;C</li> <li>We’re the winner of the Insurtech of the Year in all of Asia and other awards globally</li> <li>We work with insurance enterprise clients such as AXA, Bupa, MSIG, Dai-ichi, Bank of China Group Insurance, and many more</li> <li>We're an international, diverse team of over 120 people with 30 nationalities and team members working remotely from all over the world</li> <li>We are fully funded and backed by reputable VC funds and strategic institutional investors</li> <li>We have a global presence in Asia, EMEA and the Americas</li> <li>We’ve grown our annualized revenue by over 30x since January 2021</li> <li>We’re constantly working towards making CoverGo a workplace that you love coming to. We deeply believe that bringing together a diversity of thoughts, expressions, and perspectives is key to building the best culture for equally diverse communities all over the world</li> </ul><p><strong>What You Will Do</strong></p><ul> <li>Perform manual testing on new technologies</li> <li>Identify and resolve simple quality process issues with little to no supervision and guidance </li> <li>Write tests scenarios and run them during the testing process</li> <li>Identify bugs and report it according to bug template with sufficient detail so that developers can investigate further</li> <li>Report status to cross-functional teams</li> <li>Execute on defined tasks according to guidelines and contribute to solving problems with defined solutions</li> <li>Provide support with the team proactively</li> <li>Mastering your craft and leveraging it for greater impact</li> </ul><p><strong>What We Need</strong></p><ul> <li>At least 2 years of experience in using manual testing tools and procedures in an agile environment</li> <li>Deep understanding of QA theory</li> <li>Good level of understanding of the software development life cycle and lean/agile QA methodologies</li> <li>Enjoy working in a group and collaborating with cross-functional teams to get things done</li> <li>Good communication in English is a must</li> <li>Continuous learning of innovative approaches to testing and best-practices around it</li> <li>Share new ideas and can adapt to work when circumstances change</li> </ul><p><a href=\"https://www.youtube.com/watch?v=YI0ezLxvFvA\" rel=\"nofollow noreferrer noopener\" class=\"external\"></a><strong>Why You'll Love Working Here</strong></p><ul> <li>Fully Remote</li> <li>Flexible Leave</li> <li>International Environment</li> <li>Competitive renumeration package</li> <li>Performance Bonus</li> <li>Stock Options after 6 months </li> <li>Company activities and events</li> <li>Learning and development plan</li> </ul><p><strong>CoverGo Company</strong><a href=\"https://www.youtube.com/watch?v=YI0ezLxvFvA\" rel=\"nofollow noreferrer noopener\" class=\"external\"><strong> Video</strong></a></p><p>By submitting your application, you confirm that you have read, understood, and accepted the content of CoverGo’s <a href=\"https://apply.workable.com/covergo/gdpr_policy?lng=en\" target=\"_blank\" rel=\"nofollow noreferrer noopener\" class=\"external\">Privacy Notice</a> and you consent to the processing of your data as part of this application.</p><h3>Requirements: </h3><h3>Benefits: </h3>","tags":"[]","pubDate":"2024-01-04 00:00:00.000","link":"https://apply.workable.com/covergo/j/C02730BE4D","savedDate":"2024-01-09 05:06:53.229","slug":"manual-software-qa-engineer-fully-remote-covergo-3232"}]