[{"id":1432431482,"title":"Environment Artist","company":"OCP","image":"https://remotive.com/job/1927721/logo","description":"<div class=\"h2\"><strong>OCP is Looking for an Environment Artist (Senior or Above)</strong></div><p style=\"min-height:1.5em\"></p><p style=\"min-height:1.5em\">As a <strong>Senior Environment Artist</strong> at OCP, your focus is modeling and texturing imaginative and dynamic environments and props. The bulk of your time will be spent authoring 3D assets, and you welcome the opportunity to collaborate with colleagues in Design, Gameplay, and across the Art team. Familiar with offering and receiving regular feedback, you are comfortable communicating and determining a path forward for OCP’s look, feel, and player experience.</p><p style=\"min-height:1.5em\"></p><p style=\"min-height:1.5em\"><em>For this role, we’re open to candidates who are at a Senior level or above (e.g., Staff or Principal).</em></p><p style=\"min-height:1.5em\"></p><div class=\"h3\"><strong>What You Will Do:</strong></div><ul style=\"\"><li style=\"\"><p style=\"min-height:1.5em\">Working with the Art Director and team, develop or contribute to workflow standards for concepts, modeling, UV mapping, texturing, lighting, and more.</p></li><li style=\"\"><p style=\"min-height:1.5em\">Contribute to an asset pipeline that supports a strong and versatile visual style</p></li><li style=\"\"><p style=\"min-height:1.5em\">Participate in constructive feedback sessions, and uphold a high-quality bar in your and your colleagues’ work</p></li><li style=\"\"><p style=\"min-height:1.5em\">Work collaboratively with the range of technical and creative colleagues to help set the art direction of ambitious projects that can be delivered on time</p><p style=\"min-height:1.5em\"></p></li></ul><div class=\"h3\"><strong>Need to Have: </strong></div><ul style=\"\"><li style=\"\"><p style=\"min-height:1.5em\">Expert at using Maya, Max, or Blender for modelling, retopology, and other core game art tasks</p></li><li style=\"\"><p style=\"min-height:1.5em\">Expert at importing and presenting assets in Unreal Engine 5</p></li><li style=\"\"><p style=\"min-height:1.5em\">Strong/ Expert organic modelling skills in ZBrush or equivalent</p></li><li style=\"\"><p style=\"min-height:1.5em\">Strong/Expert texturing skills in Adobe Substance Painter</p></li><li style=\"\"><p style=\"min-height:1.5em\">Strong/ Expert level knowledge of texturing, materials, and lighting for environments and props</p></li><li style=\"\"><p style=\"min-height:1.5em\">Strong portfolio of modeling work for games, with an emphasis on high-quality environments</p></li><li style=\"\"><p style=\"min-height:1.5em\">Ability to follow concept art and art direction</p></li><li style=\"\"><p style=\"min-height:1.5em\">Able to use, improve, or establish best practices for an environment asset pipeline</p></li><li style=\"\"><p style=\"min-height:1.5em\">Demonstrated understanding of 3D art principles and ability to implement them efficiently</p></li><li style=\"\"><p style=\"min-height:1.5em\">Experience solving visual problems, while working with a diverse art team</p></li><li style=\"\"><p style=\"min-height:1.5em\">Ability to self-organize, time manage, and meet deadlines</p></li><li style=\"\"><p style=\"min-height:1.5em\">Ability to communicate and collaborate effectively in a remote environment</p><p style=\"min-height:1.5em\"></p></li></ul><div class=\"h3\"><strong>Nice to Have: </strong></div><ul style=\"\"><li style=\"\"><p style=\"min-height:1.5em\">Experience with authoring assets for Nanite and Lumen in a production setting</p></li><li style=\"\"><p style=\"min-height:1.5em\">Comfortable authoring materials in UE5</p></li><li style=\"\"><p style=\"min-height:1.5em\">Comfortable authoring substances and textures using Substance Designer</p></li></ul><p style=\"min-height:1.5em\"></p><p style=\"min-height:1.5em\">OCP targets paying base salaries in the top 75th percentile of similarly situated companies in each country where we have employees. This means that pay ranges differ from country to country. However, regardless of where the employee is located, we aim to be at least in the top fourth of the relevant market. In addition, OCP is dedicated to providing generous equity incentives and benefits to every employee. ​U.S. residents, click <a href=\"https://notion.so/ocpgg/OCP-Salary-Ranges-7e319ebc71e24dcc92c5b45222c20acc\" rel=\"nofollow\" target=\"_blank\">here</a> for more information about OCP's compensation philosophy and pay transparency information.</p><img src=\"https://remotive.com/job/track/1927721/blank.gif?source=public_api\" alt=\"\"/>","tags":"[]","pubDate":"2024-08-03 13:21:14.000","link":"https://remotive.com/remote-jobs/design/environment-artist-1927721","savedDate":"2024-08-05 07:23:23.943","slug":"environment-artist-ocp-3969"}]