[{"id":3318064996,"title":"Multimedia/Kernel Open Source Software Developer (Remote/Anywhere)","company":"Collabora","image":"https://pbs.twimg.com/profile_images/1545121577632763912/7FMnABb0_400x400.jpg","description":"<div class=\"section page-centered\" data-qa=\"job-description\"><div><span style=\"font-size: 10pt\">Collabora is looking for remote Open Source Software Developer to join its Multimedia domain within the Media/Kernel team.</span></div><div><span style=\"font-size: 10pt\">Are you a passionate and enthusiastic about Multimedia, Linux and Open Source Software?</span></div><div><span style=\"font-size: 10pt\">Are you striving for technical excellence and seeking for opportunities to learn and develop?</span></div><div><span style=\"font-size: 10pt\">Are you looking for a flexible remote work opportunity that stretches your abilities?</span></div><div><br></div><div><span style=\"font-size: 10pt\">This job opportunity might be for you!</span></div></div><div class=\"section page-centered\"><div><h3>What you can expect to work on?</h3><ul class=\"posting-requirements plain-list\"><ul><li>First and foremost, as a consultant you will be helping our customers on a wide variety of projects and products across various market segments. Here are few examples of recent projects we have worked on:</li><div><br></div><li>We designed new V4L2 stateless codec APIs in the Linux kernel and implementation of the userspace part as a GStreamer plug-in</li><li>We developed a build system to tailor/size GStreamer for a specific application (minimizing memory footprint and usage)</li><li>We built an Open Source system to stream audio/video with drones</li><li>For this role, there is also an element of troubleshooting functional and performance problems for different customers’ projects and products and participating in the mainline Linux kernel with code contributions, reviews and discussions</li></ul></ul></div></div><div class=\"section page-centered\"><div><h3>Must Haves</h3><ul class=\"posting-requirements plain-list\"><ul><li>Understanding of software and programming concepts, including C/C++, object-oriented design, applied knowledge of Rust</li><li>Knowledge of multimedia technologies such as frameworks (GStreamer, Video4Linux2, libcamera, VLC etc., Linux Media APIs (including Media Controller, Media Request), containers and codecs from MPEG, Xiph, IETF...</li><li>Experience with low-level hardware enablement</li></ul></ul></div></div><div class=\"section page-centered\"><div><h3>Great to Haves</h3><ul class=\"posting-requirements plain-list\"><ul><li>Knowledge of open source development methodologies and good standing in the open source community is a big plus</li><li>Contributions to relevant open source projects (GStreamer, PipeWire, libcamera, PulseAudio, FFmpeg, VLC...) as well as relevant parts of the Linux kernel</li><li>Applied knowledge of decoding and encoding process of major codecs</li><li>Exposure to Continuous Integration environments (GitLab, <a href=\"http://kernelci.org\" class=\"postings-link\">kernelci.org</a>...) is a plus</li><li>Knowledge of multimedia networking technologies and transmission protocols (RTP, RTSP, WebRTC, MPEG-DASH, HLS…)</li></ul></ul></div></div><div class=\"section page-centered\"><div><h3>Desired Personal Skills</h3><ul class=\"posting-requirements plain-list\"><ul><li>Self-motivated</li><li>Self-learner</li><li>Good interpersonal skills</li><li>Good English proficiency (both verbal and written)</li><li>Ability to work in an online distributed environment</li></ul></ul></div></div><div class=\"section page-centered\" data-qa=\"closing-description\"><div><span style=\"font-size: 10pt\">Our raison d’être is to accelerate the adoption of Open Source technologies, methodologies &amp; philosophy. We strive towards this goal by providing consulting services specialized in bringing companies and the Open Source community together. Being part of the Open Source community, we believe in a world of shared knowledge and collaboration for the advancement of humanity and we are always enthusiastic about sharing, teaching and learning with everyone around us.</span></div><div><br></div><div><span style=\"font-size: 10pt\">Our highly technical and talented team, distributed across 25+ geographies all over the world, brings deep technical expertise in system integration &amp; architecture, Linux kernel, graphics, multimedia, web engines and communications to a number of market verticals, including mobile, IVI / automotive, set top box / smart TV, and a range of other specialized embedded applications (low-latency audio/video, audio/video streaming solutions, audio/video editing...).</span></div><div><br></div><div><br></div><div><br></div><div>#LI-Remote</div></div><div class=\"section page-centered last-section-apply\" data-qa=\"btn-apply-bottom\"><a class=\"postings-btn template-btn-submit hex-color\" data-qa=\"show-page-apply\" href=\"https://jobs.lever.co/collabora/d177d6b6-51d3-458c-8385-5d21a69ab578/apply\">Apply for this job</a></div>","tags":"[]","pubDate":"2024-06-14 14:19:00.248","link":"https://jobs.lever.co/collabora/d177d6b6-51d3-458c-8385-5d21a69ab578","savedDate":"2024-06-14 14:19:00.248","slug":"multimedia-kernel-open-source-software-developer-remote-anywhere-collabora-1682"},{"id":3536288188,"title":"Product Designer [IC3]","company":"Sourcegraph","image":"https://pbs.twimg.com/profile_images/1428393724527190022/4mt5PACL_400x400.png","description":"\n    <div class=\"content-intro\"><h3>ALL SOURCEGRAPH ROLES ARE FULLY REMOTE</h3>\n<h2><strong><span style=\"color: #a112ff;\">Who we are</span></strong></h2>\n<p>Our mission at Sourcegraph is to make it so that&nbsp;<a class=\"c-link\" href=\"https://sourcegraph.notion.site/Mission-values-e9d37e6b972a4ef395c3076aea2bd07d\" target=\"_blank\" data-stringify-link=\"https://handbook.sourcegraph.com/strategy-goals/strategy\" data-sk=\"tooltip_parent\">everyone can code</a>, not just ~0.1% of the population. Our code graph powers Cody, the most powerful and accurate AI coding assistant, as well as our Code Search product, which helps devs explore their entire codebase and make large-scale migrations and security fixes. We’re building software that builds software, and in doing so we’re making devs more productive and preparing for a world where a lot more code gets written.</p>\n<p>It’s an exciting time to join Sourcegraph. AI has taken over the world, and we’ve spent the last 10 years building infrastructure that’s integral to making AI generated code more powerful and accurate. Our customers include 4/5 FAANG companies, 4 of the top 10 banks, government organizations, Uber, Plaid, and many other companies building the software that pushes the world forward. We’ve raised $225M at a $2.625B valuation from <a class=\"c-link\" href=\"https://techcrunch.com/2021/07/13/sourcegraph-raises-125m-series-d-on-2-6b-valuation-for-universal-code-search-tool/\" target=\"_blank\" data-stringify-link=\"https://techcrunch.com/2021/07/13/sourcegraph-raises-125m-series-d-on-2-6b-valuation-for-universal-code-search-tool/\" data-sk=\"tooltip_parent\">a16z</a>,&nbsp;<a class=\"c-link\" href=\"https://sourcegraph.com/blog/series-c-with-sequoia/\" target=\"_blank\" data-stringify-link=\"https://about.sourcegraph.com/blog/series-c-with-sequoia/\" data-sk=\"tooltip_parent\">Sequoia</a>,&nbsp;<a class=\"c-link\" href=\"https://www.redpoint.com/companies/sourcegraph/\" target=\"_blank\" data-stringify-link=\"https://www.redpoint.com/companies/sourcegraph/\" data-sk=\"tooltip_parent\">Redpoint</a>,&nbsp;<a class=\"c-link\" href=\"https://medium.com/craft-ventures/why-we-invested-in-sourcegraph-5ace28317e3d\" target=\"_blank\" data-stringify-link=\"https://medium.com/craft-ventures/why-we-invested-in-sourcegraph-5ace28317e3d\" data-sk=\"tooltip_parent\">Craft</a>&nbsp;and others. We’re making ambitious bets on our future and we’re looking to hire exceptional people to join our team as we make Sourcegraph one of the biggest and most influential companies in the world.</p></div>\n\n    <h2><span style=\"color: rgb(161, 18, 255);\"><strong>Location</strong></span></h2>\n<p>🌎 While we are an all-remote company and hire <a href=\"https://sourcegraph.notion.site/How-we-engage-talent-outside-of-the-US-218f7193695a46cbb1ef39ef9c1f72d4\">almost anywhere</a> in the world, we have a preference for someone to reside in the following locations for this role. However, if you feel qualified, we welcome you to apply regardless of location. No matter what, working hours must overlap with EST for at least 4 hours/week.</p>\n<p><strong>Preferred locations:</strong></p>\n<ul>\n<li>Remote - EST timezone</li>\n</ul>\n<h2><span style=\"color: rgb(161, 18, 255);\"><strong>Why this job is exciting</strong></span></h2>\n<p>The product design team bridges the intersection of user desirability, technical feasibility, and business viability. We craft solutions for Sourcegraph’s Cody AI assistant and code search functionality that make developers more productive and help anyone code. Our efforts are actively transforming how teams around the world discover, navigate, understand, and write code. You’ll have the chance to collaborate with teammates to define the future of AI in developer tools.&nbsp;</p>\n<p>Our leadership and internal developers are customer-focused and understand and respect the power of good design. Our customers love our<a href=\"https://sourcegraph.com/case-studies\"> product</a> and rely on it daily to ship and deploy better software. You’ll be buoyed and challenged by their constant stream of thoughtful feedback and engage with them to help solve their toughest problems.</p>\n<p>📅 Within one month, you will…</p>\n<ul>\n<li>complete your onboarding tasks and get to know your teammates&nbsp;</li>\n<li>learn about our business, product, vision, and team, and gain an understanding of how your role fits into Sourcegraph’s broader organization</li>\n<li>get to know the processes, tools, and systems the design team uses</li>\n<li>learn and understand our development process for feature releases and inter-team communication</li>\n<li>begin to learn the features the Cody and search teams develop and maintain</li>\n<li>improve the designer onboarding process by contributing to Sourcegraph’s handbook</li>\n<li>contribute to a Product Requirements Document</li>\n<li>ship meaningful changes to the product</li>\n</ul>\n<p>📅 Within three months, you will…</p>\n<ul>\n<li>join a feature team and take on a large project&nbsp;</li>\n<li>learn about our users through our existing research and by conducting new research</li>\n<li>become familiar with basic Sourcegraph functionality</li>\n<li>develop an understanding of how Cody and code search solve our customer’s use cases</li>\n<li>write code to better understand how developers use code search and Cody, our AI assistant</li>\n<li>take active involvement in strategic (the “why”), not just tactical (the “how”) realities of the design decisions you make</li>\n<li>work with the design team to improve its processes, contribute to design critiques, and build team cohesion</li>\n</ul>\n<p>📅 Within six months, you will…</p>\n<ul>\n<li>become proficient in search and Cody functionality</li>\n<li>identify and define a change that will improve the product (including the metrics you will measure), shepherd your solution through the design and development process, analyze the results, and share your progress with the company</li>\n<li>attend an offsite or virtual offsite</li>\n<li>host a design workshop that engages your peers&nbsp;</li>\n<li>co-lead a product feature with your triad</li>\n<li>leverage design thinking to contribute to Sourcegraph’s competitive strategy</li>\n</ul>\n<h2><span style=\"color: rgb(161, 18, 255);\"><strong>About you</strong></span></h2>\n<p>You are a talented and technically-minded Product Designer who is also comfortable reading and writing basic code such as javascript, typescript, or python. This gives you the skills to work with technical teams on complex problems related to the future of AI-powered dev tools, code search, and developer productivity. You are strongly aligned with <a href=\"https://sourcegraph.notion.site/Mission-values-e9d37e6b972a4ef395c3076aea2bd07d\">our values</a>, inspired by our mission to make it so that everyone can code, and motivated to do your best work at Sourcegraph.</p>\n<ul>\n<li>You have 5 to 8 years of experience designing complex B2B or B2C web applications as demonstrated in a strong portfolio</li>\n<li>Have experience designing intricate desktop applications similar to IDEs, design tools like Figma, and 3d applications</li>\n<li>You have the ability to create user flows, wireframes, prototypes, and other design artifacts to communicate complex concepts, and explain the reasoning behind your designs</li>\n<li>You have with user research and usability testing and are leading research calls with customers</li>\n<li>You have excellent written and verbal communication skills</li>\n<li>You have 3+ years of experience writing and shipping javascript, typescript, python, or similar code to solve user needs</li>\n<li>You have the ability to adapt your tools and processes for the velocity of a fast-paced startup where projects have varying requirement levels</li>\n</ul>\n<p>Nice to haves:</p>\n<ul>\n<li>Experience designing for emerging technologies&nbsp;</li>\n<li>Experience designing for developer tools</li>\n<li>Experience managing a design system</li>\n<li>A portfolio showcasing strong marketing design and illustration</li>\n<li>Experience working with distributed or remote teams</li>\n<li>Experience in designing search functionality for eCommerce, B2B, or other complex applications</li>\n</ul>\n<h2><span style=\"color: rgb(161, 18, 255);\"><strong>Level</strong></span></h2>\n<p>📊 This job is an IC3.&nbsp; You can read more about <a href=\"https://sourcegraph.notion.site/Leveling-Guide-034da6f373174eb28fc4575a45c9c1f7\">our job leveling philosophy</a> in our Handbook.</p>\n<h2><span style=\"color: rgb(161, 18, 255);\"><strong>Compensation</strong></span></h2>\n<p><strong>💸 We pay you an above-average salary</strong> because we want to hire the best people who are fully focused on helping Sourcegraph succeed, not worried about paying bills. As an <a href=\"https://sourcegraph.notion.site/Mission-values-e9d37e6b972a4ef395c3076aea2bd07d\">open and transparent</a> company that values <a href=\"https://www.notion.so/sourcegraph/Compensation-Pay-Transparency-at-Sourcegraph-d58d0774f51b4b489d41c3628d30ff8d?pvs=4\">competitive compensation</a>, our compensation ranges are visible to every single Sourcegraph teammate.</p>\n<p>To determine your salary, we use a number of market and data-driven salary sources, along with your location zone, and target the high-end of the range to ensure we’re always paying above market regardless of where you live in the world. Both U.S. and international locations are divided into one of four zones, determined by the cost of labor index for each area. The starting salary for a successful candidate will be based on level, job-related skills, experience, qualifications, and location zone. Please note that these salary ranges may be adjusted in the future.</p>\n<p>💰 The target compensation for this role is $64,000 - $128,000 USD base.</p>\n<ul>\n<li>Zone 2: $128,000 USD</li>\n<li>Zone 3: $96,000 USD</li>\n<li>Zone 4: $64,000 USD</li>\n</ul>\n<p>Please speak with a recruiter for additional information regarding zone locations.</p>\n<p>📈 In addition to our cash compensation, we offer equity (because when we succeed as a company, we want you to succeed, too) and generous <a href=\"https://sourcegraph.notion.site/Benefits-Perks-dd1da4b6b3a64780abed010a144d34ba\">perks &amp; benefits</a>.</p>\n<h2><span style=\"color: rgb(161, 18, 255);\"><strong>Interview process</strong></span></h2>\n<p><em>Below is the interview process you can expect for this role (you can read more about </em><a href=\"https://sourcegraph.notion.site/Types-of-interviews-f279f080583d49ee9f2c60e30c8cb1f7\"><em>the types of interviews</em></a><em> in our Handbook). It may look like a lot of steps, but rest assured that we move quickly and the steps are designed to help you get the information needed to determine if we’re the right fit for you… Interviewing is a two-way street, after all!&nbsp;</em></p>\n<p>We expect the interview process to take 5.5 hours in total.</p>\n<p><strong>👋 Introduction Stage</strong> - we have initial conversations to get to know you better…</p>\n<ul>\n<li>[30m] <a href=\"https://sourcegraph.notion.site/Types-of-interviews-sample-questions-f279f080583d49ee9f2c60e30c8cb1f7#99be5ff628b2414194a0ba79d9f25f13\">Recruiter Screen</a>&nbsp;</li>\n<li>[60m]&nbsp;<a href=\"https://sourcegraph.notion.site/Types-of-interviews-sample-questions-f279f080583d49ee9f2c60e30c8cb1f7#1919882c0cf147c487eb1df40db8a694\">Hiring Manager Screen /&nbsp;</a><a href=\"https://www.notion.so/sourcegraph/Types-of-interviews-sample-questions-f279f080583d49ee9f2c60e30c8cb1f7?pvs=4#c678a2a86e0e47e4958507e869bf7ded\">Resume Deep Dive</a></li>\n</ul>\n<p><strong>🧑‍💻 Team Interview Stage</strong> - we then delve into your experience in more depth and introduce you to members of the team…</p>\n<ul>\n<li>[30m] <a href=\"https://www.notion.so/sourcegraph/Types-of-interviews-sample-questions-f279f080583d49ee9f2c60e30c8cb1f7?pvs=4#88b9f826dee04ef98afc2aeec35b877a\">Peer Interview</a></li>\n<li>[60m] <a href=\"https://www.notion.so/sourcegraph/Design-Interview-Process-d8d5c7f6265c4fd2be755fc674e5d9b6#92342b06b7564e8b99bcb6bd480bd1fe\">Portfolio Review</a></li>\n<li>[90m] <a href=\"https://www.notion.so/sourcegraph/Design-Interview-Process-d8d5c7f6265c4fd2be755fc674e5d9b6#72e5eb1bf71b4130a1e2d3292759811a\">Design Working Session</a>&nbsp;</li>\n</ul>\n<p><strong>🎉 Final Interview Stage </strong>- we move you to our final round, where you meet cross-functional partners and gain a better understanding of our business and values holistically…</p>\n<ul>\n<li>[30m] <a href=\"https://sourcegraph.notion.site/Types-of-interviews-sample-questions-f279f080583d49ee9f2c60e30c8cb1f7#e3a04291743048df87541a88aa8199dd\">Values Interview</a></li>\n<li>[30m] <a href=\"https://sourcegraph.notion.site/Types-of-interviews-sample-questions-f279f080583d49ee9f2c60e30c8cb1f7#80e2ecaed5854b1ba510b2e391c0c67b\">Leadership Interview</a> with a co-founder&nbsp;</li>\n<li>We check references and conduct your background check</li>\n</ul>\n<p>Please note - you are welcome to request additional conversations with anyone you would like to meet, but didn’t get to meet during the interview process.</p>\n\n    \n\n    <div class=\"content-conclusion\"><h2><strong><span style=\"color: #a112ff;\">Not sure if this is you?</span></strong></h2>\n<p><span style=\"font-weight: 400;\">We want a diverse, global team, with a broad range of experience and perspectives. If this job sounds great, but you’re not sure if you qualify, apply anyway! We carefully consider every application, and will either move forward with you, find another team that might be a better fit, keep in touch for future opportunities, or thank you for your time.</span></p>\n<h2><strong><span style=\"color: #a112ff;\">Learn more about us</span></strong></h2>\n<p><span style=\"font-weight: 400;\">To create a product that serves the needs of all developers, we are building a diverse </span><a href=\"https://sourcegraph.notion.site/All-remote-guidelines-4d1270d806294bf4ae6db7ab02911957\"><span style=\"font-weight: 400;\">all-remote team</span></a><span style=\"font-weight: 400;\"> that is </span><a href=\"https://www.notion.so/sourcegraph/7ed54d4ec4624475a4b45619901236d7?v=e06d936c673f46ca8c313a557bd4410f\"><span style=\"font-weight: 400;\">distributed across the world</span></a><span style=\"font-weight: 400;\">. Sourcegraph is an equal opportunity workplace; we welcome people from all backgrounds and communities.&nbsp;</span></p>\n<p><span style=\"font-weight: 400;\">We provide </span><a href=\"https://sourcegraph.notion.site/Compensation-Pay-Transparency-at-Sourcegraph-d58d0774f51b4b489d41c3628d30ff8d?pvs=74\"><span style=\"font-weight: 400;\">competitive compensation</span></a><span style=\"font-weight: 400;\"> and </span><a href=\"https://sourcegraph.notion.site/Benefits-Perks-dd1da4b6b3a64780abed010a144d34ba?pvs=74\"><span style=\"font-weight: 400;\">practical benefits</span></a><span style=\"font-weight: 400;\"> to keep you happy and healthy so that you can do your best work.&nbsp;</span><span style=\"font-weight: 400;\">&nbsp;</span></p>\n<p><span style=\"font-weight: 400;\">Learn more about what it is like to work at Sourcegraph by reading </span><a href=\"https://sourcegraph.notion.site/d7614e3e9dc04c09ac2d42d57f1816e6?v=2a6d426dbae14390b155120b0c029ce0\"><span style=\"font-weight: 400;\">our handbook</span></a><span style=\"font-weight: 400;\">.</span></p>\n<p><span style=\"font-weight: 400;\">We want to ensure Sourcegraph is an environment that suits your working style and empowers you to do your best work, so we are eager to answer any questions that you have about us at any point in the interview process.</span></p>\n<p><span style=\"font-weight: 400;\">Go back to the </span><a href=\"https://about.sourcegraph.com/jobs/\"><span style=\"font-weight: 400;\">careers page</span></a><span style=\"font-weight: 400;\"> for all open positions.</span></p>\n<p>&nbsp;</p>\n<p><em><span style=\"font-weight: 400;\">Sourcegraph participates in <a href=\"https://sourcegraph.notion.site/E-Verify-2ab3286dde3446d6bac2898c83610107\" target=\"_blank\">E-Verify</a> for U.S. Employees</span></em></p></div>\n","tags":"[\"javascript\",\"typescript\",\"B2C\",\"B2B\"]","pubDate":"2024-06-14 14:19:00.247","link":"https://boards.greenhouse.io/sourcegraph91/jobs/5198247004","savedDate":"2024-06-14 14:19:00.247","slug":"product-designer-ic3-sourcegraph-8261"},{"id":3280912434,"title":"Senior UX Designer - EMEA Team","company":"10up","image":"https://pbs.twimg.com/profile_images/2738508979/760be3edebfa0195e36fb3dba07297c1_400x400.png","description":"<div class=\"section page-centered\" data-qa=\"job-description\"><div><b>Location: Remote - EMEA Team</b> (Open to applicants located anywhere aligned with EMEA time zones).</div><div><br></div><div>As a Senior UX Designer at 10up, you’ll be able to utilize a full spectrum of user experience design skills, while working collaboratively alongside our Content Design and Visual Design teams, leading meaningful, enterprise-level digital projects.</div><div><br></div><div>You’ll have the creative flexibility to explore and experiment across design tools and processes on a combination of unique, challenging projects and ongoing support engagements. As a leading digital agency, 10up’s client roster spans from innovative startups and impactful non-profits, to some of the biggest names in the industry, such as ESPN, Google, The New York Times Co., Microsoft, and The Nobel Prize Committee.</div><div><br></div><div>As a 10upper, you have options for flexible and alternative work schedules. Intentionally remote since day one, spanning six continents and 40 countries, 10up fully embraces the benefits of distributed work.</div></div><div class=\"section page-centered\"><div><h3>What you will do: </h3><ul class=\"posting-requirements plain-list\"><ul><li>Provide expert-level UX strategy, guidance, and design across 3-4 projects at a time - including workshop planning and facilitation, user research, personas, user testing, site structures, wireframes, user flows, and other representations of UX design direction to guide clients through design processes.</li><li>Consistently and proactively build long-term, and highly productive working relationships across disciplines at 10up and with our clients, while working independently</li><li>Create and communicate UX Design project plans that account for project constraints and client preferences, including the collaboration between other design disciplines such as UI design.</li><li>Recognize and pursue UX Design opportunities with existing and/or new clients with the support of account development team members.</li><li>Lead by example - do great work and help team members learn how you do it.</li></ul></ul></div></div><div class=\"section page-centered\"><div><h3>About you: </h3><ul class=\"posting-requirements plain-list\"><ul><li>You have 5+ years of experience working in a fast-paced, digital agency environment across multiple work groups and with multiple concurrent projects across user experience design.</li><li>You are at your best when you provide expert-level guidance on project workflow and UX design deliverables that achieve the best possible project outcomes given a set of budget, timeline, and client constraints.</li><li>You are highly proficient in UX tools such as Miro and Figjam for facilitation and deliverable presentations, additionally other user testing tools like Optimal Workshop.</li><li>You have the ability to confidently plan and facilitate workshops to explore a project's ambiguity and to ensure the outcomes help the project team move forward. </li><li>You have a strong understanding of web interactions, patterns, best practices, and common challenges website developers face, and you have experience driving strategic solutions to those challenges.</li><li>You are able to understand design systems from a UX perspective to assist any design decisions you face in collaboration with a UI designer.</li><li>You've worked with large-scale, CMS-driven website projects using block-based editors (e.g. Gutenberg for WordPress).</li><li>You understand content strategy, publishing workflows, and content management platforms and are able to confidently deep-dive into understanding a client's editorial process.</li></ul></ul></div></div><div class=\"section page-centered\"><div><h3>Benefits of interest:</h3><ul class=\"posting-requirements plain-list\"><ul><li>Multiple paid time off programs, including accrued PTO, parental leave, bereavement leave, and company holidays – including an all-company break from Christmas Eve to New Years Day.</li><li>Retirement contribution programs (currently available in the U.S. and U.K.).</li><li>Flexible and alternate schedule programs - including options for 4-day work week (Monday-Thursday) configurations.</li><li>$3,000 USD accrued annually in professional development budget for you to spend on conferences, training, or to buy back time for programs like independent study.</li><li>Global Company summits – opportunities to meet, socialize and learn with fellow 10uppers in person at remarkable destinations. </li><li>An end-of-year all-hands bonus program, along with smaller opportunities for recognition throughout the year.</li></ul></ul></div></div><div class=\"section page-centered\" data-qa=\"salary-range\"><div>$75,000 - $105,000 a year</div><small><div>The expected annual salary range for this position is between <b>$75,000</b> and <b>$105,000</b> USD. Compensation is determined based on a variety of factors including relevant experience, other job related qualifications/skills, geographic location, and business needs.</div></small></div><div class=\"section page-centered\" data-qa=\"closing-description\"><div><b style=\"font-size: 18px\">Join our team!&nbsp;</b></div><div><br></div><div>If you are passionate about 10up's mission and think you have what it takes to be successful in this role even if you don't check all the boxes, please apply. We'd appreciate the opportunity to personally review your application. Everyone gets a response.</div><div><br></div><div>Read more about <a href=\"https://drive.google.com/file/d/1nQ9yWRqfDAdrriYRnBNzYo7w59auYxMe/view\" class=\"postings-link\">What to Expect </a>through our Recruiting process.</div><div><br></div><div>We don't want you to miss any communication from us! To ensure you receive updates on your application, please add jobs@10up.com to your contacts list! #LI-Remote</div></div><div class=\"section page-centered last-section-apply\" data-qa=\"btn-apply-bottom\"><a class=\"postings-btn template-btn-submit hex-color\" data-qa=\"show-page-apply\" href=\"https://jobs.lever.co/10up-2/fc2c71ba-0906-4e07-82bd-66908ab3879e/apply\">Apply for this job</a></div>","tags":"[\"management\"]","pubDate":"2024-06-14 14:19:00.247","link":"https://jobs.lever.co/10up-2/fc2c71ba-0906-4e07-82bd-66908ab3879e","savedDate":"2024-06-14 14:19:00.247","slug":"senior-ux-designer-emea-team-10up-5465"},{"id":5034204781,"title":"Demand Generation and Campaign Manager","company":"Timescale","image":"https://pbs.twimg.com/profile_images/1542681228666671107/L5LYJLAD_400x400.png","description":"&lt;p&gt;&amp;nbsp;&lt;/p&gt;\n&lt;p&gt;As a &lt;strong&gt;Demand Generation and Campaign Manager &lt;/strong&gt;at Timescale🐯, you will play a crucial role in supporting the development and execution of marketing strategies aimed at attracting, nurturing, and converting potential customers into qualified leads and building excitement and engagement with technical communities. Working closely with the Senior Manager, you will help drive campaigns, analyze performance data, and optimize marketing efforts to achieve company goals.&lt;/p&gt;\n&lt;p&gt;Top candidates will thrive in a fast-paced environment and enjoy the challenge of taking full ownership and responsibility for driving high-quality leads and signups. An exceptional, demonstrable use of an experimental mindset and business insights to drive results and ROI is necessary.&lt;/p&gt;\n&lt;h4&gt;Key Responsibilities:&lt;/h4&gt;\n&lt;ul&gt;\n&lt;li&gt;Assist in setting strategies, goals, and forecasts for demand generation, nurture, and campaigns in alignment with sales and marketing objectives.&lt;/li&gt;\n&lt;li&gt;Plan and execute multi-channel sales and marketing campaigns, including email marketing, landing pages, paid advertisements, events, and webinars.&lt;/li&gt;\n&lt;li&gt;Monitor and analyze marketing/sales metrics and campaign performance to make data-driven decisions and optimizations.&lt;/li&gt;\n&lt;li&gt;Collaborate cross-functionally to create and manage content assets.&lt;/li&gt;\n&lt;li&gt;Utilize marketing automation tools such as HubSpot and Salesforce to manage lead data and workflows.&lt;/li&gt;\n&lt;li&gt;Support the effective use of the marketing tech stack, ensuring tools are utilized efficiently and effectively.&lt;/li&gt;\n&lt;li&gt;Conduct competitive and market analysis to inform campaign strategies and improvements.&lt;/li&gt;\n&lt;/ul&gt;\n&lt;h4&gt;Qualifications:&lt;/h4&gt;\n&lt;ul&gt;\n&lt;li&gt;3+ years of experience in B2B SaaS marketing, with a focus on lead generation and campaign execution.&amp;nbsp;&lt;/li&gt;\n&lt;li&gt;Proficiency in using HubSpot and Salesforce for marketing automation and lead management.&lt;/li&gt;\n&lt;li&gt;Experience in managing paid ad campaigns, particularly on platforms such as Google Ads and LinkedIn.&lt;/li&gt;\n&lt;li&gt;Strong analytical skills with the ability to interpret data and make data-driven decisions.&lt;/li&gt;\n&lt;li&gt;Excellent organizational, communication, and project management skills.&lt;/li&gt;\n&lt;li&gt;Ability to work independently and collaboratively in a fast-paced, remote environment.&lt;/li&gt;\n&lt;li&gt;Enthusiasm for learning and applying new marketing strategies and technologies.&lt;/li&gt;\n&lt;/ul&gt;\n&lt;h4&gt;Preferred Skills:&lt;/h4&gt;\n&lt;ul&gt;\n&lt;li&gt;Familiarity with database and/or cloud products.&lt;/li&gt;\n&lt;li&gt;Experience working with technical audiences and AI products.&lt;/li&gt;\n&lt;li&gt;Experience with developer channels and newsletters (ex: Hacker News, dev.to, PG Weekly).&lt;/li&gt;\n&lt;li&gt;Creative problem-solving abilities and a proactive mindset.&lt;/li&gt;\n&lt;li&gt;Strong writing and editing skills for creating compelling marketing content.&lt;/li&gt;\n&lt;/ul&gt;&lt;div class=&quot;content-conclusion&quot;&gt;&lt;p&gt;By applying for this position, you are agreeing to &lt;a href=&quot;https://www.timescale.com/legal/timescale-applicant-privacy-notice&quot;&gt;Timescale&#39;s Applicant Privacy Notice.&amp;nbsp;&lt;/a&gt;&lt;/p&gt;&lt;/div&gt;","tags":"[\"management\",\"B2B\",\"legal\",\"database\"]","pubDate":"2024-06-14 14:19:00.246","link":"https://www.timescale.com/careers/7494395002?gh_jid=7494395002","savedDate":"2024-06-14 14:19:00.246","slug":"demand-generation-and-campaign-manager-timescale-2348"},{"id":1689439481,"title":"Technical Writer (VM)","company":"Blue Coding","image":"https://lever-client-logos.s3.us-west-2.amazonaws.com/3c1d9ac7-6738-46c5-b6ca-a35fa2a0df57-1666278594128.png","description":"<div><i style=\"font-size: 18px\">Do you want to earn a salary in USD?&nbsp;</i></div><div><i style=\"font-size: 18px\">Would you like to work from wherever you want?</i></div><div><i style=\"font-size: 18px\">Would you like to be a part of the leading next-gen software developers?&nbsp;</i></div><div><br></div><div><b style=\"font-size: 24px\">Hi, you finally found us!</b><span style=\"font-size: 24px\">&nbsp;</span></div><div><br></div><div><b style=\"font-size: 24px\">Why work at Blue Coding?</b><span style=\"font-size: 24px\">&nbsp;</span></div><div><br></div><div>At Blue Coding we specialize in hiring excellent developers and amazing people from all over Latin America and other parts of the world. For the past 9 years, we’ve helped cutting-edge companies in the United States and Canada -both large and small, build great development teams and develop great products. Online shops, digital agencies, SaaS providers, and software consulting firms are a few of our clients. Our team of over 100 engineers is distributed in more than 10 countries across the Americas. We are a fully remote company working with a wide array of technologies and have expertise in every stage of the software development process.&nbsp;&nbsp;</div><div><br></div><div>Our team is highly connected, united, and culturally diverse, and our collaborators are involved in many initiatives around the world, from wildlife preservation to volunteering at local charities. We also participate in group activities like movie nights, trivia, and meme competitions. We stand for honesty, fairness, respect, efficiency, hard work, and cooperation.</div><div><br></div><div><b style=\"font-size: 18px\">What are we looking for?</b></div><div><br></div><div><span style=\"font-size: 16px\">In this opportunity, we are looking for a Technical Writer to work with one of our foreign clients, who is a market leader in the consultation, design, procurement, implementation, and ongoing managed services for technology services for mid to large global enterprises. As a Telecom Managed Service company, they partner with over 300 service providers globally to help customers with technology design and find the best solutions to meet their needs.</span></div><div><br></div><div><span style=\"font-size: 16px\">If you are independent, a great communicator, a problem solver, and have strong attention to detail, this is a great fit for you! Our jobs are fully remote – as long as you have the skills and can get the work done well, you can work anywhere in the listed countries you want.</span></div><div><br></div><div><span style=\"font-size: 16px\">If you have the skills and can get the job done, join us and work from anywhere you want!</span></div><h3>Here are some of the exciting day-to-day challenges you will face in this role:</h3><li>Support the Product Owners in documenting the tech specs, knowledge articles and release notes.</li>,<h3>You will shine if you have:</h3><li>Experience in technical writing, content strategy, and instructional design</li><li>Exceptional written communication skills</li><li>An ability to understand new technical concepts quickly</li><li>An ability to work with subject experts and convey their expertise into clear language</li><div><b style=\"font-size: 24px\">Hey, you are still here!</b><span style=\"font-size: 24px\">&nbsp;</span></div><div><br></div><div>So, let us ask a few questions. Do you like working in a friendly environment? Are you fluent in English? Do you have a strong work ethic, are detail-oriented and have an ownership mentality? And most importantly do you love music and puppies? If so, then what are you waiting for? Come join our team and become part of this awesome company! We will be expecting you.</div>","tags":"[]","pubDate":"2024-06-14 12:33:12.083","link":"https://jobs.lever.co/bluecoding/584e8352-37a9-4862-819b-4949223d60f4","savedDate":"2024-06-14 14:19:00.249","slug":"technical-writer-vm-blue-coding-6077"},{"id":2509457763,"title":"Senior User Acquisition Manager, User Experience","company":"Airalo","image":"https://lever-client-logos.s3.us-west-2.amazonaws.com/55028a36-609c-479c-9553-d4689ff2dd8c-1669620566663.png","description":"<div><b>About Airalo</b></div><div>Alo! Airalo is the world’s first eSIM store that helps people connect in over 200+ countries and regions across the globe. We are building the next digital service that revolutionizes the telecom industry. We are a travel-tech company and an equal-opportunity environment that values and executes diversity, inclusion, and equity. Our team is spread across 50+ countries and six continents. What glues us together is our commitment to changing the way you connect<span style=\"font-size: 13.3333px\">. </span></div><div><br></div><div><b>About you</b></div><div>We hope that you care deeply about the quality of your work, the intrinsic worth of tasks, and the success of your team. You are self-disciplined and do not require micromanagement in terms of your skillset and work ethic. You do your best to flourish as an individual every day while working hard to foster a collaborative team environment. You believe in the importance of being — and staying — authentic, honest, positive, and kind. You are a good interlocutor with clear and concise communication. You are able to manage multiple projects, have an analytical mind, pay keen attention to detail, and love to get your hands dirty. You are cognizant, tolerant, and welcoming of vulnerabilities and cultural differences.</div><div><br></div><div><b>About the Role</b></div><div><b>Position</b>: Full-time / Employee</div><div><b>Location:</b>&nbsp;Remote-first </div><div><b>Benefits:</b>&nbsp;Health Insurance, work-from-anywhere stipend, annual wellness &amp; learning credits, annual all-expenses-paid company retreat in a gorgeous destination &amp; other benefits</div><div><br></div><div>We are currently looking for a remote and full-time User Acquisition Manager to join the Airalo Growth team. Being one of the members of a lean team, you will have an opportunity to impact the overall growth of the organization. As an equal member of our team, you will also have employee stock options as part of your role.</div><div>You will be working on driving user acquisition strategy and execution on paid user acquisition channels (Search, Social, Programmatic, Display, and Video), as well as new and untapped channels or opportunities. You will be working alongside experienced team members on improving the north star metric and making sure that Airalo is on a proper path to revolutionize the way travelers think about global connectivity.</div><div><br></div><h3>Responsibilities include but are not limited to:</h3><li>Fulfilling the quarterly strategy by owning tactics, campaigns, initiatives, and experiments for user acquisition</li><li>Being creative and always thinking about unusual ways to grow and reach our OKRs</li><li>Increasing the number of app installs, sign-ups, and revenue on a weekly and monthly basis</li><li>Doing data analysis, user segmentation, and reporting</li><li>Campaign creation, optimization, and budget management</li><li>Unleashing your creativity to generate ideas for new campaigns and assets, in line with our brand book</li><li>Taking part in the whole growth experimentation cycle - from ideation through implementation and analysis</li><li>Constantly learning new tools and being on top of the new channels to master</li><li>Working closely with our Creative Designers on creatives</li><li>Being creative, authentic, eloquent, and accurate with conversion copywriting</li><li>Working closely with our Product and Support departments to gather insights from our users and suggest improvements</li>,<h3>Must-haves:</h3><li>Undergraduate degree in a related field</li><li>8+ years of experience in growth marketing (with a focus on user acquisition)</li><li>Proven track record of successful SEM, GDN &amp; Facebook campaigns</li><li>Basic knowledge of partnerships and experience with working with influencers</li><li>Basic knowledge of ASO, SEO, CRO, and online video platforms</li><li>Understanding of digital marketing strategy</li><li>Experience in data analysis on different platforms (e.g. Google Analytics)</li><li>Experience in mobile analytics on different platforms (e.g. Firebase, Adjust)</li><li>Perfect verbal and written communication skills in English</li>,<h3>Good to have:</h3><li>Prior experience and training in neuromarketing</li><li>Prior experience and training in statistics and data analysis</li><li>Prior experience in mobile app marketing</li><li>Graduate degree in a related field</li><li>Certificates and courses in digital marketing and research methods</li><li>Prior work experience in telecommunications</li><li>Knowledge of eSIM and GSMA-related technologies and services</li><div>If you are interested in this position, please apply via the link.</div><div><br></div><div><i>We sincerely thank all applicants in advance for submitting their interest in this opportunity with Airalo. </i></div>","tags":"[\"management\"]","pubDate":"2024-06-13 15:09:15.311","link":"https://jobs.lever.co/airalo/6adb1a44-cdda-4717-816f-de19a9585f30","savedDate":"2024-06-14 14:19:00.249","slug":"senior-user-acquisition-manager-user-experience-airalo-1661"},{"id":2356041431,"title":"Financial Planning & Analysis Specialist","company":"Airalo","image":"https://lever-client-logos.s3.us-west-2.amazonaws.com/55028a36-609c-479c-9553-d4689ff2dd8c-1669620566663.png","description":"<div><b>About Airalo</b></div><div>Alo! Airalo is the world’s first eSIM store that helps people connect in over 200+ countries and regions across the globe. We are building the next digital service that revolutionizes the telecom industry. We are a travel-tech company and an equal-opportunity environment that values and executes diversity, inclusion, and equity. Our team is spread across 50+ countries and six continents. What glues us together is our commitment to changing the way you connect<span style=\"font-size: 13.3333px\">. </span></div><div><br></div><div><b>About you</b></div><div>We hope that you care deeply about the quality of your work, the intrinsic worth of tasks, and the success of your team. You are self-disciplined and do not require micromanagement in terms of your skillset and work ethic. You do your best to flourish as an individual every day while working hard to foster a collaborative team environment. You believe in the importance of being — and staying — authentic, honest, positive, and kind. You are a good interlocutor with clear and concise communication. You are able to manage multiple projects, have an analytical mind, pay keen attention to detail, and love to get your hands dirty. You are cognizant, tolerant, and welcoming of vulnerabilities and cultural differences.</div><div><br></div><div><b>About the Role</b></div><div><b>Position</b>: Full-time / Employee</div><div><b>Location:</b>&nbsp;Remote-first </div><div><b>Benefits:</b>&nbsp;Health Insurance, work-from-anywhere stipend, annual wellness &amp; learning credits, annual all-expenses-paid company retreat in a gorgeous destination &amp; other benefits</div><div><br></div><div>The <b>Financial Planning &amp; Analysis (FP&amp;A) Specialist </b>will play a critical role in driving the financial planning and analysis functions. This position involves close collaboration with senior management to support strategic decision-making processes through detailed financial analysis, forecasting, and reporting. The FP&amp;A Specialist will be responsible for developing and maintaining financial models, conducting variance analyses, and assisting with the preparation of monthly, quarterly, and annual financial reports.</div><h3>Responsibilities include but are not limited to:</h3><li><b>Financial Planning:</b> Assist in the development of annual budgets, quarterly forecasts, and long-term financial plans.</li><li><b>Analysis:</b> Conduct detailed financial analysis to identify trends, variances, and performance metrics. Provide actionable insights to management.</li><li><b>Reporting:</b> Prepare and present monthly, quarterly, and annual financial reports for senior leadership and other stakeholders.</li><li><b>Modeling:</b> Develop, maintain, and improve financial models to support budgeting, forecasting, and strategic planning initiatives.</li><li><b>Data Management:</b> Ensure accuracy and integrity of financial data. Manage and improve financial reporting systems and processes.</li><li><b>Variance Analysis:</b> Perform variance analysis to explain differences between actual results and budgets/forecasts, identifying key drivers and making recommendations for corrective actions.</li><li><b>Business Partnering:</b> Work closely with various departments (e.g., Sales, Operations, Marketing) to understand their financial needs and provide support in budgeting, forecasting, and performance analysis.</li><li><b>Ad Hoc Projects:</b> Support special projects and initiatives as needed, providing financial insights and recommendations.</li>,<h3>Must-have:</h3><li><b>Education:</b> Bachelor’s degree in Finance, Accounting, Economics, or a related field. MBA or relevant professional certification (e.g., CFA, CPA) is a plus.</li><li><b>Experience:</b> 3-5 years of experience in financial planning and analysis, corporate finance, or a related field.</li><li><b>Technical Skills:</b> Proficiency in financial modeling and analysis. Advanced Excel skills are required. Experience with financial planning software (e.g., Hyperion, SAP BPC, Adaptive Insights) and ERP systems (e.g., SAP, Oracle) is highly desirable.</li><li><b>Analytical Skills:</b> Strong analytical and problem-solving skills, with a keen attention to detail.</li><li><b>Communication Skills:</b> Excellent verbal and written communication skills. Ability to present complex financial information in a clear and concise manner.</li><li><b>Interpersonal Skills:</b> Strong interpersonal skills with the ability to work effectively in a team environment and interact with various levels of management.</li><li><b>Organizational Skills:</b> Highly organized with the ability to manage multiple tasks and projects simultaneously, and meet deadlines.</li><li><b>Professionalism:</b> High degree of professionalism and integrity, with the ability to handle sensitive and confidential information appropriately.</li>,<h3>Good to have:</h3><li>Prior work experience in telecommunications</li><li>Knowledge of eSIM and GSMA-related technologies and services</li><div><i>We sincerely thank all applicants in advance for submitting their interest in this opportunity with Airalo. </i></div>","tags":"[\"Finance\",\"management\"]","pubDate":"2024-06-12 21:08:49.414","link":"https://jobs.lever.co/airalo/97ca97ab-a456-4ea2-a009-a054cff5395f","savedDate":"2024-06-14 14:19:00.249","slug":"financial-planning-analysis-specialist-airalo-4368"},{"id":6816208709,"title":"Junior/Middle Front-End Developer (MarTech)","company":"Social Discovery Group","image":"https://remotive.com/job/1916289/logo","description":"<p><strong><a href=\"https://socialdiscoverygroup.com/about-us/\" rel=\"nofollow\"></a></strong><a href=\"https://socialdiscoverygroup.com/about-us\" rel=\"nofollow\" style=\"text-decoration: none;\"><strong>Social Discovery Group</strong></a> (SDG) is a global technology company that builds apps at the intersection of dating, social, and entertainment. The company's portfolio includes 70 social discovery platforms with a focus on AI, game mechanics, and video streaming. We actively support and invest in social discovery startups worldwide through our CVC fund.<br><br>More than 500 million people in 150 countries enjoy our products, and we strive to have ten times as many.<strong><br><br>SDG<a href=\"https://socialdiscoverygroup.com/investments\" rel=\"nofollow\"><span style=\"  color: rgb(34, 34, 34); background-color: transparent; font-weight: 400; font-style: normal; font-variant: normal; vertical-align: baseline; white-space: pre-wrap;\"> </span>invests</a> </strong>in social discovery technology startups around the world. <a href=\"https://socialdiscoverygroup.com/investments\" rel=\"nofollow\" style=\"text-decoration: none;\"><strong>Our Investments</strong></a> include <strong>Open AI, Patreon, Flo, RAW, EVA AI, Clubhouse, Magnet, Woebot, Flure, Astry, Coursera, Academia, Harbour, Space, Auto1, DocSend, AppAnnie, Rapyd, Boom Supersonic, Trading, View, K-Health and many others.</strong><br><br>We solve the problem of loneliness, isolation, and disconnection with the help of digital reality.<br><br>Our <strong>digital nomad team of more than 1200 professionals </strong>works all over the world.  Together, we are solving the prevalent problem of loneliness and shaping Social Life 3.0 — a new digital reality where people will be able to fulfil their needs for communication and attention from other people and artificial life forms.<br><br>Our teams of digital nomads live and work remotely from <strong>Cyprus, Malta, the USA, Thailand, Indonesia, Hong Kong, Japan, Australia, Poland, Israel, Turkey, Latvia and many others.</strong><strong></strong></p>\n<p>We are looking for a<strong> Junior/Middle  Front-End Developer</strong> for Internal service MarTech.<strong><strong></strong></strong></p>\n<p><strong>MarTech</strong> is a part of our company that creates tools to improve how we attract users. They use AI and modern technology to do things like:</p>\n<ul style=\"\"><li style=\"\">Target specific users in ads</li><li style=\"\">Link users between different projects</li><li style=\"\">Bring users back through email, push, web push, and SMS messages</li><li style=\"\">Create landing pages with recommendation systems</li><li style=\"\">Solve other tech and algorithm problems</li></ul>\n<p>Every day, hundreds of thousands of users use MarTech's products. With a small team of 20 people, MarTech makes almost a quarter of the total revenue of Dating Group.</p>\n<p><strong>Your main tasks will be:</strong></p>\n<ul style=\"\"><li style=\"\">Developing marketing landing pages with complex client-server logic;</li><li style=\"\">Creating business card websites;</li><li style=\"\">Developing and maintaining service UIs for CRM tools.</li></ul>\n<ul style=\"\"></ul>\n<p><strong>We expect from you:</strong></p>\n<ul style=\"\"><li style=\"\">At least 2 years of experience in a similar position;</li><li style=\"\">Proficiency in JS, HTML, CSS, sass, less;</li><li style=\"\">Experience with react, gulp is preferred.</li></ul>\n<ul style=\"\"></ul>\n<p><strong>What do we offer:</strong><strong><br></strong></p>\n<ul style=\"\"><li style=\"\"><strong>REMOTE OPPORTUNITY</strong> to work full time;</li><li style=\"\"><strong>7 wellness days per year</strong> (time off) that can be used to deal with household issues, to lie down and recover without taking sick leave;</li><li style=\"\"><strong>Bonuses up to $5000 </strong>for recommending successful applicants for positions in the company;</li><li style=\"\">Full payment for <strong>professional training, international conferences and meetings;</strong></li><li style=\"\">Corporate discount for <strong>English lessons;</strong></li><li style=\"\">​<strong>Health benefits. </strong>If you are not eligible for corporate medical insurance, the company will compensate you with up to $ 1,000 gross per year per employee, according to the paychecks. This can be spent on self-purchase of health insurance or on doctor's fees for yourself and close relatives (spouse, children);</li><li style=\"\">​<strong>Workplace organization. </strong>The company provides all employees with an equipped workplace and all the necessary equipment (table, armchair, wifi, etc.) in our offices or co-working locations. In the other locations, the company provides reimbursement of workplace costs up to $ 1000 gross once every 3 years, according to the paychecks. This money can be spent on the rent of the co-working room, on equipping the working place at home (desk, chair, Internet, etc.) during those 3 years;</li><li style=\"\"><strong>Internal gamified gratitude system: </strong>receive bonuses from colleagues and exchange them for time off, merch, team building activities, massage certificates, etc. </li></ul>\n<p><strong>Sounds good? Join us now!</strong> </p><img src=\"https://remotive.com/job/track/1916289/blank.gif?source=public_api\" alt=\"\"/>","tags":"[\"CSS\",\"html\",\"react\"]","pubDate":"2024-06-12 19:20:57.000","link":"https://remotive.com/remote-jobs/software-dev/junior-middle-front-end-developer-martech-1916289","savedDate":"2024-06-14 14:19:00.244","slug":"junior-middle-front-end-developer-martech-social-discovery-group-3468"},{"id":5930188686,"title":"Head of Content Marketing (Remote - Work from Anywhere)","company":"Xapo Bank","image":"https://s3-recruiting.cdn.greenhouse.io/external_greenhouse_job_boards/logos/400/530/000/resized/greyBackground.jpg?1692112526","description":"&lt;div class=&quot;content-intro&quot;&gt;&lt;p style=&quot;text-align: left;&quot;&gt;&lt;span style=&quot;font-weight: 900;&quot;&gt;Work from anywhere, impact everywhere&amp;nbsp;&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;Diversity is at the heart of who we are at Xapo Bank. We’re a fully distributed team of over 140 Xapiens that work remotely from 40+ countries around the world.&amp;nbsp;&lt;/p&gt;\n&lt;p&gt;Our beginning: A world that enjoys economic freedom and wealth protection, no matter where you live or who is running your country. This is the dream that drove Wences Casares, our Founder and Chairman, to quietly transform the world of banking.&lt;/p&gt;\n&lt;p&gt;To achieve that, we search the world for the best people for the job. We work hard, think globally, and inspire each other to learn and grow. We are committed to changing the way things are done.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Risk is inherent in all of our business activities and managing risk well is the responsibility of every Xapien. Sound risk management enables us to serve our customers and deliver value for our shareholders, and helps make Xapo a great place to work.&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&amp;nbsp;&lt;/p&gt;\n&lt;p style=&quot;text-align: left;&quot;&gt;&lt;em&gt;&lt;span style=&quot;font-weight: 500;&quot;&gt;Although we are headquartered in Gibraltar, this is a full time, 100% remote position&amp;nbsp;&lt;br&gt;&lt;/span&gt;&lt;/em&gt;&lt;em&gt;&lt;span style=&quot;font-weight: 500;&quot;&gt;Work from anywhere!&lt;/span&gt;&lt;/em&gt;&lt;/p&gt;\n&lt;p style=&quot;text-align: left;&quot;&gt;&amp;nbsp;&lt;/p&gt;&lt;/div&gt;&lt;p&gt;&lt;strong&gt;&lt;em&gt;Position overview&lt;/em&gt;&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;The Head of Content Marketing, reporting into the VP of Marketing, will play a crucial role in developing and executing Xapo Bank’s content strategy to drive brand awareness, engagement, and ultimately, conversions.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;&lt;em&gt;Responsibilities&lt;/em&gt;&lt;/strong&gt;&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;Develop and implement a comprehensive content marketing strategy that aligns with the company’s growth objectives and brand positioning.&lt;/li&gt;\n&lt;li&gt;Lead SEO efforts to increase visibility and organic search rankings, collaborating closely with web developers.&lt;/li&gt;\n&lt;li&gt;Manage content production across various formats including blogs, white papers, video, and social media, ensuring all content is on-brand, consistent in terms of style, quality, and tone of voice, and optimized for search and user experience.&lt;/li&gt;\n&lt;li&gt;Oversee the editorial calendar and ensure content is scheduled, produced, and published in a timely manner.&lt;/li&gt;\n&lt;li&gt;Analyze content marketing data and SEO performance to continually refine strategies and tactics, maximizing effectiveness and ROI.&lt;/li&gt;\n&lt;li&gt;Own the content and design for Xapo Bank&#39;s website&lt;/li&gt;\n&lt;li&gt;Collaborate with cross-functional teams, including product, PR, and digital marketing, to create synergies and leverage content across all channels.&lt;/li&gt;\n&lt;li&gt;Lead and expand the content marketing team, nurturing talent and developing skills to meet evolving market and organizational demands.&lt;/li&gt;\n&lt;li&gt;Foster relationships with key influencers, thought leaders, and external partners to amplify outreach and content distribution efforts.&lt;/li&gt;\n&lt;li&gt;Stay current with industry trends and competitor strategies to ensure that our content is ahead of the curve.&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;&lt;strong&gt;&lt;em&gt;Skills needed&lt;/em&gt;&lt;/strong&gt;&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;At least 10 years of experience in a similar role spanning content and organic marketing&lt;/li&gt;\n&lt;li&gt;Bachelor’s degree in Marketing, Communications, Journalism, or a related field. Advanced degree preferred.&lt;/li&gt;\n&lt;li&gt;Proven experience in content marketing and SEO, with a strong track record of enhancing organic search and engagement.&lt;/li&gt;\n&lt;li&gt;Strong analytical skills with an ability to interpret data to make informed content decisions.&lt;/li&gt;\n&lt;li&gt;Exceptional writing and editing skills, with a keen understanding of what resonates with target audiences.&lt;/li&gt;\n&lt;li&gt;Experience with content management systems, SEO tools (e.g., SEMrush, Ahrefs), and analytics platforms (e.g., Google Analytics).&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;&lt;strong&gt;&lt;em&gt;Other requirements&lt;/em&gt;&lt;/strong&gt;&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;A dedicated workspace.&lt;/li&gt;\n&lt;li&gt;A reliable internet connection with the fastest speed possible in your area.&lt;/li&gt;\n&lt;li&gt;Devices and other essential equipment that meet minimal technical specifications.&lt;/li&gt;\n&lt;li&gt;Alignment with Our Values and the Xapo Values-Driven Leadership principles.&lt;/li&gt;\n&lt;/ul&gt;&lt;div class=&quot;content-conclusion&quot;&gt;&lt;p&gt;&lt;span style=&quot;font-size: 12pt;&quot;&gt;&lt;strong&gt;Why work for Xapo?&lt;/strong&gt;&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span style=&quot;font-weight: 500; font-size: 10pt;&quot;&gt;IMPACT GLOBALLY, WORK REMOTELY.&lt;/span&gt;&lt;/p&gt;\n&lt;ul&gt;\n&lt;li style=&quot;font-weight: 500;&quot;&gt;&lt;strong&gt;Shape the Future:&lt;/strong&gt;&lt;span style=&quot;font-weight: 500;&quot;&gt; Improve lives through cutting-edge technology, work 100% remotely from anywhere in the world.&lt;/span&gt;&lt;/li&gt;\n&lt;li style=&quot;font-weight: 500;&quot;&gt;&lt;strong&gt;Great work-life balance:&lt;/strong&gt;&lt;span style=&quot;font-weight: 500;&quot;&gt; &lt;/span&gt;&lt;span style=&quot;font-weight: 500;&quot;&gt;Build amazing things with a balance of autonomy and collaborative teamwork. Set your own work schedule and make use of a flexible PTO plan when you need to recharge.&lt;/span&gt;&lt;span style=&quot;font-weight: 500;&quot;&gt;&amp;nbsp;&lt;/span&gt;&lt;/li&gt;\n&lt;li style=&quot;font-weight: 500;&quot;&gt;&lt;strong&gt;Expect Excellence:&lt;/strong&gt;&lt;span style=&quot;font-weight: 500;&quot;&gt; Collaborate, learn, and grow with a high-performance team. Learn&lt;/span&gt;&lt;span style=&quot;font-weight: 500;&quot;&gt; how you learn best - from books to conferences, you’ll get a yearly budget for your individual learning and development goals.&lt;/span&gt;&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;&lt;strong&gt;At Xapo, we prioritize consumer protection and adhere to regulatory requirements by ensuring that all Xapiens are accountable for upholding principles of fair treatment, transparency, and ethical conduct in their interactions with customers and stakeholders.&lt;/strong&gt;&lt;/p&gt;&lt;/div&gt;","tags":"[\"management\"]","pubDate":"2024-06-12 10:55:30.000","link":"https://boards.greenhouse.io/xapo61/jobs/6020528003","savedDate":"2024-06-14 14:19:00.286","slug":"head-of-content-marketing-remote-work-from-anywhere-xapo-bank-8934"},{"id":2685142793,"title":"Senior FP&A Manager (Remote - Work from Anywhere)","company":"Xapo Bank","image":"https://s3-recruiting.cdn.greenhouse.io/external_greenhouse_job_boards/logos/400/530/000/resized/greyBackground.jpg?1692112526","description":"&lt;div class=&quot;content-intro&quot;&gt;&lt;p style=&quot;text-align: left;&quot;&gt;&lt;span style=&quot;font-weight: 900;&quot;&gt;Work from anywhere, impact everywhere&amp;nbsp;&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;Diversity is at the heart of who we are at Xapo Bank. We’re a fully distributed team of over 140 Xapiens that work remotely from 40+ countries around the world.&amp;nbsp;&lt;/p&gt;\n&lt;p&gt;Our beginning: A world that enjoys economic freedom and wealth protection, no matter where you live or who is running your country. This is the dream that drove Wences Casares, our Founder and Chairman, to quietly transform the world of banking.&lt;/p&gt;\n&lt;p&gt;To achieve that, we search the world for the best people for the job. We work hard, think globally, and inspire each other to learn and grow. We are committed to changing the way things are done.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Risk is inherent in all of our business activities and managing risk well is the responsibility of every Xapien. Sound risk management enables us to serve our customers and deliver value for our shareholders, and helps make Xapo a great place to work.&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&amp;nbsp;&lt;/p&gt;\n&lt;p style=&quot;text-align: left;&quot;&gt;&lt;em&gt;&lt;span style=&quot;font-weight: 500;&quot;&gt;Although we are headquartered in Gibraltar, this is a full time, 100% remote position&amp;nbsp;&lt;br&gt;&lt;/span&gt;&lt;/em&gt;&lt;em&gt;&lt;span style=&quot;font-weight: 500;&quot;&gt;Work from anywhere!&lt;/span&gt;&lt;/em&gt;&lt;/p&gt;\n&lt;p style=&quot;text-align: left;&quot;&gt;&amp;nbsp;&lt;/p&gt;&lt;/div&gt;&lt;p&gt;&lt;/p&gt;\n&lt;div class=&quot;p-rich_text_section&quot;&gt;&lt;strong data-stringify-type=&quot;bold&quot;&gt;Position Overview&lt;/strong&gt;&lt;br&gt;The Senior FP&amp;amp;A Manager with a quantitative background will be a key player in the finance team, leveraging advanced quantitative skills to enhance financial planning, analysis, and strategic decision-making. This role involves developing sophisticated financial models, conducting in-depth data analysis, and providing actionable insights to support Xapo’s financial goals. The ideal candidate will have a strong foundation in quantitative analysis, extensive experience in financial planning and analysis, and the ability to communicate complex financial information effectively.&lt;/div&gt;\n&lt;div class=&quot;p-rich_text_section&quot;&gt;&amp;nbsp;&lt;/div&gt;\n&lt;div class=&quot;p-rich_text_section&quot;&gt;&lt;strong data-stringify-type=&quot;bold&quot;&gt;Key Responsibilities&lt;/strong&gt;&lt;/div&gt;\n&lt;ol class=&quot;p-rich_text_list p-rich_text_list__ordered&quot; data-stringify-type=&quot;ordered-list&quot; data-indent=&quot;0&quot; data-border=&quot;0&quot;&gt;\n&lt;li data-stringify-indent=&quot;0&quot; data-stringify-border=&quot;0&quot;&gt;Enhanced Data Analysis and Financial Modeling:&lt;/li&gt;\n&lt;/ol&gt;\n&lt;div class=&quot;p-rich_text_section&quot;&gt;Advanced statistical and mathematical expertise to our team. This will enable us to develop more sophisticated financial models, improve the accuracy of our forecasts, and provide deeper insights into our financial performance.&amp;nbsp;&lt;em data-stringify-type=&quot;italic&quot;&gt;Their skill set will be invaluable in identifying trends, anomalies, and opportunities that we might otherwise overlook.&lt;/em&gt;&lt;/div&gt;\n&lt;ol class=&quot;p-rich_text_list p-rich_text_list__ordered&quot; data-stringify-type=&quot;ordered-list&quot; data-indent=&quot;0&quot; data-border=&quot;0&quot;&gt;\n&lt;li data-stringify-indent=&quot;0&quot; data-stringify-border=&quot;0&quot;&gt;Supporting Strategic Initiatives:&lt;/li&gt;\n&lt;/ol&gt;\n&lt;div class=&quot;p-rich_text_section&quot;&gt;Deep dive into unit economics, using the raw data we have and applying a finance lens to the analysis. The output and conclusions produced will be used as input to our financial model.&lt;/div&gt;\n&lt;ol class=&quot;p-rich_text_list p-rich_text_list__ordered&quot; data-stringify-type=&quot;ordered-list&quot; data-indent=&quot;0&quot; data-border=&quot;0&quot;&gt;\n&lt;li data-stringify-indent=&quot;0&quot; data-stringify-border=&quot;0&quot;&gt;Improved Risk Management:&lt;/li&gt;\n&lt;/ol&gt;\n&lt;div class=&quot;p-rich_text_section&quot;&gt;Can develop and implement complex risk assessment models to help us better understand and mitigate potential risks. This proactive approach will safeguard our assets and enhance our strategic decision-making.&lt;/div&gt;\n&lt;ol class=&quot;p-rich_text_list p-rich_text_list__ordered&quot; data-stringify-type=&quot;ordered-list&quot; data-indent=&quot;0&quot; data-border=&quot;0&quot;&gt;\n&lt;li data-stringify-indent=&quot;0&quot; data-stringify-border=&quot;0&quot;&gt;Automation of Financial Processes:&lt;/li&gt;\n&lt;/ol&gt;\n&lt;div class=&quot;p-rich_text_section&quot;&gt;By leveraging their programming skills, a Quant can automate various financial processes, reducing manual effort and the potential for human error. This will not only increase our operational efficiency but also allow our team to focus on more strategic tasks.&lt;/div&gt;\n&lt;ol class=&quot;p-rich_text_list p-rich_text_list__ordered&quot; data-stringify-type=&quot;ordered-list&quot; data-indent=&quot;0&quot; data-border=&quot;0&quot;&gt;\n&lt;li data-stringify-indent=&quot;0&quot; data-stringify-border=&quot;0&quot;&gt;Optimisation of Investment Strategies:&lt;/li&gt;\n&lt;/ol&gt;\n&lt;ul class=&quot;p-rich_text_list p-rich_text_list__bullet&quot; data-stringify-type=&quot;unordered-list&quot; data-indent=&quot;0&quot; data-border=&quot;0&quot;&gt;\n&lt;li data-stringify-indent=&quot;0&quot; data-stringify-border=&quot;0&quot;&gt;We could even use him/her for our investment strategies, to assess the efficiency of our capital allocation from treasury (from a finance perspective, as a second pair of eyes)&lt;/li&gt;\n&lt;/ul&gt;\n&lt;div class=&quot;p-rich_text_section&quot;&gt;&lt;strong data-stringify-type=&quot;bold&quot;&gt;Qualifications&lt;/strong&gt;&lt;/div&gt;\n&lt;ul class=&quot;p-rich_text_list p-rich_text_list__bullet&quot; data-stringify-type=&quot;unordered-list&quot; data-indent=&quot;0&quot; data-border=&quot;0&quot;&gt;\n&lt;li data-stringify-indent=&quot;0&quot; data-stringify-border=&quot;0&quot;&gt;Education: Bachelor’s degree in Finance, Economics, Mathematics, Statistics, or a related field. An advanced degree (MBA, MSc, PhD) in a quantitative discipline is highly preferred.&lt;/li&gt;\n&lt;/ul&gt;\n&lt;div class=&quot;p-rich_text_section&quot;&gt;&lt;strong data-stringify-type=&quot;bold&quot;&gt;Experience&lt;/strong&gt;:&lt;/div&gt;\n&lt;ul class=&quot;p-rich_text_list p-rich_text_list__bullet&quot; data-stringify-type=&quot;unordered-list&quot; data-indent=&quot;0&quot; data-border=&quot;0&quot;&gt;\n&lt;li data-stringify-indent=&quot;0&quot; data-stringify-border=&quot;0&quot;&gt;Minimum of 7-10 years of experience in financial planning and analysis, with a significant portion in a quantitative role within the banking or financial services industry or in a VC backed scale up.&lt;/li&gt;\n&lt;li data-stringify-indent=&quot;0&quot; data-stringify-border=&quot;0&quot;&gt;Proven experience in developing and implementing advanced financial models and quantitative analysis techniques.&lt;/li&gt;\n&lt;/ul&gt;\n&lt;div class=&quot;p-rich_text_section&quot;&gt;&lt;strong data-stringify-type=&quot;bold&quot;&gt;Skills&lt;/strong&gt;:&lt;/div&gt;\n&lt;ul class=&quot;p-rich_text_list p-rich_text_list__bullet&quot; data-stringify-type=&quot;unordered-list&quot; data-indent=&quot;0&quot; data-border=&quot;0&quot;&gt;\n&lt;li data-stringify-indent=&quot;0&quot; data-stringify-border=&quot;0&quot;&gt;Strong proficiency in programming languages such as&amp;nbsp;&lt;em data-stringify-type=&quot;italic&quot;&gt;Python, R, or MATLAB&lt;/em&gt;&amp;nbsp;and experience with financial modelling tools like Excel, VBA, and SQL.&lt;/li&gt;\n&lt;li data-stringify-indent=&quot;0&quot; data-stringify-border=&quot;0&quot;&gt;Deep understanding of statistical methods, econometrics, and machine learning algorithms.&lt;/li&gt;\n&lt;li data-stringify-indent=&quot;0&quot; data-stringify-border=&quot;0&quot;&gt;Excellent analytical and quantitative skills with the ability to interpret complex financial data.&lt;/li&gt;\n&lt;li data-stringify-indent=&quot;0&quot; data-stringify-border=&quot;0&quot;&gt;Advanced proficiency in financial software and ERP systems (e.g., Anaplan, Oracle NetSuite).&lt;/li&gt;\n&lt;li data-stringify-indent=&quot;0&quot; data-stringify-border=&quot;0&quot;&gt;Superior communication and presentation skills, with the ability to convey complex financial concepts to non-financial stakeholders.&lt;/li&gt;\n&lt;li data-stringify-indent=&quot;0&quot; data-stringify-border=&quot;0&quot;&gt;Strong organisational skills and attention to detail, with the ability to manage multiple priorities and meet deadlines.&lt;/li&gt;\n&lt;/ul&gt;\n&lt;div class=&quot;p-rich_text_section&quot;&gt;&lt;strong data-stringify-type=&quot;bold&quot;&gt;Competencies&lt;/strong&gt;&lt;/div&gt;\n&lt;ul class=&quot;p-rich_text_list p-rich_text_list__bullet&quot; data-stringify-type=&quot;unordered-list&quot; data-indent=&quot;0&quot; data-border=&quot;0&quot;&gt;\n&lt;li data-stringify-indent=&quot;0&quot; data-stringify-border=&quot;0&quot;&gt;Quantitative Analysis: Expertise in applying advanced quantitative techniques to financial analysis and modelling.&lt;/li&gt;\n&lt;li data-stringify-indent=&quot;0&quot; data-stringify-border=&quot;0&quot;&gt;Strategic Thinking: Ability to think critically and strategically, providing forward-looking financial insights.&lt;/li&gt;\n&lt;li data-stringify-indent=&quot;0&quot; data-stringify-border=&quot;0&quot;&gt;Problem-solving: Strong problem-solving skills with a proactive approach to identifying and addressing financial issues.&lt;/li&gt;\n&lt;li data-stringify-indent=&quot;0&quot; data-stringify-border=&quot;0&quot;&gt;Collaboration: Ability to work effectively in cross-functional teams and build strong relationships with stakeholders at all levels.&lt;/li&gt;\n&lt;li data-stringify-indent=&quot;0&quot; data-stringify-border=&quot;0&quot;&gt;Adaptability: Flexibility to adapt to changing priorities and manage multiple projects simultaneously in a fast-paced environment.&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;&lt;/p&gt;&lt;div class=&quot;content-conclusion&quot;&gt;&lt;p&gt;&lt;span style=&quot;font-size: 12pt;&quot;&gt;&lt;strong&gt;Why work for Xapo?&lt;/strong&gt;&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span style=&quot;font-weight: 500; font-size: 10pt;&quot;&gt;IMPACT GLOBALLY, WORK REMOTELY.&lt;/span&gt;&lt;/p&gt;\n&lt;ul&gt;\n&lt;li style=&quot;font-weight: 500;&quot;&gt;&lt;strong&gt;Shape the Future:&lt;/strong&gt;&lt;span style=&quot;font-weight: 500;&quot;&gt; Improve lives through cutting-edge technology, work 100% remotely from anywhere in the world.&lt;/span&gt;&lt;/li&gt;\n&lt;li style=&quot;font-weight: 500;&quot;&gt;&lt;strong&gt;Great work-life balance:&lt;/strong&gt;&lt;span style=&quot;font-weight: 500;&quot;&gt; &lt;/span&gt;&lt;span style=&quot;font-weight: 500;&quot;&gt;Build amazing things with a balance of autonomy and collaborative teamwork. Set your own work schedule and make use of a flexible PTO plan when you need to recharge.&lt;/span&gt;&lt;span style=&quot;font-weight: 500;&quot;&gt;&amp;nbsp;&lt;/span&gt;&lt;/li&gt;\n&lt;li style=&quot;font-weight: 500;&quot;&gt;&lt;strong&gt;Expect Excellence:&lt;/strong&gt;&lt;span style=&quot;font-weight: 500;&quot;&gt; Collaborate, learn, and grow with a high-performance team. Learn&lt;/span&gt;&lt;span style=&quot;font-weight: 500;&quot;&gt; how you learn best - from books to conferences, you’ll get a yearly budget for your individual learning and development goals.&lt;/span&gt;&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;&lt;strong&gt;At Xapo, we prioritize consumer protection and adhere to regulatory requirements by ensuring that all Xapiens are accountable for upholding principles of fair treatment, transparency, and ethical conduct in their interactions with customers and stakeholders.&lt;/strong&gt;&lt;/p&gt;&lt;/div&gt;","tags":"[\"Finance\",\"management\"]","pubDate":"2024-06-12 10:55:03.000","link":"https://boards.greenhouse.io/xapo61/jobs/6018865003","savedDate":"2024-06-14 14:19:00.287","slug":"senior-fp-a-manager-remote-work-from-anywhere-xapo-bank-300"},{"id":6636207511,"title":"Internal Events Manager","company":"Bio Render","image":"https://lever-client-logos.s3-us-west-2.amazonaws.com/0f4b434e-502f-4390-9819-c058d43028c1-1595260531860.png","description":"<div>At BioRender, our mission is to accelerate the world’s ability to learn, discover and communicate science. We are passionate about democratizing science communication in order to accelerate scientific discovery and understanding. We're looking for amazing people to help create the world’s go-to-place and platform where science is communicated. Come join us!</div><div><br></div><div><span style=\"font-size: 12pt\">As our Events Manager on the People Team, you’ll play a critical role in leading our in-person events and remote initiatives to connect our people and provide an amazing employee experience as we scale.</span></div><h3>What you'll be doing:</h3><li>Design an annual internal events strategy to enhance employee engagement and foster a positive company culture.</li><li>Lead the planning and execution of company-wide events and hackathons, ensuring they align with organizational goals and values.</li><li>Serve as the primary point of contact for team-based events across the company, providing support and guidance to ensure successful outcomes.</li><li>Take ownership of the events agenda and logistics, managing all aspects from scheduling to execution.</li><li>Collaborate with partners to source venues and arrange top-tier catering for events, maintaining high standards of quality and professionalism.</li><li>Manage the events budget effectively, allocating resources efficiently to maximize impact.</li><li>Oversee other key initiatives such as the company's swag program, ensuring they contribute to a positive employee experience.</li><li>Establish success metrics for events and gather feedback to continuously improve future initiatives, taking a data-driven approach to decision-making.</li><li>Work closely with cross-functional teams to coordinate efforts and ensure alignment with overall company objectives.</li>,<h3>What you bring to the table:</h3><li>3-7 years of proven experience in end-to-end events management, preferably in a corporate or startup environment.</li><li>Demonstrated creativity and strategic thinking in designing and executing successful events.</li><li>Comfortable working in a fast-paced environment and managing multiple projects simultaneously.</li><li>Strong program management skills, with the ability to prioritize tasks and meet deadlines effectively.</li><li>Excellent written and verbal communication skills, with a keen attention to detail.</li><li>Passionate about fostering employee connection and motivation through both remote and in-person events and initiatives.</li>,<h3>Why Join Us?</h3><li>We are mission-driven, and work collaboratively towards our shared vision of improving scientific communication and accelerating scientific discovery: BioRender figures have appeared in more than 16,000 publications!&nbsp;</li><li>It’s a product that users love! We have a world-class NPS and a community of loyal fans. Check out our Testimonials page to see what our customers are saying about us:&nbsp;<a href=\"https://biorender.com/testimonials/\">https://biorender.com/testimonials/&nbsp;</a></li><li>We are in the top quartile for profitability and year-over-year revenue growth, with users in 200+ countries.</li><li>BioRender is an equal opportunity employer, and an inclusive hiring process and work environment is a part of our DNA.&nbsp;</li><li>We’re remote-first and have team members across Canada and the United States. A physical office in Toronto is available, but you have the flexibility to work from anywhere.&nbsp;</li><li>We’re backed by top investors, accelerators, and some of the most successful life science entrepreneurs and philanthropists in the world including Y Combinator, Malala Fund founders, and Fifty Years VC.&nbsp;</li><li>We are committed to building a warm, inclusive, and diverse environment. Check out how we make sure our&nbsp;<a href=\"https://www.biorender.com/biorender-careers\">employees come first</a>.</li><div>You can read more about the&nbsp;<a href=\"https://biorender.notion.site/BioRender-Candidate-Resources-8255c155797f442a950720a33b4764d5\">BioRender interview process and FAQs here</a>!</div><div><br></div><div>Check out what it's like to work at BioRender in&nbsp;<a href=\"https://biorender.notion.site/biorender/Working-at-BioRender-as-a-Canada-Based-Employee-f6e12ab844154bb9948b22b32e3f0c70\">Canada</a>&nbsp;and the&nbsp;<a href=\"https://biorender.notion.site/biorender/Working-at-BioRender-as-a-U-S-Based-Employee-4ab2cc8e48f546f89aa98c318bccebc9\">US</a>!</div>","tags":"[\"management\",\"B2C\"]","pubDate":"2024-06-11 15:57:28.284","link":"https://jobs.lever.co/biorender/37ad64c4-2bc4-4ade-bc5a-eb20d0519443","savedDate":"2024-06-14 14:19:00.250","slug":"internal-events-manager-bio-render-1042"},{"id":3582556735,"title":"Technical Tribe Lead - Backend Engineering (Remote)","company":"Xapo Bank","image":"https://s3-recruiting.cdn.greenhouse.io/external_greenhouse_job_boards/logos/400/530/000/resized/greyBackground.jpg?1692112526","description":"&lt;div class=&quot;content-intro&quot;&gt;&lt;p style=&quot;text-align: left;&quot;&gt;&lt;span style=&quot;font-weight: 900;&quot;&gt;Work from anywhere, impact everywhere&amp;nbsp;&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;Diversity is at the heart of who we are at Xapo Bank. We’re a fully distributed team of over 140 Xapiens that work remotely from 40+ countries around the world.&amp;nbsp;&lt;/p&gt;\n&lt;p&gt;Our beginning: A world that enjoys economic freedom and wealth protection, no matter where you live or who is running your country. This is the dream that drove Wences Casares, our Founder and Chairman, to quietly transform the world of banking.&lt;/p&gt;\n&lt;p&gt;To achieve that, we search the world for the best people for the job. We work hard, think globally, and inspire each other to learn and grow. We are committed to changing the way things are done.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Risk is inherent in all of our business activities and managing risk well is the responsibility of every Xapien. Sound risk management enables us to serve our customers and deliver value for our shareholders, and helps make Xapo a great place to work.&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&amp;nbsp;&lt;/p&gt;\n&lt;p style=&quot;text-align: left;&quot;&gt;&lt;em&gt;&lt;span style=&quot;font-weight: 500;&quot;&gt;Although we are headquartered in Gibraltar, this is a full time, 100% remote position&amp;nbsp;&lt;br&gt;&lt;/span&gt;&lt;/em&gt;&lt;em&gt;&lt;span style=&quot;font-weight: 500;&quot;&gt;Work from anywhere!&lt;/span&gt;&lt;/em&gt;&lt;/p&gt;\n&lt;p style=&quot;text-align: left;&quot;&gt;&amp;nbsp;&lt;/p&gt;&lt;/div&gt;&lt;p&gt;&amp;nbsp;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;&lt;em&gt;Position Overview:&lt;/em&gt;&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;We’re looking for a Technical Tribe Lead to join our engineering function. At Xapo, we are building truly cross-functional teams with full ownership of design, architecture, building, testing, delivery, data, and operations. You will lead and collaborate closely with fellow team members from the product, apps, design, and QA communities of practice.&amp;nbsp; You will be part of the Technical Leadership team and will be in charge of all the technical aspects of Xapo Bank products, and your focus will be on Assets Under Management products.&lt;/p&gt;\n&lt;p&gt;At Xapo Bank, we work in Tribes. Each Tribe focuses on a different aspect of providing value to our customers. The Assets Under Management Tribe is in charge of AUM-related products in our app &amp;amp; backoffice domains such as treasury, FinOps, etc. All this responsibility is split across multiple teams, working towards critical KPIs.&lt;/p&gt;\n&lt;p&gt;As a Technical Tribe Lead, you will provide guidance and coaching around technical good practices and play an active, key role in the Development Community of practice. You will closely lead your dedicated team of Engineers but also be the face of the AUM Tribe (Engineering).&lt;br&gt;&amp;nbsp;&lt;/p&gt;\n&lt;p&gt;Our main tech stack includes:&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;AWS for all of our Infrastructure&lt;/li&gt;\n&lt;li&gt;Docker&lt;/li&gt;\n&lt;li&gt;Python (Django, Flask)&lt;/li&gt;\n&lt;li&gt;MySQL&lt;/li&gt;\n&lt;li&gt;MongoDB&lt;/li&gt;\n&lt;li&gt;Redis&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;We use also:&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;PostgreSQL&lt;/li&gt;\n&lt;li&gt;Node.js&lt;/li&gt;\n&lt;li&gt;Java&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;&lt;strong&gt;&lt;em&gt;Responsibilities&lt;/em&gt;&lt;/strong&gt;&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;Support, coach, and develop team members into top-performing engineers, both on hard and soft skills.&lt;/li&gt;\n&lt;li&gt;Support, coach, and develop Tech Leads into top performers, contributing to the success of their teams.&lt;/li&gt;\n&lt;li&gt;Working closely in cross-functional teams where everyone is responsible for the outcome.&lt;/li&gt;\n&lt;li&gt;Build a great place to work for talented and motivated people&lt;/li&gt;\n&lt;li&gt;Designing, developing, and deploying backend services focusing on high availability, fault tolerance, low latency, and security.&amp;nbsp;&lt;/li&gt;\n&lt;li&gt;Take full end-to-end responsibility for the services your team owns, from development to production, operations, and data.&lt;/li&gt;\n&lt;li&gt;Support other departments and scale non-technical teams through technical augmentation.&lt;/li&gt;\n&lt;li&gt;Develop innovative solutions with Bitcoin at its core.&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;&lt;strong&gt;&lt;em&gt;Skills needed:&lt;/em&gt;&lt;/strong&gt;&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;Proven experience leading one or more engineering teams, 5+ years.&lt;/li&gt;\n&lt;li&gt;Significant software engineering experience in one or more general-purpose programming languages (we use Python)&lt;/li&gt;\n&lt;li&gt;Excellent teamwork and communication skills, comfortable preparing high-quality documentation and designs to aid understanding and knowledge sharing.&amp;nbsp;&lt;/li&gt;\n&lt;li&gt;Understanding the microservices architecture, container-based 12-factor apps, and cloud-native patterns around fault tolerance.&lt;/li&gt;\n&lt;li&gt;Track record of using Event Storming and Domain Driven Design, delivering highly scalable asynchronous software.&lt;/li&gt;\n&lt;li&gt;Experience building contract-first services and adopting patterns and frameworks to enable appropriate automated testing at the unit, contract, service, and end-to-end levels.&amp;nbsp;&lt;/li&gt;\n&lt;li&gt;Experience building services that can be deployed on demand, quickly, and with quality.&lt;/li&gt;\n&lt;li&gt;Excellent understanding of CI/CD patterns and good practice.&amp;nbsp;&lt;/li&gt;\n&lt;li&gt;Understand the role of high-quality observability in building highly scalable and performant software.&lt;/li&gt;\n&lt;li&gt;Experience working with a public or private cloud vendor&amp;nbsp;&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;&lt;strong&gt;&lt;em&gt;Skills that are nice to have&lt;/em&gt;&lt;/strong&gt;&lt;strong&gt;:&lt;/strong&gt;&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;Experience working in the Fintech industry.&lt;/li&gt;\n&lt;li&gt;Experience working in teams responsible for Financial Operations, Stocks, or Assets Management.&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;&lt;strong&gt;&lt;em&gt;Other requirements&lt;/em&gt;&lt;/strong&gt;&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;A dedicated workspace&amp;nbsp;&lt;/li&gt;\n&lt;li&gt;A reliable internet connection with the fastest speed possible in your area&lt;/li&gt;\n&lt;li&gt;Devices and other essential equipment that meet minimal technical specifications&lt;/li&gt;\n&lt;li&gt;Alignment with Our Values.&lt;/li&gt;\n&lt;/ul&gt;&lt;div class=&quot;content-conclusion&quot;&gt;&lt;p&gt;&lt;span style=&quot;font-size: 12pt;&quot;&gt;&lt;strong&gt;Why work for Xapo?&lt;/strong&gt;&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span style=&quot;font-weight: 500; font-size: 10pt;&quot;&gt;IMPACT GLOBALLY, WORK REMOTELY.&lt;/span&gt;&lt;/p&gt;\n&lt;ul&gt;\n&lt;li style=&quot;font-weight: 500;&quot;&gt;&lt;strong&gt;Shape the Future:&lt;/strong&gt;&lt;span style=&quot;font-weight: 500;&quot;&gt; Improve lives through cutting-edge technology, work 100% remotely from anywhere in the world.&lt;/span&gt;&lt;/li&gt;\n&lt;li style=&quot;font-weight: 500;&quot;&gt;&lt;strong&gt;Great work-life balance:&lt;/strong&gt;&lt;span style=&quot;font-weight: 500;&quot;&gt; &lt;/span&gt;&lt;span style=&quot;font-weight: 500;&quot;&gt;Build amazing things with a balance of autonomy and collaborative teamwork. Set your own work schedule and make use of a flexible PTO plan when you need to recharge.&lt;/span&gt;&lt;span style=&quot;font-weight: 500;&quot;&gt;&amp;nbsp;&lt;/span&gt;&lt;/li&gt;\n&lt;li style=&quot;font-weight: 500;&quot;&gt;&lt;strong&gt;Expect Excellence:&lt;/strong&gt;&lt;span style=&quot;font-weight: 500;&quot;&gt; Collaborate, learn, and grow with a high-performance team. Learn&lt;/span&gt;&lt;span style=&quot;font-weight: 500;&quot;&gt; how you learn best - from books to conferences, you’ll get a yearly budget for your individual learning and development goals.&lt;/span&gt;&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;&lt;strong&gt;At Xapo, we prioritize consumer protection and adhere to regulatory requirements by ensuring that all Xapiens are accountable for upholding principles of fair treatment, transparency, and ethical conduct in their interactions with customers and stakeholders.&lt;/strong&gt;&lt;/p&gt;&lt;/div&gt;","tags":"[\"postgres\",\"management\",\"engineering\",\"mysql\",\"mongo\",\"aws\"]","pubDate":"2024-06-11 15:54:32.000","link":"https://boards.greenhouse.io/xapo61/jobs/6020613003","savedDate":"2024-06-14 14:19:00.287","slug":"technical-tribe-lead-backend-engineering-remote-xapo-bank-6140"},{"id":4568674290,"title":"Kernel Developer for KernelCare (worldwide remote, work anywhere)","company":"CloudLinux","image":"https://pbs.twimg.com/profile_images/696718028084482050/ymY3OEPk_400x400.png","description":"<p>We are seeking <strong>experienced Kernel Developers</strong> to join our talented team at KernelCare. If you are passionate about Linux and enjoy the challenge of developing Linux Kernels and patches, then this is the perfect opportunity for you. As a Senior Kernel Developer, you will utilize your strong C development skills and passion for Linux to create patches with a strong focus on cyber security. This role offers a rewarding and stimulating career where you can find solutions for our valued customers.</p><p>At KernelCare, our product provides live kernel patching services that deliver security patches and bug fixes for a variety of popular Linux kernels, all without the need for system reboots. We are proud to be a part of CloudLinux Inc., the provider of the #1 OS in security and stability for hosting providers. For more information about our KernelCare Product, please visit our website: <a href=\"https://tuxcare.com/live-patching-services/\" rel=\"nofollow noreferrer noopener\" class=\"external\">https://tuxcare.com/live-patching-services/</a></p><p></p><p>We take pride in being an excellent workplace, which is why KernelCare offers a great work environment. As a Senior Kernel Developer, you will have several key responsibilities:</p><ul> <li>Provide support for existing functionality and implement new features</li> <li>Ensure the timely update of existing kernels with security fixes and CVEs patches</li> <li>Create and maintain Python and Bash scripts for task automation</li> </ul><h3>Requirements: </h3><p><strong>To be successful in this role you should have:</strong></p><ul> <li>Strong proficiency in C programming and exceptional debugging skills</li> <li>Thorough understanding of Linux kernel core subsystems</li> <li>Extensive experience with GDB and other debuggers</li> <li>Highly independent and self-motivated problem solver and strategic thinker</li> <li>Proficient in Git for development, patch management, and branch management</li> <li>Strong planning, time management, decision-making, presentation, and organizational abilities</li> <li>Exceptional written and verbal communication skills</li> <li>Excellent interpersonal abilities and a strong team player</li> <li>Thrives in an agile, fast-paced environment</li> </ul><p></p><p><strong>Nice to have</strong></p><ul> <li>Expertise in CPU performance and power analysis</li> <li>In-depth knowledge of CPU and cache architectures</li> <li>Basic understanding of x86-64 Assembly (AT&amp;T asm)</li> <li>Basic understanding of x86-64 ABI </li> <li>Experience with Python and shell scripting</li> <li>Prior exposure to Jenkins would be advantageous</li> </ul><h3>Benefits: </h3><p><strong>What's in it for you?</strong><br></p><ul> <li>A focus on professional development; </li> <li>Interesting and challenging projects</li> <li> Flexible working hours</li> <li>Paid one month vacation per year and unlimited sick leave</li> <li>Medical insurance reimbursement</li> <li>Co-working and gym/sports reimbursement</li> <li>The opportunity to receive a reward for the most innovative idea that the company can patent</li> </ul><p></p><p><em>By applying for this position, you agree with </em><a href=\"https://cloudlinux.com/privacy-policy\" rel=\"nofollow noreferrer noopener\" class=\"external\"><em>Cloudlinux Privacy Policy</em></a><em> and give us your consent to maintain and process your personal data with this respect. Please read our Privacy Policy for more information.</em></p>","tags":"[\"management\",\"cyber security\"]","pubDate":"2024-06-11 00:00:00.000","link":"https://apply.workable.com/cloudlinux-1/j/CA2FFA7C98","savedDate":"2024-06-14 14:19:00.248","slug":"kernel-developer-for-kernelcare-worldwide-remote-work-anywhere-cloudlinux-2911"},{"id":5154150978,"title":"Malware Analyst (remote-only opportunity, location - Europe & CIS)","company":"CloudLinux","image":"https://pbs.twimg.com/profile_images/696718028084482050/ymY3OEPk_400x400.png","description":"<p>CloudLinux is a global remote-first company. We are driven by our principles: Do the right thing, employees first, we are remote first, and  we deliver high volume, low-cost Linux infrastructure and security products that help companies to increase the efficiency of their operations. Every person on our team supports each other and does what we can to ensure everyone is successful. We are truly a great place to work.</p><br>Imunify360 Security Suite is a product of CloudLinux Inc., the maker of the #1 OS in security and stability for hosting providers. Imunify is an innovative security solution designed specifically for shared and VPS/Dedicated servers. The automated, easy-to-use solution with the six-layer approach to security delivers comprehensive and complete attack prevention. <p>For more details about our company go to <a href=\"http://cloudlinux.com/\" rel=\"nofollow noreferrer noopener\" class=\"external\">Cloudlinux.com</a>.</p><br>Our growing Imunify Security team is looking for a Malware Analyst to analyze various types of malware attacks to the web hosting servers and create improvements in our products that will help prevent infections for our clients in the future. <p><strong>As our Malware Analyst you will be responsible for:</strong></p><ul> <li>Analyzing malware samples to identify their purpose and origin, including scanning files to detect viruses</li> <li>Identifying security vulnerabilities in websites, networks, or operating systems</li> <li>Reviewing any relevant information about previous attacks to determine the best way to respond to new threats</li> <li>Building and testing prototypes of new security measures to prevent future attacks</li> <li>Analyzing potential security risks and developing solutions to prevent hacking attacks</li> <li>Researching new types of malware to help create detection methods for new threats</li> <li>Developing anti-virus software programs to identify and remove viruses from infected computers</li> <li>Documenting findings about malware infections for future reference</li> </ul><h3>Requirements: </h3><p><strong>To be successful in this role you should have:</strong></p><ul> <li>GNU/Linux operating system and shell scripting experience.</li> <li>2+ years of experience working with PHP</li> <li>Knowledge of web-based malware analysis (unpack, deobfuscation, etc)</li> <li>Experience cleaning up websites from malware</li> <li>Experience in Apache / Nginx / (LightSpeed would be a plus)</li> <li>Analytical mindset for analyzing security threats operating</li> <li>English - intermediate or advanced level</li> <li> <strong>It will be a plus:</strong> </li> <ul> <li>Python programming skills </li> <li>Understanding of standards and frameworks: CVE, CWE, CVSS, MITRE ATT&amp;CK, etc;</li> <li>Knowledge of regular expressions (PCRE) </li> </ul> </ul><h3>Benefits: </h3><p><strong>What's in it for you?</strong></p><ul> <li>A focus on professional development;</li> <ul> <li>Training reimbursements</li> <li>Mentor programs</li> <li>Knowledge-Exchange programs</li> <li>Interesting and challenging projects</li> </ul> <li>Flexible working hours</li> <li>Paid one month vacation per year and unlimited sick leave</li> <li>Medical insurance reimbursement</li> <li>Co-working and gym/sports reimbursement</li> <li>The opportunity to receive a reward for the most innovative idea that the company can patent.</li> </ul><p></p><p><em>By applying for this position, you agree with </em><a href=\"https://cloudlinux.com/privacy-policy\" rel=\"nofollow noreferrer noopener\" class=\"external\"><em>Cloudlinux Privacy Policy</em></a><em> and give us your consent to maintain and process your personal data with this respect. Please read our Privacy Policy for more information.</em></p>","tags":"[]","pubDate":"2024-06-10 00:00:00.000","link":"https://apply.workable.com/cloudlinux-1/j/3582B51AB6","savedDate":"2024-06-14 14:19:00.248","slug":"malware-analyst-remote-only-opportunity-location-europe-cis-cloudlinux-2369"},{"id":2867262193,"title":"Senior Software Engineer","company":"Backflip","image":"https://lever-client-logos.s3.us-west-2.amazonaws.com/2616694d-50ee-4ca0-8184-ecbfb6dbe8a9-1686066452569.png","description":"<div><a href=\"https://www.dobackflip.com/\" class=\"postings-link\"><b style=\"font-size: 10.5pt\">Backflip</b></a><span style=\"font-size: 10.5pt\"> is a venture-backed real estate </span><b style=\"font-size: 10.5pt\">FinTech</b><span style=\"font-size: 10.5pt\"> company </span><span style=\"font-size: 11pt\">that supports entrepreneurs to acquire and renovate single family homes, thereby reinvigorating the housing supply and their local communities. The company offers purpose-built technology and capital products to source, analyze and finance residential real estate investments. Backflip is an all-in-one platform providing entrepreneurs with the technology, data, and financing strategies that allows them to scale their businesses.</span></div><div><br></div><div><b>Role Overview:</b> As a Senior Software Engineer at Backflip, you will play a pivotal role in the development and enhancement of our products and platform. You will collaborate with cross-functional teams, take ownership of challenging projects, and contribute to the success of the company. This role requires a blend of technical expertise, problem-solving skills, and the ability to work independently while embracing a collaborative mindset.</div><div><br></div><div><b>Responsibilities:</b></div><div>Design, develop, and maintain full-stack solutions using Python, React, and React Native.</div><div>Innovate and execute on features to enhance the user experience and platform capabilities.</div><div>Collaborate with product managers, designers, and other engineers to deliver high-quality software.</div><div>Contribute to the architecture, design, and implementation of scalable and maintainable code.</div><div>Write and maintain automated tests to ensure robustness, including following Test-Driven Development (TDD) practices.</div><div>Deploy applications to various cloud-based environments, ensuring reliability and performance.</div><div>Collaborate with teams to build RESTful APIs and other backend technologies.</div><div>Estimate work efforts accurately and ensure project milestones are met.</div><div>Stay current with industry trends and bring innovative ideas to the team.</div><div><br></div><div><b>Skills &amp; Qualifications:</b></div><div>Proficiency in Python and React, with a solid understanding of object-oriented programming.</div><div>Familiarity with front-end technologies like JavaScript and <a href=\"http://React.js\" class=\"postings-link\">React.js</a>.</div><div>Mastery of software development best practices and principles.</div><div>Experience with continuous integration and continuous deployment (CI/CD) pipelines.</div><div>Familiarity with cloud frameworks such as AWS, GCP, Firebase, or similar.</div><div>Strong understanding of design patterns, algorithms, and data structures.</div><div>Experience with RESTful APIs and backend technologies.</div><div>Familiarity with Docker and container-based environments.</div><div>Ability to provide accurate estimates and deliver high-quality code within deadlines.</div><div>Bachelor's degree in Computer Science or equivalent experience (8+ years) in building applications.</div><div><br></div><div><b>Bonus Skills:</b></div><div>Experience working with GraphQL.</div><div>Experience with mobile application development for iOS and Android.</div><div>Experience with machine learning techniques such as LLMs, NLP, and computer vision</div><div>Experience working in an Agile team environment.</div><div>Experience in researching and vetting third-party API providers.</div><div>Familiarity with geo-spatial search techniques.</div><div>Background in real estate, real estate investment, and/or FinTech is a plus.</div><div><br></div><div><b>Why Backflip:</b> At Backflip, you will be part of a collaborative and forward-thinking team that values innovation, creativity, and personal growth. We offer a remote work environment that allows you to work from anywhere while contributing to cutting-edge projects. As a Senior Software Engineer, you will have the opportunity to shape the future of our products and make a significant impact.</div><div>Join us in our mission to create groundbreaking solutions and revolutionize the industry. Apply now to become a part of the Backflip team.</div><div><br></div><div><i>Backflip is an equal-opportunity employer. We welcome and encourage diversity in the workplace. All qualified applicants will receive consideration for employment without regard to race, color, religion, sex, sexual orientation, gender identity, national origin, or protected veteran status and will not be discriminated against on the basis of disability.</i></div><div><br></div><div><a href=\"https://www.dobackflip.com/\" class=\"postings-link\"><b style=\"font-size: 10.5pt\">Backflip</b></a><span style=\"font-size: 10.5pt\"> is a venture-backed real estate </span><b style=\"font-size: 10.5pt\">FinTech</b><span style=\"font-size: 10.5pt\"> company </span><span style=\"font-size: 11pt\">that supports entrepreneurs to acquire and renovate single family homes, thereby reinvigorating the housing supply and their local communities. The company offers purpose-built technology and capital products to source, analyze and finance residential real estate investments. Backflip is an all-in-one platform providing entrepreneurs with the technology, data, and financing strategies that allows them to scale their businesses.</span></div><div><br></div><div><b>Role Overview:</b> As a Senior Software Engineer at Backflip, you will play a pivotal role in the development and enhancement of our products and platform. You will collaborate with cross-functional teams, take ownership of challenging projects, and contribute to the success of the company. This role requires a blend of technical expertise, problem-solving skills, and the ability to work independently while embracing a collaborative mindset.</div><div><br></div><div><b>Responsibilities:</b></div><div>Design, develop, and maintain full-stack solutions using Python, React, and React Native.</div><div>Innovate and execute on features to enhance the user experience and platform capabilities.</div><div>Collaborate with product managers, designers, and other engineers to deliver high-quality software.</div><div>Contribute to the architecture, design, and implementation of scalable and maintainable code.</div><div>Write and maintain automated tests to ensure robustness, including following Test-Driven Development (TDD) practices.</div><div>Deploy applications to various cloud-based environments, ensuring reliability and performance.</div><div>Collaborate with teams to build RESTful APIs and other backend technologies.</div><div>Estimate work efforts accurately and ensure project milestones are met.</div><div>Stay current with industry trends and bring innovative ideas to the team.</div><div><br></div><div><b>Skills &amp; Qualifications:</b></div><div>Proficiency in Python and React, with a solid understanding of object-oriented programming.</div><div>Familiarity with front-end technologies like JavaScript and <a href=\"http://React.js\" class=\"postings-link\">React.js</a>.</div><div>Mastery of software development best practices and principles.</div><div>Experience with continuous integration and continuous deployment (CI/CD) pipelines.</div><div>Familiarity with cloud frameworks such as AWS, GCP, Firebase, or similar.</div><div>Strong understanding of design patterns, algorithms, and data structures.</div><div>Experience with RESTful APIs and backend technologies.</div><div>Familiarity with Docker and container-based environments.</div><div>Ability to provide accurate estimates and deliver high-quality code within deadlines.</div><div>Bachelor's degree in Computer Science or equivalent experience (8+ years) in building applications.</div><div><br></div><div><b>Bonus Skills:</b></div><div>Experience working with GraphQL.</div><div>Experience with mobile application development for iOS and Android.</div><div>Experience with machine learning techniques such as LLMs, NLP, and computer vision</div><div>Experience working in an Agile team environment.</div><div>Experience in researching and vetting third-party API providers.</div><div>Familiarity with geo-spatial search techniques.</div><div>Background in real estate, real estate investment, and/or FinTech is a plus.</div><div><br></div><div><b>Why Backflip:</b> At Backflip, you will be part of a collaborative and forward-thinking team that values innovation, creativity, and personal growth. We offer a remote work environment that allows you to work from anywhere while contributing to cutting-edge projects. As a Senior Software Engineer, you will have the opportunity to shape the future of our products and make a significant impact.</div><div>Join us in our mission to create groundbreaking solutions and revolutionize the industry. Apply now to become a part of the Backflip team.</div><div><br></div><div><i>Backflip is an equal-opportunity employer. We welcome and encourage diversity in the workplace. All qualified applicants will receive consideration for employment without regard to race, color, religion, sex, sexual orientation, gender identity, national origin, or protected veteran status and will not be discriminated against on the basis of disability.</i></div><div><br></div><div><span style=\"font-size: 13.3333px\">In addition to a competitive base pay, employees in this role may be eligible for both equity and additional incentive compensation.</span></div><h3>People that thrive at Backflip have…</h3><li>A desire to learn and grow with the company; propensity to “think like an owner”</li><li>An execution-oriented “one-team” mindset with motivation and scrappiness to achieve objectives</li><li>The ability to multi-task with exceptional time management, prioritization and attention to detail</li><li>An entrepreneurial mindset and a passion for technology and innovation</li><li>A bias for action; inclined to deploy rapid testing and iteration cycles</li><li>The ability to work effectively in a small, relatively unstructured office environment (we work remotely)</li><li>Excellent verbal and written communication skills with appropriate urgency to various audiences</li><li>Strong self-motivation, are coachable and highly collaborative; take ownership of tasks and pride in work product</li><li>High integrity; are dependable, accountable, humble and respectful</li><div><br></div>","tags":"[\"javascript\",\"Finance\",\"management\",\"aws\"]","pubDate":"2024-06-06 20:09:11.860","link":"https://jobs.lever.co/backflip/91063320-6f2b-4372-8ac0-f1f8db560fc9","savedDate":"2024-06-14 14:19:00.283","slug":"senior-software-engineer-backflip-2091"},{"id":1531176254,"title":"Senior Front-End Web Developer (Remote - Work from Anywhere)","company":"Xapo Bank","image":"https://s3-recruiting.cdn.greenhouse.io/external_greenhouse_job_boards/logos/400/530/000/resized/greyBackground.jpg?1692112526","description":"&lt;div class=&quot;content-intro&quot;&gt;&lt;p style=&quot;text-align: left;&quot;&gt;&lt;span style=&quot;font-weight: 900;&quot;&gt;Work from anywhere, impact everywhere&amp;nbsp;&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;Diversity is at the heart of who we are at Xapo Bank. We’re a fully distributed team of over 140 Xapiens that work remotely from 40+ countries around the world.&amp;nbsp;&lt;/p&gt;\n&lt;p&gt;Our beginning: A world that enjoys economic freedom and wealth protection, no matter where you live or who is running your country. This is the dream that drove Wences Casares, our Founder and Chairman, to quietly transform the world of banking.&lt;/p&gt;\n&lt;p&gt;To achieve that, we search the world for the best people for the job. We work hard, think globally, and inspire each other to learn and grow. We are committed to changing the way things are done.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Risk is inherent in all of our business activities and managing risk well is the responsibility of every Xapien. Sound risk management enables us to serve our customers and deliver value for our shareholders, and helps make Xapo a great place to work.&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&amp;nbsp;&lt;/p&gt;\n&lt;p style=&quot;text-align: left;&quot;&gt;&lt;em&gt;&lt;span style=&quot;font-weight: 500;&quot;&gt;Although we are headquartered in Gibraltar, this is a full time, 100% remote position&amp;nbsp;&lt;br&gt;&lt;/span&gt;&lt;/em&gt;&lt;em&gt;&lt;span style=&quot;font-weight: 500;&quot;&gt;Work from anywhere!&lt;/span&gt;&lt;/em&gt;&lt;/p&gt;\n&lt;p style=&quot;text-align: left;&quot;&gt;&amp;nbsp;&lt;/p&gt;&lt;/div&gt;&lt;p&gt;&lt;strong&gt;Position Overview:&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;We are looking for a Senior Front-End Web Developer who is motivated to combine the art of design with the art of programming. Responsibilities will include translating design wireframes to actual code that will produce visual elements of the application.&amp;nbsp;You will work with the product designer and bridge the gap between graphical design and technical implementation, taking an active role on both sides and defining how the application looks and works. Aside from publicly faced applications, the person will contribute to internal back office UIs, building easy-to-use interfaces for internal teams in ever-evolving architecture.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Responsibilities:&lt;/strong&gt;&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;Develop new user-facing features&lt;/li&gt;\n&lt;li&gt;Build reusable code and libraries for future use&lt;/li&gt;\n&lt;li&gt;Ensure the technical feasibility of design from a visual and experience standpoint.&lt;/li&gt;\n&lt;li&gt;Optimize application for maximum speed and scalability&lt;/li&gt;\n&lt;li&gt;Ensure consistency of data gathered from the user&lt;/li&gt;\n&lt;li&gt;Collaborate with other team members and stakeholders&lt;/li&gt;\n&lt;li&gt;Developing internal tooling UI and platform for non-web-native team members to use&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;&lt;strong&gt;Skills needed:&lt;/strong&gt;&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;Great understanding of the newest trends, best practices and standards&amp;nbsp; in web development&lt;/li&gt;\n&lt;li&gt;Experience in leading the development of medium to large-scale projects, focusing on UX and Security.&lt;/li&gt;\n&lt;li&gt;Understanding of server-side CSS pre-processing platforms&lt;/li&gt;\n&lt;li&gt;Proficient understanding of client-side scripting, security best practices, and browser performance optimizations&lt;/li&gt;\n&lt;li&gt;Great knowledge of advanced JavaScript libraries and frameworks, such as AngularJS, ReactJS, Vue (at least one of them), etc.&lt;/li&gt;\n&lt;li&gt;Good understanding of asynchronous request handling, partial page updates, SPA, SSG&lt;/li&gt;\n&lt;li&gt;Good knowledge of tools necessary for autonomous delivers (image processing, building, etc)&lt;/li&gt;\n&lt;li&gt;Familiarity with tools such as Figma and Lokalise is a plus.&lt;/li&gt;\n&lt;li&gt;Proficient understanding of cross-browser compatibility issues and ways to work around them.&lt;/li&gt;\n&lt;li&gt;Proficient understanding of code versioning tools, such as GitHub.&lt;/li&gt;\n&lt;li&gt;Good knowledge of SEO principles and ensuring that applications will adhere to them.&lt;/li&gt;\n&lt;li&gt;Experience in designing web architecture, including Backend for Frontend, micro frontends, and usage of docker.&lt;/li&gt;\n&lt;li&gt;Excellent attention to detail with a high level of ownership mentality to deliver results independently and iteratively.&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;&lt;strong&gt;&lt;em&gt;Other requirements&lt;/em&gt;&lt;/strong&gt;&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;A dedicated workspace.&lt;/li&gt;\n&lt;li&gt;A reliable internet connection with the fastest speed possible in your area.&lt;/li&gt;\n&lt;li&gt;Devices and other essential equipment that meet minimal technical specifications.&lt;/li&gt;\n&lt;li&gt;Alignment with Our Values and the Xapo Values-Driven Leadership principles.&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;&amp;nbsp;&lt;/p&gt;&lt;div class=&quot;content-conclusion&quot;&gt;&lt;p&gt;&lt;span style=&quot;font-size: 12pt;&quot;&gt;&lt;strong&gt;Why work for Xapo?&lt;/strong&gt;&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span style=&quot;font-weight: 500; font-size: 10pt;&quot;&gt;IMPACT GLOBALLY, WORK REMOTELY.&lt;/span&gt;&lt;/p&gt;\n&lt;ul&gt;\n&lt;li style=&quot;font-weight: 500;&quot;&gt;&lt;strong&gt;Shape the Future:&lt;/strong&gt;&lt;span style=&quot;font-weight: 500;&quot;&gt; Improve lives through cutting-edge technology, work 100% remotely from anywhere in the world.&lt;/span&gt;&lt;/li&gt;\n&lt;li style=&quot;font-weight: 500;&quot;&gt;&lt;strong&gt;Great work-life balance:&lt;/strong&gt;&lt;span style=&quot;font-weight: 500;&quot;&gt; &lt;/span&gt;&lt;span style=&quot;font-weight: 500;&quot;&gt;Build amazing things with a balance of autonomy and collaborative teamwork. Set your own work schedule and make use of a flexible PTO plan when you need to recharge.&lt;/span&gt;&lt;span style=&quot;font-weight: 500;&quot;&gt;&amp;nbsp;&lt;/span&gt;&lt;/li&gt;\n&lt;li style=&quot;font-weight: 500;&quot;&gt;&lt;strong&gt;Expect Excellence:&lt;/strong&gt;&lt;span style=&quot;font-weight: 500;&quot;&gt; Collaborate, learn, and grow with a high-performance team. Learn&lt;/span&gt;&lt;span style=&quot;font-weight: 500;&quot;&gt; how you learn best - from books to conferences, you’ll get a yearly budget for your individual learning and development goals.&lt;/span&gt;&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;&lt;strong&gt;At Xapo, we prioritize consumer protection and adhere to regulatory requirements by ensuring that all Xapiens are accountable for upholding principles of fair treatment, transparency, and ethical conduct in their interactions with customers and stakeholders.&lt;/strong&gt;&lt;/p&gt;&lt;/div&gt;","tags":"[\"javascript\",\"management\"]","pubDate":"2024-06-04 07:12:49.000","link":"https://boards.greenhouse.io/xapo61/jobs/6008543003","savedDate":"2024-06-14 14:19:00.287","slug":"senior-front-end-web-developer-remote-work-from-anywhere-xapo-bank-8871"},{"id":4567370528,"title":"Senior Data Analyst","company":"Backflip","image":"https://lever-client-logos.s3.us-west-2.amazonaws.com/2616694d-50ee-4ca0-8184-ecbfb6dbe8a9-1686066452569.png","description":"<div><span style=\"font-size: 10.5pt\">Come help us change residential real estate investing for the better!</span></div><div><br></div><div><span style=\"font-size: 11pt\">Backflip is a venture-backed real estate FinTech company that supports entrepreneurs to acquire and renovate single family homes, thereby reinvigorating the housing supply and their local communities. The company offers purpose-built technology and capital products to source, analyze and finance residential real estate investments. Backflip is an all-in-one platform providing entrepreneurs with the technology, data, and financing strategies that allows them to scale their businesses.</span></div><div><b><span style=\"font-size: 11pt\">Backflip is seeking a talented and experienced Senior Analyst to join our team.</span></b><span style=\"font-size: 11pt\">&nbsp;</span><b><span style=\"font-size: 11pt\">The Senior Analyst will be responsible for analyzing complex data sets, generating valuable insights, and providing data-driven recommendations to support strategic decision-making. This role requires strong analytical skills, attention to detail, and the ability to communicate findings effectively.</span></b></div><div><br></div><div><span style=\"font-size: 10.5pt\">This is a rare opportunity to get in on the ground floor (~60 person team) working directly with executives in a fast-paced and well-capitalized startup (Series A).</span></div><div><br></div><div><span style=\"font-size: 11pt\">All Backflip positions are remote (US based). Like the people we serve, we believe being free to create wherever you’re most inspired is one of life’s greatest joys. It’s better for individuals, for the community, and for fostering great work to emerge. With our work-from-anywhere approach, Backflip brings together a diverse team of individuals, with passions for innovation, art, coding, AI, data, finance, film, real estate, the environment, learning and teaching. Together, we're moving fast.</span></div><div><span style=\"font-size: 10.5pt;\">Come help us change residential real estate investing for the better!</span></div><div><br></div><div><span style=\"font-size: 11pt;\">Backflip is a venture-backed real estate FinTech company that supports entrepreneurs to acquire and renovate single family homes, thereby reinvigorating the housing supply and their local communities. The company offers purpose-built technology and capital products to source, analyze and finance residential real estate investments. Backflip is an all-in-one platform providing entrepreneurs with the technology, data, and financing strategies that allows them to scale their businesses.</span></div><div><b><span style=\"font-size: 11pt;\">Backflip is seeking a talented and experienced Senior Analyst to join our team.</span></b><span style=\"font-size: 11pt;\">&nbsp;</span><b><span style=\"font-size: 11pt;\">The Senior Analyst will be responsible for analyzing complex data sets, generating valuable insights, and providing data-driven recommendations to support strategic decision-making. This role requires strong analytical skills, attention to detail, and the ability to communicate findings effectively.</span></b></div><div><br></div><div><span style=\"font-size: 10.5pt;\">This is a rare opportunity to get in on the ground floor (~60 person team) working directly with executives in a fast-paced and well-capitalized startup (Series A).</span></div><div><br></div><div><span style=\"font-size: 11pt;\">All Backflip positions are remote (US based). Like the people we serve, we believe being free to create wherever you’re most inspired is one of life’s greatest joys. It’s better for individuals, for the community, and for fostering great work to emerge. With our work-from-anywhere approach, Backflip brings together a diverse team of individuals, with passions for innovation, art, coding, AI, data, finance, film, real estate, the environment, learning and teaching. Together, we're moving fast.</span></div><div><i>*The Compensation figure above includes Base Salary + Performance Bonus, and is based on a variety of factors including prior experience. In addition to a competitive market salary, Backflip employees receive equity stock options, 100% paid health care, a 401K + company match, among other industry-leading benefits.</i></div><div><br></div><div>Backflip is an equal opportunity employer. We know that building a world-class organization is not possible without an intentional focus on recruiting, empowering, promoting and rewarding the best and brightest people of all backgrounds. Backflip focuses on hiring individuals that align with its Core Values (listed above), and consistently display a high ethical standard, both personally and professionally.</div><div><br></div><h3>This candidate will champion Backflip’s culture & core values:</h3><li>Raise the standard of what is possible</li><li>Embrace being the novice to become the master</li><li>Work only with those who want the best for us</li><li>Communicate quickly, naturally and with radical candor</li><li>Test new things to invent and challenge the status quo</li><li>Today, nay now!</li><h3>What You’ll Do:</h3><li>Conduct in-depth data analysis to identify trends, patterns, and key insights</li><li>Develop and maintain company-wide reporting</li><li>Collaborate with cross-functional teams to gather requirements and provide analytical support</li><li>Prepare and present reports, visualizations, and dashboards to communicate findings</li><li>Identify opportunities for process improvement and contribute to data-driven decision-making</li><div><br></div><div><i>This role will evolve as the company grows; there will be various tasks that fall outside of the responsibilities above. </i></div><h3>Qualifications:</h3><li>Bachelor's degree in related field and 5+ years of relevant experience</li><li>Proven experience as an analyst, preferably in a startup environment</li><li>Strong analytical and problem-solving skills</li><li>Excellent communication and presentation abilities</li><li>Ability to work effectively both independently and in a team environment</li><li>Expert proficiency in SQL and at least one visualization framework</li><li>Proficiency in git/github</li><li>Proficiency in Python</li><li>Startup experience is a plus</li><div><br></div><h3>People That Thrive at Backflip Have… </h3><li>A desire to learn and grow with the company; propensity to “think like an owner”&nbsp;</li><li>An execution-oriented “one-team” mindset with motivation and scrappiness to achieve objectives&nbsp;</li><li>The ability to multi-task with exceptional time management, prioritization and attention to detail&nbsp;</li><li>An entrepreneurial mindset and a passion for technology and innovation&nbsp;</li><li>A bias for action; inclined to deploy rapid testing and iteration cycles&nbsp;</li><li>The ability to work effectively in a small, relatively unstructured office environment (we work remotely)&nbsp;</li><li>Excellent verbal and written communication skills with appropriate urgency to various audiences&nbsp;</li><li>Strong self-motivation, are coachable and highly collaborative; take ownership of tasks and pride in work product&nbsp;</li><li>High integrity; are dependable, accountable, humble and respectful</li><div><br></div>","tags":"[\"Finance\",\"management\"]","pubDate":"2024-06-03 15:36:58.816","link":"https://jobs.lever.co/backflip/b3f981d2-2dd5-4f85-a0f2-d88b3e8d2e90","savedDate":"2024-06-14 14:19:00.282","slug":"senior-data-analyst-backflip-8222"},{"id":1067282312,"title":"Senior Move Engineer","company":"Avara","image":"https://pbs.twimg.com/profile_images/1725197105923293184/0HcwlDMy_400x400.jpg","description":"<div><b style=\"font-size: 18px\">About us:</b><span style=\"font-size: 18px\">&nbsp;</span></div><div><br></div><div><span style=\"font-size: 15px\">Avara builds innovative products leveraging blockchain technologies. Avara's suite includes the Aave Protocol, along with the native stablecoin GHO, Lens, an open social network, and Family, a design-first mobile crypto wallet. Avara's vision is to build a people-powered internet that benefits all.</span></div><div><br></div><div><b style=\"font-size: 18px\">Our culture:</b><span style=\"font-size: 18px\">&nbsp;</span></div><div><br></div><div>Having cultivated a thriving, collaborative culture, our team is kind, welcoming and passionate about what we are building. We celebrate differences and seek to develop and retain the most talented people from a diverse candidate pool from all over the world. No matter where you are based, no ghost will be left behind and we appreciate every moment we get to work and have fun together.</div><div><br></div><div><b style=\"font-size: 18px\">About the role:</b></div><div><br></div><div>Avara is looking for a Senior Move engineer to innovate and build upon our various products and services. You should have a strong passion for web3 technology and an understanding of smart contract development and blockchain systems. In this role, you will be responsible for designing, implementing, and writing smart contracts in Move. You will also be interacting with smart contracts in solidity and other EVM based networks. You will work closely with the Avara leadership, product and technical teams. </div><div><b style=\"font-size: 18px\">About us:</b><span style=\"font-size: 18px\">&nbsp;</span></div><div><br></div><div><span style=\"font-size: 15px\">Avara builds innovative products leveraging blockchain technologies. Avara's suite includes the Aave Protocol, along with the native stablecoin GHO, Lens, an open social network, and Family, a design-first mobile crypto wallet. Avara's vision is to build a people-powered internet that benefits all.</span></div><div><br></div><div><b style=\"font-size: 18px\">Our culture:</b><span style=\"font-size: 18px\">&nbsp;</span></div><div><br></div><div>Having cultivated a thriving, collaborative culture, our team is kind, welcoming and passionate about what we are building. We celebrate differences and seek to develop and retain the most talented people from a diverse candidate pool from all over the world. No matter where you are based, no ghost will be left behind and we appreciate every moment we get to work and have fun together.</div><div><br></div><div><b style=\"font-size: 18px\">About the role:</b></div><div><br></div><div>Avara is looking for a Senior Move engineer to innovate and build upon our various products and services. You should have a strong passion for web3 technology and an understanding of smart contract development and blockchain systems. In this role, you will be responsible for designing, implementing, and writing smart contracts in Move. You will also be interacting with smart contracts in solidity and other EVM based networks. You will work closely with the Avara leadership, product and technical teams. </div><h3>How you can make an impact:</h3><li>Designing, crafting, and testing secure Move based code</li><li>Participating in the development of protocol-level infrastructure and tools&nbsp;&nbsp;</li><li>Collaborating with cross-functional teams to define, design, and ship new features and functionality</li><li>Responding to security vulnerabilities, simulating the scenario, and evaluating a strategy and response</li><li>Debugging and troubleshooting issues that arise during the development process</li><li>Reviewing code written by other engineers to ensure it meets the required standards and specifications with a focus on security</li><li>Staying up to date with developments in the web3 ecosystem and incorporating new technologies as appropriate</li><li>Providing technical guidance, support, and mentoring to other engineers as needed</li><h3>Let's connect if:</h3><li>You are someone who builds, innovates, and ships features with the highest standards</li><li>You have expertise in Move and have high degree of comfort with advanced concepts</li><li>You have experience with network and distributed systems programming in particular as a nice-to-have as well</li><li>You research constantly and keep up with the latest hacks, tooling, and security practices</li><li>Are passionate about DeFi and Social </li><li>Experience with Rust is desirable </li><div>Haven’t quite met all the criteria? Let’s not miss out on the chance to speak. Whilst you might not meet every single requirement, you might bring other, more exciting skills to the companies! </div><div><br></div><div><b>What we stand for: </b></div><div><br></div><div><b><i>Craft</i></b><i> — Seek excellence.</i></div><div><b>Accountability</b> —&nbsp;<i>One for all. All for one.</i></div><div><b>Integrity</b> —&nbsp;<i>Be true.</i></div><div><b><i>Sisu</i></b><i> — Dig deep.</i></div><div><b>Community</b> —&nbsp;<i>We’re in it together.</i>&nbsp;</div><div><br></div><div><b>Equal opportunities statement:</b>&nbsp;</div><div><br></div><div>Avara celebrates diversity and views each and every team member as a separate individual with their own unique identity. No matter your race, religion, gender, ethnicity, age, disability, sexual orientation or even the wallet you use, we welcome you at Avara. As an equal opportunities employer, we take accountability and believe in everyone's potential to build, create and inspire changes. With a mission to build a diverse workforce, we are proud to foster a working environment in which everyone can feel safe and valued for who they are.</div>","tags":"[]","pubDate":"2024-05-30 14:28:16.607","link":"https://jobs.eu.lever.co/avara/6cc8d7de-47c7-4246-8d18-4018b3dd4818","savedDate":"2024-06-14 14:19:00.250","slug":"senior-move-engineer-avara-4244"},{"id":6111145737,"title":"Performance Marketing Manager","company":"Backflip","image":"https://lever-client-logos.s3.us-west-2.amazonaws.com/2616694d-50ee-4ca0-8184-ecbfb6dbe8a9-1686066452569.png","description":"<div><b>Join a fast growing start up changing the real estate investing industry! </b></div><div><br></div><div><a href=\"http://www.backflip.com\" class=\"postings-link\"><b>Backflip</b></a> is a venture-backed real estate <b>FinTech</b> company that supports entrepreneurs to acquire and renovate single family homes, thereby reinvigorating the housing supply and their local communities. The company offers purpose-built technology via their app and capital products to source and finance residential real estate investments. Backflip is an all-in-one platform providing entrepreneurs with the technology, data, and financing strategies that allow them to scale their business.</div><div><br></div><div>Backflip is seeking a stellar <b><i>Performance Marketing Manager</i></b> to lead our paid growth and digital marketing channels from the ground up. You will work closely with the CMO to craft and own our campaigns across all paid channels (Meta, Google, etc) and be the in house expert to help drive unprecedented growth for the company. </div><div><br></div><div>We are ready to scale and experiment! As an early hire, you will play a critical role in ensuring Backflip executes at the highest standards.&nbsp;Success in this role requires the ability to learn quickly and try new things, while ensuring our campaigns are producing results.&nbsp;</div><div><br></div><div>This position is remote (U.S.) and reports to the Chief Marketing Officer. This is a rare opportunity to get in on the ground floor (~50 person team) working directly with senior leaders in a well-capitalized startup with a great culture (Check out our <a href=\"https://techcrunch.com/2024/04/29/backflip-raises-15-million-to-help-real-estate-investors-flip-houses/?guccounter=1&amp;guce_referrer=aHR0cHM6Ly93d3cuZ29vZ2xlLmNvbS8&amp;guce_referrer_sig=AQAAABk3K7EzQ-RsoX2uq_YCeKN3dCJPqN1FsdwJFbmB30YwsTXb2qogu-d0mtoA_sfc9ZWtyzGW04VxvOa9iDbHgMqyiLHq5hahjz5Ym4hQ6WtWy-OfMFEBck0bSanRkxZg89Eme5WfG-lXEOjuecZ1mCfDE9DCAFFL8feoIKJ8RlsQ\" class=\"postings-link\">recently announced $15M Series A</a>).</div><div><b>Join a fast growing start up changing the real estate investing industry! </b></div><div><br></div><div><a href=\"http://www.backflip.com\" class=\"postings-link\"><b>Backflip</b></a> is a venture-backed real estate <b>FinTech</b> company that supports entrepreneurs to acquire and renovate single family homes, thereby reinvigorating the housing supply and their local communities. The company offers purpose-built technology via their app and capital products to source and finance residential real estate investments. Backflip is an all-in-one platform providing entrepreneurs with the technology, data, and financing strategies that allow them to scale their business.</div><div><br></div><div>Backflip is seeking a stellar <b><i>Performance Marketing Manager</i></b> to lead our paid growth and digital marketing channels from the ground up. You will work closely with the CMO to craft and own our campaigns across all paid channels (Meta, Google, etc) and be the in house expert to help drive unprecedented growth for the company. </div><div><br></div><div>We are ready to scale and experiment! As an early hire, you will play a critical role in ensuring Backflip executes at the highest standards.&nbsp;Success in this role requires the ability to learn quickly and try new things, while ensuring our campaigns are producing results.&nbsp;</div><div><br></div><div>This position is remote (U.S.) and reports to the Chief Marketing Officer. This is a rare opportunity to get in on the ground floor (~50 person team) working directly with senior leaders in a well-capitalized startup with a great culture (Check out our <a href=\"https://techcrunch.com/2024/04/29/backflip-raises-15-million-to-help-real-estate-investors-flip-houses/?guccounter=1&amp;guce_referrer=aHR0cHM6Ly93d3cuZ29vZ2xlLmNvbS8&amp;guce_referrer_sig=AQAAABk3K7EzQ-RsoX2uq_YCeKN3dCJPqN1FsdwJFbmB30YwsTXb2qogu-d0mtoA_sfc9ZWtyzGW04VxvOa9iDbHgMqyiLHq5hahjz5Ym4hQ6WtWy-OfMFEBck0bSanRkxZg89Eme5WfG-lXEOjuecZ1mCfDE9DCAFFL8feoIKJ8RlsQ\" class=\"postings-link\">recently announced $15M Series A</a>).</div><div><i>*The Compensation figure above includes Base Salary + Performance Bonus, and is based on a variety of factors including prior experience. In addition to a competitive market salary, Backflip employees receive equity stock options, 100% paid health care, a 401K + company match, among other industry-leading benefits.</i></div><h3>This candidate will champion Backflip’s culture & Core Values:</h3><li><b>Raise</b> the standard of what is possible</li><li><b>Embrace</b> being the novice to become the master</li><li><b>Work </b>only with those who want the best for us</li><li><b>Communicate </b>quickly, naturally and with radical candor</li><li><b>Test</b> new things to invent and challenge the status quo</li><li>Today, nay <b>now</b>!</li><h3>Everyday responsibilities will include:</h3><li>Lead performance marketing on Meta, Google, and other paid social channels as determined </li><li>Build and manage acquisition budgets and KPI targets with the CMO</li><li>Continually evaluate cross-channel spend to maximize revenue while optimizing to the lowest cost per acquisition possible</li><li>Oversee test strategies and innovation of creative assets - <i>how can we keep pushing to get better and better?</i></li><li>Collaborate with the broader marketing &amp; product team to guide A/B creative tests, landing page tests, and spend scaling tests to identify what works best - <i>are new users making it down the funnel?</i></li><li>Optimize website content and landing pages across all campaigns</li><li>Establish and surpass acquisition KPIs creating daily, weekly, monthly, and quarterly reporting </li><li>Utilize consumer insights to inform marketing strategies and identify opportunities for growth within the competitive landscape - <i>the better this role understands our core user the smarter we can be TOF</i></li><li>Implement new processes to keep up with the demands of the growing business and changing performance marketing landscape - <i>what new channels, ad types and platform capabilities do we need to be aware of and try? </i></li><div>&nbsp;</div><div><i>This role will evolve as the company grows; there will be various tasks that fall outside of the responsibilities above. </i></div><h3>Qualifications - Role Specific</h3><li>Bachelor's degree in a related field such as Business, Marketing, Statistics, Psychology, Communications, or other business or data related degree</li><li>Must have hands-on experience with Google Ads, Meta, Paid Search etc</li><li>3-4 years work experience in a quantitative marketing role managing strategy and execution on social, search, or other performance-oriented channels (Prior experience at a B2C start up strongly preferred;  must have experience managing campaigns in house)&nbsp;</li><li>Demonstrate past accomplishments in creating campaigns that substantially increased revenue and user growth&nbsp;</li><li>Experience driving scalable, sustainable growth strategies through testing, measuring and iteration frameworks</li><li>Data driven and analytical with the ability to assess campaign performance, identify consumer behavior, creative opportunities and manage cost per acquisition targets - are you obsessed with both your campaign data and understanding our core customer?</li><li>Self-motivated with the drive to build impactful campaigns and deliver ROI - we will be looking to to creatively ideate additional channels / messages and flows we can try </li><li>Highly collaborative with a strong bias for action - we are a collaborative internal team and one of our core values is today, nay now! </li><h3>People that thrive at Backflip have…</h3><li>A desire to learn and grow with the company; propensity to “think like an owner”</li><li>An execution-oriented “one-team” mindset with motivation and scrappiness to achieve objectives</li><li>The ability to multi-task with exceptional time management, prioritization and attention to detail</li><li>An entrepreneurial mindset and a passion for technology and innovation</li><li>A bias for action; inclined to deploy rapid testing and iteration cycles</li><li>The ability to work effectively in a small, relatively unstructured office environment (we work remotely)</li><li>Excellent verbal and written communication skills with appropriate urgency to various audiences</li><li>Strong self-motivation, are coachable and highly collaborative; take ownership of tasks and pride in work product</li><li>High integrity; are dependable, accountable, humble and respectful</li><div><i>All Backflip positions are Remote. Like the people we serve, we believe being free to create wherever you’re most inspired is one of life’s greatest joys. It’s better for individuals, for the community, and for fostering great work to emerge. With our work-from-anywhere approach, Backflip brings together a diverse team of individuals, with passions for innovation, art, coding, AI, data, finance, film, real estate, the environment, learning and teaching. Together, we're moving fast.</i></div><div><br></div><div><i>Backflip is an equal opportunity employer. We know that building a world-class organization is not possible without an intentional focus on recruiting, empowering, promoting and rewarding the best and brightest people of all backgrounds. Backflip focuses on hiring individuals that align with its Core Values (listed above), and consistently display a high ethical standard, both personally and professionally.</i></div><div><br></div><div><i>👇 Disclosures:</i></div><div><i>This role is not eligible for visa sponsorship</i></div><div><br></div>","tags":"[\"Finance\",\"management\",\"B2C\"]","pubDate":"2024-05-24 21:33:42.487","link":"https://jobs.lever.co/backflip/74a4341a-aa1f-4aaa-b507-a375a02fcd22","savedDate":"2024-06-14 14:19:00.282","slug":"performance-marketing-manager-backflip-5561"},{"id":6844270122,"title":"Remote Copy/Content Editor","company":"WebFX","image":"https://lever-client-logos.s3-us-west-2.amazonaws.com/3f4a1490-d8b2-4b84-8e68-ca668c886eae-1582815376935.png","description":"<div><span style=\"font-size: 18pt\">You Might Be a Great Fit For This Position if You Have…</span></div><div><br></div><div><b>A Bachelor’s Degree</b></div><div>Successful Fxers in this role have majored in English, Communications, Professional Writing, and other related fields</div><div>GPA above 3.4</div><div><br></div><div><b>A Few Related Skills and Experiences</b></div><div>(This is an entry-level role, and experience in every one of these areas is not required - we will train you on what you need to know! But the following skills/experience are awesome to have, and will help get your career off to a running start):</div><div><br></div><div>Part-time/summer job/internship experience is a must</div><div>Exceptional writing and communication skills</div><div>Experience writing in a digital format (blogging, etc.)</div><div>Ability to adapt your writing style to fit a variety of tones, voices, and audiences</div><div>Professional or academic backgrounds spanning any and all industries</div><div><br></div><div><b>Any of these Signature FXer Traits!</b></div><div>You have a strong passion for writing&nbsp;&nbsp;</div><div>You love research and get excited about getting into the nitty-gritty details of complex topics</div><div>You are a professional, dependable, and independent worker with a strong work ethic</div><div>You’re self-motivated, thrive on challenges, and enjoy getting things done</div><div>You have an eye for detail and dedication to high-quality work</div><div>You have an exceptional level of follow-through</div><div>You are a proactive, creative problem-solver who faces challenges with a can-do mindset</div><div>You possess excellent time management skills</div><div>You work with a sense of urgency and can consistently meet deadlines</div><div>You are a lifelong learner who loves to grow and stretch outside of your comfort zone, and are always looking to improve your skills</div><div><br></div><div>If any of these sound like you, then we want to hear from you! We are committed to growing 1% better everyday, and we believe working at WebFX could quite possibly make your life 1(00)% better - after all, you would be surrounded by the #BestCoworkersinPA!</div><div><br></div><div><span style=\"font-size: 18pt\">In This Role, You’ll Get To…</span></div><div><br></div><div>-Work with WebFX in a long-term partnership as part of our remote Copy team</div><div>-Edit an array of content types (think blogs, sales copy, long form content, etc), and spanning over 800+ industries</div><div>-Produce work for over 5,000 publishers and clients on the web and in the media</div><div>-Perform research to better understand the topics assigned, and be able to clearly communicate them to the client’s audience</div><div>-Manage your time effectively in order to turn around projects on deadline</div><div>-Troubleshoot, solve problems on the fly, and figure things out independently when needed - take initiative and accountability for all assigned projects</div><div>-Enjoy flexibility in this 40-hour/week independent contractor position, with the opportunity to tackle assignments from the location of your choosing!</div><div><br></div><div><b>What To Expect From Life on Our Copy Team!</b></div><div>-This position is fully remote! Work from anywhere as long as you have a great internet connection, a reliable laptop, and a comfortable workspace</div><div>-This position requires 40 hours of availability per week, but our editors enjoy a high level of flexibility in their daily schedule</div><div>-Our Remote Copy roles are designed with longevity and stability in mind - some of our most experienced writers and editors have been working with us for over 10 years!</div><div><br></div><div><span style=\"font-size: 18pt\">What You’ll Get From Us!</span></div><div><br></div><div><b>Opportunities to Learn and Train With Our Team!</b></div><div>Each of our partners benefits from our world-class training program. As part of our mission, we commit to helping our team and partners stay on the leading edge of the industry. We achieve this through ongoing training programs, incentives for learning, regular Lunch-and-Learns, and more</div><div><br></div><div><b>A Place to Grow Your Career</b></div><div>WebFX grew 250%+ over the past 3 years, and merit-based promotional opportunities are abundant for new FXers who meet or exceed position performance metrics</div><div><br></div><div><b>Monthly Retainers:</b>&nbsp;</div><div>In addition to the compensation provided to the contractor, WebFX offers 6 paid holidays along with a $180 monthly retainer to utilize as the contractor sees fit in order to better perform the agreed-upon services to WebFX</div><div><br></div><div><b>Flexibility:</b>&nbsp;</div><div>As an independent contractor, you get to have the flexibility and convenience of working from home.</div><div><br></div><div><b>Make a Difference:</b>&nbsp;</div><div>WebFX strives to not only improve the lives of our clients and everyone who works for them, but to make a tangible difference on a global level as well. Through #FXBuilds, our goal is to positively change the lives of 10,000 people by 2024. Your work will contribute to #FXBuilds by helping us reach client goals!</div><div><br></div><div><b>Performance Bonuses:</b></div><div>Contractors are eligible for performance bonuses totaling up to $1,000 per year</div><div><br></div><div><b>Compensation:</b></div><div>-<b>&nbsp;</b>Hourly Rates starting between $18 and $21. An annual income equivalent to $42k to $46k (potentially higher based on work experience)</div><div>- $1k potential in bonuses annually</div><div>- $200+ monthly stipend: Extra cash for whatever you deem necessary to improve your remote work life! Other writers and editors have used this bonus to cover their various expenses such as Internet, health care expenses, contributions to their rent, luxuries for their home office, and much more. This bonus is provided as a thank-you for your ongoing contributions and loyalty to WebFX.&nbsp;&nbsp;</div><div>- $1200 travel stipend: <a href=\"https://drive.google.com/file/d/1Qq1nnZ-4ILgraF72NC54LmyFnBE0Q_FR/view?usp=sharing\" class=\"postings-link\">Recharge your batteries</a>! WebFX cares deeply about maintaining a work/life balance and understands the importance of mental health. This travel stipend is earned after your first 365 days on the team and will continue to be provided once every 365 days thereafter. If you want to travel abroad or spend some time at the beach for some relaxation, we'll cover up to $1200 of your expenses!</div><div><br></div><div>#LI-Remote</div><div><span style=\"font-size: 18pt;\">You Might Be a Great Fit For This Position if You Have…</span></div><div><br></div><div><b>A Bachelor’s Degree</b></div><div>Successful Fxers in this role have majored in English, Communications, Professional Writing, and other related fields</div><div>GPA above 3.4</div><div><br></div><div><b>A Few Related Skills and Experiences</b></div><div>(This is an entry-level role, and experience in every one of these areas is not required - we will train you on what you need to know! But the following skills/experience are awesome to have, and will help get your career off to a running start):</div><div><br></div><div>Part-time/summer job/internship experience is a must</div><div>Exceptional writing and communication skills</div><div>Experience writing in a digital format (blogging, etc.)</div><div>Ability to adapt your writing style to fit a variety of tones, voices, and audiences</div><div>Professional or academic backgrounds spanning any and all industries</div><div><br></div><div><b>Any of these Signature FXer Traits!</b></div><div>You have a strong passion for writing&nbsp;&nbsp;</div><div>You love research and get excited about getting into the nitty-gritty details of complex topics</div><div>You are a professional, dependable, and independent worker with a strong work ethic</div><div>You’re self-motivated, thrive on challenges, and enjoy getting things done</div><div>You have an eye for detail and dedication to high-quality work</div><div>You have an exceptional level of follow-through</div><div>You are a proactive, creative problem-solver who faces challenges with a can-do mindset</div><div>You possess excellent time management skills</div><div>You work with a sense of urgency and can consistently meet deadlines</div><div>You are a lifelong learner who loves to grow and stretch outside of your comfort zone, and are always looking to improve your skills</div><div><br></div><div>If any of these sound like you, then we want to hear from you! We are committed to growing 1% better everyday, and we believe working at WebFX could quite possibly make your life 1(00)% better - after all, you would be surrounded by the #BestCoworkersinPA!</div><div><br></div><div><span style=\"font-size: 18pt;\">In This Role, You’ll Get To…</span></div><div><br></div><div>-Work with WebFX in a long-term partnership as part of our remote Copy team</div><div>-Edit an array of content types (think blogs, sales copy, long form content, etc), and spanning over 800+ industries</div><div>-Produce work for over 5,000 publishers and clients on the web and in the media</div><div>-Perform research to better understand the topics assigned, and be able to clearly communicate them to the client’s audience</div><div>-Manage your time effectively in order to turn around projects on deadline</div><div>-Troubleshoot, solve problems on the fly, and figure things out independently when needed - take initiative and accountability for all assigned projects</div><div>-Enjoy flexibility in this 40-hour/week independent contractor position, with the opportunity to tackle assignments from the location of your choosing!</div><div><br></div><div><b>What To Expect From Life on Our Copy Team!</b></div><div>-This position is fully remote! Work from anywhere as long as you have a great internet connection, a reliable laptop, and a comfortable workspace</div><div>-This position requires 40 hours of availability per week, but our editors enjoy a high level of flexibility in their daily schedule</div><div>-Our Remote Copy roles are designed with longevity and stability in mind - some of our most experienced writers and editors have been working with us for over 10 years!</div><div><br></div><div><span style=\"font-size: 18pt;\">What You’ll Get From Us!</span></div><div><br></div><div><b>Opportunities to Learn and Train With Our Team!</b></div><div>Each of our partners benefits from our world-class training program. As part of our mission, we commit to helping our team and partners stay on the leading edge of the industry. We achieve this through ongoing training programs, incentives for learning, regular Lunch-and-Learns, and more</div><div><br></div><div><b>A Place to Grow Your Career</b></div><div>WebFX grew 250%+ over the past 3 years, and merit-based promotional opportunities are abundant for new FXers who meet or exceed position performance metrics</div><div><br></div><div><b>Monthly Retainers:</b>&nbsp;</div><div>In addition to the compensation provided to the contractor, WebFX offers 6 paid holidays along with a $180 monthly retainer to utilize as the contractor sees fit in order to better perform the agreed-upon services to WebFX</div><div><br></div><div><b>Flexibility:</b>&nbsp;</div><div>As an independent contractor, you get to have the flexibility and convenience of working from home.</div><div><br></div><div><b>Make a Difference:</b>&nbsp;</div><div>WebFX strives to not only improve the lives of our clients and everyone who works for them, but to make a tangible difference on a global level as well. Through #FXBuilds, our goal is to positively change the lives of 10,000 people by 2024. Your work will contribute to #FXBuilds by helping us reach client goals!</div><div><br></div><div><b>Performance Bonuses:</b></div><div>Contractors are eligible for performance bonuses totaling up to $1,000 per year</div><div><br></div><div><b>Compensation:</b></div><div>-<b>&nbsp;</b>Hourly Rates starting between $18 and $21. An annual income equivalent to $42k to $46k (potentially higher based on work experience)</div><div>- $1k potential in bonuses annually</div><div>- $200+ monthly stipend: Extra cash for whatever you deem necessary to improve your remote work life! Other writers and editors have used this bonus to cover their various expenses such as Internet, health care expenses, contributions to their rent, luxuries for their home office, and much more. This bonus is provided as a thank-you for your ongoing contributions and loyalty to WebFX.&nbsp;&nbsp;</div><div>- $1200 travel stipend: <a href=\"https://drive.google.com/file/d/1Qq1nnZ-4ILgraF72NC54LmyFnBE0Q_FR/view?usp=sharing\" class=\"postings-link\" target=\"_blank\" rel=\"noopener noreferrer\">Recharge your batteries</a>! WebFX cares deeply about maintaining a work/life balance and understands the importance of mental health. This travel stipend is earned after your first 365 days on the team and will continue to be provided once every 365 days thereafter. If you want to travel abroad or spend some time at the beach for some relaxation, we'll cover up to $1200 of your expenses!</div><div><br></div><div>#LI-Remote</div><div>Check out our culture on social media:</div><div><a href=\"https://www.instagram.com/webfx\" class=\"postings-link\">Instagram</a></div><div><a href=\"https://twitter.com/webfx\" class=\"postings-link\">Twitter</a></div><div><a href=\"https://www.facebook.com/webfxinc/\" class=\"postings-link\">Facebook</a></div><div><br></div><div><i style=\"font-size: 14.6667px\">*You don't need to apply more than once, even if you're interested in multiple positions - you can simply let us know! We consider all open roles when reviewing resumes and applications! </i></div><div><br></div><div>WebFX is an Equal Opportunity Employer committed to providing and fostering an inclusive environment where all people, including women, minorities, LGBTQ+, and other underrepresented groups, are supported, respected, and encouraged to excel within STEM careers. Our goal as an organization is to empower our team to achieve their personal best, bring people together, and provide equal opportunity to do so regardless of race, age, gender, sexual orientation, religion, physical ability or disability, or political affiliation. <a href=\"https://equality.webfx.com/\" class=\"postings-link\">You can learn more on our website here</a>!</div>","tags":"[\"management\"]","pubDate":"2024-05-24 15:57:08.885","link":"https://jobs.lever.co/webfx/5982c2cb-a361-4841-92e2-6311aaf67247","savedDate":"2024-06-14 14:19:00.266","slug":"remote-copy-content-editor-webfx-2922"},{"id":7084812217,"title":"Staff Move Engineer","company":"Avara","image":"https://pbs.twimg.com/profile_images/1725197105923293184/0HcwlDMy_400x400.jpg","description":"<div><b style=\"font-size: 18px\">About us:</b><span style=\"font-size: 18px\">&nbsp;</span></div><div><br></div><div><span style=\"font-size: 15px\">Avara builds innovative products leveraging blockchain technologies. Avara's suite includes the Aave Protocol, along with the native stablecoin GHO, Lens, an open social network, and Family, a design-first mobile crypto wallet. Avara's vision is to build a people-powered internet that benefits all.</span></div><div><br></div><div><b style=\"font-size: 18px\">Our culture:</b><span style=\"font-size: 18px\">&nbsp;</span></div><div><br></div><div>Having cultivated a thriving, collaborative culture, our team is kind, welcoming and passionate about what we are building. We celebrate differences and seek to develop and retain the most talented people from a diverse candidate pool from all over the world. No matter where you are based, no ghost will be left behind and we appreciate every moment we get to work and have fun together.</div><div><br></div><div><b style=\"font-size: 18px\">About the role:</b></div><div><br></div><div>Avara is looking for a staff Move engineer to innovate and build upon our various products and services. You should have a strong passion for web3 technology and an understanding of smart contract development and blockchain systems. In this role, you will be responsible for designing, implementing, and writing smart contracts in Move. You will also be interacting with smart contracts in solidity and other EVM based networks. You will work closely with the Avara leadership, product and technical teams. </div><div><b style=\"font-size: 18px\">About us:</b><span style=\"font-size: 18px\">&nbsp;</span></div><div><br></div><div><span style=\"font-size: 15px\">Avara builds innovative products leveraging blockchain technologies. Avara's suite includes the Aave Protocol, along with the native stablecoin GHO, Lens, an open social network, and Family, a design-first mobile crypto wallet. Avara's vision is to build a people-powered internet that benefits all.</span></div><div><br></div><div><b style=\"font-size: 18px\">Our culture:</b><span style=\"font-size: 18px\">&nbsp;</span></div><div><br></div><div>Having cultivated a thriving, collaborative culture, our team is kind, welcoming and passionate about what we are building. We celebrate differences and seek to develop and retain the most talented people from a diverse candidate pool from all over the world. No matter where you are based, no ghost will be left behind and we appreciate every moment we get to work and have fun together.</div><div><br></div><div><b style=\"font-size: 18px\">About the role:</b></div><div><br></div><div>Avara is looking for a staff Move engineer to innovate and build upon our various products and services. You should have a strong passion for web3 technology and an understanding of smart contract development and blockchain systems. In this role, you will be responsible for designing, implementing, and writing smart contracts in Move. You will also be interacting with smart contracts in solidity and other EVM based networks. You will work closely with the Avara leadership, product and technical teams. </div><h3>How you can make an impact:</h3><li>Designing, crafting, and testing secure Move based code</li><li>Participating in the development of protocol-level infrastructure and tools&nbsp;&nbsp;</li><li>Collaborating with cross-functional teams to define, design, and ship new features and functionality</li><li>Responding to security vulnerabilities, simulating the scenario, and evaluating a strategy and response</li><li>Debugging and troubleshooting issues that arise during the development process</li><li>Reviewing code written by other engineers to ensure it meets the required standards and specifications with a focus on security</li><li>Staying up to date with developments in the web3 ecosystem and incorporating new technologies as appropriate</li><li>Providing technical guidance, support, and mentoring to other engineers as needed</li><h3>Let's connect if:</h3><li>You are someone who builds, innovates, and ships features with the highest standards</li><li>You have expertise in Move and have high degree of comfort with advanced concepts</li><li>You have experience with network and distributed systems programming in particular as a nice-to-have as well</li><li>You research constantly and keep up with the latest hacks, tooling, and security practices</li><li>Are passionate about DeFi and Social </li><li>Experience with Rust is desirable </li><div>Haven’t quite met all the criteria? Let’s not miss out on the chance to speak. Whilst you might not meet every single requirement, you might bring other, more exciting skills to the companies! </div><div><br></div><div><b>What we stand for: </b></div><div><br></div><div><b><i>Craft</i></b><i> — Seek excellence.</i></div><div><b>Accountability</b> —&nbsp;<i>One for all. All for one.</i></div><div><b>Integrity</b> —&nbsp;<i>Be true.</i></div><div><b><i>Sisu</i></b><i> — Dig deep.</i></div><div><b>Community</b> —&nbsp;<i>We’re in it together.</i>&nbsp;</div><div><br></div><div><b>Equal opportunities statement:</b>&nbsp;</div><div><br></div><div>Avara celebrates diversity and views each and every team member as a separate individual with their own unique identity. No matter your race, religion, gender, ethnicity, age, disability, sexual orientation or even the wallet you use, we welcome you at Avara. As an equal opportunities employer, we take accountability and believe in everyone's potential to build, create and inspire changes. With a mission to build a diverse workforce, we are proud to foster a working environment in which everyone can feel safe and valued for who they are.</div>","tags":"[]","pubDate":"2024-05-23 12:17:09.334","link":"https://jobs.eu.lever.co/avara/b643fd29-eedf-433d-a4ac-19916d4a5668","savedDate":"2024-06-14 14:19:00.252","slug":"staff-move-engineer-avara-9529"},{"id":5757401497,"title":"Staff Move Engineer","company":"Avara","image":"https://pbs.twimg.com/profile_images/1725197105923293184/0HcwlDMy_400x400.jpg","description":"<div><b style=\"font-size: 18px\">About us:</b><span style=\"font-size: 18px\">&nbsp;</span></div><div><br></div><div><span style=\"font-size: 15px\">Avara builds innovative products leveraging blockchain technologies. Avara's suite includes the Aave Protocol, along with the native stablecoin GHO, Lens, an open social network, and Family, a design-first mobile crypto wallet. Avara's vision is to build a people-powered internet that benefits all.</span></div><div><br></div><div><b style=\"font-size: 18px\">Our culture:</b><span style=\"font-size: 18px\">&nbsp;</span></div><div><br></div><div>Having cultivated a thriving, collaborative culture, our team is kind, welcoming and passionate about what we are building. We celebrate differences and seek to develop and retain the most talented people from a diverse candidate pool from all over the world. No matter where you are based, no ghost will be left behind and we appreciate every moment we get to work and have fun together.</div><div><br></div><div><b style=\"font-size: 18px\">About the role:</b></div><div><br></div><div>Avara is looking for a staff Move engineer to innovate and build upon our various products and services. You should have a strong passion for web3 technology and an understanding of smart contract development and blockchain systems. In this role, you will be responsible for designing, implementing, and writing smart contracts in Move. You will also be interacting with smart contracts in solidity and other EVM based networks. You will work closely with the Avara leadership, product and technical teams. </div><div><b style=\"font-size: 18px;\">About us:</b><span style=\"font-size: 18px;\">&nbsp;</span></div><div><br></div><div><span style=\"font-size: 15px;\">Avara builds innovative products leveraging blockchain technologies. Avara's suite includes the Aave Protocol, along with the native stablecoin GHO, Lens, an open social network, and Family, a design-first mobile crypto wallet. Avara's vision is to build a people-powered internet that benefits all.</span></div><div><br></div><div><b style=\"font-size: 18px;\">Our culture:</b><span style=\"font-size: 18px;\">&nbsp;</span></div><div><br></div><div>Having cultivated a thriving, collaborative culture, our team is kind, welcoming and passionate about what we are building. We celebrate differences and seek to develop and retain the most talented people from a diverse candidate pool from all over the world. No matter where you are based, no ghost will be left behind and we appreciate every moment we get to work and have fun together.</div><div><br></div><div><b style=\"font-size: 18px;\">About the role:</b></div><div><br></div><div>Avara is looking for a staff Move engineer to innovate and build upon our various products and services. You should have a strong passion for web3 technology and an understanding of smart contract development and blockchain systems. In this role, you will be responsible for designing, implementing, and writing smart contracts in Move. You will also be interacting with smart contracts in solidity and other EVM based networks. You will work closely with the Avara leadership, product and technical teams. </div><h3>How you can make an impact:</h3><li>Designing, crafting, and testing secure Move based code</li><li>Participating in the development of protocol-level infrastructure and tools&nbsp;&nbsp;</li><li>Collaborating with cross-functional teams to define, design, and ship new features and functionality</li><li>Responding to security vulnerabilities, simulating the scenario, and evaluating a strategy and response</li><li>Debugging and troubleshooting issues that arise during the development process</li><li>Reviewing code written by other engineers to ensure it meets the required standards and specifications with a focus on security</li><li>Staying up to date with developments in the web3 ecosystem and incorporating new technologies as appropriate</li><li>Providing technical guidance, support, and mentoring to other engineers as needed</li><h3>Let's connect if:</h3><li>You are someone who builds, innovates, and ships features with the highest standards</li><li>You have expertise in Move and have high degree of comfort with advanced concepts</li><li>You have experience with network and distributed systems programming in particular as a nice-to-have as well</li><li>You research constantly and keep up with the latest hacks, tooling, and security practices</li><li>Are passionate about DeFi and Social </li><li>Experience with Rust is desirable </li><div>Haven’t quite met all the criteria? Let’s not miss out on the chance to speak. Whilst you might not meet every single requirement, you might bring other, more exciting skills to the companies! </div><div><br></div><div><b>What we stand for: </b></div><div><br></div><div><b><i>Craft</i></b><i> — Seek excellence.</i></div><div><b>Accountability</b> —&nbsp;<i>One for all. All for one.</i></div><div><b>Integrity</b> —&nbsp;<i>Be true.</i></div><div><b><i>Sisu</i></b><i> — Dig deep.</i></div><div><b>Community</b> —&nbsp;<i>We’re in it together.</i>&nbsp;</div><div><br></div><div><b>Equal opportunities statement:</b>&nbsp;</div><div><br></div><div>Avara celebrates diversity and views each and every team member as a separate individual with their own unique identity. No matter your race, religion, gender, ethnicity, age, disability, sexual orientation or even the wallet you use, we welcome you at Avara. As an equal opportunities employer, we take accountability and believe in everyone's potential to build, create and inspire changes. With a mission to build a diverse workforce, we are proud to foster a working environment in which everyone can feel safe and valued for who they are.</div>","tags":"[]","pubDate":"2024-05-23 12:03:28.841","link":"https://jobs.eu.lever.co/avara/9285b899-f297-463d-9056-15c93a3338f2","savedDate":"2024-06-14 14:19:00.251","slug":"staff-move-engineer-avara-1504"},{"id":3141113440,"title":"Head of Ecosystem Growth","company":"Manta Network","image":"https://manta.network/assets/img/logo.svg","description":"<div>Are you ready to dive into the future of web3 and help shape the Manta Network ecosystem? We’re on the hunt for a visionary Head of Ecosystem Growth to lead our strategic expansion and build powerful partnerships within the crypto space. This role is your chance to drive Manta Network’s growth by crafting and executing innovative plans that amplify our reach and market presence.</div><div>&nbsp;</div><div>About the Role:</div><div>At Manta Network, our mission is to provide cutting-edge privacy-preserving solutions for the Web3 world. We believe that our mission can only be achieved with a thriving ecosystem of partners and projects building on our technology. As the Head of Ecosystem Growth, you will own Manta Network’s systems and programs to drive partner and community-led growth at scale, including managing the success of our rapidly expanding Web3 technology partnerships and builder funnels.</div><div>&nbsp;</div><div>Key Responsibilities:</div><div>●<span style=\"font-size: 7pt\">&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; </span>Lead the Charge: Drive Manta Network’s business development efforts and discover untapped growth opportunities.</div><div>●<span style=\"font-size: 7pt\">&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; </span>Forge Strong Bonds: Develop and maintain relationships with key stakeholders and partners in the web3 ecosystem.</div><div>●<span style=\"font-size: 7pt\">&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; </span>Strategic Vision: Define our ecosystem strategy and KPI framework in collaboration with the Head of Growth.</div><div>●<span style=\"font-size: 7pt\">&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; </span>Collaborate with Visionaries: Work closely with our leadership, product, and engineering teams to identify, prioritize, and seize new business and technology partnership opportunities.</div><div>●<span style=\"font-size: 7pt\">&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; </span>Seal the Deals: Negotiate and close strategic partnerships and client deals.</div><div>●<span style=\"font-size: 7pt\">&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; </span>Community Programs: Own and manage our builder and community programs, including accelerator and ambassador initiatives.</div><div>●<span style=\"font-size: 7pt\">&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; </span>Raise Awareness: Work with the Marketing team to spotlight Manta Network’s partners and community contributions.</div><div>●<span style=\"font-size: 7pt\">&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; </span>Stay Ahead of the Curve: Keep a pulse on industry trends and developments to keep Manta Network at the cutting edge of the crypto world.</div><div>●<span style=\"font-size: 7pt\">&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; </span>Attract Talent: Attract external funding and development teams to build solutions that accelerate the adoption of Manta Network’s infrastructure.</div><div>&nbsp;</div><div>Qualifications:</div><div>●<span style=\"font-size: 7pt\">&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; </span>Deep Web3 Experience: 5+ years in ecosystem development, business development, or product/project management, ideally with management experience.</div><div>●<span style=\"font-size: 7pt\">&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; </span>Solid Network: Proven relationships with major web2 and web3 organizations.</div><div>●<span style=\"font-size: 7pt\">&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; </span>Crypto Native: Connections with ecosystem funds, and leading projects in the crypto space.</div><div>●<span style=\"font-size: 7pt\">&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; </span>Deal-Making Pro: A strong track record of closing deals and driving revenue growth.</div><div>●<span style=\"font-size: 7pt\">&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; </span>Crypto Cred: Prior experience in ecosystem development for a crypto project.</div><div>●<span style=\"font-size: 7pt\">&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; </span>Master Communicator: Stellar communication and negotiation skills.</div><div>●<span style=\"font-size: 7pt\">&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; </span>Strategic Thinker: An entrepreneurial mindset with the ability to think strategically and drive impactful business initiatives.</div><div>●<span style=\"font-size: 7pt\">&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; </span>Tech Savvy: Familiarity with decentralized application development and the Web3 tech stack.</div><div>●<span style=\"font-size: 7pt\">&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; </span>Organizational Skills: Excellent organizational planning, attention to detail, and the ability to juggle multiple projects at different stages.</div><div>●<span style=\"font-size: 7pt\">&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; </span>Collaborative Spirit: Ability to work collaboratively with builders from various backgrounds.</div><div>&nbsp;</div><div>Join Manta Network and be at the forefront of the web3 revolution. Your leadership will be crucial in propelling our ecosystem forward and cementing Manta Network’s position as a trailblazer in the crypto industry. Let’s build the future of decentralized finance together.</div><div>Are you ready to dive into the future of web3 and help shape the Manta Network ecosystem? We’re on the hunt for a visionary Head of Ecosystem Growth to lead our strategic expansion and build powerful partnerships within the crypto space. This role is your chance to drive Manta Network’s growth by crafting and executing innovative plans that amplify our reach and market presence.</div><div>&nbsp;</div><div>About the Role:</div><div>At Manta Network, our mission is to provide cutting-edge privacy-preserving solutions for the Web3 world. We believe that our mission can only be achieved with a thriving ecosystem of partners and projects building on our technology. As the Head of Ecosystem Growth, you will own Manta Network’s systems and programs to drive partner and community-led growth at scale, including managing the success of our rapidly expanding Web3 technology partnerships and builder funnels.</div><div>&nbsp;</div><div>Key Responsibilities:</div><div>●<span style=\"font-size: 7pt;\">&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; </span>Lead the Charge: Drive Manta Network’s business development efforts and discover untapped growth opportunities.</div><div>●<span style=\"font-size: 7pt;\">&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; </span>Forge Strong Bonds: Develop and maintain relationships with key stakeholders and partners in the web3 ecosystem.</div><div>●<span style=\"font-size: 7pt;\">&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; </span>Strategic Vision: Define our ecosystem strategy and KPI framework in collaboration with the Head of Growth.</div><div>●<span style=\"font-size: 7pt;\">&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; </span>Collaborate with Visionaries: Work closely with our leadership, product, and engineering teams to identify, prioritize, and seize new business and technology partnership opportunities.</div><div>●<span style=\"font-size: 7pt;\">&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; </span>Seal the Deals: Negotiate and close strategic partnerships and client deals.</div><div>●<span style=\"font-size: 7pt;\">&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; </span>Community Programs: Own and manage our builder and community programs, including accelerator and ambassador initiatives.</div><div>●<span style=\"font-size: 7pt;\">&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; </span>Raise Awareness: Work with the Marketing team to spotlight Manta Network’s partners and community contributions.</div><div>●<span style=\"font-size: 7pt;\">&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; </span>Stay Ahead of the Curve: Keep a pulse on industry trends and developments to keep Manta Network at the cutting edge of the crypto world.</div><div>●<span style=\"font-size: 7pt;\">&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; </span>Attract Talent: Attract external funding and development teams to build solutions that accelerate the adoption of Manta Network’s infrastructure.</div><div>&nbsp;</div><div>Qualifications:</div><div>●<span style=\"font-size: 7pt;\">&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; </span>Deep Web3 Experience: 5+ years in ecosystem development, business development, or product/project management, ideally with management experience.</div><div>●<span style=\"font-size: 7pt;\">&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; </span>Solid Network: Proven relationships with major web2 and web3 organizations.</div><div>●<span style=\"font-size: 7pt;\">&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; </span>Crypto Native: Connections with ecosystem funds, and leading projects in the crypto space.</div><div>●<span style=\"font-size: 7pt;\">&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; </span>Deal-Making Pro: A strong track record of closing deals and driving revenue growth.</div><div>●<span style=\"font-size: 7pt;\">&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; </span>Crypto Cred: Prior experience in ecosystem development for a crypto project.</div><div>●<span style=\"font-size: 7pt;\">&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; </span>Master Communicator: Stellar communication and negotiation skills.</div><div>●<span style=\"font-size: 7pt;\">&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; </span>Strategic Thinker: An entrepreneurial mindset with the ability to think strategically and drive impactful business initiatives.</div><div>●<span style=\"font-size: 7pt;\">&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; </span>Tech Savvy: Familiarity with decentralized application development and the Web3 tech stack.</div><div>●<span style=\"font-size: 7pt;\">&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; </span>Organizational Skills: Excellent organizational planning, attention to detail, and the ability to juggle multiple projects at different stages.</div><div>●<span style=\"font-size: 7pt;\">&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; </span>Collaborative Spirit: Ability to work collaboratively with builders from various backgrounds.</div><div>&nbsp;</div><div>Join Manta Network and be at the forefront of the web3 revolution. Your leadership will be crucial in propelling our ecosystem forward and cementing Manta Network’s position as a trailblazer in the crypto industry. Let’s build the future of decentralized finance together.</div>","tags":"[\"Finance\",\"management\",\"engineering\"]","pubDate":"2024-05-21 14:57:08.796","link":"https://jobs.lever.co/MantaNetwork/767c6458-2348-47a8-82b4-723e44e16056","savedDate":"2024-06-14 14:19:00.284","slug":"head-of-ecosystem-growth-manta-network-610"},{"id":7467375625,"title":"Finance Controller (Fully Remote)","company":"CoverGo","image":"https://pbs.twimg.com/profile_images/1382655628523364355/MWPIbbID_400x400.jpg","description":"<p><strong>Top 3 Reasons To Join Us</strong></p><ul> <li>Competitive Salary</li> <li>100% Remote</li> </ul><ul><li>International team</li></ul><ul><li>Working on the latest tech for the Insurtech Market Leader</li></ul><p><strong>About Us</strong></p><p>At CoverGo, our mission is to empower all insurance companies to make insurance 100% digital and accessible to everyone.</p><ul> <li>We are a leading global no-code insurance platform for health, life, and P&amp;C</li> <li>We’re the winner of the Insurtech of the Year in all of Asia and other awards globally</li> <li>We work with insurance enterprise clients such as AXA, Bupa, MSIG, Dai-ichi, Bank of China Group Insurance, and many more</li> <li>We're an international, diverse team of over 120 people with 30 nationalities and team members working remotely from all over the world</li> <li>We are fully funded and backed by reputable VC funds and strategic institutional investors</li> <li>We have a global presence in Asia, EMEA and the Americas</li> <li>We’ve grown our annualized revenue by over 30x since January 2021</li> <li>We’re constantly working towards making CoverGo a workplace that you love coming to. We deeply believe that bringing together a diversity of thoughts, expressions, and perspectives is key to building the best culture for equally diverse communities all over the world</li> </ul><p><strong>About the Role</strong></p><p>As a Finance Controller, you'll lead the financial operations of multiple entities within our group, ensuring compliance with regulations and company policies. Collaborating with executive management, you'll develop forecasts, budgets, and long-term financial plans to support our objectives, including potential IPO considerations. Your international financial expertise will guide us through cross-border complexities, while your hands-on approach will optimize cash flow management and budgeting processes. Additionally, any previous leadership experience will help you manage our existing team of accountants.</p><p><strong>What You Will Do</strong></p><ul> <li>Provide leadership in overseeing the financial operations of multiple entities within the group.</li> <li>Ensure compliance with accounting standards, financial regulations, and company policies.</li> <li>Collaborate with executive management to develop financial forecasts, budgets, and long-term financial plans aligned with the company's objectives. .</li> <li>Contribute to the development and execution of financial plans for future growth, including potential IPO considerations.</li> <li>Prepare comprehensive financial proposals, presentations, and due diligence documents to support fundraising efforts.</li> <li>Leverage extensive international financial experience to navigate the complexities of managing finances across borders.</li> <li>Handle multi-currency transactions and understand the nuances of financial regulations in various jurisdictions.</li> <li>Lead and mentor a high-performing finance team, fostering a culture of excellence and collaboration.</li> <li>Provide guidance on complex financial issues and ensure professional development within the team.</li> <li>Bring expertise in financial technology or insurtech, staying abreast of industry trends and implementing relevant technologies to enhance financial processes.</li> <li>Optimize cash flow management, working capital, and budgeting processes to maximize profitability and minimize financial risks.</li> </ul><p><strong>What We Need</strong></p><ul> <li>Bachelor's degree in Finance, Economics, or Business</li> <li>CPA or ACCA certification is mandatory</li> <li>10+ years of progressive experience in financial roles, with a strong preference for international companies</li> <li>Demonstrated experience overseeing financial operations across multiple jurisdictions</li> <li>Prior exposure to financial technology (FinTech) or insurtech is highly desirable</li> <li>Experience with initial public offerings (IPO) is a significant advantage</li> <li>Experience with Xero or Quickbooks is a plus</li> <li>Previous work experience in a Big Four accounting firm is a plus</li> <li>Able to work independently and under pressure in a fast-paced environment with an emphasis on accuracy and timeliness</li> <li>Meticulous, well-organized and conscientious with a high level of initiative at work</li> <li>Self-motivated, hardworking, a strong sense of responsibility with a positive working attitude</li> <li>Resourceful, can-do attitude and willingness to learn and go beyond</li> <li>Great English communication skills</li> <li>Based in the Philippines</li> </ul><p><strong>Why You'll Love Working Here</strong></p><ul> <li>Fully Remote</li> <li>Flexible Leave</li> <li>International Environment</li> <li>Competitive remuneration package</li> <li>Performance Bonus</li> <li>Stock Options after 6 months</li> <li>Company activities and events</li> <li>Learning and development plan</li> <li>Remote work allowance</li> </ul><p><strong>CoverGo Company</strong><a href=\"https://www.youtube.com/watch?v=YI0ezLxvFvA\" rel=\"nofollow noreferrer noopener\" class=\"external\"><strong> Video</strong></a></p><p>By submitting your application, you confirm that you have read, understood, and accepted the content of CoverGo’s<a href=\"https://apply.workable.com/covergo/gdpr_policy?lng=en\" rel=\"nofollow noreferrer noopener\" class=\"external\"> Privacy Notice</a> and you consent to the processing of your data as part of this application.</p><p></p><h3>Requirements: </h3><h3>Benefits: </h3>","tags":"[\"Finance\",\"management\"]","pubDate":"2024-05-21 00:00:00.000","link":"https://apply.workable.com/covergo/j/C5BD527F2B","savedDate":"2024-06-14 14:19:00.248","slug":"finance-controller-fully-remote-covergo-113"},{"id":3581436638,"title":"Product Designer","company":"Backflip","image":"https://lever-client-logos.s3.us-west-2.amazonaws.com/2616694d-50ee-4ca0-8184-ecbfb6dbe8a9-1686066452569.png","description":"<div><b>Come help us change residential real estate investing for the better!</b></div><div><br></div><div><b>Backflip </b>is a venture-backed real estate <b>FinTech </b>company that supports entrepreneurs to acquire and renovate single family homes, thereby reinvigorating the housing supply and their local communities. The company offers purpose-built technology and capital products to source, analyze and finance residential real estate investments. Backflip is an all-in-one platform providing entrepreneurs with the technology, data, and financing strategies that allows them to scale their businesses.</div><div><br></div><div>Backflip is looking for a Product Designer to join our team. The Product Designer will creatively solve our customers' problems and enhance the user experience on our innovative platform. This key role involves designing intuitive and engaging user interfaces that simplify real estate investing for our diverse audience. By continuously testing and improving our designs, your work will play a crucial role in making real estate investment easy and accessible for everyone. Success in this role involves the ability to learn quickly while continuing to balance appropriate amounts of structure and autonomy. <b>Online portfolio required to apply.</b></div><div><br></div><div>This position is remote (U.S.) and reports to the Chief Product Officer. This is a rare opportunity to get in on the ground floor (~45 person team) working directly with executives in a fast-paced and well-capitalized startup (Series A).</div><div><b>Come help us change residential real estate investing for the better!</b></div><div><br></div><div><b>Backflip </b>is a venture-backed real estate <b>FinTech </b>company that supports entrepreneurs to acquire and renovate single family homes, thereby reinvigorating the housing supply and their local communities. The company offers purpose-built technology and capital products to source, analyze and finance residential real estate investments. Backflip is an all-in-one platform providing entrepreneurs with the technology, data, and financing strategies that allows them to scale their businesses.</div><div><br></div><div>Backflip is looking for a Product Designer to join our team. The Product Designer will creatively solve our customers' problems and enhance the user experience on our innovative platform. This key role involves designing intuitive and engaging user interfaces that simplify real estate investing for our diverse audience. By continuously testing and improving our designs, your work will play a crucial role in making real estate investment easy and accessible for everyone. Success in this role involves the ability to learn quickly while continuing to balance appropriate amounts of structure and autonomy. <b>Online portfolio required to apply.</b></div><div><br></div><div>This position is remote (U.S.) and reports to the Chief Product Officer. This is a rare opportunity to get in on the ground floor (~45 person team) working directly with executives in a fast-paced and well-capitalized startup (Series A).</div><div>Cash compensation includes base + bonus and is based on a variety of factors including prior experience, geographic location, stock option grant and other factors, and may fall outside of the stated range for certain candidates. In addition to&nbsp; competitive cash compensation, Backflip employees receive equity stock options, paid health care, a 401K + company match, among other benefits.</div><div><br></div><h3>Responsibilities</h3><li>Gain a deep understanding of our customers, their user journeys, their pain points and opportunities where we can help their business thrive. Identify user pain points and proactively design innovative solutions to enhance customer satisfaction and engagement.</li><li>Determine solutions along with the product and engineering team that meet critical customer needs to resolve these issues and take advantage of the opportunities.</li><li>Ensure that our product experiences appropriately balance best-in-class user experiences with Backflip's overall business goals.</li><li>Lead and execute on the design of new features from conceptualization to execution, integrating both UX and UI best practices to create seamless app experiences.</li><li>Work closely with Product Management, Engineering, Marketing, Sales and Loan Operations teams to align designs with organizational goals and ensure technical and operational process feasibility.</li><li>Perform frequent user research and utilize both qualitative and quantitative data to inform design decisions, ensuring best-in-class user experiences and alignment to overall business objectives</li><li>Refine, adapt and iterate on user interfaces based on user feedback and emerging trends in app design.</li><li>Help to develop and maintain a cohesive visual and interaction design system and standard across all platforms, promoting consistency and quality in design.</li><li>Work across Native Mobile, Mobile Web and Desktop, with the ability to adapt quickly to each platform's needs</li><li>Help define the user experience of features from initial ideas to production-ready designs</li><li>Take a project from end-to-end, delivering your solutions intangible formats such as sketches, prototypes, wireframes, and production-ready UI Designs</li><li>Perform frequent user research and use both qualitative and quantitative data to make informed decisions</li><li>Requires occasional travel (team offsites, etc.)</li><div><i>Understand this role is intended to evolve as the company grows, and this person should be willing to work on various tasks that fall outside of the above listed responsibilities.</i></div><h3>Qualifications</h3><li>3+ years of experience as a UX/UI or Product Designer</li><li>Highly proficient in Figma and familiar with other design tools such as Adobe Creative Suite.</li><li>Experience designing across multiple platforms (web, mobile, apps) with a clear understanding of the nuances involved in each.</li><li>Portfolio demonstrating design process (research, ideation, design process, execution)</li><li>Established experience designing and validating end-to-end user workflows and high fidelity visuals</li><li>Experience in user research, performing competitive analyses, and staying aware of best UX practices and trends</li><li>Experience working at a startup with a proven ability and desire to work in a fast-paced, largely autonomous environment</li><div><b>Bonus Experience</b></div><li>Prior experience with a FinTech company</li><li>Experience designing both B2C and B2B applications&nbsp;</li><li>Experience designing a gaming, e-commerce and/or social experience</li><div><br></div><h3>This person will also champion Backflip’s culture & Core Values:</h3><li>Raise the standard of what is possible</li><li>Embrace being the novice to become the master</li><li>Work only with those who want the best for us</li><li>Communicate quickly, naturally and with radical candor</li><li>Today, nay Now!</li><li>Test new things to invent and challenge the status quo</li><div><br></div><h3>People that thrive at Backflip have…</h3><li>A desire to learn and grow with the company; propensity to “think like an owner”</li><li>An execution-oriented “one-team” mindset with motivation and scrappiness to achieve objectives</li><li>The ability to multi-task with exceptional time management, prioritization and attention to detail</li><li>An entrepreneurial mindset and a passion for technology and innovation</li><li>A bias for action; inclined to deploy rapid testing and iteration cycles</li><li>The ability to work effectively in a small, relatively unstructured office environment (we work remotely)</li><li>Excellent verbal and written communication skills with appropriate urgency to various audiences</li><li>Strong self-motivation, are coachable and highly collaborative; take ownership of tasks and pride in work product</li><li>High integrity; are dependable, accountable, humble and respectful</li><div><i>All Backflip positions are Remote. Like the people we serve, we believe being free to create wherever you’re most inspired is one of life’s greatest joys. It’s better for individuals, for community, and for fostering great work to emerge. With our work-from-anywhere approach, Backflip brings together a diverse team of individuals, with passions for innovation, art, coding, AI, data, finance, film, real estate, the environment, learning and teaching. Together, we're moving fast.</i></div><div><br></div><div><i>Backflip is an equal opportunity employer. We know that building a world-class organization is not possible without an intentional focus on recruiting, empowering, promoting and rewarding the best and brightest people of all backgrounds. Backflip focuses on hiring individuals that align with its Core Values (listed above), and consistently display a high ethical standard, both personally and professionally.</i></div><div><br></div><div><i>This role is not eligible for visa sponsorship</i></div>","tags":"[\"Finance\",\"management\",\"engineering\",\"B2C\",\"B2B\"]","pubDate":"2024-05-20 18:19:45.187","link":"https://jobs.lever.co/backflip/a78878fb-5f6d-4ad8-aef2-eed4b91875df","savedDate":"2024-06-14 14:19:00.282","slug":"product-designer-backflip-8408"},{"id":9981359262,"title":"Customer Success Graduate Trainee ","company":"Xapo Bank","image":"https://s3-recruiting.cdn.greenhouse.io/external_greenhouse_job_boards/logos/400/530/000/resized/greyBackground.jpg?1692112526","description":"&lt;div class=&quot;content-intro&quot;&gt;&lt;p style=&quot;text-align: left;&quot;&gt;&lt;span style=&quot;font-weight: 900;&quot;&gt;Work from anywhere, impact everywhere&amp;nbsp;&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;Diversity is at the heart of who we are at Xapo Bank. We’re a fully distributed team of over 140 Xapiens that work remotely from 40+ countries around the world.&amp;nbsp;&lt;/p&gt;\n&lt;p&gt;Our beginning: A world that enjoys economic freedom and wealth protection, no matter where you live or who is running your country. This is the dream that drove Wences Casares, our Founder and Chairman, to quietly transform the world of banking.&lt;/p&gt;\n&lt;p&gt;To achieve that, we search the world for the best people for the job. We work hard, think globally, and inspire each other to learn and grow. We are committed to changing the way things are done.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Risk is inherent in all of our business activities and managing risk well is the responsibility of every Xapien. Sound risk management enables us to serve our customers and deliver value for our shareholders, and helps make Xapo a great place to work.&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&amp;nbsp;&lt;/p&gt;\n&lt;p style=&quot;text-align: left;&quot;&gt;&lt;em&gt;&lt;span style=&quot;font-weight: 500;&quot;&gt;Although we are headquartered in Gibraltar, this is a full time, 100% remote position&amp;nbsp;&lt;br&gt;&lt;/span&gt;&lt;/em&gt;&lt;em&gt;&lt;span style=&quot;font-weight: 500;&quot;&gt;Work from anywhere!&lt;/span&gt;&lt;/em&gt;&lt;/p&gt;\n&lt;p style=&quot;text-align: left;&quot;&gt;&amp;nbsp;&lt;/p&gt;&lt;/div&gt;&lt;p&gt;&lt;strong&gt;Only candidates based in or near Gibraltar will be considered.&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Our Graduate Programme runs for a period of 12 months giving successful graduates the opportunity to become a full time Xapien once the programme has concluded. This role would therefore be a 12 month contract.&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;&lt;em&gt;Our Graduate Programme&lt;/em&gt;&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;We are searching for individuals at the start of their working life looking to propel their careers and make an impact in the Fintech, Banking, and Blockchain space. As part of our innovative business, you&#39;ll embark on a journey of professional growth, tackling real-world challenges, and shaping the future of Banking. From collaborating with top-tier professionals in this industry to leveraging cutting-edge technologies, this role promises a thrilling adventure filled with learning, creativity, and endless possibilities.&amp;nbsp;&lt;/p&gt;\n&lt;p&gt;We are committed to helping you unleash your potential and carve out a path to success, are you ready to take on this challenge?&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;&lt;em&gt;Position overview&lt;/em&gt;&lt;/strong&gt;&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;Graduate Trainee supporting the HQ Support Manager, who serves as the face of Xapo Bank at our Gibraltar Global Branch, the first and only Xapo Bank branch in the world. Based at our HQ in Gibraltar, the main responsibility of this role will be to assist the HQ Support Manager by performing the following related to;&lt;/li&gt;\n&lt;ul&gt;\n&lt;li&gt;Daily customer-facing banking operations&lt;/li&gt;\n&lt;li&gt;Xapo Bank team-onsite visits&lt;/li&gt;\n&lt;li&gt;Events&lt;/li&gt;\n&lt;li&gt;VIP visits&lt;/li&gt;\n&lt;li&gt;Facilities management.&lt;/li&gt;\n&lt;/ul&gt;\n&lt;li&gt;This role will report to the HQ Support Manager, support Xapo’s business development efforts with clients, and lead in providing exceptional client support that begins with the initial contact with them when they attend the HQ, and continues throughout the client relationship.&amp;nbsp;&lt;/li&gt;\n&lt;li&gt;This role will also assist the HQ Support Manager’s role as the facilities manager, ensuring the efficient and effective running of the Global Branch.&amp;nbsp;&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;&lt;strong&gt;&lt;em&gt;Responsibilities&lt;/em&gt;&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;&lt;em&gt;HQ Operations&lt;/em&gt;&lt;/strong&gt;&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;Liaising with Suppliers - Maintaining good working relationships for best service.&lt;/li&gt;\n&lt;li&gt;Maintaining canteen, bar, and wine cellar stock levels&amp;nbsp;&lt;/li&gt;\n&lt;li&gt;Maintaining stationery levels&lt;/li&gt;\n&lt;li&gt;Processing Supplier Invoices&amp;nbsp;&lt;/li&gt;\n&lt;li&gt;New vendor onboarding&amp;nbsp;&lt;/li&gt;\n&lt;li&gt;Invoice submission, follow up, and filing&amp;nbsp;&lt;/li&gt;\n&lt;li&gt;Requesting cleaning supplies from our 3rd party cleaning service provider&lt;/li&gt;\n&lt;li&gt;Monitoring the cleaner’s efficiency and effectiveness&amp;nbsp;&lt;/li&gt;\n&lt;li&gt;Liaising with Maintenance Team on any repairs required&lt;/li&gt;\n&lt;li&gt;Upgrades of household/office hardware items where needed&amp;nbsp;&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;&lt;strong&gt;&lt;em&gt;Onsites&lt;/em&gt;&lt;/strong&gt;&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;Manage the HQ Onsite Calendar&lt;/li&gt;\n&lt;li&gt;Confirm attendees with Team Lead&amp;nbsp;&lt;/li&gt;\n&lt;li&gt;Assist with Xapien’s Visa applications by providing copies of letters/evidence requested during travel visa processing.&lt;/li&gt;\n&lt;li&gt;Block-book rooms at Sunborn&lt;/li&gt;\n&lt;li&gt;Liaise with Team-Lead on the weeks agenda and required events (i.e. special stationary requirements; etc)&lt;/li&gt;\n&lt;li&gt;Book events (Team building, i.e. E-Bike tours, etc)&amp;nbsp;&lt;/li&gt;\n&lt;li&gt;Plan and book catering (lunch and dinner)&lt;/li&gt;\n&lt;li&gt;Send group email with:&lt;/li&gt;\n&lt;ul&gt;\n&lt;li&gt;Local information - weather, power points, currency etc.&amp;nbsp;&lt;/li&gt;\n&lt;li&gt;Link to Health &amp;amp; Safety/dietary requirements form&lt;/li&gt;\n&lt;/ul&gt;\n&lt;li&gt;Check stock levels (soft drinks, wine, beer, snacks, masks &amp;amp; basic toiletries) and buy/order where necessary.&lt;/li&gt;\n&lt;li&gt;Welcome-wagon for Xapiens&amp;nbsp;&lt;/li&gt;\n&lt;li&gt;Attend post-work events&lt;/li&gt;\n&lt;li&gt;Events&lt;/li&gt;\n&lt;li&gt;Assist the HQ Support Manager in;&amp;nbsp;&lt;/li&gt;\n&lt;/ul&gt;\n&lt;ul&gt;\n&lt;li&gt;\n&lt;ul&gt;\n&lt;li&gt;planning,&amp;nbsp;&lt;/li&gt;\n&lt;li&gt;organising, and&amp;nbsp;&lt;/li&gt;\n&lt;li&gt;delivering events&lt;/li&gt;\n&lt;/ul&gt;\n&lt;/li&gt;\n&lt;/ul&gt;\n&lt;ul&gt;\n&lt;li&gt;VIP visits&lt;/li&gt;\n&lt;ul&gt;\n&lt;li&gt;Assist the HQ Support Manager in;&amp;nbsp;&lt;/li&gt;\n&lt;ul&gt;\n&lt;li&gt;planning,&amp;nbsp;&lt;/li&gt;\n&lt;li&gt;organising, and&amp;nbsp;&lt;/li&gt;\n&lt;li&gt;Entertaining VIP visits&lt;/li&gt;\n&lt;/ul&gt;\n&lt;/ul&gt;\n&lt;li&gt;Ad Hoc Task&amp;nbsp;&lt;/li&gt;\n&lt;ul&gt;\n&lt;li&gt;Assist the HQ Support Manager with any unplanned tasks arising from normal day-to-day operations.&amp;nbsp;&lt;/li&gt;\n&lt;/ul&gt;\n&lt;/ul&gt;\n&lt;p&gt;&lt;strong&gt;&lt;em&gt;Skills needed&lt;/em&gt;&lt;/strong&gt;&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;Exceptional communication skills, both verbal and written&lt;/li&gt;\n&lt;li&gt;Exceptional interpersonal skills and networking ability&lt;/li&gt;\n&lt;li&gt;Demonstrate a strong command for both English and Spanish languages&lt;/li&gt;\n&lt;li&gt;Ability to translate complex/technical issues into easy to understand language for clients&lt;/li&gt;\n&lt;li&gt;Strong attention to detail and analytical skills&lt;/li&gt;\n&lt;li&gt;Empathy and a passion for delivering excellent service to clients&lt;/li&gt;\n&lt;li&gt;Driven, self-motivated, collaborative and highly flexible team player approach&lt;/li&gt;\n&lt;li&gt;Self-learner, and an avid problem-solver&lt;/li&gt;\n&lt;li&gt;Knowledge of Bitcoin and Fiat currency payment rails&lt;/li&gt;\n&lt;li&gt;Well versed in local and regional knowledge&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;&lt;strong&gt;&lt;em&gt;Other requirements&lt;/em&gt;&lt;/strong&gt;&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;Alignment with Our Values and the Xapo Values-Driven Leadership principles.&lt;/li&gt;\n&lt;li&gt;Reside in (or near) Gibraltar as this role would require you to work in the branch.&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;&amp;nbsp;&lt;/p&gt;&lt;div class=&quot;content-conclusion&quot;&gt;&lt;p&gt;&lt;span style=&quot;font-size: 12pt;&quot;&gt;&lt;strong&gt;Why work for Xapo?&lt;/strong&gt;&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span style=&quot;font-weight: 500; font-size: 10pt;&quot;&gt;IMPACT GLOBALLY, WORK REMOTELY.&lt;/span&gt;&lt;/p&gt;\n&lt;ul&gt;\n&lt;li style=&quot;font-weight: 500;&quot;&gt;&lt;strong&gt;Shape the Future:&lt;/strong&gt;&lt;span style=&quot;font-weight: 500;&quot;&gt; Improve lives through cutting-edge technology, work 100% remotely from anywhere in the world.&lt;/span&gt;&lt;/li&gt;\n&lt;li style=&quot;font-weight: 500;&quot;&gt;&lt;strong&gt;Great work-life balance:&lt;/strong&gt;&lt;span style=&quot;font-weight: 500;&quot;&gt; &lt;/span&gt;&lt;span style=&quot;font-weight: 500;&quot;&gt;Build amazing things with a balance of autonomy and collaborative teamwork. Set your own work schedule and make use of a flexible PTO plan when you need to recharge.&lt;/span&gt;&lt;span style=&quot;font-weight: 500;&quot;&gt;&amp;nbsp;&lt;/span&gt;&lt;/li&gt;\n&lt;li style=&quot;font-weight: 500;&quot;&gt;&lt;strong&gt;Expect Excellence:&lt;/strong&gt;&lt;span style=&quot;font-weight: 500;&quot;&gt; Collaborate, learn, and grow with a high-performance team. Learn&lt;/span&gt;&lt;span style=&quot;font-weight: 500;&quot;&gt; how you learn best - from books to conferences, you’ll get a yearly budget for your individual learning and development goals.&lt;/span&gt;&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;&lt;strong&gt;At Xapo, we prioritize consumer protection and adhere to regulatory requirements by ensuring that all Xapiens are accountable for upholding principles of fair treatment, transparency, and ethical conduct in their interactions with customers and stakeholders.&lt;/strong&gt;&lt;/p&gt;&lt;/div&gt;","tags":"[\"management\"]","pubDate":"2024-05-16 09:20:00.000","link":"https://boards.greenhouse.io/xapo61/jobs/5977098003","savedDate":"2024-06-14 14:19:00.285","slug":"customer-success-graduate-trainee-xapo-bank-1107"},{"id":9480773809,"title":"Senior Software Engineer - FCP (Remote - Work from Anywhere)","company":"Xapo Bank","image":"https://s3-recruiting.cdn.greenhouse.io/external_greenhouse_job_boards/logos/400/530/000/resized/greyBackground.jpg?1692112526","description":"&lt;div class=&quot;content-intro&quot;&gt;&lt;p style=&quot;text-align: left;&quot;&gt;&lt;span style=&quot;font-weight: 900;&quot;&gt;Work from anywhere, impact everywhere&amp;nbsp;&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;Diversity is at the heart of who we are at Xapo Bank. We’re a fully distributed team of over 140 Xapiens that work remotely from 40+ countries around the world.&amp;nbsp;&lt;/p&gt;\n&lt;p&gt;Our beginning: A world that enjoys economic freedom and wealth protection, no matter where you live or who is running your country. This is the dream that drove Wences Casares, our Founder and Chairman, to quietly transform the world of banking.&lt;/p&gt;\n&lt;p&gt;To achieve that, we search the world for the best people for the job. We work hard, think globally, and inspire each other to learn and grow. We are committed to changing the way things are done.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Risk is inherent in all of our business activities and managing risk well is the responsibility of every Xapien. Sound risk management enables us to serve our customers and deliver value for our shareholders, and helps make Xapo a great place to work.&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&amp;nbsp;&lt;/p&gt;\n&lt;p style=&quot;text-align: left;&quot;&gt;&lt;em&gt;&lt;span style=&quot;font-weight: 500;&quot;&gt;Although we are headquartered in Gibraltar, this is a full time, 100% remote position&amp;nbsp;&lt;br&gt;&lt;/span&gt;&lt;/em&gt;&lt;em&gt;&lt;span style=&quot;font-weight: 500;&quot;&gt;Work from anywhere!&lt;/span&gt;&lt;/em&gt;&lt;/p&gt;\n&lt;p style=&quot;text-align: left;&quot;&gt;&amp;nbsp;&lt;/p&gt;&lt;/div&gt;&lt;p&gt;&lt;strong&gt;Position Overview:&lt;/strong&gt;&lt;br&gt;We’re looking for a Senior Software Engineer to join our engineering function. At Xapo, we are&amp;nbsp;building truly cross-functional teams with full ownership of design, architecture, building, testing,&amp;nbsp;delivery, data, and operations.&lt;br&gt;You will collaborate closely with fellow team members from the product, apps, design, and QA&amp;nbsp;communities of practice. You will be part of the product team (we call them SATs, the Stream&amp;nbsp;Aligned Teams, as in the Team Topologies) in charge of the &lt;em&gt;Financial Crime Prevention&lt;/em&gt; products.&lt;br&gt;As a Senior Software Engineer, you will develop a high-impact service, provide guidance and coaching around technical good practices, and play an active, critical role in the Development Community of practice. You will shape architectural and technical patterns used in the company to solve the problems for operational teams, improve UX, and cause a WOW effect in the eyes of our Members.&amp;nbsp;With that in mind, you will have an immense impact on how the future of finance looks like.&lt;/p&gt;\n&lt;p&gt;Our main tech stack includes:&lt;br&gt;- AWS for all of our Infrastructure&lt;br&gt;- Docker&lt;br&gt;- Python (Django, Flask)&lt;br&gt;- MySQL&lt;br&gt;- MongoDB&lt;br&gt;- Redis&lt;br&gt;We use also:&lt;br&gt;- PostgreSQL&lt;br&gt;- Node.js&lt;br&gt;- Java&lt;br&gt;- BigQuery&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Responsibilities:&lt;/strong&gt;&lt;br&gt;● Support, coach, and develop team members into top-performing engineers.&lt;br&gt;● Working closely in cross-functional teams where everyone is responsible for the outcome.&lt;br&gt;● Build a great place to work for talented and motivated people&lt;br&gt;● Designing, developing, and deploying backend services focusing on high availability, fault&amp;nbsp;tolerance, low latency, and security.&lt;br&gt;● Take full end-to-end responsibility for the services your team owns, from development to&amp;nbsp;production, operations, and data.&lt;br&gt;● Develop innovative solutions with Bitcoin at its core.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Skills needed:&lt;/strong&gt;&lt;br&gt;● Significant software engineering experience in one or more general-purpose programming&amp;nbsp;languages (we use Python and Node.js)&lt;br&gt;● Excellent teamwork and communication skills, comfortable preparing high-quality&amp;nbsp;documentation and designs to aid understanding and knowledge sharing.&lt;br&gt;● Understanding the microservices architecture, container-based 12-factor apps, and&amp;nbsp;cloud-native patterns around fault tolerance.&lt;br&gt;● Track record of using Event Storming and Domain Driven Design, delivering highly scalable&amp;nbsp;asynchronous software.&lt;br&gt;● Experience building contract-first services and adopting patterns and frameworks to enable&amp;nbsp;appropriate automated testing at the unit, contract, service, and end-to-end levels.&lt;br&gt;● Experience building services that can be deployed on demand, quickly, and with quality.&lt;br&gt;● Excellent understanding of CI/CD patterns and good practice.&lt;br&gt;● Understand the role of high-quality observability in building highly scalable and performant&amp;nbsp;software.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;&lt;em&gt;Other requirements&lt;/em&gt;&lt;/strong&gt;&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;A dedicated workspace.&lt;/li&gt;\n&lt;li&gt;A reliable internet connection with the fastest speed possible in your area.&lt;/li&gt;\n&lt;li&gt;Devices and other essential equipment that meet minimal technical specifications.&lt;/li&gt;\n&lt;li&gt;Alignment with Our Values and the Xapo Values-Driven Leadership principles.&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;&lt;br&gt;&lt;br&gt;&lt;/p&gt;&lt;div class=&quot;content-conclusion&quot;&gt;&lt;p&gt;&lt;span style=&quot;font-size: 12pt;&quot;&gt;&lt;strong&gt;Why work for Xapo?&lt;/strong&gt;&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span style=&quot;font-weight: 500; font-size: 10pt;&quot;&gt;IMPACT GLOBALLY, WORK REMOTELY.&lt;/span&gt;&lt;/p&gt;\n&lt;ul&gt;\n&lt;li style=&quot;font-weight: 500;&quot;&gt;&lt;strong&gt;Shape the Future:&lt;/strong&gt;&lt;span style=&quot;font-weight: 500;&quot;&gt; Improve lives through cutting-edge technology, work 100% remotely from anywhere in the world.&lt;/span&gt;&lt;/li&gt;\n&lt;li style=&quot;font-weight: 500;&quot;&gt;&lt;strong&gt;Great work-life balance:&lt;/strong&gt;&lt;span style=&quot;font-weight: 500;&quot;&gt; &lt;/span&gt;&lt;span style=&quot;font-weight: 500;&quot;&gt;Build amazing things with a balance of autonomy and collaborative teamwork. Set your own work schedule and make use of a flexible PTO plan when you need to recharge.&lt;/span&gt;&lt;span style=&quot;font-weight: 500;&quot;&gt;&amp;nbsp;&lt;/span&gt;&lt;/li&gt;\n&lt;li style=&quot;font-weight: 500;&quot;&gt;&lt;strong&gt;Expect Excellence:&lt;/strong&gt;&lt;span style=&quot;font-weight: 500;&quot;&gt; Collaborate, learn, and grow with a high-performance team. Learn&lt;/span&gt;&lt;span style=&quot;font-weight: 500;&quot;&gt; how you learn best - from books to conferences, you’ll get a yearly budget for your individual learning and development goals.&lt;/span&gt;&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;&lt;strong&gt;At Xapo, we prioritize consumer protection and adhere to regulatory requirements by ensuring that all Xapiens are accountable for upholding principles of fair treatment, transparency, and ethical conduct in their interactions with customers and stakeholders.&lt;/strong&gt;&lt;/p&gt;&lt;/div&gt;","tags":"[\"postgres\",\"Finance\",\"management\",\"engineering\",\"mysql\",\"mongo\",\"aws\"]","pubDate":"2024-05-14 13:35:03.000","link":"https://boards.greenhouse.io/xapo61/jobs/5984246003","savedDate":"2024-06-14 14:19:00.287","slug":"senior-software-engineer-fcp-remote-work-from-anywhere-xapo-bank-1302"}]