[{"id":5506607944,"title":"Security Lead","company":"Scroll","image":"https://avatars.githubusercontent.com/u/87750292?s=200&v=4","description":"&lt;div class=&quot;content-intro&quot;&gt;&lt;p&gt;Scroll is a Layer 2 scaling solution for Ethereum, specifically focusing on zkRollups. Key aspects of Scroll are zkRollup technology, Scalability, Efficiency, Security, and Developer-friendly. Overall, Scroll plays a crucial role in addressing Ethereum&#39;s scalability challenges and facilitating the growth of decentralized finance (DeFi) and other blockchain-based applications by providing a scalable and efficient Layer 2 solution.&amp;nbsp;&lt;/p&gt;&lt;/div&gt;&lt;div class=&quot;postings-description  section&quot;&gt;\n&lt;div class=&quot;rich-text vert-space-4&quot;&gt;\n&lt;div class=&quot;editor-ctn&quot;&gt;\n&lt;div class=&quot;rich-text-editor ql-container&quot;&gt;\n&lt;div id=&quot;ql-editor-1&quot; class=&quot;ql-editor&quot;&gt;\n&lt;div&gt;At Scroll, we operate on the bleeding edge of a fast-moving frontier of zk technology, research and innovation. The Application Security Engineer will be responsible for improving the zkEVM-based zkRollup security, ensuring that Scroll is one of the safest Layer 2’s for projects and users. The role is ideal for an individual who thrives in a start-up environment, a self-starter that is dynamic and comfortable to take on responsibilities and can work effectively within a remote setup.&lt;/div&gt;\n&lt;div&gt;&amp;nbsp;&lt;/div&gt;\n&lt;div&gt;&lt;strong&gt;About Scroll…&lt;/strong&gt;&lt;/div&gt;\n&lt;div&gt;Scroll is building an open source, bytecode level compatible zkEVM layer 2 solution for Ethereum. Our mission is to scale Ethereum while maintaining our values of credible neutrality, open-ness, and execution.&lt;/div&gt;\n&lt;/div&gt;\n&lt;/div&gt;\n&lt;/div&gt;\n&lt;/div&gt;\n&lt;/div&gt;\n&lt;div class=&quot;postings-description  section&quot;&gt;&amp;nbsp;&lt;/div&gt;\n&lt;p&gt;&lt;strong&gt;Responsibilities:&amp;nbsp;&lt;/strong&gt;&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;Establish and maintain security best practices, policies, and procedures across the organization&lt;/li&gt;\n&lt;li&gt;Develop and implement the overall security strategy for Scroll&#39;s infrastructure, including the node operations, cloud instances, onchain activities, and associated systems&lt;/li&gt;\n&lt;li&gt;Oversee the bug bounty program, including final decision-making on bug severity and rewards&lt;/li&gt;\n&lt;li&gt;Lead security incident response and coordinate with relevant teams during critical situations&lt;/li&gt;\n&lt;li&gt;Lead security reviews of major protocol upgrades and new feature implementations, and coordinate the audit process with external security vendors and audit firms&lt;/li&gt;\n&lt;li&gt;Work closely with engineering team to ensure security is built into the development lifecycle from the ground up&lt;/li&gt;\n&lt;li&gt;Build and maintain relationships with external security researchers, auditors, and the broader security community&lt;/li&gt;\n&lt;li&gt;Represent Scroll&#39;s security initiatives in the broader blockchain community through speaking engagements and technical content&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;&lt;strong&gt;Requirements:&amp;nbsp;&lt;/strong&gt;&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;5+ years of experience in blockchain security, with experience in a leadership role&lt;/li&gt;\n&lt;li&gt;Knowledge of Solidity, EVM, Layer 2 scaling solutions, and blockchain&lt;/li&gt;\n&lt;li&gt;Experienced in security standards, tools, key management, and cloud security&lt;/li&gt;\n&lt;li&gt;Proven track record of building and leading security teams in a fast-paced environment&lt;/li&gt;\n&lt;li&gt;Proven ability to communicate complex security concepts to both technical and non-technical stakeholders&lt;/li&gt;\n&lt;li&gt;Excellent project management skills and ability to coordinate multiple security initiatives simultaneously&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;&lt;strong&gt;Nice to Haves:&lt;/strong&gt;&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;Contributions to major blockchain security tools or frameworks&lt;/li&gt;\n&lt;li&gt;Experience securing other Layer 2 solutions or ZK systems&lt;/li&gt;\n&lt;li&gt;Experience with zk proof systems and circuits (r1cs, plonkish, AIR, stark, etc.)&lt;/li&gt;\n&lt;li&gt;Track record of publishing security research or contributing to blockchain security standards&lt;/li&gt;\n&lt;li&gt;You have successfully participated in a bug bounty program, either as a manager or reporter.&lt;/li&gt;\n&lt;li&gt;Previous experience working in the crypto or blockchain space, with a focus on protocol security.&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;&lt;strong&gt;About You:&lt;/strong&gt;&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;You are a self-starter and ability to take ownership, well organised, self-disciplined and effective when working autonomously on tasks and projects;&lt;/li&gt;\n&lt;li&gt;You are responsive, collaborative and committed person with a high work ethic;&lt;/li&gt;\n&lt;li&gt;You are a high class communicator who can articulate their views succinctly on calls or asynchronously in globally distributed, remote teams;&lt;/li&gt;\n&lt;li&gt;You relish working in an agile start-up environment;&lt;/li&gt;\n&lt;li&gt;You are a great listener who understands when to listen first and engages well with colleagues;&lt;/li&gt;\n&lt;li&gt;You are a resilient, driven individual who is willing and able to continually develop and iterate to succeed;&lt;/li&gt;\n&lt;/ul&gt;&lt;div class=&quot;content-conclusion&quot;&gt;&lt;h3&gt;&lt;strong&gt;About You&lt;/strong&gt;&lt;/h3&gt;\n&lt;ul&gt;\n&lt;li&gt;You are a self-starter and ability to take ownership, well organised, self-disciplined and effective when working autonomously on tasks and projects;&lt;/li&gt;\n&lt;li&gt;You are responsive, collaborative and committed person with a high work ethic;&lt;/li&gt;\n&lt;li&gt;You are a high class communicator who can articulate their views succinctly on calls or asynchronously in globally distributed, remote teams;&lt;/li&gt;\n&lt;li&gt;You relish working in an agile start-up environment;&lt;/li&gt;\n&lt;li&gt;You are a great listener who understands when to listen first and engages well with colleagues;&lt;/li&gt;\n&lt;li&gt;You are a resilient, driven individual who is willing and able to continually develop and iterate to succeed;&lt;/li&gt;\n&lt;/ul&gt;\n&lt;h3&gt;&lt;strong&gt;What We Offer&lt;/strong&gt;&lt;/h3&gt;\n&lt;ul&gt;\n&lt;li&gt;A mission-led, collaborative culture&lt;/li&gt;\n&lt;li&gt;Opportunity to work with cutting edge technology and like-minded people who are contributing to the progression of Ethereum&lt;/li&gt;\n&lt;li&gt;Competitive salary package / generous paid time off / annual growth budget&lt;/li&gt;\n&lt;li&gt;100% remote from any location with flexible hours&lt;/li&gt;\n&lt;li&gt;Home office set up / co-working membership allowance&lt;/li&gt;\n&lt;li&gt;Private healthcare in selected countries&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;&lt;em&gt;Scroll is proud to be an equal opportunity workplace. We are committed to equal employment opportunities regardless of race, color, ancestry, religion, sex, national origin, sexual orientation, age, citizenship, marital status, disability, gender identity, or Veteran status. If you have a disability or special need, please let us know and we&#39;ll do our best to accommodate.&lt;/em&gt;&lt;/p&gt;\n&lt;p&gt;&amp;nbsp;&lt;/p&gt;&lt;/div&gt;","tags":"[\"finance\",\"management\",\"engineering\"]","pubDate":"2025-01-20T03:07:23.000Z","link":"https://job-boards.eu.greenhouse.io/scrollio/jobs/4521884101","slug":"security-lead-scroll-7626"}]