[{"id":6850949360,"title":"Community Engagement Manager (Remote - Work from Anywhere)","company":"Xapo Bank","image":"https://avatars.githubusercontent.com/u/6930305?s=200&v=4","description":"&lt;div class=&quot;content-intro&quot;&gt;&lt;p style=&quot;text-align: left;&quot;&gt;&lt;span style=&quot;font-weight: 900;&quot;&gt;Work from anywhere, impact everywhere&amp;nbsp;&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;Diversity is at the heart of who we are at Xapo Bank. We’re a fully distributed team of over 140 Xapiens that work remotely from 40+ countries around the world.&amp;nbsp;&lt;/p&gt;\n&lt;p&gt;Our beginning: A world that enjoys economic freedom and wealth protection, no matter where you live or who is running your country. This is the dream that drove Wences Casares, our Founder and Chairman, to quietly transform the world of banking.&lt;/p&gt;\n&lt;p&gt;To achieve that, we search the world for the best people for the job. We work hard, think globally, and inspire each other to learn and grow. We are committed to changing the way things are done.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Risk is inherent in all of our business activities and managing risk well is the responsibility of every Xapien. Sound risk management enables us to serve our customers and deliver value for our shareholders, and helps make Xapo a great place to work.&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&amp;nbsp;&lt;/p&gt;\n&lt;p style=&quot;text-align: left;&quot;&gt;&lt;em&gt;&lt;span style=&quot;font-weight: 500;&quot;&gt;Although we are headquartered in Gibraltar, this is a full time, 100% remote position&amp;nbsp;&lt;br&gt;&lt;/span&gt;&lt;/em&gt;&lt;em&gt;&lt;span style=&quot;font-weight: 500;&quot;&gt;Work from anywhere!&lt;/span&gt;&lt;/em&gt;&lt;/p&gt;\n&lt;p style=&quot;text-align: left;&quot;&gt;&amp;nbsp;&lt;/p&gt;&lt;/div&gt;&lt;p&gt;&lt;strong&gt;&lt;em&gt;Responsibilities&lt;/em&gt;&lt;/strong&gt;&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;Develop and execute a comprehensive community engagement strategy across platforms such as Reddit, X, Discord, Telegram, etc.&lt;/li&gt;\n&lt;li&gt;Nurture meaningful conversations, address questions, and provide exceptional support to foster a positive community experience.&lt;/li&gt;\n&lt;li&gt;Organize engaging online and offline community events (e.g., workshops, webinars, hackathons, meetups) to drive community growth and excitement.&lt;/li&gt;\n&lt;li&gt;Create and moderate online forums, social media groups, and other community platforms to facilitate discussion and engagement.&lt;/li&gt;\n&lt;li&gt;Identify, onboard, and nurture relationships with community leaders and influencers in the Bitcoin and fintech space.&lt;/li&gt;\n&lt;li&gt;Collaborate with influencers, advocates, and key opinion leaders (KOLs) to amplify community reach and engagement.&lt;/li&gt;\n&lt;li&gt;Track and analyze community engagement metrics, using insights to refine strategies and identify growth opportunities.&lt;/li&gt;\n&lt;li&gt;Monitor community sentiment and stay updated on emerging trends in community management and online engagement strategies.&lt;/li&gt;\n&lt;li&gt;Encourage user-generated content and foster a sense of belonging within the community.&lt;/li&gt;\n&lt;li&gt;Educate members about Xapo’s products, fintech trends, and Bitcoin innovations, to drive advocacy and brand loyalty.&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;&lt;strong&gt;&lt;em&gt;Skills needed&lt;/em&gt;&lt;/strong&gt;&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;Crypto native with proven experience in community management, social media management, or a similar role, within fintech, cryptocurrency, or technology industries.&lt;/li&gt;\n&lt;li&gt;Deep understanding of fintech, Bitcoin, crypto and blockchain ecosystems.&lt;/li&gt;\n&lt;li&gt;Fluency in major community platforms such as Discord, Telegram, Reddit, and social media channels like X and LinkedIn.&lt;/li&gt;\n&lt;li&gt;Proven ability to build and maintain relationships with community members, influencers, and key opinion leaders (KOLs).&lt;/li&gt;\n&lt;li&gt;Experience organizing online and offline events to boost community engagement.&lt;/li&gt;\n&lt;li&gt;Strong collaboration skills to work effectively with cross-functional team&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;&lt;strong&gt;&lt;em&gt;Other requirements&lt;/em&gt;&lt;/strong&gt;&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;A dedicated workspace.&lt;/li&gt;\n&lt;li&gt;A reliable internet connection with the fastest speed possible in your area.&lt;/li&gt;\n&lt;li&gt;Devices and other essential equipment that meet minimal technical specifications.&lt;/li&gt;\n&lt;li&gt;Alignment with Our Values and the Xapo Values-Driven Leadership principles.&lt;/li&gt;\n&lt;/ul&gt;&lt;div class=&quot;content-conclusion&quot;&gt;&lt;p&gt;&lt;span style=&quot;font-size: 12pt;&quot;&gt;&lt;strong&gt;Why work for Xapo?&lt;/strong&gt;&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span style=&quot;font-weight: 500; font-size: 10pt;&quot;&gt;IMPACT GLOBALLY, WORK REMOTELY.&lt;/span&gt;&lt;/p&gt;\n&lt;ul&gt;\n&lt;li style=&quot;font-weight: 500;&quot;&gt;&lt;strong&gt;Shape the Future:&lt;/strong&gt;&lt;span style=&quot;font-weight: 500;&quot;&gt; Improve lives through cutting-edge technology, work 100% remotely from anywhere in the world.&lt;/span&gt;&lt;/li&gt;\n&lt;li style=&quot;font-weight: 500;&quot;&gt;&lt;strong&gt;Great work-life balance:&lt;/strong&gt;&lt;span style=&quot;font-weight: 500;&quot;&gt; &lt;/span&gt;&lt;span style=&quot;font-weight: 500;&quot;&gt;Build amazing things with a balance of autonomy and collaborative teamwork. Set your own work schedule and make use of a flexible PTO plan when you need to recharge.&lt;/span&gt;&lt;span style=&quot;font-weight: 500;&quot;&gt;&amp;nbsp;&lt;/span&gt;&lt;/li&gt;\n&lt;li style=&quot;font-weight: 500;&quot;&gt;&lt;strong&gt;Expect Excellence:&lt;/strong&gt;&lt;span style=&quot;font-weight: 500;&quot;&gt; Collaborate, learn, and grow with a high-performance team. Learn&lt;/span&gt;&lt;span style=&quot;font-weight: 500;&quot;&gt; how you learn best - from books to conferences, you’ll get a yearly budget for your individual learning and development goals.&lt;/span&gt;&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;&lt;strong&gt;At Xapo, we prioritize consumer protection and adhere to regulatory requirements by ensuring that all Xapiens are accountable for upholding principles of fair treatment, transparency, and ethical conduct in their interactions with customers and stakeholders.&lt;/strong&gt;&lt;/p&gt;&lt;/div&gt;","tags":"[\"management\"]","pubDate":"2025-01-01T10:40:38.000Z","link":"https://job-boards.greenhouse.io/xapo61/jobs/6306347003","slug":"community-engagement-manager-remote-work-from-anywhere-xapo-bank-1063"},{"id":6234750677,"title":"Senior Product Designer","company":"Genie AI","image":"https://remotive.com/job/1960254/logo","description":"<ul style=\"\">\n<li style=\"\">\n<p dir=\"ltr\">Become an early adopter in the AI design space</p>\n</li>\n<li style=\"\">\n<p dir=\"ltr\">Have the autonomy to bring your role to life within a really interesting problem space: the intersection of Legaltech and AI</p>\n</li>\n<li style=\"\">\n<p dir=\"ltr\">Push the boundaries of innovation and creativity with the full support of the business</p>\n</li>\n</ul>\n<p> </p>\n<div class=\"h3\"><strong>Your purpose in our mission</strong></div>\n<p dir=\"ltr\">We’ve raised $17.8 million in Series A funding led by Google Ventures and joined by Khosla Ventures. They believe in our vision that the law should be accessible to everyone. We need your skills to multiply the number of user problems we’re able to research and apply design thinking to.</p>\n<p dir=\"ltr\"> </p>\n<div class=\"h3\"><strong>Your manager and team</strong></div>\n<p dir=\"ltr\">Our org structure is made up of pods with distinct areas of focus to keep us all working on the most impactful things for our customers all of the time. Some of our team members work across multiple pods. Our structure was conceived with impact, autonomy and velocity in mind and we'd love to share more with you throughout our interview process. You’ll be managed by Rosie - Lead Product Designer, and your teammate in this small and impactful Design team is Mayse - UX/UI Designer. They’re powered by data and feedback, and choose iteration over perfection.</p>\n<p dir=\"ltr\"> </p>\n<div class=\"h3\"><strong>This is what you’ll be doing</strong></div>\n<p dir=\"ltr\">As a Senior Product Designer at Genie AI you’ll get the chance to immerse yourself within the world of law, legal contracts and AI at a start-up that is genuinely design-lead. We’re big enough to disrupt the legaltech industry, but small enough that you can make a massive impact on the team. Some of your key day to day duties will include:</p>\n<ul style=\"\">\n<li style=\"\">\n<p dir=\"ltr\"><strong>User research:</strong> Speaking to lawyers, founders, business people in-depth to understand their world, their workflows and their needs</p>\n</li>\n<li style=\"\">\n<p dir=\"ltr\"><strong>User testing</strong>: Moderated, unmoderated, big, small - every piece of work needs a different type of testing</p>\n</li>\n<li style=\"\">\n<p dir=\"ltr\"><strong>AI R&amp;D:</strong> Work with our machine learning scientists to dream up, prototype and test our cutting-edge AI capabilities</p>\n</li>\n<li style=\"\">\n<p dir=\"ltr\"><strong>Product strategy:</strong> Find &amp; prioritise user problems, collaborating closely with our PMs and also working independently</p>\n</li>\n<li style=\"\">\n<p dir=\"ltr\"><strong>UI &amp; UX design:</strong> Using good design to instil trust in lawyers about using new technology</p>\n</li>\n<li style=\"\">\n<p dir=\"ltr\"><strong>Data analysis:</strong> Genie has a wealth of quantitative data in Mixpanel and Hotjar</p>\n</li>\n<li style=\"\">\n<p dir=\"ltr\"><strong>Prototyping:</strong> No two prototypes are the same - you will apply good intuition for the right level of fidelity to answer your research questions</p>\n</li>\n</ul>\n<div class=\"h3\"><br><strong>This is how we’ll set you up for success and the outcomes we expect from you</strong></div>\n<p dir=\"ltr\">Over your first 90 days you can expect us to help point you in the right direction to set you up for success. During the interview process we can talk you through a high level overview of your 90 day plan.</p>\n<div class=\"h5\">By the end of your first six months we expect you to be:</div>\n<ul style=\"\">\n<li style=\"\">\n<p dir=\"ltr\">Expertly managing your own design areas</p>\n</li>\n<li style=\"\">\n<p dir=\"ltr\">Contributing to company strategy</p>\n</li>\n<li style=\"\">\n<p dir=\"ltr\">Starting to see the impact of your design work</p>\n</li>\n</ul>\n<div class=\"h5\">We’ll continually develop and measure success on the below criteria:</div>\n<ul style=\"\">\n<li style=\"\">User-facing Metric:\n<ul style=\"\">\n<li style=\"\">\n<p dir=\"ltr\">Increase in Monthly Active Users: Choosing the right problems to solve and solving them in the right way will help increase our user base</p>\n</li>\n</ul>\n</li>\n<li style=\"\">Genie-facing Metrics:\n<ul style=\"\">\n<li style=\"\">\n<p dir=\"ltr\">Level of collaboration between Product Design and the rest of Genie</p>\n</li>\n<li style=\"\">\n<p dir=\"ltr\">Visibility of Product Design work to the rest of Genie</p>\n</li>\n</ul>\n</li>\n</ul>\n<p>We are a start up in an exceptionally dynamic stage of our growth. We are a customer and employee led organisation. What this means is that we adapt to our customers' needs, and the problems we’re solving today could be very different in six months, or even by the end of this recruitment process. We also listen to our team as we empower you to have full autonomy of your role - you're the expert. You should expect to work with us on how your role develops, grows and changes throughout your time at Genie.</p>\n<div class=\"h3\"><br><strong>It can be tough here because</strong></div>\n<ul style=\"\">\n<li style=\"\">\n<p dir=\"ltr\">We don’t structure your work for you. We give you the <em>what</em> and you come up with the how</p>\n</li>\n<li style=\"\">\n<p dir=\"ltr\">We don’t try to get things perfect the first time. We get things to good enough, and then we continuously iterate</p>\n</li>\n<li style=\"\">\n<p dir=\"ltr\">This is a generalist design role - we need you to be good at a lot of design areas rather than specialising in one</p>\n</li>\n</ul>\n<div class=\"h3\"><strong>But we think you’ll love</strong></div>\n<ul style=\"\">\n<li style=\"\">\n<p dir=\"ltr\">The autonomy and trust we give you to deliver your best work</p>\n</li>\n<li style=\"\">\n<p dir=\"ltr\">Learning from some of the brightest minds in the field of AI</p>\n</li>\n<li style=\"\">\n<p dir=\"ltr\">The exhilaration of a fast pace start up</p>\n</li>\n</ul>\n<div class=\"h3\"><strong>The skills you need to succeed in this role</strong></div>\n<p dir=\"ltr\">We’re looking for a generalist who is strong in the below areas:</p>\n<ul style=\"\">\n<li style=\"\">\n<p dir=\"ltr\">User research</p>\n</li>\n<li style=\"\">\n<p dir=\"ltr\">User testing</p>\n</li>\n<li style=\"\">\n<p dir=\"ltr\">Product strategy</p>\n</li>\n<li style=\"\">\n<p dir=\"ltr\">Prioritisation</p>\n</li>\n<li style=\"\">\n<p dir=\"ltr\">UI and UX design</p>\n</li>\n<li style=\"\">\n<p dir=\"ltr\">Data analysis (quantitative and qualitative)</p>\n</li>\n<li style=\"\">\n<p dir=\"ltr\">Prototyping</p>\n</li>\n<li style=\"\">\n<p dir=\"ltr\">Storytelling</p>\n</li>\n</ul>\n<p><em>(Don’t worry about ticking every single box on the list to be considered for this role.)</em></p>\n<p dir=\"ltr\"> </p>\n<div class=\"h3\"><strong>Unleash your magic: our interview process</strong></div>\n<ul style=\"\">\n<li style=\"\">\n<p dir=\"ltr\"><strong>Step 1: </strong>Meet our Talent Acquisition Specialist, Corina, to assess your motivations and baseline skills</p>\n</li>\n<li style=\"\">\n<p dir=\"ltr\"><strong>Step 2: </strong>Complete our take home task</p>\n</li>\n<li style=\"\">\n<p dir=\"ltr\"><strong>Step 3: </strong>Live technical task with Rosie, our Lead Product Designer, and Nitish, our Co-Founder and CTO</p>\n</li>\n<li style=\"\">\n<p dir=\"ltr\"><strong>Step 4: </strong>Culture interview with Mayse, our UX/UI Designer, and Alex, our Lead Frontend Engineer</p>\n</li>\n</ul>\n<p dir=\"ltr\">We can’t wait to meet you! Bring your authentic self, and get ready to explore our culture, team events, and big mission. We're excited to discover what makes you and us unique.</p>\n<p dir=\"ltr\"> </p>\n<div class=\"h3\"><strong>Our benefits</strong></div>\n<p dir=\"ltr\">Here’s just some of the benefits you can look forward to when you enter the Genie’s lamp:</p>\n<ul style=\"\">\n<li style=\"\">\n<p dir=\"ltr\"><strong>Generous Stock Options:</strong> We want all our genies to share in our success</p>\n</li>\n<li style=\"\">\n<p dir=\"ltr\"><strong>Private healthcare: </strong>To help keep you fit as a fiddle</p>\n</li>\n<li style=\"\">\n<p dir=\"ltr\"><strong>Fully Remote Working:</strong> Work from anywhere your heart desires</p>\n</li>\n<li style=\"\">\n<p dir=\"ltr\"><strong>Unlimited book budget</strong>: Dive into an unlimited budget for business, law, or technology books</p>\n</li>\n<li style=\"\">\n<p dir=\"ltr\"><strong>Home Office Setup:</strong> Equip your home office with the best – a top-of-the-range laptop, monitor, wireless keyboard, mouse, and a comfortable office chair. Your workspace will be as splendid as a royal palace</p>\n</li>\n<li style=\"\">\n<p dir=\"ltr\"><strong>Learning and Development Budget:</strong> Each Genie gets an individual £500 L&amp;D budget annually, plus five days off for any job specific learning adventures</p>\n</li>\n<li style=\"\">\n<p dir=\"ltr\"><strong>Unlimited Holiday:</strong> Take as much time off as you need to recharge your batteries</p>\n</li>\n<li style=\"\">\n<p dir=\"ltr\"><strong>Parental Leave:</strong> Both genie parents get enhanced leave to welcome their little genies into the world</p>\n</li>\n<li style=\"\">\n<p dir=\"ltr\"><strong>Free access to Genie:</strong> For you to create, negotiate and collaborate on legal documents in real time on one platform!</p>\n</li>\n</ul>\n<div class=\"h4\" dir=\"ltr\"> </div>\n<div class=\"h3\"><strong>About Genie AI</strong></div>\n<p dir=\"ltr\">Genie AI is a machine learning startup with a mission to enable everyone to draft quality legal documents. We're shaking up the legal world and flipping the business model on its head!</p>\n<p dir=\"ltr\">Think of what GitHub did with open source code, Instagram and TikTok with entertainment, Airbnb with hospitality, and Uber with travel – Genie AI is doing that with legal contracts. We're conjuring up a community-based AI law platform that'll change the game. Join us, and let’s make some legal magic together!</p>\n<ul style=\"\">\n<li style=\"\">\n<p dir=\"ltr\">100,000 companies use Genie AI today - we’ve been growing exponentially!</p>\n</li>\n<li style=\"\">\n<p dir=\"ltr\">We’re funded by the world’s top investors, with significant runway - and we’re growing the team</p>\n</li>\n<li style=\"\">\n<p dir=\"ltr\">We’ve collaborated with Oxford University and Imperial College London to co-author research papers on explainable AI</p>\n</li>\n<li style=\"\">\n<p dir=\"ltr\">According to Forbes, we're also rated one of the top 29 AI startups in the UK</p>\n</li>\n<li style=\"\">\n<p dir=\"ltr\">We're a Sunday Times Best Places to Work Award Winner 2024</p>\n</li>\n<li style=\"\">\n<p dir=\"ltr\">We’re backed by top legal pedigree, from Lord Neuberger to representing the UK on multiple Ministry of Justice trade missions</p>\n</li>\n<li style=\"\">\n<p dir=\"ltr\">Our customers save on average £15,000 on legal fees per year with Genie</p>\n</li>\n<li style=\"\">\n<p dir=\"ltr\">This isn’t just a SaaS product - we’re redefining the business model of law</p>\n</li>\n</ul>\n<p dir=\"ltr\"><strong>Ready to grant wishes and disrupt a £750bn industry? Click apply and join us in creating a world of digital wonders!</strong></p>\n<p dir=\"ltr\"><em>At Genie, we’re committed to creating a diverse environment. Whilst we’re on the cutting edge of innovation, it’s all about the people. We embrace differences and hire based on merit, giving equal consideration to all applications, regardless of gender, background and race.</em></p>\n<img src=\"https://remotive.com/job/track/1960254/blank.gif?source=public_api\" alt=\"\"/>","tags":"[\"product strategy\"]","pubDate":"2024-12-31T23:51:02.000Z","link":"https://remotive.com/remote-jobs/design/senior-product-designer-1960254","slug":"senior-product-designer-genie-ai-3179"},{"id":6143048325,"title":"Project Coordinator","company":"Coursedog","image":"https://remotive.com/job/1960117/logo","description":"<div><!--block-->The Project Coordinator prepares customers for the implementation of our product solutions which includes: planning, organizing, communicating, consulting and serving as a liaison with internal and external stakeholders. The Project Coordinator maintains records of the project status and outstanding obligations, and communicates the status and estimated timelines of a large portfolio of brands to Project Management Leadership. The Project Coordinator will apply best practice in project management and technology implementations and will promote and demonstrate a passion for process improvement and service excellence across all projects.<br><br></div><div><!--block-->A successful candidate will be efficiency driven, detail-oriented, technically proficient, have excellent written and verbal communication skills, and perform as a confident and collaborative team leader.<br><br></div><div><!--block-->You will be a key enabler for our long-term successful customer relationships. From contract signing to kickoff you pull the strings internally as well as externally, ensuring successful deliveries in terms of scope, time, efficiency, and quality. The position requires weekly contact and coordination with customers and establishing a good and professional ongoing relationship is key to our collective success.<br><br></div><div><!--block-->At Coursedog we prioritize ownership, and empower all team members to contribute and implement ideas to continually improve the company. We are looking for someone we can count on to:</div><br><br><div class=\"h3\">Key Responsibilities</div><ul style=\"\"><li style=\"\"><!--block-->Gather relevant customer details and requirements in preparation for the onboarding process</li><li style=\"\"><!--block-->Facilitate communication between customers, internal departments, and partners to develop clear and accurate project plans and deployment documentation for Project Managers</li><li style=\"\"><!--block-->Ensure customers receive optimum levels of service and maintain high levels of customer satisfaction</li><li style=\"\"><!--block-->Manage and escalate questions raised by customers before Project Manager handoff</li><li style=\"\"><!--block-->Work with Project Managers across multiple projects in several stages to organize efficient and successful customer deployments</li><li style=\"\"><!--block-->Report on customer progress and updates weekly and document accurate customer details in our CRM software</li><li style=\"\"><!--block-->Identify process improvement areas or gaps in existing documentation and share insights and improvement recommendations with the team</li><li style=\"\"><!--block-->Export, compile, and analyze data from multiple systems in preparation for leadership reports</li><li style=\"\"><!--block-->Work with project leads to evaluate and resolve onboarding obstacles</li><li style=\"\"><!--block-->Work cross-functionally with the larger organization (namely project and product managers, engineering, support, data engineers) to ensure customer issues are resolved or addressed and their success is assured</li><li style=\"\"><!--block-->Develop deep product knowledge and speak eloquently about the product</li><li style=\"\"><!--block-->Demonstrate competence in our existing implementation cycle</li><li style=\"\"><!--block-->Empathize with the problems facing our customers</li></ul><br><br><div class=\"h3\">Qualifications</div><ul style=\"\"><li style=\"\"><!--block-->1+ years of experience as an Account or Project Manager, or in a similar customer-facing role</li><li style=\"\"><!--block-->Experience with project management and working with your team and partners to meet deadlines</li><li style=\"\"><!--block-->Experience managing a larger number of low-touch customers</li><li style=\"\"><!--block-->Experience delivering technology-driven solutions within the business intelligence function, analytics software or higher education industry</li><li style=\"\"><!--block-->Experience building strong cross-functional relationships</li><li style=\"\"><!--block-->Unwavering integrity, attention to detail, and desire to exceed client expectations</li><li style=\"\"><!--block-->Outstanding oral and written communication skills, with the ability to present to stakeholders</li><li style=\"\"><!--block-->Superb time management skills with the ability to prioritize multiple competing priorities</li><li style=\"\"><!--block-->Experience working with remote and global resources</li><li style=\"\"><!--block-->Experience working with the following systems: Notion, Clarizen, Salesforce, Freshdesk, Google Team Drive</li></ul><br><br><div class=\"h3\">Benefits</div><div><!--block--><strong>Employee</strong> <strong>Benefits</strong></div><ul style=\"\"><li style=\"\"><!--block--><strong>Healthcare:</strong> We pay 99% of your medical, dental, and vision coverage and 75% of the premium for your spouse and/or dependents</li><li style=\"\"><!--block--><strong>Retirement: </strong>We offer a 401k plan on day one of your employment.</li><li style=\"\"><!--block--><strong>Paid Time Off:</strong> We value work-life balance and provide a high amount of autonomy. In service to this, our Paid Time Off policy has no annual limit.</li><li style=\"\"><!--block--><strong>Remote-First: </strong>We value flexible working hours over set hours, results over number of hours, and asynchronous communication focused on transparency over need-to-know access.</li><li style=\"\"><!--block--><strong>Equity: </strong>You’ll be contributing to the team's success, so you deserve to share in it. Every employee on our team gets a meaningful equity allocation.</li><li style=\"\"><!--block--><strong>Parental Leave</strong>: To help support new parents in the workplace, we offer up to 10 weeks of paid parental leave.</li></ul><div><!--block--><strong>Diversity, Equity, and Inclusion</strong><br><br>Coursedog is an equal opportunity employer committed to hiring a diverse workforce at all levels of the organization and creating an inclusive environment for all.<br><br>We value and encourage the contributions of our employees and strive to create an environment where everyone can reach their full potential and drive outstanding results. We draw strength from our range of interests, backgrounds, and perspectives<br><br>We strongly encourage applicants from all backgrounds to apply.<br><br>All qualified applicants will receive consideration for employment without regard to race, national origin, age, sex, religion, disability, sexual orientation, marital status, veteran status, gender identity or expression, or any other basis protected by local, state, or federal law.<br><br><strong>Accommodations</strong><br><br>Accommodations are available for applicants with disabilities in all phases of the application and employment process. On your application, you will be prompted to inform us If you need any accommodation during this process.</div><img src=\"https://remotive.com/job/track/1960117/blank.gif?source=public_api\" alt=\"\"/>","tags":"[\"time management\"]","pubDate":"2024-12-31T19:50:43.000Z","link":"https://remotive.com/remote-jobs/project-management/project-coordinator-1960117","slug":"project-coordinator-coursedog-222"}]