[{"id":6364576271,"title":"Security Risk Management Specialist","company":"Canonical","image":"https://pbs.twimg.com/profile_images/1673959375340290050/x7pNtXQ7_400x400.jpg","description":"\n      <p>In security risk management we’re looking to harness the power of industry best practice combined with driving new innovation on how we do security risk assessments and modelling. Our security risk management team is the primary owner of the strategy and practices of how we identify, track and reduce our security risk across everything we do.&nbsp;</p>\n<p>To support this we need to use industry best practices paired with emerging threat information to to promote risk identification, quantification, impact analysis, and modelling to ultimately drive decision making. In this role, you will help establish and execute a broad strategic vision for the security risk program at Canonical. You will not only work within the team but also cross-functionally with various teams across the organisation. The team contributes ideas and requirements for Canonical product security, improving the resilience and robustness of all Ubuntu customers and users subject to cyber attacks. Additionally, the team collaborates with our Organisational Learning and Development team to develop playbooks and facilitate security training across Canonical.</p>\n<p>The security risk management team’s mission is not only to secure Canonical, but also to contribute to the security of the wider open source ecosystem. They might share knowledge through public presentations and industry events, and share threat intelligence with the wider community or represent Canonical in sector-specific governance bodies.</p>\n<h2>What you will do in this role:</h2>\n<ul>\n<li>Define Canonical's security risk management&nbsp; standards and playbooks</li>\n<li>Analyse and improve Canonical's security risk practices</li>\n<li>Evaluate, select and implement new security requirements, tools and practices</li>\n<li>Grow the presence and thought leadership of Canonical security risk management practice</li>\n<li>Develop Canonical security risk learning and development materials</li>\n<li>Work with Security leadership to present information and influence change</li>\n<li>Participate in developing key risk indicators, provide inputs to the development of key control indicators, and key performance indicators for various programs</li>\n<li>Apply statistical models to risk frameworks (such as FAIR, sensitivity analysis, and others)</li>\n<li>Participate in risk management, decision-making, and collaborative discussions</li>\n<li>Lead quantified risk assessments and understand the value of qualitative data for improvements to quality and engineering processes</li>\n<li>Interpret internal or external cyber security risk analyses in business terms and recommend a responsible course of action</li>\n<li>Develop templates and materials to help with self-service risk management actions&nbsp;</li>\n<li>Monitor and identify opportunities to improve the effectiveness of risk management processes</li>\n<li>Launch campaigns to perform security assessments and help mitigate security risks across the company</li>\n<li>Build evaluation methods and performance indicators to measure efficiency of security functions and capabilities.</li>\n</ul>\n<h2>What we are looking for</h2>\n<ul>\n<li>An exceptional academic track record&nbsp;</li>\n<li>Undergraduate degree in Computer Science or STEM, or a compelling narrative about your alternative path</li>\n<li>Drive and a track record of going above-and-beyond expectations</li>\n<li>Deep personal motivation to be at the forefront of technology security</li>\n<li>Leadership and management ability</li>\n<li>Excellent business English writing and presentation skills</li>\n<li>Problem-solver with excellent communication skills, a deep technical understanding of security assessments and risk management</li>\n<li>Expertise in threat modelling and risk management frameworks</li>\n<li>Broad knowledge of how to operationalize the management of security risk</li>\n<li>Experience in Secure Development Lifecycle and Security by Design methodology</li>\n</ul>\n<h2>What we offer you</h2>\n<p>We consider geographical location, experience, and performance in shaping compensation worldwide. We revisit compensation annually (and more often for graduates and associates) to ensure we recognise outstanding performance. In addition to base pay, we offer a performance-driven annual bonus. We provide all team members with additional benefits, which reflect our values and ideals. We balance our programs to meet local needs and ensure fairness globally.</p>\n<ul>\n<li>Distributed work environment with twice-yearly team sprints in person</li>\n<li>Personal learning and development budget of USD 2,000 per year</li>\n<li>Annual compensation review</li>\n<li>Recognition rewards</li>\n<li>Annual holiday leave</li>\n<li>Maternity and paternity leave</li>\n<li>Employee Assistance Programme</li>\n<li>Opportunity to travel to new locations to meet colleagues</li>\n<li>Priority Pass, and travel upgrades for long haul company events</li>\n</ul>\n<h2>About Canonical</h2>\n<p>Canonical is a pioneering tech firm at the forefront of the global move to open source. As the company that publishes Ubuntu, one of the most important open source projects and the platform for AI, IoT and the cloud, we are changing the world on a daily basis. We recruit on a global basis and set a very high standard for people joining the company. We expect excellence - in order to succeed, we need to be the best at what we do. Canonical has been a remote-first company since its inception in 2004.​ Working here is a step into the future, and will challenge you to think differently, work smarter, learn new skills, and raise your game.</p>\n<h2>Canonical is an equal opportunity employer</h2>\n<p>We are proud to foster a workplace free from discrimination. Diversity of experience, perspectives, and background create a better work environment and better products.<a href=\"https://canonical.com/careers/diversity/identity\"> Whatever your identity, we will give your application fair consideration.</a></p>\n<p>#LI-remote</p>\n    ","tags":"[\"management\",\"engineering\",\"cyber security\"]","pubDate":"2024-02-21 17:59:14.561","link":"https://canonical.com/careers/5422575","savedDate":"2024-02-21 17:59:14.561","slug":"security-risk-management-specialist-canonical-7051"},{"id":4911292969,"title":"Engineering People Lead (Remote/Anywhere)","company":"Collabora","image":"https://pbs.twimg.com/profile_images/1545121577632763912/7FMnABb0_400x400.jpg","description":"<div class=\"section page-centered\" data-qa=\"job-description\"><div><span style=\"font-size: 10pt\">Are you someone who is focused on people and inquisitive by nature? Do you have a passion for managing and developing people while possessing an innate ability to ask questions and build rapport? Do you have experience in developing and running soft skills in house training? If so, we want to hear from you. </span></div><div><br></div><div><span style=\"font-size: 10pt\">This role at Collabora is to ensure our people receive a consistently high standard of people leadership, to foster communication and engagement, ensure well-being and best-in-class performance across the business while sustaining our unique culture.</span></div><div><br></div><div><span style=\"font-size: 10pt\">Engaging our people does not fall entirely on your shoulders and requires collaborating with the other key stakeholders in the organization (Project Managers, Account Managers, Technical Sponsor, Technical Leads, and People Operations). You will be in a unique position to understand and implement what it takes to ensure our people feel more supported than ever while working at Collabora.</span></div></div><div class=\"section page-centered\"><div><h3>The Role:</h3><ul class=\"posting-requirements plain-list\"><ul><li>Having meaningful and honest conversations with the people you will take care of at least monthly</li><li>Guide and support the team through regular conversations, tracking progress against objectives, managing performance issues and \tconducting appraisals</li><li>Create a trusted relationship, understand what your teammates value and to enable them in achieving this</li><li>Making difficult decisions as and when it is required</li><li>Ensure all company communication reaches out to each and every person with all the required context, whilst being objective in communicating all the facts and not your own assumptions</li><li>Strive to create a genuine connection and a sense of belonging within the company</li><li>Handle open and honest conversations to help each and every person understand their strengths and areas of improvements</li><li>Support the engineers personal aspirations and objectives in a way that is aligned to the objectives of the organization</li><li>Understanding the learning requirements and skills gaps within the teams and able to deliver the appropriate training </li><li>Understand the performance and development planning process and support your team throughout all stages</li></ul></ul></div></div><div class=\"section page-centered\"><div><h3>Responsibilities:</h3><ul class=\"posting-requirements plain-list\"><ul><li>Communicate (make sure everyone hears the same story, act as a thermometer for peoples' feelings), engage with people and nurture an inclusive and safe environment, pay attention to peoples' success, well-being and interactions through regular monthly conversations (team meetings, 1:1s)</li><li>Help/coach peoples' career development and professional aspirations through regular Personal Development Plan (PDP) discussions</li><li>Collect helpful and contextual performance feedback from various stakeholders and deliver in a timely, regular and consistent fashion</li><li>Run talent assessment and participate in the pay review cycle</li><li>Serve as an escalation point and report issues to the Engineering People Lead Manager and People Operations (POps) Team as necessary</li><li>Able to manage multiple stakeholders across varying levels of leadership\tand technical competencies</li><li>Have an understanding and drive to improve and iterate on the employee lifecycle and People Strategy within the business, improving and refining processes, culture and behaviour alongside the Engineering People Lead Manager and POps team</li><li>Manage the new joiners’ onboarding process alongside the POps team and participate in the optimisation of this process</li><li>Capture training needs of the engineering team and ensure all the right parties are informed to be able to follow-through on the required steps</li><li>Be able to develop and deliver training in a remote environment </li><li>Participate in the people assignment of projects whilst carefully balancing the projects’ needs with the peoples' technical development aspirations</li></ul></ul></div></div><div class=\"section page-centered\"><div><h3>Required Experience:</h3><ul class=\"posting-requirements plain-list\"><ul><li>Working in distributed, complex and multifaceted environments and thriving at communicating with others</li><li>Developing and delivering in house training </li><li>Proven experience in managing (1:1’s) and developing people (PDP’s) in remote teams across multiple time zones within an engineering environment</li><li>Collecting, filtering and delivering constructive timely feedback </li><li>Strong communication-centric skills with an equal emphasis on listening as well as sharing information</li><li>Coaching skills: taking an “Ask vs. Tell” approach</li><li>Able to work with salary, development and other people-related issues sensitively and professionally</li><li>Ability to lead, inspire and act in the best interest of both the individual and the company</li><li>Able to adapt your leadership style to different cultures</li><li>Experience working with technical minded people even if you are not technical yourself</li><li>A willingness to learn and adapt to new technologies and systems including the use of Linux and various web systems and open source applications</li></ul></ul></div></div><div class=\"section page-centered\" data-qa=\"closing-description\"><div>What are you?</div><div><br></div><div>You are passionate about your work, love to share, coach and embody some of our key values such as Openness, Transparency and Trust. You understand the value of genuine interpersonal communication, especially within a globally distributed work environment. You respect and cherish individuality and are able to engage with people accordingly.</div><div><br></div><div><br></div><div><br></div><div><br></div><div><br></div><div>#LI-Remote</div><div><br></div></div><div class=\"section page-centered last-section-apply\" data-qa=\"btn-apply-bottom\"><a class=\"postings-btn template-btn-submit hex-color\" data-qa=\"show-page-apply\" href=\"https://jobs.lever.co/collabora/85a8407f-0347-4247-b2c9-2bb657524bec/apply\">Apply for this job</a></div>","tags":"[\"engineering\",\"B2C\"]","pubDate":"2024-02-21 17:59:14.561","link":"https://jobs.lever.co/collabora/85a8407f-0347-4247-b2c9-2bb657524bec","savedDate":"2024-02-21 17:59:14.561","slug":"engineering-people-lead-remote-anywhere-collabora-5854"},{"id":8731022560,"title":"Observability Engineering Manager","company":"Canonical","image":"https://pbs.twimg.com/profile_images/1673959375340290050/x7pNtXQ7_400x400.jpg","description":"\n      <p>Engineering managers at Canonical are always coders who are able to review and lead both architecture and code. They should also of course be astute judges of character, and comfortable setting expectations and holding colleagues accountable to them.</p>\n<p>We are investing in the Grafana logging, monitoring and observability stack, to make it easier to deploy and operate on Kubernetes. This is part of a broader initiative to deliver the world's best suite of open source tools, where we provide deep integration and automation for best-of-breed open source offerings that cover metrics, logging, telemetry, alerting, tracing and profiling. Our goal is to make it very simple for distributed systems engineers and devops to build, debug and run complex distributed systems with very high levels of confidence and the ability to inspect, correlate and understand the internal dynamics of these solutions.</p>\n<p>Our implementation of Kubernetes operators for the Grafana LMA stack is opinionated, resilient, and scalable, providing deep insights out of the box. The user experience is polished and seamless for the end-users, and its administrators will enjoy smooth, lightweight Day 1 and Day 2 operations. We are excited to be improving the state of the art for open source LMA and also to be expanding the integrations which make it very easy to use with a wide range of open source solutions.</p>\n<p>The team has grown and we are now looking for a dedicated technical engineering manager. As part of the observability group, you will lead the development of the Logging, Monitoring and Alerting elements.</p>\n<p>This is an exciting opportunity for a software engineer passionate about open source software, Linux, Kubernetes, and Observability. Build a rewarding, meaningful career working with the best and brightest people in technology at Canonical, the growing international software company behind Ubuntu.</p>\n<p>As an Engineering Manager at Canonical, you must be technically strong, but your main responsibility is to run an effective team and develop the colleagues you manage. You will develop and review code as a leader, but know that the best way to improve the product is to ensure that the whole team is focused, productive and unblocked. You are expected to help them grow as engineers, do meaningful work, do it outstandingly well, find professional and personal satisfaction, and work well with colleagues and the community. You will also be expected to be a positive influence on culture, facilitate technical delivery, and regularly reflect with your team on strategy and execution. You will collaborate closely with other Engineering Managers, product managers, and architects, producing an engineering roadmap with ambitious and achievable goals.</p>\n<p>We expect Engineering Managers to be fluent in the programming language, architecture, and components that their team uses. Code reviews and architectural leadership are part of the job. The commitment to healthy engineering practices, documentation, quality and performance optimisation is as important, as is the requirement for fair and clear management, and the obligation to ensure a high-performing team.</p>\n<p><strong>Location: </strong><em>This role can be home based in the </em><em>EMEA or Americas regions.</em></p>\n<h2>What your day will look like</h2>\n<ul>\n<li>Manage a distributed team of engineers and its observability portfolio</li>\n<li>Organize and lead the team’s processes in order to help it achieve its objectives</li>\n<li>Conduct one-on-one meetings with team members</li>\n<li>Identify and measure team health indicators</li>\n<li>Interact with a vibrant community</li>\n<li>Review code produced by other engineers</li>\n<li>Attend conferences to represent Canonical and its Observability Stack</li>\n</ul>\n<h2>What we are looking for in you</h2>\n<ul>\n<li>An exceptional academic track record from both high school and university</li>\n<li>Drive and a track record of going above-and-beyond expectations</li>\n<li>A proven track record of professional experience of software delivery</li>\n<li>Professional python development experience, preferably with a track record in open source</li>\n<li>A proven understanding of the importance of observability and monitoring for keeping software running smoothly</li>\n<li>Experience designing and implementing observability solutions</li>\n<li>An exceptional academic track record from both high school and preferably university</li>\n<li>Willingness to travel up to 4 times a year for internal events</li>\n<li>Professional written and spoken English&nbsp;</li>\n<li>Experience with Linux (Debian or Ubuntu preferred)&nbsp;</li>\n<li>Excellent interpersonal skills, curiosity, flexibility, and accountability&nbsp;</li>\n<li>Passion, thoughtfulness, and self-motivation&nbsp;</li>\n<li>Excellent communication and presentation skills&nbsp;</li>\n<li>Result-oriented, with a personal drive to meet commitments&nbsp;</li>\n</ul>\n<h2>Additional skills that you might also bring</h2>\n<ul>\n<li>Engineering management experience</li>\n<li>A working knowledge of Go</li>\n<li>Open source contribution experience</li>\n<li>Interest and experience with with container technologies</li>\n</ul>\n<h2>What we offer you</h2>\n<p>We consider geographical location, experience, and performance in shaping compensation worldwide. We revisit compensation annually (and more often for graduates and associates) to ensure we recognise outstanding performance. In addition to base pay, we offer a performance-driven annual bonus. We provide all team members with additional benefits, which reflect our values and ideals. We balance our programs to meet local needs and ensure fairness globally.</p>\n<ul>\n<li>Distributed work environment with twice-yearly team sprints in person</li>\n<li>Personal learning and development budget of USD 2,000 per year</li>\n<li>Annual compensation review</li>\n<li>Recognition rewards</li>\n<li>Annual holiday leave</li>\n<li>Maternity and paternity leave</li>\n<li>Employee Assistance Programme</li>\n<li>Opportunity to travel to new locations to meet colleagues</li>\n<li>Priority Pass, and travel upgrades for long haul company events</li>\n</ul>\n<h2>About Canonical</h2>\n<p>Canonical is a pioneering tech firm at the forefront of the global move to open source. As the company that publishes Ubuntu, one of the most important open source projects and the platform for AI, IoT and the cloud, we are changing the world of open source. We recruit on a global basis and set a very high standard for people joining the company. We expect excellence - in order to succeed, we need to be the best at what we do. Canonical has been a remote-first company since its inception in 2004.​ Working here is a step into the future, and will challenge you to think differently, work smarter, learn new skills, and raise your game.</p>\n<h2>Canonical is an equal opportunity employer</h2>\n<p>We are proud to foster a workplace free from discrimination. Diversity of experience, perspectives, and background create a better work environment and better products. <a href=\"https://canonical.com/careers/diversity/identity\">Whatever your identity, we will give your application fair consideration.</a></p>\n<p>#LI-remote</p>\n\n    ","tags":"[\"management\",\"engineering\"]","pubDate":"2024-02-21 17:59:14.560","link":"https://canonical.com/careers/5739500","savedDate":"2024-02-21 17:59:14.560","slug":"observability-engineering-manager-canonical-2447"},{"id":8914929301,"title":"Senior Frontend Developer (JS, Typescript, React)","company":"Status","image":"https://pbs.twimg.com/profile_images/966759182589308928/s5rZXoWk_400x400.jpg","description":"\n    <div class=\"content-intro\"><p style=\"text-align: justify;\"><strong>About Status</strong></p>\n<p style=\"text-align: justify;\"><span style=\"font-weight: 400;\">Status is building the tools and infrastructure for the advancement of a secure, private, and open web3.&nbsp;</span></p>\n<p style=\"text-align: justify;\"><span style=\"font-weight: 400;\">With the high level goals of preserving the right to privacy, mitigating the risk of censorship, and promoting economic trade in a transparent, open manner, Status is building a community where anyone is welcome to join and contribute.</span></p>\n<p style=\"text-align: justify;\"><span style=\"font-weight: 400;\">As an organization, Status seeks to push the web3 ecosystem forward through research, creation of developer tools, and support of the open source community.&nbsp;</span></p>\n<p style=\"text-align: justify;\"><span style=\"font-weight: 400;\">As a product, Status is an open source, Ethereum-based app that gives users the power to chat, transact, and access a revolutionary world of DApps on the decentralized web. But Status is also building foundational infrastructure for the whole Ethereum ecosystem, including the Nimbus ETH 1.0 and 2.0 clients, the Keycard hardware wallet, and the Waku messaging protocol; the p2p communication layer for Web3.</span></p>\n<p style=\"text-align: justify;\"><span style=\"font-weight: 400;\">As a team, Status has been completely distributed since inception.&nbsp; Our team is currently 200+ core contributors strong, and welcomes a growing number of community members from all walks of life, scattered all around the globe.&nbsp;</span></p>\n<p style=\"text-align: justify;\"><span style=\"font-weight: 400;\">We care deeply about open source, and our organizational structure has minimal hierarchy and no fixed work hours. We believe in working with a high degree of autonomy while supporting the organization's priorities.</span></p></div>\n\n    <div class=\"careers-block__trix external-panel text-left\">\n<p><strong>The role:</strong></p>\n<p>We are looking for an experienced React developer to join a small, fully asynchronous team, who will take ownership of certain web-related areas at Status. Your role will not only involve translating high-level designs into production-ready UI, but also collaborating with colleagues across the stack to deliver new features.&nbsp;</p>\n<p>Our stack is built on modern foundations – a monorepo powered by TypeScript, React, Storybook, Vite, Vitest, Playwright, ESLint, Prettier, Yarn Workspaces, and Turborepo. As we work in the open and are fully open-source, you can get a better idea of who we are and the work we are doing by browsing our <a href=\"https://github.com/status-im/status-web\">Status Web</a> repository. We strive to build solid foundations that will enable us to continuously make progress. We don't expect you to have a background in everything we use, but we do expect strong JavaScript fundamentals and experience working with React and TypeScript.</p>\n<p>We function as generalists, often undertaking a variety of challenges, and deeply care about the quality of our work. We look forward to collaborating with experienced individuals who can operate independently, make important decisions, and take ownership.</p>\n<p><strong>Key responsibilities:&nbsp;</strong></p>\n<ul>\n<li>Building new features with beautiful and scalable UI components from start to finish</li>\n<li>Building and maintaining the new React implementation of Status’ design system</li>\n<li>Collaborating with other people across the teams</li>\n<li>Gathering feedback from users and developers to better understand their needs</li>\n</ul>\n<p><strong>You ideally will have:</strong></p>\n<ul>\n<li>Clear and effective communication skills, both verbally and written</li>\n<li>Thoughtful and pragmatic problem-solving</li>\n<li>5+ years of software engineering experience, with 3+ years of experience with React</li>\n<li>Experience writing modern, performant, and accessible React code&nbsp;</li>\n<li>Strong knowledge of JavaScript, and ideally TypeScript</li>\n<li>Prior experience creating a component library</li>\n</ul>\n<p><strong>Hiring process:</strong></p>\n<p><em>The steps may change along the way if we see it makes sense to adapt the interview stages, so please consider the above as a guideline.&nbsp;</em></p>\n<ul>\n<li>Call with Talent</li>\n<li>Technical interview</li>\n<li>Live coding interview</li>\n<li>Interview with Design&nbsp;</li>\n<li>Final interview</li>\n</ul>\n<p><strong>Compensation:</strong></p>\n<p>The expected compensation range for this role is negotiable, dependent on how we assess your skills and experience throughout our interview process. We are happy to pay in any mix of fiat/crypto.</p>\n</div>\n\n    \n\n    \n","tags":"[\"javascript\",\"typescript\",\"engineering\"]","pubDate":"2024-02-21 17:59:14.559","link":"https://boards.greenhouse.io/embed/job_app?for=status72&token=5567968&b=https%3A%2F%2Fjobs.status.im%2F","savedDate":"2024-02-21 17:59:14.559","slug":"senior-frontend-developer-js-typescript-react-status-3754"},{"id":5160143886,"title":"Retention Specialist Bilingual (English & Spanish)","company":"Bobtail","image":"https://media.licdn.com/dms/image/D4E0BAQGvUyfPVBWDyg/company-logo_200_200/0/1657595552015?e=2147483647&v=beta&t=EecsDCOy3Fh_26M1noQDDIYw8-JuGKz_d1JDvcBZ-yI","description":"\n    \n\n    <h2>About Bobtail</h2>\n<p>Bobtail is dedicated to increasing happiness by eliminating inefficiencies in the supply chain.&nbsp; We envision a supply chain without friction, fraud, waste, and abuse where companies succeed based on the value they create.&nbsp;&nbsp;</p>\n<p>We work in a unique way at Bobtail, where we value teams over individuals and encourage experimentation and iteration to constantly improve.&nbsp; Teams are given flexibility in working towards a shared purpose and given the freedom to decide how they will accomplish their goals.&nbsp;&nbsp;</p>\n<p>If you are an out of the box thinker that takes a proactive approach in collaborating with others to solve problems and achieve your goals - we would love to talk to you.&nbsp;&nbsp;</p>\n<p>The things we value:</p>\n<ol>\n<li>Mission</li>\n<li>Teams over individuals</li>\n<li>Collaboration</li>\n<li>Communication</li>\n<li>Iteration</li>\n<li>Experimentation and failing fast</li>\n<li>Initiative and solutions oriented approach</li>\n<li>Documentation</li>\n<li>Data</li>\n<li>Mental health and work life balance</li>\n<li>Diversity</li>\n<li>Transparency</li>\n</ol>\n<h2>You should apply if you are/have:</h2>\n<h2>Educational-work background</h2>\n<ul>\n<li>Sales skills</li>\n<li>2-4 years of experience in SaaS and B2B environments</li>\n<li>Excellent English and Spanish proficiency - written and verbal communication skills</li>\n<li>1-3 years of proven experience in retention</li>\n<li>Bachelor’s Degree in relevant fields (business, marketing, customer service)</li>\n<li>Prior US trucking industry experience is a plus</li>\n</ul>\n<h2>Qualities and Attributes</h2>\n<ul>\n<li>Active listening skills</li>\n<li>Good time management</li>\n<li>Great communication skills</li>\n<li>Persuasion ability&nbsp;</li>\n<li>Compassion&nbsp;</li>\n<li>Critical thinking and problem solving skills&nbsp;</li>\n<li>Good organizational skills</li>\n<li>Attention to detail</li>\n<li>Patience and resilience&nbsp;</li>\n<li>Willingness to go above and beyond</li>\n<li>Data orientation</li>\n<li>Ethical conduct</li>\n<li>Collaborative attitude&nbsp;</li>\n<li>Cultural sensitivity</li>\n<li>Adaptability</li>\n</ul>\n<h2>You will be responsible for:</h2>\n<ul>\n<li>Customer relationship management</li>\n<ul>\n<li>Maintaining long-lasting relationships</li>\n<li>Outreaching to customers</li>\n<li>Monitoring customer’s adoption and satisfaction</li>\n</ul>\n<li>Collaborate with team members to decrease churn, increase retention rates and improve brand loyalty</li>\n<li>Troubleshoot problems</li>\n<ul>\n<li>Coordinate with relevant departments</li>\n<li>Follow up to find resolutions</li>\n<li>Address customer issues, complaints and dissatisfaction promptly&nbsp;</li>\n</ul>\n<li>Identify at-risk customers</li>\n<ul>\n<li>Develop retention plans</li>\n<li>Implement retention strategies</li>\n</ul>\n<li>Collect and identify customer’s feedback&nbsp;</li>\n<ul>\n<li>Provide insights for product owners and marketing team</li>\n</ul>\n<li>Monitoring the assigned emails (personal and terminations) to address requests in a timely manner</li>\n<li>Document customer interaction, feedback and resolution in the CRM, and regularly report on retention efforts and outcomes</li>\n<li>Identify opportunities to upsell or cross sell. Provide information about complementary offers and/or new products</li>\n<li>Maintain an in-depth understanding of our products and service and value proposition</li>\n<ul>\n<li>Educate customers on value proposition</li>\n</ul>\n</ul>\n<p>&nbsp;</p>\n<h2>Benefits</h2>\n<ul>\n<li>Monthly Mental Break Day</li>\n<li>Paid Time Off</li>\n<li>Work from home (or wherever)</li>\n<li>Parental leave</li>\n</ul>\n<p>Creating a diverse and inclusive workplace is Bobtail’s nucleus. We are an equal opportunity employer and embrace people of different backgrounds, cultures, religions, national origins, races, colors, genders, gender expressions, sexual orientations, ages, marital status, veteran status, experiences, abilities and perspectives. <br><br></p>\n<p>&nbsp;</p>\n\n    \n\n    \n","tags":"[\"management\",\"B2B\"]","pubDate":"2024-02-21 17:59:14.559","link":"https://boards.greenhouse.io/bobtail/jobs/4320668005","savedDate":"2024-02-21 17:59:14.559","slug":"retention-specialist-bilingual-english-spanish-bobtail-9348"},{"id":7386450358,"title":"Information Systems Security Compliance Engineer","company":"Canonical","image":"https://pbs.twimg.com/profile_images/1673959375340290050/x7pNtXQ7_400x400.jpg","description":"\n      <p>The Security Compliance Engineer works in the office of the CISO in the Risk &amp; Compliance team to help Canonical to achieve overall security &amp; compliance goals and relevant certifications, as well as compliance with regulatory frameworks and other relevant standards.</p>\n<p>The team's role is to ensure that Canonical conducts its business processes in compliance with laws and regulations, internal policies and procedures defined and international standards/best practices. This position is for an individual with the knowledge, drive and personal motivation to help build and grow a strong security &amp; compliance governance framework in a fast-growing tech company, as well as help it achieve/maintain the necessary compliance certifications.</p>\n<p>This role can be home or office based. Periodic international travel for training and business meetings is required.</p>\n<h2>Key responsibilities:</h2>\n<ul>\n<li>Collaborate with IT operations, Legal, Security, and Engineering teams to define and implement policies and procedures</li>\n<li>Help to design and implement controls to strengthen the company’s Security Posture</li>\n<li>Collaborate with various teams to ensure security standards are met across all projects</li>\n<li>Assess vulnerabilities/risks that could affect the integrity, availability, or confidentiality of data, systems, or services of the company and provide mitigation solutions</li>\n<li>Conduct regular audits to ensure compliance with internal policies and procedures, relevant security standards best practices, regulations and client requirements to identify gaps and provide remediation solutions</li>\n<li>Ensure controls are configured correctly and integrated into the security strategy</li>\n<li>Collaborate with internal teams to respond to Security Questionnaires, Contract&nbsp; Compliance and Security &amp; Compliance posture questions from customers</li>\n<li>Provide guidance and support to internal stakeholders regarding security &amp; compliance practices</li>\n<li>Collaborate with internal teams to gather evidence for external audits</li>\n<li>Participate in the creation and or maintenance of the Information Security Management System</li>\n<li>Maintain an up-to-date knowledge on Security standards, best practices and trends to ensure ongoing compliance</li>\n</ul>\n<h2>Required skills and experience:</h2>\n<ul>\n<li>2+ years of experience within a security and compliance function</li>\n<li>Experience developing and maintaining policies, procedures, standards, and guidelines to align with company’s strategy and best practices</li>\n<li>Experience with security controls implementation, configuration and maintenance</li>\n<li>Experience with vulnerability management tooling, remediation, and processes</li>\n<li>Experience with coding/scripting in one or more languages (Python, C, C++, Java)</li>\n<li>Experience with Linux operating systems (Ubuntu preferred)</li>\n<li>Understanding of concepts related to Systems Engineering/DevOps, IaC, IAM, network security, systems security, cryptography</li>\n<li>Have a wide understanding of cybersecurity and data protection frameworks such as ISO 27001, NIST, SOC2, PCI-DSS, GDPR, CCPA.</li>\n<li>Experience with third party and external audits</li>\n</ul>\n<h2>Valuable experience:</h2>\n<ul>\n<li>Bachelor's degree (or equivalent) in Computer Science, Information Systems, or related field</li>\n<li>Affinity with Open Source software with regards to compliance</li>\n<li>Knowledge of designing and implementing security processes and solutions with topics ranging from architecture, governance, compliance, and operations</li>\n<li>Technical or engineering background, including software development, scripting, networking, and cloud architecture</li>\n</ul>\n<p>Canonical is a growing international software company that works with the open-source community to deliver Ubuntu, the world’s best free software platform. Our services help businesses worldwide reduce costs, improve efficiency and enhance security with Ubuntu.</p>\n<h2>About Canonical</h2>\n<p>Canonical is a pioneering tech firm at the forefront of the global move to open source. As the company that publishes Ubuntu, one of the most important open source projects and the platform for AI, IoT and the cloud, we are changing the world on a daily basis. We recruit on a global basis and set a very high standard for people joining the company. We expect excellence - in order to succeed, we need to be the best at what we do. Canonical has been a remote-first company since its inception in 2004.​ Working here is a step into the future, and will challenge you to think differently, work smarter, learn new skills, and raise your game.</p>\n<h2>Canonical is an equal opportunity employer</h2>\n<p>We are proud to foster a workplace free from discrimination. Diversity of experience, perspectives, and background create a better work environment and better products. <a href=\"https://canonical.com/careers/diversity/identity\">Whatever your identity, we will give your application fair consideration.</a></p>\n<p>#LI-remote</p>\n\n    ","tags":"[\"management\",\"engineering\",\"legal\",\"aws\"]","pubDate":"2024-02-21 17:59:14.559","link":"https://canonical.com/careers/5523205","savedDate":"2024-02-21 17:59:14.559","slug":"information-systems-security-compliance-engineer-canonical-1354"},{"id":4880560398,"title":"Partnerships Manager (France)","company":"Airalo","image":"https://lever-client-logos.s3.us-west-2.amazonaws.com/55028a36-609c-479c-9553-d4689ff2dd8c-1669620566663.png","description":"<div><b>About Airalo</b></div><div>Alo! Airalo is the world’s first eSIM store that helps people connect in over 200+ countries and regions across the globe. We are building the next digital service that revolutionizes the telecom industry. We are a travel-tech company and an equal-opportunity environment that values and executes diversity, inclusion, and equity. Our team is spread across 40+ countries and six continents. What glues us together is our commitment to changing the way you connect<span style=\"font-size: 13.3333px\">. </span></div><div><br></div><div><b>About you</b></div><div>We hope that you care deeply about the quality of your work, the intrinsic worth of tasks, and the success of your team. You are self-disciplined and do not require micromanagement in terms of your skillset and work ethic. You do your best to flourish as an individual every day while working hard to foster a collaborative team environment. You believe in the importance of being — and staying — authentic, honest, positive, and kind. You are a good interlocutor with clear and concise communication. You are able to manage multiple projects, have an analytical mind, pay keen attention to detail, and love to get your hands dirty. You are cognizant, tolerant, and welcoming of vulnerabilities and cultural differences.</div><div><br></div><div><b>About the Role</b></div><div><b>Position</b>: Full-time / Employee</div><div><b>Location:</b>&nbsp;Remote-first </div><div><b>Benefits:</b>&nbsp;Health Insurance, work-from-anywhere stipend, annual wellness &amp; learning credits, annual all-expenses-paid company retreat in a gorgeous destination &amp; other benefits</div><div><br></div><div><span style=\"font-size: 11pt\">We are looking for a Partnerships superstar to join the </span><b style=\"font-size: 11pt\">Airalo Partnerships</b><span style=\"font-size: 11pt\">&nbsp;</span><a href=\"http://department.Airalo\" style=\"font-size: 11pt\" class=\"postings-link\">department.Airalo</a><span style=\"font-size: 11pt\"> is the undisputed industry leader in the B2C segment in the eSIM industry, we are now looking to expand our presence in the B2B2C and B2B space to bring the eSIM revolution to global </span><a href=\"http://markets.As\" style=\"font-size: 11pt\" class=\"postings-link\">markets.As</a><span style=\"font-size: 11pt\"> the Partnerships Manager for France, you will lead and oversee various partnerships across Airalo’s four key Partnerships streams - Strategic Partnerships, Channel Sales, Corporate Sales, and Affiliate Marketing. The main goal is to develop our partnership vertical; as well as manage the partnership cycle from leads creation down to partner launch to achieve our business objectives.</span></div><h3>Responsibilities include but are not limited to:</h3><li>Find, identify, prospect, and lead negotiations with potential partners across partnership streams, especially within Strategic Partnerships, to support Airalo’s market penetration efforts.</li><li>Onboard and support new partners as they join the Airalo Partner Community.</li><li>Maintain relationships with key partners to drive partner profitability and grow the B2B/B2B2C partnerships’ contribution to the business.</li><li>Conduct ongoing competitive analysis to establish and maintain Airalo’s status as the leading eSIM provider across partner industries.</li><li>As a senior member of the French squad, drive the overall growth strategy for Airalo.</li><li>Own the Airalo partnerships OKRs in France.</li><li>Hire and develop talent within the partnership streams to support Airalo’s partnership initiatives and efforts.</li><li>Collaborate and work with different internal and external stakeholders to develop and execute projects/opportunities.</li><li>Identify relevant events and conferences across verticals and represent Airalo as a speaker, delegate, or exhibitor to educate the ecosystem about eSIMs and our solutions.</li><li>Work closely with the Director of Partnerships, Europe &amp; CIS, and with other team members in the department.</li><div><br></div>,<h3>Must-haves:</h3><li>7+ years of experience in partnerships, business development, sales, or account management, in a high-growth B2B and/or B2B2C travel tech or travel e-commerce environment.</li><li>Perfect verbal and written communication skills in English &amp; French.</li><li>Proven expertise across one or more of Airalo’s four Partnerships streams.</li><li>Deep understanding of the travel or/and telecom partnerships ecosystem in France with a strong and existing network of market contacts.</li><li>Partner-first mentality and a genuine passion to help your stakeholders succeed while creating win-win relationships.</li><li>Ability to narrate a good story - make a compelling partnership proposition with Airalo’s unique story and the problem we solve for travelers.</li><li>Experience with sales and partnerships models.</li><li>Ability to employ sales techniques, including effective questioning, objection handling, consultative selling, and solution selling.</li><li>Self-starter with the ability to multi-task in a complex &amp; matrix environment.</li><li>Extreme comfort with technology tools.</li><li>Dedicated, high-energy, collaborative, attention to details, excellent organization, data-driven, and problem solving skills.</li><li>Experienced with CRM systems like Salesforce or HubSpot to manage the target lead pipeline and nurture partnerships.</li><div><br></div>,<h3>Good to have:</h3><li>Preferably a mix of startup and mid to large companies level experience.</li><li>Familiarity with an e-commerce/technology travel industry or telecom company.</li><li>2+ years experience in building and/or leading a team.</li><li>Familiarity with data insights visualization tools.</li><li>Graduate degree in a related field.</li><li>Certificates and courses in sales and partnerships.</li><li>Experienced in leveraging AI tooling to maximize efficiency.</li><li>Proficiency and practical experience in AI to enhance the ability to leverage innovative technologies in fostering and managing strategic alliances</li><div>If you are interested in this position, <b>please apply via the link.</b></div><div><br></div><div><i>We sincerely thank all applicants in advance for submitting their interest in this opportunity with Airalo. </i></div>","tags":"[\"management\",\"B2C\",\"B2B\"]","pubDate":"2024-02-21 12:28:32.588","link":"https://jobs.lever.co/airalo/f2f2f291-0e9b-4894-81e9-4f7a52e1aa06","savedDate":"2024-02-21 17:59:14.564","slug":"partnerships-manager-france-airalo-9897"},{"id":5579305918,"title":"Jr. Procurement Specialist","company":"Ciceksepeti","image":"https://lever-client-logos.s3.us-west-2.amazonaws.com/de4eebbf-97f1-4bdb-b542-4fa65a0b48ab-1662467464737.png","description":"<div><b>Want to join us as we move closer to be a leader in all markets in which we operate, as a pioneering tech company?&nbsp;Do you have a unique combination of entrepreneurship mindset and top-notch professional skills?&nbsp;Then keep on reading… </b></div><div>&nbsp;</div><div>We’re looking for our new colleagues willing to be among the architects of our success story as we grow further in gifting category. Reporting directly to the Category Manager, you’ll be accountable for end to end marketplace management of related categories in order to increase sales and profitability for sustainable growth, while ensuring that our customers have an impeccable shopping experience with our first-class products and services.&nbsp;</div><h3>🎯Your Journey Begins: Embrace the Exciting Adventure Ahead!</h3><li>Ensuring strong stakeholder and supplier management</li><li>Fulfilling responsibilities in contract management processes</li><li>Creating the best roadmap in line with company goals for purchasing process</li><li>Providing to reach out the best value for the company in terms of cost, quality, delivery, and innovation thanks to our strong negotiation skills</li><li>Innovative sourcing strategy skill to develop extensive market knowledge to boost Company’s pipeline and influence the industry</li><li>Effective collaboration &amp; Influence skills as an integral member of x-functional stakeholders</li>,<h3>✨Let Your Skills Shine with Us!</h3><li>BA/BSc degree in relevant academic disciplines</li><li>Minimum 1 years experience all in procurement</li><li>Excellent verbal and written communication skills in English</li><li>Professional knowledge of MS Office applications</li><li>Having a class B driver’s license and actively driving</li>,<h3>😎What’s in here for you?</h3><li>🎉Fun and Adventure Await: Get ready for exhilarating team adventures and unforgettable company activities that will create memories to cherish! 🌈</li><li>🌟Dive into an Exciting World of Entertainment! : Netflix, BluTV, YouTube Premium, and More! 🎬🍿</li><li>🎩Express Your Unique Style: No more stuffy suits or uncomfortable attire. Embrace your personal style and wear whatever makes you feel confident and comfortable. 👗👕</li><li>📚Unlock Your Potential: Biweekly Learning Hours and a Vast Training Library Await! 🎓 Never stop learning and growing! With unlimited access to top-notch training resources like Udemy and more, your professional growth knows no limits! 🚀</li><li>🥰Join Vibrant Social Clubs: Connect, Collaborate, and Create Lifelong Friendships!🎉Be part of our vibrant social clubs, where you can engage with colleagues who share your passions and interests. Cultivate meaningful connections, foster collaboration, and create memories that extend beyond the workplace.🤝</li><li>🤝Seamless Onboarding: Receive a Warm Welcome and a Smooth Transition! 📋 Our dedicated onboarding process ensures you feel supported and empowered from day one. We provide comprehensive training and resources to help you settle into your role quickly and effectively. 🌟</li><li>Join us on this exciting journey where remote work, a dynamic work ecosystem, thrilling team activities, entertainment galore, a flexible dress code, and endless learning opportunities await you! It’s time to unleash your full potential and embrace the future of work! 💃</li><div><b>😍About Us</b></div><div><br></div><div>As a pioneering tech company in gifts, our vision is to be a leader in all markets in which we operate. We create lifelong value in the lives of our employees, customers and all our business partners! 💪</div><div><br></div><div>Founded in 2006 by Emre Aydın, <a href=\"http://ciceksepeti.com/\" class=\"postings-link\">Ciceksepeti.com</a> offers the broadest selection of flowers &amp; gifts delivered same day within a single experience. We are very proud to have created a culture of celebration among people with our gift arrangements and our brand Bonnyfood. We are committed to continuing this tradition by making every special day memorable. In addition to our original mission of bringing a new perspective to the e-commerce sector in Turkey and making shipping faster and easier, now we offer a diverse range of products under various categories, such as electronics, home &amp; living, personal care, supermarket, cosmetics, fashion, sports &amp; outdoor, hobby, pet shop, jewellery &amp; accessories, as well as flowers and edible flowers since 2019.</div><div><br></div><div><a href=\"http://ciceksepeti.com/\" class=\"postings-link\">Ciceksepeti.com</a> is the most visited floral and gifting website according to SimilarWeb data, having 4 times more visitors than the second largest player in the world. 😎</div><div><br></div><div>Besides covering 70+ cities in Turkey through 55.000+ vendors and 24x7 customer support, Ciceksepeti has expanded into Mexico with its international brand, LolaFlora.💃</div><div><br></div><div>We are so happy and proud to have been selected the Best Employer Brand at LinkedIn Turkey Talent Awards in 2019 and 2022! 🥳</div><div><br></div><div>Headquartered in İstanbul, we’re a young, nimble, dedicated team of professionals, who are not only hard workers but also smart workers; who know how to get things done in the right way, as well as getting the right things done for our customers. Moreover, we’re on the verge of an exciting episode in our journey as we simultaneously set foot on international markets and grow further in domestic market.</div><div><br></div><div>\"İşe alım süreçlerimizde kişisel verilerinizi nasıl işlediğimize dair bilgiye çalışan adayı aydınlatma metnimizden ulaşabilirsiniz./ Please see our candidate privacy note for information on how we process your personal data during our recruitment activities.\"</div><div><a href=\"https://cdn03.ciceksepeti.com/editor/hr/Ciceksepeti_CS-Teknoloji-Calisan-Adayi_Aydinlatma-Metni-15092023.pdf\" class=\"postings-link\">https://cdn03.ciceksepeti.com/editor/hr/Ciceksepeti_CS-Teknoloji-Calisan-Adayi_Aydinlatma-Metni-15092023.pdf</a></div><div><a href=\"https://cdn03.ciceksepeti.com/editor/hr/Ciceksepeti_CS-Teknoloji-Calisan-Adayi_Aydinlatma-Metni-15092023.docx.pdf\" class=\"postings-link\">https://cdn03.ciceksepeti.com/editor/hr/Ciceksepeti_CS-Teknoloji-Calisan-Adayi_Aydinlatma-Metni-15092023.docx.pdf</a></div>","tags":"[\"management\"]","pubDate":"2024-02-21 06:39:22.190","link":"https://jobs.lever.co/ciceksepeti/20017316-a653-418b-ab31-5895d8a4ebe8","savedDate":"2024-02-21 17:59:14.565","slug":"jr-procurement-specialist-ciceksepeti-7168"},{"id":1357939092,"title":"Talent Acquisition Specialist","company":"CoverGo","image":"https://pbs.twimg.com/profile_images/1382655628523364355/MWPIbbID_400x400.jpg","description":"<p><strong>Top 3 Reasons To Join Us&nbsp;</strong></p><ul> <li>Competitive Salary</li> <li>100% Globally Remote</li> <li>Working on the latest tech for the Insurtech Market Leader</li> </ul><p></p><p><strong>About Us</strong></p><p>At CoverGo, our mission is to empower all insurance companies to make insurance 100% digital and accessible to everyone.</p><ul> <li>We are a leading global no-code insurance platform for health, life, and P&amp;C;</li> <li>We’re the winner of the Insurtech of the Year in all of Asia and other awards globally;</li> <li>We work with insurance enterprise clients such as AXA, Bupa, MSIG, Dai-ichi, Bank of China Group Insurance, and many more;</li> <li>We're an international, diverse team of over 120 people with 30 nationalities and team members working remotely from all over the world;</li> <li>We are fully funded and backed by reputable VC funds and strategic institutional investors;</li> <li>We have a global presence in Asia, EMEA and the Americas;</li> <li>We’ve grown our annualized revenue by over 30x since January 2021;</li> <li>We’re constantly working towards making CoverGo a workplace that you love coming to. We deeply believe that bringing together a diversity of thoughts, expressions, and perspectives is key to building the best culture for equally diverse communities all over the world.</li> </ul><p></p><p><strong>What you will do:</strong></p><ul> <li>Develop and implement innovative and effective recruitment strategies to attract qualified candidates.</li> <li>Collaborate with hiring managers to understand staffing needs and create tailored recruitment plans.</li> <li>Utilize various channels, including job boards, social media, and networking events, to source and attract high-quality candidates.</li> <li>Build and maintain a strong talent pipeline for current and future hiring needs.</li> <li>Conduct thorough candidate assessments, including resume reviews, initial interviews, and skills assessments.</li> <li>Present qualified candidates to hiring managers, providing detailed evaluations and recommendations.</li> <li>Foster positive relationships with hiring managers and department heads to understand team dynamics and cultural fit requirements.</li> <li>Act as a strategic partner in talent acquisition, providing guidance on market trends and best practices.</li> <li>Coordinate and schedule interviews between candidates and hiring teams.</li> <li>Provide guidance to interviewers on effective interview techniques and best practices.</li> <li>Collaborate with hiring managers to develop competitive and compelling job offers.</li> <li>Conduct salary negotiations and ensure a smooth offer acceptance process.</li> <li>Work closely with HR and hiring managers to facilitate a seamless onboarding process for new hires.</li> <li>Provide ongoing support and communication to new hires during their transition.</li> </ul><p></p><p><strong>What We Need:</strong></p><ul> <li>Bachelor's degree in Human Resources, Business Administration, or a related field.</li> <li>Proven experience as a Talent Acquisition Specialist or in a similar recruitment role.</li> <li>Strong understanding of recruitment best practices and market trends.</li> <li>Excellent communication and interpersonal skills.</li> <li>Good command of English is a must, knowing other languages would be an advantage.</li> <li>Ability to manage multiple priorities and work in a fast-paced environment.</li> <li>Familiarity with applicant tracking systems (ATS) and HR software.</li> <li>Working experience with international businesses</li> <li>Able to work independently and under pressure in a fast-paced environment with an emphasis on accuracy and timeliness</li> <li>Meticulous, well-organized and conscientious with a high level of initiative at work</li> <li>Self-motivated, hardworking, a strong sense of responsibility with a positive working attitude</li> <li>Resourceful, can-do attitude and willingness to learn and go beyond</li> </ul><p></p><p><strong>Why You'll Love Working Here</strong></p><ul> <li>Fully Remote</li> <li>Flexible Leave</li> <li>International Environment</li> <li>Competitive remuneration package</li> <li>Performance Bonus</li> <li>Stock Options after 6 months</li> <li>Company activities and events</li> <li>Learning and development plan</li> </ul><p><strong>Covergo Company</strong><a href=\"https://www.youtube.com/watch?v=YI0ezLxvFvA\" rel=\"nofollow noreferrer noopener\" class=\"external\"><strong> Video</strong></a></p><p>By submitting your application, you confirm that you have read, understood, and accepted the content of CoverGo’s <a href=\"https://apply.workable.com/covergo/gdpr_policy?lng=en\" target=\"_blank\" rel=\"nofollow noreferrer noopener\" class=\"external\">Privacy Notice</a> and you consent to the processing of your data as part of this application.</p><h3>Requirements: </h3><h3>Benefits: </h3>","tags":"[]","pubDate":"2024-02-21 00:00:00.000","link":"https://apply.workable.com/covergo/j/6FE4CDA25C","savedDate":"2024-02-21 17:59:14.562","slug":"talent-acquisition-specialist-covergo-9850"},{"id":5274835090,"title":"BI Analyst - Strategic Finance (Remote)","company":"DuckDuckGo","image":"https://spreadprivacy.com/content/images/2023/05/duckduckgo-logo_wide.png","description":"<p>Hi, we’re DuckDuckGo, the Internet privacy company for everyone who wants to take back their privacy now. For over a decade, we've been building our all-in-one product, developing new privacy technology, and working with policymakers to make online privacy simple and accessible for all. </p>\n<p><br /></p>\n<p>Our app is now downloaded more than 78M times a year, and our private search engine packaged with it has become the #2 search engine on mobile in the United States and 18 other countries, including the United Kingdom, Canada, Australia, Germany, and the Netherlands. Oh, and we've been profitable since 2014, with revenue exceeding $100 million a year! Now, we’re rolling out a suite of new privacy solutions, including <u><a href=\"https://www.spreadprivacy.com/introducing-email-protection-beta/\" rel=\"noopener\">Email Protection</a></u>,  <u><a href=\"https://spreadprivacy.com/introducing-app-tracking-protection/ \" rel=\"noopener\">App Tracking Protection</a></u> and our first-ever Desktop Apps for <u><a href=\"https://spreadprivacy.com/introducing-duckduckgo-for-mac/\" rel=\"noopener\">Mac</a></u><a href=\"https://spreadprivacy.com/introducing-duckduckgo-for-mac/\" rel=\"noopener\"> </a>and <u><a href=\"https://spreadprivacy.com/windows-browser-open-beta/\" rel=\"noopener\">Windows</a></u>.</p>\n<p><br /></p>\n<p>We’re looking for a <strong>BI Analyst - Strategic Finance</strong> to help shape our all-in-one privacy solution and join our mission to show the world that protecting your privacy online can be simple.  </p>\n<p><br /></p>\n<p><strong>The Opportunity</strong> </p>\n<p>In this role, you'll be a data analytics subject matter expert within our Finance team, partnering with various business teams to develop visualizations of core metrics and analyzing performance trends to drive business insights. Additionally, you'll support the development of metric target setting and financial forecasts as we continue on our journey to accelerate growth.</p>\n<p><br /></p>\n<p><strong>What You Will Bring to DuckDuckGo</strong> </p>\n<ul><li>Ability to lead and collaborate on high-impact and complex projects from proposal through post-mortem.  </li><li>Skills to wrangle vague problems, propose innovative solutions, and execute them with a strong focus on metrics. </li><li>5+ years of experience working in Business Intelligence, with a focus on BI/Data Visualization</li><li>At least 2 years of experience working on financial analysis (P&amp;L, reporting, forecasting etc.)</li><li>Advanced proficiency with Tableau, SQL and Microsoft Excel</li><li>Passion for teaching, mentoring and guiding other stakeholders to use BI tools and best practices</li></ul>\n<p><br /></p>\n<p><strong>How We Will Support You </strong> </p>\n<p>Our core values -- build trust, question assumptions, and validate direction -- underpin how we work day-to-day and the support we give our team members. We strive to empower our team members to be self-directed and self-motivated in their work.  </p>\n<p><br /></p>\n<ul><li><strong>Remote First, Always</strong>: We've always been a fully distributed company with team members all over the world. We trust you to get your work done wherever, and whenever.   </li><li><strong>Commitment to Personal Growth:</strong> Every team member has an annual budget of $1,250 USD to invest in their professional development. Every team member also has a dedicated Career Advisor, who serves as a guide to help you develop your strengths, identify your motivations, and understand your opportunities for growth. </li><li><strong>Leadership:</strong> We have many different types of leaders and possible combinations of leadership roles, so you can grow your career in a way that aligns best with your personal goals. You can seek additional leadership roles by being directly responsible for projects, taking ownership of areas of the company, developing and maintaining internal processes, or pursuing advisory roles. </li><li><strong>Work/Life Balance: </strong>Team members have the freedom and flexibility to organize their own work schedules. We want you to thrive both in and out of the office. We trust you to use good judgment and take the time off that you need to bring your best self to work.  </li></ul>\n<p><br /></p>\n<p>We also offer paid parental leave, a co-working stipend, office setup reimbursement, and a wellness stipend. More support resources can be found in our <u><a href=\"https://duckduckgo.com/assets/hiring/team_support_guide.pdf\" rel=\"noopener\">Team Member Support Guide</a></u>, which explains how we make your well-being a priority. </p>\n<p><br /></p>\n<p>For more information on how we collaborate worldwide, from leadership in our relatively flat organization to start-to-finish ownership<strong>,</strong> check out <u><a href=\"https://duckduckgo.com/assets/hiring/how_we_work.pdf\" rel=\"noopener\">DuckDuckGo Culture: How We Work.</a></u> </p>\n<p><br /></p>\n<p><strong>Compensation</strong> </p>\n<p>Annual compensation: <strong>$144,667</strong> USD and stock options. Compensation is the same within a professional level, regardless of geographic location or functional area, and the compensation for each professional level is transparent across the organization.</p>\n<p><br /></p>\n<p><strong>Hiring Process</strong> </p>\n<p>Hiring works best when it's a two-way street. Learn how we help you get to know DuckDuckGo and envision your future role here. Find out more about <u><a href=\"https://duckduckgo.com/assets/hiring/how_we_hire.pdf\" rel=\"noopener\">how we hire</a></u>. </p>\n<p><br /></p>\n<p><strong>Diversity, Equity, and Inclusion</strong> </p>\n<p>DuckDuckGo provides equal work opportunities to all team members and applicants<u>,</u> and it prohibits discrimination and harassment of any type on the basis of race, color, ethnicity, caste, religion, age, sex (including pregnancy), national origin, disability status, genetics, protected veteran status, sexual orientation, gender identity or expression, or any other characteristic protected by our policies or federal, state, or local laws.</p>\n<p><br /></p>\n<p>We want to ensure that our hiring process is accessible. If you need reasonable accommodation for any part of the application process because of a medical condition or disability, please send an email to <u><a href=\"mailto:careers@duckduckgo.com\" rel=\"noopener\">careers@duckduckgo.com</a></u> to let us know the nature of your request.  </p>\n<p><br /></p>\n<p>If you think you might thrive in this environment, we would love to hear from you. </p>\n<p><br /></p>\n<p><strong>Please note that:</strong> </p>\n<ol><li>Sometimes we meet up! Expect to travel at least two times a year: once for our all-hands meetup and again for a team retreat (each around 4-5 days). While extenuating circumstances may impact attendance, everyone is strongly encouraged to attend.</li><li>While we offer a flexible work arrangement with no core hours, expect an average full-time commitment of 40 hours per week. </li><li>A successful candidate will be subject to a background check and must receive satisfactory results of the same, as a condition of joining the team. </li><li>By applying for this role, you confirm that all information submitted is accurate and complete. You further acknowledge that providing false or fraudulent information during the application process is cause for denial of an offer, revocation of any existing offer, or other adverse action, up to and including termination after the start of your commencement of work.  </li></ol>\n<p><br /></p>\n<div><p>#US #UK #SP #PL #IR #IC #HN #CR #CN #AU</p></div>\n<div><br /></div>\n<p><br /></p>","tags":"[\"Finance\",\"aws\"]","pubDate":"2024-02-20 20:00:01.000","link":"https://duckduckgo.recruitee.com/o/bi-analyst-strategic-finance-remote","savedDate":"2024-02-21 17:59:14.558","slug":"bi-analyst-strategic-finance-remote-duckduckgo-6532"},{"id":1004828684,"title":"Salesforce Administrator","company":"Bio Render","image":"https://lever-client-logos.s3-us-west-2.amazonaws.com/0f4b434e-502f-4390-9819-c058d43028c1-1595260531860.png","description":"<div>At BioRender, our mission is to accelerate the world’s ability to learn, discover and communicate science. We are passionate about democratizing science communication in order to accelerate scientific discovery and understanding. We're looking for amazing people to help create the world’s go-to-place and platform where science is communicated. Come join us!</div><div><br></div><div><span style=\"font-size: 11pt\">We are hiring a Junior Salesforce Administrator to support our Salesforce Administrator in improving the user experience of our Salesforce users and optimizing how we use Salesforce to track and inform our GTM operations as we scale!&nbsp;&nbsp;</span></div><div><br></div><div><span style=\"font-size: 11pt\">You will be responsible for maintaining data quality and supporting users as we grow and implement new processes and automation. We migrated into Salesforce in December 2022. There is tons of room for growth in building out these foundations: improving the efficiency of our sales processes and optimizing our set-up. Alongside the Revenue Operations team, you will help implement the next phase of our CRM evolution.</span></div><div><br></div><div><span style=\"font-size: 11pt\">This is a </span><b style=\"font-size: 11pt\">remote </b><span style=\"font-size: 11pt\">role, based in Canada or the US. You can read about BioRender's </span><a href=\"https://www.notion.so/biorender/BioRender-Candidate-Resources-5fe1f722790346be9253fb5e6b883f70\" style=\"font-size: 11pt\" class=\"postings-link\">interview process</a><span style=\"font-size: 11pt\"> here!</span></div><h3>Our ideal fit</h3><li><b>Detail-oriented and data-focused approach: </b>You are known for being process-oriented and always looking for ways to scale and improve strategies to prevent data inconsistencies or details that others might miss.</li><li><b>Proactive and Strategic Thinker: </b>You design processes with scale in mind. You are a strategic thinker who proactively considers the near-term and long-term implications of your approach to problem-solving and solutions design!</li><li><b>Team-oriented approach:</b> You can easily build relationships with diverse stakeholders and understand the needs and dynamics of distinct teams as well as the business.</li><li><b>Resourceful</b>: You are resourceful and can work independently and move projects forward. You are known for your figure-it-out approach to tackling difficult problems!</li>,<h3>Your responsibilities </h3><li>You’ll design and execute a scalable process to update, maintain, and audit the accuracy and comprehensiveness of customer data stored in Salesforce</li><li>You’ll work to improve and optimize Salesforce users’ experiences.&nbsp;</li><li>Collaborate with Sales, Customer Success and Revenue Operations teams to design strategy for managing user issues and requests. </li>,<h3>What you bring to the table</h3><li>2+ years of experience with Salesforce as an Administrator for a SaaS company</li><li>2+ years of experience creating Salesforce Flows, Alerts, and other forms of automation as well as creating dynamic reports and dashboards.</li><li>Excel proficient</li><li>Knowledge of APEX is a plusSalesforce Developer or Architect experience is a plus</li><li>Preferably working towards a Salesforce certification</li><li>Excellent project management skills with an ability to set and achieve goals, meet deadlines, and multitask in a fast-paced environment.</li><li>A team player, comfortable presenting to a group</li>,<h3>What you can expect from our interview process</h3><li><b>Introductory calls: </b>We will set up a 30-minute phone call with one of our recruiters and/or our Salesforce Administrator, during which you’ll have the opportunity to share more about your experience and interests. You’ll also learn more about BioRender and the team you’re interviewing with. Feel free to ask any questions throughout these calls!</li><li><b>Practical interview: </b>You’ll be completing a practical exercise so we can see your skills in action and give you a realistic role preview. This exercise will be conducted with our Salesforce Administrator and Sales Leader.</li><li><b>Work history interview: </b>This is a conversational interview with our Salesforce Administrator and Sales Leader. They will review your past work and educational experiences in chronological order - <a href=\"https://biorender.notion.site/biorender/Candidate-Guide-to-the-BioRender-Chronological-Interview-54c6e465502042a3870dddd614708c20\" class=\"postings-link\">you can read more about how to prepare for this interview here</a>!</li><li><b>Meet the team: </b>Throughout our interview process, you can expect to meet with some of your potential colleagues. </li>,<h3>Why join us?</h3><li>We are mission-driven, and work collaboratively towards our shared vision of improving scientific communication and accelerating scientific discovery: BioRender figures have appeared in more than 16,000 publications!&nbsp;</li><li>It’s a product that users love! We have a world-class NPS and a community of loyal fans. Check out our Testimonials page to see what our customers are saying about us: <a href=\"https://biorender.com/testimonials/\" class=\"postings-link\">https://biorender.com/testimonials/&nbsp;</a></li><li>We are in the top quartile for profitability and year-over-year revenue growth, with users in 200+ countries.</li><li>BioRender is an equal opportunity employer, and an inclusive hiring process and work environment is a part of our DNA.&nbsp;</li><li>We’re remote-first and have team members across Canada and the United States. A physical office in Toronto is available, but you have the flexibility to work from anywhere.&nbsp;</li><li>We’re backed by top investors, accelerators, and some of the most successful life science entrepreneurs and philanthropists in the world including Y Combinator, Malala Fund founders, and Fifty Years VC.&nbsp;</li><li>We are committed to building a warm, inclusive, and diverse environment. Check out how we make sure our <a href=\"https://www.biorender.com/biorender-careers\" class=\"postings-link\">employees come first</a>.</li><div>You can read more about the <a href=\"https://biorender.notion.site/BioRender-Candidate-Resources-8255c155797f442a950720a33b4764d5\" class=\"postings-link\">BioRender interview process and FAQs here</a>!</div>","tags":"[\"management\"]","pubDate":"2024-02-20 15:00:32.712","link":"https://jobs.lever.co/biorender/6d8026cb-cb44-4766-a144-0d0d94c26945","savedDate":"2024-02-21 17:59:14.566","slug":"salesforce-administrator-bio-render-7045"},{"id":4382312542,"title":"Senior Site Reliability Engineer","company":"PandaDoc","image":"https://remotive.com/job/1897270/logo","description":"<p>Site Reliability Engineers are mission-critical for PandaDoc success. We ensure that PandaDoc services are reliable and service our customers with minimum downtime. Site Reliability Engineers are the driving force that keeps the system running smoothly and helps identify any bottlenecks before they become issues. We focus on metrics, observability, and eliminating manual operations work with automation.</p>\n<div class=\"h2\"><strong>In this role, you will:</strong></div>\n<ul style=\"\">\n<li style=\"\">Build software, frameworks, and tools required for reliable operations of PandaDoc services</li>\n<li style=\"\">Manage the stability and operation of most critical production applications through application reviews, capacity planning, and performance tuning</li>\n<li style=\"\">Constantly develop automations/tooling for better platform reliability/availability</li>\n<li style=\"\">Work with cutting-edge &amp; distributed systems not limited to, but including Kubernetes, RabbitMQ, Kafka, Redis and ElasticSearch</li>\n<li style=\"\">Collaborate with other engineers on the team as well as cross functionally to foster solid engineering principles and represent our engineering values</li>\n<li style=\"\">Participate in various POCs on new projects and frameworks being evaluated for the product/platforms</li>\n<li style=\"\">Improve our observability as both a developer/maintainer of systems/frameworks, and a mentor to our product development teams</li>\n</ul>\n<div class=\"h2\"><strong>About you:</strong></div>\n<ul style=\"\">\n<li style=\"\">3+ years of experience using higher level languages (e.g. Python or Go)</li>\n<li style=\"\">Strong experience in configuration and maintenance observability tools (Prometheus, Grafana, Kibana)</li>\n<li style=\"\">Experience in supporting critical production services</li>\n<li style=\"\">Enjoy hands-on troubleshooting in a distributed Linux systems environment and are comfortable in tracing problems through applications, systems and networks</li>\n<li style=\"\">Strong experience with AWS and Kubernetes</li>\n<li style=\"\">Experience using industry standard DevOps tools such as GitLab, Jenkins, Terraform</li>\n<li style=\"\">You enjoy communication and knowledge sharing on all things reliability</li>\n<li style=\"\">You act like an owner and strive to do work you're proud of, both technically and in your team interactions</li>\n</ul>\n<div class=\"h2\"><strong>Company Overview: </strong></div>\n<p>PandaDoc empowers more than 50,000 growing organizations to thrive by taking the work out of document workflow. PandaDoc provides an all-in-one document workflow automation platform that helps fast scaling teams accelerate the ability to create, manage, and sign digital documents including proposals, quotes, contracts, and more.  For more information, please visit<a href=\"%22https:/www.pandadoc.com/%22\" rel=\"nofollow\"> https://www.pandadoc.com</a>.</p>\n<div class=\"h2\"><strong>Company Culture: </strong></div>\n<p>We're known for our work-life balance, kind co-workers, &amp; creative virtual team-bonding events. And although our Pandas are located across the globe, we stay connected with the help of technology and ensure that everyone on our team feels, well, like a team.</p>\n<p>Pandas work best when they're happy. We retain our talent by upholding our values of integrity &amp; transparency, and selling a product that changes the lives of our customers. </p>\n<p>Check out our<a href=\"%22https:/www.linkedin.com/company/pandadoc/life/pdcompanyculture%22\" rel=\"nofollow\"> LinkedIn</a> to learn more.</p>\n<div class=\"h2\"><strong>Benefits:</strong></div>\n<ul style=\"\">\n<li style=\"\">An honest, open culture that emphasizes feedback and promotes professional and personal development</li>\n<li style=\"\">An opportunity to work from anywhere — our team is distributed worldwide, from Lisbon to Manila, from Florida to California</li>\n<li style=\"\">6 self care days</li>\n<li style=\"\">A competitive salary</li>\n<li style=\"\">And much more!</li>\n</ul>\n<p><strong>PandaDoc is an Equal Opportunity Employer.</strong> We are committed to equal treatment of all employees without regard to race, national origin, religion, gender, age, sexual orientation, veteran status, physical or mental disability or other basis protected by law.</p>\n<p><strong>EXTERNAL RECRUITERS</strong></p>\n<p><strong>Approval Requirement</strong></p>\n<p>The use of external recruiters/staffing agencies requires prior approval from our HR Team. The HR Team at PandaDoc requests that external recruiters/staffing agencies not to contact PandaDoc employees directly in an attempt to present candidates. Complying with this request will be a factor in determining future professional relationships with PandaDoc.</p>\n<p> </p>\n<img src=\"https://remotive.com/job/track/1897270/blank.gif?source=public_api\" alt=\"\"/>","tags":"[\"AWS\",\"go\",\"kubernetes\",\"python\"]","pubDate":"2024-02-20 09:21:18.000","link":"https://remotive.com/remote-jobs/devops/senior-site-reliability-engineer-1897270","savedDate":"2024-02-21 17:59:14.556","slug":"senior-site-reliability-engineer-pandadoc-155"},{"id":2618567805,"title":"Strategic Growth Leader","company":"Spark Advisors","image":"https://remotive.com/job/1898070/logo","description":"<div><!--block-->We’re looking for our first Strategic Growth Leader to manage and build our team of Strategic Growth Managers (SGMs) in effort to accelerate our agency recruitment efforts. </div><div><!--block--><br></div><div><!--block-->Working with sales leadership, you will own the day-to-day management of the SGMs and set the direction around how the SGM scales moving forward. You’ll be responsible for hiring and onboarding new SGMs, training SGMs on pipeline creation best practices, and achieving pipeline generation goals. You’ll be expected to hold regular 1:1 coaching sessions and team meetings in order to motivate team members and hold them accountable to sales targets. </div><div><!--block--><br></div><div><!--block-->Furthermore, you’ll need to collaborate with Sales Leadership, Operations, and Marketing to optimize the agency recruitment strategy and related workflows and processes. Moreover, you’ll be expected to work with Finance and HR to develop appropriate incentive and performance management programs and manage the team budget. </div><div><!--block--><br></div><div><!--block-->The ideal candidate has successfully managed a sales / business development team, which includes: achievement of pipeline creation targets, executed comprehensive hiring and skill-based training programs, created strong team culture, and developed motivating incentive and performance management plans. You have a bias toward action, willingness to roll up your sleeves, and a strong growth mindset. You’re passionate about running an efficient yet effective sales process, building a high velocity sales team, and being a key pillar of our go-to-market team. </div><br><br><div class=\"h3\">What you'll do:</div><ul style=\"\"><li style=\"\"><!--block-->Hire and onboard new SGMs</li><li style=\"\"><!--block-->Train SGMs to identify, contact, and created qualified agency opportunities </li><li style=\"\"><!--block-->Diligently track pipeline and performance metrics and provide regular 1:1 coaching and feedback </li><li style=\"\"><!--block-->Develop team processes and best practices</li><li style=\"\"><!--block-->Motivate, incentivize, and recognize team members to encourage top performance</li><li style=\"\"><!--block-->Accurately forecast weekly, monthly, quarterly, and annual SGM goal attainment</li><li style=\"\"><!--block-->Work closely with Sales Leadership to iterate on the agency recruitment process and identify areas of improvement across the SGM team </li><li style=\"\"><!--block-->Work closely with Marketing to develop effective messaging to convert prospective agencies to qualified opportunities </li><li style=\"\"><!--block-->Work closely with Finance and HR to develop effective incentive and performance management programs, along with managing the team budget</li></ul><br><br><div class=\"h3\">What you'll need: </div><ul style=\"\"><li style=\"\"><!--block-->Bachelor’s degree</li><li style=\"\"><!--block-->5+ years of mid-market / enterprise B2B experience managing business / sales development teams</li><li style=\"\"><!--block-->Experience working within an early-stage, high velocity startup</li><li style=\"\"><!--block-->Comfort with ambiguity; ability to be flexible in a rapidly changing environment</li><li style=\"\"><!--block-->Strong analytical abilities with a background in planning and managing through data</li><li style=\"\"><!--block-->Demonstrated success hitting and beating team quota</li><li style=\"\"><!--block-->Expertise in hiring, training, &amp; performance management across in-person / field sales teams</li><li style=\"\"><!--block-->Expertise in demand-generation strategies </li><li style=\"\"><!--block-->Expertise in sales engagement software and CRM (e.g., Salesforce, Hubspot, Salesloft, Outreach.io, etc.)</li></ul><div><!--block--><br></div><br><br><div class=\"h3\">How you'll be compensated:</div><ul style=\"\"><li style=\"\"><!--block-->Spark is committed to fair and equitable compensation practices. The base salary range for this role is currently $125,000 - $150,000 for NYC positions only. Salary ranges are determined through alignment with market data. The base salary amount offered is determined by a number of factors including the candidate’s experience, qualifications, and skills. This salary range may differ in other states.</li><li style=\"\"><!--block-->Uncapped commission tied to new Medicare enrollments</li><li style=\"\"><!--block-->Eligibility for equity</li></ul><div><!--block--><br></div><img src=\"https://remotive.com/job/track/1898070/blank.gif?source=public_api\" alt=\"\"/>","tags":"[\"team management\",\"sales development\",\"performance management\"]","pubDate":"2024-02-20 03:20:09.000","link":"https://remotive.com/remote-jobs/business/strategic-growth-leader-1898070","savedDate":"2024-02-21 17:59:14.557","slug":"strategic-growth-leader-spark-advisors-8741"},{"id":8027857751,"title":"Full Stack Engineer (Fully Remote)","company":"CoverGo","image":"https://pbs.twimg.com/profile_images/1382655628523364355/MWPIbbID_400x400.jpg","description":"<p><strong>Top 3 Reasons To Join Us</strong></p><ul> <li>Competitive Salary</li> <li>100% Remote</li> <li>Working on the latest tech for the Insurtech Market Leader</li> </ul><p><strong>About Us</strong></p><p>At CoverGo, our mission is to empower all insurance companies to make insurance 100% digital and accessible to everyone.</p><ul> <li>We are a leading global no-code insurance platform for health, life, and P&amp;C</li> <li>We’re the winner of the Insurtech of the Year in all of Asia and other awards globally</li> <li>We work with insurance enterprise clients such as AXA, Bupa, MSIG, Dai-ichi, Bank of China Group Insurance, and many more</li> <li>We're an international, diverse team of over 120 people with 30 nationalities and team members working remotely from all over the world</li> <li>We are fully funded and backed by reputable VC funds and strategic institutional investors</li> <li>We have a global presence in Asia, EMEA and the Americas</li> <li>We’ve grown our annualized revenue by over 30x since January 2021</li> <li>We’re constantly working towards making CoverGo a workplace that you love coming to. We deeply believe that bringing together a diversity of thoughts, expressions, and perspectives is key to building the best culture for equally diverse communities all over the world</li> </ul><p><strong>About the Role</strong></p><p>As a Full Stack Engineer at CoverGo, you will contribute to the ongoing development and enhancement of our innovative insurance enterprise software solutions. Showcase your proficiency with both front-end and back-end technologies. Collaborate with cross-functional teams, participate in code reviews, and contribute to maintaining code quality through testing. Investigate and address bugs promptly to ensure the reliability and security of our platform while staying informed about the latest technologies and best practices in software development.</p><p><strong>What You Will Do</strong></p><ul> <li>Contribute to the design, implementation, and maintenance of new features and functionalities for our SaaSplatform.</li> <li>Work with both front-end and back-end technologies.</li> <li>Collaborate with cross-functional teams to understand end-user requirements, translating them into scalable and efficient software solutions.</li> <li>Participate in code reviews, adhere to coding best practices, and contribute to maintaining code quality through unit and integration testing.</li> <li>Investigate and address bugs promptly to ensure the reliability of the platform.</li> <li>Contribute to ensuring security and compliance by following best practices and adhering to industry regulations.</li> <li>Stay informed about the latest technologies, frameworks, and best practices in software development.</li> </ul><p><strong>What We Need</strong></p><ul> <li>Proven experience of 4+ years as a Full Stack Engineer, with experience working on SaaS applications.</li> <li>Strong technical background with proficiency in front-end and back-end technologies, such as Java, Kotlin, Spring, Hibernate, Vue/React, PostgreSQL, and MongoDB. Experience with Docker and Kubernetes is advantageous.</li> <li>Familiarity with cloud platforms like AWS, Azure, or Google Cloud for building scalable applications</li> <li>Understanding of Test-Driven Development (TDD) principles.</li> <li>Experience with unit, integration and function testing using front-end and back-end testing libraries</li> <li>Understanding of web security best practices and compliance with industry regulations.</li> <li>Familiarity with container technologies like Docker and cloud infrastructure solutions.</li> <li>Experience in collaborating with cross-functional teams</li> <li>Excellent problem-solving skills and a proactive approach to troubleshooting and bug-fixing</li> <li>Strong communication skills to effectively interact with both technical and non-technical team members with diverse backgrounds</li> <li>A passion for staying updated with the latest trends, technologies, and best practices in software development</li> </ul><p><strong>Why You'll Love Working Here</strong></p><ul> <li>Fully Remote</li> <li>Flexible Leave</li> <li>International Environment</li> <li>Competitive renumeration package</li> <li>Performance Bonus</li> <li>Stock Options after 6 months </li> <li>Company activities and events</li> <li>Learning and development plan</li> </ul><p><strong>CoverGo Company</strong><a href=\"https://www.youtube.com/watch?v=YI0ezLxvFvA\" rel=\"nofollow noreferrer noopener\" class=\"external\"><strong> Video</strong></a></p><p>By submitting your application, you confirm that you have read, understood, and accepted the content of CoverGo’s <a href=\"https://apply.workable.com/covergo/gdpr_policy?lng=en\" target=\"_blank\" rel=\"nofollow noreferrer noopener\" class=\"external\">Privacy Notice</a> and you consent to the processing of your data as part of this application.</p><p><a href=\"https://www.youtube.com/watch?v=YI0ezLxvFvA\" rel=\"nofollow noreferrer noopener\" class=\"external\"></a></p><h3>Requirements: </h3><h3>Benefits: </h3>","tags":"[\"postgres\",\"mongo\",\"aws\"]","pubDate":"2024-02-20 00:00:00.000","link":"https://apply.workable.com/covergo/j/251776C282","savedDate":"2024-02-21 17:59:14.562","slug":"full-stack-engineer-fully-remote-covergo-1256"},{"id":9235188542,"title":"Lead Full Stack Engineer (Fully Remote)","company":"CoverGo","image":"https://pbs.twimg.com/profile_images/1382655628523364355/MWPIbbID_400x400.jpg","description":"<p><strong>Top 3 Reasons To Join Us</strong></p><ul> <li>Competitive Salary</li> <li>100% Remote</li> <li>Working on the latest tech for the Insurtech Market Leader</li> </ul><p><strong>About Us</strong></p><p>At CoverGo, our mission is to empower all insurance companies to make insurance 100% digital and accessible to everyone.</p><ul> <li>We are a leading global no-code insurance platform for health, life, and P&amp;C</li> <li>We’re the winner of the Insurtech of the Year in all of Asia and other awards globally</li> <li>We work with insurance enterprise clients such as AXA, Bupa, MSIG, Dai-ichi, Bank of China Group Insurance, and many more</li> <li>We're an international, diverse team of over 120 people with 30 nationalities and team members working remotely from all over the world</li> <li>We are fully funded and backed by reputable VC funds and strategic institutional investors</li> <li>We have a global presence in Asia, EMEA and the Americas</li> <li>We’ve grown our annualized revenue by over 30x since January 2021</li> <li>We’re constantly working towards making CoverGo a workplace that you love coming to. We deeply believe that bringing together a diversity of thoughts, expressions, and perspectives is key to building the best culture for equally diverse communities all over the world</li> </ul><p><strong>About the Role</strong></p><p>As the Lead Full Stack Engineer at CoverGo, you will take on a pivotal role in guiding the design, implementation, and maintenance of our innovative insurance enterprise software solutions. You will be responsible for providing direction to the team, working on both the front-end and back-end technologies, and ensuring scalable and efficient software solutions. Collaborate closely with cross-functional teams to understand end-user requirements, optimize application performance, and enforce coding best practices. Your role will encompass mentoring junior developers, driving innovation, and ensuring the continuous growth and success of our platform.</p><p><strong>What You Will Do</strong></p><ul> <li>Lead the design, implementation, and maintenance of our insurance enterprise software solutions, providing technical direction to the team.</li> <li>Demonstrate expertise in both front-end and back-end technologies, offering guidance on technology selection, architecture, and best practices.</li> <li>Collaborate with product, design, and engineering teams to understand requirements and technical concepts, ensuring cohesive and effective solutions with a seamless user experience.</li> <li>Optimize platform performance to handle large datasets and high user traffic, ensuring a smooth and responsive user experience.</li> <li>Conduct and lead code reviews, enforce best coding practices, and drive the adoption of standards to maintain high code quality.</li> <li>Investigate and promptly address bugs to uphold platform reliability.</li> <li>Ensure security and compliance by following best practices for securing web applications and adhering to relevant regulations.</li> <li>Stay abreast of the latest technologies, frameworks, and best practices, guiding the team in remaining competitive and innovative.</li> <li>Design the platform with scalability and flexibility, accommodating evolving features and changes as the user base grows.</li> <li>Provide mentorship and technical leadership to junior developers, fostering their growth and contribution to the team's objectives.</li> </ul><p><strong>What We Need</strong></p><ul> <li>Proven experience of 8+ years as a Full Stack Engineer, with a track record of leading complex SaaS applications.</li> <li>Strong technical background with proficiency in front-end and back-end technologies, such as Java, Kotlin, Spring, Hibernate, Vue/React, PostgreSQL, MongoDB, Docker, and Kubernetes</li> <li>Strong background in RESTful API design patterns with specifications in OpenAPI and Swagger. Familiarity with API Gateways provided by cloud platforms and others, such as Spring Cloud Gateway.&nbsp;</li> <li>Familiarity with cloud platforms like AWS, Azure, or Google Cloud for building scalable applications</li> <li>Minimum of 2 years in a senior or management role, with the ability to guide and inspire development teams</li> <li>Thorough understanding and practical experience with Test-Driven Development (TDD) to ensure robust and well-tested code</li> <li>Experience with unit, integration and function testing using front-end and back-end testing libraries</li> <li>In-depth knowledge of web security best practices and experience in ensuring compliance with industry regulations</li> <li>Demonstrated experience in performance optimization for high-traffic web applications</li> <li>Experience with container technologies like Docker and a very good understanding of cloud infrastructure and solutions.</li> <li>Experience in collaborating with cross-functional teams</li> <li>Excellent problem-solving skills and a proactive approach to troubleshooting and bug-fixing</li> <li>Strong communication skills to effectively interact with both technical and non-technical team members with diverse backgrounds</li> <li>A passion for staying updated with the latest trends, technologies, and best practices in software development</li> </ul><p><strong>Why You'll Love Working Here</strong></p><ul> <li>Fully Remote</li> <li>Flexible Leave</li> <li>International Environment</li> <li>Competitive renumeration package</li> <li>Performance Bonus</li> <li>Stock Options after 6 months </li> <li>Company activities and events</li> <li>Learning and development plan</li> </ul><p><strong>CoverGo Company</strong><a href=\"https://www.youtube.com/watch?v=YI0ezLxvFvA\" rel=\"nofollow noreferrer noopener\" class=\"external\"><strong> Video</strong></a></p><p>By submitting your application, you confirm that you have read, understood, and accepted the content of CoverGo’s <a href=\"https://apply.workable.com/covergo/gdpr_policy?lng=en\" target=\"_blank\" rel=\"nofollow noreferrer noopener\" class=\"external\">Privacy Notice</a> and you consent to the processing of your data as part of this application.</p><p><a href=\"https://www.youtube.com/watch?v=YI0ezLxvFvA\" rel=\"nofollow noreferrer noopener\" class=\"external\"></a></p><h3>Requirements: </h3><h3>Benefits: </h3>","tags":"[\"postgres\",\"management\",\"engineering\",\"mongo\",\"aws\"]","pubDate":"2024-02-20 00:00:00.000","link":"https://apply.workable.com/covergo/j/B0FF596CFB","savedDate":"2024-02-21 17:59:14.563","slug":"lead-full-stack-engineer-fully-remote-covergo-2513"},{"id":5021069955,"title":"Senior DevOps Engineer","company":"CoverGo","image":"https://pbs.twimg.com/profile_images/1382655628523364355/MWPIbbID_400x400.jpg","description":"<p><strong>Top 3 Reasons To Join Us</strong></p><ul> <li>Competitive Salary</li> <li>100% Remote</li> <li>Working on the latest tech for the Insurtech Market Leader</li> </ul><p><strong>About Us</strong></p><p>At CoverGo, our mission is to empower all insurance companies to make insurance 100% digital and accessible to everyone.</p><ul> <li>We are a leading global no-code insurance platform for health, life, and P&amp;C</li> <li>We’re the winner of the Insurtech of the Year in all of Asia and other awards globally</li> <li>We work with insurance enterprise clients such as AXA, Bupa, MSIG, Dai-ichi, Bank of China Group Insurance, and many more</li> <li>We're an international, diverse team of over 120 people with 30 nationalities and team members working remotely from all over the world</li> <li>We are fully funded and backed by reputable VC funds and strategic institutional investors</li> <li>We have a global presence in Asia, EMEA and the Americas</li> <li>We’ve grown our annualized revenue by over 30x since January 2021</li> <li>We’re constantly working towards making CoverGo a workplace that you love coming to. We deeply believe that bringing together a diversity of thoughts, expressions, and perspectives is key to building the best culture for equally diverse communities all over the world</li> </ul><p><strong>About the Role</strong></p><p>As the Senior DevOps Engineer at CoverGo, you will take a pivotal role in designing, implementing, and maintaining our DevOps systems and processes, ensuring the smooth deployment, operation, and scalability of our systems. You will focus on enhancing the efficiency and security of our IT infrastructure and guide the design, automation, and deployment of software changes, ensuring continuous, secure, and bug-free delivery. Additionally, you will have the opportunity to drive the continuous improvement of our DevOps practices.</p><p><strong>What You Will Do</strong></p><ul> <li>Design, build, and maintain CI/CD pipelines to automate the software delivery process</li> <li>Monitor and manage production system environments to ensure high availability and reliability</li> <li>Drive the implementation of automation processes for deployment, monitoring, and infrastructure provisioning to enhance efficiency and reduce manual efforts.</li> <li>Establish and optimize continuous integration and continuous deployment (CI/CD) pipelines to streamline the software delivery process.</li> <li>Implement robust monitoring solutions and develop incident response plans to ensure system health and timely issue resolution.</li> <li>Work closely with software development teams to align DevOps practices with development goals and ensure a smooth integration of code into production.</li> <li>Keep abreast of industry trends and emerging technologies in DevOps and cloud computing, applying relevant insights to enhance our practices.</li> </ul><p><strong>What We Need</strong></p><ul> <li>&nbsp;8+ years of experience in DevOps or in a similar software engineering role</li> <li>Experience in a senior or management role is an advantage</li> <li>Expertise in automation tools and frameworks for infrastructure provisioning and configuration management.</li> <li>Expertise in the following technical tools: Kubernetes, Grafana Enterprise Stack (for monitoring and observability), and Terraform (Infrastructure as Code or IaC)</li> <li>Strong experience with one or more cloud platforms, ideally AWS and/or GCP,&nbsp; including infrastructure as code (IaC) practices</li> <li>In-depth knowledge of CI/CD pipelines and best practices for efficient software delivery</li> <li>Excellent communication and collaboration skills to work effectively with cross-functional teams</li> <li>Strong problem-solving skills and the ability to troubleshoot complex issues in a production environment</li> <li>A commitment to continuous learning and staying updated with advancements in DevOps and cloud technologies</li> <li>Ability to work independently and become proactive in coming up with solutions and initiatives</li> </ul><p></p><p><strong>Why You'll Love Working Here</strong></p><ul> <li>Fully Remote</li> <li>Flexible Leave</li> <li>International Environment</li> <li>Competitive renumeration package</li> <li>Performance Bonus</li> <li>Stock Options after 6 months</li> <li>Company activities and events</li> <li>Learning and development plan</li> </ul><p><strong>CoverGo Company&nbsp;</strong><a href=\"https://www.youtube.com/watch?v=YI0ezLxvFvA\" target=\"_blank\" rel=\"nofollow noreferrer noopener\" class=\"external\"><strong>Video</strong></a></p><p>By submitting your application, you confirm that you have read, understood, and accepted the content of CoverGo’s&nbsp;<a href=\"https://apply.workable.com/covergo/gdpr_policy?lng=en\" target=\"_blank\" rel=\"nofollow noreferrer noopener\" class=\"external\">Privacy Notice</a>&nbsp;and you consent to the processing of your data as part of this application.</p><h3>Requirements: </h3><h3>Benefits: </h3>","tags":"[\"management\",\"engineering\",\"aws\"]","pubDate":"2024-02-20 00:00:00.000","link":"https://apply.workable.com/covergo/j/41478A85C3","savedDate":"2024-02-21 17:59:14.563","slug":"senior-devops-engineer-covergo-2150"},{"id":9905385312,"title":"Full Stack Engineer (Fully Remote)","company":"CoverGo","image":"https://pbs.twimg.com/profile_images/1382655628523364355/MWPIbbID_400x400.jpg","description":"<p><strong>Top 3 Reasons To Join Us</strong></p><ul> <li>Competitive Salary</li> <li>100% Remote</li> <li>Working on the latest tech for the Insurtech Market Leader</li> </ul><p><strong>About Us</strong></p><p>At CoverGo, our mission is to empower all insurance companies to make insurance 100% digital and accessible to everyone.</p><ul> <li>We are a leading global no-code insurance platform for health, life, and P&amp;C</li> <li>We’re the winner of the Insurtech of the Year in all of Asia and other awards globally</li> <li>We work with insurance enterprise clients such as AXA, Bupa, MSIG, Dai-ichi, Bank of China Group Insurance, and many more</li> <li>We're an international, diverse team of over 120 people with 30 nationalities and team members working remotely from all over the world</li> <li>We are fully funded and backed by reputable VC funds and strategic institutional investors</li> <li>We have a global presence in Asia, EMEA and the Americas</li> <li>We’ve grown our annualized revenue by over 30x since January 2021</li> <li>We’re constantly working towards making CoverGo a workplace that you love coming to. We deeply believe that bringing together a diversity of thoughts, expressions, and perspectives is key to building the best culture for equally diverse communities all over the world</li> </ul><p><strong>About the Role</strong></p><p>As a Full Stack Engineer at CoverGo, you will contribute to the ongoing development and enhancement of our innovative insurance enterprise software solutions. Showcase your proficiency with both front-end and back-end technologies. Collaborate with cross-functional teams, participate in code reviews, and contribute to maintaining code quality through testing. Investigate and address bugs promptly to ensure the reliability and security of our platform while staying informed about the latest technologies and best practices in software development.</p><p><strong>What You Will Do</strong></p><ul> <li>Contribute to the design, implementation, and maintenance of new features and functionalities for our SaaSplatform.</li> <li>Work with both front-end and back-end technologies.</li> <li>Collaborate with cross-functional teams to understand end-user requirements, translating them into scalable and efficient software solutions.</li> <li>Participate in code reviews, adhere to coding best practices, and contribute to maintaining code quality through unit and integration testing.</li> <li>Investigate and address bugs promptly to ensure the reliability of the platform.</li> <li>Contribute to ensuring security and compliance by following best practices and adhering to industry regulations.</li> <li>Stay informed about the latest technologies, frameworks, and best practices in software development.</li> </ul><p><strong>What We Need</strong></p><ul> <li>Proven experience of 4+ years as a Full Stack Engineer, with experience working on SaaS applications.</li> <li>Strong technical background with proficiency in front-end and back-end technologies, such as Java, Kotlin, Spring, Hibernate, Vue/React, PostgreSQL, and MongoDB. Experience with Docker and Kubernetes is advantageous.</li> <li>Familiarity with cloud platforms like AWS, Azure, or Google Cloud for building scalable applications</li> <li>Understanding of Test-Driven Development (TDD) principles.</li> <li>Experience with unit, integration and function testing using front-end and back-end testing libraries</li> <li>Understanding of web security best practices and compliance with industry regulations.</li> <li>Familiarity with container technologies like Docker and cloud infrastructure solutions.</li> <li>Experience in collaborating with cross-functional teams</li> <li>Excellent problem-solving skills and a proactive approach to troubleshooting and bug-fixing</li> <li>Strong communication skills to effectively interact with both technical and non-technical team members with diverse backgrounds</li> <li>A passion for staying updated with the latest trends, technologies, and best practices in software development</li> </ul><p><strong>Why You'll Love Working Here</strong></p><ul> <li>Fully Remote</li> <li>Flexible Leave</li> <li>International Environment</li> <li>Competitive renumeration package</li> <li>Performance Bonus</li> <li>Stock Options after 6 months </li> <li>Company activities and events</li> <li>Learning and development plan</li> </ul><p><strong>CoverGo Company</strong><a href=\"https://www.youtube.com/watch?v=YI0ezLxvFvA\" rel=\"nofollow noreferrer noopener\" class=\"external\"><strong> Video</strong></a></p><p>By submitting your application, you confirm that you have read, understood, and accepted the content of CoverGo’s <a href=\"https://apply.workable.com/covergo/gdpr_policy?lng=en\" target=\"_blank\" rel=\"nofollow noreferrer noopener\" class=\"external\">Privacy Notice</a> and you consent to the processing of your data as part of this application.</p><p><a href=\"https://www.youtube.com/watch?v=YI0ezLxvFvA\" rel=\"nofollow noreferrer noopener\" class=\"external\"></a></p><h3>Requirements: </h3><h3>Benefits: </h3>","tags":"[\"postgres\",\"mongo\",\"aws\"]","pubDate":"2024-02-20 00:00:00.000","link":"https://apply.workable.com/covergo/j/B398A32C28","savedDate":"2024-02-21 17:59:14.563","slug":"full-stack-engineer-fully-remote-covergo-258"},{"id":5490552741,"title":"Lead Full Stack Engineer (Fully Remote)","company":"CoverGo","image":"https://pbs.twimg.com/profile_images/1382655628523364355/MWPIbbID_400x400.jpg","description":"<p><strong>Top 3 Reasons To Join Us</strong></p><ul> <li>Competitive Salary</li> <li>100% Remote</li> <li>Working on the latest tech for the Insurtech Market Leader</li> </ul><p><strong>About Us</strong></p><p>At CoverGo, our mission is to empower all insurance companies to make insurance 100% digital and accessible to everyone.</p><ul> <li>We are a leading global no-code insurance platform for health, life, and P&amp;C</li> <li>We’re the winner of the Insurtech of the Year in all of Asia and other awards globally</li> <li>We work with insurance enterprise clients such as AXA, Bupa, MSIG, Dai-ichi, Bank of China Group Insurance, and many more</li> <li>We're an international, diverse team of over 120 people with 30 nationalities and team members working remotely from all over the world</li> <li>We are fully funded and backed by reputable VC funds and strategic institutional investors</li> <li>We have a global presence in Asia, EMEA and the Americas</li> <li>We’ve grown our annualized revenue by over 30x since January 2021</li> <li>We’re constantly working towards making CoverGo a workplace that you love coming to. We deeply believe that bringing together a diversity of thoughts, expressions, and perspectives is key to building the best culture for equally diverse communities all over the world</li> </ul><p><strong>About the Role</strong></p><p>As the Lead Full Stack Engineer at CoverGo, you will take on a pivotal role in guiding the design, implementation, and maintenance of our innovative insurance enterprise software solutions. You will be responsible for providing direction to the team, working on both the front-end and back-end technologies, and ensuring scalable and efficient software solutions. Collaborate closely with cross-functional teams to understand end-user requirements, optimize application performance, and enforce coding best practices. Your role will encompass mentoring junior developers, driving innovation, and ensuring the continuous growth and success of our platform.</p><p><strong>What You Will Do</strong></p><ul> <li>Lead the design, implementation, and maintenance of our insurance enterprise software solutions, providing technical direction to the team.</li> <li>Demonstrate expertise in both front-end and back-end technologies, offering guidance on technology selection, architecture, and best practices.</li> <li>Collaborate with product, design, and engineering teams to understand requirements and technical concepts, ensuring cohesive and effective solutions with a seamless user experience.</li> <li>Optimize platform performance to handle large datasets and high user traffic, ensuring a smooth and responsive user experience.</li> <li>Conduct and lead code reviews, enforce best coding practices, and drive the adoption of standards to maintain high code quality.</li> <li>Investigate and promptly address bugs to uphold platform reliability.</li> <li>Ensure security and compliance by following best practices for securing web applications and adhering to relevant regulations.</li> <li>Stay abreast of the latest technologies, frameworks, and best practices, guiding the team in remaining competitive and innovative.</li> <li>Design the platform with scalability and flexibility, accommodating evolving features and changes as the user base grows.</li> <li>Provide mentorship and technical leadership to junior developers, fostering their growth and contribution to the team's objectives.</li> </ul><p><strong>What We Need</strong></p><ul> <li>Proven experience of 8+ years as a Full Stack Engineer, with a track record of leading complex SaaS applications.</li> <li>Strong technical background with proficiency in front-end and back-end technologies, such as Java, Kotlin, Spring, Hibernate, Vue/React, PostgreSQL, MongoDB, Docker, and Kubernetes</li> <li>Strong background in RESTful API design patterns with specifications in OpenAPI and Swagger. Familiarity with API Gateways provided by cloud platforms and others, such as Spring Cloud Gateway.&nbsp;</li> <li>Familiarity with cloud platforms like AWS, Azure, or Google Cloud for building scalable applications</li> <li>Minimum of 2 years in a senior or management role, with the ability to guide and inspire development teams</li> <li>Thorough understanding and practical experience with Test-Driven Development (TDD) to ensure robust and well-tested code</li> <li>Experience with unit, integration and function testing using front-end and back-end testing libraries</li> <li>In-depth knowledge of web security best practices and experience in ensuring compliance with industry regulations</li> <li>Demonstrated experience in performance optimization for high-traffic web applications</li> <li>Experience with container technologies like Docker and a very good understanding of cloud infrastructure and solutions.</li> <li>Experience in collaborating with cross-functional teams</li> <li>Excellent problem-solving skills and a proactive approach to troubleshooting and bug-fixing</li> <li>Strong communication skills to effectively interact with both technical and non-technical team members with diverse backgrounds</li> <li>A passion for staying updated with the latest trends, technologies, and best practices in software development</li> </ul><p><strong>Why You'll Love Working Here</strong></p><ul> <li>Fully Remote</li> <li>Flexible Leave</li> <li>International Environment</li> <li>Competitive renumeration package</li> <li>Performance Bonus</li> <li>Stock Options after 6 months </li> <li>Company activities and events</li> <li>Learning and development plan</li> </ul><p><strong>CoverGo Company</strong><a href=\"https://www.youtube.com/watch?v=YI0ezLxvFvA\" rel=\"nofollow noreferrer noopener\" class=\"external\"><strong> Video</strong></a></p><p>By submitting your application, you confirm that you have read, understood, and accepted the content of CoverGo’s <a href=\"https://apply.workable.com/covergo/gdpr_policy?lng=en\" target=\"_blank\" rel=\"nofollow noreferrer noopener\" class=\"external\">Privacy Notice</a> and you consent to the processing of your data as part of this application.</p><p><a href=\"https://www.youtube.com/watch?v=YI0ezLxvFvA\" rel=\"nofollow noreferrer noopener\" class=\"external\"></a></p><h3>Requirements: </h3><h3>Benefits: </h3>","tags":"[\"postgres\",\"management\",\"engineering\",\"mongo\",\"aws\"]","pubDate":"2024-02-20 00:00:00.000","link":"https://apply.workable.com/covergo/j/0F2BF7C828","savedDate":"2024-02-21 17:59:14.563","slug":"lead-full-stack-engineer-fully-remote-covergo-4784"},{"id":1900357436,"title":"Senior Python Developer - Remote/Work Anywhere","company":"CloudLinux","image":"https://pbs.twimg.com/profile_images/696718028084482050/ymY3OEPk_400x400.png","description":"<p>CloudLinux is a global remote-first company. We are driven by our principles: Do the right thing, employees first, we are remote first, and&nbsp;we deliver high volume, low-cost Linux infrastructure and security products that help companies to increase the efficiency of their operations. Every person on our team supports each other and does what we can to ensure we all are successful.&nbsp;</p><p>We are truly a great place to work. </p><p>As an Engineer in the Innovation Release Engineering Team, you'll play a vital role in our department. Your focus will be on developing, prototyping, enhancing, and supporting software solutions that aim to improve internal company processes. We're looking for someone who brings a combination of creativity, technical expertise, and a problem-solving mindset to deliver reliable and efficient solutions that can be scaled across the entire company.</p><h3></h3><p><strong>Key Responsibilities:</strong></p><ul> <li> <strong>Develop Software Solutions:</strong> You'll be responsible for designing and implementing software solutions that streamline internal processes, enhance efficiency, and contribute to cost reduction. Your work will support the company's scaling efforts.</li> <li> <strong>Prototype Development:</strong> You'll creatively approach problem-solving by developing multiple prototypes for the same issue. This will enable the team to explore various solutions and select the most effective one.</li> <li> <strong>Solution Enhancement and Support:</strong> You'll take ownership of refining prototypes, enhancing their functionality, ensuring their reliability, and offering support as these solutions are adopted by various teams within the company.</li> <li> <strong>Problem Investigation:</strong> It'll be your responsibility to proactively identify and investigate issues that arise during development and in deployed solutions. You'll employ up-to-date technologies and best practices to find innovative solutions.</li> <li> <strong>Collaboration and Innovation:</strong> You'll work closely with team members and stakeholders across the company to understand needs, gather feedback, and continuously improve our solutions and processes.</li> </ul><h3>Requirements: </h3><p><strong>To excel in this role, you need:</strong></p><ul> <li>At least 4 years of hands-on experience in Python programming.</li> <li>Proficiency in System programming, including Sockets, filesystem, and process management.</li> <li>A strong command over the GNU/Linux operating system and shell scripting abilities.</li> <li>Experience with git-based development processes.</li> <li>Familiarity with PyTest.</li> <li>Intermediate level of English language proficiency.</li> <li>Knowledge of relation databases, along with familiarity in the SQL language (PostgreSQL would be perfect).</li> </ul><p></p><p><strong>It would be great if you also have:</strong></p><ul> <li>Familiarity with Ansible, Jenkins, Docker.</li> <li>Experience in rpm/deb package management (writing rpm spec, deb rules).</li> <li>Capability of performing basic DevOps operations, like setting up testing and production environments.</li> </ul><p></p><p><strong>In addition, it is essential that you:</strong></p><ul> <li>Are quick to learn and proactive.</li> <li>Possess a high level of self-motivation and determination to accomplish set goals.</li> <li>Can independently analyze tasks and identify optimal solutions.</li> <li>Excel in collaboration and thrive in team-based environments.</li> <li>Have the versatility to switch between robust production development and speedy rough prototype implementation.</li> </ul><h3>Benefits: </h3><p><strong>What's in it for you?</strong></p><ul> <li>A focus on professional development; </li> <li>Interesting and challenging projects</li> <li> Flexible working hours</li> <li>Paid one month of vacation per year and unlimited sick leave</li> <li>Medical insurance reimbursement</li> <li>Co-working and gym/sports reimbursement</li> <li>The opportunity to receive a reward for the most innovative idea that the company can patent</li> </ul><p></p><p><em>By applying for this position, you agree with </em><a href=\"https://cloudlinux.com/privacy-policy\" rel=\"nofollow noreferrer noopener\" class=\"external\"><em>Cloudlinux Privacy Policy</em></a><em> and give us your consent to maintain and process your personal data with this respect. Please read our Privacy Policy for more information.</em></p>","tags":"[\"postgres\",\"management\",\"engineering\",\"database\"]","pubDate":"2024-02-19 00:00:00.000","link":"https://apply.workable.com/cloudlinux-1/j/B981C67ABF","savedDate":"2024-02-21 17:59:14.561","slug":"senior-python-developer-remote-work-anywhere-cloudlinux-4748"},{"id":3726795141,"title":"Senior Full Stack Engineer (Fully Remote)","company":"CoverGo","image":"https://pbs.twimg.com/profile_images/1382655628523364355/MWPIbbID_400x400.jpg","description":"<p><strong>Top 3 Reasons To Join Us</strong></p><ul> <li>Competitive Salary</li> <li>100% Remote</li> <li>Working on the latest tech for the Insurtech Market Leader</li> </ul><p><strong>About Us</strong></p><p>At CoverGo, our mission is to empower all insurance companies to make insurance 100% digital and accessible to everyone.</p><ul> <li>We are a leading global no-code insurance platform for health, life, and P&amp;C</li> <li>We’re the winner of the Insurtech of the Year in all of Asia and other awards globally</li> <li>We work with insurance enterprise clients such as AXA, Bupa, MSIG, Dai-ichi, Bank of China Group Insurance, and many more</li> <li>We're an international, diverse team of over 120 people with 30 nationalities and team members working remotely from all over the world</li> <li>We are fully funded and backed by reputable VC funds and strategic institutional investors</li> <li>We have a global presence in Asia, EMEA and the Americas</li> <li>We’ve grown our annualized revenue by over 30x since January 2021</li> <li>We’re constantly working towards making CoverGo a workplace that you love coming to. We deeply believe that bringing together a diversity of thoughts, expressions, and perspectives is key to building the best culture for equally diverse communities all over the world</li> </ul><p><strong>What You Will Do</strong></p><ul> <li>Design, implement and maintain new features and functionalities for the SAAS platform, understanding the requirements of insurance businesses and translating them into scalable and efficient software solutions</li> <li>Work on both the front-end and back-end of the application, demonstrating expertise in various technologies, frameworks, and programming languages</li> <li>Work collaboratively with product, design, engineering teams, and UX designers to understand end-user requirements, use cases, and technical concepts, translating them into a cohesive and effective solution while ensuring a seamless user experience.</li> <li>Optimize the performance of the application to handle large amounts of data and high user traffic, delivering a smooth user experience</li> <li>Participate in code reviews and enforce best coding practices, while also writing and executing unit tests and integration tests to maintain code quality</li> <li>Investigate and promptly fix bugs to maintain the reliability of the platform</li> <li>Ensure security and compliance by following best practices for securing web applications and adhering to relevant regulations in handling sensitive customer data</li> <li>Stay up-to-date with the latest technologies, frameworks, and best practices to ensure we remain competitive and innovative </li> <li>Design the platform with scalability and flexibility in mind, accommodating new features and changes as the number of clients and users grows</li> <li>Provide mentorship to junior developers, aiding in their technical growth and effective contribution to the team's goals</li> </ul><p><strong>What We Need</strong></p><ul> <li>Proven experience 7 years as a Full Stack Engineer, working on complex SAAS applications</li> <li>Strong technical background with proficiency in front-end and back-end technologies, such as JavaScript, Vue, .NET Core, C#, GraphQL, MongoDB, Docker</li> <li>Familiarity with cloud platforms like AWS, Azure, or Google Cloud for building scalable applications</li> <li>Thorough understanding and practical experience with Test-Driven Development (TDD) to ensure robust and well-tested code</li> <li>Experience with unit, integration and function testing using front-end and back-end testing libraries</li> <li>Proficiency in Domain-Driven Design (DDD) principles to create a maintainable and modular architecture that aligns with business domains</li> <li>In-depth knowledge of web security best practices and experience in ensuring compliance with industry regulations</li> <li>Demonstrated experience in performance optimization for high-traffic web applications</li> <li>Experience with container technologies like docker and good understanding of cloud infrastructure and solutions.</li> <li>Experience with agile development methodologies and collaborating with cross-functional teams</li> <li>Excellent problem-solving skills and a proactive approach to troubleshooting and bug fixing</li> <li>Strong communication skills to effectively interact with both technical and non-technical team members with diverse backgrounds</li> <li>A passion for staying updated with the latest trends, technologies, and best practices in software development</li> </ul><p><strong>Why You'll Love Working Here</strong></p><ul> <li>Fully Remote</li> <li>Flexible Leave</li> <li>International Environment</li> <li>Competitive renumeration package</li> <li>Performance Bonus</li> <li>Stock Options after 6 months </li> <li>Company activities and events</li> <li>Learning and development plan</li> </ul><p><strong>CoverGo Company</strong><a href=\"https://www.youtube.com/watch?v=YI0ezLxvFvA\" rel=\"nofollow noreferrer noopener\" class=\"external\"><strong> Video</strong></a></p><p>By submitting your application, you confirm that you have read, understood, and accepted the content of CoverGo’s <a target=\"_blank\" href=\"https://apply.workable.com/covergo/gdpr_policy?lng=en\" rel=\"nofollow noreferrer noopener\" class=\"external\">Privacy Notice</a> and you consent to the processing of your data as part of this application.</p><p><a href=\"https://www.youtube.com/watch?v=YI0ezLxvFvA\" rel=\"nofollow noreferrer noopener\" class=\"external\"></a></p><h3>Requirements: </h3><h3>Benefits: </h3>","tags":"[\"javascript\",\"engineering\",\"mongo\",\"aws\"]","pubDate":"2024-02-19 00:00:00.000","link":"https://apply.workable.com/covergo/j/5FA014AB4B","savedDate":"2024-02-21 17:59:14.563","slug":"senior-full-stack-engineer-fully-remote-covergo-4989"},{"id":4367758786,"title":"Senior Full Stack Engineer (Fully Remote)","company":"CoverGo","image":"https://pbs.twimg.com/profile_images/1382655628523364355/MWPIbbID_400x400.jpg","description":"<p><strong>Top 3 Reasons To Join Us</strong></p><ul> <li>Competitive Salary</li> <li>100% Remote</li> <li>Working on the latest tech for the Insurtech Market Leader</li> </ul><p><strong>About Us</strong></p><p>At CoverGo, our mission is to empower all insurance companies to make insurance 100% digital and accessible to everyone.</p><ul> <li>We are a leading global no-code insurance platform for health, life, and P&amp;C</li> <li>We’re the winner of the Insurtech of the Year in all of Asia and other awards globally</li> <li>We work with insurance enterprise clients such as AXA, Bupa, MSIG, Dai-ichi, Bank of China Group Insurance, and many more</li> <li>We're an international, diverse team of over 120 people with 30 nationalities and team members working remotely from all over the world</li> <li>We are fully funded and backed by reputable VC funds and strategic institutional investors</li> <li>We have a global presence in Asia, EMEA and the Americas</li> <li>We’ve grown our annualized revenue by over 30x since January 2021</li> <li>We’re constantly working towards making CoverGo a workplace that you love coming to. We deeply believe that bringing together a diversity of thoughts, expressions, and perspectives is key to building the best culture for equally diverse communities all over the world</li> </ul><p><strong>What You Will Do</strong></p><ul> <li>Design, implement and maintain new features and functionalities for the SAAS platform, understanding the requirements of insurance businesses and translating them into scalable and efficient software solutions</li> <li>Work on both the front-end and back-end of the application, demonstrating expertise in various technologies, frameworks, and programming languages</li> <li>Work collaboratively with product, design, engineering teams, and UX designers to understand end-user requirements, use cases, and technical concepts, translating them into a cohesive and effective solution while ensuring a seamless user experience.</li> <li>Optimize the performance of the application to handle large amounts of data and high user traffic, delivering a smooth user experience</li> <li>Participate in code reviews and enforce best coding practices, while also writing and executing unit tests and integration tests to maintain code quality</li> <li>Investigate and promptly fix bugs to maintain the reliability of the platform</li> <li>Ensure security and compliance by following best practices for securing web applications and adhering to relevant regulations in handling sensitive customer data</li> <li>Stay up-to-date with the latest technologies, frameworks, and best practices to ensure we remain competitive and innovative </li> <li>Design the platform with scalability and flexibility in mind, accommodating new features and changes as the number of clients and users grows</li> <li>Provide mentorship to junior developers, aiding in their technical growth and effective contribution to the team's goals</li> </ul><p><strong>What We Need</strong></p><ul> <li>Proven experience 7 years as a Full Stack Engineer, working on complex SAAS applications</li> <li>Strong technical background with proficiency in front-end and back-end technologies, such as JavaScript, Vue, .NET Core, C#, GraphQL, MongoDB, Docker</li> <li>Familiarity with cloud platforms like AWS, Azure, or Google Cloud for building scalable applications</li> <li>Thorough understanding and practical experience with Test-Driven Development (TDD) to ensure robust and well-tested code</li> <li>Experience with unit, integration and function testing using front-end and back-end testing libraries</li> <li>Proficiency in Domain-Driven Design (DDD) principles to create a maintainable and modular architecture that aligns with business domains</li> <li>In-depth knowledge of web security best practices and experience in ensuring compliance with industry regulations</li> <li>Demonstrated experience in performance optimization for high-traffic web applications</li> <li>Experience with container technologies like docker and good understanding of cloud infrastructure and solutions.</li> <li>Experience with agile development methodologies and collaborating with cross-functional teams</li> <li>Excellent problem-solving skills and a proactive approach to troubleshooting and bug fixing</li> <li>Strong communication skills to effectively interact with both technical and non-technical team members with diverse backgrounds</li> <li>A passion for staying updated with the latest trends, technologies, and best practices in software development</li> </ul><p><strong>Why You'll Love Working Here</strong></p><ul> <li>Fully Remote</li> <li>Flexible Leave</li> <li>International Environment</li> <li>Competitive renumeration package</li> <li>Performance Bonus</li> <li>Stock Options after 6 months </li> <li>Company activities and events</li> <li>Learning and development plan</li> </ul><p><strong>CoverGo Company</strong><a href=\"https://www.youtube.com/watch?v=YI0ezLxvFvA\" rel=\"nofollow noreferrer noopener\" class=\"external\"><strong> Video</strong></a></p><p>By submitting your application, you confirm that you have read, understood, and accepted the content of CoverGo’s <a target=\"_blank\" href=\"https://apply.workable.com/covergo/gdpr_policy?lng=en\" rel=\"nofollow noreferrer noopener\" class=\"external\">Privacy Notice</a> and you consent to the processing of your data as part of this application.</p><p><a href=\"https://www.youtube.com/watch?v=YI0ezLxvFvA\" rel=\"nofollow noreferrer noopener\" class=\"external\"></a></p><h3>Requirements: </h3><h3>Benefits: </h3>","tags":"[\"javascript\",\"engineering\",\"mongo\",\"aws\"]","pubDate":"2024-02-19 00:00:00.000","link":"https://apply.workable.com/covergo/j/E884EA5B7C","savedDate":"2024-02-21 17:59:14.564","slug":"senior-full-stack-engineer-fully-remote-covergo-3295"},{"id":1027880885,"title":"Director, People Operations (Remote)","company":"DuckDuckGo","image":"https://spreadprivacy.com/content/images/2023/05/duckduckgo-logo_wide.png","description":"<p>Hi, we’re DuckDuckGo, the Internet privacy company for everyone who wants to take back their privacy now. For over a decade, we've been building our all-in-one product, developing new privacy technology, and working with policymakers to make online privacy simple and accessible for all. </p>\n<p><br /></p>\n<p>Our app is now downloaded more than 78M times a year, and our private search engine packaged with it has become the #2 search engine on mobile in the United States and 18 other countries, including the United Kingdom, Canada, Australia, Germany, and the Netherlands. Oh, and we've been profitable since 2014, with revenue exceeding $100 million a year! Now, we’re rolling out a suite of new privacy solutions, including <u><a href=\"https://www.spreadprivacy.com/introducing-email-protection-beta/\" rel=\"noopener\">Email Protection</a></u>,  <u><a href=\"https://spreadprivacy.com/introducing-app-tracking-protection/\" rel=\"noopener\">App Tracking Protection</a></u> and our first-ever Desktop Apps for <u><a href=\"https://spreadprivacy.com/introducing-duckduckgo-for-mac/\" rel=\"noopener\">Mac</a></u><a href=\"https://spreadprivacy.com/introducing-duckduckgo-for-mac/\" rel=\"noopener\"> </a>and <u><a href=\"https://spreadprivacy.com/windows-browser-open-beta/\" rel=\"noopener\">Windows</a></u>.</p>\n<p><br /></p>\n<p>We’re looking for a Director, People Operations to continue building the fabric of our organisation, which empowers everyone to shape our all-in-one privacy solution and accelerate our mission; to show the world that protecting your privacy online can be simple.  </p>\n<p><br /></p>\n<p><strong>The Opportunity</strong> </p>\n<p>In this role, you will drive business-critical work forward by improving organizational effectiveness — enabling team member performance and engagement, empowering managers across teams and functions, and supervising general HR operations. You'll also be responsible for evaluating the success of our end-to-end performance review cycles, while adapting and scaling these review processes to meet DuckDuckGo's needs as we continue to grow.</p>\n<p><br /></p>\n<p>As a key contributor to one of our highest-priority objectives, you'll use data to develop strategic direction focused on team satisfaction, and execute your vision by leading and advising on initiatives within it. You will also identify new areas of opportunity that could positively impact our organizational effectiveness, such as scaling existing processes and coaching others to do the same.</p>\n<p><br /></p>\n<p>Leveraging your broad leadership skills, you will support a group of talented People Operation Partners in identifying high-impact projects that allow our team members to maximize impact and enable organizational and individual growth. You can expect your work to be data-driven, but also expect our Privacy mission and values to require creativity, where you may need to identify proxy metrics and continually adjust assumptions to communicate and evaluate success.</p>\n<p><br /></p>\n<p><strong>What You Will Bring to DuckDuckGo </strong></p>\n<ul><li>10+ years of experience in People Operations with 4+ years of experience in leadership roles (Head, Director, etc.).</li><li>Deep People Ops functional expertise across multiple domains, specifically performance management, employee relations, recognition, engagement, manager enablement, and other HR operations for a scaling tech company.</li><li>Expert-level coaching and leadership skills. </li><li>Experience scaling a People Operations team and establishing efficient processes for specialties (eg, benefits, performance).</li><li>Demonstrated ability to prioritize critical People Ops work to maximize impact effectively.</li><li>Ability to apply compassion, consistency, and a high level of discretion in complex People Ops scenarios.</li><li>Pragmatic and analytical, with a proven track record of creating data-driven People Ops strategies for global, remote tech organizations.</li><li>Demonstrated ability to empower managers as an organization is scaling.</li><li>Experience creating complex systems from scratch.</li></ul>\n<p><strong><br /></strong></p>\n<p><strong>How We Will Support You </strong> </p>\n<p>Our core values -- build trust, question assumptions, and validate direction -- underpin how we work day-to-day and the support we give our team members. We strive to empower our team members to be self-directed and self-motivated in their work.  <br /></p>\n<p><br /></p>\n<ul><li><strong>Remote First, Always</strong>: We've always been a fully distributed company with team members all over the world. We trust you to get your work done wherever, and whenever.   </li><li><strong>Commitment to Personal Growth:</strong> Every team member has an annual budget of $1,250 USD to invest in their professional development. For team members in designated leadership roles, we offer reimbursement for leadership coaching services. The reimbursement amount varies by professional level. Every team member also has a dedicated Career Advisor, who serves as a guide to help you develop your strengths, identify your motivations, and understand your opportunities for growth. </li><li><strong>Leadership:</strong> We have many different types of leaders and possible combinations of leadership roles, so you can grow your career in a way that aligns best with your personal goals. You can seek additional leadership roles by being directly responsible for projects, taking ownership of areas of the company, developing and maintaining internal processes, or pursuing advisory roles. </li><li><strong>Work/Life Balance: </strong>Team members have the freedom and flexibility to organize their own work schedules. We want you to thrive both in and out of the office. We trust you to use good judgment and take the time off that you need to bring your best self to work.</li></ul>\n<p>We also offer paid parental leave, a co-working stipend, office setup reimbursement, and a wellness stipend. More support resources can be found in our <u><a href=\"https://duckduckgo.com/assets/hiring/team_support_guide.pdf\" rel=\"noopener\">Team Member Support Guide</a></u>, which explains how we make your well-being a priority. <br /></p>\n<p>For more information on how we collaborate worldwide, from leadership in our relatively flat organization to start-to-finish ownership<strong>,</strong> check out <u><a href=\"https://duckduckgo.com/assets/hiring/how_we_work.pdf\" rel=\"noopener\">DuckDuckGo Culture: How We Work.</a></u> </p>\n<p><br /></p>\n<p><strong>Compensation</strong> </p>\n<p>Annual compensation: $242,000 USD and stock options. Compensation is the same within a professional level, regardless of geographic location or functional area, and the compensation for each professional level is transparent across the organization.</p>\n<p><br /></p>\n<p><strong>Hiring Process</strong> </p>\n<p>Hiring works best when it's a two-way street. Learn how we help you get to know DuckDuckGo and envision your future role here. Find out more about <u><a href=\"https://duckduckgo.com/assets/hiring/how_we_hire.pdf\" rel=\"noopener\">how we hire</a></u>. </p>\n<p><br /></p>\n<p><strong>Diversity, Equity, and Inclusion</strong> </p>\n<p>DuckDuckGo provides equal work opportunities to all team members and applicants<u>,</u> and it prohibits discrimination and harassment of any type on the basis of race, color, ethnicity, caste, religion, age, sex (including pregnancy), national origin, disability status, genetics, protected veteran status, sexual orientation, gender identity or expression, or any other characteristic protected by our policies or federal, state, or local laws.<br /></p>\n<p>We want to ensure that our hiring process is accessible. If you need reasonable accommodation for any part of the application process because of a medical condition or disability, please send an email to <u><a href=\"mailto:careers@duckduckgo.com\" rel=\"noopener\">careers@duckduckgo.com</a></u> to let us know the nature of your request.  <br /></p>\n<p>If you think you might thrive in this environment, we would love to hear from you. </p>\n<p><br /></p>\n<p><strong>Please note that:</strong> </p>\n<ul><li>Sometimes we meet up! Expect to travel at least two times a year: once for our all-hands meetup and again for a team retreat (each around 4-5 days). While extenuating circumstances may impact attendance, everyone is strongly encouraged to attend.</li><li>While we offer a flexible work arrangement with no core hours, expect an average full-time commitment of 40 hours per week. </li><li>A successful candidate will be subject to a background check and must receive satisfactory results of the same, as a condition of joining the team. </li><li>By applying for this role, you confirm that all information submitted is accurate and complete. You further acknowledge that providing false or fraudulent information during the application process is cause for denial of an offer, revocation of any existing offer, or other adverse action, up to and including termination after the start of your commencement of work.</li></ul>","tags":"[\"management\",\"aws\"]","pubDate":"2024-02-09 19:13:58.000","link":"https://duckduckgo.recruitee.com/o/director-people-operations-remote-global-worldwide","savedDate":"2024-02-21 17:59:14.558","slug":"director-people-operations-remote-duckduckgo-406"},{"id":2677544430,"title":"People Development Manager (Europe)","company":"Airalo","image":"https://lever-client-logos.s3.us-west-2.amazonaws.com/55028a36-609c-479c-9553-d4689ff2dd8c-1669620566663.png","description":"<div><b>About Airalo</b></div><div>Alo! Airalo is the world’s first eSIM store that helps people connect in over 200+ countries and regions across the globe. We are building the next digital service that revolutionizes the telecom industry. We are a travel-tech company and an equal-opportunity environment that values and executes diversity, inclusion, and equity. Our team is spread across 40+ countries and six continents. What glues us together is our commitment to changing the way you connect<span style=\"font-size: 13.3333px\">. </span></div><div><br></div><div><b>About you</b></div><div>We hope that you care deeply about the quality of your work, the intrinsic worth of tasks, and the success of your team. You are self-disciplined and do not require micromanagement in terms of your skillset and work ethic. You do your best to flourish as an individual every day while working hard to foster a collaborative team environment. You believe in the importance of being — and staying — authentic, honest, positive, and kind. You are a good interlocutor with clear and concise communication. You are able to manage multiple projects, have an analytical mind, pay keen attention to detail, and love to get your hands dirty. You are cognizant, tolerant, and welcoming of vulnerabilities and cultural differences.</div><div><br></div><div><b>About the Role</b></div><div><b>Position</b>: Full-time / Employee</div><div><b>Location:</b>&nbsp;Remote-first </div><div><b>Benefits:</b>&nbsp;Health Insurance, work-from-anywhere stipend, annual wellness &amp; learning credits, annual all-expenses-paid company retreat in a gorgeous destination &amp; other benefits</div><div><br></div><div>As a <b>People Development Manager</b>, you will take the lead in managing day-to-day training and development initiatives, playing a pivotal role in driving change and operational excellence. Your focus will be on aligning business and people strategies to cultivate a pleasant, rewarding, and high-performance culture within Airalo. Working closely with our founders, C-level executives, VPs, and Directors of your assigned community, you will collaborate seamlessly with the entire People &amp; Talent team. Your goal is to foster continuous learning and development, ensuring that our team thrives in an environment conducive to personal and professional growth.</div><h3>Responsibilities include but are not limited to:</h3><li>Develop and implement internal training programs across various HR pillars, ensuring alignment with organizational objectives, and deliver engaging and impactful training sessions to enhance the skills and knowledge of internal leaders and team members;</li><li>Collaborate with stakeholders to identify training needs, customizing programs to address specific requirements;</li><li>Support and collaborate with engagement initiatives to ensure effective employee engagement and experience, while also motivating and inspiring team members to actively engage in training activities;</li><li>Independently create, launch, and oversee training initiatives from inception to completion;</li><li>Ensure meticulous data collection of training initiatives and hours, with the ability to translate data into actionable insights;</li><li>Exhibit expertise in structuring a training and development function from the ground up;</li><li>Demonstrate the capability to craft compelling business cases for budget approval;</li><li>Oversee the internal Learning System, optimizing it for extraordinary training experiences;</li><li>Establish key performance indicators and metrics to assess the effectiveness of training programs, refining and improving offerings;</li><li>Assist departmental leaders with training needs at different stages of the employee lifecycle such as new hire onboarding and induction training.</li>,<h3>Must-haves:</h3><li>Bachelor’s degree in human resources, business administration, or similar relevant field &amp; a minimum of 5+ years of experience in Learning &amp; Development, and 3 years in a lead or management role;</li><li>Proven experience in taking charge of projects, guiding them to successful completion, and a track record of designing and implementing successful internal training programs;</li><li>Possesses strong leadership skills, negotiating and maintaining relationships with suppliers and vendors;</li><li>Efficiently manage a diverse workload, concurrently handling multiple projects;</li><li>Adhere to specified deadlines, ensuring the timely delivery of high-quality training initiatives;</li><li>Demonstrates resilience, effectively handling pressure and navigating challenging situations;</li><li>Have the knowledge and ability to implement different learning methodologies and approaches;</li><li>Possesses strong customer-centric skills with a passion for service, ensuring all our interactions with people are handled professionally and with thorough attention to detail;</li><li>Inspires and fosters a culture of continuous learning across Airalo;</li><li>Works autonomously, taking ownership of projects and aligning them with organizational goals;</li><li>Strong stakeholder management, interpersonal, and communication skills with all levels of seniority in a cross-functional &amp; global environment;</li><li>Effective &amp; analytical mindset, creative and pragmatic problem-solving skills with strong business acumen &amp; user-centric philosophy;</li><li>Self-driven, optimistic, and keen to work as part of a professional and closely-knit team while highly organized with excellent time management skills;</li><li>Experience with HRIS, HCM &amp; other tools, ensuring the highest level of confidentiality &amp; accuracy on personal &amp; professional information.</li>,<h3>Good to have:</h3><li>Experience in the travel tech and/or telco industry;</li><li>Strong interpersonal and communication skills;</li><li>Proficient in various training methodologies and tools;</li><li>Demonstrated leadership skills with a motivational approach to team collaboration;</li><li>Relevant HR certifications (iHRP, CIPD, SHRM, etc);</li><li>Additional written/spoken languages.</li><div><i>We sincerely thank all applicants in advance for submitting their interest in this opportunity with Airalo. </i></div>","tags":"[\"management\"]","pubDate":"2024-01-24 14:43:24.215","link":"https://jobs.lever.co/airalo/2ffd5134-9369-4812-8dc3-2fdaaae01de0","savedDate":"2024-02-21 17:59:14.565","slug":"people-development-manager-europe-airalo-5803"}]