[{"id":6001750125,"title":" Quant Analyst / Researcher","company":"Nethermind","image":"https://avatars.githubusercontent.com/u/43478154?s=200&v=4","description":"&lt;div class=&quot;content-intro&quot;&gt;&lt;h2&gt;What are we all about?&lt;/h2&gt;\n&lt;p&gt;We are a team of builders and researchers on a mission to empower enterprises and developers worldwide to access and build on decentralized systems.&lt;/p&gt;\n&lt;p&gt;Our expertise covers several domains: Ethereum and Starknet protocol engineering, layer-2, AI, cryptography research, protocol research, decentralized finance (DeFi), security auditing, formal verification, real-time monitoring, smart contract development, and dapps and enterprise engineering.&lt;/p&gt;\n&lt;p&gt;Working to solve some of the most challenging problems in the blockchain space, we frequently collaborate with renowned companies, such as Ethereum Foundation, Starknet Foundation, Gnosis Chain, Flashbots, Forta Protocol, Lido, EigenLayer, Open Zeppelin, RISCZero, Aleph Zero, and many more.&lt;/p&gt;\n&lt;p&gt;Today, we are a 350+ strong team working remotely across 66+ countries.&lt;/p&gt;\n&lt;p&gt;View all our open positions here: &lt;a href=&quot;https://www.nethermind.io/open-roles&quot;&gt;https://www.nethermind.io/open-roles&amp;nbsp;&lt;/a&gt;&lt;/p&gt;&lt;/div&gt;&lt;p&gt;We are seeking a highly skilled and motivated Quantitative Analyst/ Researcher to join our team. As a Quantitative Analyst / Researcher, you will be responsible for analyzing and interpreting blockchain and market data to derive valuable insights, develop quantitative models, and support decision-making processes. Your expertise in quantitative analysis, statistical modeling, and EVM/Non-EVM chains will be instrumental in optimizing our strategies and operations.&lt;/p&gt;\n&lt;p&gt;Responsibilities:&lt;/p&gt;\n&lt;ol&gt;\n&lt;li&gt;Data Analysis: Collect, clean, and analyze large datasets comprising of EVM/Non-EVM chains and market data using appropriate tools and techniques. Extract relevant metrics and patterns to identify trends, correlations, and anomalies.&lt;/li&gt;\n&lt;li&gt;Model Development: Develop quantitative models and algorithms to support investment decisions, risk management strategies, and trading strategies. This includes but is not limited to volatility models, price forecasting models, and portfolio optimization models.&lt;/li&gt;\n&lt;li&gt;Statistical Analysis: Conduct statistical analysis to assess the performance and efficiency of various ecosystems, projects, strategies and initiatives. Identify key performance indicators (KPIs) and develop statistical frameworks to measure and monitor blockchain-related risks and opportunities.&lt;/li&gt;\n&lt;li&gt;Research and Innovation: Stay updated with the latest developments in the blockchain ecosystem, including technological advancements, protocol upgrades, and market trends. Collaborate with cross-functional teams to explore innovative approaches and enhance the organization’s understanding of a protocol/project&#39;s potential.&lt;/li&gt;\n&lt;li&gt;Reporting and Presentation: Communicate complex quantitative findings and insights to both technical and non-technical stakeholders. Prepare comprehensive reports, presentations, and visualizations that effectively convey analytical results, implications, and recommendations.&lt;/li&gt;\n&lt;li&gt;Collaboration: Collaborate with developers, and other team members to integrate quantitative analysis into investment strategies and trading systems. Contribute to the design and development of tools and systems that facilitate data collection, analysis, and reporting.&lt;/li&gt;\n&lt;li&gt;Risk Management: Identify and assess risks associated with upcoming technological and economical upgrades, including market risks, operational risks, and regulatory risks. Develop risk mitigation strategies and ensure compliance with applicable regulations and industry best practices.&lt;/li&gt;\n&lt;/ol&gt;\n&lt;p&gt;Qualifications:&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;Bachelor’s or Master’s degree in a quantitative discipline such as Mathematics, Statistics, Computer Science, or a related field. A Ph.D. is a plus.&lt;/li&gt;\n&lt;li&gt;Strong understanding of Ethereum blockchain, smart contracts, decentralized finance (DeFi), and related technologies.&lt;/li&gt;\n&lt;li&gt;Proficiency in quantitative analysis techniques, statistical modeling, and data visualization tools.&lt;/li&gt;\n&lt;li&gt;Solid programming skills in languages such as Python, R, or MATLAB for data manipulation, analysis, and model implementation.&lt;/li&gt;\n&lt;li&gt;Experience with working with large datasets, SQL, and NoSQL databases.&lt;/li&gt;\n&lt;li&gt;Familiarity with financial markets, derivatives, and risk management concepts is desirable.&lt;/li&gt;\n&lt;li&gt;Ability to work effectively in a fast-paced, dynamic environment with tight deadlines.&lt;/li&gt;\n&lt;li&gt;Excellent problem-solving skills and attention to detail.&lt;/li&gt;\n&lt;li&gt;Strong communication and presentation skills to convey complex concepts to diverse audiences.&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;Join our team as a Quantitative Analyst / Researcher and contribute to our mission of leveraging data-driven insights to optimize strategies and decision-making processes in the cryptocurrency space.&lt;/p&gt;\n&lt;p&gt;&lt;/p&gt;&lt;div class=&quot;content-conclusion&quot;&gt;&lt;div&gt;&lt;span style=&quot;font-size: 8pt;&quot;&gt;&lt;em&gt;&lt;span style=&quot;text-decoration: underline;&quot;&gt;&lt;strong&gt;Disclaimer&lt;/strong&gt;&lt;/span&gt;: I hereby consent to my personal information being stored and processed by Demerzel Solutions Limited (t/a Nethermind) (the “Company”) for recruitment purposes in relation to both the selected job role and any other role the Company considers me a qualified candidate for. All data storing and processing by the Company takes place in accordance with the UK GDPR. Kindly refer to our privacy policy for more details.&amp;nbsp;&lt;/em&gt;&lt;/span&gt;&lt;br&gt;&lt;span style=&quot;font-size: 8pt;&quot;&gt;&lt;em&gt;Your consent to share personal information is entirely voluntary, and you may withdraw your consent at any time. Should you have any questions about this process, or wish to withdraw your consent please contact: legalnotices@nethermind.io&amp;nbsp;&lt;/em&gt;&lt;/span&gt;&lt;br&gt;&lt;br&gt;Keep up to date on what we are working on by following&amp;nbsp;&lt;span class=&quot;il&quot;&gt;us&lt;/span&gt;&amp;nbsp;on &lt;strong&gt;our social channels&lt;br&gt;&lt;br&gt;&lt;/strong&gt;&lt;/div&gt;\n&lt;div&gt;&lt;a href=&quot;https://twitter.com/nethermindeth&quot; target=&quot;_blank&quot;&gt;&lt;img src=&quot;https://cdn4.iconfinder.com/data/icons/social-media-icons-the-circle-set/48/twitter_circle-512.png&quot; alt=&quot;&quot; width=&quot;50&quot; height=&quot;50&quot;&gt;&lt;/a&gt; &amp;nbsp; &lt;a href=&quot;https://discord.com/invite/PaCMRFdvWT&quot; target=&quot;_blank&quot;&gt;&lt;img src=&quot;https://cdn3.iconfinder.com/data/icons/popular-services-brands-vol-2/512/discord-1024.png&quot; alt=&quot;&quot; width=&quot;49&quot; height=&quot;49&quot;&gt;&lt;/a&gt; &amp;nbsp; &lt;a href=&quot;https://www.linkedin.com/company/nethermind/mycompany/&quot; target=&quot;_blank&quot;&gt;&lt;img src=&quot;https://cdn1.iconfinder.com/data/icons/logotypes/32/circle-linkedin-1024.png&quot; alt=&quot;&quot; width=&quot;49&quot; height=&quot;49&quot;&gt;&lt;/a&gt;&lt;/div&gt;\n&lt;div&gt;&amp;nbsp;&lt;/div&gt;\n&lt;div&gt;&lt;strong&gt;&lt;a href=&quot;https://www.nethermind.io/legal&quot; target=&quot;_blank&quot;&gt;&lt;em&gt;Click here to view our Privacy Policy.&lt;/em&gt;&lt;/a&gt;&lt;/strong&gt;&lt;/div&gt;&lt;/div&gt;","tags":"[\"finance\",\"management\",\"engineering\",\"legal\",\"database\"]","pubDate":"2025-03-13T04:14:35.000Z","link":"https://job-boards.eu.greenhouse.io/nethermind/jobs/4556941101","slug":"quant-analyst-researcher-nethermind-774"},{"id":3378012975,"title":"JR Java Back-end Developer | Afirmativa para Pessoas com Deficiência (PCD) ","company":"ília","image":"https://avatars.githubusercontent.com/u/35933823?s=200&v=4","description":"&lt;p&gt;Aqui na ília nossas vagas estão sempre abertas para todas as pessoas e não se restringem quanto a gênero, etnia, orientação sexual, fatores sociais, condições físicas ou intelectuais (PCD) etc. Incentivamos a candidatura de integrantes de todos os grupos minoritários!&lt;/p&gt;\n&lt;h3&gt;&lt;strong&gt;Sobre a ília&lt;/strong&gt;&lt;/h3&gt;\n&lt;p&gt;Somos especialistas em tecnologia, dados e design, impulsionando a transformação digital de grandes players do mercado há mais de 10 anos, nos setores financeiro, seguros e mobilidade. Com mais de 450 profissionais, estamos presentes no Brasil e Europa, atendendo aos mercados da América Latina, Europa e América do Norte, desenvolvendo produtos digitais de alta qualidade e com foco em resultados de negócios. Somos uma equipe inovadora, criativa e apaixonada por tecnologia.&amp;nbsp;&lt;/p&gt;\n&lt;p&gt;Certificada pelo 5° ano consecutivo como Great Place to work aqui na ília acreditamos que pessoas mudam o mundo, e investimos nelas. Nossas awesome deliveries são feitas de pessoas para pessoas, afinal awesome people make awesome deliveries!&amp;nbsp;&lt;/p&gt;\n&lt;p&gt;#Vempraília!&lt;/p&gt;\n&lt;h3&gt;&lt;strong&gt;Requisitos:&lt;/strong&gt;&lt;/h3&gt;\n&lt;p&gt;&lt;/p&gt;\n&lt;ul&gt;\n&lt;li data-start=&quot;0&quot; data-end=&quot;36&quot;&gt;Proficiência avançada em inglês;&lt;/li&gt;\n&lt;li data-start=&quot;37&quot; data-end=&quot;120&quot;&gt;Disponibilidade para viagens ocasionais, tanto nacionais quanto internacionais;&lt;/li&gt;\n&lt;li data-start=&quot;121&quot; data-end=&quot;182&quot;&gt;Experiência com Java e frameworks como Spring ou Quarkus;&lt;/li&gt;\n&lt;li data-start=&quot;183&quot; data-end=&quot;247&quot;&gt;Conhecimento em serviços de nuvem AWS (Amazon Web Services);&lt;/li&gt;\n&lt;li data-start=&quot;248&quot; data-end=&quot;330&quot;&gt;Familiaridade com bancos de dados relacionais e não relacionais (SQL e NoSQL);&lt;/li&gt;\n&lt;li data-start=&quot;331&quot; data-end=&quot;358&quot;&gt;Experiência com Docker;&lt;/li&gt;\n&lt;li data-start=&quot;359&quot; data-end=&quot;385&quot; data-is-last-node=&quot;&quot;&gt;Domínio do uso de Git.&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;&lt;/p&gt;\n&lt;h3&gt;&lt;strong&gt;Benefícios e Incentivos:&lt;/strong&gt;&lt;/h3&gt;\n&lt;p&gt;Nossa contratação é CLT- 40h semanais com jornada flexível, sendo executada 100% de forma remota. Os benefícios da ília são pensados para proporcionar uma experiência AWESOME para cada ílian, abaixo você encontra os benefícios de forma resumida. #vempraília&lt;/p&gt;\n&lt;p&gt;&lt;em&gt;Para Saúde e bem-estar:&lt;/em&gt;&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;Plano de Saúde e Odontológico SulAmérica extensivo a dependentes;&lt;/li&gt;\n&lt;li&gt;Vale Alimentação/Refeição em cartão flexível Picpay benefícios&amp;nbsp;&lt;/li&gt;\n&lt;li&gt;Seguro de Vida;&lt;/li&gt;\n&lt;li&gt;Auxílio Home-Office em cartão flexível Picpay benefícios;&lt;/li&gt;\n&lt;li&gt;Wellhub (Gympass)&lt;/li&gt;\n&lt;li&gt;TotalPass&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;&lt;em&gt;Para o seu Desenvolvimento:&lt;/em&gt;&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;ília University: Universidade Corporativa com mais de 20 mil cursos disponíveis para desenvolvimento pessoal e profissional;&lt;/li&gt;\n&lt;li&gt;Language Academy: Escola de idiomas para ílians;&lt;/li&gt;\n&lt;li&gt;í-talks e Chapter: Momentos e cerimônias em que o time compartilha práticas, estudos, projetos e ideias. Nas chapters ainda se reúnem pessoas com skills similares para compartilhamento de ideias, práticas e experiências;&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;&lt;em&gt;Gostamos de ir além no cuidado com as nossas pessoas, então dispomos também de alguns benefícios não convencionais:&amp;nbsp;&lt;/em&gt;&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;Plano de Saúde PET- Guapeco&amp;nbsp;&lt;/li&gt;\n&lt;li&gt;BYOD- Alugamos o seu notebook pessoal te pagando um valor mensal para que você o use, mas disponibilizamos também máquinas de trabalho para ílians. Você quem decide!&lt;/li&gt;\n&lt;li&gt;Seu Niver, seu bolo!&lt;/li&gt;\n&lt;li&gt;Seu Networking Vale Prêmio- Programa de premiação a indicação de novos funcionários.&lt;/li&gt;\n&lt;/ul&gt;","tags":"[\"finance\",\"aws\"]","pubDate":"2025-03-12T22:43:28.000Z","link":"https://job-boards.greenhouse.io/ilia/jobs/5475080004","slug":"jr-java-back-end-developer-afirmativa-para-pessoas-com-defici-ncia-pcd-lia-2514"},{"id":4828823488,"title":"Software Engineer - AI Products","company":"Sardine","image":"https://avatars.githubusercontent.com/u/65879301?s=200&v=4","description":"<p style=\"min-height:1.5em\"><strong>Who we are:</strong></p><p style=\"min-height:1.5em\">We are a leader in fraud prevention and AML compliance. Our platform uses device intelligence, behavior biometrics, machine learning, and AI to stop fraud before it happens. Today, over 300 banks, retailers, and fintechs worldwide use Sardine to stop identity fraud, payment fraud, account takeovers, and social engineering scams. We have raised $145M from world-class investors, including Andreessen Horowitz, Activant, Visa, Experian, FIS, and Google Ventures.</p><p style=\"min-height:1.5em\"></p><p style=\"min-height:1.5em\"><strong>Our culture:</strong></p><ul style=\"min-height:1.5em\"><li><p style=\"min-height:1.5em\">We have hubs in the Bay Area, NYC, Austin, and Toronto. However, we maintain a remote-first work culture. #WorkFromAnywhere</p></li><li><p style=\"min-height:1.5em\">We hire talented, self-motivated individuals with extreme ownership and high growth orientation. </p></li><li><p style=\"min-height:1.5em\">We value performance and not hours worked. We believe you shouldn't have to miss your family dinner, your kid's school play, friends get-together, or doctor's appointments for the sake of adhering to an arbitrary work schedule.</p></li></ul><p style=\"min-height:1.5em\"></p><p style=\"min-height:1.5em\"><strong>About the role:</strong></p><p style=\"min-height:1.5em\">We’re looking for a full-stack software engineer who’s excited to bring AI-powered products to life. You’ll work across backend and frontend systems to help evolve our platform and integrate AI into real customer-facing features.</p><p style=\"min-height:1.5em\">This is a high-impact role where you’ll take ownership of complex problems, collaborate closely with the team, and help build AI agents already used by customers. Your work will directly help clients safeguard their assets and protect against malicious threats and fraudsters.</p><p style=\"min-height:1.5em\">We’re looking for someone who thrives in a fast-paced, evolving environment. You’ll have the independence to drive projects forward and the ownership to shape solutions from start to finish. Your intense curiosity and eagerness to explore new technologies will be instrumental in safeguarding our clients' assets against malicious threats and fraudsters.</p><p style=\"min-height:1.5em\">If you love building meaningful products, enjoy solving open-ended problems, and want to work at the forefront of AI, we’d love to hear from you.</p><p style=\"min-height:1.5em\"></p><p style=\"min-height:1.5em\"><strong>What you’ll be doing:</strong></p><ul style=\"min-height:1.5em\"><li><p style=\"min-height:1.5em\">Design, build, and maintain robust full-stack applications that power AI-driven products.</p></li><li><p style=\"min-height:1.5em\">Work closely with AI and product teams to integrate AI directly into customer-facing applications.</p></li><li><p style=\"min-height:1.5em\">Troubleshoot production issues, including running SQL queries and validating datasets.</p></li><li><p style=\"min-height:1.5em\">Own projects from idea to launch, helping shape product direction along the way.</p></li><li><p style=\"min-height:1.5em\">Collaborate with a cross-functional team of designers, engineers, and product leaders.</p></li><li><p style=\"min-height:1.5em\">Stay curious, keep up with the latest AI developments, and bring fresh ideas to the team.</p><p style=\"min-height:1.5em\"></p></li></ul><p style=\"min-height:1.5em\"><strong>What you’ll need:</strong></p><ul style=\"min-height:1.5em\"><li><p style=\"min-height:1.5em\">5+ years of full-stack engineering experience, with strong backend focus and production-level frontend development.</p></li><li><p style=\"min-height:1.5em\">Solid experience with backend language (we use Go and Python) and modern frontend frameworks, React + TypeScript.</p></li><li><p style=\"min-height:1.5em\">Comfortable working with SQL and relational databases to troubleshoot and validate data.</p></li><li><p style=\"min-height:1.5em\">Proven ability to solve complex, open-ended problems independently.</p></li><li><p style=\"min-height:1.5em\">Genuine curiosity and excitement for AI, with a strong desire to learn and grow in this space.</p></li><li><p style=\"min-height:1.5em\">Strong communication and collaboration skills, with a track record of working effectively in globally distributed remote cross-functional teams.</p></li><li><p style=\"min-height:1.5em\">Bachelor’s degree in Computer Science, Engineering, or a related field, or equivalent practical experience.</p><p style=\"min-height:1.5em\"></p></li></ul><p style=\"min-height:1.5em\"><strong>Nice to Haves:</strong></p><ul style=\"min-height:1.5em\"><li><p style=\"min-height:1.5em\">Experience in fraud, risk, or compliance domains is a significant plus.</p></li><li><p style=\"min-height:1.5em\">Demonstrated ability to implement solutions that reduce operational inefficiencies while enhancing security and protection against potential threats.</p></li><li><p style=\"min-height:1.5em\">Experience with version control systems, CI/CD pipelines, and cloud platforms (AWS, GCP, or Azure) is a plus.</p></li><li><p style=\"min-height:1.5em\">Demonstrated ability to leverage large language models for innovative product development.</p></li></ul><p style=\"min-height:1.5em\"><strong>Compensation:</strong> Base pay range of $170,000 - $220,000 + equity with tremendous upside potential + Attractive benefits. </p><p style=\"min-height:1.5em\"></p><p style=\"min-height:1.5em\">The compensation offered for this role will depend on various factors, including the candidate's location, qualifications, work history, and interview performance, and may differ from the stated range.</p><p style=\"min-height:1.5em\"></p><p style=\"min-height:1.5em\"><strong>Benefits we offer:</strong></p><ul style=\"min-height:1.5em\"><li><p style=\"min-height:1.5em\">Generous compensation in cash and equity</p></li><li><p style=\"min-height:1.5em\">Early exercise for all options, including pre-vested</p></li><li><p style=\"min-height:1.5em\">Work from anywhere: Remote-first Culture</p></li><li><p style=\"min-height:1.5em\">Flexible paid time off, Year-end break, Self care days off</p></li><li><p style=\"min-height:1.5em\">Health insurance, dental, and vision coverage for employees and dependents - <em>US and Canada specific</em></p></li><li><p style=\"min-height:1.5em\">4% matching in 401k / RRSP - <em>US and Canada specific</em></p></li><li><p style=\"min-height:1.5em\">MacBook Pro delivered to your door</p></li><li><p style=\"min-height:1.5em\">One-time stipend to set up a home office — desk, chair, screen, etc.</p></li><li><p style=\"min-height:1.5em\">Monthly meal stipend</p></li><li><p style=\"min-height:1.5em\">Monthly social meet-up stipend</p></li><li><p style=\"min-height:1.5em\">Annual health and wellness stipend</p></li><li><p style=\"min-height:1.5em\">Annual Learning stipend</p></li><li><p style=\"min-height:1.5em\">Unlimited access to an expert financial advisory</p></li></ul><p style=\"min-height:1.5em\"></p><p style=\"min-height:1.5em\">Join a fast-growing company with world-class professionals from around the world. If you are seeking a meaningful career, you found the right place, and we would love to hear from you.</p>","tags":"[\"typescript\",\"engineering\",\"database\",\"aws\"]","pubDate":"2025-03-12T21:08:04.326Z","link":"https://jobs.ashbyhq.com/sardine/f1d28d19-16d4-44af-85dd-3a5277a09375","slug":"software-engineer-ai-products-sardine-3776"},{"id":3742796130,"title":"Senior Front-End Software Engineer","company":"Clutch","image":"https://app.ashbyhq.com/api/images/org-theme-logo/87f6e542-ae68-4ff1-ab48-f05e9dab1964/e24aecd5-3955-404a-8728-c08806c78730.png","description":"<h1><strong>About the Role</strong></h1><p style=\"min-height:1.5em\">As a Frontend Software Engineer at the Engineering Platform team, you'll focus on building scalable, efficient, and reusable components, improving developer workflows, and ensuring seamless integration of frontend technologies across the platform. You'll collaborate with other software engineers and stakeholders, integrating both frontend and backend seamlessly to build great solutions for our business.</p><p style=\"min-height:1.5em\"></p><h1><strong>About the Team</strong></h1><p style=\"min-height:1.5em\">The Engineering Platform team creates and maintains the essential tools, components, and platforms that boost engineering efficiency. We focus on creating reusable solutions that will support the teams to build high-quality, secure and reliable products for Clutch’s clients.</p><p style=\"min-height:1.5em\"></p><h1><strong>What You’ll Do</strong></h1><ul style=\"min-height:1.5em\"><li><p style=\"min-height:1.5em\">Work in collaboration with developers and other stakeholders to enhance the developer experience, ensuring high-quality code, and enabling the efficient delivery of frontend features and improvements.</p></li><li><p style=\"min-height:1.5em\">Write elegant, efficient, and testable code that is easy to maintain and debug</p></li><li><p style=\"min-height:1.5em\">Take care of configurations and processes documentation so stakeholders understand how to use the platform</p></li><li><p style=\"min-height:1.5em\">As a true teammate, continuously improve the team’s processes, brainstorm ideas, and communicate statuses, and progress</p></li><li><p style=\"min-height:1.5em\">Mentor team members, provide feedback, and continuously improve as a professional</p></li><li><p style=\"min-height:1.5em\">Learn the latest best practices, new concepts and technologies and apply them accordingly to our context</p></li></ul><p style=\"min-height:1.5em\"></p><h1><strong>What You’ll Bring</strong></h1><ul style=\"min-height:1.5em\"><li><p style=\"min-height:1.5em\">6+ years of experience working with Software Development </p></li><li><p style=\"min-height:1.5em\">Experience with front-end development using HTML, CSS, and at least one JavaScript framework like React.js, AngularJS, or Vue.js</p></li><li><p style=\"min-height:1.5em\">Strong problem-solving skills and the ability to write clean, maintainable code</p></li><li><p style=\"min-height:1.5em\">Experience in building accessible and reusable UI components</p></li><li><p style=\"min-height:1.5em\">Experience in testing web applications using browser automation tools</p></li><li><p style=\"min-height:1.5em\">Comprehensive understanding and vision of back-end (B2F vision)</p></li><li><p style=\"min-height:1.5em\">Has experience with building CI/CD pipelines and developing automation solutions to help streamline processes</p></li><li><p style=\"min-height:1.5em\">Experience building and contributing to a design system is a plus</p><p style=\"min-height:1.5em\"></p></li></ul><p style=\"min-height:1.5em\"><em>Please note that this role may evolve as our business needs change, so we appreciate your flexibility and adaptability.</em></p><p style=\"min-height:1.5em\"><strong>What’s In It For You?</strong></p><ul style=\"min-height:1.5em\"><li><p style=\"min-height:1.5em\"><strong>Remote Flexibility:</strong> Enjoy the freedom of remote work from anywhere, balancing life and career seamlessly.</p></li><li><p style=\"min-height:1.5em\"><strong>Unforgettable Off-Sites:</strong> Twice a year, bond with colleagues in exciting destinations, fostering teamwork and fresh ideas.</p></li><li><p style=\"min-height:1.5em\"><strong>Paid Time Off and National Holidays:</strong> Enjoy 20 PTO days yearly and the National Holidays for relaxation and rejuvenation.</p></li><li><p style=\"min-height:1.5em\"><strong>Stock Options:</strong> Joining us means having a stake in our success, so you'll receive stock options as part of your compensation package.</p></li><li><p style=\"min-height:1.5em\"><strong>Home Office Setup:</strong> Create your ideal workspace with a dedicated budget for home office essentials.</p></li><li><p style=\"min-height:1.5em\"><strong>Work Trip Budget:</strong> Grow personally and professionally with a budget for work-related trips and co-working.</p></li></ul><p style=\"min-height:1.5em\"><strong>About Us</strong></p><p style=\"min-height:1.5em\"><strong>Clutch</strong> is a revolutionary vertical SaaS company, proudly backed by Andreessen Horowitz (A16z), aimed at revolutionizing the way Credit Unions engage and change the lives of their members. As a champion of financial well-being, we address the urgent need for affordable lending solutions in an era where the average American grapples with over $155,000 in household debt.  Unlike traditional financial institutions, Clutch develops software to turn Credit Unions into FinTech lenders and leverage their balance sheets to responsibly lend to over 130M Americans. Our mission extends beyond mere financial transactions; we strive to fundamentally enhance the way credit unions interact with their members. By integrating cutting-edge technologies and user-centric designs, we help credit unions provide seamless digital experiences that are on par with leading tech companies. This approach not only preserves but revitalizes the longstanding tradition of community and member-focused service inherent to credit unions.</p><p style=\"min-height:1.5em\"><strong>Please note:</strong> This position is offered on a contractor basis. Applicants must have the necessary documentation and authorization to work in the country where the job is located. Clutch cannot provide sponsorship or assist with obtaining work permits for this role.</p>","tags":"[\"javascript\",\"engineering\"]","pubDate":"2025-03-12T21:07:33.534Z","link":"https://jobs.ashbyhq.com/withclutch/7054cba9-df82-4a07-80dd-5eae8005276a","slug":"senior-front-end-software-engineer-clutch-8464"},{"id":6096666824,"title":"Data Full Stack (Senior/Staff) - 65k~110k €","company":"Didask","image":"https://avatars.githubusercontent.com/u/14350668?s=200&v=4","description":"<p style=\"min-height:1.5em\"><em>🇫🇷 La langue de travail à Didask est l'anglais et sa maîtrise est requise pour nous rejoindre. Néanmoins, nous publions l'intégralité de nos offres d'emploi en français et en anglais. Vous pouvez retrouver toutes nos offres d'emploi sur </em><a target=\"_blank\" rel=\"noopener noreferrer nofollow\" href=\"https://jobs.ashbyhq.com/didask\"><em>cette page</em></a><em>, ainsi que plus d'informations sur Didask, notre culture et nos avantages.</em></p><p style=\"min-height:1.5em\"></p><p style=\"min-height:1.5em\"><em>🇬🇧🇺🇸 While English is our working language at Didask and proficiency is required to join us, we publish all our job openings in both English and French. You can find all our positions on </em><a target=\"_blank\" rel=\"noopener noreferrer nofollow\" href=\"https://jobs.ashbyhq.com/didask\"><em>this page</em></a><em>, along with more information about Didask, our culture and benefits.</em></p><h1>About Didask</h1><p style=\"min-height:1.5em\"></p><p style=\"min-height:1.5em\">Didask is a SaaS eLearning platform that combines cognitive science research with advanced AI to create highly effective training programs. Our pedagogical assistant—unique in the market—guides organizations in designing adaptive learning experiences with proven educational impact.</p><p style=\"min-height:1.5em\">Founded by researchers from École Normale Supérieure in Paris and backed by European investment since 2021, we're building AI tools specifically designed for learning, not generic content generation. Our mission is to transform education by making scientifically-grounded, impactful learning accessible to all organizations.</p><p style=\"min-height:1.5em\"></p><p style=\"min-height:1.5em\"><strong>Our core values</strong></p><p style=\"min-height:1.5em\">Each team member brings something unique, but we are united by shared values that guide us every day:</p><ul style=\"min-height:1.5em\"><li><p style=\"min-height:1.5em\"><strong>Distributed ownership:</strong> Responsibility is shared across the team. Everyone, from junior to senior, takes ownership of their projects and makes decisions autonomously with the trust and support of the team.</p></li><li><p style=\"min-height:1.5em\"><strong>A written-first culture:</strong> We favor written communication, ensuring transparency and accessibility for everyone. This approach has allowed us to reduce meetings and improve the clarity of our collaboration.</p></li><li><p style=\"min-height:1.5em\"><strong>Impact-driven work:</strong> Our goal is simple—contribute meaningfully to Didask's success. We work in an agile way to stay flexible, focused, and ready to adapt.</p></li><li><p style=\"min-height:1.5em\"><strong>Cross-functionality and feedback:</strong> Open communication and collaboration are at the heart of everything we do. Everyone, regardless of their role, is encouraged to share ideas, express opinions, and give or receive constructive feedback.</p></li></ul><p style=\"min-height:1.5em\"></p><h1>About the Data Team</h1><p style=\"min-height:1.5em\"></p><p style=\"min-height:1.5em\">The Data Team at Didask builds analytics infrastructure that powers company-wide decision making and collaborates with Engineering to develop AI-powered educational tools.</p><p style=\"min-height:1.5em\">We embrace a <strong>full-stack mindset</strong> where each team member owns their entire data product (internal or external) and is capable of managing every part of the data chain from ingestion and modeling to interfacing directly with clients to ensure their needs are met.</p><p style=\"min-height:1.5em\">We believe <strong>data practitioners are software engineers</strong> and should apply the same best practices to ensure high output quality, such as modular design, separation of concerns, robust testing and collaborative development processes.</p><p style=\"min-height:1.5em\">Since launching in early 2024, our data team has evolved into a core pillar of the organization. We are now expanding our team to meet growing demands from both internal stakeholders and product. </p><p style=\"min-height:1.5em\">As the <strong>second person recruited to this team</strong>, you'll join us at this exciting inflection point and play a crucial role in our continued growth and development!</p><p style=\"min-height:1.5em\">Our current tech stack includes:</p><ul style=\"min-height:1.5em\"><li><p style=\"min-height:1.5em\">Ingestion: Airbyte, Fivetran, and custom Python jobs</p></li><li><p style=\"min-height:1.5em\">Transformation: DBT</p></li><li><p style=\"min-height:1.5em\">Storage and Compute: Snowflake (data warehouse and data lake)</p></li><li><p style=\"min-height:1.5em\">Dashboarding: Metabase</p></li><li><p style=\"min-height:1.5em\">Reverse ETL: Python and Lambda functions</p></li></ul><p style=\"min-height:1.5em\"></p><h1>What you'll do</h1><p style=\"min-height:1.5em\"></p><ul style=\"min-height:1.5em\"><li><p style=\"min-height:1.5em\"><strong>Deliver value to internal stakeholders</strong>: understand their business processes deeply and own solutions across the entire data chain - from ingestion and data modeling to dashboards and data products</p></li></ul><ul style=\"min-height:1.5em\"><li><p style=\"min-height:1.5em\"><strong>Own critical parts of our data infrastructure</strong>, from decision-making to full deployment. A current priority is selecting and implementing our data orchestration tool and improving the monitoring of our data jobs.</p></li><li><p style=\"min-height:1.5em\"><strong>Design and build our product analytics pipeline</strong> from the ground up, enabling our product team to gain deep insights into client usage patterns and behaviors</p></li><li><p style=\"min-height:1.5em\"><strong>Make our AI-powered product more robust</strong>: shape and build our evaluation pipelines and testing frameworks, to help our product and prompt engineering teams iterate faster and more confidently.</p></li><li><p style=\"min-height:1.5em\"><strong>Build foundations for data team excellence</strong>: define strong shared guidelines and best practices, and create simple, robust internal products that maximize reusability and minimize maintenance.</p></li><li><p style=\"min-height:1.5em\"><strong>Contribute to team growth</strong>: help shape our culture, improve our attractiveness to candidates, and enhance our hiring process to bring in top-level autonomous full stack data practitioners aligned with our values and mission.</p></li></ul><p style=\"min-height:1.5em\"></p><h1>Why join us now ?</h1><p style=\"min-height:1.5em\"></p><ul style=\"min-height:1.5em\"><li><p style=\"min-height:1.5em\"><strong>Be part of a team transforming education</strong> - we're not building yet another learning management system, but revolutionizing how people learn by combining cognitive science, learning design, and cutting-edge generative AI to create truly effective educational experiences.</p></li><li><p style=\"min-height:1.5em\"><strong>Gain a deep understanding of how a scale-up functions</strong> - your work will require mastering business processes across departments to implement meaningful data solutions. From product, to customer success, to finance: you'll be in a unique position to understand the inner workings of the company. </p></li><li><p style=\"min-height:1.5em\"><strong>Own your work with autonomy and responsibility</strong>: This position requires initiative and self-drive. We don't want to tell you what to do—we want you to tell us what needs to be done, while collaborating toward our shared team and company missions.</p></li><li><p style=\"min-height:1.5em\"><strong>Shape the future of our data team</strong> - as we expand from a solo team member to 3-4 data professionals by the end of 2025, you'll have the unique opportunity to help build our data foundation, influence our strategy, and grow into leadership as we strengthen and scale our data capabilities.</p></li></ul><p style=\"min-height:1.5em\"></p><h1>About You</h1><p style=\"min-height:1.5em\"></p><p style=\"min-height:1.5em\">You might be a good fit if most of this sounds like you:</p><ul style=\"min-height:1.5em\"><li><p style=\"min-height:1.5em\"><strong>You have 4+ years of experience in a data practitioner role</strong>: You have a track record of proactively identifying and addressing stakeholder needs by designing and implementing impactful data solutions.</p></li><li><p style=\"min-height:1.5em\"><strong>You are \"T-shaped\" with a generalist mindset</strong>: You are eager to be a full stack data practitioner, and owning solutions end-to-end. While experience across the entire data value chain or our specific tech stack is ideal, it isn't mandatory and we value deep expertise in one specific area (data engineering, analytics, machine learning), as long as you are excited about developing your skills outside of your comfort zone.</p></li><li><p style=\"min-height:1.5em\"><strong>You have strong Software Engineering skills</strong>: You write high quality code, and adhere to software engineering best practices and standards. Specific expertise in python is valued although not mandatory.</p></li><li><p style=\"min-height:1.5em\"><strong>You have strong written communication skills</strong>: You excel at clearly articulating project goals, aligning stakeholders, and summarizing needs both succinctly and comprehensively. You proactively keep team members informed about project status and ensure documentation remains clear and accessible.</p></li><li><p style=\"min-height:1.5em\"><strong>Impact is your priority</strong>: You proactively engage with stakeholders to understand their true needs, even when not explicitly stated. You focus on delivering solutions that create measurable value rather than just fulfilling requirements.</p></li><li><p style=\"min-height:1.5em\"><strong>You are pragmatic...</strong>: You break down complex problems into manageable pieces and prioritize making steady progress over pursuing perfect but delayed solutions. You're comfortable with iterative approaches that deliver value quickly.</p></li><li><p style=\"min-height:1.5em\"><strong>...While pushing for excellence</strong>: You balance short-term pragmatism with long-term quality by thoughtfully addressing technical debt. You understand when to move quickly and when to invest in robustness, maintaining that crucial equilibrium.</p></li><li><p style=\"min-height:1.5em\"><strong>You strive for simplicity</strong>: You transform complex processes into elegant, straightforward solutions. You recognize that the most maintainable and scalable systems are often the simplest ones.</p></li></ul><ul style=\"min-height:1.5em\"><li><p style=\"min-height:1.5em\"><strong>You are excited about reshaping education</strong>: You're motivated by our mission to transform how people teach and learn through innovative data solutions and AI-powered educational tools.</p></li></ul><p style=\"min-height:1.5em\"></p><p style=\"min-height:1.5em\">Important notes:</p><ul style=\"min-height:1.5em\"><li><p style=\"min-height:1.5em\"><strong>We hire people, not roles</strong>: While we value experience, we're primarily looking for individuals with high potential, curiosity, and a strong fit with our team. Show us why you'd thrive in our environment and culture.</p></li><li><p style=\"min-height:1.5em\"><strong>We value diverse backgrounds</strong>: We don't filter candidates simply based on academic credentials or previous employers. Your past doesn't define who you are today. Instead of trying to fit a predetermined mold, show us what makes you unique and how your distinctive perspective would enhance our team.</p></li></ul><p style=\"min-height:1.5em\"></p><h1>Interview Process</h1><p style=\"min-height:1.5em\"></p><ul style=\"min-height:1.5em\"><li><p style=\"min-height:1.5em\"><strong>Written questions</strong> (application form)</p></li><li><p style=\"min-height:1.5em\"><strong>Introductory call</strong> (30min visio, w/ Data Lead)</p></li><li><p style=\"min-height:1.5em\"><strong>Technical assessment</strong> (take-home assignment + 1h visio to debrief w/ Data Lead and software engineer)</p></li><li><p style=\"min-height:1.5em\"><strong>Presentation of previous project</strong> (1h visio or on-site, w/ Data Lead and business stakeholder)</p></li><li><p style=\"min-height:1.5em\"><strong>Culture fit interview</strong> with a co-founder (30min)</p></li></ul><p style=\"min-height:1.5em\"></p><p style=\"min-height:1.5em\"><strong>🇫🇷 Retrouvez les avantages réservés aux salariés de Didask sur </strong><a target=\"_blank\" rel=\"noopener noreferrer nofollow\" href=\"https://jobs.ashbyhq.com/didask\"><strong>cette page</strong></a><strong>.</strong></p><p style=\"min-height:1.5em\"><strong>🇬🇧🇺🇸 You'll find our benefits and perks on </strong><a target=\"_blank\" rel=\"noopener noreferrer nofollow\" href=\"https://jobs.ashbyhq.com/didask\"><strong>this page</strong></a><strong>.</strong></p><p style=\"min-height:1.5em\"></p><p style=\"min-height:1.5em\"><em>🇫🇷 Sauf mention contraire, toutes nos offres sont accessibles en télétravail complet à condition de travailler dans un fuseau horaire proche de celui de Paris et de disposer des bonnes conditions de travail (notamment connexion Internet). Attention, nous ne pouvons à l'heure actuelle embaucher que des résidents fiscaux français.</em></p><p style=\"min-height:1.5em\"><em>🇬🇧🇺🇸 Unless specified otherwise, all positions are fully remote, provided you work in a timezone close to Paris and have suitable working conditions (including Internet connection). Please note that we can currently only hire French tax residents.</em></p>","tags":"[\"finance\",\"management\",\"engineering\"]","pubDate":"2025-03-12T16:39:54.967Z","link":"https://jobs.ashbyhq.com/didask/4a0baf34-9a12-4c1c-9fa7-89bf3b0c6efc","slug":"data-full-stack-senior-staff-65k-110k-didask-8416"},{"id":6704891690,"title":"Head of Security Operations","company":"Canonical","image":"https://avatars.githubusercontent.com/u/53057619?s=200&v=4","description":"&lt;p&gt;This global leadership role in cyber security is to manage the Security Operations (SecOps) team responsible for design, implementation and evolution of Canonical security practices, techniques, tools, systems and policies. The team is the primary owner of strategy and practices that determine how Canonical secures its data, internal infrastructure and build processes. They are responsible for assuring the security and integrity of our own infrastructure and product deployments. They design and implement technical security controls that ensure security threats are automatically identified, contained and remediated. The team will also contribute ideas and requirements for Canonical product security, improving the resilience and robustness of all Ubuntu customers and users subject to cyber attack.&lt;/p&gt;\n&lt;p&gt;As a leader on cyber security in the company, the SecOps team manager will collaborate with our Organisational Learning and Development team to develop playbooks and facilitate SecOps training across Canonical. They will operate in a wider security organisation, run a high performing security team and improve Canonical&#39;s security posture. They will lead initiatives to integrate the team&#39;s insights into Canonical&#39;s broader software development process.&lt;/p&gt;\n&lt;p&gt;While this is a management position, we expect managers to be expert practitioners, able to lead by example, contribute at the highest level, and assess work based on their own professional experience and skill. Candidates should have deep, hands-on expertise with a range of open source and proprietary security tooling and practices, which they can integrate into a holistic next generation security solution across the breadth of Canonical&#39;s interests.&lt;/p&gt;\n&lt;p&gt;The SecOps team&#39;s mission is not only to secure Canonical, but also to contribute to the security of the wider open source ecosystem. They might share knowledge through public presentations and industry events, and share threat intelligence with the wider community or represent Canonical in sector-specific governance bodies.&lt;/p&gt;\n&lt;p&gt;This role reports to the CISO.&lt;/p&gt;\n&lt;h2&gt;What you will do in this role:&lt;/h2&gt;\n&lt;ul&gt;\n&lt;li&gt;Hire and mentor a team of outstanding technical security professionals&lt;/li&gt;\n&lt;li&gt;Define Canonical&#39;s SecOps security standards and playbooks&lt;/li&gt;\n&lt;li&gt;Own and drive the architecture and design of the SOC&lt;/li&gt;\n&lt;li&gt;Analyse and improve Canonical&#39;s security architecture&lt;/li&gt;\n&lt;li&gt;Evaluate, select and implement new security tools and practices&lt;/li&gt;\n&lt;li&gt;Identify, contain and guide the remediation of security threats and cyber attacks&lt;/li&gt;\n&lt;li&gt;Grow the presence and thought leadership of Canonical SecOps practice&lt;/li&gt;\n&lt;li&gt;Contribute to open source threat intelligence initiatives&lt;/li&gt;\n&lt;li&gt;Drive threat modelling, table top exercises and other SecOps practices across Engineering, IS and Canonical&lt;/li&gt;\n&lt;li&gt;Develop Canonical SecOps learning and development materials&lt;/li&gt;\n&lt;li&gt;Publish blog posts, whitepapers and conference presentations&lt;/li&gt;\n&lt;li&gt;Identify, implement and track SecOps KPIs&lt;/li&gt;\n&lt;li&gt;Plan and deliver SecOps work in the framework of Canonical&#39;s agile engineering practice&lt;/li&gt;\n&lt;li&gt;Work with Security leadership to present information and influence change&lt;/li&gt;\n&lt;/ul&gt;\n&lt;h2&gt;What we are looking for&lt;/h2&gt;\n&lt;ul&gt;\n&lt;li&gt;Proven track record of mitigating with advanced threat actors and nation state threats&lt;/li&gt;\n&lt;li&gt;Expert technical understanding of SOCs from the ground up&lt;/li&gt;\n&lt;li&gt;In depth knowledge of SOC architecture and design including strategies for logging, firewalls, network segmentation, honeypots etc&lt;/li&gt;\n&lt;li&gt;Someone who understands how the SOC works not just how to use it&lt;/li&gt;\n&lt;li&gt;Expert in Linux security&lt;/li&gt;\n&lt;li&gt;Ability to define, implement, automate and measure effective incident response playbooks&lt;/li&gt;\n&lt;li&gt;Knowledge of security architecture and market-leading security tools&lt;/li&gt;\n&lt;li&gt;Experience contributing to, and consuming, threat intelligence feeds&lt;/li&gt;\n&lt;li&gt;Experience in security risk management frameworks such as NIST CSF&lt;/li&gt;\n&lt;li&gt;An exceptional academic track record from both high school and university&lt;/li&gt;\n&lt;li&gt;Undergraduate degree in Computer Science or STEM, or a compelling narrative about your alternative path&lt;/li&gt;\n&lt;li&gt;Drive and a track record of going above-and-beyond expectations&lt;/li&gt;\n&lt;li&gt;Deep personal motivation to be at the forefront of technology security&lt;/li&gt;\n&lt;li&gt;Leadership and management ability&lt;/li&gt;\n&lt;li&gt;Excellent business English writing and presentation skills&lt;/li&gt;\n&lt;li&gt;Confidence to report security performance metrics with accountability for accuracy and completeness&lt;/li&gt;\n&lt;/ul&gt;\n&lt;h2&gt;Optional things we value&lt;/h2&gt;\n&lt;ul&gt;\n&lt;li&gt;Experience in offensive or defensive security teams with hands-on ability&lt;/li&gt;\n&lt;li&gt;Experience with open source security tools&lt;/li&gt;\n&lt;li&gt;Experience with security standards such as ISO 27001&amp;nbsp;&lt;/li&gt;\n&lt;li&gt;Experience with security posture management of corporate endpoitns&lt;/li&gt;\n&lt;/ul&gt;","tags":"[\"management\",\"engineering\",\"cyber security\"]","pubDate":"2025-03-12T15:46:16.000Z","link":"https://job-boards.greenhouse.io/canonical/jobs/4209375","slug":"head-of-security-operations-canonical-8805"},{"id":9323445922,"title":"Technical Digital Marketer (MARTECH Implementation)","company":"WebFX","image":"https://media.licdn.com/dms/image/C4E0BAQEaJsLubyO-AA/company-logo_200_200/0/1630591240152/webfxinc_logo?e=2147483647&v=beta&t=mkc8r0aeeGBHIC7BLKk7r18oCDh3xnykU31_6dhVPdQ","description":"<div><span style=\"font-size: 12pt\">Hi there! We’re WebFX, a full-funnel revenue marketing agency based in the US. We’ve been 9x named a Best Place to Work, and we’d love to meet you! We are a fast-growing company of more than 700 FXers, that has doubled in size over the past 5 years, with talented team members in 6 US offices, 20+ US States, and now based around the globe (and representing 18+ different countries, including offices in Guatemala and South Africa!).&nbsp;</span></div><div><br></div><div><span style=\"font-size: 12pt\">While WebFX and our subsidiary companies, such as Nutshell CRM, </span><a href=\"http://seo.com/\"><span style=\"font-size: 12pt\">SEO.com</span></a><span style=\"font-size: 12pt\">, and TeamAI, are growing rapidly, we are committed to growing strategically and sustainably, and that starts with growing our team of the #BestCoworkers - that’s where you come in!</span></div><div><br></div><div><span style=\"font-size: 12pt\">We’re looking for people to join our mission to provide world-class full-funnel revenue marketing solutions to mid-size businesses worldwide, We are passionate about what we do, we’re committed to driving business growth for our clients, and we’re on the hunt for people just like you, who take pride in their work and want to be part of a company that does too.&nbsp;</span></div><div><br></div><div><span style=\"font-size: 18pt\">Why Choose WebFX?</span></div><div><br></div><div><span style=\"font-size: 12pt\">We’re proud to offer the same great culture and a comprehensive set of benefits to our team members no matter where in the world they’re based. In addition to very competitive base pay, we also offer company profit-sharing, performance bonuses, and health insurance (including dental, vision, remote doctor, etc.). To aid in your success, we also provide world-class industry training (Organic SEO, Local SEO, PPC, Google Analytics, etc.), long-term career track opportunities, and ongoing learning bonuses (yes, you can get paid to learn!), along with numerous other benefits!&nbsp;</span></div><div><br></div><div><span style=\"font-size: 12pt\">Some of the additional benefits our FXers enjoy include:</span></div><div><br></div><div><span style=\"font-size: 12pt\">- No matter where you are located or your position, WebFX offers long-term stability to all of our FXFamily members. Many of our global team members have been with WebFX for 10+ years, and we’re hoping you can be too! 🌏</span></div><div><span style=\"font-size: 12pt\">- We put our people first; it’s as simple as that. You’re never on your own - when you run into inevitable challenges, we’re there to support you along the way!&nbsp;</span></div><div><span style=\"font-size: 12pt\">- Long-lasting relationships with both clients and team members due to consistently low turnover rates, which are simply unheard of in our industry because, again, we put our people first.</span></div><div><span style=\"font-size: 16px\">- Save your time and money by skipping the commute to an office. This role allows you to work from the comfort of your home! 🏡</span></div><div><span style=\"font-size: 12pt\">- Fully equipped in-home office setup including computer, dual large monitors, headset, seriously fast internet, generator, and more! 🖥️&nbsp;</span></div><div><span style=\"font-size: 12pt\">- Unrestricted access to our proprietary software/platforms that our internal R&amp;D team has developed for our team’s exclusive use, in addition to access to the many 3rd party tools and software we utilize internally in order to WOW our clients. You can learn more about just some of our </span><a style=\"font-size: 12pt\" href=\"https://www.webfx.com/marketingcloudfx/\">proprietary tools here</a><span style=\"font-size: 12pt\">.</span></div><div><span style=\"font-size: 12pt\">- Be part of a rapidly growing company that, at the same time, only partners with clients who share our values. 🌱📈</span></div><div><span style=\"font-size: 12pt\">- Merit-based promotional structure.</span></div><div><span style=\"font-size: 12pt\">- Annual merit-based compensation increases! 💰</span></div><div><span style=\"font-size: 12pt\">- Access to virtual professional development opportunities with company experts and virtual team-building events like monthly meetups and hangouts.</span></div><div><span style=\"font-size: 12pt\">- Invitation to our annual FXFest – a week-long, all-expenses-paid trip for our international team members (with a 1-year tenure) to our company headquarters. This event is filled with activities, learning, and motivation to help unite our U.S. and global staff! 🛫</span></div><div><span style=\"font-size: 12pt\">- We have a very strong commitment to giving back globally - in fact, it’s one of our values here at WebFX. As a member of our FXFamily, you get to be a large part of that simply by achieving your goals - since 2014, we’ve committed to donating globally through our FXBuilds program. You can learn more about that </span><a style=\"font-size: 12pt\" href=\"https://www.webfx.com/about/fxbuilds/\">here</a><span style=\"font-size: 12pt\">!</span></div><div><span style=\"font-size: 12pt\">- When you join WebFX, you don’t just join a company; you join a community! We value all of our team members the same, regardless of their position or where they call home. We truly look forward to learning about you and your background, and we will be there to celebrate the milestones in your life together, no matter how big or small! 👏</span></div><div><br></div><div><span style=\"font-size: 18pt\">What You'll Get</span></div><div><br></div><div><span style=\"font-size: 13.5pt\">World-Class Training and Ongoing Career Development</span></div><div><br></div><div><span style=\"font-size: 12pt\">- No matter your level of experience, our “Bootcamp” training program is provided for all new WebFX “family members” to learn, grow and develop in and out of the office with the hard skills necessary to be successful in their position.&nbsp;</span></div><div><span style=\"font-size: 12pt\">- From training with our </span><a style=\"font-size: 12pt\" href=\"https://www.horizoninteractiveawards.com/news/article/top-agency-2020-interview-kyle-helder-web-design-team-lead\">Award-Winning</a><span style=\"font-size: 12pt\"> Sr. Developers, Designers, Marketers, and more to access to countless industry-leading online training resources/courses/tutorials to getting experience with our client base that spans just about every industry you can think of (and then some), our training program is simply unrivaled!</span></div><div><span style=\"font-size: 12pt\">- Training doesn’t stop after your initial training period, we offer career development training and monthly Lunch-and-Learns with our state-of-the-art training amenities to facilitate departmental training, industry-related updates, and more!</span></div><div><span style=\"font-size: 12pt\">- FXLearns program – where you get incentives for taking advantage of our countless industry training resources!</span></div><div><span style=\"font-size: 12pt\">- With a track record of serving over 1,500+ clients, we’ve been able to truly master our processes and procedures, and we’ll train you on them - no need to develop how to do things (unless you want to help us continually improve that process!), because we refuse to ever stagnate, we are always pushing to make those processes 1% better too!&nbsp;</span></div><div><br></div><div><span style=\"font-size: 13.5pt\">Opportunities for Growth</span></div><div><br></div><div><span style=\"font-size: 12pt\">WebFX has doubled in size over the past 5 years, and merit-based promotional opportunities are abundant if you're meeting or exceeding position performance metrics. We believe in growing and promoting our internal team first and foremost. In fact, 95% of our promotions are internal! All team members have a very clearly defined progression path, so you know exactly what is expected of you so you can put your career in your own hands.&nbsp;</span></div><div><br></div><div><span style=\"font-size: 12pt\">What’s more, you’re not expected to know it all - we believe in continually striving to be an expert in your subject matter of expertise, so while we will purposely challenge you to grow in your niche, we are a full-service agency that has experts in other departments that handle everything else - from link building, to social media, to web design, and web development. This is done so you can truly master your trade. </span></div><h3>Who We're Looking For</h3><li><b>General Knowledge in the following:</b></li><li>Strong English written communication skills. Resume must be in English to be considered.</li><li>Basic understanding of WordPress</li><li>Basic understanding of design and visual website elements</li><div><br></div><li><b>Experience</b></li><li>Digital Marketing Experience (SEO/PPC/Analytics/GTM/etc)</li><li>Martech/AdTech or Technical SEO experience with willingness to learn</li><li>CMS experience with Wordpress</li><li>Technical experience with implementing tracking code on client websites</li><li>Basic understanding of SEO (Desired)</li><li>Basic HTML experience or willingness to learn (Desired)</li><div><br></div><li><b>Qualities</b></li><li>Demonstrates ability to get things done</li><li>Enjoys attention to detail technical task</li><li>Likes reviewing data and making recommendations </li><li>Communicates reliably about the status of a project</li><li>Outstanding attention to detail</li><h3>What You'll Do</h3><li><b>Responsibilities</b></li><li>Set up our marketing automation software (MCFX) on clients websites</li><li>Consults with internal team to deploy Google Analytics/Google Tag Manager (GTM) on client websites</li><li>Auditing / Making Implementation changes to Analytics and Tag Management accounts</li><li>Interprets data, understands personas/audiences for LeadNurtureFX &amp; PersonalizeFX</li><li>Makes writing CRO/UX recommendations </li><li>Understands Attribution/Micro-Conversions</li><li>Ability to meet and exceed monthly production goals</li><li>Requires reliable internet access</li><li><b><i>The Content Integration Specialist role is NOT a client-facing position</i></b></li><div><br></div><li><b>Percentage Breakdown</b></li><li>60%&nbsp;Google&nbsp;Tag&nbsp;Manager&nbsp;- Setup &amp; Advanced Event Tracking / Troubleshooting /&nbsp;Google&nbsp;Analytics Troubleshooting Tickets / Data &amp; Attribution Governance</li><li>20% MCFX Installs </li><li>10% Social Media tracking installation </li><li>10% Dev-related marketing support</li><div><span style=\"font-size: 18pt\">Compensation</span></div><div><br></div><div><span style=\"font-size: 16px\">Negotiable, based on experience</span></div><div><span style=\"font-size: 16px\">Annual merit-based increases</span></div><div><br></div><div><span style=\"font-size: 18pt\">Working Hours</span></div><div><br></div><div><span style=\"font-size: 12pt\">Asia (Philippines / Indonesia)</span></div><div><span style=\"font-size: 12pt\">This position requires overlapping hours from 3:30 AM EST - 12:00 PM EST (New York Time Zone) Monday - Friday. </span></div><div><br></div><div><span style=\"font-size: 12pt\">Africa / Europe (Ghana, UK, Ireland, Kenya, etc)</span></div><div><span style=\"font-size: 12pt\">This position requires overlapping hours from 6:00 AM EST - 2:30 PM EST, Monday - Friday. The 40 hours of work doesn’t include any lunch or breaks.&nbsp;&nbsp;</span></div><div><br></div><div><span style=\"font-size: 12pt\">*** This excludes South Africa, where our in-office team follows a different schedule. </span></div><div><br></div><div><span style=\"font-size: 12pt\">North America &amp; South America</span></div><div><span style=\"font-size: 12pt\">This position requires overlapping hours from 8:00 AM EST - 4:30 PM EST, Monday - Friday. The 40 hours of work doesn’t include any lunch or breaks.&nbsp;&nbsp;</span></div><div><br></div><div><span style=\"font-size: 12pt\">*** This excludes Guatemala, where our in-office team follows a different schedule.</span></div><div><br></div><div><span style=\"font-size: 13.5pt\">Check out our culture on social media:</span></div><div><a style=\"font-size: 12pt\" href=\"https://www.instagram.com/webfx\">Instagram</a></div><div><a style=\"font-size: 12pt\" href=\"https://twitter.com/webfx\">Twitter</a></div><div><a style=\"font-size: 12pt\" href=\"https://www.facebook.com/webfxinc/\">Facebook</a></div><div><br></div><div><span style=\"font-size: 12pt\">Please submit a resume or CV (in English) to be considered for this opportunity.</span></div><div><br></div><div><span style=\"font-size: 11pt\">*You don't need to apply more than once, even if you're interested in multiple positions - you can simply let us know! We consider all open roles when reviewing resumes and applications!&nbsp;</span></div><div><br></div><div><span style=\"font-size: 12pt\">WebFX is an Equal Opportunity Employer, committed to providing and fostering an inclusive environment where all people, including women, minorities, LGBTQ+, and other underrepresented groups, are supported, respected, and encouraged to excel within STEM careers. Our goal as an organization is to empower our team to achieve their personal best, bring people together, and provide equal opportunity to do so regardless of race, age, gender, sexual orientation, religion, physical ability or disability, or political affiliation. </span><a style=\"font-size: 12pt\" href=\"https://equality.webfx.com/\">You can learn more on our website here</a><span style=\"font-size: 12pt\">!</span></div><div><span style=\"font-size: 12pt\">Hi there! We’re WebFX, a full-funnel revenue marketing agency based in the US. We’ve been 9x named a Best Place to Work, and we’d love to meet you! We are a fast-growing company of more than 700 FXers, that has doubled in size over the past 5 years, with talented team members in 6 US offices, 20+ US States, and now based around the globe (and representing 18+ different countries, including offices in Guatemala and South Africa!).&nbsp;</span></div><div><br></div><div><span style=\"font-size: 12pt\">While WebFX and our subsidiary companies, such as Nutshell CRM, </span><a href=\"http://seo.com/\"><span style=\"font-size: 12pt\">SEO.com</span></a><span style=\"font-size: 12pt\">, and TeamAI, are growing rapidly, we are committed to growing strategically and sustainably, and that starts with growing our team of the #BestCoworkers - that’s where you come in!</span></div><div><br></div><div><span style=\"font-size: 12pt\">We’re looking for people to join our mission to provide world-class full-funnel revenue marketing solutions to mid-size businesses worldwide, We are passionate about what we do, we’re committed to driving business growth for our clients, and we’re on the hunt for people just like you, who take pride in their work and want to be part of a company that does too.&nbsp;</span></div><div><br></div><div><span style=\"font-size: 18pt\">Why Choose WebFX?</span></div><div><br></div><div><span style=\"font-size: 12pt\">We’re proud to offer the same great culture and a comprehensive set of benefits to our team members no matter where in the world they’re based. In addition to very competitive base pay, we also offer company profit-sharing, performance bonuses, and health insurance (including dental, vision, remote doctor, etc.). To aid in your success, we also provide world-class industry training (Organic SEO, Local SEO, PPC, Google Analytics, etc.), long-term career track opportunities, and ongoing learning bonuses (yes, you can get paid to learn!), along with numerous other benefits!&nbsp;</span></div><div><br></div><div><span style=\"font-size: 12pt\">Some of the additional benefits our FXers enjoy include:</span></div><div><br></div><div><span style=\"font-size: 12pt\">- No matter where you are located or your position, WebFX offers long-term stability to all of our FXFamily members. Many of our global team members have been with WebFX for 10+ years, and we’re hoping you can be too! 🌏</span></div><div><span style=\"font-size: 12pt\">- We put our people first; it’s as simple as that. You’re never on your own - when you run into inevitable challenges, we’re there to support you along the way!&nbsp;</span></div><div><span style=\"font-size: 12pt\">- Long-lasting relationships with both clients and team members due to consistently low turnover rates, which are simply unheard of in our industry because, again, we put our people first.</span></div><div><span style=\"font-size: 16px\">- Save your time and money by skipping the commute to an office. This role allows you to work from the comfort of your home! 🏡</span></div><div><span style=\"font-size: 12pt\">- Fully equipped in-home office setup including computer, dual large monitors, headset, seriously fast internet, generator, and more! 🖥️&nbsp;</span></div><div><span style=\"font-size: 12pt\">- Unrestricted access to our proprietary software/platforms that our internal R&amp;D team has developed for our team’s exclusive use, in addition to access to the many 3rd party tools and software we utilize internally in order to WOW our clients. You can learn more about just some of our </span><a href=\"https://www.webfx.com/marketingcloudfx/\" style=\"font-size: 12pt\">proprietary tools here</a><span style=\"font-size: 12pt\">.</span></div><div><span style=\"font-size: 12pt\">- Be part of a rapidly growing company that, at the same time, only partners with clients who share our values. 🌱📈</span></div><div><span style=\"font-size: 12pt\">- Merit-based promotional structure.</span></div><div><span style=\"font-size: 12pt\">- Annual merit-based compensation increases! 💰</span></div><div><span style=\"font-size: 12pt\">- Access to virtual professional development opportunities with company experts and virtual team-building events like monthly meetups and hangouts.</span></div><div><span style=\"font-size: 12pt\">- Invitation to our annual FXFest – a week-long, all-expenses-paid trip for our international team members (with a 1-year tenure) to our company headquarters. This event is filled with activities, learning, and motivation to help unite our U.S. and global staff! 🛫</span></div><div><span style=\"font-size: 12pt\">- We have a very strong commitment to giving back globally - in fact, it’s one of our values here at WebFX. As a member of our FXFamily, you get to be a large part of that simply by achieving your goals - since 2014, we’ve committed to donating globally through our FXBuilds program. You can learn more about that </span><a href=\"https://www.webfx.com/about/fxbuilds/\" style=\"font-size: 12pt\">here</a><span style=\"font-size: 12pt\">!</span></div><div><span style=\"font-size: 12pt\">- When you join WebFX, you don’t just join a company; you join a community! We value all of our team members the same, regardless of their position or where they call home. We truly look forward to learning about you and your background, and we will be there to celebrate the milestones in your life together, no matter how big or small! 👏</span></div><div><br></div><div><span style=\"font-size: 18pt\">What You'll Get</span></div><div><br></div><div><span style=\"font-size: 13.5pt\">World-Class Training and Ongoing Career Development</span></div><div><br></div><div><span style=\"font-size: 12pt\">- No matter your level of experience, our “Bootcamp” training program is provided for all new WebFX “family members” to learn, grow and develop in and out of the office with the hard skills necessary to be successful in their position.&nbsp;</span></div><div><span style=\"font-size: 12pt\">- From training with our </span><a href=\"https://www.horizoninteractiveawards.com/news/article/top-agency-2020-interview-kyle-helder-web-design-team-lead\" style=\"font-size: 12pt\">Award-Winning</a><span style=\"font-size: 12pt\"> Sr. Developers, Designers, Marketers, and more to access to countless industry-leading online training resources/courses/tutorials to getting experience with our client base that spans just about every industry you can think of (and then some), our training program is simply unrivaled!</span></div><div><span style=\"font-size: 12pt\">- Training doesn’t stop after your initial training period, we offer career development training and monthly Lunch-and-Learns with our state-of-the-art training amenities to facilitate departmental training, industry-related updates, and more!</span></div><div><span style=\"font-size: 12pt\">- FXLearns program – where you get incentives for taking advantage of our countless industry training resources!</span></div><div><span style=\"font-size: 12pt\">- With a track record of serving over 1,500+ clients, we’ve been able to truly master our processes and procedures, and we’ll train you on them - no need to develop how to do things (unless you want to help us continually improve that process!), because we refuse to ever stagnate, we are always pushing to make those processes 1% better too!&nbsp;</span></div><div><br></div><div><span style=\"font-size: 13.5pt\">Opportunities for Growth</span></div><div><br></div><div><span style=\"font-size: 12pt\">WebFX has doubled in size over the past 5 years, and merit-based promotional opportunities are abundant if you're meeting or exceeding position performance metrics. We believe in growing and promoting our internal team first and foremost. In fact, 95% of our promotions are internal! All team members have a very clearly defined progression path, so you know exactly what is expected of you so you can put your career in your own hands.&nbsp;</span></div><div><br></div><div><span style=\"font-size: 12pt\">What’s more, you’re not expected to know it all - we believe in continually striving to be an expert in your subject matter of expertise, so while we will purposely challenge you to grow in your niche, we are a full-service agency that has experts in other departments that handle everything else - from link building, to social media, to web design, and web development. This is done so you can truly master your trade. </span></div>","tags":"[\"management\"]","pubDate":"2025-03-12T12:34:11.561Z","link":"https://jobs.lever.co/webfx/c589344d-2cb8-48eb-adeb-cad22f571c45","slug":"technical-digital-marketer-martech-implementation-webfx-1161"},{"id":1131364652,"title":"Office Assistant","company":"Coalition Technologies ","image":"https://remotive.com/job/1680495/logo","description":"<p class=\"h3\">WHY YOU SHOULD APPLY:</p>\n<p> </p>\n<p>Coalition Technologies is devoted to delivering clients the highest quality work while providing our team a fun, thriving, and innovative environment. Along with the opportunity for tremendous career growth and rapid advancement, CT offers:</p>\n<ul style=\"\">\n<li style=\"\">The most competitive profit-sharing bonus plan in the industry, paying up to 50% of company profits to full-time employees each month!</li>\n<li style=\"\">A highly competitive Paid Time Off plan, promoting quality work-life balance.</li>\n<li style=\"\">Subsidized gym memberships to help team members feel their best.</li>\n<li style=\"\">Medical, dental, vision, and life insurance packages for all US-based team members.</li>\n<li style=\"\">International Health Insurance Reimbursement Program for all international team members, a benefit unique to Coalition.</li>\n<li style=\"\">Device upgrade and learning reimbursement programs.</li>\n<li style=\"\">Motivating career development plans with clearly defined goals and rewards.</li>\n<li style=\"\">Additional job-specific incentives and bonuses.<br><br></li>\n</ul>\n<p>Plus, 100% of our team works remotely with the support of time tracking software. Our company culture specializes in supporting remote team members, and we’ve been doing so for more than a decade. CT welcomes your application, wherever in the world it's coming from!</p>\n<p class=\"h3\"> </p>\n<p class=\"h3\">YOU SHOULD HAVE:</p>\n<p> </p>\n<ul style=\"\">\n<li style=\"\">Willingness to learn, grow, and collaborate with the team and company as a whole.</li><li style=\"\">Excellent verbal and written communication skills.</li><li style=\"\">A high level of discretion, ethics, and trustworthiness.</li><li style=\"\">Intermediate spreadsheet skills (preferred)</li><li style=\"\">Innovative thinking and a willingness to challenge existing methods where improvement is possible.</li><li style=\"\">Experience in bookkeeping / financial record keeping (preferred).</li><li style=\"\">Experience with Google Sheets or Excel, Quickbooks Online, and G-Suite (preferred).</li><li style=\"\">The availability to work 40 hours per week from 9:00 am to 6:00 pm PST.</li><li style=\"\">A reliable space to work remotely with a fast computer, quality internet, camera, microphone, and speakers.</li>\n</ul>\n<p class=\"h3\"> </p>\n<p class=\"h3\">YOUR DUTIES AND TASKS:</p>\n<p> </p>\n<ul style=\"\">\n<li style=\"\">Answering phones and emails.</li><li style=\"\">Completing entry-level bookkeeping, including recording expenses, organizing receipts, and completing other transaction records.</li><li style=\"\">Resolving billing issues with clients and internal team members.</li><li style=\"\">Providing account access, usage reports, data analysis, and other ad hoc requests for team members.</li><li style=\"\">Supporting quality assurance checks of various internal and client facing reporting.</li><li style=\"\">Organizing new client contracts, create invoices, and process client payments.</li><li style=\"\">Contributing to internal database maintenance, upkeep and data entry.</li><li style=\"\">Researching, ordering, &amp; distributing company-wide gifts (2-3 times per year).</li><li style=\"\">Organizing company events, competitions, and special projects throughout the year.</li><li style=\"\">Facilitating company holiday, time off, and schedule variation calendars.</li>\n</ul>\n<p class=\"h5\"> </p>\n<p class=\"h5\">We are looking for talented and diligent candidates who excel in our skills tests, and will consider these candidates even if past experience or educational background criteria aren't met.</p>\n<p class=\"h5\"> </p>\n<p>*California, New York, Washington, and Colorado: starting base pay for this position ranges between $15 - $25 per hour.</p>\n<p>Compensation may vary based on factors such as experience, qualifications, skills test performance, geographic location, and seniority of the position offered. Outside of California, New York, Washington, and Colorado compensation may fall outside the above ranges.</p>\n<img src=\"https://remotive.com/job/track/1680495/blank.gif?source=public_api\" alt=\"\"/>","tags":"[\"CSS\",\"excel\",\"frontend\",\"git\",\"html\",\"illustrator\",\"magento\",\"photoshop\",\"php\",\"shopify\",\"wordpress\",\"MySQL\",\"startup\",\"responsive\",\"themes\",\"bootstrap\",\"insurance\",\"jQuery\",\"Ajax\"]","pubDate":"2025-03-11T19:31:23.000Z","link":"https://remotive.com/remote-jobs/marketing/office-assistant-1680495","slug":"office-assistant-coalition-technologies-5996"},{"id":3064080744,"title":"Senior Salesforce Product Owner/Quote to Cash (CPQ) (Pr)","company":"Blue Coding","image":"https://media.licdn.com/dms/image/C4D0BAQHlK67hgnhzQw/company-logo_200_200/0/1631346154820?e=2147483647&v=beta&t=_R2Ssj7L_f4xqmSCcq0nOLCyCz0QN2lFnHssxxhj3YY","description":"<div><b style=\"font-size: 18px;\">Full-time | On-site in Costa Rica</b></div><div><br></div><div><span style=\"font-size: 18px;\">Who are we?</span></div><div><br></div><div>At Blue Coding we specialize in hiring amazing developers and people from all over Latin America and other parts of the world, both through staff augmentation arrangements and direct placements. For nearly a decade, we’ve helped cutting-edge companies in the United States and Canada both large and small build great development teams and develop innovative products. Online shops, digital agencies, SaaS providers, and software consulting firms are just a few of our diverse clients. Our team of over 50 engineers is distributed in more than 10 countries globally. We are a fully remote company working with a wide array of technologies and have expertise in every stage of the software development process.&nbsp;</div><div><br></div><div><span style=\"font-size: 18px;\">What are we looking for?</span></div><div><br></div><div>In this opportunity, we are looking for a Senior Product Owner/Salesforce Quote to Cash (CPQ) to join a global software leader. Your role will help influence and drive the strategy and direction of our client's Salesforce environment that drives their different businesses.</div><div><br></div><div><b>This role is for people who are located in San Jose, Costa Rica Only.</b></div><div><br></div><div><span style=\"font-size: 18px;\">What's unique about this job?</span></div><div><br></div><div>Our client is an established company that specializes in advanced software solutions. It empowers businesses by providing tools that streamline workflows, enhance productivity, and ensure secure operations. With a global customer base and a commitment to innovation, it is dedicated to improving working lives.</div><div><br></div><div>The client emphasizes a collaborative and inclusive culture, offering employees opportunities to grow and contribute meaningfully. By leveraging cutting-edge technologies, they deliver real-time solutions to meet their customers' evolving needs, enabling teams to focus on impactful work.</div><h3>Here are some of the exciting day-to-day challenges you will face in this role:</h3><li>Interpret the business needs, product strategy, and vision for the Salesforce Quote to Cash agile development team by collaborating with business stakeholders, product owners, and cross-functional teams to gather requirements and design solutions.&nbsp;</li><li>Collect and document clear requirements and details of the problems the client is trying to solve.&nbsp;</li><li>Work closely with the Product Manager, triage stakeholder requests, and understand the business needs to identify user pain points and champion solutions.&nbsp;</li><li>Act as the user's voice to the Salesforce Quote to Cash agile development team and draft the strategic objectives for all Program Increments (PIs). Work with the team to decompose Epics into user stories.&nbsp;</li><li>Drive strategic objectives through the prioritized backlog by prioritizing the most valuable and impactful work.&nbsp;</li><li>Groom and maintain a backlog of well-defined Epics so the scrum team can review them in advance of Program Increment planning.&nbsp;</li><li>Document clear acceptance criteria for user stories and Epics. Own the product backlog of user stories for Salesforce Quote to Cash. Collaborate with Product Management, the Product Owner, Architects, etc., to ensure the proper sequencing of user stories based on strategic priorities, technological implications, sprint outcomes/PIs, and dependencies with other teams. </li><li>Assist and/or prepare and produce system demos, incorporating feedback into the product backlog. &nbsp;</li><li>Identify and help mitigate risks for Salesforce Quote to Cash. Raise risks to Product Management for visibility and support where needed. &nbsp;</li><li>Ensure compliance with security, data governance, and industry best practices in all solutions.&nbsp;</li><li>Lead change management efforts, including documentation, training, and user adoption for new solutions.&nbsp;</li><li>You will act as a Scrum Master for the Salesforce Quote to Cash team, removing impediments and ensuring the team stays on track with its work. </li>,<h3>You will shine if you have these skills:</h3><li>Bachelor's degree in Computer Science, Information Technology, or a related field.&nbsp;&nbsp;</li><li>Strong background as a Product Owner in a Salesforce ecosystem with a strong focus on Salesforce CPQ solutions and Quote to Cash business processes.&nbsp;</li><li>Possess a proven understanding of Product SKU structure, Salesforce CPQ configuration, and capabilities. &nbsp;</li><li>Familiarity with SAFe agile methodologies and experience working in a SAFe agile development environment&nbsp;</li><li>Excellent stakeholder management skills with the ability to engage successfully to build strong relationships&nbsp;</li><li>Proven ability to lead teams in a dynamic, agile environment.&nbsp;</li><li>Ability to organize and prioritize effectively&nbsp;</li><li>Solid problem-solving, analytical, and communication skills.&nbsp;</li><li>Process-oriented, identifies and solves problems to standardize and optimize end-to-end processes.&nbsp;</li><li>The candidate will need to be data-driven, continually ask and answer questions with data, framing topics, and quantifying decisions and problems using contextual data.&nbsp;</li>,<h3>It doesn't hurt if you also have:</h3><li>Experience working with data and/or system migrations into Salesforce is a plus.&nbsp;</li><li>Certifications in Salesforce and SAFe agile methodologies are a plus.&nbsp;</li><div><span style=\"font-size: 24px;\">Hey, you are still here!</span></div><div><br></div><div>So, let us ask you a few questions: Are you able to communicate what you are thinking, point out potential pitfalls, and have no hesitation to ask for help when encountering issues? Do you have a passion for scaling business globally? Are you organized, detailed oriented, and self-started? If so, this role is waiting for you! Join us!</div>","tags":"[\"management\"]","pubDate":"2025-03-11T17:52:40.662Z","link":"https://jobs.lever.co/bluecoding/92ec55a7-366e-436b-8418-09d7486cadfe","slug":"senior-salesforce-product-owner-quote-to-cash-cpq-pr-blue-coding-2502"},{"id":6360563823,"title":"M&A Outreach & CRM Specialist (Outbound Sales & Deal Sourcing)","company":"Verdira Acquisitions","image":"https://remotive.com/job/1982911/logo","description":"<ul style=\"\"><li style=\"\"><p><strong>Compensation: $22 to $25 per hour to start, with opportunities for higher earnings based on performance.</strong></p></li><li style=\"\"><p>Top performers will have opportunities for rapid pay increases and long-term growth within Verdira.</p></li><li style=\"\"><p>Employment Type: Part-Time (20 hours per week)<br><br></p></li></ul><p class=\"h2\">About Verdira Acquisitions</p><p>At Verdira Acquisitions, we specialize in strategic business transitions, helping founders navigate the next chapter with care, expertise, and a long-term vision.</p><p><br>We are entrepreneurs, problem-solvers, and deal-makers focused on acquiring and scaling financial services and e-commerce businesses. <br><br>Our mission is to unlock new growth opportunities for businesses and their teams while preserving the legacy of the founders we partner with.<br><br></p><ul style=\"\"><li style=\"\"><p>Currently acquiring a healthcare company in New York &amp; aggressively expanding our deal pipeline.</p></li><li style=\"\"><p>Fast-growing, high-performance environment with real career growth opportunities.</p></li><li style=\"\"><p>Performance-based culture; your success directly impacts your earning potential.</p></li></ul><p><br></p><p>We’re <strong>NOT </strong>a slow, corporate machine. If you need hand-holding, this isn’t for you. </p><p><br></p><p>But if you want to move fast, own your work, and get sh*t done, this is your place.</p><p class=\"h2\"><br>What It’s Like to Work at Verdira<br></p><p>We operate like dealmakers, not bureaucrats. No pointless meetings, no micromanagement; just execution and ownership. </p><p><br></p><p>We move fast, adapt quickly, and reward performance, not politics. If you can think, solve, and close, you’ll grow here.<br><br></p><ul style=\"\"><li style=\"\"><p>If you thrive in a fast-paced, no-BS, results-driven environment, this is the place for you.</p></li><li style=\"\"><p>If you need someone to hold your hand, micromanage you, or check in every hour, this isn't the job for you.<br><br></p></li></ul><p class=\"h2\">Who Should Apply?<br></p><ul style=\"\"><li style=\"\"><p><strong>Must be physically located in the United States, Latin America, or Europe.</strong></p></li><li style=\"\"><p>Candidates from LATAM and Europe must have lived or worked significantly in the U.S. market and <strong>must have clear, professional spoken English </strong>(no heavy accent that would hinder seller engagement).</p></li><li style=\"\"><p>Must be highly efficient and results-driven, capable of making 50+ outbound calls per day.</p></li><li style=\"\"><p>Minimum 2 years of experience in deal sourcing, operations, business development, lead generation, or CRM management.</p></li><li style=\"\"><p>Familiarity with CRM systems (Go High Level, HubSpot, Salesforce, Pipedrive, etc.).</p></li><li style=\"\"><p>Strong communication skills with the ability to engage business owners and handle objections.</p></li><li style=\"\"><p>Must be highly organized and able to execute quickly without micromanagement.<br><br></p></li></ul><p>🚨 This is NOT a fit if:</p><p><br>❌ You need constant direction instead of proactively improving workflows.<br>❌ You can’t handle rejection, objections, or making 50+ calls a day.<br>❌ You want a cushy, easy remote job with no pressure.<br><br></p><p class=\"h2\">Why This Role is Different?<br></p><ul style=\"\"><li style=\"\"><p>High-volume outreach: 50+ calls per day (achievable in 3–4 focused hours).</p></li><li style=\"\"><p>Results-Driven, Not Time-Tracked: <strong>No micromanagement</strong>, just execution.</p></li><li style=\"\"><p>Growth Potential: As Verdira acquires companies, top performers will have opportunities to transition into operations, sales, or strategic roles.<br><br></p></li></ul><p class=\"h2\">Key Responsibilities<br></p><p class=\"h3\">1. Business Owner Outreach &amp; Relationship Development<br><br></p><ul style=\"\"><li style=\"\"><p>50+ calls/day engaging business owners in finance &amp; e-commerce.</p></li><li style=\"\"><p>Turn cold leads into warm opportunities.</p></li><li style=\"\"><p>Handle objections &amp; follow-ups to keep deals moving.</p></li><li style=\"\"><p>Track everything in CRM (Go High Level, HubSpot, Salesforce).</p></li><li style=\"\"><p>Top performers earn bonuses.<br><br></p></li></ul><p class=\"h3\">2. CRM &amp; Pipeline Management (Go High Level – GHL or Similar CRM)<br><br></p><ul style=\"\"><li style=\"\"><p>Maintain accurate tracking of outreach activity, seller responses, and deal progress.</p></li><li style=\"\"><p>Use CRM tools (Go High Level, HubSpot, Salesforce) to manage workflows and structure follow-ups.</p></li><li style=\"\"><p>Own lead engagement—no leads should slip through the cracks.<br><br></p></li></ul><p class=\"h3\">3. Executive Support in Deal Sourcing &amp; Scheduling<br><br></p><ul style=\"\"><li style=\"\"><p>Identify acquisition targets through research.</p></li><li style=\"\"><p>Schedule meetings between executives and qualified sellers.</p></li><li style=\"\"><p>Prepare reports on outreach performance and key acquisition metrics.<br><br></p></li></ul><p class=\"h3\">4. Process Ownership &amp; Optimization<br><br></p><ul style=\"\"><li style=\"\"><p>Improve outreach scripts, SOPs, CRM workflows, and deal tracking.</p></li><li style=\"\"><p>Identify inefficiencies and propose solutions to improve productivity.</p></li><li style=\"\"><p>Take ownership—this role is for self-starters, not micromanaged employees.</p></li></ul><p><br></p><p class=\"h2\">What Your Growth Path Looks Like at Verdira</p><p>Step 1: Master Outreach &amp; Deal Sourcing: Learn the playbook for sourcing deals, handling objections, and building a strong pipeline.<br><br>Step 2: Become a Senior Deal Sourcer: Take on higher-value leads, work directly with the acquisition team, and refine negotiation skills.<br><br>Step 3: Move into Acquisitions, Sales Leadership, or Operations: Top performers can transition into closing deals, leading teams, or managing acquired companies.<br><br></p><p>This is <strong>NOT </strong>a dead-end job. <br><br></p><p>If you execute, you grow. Period.</p><p><br></p><p class=\"h2\">Why Join Verdira Acquisitions?<br></p><ul style=\"\"><li style=\"\"><p>Part-Time, 20-Hour Workweek with High Earning Potential.</p></li><li style=\"\"><p>Performance-Based Bonuses for High Output: Earn more by consistently generating strong leads.</p></li><li style=\"\"><p>Fully Remote &amp; Flexible Schedule: We care about execution, not hours logged.</p></li><li style=\"\"><p>Direct Exposure to the Business Acquisitions Space.</p></li><li style=\"\"><p>Opportunities for Long-Term Growth in Operations, Sales, or Acquisitions.<br><br></p></li></ul><p class=\"h2\">How to Apply – Screening Process<br></p><p>THIS ROLE IS ONLY FOR HIGH-PERFORMERS – DO NOT APPLY IF YOU CAN’T EXECUTE.<br><br><strong>You MUST answer these questions in your cover letter:<br><br></strong></p><ol style=\"\"><li style=\"\"><p>Your Interest in Acquisition Entrepreneurship &amp; Business Acquisitions</p><ul style=\"\"><li style=\"\"><p>Why are you interested in business acquisitions and deal sourcing?</p></li><li style=\"\"><p>What excites you about working in an acquisitions firm like Verdira?<br><br></p></li></ul></li><li style=\"\"><p>Why This Role at Verdira Acquisitions Aligns With Your Skills &amp; Career Goals</p><ul style=\"\"><li style=\"\"><p>How does this position fit with your experience and long-term career plans?</p></li><li style=\"\"><p>What specific skills make you a strong candidate for this role?<br><br></p></li></ul></li><li style=\"\"><p>Any Relevant Experience in Cold Calling, Outreach, CRM Management, or Deal Sourcing</p><ul style=\"\"><li style=\"\"><p>Have you worked in a role that required cold calling or seller outreach?</p></li><li style=\"\"><p>What CRM systems have you used, and how have you managed outreach pipelines?</p></li><li style=\"\"><p>Can you give an example of a time you handled objections and turned a hesitant prospect into an opportunity?<br><br></p></li></ul></li><li style=\"\"><p><strong>Submit your cover letter and resume to this Google Form:</strong>Submit your cover letter and resume to this Google Form<strong>:</strong> <a href=\"https://forms.gle/HL9AKKr5DnEUvawK9\" rel=\"nofollow\" target=\"_blank\">https://forms.gle/HL9AKKr5DnEUvawK9</a><br><br></p></li></ol><p class=\"h3\">Interview Process<br><br></p><p>Step 1: Resume &amp; Cover Letter Review: Only detailed responses will be considered.<br><br>Step 2: First Interview: Candidates will be asked to submit a 1–2 minute voice recording to assess clarity, tone, and confidence.<br><br>Step 3: Final Interview: Live Objection Handling &amp; CRM Test. Candidates will be evaluated on handling seller objections and CRM workflow management.</p><p>We look forward to hearing from you!<br><br></p><p>Best,<br>Verdira Acquisitions Hiring Team<br>Website: <a href=\"http://www.VerdiraAcquisitions.com\" rel=\"nofollow\" target=\"_blank\">www.VerdiraAcquisitions.com</a></p>\n<img src=\"https://remotive.com/job/track/1982911/blank.gif?source=public_api\" alt=\"\"/>","tags":"[\"accounting\",\"go\",\"salesforce\",\"research\",\"CRM\",\"healthcare\",\"business development\",\"bookkeeping\",\"hubspot\",\"financial services\",\"lead generation\",\"pipedrive\"]","pubDate":"2025-03-11T08:45:46.000Z","link":"https://remotive.com/remote-jobs/sales-business/m-a-outreach-crm-specialist-outbound-sales-deal-sourcing-1982911","slug":"m-a-outreach-crm-specialist-outbound-sales-deal-sourcing-verdira-acquisitions-2244"}]