[{"id":7526039940,"title":"Data Analyst + Customer relationships (Remote/ Brazil)","company":"MixRank","image":"https://pbs.twimg.com/profile_images/378800000147745937/0fac42c12b433bbbd53ff3e15cd6fca4_400x400.png","description":"<p><strong>Who We Are</strong><br>\nMixRank is a YC-backed, profitable Data-as-a-Service (DaaS) company, founded in 2011. We manage over 3 petabytes of data monthly and are focused on building something meaningful and sustainable for the long term. Our globally distributed team of over 40 remote professionals is committed to continuous learning, steady growth, and making a lasting impact. We’re proud of our decade-long journey of growth and profitability. Our customers include some of the world's largest sales platforms, recruitment solutions, venture capital firms, and private equity companies, as well as cutting-edge startups from Y Combinator.<br>\n<br>\n<strong>Who We're Looking For</strong><br>\nWe're seeking an experienced <strong>Data Analyst</strong> to join our team, who can not only excel in data analysis but also take ownership of customer relationships. In this role, you'll operate as an independent contributor, working directly with enterprise clients to provide data insights while also managing all aspects of the client relationship—much like a Customer Success Manager. You’ll ensure clients achieve their business goals using our data products and build long-term partnerships with them.<br>\n<br>\n<strong>Key Qualifications</strong></p>\n<ul>\n<li>5+ years of experience as a Data Analyst, with a demonstrated ability to work independently and manage end-to-end data projects.</li>\n<li>Previous experience in a Customer Success, Account Management, or related role, with a focus on managing enterprise client relationships.</li>\n<li>Strong proficiency in SQL, data visualization tools, and experience working with large datasets.</li>\n<li>Excellent communication skills, with the ability to explain data-driven insights to both technical and non-technical stakeholders.</li>\n<li>Proven ability to manage multiple projects, prioritize tasks, and deliver high-quality results in a remote, fast-paced environment.</li>\n<li>Self-starter with a strong sense of ownership and accountability, comfortable working independently.</li>\n</ul>\n<p><strong>What You’ll Be Doing</strong></p>\n<ul>\n<li><strong>Independent Data Analysis:</strong> Work closely with enterprise clients to gather requirements, analyze large datasets, and deliver actionable insights that help them achieve their business objectives.</li>\n<li><strong>Customer Success:</strong> Take full responsibility for the success of your clients. Act as the primary point of contact for all client communication, ensuring they maximize the value of our data products. Handle support requests, escalations, and proactively engage with clients to anticipate their needs.</li>\n<li><strong>Client Relationship Management:</strong> Build and maintain strong client relationships, acting as a trusted advisor. Ensure customers are satisfied and help them get the most out of our data services.</li>\n<li><strong>Project Management:</strong> Oversee the lifecycle of data projects, ensuring timely delivery, clear communication, and successful outcomes for the client.</li>\n<li><strong>Cross-functional Collaboration:</strong> Work closely with product, engineering, and other internal teams to align our data solutions with client needs, offering feedback and insights to drive improvements.</li>\n</ul>\n<p><strong>Opportunities for Growth</strong><br>\nAs you excel in this role, you will have the opportunity to <strong>build and lead a team of data analysts</strong> and customer success professionals. You’ll mentor junior team members and play a crucial role in expanding the data and customer success functions as we continue to grow.</p>\n<p><strong>What’s In It for You</strong></p>\n<ul>\n<li><strong>100% Remote Work:</strong> Work from anywhere, anytime. We value results, not the hours you clock, and trust you to manage your time effectively.</li>\n<li><strong>Home-office Setup:</strong> We provide a Remote Office Grant to ensure you have a comfortable, productive workspace.</li>\n<li><strong>Comprehensive Health Coverage:</strong> We offer 100% health coverage and term life insurance.</li>\n<li><strong>Personal Development:</strong> Enjoy an unlimited book budget to continue learning, plus we cover Netflix and Spotify subscriptions as part of our Entertainment Allowance.</li>\n<li><strong>Flexible Leave Policy:</strong> Recharge with flexible time off, as long as you’re supporting your team and meeting expectations.</li>\n</ul>\n<p>If you're a skilled data analyst who enjoys working directly with clients and is ready to take on the dual responsibility of driving both data insights and customer success, we'd love to hear from you! Apply now and help shape the future of MixRank's data-driven customer solutions.</p>\n","tags":"[\"management\",\"engineering\"]","pubDate":"2024-09-20 06:43:36.226","link":"https://www.ycombinator.com/companies/mixrank/jobs/P9dlOc2-data-analyst-customer-relationships-remote-brazil","savedDate":"2024-09-20 06:43:36.226","slug":"data-analyst-customer-relationships-remote-brazil-mixrank-231"},{"id":8810211809,"title":"Marketing Automation and Analysis Executive (Remote/Anywhere)","company":"Collabora","image":"https://media.licdn.com/dms/image/D4E0BAQFdRsd49YG4fQ/company-logo_200_200/0/1688735422027/collabora_logo?e=2147483647&v=beta&t=COQKgdesE_abHpZN-7BjhNZ1IKm2nhQyHB637TbP88E","description":"<div class=\"section page-centered\" data-qa=\"job-description\"><div>We are seeking a Marketing Automation and Analysis Executive to manage and implement our email marketing strategies, analyse market data and the result of our marketing activities. You will be responsible for maintaining our email automation platform, creating, executing and optimizing email marketing campaigns to drive engagement, conversion, revenue and reporting on the effectiveness of the team’s marketing activities.</div><div><br></div><div>Your expertise in email marketing automation platforms and your ability to analyse data will be critical in ensuring our marketing efforts are targeted, personalized, and effective. You will work closely with teams across the business including marketing, design and development, to deliver impactful email campaigns that align with our brand values and objectives, and report on other marketing activities.</div></div><div class=\"section page-centered\"><div><h3>Areas of Focus</h3><ul class=\"posting-requirements plain-list\"><ul><li>Manage and maintain our open source email automation platform (we currently use Mautic)</li><li>Develop and execute email marketing strategies, including planning, segmentation, creation, scheduling and optimization of email campaigns</li><li>Implement and manage automated email marketing campaigns, including trigger-based emails, drip campaigns and personalized messaging</li><li>Segment and target email lists based on customer behaviour, demographics and preferences in order to optimise campaign effectiveness</li><li>Monitor and analyse email marketing metrics such as open rates, click-through rates, conversion rates, and overall engagement, in order to measure campaign performance and identify areas for improvement</li><li>Collaborate with cross-functional teams to create engaging email content including copy, graphics and CTA’s to create visually appealing and impactful emails that align with brand guidelines</li><li>Ensure compliance with email marketing best practices and regulations to maintain a high standard of data privacy and security</li><li>Collaborate with the marketing team to integrate email campaigns with other marketing channels such as social media and content marketing, in order to ensure consistent messaging and maximize campaign impact</li><li>Stay up to date with industry trends, emerging technologies, and best practices in email marketing automation to continually improve campaign performance and deliver innovative solutions</li><li>Provide regular reports and insights to stakeholders on marketing activities, highlighting key findings and recommendations for \toptimisation</li><li>Regularly review and analyse competitor content across their marketing platforms and report back to the marketing team with potential strategies to implement</li></ul></ul></div></div><div class=\"section page-centered\"><div><h3>Competencies</h3><ul class=\"posting-requirements plain-list\"><ul><li>Previous experience with Open Source Marketing Automation Tools: e.g.. Mautic</li><li>Proven experience in email marketing, preferably in a B2B environment</li><li>Proficiency in email marketing automation platforms, ideally Open Source</li><li>Experience in segmenting and targeting email lists based on user behaviour, demographics and preferences</li><li>Strong understanding of email marketing best practices, compliance regulations and data privacy laws</li><li>Analytical mindset with the ability to interpret data and make data-driven decisions</li><li>Good understanding of design principles and the ability to collaborate effectively with designers</li><li>Excellent written and verbal skills in English with the ability to create compelling email copy</li><li>Attention to detail whilst handling multiple projects simultaneously</li><li>Based within +/- 3 hours of UK time zone</li></ul></ul></div></div><div class=\"section page-centered\"><div><h3>Ideal Experience</h3><ul class=\"posting-requirements plain-list\"><ul><li>Degree in marketing, communications or a relevant technical field</li><li>Passion for Open Source and a good understanding of the Open Source community</li><li>Awareness of the office document creation competitive landscape</li><li>Experience with FLOSS tools and and/or the Linux Desktop</li><li>Experience working remotely</li></ul></ul></div></div><div class=\"section page-centered\" data-qa=\"closing-description\"><div>This is an ideal role for somebody who has experience in creating, executing and managing email campaigns and automations, the ability to maintain an open source email automation platform and has an analytical mindset.</div><div><br></div><div><br></div><div><br></div><div><br></div><div>#LI-Remote</div><div><br></div></div><div class=\"section page-centered last-section-apply\" data-qa=\"btn-apply-bottom\"><a class=\"postings-btn template-btn-submit hex-color\" data-qa=\"show-page-apply\" href=\"https://jobs.lever.co/collabora/9e6b3b1f-5f79-4ee1-b7b8-18993562b1e6/apply\">Apply for this job</a></div>","tags":"[\"B2B\",\"aws\"]","pubDate":"2024-09-20 06:43:36.226","link":"https://jobs.lever.co/collabora/9e6b3b1f-5f79-4ee1-b7b8-18993562b1e6","savedDate":"2024-09-20 06:43:36.226","slug":"marketing-automation-and-analysis-executive-remote-anywhere-collabora-7277"},{"id":5699586946,"title":"Senior Growth Product Manager","company":"Instrumentl","image":"https://pbs.twimg.com/profile_images/1263546899153502209/ObHsQoNr_400x400.jpg","description":"<div class=\"section page-centered\" data-qa=\"job-description\"><div><b style=\"font-size: 18px\">Hello, we’re Instrumentl.</b></div><div><br></div><div><span style=\"font-size: 16px\">We’re a mission-driven startup helping the nonprofit sector to drive impact, and we’re well on our way to becoming the </span><b style=\"font-size: 16px\">#1</b><span style=\"font-size: 16px\"> most-loved grant discovery and management tool. To help us get there, we’re hiring a </span><b style=\"font-size: 16px\">Senior Growth Product Manager </b><span style=\"font-size: 16px\">who will validate and scale new growth initiatives by building product-led growth strategies, focusing on taking initiatives from 0 to 1 and scaling them from 1 to 10.</span></div><div><br></div><div><span style=\"font-size: 16px\">Are you a creative, data-driven leader who thrives on scaling products through iterative testing and optimization? Do you love uncovering growth opportunities through product insights and leading growth R&amp;D efforts from concept to implementation? If so, this position is for you.</span></div><div><br></div><div><b style=\"font-size: 18px\">About us:</b></div><div><br></div><div><a class=\"postings-link\" style=\"font-size: 16px\" href=\"https://www.instrumentl.com/\">Instrumentl</a><span style=\"font-size: 16px\"> is a hypergrowth YC-backed startup with over 4,000 nonprofit clients, from local homeless shelters to larger organizations like the San Diego Zoo and the University of Alaska. We are building the future of fundraising automation, helping nonprofits to discover, track, and manage grants efficiently through our SaaS platform.</span></div><div><br></div><div><span style=\"font-size: 16px\">Our charts are dramatically up-and-to-the-right 📈 — we’re cash flow positive and doubling year-over-year, with customers who love us (NPS is 65+ and Ellis PMF survey is 60+). Join us on this rocket ship to Mars!</span></div><div><br></div><div><b style=\"font-size: 18px\">About the role:</b></div><div><br></div><div><span style=\"font-size: 16px\">As the Senior Growth Product Manager at Instrumentl, you will lead key growth initiatives with a focus on optimizing product features, user journeys, and leveraging product insights to unlock growth. Our ideal candidate is proactive, eager to learn, willing to experiment, and excited to collaborate with multiple teams to expand Instrumentl's reach. </span></div><div><br></div><div><span style=\"font-size: 16px\">You'll be joining our small, highly autonomous team, reporting directly to Will, our Head of Growth. Get to know us at&nbsp;</span><a class=\"postings-link\" style=\"font-size: 16px\" href=\"https://www.instrumentl.com/about\">instrumentl.com/about</a><span style=\"font-size: 16px\">!</span></div><div><br></div><div><span style=\"font-size: 16px\">Instrumentl is fully distributed (though if you’d like to work from our Oakland office, we would love to see you there).&nbsp; For this position, we are looking for someone based in the continental US, but open to those flexible to Eastern or Central Time standard working hours as well.</span></div></div><div class=\"section page-centered\"><div><h3>What you'll get to do:</h3><ul class=\"posting-requirements plain-list\"><ul><li>Size growth opportunities and conduct R&amp;D on new product initiatives that drive Instrumentl's reach and impact.</li><li>Build business cases for new product experiments and features, prioritizing those with the highest potential ROI and user impact.</li><li>Run experiments to validate initiatives from 0 to 1, including optimizing user activation, retention, and expansion through feature improvements.</li><li>Collaborate cross-functionally with product, engineering, design, and other growth teams to ensure successful scaling of product features from 1 to 10.</li><li>Identify and validate growth hypotheses based on product analytics, using data to guide decision-making and ensure high-impact outcomes.</li><li>Create clear and scalable SOPs for validated growth opportunities to be managed by full-time teams.</li><li>Lead efforts to optimize user onboarding, activation flows, and in-product experiences to drive conversions and retention.</li></ul></ul></div></div><div class=\"section page-centered\"><div><h3>What we're looking for:</h3><ul class=\"posting-requirements plain-list\"><ul><li><b>5+ years of growth or product experience: </b>You've ideally worked in SaaS, with a proven ability to build and scale growth initiatives through product-led strategies.</li><li><b>Founder’s mindset: </b>You think like an owner, always looking for opportunities to innovate and create long-term value within the product.</li><li><b>Growth-obsessed: </b>You’re relentless in testing, iterating, and optimizing product features to drive measurable impact.</li><li><b>Ownership mentality: </b>You take full responsibility for projects, ensuring high-quality outcomes and consistent iteration. You exhibit a growth mindset and take feedback in stride. </li><li><b>Rigorous execution: </b>You’re detail-oriented, highly organized, and committed to driving product initiatives to completion.</li><li><b>Strong analytical skills: </b>Proficient in tools like Amplitude, Mixpanel, Google Analytics, and Excel, you interpret data and make informed, growth-driven decisions.</li><li><b>Resourceful and autonomous: </b>You thrive in fast-paced, high-autonomy environments, taking initiative and figuring things out independently.</li><li><b>Clear and effective communication: </b>You can simplify complex product strategies, aligning cross-functional teams around key initiatives.</li><li><b>Passion:&nbsp;</b>You’re excited about Instrumentl’s mission to propel nonprofits into a bigger, brighter future!</li></ul></ul></div></div><div class=\"section page-centered\"><div><h3>Bonus points:</h3><ul class=\"posting-requirements plain-list\"><ul><li>Experience working in <b>(or founding!) </b>early-stage startups.</li><li>Comfort with ambiguity and ability to wear many hats.</li><li>Experience in nonprofit fundraising or grants.</li><li>Experience working remotely.</li></ul></ul></div></div><div class=\"section page-centered\"><div><h3>Compensation and Benefits: </h3><ul class=\"posting-requirements plain-list\"><ul><li>Salary ranges are based on market data, relative to our size, industry, and stage of growth. Salary is one part of total compensation, which also includes equity, perks, and competitive benefits.&nbsp;</li><li>For US-based candidates, our target salary band is&nbsp;<b>$130,000 - $190,000/year&nbsp;</b>+ equity. Salary decisions will be based on multiple factors including geographic location, qualifications for the role, skillset, proficiency, and experience level.&nbsp;</li><li>100% covered health, dental, and vision insurance for employees, 50% for dependents</li><li>Generous PTO policy, including parental leave</li><li>401(k)</li><li>Company laptop + stipend to set up your home workstation</li><li>Company retreats for in-person time with your colleagues</li><li>Work with awesome nonprofits around the US. We partner with incredible organizations doing meaningful work, and you get to help power their success.</li></ul></ul></div></div><div class=\"section page-centered\" data-qa=\"closing-description\"><div><b style=\"font-size: 18px\">What to expect: </b></div><div><br></div><div><span style=\"font-size: 16px\">Instrumentl is evolving rapidly. You’ll always have new challenges and opportunities to grow in your role - you won’t be bored! You’ll be an early member of our small but mighty team, playing a huge part in shaping our culture for the years and teammates to come.</span></div><div><br></div><div><b style=\"font-size: 16px\">At Instrumentl:</b></div><div><br></div><div><span style=\"font-size: 16px\">- </span><b style=\"font-size: 16px\">We’re customer-focused. </b><span style=\"font-size: 16px\">We routinely seek feedback from our customers to improve the Instrumentl experience for everyone. Our first company value is \"The customer is the hero\" and we mean it.&nbsp;</span></div><div><span style=\"font-size: 16px\">- </span><b style=\"font-size: 16px\">We love to experiment.</b><span style=\"font-size: 16px\"> We are constantly generating new concepts and iterating to see what works - ideation and experimentation are essential here. \"Bend the curve\" is another key company value.</span></div><div><span style=\"font-size: 16px\">- </span><b style=\"font-size: 16px\">We appreciate authenticity.</b><span style=\"font-size: 16px\"> We have a diverse range of life experiences, and we encourage open, clear communication with each other about the things that matter most to us.</span></div><div><span style=\"font-size: 16px\">- </span><b style=\"font-size: 16px\">We’re approachable and collaborative.</b><span style=\"font-size: 16px\"> Everyone has a voice, and we’re all building Instrumentl together.</span></div><div><span style=\"font-size: 16px\">- </span><b style=\"font-size: 16px\">We kick it every day with some of the nicest people in the world.</b><span style=\"font-size: 16px\"> No joke, our customers are often on the front lines educating kids, saving endangered species, and restoring watersheds. In helping them take advantage of Instrumentl’s technology, you’re helping them move the world forward.</span></div><div><br></div><div><b style=\"font-size: 16px\">Ready to apply?</b></div><div><br></div><div><span style=\"font-size: 16px\">Using the 'Apply' button, please submit either a short Loom video or a written response addressing the following prompts:</span></div><div><br></div><div><span style=\"font-size: 16px\">1. Describe a growth experiment you led that focused on user activation, retention, or expansion. What product insights did you use, and how did you collaborate with product, design, and engineering to execute it?</span></div><div><br></div><div><span style=\"font-size: 16px\">2. Tell us about a time when you optimized a product feature to drive growth. How did you identify the opportunity, run experiments, and measure success? </span></div><div><br></div><div><span style=\"font-size: 16px\">Don't forget to include the word </span><b style=\"font-size: 16px\">moxie </b><span style=\"font-size: 16px\">in your application to show you read this from start to finish! Along with your written response or Loom video, please attach your CV or resume.</span></div><div><br></div><div><i style=\"font-size: 16px\">At Instrumentl, we pride ourselves on building a diverse team from the ground up. Every role is an opportunity to teach, learn, and create some of your best work - if you’re excited to grow along with us, we encourage you to apply!</i></div></div><div class=\"section page-centered last-section-apply\" data-qa=\"btn-apply-bottom\"><a class=\"postings-btn template-btn-submit hex-color\" data-qa=\"show-page-apply\" href=\"https://jobs.lever.co/Instrumentl/e1c679b8-19e8-4f73-b2a9-1d1c00436035/apply\">Apply for this job</a></div>","tags":"[\"management\",\"engineering\"]","pubDate":"2024-09-20 06:43:36.225","link":"https://jobs.lever.co/Instrumentl/e1c679b8-19e8-4f73-b2a9-1d1c00436035","savedDate":"2024-09-20 06:43:36.225","slug":"senior-growth-product-manager-instrumentl-1419"},{"id":2575416833,"title":"Regional Sales Director, US East & EMEA [M4]","company":"Sourcegraph","image":"https://pbs.twimg.com/profile_images/1428393724527190022/4mt5PACL_400x400.png","description":"\n    <div class=\"content-intro\"><h2><strong><span style=\"color: #a112ff;\">Who we are</span></strong></h2>\n<p>Our mission at Sourcegraph is to make it so that <a href=\"https://www.notion.so/sourcegraph/Mission-values-e9d37e6b972a4ef395c3076aea2bd07d?pvs=4\">everyone can code</a>, not just ~0.1% of the population. We're building the code intelligence platform that powers the world's best code search and the most popular open-source code AI tool. It’s an exciting time to join Sourcegraph—AI has taken over the world, and we aim to automate 99% of the toil in software engineering with our code understanding and code AI tools, leaving the remaining 1% to the irreplicable creative spark from humans.&nbsp;</p>\n<p>Our customers range from startups to the Fortune 500, 4/5 FAANG companies, government organizations, Uber, Plaid, and more. We’ve raised $225M at a $2.625B valuation from <a href=\"https://techcrunch.com/2021/07/13/sourcegraph-raises-125m-series-d-on-2-6b-valuation-for-universal-code-search-tool/\">a16z</a>,<a href=\"https://about.sourcegraph.com/blog/series-c-with-sequoia/\"> Sequoia</a>, <a href=\"https://www.redpoint.com/companies/sourcegraph/\">Redpoint</a>, <a href=\"https://medium.com/craft-ventures/why-we-invested-in-sourcegraph-5ace28317e3d\">Craft</a> and others. We’re making ambitious bets on our future and we’re looking to hire exceptional people to join our team as we make Sourcegraph one of the biggest and most influential companies in the world.</p></div>\n\n    <h2><span style=\"color: rgb(161, 18, 255);\"><strong>Location</strong></span></h2>\n<p>🌎 While we are an all-remote company and hire <a href=\"https://sourcegraph.notion.site/How-we-engage-talent-outside-of-the-US-218f7193695a46cbb1ef39ef9c1f72d4\">almost anywhere</a> in the world, we have a preference for someone to reside in the following location for this role. However, if you feel qualified, we welcome you to apply regardless of location. No matter what, working hours must overlap with EST for at least 40 hours/week.</p>\n<p><strong>Preferred locations:</strong></p>\n<ul>\n<li>Remote - New York City, New York</li>\n</ul>\n<h2><span style=\"color: rgb(161, 18, 255);\"><strong>Why this job is exciting</strong></span></h2>\n<p>Are you a visionary sales leader ready to drive the growth of a cutting-edge technology that’s revolutionizing software development? Sourcegraph is on a mission to make it easier for developers to understand, navigate, and collaborate on code at massive scale.&nbsp;</p>\n<p>As a Regional Sales Director, you’ll be at the forefront of this exciting journey, leading a powerhouse team of Account Executives to expand our footprint and bring our game-changing code intelligence platform to top-tier companies. Imagine being the driving force behind a product that empowers developers to innovate faster, solve complex problems, and build the future of software. If you're ready to elevate your Leadership career and be a key player in a company that’s transforming how the world’s best code is built, Sourcegraph is where you belong.</p>\n<p>📅 Within one month, you will…</p>\n<ul>\n<li>Begin 1:1’s with your Account Executives, understand your 30-60-90 plan, and meet &amp; shadow current members of the Sourcegraph team.</li>\n<li>Work directly with your manager and peers on new initiatives and ways to improve day-to-day operations; build the best Sales Executive team in the industry.</li>\n<li>Set your OKRs (Objectives and Key Results) with your manager and develop an action plan to achieve them.</li>\n<li>Meet key partners in Account Management, Finance, Marketing, Executives, etc. - they will be key relationships for you throughout your AE’s deal cycle.</li>\n<li>Understand the Sourcegraph customer base, ICP, product and value proposition</li>\n<li>Begin to hire, develop, coach and manage a strong team of Account Executives to meet and exceed sales objectives</li>\n</ul>\n<p>📅 Within three months, you will…</p>\n<ul>\n<li>Define and execute a regional sales plan to meet and exceed sales goals in new and existing accounts.</li>\n<li>Empower Account Executives through strategic planning sessions, accountability and execution.</li>\n<li>Be a product expert and feel comfortable assisting your team in closing deals</li>\n<li>Accurately assess the capabilities, motivators, and career goals of each team member and provide ongoing coaching to improve their performance and support their career path</li>\n<li>Develop and implement sales strategies that drive monthly, quarterly and yearly growth against company targets</li>\n<li>Perform regular pipeline reviews and accurately forecast sales pipeline&nbsp;</li>\n<li>Participate in team-building and company-growth activities including strategy setting, sales training, marketing efforts and client care</li>\n<li>Learn and maintain in-depth knowledge of Sourcegraph’s product, value, competitors, and unified communications and collaboration industry trends</li>\n<li>Consistently help your team achieve their activity goals</li>\n</ul>\n<p>📅 Within six months, you will…</p>\n<ul>\n<li>Consistently help your team meet or exceed quota</li>\n<li>Continue to focus on your OKRs</li>\n</ul>\n<p>📅 Within one year, you will…</p>\n<ul>\n<li>Be considered a top-performing team leader by consistently exceeding team goals</li>\n<li>Cultivate a team of Account Executives that see consistent month-over-month success</li>\n<li>Serve as a mentor, leader, or coach to other new peers of the team</li>\n</ul>\n<h2><span style=\"color: rgb(161, 18, 255);\"><strong>About you&nbsp;</strong></span></h2>\n<p>We are seeking a results-oriented, motivated, and strategic sales leader who is laser-focused on developing a team of Account Executives responsible for hunting net-new business with enterprise customers. On a day-to-day basis, you will be responsible for overseeing our Account Executives, helping them educate the market about the power of Sourcegraph, and generating opportunities with new customers.&nbsp; We are looking for a leader who thrives in a fast-paced environment and has a proven track record of leading teams that exceed sales targets.</p>\n<p>Your skill-set:</p>\n<ul>\n<li>4+ years of enterprise sales leadership experience.&nbsp;</li>\n<li>Expert knowledge and experience in building and motivating sales teams, growing pipeline, and hitting and exceeding revenue targets.</li>\n<li>Expertise in developing and executing regional sales strategies that align with company objectives and drive significant revenue growth.</li>\n<li>Strong background in selling to enterprise customers, with a deep understanding of the complexities and nuances of enterprise sales cycles.</li>\n<li>In-depth knowledge of the developer tools market and Sourcegraph’s offerings, with the ability to articulate value propositions and competitive advantages.</li>\n<li>A solid understanding of software development processes and technical concepts, enabling effective communication with technical teams and customers.</li>\n<li>Consistent achievement of sales goals with high seller participation.</li>\n</ul>\n<h2><span style=\"color: rgb(161, 18, 255);\"><strong>Level</strong></span></h2>\n<p>📊 This job is an M4. You can read more about <a href=\"https://www.notion.so/sourcegraph/Leveling-Guide-0e1b5c76ada64b9caac387f8b7c4fc66\">our job leveling philosophy</a> in our Handbook.</p>\n<h2><strong>Compensation</strong></h2>\n<p><strong>💸 We pay you an above-average salary</strong> because we want to hire the best people who are fully focused on helping Sourcegraph succeed, not worried about paying bills. As an <a href=\"https://sourcegraph.notion.site/Mission-values-e9d37e6b972a4ef395c3076aea2bd07d\">open and transparent</a> company that values <a href=\"https://www.notion.so/sourcegraph/Compensation-Pay-Transparency-at-Sourcegraph-d58d0774f51b4b489d41c3628d30ff8d?pvs=4\">competitive compensation</a>, our compensation ranges are visible to every single Sourcegraph teammate.</p>\n<p>Your salary is determined by your pay band for the M4 job level. For determining pay bands, we use a number of market and data-driven salary sources, along with your location zone, and target the high-end of the range to ensure we’re always paying above market regardless of where you live in the world. Both U.S. and international locations are divided into one of four zones, determined by the cost of labor index for each area. The salary for a successful candidate will be based on level, job-related skills, experience, qualifications, and location zone. Please note that the salaries below may be adjusted in the future.</p>\n<p>💰 The target compensation for this role is based on the M4 pay band for your zone. The start of the M4 pay band for each zone is listed below:</p>\n<ul>\n<li>Zone 1: $195,000 USD&nbsp; base + $195,000 USD variable ($390,000 USD on-target-earnings).&nbsp;</li>\n</ul>\n<p>Please speak with a recruiter for additional information regarding zone locations.</p>\n<p>📈 In addition to our cash compensation, we offer equity (because when we succeed as a company, we want you to succeed, too) and generous <a href=\"https://sourcegraph.notion.site/Benefits-Perks-dd1da4b6b3a64780abed010a144d34ba\">perks &amp; benefits</a>.</p>\n<h2><span style=\"color: rgb(161, 18, 255);\"><strong>Interview process&nbsp;</strong></span></h2>\n<p><em>Below is the interview process you can expect for this role (you can read more about </em><a href=\"https://sourcegraph.notion.site/Types-of-interviews-f279f080583d49ee9f2c60e30c8cb1f7\"><em>the types of interviews</em></a><em> in our Handbook). It may look like a lot of steps, but rest assured that we move quickly and the steps are designed to help you get the information needed to determine if we’re the right fit for you… Interviewing is a two-way street, after all!&nbsp;</em></p>\n<p>We expect the interview process to take 5.5 hours in total.&nbsp;</p>\n<p><strong>👋 Introduction Stage</strong> - we have initial conversations to get to know you better…</p>\n<ul>\n<li>[30m]&nbsp;<a href=\"https://www.notion.so/sourcegraph/Types-of-interviews-sample-questions-f279f080583d49ee9f2c60e30c8cb1f7?pvs=4#99be5ff628b2414194a0ba79d9f25f13\">Recruiter Screen</a></li>\n<li>[30m]&nbsp;<a href=\"https://www.notion.so/sourcegraph/Types-of-interviews-sample-questions-f279f080583d49ee9f2c60e30c8cb1f7?pvs=4#1919882c0cf147c487eb1df40db8a694\">Hiring Manager Screen</a></li>\n</ul>\n<p><strong>🧑‍💻 Team Interview Stage</strong> - we then delve into your experience in more depth and introduce you to members of the team, including cross-functional partners…</p>\n<ul>\n<li>[60m] <a href=\"https://www.notion.so/sourcegraph/Types-of-interviews-sample-questions-f279f080583d49ee9f2c60e30c8cb1f7?pvs=4#c678a2a86e0e47e4958507e869bf7ded\">Resume Deep Dive</a></li>\n<li>[30m] Peer Interview</li>\n<li>[30m] Team Interview</li>\n<li>[60m] Presentation Interview</li>\n</ul>\n<p><strong>🎉 Final Interview Stage </strong>- we move you to our final round, where you gain a better understanding of our business and values holistically…</p>\n<ul>\n<li>[30m] <a href=\"https://www.notion.so/sourcegraph/Types-of-interviews-sample-questions-f279f080583d49ee9f2c60e30c8cb1f7?pvs=4#e3a04291743048df87541a88aa8199dd\">Values</a></li>\n<li>[30m]&nbsp;<a href=\"https://www.notion.so/sourcegraph/How-to-work-with-Quinn-Slack-CEO-807673e0864d473f959cc4efd9642a5a?pvs=4#6f185c0e2011411eac5be9c675f9056c\">Leadership</a> with co-founder&nbsp;</li>\n<li>We check references and conduct your background check</li>\n</ul>\n<p>Please note - you are welcome to request additional conversations with anyone you would like to meet, but didn’t get to meet during the interview process.</p>\n\n    \n\n    <div class=\"content-conclusion\"><h2><strong><span style=\"color: #a112ff;\">Learn more about us</span></strong></h2>\n<p>We want to ensure Sourcegraph is an environment that suits your working style and empowers you to do your best work, so we are eager to answer any questions that you have about us at any point in the interview process. You can learn more about what it is like to work at Sourcegraph by reading <a href=\"https://sourcegraph.notion.site/d7614e3e9dc04c09ac2d42d57f1816e6?v=2a6d426dbae14390b155120b0c029ce0\">our handbook</a>.</p>\n<p><span style=\"font-weight: 400;\">We provide </span><a href=\"https://sourcegraph.notion.site/Compensation-Pay-Transparency-at-Sourcegraph-d58d0774f51b4b489d41c3628d30ff8d?pvs=74\"><span style=\"font-weight: 400;\">competitive compensation</span></a><span style=\"font-weight: 400;\"> and </span><a href=\"https://sourcegraph.notion.site/Benefits-Perks-dd1da4b6b3a64780abed010a144d34ba?pvs=74\"><span style=\"font-weight: 400;\">practical benefits</span></a><span style=\"font-weight: 400;\"> to keep you happy and healthy so that you can do your best work.&nbsp;</span><span style=\"font-weight: 400;\">&nbsp;</span></p>\n<p>Sourcegraph is an equal opportunity workplace; we welcome people from all backgrounds.&nbsp;</p>\n<p><em>Sourcegraph participates in&nbsp;<a href=\"https://sourcegraph.notion.site/E-Verify-2ab3286dde3446d6bac2898c83610107\">E-Verify</a> for U.S. Employees.&nbsp;</em></p></div>\n","tags":"[\"Finance\",\"management\",\"engineering\"]","pubDate":"2024-09-20 06:43:36.224","link":"https://boards.greenhouse.io/sourcegraph91/jobs/5328677004","savedDate":"2024-09-20 06:43:36.224","slug":"regional-sales-director-us-east-emea-m4-sourcegraph-2128"},{"id":5071914518,"title":"Senior Growth Marketer","company":"Instrumentl","image":"https://pbs.twimg.com/profile_images/1263546899153502209/ObHsQoNr_400x400.jpg","description":"<div class=\"section page-centered\" data-qa=\"job-description\"><div><b style=\"font-size: 18px;\">Hello, we’re Instrumentl.</b></div><div><br></div><div><span style=\"font-size: 16px;\">We’re a mission-driven startup helping the nonprofit sector to drive impact, and we’re well on our way to becoming the </span><b style=\"font-size: 16px;\">#1</b><span style=\"font-size: 16px;\"> most-loved grant discovery and management tool. To help us get there, we’re hiring a </span><b style=\"font-size: 16px;\">Senior Growth Marketer </b><span style=\"font-size: 16px;\">who will validate and scale new growth flywheels, focusing on building initiatives from 0 to 1 and preparing them to scale from 1 to 10 with our full-time team.</span></div><div><br></div><div><span style=\"font-size: 16px;\">Are you a creative and data-driven marketer who thrives on testing new ideas and scaling successful initiatives? Do you love sizing growth opportunities and leading growth R&amp;D efforts from concept to implementation? If so, this position is for you.</span></div><div><br></div><div><b style=\"font-size: 18px;\">About us:</b></div><div><br></div><div><a rel=\"noopener noreferrer\" class=\"postings-link\" style=\"font-size: 16px;\" href=\"https://www.instrumentl.com/\">Instrumentl</a><span style=\"font-size: 16px;\"> is a hypergrowth YC-backed startup with over 4,000 nonprofit clients, from local homeless shelters to larger organizations like the San Diego Zoo and the University of Alaska. We are building the future of fundraising automation, helping nonprofits to discover, track, and manage grants efficiently through our SaaS platform.</span></div><div><br></div><div><span style=\"font-size: 16px;\">Our charts are dramatically up-and-to-the-right 📈 — we’re cash flow positive and doubling year-over-year, with customers who love us (NPS is 65+ and Ellis PMF survey is 60+). Join us on this rocket ship to Mars!</span></div><div><br></div><div><b style=\"font-size: 18px;\">About the role:</b></div><div><br></div><div><span style=\"font-size: 16px;\">As the Senior Growth Marketer at Instrumentl, you will lead key growth initiatives and focus on testing and validating new opportunities. Our ideal candidate is proactive, eager to learn, willing to experiment, and excited to collaborate with multiple teams to expand Instrumentl's reach. </span></div><div><br></div><div><span style=\"font-size: 16px;\">You'll be joining our small, highly autonomous team, reporting directly to Will, our Head of Growth. Get to know us at&nbsp;</span><a rel=\"noopener noreferrer\" class=\"postings-link\" style=\"font-size: 16px;\" href=\"https://www.instrumentl.com/about\">instrumentl.com/about</a><span style=\"font-size: 16px;\">!</span></div><div><br></div><div><span style=\"font-size: 16px;\">Instrumentl is fully distributed (though if you’d like to work from our Oakland office, we would love to see you there).&nbsp; For this position, we are looking for someone based in the continental US, but open to those flexible to Eastern or Central Time standard working hours as well.</span></div></div><div class=\"section page-centered\"><div><h3>What you'll get to do:</h3><ul class=\"posting-requirements plain-list\"><ul><li>Size growth opportunities and conduct R&amp;D on new initiatives that can take Instrumentl’s reach further.</li><li>Build business cases for new growth experiments and opportunities, prioritizing those with the highest ROI potential.</li><li>Run experiments to validate initiatives from 0 to 1, working cross-functionally to assess feasibility and impact.</li><li>Collaborate with content, SEO, product marketing &amp; product, and events / community teams to ensure successful scaling of initiatives from 1 to 10 once validated.</li><li>Identify and validate growth hypotheses, using data to guide decision-making and ensure high-impact outcomes.</li><li>Tee up validated growth hypotheses and systemize them into clear SOPs that can be managed by full-time specialists once validated.</li><li>Run tests to increase conversion rates across landing pages, sign-up flows, and onboarding processes.</li></ul></ul></div></div><div class=\"section page-centered\"><div><h3>What we're looking for:</h3><ul class=\"posting-requirements plain-list\"><ul><li><b>5+ years of entrepreneurial or growth experience: </b>You've ideally worked in SaaS, with a proven ability to build and scale growth initiatives.</li><li><b>Founder’s mindset: </b>You think like an owner, always looking for opportunities to innovate and create long-term value.</li><li><b>Growth-obsessed: </b>You’re relentless in testing, iterating, and optimizing to drive measurable impact.</li><li><b>Ownership mentality: </b>You take full responsibility for projects, ensuring high-quality outcomes. You exhibit a growth mindset and take feedback in stride. </li><li><b>Rigorous execution: </b>You’re detail-oriented, highly organized, and committed to driving projects to completion.</li><li><b>Strong analytical skills: </b>Proficient in tools like Google Analytics and Excel, you interpret data and make informed, growth-driven decisions.</li><li><b>Resourceful and autonomous: </b>You thrive in fast-paced, high-autonomy environments, taking initiative and figuring things out independently.</li><li><b>Clear and effective communication: </b>You can simplify complex strategies, aligning cross-functional teams around key initiatives.</li><li><b>Passion:&nbsp;</b>You’re excited about Instrumentl’s mission to propel nonprofits into a bigger, brighter future!</li></ul></ul></div></div><div class=\"section page-centered\"><div><h3>Bonus points:</h3><ul class=\"posting-requirements plain-list\"><ul><li>Experience working in <b>(or founding!) </b>early-stage startups.</li><li>Comfort with ambiguity and ability to wear many hats.</li><li>Experience in nonprofit fundraising or grants.</li><li>Experience working remotely.</li></ul></ul></div></div><div class=\"section page-centered\"><div><h3>Compensation and Benefits: </h3><ul class=\"posting-requirements plain-list\"><ul><li>Salary ranges are based on market data, relative to our size, industry, and stage of growth. Salary is one part of total compensation, which also includes equity, perks, and competitive benefits.&nbsp;</li><li>For US-based candidates, our target salary band is&nbsp;<b>$130,000 - $190,000/year&nbsp;</b>+ equity. Salary decisions will be based on multiple factors including geographic location, qualifications for the role, skillset, proficiency, and experience level.&nbsp;</li><li>100% covered health, dental, and vision insurance for employees, 50% for dependents</li><li>Generous PTO policy, including parental leave</li><li>401(k)</li><li>Company laptop + stipend to set up your home workstation</li><li>Company retreats for in-person time with your colleagues</li><li>Work with awesome nonprofits around the US. We partner with incredible organizations doing meaningful work, and you get to help power their success.</li></ul></ul></div></div><div class=\"section page-centered\" data-qa=\"closing-description\"><div><b style=\"font-size: 18px;\">What to expect: </b></div><div><br></div><div><span style=\"font-size: 16px;\">Instrumentl is evolving rapidly. You’ll always have new challenges and opportunities to grow in your role - you won’t be bored! You’ll be an early member of our small but mighty team, playing a huge part in shaping our culture for the years and teammates to come.</span></div><div><br></div><div><b style=\"font-size: 16px;\">At Instrumentl:</b></div><div><br></div><div><span style=\"font-size: 16px;\">- </span><b style=\"font-size: 16px;\">We’re customer-focused. </b><span style=\"font-size: 16px;\">We routinely seek feedback from our customers to improve the Instrumentl experience for everyone. Our first company value is \"The customer is the hero\" and we mean it.&nbsp;</span></div><div><span style=\"font-size: 16px;\">- </span><b style=\"font-size: 16px;\">We love to experiment.</b><span style=\"font-size: 16px;\"> We are constantly generating new concepts and iterating to see what works - ideation and experimentation are essential here. \"Bend the curve\" is another key company value.</span></div><div><span style=\"font-size: 16px;\">- </span><b style=\"font-size: 16px;\">We appreciate authenticity.</b><span style=\"font-size: 16px;\"> We have a diverse range of life experiences, and we encourage open, clear communication with each other about the things that matter most to us.</span></div><div><span style=\"font-size: 16px;\">- </span><b style=\"font-size: 16px;\">We’re approachable and collaborative.</b><span style=\"font-size: 16px;\"> Everyone has a voice, and we’re all building Instrumentl together.</span></div><div><span style=\"font-size: 16px;\">- </span><b style=\"font-size: 16px;\">We kick it every day with some of the nicest people in the world.</b><span style=\"font-size: 16px;\"> No joke, our customers are often on the front lines educating kids, saving endangered species, and restoring watersheds. In helping them take advantage of Instrumentl’s technology, you’re helping them move the world forward.</span></div><div><br></div><div><b style=\"font-size: 16px;\">Ready to apply?</b></div><div><br></div><div><span style=\"font-size: 16px;\">Using the 'Apply' button, please submit either a short Loom video or a written response addressing the following prompts:</span></div><div><br></div><div><span style=\"font-size: 16px;\">1. Describe a time when you identified a non-obvious growth opportunity. How did you build a business case for it, and what were the results? </span></div><div><br></div><div><span style=\"font-size: 16px;\">2. In a cross-functional growth initiative you've led, how did you ensure successful collaboration with teams like content, SEO, and product marketing to take an idea from 0 to 1 and then scale it from 1 to 10? </span></div><div><br></div><div><span style=\"font-size: 16px;\">Don't forget to include the word </span><b style=\"font-size: 16px;\">moxie </b><span style=\"font-size: 16px;\">in your application to show you read this from start to finish! Along with your written response or Loom video, please attach your CV or resume.</span></div><div><br></div><div><i style=\"font-size: 16px;\">At Instrumentl, we pride ourselves on building a diverse team from the ground up. Every role is an opportunity to teach, learn, and create some of your best work - if you’re excited to grow along with us, we encourage you to apply!</i></div></div><div class=\"section page-centered last-section-apply\" data-qa=\"btn-apply-bottom\"><a class=\"postings-btn template-btn-submit hex-color\" data-qa=\"show-page-apply\" href=\"https://jobs.lever.co/Instrumentl/ee975817-5b2a-4604-8f27-8f372e73fcb3/apply\">Apply for this job</a></div>","tags":"[\"management\"]","pubDate":"2024-09-20 06:43:36.224","link":"https://jobs.lever.co/Instrumentl/ee975817-5b2a-4604-8f27-8f372e73fcb3","savedDate":"2024-09-20 06:43:36.224","slug":"senior-growth-marketer-instrumentl-4453"},{"id":4235154820,"title":"Senior Technical Recruiter (Contract)","company":"Sourcegraph","image":"https://pbs.twimg.com/profile_images/1428393724527190022/4mt5PACL_400x400.png","description":"\n    <div class=\"content-intro\"><h2><strong><span style=\"color: #a112ff;\">Who we are</span></strong></h2>\n<p>Our mission at Sourcegraph is to make it so that <a href=\"https://www.notion.so/sourcegraph/Mission-values-e9d37e6b972a4ef395c3076aea2bd07d?pvs=4\">everyone can code</a>, not just ~0.1% of the population. We're building the code intelligence platform that powers the world's best code search and the most popular open-source code AI tool. It’s an exciting time to join Sourcegraph—AI has taken over the world, and we aim to automate 99% of the toil in software engineering with our code understanding and code AI tools, leaving the remaining 1% to the irreplicable creative spark from humans.&nbsp;</p>\n<p>Our customers range from startups to the Fortune 500, 4/5 FAANG companies, government organizations, Uber, Plaid, and more. We’ve raised $225M at a $2.625B valuation from <a href=\"https://techcrunch.com/2021/07/13/sourcegraph-raises-125m-series-d-on-2-6b-valuation-for-universal-code-search-tool/\">a16z</a>,<a href=\"https://about.sourcegraph.com/blog/series-c-with-sequoia/\"> Sequoia</a>, <a href=\"https://www.redpoint.com/companies/sourcegraph/\">Redpoint</a>, <a href=\"https://medium.com/craft-ventures/why-we-invested-in-sourcegraph-5ace28317e3d\">Craft</a> and others. We’re making ambitious bets on our future and we’re looking to hire exceptional people to join our team as we make Sourcegraph one of the biggest and most influential companies in the world.</p></div>\n\n    <h2><span style=\"color: rgb(161, 18, 255);\"><strong>Location</strong></span></h2>\n<p>🌎 While we are an all-remote company and hire <a href=\"https://sourcegraph.notion.site/How-we-engage-talent-outside-of-the-US-218f7193695a46cbb1ef39ef9c1f72d4\">almost anywhere</a> in the world, we have a preference for someone to reside in the following locations for this role. However, if you feel qualified, we welcome you to apply regardless of location. No matter what, working hours must overlap with Pacific Time (PT) for at least 30 hours/week.</p>\n<p><strong>Preferred locations:</strong></p>\n<ul>\n<li>San Francisco</li>\n</ul>\n<h2><span style=\"color: rgb(161, 18, 255);\"><strong>Why this job is exciting</strong></span></h2>\n<p>We are looking for a temporary (approximately 6 months) Technical Recruiter to join our team and work closely with our Engineering and Product departments. We strive to make Sourcegraph the best company where exceptionally talented people can thrive. If you join us, we know you’ll make a big impact!&nbsp; Here’s what we’re thinking:</p>\n<p>📅 Within one month, you will…</p>\n<ul>\n<li>Begin 1:1’s with your Manager, meet &amp; shadow current members of the Sourcegraph team, and delve into your role</li>\n<li>Set your OKRs (Objectives and Key Results) with your Manager and develop an action plan to achieve them.</li>\n<li>Meet key hiring managers and executive leadership you will be supporting - you will be meeting with them weekly and they will be key relationships for you throughout your role.</li>\n<li>Begin recruiting for openings and become ingrained in the business.</li>\n<li>Manage the influx of applicants in a timely manner, providing a top-notch candidate experience.</li>\n<li>Utilize strong sourcing and recruiting methods to proactively identify and attract top-quality passive talent.</li>\n</ul>\n<p>📅 Within three months, you will…</p>\n<ul>\n<li>Have a strong understanding of the business and what makes Sourcegraph unique.</li>\n<li>Begin to work autonomously through the entire candidate recruitment lifecycle (from application through offer acceptance) and have regular “update meetings” with your hiring managers.</li>\n<li>Embody a growth mindset and proactively work on projects that help us improve our process and develop a scalable foundation on which to grow.&nbsp;</li>\n<li>Fill roles quickly with quality talent.</li>\n</ul>\n<p>📅 Within six months, you will…</p>\n<ul>\n<li>Be seen as a Subject Matter Expert to the business units you support, guiding hiring managers and executive leadership on selection best practices.</li>\n<li>Have established relationships with your team hiring managers, and be viewed as a trusted partner throughout the company.</li>\n<li>Provide a candidate experience that is considered to be the best they’ve ever had.</li>\n<li>Continue to fill roles quickly with quality talent.</li>\n</ul>\n<h2><span style=\"color: rgb(161, 18, 255);\"><strong>About you</strong></span></h2>\n<p>Our Recruiters are hard-working, results-driven, and passionate people advocates! We are sourcing machines - passionate about finding the best passive talent and providing a top-notch candidate experience. We celebrate the wins together and help each other through uncharted territory.</p>\n<p>You are an enthusiastic, driven, and results-oriented Technical Recruiter who shares <a href=\"https://sourcegraph.notion.site/Mission-values-e9d37e6b972a4ef395c3076aea2bd07d\">our values</a> and has a passion for all things Talent. This is a huge opportunity to develop your career by participating in every phase of the recruitment process, from sourcing and evaluation of talent, to owning requisitions of your own, and collaborating with hiring managers and senior leadership.&nbsp; You have demonstrated skills with passive candidate generation, account management (internal hiring managers), and moving candidates through all recruiting stages (candidate generation to interview to offer). As a Recruiter, you’ll help determine and implement strategy and develop proactive sourcing techniques to ensure an ongoing candidate pipeline.</p>\n<p>💪 Your skill-set:</p>\n<ul>\n<li>3+ years of technical recruiting experience; agency experience required, corporate experience a plus.</li>\n<li>A strong “sales mindset” and a demonstrated ability to source for technical roles using various platforms.</li>\n<li>Demonstrated ability to work effectively and ethically in a fast-paced tech environment and respond quickly to changing priorities.</li>\n<li>Solid analytical, organizational, and problem-solving skills with a growth mindset.</li>\n<li>Engaging interpersonal skills: a dynamic and enthusiastic individual who connects well with others.</li>\n<li>ATS experience is required; Greenhouse is ideal!&nbsp;</li>\n</ul>\n<p>🔍 Nice to haves:</p>\n<ul>\n<li>Technical aptitude and a passion for coding</li>\n</ul>\n<h2><span style=\"color: rgb(161, 18, 255);\"><strong>Level</strong></span></h2>\n<p>📊 This job is an IC3 - IC4. You can read more about <a href=\"https://www.notion.so/sourcegraph/Leveling-Guide-0e1b5c76ada64b9caac387f8b7c4fc66\">our job leveling philosophy</a> in our Handbook.</p>\n<h2><span style=\"color: rgb(161, 18, 255);\"><strong>Compensation</strong></span></h2>\n<p><strong>💸 We pay you an above-average salary</strong> because we want to hire the best people who are fully focused on helping Sourcegraph succeed, not worried about paying bills. As an <a href=\"https://sourcegraph.notion.site/Mission-values-e9d37e6b972a4ef395c3076aea2bd07d\">open and transparent</a> company that values <a href=\"https://www.notion.so/sourcegraph/Compensation-Pay-Transparency-at-Sourcegraph-d58d0774f51b4b489d41c3628d30ff8d?pvs=4\">competitive compensation</a>, our compensation ranges are visible to every single Sourcegraph teammate.</p>\n<p>Your hourly pay is determined by your pay band for the IC3 - IC4 job level. For determining pay bands, we use a number of market and data-driven salary sources, along with your location zone, and target the high-end of the range to ensure we’re always paying above market regardless of where you live in the world. Both U.S. and international locations are divided into one of four zones, determined by the cost of labor index for each area. The pay for a successful candidate will be based on level, job-related skills, experience, qualifications, and location zone. Please note that the salaries below may be adjusted in the future.</p>\n<p>💰 The target compensation for this role is $55 - $100 USD per hour.&nbsp;</p>\n<p>Please read more about<a href=\"https://handbook.sourcegraph.com/departments/people-talent/people-ops/process/how-we-engage-talent-outside-the-us/#temporary-contractors-very-short-term-likely-less-than-3-months\"> how we engage with temporary contractors in our handbook here</a> and ask a recruiter for additional information regarding zone locations!&nbsp;</p>\n<h2><span style=\"color: rgb(161, 18, 255);\"><strong>Interview process</strong></span></h2>\n<p><em>Below is the interview process you can expect for this role (you can read more about </em><a href=\"https://sourcegraph.notion.site/Types-of-interviews-f279f080583d49ee9f2c60e30c8cb1f7\"><em>the types of interviews</em></a><em> in our Handbook). It may look like a lot of steps, but rest assured that we move quickly and the steps are designed to help you get the information needed to determine if we’re the right fit for you… Interviewing is a two-way street, after all!&nbsp;</em></p>\n<p>We expect the interview process to take 1.5 hours in total.&nbsp;</p>\n<p><strong>👋 Introduction Stage</strong> - we have initial conversations to get to know you better…</p>\n<ul>\n<li>[30m] <a href=\"https://www.notion.so/sourcegraph/Types-of-interviews-sample-questions-f279f080583d49ee9f2c60e30c8cb1f7?pvs=4#99be5ff628b2414194a0ba79d9f25f13\">Recruiter Screen</a> / <a href=\"https://www.notion.so/sourcegraph/Types-of-interviews-sample-questions-f279f080583d49ee9f2c60e30c8cb1f7?pvs=4#1919882c0cf147c487eb1df40db8a694\">Hiring Manager Screen</a> with Devon Coords</li>\n</ul>\n<p><strong>🧑‍💻 Team Interview Stage</strong> - we then delve into your experience in more depth and introduce you to members of the team, including cross-functional partners…</p>\n<ul>\n<li>[30m]&nbsp;<a href=\"https://www.notion.so/sourcegraph/Types-of-interviews-sample-questions-f279f080583d49ee9f2c60e30c8cb1f7?pvs=4#88b9f826dee04ef98afc2aeec35b877a\">Peer</a> with Marija Petrovic</li>\n</ul>\n<p><strong>🎉 Final Interview Stage </strong>- we move you to our final round, where you gain a better understanding of our business and values holistically…</p>\n<ul>\n<li>[30m] <a href=\"https://www.notion.so/sourcegraph/Types-of-interviews-sample-questions-f279f080583d49ee9f2c60e30c8cb1f7?pvs=4#80e2ecaed5854b1ba510b2e391c0c67b\">Leadership</a> with Carly Jones</li>\n<li>We check references and conduct your background check</li>\n</ul>\n<p>Please note - you are welcome to request additional conversations with anyone you would like to meet, but didn’t get to meet during the interview process.</p>\n\n    \n\n    <div class=\"content-conclusion\"><h2><strong><span style=\"color: #a112ff;\">Learn more about us</span></strong></h2>\n<p>We want to ensure Sourcegraph is an environment that suits your working style and empowers you to do your best work, so we are eager to answer any questions that you have about us at any point in the interview process. You can learn more about what it is like to work at Sourcegraph by reading <a href=\"https://sourcegraph.notion.site/d7614e3e9dc04c09ac2d42d57f1816e6?v=2a6d426dbae14390b155120b0c029ce0\">our handbook</a>.</p>\n<p><span style=\"font-weight: 400;\">We provide </span><a href=\"https://sourcegraph.notion.site/Compensation-Pay-Transparency-at-Sourcegraph-d58d0774f51b4b489d41c3628d30ff8d?pvs=74\"><span style=\"font-weight: 400;\">competitive compensation</span></a><span style=\"font-weight: 400;\"> and </span><a href=\"https://sourcegraph.notion.site/Benefits-Perks-dd1da4b6b3a64780abed010a144d34ba?pvs=74\"><span style=\"font-weight: 400;\">practical benefits</span></a><span style=\"font-weight: 400;\"> to keep you happy and healthy so that you can do your best work.&nbsp;</span><span style=\"font-weight: 400;\">&nbsp;</span></p>\n<p>Sourcegraph is an equal opportunity workplace; we welcome people from all backgrounds.&nbsp;</p>\n<p><em>Sourcegraph participates in&nbsp;<a href=\"https://sourcegraph.notion.site/E-Verify-2ab3286dde3446d6bac2898c83610107\">E-Verify</a> for U.S. Employees.&nbsp;</em></p></div>\n","tags":"[\"management\",\"engineering\"]","pubDate":"2024-09-20 06:43:36.222","link":"https://boards.greenhouse.io/sourcegraph91/jobs/5333736004","savedDate":"2024-09-20 06:43:36.222","slug":"senior-technical-recruiter-contract-sourcegraph-6019"},{"id":6198056230,"title":"Enterprise Lead Generation Associate (Fully Remote)","company":"CoverGo","image":"https://pbs.twimg.com/profile_images/1382655628523364355/MWPIbbID_400x400.jpg","description":"<p><strong>Top 3 Reasons To Join Us</strong></p><ul> <li>Competitive Salary</li> <li>100% Remote</li> <li>Working on the latest tech for the Insurtech Market Leader</li> </ul><p><strong>About Us</strong></p><p>At CoverGo, our mission is to empower all insurance companies to make insurance 100% digital and accessible to everyone.</p><ul> <li>We are a leading global no-code insurance platform for health, life, and P&amp;C</li> <li>We’re the winner of the Insurtech of the Year in all of Asia and other awards globally</li> <li>We work with insurance enterprise clients such as AXA, Bupa, MSIG, Dai-ichi, Bank of China Group Insurance, and many more</li> <li>We're an international, diverse team of over 120 people with 30 nationalities and team members working remotely from all over the world</li> <li>We are fully funded and backed by reputable VC funds and strategic institutional investors</li> <li>We have a global presence in Asia, EMEA and the Americas</li> <li>We’ve grown our annualized revenue by over 30x since January 2021</li> <li>We’re constantly working towards making CoverGo a workplace that you love coming to. We deeply believe that bringing together a diversity of thoughts, expressions, and perspectives is key to building the best culture for equally diverse communities all over the world and a workplace that you love coming to. We deeply believe that bringing together a diversity of thoughts, expressions, and perspectives is key to building the best culture for equally diverse communities all over the world</li> </ul><p><strong>About the Role</strong></p><p>As a Lead Generation Associate, you will play a pivotal role in our growth strategy, focusing on expanding our network and partnerships within the insurance and financial sectors across APAC. The core responsibility of the role revolves on lead generation, market research, and appointment setting. You will work closely with industry leaders and leverage your analytical skills to drive market research, identify opportunities, and contribute to the development of new products and strategic initiatives.</p><p><strong>What You Will Do</strong></p><ul> <li>Perform comprehensive market research to identify new products, emerging markets, competitors, potential partners, and distribution channels.</li> <li>Conduct lead generation activities on a daily basis which involve identifying and engaging potential customers through various strategies such as email campaigns, social media outreach, and appointment setting to drive interest and generate new business opportunities.</li> <li>Ensure targets and goals are reached and CRM and other tracking tools are updated.</li> <li>Explore partnership opportunities by engaging with potential collaborators to foster mutually beneficial relationships.</li> <li>Research fintech and insurtech startups and solutions that align with our business objectives, assessing their potential integration into our offerings.</li> <li>Contribute to business development activities, including outreach and meetings with potential clients such as insurance companies, banks, brokers, and agency partners across the APAC region and internationally.</li> <li>Collaborate directly with senior management e.g. CEO and Deputy CEO to gain insights and contribute to strategic decisions in the insurance and insurtech sectors.</li> <li>Actively participate in startup and fintech events, including investor round-tables and conferences, to expand our network and industry presence across APAC.</li> <li>Manage and maintain LinkedIn profiles to enhance our branding and visibility, building a consistent and positive corporate image.</li> </ul><p><strong>What We Need</strong></p><ul> <li>Bachelor’s degree, preferably in Business Administration, Marketing, Finance, or a related field</li> <li>2-3 years of relevant experience in B2B business development, preferably within the insurance industry or a consulting firm.</li> <li>Must have experience in enterprise-level business development or lead generation</li> <li>Strong interest in fintech, entrepreneurship, insurance, business development, and marketing.</li> <li>Excellent communication and presentation skills with proficiency in English, (Cantonese and Mandarin is a plus)</li> <li>Atleast 2 years of experience with CRM tools (Salesforce preferred), LinkedIn, Google Workspace, and other outreach tools (like MailMerge)</li> <li>Detail-oriented with exceptional analytical and problem-solving abilities.</li> <li>Self-motivated team player capable of working independently and under pressure in a fast-paced startup environment.</li> <li>Design and tech-based skills are advantageous.</li> <li>Positive attitude, proactive mindset, and a commitment to continuous learning and professional growth.</li> <li>Must be physically based in the Philippines</li> </ul><h3>Requirements: </h3><h3>Benefits: </h3>","tags":"[\"Finance\",\"management\",\"B2B\"]","pubDate":"2024-09-20 00:00:00.000","link":"https://apply.workable.com/covergo/j/9BF97F47BC","savedDate":"2024-09-20 06:43:36.227","slug":"enterprise-lead-generation-associate-fully-remote-covergo-3823"},{"id":2015066111,"title":"Servicing Associate","company":"Backflip","image":"https://media.licdn.com/dms/image/D560BAQH1_SFy5Vwlhg/company-logo_200_200/0/1686838667749?e=2147483647&v=beta&t=vjEnSv9MgRj3-PLOfPnBySXxJkFKZF1SkMxzVFcxr8c","description":"<div><b style=\"font-size: 11pt;\">Join a fast growing start up changing the real estate investing industry!&nbsp;</b></div><div><br></div><div><a style=\"font-size: 11pt;\" href=\"https://dobackflip.com/\">Backflip</a><span style=\"font-size: 11pt;\"> is a venture-backed </span><b style=\"font-size: 11pt;\">FinTech</b><span style=\"font-size: 11pt;\"> company that </span><b style=\"font-size: 11pt;\">empowers anyone to improve their life and their neighborhood through real estate investing</b><span style=\"font-size: 11pt;\">. To do that, we need people who are inspired to reimagine and rebuild an outdated and unbalanced system; to support and celebrate America’s local entrepreneurs. </span><a style=\"font-size: 11pt;\" href=\"https://backflip.app.link/hdYmZF9JwLb\">Check out the Backflip app here to experience first hand how we're making a difference through our technology</a><span style=\"font-size: 11pt;\">.</span></div><div><br></div><div><span style=\"font-size: 11pt;\">Backflip is seeking a </span><b style=\"font-size: 11pt;\"><i>Servicing Associate</i></b><span style=\"font-size: 11pt;\"> to join our business-purpose servicing team. In this role, you will be responsible for delivering an exceptional member experience while ensuring loan performance. Your contributions will help us build and maintain an industry-leading servicing operation, directly enhancing our overall portfolio performance.</span></div><div><br></div><div><span style=\"font-size: 11pt;\">This position is remote (U.S.) and a rare opportunity to get in on the ground floor (~75 person team) working directly with senior leaders in a well-capitalized startup with a great culture (</span><a style=\"font-size: 11pt;\" href=\"https://techcrunch.com/2024/04/29/backflip-raises-15-million-to-help-real-estate-investors-flip-houses/?guccounter=1&amp;guce_referrer=aHR0cHM6Ly93d3cuZ29vZ2xlLmNvbS8&amp;guce_referrer_sig=AQAAABk3K7EzQ-RsoX2uq_YCeKN3dCJPqN1FsdwJFbmB30YwsTXb2qogu-d0mtoA_sfc9ZWtyzGW04VxvOa9iDbHgMqyiLHq5hahjz5Ym4hQ6WtWy-OfMFEBck0bSanRkxZg89Eme5WfG-lXEOjuecZ1mCfDE9DCAFFL8feoIKJ8RlsQ\">Check out our recently announced $15M Series A</a><span style=\"font-size: 11pt;\">).</span></div><div><b style=\"font-size: 11pt;\">Join a fast growing start up changing the real estate investing industry!&nbsp;</b></div><div><br></div><div><a href=\"https://dobackflip.com/\" style=\"font-size: 11pt;\">Backflip</a><span style=\"font-size: 11pt;\"> is a venture-backed </span><b style=\"font-size: 11pt;\">FinTech</b><span style=\"font-size: 11pt;\"> company that </span><b style=\"font-size: 11pt;\">empowers anyone to improve their life and their neighborhood through real estate investing</b><span style=\"font-size: 11pt;\">. To do that, we need people who are inspired to reimagine and rebuild an outdated and unbalanced system; to support and celebrate America’s local entrepreneurs. </span><a href=\"https://backflip.app.link/hdYmZF9JwLb\" style=\"font-size: 11pt;\">Check out the Backflip app here to experience first hand how we're making a difference through our technology</a><span style=\"font-size: 11pt;\">.</span></div><div><br></div><div><span style=\"font-size: 11pt;\">Backflip is seeking a </span><b style=\"font-size: 11pt;\"><i>Servicing Associate</i></b><span style=\"font-size: 11pt;\"> to join our business-purpose servicing team. In this role, you will be responsible for delivering an exceptional member experience while ensuring loan performance. Your contributions will help us build and maintain an industry-leading servicing operation, directly enhancing our overall portfolio performance.</span></div><div><br></div><div><span style=\"font-size: 11pt;\">This position is remote (U.S.) and a rare opportunity to get in on the ground floor (~75 person team) working directly with senior leaders in a well-capitalized startup with a great culture (</span><a href=\"https://techcrunch.com/2024/04/29/backflip-raises-15-million-to-help-real-estate-investors-flip-houses/?guccounter=1&amp;guce_referrer=aHR0cHM6Ly93d3cuZ29vZ2xlLmNvbS8&amp;guce_referrer_sig=AQAAABk3K7EzQ-RsoX2uq_YCeKN3dCJPqN1FsdwJFbmB30YwsTXb2qogu-d0mtoA_sfc9ZWtyzGW04VxvOa9iDbHgMqyiLHq5hahjz5Ym4hQ6WtWy-OfMFEBck0bSanRkxZg89Eme5WfG-lXEOjuecZ1mCfDE9DCAFFL8feoIKJ8RlsQ\" style=\"font-size: 11pt;\">Check out our recently announced $15M Series A</a><span style=\"font-size: 11pt;\">).</span></div><h3>What You’ll Do:</h3><li>Proactively manage your servicing pipeline to ensure each Member feels valued, empowered, and is set up for success</li><li>Manage the delinquency pipeline, providing support to borrowers to facilitate successful loan resolution and exit strategies</li><li>Process loan payoff requests with a high level of accuracy and within established Service Level Agreements (SLAs)&nbsp;</li><li>Process loan extension requests with a high level of accuracy and within established Service Level Agreements (SLAs)&nbsp;</li><li>Communicate proactively with borrowers to get ahead of issues and protect Backflip’s loan performance track record</li><li>Effectively handle borrower escalations, as applicable</li><li>Provide each borrower with a welcome call upon their loan closing</li><li>Uphold communication SLA’s; ensure borrowers receive timely responses&nbsp;</li><li>Work with the broader team to develop opportunities to engage members with Community and Product</li><li>Support Backflip’s capital markets team to complete related processing tasks and resolve investor conditions</li><h3>Qualifications:</h3><li>2+ years of experience in a relevant servicing operation for a lender in the real estate industry</li><li>Experience reviewing residential construction budgets, feasibility and inspection reports</li><li>Prior experience working a remote team&nbsp;</li><li>Prior experience with a fintech company or venture-backed startup is a plus</li><li>Ability to multi-task with exceptional time management, prioritization and attention to detail</li><li>Exemplary computer skills - demonstrated ability and desire to learn new technologies (we use Slack + Notion + Google Workspace + Front + HubSpot + GLS + FCI + Willow + more)</li><h3>This candidate will champion Backflip’s culture & Core Values:</h3><li><b>Raise</b> the standard of what is possible</li><li><b>Embrace</b> being the novice to become the master</li><li><b>Work</b> only with those who want the best for us</li><li><b>Communicate</b> quickly, naturally and with radical candor</li><li><b>Test</b> new things to invent and challenge the status quo</li><li>Today, nay <b>now</b>!</li><div><i>Compensation for this role includes a $70,000 annual salary plus an additional performance incentive, and is based on a variety of factors including prior experience, geographic location, stock option grant, and other factors, and may fall outside of the stated range for certain candidates. In addition to a competitive market salary, Backflip employees receive equity stock options, paid health care, and a 401K + company match, among other industry-leading benefits.</i></div><div><br></div><div><i>All Backflip positions are Remote. Like the people we serve, we believe being free to create wherever you’re most inspired is one of life’s greatest joys. It’s better for individuals, for community, and for fostering great work to emerge. With our work-from-anywhere approach, Backflip brings together a diverse team of individuals, with passions for innovation, art, coding, AI, data, finance, film, real estate, the environment, learning and teaching. Together, we're moving fast.</i></div><div><br></div><div><i>Backflip is an equal opportunity employer. We know that building a world-class organization is not possible without an intentional focus on recruiting, empowering, promoting and rewarding the best and brightest people of all backgrounds. Backflip focuses on hiring individuals that align with its Core Values (listed above), and consistently display a high ethical standard, both personally and professionally.</i></div><div><br></div><div><i>This role is not eligible for visa sponsorship.</i></div>","tags":"[\"Finance\",\"management\"]","pubDate":"2024-09-19 20:54:47.281","link":"https://jobs.lever.co/backflip/74614b28-731e-4601-b751-7a65666c08bd","savedDate":"2024-09-20 06:43:36.230","slug":"servicing-associate-backflip-9041"},{"id":2667462893,"title":"Head of Servicing","company":"Backflip","image":"https://media.licdn.com/dms/image/D560BAQH1_SFy5Vwlhg/company-logo_200_200/0/1686838667749?e=2147483647&v=beta&t=vjEnSv9MgRj3-PLOfPnBySXxJkFKZF1SkMxzVFcxr8c","description":"<div><b style=\"font-size: 11pt;\">Join a fast growing start up changing the real estate investing industry!&nbsp;</b></div><div><br></div><div><a style=\"font-size: 11pt;\" href=\"https://dobackflip.com/\">Backflip</a><span style=\"font-size: 11pt;\"> is a venture-backed </span><b style=\"font-size: 11pt;\">FinTech</b><span style=\"font-size: 11pt;\"> company that </span><b style=\"font-size: 11pt;\">empowers anyone to improve their life and their neighborhood through real estate investing</b><span style=\"font-size: 11pt;\">. To do that, we need people who are inspired to reimagine and rebuild an outdated and unbalanced system; to support and celebrate America’s local entrepreneurs. </span><a style=\"font-size: 11pt;\" href=\"https://backflip.app.link/hdYmZF9JwLb\">Check out the Backflip app here to experience first hand how we're making a difference through our technology</a><span style=\"font-size: 11pt;\">.</span></div><div><br></div><div><span style=\"font-size: 11pt;\">Backflip is seeking a </span><b style=\"font-size: 11pt;\"><i>Head of Servicing</i></b><span style=\"font-size: 11pt;\"> to lead and develop a top-tier servicing operation for our business-purpose portfolio. This role is crucial in building our in-house servicing, streamlining loan onboarding, managing delinquencies, ensuring timely communication, and enhancing the post-close experience to drive repeat business.</span></div><div><br></div><div><span style=\"font-size: 11pt;\">The ideal candidate will have extensive expertise in servicing operations and a passion for leading a member-facing team dedicated to delivering exceptional experiences. This role is perfect for someone ready to challenge the status quo by combining technology with a personal touch to enhance loan performance and member engagement.</span></div><div><br></div><div><span style=\"font-size: 11pt;\">This position is remote (U.S.) and a rare opportunity to get in on the ground floor (~75 person team) working directly with senior leaders in a well-capitalized startup with a great culture (</span><a style=\"font-size: 11pt;\" href=\"https://techcrunch.com/2024/04/29/backflip-raises-15-million-to-help-real-estate-investors-flip-houses/?guccounter=1&amp;guce_referrer=aHR0cHM6Ly93d3cuZ29vZ2xlLmNvbS8&amp;guce_referrer_sig=AQAAABk3K7EzQ-RsoX2uq_YCeKN3dCJPqN1FsdwJFbmB30YwsTXb2qogu-d0mtoA_sfc9ZWtyzGW04VxvOa9iDbHgMqyiLHq5hahjz5Ym4hQ6WtWy-OfMFEBck0bSanRkxZg89Eme5WfG-lXEOjuecZ1mCfDE9DCAFFL8feoIKJ8RlsQ\">Check out our recently announced $15M Series A</a><span style=\"font-size: 11pt;\">).</span></div><div><b style=\"font-size: 11pt;\">Join a fast growing start up changing the real estate investing industry!&nbsp;</b></div><div><br></div><div><a href=\"https://dobackflip.com/\" style=\"font-size: 11pt;\">Backflip</a><span style=\"font-size: 11pt;\"> is a venture-backed </span><b style=\"font-size: 11pt;\">FinTech</b><span style=\"font-size: 11pt;\"> company that </span><b style=\"font-size: 11pt;\">empowers anyone to improve their life and their neighborhood through real estate investing</b><span style=\"font-size: 11pt;\">. To do that, we need people who are inspired to reimagine and rebuild an outdated and unbalanced system; to support and celebrate America’s local entrepreneurs. </span><a href=\"https://backflip.app.link/hdYmZF9JwLb\" style=\"font-size: 11pt;\">Check out the Backflip app here to experience first hand how we're making a difference through our technology</a><span style=\"font-size: 11pt;\">.</span></div><div><br></div><div><span style=\"font-size: 11pt;\">Backflip is seeking a </span><b style=\"font-size: 11pt;\"><i>Head of Servicing</i></b><span style=\"font-size: 11pt;\"> to lead and develop a top-tier servicing operation for our business-purpose portfolio. This role is crucial in building our in-house servicing, streamlining loan onboarding, managing delinquencies, ensuring timely communication, and enhancing the post-close experience to drive repeat business.</span></div><div><br></div><div><span style=\"font-size: 11pt;\">The ideal candidate will have extensive expertise in servicing operations and a passion for leading a member-facing team dedicated to delivering exceptional experiences. This role is perfect for someone ready to challenge the status quo by combining technology with a personal touch to enhance loan performance and member engagement.</span></div><div><br></div><div><span style=\"font-size: 11pt;\">This position is remote (U.S.) and a rare opportunity to get in on the ground floor (~75 person team) working directly with senior leaders in a well-capitalized startup with a great culture (</span><a href=\"https://techcrunch.com/2024/04/29/backflip-raises-15-million-to-help-real-estate-investors-flip-houses/?guccounter=1&amp;guce_referrer=aHR0cHM6Ly93d3cuZ29vZ2xlLmNvbS8&amp;guce_referrer_sig=AQAAABk3K7EzQ-RsoX2uq_YCeKN3dCJPqN1FsdwJFbmB30YwsTXb2qogu-d0mtoA_sfc9ZWtyzGW04VxvOa9iDbHgMqyiLHq5hahjz5Ym4hQ6WtWy-OfMFEBck0bSanRkxZg89Eme5WfG-lXEOjuecZ1mCfDE9DCAFFL8feoIKJ8RlsQ\" style=\"font-size: 11pt;\">Check out our recently announced $15M Series A</a><span style=\"font-size: 11pt;\">).</span></div><h3>What You’ll Do:</h3><li>Establish a comprehensive servicing strategy to expand our in-house operation and build a strong performance record, with a focus on efficient loan onboarding, proactive portfolio management, and prompt responses to member inquiries</li><li>Develop and lead a high-performing servicing support team that prioritizes member satisfaction, fosters trust, and encourages repeat business</li><li>Ensure all member-facing interactions are handled with care, consistency, professionalism and within established Service Level Agreements (SLA’s)</li><li>Lead initiatives to proactively address delinquent accounts through effective communication and resolution tactics; as well as report findings to the loss mitigation team</li><li>Implement processes and communication milestones to improve the forecasting of loan repayments</li><li>Ensure all payoff requests are reviewed and processed with a high level of accuracy and within established Service Level Agreements (SLA’s)</li><li>Assist the team in promptly and effectively resolving loan-level escalations</li><li>Manage the relationship with capital markets counterparties and actively seek opportunities to build trust and enhance our partnerships</li><h3>Qualifications:</h3><li>5+ years of experience in a relevant servicing operation for a lender in the real estate industry</li><li>2+ years in a relevant managerial or supervisory role in a remote work environment</li><li>Prior experience with an in house servicing operation</li><li>Prior experience with a fintech company or venture-backed startup is a plus</li><li>Ability to multi-task with exceptional time management, prioritization and attention to detail</li><li>Exemplary computer skills - demonstrated ability and desire to learn new technologies (we use Slack + Notion + Google Workspace + Front + HubSpot + GLS + FCI + Willow + more)</li><h3>This candidate will champion Backflip’s culture & Core Values:</h3><li><b>Raise</b> the standard of what is possible</li><li><b>Embrace</b> being the novice to become the master</li><li><b>Work</b> only with those who want the best for us</li><li><b>Communicate</b> quickly, naturally and with radical candor</li><li><b>Test</b> new things to invent and challenge the status quo</li><li>Today, nay <b>now</b>!</li><div><i>Compensation for this role includes a base salary ranging from $95,000 - $105,000 plus an annual bonus ranging from $25,000 - $35,000, and is based on a variety of factors including prior experience, geographic location, stock option grant, and other factors, and may fall outside of the stated range for certain candidates. In addition to a competitive market salary, Backflip employees receive equity stock options, paid health care, and a 401K + company match, among other industry-leading benefits.</i></div><div><br></div><div><i>All Backflip positions are Remote. Like the people we serve, we believe being free to create wherever you’re most inspired is one of life’s greatest joys. It’s better for individuals, for community, and for fostering great work to emerge. With our work-from-anywhere approach, Backflip brings together a diverse team of individuals, with passions for innovation, art, coding, AI, data, finance, film, real estate, the environment, learning and teaching. Together, we're moving fast.</i></div><div><br></div><div><i>Backflip is an equal opportunity employer. We know that building a world-class organization is not possible without an intentional focus on recruiting, empowering, promoting and rewarding the best and brightest people of all backgrounds. Backflip focuses on hiring individuals that align with its Core Values (listed above), and consistently display a high ethical standard, both personally and professionally.</i></div><div><br></div><div><i>This role is not eligible for visa sponsorship.</i></div>","tags":"[\"Finance\",\"management\"]","pubDate":"2024-09-19 20:46:46.751","link":"https://jobs.lever.co/backflip/e31242b9-97ad-448f-bca6-7c3a3d836e2d","savedDate":"2024-09-20 06:43:36.229","slug":"head-of-servicing-backflip-147"},{"id":6610943007,"title":"Senior Full-Stack Developer (W)","company":"Blue Coding","image":"https://media.licdn.com/dms/image/C4D0BAQHlK67hgnhzQw/company-logo_200_200/0/1631346154820?e=2147483647&v=beta&t=_R2Ssj7L_f4xqmSCcq0nOLCyCz0QN2lFnHssxxhj3YY","description":"<div><i style=\"font-size: 18px\">Do you want to earn a salary in USD?&nbsp;</i></div><div><i style=\"font-size: 18px\">Would you like to work from wherever you want?</i></div><div><i style=\"font-size: 18px\">Would you like to be a part of the leading next-gen software developers?&nbsp;</i></div><div><br></div><div><b style=\"font-size: 24px\">Hi, you finally found us!</b><span style=\"font-size: 24px\">&nbsp;</span></div><div><br></div><div><b style=\"font-size: 24px\">Why work at Blue Coding?</b><span style=\"font-size: 24px\">&nbsp;</span></div><div><br></div><div>At Blue Coding we specialize in hiring excellent developers and amazing people from all over Latin America and other parts of the world. For the past 10 years, we’ve helped cutting-edge companies in the United States and Canada -both large and small, build great development teams and develop great products. Online shops, digital agencies, SaaS providers, and software consulting firms are a few of our clients. Our team of over 100 engineers is distributed in more than 10 countries across the Americas. We are a fully remote company working with a wide array of technologies and have expertise in every stage of the software development process.&nbsp;&nbsp;</div><div><br></div><div>Our team is highly connected, united, and culturally diverse, and our collaborators are involved in many initiatives around the world, from wildlife preservation to volunteering at local charities. We also participate in group activities like movie nights, trivia, and meme competitions. We stand for honesty, fairness, respect, efficiency, hard work, and cooperation.</div><div><br></div><div><b style=\"font-size: 24px;\">What are we looking for?</b></div><div><br></div><div>In this opportunity, we are seeking a Senior Full-Stack Developer to work with one of our foreign clients, an independent, non-profit global research organization that turns big ideas into action at the nexus of environment, economic opportunity, and human well-being. </div><div><br></div><div>In this role, you will collaborate with the data team to develop user-facing geospatial applications, data dashboards, and decision support tools to help cities address urban heat stress and access relevant data and knowledge to implement effective cooling infrastructures. You will work closely with product, design, and engineering teams to transform insights collected through discovery interviews with different urban heat actors and design wireframes tested with users into deployed live applications.</div><div><br></div><div><b>This is a part-time role.</b></div><h3>Here are some of the exciting day-to-day challenges you will face in this role:</h3><li>Build and demonstrate rapid prototypes and identify technical opportunities for scaling them: Data dashboards, geospatial applications, and decision-support tools.</li><li>Engage with the Data Lab engineering team on architectural decisions: Data storage, API services, applications deployment.</li><li>Work with product and design to deliver features based on design requirements and user research findings</li><li>Work closely with researchers to transform their research findings and generated datasets into user-facing applications</li><li>Integrate datasets and indicators generated by data scientists into our database with respect to APIs requirements and formats</li><li>Contribute to maintaining Cities Heat Data Catalogue</li>,<h3>You will shine if you have these:</h3><li>Strong hands-on experience with Node.js, Typescript, Next.js</li><li>Strong hands-on experience with Javascript, HTML/CSS, React</li><li>Experience with Javascript testing frameworks such as Jest and Cypress</li><li>Experience with API development using FastAPI or comparable Javascript framework (hapi, nestjs)</li><li>Experience with GIS web application development such as Leaflet, ArcGIS, Mapbox, and cloud-native geospatial data formats (Cloud-Optimized GeoTIFF, GeoParquet, STAC...)</li><li>Experience with SQL (PostgreSQL) and NoSQL (Redis) databases.</li><li>Experience with cloud services such as AWS (ECS, Lamba, SQS, S3, etc..)</li><li>Experience in building maintainable and reliable frontend and backend software in agile environments</li><li>Experience with continuous integration and deployment</li><li>Excellent communication and interpersonal skills</li><li>Self-motivated learner with a willingness and ability to take on new challenges</li><li>Interest in working for a mission-driven environmental organization</li>,<h3>It doesn’t hurt if you also have:</h3><li>Bachelor’s degree in computer science or a related field</li><li>Experience and desire to work with geospatial data systems and large-scale data analysis</li><li>Experience working across a matrixed team</li><li>Passion about the work that you are doing</li><li>Leadership experience, ability to lead and support other engineers</li>,<h3>Here are some of the perks we offer you:</h3><li>Salary in USD</li><li>Flexible schedule (within US Time zones)</li><li>100% Remote</li><div><b style=\"font-size: 24px\">Hey, you are still here!</b><span style=\"font-size: 24px\">&nbsp;</span></div><div><br></div><div>So, let us ask a few questions. Do you like working in a friendly environment? Are you fluent in English? Do you have a strong work ethic, are detail-oriented and have an ownership mentality? And most importantly do you love music and puppies? If so, then what are you waiting for? Come join our team and become part of this awesome company! We will be expecting you.</div>","tags":"[\"postgres\",\"javascript\",\"typescript\",\"engineering\",\"database\",\"aws\"]","pubDate":"2024-09-19 15:48:48.213","link":"https://jobs.lever.co/bluecoding/dd475e7a-b3d3-4e99-8a64-9222b8798ed3","savedDate":"2024-09-20 06:43:36.229","slug":"senior-full-stack-developer-w-blue-coding-6919"},{"id":4289115959,"title":"Senior Fullstack Engineer","company":"Scroll","image":"https://avatars.githubusercontent.com/u/87750292?s=200&v=4","description":"&lt;div class=&quot;content-intro&quot;&gt;&lt;p&gt;Scroll is a Layer 2 scaling solution for Ethereum, specifically focusing on zkRollups. Key aspects of Scroll are zkRollup technology, Scalability, Efficiency, Security, and Developer-friendly. Overall, Scroll plays a crucial role in addressing Ethereum&#39;s scalability challenges and facilitating the growth of decentralized finance (DeFi) and other blockchain-based applications by providing a scalable and efficient Layer 2 solution.&amp;nbsp;&lt;/p&gt;&lt;/div&gt;&lt;p&gt;&lt;strong&gt;About Scroll…&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;Scroll is building an open source, bytecode level compatible zkEVM layer 2 solution for Ethereum. Our mission is to scale Ethereum while maintaining our values of credible neutrality, openness, and community driven.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;About the Team/Role&lt;/strong&gt; &lt;br&gt;&lt;br&gt;You will join a fast-paced, dynamic, and highly skilled engineering team dedicated to building one of the most cutting-edge Layer 2 solutions in the blockchain space. As a Fullstack Engineer, you’ll work at the intersection of decentralized technology and scalable applications. You’ll be responsible for contributing to the development of both the frontend and backend components of Scroll&#39;s architecture, using technologies such as React, Next.js, and Node.js. If you&#39;re passionate about Ethereum, excited about working with zkEVMs, and want to play a critical role in building the future of scalable blockchain infrastructure, this role is for you.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;What you’ll do:&lt;/strong&gt;&amp;nbsp;&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;Design, develop, and maintain the frontend and backend of Scroll&#39;s Layer 2 solution.&lt;/li&gt;\n&lt;li&gt;Collaborate closely with the product team to ensure seamless integration and feature development.&lt;/li&gt;\n&lt;li&gt;Write clean, efficient, and well-documented code that follows best practices.&lt;/li&gt;\n&lt;li&gt;Debug, troubleshoot, and optimize existing code to improve performance and scalability.&lt;/li&gt;\n&lt;li&gt;Participate in design and code reviews, and mentor junior team members.&lt;/li&gt;\n&lt;li&gt;Ensure the technical feasibility of UI/UX designs and optimize applications for maximum speed and scalability.&lt;/li&gt;\n&lt;li&gt;Contribute to the overall architecture and technical direction of the Scroll project.&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;&lt;strong&gt;What you&#39;ll need:&lt;/strong&gt;&amp;nbsp;&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;Proficiency in Fullstack development with expertise in React, Next.js, and Node.js.&lt;/li&gt;\n&lt;li&gt;Strong understanding of JavaScript, TypeScript, and modern web development tools.&lt;/li&gt;\n&lt;li&gt;Experience with building and consuming RESTful APIs and working with databases like PostgreSQL or MongoDB.&lt;/li&gt;\n&lt;li&gt;Ability to work in a collaborative team environment, using version control (Git) and modern development workflows.&lt;/li&gt;\n&lt;li&gt;Strong problem-solving skills with a focus on delivering high-quality code.&lt;/li&gt;\n&lt;li&gt;Excellent communication skills and the ability to work in a fast-paced, decentralized team.&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;&lt;strong&gt;Nice to haves:&lt;/strong&gt;&amp;nbsp;&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;Experience working in the blockchain or decentralized technology space, especially with Ethereum or Layer 2 solutions.&lt;/li&gt;\n&lt;li&gt;Prior experience working in open-source projects and contributing to decentralized communities.&lt;/li&gt;\n&lt;li&gt;Familiarity with hosting platforms like Vercel for easy and scalable deployments.&lt;/li&gt;\n&lt;li&gt;Experience with Go is a plus.&lt;/li&gt;\n&lt;li&gt;Chinese language ability is a plus.&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;&amp;nbsp;&lt;/p&gt;&lt;div class=&quot;content-conclusion&quot;&gt;&lt;h3&gt;&lt;strong&gt;About You&lt;/strong&gt;&lt;/h3&gt;\n&lt;ul&gt;\n&lt;li&gt;You are a self-starter and ability to take ownership, well organised, self-disciplined and effective when working autonomously on tasks and projects;&lt;/li&gt;\n&lt;li&gt;You are responsive, collaborative and committed person with a high work ethic;&lt;/li&gt;\n&lt;li&gt;You are a high class communicator who can articulate their views succinctly on calls or asynchronously in globally distributed, remote teams;&lt;/li&gt;\n&lt;li&gt;You relish working in an agile start-up environment;&lt;/li&gt;\n&lt;li&gt;You are a great listener who understands when to listen first and engages well with colleagues;&lt;/li&gt;\n&lt;li&gt;You are a resilient, driven individual who is willing and able to continually develop and iterate to succeed;&lt;/li&gt;\n&lt;/ul&gt;\n&lt;h3&gt;&lt;strong&gt;What We Offer&lt;/strong&gt;&lt;/h3&gt;\n&lt;ul&gt;\n&lt;li&gt;A mission-led, collaborative culture&lt;/li&gt;\n&lt;li&gt;Opportunity to work with cutting edge technology and like-minded people who are contributing to the progression of Ethereum&lt;/li&gt;\n&lt;li&gt;Competitive salary package / generous paid time off / annual growth budget&lt;/li&gt;\n&lt;li&gt;100% remote from any location with flexible hours&lt;/li&gt;\n&lt;li&gt;Home office set up / co-working membership allowance&lt;/li&gt;\n&lt;li&gt;Private healthcare in selected countries&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;&lt;em&gt;Scroll is proud to be an equal opportunity workplace. We are committed to equal employment opportunities regardless of race, color, ancestry, religion, sex, national origin, sexual orientation, age, citizenship, marital status, disability, gender identity, or Veteran status. If you have a disability or special need, please let us know and we&#39;ll do our best to accommodate.&lt;/em&gt;&lt;/p&gt;\n&lt;p&gt;&amp;nbsp;&lt;/p&gt;&lt;/div&gt;","tags":"[\"postgres\",\"javascript\",\"typescript\",\"Finance\",\"engineering\",\"database\",\"mongo\"]","pubDate":"2024-09-19 02:52:38.000","link":"https://job-boards.eu.greenhouse.io/scrollio/jobs/4394811101","savedDate":"2024-09-20 06:43:36.228","slug":"senior-fullstack-engineer-scroll-6860"},{"id":9732552973,"title":"Django/Full Stack Developer","company":"CloudLinux","image":"https://pbs.twimg.com/profile_images/696718028084482050/ymY3OEPk_400x400.png","description":"<p>CloudLinux is a global remote-first company. We are driven by our principles: do the right thing, employees first, we are remote first, and we deliver high volume, low-cost Linux infrastructure and security products that help companies to increase the efficiency of their operations. Every person on our team supports each other and does what we can to ensure we all are successful.&nbsp;We are truly a great place to work. </p><p>Check out our website for more information<a href=\"https://cloudlinux.com/\" rel=\"nofollow noreferrer noopener\" class=\"external\"> https://cloudlinux.com/</a></p><p>We are looking for a Django/Full Stack Developer to </p><p>create an internal build &amp; automation system from scratch. The product is designed to expedite the delivery of security patches as part of extended life support services provided by Cloudlinux.&nbsp;</p><p>Since the system will be established for internal use your end users will be colleagues working next to you. This is a great opportunity to bring value to fellow engineers.</p><p>The system is meant to be built from scratch, therefore a wide knowledge of the end-to-end pipeline of architecture/design phase, planning, development, and deployment is a must. However, we have a separate infrastructure team that is responsible for the infrastructure maintenance.&nbsp;</p><p></p><p></p><h3>Key Responsibilities:</h3><ul> <li>Design, develop, test, and deliver web applications using Django and related technologies.</li> <li>Technical ownership of the created application.</li> <li>Implement user interfaces using front-end technologies (HTML, CSS, JavaScript frameworks).</li> <li>Work with Linux-based systems for deployment and development, including container management (Docker, Kubernetes).</li> <li>Build pipelines for code testing and delivery.</li> <li>Ensure application security and data protection.</li> <li>Troubleshoot and debug code across the stack.</li> <li>Version control using Git, including branching, merging, and pull requests.</li> <li>Review your colleagues' code.</li> <li>Plan your work forward.</li> </ul><h3>Requirements: </h3><p><strong>To thrive in this role, we are looking for someone who has:</strong></p><ul> <li>Minimum of 5 years of experience in Django or full stack development.</li> <li>Proficiency in Django and Python for backend development.</li> <li>Strong experience with Linux as a development and deployment environment.</li> <li>Proven experience in building web applications and scalable systems.</li> <li>Hands-on experience with containers, such as Docker, for development and production.</li> <li>Proficiency with Git for version control.</li> <li>Solid understanding of SQL and experience with relational databases (e.g., PostgreSQL, MySQL).</li> <li>Experience with libraries for managing background tasks like Celery or similar.</li> <li>Experience with tools for managing task queues like RabbitMQ or Kafka.</li> <li>Strong experience with building CI pipelines in tools like Gitlab or Jenkins.</li> <li>Strong problem-solving skills and attention to detail.</li> <li>An intermediate level of English language proficiency.</li> <li>Ability to work with vague requirements.</li> <li>You are a team player who can collaborate effectively.</li> </ul><p></p><p><strong>It would be great if you also have:</strong></p><ul> <li>Experience with front-end technologies like React, Vue.js, or Angular.</li> <li>Experience with test automation frameworks.</li> <li>Experience with Kubernetes, helm charts, and ArgoCD or similar.</li> </ul><h3>Benefits: </h3><p><strong>What's in it for you?</strong></p><ul> <li>A focus on professional development</li> <li>Interesting and challenging projects</li> <li>Fully remote work with flexible working hours, that allows you to schedule your day and work from any location worldwide</li> <li>Paid 24 days of vacation per year, 10 days of national holidays, and unlimited sick leaves</li> <li>Compensation for private medical insurance</li> <li>Co-working and gym/sports reimbursement</li> <li>Budget for education</li> <li>The opportunity to receive a reward for the most innovative idea that the company can patent</li> </ul><p></p><p></p><p><em>By applying for this position, you agree with&nbsp;</em>the Cloudlinux Privacy Policy <a href=\"https://cloudlinux.com/privacy-policy\" target=\"_blank\" rel=\"nofollow noreferrer noopener\" class=\"external\">https://cloudlinux.com/privacy-policy</a><em> and give us your consent to maintain and process your personal data in this respect. Please read our Privacy Policy for more information.</em></p>","tags":"[\"postgres\",\"javascript\",\"management\",\"database\",\"mysql\"]","pubDate":"2024-09-19 00:00:00.000","link":"https://apply.workable.com/cloudlinux-1/j/35886A3A9A","savedDate":"2024-09-20 06:43:36.226","slug":"django-full-stack-developer-cloudlinux-1280"},{"id":4569354766,"title":"Student Mentor","company":"Offensive Security","image":"https://remotive.com/job/1937744/logo","description":"<p><strong>About OffSec</strong></p>\n<p>Founded in 2007 by the creators of Kali Linux, OffSec (formerly known as Offensive Security) is the leading provider of continuous professional and workforce development, training, and education for cybersecurity practitioners. OffSec’s distinct pedagogy and practical, hands-on learning help organizations fill the infosec talent gap by training their teams on today’s most critical skills.</p>\n<p><strong>Become a part of our global presence and work from anywhere. </strong>With team members in over 40 countries, we believe in inspiring people of all backgrounds and communities. The OffSec team is composed of diverse, internationally published authors, conference speakers, and seasoned information technology professionals from both the private sector and governments worldwide.</p>\n<p>Excited about our mission and what we do? Apply and join us!</p>\n<p><strong>About the Job</strong></p>\n<p>An OffSec Student Mentor is responsible for providing support and guidance to OffSec students via live chat, support email and grading exams.  Exam grading will be based on the certification(s) the individual has achieved.  Based on the candidate’s strengths and preferences, duties will include supporting various project assignments such as online/remote course training, vulnerable machine testing, wiki creation, troubleshoot network connectivity and software development.</p>\n<p>The Student Mentor role is a full-time salaried position with shift work required, including evenings and weekends. The shift hours for this position would be a set schedule of 40 hours, which can include weekends and holidays. </p>\n<p><strong>Duties and responsibilities</strong></p>\n<ul style=\"\">\n<li style=\"\">Engage, collaborate and help learnerson the OffSec Community Platform through live chat and email support</li>\n<li style=\"\">Present live stream videos or webinars for concept demonstration, machine walkthroughs, or topics related to cybersecurity</li>\n<li style=\"\">Participate in projects including, but not limited to, curriculum and learning path designs, reviewing new courses, and implementing new tools and systems, etc.</li>\n<li style=\"\">Grade exams</li>\n<li style=\"\">Test, configure, deploy, and troubleshoot OffSec lab systems and machines</li>\n<li style=\"\">Create and maintain department document guidelines, procedures and processes</li>\n<li style=\"\">Complete daily tasks while providing learner support in a timely and satisfactory manner</li>\n<li style=\"\">Assist cross-functional teams as needed</li>\n<li style=\"\">Ability to work a shift schedule</li>\n<li style=\"\">Travel internationally to help present at conferences or customer locations when needed </li>\n</ul>\n<p><strong>Qualifications</strong></p>\n<ul style=\"\">\n<li style=\"\">OSCP certification </li>\n<li style=\"\">CyberSecurity mindset for creative and innovative problem solving</li>\n<li style=\"\">Must be able to speak, read, write and comprehend English with full fluency</li>\n<li style=\"\">3+ years of well-rounded IT experience, including at least 2 years in server-side technologies and management, as well as experience operating and troubleshooting Linux and Windows</li>\n<li style=\"\">Familiarity with enterprise-level networking configuration</li>\n<li style=\"\">Familiarity with defense cybersecurity, such as SOC, IR, TH, MITRE D3FEND, and NICE/NIST framework, is a plus.</li>\n<li style=\"\">A strong drive to continually improve customer experience, success, and engagement, leveraging data and metrics.</li>\n<li style=\"\">Excellent interpersonal and customer service skills</li>\n<li style=\"\">Strong attention to detail, with excellent analytical and investigation skills</li>\n<li style=\"\">Ability to work unsupervised in a fast-paced environment with tight deadlines</li>\n<li style=\"\">A strong belief and understanding of being a team player in a remote working environment</li>\n<li style=\"\">Ability to travel internationally without restriction as needed.</li>\n</ul>\n<p><strong>Desired Skills</strong></p>\n<ul style=\"\">\n<li style=\"\">Experience in teaching and mentoring </li>\n<li style=\"\">Excellent written and verbal communication skills.</li>\n<li style=\"\">Strong knowledge of networking, virtualization, Windows, storage, and backup</li>\n<li style=\"\">Prior experience working remotely</li>\n<li style=\"\">Experience working with customer service ticketing system(s)</li>\n<li style=\"\">Strong problem-solving skills</li>\n</ul>\n<p><strong>Working conditions</strong></p>\n<p>This role is a full-time salaried position with shift work required, including evenings and weekends. The shift hours will be determined by the student mentor manager.</p>\n<p><strong>Direct reports</strong></p>\n<p>This position has no direct reports.</p>\n<p><strong>EEO</strong></p>\n<p>OffSec provides equal employment opportunities to all employees and applicants for employment and prohibits discrimination and harassment of any type without regard to race, color, religion, age, sex, national origin, disability status, genetics, protected veteran status, sexual orientation, gender identity or expression, or any other characteristic protected by federal, state or local laws.</p>\n<p>This policy applies to all terms and conditions of employment, including recruiting, hiring, placement, promotion, termination, layoff, recall, transfer, leaves of absence, compensation and training.</p>\n<img src=\"https://remotive.com/job/track/1937744/blank.gif?source=public_api\" alt=\"\"/>","tags":"[\"security\",\"teaching\",\"mentoring\",\"cybersecurity\",\"chat\",\"troubleshooting\",\"Linux/Unix\",\"ticketing\",\"infosec\",\"testing\",\"information technology\",\"SOC\",\"travel\",\"virtualization\"]","pubDate":"2024-09-18 09:20:47.000","link":"https://remotive.com/remote-jobs/all-others/student-mentor-1937744","savedDate":"2024-09-20 06:43:36.221","slug":"student-mentor-offensive-security-2422"},{"id":9392356291,"title":"Backend Software Engineer","company":"Ferocia Services","image":"https://remotive.com/job/1937196/logo","description":"<p><strong>About Us</strong></p>\n<p>We are a stealth-mode startup at the forefront of developing innovative software solutions focused on enhancing productivity and mental health. Our mission is to leverage technology to create tools that not only improve efficiency but also support the well-being of our users. Given our current status and the pending trademark of our unique solution, we are limited in the details we can share. However, we are on the lookout for creative and talented individuals who are ready to dive into a challenging and rewarding project with us.</p>\n<p><strong>Role Summary</strong></p>\n<p>We are seeking a mid-level Backend Software Engineer to join our pioneering team. This contract position is an excellent opportunity for a self-managed individual with startup experience and a strong foundation in TypeScript and full-stack development. You will play a crucial role in the development of our web application, focusing on creating intuitive, robust, and scalable features that deliver outstanding user experiences in the realms of productivity and mental health.</p>\n<div class=\"h2\">Tasks</div>\n<ul style=\"\">\n<li style=\"\">Design, develop, and maintain our innovative backend application, focusing on sync and async data processing on a REST API as well as data consuming data on Apache Kafka.</li>\n<li style=\"\">Utilize Rust or Elixir, PostgreSQL, REST API, Apache Kafka and be able to interact with several other APIs.</li>\n<li style=\"\">Design database schemas and migrations to ensure that new features are deployed with 0 downtime.</li>\n<li style=\"\">Implement secure, efficient, and scalable solutions using best practices in software development.</li>\n<li style=\"\">Ensure the performance, quality, and responsiveness of applications.</li>\n<li style=\"\">Identify and correct bottlenecks and fix bugs.</li>\n<li style=\"\">Help maintain code quality, organization, and automatization.</li>\n</ul>\n<div class=\"h2\">Requirements</div>\n<ul style=\"\">\n<li style=\"\">Proven experience as a Full Stack Software Engineer with a strong focus on Rust, Elixir, or another functional programming language and web application development.</li>\n<li style=\"\">Be able to work in a self-managed environment with excellent written communication in English.</li>\n<li style=\"\">Strong experience with RDBMS and database migrations.</li>\n<li style=\"\">Strong experience building async applications with Apache Kafka</li>\n<li style=\"\">Ability to work independently in a fully remote setting, using your own equipment.</li>\n<li style=\"\">Excellent problem-solving skills and the ability to perform well in a fast-paced environment.</li>\n<li style=\"\">A portfolio of projects demonstrating your skill set and experience.</li>\n</ul>\n<div class=\"h2\">Benefits</div>\n<ul style=\"\">\n<li style=\"\">\n<p>A fully remote work environment with flexible hours.</p>\n</li>\n<li style=\"\">\n<p>An opportunity to be part of a groundbreaking startup and make a significant impact on our innovative product and community.</p>\n</li>\n<li style=\"\">\n<p>Competitive compensation and opportunity for growth.</p>\n</li>\n<li style=\"\">\n<p>This is a contract position with an initial term of three months.</p>\n</li>\n<li style=\"\">\n<p>The contract may be extended or transitioned into a permanent role based on performance and project needs.</p>\n</li>\n</ul>\n<div class=\"h1\">About the company</div>\n<p>Ferocia Services is a versatile technology and management consulting firm dedicated to solving complex challenges for clients across diverse industries. As part of the Ferocia Group, we leverage deep expertise to deliver innovative solutions tailored to the needs of our portfolio companies and external clients.</p>\n<p>We specialize in consumer software, SaaS, finance, management, product design, and management. Whether optimizing business processes, designing innovative products, or implementing advanced software solutions, we focus on delivering measurable results.</p>\n<p>Innovation and collaboration are at the heart of our approach. We stay ahead of industry trends to equip our clients with the tools and knowledge needed to thrive in a competitive landscape. From start-ups to established enterprises, Ferocia Services empowers businesses to achieve their objectives with confidence, turning challenges into opportunities for success.</p>\n<img src=\"https://remotive.com/job/track/1937196/blank.gif?source=public_api\" alt=\"\"/>","tags":"[\"postgresql\",\"elixir\",\"rust\"]","pubDate":"2024-09-18 01:20:43.000","link":"https://remotive.com/remote-jobs/software-dev/backend-software-engineer-1937196","savedDate":"2024-09-20 06:43:36.221","slug":"backend-software-engineer-ferocia-services-8658"},{"id":1371101664,"title":"Malware Analyst for anti-malware product (worldwide remote, work anywhere)","company":"CloudLinux","image":"https://pbs.twimg.com/profile_images/696718028084482050/ymY3OEPk_400x400.png","description":"<p>Imunify360 Security Suite is a product of CloudLinux Inc., the maker of the #1 OS in security and stability for hosting providers. Imunify is an innovative security solution designed specifically for shared and VPS/Dedicated servers. The automated, easy-to-use solution with the six-layer approach to security delivers comprehensive and complete attack prevention. Check out our website for more information about our Imunify Product: <a href=\"https://www.imunify360.com/.\" target=\"_blank\" rel=\"nofollow noreferrer noopener\" class=\"external\">https://www.imunify360.com/</a><strong>.</strong></p><p><strong>Our growing Imunify Security Team is looking for a Malware Analyst.</strong> In this role, you will analyze various types of malware targeting web hosting servers and implement enhancements to our products that will help prevent future infections for our clients. The position is fully remote with flexible hours, allowing you to plan your day and work from anywhere in the world. Join us and take your career to the next level!</p><p><strong>What You Will Do:</strong></p><ul> <li>Analyze diverse types of web malware affecting hosting servers globally</li> <li>Develop and refine methods for detecting and analyzing malicious files</li> <li>Conduct and publish research on current security threats</li> </ul><h3>Requirements: </h3><p><strong>To be successful in this role you should have:</strong></p><ul> <li>A good understanding of web server software and hosting systems architectures (Linux/UNIX-based)</li> <li>A solid understanding of PHP language, with proven experience in code analysis and scripting</li> <li>Basic knowledge of regular expressions (PCRE). We expect you to know the difference between \\A and ^, why you need to use modifiers (?: ...), and why you should not start a regex with \\w to find a fragment in a file, etc.</li> <li>Strong analytical skills</li> <li>English proficiency of at least Intermediate level</li> <li>Experience in developing security tools, automation, and frameworks</li> <li>Experience cleaning up websites from malware</li> <li>Web-based malware reverse engineering skills (JS deobfuscation, PHP deobfuscation)</li> </ul><h3>Benefits: </h3><p><strong>What's in it for you?</strong></p><ul> <li>A focus on professional development</li> <li>Interesting and challenging projects</li> <li>Flexible working hours</li> <li>Paid one month vacation per year and unlimited sick leave</li> <li>Medical insurance reimbursement</li> <li>Co-working and gym/sports reimbursement</li> <li>The opportunity to receive a reward for the most innovative idea that the company can patent</li> </ul><p></p><p><em>By applying for this position, you agree with </em><a href=\"https://cloudlinux.com/privacy-policy\" rel=\"nofollow noreferrer noopener\" class=\"external\"><em>Cloudlinux Privacy Policy</em></a><em> and give us your consent to maintain and process your personal data with this respect. Please read our Privacy Policy for more information.</em></p>","tags":"[\"engineering\"]","pubDate":"2024-09-18 00:00:00.000","link":"https://apply.workable.com/cloudlinux-1/j/C68FA3BF33","savedDate":"2024-09-20 06:43:36.226","slug":"malware-analyst-for-anti-malware-product-worldwide-remote-work-anywhere-cloudlinux-580"},{"id":4500958504,"title":"Senior Front-end Developer (A)","company":"Blue Coding","image":"https://media.licdn.com/dms/image/C4D0BAQHlK67hgnhzQw/company-logo_200_200/0/1631346154820?e=2147483647&v=beta&t=_R2Ssj7L_f4xqmSCcq0nOLCyCz0QN2lFnHssxxhj3YY","description":"<div><i style=\"font-size: 18px\">Do you want to earn a salary in USD?&nbsp;</i></div><div><i style=\"font-size: 18px\">Would you like to work from wherever you want?</i></div><div><i style=\"font-size: 18px\">Would you like to be a part of the leading next-gen software developers?&nbsp;</i></div><div><br></div><div><b style=\"font-size: 24px\">Hi, you finally found us!</b><span style=\"font-size: 24px\">&nbsp;</span></div><div><br></div><div><b style=\"font-size: 24px\">Why work at Blue Coding?</b><span style=\"font-size: 24px\">&nbsp;</span></div><div><br></div><div>At Blue Coding we specialize in hiring excellent developers and amazing people from all over Latin America and other parts of the world. For the past 10 years, we’ve helped cutting-edge companies in the United States and Canada -both large and small, build great development teams and develop great products. Online shops, digital agencies, SaaS providers, and software consulting firms are a few of our clients. Our team of over 100 engineers is distributed in more than 10 countries across the Americas. We are a fully remote company working with a wide array of technologies and have expertise in every stage of the software development process.&nbsp;&nbsp;</div><div><br></div><div>Our team is highly connected, united, and culturally diverse, and our collaborators are involved in many initiatives around the world, from wildlife preservation to volunteering at local charities. We also participate in group activities like movie nights, trivia, and meme competitions. We stand for honesty, fairness, respect, efficiency, hard work, and cooperation.</div><div><br></div><div><b style=\"font-size: 18px\">What are we looking for?</b></div><div><br></div><div><span style=\"font-size: 16px\">In this opportunity, we are looking for a Senior Front-end Developer to work with one of our foreign clients, who is a market leader in the consultation, design, procurement, implementation, and ongoing managed services for technology services for mid to large global enterprises. As a Telecom Managed Service company, they partner with over 300 service providers globally to help customers with technology design and find the best solutions to meet their needs.</span></div><div><br></div><div><span style=\"font-size: 16px\">If you are independent, a great communicator, a problem solver, and have strong attention to detail, this is a great fit for you! Our jobs are fully remote – as long as you have the skills and can get the work done well, you can work anywhere in the listed countries you want.</span></div><div><span style=\"font-size: 16px\">If you have the skills and can get the job done, join us and work from anywhere you want!</span></div><h3>Here are some of the exciting day-to-day challenges you will face in this role:</h3><li>Work on rich, responsive browser experiences</li><li>Participate in product design sessions and contribute to feature development.</li><li>Collaborating with UX/UI designers to implement design concepts through Storybook</li><li>Deliver reusable code and contribute to the in-house UI framework</li><li>Optimize applications for maximum speed, scalability, and user experience</li><li>Establish best practices, suggest new technologies, and design high-quality solutions</li>,<h3>You will shine if you have:</h3><li>6+ years of experience in software development</li><li>Highly proficient with JavaScript and JavaScript frameworks, specifically Vue.js</li><li>Ability to build isolated Vue components with strong TypeScript experience.</li><li>Solid understanding of HTML5, CSS3/4, and web design principles.</li><li>Knowledge of web performance optimization techniques.</li><li>Strong API Integration.</li><li>Experience with Git, unit, and integration testing</li><li>Experience with Agile methodologies such as Scrum and Kanban.</li><li>Strong problem-solving and debugging skills.</li><li>Ability to work collaboratively in a team.</li><li>Knowledge of web accessibility standards.</li><li>Excellent communication skills.</li>,<h3>Here are some of the perks we offer you:</h3><li>Salary in USD</li><li>Long-term</li><li>Flexible schedule (within US Time zones)</li><li>100% Remote</li><div><b style=\"font-size: 24px\">Hey, you are still here!</b><span style=\"font-size: 24px\">&nbsp;</span></div><div><br></div><div>So, let us ask a few questions. Do you like working in a friendly environment? Are you fluent in English? Do you have a strong work ethic, are detail-oriented and have an ownership mentality? And most importantly do you love music and puppies? If so, then what are you waiting for? Come join our team and become part of this awesome company! We will be expecting you.</div>","tags":"[\"javascript\",\"typescript\"]","pubDate":"2024-09-17 20:35:17.803","link":"https://jobs.lever.co/bluecoding/87606071-d5e6-427d-89b5-e0f6efe30fef","savedDate":"2024-09-20 06:43:36.228","slug":"senior-front-end-developer-a-blue-coding-735"},{"id":5910089038,"title":"Content Writer","company":"Scroll","image":"https://avatars.githubusercontent.com/u/87750292?s=200&v=4","description":"&lt;div class=&quot;content-intro&quot;&gt;&lt;p&gt;Scroll is a Layer 2 scaling solution for Ethereum, specifically focusing on zkRollups. Key aspects of Scroll are zkRollup technology, Scalability, Efficiency, Security, and Developer-friendly. Overall, Scroll plays a crucial role in addressing Ethereum&#39;s scalability challenges and facilitating the growth of decentralized finance (DeFi) and other blockchain-based applications by providing a scalable and efficient Layer 2 solution.&amp;nbsp;&lt;/p&gt;&lt;/div&gt;&lt;p&gt;&lt;strong&gt;Role Overview:&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;We are seeking an experienced Content Writer with a strong understanding of market trends in the ZKP and L2s. The ideal candidate will be adept at producing high-quality, engaging content that aligns with Scroll’s mission and vision, while staying ahead of industry developments.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Key Responsibilities:&lt;/strong&gt;&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;Write and edit articles, blog posts, and other content pieces that reflect Scroll’s expertise in zk-rollup technology and Web3 innovation.&lt;/li&gt;\n&lt;li&gt;Conduct thorough research to ensure content is accurate, relevant, and reflects the latest trends in the crypto and tech markets.&lt;/li&gt;\n&lt;li&gt;Collaborate with internal stakeholders to understand key messages and objectives, ensuring that all content supports Scroll’s strategic goals.&lt;/li&gt;\n&lt;li&gt;Maintain a consistent tone and style across all written materials, tailored to different audiences and platforms.&lt;/li&gt;\n&lt;li&gt;Stay updated on industry developments and incorporate insights into content to position Scroll as a thought leader.&lt;/li&gt;\n&lt;li&gt;Manage multiple writing projects simultaneously, adhering to deadlines and delivering high-quality work.&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;&lt;strong&gt;Qualifications:&lt;/strong&gt;&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;Proven experience as a Ghost Writer or content creator, with a portfolio demonstrating expertise in crypto or technology topics.&lt;/li&gt;\n&lt;li&gt;Strong understanding of market trends and developments in the cryptocurrency and tech sectors.&lt;/li&gt;\n&lt;li&gt;Exceptional writing, editing, and proofreading skills, with an ability to adapt tone and style to different formats and audiences.&lt;/li&gt;\n&lt;li&gt;Ability to conduct in-depth research and present complex information in a clear and engaging manner.&lt;/li&gt;\n&lt;li&gt;Excellent organizational skills and the ability to manage multiple projects and deadlines effectively.&lt;/li&gt;\n&lt;li&gt;Familiarity with ZKP and L2s is highly desirable.&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;If you are a skilled Content Writer with a passion for cryptocurrency and technology, and you’re excited about the opportunity to contribute to a leading Web3 company, we encourage you to apply.&lt;/p&gt;\n&lt;p&gt;&lt;/p&gt;&lt;div class=&quot;content-conclusion&quot;&gt;&lt;h3&gt;&lt;strong&gt;About You&lt;/strong&gt;&lt;/h3&gt;\n&lt;ul&gt;\n&lt;li&gt;You are a self-starter and ability to take ownership, well organised, self-disciplined and effective when working autonomously on tasks and projects;&lt;/li&gt;\n&lt;li&gt;You are responsive, collaborative and committed person with a high work ethic;&lt;/li&gt;\n&lt;li&gt;You are a high class communicator who can articulate their views succinctly on calls or asynchronously in globally distributed, remote teams;&lt;/li&gt;\n&lt;li&gt;You relish working in an agile start-up environment;&lt;/li&gt;\n&lt;li&gt;You are a great listener who understands when to listen first and engages well with colleagues;&lt;/li&gt;\n&lt;li&gt;You are a resilient, driven individual who is willing and able to continually develop and iterate to succeed;&lt;/li&gt;\n&lt;/ul&gt;\n&lt;h3&gt;&lt;strong&gt;What We Offer&lt;/strong&gt;&lt;/h3&gt;\n&lt;ul&gt;\n&lt;li&gt;A mission-led, collaborative culture&lt;/li&gt;\n&lt;li&gt;Opportunity to work with cutting edge technology and like-minded people who are contributing to the progression of Ethereum&lt;/li&gt;\n&lt;li&gt;Competitive salary package / generous paid time off / annual growth budget&lt;/li&gt;\n&lt;li&gt;100% remote from any location with flexible hours&lt;/li&gt;\n&lt;li&gt;Home office set up / co-working membership allowance&lt;/li&gt;\n&lt;li&gt;Private healthcare in selected countries&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;&lt;em&gt;Scroll is proud to be an equal opportunity workplace. We are committed to equal employment opportunities regardless of race, color, ancestry, religion, sex, national origin, sexual orientation, age, citizenship, marital status, disability, gender identity, or Veteran status. If you have a disability or special need, please let us know and we&#39;ll do our best to accommodate.&lt;/em&gt;&lt;/p&gt;\n&lt;p&gt;&amp;nbsp;&lt;/p&gt;&lt;/div&gt;","tags":"[\"Finance\"]","pubDate":"2024-09-17 14:19:02.000","link":"https://job-boards.eu.greenhouse.io/scrollio/jobs/4394046101","savedDate":"2024-09-20 06:43:36.227","slug":"content-writer-scroll-3921"},{"id":7471558104,"title":"PR Manager","company":"Scroll","image":"https://avatars.githubusercontent.com/u/87750292?s=200&v=4","description":"&lt;div class=&quot;content-intro&quot;&gt;&lt;p&gt;Scroll is a Layer 2 scaling solution for Ethereum, specifically focusing on zkRollups. Key aspects of Scroll are zkRollup technology, Scalability, Efficiency, Security, and Developer-friendly. Overall, Scroll plays a crucial role in addressing Ethereum&#39;s scalability challenges and facilitating the growth of decentralized finance (DeFi) and other blockchain-based applications by providing a scalable and efficient Layer 2 solution.&amp;nbsp;&lt;/p&gt;&lt;/div&gt;&lt;p&gt;&lt;strong&gt;Role Overview:&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;We are looking for a dynamic and experienced Public Relations Manager to join our team. The ideal candidate will possess a deep understanding of public relations and have a proven ability to craft compelling messages for formal media outlets. This role will be crucial in shaping our company’s public image, building strong media relationships, and ensuring effective communication strategies.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Key Responsibilities:&lt;/strong&gt;&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;Develop and implement comprehensive public relations strategies to enhance Scroll’s visibility and reputation in the Web3 and blockchain sectors.&lt;/li&gt;\n&lt;li&gt;Craft and deploy high-quality press releases, media statements, and other written materials for distribution to formal media outlets.&lt;/li&gt;\n&lt;li&gt;Directly managing our PR agency and acting as liaison between the agency and ourselves.&lt;/li&gt;\n&lt;li&gt;Bias for action in applying/scheduling opportunities for our spokespeople&lt;/li&gt;\n&lt;li&gt;Establish and maintain relationships with key media contacts, industry influencers, and thought leaders.&lt;/li&gt;\n&lt;li&gt;Monitor industry trends and news to identify opportunities for media coverage and proactive outreach.&lt;/li&gt;\n&lt;li&gt;Coordinate and manage media events, interviews, and press briefings to promote company initiatives and achievements; manage crisis management.&lt;/li&gt;\n&lt;li&gt;Collaborate with internal teams to align PR efforts with overall company goals and messaging.&lt;/li&gt;\n&lt;li&gt;Track and analyze the effectiveness of PR campaigns and media coverage to continually refine strategies.&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;&lt;strong&gt;Qualifications:&lt;/strong&gt;&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;Good track record &amp;amp; references&lt;/li&gt;\n&lt;li&gt;Web2 journalist that has worked in tech journalism&lt;/li&gt;\n&lt;li&gt;Proven experience in public relations, ideally within the technology or blockchain industry.&lt;/li&gt;\n&lt;li&gt;Strong writing and editing skills, with a track record of producing content for formal media outlets.&lt;/li&gt;\n&lt;li&gt;Excellent communication and interpersonal skills, with the ability to build and maintain media relationships.&lt;/li&gt;\n&lt;li&gt;Demonstrated ability to manage multiple projects and deadlines in a fast-paced environment.&lt;/li&gt;\n&lt;li&gt;A proactive and strategic thinker with a passion for the Web3 and blockchain space.&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;If you are a seasoned PR professional with a knack for engaging with media and a passion for Web3 technology, we would love to hear from you. Apply today to join Scroll and help us shape the future of blockchain scalability and privacy.&lt;/p&gt;\n&lt;p&gt;&lt;/p&gt;&lt;div class=&quot;content-conclusion&quot;&gt;&lt;h3&gt;&lt;strong&gt;About You&lt;/strong&gt;&lt;/h3&gt;\n&lt;ul&gt;\n&lt;li&gt;You are a self-starter and ability to take ownership, well organised, self-disciplined and effective when working autonomously on tasks and projects;&lt;/li&gt;\n&lt;li&gt;You are responsive, collaborative and committed person with a high work ethic;&lt;/li&gt;\n&lt;li&gt;You are a high class communicator who can articulate their views succinctly on calls or asynchronously in globally distributed, remote teams;&lt;/li&gt;\n&lt;li&gt;You relish working in an agile start-up environment;&lt;/li&gt;\n&lt;li&gt;You are a great listener who understands when to listen first and engages well with colleagues;&lt;/li&gt;\n&lt;li&gt;You are a resilient, driven individual who is willing and able to continually develop and iterate to succeed;&lt;/li&gt;\n&lt;/ul&gt;\n&lt;h3&gt;&lt;strong&gt;What We Offer&lt;/strong&gt;&lt;/h3&gt;\n&lt;ul&gt;\n&lt;li&gt;A mission-led, collaborative culture&lt;/li&gt;\n&lt;li&gt;Opportunity to work with cutting edge technology and like-minded people who are contributing to the progression of Ethereum&lt;/li&gt;\n&lt;li&gt;Competitive salary package / generous paid time off / annual growth budget&lt;/li&gt;\n&lt;li&gt;100% remote from any location with flexible hours&lt;/li&gt;\n&lt;li&gt;Home office set up / co-working membership allowance&lt;/li&gt;\n&lt;li&gt;Private healthcare in selected countries&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;&lt;em&gt;Scroll is proud to be an equal opportunity workplace. We are committed to equal employment opportunities regardless of race, color, ancestry, religion, sex, national origin, sexual orientation, age, citizenship, marital status, disability, gender identity, or Veteran status. If you have a disability or special need, please let us know and we&#39;ll do our best to accommodate.&lt;/em&gt;&lt;/p&gt;\n&lt;p&gt;&amp;nbsp;&lt;/p&gt;&lt;/div&gt;","tags":"[\"Finance\",\"management\"]","pubDate":"2024-09-17 14:16:06.000","link":"https://job-boards.eu.greenhouse.io/scrollio/jobs/4394037101","savedDate":"2024-09-20 06:43:36.228","slug":"pr-manager-scroll-6250"},{"id":3612057120,"title":"Treasury Operations Analyst","company":"Backflip","image":"https://media.licdn.com/dms/image/D560BAQH1_SFy5Vwlhg/company-logo_200_200/0/1686838667749?e=2147483647&v=beta&t=vjEnSv9MgRj3-PLOfPnBySXxJkFKZF1SkMxzVFcxr8c","description":"<div><a style=\"font-size: 11pt\" href=\"https://dobackflip.com/\">Backflip</a><span style=\"font-size: 11pt\"> is a venture-backed </span><b style=\"font-size: 11pt\">FinTech</b><span style=\"font-size: 11pt\"> company that </span><b style=\"font-size: 11pt\">empowers anyone to improve their life and their neighborhood through real estate investing</b><span style=\"font-size: 11pt\">. To do that, we need people who are inspired to reimagine and rebuild an outdated and unbalanced system; to support and celebrate America’s local entrepreneurs.</span><a style=\"font-size: 11pt\" href=\"https://backflip.app.link/hdYmZF9JwLb\">Check out the Backflip app here to experience first hand how we're making a difference through our technology</a><span style=\"font-size: 11pt\">.</span></div><div><br></div><div><span style=\"font-size: 11pt\">Backflip’s Corporate Finance team provides data-driven insights to inform strategic and operational decisions across the company. We're seeking a motivated and detail-oriented </span><b style=\"font-size: 11pt\">Treasury Operations Analyst</b><span style=\"font-size: 11pt\"> to play an integral role in Backflip’s Finance function. In this role, you will be a key contributor in managing day-to-day cash flows as well as designing and implementing scalable treasury processes to support our rapid growth. We’re looking for someone who possesses strong organizational skills, attention to detail, and thrives in a fast-paced, entrepreneurial environment. Success in this role requires the ability to learn quickly while balancing structure and autonomy.</span></div><div><br></div><div><span style=\"font-size: 11pt\">This is a rare opportunity to get in on the ground floor (~75 person team) working directly with senior leaders in a well-capitalized startup with a great culture (</span><a style=\"font-size: 11pt\" href=\"https://techcrunch.com/2024/04/29/backflip-raises-15-million-to-help-real-estate-investors-flip-houses/?guccounter=1&amp;guce_referrer=aHR0cHM6Ly93d3cuZ29vZ2xlLmNvbS8&amp;guce_referrer_sig=AQAAABk3K7EzQ-RsoX2uq_YCeKN3dCJPqN1FsdwJFbmB30YwsTXb2qogu-d0mtoA_sfc9ZWtyzGW04VxvOa9iDbHgMqyiLHq5hahjz5Ym4hQ6WtWy-OfMFEBck0bSanRkxZg89Eme5WfG-lXEOjuecZ1mCfDE9DCAFFL8feoIKJ8RlsQ\">Check out our recently announced $15M Series A</a><span style=\"font-size: 11pt\">).</span></div><div><a href=\"https://dobackflip.com/\" style=\"font-size: 11pt\">Backflip</a><span style=\"font-size: 11pt\"> is a venture-backed </span><b style=\"font-size: 11pt\">FinTech</b><span style=\"font-size: 11pt\"> company that </span><b style=\"font-size: 11pt\">empowers anyone to improve their life and their neighborhood through real estate investing</b><span style=\"font-size: 11pt\">. To do that, we need people who are inspired to reimagine and rebuild an outdated and unbalanced system; to support and celebrate America’s local entrepreneurs.</span><a href=\"https://backflip.app.link/hdYmZF9JwLb\" style=\"font-size: 11pt\">Check out the Backflip app here to experience first hand how we're making a difference through our technology</a><span style=\"font-size: 11pt\">.</span></div><div><br></div><div><span style=\"font-size: 11pt\">Backflip’s Corporate Finance team provides data-driven insights to inform strategic and operational decisions across the company. We're seeking a motivated and detail-oriented </span><b style=\"font-size: 11pt\">Treasury Operations Analyst</b><span style=\"font-size: 11pt\"> to play an integral role in Backflip’s Finance function. In this role, you will be a key contributor in managing day-to-day cash flows as well as designing and implementing scalable treasury processes to support our rapid growth. We’re looking for someone who possesses strong organizational skills, attention to detail, and thrives in a fast-paced, entrepreneurial environment. Success in this role requires the ability to learn quickly while balancing structure and autonomy.</span></div><div><br></div><div><span style=\"font-size: 11pt\">This is a rare opportunity to get in on the ground floor (~75 person team) working directly with senior leaders in a well-capitalized startup with a great culture (</span><a href=\"https://techcrunch.com/2024/04/29/backflip-raises-15-million-to-help-real-estate-investors-flip-houses/?guccounter=1&amp;guce_referrer=aHR0cHM6Ly93d3cuZ29vZ2xlLmNvbS8&amp;guce_referrer_sig=AQAAABk3K7EzQ-RsoX2uq_YCeKN3dCJPqN1FsdwJFbmB30YwsTXb2qogu-d0mtoA_sfc9ZWtyzGW04VxvOa9iDbHgMqyiLHq5hahjz5Ym4hQ6WtWy-OfMFEBck0bSanRkxZg89Eme5WfG-lXEOjuecZ1mCfDE9DCAFFL8feoIKJ8RlsQ\" style=\"font-size: 11pt\">Check out our recently announced $15M Series A</a><span style=\"font-size: 11pt\">).</span></div><div><br></div><h3>What You'll Do:</h3><li>Cash management - monitor and orchestrate daily cash movement between multiple entities and accounts to ensure operational liquidity and optimize cash allocation</li><li>Perform daily cash reconciliations and ensure all transactions are recorded accurately</li><li>Support the Loan Operations and Capital Markets teams by ensuring timely and accurate wire transfers in compliance with internal policies</li><li>Execute a cash-management strategy designed to minimize risk while maximizing interest revenue earned on cash reserves</li><li>Cultivate positive relationships with counterparts at Backflip’s capital markets partners</li><li>Support the Accounting team by processing payments, recording deposits, and preparing reconciliations</li><li>Proactively suggest and implement process improvements and execute system implementations to support the company's growth</li><li>Monitor compliance with third-party credit agreements and support monthly reporting&nbsp;</li><div><br></div><div><i>This role will evolve as the company grows; there will be various tasks that fall outside of the responsibilities above.&nbsp;</i></div><h3>Qualifications:</h3><li>Bachelor’s degree</li><li>2 - 5+ years of experience in Treasury, Finance, Accounting, or Loan Operations</li><li>Experience with in least one of the following industries preferred: i) real estate investments; ii) credit products; iii) mortgages, or; iv) early stage VC-backed startups (especially PropTech or FinTech)</li><li>Proficiency using Google Sheets and/or Microsoft Excel</li><li>Proficiency in understanding and organizing large data sets&nbsp;</li><li>Superior attention to detail and curiosity to investigate any irregularities</li><li>Action-oriented mindset with motivation and scrappiness to achieve objectives under pressure with limited resources</li><li>Understanding of investment concepts</li><li>Ability to multi-task with exceptional self-directed time management &amp; prioritization</li><h3>This candidate will champion Backflip’s culture & Core Values:</h3><li><b>Raise</b> the standard of what is possible</li><li><b>Embrace</b> being the novice to become the master</li><li><b>Work</b> only with those who want the best for us</li><li><b>Communicate</b> quickly, naturally and with radical candor</li><li><b>Test</b> new things to invent and challenge the status quo</li><li>Today, nay <b>now</b>!</li><div><i style=\"font-size: 16px\">Compensation for this role includes a base salary ranging from $100,000 - $120,000 plus an annual bonus, and is based on a variety of factors including prior experience, geographic location, stock option grant, and other factors, and may fall outside of the stated range for certain candidates. In addition to a competitive market salary, Backflip employees receive equity stock options, paid health care, and a 401K + company match, among other industry-leading benefits.</i></div><div><br></div><div><i style=\"font-size: 16px\">All Backflip positions are Remote. Like the people we serve, we believe being free to create wherever you’re most inspired is one of life’s greatest joys. It’s better for individuals, for community, and for fostering great work to emerge. With our work-from-anywhere approach, Backflip brings together a diverse team of individuals, with passions for innovation, art, coding, AI, data, finance, film, real estate, the environment, learning and teaching. Together, we're moving fast.</i></div><div><br></div><div><i style=\"font-size: 16px\">Backflip is an equal opportunity employer. We know that building a world-class organization is not possible without an intentional focus on recruiting, empowering, promoting and rewarding the best and brightest people of all backgrounds. Backflip focuses on hiring individuals that align with its Core Values (listed above), and consistently display a high ethical standard, both personally and professionally.</i></div>","tags":"[\"Finance\",\"management\"]","pubDate":"2024-09-16 13:51:13.191","link":"https://jobs.lever.co/backflip/5c7517cb-f25d-4b01-8f73-fdcdc5b2c800","savedDate":"2024-09-20 06:43:36.230","slug":"treasury-operations-analyst-backflip-7856"},{"id":8786856011,"title":"Relocation manager (worldwide remote, work anywhere)","company":"CloudLinux","image":"https://pbs.twimg.com/profile_images/696718028084482050/ymY3OEPk_400x400.png","description":"<p>CloudLinux is looking for a dynamic and experienced <strong>Relocation Manager</strong> who will be responsible for shaping and managing our employee relocation packages, ensuring they are clear and understandable for all.</p><p>We are a global remote-first company. We are driven by our principles: Do the right thing, employees first, we are remote first, and&nbsp; we deliver high volume, low-cost Linux infrastructure and security products that help companies to increase the efficiency of their operations. Every person on our team supports each other and does what we can to ensure we all are successful.&nbsp;We are truly a great place to work.&nbsp;</p><p><strong>Key Responsibilities:</strong></p><ul> <li> <strong>Develop and Manage Relocation Program:</strong> Create a clear, comprehensive relocation package and update it regularly to align with business needs.</li> <li> <strong>Key Employee Support:</strong> Provide tailored relocation assistance to key employees, addressing specific needs and refining support packages.</li> <li> <strong>Case Management and Documentation: </strong>Handle employee relocation cases, continuously improve guides on legal, tax, and compliance issues, and maintain structured documentation for future use.</li> <li> <strong>Guidance and Support: </strong>Monitor employee needs, propose effective solutions, and manage vendor relationships to ensure smooth relocations.</li> <li> <strong>Strategic Location Planning:</strong> Identify optimal locations for establishing legal entities in Europe, gather employee input, and lead decision-making.</li> <li> <strong>Proactive Problem Solving: </strong>Present actionable, budget-conscious relocation solutions and maintain detailed records in accessible formats.</li> <li> <strong>Candidates support:</strong> Provide advice to candidates on relocation, legalization, and tax issues</li> </ul><h3>Requirements: </h3><p></p><ul><li>Strong work experience in relocation, global mobility in tech companies.&nbsp;</li></ul><ul> <li>You have a strong understanding of tech specialists and their roles, and you excel at building rapport and communicating effectively, even with those who may be more reserved or difficult to engage.You are a relocated person yourself.&nbsp;</li> <li>Experience of living / working in one-two of our locations (Poland, Spain, Serbia).&nbsp;</li> <li>Knowledge of immigration and legal regimes; familiarity with visa, work permits, and immigration processes for different countries, especially the ones where we operate</li> <li>Strong experience in working with and managing relationships with external vendors</li> <li>Exceptional soft skills to make our people feel supported</li> <li>Strong organizational skills to coordinate the logistical aspects of relocation and problem-solving ability</li> <li>Internal communication skills: you can document our relocation cases and communicate changes to our employees&nbsp;</li> <li>Fluent Russian and English is a must. </li> </ul><h3>Benefits: </h3><p><strong>What's in it for you?</strong></p><ul> <li>A focus on professional development; </li> <li>Interesting and challenging projects</li> <li>Flexible working hours</li> <li>Paid one month vacation per year and unlimited sick leave</li> <li>Medical insurance reimbursement</li> <li>Co-working and gym/sports reimbursement</li> <li>The opportunity to receive a reward for the most innovative idea that the company can patent</li> </ul><p><em>By applying for this position, you agree with </em><a href=\"https://cloudlinux.com/privacy-policy\" rel=\"nofollow noreferrer noopener\" class=\"external\"><em>Cloudlinux Privacy Policy</em></a><em> and give us your consent to maintain and process your personal data with this respect. Please read our Privacy Policy for more information.</em></p>","tags":"[\"management\",\"legal\"]","pubDate":"2024-09-16 00:00:00.000","link":"https://apply.workable.com/cloudlinux-1/j/16D810A1D3","savedDate":"2024-09-20 06:43:36.226","slug":"relocation-manager-worldwide-remote-work-anywhere-cloudlinux-8677"}]