[{"id":2432585013,"title":"Head of Marketing","company":"SafetyWing","image":"https://pbs.twimg.com/profile_images/1177267684574208000/54eG3WmW_400x400.jpg","description":"<h2>🧘 What we offer:</h2> <ul><li><!--block-->Fully remote work environment – work from anywhere globally</li><li><!--block-->Competitive compensation and&nbsp; equity compensation</li><li><!--block-->A minimum of four weeks of vacation per year</li><li><!--block-->A personal development budget</li><li><!--block-->Premium health insurance that travels with you</li><li><!--block-->Travel insurance any time you travel outside of your home country</li><li><!--block-->New laptop, office allowance and more!</li><li><!--block-->Multiple team gatherings per year in amazing locations—our previous meetups were in Mexico, Bali, Siglufjörður and Hoi An</li></ul><div><!--block--><br>🚀 We look forward to hearing from you!</div> <div><!--block--><strong>SafetyWing (YC W18)</strong> is seeking a <strong>Head of Marketing </strong>to scale our marketing function. We’re looking for&nbsp; a strategic, creative, hands-on marketing leader who can establish our marketing strategy while building a high performing team. This role combines strategic leadership with tactical execution, and we’re looking for someone equally comfortable crafting strategy and rolling up their sleeves to get things done.</div><div><!--block--><br></div><div><!--block-->At <strong>SafetyWing</strong>, we’re building a global social safety net for remote workers—simple health, insurance, and retirement products designed to replace national welfare systems. Our mission is to remove geographical borders as a barrier to equal opportunity and freedom for everyone. If we succeed, we believe this will be one of the most important tasks of our time.</div> <h2>💻 Your responsibilities will include:</h2>  <ul><li><!--block-->Develop our marketing strategy, focusing on brand establishment, demand generation, and market education across all our products</li><li><!--block-->Formalize&nbsp; our brand voice and positioning, differentiating us from both traditional insurance providers and competing startups</li><li><!--block-->Drive data-driven decision-making by establishing KPIs and analytics frameworks to measure marketing effectiveness across our marketing teams</li><li><!--block-->Collaborate closely with founders and executive team to align marketing strategy with company vision and growth targets</li><li><!--block-->Lead the development and execution of high-impact brand initiatives—set the strategic direction, collaborate with creative team and external agencies, and oversee the successful rollout of campaigns</li><li><!--block-->Serve as liaison between creative and marketing, bridging the gap between growth marketing goals and creative strategies</li><li><!--block-->Drive our content strategy, including steering cohesive messaging across the entire organization</li><li><!--block-->Assess various creative options and prioritize initiatives based on potential impact and alignment with business objectives</li><li><!--block-->Oversee all brand and comms touchpoints—including campaigns, emails, social media, podcasts, media relations, events, newsletters, merchandise, videos, thought leadership and more—to ensure a consistent and compelling brand experience that builds brand love and cultural impact</li></ul> <h2>🧪 We are looking for someone who:</h2> <ul><li><!--block-->Has a strong background leading a marketing team, preferably in both B2C and B2B environments</li><li><!--block-->Has experience in creating strategies and building new categories that resonate with target audiences</li><li><!--block-->Comfortable in data analytics and experience setting team targets and ensuring they’re met</li><li><!--block-->Is a team player who's eager to collaborate across functions to achieve shared goals</li><li><!--block-->Is an innovative thinker, always looking for new ways to engage customers and improve their experience with our products</li><li><!--block-->Has a strong ability to communicate complex ideas simply and attractively</li><li><!--block-->Is driven by data to make decisions and improve product positioning</li></ul><div><!--block--><strong>😀 We like to work with people who:</strong></div><ul><li><!--block-->Want to help build a global social safety net on the Internet</li><li><!--block-->Think for themselves instead of copying others</li><li><!--block-->Are willing to try new things, even with the risk of failure</li><li><!--block-->Are intellectually curious and open to new ideas</li><li><!--block-->Are creative and bold in the face of any problems</li><li><!--block-->Have strong integrity and do the right thing</li></ul>","tags":"[\"b2c\",\"b2b\"]","pubDate":"2025-03-27T06:41:23.166Z","link":"https://safetywing.pinpointhq.com/en/jobs/305372","slug":"head-of-marketing-safetywing-8441"},{"id":4341291490,"title":"Partner Solutions Engineer [IC3]","company":"Sourcegraph","image":"https://avatars.githubusercontent.com/u/3979584?s=200&v=4","description":"&lt;div class=&quot;content-intro&quot;&gt;&lt;h2&gt;&lt;span style=&quot;color: rgb(243, 78, 63);&quot;&gt;&lt;strong&gt;Who we are&lt;/strong&gt;&lt;/span&gt;&lt;/h2&gt;\n&lt;p&gt;Our mission at Sourcegraph is to make it so that &lt;a href=&quot;https://www.notion.so/sourcegraph/Mission-values-e9d37e6b972a4ef395c3076aea2bd07d?pvs=4&quot;&gt;everyone can code&lt;/a&gt;, not just ~0.1% of the population.&amp;nbsp;&lt;/p&gt;\n&lt;p&gt;We are transforming how the world’s most important companies build software by industrializing development with AI. Today, most professional developers spend a disproportionate amount of time understanding code and performing repetitive, low-level tasks—leaving less time for innovation and meaningful impact.&lt;/p&gt;\n&lt;p&gt;We’re changing that. Sourcegraph brings AI-powered search and agents to the enterprise, helping teams automate the mundane and amplify what developers do best— solving hard problems and creating great products.&lt;/p&gt;\n&lt;p&gt;Here’s how we’re making a difference:&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;&lt;strong&gt;Accelerating developers &lt;/strong&gt;with AI agents that deliver insights and precision—enabling 5x faster test creation, 30% increase in merge requests, and saving 20 minutes per developer daily.&lt;/li&gt;\n&lt;li&gt;&lt;strong&gt;Automating repetitive tasks,&lt;/strong&gt; from remediating vulnerabilities (saving teams 1,000+ hours annually) to speeding up migrations that would take years to months.&amp;nbsp;&lt;/li&gt;\n&lt;li&gt;&lt;strong&gt;Enabling innovation&lt;/strong&gt; by addressing complex problems like automated bug triage, vulnerability detection, and AI-driven code reviews seamlessly integrated into workflows.&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;Trusted by 7/10 top software companies by market cap, 4/6 top US banks and many of the companies leading global innovation, like Stripe, Indeed, Tesla, and 1Password, and with $225M in funding from investors like &lt;a href=&quot;https://techcrunch.com/2021/07/13/sourcegraph-raises-125m-series-d-on-2-6b-valuation-for-universal-code-search-tool/&quot;&gt;a16z&lt;/a&gt;, &lt;a href=&quot;https://about.sourcegraph.com/blog/series-c-with-sequoia/&quot;&gt;Sequoia&lt;/a&gt;, and &lt;a href=&quot;https://www.redpoint.com/companies/sourcegraph/&quot;&gt;Redpoint&lt;/a&gt;, we are building the tools that will define the next era of enterprise software development.&lt;/p&gt;\n&lt;p&gt;If you’re passionate about solving the hardest problems in software and shaping the future of technology, join us. Let’s build something extraordinary together.&lt;/p&gt;&lt;/div&gt;&lt;h2&gt;&lt;span style=&quot;color: rgb(243, 78, 63);&quot;&gt;&lt;strong&gt;Hours &amp;amp; location&lt;/strong&gt;&lt;/span&gt;&lt;/h2&gt;\n&lt;p&gt;🌎 While we hire &lt;a href=&quot;https://sourcegraph.notion.site/How-we-engage-talent-outside-of-the-US-218f7193695a46cbb1ef39ef9c1f72d4&quot;&gt;almost anywhere&lt;/a&gt; in the world, we have a preference for someone to reside in the San Francisco Bay Area for this role for proximity to our partners and the people you will work with the most. In San Francisco, we would ask that you work from our San Francisco office at least three days per week. &amp;nbsp;However, if you feel qualified, we welcome you to apply regardless of location. No matter what, working hours must overlap with the Pacific time zone for at least 30 hours/week.&lt;/p&gt;\n&lt;p&gt;Note that flexibility is required to accommodate partners located in different time zones around the world. &amp;nbsp;Moderate travel is required for both internal (Sourcegraph facing) and external (partner facing) meetings and conferences.&amp;nbsp;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Preferred location:&amp;nbsp;&lt;/strong&gt;&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;San Francisco, CA&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;We do not subscribe to “I do my best work when I work 40 hours a week.” &amp;nbsp;People we hire at Sourcegraph believe that building outstanding things means working very hard — smarter and more hours than the competition.&lt;/p&gt;\n&lt;h2&gt;&lt;span style=&quot;color: rgb(243, 78, 63);&quot;&gt;&lt;strong&gt;Why this job is exciting&lt;/strong&gt;&lt;/span&gt;&lt;/h2&gt;\n&lt;p&gt;As a Partner Solution Engineer (pre-sales), you will play a key role in developing Sourcegraph’s partner ecosystem. &amp;nbsp;Partners are key to help extend Sourcegraph’s brand, to source new opportunities, to support the closing of business, and to drive customer success. &amp;nbsp;This is a broadly cross functional role, which requires interactions with a variety of different stakeholders within Sourcegraph and our partners. &amp;nbsp;The ideal candidate will thrive working in a job with a wide variety of responsibilities and working with many different types of organizations and people.&lt;/p&gt;\n&lt;p&gt;The Partner Engineer will collaborate with the partner team to find, develop, activate, and manage these partnership relationships. &amp;nbsp;Additionally, the partner engineer will support our largest and most complex prospects and deployments, where there are sophisticated enterprise requirements which will exercise our product and novel ways which almost always leads to key organizational learnings and meaningful product updates. &amp;nbsp;The Partner Engineer will need to have strong intuition and judgment on how to best prioritize partners and activities within partner relationships. &amp;nbsp;&lt;/p&gt;\n&lt;p&gt;You will work with the following types of partnerships:&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;Channel partnerships - you will help to evangelize Sourcegraph in order to recruit relevant professional services and reseller firms worldwide, you will train, enable, and support these partners as they position Sourcegraph into their customers and support our implementations and customer deployments&lt;/li&gt;\n&lt;li&gt;Software partnerships and technology alliances - you will help potential integration partners to understand Sourcegraph, will help to understand and coach them in building integrations (or build or help our engineering team to build integrations), will enable their teams to understand where and how to position to Sourcegraph, and will support the success of joint prospects and customers&lt;/li&gt;\n&lt;li&gt;Cloud partnerships - you will develop relationships with our key Cloud partners. &amp;nbsp;This includes staying current on their offerings and where we can collaborate with them, developing relationships with their key and relevant leaders, working through the technical aspects of their partner programs, and enabling their field teams. &amp;nbsp;&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;📅 Within one month, you will…&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;Learn about our products, our value propositions, our partners, our customers, our team, and our processes.&lt;/li&gt;\n&lt;li&gt;Set up your own fully configured sandbox instance&lt;/li&gt;\n&lt;li&gt;Start building a trusting relationship with your peers on Sales, Value Engineering, Post-sales Success (Technical Advisory), Product, Engineering, and Support teams&lt;/li&gt;\n&lt;li&gt;Join customer and prospect calls with some of our largest customers to understand their needs, how we communicate the value of Sourcegraph, and how we deliver positive impact to our customers’ business&lt;/li&gt;\n&lt;li&gt;Get demo certified&lt;/li&gt;\n&lt;li&gt;Get introduced to a set of key partners and join regular partner calls&lt;/li&gt;\n&lt;li&gt;Conduct ‘first calls’ with a partner to introduce them to Sourcegraph’s products&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;📅 Within three months, you will…&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;Continue to take product and technical ownership of new and existing partner relationships&lt;/li&gt;\n&lt;li&gt;Autonomously run both demo and training sessions for partners&lt;/li&gt;\n&lt;li&gt;Effectively address the majority of partner questions; develop internal relationships to answer others&lt;/li&gt;\n&lt;li&gt;Develop a point of view on how different types of partners can uniquely leverage a Sourcegraph partnership (and product) to their benefit&lt;/li&gt;\n&lt;li&gt;Advocate for partners internally and externally. &amp;nbsp;Advocate to include partners in sales cycles and engagements. &amp;nbsp;Advocate for features that partners will find useful&lt;/li&gt;\n&lt;li&gt;Support the development and evolution of Sourcegraph’s partner program&lt;/li&gt;\n&lt;li&gt;Contribute to selected account teams managing large and sophisticated POC and customer relationships&amp;nbsp;&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;📅 Within six months, you will…&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;Establish yourself as a thought leader and evangelist by using your insights to teach partners and prospective partners new and better ways to get value from Sourcegraph&lt;/li&gt;\n&lt;li&gt;Mentor Sourcegraph teammates on how they can best leverage the partner ecosystem&lt;/li&gt;\n&lt;li&gt;Join and contribute to teams managing large and sophisticated prospect and customer deployments&amp;nbsp;&lt;/li&gt;\n&lt;/ul&gt;\n&lt;h2&gt;&lt;span style=&quot;color: rgb(243, 78, 63);&quot;&gt;&lt;strong&gt;About you&lt;/strong&gt;&lt;/span&gt;&lt;/h2&gt;\n&lt;p&gt;You are an enthusiastic, proactive, driven, and results-oriented Partner Solutions Engineer who shares&lt;a href=&quot;https://about.sourcegraph.com/company/values&quot;&gt; our values&lt;/a&gt; and has a passion for getting prospective customers to that a-ha moment with Sourcegraph and then helping them to build meaningful and mutually beneficial partnerships!&amp;nbsp;&lt;/p&gt;\n&lt;p&gt;🔍 The ideal candidate:&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;You have at least 5 years experience in a relevant role such as Sales Engineering, Solutions Engineering, Professional Services, or Solution Architecture across a technical product.&lt;/li&gt;\n&lt;li&gt;You have experience selling Enterprise software solutions and have gone through the lived experience of the Enterprise process selling motions.&lt;/li&gt;\n&lt;li&gt;You have an innate curiosity of getting to the root of customer problems and understanding their motivations. You have a strong interest in how partners work together for the mutual benefit of each party - and for the customer!&lt;/li&gt;\n&lt;li&gt;You’re excited about the prospect of being directly involved in the advent of generative AI!&lt;/li&gt;\n&lt;li&gt;You are well versed in back end infrastructure architecture.&lt;/li&gt;\n&lt;li&gt;You are very technically inclined and have a propensity to code and or hack code. You have experience writing code in one of the following (JavaScript, Python, Java, Go).&lt;/li&gt;\n&lt;li&gt;Strong verbal and written communication skills, specifically across technical presentations and product demonstrations; ability to influence and excite a technical audience.&lt;/li&gt;\n&lt;li&gt;Either through direct experience or deep understanding, working knowledge of the end-to-end software development lifecycle and concepts such as continuous integration and continuous deployment. Note: You do not need to be a software engineer to be successful in this role!&lt;/li&gt;\n&lt;li&gt;You enjoy building tools, templates, and technical enablement collateral.&lt;/li&gt;\n&lt;li&gt;You have an organized approach to work, with demonstrated ability to proactively manage a set of concurrent relationships, to make difficult prioritization decisions, and to use data to guide decision-making.&lt;/li&gt;\n&lt;li&gt;You like diving in to learn a new skill to solve a problem that benefits or unblocks a partnership.&lt;/li&gt;\n&lt;li&gt;You work well independently. &amp;nbsp;You can efficiently shift between demos and presentations, supporting partners, developing reusable assets, and jumping into sophisticated POC’s and / or deployments&lt;/li&gt;\n&lt;/ul&gt;\n&lt;h2&gt;&lt;span style=&quot;color: rgb(243, 78, 63);&quot;&gt;&lt;strong&gt;Level&lt;/strong&gt;&lt;/span&gt;&lt;/h2&gt;\n&lt;p&gt;📊 This job is an IC3 position, depending on previous experience and role scope. You can read more about&amp;nbsp;&lt;a href=&quot;https://www.notion.so/sourcegraph/Leveling-Guide-0e1b5c76ada64b9caac387f8b7c4fc66&quot;&gt;our job leveling philosophy&lt;/a&gt; in our Handbook.&lt;/p&gt;\n&lt;h2&gt;&lt;span style=&quot;color: rgb(243, 78, 63);&quot;&gt;&lt;strong&gt;Compensation&lt;/strong&gt;&lt;/span&gt;&lt;/h2&gt;\n&lt;p&gt;&lt;strong&gt;💸 We pay you an above-average salary&lt;/strong&gt; because we want to hire the best people who are fully focused on helping Sourcegraph succeed, not worried about paying bills. As an &lt;a href=&quot;https://sourcegraph.notion.site/Mission-values-e9d37e6b972a4ef395c3076aea2bd07d&quot;&gt;open and transparent&lt;/a&gt; company that values &lt;a href=&quot;https://www.notion.so/sourcegraph/Compensation-Pay-Transparency-at-Sourcegraph-d58d0774f51b4b489d41c3628d30ff8d?pvs=4&quot;&gt;competitive compensation&lt;/a&gt;, our compensation ranges are visible to every single Sourcegraph teammate.&lt;/p&gt;\n&lt;p&gt;Your salary is determined by your pay band for the IC3 job level. For determining pay bands, we use a number of market and data-driven salary sources, along with your location zone, and target the high-end of the range to ensure we’re always paying above market regardless of where you live in the world. Both U.S. and international locations are divided into one of four zones, determined by the cost of labor index for each area. The salary for a successful candidate will be based on level, job-related skills, experience, qualifications, and location zone. Please note that the salaries below may be adjusted in the future.&lt;/p&gt;\n&lt;p&gt;💰 The target compensation for this role is based on the IC3 pay band for your zone. The IC3 pay band for this role is&amp;nbsp;$150,000 USD base + $50,000 USD variable ($200,000 USD on-target-earnings).&lt;/p&gt;\n&lt;p&gt;📈 In addition to our cash compensation, we offer equity (because when we succeed as a company, we want you to succeed, too) and generous &lt;a href=&quot;https://sourcegraph.notion.site/Benefits-Perks-dd1da4b6b3a64780abed010a144d34ba&quot;&gt;perks &amp;amp; benefits&lt;/a&gt;.&lt;/p&gt;\n&lt;h2&gt;&lt;span style=&quot;color: rgb(243, 78, 63);&quot;&gt;&lt;strong&gt;Interview process&lt;/strong&gt;&lt;/span&gt;&lt;/h2&gt;\n&lt;p&gt;&lt;em&gt;Below is the interview process you can expect for this role (you can read more about &lt;/em&gt;&lt;a href=&quot;https://sourcegraph.notion.site/Types-of-interviews-f279f080583d49ee9f2c60e30c8cb1f7&quot;&gt;&lt;em&gt;the types of interviews&lt;/em&gt;&lt;/a&gt;&lt;em&gt; in our Handbook). It may look like a lot of steps, but rest assured that we move quickly and the steps are designed to help you get the information needed to determine if we’re the right fit for you… Interviewing is a two-way street, after all!&amp;nbsp;&lt;/em&gt;&lt;/p&gt;\n&lt;p&gt;We expect the interview process to take 3.25 hours in total.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;👋 Introduction Stage&lt;/strong&gt; - we have initial conversations to get to know you better…&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;[30m]&amp;nbsp;&lt;a href=&quot;https://www.notion.so/sourcegraph/Types-of-interviews-sample-questions-f279f080583d49ee9f2c60e30c8cb1f7?pvs=4#99be5ff628b2414194a0ba79d9f25f13&quot;&gt;Recruiter Screen&lt;/a&gt;&lt;/li&gt;\n&lt;li&gt;[45m] &lt;a href=&quot;https://www.notion.so/sourcegraph/Types-of-interviews-sample-questions-f279f080583d49ee9f2c60e30c8cb1f7?pvs=4#1919882c0cf147c487eb1df40db8a694&quot;&gt;Hiring Manager Screen&lt;/a&gt; /&amp;nbsp;&lt;a href=&quot;https://www.notion.so/sourcegraph/Types-of-interviews-sample-questions-f279f080583d49ee9f2c60e30c8cb1f7?pvs=4#c678a2a86e0e47e4958507e869bf7ded&quot;&gt;Resume Deep Dive&lt;/a&gt; with Hiring Manager&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;&lt;strong&gt;🧑‍💻 Team Interview Stage&lt;/strong&gt; - we then delve into your experience in more depth and introduce you to members of the team, including cross-functional partners…&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;[30m]&amp;nbsp;&lt;a href=&quot;https://www.notion.so/sourcegraph/Types-of-interviews-sample-questions-f279f080583d49ee9f2c60e30c8cb1f7?pvs=4#cb00697e95304550a146c32563c0255d&quot;&gt;Cross-functional&lt;/a&gt; /&amp;nbsp;&lt;a href=&quot;https://www.notion.so/sourcegraph/Types-of-interviews-sample-questions-f279f080583d49ee9f2c60e30c8cb1f7?pvs=4#88b9f826dee04ef98afc2aeec35b877a&quot;&gt;Peer&lt;/a&gt; with an Account Executive&lt;/li&gt;\n&lt;li&gt;[45m] &lt;a href=&quot;https://www.notion.so/sourcegraph/Technical-Success-interview-process-902069565e1147b89ac98054179eb676?pvs=4#5a1021deb9b140258e35bbdd345f7754&quot;&gt;Live Panel Demo and Q&amp;amp;A&lt;/a&gt; with Hiring Manager, 1 Solutions Engineer &amp;amp; 1 AE&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;&lt;strong&gt;🎉 Final Interview Stage &lt;/strong&gt;- we move you to our final round, where you gain a better understanding of our business and values holistically…&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;[30m]&amp;nbsp;&lt;a href=&quot;https://www.notion.so/sourcegraph/Types-of-interviews-sample-questions-f279f080583d49ee9f2c60e30c8cb1f7?pvs=4#e3a04291743048df87541a88aa8199dd&quot;&gt;Values&lt;/a&gt;&lt;/li&gt;\n&lt;li&gt;[15m] &lt;a href=&quot;https://www.notion.so/sourcegraph/How-to-work-with-Quinn-Slack-CEO-807673e0864d473f959cc4efd9642a5a?pvs=4#6f185c0e2011411eac5be9c675f9056c&quot;&gt;Leadership&lt;/a&gt; with co-founder&amp;nbsp;&lt;/li&gt;\n&lt;li&gt;We check references and conduct your background check&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;Please note - you are welcome to request additional conversations with anyone you would like to meet, but didn’t get to meet during the interview process.&lt;/p&gt;&lt;div class=&quot;content-conclusion&quot;&gt;&lt;h2&gt;&lt;span style=&quot;color: rgb(243, 78, 63);&quot;&gt;&lt;strong&gt;Learn more about us&lt;/strong&gt;&lt;/span&gt;&lt;/h2&gt;\n&lt;p&gt;You can learn more about what it is like to work at Sourcegraph by reading &lt;a href=&quot;https://sourcegraph.notion.site/d7614e3e9dc04c09ac2d42d57f1816e6?v=2a6d426dbae14390b155120b0c029ce0&quot;&gt;our handbook&lt;/a&gt;.&lt;/p&gt;\n&lt;p&gt;We are an ambitious team who are collectively working hard to build the most influential company in the world.&amp;nbsp; You can read more about our &lt;a href=&quot;https://sourcegraph.notion.site/What-it-s-like-working-at-Sourcegraph-119a8e11265880b18911eee4d9b7c460#119a8e1126588062b935fc66104b6115&quot;&gt;culture&lt;/a&gt;, &lt;a href=&quot;https://sourcegraph.notion.site/Compensation-Pay-Transparency-at-Sourcegraph-d58d0774f51b4b489d41c3628d30ff8d?pvs=74&quot;&gt;competitive compensation&lt;/a&gt; and &lt;a href=&quot;https://sourcegraph.notion.site/Benefits-Perks-dd1da4b6b3a64780abed010a144d34ba?pvs=74&quot;&gt;benefits&lt;/a&gt; here.&lt;/p&gt;\n&lt;p&gt;Sourcegraph is an equal opportunity workplace; we welcome people from all backgrounds.&amp;nbsp;&lt;/p&gt;\n&lt;p&gt;&lt;em&gt;Sourcegraph participates in &lt;/em&gt;&lt;a href=&quot;https://sourcegraph.notion.site/E-Verify-2ab3286dde3446d6bac2898c83610107&quot;&gt;&lt;em&gt;E-Verify&lt;/em&gt;&lt;/a&gt;&lt;em&gt; for U.S. Employees. &lt;/em&gt;&lt;/p&gt;&lt;/div&gt;","tags":"[\"javascript\",\"engineering\"]","pubDate":"2025-03-27T01:46:36.000Z","link":"https://job-boards.greenhouse.io/sourcegraph91/jobs/5484913004","slug":"partner-solutions-engineer-ic3-sourcegraph-6161"},{"id":3532237831,"title":"Senior Product Manager - Engagements","company":"Aiwyn","image":"https://media.licdn.com/dms/image/v2/D4E0BAQEvDOFt9VDmfg/company-logo_200_200/company-logo_200_200/0/1714673337921/aiwyn_logo?e=1743033600&v=beta&t=0yqXd-p9YeUPxD_oaEkvrGENa6XLG5S4Q4dDXCettEY","description":"<div><b>Who is Aiwyn and what do we do?</b></div><div><br></div><div>Aiwyn is the fastest-growing software company serving the accounting profession.&nbsp;Founded in 2020, we now work with 100+ of the largest CPA firms in the world.&nbsp;Our “Job to be done”: speed up cash flow, save Partner time, &amp; deliver best-in-class client experiences. We do this by automating day-to-day firm operations with our Practice Automation solutions. Aiwyn is led by serial entrepreneurs with multiple exits and funded by a Top 10 fintech VC.</div><div><br></div><div>To learn more, visit our <b><a class=\"postings-link\" href=\"https://aiwyn.ai/\">website</a></b></div><div><br></div><div><b>Who Are You? </b></div><div><br></div><div>As a product manager, you embrace the inherent challenges of the role. You rely on authenticity, vulnerability, and truth-telling to guide your teams towards meaningful results. You seek to deeply understand the markets you serve, sharing your insights with your team and collaboratively developing solutions that make a difference. You acknowledge the difficulty of this work and take ownership when mistakes occur, always striving to improve. You understand that a strong, empowered team is crucial to delivering impactful results, and you are committed to fostering this environment. The challenges energize you, and despite the hard work, you look forward to this opportunity.</div><div><b>Who is Aiwyn and what do we do?</b></div><div><br></div><div>Aiwyn is the fastest-growing software company serving the accounting profession.&nbsp;Founded in 2020, we now work with 100+ of the largest CPA firms in the world.&nbsp;Our “Job to be done”: speed up cash flow, save Partner time, &amp; deliver best-in-class client experiences. We do this by automating day-to-day firm operations with our Practice Automation solutions. Aiwyn is led by serial entrepreneurs with multiple exits and funded by a Top 10 fintech VC.</div><div><br></div><div>To learn more, visit our <b><a href=\"https://aiwyn.ai/\" class=\"postings-link\">website</a></b></div><div><br></div><div><b>Who Are You? </b></div><div><br></div><div>As a product manager, you embrace the inherent challenges of the role. You rely on authenticity, vulnerability, and truth-telling to guide your teams towards meaningful results. You seek to deeply understand the markets you serve, sharing your insights with your team and collaboratively developing solutions that make a difference. You acknowledge the difficulty of this work and take ownership when mistakes occur, always striving to improve. You understand that a strong, empowered team is crucial to delivering impactful results, and you are committed to fostering this environment. The challenges energize you, and despite the hard work, you look forward to this opportunity.</div><h3>Key Responsibilities:</h3><li><b>Engagement Workflow Optimization:</b> Design and refine engagement workflows to streamline processes, improve user efficiency, and deliver maximum value to practices.</li><li><b>Client Communication Enhancements:</b> Develop tools and features that enhance communication between practices and their clients, ensuring clear and effective interactions.</li><li><b>Engagement Performance Insights:</b> Create systems to track and report engagement performance metrics, offering actionable insights for practices to optimize their operations.</li><li><b>Compliance and Security:</b> Ensure all engagement-related features comply with industry regulations and maintain the highest security standards for sensitive client data.</li><li><b>Integration Strategy:</b> Build seamless integrations with other practice management tools or systems to enhance engagement capabilities and user workflows.</li><li><b>Scalable Engagement Features:</b> Develop scalable engagement-related functionalities that support the growth of practices while maintaining reliability and quality.</li><li><b>Industry Research:</b> Stay ahead of industry trends and develop a profound understanding of customer needs, pain points, and feedback to identify and seize growth opportunities.</li><li><b>Competitive Analysis:</b> Thoroughly analyze the competitive landscape to uncover strengths, weaknesses, opportunities, and threats, informing strategic decisions.</li><li><b>Product Roadmap:</b> Collaborate with the VP of Product Management to craft and execute a visionary product roadmap. Leverage the power of Jira Product Discovery (JPD) to manage your product work and to provide clear roadmap visibility to the business.</li><li><b>Product Design Collaboration:</b> Partner with product designers to create intuitive, user-friendly experiences that align with product outcomes.</li><li><b>Requirement Management:</b> Translate complex requirements into actionable tasks for the engineering team, ensuring clarity and focus.</li><li><b>Cross-Functional Collaboration:</b> Foster seamless collaboration with cross-functional teams and stakeholders to align on product initiatives and orchestrate successful go-to-market efforts.</li><h3>Qualifications:</h3><li>5+ years of experience in product management, with a track record of leading products from ideation to successful launch.</li><li>A profound understanding of Contract Lifecycle Management (CLM) software or the ability to quickly adapt and learn.</li><li>Familiarity with SVPG teachings and a passion for working in empowered, collaborative teams.</li><li>Experience leveraging AI and automation to enhance customer experiences and drive innovation.</li><li>Proficient with product management tools like Productboard, Miro, Jira, and Pendo, and AI tools like ChatGPT.</li><li>An eye for market-leading experiential design, with experience in creating journey maps or high-level wireframes.</li><li>Expertise in the accounting or financial services industry, with a deep understanding of its challenges and opportunities.</li><li>Proven experience taking a team or company from 0-1, embracing the associated challenges and triumphs.</li><h3>Benefits and Perks:</h3><li>The big-picture value proposition of this role is simple: join us, and you'll be paid competitively to have freedom in solving worthwhile, challenging problems alongside other A-players at a fast growing SaaS startup led by an experienced and successful co-founding team with industry experience. </li><div><br></div><div>Other benefits include:</div><li><b>Adventure travel stipend</b> - you receive a $1,000 travel reimbursement on your work anniversary each year. We encourage our team to recharge and explore the world beyond their home office walls.</li><li><b>Remote, work-from-anywhere culture</b></li><li><b>Flexible PTO</b></li><li><b>World Class health benefits</b> - we believe in fostering flourishing teams by providing benefits that go beyond the usual standards - Health, vision, dental, HSA/FSA, and mental health support.</li><li><b>Stock options</b> - every Full Time Employee has ownership in Aiwyn's future and success.</li><li><b>401(k) matching</b></li><h3>Our Values:</h3><li><b>Trust</b> - We champion transparency, welcome differing perspectives, uphold accountability, and trust that others have good intentions</li><li><b>Courage</b> - We have the courage to take calculated risks and embrace change, knowing what worked in the past won’t always work in the future</li><li><b>Impact</b> - Rooted in determination and innovation, we chase extraordinary outcomes and impactful results</li><li><b>Relentlessness</b> - We approach challenges with an unwavering resolve, never settling for mediocrity, and always striving to surpass expectations</li><h3>Learn more about Aiwyn:</h3><li><a class=\"postings-link\" href=\"https://www.aiwyn.ai/about\"><b>About us</b></a></li><li><a class=\"postings-link\" href=\"https://www.aiwyn.ai/why-aiwyn\"><b>Why Aiwyn</b></a></li><li><a class=\"postings-link\" href=\"https://www.youtube.com/@AiwynAI\"><b>YouTube page</b></a></li><div>Aiwyn is an equal opportunity employer. All qualified applicants will receive consideration for employment without regard to age, ancestry, color, family or medical care leave, gender identity or expression, genetic information, marital status, medical condition, national origin, physical or mental disability, political affiliation, protected veteran status, race, religion, sex (including pregnancy), sexual orientation, or any other characteristic protected by applicable laws, regulations and ordinances.</div><div><br></div><div>Candidate information will be treated in accordance with our CCPA privacy notice which can be found here: <a class=\"postings-link\" href=\"https://www.aiwyn.ai/ccpa\">https://www.aiwyn.ai/ccpa</a></div>","tags":"[\"management\",\"engineering\",\"aws\"]","pubDate":"2025-03-26T23:28:34.054Z","link":"https://jobs.lever.co/aiwyn/3f975fbb-9ba2-483b-a2bf-306db522f34b","slug":"senior-product-manager-engagements-aiwyn-6888"},{"id":8197090050,"title":"Senior Manager, Data Engineering","company":"HappyCo","image":"https://avatars.githubusercontent.com/u/1021150?s=200&v=4","description":"<div><b style=\"font-size: 11pt\">HappyCo is a company where people can grow their careers and work with like minded people, with no egos or politics. HappyCo is values driven and offers a flexible, supportive culture. Join HappyCo and </b><a class=\"postings-link\" href=\"https://happy.co/media/make-work-happy\"><b style=\"font-size: 11pt\">Make Work Happy</b></a><b style=\"font-size: 11pt\">!</b></div><div><br></div><div><span style=\"font-size: 16px\">We’re looking for an experienced (</span><b style=\"font-size: 16px\">Senior) Manager of Data Engineering</b><span style=\"font-size: 16px\"> to join our team.</span></div><div><span style=\"font-size: 16px\">&nbsp;</span></div><div><span style=\"font-size: 16px\">HappyCo is seeking an experienced and strategic Senior Manager of Data Engineering to drive the development and execution of our data initiatives, ensuring alignment with the company’s goals and product roadmap. This role will play a critical part in shaping our data architecture, warehousing, analytics, and reporting to enable data-driven decision making across the organization.</span></div><div><br></div><div><span style=\"font-size: 16px\">As a key collaborator, the Senior Manager of Data Engineering will work across departments to understand business data needs, developing and maintaining scalable data infrastructure to support storage, reporting, and security. This role will oversee ETL/ELT pipeline development, implement data governance best practices, and ensure cost-effective utilization of cloud services and tooling. </span></div><div><br></div><div><span style=\"font-size: 16px\">Additionally, this person will lead a small but impactful team, providing mentorship and technical guidance while fostering a culture of collaboration and continuous improvement.</span></div><div><br></div><div><span style=\"font-size: 16px\">Core Responsibilities:</span></div><div><b style=\"font-size: 16px\">&nbsp;</b></div><div><span style=\"font-size: 16px\">●&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; Support and execute the data strategy to align with company goals and the product roadmap</span></div><div><span style=\"font-size: 16px\">●&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; Oversee technical execution for data-related initiatives, including data architecture, warehousing, analytics, and reporting</span></div><div><span style=\"font-size: 16px\">●&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; Collaborate with stakeholders across departments to understand and address data and insight needs</span></div><div><span style=\"font-size: 16px\">●&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; Develop and maintain scalable and secure data infrastructure to support storage, reporting, and security requirements</span></div><div><span style=\"font-size: 16px\">●&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; Implement best practices for building and maintaining ETL/ELT pipelines and ensure effective data governance</span></div><div><span style=\"font-size: 16px\">●&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; Lead and mentor a small team of data engineers, fostering professional growth and collaboration</span></div><div><span style=\"font-size: 16px\">●&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; Monitor and optimize the cost and performance of data products, cloud services, and third-party tooling</span></div><div><span style=\"font-size: 16px\">We’re looking for an experienced (</span><b style=\"font-size: 16px\">Senior) Manager of Data Engineering</b><span style=\"font-size: 16px\"> to join our team.</span></div><div><span style=\"font-size: 16px\">&nbsp;</span></div><div><span style=\"font-size: 16px\">HappyCo is seeking an experienced and strategic Senior Manager of Data Engineering to drive the development and execution of our data initiatives, ensuring alignment with the company’s goals and product roadmap. This role will play a critical part in shaping our data architecture, warehousing, analytics, and reporting to enable data-driven decision making across the organization.</span></div><div><br></div><div><span style=\"font-size: 16px\">As a key collaborator, the Senior Manager of Data Engineering will work across departments to understand business data needs, developing and maintaining scalable data infrastructure to support storage, reporting, and security. This role will oversee ETL/ELT pipeline development, implement data governance best practices, and ensure cost-effective utilization of cloud services and tooling. </span></div><div><br></div><div><span style=\"font-size: 16px\">Additionally, this person will lead a small but impactful team, providing mentorship and technical guidance while fostering a culture of collaboration and continuous improvement.</span></div><div><br></div><div><span style=\"font-size: 16px\">Core Responsibilities:</span></div><div><b style=\"font-size: 16px\">&nbsp;</b></div><div><span style=\"font-size: 16px\">●&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; Support and execute the data strategy to align with company goals and the product roadmap</span></div><div><span style=\"font-size: 16px\">●&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; Oversee technical execution for data-related initiatives, including data architecture, warehousing, analytics, and reporting</span></div><div><span style=\"font-size: 16px\">●&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; Collaborate with stakeholders across departments to understand and address data and insight needs</span></div><div><span style=\"font-size: 16px\">●&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; Develop and maintain scalable and secure data infrastructure to support storage, reporting, and security requirements</span></div><div><span style=\"font-size: 16px\">●&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; Implement best practices for building and maintaining ETL/ELT pipelines and ensure effective data governance</span></div><div><span style=\"font-size: 16px\">●&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; Lead and mentor a small team of data engineers, fostering professional growth and collaboration</span></div><div><span style=\"font-size: 16px\">●&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; Monitor and optimize the cost and performance of data products, cloud services, and third-party tooling</span></div><h3>What we think you need to be successful</h3><li>&nbsp;5+ years of experience in data engineering, data warehousing, or enterprise reporting, with a strong track record of executing data strategies</li><li> Hands-on experience with BI and data warehouse tools, databases, and data modeling (relational, document-based, SQL, NoSQL)</li><li>&nbsp;Strong expertise in data modeling techniques and strategies to ensure efficient, scalable data structures</li><li>&nbsp;&nbsp;Proficiency in programming and scripting (Python, SQL, Bash preferred) for data pipeline development and automation</li><li>&nbsp;&nbsp;Experience working with cloud platforms such as AWS, Azure, or GCP (preferred)</li><li>&nbsp;&nbsp;Proven leadership skills, with experience managing and mentoring junior data engineers and/or analysts</li><li>&nbsp;Process improvement mindset, identifying and implementing efficiencies in data workflows and infrastructure</li><li>&nbsp;Excellent communication and collaboration skills, with the ability to translate complex technical concepts into business-friendly language</li><h3>Keys to happiness at HappyCo</h3><li>&nbsp;&nbsp;&nbsp;&nbsp; Pushing forward in ambiguity while striving for clarity</li><li>&nbsp;&nbsp;&nbsp;&nbsp; Prioritizing for sustained impact vs helping in the moment</li><li>&nbsp;&nbsp;&nbsp;&nbsp; Empowering teams instead of enforcing standards</li><li>&nbsp;&nbsp;&nbsp;&nbsp; Leveraging technology to serve humanity in a way that is accessible</li><li>&nbsp;&nbsp;&nbsp;&nbsp; Being a proactive contributor to the design and research team culture, with a strong growth mindset</li><li>&nbsp;&nbsp;&nbsp;&nbsp; Experience and understanding of early-stage startups and challenges </li><li>&nbsp;&nbsp;&nbsp;&nbsp; Experience within the multifamily residential property industry</li><li>&nbsp;&nbsp;&nbsp;&nbsp; Previous research experience in an Enterprise B2B SaaS context where    complex workflows and systems have been tackled</li><div><br></div><h3>Technologies Used</h3><li>Cloud Platforms &amp; Services: Google Cloud Platform (GCP) - including BigQuery, Cloud Storage, Datastream, Cloud SQL, Pub/Sub, Cloud Functions, and other key GCP services for scalable data infrastructure</li><li>&nbsp;Data Engineering &amp; Processing: Databricks</li><li> Databases &amp; Storage: PostgreSQL, MySQL, and NoSQL solutions (such as Bigtable, MongDB, DocumentDB)</li><li>AI &amp; Machine Learning: GCP Vertex AI, GCP Gemini AI, and OpenAI models for predictive analytics, automation, and data-driven decision-making</li><li>Business Intelligence &amp; Visualization: Looker &amp; LookML, plus experience with complementary BI tools like Tableau or PowerBI for enhanced reporting and analytics</li><div><b style=\"font-size: 11pt\">About HappyCo</b>&nbsp;</div><div>Founded in 2011, HappyCo (<a class=\"postings-link\" href=\"http://happy.co\">happy.co</a>) builds mobile and cloud solutions to enable real-time property data. Our flagship product suite 'Happy Property’ has <span style=\"font-size: 14.6667px;\">more than 5 million units on its platform.</span>&nbsp;</div><div><br></div><div>We’re everyday people with a shared purpose — improving the lives of others. Our team is made up of thinkers, talkers, planners, makers, builders and everything in between. Together, we’re turning our passions into happier communities!&nbsp;&nbsp;</div><div><br></div><div>When customers use our software, their communities get stronger. Our tools empower everyone in multifamily property management to improve their operations and maximize returns, which means they’re building better experiences for their residents. Learn more about our <a class=\"postings-link\" href=\"https://happyco-inc.wistia.com/medias/1va4woy4m3\">Product Vision</a> here!</div><div><br></div><div><b style=\"font-size: 11pt\">Our HappyCo Culture</b></div><div>HappyCo strives to build better communities. So naturally, we are dedicated to making our own community an enjoyable place that allows us do our best work. We’re devoted to building an inclusive, supportive culture that empowers each HappyCo’er to succeed and grow. To learn more about our culture, check out our <a class=\"postings-link\" href=\"https://happy.co/company/careers\">careers page</a>!&nbsp;</div><div><br></div><div><b>We Offer:</b></div><div>- Work from anywhere supported by a flexible company culture</div><div>- Opportunity to work for one of the fastest growing technology companies in the PropTech industry</div><div>- Unlimited vacation time</div><div>- Generous paid parental leave</div><div>- Competitive and equitable pay, including stock options</div><div>- Monthly stipends to support Wellness and Home Office expenses</div><div><br></div><div>Find out more about our <a class=\"postings-link\" href=\"https://happy.co/company/careers/employee-benefits-usa\">US Employee Benefits</a> here!</div><div><br></div><div><i style=\"font-size: 11pt\">We believe in supporting people to do their best work and thrive, and building a diverse, equitable, and inclusive company is core to our mission. Our goal is to ensure that HappyCo upholds an inclusive environment where all people feel that they are equally respected and valued, whether they are applying for an open position or working at the company. We welcome applicants of any educational background, gender identity and expression, sexual orientation, religion, ethnicity, age, citizenship, socioeconomic status, disability, and veteran status. HappyCo is also committed to providing reasonable accommodations for qualified individuals with disabilities and disabled veterans in our job application procedures.</i></div><div><br></div><div><i style=\"font-size: 11pt\">A note to Recruitment Agencies: Please don’t reach out to us about our roles -- we’ve got it covered. We don’t accept unsolicited agency resumes and HappyCo is not responsible for any fees related to unsolicited resumes.</i></div><div><b style=\"font-size: 11pt\">HappyCo is a company where people can grow their careers and work with like minded people, with no egos or politics. HappyCo is values driven and offers a flexible, supportive culture. Join HappyCo and </b><a href=\"https://happy.co/media/make-work-happy\" class=\"postings-link\"><b style=\"font-size: 11pt\">Make Work Happy</b></a><b style=\"font-size: 11pt\">!</b></div>","tags":"[\"postgres\",\"management\",\"engineering\",\"b2b\",\"database\",\"mysql\",\"aws\"]","pubDate":"2025-03-26T19:24:33.626Z","link":"https://jobs.lever.co/happyco/fbb47eeb-1daa-496a-81ca-0e181a660a01","slug":"senior-manager-data-engineering-happyco-4548"},{"id":6772180893,"title":"SEO Freelancer ","company":"OneLocal","image":"https://photos.wellfound.com/startups/i/257661-3abe9f68928f2e0407dca967aca86e67-medium_jpg.jpg","description":"&lt;p&gt;OneLocal is looking to hire &lt;strong&gt;SEO freelancers &lt;/strong&gt;on a short-contract basis to assist with updating the website&#39;s SEO audit digital presence.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;What You’ll Be Doing&lt;/strong&gt;&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;Conduct comprehensive on-page and technical SEO audits for our websites and provide actionable feedback to our internal team based on your findings&lt;/li&gt;\n&lt;li&gt;Conduct competitor analysis to identify content gaps and opportunities to improve or expand existing content&lt;/li&gt;\n&lt;li&gt;Provide reports and insights on each audit to our account management team&lt;/li&gt;\n&lt;li&gt;Ongoing optimizations to our Google Business Profiles (GBP)&lt;/li&gt;\n&lt;li&gt;Other tasks as required&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;&lt;strong&gt;What You Bring&lt;/strong&gt;&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;Experience with content creation or copywriting focused on local SEO&lt;/li&gt;\n&lt;li&gt;Understanding of conversion rate optimization (CRO) and its relationship to SEO&lt;/li&gt;\n&lt;li&gt;Familiarity with Core Web Vitals, schema markup, and technical SEO&lt;/li&gt;\n&lt;li&gt;Strong knowledge of local SEO tactics and strategies, including Content optimization and link-building strategies&lt;/li&gt;\n&lt;li&gt;Strong communication skills and experience working within a development team&lt;/li&gt;\n&lt;li&gt;Experience working with industry-standard tools such as Screaming Frog, SEMRush, Ahrefs, or similar&lt;/li&gt;\n&lt;li&gt;Experience working with industry-standard tools such as Google Search Console, Google Analytics&amp;nbsp;&lt;/li&gt;\n&lt;li&gt;Self-motivated with excellent time management, attention to detail, and a demonstrated ability to manage multiple projects effectively and efficiently&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;&lt;strong&gt;Nice to Have&lt;/strong&gt;&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;Basic knowledge of HTML&lt;/li&gt;\n&lt;li&gt;Experience using Uberall&lt;/li&gt;\n&lt;li&gt;Experience working in Jira&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;We will be paying at a rate of USD $5.50 per hour.&lt;/p&gt;\n&lt;p&gt;Note: OneLocal pays freelancers using Direct Deposit. Please only apply for this position if you can get paid via Direct Deposit. Thank you!&lt;/p&gt;","tags":"[\"management\"]","pubDate":"2025-03-26T16:36:25.000Z","link":"https://boards.greenhouse.io/onelocal/jobs/4821274004","slug":"seo-freelancer-onelocal-6900"},{"id":5405523412,"title":"Freelance Content Writer","company":"OneLocal","image":"https://photos.wellfound.com/startups/i/257661-3abe9f68928f2e0407dca967aca86e67-medium_jpg.jpg","description":"&lt;p&gt;We are looking for a talented &lt;strong&gt;Freelance Content Writer&lt;/strong&gt; with a strong background in &lt;strong&gt;martech, CRM, or agency-related topics&lt;/strong&gt; to join our team. This role is ideal for a writer who can produce high-quality, in-depth blog posts and case studies while maintaining an authoritative, market analyst tone.&lt;/p&gt;\n&lt;h3&gt;&lt;span style=&quot;font-size: 10pt;&quot;&gt;&lt;strong&gt;Key Responsibilities&lt;/strong&gt;&lt;/span&gt;&lt;/h3&gt;\n&lt;ul&gt;\n&lt;li&gt;Create compelling, research-driven blog posts on marketing trends, CRM providers, SMB marketing strategies, product insights, and case studies.&lt;/li&gt;\n&lt;li&gt;Write with an authoritative voice, demonstrating expertise and thought leadership in the industry.&lt;/li&gt;\n&lt;li&gt;Collaborate with our SEO freelancer to align on keywords and content strategies when needed.&lt;/li&gt;\n&lt;li&gt;Conduct independent research using internal resources and publicly available data (no technical interviews with subject matter experts required).&lt;/li&gt;\n&lt;li&gt;Produce several pieces of content per week, ensuring quality, consistency, and timely delivery.&lt;/li&gt;\n&lt;li&gt;Use Jira for task tracking (familiarity is helpful but not required).&lt;/li&gt;\n&lt;li&gt;Focus solely on writing—our in-house designer handles graphic and multimedia content.&lt;/li&gt;\n&lt;/ul&gt;\n&lt;h3&gt;&lt;span style=&quot;font-size: 10pt;&quot;&gt;&lt;strong&gt;Qualifications&lt;/strong&gt;&lt;/span&gt;&lt;/h3&gt;\n&lt;ul&gt;\n&lt;li&gt;Proven experience in content writing, blogging, or journalism, particularly in martech, CRM, or digital marketing.&lt;/li&gt;\n&lt;li&gt;Strong ability to analyze industry trends and translate them into insightful, well-structured content.&lt;/li&gt;\n&lt;li&gt;Excellent research and analytical skills with a keen eye for detail.&lt;/li&gt;\n&lt;li&gt;Understanding of SEO best practices and experience optimizing content for search.&lt;/li&gt;\n&lt;li&gt;Ability to write in a clear, engaging, and authoritative style.&lt;/li&gt;\n&lt;li&gt;Exceptional time management and organizational skills to meet deadlines consistently.&lt;/li&gt;\n&lt;/ul&gt;\n&lt;h3&gt;&lt;span style=&quot;font-size: 10pt;&quot;&gt;&lt;strong&gt;Nice to Have&lt;/strong&gt;&lt;/span&gt;&lt;/h3&gt;\n&lt;ul&gt;\n&lt;li&gt;Experience writing for SaaS, B2B, or marketing agencies.&lt;/li&gt;\n&lt;li&gt;Familiarity with Jira or other project management tools.&lt;/li&gt;\n&lt;li&gt;Interest in marketing technology, automation, and CRM ecosystems.&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;This is an hourly, ongoing freelance role with no designated end date.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Rate:&lt;/strong&gt; USD 5.5 per hour&amp;nbsp;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Note:&lt;/strong&gt; We process freelancer payments via &lt;strong&gt;Direct Deposit&lt;/strong&gt;. Please apply only if you can receive payments via this method.&lt;/p&gt;\n&lt;p&gt;If you&#39;re a strategic thinker, a skilled storyteller, and passionate about marketing and CRM content, we&#39;d love to hear from you!&lt;/p&gt;\n&lt;p&gt;&amp;nbsp;&lt;/p&gt;","tags":"[\"management\",\"b2b\"]","pubDate":"2025-03-26T14:24:35.000Z","link":"https://boards.greenhouse.io/onelocal/jobs/5482273004","slug":"freelance-content-writer-onelocal-3139"},{"id":9443887564,"title":"Email Automation Specialist","company":"Emails","image":"https://remotive.com/job/1988452/logo","description":"<p>The Email Automation Specialist will be responsible for creating, optimizing, and managing automated email campaigns that drive engagement and conversion through personalized customer experiences.</p>\n<p> </p>\n<p><strong>Responsibilities</strong></p>\n<ul style=\"\">\n<li style=\"\">Develop and implement automated email marketing workflows for customer onboarding, re-engagement, and lead nurturing.</li>\n<li style=\"\">Monitor, analyze, and report on the performance of automated campaigns, making data-driven adjustments as required.</li>\n<li style=\"\">Collaborate with marketing and design teams to ensure emails are visually appealing and align with brand messaging.</li>\n<li style=\"\">Conduct A/B testing on email content, subject lines, and send times to optimize performance.</li>\n<li style=\"\">Ensure compliance with email marketing regulations and best practices.</li>\n</ul>\n<div class=\"h3\"> </div>\n<p><strong>Requirements</strong></p>\n<ul style=\"\">\n<li style=\"\">2+ years of experience in email marketing or marketing automation.</li>\n<li style=\"\">Proficiency in email marketing automation tools (e.g., Mailchimp, Klaviyo, HubSpot).</li>\n<li style=\"\">Strong analytical skills with the ability to interpret campaign data and insights.</li>\n<li style=\"\">Excellent communication skills and attention to detail.</li>\n<li style=\"\">Ability to manage multiple projects and deadlines in a fast-paced environment.</li>\n<li style=\"\">Passion for enhancing customer experiences through targeted email marketing.</li>\n</ul>\n<p><strong>Benefits</strong></p>\n<ul style=\"\">\n<li style=\"\">Base salary + Bonus.</li>\n</ul>\n<ul style=\"\">\n<li style=\"\">Competitive health, dental and vision benefits.</li>\n<li style=\"\">Work remotely from anywhere in the world.</li>\n<li style=\"\">Unlimited PTO.</li>\n<li style=\"\">Flex work hours.</li>\n</ul>\n<img src=\"https://remotive.com/job/track/1988452/blank.gif?source=public_api\" alt=\"\"/>","tags":"[\"marketing automation\",\"email marketing\"]","pubDate":"2025-03-26T03:50:56.000Z","link":"https://remotive.com/remote-jobs/marketing/email-automation-specialist-1988452","slug":"email-automation-specialist-emails-6101"},{"id":7213362426,"title":"Account Executive (North America SMB)","company":"Float","image":"https://avatars.githubusercontent.com/u/5396037?s=200&v=4","description":"<h3><strong>Who We Are</strong></h3><p>Float is the leading resource management software for professional services teams. Since 2012, we’ve grown every year—independently, self-funded, and profitably. We’re rated #1 for resource management on G2 and trusted by 4,500+ customers worldwide.</p><p>As a certified B Corporation, we’re committed to making a positive impact on our team, customers, the environment, and the remote community. Our 50+ person team works 100% remotely across the globe, with <a href=\"https://www.notion.so/Perks-and-benefits-1841a06d46528081a119c93f270ec71c?pvs=21\" rel=\"nofollow noreferrer noopener\" class=\"external\">perks and benefits</a> designed to support us in living our Best Work Life. You'll collaborate with teammates across Australia, Mexico, the UK, Nigeria, Canada, and the US. Learn more about our data security practices for employment or service contracts <a href=\"https://www.notion.so/5a44ff7c04bb4a55a05873f6d5d7743b?pvs=21\" rel=\"nofollow noreferrer noopener\" class=\"external\">here</a>. Browse <a href=\"https://www.float.com/blog/\" rel=\"nofollow noreferrer noopener\" class=\"external\">our blog</a> to get a glimpse of life at Float and check out our <a href=\"https://www.glassdoor.com/Overview/Working-at-Float-EI_IE2055330.11,16.htm\" rel=\"nofollow noreferrer noopener\" class=\"external\">Glassdoor employer reviews</a>. See why our customers love Float <a href=\"https://www.g2.com/products/float-float/reviews\" rel=\"nofollow noreferrer noopener\" class=\"external\">on G2</a> .</p><p>We’re on a scale-up journey, and we’re seeking people who thrive in this stage. We want Float to be the place where you have the autonomy and opportunity to do the best work of your career.</p><p></p><h3><strong>Why We’re Hiring For This Role</strong></h3><p>As we continue to expand our global footprint, we're making a strategic investment in our sales team by hiring a North America-focused SMB Account Executive. This role is essential to accelerating our growth in a key market, ensuring we have the coverage and responsiveness needed to capture high-velocity SMB deals. Currently, our sales team is structured to support a global audience, but as demand grows in North America, we recognize the need for dedicated regional focus. By bringing in an AE specifically for this market, we can:</p><ul> <li>Increase our availability for North American prospects, leading to faster response times and higher conversion rates.</li> <li>Maintain our momentum in SMB deal execution, ensuring our Mid-Market AE can continue focusing on larger, more complex opportunities.</li> <li>Capitalize on our latest product innovations, such as Charge vs Cost tracking and Multi-Currency support, which are highly relevant to North American businesses.</li> </ul><p>This role isn’t just about closing deals—it’s about shaping the future of our SMB sales strategy in North America. The right person will help us hit key revenue milestones, refine our go-to-market approach, and play a pivotal role in Float’s continued expansion. 🚀</p><p>Our Global Sales Manager, Dan, explains the important role you will play within our Sales team. <a href=\"https://www.loom.com/share/38933bef2cb74b9490bd1b41f1a00a40?sid=06786124-57c1-400f-bea4-1ab16d9ec9e4\" target=\"_blank\" rel=\"nofollow noreferrer noopener\" class=\"external\">Watch this video</a>.</p><p><img src=\"https://cdn.loom.com/sessions/thumbnails/38933bef2cb74b9490bd1b41f1a00a40-0ca972f0b749561f-full-play.gif\" width=\"640px\" height=\"auto\" style=\"width:640px;height:auto;\"></p><p>You’ll be working asynchronously with a bright, dedicated team from across the globe, with a strong focus on taking complex problems and creating solutions that feel simple and intuitive for our customers.</p><p></p><h3><strong>What You’ll Be Responsible For</strong></h3><p>Early on, you’ll jump right into:</p><ul> <li> <strong>Learning our ICP:</strong> Your first priority will be learning our ideal customer profile, their needs, and their use cases.</li> <li> <strong>Learning the Product:</strong> You’ll become a domain expert by reviewing our product documentation, getting to know our product in depth, and testing our software in collaboration with the product team.</li> <li> <strong>Observing how we do sales at Float:</strong> You’ll learn from recorded calls, live demos, and will watch how our sales team takes prospects and turns them into loyal customers.</li> <li> <strong>Getting Started:</strong> You’ll start leading your own discovery calls and eventually showcase Float’s capabilities with demos to key stakeholders and our incredible resource management champions.</li> </ul><p>Once you are a bit more settled, we expect that you will jump into:</p><ul> <li> <strong>Owning SMB revenue growth in North America</strong>: Drive high-velocity sales, closing 8-12+ deals per month and adding $5K in new MRR consistently. You’ll own the full sales cycle, including negotiation and procurement. This includes managing inbound opportunities, leading a thoughtful and structured discovery meeting, and presenting Float’s capabilities as a solution to key stakeholders.</li> <li> <strong>Developing a scalable sales motion</strong>: Build a repeatable and efficient SMB sales process tailored to the North American market.</li> <li> <strong>Master product knowledge &amp; industry knowledge</strong>: You will become an expert in the Float product. This will allow you to confidently address technical questions from prospects, offer guidance and expertise on workflows, showcase additional features prospects might benefit from, and offer key insights to our product team to improve our offerings.</li> <li> <strong>Optimize sales efficiency with new pricing &amp; packaging</strong>: Sell larger deals under Float’s new pricing model, increasing ACV without extending sales cycles.</li> <li> <strong>Provide market insights to product &amp; marketing</strong>: Share customer feedback, competitive intelligence, and positioning recommendations to refine Float’s go-to-market strategy.</li> <li> <strong>Refine and contribute to the SMB sales playbook</strong>: Document best practices, sales strategies, and deal execution insights to improve pipeline efficiency.</li> <li> <strong>Expand Float’s NA market presence</strong>: Build a strong pipeline, identify high-potential SMB segments, and drive Float’s visibility in North America.</li> </ul><p></p><h3><strong>What You’ll Need To Be Successful</strong></h3><p>We want you to love your work and believe that these skills will allow you to succeed in the role. Applying these skills requires:</p><ul> <li> <strong>SaaS sales experience</strong>: 3+ years of inbound or outbound, quota-carrying sales experience within the B2B SaaS industry.</li> <li> <strong>Full sales cycle experience and performance</strong>: Proven ability to run the entire sales process, from discovery and sales calls to diligent follow-ups and closing deals. You have a history of being a top performer in B2B sales.</li> <li>Currently or previously been in the top 10% of performers in a Sales team.</li> <li> <strong>Discovery &amp; demo effectiveness</strong>: You are skilled in conducting virtual discovery sessions to uncover and articulate prospects' pain points, KPIs, goals, and needs. You come with strong experience leading and delivering compelling product demos to potential clients.</li> <li> <strong>Stakeholder engagement</strong>: Ability to identify multiple relevant influencers and decision-makers within companies and build strong personal relationships with them.</li> <li> <strong>CRM proficiency</strong>: Familiar with CRM systems like HubSpot or Salesforce (we use HubSpot).</li> </ul><p>As a fully remote team, we’re looking for someone comfortable with asynchronous communication as the default, which means you have previous remote experience and are comfortable using tools like Slack, Loom, and Linear to communicate as needed. Don’t worry—you will have significant deep work time since we have <a href=\"https://www.float.com/blog/how-to-create-a-culture-with-fewer-meetings/\" rel=\"nofollow noreferrer noopener\" class=\"external\">very few meetings</a>.</p><p></p><h3><strong>Why Join Us</strong></h3><p>Pay for this role is US $142,857 OTE ($100,000 base + $42,857 variable) Here’s a <a href=\"https://www.float.com/blog/why-were-changing-the-way-we-compensate-at-float/\" rel=\"nofollow noreferrer noopener\" class=\"external\">blog post</a> with more information on how we determine our salaries.</p><p>We’re a global <a href=\"https://www.float.com/blog/giving-our-team-agency-over-their-time/\" rel=\"nofollow noreferrer noopener\" class=\"external\">async remote company</a> with a diverse team of people from all over the world who share a common belief in living our <a href=\"https://www.float.com/blog/\" rel=\"nofollow noreferrer noopener\" class=\"external\">best work life</a>. We believe deeply in the idea of transparency and share our <a href=\"https://www.notion.so/Float-Handbook-9bf7a6a869744d41b2adfaa1c9131746?pvs=21\" rel=\"nofollow noreferrer noopener\" class=\"external\">Float Handbook</a> publicly so potential new team members can see first hand our <a href=\"https://www.notion.so/67c2928515af45729501aaf7d5195d8c?pvs=21\" rel=\"nofollow noreferrer noopener\" class=\"external\">perks &amp; benefits</a> as well as our <a href=\"https://www.notion.so/How-we-work-4727bfc669f647e790f2809efa92f8fe?pvs=21\" rel=\"nofollow noreferrer noopener\" class=\"external\">ways of working</a>. If you feel like you can thrive at Float to do your best work, we would love to hear from you.</p><p></p><h3><strong>Hiring Process For This Role</strong></h3><p>You’ll find a lot of useful information about our <a href=\"https://www.notion.so/Hiring-process-1841a06d4652801f85ebd42caaf5c6e9?pvs=21\" rel=\"nofollow noreferrer noopener\" class=\"external\">interview process</a> and what it’s like to join our global team on the <a href=\"https://www.float.com/careers\" rel=\"nofollow noreferrer noopener\" class=\"external\">Float careers page</a>.</p><p>If you’re interested in applying, we can’t wait to hear from you! Be sure to review <a href=\"https://www.float.com/blog/applying-for-a-remote-job\" rel=\"nofollow noreferrer noopener\" class=\"external\">this blog post</a> that outlines what we look for in our applications, so that you can put your best foot forward.</p><p>The hiring process for this role looks like this:</p><p><strong>Application Review:</strong> We carefully review each application, including your resume and your responses to the application questions. We're especially looking for answers that reflect your personal experience and voice. If your responses feel copy-pasted or AI-generated, we won’t move forward. We want to hear from <em>you</em>! </p><p><strong>Initial First Meet (20 min):</strong> You'll meet with Julia, Talent Manager, to discuss your interest in the role and review your questions about working at Float. </p><p><strong>Manager Interview (45 min)</strong>: You’ll meet with Dan, Global Sales Manager, to discuss your role-specific skills and how your past experience sets you up to succeed at Float. </p><p><strong>Co-Worker Interview (30 min):</strong> You’ll meet with Avi, our EMEA-focused SMB Account Executive, to dive deeper into your alignment with our way of working and values at Float. </p><p><strong>Founder Interview (30 min)</strong>: You’ll meet with Glenn, Float’s CEO, to get to know you and see if you have potential to be a great addition to the team.</p><p><em>Note: Industry research shows that women and those in traditionally underrepresented groups generally don’t apply to jobs unless they check all the boxes for the role. If you feel strongly that you have what it takes for this role but don’t check 100% of the boxes—that’s okay—we encourage you to apply anyway and highlight what you can bring to the table.</em></p>","tags":"[\"management\",\"b2b\"]","pubDate":"2025-03-26T00:00:00.000Z","link":"https://apply.workable.com/j/6705CF98D8","slug":"account-executive-north-america-smb-float-2247"},{"id":3618801772,"title":"Brand Designer","company":"Tabby","image":"https://remotive.com/job/1988798/logo","description":"<div class=\"h3\"><!--block-->About the role</div><div><!--block-->As a <strong>Brand Designer</strong> at Tabby, you'll play a key role in designing and executing marketing campaigns across multiple channels. We're looking for someone who can bring creativity and precision to email design and build, particularly within <a href=\"http://Customer.io\" rel=\"nofollow\"><strong>Customer.io</strong></a>, as well as craft compelling social media visuals, in-app ads and banners. This role is essential in helping us inspire our customers to rethink how their shoppers pay, earn and save money. You’ll work cross-functionally with Marketing Managers and the Brand Studio team to create high-quality, engaging visual content that drives impact.</div><div><!--block--><br></div><br><br><div class=\"h3\">Key Responsibilities</div><ul style=\"\"><li style=\"\"><!--block--><strong>Design and build marketing emails</strong>, ensuring a seamless user experience and strong visual appeal. Experience with <a href=\"http://Customer.io\" rel=\"nofollow\"><strong>Customer.io</strong></a> is a plus.</li><li style=\"\"><!--block--><strong>Create social media graphics</strong> that align with Tabby’s brand identity and marketing objectives.</li><li style=\"\"><!--block--><strong>Design in-app ads and banners</strong> to enhance the user experience and drive engagement.</li><li style=\"\"><!--block--><strong>Develop and execute campaign strategies</strong>, identifying target audiences and crafting visual content that resonates with Tabby’s merchants.</li><li style=\"\"><!--block--><strong>Collaborate with the marketing team</strong> to determine the most effective channels and tactics for reaching customers.</li><li style=\"\"><!--block--><strong>Ensure brand consistency</strong> across all design assets, maintaining high-quality visuals that align with Tabby’s branding.</li><li style=\"\"><!--block--><strong>Work closely with cross-functional teams</strong>, including product designers, copywriters, and marketing managers, to create cohesive campaigns.</li><li style=\"\"><!--block--><strong>Leverage data insights</strong> to refine design strategies and optimize creative content.</li></ul><div><!--block--><br></div><br><br><div class=\"h3\">This might be right for you if:</div><ul style=\"\"><li style=\"\"><!--block-->You have <strong>3-4 years of experience in brand or visual design</strong>.</li><li style=\"\"><!--block-->You are highly skilled in <strong>Figma and Adobe Creative Cloud</strong> (Illustrator, Photoshop). Bonus points if you have experience in <strong>motion design</strong>.</li><li style=\"\"><!--block-->You have experience <strong>designing and building emails</strong>, preferably in <a href=\"http://Customer.io\" rel=\"nofollow\"><strong>Customer.io</strong></a> or similar platforms.</li><li style=\"\"><!--block-->You have a strong ability to communicate your design thinking and decisions both visually and in writing.</li><li style=\"\"><!--block-->You understand <strong>graphic design principles</strong> and best practices for different digital channels.</li><li style=\"\"><!--block-->You stay up to date with <strong>current visual design trends</strong> and know how to apply them effectively.</li><li style=\"\"><!--block-->You thrive in <strong>cross-functional collaborations</strong> with technical and commercial teams.</li><li style=\"\"><!--block-->You can manage multiple projects simultaneously and meet tight deadlines.</li><li style=\"\"><!--block-->You are proficient in <strong>English design work</strong>; <strong>bonus points if you can design in Arabic</strong>.</li></ul><div><!--block--><br>The application process consists of an interview with our Senior Brand Manager, an assessment, and a final interview.</div><div><!--block--><br></div><img src=\"https://remotive.com/job/track/1988798/blank.gif?source=public_api\" alt=\"\"/>","tags":"[\"Figma\",\"graphic design\",\"adobe creative cloud\",\"motion design\"]","pubDate":"2025-03-25T23:50:38.000Z","link":"https://remotive.com/remote-jobs/design/brand-designer-1988798","slug":"brand-designer-tabby-4317"},{"id":8652488481,"title":"Lifecycle Marketing Associate","company":"Circle","image":"https://media.licdn.com/dms/image/v2/D4E0BAQGsuyBYT8Wy1A/company-logo_200_200/company-logo_200_200/0/1709246393415/circleco_logo?e=1746662400&v=beta&t=KH2t1NJ7bcXknchnvYTCh2X0_q0BdXf-vERJqIz2p1k","description":"&lt;div class=&quot;content-intro&quot;&gt;&lt;h2&gt;About Us&lt;/h2&gt;\n&lt;p&gt;Circle is building the world’s leading all-in-one platform for online communities. We make it possible for creators, coaches, educators, and businesses to bring together their audience with engaging discussions, live streams, events, chat, courses, and payments — all in one place, all under their own brand.&lt;/p&gt;\n&lt;p&gt;We’re proud to be a fully remote company of around 180 (and growing!) team members from 30+ countries around the world. We seek exceptional individuals around the world, set them up to do the best work of their lives, and in turn, create a meaningful impact in their own lives. We don&#39;t track hours, but we do manage for high expectations very closely. We collaborate across time zones, are highly async, and like to document a lot.&lt;/p&gt;\n&lt;p&gt;Twice a year, we bring the whole company together in beautiful places around the world for our company offsites. So far, we’ve hosted offsites in Turkey, Portugal, Mexico, Thailand, Colombia, Italy, Ireland, and more, with still more to come!&lt;/p&gt;&lt;/div&gt;&lt;h2&gt;About the role&lt;/h2&gt;\n&lt;p&gt;Every week, thousands of people sign up for Circle. As the &lt;strong&gt;Lifecycle Marketing Associate&lt;/strong&gt;, you&#39;ll play a critical role in engaging, converting, and retaining these users by delivering the right message at the right time across email and in-product experiences.&lt;/p&gt;\n&lt;p&gt;Working closely with marketing, sales, and customer success, you’ll help build, launch, measure, and optimize lifecycle programs that drive engagement, retention, and revenue. This role is ideal for someone who is highly organized, analytical, detail-oriented, and excited about the impact of lifecycle marketing on customer experience.&lt;/p&gt;\n&lt;h2&gt;What you&#39;ll be doing&lt;/h2&gt;\n&lt;ul&gt;\n&lt;li&gt;&lt;strong&gt;Support cross-functional teams&lt;/strong&gt; (demand generation, product marketing, and customer success) by building, launching, and measuring lifecycle programs and one-off communications across email and in-app messaging.&lt;/li&gt;\n&lt;li&gt;&lt;strong&gt;Execute targeted, trigger-based campaigns&lt;/strong&gt; that nurture prospects and customers throughout their journey, ensuring engagement at key lifecycle stages.&lt;/li&gt;\n&lt;li&gt;&lt;strong&gt;Maintain and optimize the CRM marketing calendar&lt;/strong&gt;, collaborating with the Sr. Customer Marketing Manager to manage messaging frequency, avoid audience saturation, and escalate conflicts when necessary.&lt;/li&gt;\n&lt;li&gt;&lt;strong&gt;Analyze performance and optimize campaigns&lt;/strong&gt; by monitoring key lifecycle metrics such as engagement, retention, and lifetime value.&lt;/li&gt;\n&lt;li&gt;&lt;strong&gt;Collaborate with Revenue Operations&lt;/strong&gt; to ensure clean data pipelines, robust data enrichment, and seamless integrations that maximize lifecycle marketing potential.&lt;/li&gt;\n&lt;li&gt;&lt;strong&gt;Ensure compliance and deliverability&lt;/strong&gt;, working with RevOps to uphold best practices in email marketing, sender reputation, and legal requirements (e.g., GDPR, CAN-SPAM).&lt;/li&gt;\n&lt;/ul&gt;\n&lt;h2&gt;What you&#39;ll need to be successful&lt;/h2&gt;\n&lt;ul&gt;\n&lt;li&gt;&lt;strong&gt;Values alignment — &lt;/strong&gt;strong alignment with our values, &lt;a href=&quot;https://circle.so/careers&quot;&gt;find our values on our career page&lt;/a&gt; if you haven’t read up on them yet&lt;/li&gt;\n&lt;li&gt;&lt;strong&gt;Fluent in English&lt;/strong&gt; — you are proficient in English (spoken, written, and reading) at a&amp;nbsp;&lt;a href=&quot;https://magoosh.com/english-speaking/english-proficiency-levels-a-guide-to-determining-your-level/&quot;&gt;CEFR Level C2&lt;/a&gt; / &lt;a href=&quot;https://www.govtilr.org/&quot;&gt;ILR Level 5&lt;/a&gt;.&lt;/li&gt;\n&lt;li&gt;&lt;strong&gt;Customer-first mindset &lt;/strong&gt;— you think holistically about the customer journey and have deep empathy for what messages prospects and customers want to receive at each stage.&lt;/li&gt;\n&lt;li&gt;&lt;strong&gt;Structured thinking &lt;/strong&gt;— you can break down complex customer segments and lifecycle stages and communicate insights clearly, simply, and effectively.&lt;/li&gt;\n&lt;li&gt;&lt;strong&gt;Meticulous attention to detail &lt;/strong&gt;— you spot errors in copy, formatting, and segmentation before they go live.&lt;/li&gt;\n&lt;li&gt;&lt;strong&gt;Strong copywriting skills&lt;/strong&gt; — you know how to write compelling, on-brand messaging that resonates with the audience, drives action, and fits the channel and stage of the journey.&lt;/li&gt;\n&lt;li&gt;&lt;strong&gt;Project management skills&amp;nbsp;&lt;/strong&gt;— you can juggle multiple lifecycle programs across different segments while staying organized and efficient.&lt;/li&gt;\n&lt;/ul&gt;\n&lt;h2&gt;Bonus points&lt;/h2&gt;\n&lt;ul&gt;\n&lt;li&gt;Experience with &lt;strong&gt;Pendo and HubSpot&lt;/strong&gt; (our primary lifecycle marketing tools).&lt;/li&gt;\n&lt;li&gt;Prior experience in&amp;nbsp;&lt;strong&gt;B2B SaaS lifecycle marketing&lt;/strong&gt;—but this is not required!&lt;/li&gt;\n&lt;/ul&gt;\n&lt;h2&gt;$60,000 - $80,000 USD per year&lt;/h2&gt;\n&lt;p&gt;&lt;em&gt;The cash compensation range shown is a starting point. In addition to equity, benefits and perks, your cash compensation is subject to an annual review and increase on a once per year basis.&lt;/em&gt;&lt;/p&gt;\n&lt;p&gt;&amp;nbsp;&lt;/p&gt;&lt;div class=&quot;content-conclusion&quot;&gt;&lt;h2&gt;The fun stuff&lt;/h2&gt;\n&lt;ul&gt;\n&lt;li&gt;Fully remote:&amp;nbsp;work from anywhere in the world!&lt;/li&gt;\n&lt;li&gt;Autonomy and trust to do your job:&amp;nbsp;we care about outcomes over everything else.&lt;/li&gt;\n&lt;li&gt;Paid time away:&amp;nbsp;all employees are given 35 days of PTO annually. We also offer a paid sabbatical after 5 years.&lt;/li&gt;\n&lt;li&gt;Generous U.S. benchmarked compensation&amp;nbsp;and startup equity no matter where you are in the world.*&lt;/li&gt;\n&lt;li&gt;Awesome medical coverage&amp;nbsp;with 100% coverage for you and your family, or medical reimbursement options where applicable!*&lt;/li&gt;\n&lt;li&gt;Parental leave&amp;nbsp;for parents expanding their family, or just starting one.&lt;/li&gt;\n&lt;li&gt;Home office stipend&amp;nbsp;to help you get up and running.&lt;/li&gt;\n&lt;li&gt;Learning &amp;amp; development stipend&amp;nbsp;to help you level up your professional skills.&lt;/li&gt;\n&lt;li&gt;Annual bonus potential&amp;nbsp;for roles that don&#39;t already receive variable income or commission.&lt;/li&gt;\n&lt;li&gt;Company retreats:&amp;nbsp;Twice a year, the Circle team gets together for a fully paid company retreat in incredible places around the world! We’ve had past retreats in Colombia, Portugal, and Mexico, with more planned on the horizon.&lt;/li&gt;\n&lt;li&gt;Check out our&amp;nbsp;&lt;a href=&quot;https://careers.circle.so/&quot;&gt;Careers&lt;/a&gt;&amp;nbsp;page for more.&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;&lt;span style=&quot;font-size: 10pt;&quot;&gt;*&lt;em&gt;Your role, location and unique circumstance may affect this.&lt;/em&gt;&lt;/span&gt;&lt;/p&gt;\n&lt;h3&gt;Diversity, Equity &amp;amp; Inclusion&lt;/h3&gt;\n&lt;p&gt;As a fully-remote international company, diversity is baked into our DNA. Here’s how our CEO, Sid Yadav, frames our hiring mission: “let’s find talent in underserved and under-represented corners of the world, set them up to do the best work of their lives, and in turn, change their life.” To achieve this hiring mission, we offer competitive&amp;nbsp;U.S. benchmarked&amp;nbsp;compensation no matter where someone’s located in the world, and we proactively seek candidates who expand representation of backgrounds, cultures and lived experiences in our teams.&lt;/p&gt;\n&lt;h3&gt;Equal Employment Opportunity&lt;/h3&gt;\n&lt;p&gt;Circle is an equal opportunity employer and as such, we do not discriminate on the basis of race, color, religion, sex, sexual orientation, gender identity, national origin, age, disability, or any other characteristic protected by applicable laws.&amp;nbsp;If you require any accommodations during the recruitment process, please let us know and we will work with you to meet your needs.&lt;/p&gt;\n&lt;div class=&quot;&quot;&gt;\n&lt;h3 class=&quot;&quot;&gt;How We Use Candidate Data&lt;/h3&gt;\n&lt;p&gt;At Circle, we are committed to protecting your personal information. As a job applicant, the personal data you provide to us is collected and processed in accordance with the&amp;nbsp;&lt;strong&gt;General Data Protection Regulation (GDPR)&lt;/strong&gt; in the EU and the &lt;strong&gt;California Consumer Privacy Act (CCPA)&lt;/strong&gt;. This notice outlines the types of personal information we collect, the purpose for collecting it, and your rights.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Information We Collect:&lt;/strong&gt; We collect the following categories of personal information from job applicants:&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;Contact information (such as name, email address, phone number)&lt;/li&gt;\n&lt;li&gt;Employment history and qualifications&lt;/li&gt;\n&lt;li&gt;Education history&lt;/li&gt;\n&lt;li&gt;References and any other information you choose to share with us during the application process&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;&lt;strong&gt;Purpose of Collection:&lt;/strong&gt; We collect this information for the following purposes:&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;To assess your qualifications and suitability for the position&lt;/li&gt;\n&lt;li&gt;To communicate with you during the recruitment process&lt;/li&gt;\n&lt;li&gt;To comply with legal and regulatory obligations&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;&lt;strong&gt;Your Rights Under GDPR and CCPA:&lt;/strong&gt; You have the following rights regarding your personal information:&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;The right to request access to the personal information we hold about you.&lt;/li&gt;\n&lt;li&gt;The right to request the deletion of your personal information, subject to certain legal exceptions.&lt;/li&gt;\n&lt;li&gt;The right to opt out of the sale of your personal information (Note: We do not sell personal information).&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;For more information about how we handle your personal data or to exercise your rights, please refer to our full &lt;a href=&quot;https://circle.so/privacy&quot; target=&quot;_blank&quot;&gt;Privacy Policy&lt;/a&gt;.&lt;/p&gt;\n&lt;p&gt;By submitting your application, you acknowledge that you have read and understood this privacy notice.&lt;/p&gt;\n&lt;/div&gt;&lt;/div&gt;","tags":"[\"management\",\"b2b\",\"legal\",\"aws\"]","pubDate":"2025-03-25T18:34:24.000Z","link":"https://job-boards.greenhouse.io/circleso/jobs/4603420008","slug":"lifecycle-marketing-associate-circle-848"},{"id":1798134023,"title":"AI Grantwriting Associate - Apply Team","company":"Instrumentl","image":"https://avatars.githubusercontent.com/u/43759528?s=200&v=4","description":"<div><span style=\"font-size: 11pt;\">Instrumentl is growing! We’re looking for a detail-oriented and customer-obsessed AI Grantwriting Associate to help us continue our momentum in developing the best AI grantwriting tool on the market. If you're excited about the idea of working with a talented Content Operations team at a mission-driven company, then this role is made for you.&nbsp;</span></div><div><br></div><div><b style=\"font-size: 11pt;\">About us:</b></div><div><br></div><div><span style=\"font-size: 11pt;\">Instrumentl (YC S16) is the best platform for nonprofits and grant writing consultants looking to grow revenue. We help over 4,000 nonprofits to manage their institutional fundraising and win more grants by bringing discovery, tracking, grantwriting and grant management to one place.</span></div><div><span style=\"font-size: 11pt;\">Our mission is to be a force multiplier on the nonprofit sector’s ability to drive impact. We’re profitable and doubling year-over-year, with strong product-market fit (NPS is 60+).</span></div><div><br></div><div><b style=\"font-size: 11pt;\">About the role:</b></div><div><br></div><div><span style=\"font-size: 11pt;\">At Instrumentl, our grants data is the lifeblood of our product and our customers rely on us to provide up-to-date and accurate funding information in the form of grant data, funder data, and application data.&nbsp;</span></div><div><br></div><div><span style=\"font-size: 11pt;\">As an Apply Associate, you will own a portion of the processes required to ensure the timely and accurate production of grant application information. In this phase of product development, a significant part of your role will involve hands-on data entry and process refinement, ensuring accuracy and efficiency. Your insights will directly contribute to improvements in our Apply tool, as you collaborate with the Product and Engineering teams to enhance automation and user experience. You will also be communicating with our users and will be expected to go above and beyond in your interactions with them.</span></div><div><br></div><div><span style=\"font-size: 11pt;\">You’ll report directly to Kate, our Apply Team Lead and sit within the Product Team. You'll also work closely with:</span></div><div><span style=\"font-size: 11pt;\">- Bonnie, our Content Operations Manager</span></div><div><span style=\"font-size: 11pt;\">- Tara, Apply Content Associate</span></div><div><span style=\"font-size: 11pt;\">- Kim, Apply Product Designer</span></div><div><br></div><div><span style=\"font-size: 11pt;\">Get to know us at </span><a style=\"font-size: 11pt;\" href=\"https://www.instrumentl.com/about\">instrumentl.com/about</a><span style=\"font-size: 11pt;\">!</span></div><div><span style=\"font-size: 11pt;\">Instrumentl is growing! We’re looking for a detail-oriented and customer-obsessed AI Grantwriting Associate to help us continue our momentum in developing the best AI grantwriting tool on the market. If you're excited about the idea of working with a talented Content Operations team at a mission-driven company, then this role is made for you.&nbsp;</span></div><div><br></div><div><b style=\"font-size: 11pt;\">About us:</b></div><div><br></div><div><span style=\"font-size: 11pt;\">Instrumentl (YC S16) is the best platform for nonprofits and grant writing consultants looking to grow revenue. We help over 4,000 nonprofits to manage their institutional fundraising and win more grants by bringing discovery, tracking, grantwriting and grant management to one place.</span></div><div><span style=\"font-size: 11pt;\">Our mission is to be a force multiplier on the nonprofit sector’s ability to drive impact. We’re profitable and doubling year-over-year, with strong product-market fit (NPS is 60+).</span></div><div><br></div><div><b style=\"font-size: 11pt;\">About the role:</b></div><div><br></div><div><span style=\"font-size: 11pt;\">At Instrumentl, our grants data is the lifeblood of our product and our customers rely on us to provide up-to-date and accurate funding information in the form of grant data, funder data, and application data.&nbsp;</span></div><div><br></div><div><span style=\"font-size: 11pt;\">As an Apply Associate, you will own a portion of the processes required to ensure the timely and accurate production of grant application information. In this phase of product development, a significant part of your role will involve hands-on data entry and process refinement, ensuring accuracy and efficiency. Your insights will directly contribute to improvements in our Apply tool, as you collaborate with the Product and Engineering teams to enhance automation and user experience. You will also be communicating with our users and will be expected to go above and beyond in your interactions with them.</span></div><div><br></div><div><span style=\"font-size: 11pt;\">You’ll report directly to Kate, our Apply Team Lead and sit within the Product Team. You'll also work closely with:</span></div><div><span style=\"font-size: 11pt;\">- Bonnie, our Content Operations Manager</span></div><div><span style=\"font-size: 11pt;\">- Tara, Apply Content Associate</span></div><div><span style=\"font-size: 11pt;\">- Kim, Apply Product Designer</span></div><div><br></div><div><span style=\"font-size: 11pt;\">Get to know us at </span><a href=\"https://www.instrumentl.com/about\" style=\"font-size: 11pt;\">instrumentl.com/about</a><span style=\"font-size: 11pt;\">!</span></div><div><span style=\"font-size: 11.5pt;\"><i>*Compensation Information: Salary ranges are based on market data, relative to our size, industry and stage of growth. Salary is one part of total compensation, which also includes equity, perks and competitive benefits.</i></span></div><h3>What you'll get to do:</h3><li>Track, analyze and report user trends to the Product team and broader Content Team</li><li>Source funder application data and enter it into our database</li><li>Work with the Apply Product Team to design and implement new procedures to improve accuracy and efficiency standards</li><li>Own exciting side projects that contribute to user experience of the Apply tool&nbsp;</li><li>Triage with users and funders with care and empathy</li><li>Strategize with the Content team to define and execute on annual and quarterly goals </li><h3></h3><li><b>A ‘state of the art’ attention to detail:</b> You have a superhero-like ability to find the tiniest error, whether it be a typo, an inconsistency, or a noncompliant formatting mistake.</li><li><b>A ‘can-do’ attitude:</b> You enjoy a varied workload where no 2 days are the same and are motivated by ambitious goals.&nbsp;</li><li>&nbsp;<b>Process optimization:</b> You can identify any unwelcome dips in performance, efficiency, or accuracy, and constantly work to improve existing processes through thoughtful feedback.</li><li><b>Adaptability with technology:</b> You quickly learn and master new tools and workflows, ensuring efficiency and accuracy in your work.</li><li><b>Nonprofit sector experience: </b>You have some familiarity with the nonprofit world, especially with grant writing and fundraising.&nbsp;</li><li><b>Passion:</b> You're excited about Instrumentl’s mission!</li><li><b>Bonus:</b> You have experience working in early-stage startups and being comfortable (even thriving!) with ambiguity.</li><h3>Compensation and Benefits:</h3><li>Salary of $40,000-$50,000*</li><li>Equity in Instrumentl in line with role and responsibilities</li><li>100% covered health, dental, and vision insurance for employees (50% for dependents)</li><li>401(k)</li><li>Company laptop + stipend to set up your home workstation</li><li>Company retreats for in-person time with your colleagues</li><li>Work with awesome nonprofits around the US. At Instrumentl, we are lucky to kick it every day with some of the nicest people in the world, and we get to help power their success!</li><div><b style=\"font-size: 11pt;\">What to expect:</b></div><div><span style=\"font-size: 11pt;\">Instrumentl is evolving rapidly. You’ll always have new challenges and opportunities to grow in your role here - you won’t be bored! You’ll be an early member of our small but mighty team, playing a huge part in shaping our culture for the years and teammates to come.</span></div><div><br></div><div><b style=\"font-size: 11pt;\">At Instrumentl:</b></div><div><span style=\"font-size: 11pt;\">- </span><b style=\"font-size: 11pt;\">We’re customer-focused.</b><span style=\"font-size: 11pt;\"> We routinely seek feedback from our customers to improve the Instrumentl experience for everyone. Our first company value is \"The customer is the hero\" and we mean it.</span></div><div><span style=\"font-size: 11pt;\">- </span><b style=\"font-size: 11pt;\">We love to experiment. </b><span style=\"font-size: 11pt;\">Our team is constantly generating new concepts and iterating to see what works - ideation and experimentation are essential here. \"Bend the curve\" is another key company value.</span></div><div><span style=\"font-size: 11pt;\">- </span><b style=\"font-size: 11pt;\">We’re approachable and collaborative.</b><span style=\"font-size: 11pt;\"> Everyone has a voice, and we’re all building Instrumentl together.</span></div><div><span style=\"font-size: 11pt;\">- </span><b style=\"font-size: 11pt;\">We kick it every day with some of the nicest people in the world.</b><span style=\"font-size: 11pt;\"> No joke, our customers are often on the front lines educating kids, saving endangered species, and restoring watersheds. In helping them take advantage of Instrumentl’s technology, you’re helping them move the world forward.</span></div>","tags":"[\"management\",\"engineering\",\"database\"]","pubDate":"2025-03-25T18:24:25.811Z","link":"https://jobs.lever.co/Instrumentl/63aaea8a-d8e5-40d8-a494-503f906db34e","slug":"ai-grantwriting-associate-apply-team-instrumentl-1988"},{"id":4200656437,"title":"Software Engineer - Infrastructure Team","company":"Discourse","image":"https://remotive.com/job/1989176/logo","description":"<p><em style=\"color: var(--remotive-chocolate);\">Salary depends on location and experience, able to provide up front</em></p>\n<p><em> </em></p>\n<p><em>When you send your resume also send a little intro for us to get to know you, with insight into why you want this job here at Discourse. Tell us about something you've made that you're proud of. Tell us something you think is interesting/cool about Discourse the software.</em></p>\n<p> </p>\n<p> </p>\n<p class=\"h2\">About the job</p>\n<p>The infrastructure team at Discourse are computing-system generalists. In this role, you’ll work across all layers of our tech stack, focusing on building and maintaining systems for our hosting platform.</p>\n<p> </p>\n<p>Discourse is primarily a hosting company, and robust infrastructure is a core competency for us. You’ll develop tools to reduce toil, enhance reliability, and improve performance. Most deployments are served from our own bare metal, with AWS and other cloud services used as necessary.</p>\n<p> </p>\n<p>Applicants will have a 10-40 hour paid trial project (over 2-10 weeks) prior to joining the team. The trial project usually involves adding a feature to Discourse or a Discourse plugin.</p>\n<p> </p>\n<p class=\"h4\">Your responsibilities will include:</p>\n<ul style=\"\">\n<li style=\"\">Applying fundamental computing theory to solve problems in sustainable space and time.</li>\n<li style=\"\">When reasoning about infrastructure improvements, draw upon these combined skills to choose or build the right tool for the job.</li>\n<li style=\"\">While stewarding code along the path from initial development to eventual retirement, support and document the system for the operators who depend on it.</li>\n</ul>\n<p> </p>\n<p class=\"h4\">We’re looking for someone who: </p>\n<ul style=\"\">\n<li style=\"\">Has a well-rounded understanding of how applications interface with the operating system, how the operating system interfaces with the network.</li>\n<li style=\"\">Can read C, and feels at home in Unix-like systems.</li>\n<li style=\"\">Has fluency in at least one high-level programming language. We have a large amount of infrastructure tooling, primarily in Go and Ruby.</li>\n<li style=\"\">Has experience with at least some of tools the we use: PostgreSQL, Docker, HAProxy, Prometheus, Grafana.</li>\n</ul>\n<p> </p>\n<p>At Discourse, the ability to communicate well in writing is paramount. We use our own software, Discourse, for most communication and most of your interaction with customers and team members will be in writing. In order to live these values, we look for folks who are:</p>\n<p> </p>\n<ul style=\"\">\n<li style=\"\">Detail-oriented, proactive, and organized</li>\n<li style=\"\">Able to make decisions quickly and communicate effectively</li>\n<li style=\"\">Work well independently and remotely</li>\n<li style=\"\">Kind to their co-workers</li>\n<li style=\"\">Highly driven with an execution focus and a strong belief in our mission to make the internet a better place</li>\n</ul>\n<p> </p>\n<p class=\"h2\">About our Pay &amp; Benefits</p>\n<p>We believe that high-quality benefits make our team more effective. We’ve been thoughtful about our benefits package which includes a completely flexible schedule, 5 weeks of vacation per year, funding for a co-working stipend, and much more!</p>\n<p> </p>\n<p>Our Salary Framework is location and experience based, and we’re happy to provide a range up front. We also give every employee a stake in the success of the business, regardless of seniority or role. All full-time employees are eligible to receive equity options in the company as part of our equity incentive program.</p>\n<p> </p>\n<p>Lastly, we believe in having a welcoming workplace where people with diverse backgrounds and cultures can create something great together. We encourage you to apply, even if you don’t meet every qualification! Apply to <span style=\"color: var(--remotive-chocolate);\">jobs@discourse.org.</span><span style=\"color: var(--remotive-chocolate);\"> Send your resume and a little intro for us to get to know you, with insight into why you want this job here at Discourse.</span></p>\n<p><span style=\"color: var(--remotive-chocolate);\"> </span></p>\n<p class=\"h2\"><span style=\"color: var(--remotive-chocolate);\">Important location info:</span></p>\n<p><span style=\"color: var(--remotive-chocolate);\">Within Europe, we only hire from:</span></p>\n<p><span style=\"color: var(--remotive-chocolate);\"> </span></p>\n<ul style=\"\">\n<li style=\"\">Austria</li>\n<li style=\"\">Italy</li>\n<li style=\"\">Poland</li>\n<li style=\"\">Portugal</li>\n<li style=\"\">Romania</li>\n<li style=\"\">United Kingdom</li>\n</ul>\n<img src=\"https://remotive.com/job/track/1989176/blank.gif?source=public_api\" alt=\"\"/>","tags":"[\"api\",\"CSS\",\"frontend\",\"html\",\"javascript\",\"postgresql\",\"ruby/rails\",\"open source\",\"Redis\",\"infrastructure\"]","pubDate":"2025-03-25T17:35:38.000Z","link":"https://remotive.com/remote-jobs/software-dev/software-engineer-infrastructure-team-1989176","slug":"software-engineer-infrastructure-team-discourse-3335"},{"id":1129802644,"title":"Formateur Coach pour PXL","company":"Paradox","image":"https://media.licdn.com/dms/image/v2/D4D0BAQEmydwDkZ6NPw/company-logo_200_200/company-logo_200_200/0/1711612675702/weareparadox_en_logo?e=1743033600&v=beta&t=w-Hh_tfeKg8KOPSA6AHYXlcEcUm84UVSnDoP8KaF7L0","description":"<p style=\"min-height:1.5em\"><strong>Attends une minute.</strong></p><p style=\"min-height:1.5em\"><em>Tu rêves de rejoindre une aventure EdTech ambitieuse, qui permettrait à des millions de personnes d’être la meilleure version d’eux même ?</em></p><p style=\"min-height:1.5em\"></p><p style=\"min-height:1.5em\"><strong>Tu veux vivre une expérience qui t’apporte…</strong></p><p style=\"min-height:1.5em\">🗽 <strong>Liberté</strong> : la liberté de travailler d’où tu veux, en toute confiance, et de montrer que tu peux performer en étant autonome.</p><p style=\"min-height:1.5em\">🔥 <strong>Ambition</strong> : l’envie de grandir aux côtés de personnes brillantes, déterminées à créer une marque aussi emblématique que Nike.</p><p style=\"min-height:1.5em\">😍 <strong>Impact</strong> : la fierté de voir concrètement l’impact de ton travail dans la vie des gens… et dans l’entreprise.</p><p style=\"min-height:1.5em\"></p><p style=\"min-height:1.5em\"></p><p style=\"min-height:1.5em\"><strong>Et tu le mérites, parce que…</strong></p><p style=\"min-height:1.5em\">👉 Tu as une vraie expertise en coaching, et tu as déjà animé avec succès des formations engageantes, dynamiques, pour des groupes de toutes tailles.</p><p style=\"min-height:1.5em\">👉 Tu sais créer des espaces d’apprentissage participatifs et inclusifs, grâce à ton aisance en communication et ta capacité à embarquer les gens.</p><p style=\"min-height:1.5em\">👉 Tu es à l’aise pour proposer des idées d’amélioration, en t’appuyant sur les retours terrain et les évolutions du secteur — tout en continuant à te former toi-même.</p><p style=\"min-height:1.5em\">Tu veux mettre ton expérience de coach et formateur au service d’un projet qui a du sens, et contribuer à changer la vie de milliers de personnes tout en construisant une marque puissante ?</p><p style=\"min-height:1.5em\"></p><p style=\"min-height:1.5em\"></p><p style=\"min-height:1.5em\"><strong>Alors ce job est peut-être fait pour toi !</strong></p><p style=\"min-height:1.5em\">Le poste peut être basé dans nos superbes bureaux à Dubaï, à Lisbonne… ou bien depuis ton canapé.</p><p style=\"min-height:1.5em\"></p><p style=\"min-height:1.5em\"></p><p style=\"min-height:1.5em\">Nos sources d’inspiration ? Apple, Nike, Spotify, Disney… pour leur obsession de l’excellence, leur impact global, et leur capacité à ne pas juste vendre des produits, mais à créer de vraies expériences.</p><p style=\"min-height:1.5em\">Pour nous, être Iconic, c'est innover à l'intersection de la Psychologie x Créativité x Technologie.</p><p style=\"min-height:1.5em\"></p><div style=\"text-align:left\"><img style=\"max-width:100%\" src=\"https://app.ashbyhq.com/api/images/user-content/9f216e31-710a-4d14-8a7c-747665aa0e4a/8530f88d-8278-498d-8183-5b8d617d220b/Intersection%20en%20blanc.png\" /></div><p style=\"min-height:1.5em\"></p><p style=\"min-height:1.5em\"></p><p style=\"min-height:1.5em\"></p><h2>TA MISSION 🚀 </h2><p style=\"min-height:1.5em\">-------------------------------</p><p style=\"min-height:1.5em\">🎯 En tant que <strong>formateur·rice, facilitateur·rice et coach</strong> (3-en-1), tu animeras des sessions en ligne à fort impact dans le cadre de nos modules PXL (Paradox Learning).<br /><br />Le tout sera pensé pour combler l’écart entre apprentissage et passage à l’action — et produire des résultats concrets dans ta vie réelle. Nous recherchons des coachs-facilitateur·rice·s capables de conjuguer puissance <strong>d’impact </strong>et <strong>sensibilité humaine. </strong></p><p style=\"min-height:1.5em\">Ton rôle n’est pas d’enseigner de nouveaux contenus, mais de faire vivre le programme, d’en faciliter l’intégration, et de provoquer des prises de conscience durables. </p><p style=\"min-height:1.5em\">Tu feras partie intégrante de notre équipe coaching, reconnue pour son engagement dans l’excellence pédagogique, l’apprentissage continu, et la croissance personnelle et professionnelle.</p><p style=\"min-height:1.5em\"></p><p style=\"min-height:1.5em\"></p><h2>TON OBJECTIF  🎯  </h2><p style=\"min-height:1.5em\">-------------------------------</p><p style=\"min-height:1.5em\"></p><ul style=\"min-height:1.5em\"><li><p style=\"min-height:1.5em\">Animer 3 lives Psychologie de l’Argent/ en appliquant les contenus Paradox avec clarté et impact.</p></li><li><p style=\"min-height:1.5em\">Générer engagement, transformations, témoignages et upsells.</p></li><li><p style=\"min-height:1.5em\">Améliorer le programme via feedbacks, co-création et auto-évaluations.</p></li></ul><p style=\"min-height:1.5em\"><br /><br /></p><h3>1 - Thématiques à aborder dans les lives - Psychologie de l’argent</h3><p style=\"min-height:1.5em\"></p><p style=\"min-height:1.5em\">Chaque session live doit créer un effet “WOW”, autour d’un ou plusieurs de ces piliers :</p><p style=\"min-height:1.5em\"></p><p style=\"min-height:1.5em\">💰<strong> Épargne : </strong>habitudes, résistances, structure<br /></p><p style=\"min-height:1.5em\">📈 <strong>Investissement :</strong> premiers pas, ETF, biais cognitifs<br /></p><p style=\"min-height:1.5em\">💡<strong> Création de revenus </strong>: side projects, stratégies simples et activables<br /></p><p style=\"min-height:1.5em\">🧠<strong> Psychologie :</strong> peurs, croyances limitantes, dissonance cognitive</p><p style=\"min-height:1.5em\"></p><h3>2 - Concrètement tu vas</h3><p style=\"min-height:1.5em\">👊 Créer une dynamique d’<strong>action</strong>, de <strong>partage</strong> et de <strong>transformation</strong></p><p style=\"min-height:1.5em\">👊 Favoriser la mise en pratique des <strong>exercices du programme</strong></p><p style=\"min-height:1.5em\">👊 Gérer le <strong>timing</strong>, les <strong>sous-groupes</strong>, le <strong>contenu</strong> et les <strong>supports</strong></p><p style=\"min-height:1.5em\">👊 Être une présence <strong>active et bienveillante</strong> dans la communauté</p><p style=\"min-height:1.5em\">👊 Proposer des f<strong>ormats variés et engageants</strong> (démos, coaching, challenges…)</p><p style=\"min-height:1.5em\">👊 Réaliser des <strong>coachings 1:1 en live</strong> et intégrer les retours des participants</p><p style=\"min-height:1.5em\"></p><h2>TON PROFIL  😍  </h2><p style=\"min-height:1.5em\">-------------------------------</p><h3></h3><ul style=\"min-height:1.5em\"><li><p style=\"min-height:1.5em\">Tu es étudiant ou ancien étudiant de <strong>PXS (EDEC) </strong>ou<strong> </strong>tu es formé au<strong> coaching</strong></p></li><li><p style=\"min-height:1.5em\"><strong>Tu suis le programme Psychologie de l’Argent</strong></p></li></ul><p style=\"min-height:1.5em\">Et en plus…</p><ul style=\"min-height:1.5em\"><li><p style=\"min-height:1.5em\"><strong>One- woman/man show</strong> : autonome, confiant(e), inspirant(e).</p></li><li><p style=\"min-height:1.5em\">Capable d’inspirer les participants à <strong>partager leurs émotions, prises de conscience et réussites</strong>. </p></li><li><p style=\"min-height:1.5em\">Créer un environnement d’apprentissage inclusif et participatif.</p></li><li><p style=\"min-height:1.5em\">Mobiliser des notions de <strong>psychologie</strong> et de <strong>neurosciences</strong> pour créer des expériences d’apprentissage mémorables.</p></li><li><p style=\"min-height:1.5em\">Concevoir et animer des sessions <strong>expérientielles</strong> : jeux de rôle, exercices en sous-groupes, démonstrations en live.</p></li><li><p style=\"min-height:1.5em\">Capacité à adopter une attitude positive et bienveillante envers les participants</p></li><li><p style=\"min-height:1.5em\">Connaissance et application pratique des principes et techniques de coaching: <strong>Coaching 1:1</strong></p></li></ul><h2><strong>CE POSTE N’EST PEUT-ÊTRE PAS POUR TOI </strong>🙅‍♀️</h2><h3>-------------------------------</h3><p style=\"min-height:1.5em\">Soyons clairs : on cherche quelqu’un qui ne se contente pas d’être bon.</p><p style=\"min-height:1.5em\">On cherche quelqu’un pour qui l’ambition de Paradox n’est pas juste un projet cool de plus… mais une vraie mission.</p><p style=\"min-height:1.5em\">Donc si <strong>le développement personnel, le coaching, la croissance pro, l’éducation, l’edtech, la transmission ou l’edutainment</strong> ne t’animent pas vraiment, si ce ne sont pas des sujets que tu adores et que tu as envie de faire rayonner autour de toi… alors ce n’est sûrement pas pour toi.</p><p style=\"min-height:1.5em\">Et ce n’est probablement pas pour toi non plus si :</p><ul style=\"min-height:1.5em\"><li><p style=\"min-height:1.5em\">Tu n’aimes pas être challengé·e ni grandir à travers ton job</p></li><li><p style=\"min-height:1.5em\">Tu n’aimes pas donner ou recevoir du feedback, même franc</p></li><li><p style=\"min-height:1.5em\">Tu ne remets pas en question le statu quo : “les process existent, on a toujours fait comme ça”</p></li><li><p style=\"min-height:1.5em\">Tu préfères qu’on te dise exactement quoi faire, et comment le faire, avec des missions précises et fixes</p></li><li><p style=\"min-height:1.5em\">Ta seule motivation, c’est de rejoindre une boîte en full remote : oui, notre culture est cool, mais ce qu’on attend, c’est que tu sois passionné·e par notre mission, nos produits et ton rôle</p></li></ul><p style=\"min-height:1.5em\"><br /></p><h2>🤩 <strong>REJOINS-NOUS SI TU AS ENVIE DE…</strong></h2><h3>-------------------------------</h3><p style=\"min-height:1.5em\"><em><strong>Croissance &amp; Ambition 🚀</strong></em></p><p style=\"min-height:1.5em\"><em><strong>🏅 </strong></em>Tu veux évoluer avec les meilleurs. On ne recrute que des A-players : ambitieux, brillants et toujours de bonne humeur. On croit à cette loi simple : les “A” attirent les “A”.</p><p style=\"min-height:1.5em\">🏋️‍♀️ Tu préfères les conversations constructives à une hiérarchie rigide : on remplace les “boss” par du vrai feedback et du développement pro.</p><p style=\"min-height:1.5em\">⚡️ Tu veux faire partie d’une entreprise ambitieuse, avec de vraies opportunités d’évolution.</p><p style=\"min-height:1.5em\"><em><strong>Impact &amp; Sens 🔥</strong></em></p><p style=\"min-height:1.5em\"><em><strong>🦄 </strong></em>Tu joueras un rôle central dans le développement d’une entreprise dont les contenus ont déjà aidé des millions de personnes.</p><p style=\"min-height:1.5em\">🤩 Tu te lèveras le matin en sachant que ton travail a un vrai sens. Tous les jours, on reçoit des messages de clients qui nous disent : j’ai perdu du poids, j’ai arrêté de fumer, j’ai franchi un cap dans mon business, je vis une meilleure relation, j’ai changé ma vie.</p><p style=\"min-height:1.5em\">Et ce n’est pas tout. Chez Paradox, on pense que les personnes motivées méritent aussi…</p><p style=\"min-height:1.5em\"></p><h2><strong>📃 LE PROCESSUS DE RECRUTEMENT</strong></h2><h2>-------------------------------</h2><p style=\"min-height:1.5em\"><em>Cette description t’a parlé ?</em></p><p style=\"min-height:1.5em\"><em>Voici le processus de recrutement taillé sur mesure pour toi.</em></p><p style=\"min-height:1.5em\"></p><p style=\"min-height:1.5em\"><strong>📃 </strong>Un questionnaire de candidature de 6 à 8 minutes</p><p style=\"min-height:1.5em\">💻 Un entretien en visio avec<strong> Chloé</strong> - notre RH - pour plonger dans ton parcours et tes ambitions</p><p style=\"min-height:1.5em\">💻Une démo en live / mise en situation avec nos <strong>Lead Coaches (Yann ou Nadia)</strong>, pour voir tes compétences en action.</p><p style=\"min-height:1.5em\">💻 Un dernier échange avec <strong>l’équipe produit de PXL </strong></p><p style=\"min-height:1.5em\"></p><p style=\"min-height:1.5em\"><strong>🫵🚀</strong> <strong>Welcome aboard!</strong></p><p style=\"min-height:1.5em\"><em> <strong> </strong></em></p><p style=\"min-height:1.5em\"><em><strong>Ce poste est accessible seulement aux étudiants - Psychologie de l’Argent de Paradox </strong></em></p><p style=\"min-height:1.5em\"></p><div style=\"text-align:left\"><img style=\"max-width:100%\" src=\"https://app.ashbyhq.com/api/images/user-content/9f216e31-710a-4d14-8a7c-747665aa0e4a/ec9fe1ea-f8c2-41b8-84ec-8548d649bc0f/pic%20job%20desc.png\" /></div><p style=\"min-height:1.5em\"></p><p style=\"min-height:1.5em\"><strong>Join the Paradox Revolution !</strong></p>","tags":"[]","pubDate":"2025-03-25T11:07:34.477Z","link":"https://jobs.ashbyhq.com/paradox/934364f0-ba4e-497d-815e-cb1832c72a55","slug":"formateur-coach-pour-pxl-paradox-9617"},{"id":7335740488,"title":"Technical Team Lead","company":"Darkhorse Tech","image":"https://remotive.com/job/1987852/logo","description":"<p><strong>About Darkhorse Tech</strong></p>\n<p>Darkhorse Tech provides comprehensive Dental-Specific IT services to our clients including ongoing support (Managed Services), startup projects &amp; expansions (planning, design, buildouts) as well as software &amp; hardware sales and maintenance.</p>\n<p>As a leader in the industry, we have created and continue to foster relationships with all leading-edge technology companies servicing the Dental community. Our company was created by founder and CEO, Reuben Kamp who left his job at a nationwide Dental IT company to build a relationship-focused version of a Managed Service Provider (MSP) which creates true partnerships with it's clients.</p>\n<p>Constantly building on our 12+ years of experience we are now servicing roughly 1300 clients in all 50 states and continue to see massive growth while focusing on maintaining unparalleled support for our Dental Practice partners. With technicians on the ground throughout the country we offer in-person as well as remote support.</p>\n<p><strong>About You</strong></p>\n<p>Service first. Providing exemplary service means recognizing it. Have you put off a call to your cell phone company because the idea of waiting on hold, requesting a manager only to fight for a solution seems exhausting? Have you ever been pleasantly surprised by a service organization where your call is addressed efficiently, with care and acknowledgement that you are their top priority because you (as a client) are the lifeblood of their business? There is a huge difference in these approaches, and the latter builds loyalty and trust which is vital to the health of any business.</p>\n<p>You are solution-oriented and accountable. When given an opportunity to address an issue you follow service standards and quickly provide a solution, if you can't you are able to escalate the issue and alert your manager to your need/want for knowledge and growth - all while communicating progress in a professional and engaging manner with the client.</p>\n<p>Part of our team! While service tickets are addressed individually our crew is always ready to support one another, you will both receive and provide help as we are all working toward the same goal. Together we provide a level of service that our clients dream of and that we stand behind.</p>\n<p><strong>Technical Team Lead Summary</strong></p>\n<p>As a Technical Team Lead, you will provide guidance and support to our service technicians by fielding questions, issues, and escalations. You will also drive customer service and KPIs for the team and for individual technicians.</p>\n<p><strong>Responsibilities</strong></p>\n<ul style=\"\">\n<li style=\"\">Serve as the primary point of contact for all technician questions and issues</li>\n<li style=\"\">Serve as the primary point person monitoring Slack channels to ensure technicians are receiving ideas and guidance to resolve their tickets</li>\n<li style=\"\">Serve as the first line of defense for escalations; Manage high priority escalations with finesse and respond in a timely manner; Engage directly with customers and management and ensure robust status communication</li>\n<li style=\"\">Monitor the service board and Nilear to ensure technicians are completing tickets in a timely manner; Provide guidance or reassign tickets as needed when technicians are stuck and cannot move forward</li>\n<li style=\"\">Collaborate with Service Coordinators and Service Board Analysts to ensure effective flow of tickets</li>\n<li style=\"\">Provide additional support as needed on days that are busy or short-staffed</li>\n<li style=\"\">Drive customer satisfaction, technical proficiency, timeliness of support delivery, and understanding customer needs around speed, quality, and value</li>\n<li style=\"\">Drive Darkhorse service KPIs as a team and for each individual technician</li>\n<li style=\"\">Schedule and lead regular meetings with each technician on your team to discuss goals and commitments</li>\n</ul>\n<p><strong>Qualifications and Skills</strong></p>\n<ul style=\"\">\n<li style=\"\">Knowledge of PC hardware installation, repair, testing, and troubleshooting</li>\n<li style=\"\">Knowledge of scripting within a Windows environment</li>\n<li style=\"\">Familiarity of Microsoft Windows and Office applications</li>\n<li style=\"\">Familiarity of Cisco networks</li>\n<li style=\"\">Proven troubleshooting and problem-solving skills</li>\n<li style=\"\">Organization and attention to detail</li>\n<li style=\"\">Ability to multitask</li>\n<li style=\"\">Ability to work independently without assistance from others</li>\n<li style=\"\">Ability to manage and direct the work of others</li>\n<li style=\"\">1-2 years of tech support experience</li>\n<li style=\"\">1-2 years of leadership and training experience in an IT environment is required; Experience in an MSP environment is highly preferred</li>\n<li style=\"\">1-2 years of customer service experience</li>\n<li style=\"\">Bachelor's degree in Information Technology or Computer Science is preferred</li>\n</ul>\n<p><strong>Hours: 7:00am to 4:00pm EST OR 8:00am to 5:00pm EST</strong></p>\n<img src=\"https://remotive.com/job/track/1987852/blank.gif?source=public_api\" alt=\"\"/>","tags":"[\"troubleshooting\"]","pubDate":"2025-03-24T19:51:13.000Z","link":"https://remotive.com/remote-jobs/customer-support/technical-team-lead-1987852","slug":"technical-team-lead-darkhorse-tech-7663"},{"id":5516535915,"title":"Growth Strategy and Planning Manager","company":"Airalo","image":"https://lever-client-logos.s3.us-west-2.amazonaws.com/55028a36-609c-479c-9553-d4689ff2dd8c-1669620566663.png","description":"<div><b>About Airalo</b></div><div>Alo! Airalo is the world’s first eSIM store that helps people connect in over 200+ countries and regions across the globe. We are building the next digital service that revolutionizes the telecom industry. We are a travel-tech company and an equal-opportunity environment that values and executes diversity, inclusion, and equity. Our team is spread across 50+ countries and six continents. What glues us together is our commitment to changing the way you connect<span style=\"font-size: 13.3333px\">. </span></div><div><br></div><div><b>About you</b></div><div>We hope that you care deeply about the quality of your work, the intrinsic worth of tasks, and the success of your team. You are self-disciplined and do not require micromanagement in terms of your skillset and work ethic. You do your best to flourish as an individual every day while working hard to foster a collaborative team environment. You believe in the importance of being — and staying — authentic, honest, positive, and kind. You are a good interlocutor with clear and concise communication. You are able to manage multiple projects, have an analytical mind, pay keen attention to detail, and love to get your hands dirty. You are cognizant, tolerant, and welcoming of vulnerabilities and cultural differences.</div><div><br></div><div><b>About the Role</b></div><div><b>Position</b>: Full-time / Employee</div><div><b>Location:</b>&nbsp;Remote-first </div><div><b>Benefits:</b>&nbsp;Health Insurance, work-from-anywhere stipend, annual wellness &amp; learning credits, annual all-expenses-paid company retreat in a gorgeous destination &amp; other benefits</div><div><br></div><div><span style=\"font-size: 16px;\">As </span><b style=\"font-size: 16px;\">Growth Strategy and Planning Manager</b><span style=\"font-size: 16px;\"> at Airalo, you will collaborate closely with the Growth team to help define acquisition and retention targets, working closely across Regional and Global levels to optimize efficiency and help ensure the quality of execution. You will help shape and implement strategic initiatives that drive Airalo's growth and act as a key partner to the Growth leadership team, leveraging data-driven insights to inform planning, improve operational efficiency, and unlock growth opportunities across global markets.</span></div><div><br></div><div><span style=\"font-size: 16px;\">In this role, you will take ownership of </span><b style=\"font-size: 16px;\">forecasting and planning processes</b><span style=\"font-size: 16px;\">, driving alignment between Regional teams and Central teams. Your ability to distill complex data into actionable strategies will be essential in influencing key metrics, and improving operational and financial performance.</span></div><h3>Responsibilities include but are not limited to:</h3><li>Build and maintain scalable forecasting and reporting models for core growth KPIs, including signups, conversion rates, retention, and revenue</li><li>Help steer spend allocation process that enables our Growth team to achieve growth and efficiency targets according to Regional and Global growth plans</li><li>Analyze complex and challenging Regional market dynamics at their most granular level, translate market dynamics into meaningful insights and package up to present recommendations on critical topics and opportunities to key stakeholders</li><li>Assist in planning processes for quarterly Growth goals, coordinating Regional teams efforts to propose, prioritize and deliver on high-impact initiatives</li><li>Partner with Central teams (Acquisition, Retention) to ain in planning of media mix strategies, improving overall impact of channel performance, and ensure accurate forecasting of overall acquisition performance</li><li>Act as a thought leader within the Growth organization, bringing new ideas, tools, and methodologies to the table to drive growth and innovation</li><li>Prepare regular reports, insights, and presentations for leadership, summarizing key performance trends and recommendations</li>,<h3>Must-haves:</h3><li><b>3+ years of experience</b> in high performance growth environments, such as management consulting, strategy, operations, tech, financial services, analytics, or marketing</li><li>Proven expertise in building and maintaining <b>forecasting models</b> and translating insights into actionable recommendations</li><li>Strong analytical skills with experience in <b>multi-channel strategies</b> (e.g., paid, SEO, referrals, influencer marketing, etc.) and driving cross functional alignment</li><li>Strong quantitative proficiency in <b>Excel</b>, <b>SQL</b>, and data visualization tools (e.g., Looker, Tableau), with a proven ability to use data to drive decision-making</li><li>Exceptional attention to detail and the ability to manage <b>complex, deadline driven projects</b>, analyzing results at a granular level with a strong bias for action</li><li><b>Excellent communication and presentation skills</b>, with the ability to synthesize complex information into clear, concise recommendations for stakeholders and leadership</li><li>Strong <b>project management skills</b>, with experience working in cross-functional teams in a fast-paced, agile environment</li><div>We sincerely thank all applicants in advance for submitting their interest in this opportunity. Airalo is an equal opportunity employer and values diversity, equity &amp; inclusion. We do not discriminate on the basis of race, religion, national origin, gender, sexual orientation, age, marital status, veteran status, or disability status. We are committed to providing reasonable accommodations upon request for individuals with disabilities throughout our job interview process.</div>","tags":"[\"management\"]","pubDate":"2025-03-24T19:18:27.887Z","link":"https://jobs.lever.co/airalo/91c5c8a9-867a-4903-99c1-bf663441de77","slug":"growth-strategy-and-planning-manager-airalo-5218"},{"id":9279099049,"title":"Process Analyst","company":"Tabby","image":"https://remotive.com/job/1987855/logo","description":"<div><!--block-->As a <strong>Process Analyst,</strong> you will play a key role in optimizing and standardizing customer and partner support operations. Your work will directly impact customer satisfaction and operational efficiency by analyzing, designing, and implementing process improvements. You will collaborate closely with cross-functional teams, including customer support agents, ops-managers, the Training team, Product, and other stakeholders, to ensure processes are customer-centric and aligned with organizational goals.</div><div><!--block--><br></div><div><!--block-->A strong background in customer support is critical for this role, as you will leverage your expertise to identify pain points, design effective workflows, and ensure seamless customer experiences.</div><br><br><div class=\"h3\">Key Responsibilities</div><div><!--block--><strong>Process Optimization:</strong></div><div><!--block--><br></div><div><!--block-->- Apply your deep understanding of customer support best practices to design processes that improve customer satisfaction and resolve pain points.</div><div><!--block-->- Analyze existing customer support processes to identify inefficiencies, bottlenecks, and areas for improvement.</div><div><!--block-->- Design and implement process improvements that enhance efficiency, consistency, and customer satisfaction.</div><div><!--block--><br></div><div><!--block--><strong>Formalized Workflow Documentation:</strong></div><div><!--block--><br></div><div><!--block-->- Create and maintain formalized workflow procedures, including step-by-step instructions and contextual data, to guide customer support agents in using CRM tools effectively.</div><div><!--block-->- Ensure procedures are clear, actionable, and tailored to the specific needs of agents, enabling them to resolve customer issues efficiently and consistently.</div><div><!--block-->- Regularly update workflows to reflect changes in CRM tools, product updates, or evolving customer needs.</div><div><!--block--><br></div><div><!--block--><strong>Cross-Functional Collaboration:</strong></div><div><!--block--><br></div><div><!--block-->- Work closely with customer support agents, managers, Training, Product, and other stakeholders to gather feedback and align process improvements with organizational goals.</div><div><!--block-->- Contribute to CRM tool development by providing input on customer support requirements and ensuring the tool aligns with operational needs.</div><br><br><div class=\"h3\">Skills, Knowledge &amp; Expertise</div><div><!--block--><strong>Education:</strong> </div><div><!--block-->- Bachelor's degree in Math, Engineering, Software Development, Business Administration, Operations Management, or a related field. Relevant certifications or additional qualifications are a plus.</div><div><!--block--><br></div><div><!--block--><strong>Experience:</strong></div><div><!--block-->- Proven experience in customer support operations, with a deep understanding of customer service principles, problem-solving techniques, and conflict resolution.</div><div><!--block-->- Prior experience as a process analyst, business analyst, or similar role, preferably in a customer support or service environment.</div><div><!--block--><br></div><div><!--block--><strong>Technical Skills:</strong></div><div><!--block-->- Familiarity with customer support systems and tools (e.g., CRM software, ticketing systems).</div><div><!--block-->- Proficient in process modeling techniques and tools (e.g., BPMN, flowcharts, process mapping).</div><div><!--block-->- Strong analytical skills with the ability to gather and interpret data, identify patterns, and provide actionable insights.</div><div><!--block--><br></div><div><!--block--><strong>Soft Skills:</strong></div><div><!--block-->- Excellent communication and collaboration skills to work effectively with cross-functional teams and stakeholders.</div><div><!--block-->- Detail-oriented mindset with the ability to critically evaluate and improve processes for efficiency and effectiveness.</div><div><!--block-->- Strong project management skills, including the ability to prioritize tasks, manage timelines, and drive projects to completion.</div><div><!--block--><br></div><div><!--block-->This role is ideal for a customer support professional who is passionate about process improvement and delivering outstanding customer experiences. If you are a detail-oriented, data-driven thinker with a customer-first mindset, we encourage you to apply!</div><img src=\"https://remotive.com/job/track/1987855/blank.gif?source=public_api\" alt=\"\"/>","tags":"[\"project management\",\"documentation\",\"CRM\",\"ticketing\",\"partner support\"]","pubDate":"2025-03-24T17:51:08.000Z","link":"https://remotive.com/remote-jobs/customer-support/process-analyst-1987855","slug":"process-analyst-tabby-5698"}]