[{"id":9267911659,"title":"Talent Scientist","company":"Canonical","image":"https://pbs.twimg.com/profile_images/1673959375340290050/x7pNtXQ7_400x400.jpg","description":"\n      <p>The Talent Science team has a mission to ensure that we follow objective, scientifically rigorous and efficient processes to select the very best new colleagues regardless of location, culture or background. The role requires a background in psychology or industrial psychology, fluency in data science and statistical analysis of people-related data, leadership skill to help members of the business understand how we expect them to hire and the confidence to hold them accountable to that expectation, good judgement when assessing candidates for their motivation and work ethic, and a high level of personal organisation to work remotely and be effective.</p>\n<p>As a pioneer remote-first tech company with a product that inspires people globally, we attract a huge number of applicants to every role we post. We are proud that our hiring process is totally unique. We train and empower Hiring Leads across the company who know the skill sets required and openings in their part of the business, and our team supports them in running the process for their roles. As a Talent Scientist, you will work closely with these Hiring Leads to drive initiatives, automation and best practice whilst offering an expert viewpoint on talent assessments. This is not a recruiter position - it's about the science of talent and performance, raising awareness and insights across the business so that we make, as a company, outstanding choices in the selection process.</p>\n<p>As a profitable and growing business that aspires to hire hundreds of people in 2024 and beyond, we are expanding the Talent Scientist team in all time zones. To be successful in this role we are looking for:</p>\n<ul>\n<li>Advanced behavioural interviewing techniques (competency based and psychometric)</li>\n<li>A passion for interviewing candidates to assess drivers, motivators and exceptional success</li>\n<li>Exceptional analytical problem solving abilities</li>\n<li>Experience using complex statistical analysis to identify behavioural patterns</li>\n<li>Ability to influence behaviours and decision making in senior business counterparts</li>\n</ul>\n<p>This is an ideal opportunity for someone with outstanding academic results and leadership qualities, who can apply meaningful analysis to select talent and enhance how we make talent decisions as a business.&nbsp;It is an opportunity to join a team that is changing the landscape on how the tech industry selects talent. To be successful in this role you will need to demonstrate an analytical mindset and fluency with data science and statistical analysis tools, together with an inquisitive mind to solve problems and present viable solutions across our business.</p>\n<p><strong>Location:</strong> We have openings in every time zone and will consider outstanding candidates from Europe, Middle East, Africa, the Americas and Asia-Pacific regions.</p>\n<h2><strong>What your day will look like</strong></h2>\n<p>As a Talent Scientist you will:</p>\n<ul>\n<li>Drive talent analytics to provide our business with real-time insight, partnering with the business to help them move through their hiring processes efficiently.</li>\n<li>Conduct in-depth behavioural talent interviews providing considerable insights into motivations and behaviours.</li>\n<li>Build key relationships with global stakeholders to ensure we deliver against our hiring agenda, closely monitoring hiring activities, driving results and ensuring that there is consistency in our operational processes</li>\n<li>Drive data driven insights, making sure our decision making process is robust and supportive to inform our decisions.</li>\n<li>Consider our employer brand and how our interactions with a candidate impacts their experience&nbsp;</li>\n<li>Review and streamline hiring processes and tools to drive continuous improvement.</li>\n<li>Work with external third parties and platforms to ensure we maximise our return on investment.</li>\n<li>Bring a passion for diversity and inclusion, ensuring we remove unconscious bias from our hiring process and ensuring our sourcing strategy underpins this.</li>\n</ul>\n<h2><strong>What we are looking for in you</strong></h2>\n<ul>\n<li>An exceptional viewpoint of talent, with a deep appreciation of how to predict and measure success of people</li>\n<li>Exceptional experience of conducting behavioural, competency based interviews with the ability to train stakeholders and advise on how to get the best out of an interview.</li>\n<li>Strong experience of using psychometric assessments, including interpretation, validity and reliability metrics</li>\n<li>Undergraduate degree in psychology or industrial psychology, or a compelling narrative about your alternative chosen path</li>\n<li>Deep analytical skills to run statistical analysis on hiring data (Python, SQL and/or R preferable) using metrics to fuel decision making and influence positive change.</li>\n<li>Be a thought leader in the talent space with the ability to influence best practice, demonstrating a track record of driving exceptional hiring processes in technology.</li>\n<li>Proven ability to build strong relationships with senior stakeholders, being seen as an expert as well as challenging the status quo.</li>\n<li>Successful track record of setting and managing projects through to completion.</li>\n<li>Excellent verbal and written English.</li>\n<li>Willingness to travel to company events twice a year, for up to two weeks.</li>\n</ul>\n<h2><strong>Other skills you may bring</strong></h2>\n<ul>\n<li>Experience in statistical significance testing and experience in Bayesian inference and/or predictive analytics and ML highly desirable.</li>\n<li>Experience on building data dashboards desirable.</li>\n</ul>\n<h2><strong>What we offer you</strong></h2>\n<p>We consider geographical location, experience, and performance in shaping compensation worldwide. We revisit compensation annually (and more often for graduates and associates) to ensure we recognise outstanding performance. In addition to base pay, we offer a performance-driven annual bonus. We provide all team members with additional benefits, which reflect our values and ideals. We balance our programs to meet local needs and ensure fairness globally.</p>\n<ul>\n<li>Distributed work environment with twice-yearly team sprints in person</li>\n<li>Personal learning and development budget of USD 2,000 per year</li>\n<li>Annual compensation review</li>\n<li>Recognition rewards</li>\n<li>Annual holiday leave</li>\n<li>Maternity and paternity leave</li>\n<li>Employee Assistance Programme</li>\n<li>Opportunity to travel to new locations to meet colleagues</li>\n<li>Priority Pass, and travel upgrades for long haul company events</li>\n</ul>\n<h2><strong>About Canonical</strong></h2>\n<p>Canonical is a pioneering tech firm at the forefront of the global move to open source. As the company that publishes Ubuntu, one of the most important open source projects and the platform for AI, IoT and the cloud, we are changing the world on a daily basis. We recruit on a global basis and set a very high standard for people joining the company. We expect excellence - in order to succeed, we need to be the best at what we do. Canonical has been a remote-first company since its inception in 2004.​ Working here is a step into the future, and will challenge you to think differently, work smarter, learn new skills, and raise your game.</p>\n<h2><strong>Canonical is an equal opportunity employer</strong></h2>\n<p>We are proud to foster a workplace free from discrimination. Diversity of experience, perspectives, and background create a better work environment and better products.<a href=\"https://canonical.com/careers/diversity/identity\"> Whatever your identity, we will give your application fair consideration.</a></p>\n<p>#LI-remote</p><p>Requisition ID: 709</p><p></p>\n    ","tags":"[]","pubDate":"2023-11-12 18:51:13.454","link":"https://canonical.com/careers/3137607","savedDate":"2023-11-12 18:51:13.454","slug":"talent-scientist-canonical-4913"},{"id":2278048301,"title":"Client Success Representative Bilingual (English/Spanish)","company":"Bobtail","image":"https://media.licdn.com/dms/image/D4E0BAQGvUyfPVBWDyg/company-logo_200_200/0/1657595552015?e=2147483647&v=beta&t=EecsDCOy3Fh_26M1noQDDIYw8-JuGKz_d1JDvcBZ-yI","description":"\n    \n\n    <h2><span style=\"font-weight: 400;\">About Bobtail</span></h2>\n<p><span style=\"font-weight: 400;\">Bobtail is dedicated to increasing happiness by eliminating inefficiencies in the supply chain.&nbsp; We envision a supply chain without friction, fraud, waste, and abuse where companies succeed based on the value they create.&nbsp;&nbsp;</span></p>\n<p><span style=\"font-weight: 400;\">We work uniquely at Bobtail, where we value teams over individuals and constantly encourage experimentation and iteration to improve. Teams are given flexibility in working towards a shared purpose and the freedom to decide how they will accomplish their goals.&nbsp;&nbsp;</span></p>\n<p><span style=\"font-weight: 400;\">If you are an out-of-the-box thinker that takes a proactive approach to collaborate with others to solve problems and achieve your goals - we would love to talk to you.&nbsp;&nbsp;</span></p>\n<p><span style=\"font-weight: 400;\">The things we value:</span></p>\n<ol>\n<li style=\"font-weight: 400;\"><span style=\"font-weight: 400;\">Mission</span></li>\n<li style=\"font-weight: 400;\"><span style=\"font-weight: 400;\">Teams over individuals</span></li>\n<li style=\"font-weight: 400;\"><span style=\"font-weight: 400;\">Collaboration</span></li>\n<li style=\"font-weight: 400;\"><span style=\"font-weight: 400;\">Communication</span></li>\n<li style=\"font-weight: 400;\"><span style=\"font-weight: 400;\">Iteration</span></li>\n<li style=\"font-weight: 400;\"><span style=\"font-weight: 400;\">Experimentation and failing fast</span></li>\n<li style=\"font-weight: 400;\"><span style=\"font-weight: 400;\">Initiative and solutions-oriented approach</span></li>\n<li style=\"font-weight: 400;\"><span style=\"font-weight: 400;\">Documentation</span></li>\n<li style=\"font-weight: 400;\"><span style=\"font-weight: 400;\">Data</span></li>\n<li style=\"font-weight: 400;\"><span style=\"font-weight: 400;\">Mental health and work-life balance</span></li>\n<li style=\"font-weight: 400;\"><span style=\"font-weight: 400;\">Diversity</span></li>\n<li style=\"font-weight: 400;\"><span style=\"font-weight: 400;\">Transparency</span></li>\n</ol>\n<h2><span style=\"font-weight: 400;\">You should apply if you have:</span></h2>\n<ul>\n<li style=\"font-weight: 400;\"><span style=\"font-weight: 400;\">Customer service experience (2/3 years minimum)</span></li>\n<li style=\"font-weight: 400;\"><span style=\"font-weight: 400;\">Possess excellent verbal and written communication skills</span></li>\n<li style=\"font-weight: 400;\"><span style=\"font-weight: 400;\">Time management and multitasking skills in order to handle multiple tasks and clients at once</span></li>\n<li style=\"font-weight: 400;\"><span style=\"font-weight: 400;\">Strong organizational skills and attention to detail</span></li>\n<li style=\"font-weight: 400;\"><span style=\"font-weight: 400;\">Capable of prioritizing tasks/requests to meet the client &amp; company needs</span></li>\n<li style=\"font-weight: 400;\"><span style=\"font-weight: 400;\">Ability to work independently and as part of a team</span></li>\n</ul>\n<h2><span style=\"font-weight: 400;\">You will be responsible for:</span></h2>\n<ul>\n<li style=\"font-weight: 400;\"><span style=\"font-weight: 400;\">Act as the first point of contact for company clients</span></li>\n<li style=\"font-weight: 400;\"><span style=\"font-weight: 400;\">Resolve complaints and prevent additional issues by improving processes.</span></li>\n<li style=\"font-weight: 400;\"><span style=\"font-weight: 400;\">Build &amp; maintain a good relationship with assigned carriers based on trust and respect</span></li>\n<li style=\"font-weight: 400;\"><span style=\"font-weight: 400;\">Collaborate with internal departments to fulfil carrier needs</span></li>\n<li style=\"font-weight: 400;\"><span style=\"font-weight: 400;\">Maintain up-to-date knowledge for assigned accounts</span></li>\n<li style=\"font-weight: 400;\"><span style=\"font-weight: 400;\">Answer incoming calls from carriers, brokers &amp; potential new clients</span></li>\n<li style=\"font-weight: 400;\"><span style=\"font-weight: 400;\">Communicate with assigned carriers via email, text or phone</span></li>\n</ul>\n<h2><span style=\"font-weight: 400;\">Benefits</span></h2>\n<ul>\n<li style=\"font-weight: 400;\"><span style=\"font-weight: 400;\">Monthly Mental Break Day</span></li>\n<li style=\"font-weight: 400;\"><span style=\"font-weight: 400;\">Work from home (or wherever)</span></li>\n<li style=\"font-weight: 400;\"><span style=\"font-weight: 400;\">Parental leave</span></li>\n</ul>\n<p>&nbsp;</p>\n<p><span style=\"font-weight: 400;\">Creating a diverse and inclusive workplace is Bobtail’s nucleus. We are an equal opportunity employer and embrace people of different backgrounds, cultures, religions, national origins, races, colors, genders, gender expressions, sexual orientations, ages, marital status, veteran status, experiences, abilities, and perspective</span><span style=\"font-weight: 400;\">s.</span><span style=\"font-weight: 400;\"> </span><span style=\"font-weight: 400;\"><br><br></span></p>\n<p><br><br></p>\n\n    \n\n    \n","tags":"[\"management\"]","pubDate":"2023-11-12 18:51:13.453","link":"https://boards.greenhouse.io/bobtail/jobs/4057519005","savedDate":"2023-11-12 18:51:13.453","slug":"client-success-representative-bilingual-english-spanish-bobtail-9793"},{"id":5429427222,"title":"Senior Front-End Engineer ","company":"Timescale","image":"https://pbs.twimg.com/profile_images/1542681228666671107/L5LYJLAD_400x400.png","description":"&lt;p&gt;Timescale is looking for an experienced Senior Front-End Engineer with a track record of building great SaaS and cloud services.&lt;/p&gt;\n&lt;p&gt;This is an exciting opportunity to play a central role in developing the next great cloud-native data platform. You will be responsible for playing a core role in developing and implementing the UI/UX for our cloud platform (&lt;a href=&quot;https://www.timescale.com/cloud&quot;&gt;https://www.timescale.com&lt;/a&gt;), from operationally managing services to data visualization and analysis. If you are passionate about both developer tools and great design, and want to help empower developers worldwide, then this is the role for you.&lt;/p&gt;\n&lt;p&gt;Timescale is a fully remote organization; this is a full-time position.&amp;nbsp;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Responsibilities&lt;/strong&gt;&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;Play a central role in developing and implementing SaaS product experience, including UI / UX for managed cloud services and data-driven visualization&lt;/li&gt;\n&lt;li&gt;Writing production-level code in Typescript with React&lt;/li&gt;\n&lt;li&gt;Strong experience with and commitment to testing (&lt;a href=&quot;https://www.cypress.io/&quot;&gt;Cypress&lt;/a&gt; is our tool of choice)&lt;/li&gt;\n&lt;li&gt;Work in a modern development environment on GitHub using a git workflow&lt;/li&gt;\n&lt;li&gt;Work with product, design, and backend engineers to deliver capabilities&lt;/li&gt;\n&lt;li&gt;Strong self-driven execution, ownership, and delivery&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;&lt;strong&gt;Skills &amp;amp; Requirements&lt;/strong&gt;&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;5+ years of UI/UX or front-end development work&lt;/li&gt;\n&lt;li&gt;Strong Typescript programming skills and modern JS frameworks experience (React strongly preferred)&lt;/li&gt;\n&lt;li&gt;Cares about the smallest details of look &amp;amp; feel, user flows, and UI/UX&lt;/li&gt;\n&lt;li&gt;Experience with data-driven visualization&amp;nbsp;&lt;/li&gt;\n&lt;li&gt;Some familiarity with SQL or other data-driven query languages&amp;nbsp;&lt;/li&gt;\n&lt;li&gt;Ability to work in a fast-paced start-up environment&lt;/li&gt;\n&lt;li&gt;Excellent verbal and written communication skills in English&lt;/li&gt;\n&lt;/ul&gt;&lt;div class=&quot;content-conclusion&quot;&gt;&lt;p&gt;By applying for this position, you are agreeing to &lt;a href=&quot;https://www.timescale.com/legal/timescale-applicant-privacy-note&quot; target=&quot;_blank&quot;&gt;Timescale&#39;s Applicant Privacy Notice.&lt;/a&gt;&amp;nbsp;&lt;/p&gt;&lt;/div&gt;","tags":"[\"typescript\",\"legal\"]","pubDate":"2023-11-12 18:51:13.451","link":"https://www.timescale.com/careers/7019358002?gh_jid=7019358002","savedDate":"2023-11-12 18:51:13.451","slug":"senior-front-end-engineer-timescale-8253"},{"id":9315191616,"title":"Senior C Developer for popular open source projects - Work Anywhere/Remote","company":"CloudLinux","image":"https://pbs.twimg.com/profile_images/696718028084482050/ymY3OEPk_400x400.png","description":"<p>CloudLinux is a global remote-first company. We are driven by our principles: Do the right thing, employees first, we are remote first, and&nbsp; we deliver high volume, low-cost Linux infrastructure and security products that help companies to increase the efficiency of their operations. Every person on our team supports each other and does what we can to ensure we all are successful.&nbsp;We are truly a great place to work.&nbsp;</p><p>We are looking to hire a C Developer, who will be part of our <a href=\"https://tuxcare.com/extended-lifecycle-support/\" rel=\"nofollow noreferrer noopener\" class=\"external\">Extended Lifecycle</a> team. In this position, you will work and contribute to major, open-source projects like Apache HTTPD, OpenSSL, and MySQL. You will also backport security fixed to stable, maintaining versions of those projects.</p><p>Become part of the team of experts and work with top-notch developers to contribute to open source. You can find more details about the project and the company on our branded websites at Cloudlinux.com and TuxCare.com.&nbsp;</p><p>Join us to make a difference!</p><p><strong>What you will do:</strong></p><ul> <li>Work on various open-source projects like Apache httpd, Python, OpenSSL, etc.</li> <li>Backport security and bug fixes from newer upstream versions or writing patches from scratch.&nbsp;</li> <li>Contribute to upstream projects</li> <li>Create reproducers and tests for vulnerabilities.</li> <li>Automation of routine processes like CVEs monitoring, patches applying, and testing.</li> </ul><h3>Requirements: </h3><p><strong>Who you are:</strong></p><ul> <li>You have 5+ years of С programming experience</li> <li>You have GNU/Linux operating system and shell scripting experience&nbsp;&nbsp;</li> <li>You have ability to work with various build systems like autotools, make and cmake</li> <li>You have experience with git-based development processes&nbsp;&nbsp;</li> <li>Python, Perl or other scripting language knowledge will be a plus</li> </ul><p></p><h3>Benefits: </h3><p><strong>What's in it for you?</strong></p><ul> <li>A focus on professional development; </li> <li>Interesting and challenging projects</li> <li> Flexible working hours</li> <li>Paid one month vacation per year and unlimited sick leave</li> <li>Medical insurance reimbursement</li> <li>Co-working and gym/sports reimbursement</li> <li>The opportunity to receive a reward for the most innovative idea that the company can patent</li> </ul><p><em>By applying for this position, you agree with </em><a href=\"https://cloudlinux.com/privacy-policy\" rel=\"nofollow noreferrer noopener\" class=\"external\"><em>Cloudlinux Privacy Policy</em></a><em> and give us your consent to maintain and process your personal data with this respect. Please read our Privacy Policy for more information.</em></p>","tags":"[\"mysql\"]","pubDate":"2023-11-10 00:00:00.000","link":"https://apply.workable.com/cloudlinux-1/j/EFD4939FC9","savedDate":"2023-11-12 18:51:13.455","slug":"senior-c-developer-for-popular-open-source-projects-work-anywhere-remote-cloudlinux-7430"},{"id":6200178599,"title":"Senior Kernel Developer for KernelCare - REMOTE/Work Anywhere","company":"CloudLinux","image":"https://pbs.twimg.com/profile_images/696718028084482050/ymY3OEPk_400x400.png","description":"<p>We are looking for <strong>Senior Kernel Developers</strong> to work on our KernelCare team. The ideal candidate is someone looking for a rewarding and challenging career developing Linux Kernels and patches. This role requires someone with strong C development skills and a passion for all that is Linux. Our Kernel Developers create patches with a cyber security focus while finding solutions for our customers. </p><p>KernelCare is a product of CloudLinux Inc., the maker of the #1 OS in security and stability for hosting providers. KernelCare, a live kernel patching service provides security patches and bug fixes for a range of popular Linux kernels that can be installed without rebooting the system.  Check out our website for more information about our KernelCare Product <a href=\"https://tuxcare.com/live-patching-services/\" rel=\"nofollow noreferrer noopener\" class=\"external\">https://tuxcare.com/live-patching-services/</a></p><p>CloudLinux is a global remote-first company. We are driven by our principles: Do the right thing, employees first, we are remote first, and we deliver high volume, low-cost Linux infrastructure and security products that help companies to increase the efficiency of their operations. Every person on our team supports each other and does what we can to ensure we all are successful. </p><p>We are truly a great place to work. </p><p><strong>As our Senior Kernel Developer, you will be responsible for:</strong></p><ul> <li>Support existing functionality and implementation of several new features</li> <li>Update existing kernels including security fixes and CVEs patches</li> <li>Develop and support Python and Bash scripts for task automation</li> </ul><h3>Requirements: </h3><p><strong>To be successful in this role you should have:</strong></p><ul> <li>Excellent C programming and debugging skills</li> <li>Good level knowledge of Linux kernel core subsystems</li> <li>CPU and cache architectures</li> <li>Experience with GDB and other debuggers</li> <li>CPU performance and power analysis</li> <li>Independent and self-motivated problem solver and strategic thinker</li> <li>Proficient in Git for development and patch/branch management</li> <li>Good planning, time management, decision-making, presentation, and organization skills</li> <li>Effective written and verbal communication</li> <li>Excellent interpersonal and teamwork skills</li> <li>Happy in an agile, fast-paced environment</li> </ul><ul> <li>Experience with python, shell scripting</li> <li>Experience with Jenkins</li> </ul><h3>Benefits: </h3><p><strong>What's in it for you?</strong><br></p><ul> <li>A focus on professional development; </li> <li>Interesting and challenging projects</li> <li> Flexible working hours</li> <li>Paid one month vacation per year and unlimited sick leave</li> <li>Medical insurance reimbursement</li> <li>Co-working and gym/sports reimbursement</li> <li>The opportunity to receive a reward for the most innovative idea that the company can patent</li> </ul><p></p><p><em>By applying for this position, you agree with </em><a href=\"https://cloudlinux.com/privacy-policy\" rel=\"nofollow noreferrer noopener\" class=\"external\"><em>Cloudlinux Privacy Policy</em></a><em> and give us your consent to maintain and process your personal data with this respect. Please read our Privacy Policy for more information.</em></p>","tags":"[\"management\",\"cyber security\"]","pubDate":"2023-11-10 00:00:00.000","link":"https://apply.workable.com/cloudlinux-1/j/9955395BD5","savedDate":"2023-11-12 18:51:13.455","slug":"senior-kernel-developer-for-kernelcare-remote-work-anywhere-cloudlinux-8545"},{"id":7332409693,"title":"VP of Design","company":"Xapo61","image":"https://remotive.com/job/1831687/logo","description":"<div class='\"content-intro\"'>\n<p>Work from anywhere, impact everywhere </p>\n<p>We’re a fully distributed team of over 150 talented people that work remotely from 40+ countries around the world. We work hard, think globally, and inspire each other to learn and grow. <br>We are committed to changing the way things are done. To achieve that, we search the world for the best people for the job. This is how we are transforming the world of digital banking. </p>\n<p>Our team is worldwide, our capacity for innovation, limitless.</p>\n<p><strong>Risk is inherent in all of our business activities and managing risk well is the responsibility of every Xapien. <br>Sound risk management enables us to serve our customers and deliver value for our shareholders, and helps make Xapo a great place to work.</strong></p>\n<p><em>Although we are headquartered in Gibraltar, this is a full time, 100% remote position <br></em><em>Work from anywhere!</em></p>\n</div>\n<p><strong><em>Position overview</em></strong></p>\n<p>We’re looking for a visionary leader to design the future of a digital bank that also lets its customers seamlessly interact with crypto ecosystems. You’ll lead and grow our in-house Design team and mentor other designers across all practice areas.  The work you lead will enable Xapo Bank to launch top-notch products that have a positive impact on our customers and their ability to grow their (crypto) wealth. </p>\n<p>The VP of Design will spearhead a best-in-class user experience for our product, partnering with Product Managers, UXR, engineering and fellow designers. This is a role for a design leader with extensive experience crafting next-level (fin)tech products. Your role encompasses to inspire and elevate the other members of the design team by providing guidance and mentorship, setting an example by following best practices, bringing innovative technological ideas, and defining and ensuring proper design processes are followed. </p>\n<p>On a high-level you’ll be one of the key voices of our customers in our Leadership Team, an advocate for the importance of UCD, UX and UX research. A key challenge will be to instil more user-centricity into Xapo as an organisation. Next to leading the Design team, you will be both an ally as well as an educator for the Product team as a whole, leveraging (user) data and best practices to get our product to the next level. </p>\n<p><strong><em>Responsibilities</em></strong></p>\n<ul style=\"\">\n<li style=\"\">Be a champion for user-centricity for Xapo as a whole, especially in the Product &amp; Design teams. You’ll be an advocate for end-users and their needs, expectations &amp; pain-points</li>\n<li style=\"\">Be the UX Leader for our organisation, with the ability to influence on a senior leadership level around our product, its UX and industry best practices</li>\n<li style=\"\">Lead a talented team of user experience designers to create a “best in class” product in our unique category, hovering between traditional finance and crypto</li>\n<li style=\"\">Identify new product improvement opportunities by understanding current user frustrations and unmet needs</li>\n<li style=\"\">Collaborate with Product, UXR and our cross-functional teams on ongoing discovery, to understand client attitudes, behaviours, and needs and build fitting solutions</li>\n<li style=\"\">Take into account existing insights, technical constraints, business needs, to produce data-informed solutions that consider problems from multiple angles.</li>\n<li style=\"\">Build out a prototype-first and experimental mindset that stimulates Xapo to validate and test our designs, learning from user feedback as we go along</li>\n<li style=\"\">Be an advocate and strive for best-in-class user experience and best practices in terms of UX/UI design and design processes</li>\n</ul>\n<p><strong><em>Skills needed</em></strong></p>\n<ul style=\"\">\n<li style=\"\">Sound track record of leading and managing creative teams</li>\n<li style=\"\">Demonstratable experience driving UX Design for (fin)tech products</li>\n<li style=\"\">You have championed user-centricity before, influencing and convincing senior leadership is second nature to you</li>\n<li style=\"\">Extensive Mobile App Design experience (iOS human interface guidelines/flat design guidelines &amp; android material design), Web Design experience is a plus</li>\n<li style=\"\">Exceptional aesthetic judgement and demonstrated ability to recognize and promote excellent design that furthers users’ goals in an elegant, intuitive way</li>\n<li style=\"\">An analytical and goal-driven mind, able to balance business and customer needs and constraints</li>\n<li style=\"\">We want someone who has a keen interest in the behavioural psychology of customers</li>\n<li style=\"\">You’ll need to possess not just exceptional product design skills, but the ability to implement strategic and conceptual thinking as well</li>\n<li style=\"\">You are data driven and use quantitative as well as qualitative data sources to inform your design decisions</li>\n<li style=\"\">Ability to create rapid, iterative, and low-fi prototypes when ideating the solution or illustrating to the wider team</li>\n<li style=\"\">Having a can-do attitude is a must</li>\n<li style=\"\">You’re mindful of the bigger picture and not just small fixes in the now</li>\n</ul>\n<p><strong><em>Other requirements</em></strong></p>\n<ul style=\"\">\n<li style=\"\">A dedicated workspace.</li>\n<li style=\"\">A reliable internet connection with the fastest speed possible in your area.</li>\n<li style=\"\">Devices and other essential equipment that meet minimal technical specifications.</li>\n<li style=\"\">Alignment with Our Values and the Xapo Values-Driven Leadership principles.</li>\n</ul>\n<div class='\"content-conclusion\"'>\n<p><strong>Why work for Xapo?</strong></p>\n<p>IMPACT GLOBALLY, WORK REMOTELY.</p>\n<ul style=\"\">\n<li style=\"\"><strong>Shape the Future:</strong> Improve lives through cutting-edge technology, work 100% remotely from anywhere in the world.</li>\n<li style=\"\"><strong>Great work-life balance:</strong> Build amazing things with a balance of autonomy and collaborative teamwork. Set your own work schedule and make use of a flexible PTO plan when you need to recharge. </li>\n<li style=\"\"><strong>Expect Excellence:</strong> Collaborate, learn, and grow with a high-performance team. Learn how you learn best - from books to conferences, you’ll get a yearly budget for your individual learning and development goals.</li>\n</ul>\n</div>\n<img src=\"https://remotive.com/job/track/1831687/blank.gif?source=public_api\" alt=\"\"/>","tags":"[\"android\",\"crypto\",\"go\",\"ios\",\"UI/UX\",\"research\",\"risk management\",\"ux research\",\"banking\"]","pubDate":"2023-11-09 09:20:29.000","link":"https://remotive.com/remote-jobs/design/vp-of-design-1831687","savedDate":"2023-11-12 18:51:13.450","slug":"vp-of-design-xapo61-7442"},{"id":7940479553,"title":"Senior Software Engineer, Python (all genders)","company":"Distribusion Technologies","image":"https://remotive.com/job/1829991/logo","description":"<p dir=\"ltr\"><strong>Distribusion</strong> is the world’s leading ground transportation marketplace and gives travelers seamless access to ground transportation online, from search to ticket purchase. We have built a cutting-edge B2B technology platform that connects bus, rail, and ferry operators in 70+ countries with the biggest online retailers, including Google Maps and Booking.com.</p>\n<p dir=\"ltr\">We are shaping the future of travel and building the largest global network of transport providers and retailers. Having grown 10x in the past year, we are one of the fastest-growing startups in travel. Backed by three leading VCs (Creandum, Northzone, and Lightrock), and now, following our recent €30 m Series B, we are ready to push beyond.</p>\n<p dir=\"ltr\"> </p>\n<p dir=\"ltr\">We are currently seeking a skilled <strong>Python Software Engineer </strong>to join our team. You will create robust web services based on micro-service architecture, use many different data sources, and aggregate data from and provide into the flexible API.<br><br><strong>What you will do:</strong></p>\n<ul style=\"\">\n<li dir=\"ltr\" style=\"\">\n<p dir=\"ltr\">Design, develop, deploy, maintain, and improve the backend for interactive web applications and APIs</p>\n</li>\n<li dir=\"ltr\" style=\"\">\n<p dir=\"ltr\">Lead designs of major software components, systems and features</p>\n</li>\n<li dir=\"ltr\" style=\"\">\n<p dir=\"ltr\">Solve technically challenging problems working with high-load systems</p>\n</li>\n</ul>\n<div>\n<p dir=\"ltr\"><strong> </strong></p>\n<div><strong>Workplace:</strong></div>\n<p>Berlin (HQ) or Remote</p>\n<p>We are a remote-first international company with team members spread around the world. We are looking to hire the best talent around the Globe, so wherever you are, feel free to reach out. </p>\n<p>If, however, you prefer working onsite/hybrid, our heart is in Berlin, one of the biggest and most vibrant tech hubs in Europe, and we are happy to assist with relocation.</p>\n</div>\n<p dir=\"ltr\"><strong>Who you are:</strong></p>\n<ul style=\"\">\n<li dir=\"ltr\" style=\"\">\n<p dir=\"ltr\">You have a degree in Computer Science or a related field</p>\n</li>\n<li dir=\"ltr\" style=\"\">\n<p dir=\"ltr\">You have at least 3 years of software engineering experience with a focus on developing web applications using modern, high-performance web frameworks in Python</p>\n</li>\n<li dir=\"ltr\" style=\"\">\n<p dir=\"ltr\">General understanding of SQL databases</p>\n</li>\n<li dir=\"ltr\" style=\"\">\n<p dir=\"ltr\">You have knowledge in systems architecture and how to design an API</p>\n</li>\n<li dir=\"ltr\" style=\"\">\n<p dir=\"ltr\">You can break down complex problems and projects into manageable goal</p>\n</li>\n<li dir=\"ltr\" style=\"\">\n<p dir=\"ltr\">You are driven, ambitious, and willing to get hands-on in shaping the future of ground transportation travel</p>\n</li>\n<li dir=\"ltr\" style=\"\">\n<p dir=\"ltr\">You show ownership and responsibility for your problem space</p>\n</li>\n<li dir=\"ltr\" style=\"\">\n<p dir=\"ltr\">You are fluent in English, both verbal and written</p>\n</li>\n</ul>\n<p> </p>\n<p dir=\"ltr\"><strong>What you can expect:</strong></p>\n<ul style=\"\">\n<li dir=\"ltr\" style=\"\">\n<p dir=\"ltr\">You will join a fast-paced travel tech company and take on a rapidly growing industry.</p>\n</li>\n<li dir=\"ltr\" style=\"\">\n<p dir=\"ltr\">You will take on ownership and responsibility from day one and have a direct impact on the success of the company.</p>\n</li>\n<li dir=\"ltr\" style=\"\">\n<p dir=\"ltr\">We value agility! We’re constantly updating our tech stack and offer the best possible tools to ensure all of our in-house engineers, partners, and carriers benefit from cutting-edge, efficient solutions.</p>\n</li>\n<li dir=\"ltr\" style=\"\">\n<p dir=\"ltr\">You will work with global companies. Our product attracts the biggest names in travel technology, such as Booking.com, Google Maps, and national carriers like Amtrak, Deutsche Bahn, Renfe, and SNCF.</p>\n</li>\n<li dir=\"ltr\" style=\"\">\n<p dir=\"ltr\">You will join an international team of talented and driven people with a clear mission. Expect your colleagues to inspire, support and challenge you every day!</p>\n</li>\n<li dir=\"ltr\" style=\"\">\n<p dir=\"ltr\">We offer flexible and remote working conditions, relocation opportunities, and career growth in a small and developing company.<br><br></p>\n</li>\n</ul>\n<p dir=\"ltr\"><strong>Our hiring team:</strong></p>\n<p dir=\"ltr\">Your Talent Partner (TP) and point of contact is Ceren Volkan and the Hiring Manager (HM) is Bartosz Pranczke.<br>For any queries, please reach out to your Talent Partner at <a href=\"mailto:talent@distribusion.com\" rel=\"nofollow\" target=\"_blank\">talent@distribusion.com</a>.</p>\n<p dir=\"ltr\"><em> </em></p>\n<p dir=\"ltr\"><em>Do you want to work on a product that is used by millions of people daily with a high load, availability and scalability and most advanced technology? </em>Come join us!</p>\n<img src=\"https://remotive.com/job/track/1829991/blank.gif?source=public_api\" alt=\"\"/>","tags":"[\"api\",\"backend\",\"python\",\"sql\",\"web applications\",\"systems architecture\",\"marketplace\",\"computer science\",\"travel\"]","pubDate":"2023-11-09 07:20:29.000","link":"https://remotive.com/remote-jobs/software-dev/senior-software-engineer-python-all-genders-1829991","savedDate":"2023-11-12 18:51:13.451","slug":"senior-software-engineer-python-all-genders-distribusion-technologies-1377"}]