[{"id":4029371833,"title":"Senior Product Manager","company":"Aiwyn","image":"https://www.aiwyn.ai/hubfs/Aiwyn%20Favicon.jpg","description":"<div><b>Who is Aiwyn and what do we do?</b></div><div><br></div><div>Aiwyn is the fastest-growing software company serving the accounting profession.&nbsp;Founded in 2020, we now work with 100+ of the largest CPA firms in the world.&nbsp;Our “Job to be done”: speed up cash flow, save Partner time, &amp; deliver best-in-class client experiences. We do this by automating day-to-day firm operations with our Practice Automation solutions. Aiwyn is led by serial entrepreneurs with multiple exits and funded by a Top 10 fintech VC.</div><div><br></div><div>To learn more, visit our <b><a class=\"postings-link\" href=\"https://aiwyn.ai/\">website</a></b></div><div><br></div><div><b>Who Are You? </b></div><div><br></div><div>As our Senior Product Manager for Calculation Systems &amp; Regulatory Innovation, you'll lead the development of our core computational capabilities and regulatory solutions - the fundamental components that power our entire platform. This role offers a unique chance to leverage AI to build products that will revolutionize an industry. You'll help solve a genuine market pain point, collaborating with diverse perspectives to build something transformative, taking true ownership of critical systems, and contributing to our collective success.</div><div><b>Who is Aiwyn and what do we do?</b></div><div><br></div><div>Aiwyn is the fastest-growing software company serving the accounting profession.&nbsp;Founded in 2020, we now work with 100+ of the largest CPA firms in the world.&nbsp;Our “Job to be done”: speed up cash flow, save Partner time, &amp; deliver best-in-class client experiences. We do this by automating day-to-day firm operations with our Practice Automation solutions. Aiwyn is led by serial entrepreneurs with multiple exits and funded by a Top 10 fintech VC.</div><div><br></div><div>To learn more, visit our <b><a href=\"https://aiwyn.ai/\" class=\"postings-link\">website</a></b></div><div><br></div><div><b>Who Are You? </b></div><div><br></div><div>As our Senior Product Manager for Calculation Systems &amp; Regulatory Innovation, you'll lead the development of our core computational capabilities and regulatory solutions - the fundamental components that power our entire platform. This role offers a unique chance to leverage AI to build products that will revolutionize an industry. You'll help solve a genuine market pain point, collaborating with diverse perspectives to build something transformative, taking true ownership of critical systems, and contributing to our collective success.</div><h3>Key Responsibilities:</h3><li><b>Market &amp; User Representation</b>: Serve as the voice of the customer, deeply understanding professional service workflows, pain points, and needs</li><li><b>Hands-on Product Development</b>: Work directly with engineering and design in daily collaboration, from virtual whiteboarding sessions to code reviews</li><li><b>Product Architecture</b>: Drive the roadmap for our core calculation systems, handling complex rules and compliance requirements</li><li><b>Regulatory Innovation</b>: Lead product strategy for achieving and maintaining necessary certifications while pioneering streamlined approaches</li><li><b>SME Collaboration</b>: Design validation workflows and tools that enable professional services experts to efficiently validate AI-generated calculations and rules</li><li><b>AI/ML Integration</b>: Partner with our AI team to guide the development of machine learning capabilities</li><li><b>Data-Driven Optimization</b>: Use product analytics to measure effectiveness of validation tools and calculations, driving continuous improvement</li><li><b>Quality Assurance</b>: Create tools that enable efficient validation, testing, and quality assurance of system outputs</li><li><b>Customer Research</b>: Conduct regular interviews and feedback sessions with users to validate solutions and identify opportunities</li><h3>Qualifications:</h3><li>5+ years of product management experience, with at least 2 years working on technical products</li><li>Experience with AI/ML or data-centric products, including familiarity with machine learning concepts and applications</li><li>Strong data analysis skills and experience using product analytics to drive decision-making</li><li>Experience leading complex product initiatives from conception through launch</li><li>Strong technical aptitude with the ability to partner effectively with engineering teams</li><li>Excellent communication skills with the ability to translate between technical and business domains</li><li>Track record of collaborating with subject matter experts and stakeholders</li><li>Experience building internal tools and systems (preferred)</li><li>Background in fintech, compliance software, or regulated industries (preferred)</li><li>Remote work experience with demonstrated ability to collaborate effectively in distributed teams</li><h3>Benefits and Perks:</h3><li>The big-picture value proposition of this role is simple: join us, and you'll be paid competitively to have freedom in solving worthwhile, challenging problems alongside other A-players at a fast growing SaaS startup led by an experienced and successful co-founding team with industry experience. </li><div><br></div><div>Other benefits include:</div><li><b>Adventure travel stipend</b> - you receive a $1,000 travel reimbursement on your work anniversary each year. We encourage our team to recharge and explore the world beyond their home office walls.</li><li><b>Remote, work-from-anywhere culture</b></li><li><b>Flexible PTO</b></li><li><b>World Class health benefits</b> - we believe in fostering flourishing teams by providing benefits that go beyond the usual standards - Health, vision, dental, HSA/FSA, and mental health support.</li><li><b>Stock options</b> - every Full Time Employee has ownership in Aiwyn's future and success.</li><li><b>401(k) matching</b></li><h3>Our Values:</h3><li><b>Trust</b> - We champion transparency, welcome differing perspectives, uphold accountability, and trust that others have good intentions</li><li><b>Courage</b> - We have the courage to take calculated risks and embrace change, knowing what worked in the past won’t always work in the future</li><li><b>Impact</b> - Rooted in determination and innovation, we chase extraordinary outcomes and impactful results</li><li><b>Relentlessness</b> - We approach challenges with an unwavering resolve, never settling for mediocrity, and always striving to surpass expectations</li><h3>Learn more about Aiwyn:</h3><li><a class=\"postings-link\" href=\"https://www.aiwyn.ai/about\"><b>About us</b></a></li><li><a class=\"postings-link\" href=\"https://www.aiwyn.ai/why-aiwyn\"><b>Why Aiwyn</b></a></li><li><a class=\"postings-link\" href=\"https://www.youtube.com/@AiwynAI\"><b>YouTube page</b></a></li><div>Aiwyn is an equal opportunity employer. All qualified applicants will receive consideration for employment without regard to age, ancestry, color, family or medical care leave, gender identity or expression, genetic information, marital status, medical condition, national origin, physical or mental disability, political affiliation, protected veteran status, race, religion, sex (including pregnancy), sexual orientation, or any other characteristic protected by applicable laws, regulations and ordinances.</div><div><br></div><div>Candidate information will be treated in accordance with our CCPA privacy notice which can be found here: <a class=\"postings-link\" href=\"https://www.aiwyn.ai/ccpa\">https://www.aiwyn.ai/ccpa</a></div>","tags":"[\"management\",\"engineering\",\"aws\"]","pubDate":"2025-04-21T01:20:48.876Z","link":"https://jobs.lever.co/aiwyn/86c26dc7-2ed3-4133-94f7-42de4ed8b80d","slug":"senior-product-manager-aiwyn-8052"}]