[{"id":9248730093,"title":"Sales Development Representative","company":"Didask","image":"https://avatars.githubusercontent.com/u/14350668?s=200&v=4","description":"<h1>About Didask</h1><p style=\"min-height:1.5em\">Didask is a SaaS eLearning solution that enables organizations to create effective online training programs with ease and strong pedagogical foundations. It is the first platform on the market to integrate a pedagogical assistant, designed by our researchers based on recommendations from cognitive science research. This innovative technology generates tailored training frameworks aligned with your learners' cognitive needs and guides you step-by-step in designing adaptive learning experiences with proven educational impact.</p><p style=\"min-height:1.5em\">Our platform also leverages cutting-edge Generative AI (GenAI) capabilities, enhanced by our deep expertise in cognitive science. Unlike generic AI tools, Didask’s GenAI is specifically designed to meet the unique challenges of learning and training, ensuring outputs that are not only innovative but also scientifically grounded and pedagogically effective.</p><p style=\"min-height:1.5em\">As a French EdTech company, Didask was founded by researchers from the prestigious École Normale Supérieure (ENS) in Paris, driven by a passion for education and pedagogy. Since late 2021, we have been supported by a European investment fund that drives our growth and ambitious development projects.</p><p style=\"min-height:1.5em\">At Didask, we combine advanced research, innovative AI, and a mission to make impactful learning accessible to all. Join us to help shape the future of education!</p><p style=\"min-height:1.5em\"></p><h1><strong>Your Responsibilities : </strong></h1><p style=\"min-height:1.5em\"></p><p style=\"min-height:1.5em\">As a Sales Development Representative (SDR) at Didask, you will play a crucial role in our growth by identifying and qualifying new business opportunities. You'll be the first point of contact with potential clients, building the foundation for successful partnerships.</p><p style=\"min-height:1.5em\">Your responsibilities will include:</p><ul style=\"min-height:1.5em\"><li><p style=\"min-height:1.5em\">Manage all outbound prospecting and lead qualification activities</p></li><li><p style=\"min-height:1.5em\">Create and optimize email sequences, call cadences, and social selling campaigns using best practices</p></li><li><p style=\"min-height:1.5em\">Conduct discovery calls to understand prospects' needs and evaluate opportunities (BANT methodology)</p></li><li><p style=\"min-height:1.5em\">Schedule product demonstrations between qualified prospects and Account Executives</p></li><li><p style=\"min-height:1.5em\">Track and analyze your activities to continuously improve conversion rates</p></li><li><p style=\"min-height:1.5em\">Collaborate with our Marketing team to define outbound campaign messaging and target the right prospects</p></li><li><p style=\"min-height:1.5em\">Stay informed about industry trends and gather market intelligence</p></li></ul><p style=\"min-height:1.5em\">You will work closely with our Account Executives and marketing team, contributing directly to Didask's growth. Your success will be measured through qualified opportunities generated and conversion rates.</p><p style=\"min-height:1.5em\"></p><h1><strong>Required Profile :</strong><br /></h1><p style=\"min-height:1.5em\"><br />We're looking for a dynamic individual with proven sales abilities and strong communication skills:</p><ul style=\"min-height:1.5em\"><li><p style=\"min-height:1.5em\">Initial experience as an Inside Sales, SDR, BDR, or in B2B prospecting</p></li><li><p style=\"min-height:1.5em\">Strong verbal and written communication skills to build and maintain relationships with prospects</p></li><li><p style=\"min-height:1.5em\">Organized and autonomous, with the ability to analyze and measure your actions</p></li><li><p style=\"min-height:1.5em\">Collaborative mindset, comfortable with giving and receiving feedback</p></li><li><p style=\"min-height:1.5em\">Experience with sales tools like HubSpot, Lemlist, SalesNavigator, Aircall...</p></li><li><p style=\"min-height:1.5em\">Natural curiosity and willingness to understand the subjects you discuss</p></li><li><p style=\"min-height:1.5em\">Interest in pedagogy and e-learning is a plus</p></li><li><p style=\"min-height:1.5em\">Professional English required</p></li></ul><p style=\"min-height:1.5em\"></p><h1><strong>Package and Benefits :</strong><br /><br /></h1><h3><strong>Compensation:</strong></h3><ul style=\"min-height:1.5em\"><li><p style=\"min-height:1.5em\">Annual compensation €35K-€40K at 100% of target (depending on experience), with uncapped variable compensation for exceeding targets.</p></li><li><p style=\"min-height:1.5em\">100% health insurance coverage</p></li><li><p style=\"min-height:1.5em\">Meal vouchers</p></li><li><p style=\"min-height:1.5em\">Additional days off (RTT)</p></li><li><p style=\"min-height:1.5em\">Remote work allowance for optimal working conditions</p></li></ul><p style=\"min-height:1.5em\"></p><h3><strong>Work Organization:</strong></h3><ul style=\"min-height:1.5em\"><li><p style=\"min-height:1.5em\">Full remote possible (tax residence in France)</p></li><li><p style=\"min-height:1.5em\">Monthly meeting at Maison Didask (Paris)</p></li><li><p style=\"min-height:1.5em\">Annual seminar in attractive locations</p></li></ul><p style=\"min-height:1.5em\"></p><h3><strong>Recruitment Process</strong></h3><ol style=\"min-height:1.5em\"><li><p style=\"min-height:1.5em\">15-min qualification call and scheduling</p></li><li><p style=\"min-height:1.5em\">30-min interview with IS/SDR Team Lead (experience, motivation, cultural fit)</p></li><li><p style=\"min-height:1.5em\">30 min meeting with the 1 or 2 member of the team</p></li><li><p style=\"min-height:1.5em\">Job offer</p></li></ol><p style=\"min-height:1.5em\"></p><h1>Language and location</h1><p style=\"min-height:1.5em\">Didask is transitioning to English as our internal working language in 2025. Professional proficiency in English is required. Speaking French is optional. The team will make sure you never feel excluded if you don't.</p><p style=\"min-height:1.5em\">Unless specified otherwise, all our positions are remote-first. At the moment, we can only accept candidates who are French fiscal residents. You can work from anywhere in a timezone close to ours, as long as you have good working conditions (including a good Internet connection for fluid videoconferencing).</p>","tags":"[\"b2b\"]","pubDate":"2025-01-13T09:05:46.961Z","link":"https://jobs.ashbyhq.com/didask/315306a1-bcb6-4e2a-b186-c29e4dc0d31a","slug":"sales-development-representative-didask-72"},{"id":1753987269,"title":"NLP Data Engineer, Portfolio Strategy","company":"Nascent","image":"https://remotive.com/job/1962317/logo","description":"<p><em>About Nascent…</em></p>\n<p>Founded in 2020, Nascent exists to build, expand, and capture opportunity, in open markets and permissionless technologies. Building from a base of permanent capital, we deploy assets across a range of both liquid and long-term strategies that ensure we are among the most active users of the open financial system we are helping to build. We've made venture investments in <a href=\"https://www.nascent.xyz/portfolio\" rel=\"nofollow\">100+ early-stage teams</a> that we believe have the potential to create substantive change, expand boundaries, and find new horizons. We are consistently on the hunt for the most competitive and curious minds exploring the edges of the crypto ecosystem and leverage our hyper flexible structure to accelerate ideas into fully deployed strategies.</p>\n<p>We are looking for a <em>NLP Data Engineer, Portfolio Strategy </em> to join our team. In this role, you will work closely with our portfolio strategists, engineers and data scientists to design, develop, and implement a range of features for our automated trading systems.  This includes building and maintaining data pipelines, experimenting with models, deploying and managing subsystems and working on execution systems.  This role is end-to-end, involving R&amp;D of machine learning models as well as engineering of production systems for the deployment and operation of multiple models and data pipelines. </p>\n<p>You will have the opportunity to work on exciting projects, contribute to the development of innovative products, and grow your skills in a collaborative and supportive environment. You'll be an engineer, working in a high stakes financially driven environment- success in this role requires a competitive edge, high autonomy, strong instincts and conviction in decision making. </p>\n<p>Key Responsibilities:</p>\n<ul style=\"\"><li style=\"\">End-to-end contributions that will involve designing, building and maintaining complex software systems and pipelines</li><li style=\"\">Operate up and down the stack including work with data pipelines and model building</li><li style=\"\">Support wider team in evaluation and deployment, devops, service API's, etc.</li><li style=\"\">Ensure resilience and stability through quality code reviews, unit, regression and user acceptance testing</li><li style=\"\">Be an integral contributor to a lean agile development team</li><li style=\"\">Apply and be a proponent of quality engineering practices</li></ul>\n<p></p>\n<p>Qualifications:</p>\n<ul style=\"\"><li style=\"\">3+ years of experience and a bachelor's degree in Computer Science, Machine Learning, Data Science, or a related field (or equivalent experience)</li><li style=\"\">High level competency in Python</li><li style=\"\">Substantial experience working with NLP data pipelines, especially RAGs</li><li style=\"\">Familiarity with ML/NLP libraries and frameworks are a plus</li><li style=\"\">Background and interest in investing and/or finance </li><li style=\"\">Familiarity with version control systems (e.g., Git)</li><li style=\"\">Experience with Docker, AWS, Terraform and Kubernetes</li><li style=\"\">Excellent communication and teamwork abilities</li><li style=\"\">Eagerness to learn and adapt to new technologies and challenges</li></ul>\n<p><em>Our Team &amp; Culture</em></p>\n<p>At Nascent, we are an interdisciplinary team of investors, builders &amp; creators, capable of achieving more together than we can as individuals. We offer the opportunity to contribute to building the future global economic system with a world-class team and culture that pairs the freedom to explore, experiment &amp; play with a competitive drive to win. We invest in our people by providing the autonomy to build, coupled with accountability &amp; honest feedback to help learn, grow, perform &amp; win. We're a fully distributed team that understands the value of in-person time—we host two team retreats per year and encourage team members to come together for more frequent in-person work.</p>\n<p><em>Principles that drive our team &amp; work</em></p>\n<ul style=\"\"><li style=\"\">Compete to win</li><li style=\"\">Own your shit</li><li style=\"\">Explore, experiment, play</li><li style=\"\">Always be building</li><li style=\"\">Seek and speak truth</li></ul>\n<p><em>What We Offer</em></p>\n<p>At Nascent, we offer a competitive total compensation package heavily weighted toward bonus, ensuring that when we perform at our best and the firm wins we all win. </p>\n<ul style=\"\"><li style=\"\">The opportunity to learn, experiment and build in an entrepreneurial environment</li><li style=\"\">Remote and distributed working environment</li><li style=\"\">Comprehensive health benefits package including dental, vision, and life</li><li style=\"\">16 weeks fully paid parental leave &amp; supported return to work</li><li style=\"\">Home office setup and stipend or coworking space and wellness stipend</li><li style=\"\">Retirement plan matching contributions </li><li style=\"\">Open vacation policy as well as flexible work hours and location</li><li style=\"\">Team activities and bi-annual in-person team retreats </li></ul>\n<p><em>We are an equal opportunity employer and celebrate diversity and differences of perspectives. We do not discriminate on the basis of any status, inclusive of race, religion, color, national origin, gender, sexual orientation, age, marital status, veteran status, or disability status.</em></p>\n<p></p><img src=\"https://remotive.com/job/track/1962317/blank.gif?source=public_api\" alt=\"\"/>","tags":"[\"AWS\",\"docker\",\"python\",\"NLP\"]","pubDate":"2025-01-11T21:50:18.000Z","link":"https://remotive.com/remote-jobs/software-dev/nlp-data-engineer-portfolio-strategy-1962317","slug":"nlp-data-engineer-portfolio-strategy-nascent-226"},{"id":1832738184,"title":"Recruiter","company":"Coalition Technologies ","image":"https://remotive.com/job/1680495/logo","description":"<p class=\"h3\">WHY YOU SHOULD APPLY:</p>\n<p> </p>\n<p>Coalition Technologies is devoted to delivering clients the highest quality work while providing our team a fun, thriving, and innovative environment. Along with the opportunity for tremendous career growth and rapid advancement, CT offers:</p>\n<ul style=\"\">\n<li style=\"\">The most competitive profit-sharing bonus plan in the industry, paying up to 50% of company profits to full-time employees each month!</li>\n<li style=\"\">A highly competitive Paid Time Off plan, promoting quality work-life balance.</li>\n<li style=\"\">Subsidized gym memberships to help team members feel their best.</li>\n<li style=\"\">Medical, dental, vision, and life insurance packages for all US-based team members.</li>\n<li style=\"\">International Health Insurance Reimbursement Program for all international team members, a benefit unique to Coalition.</li>\n<li style=\"\">Device upgrade and learning reimbursement programs.</li>\n<li style=\"\">Motivating career development plans with clearly defined goals and rewards.</li>\n<li style=\"\">Additional job-specific incentives and bonuses.</li>\n</ul>\n<p>Plus, 100% of our team works remotely with the support of time tracking software. Our company culture specializes in supporting remote team members, and we’ve been doing so for more than a decade. CT welcomes your application, wherever in the world it's coming from!</p>\n<p class=\"h3\"> </p>\n<p class=\"h3\">YOU SHOULD HAVE:</p>\n<p> </p>\n<ul style=\"\">\n<li style=\"\"><li style=\"\">Prior experience with recruitment, sourcing, screening, hiring etc. International recruiting experience is a plus.</li><li style=\"\">Passion for recruitment and human resources.</li><li style=\"\">Great interpersonal, analytical, problem-solving, negotiating, influencing, facilitation, decision-making, and conflict resolution skills.</li><li style=\"\">The ability to stay highly organized with great attention to detail.</li><li style=\"\">The ability to maintain strict confidentiality and discretion.</li><li style=\"\">Excellent written and spoken English.</li><li style=\"\">The availability to work 40 hours per week from 9:00 am to 6:00 pm PST.</li><li style=\"\">Passion to build a startup.</li><li style=\"\">An outgoing and friendly disposition.</li><li style=\"\">A reliable workstation with a fast computer, microphone and speakers, reliable internet and power if working remotely.</li>\n</ul>\n<p class=\"h3\"> </p>\n<p class=\"h3\">YOUR DUTIES AND TASKS:</p>\n<p> </p>\n<ul style=\"\">\n<li style=\"\"><li style=\"\">Drafting and posting job ads.</li><li style=\"\">Reviewing resumes and screening candidates.</li><li style=\"\">Scheduling interviews and skills tests by coordinating appointments.</li><li style=\"\">Conducting interviews with candidates on Zoom.</li><li style=\"\">Administering skills tests.</li><li style=\"\">Inputting, updating and maintaining data in the recruiting database.</li><li style=\"\">Conducting exit interviews in the event that an employee leaves the company.</li><li style=\"\">Assisting management with personnel issues and employee development.</li><li style=\"\">Assisting management with organizing and coordinating employee training workshops.</li><li style=\"\">Planning and executing company events.</li><li style=\"\">Protecting operations by keeping human resource information confidential.</li><li style=\"\">Providing horizontal support to other staff members of the recruitment team.</li>\n</ul>\n<p class=\"h5\"> </p>\n<p class=\"h5\">We are looking for talented and diligent candidates who excel in our skills tests, and will consider these candidates even if past experience or educational background criteria aren't met.</p><p class=\"h5\"><br></p><p>*California, New York, Washington, and Colorado: starting base pay for this position ranges between $15 - $35 per hour.</p>\n<p>Compensation may vary based on factors such as experience, \r\nqualifications, skills test performance, geographic location, and \r\nseniority of the position offered. Outside of California, New York, \r\nWashington, and Colorado compensation may fall outside the above ranges.</p>\n<img src=\"https://remotive.com/job/track/1680495/blank.gif?source=public_api\" alt=\"\"/>","tags":"[\"CSS\",\"excel\",\"frontend\",\"git\",\"html\",\"illustrator\",\"magento\",\"photoshop\",\"php\",\"shopify\",\"wordpress\",\"MySQL\",\"startup\",\"responsive\",\"themes\",\"bootstrap\",\"insurance\",\"jQuery\",\"Ajax\"]","pubDate":"2025-01-11T19:30:56.000Z","link":"https://remotive.com/remote-jobs/hr/recruiter-1680495","slug":"recruiter-coalition-technologies-712"}]