[{"id":1819487975,"title":"Ruby Engineer","company":"Maximon","image":"https://remotive.com/job/2009160/logo","description":"<p>Are you ready to use your engineering skills to make a real difference in how we age? Join Maximon in building the future of longevity. You’ll play a key role in developing both our internal infrastructure and a brand-new, customer-facing AI Health Platform that has the potential to change lives.</p>\n<p><strong>About Us</strong></p>\n<p>Maximon is a longevity investor and company builder with the vision of becoming a leading player in the field of healthy aging and lifespan extension. We empower exceptional entrepreneurs to launch and scale science-based, impactful ventures that improve how we age.</p>\n<p><strong>Tasks and Responsibilities</strong></p>\n<ul style=\"\">\n<li style=\"\">Design, build, and maintain backend systems using Ruby<br><br></li>\n<li style=\"\">Collaborate with Maximon’s venture and operations teams to develop tools that support company building, data workflows, and automation<br><br></li>\n<li style=\"\">Implement integrations with third-party services and APIs to streamline processes<br><br></li>\n<li style=\"\">Write clean, maintainable, and well-tested code<br><br></li>\n<li style=\"\">Optimize the performance and reliability of internal platforms<br><br></li>\n<li style=\"\">Contribute to technical planning, architectural decisions, and development best practices<br><br></li>\n<li style=\"\">Support occasional product development needs for Maximon-backed ventures<br><br></li>\n</ul>\n<p><strong>You’ll Fit Right In If You Have These Skills and Values</strong></p>\n<ul style=\"\">\n<li style=\"\">Proven experience as a backend engineer working with Ruby on Rails<br><br></li>\n<li style=\"\">Strong interest in AI for healthcare and a desire to build data-driven health solutions<br><br></li>\n<li style=\"\">Passion for health, science, or longevity (a major plus)<br><br></li>\n<li style=\"\">Comfortable working in a fast-paced, remote environment with high autonomy<br><br></li>\n<li style=\"\">Ability to balance speed and quality, with a pragmatic approach to building scalable solutions<br><br></li>\n<li style=\"\">Strong communication and collaboration skills<br><br></li>\n<li style=\"\">Fluency in English<br><br></li>\n</ul>\n<p><strong>With Us as a Strong Partner by Your Side</strong></p>\n<p>At Maximon, you'll work directly with a team of proven entrepreneurs who have co-founded 20+ companies, supported multiple IPOs, and raised over EUR 2 billion in capital. You’ll help build the digital backbone that powers a growing ecosystem of ventures at the forefront of longevity science and innovation.</p>\n<p>If you're a hands-on Ruby engineer who wants to work on meaningful projects and shape the future of human health, we’d love to hear from you.</p>\n<img src=\"https://remotive.com/job/track/2009160/blank.gif?source=public_api\" alt=\"\"/>","tags":"[\"ruby\",\"scala\"]","pubDate":"2025-05-16T20:50:13.000Z","link":"https://remotive.com/remote-jobs/software-dev/ruby-engineer-2009160","slug":"ruby-engineer-maximon-4483"}]