[{"id":7584353454,"title":"SDR Lead","company":"Aiwyn","image":"https://www.aiwyn.ai/hubfs/Aiwyn%20Favicon.jpg","description":"<div><b style=\"font-size: 16px\">Who is Aiwyn and what do we do?</b></div><div><br></div><div><span style=\"font-size: 16px\">Aiwyn is transforming the way accounting firms streamline the entire revenue management lifecycle. Backed by top-tier investors (Bessemer, KKR &amp; Revolution), we’re one of the fastest-growing scale-up software companies globally—delivering innovative technology and consistently raising the bar with world-class people, processes, and products.</span></div><div><br></div><div><span style=\"font-size: 16px\">To learn more, visit our </span><a class=\"postings-link\" style=\"font-size: 16px\" href=\"https://aiwyn.ai/\"><b>website</b></a></div><div><br></div><div><b style=\"font-size: 16px\">About the Role</b></div><div><br></div><div><span style=\"font-size: 11pt;\">You’ll own the outbound pipeline generation motion and work directly with the Senior Director of Sales to build the SDR function from the ground up. You’ll play a role in defining/optimizing the channels we use, the metrics we use to measure success, and the systems we put in place to scale a high-performing outbound motion.&nbsp;This is an individual contributor role with a strategic edge. You’ll work closely with AEs, Marketing, and RevOps to identify target accounts, refine messaging, experiment with new tactics, and help define what “great” looks like for future SDRs.</span></div><div><b style=\"font-size: 16px\">Who is Aiwyn and what do we do?</b></div><div><br></div><div><span style=\"font-size: 16px\">Aiwyn is transforming the way accounting firms streamline the entire revenue management lifecycle. Backed by top-tier investors (Bessemer, KKR &amp; Revolution), we’re one of the fastest-growing scale-up software companies globally—delivering innovative technology and consistently raising the bar with world-class people, processes, and products.</span></div><div><br></div><div><span style=\"font-size: 16px\">To learn more, visit our </span><a href=\"https://aiwyn.ai/\" style=\"font-size: 16px\" class=\"postings-link\"><b>website</b></a></div><div><br></div><div><b style=\"font-size: 16px\">About the Role</b></div><div><br></div><div><span style=\"font-size: 11pt;\">You’ll own the outbound pipeline generation motion and work directly with the Senior Director of Sales to build the SDR function from the ground up. You’ll play a role in defining/optimizing the channels we use, the metrics we use to measure success, and the systems we put in place to scale a high-performing outbound motion.&nbsp;This is an individual contributor role with a strategic edge. You’ll work closely with AEs, Marketing, and RevOps to identify target accounts, refine messaging, experiment with new tactics, and help define what “great” looks like for future SDRs.</span></div><h3>What You'll Impact:</h3><li>Own outbound prospecting to drive qualified pipeline for AEs—using email, phone, video, and social to connect with senior leaders at top 500 accounting firms</li><li>Help define and refine the ideal customer profile and account prioritization strategy</li><li>Partner with Sales leadership to test, document, and scale best practices across messaging, cadences, tools, and workflows</li><li>Be a strategic voice in evaluating and implementing new sales engagement tools and GTM technologies</li><li>Collaborate with Marketing on ABM campaigns, content strategy, and event follow-up</li><li>Track activities and outcomes in Salesforce to enable clean forecasting and reporting</li><li>Lay the foundation for onboarding, enablement, and performance management for the future SDR team</li><li>Be a true ambassador of Aiwyn’s value proposition—curious, helpful, thoughtful, and prepared</li><h3>What You'll Bring From Past Experience:</h3><li>2+ years of high-performance experience as a SaaS SDR, with a proven ability to hit or exceed pipeline targets</li><li>Strong outbound prospecting skills, with experience engaging multi-stakeholder buying groups</li><li>Excellent communication skills—especially written—and comfort using video and personalization to break through</li><li>Process-minded: you enjoy figuring out how things should work and documenting them clearly</li><li>Excitement about building from zero—you're not afraid of ambiguity and are energized by early-stage ownership</li><li>Comfortable with sales tools like Salesforce, HubSpot, Apollo, Outreach, etc., and curious about what else is out there</li><li><b>Bonus:</b> Familiarity with the accounting or professional services space</li><li><b>Bonus:</b> Experience working in an early-stage or rapidly scaling startup environment</li><li><b>Bonus:</b> Experience working with a multi-product company with the ability to position all products as an integrated platform solution</li><h3>Benefits and Perks:</h3><li>The big-picture value proposition of this role is simple: join us, and you'll be paid competitively to have freedom in solving worthwhile, challenging problems alongside other A-players at a fast growing SaaS startup led by an experienced and successful co-founding team with industry experience. </li><div><br></div><div>Other benefits include:</div><li><b>Adventure travel stipend</b> - you receive a $1,000 travel reimbursement on your work anniversary each year. We encourage our team to recharge and explore the world beyond their home office walls.</li><li><b>Remote, work-from-anywhere culture</b></li><li><b>Flexible PTO</b></li><li><b>World Class health benefits</b> - we believe in fostering flourishing teams by providing benefits that go beyond the usual standards - Health, vision, dental, HSA/FSA, and mental health support.</li><li><b>Stock options</b> - every Full Time Employee has ownership in Aiwyn's future and success.</li><li><b>401(k) matching</b></li><h3>Our Values:</h3><li><b>Trust</b> - We champion transparency, welcome differing perspectives, uphold accountability, and trust that others have good intentions</li><li><b>Courage</b> - We have the courage to take calculated risks and embrace change, knowing what worked in the past won’t always work in the future</li><li><b>Impact</b> - Rooted in determination and innovation, we chase extraordinary outcomes and impactful results</li><li><b>Relentlessness</b> - We approach challenges with an unwavering resolve, never settling for mediocrity, and always striving to surpass expectations</li><h3>Learn more about Aiwyn:</h3><li><b><a class=\"postings-link\" href=\"https://www.aiwyn.ai/about\">About us</a></b></li><li><b><a class=\"postings-link\" href=\"https://www.aiwyn.ai/why-aiwyn\">Why Aiwyn</a></b></li><li><b><a class=\"postings-link\" href=\"https://www.youtube.com/@AiwynAI\">YouTube page</a></b></li><div>Aiwyn is an equal opportunity employer. All qualified applicants will receive consideration for employment without regard to age, ancestry, color, family or medical care leave, gender identity or expression, genetic information, marital status, medical condition, national origin, physical or mental disability, political affiliation, protected veteran status, race, religion, sex (including pregnancy), sexual orientation, or any other characteristic protected by applicable laws, regulations and ordinances.</div><div><br></div><div>Candidate information will be treated in accordance with our CCPA privacy notice which can be found here: <a class=\"postings-link\" href=\"https://www.aiwyn.ai/ccpa\">https://www.aiwyn.ai/ccpa</a></div>","tags":"[\"management\",\"aws\"]","pubDate":"2025-04-06T22:49:12.218Z","link":"https://jobs.lever.co/aiwyn/28e6cb4d-86d2-484b-af34-5acfc22f04db","slug":"sdr-lead-aiwyn-5039"}]