[{"id":4304384650,"title":"Pre-sales Business Analyst - Insurance (Fully Remote)","company":"CoverGo","image":"https://pbs.twimg.com/profile_images/1382655628523364355/MWPIbbID_400x400.jpg","description":"<p><strong>Top 3 Reasons To Join Us</strong></p><ul> <li>Competitive Salary</li> <li>100% Remote</li> <li>Working on the latest tech for the Insurtech Market Leader</li> </ul><h3><strong>About Us</strong></h3><p>At CoverGo, our mission is to empower all insurance companies to make insurance 100% digital and accessible to everyone.</p><ul> <li>We are a leading global no-code insurance platform for health, life, and P&amp;C</li> <li>We’re the winner of the Insurtech of the Year in all of Asia and other awards globally</li> <li>We work with insurance enterprise clients such as AXA, Bupa, MSIG, Dai-ichi, Bank of China Group Insurance, and many more</li> <li>We're an international, diverse team of over 120 people with 30 nationalities and team members working remotely from all over the world</li> <li>We are fully funded and backed by reputable VC funds and strategic institutional investors</li> <li>We have a global presence in Asia, EMEA and the Americas</li> <li>We’ve grown our annualized revenue by over 30x since January 2021</li> <li>We’re constantly working towards making CoverGo a workplace that you love coming to. We deeply believe that bringing together a diversity of thoughts, expressions, and perspectives is key to building the best culture for equally diverse communities all over the world</li> </ul><p><strong>What You Will Do:</strong></p><p>CoverGo is looking for a Pre-Sales Business Analyst that will provide support for sales activities and delivery teams, working with the solutions architects, writing proposals, solutions overviews and value propositions, translating these into offerings for delivery and then presenting them to the clients. You will therefore assist the sales team in the sales conversion process, answer RFPs, and configure simple proof of concepts of the CoverGo platform.</p><ul> <li>Requirement Gathering and Analysis - Attending discovery calls with the sales team, understanding, analyzing, and clarifying the requirements, detailed scoping of requirements.</li> <li>Research &amp; Solutioning - Technical solutions identification as per the business goals &amp; requirements expressed by the client, and based on the CoverGo platform features.</li> <li>Effort &amp; Cost Estimation - Collaborating and discussing with the engineering &amp; delivery teams to prepare the effort estimations and best solution for clients.</li> <li>Demo &amp; Proof of Concept preparation - Build &amp; configure insurance products of clients in the CoverGo platform, and demonstrate such platform capabilities &amp; features to clients.</li> <li>Presentation - Preparing techno-commercial proposals and assisting the sales team during presentation to the clients.</li> <li>Once deals are closed won by the sales team, assist on the handover process with the delivery team and lead the project kick-off meeting.</li> <li>Develop customer’s staff usage of the platform by providing technical information and training.</li> <li>Any other task that may be assigned</li> </ul><p><strong>What We Need:</strong></p><ul> <li>Bachelor's degree in Insurance, Technology, Business Administration, and/or a related field.</li> <li>2+ years experience in pre-sales or sales activities</li> <li>Strong experience working in the insurance or insurtech industry is a must.</li> <li>Exceptional presentation and communications capabilities in both written and verbal English is a must</li> <li>Confidence in presenting to a highly skilled and experienced audience, including enterprise architects and C-level executives.</li> <li>Experience participating in successful projects with cross-functional teams.</li> <li>Agile/Scrum framework for project planning &amp; release management experience.</li> <li>Ability to understand complex systems and related data to surface actionable insights, demonstrate sound judgment and decision-making skills.</li> <li>Basic understanding of technical development cycle of a mobile application, enterprise SAAS and/or web portals.</li> <li>Business analysis skills including facilitation, process documentation, requirements gathering and user acceptance testing.</li> <li>Strong organizational/time management skills to prioritize work and meet deadlines within defined timeframes.</li> <li>Performing/interpreting requirement analysis to identify value creation opportunities for clients.</li> </ul><p><strong>Why You'll Love Working Here</strong></p><ul> <li>Fully Remote</li> <li>Flexible Leave</li> <li>International Environment</li> <li>Competitive remuneration package</li> <li>Performance Bonus</li> <li>Stock Options after 6 months</li> <li>Company activities and events</li> <li>Learning and development plan</li> </ul><p><strong>CoverGo Company</strong><a href=\"https://www.youtube.com/watch?v=YI0ezLxvFvA\" rel=\"nofollow noreferrer noopener\" class=\"external\"><strong> Video</strong></a></p><h3>Requirements: </h3><h3>Benefits: </h3>","tags":"[\"management\",\"engineering\"]","pubDate":"2025-01-10T00:00:00.000Z","link":"https://apply.workable.com/covergo/j/AA3FCC2674","slug":"pre-sales-business-analyst-insurance-fully-remote-covergo-7099"},{"id":3824175805,"title":"Executive Assistant","company":"Kit","image":"https://avatars.githubusercontent.com/u/10557747?s=200&v=4","description":"&lt;div class=&quot;content-intro&quot;&gt;&lt;h4&gt;Description&lt;/h4&gt;\n&lt;div&gt;\n&lt;p class=&quot;p1&quot;&gt;Kit is an email-first operating system for creators who mean business. We help creators grow and monetize their audience with ease. For coaches, YouTubers, authors, podcasters, and other creatives, there isn’t a better marketing hub to rely on to grow audiences, automate email marketing, and sell digital products - all within one platform. More importantly, there isn’t a team more committed to helping creators earn a living.&lt;/p&gt;\n&lt;p&gt;We’re on a mission to help creators earn $1 billion using our creator marketing platform. We have always been 100% independent and 100% remote. We are proud to have built a product that our customers love, and we look for people who have enthusiasm and belief in our mission, vision, and values to join our team.&lt;/p&gt;\n&lt;p&gt;The Kit culture is one where emotional intelligence is valued, radical candor is encouraged, and where everyone works together to uphold a set of shared team principles.&lt;/p&gt;\n&lt;hr&gt;\n&lt;p&gt;&amp;nbsp;&lt;/p&gt;\n&lt;/div&gt;&lt;/div&gt;&lt;h4&gt;&lt;strong&gt;The Role&amp;nbsp;&lt;/strong&gt;&lt;/h4&gt;\n&lt;p&gt;As an executive assistant you will be a key member of the leadership team, and responsible for providing administrative support to our VP of Product and Director of Engineering.&lt;/p&gt;\n&lt;p&gt;You will be helping to ensure that our team runs smoothly and efficiently, by collaborating with the executives and their broader teams on a variety of projects, managing and streamlining current and future systems, and providing support with communication, scheduling, reporting, and more.&lt;/p&gt;\n&lt;p&gt;This is an excellent opportunity for someone with previous experience as an executive or administrative assistant for companies that are fast paced. You thrive with autonomy and are particularly good at building systems, managing moving schedules, and building strong relationships. You’re highly empathetic, able to understand the needs of others and proactively meet those needs without being asked.&lt;/p&gt;\n&lt;h4&gt;&lt;strong&gt;Responsibilities&lt;/strong&gt;&lt;/h4&gt;\n&lt;ul&gt;\n&lt;li&gt;Understand the top priorities of our executive team and help manage schedules and daily workflows to optimize for those priorities&lt;/li&gt;\n&lt;li&gt;Book travel, including proactive research and planning for meetings with customers, colleagues, and other strategic connections for our leaders&lt;/li&gt;\n&lt;li&gt;Optimize schedules to create more focused work time&lt;/li&gt;\n&lt;li&gt;Draft emails and other communications on behalf of the executive team&lt;/li&gt;\n&lt;li&gt;Manage multiple email inboxes&lt;/li&gt;\n&lt;li&gt;Assist with internal scheduling and coordination for the team for important events like Craft + Commerce annual conference, team retreats, executive in-person reviews, and board meetings&lt;/li&gt;\n&lt;li&gt;Track and update our internal systems including weekly progress reports, approving bills for payment, and expenses&lt;/li&gt;\n&lt;li&gt;Support and contribute to research projects and presentations&lt;/li&gt;\n&lt;li&gt;Assist in the creation of regular reports of the team’s key data and metrics&lt;/li&gt;\n&lt;li&gt;Plan and prepare for team meetings, take detailed notes during meetings, and disseminate action items to the team&lt;/li&gt;\n&lt;li&gt;Liaise and collaborate with executive assistants to handle requests and queries from the Executive Team&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;&lt;strong&gt;Requirements/Desired Skills&lt;/strong&gt;&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;Demonstrated experience as an executive or administrative assistant or in an equivalent role, in a fast-paced environment&lt;/li&gt;\n&lt;li&gt;Comfort with data, metrics, and creating reports&lt;/li&gt;\n&lt;li&gt;Thorough experience with scheduling, organization, time management, and travel logistics&lt;/li&gt;\n&lt;li&gt;Thoughtful, direct, and kind communication skills, both verbal and written&lt;/li&gt;\n&lt;li&gt;Strong project management skills - you’re not afraid of tight deadlines and you keep your work organized and outcome-focused&lt;/li&gt;\n&lt;li&gt;Comfort handling confidential and highly sensitive information with discretion&lt;/li&gt;\n&lt;li&gt;A calm, professional, and approachable demeanour when handling sensitive issues or tricky changes in priority&lt;/li&gt;\n&lt;li&gt;Comfort making adjustments and changes on the fly with a positive, collaborative attitude&lt;/li&gt;\n&lt;li&gt;Strong social and emotional intelligence - you enjoy cultivating relationships with all types of people&lt;/li&gt;\n&lt;li&gt;Adaptable and flexible - you’re comfortable handling miscellaneous projects and duties as needed&lt;/li&gt;\n&lt;li&gt;Be autonomous and self-motivated to work effectively in a 100% remote company.&lt;/li&gt;\n&lt;li&gt;Have enthusiasm for and belief in our &lt;a href=&quot;https://convertkit.com/mission&quot;&gt;mission, vision, and values&lt;/a&gt;.&lt;/li&gt;\n&lt;li&gt;Attend our bi-annual company retreats&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;&amp;nbsp;&lt;/p&gt;\n&lt;h4&gt;&lt;strong&gt;Benefits Section&lt;/strong&gt;&amp;nbsp;&lt;/h4&gt;\n&lt;p&gt;Kit has standardized salaries based on position, no matter where you live. For this role, we’re hiring at our level 3 ($110,000). Level is determined based on experience and our interview process.&amp;nbsp;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Perks + benefits include:&lt;/strong&gt;&lt;/p&gt;\n&lt;ul&gt;\n&lt;li data-stringify-indent=&quot;0&quot; data-stringify-border=&quot;0&quot;&gt;\n&lt;div&gt;&lt;a class=&quot;c-link&quot; href=&quot;https://www.linkedin.com/posts/nathanbarry_convertkit-compensation-model-activity-6991414959247147008-i9V3/?utm_source=share&amp;amp;utm_medium=member_desktop&quot; target=&quot;_blank&quot; data-stringify-link=&quot;https://www.linkedin.com/posts/nathanbarry_convertkit-compensation-model-activity-6991414959247147008-i9V3/?utm_source=share&amp;amp;utm_medium=member_desktop&quot; data-sk=&quot;tooltip_parent&quot;&gt;Profit Sharing&lt;/a&gt;&lt;/div&gt;\n&lt;/li&gt;\n&lt;li data-stringify-indent=&quot;0&quot; data-stringify-border=&quot;0&quot;&gt;Kit equity&lt;/li&gt;\n&lt;li data-stringify-indent=&quot;0&quot; data-stringify-border=&quot;0&quot;&gt;401k with a 5% match&lt;/li&gt;\n&lt;li data-stringify-indent=&quot;0&quot; data-stringify-border=&quot;0&quot;&gt;Monthly medical benefits up to $1,850 a month toward premiums. Dental and vision premiums covered 100%&lt;/li&gt;\n&lt;li data-stringify-indent=&quot;0&quot; data-stringify-border=&quot;0&quot;&gt;$4,000 equipment allowance for your first two years, $3,000 budget every following two years&lt;/li&gt;\n&lt;li data-stringify-indent=&quot;0&quot; data-stringify-border=&quot;0&quot;&gt;Individual learning + development budget ($3,500/year)&lt;/li&gt;\n&lt;li data-stringify-indent=&quot;0&quot; data-stringify-border=&quot;0&quot;&gt;Gender affirming benefits&lt;/li&gt;\n&lt;li data-stringify-indent=&quot;0&quot; data-stringify-border=&quot;0&quot;&gt;Childcare benefit up to $3,000 annually&lt;/li&gt;\n&lt;li data-stringify-indent=&quot;0&quot; data-stringify-border=&quot;0&quot;&gt;Twenty (20) days of paid time off during each year of employment&lt;/li&gt;\n&lt;li data-stringify-indent=&quot;0&quot; data-stringify-border=&quot;0&quot;&gt;Paid paid vacation: An after-tax bonus of $1,000 for taking five consecutive days of vacation where you’re fully unplugged from work&lt;/li&gt;\n&lt;li data-stringify-indent=&quot;0&quot; data-stringify-border=&quot;0&quot;&gt;Ten (10) paid holidays a year&lt;/li&gt;\n&lt;li data-stringify-indent=&quot;0&quot; data-stringify-border=&quot;0&quot;&gt;Two weeks of paid sick time each year, including mental health + well being days&lt;/li&gt;\n&lt;li data-stringify-indent=&quot;0&quot; data-stringify-border=&quot;0&quot;&gt;Twelve (12) weeks paid parental leave and flexible scheduling in your child’s first year&lt;/li&gt;\n&lt;li data-stringify-indent=&quot;0&quot; data-stringify-border=&quot;0&quot;&gt;Up to six weeks of paid bereavement leave, medical leave, and disaster after six months of employment, two weeks of each paid leave in your first six months&lt;/li&gt;\n&lt;li data-stringify-indent=&quot;0&quot; data-stringify-border=&quot;0&quot;&gt;Winter Break Closure: Kit closes for a week at the end of December, giving everyone a collective break to enjoy the holiday season.&amp;nbsp;&lt;em data-stringify-type=&quot;italic&quot;&gt;Essential support services remain available, with teams coordinating to ensure coverage during this period&lt;/em&gt;&lt;/li&gt;\n&lt;li data-stringify-indent=&quot;0&quot; data-stringify-border=&quot;0&quot;&gt;Four-week, paid sabbatical after five years with the team&lt;/li&gt;\n&lt;li&gt;Fantastic in-person or virtual retreats with the team twice a year&lt;/li&gt;\n&lt;/ul&gt;\n&lt;h4&gt;&lt;strong&gt;How to Apply&lt;/strong&gt;&lt;/h4&gt;\n&lt;p&gt;We usually receive a large number of applications, and our goal is to follow up with you within two weeks. You’ll hear from us either way. Here’s what you can expect from the rest of our hiring process:&lt;/p&gt;\n&lt;ol&gt;\n&lt;li&gt;A phone screen with our recruiter&lt;/li&gt;\n&lt;li&gt;Work sample&lt;/li&gt;\n&lt;li&gt;A technical interview to discuss your work sample and your technical knowledge&lt;/li&gt;\n&lt;li&gt;A culture contribution interview&lt;/li&gt;\n&lt;li&gt;A wrap-up conversation with the hiring manager&lt;/li&gt;\n&lt;li&gt;Reference checks&lt;/li&gt;\n&lt;/ol&gt;\n&lt;p&gt;We’ll keep you informed through every step. To get started, complete this application, including a cover letter and answers to the questions on the next page. We read every single application, and your cover letter and responses help put your experience into context.&lt;/p&gt;&lt;div class=&quot;content-conclusion&quot;&gt;&lt;hr&gt;\n&lt;p&gt;&amp;nbsp;&lt;/p&gt;\n&lt;p&gt;Kit is an equal opportunity employer. We value diversity in all of its forms, and we hire the best person we can for each role, no matter your personal background. Research tells us that applicants who are female or non-binary, as well as applicants who are people of color, are less likely to apply for roles they do not feel 100% qualified for. If you think you meet more than 50% of our requirements but fewer than 100% of them, please apply. We’re imperfect communicators, so think of our job postings as the starting point for discussion rather than proof that you shouldn’t apply.&lt;/p&gt;\n&lt;p&gt;Kit does not discriminate on the basis of race, sex, color, religion, age, national origin, marital status, disability, veteran status, genetic information, sexual orientation, gender identity or any other reason prohibited by law in provision of employment opportunities and benefits.&lt;/p&gt;&lt;/div&gt;","tags":"[\"management\",\"engineering\"]","pubDate":"2025-01-09T22:47:06.000Z","link":"https://job-boards.greenhouse.io/convertkit/jobs/4620051007","slug":"executive-assistant-kit-5493"},{"id":4605414068,"title":"Senior Data Platform Engineer","company":"Sardine","image":"https://avatars.githubusercontent.com/u/65879301?s=200&v=4","description":"<p style=\"min-height:1.5em\"><strong>Who we are:</strong></p><p style=\"min-height:1.5em\">We are a leader in fraud prevention and AML compliance. Our platform uses device intelligence, behavior biometrics, machine learning, and AI to stop fraud before it happens. Today, over 300 banks, retailers, and fintechs worldwide use Sardine to stop identity fraud, payment fraud, account takeovers, and social engineering scams. We have raised $75M from world-class investors including Andreessen Horowitz, Visa, Experian, FIS, and Google Ventures.</p><p style=\"min-height:1.5em\"></p><p style=\"min-height:1.5em\"><strong>Our culture:</strong></p><ul style=\"min-height:1.5em\"><li><p style=\"min-height:1.5em\">We have hubs in the Bay Area, NYC, Austin, and Toronto. However, we have a remote-first work culture. #WorkFromAnywhere</p></li><li><p style=\"min-height:1.5em\">We hire talented, self-motivated people and get out of their way</p></li><li><p style=\"min-height:1.5em\">We value performance and not hours worked. We believe you shouldn't have to miss your family dinner, your kid's school play, or doctor's appointments for the sake of adhering to an arbitrary work schedule.</p></li></ul><p style=\"min-height:1.5em\"></p><p style=\"min-height:1.5em\"><strong>Location:</strong></p><ul style=\"min-height:1.5em\"><li><p style=\"min-height:1.5em\">United States / Canada - Remote</p></li><li><p style=\"min-height:1.5em\">From Home / Beach / Mountain / Cafe / Anywhere!</p></li><li><p style=\"min-height:1.5em\">We are a remote-first company with a globally distributed team. You can find your productive zone and work from there.</p></li></ul><p style=\"min-height:1.5em\"></p><p style=\"min-height:1.5em\"><strong>About the role:</strong></p><p style=\"min-height:1.5em\">We are seeking a Senior Data Platform Engineer to design and build scalable, data-intensive applications. This role requires expertise in ingesting and transforming large datasets, creating APIs for efficient data retrieval, and developing data products that drive business insights. You will be a key player in shaping our data platform while contributing to backend engineering initiatives.</p><p style=\"min-height:1.5em\">The ideal candidate bridges the gap between traditional data engineering and backend development, building ETL pipelines, APIs, and data-driven solutions with a focus on performance and scalability.</p><p style=\"min-height:1.5em\"></p><p style=\"min-height:1.5em\"><strong>Key Responsibilities</strong>:</p><ul style=\"min-height:1.5em\"><li><p style=\"min-height:1.5em\"><strong>Large-Scale Data Processing</strong>: Design and implement ETL pipelines capable of processing terabytes of credit data efficiently.</p></li><li><p style=\"min-height:1.5em\"><strong>API Development</strong>: Develop and optimize APIs to support fast and reliable data retrieval, including both exact and partial matches.</p></li><li><p style=\"min-height:1.5em\"><strong>Storage Architecture</strong>: Architect and manage scalable storage solutions (e.g., Bigtable, BigQuery, ElasticSearch, or other NoSQL/SQL systems).</p></li><li><p style=\"min-height:1.5em\"><strong>Data Product Development</strong>: Collaborate with teams to turn raw data into actionable products, driving insights and business value.</p></li><li><p style=\"min-height:1.5em\"><strong>Data Analysis:</strong> Perform analysis on data to figure out the best use of data to provide value to clients</p></li><li><p style=\"min-height:1.5em\"><strong>Collaboration</strong>: Work closely with both internal and external stakeholders, including data science, product, and operation</p></li><li><p style=\"min-height:1.5em\"><strong>Documentation and Mentorship</strong>: Document processes, architectures, and APIs. Mentor junior engineers and foster a culture of technical excellence.</p></li></ul><p style=\"min-height:1.5em\"></p><p style=\"min-height:1.5em\"><strong>An ideal candidate has</strong>:</p><ul style=\"min-height:1.5em\"><li><p style=\"min-height:1.5em\">Bachelor’s or Master’s degree in Computer Science, Engineering, or a related field.</p></li><li><p style=\"min-height:1.5em\"><strong>Experience</strong>:</p><ul style=\"min-height:1.5em\"><li><p style=\"min-height:1.5em\">5+ years of experience in backend or data engineering roles.</p></li><li><p style=\"min-height:1.5em\">Proven experience building APIs for data access and processing large-scale datasets.</p></li><li><p style=\"min-height:1.5em\">Familiarity with credit or financial data and related compliance considerations.</p></li></ul></li><li><p style=\"min-height:1.5em\"><strong>Technical Skills</strong>:</p><ul style=\"min-height:1.5em\"><li><p style=\"min-height:1.5em\">Expertise in a modern programming language such as Go, Python, or Java.</p></li><li><p style=\"min-height:1.5em\">Strong knowledge of database systems (SQL and NoSQL), with a focus on scalable solutions like Bigtable, BigQuery, or DynamoDB.</p></li><li><p style=\"min-height:1.5em\">Deep understanding of API design principles and best practices for performance and scalability.</p></li><li><p style=\"min-height:1.5em\">Familiarity with cloud platforms (AWS, GCP, or Azure) and associated data services.</p></li><li><p style=\"min-height:1.5em\">Experience with containerization (Docker, Kubernetes) and CI/CD pipelines.</p></li></ul></li><li><p style=\"min-height:1.5em\"><strong>Soft Skills</strong>:</p><ul style=\"min-height:1.5em\"><li><p style=\"min-height:1.5em\">Strong analytical and problem-solving skills.</p></li><li><p style=\"min-height:1.5em\">Excellent communication skills to convey complex technical concepts.</p></li><li><p style=\"min-height:1.5em\">Ability to work collaboratively in a fast-paced environment.</p></li></ul></li></ul><p style=\"min-height:1.5em\"></p><p style=\"min-height:1.5em\"><strong>Nice to have:</strong></p><ul style=\"min-height:1.5em\"><li><p style=\"min-height:1.5em\">Proficiency with data processing tools (e.g., Apache Beam, Spark, Flink as well as orchestrators like Airflow).</p></li><li><p style=\"min-height:1.5em\">Knowledge of data product lifecycle management.</p></li><li><p style=\"min-height:1.5em\">Experience with schema design and managing data integrity in distributed systems.</p></li><li><p style=\"min-height:1.5em\">Familiarity with modern monitoring and observability tools.</p></li></ul><p style=\"min-height:1.5em\"></p><p style=\"min-height:1.5em\"><strong>Compensation: </strong>Base pay range of $140,000 - $160,000 + Equity with tremendous upside potential + Attractive benefits</p><p style=\"min-height:1.5em\"></p><p style=\"min-height:1.5em\"><strong>Benefits we offer:</strong></p><ul style=\"min-height:1.5em\"><li><p style=\"min-height:1.5em\">Generous compensation in cash and equity</p></li><li><p style=\"min-height:1.5em\">Early exercise for all options, including pre-vested</p></li><li><p style=\"min-height:1.5em\">Work from anywhere: Remote-first Culture</p></li><li><p style=\"min-height:1.5em\">Flexible paid time off, Year-end break, Self care days off</p></li><li><p style=\"min-height:1.5em\">Health insurance, dental, and vision coverage for employees and dependents - <em>US and Canada specific</em></p></li><li><p style=\"min-height:1.5em\">4% matching in 401k / RRSP - <em>US and Canada specific</em></p></li><li><p style=\"min-height:1.5em\">MacBook Pro delivered to your door</p></li><li><p style=\"min-height:1.5em\">One-time stipend to set up a home office — desk, chair, screen, etc.</p></li><li><p style=\"min-height:1.5em\">Monthly meal stipend</p></li><li><p style=\"min-height:1.5em\">Monthly social meet-up stipend</p></li><li><p style=\"min-height:1.5em\">Annual health and wellness stipend</p></li><li><p style=\"min-height:1.5em\">Annual Learning stipend</p></li><li><p style=\"min-height:1.5em\">Unlimited access to an expert financial advisory</p></li></ul><p style=\"min-height:1.5em\"></p><p style=\"min-height:1.5em\">Join a fast-growing company with world-class professionals from around the world. If you are seeking a meaningful career, you found the right place, and we would love to hear from you.</p>","tags":"[\"management\",\"engineering\",\"database\",\"aws\"]","pubDate":"2025-01-09T21:27:14.168Z","link":"https://jobs.ashbyhq.com/sardine/76db8051-0efe-457d-82f2-11c06d312de8","slug":"senior-data-platform-engineer-sardine-5147"},{"id":4077596210,"title":"Revenue Operations Manager, Customer Success & Support","company":"Owner","image":"https://avatars.githubusercontent.com/u/87661266?s=200&v=4","description":"<div><span style=\"font-size: 13pt\">👋 </span><b style=\"font-size: 13pt;\">About </b><b><a style=\"font-size: 13pt;\" href=\"http://owner.com/\">Owner.com</a></b></div><div><br></div><div><span style=\"font-size: 11pt;\">Owner is the all-in-one platform that restaurants use to succeed online.&nbsp;</span></div><div><br></div><div><span style=\"font-size: 11pt;\">Thousands of restaurant owners use our tools to build their website, drive online orders, create their own branded app, manage their customer relationships, and set up marketing automations.&nbsp;</span></div><div><br></div><div><span style=\"font-size: 14.6667px;\">You can think of it as Shopify meets HubSpot, but specifically for restaurants.&nbsp;</span></div><div><br></div><div><span style=\"font-size: 11pt;\">Learn more about the problems we are solving for our customers </span><a style=\"font-size: 11pt;\" href=\"https://www.owner.com/our-story\">here</a><span style=\"font-size: 11pt;\">.&nbsp;</span></div><div><br></div><div><span style=\"font-size: 13pt\">🌎</span><b style=\"font-size: 13pt;\"> Our vision</b></div><div><br></div><div><span style=\"font-size: 11pt;\">We’re starting by helping independent restaurants succeed online.</span></div><div><br></div><div><span style=\"font-size: 11pt;\">But it’s not just restaurants that need our help. All local service-based businesses are struggling with these same problems. Huge technology corporations are taking their customers, bleeding their profits, and making it hard for them to survive.</span></div><div><br></div><div><span style=\"font-size: 11pt;\">So, once we nail the solution for restaurants&nbsp;–&nbsp;we’ll scale it into every other local business type.</span></div><div><br></div><div><span style=\"font-size: 11pt;\">In the future we envision, we’ll build the technology that tens of millions of local business owners need to succeed in the digital age.</span></div><div><br></div><div><br></div><div><span style=\"font-size: 13pt\">🚀 </span><b style=\"font-size: 13pt;\">Our traction</b></div><div><br></div><div><span style=\"font-size: 11pt;\">In just over 3 years we've generated </span><span style=\"font-size: 15px;\">tens of millions in revenue, served millions of guests, and have processed hundreds of millions of orders.</span></div><div><br></div><div><span style=\"font-size: 11pt;\">More importantly, we’ve helped thousands of restaurant owners save their businesses - and not&nbsp; only survive, but thrive.</span></div><div><br></div><div><br></div><div><span style=\"font-size: 13pt\">⭐ </span><b style=\"font-size: 13pt;\">Our team</b></div><div><br></div><div><span style=\"font-size: 15px;\">Our team grew from 90 people to over 150 people in 2024. We’ve got top talent from the most successful companies in SMB software like Shopify, HubSpot, DoorDash, Procore and ServiceTitan. We’ll be scaling even faster in 2025 to keep pace with our customer growth.</span></div><div><br></div><div>How we work: Owner is a remote-first, global company with a home base in San Francisco. For some of our creative teams we prioritize in-person collaboration at our SF HQ. The rest of our employees are distributed throughout the world.</div><div><br></div><div>🫵 <b>Why we’re looking for you</b></div><div>This role will be the conduit between our Revenue Operations function and the Customer Success and Support team. This person will serve the critical role of being embedded within the function they support, documenting their process, identifying areas for improvement, and then advocating their designs to the RevOps leader according to how it will impact company-level objectives. This provides an incredible opportunity to gain deep knowledge about critical areas of the business and drive strategic change as the business grows.</div><div><br></div><div>This role is 100% remote and can be based anywhere in the United States or Canada.</div><div>🫵 <b>Why we’re looking for you</b></div><div>This role will be the conduit between our Revenue Operations function and the Customer Success and Support team. This person will serve the critical role of being embedded within the function they support, documenting their process, identifying areas for improvement, and then advocating their designs to the RevOps leader according to how it will impact company-level objectives. This provides an incredible opportunity to gain deep knowledge about critical areas of the business and drive strategic change as the business grows.</div><div><br></div><div>This role is 100% remote and can be based anywhere in the United States or Canada.</div><h3>💻 The impact you will have</h3><li>As the creator and owner of the visual map of an entire GTM function, you will be called upon to provide context and expert advice in strategic decision making</li><li>Operate as a member of the Customer Success Leadership team who can affect change within our GTM technology processes</li><li>Work closely with dedicated resources from the Data Analytics and Enablement teams to design and propose process changes</li><li>Work with the RevOps Agile Development Team to monitor progress, test and deploy process improvements to the team</li><li>Work with the Enablement Team to roll out process improvements, test and deploy process improvements to the team</li><h3>👥 Who you’ll work with</h3><li>Director of RevOps</li><li>Chief Revenue Officer</li><li>RevOps Agile Project Manager</li><li>VP of Customer Success and Support </li><li>Director of Enablement</li><h3>✅ Minimum requirements</h3><li>Salesforce Administration Proficiency (for process design and testing purposes)</li><li>Agile Methodology Experience or Certifications</li><li>5+ Years of GTM Strategy Roles</li><li>Ideally, some tenure as a customer-facing rep or front-line leader</li><div>🏆&nbsp;<b>Pay and benefits</b></div><div>The estimated base salary range for this role is below per country. This role will also include a generous equity pre-IPO equity package.</div><div><br></div><div><b>USA:</b>&nbsp;$130,000k - $160,000 USD</div><div><b>Canad</b>a: $120,000 - $140,000 CAD</div><div><br></div><div>Other benefits include comprehensive health coverage, work from anywhere (100% remote workplace), unlimited PTO - plus extra fun perks!</div><div><br></div><div><br></div><div><b><span style=\"font-size: 10px\">🚩 Notice - Employment Scams</span></b></div><div><span style=\"font-size: 10px\">Please note that any communication from our hiring team regarding job opportunities will only be made by an Owner employee with an @owner.com email address.</span></div><div><br></div><div><span style=\"font-size: 10px\">We will never ask you to provide personal or financial information, including but not limited to: your social security number, credit card numbers, passport information and other related banking information.&nbsp;If you believe you are being contacted by scammer, please mark the communication as \"phishing\" or “spam” and do not respond.</span></div><div><span style=\"font-size: 13pt\">👋 </span><b style=\"font-size: 13pt;\">About </b><b><a href=\"http://owner.com/\" style=\"font-size: 13pt;\">Owner.com</a></b></div><div><br></div><div><span style=\"font-size: 11pt;\">Owner is the all-in-one platform that restaurants use to succeed online.&nbsp;</span></div><div><br></div><div><span style=\"font-size: 11pt;\">Thousands of restaurant owners use our tools to build their website, drive online orders, create their own branded app, manage their customer relationships, and set up marketing automations.&nbsp;</span></div><div><br></div><div><span style=\"font-size: 14.6667px;\">You can think of it as Shopify meets HubSpot, but specifically for restaurants.&nbsp;</span></div><div><br></div><div><span style=\"font-size: 11pt;\">Learn more about the problems we are solving for our customers </span><a href=\"https://www.owner.com/our-story\" style=\"font-size: 11pt;\">here</a><span style=\"font-size: 11pt;\">.&nbsp;</span></div><div><br></div><div><span style=\"font-size: 13pt\">🌎</span><b style=\"font-size: 13pt;\"> Our vision</b></div><div><br></div><div><span style=\"font-size: 11pt;\">We’re starting by helping independent restaurants succeed online.</span></div><div><br></div><div><span style=\"font-size: 11pt;\">But it’s not just restaurants that need our help. All local service-based businesses are struggling with these same problems. Huge technology corporations are taking their customers, bleeding their profits, and making it hard for them to survive.</span></div><div><br></div><div><span style=\"font-size: 11pt;\">So, once we nail the solution for restaurants&nbsp;–&nbsp;we’ll scale it into every other local business type.</span></div><div><br></div><div><span style=\"font-size: 11pt;\">In the future we envision, we’ll build the technology that tens of millions of local business owners need to succeed in the digital age.</span></div><div><br></div><div><br></div><div><span style=\"font-size: 13pt\">🚀 </span><b style=\"font-size: 13pt;\">Our traction</b></div><div><br></div><div><span style=\"font-size: 11pt;\">In just over 3 years we've generated </span><span style=\"font-size: 15px;\">tens of millions in revenue, served millions of guests, and have processed hundreds of millions of orders.</span></div><div><br></div><div><span style=\"font-size: 11pt;\">More importantly, we’ve helped thousands of restaurant owners save their businesses - and not&nbsp; only survive, but thrive.</span></div><div><br></div><div><br></div><div><span style=\"font-size: 13pt\">⭐ </span><b style=\"font-size: 13pt;\">Our team</b></div><div><br></div><div><span style=\"font-size: 15px;\">Our team grew from 90 people to over 150 people in 2024. We’ve got top talent from the most successful companies in SMB software like Shopify, HubSpot, DoorDash, Procore and ServiceTitan. We’ll be scaling even faster in 2025 to keep pace with our customer growth.</span></div><div><br></div><div>How we work: Owner is a remote-first, global company with a home base in San Francisco. For some of our creative teams we prioritize in-person collaboration at our SF HQ. The rest of our employees are distributed throughout the world.</div>","tags":"[]","pubDate":"2025-01-09T18:11:38.301Z","link":"https://jobs.lever.co/owner/aae1faa2-90a7-479c-9f31-e4415ea52ea7","slug":"revenue-operations-manager-customer-success-support-owner-8104"},{"id":9134074509,"title":"Senior API Engineer","company":"Supabase","image":"https://avatars.githubusercontent.com/u/54469796?s=200&v=4","description":"<p style=\"min-height:1.5em\">Supabase is an open-source and fully remote company building developer tools for databases.</p><p style=\"min-height:1.5em\"><a target=\"_blank\" rel=\"noopener noreferrer\" class=\"notion-link-token notion-focusable-token notion-enable-hover\" href=\"https://supabase.com/features/management-api\">Management API</a>, written in <a target=\"_blank\" rel=\"noopener noreferrer\" class=\"notion-link-token notion-focusable-token notion-enable-hover\" href=\"https://www.typescriptlang.org/\">TypeScript</a>, <a target=\"_blank\" rel=\"noopener noreferrer\" class=\"notion-link-token notion-focusable-token notion-enable-hover\" href=\"https://nestjs.com/\">Nest.js</a> and for other JavaScript technologies, is a central part of every product in the Supabase stack. It allows all Supabase services and <a target=\"_blank\" rel=\"noopener noreferrer\" class=\"notion-link-token notion-focusable-token notion-enable-hover\" href=\"https://supabase.com/dashboard\">Supabase Studio</a> communicate with each other, programmatically manage your own Supabase projects and organizations, as well as integrate with 3rd party services like <a target=\"_blank\" rel=\"noopener noreferrer\" class=\"notion-link-token notion-focusable-token notion-enable-hover\" href=\"https://vercel.com/marketplace/supabase\">Vercel</a>, <a target=\"_blank\" rel=\"noopener noreferrer\" class=\"notion-link-token notion-focusable-token notion-enable-hover\" href=\"https://resend.com/supabase\">Resend</a>, or <a target=\"_blank\" rel=\"noopener noreferrer\" class=\"notion-link-token notion-focusable-token notion-enable-hover\" href=\"https://docs.lovable.dev/integrations/supabase\">Lovable</a>. We are seeking someone to help us maintain existing API, expand OAuth applications capabilities, enhance reliability, and improve overall public API experience.</p><p style=\"min-height:1.5em\"></p><h3>You will:</h3><ul style=\"min-height:1.5em\"><li><p style=\"min-height:1.5em\">Design, implement, and maintain both internal and public-facing APIs used across various Supabase products, including Studio, CLI, management APIs, and OAuth applications.</p></li><li><p style=\"min-height:1.5em\">Integrate with third-party platforms and partners, either by developing custom integrations or providing clear API points for them to connect with Supabase.</p></li><li><p style=\"min-height:1.5em\">Collaborate closely with various teams across Supabase (DevOps, Frontend, etc.) to ensure smooth integration and implementation of API functionality for the rest of the platform.</p></li><li><p style=\"min-height:1.5em\">Build and enhance testing, debugging, and monitoring tools to ensure public APIs' stability, reliability, and performance.</p></li><li><p style=\"min-height:1.5em\">Work with the dev-workflows team to enhance and improve the Branching experience, making it easier and more valuable for Supabase users.</p></li></ul><h3>You have:</h3><ul style=\"min-height:1.5em\"><li><p style=\"min-height:1.5em\">5+ years of experience in backend API development, with strong expertise in TypeScript and JavaScript (Node.js) and familiarity with modern tools and frameworks (e.g., Nest.js, Express, Vitest, Zod).</p></li><li><p style=\"min-height:1.5em\">Expertise in designing robust, scalable, and maintainable APIs, and experience with API versioning, pagination, and error handling best practices. Experience with OAuth, JWT, and API security best practices (rate limiting, CORS, etc.). is a plus.</p></li><li><p style=\"min-height:1.5em\">Good understanding of PostgreSQL and relational databases.</p></li><li><p style=\"min-height:1.5em\">Proven ability to build scalable, maintainable APIs and develop tools for testing, debugging, and monitoring API performance.</p></li><li><p style=\"min-height:1.5em\">Understanding of CI/CD pipelines, Docker, and containerized deployments to streamline API development, testing, and release processes.</p></li></ul><h3>We offer:</h3><ul style=\"min-height:1.5em\"><li><p style=\"min-height:1.5em\">100% remote work from anywhere in the world. No location-based adjustment to your salary.</p></li><li><p style=\"min-height:1.5em\">Autonomous work. We work collaboratively on projects, but you set your own pace.</p></li><li><p style=\"min-height:1.5em\">Health, Vision and Dental benefits. Supabase covers 100% of the cost for employees and 80% for dependants</p></li><li><p style=\"min-height:1.5em\">Generous Tech Allowance for any office setup you need</p></li><li><p style=\"min-height:1.5em\">Annual Education Allowance</p></li><li><p style=\"min-height:1.5em\">Annually run off-sites.</p></li></ul><h2>About the team</h2><ul style=\"min-height:1.5em\"><li><p style=\"min-height:1.5em\">We're a startup. It's unstructured.</p></li><li><p style=\"min-height:1.5em\">Collectively founded more than 30 startups.</p></li><li><p style=\"min-height:1.5em\">Globally distributed team with more than 30 different nationalities.</p></li><li><p style=\"min-height:1.5em\">We deeply believe in <a target=\"_blank\" rel=\"noopener noreferrer nofollow\" href=\"https://supabase.com/blog/2022/03/25/should-i-open-source-my-company\">the efficacy of collaborative open source</a>. We support existing communities and tools, rather than building \"yet another xx\".</p></li><li><p style=\"min-height:1.5em\">We \"dogfood\" everything. If you use it in your project, we use it in Supabase.</p></li></ul><h2>Process</h2><ul style=\"min-height:1.5em\"><li><p style=\"min-height:1.5em\">The entire process is fully remote and all communication will happen over email or via video chat.</p></li><li><p style=\"min-height:1.5em\">Once you've submitted your application, the team will review your submission and may reach out for a short screening interview over a video call.</p></li><li><p style=\"min-height:1.5em\">If you pass the screen you will be invited to up to four follow-up interviews. </p></li><li><p style=\"min-height:1.5em\">The calls:</p><ul style=\"min-height:1.5em\"><li><p style=\"min-height:1.5em\">usually take between 20-45 minutes each depending on the interviewer.</p></li><li><p style=\"min-height:1.5em\">most of the time, are all 1:1.</p></li><li><p style=\"min-height:1.5em\">will be with the founders, a member of either the growth or engineering team (depending on the role) and usually one other person from your immediate team or function.</p></li></ul></li><li><p style=\"min-height:1.5em\">Once the interviews are over, the team will meet to discuss several roles and candidates and may:</p><ul style=\"min-height:1.5em\"><li><p style=\"min-height:1.5em\">ask one or two follow-up questions over email or a quick call.</p></li><li><p style=\"min-height:1.5em\">go directly to making an offer.</p></li></ul></li></ul>","tags":"[\"postgres\",\"javascript\",\"typescript\",\"management\",\"engineering\",\"database\"]","pubDate":"2025-01-09T18:07:32.957Z","link":"https://jobs.ashbyhq.com/supabase/dde77fd4-fd02-4bb7-8042-450c5df9eb25","slug":"senior-api-engineer-supabase-1301"},{"id":6697498103,"title":"Middle Creative Designer ","company":"Ruby Labs","image":"https://media.licdn.com/dms/image/v2/D4D0BAQF7VVv61POIFw/company-logo_200_200/company-logo_200_200/0/1721937953426?e=1743033600&v=beta&t=_qAkZ_qGO7Du2NSUdHDNbUKIbz28Y1HDm1g9mwNIOnk","description":"<h1><strong>About us</strong></h1><p style=\"min-height:1.5em\">Hint is a popular astrology app with over 35 million downloads, providing hyper-personalized astrology services through its digital subscription product. The insights offered by Hint are uniquely crafted for each individual by combining the knowledge of our professional human astrologers with our AI engine.</p><p style=\"min-height:1.5em\"></p><h1><strong>About the role</strong></h1><p style=\"min-height:1.5em\">As a Creative Designer, you will be responsible for creating and designing a wide range of creatives (including static images and videos) for performance and branding campaigns across multiple platforms such as Google, Facebook, TikTok, and others. Your designs will play a crucial role in our marketing efforts, driving engagement and conversions. Experience in entertainment and fintech apps is a significant plus, as it will enable you to create designs that resonate with our target audience.</p><p style=\"min-height:1.5em\"></p><h1><strong>Responsibilities</strong></h1><ul style=\"min-height:1.5em\"><li><p style=\"min-height:1.5em\">Develop and design high-quality creatives (including static images and videos) for performance and branding campaigns across various digital channels.</p></li><li><p style=\"min-height:1.5em\">Collaborate with the marketing team to understand campaign objectives and create designs that align with our brand and marketing goals.</p></li><li><p style=\"min-height:1.5em\">Produce engaging and effective creatives for Google, Facebook, TikTok, and other advertising platforms.</p></li><li><p style=\"min-height:1.5em\">Ensure all designs adhere to brand guidelines and maintain a consistent visual identity across all marketing materials.</p></li><li><p style=\"min-height:1.5em\">Stay updated with the latest design trends, tools, and technologies to ensure our creatives are cutting-edge and effective.</p></li><li><p style=\"min-height:1.5em\">Work closely with the marketing and content teams to brainstorm and develop creative concepts and ideas.</p></li><li><p style=\"min-height:1.5em\">Manage multiple design projects simultaneously, ensuring timely delivery and high-quality output.</p></li><li><p style=\"min-height:1.5em\">Utilize feedback from stakeholders to continuously refine and improve designs.</p></li></ul><p style=\"min-height:1.5em\"></p><h1><strong>Technical qualifications</strong></h1><ul style=\"min-height:1.5em\"><li><p style=\"min-height:1.5em\"><strong>Design Software:</strong> Proficiency in Adobe Creative Suite (Photoshop, Illustrator, After Effects, Premiere Pro) and other design tools. Efficiency with AI tools is a plus.</p></li><li><p style=\"min-height:1.5em\"><strong>Video Editing and Animation:</strong> Strong skills in video editing and animation, particularly for creating engaging video ads.</p></li><li><p style=\"min-height:1.5em\"><strong>Creative Thinking:</strong> Ability to think creatively and develop innovative design concepts that capture attention and drive engagement.</p></li><li><p style=\"min-height:1.5em\"><strong>Attention to Detail:</strong> Strong attention to detail, ensuring all designs are visually appealing and free of errors.</p></li><li><p style=\"min-height:1.5em\"><strong>Time Management:</strong> Excellent time management skills, with the ability to manage multiple projects and meet deadlines.</p></li></ul><p style=\"min-height:1.5em\"></p><h1>Nice to have</h1><ul style=\"min-height:1.5em\"><li><p style=\"min-height:1.5em\">Background in fintech, with particular expertise in topics like investing, to create designs that resonate with our specific target audience.</p></li><li><p style=\"min-height:1.5em\">Background in entertainment, with particular expertise in dating apps or astrology apps.</p></li></ul><p style=\"min-height:1.5em\"></p><h1><strong>Location</strong></h1><p style=\"min-height:1.5em\">Hint operates within the CET (Central European Time) time zone. Applicants from any country are welcome to apply for the position as long as they are located within approximately ± 4 hours of CET. This ensures optimal collaboration and communication during working hours.</p><p style=\"min-height:1.5em\"></p><h1><strong>Benefits</strong></h1><p style=\"min-height:1.5em\">Discover the perks of being part of our vibrant team! We offer:</p><ul style=\"min-height:1.5em\"><li><p style=\"min-height:1.5em\"><strong>Remote Work Environment</strong>: Embrace the freedom to work from anywhere, anytime, promoting a healthy work-life balance. 🏡⏰</p></li><li><p style=\"min-height:1.5em\"><strong>Unlimited PTO</strong>: Enjoy unlimited paid time off to recharge and prioritize your well-being, without counting days. 🌴💼</p></li><li><p style=\"min-height:1.5em\"><strong>Paid National Holidays</strong>: Celebrate and relax on national holidays with paid time off to unwind and recharge. 🎉🌟</p></li><li><p style=\"min-height:1.5em\"><strong>Company-provided MacBook</strong>: Experience seamless productivity with top-notch Apple MacBooks provided to all employees who need them. 💻🚀</p></li><li><p style=\"min-height:1.5em\"><strong>Flexible Independent Contractor Agreement</strong>: Unlock the benefits of flexibility, autonomy, and entrepreneurial opportunities. Benefit from tax advantages, networking opportunities, reduced employment obligations, and the freedom to work from anywhere. Read more about it here: <a target=\"_blank\" rel=\"noopener noreferrer nofollow\" href=\"https://wiki.rubylabs.com/s/b11227c3-fa74-4c39-bd1d-3e59056a2cf4\">https://wiki.rubylabs.com/s/b11227c3-fa74-4c39-bd1d-3e59056a2cf4</a> 📈💼</p></li></ul><p style=\"min-height:1.5em\">Be part of our fast-growing team and seize this excellent opportunity for personal and professional growth!</p><p style=\"min-height:1.5em\"></p><h1><strong>Life at Hint</strong></h1><p style=\"min-height:1.5em\">By joining Hint, you’ll become part of a team that picks each other up, collaborates daily, and works hard, fast, and intelligent because they’re motivated and passionate about being the best in the industry. We thrive on innovation, push the boundaries, and are proud of our work!</p><p style=\"min-height:1.5em\"></p><p style=\"min-height:1.5em\">#Li-Remote</p>","tags":"[\"management\"]","pubDate":"2025-01-09T16:02:24.400Z","link":"https://jobs.ashbyhq.com/ruby-labs/d42ac6ad-13fc-42fe-846a-98427b206b84","slug":"middle-creative-designer-ruby-labs-7448"},{"id":3225112053,"title":"Head of Finance & Corporate","company":"Didask","image":"https://avatars.githubusercontent.com/u/14350668?s=200&v=4","description":"<h1>About Didask</h1><p style=\"min-height:1.5em\">Didask is a SaaS eLearning solution that enables organizations to create effective online training programs with ease and strong pedagogical foundations. It is the first platform on the market to integrate a pedagogical assistant, designed by our researchers based on recommendations from cognitive science research. This innovative technology generates tailored training frameworks aligned with your learners' cognitive needs and guides you step-by-step in designing adaptive learning experiences with proven educational impact.</p><p style=\"min-height:1.5em\">Our platform also leverages cutting-edge Generative AI (GenAI) capabilities, enhanced by our deep expertise in cognitive science. Unlike generic AI tools, Didask’s GenAI is specifically designed to meet the unique challenges of learning and training, ensuring outputs that are not only innovative but also scientifically grounded and pedagogically effective.</p><p style=\"min-height:1.5em\">As a French EdTech company, Didask was founded by researchers from the prestigious École Normale Supérieure (ENS) in Paris, driven by a passion for education and pedagogy. Since late 2021, we have been supported by a European investment fund that drives our growth and ambitious development projects.</p><p style=\"min-height:1.5em\">At Didask, we combine advanced research, innovative AI, and a mission to make impactful learning accessible to all. Join us to help shape the future of education!</p><h1>Job description</h1><p style=\"min-height:1.5em\"><em>Note: we describe our ideal candidate below. For an exceptional profile, this role could evolve into a Chief Financial Officer position. Please feel free to apply even if you don't think you match all items — we know these are ambitious expectations!</em></p><p style=\"min-height:1.5em\">As Head of Finance &amp; Corporate at Didask, you'll play a pivotal role in our next phase of growth. With over 65 team members today and plans to reach 100+ in the coming year, we're looking for someone to build and lead world-class finance and corporate functions while preserving the agility and transparency that make our culture unique.</p><p style=\"min-height:1.5em\">This role embodies our values of distributed ownership, radical transparency, and data-driven decision making:</p><h2>Financial Leadership</h2><p style=\"min-height:1.5em\">- Own our entire financial strategy, from daily operations to long-term planning</p><p style=\"min-height:1.5em\">- Build and maintain transparent financial models that drive decision-making across the company</p><p style=\"min-height:1.5em\">- Optimize cash management and financial operations at scale</p><p style=\"min-height:1.5em\">- Lead non-dilutive fundraising initiatives (debt, public funding, grants)</p><p style=\"min-height:1.5em\">- Lead relationships with investors, banks, and auditors with our signature transparency</p><p style=\"min-height:1.5em\">- Structure and manage our equity programs (BSA/BSPCE) to share our success</p><h2>Corporate Leadership</h2><p style=\"min-height:1.5em\">- Lead all legal and compliance matters, from contracts to corporate governance</p><p style=\"min-height:1.5em\">- Oversee and optimize our administrative operations</p><p style=\"min-height:1.5em\">- Manage our workplace strategy and facilities</p><p style=\"min-height:1.5em\">- Build and maintain relationships with key external partners (law firms, accounting firms)</p><p style=\"min-height:1.5em\">- Ensure our corporate structure supports our growth while staying lean and efficient</p><h2>Strategic Impact</h2><p style=\"min-height:1.5em\">- Partner with leadership to align financial and corporate strategy with company objectives</p><p style=\"min-height:1.5em\">- Champion data-driven decision making across the organization</p><p style=\"min-height:1.5em\">- Build scalable foundations that support both growth and cultural values</p><p style=\"min-height:1.5em\">- Be a key voice in strategic discussions, bringing both financial insight and cultural awareness</p><p style=\"min-height:1.5em\">- Embody and strengthen our culture of radical transparency in all matters</p><h2>Team Building</h2><p style=\"min-height:1.5em\">- Define and execute the long-term vision for the Finance &amp; Corporate team</p><p style=\"min-height:1.5em\">- Identify and attract key talent as we scale</p><p style=\"min-height:1.5em\">- Mentor and develop team members, fostering a culture of continuous learning</p><p style=\"min-height:1.5em\">- Create opportunities for internal growth and skill development</p><p style=\"min-height:1.5em\">- Build a team that embodies our values of transparency and distributed ownership</p><h1>Your profile</h1><p style=\"min-height:1.5em\">We're looking for someone with both strong financial expertise and a deep commitment to building transparent, scalable organizations. Here's what we expect:</p><ul style=\"min-height:1.5em\"><li><p style=\"min-height:1.5em\"><strong>Financial Excellence</strong>: You have significant experience in B2B SaaS startups, with a deep understanding of French accounting and tax regulations. You've built financial processes from the ground up, and your experience includes both equity and non-dilutive fundraising.</p></li><li><p style=\"min-height:1.5em\"><strong>Business Acumen</strong>: Beyond pure finance, you understand B2B SaaS metrics and what drives business value. You have experience with pricing strategies, unit economics, and translating business objectives into financial planning.</p></li><li><p style=\"min-height:1.5em\"><strong>Legal &amp; Corporate</strong>: You have a solid understanding of French corporate law and governance. You're experienced in managing legal matters in a high-growth environment and comfortable working with external counsel.</p></li><li><p style=\"min-height:1.5em\"><strong>Ownership Mindset</strong>: You thrive in environments where ownership is distributed and initiative is valued over hierarchy. You're comfortable making decisions with imperfect information and taking responsibility for outcomes. You believe in empowering teams through transparency rather than controlling through process.</p></li><li><p style=\"min-height:1.5em\"><strong>Communication Master</strong>: Written communication is at the heart of our culture, and you excel at it. You can make complex financial concepts accessible to non-finance stakeholders and practice radical transparency in your communications. You build trust through clear, thoughtful documentation and embrace async-first collaboration.</p></li><li><p style=\"min-height:1.5em\"><strong>Strategic &amp; Hands-on</strong>: You combine big-picture thinking with a willingness to dive into the details. You're equally comfortable building financial models and optimizing day-to-day operations. You know when to delegate and when to roll up your sleeves, always keeping our mission and values in mind.</p></li><li><p style=\"min-height:1.5em\"><strong>Growth Mindset</strong>: You're passionate about continuous learning and developing others. You see challenges as opportunities for growth and actively seek feedback. You have experience mentoring team members and creating learning opportunities.</p></li><li><p style=\"min-height:1.5em\"><strong>Tech Savvy</strong>: While not technical, you're comfortable with modern tools and excited about using technology to automate and scale operations. You have a track record of selecting and implementing tools that drive efficiency.</p></li></ul><h1>Interview process</h1><p style=\"min-height:1.5em\">Apply by answering a few written questions about your vision and expertise. Use your own words - we value authentic communication.</p><p style=\"min-height:1.5em\">If your profile catches our attention, here's what to expect:</p><ul style=\"min-height:1.5em\"><li><p style=\"min-height:1.5em\"><strong>Screening Interview</strong>: A first conversation to understand your background and motivations. We'll discuss your experience with transparent organizations and distributed ownership, and how you approach building scalable finance and corporate operations.</p></li><li><p style=\"min-height:1.5em\"><strong>Take-home Exercise</strong>: A practical challenge combining financial modeling and strategic thinking. We assess both technical skills and communication clarity, with emphasis on documentation and transparency.</p></li><li><p style=\"min-height:1.5em\"><strong>Leadership Discussion</strong>: A deeper conversation about scaling finance and corporate operations with key stakeholders. We'll explore your vision for the role and discuss concrete collaboration scenarios.</p></li><li><p style=\"min-height:1.5em\"><strong>Final Conversation</strong>: A discussion with cofounders about vision, values, and culture. We'll align on expectations and explore how you see the future of finance and corporate functions at Didask.</p></li></ul><h1>Language and location</h1><p style=\"min-height:1.5em\">Didask is transitioning to English as our internal working language in 2025. Professional proficiency in English is required. Speaking French is optional. The team will make sure you never feel excluded if you don't.</p><p style=\"min-height:1.5em\">Unless specified otherwise, all our positions are remote-first. At the moment, we can only accept candidates who are French fiscal residents. You can work from anywhere in a timezone close to ours, as long as you have good working conditions (including a good Internet connection for fluid videoconferencing).</p>","tags":"[\"finance\",\"management\",\"b2b\",\"legal\"]","pubDate":"2025-01-09T14:37:59.763Z","link":"https://jobs.ashbyhq.com/didask/066808be-36d8-46d7-9711-268b8a84ace3","slug":"head-of-finance-corporate-didask-4201"},{"id":3510086106,"title":"Fullstack Developer (NextJS/NestJS) | WinTech","company":"Ruby Labs","image":"https://media.licdn.com/dms/image/v2/D4D0BAQF7VVv61POIFw/company-logo_200_200/company-logo_200_200/0/1721937953426?e=1743033600&v=beta&t=_qAkZ_qGO7Du2NSUdHDNbUKIbz28Y1HDm1g9mwNIOnk","description":"<h1><strong>About us</strong></h1><p style=\"min-height:1.5em\">At WinTech, we are at the forefront of innovation, crafting cutting-edge consumer products that shape the future. Our diverse portfolio spans the health, education, and entertainment sectors, offering exciting opportunities to make a real impact. Our dynamic teams are the driving force behind our success, and we’re always on the lookout for passionate individuals eager to join us on this journey of transformation.</p><p style=\"min-height:1.5em\"></p><h1><strong>About the role</strong></h1><p style=\"min-height:1.5em\">We are seeking a talented and motivated <strong>Fullstack Developer</strong> with expertise in <strong>NextJS</strong> and <strong>NestJS</strong> to join our growing team. As a Fullstack Developer, you will play a vital role in designing, developing, and maintaining high-quality web applications. You will work closely with cross-functional teams to deliver scalable and efficient solutions, contributing to the growth and success of our innovative projects.</p><p style=\"min-height:1.5em\"></p><h1><strong>Key Responsibilities</strong></h1><ul style=\"min-height:1.5em\"><li><p style=\"min-height:1.5em\">Develop and maintain web applications using NextJS and NestJS.</p></li><li><p style=\"min-height:1.5em\">Write clean, efficient, and well-documented code.</p></li><li><p style=\"min-height:1.5em\">Integrate third-party APIs seamlessly into applications.</p></li><li><p style=\"min-height:1.5em\">Contribute to the design and development of application architecture.</p></li><li><p style=\"min-height:1.5em\">Collaborate with developers, designers, and testers to ensure project success.</p></li><li><p style=\"min-height:1.5em\">Solve complex problems and address bugs proactively.</p></li><li><p style=\"min-height:1.5em\">Actively participate in discussions to improve solutions and development processes.</p></li></ul><p style=\"min-height:1.5em\"></p><h1><strong>Qualifications</strong></h1><ul style=\"min-height:1.5em\"><li><p style=\"min-height:1.5em\">Minimum of 2 years of professional experience as a Fullstack Developer.</p></li><li><p style=\"min-height:1.5em\">Strong proficiency in JavaScript/TypeScript.</p></li><li><p style=\"min-height:1.5em\">Hands-on experience with NextJS and NestJS.</p></li><li><p style=\"min-height:1.5em\">Solid knowledge of databases such as PostgreSQL and MongoDB.</p></li><li><p style=\"min-height:1.5em\">Experience working with TypeORM and PrismaORM.</p></li><li><p style=\"min-height:1.5em\">Deep understanding of RESTful API principles and GraphQL.</p></li><li><p style=\"min-height:1.5em\">Proficiency with Cypress tests.</p></li><li><p style=\"min-height:1.5em\">Familiarity with the Monorepo architecture concept.</p></li><li><p style=\"min-height:1.5em\">Practical experience with Docker.</p></li><li><p style=\"min-height:1.5em\">Working knowledge of AWS services, including EC2, S3, and Lambda.</p></li><li><p style=\"min-height:1.5em\">Experience with Kafka for message consumption and publishing.</p></li><li><p style=\"min-height:1.5em\">Proficiency in CI/CD workflows and tools.</p></li><li><p style=\"min-height:1.5em\">Excellent teamwork, responsibility, and self-organization skills.</p></li></ul><p style=\"min-height:1.5em\"></p><h1><strong>Location</strong></h1><p style=\"min-height:1.5em\">WinTech operates within the CET (Central European Time) zone. Applicants from any country are welcome to apply for the position as long as they are located within approximately ± 4 hours of CET. This ensures optimal collaboration and communication during working hours.</p><p style=\"min-height:1.5em\"></p><h1><strong>Benefits</strong></h1><p style=\"min-height:1.5em\">Discover the perks of being part of our vibrant team! We offer:</p><ul style=\"min-height:1.5em\"><li><p style=\"min-height:1.5em\"><strong>Remote Work Environment:</strong> Embrace the freedom to work from anywhere, anytime, promoting a healthy work-life balance. 🏡⏰</p></li><li><p style=\"min-height:1.5em\"><strong>Unlimited PTO:</strong> Enjoy unlimited paid time off to recharge and prioritize your well-being, without counting days. 🌴💼</p></li><li><p style=\"min-height:1.5em\"><strong>Paid National Holidays:</strong> Celebrate and relax on national holidays with paid time off to unwind and recharge. 🎉🌟</p></li><li><p style=\"min-height:1.5em\"><strong>Company-provided MacBook:</strong> Experience seamless productivity with top-notch Apple MacBooks provided to all employees who need them. 💻🚀</p></li><li><p style=\"min-height:1.5em\"><strong>Flexible Independent Contractor Agreement:</strong> Unlock the benefits of flexibility, autonomy, and entrepreneurial opportunities. Benefit from tax advantages, networking opportunities, reduced employment obligations, and the freedom to work from anywhere. Read more about it here: <a target=\"_blank\" rel=\"noopener noreferrer nofollow\" href=\"https://docs.google.com/document/d/1dHF4ctKlez75whdn-ybUwP5d5Wr0BdwVrorrm_fM40Q/preview\">https://docs.google.com/document/d/1dHF4ctKlez75whdn-ybUwP5d5Wr0BdwVrorrm_fM40Q/preview</a> 📈💼</p></li></ul><p style=\"min-height:1.5em\">Be part of our fast-growing team and seize this excellent opportunity for personal and professional growth!</p><p style=\"min-height:1.5em\"></p><h1><strong>Interview Process</strong></h1><p style=\"min-height:1.5em\">After submitting your application, we conduct a thorough review which typically takes 3 to 5 days, but may occasionally take longer due to the volume of applications received. If we see a potential fit, we proceed with the following steps:</p><ul style=\"min-height:1.5em\"><li><p style=\"min-height:1.5em\">Recruiter Screening (40 minutes)</p></li><li><p style=\"min-height:1.5em\">Technical Interview (90 minutes)</p></li><li><p style=\"min-height:1.5em\">Final Interview (60 minutes)</p></li></ul><p style=\"min-height:1.5em\"></p><h1><strong>Life at WinTech</strong></h1><p style=\"min-height:1.5em\">At WinTech, you'll join a supportive and collaborative team passionate about excellence and being industry leaders. Our innovative work environment drives impactful business results as we challenge ourselves and elevate each other to achieve new heights.</p><p style=\"min-height:1.5em\">All qualified applicants will receive consideration for employment without regard to sex, gender identity, sexual orientation, race, color, religion, national origin, disability, protected Veteran status, age, or any other characteristic protected by law.</p><p style=\"min-height:1.5em\"></p><p style=\"min-height:1.5em\">#Li-Remote</p>","tags":"[\"postgres\",\"javascript\",\"typescript\",\"database\",\"mongo\",\"aws\"]","pubDate":"2025-01-09T12:49:00.764Z","link":"https://jobs.ashbyhq.com/ruby-labs/d877dbb7-fe3b-4305-b39f-2fc196325a59","slug":"fullstack-developer-nextjs-nestjs-wintech-ruby-labs-7669"},{"id":4639192525,"title":"Senior VFX Artist","company":"Buildarocketboy","image":"https://remotive.com/job/1961539/logo","description":"<div><!--block-->As a Senior VFX Artist, you will work in collaboration with variety of artists, designers and engineers to achieve the finest visual results, creating VFX that will elevate the visuals and experience in the game.</div><div><!--block--> </div><div><!--block-->Working closely with the Lead VFX Artist, Art Directors and Production team, you will ensure that your work is delivered on time and has both and exceptional look and performance in game.</div><br><br><div class=\"h3\">Key Responsibilities</div><ul style=\"\"><li style=\"\"><!--block-->Creation of high-quality visual effects to be used in gameplay and real-time cinematics.</li><li style=\"\"><!--block-->Combine traditional art aesthetics with next-gen authoring techniques to create visually compelling VFX.</li><li style=\"\"><!--block-->Stay up to date on the capabilities and workflows in Game Engine and other authoring tools as provided and used by the company.</li><li style=\"\"><!--block-->Partner with engineers and tech artists to help further enhance our art pipeline and grow our effectiveness in rapid iteration game development.</li><li style=\"\"><!--block-->Collaborate closely with lighting artists, mission scripters and cinematic artists to implement VFX in the game.</li><li style=\"\"><!--block-->Ensure VFX assets conform to the defined technical and artistic requirements.</li><li style=\"\"><!--block-->Work with production staff to manage personal deliverables, ensuring they meet the defined objectives, defined quality bar, and schedule.</li><li style=\"\"><!--block-->Mentor and inspire junior artists.</li><li style=\"\"><!--block-->Understand and adhere to the project art direction.</li><li style=\"\"><!--block-->Maintain quality and consistency across your work to meet objectives, quality bar, and schedule.</li></ul><br><br><div class=\"h3\">Requirements</div><ul style=\"\"><li style=\"\"><!--block-->Experience with crafting outstanding real-time visual effects using DCC apps and in-game VFX systems.</li><li style=\"\"><!--block-->A minimum of 5 years professional experience as an artist in the games industry.</li><li style=\"\"><!--block-->Strong experience of asset creation tools such as 3ds Max, Maya, Houdini, etc.</li><li style=\"\"><!--block-->Experience working with Unreal.</li><li style=\"\"><!--block-->A strong understanding of art fundamentals.</li><li style=\"\"><!--block-->Good understanding of lighting details, and the ability to use them in creating visual effects that support gameplay and cinematography.</li><li style=\"\"><!--block-->Strong communication skills with the capability to successfully work across multiple teams.</li><li style=\"\"><!--block-->A positive, collaborative and professional working attitude.</li><li style=\"\"><!--block-->Strong English skills, both written and verbal.</li></ul><br><br><div class=\"h3\">Benefits</div><div><!--block--><strong>Our Global Benefits &amp; Perks</strong></div><ul style=\"\"><li style=\"\"><!--block--><strong>Unlimited coaching &amp; therapy</strong> — with Oliva, to support your mental health</li><li style=\"\"><!--block--><strong>Stock Options</strong> — everyone owns a piece of our success</li><li style=\"\"><!--block--><strong>Pension scheme</strong> — up to 5% employer matched contribution to finance those golden years</li><li style=\"\"><!--block--><strong>Socials </strong>—<strong> </strong>office &amp; remote events, play sessions and company-wide parties</li><li style=\"\"><!--block--><strong>And even more benefits based on your location!</strong></li></ul><div><!--block--><br></div><div><!--block--><strong>If you’re based in the UK</strong></div><ul style=\"\"><li style=\"\"><!--block--><strong>25 Annual Leave + 8 bank holidays</strong> - we’re flexible with most bank holidays so you can use the time to celebrate what’s important to you</li><li style=\"\"><!--block--><strong>Private Medical Insuranc</strong>e - full cover with AXA</li><li style=\"\"><!--block--><strong>Healthcare Cash Plan</strong> - Level 3 cover with Medicash</li><li style=\"\"><!--block--><strong>Cycle2Work</strong> <strong>Scheme</strong> - lease a bike through us and save on tax too!</li><li style=\"\"><!--block--><strong>Electric Car Charging</strong> - electric car charging at our Port office in Edinburgh, Scotland.</li></ul><img src=\"https://remotive.com/job/track/1961539/blank.gif?source=public_api\" alt=\"\"/>","tags":"[\"3ds Max\"]","pubDate":"2025-01-09T01:50:12.000Z","link":"https://remotive.com/remote-jobs/design/senior-vfx-artist-1961539","slug":"senior-vfx-artist-buildarocketboy-4508"},{"id":7192003261,"title":"Senior Business Analyst - Insurance (Fully Remote)","company":"CoverGo","image":"https://pbs.twimg.com/profile_images/1382655628523364355/MWPIbbID_400x400.jpg","description":"<h3><strong>Top 3 Reasons To Join Us</strong></h3><ul> <li>Competitive Salary</li> <li>100% Remote</li> <li>Working on the latest tech for the Insurtech Market Leader</li> </ul><h3><strong>About Us</strong></h3><p>At CoverGo, our mission is to empower all insurance companies to make insurance 100% digital and accessible to everyone.</p><ul> <li>We are a leading global no-code insurance platform for health, life, and P&amp;C</li> <li>We’re the winner of the Insurtech of the Year in all of Asia and other awards globally</li> <li>We work with insurance enterprise clients such as AXA, Bupa, MSIG, Dai-ichi, Bank of China Group Insurance, and many more</li> <li>We're an international, diverse team of over 120 people with 30 nationalities and team members working remotely from all over the world</li> <li>We are fully funded and backed by reputable VC funds and strategic institutional investors</li> <li>We have a global presence in Asia, EMEA and the Americas</li> <li>We’ve grown our annualized revenue by over 30x since January 2021</li> <li>We’re constantly working towards making CoverGo a workplace that you love coming to. We deeply believe that bringing together a diversity of thoughts, expressions, and perspectives is key to building the best culture for equally diverse communities all over the world</li> </ul><h3><strong>What You Will Do:</strong></h3><ul> <li>Work with clients and technical resources to identify their business problems and develop the right approach and analytical solution</li> <li>Plan and design simple to semi-complex business processes and system modifications</li> <li>Make recommendations to improve and support business activities</li> <li>Gather business requirements through a variety of techniques such as work sessions and interviews then analyze and document client complex business requirements and processes; communicate these requirements to appropriate parties</li> <li>Create complex test case scenarios to be used in testing; monitor/oversee the testing of business applications to verify that all client requirements are incorporated into the system design</li> <li>Develop business requirements documents/user stories to support the required modifications</li> <li>May plan, allocate and monitor work of other business analysts</li> <li>Understand simple to complex systems and related data to surface actionable insights, demonstrate sound judgment and decision-making skills</li> <li>Assist in providing time estimates for project related tasks</li> <li>Aid in updating process and procedural documentation</li> <li>Develop basic understanding of technical development cycle of mobile application or web portals</li> <li>Support QA, UAT and Release phases of the project via defect analysis, change maintenance, etc.</li> <li>Any other task that may be assigned</li> </ul><h3><strong>What We Need:</strong></h3><ul> <li>Minimum 5 years of experience as Business Analyst</li> <li>A degree in Business, IT or any relevant field</li> <li>Previous experience working in the insurance industry (health, life, P&amp;C) is required </li> <li>Insurtech experience is preferred</li> <li>Health Insurance-related domain certification from INS/LOMA or III is an added advantage</li> <li>Knowledge of business analysis concepts of defining requirements, translating to technical solutions, and Agile approach to prioritizing work to epics, sprints</li> <li>Business analysis skills including facilitation, process documentation, requirements gathering and user acceptance testing</li> <li>Good organizational/time management skills to prioritize work and meet deadlines within defined timeframes</li> <li>Experience in an Agile and/or Scrum environment is a must</li> <li>Basic knowledge in generating process documentation, and document system functionality, data integration, and workflow</li> <li>Excellent written and verbal communication skills in English</li> <li>Technical writing skills is a plus</li> </ul><h3><strong>Why You'll Love Working Here</strong></h3><ul> <li>Fully Remote</li> <li>Flexible Leave</li> <li>International Environment</li> <li>Competitive renumeration package</li> <li>Performance Bonus</li> <li>Stock Options after 6 months </li> <li>Company activities and events</li> <li>Learning and development plan</li> <li>Remote work allowance</li> </ul><p><strong>CoverGo Company </strong><a href=\"https://www.youtube.com/watch?v=YI0ezLxvFvA\" rel=\"nofollow noreferrer noopener\" class=\"external\"><strong>Video</strong></a></p><p>By submitting your application, you confirm that you have read, understood, and accepted the content of CoverGo’s <a href=\"https://apply.workable.com/covergo/gdpr_policy?lng=en\" target=\"_blank\" rel=\"nofollow noreferrer noopener\" class=\"external\">Privacy Notice</a> and you consent to the processing of your data as part of this application.</p><p><a href=\"https://www.youtube.com/watch?v=YI0ezLxvFvA\" rel=\"nofollow noreferrer noopener\" class=\"external\"></a></p><h3>Requirements: </h3><h3>Benefits: </h3>","tags":"[\"management\"]","pubDate":"2025-01-09T00:00:00.000Z","link":"https://apply.workable.com/covergo/j/8DE51E634F","slug":"senior-business-analyst-insurance-fully-remote-covergo-1774"},{"id":9724194236,"title":"Digital Insurance Project Manager (Fully Remote)","company":"CoverGo","image":"https://pbs.twimg.com/profile_images/1382655628523364355/MWPIbbID_400x400.jpg","description":"<p><strong>Top 3 Reasons To Join Us</strong></p><ul> <li>Competitive Salary</li> <li>100% Remote</li> <li>Working on the latest tech for the Insurtech Market Leader</li> </ul><p><strong>About Us</strong></p><p>At CoverGo, our mission is to empower all insurance companies to make insurance 100% digital and accessible to everyone.</p><ul> <li>We are a leading global no-code insurance platform for health, life, and P&amp;C</li> <li>We’re the winner of the Insurtech of the Year in all of Asia and other awards globally</li> <li>We work with insurance enterprise clients such as AXA, Bupa, MSIG, Dai-ichi, Bank of China Group Insurance, and many more</li> <li>We're an international, diverse team of over 120 people with 30 nationalities and team members working remotely from all over the world</li> <li>We are fully funded and backed by reputable VC funds and strategic institutional investors</li> <li>We have a global presence in Asia, EMEA and the Americas</li> <li>We’ve grown our annualized revenue by over 30x since January 2021</li> <li>We’re constantly working towards making CoverGo a workplace that you love coming to. We deeply believe that bringing together a diversity of thoughts, expressions, and perspectives is key to building the best culture for equally diverse communities all over the world and a workplace that you love coming to. We deeply believe that bringing together a diversity of thoughts, expressions, and perspectives is key to building the best culture for equally diverse communities all over the world</li> </ul><p><strong>About the Role</strong></p><p>As a Digital Insurance Project Manager, your core responsibility will be to oversee and manage the implementation of new and/or existing projects within CoverGo's operations. This role presents an exciting opportunity for an individual with a strong drive to lead transformative projects in the insurtech industry. </p><p><strong>What You Will Do</strong></p><ul> <li>Engage and manage relationships with clients and stakeholders</li> <li>Lead project planning sessions with the internal team and client's staff</li> <li>Support solution proposals for client pursuits, proposals, and PoCs</li> <li>Participate in proposal and POC processes (i.e. design, submission, and review)</li> <li>Support the creation of contracts and related communication with clients</li> <li>Identify and help secure growth opportunities for existing clients</li> <li>Manage project progress and adapt work as required</li> <li>Ensure projects meet deadlines</li> <li>Manage relationships with clients and stakeholders</li> <li>Host regular/weekly project review and create reports with key metrics about team and project status using company standard metrics</li> <li>Oversee all incoming and outgoing project documentation</li> <li>Identify and manage issues, risks, assumptions, and dependencies</li> <li>Continuously optimize and improve processes and the overall approach where necessary</li> </ul><p><strong>What We Need</strong></p><ul> <li>Bachelor's degree in computer science or a related technical field is a plus</li> <li>5+ years experience as a Project Manager</li> <li>Insurance domain knowledge is a must</li> <li>Strong client facing experience is a must</li> <li>Technical skills are a plus</li> <li>Has experience seeing projects through the full life cycle</li> <li>Excellent analytical skills and problem-solving skills</li> <li>Strong interpersonal skills and extremely resourceful</li> <li>Proven ability to complete projects according to outlined scope, budget, and timeline</li> <li>Self-motivated and able to work independently</li> <li>Able, willing, and excited to work in a fast-paced collaborative startup environment</li> <li>Must be based in India</li> </ul><p><strong>Why You'll Love Working Here</strong></p><ul> <li>Fully Remote</li> <li>Flexible Leave</li> <li>International Environment</li> <li>Competitive renumeration package</li> <li>Performance Bonus</li> <li>Company activities and events</li> <li>Learning and development plan</li> <li>Remote work allowance</li> </ul><p><strong>CoverGo Company </strong><a href=\"https://www.youtube.com/watch?v=YI0ezLxvFvA\" rel=\"nofollow noreferrer noopener\" class=\"external\"><strong>Video</strong></a></p><p>By submitting your application, you confirm that you have read, understood, and accepted the content of CoverGo’s <a href=\"https://apply.workable.com/covergo/gdpr_policy?lng=en\" target=\"_blank\" rel=\"nofollow noreferrer noopener\" class=\"external\">Privacy Notice</a> and you consent to the processing of your data as part of this application.</p><p><a href=\"https://www.youtube.com/watch?v=YI0ezLxvFvA\" rel=\"nofollow noreferrer noopener\" class=\"external\"></a></p><h3>Requirements: </h3><h3>Benefits: </h3>","tags":"[]","pubDate":"2025-01-09T00:00:00.000Z","link":"https://apply.workable.com/covergo/j/FBB3B95B84","slug":"digital-insurance-project-manager-fully-remote-covergo-6967"},{"id":1089137621,"title":"Senior Business Analyst - Insurance (Fully Remote)","company":"CoverGo","image":"https://pbs.twimg.com/profile_images/1382655628523364355/MWPIbbID_400x400.jpg","description":"<h3><strong>Top 3 Reasons To Join Us</strong></h3><ul> <li>Competitive Salary</li> <li>100% Remote</li> <li>Working on the latest tech for the Insurtech Market Leader</li> </ul><h3><strong>About Us</strong></h3><p>At CoverGo, our mission is to empower all insurance companies to make insurance 100% digital and accessible to everyone.</p><ul> <li>We are a leading global no-code insurance platform for health, life, and P&amp;C</li> <li>We’re the winner of the Insurtech of the Year in all of Asia and other awards globally</li> <li>We work with insurance enterprise clients such as AXA, Bupa, MSIG, Dai-ichi, Bank of China Group Insurance, and many more</li> <li>We're an international, diverse team of over 120 people with 30 nationalities and team members working remotely from all over the world</li> <li>We are fully funded and backed by reputable VC funds and strategic institutional investors</li> <li>We have a global presence in Asia, EMEA and the Americas</li> <li>We’ve grown our annualized revenue by over 30x since January 2021</li> <li>We’re constantly working towards making CoverGo a workplace that you love coming to. We deeply believe that bringing together a diversity of thoughts, expressions, and perspectives is key to building the best culture for equally diverse communities all over the world</li> </ul><h3><strong>What You Will Do:</strong></h3><ul> <li>Work with clients and technical resources to identify their business problems and develop the right approach and analytical solution</li> <li>Plan and design simple to semi-complex business processes and system modifications</li> <li>Make recommendations to improve and support business activities</li> <li>Gather business requirements through a variety of techniques such as work sessions and interviews then analyze and document client complex business requirements and processes; communicate these requirements to appropriate parties</li> <li>Create complex test case scenarios to be used in testing; monitor/oversee the testing of business applications to verify that all client requirements are incorporated into the system design</li> <li>Develop business requirements documents/user stories to support the required modifications</li> <li>May plan, allocate and monitor work of other business analysts</li> <li>Understand simple to complex systems and related data to surface actionable insights, demonstrate sound judgment and decision-making skills</li> <li>Assist in providing time estimates for project related tasks</li> <li>Aid in updating process and procedural documentation</li> <li>Develop basic understanding of technical development cycle of mobile application or web portals</li> <li>Support QA, UAT and Release phases of the project via defect analysis, change maintenance, etc.</li> <li>Any other task that may be assigned</li> </ul><h3><strong>What We Need:</strong></h3><ul> <li>Minimum 5 years of experience as Business Analyst</li> <li>A degree in Business, IT or any relevant field</li> <li>Previous experience working in the insurance industry is required (Insurtech or health insurance experience is preferred)</li> <li>Health Insurance-related domain certification from INS/LOMA or III is an added advantage</li> <li>Knowledge of business analysis concepts of defining requirements, translating to technical solutions, and Agile approach to prioritizing work to epics, sprints</li> <li>Business analysis skills including facilitation, process documentation, requirements gathering and user acceptance testing</li> <li>Good organizational/time management skills to prioritize work and meet deadlines within defined timeframes</li> <li>Experience in an Agile and/or Scrum environment is a must</li> <li>Basic knowledge in generating process documentation, and document system functionality, data integration, and workflow</li> <li>Excellent written and verbal communication skills in English</li> <li>Technical writing skills are a plus</li> </ul><h3><strong>Why You'll Love Working Here</strong></h3><ul> <li>Fully Remote</li> <li>Flexible Leave</li> <li>International Environment</li> <li>Competitive renumeration package</li> <li>Performance Bonus</li> <li>Stock Options after 6 months </li> <li>Company activities and events</li> <li>Learning and development plan</li> <li>Remote work allowance</li> </ul><p><strong>CoverGo Company </strong><a href=\"https://www.youtube.com/watch?v=YI0ezLxvFvA\" rel=\"nofollow noreferrer noopener\" class=\"external\"><strong>Video</strong></a></p><p>By submitting your application, you confirm that you have read, understood, and accepted the content of CoverGo’s <a href=\"https://apply.workable.com/covergo/gdpr_policy?lng=en\" target=\"_blank\" rel=\"nofollow noreferrer noopener\" class=\"external\">Privacy Notice</a> and you consent to the processing of your data as part of this application.</p><p><a href=\"https://www.youtube.com/watch?v=YI0ezLxvFvA\" rel=\"nofollow noreferrer noopener\" class=\"external\"></a></p><h3>Requirements: </h3><h3>Benefits: </h3>","tags":"[\"management\"]","pubDate":"2025-01-09T00:00:00.000Z","link":"https://apply.workable.com/covergo/j/524371EB2C","slug":"senior-business-analyst-insurance-fully-remote-covergo-7527"}]