[{"id":1325833925,"title":"Product Designer, Evergreen (Senior/Staff)","company":"BioRender","image":"https://yt3.googleusercontent.com/8szApiN8P0n8pp0GeXj_z9R4Wh1gJBGW5OJZDocvTtvuCF69U0Q4h2lXDct74mL2_F7vuUwKMA","description":"<p style=\"min-height:1.5em\">At BioRender, our mission is to accelerate the world’s ability to learn, discover and communicate science. We are passionate about democratizing science communication in order to accelerate scientific discovery and understanding. We're looking for amazing people to help create the world’s go-to-place and platform where science is communicated. Come join us!</p><p style=\"min-height:1.5em\"></p><p style=\"min-height:1.5em\">You can think of BioRender as the ‘Figma/Canva for scientists’, with a suite of web-based graphics communication products to empower scientists to create beautiful scientific visuals and presentations with ease.</p><p style=\"min-height:1.5em\"></p><p style=\"min-height:1.5em\">Co-founded by <a target=\"_blank\" rel=\"noopener noreferrer nofollow\" href=\"https://www.linkedin.com/in/shizukaaoki/\">Shiz Aoki</a>, a world-renowned Medical Illustrator, our team has continuously put user experience and design at the core of our product development process. BioRender is design and UX first, and it’s ingrained into our company DNA.</p><p style=\"min-height:1.5em\"></p><p style=\"min-height:1.5em\">Our Product Design team is critical to how we build products. Our Product Designers are deeply involved in crafting our user experience from idea conception to product development, product delivery, and continuous iteration &amp; improvement of the product experience. We’re looking for a Product Designer to obsess over how to make scientific communication better.</p><p style=\"min-height:1.5em\"></p><p style=\"min-height:1.5em\"><strong>What you'll do at BioRender:</strong></p><ul style=\"min-height:1.5em\"><li><p style=\"min-height:1.5em\">Own the end-to-end user experience of an area of our product and how it integrates with the rest of our product suite.</p></li><li><p style=\"min-height:1.5em\">Talk to users and obsess over user feedback and usage data to design user experiences that will create raving fans.</p></li><li><p style=\"min-height:1.5em\">Partner with Product and Data Science to determine what will make the product a critical part of industry scientists' software stack.</p></li><li><p style=\"min-height:1.5em\">Proactively seek, facilitate, and apply feedback from customers, engineers and cross-functional partners to iterate on designs and foster a culture of design collaboration within your team.</p></li><li><p style=\"min-height:1.5em\">Determine if and when product areas or information architecture may need to be revisited in order to achieve long-term success and evaluate the cost-benefit of those tough decisions.</p></li><li><p style=\"min-height:1.5em\">Be an active member of the BioRender Product Design team that critiques and drives continuous evolution of the overall design of our product, design system, and design practices.</p><p style=\"min-height:1.5em\"></p></li></ul><p style=\"min-height:1.5em\"><strong>Our ideal fit:</strong></p><ul style=\"min-height:1.5em\"><li><p style=\"min-height:1.5em\">4+ years as a product designer on a SaaS product</p></li><li><p style=\"min-height:1.5em\">Experience developing, launching, and iterating on a highly ambiguous and broad product surface area that may take multiple months to develop, iterate, and get adoption.</p></li><li><p style=\"min-height:1.5em\">Experience leading user research, from planning to execution to synthesis, in order to get clarity on what the best next steps are in order to optimize the success of the product.</p></li><li><p style=\"min-height:1.5em\">Experience and track record of building simple user experiences in a complex domain </p></li><li><p style=\"min-height:1.5em\">Experience designing scalable user experiences and design systems that support a wide array of functionality and can be easily extended as requirements change and number of features grows</p></li><li><p style=\"min-height:1.5em\">Science background is a plus, but is not required. Curiosity and a desire to learn about science and scientists' workflows is a must.</p></li></ul><p style=\"min-height:1.5em\"></p><p style=\"min-height:1.5em\"><strong>Why join us?</strong></p><ul style=\"min-height:1.5em\"><li><p style=\"min-height:1.5em\">We are mission-driven, and work collaboratively towards our shared vision of improving scientific communication and accelerating scientific discovery: BioRender figures have appeared in more than 54,000 publications! </p></li><li><p style=\"min-height:1.5em\">It’s a product that users love! We have a world-class NPS and a community of loyal fans. Check out our Testimonials page to see what our customers are saying about us: <a target=\"_blank\" rel=\"noopener noreferrer\" class=\"postings-link\" href=\"https://biorender.com/testimonials/\">https://biorender.com/testimonials/</a> </p></li><li><p style=\"min-height:1.5em\">We are in the top quartile for profitability and year-over-year revenue growth, with users in 200+ countries.</p></li><li><p style=\"min-height:1.5em\">BioRender is an equal opportunity employer, and an inclusive hiring process and work environment is a part of our DNA. </p></li><li><p style=\"min-height:1.5em\">We’re remote-first and have team members across Canada and the United States. A physical office in Toronto is available, but you have the flexibility to work from anywhere. </p></li><li><p style=\"min-height:1.5em\">We’re backed by top investors, accelerators, and some of the most successful life science entrepreneurs and philanthropists in the world including Y Combinator, Malala Fund founders, and Fifty Years VC. </p></li><li><p style=\"min-height:1.5em\">We are committed to building a warm, inclusive, and diverse environment. Check out how we make sure our employees come first!</p></li></ul><p style=\"min-height:1.5em\"></p><p style=\"min-height:1.5em\">If your interest is piqued, please apply. We'd love to hear from you. Also, be sure to check out other listings on our Careers page. </p><p style=\"min-height:1.5em\"><br />BioRender is now remote-first, with plans to bring everyone together at our Toronto office a few times each year.</p><p style=\"min-height:1.5em\"><br />We are committed to providing work environments which promote the health, safety and well-being of all employees in accordance with public health regulation and guidance.</p><p style=\"min-height:1.5em\"><br /><em>BioRender is an equal opportunity employer and, as such, does not discriminate on the basis of race, colour, religion, sex, national origins, age, sexual orientation, disability or any other characteristic protected by applicable laws.  Selection decisions are solely based on job-related factors.</em></p><p style=\"min-height:1.5em\"></p><p style=\"min-height:1.5em\">Read more about our <a target=\"_blank\" rel=\"noopener noreferrer\" class=\"postings-link\" href=\"https://biorender.notion.site/BioRender-Candidate-Resources-8255c155797f442a950720a33b4764d5\">BioRender interview process &amp; FAQs here!</a></p><p style=\"min-height:1.5em\"></p><p style=\"min-height:1.5em\">Check out what it's like to work at BioRender in <a target=\"_blank\" rel=\"noopener noreferrer\" class=\"postings-link\" href=\"https://biorender.notion.site/Working-at-BioRender-as-a-Canada-Based-Employee-f6e12ab844154bb9948b22b32e3f0c70\">Canada</a> and the <a target=\"_blank\" rel=\"noopener noreferrer\" class=\"postings-link\" href=\"https://biorender.notion.site/Working-at-BioRender-as-a-U-S-Based-Employee-4ab2cc8e48f546f89aa98c318bccebc9\">US</a>!</p><p style=\"min-height:1.5em\"><br />#LI-HC1</p>","tags":"[\"B2C\",\"aws\"]","pubDate":"2024-08-12 01:40:31.538","link":"https://jobs.ashbyhq.com/biorender/bfb6295f-1a0b-400b-9749-205a58634107","savedDate":"2024-08-12 01:40:31.538","slug":"product-designer-evergreen-senior-staff-biorender-8432"},{"id":6110320879,"title":"Graphic Designer","company":"BioRender","image":"https://yt3.googleusercontent.com/8szApiN8P0n8pp0GeXj_z9R4Wh1gJBGW5OJZDocvTtvuCF69U0Q4h2lXDct74mL2_F7vuUwKMA","description":"<p style=\"min-height:1.5em\">At BioRender, our mission is to accelerate the world’s ability to learn, discover and communicate science. We are passionate about democratizing science communication in order to accelerate scientific discovery and understanding. We're looking for amazing people to help create the world’s go-to-place and platform where science is communicated. Come join us!</p><p style=\"min-height:1.5em\"></p><p style=\"min-height:1.5em\">You can think of BioRender as the ‘Figma/Canva for scientists’, with a suite of web-based graphics communication products to empower scientists to create beautiful scientific visuals and presentations with ease.</p><p style=\"min-height:1.5em\"></p><p style=\"min-height:1.5em\">Our goal as a team is to empower users and our internal team to fully leverage BioRender by creating high-quality content that adds significant value (valuable enough that it can function as a standalone product).</p><p style=\"min-height:1.5em\"></p><p style=\"min-height:1.5em\">The Multimedia Graphic Designer (Marketing) will contribute to this mission by creating visually compelling and scientifically accurate multimedia content. This includes static graphics, GIFs, and videos, tailored for platforms such as LinkedIn, Instagram Reels, Reddit, and YouTube. The aim is to capture the ‘wow’ moments of BioRender, enhancing our marketing efforts and clearly communicating the value of BioRender to customers.</p><p style=\"min-height:1.5em\"></p><p style=\"min-height:1.5em\"><strong>What you'll do at BioRender:</strong></p><ul style=\"min-height:1.5em\"><li><p style=\"min-height:1.5em\">Design and produce multimedia content pieces that align with BioRender’s brand and marketing strategy</p></li><li><p style=\"min-height:1.5em\">Create platform-specific graphics and multimedia content, including LinkedIn posts, Instagram Reels, Reddit graphics, 1-pagers, GIFs, videos, etc. ensuring high quality and brand consistency.</p></li><li><p style=\"min-height:1.5em\">Collaborate with the marketing and other teams to ensure all content is accurate and engaging, meeting project deadlines consistently.</p></li><li><p style=\"min-height:1.5em\">Develop and maintain a library of reusable design assets and templates to streamline content creation processes within X months.</p></li><li><p style=\"min-height:1.5em\">Create multimedia graphics for high-impact campaigns that boosts engagement and brand recognition</p><p style=\"min-height:1.5em\"></p></li></ul><p style=\"min-height:1.5em\"><strong>Our ideal fit:</strong></p><ul style=\"min-height:1.5em\"><li><p style=\"min-height:1.5em\">3+ years of experience at a fast-paced company  </p></li><li><p style=\"min-height:1.5em\">Proven experience in creating multimedia content (a plus if it’s in the science industry).</p></li><li><p style=\"min-height:1.5em\">Expert in Adobe Creative Suite (Illustrator, Photoshop, After Effects, Premiere Pro) and other relevant design tools (Figma, Cava, etc.). Ability to quickly learn new software.</p></li><li><p style=\"min-height:1.5em\">Ability to analyze selling points or software features and translate them into compelling visual stories through quick, engaging visuals.</p></li><li><p style=\"min-height:1.5em\">Strong portfolio showcasing multimedia design work, including graphics for social media platforms, GIFs, and videos, particularly in scientific contexts.</p></li></ul><p style=\"min-height:1.5em\"></p><p style=\"min-height:1.5em\"><strong>Why join us?</strong></p><ul style=\"min-height:1.5em\"><li><p style=\"min-height:1.5em\">We are mission-driven, and work collaboratively towards our shared vision of improving scientific communication and accelerating scientific discovery: BioRender figures have appeared in more than 54,000 publications! </p></li><li><p style=\"min-height:1.5em\">It’s a product that users love! We have a world-class NPS and a community of loyal fans. Check out our Testimonials page to see what our customers are saying about us: <a target=\"_blank\" rel=\"noopener noreferrer\" class=\"postings-link\" href=\"https://biorender.com/testimonials/\">https://biorender.com/testimonials/</a> </p></li><li><p style=\"min-height:1.5em\">We are in the top quartile for profitability and year-over-year revenue growth, with users in 200+ countries.</p></li><li><p style=\"min-height:1.5em\">BioRender is an equal opportunity employer, and an inclusive hiring process and work environment is a part of our DNA. </p></li><li><p style=\"min-height:1.5em\">We’re remote-first and have team members across Canada and the United States. A physical office in Toronto is available, but you have the flexibility to work from anywhere. </p></li><li><p style=\"min-height:1.5em\">We’re backed by top investors, accelerators, and some of the most successful life science entrepreneurs and philanthropists in the world including Y Combinator, Malala Fund founders, and Fifty Years VC. </p></li><li><p style=\"min-height:1.5em\">We are committed to building a warm, inclusive, and diverse environment. Check out how we make sure our employees come first!</p></li></ul><p style=\"min-height:1.5em\"></p><p style=\"min-height:1.5em\">If your interest is piqued, please apply. We'd love to hear from you. Also, be sure to check out other listings on our Careers page. </p><p style=\"min-height:1.5em\"><br />BioRender is now remote-first, with plans to bring everyone together at our Toronto office a few times each year.</p><p style=\"min-height:1.5em\"><br />We are committed to providing work environments which promote the health, safety and well-being of all employees in accordance with public health regulation and guidance.</p><p style=\"min-height:1.5em\"><br /><em>BioRender is an equal opportunity employer and, as such, does not discriminate on the basis of race, colour, religion, sex, national origins, age, sexual orientation, disability or any other characteristic protected by applicable laws.  Selection decisions are solely based on job-related factors.</em></p><p style=\"min-height:1.5em\"></p><p style=\"min-height:1.5em\">Read more about our <a target=\"_blank\" rel=\"noopener noreferrer\" class=\"postings-link\" href=\"https://biorender.notion.site/BioRender-Candidate-Resources-8255c155797f442a950720a33b4764d5\">BioRender interview process &amp; FAQs here!</a></p><p style=\"min-height:1.5em\"></p><p style=\"min-height:1.5em\">Check out what it's like to work at BioRender in <a target=\"_blank\" rel=\"noopener noreferrer\" class=\"postings-link\" href=\"https://biorender.notion.site/Working-at-BioRender-as-a-Canada-Based-Employee-f6e12ab844154bb9948b22b32e3f0c70\">Canada</a> and the <a target=\"_blank\" rel=\"noopener noreferrer\" class=\"postings-link\" href=\"https://biorender.notion.site/Working-at-BioRender-as-a-U-S-Based-Employee-4ab2cc8e48f546f89aa98c318bccebc9\">US</a>!</p><p style=\"min-height:1.5em\"><br />#LI-HC1</p>","tags":"[\"B2C\",\"aws\"]","pubDate":"2024-08-12 01:40:31.537","link":"https://jobs.ashbyhq.com/biorender/d1d35878-7b37-4b97-9f6f-5416d0eaef55","savedDate":"2024-08-12 01:40:31.537","slug":"graphic-designer-biorender-6368"},{"id":5984232544,"title":"Enterprise Open Source Sales Manager","company":"Canonical","image":"https://pbs.twimg.com/profile_images/1673959375340290050/x7pNtXQ7_400x400.jpg","description":"\n      <p>Open source software is the new default in the enterprise, and Canonical is the new challenger to major enterprise software vendors.</p>\n<p>We are profitable and growing our global enterprise sales organisation. We are hiring <strong>regional sales managers</strong> in Europe, Middle East, Africa, Latin America, Central America and North America, each of whom will lead a team of five to ten enterprise sales representatives.</p>\n<p>We deliver better open source from the data center to cloud and edge. Our Linux distribution Ubuntu is now the leading platform for public cloud compute, and the favorite platform for software engineers, data scientists and AI developers. Our mission is to accelerate the adoption and quality of open source globally, and our goal is to ship the most software on the planet by cores. A tidal wave of open source innovation is the next phase of the entire enterprise software industry, and we aim to be the most compelling way to ride that wave.</p>\n<p>Our customers include Global 500 enterprises and startups. We are expanding our product range from the base operating system - Ubuntu - to full enterprise solutions in infrastructure and applications. We can deliver software defined storage, private cloud solutions, container runtime environments, as well as databases, message queues, identity, observability, analytics, machine learning and web publishing capabilities. Customers love the idea that they can get security compliance and support for everything open source from a single company. Our goal is to have more solutions on tap than any other vendor, and we have built unique capabilities to make that possible across every cloud, every class of compute and every category of application.</p>\n<p>Canonical provides licensed enterprise software products, commercial support, managed services, consulting and training services to customers who are deploying Ubuntu or open source applications on the cloud, in their data center, or to the connected device and IoT ecosystem. We are just over 1,000 colleagues in 70+ countries and over $250m in revenue, profitable, on a steady but relentless growth trajectory. We are almost entirely distributed, with leadership spread across many countries. We believe that talent is equally distributed across the globe, and we are excited to hire, develop, promote and ultimately trust a diverse group of exceptional leads to build the best, not biggest, enterprise software company.</p>\n<p>We hire carefully and deliberately; our selection process is long and requires substantial work from applicants. It will take successful applicants three to six months to secure an offer. This is not a place to apply if you are in a rush to find a position, it is a worthwhile place to apply if you are ambitious and long-term in your thinking about your career and the dynamics which move the world forward. If you see clearly the rise of open source, and you understand the drivers of enterprise procurement and technical decision making, then you will understand why Canonical has such a tremendous long term advantage. You will also understand, given the ferocity of competition and the challenges of competing in a market of giants, that we have to set a very high bar for hiring and performance. In order to be a world leading company we select for exceptional ability as well as character, and then provide an environment which promotes teamwork and celebrates diligence, collaboration and effectiveness. All of those are easy to say but hard to do - at Canonical we are willing to be uncomfortable in pursuit of that excellence.</p>\n<p>In building our sales team, we look for five things:</p>\n<ul>\n<li>Empathy for the customer - a real understanding of customer needs, industry-specific challenges, and a desire to help customers solve their business problems</li>\n<li>High intellect - the ability to learn quickly, understand very complex subjects, and communicate clearly to build trust and confidence</li>\n<li>Passion for technology - a fascination with the state of the art from brilliant people solving hard problems, and fierce competition for large prizes</li>\n<li>Teamwork - a willingness to help others, to collaborate well with people from different disciplines, and to balance personal and team ambitions</li>\n<li>Energy - the drive to motivate oneself and others to achieve the best result for the team and our customers</li>\n</ul>\n<p>Ubuntu is already very widely adopted which gives us a credible basis for conversations in the market. Nevertheless, it requires real work for sales professionals to build on that adoption to create trusted and profitable commercial relationships with the enterprises in their territory. Our product managers and marketing teams run campaigns to generate awareness, engagement and leads, but you will need to go beyond managing inbound interest to develop the potential of your territory. You will need judgement as to which industries and companies are ready to go deeper with open source and Canonical, and energy to develop relationships in advance of proven interest. We expect professional practice, territory and account planning, as well as clear, complete and continuous reporting on pipeline status and activity, using standard professional tools.</p>\n<p>The successful candidate will carry an annual team bookings quota within their territory. They should be able to travel regionally for client engagement, industry conferences, and internationally for company events twice a year. They will be expected to demonstrate professionalism and effectiveness in managing their team. They will need to coach, mentor and lead by example. Their sales representatives are expected to prospect accounts for new business, maintain and develop existing relationships, and work with colleagues and partners on account strategy. They must be comfortable selling enterprise software, open source, cloud, virtualization, container technologies and technical software solutions to senior levels of the enterprise.</p>\n<p><strong>Location:</strong> We are expanding our sales organisation globally and have open roles in every region.</p>\n<h3>What your day will look like</h3>\n<ul>\n<li>Build and execute a territory plan to prioritize outreach and prospecting</li>\n<li>Allocate portions of territory and accounts to sales representatives on your team</li>\n<li>Identify and prioritise new logo accounts in your territory for account-based marketing and prospecting</li>\n<li>Ensure that sales representatives have high quality account plans for existing accounts and priority prospects</li>\n<li>Monitor new pipeline development by your team, through outreach, prospecting, local marketing, and industry events</li>\n<li>Support contract closure to meet and exceed quarterly and annual bookings targets</li>\n<li>Be mindful and proactive in achieving tactical and strategic objectives</li>\n<li>Work with customer success to identify growth opportunities</li>\n<li>Ensure your team maintain accurate pipeline data and forecasts within Salesforce</li>\n<li>Represent the company, its solutions and software</li>\n</ul>\n<h3>What we are looking for in you</h3>\n<ul>\n<li>Bachelor's level degree, preferably in engineering or computer science</li>\n<li>Leadership and management skill</li>\n<li>Experience of open source technology and solutions</li>\n<li>Detail oriented with effective planning, organisation and reporting skill</li>\n<li>Experience in enterprise software or technology sales planning and execution</li>\n<li>Track record of achievement in sales targets and new account wins</li>\n<li>Self-discipline and motivation to be successful in a distributed team</li>\n<li>Professional written and spoken English, as well as any language that may be appropriate for your target market</li>\n<li>Ability to travel for customer engagements, industry events and company events</li>\n</ul>\n<h3>Additional skills of interest</h3>\n<ul>\n<li>Specific vertical experience, in particular finance, telco, health, energy, public sector, tech</li>\n<li>Experience speaking at conferences or industry events</li>\n</ul>\n<h3>What we offer you</h3>\n<p>We consider geographical location, experience, and performance when shaping compensation worldwide. We revisit compensation annually (and more often for graduates and associates) to ensure we recognise outstanding performance. In addition to base pay, we offer a performance-driven commission structure. We provide all team members with additional benefits, which reflect our values and ideals. We balance our programs to meet local needs and ensure fairness globally.</p>\n<ul>\n<li>On-target earnings between USD 180k and USD 350k</li>\n<li>Distributed work environment with twice-yearly team meetings in person</li>\n<li>Personal learning and development budget of USD 2,000 per year</li>\n<li>Annual compensation review</li>\n<li>Recognition rewards</li>\n<li>Annual holiday leave</li>\n<li>Maternity and paternity leave</li>\n<li>Employee Assistance Program</li>\n<li>Opportunity to travel to new locations to meet colleagues</li>\n<li>Priority Pass, and travel upgrades for long haul company events</li>\n</ul>\n<h3>About Canonical</h3>\n<p>Canonical is a pioneering tech firm at the forefront of the global move to open source. As the company that publishes Ubuntu, one of the most important open source projects and the platform for AI, IoT and the cloud, we are changing the world on a daily basis. We recruit on a global basis and set a very high standard for people joining the company. We expect excellence - in order to succeed, we need to be the best at what we do. Canonical has been a fully distributed company since its inception in 2004.​ Working here is a step into the future, and will challenge you to think differently, work smarter, learn new skills, and raise your game.</p>\n<h3>Canonical is an equal opportunity employer</h3>\n<p>We are proud to foster a workplace free from discrimination. Diversity of experience, perspectives, and background create a better work environment and better products. <a href=\"https://canonical.com/careers/diversity/identity\">Whatever your identity, we will give your application fair consideration.</a></p>\n<p>#LI-remote</p><p>Requisition ID: 1151</p><p></p>\n    ","tags":"[\"Finance\",\"management\",\"engineering\",\"database\"]","pubDate":"2024-08-12 01:40:31.536","link":"https://canonical.com/careers/5760839","savedDate":"2024-08-12 01:40:31.536","slug":"enterprise-open-source-sales-manager-canonical-9865"},{"id":9164932960,"title":"Senior C++ Software Engineer (Remote/Anywhere)","company":"Collabora","image":"https://media.licdn.com/dms/image/D4E0BAQFdRsd49YG4fQ/company-logo_200_200/0/1688735422027/collabora_logo?e=2147483647&v=beta&t=COQKgdesE_abHpZN-7BjhNZ1IKm2nhQyHB637TbP88E","description":"<div class=\"section page-centered\" data-qa=\"job-description\"><div><span style=\"font-size: 11pt\">Collabora Productivity Ltd. is a software company specialising in bringing the innovation created in Open Source projects such as LibreOffice to the market, along with services, long term support and software consultancy. We combine years of open source software leadership with an understanding of the challenges that businesses, non-profits, and governments face.</span></div><div><br></div><div><span style=\"font-size: 11pt\">Collabora Productivity brings deep technical expertise around the Office space, from our preferred Open Document format to many other, including legacy, document formats such as OpenXML and Microsoft binary formats, using modern technologies like C++ 17.</span></div><div><br></div><div><br></div></div><div class=\"section page-centered\"><div><h3>Key Responsibilities</h3><ul class=\"posting-requirements plain-list\"><ul><li>Root cause analysis and fixing of document interoperability issues</li><li>Analysing client problems, designing, and implementing solutions leveraging open source technologies and communicating the solutions in a compelling fashion</li><li>Annual conference attendance to present progress made to the Open Source community</li><li>Self starting analysis of limited project descriptions, ability to break complex tasks down into smaller deliverables, execute and report progress against these</li><li>Assistance in estimation of project costs</li><li>Implementation of features based on unclear customer input to exceed their expectations</li><li>Communication with the community, other team members, and customers using mailing \tlists, chats, phone and video conference</li><li>Capacity to travel a few times per year worldwide</li><li>Reliable and timely delivery of quality solutions to clients and internal customers</li><li>Development of strong relationships with key personnel, decision makers and customers</li></ul></ul></div></div><div class=\"section page-centered\"><div><h3>Commercial Skills</h3><ul class=\"posting-requirements plain-list\"><ul><li>Understanding client needs and reconciling time constraints, available technologies and resources and open source best practices</li><li>Ability to work in a global context with clients and engineers spanning continents</li><li>Knowledge of customers’ organization, management, product, target market, applications and decision making internal process \t</li></ul></ul></div></div><div class=\"section page-centered\"><div><h3>Technical Skills</h3><ul class=\"posting-requirements plain-list\"><ul><li>Large scale C++ development experience, on projects of &gt; 1 million lines of code</li><li>LibreOffice development experience preferred</li><li>Excellent code reading skills</li><li>Office Suite, file format and binary file format reverse engineering experience a plus</li><li>Good interpersonal skills, along with knowledge of open source \tdevelopment methodologies and good standing in the open source community</li><li>Significant demonstrable contributions to components in the open source ecosystem</li><li>BS/BA or extensive experience in the role of Software Engineer </li><li>Experience of unit testing</li><li>Cross-platform aware, deep knowledge of either Linux, MS Windows, or OSX, and some knowledge of one more platform (Cygwin knowledge helpful if MS Windows is the core skill)</li><li>Experience with Android, iOS or another mobile operating system a bonus</li><li>Casual scripting in Perl / Python / BASH or other language(s)</li><li>Version control systems – ideally knowledge of git</li></ul></ul></div></div><div class=\"section page-centered\"><div><h3>Personal Skills</h3><ul class=\"posting-requirements plain-list\"><ul><li>Highly self motivated, reliable with a demonstrable passion for Open Source and the office domain</li><li>Able to work from home office, managing own time effectively</li><li>Self learning skill to get sufficient knowledge of Collabora's services, \tbusiness model, project delivery lifecycle and other related technical domains</li><li>Good interpersonal skills</li><li>Winsome presentation skills appreciated</li><li>Good English language skills (both verbal and written) </li><li>German language skills a bonus</li><li>Ability to work and communicate in an online distributed environment</li></ul></ul></div></div><div class=\"section page-centered\" data-qa=\"closing-description\"><div>#LI-Remote</div></div><div class=\"section page-centered last-section-apply\" data-qa=\"btn-apply-bottom\"><a class=\"postings-btn template-btn-submit hex-color\" data-qa=\"show-page-apply\" href=\"https://jobs.lever.co/collabora/afb6f2ea-9c39-498c-863c-82764ea247a0/apply\">Apply for this job</a></div>","tags":"[\"management\",\"engineering\"]","pubDate":"2024-08-12 01:40:31.536","link":"https://jobs.lever.co/collabora/afb6f2ea-9c39-498c-863c-82764ea247a0","savedDate":"2024-08-12 01:40:31.536","slug":"senior-c-software-engineer-remote-anywhere-collabora-1136"},{"id":7667002765,"title":"Senior DevOps Engineer (Blockchain)","company":"Status","image":"https://avatars.githubusercontent.com/u/11767950?s=200&v=4","description":"\n    <div class=\"content-intro\"><p style=\"text-align: justify;\"><strong>About Status</strong></p>\n<p style=\"text-align: justify;\"><span style=\"font-weight: 400;\">Status is building the tools and infrastructure for the advancement of a secure, private, and open web3.&nbsp;</span></p>\n<p style=\"text-align: justify;\"><span style=\"font-weight: 400;\">With the high level goals of preserving the right to privacy, mitigating the risk of censorship, and promoting economic trade in a transparent, open manner, Status is building a community where anyone is welcome to join and contribute.</span></p>\n<p style=\"text-align: justify;\"><span style=\"font-weight: 400;\">As an organization, Status seeks to push the web3 ecosystem forward through research, creation of developer tools, and support of the open source community.&nbsp;</span></p>\n<p style=\"text-align: justify;\"><span style=\"font-weight: 400;\">As a product, Status is an open source, Ethereum-based app that gives users the power to chat, transact, and access a revolutionary world of Apps on the decentralized web. But Status is also building foundational infrastructure for the whole Ethereum ecosystem, including the Nimbus ETH 1.0 and 2.0 clients, the Keycard hardware wallet, and the Waku messaging protocol, the p2p communication layer for Web3.</span></p>\n<p style=\"text-align: justify;\"><span style=\"font-weight: 400;\">As a team, Status has been completely distributed since inception. Our team is currently 200+ core contributors strong, and welcomes a growing number of community members from all walks of life, scattered all around the globe.&nbsp;</span></p>\n<p style=\"text-align: justify;\"><span style=\"font-weight: 400;\">We care deeply about open source, and our organizational structure has minimal hierarchy and no fixed work hours. We believe in working with a high degree of autonomy while supporting the organization's priorities.</span></p></div>\n\n    <div class=\"careers-block__trix external-panel text-left\">\n<p></p>\n<p><strong>The role</strong></p>\n<p>DevOps is a buzzword, but it's also generic enough to encompass the breadth of tasks required in supporting development teams. There are many ways to make the lives of developers easier, and everyone has their own best way, which also means every team has their own way. There is no perfect way to make everyone happy with the same thing.</p>\n<p>Supporting developers involves debugging obscure bash scripts from years ago that nobody remembers. It means biting on a piece of wood and using data formats turned programming languages like YAML to configure CI jobs. It means tracking down minute differences between releases of packages and libraries causing unexpected crashes. It means rewriting the same Dockerfile for the 5th time to allow a project to use one more obscure library. Or tracking down absurd race conditions of multi-threaded tests running in parallel on the same host. Or pulling your hair out at a bug only to realize it works fine after the CI worker host is restarted.</p>\n<p>But fundamentally it means wrestling it all into submission and making it run smoothly... at least for as long as you're there.</p>\n<p>If you have the guts to fight against entropy and deterioration of the reality we inhabit, then you just might also be crazy enough to enjoy the struggle while it lasts, and appreciate the eventual fruits of our labour, if you value privacy, freedom, and transparency. You might even make some money, and learn a bit from all the exceptional engineers working here.</p>\n<p>&nbsp;</p>\n<p><strong>Who you are</strong></p>\n<p>You have strong Linux Fundamentals:</p>\n<ul>\n<li>Distros and package managers</li>\n<li>Good understanding of process management</li>\n</ul>\n<p>You have programming experience:</p>\n<ul>\n<li>At least a few languages and showing the ability to learn</li>\n<li>Bash as a minimum; Python would be helpful&nbsp;</li>\n</ul>\n<p>You have experience in Continuous Integration:</p>\n<ul>\n<li>Jenkins CI - Pipelines are written in Groovy</li>\n<li>GitHub Actions - PR builds, mostly</li>\n</ul>\n<p>You have experience in Security:</p>\n<ul>\n<li>Good understanding of OpenSSH</li>\n<li>GnuPG for encryption of secrets and backups</li>\n</ul>\n<p><span class=\"hljs-strong\">Distributed Systems:</span></p>\n<ul>\n<li>Experience running Ethereum nodes</li>\n<li>Knowledge of Layer 2 scaling solutions</li>\n</ul>\n<p>&nbsp;</p>\n<p><strong>Compensation</strong></p>\n<p>We are happy to pay in any mix of fiat/crypto.</p>\n<p>&nbsp;</p>\n<p><strong>Hiring process</strong></p>\n<ol>\n<li>Interview with the&nbsp;Talent team</li>\n<li>Paid task</li>\n<li>Technical interview with Head of Infra</li>\n</ol>\n<p><em>[The</em>&nbsp;<em>steps may change along the way if we see it makes sense to adapt the interview stages, so please consider the above as a guideline]</em></p>\n<p></p>\n<p>&nbsp;</p>\n</div>\n\n    \n\n    \n","tags":"[\"management\"]","pubDate":"2024-08-12 01:40:31.535","link":"https://boards.greenhouse.io/embed/job_app?for=status72&token=6164621&b=https%3A%2F%2Fjobs.status.im%2F","savedDate":"2024-08-12 01:40:31.535","slug":"senior-devops-engineer-blockchain-status-247"},{"id":7716489995,"title":"Enterprise Open Source Sales Director","company":"Canonical","image":"https://pbs.twimg.com/profile_images/1673959375340290050/x7pNtXQ7_400x400.jpg","description":"\n      <p>Canonical is a leading provider of open source software and operating systems to the global enterprise and technology markets. Our platform, Ubuntu, is very widely used in breakthrough enterprise initiatives such as public cloud, data science, AI, engineering innovation and IoT. Our customers include the world's leading public cloud and silicon providers, and industry leaders in many sectors. The company is a pioneer of global distributed collaboration, with 1000+ colleagues in 70+ countries and very few roles based in offices. Teams meet two to four times yearly in person, in interesting locations around the world, to align on strategy and execution.</p>\n<p>The company is founder led, profitable and growing our global enterprise sales organisation. We are hiring <strong>regional sales directors</strong> in Europe, Middle East, Africa, Latin America, Central America and North America, each of whom will be responsible for several teams of five to ten enterprise sales representatives.</p>\n<p>We deliver better open source from the data center to cloud and edge. Our Linux distribution Ubuntu is now the leading platform for public cloud compute, and the favorite platform for software engineers, data scientists and AI developers. Our mission is to accelerate the adoption and quality of open source globally, and our goal is to ship the most software on the planet by cores. A tidal wave of open source innovation is the next phase of the entire enterprise software industry, and we aim to be the most compelling way to ride that wave.</p>\n<p>Our customers include Global 500 enterprises and startups. We are expanding our product range from the base operating system - Ubuntu - to full enterprise solutions in infrastructure and applications. We can deliver software defined storage, private cloud solutions, container runtime environments, as well as databases, message queues, identity, observability, analytics, machine learning and web publishing capabilities. Customers love the idea that they can get security compliance and support for everything open source from a single company. Our goal is to have more solutions on tap than any other vendor, and we have built unique capabilities to make that possible across every cloud, every class of compute and every category of application.</p>\n<p>Canonical provides licensed enterprise software products, commercial support, managed services, consulting and training services to customers who are deploying Ubuntu or open source applications on the cloud, in their data center, or to the connected device and IoT ecosystem. We are just over 1,000 colleagues in 70+ countries and over $250m in revenue, profitable, on a steady but relentless growth trajectory. We are almost entirely distributed, with leadership spread across many countries. We believe that talent is equally distributed across the globe, and we are excited to hire, develop, promote and ultimately trust a diverse group of exceptional leads to build the best, not biggest, enterprise software company.</p>\n<p>We hire carefully and deliberately; our selection process is long and requires substantial work from applicants. It will take successful applicants three to six months to secure an offer. This is not a place to apply if you are in a rush to find a position, it is a worthwhile place to apply if you are ambitious and long-term in your thinking about your career and the dynamics which move the world forward. If you see clearly the rise of open source, and you understand the drivers of enterprise procurement and technical decision making, then you will understand why Canonical has such a tremendous long term advantage. You will also understand, given the ferocity of competition and the challenges of competing in a market of giants, that we have to set a very high bar for hiring and performance. In order to be a world leading company we select for exceptional ability as well as character, and then provide an environment which promotes teamwork and celebrates diligence, collaboration and effectiveness. All of those are easy to say but hard to do - at Canonical we are willing to be uncomfortable in pursuit of that excellence.</p>\n<p>In building our sales team, we look for five things:</p>\n<ul>\n<li>Empathy for the customer - a real understanding of customer needs, industry-specific challenges, and a desire to help customers solve their business problems</li>\n<li>High intellect - the ability to learn quickly, understand very complex subjects, and communicate clearly to build trust and confidence</li>\n<li>Passion for technology - a fascination with the state of the art from brilliant people solving hard problems, and fierce competition for large prizes</li>\n<li>Teamwork - a willingness to help others, to collaborate well with people from different disciplines, and to balance personal and team ambitions</li>\n<li>Energy - the drive to motivate oneself and others to achieve the best result for the team and our customers</li>\n</ul>\n<p>Ubuntu is already very widely adopted which gives us a credible basis for conversations in the market. Nevertheless, it requires real work for sales professionals to build on that adoption to create trusted and profitable commercial relationships with the enterprises in their territory. Our product managers and marketing teams run campaigns to generate awareness, engagement and leads, but you will need to go beyond managing inbound interest to develop the potential of your territory. You will need judgement as to which industries and companies are ready to go deeper with open source and Canonical, and energy to develop relationships in advance of proven interest. We expect professional practice, territory and account planning, as well as clear, complete and continuous reporting on pipeline status and activity, using standard professional tools.</p>\n<p>The successful candidate will carry an annual team bookings quota within their territory. They should be able to travel regionally for client engagement, industry conferences, and internationally for company events twice a year. They will be expected to demonstrate professionalism and effectiveness in managing their team. They will need to coach, mentor and lead by example. Their sales representatives are expected to prospect accounts for new business, maintain and develop existing relationships, and work with colleagues and partners on account strategy. They must be comfortable selling enterprise software, open source, cloud, virtualization, container technologies and technical software solutions to senior levels of the enterprise.</p>\n<p><strong>Location:</strong> We are expanding our sales organisation globally and have open roles in every region.</p>\n<h3>What your day will look like</h3>\n<ul>\n<li>Build and execute a territory plan to prioritize outreach and prospecting</li>\n<li>Allocate portions of territory and accounts to sales representatives on your team</li>\n<li>Identify and prioritise new logo accounts in your territory for account-based marketing and prospecting</li>\n<li>Ensure that sales representatives have high quality account plans for existing accounts and priority prospects</li>\n<li>Monitor new pipeline development by your team, through outreach, prospecting, local marketing, and industry events</li>\n<li>Support contract closure to meet and exceed quarterly and annual bookings targets</li>\n<li>Be mindful and proactive in achieving tactical and strategic objectives</li>\n<li>Work with customer success to identify growth opportunities</li>\n<li>Ensure your team maintain accurate pipeline data and forecasts within Salesforce</li>\n<li>Represent the company, its solutions and software</li>\n</ul>\n<h3>What we are looking for in you</h3>\n<ul>\n<li>Bachelor's level degree, preferably in engineering or computer science</li>\n<li>Leadership and management skill</li>\n<li>Experience of open source technology and solutions</li>\n<li>Detail oriented with effective planning, organisation and reporting skill</li>\n<li>Experience in enterprise software or technology sales planning and execution</li>\n<li>Track record of achievement in sales targets and new account wins</li>\n<li>Self-discipline and motivation to be successful in a distributed team</li>\n<li>Professional written and spoken English, as well as any language that may be appropriate for your target market</li>\n<li>Ability to travel for customer engagements, industry events and company events</li>\n</ul>\n<h3>Additional skills of interest</h3>\n<ul>\n<li>Specific vertical experience, in particular finance, telco, health, energy, public sector, tech</li>\n<li>Experience speaking at conferences or industry events</li>\n</ul>\n<h3>What we offer you</h3>\n<p>We consider geographical location, experience, and performance when shaping compensation worldwide. We revisit compensation annually (and more often for graduates and associates) to ensure we recognise outstanding performance. In addition to base pay, we offer a performance-driven commission structure. We provide all team members with additional benefits, which reflect our values and ideals. We balance our programs to meet local needs and ensure fairness globally.</p>\n<ul>\n<li>On-target earnings between USD 300k and USD 450k</li>\n<li>Distributed work environment with twice-yearly team meetings in person</li>\n<li>Personal learning and development budget of USD 2,000 per year</li>\n<li>Annual compensation review</li>\n<li>Recognition rewards</li>\n<li>Annual holiday leave</li>\n<li>Maternity and paternity leave</li>\n<li>Employee Assistance Program</li>\n<li>Opportunity to travel to new locations to meet colleagues</li>\n<li>Priority Pass, and travel upgrades for long haul company events</li>\n</ul>\n<h3>About Canonical</h3>\n<p>Canonical is a pioneering tech firm at the forefront of the global move to open source. As the company that publishes Ubuntu, one of the most important open source projects and the platform for AI, IoT and the cloud, we are changing the world on a daily basis. We recruit on a global basis and set a very high standard for people joining the company. We expect excellence - in order to succeed, we need to be the best at what we do. Canonical has been a fully distributed company since its inception in 2004.​ Working here is a step into the future, and will challenge you to think differently, work smarter, learn new skills, and raise your game.</p>\n<h3>Canonical is an equal opportunity employer</h3>\n<p>We are proud to foster a workplace free from discrimination. Diversity of experience, perspectives, and background create a better work environment and better products. <a href=\"https://canonical.com/careers/diversity/identity\">Whatever your identity, we will give your application fair consideration.</a></p>\n<p>#LI-remote</p><p>Requisition ID: 1151</p><p></p>\n    ","tags":"[\"Finance\",\"management\",\"engineering\",\"database\"]","pubDate":"2024-08-12 01:40:31.535","link":"https://canonical.com/careers/5782325","savedDate":"2024-08-12 01:40:31.535","slug":"enterprise-open-source-sales-director-canonical-2635"},{"id":2342601226,"title":"Technical Project Manager","company":"OpenZeppelin","image":"https://remotive.com/job/1929393/logo","description":"<div class='\"content-intro\"'>\n<div class=\"h3\"><strong>About us</strong></div>\n<p>Founded in 2015 with the mission to protect the open economy, OpenZeppelin is the world leader in securing blockchain applications and smart contracts. </p>\n<p>Its bedrock open source Contract Libraries are a public good and industry standard for smart contract development.</p>\n<p>OpenZeppelin’s professional expertise, unified with the Defender developer security platform, integrates through clients’ development lifecycles, so teams can plan, code, audit, deploy and operate projects faster and more safely.</p>\n<p><strong>Please note:</strong> Always refer to OpenZeppelin's official job page for the most accurate information about our open roles, as we have seen multiple third party job sites posting inaccurate information.</p>\n</div>\n<section class='\"j-content\"'>\n<div class='\"container\"'>\n<div class='\"job-description\"'>\n<div class='\"requirements\"'>\n<div class=\"h3\"><strong>About the role:</strong></div>\n<p>OpenZeppelin is seeking an experienced, customer-facing Technical Project Manager with a proven track record of delivering on time to join the Security Research team and take ownership of the entire security audit delivery process.  This person will work closely with other constituencies across the organization including the Sales, Marketing, Operations, and Executive Leadership teams.</p>\n<div class=\"h3\"><strong>What you'll be doing:</strong></div>\n<ul style=\"\">\n<li style=\"\">Own and nurture relationships with OpenZeppelin’s client base. Respond to inquiries from existing customers, ensuring client retention and satisfaction.</li>\n<li style=\"\">Establish trusted relationships with each client to drive continued value from our products and services. Ensure that clients' technical needs are met and exceeded.</li>\n<li style=\"\">Follow up on client interactions to identify and develop new business opportunities.</li>\n<li style=\"\">Lead client kick-off meetings and serve as the primary point of contact for all communications throughout the delivery process.</li>\n<li style=\"\">Manage scope creep by utilizing a structured change order process, ensuring project scope remains controlled and clearly defined.</li>\n<li style=\"\">Evaluate and escalate issues to management as necessary, facilitating prompt and effective resolution.</li>\n<li style=\"\">Oversee the entire end-to-end process of client deliveries, including final review and coordination of publishing.</li>\n<li style=\"\">Collaborate with Security Research team leaders to manage and ensure quality control throughout the project lifecycle.</li>\n<li style=\"\">Monitor team performance against key metrics, such as resource utilization and allocation, to ensure optimal efficiency and project success.</li>\n<li style=\"\">Automate and enhance the delivery process using our internal tools (GitHub, Notion, Slack, HubSpot) to improve efficiency and streamline workflows.</li>\n</ul>\n<div class=\"h3\"><strong>You have:</strong></div>\n<ul style=\"\">\n<li style=\"\">5+ years of experience in Technical Project Management, Technical Program Management, Technical Account Management , Solutions Architect or similar roles.</li>\n<li style=\"\">An advanced English level and great communication skills (oral and written).</li>\n<li style=\"\">Passion about the blockchain space and decentralization.</li>\n<li style=\"\">You have a technical background and are comfortable with reviewing code at a high-level for estimation purposes and code management tools (GitHub especially).</li>\n<li style=\"\">Superb organization and project management skills with the ability to work on and manage multiple complex projects with many stakeholders at the same time.</li>\n<li style=\"\">Excellent interpersonal and communication skills and a demonstrated ability to communicate with clients on both technical and non-technical topics.</li>\n<li style=\"\">Advanced knowledge of project management tools and familiar with Notion, Linear and GitHub.</li>\n<li style=\"\">Demonstrated experience working with professional services scheduling software.</li>\n</ul>\n<div class=\"h3\"><strong>Nice to have:</strong></div>\n<ul style=\"\">\n<li style=\"\">Technical experience with blockchain technologies, Solidity, or cybersecurity.</li>\n<li style=\"\">Project management certification (PMP, Scrum Master, etc).</li>\n<li style=\"\">Advanced knowledge of GitHub.</li>\n<li style=\"\">PMO or other people management experience.</li>\n</ul>\n<div class=\"h3\"><strong>Logistics:</strong></div>\n<p>All positions at OpenZeppelin are 100% remote, however you must be located/able to work in the Americas or European time zones to be considered for this position. Our interview process takes place on Zoom and tends to consist of the following stages:</p>\n<ul style=\"\">\n<li style=\"\">Recruiter Call (45mins)</li>\n<li style=\"\">Hiring Manager Call (45mins)</li>\n<li style=\"\">PM Team Interview 60mins)</li>\n<li style=\"\">Leadership Interview (30mins)</li>\n<li style=\"\">Paid work test (Lasting up to 10 days)</li>\n<li style=\"\">Reference checks</li>\n</ul>\n</div>\n</div>\n</div>\n</section>\n<div class='\"content-conclusion\"'>\n<section class='\"j-content\"'>\n<div class='\"container\"'>\n<div class=\"h3\"><strong>Benefits</strong></div>\n<ul style=\"\">\n<li style=\"\">Company in-person gatherings in different locations around the world 😎</li>\n<li style=\"\">Fully remote work 🌎</li>\n<li style=\"\">Flexible time off 🏝</li>\n<li style=\"\">Paid parental leave for primary or second caregiver 💙</li>\n<li style=\"\">One time work-from-home equipment stipend of up to $500 USD 🪑</li>\n<li style=\"\">Co-working (up to $250/month) 👩‍💻</li>\n<li style=\"\">Medical coverage</li>\n<li style=\"\">Annual Learning &amp; Development budget 🧠</li>\n<li style=\"\">Referral program</li>\n<li style=\"\">Work with a global team in a fast-growing industry 🚀</li>\n</ul>\n<p class='\"job-description\"'>At <strong>OpenZeppelin</strong>, we are an equal opportunity employer and we value different perspectives. We are committed to building a diverse workforce. This includes but is not limited to gender, race, sexual orientation, religion, national origin and other characteristics that make each one of us unique. In this uniqueness, we find the most value. Come join us!</p>\n<p> </p>\n</div>\n</section>\n</div>\n<img src=\"https://remotive.com/job/track/1929393/blank.gif?source=public_api\" alt=\"\"/>","tags":"[\"scrum\",\"security\",\"open source\",\"blockchain\",\"project management\",\"research\",\"solidity\",\"account management\",\"cybersecurity\",\"people management\",\"hubspot\",\"scrum master\",\"technical project manager\",\"github\"]","pubDate":"2024-08-10 15:20:36.000","link":"https://remotive.com/remote-jobs/project-management/technical-project-manager-1929393","savedDate":"2024-08-12 01:40:31.533","slug":"technical-project-manager-openzeppelin-3172"},{"id":4743284119,"title":"Head of Legal and Compliance","company":"Just, Inc.","image":"https://remotive.com/job/1929443/logo","description":"<div><!--block-->If you enjoy collaborating with regulators, don't scare easily, and can see the future, we would love to have you on our team! We are seeking a bright, hands-on legal and compliance insurance leader. Expertise in property and casualty insurance programs with a heavy emphasis on auto, regulator compliance, and technology, including contracts and familiarity with digital platforms is ideal.</div><br><br><div class=\"h3\">Key Responsibilities</div><ul style=\"\"><li style=\"\"><!--block-->Develops and runs Just Insure’s compliance function.</li><li style=\"\"><!--block-->Manages the relationship and all interactions with regulators including owning the filings.</li><li style=\"\"><!--block-->Leads design and implementation of an enterprise compliance strategy, taking into account Just Insure’s business strategy and complex regulations and nuanced supervisory expectations, including how they apply in a matrixed commercial environment.</li><li style=\"\"><!--block-->Manages an enterprise compliance risk management program that meets regulatory requirements and develops policies and standards to meet applicable regulatory requirements. </li><li style=\"\"><!--block-->These include core components of enterprise compliance such as marketing and digital, vendor management, member complaints, governance and training, and risk assessment.</li><li style=\"\"><!--block-->Develops standards for specific development of compliance policies, procedures, and processes.</li><li style=\"\"><!--block-->Develops, communicates, and reinforces the organization's compliance risk tolerance and risk appetite statement and associated limits.</li><li style=\"\"><!--block-->Identifies, addresses, and corrects any areas of operation within the enterprise compliance program requiring compliance attention.</li><li style=\"\"><!--block-->Oversees enterprise compliance reporting and analytics activity including the escalation of significant risk breaches, variation in risk assessments, and resolutions.</li><li style=\"\"><!--block-->Provides independent oversight for the implementation of appropriate strategic/tactical solutions for compliance requirements across the business (e.g., remediation of deficiencies, and development of new programs).</li><li style=\"\"><!--block-->Provides independent oversight for regulatory examinations, information requests regarding compliance, and regulatory filings.</li><li style=\"\"><!--block-->Provides guidance and advice related to compliance matters impacting the suite of product offerings within the LOB being supported.</li></ul><br><br><div class=\"h3\">Skills, Knowledge and Expertise</div><ul style=\"\"><li style=\"\"><!--block-->8-10+ years of insurance brokerage, legal, consulting, or risk management background, preference for experience with complex US and EU auto programs; commercial or personal line experience.</li><li style=\"\"><!--block-->Desire to become an expert in emerging technology, risk, new business models, and personal and commercial insurance.</li><li style=\"\"><!--block-->Excellent problem-solving skills; ability to think quickly on your feet.</li><li style=\"\"><!--block-->Credible executive presence. </li><li style=\"\"><!--block-->Intellectually curious desire to become an expert on risk in the telematics-based insurance industry.</li><li style=\"\"><!--block-->Strong understanding of insurance fundamentals risk, exposure, and coverage.</li><li style=\"\"><!--block-->Collaborative - builds followership with influence and results.</li><li style=\"\"><!--block-->Comfortable in the gray, operating without a user's manual.</li><li style=\"\"><!--block-->Ability to drive projects to successful completion with minimal supervision.</li><li style=\"\"><!--block-->Exceptionally organized, personally accountable, and able to manage competing priorities.</li><li style=\"\"><!--block-->A minimum of 8 years of experience in a technical discipline (e.g. Compliance)with a proven track record leading comparable operations and programs (e.g. complex compliance programs) is required.</li></ul><img src=\"https://remotive.com/job/track/1929443/blank.gif?source=public_api\" alt=\"\"/>","tags":"[\"analytics\",\"risk management\",\"insurance\"]","pubDate":"2024-08-09 19:21:14.000","link":"https://remotive.com/remote-jobs/finance-legal/head-of-legal-and-compliance-1929443","savedDate":"2024-08-12 01:40:31.534","slug":"head-of-legal-and-compliance-just-inc-9889"},{"id":2816417763,"title":"Senior Software Engineer, Windows Desktop App (Remote)","company":"DuckDuckGo","image":"https://spreadprivacy.com/content/images/2023/05/duckduckgo-logo_wide.png","description":"<p>Hi, we’re DuckDuckGo, the Internet privacy company for everyone who wants to take back their privacy now. For over a decade, we've been building our all-in-one product, developing new privacy technology, and working with policymakers to make online privacy simple and accessible for all.  <br /></p>\n<p><br /></p>\n<p>Our browsers and extensions have been downloaded over 250 million times with our built-in private search engine, which has delivered over 100 billion searches and is the 2nd largest search engine on mobile in the United States and 17 other countries, including the United Kingdom, Canada, Australia, Germany, Poland, and Spain. Our private search engine is also 3rd in market share in the U.S. and over 20 major markets. Oh, and we've been profitable since 2014, with annual revenue exceeding $100 million!</p>\n<p><br /></p>\n<p>The DuckDuckGo browser’s uniquely comprehensive privacy protections are used by tens of millions of people to protect their everyday online activities on <a href=\"https://spreadprivacy.com/introducing-duckduckgo-for-mac/\" rel=\"noopener\">Mac</a>, <a href=\"https://spreadprivacy.com/windows-browser-open-beta/\" rel=\"noopener\">Windows</a>, <a href=\"https://spreadprivacy.com/duckduckgo-privacy-browser-ios14/\" rel=\"noopener\">iOS</a>, and <a href=\"https://spreadprivacy.com/introducing-app-tracking-protection/\" rel=\"noopener\">Android</a>, from searching to browsing, emailing, and more. We also offer <a href=\"https://spreadprivacy.com/meetprivacypro/\" rel=\"noopener\">Privacy Pro</a>, a three-in-one subscription service that includes a VPN, Personal Information Removal, and Identity Theft Restoration.</p>\n<p><br /></p>\n<p>We’re looking for a <strong><strong>Senior Software Engineer, Windows Desktop App</strong></strong> to help shape our all-in-one privacy solution and join our mission to show the world that protecting your privacy online can be simple.  </p>\n<p><br /></p>\n<p><strong>The Opportunity</strong> </p>\n<p>In this role, you will work on the team responsible for launching our first ever DuckDuckGo Privacy App for Windows. You'll collaborate with Product Managers, Designers, and Engineers across Native Apps to craft a world-class browser with embedded privacy features that will revolutionize the way people search, surf, and exist online. </p>\n<p><br /></p>\n<p>You will be critical to the successful launch of this product and responsible for taking pieces of the puzzle and autonomously building solutions to get us closer to our first release. You will help define the roadmap, take ownership of significant application features and experiment with ways to improve them. </p>\n<p><br /></p>\n<p>You will lay the foundations of what will become one of DuckDuckGo's flagship products and critical levers for growing privacy online. </p>\n<p><br /></p>\n<p><strong>What You Will Bring to DuckDuckGo</strong> </p>\n<ul><li>Experience implementing ideas from scratch, owning major application features, and taking responsibility for their maintenance and improvement over time.</li><li>Experience participating in technical architecture decisions for complex products, essentially shaping the software architecture of a consumer product.</li><li>Experience building at least one desktop application (ideally with WPF, UWP, WinUI, WinForms, or other relevant .NET UI).</li><li>An advanced level of programming expertise, with knowledge of C#. We currently use .NET 6.</li><li>A significant level of experience in building customer facing applications, including crafting user interfaces.<br /></li><li>Deep understanding of software design patterns such as MVVM, MVP, etc.</li><li>Event-driven programming (e.g., using Rx.NET) experience is considered an advantage.</li></ul>\n<p><br /></p>\n<p><strong>How We Will Support You </strong> </p>\n<p>Our core values -- build trust, question assumptions, and validate direction -- underpin how we work day-to-day and the support we give our team members. We strive to empower our team members to be self-directed and self-motivated in their work.  </p>\n<p><br /></p>\n<ul><li><strong>Remote First, Always</strong>: We've always been a fully distributed company with team members all over the world. We trust you to get your work done wherever, whenever.</li><li><strong>Commitment to Personal Growth:</strong> Every team member has an annual budget of $1,250 USD to invest in their professional development. Every team member also has a dedicated Career Advisor, who serves as a guide to help you develop your strengths, identify your motivations, and understand your opportunities for growth.</li><li><strong>Leadership:</strong> We have many different types of leaders and possible combinations of leadership roles, so you can grow your career in a way that aligns best with your personal goals. You can seek additional leadership roles by being directly responsible for projects, taking ownership of areas of the company, developing and maintaining internal processes, or pursuing advisory roles.</li><li><strong>Work/Life Balance: </strong>Team members have the freedom and flexibility to organize their own work schedules. We want you to thrive both in and out of the office. We trust you to use good judgment and take the time off that you need to bring your best self to work.  </li></ul>\n<p><br /></p>\n<p>We also offer <strong>paid parental leave, a co-working stipend, office setup reimbursement, </strong>and<strong> a wellness stipend.</strong> More support resources can be found in our, <u><a href=\"https://duckduckgo.com/assets/hiring/team_support_guide.pdf\" rel=\"noopener\">Team Member Support Guide</a></u>, which explains how we make your well-being a priority. </p>\n<p><br /></p>\n<p>For more information on how we collaborate worldwide, from leadership in our relatively flat organization to start-to-finish ownership, check out <u><a href=\"https://duckduckgo.com/how-we-work\" rel=\"noopener\">DuckDuckGo Culture: How We Work.</a></u> </p>\n<p><br /></p>\n<p><strong>Compensation</strong> </p>\n<p>Annual compensation: <strong>$176,000</strong> <strong>USD</strong> and stock options. Compensation is the same within a professional level, regardless of geographic location or functional area, and the compensation for each professional level is transparent across the organization.</p>\n<p><br /></p>\n<p><strong>Hiring Process</strong> </p>\n<p>Hiring works best when it's a two-way street. Learn how we help you get to know DuckDuckGo and envision your future role here. Find out more about <u><a href=\"https://duckduckgo.com/how-we-hire\" rel=\"noopener\">how we hire</a></u>. </p>\n<p><br /></p>\n<p><strong>Diversity, Equity, and Inclusion</strong> </p>\n<p>DuckDuckGo provides equal work opportunities to all team members and applicants<u>,</u> and it prohibits discrimination and harassment of any type on the basis of race, color, ethnicity, caste, religion, age, sex (including pregnancy), national origin, disability status, genetics, protected veteran status, sexual orientation, gender identity or expression, or any other characteristic protected by our policies or federal, state, or local laws.</p>\n<p><br /></p>\n<p>We want to ensure that our hiring process is accessible. If you need reasonable accommodation for any part of the application process because of a medical condition or disability, please send an email to <u><a rel=\"noopener\">careers@duckduckgo.com</a></u> to let us know the nature of your request.  </p>\n<p><br /></p>\n<p>If you think you might thrive in this environment, we would love to hear from you. </p>\n<p><br /></p>\n<p><strong>Please note that:</strong> </p>\n<ul><li><p>Sometimes we meet up! Expect to travel at least two times a year: once for our all-hands meetup and again for a team retreat (each around 4-5 days). While extenuating circumstances may impact attendance, everyone is strongly encouraged to attend.</p></li><li>While we offer a flexible work arrangement with no core hours, expect an average full-time commitment of 40 hours per week. </li><li>A successful candidate will be subject to a background check and must receive satisfactory results of the same, as a condition of joining the team. </li><li>By applying for this role, you confirm that all information submitted is accurate and complete. You further acknowledge that providing false or fraudulent information during the application process is cause for denial of an offer, revocation of any existing offer, or other adverse action, up to and including termination after the start of your commencement of work.</li></ul>\n<p><br /></p>\n<p>#INT</p>","tags":"[\"aws\"]","pubDate":"2024-08-09 19:19:23.000","link":"https://duckduckgo.recruitee.com/o/windows-desktop","savedDate":"2024-08-12 01:40:31.535","slug":"senior-software-engineer-windows-desktop-app-remote-duckduckgo-3586"},{"id":5882218953,"title":"Scriptwriter for a comedic YouTube channel","company":"Genesis","image":"https://remotive.com/job/1929159/logo","description":"<p>Are you a writer with a knack for animation, humor, and YouTube? This might just be your dream job. Potentially. </p>\n<p><strong>Genesis </strong>is searching for a talented writer to join our team, crafting content for an animated YouTube channel aimed at the US audience. This is a chance for you to apply your creative side, knowledge of memes, into actual work. We want to entertain and educate young viewers with quality content. And looking for a creative mind to join the team.</p>\n<p> </p>\n<p><strong>Location:</strong> remote.</p>\n<p><strong>Work schedule</strong>: 09:00/10:00 — 18:00/19:00, Mon-Fri</p>\n<p><strong>Salary:</strong> According to the results of the interview.</p>\n<p><strong>Type of employment:</strong> Contract.</p>\n<p><strong>As an integral part of the team you will be:</strong></p>\n<p>1. Writing humorous scripts about… well, pretty much anything.</p>\n<p>2. Collaborating closely with researchers and storyboard artists to bring the visuals to life.</p>\n<p>3. That's about it actually. </p>\n<p><strong>Naturally, a healthy dose of curiosity is key for this role. Ideally you also need:</strong></p>\n<ul style=\"\">\n<li style=\"\">Experience in scriptwriting, especially humorous ones, would be fantastic.</li>\n<li style=\"\">Advanced English. </li>\n<li style=\"\">Be in tune with the latest trends, memes, and pop culture references.</li>\n</ul>\n<p> </p>\n<p><strong>What we offer:</strong></p>\n<ul style=\"\">\n<li style=\"\">Remote full-time gig.</li>\n<li style=\"\">An incredible team of creative minds.</li>\n<li style=\"\">Your daily tasks include watching memes — yes, really.</li>\n</ul>\n<p> </p>\n<p>Hooked? Then send us your resume!</p>\n<p><strong>About us:</strong> We are part of the Genesis group with a 12-year track record of creating engaging video content for the American market. Our projects, including <a href=\"https://www.youtube.com/channel/UCzDHTVhThC_VIT7kTchIQAg\" rel=\"nofollow\">Cuddle Buddies</a> and <a href=\"https://www.youtube.com/channel/UC-701RNNHEXLtb7-Wy_K-eg\" rel=\"nofollow\">Rumour Juice</a>, captivate over 10 million people monthly and generate upwards of 25 million views. </p>\n<p> </p>\n<img src=\"https://remotive.com/job/track/1929159/blank.gif?source=public_api\" alt=\"\"/>","tags":"[\"video\",\"youtube\",\"storyboard, storyboarding\"]","pubDate":"2024-08-09 17:21:44.000","link":"https://remotive.com/remote-jobs/writing/scriptwriter-for-a-comedic-youtube-channel-1929159","savedDate":"2024-08-12 01:40:31.534","slug":"scriptwriter-for-a-comedic-youtube-channel-genesis-3415"},{"id":3304335676,"title":"Senior Data Engineer","company":"Xapo Bank","image":"https://pbs.twimg.com/profile_images/1630623773090037787/M9jBuyQv_400x400.png","description":"&lt;div class=&quot;content-intro&quot;&gt;&lt;p style=&quot;text-align: left;&quot;&gt;&lt;span style=&quot;font-weight: 900;&quot;&gt;Work from anywhere, impact everywhere&amp;nbsp;&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;Diversity is at the heart of who we are at Xapo Bank. We’re a fully distributed team of over 140 Xapiens that work remotely from 40+ countries around the world.&amp;nbsp;&lt;/p&gt;\n&lt;p&gt;Our beginning: A world that enjoys economic freedom and wealth protection, no matter where you live or who is running your country. This is the dream that drove Wences Casares, our Founder and Chairman, to quietly transform the world of banking.&lt;/p&gt;\n&lt;p&gt;To achieve that, we search the world for the best people for the job. We work hard, think globally, and inspire each other to learn and grow. We are committed to changing the way things are done.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Risk is inherent in all of our business activities and managing risk well is the responsibility of every Xapien. Sound risk management enables us to serve our customers and deliver value for our shareholders, and helps make Xapo a great place to work.&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&amp;nbsp;&lt;/p&gt;\n&lt;p style=&quot;text-align: left;&quot;&gt;&lt;em&gt;&lt;span style=&quot;font-weight: 500;&quot;&gt;Although we are headquartered in Gibraltar, this is a full time, 100% remote position&amp;nbsp;&lt;br&gt;&lt;/span&gt;&lt;/em&gt;&lt;em&gt;&lt;span style=&quot;font-weight: 500;&quot;&gt;Work from anywhere!&lt;/span&gt;&lt;/em&gt;&lt;/p&gt;\n&lt;p style=&quot;text-align: left;&quot;&gt;&amp;nbsp;&lt;/p&gt;&lt;/div&gt;&lt;p&gt;&lt;strong&gt;&lt;em&gt;Position overview&lt;/em&gt;&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;We are seeking a Senior Data Engineer with significant experience in designing, building, and maintaining a scalable and robust Data Platform. The ideal candidate will be instrumental in enhancing our Data Platform, evolving our proprietary Data Platform SDK, automated data governance and quality frameworks, and leading innovative projects for data-driven decision-making. Reporting to the Head of Data and in close collaboration with the Platform Team, this role requires deep technical expertise, leadership, and a forward-thinking mindset to advance our data capabilities.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;&lt;em&gt;Responsibilities&lt;/em&gt;&lt;/strong&gt;&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;Develop and optimise our Data Platform on GCP, ensuring scalability, reliability, performance, and security.&lt;/li&gt;\n&lt;li&gt;Extend our proprietary Data Platform SDK and data infrastructure/pipelines, promoting automation and software development best practices.&lt;/li&gt;\n&lt;li&gt;Implement cutting-edge solutions to improve our automated data governance and data quality frameworks, ensuring data integrity and compliance.&lt;/li&gt;\n&lt;li&gt;Collaborate with cross-functional teams to understand data needs, deliver custom solutions, and support data-driven decision-making.&lt;/li&gt;\n&lt;li&gt;Build self-serve data products for internal customers.&lt;/li&gt;\n&lt;li&gt;Contribute to strengthening Xapo’s data culture and support engineers using the self-serve tools in the Data Platform.&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;&lt;strong&gt;&lt;em&gt;Skills needed&lt;/em&gt;&lt;/strong&gt;&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;5+ years of data engineering experience, with a proven track record in a senior role.&lt;/li&gt;\n&lt;li&gt;Strong proficiency in Python, with experience in developing SDKs or similar toolsets.&lt;/li&gt;\n&lt;li&gt;Strong proficiency in SQL and experience with relational and noSQL databases.&lt;/li&gt;\n&lt;li&gt;Deep knowledge of the GCP stack (BigQuery, Cloud Functions, Datastream, Dataflow, Vertex AI, Data Catalog, etc.) and familiarity with medallion architectures.&lt;/li&gt;\n&lt;li&gt;Extensive experience in batch and streaming data pipelines.&lt;/li&gt;\n&lt;li&gt;Demonstrated experience in designing and implementing automated data governance and data quality frameworks.&lt;/li&gt;\n&lt;li&gt;Excellent leadership and communication skills.&lt;/li&gt;\n&lt;li&gt;Methodical and logical problem-solving with accuracy and attention to detail.&lt;/li&gt;\n&lt;li&gt;Experience with Terraform and infrastructure as code principles is a plus.&lt;/li&gt;\n&lt;li&gt;Prior experience in fintech or the crypto market is preferred, offering a nuanced understanding of the unique challenges and opportunities in these sectors.&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;&lt;strong&gt;&lt;em&gt;Other requirements&lt;/em&gt;&lt;/strong&gt;&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;A dedicated workspace.&lt;/li&gt;\n&lt;li&gt;A reliable internet connection with the fastest speed possible in your area.&lt;/li&gt;\n&lt;li&gt;Devices and other essential equipment that meet minimal technical specifications.&lt;/li&gt;\n&lt;li&gt;Alignment with Our Values and the Xapo Values-Driven Leadership principles.&lt;/li&gt;\n&lt;/ul&gt;&lt;div class=&quot;content-conclusion&quot;&gt;&lt;p&gt;&lt;span style=&quot;font-size: 12pt;&quot;&gt;&lt;strong&gt;Why work for Xapo?&lt;/strong&gt;&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span style=&quot;font-weight: 500; font-size: 10pt;&quot;&gt;IMPACT GLOBALLY, WORK REMOTELY.&lt;/span&gt;&lt;/p&gt;\n&lt;ul&gt;\n&lt;li style=&quot;font-weight: 500;&quot;&gt;&lt;strong&gt;Shape the Future:&lt;/strong&gt;&lt;span style=&quot;font-weight: 500;&quot;&gt; Improve lives through cutting-edge technology, work 100% remotely from anywhere in the world.&lt;/span&gt;&lt;/li&gt;\n&lt;li style=&quot;font-weight: 500;&quot;&gt;&lt;strong&gt;Great work-life balance:&lt;/strong&gt;&lt;span style=&quot;font-weight: 500;&quot;&gt; &lt;/span&gt;&lt;span style=&quot;font-weight: 500;&quot;&gt;Build amazing things with a balance of autonomy and collaborative teamwork. Set your own work schedule and make use of a flexible PTO plan when you need to recharge.&lt;/span&gt;&lt;span style=&quot;font-weight: 500;&quot;&gt;&amp;nbsp;&lt;/span&gt;&lt;/li&gt;\n&lt;li style=&quot;font-weight: 500;&quot;&gt;&lt;strong&gt;Expect Excellence:&lt;/strong&gt;&lt;span style=&quot;font-weight: 500;&quot;&gt; Collaborate, learn, and grow with a high-performance team. Learn&lt;/span&gt;&lt;span style=&quot;font-weight: 500;&quot;&gt; how you learn best - from books to conferences, you’ll get a yearly budget for your individual learning and development goals.&lt;/span&gt;&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;&lt;strong&gt;At Xapo, we prioritize consumer protection and adhere to regulatory requirements by ensuring that all Xapiens are accountable for upholding principles of fair treatment, transparency, and ethical conduct in their interactions with customers and stakeholders.&lt;/strong&gt;&lt;/p&gt;&lt;/div&gt;","tags":"[\"management\",\"engineering\",\"database\"]","pubDate":"2024-08-09 14:34:23.000","link":"https://job-boards.greenhouse.io/xapo61/jobs/6083552003","savedDate":"2024-08-12 01:40:31.538","slug":"senior-data-engineer-xapo-bank-1512"},{"id":3176820271,"title":"Senior Frontend Engineer","company":"Staking Rewards","image":"https://remotive.com/job/1929800/logo","description":"<div class=\"h1\" style=\"margin-top: 40px; margin-bottom: 20px; font-weight: 300; line-height: 1.4; color: #444444; padding: 0px; border-style: initial; font-variant-numeric: inherit; font-variant-east-asian: inherit; font-variant-alternates: inherit; font-variant-position: inherit; font-stretch: inherit; font-optical-sizing: inherit; font-kerning: inherit; font-feature-settings: inherit; font-variation-settings: inherit; vertical-align: baseline; letter-spacing: 0.5px;\">About Staking Rewards</div>\n<p style=\"margin-bottom: 20px; padding: 0px; border-style: initial; font-variant-numeric: inherit; font-variant-east-asian: inherit; font-variant-alternates: inherit; font-variant-position: inherit; font-stretch: inherit; line-height: 1.7; font-optical-sizing: inherit; font-kerning: inherit; font-feature-settings: inherit; font-variation-settings: inherit; vertical-align: baseline; text-rendering: optimizelegibility; color: #444444; letter-spacing: 0.5px;\">Staking Rewards is at the forefront of cryptocurrency innovation, dedicated to making staking safe and accessible. Our team of 20 passionate individuals operates a platform frequented by over 250,000 users monthly, alongside a robust API utilized by industry giants like Bloomberg, Binance, and Coinbase.</p>\n<p style=\"margin-bottom: 20px; padding: 0px; border-style: initial; font-variant-numeric: inherit; font-variant-east-asian: inherit; font-variant-alternates: inherit; font-variant-position: inherit; font-stretch: inherit; line-height: 1.7; font-optical-sizing: inherit; font-kerning: inherit; font-feature-settings: inherit; font-variation-settings: inherit; vertical-align: baseline; text-rendering: optimizelegibility; color: #444444; letter-spacing: 0.5px;\">Backed by prestigious investors such as Galaxy Digital, Coinshares, and Digital Currency Group, we are entering a pivotal phase due to the booming staking sector. Facing numerous challenges, we are poised for significant growth and believe our top-tier team is key to advancing our mission.</p>\n<div class=\"h1\" style=\"margin-top: 40px; margin-bottom: 20px; font-weight: 300; line-height: 1.4; color: #444444; padding: 0px; border-style: initial; font-variant-numeric: inherit; font-variant-east-asian: inherit; font-variant-alternates: inherit; font-variant-position: inherit; font-stretch: inherit; font-optical-sizing: inherit; font-kerning: inherit; font-feature-settings: inherit; font-variation-settings: inherit; vertical-align: baseline; letter-spacing: 0.5px;\">This Role</div>\n<p style=\"margin-bottom: 20px; padding: 0px; border-style: initial; font-variant-numeric: inherit; font-variant-east-asian: inherit; font-variant-alternates: inherit; font-variant-position: inherit; font-stretch: inherit; line-height: 1.7; font-optical-sizing: inherit; font-kerning: inherit; font-feature-settings: inherit; font-variation-settings: inherit; vertical-align: baseline; text-rendering: optimizelegibility; color: #444444; letter-spacing: 0.5px;\">The Senior Frontend Engineer position is fully remote, available to candidates within <span style=\"font-weight: 600; margin: 0px; padding: 0px; border-style: initial; font-style: inherit; font-variant: inherit; font-stretch: inherit; line-height: inherit; font-optical-sizing: inherit; font-kerning: inherit; font-feature-settings: inherit; font-variation-settings: inherit; vertical-align: baseline;\">WEST +/- 3</span> time zones.</p>\n<div class=\"h2\" style=\"line-height: 1.4; color: #444444; margin-top: 40px; margin-bottom: 20px; padding: 0px; border-style: initial; font-variant-numeric: inherit; font-variant-east-asian: inherit; font-variant-alternates: inherit; font-variant-position: inherit; font-stretch: inherit; font-optical-sizing: inherit; font-kerning: inherit; font-feature-settings: inherit; font-variation-settings: inherit; vertical-align: baseline; letter-spacing: 0.5px;\">Who We Are Looking For</div>\n<p style=\"margin-bottom: 20px; padding: 0px; border-style: initial; font-variant-numeric: inherit; font-variant-east-asian: inherit; font-variant-alternates: inherit; font-variant-position: inherit; font-stretch: inherit; line-height: 1.7; font-optical-sizing: inherit; font-kerning: inherit; font-feature-settings: inherit; font-variation-settings: inherit; vertical-align: baseline; text-rendering: optimizelegibility; color: #444444; letter-spacing: 0.5px;\">We seek an Engineer with a deep understanding of software design and the adeptness to apply these principles in various scenarios.</p>\n<p style=\"margin-bottom: 20px; padding: 0px; border-style: initial; font-variant-numeric: inherit; font-variant-east-asian: inherit; font-variant-alternates: inherit; font-variant-position: inherit; font-stretch: inherit; line-height: 1.7; font-optical-sizing: inherit; font-kerning: inherit; font-feature-settings: inherit; font-variation-settings: inherit; vertical-align: baseline; text-rendering: optimizelegibility; color: #444444; letter-spacing: 0.5px;\">Ideal candidates are curious, creative, capable of adapting quickly, and eager to embrace new and familiar technologies alike.</p>\n<p style=\"margin-bottom: 20px; padding: 0px; border-style: initial; font-variant-numeric: inherit; font-variant-east-asian: inherit; font-variant-alternates: inherit; font-variant-position: inherit; font-stretch: inherit; line-height: 1.7; font-optical-sizing: inherit; font-kerning: inherit; font-feature-settings: inherit; font-variation-settings: inherit; vertical-align: baseline; text-rendering: optimizelegibility; color: #444444; letter-spacing: 0.5px;\">You should be ready to challenge norms, take pride in your work, and have significant experience in React-based environments.</p>\n<div class=\"h2\" style=\"line-height: 1.4; color: #444444; margin-top: 40px; margin-bottom: 20px; padding: 0px; border-style: initial; font-variant-numeric: inherit; font-variant-east-asian: inherit; font-variant-alternates: inherit; font-variant-position: inherit; font-stretch: inherit; font-optical-sizing: inherit; font-kerning: inherit; font-feature-settings: inherit; font-variation-settings: inherit; vertical-align: baseline; letter-spacing: 0.5px;\">Engineering at Staking Rewards</div>\n<p style=\"margin-bottom: 20px; padding: 0px; border-style: initial; font-variant-numeric: inherit; font-variant-east-asian: inherit; font-variant-alternates: inherit; font-variant-position: inherit; font-stretch: inherit; line-height: 1.7; font-optical-sizing: inherit; font-kerning: inherit; font-feature-settings: inherit; font-variation-settings: inherit; vertical-align: baseline; text-rendering: optimizelegibility; color: #444444; letter-spacing: 0.5px;\">Our engineering environment is dynamic and fast-paced, constantly evolving to meet the changing needs of the crypto market and our business.</p>\n<p style=\"margin-bottom: 20px; padding: 0px; border-style: initial; font-variant-numeric: inherit; font-variant-east-asian: inherit; font-variant-alternates: inherit; font-variant-position: inherit; font-stretch: inherit; line-height: 1.7; font-optical-sizing: inherit; font-kerning: inherit; font-feature-settings: inherit; font-variation-settings: inherit; vertical-align: baseline; text-rendering: optimizelegibility; color: #444444; letter-spacing: 0.5px;\">Engineers at Staking Rewards are expected to be proactive, communicative, and open to innovative solutions.</p>\n<p style=\"margin-bottom: 20px; padding: 0px; border-style: initial; font-variant-numeric: inherit; font-variant-east-asian: inherit; font-variant-alternates: inherit; font-variant-position: inherit; font-stretch: inherit; line-height: 1.7; font-optical-sizing: inherit; font-kerning: inherit; font-feature-settings: inherit; font-variation-settings: inherit; vertical-align: baseline; text-rendering: optimizelegibility; color: #444444; letter-spacing: 0.5px;\">We strive for excellence, delivering strong solutions in a collaborative team setting.</p>\n<div class=\"h2\" style=\"line-height: 1.4; color: #444444; margin-top: 40px; margin-bottom: 20px; padding: 0px; border-style: initial; font-variant-numeric: inherit; font-variant-east-asian: inherit; font-variant-alternates: inherit; font-variant-position: inherit; font-stretch: inherit; font-optical-sizing: inherit; font-kerning: inherit; font-feature-settings: inherit; font-variation-settings: inherit; vertical-align: baseline; letter-spacing: 0.5px;\">Your Responsibilities</div>\n<p style=\"margin-bottom: 20px; padding: 0px; border-style: initial; font-variant-numeric: inherit; font-variant-east-asian: inherit; font-variant-alternates: inherit; font-variant-position: inherit; font-stretch: inherit; line-height: 1.7; font-optical-sizing: inherit; font-kerning: inherit; font-feature-settings: inherit; font-variation-settings: inherit; vertical-align: baseline; text-rendering: optimizelegibility; color: #444444; letter-spacing: 0.5px;\">As a Senior Frontend Engineer, you will tackle diverse challenges and make substantial contributions to our platform. Key responsibilities will include:</p>\n<ul style=\"\">\n<li style=\"\">Developing high-performing, secure web experiences.</li>\n<li style=\"\">Integrating robust security measures into code and technical practices.</li>\n<li style=\"\">Building for others: other developers on the team, for stakeholders and our users</li>\n<li style=\"\">Own the full vertical: shape, build, ship, monitor</li>\n</ul>\n<div class=\"h2\" style=\"line-height: 1.4; color: #444444; margin-top: 40px; margin-bottom: 20px; padding: 0px; border-style: initial; font-variant-numeric: inherit; font-variant-east-asian: inherit; font-variant-alternates: inherit; font-variant-position: inherit; font-stretch: inherit; font-optical-sizing: inherit; font-kerning: inherit; font-feature-settings: inherit; font-variation-settings: inherit; vertical-align: baseline; letter-spacing: 0.5px;\">How to Join Us</div>\n<p style=\"margin-bottom: 20px; padding: 0px; border-style: initial; font-variant-numeric: inherit; font-variant-east-asian: inherit; font-variant-alternates: inherit; font-variant-position: inherit; font-stretch: inherit; line-height: 1.7; font-optical-sizing: inherit; font-kerning: inherit; font-feature-settings: inherit; font-variation-settings: inherit; vertical-align: baseline; text-rendering: optimizelegibility; color: #444444; letter-spacing: 0.5px;\">To apply, please submit your social profiles (Twitter, LinkedIn, personal website) and your GitHub link. We look forward to understanding how you can contribute to our team's success.</p>\n<img src=\"https://remotive.com/job/track/1929800/blank.gif?source=public_api\" alt=\"\"/>","tags":"[\"api\",\"crypto\",\"frontend\",\"react\",\"security\",\"github\"]","pubDate":"2024-08-09 12:16:03.000","link":"https://remotive.com/remote-jobs/software-dev/senior-frontend-engineer-1929800","savedDate":"2024-08-12 01:40:31.534","slug":"senior-frontend-engineer-staking-rewards-8263"},{"id":7913646726,"title":"Social Media and Influencer Marketing Specialist (Poland)","company":"Airalo","image":"https://lever-client-logos.s3.us-west-2.amazonaws.com/55028a36-609c-479c-9553-d4689ff2dd8c-1669620566663.png","description":"<div><b>About Airalo</b></div><div>Alo! Airalo is the world’s first eSIM store that helps people connect in over 200+ countries and regions across the globe. We are building the next digital service that revolutionizes the telecom industry. We are a travel-tech company and an equal-opportunity environment that values and executes diversity, inclusion, and equity. Our team is spread across 50+ countries and six continents. What glues us together is our commitment to changing the way you connect<span style=\"font-size: 13.3333px\">. </span></div><div><br></div><div><b>About you</b></div><div>We hope that you care deeply about the quality of your work, the intrinsic worth of tasks, and the success of your team. You are self-disciplined and do not require micromanagement in terms of your skillset and work ethic. You do your best to flourish as an individual every day while working hard to foster a collaborative team environment. You believe in the importance of being — and staying — authentic, honest, positive, and kind. You are a good interlocutor with clear and concise communication. You are able to manage multiple projects, have an analytical mind, pay keen attention to detail, and love to get your hands dirty. You are cognizant, tolerant, and welcoming of vulnerabilities and cultural differences.</div><div><br></div><div><b>About the Role</b></div><div><b>Position</b>: Full-time / Employee</div><div><b>Location:</b>&nbsp;Remote-first </div><div><b>Benefits:</b>&nbsp;Health Insurance, work-from-anywhere stipend, annual wellness &amp; learning credits, annual all-expenses-paid company retreat in a gorgeous destination &amp; other benefits</div><div><br></div><div>Airalo is seeking a talented and highly motivated Social Media and Influencer Marketing Specialist to join our European marketing team and grow the markets in Poland.</div><div>You will be responsible for guiding the strategy and development of our entire social media ecosystem in your markets and you will develop and execute influencer marketing campaigns to raise brand awareness, drive user engagement and boost conversions.</div><div>This role offers an exciting opportunity to work with some of the most influential voices in the travel and tech industry.</div><h3>Responsibilities include but are not limited to:</h3><li><b>Strategy Development and Campaign Planning:</b> Brainstorm, develop and execute end-to-end influencer marketing campaigns aligned with Airalo's goals and target audience.</li><li><b>Identify and Recruit Influencers:</b> Partner with relevant Polish influencers, content creators and/or agencies to create authentic and engaging content that showcases Airalo's products.</li><li><b>Social Media Strategy:</b> Develop and execute an effective social media strategy tailored to the Polish markets to increase brand awareness, engagement, and lead generation.</li><li><b>Community Engagement:</b> Monitor and actively engage with the Airalo community on social media platforms, respond to comments, questions, and feedback promptly, and build positive relationships with followers.</li><li><b>Performance Analysis and Reporting:</b> Monitor, analyze performance and prepare reports on the ROI and effectiveness of influencer marketing efforts, including KPIs and metrics</li><li><b>Budget Management:</b> Effectively manage the budget allocated for influencer marketing campaigns, ensuring efficient use of resources.</li><li><b>Compliance and Contracts:</b> Ensure that influencer partnerships comply with legal regulations and company policies. Manage influencer contracts and negotiations.</li><li><b>Crisis Management:</b> Handle potential social media crises effectively, maintain a positive brand image, and address customer concerns professionally. And ensure compliance with local laws (e.g., copyright and data protection)</li><li><b>Stay Up-to-Date:</b> Stay informed about industry trends, emerging influencers, and new platforms to continuously adapt and enhance Airalo's influencer marketing strategies.</li>,<h3>Must-haves</h3><li>At least 3+ years of experience in a similar role, even better if in the travel industry. Strong experience with <b>social media and influencer marketing</b> is a must.</li><li>Knowledge of the Polish markets and fluency in English and Polish, impeccable verbal and written communication skills.</li><li>Extensive experience in brand management, content, social media, influencer and market insight with an in-depth understanding of the social and digital space.</li><li>Excellent knowledge of Instagram/Facebook, TikTok, Youtube, Twitter, Telegram, Linkedin, Snapchat (and other eventual emerging social media) and abreast of social media best practices, and regional, and global trends.</li><li>Owning a project that is not strictly part of your job description excites you and you take it as an opportunity to learn something new.</li><li>Superior internal &amp; external communication &amp; cross-functional stakeholder management skills</li><li>Enjoying and excelling at handling multiple projects simultaneously in a matrix &amp; complex environment.</li><li>Good time management with an eye for perfection &amp; a strong operational background.</li>,<h3>Good to have</h3><li>Prior experience in the tech, travel, or telecommunications industry</li><li>A network of Polish influencers or influencer agencies you already worked with</li><li>Certificates and/or courses in digital marketing</li><div><span style=\"font-size: 16px\">If you are interested in this position, please</span><b style=\"font-size: 16px\">&nbsp;apply via the link.</b></div><div><br></div><div><i>We sincerely thank all applicants in advance for submitting their interest in this opportunity with Airalo. </i></div>","tags":"[\"management\",\"legal\",\"aws\"]","pubDate":"2024-08-09 09:06:30.241","link":"https://jobs.lever.co/airalo/c4513656-2967-452f-804f-21e839060599","savedDate":"2024-08-12 01:40:31.537","slug":"social-media-and-influencer-marketing-specialist-poland-airalo-3827"}]