[{"id":6189187430,"title":"Embedded Linux Senior Software Engineer - Optimisation","company":"Canonical","image":"https://pbs.twimg.com/profile_images/1673959375340290050/x7pNtXQ7_400x400.jpg","description":"\n      <p>Work across the full Linux stack from kernel through GUI to optimise Ubuntu, the world’s most widely used Linux desktop and server, for the latest silicon.</p>\n<p>The role is a fast-paced, problem-solving role that’s challenging yet very exciting. The right candidate must be resourceful, articulate, and able to deliver on a wide variety of solutions across PC and IoT technologies. Our teams partner with specialist engineers from major silicon companies to integrate next-generation features and performance enhancements for upcoming hardware.</p>\n<p><strong>Location:</strong> <em>This is a Globally remote role</em></p>\n<h2>What your day will look like</h2>\n<ul>\n<li>Design and implement the best Ubuntu integration for the latest IoT and server-class hardware platforms and software stacks</li>\n<li>Work with partners to deliver a delightful, optimised, first class Ubuntu experience on their platforms</li>\n<li>Take a holistic approach to the Ubuntu experience on partner platforms with inputs on technical plans, testing strategy, quality metrics</li>\n<li>Participate as technical lead on complex customer engagements involving complete system architectures from cloud to edge</li>\n<li>Help our customers integrate their apps, SDKs, build device OS images, optimize applications with Ubuntu Core, Desktop and Server</li>\n<li>Work with the most advanced operating systems and application technologies available in the enterprise world.</li>\n</ul>\n<p>Joining Canonical, you will partner with bright minds from all over the world, and work with an exciting set of new technologies in a fast growing company with a truly unique and ambitious vision to build a better platform with free software. You will work with customers on exciting IoT and server platforms and technologies, built to support different verticals: from robots to data centers, from telco to retail.</p>\n<h2>What we are looking for in you</h2>\n<ul>\n<li>You love technology and working with brilliant people</li>\n<li>You have a Bachelor’s degree in Computer Science, STEM or similar&nbsp;</li>\n<li>You have experience with Linux packaging (Debian, RPM, Yocto)</li>\n<li>You have experience working with open source communities and licences</li>\n<li>You have experience working with C, C++</li>\n<li>You can work in a globally distributed team through self-discipline and self-motivation.</li>\n</ul>\n<h2>Additional skills that you might also bring</h2>\n<ul>\n<li>Experience with graphics stacks</li>\n<li>Good understanding of networking - TCP/IP, DHCP, HTTP/REST</li>\n<li>Basic understanding of security best practices in IoT or server environments</li>\n<li>Good communication skills, ideally public speaking experience</li>\n<li>IoT / Embedded experience – from board and SoC, BMCs, bootloaders and firmware to OS, through apps and services</li>\n<li>Some experience with Docker/OCI containers/K8s</li>\n</ul>\n<h2>What we offer you</h2>\n<p>Your base pay will depend on various factors including your geographical location, level of experience, knowledge and skills. In addition to the benefits above, certain roles are also eligible for additional benefits and rewards including annual bonuses and sales incentives based on revenue or utilisation. Our compensation philosophy is to ensure equity right across our global workforce.&nbsp;&nbsp;</p>\n<p>In addition to a competitive base pay, we provide all team members with additional benefits, which reflect our values and ideals. Please note that additional benefits may apply depending on the work location and, for more information on these, you can ask in the later stages of the recruitment process.</p>\n<ul>\n<li>Fully remote working environment - we’ve been working remotely since 2004!</li>\n<li>Personal learning and development budget of 2,000USD per annum</li>\n<li>Annual compensation review</li>\n<li>Recognition rewards</li>\n<li>Annual holiday leave</li>\n<li>Parental Leave</li>\n<li>Employee Assistance Programme</li>\n<li>Opportunity to travel to new locations to meet colleagues at ‘sprints’</li>\n<li>Priority Pass for travel and travel upgrades for long haul company events</li>\n</ul>\n<h2>About Canonical</h2>\n<p>Canonical is a pioneering tech firm that is at the forefront of the global move to open source. As the company that publishes Ubuntu, one of the most important open source projects and the platform for AI, IoT and the cloud, we are changing the world on a daily basis. We recruit on a global basis and set a very high standard for people joining the company. We expect excellence - in order to succeed, we need to be the best at what we do.</p>\n<p>Canonical has been a remote-first company since its inception in 2004.​ Work at Canonical is a step into the future, and will challenge you to think differently, work smarter, learn new skills, and raise your game. Canonical provides a unique window into the world of 21st-century digital business.</p>\n<h2>Canonical is an equal opportunity employer</h2>\n<p>We are proud to foster a workplace free from discrimination. Diversity of experience, perspectives, and background create a better work environment and better products. <a href=\"https://canonical.com/careers/diversity/identity\">Whatever your identity, we will give your application fair consideration.</a></p>\n<p>#LI-remote&nbsp;</p><p>Requisition ID: 829</p><p></p>\n    ","tags":"[]","pubDate":"2025-02-11T11:47:49.112Z","link":"https://canonical.com/careers/6189337","slug":"embedded-linux-senior-software-engineer-optimisation-canonical-1290"},{"id":3155807147,"title":"Product Designer","company":"Kit","image":"https://avatars.githubusercontent.com/u/10557747?s=200&v=4","description":"&lt;div class=&quot;content-intro&quot;&gt;&lt;h4&gt;Description&lt;/h4&gt;\n&lt;div&gt;\n&lt;p class=&quot;p1&quot;&gt;Kit is an email-first operating system for creators who mean business. We help creators grow and monetize their audience with ease. For coaches, YouTubers, authors, podcasters, and other creatives, there isn’t a better marketing hub to rely on to grow audiences, automate email marketing, and sell digital products - all within one platform. More importantly, there isn’t a team more committed to helping creators earn a living.&lt;/p&gt;\n&lt;p&gt;We’re on a mission to help creators earn $1 billion using our creator marketing platform. We have always been 100% independent and 100% remote. We are proud to have built a product that our customers love, and we look for people who have enthusiasm and belief in our mission, vision, and values to join our team.&lt;/p&gt;\n&lt;p&gt;The Kit culture is one where emotional intelligence is valued, radical candor is encouraged, and where everyone works together to uphold a set of shared team principles.&lt;/p&gt;\n&lt;hr&gt;\n&lt;p&gt;&amp;nbsp;&lt;/p&gt;\n&lt;/div&gt;&lt;/div&gt;&lt;h4&gt;&lt;strong&gt;The role&amp;nbsp;&lt;/strong&gt;&lt;/h4&gt;\n&lt;p&gt;We’re hiring a &lt;strong&gt;Product Designer&lt;/strong&gt; for the Analytics, Compliance, and Security team. You will lead the design of new analytics and reporting functionality, which is critical for customer satisfaction and retention.&lt;/p&gt;\n&lt;p&gt;We’re looking for a well-rounded product designer with strong skills in visual design, interaction design, product analysis and user research. A background in data visualization design will be especially beneficial for this role.&lt;/p&gt;\n&lt;p&gt;As part of our product design team, you’ll report to the Director of Product Design and will be the fourth member of our product design team. You will work closely with your product squad—a product manager, an engineering manager, and 5 to 8 engineers—to help shape the future of our platform.&lt;/p&gt;\n&lt;h4&gt;&lt;strong&gt;Responsibilities&lt;/strong&gt;&lt;/h4&gt;\n&lt;p&gt;As a Product Designer, you will:&amp;nbsp;&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;Analyze user behavior using tools such as Mixpanel to identify opportunities to improve users’ experience.&amp;nbsp;&lt;/li&gt;\n&lt;li&gt;Proactively conduct user research to understand our customers&#39; preferences and pain points. Conduct usability testing to validate design solutions.&amp;nbsp;&lt;/li&gt;\n&lt;li&gt;Use Figma to create prototypes and high-fidelity designs.&amp;nbsp;&lt;/li&gt;\n&lt;li&gt;Ensure your designs are annotated with functional specifications that communicate to engineers how the designs will function and behave.&lt;/li&gt;\n&lt;li&gt;Maintain consistency in the product by using standard design patterns from our design system. Contribute new patterns and variants to the design system when needed.&lt;/li&gt;\n&lt;li&gt;Solicit and incorporate feedback from users, PMs, engineers, and other stakeholders on your designs.&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;&lt;strong&gt;Requirements&lt;/strong&gt;&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;A track record of delivering impactful solutions on complex web applications.&amp;nbsp;&lt;/li&gt;\n&lt;li&gt;Experience connecting their work to product metrics and business goals.&amp;nbsp;&lt;/li&gt;\n&lt;li&gt;5+ years of product design experience, ideally on a SaaS product design team, as an individual contributor working collaboratively with product managers and engineers.&amp;nbsp;&lt;/li&gt;\n&lt;li&gt;A portfolio that showcases the impact your work has had and your interaction design, visual design, and user research skills.&amp;nbsp;&lt;/li&gt;\n&lt;li&gt;Strong ability to partner with product management to align your priorities with the product roadmap.&amp;nbsp;&lt;/li&gt;\n&lt;li&gt;Proficiency in Figma and working with and contributing to an established design system.&lt;/li&gt;\n&lt;li&gt;Experience conducting user research activities such as interviews, usability testing, and surveys to inform design decisions.&lt;/li&gt;\n&lt;li&gt;Excellent time management skills with the ability to prioritize your workload effectively to deliver high-quality work on time with minimal supervision.&lt;/li&gt;\n&lt;li&gt;Strong communication and collaboration skills with the ability to effectively articulate design concepts and rationale to stakeholders at all levels.&amp;nbsp;&lt;/li&gt;\n&lt;li&gt;A few hours of overlap with EST. Whilst we try to keep scheduled meetings to a minimum, for this role, it’s essential you attend planning and retro meetings with your colleagues. Typically, these will occur between 9am to 2pm EST.&lt;/li&gt;\n&lt;/ul&gt;\n&lt;h4&gt;&lt;strong&gt;Benefits Section&lt;/strong&gt;&amp;nbsp;&lt;/h4&gt;\n&lt;p&gt;Kit has standardized salaries based on position, no matter where you live. For this role, we’re hiring at Level 3 ($138,500) or Level 4 ($169,000). The level is determined based on experience and our interview process.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Perks + benefits include:&lt;/strong&gt;&lt;/p&gt;\n&lt;ul&gt;\n&lt;li data-stringify-indent=&quot;0&quot; data-stringify-border=&quot;0&quot;&gt;\n&lt;div&gt;&lt;a class=&quot;c-link&quot; href=&quot;https://www.linkedin.com/posts/nathanbarry_convertkit-compensation-model-activity-6991414959247147008-i9V3/?utm_source=share&amp;amp;utm_medium=member_desktop&quot; target=&quot;_blank&quot; data-stringify-link=&quot;https://www.linkedin.com/posts/nathanbarry_convertkit-compensation-model-activity-6991414959247147008-i9V3/?utm_source=share&amp;amp;utm_medium=member_desktop&quot; data-sk=&quot;tooltip_parent&quot;&gt;Profit Sharing&lt;/a&gt;&lt;/div&gt;\n&lt;/li&gt;\n&lt;li data-stringify-indent=&quot;0&quot; data-stringify-border=&quot;0&quot;&gt;Kit equity&lt;/li&gt;\n&lt;li data-stringify-indent=&quot;0&quot; data-stringify-border=&quot;0&quot;&gt;401k with a 5% match&lt;/li&gt;\n&lt;li data-stringify-indent=&quot;0&quot; data-stringify-border=&quot;0&quot;&gt;Monthly medical benefits up to $1,950 a month toward premiums. Dental and vision premiums covered 100%&lt;/li&gt;\n&lt;li data-stringify-indent=&quot;0&quot; data-stringify-border=&quot;0&quot;&gt;$4,000 equipment allowance for your first two years, $3,000 budget every following two years&lt;/li&gt;\n&lt;li data-stringify-indent=&quot;0&quot; data-stringify-border=&quot;0&quot;&gt;Individual learning + development budget ($3,500/year)&lt;/li&gt;\n&lt;li data-stringify-indent=&quot;0&quot; data-stringify-border=&quot;0&quot;&gt;Gender affirming benefits&lt;/li&gt;\n&lt;li data-stringify-indent=&quot;0&quot; data-stringify-border=&quot;0&quot;&gt;Childcare benefit up to $3,000 annually&lt;/li&gt;\n&lt;li data-stringify-indent=&quot;0&quot; data-stringify-border=&quot;0&quot;&gt;Twenty (20) days of paid time off during each year of employment&lt;/li&gt;\n&lt;li data-stringify-indent=&quot;0&quot; data-stringify-border=&quot;0&quot;&gt;Paid paid vacation: An after-tax bonus of $1,000 for taking five consecutive days of vacation where you’re fully unplugged from work&lt;/li&gt;\n&lt;li data-stringify-indent=&quot;0&quot; data-stringify-border=&quot;0&quot;&gt;Ten (10) paid holidays a year&lt;/li&gt;\n&lt;li data-stringify-indent=&quot;0&quot; data-stringify-border=&quot;0&quot;&gt;Two weeks of paid sick time each year, including mental health + well being days&lt;/li&gt;\n&lt;li data-stringify-indent=&quot;0&quot; data-stringify-border=&quot;0&quot;&gt;Twelve (12) weeks paid parental leave and flexible scheduling in your child’s first year&lt;/li&gt;\n&lt;li data-stringify-indent=&quot;0&quot; data-stringify-border=&quot;0&quot;&gt;Up to six weeks of paid bereavement leave, medical leave, and disaster after six months of employment, two weeks of each paid leave in your first six months&lt;/li&gt;\n&lt;li data-stringify-indent=&quot;0&quot; data-stringify-border=&quot;0&quot;&gt;Winter Break Closure: Kit closes for a week at the end of December, giving everyone a collective break to enjoy the holiday season.&amp;nbsp;&lt;em data-stringify-type=&quot;italic&quot;&gt;Essential support services remain available, with teams coordinating to ensure coverage during this period&lt;/em&gt;&lt;/li&gt;\n&lt;li data-stringify-indent=&quot;0&quot; data-stringify-border=&quot;0&quot;&gt;Four-week, paid sabbatical after five years with the team&lt;/li&gt;\n&lt;li&gt;Fantastic in-person or virtual retreats with the team twice a year&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;&amp;nbsp;&lt;/p&gt;\n&lt;h4&gt;&lt;strong&gt;How to Apply&lt;/strong&gt;&lt;/h4&gt;\n&lt;p&gt;We usually receive a large number of applications, and our goal is to follow up with you within two weeks. You’ll hear from us either way. Here’s what you can expect from the rest of our hiring process:&lt;/p&gt;\n&lt;ol&gt;\n&lt;li data-stringify-indent=&quot;0&quot; data-stringify-border=&quot;0&quot;&gt;Portfolio review&lt;/li&gt;\n&lt;li data-stringify-indent=&quot;0&quot; data-stringify-border=&quot;0&quot;&gt;30 min - Recruiter screen&lt;/li&gt;\n&lt;li data-stringify-indent=&quot;0&quot; data-stringify-border=&quot;0&quot;&gt;45 min - Hiring Manager screen&lt;/li&gt;\n&lt;li data-stringify-indent=&quot;0&quot; data-stringify-border=&quot;0&quot;&gt;60 min - Project presentation with the team&lt;/li&gt;\n&lt;li data-stringify-indent=&quot;0&quot; data-stringify-border=&quot;0&quot;&gt;60 min - Culture Contribution Chat&lt;/li&gt;\n&lt;li data-stringify-indent=&quot;0&quot; data-stringify-border=&quot;0&quot;&gt;Take-home test&lt;/li&gt;\n&lt;li data-stringify-indent=&quot;0&quot; data-stringify-border=&quot;0&quot;&gt;30 min- Wrap up with the Hiring Manager&lt;/li&gt;\n&lt;li data-stringify-indent=&quot;0&quot; data-stringify-border=&quot;0&quot;&gt;Reference Checks&lt;/li&gt;\n&lt;/ol&gt;\n&lt;p&gt;We’ll keep you informed through every step. To get started, complete this application, including a cover letter and answers to the questions on the next page. We read every single application, and your cover letter and responses help put your experience into context.&lt;/p&gt;&lt;div class=&quot;content-conclusion&quot;&gt;&lt;hr&gt;\n&lt;p&gt;&amp;nbsp;&lt;/p&gt;\n&lt;p&gt;Kit is an equal opportunity employer. We value diversity in all of its forms, and we hire the best person we can for each role, no matter your personal background. Research tells us that applicants who are female or non-binary, as well as applicants who are people of color, are less likely to apply for roles they do not feel 100% qualified for. If you think you meet more than 50% of our requirements but fewer than 100% of them, please apply. We’re imperfect communicators, so think of our job postings as the starting point for discussion rather than proof that you shouldn’t apply.&lt;/p&gt;\n&lt;p&gt;Kit does not discriminate on the basis of race, sex, color, religion, age, national origin, marital status, disability, veteran status, genetic information, sexual orientation, gender identity or any other reason prohibited by law in provision of employment opportunities and benefits.&lt;/p&gt;&lt;/div&gt;","tags":"[\"management\",\"engineering\"]","pubDate":"2025-02-11T03:19:14.000Z","link":"https://job-boards.greenhouse.io/convertkit/jobs/4648528007","slug":"product-designer-kit-4678"},{"id":6201455245,"title":"PL Engenharia de Software (Java e React) ","company":"ília","image":"https://avatars.githubusercontent.com/u/35933823?s=200&v=4","description":"&lt;p&gt;Aqui na ília nossas vagas estão sempre abertas para todas as pessoas e não se restringem quanto a gênero, etnia, orientação sexual, fatores sociais, condições físicas ou intelectuais (PCD) etc. Incentivamos a candidatura de integrantes de todos os grupos minoritários!&lt;/p&gt;\n&lt;h3&gt;&lt;strong&gt;Sobre a ília&lt;/strong&gt;&lt;/h3&gt;\n&lt;p&gt;Somos especialistas em tecnologia, dados e design, impulsionando a transformação digital de grandes players do mercado há mais de 10 anos, nos setores financeiro, seguros e mobilidade. Com mais de 450 profissionais, estamos presentes no Brasil e Europa, atendendo aos mercados da América Latina, Europa e América do Norte, desenvolvendo produtos digitais de alta qualidade e com foco em resultados de negócios. Somos uma equipe inovadora, criativa e apaixonada por tecnologia.&amp;nbsp;&lt;/p&gt;\n&lt;p&gt;Certificada pelo 5° ano consecutivo como Great Place to work aqui na ília acreditamos que pessoas mudam o mundo, e investimos nelas. Nossas awesome deliveries são feitas de pessoas para pessoas, afinal awesome people make awesome deliveries!&amp;nbsp;&lt;/p&gt;\n&lt;p&gt;#Vempraília&lt;/p&gt;\n&lt;h3&gt;&lt;strong&gt;Sobre a vaga:&lt;/strong&gt;&amp;nbsp;&lt;/h3&gt;\n&lt;ul&gt;\n&lt;li&gt;Desenvolver soluções escaláveis e resilientes;&amp;nbsp;&amp;nbsp;&amp;nbsp;&lt;/li&gt;\n&lt;li&gt;Apresentar melhorias nos sistemas existentes e garantir a qualidade nas entregas;&amp;nbsp;&lt;/li&gt;\n&lt;li&gt;Manter a qualidade do software verificando os processos, ferramentas e boas práticas disponíveis para o produto e tecnologia utilizados;&amp;nbsp;&amp;nbsp;&amp;nbsp;&lt;/li&gt;\n&lt;li&gt;Orientar desenvolvedores de menor senioridade apoiando suas dúvidas, disseminando seu conhecimento,&amp;nbsp;desenhando e arquitetando soluções ou indicando documentação de apoio;&lt;/li&gt;\n&lt;li&gt;Criar testes de alta complexidade, sejam estes manuais ou automatizados, que cubram o comportamento desejado dos componentes técnicos desenvolvidos utilizando os requisitos e ferramentas de testes&lt;/li&gt;\n&lt;/ul&gt;\n&lt;h3&gt;&lt;strong&gt;Requisitos:&lt;/strong&gt;&lt;/h3&gt;\n&lt;ul&gt;\n&lt;li&gt;Experiência em linguagens de programação Java.&lt;/li&gt;\n&lt;li&gt;Experiência em ReactNative e/ou ReactJS&amp;nbsp;&lt;/li&gt;\n&lt;li&gt;Conhecimento sólido em boas práticas de desenvolvimento;&lt;/li&gt;\n&lt;li&gt;Conhecimento sólido em Testes unitários e integrados;&amp;nbsp;&lt;/li&gt;\n&lt;li&gt;Design de APIs REST;&lt;/li&gt;\n&lt;li&gt;Compreensão e entendimento de arquitetura de microsserviços;&lt;/li&gt;\n&lt;li&gt;Experiência em metodologias ágeis.&lt;/li&gt;\n&lt;li&gt;Conhecimentos em bancos de dados (SQL e NoSQL&lt;/li&gt;\n&lt;/ul&gt;\n&lt;h3&gt;&lt;strong&gt;Benefícios e Incentivos:&lt;/strong&gt;&lt;/h3&gt;\n&lt;p&gt;Nossa contratação é CLT- 40h semanais com jornada flexível, sendo executada 100% de forma remota. Os benefícios da ília são pensados para proporcionar uma experiência AWESOME para cada ílian, abaixo você encontra os benefícios de forma resumida. #vempraília&lt;/p&gt;\n&lt;p&gt;Para Saúde e bem-estar:&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;Plano de Saúde e Odontológico SulAmérica extensivo a dependentes;&lt;/li&gt;\n&lt;li&gt;Vale Alimentação/Refeição em cartão fléxivel Picpay benefícios&amp;nbsp;&lt;/li&gt;\n&lt;li&gt;Seguro de Vida;&lt;/li&gt;\n&lt;li&gt;Auxílio Home-Office em cartão fléxivel Picpay benefícios;&lt;/li&gt;\n&lt;li&gt;Wellhub (Gympass)&lt;/li&gt;\n&lt;li&gt;TotalPass&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;Para o seu Desenvolvimento:&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;ília University: Universidade Corporativa com mais de 20 mil cursos disponíveis para desenvolvimento pessoal e profissional;&lt;/li&gt;\n&lt;li&gt;Language Academy: Escola de idiomas para ílians;&lt;/li&gt;\n&lt;li&gt;í-talks e Chapter: Momentos e cerimônias em que o time compartilha práticas, estudos, projetos e ideias. Nas chapters ainda se reúnem pessoas com skills similares para compartilhamento de ideias, práticas e experiências;&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;Gostamos de ir além no cuidado com as nossas pessoas, então dispomos também de alguns benefícios não convencionais:&amp;nbsp;&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;Plano de Saúde PET- Guapeco&amp;nbsp;&lt;/li&gt;\n&lt;li&gt;BYOD- Alugamos o seu notebook pessoal te pagando um valor mensal para que você o use, mas disponibilizamos também máquinas de trabalho para ílians. Você quem decide!&lt;/li&gt;\n&lt;li&gt;Seu Niver, seu bolo!&lt;/li&gt;\n&lt;li&gt;Seu Networking Vale Prêmio- Programa de premiação a indicação de novos funcionários.&lt;/li&gt;\n&lt;/ul&gt;","tags":"[\"finance\"]","pubDate":"2025-02-11T01:45:38.000Z","link":"https://boards.greenhouse.io/ilia/jobs/5445719004","slug":"pl-engenharia-de-software-java-e-react-lia-5352"},{"id":6409629998,"title":"Java Developer Relations (DevRel) Engineer - TuxCare (worldwide remote, work any","company":"CloudLinux","image":"https://avatars.githubusercontent.com/u/16290369?s=200&v=4","description":"<p></p><p>TuxCare is seeking a dedicated and experienced Java Developer Relations (DevRel) Engineer to serve as the voice and liaison for our endless lifecycle support services. Our unique offering ensures that various Java projects continue to receive support well beyond their official end-of-life, keeping critical systems running smoothly. In this role, you will engage with Java communities, advocate for our legacy support services, and help bridge the gap between established, mature systems and the developers who rely on them. Your technical expertise and clear communication will be key in promoting how TuxCare empowers organizations to sustain their Java environments over the long term.</p><h3>Key Responsibilities</h3><ul> <li>Developer Engagement:</li> <ul> <li>Act as the primary point of contact for Java developers and technical communities focused on legacy systems.</li> <li>Cultivate strong relationships with community leaders, influencers, and groups that manage or maintain Java projects beyond their standard support lifecycles.</li> </ul> <li>Content Creation &amp; Technical Evangelism:</li> <ul> <li>Develop high-quality technical content (blog posts, tutorials, webinars, documentation) that explains the benefits and best practices of using TuxCare’s endless lifecycle support.</li> <li>Deliver presentations, workshops, and live sessions that illustrate how to maintain and modernize legacy Java projects using our services.</li> </ul> <li>Community Building &amp; Event Participation:</li> <ul> <li>Organize and participate in meetups, conferences, webinars, and industry events focused on Java and legacy system maintenance.</li> <li>Develop strategies to grow and nurture our developer community, ensuring sustained engagement and knowledge sharing on legacy support topics.</li> </ul> <li>Feedback Loop &amp; Product Advocacy:</li> <ul> <li>Gather and relay insights from the community to inform product enhancements and better align our support services with customer needs.</li> <li>Collaborate with product, engineering, and marketing teams to ensure our messaging resonates with developers managing mature Java systems.</li> </ul> <li>Social Media &amp; Online Presence:</li> <ul> <li>Represent TuxCare on online forums, social media platforms, and developer communities, focusing on topics related to long-term support and sustainability of Java projects.</li> <li>Monitor trends and discussions within the Java ecosystem to position TuxCare as the go-to resource for endless lifecycle support.</li> </ul> </ul><p><strong>Requirements</strong></p><h3>What You’ll Bring</h3><ul> <li>Technical Expertise in Java:</li> <ul> <li>In-depth understanding of Java, including its frameworks, tooling, and the challenges of maintaining legacy systems.</li> <li>Hands-on experience in Java development and familiarity with the best practices for supporting long-term, mission-critical projects.</li> </ul> <li>Proven Developer Advocacy Experience:</li> <ul> <li>Demonstrated success in developer relations, advocacy, or community management, especially within environments that emphasize legacy or long-term support.</li> <li>Experience engaging with developer communities and driving initiatives that address the unique needs of systems past their end-of-life.</li> </ul> <li>Exceptional Communication Skills:</li> <ul> <li>Strong written and verbal communication abilities, with a talent for translating complex technical concepts into clear, actionable insights.</li> <li>Experience in public speaking and content creation tailored for technical audiences.</li> </ul> <li>Content Creation &amp; Social Engagement:</li> <ul> <li>Proficiency in creating diverse forms of content (articles, videos, tutorials) that address both the challenges and solutions for maintaining legacy Java systems.</li> <li>Familiarity with using social media and digital platforms to engage with technical communities and share expert knowledge.</li> </ul> <li>Collaborative &amp; Proactive Mindset:</li> <ul> <li>A team player who thrives in cross-functional environments and is proactive in driving initiatives forward.</li> <li>A passion for helping organizations extend the life and performance of their Java applications, ensuring stability and continuity.</li> </ul> </ul><h3>Why TuxCare?</h3><p>At TuxCare, our mission is to empower organizations by providing continuous support for Java projects long after their official end-of-life. As a Java Developer Relations Engineer, you will have the unique opportunity to shape the conversation around legacy support, ensuring that critical systems remain robust and secure. If you are passionate about bridging the gap between legacy technology and modern operational demands, and you enjoy engaging with a dedicated developer community, we’d love to hear from you.</p><p><strong>Benefits</strong></p><p><strong>What's in it for you?</strong></p><ul> <li>A strong focus on professional development with opportunities for learning and growth:</li> <ul> <li>Interesting and challenging projects,</li> <li>Mentor and other knowledge-exchange programs.</li> </ul> <li>Fully remote work with flexible working hours, that allows you to schedule your day and work from any location worldwide.</li> <li>Paid 24 days of vacation per year, 10 days of national holidays, and unlimited sick leaves to ensure you maintain a healthy work-life balance.</li> <li>Compensation for private medical insurance.</li> <li>Co-working and gym/sports reimbursement.</li> <li>The opportunity to receive a reward for the most innovative idea that the company can patent, fostering a culture of creativity and innovation.</li> </ul><p></p><p><em>By applying for this position, you consent to the processing of your personal data as described in our Privacy Policy (</em><a href=\"https://cloudlinux.com/candidate-privacy-notice\" target=\"_blank\" rel=\"nofollow noreferrer noopener\" class=\"external\"><em>https://cloudlinux.com/candidate-privacy-notice</em></a><em>), which provides detailed information on how we maintain and handle your data.</em></p>","tags":"[\"management\",\"engineering\"]","pubDate":"2025-02-11T00:00:00.000Z","link":"https://apply.workable.com/j/308BC1BE4B","slug":"java-developer-relations-devrel-engineer-tuxcare-worldwide-remote-work-any-cloudlinux-2047"},{"id":8655563033,"title":"Head of Product & Growth","company":"Ruby Labs","image":"https://media.licdn.com/dms/image/v2/D4D0BAQF7VVv61POIFw/company-logo_200_200/company-logo_200_200/0/1721937953426?e=1743033600&v=beta&t=_qAkZ_qGO7Du2NSUdHDNbUKIbz28Y1HDm1g9mwNIOnk","description":"<h1><strong>About us</strong></h1><p style=\"min-height:1.5em\">Ruby Labs is a leading tech company that creates and operates innovative consumer products. We offer a diverse range of opportunities across the health, education, and entertainment industries. Our innovative teams are driving the future of consumer-led products, and we're always looking for passionate individuals to join us. Learn more about our story at: <a target=\"_blank\" rel=\"noopener noreferrer nofollow\" href=\"https://rubylabs.com/about-us/\">https://rubylabs.com/about-us/</a></p><p style=\"min-height:1.5em\"></p><h1><strong>About the role</strong></h1><p style=\"min-height:1.5em\">We are looking for an ambitious, experienced, and results-oriented Head of Product &amp; Growth at one of Ruby Labs fastest-growing portfolio companies in the legal-tech category. In this role, you will be in charge of product development, growth, strategy, feature prioritization, performance marketing, and driving enhancements to contribute to the overall profitability of the business. </p><p style=\"min-height:1.5em\"></p><h1><strong>Key Responsibilities</strong></h1><ul style=\"min-height:1.5em\"><li><p style=\"min-height:1.5em\">Product Strategy &amp; Development: Define and execute the product roadmap, prioritizing features that enhance higher revenue &amp; profitability and better user experience</p></li><li><p style=\"min-height:1.5em\">Growth &amp; Conversion Optimization: Develop and oversee an experimentation roadmap to improve conversion rates across all user acquisition funnels</p></li><li><p style=\"min-height:1.5em\">Competitor Analysis &amp; Opportunity Identification:<strong> </strong>Regularly conduct competitor analysis to identify growth and product experimentation opportunities</p></li><li><p style=\"min-height:1.5em\">A/B Testing &amp; Performance Optimization: Execute A/B testing and track performance to optimize conversion rates and overall user experience</p></li><li><p style=\"min-height:1.5em\">User Acquisition &amp; Performance Marketing: Optimize campaign performance, acquisition costs (CPA), and conversion volume to drive scalable growth</p></li><li><p style=\"min-height:1.5em\">Product Operations &amp; Execution: Manage daily team planning and reporting, ensuring all team execution aligns with business goals</p></li><li><p style=\"min-height:1.5em\">Analytics &amp; Reporting: Track product performance, ad campaign efficiency, and key business metrics, reporting insights to shareholders and leadership of the company.</p></li><li><p style=\"min-height:1.5em\">Strategic Growth Planning: Align product development with revenue growth, ensuring sustainable long-term expansion</p></li></ul><p style=\"min-height:1.5em\"></p><h1><strong>Qualifications</strong></h1><ul style=\"min-height:1.5em\"><li><p style=\"min-height:1.5em\">5+ years of experience in product management, growth, and performance marketing, ideally in a B2C subscription based business</p></li><li><p style=\"min-height:1.5em\">Advanced understanding of the development process, planning and execution </p></li><li><p style=\"min-height:1.5em\">Strong expertise in conversion rate optimization (CRO), A/B testing, and data-driven decision-making</p></li><li><p style=\"min-height:1.5em\">Experience managing product lifecycles, user acquisition strategies, and business analytics</p></li><li><p style=\"min-height:1.5em\">Proven ability to lead cross-functional teams and drive execution</p></li><li><p style=\"min-height:1.5em\">Strong analytical and strategic mindset with experience in executive reporting</p></li><li><p style=\"min-height:1.5em\">Fluent English</p></li></ul><h1></h1><p style=\"min-height:1.5em\"></p><h1><strong>Location</strong></h1><p style=\"min-height:1.5em\">Ruby Labs operates within the CET (Central European Time) zone. Applicants from any country are welcome to apply for the position as long as they are located within approximately ± 4 hours of CET. This ensures optimal collaboration and communication during working hours.</p><p style=\"min-height:1.5em\"></p><h1><strong>Benefits</strong></h1><p style=\"min-height:1.5em\">Discover the perks of being part of our vibrant team! We offer:</p><ul style=\"min-height:1.5em\"><li><p style=\"min-height:1.5em\"><strong>Remote Work Environment:</strong> Embrace the freedom to work from anywhere, anytime, promoting a healthy work-life balance. 🏡⏰</p></li><li><p style=\"min-height:1.5em\"><strong>Unlimited PTO:</strong> Enjoy unlimited paid time off to recharge and prioritize your well-being, without counting days. 🌴💼</p></li><li><p style=\"min-height:1.5em\"><strong>Paid National Holidays:</strong> Celebrate and relax on national holidays with paid time off to unwind and recharge. 🎉🌟</p></li><li><p style=\"min-height:1.5em\"><strong>Company-provided MacBook:</strong> Experience seamless productivity with top-notch Apple MacBooks provided to all employees who need them. 💻🚀</p></li><li><p style=\"min-height:1.5em\"><strong>Flexible Independent Contractor Agreement:</strong> Unlock the benefits of flexibility, autonomy, and entrepreneurial opportunities. Benefit from tax advantages, networking opportunities, reduced employment obligations, and the freedom to work from anywhere. Read more about it here: <a target=\"_blank\" rel=\"noopener noreferrer nofollow\" href=\"https://docs.google.com/document/d/1dHF4ctKlez75whdn-ybUwP5d5Wr0BdwVrorrm_fM40Q/preview\">https://docs.google.com/document/d/1dHF4ctKlez75whdn-ybUwP5d5Wr0BdwVrorrm_fM40Q/preview</a> 📈💼</p></li></ul><p style=\"min-height:1.5em\">Be part of our fast-growing team and seize this excellent opportunity for personal and professional growth!</p><p style=\"min-height:1.5em\"></p><h1><strong>Interview Process</strong></h1><p style=\"min-height:1.5em\">After submitting your application, we conduct a thorough review which typically takes 3 to 5 days, but may occasionally take longer due to the volume of applications received. If we see a potential fit, we proceed with the following steps:</p><ul style=\"min-height:1.5em\"><li><p style=\"min-height:1.5em\">Recruiter Screening (40 minutes)</p></li><li><p style=\"min-height:1.5em\">Technical Interview (90 minutes)</p></li><li><p style=\"min-height:1.5em\">Final Interview (60 minutes)</p></li></ul><p style=\"min-height:1.5em\"></p><h1><strong>Life at Ruby Labs</strong></h1><p style=\"min-height:1.5em\">At Ruby Labs, we are more than a team; we're a community united in pushing the boundaries of technology and innovation. Our combined passion fuels our ambition for excellence, driving impact that resonates around the globe.</p><p style=\"min-height:1.5em\">We are an equal-opportunity employer and celebrate diversity, recognizing that a diversity of thought and backgrounds builds stronger teams. We approach diversity and inclusion seriously and thoughtfully. We do not discriminate based on race, ethnicity, religion, color, place of birth, sex, gender identity or expression, sexual orientation, age, marital status, military service status, or disability status. Join us and be part of a company that is crafting the future of technology across multiple industries.</p><p style=\"min-height:1.5em\"></p><p style=\"min-height:1.5em\">#Li-Remote</p>","tags":"[\"management\",\"b2c\",\"legal\"]","pubDate":"2025-02-10T16:08:21.607Z","link":"https://jobs.ashbyhq.com/ruby-labs/18c59b76-46da-4958-961e-113b5d13d333","slug":"head-of-product-growth-ruby-labs-6035"},{"id":4550405327,"title":"Director Of Security, IT and Platform","company":"Clutch","image":"https://app.ashbyhq.com/api/images/org-theme-logo/87f6e542-ae68-4ff1-ab48-f05e9dab1964/e24aecd5-3955-404a-8728-c08806c78730.png","description":"<h1><strong>About the Role</strong></h1><p style=\"min-height:1.5em\">We are looking for a <strong>Director of Security, IT, and Platform</strong> to enhance and scale our security, IT, and platform operations. You will be responsible for strengthening our already robust security strategies, ensuring compliance, and optimizing IT infrastructure to support our growing organization. This is a strategic leadership role that requires a blend of technical expertise and business acumen to drive continuous improvement in security, IT, and platform excellence.</p><p style=\"min-height:1.5em\"></p><h1><strong>About the Team</strong></h1><p style=\"min-height:1.5em\">The Security, IT, and Platform team is at the core of our company’s operations, ensuring our systems remain secure, efficient, and scalable. We work cross-functionally with engineering, compliance, and business teams to proactively mitigate risks, enhance reliability, and support seamless operations. Our team thrives on innovation, collaboration, and a proactive approach to maintaining a strong security posture.</p><p style=\"min-height:1.5em\"></p><h1><strong>What You’ll Do</strong></h1><p style=\"min-height:1.5em\"></p><h2>Within 3 months, you will:</h2><ul style=\"min-height:1.5em\"><li><p style=\"min-height:1.5em\">Conduct a comprehensive review of existing security and IT frameworks to identify opportunities for enhancement.</p></li><li><p style=\"min-height:1.5em\">Establish a clear roadmap for security, IT, and platform improvements aligned with business goals.</p></li><li><p style=\"min-height:1.5em\">Strengthen incident response protocols and refine cybersecurity monitoring.</p></li><li><p style=\"min-height:1.5em\">Build strong relationships with key stakeholders across engineering, compliance, and business functions.</p></li></ul><h2>Within 6 months, you will:</h2><ul style=\"min-height:1.5em\"><li><p style=\"min-height:1.5em\">Implement best-in-class security enhancements and policies, ensuring ongoing compliance with relevant regulations.</p></li><li><p style=\"min-height:1.5em\">Optimize IT operations, improving system reliability, performance, and efficiency.</p></li><li><p style=\"min-height:1.5em\">Enhance access management and authentication frameworks to further reduce security risks.</p></li><li><p style=\"min-height:1.5em\">Develop a scalable IT and security infrastructure to support future growth.</p></li></ul><h2>Within 9 months, you will:</h2><ul style=\"min-height:1.5em\"><li><p style=\"min-height:1.5em\">Lead company-wide security awareness programs, fostering a security-first culture.</p></li><li><p style=\"min-height:1.5em\">Advance cloud security and data protection strategies.</p></li><li><p style=\"min-height:1.5em\">Continuously assess and improve our security posture through regular testing and proactive risk management.</p></li><li><p style=\"min-height:1.5em\">Drive innovation in IT and platform management, leveraging automation and cutting-edge technologies.</p></li></ul><p style=\"min-height:1.5em\"></p><h1><strong>What You’ll Bring</strong></h1><ul style=\"min-height:1.5em\"><li><p style=\"min-height:1.5em\">8+ years of experience in IT security, platform management, and IT infrastructure, preferably in SaaS and/or Fintech.</p></li><li><p style=\"min-height:1.5em\">Proven leadership experience in managing security, IT, and platform teams in a fast-paced environment.</p></li><li><p style=\"min-height:1.5em\">Exceptional communication and stakeholder management skills, with the ability to clearly articulate risks and their potential impact.</p></li><li><p style=\"min-height:1.5em\">Deep knowledge of security frameworks (e.g., NIST) and compliance standards such as SOC 2, ISO 27001, and PCI DSS.</p></li><li><p style=\"min-height:1.5em\">Strong understanding of cloud security (AWS, GCP, Azure) and modern IT architectures.</p></li><li><p style=\"min-height:1.5em\">Hands-on experience with identity and access management (IAM), endpoint security, and threat detection.</p></li><li><p style=\"min-height:1.5em\">Ability to balance strategic vision with tactical execution, driving measurable impact.</p><p style=\"min-height:1.5em\"></p><p style=\"min-height:1.5em\"><em>Please note that this role may evolve as our business needs change, so we appreciate your flexibility and adaptability.</em></p></li></ul><p style=\"min-height:1.5em\"><strong>What’s In It For You?</strong></p><ul style=\"min-height:1.5em\"><li><p style=\"min-height:1.5em\"><strong>Remote Flexibility:</strong> Enjoy the freedom of remote work from anywhere, balancing life and career seamlessly.</p></li><li><p style=\"min-height:1.5em\"><strong>Unforgettable Off-Sites:</strong> Twice a year, bond with colleagues in exciting destinations, fostering teamwork and fresh ideas.</p></li><li><p style=\"min-height:1.5em\"><strong>Paid Time Off and National Holidays:</strong> Enjoy 20 PTO days yearly and the National Holidays for relaxation and rejuvenation.</p></li><li><p style=\"min-height:1.5em\"><strong>Stock Options:</strong> Joining us means having a stake in our success, so you'll receive stock options as part of your compensation package.</p></li><li><p style=\"min-height:1.5em\"><strong>Home Office Setup:</strong> Create your ideal workspace with a dedicated budget for home office essentials.</p></li><li><p style=\"min-height:1.5em\"><strong>Work Trip Budget:</strong> Grow personally and professionally with a budget for work-related trips and co-working.</p></li></ul><p style=\"min-height:1.5em\"><strong>About Us</strong></p><p style=\"min-height:1.5em\"><strong>Clutch</strong> is a revolutionary vertical SaaS company, proudly backed by Andreessen Horowitz (A16z), aimed at revolutionizing the way Credit Unions engage and change the lives of their members. As a champion of financial well-being, we address the urgent need for affordable lending solutions in an era where the average American grapples with over $155,000 in household debt.  Unlike traditional financial institutions, Clutch develops software to turn Credit Unions into FinTech lenders and leverage their balance sheets to responsibly lend to over 130M Americans. Our mission extends beyond mere financial transactions; we strive to fundamentally enhance the way credit unions interact with their members. By integrating cutting-edge technologies and user-centric designs, we help credit unions provide seamless digital experiences that are on par with leading tech companies. This approach not only preserves but revitalizes the longstanding tradition of community and member-focused service inherent to credit unions.</p><p style=\"min-height:1.5em\"><strong>Please note:</strong> This position is offered on a contractor basis. Applicants must have the necessary documentation and authorization to work in the country where the job is located. Clutch cannot provide sponsorship or assist with obtaining work permits for this role.</p>","tags":"[\"management\",\"engineering\",\"aws\"]","pubDate":"2025-02-10T15:13:35.089Z","link":"https://jobs.ashbyhq.com/withclutch/12d21733-09e3-44b2-8965-82db46613c76","slug":"director-of-security-it-and-platform-clutch-8873"},{"id":4712034795,"title":"Senior Data Scientist, Ads","company":"Mozilla","image":"https://remotive.com/job/1968331/logo","description":"<div class='\"gmail_default\"'>\n<div>To learn the Hiring Ranges for this position, please select your location from the <strong>Apply Now</strong> dropdown menu.\n<p>To learn more about our Hiring Range System, please click this <a href=\"%22https:/docs.google.com/document/d/1ylUe7Ou0EbsOtGRBtUv1sSld3lbZ4mrYzo59tEkSjY8/edit?usp=sharing%22\" rel=\"nofollow\" target='\"_blank\"'><strong>link.</strong></a></p>\n<p> </p>\n<p><strong>Why Mozilla?</strong></p>\n<p>Mozilla Corporation is the non-profit-backed technology company that has shaped the internet for the better over the last 25 years. We make pioneering brands like Firefox, the privacy-minded web browser, and Pocket, a service for keeping up with the best content online. Now, with more than 225 million people around the world using our products each month, we’re shaping the next 25 years of technology and helping to reclaim an internet built for people, not companies. Our work focuses on diverse areas including AI, social media, security and more. And we’re doing this while never losing our focus on our core mission – to make the internet better for people.</p>\n<p>The Mozilla Corporation is wholly owned by the non-profit 501(c) Mozilla Foundation. This means we aren’t beholden to any shareholders — only to our mission. Along with thousands of volunteer contributors and collaborators all over the world, Mozillians design, build and distribute <strong>open-source</strong> software that enables people to enjoy the internet on their terms.</p>\n<p><strong>About this team and role:</strong></p>\n<p>As a Data Scientist embedded in the Advertising Organization, you will work with a group of data and non-data Mozillians responsible for understanding and driving the future of the internet. The Data Science team sits at the intersection of product, engineering, finance, business development, marketing, and leadership, and we collaborate closely with these and more partners to empower rigorous decision-making and create impactful data products.</p>\n<p><strong>What you’ll do:</strong></p>\n<ul style=\"\">\n<li style=\"\">Generate data-informed insights and communicate these data stories to stakeholders and colleagues to influence decision making within the Advertising team, and across numerous senior stakeholders at Mozilla. </li>\n<li style=\"\">Apply a number of data analysis and engineering skills to support data collection and build key data artifacts (dashboards, derived tables, analyses, and models) to tackle ambiguity through operational and exploratory quantitative analyses. </li>\n<li style=\"\">Apply a variety of statistical methods including linear and non-linear models, causal inference, and unsupervised learning, among many, to understand the intricate ecosystem of our users, products, partners, and revenue, against our large scale data.</li>\n<li style=\"\">Design experiments to support product developing features, and develop statistically sound models to measure impact. Collaborate with other data scientists to develop and operationalize consistent approaches to metrics and measurement.</li>\n<li style=\"\">Contribute to the wider data team through mentorship, technical methods, analytical frameworks, and improvements in how we work. </li>\n</ul>\n<p><strong>What you’ll bring:</strong></p>\n<ul style=\"\">\n<li style=\"\">You lead with empathy and ownership. You value teamwork and teammates. You are invested in knowledge sharing and learning from others. You contribute positively and meaningfully to cultivate an inclusive and equitable team culture.</li>\n<li style=\"\">You have a background in quantitative analysis knowing how to analyze, visualize, and interpret data. You have 3+ years of experience applying these skills in an industry setting, with experience in the Revenue/Digital Advertising space. </li>\n<li style=\"\">You have used forecasting or other predictive methods on large scale data. You have built business cases and tackled ambiguous commercial/revenue opportunities as part of cross-functional efforts. Knowledge and experience of machine learning is a plus. </li>\n<li style=\"\">You have experience in SQL or SQL-like environments, Python and other scripting languages, and business intelligence tools (especially Looker). You also possess a strong desire to gain further technical experience on the job.</li>\n<li style=\"\">You take stakeholder needs into account, bridging methodology and data into meaningful strategy from your analyses. You are a communicator who crafts impactful data narratives that inform company decisions around product, business, and finance.</li>\n<li style=\"\">You consider contributing to a collaborative and open team culture as an important responsibility, empowering others to do the same, while pushing forward through circumstances with candor and kindness.</li>\n</ul>\n<br><strong>What you’ll get:</strong>\n<ul style=\"\">\n<li style=\"\">Generous performance-based bonus plans to all eligible employees - we share in our success as one team</li>\n<li style=\"\">Rich medical, dental, and vision coverage</li>\n<li style=\"\">Generous retirement contributions with 100% immediate vesting (regardless of whether you contribute)</li>\n<li style=\"\">Quarterly all-company wellness days where everyone takes a pause together</li>\n<li style=\"\">Country specific holidays plus a day off for your birthday</li>\n<li style=\"\">One-time home office stipend</li>\n<li style=\"\">Annual professional development budget</li>\n<li style=\"\">Quarterly well-being stipend</li>\n<li style=\"\">Considerable paid parental leave</li>\n<li style=\"\">Employee referral bonus program</li>\n</ul>\n<p>Other benefits (life/AD&amp;D, disability, EAP, etc.</p>\n<ul style=\"\">\n<li style=\"\">varies by country)</li>\n</ul>\n<p><strong>About Mozilla </strong></p>\n<p>Mozilla exists to build the Internet as a public resource accessible to all because we believe that open and free is better than closed and controlled. When you work at Mozilla, you give yourself a chance to make a difference in the lives of Web users everywhere. And you give us a chance to make a difference in your life every single day. Join us to work on the Web as the platform and help create more opportunity and innovation for everyone online.</p>\n<p><strong>Commitment to diversity, equity, inclusion, and belonging</strong></p>\n<p>Mozilla understands that valuing diverse creative practices and forms of knowledge are crucial to and enrich the company’s core mission. We encourage applications from everyone, including members of all equity-seeking communities, such as (but certainly not limited to) women, racialized and Indigenous persons, persons with disabilities, persons of all sexual orientations, gender identities and expressions.</p>\n<p>We will ensure that qualified individuals with disabilities are provided reasonable accommodations to participate in the job application or interview process, to perform essential job functions, and to receive other benefits and privileges of employment, as appropriate. Please contact us at hiringaccomodation@mozilla.com to request accommodation.</p>\n<p>We are an equal opportunity employer. We do not discriminate on the basis of race (including hairstyle and texture), religion (including religious grooming and dress practices), gender, gender identity, gender expression, color, national origin, pregnancy, ancestry, domestic partner status, disability, sexual orientation, age, genetic predisposition, medical condition, marital status, citizenship status, military or veteran status, or any other basis covered by applicable laws. Mozilla will not tolerate discrimination or harassment based on any of these characteristics or any other unlawful behavior, conduct, or purpose.</p>\n<br>\n<p>Group: E</p>\n<p>#DNI</p>\n</div>\n</div>\n<img src=\"https://remotive.com/job/track/1968331/blank.gif?source=public_api\" alt=\"\"/>","tags":"[\"python\",\"sql\",\"data visualization\"]","pubDate":"2025-02-09T21:51:02.000Z","link":"https://remotive.com/remote-jobs/software-dev/senior-data-scientist-ads-1968331","slug":"senior-data-scientist-ads-mozilla-1917"}]