[{"id":4031199211,"title":"Customer Success Manager | Mid-Market (Industry)","company":"BioRender","image":"https://avatars.githubusercontent.com/u/46490948?s=200&v=4","description":"<p style=\"min-height:1.5em\">At BioRender, we’re on a mission to accelerate the world’s ability to learn, discover, and communicate science — transforming how knowledge is shared and making science open, collaborative, and easily understandable by all.<br /><br />We’re shaping the future of science communication and are looking for talented individuals to help bring this vision to life! 🚀<br /><br />We are seeking a proactive individual passionate about delivering exceptional experiences to industry clients and transforming how science is communicated. As a Customer Success Manager, you will work closely with BioRender’s industry clients, focusing on customer satisfaction, retention, advocacy, and revenue growth.</p><p style=\"min-height:1.5em\"></p><p style=\"min-height:1.5em\"><strong>You will be successful in this role with:</strong></p><p style=\"min-height:1.5em\"></p><ul style=\"min-height:1.5em\"><li><p style=\"min-height:1.5em\"><strong>Growth mindset and continuous improvement:</strong> You embrace feedback and coaching, always seeking opportunities to learn and enhance your approach.</p></li><li><p style=\"min-height:1.5em\"><strong>Deep customer curiosity:</strong> You have a genuine interest in understanding our industry clients, their goals, and the challenges they face in science communication.</p></li><li><p style=\"min-height:1.5em\"><strong>Resilience and ownership:</strong> You remain focused and productive in the face of challenges, taking full responsibility for delivering on commitments to both customers and internal teams.</p></li></ul><p style=\"min-height:1.5em\"></p><p style=\"min-height:1.5em\"><strong>What you'll be doing:</strong></p><p style=\"min-height:1.5em\"></p><ul style=\"min-height:1.5em\"><li><p style=\"min-height:1.5em\">Proactively engage with clients and key decision-makers through emails, calls, and virtual meetings, positioning yourself as a trusted strategic partner.</p></li><li><p style=\"min-height:1.5em\">Onboard new users by demonstrating platform features to senior decision-makers through client calls, interviews, and training sessions.</p></li><li><p style=\"min-height:1.5em\">Identify client needs, coordinate training and support, and deliver value-driven solutions to enhance user engagement and drive annual subscription renewals.</p></li><li><p style=\"min-height:1.5em\">Monitor user satisfaction and track NPS scores to mitigate churn, address user requests, and identify areas for improvement.</p></li><li><p style=\"min-height:1.5em\">Develop customer advocates, create case studies, and collaborate with users for speaking opportunities and other marketing initiatives.</p></li><li><p style=\"min-height:1.5em\">Work cross-functionally with teams such as medical illustration, product, and marketing to ensure customer needs are met.</p></li><li><p style=\"min-height:1.5em\">Continuously seek ways to improve the customer success playbook, contribute to product enhancements, and support other internal teams.</p></li></ul><p style=\"min-height:1.5em\"></p><p style=\"min-height:1.5em\"><strong>What you bring to the table:</strong></p><p style=\"min-height:1.5em\"></p><ul style=\"min-height:1.5em\"><li><p style=\"min-height:1.5em\">3+ years of experience in customer success or account management within a SaaS company</p></li><li><p style=\"min-height:1.5em\">Strong expertise in hosting virtual webinars, workshops, and other events</p></li><li><p style=\"min-height:1.5em\">Proficiency in account management metrics, including churn, retention, and NPS</p></li><li><p style=\"min-height:1.5em\">BSc or Master’s degree in Life Sciences is a plus</p></li><li><p style=\"min-height:1.5em\">Exceptional organizational skills with the ability to manage multiple projects effectively</p></li><li><p style=\"min-height:1.5em\">Strong interpersonal skills and keen attention to detail</p></li><li><p style=\"min-height:1.5em\">Proven experience engaging and building relationships with senior leadership and executives across industry verticals</p></li><li><p style=\"min-height:1.5em\">Confidence in presenting to large audiences in both virtual and in-person settings</p></li><li><p style=\"min-height:1.5em\">Willingness to travel up to 10% if required</p><p style=\"min-height:1.5em\"></p></li></ul><p style=\"min-height:1.5em\"><strong>Why Join Us?</strong></p><p style=\"min-height:1.5em\"></p><ul style=\"min-height:1.5em\"><li><p style=\"min-height:1.5em\">We are mission-driven: we work collaboratively towards our shared vision of improving scientific communication and accelerating scientific discovery. BioRender figures have appeared in more than 54,000 publications! </p></li></ul><ul style=\"min-height:1.5em\"><li><p style=\"min-height:1.5em\">BioRender is loved by millions! We have a world-class NPS and a community of loyal fans and users in 200+ countries!</p></li><li><p style=\"min-height:1.5em\">Our company is backed by top investors and accelerators like Y Combinator, and we are on a growth trajectory comparable to many top-performing SaaS companies </p></li><li><p style=\"min-height:1.5em\">We’re remote-first with team members across Canada and the U.S., offering you the flexibility to work from anywhere. </p><p style=\"min-height:1.5em\"></p></li></ul><p style=\"min-height:1.5em\">BioRender is an Equal Opportunity Employer. We celebrate diversity and are committed to creating an inclusive environment for all employees. All qualified applicants will receive consideration for employment without regard to race, color, religion, sex, sexual orientation, gender identity, national origin, disability, or veteran status.</p>","tags":"[\"management\"]","pubDate":"2025-03-19T22:51:48.164Z","link":"https://jobs.ashbyhq.com/biorender/0d16c752-eb6f-45df-b13c-1e1683a03d01","slug":"customer-success-manager-mid-market-industry-biorender-1778"},{"id":2635566338,"title":"Customer Success Manager | SMB (Industry)  ","company":"BioRender","image":"https://avatars.githubusercontent.com/u/46490948?s=200&v=4","description":"<p style=\"min-height:1.5em\">At BioRender, we’re on a mission to accelerate the world’s ability to learn, discover, and communicate science — transforming how knowledge is shared and making science open, collaborative, and easily understandable by all.<br /><br />We’re shaping the future of science communication and are looking for talented individuals to help bring this vision to life! 🚀<br /><br />We are seeking a proactive professional to join our team as an Industry Customer Success Manager (SMB), also known internally as a Customer Success Specialist. In this role, you will be responsible for building and maintaining strong B2B relationships with our SMB clients, driving retention, expansion, and user engagement. You will collaborate closely with BioRender users to ensure they have the best possible experience with our product.</p><p style=\"min-height:1.5em\"></p><p style=\"min-height:1.5em\"><strong>You will be successful in this role with:</strong></p><ul style=\"min-height:1.5em\"><li><p style=\"min-height:1.5em\">Exceptional customer curiosity: You are genuinely interested in learning about the clients we serve, their goals, and their science communication pain points</p></li><li><p style=\"min-height:1.5em\">Strong organization and prioritization: You can use a compelling process to stay productive and prioritize based on our customers' and projects' changing needs. You are flexible, can quickly establish creative solutions to complex problems, and are not afraid of pivoting</p></li><li><p style=\"min-height:1.5em\">Flexible and adaptable: Comfortable in a dynamic and fast-paced environment, demonstrating resilience and flexibility in adapting to change and working through ambiguity</p></li><li><p style=\"min-height:1.5em\">A continuous improvement approach: You have a growth mindset, and you’re open to coaching and continuous feedback</p></li></ul><p style=\"min-height:1.5em\"></p><p style=\"min-height:1.5em\"><strong>What you'll be doing:</strong></p><ul style=\"min-height:1.5em\"><li><p style=\"min-height:1.5em\">Client Relationship Management: Proactively reach out to clients &amp; decision-makers to position yourself as a trusted and strategic partner. Uncover our full-serve customer needs through discovery calls, maintain partnerships with our high-spend clients and proactively promote ongoing engagement with end-users</p></li><li><p style=\"min-height:1.5em\">Strategic Account Management: Deliver value that delights our users to drive engagement, encourage annual subscription renewal, and identify revenue growth opportunities.</p></li><li><p style=\"min-height:1.5em\">Client onboarding: Provide personalized training to clients by delivering webinars specializing in science communication topics </p></li><li><p style=\"min-height:1.5em\">Be a BioRender Product Expert: Speak to new and existing users of our platform to showcase new features</p></li><li><p style=\"min-height:1.5em\">Act as an Interdepartmental Liaison: Connect with various internal teams to ensure the customers’ needs are being fulfilled, contribute to the product, and assist other teams</p></li><li><p style=\"min-height:1.5em\">Create BioRender Champions: Cultivate customer advocates, understand user-critical use cases for product feedback, engage with customers for speaking opportunities and run marketing activities</p></li></ul><p style=\"min-height:1.5em\"></p><p style=\"min-height:1.5em\"><strong>What you bring to the table:</strong></p><ul style=\"min-height:1.5em\"><li><p style=\"min-height:1.5em\">1–2 years of experience in customer success or account management</p></li><li><p style=\"min-height:1.5em\">Familiarity with key Customer Success metrics, including retention, expansion, and CSQLs</p></li><li><p style=\"min-height:1.5em\">A BSc or Master’s degree in Life Sciences, or relevant experience in science knowledge translation</p></li><li><p style=\"min-height:1.5em\">Strong communication, interpersonal, and attention-to-detail skills</p></li><li><p style=\"min-height:1.5em\">Excellent organizational abilities with the capability to manage and prioritize multiple projects</p></li><li><p style=\"min-height:1.5em\">Experience hosting virtual webinars, workshops, or events is a plus</p></li><li><p style=\"min-height:1.5em\">Extensive experience working with industry customers, preferably in the BioTech or Pharma sectors</p><p style=\"min-height:1.5em\"></p></li></ul><p style=\"min-height:1.5em\"><strong>Why join us?</strong></p><ul style=\"min-height:1.5em\"><li><p style=\"min-height:1.5em\"><strong>We are mission-driven</strong>: we work collaboratively towards our shared vision of improving scientific communication and accelerating scientific discovery. BioRender figures have appeared in more than 54,000 publications! </p></li><li><p style=\"min-height:1.5em\"><strong>BioRender is loved by millions!</strong> We have a world-class NPS and a community of loyal fans and users in 200+ countries!</p></li><li><p style=\"min-height:1.5em\"><strong>Our company is backed by top investors</strong> and accelerators like Y Combinator, and we are on a growth trajectory comparable to many top-performing SaaS companies </p></li><li><p style=\"min-height:1.5em\"><strong>We’re remote-first</strong> with team members across Canada and the U.S., offering you the flexibility to work from anywhere. </p></li></ul><p style=\"min-height:1.5em\"></p><p style=\"min-height:1.5em\">BioRender is an Equal Opportunity Employer. We celebrate diversity and are committed to creating an inclusive environment for all employees. All qualified applicants will receive consideration for employment without regard to race, color, religion, sex, sexual orientation, gender identity, national origin, disability, or veteran status.</p>","tags":"[\"management\",\"b2b\"]","pubDate":"2025-03-19T22:51:26.805Z","link":"https://jobs.ashbyhq.com/biorender/87b657d2-e374-45b8-9837-a4b973a5f067","slug":"customer-success-manager-smb-industry-biorender-341"},{"id":5648532094,"title":"Customer Success Manager (Multi Location)","company":"Owner","image":"https://avatars.githubusercontent.com/u/87661266?s=200&v=4","description":"<div><span style=\"font-size: 24px;\">👋&nbsp;</span><b><span style=\"font-size: 24px;\">About&nbsp;</span></b><a href=\"http://owner.com/\"><b><span style=\"font-size: 24px;\">Owner.com</span></b></a></div><div>Owner is the all-in-one platform that restaurants use to succeed online.</div><div><br></div><div>Thousands of restaurant owners use our tools to build their website, drive online orders, create their own branded app, manage their customer relationships, and set up marketing automations.</div><div><br></div><div>You can think of it as Shopify meets HubSpot, but specifically for restaurants.</div><div><br></div><div>Learn more about the problems we are solving for our customers&nbsp;<a href=\"https://www.owner.com/our-story\">here</a>.</div><div><br></div><div><span style=\"font-size: 24px;\">🌎&nbsp;</span><b><span style=\"font-size: 24px;\">Our vision</span></b></div><div>We’re starting by helping independent restaurants succeed online.</div><div><br></div><div>But it’s not just restaurants that need our help. Most local businesses are struggling with these same problems. Huge technology corporations are taking their customers, bleeding their profits, and making it hard for them to survive.</div><div><br></div><div>Once we nail the solution for restaurants&nbsp;–&nbsp;we’ll scale it into every other local business type.</div><div><br></div><div>In the future we envision, tens of millions of local business owners will use our technology to succeed in the digital age.</div><div><br></div><div><span style=\"font-size: 24px;\">🚀&nbsp;</span><b><span style=\"font-size: 24px;\">Our traction</span></b></div><div>In just over 3 years we've generated&nbsp;tens of millions in revenue, served millions of guests, and processed hundreds of millions of online orders.</div><div><br></div><div>More importantly, we’ve helped thousands of restaurant owners save their businesses - and not&nbsp; only survive, but thrive.</div><div><br></div><div><span style=\"font-size: 24px;\">⭐&nbsp;</span><b><span style=\"font-size: 24px;\">Our team</span></b></div><div>Our team grew from under 100 to nearly 200 talented people in 2024. We’ve got top talent from the most successful companies in SMB software, including: Shopify, HubSpot, DoorDash, ServiceTitan, Rappi, Faire and Stripe.</div><div><br></div><div>We’ll be scaling even faster in 2025 to keep pace with our customer growth.</div><div><br></div><div><span style=\"font-size: 24px;\">🌆&nbsp;</span><b><span style=\"font-size: 24px;\">Where we work</span></b></div><div>Owner is a remote-first, global company headquartered in San Francisco, with a sales hub in Toronto. For a few of our roles we prioritize in-person collaboration at one of our office locations. Most of our employees are distributed throughout the globe. Please review the role description and discuss with your recruiter for more details on location!</div><div><br></div><div><span style=\"font-size: 24px;\">🔍</span><b style=\"font-size: 24px;\">Why we’re looking for you</b></div><div><a rel=\"noopener noreferrer\" class=\"postings-link\" href=\"http://Owner.com\">Owner.com</a> is growing quickly, and we’re looking for an experienced Customer Success Manager to manage our marquee, high-volume, and multi-location restaurant customers. In this role, you will own the full customer lifecycle for a dedicated book of business, serving as the primary point of contact. Your focus will be on delivering a high-touch, consultative experience that drives product adoption, customer value, and long-term retention.</div><div><br></div><div>You will act as a trusted restaurant consultant, helping customers optimize new and repeat business through <a rel=\"noopener noreferrer\" class=\"postings-link\" href=\"http://Owner.com\">Owner.com</a>’s tools and product offerings. As an active voice in our brand partnerships and the second member of the Multi-Location CSM team, you will have the opportunity to influence processes, playbooks, and the overall customer journey.</div><div><br></div><div>Your advocacy for the customer will ensure their needs are heard, providing valuable feedback to cross-functional teams to shape the future of our product roadmap. Success in this role will be measured by key performance metrics, including business review completions, revenue retention and customer engagement &amp; production adoption.</div><div><br></div><div>This role is 100% remote and can be based anywhere in the United States.</div><div><span style=\"font-size: 24px;\">🔍</span><b style=\"font-size: 24px;\">Why we’re looking for you</b></div><div><a href=\"http://Owner.com\" class=\"postings-link\" target=\"_blank\" rel=\"noopener noreferrer\">Owner.com</a> is growing quickly, and we’re looking for an experienced Customer Success Manager to manage our marquee, high-volume, and multi-location restaurant customers. In this role, you will own the full customer lifecycle for a dedicated book of business, serving as the primary point of contact. Your focus will be on delivering a high-touch, consultative experience that drives product adoption, customer value, and long-term retention.</div><div><br></div><div>You will act as a trusted restaurant consultant, helping customers optimize new and repeat business through <a href=\"http://Owner.com\" class=\"postings-link\" target=\"_blank\" rel=\"noopener noreferrer\">Owner.com</a>’s tools and product offerings. As an active voice in our brand partnerships and the second member of the Multi-Location CSM team, you will have the opportunity to influence processes, playbooks, and the overall customer journey.</div><div><br></div><div>Your advocacy for the customer will ensure their needs are heard, providing valuable feedback to cross-functional teams to shape the future of our product roadmap. Success in this role will be measured by key performance metrics, including business review completions, revenue retention and customer engagement &amp; production adoption.</div><div><br></div><div>This role is 100% remote and can be based anywhere in the United States.</div><h3>💥 The impact you will have</h3><li>Play a critical role in delivering a world-class, high-touch customer experience for enterprise-level customers.</li><li>Serve as a strategic advisor and trusted consultant for multi-location restaurants to drive new and repeat business.</li><li>Own and improve customer retention by proactively addressing churn risks and delivering measurable value</li><li>Build and refine customer success processes and strategies for enterprise accounts.</li><li>Contribute to <a rel=\"noopener noreferrer\" class=\"postings-link\" href=\"http://Owner.com\">Owner.com</a>’s growth by identifying opportunities for expansion and driving customer ROI.</li><h3>🤝 Who you’ll work with</h3><li>Our restaurant brands that have 3 or more locations and/or are apart of our strategic brand partnerships </li><li>This role will has high visibility &amp; will work heavily with multiple internal teams such as Sales, Partnerships, Implementation, Promotional Marketing &amp; SEO, and Product to name a few!  </li><h3>✅ What we’re looking for</h3><li>3+ years of experience in Customer Success, Account Management, or a related role.</li><li>A strong background in B2B and/or B2B2C in SaaS, ideally within the food/hospitality and technology space.</li><li>Proven success managing high-ARR, multi-location accounts, and delivering results across the full customer lifecycle.</li><li>Experience working with SMB/mid-market customers and balancing the unique demands of this segment.</li><li>Passionate about creating high-touch, strategic customer journeys that drive measurable success.</li><li>Skilled at identifying and monitoring customer health metrics to mitigate risks and maximize growth opportunities.</li><li>Familiarity with Customer Success tools (e.g., Salesforce, Sales Loft, TalkDesk, Gong, Loom, Sigma).</li><li>A passion for building strategic, high-touch customer journeys and identifying key health indicators.</li><li>Proven ability to de-escalate challenging conversations, handle cancellations, and own retention metrics.</li><li>Comfortable managing high meeting volumes while context-switching effortlessly to meet diverse customer needs.</li><li>Demonstrate strength in objection handling, conflict resolution, and delivering impactful, consultative solutions.</li><li>Adept at interpreting and using data to guide customer conversations and decision-making.</li><li>Commitment to personal growth and continuous development.</li><li>Bonus: Experience working in a restaurant, bringing real-world insights to customer consultations.</li><h3>🏆 Pay and benefits</h3><li>The estimated base salary range for this role is $90,000k - $110,000 USD plus a generous pre-IPO equity package</li><li> Other benefits include comprehensive health coverage, work from anywhere (remote-first workplace), unlimited PTO - plus extra fun perks!</li><div><br></div><div><b><span style=\"font-size: 10px\">🚩 Notice - Employment Scams</span></b></div><div><span style=\"font-size: 10px\">Communication from our team regarding job opportunities will only be made by an Owner employee with an @owner.com email address.</span></div><div><span style=\"font-size: 10px\">We do not conduct interviews over email or chat platforms, and we will never ask you to provide personal or financial information such as your mailing address, social security number, credit card numbers or banking information.&nbsp; If you believe you are being contacted by scammer, please mark the communication as \"phishing\" or “spam” and do not respond.</span></div><div><span style=\"font-size: 24px;\">👋&nbsp;</span><b><span style=\"font-size: 24px;\">About&nbsp;</span></b><a href=\"http://owner.com/\"><b><span style=\"font-size: 24px;\">Owner.com</span></b></a></div><div>Owner is the all-in-one platform that restaurants use to succeed online.</div><div><br></div><div>Thousands of restaurant owners use our tools to build their website, drive online orders, create their own branded app, manage their customer relationships, and set up marketing automations.</div><div><br></div><div>You can think of it as Shopify meets HubSpot, but specifically for restaurants.</div><div><br></div><div>Learn more about the problems we are solving for our customers&nbsp;<a href=\"https://www.owner.com/our-story\">here</a>.</div><div><br></div><div><span style=\"font-size: 24px;\">🌎&nbsp;</span><b><span style=\"font-size: 24px;\">Our vision</span></b></div><div>We’re starting by helping independent restaurants succeed online.</div><div><br></div><div>But it’s not just restaurants that need our help. Most local businesses are struggling with these same problems. Huge technology corporations are taking their customers, bleeding their profits, and making it hard for them to survive.</div><div><br></div><div>Once we nail the solution for restaurants&nbsp;–&nbsp;we’ll scale it into every other local business type.</div><div><br></div><div>In the future we envision, tens of millions of local business owners will use our technology to succeed in the digital age.</div><div><br></div><div><span style=\"font-size: 24px;\">🚀&nbsp;</span><b><span style=\"font-size: 24px;\">Our traction</span></b></div><div>In just over 3 years we've generated&nbsp;tens of millions in revenue, served millions of guests, and processed hundreds of millions of online orders.</div><div><br></div><div>More importantly, we’ve helped thousands of restaurant owners save their businesses - and not&nbsp; only survive, but thrive.</div><div><br></div><div><span style=\"font-size: 24px;\">⭐&nbsp;</span><b><span style=\"font-size: 24px;\">Our team</span></b></div><div>Our team grew from under 100 to nearly 200 talented people in 2024. We’ve got top talent from the most successful companies in SMB software, including: Shopify, HubSpot, DoorDash, ServiceTitan, Rappi, Faire and Stripe.</div><div><br></div><div>We’ll be scaling even faster in 2025 to keep pace with our customer growth.</div><div><br></div><div><span style=\"font-size: 24px;\">🌆&nbsp;</span><b><span style=\"font-size: 24px;\">Where we work</span></b></div><div>Owner is a remote-first, global company headquartered in San Francisco, with a sales hub in Toronto. For a few of our roles we prioritize in-person collaboration at one of our office locations. Most of our employees are distributed throughout the globe. Please review the role description and discuss with your recruiter for more details on location!</div>","tags":"[\"management\",\"b2c\",\"b2b\"]","pubDate":"2025-03-19T22:06:51.780Z","link":"https://jobs.lever.co/owner/75094447-0174-44ed-8b43-88dbca92fb86","slug":"customer-success-manager-multi-location-owner-5092"},{"id":1021862178,"title":"Director Lifecycle Marketing","company":"Owner","image":"https://avatars.githubusercontent.com/u/87661266?s=200&v=4","description":"<div><span style=\"font-size: 24px;\">🔍</span><b><span style=\"font-size: 24px;\">Why we’re looking for you</span></b></div><div><br></div><div>Are you a passionate and creative marketer with a knack for email campaigns and customer relationship management (CRM) but also love data and analytics? If so, we have an exciting opportunity for you to join our team! As a Director of Lifecycle Marketing and part of the larger Growth team, you will be responsible for building out our lifecycle marketing program from scratch.  We are seeking an experienced and results-driven individual to develop and execute data-informed marketing strategies that guide customers through every stage of the journey, from acquisition to retention and advocacy. This role is central to ensuring leads have a frictionless and personalized experience, driving engagement, long-term loyalty, and lifetime customer value (LCV) As the Director of Lifecycle Marketing, you will oversee email marketing, automated workflows, lead segmentation, and retention strategies, with a focus on optimizing the lead funnel across various touchpoints. </div><div><span style=\"font-size: 24px;\">🔍</span><b><span style=\"font-size: 24px;\">Why we’re looking for you</span></b></div><div><br></div><div>Are you a passionate and creative marketer with a knack for email campaigns and customer relationship management (CRM) but also love data and analytics? If so, we have an exciting opportunity for you to join our team! As a Director of Lifecycle Marketing and part of the larger Growth team, you will be responsible for building out our lifecycle marketing program from scratch.  We are seeking an experienced and results-driven individual to develop and execute data-informed marketing strategies that guide customers through every stage of the journey, from acquisition to retention and advocacy. This role is central to ensuring leads have a frictionless and personalized experience, driving engagement, long-term loyalty, and lifetime customer value (LCV) As the Director of Lifecycle Marketing, you will oversee email marketing, automated workflows, lead segmentation, and retention strategies, with a focus on optimizing the lead funnel across various touchpoints. </div><h3>💥 The impact you will have</h3><li>Design and execute end-to-end lifecycle marketing programs that align with customer needs at different journey stages.</li><li>Lead the development of personalized retention strategies, focusing on increasing customer lifetime value, reducing churn, and enhancing engagement. Segment and target customers effectively using data-driven insights and create tailored campaigns for each lifecycle stage (Onboarding, Engagement, Retention, Re-activation, Advocacy).</li><li>Manage the creation, execution, and optimization of multi-channel lifecycle marketing campaigns</li><li>Continuously analyze the performance of campaigns, using A/B testing, customer feedback, and key performance indicators (KPIs) to iterate and improve results.</li><li>Develop automated workflows to nurture leads and drive conversions, ensuring smooth handoffs between acquisition and retention phases.</li><li>Work to reduce friction points in the customer journey by enhancing onboarding experiences and providing timely and relevant messaging at key touchpoints.</li><li>Implement win-back strategies for churned customers to reactivate their interest and engagement with the solution.</li><li>Leverage customer data, CRM tools, and analytics platforms to monitor lifecycle metrics, identify trends, and provide actionable insights.</li><li>Develop regular performance reports on key lifecycle metrics, including customer retention rates, engagement levels, churn rates, and LCV.</li><li>Provide recommendations for new lifecycle initiatives based on data insights and customer feedback.</li><h3>👥 Who you’ll work with</h3><li>Head of Growth </li><li>Growth Marketing Manager </li><li>Agency Designers and Copywriters to support with design and content creation. </li><h3>✅ Minimum requirements</h3><li>6 + years of experience in lifecycle marketing, ideally in a high pace or tech-driven environment.</li><li>You’ve done it before, at scale. You have some hard-won lessons from the industry, and bring a deep understanding of performance marketing</li><li>Experience working with CRM tools (e.g., HubSpot, Salesforce Marketing Cloud, Braze, etc.) and analytics platforms (e.g., Google Analytics, etc.).</li><li>You are passionate about improving the SMB restaurant experience and have a personal connection to the space</li><h3>🏆 Pay and benefits</h3><li>The estimated base salary range for this role is $180,000 - $200,000 USD plus a generous equity pre-IPO equity package</li><li>Other benefits include comprehensive health coverage, work from anywhere (we are a remote-first workplace), unlimited PTO - plus extra fun perks!</li>","tags":"[\"management\"]","pubDate":"2025-03-19T20:59:42.561Z","link":"https://jobs.lever.co/owner/6d94d612-1d54-424e-9434-4ad40003b5ca","slug":"director-lifecycle-marketing-owner-585"},{"id":5653097536,"title":"SR Desenvolvimento Back-end (Node.js)","company":"ília","image":"https://avatars.githubusercontent.com/u/35933823?s=200&v=4","description":"&lt;p&gt;Aqui na ília nossas vagas estão sempre abertas para todas as pessoas e não se restringem quanto a gênero, etnia, orientação sexual, fatores sociais, condições físicas ou intelectuais (PCD) etc. Incentivamos a candidatura de integrantes de todos os grupos minoritários!&lt;/p&gt;\n&lt;h3&gt;&lt;strong&gt;Sobre a ília&lt;/strong&gt;&lt;/h3&gt;\n&lt;p&gt;Somos especialistas em tecnologia, dados e design, impulsionando a transformação digital de grandes players do mercado há mais de 10 anos, nos setores financeiro, seguros e mobilidade. Com mais de 450 profissionais, estamos presentes no Brasil e Europa, atendendo aos mercados da América Latina, Europa e América do Norte, desenvolvendo produtos digitais de alta qualidade e com foco em resultados de negócios. Somos uma equipe inovadora, criativa e apaixonada por tecnologia.&amp;nbsp;&lt;/p&gt;\n&lt;p&gt;Certificada pelo 5° ano consecutivo como Great Place to work aqui na ília acreditamos que pessoas mudam o mundo, e investimos nelas. Nossas awesome deliveries são feitas de pessoas para pessoas, afinal awesome people make awesome deliveries!&amp;nbsp;&lt;/p&gt;\n&lt;p&gt;#Vempraília!&lt;/p&gt;\n&lt;h3&gt;&lt;strong&gt;Requisitos:&lt;/strong&gt;&lt;/h3&gt;\n&lt;ul&gt;\n&lt;li&gt;Experiencia com desenvolvimento na linguagem Node.js&lt;/li&gt;\n&lt;li&gt;Experiencia com desenvolvimento utilizando bancos de dados SQL&lt;/li&gt;\n&lt;li&gt;Experiencia com desenvolvimento utilizando banco de dados NoSql (MongoDB)&lt;/li&gt;\n&lt;li&gt;Experiencia com desenvolvimento utilizando banco de dados chave-valor (Redis)&lt;/li&gt;\n&lt;li&gt;Experiencia com desenvolvimento utilizando serviços de processamento assincrono (Rabbit, Kafka, Service-bus)&lt;/li&gt;\n&lt;li&gt;Experiencia com desenvolvimento de APIs (Rest e Graphql)&lt;/li&gt;\n&lt;li&gt;Experiencia em desenvolvimento de testes de unidade.&lt;/li&gt;\n&lt;/ul&gt;\n&lt;h3&gt;&amp;nbsp;&lt;/h3&gt;\n&lt;h3&gt;&lt;strong&gt;Benefícios e Incentivos:&lt;/strong&gt;&lt;/h3&gt;\n&lt;p&gt;Nossa contratação é CLT- 40h semanais com jornada flexível, sendo executada 100% de forma remota. Os benefícios da ília são pensados para proporcionar uma experiência AWESOME para cada ílian, abaixo você encontra os benefícios de forma resumida. #vempraília&lt;/p&gt;\n&lt;p&gt;Para Saúde e bem-estar:&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;Plano de Saúde e Odontológico SulAmérica extensivo a dependentes;&lt;/li&gt;\n&lt;li&gt;Vale Alimentação/Refeição em cartão fléxivel Picpay benefícios&amp;nbsp;&lt;/li&gt;\n&lt;li&gt;Seguro de Vida;&lt;/li&gt;\n&lt;li&gt;Auxílio Home-Office em cartão fléxivel Picpay benefícios;&lt;/li&gt;\n&lt;li&gt;Wellhub (Gympass)&lt;/li&gt;\n&lt;li&gt;TotalPass&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;Para o seu Desenvolvimento:&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;ília University: Universidade Corporativa com mais de 20 mil cursos disponíveis para desenvolvimento pessoal e profissional;&lt;/li&gt;\n&lt;li&gt;Language Academy: Escola de idiomas para ílians;&lt;/li&gt;\n&lt;li&gt;í-talks e Chapter: Momentos e cerimônias em que o time compartilha práticas, estudos, projetos e ideias. Nas chapters ainda se reúnem pessoas com skills similares para compartilhamento de ideias, práticas e experiências;&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;Gostamos de ir além no cuidado com as nossas pessoas, então dispomos também de alguns benefícios não convencionais:&amp;nbsp;&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;Plano de Saúde PET- Guapeco&amp;nbsp;&lt;/li&gt;\n&lt;li&gt;BYOD- Alugamos o seu notebook pessoal te pagando um valor mensal para que você o use, mas disponibilizamos também máquinas de trabalho para ílians. Você quem decide!&lt;/li&gt;\n&lt;li&gt;Seu Niver, seu bolo!&lt;/li&gt;\n&lt;li&gt;Seu Networking Vale Prêmio- Programa de premiação a indicação de novos funcionários.&lt;/li&gt;\n&lt;/ul&gt;","tags":"[\"finance\",\"mongo\"]","pubDate":"2025-03-19T18:46:59.000Z","link":"https://job-boards.greenhouse.io/ilia/jobs/5480215004","slug":"sr-desenvolvimento-back-end-node-js-lia-2353"},{"id":8890701206,"title":"Marketing Coordinator","company":"Clutch","image":"https://app.ashbyhq.com/api/images/org-theme-logo/87f6e542-ae68-4ff1-ab48-f05e9dab1964/e24aecd5-3955-404a-8728-c08806c78730.png","description":"<p style=\"min-height:1.5em\"><strong>About the Role</strong></p><p style=\"min-height:1.5em\">As a Marketing Coordinator at Clutch, you will be pivotal in executing our event marketing strategies, ensuring a successful presence at trade shows and company-sponsored events.</p><p style=\"min-height:1.5em\">This role offers an opportunity to gain hands-on experience in various facets of marketing, including event planning, content creation, social media management, and analytics.</p><p style=\"min-height:1.5em\">You will work cross-functionally to support marketing initiatives that align with business goals and drive company growth.</p><p style=\"min-height:1.5em\"><strong>About the Team</strong></p><p style=\"min-height:1.5em\">The marketing team at Clutch is a dynamic and collaborative group that thrives on creativity and strategic execution.</p><p style=\"min-height:1.5em\">You'll work closely with sales, product, and other departments to create impactful marketing campaigns and support business objectives.</p><p style=\"min-height:1.5em\">The team values innovation, attention to detail, and a proactive approach to problem-solving.</p><p style=\"min-height:1.5em\"><strong>What You’ll Do</strong></p><p style=\"min-height:1.5em\">Within 3 months, you will:</p><ul style=\"min-height:1.5em\"><li><p style=\"min-height:1.5em\">Get fully onboarded with Clutch's marketing processes and tools.</p></li><li><p style=\"min-height:1.5em\">Assist in registering for upcoming trade shows and coordinating event logistics.</p></li><li><p style=\"min-height:1.5em\">Support content creation for social media and marketing collateral.</p></li><li><p style=\"min-height:1.5em\">Build relationships with vendors and internal stakeholders.</p></li></ul><p style=\"min-height:1.5em\">Within 6 months, you will:</p><ul style=\"min-height:1.5em\"><li><p style=\"min-height:1.5em\">Manage booth presence and exhibitor services for key trade shows.</p></li><li><p style=\"min-height:1.5em\">Organize hosted client events, such as dinners and happy hours.</p></li><li><p style=\"min-height:1.5em\">Assist with website updates and content accuracy.</p></li><li><p style=\"min-height:1.5em\">Analyze initial marketing campaign performance and provide insights.</p></li></ul><p style=\"min-height:1.5em\">Within 9 months, you will:</p><ul style=\"min-height:1.5em\"><li><p style=\"min-height:1.5em\">Lead the coordination of multiple trade shows independently.</p></li><li><p style=\"min-height:1.5em\">Develop and execute social media strategies to enhance brand visibility.</p></li><li><p style=\"min-height:1.5em\">Contribute to the development of marketing collateral and promotional materials.</p></li><li><p style=\"min-height:1.5em\">Provide recommendations to optimize event planning processes.</p></li></ul><p style=\"min-height:1.5em\"><strong>What You’ll Bring</strong></p><ul style=\"min-height:1.5em\"><li><p style=\"min-height:1.5em\">1-2 years in Marketing or related role</p></li><li><p style=\"min-height:1.5em\">Experience in a fast-paced environment, preferabbly in SaaS and/or Fintech</p></li><li><p style=\"min-height:1.5em\">Strong organizational and multitasking skills with keen attention to detail.</p></li><li><p style=\"min-height:1.5em\">Excellent communication and interpersonal skills.</p></li><li><p style=\"min-height:1.5em\">Ability to work independently and within a team.</p></li><li><p style=\"min-height:1.5em\">Proficiency in Microsoft Office Suite (Word, Excel, PowerPoint) and Salesforce.</p></li><li><p style=\"min-height:1.5em\">Ability to work US timezone hours</p></li></ul><p style=\"min-height:1.5em\"><em>Please note that this role may evolve as our business needs change, so we appreciate your flexibility and adaptability.</em></p><p style=\"min-height:1.5em\"><strong>What’s In It For You?</strong></p><ul style=\"min-height:1.5em\"><li><p style=\"min-height:1.5em\"><strong>Remote Flexibility:</strong> Enjoy the freedom of remote work from anywhere, balancing life and career seamlessly.</p></li><li><p style=\"min-height:1.5em\"><strong>Unforgettable Off-Sites:</strong> Twice a year, bond with colleagues in exciting destinations, fostering teamwork and fresh ideas.</p></li><li><p style=\"min-height:1.5em\"><strong>Paid Time Off and National Holidays:</strong> Enjoy 20 PTO days yearly and the National Holidays for relaxation and rejuvenation.</p></li><li><p style=\"min-height:1.5em\"><strong>Stock Options:</strong> Joining us means having a stake in our success, so you'll receive stock options as part of your compensation package.</p></li><li><p style=\"min-height:1.5em\"><strong>Home Office Setup:</strong> Create your ideal workspace with a dedicated budget for home office essentials.</p></li><li><p style=\"min-height:1.5em\"><strong>Work Trip Budget:</strong> Grow personally and professionally with a budget for work-related trips and co-working.</p></li></ul><p style=\"min-height:1.5em\"><strong>About Us</strong></p><p style=\"min-height:1.5em\"><strong>Clutch</strong> is a revolutionary vertical SaaS company, proudly backed by Andreessen Horowitz (A16z), aimed at revolutionizing the way Credit Unions engage and change the lives of their members. As a champion of financial well-being, we address the urgent need for affordable lending solutions in an era where the average American grapples with over $155,000 in household debt.  Unlike traditional financial institutions, Clutch develops software to turn Credit Unions into FinTech lenders and leverage their balance sheets to responsibly lend to over 130M Americans. Our mission extends beyond mere financial transactions; we strive to fundamentally enhance the way credit unions interact with their members. By integrating cutting-edge technologies and user-centric designs, we help credit unions provide seamless digital experiences that are on par with leading tech companies. This approach not only preserves but revitalizes the longstanding tradition of community and member-focused service inherent to credit unions.</p><p style=\"min-height:1.5em\"><strong>Please note:</strong> This position is offered on a contractor basis. Applicants must have the necessary documentation and authorization to work in the country where the job is located. Clutch cannot provide sponsorship or assist with obtaining work permits for this role.</p>","tags":"[\"management\"]","pubDate":"2025-03-19T17:47:31.017Z","link":"https://jobs.ashbyhq.com/withclutch/00f1e199-15ea-465d-951a-651dfb14fb2e","slug":"marketing-coordinator-clutch-4072"},{"id":9626019707,"title":"Engineering Manager - Mobile","company":"Fingerprint","image":"https://avatars.githubusercontent.com/u/67208791?s=200&v=4","description":"&lt;div class=&quot;content-intro&quot;&gt;&lt;p&gt;&lt;strong&gt;Fingerprint&lt;/strong&gt;&amp;nbsp;empowers developers to stop online fraud at the source.&lt;/p&gt;\n&lt;p&gt;We work on turning radical new ideas in the fraud detection space into reality. Our products are developer-focused and our clients range from solo developers to publicly traded companies.&amp;nbsp;&lt;strong&gt;We are a globally dispersed, 100% remote company&lt;/strong&gt; with a strong open-source focus. Our flagship open-source project is &lt;a class=&quot;c-link c-link--focus-visible&quot; href=&quot;https://github.com/fingerprintjs/fingerprintjs&quot; target=&quot;_blank&quot; data-stringify-link=&quot;https://github.com/fingerprintjs/fingerprintjs&quot; data-sk=&quot;tooltip_parent&quot;&gt;FingerprintJS&lt;/a&gt; (20K stars on GitHub).&lt;/p&gt;\n&lt;p&gt;&lt;a class=&quot;c-link c-link--focus-visible&quot; href=&quot;https://www.crunchbase.com/organization/fingerprintjs&quot; target=&quot;_blank&quot; data-stringify-link=&quot;https://www.crunchbase.com/organization/fingerprintjs&quot; data-sk=&quot;tooltip_parent&quot;&gt;We have raised $77M&amp;nbsp;&lt;/a&gt;and are backed by Craft Ventures (previously invested in&amp;nbsp;&lt;a class=&quot;c-link c-link--focus-visible&quot; href=&quot;https://www.tesla.com/&quot; target=&quot;_blank&quot; data-stringify-link=&quot;https://www.tesla.com/&quot; data-sk=&quot;tooltip_parent&quot;&gt;Tesla,&amp;nbsp;&lt;/a&gt;&lt;a class=&quot;c-link c-link--focus-visible&quot; href=&quot;https://facebook.com/&quot; target=&quot;_blank&quot; data-stringify-link=&quot;https://facebook.com/&quot; data-sk=&quot;tooltip_parent&quot;&gt;Facebook,&amp;nbsp;&lt;/a&gt;&lt;a class=&quot;c-link c-link--focus-visible&quot; href=&quot;https://www.airbnb.com/&quot; target=&quot;_blank&quot; data-stringify-link=&quot;https://www.airbnb.com/&quot; data-sk=&quot;tooltip_parent&quot;&gt;Airbnb&amp;nbsp;&lt;/a&gt;), Nexus Venture Partners (previously invested in &lt;a href=&quot;https://www.postman.com/&quot;&gt;Postman&lt;/a&gt;, &lt;a href=&quot;https://www.apollo.io/&quot;&gt;Apollo.io,&lt;/a&gt; &lt;a href=&quot;https://min.io/&quot;&gt;MinIO&lt;/a&gt;, Druva)&amp;nbsp;and Uncorrelated Ventures (previously invested in&amp;nbsp;&lt;a class=&quot;c-link c-link--focus-visible&quot; href=&quot;https://redis.io/&quot; target=&quot;_blank&quot; data-stringify-link=&quot;https://redis.io/&quot; data-sk=&quot;tooltip_parent&quot;&gt;Redis,&amp;nbsp;&lt;/a&gt;&lt;a class=&quot;c-link c-link--focus-visible&quot; href=&quot;https://rollbar.com/&quot; target=&quot;_blank&quot; data-stringify-link=&quot;https://rollbar.com/&quot; data-sk=&quot;tooltip_parent&quot;&gt;Rollbar&amp;nbsp;&lt;/a&gt;&amp;amp;&lt;a class=&quot;c-link c-link--focus-visible&quot; href=&quot;https://gradle.org/&quot; target=&quot;_blank&quot; data-stringify-link=&quot;https://gradle.org/&quot; data-sk=&quot;tooltip_parent&quot;&gt;&amp;nbsp;Gradle&lt;/a&gt;).&lt;/p&gt;\n&lt;p&gt;&lt;em&gt;We have noticed a rise in recruiting impersonations across the industry, where scammers attempt to access candidates&#39; personal and financial information through fake interviews and offers. All Fingerprint recruiting email communications will always come from the @fingerprint.com domain. Any outreach claiming to be from Fingerprint via other sources should be ignored.&lt;/em&gt;&lt;/p&gt;\n&lt;p&gt;&amp;nbsp;&lt;/p&gt;\n&lt;hr&gt;\n&lt;p&gt;&amp;nbsp;&lt;/p&gt;\n&lt;p&gt;&amp;nbsp;&lt;/p&gt;\n&lt;p&gt;&amp;nbsp;&lt;/p&gt;&lt;/div&gt;&lt;p&gt;We are looking for a &lt;strong&gt;Software Engineering Manager to join our Smart Signals team&lt;/strong&gt;. In this role, you will foster a culture of high performance, helping engineers grow and build products and features that deliver exceptional value to our customers. We believe that diverse perspectives fuel innovation, and we encourage candidates from all backgrounds and experiences to apply.&lt;/p&gt;\n&lt;h3&gt;&lt;strong&gt;What You’ll Do:&lt;/strong&gt;&lt;/h3&gt;\n&lt;ul&gt;\n&lt;li&gt;Lead and mentor a team of engineers responsible for developing and enhancing our Platform services, which play a key role in supporting our flagship products: &lt;a href=&quot;https://fingerprint.com/products/identification/&quot;&gt;identification&lt;/a&gt; and &lt;a href=&quot;https://fingerprint.com/products/smart-signals/&quot;&gt;smart signals&lt;/a&gt;.&lt;/li&gt;\n&lt;li&gt;Provide technical leadership by collaborating with senior engineers, staying informed about technology trends, and guiding the team through the challenges of scaling.&lt;/li&gt;\n&lt;li&gt;Communicate technical concepts effectively to team members and stakeholders with diverse technical backgrounds.&lt;/li&gt;\n&lt;li&gt;Review code (PRs) when necessary, and provide guidance during complex technical architecture discussions.&lt;/li&gt;\n&lt;li&gt;Coach and support the growth of software developers, promoting continuous learning and development.&lt;/li&gt;\n&lt;li&gt;Work closely with product managers to deliver robust, customer-centric, API-first solutions that enable our customers to fight fraud.&lt;/li&gt;\n&lt;/ul&gt;\n&lt;h3&gt;&lt;strong&gt;Requirements:&lt;/strong&gt;&lt;/h3&gt;\n&lt;ul&gt;\n&lt;li&gt;Minimum of 2 years of experience leading software engineering teams in an agile environment.&lt;/li&gt;\n&lt;li&gt;At least 5 years of professional experience in software engineering, particularly within SaaS.&lt;/li&gt;\n&lt;li&gt;Strong technical background in software engineering and cloud computing technologies.&lt;/li&gt;\n&lt;li&gt;Proven ability to lead software projects that prioritize quality, reliability, and user impact.&lt;/li&gt;\n&lt;li&gt;Demonstrated success in driving change and innovation in fast-paced, scaling environments.&lt;/li&gt;\n&lt;/ul&gt;\n&lt;h3&gt;&lt;strong&gt;Preferred Qualifications:&lt;/strong&gt;&lt;/h3&gt;\n&lt;ul&gt;\n&lt;li&gt;Experience leading teams in a startup or high-growth environment.&lt;/li&gt;\n&lt;li&gt;Experience with AWS and cloud-based infrastructure.&lt;/li&gt;\n&lt;li&gt;Familiarity with programming languages such as Go and TypeScript.&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;&lt;strong&gt;&lt;em&gt;Compensation Range&lt;/em&gt;&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;em&gt;$200k - $250k &lt;/em&gt;&lt;em&gt;For cash compensation, we set standard ranges for all&amp;nbsp;&lt;/em&gt;&lt;strong&gt;&lt;em&gt;US based roles based&lt;/em&gt;&lt;/strong&gt;&lt;em&gt;&amp;nbsp;on function, level and geographic location, benchmarked against similar stage growth companies. In order to be compliant with local legislation, as well as to provide greater transparency to candidates, we share salary ranges on all job postings regardless of desired hiring location.&lt;/em&gt;&lt;/p&gt;&lt;div class=&quot;content-conclusion&quot;&gt;&lt;p&gt;&lt;em&gt;We have noticed a rise in recruiting impersonations across the industry, where scammers attempt to access candidates&#39; personal and financial information through fake interviews and offers. All Fingerprint recruiting email communications will always come from the @fingerprint.com domain. Any outreach claiming to be from Fingerprint via other sources should be ignored.&lt;/em&gt;&lt;/p&gt;\n&lt;p&gt;Offers vary depending on, but not limited to, relevant experience, education, certifications/licenses, skills, training, and market conditions.&amp;nbsp;&lt;/p&gt;\n&lt;p&gt;Due to regulatory and security reasons, there’s a small number of countries where we cannot have Fingerprint teammates based.&amp;nbsp;&lt;strong data-stringify-type=&quot;bold&quot;&gt;Additionally, because Fingerprint is an all-remote company and people can join our workforce from almost any country, we do not sponsor visas. Fingerprint teammates need to be authorized to work from their home location&lt;/strong&gt;.&lt;/p&gt;\n&lt;p&gt;We are dedicated to creating an inclusive work environment for everyone. We embrace and celebrate the unique experiences, perspectives and cultural backgrounds that each employee brings to our workplace. Fingerprint strives to foster an environment where our employees feel respected, valued and empowered, and our team members are at the forefront in helping us promote and sustain an inclusive workplace. We highly encourage people from underrepresented groups in tech to apply.&lt;/p&gt;\n&lt;p&gt;If you are applying as a resident of California, please read our CCPA notice &lt;a href=&quot;https://dev.fingerprint.com/docs/dpa-ccpa&quot; target=&quot;_blank&quot;&gt;here&lt;/a&gt;&lt;/p&gt;\n&lt;p&gt;If you are applying as a resident of the EU, please read our GDPR notice &lt;a href=&quot;https://dev.fingerprint.com/docs/dpa-gdpr&quot; target=&quot;_blank&quot;&gt;here&lt;/a&gt;&lt;/p&gt;&lt;/div&gt;","tags":"[\"typescript\",\"engineering\",\"aws\"]","pubDate":"2025-03-19T15:41:34.000Z","link":"https://fingerprint.com/careers/jobs/apply/?gh_jid=5467962004","slug":"engineering-manager-mobile-fingerprint-3052"}]