[{"id":5507639427,"title":"Skillbridge Intern - Technical Writing (Transitioning Military)","company":"Istari","image":"https://pbs.twimg.com/profile_images/1618665164999360515/9HfoZiGf_400x400.jpg","description":"<div class=\"section page-centered\" data-qa=\"job-description\"><div>[ABOUT ISTARI DIGITAL]</div><div><span style=\"font-size: 11pt\">Istari is a digital engineering software company enabling our customers to turn the physical world into the digital to accomplish their specific mission or business objectives.</span></div><div><br></div><div><span style=\"font-size: 11pt\">Istari was founded with the vision of making open, scalable digital engineering ecosystems a reality – where new technologies and systems are created digitally, free from the real-world constraints of costs and schedules. We are creating the world’s best engineering model sharing platform, allowing our customers to simply and securely integrate their models across different engineering disciplines, organizations, and security levels.</span></div><div><br></div><div><span style=\"font-size: 11pt\">At Istari, we are passionate about our mission of creating the world's first open and scalable industrial metaverse. Whether our customers are designing prototypes, performing virtual testing, or training AI and autonomy for complex systems, we know that going digital will save them time, resources, and reduce their environmental impact.&nbsp;&nbsp;</span></div><div><br></div><div><span style=\"font-size: 11pt\">While we are a distributed team with most team-members working remotely, we place an emphasis on staying connected and collaborative, prioritizing in-person opportunities to build trust as a team. At Istari, we still believe that trust is best built in-person. To do this, we have an engineering headquarters in Cambridge, MA for focused technical development and several times per year we gather for an off-site that allows us to develop our professional skills and our team relationships.</span></div><div><br></div><div>[VALUES]</div><div>At Istari, we live by our values, which include:</div><div><br></div><div><b>Purposeful Autonomy</b></div><div>We value letting people self-organize and self-motivate.&nbsp;</div><div>Our flat structure and lack of meeting clutter are meant to empower individuals and teams to be proactive.</div><div>Our autonomy is measured, goal-oriented, and results-driven –&nbsp;not meandering. </div><div>Clear objectives help us prioritize our time.</div><div><br></div><div><b>Smart Transparency</b></div><div>We believe in honest-but-kind communication, transparency, and open-door policies. </div><div>We love learning about challenges and tackling them early, not hearing good or bad news late. </div><div>We share work-in-progress across our team.&nbsp;</div><div>Fast feedback keeps autonomy purposeful.</div><div><br></div><div><b>Continual Curiosity</b></div><div>At Istari, we love learning to do things ourselves. </div><div>We ask, read, share, teach – even watch YouTube videos – to learn new skills to solve problems. </div><div>When we make breakthroughs, we write them down.&nbsp; &nbsp;</div><div>Writing focuses ideas, helps us learn, and helps us share.</div><div><br></div><div><b>Equal Opportunity </b></div><div>Istari is an Equal Opportunity/Affirmative Action Employer. All qualified applicants will receive consideration for employment without regard to race, color, religion, sex, pregnancy, sexual orientation, gender identity, national origin, age, protected veteran status, or disability status.</div><div><br></div><div><br></div><div><span style=\"font-size: 12pt\">Join Istari Digital as a Technical Writing Skillbridge Intern and play a pivotal role in safeguarding our groundbreaking digital engineering Intellectual Property (IP), including our notable US patent US Pat. 11,775,707. Working under the guidance of our Vice President of Strategy and IP, you will review and update patent applications, ensuring our product's innovation is well-protected and aligned with our strategic roadmap.&nbsp;</span></div><div><br></div><div><span style=\"font-size: 12pt\">Collaborate closely with our world-class software engineering team to articulate the vision behind our industry-leading platform’s security, user interface features and AI applications. This position is a gateway to understanding complex digital engineering concepts and translating them into comprehensive written work products.&nbsp;</span></div><div><br></div><div><span style=\"font-size: 12pt\">Step into a role where your efforts make a real difference in shaping our key products. You'll be integral to our intellectual property strategy and the development of our products, ensuring your work has a direct impact. Our culture values autonomy and curiosity and you will develop expertise across a variety of areas from cybersecurity to user interfaces to AI, under the guidance of our VP of Strategy and IP.&nbsp;</span></div><div><br></div><div><span style=\"font-size: 12pt\">This opportunity is exclusively for Department of Defense (DoD) Service Members eligible for the Military DoD SkillBridge Program. Interns will not receive compensation from Istari Digital during their internship, as they will continue to receive military compensation and benefits as active duty Service Members. At the moment, there is no full time position available that the internship feeds directly into. However, depending on demonstrated performance and available positions, placement in other departments may be possible. </span></div></div><div class=\"section page-centered\" data-qa=\"closing-description\"><div><span style=\"font-size: 24px\">BENEFITS</span></div><div>We offer highly competitive benefits, including:</div><div><br></div><div><span style=\"font-size: 18px\">Health and Family</span></div><div>- Medical/Dental/Vision</div><div>- Employee Premiums are 100% Company Paid</div><div>- Life Insurance</div><div>- Flexible Work Hours&nbsp;</div><div>- Unlimited Paid Time Off (PTO) with federal government holidays</div><div><br></div><div><span style=\"font-size: 18px\">Financial</span></div><div>- Competitive Compensation&nbsp;</div><div>- 401k&nbsp;</div><div>- Company Stock Options</div><div>- Home Office Setup Budget</div><div><br></div><div><span style=\"font-size: 18px\">Learning</span></div><div>- Reimbursement for approved trainings and subscriptions</div><div>- Conferences (travel, lodging, and fees)</div><div><br></div><div>Note - some benefits are not available to interns or contractors.</div><div><br></div><div>Thank you for your interest in Istari. Expect to hear back from us soon with next steps.</div></div><div class=\"section page-centered last-section-apply\" data-qa=\"btn-apply-bottom\"><a class=\"postings-btn template-btn-submit cerulean\" data-qa=\"show-page-apply\" href=\"https://jobs.lever.co/istaridigital.ai/2d6c2511-1397-43cd-ab65-1008f790f7d5/apply\">Apply for this job</a></div>","tags":"[\"engineering\"]","pubDate":"2024-02-15 14:14:15.973","link":"https://jobs.lever.co/istaridigital.ai/2d6c2511-1397-43cd-ab65-1008f790f7d5","savedDate":"2024-02-15 14:14:15.973","slug":"skillbridge-intern-technical-writing-transitioning-military-istari-7108"},{"id":7578016169,"title":"Client Success Representative Bilingual (English/Spanish)","company":"Bobtail","image":"https://media.licdn.com/dms/image/D4E0BAQGvUyfPVBWDyg/company-logo_200_200/0/1657595552015?e=2147483647&v=beta&t=EecsDCOy3Fh_26M1noQDDIYw8-JuGKz_d1JDvcBZ-yI","description":"\n    \n\n    <h2><span style=\"font-weight: 400;\">About Bobtail</span></h2>\n<p><span style=\"font-weight: 400;\">Bobtail is dedicated to increasing happiness by eliminating inefficiencies in the supply chain.&nbsp; We envision a supply chain without friction, fraud, waste, and abuse where companies succeed based on the value they create.&nbsp;&nbsp;</span></p>\n<p><span style=\"font-weight: 400;\">We work uniquely at Bobtail, where we value teams over individuals and constantly encourage experimentation and iteration to improve. Teams are given flexibility in working towards a shared purpose and the freedom to decide how they will accomplish their goals.&nbsp;&nbsp;</span></p>\n<p><span style=\"font-weight: 400;\">If you are an out-of-the-box thinker that takes a proactive approach to collaborate with others to solve problems and achieve your goals - we would love to talk to you.&nbsp;&nbsp;</span></p>\n<p><span style=\"font-weight: 400;\">The things we value:</span></p>\n<ol>\n<li style=\"font-weight: 400;\"><span style=\"font-weight: 400;\">Mission</span></li>\n<li style=\"font-weight: 400;\"><span style=\"font-weight: 400;\">Teams over individuals</span></li>\n<li style=\"font-weight: 400;\"><span style=\"font-weight: 400;\">Collaboration</span></li>\n<li style=\"font-weight: 400;\"><span style=\"font-weight: 400;\">Communication</span></li>\n<li style=\"font-weight: 400;\"><span style=\"font-weight: 400;\">Iteration</span></li>\n<li style=\"font-weight: 400;\"><span style=\"font-weight: 400;\">Experimentation and failing fast</span></li>\n<li style=\"font-weight: 400;\"><span style=\"font-weight: 400;\">Initiative and solutions-oriented approach</span></li>\n<li style=\"font-weight: 400;\"><span style=\"font-weight: 400;\">Documentation</span></li>\n<li style=\"font-weight: 400;\"><span style=\"font-weight: 400;\">Data</span></li>\n<li style=\"font-weight: 400;\"><span style=\"font-weight: 400;\">Mental health and work-life balance</span></li>\n<li style=\"font-weight: 400;\"><span style=\"font-weight: 400;\">Diversity</span></li>\n<li style=\"font-weight: 400;\"><span style=\"font-weight: 400;\">Transparency</span></li>\n</ol>\n<h2><span style=\"font-weight: 400;\">You should apply if you have:</span></h2>\n<ul>\n<li style=\"font-weight: 400;\"><span style=\"font-weight: 400;\">Customer service experience (2/3 years minimum)</span></li>\n<li style=\"font-weight: 400;\"><span style=\"font-weight: 400;\">Possess excellent verbal and written communication skills</span></li>\n<li style=\"font-weight: 400;\"><span style=\"font-weight: 400;\">Time management and multitasking skills in order to handle multiple tasks and clients at once</span></li>\n<li style=\"font-weight: 400;\"><span style=\"font-weight: 400;\">Strong organizational skills and attention to detail</span></li>\n<li style=\"font-weight: 400;\"><span style=\"font-weight: 400;\">Capable of prioritizing tasks/requests to meet the client &amp; company needs</span></li>\n<li style=\"font-weight: 400;\"><span style=\"font-weight: 400;\">Ability to work independently and as part of a team</span></li>\n</ul>\n<h2><span style=\"font-weight: 400;\">You will be responsible for:</span></h2>\n<ul>\n<li style=\"font-weight: 400;\"><span style=\"font-weight: 400;\">Act as the first point of contact for company clients</span></li>\n<li style=\"font-weight: 400;\"><span style=\"font-weight: 400;\">Resolve complaints and prevent additional issues by improving processes.</span></li>\n<li style=\"font-weight: 400;\"><span style=\"font-weight: 400;\">Build &amp; maintain a good relationship with assigned carriers based on trust and respect</span></li>\n<li style=\"font-weight: 400;\"><span style=\"font-weight: 400;\">Collaborate with internal departments to fulfil carrier needs</span></li>\n<li style=\"font-weight: 400;\"><span style=\"font-weight: 400;\">Maintain up-to-date knowledge for assigned accounts</span></li>\n<li style=\"font-weight: 400;\"><span style=\"font-weight: 400;\">Answer incoming calls from carriers, brokers &amp; potential new clients</span></li>\n<li style=\"font-weight: 400;\"><span style=\"font-weight: 400;\">Communicate with assigned carriers via email, text or phone</span></li>\n</ul>\n<h2><span style=\"font-weight: 400;\">Benefits</span></h2>\n<ul>\n<li style=\"font-weight: 400;\"><span style=\"font-weight: 400;\">Monthly Mental Break Day</span></li>\n<li style=\"font-weight: 400;\"><span style=\"font-weight: 400;\">Work from home (or wherever)</span></li>\n<li style=\"font-weight: 400;\"><span style=\"font-weight: 400;\">Parental leave</span></li>\n</ul>\n<p>&nbsp;</p>\n<p><span style=\"font-weight: 400;\">Creating a diverse and inclusive workplace is Bobtail’s nucleus. We are an equal opportunity employer and embrace people of different backgrounds, cultures, religions, national origins, races, colors, genders, gender expressions, sexual orientations, ages, marital status, veteran status, experiences, abilities, and perspective</span><span style=\"font-weight: 400;\">s.</span><span style=\"font-weight: 400;\"> </span><span style=\"font-weight: 400;\"><br><br></span></p>\n<p><br><br></p>\n\n    \n\n    \n","tags":"[\"management\"]","pubDate":"2024-02-15 14:14:15.972","link":"https://boards.greenhouse.io/bobtail/jobs/4057519005","savedDate":"2024-02-15 14:14:15.972","slug":"client-success-representative-bilingual-english-spanish-bobtail-5250"},{"id":4634701510,"title":"Jr. Salesforce Administrator","company":"Bobtail","image":"https://media.licdn.com/dms/image/D4E0BAQGvUyfPVBWDyg/company-logo_200_200/0/1657595552015?e=2147483647&v=beta&t=EecsDCOy3Fh_26M1noQDDIYw8-JuGKz_d1JDvcBZ-yI","description":"\n    \n\n    <h2>About Bobtail</h2>\n<p>Bobtail is dedicated to increasing happiness by eliminating inefficiencies in the supply chain.&nbsp; We envision a supply chain without friction, fraud, waste, and abuse where companies succeed based on the value they create.&nbsp;&nbsp;</p>\n<p>We work uniquely at Bobtail, where we value teams over individuals and constantly encourage experimentation and iteration to improve. Teams are given flexibility in working towards a shared purpose and the freedom to decide how they will accomplish their goals.&nbsp;&nbsp;</p>\n<p>If you are an out-of-the-box thinker that takes a proactive approach to collaborating with others to solve problems and achieve your goals - we would love to talk to you.&nbsp;&nbsp;</p>\n<p>The things we value:</p>\n<ol>\n<li>Mission</li>\n<li>Teams over individuals</li>\n<li>Collaboration</li>\n<li>Communication</li>\n<li>Iteration</li>\n<li>Experimentation and failing fast</li>\n<li>Initiative and solutions-oriented approach</li>\n<li>Documentation</li>\n<li>Data</li>\n<li>Mental health and work-life balance</li>\n<li>Diversity</li>\n<li>Transparency</li>\n</ol>\n<h2>You should apply if you have:</h2>\n<ul>\n<li>Minimum a year of experience as a Salesforce Administrator.</li>\n<li>Salesforce Admin certified.</li>\n<li>Bachelor’s degree required.</li>\n</ul>\n<p>&nbsp;</p>\n<h2>You will be responsible for:</h2>\n<ul>\n<li>Responsible for the overall design of the functional Salesforce CRM solution and for recommending the best solution designs based on business needs</li>\n<li>Design elegant, innovative Salesforce solutions involving: configuration of Salesforce and other managed packages, creation and refinement of complex data models, external integration, business process automation, and other custom functionality</li>\n<li>Handle all administrative functions such as object configuration, security setup, reporting and dashboards, workflows, and other configuration tasks.</li>\n<li>Define and document development requirements and outline best practices in implementing system solutions.</li>\n<li>Contribute significantly to thought leadership across the platform including ideation and design of new accelerators</li>\n<li>Follow and understand new Salesforce products and technical capabilities resulting from product releases and acquisitions.</li>\n<li>Provide hands-on, expert-level technical assistance, coaching, and mentoring to the sales, onboarding, and retention teams.</li>\n</ul>\n<p>&nbsp;</p>\n<h2>Benefits</h2>\n<p>&nbsp;</p>\n<ul>\n<li style=\"font-weight: 400;\"><span style=\"font-weight: 400;\">Monthly Mental Break Day</span></li>\n<li style=\"font-weight: 400;\"><span style=\"font-weight: 400;\">Paid Time Off</span></li>\n<li style=\"font-weight: 400;\"><span style=\"font-weight: 400;\">Work from home (or wherever)</span></li>\n<li style=\"font-weight: 400;\"><span style=\"font-weight: 400;\">Parental leave</span></li>\n</ul>\n<p>&nbsp;</p>\n<p>Creating a diverse and inclusive workplace is Bobtail’s nucleus. We are an equal opportunity employer and embrace people of different backgrounds, cultures, religions, national origins, races, colors, genders, gender expressions, sexual orientations, ages, marital status, veteran status, experiences, abilities, and perspectives. <br><br></p>\n<p>&nbsp;</p>\n\n    \n\n    \n","tags":"[]","pubDate":"2024-02-15 14:14:15.972","link":"https://boards.greenhouse.io/bobtail/jobs/4369726005","savedDate":"2024-02-15 14:14:15.972","slug":"jr-salesforce-administrator-bobtail-9214"},{"id":6593696557,"title":"Site Reliability Engineering Manager","company":"Canonical","image":"https://pbs.twimg.com/profile_images/1673959375340290050/x7pNtXQ7_400x400.jpg","description":"\n      <p>This is a world-class devops and gitops engineering management challenge, bringing together operations management, software engineering and product development, and team leadership in a single high-value role.</p>\n<p>Our mission is to pioneer and prove new and better approaches to large-scale IS. We support Canonical and Ubuntu operations, but we also help shape Canonical's managed application service offerings, raising the bar on devops and cloud-native operations. We take infra-as-code to the next level, blazing a trail to next-generation model-driven operations. We not only aim to automate every process that underpins our business, we also share that automation as open source packages which others use to drive their own operations.</p>\n<p>We work across the full stack, from bare metal to Kubernetes, including cloud and virtualisation. We also work across the full range of infrastructure, from public cloud to private cloud and edge.</p>\n<p>We have fully distributed, home-based teams in EMEA, APAC and the Americas. You will lead a team in your time zone, and report to a global director who may not be in your time zone.</p>\n<h2>Your role as SRE Manager</h2>\n<p>You will need to be a Linux and operations expert, as well as a great manager capable of leading a high-performance team, to excel in this role.</p>\n<p>The IS team at Canonical runs the services used by over 60 million Ubuntu users. We automate all of Canonical’s production services, embracing model-driven operations. We are part of Canonical's effort to raise the bar on ops technology, encapsulating real-world operational knowledge into reusable and composable software operations packages. We use our real-life operational experiences to contribute to product improvements.</p>\n<p>From Kubernetes to the kernel and everything in-between, you will be working with the latest technologies in a fast-paced engineering environment. As an SRE Manager you will be responsible for the operations engineers in your time zone.&nbsp; This includes customer service management, managed services operations and consistent product improvement engineering. Collaboration with internal customers, product engineering, and development groups is critical to success.</p>\n<h2>What your day will look like</h2>\n<ul>\n<li>Lead your team in daily agile devops practices</li>\n<li>Represent the IS team to stakeholders, customers, and internal teams</li>\n<li>Organize, coordinate and drive internal projects</li>\n<li>Mentor engineers to improve their skills</li>\n<li>Identify and measure team health indicators</li>\n<li>Implement structured engineering and operations processes</li>\n<li>Ensure proper team focus on priorities, milestones, and deliverables</li>\n<li>Work to meet service level agreements with customer deployments around the globe</li>\n<li>Deliver quality managed services in a consistent, timely manner</li>\n</ul>\n<h2>What we are looking for in you</h2>\n<ul>\n<li>Drive and a track record of going above-and-beyond expectations</li>\n<li>Proven experience of software delivery using infrastructure as code</li>\n<li>Proven experience managing devops teams for SAAS or similar offerings</li>\n<li>Understanding of testing methodologies and maintainable code quality</li>\n<li>Technical aptitude for understanding complex distributed systems</li>\n<li>Experience with cloud topologies and technologies</li>\n<li>Ability to travel twice a year, for company events up to two weeks long</li>\n<li>An exceptional academic track record from both high school and university</li>\n</ul>\n<h2>Additional skills that you might also bring</h2>\n<ul>\n<li>Experience with Ubuntu system administration</li>\n<li>Experience with agile software development methodologies</li>\n<li>Experience working in and managing distributed teams</li>\n</ul>\n<h2>What we offer you</h2>\n<p>We consider geographical location, experience, and performance in shaping compensation worldwide. We revisit compensation annually (and more often for graduates and associates) to ensure we recognise outstanding performance. In addition to base pay, we offer a performance-driven annual bonus. We provide all team members with additional benefits, which reflect our values and ideals. We balance our programs to meet local needs and ensure fairness globally.</p>\n<ul>\n<li>Distributed work environment with twice-yearly team sprints in person</li>\n<li>Personal learning and development budget of USD 2,000 per year</li>\n<li>Annual compensation review</li>\n<li>Recognition rewards</li>\n<li>Annual holiday leave</li>\n<li>Maternity and paternity leave</li>\n<li>Employee Assistance Programme</li>\n<li>Opportunity to travel to new locations to meet colleagues</li>\n<li>Priority Pass, and travel upgrades for long haul company events</li>\n</ul>\n<h2>About Canonical</h2>\n<p>Canonical is a pioneering tech firm at the forefront of the global move to open source. As the company that publishes Ubuntu, one of the most important open source projects and the platform for AI, IoT and the cloud, we are changing the world on a daily basis. We recruit on a global basis and set a very high standard for people joining the company. We expect excellence - in order to succeed, we need to be the best at what we do. Canonical has been a remote-first company since its inception in 2004.​ Working here is a step into the future, and will challenge you to think differently, work smarter, learn new skills, and raise your game.</p>\n<h2>Canonical is an equal opportunity employer</h2>\n<p>We are proud to foster a workplace free from discrimination. Diversity of experience, perspectives, and background create a better work environment and better products.<a href=\"https://canonical.com/careers/diversity/identity\"> Whatever your identity, we will give your application fair consideration.</a></p>\n<p>#LI-remote</p>\n    ","tags":"[\"management\",\"engineering\"]","pubDate":"2024-02-15 14:14:15.972","link":"https://canonical.com/careers/5535122","savedDate":"2024-02-15 14:14:15.972","slug":"site-reliability-engineering-manager-canonical-7136"},{"id":1388105684,"title":"QA Specialist (Remote / Anywhere)","company":"Collabora","image":"https://pbs.twimg.com/profile_images/1545121577632763912/7FMnABb0_400x400.jpg","description":"<div class=\"section page-centered\" data-qa=\"job-description\"><div>We are looking for a detail-oriented and proactive Quality Assurance Specialist to ensure the quality and reliability of our products/services.</div><div><br></div><div>The ideal candidate will have a strong understanding of QA methodologies, excellent communication skills and a passion for delivering top-notch solutions.</div><div><br></div><div>As a QA Specialist, you will collaborate with cross-functional teams to identify and address issues, conduct thorough testing and contribute to the continuous improvement of our processes.</div></div><div class=\"section page-centered\"><div><h3>Responsibilities:</h3><ul class=\"posting-requirements plain-list\"><ul><li>Develop and implement comprehensive test plans and test cases for software, applications, or products to ensure they meet established quality standards</li><li>Perform functional, regression and performance testing to identify and report defects or inconsistencies in product functionality</li><li>Collaborate with product development and project management teams to understand project requirements and provide input on  testability and quality aspects</li><li>Document and track test results, issues and resolution efforts to ensure clear communication and visibility of QA activities</li><li>Conduct root cause analysis for identified defects and work with the development team to facilitate timely resolutions</li><li>Contribute to the establishment and enhancement of quality assurance standards and best practices within the organization</li><li>Willingness to take part in meetings</li><li>\"Can do” attitude in different situations</li></ul></ul></div></div><div class=\"section page-centered\"><div><h3>Qualifications:</h3><ul class=\"posting-requirements plain-list\"><ul><li>Bachelor's degree in Computer Science, Engineering, or a related field</li><li>Proven experience in software quality assurance, with a focus on manual testing</li><li>Strong understanding of QA methodologies, tools, and processes</li><li>Excellent analytical and problem-solving skills</li><li>Experience to work in an open source environment is a plus</li><li>Strong communication and collaboration skills with the ability to work effectively in a team environment</li><li>Detail-oriented with a commitment to delivering high-quality results</li><li>Experience with test automation tools and frameworks is a plus (e.g., Cypress, Cppunit)</li></ul></ul></div></div><div class=\"section page-centered\" data-qa=\"closing-description\"><div>If you are passionate about ensuring the highest level of quality in products/services and are ready to contribute to a dynamic and  innovative team, we encourage you to apply.</div><div><br></div><div>Join us in our commitment to excellence and be a key player in our continued success.</div><div><br></div><div><br></div><div><br></div><div>#LI-Remote</div></div><div class=\"section page-centered last-section-apply\" data-qa=\"btn-apply-bottom\"><a class=\"postings-btn template-btn-submit hex-color\" data-qa=\"show-page-apply\" href=\"https://jobs.lever.co/collabora/fe632e11-5ffb-4892-b983-012036488066/apply\">Apply for this job</a></div>","tags":"[\"management\",\"engineering\"]","pubDate":"2024-02-15 14:14:15.972","link":"https://jobs.lever.co/collabora/fe632e11-5ffb-4892-b983-012036488066","savedDate":"2024-02-15 14:14:15.972","slug":"qa-specialist-remote-anywhere-collabora-9896"},{"id":2410806011,"title":"Enterprise Account Executive, EMEA based [IC4]","company":"Sourcegraph","image":"https://pbs.twimg.com/profile_images/1428393724527190022/4mt5PACL_400x400.png","description":"\n    <div class=\"content-intro\"><h3>ALL SOURCEGRAPH ROLES ARE FULLY REMOTE</h3>\n<h2><span style=\"color: #a112ff;\">Who we are</span></h2>\n<p>Our mission at Sourcegraph is to make it so that&nbsp;<a class=\"c-link\" href=\"https://handbook.sourcegraph.com/strategy-goals/strategy\" target=\"_blank\" data-stringify-link=\"https://handbook.sourcegraph.com/strategy-goals/strategy\" data-sk=\"tooltip_parent\">everyone can code</a>, not just ~0.1% of the population. Our code graph powers Cody, the most powerful and accurate AI coding assistant, as well as our Code Search product, which helps devs explore their entire codebase and make large-scale migrations and security fixes. We’re building software that builds software, and in doing so we’re making devs more productive and preparing for a world where a lot more code gets written.</p>\n<p>It’s an exciting time to join Sourcegraph. AI has taken over the world, and we’ve spent the last 10 years building infrastructure that’s integral to making AI generated code more powerful and accurate. Our customers include 4/5 FAANG companies, 4 of the top 10 banks, government organizations, Uber, Plaid, and many other companies building the software that pushes the world forward. We’ve raised $225M at a $2.625B valuation from <a class=\"c-link\" href=\"https://techcrunch.com/2021/07/13/sourcegraph-raises-125m-series-d-on-2-6b-valuation-for-universal-code-search-tool/\" target=\"_blank\" data-stringify-link=\"https://techcrunch.com/2021/07/13/sourcegraph-raises-125m-series-d-on-2-6b-valuation-for-universal-code-search-tool/\" data-sk=\"tooltip_parent\">Andreessen Horowitz</a>,&nbsp;<a class=\"c-link\" href=\"https://about.sourcegraph.com/blog/series-c-with-sequoia/\" target=\"_blank\" data-stringify-link=\"https://about.sourcegraph.com/blog/series-c-with-sequoia/\" data-sk=\"tooltip_parent\">Sequoia</a>,&nbsp;<a class=\"c-link\" href=\"https://www.redpoint.com/companies/sourcegraph/\" target=\"_blank\" data-stringify-link=\"https://www.redpoint.com/companies/sourcegraph/\" data-sk=\"tooltip_parent\">Redpoint</a>,&nbsp;<a class=\"c-link\" href=\"https://medium.com/craft-ventures/why-we-invested-in-sourcegraph-5ace28317e3d\" target=\"_blank\" data-stringify-link=\"https://medium.com/craft-ventures/why-we-invested-in-sourcegraph-5ace28317e3d\" data-sk=\"tooltip_parent\">Craft</a>&nbsp;and others. We’re making ambitious bets on our future and we’re looking to hire exceptional people to join our team as we make Sourcegraph one of the biggest and most influential companies in the world.</p></div>\n\n    <h2><span style=\"color: rgb(161, 18, 255);\"><strong>Working hours&nbsp;</strong></span></h2>\n<p>🌎Sourcegraph is an all-remote company &amp; hires <a href=\"https://handbook.sourcegraph.com/departments/people-ops/process/how-we-engage-talent-outside-the-us/\">almost anywhere</a> in the world. However, for this role, we do require successful candidates to be located in the EMEA region.&nbsp;</p>\n<h2><span style=\"color: rgb(161, 18, 255);\"><strong>Why this job is exciting</strong></span></h2>\n<p>As an Enterprise Account Executive, you will have more responsibility, upside, and growth potential than anywhere else otherwise comparable. We strive to make Sourcegraph the best company where exceptionally talented people can thrive. If you join us, we know you’ll make a big impact!&nbsp; Here’s what we’re thinking:</p>\n<p>Within one month, you will…&nbsp;</p>\n<ul>\n<li>Begin 1:1’s with your manager, understand your 30-60-90 plan, meet &amp; shadow current members of the Sourcegraph team, understand your quota, and delve into your territory.</li>\n<li>Build your territory plan to penetrate net-new logo accounts with a heavy emphasis on outbound and growing the footprint of your existing customers.</li>\n<li>Meet key partners in Customer Engineering, Product, Legal and Engineering teams - they will be key relationships for you throughout your deal cycle.</li>\n</ul>\n<p>Within three months, you will…</p>\n<ul>\n<li>Understand the superpowers that Sourcegraph provides a development organization, and create compelling strategies to align Sourcegraph value to your prospect’s goals, needs, and objectives.</li>\n<li>Be a product expert, perfect your storytelling of use cases, demonstrate the product and convey real-world success stories of customers</li>\n<li>Identify champions, influencers, and key stakeholders in the decision process, and build trusted advisor relationships with them to help bring more engineering organizations onto the Sourcegraph platform.&nbsp;</li>\n<li>Leverage a consistent sales process to continuously build and move pipeline forward (while regularly and accurately capturing updates and pipeline forecasts).</li>\n<li>Develop and negotiate complex enterprise level proposals and contracts.</li>\n<li>Work with our product team to be the voice of the customer and bring market insights to our roadmap.</li>\n<li>Consistently achieve your activity goals.&nbsp;</li>\n</ul>\n<p>Within six months, you will…</p>\n<ul>\n<li>Handle the full sales cycle to consistently meet and exceed pipeline and revenue objectives.</li>\n<li>Collaborate cross-functionally with Customer Engineering, Product, Legal and Engineering to successfully drive technically unique or complex Enterprise deals forward to completion.</li>\n<li>Deliver customer feedback to our teammates, including our engineers (who are the most customer-driven engineers you'll ever see--they care about making customers happy and closing deals!).</li>\n</ul>\n<p>Within one year, you will…</p>\n<ul>\n<li>Be considered a top-performing Account Executive on the team by consistently exceeding your goals.</li>\n<li>Set an example for new Account Executives, and assist in training, onboarding and motivating new Teammates.</li>\n</ul>\n<h2><span style=\"color: rgb(161, 18, 255);\"><strong>About you&nbsp;</strong></span></h2>\n<p>You are a results-oriented, motivated, and strategic ‘hunter’ who shares<a href=\"https://about.sourcegraph.com/company/values\"> our values</a> and has a passion for all things sales and is laser-focused on generating new greenfield business. Specifically, you will play a pivotal role in helping us achieve our goals by winning high visibility deals and crushing your annual quota.&nbsp;&nbsp;</p>\n<p>You have a desire to mentor other AEs and advance your career into a sales leadership role as we grow our team in the EMEA market.&nbsp; You are a self-starter and thrive in an independent environment.&nbsp; You possess internal motivations to be the best at what you do and perform at the top of the leaderboard.</p>\n<p>Your skill-set:</p>\n<ul>\n<li>5+ years of enterprise technical sales experience, SaaS preferred</li>\n<li>Proven track record of exceeding sales quotas, while leading with empathy</li>\n<li>Experience selling products with ASP &gt;= $100k</li>\n<li>Stellar interpersonal, presentation, verbal, and written communication skills, across all levels and personas (be it with a developer, a CTO, another salesperson, or anyone in-between)</li>\n<li>Passionate about our mission and the potential for developers to improve the world</li>\n</ul>\n<p>Nice to haves:</p>\n<ul>\n<li>Selling developer products and working closely with developers</li>\n<li>Proficiency with software development concepts</li>\n<li>Converting freemium or trial usage to large commercial contracts</li>\n<li>Experience with complex multi-year contracts</li>\n<li>Proficiency with security, licensing, and compliance requirements</li>\n</ul>\n<h2><span style=\"color: rgb(161, 18, 255);\"><strong>Compensation</strong></span></h2>\n<p><strong>💸 We pay you an above-average salary</strong> because we want to hire the best people who are fully focused on helping Sourcegraph succeed, not worried about paying bills. You will have the flexibility to work and live anywhere in the world<em> (unless specified otherwise in the job description)</em>, and we’ll never take your location or current/past salary information into account when determining your compensation.&nbsp; As an <a href=\"https://handbook.sourcegraph.com/company-info-and-process/values/#sts=Open%20and%20transparent\">open and transparent </a>company that values equitable and competitive compensation for everyone, our <a href=\"https://handbook.sourcegraph.com/benefits-pay-perks/pay-expenses/compensation/\">compensation ranges are visible</a> to every single Sourcegraph Teammate. To determine your salary, we use a number of market and data-driven salary sources and target the high-end of the range, ensuring that we’re always paying above market regardless of where you live in the world.&nbsp;&nbsp;</p>\n<p>💰The target compensation for this role is $150,000 USD base + $150,000 USD variable ($300,000 USD on-target-earnings).&nbsp;</p>\n<p>📈 In addition to our cash compensation, we offer equity (because when we succeed as a company, we want you to succeed, too) and generous <a href=\"https://handbook.sourcegraph.com/benefits-pay-perks/benefits-perks/\">perks &amp; benefits</a>.</p>\n<h2><span style=\"color: rgb(161, 18, 255);\"><strong>Interview process</strong></span></h2>\n<p><strong>👋 Introduction Stage</strong> - we have initial conversations to get to know you better…</p>\n<ul>\n<li>[30 min] <a href=\"https://handbook.sourcegraph.com/departments/people-talent/talent/process/types_of_interviews/#recruiter-screen\">Recruiter Screen</a> with Kelsey Nagel</li>\n<li>[30 min] <a href=\"https://handbook.sourcegraph.com/departments/people-talent/talent/process/types_of_interviews/#hiring-manager-screen\">Hiring Manager Screen</a> with Scott Campbell</li>\n</ul>\n<p><strong>🧑‍💻 Team Interview Stage</strong> - we then delve into your experience in more depth and introduce you to members of the team, including cross-functional partners…</p>\n<ul>\n<li>[60 min] <a href=\"https://handbook.sourcegraph.com/departments/people-talent/talent/process/types_of_interviews/#resume-deep-dive\">Resume Deep Dive</a> with Scott Campbell</li>\n<li>[45 min] Peer Interview with an Account Executive &amp; Customer Engineer</li>\n<li>[45 min] Presentation with Scott Campbell, Account Executive &amp; Customer Engineer</li>\n</ul>\n<p><strong>🎉 Final Interview Stage </strong>- we move you to our final round, where you gain a better understanding of our business and values holistically…</p>\n<ul>\n<li>[30 min] <a href=\"https://handbook.sourcegraph.com/departments/people-talent/talent/process/types_of_interviews/#values-interview\">Values Interview</a></li>\n<li>[30 min] <a href=\"https://handbook.sourcegraph.com/departments/people-talent/talent/process/types_of_interviews/#leadership-interview\">Leadership Interview</a> with VP, Sales, Brock Perko</li>\n<li>[30 min] <a href=\"https://handbook.sourcegraph.com/departments/people-talent/talent/process/types_of_interviews/#leadership-interview\">Leadership Interview</a> with co-founder, Quinn Slack&nbsp;</li>\n<li>We check references and conduct your background check</li>\n</ul>\n\n    \n\n    <div class=\"content-conclusion\"><h2><span style=\"color: #a112ff;\">Not sure if this is you?</span></h2>\n<p><span style=\"font-weight: 400;\">We want a diverse, global team, with a broad range of experience and perspectives. If this job sounds great, but you’re not sure if you qualify, apply anyway! We carefully consider every application, and will either move forward with you, find another team that might be a better fit, keep in touch for future opportunities, or thank you for your time.</span></p>\n<h2><span style=\"color: #a112ff;\">Learn more about us</span></h2>\n<p><span style=\"font-weight: 400;\">To create a product that serves the needs of all developers, we are building a diverse </span><a href=\"https://handbook.sourcegraph.com/company-info-and-process/remote\"><span style=\"font-weight: 400;\">all-remote team</span></a><span style=\"font-weight: 400;\"> that is </span><a href=\"https://handbook.sourcegraph.com/team\"><span style=\"font-weight: 400;\">distributed across the world</span></a><span style=\"font-weight: 400;\">. Sourcegraph is an equal opportunity workplace; we welcome people from all backgrounds and communities.&nbsp;</span></p>\n<p><span style=\"font-weight: 400;\">We provide </span><a href=\"https://about.sourcegraph.com/handbook/people-ops/compensation\"><span style=\"font-weight: 400;\">competitive compensation</span></a><span style=\"font-weight: 400;\"> and </span><a href=\"https://about.sourcegraph.com/handbook/people-ops/benefits-and-perks\"><span style=\"font-weight: 400;\">practical benefits</span></a><span style=\"font-weight: 400;\"> to keep you happy and healthy so that you can do your best work.&nbsp;</span><span style=\"font-weight: 400;\">&nbsp;</span></p>\n<p><span style=\"font-weight: 400;\">Learn more about what it is like to work at Sourcegraph by reading </span><a href=\"https://about.sourcegraph.com/handbook/\"><span style=\"font-weight: 400;\">our handbook</span></a><span style=\"font-weight: 400;\">.</span></p>\n<p><span style=\"font-weight: 400;\">We want to ensure Sourcegraph is an environment that suits your working style and empowers you to do your best work, so we are eager to answer any questions that you have about us at any point in the interview process.</span></p>\n<p><span style=\"font-weight: 400;\">Go back to the </span><a href=\"https://about.sourcegraph.com/jobs/\"><span style=\"font-weight: 400;\">careers page</span></a><span style=\"font-weight: 400;\"> for all open positions.</span></p>\n<p>&nbsp;</p>\n<p><em><span style=\"font-weight: 400;\">Sourcegraph participates in <a href=\"https://handbook.sourcegraph.com/departments/people-talent/e-verify/\" target=\"_blank\">E-Verify</a> for U.S. Employees</span></em></p></div>\n","tags":"[\"engineering\",\"legal\"]","pubDate":"2024-02-15 14:14:15.969","link":"https://boards.greenhouse.io/sourcegraph91/jobs/5082727004","savedDate":"2024-02-15 14:14:15.969","slug":"enterprise-account-executive-emea-based-ic4-sourcegraph-8144"},{"id":2016551404,"title":"LEAD RESEARCH TEAM LEADER","company":"Wishpond","image":"https://scontent.fcmb4-2.fna.fbcdn.net/v/t39.30808-6/273499217_5218973671480777_3308731762242867065_n.jpg?_nc_cat=110&ccb=1-7&_nc_sid=efb6e6&_nc_ohc=YDi_Wd17RD8AX9wXcyR&_nc_zt=23&_nc_ht=scontent.fcmb4-2.fna&oh=00_AfB4sOOYpj6VyDSuvvuqhVnZbH22m89SqG99HwaOa-uslw&oe=65BE4336","description":"<div><b style=\"font-size: 18px\">Wishpond Technologies currently has the position of&nbsp;Lead Research Team Leader&nbsp;available, and we’re excited to tell you about it!</b></div><div><span style=\"font-size: 22px\">&nbsp;</span></div><div><b style=\"font-size: 24px\">OVERVIEW</b></div><div><span style=\"font-size: 16px\">We are searching for a Lead Research Team Leader to join our growing team on a full-time basis. This is a fully remote position, and the successful individual could be based anywhere in the world. You will work with an amazing remote team servicing and building relationships with clients based in the US and Canada. As a Lead Research Team Leader, you will oversee the database research, collection, and quality control process. In collaboration with the entire Team, the Lead Research Team Leader is responsible for the success of Wishpond Technologies.</span></div><div><br></div><div><b style=\"font-size: 24px\">RESPONSIBILITIES&nbsp;</b><b style=\"font-size: 22px\">&nbsp;</b></div><div><span style=\"font-size: 16px\">• Optimize and control the database research and lead the collection process.</span></div><div><span style=\"font-size: 16px\">• Supervise a team of internal researchers to meet the company’s standards and targets.</span></div><div><span style=\"font-size: 16px\">• Validate and QC databases on a daily basis.</span></div><div><span style=\"font-size: 16px\">• Administer databases for a variety of industries and brands.</span></div><div><span style=\"font-size: 16px\">• Maintain logs and reports of data collection criteria, processes, and KPIs.</span></div><div><span style=\"font-size: 16px\">• Ensure the data research and collection process is scalable and repeatable.</span></div><div><span style=\"font-size: 16px\">• Process databases for email verification.</span></div><div><span style=\"font-size: 16px\">• Supervise and conduct professional social network research.</span></div><div><span style=\"font-size: 16px\">• Collaborate with and support the SDR and Email Deliverability teams.</span></div><div><span style=\"font-size: 16px\">• Provide daily updates on staff performance and project progress.</span></div><div><span style=\"font-size: 16px\">• Other duties as assigned.</span></div><div><br></div><div><b style=\"font-size: 24px\">QUALIFICATIONS</b></div><div><span style=\"font-size: 16px\">• Minimum of 2 years experience in an administrative or database research role.</span></div><div><span style=\"font-size: 16px\">• Minimum of 2 years experience supervising staff.</span></div><div><span style=\"font-size: 16px\">• Experience with an unstructured and fast-paced startup environment is an asset.</span></div><div><span style=\"font-size: 16px\">• Self-motivated with the ability to establish goals and reach them.</span></div><div><span style=\"font-size: 16px\">• As part of a diverse team, the ability to work both independently and collaboratively.</span></div><div><span style=\"font-size: 16px\">• Must be a problem solver and results-driven.</span></div><div><span style=\"font-size: 16px\">• Must be tech-savvy.</span></div><div><span style=\"font-size: 16px\">• Organized, administratively strong.</span></div><div><span style=\"font-size: 16px\">• Fluent in English (spoken and written).</span></div><div><span style=\"font-size: 16px\">• Willing to participate in ongoing education and training for the role.</span></div><div><span style=\"font-size: 16px\">• Intermediate to advanced Word, PowerPoint and Excel Skills.</span></div><div><br></div><div><b style=\"font-size: 24px\">WORK ENVIRONMENT</b></div><div><span style=\"font-size: 16px\">• It is expected that the successful candidate will provide their own workstation, computer, and headset and have a fast and reliable internet connection.&nbsp;Certain roles will be required to utilize and or download company-approved software.</span></div><div><span style=\"font-size: 16px\">• The individual must be prepared to work standard business hours on EST or PST</span></div><div><span style=\"font-size: 16px\">• Due to the nature of this role, we may verify backgrounds, including conducting employment references, criminal record, and credit checks.</span></div><div><span style=\"font-size: 16px\">• Once hired, the successful candidate must provide a valid government-issued photo ID and proof of residential address as part of their onboarding process.</span></div><div><br></div><div><b style=\"font-size: 24px\">GREAT REASONS TO JOIN OUR TEAM!</b></div><div><span style=\"font-size: 16px\">• Fully remote position allowing you to </span><b style=\"font-size: 16px\">work from your home anywhere in the world!</b></div><div><span style=\"font-size: 16px\">• Exciting and dynamic environment with a great leadership team&nbsp;</span></div><div><span style=\"font-size: 16px\">• Comprehensive training program and regular performance reviews to facilitate your success</span></div><div><span style=\"font-size: 16px\">• Competitive compensation based on experience and proven abilities</span></div><div><span style=\"font-size: 16px\">• Great referral programs with incentives and bonuses</span></div><div><span style=\"font-size: 16px\">• Unbelievable product discounts when you use our products for your own business</span></div><div><span style=\"font-size: 16px\">• A global workforce of multi-cultural and talented colleagues&nbsp;</span></div><div><span style=\"font-size: 16px\">• A close-knit operation with amazing growth opportunities for your personal development</span></div><div><span style=\"font-size: 16px\">• A high growth SaaS technology company publicly traded on the TSX Venture Exchange</span></div><div><span style=\"font-size: 16px\">• Corporate headquarters in beautiful Vancouver, British Columbia, Canada</span></div><div><span style=\"font-size: 16px\">• Access to our education credits program and so much more !</span></div><div><br></div><div><b style=\"font-size: 24px\">ABOUT US</b></div><div><span style=\"font-size: 16px\">Founded in 2009, Wishpond is a rapidly growing technology company providing digital marketing solutions targeted at small businesses.&nbsp; The cloud-based platform includes landing pages, social promotions, website pop-ups, online forms, and lead activity tracking. Wishpond has a dedicated team of professional project managers, designers, copywriters, and developers who provide marketing services tailored to our individual clients.</span></div><div><span style=\"font-size: 16px\">&nbsp;</span></div><div><span style=\"font-size: 16px\">Wishpond serves over 3,000 customers in various industries and sizes, from startups to large Fortune 500 companies. Wishpond has a rapidly growing global headcount and continues to hire dedicated and qualified employees and contractors who have what it takes to scale a successful software company.</span></div><div><br></div><div><span style=\"font-size: 16px\">To learn more about Wishpond Technologies, please visit our website or any of our social media platforms:</span></div><div><br></div><div><span style=\"font-size: 16px\">• Website: </span><a href=\"http://www.wishpond.com/\" style=\"font-size: 16px\" class=\"postings-link\">www.wishpond.com</a></div><div><span style=\"font-size: 16px\">• Instagram: @wishpondofficial</span></div><div><span style=\"font-size: 16px\">• Twitter: Wishpond</span></div><div><span style=\"font-size: 16px\">• Youtube: Thewishpond</span></div><div><span style=\"font-size: 16px\">• LinkedIn: Wishpond</span></div><div><br></div><div><b style=\"font-size: 24px\">APPLICATION PROCESS</b></div><div><b>If you are interested in applying for this exciting opportunity, please provide an updated resume in English (PDF or Word formats only), quoting the position title in the subject line of your cover letter.</b></div><div>&nbsp;<b>&nbsp;</b></div><div>Wishpond Technologies is an equal-opportunity employer committed to hiring a diverse workforce and sustaining an inclusive culture that does not discriminate on the basis of disability, status, or any other basis protected under legislation</div><div>&nbsp;</div><div>We thank all applicants in advance for their interest in this position; however, due to the volume of applications we receive, we are unable to respond to phone, email, or agency inquiries.</div>","tags":"[\"database\"]","pubDate":"2024-02-14 16:05:30.674","link":"https://jobs.lever.co/wishpond/49ab7195-597e-4812-a496-3c2d39cccc2d","savedDate":"2024-02-15 14:14:15.974","slug":"lead-research-team-leader-wishpond-162"},{"id":5785277645,"title":"QA Specialist (Console)","company":"Crytek","image":"https://lever-client-logos.s3-us-west-2.amazonaws.com/2a61cdfd-29d3-4707-b965-c4527aa67d0c-1593500521772.png","description":"<div>We are looking for a <i>passionate</i>&nbsp;and <i>seasoned</i>&nbsp;Hunt <b>console</b>&nbsp;player <b>QA Specialist </b>to join theHunt: Showdown QA Team <b>on-site</b>&nbsp;in our Frankfurt studio. In this position you will work closely with the developers (e.g. game designers, coders, level designers, artists and so on) helping and aiding our development team to maintain and optimize the quality of our games.</div><div>&nbsp;</div><div>This role is based on site in our headquarters in Frankfurt, Germany. You will have the chance to work alongside our world class team that features some of the best developers in the industry and take advantage of our attractive relocation package.</div><div>&nbsp;</div><div><b>*Please submit a Cover Letter along with your CV to give us insight as to why you would like to work in the Hunt: Showdown QA team.*</b></div><h3>Responsibilities </h3><li>Carry out specific and exploratory testing tasks related to current and new content, systems and designs.</li><li>Communicate and report functional and design issues clearly.</li><li>Support and work with the development and design team.</li>,<h3>Requirements</h3><li>You’re a seasoned player of Hunt: Showdown on console (Xbox or Playstation)</li><li>You’ve a passion for the exploration of game designs and mechanics.&nbsp;</li><li>You’ve strong communication skills and can collaborate with stakeholders on level-, system-, feature designs and design verification.</li><li>You’ve the ability to work both independently and in a team environment either.</li><li>Passion for games and quality standards.</li><li>Proficient in written and spoken English language.</li>,<h3>Pluses</h3><li>You have CRYENGINE experience.</li><li>You have knowledge of game-, level- and/or system design.</li><div><u><b>What you can expect from us</b></u></div><div><b>Career Path&nbsp;</b></div><div>Your professional development is important to us, so we have laid out a career plan to help you progress towards your goals and objectives.&nbsp;</div><div><b>Company Apartment&nbsp;</b></div><div>To help you get settled, we provide you with a fully furnished company apartment during your first three months in Frankfurt.*&nbsp;</div><div>&nbsp;</div><div><b>Relocation&nbsp;Support&nbsp;</b></div><div>We offer a relocation budget and full coverage of flights to Frankfurt for you and your family.&nbsp;</div><div>You can expect extensive assistance with visa, work permits, and communication with authorities during the relocation process, as well as help settling into Germany (e.g. setting up appointments with banks, government agencies, schools, landlords, finding apartments etc.).*&nbsp;</div><div><b>&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;</b></div><div><b>Public Transport Pass&nbsp;</b></div><div>Discover Frankfurt by bus, tram and metro – free of charge.*&nbsp;</div><div>&nbsp;</div><div><b>Gym Card&nbsp;</b></div><div>A healthy body is a healthy mind. We offer a membership at the premium gym chain Fitness First in Germany. Work out, join group fitness classes, or relax in the wellness facilities.</div><div>&nbsp;</div><div><b>International Environment&nbsp;</b></div><div>We truly embody diversity at Crytek. With employees from over 42 different countries, we define ourselves by our cultural diversity.&nbsp;</div><div><br></div><div><b>German Classes&nbsp;</b></div><div>Understanding the local culture will make your stay abroad more enjoyable, and Crytek supports that by offering German language courses for you and your family.&nbsp;</div><div>&nbsp;&nbsp;</div><div><b>Events</b></div><div>Join us on our exciting company events, including new starter breakfasts, summer and winter parties, our annual trip to Gamescom in Cologne, and many more!*&nbsp;</div><div>We are all gamers: stay connected and play games with your colleagues at our remote gaming parties.</div><div>&nbsp;</div><div><b>Vacation Days&nbsp;</b></div><div>At our Frankfurt office you can enjoy 24 days of vacation per year, and every 2 years you get 1 more (up to a maximum of 28 days). You will also have on average 10 public holidays on top of the days you take off. If you are working from another country, local standards apply.</div><div>&nbsp;&nbsp;</div><div>*only applicable to employees in Frankfurt.</div>","tags":"[]","pubDate":"2024-02-14 09:27:14.548","link":"https://jobs.lever.co/crytek/ca042d1c-4836-4194-84fd-9c737ba24e6a","savedDate":"2024-02-15 14:14:15.975","slug":"qa-specialist-console-crytek-5502"},{"id":5598223259,"title":"Senior C Developer for popular open source projects - Work Anywhere/Remote","company":"CloudLinux","image":"https://pbs.twimg.com/profile_images/696718028084482050/ymY3OEPk_400x400.png","description":"<p>We are in search of a highly skilled and passionate C Developer to join our exceptional Extended Lifecycle team at CloudLinux. As a member of this team, you will have a unique opportunity to contribute to major open-source projects such as Apache HTTPD, OpenSSL, and MySQL. Your role will involve the important task of backporting crucial security fixes to ensure the stability of these projects.</p><p>By joining our team of experts, you will have the chance to collaborate with top-notch developers and have a significant impact on the open-source community. For more information about the project and our company, visit our branded websites, <a href=\"https://www.cloudlinux.com\" rel=\"nofollow noreferrer noopener\" class=\"external\">CloudLinux.com</a> and <a href=\"https://www.tuxcare.com\" rel=\"nofollow noreferrer noopener\" class=\"external\">TuxCare.com</a>.</p><p>Come be a part of CloudLinux, where every team member supports each other's success. </p><p><strong>What You Will Do:</strong></p><ul> <li>Collaborate on various open-source projects, including Apache HTTPD, Python, OpenSSL, and more.</li> <li>Backport security and bug fixes from newer upstream versions or develop patches from scratch.</li> <li>Contribute to upstream projects.</li> <li>Create reproducers and tests for vulnerabilities.</li> <li>Automate routine processes such as monitoring CVEs, applying patches, and testing.</li> </ul><h3>Requirements: </h3><p><strong>To be successful you should have;</strong></p><ul> <li>5+ years of professional experience in C programming required</li> <li>Must be proficient in GNU/Linux operating system and shell scripting</li> <li>Strong ability to work with various build systems, including autotools, make, and cmake</li> <li>Prior experience with git-based development processes preferred</li> <li>Knowledge of scripting languages like Python, Perl, or similar will be a valuable asset</li> </ul><p></p><h3>Benefits: </h3><p><strong>What's in it for you?</strong></p><ul> <li>A focus on professional development; </li> <li>Interesting and challenging projects</li> <li>Flexible working hours</li> <li>Paid one month vacation per year and unlimited sick leave</li> <li>Medical insurance reimbursement</li> <li>Co-working and gym/sports reimbursement</li> <li>The opportunity to receive a reward for the most innovative idea that the company can patent</li> </ul><p><em>By applying for this position, you agree with </em><a href=\"https://cloudlinux.com/privacy-policy\" rel=\"nofollow noreferrer noopener\" class=\"external\"><em>Cloudlinux Privacy Policy</em></a><em> and give us your consent to maintain and process your personal data with this respect. Please read our Privacy Policy for more information.</em></p>","tags":"[\"mysql\"]","pubDate":"2024-02-14 00:00:00.000","link":"https://apply.workable.com/cloudlinux-1/j/B5108B5EA3","savedDate":"2024-02-15 14:14:15.973","slug":"senior-c-developer-for-popular-open-source-projects-work-anywhere-remote-cloudlinux-3067"},{"id":8819911675,"title":"Senior QA Automation Engineer","company":"Circle","image":"https://lever-client-logos.s3.us-west-2.amazonaws.com/3b00b20d-12c8-4ed9-ae9e-97d8601567b2-1706111761671.png","description":"<div><b style=\"font-size: 18px\">About Us</b></div><div>Circle is building the world’s leading all-in-one platform for online communities. We make it possible for creators, coaches, educators, and businesses to bring together their audience with engaging discussions, live streams, events, chat, courses, and payments — all in one place, all under their own brand.</div><div><br></div><div>We’re proud to be a fully remote company of around 130 (and growing!) team members from 30+ countries around the world. We strive to find exceptional talent, empower them to do their best work, and in turn, have a meaningful impact in their own lives. We don’t track hours, but we manage for outcomes in an a-synchronous culture.</div><div><br></div><div>Twice a year, we bring the whole company together for incredible company retreats in beautiful places around the world!</div><div><br></div><div><b><span style=\"font-size: 18px\">About the role</span></b></div><div>We are seeking a highly skilled Senior QA Automation Engineer to join our Marketing Hub team as we aim to make Circle the top choice for creator/brand-led communities. You'll be working on features related to member management areas, member invite flows, member sign up/authentication, workflows, marketing/bulk emails and supporting our React Native apps.</div><div>You will be responsible for designing and implementing test automation, executing automated tests, identifying defects, and working with developers to resolve any identified issues.</div><div><span style=\"font-size: 13.3333px\">Cash compensation is a starting point, and we want all of our team members to be able to grow in their roles. In addition to equity, benefits and perks, our cash compensation is subject to an annual review and increase on a once per year basis on the hire date anniversary.</span></div><h3>What you'll be doing</h3><li>Design, develop, and implement web test automation frameworks for our web application using <b>Watir</b>.</li><li>Develop and maintain test documentation including test plans, test cases, and test reports.</li><li>Drive the current test automation frameworks and QA processes, set best practices, and ensure a high level of app stability.</li><li>Execute automated tests and analyze results to identify defects and areas for improvement.</li><li>Stay up-to-date with industry trends and best practices in test automation.</li>,<h3>What you'll need to be sucessful</h3><li>6+ years experience working with web test automation, preferred working with <b>Watir</b>.</li><li>3+ years experience working on <b>Ruby</b> language.</li><li>Experience working on CRM/Marketing tools.</li><li>You have experience building complex test suites and creating manual testing plans for both short-term and long-term projects from scratch.</li><li>You have strong judgment and attention to detail when it comes to architectural, product, design, and process decisions. Your judgment inspires a high level of trust within the team.</li><li>You have a desire to work in an environment that values speed of iteration and individual autonomy.</li>,<h3>Bonus points</h3><li>You have mobile test automation experience using <b>WebDriver + Appium</b> in any programming language.</li><li>Write clean <b>Javascript</b> code and <b>Typescript</b>.</li><li>Experience collaborating with cross-functional teams to ensure that mobile applications meet quality standards.</li><li>Experience at a fast-growing start-up.</li><div><b style=\"font-size: 18px\">The fun stuff</b></div><div><b>Fully remote:</b>&nbsp;work from anywhere in the world!</div><div><b>Autonomy and trust to do your job:</b>&nbsp;we care about outcomes over everything else.</div><div><b>Paid time away:</b>&nbsp;all employees are given 35 days of PTO annually.</div><div><b>Generous U.S. benchmarked compensation</b>&nbsp;and startup equity no matter where you are in the world.*</div><div><b>Awesome medical coverage</b>&nbsp;with 100% coverage for you and your family, or medical reimbursement options where applicable!*</div><div><b>Home office stipend</b>&nbsp;to help you get up and running.</div><div><b>Learning &amp; development stipend</b>&nbsp;to help you level up your professional skills.</div><div><b>Annual bonus potential</b>&nbsp;for roles that don't already receive variable income or commission.</div><div><b>Company retreats:</b>&nbsp;Twice a year, the Circle team gets together for a fully paid company retreat in incredible places around the world! We’ve had past retreats in Colombia, Portugal, and Mexico, with more planned on the horizon.</div><div><b>Check out our&nbsp;<a href=\"https://careers.circle.so/\">Careers</a>&nbsp;page for more.</b></div><div><span style=\"font-size: 10px\">*</span><i style=\"font-size: 10px\">Your role, location and unique circumstance may affect this.</i></div><div><br></div><div><b>Diversity, Equity &amp; Inclusion</b></div><div>As a fully-remote international company, diversity is baked into our DNA. Here’s how our CEO, Sid Yadav, frames our hiring mission: “let’s find talent in underserved and under-represented corners of the world, set them up to do the best work of their lives, and in turn, change their life.” To achieve this hiring mission, we offer competitive&nbsp;<a href=\"http://u.s.-benchmarked/\">U.S.-benchmarked</a>&nbsp;compensation no matter where someone’s located in the world, and we proactively seek candidates who expand representation of backgrounds, cultures and lived experiences in our teams.</div><div><br></div><div><b>Equal Employment Opportunity</b></div><div>Circle is an equal opportunity employer and as such, we do not discriminate on the basis of race, color, religion, sex, sexual orientation, gender identity, national origin, age, disability, or any other characteristic protected by applicable laws.</div><div>If you require any accommodations during the recruitment process, please let us know and we will work with you to meet your needs.</div>","tags":"[\"javascript\",\"typescript\",\"management\",\"aws\"]","pubDate":"2024-02-13 16:19:56.194","link":"https://jobs.lever.co/circleco/04253870-dd71-49e2-b507-68b47fd3b8ad","savedDate":"2024-02-15 14:14:15.975","slug":"senior-qa-automation-engineer-circle-8051"},{"id":2353976700,"title":"Video Editor","company":"Somnio","image":"https://remotive.com/job/1897277/logo","description":"<p><strong>THE ROLE</strong></p>\n<p>We are in search of freelance video editors with a perfect blend of creative prowess and technical skills, showcasing expertise in creative editing, passionate storytelling, and chroma key compositing. In this contract position, you'll be working on a variety of business-to-business videos. The ideal candidate will possess keen attention to detail, the ability to pivot swiftly, maintain a positive attitude, and consistently deliver work of the highest caliber.</p>\n<p>If you're passionate about video editing and ready to elevate your freelance career, Somnio is the place for you. Join us in shaping remarkable digital narratives and making a lasting impact in the world of creative storytelling!</p>\n<p><strong>THE AGENCY<br></strong></p>\n<p>Somnio is a leading creative agency specializing in digital marketing and design. We work with a diverse range of clients, including tech leaders, Fortune 500 companies, and startups, to deliver cutting-edge solutions that captivate audiences and drive results. As a freelance Visual/UI Designer at Somnio, you'll have the opportunity to collaborate with our talented team, work on exciting projects, and contribute to the success of our clients' brands.</p>\n<div class=\"h3\"><strong>REQUIREMENTS AND SKILLS </strong></div>\n<ul style=\"\">\n<li style=\"\">At least 4 years of professional experience as video editor on <strong>corporate videos, commercials, and/or brand videos</strong>.</li>\n<li style=\"\">Proficient with Adobe Creative Cloud applications (Premiere, After Effects, Photoshop).</li>\n<li style=\"\">Solid experience with chroma key compositing in After Effects.</li>\n<li style=\"\">Strong time management and problem-solving skills, with the ability to adapt quickly.</li>\n<li style=\"\">Technical knowledge of editing systems, sound design, color correction, and encoding.</li>\n<li style=\"\">Strong organizational skills with attention to project and file hierarchy.  </li>\n</ul>\n<div class=\"h3\"><strong>RESPONSIBILITIES AND AREAS OF WORK</strong></div>\n<ul style=\"\">\n<li style=\"\">Have strong communication skills and a level mindset both in production capabilities as well as team interaction.</li>\n<li style=\"\">Understand brand guidelines and work within the constraints provided.</li>\n</ul>\n<div class=\"h3\"><strong>PREFERRED QUALIFICATIONS</strong></div>\n<ul style=\"\">\n<li style=\"\">Knowledge and understanding of Adobe Audition.</li>\n<li style=\"\">Proficient with both Mac and PC operating systems.</li>\n<li style=\"\">Ability to be on-site as needed for editing sessions and creative strategy meetings.</li>\n</ul>\n<p><strong>Contract Specifications</strong></p>\n<ul style=\"\">\n<li style=\"\">100% remote</li>\n<li style=\"\">Payment for freelance services is provided in USD.</li>\n<li style=\"\">Hours may vary, but we need someone who is available to work during CDT hours from Monday to Friday.</li>\n<li style=\"\">Your application expresses interest in joining our freelance team. While immediate contact may not occur, we are actively reviewing applications in preparation for upcoming projects. We value your unique skills and appreciate your patience. We look forward to potential collaboration soon!</li>\n</ul>\n<p> </p>\n<img src=\"https://remotive.com/job/track/1897277/blank.gif?source=public_api\" alt=\"\"/>","tags":"[\"adobe creative cloud\",\"video editing\",\"Adobe After Effects\"]","pubDate":"2024-02-12 21:20:30.000","link":"https://remotive.com/remote-jobs/design/video-editor-1897277","savedDate":"2024-02-15 14:14:15.967","slug":"video-editor-somnio-5594"},{"id":1625314238,"title":"Manager, Customer Success","company":"Bio Render","image":"https://lever-client-logos.s3-us-west-2.amazonaws.com/0f4b434e-502f-4390-9819-c058d43028c1-1595260531860.png","description":"<div>At BioRender, our mission is to accelerate the world’s ability to learn, discover and communicate science. We are passionate about democratizing science communication in order to accelerate scientific discovery and understanding. We're looking for amazing people to help create the world’s go-to-place and platform where science is communicated. Come join us!</div><div><br></div><div><span style=\"font-size: 11pt\">We are hiring a Manager, CSM, to join our young, fast-growing company (rewarded by Great Place to Work and the Globe and Mail) on our mission to help scientists create and share beautiful, professional scientific figures.&nbsp;</span></div><div><br></div><div><span style=\"font-size: 11pt\">As the Manager, CSM, you will lead a team of Mid-Market Customer Success Managers. This role will coach the team to achieve customer and business outcomes, work directly with customers on high-priority interactions, collaborate and execute on customer retention and growth strategies, and work closely with the Customer Success Leadership team on continuous and operational improvement.</span></div><h3>Our ideal fit:</h3><li><b>Leadership</b>: Strong ability to motivate, guide, and support a team of customer success managers fostering a positive work environment and driving individual and team performance - including onboarding, adoption, renewal, and upsell.&nbsp;</li><li><b>Analytical skills</b>: Proficient in using data to identify trends, opportunities, and areas for improvement in customer success operations, ensuring data-driven decision-making and process optimizations.</li><li><b>Project management</b>: Skilled in planning and executing customer success initiatives and projects, balancing the team's and customers' needs while ensuring timely and efficient delivery of desired outcomes.</li><li><b>Collaboration and stakeholder management</b>: Adept at working closely with cross-functional partners, including sales, product, and support teams, to drive customer success and satisfaction.</li><li><b>Communication skills</b>: Exceptional verbal and written communication abilities, enabling clear and concise communication of information to customers, team members, and other stakeholders.</li><li><b>Empathy and active listening</b>: Understanding and anticipating customer needs, showing genuine concern for their challenges, and taking proactive steps to address their concerns.</li><li><b>Adaptability</b>: Comfortable in a dynamic and fast-paced environment, demonstrating resilience and flexibility in adapting to change and leading the team through periods of growth or uncertainty. Build critical team functions while executing against quarterly targets.</li><li><b>Customer-centric mindset</b>: Possess a deep understanding of customer needs and expectations, constantly striving to deliver exceptional customer experiences and exceed customer expectations.</li>,<h3>What you’ll be doing:</h3><li>Contribute critical leadership guidance and accountability to the CSM team on goal achievement within the first quarter.&nbsp;</li><li>Contribute to critical Customer Success transformation objectives within 3 months, including the hiring process for CSMs.</li><li>Learn the critical use cases for key stakeholder personas.</li><li>Work collaboratively with the Sales team on joint account strategies within 3 months.</li><li>Engaged in complex commercial negotiations and solutioning within 3 months.</li><li>Lead a team that achieves retention, upsell, &amp; CSQL targets within 6 months.</li><li>Scale the team by interviewing and hiring CSM candidates and incorporating process improvements and technology-driven engagement within 9 months.&nbsp; </li>,<h3>What you bring to the table:</h3><li>3+ years of experience leading and managing high-performing customer success teams in a fast-paced, growth-oriented Saas organization.</li><li>Demonstrated success in implementing process improvements, new strategies, and systems that have resulted in increased customer retention and satisfaction.</li><li>Experience owning renewals and subscription-based upsell processes and outcomes.</li>,<h3>Why Join Us?</h3><li>We are mission-driven, and work collaboratively towards our shared vision of improving scientific communication and accelerating scientific discovery: BioRender figures have appeared in more than 16,000 publications! </li><li>It’s a product that users love! We have a world-class NPS and a community of loyal fans. Check out our Testimonials page to see what our customers are saying about us: <a href=\"https://biorender.com/testimonials/\" class=\"postings-link\">https://biorender.com/testimonials/</a>&nbsp;</li><li>We are profitable, funded solely by user growth, and growing more than 200% YoY with users in 200+ countries. </li><li>We're proud that half of our team members are women (including those in leadership positions), and 65% of our team are BIPOC! BioRender is an equal opportunity employer, and an inclusive hiring process and work environment is a part of our DNA </li><li>We’re remote-first and have team members across Canada and the United States. A physical office in Toronto is available, but you have the flexibility to work from anywhere.</li><li>We’re backed by top investors, accelerators, and some of the most successful life science entrepreneurs and philanthropists in the world including Y Combinator, Malala Fund founders, and Fifty Years VC. </li><li>We are committed to building a warm, inclusive, and diverse environment. Check out how we make sure our <a href=\"https://biorender.com/careers/\" class=\"postings-link\">employees come first</a>.</li><div>You can read more about the <a href=\"https://biorender.notion.site/BioRender-Candidate-Resources-8255c155797f442a950720a33b4764d5\" class=\"postings-link\">BioRender interview process and FAQs here</a>!</div>","tags":"[\"management\"]","pubDate":"2024-01-24 19:21:29.966","link":"https://jobs.lever.co/biorender/b810a98b-424a-4e85-8d3b-20d6113bf1b1","savedDate":"2024-02-15 14:14:15.975","slug":"manager-customer-success-bio-render-5635"}]