[{"id":5818384709,"title":"Senior Software Engineer - DevExp","company":"Clutch","image":"https://avatars.githubusercontent.com/u/69215121?s=200&v=4","description":"<h1><strong>About the Role</strong></h1><p style=\"min-height:1.5em\">As a <strong>Full Stack Software Engineer</strong> on the <strong>Engineering Platform</strong> team, you will play a key role in shaping and enhancing the internal development ecosystem. Your work will focus on creating scalable, robust, and reusable platform components that streamline engineering workflows and empower teams to ship high-quality software faster.</p><p style=\"min-height:1.5em\">You will collaborate closely with engineers across the organization to identify pain points in the development lifecycle and design solutions that improve efficiency, reliability, and consistency. Whether it’s building internal tooling, refining CI/CD pipelines, or enabling seamless frontend/backend integration, your contributions will help define and elevate the overall developer experience.</p><p style=\"min-height:1.5em\"></p><h1><strong>About the Team</strong></h1><p style=\"min-height:1.5em\">The Engineering Platform team creates and maintains the essential tools, components and platforms that boost engineering efficiency. We focus on creating reusable solutions that will support the teams to build high-quality, secure and reliable products for Clutch’s clients.</p><p style=\"min-height:1.5em\"></p><h1><strong>What You’ll Do</strong></h1><ul style=\"min-height:1.5em\"><li><p style=\"min-height:1.5em\">Design and implement full-stack solutions (frontend and backend) that improve developer productivity and platform reliability.</p></li><li><p style=\"min-height:1.5em\">Build internal tools, libraries, and infrastructure that are scalable, maintainable, and easy to adopt.</p></li><li><p style=\"min-height:1.5em\">Drive improvements in development workflows, CI/CD pipelines, testing infrastructure, and code quality practices.</p></li><li><p style=\"min-height:1.5em\">Partner with product teams, engineering leads, and other stakeholders to gather feedback and iterate quickly on solutions.</p></li><li><p style=\"min-height:1.5em\">Champion engineering best practices, with a focus on performance, security, and maintainability.</p></li><li><p style=\"min-height:1.5em\">As a true teammate, continuously improve the team’s processes, brainstorm ideas, and communicate statuses, and progress</p></li><li><p style=\"min-height:1.5em\">Mentor team members, provide feedback, and continuously improve as a professional</p></li></ul><p style=\"min-height:1.5em\"></p><h1><strong>What You’ll Bring</strong></h1><ul style=\"min-height:1.5em\"><li><p style=\"min-height:1.5em\">Strong problem-solving skills and the ability to write clean, maintainable code.</p></li><li><p style=\"min-height:1.5em\">Strong proficiency in <strong>modern frontend frameworks (e.g., React)</strong> and <strong>backend technologies (e.g., Node.js, Python)</strong>, and AWS.</p></li><li><p style=\"min-height:1.5em\">Experience working on CI/CD pipelines, testing best practices and developing automation solutions to help streamline processes</p></li><li><p style=\"min-height:1.5em\"><strong>Outcome-driven mindset</strong> with a focus on understanding context and business needs to deliver impactful solutions.</p></li><li><p style=\"min-height:1.5em\">Ability to work cross-functionally, communicate effectively, and deliver solutions with measurable impact.</p></li><li><p style=\"min-height:1.5em\">A systems-thinking mindset with a passion for improving how engineers work.</p></li></ul><p style=\"min-height:1.5em\"><em>Please note that this role may evolve as our business needs change, so we appreciate your flexibility and adaptability.</em></p><p style=\"min-height:1.5em\"><strong>What’s In It For You?</strong></p><ul style=\"min-height:1.5em\"><li><p style=\"min-height:1.5em\"><strong>Remote Flexibility:</strong> Enjoy the freedom of remote work from anywhere, balancing life and career seamlessly.</p></li><li><p style=\"min-height:1.5em\"><strong>Unforgettable Off-Sites:</strong> Twice a year, bond with colleagues in exciting destinations, fostering teamwork and fresh ideas.</p></li><li><p style=\"min-height:1.5em\"><strong>Paid Time Off and National Holidays:</strong> Enjoy 20 PTO days yearly and the National Holidays for relaxation and rejuvenation.</p></li><li><p style=\"min-height:1.5em\"><strong>Stock Options:</strong> Joining us means having a stake in our success, so you'll receive stock options as part of your compensation package.</p></li><li><p style=\"min-height:1.5em\"><strong>Home Office Setup:</strong> Create your ideal workspace with a dedicated budget for home office essentials.</p></li><li><p style=\"min-height:1.5em\"><strong>Work Trip Budget:</strong> Grow personally and professionally with a budget for work-related trips and co-working.</p></li></ul><p style=\"min-height:1.5em\"><strong>About Us</strong></p><p style=\"min-height:1.5em\"><strong>Clutch</strong> is a revolutionary vertical SaaS company, proudly backed by Andreessen Horowitz (A16z), aimed at revolutionizing the way Credit Unions engage and change the lives of their members. As a champion of financial well-being, we address the urgent need for affordable lending solutions in an era where the average American grapples with over $155,000 in household debt.  Unlike traditional financial institutions, Clutch develops software to turn Credit Unions into FinTech lenders and leverage their balance sheets to responsibly lend to over 130M Americans. Our mission extends beyond mere financial transactions; we strive to fundamentally enhance the way credit unions interact with their members. By integrating cutting-edge technologies and user-centric designs, we help credit unions provide seamless digital experiences that are on par with leading tech companies. This approach not only preserves but revitalizes the longstanding tradition of community and member-focused service inherent to credit unions.</p><p style=\"min-height:1.5em\"><strong>Please note:</strong> This position is offered on a contractor basis. Applicants must have the necessary documentation and authorization to work in the country where the job is located. Clutch cannot provide sponsorship or assist with obtaining work permits for this role.<br /><br /><strong>A Note About AI at Clutch</strong><br />We love AI. We use it often and encourage our team to creatively and effectively leverage AI tools in their work. If you join Clutch, we hope you'll bring the same enthusiasm for exploring how AI can amplify impact, productivity, and innovation.<br /><br />That said, during the interview process, <strong>we want to hear </strong><em><strong>your</strong></em><strong> thoughts</strong>. Please approach interviews without the use of AI tools—our goal is to get to know how <em>you</em> think, solve problems, and communicate. Once you're in the seat, bring on the prompts!</p>","tags":"[\"aws\",\"node.js\",\"python\",\"scala\",\"react\"]","pubDate":"2025-05-19T20:43:03.833Z","link":"https://jobs.ashbyhq.com/withclutch/1a4e4b8a-5f6a-4e44-97b1-e1f1e57a5256","slug":"senior-software-engineer-devexp-clutch-1458"},{"id":8636848303,"title":"Performance Marketing Associate","company":"Circle","image":"https://circle.so/apple-icon.png","description":"&lt;div class=&quot;content-intro&quot;&gt;&lt;h2&gt;About Us&lt;/h2&gt;\n&lt;p&gt;Circle is building the world’s leading all-in-one platform for online communities. We make it possible for creators, coaches, educators, and businesses to bring together their audience with engaging discussions, live streams, events, chat, courses, and payments — all in one place, all under their own brand.&lt;/p&gt;\n&lt;p&gt;We’re proud to be a fully remote company of around 180 (and growing!) team members from 30+ countries around the world. We seek exceptional individuals around the world, set them up to do the best work of their lives, and in turn, create a meaningful impact in their own lives. We don&#39;t track hours, but we do manage for high expectations very closely. We collaborate across time zones, are highly async, and like to document a lot.&lt;/p&gt;\n&lt;p&gt;Twice a year, we bring the whole company together in beautiful places around the world for our company offsites. So far, we’ve hosted offsites in Turkey, Portugal, Mexico, Thailand, Colombia, Italy, Ireland, and more, with still more to come!&lt;/p&gt;&lt;/div&gt;&lt;h2&gt;About the role&lt;/h2&gt;\n&lt;p&gt;Every week, thousands of people discover and engage with Circle across various platforms. As the Performance Marketing Associate, you&#39;ll play a key role in accelerating that growth by managing and optimizing paid media campaigns that drive acquisition and retention.&lt;/p&gt;\n&lt;p&gt;You’ll work closely with marketing, design, and analytics teams to build, launch, and iterate on performance campaigns across Google, Meta, LinkedIn, Reddit, and other emerging channels. This role is perfect for someone who’s analytical, detail-obsessed, and passionate about performance marketing.&lt;/p&gt;\n&lt;h2&gt;What you&#39;ll be doing&lt;/h2&gt;\n&lt;ul&gt;\n&lt;li&gt;Launch, manage, and optimize paid media campaigns across Google Ads, Meta Ads, LinkedIn, Reddit, and other digital channels.&lt;/li&gt;\n&lt;li&gt;Run structured experiments across ad copy, creative, and landing pages to improve conversion rates and uncover what resonates with target audiences.&lt;/li&gt;\n&lt;li&gt;Implement and manage tracking via GTM and GA, ensuring accurate attribution and alignment with HubSpot and lifecycle goals in partnership with RevOps.&lt;/li&gt;\n&lt;li&gt;Analyze and report on campaign performance regularly, identifying insights and opportunities for continuous improvement.&lt;/li&gt;\n&lt;li&gt;Collaborate with the creative and content teams to help develop high-performing ad creative, landing pages, and testing strategies.&lt;/li&gt;\n&lt;li&gt;Stay up to date with platform changes, trends, and best practices across PPC advertising and bring new opportunities to the table.&lt;/li&gt;\n&lt;/ul&gt;\n&lt;h2&gt;What you&#39;ll need to be successful&lt;/h2&gt;\n&lt;p&gt;&amp;nbsp;&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;Strong alignment with our values, &lt;a href=&quot;https://circle.so/careers&quot;&gt;find our values on our career page&lt;/a&gt; if you haven’t read up on them yet.&lt;/li&gt;\n&lt;li&gt;You are proficient in English (spoken, written, and reading) at a &lt;a href=&quot;https://magoosh.com/english-speaking/english-proficiency-levels-a-guide-to-determining-your-level/&quot;&gt;CEFR Level C2&lt;/a&gt; / &lt;a href=&quot;https://www.govtilr.org/&quot;&gt;ILR Level 5&lt;/a&gt;.&lt;/li&gt;\n&lt;li&gt;&lt;strong&gt;1–3 years of experience&lt;/strong&gt; managing and optimizing paid campaigns on Google Ads and Meta Ads.&lt;/li&gt;\n&lt;li&gt;Background in SaaS or other digital subscription-based models.&lt;/li&gt;\n&lt;li&gt;&lt;strong&gt;Attention to detail&lt;/strong&gt; — you notice the small stuff that can make a big difference in ad copy, targeting, or tracking setup.&lt;/li&gt;\n&lt;li&gt;&lt;strong&gt;Strong analytical skills&lt;/strong&gt; — you&#39;re confident using tools like Google Sheets for campaign analysis, budget pacing, and reporting.&lt;/li&gt;\n&lt;li&gt;&lt;strong&gt;Critical thinker&lt;/strong&gt; — you approach problems with curiosity and structured thinking, always seeking to understand the &quot;why.&quot;&lt;/li&gt;\n&lt;li&gt;&lt;strong&gt;Excellent communicator&lt;/strong&gt; — you can clearly articulate performance insights, campaign strategies, and testing ideas both verbally and in writing.&lt;/li&gt;\n&lt;li&gt;&lt;strong&gt;Performance marketing enthusiasm&lt;/strong&gt; — you’re genuinely passionate about performance marketing and keep up with the evolving ad landscape.&lt;/li&gt;\n&lt;li&gt;&lt;strong&gt;Adaptability&lt;/strong&gt; — you&#39;re excited by change and thrive in a fast-paced, test-and-learn environment.&lt;/li&gt;\n&lt;/ul&gt;\n&lt;h2&gt;Bonus points&lt;/h2&gt;\n&lt;ul&gt;\n&lt;li&gt;Experience with additional ad platforms (e.g., TikTok Ads, Bing Ads, programmatic display).&lt;/li&gt;\n&lt;li&gt;Familiarity with HubSpot for campaign tracking and attribution.&lt;/li&gt;\n&lt;/ul&gt;\n&lt;h2&gt;$70,000 - $80,000 USD per year&lt;/h2&gt;\n&lt;p&gt;&lt;em&gt;The cash compensation range shown is a starting point. In addition to equity, benefits and perks, your cash compensation is subject to an annual review and increase on a once per year basis.&lt;/em&gt;&lt;/p&gt;\n&lt;p&gt;&amp;nbsp;&lt;/p&gt;&lt;div class=&quot;content-conclusion&quot;&gt;&lt;h2&gt;The fun stuff&lt;/h2&gt;\n&lt;ul&gt;\n&lt;li&gt;Fully remote:&amp;nbsp;work from anywhere in the world!&lt;/li&gt;\n&lt;li&gt;Autonomy and trust to do your job:&amp;nbsp;we care about outcomes over everything else.&lt;/li&gt;\n&lt;li&gt;Paid time away:&amp;nbsp;all employees are given 35 days of PTO annually. We also offer a paid sabbatical after 5 years.&lt;/li&gt;\n&lt;li&gt;Generous U.S. benchmarked compensation&amp;nbsp;and startup equity no matter where you are in the world.*&lt;/li&gt;\n&lt;li&gt;Awesome medical coverage&amp;nbsp;with 100% coverage for you and your family, or medical reimbursement options where applicable!*&lt;/li&gt;\n&lt;li&gt;Parental leave&amp;nbsp;for parents expanding their family, or just starting one.&lt;/li&gt;\n&lt;li&gt;Home office stipend&amp;nbsp;to help you get up and running.&lt;/li&gt;\n&lt;li&gt;Learning &amp;amp; development stipend&amp;nbsp;to help you level up your professional skills.&lt;/li&gt;\n&lt;li&gt;Annual bonus potential&amp;nbsp;for roles that don&#39;t already receive variable income or commission.&lt;/li&gt;\n&lt;li&gt;Company retreats:&amp;nbsp;Twice a year, the Circle team gets together for a fully paid company retreat in incredible places around the world! We’ve had past retreats in Colombia, Portugal, and Mexico, with more planned on the horizon.&lt;/li&gt;\n&lt;li&gt;Check out our&amp;nbsp;&lt;a href=&quot;https://careers.circle.so/&quot;&gt;Careers&lt;/a&gt;&amp;nbsp;page for more.&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;&lt;span style=&quot;font-size: 10pt;&quot;&gt;*&lt;em&gt;Your role, location and unique circumstance may affect this.&lt;/em&gt;&lt;/span&gt;&lt;/p&gt;\n&lt;h3&gt;Diversity, Equity &amp;amp; Inclusion&lt;/h3&gt;\n&lt;p&gt;As a fully-remote international company, diversity is baked into our DNA. Here’s how our CEO, Sid Yadav, frames our hiring mission: “let’s find talent in underserved and under-represented corners of the world, set them up to do the best work of their lives, and in turn, change their life.” To achieve this hiring mission, we offer competitive&amp;nbsp;U.S. benchmarked&amp;nbsp;compensation no matter where someone’s located in the world, and we proactively seek candidates who expand representation of backgrounds, cultures and lived experiences in our teams.&lt;/p&gt;\n&lt;h3&gt;Equal Employment Opportunity&lt;/h3&gt;\n&lt;p&gt;Circle is an equal opportunity employer and as such, we do not discriminate on the basis of race, color, religion, sex, sexual orientation, gender identity, national origin, age, disability, or any other characteristic protected by applicable laws.&amp;nbsp;If you require any accommodations during the recruitment process, please let us know and we will work with you to meet your needs.&lt;/p&gt;\n&lt;div class=&quot;&quot;&gt;\n&lt;h3 class=&quot;&quot;&gt;How We Use Candidate Data&lt;/h3&gt;\n&lt;p&gt;At Circle, we are committed to protecting your personal information. As a job applicant, the personal data you provide to us is collected and processed in accordance with the&amp;nbsp;&lt;strong&gt;General Data Protection Regulation (GDPR)&lt;/strong&gt; in the EU and the &lt;strong&gt;California Consumer Privacy Act (CCPA)&lt;/strong&gt;. This notice outlines the types of personal information we collect, the purpose for collecting it, and your rights.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Information We Collect:&lt;/strong&gt; We collect the following categories of personal information from job applicants:&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;Contact information (such as name, email address, phone number)&lt;/li&gt;\n&lt;li&gt;Employment history and qualifications&lt;/li&gt;\n&lt;li&gt;Education history&lt;/li&gt;\n&lt;li&gt;References and any other information you choose to share with us during the application process&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;&lt;strong&gt;Purpose of Collection:&lt;/strong&gt; We collect this information for the following purposes:&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;To assess your qualifications and suitability for the position&lt;/li&gt;\n&lt;li&gt;To communicate with you during the recruitment process&lt;/li&gt;\n&lt;li&gt;To comply with legal and regulatory obligations&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;&lt;strong&gt;Your Rights Under GDPR and CCPA:&lt;/strong&gt; You have the following rights regarding your personal information:&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;The right to request access to the personal information we hold about you.&lt;/li&gt;\n&lt;li&gt;The right to request the deletion of your personal information, subject to certain legal exceptions.&lt;/li&gt;\n&lt;li&gt;The right to opt out of the sale of your personal information (Note: We do not sell personal information).&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;For more information about how we handle your personal data or to exercise your rights, please refer to our full &lt;a href=&quot;https://circle.so/privacy&quot; target=&quot;_blank&quot;&gt;Privacy Policy&lt;/a&gt;.&lt;/p&gt;\n&lt;p&gt;By submitting your application, you acknowledge that you have read and understood this privacy notice.&lt;/p&gt;\n&lt;/div&gt;&lt;/div&gt;","tags":"[\"aws\",\"advertising\",\"legal\"]","pubDate":"2025-05-19T17:02:24.000Z","link":"https://job-boards.greenhouse.io/circleso/jobs/4693887008","slug":"performance-marketing-associate-circle-8040"},{"id":4268903245,"title":"Pharmacy Communications Program Manager","company":"Winona","image":"https://yt3.googleusercontent.com/k45HnnNMWgPv-xF3D-u2ThxmesDOeU0p02rNJpbRWLes2Z18WpkLgXEE7XuBLkkzN_38AFnp3A=s160-c-k-c0x00ffffff-no-rj","description":"<p style=\"min-height:1.5em\"><strong>About Winona:</strong></p><p style=\"min-height:1.5em\"><a target=\"_blank\" rel=\"noopener noreferrer nofollow\" href=\"https://bywinona.com/\">Winona</a> is one of the leading telemedicine companies providing HRT for women in menopause. We’ve built all of our technology in house including an EHR, patient care admin system, patient portal, website, marketing technology etc. Winona has two compounding pharmacies and a team of in house physicians providing world-class care via a fully vertically integrated business model.</p><p style=\"min-height:1.5em\"></p><p style=\"min-height:1.5em\"><strong>About the role:</strong></p><p style=\"min-height:1.5em\">We need a single owner who wakes up every day thinking about those threads: Are pharmacists getting what they need? Is our patient support team unblocked? Is every ticket closed on time? As Pharmacy Communications PM, you’ll be the nerve center connecting our company and our partner pharmacies, turning noise into signal and friction into speed.</p><p style=\"min-height:1.5em\"></p><p style=\"min-height:1.5em\"><strong>Seniority Level</strong>: Mid</p><p style=\"min-height:1.5em\"></p><p style=\"min-height:1.5em\"><strong>Responsibilities:</strong></p><p style=\"min-height:1.5em\">• Triage all inbound pharmacy messages, assign owners, set priorities, and enforce SLAs.</p><p style=\"min-height:1.5em\">• Draft and send outbound updates—order statuses, formulary changes, policy reminders—so partners are never guessing.</p><p style=\"min-height:1.5em\">• Maintain real-time visibility: run daily queue health checks, flag risks, and unblock stuck conversations.</p><p style=\"min-height:1.5em\">• Host weekly stand-ups to review open issues and upcoming changes.</p><p style=\"min-height:1.5em\">• Coordinate “voice of pharmacy” feedback loops with Product and Compliance so platform updates land smoothly.</p><p style=\"min-height:1.5em\">• Create and maintain macros, checklists, and SOPs that empower reps to respond accurately and fast.</p><p style=\"min-height:1.5em\">• Train new hires and run quarterly refresh sessions.</p><p style=\"min-height:1.5em\">• Build Looker/Intercom dashboards, surface trends, and propose roadmap items or staffing adjustments.</p><p style=\"min-height:1.5em\">• Lead post-mortems on high-severity incidents; track action items to closure.</p><p style=\"min-height:1.5em\"></p><p style=\"min-height:1.5em\"><strong>Requirements:</strong></p><ul style=\"min-height:1.5em\"><li><p style=\"min-height:1.5em\">4+ years in Customer Service Operations, Program Management, or Partner Success—ideally in pharmacy, tele-health, or another highly regulated setting.</p></li><li><p style=\"min-height:1.5em\">Hands-on ownership of ticket queues or shared inboxes (Intercom, Zendesk, Salesforce, or JIRA) with external partners.</p></li><li><p style=\"min-height:1.5em\">A track record of meeting or beating SLAs while balancing empathy, compliance, and speed.</p></li><li><p style=\"min-height:1.5em\">Polished written &amp; verbal communication—you can translate clinical jargon into crisp, action-oriented updates.</p></li><li><p style=\"min-height:1.5em\">Working knowledge of HIPAA (required) and familiarity with PCI, PIPEDA, or other PHI/PII frameworks (nice-to-have).</p></li><li><p style=\"min-height:1.5em\">Based in the US or Canada with reliable broadband and overlap with Eastern hours.</p></li></ul><p style=\"min-height:1.5em\"></p><p style=\"min-height:1.5em\"><strong>What’s in it for you?</strong></p><p style=\"min-height:1.5em\">As full-time member of our team, you’ll enjoy:</p><ul style=\"min-height:1.5em\"><li><p style=\"min-height:1.5em\">Flexible hours</p></li><li><p style=\"min-height:1.5em\">Work wherever you choose</p></li><li><p style=\"min-height:1.5em\">Fun and casual work environment</p></li><li><p style=\"min-height:1.5em\">Employee engagement activities and virtual gatherings</p></li><li><p style=\"min-height:1.5em\">We are a diverse, global team! 🌍</p><p style=\"min-height:1.5em\"></p></li></ul><p style=\"min-height:1.5em\"><em>This company is affiliated  for recruitment efforts. Each entity maintains operational independence, and no personal data is shared between them except as necessary for coordinated recruitment activities. Both teams are committed to protecting applicant privacy and ensuring a respectful, transparent hiring process.</em></p><p style=\"min-height:1.5em\"><em><strong>Equal Employment Opportunity</strong></em></p><p style=\"min-height:1.5em\"><em>Winona provides equal employment opportunities to all qualified individuals without regard to race, color, religion, sex, gender identity, sexual orientation, pregnancy, age, national origin, physical or mental disability, military or veteran status, genetic information, or any other protected classification. Equal employment opportunity extends to all aspects of employment including, but not limited to, recruitment, hiring, training, promotion, demotion, transfer, leaves of absence, and termination. Winona takes allegations of discrimination, harassment, and retaliation seriously and will promptly investigate such behaviors.</em></p>","tags":"[\"salesforce\"]","pubDate":"2025-05-19T14:27:21.808Z","link":"https://jobs.ashbyhq.com/winona/e9fab302-37c0-4819-ae14-68e24194f0da","slug":"pharmacy-communications-program-manager-winona-8208"},{"id":4653949131,"title":"Vidéastes - Paradox Foundation","company":"Paradox","image":"https://cdn.prod.website-files.com/63ef5a85ffdee87c27e6573a/66e0418f9e22dd4e4cacb077_Black%20symbol%20(1)%20(2).png","description":"<p style=\"min-height:1.5em\">VIDEASTES - <a target=\"_blank\" rel=\"noopener noreferrer nofollow\" href=\"https://www.paradoxfoundation.com\">Paradox Foundation</a></p><p style=\"min-height:1.5em\"> </p><div style=\"text-align:justify\"><img style=\"max-width:100%;width:100%\" src=\"https://app.ashbyhq.com/api/images/user-content/9f216e31-710a-4d14-8a7c-747665aa0e4a/7403fbe7-3830-4477-a600-454e39eee48e/Captura%20de%20pantalla%202025-05-19%20a%20las%2015.10.49.png\" /></div><p style=\"min-height:1.5em\"><strong>📣 ON RECHERCHE DES VIDÉASTES POUR UNE AVENTURE HUMAINE ET CRÉATIVE EXCEPTIONNELLE</strong></p><p style=\"min-height:1.5em\">Tu es vidéaste, créatif·ve, passionné·e par les histoires vraies et le pouvoir de l’image pour inspirer, transmettre et faire bouger les lignes ?</p><p style=\"min-height:1.5em\">Tu as envie de vivre une aventure hors du commun, au cœur de bootcamps immersifs qui transforment la vie de jeunes de 18 à 25 ans ?</p><p style=\"min-height:1.5em\">Alors ce message est pour toi  👊 </p><p style=\"min-height:1.5em\">Clique <a target=\"_blank\" rel=\"noopener noreferrer nofollow\" href=\"https://www.youtube.com/watch?v=5boBnawMzb0\">ICI</a> pour visionner l’After Movie de l’été 2024 ↙️</p><div style=\"text-align:left\"><img style=\"max-width:100%\" src=\"https://app.ashbyhq.com/api/images/user-content/9f216e31-710a-4d14-8a7c-747665aa0e4a/e580fde7-2e28-465d-8f73-9ed3e7709f85/image.png\" /></div><p style=\"min-height:1.5em\"></p><h2>CE QU’ON TE PROPOSE </h2><p style=\"min-height:1.5em\">-------------------------------</p><p style=\"min-height:1.5em\">Une opportunité unique de rejoindre la Paradox Foundation cet été, en tant que vidéaste terrain, pour documenter l’un de nos 3 bootcamps transformationnels, et co-créer des contenus puissants pour raconter ce qu’on vit de l’intérieur.</p><p style=\"min-height:1.5em\"></p><p style=\"min-height:1.5em\"></p><h2>TA MISSION 🚀 </h2><p style=\"min-height:1.5em\">-------------------------------</p><ol style=\"min-height:1.5em\"><li><p style=\"min-height:1.5em\">Filmer les moments forts des bootcamps (coaching, ateliers, cercles, émotions, nature, interactions humaines)<br /></p></li><li><p style=\"min-height:1.5em\">Capturer l’âme du groupe : ce qu’on ne voit pas mais qu’on ressent<br /></p></li><li><p style=\"min-height:1.5em\">Monter des capsules pour les réseaux sociaux (reels, shorts, stories, témoignages)<br /></p></li><li><p style=\"min-height:1.5em\">Réaliser un aftermovie de l’édition à laquelle tu participes (2 à 3 min, format libre)<br /></p></li><li><p style=\"min-height:1.5em\">Co-créer avec nous une banque de contenus à fort impact émotionnel et narratif<br /></p></li><li><p style=\"min-height:1.5em\">Être en immersion avec l’équipe pour capter la réalité, pas une mise en scène</p></li></ol><p style=\"min-height:1.5em\"></p><p style=\"min-height:1.5em\"></p><h2><strong>LES DATES &amp; LIEUX </strong></h2><p style=\"min-height:1.5em\">------------------------------</p><p style=\"min-height:1.5em\">On cherche 6 vidéastes, soit 2 par bootcamp :</p><ol style=\"min-height:1.5em\"><li><p style=\"min-height:1.5em\"><strong>Bootcamp Jeunes : </strong><br /><br /> 📍 Houlgate, Normandie<br /><br /> 📅 Du 11 au 16 juillet 2025<br /></p></li><li><p style=\"min-height:1.5em\"><strong>Bootcamp Parents / Enfants : </strong><br /><br /> 📍 Fontenay-sur-Vègre, Sarthe<br /><br /> 📅 Du 21 au 25 juillet 2025<br /></p></li><li><p style=\"min-height:1.5em\"><strong>Bootcamp Jeunes  :</strong><br /><br /> 📍 Malabat, près de Pau<br /><br /> 📅 Du 22 au 27 août 2025</p></li></ol><p style=\"min-height:1.5em\"></p><p style=\"min-height:1.5em\"></p><h2><strong>CE QU’ON OFFRE </strong></h2><p style=\"min-height:1.5em\">-------------------------------</p><ul style=\"min-height:1.5em\"><li><p style=\"min-height:1.5em\">Une immersion dans une aventure humaine bouleversante<br /></p></li><li><p style=\"min-height:1.5em\">L’hébergement et la nourriture pris en charge sur toute la durée du bootcamp<br /></p></li><li><p style=\"min-height:1.5em\">Une visibilité de ton travail sur tous les canaux de la fondation (et de Paradox)<br /></p></li><li><p style=\"min-height:1.5em\">La possibilité de co-signer certains contenus<br /></p></li><li><p style=\"min-height:1.5em\">Une expérience terrain unique pour enrichir ton portfolio, ton storytelling, ton regard<br /></p><p style=\"min-height:1.5em\">(Et selon notre budget final : une petite rémunération ou un dédommagement, à confirmer très prochainement)</p><p style=\"min-height:1.5em\"></p></li></ul><h2></h2><h2><strong>CE QU’ON RECHERCHE CHEZ TOI :</strong></h2><p style=\"min-height:1.5em\">-------------------------------</p><ul style=\"min-height:1.5em\"><li><p style=\"min-height:1.5em\">Une vraie sensibilité humaine et artistique<br /></p></li><li><p style=\"min-height:1.5em\">Une capacité à filmer avec justesse, présence, spontanéité<br /></p></li><li><p style=\"min-height:1.5em\">Une autonomie technique (matériel + gestion de la lumière/nature)<br /></p></li><li><p style=\"min-height:1.5em\">Une âme d’aventurier·e : tu dors parfois sous tente, tu vis en collectif, tu fais partie du camp<br /></p></li><li><p style=\"min-height:1.5em\">Et bien sûr… une envie sincère de mettre ton talent au service d’une cause plus grande</p><p style=\"min-height:1.5em\"></p></li></ul><h2><strong>INTÉRESSÉ·E ?</strong></h2><p style=\"min-height:1.5em\">-------------------------------</p><p style=\"min-height:1.5em\">Réponds à ce court VideoAsk pour te présenter et nous dire pourquoi tu veux rejoindre l’aventure :</p><p style=\"min-height:1.5em\">👉 <a target=\"_blank\" rel=\"noopener noreferrer nofollow\" href=\"https://www.videoask.com/f0xomnsp3\"><u>https://www.videoask.com/f0xomnsp3</u></a></p><p style=\"min-height:1.5em\"></p><p style=\"min-height:1.5em\">Tu ne feras pas juste des vidéos.</p><p style=\"min-height:1.5em\">Tu vas capturer l’essence d’une transformation.</p><p style=\"min-height:1.5em\">Merci d’avance pour ton énergie, ton regard, et peut-être… ta future présence sur le terrain avec nous !</p><p style=\"min-height:1.5em\"><em><strong>– La team Paradox Foundation</strong></em></p><div style=\"text-align:left\"><img style=\"max-width:100%\" src=\"https://app.ashbyhq.com/api/images/user-content/9f216e31-710a-4d14-8a7c-747665aa0e4a/d051549a-76d2-4f82-96f7-c31aa587ee5d/Captura%20de%20pantalla%202025-05-19%20a%20las%2015.16.40.png\" /></div><p style=\"min-height:1.5em\"></p>","tags":"[]","pubDate":"2025-05-19T13:29:08.498Z","link":"https://jobs.ashbyhq.com/paradox/45f66cea-e860-4ccd-9cb7-018c4b64237d","slug":"vid-astes-paradox-foundation-paradox-5422"},{"id":1508674429,"title":"Human Resources Operations Manager","company":"Winona","image":"https://yt3.googleusercontent.com/k45HnnNMWgPv-xF3D-u2ThxmesDOeU0p02rNJpbRWLes2Z18WpkLgXEE7XuBLkkzN_38AFnp3A=s160-c-k-c0x00ffffff-no-rj","description":"<p style=\"min-height:1.5em\"><strong>About Winona:</strong></p><p style=\"min-height:1.5em\"><a target=\"_blank\" rel=\"noopener noreferrer nofollow\" href=\"https://bywinona.com\">Winona</a> is one of the leading telemedicine companies providing HRT for women in menopause. We’ve built all of our technology in house including an EHR, patient care admin system, patient portal, website, marketing technology etc. Winona has two compounding pharmacies and a team of in house physicians providing world-class care via a fully vertically integrated business model.</p><p style=\"min-height:1.5em\"></p><p style=\"min-height:1.5em\"><strong>About the role:</strong></p><p style=\"min-height:1.5em\">We are looking for a proactive and adaptable <strong>Human Resources</strong> <strong>Operations Manager</strong> to join our fast-growing team. This role requires a well-rounded professional with a strong background in human resources and operations. The ideal candidate will be an excellent multi-tasker with a sharp eye for detail and a passion for fostering a positive and engaging employee experience.</p><p style=\"min-height:1.5em\"></p><p style=\"min-height:1.5em\"><strong>Seniority Level: </strong>Senior Level </p><p style=\"min-height:1.5em\"></p><p style=\"min-height:1.5em\"><strong>Responsibilities:</strong></p><p style=\"min-height:1.5em\"><strong>Human Resources:</strong></p><p style=\"min-height:1.5em\">Manage the full employee lifecycle, including onboarding, offboarding, and ongoing employee relations.</p><ul style=\"min-height:1.5em\"><li><p style=\"min-height:1.5em\">Process international payroll, benefits administration, and time and attendance, ensuring timely and accurate processing.</p></li><li><p style=\"min-height:1.5em\">Maintain accurate employee records and ensure compliance with local and international employment laws and regulations.</p></li><li><p style=\"min-height:1.5em\">Provide continuous support and guidance to employees regarding HR policies, procedures, and benefits.</p></li><li><p style=\"min-height:1.5em\">Coordinate training and development programs, fostering a growth-oriented and constantly improving environment.</p></li><li><p style=\"min-height:1.5em\">Facilitate performance reviews and goal-setting processes, ensuring effective feedback mechanisms are in place.</p></li></ul><p style=\"min-height:1.5em\"><strong>Operations:</strong></p><ul style=\"min-height:1.5em\"><li><p style=\"min-height:1.5em\">Manage vendor relationships and oversee vendor payments, ensuring smooth and efficient workflows.</p></li><li><p style=\"min-height:1.5em\">Plan and coordinate all-hands meetings and other company events, creating opportunities for interaction across all organizational levels.</p></li><li><p style=\"min-height:1.5em\">Oversee operational tasks, ensuring the efficient functioning of the organization and collaborating with other departments to address urgent needs.</p></li><li><p style=\"min-height:1.5em\">Collaborate in improving and optimizing internal operational processes and implementing new strategies to enhance organizational efficiency.</p><p style=\"min-height:1.5em\"></p></li></ul><p style=\"min-height:1.5em\"><strong>Requirements:</strong></p><ul style=\"min-height:1.5em\"><li><p style=\"min-height:1.5em\">Bachelor's degree in Human Resources, Business Administration, or related field.</p></li><li><p style=\"min-height:1.5em\">Ideally, a minimum of 3+ years of experience in human resources or operations roles in a high-growth environment.</p></li><li><p style=\"min-height:1.5em\">Experience in international payroll administration.</p></li><li><p style=\"min-height:1.5em\">Knowledge of U.S. employment laws and regulations, including tax compliance, labor laws, and benefits administration, ensuring full compliance and minimizing legal risks.</p></li><li><p style=\"min-height:1.5em\">Experience managing vendor relationships and payments.</p></li><li><p style=\"min-height:1.5em\">Strong attention to detail and accuracy, with excellent organizational and time management skills.</p></li><li><p style=\"min-height:1.5em\">Ability to prioritize tasks, work independently, and maintain flexibility in a fast-paced, dynamic environment.</p></li><li><p style=\"min-height:1.5em\">Exceptional interpersonal and communication skills, with the ability to interact effectively at all organizational levels.</p></li><li><p style=\"min-height:1.5em\">Ability to maintain discretion when handling highly sensitive and confidential employee and organizational matters.</p></li><li><p style=\"min-height:1.5em\">A positive and solution-oriented attitude</p><p style=\"min-height:1.5em\"></p></li></ul><p style=\"min-height:1.5em\"><strong>Nice to have:</strong></p><ul style=\"min-height:1.5em\"><li><p style=\"min-height:1.5em\">Experience working with international remote teams, with a strong understanding of the dynamics and challenges of managing a distributed workforce.</p></li><li><p style=\"min-height:1.5em\">Experience in telemedicine or related medical contexts, particularly in managing operations within healthcare or telehealth settings.</p></li><li><p style=\"min-height:1.5em\">Familiarity with software platforms such as Gusto, Deel, Mercury, Slack, and Google Suite.</p><p style=\"min-height:1.5em\"></p></li></ul><h2><strong>What’s in it for you?</strong></h2><p style=\"min-height:1.5em\">As full-time member of our team, you’ll enjoy:</p><ul style=\"min-height:1.5em\"><li><p style=\"min-height:1.5em\">Flexible hours</p></li><li><p style=\"min-height:1.5em\">Work wherever you choose</p></li><li><p style=\"min-height:1.5em\">Fun and casual work environment</p></li><li><p style=\"min-height:1.5em\">Employee engagement activities and virtual gatherings</p></li><li><p style=\"min-height:1.5em\">We are a diverse, global team! 🌍</p><p style=\"min-height:1.5em\"></p></li></ul><p style=\"min-height:1.5em\"><em>This company is affiliated for recruitment efforts. Each entity maintains operational independence, and no personal data is shared between them except as necessary for coordinated recruitment activities. Both teams are committed to protecting applicant privacy and ensuring a respectful, transparent hiring process.</em></p><p style=\"min-height:1.5em\"><em><strong>Equal Employment Opportunity</strong></em></p><p style=\"min-height:1.5em\"><em>Winona provides equal employment opportunities to all qualified individuals without regard to race, color, religion, sex, gender identity, sexual orientation, pregnancy, age, national origin, physical or mental disability, military or veteran status, genetic information, or any other protected classification. Equal employment opportunity extends to all aspects of employment including, but not limited to, recruitment, hiring, training, promotion, demotion, transfer, leaves of absence, and termination. Winona takes allegations of discrimination, harassment, and retaliation seriously and will promptly investigate such behaviors.</em></p>","tags":"[\"aws\",\"legal\"]","pubDate":"2025-05-19T12:11:43.752Z","link":"https://jobs.ashbyhq.com/winona/d5c09aa1-4333-4684-8751-107c4936ef60","slug":"human-resources-operations-manager-winona-9794"}]