[{"id":9405147639,"title":"Middle DevOps Engineer","company":"Gr8tech","image":"https://remotive.com/job/1963174/logo","description":"<div class='\"content-intro\"'><p><strong>GR8 Tech is a global product company that provides innovative, scalable platforms and business solutions for the iGaming industry.</strong></p>\n<p>We have а great experience: GR8 Tech platform successfully handles millions of active players and offers best practices to develop and grow in the gambling industry. We are here to provide great gaming tech to satisfy even greater ambition!</p>\n<p>We develop complete tech coverage for gambling businesses worldwide, including iGaming platform solutions, consulting, integration, and long-lasting operation services.</p>\n<p><strong>We are driven by our ambition to make a great product with great people! Together we move the world of iGaming forward — join!</strong></p></div><div class=\"h2\"><strong>About your key responsibilities and impact:</strong></div>\n<ul style=\"\">\n<li style=\"\">Designing and maintaining high-load and high-availability infrastructure within Cloud and On-Premise environments;</li>\n<li style=\"\">Analyzing service infrastructure needs and justifying proposed solutions;</li>\n<li style=\"\">Designing and building Infrastructure as Code;</li>\n<li style=\"\">Implementing and maintaining performance monitoring systems;</li>\n<li style=\"\">Tuning performance through autoscaling and other optimization strategies;</li>\n<li style=\"\">Writing and updating scripts for automation and infrastructure management;</li>\n<li style=\"\">Dockerizing applications and maintaining Kubernetes clusters;</li>\n<li style=\"\">Collaborating with cross-functional teams to ensure smooth deployment and operation of applications.</li>\n</ul>\n<div class=\"h2\"><strong>Essential professional experience:</strong></div>\n<ul style=\"\">\n<li style=\"\"><strong>3 years</strong> <strong>of experience</strong> in a similar engineering role, with a strong track record of leadership, advanced technical skills, and successful project delivery;</li>\n<li style=\"\"><strong>System Design &amp; Architecture:</strong> Expertise in microservice and monolith architectures, event-driven design, and resilience patterns (e.g., circuit breaker, bulkhead). Proficient in requirements elicitation, functional and non-functional analysis, and system modeling;</li>\n<li style=\"\"><strong>Database Management:</strong> Strong understanding of relational and non-relational databases. Skilled in SQL, database normalization, schema design, and implementing security best practices;<br><strong>Networking &amp; Security:</strong> Knowledge of networking protocols (TCP, UDP, IP) and secure communication (SSL/TLS). Familiar with cryptographic principles, authentication/authorization algorithms, and mitigating common security vulnerabilities;</li>\n<li style=\"\"><strong>Cloud &amp; DevOps:</strong> Experience with AWS, Kubernetes, Docker, and Infrastructure as Code tools (Terraform, Ansible). Proficient in CI/CD pipelines, automation, and cloud resource management;</li>\n<li style=\"\"><strong>Monitoring &amp; Observability:</strong> Skilled in Prometheus, Grafana, and ELK stack for monitoring, logging, and troubleshooting. Experienced in setting up monitoring systems and analyzing data for performance optimization;</li>\n<li style=\"\"><strong>Virtualization &amp; Orchestration:</strong> Proficient in containerization with Docker, orchestration with Kubernetes, and virtualization concepts;</li>\n<li style=\"\"><strong>Development &amp; Scripting:</strong> Proficiency in scripting languages (e.g., Bash, Python) for automation, system monitoring, and API integrations. Adherence to SDLC best practices, version control (Git), and testing frameworks;</li>\n<li style=\"\"><strong>Security Best Practices:</strong> Implementation of secure cloud infrastructure, VPNs, encryption, and secure coding principles;</li>\n<li style=\"\"><strong>Linux Expertise:</strong> Advanced Linux administration skills, including networking, system architecture, and security management.</li>\n</ul>\n<p> </p><div class='\"content-conclusion\"'><p> </p>\n<div class=\"h2\"><strong>What we offer:</strong></div>\n<p><strong>Benefits Cafeteria:</strong></p>\n<ul style=\"\">\n<li style=\"\">Sports compensation;</li>\n<li style=\"\">Medical coverage;</li>\n<li style=\"\">Psychological support;</li>\n<li style=\"\">Home-office coverage.</li>\n</ul>\n<p><strong>Work-life:</strong></p>\n<ul style=\"\">\n<li style=\"\">Remote work, Coworking compensation;</li>\n<li style=\"\">Childcare budget;</li>\n<li style=\"\">Maternity leave;</li>\n<li style=\"\">Paternity leave;</li>\n<li style=\"\">Additional 2 days for family events.</li>\n</ul>\n<p><strong>Our GR8 Culture:</strong></p>\n<ul style=\"\">\n<li style=\"\">Open feedback and transparent direct communications;</li>\n<li style=\"\">Growth and development: better every day;</li>\n<li style=\"\">High tolerance to experiment and mistakes;</li>\n<li style=\"\">Supportive friendly environment.</li>\n</ul>\n<p> </p>\n<p> </p>\n<p>Data Protection Information regarding the processing of your personal data in connection with the recruitment and selection process can be found in the Candidate Privacy Notice at <a class='\"c-link\"' href=\"%22https://gr8.tech/candidate-privacy-notice/%22\" rel=\"nofollow\" target='\"_blank\"'>https://gr8.tech/candidate-privacy-notice/</a>.</p></div><img src=\"https://remotive.com/job/track/1963174/blank.gif?source=public_api\" alt=\"\"/>","tags":"[\"AWS\",\"docker\",\"kubernetes\",\"python\",\"terraform\"]","pubDate":"2025-01-18T01:50:44.000Z","link":"https://remotive.com/remote-jobs/devops/middle-devops-engineer-1963174","slug":"middle-devops-engineer-gr8tech-6928"},{"id":5175235172,"title":"QA Engineer","company":"Tabby","image":"https://remotive.com/job/1963201/logo","description":"<div><!--block-->Tabby creates financial freedom in the way people shop, earn and save by reshaping their relationship with money. Over 5,000,000 active users choose Tabby to stay in control of their spending and make the most out of their money.</div>\n<div><!--block-->Over 30,000 global brands and small businesses, including H&amp;M, Adidas, IKEA, SHEIN, noon, and Bloomingdale’s, use Tabby’s technology to accelerate growth and gain loyal customers by offering flexible payments online and in stores. <br><br>Tabby is active in Saudi Arabia, UAE, Egypt and Kuwait and backed by leading investors, including Sequoia Capital India, STV, PayPal Ventures, Mubadala Investment Capital, Arbor Ventures and others.<br><br>We are seeking a skilled <strong>QA Engineer</strong> to join our TSS Team that is accountable for the tools used in the scoring process. The team has various strategies in place to enhance our current services and develop new integrations and tools.</div>\n<p><br><br></p>\n<div class=\"h3\">Key Responsibilities</div>\n<ul style=\"\">\n<li style=\"\"><!--block-->Develop comprehensive test designs for the system, work with APIs, integrations, internal admin panels, and backend systems to ensure robust testing coverage.</li>\n<li style=\"\"><!--block-->Create and maintain detailed test plans for identified scenarios.</li>\n<li style=\"\"><!--block-->Implement automated load and acceptance testing for both front-end and back-end.</li>\n<li style=\"\"><!--block-->Analyze and configure a systematic approach to load testing, establish processes to meet baseline testing requirements.</li>\n<li style=\"\"><!--block-->Implement and maintain CI/CD pipelines for testing processes.</li>\n<li style=\"\"><!--block-->Focus on core testing needs while balancing manual and automated testing.</li>\n</ul>\n<p><br><br></p>\n<div class=\"h3\">Skills, Knowledge &amp; Expertise</div>\n<ul style=\"\">\n<li style=\"\"><!--block-->2+ years of experience as manual QA and at least 1 year of experience as Automation QA;</li>\n<li style=\"\"><!--block-->Good knowledge of testing and development processes;</li>\n<li style=\"\"><!--block-->Proficiency in automation tools with a focus on testing integration points and APIs. <strong>Experience with Go is a plus;</strong></li>\n<li style=\"\"><!--block-->Solid understanding and hands-on experience with testing in a microservices architecture;</li>\n<li style=\"\"><!--block-->Strong analytical skills to identify issues in complex integration scenarios and proactively develop solutions;</li>\n<li style=\"\"><!--block-->A detail-oriented mindset with a commitment to delivering high-quality products through rigorous testing practices.</li>\n</ul>\n<p><br><br></p>\n<div class=\"h3\">Job Benefits</div>\n<div><!--block--><strong>Relocation<br><br></strong>We offer remote work from anywhere in the world and are happy to work out an individual relocation plan for you.<br><br>Our employees have the opportunity to choose a country for registration: at the moment those are Armenia/Georgia/Serbia/Portugal/Spain.<br><br>We will help you open a legal entity and a bank account. In Armenia and Georgia the taxes are compensated by Tabby. In other countries we provide partial compensation of taxes.<br><br><strong>We employ according to B2B contracts (service agreements).</strong><br><br><strong>For our employees we cover the following:</strong></div>\n<ul style=\"\">\n<li style=\"\"><!--block-->Flight to one of the mentioned countries.</li>\n<li style=\"\"><!--block-->Accommodation during the paperwork completion period.</li>\n<li style=\"\"><!--block-->Opening a bank account and getting a residence permit in one of the mentioned countries.</li>\n<li style=\"\"><!--block-->Family relocation (dependants).</li>\n</ul>\n<div><!--block-->New employees can also choose an alternative method of relocation to another country of their choice. In this case, Tabby will reimburse up to $5,000 of verified costs upon opening a legal entity and a bank account.</div>\n<div class=\"h2\"><!--block-->What you can expect</div>\n<ul style=\"\">\n<li style=\"\"><!--block-->We offer flexible working hours and trust you to work enough hours to do your job well, at times that suit you and your team.</li>\n<li style=\"\"><!--block-->A working environment that gives you autonomy and responsibility from day one.</li>\n<li style=\"\"><!--block-->You should be comfortable with the idea that the quality of your work will influence the shape of your career.</li>\n<li style=\"\"><!--block-->Participation in company’s employee stock options program.</li>\n<li style=\"\"><!--block-->Health Insurance</li>\n</ul>\n<div><!--block-->We are passionate about creating an inclusive, high-performing workplace that gives people from all backgrounds the support they need to thrive, grow and meet their goals (whatever they may be).</div>\n<div><!--block--><br>If this sounds exciting to you, we’d love to hear from you!</div>\n<img src=\"https://remotive.com/job/track/1963201/blank.gif?source=public_api\" alt=\"\"/>","tags":"[\"admin\",\"api\",\"backend\",\"go\",\"automation\",\"CI/CD\",\"SOLID\",\"Micro services\",\"testing\",\"insurance\"]","pubDate":"2025-01-17T09:51:07.000Z","link":"https://remotive.com/remote-jobs/qa/qa-engineer-1963201","slug":"qa-engineer-tabby-4901"}]