[{"id":7152515417,"title":"Group Product Manager, Digital Account Opening","company":"Clutch","image":"https://app.ashbyhq.com/api/images/org-theme-logo/87f6e542-ae68-4ff1-ab48-f05e9dab1964/e24aecd5-3955-404a-8728-c08806c78730.png","description":"<p style=\"min-height:1.5em\"><strong>About the Role</strong></p><p style=\"min-height:1.5em\">Clutch is on a mission to transform Credit Unions into FinTechs, making them their members’ first choice.</p><p style=\"min-height:1.5em\">Digital Account Opening is a cornerstone of our vision to build the Credit Union OS across Lending and Account Opening. Since our investment in this product in 2023, it has quickly become mission-critical for credit unions, achieving rapid success and market leadership.</p><p style=\"min-height:1.5em\">We’re seeking a <strong>Group Product Manager (Staff PM)</strong> to own and scale this high-impact product. This <strong>Player-Coach role</strong> requires a hands-on leader who excels as an individual contributor and as a mentor to two Product Managers on the team.</p><p style=\"min-height:1.5em\">This role is deeply cross-functional, working across Product, Engineering, Customer Success, Sales, Marketing, and Product Operations. As a B2B2C PM, you will lead customer discovery and post-go-live success initiatives, directly influencing both product direction and customer outcomes.</p><p style=\"min-height:1.5em\"><strong>About the Team</strong></p><p style=\"min-height:1.5em\">Clutch is a <strong>product-driven company</strong> with a culture of innovation, curiosity, and customer obsession. Our Product team thrives on tackling ambiguity with a bias for action, driving a connected multi-product ecosystem.</p><p style=\"min-height:1.5em\">We operate in a fast-paced, collaborative environment, balancing short-term execution with long-term strategy. Clutch fosters a culture where self-starters elevate themselves and their peers daily.</p><p style=\"min-height:1.5em\">You’ll be joining a high-caliber team of alumni from top institutions like Harvard, Stanford, Wharton, and Princeton, with deep experience in starting new companies, bringing new bets to market as well as scaling products at growth-stage companies.</p><p style=\"min-height:1.5em\"><strong>What You'll Do</strong></p><p style=\"min-height:1.5em\"><strong>Within 3 months, you will:</strong></p><p style=\"min-height:1.5em\">This is a high-leverage role in a fast-moving product that demands rapid onboarding</p><ul style=\"min-height:1.5em\"><li><p style=\"min-height:1.5em\">Master Clutch’s product, processes, and customer landscape.</p></li><li><p style=\"min-height:1.5em\">Build strong relationships with internal teams and key customers.</p></li><li><p style=\"min-height:1.5em\">Drive quarterly roadmapping and weekly product execution cadences for Account Opening.</p></li><li><p style=\"min-height:1.5em\">Balance new feature releases with onboarding new credit union partners.</p></li><li><p style=\"min-height:1.5em\">Coach and support the two Product Managers on your team to ensure alignment and delivery.</p></li></ul><p style=\"min-height:1.5em\"><strong>Within 6 months, you will:</strong></p><ul style=\"min-height:1.5em\"><li><p style=\"min-height:1.5em\">Establish yourself as a trusted leader within the product team and company.</p></li><li><p style=\"min-height:1.5em\">Scale the Digital Account Opening product to onboard the next wave of credit union customers.</p></li><li><p style=\"min-height:1.5em\">Lead the integration of a connected multi-product ecosystem to drive membership growth.</p></li><li><p style=\"min-height:1.5em\">Evolve the Branch Account Opening product to meet customer needs.</p></li><li><p style=\"min-height:1.5em\">Build trusted relationships with at least five key credit union customers.</p></li></ul><p style=\"min-height:1.5em\"><strong>Within 9 months, you will:</strong></p><ul style=\"min-height:1.5em\"><li><p style=\"min-height:1.5em\">Identify and define new product opportunities within and beyond account opening.</p></li><li><p style=\"min-height:1.5em\">Strengthen the product’s strategic position as a driver of growth for Clutch and its customers.</p></li></ul><p style=\"min-height:1.5em\"><strong>What You'll Bring</strong></p><ul style=\"min-height:1.5em\"><li><p style=\"min-height:1.5em\">Proven experience navigating high ambiguity in mid-stage B2B environments.</p></li><li><p style=\"min-height:1.5em\">Strong customer empathy and product management expertise, balancing diverse stakeholder needs.</p></li><li><p style=\"min-height:1.5em\">A strategic mindset to drive immediate execution while maintaining a long-term vision.</p></li><li><p style=\"min-height:1.5em\">Experience managing complex product areas blending internal tools and customer-facing features.</p></li><li><p style=\"min-height:1.5em\">Ability to lead as both a hands-on contributor as well as a coach to PMs.</p></li><li><p style=\"min-height:1.5em\">Exceptional cross-functional collaboration, communication, and stakeholder alignment skills.</p></li><li><p style=\"min-height:1.5em\">Expertise in product delivery, balancing speed, scalability, and constraints.</p></li><li><p style=\"min-height:1.5em\">Proficiency in leveraging data to inform decisions, track performance, and identify opportunities for improvement. Comfortable using data to tell a story and drive stakeholder buy-in.</p></li><li><p style=\"min-height:1.5em\">Expertise in managing multiple competing priorities, ensuring product delivery meets deadlines while exceeding quality expectations</p></li><li><p style=\"min-height:1.5em\">Clear, concise, and compelling communication skills, capable of influencing both technical and non-technical audiences at all levels of the organization</p></li><li><p style=\"min-height:1.5em\">Nice to have: Fintech experience, Account Opening experience</p></li></ul><p style=\"min-height:1.5em\"><em>Please note that this role may evolve as our business needs change, so we appreciate your flexibility and adaptability.</em></p><p style=\"min-height:1.5em\"><strong>What's In It For You?</strong></p><ul style=\"min-height:1.5em\"><li><p style=\"min-height:1.5em\"><strong>Remote Flexibility:</strong> Enjoy the freedom of remote work from anywhere, balancing life and career seamlessly.</p></li><li><p style=\"min-height:1.5em\"><strong>Unforgettable Off-Sites:</strong> Twice a year, bond with colleagues in exciting destinations, fostering teamwork and fresh ideas.</p></li><li><p style=\"min-height:1.5em\"><strong>Paid Time Off:</strong> Enjoy flexible PTO days yearly for relaxation and rejuvenation.</p></li><li><p style=\"min-height:1.5em\"><strong>Stock Options:</strong> Joining us means having a stake in our success, so you'll receive stock options as part of your compensation package.</p></li><li><p style=\"min-height:1.5em\"><strong>Home Office Setup:</strong> Create your ideal workspace with a dedicated budget for home office essentials.</p></li><li><p style=\"min-height:1.5em\"><strong>Work Trip Budget:</strong> Grow personally and professionally with a budget for work-related trips and co-working.</p></li><li><p style=\"min-height:1.5em\"><strong>Health Coverage:</strong> Prioritize your well-being with comprehensive health and dental insurance plans.</p></li></ul><p style=\"min-height:1.5em\"><strong>About Us</strong></p><p style=\"min-height:1.5em\"><strong>Clutch</strong> is a revolutionary vertical SaaS company, proudly backed by Andreessen Horowitz (A16z), aimed at revolutionizing the way Credit Unions engage and change the lives of their members. As a champion of financial well-being, we address the urgent need for affordable lending solutions in an era where the average American grapples with over $155,000 in household debt.  Unlike traditional financial institutions, Clutch develops software to turn Credit Unions into FinTech lenders and leverage their balance sheets to responsibly lend to over 130M Americans. Our mission extends beyond mere financial transactions; we strive to fundamentally enhance the way credit unions interact with their members. By integrating cutting-edge technologies and user-centric designs, we help credit unions provide seamless digital experiences that are on par with leading tech companies. This approach not only preserves but revitalizes the longstanding tradition of community and member-focused service inherent to credit unions.</p><p style=\"min-height:1.5em\">Clutch is an equal-opportunity employer. All applicants will be considered for employment without attention to race, color, religion, sex, sexual orientation, gender identity, national origin, veteran or disability status.</p><p style=\"min-height:1.5em\"><em>Our organization participates in E-Verify. Click </em><a target=\"_blank\" rel=\"noopener noreferrer nofollow\" href=\"https://www.e-verify.gov/about-e-verify/what-is-e-verify\"><em>here</em></a><em> to learn about E-Verify.</em></p>","tags":"[\"management\",\"engineering\",\"b2c\",\"b2b\"]","pubDate":"2025-01-24T01:41:48.111Z","link":"https://jobs.ashbyhq.com/withclutch/06fa42d8-f048-43a7-becb-b57af6d5b219","slug":"group-product-manager-digital-account-opening-clutch-4923"},{"id":7807574720,"title":"Senior BI Analyst - Cashalo","company":"Empower","image":"https://lever-client-logos.s3.us-west-2.amazonaws.com/2e1a369c-b58f-41ac-8d86-4b0a77695e68-1687915522032.png","description":"<p style=\"min-height:1.5em\"><strong>EMPOWER OVERVIEW</strong></p><p style=\"min-height:1.5em\"><a target=\"_blank\" rel=\"noopener noreferrer nofollow\" href=\"http://empower.me/\">Empower</a> is shaking up an outdated financial system by providing real opportunity for our customers: the opportunity to get the cash they need, to access fair credit, and to change their financial story. Today, we’re helping millions of people find financial security through machine learning models that evaluate creditworthiness using a more inclusive lens and mobile-first products: Cash Advance, Thrive line of credit, and Petal credit cards. Tomorrow? Creating even more financial paths for our customers (and their wallets) to succeed.</p><p style=\"min-height:1.5em\">This year, Empower ranked #65 on Inc. 5000’s Fastest-Growing Private Companies list — our third year in a row cracking the top 100 — and was named by Forbes as one of the 25 Next Billion-Dollar Startups for 2024. Empower was also featured by Forbes on America’s Best Startup Employers list in 2023, and our Thrive line of credit product was named by Fast Company as one of 2022’s Next Big Things in Tech.</p><p style=\"min-height:1.5em\">Empower is backed by Sequoia Capital, Blisce, and Icon Ventures. Ready to grow your impact and accelerate your career? Take a look at our open roles — we can’t wait to meet you.</p><p style=\"min-height:1.5em\"></p><p style=\"min-height:1.5em\"><strong>THE EMPOWER WAY</strong></p><p style=\"min-height:1.5em\"><strong>Great Expectations</strong>: We come up with bold, audacious goals for ourselves and go all out for impact</p><p style=\"min-height:1.5em\"><strong>Owner Mindset</strong>: We give every employee latitude to act independently, make smart choices, and move the business forward</p><p style=\"min-height:1.5em\"><strong>Spirited Debate</strong>: We love skeptics and seek counter opinions to challenge our personal assumptions and expand our view</p><p style=\"min-height:1.5em\"><strong>Customer Obsession:</strong> We listen to understand, empathize, and create a memorable, rewarding experience for our community</p><p style=\"min-height:1.5em\"><strong>Inclusive Collaboration</strong>: We believe diverse teams make the best decisions, and we strive to give diverse voices a seat at the table</p><p style=\"min-height:1.5em\"><strong>No Jerks Allowed</strong>: We value our relationships and take the time to build trust and connection and communicate respectfully</p><p style=\"min-height:1.5em\"></p><p style=\"min-height:1.5em\"><strong>WHAT EMPOWER OFFERS</strong></p><p style=\"min-height:1.5em\">Competitive salary</p><p style=\"min-height:1.5em\">Generous equity package</p><p style=\"min-height:1.5em\">Full healthcare benefits</p><p style=\"min-height:1.5em\">Technology expense reimbursement</p><p style=\"min-height:1.5em\">Virtual first environment</p><p style=\"min-height:1.5em\"><strong>Cashalo OVERVIEW</strong></p><p style=\"min-height:1.5em\"><a target=\"_blank\" rel=\"noopener noreferrer nofollow\" href=\"http://empower.me/\">Empower</a> is a fast-growing fintech on a mission to expand access to fair credit to give anyone the opportunity to improve their financial security and mobility. We recently launched in Southeast Asia through our acquisition of Cashalo, a leading online lending platform, and the fastest growing lender in the Philippines. Our mission to expand access to credit in the region will take creativity, passion, and drive.</p><p style=\"min-height:1.5em\"></p><h2>Job Description</h2><p style=\"min-height:1.5em\">The Senior Business Intelligence Analyst builds data models, reports, analysis, and tools to help Empower manage our lending operations at scale.  The role works closely with our Southeast Asia based Cashalo team and other stakeholders to develop accurate, performant, and easy to understand data models that describe our business .  You’ll develop accurate and timely datasets and loantapes for use internally and by our partners.  You’ll work with both the US based BI team and Cashalo team to expand our suite of analytics tables, validate for accuracy, and troubleshoot issues.</p><p style=\"min-height:1.5em\"></p><h2>Key Responsibilities</h2><ul style=\"min-height:1.5em\"><li><p style=\"min-height:1.5em\">Develop accurate, responsive, and easy to understand dbt models that drive quality decision making across our Cashalo operations. </p></li><li><p style=\"min-height:1.5em\">Discover issues, edge cases, outliers and anomalies in our lending data.  Develop exception reporting and outlier analysis to highlight findings.</p></li><li><p style=\"min-height:1.5em\">Extend and adapt dbt models based on business needs.  Troubleshoot and resolve issues with data and models.</p></li><li><p style=\"min-height:1.5em\">Coordinate with internal and external teams on changes to existing reporting and implement.</p></li><li><p style=\"min-height:1.5em\">Expand documentation and guides around BI data models.</p></li><li><p style=\"min-height:1.5em\">Act as a SQL and Tableau resource for analysts across the organization.</p></li><li><p style=\"min-height:1.5em\">Collaborate with the US based BI team for consistency and best practices.  </p></li></ul><p style=\"min-height:1.5em\"></p><p style=\"min-height:1.5em\">Travel for company offsites is expected at a minimum 2 times a year.</p><p style=\"min-height:1.5em\"></p><h2>Candidate Qualifications</h2><ul style=\"min-height:1.5em\"><li><p style=\"min-height:1.5em\">Minimum 4 years in an analytical role supporting finance, accounting, or lending teams preferably in a fintech or financial services environment.</p></li><li><p style=\"min-height:1.5em\">Minimum 4 years working directly with stakeholders on analytics requirements, changes, and validation.  Strong communication skills required.</p></li><li><p style=\"min-height:1.5em\">Minimum 2 years working with dbt, in data model design, implementation, and validation.</p></li><li><p style=\"min-height:1.5em\">Minimum 2 years working in an international environment, including experience directly in the US, or with US based stakeholders.  Additional experience with Philippines based teams and business environment a huge plus.</p></li><li><p style=\"min-height:1.5em\">Demonstrated track record of working directly with business teams on end to end data modeling / reporting projects, from requirements gathering to reporting outputs.</p></li><li><p style=\"min-height:1.5em\">Expert fluency in English, spoken and written.</p></li><li><p style=\"min-height:1.5em\">Expert SQL skills, with a track record of delivering accurate and performant queries for driving reporting. </p></li><li><p style=\"min-height:1.5em\">Good data visualization skills, you have built reports and analysis that drove business decision making.  Tableau experience strongly preferred.</p></li><li><p style=\"min-height:1.5em\">Experience with Data Warehouse solutions such as Databricks, Synapse, or Snowflake.  Exposure to Azure Synapse a big plus</p></li></ul><p style=\"min-height:1.5em\">At Empower, we hire for people that push themselves to understand others and seek out ways to challenge their personal assumptions. Our hope is that by fostering such an environment, we strengthen our business and relationships by putting people first. We are committed to building a diverse, inclusive, and equitable workspace where everyone (regardless of age, education, ethnicity, gender, sexual orientation, or any personal characteristics) feels like they belong. Even if your experience doesn’t exactly match up to our job description, you should feel empowered to apply regardless!</p>","tags":"[\"finance\"]","pubDate":"2025-01-24T01:02:16.358Z","link":"https://jobs.ashbyhq.com/empower%20finance/5b9cbcf0-a6c6-4b89-9036-bccbd0b382fc","slug":"senior-bi-analyst-cashalo-empower-4205"},{"id":9219154425,"title":"Senior Manager, Data Science & Analytics","company":"BioRender","image":"https://avatars.githubusercontent.com/u/46490948?s=200&v=4","description":"<p style=\"min-height:1.5em\">At BioRender, we are accelerating the world’s ability to discover, learn, and communicate science faster through visuals. Today, BioRender empowers millions of scientists to create beautiful, accurate biological figures for communication within pharma companies and academic research.</p><p style=\"min-height:1.5em\"></p><p style=\"min-height:1.5em\">Our vision is to make BioRender the place where humans read biology—translating human and AI-generated data into scientifically accurate, human-understandable visuals. As AI automates large parts of research, BioRender will transform complex data, experimental results, and text inputs into clear, intuitive visuals that scientists, decision-makers, and broader audiences can quickly interpret. Visual communication will be critical to accelerating breakthroughs across academia and industry, and BioRender will bridge the gap between specialized knowledge domains.</p><p style=\"min-height:1.5em\"></p><p style=\"min-height:1.5em\">Our Data Team is at the forefront of this vision, ensuring data is structured, trusted, and actionable for strategic decision-making. We’re looking for a <strong>Senior Manager, Data Science &amp; Analytics</strong> who is excited to drive business impact across BioRender.</p><p style=\"min-height:1.5em\"></p><p style=\"min-height:1.5em\">This is an excellent opportunity for someone who:</p><ul style=\"min-height:1.5em\"><li><p style=\"min-height:1.5em\">Has previously led a Data Science &amp; Analytics team and wants to bring their expertise to a high-growth environment where data-driven decision-making is core to the company’s success.<br /><strong>OR</strong></p></li><li><p style=\"min-height:1.5em\">Has broad data strategy and analytics leadership experience, is comfortable managing a team, and is ready to scale a data program.</p></li></ul><p style=\"min-height:1.5em\"></p><p style=\"min-height:1.5em\"><strong>What you'll be doing :</strong></p><ul style=\"min-height:1.5em\"><li><p style=\"min-height:1.5em\">Data as a Work Product</p><ul style=\"min-height:1.5em\"><li><p style=\"min-height:1.5em\">Unify and expand business metrics to ensure consistent usage across the company.</p></li><li><p style=\"min-height:1.5em\">Own the trust and quality of core data sets, providing a single source of truth for company and product performance.</p></li><li><p style=\"min-height:1.5em\">Ensure our business model is accurately reflected in how data and metrics are structured.</p></li></ul><p style=\"min-height:1.5em\">Data as a Thought Leader</p><ul style=\"min-height:1.5em\"><li><p style=\"min-height:1.5em\">Identify emerging trends in data to guide strategic business decisions and investment areas.</p></li><li><p style=\"min-height:1.5em\">Provide novel insights into opportunities where the company should focus its efforts.</p></li></ul><p style=\"min-height:1.5em\">AI-Forward &amp; Self-Serve Analytics</p><ul style=\"min-height:1.5em\"><li><p style=\"min-height:1.5em\">Enable self-serve capabilities for stakeholders across the company, reducing the technical complexity required to extract insights from data.</p></li><li><p style=\"min-height:1.5em\">Champion AI-driven data tooling to enhance accessibility and efficiency.</p></li></ul></li></ul><p style=\"min-height:1.5em\"></p><p style=\"min-height:1.5em\"><strong>Our ideal fit brings:</strong></p><ul style=\"min-height:1.5em\"><li><p style=\"min-height:1.5em\">Strong business acumen with a deep understanding of key GTM, Finance, and Product metrics.</p></li><li><p style=\"min-height:1.5em\">Excellent communication skills with the ability to convey technical concepts to non-technical stakeholders.</p></li><li><p style=\"min-height:1.5em\">Experience in training and enablement, ensuring that teams are empowered to leverage data effectively.</p></li><li><p style=\"min-height:1.5em\">Leadership experience in managing a team of experienced GTM and Product data analysts.</p></li><li><p style=\"min-height:1.5em\">Ability to work closely with Product and GTM teams (PMs, AEs, CSMs) to define critical data needs, such as experimentation frameworks and end-user reporting.</p></li></ul><p style=\"min-height:1.5em\"></p><p style=\"min-height:1.5em\"><strong>Nice to haves:</strong></p><ul style=\"min-height:1.5em\"><li><p style=\"min-height:1.5em\">Experience working with data engineering teams to drive scalable data solutions.</p></li><li><p style=\"min-height:1.5em\">Familiarity with data governance frameworks and best practices.</p></li><li><p style=\"min-height:1.5em\">Background in AI-driven analytics tools and self-serve business intelligence platforms.</p></li></ul><p style=\"min-height:1.5em\"></p><p style=\"min-height:1.5em\"><strong>Why join us?</strong></p><ul style=\"min-height:1.5em\"><li><p style=\"min-height:1.5em\"><strong>We are mission-driven</strong>: we work collaboratively towards our shared vision of improving scientific communication and accelerating scientific discovery. BioRender figures have appeared in more than 54,000 publications! </p></li><li><p style=\"min-height:1.5em\"><strong>BioRender is loved by millions!</strong> We have a world-class NPS and a community of loyal fans and users in 200+ countries!</p></li><li><p style=\"min-height:1.5em\"><strong>Our company is backed by top investors</strong> and accelerators like Y Combinator, and we are on a growth trajectory comparable to many top-performing SaaS companies </p></li><li><p style=\"min-height:1.5em\"><strong>We’re remote-first</strong> with team members across Canada and the U.S., offering you the flexibility to work from anywhere. </p></li></ul><p style=\"min-height:1.5em\"></p><p style=\"min-height:1.5em\">BioRender is an Equal Opportunity Employer. We celebrate diversity and are committed to creating an inclusive environment for all employees. All qualified applicants will receive consideration for employment without regard to race, color, religion, sex, sexual orientation, gender identity, national origin, disability, or veteran status.</p>","tags":"[\"finance\",\"engineering\"]","pubDate":"2025-01-23T20:43:29.168Z","link":"https://jobs.ashbyhq.com/biorender/7e757b3f-a417-4892-8ecb-296061ba8650","slug":"senior-manager-data-science-analytics-biorender-3386"},{"id":9629363178,"title":"Account Executive (English & Punjabi)","company":"Bobtail","image":"https://media.licdn.com/dms/image/v2/D560BAQHzAQXggf5uQg/company-logo_200_200/company-logo_200_200/0/1688643230676/bobtail_logo?e=1742428800&v=beta&t=P9gHgDHOknAHShwQR1JsLMYGaVscLGTzwmWViGMvnbE","description":"&lt;p&gt;&lt;strong&gt;About Bobtail&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;Bobtail is dedicated to increasing happiness for our customers by eliminating inefficiencies in the supply chain. We envision a supply chain without friction, fraud, waste, and abuse where companies succeed based on the value they create. We work in a unique way at Bobtail, where we value teams over individuals and encourage experimentation and iteration to constantly improve. Teams are given flexibility in working towards a shared purpose, and given the freedom to decide how they will accomplish their goals.&lt;/p&gt;\n&lt;p&gt;If you are an out-of-the-box thinker that takes a proactive approach to collaborating with others to solve problems and achieve your goals - we would love to talk to you.&lt;/p&gt;\n&lt;p&gt;The things we value:&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;Mission&lt;/li&gt;\n&lt;li&gt;Teams over individuals&lt;/li&gt;\n&lt;li&gt;Collaboration&lt;/li&gt;\n&lt;li&gt;Communication&lt;/li&gt;\n&lt;li&gt;Iteration&lt;/li&gt;\n&lt;li&gt;Experimentation and failing fast&lt;/li&gt;\n&lt;li&gt;Initiative and solutions-oriented approach&lt;/li&gt;\n&lt;li&gt;Documentation&lt;/li&gt;\n&lt;li&gt;Data&lt;/li&gt;\n&lt;li&gt;Mental health and work-life balance&lt;/li&gt;\n&lt;li&gt;Diversity&lt;/li&gt;\n&lt;li&gt;Transparency&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;&lt;strong&gt;You should apply if you have:&lt;/strong&gt;&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;3–5 years of B2B cold calling &amp;amp; outbound sales experience&lt;/li&gt;\n&lt;li&gt;Bilingual is preferred (English/Punjabi)&lt;/li&gt;\n&lt;li&gt;Software as a Service (SaaS) experience is a must&lt;/li&gt;\n&lt;li&gt;US Trucking Industry knowledge is a plus&lt;/li&gt;\n&lt;li&gt;CRM usage experience is preferred (Salesforce is a plus)&lt;/li&gt;\n&lt;li&gt;Start-up experience is a plus&lt;/li&gt;\n&lt;li&gt;Ability to quickly learn in a fast-paced environment,&lt;/li&gt;\n&lt;li&gt;Consistent track record of achievement and hitting quotas&lt;/li&gt;\n&lt;li&gt;Confidence, as well as strong verbal &amp;amp; written communication skills when interacting with clients&lt;/li&gt;\n&lt;li&gt;Ability to discover and understand customer needs and propose solutions&lt;/li&gt;\n&lt;li&gt;Dependable team player&lt;/li&gt;\n&lt;li&gt;A motivated, driven, self-starter… We love those with grit and accountability!&lt;/li&gt;\n&lt;li&gt;Must own a modern - not older than 3 years old laptop with a working camera.&lt;/li&gt;\n&lt;li&gt;An Internet Speed of 50 Mbps is required&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;&lt;strong&gt;You will be responsible for:&lt;/strong&gt;&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;Making daily cold calls &amp;amp; sending emails/text to connect with prospects&lt;/li&gt;\n&lt;li&gt;Converting prospects &amp;amp; leads into Bobtail clients&lt;/li&gt;\n&lt;li&gt;Collaborating as a team to accomplish individual, team, and company-wide goals&lt;/li&gt;\n&lt;li&gt;Maintaining a pipeline of leads and opportunities using our CRM (Salesforce)&lt;/li&gt;\n&lt;li&gt;Effectively using other sales tools to track progress and improve your performance&lt;/li&gt;\n&lt;li&gt;Learning about each client’s needs, industry, and competitors.&lt;/li&gt;\n&lt;li&gt;Building long-lasting, mutually beneficial relationships with prospects and clients to create a better customer experience.&lt;/li&gt;\n&lt;li&gt;Following up with prospects throughout the sales cycle to continue nurturing them.&lt;/li&gt;\n&lt;li&gt;Presenting the value of Bobtail products and services to prospects&lt;/li&gt;\n&lt;li&gt;Staying current on company offerings and industry trends.&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;&lt;strong&gt;Educational background:&lt;/strong&gt;&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;Bachelor’s degree preferred&lt;/li&gt;\n&lt;li&gt;Sales or business education/certification preferred&lt;/li&gt;\n&lt;li&gt;Completed studies preferred&lt;br&gt;&lt;br&gt;&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;&lt;strong&gt;Benefits:&lt;/strong&gt;&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;Monthly Mental Break Day&lt;/li&gt;\n&lt;li&gt;Paid Time Off&lt;/li&gt;\n&lt;li&gt;Work from home (or wherever)&lt;/li&gt;\n&lt;li&gt;Parental leave&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;&lt;br&gt;Creating a diverse and inclusive workplace is Bobtail’s nucleus. We are an equal opportunity employer and embrace people of different backgrounds, cultures, religions, national origins, races, colours, genders, gender expressions, sexual orientations, ages, marital status, veteran status, experiences, abilities, and perspectives.&lt;/p&gt;\n&lt;p&gt;&amp;nbsp;&lt;/p&gt;","tags":"[\"b2b\"]","pubDate":"2025-01-23T16:35:08.000Z","link":"https://job-boards.greenhouse.io/bobtail/jobs/4520512005","slug":"account-executive-english-punjabi-bobtail-8481"},{"id":2834957079,"title":"Account Executive Bilingual (English & Spanish)","company":"Bobtail","image":"https://media.licdn.com/dms/image/v2/D560BAQHzAQXggf5uQg/company-logo_200_200/company-logo_200_200/0/1688643230676/bobtail_logo?e=1742428800&v=beta&t=P9gHgDHOknAHShwQR1JsLMYGaVscLGTzwmWViGMvnbE","description":"&lt;h2&gt;&lt;strong&gt;About Bobtail&lt;/strong&gt;&lt;/h2&gt;\n&lt;p&gt;Bobtail is dedicated to increasing happiness for our customers by eliminating inefficiencies in the supply chain. We envision a supply chain without friction, fraud, waste, and abuse where companies succeed based on the value they create.&lt;/p&gt;\n&lt;p&gt;&amp;nbsp;&lt;/p&gt;\n&lt;p&gt;We work uniquely at Bobtail, where we value teams over individuals and encourage experimentation and iteration to constantly improve. Teams are given flexibility in working towards a shared purpose and given the freedom to decide how they will accomplish their goals.&lt;/p&gt;\n&lt;p&gt;If you are an out-of-the-box thinker who takes a proactive approach to collaborating with others to solve problems and achieve your goals - we would love to talk to you.&lt;/p&gt;\n&lt;p&gt;The things we value:&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;Mission&lt;/li&gt;\n&lt;li&gt;Teams over individuals&lt;/li&gt;\n&lt;li&gt;Collaboration&lt;/li&gt;\n&lt;li&gt;Communication&lt;/li&gt;\n&lt;li&gt;Iteration&lt;/li&gt;\n&lt;li&gt;Experimentation and failing fast&lt;/li&gt;\n&lt;li&gt;Initiative and solutions-oriented approach&lt;/li&gt;\n&lt;li&gt;Documentation&lt;/li&gt;\n&lt;li&gt;Data&lt;/li&gt;\n&lt;li&gt;Mental health and work-life balance&lt;/li&gt;\n&lt;li&gt;Diversity&lt;/li&gt;\n&lt;li&gt;Transparency&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;&lt;strong&gt;You should apply if you have:&lt;/strong&gt;&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;3 years of B2B cold calling &amp;amp; outbound sales experience&lt;/li&gt;\n&lt;li&gt;Bilingual (English/Spanish) is a must&lt;/li&gt;\n&lt;li&gt;Software as a Service (SaaS) Nice to have&amp;nbsp;&lt;/li&gt;\n&lt;li&gt;US Trucking Industry knowledge is a plus&lt;/li&gt;\n&lt;li&gt;CRM usage experience is preferred (Salesforce is a plus)&lt;/li&gt;\n&lt;li&gt;Start-up experience is a plus&lt;/li&gt;\n&lt;li&gt;Ability to quickly learn in a fast-paced environment,&lt;/li&gt;\n&lt;li&gt;Consistent track record of achievement and hitting quotas&lt;/li&gt;\n&lt;li&gt;Confidence, as well as strong verbal &amp;amp; written communication skills when interacting with clients&lt;/li&gt;\n&lt;li&gt;Ability to discover and understand customer needs and propose solutions&lt;/li&gt;\n&lt;li&gt;Dependable team player&lt;/li&gt;\n&lt;li&gt;A motivated, driven, self-starter… We love those with grit and accountability!&lt;/li&gt;\n&lt;li&gt;You must own a modern laptop with a working camera that is not older than 3 years.&lt;/li&gt;\n&lt;li&gt;An Internet Speed of 50 Mbps is required&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;&amp;nbsp;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;You will be responsible for:&lt;/strong&gt;&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;Making daily cold calls &amp;amp; sending emails/text to connect with prospects&lt;/li&gt;\n&lt;li&gt;Converting prospects &amp;amp; leads into Bobtail clients&lt;/li&gt;\n&lt;li&gt;Collaborating as a team to accomplish individual, team, and company-wide goals&lt;/li&gt;\n&lt;li&gt;Maintaining a pipeline of leads and opportunities using our CRM (Salesforce)&lt;/li&gt;\n&lt;li&gt;Effectively using other sales tools to track progress and improve your performance&lt;/li&gt;\n&lt;li&gt;Learning about each client’s needs, industry, and competitors.&lt;/li&gt;\n&lt;li&gt;Building long-lasting, mutually beneficial relationships with prospects and clients to create a better customer experience.&lt;/li&gt;\n&lt;li&gt;Following up with prospects throughout the sales cycle to continue nurturing them.&lt;/li&gt;\n&lt;li&gt;Presenting the value of Bobtail products and services to prospects&lt;/li&gt;\n&lt;li&gt;Staying current on company offerings and industry trends.&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;&lt;strong&gt;Educational background:&lt;/strong&gt;&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;Bachelor’s degree preferred&lt;/li&gt;\n&lt;li&gt;Sales or business education/certification preferred&lt;/li&gt;\n&lt;li&gt;Completed studies preferred&lt;br&gt;&lt;br&gt;&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;&lt;strong&gt;Benefits:&lt;/strong&gt;&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;Monthly Mental Break Day&lt;/li&gt;\n&lt;li&gt;Paid Time Off&lt;/li&gt;\n&lt;li&gt;Work from home (or wherever)&lt;/li&gt;\n&lt;li&gt;Parental leave&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;&lt;br&gt;Creating a diverse and inclusive workplace is Bobtail’s nucleus. We are an equal opportunity employer and embrace people of different backgrounds, cultures, religions, national origins, races, colors, genders, gender expressions, sexual orientations, ages, marital status, veteran status, experiences, abilities, and perspectives.&lt;/p&gt;\n&lt;p&gt;&lt;br&gt;&lt;br&gt;&lt;/p&gt;","tags":"[\"b2b\"]","pubDate":"2025-01-23T15:44:06.000Z","link":"https://job-boards.greenhouse.io/bobtail/jobs/4520484005","slug":"account-executive-bilingual-english-spanish-bobtail-6883"},{"id":9523072224,"title":"Director of Growth, North America","company":"Airalo","image":"https://lever-client-logos.s3.us-west-2.amazonaws.com/55028a36-609c-479c-9553-d4689ff2dd8c-1669620566663.png","description":"<div><b>About Airalo</b></div><div>Alo! Airalo is the world’s first eSIM store that helps people connect in over 200+ countries and regions across the globe. We are building the next digital service that revolutionizes the telecom industry. We are a travel-tech company and an equal-opportunity environment that values and executes diversity, inclusion, and equity. Our team is spread across 50+ countries and six continents. What glues us together is our commitment to changing the way you connect<span style=\"font-size: 13.3333px\">. </span></div><div><br></div><div><b>About you</b></div><div>We hope that you care deeply about the quality of your work, the intrinsic worth of tasks, and the success of your team. You are self-disciplined and do not require micromanagement in terms of your skillset and work ethic. You do your best to flourish as an individual every day while working hard to foster a collaborative team environment. You believe in the importance of being — and staying — authentic, honest, positive, and kind. You are a good interlocutor with clear and concise communication. You are able to manage multiple projects, have an analytical mind, pay keen attention to detail, and love to get your hands dirty. You are cognizant, tolerant, and welcoming of vulnerabilities and cultural differences.</div><div><br></div><div><b>About the Role</b></div><div><b>Position</b>: Full-time / Employee</div><div><b>Location:</b>&nbsp;Remote-first </div><div><b>Benefits:</b>&nbsp;Health Insurance, work-from-anywhere stipend, annual wellness &amp; learning credits, annual all-expenses-paid company retreat in a gorgeous destination &amp; other benefits</div><div><br></div><div>Airalo is looking for a talented and motivated <b>Growth Director, North America</b> to join our team and support our rapid growth as we expand into the <b>North American market</b> while building our B2B &amp; B2B2C offerings. In this role, you will have the opportunity to be one of the first local growth leaders to join Airalo, hence defining our brand vision &amp; local team structure moving forward. The ideal candidate should have similar experiences implementing rapid growth structures from scratch &amp; possess a strong passion for Tech, Travel &amp; Telecommunications.&nbsp;</div><h3>Responsibilities include but are not limited to:</h3><li>Work closely with the Chief of Growth and other team members in the department</li><li>Lead, manage, and expand Growth Marketing cross-functional teams with multiple levels of seniority &amp; reporting lines</li><li>Map and implement a full funnel strategy to acquire, retain &amp; upsell/cross-sell user leads at all steps of the travel tech journey</li><li>Guide our user acquisition strategy to maximize our current paid user acquisition channels (Search, Social, Programmatic, Display, and Video) and lead the discovery of new or untapped channels</li><li>Own all growth lifecycle activities based on a quarterly strategy by working with our retention team on tactics, campaigns, initiatives, and improving automation to drive experiments for activation, retention &amp; referral</li><li>Closely collaborate with the User Experience, Brand, and Regional divisions to apply best practices to scale all blog and social content, implementing SEO and ASO strategies, to grow organic lead acquisition</li><li>Oversee the strategy and development of our entire social media ecosystem across key English speaking markets, including creative content, community engagement, and growth</li><li>Develop the strategy and development of our entire influencer marketing ecosystem across key global markets, including overseeing standardization processes and reporting, facilitating knowledge sharing and fostering collaboration with other regional teams</li><li>Plan and execute lead generation campaigns across channels such as Google, Meta, TikTok, or Native Advertising Platforms</li><li>Develop roadmaps to drive the growth of each existing &amp; high-potential innovative channel and lead initiatives to support them</li><li>Implement &amp; monitor proper tracking and attribution to monitor and analyze channel performance on lead volume, cost per lead, and performance down the funnel</li><li>Understand SEO with first-hand experience in creating keyword strategies and drawing competitive analysis identifying opportunities to capture organic traffic.</li>,<h3>Must-Haves: </h3><li>A relevant degree with 7+ years of growth and paid marketing experience in product-led, hyper-growth &amp; fast-paced, B2C, B2B, and/or B2B2C environments</li><li>Effective interpersonal and communication skills, creative and pragmatic skills while collaborating with cross-functional teams &amp; balancing competing priorities, and managing several time-sensitive projects simultaneously</li><li>Subject matter expertise across top paid channels &amp; strategies (ATL/BTL/TTL), including Facebook, Google, TikTok, Instagram, and Programmatic</li><li>Hands-on expertise on the entire marketing tech stack, including CRM tools, Google Analytics, Hotjar, ad platforms, and SEO</li><li>‍Excellent analytical and problem-solving skills with a track record of data-driven approaches to solving complex product &amp; business problems</li><li>Leadership skills; experience in managing cross-functional teams with multiple levels of seniority &amp; reporting lines across different timezones</li>,<h3>Good to Have:</h3><li>Experience working with internet and technology companies</li><li>Experience working with Telco, MNOs &amp; MNVOs</li><li>Verbal/written fluency in additional local/regional languages</li><div><br></div><div>#LI-MF1</div><div>We sincerely thank all applicants in advance for submitting their interest in this opportunity. Airalo is an equal opportunity employer and values diversity, equity &amp; inclusion. We do not discriminate on the basis of race, religion, national origin, gender, sexual orientation, age, marital status, veteran status, or disability status. We are committed to providing reasonable accommodations upon request for individuals with disabilities throughout our job interview process.</div>","tags":"[\"management\",\"b2c\",\"b2b\"]","pubDate":"2025-01-23T14:53:42.886Z","link":"https://jobs.lever.co/airalo/d80640b1-ef47-41e0-923e-5892140543c0","slug":"director-of-growth-north-america-airalo-3451"},{"id":9511887710,"title":"Project Manager with Product Owner Skills | WinTech ","company":"Ruby Labs","image":"https://media.licdn.com/dms/image/v2/D4D0BAQF7VVv61POIFw/company-logo_200_200/company-logo_200_200/0/1721937953426?e=1743033600&v=beta&t=_qAkZ_qGO7Du2NSUdHDNbUKIbz28Y1HDm1g9mwNIOnk","description":"<h1><strong>About us</strong></h1><p style=\"min-height:1.5em\">At WinTech, we are at the forefront of innovation, crafting cutting-edge consumer products that shape the future. Our diverse portfolio spans the health, education, and entertainment sectors, offering exciting opportunities to make a real impact. Our dynamic teams are the driving force behind our success, and we’re always on the lookout for passionate individuals eager to join us on this journey of transformation.</p><p style=\"min-height:1.5em\"></p><h1><strong>About the Role</strong></h1><p style=\"min-height:1.5em\">We are seeking an experienced Project Manager with Product Owner skills to lead multiple projects in our rapidly expanding portfolio. By Q1 2025, you'll be managing three active projects, taking full end-to-end ownership from conception to delivery.</p><p style=\"min-height:1.5em\">The role combines project management and product ownership responsibilities, including detailed task creation, quality assurance, and swift execution across all projects. You'll focus on new product development while maintaining oversight of existing products.</p><p style=\"min-height:1.5em\">We operate in a results-oriented environment where outcomes matter more than hours invested. Our ideal candidate takes full ownership, achieves measurable results, and is driven by excellence rather than timesheets.</p><p style=\"min-height:1.5em\"></p><h1><strong>Key Responsibilities</strong></h1><h3>Team Leadership &amp; Process Management:</h3><ul style=\"min-height:1.5em\"><li><p style=\"min-height:1.5em\">Build and optimize development teams.</p></li><li><p style=\"min-height:1.5em\">Establish efficient project management processes.</p></li><li><p style=\"min-height:1.5em\">Resolve issues independently.</p></li><li><p style=\"min-height:1.5em\">Foster a culture of high performance and continuous improvement.</p></li></ul><h3>Product Development:</h3><ul style=\"min-height:1.5em\"><li><p style=\"min-height:1.5em\">Lead cross-functional teams through product lifecycles.</p></li><li><p style=\"min-height:1.5em\">Manage backlog, sprints, and KPIs.</p></li><li><p style=\"min-height:1.5em\">Create and manage Jira tasks.</p></li><li><p style=\"min-height:1.5em\">Run Agile ceremonies.</p></li><li><p style=\"min-height:1.5em\">Ensure rapid, quality execution.</p></li></ul><h3>Strategic Planning:</h3><ul style=\"min-height:1.5em\"><li><p style=\"min-height:1.5em\">Maintain 2+ week planning horizon.</p></li><li><p style=\"min-height:1.5em\">Set clear priorities and objectives.</p></li><li><p style=\"min-height:1.5em\">Lead team planning sessions.</p></li><li><p style=\"min-height:1.5em\">Document upcoming work.</p></li><li><p style=\"min-height:1.5em\">Identify and address potential blockers.</p></li><li><p style=\"min-height:1.5em\">Apply learnings across products.</p><p style=\"min-height:1.5em\"></p></li></ul><h1><strong>Requirements</strong></h1><h3>Must-Have Hard Skills:</h3><ul style=\"min-height:1.5em\"><li><p style=\"min-height:1.5em\">Proven track record of building and scaling teams from scratch.</p></li><li><p style=\"min-height:1.5em\">Experience in establishing and optimizing development processes.</p></li><li><p style=\"min-height:1.5em\">Strong problem-solving abilities with evidence of independent decision-making.</p></li><li><p style=\"min-height:1.5em\">Expertise in full lifecycle tech product development.</p></li><li><p style=\"min-height:1.5em\">Proficiency in Agile methodologies.</p></li><li><p style=\"min-height:1.5em\">Strong analytical capabilities.</p></li></ul><h3>Must-Have Soft Skills:</h3><ul style=\"min-height:1.5em\"><li><p style=\"min-height:1.5em\">Results-driven mindset.</p></li><li><p style=\"min-height:1.5em\">Exceptional leadership and problem-solving abilities.</p></li><li><p style=\"min-height:1.5em\">Strong decision-making capabilities.</p></li><li><p style=\"min-height:1.5em\">Excellent communication and organizational skills.</p></li><li><p style=\"min-height:1.5em\">Ability to work autonomously.</p></li><li><p style=\"min-height:1.5em\">Adaptability in fast-paced environments.</p><p style=\"min-height:1.5em\"></p></li></ul><h1><strong>Nice to Have</strong></h1><ul style=\"min-height:1.5em\"><li><p style=\"min-height:1.5em\">Experience with subscription-based business model.</p></li><li><p style=\"min-height:1.5em\">Experience in ed-tech or cognitive training industries.</p></li><li><p style=\"min-height:1.5em\">Experience with multiple product launches.</p></li></ul><p style=\"min-height:1.5em\"></p><h1><strong>Location</strong></h1><p style=\"min-height:1.5em\">WinTech operates within the CET (Central European Time) zone. Applicants from any country are welcome to apply for the position as long as they are located within approximately ± 4 hours of CET. This ensures optimal collaboration and communication during working hours.</p><p style=\"min-height:1.5em\"></p><h1><strong>Benefits</strong></h1><ul style=\"min-height:1.5em\"><li><p style=\"min-height:1.5em\">Discover the perks of being part of our vibrant team! We offer:</p></li><li><p style=\"min-height:1.5em\">Remote Work Environment: Embrace the freedom to work from anywhere, anytime, promoting a healthy work-life balance. 🏡⏰</p></li><li><p style=\"min-height:1.5em\">Unlimited PTO: Enjoy unlimited paid time off to recharge and prioritize your well-being, without counting days. 🌴💼</p></li><li><p style=\"min-height:1.5em\">Paid National Holidays: Celebrate and relax on national holidays with paid time off to unwind and recharge. 🎉🌟</p></li><li><p style=\"min-height:1.5em\">Company-provided MacBook: Experience seamless productivity with top-notch Apple MacBooks provided to all employees who need them. 💻🚀</p></li><li><p style=\"min-height:1.5em\">Flexible Independent Contractor Agreement: Unlock the benefits of flexibility, autonomy, and entrepreneurial opportunities. Benefit from tax advantages, networking opportunities, reduced employment obligations, and the freedom to work from anywhere. Read more about it here: <a target=\"_blank\" rel=\"noopener noreferrer nofollow\" href=\"https://docs.google.com/document/d/1dHF4ctKlez75whdn-ybUwP5d5Wr0BdwVrorrm_fM40Q/preview\">https://docs.google.com/document/d/1dHF4ctKlez75whdn-ybUwP5d5Wr0BdwVrorrm_fM40Q/preview</a> 📈💼</p></li></ul><p style=\"min-height:1.5em\">Be part of our fast-growing team and seize this excellent opportunity for personal and professional growth!</p><p style=\"min-height:1.5em\"></p><h1><strong>Interview Process</strong></h1><p style=\"min-height:1.5em\">After submitting your application, we conduct a thorough review which typically takes 3 to 5 days, but may occasionally take longer due to the volume of applications received. If we see a potential fit, we proceed with the following steps:</p><ul style=\"min-height:1.5em\"><li><p style=\"min-height:1.5em\">Recruiter Screening (40 minutes)</p></li><li><p style=\"min-height:1.5em\">Technical Interview (90 minutes)</p></li><li><p style=\"min-height:1.5em\">Final Interview (60 minutes)</p></li></ul><p style=\"min-height:1.5em\"></p><h1><strong>Life at WinTech</strong></h1><p style=\"min-height:1.5em\">At WinTech, you'll join a supportive and collaborative team passionate about excellence and being industry leaders. Our innovative work environment drives impactful business results as we challenge ourselves and elevate each other to achieve new heights.</p><p style=\"min-height:1.5em\">All qualified applicants will receive consideration for employment without regard to sex, gender identity, sexual orientation, race, color, religion, national origin, disability, protected Veteran status, age, or any other characteristic protected by law.</p><p style=\"min-height:1.5em\"></p><p style=\"min-height:1.5em\">#Li-Remote</p>","tags":"[\"management\"]","pubDate":"2025-01-23T09:46:43.464Z","link":"https://jobs.ashbyhq.com/ruby-labs/1dd0e8f1-ddb5-4412-b947-9c09346b5f23","slug":"project-manager-with-product-owner-skills-wintech-ruby-labs-8356"},{"id":9086108672,"title":"Recruitment Lead","company":"Ruby Labs","image":"https://media.licdn.com/dms/image/v2/D4D0BAQF7VVv61POIFw/company-logo_200_200/company-logo_200_200/0/1721937953426?e=1743033600&v=beta&t=_qAkZ_qGO7Du2NSUdHDNbUKIbz28Y1HDm1g9mwNIOnk","description":"<h1><strong>About us</strong></h1><p style=\"min-height:1.5em\">Ruby Labs is a leading tech company that creates and operates innovative consumer products. We offer a diverse range of opportunities across the health, education, and entertainment industries. Our innovative teams are driving the future of consumer-led products, and we're always looking for passionate individuals to join us. Learn more about our story at: <a target=\"_blank\" rel=\"noopener noreferrer nofollow\" href=\"https://rubylabs.com/about-us/\">https://rubylabs.com/about-us/</a></p><p style=\"min-height:1.5em\"></p><h1><strong>About the role</strong></h1><p style=\"min-height:1.5em\">As a Lead Recruiter at Ruby Labs, you’ll shape the future of our organization by driving recruitment strategies across product, marketing, and engineering. Partnering with senior leadership, you’ll attract top global talent and lead a team of recruiters to build a scalable, world-class recruitment function.</p><p style=\"min-height:1.5em\"></p><h1><strong>Who is considered a good Lead Recruiter</strong></h1><p style=\"min-height:1.5em\">An ideal Lead Recruiter is strategic, collaborative, and experienced in global talent acquisition. They excel at partnering with leadership, mentoring recruiters, and aligning recruitment efforts with business growth.</p><p style=\"min-height:1.5em\"></p><h1><strong>Key Responsibilities</strong></h1><ul style=\"min-height:1.5em\"><li><p style=\"min-height:1.5em\">Lead the full-cycle recruitment process, from developing job descriptions and sourcing candidates to managing interviews and overseeing the offer process across multiple departments.</p></li><li><p style=\"min-height:1.5em\">Drive recruitment strategy and execution, ensuring alignment with business goals and hiring needs.</p></li><li><p style=\"min-height:1.5em\">Build and nurture strong relationships with senior leadership and hiring managers, providing strategic insights and guidance to meet hiring goals.</p></li><li><p style=\"min-height:1.5em\">Oversee and mentor a team of recruiters, setting performance goals, providing coaching, and driving continuous improvement.</p></li><li><p style=\"min-height:1.5em\">Develop and implement proactive sourcing strategies to build a strong talent pipeline through various channels including networking events, referrals, social media, and more.</p></li><li><p style=\"min-height:1.5em\">Optimize and manage ATS systems to track performance metrics, enhance process efficiency, and ensure high-quality candidate experiences.</p></li><li><p style=\"min-height:1.5em\">Ensure a seamless candidate experience by providing clear communication, timely feedback, and professional engagement throughout the recruitment process.</p></li><li><p style=\"min-height:1.5em\">Stay ahead of industry trends and labor market insights to continuously improve recruitment strategies and ensure competitive advantage.</p></li><li><p style=\"min-height:1.5em\">Lead employer branding initiatives to position Able as an employer of choice in the global market.</p></li></ul><p style=\"min-height:1.5em\"></p><h1><strong>Qualifications</strong></h1><ul style=\"min-height:1.5em\"><li><p style=\"min-height:1.5em\">5+ years of recruitment experience, with at least 2 years in a leadership or senior recruitment role, preferably in a fast-paced tech environment.</p></li><li><p style=\"min-height:1.5em\">Proven ability to lead full-cycle recruitment processes across multiple disciplines and geographic regions.</p></li><li><p style=\"min-height:1.5em\">Strong experience with ATS platforms (e.g., Greenhouse, Lever, Ashby) and a data-driven approach to improving recruitment performance.</p></li><li><p style=\"min-height:1.5em\">Experienced in recruiting and sourcing tech talent from niche communities like Discord, GitHub, and Reddit, with strong engagement skills.</p></li><li><p style=\"min-height:1.5em\">Exceptional leadership and team management skills, with the ability to mentor, inspire, and develop a team of recruiters.</p></li><li><p style=\"min-height:1.5em\">Strategic mindset with the ability to design and implement recruitment strategies that align with company goals.</p></li><li><p style=\"min-height:1.5em\">Strong organizational, analytical, and project management skills, capable of handling multiple priorities and stakeholders.</p></li><li><p style=\"min-height:1.5em\">Excellent interpersonal and communication skills, with the ability to collaborate effectively with senior leadership and internal teams.</p></li><li><p style=\"min-height:1.5em\">Experience recruiting internationally and managing cross-functional, global hiring processes.</p></li><li><p style=\"min-height:1.5em\">Passion for building high-performing teams and creating an exceptional candidate experience.</p></li><li><p style=\"min-height:1.5em\">Fluency in English (written and verbal), with additional language skills being a plus.</p></li></ul><h1></h1><h1><strong>Location</strong></h1><p style=\"min-height:1.5em\">Ruby Labs operates within the CET (Central European Time) zone. Applicants from any country are welcome to apply for the position as long as they are located within approximately ± 4 hours of CET. This ensures optimal collaboration and communication during working hours.</p><p style=\"min-height:1.5em\"></p><h1><strong>Benefits</strong></h1><p style=\"min-height:1.5em\">Discover the perks of being part of our vibrant team! We offer:</p><ul style=\"min-height:1.5em\"><li><p style=\"min-height:1.5em\"><strong>Remote Work Environment:</strong> Embrace the freedom to work from anywhere, anytime, promoting a healthy work-life balance. 🏡⏰</p></li><li><p style=\"min-height:1.5em\"><strong>Unlimited PTO:</strong> Enjoy unlimited paid time off to recharge and prioritize your well-being, without counting days. 🌴💼</p></li><li><p style=\"min-height:1.5em\"><strong>Paid National Holidays:</strong> Celebrate and relax on national holidays with paid time off to unwind and recharge. 🎉🌟</p></li><li><p style=\"min-height:1.5em\"><strong>Company-provided MacBook:</strong> Experience seamless productivity with top-notch Apple MacBooks provided to all employees who need them. 💻🚀</p></li><li><p style=\"min-height:1.5em\"><strong>Flexible Independent Contractor Agreement:</strong> Unlock the benefits of flexibility, autonomy, and entrepreneurial opportunities. Benefit from tax advantages, networking opportunities, reduced employment obligations, and the freedom to work from anywhere. Read more about it here: <a target=\"_blank\" rel=\"noopener noreferrer nofollow\" href=\"https://docs.google.com/document/d/1dHF4ctKlez75whdn-ybUwP5d5Wr0BdwVrorrm_fM40Q/preview\">https://docs.google.com/document/d/1dHF4ctKlez75whdn-ybUwP5d5Wr0BdwVrorrm_fM40Q/preview</a> 📈💼</p></li></ul><p style=\"min-height:1.5em\">Be part of our fast-growing team and seize this excellent opportunity for personal and professional growth!</p><p style=\"min-height:1.5em\"></p><h1><strong>Interview Process</strong></h1><p style=\"min-height:1.5em\">After submitting your application, we conduct a thorough review which typically takes 3 to 5 days, but may occasionally take longer due to the volume of applications received. If we see a potential fit, we proceed with the following steps:</p><ul style=\"min-height:1.5em\"><li><p style=\"min-height:1.5em\">Recruiter Screening (40 minutes)</p></li><li><p style=\"min-height:1.5em\">Technical Interview (90 minutes)</p></li><li><p style=\"min-height:1.5em\">Final Interview (60 minutes)</p></li></ul><p style=\"min-height:1.5em\"></p><h1><strong>Life at Ruby Labs</strong></h1><p style=\"min-height:1.5em\">At Ruby Labs, we are more than a team; we're a community united in pushing the boundaries of technology and innovation. Our combined passion fuels our ambition for excellence, driving impact that resonates around the globe.</p><p style=\"min-height:1.5em\">We are an equal-opportunity employer and celebrate diversity, recognizing that a diversity of thought and backgrounds builds stronger teams. We approach diversity and inclusion seriously and thoughtfully. We do not discriminate based on race, ethnicity, religion, color, place of birth, sex, gender identity or expression, sexual orientation, age, marital status, military service status, or disability status. Join us and be part of a company that is crafting the future of technology across multiple industries.</p><p style=\"min-height:1.5em\"></p><p style=\"min-height:1.5em\">#Li-Remote</p>","tags":"[\"management\",\"engineering\"]","pubDate":"2025-01-23T09:26:36.695Z","link":"https://jobs.ashbyhq.com/ruby-labs/97151465-5f6c-40b7-a498-ae9d084c2b8d","slug":"recruitment-lead-ruby-labs-2930"},{"id":4034018789,"title":"Job Description","company":"BioRender","image":"https://avatars.githubusercontent.com/u/46490948?s=200&v=4","description":"<p style=\"min-height:1.5em\">At BioRender, we’re on a mission to accelerate the world’s ability to learn, discover, and communicate science — transforming how knowledge is shared and making science open, collaborative, and easily understandable by all. </p><p style=\"min-height:1.5em\"></p><p style=\"min-height:1.5em\">We’re shaping the future of science communication and are looking for talented individuals to help bring this vision to life! 🚀</p><p style=\"min-height:1.5em\"></p><p style=\"min-height:1.5em\">We are looking for a Controller to lead our accounting function, driving the continuous improvement of financial processes and systems to support long-term scalability and growth. In this role, you will ensure strict compliance with all statutory requirements across Canada, the U.S., and international markets, while building a robust foundation for our global operations. You will lead a talented accounting team, oversee daily operations, and drive strategic initiatives that align with our growth objectives.</p><p style=\"min-height:1.5em\"></p><p style=\"min-height:1.5em\"><strong>What you'll be doing </strong></p><ul style=\"min-height:1.5em\"><li><p style=\"min-height:1.5em\">Lead, mentor, and develop a high-performing accounting team of 8, including 5 direct reports, fostering a culture of excellence and continuous improvement.</p></li><li><p style=\"min-height:1.5em\">Oversee all accounting operations, including journal entries, payroll, commissions, accounts payable, accounts receivable, revenue recognition, statutory reporting, banking, and daily operations in accordance with Canadian ASPE.</p></li><li><p style=\"min-height:1.5em\">Ensure adherence to internal controls and company policies, updating financial accounting policies as needed.</p></li><li><p style=\"min-height:1.5em\">Maintain and enforce a monthly close calendar, meeting all deadlines for reconciliations, reporting, and financial analysis.</p></li><li><p style=\"min-height:1.5em\">Prepare consolidated financial statements and lead initiatives to identify operational cost efficiencies.</p></li><li><p style=\"min-height:1.5em\">Lead the automation of accounting system integrations with the CRM, acting as project manager to ensure successful implementation.</p></li></ul><p style=\"min-height:1.5em\"></p><p style=\"min-height:1.5em\"><strong>What you bring to the table </strong></p><ul style=\"min-height:1.5em\"><li><p style=\"min-height:1.5em\">CPA Designation is required.</p></li><li><p style=\"min-height:1.5em\">SaaS Experience: Proven expertise in subscription-based revenue models, including a deep understanding of SaaS financial practices.</p></li><li><p style=\"min-height:1.5em\">Systems Automation &amp; Process Improvement: Strong focus on driving automation and continuously improving financial processes to enhance efficiency and scalability.</p></li><li><p style=\"min-height:1.5em\">Communication Skills: Exceptional ability to convey complex financial concepts clearly to various stakeholders, including non-financial team members.</p></li><li><p style=\"min-height:1.5em\">Advanced Excel Proficiency: Strong skills in Excel, including expertise with functions like VLOOKUP, pivot tables, and data analysis.</p></li><li><p style=\"min-height:1.5em\">Technical Tools Experience: Familiarity with systems such as NetSuite, Stripe, and Salesforce is a strong plus.</p></li></ul><p style=\"min-height:1.5em\"></p><p style=\"min-height:1.5em\"><strong>Why join us?</strong></p><ul style=\"min-height:1.5em\"><li><p style=\"min-height:1.5em\"><strong>We are mission-driven</strong>: we work collaboratively towards our shared vision of improving scientific communication and accelerating scientific discovery. BioRender figures have appeared in more than 54,000 publications! </p></li><li><p style=\"min-height:1.5em\"><strong>BioRender is loved by millions!</strong> We have a world-class NPS and a community of loyal fans and users in 200+ countries!</p></li><li><p style=\"min-height:1.5em\"><strong>Our company is backed by top investors</strong> and accelerators like Y Combinator, and we are on a growth trajectory comparable to many top-performing SaaS companies </p></li><li><p style=\"min-height:1.5em\"><strong>We’re remote-first</strong> with team members across Canada and the U.S., offering you the flexibility to work from anywhere. </p></li></ul><p style=\"min-height:1.5em\"></p><p style=\"min-height:1.5em\">BioRender is an Equal Opportunity Employer. We celebrate diversity and are committed to creating an inclusive environment for all employees. All qualified applicants will receive consideration for employment without regard to race, color, religion, sex, sexual orientation, gender identity, national origin, disability, or veteran status.</p>","tags":"[]","pubDate":"2025-01-23T01:02:39.092Z","link":"https://jobs.ashbyhq.com/biorender/f7a3ea31-5643-4b32-b40a-b2b776ca67cf","slug":"job-description-biorender-5743"},{"id":2793816425,"title":"Compliance Operations Analyst (KYB, AML, KYC)","company":"Pluto Card","image":"https://workablehr.s3.amazonaws.com/uploads/account/logo/548021/logo","description":"<p><strong>About Pluto</strong></p><p>Pluto is the Enterprise Spend Management platform for MENA serving the $30 Trillion+ B2B Payments market. Pluto has been awarded the \"Corporate solutions of the year\" by the Middle Eastern Fintech Association.</p><p>Pluto is backed by some of Silicon Valley’s top-tier venture capital firms. We’ve raised $7M Seed from top investors and operators, including founders from Ramp, Airbase, Plaid, Italic &amp; Senior Leadership at Shopify, Cash App,&nbsp;<a href=\"http://checkout.com/\" target=\"_blank\" rel=\"nofollow noreferrer noopener\" class=\"external\">Checkout.com</a>, Alloy and some of the worlds most successful FinTech VCs like GFC, Graph Ventures, Soma Capital, Adapt Ventures, amongst others who’ve trusted us 🤩</p><p>With the vision of building a modern financial operating system for businesses in MENA, we’re at the tipping point of a fintech revolution. We’re a lean but impactful team that dreams big and believes in making the impossible happen - and we are looking for someone equally motivated who wants to make their mark and help us expand our horizons.</p><p></p><p><strong>About the Role </strong></p><p>We are seeking a detail-oriented and experienced Compliance Operations Analyst to join our dynamic team. The ideal candidate will be responsible for Know Your Customer (KYC), Know Your Business (KYB), and Request for Information (RFI) management. This role is crucial in ensuring that Pluto meets regulatory requirements and maintains the highest standards of compliance.</p><p></p><p><strong>Key Responsibilities:</strong></p><ul> <li><strong>KYC Management:</strong></li> <ul> <li>Conduct thorough due diligence and verification of customer identities.</li> <li>Review and analyze customer information and documentation to ensure compliance with regulatory standards.</li> <li>Monitor and assess the risk level of customers and take appropriate actions.</li> </ul> <li><strong>KYB Management:</strong></li> <ul> <li>Perform business verification processes for corporate clients.</li> <li>Analyze business documentation, including registration details, financial statements, and beneficial ownership.</li> <li>Ensure all business clients adhere to compliance policies and procedures.</li> </ul> <li><strong>RFI Management:</strong></li> <ul> <li>Handle requests for information from regulatory bodies and internal stakeholders.</li> <li>Collect, organize, and present data in response to compliance-related inquiries.</li> <li>Maintain accurate records of all RFI activities and ensure timely responses.</li> </ul> <li><strong>Compliance Monitoring and Reporting:</strong></li> <ul> <li>Prepare and submit reports on compliance onboarding activities and findings.</li> <li>Assist in the development and implementation of compliance policies and procedures.</li> </ul> <li><strong>Customer Relationships</strong></li> <ul> <li>Develop a strong relationship with customers and promote quicker onboarding</li> <li>Work closely with other departments to ensure a cohesive approach to compliance onboarding of customers</li> <li>Provide training and support to customers for all compliance related matters</li> <li>Work closely with account management teams to ensure healthy client relationship</li> <li>Work closely with product and engineering teams to improve our processes continuously</li> </ul> </ul><h3>Requirements: </h3><ul> <li>Minimum of 3 years of experience in a compliance role, preferably within the fintech or financial services industry.</li> <li>Strong knowledge of KYC, KYB, and RFI processes and regulations.</li> <li>Excellent analytical skills and attention to detail.</li> <li>Proficiency in using compliance software and tools.</li> <li>Strong communication and interpersonal skills.</li> <li>Ability to work independently and as part of a team.</li> </ul><h3>Benefits: </h3><ul> <li>Remote Friendly Workplace </li> <li>Frequent team off sites!</li> <li>Bonuses on exceptional performance</li> </ul>","tags":"[\"management\",\"engineering\",\"b2b\"]","pubDate":"2025-01-23T00:00:00.000Z","link":"https://apply.workable.com/pluto-card/j/59E323B837","slug":"compliance-operations-analyst-kyb-aml-kyc-pluto-card-2362"},{"id":5232299946,"title":"Senior Java Developer (worldwide remote, work anywhere)","company":"CloudLinux","image":"https://pbs.twimg.com/profile_images/696718028084482050/ymY3OEPk_400x400.png","description":"<p>CloudLinux is a global remote-first company. We are driven by our principles: do the right thing, employees first, we are remote first, and we deliver high volume, low-cost Linux infrastructure and security products that help companies to increase the efficiency of their operations. Every person on our team supports each other and does what we can to ensure we all are successful.&nbsp;</p><p>We are seeking a Senior Java Developer to join our CLN team.&nbsp;</p><p>CLN is an integral SaaS platform tasked with licensing all CloudLinux products. It manages server operations and oversees the billing process for customers. This is a unique self-provisioning system created by CloudLinux for internal needs. The automated, easy-to-use, robust solution delivers a comprehensive and complete user experience. We will give you a place to strive and grow, where you can work on interesting yet challenging product. Applying your thinking to build a better system founded on intelligent technologies.</p><p>We are truly a great place to work!</p><p>Check out our website for more information<a href=\"https://cloudlinux.com/\" rel=\"nofollow noreferrer noopener\" class=\"external\"> https://cloudlinux.com/</a></p><p></p><p><strong>What you will do:</strong></p><ul> <li>Design and implement backend services, APIs, and scalable solutions using Kotlin|Java and modern frameworks.</li> <li>Work closely with cross-functional teams, including product managers, and other developers, to translate business requirements into technical specifications.</li> <li>Analyze and improve application performance, scalability, and reliability while adhering to best practices in code quality and system design.</li> <li>Ensure adherence to clean code principles, design patterns, and established development standards.</li> <li>Identify and resolve complex technical issues and bugs promptly and efficiently.</li> <li>Keep up-to-date metrics and key indicators of working applications.</li> <li>Suggest improvements to the development process, CI/CD pipelines, and the overall software architecture.</li> <li>Participate in the software testing process.</li> </ul><p></p><p><strong>Our tech stack: </strong>80% Kotlin / 20% Java, Spring Boot, PostgreSQL, Redis, Kafka, Docker, GitLab.</p><h3>Requirements: </h3><ul> <li>5+ years of experience with Java</li> <li>Kotlin experience</li> <li>Proficiency in a microservices architecture.</li> <li>Expertise in Spring Boot (including Data/JPA, MVC, and Security).</li> <li>Hands-on experience with Spring Cloud, PostgreSQL, Redis, Kafka, Docker, and Gradle.</li> <li>Strong experience in writing and maintaining unit tests using frameworks like JUnit or TestNG.</li> <li>Knowledge of integration testing and experience with tools like Mockito, WireMock, or similar.</li> <li>Familiarity with test automation frameworks (e.g., Selenium, RestAssured, or similar) for UI and API testing.</li> </ul><p></p><p><strong>Nice to have:</strong></p><ul> <li>Experience with Docker.</li> <li>Experience with Testcontainers.</li> <li>Experience with performance and load testing tools like JMeter or Gatling is a plus.</li> </ul><h3>Benefits: </h3><p><strong>What's in it for you?</strong></p><ul> <li>A focus on professional development.</li> <li>Interesting and challenging projects.</li> <li>Fully remote work with flexible working hours, that allows you to schedule your day and work from any location worldwide.</li> <li>Paid 24 days of vacation per year, 10 days of national holidays, and unlimited sick leaves.</li> <li>Compensation for private medical insurance.</li> <li>Co-working and gym/sports reimbursement.</li> <li>Budget for education.</li> <li>The opportunity to receive a reward for the most innovative idea that the company can patent.</li> </ul><p><br><br><em>By applying for this position, you consent to the processing of your personal data as described in our Privacy Policy (</em><a href=\"https://cloudlinux.com/candidate-privacy-notice\" rel=\"nofollow noreferrer noopener\" class=\"external\"><em>https://cloudlinux.com/candidate-privacy-notice</em></a><em>), which provides detailed information on how we maintain and handle your data.</em></p>","tags":"[\"postgres\"]","pubDate":"2025-01-23T00:00:00.000Z","link":"https://apply.workable.com/cloudlinux-1/j/EE2288A331","slug":"senior-java-developer-worldwide-remote-work-anywhere-cloudlinux-2881"},{"id":7897778944,"title":"Product Owner - Insurance (Fully Remote)","company":"CoverGo","image":"https://pbs.twimg.com/profile_images/1382655628523364355/MWPIbbID_400x400.jpg","description":"<h3><strong>Top 3 Reasons To Join Us</strong></h3><ul> <li>Competitive Salary</li> <li>International Environment</li> <li>Working on the latest tech for the Insurtech Market Leader</li> </ul><h3><strong>About Us</strong></h3><p>At CoverGo, our mission is to empower all insurance companies to make insurance 100% digital and accessible to everyone.</p><ul> <li>We are a leading global no-code insurance platform for health, life, and P&amp;C</li> <li>We’re the winner of the Insurtech of the Year in all of Asia and other awards globally</li> <li>We work with insurance enterprise clients such as AXA, Bupa, MSIG, Dai-ichi, Bank of China Group Insurance, and many more</li> <li>We're an international, diverse team of over 120 people with 30 nationalities and team members working remotely from all over the world</li> <li>We are fully funded and backed by reputable VC funds and strategic institutional investors</li> <li>We have a global presence in Asia, EMEA and the Americas</li> <li>We’ve grown our annualized revenue by over 30x since January 2021</li> <li>We’re constantly working towards making CoverGo a workplace that you love coming to. We deeply believe that bringing together a diversity of thoughts, expressions, and perspectives is key to building the best culture for equally diverse communities all over the world</li> </ul><p><strong>About the Role:&nbsp;</strong></p><p>As a Product Owner for our core health insurance system, you will play a pivotal role in shaping the evolution of our policy servicing module. Acting as the bridge between stakeholders and development teams, you will refine requirements, define product features, and drive the delivery of high-quality, impactful solutions that address the unique challenges of the health insurance industry. With a strong focus on user needs, collaboration, and accountability, you will help us build products that meet market demands while ensuring compliance with regulatory standards. This role requires a proactive approach, balancing technical depth, strategic thinking, and effective communication in a distributed working environment.</p><h3>What You Will Do:</h3><ol> <li>Backlog &amp; Feature Management:</li> <ol> <li>Define and prioritize the product backlog to reflect business value, market trends, and customer requirements.</li> <li>Collaborate closely with stakeholders to gather detailed requirements and ensure alignment on priorities.</li> <li>Translate high-level objectives into detailed, actionable user stories with clear acceptance criteria.</li> </ol> <li>Collaboration &amp; Team Engagement:</li> <ol> <li>Serve as the key point of contact between local and remote development teams, ensuring clear communication and smooth execution of deliverables.</li> <li>Work alongside cross-functional teams (e.g., engineering, QA, design) to refine features and deliver exceptional user experiences.</li> </ol> <li>Domain Expertise:</li> <ol> <li>Leverage your knowledge of health insurance and policy servicing to guide product development and ensure relevance to market needs.</li> <li>Stay informed about health insurance regulations and compliance requirements to ensure all deliverables meet legal standards.</li> </ol> <li>Agile Leadership:</li> <ol> <li>Actively participate in Agile ceremonies such as sprint planning, reviews, and retrospectives.</li> <li>Provide clear guidance to the development team, proactively addressing roadblocks and ensuring focus on priorities.</li> </ol> <li>Data-Driven Decision Making:</li> <ol> <li>Define and track KPIs to measure product success and identify opportunities for improvement.</li> <li>Conduct regular market research and competitor analysis to inform product innovation.</li> </ol> <li>Stakeholder Engagement:</li> <ol> <li>Build strong relationships with internal and external stakeholders, managing expectations and providing regular updates on progress.</li> <li>Act as the voice of the customer, championing their needs throughout the product lifecycle.</li> </ol> <li>Strategic Roadmap Ownership:</li> <ol> <li>Drive the product roadmap for the policy servicing module, balancing immediate deliverables with long-term strategic goals.</li> <li>Align product goals with business objectives and communicate them effectively across the organization.</li> </ol> </ol><h3>What We Need:</h3><ul> <li>Experience &amp; Knowledge:</li> <ul> <li>Bachelor’s degree in Computer Science, Business, or a related field (advanced degree preferred).</li> <li>Minimum 5 years of experience as a Product Owner, with at least 3 years focused on insurtech or health insurance systems.</li> <li>Demonstrated success managing end-to-end product development in complex, multi-stakeholder environments.</li> <li>Strong understanding of health insurance products, policy servicing, and regulatory requirements.</li> </ul> <li>Skills &amp; Competencies:</li> <ul> <li>Exceptional communication and interpersonal skills, with the ability to work effectively with distributed teams.</li> <li>Proven expertise in Agile methodologies, backlog management, and using tools like Jira, Confluence, or Trello.</li> <li>Analytical mindset with a track record of making data-driven decisions to optimize product performance.</li> <li>Knowledge of UX/UI principles and experience collaborating with design teams to enhance user experiences.</li> <li>Familiarity with tools and practices for remote collaboration (e.g., Slack, Miro, Figma).</li> </ul> <li>Mindset &amp; Leadership:</li> <ul> <li>Self-starter with a strong sense of ownership and accountability.</li> <li>Comfortable working in a distributed team environment and managing competing priorities.</li> <li>Passionate about driving innovation in the health insurance industry and solving complex challenges.</li> </ul> <li>Currently based in Ho Chi Minh City, Vietnam </li> </ul><h3><strong>Why You'll Love Working Here</strong></h3><ul> <li>Flexible Leave</li> <li>International Environment</li> <li>Competitive renumeration package</li> <li>Performance Bonus</li> <li>Stock Options after 6 months </li> <li>Company activities and events</li> <li>Learning and development plan</li> </ul><p><strong>CoverGo Company </strong><a href=\"https://www.youtube.com/watch?v=YI0ezLxvFvA\" rel=\"nofollow noreferrer noopener\" class=\"external\"><strong>Video</strong></a></p><p>By submitting your application, you confirm that you have read, understood, and accepted the content of CoverGo’s <a href=\"https://apply.workable.com/covergo/gdpr_policy?lng=en\" target=\"_blank\" rel=\"nofollow noreferrer noopener\" class=\"external\">Privacy Notice</a> and you consent to the processing of your data as part of this application.</p><p><a href=\"https://www.youtube.com/watch?v=YI0ezLxvFvA\" rel=\"nofollow noreferrer noopener\" class=\"external\"></a></p><h3>Requirements: </h3><h3>Benefits: </h3>","tags":"[\"management\",\"engineering\",\"legal\"]","pubDate":"2025-01-23T00:00:00.000Z","link":"https://apply.workable.com/covergo/j/8186776752","slug":"product-owner-insurance-fully-remote-covergo-9534"}]