[{"id":7239690235,"title":"Senior Product Designer, AI Figure","company":"BioRender","image":"https://avatars.githubusercontent.com/u/46490948?s=200&v=4","description":"<p style=\"min-height:1.5em\">At BioRender, our mission is to accelerate the world’s ability to learn, discover, and communicate science. We are passionate about democratizing science communication in order to accelerate scientific discovery and understanding. We're looking for amazing people to help create the world’s go-to-place where science is communicated. Come join us!</p><p style=\"min-height:1.5em\"></p><p style=\"min-height:1.5em\">You can think of BioRender as the “Figma or Canva for scientists,” with a suite of web-based graphics communication products that empower scientists to create beautiful scientific visuals and presentations with ease.</p><p style=\"min-height:1.5em\"></p><p style=\"min-height:1.5em\">As the AI product manager at BioRender, you will be responsible for leading a team to build AI backed figure generation features that accelerate how millions of scientists all over the world communicate their scientific breakthroughs and discoveries.</p><p style=\"min-height:1.5em\"></p><p style=\"min-height:1.5em\"><strong>What you'll be doing </strong></p><ul style=\"min-height:1.5em\"><li><p style=\"min-height:1.5em\">Within the first 90 days, become an expert on our users, their usage behaviors, and scientists’ typical research workflows. Understanding the user and our product offering will be critical to your success.</p></li><li><p style=\"min-height:1.5em\">Drive development, communication, and execution of the vision for our AI-backed figure generation and illustration capabilities.</p></li><li><p style=\"min-height:1.5em\">Own and be accountable for the product roadmap, measurement of success, and operations for our AI figure generation features.</p></li><li><p style=\"min-height:1.5em\">Identify opportunities for other product teams at BioRender to take advantage of the work of your team and influence them to do that.</p></li><li><p style=\"min-height:1.5em\">Contribute to the team and processes that enable BioRender to be an exceptional product management organization.</p></li></ul><p style=\"min-height:1.5em\"><strong>What you bring to the table </strong></p><ul style=\"min-height:1.5em\"><li><p style=\"min-height:1.5em\">5+ years of direct ML and/or AI product management experience, ideally in a fast growing SaaS startup environment. You’ve built an AI product and know how to apply AI/ML technology to deliver real user value. You’ve had to pivot quickly to build that product in the rapidly changing technology landscape of the past couple of years.</p></li><li><p style=\"min-height:1.5em\">Because AI represents a step function change, you constantly rethink how to use new technology to get a user to finish their job to be done faster and better than they ever could before. As a part of that, you experiment with and use AI to improve the workflows for you and your team.</p></li><li><p style=\"min-height:1.5em\">You have a demonstrated ability to make your vision a reality. You motivate your team with business impact oriented goals and hold yourself accountable for your team to achieve them.</p></li><li><p style=\"min-height:1.5em\">You’re a team player with an edge. You collaborate well but aren’t afraid to challenge ideas, including your own, to get to the best solution.</p></li><li><p style=\"min-height:1.5em\">You are an expert at bringing together qualitative user insights and quantitative data to make the most effective product decisions.</p></li><li><p style=\"min-height:1.5em\">You are a simple and clear communicator. You take the time to write the short document instead of sending the long one.</p></li><li><p style=\"min-height:1.5em\">You have a passion for our mission, vision, and product. Building software that delights scientists is hard work, you should enjoy it!</p></li></ul><ul style=\"min-height:1.5em\"><li><p style=\"min-height:1.5em\">A background or experience in life sciences is a really big plus, but not required, however a curiosity and desire to learn about science and scientists is required!</p></li></ul><p style=\"min-height:1.5em\"></p><p style=\"min-height:1.5em\"><strong>Why join us?</strong></p><ul style=\"min-height:1.5em\"><li><p style=\"min-height:1.5em\"><strong>We are mission-driven</strong>: we work collaboratively towards our shared vision of improving scientific communication and accelerating scientific discovery. BioRender figures have appeared in more than 54,000 publications! </p></li><li><p style=\"min-height:1.5em\"><strong>BioRender is loved by millions!</strong> We have a world-class NPS and a community of loyal fans and users in 200+ countries!</p></li><li><p style=\"min-height:1.5em\"><strong>Our company is backed by top investors</strong> and accelerators like Y Combinator, and we are on a growth trajectory comparable to many top-performing SaaS companies </p></li><li><p style=\"min-height:1.5em\"><strong>We’re remote-first</strong> with team members across Canada and the U.S., offering you the flexibility to work from anywhere. </p></li></ul><p style=\"min-height:1.5em\"></p><p style=\"min-height:1.5em\">BioRender is an Equal Opportunity Employer. We celebrate diversity and are committed to creating an inclusive environment for all employees. All qualified applicants will receive consideration for employment without regard to race, color, religion, sex, sexual orientation, gender identity, national origin, disability, or veteran status.</p>","tags":"[\"management\"]","pubDate":"2025-04-01T05:26:16.106Z","link":"https://jobs.ashbyhq.com/biorender/d3e3024b-31b6-4e7b-b5c9-989d32e3d266","slug":"senior-product-designer-ai-figure-biorender-6989"},{"id":8487265059,"title":"Senior Product Designer, Enterprise","company":"BioRender","image":"https://avatars.githubusercontent.com/u/46490948?s=200&v=4","description":"<p style=\"min-height:1.5em\">At BioRender, our mission is to accelerate the world’s ability to learn, discover, and communicate science. We are passionate about democratizing science communication in order to accelerate scientific discovery and understanding. We're looking for amazing people to help create the world’s go-to-place where science is communicated. Come join us!</p><p style=\"min-height:1.5em\"></p><p style=\"min-height:1.5em\">You can think of BioRender as the “Figma or Canva for scientists,” with a suite of web-based graphics communication products that empower scientists to create beautiful scientific visuals and presentations with ease.</p><p style=\"min-height:1.5em\"></p><p style=\"min-height:1.5em\">Our product team focuses on a few core missions: building the best communication tools for the scientist end-user, enabling groups of scientists to work well together, and a self-service product led growth motion. We’re deeply user obsessed and have a best in class end-user net promoter score (NPS) that we’re very proud of.</p><p style=\"min-height:1.5em\"></p><p style=\"min-height:1.5em\">As the enterprise product manager at BioRender, you will be responsible for leading a team to build features that millions of scientists all over the world will use to work together and communicate their scientific breakthroughs and discoveries.</p><p style=\"min-height:1.5em\"></p><p style=\"min-height:1.5em\"><strong>What you'll be doing </strong></p><ul style=\"min-height:1.5em\"><li><p style=\"min-height:1.5em\">Within the first 90 days, become an expert on our users, their usage behaviors, and scientists’ typical research workflows. Understanding the user and our product offering will be critical to your success.</p></li><li><p style=\"min-height:1.5em\">Drive development, communication, and execution of the vision for our enterprise application and content offerings targeted at larger industry and academic organizations.</p></li><li><p style=\"min-height:1.5em\">Own and be accountable for the product roadmap, measurement of success, and operations for our Enterprise products and features.</p></li><li><p style=\"min-height:1.5em\">Partner with our go-to-market team and work directly with the largest industry and academic research organizations in the world so that you can build the right products and features for them.</p></li><li><p style=\"min-height:1.5em\">Contribute to the team and processes that enable BioRender to be an exceptional product management organization.</p></li></ul><p style=\"min-height:1.5em\"><strong>What you bring to the table </strong></p><ul style=\"min-height:1.5em\"><li><p style=\"min-height:1.5em\">5+ years of enterprise product management experience, ideally at a fast growing B2B focused SaaS startup</p></li><li><p style=\"min-height:1.5em\">You experiment with and use AI to improve your own professional workflows.</p></li><li><p style=\"min-height:1.5em\">You have a demonstrated ability to motivate your team with business impact oriented goals and hold yourself accountable for your team to achieve them.</p></li></ul><ul style=\"min-height:1.5em\"><li><p style=\"min-height:1.5em\">You’re a team player with an edge. You collaborate well but aren’t afraid to challenge ideas, including your own, to get to the best solution.</p></li></ul><ul style=\"min-height:1.5em\"><li><p style=\"min-height:1.5em\">You are an expert at bringing together qualitative user insights and quantitative data to make the most effective product decisions.</p></li><li><p style=\"min-height:1.5em\">You are a simple and clear communicator. You take the time to write the short document instead of sending the long one.</p></li><li><p style=\"min-height:1.5em\">You have a passion for our mission, vision, and product. Building software that delights scientists is hard work, you should enjoy it!</p></li></ul><ul style=\"min-height:1.5em\"><li><p style=\"min-height:1.5em\">A background or experience in life sciences is a plus, but not required, however a curiosity and desire to learn about science and scientists is required!</p></li></ul><p style=\"min-height:1.5em\"></p><p style=\"min-height:1.5em\"><strong>Why join us?</strong></p><ul style=\"min-height:1.5em\"><li><p style=\"min-height:1.5em\"><strong>We are mission-driven</strong>: we work collaboratively towards our shared vision of improving scientific communication and accelerating scientific discovery. BioRender figures have appeared in more than 54,000 publications! </p></li><li><p style=\"min-height:1.5em\"><strong>BioRender is loved by millions!</strong> We have a world-class NPS and a community of loyal fans and users in 200+ countries!</p></li><li><p style=\"min-height:1.5em\"><strong>Our company is backed by top investors</strong> and accelerators like Y Combinator, and we are on a growth trajectory comparable to many top-performing SaaS companies </p></li><li><p style=\"min-height:1.5em\"><strong>We’re remote-first</strong> with team members across Canada and the U.S., offering you the flexibility to work from anywhere. </p></li></ul><p style=\"min-height:1.5em\"></p><p style=\"min-height:1.5em\">BioRender is an Equal Opportunity Employer. We celebrate diversity and are committed to creating an inclusive environment for all employees. All qualified applicants will receive consideration for employment without regard to race, color, religion, sex, sexual orientation, gender identity, national origin, disability, or veteran status.</p>","tags":"[\"management\",\"b2b\"]","pubDate":"2025-04-01T05:22:16.910Z","link":"https://jobs.ashbyhq.com/biorender/1917ab96-b468-4890-b26f-2301f9548cff","slug":"senior-product-designer-enterprise-biorender-7443"},{"id":3118449113,"title":"Ads Sales Representative - Contractor","company":"Kit","image":"https://avatars.githubusercontent.com/u/10557747?s=200&v=4","description":"&lt;div class=&quot;content-intro&quot;&gt;&lt;h4&gt;Description&lt;/h4&gt;\n&lt;div&gt;\n&lt;p class=&quot;p1&quot;&gt;Kit is an email-first operating system for creators who mean business. We help creators grow and monetize their audience with ease. For coaches, YouTubers, authors, podcasters, and other creatives, there isn’t a better marketing hub to rely on to grow audiences, automate email marketing, and sell digital products - all within one platform. More importantly, there isn’t a team more committed to helping creators earn a living.&lt;/p&gt;\n&lt;p&gt;We’re on a mission to help creators earn $1 billion using our creator marketing platform. We have always been 100% independent and 100% remote. We are proud to have built a product that our customers love, and we look for people who have enthusiasm and belief in our mission, vision, and values to join our team.&lt;/p&gt;\n&lt;p&gt;The Kit culture is one where emotional intelligence is valued, radical candor is encouraged, and where everyone works together to uphold a set of shared team principles.&lt;/p&gt;\n&lt;hr&gt;\n&lt;p&gt;&amp;nbsp;&lt;/p&gt;\n&lt;/div&gt;&lt;/div&gt;&lt;h4&gt;&lt;strong&gt;The Role&lt;/strong&gt;&lt;/h4&gt;\n&lt;p&gt;As a &lt;strong&gt;Kit Ads Sales Representative&lt;/strong&gt;, you will identify and sell to prospective advertisers to fuel the growth of our creator network. You’ll develop lasting relationships with brands—helping them become evergreen sponsors in the Kit ecosystem—while staying attuned to their marketing goals and translating those objectives into tailored sponsorship opportunities. You thrive on connecting the right brands with the right creators, and you’re motivated by our mission to help creators earn a living online.&lt;/p&gt;\n&lt;p&gt;You’ll report into the Head of Kit Ads and collaborate closely with internal stakeholders across the company (Creator Reps, Marketing, Product, Finance) to meet and exceed quarterly revenue targets. If you’re passionate about advertising, have a knack for cultivating connections, and enjoy juggling multiple sales cycles in a fast-paced environment, this role is for you.&lt;/p&gt;\n&lt;h4&gt;&lt;strong&gt;Responsibilities&lt;/strong&gt;&lt;/h4&gt;\n&lt;p&gt;As the Ads Sales Representative on the Kit Ads team, you will:&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;&lt;strong&gt;Prospect and build strong advertiser relationships&lt;/strong&gt;&lt;strong&gt;&lt;br&gt;&lt;/strong&gt;Conduct outbound outreach and manage inbound leads, forging genuine connections with brands to understand their marketing objectives and challenges.&lt;/li&gt;\n&lt;li&gt;&lt;strong&gt;Meet (and exceed) revenue targets&lt;/strong&gt;&lt;strong&gt;&lt;br&gt;&lt;/strong&gt;Own quarterly and annual sales goals; proactively communicate pipeline updates, challenges, and successes to the Kit Ads team.&lt;/li&gt;\n&lt;li&gt;&lt;strong&gt;Deliver integrated campaign strategies&lt;/strong&gt;&lt;strong&gt;&lt;br&gt;&lt;/strong&gt;Ingest advertiser objectives—ranging from brand awareness to direct response—and craft campaign plans that yield measurable results for advertisers, creators, and their audiences.&lt;/li&gt;\n&lt;li&gt;&lt;strong&gt;Manage the end-to-end sales cycle&lt;/strong&gt;&lt;strong&gt;&lt;br&gt;&lt;/strong&gt;Identify potential advertisers, pitch new opportunities, negotiate terms (including CPC, CPM, or hybrid models), finalize insertion orders, and ensure proper billing and credit adherence.&lt;/li&gt;\n&lt;li&gt;&lt;strong&gt;Collaborate with internal stakeholders&lt;/strong&gt;&lt;strong&gt;&lt;br&gt;&lt;/strong&gt;Work hand-in-hand with Creator Reps, Marketing,Finance, and Product teams to refine deal structures, stay up-to-date on product offerings, and resolve finance or platform questions swiftly.&lt;/li&gt;\n&lt;li&gt;&lt;strong&gt;Maintain detailed records and processes&lt;/strong&gt;&lt;strong&gt;&lt;br&gt;&lt;/strong&gt;Document all advertiser details, meeting notes, proposals, and deal progress in HubSpot and relevant platforms (Gong, Slack, etc)&lt;/li&gt;\n&lt;li&gt;&lt;strong&gt;Uphold consistent sales activity goals&lt;/strong&gt;&lt;strong&gt;&lt;br&gt;&lt;/strong&gt;Conduct client meetings, prospect to ~40–50 prospects per week, and deliver 40–50 proposals monthly—continuously refining outreach tactics based on performance.&lt;/li&gt;\n&lt;li&gt;&lt;strong&gt;Iterate and improve sales playbooks&lt;/strong&gt;&lt;strong&gt;&lt;br&gt;&lt;/strong&gt;Explore new strategies, share learnings with the team, and champion best practices that enhance the efficiency and effectiveness of our sales approach.&lt;/li&gt;\n&lt;li&gt;&lt;strong&gt;Foster repeat business and brand loyalty&lt;/strong&gt;&lt;strong&gt;&lt;br&gt;&lt;/strong&gt;Drive meaningful results that encourage satisfied advertisers to scale campaigns and become ongoing partners in the Kit Ads network.&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;&lt;strong&gt;Requirements/Desired Skills&lt;/strong&gt;&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;Strong digital advertising or marketing experience in a dynamic, fast-moving environment—strong understanding of both brand and performance-based models (including CPC, CPM, etc.)&amp;nbsp;&lt;/li&gt;\n&lt;li&gt;Skilled in consultative monetization; adept at analyzing performance data, recommending ad strategies, and optimizing outcomes for both creators and advertisers&lt;/li&gt;\n&lt;li&gt;Outstanding relationship-building abilities; proven success collaborating with content creators and brand partners to align multiple stakeholders’ goals&lt;/li&gt;\n&lt;li&gt;Proven track record in meeting or surpassing revenue targets, with strong organizational and project management skills to juggle multiple campaigns, develop workflows, and meet deadlines&lt;/li&gt;\n&lt;li&gt;Exceptional communication skills; able to synthesize complex information, present clearly, and tailor messaging to diverse audiences—from creators and sales teams to brand partners and executives&lt;/li&gt;\n&lt;li&gt;Proficiency with CRM tools and ad tech platforms; detail-oriented and eager to learn new software quickly&lt;/li&gt;\n&lt;li&gt;High degree of adaptability; thrives in a fast-paced, iterative environment and proactively seeks new opportunities for growth&lt;/li&gt;\n&lt;li&gt;Comfortable enforcing program guidelines, addressing compliance issues, and escalating concerns effectively to protect brand integrity and ensure alignment with platform policies&lt;/li&gt;\n&lt;li&gt;Proactive problem solver who excels in creating, refining, and following processes to streamline operations, anticipate challenges, and innovate solutions&lt;/li&gt;\n&lt;li&gt;Enthusiastic about empowering creators to earn a living; motivated to craft advertising solutions that benefit brands, creators, and their audiences&lt;/li&gt;\n&lt;/ul&gt;\n&lt;h4&gt;&lt;strong&gt;Compensation&lt;/strong&gt;&amp;nbsp;&lt;/h4&gt;\n&lt;p&gt;This is a contract position with a monthly retainer of $5,833. Commissions start at 2.5% and can grow to as quotas are exceeded. On-target earnings are $125,000 in 12 months with room to earn more. The initial contract will be for a six-month period with a mid-contract review to evaluate the work completed and decide on a possible contract extension.&lt;/p&gt;\n&lt;h4&gt;&lt;strong&gt;How to Apply&lt;/strong&gt;&lt;/h4&gt;\n&lt;p&gt;We usually receive a large number of applications, and our goal is to follow up with you within two weeks. You’ll hear from us either way. Here’s what you can expect from the rest of our hiring process:&lt;/p&gt;\n&lt;ol&gt;\n&lt;li&gt;30 min - Recruiter screen&lt;/li&gt;\n&lt;li&gt;30 min - Hiring manager screen&lt;/li&gt;\n&lt;li&gt;45 min - Mock pitch (30 min pitch + 15 min convo)&lt;/li&gt;\n&lt;/ol&gt;\n&lt;p&gt;We’ll keep you informed through every step. To get started, complete this application, including a cover letter and answers to the questions on the next page. We read every single application, and your cover letter and responses help put your experience into context.&lt;/p&gt;&lt;div class=&quot;content-conclusion&quot;&gt;&lt;hr&gt;\n&lt;p&gt;&amp;nbsp;&lt;/p&gt;\n&lt;p&gt;Kit is an equal opportunity employer. We value diversity in all of its forms, and we hire the best person we can for each role, no matter your personal background. Research tells us that applicants who are female or non-binary, as well as applicants who are people of color, are less likely to apply for roles they do not feel 100% qualified for. If you think you meet more than 50% of our requirements but fewer than 100% of them, please apply. We’re imperfect communicators, so think of our job postings as the starting point for discussion rather than proof that you shouldn’t apply.&lt;/p&gt;\n&lt;p&gt;Kit does not discriminate on the basis of race, sex, color, religion, age, national origin, marital status, disability, veteran status, genetic information, sexual orientation, gender identity or any other reason prohibited by law in provision of employment opportunities and benefits.&lt;/p&gt;&lt;/div&gt;","tags":"[\"finance\",\"management\"]","pubDate":"2025-04-01T00:27:08.000Z","link":"https://job-boards.greenhouse.io/kit/jobs/4694180007","slug":"ads-sales-representative-contractor-kit-7447"},{"id":1192647548,"title":"Ads Sales Representative - Contractor","company":"Kit","image":"https://avatars.githubusercontent.com/u/10557747?s=200&v=4","description":"&lt;div class=&quot;content-intro&quot;&gt;&lt;h4&gt;Description&lt;/h4&gt;\n&lt;div&gt;\n&lt;p class=&quot;p1&quot;&gt;Kit is an email-first operating system for creators who mean business. We help creators grow and monetize their audience with ease. For coaches, YouTubers, authors, podcasters, and other creatives, there isn’t a better marketing hub to rely on to grow audiences, automate email marketing, and sell digital products - all within one platform. More importantly, there isn’t a team more committed to helping creators earn a living.&lt;/p&gt;\n&lt;p&gt;We’re on a mission to help creators earn $1 billion using our creator marketing platform. We have always been 100% independent and 100% remote. We are proud to have built a product that our customers love, and we look for people who have enthusiasm and belief in our mission, vision, and values to join our team.&lt;/p&gt;\n&lt;p&gt;The Kit culture is one where emotional intelligence is valued, radical candor is encouraged, and where everyone works together to uphold a set of shared team principles.&lt;/p&gt;\n&lt;hr&gt;\n&lt;p&gt;&amp;nbsp;&lt;/p&gt;\n&lt;/div&gt;&lt;/div&gt;&lt;h4&gt;&lt;strong&gt;The Role&lt;/strong&gt;&lt;/h4&gt;\n&lt;p&gt;As a &lt;strong&gt;Kit Ads Sales Representative&lt;/strong&gt;, you will identify and sell to prospective advertisers to fuel the growth of our creator network. You’ll develop lasting relationships with brands—helping them become evergreen sponsors in the Kit ecosystem—while staying attuned to their marketing goals and translating those objectives into tailored sponsorship opportunities. You thrive on connecting the right brands with the right creators, and you’re motivated by our mission to help creators earn a living online.&lt;/p&gt;\n&lt;p&gt;You’ll report into the Head of Kit Ads and collaborate closely with internal stakeholders across the company (Creator Reps, Marketing, Product, Finance) to meet and exceed quarterly revenue targets. If you’re passionate about advertising, have a knack for cultivating connections, and enjoy juggling multiple sales cycles in a fast-paced environment, this role is for you.&lt;/p&gt;\n&lt;h4&gt;&lt;strong&gt;Responsibilities&lt;/strong&gt;&lt;/h4&gt;\n&lt;p&gt;As the Ads Sales Representative on the Kit Ads team, you will:&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;&lt;strong&gt;Prospect and build strong advertiser relationships&lt;/strong&gt;&lt;strong&gt;&lt;br&gt;&lt;/strong&gt;Conduct outbound outreach and manage inbound leads, forging genuine connections with brands to understand their marketing objectives and challenges.&lt;/li&gt;\n&lt;li&gt;&lt;strong&gt;Meet (and exceed) revenue targets&lt;/strong&gt;&lt;strong&gt;&lt;br&gt;&lt;/strong&gt;Own quarterly and annual sales goals; proactively communicate pipeline updates, challenges, and successes to the Kit Ads team.&lt;/li&gt;\n&lt;li&gt;&lt;strong&gt;Deliver integrated campaign strategies&lt;/strong&gt;&lt;strong&gt;&lt;br&gt;&lt;/strong&gt;Ingest advertiser objectives—ranging from brand awareness to direct response—and craft campaign plans that yield measurable results for advertisers, creators, and their audiences.&lt;/li&gt;\n&lt;li&gt;&lt;strong&gt;Manage the end-to-end sales cycle&lt;/strong&gt;&lt;strong&gt;&lt;br&gt;&lt;/strong&gt;Identify potential advertisers, pitch new opportunities, negotiate terms (including CPC, CPM, or hybrid models), finalize insertion orders, and ensure proper billing and credit adherence.&lt;/li&gt;\n&lt;li&gt;&lt;strong&gt;Collaborate with internal stakeholders&lt;/strong&gt;&lt;strong&gt;&lt;br&gt;&lt;/strong&gt;Work hand-in-hand with Creator Reps, Marketing,Finance, and Product teams to refine deal structures, stay up-to-date on product offerings, and resolve finance or platform questions swiftly.&lt;/li&gt;\n&lt;li&gt;&lt;strong&gt;Maintain detailed records and processes&lt;/strong&gt;&lt;strong&gt;&lt;br&gt;&lt;/strong&gt;Document all advertiser details, meeting notes, proposals, and deal progress in HubSpot and relevant platforms (Gong, Slack, etc)&lt;/li&gt;\n&lt;li&gt;&lt;strong&gt;Uphold consistent sales activity goals&lt;/strong&gt;&lt;strong&gt;&lt;br&gt;&lt;/strong&gt;Conduct client meetings, prospect to ~40–50 prospects per week, and deliver 40–50 proposals monthly—continuously refining outreach tactics based on performance.&lt;/li&gt;\n&lt;li&gt;&lt;strong&gt;Iterate and improve sales playbooks&lt;/strong&gt;&lt;strong&gt;&lt;br&gt;&lt;/strong&gt;Explore new strategies, share learnings with the team, and champion best practices that enhance the efficiency and effectiveness of our sales approach.&lt;/li&gt;\n&lt;li&gt;&lt;strong&gt;Foster repeat business and brand loyalty&lt;/strong&gt;&lt;strong&gt;&lt;br&gt;&lt;/strong&gt;Drive meaningful results that encourage satisfied advertisers to scale campaigns and become ongoing partners in the Kit Ads network.&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;&lt;strong&gt;Requirements/Desired Skills&lt;/strong&gt;&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;Strong digital advertising or marketing experience in a dynamic, fast-moving environment—strong understanding of both brand and performance-based models (including CPC, CPM, etc.)&amp;nbsp;&lt;/li&gt;\n&lt;li&gt;Skilled in consultative monetization; adept at analyzing performance data, recommending ad strategies, and optimizing outcomes for both creators and advertisers&lt;/li&gt;\n&lt;li&gt;Outstanding relationship-building abilities; proven success collaborating with content creators and brand partners to align multiple stakeholders’ goals&lt;/li&gt;\n&lt;li&gt;Proven track record in meeting or surpassing revenue targets, with strong organizational and project management skills to juggle multiple campaigns, develop workflows, and meet deadlines&lt;/li&gt;\n&lt;li&gt;Exceptional communication skills; able to synthesize complex information, present clearly, and tailor messaging to diverse audiences—from creators and sales teams to brand partners and executives&lt;/li&gt;\n&lt;li&gt;Proficiency with CRM tools and ad tech platforms; detail-oriented and eager to learn new software quickly&lt;/li&gt;\n&lt;li&gt;High degree of adaptability; thrives in a fast-paced, iterative environment and proactively seeks new opportunities for growth&lt;/li&gt;\n&lt;li&gt;Comfortable enforcing program guidelines, addressing compliance issues, and escalating concerns effectively to protect brand integrity and ensure alignment with platform policies&lt;/li&gt;\n&lt;li&gt;Proactive problem solver who excels in creating, refining, and following processes to streamline operations, anticipate challenges, and innovate solutions&lt;/li&gt;\n&lt;li&gt;Enthusiastic about empowering creators to earn a living; motivated to craft advertising solutions that benefit brands, creators, and their audiences&lt;/li&gt;\n&lt;/ul&gt;\n&lt;h4&gt;&lt;strong&gt;Compensation&lt;/strong&gt;&amp;nbsp;&lt;/h4&gt;\n&lt;p&gt;This is a contract position with a monthly retainer of $5,833. Commissions start at 2.5% and can grow to as quotas are exceeded. On-target earnings are $125,000 in 12 months with room to earn more. The initial contract will be for a six-month period with a mid-contract review to evaluate the work completed and decide on a possible contract extension.&lt;/p&gt;\n&lt;h4&gt;&lt;strong&gt;How to Apply&lt;/strong&gt;&lt;/h4&gt;\n&lt;p&gt;We usually receive a large number of applications, and our goal is to follow up with you within two weeks. You’ll hear from us either way. Here’s what you can expect from the rest of our hiring process:&lt;/p&gt;\n&lt;ol&gt;\n&lt;li&gt;30 min - Recruiter screen&lt;/li&gt;\n&lt;li&gt;30 min - Hiring manager screen&lt;/li&gt;\n&lt;li&gt;45 min - Mock pitch (30 min pitch + 15 min convo)&lt;/li&gt;\n&lt;/ol&gt;\n&lt;p&gt;We’ll keep you informed through every step. To get started, complete this application, including a cover letter and answers to the questions on the next page. We read every single application, and your cover letter and responses help put your experience into context.&lt;/p&gt;&lt;div class=&quot;content-conclusion&quot;&gt;&lt;hr&gt;\n&lt;p&gt;&amp;nbsp;&lt;/p&gt;\n&lt;p&gt;Kit is an equal opportunity employer. We value diversity in all of its forms, and we hire the best person we can for each role, no matter your personal background. Research tells us that applicants who are female or non-binary, as well as applicants who are people of color, are less likely to apply for roles they do not feel 100% qualified for. If you think you meet more than 50% of our requirements but fewer than 100% of them, please apply. We’re imperfect communicators, so think of our job postings as the starting point for discussion rather than proof that you shouldn’t apply.&lt;/p&gt;\n&lt;p&gt;Kit does not discriminate on the basis of race, sex, color, religion, age, national origin, marital status, disability, veteran status, genetic information, sexual orientation, gender identity or any other reason prohibited by law in provision of employment opportunities and benefits.&lt;/p&gt;&lt;/div&gt;","tags":"[\"finance\",\"management\"]","pubDate":"2025-04-01T00:26:46.000Z","link":"https://job-boards.greenhouse.io/kit/jobs/4694179007","slug":"ads-sales-representative-contractor-kit-4023"},{"id":3390196661,"title":"Ads Sales Representative - Contractor","company":"Kit","image":"https://avatars.githubusercontent.com/u/10557747?s=200&v=4","description":"&lt;div class=&quot;content-intro&quot;&gt;&lt;h4&gt;Description&lt;/h4&gt;\n&lt;div&gt;\n&lt;p class=&quot;p1&quot;&gt;Kit is an email-first operating system for creators who mean business. We help creators grow and monetize their audience with ease. For coaches, YouTubers, authors, podcasters, and other creatives, there isn’t a better marketing hub to rely on to grow audiences, automate email marketing, and sell digital products - all within one platform. More importantly, there isn’t a team more committed to helping creators earn a living.&lt;/p&gt;\n&lt;p&gt;We’re on a mission to help creators earn $1 billion using our creator marketing platform. We have always been 100% independent and 100% remote. We are proud to have built a product that our customers love, and we look for people who have enthusiasm and belief in our mission, vision, and values to join our team.&lt;/p&gt;\n&lt;p&gt;The Kit culture is one where emotional intelligence is valued, radical candor is encouraged, and where everyone works together to uphold a set of shared team principles.&lt;/p&gt;\n&lt;hr&gt;\n&lt;p&gt;&amp;nbsp;&lt;/p&gt;\n&lt;/div&gt;&lt;/div&gt;&lt;h4&gt;&lt;strong&gt;The Role&lt;/strong&gt;&lt;/h4&gt;\n&lt;p&gt;As a &lt;strong&gt;Kit Ads Sales Representative&lt;/strong&gt;, you will identify and sell to prospective advertisers to fuel the growth of our creator network. You’ll develop lasting relationships with brands—helping them become evergreen sponsors in the Kit ecosystem—while staying attuned to their marketing goals and translating those objectives into tailored sponsorship opportunities. You thrive on connecting the right brands with the right creators, and you’re motivated by our mission to help creators earn a living online.&lt;/p&gt;\n&lt;p&gt;You’ll report into the Head of Kit Ads and collaborate closely with internal stakeholders across the company (Creator Reps, Marketing, Product, Finance) to meet and exceed quarterly revenue targets. If you’re passionate about advertising, have a knack for cultivating connections, and enjoy juggling multiple sales cycles in a fast-paced environment, this role is for you.&lt;/p&gt;\n&lt;h4&gt;&lt;strong&gt;Responsibilities&lt;/strong&gt;&lt;/h4&gt;\n&lt;p&gt;As the Ads Sales Representative on the Kit Ads team, you will:&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;&lt;strong&gt;Prospect and build strong advertiser relationships&lt;/strong&gt;&lt;strong&gt;&lt;br&gt;&lt;/strong&gt;Conduct outbound outreach and manage inbound leads, forging genuine connections with brands to understand their marketing objectives and challenges.&lt;/li&gt;\n&lt;li&gt;&lt;strong&gt;Meet (and exceed) revenue targets&lt;/strong&gt;&lt;strong&gt;&lt;br&gt;&lt;/strong&gt;Own quarterly and annual sales goals; proactively communicate pipeline updates, challenges, and successes to the Kit Ads team.&lt;/li&gt;\n&lt;li&gt;&lt;strong&gt;Deliver integrated campaign strategies&lt;/strong&gt;&lt;strong&gt;&lt;br&gt;&lt;/strong&gt;Ingest advertiser objectives—ranging from brand awareness to direct response—and craft campaign plans that yield measurable results for advertisers, creators, and their audiences.&lt;/li&gt;\n&lt;li&gt;&lt;strong&gt;Manage the end-to-end sales cycle&lt;/strong&gt;&lt;strong&gt;&lt;br&gt;&lt;/strong&gt;Identify potential advertisers, pitch new opportunities, negotiate terms (including CPC, CPM, or hybrid models), finalize insertion orders, and ensure proper billing and credit adherence.&lt;/li&gt;\n&lt;li&gt;&lt;strong&gt;Collaborate with internal stakeholders&lt;/strong&gt;&lt;strong&gt;&lt;br&gt;&lt;/strong&gt;Work hand-in-hand with Creator Reps, Marketing,Finance, and Product teams to refine deal structures, stay up-to-date on product offerings, and resolve finance or platform questions swiftly.&lt;/li&gt;\n&lt;li&gt;&lt;strong&gt;Maintain detailed records and processes&lt;/strong&gt;&lt;strong&gt;&lt;br&gt;&lt;/strong&gt;Document all advertiser details, meeting notes, proposals, and deal progress in HubSpot and relevant platforms (Gong, Slack, etc)&lt;/li&gt;\n&lt;li&gt;&lt;strong&gt;Uphold consistent sales activity goals&lt;/strong&gt;&lt;strong&gt;&lt;br&gt;&lt;/strong&gt;Conduct client meetings, prospect to ~40–50 prospects per week, and deliver 40–50 proposals monthly—continuously refining outreach tactics based on performance.&lt;/li&gt;\n&lt;li&gt;&lt;strong&gt;Iterate and improve sales playbooks&lt;/strong&gt;&lt;strong&gt;&lt;br&gt;&lt;/strong&gt;Explore new strategies, share learnings with the team, and champion best practices that enhance the efficiency and effectiveness of our sales approach.&lt;/li&gt;\n&lt;li&gt;&lt;strong&gt;Foster repeat business and brand loyalty&lt;/strong&gt;&lt;strong&gt;&lt;br&gt;&lt;/strong&gt;Drive meaningful results that encourage satisfied advertisers to scale campaigns and become ongoing partners in the Kit Ads network.&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;&lt;strong&gt;Requirements/Desired Skills&lt;/strong&gt;&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;Strong digital advertising or marketing experience in a dynamic, fast-moving environment—strong understanding of both brand and performance-based models (including CPC, CPM, etc.)&amp;nbsp;&lt;/li&gt;\n&lt;li&gt;Skilled in consultative monetization; adept at analyzing performance data, recommending ad strategies, and optimizing outcomes for both creators and advertisers&lt;/li&gt;\n&lt;li&gt;Outstanding relationship-building abilities; proven success collaborating with content creators and brand partners to align multiple stakeholders’ goals&lt;/li&gt;\n&lt;li&gt;Proven track record in meeting or surpassing revenue targets, with strong organizational and project management skills to juggle multiple campaigns, develop workflows, and meet deadlines&lt;/li&gt;\n&lt;li&gt;Exceptional communication skills; able to synthesize complex information, present clearly, and tailor messaging to diverse audiences—from creators and sales teams to brand partners and executives&lt;/li&gt;\n&lt;li&gt;Proficiency with CRM tools and ad tech platforms; detail-oriented and eager to learn new software quickly&lt;/li&gt;\n&lt;li&gt;High degree of adaptability; thrives in a fast-paced, iterative environment and proactively seeks new opportunities for growth&lt;/li&gt;\n&lt;li&gt;Comfortable enforcing program guidelines, addressing compliance issues, and escalating concerns effectively to protect brand integrity and ensure alignment with platform policies&lt;/li&gt;\n&lt;li&gt;Proactive problem solver who excels in creating, refining, and following processes to streamline operations, anticipate challenges, and innovate solutions&lt;/li&gt;\n&lt;li&gt;Enthusiastic about empowering creators to earn a living; motivated to craft advertising solutions that benefit brands, creators, and their audiences&lt;/li&gt;\n&lt;/ul&gt;\n&lt;h4&gt;&lt;strong&gt;Compensation&lt;/strong&gt;&amp;nbsp;&lt;/h4&gt;\n&lt;p&gt;This is a contract position with a monthly retainer of $5,833. Commissions start at 2.5% and can grow to as quotas are exceeded. On-target earnings are $125,000 in 12 months with room to earn more. The initial contract will be for a six-month period with a mid-contract review to evaluate the work completed and decide on a possible contract extension.&lt;/p&gt;\n&lt;h4&gt;&lt;strong&gt;How to Apply&lt;/strong&gt;&lt;/h4&gt;\n&lt;p&gt;We usually receive a large number of applications, and our goal is to follow up with you within two weeks. You’ll hear from us either way. Here’s what you can expect from the rest of our hiring process:&lt;/p&gt;\n&lt;ol&gt;\n&lt;li&gt;30 min - Recruiter screen&lt;/li&gt;\n&lt;li&gt;30 min - Hiring manager screen&lt;/li&gt;\n&lt;li&gt;45 min - Mock pitch (30 min pitch + 15 min convo)&lt;/li&gt;\n&lt;/ol&gt;\n&lt;p&gt;We’ll keep you informed through every step. To get started, complete this application, including a cover letter and answers to the questions on the next page. We read every single application, and your cover letter and responses help put your experience into context.&lt;/p&gt;&lt;div class=&quot;content-conclusion&quot;&gt;&lt;hr&gt;\n&lt;p&gt;&amp;nbsp;&lt;/p&gt;\n&lt;p&gt;Kit is an equal opportunity employer. We value diversity in all of its forms, and we hire the best person we can for each role, no matter your personal background. Research tells us that applicants who are female or non-binary, as well as applicants who are people of color, are less likely to apply for roles they do not feel 100% qualified for. If you think you meet more than 50% of our requirements but fewer than 100% of them, please apply. We’re imperfect communicators, so think of our job postings as the starting point for discussion rather than proof that you shouldn’t apply.&lt;/p&gt;\n&lt;p&gt;Kit does not discriminate on the basis of race, sex, color, religion, age, national origin, marital status, disability, veteran status, genetic information, sexual orientation, gender identity or any other reason prohibited by law in provision of employment opportunities and benefits.&lt;/p&gt;&lt;/div&gt;","tags":"[\"finance\",\"management\"]","pubDate":"2025-04-01T00:26:29.000Z","link":"https://job-boards.greenhouse.io/kit/jobs/4694176007","slug":"ads-sales-representative-contractor-kit-8142"},{"id":3734353897,"title":"Software Engineer (Applied AI)","company":"Metabase","image":"https://avatars.githubusercontent.com/u/10520629?s=200&v=4","description":"<div>Metabase is the easiest way for people to get insights from their data, from tiny startups who get up and running quickly to major corporations with tens of thousands of users. That's why people <a class=\"postings-link\" href=\"https://www.metabase.com/love\">love us</a>.</div><div><br></div><div>We bring data tools with the elegance and simplicity of consumer products to the crufty world of enterprise business intelligence. We provide an opinionated open source starting point for how companies should measure, analyze and share their data, which is used by tens of thousands of companies.</div><div><br></div><div><span style=\"font-size: 18px;\"><b>Come join us</b></span></div><div><span style=\"font-size: 16px;\">Our business is thriving and we are thoughtfully expanding our engineering teams. We’re looking for exceptional software engineers to join our Applied AI engineering team in doing the hard work that makes our users’ lives easy. We run on a mix of Python, Clojure and TypeScript (React), and the ideal candidate has shipped production code in one or more of these languages. You’ll be expected to ship product features that leverage LLMs/generativeAI. You should have strong product sensibilities and deeply care about the end user experience.</span></div><div><br></div><div><span style=\"font-size: 18px;\"><b>What we are looking for</b></span></div><div><span style=\"font-size: 16px;\">- Strong generalist software engineer who likes shipping user facing features in a rapid and iterative manner.</span></div><div><span style=\"font-size: 16px;\">- Solid CS background (acquired through either a CS program or shipping software in a production setting).</span></div><div><span style=\"font-size: 16px;\">- You care about crafting responsible, user-centered systems. You have a collaborative, iterative working style where you build features that are both powerful and ethically sound, with particular attention to accuracy and fairness.</span></div><div><span style=\"font-size: 16px;\">- You've worked on large and complex projects. Metabase is a large code base so the ability to adapt existing code and integrate new capabilities into established systems is important and you should feel comfortable digging in.</span></div><div><span style=\"font-size: 16px;\">- Nice to have: Experience building product features and systems that use LLMs/generative AI technologies.</span></div><div><br></div><div><span style=\"font-size: 18px;\"><b>What you would do at Metabase</b></span></div><div><span style=\"font-size: 16px;\">- Ship innovative features in the Metabase software including those powered by LLMs/generative AI technologies. See </span><a href=\"https://www.metabase.com/releases\"><span style=\"font-size: 16px;\">our recent releases</span></a><span style=\"font-size: 16px;\"> to get a sense of what these look like.</span></div><div><span style=\"font-size: 16px;\">- Build LLM-powered natural language data interaction capabilities that allow users to ask questions about their data in plain English and receive accurate, contextual responses.</span></div><div><span style=\"font-size: 16px;\">- Apply generative AI, ML, and data science techniques to enhance data understanding. Develop systems that can explain complex queries in plain English, and provide context-aware suggestions for data exploration.</span></div><div><span style=\"font-size: 16px;\">- Work closely with product manager, product designer and other engineers in a collaborative, iterative, non-waterfall style of software development.</span></div><div><span style=\"font-size: 16px;\">- Own the quality of the code you write and the areas of infrastructure in your team's scope. Write unit and integration tests that thoroughly and thoughtfully test the systems you build. We take testing seriously across all components.</span></div><div><span style=\"font-size: 18px;\"><b>Come join us</b></span></div><div><span style=\"font-size: 16px;\">Our business is thriving and we are thoughtfully expanding our engineering teams. We’re looking for exceptional software engineers to join our Applied AI engineering team in doing the hard work that makes our users’ lives easy. We run on a mix of Python, Clojure and TypeScript (React), and the ideal candidate has shipped production code in one or more of these languages. You’ll be expected to ship product features that leverage LLMs/generativeAI. You should have strong product sensibilities and deeply care about the end user experience.</span></div><div><br></div><div><span style=\"font-size: 18px;\"><b>What we are looking for</b></span></div><div><span style=\"font-size: 16px;\">- Strong generalist software engineer who likes shipping user facing features in a rapid and iterative manner.</span></div><div><span style=\"font-size: 16px;\">- Solid CS background (acquired through either a CS program or shipping software in a production setting).</span></div><div><span style=\"font-size: 16px;\">- You care about crafting responsible, user-centered systems. You have a collaborative, iterative working style where you build features that are both powerful and ethically sound, with particular attention to accuracy and fairness.</span></div><div><span style=\"font-size: 16px;\">- You've worked on large and complex projects. Metabase is a large code base so the ability to adapt existing code and integrate new capabilities into established systems is important and you should feel comfortable digging in.</span></div><div><span style=\"font-size: 16px;\">- Nice to have: Experience building product features and systems that use LLMs/generative AI technologies.</span></div><div><br></div><div><span style=\"font-size: 18px;\"><b>What you would do at Metabase</b></span></div><div><span style=\"font-size: 16px;\">- Ship innovative features in the Metabase software including those powered by LLMs/generative AI technologies. See </span><a href=\"https://www.metabase.com/releases\"><span style=\"font-size: 16px;\">our recent releases</span></a><span style=\"font-size: 16px;\"> to get a sense of what these look like.</span></div><div><span style=\"font-size: 16px;\">- Build LLM-powered natural language data interaction capabilities that allow users to ask questions about their data in plain English and receive accurate, contextual responses.</span></div><div><span style=\"font-size: 16px;\">- Apply generative AI, ML, and data science techniques to enhance data understanding. Develop systems that can explain complex queries in plain English, and provide context-aware suggestions for data exploration.</span></div><div><span style=\"font-size: 16px;\">- Work closely with product manager, product designer and other engineers in a collaborative, iterative, non-waterfall style of software development.</span></div><div><span style=\"font-size: 16px;\">- Own the quality of the code you write and the areas of infrastructure in your team's scope. Write unit and integration tests that thoroughly and thoughtfully test the systems you build. We take testing seriously across all components.</span></div><div>We're a global team (50% outside the US), fully distributed (from Thailand to California), who get things done asynchronously, with plenty of uninterrupted time, supporting each other to do the best work of our careers. We offer flexibility (define your own schedule and work from wherever you want), autonomy, and an environment that fosters growth, learning, and development. We're relentlessly user-focused and believe in building long-term value, not short-term hacks. And we raised a $30M Series B to take our approach to the next level for years to come.</div><div><br></div><div><span style=\"font-size: 10px\">For U.S. applicants: Metabase participates in the federal E-Verify program, which confirms employment authorization of newly hired U.S. based employees. E-Verify is not used as a tool to pre-screen candidates and is only initiated upon hire.</span></div><div><br></div><div><span style=\"font-size: 10px\"><a href=\"https://www.e-verify.gov/sites/default/files/everify/posters/EVerifyParticipationPoster.pdf\"><u>E-Verify Participation Notice</u></a> (English/Spanish)</span></div><div><span style=\"font-size: 10px\"><a href=\"https://www.e-verify.gov/sites/default/files/everify/posters/IER_RightToWorkPoster%20Eng_Es.pdf\"><u>Right to Work Notice</u></a> (English/Spanish)</span></div><div>Metabase is the easiest way for people to get insights from their data, from tiny startups who get up and running quickly to major corporations with tens of thousands of users. That's why people <a href=\"https://www.metabase.com/love\" class=\"postings-link\">love us</a>.</div><div><br></div><div>We bring data tools with the elegance and simplicity of consumer products to the crufty world of enterprise business intelligence. We provide an opinionated open source starting point for how companies should measure, analyze and share their data, which is used by tens of thousands of companies.</div>","tags":"[\"typescript\",\"engineering\"]","pubDate":"2025-03-31T21:42:52.634Z","link":"https://jobs.lever.co/metabase/8f69973f-6ac9-45fd-997e-15c6c8e22145","slug":"software-engineer-applied-ai-metabase-4708"},{"id":8355047956,"title":"Staff Infrastructure Engineer","company":"Livekit","image":"https://avatars.githubusercontent.com/u/69438833?s=200&v=4","description":"<h2>LiveKit Infrastructure Engineer</h2><p style=\"min-height:1.5em\">LiveKit is on a mission to help developers create and scale real-time experiences. We are hiring a Site Reliability Engineer to help manage and scale the core components of the LiveKit infrastructure. Visibility, performance, and reliability of our globally distributed architecture is critical and a top priority.</p><p style=\"min-height:1.5em\"></p><p style=\"min-height:1.5em\"><strong>What You'll Do</strong></p><ul style=\"min-height:1.5em\"><li><p style=\"min-height:1.5em\">Build and own the foundational infrastructure that our products run upon.</p></li><li><p style=\"min-height:1.5em\">Work directly on our products' golang code base to implement SRE related objectives.</p></li><li><p style=\"min-height:1.5em\">Take a data driven approach to quantifying system performance and reliability and use it to drive project priorities.</p></li><li><p style=\"min-height:1.5em\">Oncall participation including leading incident management for complex situations.</p></li><li><p style=\"min-height:1.5em\">Work on automation and advanced configuration management to allow our team to manage large numbers of clusters distributed across the world running various products.</p></li><li><p style=\"min-height:1.5em\">Work with infrastructure vendors when their solutions aren't meeting our real time performance and reliability needs.</p></li></ul><p style=\"min-height:1.5em\"></p><p style=\"min-height:1.5em\"><strong>Who You Are</strong></p><ul style=\"min-height:1.5em\"><li><p style=\"min-height:1.5em\">A balance of strengths in both software engineering and large scale system administration.</p></li><li><p style=\"min-height:1.5em\">Experience managing complex multi-region distributed systems running on top of container orchestration systems like Kubernetes.</p></li><li><p style=\"min-height:1.5em\">Passionate about maintainability and keeping system complexity at bay, but able to balance this with meeting launch deadlines.</p></li></ul><p style=\"min-height:1.5em\"></p><p style=\"min-height:1.5em\"><strong>Bonus Points</strong></p><ul style=\"min-height:1.5em\"><li><p style=\"min-height:1.5em\">Incident management training and experience being an Incident Commander.</p></li><li><p style=\"min-height:1.5em\">Experience with Linux networking, overlay networks, and Kubernetes CNIs.</p></li><li><p style=\"min-height:1.5em\">Low level knowledge for troubleshooting and tuning latency sensitive workloads.</p></li></ul><p style=\"min-height:1.5em\"></p><h2>Our Commitments to You</h2><h3>We offer:</h3><ul style=\"min-height:1.5em\"><li><p style=\"min-height:1.5em\">A competitive salary and equity package.</p></li><li><p style=\"min-height:1.5em\">Health, dental, and vision benefits</p></li><li><p style=\"min-height:1.5em\">Flexible vacations</p></li><li><p style=\"min-height:1.5em\">Remote work environment with necessary equipment provided.</p></li></ul><p style=\"min-height:1.5em\"></p><h3>Ready to Apply?</h3><p style=\"min-height:1.5em\">If you're excited about driving the future of AI-native communications and want to make a significant impact at a high-growth company, we'd love to hear from you.</p>","tags":"[\"management\",\"engineering\"]","pubDate":"2025-03-31T20:15:01.290Z","link":"https://jobs.ashbyhq.com/livekit/cc4d5e84-d6a5-4924-825b-7e92ba157fed","slug":"staff-infrastructure-engineer-livekit-4634"},{"id":4476387095,"title":"Senior Full-stack Engineer (Special Projects)","company":"Circle","image":"https://media.licdn.com/dms/image/v2/D4E0BAQGsuyBYT8Wy1A/company-logo_200_200/company-logo_200_200/0/1709246393415/circleco_logo?e=1746662400&v=beta&t=KH2t1NJ7bcXknchnvYTCh2X0_q0BdXf-vERJqIz2p1k","description":"&lt;div class=&quot;content-intro&quot;&gt;&lt;h2&gt;About Us&lt;/h2&gt;\n&lt;p&gt;Circle is building the world’s leading all-in-one platform for online communities. We make it possible for creators, coaches, educators, and businesses to bring together their audience with engaging discussions, live streams, events, chat, courses, and payments — all in one place, all under their own brand.&lt;/p&gt;\n&lt;p&gt;We’re proud to be a fully remote company of around 180 (and growing!) team members from 30+ countries around the world. We seek exceptional individuals around the world, set them up to do the best work of their lives, and in turn, create a meaningful impact in their own lives. We don&#39;t track hours, but we do manage for high expectations very closely. We collaborate across time zones, are highly async, and like to document a lot.&lt;/p&gt;\n&lt;p&gt;Twice a year, we bring the whole company together in beautiful places around the world for our company offsites. So far, we’ve hosted offsites in Turkey, Portugal, Mexico, Thailand, Colombia, Italy, Ireland, and more, with still more to come!&lt;/p&gt;&lt;/div&gt;&lt;h2&gt;About the role&lt;/h2&gt;\n&lt;p&gt;We&#39;re looking for a Senior Full-stack engineer to join the Special Projects team as we aim to make Circle the top choice for creator/brand-led communities. You’ll be working on internal tools used by everyone at Circle, cutting-edge AI features, and new customer-facing features used by millions.&lt;/p&gt;\n&lt;p&gt;In this role, you will collaborate with our leaders, designers, and other engineers and participate in all stages of the development lifecycle, from initial task definition to final deployment. As a senior engineer, you&#39;ll break down large epics into actionable tasks, follow through with development and testing, review PRs, push updates to production, and gradually release behind feature flags. Your responsibilities will also include bug-fixing and continuous improvement of the codebase. This role requires a high level of technical proficiency and a strong understanding of software development best practices.&lt;/p&gt;\n&lt;h2&gt;What you&#39;ll be doing&lt;/h2&gt;\n&lt;p&gt;&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;Work autonomously on a product built in &lt;strong&gt;Ruby on Rails backend &lt;/strong&gt;and &lt;strong&gt;React front-end.&lt;/strong&gt;&lt;/li&gt;\n&lt;li&gt;Build critical features and improvements for our web app, with a product-first mindset.&lt;/li&gt;\n&lt;li&gt;Work closely with Circle&#39;s leaders throughout the feature design process.&lt;/li&gt;\n&lt;li&gt;Work closely with our designers to create a world-class user experience.&lt;/li&gt;\n&lt;li&gt;Improve the quality of our codebase and identify architectural deficiencies.&lt;/li&gt;\n&lt;li&gt;Learn, implement, and maintain new integrations with services like OpenAI, Zendesk, Hubspot, Notion, and Slack to improve the daily operations of our customer-facing teams.&lt;/li&gt;\n&lt;li&gt;Foster a bias for action, prioritizing speed of iteration without compromising on the quality of code or user experience.&lt;/li&gt;\n&lt;/ul&gt;\n&lt;h2&gt;What you&#39;ll need to be successful&lt;/h2&gt;\n&lt;ul&gt;\n&lt;li&gt;Strong alignment with our values, &lt;a href=&quot;https://circle.so/careers&quot;&gt;find our values on our career page&lt;/a&gt; if you haven’t read up on them yet&lt;/li&gt;\n&lt;li&gt;You are proficient in English (spoken, written, and reading) at a &lt;a href=&quot;https://magoosh.com/english-speaking/english-proficiency-levels-a-guide-to-determining-your-level/&quot;&gt;CEFR Level C2&lt;/a&gt; / &lt;a href=&quot;https://www.govtilr.org/&quot;&gt;ILR Level 5&lt;/a&gt;.&lt;/li&gt;\n&lt;li&gt;&lt;strong&gt;8+ years experience &lt;/strong&gt;working as a full-stack engineer on complex web applications with significant scale (100k+ rpm, 100GB+ databases).&lt;/li&gt;\n&lt;li&gt;Strong proficiency in &lt;strong&gt;Ruby on Rails, MySQL/Postgresql, ReactJS, TypeScript, CSS/SCCS, TailwindCSS.&lt;/strong&gt;&lt;/li&gt;\n&lt;li&gt;Familiarity with both frontend and backend is necessary, but a high degree of proficiency in both is not a requirement. Or put another way, you should be able to individually build most small to medium features end-to-end across the stack, but you can be much better at backend than at frontend.&lt;/li&gt;\n&lt;li&gt;A desire to work in an environment which values speed of iteration and individual autonomy, while also embracing personal accountability and the ability to collaborate effectively as part of a dynamic team.&lt;/li&gt;\n&lt;li&gt;Great communication skills both in writing and verbal/oral (English).&lt;/li&gt;\n&lt;li&gt;You should be able to lead a complex project end to end with judgment and an attention to detail when it comes to architectural, product, design, and process decisions. Your judgment should inspire a high level of trust within the team.&lt;/li&gt;\n&lt;li&gt;Experience working on a fully distributed remote team.&lt;/li&gt;\n&lt;li&gt;Comfortable in a fast-paced environment with a certain level of ambiguity, especially when learning and picking up new technologies when projects require it.&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;&lt;/p&gt;\n&lt;h2&gt;Bonus points&lt;/h2&gt;\n&lt;p&gt;&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;Previous experience working with community and/or creator platforms.&lt;/li&gt;\n&lt;li&gt;Experience with creating robust integrations with external services.&lt;/li&gt;\n&lt;li&gt;Experience with OpenAI, large language models, or other AI tools.&lt;/li&gt;\n&lt;li&gt;Experience at a fast-growing start-up.&lt;/li&gt;\n&lt;li&gt;A track record of picking up new technologies and skills as you ship high-quality code.&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;&lt;/p&gt;\n&lt;h2&gt;$130,000 - $140,000 USD per year&lt;/h2&gt;\n&lt;p&gt;&lt;em&gt;The cash compensation range shown is a starting point. In addition to equity, benefits and perks, your cash compensation is subject to an annual review and increase on a once per year basis.&lt;/em&gt;&lt;/p&gt;\n&lt;p&gt;&amp;nbsp;&lt;/p&gt;&lt;div class=&quot;content-conclusion&quot;&gt;&lt;h2&gt;The fun stuff&lt;/h2&gt;\n&lt;ul&gt;\n&lt;li&gt;Fully remote:&amp;nbsp;work from anywhere in the world!&lt;/li&gt;\n&lt;li&gt;Autonomy and trust to do your job:&amp;nbsp;we care about outcomes over everything else.&lt;/li&gt;\n&lt;li&gt;Paid time away:&amp;nbsp;all employees are given 35 days of PTO annually. We also offer a paid sabbatical after 5 years.&lt;/li&gt;\n&lt;li&gt;Generous U.S. benchmarked compensation&amp;nbsp;and startup equity no matter where you are in the world.*&lt;/li&gt;\n&lt;li&gt;Awesome medical coverage&amp;nbsp;with 100% coverage for you and your family, or medical reimbursement options where applicable!*&lt;/li&gt;\n&lt;li&gt;Parental leave&amp;nbsp;for parents expanding their family, or just starting one.&lt;/li&gt;\n&lt;li&gt;Home office stipend&amp;nbsp;to help you get up and running.&lt;/li&gt;\n&lt;li&gt;Learning &amp;amp; development stipend&amp;nbsp;to help you level up your professional skills.&lt;/li&gt;\n&lt;li&gt;Annual bonus potential&amp;nbsp;for roles that don&#39;t already receive variable income or commission.&lt;/li&gt;\n&lt;li&gt;Company retreats:&amp;nbsp;Twice a year, the Circle team gets together for a fully paid company retreat in incredible places around the world! We’ve had past retreats in Colombia, Portugal, and Mexico, with more planned on the horizon.&lt;/li&gt;\n&lt;li&gt;Check out our&amp;nbsp;&lt;a href=&quot;https://careers.circle.so/&quot;&gt;Careers&lt;/a&gt;&amp;nbsp;page for more.&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;&lt;span style=&quot;font-size: 10pt;&quot;&gt;*&lt;em&gt;Your role, location and unique circumstance may affect this.&lt;/em&gt;&lt;/span&gt;&lt;/p&gt;\n&lt;h3&gt;Diversity, Equity &amp;amp; Inclusion&lt;/h3&gt;\n&lt;p&gt;As a fully-remote international company, diversity is baked into our DNA. Here’s how our CEO, Sid Yadav, frames our hiring mission: “let’s find talent in underserved and under-represented corners of the world, set them up to do the best work of their lives, and in turn, change their life.” To achieve this hiring mission, we offer competitive&amp;nbsp;U.S. benchmarked&amp;nbsp;compensation no matter where someone’s located in the world, and we proactively seek candidates who expand representation of backgrounds, cultures and lived experiences in our teams.&lt;/p&gt;\n&lt;h3&gt;Equal Employment Opportunity&lt;/h3&gt;\n&lt;p&gt;Circle is an equal opportunity employer and as such, we do not discriminate on the basis of race, color, religion, sex, sexual orientation, gender identity, national origin, age, disability, or any other characteristic protected by applicable laws.&amp;nbsp;If you require any accommodations during the recruitment process, please let us know and we will work with you to meet your needs.&lt;/p&gt;\n&lt;div class=&quot;&quot;&gt;\n&lt;h3 class=&quot;&quot;&gt;How We Use Candidate Data&lt;/h3&gt;\n&lt;p&gt;At Circle, we are committed to protecting your personal information. As a job applicant, the personal data you provide to us is collected and processed in accordance with the&amp;nbsp;&lt;strong&gt;General Data Protection Regulation (GDPR)&lt;/strong&gt; in the EU and the &lt;strong&gt;California Consumer Privacy Act (CCPA)&lt;/strong&gt;. This notice outlines the types of personal information we collect, the purpose for collecting it, and your rights.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Information We Collect:&lt;/strong&gt; We collect the following categories of personal information from job applicants:&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;Contact information (such as name, email address, phone number)&lt;/li&gt;\n&lt;li&gt;Employment history and qualifications&lt;/li&gt;\n&lt;li&gt;Education history&lt;/li&gt;\n&lt;li&gt;References and any other information you choose to share with us during the application process&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;&lt;strong&gt;Purpose of Collection:&lt;/strong&gt; We collect this information for the following purposes:&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;To assess your qualifications and suitability for the position&lt;/li&gt;\n&lt;li&gt;To communicate with you during the recruitment process&lt;/li&gt;\n&lt;li&gt;To comply with legal and regulatory obligations&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;&lt;strong&gt;Your Rights Under GDPR and CCPA:&lt;/strong&gt; You have the following rights regarding your personal information:&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;The right to request access to the personal information we hold about you.&lt;/li&gt;\n&lt;li&gt;The right to request the deletion of your personal information, subject to certain legal exceptions.&lt;/li&gt;\n&lt;li&gt;The right to opt out of the sale of your personal information (Note: We do not sell personal information).&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;For more information about how we handle your personal data or to exercise your rights, please refer to our full &lt;a href=&quot;https://circle.so/privacy&quot; target=&quot;_blank&quot;&gt;Privacy Policy&lt;/a&gt;.&lt;/p&gt;\n&lt;p&gt;By submitting your application, you acknowledge that you have read and understood this privacy notice.&lt;/p&gt;\n&lt;/div&gt;&lt;/div&gt;","tags":"[\"postgres\",\"typescript\",\"legal\",\"database\",\"mysql\",\"aws\"]","pubDate":"2025-03-31T16:16:52.000Z","link":"https://job-boards.greenhouse.io/circleso/jobs/4611485008","slug":"senior-full-stack-engineer-special-projects-circle-5224"},{"id":4070767415,"title":"Production & Studio Manager ","company":"Paradox","image":"https://cdn.prod.website-files.com/63ef5a85ffdee87c27e6573a/66e0418f9e22dd4e4cacb077_Black%20symbol%20(1)%20(2).png","description":"<p style=\"min-height:1.5em\"><strong>Wait a minute. </strong></p><p style=\"min-height:1.5em\">Deep inside you are looking for a new adventure with 🗽Freedom, 🔥Ambition and 😍Impact</p><p style=\"min-height:1.5em\">Are you inspired in being a key player in building a massive EdTech company that will empower millions of people?</p><p style=\"min-height:1.5em\">Do you dream of being at the heart of a dynamic studio where the main goal is to impact people’s lives by helping bring ideas to life through incredible productions? If so, keep reading – because this might be the perfect opportunity for you!</p><p style=\"min-height:1.5em\"><strong>Deep inside you are looking for a new adventure with… </strong></p><ul style=\"min-height:1.5em\"><li><p style=\"min-height:1.5em\"><strong>🗽 Freedom: </strong>Being trusted to deliver</p></li><li><p style=\"min-height:1.5em\">🔥 <strong>Ambition:</strong> growing up surrounded by smart colleagues driven to create an iconic brand like Nike</p></li><li><p style=\"min-height:1.5em\">😍 <strong>Impact:</strong> contributing to transform people lives at scale and feel your own impact in the company</p></li></ul><p style=\"min-height:1.5em\"> <strong>And you deserve it because:</strong></p><ul style=\"min-height:1.5em\"><li><p style=\"min-height:1.5em\"><strong>You are a master of execution</strong> – You have a proven track record of <strong>running seamless productions and post-productions</strong>, ensuring every piece of content is high-quality and on time.</p></li><li><p style=\"min-height:1.5em\"><strong>You bring structure to chaos</strong> – You thrive in <strong>fast-paced environments</strong>, juggling multiple projects without missing a beat, and creating <strong>efficient workflows that boost productivity</strong>.</p></li><li><p style=\"min-height:1.5em\"><strong>You elevate content to world-class standards</strong> – Your <strong>sharp eye for storytelling, visuals, and technical quality</strong> ensures that every video meets <strong>cinematic and brand excellence</strong>.</p></li></ul><p style=\"min-height:1.5em\"></p><p style=\"min-height:1.5em\">You also happen to want to use your experience as an awesome<strong> Audio Visual Professional </strong>to contribute to impacting the lives of thousands of people?</p><p style=\"min-height:1.5em\">Then, you have found the next adventure that will fulfill you !</p><p style=\"min-height:1.5em\">Our sources of inspiration are Apple, Nike, Spotify, Disney for their obsession of excelling, having a worldwide impact and not just selling products but <strong>crafting experiences.</strong> You will be playing a pivotal role in making Paradox play at that level and becoming an iconic brand.</p><p style=\"min-height:1.5em\">For us, being Iconic is to innovate at the intersection of Psychology x Creativity x Technology.</p><p style=\"min-height:1.5em\"></p><div style=\"text-align:left\"><img style=\"max-width:100%\" src=\"https://app.ashbyhq.com/api/images/user-content/9f216e31-710a-4d14-8a7c-747665aa0e4a/8530f88d-8278-498d-8183-5b8d617d220b/Intersection%20en%20blanc.png\" /></div><p style=\"min-height:1.5em\"></p><p style=\"min-height:1.5em\"></p><p style=\"min-height:1.5em\"></p><p style=\"min-height:1.5em\">This is a full-time position, carried out from our<strong> beautiful studio in Paris. French fluency </strong>and a <strong>good level of english </strong>are required.</p><p style=\"min-height:1.5em\"></p><div style=\"text-align:left\"><img style=\"max-width:100%\" src=\"https://app.ashbyhq.com/api/images/user-content/9f216e31-710a-4d14-8a7c-747665aa0e4a/d1177610-dab0-4134-99a6-0772f3ec9ebc/1000043308.jpg\" /></div><p style=\"min-height:1.5em\"></p><h2>YOUR MISSION 🚀 </h2><p style=\"min-height:1.5em\">-------------------------------</p><p style=\"min-height:1.5em\"></p><p style=\"min-height:1.5em\"><strong>🎯 </strong>You’ll be the backbone of our<strong> content production operations</strong>, ensuring seamless execution from <strong>pre-production to post-production</strong>. You will have full <strong>ownership over the studio</strong>, making sure every shoot, every piece of content, and every live event runs flawlessly. Your technical expertise and meticulous attention to detail will ensure everything in our stunning Paris studio runs smoothly as you are contributing to the success of all our projects.</p><p style=\"min-height:1.5em\"></p><p style=\"min-height:1.5em\"><u>To do so, here are your 4 responsibilities : </u></p><p style=\"min-height:1.5em\">1 | MASTERMIND FLAWLESS LIVE STREAMING EVENTS</p><ul style=\"min-height:1.5em\"><li><p style=\"min-height:1.5em\">Prepare the Live Streaming Setup (camera, sound, lightning, Zoom, Stream Deck, etc.)</p></li><li><p style=\"min-height:1.5em\">Run the Live Event (managing the sound, checking if the video stream is running smoothly, launching pre-recorded videos, creating Zoom Sub-Groups for students, giving the Mic to selected students etc.)</p></li><li><p style=\"min-height:1.5em\">Be the technical voice and support for the Trainer and the Students when they’re facing difficulties with the Live</p></li></ul><p style=\"min-height:1.5em\"></p><p style=\"min-height:1.5em\">2 | LEAD PRODUCTION &amp; POST-PRODUCTION EXCELLENCE</p><ul style=\"min-height:1.5em\"><li><p style=\"min-height:1.5em\">Own the entire production pipeline — from ideation to final delivery.</p></li><li><p style=\"min-height:1.5em\">Ensure all video projects meet elite standards of storytelling, branding, and quality.</p></li><li><p style=\"min-height:1.5em\">Oversee post-production workflows, guaranteeing on-time delivery and consistency across content.</p></li><li><p style=\"min-height:1.5em\">Handle asset management, backup strategies, and workflow optimizations for our high-volume content library.</p></li></ul><p style=\"min-height:1.5em\"></p><p style=\"min-height:1.5em\">3 | TAKE FULL OWNERSHIP OF THE STUDIO &amp; LIVE SETUPS</p><ul style=\"min-height:1.5em\"><li><p style=\"min-height:1.5em\">Manage the studio’s equipment, ensuring everything is ready and optimized for top-tier productions.</p></li><li><p style=\"min-height:1.5em\">Handle key operational tasks: financial tracking, studio supplies, parcel management.</p></li></ul><p style=\"min-height:1.5em\"></p><p style=\"min-height:1.5em\">4 |  DELIVER CUTTING-EDGE PRODUCT VIDEO EDITING</p><ul style=\"min-height:1.5em\"><li><p style=\"min-height:1.5em\">Edit Online Training content for our students in a streamlined manner.</p></li><li><p style=\"min-height:1.5em\">Upload the Videos on our LMS</p></li><li><p style=\"min-height:1.5em\">Manage the back-up and organization of our video library</p><p style=\"min-height:1.5em\"></p></li></ul><h2>DO YOU RECOGNIZE YOURSELF? 😍</h2><h3>-------------------------------</h3><h3>Experience &amp; skills</h3><ul style=\"min-height:1.5em\"><li><p style=\"min-height:1.5em\">You have already worked as a <strong>Video Editor, Videographer, Audiovisual Technician Studio Manager and/or Live Streaming Technician </strong>(internship or top notch school projects counts as “work experience”)</p></li><li><p style=\"min-height:1.5em\">You are comfortable with <strong>administrative tasks</strong> and have interest in managing a creative studio as a project from A to Z.</p></li><li><p style=\"min-height:1.5em\">You are comfortable with <strong>video editing, </strong>and you get great satisfaction from<strong> getting the most out of a shooting.</strong></p></li><li><p style=\"min-height:1.5em\">You have some knowledge of software such as <strong>Adobe Premiere Pro</strong> and <strong>Adobe Media Encoder.</strong></p></li></ul><p style=\"min-height:1.5em\"></p><h3>Personality</h3><ul style=\"min-height:1.5em\"><li><p style=\"min-height:1.5em\"><strong>Drive &amp; Problem Solver:</strong> You are ambitious, work hard because you love it, take ownership and get things done.</p></li><li><p style=\"min-height:1.5em\"><strong>Analytical Mind: </strong>You can question yourself, identify and formulate issues quickly, and always try to support your analysis with data.</p></li><li><p style=\"min-height:1.5em\"><strong>Growth over Ego: </strong>You are eager to learn and receive difficult feedback to progress. You let others express themselves and seek to understand their points of view.</p></li><li><p style=\"min-height:1.5em\"><strong>Team Player: </strong>You like working in a team toward a common goal, sharing and winning together.</p></li><li><p style=\"min-height:1.5em\"><strong>Strong desire to create the Wow effect.</strong></p></li></ul><p style=\"min-height:1.5em\"><br /><strong>Language</strong></p><ul style=\"min-height:1.5em\"><li><p style=\"min-height:1.5em\"><strong>French:</strong> native or bilingual.</p></li><li><p style=\"min-height:1.5em\"><strong>English: </strong>Good leve. You can hold a conversation on specific details with English-speaking colleagues. Our chosen language for written communication is English. </p></li></ul><p style=\"min-height:1.5em\"></p><h3>Must have </h3><ul style=\"min-height:1.5em\"><li><p style=\"min-height:1.5em\"><strong>Available to run the live events on evenings or weekends</strong> (two week ends a month at maximum)</p></li><li><p style=\"min-height:1.5em\"><strong>Passion for audiovisual techniques.</strong></p></li><li><p style=\"min-height:1.5em\"><strong>Innovative</strong> by testing, learning and integrating what works.</p></li><li><p style=\"min-height:1.5em\"><strong>Strong organization skills</strong> that are reflected in your daily work.</p></li><li><p style=\"min-height:1.5em\"><strong>Obsessed with excellence</strong> and always seeking to improve your work. </p><p style=\"min-height:1.5em\"></p></li></ul><h2>IT MIGHT NOT BE FOR YOU 🙅‍♀️</h2><h3>-------------------------------</h3><p style=\"min-height:1.5em\">Let’s be clear, we are looking for someone who is not just Great, and for whom Paradox ambition isn’t just another cool project; but a true mission.</p><p style=\"min-height:1.5em\">So if those <strong>personal interests :</strong> personal development / coaching / professional growth / education / edtech / teaching / edutainment<strong> are not things you REALLY love, let’s forget it!</strong></p><ul style=\"min-height:1.5em\"><li><p style=\"min-height:1.5em\">You’re not at ease to handle live events on evenings or weekends</p></li><li><p style=\"min-height:1.5em\">You <strong>don’t like to be challenged</strong> and grow in your job</p></li><li><p style=\"min-height:1.5em\">You don't like <strong>receiving or giving tough feedbacks</strong></p></li><li><p style=\"min-height:1.5em\">You <strong>don’t usually try to improve the processes</strong> in place: if they are here, there is a reason</p></li><li><p style=\"min-height:1.5em\">You <strong>like to have very specific tasks</strong> assigned to you that won’t evolve in the course of a year</p></li><li><p style=\"min-height:1.5em\">You like to <strong>be told what to do</strong> or how to do something on a daily basis</p></li><li><p style=\"min-height:1.5em\"><strong>Your only driver is joining a full-remote company</strong>: yes, our company culture is cool, but we want people to care about our mission, products, and their job!</p></li></ul><p style=\"min-height:1.5em\"></p><h2>🤩 JOIN US IF YOU CRAVE</h2><h3>-------------------------------</h3><p style=\"min-height:1.5em\"></p><h3><em><strong>Growth &amp; Ambition 🚀</strong></em></h3><p style=\"min-height:1.5em\"><em><strong><br /></strong></em>🏅  We hire only the best, it’s exhilarating to be <strong>surrounded by A-players who strive to perform</strong> <strong>whilst being in a good mood. You'll be working with some of the best minds. We understand that \"A\" people attract \"A\" people.<br /></strong>🏋️‍♀️ No more bosses, but ongoing conversations to support your professional development<br />⚡️ Being part of an ambitious company with a lot of growth opportunities</p><p style=\"min-height:1.5em\"></p><p style=\"min-height:1.5em\"><em><strong>Impact &amp; Meaning </strong></em><strong>🔥</strong></p><p style=\"min-height:1.5em\"><strong><br /></strong>🦄 <strong>Playing a crucial role in the development of a company</strong> whose content and products are enjoyed by millions of people<br /><strong>🤩 Waking up in the morning knowing you are making a difference:</strong> <em>we receive messages every day from clients who have successfully lost weight, quit smoking, reach a mile stone in their business, built better relationships, and made positive changes in their lives.<br /><br /><br /><strong>But that’s not all, we believe that driven people deserve…</strong></em></p><p style=\"min-height:1.5em\"></p><p style=\"min-height:1.5em\"><em><strong>Freedom &amp; Well Being 🗽☀️</strong></em></p><p style=\"min-height:1.5em\"><em><strong><br /></strong></em>😎 <strong>A company culture based on autonomy &amp; accountability<br /></strong>🗽 <strong>Flexible working hours<br /></strong>🌎 <strong>A remote culture from day one with the freedom to work from wherever you want<br /></strong>🏤 <strong>Magnificent offices in Dubai and Lisbon:</strong> you’re at home worldwide<br /><strong>⌨️ Standing desks</strong> paid by the company, if you live far from our offices<br />💻 <strong>Macbook:</strong> <em>to be the most efficient in your work<br /></em>🏀 <strong>350€ per year paid by the company to take care of yourself</strong> <em>(for your gym, or dance class or whatever make you feel great)<br /></em>📚 <strong>150€ per year paid by the company to boost your knowledge</strong> (books, education): we are passionate about learning and want to support your growth)<br />🤝 <strong>1:1 coachings</strong>: a Paradox coach supporting you personally or professionally to live your best life<br />✈️<strong> Team buildings</strong></p><p style=\"min-height:1.5em\"><em>* those benefits are only for full-time employees</em></p><p style=\"min-height:1.5em\"></p><p style=\"min-height:1.5em\"></p><h2>HOW TO APPLY 📃</h2><h3>-------------------------------</h3><p style=\"min-height:1.5em\"></p><p style=\"min-height:1.5em\">That job description resonated with you?</p><p style=\"min-height:1.5em\">Click on \"Apply for this position\" and fill out a short questionnaire (7 to 8 minutes) to tell us more about yourself and send us your CV!</p><p style=\"min-height:1.5em\"></p><h3><strong>Hiring process</strong></h3><p style=\"min-height:1.5em\"><strong>📃 A 6 to 8 minutes application survey (with a short video assignment) </strong></p><p style=\"min-height:1.5em\"><strong>📃 A 15/20 minutes what’s app call </strong>with <strong>Chloé</strong>, our Talent Manager, to tell you more about the challenge and see if it fits with your experience and expectations,</p><p style=\"min-height:1.5em\">💻 <strong>A video call</strong> with <strong>Chloé</strong> to do a deep dive into your career path and your ambition,</p><p style=\"min-height:1.5em\">💻 <strong>A video call</strong> with <strong>Kim, the Hiring Manager</strong> to dive deeper into your technical skills, see how we can match your desires with our needs and for you both to understand how you could fit in Paradox’s social media team.</p><p style=\"min-height:1.5em\">💻<strong> A culture-fit video call </strong>with <strong>Timy</strong> - our culture coach - to check in depth the alignment between you and our values and culture</p><p style=\"min-height:1.5em\">💼 <strong>Reference check</strong> to get in-depth insights about how you work in different environments, make your onboarding easier, and give everybody on the team the insurance to be surrounded by A-Players.</p><p style=\"min-height:1.5em\"><strong>🫵🚀</strong> <strong>Welcome aboard!</strong><br /></p><p style=\"min-height:1.5em\"></p><h3><strong>About our hiring process</strong></h3><p style=\"min-height:1.5em\">Our recruitment process is tailored to do our best to avoid that you or us realize that we’re not a perfect fit. Every step serves a purpose and will allow us to get to know you better as much as it’ll help you understand more where you’ll be stepping in.</p><p style=\"min-height:1.5em\">We also want you to have time to ask all of your questions regarding the mission, the long-term vision of your team and the company, our values, with the relevant interlocutor in front of you.</p><p style=\"min-height:1.5em\"></p><h3></h3><h2>But maybe YOU WONDER WHAT’S OUR STORY ? 😉</h2><p style=\"min-height:1.5em\">-------------------------------</p><p style=\"min-height:1.5em\"></p><p style=\"min-height:1.5em\">At Paradox, we are convinced that people do not want “just a job” anymore.</p><p style=\"min-height:1.5em\">We are all craving to have an impact through our professional journey. Some want to start their own venture, some want to become an intrapreneur in their current organization, some others just want their day-to-day tasks to have more meaning.</p><p style=\"min-height:1.5em\"></p><p style=\"min-height:1.5em\"><strong>🎯 PARADOX HAS ONE GOAL: TO EMPOWER PEOPLE AND ORGANIZATIONS TO LIVE THEIR TRUE AMBITIONS.</strong></p><p style=\"min-height:1.5em\"></p><p style=\"min-height:1.5em\">But where do we start?</p><p style=\"min-height:1.5em\">If you have an interest in personal development, you probably already know that:</p><ul style=\"min-height:1.5em\"><li><p style=\"min-height:1.5em\">Making things happen is a real struggle when you don’t know what truly inspires you and how to get there ;</p></li><li><p style=\"min-height:1.5em\">Available resources are either boring 😴 or full of crazy unsubstantiated theories 🤪.</p></li></ul><p style=\"min-height:1.5em\">It needs to change, and we’re here to make it happen!</p><p style=\"min-height:1.5em\"></p><p style=\"min-height:1.5em\"><strong>⭐️ OUR AMBITION IS TO MAKE SUCCESS THE ONLY POSSIBLE OUTCOME FOR OUR CLIENTS (WHATEVER SUCCESS MEANS FOR THEM), BY CRAFTING INNOVATIVE &amp; CAPTIVATING BREAKTHROUGH EXPERIENCES.</strong></p><p style=\"min-height:1.5em\"></p><p style=\"min-height:1.5em\">In other words, we want to make personal growth <strong>as entertaining as watching Netflix.</strong></p><p style=\"min-height:1.5em\"></p><p style=\"min-height:1.5em\">How, you might be wondering?</p><ul style=\"min-height:1.5em\"><li><p style=\"min-height:1.5em\">We travel the world and surround ourselves with <strong>top entrepreneurs</strong> <em>(Richard Branson - Founder of Virgin, Marc Simoncini - Founder of Meeting, Fred Mazzella - Founder of BlablaCar)</em>, <strong>world</strong> <strong>athletes</strong> <em>(Frederick Bousquet - World record in 50m free swimming, Frank Leboeuf - WorldCup Footballer)</em>, and <strong>artists</strong> <em>(Gad Elmaleh - Comedian, Barry Osborne - Producer of Lord of the Rings and Matrix)</em> ✊;</p></li><li><p style=\"min-height:1.5em\">We reverse engineer their <strong>strategies for achieving success</strong> and lean on the <strong>latest researches</strong> about neuroscience ⚙️;</p></li><li><p style=\"min-height:1.5em\">We deliver trainings &amp; educational contents around Power Skills (critical thinking, productivity, leadership, public speaking, coaching, stress management, etc.), <strong>self-growth and performance</strong>, through a balanced set of <strong>e-learning programs, events and edutainment videos</strong> 💡.</p></li></ul><p style=\"min-height:1.5em\"></p><p style=\"min-height:1.5em\">From one well-known<a target=\"_blank\" rel=\"noopener noreferrer nofollow\" href=\"https://www.linkedin.com/in/davidlarochefr/\"> <u>Founder</u></a> to a team of +45 people today (and counting!), this approach has paid off and enabled us to exceed 2 million followers on social networks, and to have thousands of people attending our online events and training courses.</p><p style=\"min-height:1.5em\"></p><p style=\"min-height:1.5em\"><strong>🔥 TOGETHER, WE ARE DRIVEN BY ONE DREAM:</strong></p><ol style=\"min-height:1.5em\"><li><p style=\"min-height:1.5em\">Helping 100 000 people achieve their dream and display their pictures on what we call the “100 000 dreams wall” ;</p></li><li><p style=\"min-height:1.5em\">Giving our clients access to constant personal growth by reinventing their learning experience ;</p></li><li><p style=\"min-height:1.5em\">Have Will Smith and Richard Branson in our next documentary.</p></li></ol><p style=\"min-height:1.5em\"></p><p style=\"min-height:1.5em\"><strong>And that’s where you come in. Join the Paradox Revolution !</strong></p>","tags":"[\"management\"]","pubDate":"2025-03-31T15:00:52.841Z","link":"https://jobs.ashbyhq.com/paradox/2ed0fe88-028d-42e1-b2b2-354e10d0201e","slug":"production-studio-manager-paradox-919"},{"id":3957327809,"title":"Data Governance Content Writer","company":"omniscient","image":"https://remotive.com/job/1990233/logo","description":"<div class=\"h2\">About Omniscient Digital</div><p style=\"min-height:1.5em\"></p><p style=\"min-height:1.5em\">Omniscient Digital is an organic growth agency that helps B2B software companies turn content and SEO into growth channels. We support major B2B software companies like SAP, Adobe, Loom, Hotjar, Jasper, 360Learning, TikTok Shop, Smartling, and more.</p><p style=\"min-height:1.5em\">Our work has been featured on websites like HubSpot, Shopify, Semrush, Intercom, and CXL, and our strategies are used by many of the top content marketing teams worldwide.</p><p style=\"min-height:1.5em\">---</p><p style=\"min-height:1.5em\">Omniscient Digital is an organic growth agency helping B2B software companies turn content and SEO into growth channels. We’ve helped build content and SEO programs for companies like Jasper, Adobe, Loom, <a href=\"http://Order.co\" rel=\"nofollow\" target=\"_blank\">Order.co</a>, Vendr, Hotjar, and more.</p><p style=\"min-height:1.5em\">Our work has been featured on websites like HubSpot, Shopify, Intercom, and CXL, and our strategies are used by many of the top content marketing teams around the world.</p><p style=\"min-height:1.5em\">Our team is 100% remote. Learn about the <a href=\"https://beomniscient.com/principles/\" rel=\"nofollow\" target=\"_blank\"><u>core values</u></a> that drive how we work and build a company.</p><p style=\"min-height:1.5em\"></p><div class=\"h2\">About this role</div><p style=\"min-height:1.5em\">Omniscient Digital is growing quickly, and we deeply believe in our commitment never to compromise content quality. It’s what differentiates us from other agencies. Writing great content requires great writers. </p><p style=\"min-height:1.5em\"><strong>We’re seeking a stellar technical writer with expertise in advanced data governance topics. </strong>These may include metadata management, policy enforcement, data lineage, AI model governance, and cross-functional compliance challenges. </p><p style=\"min-height:1.5em\"><em>*Please note that we don’t work with writers who subcontract their work.</em></p><p style=\"min-height:1.5em\"></p><div class=\"h3\">Responsibilities:</div><ul style=\"\"><li style=\"\"><p style=\"min-height:1.5em\">Translate complex concepts like AI model transparency, ethical AI governance, and enterprise-wide metadata integration into digestible content for experienced data professionals</p></li><li style=\"\"><p style=\"min-height:1.5em\">Create and refine technical information and other various materials for explaining the client’s solutions (including the nuances of how they differ at the infrastructure layer) </p></li><li style=\"\"><p style=\"min-height:1.5em\">Adhering closely to the client’s brand voice and messaging guidelines</p></li><li style=\"\"><p style=\"min-height:1.5em\">Implement comprehensive technical documentation, feedback, and changes whenever possible</p></li><li style=\"\"><p style=\"min-height:1.5em\">Ensure projects are completed on time and meet quality standards</p></li><li style=\"\"><p style=\"min-height:1.5em\">Stay current on evolving data regulations (e.g., GDPR, CCPA, HIPAA) and their implications for governance tools and frameworks</p></li><li style=\"\"><p style=\"min-height:1.5em\">Collaborate with fellow technical communicators as needed to develop new approaches for creating more precise and engaging content for the company</p></li><li style=\"\"><p style=\"min-height:1.5em\">QA content for errors</p></li><li style=\"\"><p style=\"min-height:1.5em\">Suggest best practices and optimizations throughout content generation projects</p></li><li style=\"\"><p style=\"min-height:1.5em\">Manage complex information and multiple projects within content specifications and budget restrictions</p></li><li style=\"\"><p style=\"min-height:1.5em\">Use previously selected fonts and other typographic elements</p></li></ul><p style=\"min-height:1.5em\"></p><div class=\"h3\">Job Qualifications and Technical Skill Sets:</div><ul style=\"\"><li style=\"\"><p style=\"min-height:1.5em\"><strong>3+ years of experience in a data-related role. </strong>You can use your hands-on experience as an ideally senior data scientist, data analyst, compliance manager, data team leader, or similar to inform your writing—whether speaking to fellow practitioners or executives like Chief Data Officers or VPs of Data and AI Governance. </p></li><li style=\"\"><p style=\"min-height:1.5em\"><strong>2+ years of experience in technical writing.</strong> In addition to using your own subject matter expertise, you can do deep topic research and communicate complex information fluently. For example, you can explain the nuances of lineage tracking, AI model documentation, and federated governance models in distributed environments.</p></li><li style=\"\"><p style=\"min-height:1.5em\"><strong>Familiarity with enterprise data governance challenges and frameworks. </strong>For example, you’re no stranger to DAMA-DMBOK, FAIR principles, and ISO 8000.</p></li><li style=\"\"><p style=\"min-height:1.5em\"><strong>Experience with both print and digital media formats.</strong> You’re also proficient in word processor programs such as Microsoft Word and Google Docs and PDF software such as Adobe Acrobat.  </p></li><li style=\"\"><p style=\"min-height:1.5em\"><strong>Excellent written and verbal communication skills, and healthy analytical and critical thinking skills. </strong>You turn complex data- and governance-related concepts into compelling narratives. You’re skilled at finding the story within complicated topics and can capture our client’s brand voice in every piece of writing.</p></li><li style=\"\"><p style=\"min-height:1.5em\"><strong>SEO experience</strong>. You know how to search-optimize your content without sacrificing quality, and can balance the needs of both your client and reader within your content. </p></li><li style=\"\"><p style=\"min-height:1.5em\"><strong>Experience interviewing subject matter experts. </strong>You’re comfortable independently conducting SME interviews to add industry opinion and narrative to your content. You know how to draft questions to get the information you need and how to structure stories around the answers.</p></li><li style=\"\"><p style=\"min-height:1.5em\"><strong>Time management and organizational skills.</strong> You always meet your deadlines—or communicate in advance when you may need a deadline pushed back. </p></li></ul><ul style=\"\"><li style=\"\"><p style=\"min-height:1.5em\"><strong>Positive attitude.</strong> You’re kind, passionate, curious, and friendly! You’re open to exploring new ideas and feel passionately about crafting excellent content. You welcome feedback and love learning how to improve your craft. </p></li></ul><p style=\"min-height:1.5em\"></p><div class=\"h3\">Other Preferred Qualifications:</div><ul style=\"\"><li style=\"\"><p style=\"min-height:1.5em\"><strong>Some B2B, SaaS, and marketing experience. </strong>We primarily work with clients in these fields. Writing and/or first-hand experience in one or more of these areas will help you acclimate to our working environment and excel in your craft. For this role, we’ll prioritize writers who have experience working in a data-related role and/or with related tools like data catalogs, observability platforms, AI/ML model registries. </p></li><li style=\"\"><p style=\"min-height:1.5em\"><strong>Familiarity with multi-cloud and hybrid data environments. </strong>You also understand how governance strategies vary across them.</p></li></ul><p style=\"min-height:1.5em\"></p><div class=\"h2\">Portfolio</div><p style=\"min-height:1.5em\">A recent portfolio with technical writing experience is a must (data-related samples are a big plus). Please submit 3-5 sample articles that have been published within the past three years for consideration. Older samples will be accepted only if accompanied by newer works. </p><p style=\"min-height:1.5em\"></p><div class=\"h2\">Our hiring process</div><p style=\"min-height:1.5em\">We read every application and aim to get back to you within a few weeks of submission. Response times may vary depending on the time of year, number of applicants, and other factors. If we’re interested in moving forward with your application, we’ll reach out via email.</p><p style=\"min-height:1.5em\"></p><div class=\"h2\">Ready to apply?</div><p style=\"min-height:1.5em\">Keep scrolling to submit your information. We’re excited to meet you! 😎</p><p style=\"min-height:1.5em\">If you have any questions during or after the application process, feel free to reach out to our Managing Editor Sam Lund (samuel [at] beomniscient [dot] com).</p><p style=\"min-height:1.5em\"><em>Confidence can sometimes hold us back from applying for a job. But there’s no such thing as a \"perfect\" candidate. Omniscient Digital is a place where everyone can grow. So however you identify and whatever background you bring with you, please apply if the idea of this role excites you.</em></p><p style=\"min-height:1.5em\"><br><br></p><img src=\"https://remotive.com/job/track/1990233/blank.gif?source=public_api\" alt=\"\"/>","tags":"[\"seo\",\"technical writing\"]","pubDate":"2025-03-30T04:51:28.000Z","link":"https://remotive.com/remote-jobs/writing/data-governance-content-writer-1990233","slug":"data-governance-content-writer-omniscient-9358"},{"id":1055832202,"title":"Sourcing Associate","company":"Intelligent Technical Solutions","image":"https://remotive.com/job/1990217/logo","description":"<p><strong>Job Description:</strong></p>\n<p>The Project-based Sourcing Associate is responsible for proactively identifying, attracting, and engaging top talent to build a strong candidate pipeline for current and future hiring needs. They collaborate closely with recruiters and hiring managers to support the company’s talent acquisition strategy.</p>\n<p><strong>Job Responsibilities:</strong></p>\n<p>Candidate Sourcing</p>\n<ul style=\"\">\n<li style=\"\">Proactively source candidates using job boards, LinkedIn, social media, and other platforms.</li>\n<li style=\"\">Conduct targeted searches for hard-to-fill and specialized roles.</li>\n<li style=\"\">Utilize Boolean search strategies and other creative sourcing techniques.</li>\n</ul>\n<p>Talent Pool Management</p>\n<ul style=\"\">\n<li style=\"\">Build and maintain a database of potential candidates for current and future hiring needs.</li>\n<li style=\"\">Organize talent pools by role type (Support, Mid-level, Specialized).</li>\n<li style=\"\">Track sourcing activity and candidate statuses in internal tools.</li>\n</ul>\n<p>Initial Outreach</p>\n<ul style=\"\">\n<li style=\"\">Draft and send engaging outreach messages to potential candidates.</li>\n<li style=\"\">Pre-screen candidates to assess their interest and availability.</li>\n<li style=\"\">Schedule initial calls or forward qualified profiles to recruiters for next steps.</li>\n</ul>\n<p>Collaboration and Reporting</p>\n<ul style=\"\">\n<li style=\"\">Work closely with recruiters and the team lead to align sourcing efforts with hiring priorities.</li>\n<li style=\"\">Provide daily or weekly reports on sourcing activities, including candidate pipelines and outreach response rates.</li>\n<li style=\"\">Identify sourcing challenges and suggest solutions.</li>\n</ul>\n<p><strong>Job Qualifications:</strong></p>\n<ul style=\"\">\n<li style=\"\">At least 1 year of recruitment or sourcing experience, ideally in a fast-paced environment and offshore accounts.</li>\n<li style=\"\">Strong knowledge of sourcing techniques (Boolean searches, LinkedIn Recruiter, etc.)</li>\n<li style=\"\">Excellent written communication for effective candidate outreach.</li>\n<li style=\"\">Organizational skills to manage pipelines and reports.</li>\n<li style=\"\">Familiarity with job boards, ATS platforms, and professional networking sites.</li>\n<li style=\"\">Proactive, adaptable, and goal-oriented — comfortable working independently but aligned with team goals.</li>\n<li style=\"\">Preferably with experience in sourcing for US applicants.</li>\n</ul>\n<p><strong>Job Requirements:</strong></p>\n<ul style=\"\">\n<li style=\"\">A home office set up that meets the following:</li>\n<ul style=\"\">\n<li style=\"\">A working computer (minimum 8gb RAM), i5 Windows10 or BigSur for Mac </li>\n<li style=\"\">Stable internet connection (at least 5mbps download and upload) </li>\n<li style=\"\">HD webcam/camera </li>\n<li style=\"\">A quality headset with noise cancellation feature for meetings </li>\n<li style=\"\">A mobile phone that has the capacity to install the Microsoft Authentication app </li>\n</ul>\n<li style=\"\">Able to provide NBI Clearance (for PH applicants) </li>\n</ul>\n<p><strong>Compensation:</strong></p>\n<p>Pay rate starts at<strong> $5.25-$6.5/hour</strong> and vary by experience and location.</p>\n<p><strong>Employment Terms:</strong></p>\n<ul style=\"\">\n<li style=\"\"><strong>Project-based for 6 months </strong>— renewable depending on hiring needs and performance.</li>\n<li style=\"\"><strong>Work hours</strong>: Flexible but aligned with core team hours (1pm - 5pm Pacific time) to ensure collaboration. Not exceeding 40 hours per week. </li>\n<li style=\"\">Semi-monthly, with clear deliverables tied to their output (e.g., number of qualified candidates sourced weekly).</li>\n<li style=\"\">No regular employee benefits.</li>\n</ul>\n<p> </p>\n<p> </p>\n<p> </p>\n<p> </p>\n<img src=\"https://remotive.com/job/track/1990217/blank.gif?source=public_api\" alt=\"\"/>","tags":"[\"social media\",\"ATS\",\"team lead\"]","pubDate":"2025-03-30T04:51:17.000Z","link":"https://remotive.com/remote-jobs/hr/sourcing-associate-1990217","slug":"sourcing-associate-intelligent-technical-solutions-4683"}]