[{"id":3822035687,"title":"Senior Product Manager","company":"Atticus","image":"https://media.licdn.com/dms/image/v2/D560BAQHWkZ4dfdnqcQ/company-logo_200_200/company-logo_200_200/0/1667241664749/atticushq_logo?e=1743033600&v=beta&t=IKimC8hb4UT-bQFVefDOJ5jfW_yxRN7of8ZLj5GtZ4Q","description":"<h3> </h3><h3><strong>About Atticus</strong></h3><p style=\"min-height:1.5em\">At any given time, 16 million Americans are experiencing a crisis that requires urgent help from our legal system or government. The right assistance could transform their lives. But today, most never get it. </p><p style=\"min-height:1.5em\">Atticus makes it easy for any sick or injured person in crisis to get the life-changing aid they deserve. In just three years, we’ve become the leading platform connecting people with disabilities to government benefits. We also help victims of accidents, misconduct, and violence get compensation from insurance. So far, we’ve gotten thousands of people access to over $2B in life-changing aid, and we’re just getting started.</p><p style=\"min-height:1.5em\">We've helped more than 20,000 people in need (see our <a target=\"_blank\" rel=\"noopener noreferrer nofollow\" href=\"https://www.trustpilot.com/review/atticus.com\">12,000+ five-star reviews</a>) and raised more than $50 million from top VC firms like Forerunner, GV (Google Ventures), and True Ventures. (We just closed our Series B round in May 2023, so we're well-funded for the foreseeable future.) We're small but moving fast — our team grew from 52 to 91 last year and we expect to grow again in 2024.</p><h3><strong>The Job</strong></h3><p style=\"min-height:1.5em\">To provide a great experience for a client, we have to do a lot quickly: Understand their situation, identify their needs, give advice, match them with the right lawyer, connect them to that lawyer, convince both parties to work together, and formalize the arrangement — all while doing our best to make a complex and scary system feel simple, accessible, and human. We’ve managed to do all of this in a way that users love, but we’ve done it by leaving some parts of the process quite manual... which means we can only scale so far.</p><p style=\"min-height:1.5em\">Your job is to change that: to lead the effort to transform our product into a platform that can serve millions of people. We’ve structured this role to provide meaningful ownership of our lawyer-facing and internal products, as well as exposure to all of our client-facing products. You'll craft a strategic plan and roadmap, then coordinate our teams — design, engineering, and client service — to implement it. You’ll own key metrics and outcomes, and get to think holistically about how to achieve them. The role mixes strategy, data analysis, product design, and a lot of people management. It's a hard job, with huge potential for impact, promotion, and building a team.</p><p style=\"min-height:1.5em\">You will be tasked with owning, maintaining, and expanding our core products. We are looking for someone with a unique combination of strategic prowess and operational acumen to drive this. An ideal candidate is a self-motivated, independent problem solver who is excited to ask questions, dive into the details, make recommendations, and drive results. </p><p style=\"min-height:1.5em\">You will work with our<a target=\"_blank\" rel=\"noopener noreferrer nofollow\" href=\"https://www.linkedin.com/in/michael-behr-a9a5948/\"> COO</a> &amp;<a target=\"_blank\" rel=\"noopener noreferrer nofollow\" href=\"https://www.linkedin.com/in/benjamin-abrahams-443a4366/\"> Director of Product</a>, but work across many teams (including the lawyer network, engineering, business operations) to adapt and develop solutions to stakeholder problems. It’s a pathway to several options, including staying here and growing as a product leader.</p><p style=\"min-height:1.5em\"></p><h3><strong>Responsibilities</strong></h3><ul style=\"min-height:1.5em\"><li><p style=\"min-height:1.5em\">Get to know our users - both clients and lawyers - and understand their needs.</p></li><li><p style=\"min-height:1.5em\">Craft a product vision for our next phase of growth. Go deep on strategy: become an expert in our business model, current offering, and key milestones to inform your work. </p></li><li><p style=\"min-height:1.5em\">Develop a comprehensive product roadmap and build alignment for it from the full team. </p></li><li><p style=\"min-height:1.5em\">Implement a product development process and manage it; teach best practices to others. </p></li><li><p style=\"min-height:1.5em\">Work with engineering and design to build and ship new products and features. Play the role of conductor, coordinating and empowering others. </p></li><li><p style=\"min-height:1.5em\">Own key targets and metrics. Collect and analyze data, and use it to drive decision-making at a company level. Propose hypotheses, run experiments to these them, and iterate quickly. </p></li></ul><h3><strong>Qualifications</strong></h3><p style=\"min-height:1.5em\">Required:</p><ul style=\"min-height:1.5em\"><li><p style=\"min-height:1.5em\">3+ years of product management experience, building and shipping products at scale</p></li><li><p style=\"min-height:1.5em\">Demonstrated success setting product vision and strategy, and the ability to speak thoughtfully about key decisions and tradeoffs you made</p></li><li><p style=\"min-height:1.5em\">Knowledge of best practices (from past work in a high-performing organization) and the ability to instill a great product culture as we grow</p></li><li><p style=\"min-height:1.5em\">Great communication and people skills — shown by great reviews from engineers and designers you’ve worked with</p></li><li><p style=\"min-height:1.5em\">Mastery of analytics platforms and ability to do you own data gathering and analysis</p></li><li><p style=\"min-height:1.5em\">A track record of running lean experiments and using data to drive decisions</p></li><li><p style=\"min-height:1.5em\">Ability to empathize with a diverse user base, including disabled and older users</p></li><li><p style=\"min-height:1.5em\">A demonstrated commitment to doing good and helping people</p></li></ul><p style=\"min-height:1.5em\">Bonus / Nice-to-Have:</p><ul style=\"min-height:1.5em\"><li><p style=\"min-height:1.5em\">Experience with complex consumer services and/or two-sided marketplaces</p></li><li><p style=\"min-height:1.5em\">Experience scaling a product organization from its early days</p></li><li><p style=\"min-height:1.5em\">Past work at a fast-growing startup.</p></li></ul><p style=\"min-height:1.5em\">We are strongly committed to building a diverse team. If you’re from a background that’s underrepresented in tech, we’d particularly love to meet you.</p><h3><strong>Salary and Benefits</strong></h3><p style=\"min-height:1.5em\">This is a rare opportunity to join a startup that has strong traction (substantial funding, well-respected backers, tremendous growth, and many happy customers) but is still small enough that you can have a huge impact and play a role in shaping our culture.</p><p style=\"min-height:1.5em\">We’re a certified B Corporation tackling a critical social problem. Our mission to help people in need drives everything we do, and your work here will touch many lives.</p><p style=\"min-height:1.5em\">We offer competitive pay — including equity — and generous benefits:</p><ul style=\"min-height:1.5em\"><li><p style=\"min-height:1.5em\">Medical and dental insurance with 100% of employee premiums covered</p></li><li><p style=\"min-height:1.5em\">15 vacation days &amp; 16 paid holidays each year</p></li><li><p style=\"min-height:1.5em\">Free membership to OneMedical</p></li><li><p style=\"min-height:1.5em\">$1,000/year reimbursable stipend for education and training outside of work </p></li><li><p style=\"min-height:1.5em\">$600/year reimbursable stipend for internet service</p></li><li><p style=\"min-height:1.5em\">Up to $1,200/year student loan repayment assistance</p></li><li><p style=\"min-height:1.5em\">401(k) and optional HSA</p></li><li><p style=\"min-height:1.5em\">Free snacks, drinks, weekly lunches, and regular team dinners/events/retreats</p></li><li><p style=\"min-height:1.5em\">Humble, thoughtful, smart, fun colleagues</p></li></ul><h3><strong>Location</strong></h3><p style=\"min-height:1.5em\">This job is fully remote and we’re committed to empowering everyone with flexibility. Live wherever, work remotely, and travel to LA (on the company dime) as needed to be with your colleagues —somewhere between quarterly and yearly. We care a lot about building a great culture and we think some interactions need to happen in person, so we put a lot of thought into retreats, offsites, and other ways to gather.</p>","tags":"[\"management\",\"engineering\",\"legal\"]","pubDate":"2025-02-15T23:31:36.998Z","link":"https://jobs.ashbyhq.com/atticus/db26e9c5-06a5-4ff9-a33c-bad6aae7dbbd","slug":"senior-product-manager-atticus-3794"}]