[{"id":1313791012,"title":"SMB Sales Manager - Fleetcard","company":"Bobtail","image":"https://media.licdn.com/dms/image/D4E0BAQGvUyfPVBWDyg/company-logo_200_200/0/1657595552015?e=2147483647&v=beta&t=EecsDCOy3Fh_26M1noQDDIYw8-JuGKz_d1JDvcBZ-yI","description":"\n    \n\n    <h2>About Bobtail</h2>\n<p>Bobtail is dedicated to increasing happiness by eliminating inefficiencies in the supply chain.&nbsp; We envision a supply chain without friction, fraud, waste, and abuse where companies succeed based on the value they create.&nbsp;&nbsp;</p>\n<p>We work in a unique way at Bobtail, where we value teams over individuals and encourage experimentation and iteration to constantly improve.&nbsp; Teams are given flexibility in working towards a shared purpose and given the freedom to decide how they will accomplish their goals.&nbsp;&nbsp;</p>\n<p>If you are an out-of-the-box thinker who proactively collaborates with others to solve problems and achieve your goals, we would love to talk to you.&nbsp;&nbsp;</p>\n<p>The things we value:</p>\n<ol>\n<li>Mission</li>\n<li>Teams over individuals</li>\n<li>Collaboration</li>\n<li>Communication</li>\n<li>Iteration</li>\n<li>Experimentation and failing fast</li>\n<li>Initiative and solutions-oriented approach</li>\n<li>Documentation</li>\n<li>Data</li>\n<li>Mental health and work-life balance</li>\n<li>Diversity</li>\n<li>Transparency<br><br></li>\n</ol>\n<h2>You should apply if you have:</h2>\n<ul>\n<li>Proven track record of success in SMB sales, ideally within fleet management, fuel card, or related industries. 10+ years experience in business-to-business sales.&nbsp;</li>\n<li>Previous experience in building and managing a sales team from the ground up.</li>\n<li>Strong leadership skills with the ability to motivate and inspire a team towards achieving ambitious goals.</li>\n<li>Excellent communication, negotiation, and interpersonal skills.</li>\n<li>Analytical and detail-oriented mindset with the ability to interpret sales performance metrics and drive improvements.</li>\n</ul>\n<h3>&nbsp;</h3>\n<h2><strong>You will be responsible for:</strong></h2>\n<ul>\n<li>Build and lead a high-performing sales team focused on selling fleet card solutions to SMB trucking companies.</li>\n<li>Develop and execute strategic sales plans to meet and exceed sales targets and expand our customer base.</li>\n<li>Recruit, train, and mentor team members, fostering a culture of success, accountability, and continuous improvement.</li>\n<li>Collaborate closely with marketing, product, and operations teams to optimize sales strategies and enhance product offerings.</li>\n<li>Track weekly and monthly progress and success of your team by measuring various primary KPIs, coaching and enabling their success across short and long-term goals</li>\n<li>Prepare regular sales reports and forecasts for senior management, providing insights and recommendations for improvement.</li>\n<li>Ensure correct use of CRM, processes, and best practices to maintain pipeline hygiene, planning, and forecasting.</li>\n<li>Work and make decisions in accordance with Bobtail’s mission, vision, and values</li>\n</ul>\n<h3><strong>Benefits:</strong></h3>\n<ul>\n<li>Monthly Mental Break Day</li>\n<li>Work from home (or wherever)</li>\n<li>Parental leave</li>\n<li>Paid Time Off</li>\n</ul>\n<h5><br>Creating a diverse and inclusive workplace is Bobtail’s nucleus. We are an equal opportunity employer and embrace people of different backgrounds, cultures, religions, national origins, races, colors, genders, gender expressions, sexual orientations, ages, marital status, veteran status, experiences, abilities, and perspectives</h5>\n\n    \n\n    \n","tags":"[\"management\"]","pubDate":"2024-07-19 05:18:46.140","link":"https://boards.greenhouse.io/bobtail/jobs/4444448005","savedDate":"2024-07-19 05:18:46.140","slug":"smb-sales-manager-fleetcard-bobtail-2102"},{"id":3531189555,"title":"Lead VFX Artist","company":"Crytek","image":"https://lever-client-logos.s3-us-west-2.amazonaws.com/2a61cdfd-29d3-4707-b965-c4527aa67d0c-1593500521772.png","description":"<div>Crytek is looking for a <b>Lead VFX Artist</b> to join the <i>Hunt: Showdown</i> team.&nbsp;</div><div>&nbsp;</div><div><b>*Sample pictures or portfolio link which shows sample work are necessary.*</b></div><div><br></div><div><b><u>Relocation &amp; Remote Work</u></b></div><div><br></div><div><span style=\"font-size: inherit\">For this position, you have one of the following options:</span></div><div><br></div><div><span style=\"font-size: inherit\">1. Come to our modern headquarters in Frankfurt and receive an attractive relocation package and have access to all of our benefits.</span></div><div><br></div><div><span style=\"font-size: inherit\">2. If you are already living in one of the following countries, we are able to offer you a permanent work contract and allow you to work remotely&nbsp;as an employee&nbsp;from there.&nbsp;</span></div><div><span style=\"font-size: inherit\">Germany</span></div><div><span style=\"font-size: inherit\">Sweden</span></div><div><span style=\"font-size: inherit\">United Kingdom</span></div><div><span style=\"font-size: inherit\">Spain</span></div><div><span style=\"font-size: inherit\">Poland</span></div><div><span style=\"font-size: inherit\">Austria</span></div><div><br></div><div><span style=\"font-size: inherit\">3. If you are interested in full-time remote work in any other country (max. +/- 2 hours CET), we&nbsp;can offer you&nbsp;a freelance contract arrangement.</span></div><h3>Responsibilities</h3><li>Lead the day-to-day management of the VFX team; </li><li>Along with the Art Director, regular appraisal, review and objective setting for the VFX team;</li><li>Ensure good communication &amp; coordination between the VFX team and other disciplines of the bigger team;</li><li>Assist with recruitment and selection of staff for the team;</li><li>Liaise with external service providers if required;</li><li>Prepare task schedules for the VFX team in conjunction with Artists, Art Project Managers, Producers and other Project Managers;</li><li>Define and enforce industry leading working practices and structure for the given project, based on scope and resources;</li><li>Ensure good quality standards are set and achieved across the team;</li><li>Maintain and enforce the VFX vision and style set out by the Art Director;</li><li>Creation of real-time particle systems in CRYENGINE including textures and materials</li><li>Explore new technologies on the given platforms to achieve best possible results</li><li>Implementation and optimization of shader based effects&nbsp;</li><li>Supervise and mentor other VFX artists on the team</li><li>Work together with our Research and Development department to improve workflows</li><li>Write documentation.</li>,<h3>Requirements</h3><li>5+ years experience in game development</li><li>Last and/or current gen console experience</li><li>Management and project planning experience;</li><li>Expert understanding of current game FX processes, limitations and dependencies&nbsp;&nbsp;</li><li>Strong knowledge of 3ds Max / Maya or Blender, Photoshop, Substance Designer&nbsp;</li><li>Strong knowledge of common real-time game engines</li><li>Established interpersonal and organizational skills</li><li>Ability to deliver and receive constructive feedback</li><li>The ability to manage and supervise artists and willingness to carry out mentorship tasks</li><li>Good English communication and writing skills&nbsp;&nbsp;</li><li>Positive, problem-solving and team-oriented attitude</li><li>Excellent understanding of production procedures and software employed in the team:</li><li>Expert understanding of current game art processes, limitations and dependencies;</li><li>Recruitment/interviewing experience;</li><li>Ability to manage the demands of numerous people and tasks;</li><li>Team leadership qualities and a team player.</li><div><br></div><li><b>A portfolio or reel that demonstrates the following:&nbsp;</b>&nbsp;</li><li><i>Real-time particle FX including a technical breakdown&nbsp;</i></li><li><i>Strong technical skills (textures / materials / baking / scripting / shaders)</i></li><li><i>Strong artistic skills (shapes / colors / proportions / timing / lighting and movement)</i></li><li><i>Keen eye for details and realism</i></li>,<h3>Pluses</h3><li>Experience with CRYENGINE;&nbsp;</li><li>Experience with Houdini;</li><li>Experience with EmberGen;</li><li>Ability to write HLSL.</li><div><b><span style=\"font-size: 2.2rem\">What you can expect from us</span></b></div><div><br></div><div><b>Career Path&nbsp;</b></div><div>Your professional development is important to us, so we have laid out a career plan to help you progress towards your goals and objectives.&nbsp;</div><div><br></div><div><b>Company Apartment&nbsp;</b></div><div>To help you get settled, we provide you with a fully furnished company apartment during your first three months in Frankfurt.*&nbsp;</div><div>&nbsp;</div><div><b>Relocation&nbsp;Support&nbsp;</b></div><div>We offer a relocation budget and full coverage of flights to Frankfurt for you and your family.&nbsp;</div><div>You can expect extensive assistance with visa, work permits, and communication with authorities during the relocation process, as well as help settling into Germany (e.g. setting up appointments with banks, government agencies, schools, landlords, finding apartments etc.).*&nbsp;</div><div><b>&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;</b></div><div><b>Public Transport Pass&nbsp;</b></div><div>Discover Frankfurt by bus, tram and metro – free of charge.*&nbsp;</div><div>&nbsp;</div><div><b>Gym Card&nbsp;</b></div><div>A healthy body is a healthy mind. We offer a membership at the premium gym chain Fitness First in Germany. Work out, join group fitness classes, or relax in the wellness facilities.</div><div>&nbsp;</div><div><b>International Environment&nbsp;</b></div><div>We truly embody diversity at Crytek. With employees from over 42 different countries, we define ourselves by our cultural diversity.&nbsp;</div><div><br></div><div><b>German Classes&nbsp;</b></div><div>Understanding the local culture will make your stay abroad more enjoyable, and Crytek supports that by offering German language courses for you and your family.&nbsp;</div><div>&nbsp;&nbsp;</div><div><b>Events</b></div><div>Join us on our exciting company events, including new starter breakfasts, summer and winter parties, our annual trip to Gamescom in Cologne, and many more!*&nbsp;</div><div>We are all gamers: stay connected and play games with your colleagues at our remote gaming parties.</div><div>&nbsp;</div><div><b>Vacation Days&nbsp;</b></div><div>At our Frankfurt office you can enjoy 24 days of vacation per year, and every 2 years you get 1 more (up to a maximum of 28 days). You will also have on average 10 public holidays on top of the days you take off. If you are working from another country, local standards apply.</div><div>&nbsp;&nbsp;</div><div>*only applicable to employees in Frankfurt.</div>","tags":"[\"management\"]","pubDate":"2024-07-18 13:13:46.112","link":"https://jobs.lever.co/crytek/d6e99431-e8a0-45cc-a5d7-460f6735603b","savedDate":"2024-07-19 05:18:46.141","slug":"lead-vfx-artist-crytek-504"},{"id":8967691634,"title":"Senior Data Engineer","company":"Airalo","image":"https://lever-client-logos.s3.us-west-2.amazonaws.com/55028a36-609c-479c-9553-d4689ff2dd8c-1669620566663.png","description":"<div><span style=\"font-size: 11pt\">Are you passionate about data engineering and eager to take on a challenging and influential role within a forward-thinking company? Do you thrive in environments where innovation, efficiency, and attention to detail are paramount? If so, we invite you to join Airalo as a </span><b style=\"font-size: 11pt\">Senior Data Engineer</b><span style=\"font-size: 11pt\">. In this role, you will be at the forefront of shaping our data infrastructure and ensuring the seamless flow of critical information. You will develop, automate, and maintain data pipelines, enhancing the efficiency and reliability of our data systems. Your expertise will be crucial in optimizing data engineering workflows and upholding the highest standards of data governance and security.</span></div><h3>Responsibilities include but are not limited to:</h3><li>Design and develop custom ingestion pipelines, with an initial focus on integrating aggregate Call Detail Records to accurately measure usage per eSIM / user</li><li>Identify areas for process optimization within data engineering workflows and implement best practices to enhance efficiency and reliability</li><li>Orchestrate and monitor data pipelines to ensure seamless data flow</li><li>Manage and optimize data warehouse performance, ensuring fast and reliable data access</li><li>Implement and enforce data governance and security policies to ensure data integrity, privacy, and compliance with relevant regulations</li><li>Stay up to date with the latest industry trends and technologies, recommending new techniques and tools to keep us ahead of the curve</li>,<h3>Must-haves:</h3><li>4+ years of hands-on work with modern warehousing solutions like Snowflake or BigQuery</li><li>Track record of building and automating robust, scalable data pipelines</li><li>Deep understanding of data architecture, data governance and data security</li><li>Familiarity with orchestrators such as Airflow, Prefect or <a href=\"http://Mage.AI\">Mage.AI</a>&nbsp;</li><li>Expert knowledge of SQL and Spark</li><li>Proficiency with at least one language out of Python / Scala / Java</li><li>Working knowledge of Docker, Git and the command lineClear and direct communication skills about complex, technical topics</li><li>A natural passion for structure and efficiency, with excellent attention to detail</li>,<h3>Good to Have:</h3><li>Experience with managing AWS / GCP services</li><li>Knowledge of NoSQL databases</li><li>Experience working with telco, MNOs &amp; MNVOs</li><div>If you are interested in this position, <b>please apply via the link.</b></div><div><br></div><div><i style=\"font-size: 15px\">Please note that our Engineering team works in the CET timezone, so candidates will need to reside in countries with the same time zone or similar to it and will need to already have permit to work in the country where they are based.</i></div>","tags":"[\"engineering\",\"database\",\"aws\"]","pubDate":"2024-07-18 08:19:18.432","link":"https://jobs.lever.co/airalo/54f22e59-c90f-4853-9b8d-1c39ecbc72cd","savedDate":"2024-07-19 05:18:46.140","slug":"senior-data-engineer-airalo-4645"},{"id":3814212264,"title":"Senior Analytics Engineer","company":"Airalo","image":"https://lever-client-logos.s3.us-west-2.amazonaws.com/55028a36-609c-479c-9553-d4689ff2dd8c-1669620566663.png","description":"<div><span style=\"font-size: 11pt\">Join Airalo as a </span><b style=\"font-size: 11pt\">Senior Analytics Engineer</b><span style=\"font-size: 11pt\"> and be at the forefront of our data initiatives. In this pivotal role, you will collaborate with various departments to understand and address their data needs, design and implement data models, and provide actionable insights that drive decision-making. Your expertise will ensure the highest quality of analytics code. Your contributions will be crucial in helping us leverage data to its fullest potential, ultimately supporting our strategic goals and enhancing overall business performance.</span></div><h3>Responsibilities include, but are not limited to:</h3><li>Work with multiple departments to understand and address their data needs</li><li>Design and implement efficient ELT pipelines to streamline data processing</li><li>Build and maintain dashboards that support strategic decision-makingMaintain accurate data documentation and definitions</li><li>Advocate for best practices, tools, and methods to ensure high-quality analytics code</li><li>Train business users on effective use of data visualization tools</li><li>Stay up to date with the latest industry trends and technologies, recommending new techniques and tools to keep us ahead of the curve</li>,<h3>Must-haves:</h3><li>4+ years of related work experience with a track record of driving business insights</li><li>Exceptional skills in data modeling</li><li>Familiarity with EL solutions such as Fivetran or Stitch</li><li>Expert knowledge of SQL and dbt</li><li>Working knowledge of Python, Git and the command line</li><li>Proficiency with Looker or a similar tool</li><li>Clear and direct communication skills about complex, technical topics</li><li>Natural passion for structure and efficiency, and excellent attention to detail</li>,<h3>Good to Have:</h3><li>Experience working with GCP stack, especially BigQuery</li><li>Experience working with telco, MNOs &amp; MNVOs</li><div>If you are interested in this position, <b>please apply via the link.</b></div><div><br></div><div><i style=\"font-size: 15px\">Please note that our Data team works in the CET timezone, so candidates will need to reside in countries with the same time zone or similar to it and will need to already have permit to work in the country where they are based.</i></div>","tags":"[]","pubDate":"2024-07-18 08:13:46.502","link":"https://jobs.lever.co/airalo/50cc88d3-03e6-4035-a117-0680895d14ca","savedDate":"2024-07-19 05:18:46.140","slug":"senior-analytics-engineer-airalo-4368"},{"id":6197532686,"title":"Senior Software Engineer - AI Developer Experience","company":"Timescale","image":"https://avatars.githubusercontent.com/u/8986001?s=200&v=4","description":"&lt;p&gt;We&#39;re looking for experienced engineers with a backend developer background who are now passionate/excited about AI products and workflows. You will help us build and maintain our AI-related Python libraries and integrations, help define and design our DX (developer experience) for AI products, write demos and content around these products, and automate benchmarks.&amp;nbsp;&lt;/p&gt;\n&lt;p&gt;You need to be excited to work with our users to create the best platform for developing AI applications. You should be an engineer with significant Python experience and be passionate about creating UX for development tools that excite and delight. Benchmarking, automation, and PostgreSQL experience is preferred. This is a fast-evolving space, and you need to be a nimble “jack of all trades” engineer who’s excited to be working on new projects and with new technologies, as well as an engineer who likes to interact with developer communities by writing blog posts, giving talks, etc. You will get extensive hands-on experience at the intersection of AI applications and data in this exciting new role!&amp;nbsp;&lt;/p&gt;\n&lt;p&gt;Timescale is an all-remote organization open to candidates in American and European time zones to allow for team collaboration. This is a full-time position.&lt;/p&gt;\n&lt;h3&gt;&lt;strong&gt;Requirements&lt;/strong&gt;&lt;/h3&gt;\n&lt;ul&gt;\n&lt;li&gt;Strong development skills in Python&lt;/li&gt;\n&lt;li&gt;Passion for great UX for developer tools.&lt;/li&gt;\n&lt;li&gt;Experience using relational databases (PostgreSQL preferred).&lt;/li&gt;\n&lt;li&gt;Experience with system automation and linux&amp;nbsp;&lt;/li&gt;\n&lt;li&gt;Experience with generative AI is preferred (although interest and passion is required).&lt;/li&gt;\n&lt;/ul&gt;&lt;div class=&quot;content-conclusion&quot;&gt;&lt;p&gt;By applying for this position, you are agreeing to &lt;a href=&quot;https://www.timescale.com/legal/timescale-applicant-privacy-notice&quot;&gt;Timescale&#39;s Applicant Privacy Notice.&amp;nbsp;&lt;/a&gt;&lt;/p&gt;&lt;/div&gt;","tags":"[\"postgres\",\"legal\",\"database\"]","pubDate":"2024-07-18 02:35:19.000","link":"https://www.timescale.com/careers/7554769002?gh_jid=7554769002","savedDate":"2024-07-19 05:18:46.138","slug":"senior-software-engineer-ai-developer-experience-timescale-5228"},{"id":2119502585,"title":"Senior Software Engineer - Backend - AI Projects","company":"Timescale","image":"https://avatars.githubusercontent.com/u/8986001?s=200&v=4","description":"&lt;p&gt;We are a data platform company that is aiming to develop new SaaS tools to help AI developers develop AI-based applications. Timescale is looking for an experienced Backend Engineer with a track record of building great SaaS and cloud services to help us develop these tools.&lt;/p&gt;\n&lt;p&gt;This is a new product and thus it is an exciting opportunity to play a central role in developing the next great AI developer platform. You will be responsible for playing a core role in designing, developing and implementing backend services to power everything from running the latest open-source models to building state-of-the-art tools for eval and tracing. This is a fast evolving space and you need to be a nimble “jack of all trades” engineer that’s excited to be working on new projects and with new technologies. You will get a lot of hands-on experience at the intersection of AI applications and data.&amp;nbsp;&lt;/p&gt;\n&lt;p&gt;While experience building AI applications is not required, it is definitely a big plus if applying to this role. You should, however, have a strong interest in gen-AI and in building developer tools to help AI developers. Product thinking is also very important for this role.&lt;/p&gt;\n&lt;p&gt;Timescale is an all-remote organization open to candidates in American and European timezones to allow for team collaboration. This is a full-time position.&lt;/p&gt;\n&lt;h3&gt;&lt;strong&gt;Requirements&lt;/strong&gt;&lt;/h3&gt;\n&lt;ul&gt;\n&lt;li&gt;5+ years of engineering experience&lt;/li&gt;\n&lt;li&gt;Strong programming skills (we mostly use Go but are more concerned with good fundamentals)&lt;/li&gt;\n&lt;li&gt;Experience building gen-AI applications is preferred.&lt;/li&gt;\n&lt;li&gt;Experience designing, understanding, and debugging complex distributed systems&lt;/li&gt;\n&lt;li&gt;Deep knowledge of Linux, container environments, bash, and infrastructure as code (e.g., Terraform, Pulumi.&lt;/li&gt;\n&lt;li&gt;Experience building SaaS developer tools preferred&lt;/li&gt;\n&lt;/ul&gt;&lt;div class=&quot;content-conclusion&quot;&gt;&lt;p&gt;By applying for this position, you are agreeing to &lt;a href=&quot;https://www.timescale.com/legal/timescale-applicant-privacy-notice&quot;&gt;Timescale&#39;s Applicant Privacy Notice.&amp;nbsp;&lt;/a&gt;&lt;/p&gt;&lt;/div&gt;","tags":"[\"pulumi\",\"engineering\",\"legal\"]","pubDate":"2024-07-18 02:31:17.000","link":"https://www.timescale.com/careers/7554764002?gh_jid=7554764002","savedDate":"2024-07-19 05:18:46.138","slug":"senior-software-engineer-backend-ai-projects-timescale-1289"},{"id":6913073182,"title":"Senior Front-End Engineer - AI Projects","company":"Timescale","image":"https://avatars.githubusercontent.com/u/8986001?s=200&v=4","description":"&lt;p&gt;We are a data platform company that is aiming to develop new SaaS tools to help AI developers develop AI-based applications. Timescale is looking for an experienced Senior Front-End Engineer with a track record of building great SaaS and cloud services to help us develop these tools and create a delightful user experience for our customers.&lt;/p&gt;\n&lt;p&gt;This is a new product, and thus, it is an exciting opportunity to play a central role in developing the next great AI developer platform. You will be responsible for playing a core role in developing and implementing the UI/UX for our platform and helping customers have success using our product to serve their customers’ needs. If you are passionate about both developer tools and great design and want to help empower developers worldwide, then this is the role for you.&lt;/p&gt;\n&lt;p&gt;Timescale is an all-remote organization open to candidates in American and European time zones to allow for team collaboration. This is a full-time position.&lt;/p&gt;\n&lt;p&gt;Responsibilities&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;Play a central role in developing and implementing SaaS product experience, including UI / UX for managed cloud services and data-driven visualization.&lt;/li&gt;\n&lt;li&gt;Strong self-driven execution, ownership, and delivery&lt;/li&gt;\n&lt;li&gt;Writing production-level code in Typescript with React&lt;/li&gt;\n&lt;li&gt;Strong experience with and commitment to testing (&lt;a href=&quot;https://www.cypress.io/&quot;&gt;Cypress&lt;/a&gt; is our tool of choice)&lt;/li&gt;\n&lt;li&gt;While your primary focus will be in Frontend, some of the initiatives will require e2e work which includes API development.&lt;/li&gt;\n&lt;li&gt;Work with product, design, and other engineers to deliver customer experiences&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;Skills &amp;amp; Requirements&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;5+ years of UI/UX or front-end development work&lt;/li&gt;\n&lt;li&gt;Strong Typescript programming skills and modern JS frameworks experience (React strongly preferred)&lt;/li&gt;\n&lt;li&gt;Interest and passion for the AI space.&lt;/li&gt;\n&lt;li&gt;Cares about the smallest details of look &amp;amp; feel, user flows, and UI/UX&lt;/li&gt;\n&lt;li&gt;Prior experience of developing backend services, primarily on the API layer.&lt;/li&gt;\n&lt;li&gt;Some familiarity with SQL or other data-driven query languages&amp;nbsp;&lt;/li&gt;\n&lt;li&gt;Ability to work in a fast-paced start-up environment&lt;/li&gt;\n&lt;/ul&gt;&lt;div class=&quot;content-conclusion&quot;&gt;&lt;p&gt;By applying for this position, you are agreeing to &lt;a href=&quot;https://www.timescale.com/legal/timescale-applicant-privacy-notice&quot;&gt;Timescale&#39;s Applicant Privacy Notice.&amp;nbsp;&lt;/a&gt;&lt;/p&gt;&lt;/div&gt;","tags":"[\"typescript\",\"legal\"]","pubDate":"2024-07-18 02:27:23.000","link":"https://www.timescale.com/careers/7554763002?gh_jid=7554763002","savedDate":"2024-07-19 05:18:46.138","slug":"senior-front-end-engineer-ai-projects-timescale-6798"},{"id":9102612905,"title":"Copywriter - AI Tutor","company":"Mindrift","image":"https://remotive.com/job/1924911/logo","description":"<p>If you're a professional who works with text, we have an exciting opportunity to use your writing, editing, technical, and creative skills in a new and innovative way. As an <strong>AI Tutor - Writer</strong>, you won’t just be writing; you'll be helping to shape the future of AI.</p>\n<p>We’re seeking freelance writers, copywriters, and wordsmiths to collaborate with us in creating a diverse range of content. This role is more than traditional copywriting; it involves training AI systems by crafting text that teaches and informs their responses.</p>\n<p>As an <strong>AI Tutor - Writer</strong> you will use your writing skills to create text on a wide range of topics. Working within our style guide, you will create responses that will form the ‘voice’ for future AI. You will create original, helpful, honest, harmless text responses and you’ll fact check your work using verifiable sources.</p>\n<p><br><br><strong>Requirements</strong><br><br></p>\n<ul style=\"\">\n<li style=\"\">You have some <strong>professional or educational experience</strong> in creative writing, copywriting or editing in English.</li>\n<li style=\"\"><strong>Your level of English is native or proficiency (C2).</strong></li>\n<li style=\"\">You have a <strong>degree </strong>in communications, linguistics, literature, journalism, or similar.</li>\n<li style=\"\">You are ready to learn new methods, able to switch between projects and topics quickly and sometimes work with challenging, complex guidelines.</li>\n<li style=\"\">Our freelance role is fully remote so, you just need a laptop, internet connection, time available and enthusiasm to take on a challenge.</li>\n</ul>\n<p><br><br><strong>Benefits</strong><br><br></p>\n<ul style=\"\">\n<li style=\"\">Take part in part-time, remote, freelance projects that respect your primary professional or academic commitments.</li>\n<li style=\"\">Try your hand at an AI project and enrich your portfolio with new experiences.</li>\n<li style=\"\">Make a tangible impact on the quality of AI.</li>\n</ul>\n<img src=\"https://remotive.com/job/track/1924911/blank.gif?source=public_api\" alt=\"\"/>","tags":"[\"AI/ML\",\"linguistics\",\"editing\"]","pubDate":"2024-07-17 06:50:00.000","link":"https://remotive.com/remote-jobs/writing/copywriter-ai-tutor-1924911","savedDate":"2024-07-19 05:18:46.137","slug":"copywriter-ai-tutor-mindrift-8073"},{"id":7968609056,"title":"Senior Java Developer (worldwide remote, work anywhere)","company":"CloudLinux","image":"https://pbs.twimg.com/profile_images/696718028084482050/ymY3OEPk_400x400.png","description":"<p>At CloudLinux, we seek a talented and passionate Java Developer to join our team.&nbsp;</p><p>As the leading provider of the #1 OS for web-hosting providers, we pride ourselves on developing innovative products used by thousands of companies worldwide.&nbsp;</p><p>In this role, you will be working on the Extended Lifecycle team, where you will have the opportunity to make a significant impact by providing a secure Java instrumentation for heterogeneous Java-based environments.</p><p>We are looking for someone with extensive expertise in Java tools and a fresh and revolutionary approach. This challenging mission requires a deep understanding of Java tools and a keen eye for creating groundbreaking solutions.</p><p>For more details about the project, please visit the product website at <a href=\"https://tuxcare.com/extended-lifecycle-support/\" rel=\"nofollow noreferrer noopener\" class=\"external\">TuxCare.com</a>.<br><br><strong>What will you do in this role?</strong></p><ul> <li>Your role will involve enhancing the security of Java and delving deep into its inner workings.</li> <li>You'll be tasked with conducting research and running experiments to expedite the assembly of Java packages.</li> <li>The fruits of your labor will be a more secure Java environment, facilitating the development work of others.</li> <li>You'll be investigating vulnerabilities in Java and Java libraries, particularly focusing on the most popular end-of-life versions of Java.</li> <li>Your responsibilities will also include improving automation processes that construct the dependency tree and automatically rebuild projects, etc.</li> </ul><h3>Requirements: </h3><p><strong>To be successful in this role, you should have:</strong></p><ul> <li>4+ years in software development.</li> <li>High-level Java core, Spring framework.</li> <li>Experience with NoSQL and PostgreSQL.</li> <li>Experience with Gitlab as CI/CD will be a plus.</li> <li>Experience with repository management systems such as Nexus will be a plus.</li> </ul><h3>Benefits: </h3><p><strong>What's in it for you?</strong></p><ul> <li>A focus on professional development.</li> <li>Interesting and challenging projects.</li> <li>Fully remote work with flexible hours, allowing you to schedule your day and work from any location worldwide.</li> <li>Paid one month of vacation per year and unlimited sick leave.</li> <li>Medical insurance reimbursement.</li> <li>Co-working and gym/sports reimbursement.</li> <li>The opportunity to receive a reward for the most innovative idea that the company can patent.</li> </ul><p></p><p><em>By applying for this position, you agree with </em><a href=\"https://cloudlinux.com/privacy-policy\" rel=\"nofollow noreferrer noopener\" class=\"external\"><em>Cloudlinux Privacy Policy</em></a><em> and give us your consent to maintain and process your personal data with this respect. Please read our Privacy Policy for more information.</em></p>","tags":"[\"postgres\",\"management\"]","pubDate":"2024-07-17 00:00:00.000","link":"https://apply.workable.com/cloudlinux-1/j/AB7592AA0A","savedDate":"2024-07-19 05:18:46.140","slug":"senior-java-developer-worldwide-remote-work-anywhere-cloudlinux-5782"},{"id":7110054157,"title":"Junior Customer Support Representative (Onsite in Frankfurt)","company":"Crytek","image":"https://lever-client-logos.s3-us-west-2.amazonaws.com/2a61cdfd-29d3-4707-b965-c4527aa67d0c-1593500521772.png","description":"<div>We are seeking a dedicated and detail-oriented <b>Junior Customer Support Representative</b> to join our team in our Frankfurt Studio.</div><div><br></div><div>In this role, you will handle privacy related inquiries with precision and compliance, ensuring that the rights and privacy of our users are meticulously protected. Additionally, you will provide crucial game support, troubleshooting technical challenges and improving our player experiences across our gaming platforms.</div><div>&nbsp;</div><div>This role is based on site in our headquarters in Frankfurt, Germany.  You will have the chance to work alongside our worldclass team that  features some of the best developers in the industry and take advantage  of our attractive relocation package.</div><h3>Responsibilities:</h3><li>Handle and resolve a wide range of privacy related matters, including requests for data deletion, access, and portability, while ensuring full compliance with relevant laws.</li><li>Maintain accurate records of all privacy related inquiries and their resolutions.</li><li>Work collaboratively with relevant stakeholders to refine&nbsp;processes concerning the handling of privacy matters.</li><li>Assist customers with technical issues related to game installation, performance, and network challenges.</li><li>Provide timely and effective troubleshooting and problem resolution.</li><li>Address and manage player reports, including in-game issues and bug reporting.</li><li>Collaborate with the development team&nbsp;to relay and troubleshoot technical issues reported by players.</li><li>Respond to general questions and inquiries from&nbsp;our website, ensuring customer&nbsp;satisfaction and engagement.</li><li>Handle customer interactions across multiple channels, including email, chat, and social media.</li><li>Maintain a high level of customer satisfaction through professional and courteous interactions.</li><li>Document and update customer interactions and resolutions in the support ticket system.</li>,<h3>Requirements:</h3><li>Excellent written and verbal communication skills in English.</li><li>Strong problem-solving skills and attention to detail.</li><li>Knowledge or interest in data privacy principles and relevant regulations, including but not limited to GDPR.</li><li>Basic technical understanding related to game installation and performance troubleshooting.</li><li>Ability to work independently and collaboratively as part of a team.</li><li>Customer-focused attitude with a passion for helping others.</li><li>EU work permit.</li><li>Willingness to relocate to Frankfurt. </li><div><br></div><div><br></div>,<h3>Pluses:</h3><li>Knowledge about games and the games industry.</li><li>Additional languages.</li><div><b>What you can expect from us</b></div><div>&nbsp;</div><div><b>Career Path&nbsp;</b></div><div>Your professional development is important to us, so we have laid out a career plan to help you progress towards your goals and objectives.&nbsp;</div><div>&nbsp;</div><div><b>Company Apartment&nbsp;</b></div><div>To help you get settled, we provide you with a fully furnished company apartment during your first three months in Frankfurt.*&nbsp;</div><div>&nbsp;</div><div><b>Relocation&nbsp;Support&nbsp;</b></div><div>We offer a relocation budget and full coverage of flights to Frankfurt for you and your family.&nbsp;</div><div>You can expect extensive assistance with visa, work permits, and communication with authorities during the relocation process, as well as help settling into Germany (e.g. setting up appointments with banks, government agencies, schools, landlords, finding apartments etc.).*&nbsp;</div><div><b>&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;</b></div><div><b>Public Transport Pass&nbsp;</b></div><div>Discover Frankfurt by bus, tram and metro – free of charge.*&nbsp;</div><div>&nbsp;</div><div><b>Gym Card&nbsp;</b></div><div>A healthy body is a healthy mind. We offer a membership at the premium gym chain Fitness First in Germany. Work out, join group fitness classes, or relax in the wellness facilities.</div><div>&nbsp;</div><div><b>International Environment&nbsp;</b></div><div>We truly embody diversity at Crytek. With employees from over 42 different countries, we define ourselves by our cultural diversity.&nbsp;</div><div>&nbsp;</div><div><b>German Classes&nbsp;</b></div><div>Understanding the local culture will make your stay abroad more enjoyable, and Crytek supports that by offering German language courses for you and your family.&nbsp;</div><div>&nbsp;&nbsp;</div><div><b>Events</b></div><div>Join us on our exciting company events, including new starter breakfasts, summer and winter parties, our annual trip to Gamescom in Cologne, and many more!*&nbsp;</div><div>We are all gamers: stay connected and play games with your colleagues at our remote gaming parties.</div><div>&nbsp;</div><div><b>Vacation Days&nbsp;</b></div><div>At our Frankfurt office you can enjoy 24 days of vacation per year, and every 2 years you get 1 more (up to a maximum of 28 days). You will also have on average 10 public holidays on top of the days you take off. </div><div>If you are working from another country, local standards apply.</div><div>&nbsp; </div><div>&nbsp;&nbsp;</div><div>*only applicable to employees in Frankfurt.</div>","tags":"[\"aws\"]","pubDate":"2024-07-16 15:15:33.595","link":"https://jobs.lever.co/crytek/5b13cf90-9a08-4d4e-b0e5-3f77afbf506a","savedDate":"2024-07-19 05:18:46.141","slug":"junior-customer-support-representative-onsite-in-frankfurt-crytek-2635"},{"id":2407273933,"title":"Product Designer","company":"Contra","image":"https://remotive.com/job/1924704/logo","description":"<p>We are seeking a part-time product designer to join our team at Contra. The ideal candidate will help craft new user experiences for our platform, focusing on our independent side products. This role is perfect for someone passionate about design and looking to make a significant impact in a flexible work environment.</p>\n<p> </p>\n<p> </p>\n<p><strong>*The is a part-time contract for ~20 hours / week. </strong></p>\n<p><strong> </strong></p>\n<div class=\"h4\" id=\"8233b36f-c951-4846-83f9-9f4c0aae9da4\">Responsibilities:</div>\n<ul class=\"_listContainer_1wyhh_1\" style=\"\">\n<li style=\"\">Design intuitive and effective UX flows for new products.</li>\n<li style=\"\">Collaborate with the product team to understand requirements and user needs.</li>\n<li style=\"\">Contribute to the creative process with fresh ideas and perspectives.</li>\n<li style=\"\">Deliver high-quality design solutions that align with project goals.</li>\n<li style=\"\">Ensure all design deliverables are completed within the established timeframe.</li>\n<li style=\"\">Collaborate with the Product team to identify user and business needs.</li>\n<li style=\"\">Add to our growing design system.</li>\n<li style=\"\">Apply your design thinking skills to other touchpoints (marketing, social, etc.). </li>\n</ul>\n<img src=\"https://remotive.com/job/track/1924704/blank.gif?source=public_api\" alt=\"\"/>","tags":"[\"UI/UX\"]","pubDate":"2024-07-16 12:30:55.000","link":"https://remotive.com/remote-jobs/design/product-designer-1924704","savedDate":"2024-07-19 05:18:46.137","slug":"product-designer-contra-734"},{"id":7640911903,"title":"Generative AI Content Creator","company":"Contra","image":"https://remotive.com/job/1924705/logo","description":"<p>Contra is seeking a part-time Generative AI Content Creator to join our team. This role is perfect for someone passionate about AI and content creation who wants to make a significant impact in a flexible work environment.</p>\n<p> </p>\n<p><strong>*The is a part-time contract for ~20 hours / week. </strong></p>\n<p><strong> </strong></p>\n<div class=\"h3\" id=\"a91408fb-b4bf-48dd-a0bd-97131d3d92e0\">Responsibilities:</div>\n<ul class=\"_listContainer_1wyhh_1\" style=\"\">\n<li style=\"\">Generate Video Content: Use AI tools to create engaging video content for social media, blogs, and our website.</li>\n<li style=\"\">Ensure AI Consistency: Align AI-generated video content with brand guidelines and marketing goals.</li>\n<li style=\"\">Stay Current: Keep up with the latest trends in AI and video content creation.</li>\n<li style=\"\">Analyze Results: Track and analyze the performance of AI video content, making adjustments to boost engagement.</li>\n<li style=\"\">Collaborate with Teams: Work with marketing, product, and design teams to integrate AI-generated video content into campaigns.</li>\n</ul>\n<img src=\"https://remotive.com/job/track/1924705/blank.gif?source=public_api\" alt=\"\"/>","tags":"[\"social media\",\"video\",\"AI/ML\"]","pubDate":"2024-07-16 12:30:01.000","link":"https://remotive.com/remote-jobs/marketing/generative-ai-content-creator-1924705","savedDate":"2024-07-19 05:18:46.137","slug":"generative-ai-content-creator-contra-9987"},{"id":6031520269,"title":"UGC Content Creator","company":"Contra","image":"https://remotive.com/job/1924707/logo","description":"<p>We are seeking a motivated and creative Part-Time UGC Content Creator to join our team. You'll produce high-quality content that aligns with our brand and engages our audience.</p>\n<p> </p>\n<div class=\"h4\" id=\"f18cf8d0-6138-4cdc-89ea-3d7582c88bca\">Responsibilities:</div>\n<ul class=\"_listContainer_1wyhh_1\" style=\"\">\n<li style=\"\">Create engaging content for social media, blogs, and our website.</li>\n<li style=\"\">Collaborate with marketing, design, and product teams.</li>\n<li style=\"\">Monitor and analyze content performance to improve engagement.</li>\n<li style=\"\">Stay updated on industry trends and best practices.</li>\n<li style=\"\">Ensure all content is high-quality and error-free.</li>\n<li style=\"\">Contribute innovative ideas for content strategies and campaigns.</li>\n<li style=\"\">Engage with our community through comments and messages.</li>\n<li style=\"\">Manage a content calendar for timely publications.</li>\n<li style=\"\">Assist in creating multimedia content like videos and graphics.</li>\n<li style=\"\">Provide feedback for continuous improvement.</li>\n</ul>\n<img src=\"https://remotive.com/job/track/1924707/blank.gif?source=public_api\" alt=\"\"/>","tags":"[\"social media\"]","pubDate":"2024-07-16 12:28:57.000","link":"https://remotive.com/remote-jobs/marketing/ugc-content-creator-1924707","savedDate":"2024-07-19 05:18:46.137","slug":"ugc-content-creator-contra-5301"},{"id":2491388824,"title":"Marketing Strategist","company":"Contra","image":"https://remotive.com/job/1924703/logo","description":"<p>We are looking for a <strong>Part Time</strong> <strong>Marketing Strategist</strong> to partner on projects with the Contra team. You will play a role in developing and executing comprehensive marketing strategies to enhance brand awareness, drive customer acquisition, and maximize revenue growth. You will collaborate closely with cross-functional teams to analyze market trends, identify target audiences, and devise innovative campaigns that resonate with our customers.</p>\n<p> </p>\n<p> </p>\n<p><strong>Key Responsibilities:</strong></p>\n<ul class=\"_listContainer_1wyhh_1\" style=\"\">\n<li style=\"\"><strong>Strategic Planning</strong>: Develop and refine marketing strategies that align with our business objectives and resonate with our target audience.</li>\n<li style=\"\"><strong>Market Research</strong>: Conduct in-depth market research and competitor analysis to identify key trends, opportunities, and challenges.</li>\n<li style=\"\"><strong>Campaign Execution</strong>: Lead the execution of marketing campaigns across various channels, including digital, social media, email, and events, ensuring seamless implementation and timely delivery.</li>\n<li style=\"\"><strong>Content Creation</strong>: Work closely with the creative team to develop compelling long and short form content (ex. social media copy, thought leadership pieces, blog articles, etc.) and creative assets that engage our audience and drive action.</li>\n<li style=\"\"><strong>Data-Driven Optimization</strong>: Utilize data analytics tools to track and measure campaign performance, identify areas for improvement, and optimize strategies for maximum impact.</li>\n<li style=\"\"><strong>Cross-Functional Collaboration</strong>: Collaborate with internal teams, including sales, product, and design, to ensure alignment and integration of marketing efforts across the organization.</li>\n</ul>\n<img src=\"https://remotive.com/job/track/1924703/blank.gif?source=public_api\" alt=\"\"/>","tags":"[\"social media\",\"research\",\"market research\",\"customer acquisition\",\"analytics\"]","pubDate":"2024-07-16 12:27:15.000","link":"https://remotive.com/remote-jobs/marketing/marketing-strategist-1924703","savedDate":"2024-07-19 05:18:46.137","slug":"marketing-strategist-contra-9443"},{"id":9665884925,"title":"Fullstack Engineer","company":"Contra","image":"https://remotive.com/job/1924708/logo","description":"<p>Contra is seeking a Part-Time Full Stack Engineer. This role is perfect if you are excited to contribute to landing pages, SEO, generative AI projects, and product integrations.</p>\n<p> </p>\n<p><strong>This is a part-time contract position for ~20 hours / week.</strong></p>\n<p><strong> </strong></p>\n<div class=\"h4\" id=\"4115b038-9d29-4036-bb06-6bdc43ceba89\">Responsibilities:</div>\n<ul class=\"_listContainer_1wyhh_1\" style=\"\">\n<li style=\"\">Develop and optimize landing pages to enhance user experience and conversion rates.</li>\n<li style=\"\">Implement SEO best practices to improve website visibility and traffic.</li>\n<li style=\"\">Contribute to the creation and deployment of generative AI features.</li>\n<li style=\"\">Manage integrations with other systems and platforms to ensure seamless functionality.</li>\n<li style=\"\">Collaborate with the team to identify and solve complex technical issues.</li>\n</ul>\n<img src=\"https://remotive.com/job/track/1924708/blank.gif?source=public_api\" alt=\"\"/>","tags":"[\"fullstack\",\"seo\",\"AI/ML\"]","pubDate":"2024-07-16 12:26:29.000","link":"https://remotive.com/remote-jobs/software-dev/fullstack-engineer-1924708","savedDate":"2024-07-19 05:18:46.137","slug":"fullstack-engineer-contra-2316"},{"id":6774557197,"title":"Lead Generator","company":"Contra","image":"https://remotive.com/job/1924702/logo","description":"<p>We are seeking a dedicated and detail-oriented Part-Time Lead Generator to join our dynamic team. This role is perfect for individuals who excel at identifying potential leads and building strong client relationships. If you are proactive, results-driven, and enjoy working in a collaborative environment, this opportunity is for you.</p>\n<p> </p>\n<div class=\"h4\" id=\"f7545ec0-72e5-457c-9b62-5ad69148bfca\">Responsibilities:</div>\n<ul class=\"_listContainer_1wyhh_1\" style=\"\">\n<li style=\"\"><strong>Lead Research: </strong>Conduct comprehensive research to identify potential leads within our target market using various tools and platforms.</li>\n<li style=\"\"><strong>Database Management:</strong> Maintain and update the lead database with accurate and up-to-date information.</li>\n<li style=\"\"><strong>Client Outreach:</strong> Initiate and manage communication with potential clients to introduce our services, understand their needs, and build rapport.</li>\n<li style=\"\"><strong>Sales Collaboration:</strong> Work closely with the sales team to ensure a seamless transition of leads, providing necessary background information and context.</li>\n<li style=\"\"><strong>Reporting and Process Development:</strong> Generate detailed reports on lead generation activities and establish processes to optimize lead-to-client conversion.</li>\n<li style=\"\"><strong>Problem-Solving and Marketing Collaboration:</strong> Identify and address sales blockers with intelligent solutions and partner with marketing to design data-driven acquisition-focused campaigns.</li>\n</ul>\n<img src=\"https://remotive.com/job/track/1924702/blank.gif?source=public_api\" alt=\"\"/>","tags":"[\"excel\",\"research\",\"database admin\",\"lead generation\"]","pubDate":"2024-07-16 11:19:55.000","link":"https://remotive.com/remote-jobs/sales-business/lead-generator-1924702","savedDate":"2024-07-19 05:18:46.137","slug":"lead-generator-contra-5118"},{"id":4961130406,"title":"Senior DevOps Engineer (worldwide remote, work anywhere)","company":"CloudLinux","image":"https://pbs.twimg.com/profile_images/696718028084482050/ymY3OEPk_400x400.png","description":"<p>We are looking for a Senior DevOps Engineer to join our R&amp;D team of highly skilled professionals. You will design, develop, and integrate solutions using scripting and automation to achieve scalability and efficiency, focusing on SRE and DevOps best practices.</p><p></p><p>CloudLinux is a global remote-first company. We are driven by our principles: Do the right thing, employees first. We are remote first, and we deliver high-volume, low-cost Linux infrastructure and security products that help companies increase the efficiency of their operations. Every person on our team supports each other and does what we can to ensure our success.&nbsp;</p><p></p><p>We are truly a great place to work.&nbsp;</p><p></p><h3><strong>Your responsibilities will be:</strong></h3><ul> <li>Take ownership of a complex&nbsp;infrastructure.</li> <li>Improve stability and performance of CI/CD infrastructure.</li> <li>Maintain and modify test environment and configuration as needed, create new test environments and configurations to meet customer-based configuration or problem reproducing requirements.</li> <li>Collaborate with cross-functional teams to understand business requirements.</li> <li>Create and maintain comprehensive documentation for configurations, procedures, and troubleshooting guides.</li> </ul><h3>Requirements: </h3><p><strong>To be successful in this role, you should have:</strong></p><ul> <li>Experience and passion for Linux.</li> <li>Good understanding of DevOps and SRE principles and their relation to automation engineering.</li> <li>Good knowledge of Docker, K8S.</li> <li>Hands-on experience with clouds (AWS, Google Cloud etc.).</li> <li>Understanding of CI/CD systems, tools and approaches.</li> <li>Strong scripting and automation skills (e.g., Python, Ansible).</li> <li>Experience in the creation of Jenkins scripted/declarative pipelines.</li> <li>Experience with Jenkins. Gitlab, Gerrit, Terraform, and monitoring solutions like Prometheus - a significant plus.</li> <li>Team player but also able to work independently using your initiative.</li> <li>Excellent problem-solving skills and the ability to work well under pressure.</li> <li>Strong communication and collaboration skills.</li> <li>Happy in an agile, fast-paced environment.</li> <li>Intermediate (and higher) English level.</li> </ul><h3>Benefits: </h3><p><strong>What's in it for you?</strong></p><ul> <li>A focus on professional development.</li> <li>Interesting and challenging projects.</li> <li>Remote work with flexible working hours, allows you to schedule your day and work from anywhere worldwide.</li> <li>Paid one month of vacation per year and unlimited sick leave.</li> <li>Medical insurance reimbursement.</li> <li>Co-working and gym/sports reimbursement.</li> <li>The opportunity to be rewarded for the most innovative idea the company can patent.</li> </ul><p></p><p><em>By applying for this position, you agree with </em><a href=\"https://cloudlinux.com/privacy-policy\" rel=\"nofollow noreferrer noopener\" class=\"external\"><em>Cloudlinux Privacy Policy</em></a><em> and give us your consent to maintain and process your personal data with this respect. Please read our Privacy Policy for more information.</em></p>","tags":"[\"engineering\",\"aws\"]","pubDate":"2024-07-16 00:00:00.000","link":"https://apply.workable.com/cloudlinux-1/j/BA7DD5131C","savedDate":"2024-07-19 05:18:46.140","slug":"senior-devops-engineer-worldwide-remote-work-anywhere-cloudlinux-2039"},{"id":1873174099,"title":"Senior Solutions Architect","company":"E-studio","image":"https://remotive.com/job/1924495/logo","description":"<p><strong>Salary: $110k-150k annual salary prorated for part-time<br></strong><br><br><strong>Who We Are:</strong></p>\n<p>We're a private equity-backed company passionate about building impactful businesses, particularly in the health and wellness space. We prioritize a positive, collaborative work environment and value kindness, humility, and professionalism.</p>\n<p> </p>\n<p><strong>Why Tech?</strong></p>\n<p>While we're not a tech company, technology plays a vital role in improving our efficiency and supporting our portfolio companies. We're looking for a part-time (3-4 days/week) hands-on tech whiz to join our team.</p>\n<p> </p>\n<p><strong>What You'll Do:</strong></p>\n<p> </p>\n<ul style=\"\">\n<li style=\"\">Coordinate the Design and Development of Our In-House RAG System: You'll be the architect of our in-house Retrieval-Augmented Generation (RAG) system. This will initially involve evaluating/auditing our existing system. It may involve a rebuild, assembling a small team, or outsourcing development. You'll own the overall design and approach, ensuring it directly impacts the success of our portfolio companies.</li>\n<li style=\"\">Boost Our Workplace Efficiency: You'll identify opportunities to improve efficiency through digital tools and process automation. Think setting up ETL pipelines, building BI dashboards, and streamlining workflows.</li>\n<li style=\"\">Be a Tech Communicator: You'll bridge the gap between technical and non-technical teams. Translating complex concepts into clear language and collaborating with both internal and external stakeholders is key.</li>\n</ul>\n<p> </p>\n<p><strong>You Are:</strong></p>\n<p> </p>\n<ul style=\"\">\n<li style=\"\">A Hands-On Digital Handyman: A seasoned software engineer or architect with a passion for building innovative solutions that solve real-world business problems.</li>\n<li style=\"\">A Tech Ninja: You possess a full-stack development skill set, with experience in rapid prototyping, polyglot programming (JavaScript, Python, Go, etc.), and a good understanding of machine learning and data pipelines. Familiarity with RAG systems is a plus!</li>\n<li style=\"\">A Communication Powerhouse: You can effectively communicate with everyone, from executives to engineers. You'll translate tech jargon into clear language and represent our company confidently when discussing technical matters.</li>\n<li style=\"\">A Collaborative Problem-Solver: You thrive on translating broad goals into actionable plans and can work independently or lead a small team.</li>\n<li style=\"\">A Continuous Learner: You're committed to improvement and embrace lean/agile methodologies.</li>\n<li style=\"\">A Team Player: You're humble, professional, and enjoy working in a positive, collaborative environment.</li>\n<li style=\"\">Intrinsically Motivated: You're driven by creating meaningful impact, not just by a paycheck.</li>\n</ul>\n<p> </p>\n<p><strong>Requirements:</strong></p>\n<p> </p>\n<ul style=\"\">\n<li style=\"\">Bachelor's degree in Software Engineering or a related field.</li>\n<li style=\"\">10+ years of software development experience, with 5+ years in a leadership role (e.g., solutions architect, technical product manager).</li>\n<li style=\"\">Technical proficiency in cloud platforms (AWS, Azure, GCP), software architecture, design patterns, security, and performance.</li>\n<li style=\"\">Proficiency in TypeScript, Python, and SQL</li>\n</ul>\n<p> </p>\n<p><strong>Bonus Points:</strong></p>\n<p> </p>\n<ul style=\"\">\n<li style=\"\">Experience working at/with startups</li>\n<li style=\"\">Experience with any or all of the following: Docker, Kubernetes, NestJS, React, PyTorch, Pandas, Scikit-learn, Google Apps Script</li>\n<li style=\"\">Google Workspace administration certifications.</li>\n</ul>\n<p> </p>\n<p><strong>Benefits</strong></p>\n<p> </p>\n<ul style=\"\">\n<li style=\"\">Flexible hours and fully remote</li>\n<li style=\"\">USD $110-150K annual salary prorated for part-time, dependent on the candidate’s qualifications and geographical location</li>\n</ul>\n<p> </p>\n<p><strong>Work environment</strong></p>\n<p> </p>\n<ul style=\"\">\n<li style=\"\">On the days that you are working, you are available for at least 4 hours during the regular work day (Pacific Time Zone)</li>\n<li style=\"\">Travel may not be required but participation in some in-person, on-site work activities during the year will be encouraged</li>\n</ul>\n<p> </p>\n<p><strong>Application</strong></p>\n<p> </p>\n<ul style=\"\">\n<li style=\"\">Resume / CV</li>\n<li style=\"\">Cover letter (optional)</li>\n<li style=\"\">Project portfolio with source code, e.g. GitHub, GitLab, Bitbucket, etc.</li>\n</ul>\n<p> </p>\n<p>Join us and be the tech force that helps us and our portfolio companies thrive!</p>\n<img src=\"https://remotive.com/job/track/1924495/blank.gif?source=public_api\" alt=\"\"/>","tags":"[\"AWS\",\"azure\",\"cloud\",\"docker\",\"fullstack\",\"go\",\"javascript\",\"kubernetes\",\"python\",\"react\",\"security\",\"sql\",\"AI/ML\",\"agile\",\"automation\",\"product management\",\"Typescript \",\"GCP\",\"ETL\",\"prototyping\",\"gitlab\",\"github\",\"travel\",\"Pytorch\"]","pubDate":"2024-07-15 17:22:54.000","link":"https://remotive.com/remote-jobs/software-dev/senior-solutions-architect-1924495","savedDate":"2024-07-19 05:18:46.137","slug":"senior-solutions-architect-e-studio-6858"}]