[{"id":8710646549,"title":"Fullstack Engineer - Product-Led Growth [IC2]","company":"Sourcegraph","image":"https://pbs.twimg.com/profile_images/1428393724527190022/4mt5PACL_400x400.png","description":"\n    <div class=\"content-intro\"><h3>ALL SOURCEGRAPH ROLES ARE FULLY REMOTE</h3>\n<h2><span style=\"color: #a112ff;\">Who we are</span></h2>\n<p>Our mission at Sourcegraph is to make it so that&nbsp;<a class=\"c-link\" href=\"https://handbook.sourcegraph.com/strategy-goals/strategy\" target=\"_blank\" data-stringify-link=\"https://handbook.sourcegraph.com/strategy-goals/strategy\" data-sk=\"tooltip_parent\">everyone can code</a>, not just ~0.1% of the population. Our code graph powers Cody, the most powerful and accurate AI coding assistant, as well as our Code Search product, which helps devs explore their entire codebase and make large-scale migrations and security fixes. We’re building software that builds software, and in doing so we’re making devs more productive and preparing for a world where a lot more code gets written.</p>\n<p>It’s an exciting time to join Sourcegraph. AI has taken over the world, and we’ve spent the last 10 years building infrastructure that’s integral to making AI generated code more powerful and accurate. Our customers include 4/5 FAANG companies, 4 of the top 10 banks, government organizations, Uber, Plaid, and many other companies building the software that pushes the world forward. We’ve raised $225M at a $2.625B valuation from <a class=\"c-link\" href=\"https://techcrunch.com/2021/07/13/sourcegraph-raises-125m-series-d-on-2-6b-valuation-for-universal-code-search-tool/\" target=\"_blank\" data-stringify-link=\"https://techcrunch.com/2021/07/13/sourcegraph-raises-125m-series-d-on-2-6b-valuation-for-universal-code-search-tool/\" data-sk=\"tooltip_parent\">a16z</a>,&nbsp;<a class=\"c-link\" href=\"https://about.sourcegraph.com/blog/series-c-with-sequoia/\" target=\"_blank\" data-stringify-link=\"https://about.sourcegraph.com/blog/series-c-with-sequoia/\" data-sk=\"tooltip_parent\">Sequoia</a>,&nbsp;<a class=\"c-link\" href=\"https://www.redpoint.com/companies/sourcegraph/\" target=\"_blank\" data-stringify-link=\"https://www.redpoint.com/companies/sourcegraph/\" data-sk=\"tooltip_parent\">Redpoint</a>,&nbsp;<a class=\"c-link\" href=\"https://medium.com/craft-ventures/why-we-invested-in-sourcegraph-5ace28317e3d\" target=\"_blank\" data-stringify-link=\"https://medium.com/craft-ventures/why-we-invested-in-sourcegraph-5ace28317e3d\" data-sk=\"tooltip_parent\">Craft</a>&nbsp;and others. We’re making ambitious bets on our future and we’re looking to hire exceptional people to join our team as we make Sourcegraph one of the biggest and most influential companies in the world.</p></div>\n\n    <h2><span style=\"color: rgb(161, 18, 255);\">Working hours</span></h2>\n<p>🌎 Given that we are an all-remote company and hire <a href=\"https://handbook.sourcegraph.com/departments/people-ops/process/how-we-engage-talent-outside-the-us/\">almost anywhere</a> in the world, we don’t have a location requirement for this role. However, your working hours must overlap with 15:00-17:00 UTC for at least 3 days/week to make sure you can sync with most teammates when needed.</p>\n<h2><span style=\"color: rgb(161, 18, 255);\">Why this job is exciting</span></h2>\n<p>Joining our PLG team at Sourcegraph now means bringing the forefront of the coding revolution to new customers. Our mission is to make coding accessible to everyone, and we're pioneering this journey with Cody, our AI coding assistant, at the helm. Traditionally sales-led, we’ve shifted gears towards a product-led growth (PLG) strategy for Cody just about six months ago—a move that has opened up exciting new frontiers for innovation and engagement. Our team is at the heart of this transformation, currently focusing on integrating a “teams and invites” functionality into our PLG platform to enhance collaboration and UX.</p>\n<p>This role is not just another job; it's a chance to be part of something genuinely transformative. Cody is not just software; it's the future of coding, acting as a senior engineer sidekick on every developer's side. By joining us, you'll contribute directly to a tool that will not only increase productivity but also democratize coding skills across the globe. The PLG model presents unique challenges and learning opportunities, especially in understanding user behavior and optimizing the product journey—work that's vital for our next growth phase.</p>\n<p>As a key player in a small yet impactful team, you'll be working alongside two senior engineers, absorbing a wealth of knowledge and contributing your own expertise to the mix. Your work will directly influence the ease with which new users can integrate into our platform, shaping the future of Sourcegraph through Cody and our PLG strategy. This role is perfect for those who thrive in a dynamic, fast-paced environment, are eager to learn, and have a passion for making a real impact on the way the world codes.</p>\n<p>Your curiosity, proactive nature, and willingness to dive into both front-end and back-end challenges will make you an invaluable asset to our team. With every line of code, you’ll be paving the way for the next generation of developers, ensuring they have the tools they need to succeed.</p>\n<p>📅 Within one month, you will…</p>\n<ul>\n<li>Familiarize yourself with Cody and our PLG platform, understanding their architecture and the problems they solve for our users.</li>\n<li>Start contributing to our current focus areas by working on tasks related to enhancing teams and invites functionality, ensuring a smoother onboarding experience for new users.</li>\n<li>Engage with your team members, learning from their experiences and sharing your insights to contribute to the project's direction.</li>\n</ul>\n<p>📅 Within three months, you will…</p>\n<ul>\n<li>Be contributing actively to the world’s best coding assistant.</li>\n<li>Take ownership of smaller features and implement them, with a focus on improving user engagement and satisfaction.</li>\n<li>Begin to influence the project's future direction by providing insights based on your work and user feedback, collaborating closely with product management and design teams.</li>\n</ul>\n<p>📅 Within six months, you will…</p>\n<ul>\n<li>Be fully ramped up and able to anticipate the needs of PLG customers.</li>\n<li>Establish yourself as a key contributor to the team, known for your expertise in both the technical and product aspects of our work.</li>\n<li>Participate in initiatives that push the boundaries of what Cody and our PLG platform can do, making coding more accessible and enjoyable for developers everywhere.</li>\n</ul>\n<h2><span style=\"color: rgb(161, 18, 255);\">About you</span></h2>\n<p>You are a full-stack software engineer with at least 2 years of industry experience, equally comfortable with frontend and backend work as needed, with the ability to pick up frameworks quickly and deliver high-quality work.&nbsp;</p>\n<p>Beyond your technical proficiency, you are a forward-thinking and adaptive contributor, ready to navigate a complex project. Your vision extends beyond code: you are passionate about the broader impact of your work on making coding accessible and enjoyable for a diverse global community. You actively seek out opportunities to challenge the status quo, drive meaningful change, and foster an inclusive, high-performing team culture. You are an experienced remote/async worker.</p>\n<p>🔎 Qualifications:</p>\n<ul>\n<li>2–5 years experience as a full-stack engineer</li>\n<li>Experience with React is required</li>\n<li>PLG experience is a requirement</li>\n<li>Experience with Go is preferable</li>\n<li>Some tech-ops / GCP background is preferable</li>\n<li>Alignment with our values</li>\n<li>Growth mindset</li>\n</ul>\n<p>💪 Nice to haves:</p>\n<ul>\n<li>Experience with PLG metrics and data analysis to improve product decisions and UX.</li>\n<li>Experience working closely with Product and Design teams.</li>\n<li>Previous role in a startup environment, comfortable with rapid iteration and adaptable to shifting priorities.</li>\n<li>Familiarity with code intelligence tools and AI-assisted development platforms. Experience with tools like Sourcegraph, GitHub Copilot, or similar would be nice.</li>\n<li>Prior involvement in open source projects.</li>\n</ul>\n<h2><span style=\"color: rgb(161, 18, 255);\">Level</span></h2>\n<p>📊 This job is an IC2.&nbsp; You can read more about <a href=\"https://handbook.sourcegraph.com/benefits-pay-perks/pay-expenses/compensation/leveling-guide/\">our job-leveling philosophy</a> in our Handbook.</p>\n<h2><span style=\"color: rgb(161, 18, 255);\">Compensation</span></h2>\n<p><strong>💸 We pay you an above-average salary</strong> because we want to hire the best people who are fully focused on helping Sourcegraph succeed, not worried about paying bills. You will have the flexibility to work and live anywhere in the world<em> (unless specified otherwise in the job description)</em>.&nbsp; As an <a href=\"https://handbook.sourcegraph.com/company-info-and-process/values/#sts=Open%20and%20transparent\">open and transparent </a>company that values equitable and competitive compensation for everyone, our <a href=\"https://handbook.sourcegraph.com/benefits-pay-perks/pay-expenses/compensation/\">compensation ranges are visible</a> to every single Sourcegraph Teammate. To determine your salary, we use a number of market and data-driven salary sources and target the high-end of the range, ensuring that we’re always paying above market regardless of where you live in the world.&nbsp;&nbsp;</p>\n<p>💰The target compensation for this role is $141,500 USD base.</p>\n<p>📈 In addition to our cash compensation, we offer equity (because when we succeed as a company, we want you to succeed, too) and generous <a href=\"https://handbook.sourcegraph.com/benefits-pay-perks/benefits-perks/\">perks &amp; benefits</a>.</p>\n<h2><span style=\"color: rgb(161, 18, 255);\">Interview process</span></h2>\n<p><em>Below is the interview process you can expect for this role (you can read more about </em><a href=\"https://handbook.sourcegraph.com/talent/types_of_interviews\"><em>the types of interviews</em></a><em> in our Handbook). It may look like a lot of steps, but rest assured that we move quickly and the steps are designed to help you get the information needed to determine if we’re the right fit for you… Interviewing is a two-way street, after all!&nbsp;</em></p>\n<p>We expect the interview process to take 5.5 hours in total.</p>\n<p><strong>👋 Introduction Stage</strong> - we have initial conversations to get to know you better…</p>\n<ul>\n<li>[30m] <a href=\"https://handbook.sourcegraph.com/departments/people-talent/talent/process/types_of_interviews/#recruiter-screen\">Recruiter Screen</a> - Devon Coords</li>\n<li>[60m] <a href=\"https://handbook.sourcegraph.com/departments/people-talent/talent/process/engineering_interview_process_candidates/#technical-screen--resume-deep-dive\">Technical Screen / Resume Deep Dive</a>&nbsp;- David Veszelovszki</li>\n</ul>\n<p><strong>🧑‍💻 Team Interview Stage</strong> - we then delve into your experience in more depth and introduce you to members of the team…</p>\n<ul>\n<li>[60m] <a href=\"https://handbook.sourcegraph.com/departments/people-talent/talent/process/engineering_interview_process_candidates/#code-walkthrough\">Code Walkthrough</a>&nbsp;</li>\n<li>[60m] <a href=\"https://handbook.sourcegraph.com/departments/people-talent/talent/process/engineering_interview_process_candidates/#pairing-exercise\">Pairing Exercise</a></li>\n<li>[60m] <a href=\"https://about.sourcegraph.com/handbook/talent/types_of_interviews#cross-functional-team-collaboration-interview\">Cross-functional team collaboration</a>&nbsp;</li>\n<li>[30m] <a href=\"https://handbook.sourcegraph.com/departments/people-talent/talent/process/types_of_interviews/#values-interview\">Values Interview</a></li>\n</ul>\n<p><strong>🎉 Final Interview Stage </strong>- we move you to our final round, where you gain a better understanding of our business and values holistically…</p>\n<ul>\n<li>[30m] <a href=\"https://handbook.sourcegraph.com/departments/people-talent/talent/process/types_of_interviews/#leadership-interview\">Leadership Interview</a> with co-founder&nbsp;</li>\n<li>We check references and conduct your background check</li>\n</ul>\n<p>Please note - you are welcome to request additional conversations with anyone you would like to meet, but didn’t get to meet during the interview process.</p>\n\n    \n\n    <div class=\"content-conclusion\"><h2><span style=\"color: #a112ff;\">Not sure if this is you?</span></h2>\n<p><span style=\"font-weight: 400;\">We want a diverse, global team, with a broad range of experience and perspectives. If this job sounds great, but you’re not sure if you qualify, apply anyway! We carefully consider every application, and will either move forward with you, find another team that might be a better fit, keep in touch for future opportunities, or thank you for your time.</span></p>\n<h2><span style=\"color: #a112ff;\">Learn more about us</span></h2>\n<p><span style=\"font-weight: 400;\">To create a product that serves the needs of all developers, we are building a diverse </span><a href=\"https://handbook.sourcegraph.com/company-info-and-process/remote\"><span style=\"font-weight: 400;\">all-remote team</span></a><span style=\"font-weight: 400;\"> that is </span><a href=\"https://handbook.sourcegraph.com/team\"><span style=\"font-weight: 400;\">distributed across the world</span></a><span style=\"font-weight: 400;\">. Sourcegraph is an equal opportunity workplace; we welcome people from all backgrounds and communities.&nbsp;</span></p>\n<p><span style=\"font-weight: 400;\">We provide </span><a href=\"https://about.sourcegraph.com/handbook/people-ops/compensation\"><span style=\"font-weight: 400;\">competitive compensation</span></a><span style=\"font-weight: 400;\"> and </span><a href=\"https://about.sourcegraph.com/handbook/people-ops/benefits-and-perks\"><span style=\"font-weight: 400;\">practical benefits</span></a><span style=\"font-weight: 400;\"> to keep you happy and healthy so that you can do your best work.&nbsp;</span><span style=\"font-weight: 400;\">&nbsp;</span></p>\n<p><span style=\"font-weight: 400;\">Learn more about what it is like to work at Sourcegraph by reading </span><a href=\"https://about.sourcegraph.com/handbook/\"><span style=\"font-weight: 400;\">our handbook</span></a><span style=\"font-weight: 400;\">.</span></p>\n<p><span style=\"font-weight: 400;\">We want to ensure Sourcegraph is an environment that suits your working style and empowers you to do your best work, so we are eager to answer any questions that you have about us at any point in the interview process.</span></p>\n<p><span style=\"font-weight: 400;\">Go back to the </span><a href=\"https://about.sourcegraph.com/jobs/\"><span style=\"font-weight: 400;\">careers page</span></a><span style=\"font-weight: 400;\"> for all open positions.</span></p>\n<p>&nbsp;</p>\n<p><em><span style=\"font-weight: 400;\">Sourcegraph participates in <a href=\"https://handbook.sourcegraph.com/departments/people-talent/e-verify/\" target=\"_blank\">E-Verify</a> for U.S. Employees</span></em></p></div>\n","tags":"[\"management\",\"engineering\"]","pubDate":"2024-03-28 07:46:08.386","link":"https://boards.greenhouse.io/sourcegraph91/jobs/5133632004","savedDate":"2024-03-28 07:46:08.386","slug":"fullstack-engineer-product-led-growth-ic2-sourcegraph-6520"},{"id":7635987438,"title":"Enterprise Open Source Sales Representative","company":"Canonical","image":"https://pbs.twimg.com/profile_images/1673959375340290050/x7pNtXQ7_400x400.jpg","description":"\n      <p>Open source software is the new default in the enterprise, and Canonical is the new challenger to major enterprise software vendors.</p>\n<p>We deliver better open source from the data center to cloud and edge. Our Linux distribution Ubuntu is now the leading platform for public cloud compute, and the favorite platform for software engineers, data scientists and AI developers. Our mission is to accelerate the adoption and quality of open source globally, and our goal is to ship the most software on the planet by cores. A tidal wave of open source innovation is the next phase of the entire enterprise software industry, and we aim to be the most compelling way to ride that wave.</p>\n<p>Our customers include Global 500 enterprises and startups. We are expanding our product range from the base operating system - Ubuntu - to full enterprise solutions in infrastructure and applications. We can deliver software defined storage, private cloud solutions, container runtime environments, as well as databases, message queues, identity, observability, analytics, machine learning and web publishing capabilities. Customers love the idea that they can get security compliance and support for everything open source from a single company. Our goal is to have more solutions on tap than any other vendor, and we have built unique capabilities to make that possible across every cloud, every class of compute and every category of application.</p>\n<p>Canonical provides licensed enterprise software products, commercial support, managed services, consulting and training services to customers who are deploying Ubuntu or open source applications on the cloud, in their data center, or to the connected device and IoT ecosystem. We are just over 1,000 colleagues in 70+ countries and $250m in revenue, profitable, on a steady but relentless growth trajectory. We are almost entirely distributed, with leadership spread across many countries. We believe that talent is equally distributed across the globe, and we are excited to hire, develop, promote and ultimately trust a diverse group of exceptional leads to build the best, not biggest, enterprise software company.</p>\n<p>We hire carefully and deliberately; our selection process is long and requires substantial work from applicants. It will take successful applicants three to six months to secure an offer. This is not a place to apply if you are in a rush to find a position, it is a worthwhile place to apply if you are ambitious and long-term in your thinking about your career and the dynamics which move the world forward. If you see clearly the rise of open source, and you understand the drivers of enterprise procurement and technical decision making, then you will understand why Canonical has such a tremendous long term advantage. You will also understand, given the ferocity of competition and the challenges of competing in a market of giants, that we have to set a very high bar for hiring and performance. In order to be a world leading company we select for exceptional ability as well as character, and then provide an environment which promotes teamwork and celebrates diligence, collaboration and effectiveness. All of those are easy to say but hard to do - at Canonical we are willing to be uncomfortable in pursuit of that excellence.</p>\n<p>In building our sales team, we look for five things:</p>\n<ul>\n<li>Empathy for the customer - a real understanding of customer needs, industry-specific challenges, and a desire to help customers solve their business problems</li>\n<li>High intellect - the ability to learn quickly, understand very complex subjects, and communicate clearly to build trust and confidence</li>\n<li>Passion for technology - a fascination with the state of the art from brilliant people solving hard problems, and fierce competition for large prizes</li>\n<li>Teamwork - a willingness to help others, to collaborate well with people from different disciplines, and to balance personal and team ambitions</li>\n<li>Energy - the drive to motivate oneself and others to achieve the best result for the team and our customers</li>\n</ul>\n<p>Ubuntu is already very widely adopted which gives us a credible basis for conversations in the market. Nevertheless, it requires real work for sales professionals to build on that adoption to create trusted and profitable commercial relationships with the enterprises in their territory. Our product managers and marketing teams run campaigns to generate awareness, engagement and leads, but you will need to go beyond managing inbound interest to develop the potential of your territory. You will need judgement as to which industries and companies are ready to go deeper with open source and Canonical, and energy to develop relationships in advance of proven interest. We expect professional practice, territory and account planning, as well as clear, complete and continuous reporting on pipeline status and activity, using standard professional tools.</p>\n<p>The successful candidate will carry an annual bookings quota within their assigned territory. They should be able to travel regionally for client engagement, industry conferences, and internationally for company events twice a year. They will be expected to demonstrate professionalism and effectiveness, to prospect accounts for new business, maintain and develop existing relationships, and work with colleagues and partners on account strategy. They must be comfortable selling enterprise software, open source, cloud, virtualization, container technologies and technical software solutions to senior levels of the enterprise.</p>\n<p>Location: We are expanding our sales organisation globally and have open roles in every region.</p>\n<h3>What your day will look like</h3>\n<ul>\n<li>Represent the company, its solutions and software, in your territory</li>\n<li>Build and execute a territory plan to prioritize outreach and prospecting</li>\n<li>Develop new pipeline through outreach, prospecting, local marketing, and industry events</li>\n<li>Close contracts to meet and exceed quarterly and annual bookings targets</li>\n<li>Be mindful and proactive in achieving tactical and strategic objectives</li>\n<li>Manage customer relationships and interactions through all stages of the sales cycle</li>\n<li>Work with field engineers to propose solutions that solve our customers’ business problems</li>\n<li>Work with customer success to identify growth opportunities</li>\n<li>Maintain accurate pipeline data and forecasts within Salesforce</li>\n<li>Establish productive professional relationships with key influencers and decision makers</li>\n</ul>\n<h3>What we are looking for in you</h3>\n<ul>\n<li>Bachelor's level degree, preferably in engineering or computer science</li>\n<li>Experience of open source technology and solutions</li>\n<li>Detail oriented with effective follow-up</li>\n<li>Experience in enterprise software or technology sales planning and execution</li>\n<li>Track record of achievement in sales targets and new account wins</li>\n<li>Self-discipline and motivation to be successful in a distributed team</li>\n<li>Professional written and spoken English, as well as any language that may be appropriate for your target market</li>\n<li>Ability to travel for customer engagements, industry events and company events</li>\n</ul>\n<h3>Additional skills of interest</h3>\n<ul>\n<li>Specific vertical experience, in particular finance, telco, health, energy, public sector, tech</li>\n<li>Experience speaking at conferences or industry events</li>\n</ul>\n<h3>What we offer you</h3>\n<p>We consider geographical location, experience, and performance when shaping compensation worldwide. We revisit compensation annually (and more often for graduates and associates) to ensure we recognise outstanding performance. In addition to base pay, we offer a performance-driven commission structure. We provide all team members with additional benefits, which reflect our values and ideals. We balance our programs to meet local needs and ensure fairness globally.</p>\n<ul>\n<li>Distributed work environment with twice-yearly team sprints in person</li>\n<li>Personal learning and development budget of USD 2,000 per year</li>\n<li>Annual compensation review</li>\n<li>Recognition rewards</li>\n<li>Annual holiday leave</li>\n<li>Maternity and paternity leave</li>\n<li>Employee Assistance Program</li>\n<li>Opportunity to travel to new locations to meet colleagues</li>\n<li>Priority Pass, and travel upgrades for long haul company events</li>\n</ul>\n<h3>About Canonical</h3>\n<p>Canonical is a pioneering tech firm at the forefront of the global move to open source. As the company that publishes Ubuntu, one of the most important open source projects and the platform for AI, IoT and the cloud, we are changing the world on a daily basis. We recruit on a global basis and set a very high standard for people joining the company. We expect excellence - in order to succeed, we need to be the best at what we do. Canonical has been a fully distributed company since its inception in 2004.​ Working here is a step into the future, and will challenge you to think differently, work smarter, learn new skills, and raise your game.</p>\n<h3>Canonical is an equal opportunity employer</h3>\n<p>We are proud to foster a workplace free from discrimination. Diversity of experience, perspectives, and background create a better work environment and better products. <a href=\"https://canonical.com/careers/diversity/identity\">Whatever your identity, we will give your application fair consideration.</a></p>\n<p>#LI-remote</p>\n    ","tags":"[\"Finance\",\"engineering\",\"database\"]","pubDate":"2024-03-28 07:46:08.386","link":"https://canonical.com/careers/5372535","savedDate":"2024-03-28 07:46:08.386","slug":"enterprise-open-source-sales-representative-canonical-6875"},{"id":1731351595,"title":"Ubuntu Pro Sales Engineer (SE)","company":"Canonical","image":"https://pbs.twimg.com/profile_images/1673959375340290050/x7pNtXQ7_400x400.jpg","description":"\n      <p>Canonical is a leading provider of open source software and operating systems to the global enterprise and technology markets. Our platform, Ubuntu, is very widely used in breakthrough enterprise initiatives such as public cloud, data science, AI, engineering innovation and IoT. Our customers include the world's leading public cloud and silicon providers, and industry leaders in many sectors. The company is a pioneer of global distributed collaboration, with 1000+ colleagues in 70+ countries and very few roles based in offices. Teams meet two to four times yearly in person, in interesting locations around the world, to align on strategy and execution.</p>\n<p>The company is founder led, profitable and growing.</p>\n<p>We are hiring an <strong>Ubuntu Pro Sales Engineer</strong> to help global companies embrace the latest and greatest Linux and open source applications. Our team applies expert insights to real-world customer problems, enabling the enterprise adoption of Ubuntu Pro, OpenStack and Canonical Microcloud, Kubernetes and a wide range of associated technology. The people who love this role are software engineers who enjoy customer conversations and solving customer problems during the presales cycle. Ubuntu is used by pretty much every enterprise in the world, in every industry. This is a fantastic opportunity to learn about the open source technology landscape and develop your business technology insights. You will see first hand in various industries how Linux - and Ubuntu in particular - is shaping innovation and changing the world for the better.</p>\n<p>This role is particularly suited to candidates with a technical background who are business minded and driven by commercial success. This role is on our global Field Engineering team and will work closely with enterprise sales leads.</p>\n<p><strong>Location: </strong>Most of our colleagues work from home. We are growing teams in EMEA, Americas and APAC time zones, so can accommodate candidates from almost any country.</p>\n<h3>What your day will look like</h3>\n<p>The Ubuntu Pro Sales Engineer is a key player in our efforts to facilitate and drive the adoption of Ubuntu Pro in the very large Ubuntu enterprise user base.</p>\n<ul>\n<li>Collect customer business requirements and advise them on Ubuntu and relevant open source applications</li>\n<li>Identify customer challenges with open source and articulate how Ubuntu Pro could help solve them</li>\n<li>Deliver presentations and demonstrations of Ubuntu Pro to prospective and current clients</li>\n<li>Liaise with product teams to give them feedback on requirements to influence roadmap</li>\n<li>Work collaboratively with your sales team to reach our common targets</li>\n<li>Global travel up to 25% of time for internal and external events and 25% to customer meetings</li>\n</ul>\n<h3>What we are looking for in you</h3>\n<ul>\n<li>Exceptional academic track record from both high school and university</li>\n<li>Undergraduate degree in a technical subject or a compelling narrative about your alternative chosen path</li>\n<li>Confidence to respectfully speak up, exchange feedback, and share ideas without hesitation</li>\n<li>Track record of going above-and-beyond expectations to achieve outstanding results</li>\n<li>Demonstrated personal interest in continuous learning and development</li>\n<li>Practical knowledge of Linux, virtualisation, containers and networking</li>\n<li>Business-minded technology thinker and problem solver</li>\n<li>Knowledge of cloud computing concepts &amp; leaders, such as Kubernetes, AWS, Azure, GCP</li>\n<li>Interest in large-scale enterprise open source - private clouds, machine learning and AI, data and analytics</li>\n<li>Intermediate level Python programming skills</li>\n<li>Passion for technology evidenced by personal projects and initiatives</li>\n<li>The work ethic and confidence to shine alongside motivated colleagues</li>\n<li>Professional written and spoken English with excellent presentation skills</li>\n<li>Experience with Linux (Debian or Ubuntu preferred)&nbsp;</li>\n<li>Excellent interpersonal skills, curiosity, flexibility, and accountability</li>\n<li>A dynamic person who loves to jump in new projects and interact with people</li>\n<li>Appreciative of diversity, polite and effective in a multi-cultural, multi-national organisation</li>\n<li>Thoughtfulness and self-motivation&nbsp;</li>\n<li>Result-oriented, with a personal drive to follow up and meet commitments&nbsp;</li>\n<li>Ability to travel internationally, for company events up to two weeks long, and customer or industry meetings</li>\n</ul>\n<h3>What we offer colleagues</h3>\n<p>We consider geographical location, experience, and performance in shaping compensation worldwide. We revisit compensation annually (and more often for graduates and associates) to ensure we recognise outstanding performance. In addition to base pay, we offer a performance-driven annual bonus or commission. We provide all team members with additional benefits, which reflect our values and ideals. We balance our programs to meet local needs and ensure fairness globally.</p>\n<ul>\n<li>Distributed work environment with twice-yearly team sprints in person</li>\n<li>Personal learning and development budget of USD 2,000 per year</li>\n<li>Annual compensation review</li>\n<li>Recognition rewards</li>\n<li>Annual holiday leave</li>\n<li>Maternity and paternity leave</li>\n<li>Employee Assistance Programme</li>\n<li>Opportunity to travel to new locations to meet colleagues</li>\n<li>Priority Pass, and travel upgrades for long haul company events</li>\n</ul>\n<h3>About Canonical</h3>\n<p>Canonical is a pioneering tech firm at the forefront of the global move to open source. As the company that publishes Ubuntu, one of the most important open source projects and the platform for AI, IoT and the cloud, we are changing the world of software. We recruit on a global basis and set a very high standard for people joining the company. We expect excellence - in order to succeed, we need to be the best at what we do. Most colleagues at Canonical have worked from home since its inception in 2004.​ Working here is a step into the future, and will challenge you to think differently, work smarter, learn new skills, and raise your game.</p>\n<p><strong>Canonical is an equal opportunity employer</strong></p>\n<p>We are proud to foster a workplace free from discrimination. Diversity of experience, perspectives, and background create a better work environment and better products. <a href=\"https://canonical.com/careers/diversity/identity\">Whatever your identity, we will give your application fair consideration.</a></p>\n<p>#LI-remote</p>\n\n\n    ","tags":"[\"engineering\",\"aws\"]","pubDate":"2024-03-28 07:46:08.386","link":"https://canonical.com/careers/5643282","savedDate":"2024-03-28 07:46:08.386","slug":"ubuntu-pro-sales-engineer-se-canonical-9007"},{"id":6061404044,"title":"Zoho People HRIS Specialist  (Remote/Anywhere)","company":"Collabora","image":"https://pbs.twimg.com/profile_images/1545121577632763912/7FMnABb0_400x400.jpg","description":"<div class=\"section page-centered\" data-qa=\"job-description\"><div> Are you a detail-driven HRIS Specialist with a deep understanding of Zoho People? We are on the hunt for someone like you to join our People Operations team! Your role will be to manage and fine-tune our Human Resources Information System, ensuring it is optimized to support our HR functions and processes flawlessly.</div><div><br></div><div>As a key member of our team, you will be working hand-in-hand with us to implement and configure modules within the Zoho People system, according to our processes. Your project management skills will shine as you ensure all relevant stakeholders are consulted and kept informed.</div><div><br></div><div>But that is not all! Using the powerful automation and workflow capabilities of the Zoho People platform, including scripting with Deluge (<a href=\"https://www.zoho.com/fr/deluge/\" class=\"postings-link\">https://www.zoho.com/fr/deluge/</a>), you will have the chance to fully automate our People Operations activities. This is your opportunity to make a real impact and streamline our HR processes for the better!</div></div><div class=\"section page-centered\"><div><h3>Responsibilities:</h3><ul class=\"posting-requirements plain-list\"><ul><li>Develop and implement in Zoho People HR processes, policies, procedures, and best practices to ensure optimal automation, data accuracy, security, and compliance</li><li>Provide technical support and troubleshooting assistance to POps staff and system users</li><li>Train POps staff and end-users on HRIS functionalities and processes</li><li>Collaborate with POps and internal teams to identify system requirements, enhancements, and integration opportunities</li><li>Design and generate custom reports, dashboards, and analytics to support POps decision-making and strategic initiatives</li><li>Conduct regular audits to ensure data integrity and compliance with relevant regulations (e.g., GDPR)</li><li>Assist with special projects and initiatives as assigned</li></ul></ul></div></div><div class=\"section page-centered\"><div><h3>Requirements:</h3><ul class=\"posting-requirements plain-list\"><ul><li>Proven and tangible experience of working with the Zoho People HRIS platform</li><li>Experience of scripting with Deluge  </li><li>Strong understanding of HR processes and regulations</li><li>Excellent analytical and problem-solving skills</li><li>Proficiency in data analysis and reporting tools</li><li>Ability to prioritize tasks and work efficiently in a fast-paced environment</li><li>Excellent communication and interpersonal skills</li><li>Bachelor's degree in Human Resources, Information Technology, or related field</li></ul></ul></div></div><div class=\"section page-centered\"><div><h3>Preferred Qualifications:</h3><ul class=\"posting-requirements plain-list\"><ul><li>HR certification (e.g., SHRM-CP, PHR, CIPD)</li><li>Experience with HR data migration and system implementations</li><li>Familiarity with project management methodologies</li><li>Software developer background is a big plus</li></ul></ul></div></div><div class=\"section page-centered\" data-qa=\"closing-description\"><div><br></div><div>#LI-Remote</div></div><div class=\"section page-centered last-section-apply\" data-qa=\"btn-apply-bottom\"><a class=\"postings-btn template-btn-submit hex-color\" data-qa=\"show-page-apply\" href=\"https://jobs.lever.co/collabora/e95249fc-4019-4d43-ab73-4be9387fe9d8/apply\">Apply for this job</a></div>","tags":"[\"management\"]","pubDate":"2024-03-28 07:46:08.386","link":"https://jobs.lever.co/collabora/e95249fc-4019-4d43-ab73-4be9387fe9d8","savedDate":"2024-03-28 07:46:08.386","slug":"zoho-people-hris-specialist-remote-anywhere-collabora-4321"},{"id":4102843252,"title":"Business Analyst - Health Insurance (Fully Remote)","company":"CoverGo","image":"https://pbs.twimg.com/profile_images/1382655628523364355/MWPIbbID_400x400.jpg","description":"<h3><strong>Top 3 Reasons To Join Us</strong></h3><ul> <li>Competitive Salary</li> <li>100% Remote</li> <li>Working on the latest tech for the Insurtech Market Leader</li> </ul><h3><strong>About Us</strong></h3><p>At CoverGo, our mission is to empower all insurance companies to make insurance 100% digital and accessible to everyone.</p><ul> <li>We are a leading global no-code insurance platform for health, life, and P&amp;C</li> <li>We’re the winner of the Insurtech of the Year in all of Asia and other awards globally</li> <li>We work with insurance enterprise clients such as AXA, Bupa, MSIG, Dai-ichi, Bank of China Group Insurance, and many more</li> <li>We're an international, diverse team of over 120 people with 30 nationalities and team members working remotely from all over the world</li> <li>We are fully funded and backed by reputable VC funds and strategic institutional investors</li> <li>We have a global presence in Asia, EMEA and the Americas</li> <li>We’ve grown our annualized revenue by over 30x since January 2021</li> <li>We’re constantly working towards making CoverGo a workplace that you love coming to. We deeply believe that bringing together a diversity of thoughts, expressions, and perspectives is key to building the best culture for equally diverse communities all over the world</li> </ul><h3><strong>What You Will Do:</strong></h3><ul> <li>Plans and designs simple to semi-complex business processes and system modifications. Makes recommendations to improve and support business activities.</li> <li>Gathers business requirements through a variety of techniques such as work sessions and interviews. Analyzes and documents client complex business requirements and processes; communicates these requirements to appropriate parties.</li> <li>Creates complex test case scenarios to be used in testing; monitors/oversees the testing of business applications to verify that all client requirements are incorporated into the system design.</li> <li>Provides input into developing and modifying systems to meet client needs. </li> <li>Develops business requirements documents/user stories to support the required modifications.</li> <li>Coordinates and facilitates meetings with clients to gather and document requirements and explore potential solutions.</li> <li>Coordinates business analyst tasks on information technology projects and provides project team member guidance and support. May plan, allocate and monitor work of other business analysts.</li> <li>Assist in providing time estimates for project related tasks.</li> <li>Aids in updating process and procedural documentation</li> <li>Work with clients and technical resources to identify their business problems and develop the right approach and analytical solution</li> <li>Basic understanding of technical development cycle of mobile application or web portals</li> <li>Experience participating in successful projects with cross-functional teams</li> <li>Agile/Scrum Framework for Project Planning &amp; Release Management is a must</li> <li>Ability to understand simple to complex systems and related data to surface actionable insights, demonstrate sound judgment and decision-making skills</li> <li>Business analysis skills including facilitation, process documentation, requirements gathering and user acceptance testing</li> <li>Good organizational/time management skills to prioritize work and meet deadlines within defined timeframes</li> <li>Performing/interpreting requirement analysis to identify value creation opportunities for clients</li> <li>Design and document new process and system changes</li> <li>Support QA, UAT and Release phases of the project via defect analysis, change maintenance, etc.</li> <li>Any other task as may be assigned</li> </ul><h3><strong>What We Need:</strong></h3><ul> <li>Minimum 3 years of experience as Business Analyst</li> <li>A degree in Business, IT or any relevant field</li> <li>Previous experience working in the insurance industry or Insurtech is a preferred </li> <li>Life Insurance domain certification from INS/LOMA or III is an added advantage</li> <li>Proven experience in eliciting requirements and testing.</li> <li>Analytical and Critical thinking ability.</li> <li>Experience in an Agile and/or Scrum environment is a must.</li> <li>Basic knowledge in generating process documentation.</li> <li>Good written and verbal communication skills in English</li> <li>Technical Writing and Other languages (Chinese) is a plus</li> <li>Should be able to own the tasks and communicate effectively within the team.</li> <li>Good attitude and self-motivation.</li> <li>Knowledge of business analysis concepts of defining requirements, translating to technical solutions, and Agile approach to prioritizing work to epics, sprints</li> <li>Ability to document system functionality, data integration and workflow</li> <li>Physically base in Vietnam</li> </ul><h3><strong>Why You'll Love Working Here</strong></h3><ul> <li>Fully Remote</li> <li>Flexible Leave</li> <li>International Environment</li> <li>Competitive renumeration package</li> <li>Performance Bonus</li> <li>Stock Options after 6 months </li> <li>Company activities and events</li> <li>Learning and development plan</li> </ul><p><strong>CoverGo Company </strong><a href=\"https://www.youtube.com/watch?v=YI0ezLxvFvA\" rel=\"nofollow noreferrer noopener\" class=\"external\"><strong>Video</strong></a></p><p>By submitting your application, you confirm that you have read, understood, and accepted the content of CoverGo’s <a href=\"https://apply.workable.com/covergo/gdpr_policy?lng=en\" target=\"_blank\" rel=\"nofollow noreferrer noopener\" class=\"external\">Privacy Notice</a> and you consent to the processing of your data as part of this application.</p><p><a href=\"https://www.youtube.com/watch?v=YI0ezLxvFvA\" rel=\"nofollow noreferrer noopener\" class=\"external\"></a></p><h3>Requirements: </h3><h3>Benefits: </h3>","tags":"[\"management\"]","pubDate":"2024-03-28 00:00:00.000","link":"https://apply.workable.com/covergo/j/1C6988B698","savedDate":"2024-03-28 07:46:08.387","slug":"business-analyst-health-insurance-fully-remote-covergo-548"},{"id":8315297481,"title":"Senior Product Designer, Graphing","company":"Bio Render","image":"https://lever-client-logos.s3-us-west-2.amazonaws.com/0f4b434e-502f-4390-9819-c058d43028c1-1595260531860.png","description":"<div>At BioRender, our mission is to accelerate the world’s ability to learn, discover and communicate science. We are passionate about democratizing science communication in order to accelerate scientific discovery and understanding. We're looking for amazing people to help create the world’s go-to-place and platform where science is communicated. Come join us!</div><div><br></div><div>You can think of BioRender as the ‘Figma/Canva for scientists’, with a suite of web-based graphics communication products to empower scientists to create beautiful scientific visuals and presentations with ease.</div><div><br></div><div>Co-founded by Shiz Aoki, a world-renowned Medical Illustrator, our team has continuously put user experience and design at the core of our product development process. BioRender is design and UX first, and it’s ingrained into our company DNA.</div><div><br></div><div>The Graphing team’s mission is to expand what scientists are able to communicate in BioRender through the easiest-to-use and most delightful graphing and statistical analysis solution. Graphing is a new product currently in open beta, and we’re looking for a Product Designer to obsess over how scientists analyze, visualize and present data to achieve product market fit.</div><h3>What you'll do at BioRender:</h3><li>Within the first 90 days, become an expert on our users, their usage behaviors, and scientists’ typical research workflows. Understanding the user and our product offering will be critical to your success</li><li>Own the end-to-end user experience across the Graphing product and how it integrates with the rest of the BioRender product suite:</li><li>\t(1) Talk to users and obsess over user feedback and usage data of beta users to design user experiences that will create raving fans.</li><li>\t(2) Partner with Product and Data Science to determine what will make BioRender Graphing a critical part of industry scientists' software stack.</li><li>\t(3) Proactively seek, facilitate, and apply feedback from customers, engineers and cross-functional partners to iterate on designs and foster a culture of design collaboration within your team.</li><li>\t(4) Determine if and when product areas or information architecture need to be revisited to achieve long-term success and evaluate the cost-benefit of those tough decisions.</li><li>Contribute to the overall product strategy at BioRender. Consistently reevaluate the roadmap based on user behaviour, feedback, industry trends, company objectives and product strategy. The roadmap is as much yours as it is the product manager’s.&nbsp;</li><li>Be an active member of the BioRender Design team to critique and drive continuous evolution of the overall design of our product, design system, and design practices.</li>,<h3>Our ideal fit:</h3><li>You’ve built simple user experiences in a complex domain where the user is not necessarily the domain expert (think TurboTax for taxes).</li><li>You have experience designing scalable user experiences and design systems that support a wide array of functionality and can be easily extended as requirements change and number of features grows.</li><li>You’ve owned the end-to-end user experience for an entire product. You have experience developing, launching and iterating a highly ambiguous and broad product surface area that may take multiple months to get adoption.</li><li>You’re driven by insatiable user-obsession to understand our users and customers, and design technical products that drive business outcomes.</li><li>You're experienced in leading user research, covering planning, execution, and synthesis to identify the best next steps for optimizing product success.</li><li>Background in statistics or data science is a plus. At least statistics or math does not intimidate you. You will not need to be an expert in statistics and will partner with a data scientist, but statistics is a core part of the product and user research, so you will need to be comfortable with learning about users’ scientific statistical workflows and simplifying their experience.</li><li>Science background is a plus but not required!</li>,<h3>Why join us?</h3><li>We are mission-driven, and work collaboratively towards our shared vision of improving scientific communication and accelerating scientific discovery: BioRender figures have appeared in more than 54,000 publications!&nbsp;</li><li>It’s a product that users love! We have a world-class NPS and a community of loyal fans. Check out our Testimonials page to see what our customers are saying about us: <a href=\"https://biorender.com/testimonials/\" class=\"postings-link\">https://biorender.com/testimonials/</a>&nbsp;</li><li>We are in the top quartile for profitability and year-over-year revenue growth, with users in 200+ countries.</li><li>BioRender is an equal opportunity employer, and an inclusive hiring process and work environment is a part of our DNA.&nbsp;</li><li>We’re remote-first and have team members across Canada and the United States. A physical office in Toronto is available, but you have the flexibility to work from anywhere.&nbsp;</li><li>We’re backed by top investors, accelerators, and some of the most successful life science entrepreneurs and philanthropists in the world including Y Combinator, Malala Fund founders, and Fifty Years VC.&nbsp;</li><li>We are committed to building a warm, inclusive, and diverse environment. Check out how we make sure our employees come first.</li><div><br></div><div>If your interest is piqued, please apply. We'd love to hear from you. Also, be sure to check out other listings on our Careers page.&nbsp;</div><div><br></div><div>BioRender is now remote-first, with plans to bring everyone together at our Toronto office a few times each year.</div><div><br></div><div>We are committed to providing work environments which promote the health, safety and well-being of all employees in accordance with public health regulation and guidance.</div><div><br></div><div><i>BioRender is an equal opportunity employer and, as such, does not discriminate on the basis of race, colour, religion, sex, national origins, age, sexual orientation, disability or any other characteristic protected by applicable laws.&nbsp; Selection decisions are solely based on job-related factors.</i></div><div>Read more about our <a href=\"https://biorender.notion.site/BioRender-Candidate-Resources-8255c155797f442a950720a33b4764d5\" class=\"postings-link\">BioRender interview process &amp; FAQs here!</a></div><div>Check out what it's like to work at BioRender in <a href=\"https://biorender.notion.site/Working-at-BioRender-as-a-Canada-Based-Employee-f6e12ab844154bb9948b22b32e3f0c70\" class=\"postings-link\">Canada</a> and the <a href=\"https://biorender.notion.site/Working-at-BioRender-as-a-U-S-Based-Employee-4ab2cc8e48f546f89aa98c318bccebc9\" class=\"postings-link\">US</a>!</div><div><br></div><div><span style=\"font-size: 10px\">#LI-HC1</span></div>","tags":"[\"B2C\",\"aws\"]","pubDate":"2024-03-27 23:52:12.440","link":"https://jobs.lever.co/biorender/207975f3-7210-4230-9d46-3815deb032f4","savedDate":"2024-03-28 07:46:08.390","slug":"senior-product-designer-graphing-bio-render-6367"},{"id":8276781721,"title":"People Operations Generalist","company":"Bio Render","image":"https://lever-client-logos.s3-us-west-2.amazonaws.com/0f4b434e-502f-4390-9819-c058d43028c1-1595260531860.png","description":"<div>At BioRender, our mission is to accelerate the world’s ability to learn, discover and communicate science. We are passionate about democratizing science communication in order to accelerate scientific discovery and understanding. We're looking for amazing people to help create the world’s go-to-place and platform where science is communicated. Come join us!</div><div><br></div><div>As our People Operations Generalist, you’ll play a critical role in providing a great employee experience as we scale. </div><h3>What you'll be doing:</h3><li>Implement and maintain efficient HRIS systems, ensuring data accuracy, integrity, and compliance.</li><li>Streamline and enhance onboarding, offboarding and leave processes to provide a seamless employee experience.</li><li>Act as a primary point of contact for employee queries, providing timely and accurate resolutions.</li><li>Own HR data and metrics across systems (HR, Employee Surveys, Performance, Compensation) that are used for decision-making around people programs.</li><li>Own the Canadian and US Benefits Program which includes set-up, administration, renewal, and automation.</li><li>Collaborate closely with Talent, IT and Finance teams to integrate HR systems, troubleshoot issues, and optimize processes.</li>,<h3>What you bring to the table:</h3><li>Proven experience (2+ years) in HR operations in a startup environment.</li><li>Strong understanding of HR systems and experience owning key HR processes including onboarding, offboarding and leave management.</li><li>Ideally has experience implementing an HRIS or other HR system (eg performance or comp management system).</li><li>Detail-oriented approach with a commitment to maintaining data accuracy and confidentiality.</li><li>Strong communicator and cross-functional partner, able to build collaborative relationships across the organization.</li><li>Expertise in US and/or Canadian benefits is a plus.</li>,<h3>Why join us?</h3><li>We are mission-driven, and work collaboratively towards our shared vision of improving scientific communication and accelerating scientific discovery: BioRender figures have appeared in more than 16,000 publications!</li><li>It’s a product that users love! We have a world-class NPS and a community of loyal fans. Check out our Testimonials page to see what our customers are saying about us: <u><a href=\"https://biorender.com/testimonials/\">https://biorender.com/testimonials/</a>&nbsp;</u></li><li>We are profitable, funded solely by user growth, and growing more than 200% YoY with users in 200+ countries.</li><li>We're proud that half of our team members are women (including those in leadership positions), and 65% of our team are BIPOC! BioRender is an equal opportunity employer, and an inclusive hiring process and work environment is a part of our DNA.</li><li>We’re remote-first and have team members across Canada and the United States. A physical office in Toronto is available, but you have the flexibility to work from anywhere.</li><li>We’re backed by top investors, accelerators, and some of the most successful life science entrepreneurs and philanthropists in the world including Y Combinator, Malala Fund founders, and Fifty Years VC.</li><li>We are committed to building a warm, inclusive, and diverse environment. Check out how we make sure our <u><a href=\"https://biorender.com/careers/\">employees come first</a>.</u></li><div><span style=\"font-size: 16px\">You can read more about our </span><a href=\"https://biorender.notion.site/BioRender-Candidate-Resources-8255c155797f442a950720a33b4764d5\" style=\"font-size: 16px\">interview process here</a><u style=\"font-size: 16px\">!</u></div>","tags":"[\"Finance\",\"management\"]","pubDate":"2024-03-27 20:48:26.024","link":"https://jobs.lever.co/biorender/792b7c26-d92a-4ca6-9a62-e2860241b16a","savedDate":"2024-03-28 07:46:08.389","slug":"people-operations-generalist-bio-render-4374"},{"id":4565483741,"title":"Controller (Remote)","company":"Empower","image":"https://lever-client-logos.s3.us-west-2.amazonaws.com/2e1a369c-b58f-41ac-8d86-4b0a77695e68-1687915522032.png","description":"<div><b style=\"font-size: 24px\">EMPOWER OVERVIEW</b></div><div><br></div><div><a href=\"http://empower.me/\" style=\"font-size: 11pt\" class=\"postings-link\">Empower</a><span style=\"font-size: 11pt\">&nbsp;</span><span style=\"font-size: 10.5pt\">is a financial technology company on a mission to expand access to fair credit and give anyone in the world the opportunity to improve their financial security and mobility. Our vision is to underwrite the next billion people in the world using alternative data and machine learning to assess financial responsibility more thoughtfully and equitably. Through innovative credit products, offered in a user-friendly mobile experience, we’re making credit more accessible and inclusive and providing more people the chance they deserve to participate in our financial system.</span></div><div><br></div><div>Empower is backed by Sequoia Capital, Blisce, and Icon Ventures. Are we the next great place to grow your impact and accelerate your career? We think so:</div><div>Inc. ranked Empower #56 in the 2023 Inc. 5000 list of the fastest-growing private companies in the US (#55 in 2022). Forbes put Empower on its 2023 list of America's Best Startup Employers. Fast Company recognized the new Empower Thrive line of credit in their 2022 list of the Next Big Things in Tech. </div><div><br></div><div><b style=\"font-size: 18px\">THE EMPOWER WAY</b></div><div><b>Great Expectations</b>: We come up with bold, audacious goals for ourselves and go all out for impact</div><div><b>Owner Mindset</b>: We give every employee latitude to act independently, make smart choices, and move the business forward</div><div><b>Spirited Debate</b>: We love skeptics and seek counter opinions to challenge our personal assumptions and expand our view</div><div><b>Customer Obsession: </b>We listen to understand, empathize, and create a memorable, rewarding experience for our community</div><div><b>Inclusive Collaboration</b>: We believe diverse teams make the best decisions, and we strive to give diverse voices a seat at the table</div><div>N<b>o Jerks Allowed</b>: We value our relationships and take the time to build trust and connection and communicate respectfully</div><div><b>&nbsp;</b></div><div><b style=\"font-size: 18px\">&nbsp;</b></div><div><b style=\"font-size: 18px\">WHAT EMPOWER OFFERS</b></div><div>Competitive salary</div><div>Generous equity package</div><div>Full healthcare and dental benefits</div><div>Technology&nbsp; expense reimbursement</div><div>Work&nbsp; from anywhere</div><div><br></div><div><b style=\"font-size: 18px\">JOB DESCRIPTION</b></div><div><span style=\"font-size: 10pt\">As Controller, you will report to the CFO and be responsible for ensuring the integrity, accuracy, and transparency of our financial reporting. The ideal candidate will have a proven track record of leadership in financial control within the FinTech or related industries, with experience guiding companies through significant growth phases and public offerings.</span></div><div><br></div><div>Travel for company offsites is expected at a minimum 2 times a year. </div><h3>Key Responsibilities</h3><li>Financial Leadership: Lead the accounting function, ensuring accurate and timely financial reporting in accordance with GAAP, as well as compliance with SEC regulations and other applicable laws.</li><li>Strategic Planning: Work closely with the CFO and FP&amp;A team to develop financial strategies that support the company’s growth objectives.</li><li>Internal Controls and Compliance: Design, implement, and maintain a robust system of internal controls to safeguard company assets and ensure the accuracy of financial statements.</li><li>Team Management and Development: Build, lead, and mentor a high-performing accounting team capable of supporting the company’s growth and adaptability through its scaling and IPO journey.</li><li>Stakeholder Communication: Act as a key liaison with external auditors, regulatory bodies, and investors, ensuring clear and transparent communication of the company’s financial status and outlook.</li><li>Process Improvement: Continuously assess and improve financial and accounting processes and systems to increase efficiency, reduce risk, and support scaling operations.</li>,<h3>Candidate Qualifications</h3><li>Bachelor's degree in Accounting, Finance, or related field. CPA or equivalent certification is required.</li><li>10+ years of progressive experience in accounting and finance, with at least 5 years in a leadership role within a FinTech or fast-growing tech company.</li><li>Demonstrated experience leading a company through significant growth phases.</li><li>Strong knowledge of GAAP, SEC reporting, and regulatory compliance requirements in the financial services industry.</li><li>Exceptional leadership skills with the ability to develop and mentor a team.</li><li>Strategic thinker with excellent analytical, organizational, and problem-solving skills.</li><li>Outstanding communication and interpersonal abilities to engage with all levels of the organization and external stakeholders.</li><li>Proficient in financial software and systems (including NetSuite), with a keen eye for leveraging technology to improve operational efficiency.</li><div><br></div><div>At Empower, we hire for people that push themselves to understand others and seek out ways to challenge their personal assumptions. Our hope is that by fostering such an environment, we strengthen our business and relationships by putting people first. We are committed to building a diverse, inclusive, and equitable workspace where everyone (regardless of age, education, ethnicity, gender, sexual orientation, or any personal characteristics) feels like they belong. Even if your experience doesn’t exactly match up to our job description, you should feel empowered to apply regardless!&nbsp;</div>","tags":"[\"Finance\",\"management\",\"aws\"]","pubDate":"2024-03-27 16:06:49.552","link":"https://jobs.lever.co/empower.me/17b93c5b-6dac-485b-8f02-e64f5ec28dde","savedDate":"2024-03-28 07:46:08.388","slug":"controller-remote-empower-1973"},{"id":3121625389,"title":"Middle Python Developer - Remote/Work Anywhere","company":"CloudLinux","image":"https://pbs.twimg.com/profile_images/696718028084482050/ymY3OEPk_400x400.png","description":"<p>CloudLinux is a global remote-first company. We are driven by our principles: Do the right thing, employees first, we are remote first, and&nbsp;we deliver high volume, low-cost Linux infrastructure and security products that help companies to increase the efficiency of their operations. Every person on our team supports each other and does what we can to ensure we all are successful.&nbsp;</p><p>We are truly a great place to work. </p><p>Join our dynamic team in the Release Engineering Department where we take charge of supporting a wide range of system programs. From the Linux kernel to OpenSSL, and from Python to PHP interpreters, we've got it all covered. Our department handles the entire pipeline, from finding vulnerabilities to building, testing, and distributing packages. Here, you'll have the perfect opportunity to enhance your expertise in Linux, security, and packaging. </p><p>As an Engineer in the Innovation Release Engineering Team, you'll play a vital role in our department. Your focus will be on developing, prototyping, enhancing, and supporting software solutions that aim to improve internal company processes. We're looking for someone who brings a combination of creativity, technical expertise, and a problem-solving mindset to deliver reliable and efficient solutions that can be scaled across the entire company.</p><h3></h3><p><strong>Key Responsibilities:</strong></p><ul> <li> <strong>Develop Software Solutions:</strong> Develop and maintain software solutions that streamline internal processes, enhance efficiency, and contribute to cost reduction, supporting the company's scaling efforts.</li> <li> <strong>Solution Enhancement and Support:</strong> Take responsibility for refining prototypes, enhancing their functionality, ensuring their reliability, and supporting these solutions as they are adopted across various teams within the company.</li> <li> <strong>Problem Investigation:</strong> Proactively identify and investigate issues that arise during development and in deployed solutions, employing up-to-date technologies and best practices to find innovative solutions.</li> <li> <strong>Collaboration and Innovation:</strong> Work closely with team members and stakeholders across the company to understand needs, gather feedback, and continuously improve our solutions and processes.</li> </ul><h3>Requirements: </h3><p><strong>To excel in this role, you need:</strong></p><ul> <li>At least 2 years of hands-on experience in Python programming.</li> <li>Experience with System programming, including Sockets, filesystem, and process management, or a strong desire to work with it.</li> <li>Experience with multithreading/multiprocessing/asyncio</li> <li>A strong command over the GNU/Linux operating system and shell scripting abilities.</li> <li>Experience with git-based development processes.</li> <li>Familiarity with PyTest.</li> <li>Intermediate level of English language proficiency.</li> <li>Knowledge of relation databases, along with familiarity in the SQL language (PostgreSQL would be perfect).</li> </ul><p></p><p><strong>It would be great if you also have:</strong></p><ul> <li>Familiarity with Ansible, Jenkins, Docker.</li> <li>Experience in rpm/deb package management (writing rpm spec, deb rules).</li> <li>Capability of performing basic DevOps operations, like setting up testing and production environments.</li> <li>Familiar with basic concepts of LLMs or any other AI</li> </ul><p></p><p><strong>In addition, it is essential that you:</strong></p><ul> <li>Are quick to learn and proactive.</li> <li>Possess a high level of self-motivation and determination to accomplish set goals.</li> <li>Can independently analyze tasks and identify optimal solutions.</li> <li>Excel in collaboration and thrive in team-based environments.</li> <li>Have the versatility to switch between robust production development and speedy rough prototype implementation.</li> </ul><h3>Benefits: </h3><p><strong>What's in it for you?</strong></p><ul> <li>A focus on professional development; </li> <li>Interesting and challenging projects</li> <li> Flexible working hours</li> <li>Paid one month of vacation per year and unlimited sick leave</li> <li>Medical insurance reimbursement</li> <li>Co-working and gym/sports reimbursement</li> <li>The opportunity to receive a reward for the most innovative idea that the company can patent</li> </ul><p></p><p><em>By applying for this position, you agree with </em><a href=\"https://cloudlinux.com/privacy-policy\" rel=\"nofollow noreferrer noopener\" class=\"external\"><em>Cloudlinux Privacy Policy</em></a><em> and give us your consent to maintain and process your personal data with this respect. Please read our Privacy Policy for more information.</em></p>","tags":"[\"postgres\",\"management\",\"engineering\",\"database\"]","pubDate":"2024-03-27 00:00:00.000","link":"https://apply.workable.com/cloudlinux-1/j/26F80D85B5","savedDate":"2024-03-28 07:46:08.387","slug":"middle-python-developer-remote-work-anywhere-cloudlinux-2867"},{"id":6984835490,"title":"Finance Controller (Fully Remote)","company":"CoverGo","image":"https://pbs.twimg.com/profile_images/1382655628523364355/MWPIbbID_400x400.jpg","description":"<p><strong>Top 3 Reasons To Join Us</strong></p><ul> <li>Competitive Salary</li> <li>100% Remote</li> </ul><ul><li>International team</li></ul><ul><li>Working on the latest tech for the Insurtech Market Leader</li></ul><p><strong>About Us</strong></p><p>At CoverGo, our mission is to empower all insurance companies to make insurance 100% digital and accessible to everyone.</p><ul> <li>We are a leading global no-code insurance platform for health, life, and P&amp;C</li> <li>We’re the winner of the Insurtech of the Year in all of Asia and other awards globally</li> <li>We work with insurance enterprise clients such as AXA, Bupa, MSIG, Dai-ichi, Bank of China Group Insurance, and many more</li> <li>We're an international, diverse team of over 120 people with 30 nationalities and team members working remotely from all over the world</li> <li>We are fully funded and backed by reputable VC funds and strategic institutional investors</li> <li>We have a global presence in Asia, EMEA and the Americas</li> <li>We’ve grown our annualized revenue by over 30x since January 2021</li> <li>We’re constantly working towards making CoverGo a workplace that you love coming to. We deeply believe that bringing together a diversity of thoughts, expressions, and perspectives is key to building the best culture for equally diverse communities all over the world</li> </ul><p><strong>About the Role</strong></p><p>As a Finance Controller, you'll lead the financial operations of multiple entities within our group, ensuring compliance with regulations and company policies. Collaborating with executive management, you'll develop forecasts, budgets, and long-term financial plans to support our objectives, including potential IPO considerations. Your international financial expertise will guide us through cross-border complexities, while your hands-on approach will optimize cash flow management and budgeting processes. Additionally, any previous leadership experience will help you manage our existing team of accountants.</p><p><strong>What You Will Do</strong></p><ul> <li>Provide leadership in overseeing the financial operations of multiple entities within the group.</li> <li>Ensure compliance with accounting standards, financial regulations, and company policies.</li> <li>Collaborate with executive management to develop financial forecasts, budgets, and long-term financial plans aligned with the company's objectives. .</li> <li>Contribute to the development and execution of financial plans for future growth, including potential IPO considerations.</li> <li>Prepare comprehensive financial proposals, presentations, and due diligence documents to support fundraising efforts.</li> <li>Leverage extensive international financial experience to navigate the complexities of managing finances across borders.</li> <li>Handle multi-currency transactions and understand the nuances of financial regulations in various jurisdictions.</li> <li>Lead and mentor a high-performing finance team, fostering a culture of excellence and collaboration.</li> <li>Provide guidance on complex financial issues and ensure professional development within the team.</li> <li>Bring expertise in financial technology or insurtech, staying abreast of industry trends and implementing relevant technologies to enhance financial processes.</li> <li>Optimize cash flow management, working capital, and budgeting processes to maximize profitability and minimize financial risks.</li> </ul><p><strong>What We Need</strong></p><ul> <li>Bachelor's degree in Finance, Economics, or Business</li> <li>CPA or ACCA certification is mandatory</li> <li>10+ years of progressive experience in financial roles, with a strong preference for international companies</li> <li>Demonstrated experience overseeing financial operations across multiple jurisdictions</li> <li>Prior exposure to financial technology (FinTech) or insurtech is highly desirable</li> <li>Experience with initial public offerings (IPO) is a significant advantage</li> <li>Experience with Xero or Quickbooks is a plus</li> <li>Previous work experience in a Big Four accounting firm is a plus</li> <li>Able to work independently and under pressure in a fast-paced environment with an emphasis on accuracy and timeliness</li> <li>Meticulous, well-organized and conscientious with a high level of initiative at work</li> <li>Self-motivated, hardworking, a strong sense of responsibility with a positive working attitude</li> <li>Resourceful, can-do attitude and willingness to learn and go beyond</li> <li>Great English communication skills</li> <li>Based in the Philippines</li> </ul><p><strong>Why You'll Love Working Here</strong></p><ul> <li>Fully Remote</li> <li>Flexible Leave</li> <li>International Environment</li> <li>Competitive remuneration package</li> <li>Performance Bonus</li> <li>Stock Options after 6 months</li> <li>Company activities and events</li> <li>Learning and development plan</li> </ul><p>CoverGo Company<a href=\"https://www.youtube.com/watch?v=YI0ezLxvFvA\" rel=\"nofollow noreferrer noopener\" class=\"external\"> Video</a></p><p>By submitting your application, you confirm that you have read, understood, and accepted the content of CoverGo’s<a href=\"https://apply.workable.com/covergo/gdpr_policy?lng=en\" rel=\"nofollow noreferrer noopener\" class=\"external\"> Privacy Notice</a> and you consent to the processing of your data as part of this application.</p><p></p><h3>Requirements: </h3><h3>Benefits: </h3>","tags":"[\"Finance\",\"management\"]","pubDate":"2024-03-27 00:00:00.000","link":"https://apply.workable.com/covergo/j/8CA7DD4D28","savedDate":"2024-03-28 07:46:08.387","slug":"finance-controller-fully-remote-covergo-24"},{"id":1718483245,"title":"Talent Acquisition Coordinator (Remote)","company":"DuckDuckGo","image":"https://spreadprivacy.com/content/images/2023/05/duckduckgo-logo_wide.png","description":"<p>Hi, we’re DuckDuckGo, the Internet privacy company for everyone who wants to take back their privacy now. For over a decade, we've been building our all-in-one product, developing new privacy technology, and working with policymakers to make online privacy simple and accessible for all. </p>\n<p><br /></p>\n<p>Our app is now downloaded more than 78M times a year, and our private search engine packaged with it has become the #2 search engine on mobile in the United States and 18 other countries, including the United Kingdom, Canada, Australia, Germany, and the Netherlands. Oh, and we've been profitable since 2014, with revenue exceeding $100 million a year! Now, we’re rolling out a suite of new privacy solutions, including <u><a href=\"https://www.spreadprivacy.com/introducing-email-protection-beta/\" rel=\"noopener\">Email Protection</a></u>,  <u><a href=\"https://spreadprivacy.com/introducing-app-tracking-protection/\" rel=\"noopener\">App Tracking Protection</a></u> and our first-ever Desktop Apps for <u><a href=\"https://spreadprivacy.com/introducing-duckduckgo-for-mac/\" rel=\"noopener\">Mac</a></u><a href=\"https://spreadprivacy.com/introducing-duckduckgo-for-mac/\" rel=\"noopener\"> </a>and <u><a href=\"https://spreadprivacy.com/windows-browser-open-beta/\" rel=\"noopener\">Windows</a></u>.</p>\n<p><br /></p>\n<p>We’re looking for a Talent Acquisition Coordinator to help shape our all-in-one privacy solution and join our mission to show the world that protecting your privacy online can be simple.  </p>\n<p><br /></p>\n<p><strong>The Opportunity</strong> </p>\n<p>In this role, you will represent DuckDuckGo externally to job seekers, serving as a key point of contact for candidates as they navigate interviews. Your primary responsibility will be coordinating the logistics of our hiring process. You’ll partner closely with your teammates in Talent Acquisition and hiring partners across the organization to ensure fair, high-functioning interview processes that result in exceptionally qualified hires.</p>\n<p><br /></p>\n<p>You'll be in a unique position to identify opportunities to improve hiring at DuckDuckGo, where we recognize that hiring decisions are some of the highest-impact decisions we can make. Your day-to-day work will include corresponding with prospective candidates, managing job postings on external career sites, scheduling interviews across timezones, and monitoring feedback on candidate projects. You’ll partner with Recruiters and Hiring Managers as you work to automate processes, reduce bias, and raise the quality of our hires. </p>\n<p><br /></p>\n<p><strong>What You Will Bring to DuckDuckGo</strong> </p>\n<ul><li>Thoroughness, follow-through, and fastidious attention to detail, even when faced with repetitive tasks.</li><li>Strong communication skills.</li><li>Ability to manage competing priorities, refocus work based on urgency, and adapt to new information quickly.</li><li>Experience automating and streamlining tasks and processes, using software tools to accelerate impact.</li><li>Ability to draw meaningful insights from recruiting data.</li><li>2-3+ years experience in a TA Coordinator or administrative role.</li></ul>\n<p><br /></p>\n<p><strong>How We Will Support You </strong> </p>\n<p>Our core values -- build trust, question assumptions, and validate direction -- underpin how we work day-to-day and the support we give our team members. We strive to empower our team members to be self-directed and self-motivated in their work.  </p>\n<p><br /></p>\n<ul><li><strong>Remote First, Always</strong>: We've always been a fully distributed company with team members all over the world. We trust you to get your work done wherever, and whenever.   </li><li><strong>Commitment to Personal Growth:</strong> Every team member has an annual budget of $1,250 USD to invest in their professional development. Every team member also has a dedicated Career Advisor, who serves as a guide to help you develop your strengths, identify your motivations, and understand your opportunities for growth. </li><li><strong>Leadership:</strong> We have many different types of leaders and possible combinations of leadership roles, so you can grow your career in a way that aligns best with your personal goals. You can seek additional leadership roles by being directly responsible for projects, taking ownership of areas of the company, developing and maintaining internal processes, or pursuing advisory roles. </li><li><strong>Work/Life Balance: </strong>Team members have the freedom and flexibility to organize their own work schedules. We want you to thrive both in and out of the office. We trust you to use good judgment and take the time off that you need to bring your best self to work.  </li></ul>\n<p><br /></p>\n<p>We also offer paid parental leave, a co-working stipend, office setup reimbursement, and a wellness stipend. More support resources can be found in our <u><a href=\"https://duckduckgo.com/assets/hiring/team_support_guide.pdf\" rel=\"noopener\">Team Member Support Guide</a></u>, which explains how we make your well-being a priority. </p>\n<p><br /></p>\n<p>For more information on how we collaborate worldwide, from leadership in our relatively flat organization to start-to-finish ownership<strong>,</strong> check out <u><a href=\"https://duckduckgo.com/assets/hiring/how_we_work.pdf\" rel=\"noopener\">DuckDuckGo Culture: How We Work.</a></u> </p>\n<p><br /></p>\n<p><strong>Compensation</strong> </p>\n<p>Annual compensation: $87,000 USD and stock options. Compensation is the same within a professional level, regardless of geographic location or functional area, and the compensation for each professional level is transparent across the organization.</p>\n<p><br /></p>\n<p><strong>Hiring Process</strong> </p>\n<p>Hiring works best when it's a two-way street. Learn how we help you get to know DuckDuckGo and envision your future role here. Find out more about <u><a href=\"https://duckduckgo.com/assets/hiring/how_we_hire.pdf\" rel=\"noopener\">how we hire</a></u>. </p>\n<p><br /></p>\n<p><strong>Diversity, Equity, and Inclusion</strong> </p>\n<p>DuckDuckGo provides equal work opportunities to all team members and applicants<u>,</u> and it prohibits discrimination and harassment of any type on the basis of race, color, ethnicity, caste, religion, age, sex (including pregnancy), national origin, disability status, genetics, protected veteran status, sexual orientation, gender identity or expression, or any other characteristic protected by our policies or federal, state, or local laws.</p>\n<p><br /></p>\n<p>We want to ensure that our hiring process is accessible. If you need reasonable accommodation for any part of the application process because of a medical condition or disability, please send an email to <u><a href=\"mailto:careers@duckduckgo.com\" rel=\"noopener\">careers@duckduckgo.com</a></u> to let us know the nature of your request.  </p>\n<p><br /></p>\n<p>If you think you might thrive in this environment, we would love to hear from you. </p>\n<p><br /></p>\n<p><strong>Please note that:</strong> </p>\n<ul><li>Sometimes we meet up! Expect to travel at least two times a year: once for our all-hands meetup and again for a team retreat (each around 4-5 days). While extenuating circumstances may impact attendance, everyone is strongly encouraged to attend.</li><li>While we offer a flexible work arrangement with no core hours, expect an average full-time commitment of 40 hours per week. </li><li>A successful candidate will be subject to a background check and must receive satisfactory results of the same, as a condition of joining the team. </li><li>By applying for this role, you confirm that all information submitted is accurate and complete. You further acknowledge that providing false or fraudulent information during the application process is cause for denial of an offer, revocation of any existing offer, or other adverse action, up to and including termination after the start of your commencement of work.  </li></ul>\n<p><br /></p>\n<p>#US #UK #SP #PL #IR #IC #HN #CR #CN #AU #LI-EM1</p>","tags":"[\"aws\"]","pubDate":"2024-03-26 21:30:59.000","link":"https://duckduckgo.recruitee.com/o/talent-acquisition-coordinator-2","savedDate":"2024-03-28 07:46:08.385","slug":"talent-acquisition-coordinator-remote-duckduckgo-8695"},{"id":5690602583,"title":"Associate Commercial Counsel","company":"Ampla","image":"https://remotive.com/job/1903105/logo","description":"<p><strong>Who We Are </strong></p>\n<p><strong>Our Products: </strong>Traditional banking just wasn’t built to make growing a consumer brand easy. We want to change that. Our financial platform is designed for brands of any size, no matter how they sell. From access to capital with the <a href=\"%22https://www.getampla.com/product-growth-loc%22\" rel=\"nofollow\">Growth Line of Credit</a>, to simplified money management with <a href=\"%22https://www.getampla.com/product-banking%22\" rel=\"nofollow\">Ampla Banking</a> or our <a href=\"%22https://www.getampla.com/product-corporate-card%22\" rel=\"nofollow\">Corporate Card</a> for the modern CPG brand - we make growing businesses easier.</p>\n<p><strong>Our Mission:</strong> To build modern financial tools that will fuel growth for companies of the future 🚀</p>\n<p><strong>Our Culture: </strong>Join our dynamic team where competition drives excellence and a strong work ethic is celebrated! At Ampla, we thrive on pushing boundaries and achieving remarkable results. Our culture is defined by a relentless pursuit of success and a commitment to delivering our best every day. If you're driven, ambitious, and ready to embrace challenges head-on, come be a part of a team where hard work is not only valued but rewarded. Join us and elevate your career to new heights in an environment that challenges you to raise the bar and champions your dedication to excellence.</p>\n<p> </p>\n<p><strong>About the Role</strong></p>\n<p>We are looking for a mid-level commercial attorney to join our team to provide legal advice and support with respect to lending transactions with U.S. companies in the consumer packaged goods (CPG) sector.  This is a foundational role within a strategic business unit that directly reports to the COO.  You will partner with internal team leads across Sales, Customer Success, and Credit, among other departments, to drive revenue growth and manage legal risk across multiple credit products. </p>\n<p> </p>\n<p><strong>Responsibilities:</strong></p>\n<ul style=\"\">\n<li style=\"\">Lead all legal aspects of commercial lending transactions, including drafting, reviewing, analyzing, and negotiating credit contracts and transactional documents, with a primary focus on small and medium-sized enterprises (SMEs) and middle-market businesses. </li>\n<li style=\"\">Conduct legal due diligence in connection with senior secured lending transactions including identifying key legal and regulatory risks and developing mitigation strategies.</li>\n<li style=\"\">Liaise with outside counsel on transactional, bankruptcy, and litigation matters as related to Ampla’s borrowers and other credit clients.</li>\n<li style=\"\">Support Ampla’s regulatory compliance program by applying for and maintaining commercial lending licenses, to the extent required in each state Ampla operates. </li>\n<li style=\"\">Supervise outside counsel for timeliness, cost-effectiveness, and quality of service and work product.</li>\n<li style=\"\">Develop, implement, and improve scalable legal processes, including developing and enhancing legal playbooks, continuously refining contract templates, and streamlining the deal-closing process.</li>\n<li style=\"\">Partner with Product to develop tooling to improve efficiency relating to legal negotiation, documentation, and execution for all new and existing customers across Ampla’s credit product offering.</li>\n</ul>\n<p> </p>\n<p><strong>Qualifications:</strong></p>\n<ul style=\"\">\n<li style=\"\">5+ years of legal experience (including 2+ years at a top-tier law firm) in structuring and reviewing SME financing transactions, including senior secured lending transactions. Special consideration will be received if you have worked for a financial technology startup (~1-2 years) and/or have prior experience in commercial litigation.</li>\n<li style=\"\">J.D. degree from top U.S. law school.</li>\n<li style=\"\">Active membership in at least one state bar. </li>\n<li style=\"\">Capable of working independently with minimal supervision and responding to shifting priorities with ease. </li>\n<li style=\"\">Demonstrated interest in working, and ability to thrive, in a start-up atmosphere of constant change and growth.</li>\n<li style=\"\">Ownership mentality.</li>\n<li style=\"\">Ability to own and implement process improvement with cross-functional groups</li>\n</ul><div class='\"content-conclusion\"'><p><em>Ampla is an Equal Opportunity Employer and does not discriminate on the basis of an individual's sex, age, race, color, creed, national origin, alienage, religion, marital status, pregnancy, sexual orientation or affectional preference, gender identity and expression, disability, genetic trait or predisposition, carrier status, citizenship, veteran or military status and other personal characteristics protected by law. All applications will receive consideration for employment without regard to legally protected characteristics.</em></p></div><img src=\"https://remotive.com/job/track/1903105/blank.gif?source=public_api\" alt=\"\"/>","tags":"[\"documentation\",\"attorney\",\"startup\",\"banking\"]","pubDate":"2024-03-26 21:21:12.000","link":"https://remotive.com/remote-jobs/finance-legal/associate-commercial-counsel-1903105","savedDate":"2024-03-28 07:46:08.382","slug":"associate-commercial-counsel-ampla-5612"},{"id":6197123015,"title":"QA Engineer","company":"Sustainment","image":"https://remotive.com/job/1903242/logo","description":"<div class='\"content-intro\"'><p><strong>Company Overview: </strong>Sustainment is a company whose products enable US-based manufacturers to confidently build and manage vetted domestic supplier networks, with modern tools to find, communicate, collaborate with, and manage qualified manufacturing suppliers. Our vision is to reimagine the American manufacturing base as a hyperconnected, secure, and resilient ecosystem of local and regional suppliers who can more easily interact and transact with the government and industry organizations that rely on them. As a public benefit corporation, we are committed to a mission-driven approach that will enable continued success for American industry.</p></div><p>We are looking for a Quality Assurance (QA) engineer to develop and execute exploratory and automated tests to ensure product quality. Your responsibilities would include conducting manual testing of features, identifying automated testing opportunities and contributing to the Cypress automated testing code base. Ultimately, you would monitor all stages of the SDLC to identify and resolve issues to meet quality standards.</p>\n<p><strong>Responsibilities: </strong></p>\n<ul style=\"\">\n<li style=\"\">Write, design, and execute automated tests by creating scripts using Cypress</li>\n<li style=\"\">Maximize automated and manual test coverage for the most critical features </li>\n<li style=\"\">Write concise, complete, well organized test cases, bug reports, and status reports</li>\n<li style=\"\">Develop and apply testing processes for new and existing products to meet company needs</li>\n<li style=\"\">Ability to execute different testing methods: functional, regression, performance, usability testing</li>\n<li style=\"\">Review requirements, specifications and technical design documents to provide timely and meaningful feedback</li>\n<li style=\"\">Collaborate with internal teams to ensure features are complete and tested thoroughly</li>\n</ul>\n<p><strong>Qualifications: </strong></p>\n<ul style=\"\">\n<li style=\"\">Bachelor's degree or equivalent work experience</li>\n<li style=\"\">Proven work experience in software quality assurance</li>\n<li style=\"\">Keen eye for detail and commitment to excellence</li>\n<li style=\"\">Strong knowledge of software QA methodologies, tools, and processes</li>\n<li style=\"\">Strong analytical skills to identify test plan automation possibilities</li>\n<li style=\"\">Strong analytical and problem-solving skills</li>\n<li style=\"\">Strong communication skills</li>\n<li style=\"\">Minimum of 2 years experience writing, maintaining and deploying QA automation tests</li>\n</ul>\n<p><strong>Preferred Qualifications:</strong></p>\n<ul style=\"\">\n<li style=\"\">Experience with Cypress<strong> </strong>automated testing frameworks</li>\n<li style=\"\">Experience in an Agile/Scrum environment</li>\n<li style=\"\">Experience with UI and API automated testing frameworks</li>\n<li style=\"\">Understanding of software development process</li>\n<li style=\"\">Knowledge of CI and experience working with build and release tools</li>\n<li style=\"\">Working in an early startup environment or on SaaS products is a plus</li>\n</ul>\n<p><strong>Core Technologies:</strong></p>\n<ul style=\"\">\n<li style=\"\">.NET</li>\n<li style=\"\">Angular</li>\n<li style=\"\">Docker</li>\n<li style=\"\">AWS - including GovCloud</li>\n<li style=\"\">Kubernetes</li>\n<li style=\"\">Gitlab</li>\n<li style=\"\">Datadog</li>\n<li style=\"\">Cypress</li>\n</ul><div class='\"content-conclusion\"'><p>Sustainment offers a competitive benefits package including medical, dental, vision, paid time off, company holidays, and 401K matching.</p>\n<p>Sustainment is proud to be an equal opportunity employer. We provide employment opportunities without regard to age, race, color, ancestry, national origin, religion, disability, sex, gender identity or expression, sexual orientation, veteran status, or any other protected class.</p>\n<p>Applicants must be authorized to work for ANY employer in the U.S. We are unable to sponsor or take over sponsorship of an employment Visa at this time.</p>\n<p>Sustainment participates in<a href=\"%22https://www.e-verify.gov/%22\" rel=\"nofollow\" target='\"_blank\"'> E-Verify.</a></p></div><img src=\"https://remotive.com/job/track/1903242/blank.gif?source=public_api\" alt=\"\"/>","tags":"[\"manual testing\"]","pubDate":"2024-03-26 15:21:43.000","link":"https://remotive.com/remote-jobs/qa/qa-engineer-1903242","savedDate":"2024-03-28 07:46:08.383","slug":"qa-engineer-sustainment-6342"},{"id":9333083656,"title":"Spanish Speaking Legal Intake Specialist","company":"OutSta","image":"https://remotive.com/job/1903106/logo","description":"<p>We are looking for a Legal Intake Specialist. In this role, you will be responsible for managing the initial intake and documentation processes related to personal injury law cases. This position involves engaging with clients, assessing their legal needs, and ensuring accurate and comprehensive information is gathered to initiate legal proceedings. You will be working 50 hours per week during American business hours and get paid weekly.</p>\n<p><strong>Responsibilities:</strong></p>\n<ul style=\"\">\n<li style=\"\">Serve as the initial point of contact for individuals seeking legal assistance in injury matters</li>\n<li style=\"\">Conduct interviews or intake assessments to gather detailed information about clients' potential legal issues and relevant circumstances by using an intake sheet</li>\n<li style=\"\">Provide basic information on available legal services to potential clients</li>\n<li style=\"\">Provide important information to the attorney to assess the claims and determine the best legal strategies for each client</li>\n<li style=\"\">Communicate legal processes and potential outcomes to clients clearly and understandably</li>\n<li style=\"\">Work closely with attorneys and legal staff to convey critical information and updates</li>\n<li style=\"\">Accurately record and update client information in the case management system</li>\n<li style=\"\">Draft and send the engagement letter to clients for signature</li>\n<li style=\"\">Ensure all required legal forms and documentation are completed and filed appropriately</li>\n<li style=\"\">Compile all necessary documentation before the initial call with the attorney is scheduled</li>\n<li style=\"\">Coordinate and calendar and initial call after all documents have been received</li>\n<li style=\"\">Draft charge of discrimination to be filed with the Equal Employment Opportunity Commission</li>\n<li style=\"\">Collaborate with other legal departments or external organizations to address clients' comprehensive legal needs</li>\n<li style=\"\">Conduct follow-up activities to track the progress of legal cases and address any additional client needs or concerns</li>\n<li style=\"\">Collaborate with attorneys to ensure seamless transitions in legal representation</li>\n</ul>\n<p><strong>Qualifications:</strong></p>\n<ul style=\"\">\n<li style=\"\">Fluent in Spanish and English, written and oral</li>\n<li style=\"\">Experience working as a legal intake specialist for a US law firm for 2+ years</li>\n<li style=\"\">Knowledge of Trello and Clio is a plus</li>\n<li style=\"\">Proven experience in a legal intake or client services role.</li>\n<li style=\"\">Excellent communication and interpersonal skills, with an ability to empathize with clients.</li>\n<li style=\"\">Detail-oriented with exceptional organizational and time-management abilities.</li>\n</ul>\n<img src=\"https://remotive.com/job/track/1903106/blank.gif?source=public_api\" alt=\"\"/>","tags":"[\"documentation\",\"trello\",\"attorney\"]","pubDate":"2024-03-26 13:20:25.000","link":"https://remotive.com/remote-jobs/finance-legal/spanish-speaking-legal-intake-specialist-1903106","savedDate":"2024-03-28 07:46:08.383","slug":"spanish-speaking-legal-intake-specialist-outsta-8102"},{"id":3766816865,"title":"Lead Security Operations Center Analyst Remote/Work Anywhere","company":"CloudLinux","image":"https://pbs.twimg.com/profile_images/696718028084482050/ymY3OEPk_400x400.png","description":"<p>Imunify360 Security Suite is a product of CloudLinux Inc., the maker of the #1 OS in security and stability for hosting providers. Imunify is an innovative security solution designed specifically for shared and VPS/Dedicated servers. The automated, easy-to-use solution with the six-layer approach to security delivers comprehensive and complete attack prevention.</p><p>This exciting opportunity involves leading a dynamic team of talented web processing developers. Together, you and your exceptional team will have the chance to play a crucial role in ensuring top-notch web security.</p><p>We are seeking an individual who embodies the core values that define our company:</p><ul> <li> <strong>Leadership:</strong> Driven to mentor, guide and grow your team</li> <li> <strong>Curious:</strong> Embrace curiosity by conducting research and designing experiments with a hands-on approach.</li> <li> <strong>Tenacious:</strong> Our Analytics team never backs down from the challenge of creating something new; we persist until we succeed.</li> <li> <strong>Customer Passion:</strong> Be the driving force behind our solution, constantly staying ahead of malware developers.</li> <li> <strong>Design for Scale:</strong> Collaborate with our analytics and engineering team to develop web protection solutions that can scale effectively.</li> <li> <strong>Agile:</strong> Your role will involve a mix of research, experiment design, and utilizing analytical tools to uncover insights in real-time incidents and file infections.</li> <li> <strong>Roll Up Your Sleeves:</strong> Partner closely with internal teams to learn from others and achieve success together.</li> </ul><p></p><p><strong>How you will make an impact:</strong></p><ul> <li>Collaborate with engineering teams to enhance the security solution for web-hosting servers.</li> <li>Effectively communicate complex ideas to various audiences</li> <li>Manage priorities, communicate deadlines, for team and stakeholders</li> <li>Take charge of a dynamic team of talented security engineers</li> <li>Motivate and guide your team to excel in software development by implementing best practices.</li> <li>Oversee and strategically organize projects</li> <li>Perform exploratory data analysis and build production machine learning models that identify malware, uncover hidden patterns in incidents, and detect file infections and malicious behavior.</li> <li>Create prototypes and automation code in Python</li> <li>Work with distributed data pipelines to process and analyze data efficiently.</li> </ul><h3>Requirements: </h3><p><strong>Our ideal candidate:</strong></p><ul> <li>Deep understanding of Websecurity and its ecosystem</li> <li>Deep understanding of the Linux command line</li> <li>Has experience leading and developing teams</li> <li>ModSec, OSSEC knowledge preferable&nbsp;</li> <li>Possesses practical knowledge of SQL</li> <li>Demonstrates expertise in web development, particularly Python/PHP/JS</li> <li>Is fluent in English; C1 or better</li> <li>Holds a Bachelor's degree in computer science, applied mathematics, or an analytical field or equivalent practical experience</li> </ul><h3>Benefits: </h3><p><strong>What's in it for you?</strong></p><ul> <li>A focus on professional development;</li> <ul> <li>Training reimbursements</li> <li>Mentor programs</li> <li>Knowledge-Exchange programs</li> <li>Interesting and challenging projects</li> </ul> <li>Flexible working hours</li> <li>Paid 24 days of vacation per year and unlimited sick leave</li> <li>Medical insurance reimbursement</li> <li>Co-working and gym/sports reimbursement</li> <li>The opportunity to receive a reward for the most innovative idea that the company can patent.</li> </ul><p><em>By applying for this position, you agree with </em><a href=\"https://cloudlinux.com/privacy-policy\" rel=\"nofollow noreferrer noopener\" class=\"external\"><em>Cloudlinux Privacy Policy</em></a><em> and give us your consent to maintain and process your personal data with this respect. Please read our Privacy Policy for more information.</em></p>","tags":"[\"engineering\"]","pubDate":"2024-03-26 00:00:00.000","link":"https://apply.workable.com/cloudlinux-1/j/CA69591321","savedDate":"2024-03-28 07:46:08.387","slug":"lead-security-operations-center-analyst-remote-work-anywhere-cloudlinux-8002"},{"id":6247287302,"title":"Digital Insurance Project Manager (Fully Remote)","company":"CoverGo","image":"https://pbs.twimg.com/profile_images/1382655628523364355/MWPIbbID_400x400.jpg","description":"<p><strong>Top 3 Reasons To Join Us</strong></p><ul> <li>Competitive Salary</li> <li>100% Remote</li> <li>Working on the latest tech for the Insurtech Market Leader</li> </ul><p><strong>About Us</strong></p><p>At CoverGo, our mission is to empower all insurance companies to make insurance 100% digital and accessible to everyone.</p><ul> <li>We are a leading global no-code insurance platform for health, life, and P&amp;C</li> <li>We’re the winner of the Insurtech of the Year in all of Asia and other awards globally</li> <li>We work with insurance enterprise clients such as AXA, Bupa, MSIG, Dai-ichi, Bank of China Group Insurance, and many more</li> <li>We're an international, diverse team of over 120 people with 30 nationalities and team members working remotely from all over the world</li> <li>We are fully funded and backed by reputable VC funds and strategic institutional investors</li> <li>We have a global presence in Asia, EMEA and the Americas</li> <li>We’ve grown our annualized revenue by over 30x since January 2021</li> <li>We’re constantly working towards making CoverGo a workplace that you love coming to. We deeply believe that bringing together a diversity of thoughts, expressions, and perspectives is key to building the best culture for equally diverse communities all over the worldrkplace that you love coming to. We deeply believe that bringing together a diversity of thoughts, expressions, and perspectives is key to building the best culture for equally diverse communities all over the world</li> </ul><p><strong>About the Role</strong></p><p>As a Digital Insurance Project Manager, your core responsibility will be to oversee and manage the implementation of new and/or existing projects within CoverGo's operations. This role presents an exciting opportunity for an individual with a strong drive to lead transformative projects in the insurtech industry. </p><p><strong>What You Will Do</strong></p><ul> <li>Engage and manage relationships with clients and stakeholders</li> <li>Lead project planning sessions with the internal team and client's staff</li> <li>Support solution proposals for client pursuits, proposals, and PoCs</li> <li>Participate in proposal and POC processes (i.e. design, submission, and review)</li> <li>Support the creation of contracts and related communication with clients</li> <li>Identify and help secure growth opportunities for existing clients</li> <li>Manage project progress and adapt work as required</li> <li>Ensure projects meet deadlines</li> <li>Manage relationships with clients and stakeholders</li> <li>Host regular/weekly project review and create reports with key metrics about team and project status using company standard metrics</li> <li>Oversee all incoming and outgoing project documentation</li> <li>Identify and manage issues, risks, assumptions, and dependencies</li> <li>Continuously optimize and improve processes and the overall approach where necessary</li> </ul><p><strong>What We Need</strong></p><ul> <li>Bachelor's degree in computer science or a related technical field is a plus</li> <li>5+ years experience as a Project Manager</li> <li>Insurance domain knowledge is a must</li> <li>Strong client facing experience is a must</li> <li>Technical skills are a plus</li> <li>Has experience seeing projects through the full life cycle</li> <li>Excellent analytical skills and problem-solving skills</li> <li>Strong interpersonal skills and extremely resourceful</li> <li>Proven ability to complete projects according to outlined scope, budget, and timeline</li> <li>Self-motivated and able to work independently</li> <li>Able, willing, and excited to work in a fast-paced collaborative startup environment</li> </ul><p><strong>Why You'll Love Working Here</strong></p><ul> <li>Fully Remote</li> <li>Flexible Leave</li> <li>International Environment</li> <li>Competitive renumeration package</li> <li>Performance Bonus</li> <li>Stock Options after 6 months</li> <li>Company activities and events</li> <li>Learning and development plan</li> </ul><p><strong>CoverGo Company </strong><a href=\"https://www.youtube.com/watch?v=YI0ezLxvFvA\" rel=\"nofollow noreferrer noopener\" class=\"external\"><strong>Video</strong></a></p><p>By submitting your application, you confirm that you have read, understood, and accepted the content of CoverGo’s <a href=\"https://apply.workable.com/covergo/gdpr_policy?lng=en\" target=\"_blank\" rel=\"nofollow noreferrer noopener\" class=\"external\">Privacy Notice</a> and you consent to the processing of your data as part of this application.</p><p><a href=\"https://www.youtube.com/watch?v=YI0ezLxvFvA\" rel=\"nofollow noreferrer noopener\" class=\"external\"></a></p><h3>Requirements: </h3><h3>Benefits: </h3>","tags":"[]","pubDate":"2024-03-26 00:00:00.000","link":"https://apply.workable.com/covergo/j/073FB4CACE","savedDate":"2024-03-28 07:46:08.388","slug":"digital-insurance-project-manager-fully-remote-covergo-5641"},{"id":6214874299,"title":"Principal Product Manager","company":"Accumulussynergyinc","image":"https://remotive.com/job/1902019/logo","description":"<div class='\"content-intro\"'><div class=\"h2\">Background</div>\n<p>Accumulus Synergy is a nonprofit trade association working on behalf of industry to address the global need for digital transformation. To help solve for this need, Accumulus is developing a transformative data exchange platform to enable enhanced collaboration and efficiency between life sciences organizations and health authorities worldwide. The Accumulus Platform aims to improve efficiencies in the regulatory process by leveraging advanced technology, including data science and AI, as well as tools for secure data exchange to improve patient safety, help reduce the cost of innovation, and ultimately bring patients safe and effective medicines faster. Accumulus is working with key stakeholders in the life sciences - regulatory ecosystem to build and sustain a platform that aims to meet regulatory, cybersecurity, and privacy requirements spanning clinical, safety, chemistry and manufacturing, and regulatory exchanges and submissions. Accumulus Synergy sponsors include Amgen, Astellas, AstraZeneca, Bristol Myers Squibb, GSK, Johnson &amp; Johnson, Lilly, Merck, Pfizer, Roche, Sanofi, and Takeda.</p></div><div class=\"h2\">Job Description</div>\n<p>Accumulus is seeking a Principal Product Manager. This will be a key role within the Product Team, reporting directly to the Chief Product Officer.</p>\n<p>Starting day one, you will have the unique opportunity to support the future of Accumulus Synergy and our platform by forming the strategy for and leading execution of foundational product initiatives in our roadmap. You will collaborate closely with subject matter experts, UX designers within Accumulus, sponsors, and representatives across global health authorities to develop strategic direction and high level designs. These efforts will help shape the path and effectively communicate and validate requirements throughout the agile development process. You’ll work across the product lifecycle from identifying market opportunities to understanding users to executing plans for meeting roadmap objectives and effectively communicating product value. You should enjoy working at a fast pace with experts across disciplines to deliver software tools supporting new review and sharing processes between health authorities and life sciences organizations. This role requires a deep understanding of complex software solutions, strong leadership skills, and a passion for innovation and driving product excellence.</p>\n<div class=\"h3\">Responsibilities</div>\n<ul style=\"\">\n<li style=\"\">Own the strategy for multiple product teams, aligning with company goals and market opportunities. Drive innovation and differentiation within the regulated industry landscape, positioning our products for sustained growth and competitive advantage. </li>\n<li style=\"\">Lead the development and execution of the product roadmap, driving the big picture and prioritizing initiatives based on customer insights, market trends, and strategic objectives, continually assessing and adjusting execution plans in response to evolving market dynamics. Collaborate with stakeholders and provide frequent communication to ensure alignment and transparency throughout the organization. </li>\n<li style=\"\">Collaborate with Product Designers to develop high level designs that serve as the foundation for iteration to ensure what we plan to develop meets user needs, accomplishes the jobs to be done, and aligns with company strategy. </li>\n<li style=\"\">Orchestrate the delivery of product commitments within the teams you lead to ensure functionality works as a whole and to maximize the value of each release. Anticipate risks and provide risk mitigation options. </li>\n<li style=\"\">Work in partnership with business operations (program managers) to ensure successful and timely product delivery.</li>\n<li style=\"\">Stay informed about regulatory requirements and industry standards relevant to our target markets. Ensure that our platform meets all necessary compliance standards and certifications, working closely with legal, regulatory, security and quality teams. </li>\n<li style=\"\">Ensure the successful resolution of product issues identified by field organizations both during development and post-production.</li>\n<li style=\"\">Articulate the value of new features and the future direction of the platform to customers and partners.</li>\n<li style=\"\">Evangelize products and become the subject matter expert for internal audiences, external customers/potential customers, and market-facing communications</li>\n<li style=\"\">Focus the company on future growth areas that drive business value and deliver a strong return based on corporate goals and initiatives.</li>\n<li style=\"\">Collaborate with product marketing, customer success, sales and operations to develop effective go to market plans and appropriate training and processes for feature launches and feature scalability</li>\n<li style=\"\">Develop a deep understanding of the market and identify areas to drive further digital transformation through unique value propositions that position the Accumulus platform as the leader and driver of innovation. </li>\n</ul>\n<div class=\"h3\">Qualifications</div>\n<ul style=\"\">\n<li style=\"\">Bachelor’s degree or commensurate experience</li>\n<li style=\"\">Excellent communication skills; written, verbal and formal presentation</li>\n<li style=\"\">Willingness to travel once or twice per quarter</li>\n<li style=\"\">Proven track record as a product leader in enterprise software</li>\n<li style=\"\">8 years or more of experience in the product management function</li>\n<li style=\"\">5 years or more of experience managing enterprise platforms</li>\n<li style=\"\">5 years or more of experience working in an Agile environment</li>\n<li style=\"\">Extensive experience in one of the following: Enterprise SaaS solutions, Life Sciences or other regulated software, project management software or content management software</li>\n<li style=\"\">Preferred:</li>\n<ul style=\"\">\n<li style=\"\">Experience implementing AI/ML into enterprise software</li>\n<li style=\"\">Experience managing collaboration software systems</li>\n<li style=\"\">Technical or hands-on experience</li>\n</ul>\n</ul><div class='\"content-conclusion\"'><div class=\"h2\">Benefits</div>\n<p>While we hope the Accumulus mission is what really attracts you, we also have a lot to offer. Organizations are built by great people, and to attract great people you need to offer a great employee experience. Accumulus can provide:</p>\n<ul style=\"\">\n<li style=\"\">Very competitive compensation w/ bonus plan. We must compete with big names in tech &amp; pharma for top talent and compensate accordingly.</li>\n<li style=\"\">401(k) matching, immediately vested</li>\n<li style=\"\">A full benefits package: multiple health plans, vision, dental, life, and disability insurance</li>\n<li style=\"\">100% remote work. Accumulus is a <em>fully remote </em>organization, and we intend to remain so</li>\n<li style=\"\">Experienced leadership to mentor you. We have drawn successful leaders from the biopharma industry with a deep understanding of regulatory affairs and combined them with similarly successful leaders in SaaS product development. Learning opportunities abound.</li>\n</ul>\n<div class=\"h2\">Unsolicited Contact Policy</div>\n<p>Please note that we do not consider resumes submitted by unsolicited third-party recruitment firms. Additionally, we kindly request that candidates refrain from sending unsolicited resumes or making unsolicited phone calls directly to Accumulus employees. To be considered for any open positions, please utilize our online job application system. We appreciate your cooperation and understanding.</p></div><img src=\"https://remotive.com/job/track/1902019/blank.gif?source=public_api\" alt=\"\"/>","tags":"[\"product management\"]","pubDate":"2024-03-25 19:20:40.000","link":"https://remotive.com/remote-jobs/product/principal-product-manager-1902019","savedDate":"2024-03-28 07:46:08.383","slug":"principal-product-manager-accumulussynergyinc-320"},{"id":1868553023,"title":"Infrastructure Engineer (Blockchain)","company":"Logos","image":"https://remotive.com/job/1903385/logo","description":"<div class='\"content-intro\"'><p>Logos is a movement supporting the development of the decentralised web. Logos technologies lay the foundations for a freer internet upon which communities can evolve into network states. Each protocol in the Logos stack seeks to empower its users while upholding civil liberties and fundamental freedoms.</p>\n<p> </p></div><div class='\"careers-block__trix'>\n<p></p>\n<p><strong>The role</strong></p>\n<p>DevOps is a buzzword, but it's also generic enough to encompass the breadth of tasks required in supporting development teams. There are many ways to make the lives of developers easier, and everyone has their own best way, which also means every team has their own way. There is no perfect way to make everyone happy with the same thing.</p>\n<p>Supporting developers involves debugging obscure bash scripts from years ago that nobody remembers. It means biting on a piece of wood and using data formats turned programming languages like YAML to configure CI jobs. It means tracking down minute differences between releases of packages and libraries causing unexpected crashes. It means rewriting the same Dockerfile for the 5th time to allow a project to use one more obscure library. Or tracking down absurd race conditions of multi-threaded tests running in parallel on the same host. Or pulling your hair out at a bug only to realize it works fine after the CI worker host is restarted.</p>\n<p>But fundamentally it means wrestling it all into submission and making it run smoothly... at least for as long as you're there.</p>\n<p>If you have the guts to fight against entropy and deterioration of the reality we inhabit, then you just might also be crazy enough to enjoy the struggle while it lasts, and appreciate the eventual fruits of our labour, if you value privacy, freedom, and transparency. You might even make some money, and learn a bit from all the exceptional engineers working here.</p>\n<p> </p>\n<p><strong>Who you are</strong></p>\n<p>You have strong Linux Fundamentals:</p>\n<ul style=\"\">\n<li style=\"\">Distros and package managers</li>\n<li style=\"\">Good understanding of process management</li>\n</ul>\n<p>You have programming experience:</p>\n<ul style=\"\">\n<li style=\"\">At least a few languages and showing the ability to learn</li>\n<li style=\"\">Bash as a minimum; Python would be helpful </li>\n</ul>\n<p>You have experience in Continuous Integration:</p>\n<ul style=\"\">\n<li style=\"\">Jenkins CI - Pipelines are written in Groovy</li>\n<li style=\"\">GitHub Actions - PR builds, mostly</li>\n</ul>\n<p>You have experience in Security:</p>\n<ul style=\"\">\n<li style=\"\">Good understanding of OpenSSH</li>\n<li style=\"\">GnuPG for encryption of secrets and backups</li>\n</ul>\n<p><span class='\"hljs-strong\"'>Distributed Systems:</span></p>\n<ul style=\"\">\n<li style=\"\">Experience running Ethereum nodes</li>\n<li style=\"\">Knowledge of Layer 2 scaling solutions</li>\n</ul>\n<p> </p>\n<p><strong>Compensation</strong></p>\n<p>We are happy to pay in any mix of fiat/crypto.</p>\n<p> </p>\n<p><strong>Hiring process</strong></p>\n<ol style=\"\">\n<li style=\"\">Interview with the Talent team</li>\n<li style=\"\">Paid task</li>\n<li style=\"\">Technical interview with Head of Infra</li>\n</ol>\n<p><em>[The</em> <em>steps may change along the way if we see it makes sense to adapt the interview stages, so please consider the above as a guideline]</em></p>\n<p></p>\n<p> </p>\n</div><img src=\"https://remotive.com/job/track/1903385/blank.gif?source=public_api\" alt=\"\"/>","tags":"[\"security\",\"distributed systems\"]","pubDate":"2024-03-25 17:22:11.000","link":"https://remotive.com/remote-jobs/devops/infrastructure-engineer-blockchain-1903385","savedDate":"2024-03-28 07:46:08.383","slug":"infrastructure-engineer-blockchain-logos-5805"},{"id":1273568099,"title":"Business Analyst","company":"maids.cc","image":"https://remotive.com/job/1904165/logo","description":"<p style=\"margin-bottom: 0px; margin-top: 0px;\"><strong>Your Job in Brief:</strong></p><p style=\"margin-bottom: 0px; margin-top: 0px;\">As a Business Analyst at maids.cc, you will play an important role in gathering, analyzing, and interpreting data to provide valuable insights that drive informed business decisions. You will focus on conducting comprehensive business research, identifying market trends, and collaborating with internal departments to enhance strategic planning and operational efficiency.</p><p style=\"margin-bottom: 0px; margin-top: 0px;\"> </p><p style=\"margin-bottom: 0px; margin-top: 0px;\"><strong>What You’ll Do:</strong></p><ul style=\"\"><li style=\"\">Understand a problem from a business perspective, extract and analyze relevant data, and create an automated solution that would solve it.</li><li style=\"\">Create new websites, apps, and features to gain new clients and reduce existing clients' attrition.</li><li style=\"\">Use analytics and BI tools such as Tableau, Mixpanel to analyze and understand customer behavior, track KPIs, and identify trends and patterns to inform decision-making and optimize strategies.</li><li style=\"\">Apply strategic statistical methods, data modeling, and predictive analysis.</li><li style=\"\">Design and build workflows and mockup screens.</li><li style=\"\">Use advanced data visualization techniques and build wireframes to communicate solutions.</li></ul><p style=\"margin-bottom: 0px; margin-top: 0px;\"> </p><p style=\"margin-bottom: 0px; margin-top: 0px;\"><strong>What you'll bring along:</strong></p><ul style=\"\"><li style=\"\">University Degree in Engineering, Mathematics, Physics, Finance, Economics or any degree with exceptional ability in quantitative analytics.</li><li style=\"\">Students in their final year of uni or recent grads are also welcome to apply.</li><li style=\"\">Burning desire to apply your quantitative background to manipulate and manage data.</li><li style=\"\">Excellent English proficiency, as it greatly enhances efficiency and time saving. Your attention to this requirement prior to applying is greatly appreciated.</li></ul><p style=\"margin-bottom: 0px; margin-top: 0px;\"> </p><p style=\"margin-bottom: 0px; margin-top: 0px;\"><strong>What You’ll Get:</strong></p><ul style=\"\"><li style=\"\">Hands-On Experience in statistical analysis, AB Testing, identifying complex data patterns, advanced communication skills and tools, an exquisite learning experience in a progressive, technologically oriented environment.</li><li style=\"\">Company culture of constant experimentation, strong bias for moving fast, and obsession for mapping every detail.</li><li style=\"\">We pay for performance, and rapidly promote superior ability. We also unhire mediocre performers decisively.</li></ul><p style=\"margin-bottom: 0px; margin-top: 0px;\"> </p><p style=\"margin-bottom: 0px; margin-top: 0px;\"><strong>Position includes work typically performed by:</strong></p><p><span class=\"ui-provider biw bix avx biy biz bja bjb bjc bjd bje bjf bjg bjh bji bjj bjk bjl bjm bjn bjo bjp bjq bjr bjs bjt bju bjv bjw bjx bjy bjz bka bkb bkc bkd\" dir=\"ltr\"></span></p><ul style=\"\"><li style=\"\">Business Intelligence Analyst</li><li style=\"\">Data Scientist</li><li style=\"\">Business Consultant</li><li style=\"\">Management Consultant</li><li style=\"\">Business Analyst</li><li style=\"\">Financial Engineer</li><li style=\"\">Economist</li></ul><p><br></p><p>This is a Fully Remote Job.</p>\n<img src=\"https://remotive.com/job/track/1904165/blank.gif?source=public_api\" alt=\"\"/>","tags":"[\"business intelligence\",\"research\",\"analytics\",\"mixpanel\",\"tableau\",\"data visualization\",\"testing\"]","pubDate":"2024-03-25 06:44:10.000","link":"https://remotive.com/remote-jobs/data/business-analyst-1904165","savedDate":"2024-03-28 07:46:08.383","slug":"business-analyst-maids-cc-6854"},{"id":9745340861,"title":"Senior Python Developer - REMOTE/Work Anywhere","company":"CloudLinux","image":"https://pbs.twimg.com/profile_images/696718028084482050/ymY3OEPk_400x400.png","description":"<p>We have a fantastic opportunity for individuals who embody our company values:</p><ul> <li> <strong>Curious:</strong> Are you willing to explore, conduct research, and design experiments?</li> <li> <strong>Tenacious:</strong> Do you have the determination to persevere and never give up?</li> <li> <strong>Customer Passion:</strong> Are you passionate about providing solutions and staying ahead of malware developers?</li> <li> <strong>Design for Scale:</strong> Can you contribute to making web protection at scale achievable?</li> <li> <strong>Agile:</strong> Are you comfortable switching between researching and designing experiments and using your analytical skills to uncover real-time insights and address incidents?</li> <li> <strong>Roll Up Your Sleeves:</strong> Are you ready to collaborate closely with internal teams and succeed together?</li> </ul><p>If this describes you, then you have the potential to join our team and make a significant impact. As part of the role, you will:</p><ul> <li>Develop automation services using AI/ML/NLP and Large Language Model integrations to streamline our workflows.</li> <li>Design and prototype new algorithms with a touch of AI for code generation, code analysis, and code review.</li> <li>Review and enhance Python-based services and their CI/CD workflows.</li> </ul><p>By joining us, you will enjoy a range of benefits:</p><ul> <li> <strong>Independence in Action:</strong> Take ownership of projects from beginning to end, working autonomously.</li> <li> <strong>End-to-End Ownership:</strong> Oversee all aspects of a project, ensuring attention to detail and precision.</li> <li> <strong>Dynamic Environment:</strong> Thrive in a fast-paced, ever-changing setting, effectively managing multiple tasks.</li> <li> <strong>Quick Learners Welcome:</strong> Adapt to new information and skills with ease, embracing evolving challenges.</li> <li> <strong>Variety and Challenge:</strong> Engage in a diverse workload that offers continual learning opportunities.</li> </ul><h3>Requirements: </h3><p>To thrive in this role, you should possess:</p><ul> <li>At least 5 years of experience as a Python developer</li> <li>Proficiency in reviewing ANSI C source code</li> <li>Hands-on experience writing and reviewing code in a shared Python codebase</li> <li>Familiarity with CI/CD workflow using GitLab and git, including automated testing</li> <li>Comfortable working with the Linux command line</li> <li>Excellent English communication skills (spoken, written, and reading at C1 level or better)</li> <li>Expertise in LLM/NLP/ML is a plus</li> <li>Practical knowledge of SQL is a plus</li> </ul><h3>Benefits: </h3><p><strong>What's in it for you?</strong></p><ul> <li>A focus on professional development; </li> <li>Interesting and challenging projects</li> <li> Flexible working hours</li> <li>Paid one month vacation per year and unlimited sick leave</li> <li>Medical insurance reimbursement</li> <li>Co-working and gym/sports reimbursement</li> <li>The opportunity to receive a reward for the most innovative idea that the company can patent</li> </ul><p><em>By applying for this position, you agree with </em><a href=\"https://cloudlinux.com/privacy-policy\" rel=\"nofollow noreferrer noopener\" class=\"external\"><em>Cloudlinux Privacy Policy</em></a><em> and give us your consent to maintain and process your personal data with this respect. Please read our Privacy Policy for more information.</em></p>","tags":"[]","pubDate":"2024-03-25 00:00:00.000","link":"https://apply.workable.com/cloudlinux-1/j/0852772D69","savedDate":"2024-03-28 07:46:08.387","slug":"senior-python-developer-remote-work-anywhere-cloudlinux-1487"}]