[{"id":1688898515,"title":"Customer Launch Engineer","company":"HappyCo","image":"https://avatars.githubusercontent.com/u/1021150?s=200&v=4","description":"<div><b style=\"font-size: 11pt\">HappyCo is a company where people can grow their careers and work with like minded people, with no egos or politics. HappyCo is values driven and offers a flexible, supportive culture. Join HappyCo and <a class=\"postings-link\" href=\"https://happy.co/media/make-work-happy\">Make Work Happy</a>!</b>&nbsp;</div><div><br></div><div><br></div><div><b style=\"font-size: 16px;\">About the Role</b></div><div><br></div><div><span style=\"font-size: 16px;\">HappyCo is seeking a Customer Launch Engineer to provide expert frontline support for our customers during product launch and beyond. In this role, you will develop automations to manual steps within our launch flow, debug and resolve technical issues, collaborate with internal teams to improve processes, and help customers integrate with HappyCo’s services. Your work will directly enhance customer satisfaction, accelerate launches, and reduce reliance on core engineering teams, allowing them to focus on product innovation.</span></div><div><b style=\"font-size: 16px;\">About the Role</b></div><div><br></div><div><span style=\"font-size: 16px;\">HappyCo is seeking a Customer Launch Engineer to provide expert frontline support for our customers during product launch and beyond. In this role, you will develop automations to manual steps within our launch flow, debug and resolve technical issues, collaborate with internal teams to improve processes, and help customers integrate with HappyCo’s services. Your work will directly enhance customer satisfaction, accelerate launches, and reduce reliance on core engineering teams, allowing them to focus on product innovation.</span></div><h3>Key Responsibilities</h3><li>Develop well-structured code to assist customers with seamless integrations into HappyCo’s services.</li><li>Provide specialist technical support to customers and properties during launch.</li><li>Investigate and debug reported issues, offering clear insights to both customers and internal teams.</li><li>Identify recurring issues and propose long-term solutions to improve product stability.</li><li>Proactively manage scope, delivery, and configuration of product changes to ensure smooth rollouts.</li><li>Contribute to product development and rollout strategies, providing feedback to improve processes.</li><li>Ensure launch ticket resolution meets and exceeds service level agreements (SLAs).</li><h3>Required Experience & Skills / Technical Skills:</h3><li>2+ years of experience in a software engineering role.</li><li>Strong debugging and troubleshooting skills, particularly in SaaS or cloud-based environments.</li><li>Proficiency in coding or scripting languages (e.g., Python, JavaScript, SQL, or similar) for issue diagnosis and integrations.</li><li>Experience with APIs, web services, and system integrations to assist customers with product implementation.</li><li>Familiarity with cloud platforms (e.g., AWS, Azure, or Google Cloud) and infrastructure concepts</li><h3>Required Experience & Skills / Customer-Facing & Problem-Solving Experience:</h3><li>Experience providing direct technical support to customers, troubleshooting software issues, and managing ticket resolution.</li><li>Ability to analyze trends in customer issues and work with product teams to implement long-term solutions.</li><li>Understanding of SLAs and incident management processes, ensuring timely response to critical customer issues.</li><h3>Required Experience & Skills / Soft Skills & Mindset</h3><li>Strong communication skills, able to explain technical concepts clearly to both engineers and non-technical stakeholders.</li><li>Problem-solving mindset, capable of working under pressure to diagnose and resolve technical issues.</li><li>A proactive approach to continuous improvement, identifying process enhancements to streamline support and launch operations.</li><li>Collaboration skills, working closely with product and engineering teams to improve overall customer experience.</li><h3>Preferred Experience & Nice-to-Haves</h3><li>Experience with monitoring and logging tools (e.g., Datadog, Splunk, or New Relic).</li><li>Prior work with CI/CD pipelines, DevOps practices, or software deployment processes.</li><li>Exposure to customer onboarding and implementation processes, particularly in a SaaS environment.</li><li>Background in working with B2B enterprise customers, especially in property management, real estate tech, or a related industry.</li><li>Previous experience in working in a global team working across time zones.</li><div><span style=\"font-size: 16px;\">If you’re passionate about solving complex technical challenges, working closely with customers, and driving impactful solutions, we’d love to hear from you!</span></div><div><br></div><div><b style=\"font-size: 11pt\">Our HappyCo Culture &amp; Benefits</b></div><div><span style=\"font-size: 11pt\">HappyCo strives to build better communities. So naturally, we are dedicated to making our own community an enjoyable place that lets us do our best work. We’re devoted to building an inclusive, supportive culture that empowers each HappyCo’er to succeed and grow. To learn more about our culture, check out our</span><a class=\"postings-link\" style=\"font-size: 11pt\" href=\"https://www.glassdoor.com.au/Overview/Working-at-HappyCo-EI_IE1533158.11,18.htm\">&nbsp;</a><a class=\"postings-link\" style=\"font-size: 11pt\" href=\"https://happy.co/company/careers\">careers page!</a><span style=\"font-size: 11pt\">&nbsp;</span></div><div><br></div><div><b>We Offer:</b></div><div>- Work from anywhere supported by a flexible company culture</div><div>- Opportunity to work for one of the fastest growing technology companies in the PropTech industry</div><div>- Generous paid parental leave</div><div>- Competitive and equitable pay, including stock options</div><div>- Access to employee assistance programs to support both physical and mental wellness</div><div>- Monthly stipends to support Wellness and Home Office expenses</div><div><br></div><div>Find out more about our <a class=\"postings-link\" href=\"https://happy.co/company/careers/employee-benefits-aus\">AU Employee Benefits</a> here!</div><div><br></div><div><i style=\"font-size: 11pt\">We believe in supporting people to do their best work and thrive, and building a diverse, equitable, and inclusive company is core to our mission. Our goal is to ensure that HappyCo upholds an inclusive environment where all people feel that they are equally respected and valued, whether they are applying for an open position or working at the company. We welcome applicants of any educational background, gender identity and expression, sexual orientation, religion, ethnicity, age, citizenship, socioeconomic status, disability, and veteran status. HappyCo is also committed to providing reasonable accommodations for qualified individuals with disabilities and disabled veterans in our job application procedures.</i></div><div><br></div><div><i style=\"font-size: 11pt\">A note to Recruitment Agencies: Please don’t reach out to us about our roles -- we’ve got it covered. We don’t accept unsolicited agency resumes and HappyCo is not responsible for any fees related to unsolicited resumes.</i></div><div><b style=\"font-size: 11pt\">HappyCo is a company where people can grow their careers and work with like minded people, with no egos or politics. HappyCo is values driven and offers a flexible, supportive culture. Join HappyCo and <a href=\"https://happy.co/media/make-work-happy\" class=\"postings-link\">Make Work Happy</a>!</b>&nbsp;</div><div><br></div>","tags":"[\"javascript\",\"management\",\"engineering\",\"b2b\",\"aws\"]","pubDate":"2025-04-02T01:22:37.454Z","link":"https://jobs.lever.co/happyco/2ac171b3-379f-4f88-8714-50b0aca1e0d4","slug":"customer-launch-engineer-happyco-7784"},{"id":4183651644,"title":"Senior Full-stack Engineer (HN)","company":"Blue Coding","image":"https://media.licdn.com/dms/image/C4D0BAQHlK67hgnhzQw/company-logo_200_200/0/1631346154820?e=2147483647&v=beta&t=_R2Ssj7L_f4xqmSCcq0nOLCyCz0QN2lFnHssxxhj3YY","description":"<div><i style=\"font-size: 18px\">Do you want to earn a salary in USD?&nbsp;</i></div><div><i style=\"font-size: 18px\">Would you like to work from wherever you want?</i></div><div><i style=\"font-size: 18px\">Would you like to be a part of the leading next-gen software developers?&nbsp;</i></div><div><br></div><div><b style=\"font-size: 24px\">Hi, you finally found us!</b><span style=\"font-size: 24px\">&nbsp;</span></div><div><br></div><div><b style=\"font-size: 24px\">Why work at Blue Coding?</b><span style=\"font-size: 24px\">&nbsp;</span></div><div><br></div><div>At Blue Coding we specialize in hiring excellent developers and amazing people from all over Latin America and other parts of the world. For the past 10 years, we’ve helped cutting-edge companies in the United States and Canada -both large and small, build great development teams and develop great products. Online shops, digital agencies, SaaS providers, and software consulting firms are a few of our clients. Our team of over 100 engineers is distributed in more than 10 countries across the Americas. We are a fully remote company working with a wide array of technologies and have expertise in every stage of the software development process.&nbsp;&nbsp;</div><div><br></div><div>Our team is highly connected, united, and culturally diverse, and our collaborators are involved in many initiatives around the world, from wildlife preservation to volunteering at local charities. We also participate in group activities like movie nights, trivia, and meme competitions. We stand for honesty, fairness, respect, efficiency, hard work, and cooperation.</div><div><br></div><div><b style=\"font-size: 18px;\">What are we looking for?</b></div><div><br></div><div><span style=\"font-size: 16px;\">We are seeking a </span><b style=\"font-size: 16px;\">Senior Software Engineer</b><span style=\"font-size: 16px;\"> to join the team of one of our international clients, a company dedicated to improving the healthcare experience for patients and clinicians through AI-powered solutions. This organization provides AI-powered intake and clinical documentation solutions that enhance patient and provider experiences, improve revenue integrity, and increase physician productivity.</span></div><div><br></div><div><span style=\"font-size: 16px;\">In this role, you will be responsible for developing and maintaining mission-critical systems that support healthcare operations and interoperability for numerous clinics and health systems. You will be free to define the team's technical direction, develop processes for successful client and partner integrations, and guide the architectural evolution of applications. This position offers the opportunity to shape the future of the company's product offerings and solutions.​</span></div><div><br></div><div><span style=\"font-size: 16px;\">As part of a tight-knit startup, you will collaborate with a cross-functional team of product managers, solution engineers, client experience managers, and other software engineers to create world-class solutions that meet client needs. The company values customer-centric approaches and fosters a deep ownership of products and services from design to implementation and ongoing development. They emphasize efficiency and success through continuous learning, balancing craftsmanship and speed-to-market by employing unit testing, end-to-end automation, and high service telemetry to enable robust systems.</span></div><div><br></div><div><span style=\"font-size: 16px;\">Their cutting-edge stack includes full-stack TypeScript leveraging NestJS, React, Remix, Tailwind CSS, GraphQL, PostgreSQL, Redis, and Pulumi, all on AWS. The architecture is service-oriented and managed in a monorepo. The team constantly explores new and exciting technologies to improve developer and user experiences.</span></div><div><br></div><div><span style=\"font-size: 16px;\">If you are independent, a great communicator, a problem solver, and have a strong attention to detail, this is an excellent fit for you! Our jobs are fully remote – as long as you have the skills and can get the work done well, you can work from anywhere in the listed countries you want.</span></div><div><br></div><h3>Here are some of the exciting day-to-day challenges you will face in this role:</h3><li>Design, implement, and maintain highly scalable and performant services and applications.</li><li>Continually improve the codebase and test coverage through refactoring, unit testing, system testing, automating deployments, and general up-leveling of our codebase.</li><li>Design and improve our tooling and systems to support our growth as they continue to scale.</li><li>Mentor and support other team members on design techniques, establishing coding standards, and providing feedback to ensure best practices.</li><li>Deep architecture work experimenting with new and exciting technologies.</li><li>Collaborate with cross-functional teams to drive insights for our products and services to enhance their capabilities.</li>,<h3>You will shine if you have:</h3><li>5+ years of experience building robust and scalable full-stack applications, databases, and developer tools.</li><li>Significant experience designing, building, deploying, operating, and maintaining production applications at scale.</li><li>Extensive experience with JavaScript (TypeScript), React, NodeJS (NestJS), and PostgreSQL.</li><li>Familiarity with modern web technologies (HTTP2, WebSockets, gRPC, GraphQL).</li><li>Experience leaving the codebase better than how you found it through automated testing (ViTest, Cypress, Playwright),  continuous deployment, and continuous integration (CircleCI, Github Actions, CodeFresh).</li><li>Exposure in architecting and developing solutions to ambiguous problems with significant impact</li>,<h3>It doesn't hurt if you also have:</h3><li>Experience with observability and monitoring systems (Datadog, Grafana, Sentry, Cloudwatch, etc.)</li><li>Experience with infrastructure-as-code in production</li><li>Familiarity with front-end and internal UI technologies (ReTool, Salesforce Communities, Contentful, React, NextJS, etc.)</li><li>Experience with containers and container orchestrators like Docker or Kubernetes</li><li>Experience designing, versioning, and scaling APIs</li><li>Extensive experience with one of the following languages (GoLang, Python, JavaScript, TypeScript, Kotlin)</li><li>Experience working with healthcare, healthcare technology, and clinical staff, or other regulated industries, and/or EHR/EMR integration experience</li><li>Experience debugging distributed systems</li><li>Experience with container runtime environments such as Fargate.</li>,<h3>Here are some of the perks we offer you:</h3><li>Salary in USD</li><li>Long-term</li><li>Flexible schedule (within US Time zones)</li><li>100% Remote</li><div><b style=\"font-size: 24px\">Hey, you are still here!</b><span style=\"font-size: 24px\">&nbsp;</span></div><div><br></div><div>So, let us ask a few questions. Do you like working in a friendly environment? Are you fluent in English? Do you have a strong work ethic, are detail-oriented and have an ownership mentality? And most importantly do you love music and puppies? If so, then what are you waiting for? Come join our team and become part of this awesome company! We will be expecting you.</div>","tags":"[\"postgres\",\"pulumi\",\"javascript\",\"typescript\",\"database\",\"aws\"]","pubDate":"2025-04-01T18:53:06.513Z","link":"https://jobs.lever.co/bluecoding/edd5acad-e48e-4e81-b7db-108a737b6094","slug":"senior-full-stack-engineer-hn-blue-coding-1526"},{"id":5966071606,"title":"Fixed Income Trader & Operations Associate II","company":"Alpaca","image":"https://avatars.githubusercontent.com/u/30398729?s=200&v=4","description":"&lt;div class=&quot;content-intro&quot;&gt;&lt;div class=&quot;c-message_kit__blocks c-message_kit__blocks--rich_text&quot;&gt;\n&lt;div class=&quot;c-message__message_blocks c-message__message_blocks--rich_text&quot; data-qa=&quot;message-text&quot;&gt;\n&lt;div class=&quot;p-block_kit_renderer&quot; data-qa=&quot;block-kit-renderer&quot;&gt;\n&lt;div class=&quot;p-block_kit_renderer__block_wrapper p-block_kit_renderer__block_wrapper--first&quot;&gt;\n&lt;div class=&quot;p-rich_text_block&quot;&gt;\n&lt;p&gt;&lt;strong&gt;Who We Are:&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;Alpaca is a US California headquartered brokerage infrastructure technology company and self-clearing broker-dealer, delivering execution and custody solutions for Stocks, ETFs, Options, Cryptocurrencies, and more, and has raised over $170 million in funding. Amongst our subsidiaries, Alpaca is a licensed financial services company in multiple countries, and we serve hundreds of financial institutions globally such as broker-dealers, investment advisors, hedge funds, and crypto exchanges.&lt;/p&gt;\n&lt;p&gt;Alpaca’s globally distributed team members bring in diverse experiences such as engineers, traders, and brokerage professionals to achieve our Mission of opening financial services to everyone on the planet. We are also deeply committed to open-source contributions and fostering a vibrant community. We will continue to enhance and improve our award-winning developer-friendly API and the infrastructure behind it.&lt;/p&gt;\n&lt;p&gt;&lt;br&gt;&lt;br&gt;&lt;strong&gt;Our Team Members:&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;We’re a team of 150+ globally distributed members who love working from our favorite places worldwide. Our team spans the USA, Canada, Japan, Hungary, Nigeria, Brazil, the United Kingdom, and more!&lt;/p&gt;\n&lt;p&gt;We’re looking for candidates eager to join Alpaca’s growing organization, who are excited about our Mission of “Open financial services to everyone on the planet and share our Values of “Stay Curious,” “Have Empathy,” and “Be Accountable.”&lt;/p&gt;\n&lt;p&gt;&amp;nbsp;&lt;/p&gt;\n&lt;/div&gt;\n&lt;/div&gt;\n&lt;/div&gt;\n&lt;/div&gt;\n&lt;/div&gt;&lt;/div&gt;&lt;h3&gt;Your Role:&lt;/h3&gt;\n&lt;p&gt;As a Fixed Income Trader &amp;amp; Operations Associate II you will be responsible for all aspects of the firm&#39;s fixed income product offering.&amp;nbsp; The job includes handling the buying and selling across all fixed income products approved by the firm such as the U.S. Treasuries Bonds, Bills, and Corporate Bonds. You will also be responsible for helping the firm build out the product offering and operational structure which includes regulatory reporting requirements, client communication, and all project related activities to make sure the firm has the most effective fixed income offering.&amp;nbsp;&lt;/p&gt;\n&lt;h3&gt;Things You Get To Do:&lt;/h3&gt;\n&lt;ul&gt;\n&lt;li&gt;Trader/Operational Subject Matter Expert to oversee and provide specialized expertise across all aspects of the Fixed Income Product Offering.&amp;nbsp;&lt;/li&gt;\n&lt;li&gt;Help manage the day-to-day operations of the Fixed Income Product Offering, including trade execution, clearing, settlements, and corporate actions, ensuring accuracy and efficiency across processes&lt;/li&gt;\n&lt;li&gt;Partner with internal teams, including trading, operations, and external partners (execution venues and custodians), to create comprehensive day-to-day workflow documentation.&lt;/li&gt;\n&lt;li&gt;Leverage the firm’s technology stack to streamline trading and operational workflows, creating efficiencies across the fixed income lifecycle.&lt;/li&gt;\n&lt;li&gt;Provide feedback and actionable suggestions for continuous improvement of the Fixed Income product offering.&lt;/li&gt;\n&lt;li&gt;Partner with the Compliance team to ensure the Fixed Income operations adhere to all regulatory requirements, providing input and expertise to assist in the creation and maintenance of the firm’s written supervisory procedures.&lt;/li&gt;\n&lt;/ul&gt;\n&lt;h3&gt;Who You Are (Must-Haves):&lt;/h3&gt;\n&lt;ul&gt;\n&lt;li&gt;Bachelor’s degree in Finance, Business Administration, Economics, or a related field.&lt;/li&gt;\n&lt;li&gt;Has a minimum of 5 years in the fixed income industry&lt;/li&gt;\n&lt;li&gt;Must possess comprehensive knowledge of the fixed income space, including trading, regulatory requirements, and operational processes such as execution, reconciliations, corporate actions, and tax considerations.&lt;/li&gt;\n&lt;li&gt;Proven experience with clearing and settling Fixed Income products, particularly through FICC&lt;/li&gt;\n&lt;li&gt;Experienced in SQL and Google Suite; familiarity with additional data analysis or workflow tools is a plus.&lt;br&gt;Excellent organizational skills, and a problem-solver who is able to provide effective solutions&lt;/li&gt;\n&lt;li&gt;Effective communication skills, both written and verbal, to interact with internal and external stakeholders.&lt;/li&gt;\n&lt;li&gt;Ability to work independently, manage priorities, and meet deadlines in a fast-paced environment.&lt;/li&gt;\n&lt;li&gt;Has a Series SIE, 99, and 57, 24 preferred but not required.&lt;/li&gt;\n&lt;/ul&gt;&lt;div class=&quot;content-conclusion&quot;&gt;&lt;h3&gt;&lt;strong&gt;How We Take Care of You:&lt;/strong&gt;&lt;/h3&gt;\n&lt;ul&gt;\n&lt;li style=&quot;font-weight: 400; text-align: justify;&quot;&gt;&lt;span style=&quot;font-weight: 400;&quot;&gt;Competitive Salary &amp;amp; Stock Options&lt;/span&gt;&lt;/li&gt;\n&lt;li style=&quot;font-weight: 400; text-align: justify;&quot;&gt;&lt;span style=&quot;font-weight: 400;&quot;&gt;Benefits: Health benefits start on day 1. In the US this includes Medical, Dental, Vision. In Canada, this includes supplemental health care. In Japan, you are offered local benefits. Internationally, this includes a stipend value to offset medical costs.&amp;nbsp;&amp;nbsp;&amp;nbsp;&lt;/span&gt;&lt;/li&gt;\n&lt;li style=&quot;font-weight: 400; text-align: justify;&quot;&gt;&lt;span style=&quot;font-weight: 400;&quot;&gt;New Hire Home-Office Setup: One-time USD $500&lt;/span&gt;&lt;/li&gt;\n&lt;li style=&quot;font-weight: 400; text-align: justify;&quot;&gt;&lt;span style=&quot;font-weight: 400;&quot;&gt;Monthly Stipend: USD $150 per month via a Brex Card&lt;/span&gt;&lt;/li&gt;\n&lt;li style=&quot;font-weight: 400; text-align: justify;&quot;&gt;&lt;span style=&quot;font-weight: 400;&quot;&gt;Work with awesome hard working people, super smart and cool clients and innovative partners from around the world&lt;/span&gt;&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;&lt;em&gt;&lt;span style=&quot;font-weight: 400;&quot;&gt;Alpaca is proud to be an equal opportunity workplace dedicated to pursuing and hiring a diverse workforce.&lt;br&gt;&lt;/span&gt;&lt;/em&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span style=&quot;font-size: 8pt;&quot;&gt;&lt;a href=&quot;https://files.alpaca.markets/disclosures/AlpacaRecruitmentPrivacyPolicy.pdf&quot;&gt;&lt;em&gt;&lt;span style=&quot;font-weight: 400;&quot;&gt;Recruitment Privacy Policy&lt;/span&gt;&lt;/em&gt;&lt;/a&gt;&lt;/span&gt;&lt;/p&gt;&lt;/div&gt;","tags":"[\"finance\"]","pubDate":"2025-04-01T16:13:04.000Z","link":"https://job-boards.greenhouse.io/alpaca/jobs/5393141004","slug":"fixed-income-trader-operations-associate-ii-alpaca-8220"},{"id":5782342024,"title":"Global Director of Operations, Crypto","company":"Alpaca","image":"https://avatars.githubusercontent.com/u/30398729?s=200&v=4","description":"&lt;div class=&quot;content-intro&quot;&gt;&lt;div class=&quot;c-message_kit__blocks c-message_kit__blocks--rich_text&quot;&gt;\n&lt;div class=&quot;c-message__message_blocks c-message__message_blocks--rich_text&quot; data-qa=&quot;message-text&quot;&gt;\n&lt;div class=&quot;p-block_kit_renderer&quot; data-qa=&quot;block-kit-renderer&quot;&gt;\n&lt;div class=&quot;p-block_kit_renderer__block_wrapper p-block_kit_renderer__block_wrapper--first&quot;&gt;\n&lt;div class=&quot;p-rich_text_block&quot;&gt;\n&lt;p&gt;&lt;strong&gt;Who We Are:&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;Alpaca is a US California headquartered brokerage infrastructure technology company and self-clearing broker-dealer, delivering execution and custody solutions for Stocks, ETFs, Options, Cryptocurrencies, and more, and has raised over $170 million in funding. Amongst our subsidiaries, Alpaca is a licensed financial services company in multiple countries, and we serve hundreds of financial institutions globally such as broker-dealers, investment advisors, hedge funds, and crypto exchanges.&lt;/p&gt;\n&lt;p&gt;Alpaca’s globally distributed team members bring in diverse experiences such as engineers, traders, and brokerage professionals to achieve our Mission of opening financial services to everyone on the planet. We are also deeply committed to open-source contributions and fostering a vibrant community. We will continue to enhance and improve our award-winning developer-friendly API and the infrastructure behind it.&lt;/p&gt;\n&lt;p&gt;&lt;br&gt;&lt;br&gt;&lt;strong&gt;Our Team Members:&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;We’re a team of 150+ globally distributed members who love working from our favorite places worldwide. Our team spans the USA, Canada, Japan, Hungary, Nigeria, Brazil, the United Kingdom, and more!&lt;/p&gt;\n&lt;p&gt;We’re looking for candidates eager to join Alpaca’s growing organization, who are excited about our Mission of “Open financial services to everyone on the planet and share our Values of “Stay Curious,” “Have Empathy,” and “Be Accountable.”&lt;/p&gt;\n&lt;p&gt;&amp;nbsp;&lt;/p&gt;\n&lt;/div&gt;\n&lt;/div&gt;\n&lt;/div&gt;\n&lt;/div&gt;\n&lt;/div&gt;&lt;/div&gt;&lt;div class=&quot;ak-renderer-extension  &quot; data-layout=&quot;default&quot;&gt;\n&lt;div class=&quot;ak-renderer-extension-overflow-container&quot;&gt;\n&lt;div class=&quot;ak-renderer-wrapper is-undefined css-1jke4yk&quot;&gt;\n&lt;div class=&quot;css-jamgs6&quot;&gt;\n&lt;div class=&quot;ak-renderer-document&quot;&gt;\n&lt;p data-renderer-start-pos=&quot;1&quot;&gt;&lt;strong&gt;Your Role:&lt;/strong&gt;&lt;/p&gt;\n&lt;p data-renderer-start-pos=&quot;1&quot;&gt;&amp;nbsp;&lt;/p&gt;\n&lt;p data-renderer-start-pos=&quot;1&quot;&gt;This role is position is for an experienced trading operations manager with automated trading and middle and back office experience. This includes&lt;/p&gt;\n&lt;ul class=&quot;ak-ul&quot; data-indent-level=&quot;1&quot;&gt;\n&lt;li&gt;\n&lt;p data-renderer-start-pos=&quot;152&quot;&gt;leading our US spot exchange operations (Alpaca Crypto LLC)&lt;/p&gt;\n&lt;/li&gt;\n&lt;li&gt;\n&lt;p data-renderer-start-pos=&quot;215&quot;&gt;leading our Bahamas spot and derivatives exchange operations (AlpacaX Crypto Limited)&lt;/p&gt;\n&lt;/li&gt;\n&lt;li&gt;\n&lt;p data-renderer-start-pos=&quot;304&quot;&gt;building and maintaining our internal trading desk&lt;/p&gt;\n&lt;/li&gt;\n&lt;/ul&gt;\n&lt;/div&gt;\n&lt;/div&gt;\n&lt;/div&gt;\n&lt;p&gt;&amp;nbsp;&lt;/p&gt;\n&lt;/div&gt;\n&lt;/div&gt;\n&lt;div class=&quot;ak-renderer-extension-overflow-container&quot;&gt;\n&lt;div class=&quot;css-jmb8w4&quot;&gt;\n&lt;div class=&quot;ak-renderer-wrapper is-undefined css-1jke4yk&quot;&gt;\n&lt;p&gt;&lt;strong&gt;Things You Get To Do:&amp;nbsp;&lt;/strong&gt;&lt;/p&gt;\n&lt;div&gt;&amp;nbsp;&lt;/div&gt;\n&lt;div class=&quot;css-jamgs6&quot;&gt;\n&lt;div class=&quot;ak-renderer-document&quot;&gt;\n&lt;p data-renderer-start-pos=&quot;1&quot;&gt;You will build and manage a globally distributed team of trade ops associates providing 24/5 service coverage.&lt;/p&gt;\n&lt;p data-renderer-start-pos=&quot;1&quot;&gt;&amp;nbsp;&lt;/p&gt;\n&lt;p data-renderer-start-pos=&quot;113&quot;&gt;You and your team:&lt;/p&gt;\n&lt;ul class=&quot;ak-ul&quot; data-indent-level=&quot;1&quot;&gt;\n&lt;li&gt;\n&lt;p data-renderer-start-pos=&quot;135&quot;&gt;Directly engage with our customers, providing a world-class service&lt;/p&gt;\n&lt;/li&gt;\n&lt;li&gt;\n&lt;p data-renderer-start-pos=&quot;206&quot;&gt;Review, identify and resolve trade differences&lt;/p&gt;\n&lt;/li&gt;\n&lt;li&gt;\n&lt;p data-renderer-start-pos=&quot;256&quot;&gt;Process trade corrections and cancellations&lt;/p&gt;\n&lt;/li&gt;\n&lt;li&gt;\n&lt;p data-renderer-start-pos=&quot;303&quot;&gt;Inventory account reconciliation&lt;/p&gt;\n&lt;/li&gt;\n&lt;li&gt;\n&lt;p data-renderer-start-pos=&quot;339&quot;&gt;Provide input into new procedures and processes as well as revisions to existing operations procedures and processes&lt;/p&gt;\n&lt;/li&gt;\n&lt;li&gt;\n&lt;p data-renderer-start-pos=&quot;459&quot;&gt;Manage our trading desk (internal market maker) and work with engineering to build and monitor trading systems performing automated hedging strategies&lt;/p&gt;\n&lt;/li&gt;\n&lt;li&gt;\n&lt;p data-renderer-start-pos=&quot;613&quot;&gt;Manage our global fiat banking relationships&lt;/p&gt;\n&lt;/li&gt;\n&lt;li&gt;\n&lt;p data-renderer-start-pos=&quot;661&quot;&gt;Maintain relationships with liquidity providers, token projects and all our vendors&lt;/p&gt;\n&lt;/li&gt;\n&lt;li&gt;\n&lt;p data-renderer-start-pos=&quot;748&quot;&gt;Assist with financial and regulatory audits&lt;/p&gt;\n&lt;/li&gt;\n&lt;li&gt;\n&lt;p data-renderer-start-pos=&quot;795&quot;&gt;Work closely with engineering to bring industry-leading crypto products to market&lt;/p&gt;\n&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p data-renderer-start-pos=&quot;880&quot;&gt;&amp;nbsp;&lt;/p&gt;\n&lt;/div&gt;\n&lt;/div&gt;\n&lt;/div&gt;\n&lt;/div&gt;\n&lt;p class=&quot;css-81kdnu&quot;&gt;&lt;strong&gt;Who You Are (Must-Haves):&lt;/strong&gt;&lt;/p&gt;\n&lt;p class=&quot;css-81kdnu&quot;&gt;&amp;nbsp;&lt;/p&gt;\n&lt;/div&gt;\n&lt;div class=&quot;ak-renderer-extension-overflow-container&quot;&gt;\n&lt;div class=&quot;css-jmb8w4&quot;&gt;\n&lt;div class=&quot;ak-renderer-wrapper is-undefined css-1jke4yk&quot;&gt;\n&lt;div class=&quot;css-jamgs6&quot;&gt;\n&lt;div class=&quot;ak-renderer-document&quot;&gt;\n&lt;ul class=&quot;ak-ul&quot; data-indent-level=&quot;1&quot;&gt;\n&lt;li&gt;\n&lt;p data-renderer-start-pos=&quot;3&quot;&gt;Experienced running middle/back office trade operations for a brokerage or crypto exchange&lt;/p&gt;\n&lt;/li&gt;\n&lt;li&gt;\n&lt;p data-renderer-start-pos=&quot;97&quot;&gt;Built and managed a globally distributed customer service focused team providing world-class 24/5 service coverage&lt;/p&gt;\n&lt;/li&gt;\n&lt;li&gt;\n&lt;p data-renderer-start-pos=&quot;215&quot;&gt;Experience trading crypto professionally&lt;/p&gt;\n&lt;/li&gt;\n&lt;li&gt;\n&lt;p data-renderer-start-pos=&quot;259&quot;&gt;Experience in US crypto regulations&lt;/p&gt;\n&lt;/li&gt;\n&lt;/ul&gt;\n&lt;/div&gt;\n&lt;/div&gt;\n&lt;/div&gt;\n&lt;/div&gt;\n&lt;div class=&quot;css-81kdnu&quot;&gt;&amp;nbsp;&lt;/div&gt;\n&lt;/div&gt;\n&lt;p&gt;&lt;strong&gt;Who You Might Be (Nice-To-Haves):&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&amp;nbsp;&lt;/p&gt;\n&lt;ul class=&quot;ak-ul&quot; data-indent-level=&quot;1&quot;&gt;\n&lt;li&gt;\n&lt;p&gt;Quant research or have previously run a trading desk&lt;/p&gt;\n&lt;/li&gt;\n&lt;li&gt;\n&lt;p&gt;Entrepreneurial experience as co-founder / founding team of a startup&lt;/p&gt;\n&lt;/li&gt;\n&lt;li&gt;\n&lt;p&gt;Operated within a SOC 1/2 Type 2 certified environment&lt;/p&gt;\n&lt;/li&gt;\n&lt;/ul&gt;&lt;div class=&quot;content-conclusion&quot;&gt;&lt;h3&gt;&lt;strong&gt;How We Take Care of You:&lt;/strong&gt;&lt;/h3&gt;\n&lt;ul&gt;\n&lt;li style=&quot;font-weight: 400; text-align: justify;&quot;&gt;&lt;span style=&quot;font-weight: 400;&quot;&gt;Competitive Salary &amp;amp; Stock Options&lt;/span&gt;&lt;/li&gt;\n&lt;li style=&quot;font-weight: 400; text-align: justify;&quot;&gt;&lt;span style=&quot;font-weight: 400;&quot;&gt;Benefits: Health benefits start on day 1. In the US this includes Medical, Dental, Vision. In Canada, this includes supplemental health care. In Japan, you are offered local benefits. Internationally, this includes a stipend value to offset medical costs.&amp;nbsp;&amp;nbsp;&amp;nbsp;&lt;/span&gt;&lt;/li&gt;\n&lt;li style=&quot;font-weight: 400; text-align: justify;&quot;&gt;&lt;span style=&quot;font-weight: 400;&quot;&gt;New Hire Home-Office Setup: One-time USD $500&lt;/span&gt;&lt;/li&gt;\n&lt;li style=&quot;font-weight: 400; text-align: justify;&quot;&gt;&lt;span style=&quot;font-weight: 400;&quot;&gt;Monthly Stipend: USD $150 per month via a Brex Card&lt;/span&gt;&lt;/li&gt;\n&lt;li style=&quot;font-weight: 400; text-align: justify;&quot;&gt;&lt;span style=&quot;font-weight: 400;&quot;&gt;Work with awesome hard working people, super smart and cool clients and innovative partners from around the world&lt;/span&gt;&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;&lt;em&gt;&lt;span style=&quot;font-weight: 400;&quot;&gt;Alpaca is proud to be an equal opportunity workplace dedicated to pursuing and hiring a diverse workforce.&lt;br&gt;&lt;/span&gt;&lt;/em&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span style=&quot;font-size: 8pt;&quot;&gt;&lt;a href=&quot;https://files.alpaca.markets/disclosures/AlpacaRecruitmentPrivacyPolicy.pdf&quot;&gt;&lt;em&gt;&lt;span style=&quot;font-weight: 400;&quot;&gt;Recruitment Privacy Policy&lt;/span&gt;&lt;/em&gt;&lt;/a&gt;&lt;/span&gt;&lt;/p&gt;&lt;/div&gt;","tags":"[\"engineering\"]","pubDate":"2025-04-01T16:13:04.000Z","link":"https://job-boards.greenhouse.io/alpaca/jobs/5410731004","slug":"global-director-of-operations-crypto-alpaca-3905"},{"id":3158832614,"title":"Senior Software Engineer - Platform ","company":"Alpaca","image":"https://avatars.githubusercontent.com/u/30398729?s=200&v=4","description":"&lt;div class=&quot;content-intro&quot;&gt;&lt;div class=&quot;c-message_kit__blocks c-message_kit__blocks--rich_text&quot;&gt;\n&lt;div class=&quot;c-message__message_blocks c-message__message_blocks--rich_text&quot; data-qa=&quot;message-text&quot;&gt;\n&lt;div class=&quot;p-block_kit_renderer&quot; data-qa=&quot;block-kit-renderer&quot;&gt;\n&lt;div class=&quot;p-block_kit_renderer__block_wrapper p-block_kit_renderer__block_wrapper--first&quot;&gt;\n&lt;div class=&quot;p-rich_text_block&quot;&gt;\n&lt;p&gt;&lt;strong&gt;Who We Are:&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;Alpaca is a US California headquartered brokerage infrastructure technology company and self-clearing broker-dealer, delivering execution and custody solutions for Stocks, ETFs, Options, Cryptocurrencies, and more, and has raised over $170 million in funding. Amongst our subsidiaries, Alpaca is a licensed financial services company in multiple countries, and we serve hundreds of financial institutions globally such as broker-dealers, investment advisors, hedge funds, and crypto exchanges.&lt;/p&gt;\n&lt;p&gt;Alpaca’s globally distributed team members bring in diverse experiences such as engineers, traders, and brokerage professionals to achieve our Mission of opening financial services to everyone on the planet. We are also deeply committed to open-source contributions and fostering a vibrant community. We will continue to enhance and improve our award-winning developer-friendly API and the infrastructure behind it.&lt;/p&gt;\n&lt;p&gt;&lt;br&gt;&lt;br&gt;&lt;strong&gt;Our Team Members:&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;We’re a team of 150+ globally distributed members who love working from our favorite places worldwide. Our team spans the USA, Canada, Japan, Hungary, Nigeria, Brazil, the United Kingdom, and more!&lt;/p&gt;\n&lt;p&gt;We’re looking for candidates eager to join Alpaca’s growing organization, who are excited about our Mission of “Open financial services to everyone on the planet and share our Values of “Stay Curious,” “Have Empathy,” and “Be Accountable.”&lt;/p&gt;\n&lt;p&gt;&amp;nbsp;&lt;/p&gt;\n&lt;/div&gt;\n&lt;/div&gt;\n&lt;/div&gt;\n&lt;/div&gt;\n&lt;/div&gt;&lt;/div&gt;&lt;p&gt;&lt;strong&gt;Your Role:&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;As a senior software engineer, you will help build and scale the systems and services that form Alpaca&#39;s foundation and empower millions of users who trade billions of dollars worth of assets.&lt;/p&gt;\n&lt;p&gt;The platform team is responsible for improving Alpaca&#39;s overall internal architecture and overseeing the public API’s structure. The team is responsible for building a cohesive developer-first API and tasked with building, ideating, experimenting, and productionize new services, internal tooling and libraries that overcome some of our greatest technical challenges as we continue to scale rapidly,&amp;nbsp;&amp;nbsp;&lt;/p&gt;\n&lt;p&gt;We are looking for senior or staff+ engineers who are keen on providing quality solutions, have great fundamentals, have proven experience building and architecting at scale, and are not afraid of challenging conventions. This demanding team also requires a deep understanding of POSIX, such as operating systems, modern infrastructure, and orchestration practices.&lt;br&gt;&lt;br&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Things You Get To Do:&lt;/strong&gt;&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;Influence the overall architecture of Alpaca’s systems&lt;/li&gt;\n&lt;li&gt;Design a highly scalable, mission-critical brokerage system.&lt;/li&gt;\n&lt;li&gt;Obsess over latency (every nanosecond counts)&lt;/li&gt;\n&lt;li&gt;Implement backend services and lead architecture where scalability and resilience matter.&lt;/li&gt;\n&lt;li&gt;Maintain good software quality and test coverage&lt;/li&gt;\n&lt;li&gt;Participate in code reviews&lt;/li&gt;\n&lt;li&gt;Troubleshooting on incidents and reported bugs&lt;/li&gt;\n&lt;li&gt;You may be asked to be on-call to assist with engineering projects that are timely in nature&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;&amp;nbsp;&lt;strong&gt;Who You Are (Must-Haves):&lt;/strong&gt;&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;At least 4 years of experience working on systems at scale&lt;/li&gt;\n&lt;li&gt;Experience with at least compiled imperative languages (ex: Go, C, C++, Rust, Zig) or functional languages (Haskell, Clojure, Erlang, Elixir, Scala). Most of our critical services are written in Go&lt;/li&gt;\n&lt;li&gt;SQL or relational database skills&lt;/li&gt;\n&lt;li&gt;Familiarity with message brokers and message queues&lt;/li&gt;\n&lt;li&gt;Proficient with Linux/BSD, shell scripting.&amp;nbsp;&lt;/li&gt;\n&lt;li&gt;Excited about what we are building at Alpaca&lt;/li&gt;\n&lt;li&gt;Proven track record of architecting and leading medium-scale projects involving multiple teams&lt;/li&gt;\n&lt;li&gt;Experience with Kubernetes or other workload orchestration and scheduling systems (we primarily use Kubernetes via GKE)&lt;/li&gt;\n&lt;li&gt;Experience with major cloud platforms (we primarily use GCP)&lt;/li&gt;\n&lt;li&gt;A passion for financial markets&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;&lt;strong&gt;Who You Might Be&lt;/strong&gt; (&lt;strong&gt;Nice-to-Haves):&amp;nbsp;&amp;nbsp;&lt;/strong&gt;&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;Knowledge of microservice architectures&lt;/li&gt;\n&lt;li&gt;Knowledge of clean code principles&lt;/li&gt;\n&lt;li&gt;DevOps mindset is an asset&lt;/li&gt;\n&lt;li&gt;Networking experience (BGP, VPC peering, TCP/UDP)&lt;/li&gt;\n&lt;li&gt;Experience with distributed Key Value stores&lt;/li&gt;\n&lt;li&gt;Experience with CI/CD&lt;/li&gt;\n&lt;li&gt;A passion for financial markets or the desire to learn&lt;/li&gt;\n&lt;li&gt;Knowledge of Agile/Scrum methodologies&lt;/li&gt;\n&lt;li&gt;Experience with observability, tracing, continuous profiling&lt;/li&gt;\n&lt;li&gt;Experience with capacity planning and benchmarking&lt;/li&gt;\n&lt;li&gt;Knowledge of eBPF&amp;nbsp;&lt;/li&gt;\n&lt;/ul&gt;&lt;div class=&quot;content-conclusion&quot;&gt;&lt;h3&gt;&lt;strong&gt;How We Take Care of You:&lt;/strong&gt;&lt;/h3&gt;\n&lt;ul&gt;\n&lt;li style=&quot;font-weight: 400; text-align: justify;&quot;&gt;&lt;span style=&quot;font-weight: 400;&quot;&gt;Competitive Salary &amp;amp; Stock Options&lt;/span&gt;&lt;/li&gt;\n&lt;li style=&quot;font-weight: 400; text-align: justify;&quot;&gt;&lt;span style=&quot;font-weight: 400;&quot;&gt;Benefits: Health benefits start on day 1. In the US this includes Medical, Dental, Vision. In Canada, this includes supplemental health care. In Japan, you are offered local benefits. Internationally, this includes a stipend value to offset medical costs.&amp;nbsp;&amp;nbsp;&amp;nbsp;&lt;/span&gt;&lt;/li&gt;\n&lt;li style=&quot;font-weight: 400; text-align: justify;&quot;&gt;&lt;span style=&quot;font-weight: 400;&quot;&gt;New Hire Home-Office Setup: One-time USD $500&lt;/span&gt;&lt;/li&gt;\n&lt;li style=&quot;font-weight: 400; text-align: justify;&quot;&gt;&lt;span style=&quot;font-weight: 400;&quot;&gt;Monthly Stipend: USD $150 per month via a Brex Card&lt;/span&gt;&lt;/li&gt;\n&lt;li style=&quot;font-weight: 400; text-align: justify;&quot;&gt;&lt;span style=&quot;font-weight: 400;&quot;&gt;Work with awesome hard working people, super smart and cool clients and innovative partners from around the world&lt;/span&gt;&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;&lt;em&gt;&lt;span style=&quot;font-weight: 400;&quot;&gt;Alpaca is proud to be an equal opportunity workplace dedicated to pursuing and hiring a diverse workforce.&lt;br&gt;&lt;/span&gt;&lt;/em&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span style=&quot;font-size: 8pt;&quot;&gt;&lt;a href=&quot;https://files.alpaca.markets/disclosures/AlpacaRecruitmentPrivacyPolicy.pdf&quot;&gt;&lt;em&gt;&lt;span style=&quot;font-weight: 400;&quot;&gt;Recruitment Privacy Policy&lt;/span&gt;&lt;/em&gt;&lt;/a&gt;&lt;/span&gt;&lt;/p&gt;&lt;/div&gt;","tags":"[\"elixir\",\"engineering\",\"database\"]","pubDate":"2025-04-01T16:13:04.000Z","link":"https://job-boards.greenhouse.io/alpaca/jobs/5389091004","slug":"senior-software-engineer-platform-alpaca-9371"},{"id":9930804558,"title":"Tax & Treasury Manager","company":"Alpaca","image":"https://avatars.githubusercontent.com/u/30398729?s=200&v=4","description":"&lt;div class=&quot;content-intro&quot;&gt;&lt;div class=&quot;c-message_kit__blocks c-message_kit__blocks--rich_text&quot;&gt;\n&lt;div class=&quot;c-message__message_blocks c-message__message_blocks--rich_text&quot; data-qa=&quot;message-text&quot;&gt;\n&lt;div class=&quot;p-block_kit_renderer&quot; data-qa=&quot;block-kit-renderer&quot;&gt;\n&lt;div class=&quot;p-block_kit_renderer__block_wrapper p-block_kit_renderer__block_wrapper--first&quot;&gt;\n&lt;div class=&quot;p-rich_text_block&quot;&gt;\n&lt;p&gt;&lt;strong&gt;Who We Are:&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;Alpaca is a US California headquartered brokerage infrastructure technology company and self-clearing broker-dealer, delivering execution and custody solutions for Stocks, ETFs, Options, Cryptocurrencies, and more, and has raised over $170 million in funding. Amongst our subsidiaries, Alpaca is a licensed financial services company in multiple countries, and we serve hundreds of financial institutions globally such as broker-dealers, investment advisors, hedge funds, and crypto exchanges.&lt;/p&gt;\n&lt;p&gt;Alpaca’s globally distributed team members bring in diverse experiences such as engineers, traders, and brokerage professionals to achieve our Mission of opening financial services to everyone on the planet. We are also deeply committed to open-source contributions and fostering a vibrant community. We will continue to enhance and improve our award-winning developer-friendly API and the infrastructure behind it.&lt;/p&gt;\n&lt;p&gt;&lt;br&gt;&lt;br&gt;&lt;strong&gt;Our Team Members:&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;We’re a team of 150+ globally distributed members who love working from our favorite places worldwide. Our team spans the USA, Canada, Japan, Hungary, Nigeria, Brazil, the United Kingdom, and more!&lt;/p&gt;\n&lt;p&gt;We’re looking for candidates eager to join Alpaca’s growing organization, who are excited about our Mission of “Open financial services to everyone on the planet and share our Values of “Stay Curious,” “Have Empathy,” and “Be Accountable.”&lt;/p&gt;\n&lt;p&gt;&amp;nbsp;&lt;/p&gt;\n&lt;/div&gt;\n&lt;/div&gt;\n&lt;/div&gt;\n&lt;/div&gt;\n&lt;/div&gt;&lt;/div&gt;&lt;h3&gt;Your Role:&lt;/h3&gt;\n&lt;p&gt;We are looking for an experienced Tax and Treasury Manager to join our finance team. This role will oversee both tax and treasury functions for our multi-state and global operations, ensuring compliance with all regulatory requirements and optimizing cash flow and liquidity management. The Tax and Treasury Manager will be responsible for developing tax and treasury strategies, managing tax audits, handling cash flow forecasting, and supporting business expansion initiatives. This is a unique opportunity for a professional eager to impact a high-growth, dynamic environment.&lt;/p&gt;\n&lt;h3&gt;Things You Get To Do:&lt;/h3&gt;\n&lt;ol class=&quot;ak-ol&quot; data-indent-level=&quot;1&quot;&gt;\n&lt;li&gt;\n&lt;p data-renderer-start-pos=&quot;3&quot;&gt;&lt;strong data-renderer-mark=&quot;true&quot;&gt;Tax Compliance and Reporting&lt;/strong&gt;&lt;/p&gt;\n&lt;ul class=&quot;ak-ul&quot; data-indent-level=&quot;2&quot;&gt;\n&lt;li&gt;\n&lt;p data-renderer-start-pos=&quot;35&quot;&gt;Manage the preparation and filing of federal, state, local, and international tax returns, ensuring accuracy, compliance, and timely submissions.&lt;/p&gt;\n&lt;/li&gt;\n&lt;li&gt;\n&lt;p data-renderer-start-pos=&quot;184&quot;&gt;Oversee multi-state and international tax compliance processes, ensuring adherence to relevant regulations and minimizing risk.&lt;/p&gt;\n&lt;/li&gt;\n&lt;li&gt;\n&lt;p data-renderer-start-pos=&quot;315&quot;&gt;Develop, implement, and maintain tax policies and procedures aligned with company goals and compliance requirements.&lt;/p&gt;\n&lt;/li&gt;\n&lt;/ul&gt;\n&lt;/li&gt;\n&lt;li&gt;\n&lt;p data-renderer-start-pos=&quot;437&quot;&gt;&lt;strong data-renderer-mark=&quot;true&quot;&gt;Tax Accounting and Financial Reporting&lt;/strong&gt;&lt;/p&gt;\n&lt;ul class=&quot;ak-ul&quot; data-indent-level=&quot;2&quot;&gt;\n&lt;li&gt;\n&lt;p data-renderer-start-pos=&quot;479&quot;&gt;Lead the tax provision process for financial statements in accordance with US GAAP (including ASC 740).&lt;/p&gt;\n&lt;/li&gt;\n&lt;li&gt;\n&lt;p data-renderer-start-pos=&quot;586&quot;&gt;Ensure accurate tax accruals, reconciliations, and tax-related disclosures in collaboration with the financial reporting team.&lt;/p&gt;\n&lt;/li&gt;\n&lt;li&gt;\n&lt;p data-renderer-start-pos=&quot;716&quot;&gt;Support month-end and year-end close processes, ensuring that tax provisions and related journal entries are accurately reflected.&lt;/p&gt;\n&lt;/li&gt;\n&lt;/ul&gt;\n&lt;/li&gt;\n&lt;li&gt;\n&lt;p data-renderer-start-pos=&quot;852&quot;&gt;&lt;strong data-renderer-mark=&quot;true&quot;&gt;Treasury Operations&lt;/strong&gt;&lt;/p&gt;\n&lt;ul class=&quot;ak-ul&quot; data-indent-level=&quot;2&quot;&gt;\n&lt;li&gt;\n&lt;p data-renderer-start-pos=&quot;875&quot;&gt;Manage daily treasury operations, including cash flow monitoring, liquidity planning, and forecasting to support business needs and operational strategies.&lt;/p&gt;\n&lt;/li&gt;\n&lt;li&gt;\n&lt;p data-renderer-start-pos=&quot;1034&quot;&gt;Optimize the company’s cash management, ensuring funds are efficiently utilized across global operations.&lt;/p&gt;\n&lt;/li&gt;\n&lt;li&gt;\n&lt;p data-renderer-start-pos=&quot;1143&quot;&gt;Develop and implement effective cash flow strategies, banking relationships, and funding requirements to meet the company’s working capital and growth objectives.&lt;/p&gt;\n&lt;/li&gt;\n&lt;/ul&gt;\n&lt;/li&gt;\n&lt;li&gt;\n&lt;p data-renderer-start-pos=&quot;1311&quot;&gt;&lt;strong data-renderer-mark=&quot;true&quot;&gt;Risk Management and Compliance&lt;/strong&gt;&lt;/p&gt;\n&lt;ul class=&quot;ak-ul&quot; data-indent-level=&quot;2&quot;&gt;\n&lt;li&gt;\n&lt;p data-renderer-start-pos=&quot;1345&quot;&gt;Establish and monitor compliance with tax and treasury-related policies and internal controls.&lt;/p&gt;\n&lt;/li&gt;\n&lt;li&gt;\n&lt;p data-renderer-start-pos=&quot;1443&quot;&gt;Lead tax and treasury audits, managing inquiries from tax authorities and external auditors.&lt;/p&gt;\n&lt;/li&gt;\n&lt;li&gt;\n&lt;p data-renderer-start-pos=&quot;1539&quot;&gt;Assess and mitigate financial risks associated with currency, interest rates, and liquidity through effective strategies and practices.&lt;/p&gt;\n&lt;/li&gt;\n&lt;/ul&gt;\n&lt;/li&gt;\n&lt;li&gt;\n&lt;p data-renderer-start-pos=&quot;1680&quot;&gt;&lt;strong data-renderer-mark=&quot;true&quot;&gt;Strategic Tax and Treasury Planning&lt;/strong&gt;&lt;/p&gt;\n&lt;ul class=&quot;ak-ul&quot; data-indent-level=&quot;2&quot;&gt;\n&lt;li&gt;\n&lt;p data-renderer-start-pos=&quot;1719&quot;&gt;Develop and execute tax and treasury strategies that support the company’s growth initiatives, including assessing tax implications of new business activities and optimizing capital structure.&lt;/p&gt;\n&lt;/li&gt;\n&lt;li&gt;\n&lt;p data-renderer-start-pos=&quot;1915&quot;&gt;Provide guidance on tax and treasury implications for transactions, including mergers and acquisitions, market expansions, and capital investments.&lt;/p&gt;\n&lt;/li&gt;\n&lt;li&gt;\n&lt;p data-renderer-start-pos=&quot;2066&quot;&gt;Monitor regulatory changes impacting tax and treasury, assess their impact, and update strategies as needed.&lt;/p&gt;\n&lt;/li&gt;\n&lt;/ul&gt;\n&lt;/li&gt;\n&lt;li&gt;\n&lt;p data-renderer-start-pos=&quot;2180&quot;&gt;&lt;strong data-renderer-mark=&quot;true&quot;&gt;Cross-Functional Collaboration&lt;/strong&gt;&lt;/p&gt;\n&lt;ul class=&quot;ak-ul&quot; data-indent-level=&quot;2&quot;&gt;\n&lt;li&gt;\n&lt;p data-renderer-start-pos=&quot;2214&quot;&gt;Collaborate with teams across the organization, including Legal, Compliance, and Operations, to ensure awareness and alignment on tax and treasury-related issues.&lt;/p&gt;\n&lt;/li&gt;\n&lt;li&gt;\n&lt;p data-renderer-start-pos=&quot;2380&quot;&gt;Educate and support non-finance teams on tax and treasury topics to foster a company-wide understanding of these critical functions.&lt;/p&gt;\n&lt;/li&gt;\n&lt;/ul&gt;\n&lt;/li&gt;\n&lt;li&gt;\n&lt;p data-renderer-start-pos=&quot;2518&quot;&gt;&lt;strong data-renderer-mark=&quot;true&quot;&gt;Team Development&lt;/strong&gt;&lt;/p&gt;\n&lt;ul class=&quot;ak-ul&quot; data-indent-level=&quot;2&quot;&gt;\n&lt;li&gt;\n&lt;p data-renderer-start-pos=&quot;2538&quot;&gt;Mentor and manage a team of tax and treasury professionals, providing guidance, training, and development to foster a high-performing team.&lt;/p&gt;\n&lt;/li&gt;\n&lt;/ul&gt;\n&lt;/li&gt;\n&lt;/ol&gt;\n&lt;h3 class=&quot;css-6c91b6&quot;&gt;&lt;/h3&gt;\n&lt;div class=&quot;css-14f9zk1&quot;&gt;\n&lt;div class=&quot;ak-renderer-wrapper is-undefined css-pw7jst&quot;&gt;\n&lt;div class=&quot;css-16ujawv&quot;&gt;\n&lt;div class=&quot;ak-renderer-document&quot;&gt;\n&lt;ul class=&quot;ak-ul&quot; data-indent-level=&quot;1&quot;&gt;\n&lt;li&gt;\n&lt;p data-renderer-start-pos=&quot;3&quot;&gt;Bachelor’s degree in Accounting, Finance, or a related field; CPA, CFA, or Master’s in Taxation or Finance preferred.&lt;/p&gt;\n&lt;/li&gt;\n&lt;li&gt;\n&lt;p data-renderer-start-pos=&quot;3&quot;&gt;7+ years of progressive experience in tax, treasury, or financial management, preferably within FinTech, technology, or financial services sectors.&lt;/p&gt;\n&lt;/li&gt;\n&lt;li&gt;\n&lt;p data-renderer-start-pos=&quot;275&quot;&gt;Comprehensive knowledge of US federal, state, and international tax regulations, GAAP/ASC 740, and treasury practices.&lt;/p&gt;\n&lt;/li&gt;\n&lt;li&gt;\n&lt;p data-renderer-start-pos=&quot;397&quot;&gt;Proven experience managing tax audits, interacting with tax authorities, and overseeing treasury functions.&lt;/p&gt;\n&lt;/li&gt;\n&lt;li&gt;\n&lt;p data-renderer-start-pos=&quot;508&quot;&gt;Strong analytical skills, with the ability to translate complex tax and treasury issues into practical solutions.&lt;/p&gt;\n&lt;/li&gt;\n&lt;li&gt;\n&lt;p data-renderer-start-pos=&quot;625&quot;&gt;Advanced project management abilities, with experience handling multiple projects and deadlines.&lt;/p&gt;\n&lt;/li&gt;\n&lt;li&gt;\n&lt;p data-renderer-start-pos=&quot;725&quot;&gt;Proficiency in tax and accounting software, treasury management systems, and advanced Excel skills.&lt;/p&gt;\n&lt;/li&gt;\n&lt;li&gt;\n&lt;p data-renderer-start-pos=&quot;828&quot;&gt;Excellent communication skills, with a collaborative approach to working with cross-functional teams.&lt;/p&gt;\n&lt;/li&gt;\n&lt;/ul&gt;\n&lt;/div&gt;\n&lt;/div&gt;\n&lt;/div&gt;\n&lt;/div&gt;&lt;div class=&quot;content-conclusion&quot;&gt;&lt;h3&gt;&lt;strong&gt;How We Take Care of You:&lt;/strong&gt;&lt;/h3&gt;\n&lt;ul&gt;\n&lt;li style=&quot;font-weight: 400; text-align: justify;&quot;&gt;&lt;span style=&quot;font-weight: 400;&quot;&gt;Competitive Salary &amp;amp; Stock Options&lt;/span&gt;&lt;/li&gt;\n&lt;li style=&quot;font-weight: 400; text-align: justify;&quot;&gt;&lt;span style=&quot;font-weight: 400;&quot;&gt;Benefits: Health benefits start on day 1. In the US this includes Medical, Dental, Vision. In Canada, this includes supplemental health care. In Japan, you are offered local benefits. Internationally, this includes a stipend value to offset medical costs.&amp;nbsp;&amp;nbsp;&amp;nbsp;&lt;/span&gt;&lt;/li&gt;\n&lt;li style=&quot;font-weight: 400; text-align: justify;&quot;&gt;&lt;span style=&quot;font-weight: 400;&quot;&gt;New Hire Home-Office Setup: One-time USD $500&lt;/span&gt;&lt;/li&gt;\n&lt;li style=&quot;font-weight: 400; text-align: justify;&quot;&gt;&lt;span style=&quot;font-weight: 400;&quot;&gt;Monthly Stipend: USD $150 per month via a Brex Card&lt;/span&gt;&lt;/li&gt;\n&lt;li style=&quot;font-weight: 400; text-align: justify;&quot;&gt;&lt;span style=&quot;font-weight: 400;&quot;&gt;Work with awesome hard working people, super smart and cool clients and innovative partners from around the world&lt;/span&gt;&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;&lt;em&gt;&lt;span style=&quot;font-weight: 400;&quot;&gt;Alpaca is proud to be an equal opportunity workplace dedicated to pursuing and hiring a diverse workforce.&lt;br&gt;&lt;/span&gt;&lt;/em&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span style=&quot;font-size: 8pt;&quot;&gt;&lt;a href=&quot;https://files.alpaca.markets/disclosures/AlpacaRecruitmentPrivacyPolicy.pdf&quot;&gt;&lt;em&gt;&lt;span style=&quot;font-weight: 400;&quot;&gt;Recruitment Privacy Policy&lt;/span&gt;&lt;/em&gt;&lt;/a&gt;&lt;/span&gt;&lt;/p&gt;&lt;/div&gt;","tags":"[\"finance\",\"management\",\"legal\"]","pubDate":"2025-04-01T16:13:04.000Z","link":"https://job-boards.greenhouse.io/alpaca/jobs/5393065004","slug":"tax-treasury-manager-alpaca-7395"},{"id":7500915032,"title":"Trading Operations Senior Associate","company":"Alpaca","image":"https://avatars.githubusercontent.com/u/30398729?s=200&v=4","description":"&lt;div class=&quot;content-intro&quot;&gt;&lt;div class=&quot;c-message_kit__blocks c-message_kit__blocks--rich_text&quot;&gt;\n&lt;div class=&quot;c-message__message_blocks c-message__message_blocks--rich_text&quot; data-qa=&quot;message-text&quot;&gt;\n&lt;div class=&quot;p-block_kit_renderer&quot; data-qa=&quot;block-kit-renderer&quot;&gt;\n&lt;div class=&quot;p-block_kit_renderer__block_wrapper p-block_kit_renderer__block_wrapper--first&quot;&gt;\n&lt;div class=&quot;p-rich_text_block&quot;&gt;\n&lt;p&gt;&lt;strong&gt;Who We Are:&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;Alpaca is a US California headquartered brokerage infrastructure technology company and self-clearing broker-dealer, delivering execution and custody solutions for Stocks, ETFs, Options, Cryptocurrencies, and more, and has raised over $170 million in funding. Amongst our subsidiaries, Alpaca is a licensed financial services company in multiple countries, and we serve hundreds of financial institutions globally such as broker-dealers, investment advisors, hedge funds, and crypto exchanges.&lt;/p&gt;\n&lt;p&gt;Alpaca’s globally distributed team members bring in diverse experiences such as engineers, traders, and brokerage professionals to achieve our Mission of opening financial services to everyone on the planet. We are also deeply committed to open-source contributions and fostering a vibrant community. We will continue to enhance and improve our award-winning developer-friendly API and the infrastructure behind it.&lt;/p&gt;\n&lt;p&gt;&lt;br&gt;&lt;br&gt;&lt;strong&gt;Our Team Members:&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;We’re a team of 150+ globally distributed members who love working from our favorite places worldwide. Our team spans the USA, Canada, Japan, Hungary, Nigeria, Brazil, the United Kingdom, and more!&lt;/p&gt;\n&lt;p&gt;We’re looking for candidates eager to join Alpaca’s growing organization, who are excited about our Mission of “Open financial services to everyone on the planet and share our Values of “Stay Curious,” “Have Empathy,” and “Be Accountable.”&lt;/p&gt;\n&lt;p&gt;&amp;nbsp;&lt;/p&gt;\n&lt;/div&gt;\n&lt;/div&gt;\n&lt;/div&gt;\n&lt;/div&gt;\n&lt;/div&gt;&lt;/div&gt;&lt;div class=&quot;ak-renderer-extension  &quot; data-layout=&quot;default&quot;&gt;\n&lt;div class=&quot;ak-renderer-extension-overflow-container&quot;&gt;\n&lt;div class=&quot;css-k008qs&quot;&gt;&lt;strong&gt;&lt;/strong&gt;&lt;/div&gt;\n&lt;div class=&quot;css-jmb8w4&quot;&gt;\n&lt;div class=&quot;ak-renderer-wrapper is-undefined css-1jke4yk&quot;&gt;\n&lt;div&gt;&amp;nbsp;&lt;/div&gt;\n&lt;div class=&quot;css-jamgs6&quot;&gt;\n&lt;div class=&quot;ak-renderer-document&quot;&gt;\n&lt;p data-renderer-start-pos=&quot;1&quot;&gt;As a senior trading associate you will be responsible for managing the day-to-day operations of the Equity and Options Trading Operations team. This includes building scalable infrastructure and procedures and nurturing/supporting a strong work ethic from yourself and others in-line with Alpaca’s core values of Curiosity, Global Empathy, and Accountability.&lt;/p&gt;\n&lt;/div&gt;\n&lt;/div&gt;\n&lt;/div&gt;\n&lt;/div&gt;\n&lt;div class=&quot;css-81kdnu&quot;&gt;&amp;nbsp;&lt;/div&gt;\n&lt;/div&gt;\n&lt;/div&gt;\n&lt;div class=&quot;ak-renderer-extension  &quot; data-layout=&quot;default&quot;&gt;\n&lt;div class=&quot;ak-renderer-extension-overflow-container&quot;&gt;\n&lt;div class=&quot;css-k008qs&quot;&gt;&lt;strong&gt;&lt;/strong&gt;&lt;/div&gt;\n&lt;div class=&quot;css-jmb8w4&quot;&gt;\n&lt;div class=&quot;ak-renderer-wrapper is-undefined css-1jke4yk&quot;&gt;\n&lt;div&gt;&amp;nbsp;&lt;/div&gt;\n&lt;div class=&quot;css-jamgs6&quot;&gt;\n&lt;div class=&quot;ak-renderer-document&quot;&gt;\n&lt;ul class=&quot;ak-ul&quot; data-indent-level=&quot;1&quot;&gt;\n&lt;li&gt;\n&lt;p data-renderer-start-pos=&quot;3&quot;&gt;Create and improve upon a world class execution platform&lt;/p&gt;\n&lt;/li&gt;\n&lt;li&gt;\n&lt;p data-renderer-start-pos=&quot;63&quot;&gt;Assist in the Firm’s Best-Execution Program by reviewing post-trade exception reports.&amp;nbsp;&amp;nbsp;&lt;/p&gt;\n&lt;/li&gt;\n&lt;li&gt;\n&lt;p data-renderer-start-pos=&quot;155&quot;&gt;Review Trade Surveillance reports and take appropriate action to resolve alerts&amp;nbsp;&lt;/p&gt;\n&lt;/li&gt;\n&lt;li&gt;\n&lt;p data-renderer-start-pos=&quot;239&quot;&gt;Monitor order flow for irregularities&amp;nbsp;&lt;/p&gt;\n&lt;/li&gt;\n&lt;li&gt;\n&lt;p data-renderer-start-pos=&quot;281&quot;&gt;Timely resolution of client trade escalations&lt;/p&gt;\n&lt;/li&gt;\n&lt;li&gt;\n&lt;p data-renderer-start-pos=&quot;330&quot;&gt;Create/update policies and procedures as needed&lt;/p&gt;\n&lt;/li&gt;\n&lt;li&gt;\n&lt;p data-renderer-start-pos=&quot;381&quot;&gt;Reconciliation of firm error and inventory accounts&lt;/p&gt;\n&lt;/li&gt;\n&lt;li&gt;\n&lt;p data-renderer-start-pos=&quot;436&quot;&gt;Risk monitoring/trading of firm held positions&lt;/p&gt;\n&lt;/li&gt;\n&lt;li&gt;\n&lt;p data-renderer-start-pos=&quot;486&quot;&gt;Maintain firm GTC order book&lt;/p&gt;\n&lt;/li&gt;\n&lt;li&gt;\n&lt;p data-renderer-start-pos=&quot;518&quot;&gt;Create and drive new initiatives&lt;/p&gt;\n&lt;/li&gt;\n&lt;li&gt;\n&lt;p data-renderer-start-pos=&quot;554&quot;&gt;Assist the Director of Trading Operations in the execution of firm objective&lt;/p&gt;\n&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p data-renderer-start-pos=&quot;634&quot;&gt;Ad Hoc duties and responsibilities as assigned&lt;/p&gt;\n&lt;/div&gt;\n&lt;/div&gt;\n&lt;/div&gt;\n&lt;/div&gt;\n&lt;div class=&quot;css-81kdnu&quot;&gt;&amp;nbsp;&lt;/div&gt;\n&lt;/div&gt;\n&lt;/div&gt;\n&lt;div class=&quot;ak-renderer-extension  &quot; data-layout=&quot;default&quot;&gt;\n&lt;div class=&quot;ak-renderer-extension-overflow-container&quot;&gt;\n&lt;div class=&quot;css-k008qs&quot;&gt;&lt;strong&gt;&lt;/strong&gt;&lt;/div&gt;\n&lt;div class=&quot;css-jmb8w4&quot;&gt;\n&lt;div class=&quot;ak-renderer-wrapper is-undefined css-1jke4yk&quot;&gt;\n&lt;div&gt;&amp;nbsp;&lt;/div&gt;\n&lt;div class=&quot;css-jamgs6&quot;&gt;\n&lt;div class=&quot;ak-renderer-document&quot;&gt;\n&lt;ul class=&quot;ak-ul&quot; data-indent-level=&quot;1&quot;&gt;\n&lt;li&gt;\n&lt;p data-renderer-start-pos=&quot;3&quot;&gt;FINRA Licences:&lt;/p&gt;\n&lt;ul class=&quot;ak-ul&quot; data-indent-level=&quot;2&quot;&gt;\n&lt;li&gt;\n&lt;p data-renderer-start-pos=&quot;22&quot;&gt;Series 7&lt;/p&gt;\n&lt;/li&gt;\n&lt;li&gt;\n&lt;p data-renderer-start-pos=&quot;34&quot;&gt;Series 57&lt;/p&gt;\n&lt;/li&gt;\n&lt;li&gt;\n&lt;p data-renderer-start-pos=&quot;47&quot;&gt;Series 24&lt;/p&gt;\n&lt;/li&gt;\n&lt;li&gt;\n&lt;p data-renderer-start-pos=&quot;60&quot;&gt;Series 63&lt;/p&gt;\n&lt;/li&gt;\n&lt;li&gt;\n&lt;p data-renderer-start-pos=&quot;73&quot;&gt;Series 4 (able to get in 6 months)&lt;/p&gt;\n&lt;/li&gt;\n&lt;/ul&gt;\n&lt;/li&gt;\n&lt;li&gt;\n&lt;p data-renderer-start-pos=&quot;113&quot;&gt;Experience with both front and back end processes for trading lifecycle (Equity and Options)&lt;/p&gt;\n&lt;/li&gt;\n&lt;li&gt;\n&lt;p data-renderer-start-pos=&quot;209&quot;&gt;Experience in SQL (willingness to learn)&lt;/p&gt;\n&lt;/li&gt;\n&lt;li&gt;\n&lt;p data-renderer-start-pos=&quot;253&quot;&gt;Experience creating and maintaining relationships with executing counterparties&amp;nbsp;&lt;/p&gt;\n&lt;/li&gt;\n&lt;li&gt;\n&lt;p data-renderer-start-pos=&quot;337&quot;&gt;Experience with order quality evaluations including execution and market manipulation testing&lt;/p&gt;\n&lt;/li&gt;\n&lt;li&gt;\n&lt;p data-renderer-start-pos=&quot;434&quot;&gt;A leader that has a track record of successful team building and creating growth opportunities for their team members&lt;/p&gt;\n&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p data-renderer-start-pos=&quot;555&quot;&gt;&amp;nbsp;&lt;/p&gt;\n&lt;/div&gt;\n&lt;/div&gt;\n&lt;/div&gt;\n&lt;/div&gt;\n&lt;div class=&quot;css-81kdnu&quot;&gt;&amp;nbsp;&lt;/div&gt;\n&lt;/div&gt;\n&lt;/div&gt;\n&lt;div class=&quot;ak-renderer-extension  &quot; data-layout=&quot;default&quot;&gt;\n&lt;div class=&quot;ak-renderer-extension-overflow-container&quot;&gt;\n&lt;div class=&quot;css-k008qs&quot;&gt;&lt;/div&gt;\n&lt;div class=&quot;css-jmb8w4&quot;&gt;\n&lt;div class=&quot;ak-renderer-wrapper is-undefined css-1jke4yk&quot;&gt;\n&lt;div&gt;&amp;nbsp;&lt;/div&gt;\n&lt;div class=&quot;css-jamgs6&quot;&gt;\n&lt;div class=&quot;ak-renderer-document&quot;&gt;\n&lt;ul class=&quot;ak-ul&quot; data-indent-level=&quot;1&quot;&gt;\n&lt;li&gt;\n&lt;p data-renderer-start-pos=&quot;3&quot;&gt;Prior experience with Financial or FINTech startups&amp;nbsp;&lt;/p&gt;\n&lt;/li&gt;\n&lt;li&gt;\n&lt;p data-renderer-start-pos=&quot;59&quot;&gt;Prior experience working with international clients&lt;/p&gt;\n&lt;/li&gt;\n&lt;/ul&gt;\n&lt;/div&gt;\n&lt;/div&gt;\n&lt;/div&gt;\n&lt;/div&gt;\n&lt;/div&gt;\n&lt;/div&gt;&lt;div class=&quot;content-conclusion&quot;&gt;&lt;h3&gt;&lt;strong&gt;How We Take Care of You:&lt;/strong&gt;&lt;/h3&gt;\n&lt;ul&gt;\n&lt;li style=&quot;font-weight: 400; text-align: justify;&quot;&gt;&lt;span style=&quot;font-weight: 400;&quot;&gt;Competitive Salary &amp;amp; Stock Options&lt;/span&gt;&lt;/li&gt;\n&lt;li style=&quot;font-weight: 400; text-align: justify;&quot;&gt;&lt;span style=&quot;font-weight: 400;&quot;&gt;Benefits: Health benefits start on day 1. In the US this includes Medical, Dental, Vision. In Canada, this includes supplemental health care. In Japan, you are offered local benefits. Internationally, this includes a stipend value to offset medical costs.&amp;nbsp;&amp;nbsp;&amp;nbsp;&lt;/span&gt;&lt;/li&gt;\n&lt;li style=&quot;font-weight: 400; text-align: justify;&quot;&gt;&lt;span style=&quot;font-weight: 400;&quot;&gt;New Hire Home-Office Setup: One-time USD $500&lt;/span&gt;&lt;/li&gt;\n&lt;li style=&quot;font-weight: 400; text-align: justify;&quot;&gt;&lt;span style=&quot;font-weight: 400;&quot;&gt;Monthly Stipend: USD $150 per month via a Brex Card&lt;/span&gt;&lt;/li&gt;\n&lt;li style=&quot;font-weight: 400; text-align: justify;&quot;&gt;&lt;span style=&quot;font-weight: 400;&quot;&gt;Work with awesome hard working people, super smart and cool clients and innovative partners from around the world&lt;/span&gt;&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;&lt;em&gt;&lt;span style=&quot;font-weight: 400;&quot;&gt;Alpaca is proud to be an equal opportunity workplace dedicated to pursuing and hiring a diverse workforce.&lt;br&gt;&lt;/span&gt;&lt;/em&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span style=&quot;font-size: 8pt;&quot;&gt;&lt;a href=&quot;https://files.alpaca.markets/disclosures/AlpacaRecruitmentPrivacyPolicy.pdf&quot;&gt;&lt;em&gt;&lt;span style=&quot;font-weight: 400;&quot;&gt;Recruitment Privacy Policy&lt;/span&gt;&lt;/em&gt;&lt;/a&gt;&lt;/span&gt;&lt;/p&gt;&lt;/div&gt;","tags":"[]","pubDate":"2025-04-01T16:13:04.000Z","link":"https://job-boards.greenhouse.io/alpaca/jobs/5426213004","slug":"trading-operations-senior-associate-alpaca-3408"},{"id":3971115896,"title":"Trading Services Specialist ","company":"Alpaca","image":"https://avatars.githubusercontent.com/u/30398729?s=200&v=4","description":"&lt;div class=&quot;content-intro&quot;&gt;&lt;div class=&quot;c-message_kit__blocks c-message_kit__blocks--rich_text&quot;&gt;\n&lt;div class=&quot;c-message__message_blocks c-message__message_blocks--rich_text&quot; data-qa=&quot;message-text&quot;&gt;\n&lt;div class=&quot;p-block_kit_renderer&quot; data-qa=&quot;block-kit-renderer&quot;&gt;\n&lt;div class=&quot;p-block_kit_renderer__block_wrapper p-block_kit_renderer__block_wrapper--first&quot;&gt;\n&lt;div class=&quot;p-rich_text_block&quot;&gt;\n&lt;p&gt;&lt;strong&gt;Who We Are:&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;Alpaca is a US California headquartered brokerage infrastructure technology company and self-clearing broker-dealer, delivering execution and custody solutions for Stocks, ETFs, Options, Cryptocurrencies, and more, and has raised over $170 million in funding. Amongst our subsidiaries, Alpaca is a licensed financial services company in multiple countries, and we serve hundreds of financial institutions globally such as broker-dealers, investment advisors, hedge funds, and crypto exchanges.&lt;/p&gt;\n&lt;p&gt;Alpaca’s globally distributed team members bring in diverse experiences such as engineers, traders, and brokerage professionals to achieve our Mission of opening financial services to everyone on the planet. We are also deeply committed to open-source contributions and fostering a vibrant community. We will continue to enhance and improve our award-winning developer-friendly API and the infrastructure behind it.&lt;/p&gt;\n&lt;p&gt;&lt;br&gt;&lt;br&gt;&lt;strong&gt;Our Team Members:&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;We’re a team of 150+ globally distributed members who love working from our favorite places worldwide. Our team spans the USA, Canada, Japan, Hungary, Nigeria, Brazil, the United Kingdom, and more!&lt;/p&gt;\n&lt;p&gt;We’re looking for candidates eager to join Alpaca’s growing organization, who are excited about our Mission of “Open financial services to everyone on the planet and share our Values of “Stay Curious,” “Have Empathy,” and “Be Accountable.”&lt;/p&gt;\n&lt;p&gt;&amp;nbsp;&lt;/p&gt;\n&lt;/div&gt;\n&lt;/div&gt;\n&lt;/div&gt;\n&lt;/div&gt;\n&lt;/div&gt;&lt;/div&gt;&lt;p&gt;&lt;strong&gt;Your Role:&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;As an Electronic Trading Coverage, you will provide high-quality support to enterprise-level clients, addressing issues related to order entry, execution, and FIX sessions. You will build and maintain strong relationships, proactively monitoring client trading activity to ensure smooth operations. Collaborating with trading operations desks, IT, and compliance teams, you’ll resolve issues and offer relevant market insights. Additionally, you will ensure all trading activities comply with regulatory requirements while identifying and addressing potential risks. Your role will also involve gathering client feedback to enhance services and tools.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Key Responsibilities:&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Customer Support:&lt;/strong&gt;&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;Deliver high-quality support to enterprise-level clients through various channels (phone, email, chat).&lt;/li&gt;\n&lt;li&gt;Investigate and resolve issues related to account management, order entry, processing, execution, FIX sessions, and OMS functionality.&lt;/li&gt;\n&lt;li&gt;Assist clients with troubleshooting and technical issues to ensure seamless operations.&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;&lt;strong&gt;Relationship Management:&lt;/strong&gt;&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;Build and maintain strong relationships with enterprise clients, understanding their operational needs and priorities.&lt;/li&gt;\n&lt;li&gt;Conduct regular check-ins and reviews to ensure client satisfaction and proactively address any concerns or challenges.&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;&lt;strong&gt;Trading Services:&lt;/strong&gt;&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;Monitor client accounts and trading activity for anomalies, providing timely alerts and support as necessary.&lt;/li&gt;\n&lt;li&gt;Stay informed on market developments and trading infrastructure to offer relevant guidance and insights to clients.&lt;/li&gt;\n&lt;li&gt;Monitor corporate actions, including dividends, stock splits, mergers, and other events, ensuring accurate and timely communication and resolution.&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;&lt;strong&gt;Collaboration and Feedback:&lt;/strong&gt;&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;Work closely with trading desks, operation, IT, and compliance teams to address and resolve client issues efficiently.&lt;/li&gt;\n&lt;li&gt;Collect client feedback and share insights with product development and management teams to refine services and tools.&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;&lt;strong&gt;Compliance and Risk Management:&lt;/strong&gt;&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;Ensure all client interactions and trading-related activities adhere to regulatory requirements and internal policies.&lt;/li&gt;\n&lt;li&gt;Proactively identify and address potential risks associated with client operations and trading processes.&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;&amp;nbsp;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Qualifications:&lt;/strong&gt;&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;Bachelor’s degree in Finance, Business Administration, Economics, or a related field.&lt;/li&gt;\n&lt;li&gt;At least 2-3 years of experience in brokerage operations, clearing, or a related field.&lt;/li&gt;\n&lt;li&gt;Proven experience in customer support, relationship management, and trading services.&lt;/li&gt;\n&lt;li&gt;Demonstrated experience with trading platforms and equities trading and familiarity with FIX protocol. Options experience is a plus.&lt;/li&gt;\n&lt;li&gt;Must either possess the JSDA Sales Representative Class 1 qualification at the time of hire or acquire it within 3 months after the hire date&lt;/li&gt;\n&lt;li&gt;Strong communication and interpersonal skills, with the ability to build and maintain client relationships.&lt;/li&gt;\n&lt;li&gt;Excellent English written and verbal communication skills to interact with internal and external stakeholders.&lt;/li&gt;\n&lt;li&gt;Proficient verbal communication skills in Japanese to engage with stakeholders.&lt;/li&gt;\n&lt;li&gt;Ability to work independently, manage priorities, and meet deadlines in a fast-paced environment.&lt;/li&gt;\n&lt;li&gt;High ethical standards and a commitment to maintaining confidentiality.&lt;/li&gt;\n&lt;/ul&gt;&lt;div class=&quot;content-conclusion&quot;&gt;&lt;h3&gt;&lt;strong&gt;How We Take Care of You:&lt;/strong&gt;&lt;/h3&gt;\n&lt;ul&gt;\n&lt;li style=&quot;font-weight: 400; text-align: justify;&quot;&gt;&lt;span style=&quot;font-weight: 400;&quot;&gt;Competitive Salary &amp;amp; Stock Options&lt;/span&gt;&lt;/li&gt;\n&lt;li style=&quot;font-weight: 400; text-align: justify;&quot;&gt;&lt;span style=&quot;font-weight: 400;&quot;&gt;Benefits: Health benefits start on day 1. In the US this includes Medical, Dental, Vision. In Canada, this includes supplemental health care. In Japan, you are offered local benefits. Internationally, this includes a stipend value to offset medical costs.&amp;nbsp;&amp;nbsp;&amp;nbsp;&lt;/span&gt;&lt;/li&gt;\n&lt;li style=&quot;font-weight: 400; text-align: justify;&quot;&gt;&lt;span style=&quot;font-weight: 400;&quot;&gt;New Hire Home-Office Setup: One-time USD $500&lt;/span&gt;&lt;/li&gt;\n&lt;li style=&quot;font-weight: 400; text-align: justify;&quot;&gt;&lt;span style=&quot;font-weight: 400;&quot;&gt;Monthly Stipend: USD $150 per month via a Brex Card&lt;/span&gt;&lt;/li&gt;\n&lt;li style=&quot;font-weight: 400; text-align: justify;&quot;&gt;&lt;span style=&quot;font-weight: 400;&quot;&gt;Work with awesome hard working people, super smart and cool clients and innovative partners from around the world&lt;/span&gt;&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;&lt;em&gt;&lt;span style=&quot;font-weight: 400;&quot;&gt;Alpaca is proud to be an equal opportunity workplace dedicated to pursuing and hiring a diverse workforce.&lt;br&gt;&lt;/span&gt;&lt;/em&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span style=&quot;font-size: 8pt;&quot;&gt;&lt;a href=&quot;https://files.alpaca.markets/disclosures/AlpacaRecruitmentPrivacyPolicy.pdf&quot;&gt;&lt;em&gt;&lt;span style=&quot;font-weight: 400;&quot;&gt;Recruitment Privacy Policy&lt;/span&gt;&lt;/em&gt;&lt;/a&gt;&lt;/span&gt;&lt;/p&gt;&lt;/div&gt;","tags":"[\"finance\",\"management\"]","pubDate":"2025-04-01T16:13:04.000Z","link":"https://job-boards.greenhouse.io/alpaca/jobs/5458198004","slug":"trading-services-specialist-alpaca-2333"},{"id":7957003951,"title":"Freelance Content Writer","company":"OneLocal","image":"https://photos.wellfound.com/startups/i/257661-3abe9f68928f2e0407dca967aca86e67-medium_jpg.jpg","description":"&lt;p&gt;We are looking for a talented &lt;strong&gt;Freelance Content Writer&lt;/strong&gt; with a strong background in &lt;strong&gt;martech, CRM, or agency-related topics&lt;/strong&gt; to join our team. This role is ideal for a writer who can produce high-quality, in-depth blog posts and case studies while maintaining an authoritative, market analyst tone.&lt;/p&gt;\n&lt;h3&gt;&lt;span style=&quot;font-size: 10pt;&quot;&gt;&lt;strong&gt;Key Responsibilities&lt;/strong&gt;&lt;/span&gt;&lt;/h3&gt;\n&lt;ul&gt;\n&lt;li&gt;Create compelling, research-driven blog posts on marketing trends, CRM providers, SMB marketing strategies, product insights, and case studies.&lt;/li&gt;\n&lt;li&gt;Write with an authoritative voice, demonstrating expertise and thought leadership in the industry.&lt;/li&gt;\n&lt;li&gt;Collaborate with our SEO freelancer to align on keywords and content strategies when needed.&lt;/li&gt;\n&lt;li&gt;Conduct independent research using internal resources and publicly available data (no technical interviews with subject matter experts required).&lt;/li&gt;\n&lt;li&gt;Produce several pieces of content per week, ensuring quality, consistency, and timely delivery.&lt;/li&gt;\n&lt;li&gt;Use Jira for task tracking (familiarity is helpful but not required).&lt;/li&gt;\n&lt;li&gt;Focus solely on writing—our in-house designer handles graphic and multimedia content.&lt;/li&gt;\n&lt;/ul&gt;\n&lt;h3&gt;&lt;span style=&quot;font-size: 10pt;&quot;&gt;&lt;strong&gt;Qualifications&lt;/strong&gt;&lt;/span&gt;&lt;/h3&gt;\n&lt;ul&gt;\n&lt;li&gt;Proven experience in content writing, blogging, or journalism, particularly in martech, CRM, or digital marketing.&lt;/li&gt;\n&lt;li&gt;Strong ability to analyze industry trends and translate them into insightful, well-structured content.&lt;/li&gt;\n&lt;li&gt;Excellent research and analytical skills with a keen eye for detail.&lt;/li&gt;\n&lt;li&gt;Understanding of SEO best practices and experience optimizing content for search.&lt;/li&gt;\n&lt;li&gt;Ability to write in a clear, engaging, and authoritative style.&lt;/li&gt;\n&lt;li&gt;Exceptional time management and organizational skills to meet deadlines consistently.&lt;/li&gt;\n&lt;/ul&gt;\n&lt;h3&gt;&lt;span style=&quot;font-size: 10pt;&quot;&gt;&lt;strong&gt;Nice to Have&lt;/strong&gt;&lt;/span&gt;&lt;/h3&gt;\n&lt;ul&gt;\n&lt;li&gt;Experience writing for SaaS, B2B, or marketing agencies.&lt;/li&gt;\n&lt;li&gt;Familiarity with Jira or other project management tools.&lt;/li&gt;\n&lt;li&gt;Interest in marketing technology, automation, and CRM ecosystems.&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;This is an hourly, ongoing freelance role with no designated end date.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Rate:&lt;/strong&gt; USD 5.5 per hour&amp;nbsp;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Note:&lt;/strong&gt; We process freelancer payments via &lt;strong&gt;Direct Deposit&lt;/strong&gt;. Please apply only if you can receive payments via this method.&lt;/p&gt;\n&lt;p&gt;If you&#39;re a strategic thinker, a skilled storyteller, and passionate about marketing and CRM content, we&#39;d love to hear from you!&lt;/p&gt;\n&lt;p&gt;&amp;nbsp;&lt;/p&gt;","tags":"[\"management\",\"b2b\"]","pubDate":"2025-04-01T16:11:27.000Z","link":"https://job-boards.greenhouse.io/onelocal/jobs/5482273004","slug":"freelance-content-writer-onelocal-9271"},{"id":8009176425,"title":"Implementation Specialist (6-Month Contract, Potential for Extension)","company":"OneLocal","image":"https://photos.wellfound.com/startups/i/257661-3abe9f68928f2e0407dca967aca86e67-medium_jpg.jpg","description":"&lt;p&gt;OneLocal is a leading provider of AI-powered digital marketing solutions for small and medium-sized businesses (SMBs). Our cloud-based platform offers a suite of interconnected tools - covering websites, SEO, reviews, advertising, social media, and more - to help SMBs streamline operations and enhance customer communication. By leveraging structured and unstructured data, we automate client interactions, generate engaging content, and optimize information workflows.&lt;/p&gt;\n&lt;p&gt;We’re looking for an &lt;strong&gt;Implementation Specialist&lt;/strong&gt; to join our team on a &lt;strong&gt;6-month contract, with the possibility of extension&lt;/strong&gt;. The ideal candidate is customer-centric, proactive, and eager to contribute to a fast-growing technology company. If you&#39;re seeking a role that’s both challenging and rewarding, this opportunity is for you.&lt;/p&gt;\n&lt;h3&gt;&lt;span style=&quot;font-size: 10pt;&quot;&gt;&lt;strong&gt;What You’ll Be Doing&lt;/strong&gt;&lt;/span&gt;&lt;/h3&gt;\n&lt;ul&gt;\n&lt;li&gt;Ensure seamless onboarding for new clients, providing guidance from contract signing to platform adoption.&lt;/li&gt;\n&lt;li&gt;Gather client requirements to support website development and digital marketing setup.&lt;/li&gt;\n&lt;li&gt;Assist clients in accessing their social media platforms and setting up necessary credentials.&lt;/li&gt;\n&lt;li&gt;Independently manage multiple client activation projects, ensuring smooth execution.&lt;/li&gt;\n&lt;li&gt;Proactively identify and address potential roadblocks to optimize the client experience.&lt;/li&gt;\n&lt;li&gt;Educate clients on our full suite of marketing tools to maximize their platform usage.&lt;/li&gt;\n&lt;li&gt;Maintain ongoing client communication, reporting updates to internal and external stakeholders.&lt;/li&gt;\n&lt;li&gt;Mitigate project risks to ensure timely, on-budget execution.&lt;/li&gt;\n&lt;li&gt;Prepare training materials and project documentation to support client success.&lt;/li&gt;\n&lt;li&gt;Contribute to best practices, methodologies, and process improvements.&lt;/li&gt;\n&lt;li&gt;Troubleshoot and resolve client issues, collaborating with internal teams and occasionally providing after-hours support when necessary.&lt;/li&gt;\n&lt;li&gt;Encourage clients to think strategically about their marketing goals, handling objections that may hinder project completion.&lt;/li&gt;\n&lt;/ul&gt;\n&lt;h3&gt;&lt;span style=&quot;font-size: 10pt;&quot;&gt;&lt;strong&gt;Essential Qualifications &amp;amp; Experience&lt;/strong&gt;&lt;/span&gt;&lt;/h3&gt;\n&lt;ul&gt;\n&lt;li&gt;2+ years of experience as an Implementation or Onboarding Specialist in a customer-facing role.&lt;/li&gt;\n&lt;li&gt;Strong verbal and written communication skills.&lt;/li&gt;\n&lt;li&gt;Ability to manage multiple projects in a fast-paced environment with shifting priorities.&lt;/li&gt;\n&lt;li&gt;Experience in customer success, project management, or client onboarding.&lt;/li&gt;\n&lt;li&gt;Ability to assess customer needs and align them with our product offerings.&lt;/li&gt;\n&lt;li&gt;Strong relationship-building skills, fostering long-term client partnerships.&lt;/li&gt;\n&lt;li&gt;Demonstrated professionalism, integrity, and problem-solving skills.&lt;/li&gt;\n&lt;li&gt;Highly organized with strong follow-up abilities.&lt;/li&gt;\n&lt;li&gt;Understanding of digital marketing principles, including SEO, social media, and online advertising.&lt;/li&gt;\n&lt;/ul&gt;\n&lt;h3&gt;&lt;span style=&quot;font-size: 10pt;&quot;&gt;&lt;strong&gt;Desirable Skills &amp;amp; Experience&lt;/strong&gt;&lt;/span&gt;&lt;/h3&gt;\n&lt;ul&gt;\n&lt;li&gt;Experience working with small and medium-sized businesses.&lt;/li&gt;\n&lt;li&gt;Background in SaaS, marketing agencies, or tech startups.&lt;/li&gt;\n&lt;li&gt;Proficiency in SEO, Google Analytics, and Google Business Profile.&lt;/li&gt;\n&lt;li&gt;Knowledge of Google Ads and Facebook Ads.&lt;/li&gt;\n&lt;li&gt;Experience with website platforms such as Duda, WordPress, or Shopify.&lt;/li&gt;\n&lt;li&gt;Familiarity with CRM platforms (preferably Salesforce).&lt;/li&gt;\n&lt;li&gt;Proficiency in project management tools (e.g., Jira).&lt;/li&gt;\n&lt;/ul&gt;\n&lt;h3&gt;&lt;span style=&quot;font-size: 10pt;&quot;&gt;&lt;strong&gt;Why You’ll Love Working Here&lt;/strong&gt;&lt;/span&gt;&lt;/h3&gt;\n&lt;ul&gt;\n&lt;li&gt;Make a real impact at a growing company that helps SMBs enhance their digital presence.&lt;/li&gt;\n&lt;li&gt;Remote-first culture with the option to access co-working spaces.&lt;/li&gt;\n&lt;li&gt;Engaging virtual social events, including coffee chats and weekly happy hours.&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;At OneLocal, we are committed to building and fostering an environment where our employees feel included, valued, and heard. Our belief is that a strong commitment to diversity and inclusion enables us to truly create the best company culture possible. We strongly encourage applications from candidates of all backgrounds, experience, and perspectives regardless of race, gender, sexual orientation, marital status, age, citizenship, disability, and national origin.&lt;/p&gt;\n&lt;p&gt;&amp;nbsp;&lt;/p&gt;","tags":"[\"management\"]","pubDate":"2025-04-01T16:11:27.000Z","link":"https://job-boards.greenhouse.io/onelocal/jobs/4018835004","slug":"implementation-specialist-6-month-contract-potential-for-extension-onelocal-4327"},{"id":3854055970,"title":"Marketing Strategist ","company":"OneLocal","image":"https://photos.wellfound.com/startups/i/257661-3abe9f68928f2e0407dca967aca86e67-medium_jpg.jpg","description":"&lt;p&gt;At OneLocal, we provide SaaS solutions that help small and medium businesses (SMBs) grow through data-driven marketing strategies. Our 10 digital marketing solutions work seamlessly together, empowering businesses to navigate the ever-evolving marketing landscape.&lt;/p&gt;\n&lt;p&gt;We&#39;re looking for a customer-facing&lt;strong&gt; Marketing Strategist&lt;/strong&gt;&amp;nbsp;who thrives in a fast-paced environment and is eager to make an impact. If you&#39;re passionate about strategic marketing, client success, and digital growth, this role is for you.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;What You’ll Do&lt;/strong&gt;&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;Consult &amp;amp; Advise: Meet with clients to assess marketing needs, answer questions, and provide strategic guidance.&lt;/li&gt;\n&lt;li&gt;Set Expectations &amp;amp; Communicate Value: Clearly explain marketing strategies, performance expectations, and ROI.&lt;/li&gt;\n&lt;li&gt;Develop &amp;amp; Optimize Campaigns: Craft marketing plans tailored to client goals, ensuring alignment with branding and industry trends.&lt;/li&gt;\n&lt;li&gt;Analyze &amp;amp; Report: Use GA4, Google Search Console, and other analytics tools to track performance and provide actionable insights.&lt;/li&gt;\n&lt;li&gt;Collaborate &amp;amp; Innovate: Work closely with Account Managers and our Agency team to enhance client marketing strategies.&lt;/li&gt;\n&lt;li&gt;Drive Growth: Identify expansion opportunities to maximize value for clients and contribute to OneLocal’s success.&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;&lt;strong&gt;What You Bring&lt;/strong&gt;&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;2+ years in a customer-facing marketing role (SaaS, marketing agency, or tech startup preferred).&lt;/li&gt;\n&lt;li&gt;SEO expertise: Keyword research, technical SEO, content marketing, listings management, and Google Business Profile optimization.&lt;/li&gt;\n&lt;li&gt;Strong digital marketing knowledge, including content marketing, inbound strategies, and paid advertising (Google &amp;amp; Facebook).&lt;/li&gt;\n&lt;li&gt;Experience with website platforms (Duda, WordPress, Shopify) and CRM systems (Salesforce preferred).&lt;/li&gt;\n&lt;li&gt;Exceptional communication &amp;amp; client management skills - you can build strong relationships and simplify complex strategies.&lt;/li&gt;\n&lt;li&gt;Proven ability to manage multiple clients in a dynamic, fast-moving environment.&lt;/li&gt;\n&lt;li&gt;Project management skills, including experience with tools like Jira.&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;&lt;strong&gt;Why You’ll Love Working Here:&lt;/strong&gt;&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;The opportunity to have a major impact at a growing company that is helping small and medium sized businesses grow their digital presence&lt;/li&gt;\n&lt;li&gt;Remote first: We have committed to a remote-first/distributed team work environment&lt;/li&gt;\n&lt;li&gt;Paid vacation + paid personal days&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;At OneLocal, we are committed to building and fostering an environment where our employees feel included, valued, and heard. Our belief is that a strong commitment to diversity and inclusion enables us to truly create the best company culture possible. We strongly encourage applications from candidates of all backgrounds, experience, and perspectives regardless of race, gender, sexual orientation, marital status, age, citizenship, disability, and national origin.&lt;/p&gt;\n&lt;p&gt;&amp;nbsp;&lt;/p&gt;","tags":"[\"management\"]","pubDate":"2025-04-01T16:11:27.000Z","link":"https://job-boards.greenhouse.io/onelocal/jobs/5246445004","slug":"marketing-strategist-onelocal-764"},{"id":3492182034,"title":"Senior DevOps","company":"OneLocal","image":"https://photos.wellfound.com/startups/i/257661-3abe9f68928f2e0407dca967aca86e67-medium_jpg.jpg","description":"&lt;p&gt;OneLocal is transforming the B2B sector with its innovative white-label marketing platform. Drawing on years of proven success in accelerating local business growth, we&#39;ve fine-tuned our expertise in developing unparalleled digital presences for thousands of merchants. Now, we&#39;re strategically partnering with leading software providers and franchisors to deliver a comprehensive, in-house marketing powerhouse for their SMB clients. Our sophisticated, AI-driven agency-in-a-box equips merchants with the competitive advantage essential for achieving market dominance and driving business expansion.&lt;/p&gt;\n&lt;p&gt;We are looking for talented and passionate individuals to embed the latest AI technology into our platform. We pride ourselves in our open and dynamic culture, our diversity, and being committed to a workplace where we all feel that we can be ourselves.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Job Overview&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;We are on the hunt for a seasoned Senior DevOps Engineer with a strong background in cloud observability, container orchestration, cloud operations, and incident response. The ideal candidate will have experience working with FinOps, CICD, developer tools, repository and source control architecture, developer build environments, and ensuring data storage efficiency.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Essential Duties and Responsibilities:&lt;/strong&gt;&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;&amp;nbsp;Cloud Observability: Implement and manage advanced cloud observability tools to monitor and optimize system performance, ensuring high availability and reliability for our service offerings.&lt;/li&gt;\n&lt;li&gt;&amp;nbsp;Cloud Expertise: Demonstrate proficiency in one of the major cloud platforms (AWS, Azure, or Google Cloud) to architect, manage, and optimize scalable cloud infrastructures.&lt;/li&gt;\n&lt;li&gt;&amp;nbsp;Operations &amp;amp; Incident Response: Lead the incident response process utilizing tools like PagerDuty or equivalent to ensure swift identification, management, and resolution of critical issues, maintaining service continuity.&lt;/li&gt;\n&lt;li&gt;&amp;nbsp;FinOps: Analyze and manage cloud costs effectively using FinOps principles, employing various tools and aggregators to ensure cost efficiency and resource optimization.&lt;/li&gt;\n&lt;li&gt;&amp;nbsp;CICD: Design, implement, and maintain continuous integration and continuous deployment (CICD) pipelines to enhance development workflows and delivery cycles.&lt;/li&gt;\n&lt;li&gt;&amp;nbsp;Developer Tools: Advance the use of modern developer tools, including AI-powered assistants like GitHub Copilot, to streamline coding practices and enhance overall productivity.&lt;/li&gt;\n&lt;li&gt;&amp;nbsp;Repository and Source Control Architecture: Architect and manage repository structures and source control processes to support development teams in effectively collaborating and maintaining code quality.&lt;/li&gt;\n&lt;li&gt;&amp;nbsp;Developer Build Environments: Create and optimize developer build environments to facilitate smooth and efficient development, testing, and deployment processes.&lt;/li&gt;\n&lt;li&gt;&amp;nbsp;Data Storage Efficiency: Design strategies and systems for efficient data storage, ensuring optimal performance, cost management, and scalability of storage solutions.&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;&lt;strong&gt;Requirements:&lt;/strong&gt;&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;Minimum of 5 years of relevant experience in a DevOps role, with a focus on cloud observability, container orchestration, and cloud operations.&lt;/li&gt;\n&lt;li&gt;Cloud Expertise: In-depth knowledge and hands-on experience with one of the major cloud platforms (AWS, Azure, Google Cloud).&lt;/li&gt;\n&lt;li&gt;Incident Response: Familiarity with incident management tools like PagerDuty or equivalent, with a track record of handling and resolving critical incidents.&lt;/li&gt;\n&lt;li&gt;FinOps: Strong understanding of Financial Operations (FinOps) principles and experience with tools and techniques for managing cloud costs.&lt;/li&gt;\n&lt;li&gt;CICD Pipelines: Demonstrable experience in designing and maintaining CICD pipelines using tools such as Jenkins, GitLab CI, or similar.&lt;/li&gt;\n&lt;li&gt;Source Control: Expertise in repository management and source control systems, particularly with Git, GitHub, GitLab, or similar platforms.&lt;/li&gt;\n&lt;li&gt;Build Environments: Experience in creating and optimizing developer build environments, ensuring they are efficient and conducive to high-quality code production.&lt;/li&gt;\n&lt;li&gt;Data Storage: Proficiency in designing and managing data storage solutions that balance performance with cost-efficiency, considering scalability requirements.&lt;/li&gt;\n&lt;li&gt;Problem-Solving Skills: Strong analytical and troubleshooting skills to resolve complex technical issues and optimize system performance.&lt;/li&gt;\n&lt;li&gt;Collaboration: Excellent communication and collaboration skills to work effectively with cross-functional teams, fostering a culture of continuous improvement.&lt;/li&gt;\n&lt;li&gt;Experience in implementing and managing Infrastructure as Code (IaC) tools such as Terraform and Pulumi&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;&lt;strong&gt;Plus&lt;/strong&gt;&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;AWS specialization and certification&lt;/li&gt;\n&lt;li&gt;Familiarity with security best practices and compliance standards in cloud environments.&lt;/li&gt;\n&lt;li&gt;Developer Tools: Proficiency with modern developer tools, including AI-powered assistants like GitHub Copilot, and a solid understanding of their impact on the development lifecycle.&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;&lt;strong&gt;Why You’ll Love Working Here:&lt;/strong&gt;&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;Remote first: We have committed to a remote-first work environment. This means our roles are open to candidates who can work between the core hours of 9am - 5pm EST&lt;/li&gt;\n&lt;li&gt;3 weeks paid vacation + 5 paid personal days&lt;/li&gt;\n&lt;li&gt;Stock options in a YC backed start-up&lt;/li&gt;\n&lt;li&gt;Virtual social events: coffee chats with your colleagues and weekly happy hours!&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;At OneLocal, we are committed to building and fostering an environment where our employees feel included, valued, and heard. Our belief is that a strong commitment to diversity and inclusion enables us to truly create the best company culture possible. We strongly encourage applications from candidates of all backgrounds, experience, and perspectives regardless of race, gender, sexual orientation, marital status, age, citizenship, disability, and national origin.&lt;/p&gt;","tags":"[\"pulumi\",\"management\",\"b2b\",\"aws\"]","pubDate":"2025-04-01T16:11:27.000Z","link":"https://job-boards.greenhouse.io/onelocal/jobs/5346874004","slug":"senior-devops-onelocal-2034"},{"id":1087847108,"title":"SEO Freelancer ","company":"OneLocal","image":"https://photos.wellfound.com/startups/i/257661-3abe9f68928f2e0407dca967aca86e67-medium_jpg.jpg","description":"&lt;p&gt;OneLocal is looking to hire &lt;strong&gt;SEO freelancers &lt;/strong&gt;on a short-contract basis to assist with updating the website&#39;s SEO audit digital presence.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;What You’ll Be Doing&lt;/strong&gt;&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;Conduct comprehensive on-page and technical SEO audits for our websites and provide actionable feedback to our internal team based on your findings&lt;/li&gt;\n&lt;li&gt;Conduct competitor analysis to identify content gaps and opportunities to improve or expand existing content&lt;/li&gt;\n&lt;li&gt;Provide reports and insights on each audit to our account management team&lt;/li&gt;\n&lt;li&gt;Ongoing optimizations to our Google Business Profiles (GBP)&lt;/li&gt;\n&lt;li&gt;Other tasks as required&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;&lt;strong&gt;What You Bring&lt;/strong&gt;&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;Experience with content creation or copywriting focused on local SEO&lt;/li&gt;\n&lt;li&gt;Understanding of conversion rate optimization (CRO) and its relationship to SEO&lt;/li&gt;\n&lt;li&gt;Familiarity with Core Web Vitals, schema markup, and technical SEO&lt;/li&gt;\n&lt;li&gt;Strong knowledge of local SEO tactics and strategies, including Content optimization and link-building strategies&lt;/li&gt;\n&lt;li&gt;Strong communication skills and experience working within a development team&lt;/li&gt;\n&lt;li&gt;Experience working with industry-standard tools such as Screaming Frog, SEMRush, Ahrefs, or similar&lt;/li&gt;\n&lt;li&gt;Experience working with industry-standard tools such as Google Search Console, Google Analytics&amp;nbsp;&lt;/li&gt;\n&lt;li&gt;Self-motivated with excellent time management, attention to detail, and a demonstrated ability to manage multiple projects effectively and efficiently&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;&lt;strong&gt;Nice to Have&lt;/strong&gt;&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;Basic knowledge of HTML&lt;/li&gt;\n&lt;li&gt;Experience using Uberall&lt;/li&gt;\n&lt;li&gt;Experience working in Jira&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;We will be paying at a rate of USD $5.50 per hour.&lt;/p&gt;\n&lt;p&gt;Note: OneLocal pays freelancers using Direct Deposit. Please only apply for this position if you can get paid via Direct Deposit. Thank you!&lt;/p&gt;","tags":"[\"management\"]","pubDate":"2025-04-01T16:11:27.000Z","link":"https://job-boards.greenhouse.io/onelocal/jobs/4821274004","slug":"seo-freelancer-onelocal-2693"},{"id":7488537617,"title":"Database Administrator (ClickHouse) - remote only","company":"CloudLinux","image":"https://avatars.githubusercontent.com/u/16290369?s=200&v=4","description":"<p>CloudLinux is a global remote-first company. We are driven by our principles: Do the right thing, employees first, we are remote first, and&nbsp; we deliver high volume, low-cost Linux infrastructure and security products that help companies to increase the efficiency of their operations. Every person on our team supports each other and does what we can to ensure everyone is successful. We are truly a great place to work.&nbsp;</p><p>We are looking for a highly skilled and knowledgeable Database Administrator (DBA) to join our Infrastructure Team. In this role, you will be responsible for configuring and maintaining highly available PostgreSQL and ClickHouse databases. Your expertise will play a crucial role in ensuring the reliability, performance, and scalability of our database systems.</p><p></p><p>You can find more details about the company on our branded website at <a href=\"http://cloudlinux.com/\" rel=\"nofollow noreferrer noopener\" class=\"external\">cloudlinux.com</a></p><p></p><p><strong>What you’ll do:</strong></p><ul> <li>Perform regular database maintenance, search for weak points (shortcomings) of the existing architecture, provide solutions or workarounds, and help implement them</li> <li>Configure database backups and prepare recovery plans</li> <li>Describe database infrastructure as a code</li> <li>Document databases of existing services and applications</li> <li>Maintain user access rights and security of databases</li> <li>Define key database monitoring metrics and define action plans to avoid/fix possible problems</li> <li>Write standard operating procedures for recurring tasks, maintenance, and recovery works</li> <li>Advise users on the subject of database optimization and writing DB queries</li> </ul><p><strong>Requirements</strong></p><p></p><p><strong>To be successful, you should have:</strong></p><ul> <li>Proven experience of ClickHouse DB administration</li> <li>Proven experience of PostgresSQL DB administration </li> <li>Experience in configuring a database in a high availability architecture</li> <li>Experience in database backup and recovery</li> <li>Experience in database optimization for different load profiles</li> <li>Intermediate level of English knowledge</li> </ul><p></p><p><strong>Will be a plus:</strong></p><ul> <li>Experience in automating data loading from different sources</li> <li>Experience with Ansible, Terraform</li> <li>Experience with K8s and Clouds (AWS/GCP).</li> </ul><p><strong>Benefits</strong></p><p><strong>What's in it for you?</strong></p><ul> <li>A focus on professional development.</li> <li>Interesting and challenging projects.</li> <li>Fully remote work with flexible working hours, that allows you to schedule your day and work from any location worldwide.</li> <li>Paid 24 days of vacation per year, 10 days of national holidays, and unlimited sick leaves.</li> <li>Compensation for private medical insurance.</li> <li>Co-working and gym/sports reimbursement.</li> <li>Budget for education.</li> <li>The opportunity to receive a reward for the most innovative idea that the company can patent.</li> </ul><p></p><p><em>By applying for this position, you consent to the processing of your personal data as described in our Privacy Policy (</em><a href=\"https://cloudlinux.com/candidate-privacy-notice\" target=\"_blank\" rel=\"nofollow noreferrer noopener\" class=\"external\"><em>https://cloudlinux.com/candidate-privacy-notice</em></a><em>), which provides detailed information on how we maintain and handle your data.</em></p>","tags":"[\"postgres\",\"database\",\"aws\"]","pubDate":"2025-04-01T00:00:00.000Z","link":"https://apply.workable.com/j/86ABCB0F5B","slug":"database-administrator-clickhouse-remote-only-cloudlinux-9464"},{"id":6416271827,"title":"Database Administrator (ClickHouse) - remote only","company":"CloudLinux","image":"https://avatars.githubusercontent.com/u/16290369?s=200&v=4","description":"<p>CloudLinux is a global remote-first company. We are driven by our principles: Do the right thing, employees first, we are remote first, and&nbsp; we deliver high volume, low-cost Linux infrastructure and security products that help companies to increase the efficiency of their operations. Every person on our team supports each other and does what we can to ensure everyone is successful. We are truly a great place to work.&nbsp;</p><p>We are looking for a highly skilled and knowledgeable Database Administrator (DBA) to join our Infrastructure Team. In this role, you will be responsible for configuring and maintaining highly available PostgreSQL and ClickHouse databases. Your expertise will play a crucial role in ensuring the reliability, performance, and scalability of our database systems.</p><p></p><p>You can find more details about the company on our branded website at <a href=\"http://cloudlinux.com/\" rel=\"nofollow noreferrer noopener\" class=\"external\">cloudlinux.com</a></p><p></p><p><strong>What you’ll do:</strong></p><ul> <li>Perform regular database maintenance, search for weak points (shortcomings) of the existing architecture, provide solutions or workarounds, and help implement them</li> <li>Configure database backups and prepare recovery plans</li> <li>Describe database infrastructure as a code</li> <li>Document databases of existing services and applications</li> <li>Maintain user access rights and security of databases</li> <li>Define key database monitoring metrics and define action plans to avoid/fix possible problems</li> <li>Write standard operating procedures for recurring tasks, maintenance, and recovery works</li> <li>Advise users on the subject of database optimization and writing DB queries</li> </ul><p><strong>Requirements</strong></p><p></p><p><strong>To be successful, you should have:</strong></p><ul> <li>Proven experience of ClickHouse DB administration</li> <li>Proven experience of PostgresSQL DB administration </li> <li>Experience in configuring a database in a high availability architecture</li> <li>Experience in database backup and recovery</li> <li>Experience in database optimization for different load profiles</li> <li>Intermediate level of English knowledge</li> </ul><p></p><p><strong>Will be a plus:</strong></p><ul> <li>Experience in automating data loading from different sources</li> <li>Experience with Ansible, Terraform</li> <li>Experience with K8s and Clouds (AWS/GCP).</li> </ul><p><strong>Benefits</strong></p><p><strong>What's in it for you?</strong></p><ul> <li>A focus on professional development.</li> <li>Interesting and challenging projects.</li> <li>Fully remote work with flexible working hours, that allows you to schedule your day and work from any location worldwide.</li> <li>Paid 24 days of vacation per year, 10 days of national holidays, and unlimited sick leaves.</li> <li>Compensation for private medical insurance.</li> <li>Co-working and gym/sports reimbursement.</li> <li>Budget for education.</li> <li>The opportunity to receive a reward for the most innovative idea that the company can patent.</li> </ul><p></p><p><em>By applying for this position, you consent to the processing of your personal data as described in our Privacy Policy (</em><a href=\"https://cloudlinux.com/candidate-privacy-notice\" target=\"_blank\" rel=\"nofollow noreferrer noopener\" class=\"external\"><em>https://cloudlinux.com/candidate-privacy-notice</em></a><em>), which provides detailed information on how we maintain and handle your data.</em></p>","tags":"[\"postgres\",\"database\",\"aws\"]","pubDate":"2025-04-01T00:00:00.000Z","link":"https://apply.workable.com/j/86ABCB0F5B","slug":"database-administrator-clickhouse-remote-only-cloudlinux-1110"},{"id":1715731994,"title":"Database Administrator (ClickHouse) - remote only","company":"CloudLinux","image":"https://avatars.githubusercontent.com/u/16290369?s=200&v=4","description":"<p>CloudLinux is a global remote-first company. We are driven by our principles: Do the right thing, employees first, we are remote first, and&nbsp; we deliver high volume, low-cost Linux infrastructure and security products that help companies to increase the efficiency of their operations. Every person on our team supports each other and does what we can to ensure everyone is successful. We are truly a great place to work.&nbsp;</p><p>We are looking for a highly skilled and knowledgeable Database Administrator (DBA) to join our Infrastructure Team. In this role, you will be responsible for configuring and maintaining highly available PostgreSQL and ClickHouse databases. Your expertise will play a crucial role in ensuring the reliability, performance, and scalability of our database systems.</p><p></p><p>You can find more details about the company on our branded website at <a href=\"http://cloudlinux.com/\" rel=\"nofollow noreferrer noopener\" class=\"external\">cloudlinux.com</a></p><p></p><p><strong>What you’ll do:</strong></p><ul> <li>Perform regular database maintenance, search for weak points (shortcomings) of the existing architecture, provide solutions or workarounds, and help implement them</li> <li>Configure database backups and prepare recovery plans</li> <li>Describe database infrastructure as a code</li> <li>Document databases of existing services and applications</li> <li>Maintain user access rights and security of databases</li> <li>Define key database monitoring metrics and define action plans to avoid/fix possible problems</li> <li>Write standard operating procedures for recurring tasks, maintenance, and recovery works</li> <li>Advise users on the subject of database optimization and writing DB queries</li> </ul><p><strong>Requirements</strong></p><p></p><p><strong>To be successful, you should have:</strong></p><ul> <li>Proven experience of ClickHouse DB administration</li> <li>Proven experience of PostgresSQL DB administration </li> <li>Experience in configuring a database in a high availability architecture</li> <li>Experience in database backup and recovery</li> <li>Experience in database optimization for different load profiles</li> <li>Intermediate level of English knowledge</li> </ul><p></p><p><strong>Will be a plus:</strong></p><ul> <li>Experience in automating data loading from different sources</li> <li>Experience with Ansible, Terraform</li> <li>Experience with K8s and Clouds (AWS/GCP).</li> </ul><p><strong>Benefits</strong></p><p><strong>What's in it for you?</strong></p><ul> <li>A focus on professional development.</li> <li>Interesting and challenging projects.</li> <li>Fully remote work with flexible working hours, that allows you to schedule your day and work from any location worldwide.</li> <li>Paid 24 days of vacation per year, 10 days of national holidays, and unlimited sick leaves.</li> <li>Compensation for private medical insurance.</li> <li>Co-working and gym/sports reimbursement.</li> <li>Budget for education.</li> <li>The opportunity to receive a reward for the most innovative idea that the company can patent.</li> </ul><p></p><p><em>By applying for this position, you consent to the processing of your personal data as described in our Privacy Policy (</em><a href=\"https://cloudlinux.com/candidate-privacy-notice\" target=\"_blank\" rel=\"nofollow noreferrer noopener\" class=\"external\"><em>https://cloudlinux.com/candidate-privacy-notice</em></a><em>), which provides detailed information on how we maintain and handle your data.</em></p>","tags":"[\"postgres\",\"database\",\"aws\"]","pubDate":"2025-04-01T00:00:00.000Z","link":"https://apply.workable.com/j/86ABCB0F5B","slug":"database-administrator-clickhouse-remote-only-cloudlinux-3937"},{"id":5626894181,"title":"Database Administrator (ClickHouse) - remote only","company":"CloudLinux","image":"https://avatars.githubusercontent.com/u/16290369?s=200&v=4","description":"<p>CloudLinux is a global remote-first company. We are driven by our principles: Do the right thing, employees first, we are remote first, and&nbsp; we deliver high volume, low-cost Linux infrastructure and security products that help companies to increase the efficiency of their operations. Every person on our team supports each other and does what we can to ensure everyone is successful. We are truly a great place to work.&nbsp;</p><p>We are looking for a highly skilled and knowledgeable Database Administrator (DBA) to join our Infrastructure Team. In this role, you will be responsible for configuring and maintaining highly available PostgreSQL and ClickHouse databases. Your expertise will play a crucial role in ensuring the reliability, performance, and scalability of our database systems.</p><p></p><p>You can find more details about the company on our branded website at <a href=\"http://cloudlinux.com/\" rel=\"nofollow noreferrer noopener\" class=\"external\">cloudlinux.com</a></p><p></p><p><strong>What you’ll do:</strong></p><ul> <li>Perform regular database maintenance, search for weak points (shortcomings) of the existing architecture, provide solutions or workarounds, and help implement them</li> <li>Configure database backups and prepare recovery plans</li> <li>Describe database infrastructure as a code</li> <li>Document databases of existing services and applications</li> <li>Maintain user access rights and security of databases</li> <li>Define key database monitoring metrics and define action plans to avoid/fix possible problems</li> <li>Write standard operating procedures for recurring tasks, maintenance, and recovery works</li> <li>Advise users on the subject of database optimization and writing DB queries</li> </ul><p><strong>Requirements</strong></p><p></p><p><strong>To be successful, you should have:</strong></p><ul> <li>Proven experience of ClickHouse DB administration</li> <li>Proven experience of PostgresSQL DB administration </li> <li>Experience in configuring a database in a high availability architecture</li> <li>Experience in database backup and recovery</li> <li>Experience in database optimization for different load profiles</li> <li>Intermediate level of English knowledge</li> </ul><p></p><p><strong>Will be a plus:</strong></p><ul> <li>Experience in automating data loading from different sources</li> <li>Experience with Ansible, Terraform</li> <li>Experience with K8s and Clouds (AWS/GCP).</li> </ul><p><strong>Benefits</strong></p><p><strong>What's in it for you?</strong></p><ul> <li>A focus on professional development.</li> <li>Interesting and challenging projects.</li> <li>Fully remote work with flexible working hours, that allows you to schedule your day and work from any location worldwide.</li> <li>Paid 24 days of vacation per year, 10 days of national holidays, and unlimited sick leaves.</li> <li>Compensation for private medical insurance.</li> <li>Co-working and gym/sports reimbursement.</li> <li>Budget for education.</li> <li>The opportunity to receive a reward for the most innovative idea that the company can patent.</li> </ul><p></p><p><em>By applying for this position, you consent to the processing of your personal data as described in our Privacy Policy (</em><a href=\"https://cloudlinux.com/candidate-privacy-notice\" target=\"_blank\" rel=\"nofollow noreferrer noopener\" class=\"external\"><em>https://cloudlinux.com/candidate-privacy-notice</em></a><em>), which provides detailed information on how we maintain and handle your data.</em></p>","tags":"[\"postgres\",\"database\",\"aws\"]","pubDate":"2025-04-01T00:00:00.000Z","link":"https://apply.workable.com/j/86ABCB0F5B","slug":"database-administrator-clickhouse-remote-only-cloudlinux-7594"},{"id":8566001570,"title":"Scrum Master (remote-only opportunity, location - Europe)","company":"CloudLinux","image":"https://avatars.githubusercontent.com/u/16290369?s=200&v=4","description":"<p>CloudLinux is a global remote-first company. We are driven by our principles: do the right thing, employees first, we are remote first, and we deliver high volume, low-cost Linux infrastructure and security products that help companies to increase the efficiency of their operations. Every person on our team supports each other and does what we can to ensure we all are successful.&nbsp;</p><p>Check out our website for more information <a href=\"https://cloudlinux.com/\" target=\"_blank\" rel=\"nofollow noreferrer noopener\" class=\"external\">https://cloudlinux.com/</a></p><p></p><p>The <strong>Release Engineering Department</strong> plays a critical role in maintaining both external and internal infrastructure related to package repositories, with a strong focus on delivering and managing repository distribution to users. To support this mission, we are looking for a <strong>Scrum Master</strong> to join the department and help drive Agile practices across several teams.</p><p>As a<strong> Scrum Master,</strong> you will work closely with teams that contribute to the robustness and reliability of our repository infrastructure. Each team operates with different levels of autonomy and has unique workflows, so instead of applying a one-size-fits-all solution, your role will be to collaborate with teams, understand their specific challenges, and support them in continuously improving their processes. This position is key to fostering a culture of innovation, adaptability, and sustained delivery excellence within the Release Engineering Department.</p><p></p><p><strong>As our Scrum Master you will: </strong></p><ul> <li>Lead team processes enhancement using Agile and Lean principles through motivation, relationship building, and coaching.</li> <li>Mentor product owners and team leaders, while actively engaging with the product.</li> <li>Collaborate with the designated department, providing hands-on Agile coaching.</li> <li>Act as an Agile coach for the whole department, stepping into the shoes of Scrum Master for 1-2 teams.</li> <li>Facilitate gradual changes within teams, guiding them towards Agile thinking.</li> <li>Identify and address team needs and challenges, empowering them to embrace continuous improvement.</li> <li>Collaborate with the Scrum Master within the team.</li> </ul><p><strong>Requirements</strong></p><p><strong>To thrive in this role, you should possess the following: </strong></p><ul> <li>A deep understanding of Agile methodologies, especially Kanban, and knowledge of Lean &amp; DevOps principles will be an advantage. </li> <li>Proficiency in Agile coaching and facilitation, guiding teams to self-organization and high performance; facilitating continuous flow and improvement practices within a Kanban framework, including the management of workflow, work-in-progress limits, and regular cadence meetings. </li> <li>Experience in engaging with multiple stakeholders concurrently. </li> <li>Readiness to systematically guide the organization and teams through changes and enhancements. </li> <li>Ability to identify and handle conflicts before they become a hindrance to the team’s progress. </li> <li>Ability to lead by example, inspire others, and maintain a positive and productive work environment. </li> <li>An understanding of product thinking, guiding teams towards a business-oriented approach. </li> <li>Broad understanding of software development and delivery processes, including requirements definition and release processes. </li> <li>Technical background – proven experience in Software Development, QA Automation or similar.</li> </ul><p></p><p><strong>In addition, the following are essential requirements:</strong></p><ul> <li> Agile/Scrum certification. </li> <li> Proven experience in a similar role within service teams. </li> <li> Fluency in Russian. </li> <li> Upper-intermediate or higher level of English proficiency. </li> </ul><p><strong>Benefits</strong></p><p><strong>What's in it for you?</strong></p><ul> <li>A strong focus on professional development with opportunities for learning and growth.</li> <li>Engage in interesting and challenging initiatives that push your technical and analytical skills.</li> <li>Regular interaction with senior leadership, providing insights into strategic decision-making.</li> <li>Fully remote work with flexible hours, allowing you to schedule your day and work from any location worldwide.</li> <li>Paid one-month vacation per year and unlimited sick leave to ensure you maintain a healthy work-life balance.</li> <li>Medical insurance reimbursement to support your health needs.</li> <li>Co-working and gym/sports reimbursement to encourage a healthy and active lifestyle.</li> <li>The opportunity to receive a reward for the most innovative idea that the company can patent, fostering a culture of creativity and innovation.</li> </ul><p></p><p><em>By applying for this position, you consent to the processing of your personal data as described in our Privacy Policy (</em><a href=\"https://cloudlinux.com/candidate-privacy-notice\" target=\"_blank\" rel=\"nofollow noreferrer noopener\" class=\"external\"><em>https://cloudlinux.com/candidate-privacy-notice</em></a><em>), which provides detailed information on how we maintain and handle your data.</em></p>","tags":"[\"management\",\"engineering\"]","pubDate":"2025-04-01T00:00:00.000Z","link":"https://apply.workable.com/j/77EFC99D83","slug":"scrum-master-remote-only-opportunity-location-europe-cloudlinux-1095"},{"id":9677014014,"title":"Scrum Master (remote-only opportunity, location - Europe)","company":"CloudLinux","image":"https://avatars.githubusercontent.com/u/16290369?s=200&v=4","description":"<p>CloudLinux is a global remote-first company. We are driven by our principles: do the right thing, employees first, we are remote first, and we deliver high volume, low-cost Linux infrastructure and security products that help companies to increase the efficiency of their operations. Every person on our team supports each other and does what we can to ensure we all are successful.&nbsp;</p><p>Check out our website for more information <a href=\"https://cloudlinux.com/\" target=\"_blank\" rel=\"nofollow noreferrer noopener\" class=\"external\">https://cloudlinux.com/</a></p><p></p><p>The <strong>Release Engineering Department</strong> plays a critical role in maintaining both external and internal infrastructure related to package repositories, with a strong focus on delivering and managing repository distribution to users. To support this mission, we are looking for a <strong>Scrum Master</strong> to join the department and help drive Agile practices across several teams.</p><p>As a<strong> Scrum Master,</strong> you will work closely with teams that contribute to the robustness and reliability of our repository infrastructure. Each team operates with different levels of autonomy and has unique workflows, so instead of applying a one-size-fits-all solution, your role will be to collaborate with teams, understand their specific challenges, and support them in continuously improving their processes. This position is key to fostering a culture of innovation, adaptability, and sustained delivery excellence within the Release Engineering Department.</p><p></p><p><strong>As our Scrum Master you will: </strong></p><ul> <li>Lead team processes enhancement using Agile and Lean principles through motivation, relationship building, and coaching.</li> <li>Mentor product owners and team leaders, while actively engaging with the product.</li> <li>Collaborate with the designated department, providing hands-on Agile coaching.</li> <li>Act as an Agile coach for the whole department, stepping into the shoes of Scrum Master for 1-2 teams.</li> <li>Facilitate gradual changes within teams, guiding them towards Agile thinking.</li> <li>Identify and address team needs and challenges, empowering them to embrace continuous improvement.</li> <li>Collaborate with the Scrum Master within the team.</li> </ul><p><strong>Requirements</strong></p><p><strong>To thrive in this role, you should possess the following: </strong></p><ul> <li>A deep understanding of Agile methodologies, especially Kanban, and knowledge of Lean &amp; DevOps principles will be an advantage. </li> <li>Proficiency in Agile coaching and facilitation, guiding teams to self-organization and high performance; facilitating continuous flow and improvement practices within a Kanban framework, including the management of workflow, work-in-progress limits, and regular cadence meetings. </li> <li>Experience in engaging with multiple stakeholders concurrently. </li> <li>Readiness to systematically guide the organization and teams through changes and enhancements. </li> <li>Ability to identify and handle conflicts before they become a hindrance to the team’s progress. </li> <li>Ability to lead by example, inspire others, and maintain a positive and productive work environment. </li> <li>An understanding of product thinking, guiding teams towards a business-oriented approach. </li> <li>Broad understanding of software development and delivery processes, including requirements definition and release processes. </li> <li>Technical background – proven experience in Software Development, QA Automation or similar.</li> </ul><p></p><p><strong>In addition, the following are essential requirements:</strong></p><ul> <li> Agile/Scrum certification. </li> <li> Proven experience in a similar role within service teams. </li> <li> Fluency in Russian. </li> <li> Upper-intermediate or higher level of English proficiency. </li> </ul><p><strong>Benefits</strong></p><p><strong>What's in it for you?</strong></p><ul> <li>A strong focus on professional development with opportunities for learning and growth.</li> <li>Engage in interesting and challenging initiatives that push your technical and analytical skills.</li> <li>Regular interaction with senior leadership, providing insights into strategic decision-making.</li> <li>Fully remote work with flexible hours, allowing you to schedule your day and work from any location worldwide.</li> <li>Paid one-month vacation per year and unlimited sick leave to ensure you maintain a healthy work-life balance.</li> <li>Medical insurance reimbursement to support your health needs.</li> <li>Co-working and gym/sports reimbursement to encourage a healthy and active lifestyle.</li> <li>The opportunity to receive a reward for the most innovative idea that the company can patent, fostering a culture of creativity and innovation.</li> </ul><p></p><p><em>By applying for this position, you consent to the processing of your personal data as described in our Privacy Policy (</em><a href=\"https://cloudlinux.com/candidate-privacy-notice\" target=\"_blank\" rel=\"nofollow noreferrer noopener\" class=\"external\"><em>https://cloudlinux.com/candidate-privacy-notice</em></a><em>), which provides detailed information on how we maintain and handle your data.</em></p>","tags":"[\"management\",\"engineering\"]","pubDate":"2025-04-01T00:00:00.000Z","link":"https://apply.workable.com/j/77EFC99D83","slug":"scrum-master-remote-only-opportunity-location-europe-cloudlinux-9652"},{"id":3731911741,"title":"Scrum Master (remote-only opportunity, location - Europe)","company":"CloudLinux","image":"https://avatars.githubusercontent.com/u/16290369?s=200&v=4","description":"<p>CloudLinux is a global remote-first company. We are driven by our principles: do the right thing, employees first, we are remote first, and we deliver high volume, low-cost Linux infrastructure and security products that help companies to increase the efficiency of their operations. Every person on our team supports each other and does what we can to ensure we all are successful.&nbsp;</p><p>Check out our website for more information <a href=\"https://cloudlinux.com/\" target=\"_blank\" rel=\"nofollow noreferrer noopener\" class=\"external\">https://cloudlinux.com/</a></p><p></p><p>The <strong>Release Engineering Department</strong> plays a critical role in maintaining both external and internal infrastructure related to package repositories, with a strong focus on delivering and managing repository distribution to users. To support this mission, we are looking for a <strong>Scrum Master</strong> to join the department and help drive Agile practices across several teams.</p><p>As a<strong> Scrum Master,</strong> you will work closely with teams that contribute to the robustness and reliability of our repository infrastructure. Each team operates with different levels of autonomy and has unique workflows, so instead of applying a one-size-fits-all solution, your role will be to collaborate with teams, understand their specific challenges, and support them in continuously improving their processes. This position is key to fostering a culture of innovation, adaptability, and sustained delivery excellence within the Release Engineering Department.</p><p></p><p><strong>As our Scrum Master you will: </strong></p><ul> <li>Lead team processes enhancement using Agile and Lean principles through motivation, relationship building, and coaching.</li> <li>Mentor product owners and team leaders, while actively engaging with the product.</li> <li>Collaborate with the designated department, providing hands-on Agile coaching.</li> <li>Act as an Agile coach for the whole department, stepping into the shoes of Scrum Master for 1-2 teams.</li> <li>Facilitate gradual changes within teams, guiding them towards Agile thinking.</li> <li>Identify and address team needs and challenges, empowering them to embrace continuous improvement.</li> <li>Collaborate with the Scrum Master within the team.</li> </ul><p><strong>Requirements</strong></p><p><strong>To thrive in this role, you should possess the following: </strong></p><ul> <li>A deep understanding of Agile methodologies, especially Kanban, and knowledge of Lean &amp; DevOps principles will be an advantage. </li> <li>Proficiency in Agile coaching and facilitation, guiding teams to self-organization and high performance; facilitating continuous flow and improvement practices within a Kanban framework, including the management of workflow, work-in-progress limits, and regular cadence meetings. </li> <li>Experience in engaging with multiple stakeholders concurrently. </li> <li>Readiness to systematically guide the organization and teams through changes and enhancements. </li> <li>Ability to identify and handle conflicts before they become a hindrance to the team’s progress. </li> <li>Ability to lead by example, inspire others, and maintain a positive and productive work environment. </li> <li>An understanding of product thinking, guiding teams towards a business-oriented approach. </li> <li>Broad understanding of software development and delivery processes, including requirements definition and release processes. </li> <li>Technical background – proven experience in Software Development, QA Automation or similar.</li> </ul><p></p><p><strong>In addition, the following are essential requirements:</strong></p><ul> <li> Agile/Scrum certification. </li> <li> Proven experience in a similar role within service teams. </li> <li> Fluency in Russian. </li> <li> Upper-intermediate or higher level of English proficiency. </li> </ul><p><strong>Benefits</strong></p><p><strong>What's in it for you?</strong></p><ul> <li>A strong focus on professional development with opportunities for learning and growth.</li> <li>Engage in interesting and challenging initiatives that push your technical and analytical skills.</li> <li>Regular interaction with senior leadership, providing insights into strategic decision-making.</li> <li>Fully remote work with flexible hours, allowing you to schedule your day and work from any location worldwide.</li> <li>Paid one-month vacation per year and unlimited sick leave to ensure you maintain a healthy work-life balance.</li> <li>Medical insurance reimbursement to support your health needs.</li> <li>Co-working and gym/sports reimbursement to encourage a healthy and active lifestyle.</li> <li>The opportunity to receive a reward for the most innovative idea that the company can patent, fostering a culture of creativity and innovation.</li> </ul><p></p><p><em>By applying for this position, you consent to the processing of your personal data as described in our Privacy Policy (</em><a href=\"https://cloudlinux.com/candidate-privacy-notice\" target=\"_blank\" rel=\"nofollow noreferrer noopener\" class=\"external\"><em>https://cloudlinux.com/candidate-privacy-notice</em></a><em>), which provides detailed information on how we maintain and handle your data.</em></p>","tags":"[\"management\",\"engineering\"]","pubDate":"2025-04-01T00:00:00.000Z","link":"https://apply.workable.com/j/77EFC99D83","slug":"scrum-master-remote-only-opportunity-location-europe-cloudlinux-9159"},{"id":8831889898,"title":"Scrum Master (remote-only opportunity, location - Europe)","company":"CloudLinux","image":"https://avatars.githubusercontent.com/u/16290369?s=200&v=4","description":"<p>CloudLinux is a global remote-first company. We are driven by our principles: do the right thing, employees first, we are remote first, and we deliver high volume, low-cost Linux infrastructure and security products that help companies to increase the efficiency of their operations. Every person on our team supports each other and does what we can to ensure we all are successful.&nbsp;</p><p>Check out our website for more information <a href=\"https://cloudlinux.com/\" target=\"_blank\" rel=\"nofollow noreferrer noopener\" class=\"external\">https://cloudlinux.com/</a></p><p></p><p>The <strong>Release Engineering Department</strong> plays a critical role in maintaining both external and internal infrastructure related to package repositories, with a strong focus on delivering and managing repository distribution to users. To support this mission, we are looking for a <strong>Scrum Master</strong> to join the department and help drive Agile practices across several teams.</p><p>As a<strong> Scrum Master,</strong> you will work closely with teams that contribute to the robustness and reliability of our repository infrastructure. Each team operates with different levels of autonomy and has unique workflows, so instead of applying a one-size-fits-all solution, your role will be to collaborate with teams, understand their specific challenges, and support them in continuously improving their processes. This position is key to fostering a culture of innovation, adaptability, and sustained delivery excellence within the Release Engineering Department.</p><p></p><p><strong>As our Scrum Master you will: </strong></p><ul> <li>Lead team processes enhancement using Agile and Lean principles through motivation, relationship building, and coaching.</li> <li>Mentor product owners and team leaders, while actively engaging with the product.</li> <li>Collaborate with the designated department, providing hands-on Agile coaching.</li> <li>Act as an Agile coach for the whole department, stepping into the shoes of Scrum Master for 1-2 teams.</li> <li>Facilitate gradual changes within teams, guiding them towards Agile thinking.</li> <li>Identify and address team needs and challenges, empowering them to embrace continuous improvement.</li> <li>Collaborate with the Scrum Master within the team.</li> </ul><p><strong>Requirements</strong></p><p><strong>To thrive in this role, you should possess the following: </strong></p><ul> <li>A deep understanding of Agile methodologies, especially Kanban, and knowledge of Lean &amp; DevOps principles will be an advantage. </li> <li>Proficiency in Agile coaching and facilitation, guiding teams to self-organization and high performance; facilitating continuous flow and improvement practices within a Kanban framework, including the management of workflow, work-in-progress limits, and regular cadence meetings. </li> <li>Experience in engaging with multiple stakeholders concurrently. </li> <li>Readiness to systematically guide the organization and teams through changes and enhancements. </li> <li>Ability to identify and handle conflicts before they become a hindrance to the team’s progress. </li> <li>Ability to lead by example, inspire others, and maintain a positive and productive work environment. </li> <li>An understanding of product thinking, guiding teams towards a business-oriented approach. </li> <li>Broad understanding of software development and delivery processes, including requirements definition and release processes. </li> <li>Technical background – proven experience in Software Development, QA Automation or similar.</li> </ul><p></p><p><strong>In addition, the following are essential requirements:</strong></p><ul> <li> Agile/Scrum certification. </li> <li> Proven experience in a similar role within service teams. </li> <li> Fluency in Russian. </li> <li> Upper-intermediate or higher level of English proficiency. </li> </ul><p><strong>Benefits</strong></p><p><strong>What's in it for you?</strong></p><ul> <li>A strong focus on professional development with opportunities for learning and growth.</li> <li>Engage in interesting and challenging initiatives that push your technical and analytical skills.</li> <li>Regular interaction with senior leadership, providing insights into strategic decision-making.</li> <li>Fully remote work with flexible hours, allowing you to schedule your day and work from any location worldwide.</li> <li>Paid one-month vacation per year and unlimited sick leave to ensure you maintain a healthy work-life balance.</li> <li>Medical insurance reimbursement to support your health needs.</li> <li>Co-working and gym/sports reimbursement to encourage a healthy and active lifestyle.</li> <li>The opportunity to receive a reward for the most innovative idea that the company can patent, fostering a culture of creativity and innovation.</li> </ul><p></p><p><em>By applying for this position, you consent to the processing of your personal data as described in our Privacy Policy (</em><a href=\"https://cloudlinux.com/candidate-privacy-notice\" target=\"_blank\" rel=\"nofollow noreferrer noopener\" class=\"external\"><em>https://cloudlinux.com/candidate-privacy-notice</em></a><em>), which provides detailed information on how we maintain and handle your data.</em></p>","tags":"[\"management\",\"engineering\"]","pubDate":"2025-04-01T00:00:00.000Z","link":"https://apply.workable.com/j/77EFC99D83","slug":"scrum-master-remote-only-opportunity-location-europe-cloudlinux-150"},{"id":8693560394,"title":"Scrum Master (remote-only opportunity, location - Europe)","company":"CloudLinux","image":"https://avatars.githubusercontent.com/u/16290369?s=200&v=4","description":"<p>CloudLinux is a global remote-first company. We are driven by our principles: do the right thing, employees first, we are remote first, and we deliver high volume, low-cost Linux infrastructure and security products that help companies to increase the efficiency of their operations. Every person on our team supports each other and does what we can to ensure we all are successful.&nbsp;</p><p>Check out our website for more information <a href=\"https://cloudlinux.com/\" target=\"_blank\" rel=\"nofollow noreferrer noopener\" class=\"external\">https://cloudlinux.com/</a></p><p></p><p>The <strong>Release Engineering Department</strong> plays a critical role in maintaining both external and internal infrastructure related to package repositories, with a strong focus on delivering and managing repository distribution to users. To support this mission, we are looking for a <strong>Scrum Master</strong> to join the department and help drive Agile practices across several teams.</p><p>As a<strong> Scrum Master,</strong> you will work closely with teams that contribute to the robustness and reliability of our repository infrastructure. Each team operates with different levels of autonomy and has unique workflows, so instead of applying a one-size-fits-all solution, your role will be to collaborate with teams, understand their specific challenges, and support them in continuously improving their processes. This position is key to fostering a culture of innovation, adaptability, and sustained delivery excellence within the Release Engineering Department.</p><p></p><p><strong>As our Scrum Master you will: </strong></p><ul> <li>Lead team processes enhancement using Agile and Lean principles through motivation, relationship building, and coaching.</li> <li>Mentor product owners and team leaders, while actively engaging with the product.</li> <li>Collaborate with the designated department, providing hands-on Agile coaching.</li> <li>Act as an Agile coach for the whole department, stepping into the shoes of Scrum Master for 1-2 teams.</li> <li>Facilitate gradual changes within teams, guiding them towards Agile thinking.</li> <li>Identify and address team needs and challenges, empowering them to embrace continuous improvement.</li> <li>Collaborate with the Scrum Master within the team.</li> </ul><p><strong>Requirements</strong></p><p><strong>To thrive in this role, you should possess the following: </strong></p><ul> <li>A deep understanding of Agile methodologies, especially Kanban, and knowledge of Lean &amp; DevOps principles will be an advantage. </li> <li>Proficiency in Agile coaching and facilitation, guiding teams to self-organization and high performance; facilitating continuous flow and improvement practices within a Kanban framework, including the management of workflow, work-in-progress limits, and regular cadence meetings. </li> <li>Experience in engaging with multiple stakeholders concurrently. </li> <li>Readiness to systematically guide the organization and teams through changes and enhancements. </li> <li>Ability to identify and handle conflicts before they become a hindrance to the team’s progress. </li> <li>Ability to lead by example, inspire others, and maintain a positive and productive work environment. </li> <li>An understanding of product thinking, guiding teams towards a business-oriented approach. </li> <li>Broad understanding of software development and delivery processes, including requirements definition and release processes. </li> <li>Technical background – proven experience in Software Development, QA Automation or similar.</li> </ul><p></p><p><strong>In addition, the following are essential requirements:</strong></p><ul> <li> Agile/Scrum certification. </li> <li> Proven experience in a similar role within service teams. </li> <li> Fluency in Russian. </li> <li> Upper-intermediate or higher level of English proficiency. </li> </ul><p><strong>Benefits</strong></p><p><strong>What's in it for you?</strong></p><ul> <li>A strong focus on professional development with opportunities for learning and growth.</li> <li>Engage in interesting and challenging initiatives that push your technical and analytical skills.</li> <li>Regular interaction with senior leadership, providing insights into strategic decision-making.</li> <li>Fully remote work with flexible hours, allowing you to schedule your day and work from any location worldwide.</li> <li>Paid one-month vacation per year and unlimited sick leave to ensure you maintain a healthy work-life balance.</li> <li>Medical insurance reimbursement to support your health needs.</li> <li>Co-working and gym/sports reimbursement to encourage a healthy and active lifestyle.</li> <li>The opportunity to receive a reward for the most innovative idea that the company can patent, fostering a culture of creativity and innovation.</li> </ul><p></p><p><em>By applying for this position, you consent to the processing of your personal data as described in our Privacy Policy (</em><a href=\"https://cloudlinux.com/candidate-privacy-notice\" target=\"_blank\" rel=\"nofollow noreferrer noopener\" class=\"external\"><em>https://cloudlinux.com/candidate-privacy-notice</em></a><em>), which provides detailed information on how we maintain and handle your data.</em></p>","tags":"[\"management\",\"engineering\"]","pubDate":"2025-04-01T00:00:00.000Z","link":"https://apply.workable.com/j/77EFC99D83","slug":"scrum-master-remote-only-opportunity-location-europe-cloudlinux-2885"},{"id":1536504685,"title":"Senior Python Developer (Security) (worldwide remote, work anywhere)","company":"CloudLinux","image":"https://avatars.githubusercontent.com/u/16290369?s=200&v=4","description":"<p>CloudLinux is a global remote-first company. We are driven by our principles: Do the right thing,</p><p>employees first, we are remote first, and we deliver high volume, low-cost Linux infrastructure and</p><p>security products that help companies to increase the efficiency of their operations. Every person on</p><p>our team supports each other and does what we can to ensure everyone is successful. We are truly</p><p>a great place to work. </p><p></p><p>We are looking for a talented <strong>Senior Python Developer (Security)</strong> to join our <strong>Imunify team!&nbsp;</strong></p><p></p><p>Imunify Security is an innovative security solution, powered by Artificial Intelligence for Linux</p><p>web servers. It is designed specifically for shared and VPS/Dedicated servers. The</p><p>automated, easy-to-use security solution with the six-layer approach to security delivers</p><p>comprehensive and complete attack prevention.</p><p></p><p>More details about the project can be found on the product website <a href=\"http://imunify360.com\" rel=\"nofollow noreferrer noopener\" class=\"external\">Imunify360.com</a>, and</p><p>about the company on <a href=\"http://Cloudlinux.com\" target=\"_blank\" rel=\"nofollow noreferrer noopener\" class=\"external\">CloudLinux.com</a></p><p></p><p>Join us to make a difference!</p><p></p><p><strong>As a Senior Python Developer (Security) you will:</strong></p><ul> <li>Be involved in the development of Security Heuristics (RBLs, CVEs, Threat Intelligence).</li> <li>Be involved in automating tasks for weekly reporting and measurements using Python.</li> <li>Be involved in discussions about Web Protection Techniques and Bot Protection.</li> <li>Architect the development and re-factoring of existing code.</li> <li>Cover your code with unit tests and/or functional tests.</li> <li>Write technical documentation for written code.</li> <li>Review of code written by your colleagues using Gerrit.</li> </ul><p></p><p><strong>Requirements</strong></p><ul> <li>5+ years of Python programming experience.&nbsp;</li> <li>Experience with SQL and Data Analysis is a strong plus.</li> <li>Experience with network and/or web security is a plus.</li> <li>Experience with ModSec Rules and Regular Expressions is a plus.</li> <li>Experience with Web Application Firewalls is a plus.</li> <li>Experience with Linux server administration is a plus.</li> <li>Experience with automated testing and CI/CD systems is a plus.</li> <li>Intermediate level of English language.</li> </ul><p></p><p><strong>Personal skills:</strong></p><ul> <li>Fast-learning, proactivity.</li> <li>Strong self-motivation, driven to achieve committed milestones.</li> <li>Strong prioritization skills and a flexible mindset&nbsp;</li> <li>The ability to independently analyze a task and find the right solution.</li> <li>The ability to work with vague requirements and making independent decisions</li> <li>The ability to work in a team.</li> </ul><p><strong>Benefits</strong></p><p><strong>What's in it for you?</strong></p><ul><ul> <li>A focus on professional development.</li> <li>Interesting and challenging projects.</li> <li>Fully remote work with flexible working hours, that allows you to schedule your day and work from any location worldwide.</li> <li>Paid 24 days of vacation per year, 10 days of national holidays, and unlimited sick leaves.</li> <li>Compensation for private medical insurance.</li> <li>Co-working and gym/sports reimbursement.</li> <li>Budget for education.</li> <li>The opportunity to receive a reward for the most innovative idea that the company can patent.</li> </ul></ul><p></p><p><em>By applying for this position, you consent to the processing of your personal data as described in our Privacy Policy (</em><a href=\"https://cloudlinux.com/candidate-privacy-notice\" target=\"_blank\" rel=\"nofollow noreferrer noopener\" class=\"external\"><em>https://cloudlinux.com/candidate-privacy-notice</em></a><em>), which provides detailed information on how we maintain and handle your data.</em></p>","tags":"[]","pubDate":"2025-04-01T00:00:00.000Z","link":"https://apply.workable.com/j/12424EB602","slug":"senior-python-developer-security-worldwide-remote-work-anywhere-cloudlinux-874"},{"id":7383607753,"title":"Senior Python Developer (Security) (worldwide remote, work anywhere)","company":"CloudLinux","image":"https://avatars.githubusercontent.com/u/16290369?s=200&v=4","description":"<p>CloudLinux is a global remote-first company. We are driven by our principles: Do the right thing,</p><p>employees first, we are remote first, and we deliver high volume, low-cost Linux infrastructure and</p><p>security products that help companies to increase the efficiency of their operations. Every person on</p><p>our team supports each other and does what we can to ensure everyone is successful. We are truly</p><p>a great place to work. </p><p></p><p>We are looking for a talented <strong>Senior Python Developer (Security)</strong> to join our <strong>Imunify team!&nbsp;</strong></p><p></p><p>Imunify Security is an innovative security solution, powered by Artificial Intelligence for Linux</p><p>web servers. It is designed specifically for shared and VPS/Dedicated servers. The</p><p>automated, easy-to-use security solution with the six-layer approach to security delivers</p><p>comprehensive and complete attack prevention.</p><p></p><p>More details about the project can be found on the product website <a href=\"http://imunify360.com\" rel=\"nofollow noreferrer noopener\" class=\"external\">Imunify360.com</a>, and</p><p>about the company on <a href=\"http://Cloudlinux.com\" target=\"_blank\" rel=\"nofollow noreferrer noopener\" class=\"external\">CloudLinux.com</a></p><p></p><p>Join us to make a difference!</p><p></p><p><strong>As a Senior Python Developer (Security) you will:</strong></p><ul> <li>Be involved in the development of Security Heuristics (RBLs, CVEs, Threat Intelligence).</li> <li>Be involved in automating tasks for weekly reporting and measurements using Python.</li> <li>Be involved in discussions about Web Protection Techniques and Bot Protection.</li> <li>Architect the development and re-factoring of existing code.</li> <li>Cover your code with unit tests and/or functional tests.</li> <li>Write technical documentation for written code.</li> <li>Review of code written by your colleagues using Gerrit.</li> </ul><p></p><p><strong>Requirements</strong></p><ul> <li>5+ years of Python programming experience.&nbsp;</li> <li>Experience with SQL and Data Analysis is a strong plus.</li> <li>Experience with network and/or web security is a plus.</li> <li>Experience with ModSec Rules and Regular Expressions is a plus.</li> <li>Experience with Web Application Firewalls is a plus.</li> <li>Experience with Linux server administration is a plus.</li> <li>Experience with automated testing and CI/CD systems is a plus.</li> <li>Intermediate level of English language.</li> </ul><p></p><p><strong>Personal skills:</strong></p><ul> <li>Fast-learning, proactivity.</li> <li>Strong self-motivation, driven to achieve committed milestones.</li> <li>Strong prioritization skills and a flexible mindset&nbsp;</li> <li>The ability to independently analyze a task and find the right solution.</li> <li>The ability to work with vague requirements and making independent decisions</li> <li>The ability to work in a team.</li> </ul><p><strong>Benefits</strong></p><p><strong>What's in it for you?</strong></p><ul><ul> <li>A focus on professional development.</li> <li>Interesting and challenging projects.</li> <li>Fully remote work with flexible working hours, that allows you to schedule your day and work from any location worldwide.</li> <li>Paid 24 days of vacation per year, 10 days of national holidays, and unlimited sick leaves.</li> <li>Compensation for private medical insurance.</li> <li>Co-working and gym/sports reimbursement.</li> <li>Budget for education.</li> <li>The opportunity to receive a reward for the most innovative idea that the company can patent.</li> </ul></ul><p></p><p><em>By applying for this position, you consent to the processing of your personal data as described in our Privacy Policy (</em><a href=\"https://cloudlinux.com/candidate-privacy-notice\" target=\"_blank\" rel=\"nofollow noreferrer noopener\" class=\"external\"><em>https://cloudlinux.com/candidate-privacy-notice</em></a><em>), which provides detailed information on how we maintain and handle your data.</em></p>","tags":"[]","pubDate":"2025-04-01T00:00:00.000Z","link":"https://apply.workable.com/j/12424EB602","slug":"senior-python-developer-security-worldwide-remote-work-anywhere-cloudlinux-6481"},{"id":4779603166,"title":"Senior Python Developer (Security) (worldwide remote, work anywhere)","company":"CloudLinux","image":"https://avatars.githubusercontent.com/u/16290369?s=200&v=4","description":"<p>CloudLinux is a global remote-first company. We are driven by our principles: Do the right thing,</p><p>employees first, we are remote first, and we deliver high volume, low-cost Linux infrastructure and</p><p>security products that help companies to increase the efficiency of their operations. Every person on</p><p>our team supports each other and does what we can to ensure everyone is successful. We are truly</p><p>a great place to work. </p><p></p><p>We are looking for a talented <strong>Senior Python Developer (Security)</strong> to join our <strong>Imunify team!&nbsp;</strong></p><p></p><p>Imunify Security is an innovative security solution, powered by Artificial Intelligence for Linux</p><p>web servers. It is designed specifically for shared and VPS/Dedicated servers. The</p><p>automated, easy-to-use security solution with the six-layer approach to security delivers</p><p>comprehensive and complete attack prevention.</p><p></p><p>More details about the project can be found on the product website <a href=\"http://imunify360.com\" rel=\"nofollow noreferrer noopener\" class=\"external\">Imunify360.com</a>, and</p><p>about the company on <a href=\"http://Cloudlinux.com\" target=\"_blank\" rel=\"nofollow noreferrer noopener\" class=\"external\">CloudLinux.com</a></p><p></p><p>Join us to make a difference!</p><p></p><p><strong>As a Senior Python Developer (Security) you will:</strong></p><ul> <li>Be involved in the development of Security Heuristics (RBLs, CVEs, Threat Intelligence).</li> <li>Be involved in automating tasks for weekly reporting and measurements using Python.</li> <li>Be involved in discussions about Web Protection Techniques and Bot Protection.</li> <li>Architect the development and re-factoring of existing code.</li> <li>Cover your code with unit tests and/or functional tests.</li> <li>Write technical documentation for written code.</li> <li>Review of code written by your colleagues using Gerrit.</li> </ul><p></p><p><strong>Requirements</strong></p><ul> <li>5+ years of Python programming experience.&nbsp;</li> <li>Experience with SQL and Data Analysis is a strong plus.</li> <li>Experience with network and/or web security is a plus.</li> <li>Experience with ModSec Rules and Regular Expressions is a plus.</li> <li>Experience with Web Application Firewalls is a plus.</li> <li>Experience with Linux server administration is a plus.</li> <li>Experience with automated testing and CI/CD systems is a plus.</li> <li>Intermediate level of English language.</li> </ul><p></p><p><strong>Personal skills:</strong></p><ul> <li>Fast-learning, proactivity.</li> <li>Strong self-motivation, driven to achieve committed milestones.</li> <li>Strong prioritization skills and a flexible mindset&nbsp;</li> <li>The ability to independently analyze a task and find the right solution.</li> <li>The ability to work with vague requirements and making independent decisions</li> <li>The ability to work in a team.</li> </ul><p><strong>Benefits</strong></p><p><strong>What's in it for you?</strong></p><ul><ul> <li>A focus on professional development.</li> <li>Interesting and challenging projects.</li> <li>Fully remote work with flexible working hours, that allows you to schedule your day and work from any location worldwide.</li> <li>Paid 24 days of vacation per year, 10 days of national holidays, and unlimited sick leaves.</li> <li>Compensation for private medical insurance.</li> <li>Co-working and gym/sports reimbursement.</li> <li>Budget for education.</li> <li>The opportunity to receive a reward for the most innovative idea that the company can patent.</li> </ul></ul><p></p><p><em>By applying for this position, you consent to the processing of your personal data as described in our Privacy Policy (</em><a href=\"https://cloudlinux.com/candidate-privacy-notice\" target=\"_blank\" rel=\"nofollow noreferrer noopener\" class=\"external\"><em>https://cloudlinux.com/candidate-privacy-notice</em></a><em>), which provides detailed information on how we maintain and handle your data.</em></p>","tags":"[]","pubDate":"2025-04-01T00:00:00.000Z","link":"https://apply.workable.com/j/12424EB602","slug":"senior-python-developer-security-worldwide-remote-work-anywhere-cloudlinux-6469"},{"id":3664119685,"title":"Senior Python Developer (Security) (worldwide remote, work anywhere)","company":"CloudLinux","image":"https://avatars.githubusercontent.com/u/16290369?s=200&v=4","description":"<p>CloudLinux is a global remote-first company. We are driven by our principles: Do the right thing,</p><p>employees first, we are remote first, and we deliver high volume, low-cost Linux infrastructure and</p><p>security products that help companies to increase the efficiency of their operations. Every person on</p><p>our team supports each other and does what we can to ensure everyone is successful. We are truly</p><p>a great place to work. </p><p></p><p>We are looking for a talented <strong>Senior Python Developer (Security)</strong> to join our <strong>Imunify team!&nbsp;</strong></p><p></p><p>Imunify Security is an innovative security solution, powered by Artificial Intelligence for Linux</p><p>web servers. It is designed specifically for shared and VPS/Dedicated servers. The</p><p>automated, easy-to-use security solution with the six-layer approach to security delivers</p><p>comprehensive and complete attack prevention.</p><p></p><p>More details about the project can be found on the product website <a href=\"http://imunify360.com\" rel=\"nofollow noreferrer noopener\" class=\"external\">Imunify360.com</a>, and</p><p>about the company on <a href=\"http://Cloudlinux.com\" target=\"_blank\" rel=\"nofollow noreferrer noopener\" class=\"external\">CloudLinux.com</a></p><p></p><p>Join us to make a difference!</p><p></p><p><strong>As a Senior Python Developer (Security) you will:</strong></p><ul> <li>Be involved in the development of Security Heuristics (RBLs, CVEs, Threat Intelligence).</li> <li>Be involved in automating tasks for weekly reporting and measurements using Python.</li> <li>Be involved in discussions about Web Protection Techniques and Bot Protection.</li> <li>Architect the development and re-factoring of existing code.</li> <li>Cover your code with unit tests and/or functional tests.</li> <li>Write technical documentation for written code.</li> <li>Review of code written by your colleagues using Gerrit.</li> </ul><p></p><p><strong>Requirements</strong></p><ul> <li>5+ years of Python programming experience.&nbsp;</li> <li>Experience with SQL and Data Analysis is a strong plus.</li> <li>Experience with network and/or web security is a plus.</li> <li>Experience with ModSec Rules and Regular Expressions is a plus.</li> <li>Experience with Web Application Firewalls is a plus.</li> <li>Experience with Linux server administration is a plus.</li> <li>Experience with automated testing and CI/CD systems is a plus.</li> <li>Intermediate level of English language.</li> </ul><p></p><p><strong>Personal skills:</strong></p><ul> <li>Fast-learning, proactivity.</li> <li>Strong self-motivation, driven to achieve committed milestones.</li> <li>Strong prioritization skills and a flexible mindset&nbsp;</li> <li>The ability to independently analyze a task and find the right solution.</li> <li>The ability to work with vague requirements and making independent decisions</li> <li>The ability to work in a team.</li> </ul><p><strong>Benefits</strong></p><p><strong>What's in it for you?</strong></p><ul><ul> <li>A focus on professional development.</li> <li>Interesting and challenging projects.</li> <li>Fully remote work with flexible working hours, that allows you to schedule your day and work from any location worldwide.</li> <li>Paid 24 days of vacation per year, 10 days of national holidays, and unlimited sick leaves.</li> <li>Compensation for private medical insurance.</li> <li>Co-working and gym/sports reimbursement.</li> <li>Budget for education.</li> <li>The opportunity to receive a reward for the most innovative idea that the company can patent.</li> </ul></ul><p></p><p><em>By applying for this position, you consent to the processing of your personal data as described in our Privacy Policy (</em><a href=\"https://cloudlinux.com/candidate-privacy-notice\" target=\"_blank\" rel=\"nofollow noreferrer noopener\" class=\"external\"><em>https://cloudlinux.com/candidate-privacy-notice</em></a><em>), which provides detailed information on how we maintain and handle your data.</em></p>","tags":"[]","pubDate":"2025-04-01T00:00:00.000Z","link":"https://apply.workable.com/j/12424EB602","slug":"senior-python-developer-security-worldwide-remote-work-anywhere-cloudlinux-2236"},{"id":3895751613,"title":"Senior Python Developer (Security) (worldwide remote, work anywhere)","company":"CloudLinux","image":"https://avatars.githubusercontent.com/u/16290369?s=200&v=4","description":"<p>CloudLinux is a global remote-first company. We are driven by our principles: Do the right thing,</p><p>employees first, we are remote first, and we deliver high volume, low-cost Linux infrastructure and</p><p>security products that help companies to increase the efficiency of their operations. Every person on</p><p>our team supports each other and does what we can to ensure everyone is successful. We are truly</p><p>a great place to work. </p><p></p><p>We are looking for a talented <strong>Senior Python Developer (Security)</strong> to join our <strong>Imunify team!&nbsp;</strong></p><p></p><p>Imunify Security is an innovative security solution, powered by Artificial Intelligence for Linux</p><p>web servers. It is designed specifically for shared and VPS/Dedicated servers. The</p><p>automated, easy-to-use security solution with the six-layer approach to security delivers</p><p>comprehensive and complete attack prevention.</p><p></p><p>More details about the project can be found on the product website <a href=\"http://imunify360.com\" rel=\"nofollow noreferrer noopener\" class=\"external\">Imunify360.com</a>, and</p><p>about the company on <a href=\"http://Cloudlinux.com\" target=\"_blank\" rel=\"nofollow noreferrer noopener\" class=\"external\">CloudLinux.com</a></p><p></p><p>Join us to make a difference!</p><p></p><p><strong>As a Senior Python Developer (Security) you will:</strong></p><ul> <li>Be involved in the development of Security Heuristics (RBLs, CVEs, Threat Intelligence).</li> <li>Be involved in automating tasks for weekly reporting and measurements using Python.</li> <li>Be involved in discussions about Web Protection Techniques and Bot Protection.</li> <li>Architect the development and re-factoring of existing code.</li> <li>Cover your code with unit tests and/or functional tests.</li> <li>Write technical documentation for written code.</li> <li>Review of code written by your colleagues using Gerrit.</li> </ul><p></p><p><strong>Requirements</strong></p><ul> <li>5+ years of Python programming experience.&nbsp;</li> <li>Experience with SQL and Data Analysis is a strong plus.</li> <li>Experience with network and/or web security is a plus.</li> <li>Experience with ModSec Rules and Regular Expressions is a plus.</li> <li>Experience with Web Application Firewalls is a plus.</li> <li>Experience with Linux server administration is a plus.</li> <li>Experience with automated testing and CI/CD systems is a plus.</li> <li>Intermediate level of English language.</li> </ul><p></p><p><strong>Personal skills:</strong></p><ul> <li>Fast-learning, proactivity.</li> <li>Strong self-motivation, driven to achieve committed milestones.</li> <li>Strong prioritization skills and a flexible mindset&nbsp;</li> <li>The ability to independently analyze a task and find the right solution.</li> <li>The ability to work with vague requirements and making independent decisions</li> <li>The ability to work in a team.</li> </ul><p><strong>Benefits</strong></p><p><strong>What's in it for you?</strong></p><ul><ul> <li>A focus on professional development.</li> <li>Interesting and challenging projects.</li> <li>Fully remote work with flexible working hours, that allows you to schedule your day and work from any location worldwide.</li> <li>Paid 24 days of vacation per year, 10 days of national holidays, and unlimited sick leaves.</li> <li>Compensation for private medical insurance.</li> <li>Co-working and gym/sports reimbursement.</li> <li>Budget for education.</li> <li>The opportunity to receive a reward for the most innovative idea that the company can patent.</li> </ul></ul><p></p><p><em>By applying for this position, you consent to the processing of your personal data as described in our Privacy Policy (</em><a href=\"https://cloudlinux.com/candidate-privacy-notice\" target=\"_blank\" rel=\"nofollow noreferrer noopener\" class=\"external\"><em>https://cloudlinux.com/candidate-privacy-notice</em></a><em>), which provides detailed information on how we maintain and handle your data.</em></p>","tags":"[]","pubDate":"2025-04-01T00:00:00.000Z","link":"https://apply.workable.com/j/12424EB602","slug":"senior-python-developer-security-worldwide-remote-work-anywhere-cloudlinux-7863"},{"id":1431096066,"title":"Senior Marketing Analyst / Data Scientist","company":"Appquantum","image":"https://remotive.com/job/1991412/logo","description":"<div><!--block-->We are building a marketing analytics team within our marketing department. The tracking and analytics systems are already in place, the necessary tools have been set up, and our marketing team is actively running numerous ad campaigns across various acquisition platforms.<br><br></div><div><!--block-->Now, we’re looking for a skilled <strong>Data Scientist</strong> to join our team! We need someone who will bridge the gap between the business side and the predictive modeling development team, working at the intersection of marketing, analytics, and data science to create accurate predictive models and optimize traffic acquisition.<br><br></div><div><!--block--><br></div><br><br><div class=\"h3\">Key Responsibilities</div><ul style=\"\"><li style=\"\"><!--block-->Develop technical specifications for the DS team to create models</li><li style=\"\"><!--block-->Validate and implement developed predictive models</li><li style=\"\"><!--block-->Use model results to optimize marketing traffic acquisition</li><li style=\"\"><!--block-->Automate predicting and analytical reporting to streamline the work of marketing teams</li><li style=\"\"><!--block-->Actively communicate with both product and marketing teams</li><li style=\"\"><!--block-->Break down business needs regarding predictive models into technical requirements</li></ul><br><br><div class=\"h3\">Skills, Knowledge and Expertise</div><ul style=\"\"><li style=\"\"><!--block-->Over 2 years of experience in analytics</li><li style=\"\"><!--block-->More than 1 year of experience in applying predictive models, machine learning, and data science techniques</li><li style=\"\"><!--block-->Proficiency in SQL and Python at an intermediate level or higher</li><li style=\"\"><!--block-->Experience building and automating analytical reports and plan-fact analysis, working with large datasets in Google Sheets and Excel</li><li style=\"\"><!--block-->A product-oriented, user-friendly approach to working with business teams</li><li style=\"\"><!--block-->Independent experience developing machine learning and data science models</li><li style=\"\"><!--block-->Experience with Git and Airflow</li><li style=\"\"><!--block-->Knowledge of key mobile marketing acquisition channels</li><li style=\"\"><!--block-->Familiarity with mobile analytics tools</li><li style=\"\"><!--block-->Previous professional experience in the game development industry</li></ul><br><br><div class=\"h3\">Benefits</div><ul style=\"\"><li style=\"\"><!--block-->Flexible work environment: work remotely from home, in our office in Cyprus</li><li style=\"\"><!--block-->Paid holidays and sick leave to prioritize your health and well-being</li><li style=\"\"><!--block-->Competitive salary based on interview results and annual performance reviews</li><li style=\"\"><!--block-->Bonus system tied to the company's success and performance</li><li style=\"\"><!--block-->Opportunities to attend conferences, workshops, and meetups</li><li style=\"\"><!--block-->English classes</li><li style=\"\"><!--block-->Cool corporate parties and team-building events</li><li style=\"\"><!--block-->Holiday Gifts: celebrate special occasions with thoughtful holiday gifts from the company</li><li style=\"\"><!--block-->Free lunches in our offices: enjoy a pleasant time over a meal with your colleagues</li></ul><div class=\"h3\"><!--block--><strong>Join AppQuantum, and let’s have an incredible journey together!</strong></div><img src=\"https://remotive.com/job/track/1991412/blank.gif?source=public_api\" alt=\"\"/>","tags":"[\"data science\",\"python\",\"sql\"]","pubDate":"2025-03-31T12:51:19.000Z","link":"https://remotive.com/remote-jobs/data/senior-marketing-analyst-data-scientist-1991412","slug":"senior-marketing-analyst-data-scientist-appquantum-5171"}]