[{"id":6160755603,"title":"Software Engineer, Clients (Javascript) ","company":"Livekit","image":"https://avatars.githubusercontent.com/u/69438833?s=200&v=4","description":"<p style=\"min-height:1.5em\">At LiveKit, we build open-source APIs to power the future of computing. We are a company of engineers building software stacks for other engineers.</p><p style=\"min-height:1.5em\"></p><h2><strong>You'll thrive at LiveKit if you:</strong></h2><ul style=\"min-height:1.5em\"><li><p style=\"min-height:1.5em\">obsess with crafting code that is fast, reliable and practical for the problem</p></li><li><p style=\"min-height:1.5em\">are known as the go-to person for tackling tough technical problems</p></li><li><p style=\"min-height:1.5em\">work hard and can both build <em>and</em> ship fast</p></li><li><p style=\"min-height:1.5em\">can clearly explain complex technical concepts to others</p></li><li><p style=\"min-height:1.5em\">are a fast learner, frequently picking up new languages and tools</p></li></ul><p style=\"min-height:1.5em\">The best way to impress us is with thoughtful Issues and/or PRs on our Github repos 😊</p><p style=\"min-height:1.5em\"></p><h2>About This Role:</h2><p style=\"min-height:1.5em\">We are hiring an exceptional web engineer to contribute to our open-source SDKs, component libraries, and template apps for JavaScript, React, and Node.js. You will drive constant improvement and innovation to make LiveKit the most intuitive and powerful platform to deploy realtime and voice AI on any device with a web browser.</p><p style=\"min-height:1.5em\"></p><h2>What You’ll Do:</h2><ul style=\"min-height:1.5em\"><li><p style=\"min-height:1.5em\">Core feature development and maintenance of open source WebRTC-based SDKs for JavaScript, Node.js, React, and React Native</p></li><li><p style=\"min-height:1.5em\">Work closely with the Agents team to bring realtime AI features to life from Node.js and Python through to the web browser</p></li><li><p style=\"min-height:1.5em\">Work with the design team to develop and deploy high-quality sample apps and templates that showcase the power of LiveKit and the potential of realtime AI</p></li><li><p style=\"min-height:1.5em\">Constantly refine and improve the developer experience of building realtime AI apps with the LiveKit SDKs</p></li><li><p style=\"min-height:1.5em\">Identify, prioritize, design, and develop new features and capabilities for the SDKs in collaboration with other engineers in the Client team and across the company</p></li></ul><p style=\"min-height:1.5em\"></p><h2>Who You Are:</h2><ul style=\"min-height:1.5em\"><li><p style=\"min-height:1.5em\">An expert JavaScript, TypeScript, Node.js, and/or React engineer with significant real-world experience building for the web</p></li><li><p style=\"min-height:1.5em\">Passionate about building open source web software that works across browsers, devices, languages, and more</p></li><li><p style=\"min-height:1.5em\">Excited to partner with other developers both inside and outside the company to make hard technical problems easy for anyone to solve</p></li><li><p style=\"min-height:1.5em\">Bonus: You are a generalist engineer interested in digging in to Python, Rust, Swift, Kotlin, C#, C++, and other languages as you design and deliver new projects</p></li></ul><p style=\"min-height:1.5em\"></p><h1><strong>Our Commitments to You</strong></h1><h2><strong>We offer</strong></h2><ul style=\"min-height:1.5em\"><li><p style=\"min-height:1.5em\">An opportunity to build something truly impactful to the world</p></li><li><p style=\"min-height:1.5em\">Contribute to open source alongside world-class engineers</p></li><li><p style=\"min-height:1.5em\">Competitive salary and equity package</p></li><li><p style=\"min-height:1.5em\">Work anywhere in the world</p></li><li><p style=\"min-height:1.5em\">Health, dental, and vision benefits</p></li><li><p style=\"min-height:1.5em\">Flexible vacation policy</p></li></ul>","tags":"[\"javascript\",\"typescript\"]","pubDate":"2025-05-13T23:38:47.014Z","link":"https://jobs.ashbyhq.com/livekit/0744f8cf-9922-43ec-ac80-39d3478ce320","slug":"software-engineer-clients-javascript-livekit-7034"},{"id":4035066909,"title":"VP of Marketing and Growth","company":"10up","image":"https://pbs.twimg.com/profile_images/2738508979/760be3edebfa0195e36fb3dba07297c1_400x400.png","description":"&lt;p&gt;&lt;strong&gt;Location:&lt;/strong&gt;&amp;nbsp;Remote – US (Open to applicants located in the USA)&lt;/p&gt;\n&lt;p&gt;Fueled is a leading digital strategy, design, and engineering agency. Recently united with 10up – &lt;a href=&quot;https://10up.com/blog/2025/new-fueled-brand-10up-becomes-wordpress-practice/&quot;&gt;now the brand of our WordPress practice&lt;/a&gt; – we are a 300+ person team that has designed and built hundreds of digital products and experiences for brands like Google, Apple, The New York Times, ESPN, Victoria’s Secret, MGM Resorts, Albertsons, and CLEAR.&lt;/p&gt;\n&lt;p&gt;&lt;span style=&quot;font-weight: 400;&quot;&gt;As a growing force in the digital services space, we’re building a brand that resonates, a growth engine that converts, and a team that scales impact. We&#39;re looking for a strategic and action-oriented &lt;strong&gt;VP, Marketing &amp;amp; Growth&lt;/strong&gt; to lead our full-funnel growth function from first impression to forming a long-term relationship.&amp;nbsp; This role is pivotal in strengthening our voice in the market, fueling demand, supporting conversion and enabling client retention and expansion.&amp;nbsp;&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span style=&quot;font-weight: 400;&quot;&gt;Sitting at the intersection of marketing, brand, content, and revenue, this role partners cross-functionally with Product, Strategy, Client Services, and Executive Leadership to align messaging with motion, attention with action, and storytelling with sales. You’ll shape how we show up, what we say, and how we grow.&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span style=&quot;font-weight: 400;&quot;&gt;With a sharp understanding of modern marketing infrastructure, a love for compelling narratives, and a metrics-driven mindset, you’ll help us grow our brand—and our business.&lt;/span&gt;&lt;/p&gt;\n&lt;h2&gt;&lt;strong&gt;What you will do:&lt;/strong&gt;&lt;/h2&gt;\n&lt;ul&gt;\n&lt;li&gt;&lt;strong&gt;Elevate the Brand:&lt;/strong&gt;&lt;span style=&quot;font-weight: 400;&quot;&gt; Define and evolve our brand positioning, voice, and visual identity. Champion our story in a way that resonates with ideal customers and amplifies market presence.&lt;/span&gt;&lt;span style=&quot;font-weight: 400;&quot;&gt;&lt;br&gt;&lt;/span&gt;&lt;/li&gt;\n&lt;li&gt;&lt;strong&gt;Own Full-Funnel Marketing:&lt;/strong&gt;&lt;span style=&quot;font-weight: 400;&quot;&gt; Lead integrated strategies across paid, earned, and owned channels, brand campaigns, performance marketing, email, events, and more, to drive awareness, engagement, and conversion.&lt;/span&gt;&lt;span style=&quot;font-weight: 400;&quot;&gt;&lt;br&gt;&lt;/span&gt;&lt;/li&gt;\n&lt;li&gt;&lt;strong&gt;Drive Demand and Acquisition:&lt;/strong&gt;&lt;span style=&quot;font-weight: 400;&quot;&gt; Launch always-on and campaign-based programs that attract, nurture, and convert the right audiences into pipeline and revenue.&lt;/span&gt;&lt;span style=&quot;font-weight: 400;&quot;&gt;&lt;br&gt;&lt;/span&gt;&lt;/li&gt;\n&lt;li&gt;&lt;strong&gt;Activate GTM Collaboration:&lt;/strong&gt;&lt;span style=&quot;font-weight: 400;&quot;&gt; Partner closely with business development and GTM teams to craft sequenced, personalized marketing plays that accelerate sales momentum and nurture prospects.&lt;/span&gt;&lt;span style=&quot;font-weight: 400;&quot;&gt;&lt;br&gt;&lt;/span&gt;&lt;/li&gt;\n&lt;li&gt;&lt;strong&gt;Build Thought Leadership &amp;amp; Content:&lt;/strong&gt;&lt;span style=&quot;font-weight: 400;&quot;&gt; Oversee the development of strategic content and enablement tools, from white papers to case studies that support both credibility and conversion.&lt;/span&gt;&lt;span style=&quot;font-weight: 400;&quot;&gt;&lt;br&gt;&lt;/span&gt;&lt;/li&gt;\n&lt;li&gt;&lt;strong&gt;Refine ICP and Messaging:&lt;/strong&gt;&lt;span style=&quot;font-weight: 400;&quot;&gt; Define and continuously evolve our Ideal Customer Profile (ICP), building segment-specific messaging that speaks to value and need.&lt;/span&gt;&lt;span style=&quot;font-weight: 400;&quot;&gt;&lt;br&gt;&lt;/span&gt;&lt;/li&gt;\n&lt;li&gt;&lt;strong&gt;Modernize Marketing Infrastructure:&lt;/strong&gt;&lt;span style=&quot;font-weight: 400;&quot;&gt; Select and optimize tools for campaign execution, data enrichment, analytics, and personalization, bringing scale and precision to every motion.&lt;/span&gt;&lt;span style=&quot;font-weight: 400;&quot;&gt;&lt;br&gt;&lt;/span&gt;&lt;/li&gt;\n&lt;li&gt;&lt;strong&gt;Expand Ecosystem Influence:&lt;/strong&gt;&lt;span style=&quot;font-weight: 400;&quot;&gt; Cultivate relationships with analysts, partners, and collaborators who amplify our brand and enhance inbound quality.&lt;/span&gt;&lt;span style=&quot;font-weight: 400;&quot;&gt;&lt;br&gt;&lt;/span&gt;&lt;/li&gt;\n&lt;li&gt;&lt;strong&gt;Co-Own Pipeline and Revenue Targets:&lt;/strong&gt;&lt;span style=&quot;font-weight: 400;&quot;&gt; Partner with sales leadership to track performance, optimize marketing contribution, and align on accountability for bottom-line impact.&lt;/span&gt;&lt;span style=&quot;font-weight: 400;&quot;&gt;&lt;br&gt;&lt;/span&gt;&lt;/li&gt;\n&lt;li&gt;&lt;strong&gt;Lead and Inspire a High-Performing Team:&lt;/strong&gt;&lt;span style=&quot;font-weight: 400;&quot;&gt; Guide a multidisciplinary team of marketers and business developers. Foster a culture of curiosity, experimentation, and results.&lt;/span&gt;&lt;/li&gt;\n&lt;/ul&gt;\n&lt;h2&gt;&lt;strong&gt;About you:&lt;/strong&gt;&lt;/h2&gt;\n&lt;ul&gt;\n&lt;li style=&quot;font-weight: 400;&quot;&gt;&lt;span style=&quot;font-weight: 400;&quot;&gt;You bring 10+ years of marketing, business development, or growth leadership experience, ideally in digital agencies, consultancies, or productized services environments.&lt;/span&gt;&lt;span style=&quot;font-weight: 400;&quot;&gt;&lt;br&gt;&lt;/span&gt;&lt;/li&gt;\n&lt;li style=&quot;font-weight: 400;&quot;&gt;&lt;span style=&quot;font-weight: 400;&quot;&gt;You have a proven track record of building integrated marketing programs that generate brand awareness, demand, and qualified pipeline.&lt;/span&gt;&lt;span style=&quot;font-weight: 400;&quot;&gt;&lt;br&gt;&lt;/span&gt;&lt;/li&gt;\n&lt;li style=&quot;font-weight: 400;&quot;&gt;&lt;span style=&quot;font-weight: 400;&quot;&gt;You think across the funnel, comfortable working in brand strategy one day and performance metrics the next. Content, campaign orchestration, and digital media are in your wheelhouse.&lt;/span&gt;&lt;span style=&quot;font-weight: 400;&quot;&gt;&lt;br&gt;&lt;/span&gt;&lt;/li&gt;\n&lt;li style=&quot;font-weight: 400;&quot;&gt;&lt;span style=&quot;font-weight: 400;&quot;&gt;You’re a collaborative operator who thrives in cross-functional environments. You’ve partnered closely with product, strategy, and client service teams to drive aligned growth outcomes.&lt;/span&gt;&lt;span style=&quot;font-weight: 400;&quot;&gt;&lt;br&gt;&lt;/span&gt;&lt;/li&gt;\n&lt;li style=&quot;font-weight: 400;&quot;&gt;&lt;span style=&quot;font-weight: 400;&quot;&gt;You’re fluent in modern marketing stacks and tools—including AI-enhanced platforms that support personalization, automation, targeting, and reporting.&lt;/span&gt;&lt;span style=&quot;font-weight: 400;&quot;&gt;&lt;br&gt;&lt;/span&gt;&lt;/li&gt;\n&lt;li style=&quot;font-weight: 400;&quot;&gt;&lt;span style=&quot;font-weight: 400;&quot;&gt;You’re a compelling communicator who understands how to craft a message, influence stakeholders, and rally a team around a shared vision.&lt;/span&gt;&lt;span style=&quot;font-weight: 400;&quot;&gt;&lt;br&gt;&lt;/span&gt;&lt;/li&gt;\n&lt;li style=&quot;font-weight: 400;&quot;&gt;&lt;span style=&quot;font-weight: 400;&quot;&gt;You’re detail-oriented, metrics-focused, and excited by the opportunity to scale fast with clarity and accountability.&lt;/span&gt;&lt;/li&gt;\n&lt;/ul&gt;\n&lt;h2&gt;&lt;strong&gt;Benefits &amp;amp; Salary&amp;nbsp;&lt;br&gt;&lt;/strong&gt;&lt;/h2&gt;\n&lt;p&gt;&lt;span style=&quot;font-weight: 400;&quot;&gt;Competitive salary and benefits. Compensation is determined based on a variety of factors including relevant experience, other job-related qualifications, geographic location, and business needs.&lt;/span&gt;&lt;/p&gt;\n&lt;h2&gt;&lt;strong&gt;Join our Team! &lt;/strong&gt;&lt;/h2&gt;\n&lt;div&gt;\n&lt;p&gt;If you are passionate about Fueled&#39;s mission and think you have what it takes to be successful in this role, even if you don&#39;t check all the boxes - please apply. We&#39;d appreciate the opportunity to personally review your application. Everyone gets a response.&lt;/p&gt;\n \n&lt;p&gt;Any data provided will be processed in accordance with applicable law and our&amp;nbsp;&lt;a href=&quot;https://fueled.com/privacy-policy/&quot; target=&quot;_blank&quot;&gt;privacy policy&lt;/a&gt;. Curious about what to expect during our talent process? Check it out&amp;nbsp;&lt;a href=&quot;https://www.notion.so/fueled/What-to-Expect-from-the-Interview-Process-at-Fueled-1d84dccd9d8b80f8a0b0d40b244f4caf?pvs=4&quot; target=&quot;_blank&quot;&gt;here&lt;/a&gt;.&lt;/p&gt;\n&lt;/div&gt;","tags":"[\"engineering\"]","pubDate":"2025-05-13T23:22:22.000Z","link":"https://job-boards.greenhouse.io/10up/jobs/4647758008","slug":"vp-of-marketing-and-growth-10up-522"},{"id":3953351111,"title":"Director of Product","company":"10up","image":"https://pbs.twimg.com/profile_images/2738508979/760be3edebfa0195e36fb3dba07297c1_400x400.png","description":"&lt;p&gt;&lt;strong&gt;Location:&amp;nbsp;&lt;/strong&gt;Remote – Anywhere&amp;nbsp;(Open to applicants located anywhere aligned with the Americas time zones)&lt;/p&gt;\n&lt;p&gt;Fueled is a leading digital strategy, design, and engineering agency. Recently united with 10up – &lt;a href=&quot;https://10up.com/blog/2025/new-fueled-brand-10up-becomes-wordpress-practice/&quot;&gt;now the brand of our WordPress practice&lt;/a&gt; – we are a 300+ person team that has designed and built hundreds of digital products and experiences for brands like Google, Apple, The New York Times, ESPN, Victoria’s Secret, MGM Resorts, Albertsons, and CLEAR.&lt;/p&gt;\n&lt;p&gt;We’re looking for an experienced &lt;strong&gt;Director of Product &lt;/strong&gt;to lead and scale our Product Management team, process, and practice. This critical role will be responsible for shaping the services and solutions we leverage to define, build, and grow digital experiences for our clients. This role entails a mix of leadership, management, and craft ownership on our most complex client engagements.&lt;/p&gt;\n&lt;h2&gt;What you will do:&lt;/h2&gt;\n&lt;ul&gt;\n&lt;li&gt;Serve as the owner of Fueled’s Product Management services and solutions. Establish and maintain best practices, and ensure that process, methodologies, and tooling are constantly refined to best meet the needs of our clients.&lt;/li&gt;\n&lt;li&gt;Drive AI adoption by championing its practical application—identifying opportunities to create efficiencies, unlock new capabilities, and fundamentally shift how we approach product delivery for ourselves and our clients.&lt;/li&gt;\n&lt;li&gt;Oversee (and be accountable for) our output and quality of delivery on client engagements at every stage of the project lifecycle. Ensure that all products we create are well architected and produce real end-user value.&lt;/li&gt;\n&lt;li&gt;Build, mentor, and manage a growing team of high-performing Product Management practitioners. Work with our Resourcing Manager to most effectively allocate the team’s time.&lt;/li&gt;\n&lt;li&gt;Provide strategic oversight and guidance for Product Management practitioners on projects, and support execution as necessary.&lt;/li&gt;\n&lt;li&gt;Establish, operationalize, and own internal initiatives to better define, position, and socialize Product Management as a capability at Fueled (both internally and externally).&lt;/li&gt;\n&lt;li&gt;Stay current on industry trends and ensure our services and solutions are modern, innovative, and ahead of the curve relative to our competitors.&lt;/li&gt;\n&lt;li&gt;Work with Delivery leads to maintain appropriate staffing levels and utilization. Support the allocation of Product Management resources to different engagements and initiatives.&lt;/li&gt;\n&lt;li&gt;Collaborate with Technology and Design leadership to foster synergy and collaboration across the broader strategy practice.&lt;/li&gt;\n&lt;li&gt;Represent Fueled’s Product practice externally at conferences, events, and speaking engagements.&lt;/li&gt;\n&lt;li&gt;Support our Sales and Marketing teams in pitching and positioning our services and solutions to prospective clients (and the world!).&lt;/li&gt;\n&lt;/ul&gt;\n&lt;h2&gt;&lt;span class=&quot;notion-enable-hover&quot; data-token-index=&quot;0&quot;&gt;About you:&lt;/span&gt;&lt;/h2&gt;\n&lt;ul&gt;\n&lt;li&gt;You have 10+ years of experience in digital Product Management, preferably in an agency setting.&lt;/li&gt;\n&lt;li&gt;You have 3+ years of management experience, with a proven track record of leading Product Management teams.&lt;/li&gt;\n&lt;li&gt;You have deep expertise in Product Management methodologies and best practices.&lt;/li&gt;\n&lt;li&gt;You have a strong understanding of research and design principles for creating intuitive and user-friendly digital experiences, and demonstrated experience in doing so for mobile apps and websites.&lt;/li&gt;\n&lt;li&gt;You&#39;ve developed a deep foundational knowledge of a technology, web, and mobile to the extent that most client questions can be answered without consulting an engineer.&lt;/li&gt;\n&lt;li&gt;You have a strategic understanding of large scale content-heavy digital experiences and the role of content strategy in ensuring success of such projects.&lt;/li&gt;\n&lt;li&gt;You have excellent communication, presentation, and interpersonal skills with the ability to influence executive-level stakeholders and manage client relationships.&lt;/li&gt;\n&lt;li&gt;You are proficient in product development and design software (Figma, Figjam).&lt;/li&gt;\n&lt;li&gt;You have experience working with and leading others as part of a distributed (remote) team.&lt;/li&gt;\n&lt;li&gt;You are excited about AI and other next-gen tech!&lt;/li&gt;\n&lt;/ul&gt;\n&lt;h3&gt;&lt;strong&gt;Benefits &amp;amp; Salary&lt;/strong&gt;&lt;/h3&gt;\n&lt;p&gt;Competitive salary and benefits. Compensation is determined based on a variety of factors including relevant experience, other job-related qualifications, geographic location, and business needs.&lt;/p&gt;\n&lt;h3 style=&quot;text-align: center;&quot;&gt;&lt;strong&gt;Join our team!&lt;/strong&gt;&lt;/h3&gt;\n&lt;p style=&quot;text-align: center;&quot;&gt;If you are passionate about Fueled&#39;s mission and think you have what it takes to be successful in this role, even if you don&#39;t check all the boxes - please apply. We&#39;d appreciate the opportunity to personally review your application. Everyone gets a response.&lt;/p&gt;\n&lt;p style=&quot;text-align: center;&quot;&gt;We don&#39;t want you to miss any communication from us! To ensure you receive updates on your application, please add &lt;a href=&quot;mailto:jobs@fueled.com&quot;&gt;jobs@fueled.com&lt;/a&gt; to your contacts list!&lt;/p&gt;\n&lt;p style=&quot;text-align: center;&quot;&gt;Any data provided will be processed in accordance with applicable law and our&amp;nbsp;&lt;a href=&quot;https://fueled.com/privacy-policy/&quot;&gt;privacy policy&lt;/a&gt;. Curious&amp;nbsp;about what to expect during our talent process? Check it out &lt;a href=&quot;https://www.notion.so/fueled/What-to-Expect-from-the-Interview-Process-at-Fueled-1d84dccd9d8b80f8a0b0d40b244f4caf?pvs=4&quot;&gt;here&lt;/a&gt;. &amp;nbsp;&lt;/p&gt;\n&lt;p&gt;&amp;nbsp;&lt;/p&gt;","tags":"[\"management\",\"engineering\"]","pubDate":"2025-05-13T23:11:23.000Z","link":"https://job-boards.greenhouse.io/10up/jobs/4612973008","slug":"director-of-product-10up-6426"},{"id":6737844102,"title":"Marketing Program Manager ","company":"10up","image":"https://pbs.twimg.com/profile_images/2738508979/760be3edebfa0195e36fb3dba07297c1_400x400.png","description":"&lt;p&gt;&lt;strong&gt;Location: &lt;/strong&gt;Remote - India (Open to applicants located in India)&lt;/p&gt;\n&lt;p&gt;Fueled is a leading digital strategy, design, and engineering agency. Recently united with 10up – &lt;a href=&quot;https://10up.com/blog/2025/new-fueled-brand-10up-becomes-wordpress-practice/&quot;&gt;now the brand of our WordPress practice&lt;/a&gt; – we are a 300+ person team that has designed and built hundreds of digital products and experiences for brands like Google, Apple, The New York Times, ESPN, Victoria’s Secret, MGM Resorts, Albertsons, and CLEAR.As a &lt;strong&gt;Marketing Program Manager&lt;/strong&gt;, you’ll partner closely with the cofounder of a US-based digital agency to bring marketing ideas to life—moving projects from concept to execution with precision and care. You&#39;ll help keep everything running smoothly, ensuring deliverables arrive on time and nothing slips through the cracks.&lt;/p&gt;\n&lt;p&gt;This is a full-time, remote role. You&#39;ll need to be available for one 1-hour meeting per day, Monday–Thursday, during US East Coast (ET) business hours. Outside of those daily meetings, your schedule is flexible and self-directed.&lt;/p&gt;\n&lt;h2&gt;&lt;strong&gt;What you’ll do:&lt;/strong&gt;&lt;/h2&gt;\n&lt;ul&gt;\n&lt;li&gt;Organize and track diverse marketing initiatives using tools like Trello or Notion&lt;/li&gt;\n&lt;li&gt;Project-manage a wide range of marketing tasks, from one-off projects to ongoing and recurring initiatives&lt;/li&gt;\n&lt;li&gt;Follow up with freelancers, creators, vendors, and contractors to keep timelines on track&lt;/li&gt;\n&lt;li&gt;Research and source new creative vendors (e.g., identify TikTok ad creators, coordinating trials, and help evaluate outcomes)&lt;/li&gt;\n&lt;li&gt;Monitor project progress and proactively flag any blockers or missing elements&lt;/li&gt;\n&lt;li&gt;Occasionally, review deliverables for completeness and clarity before final submission&lt;/li&gt;\n&lt;/ul&gt;\n&lt;h2&gt;&lt;strong&gt;What you’ll achieve:&lt;/strong&gt;&lt;/h2&gt;\n&lt;ul&gt;\n&lt;li&gt;You&#39;ll find satisfaction in making things happen and enabling others to focus on strategy and creativity&lt;/li&gt;\n&lt;li&gt;You will thrive in a behind-the-scenes role where follow-through and attention to detail make a big impact&lt;/li&gt;\n&lt;li&gt;You will have value autonomy and want flexibility while working on meaningful, high-visibility projects&lt;/li&gt;\n&lt;li&gt;You’ll be excited to work closely with a cofounder and gain exposure to a variety of marketing and creative initiatives&lt;/li&gt;\n&lt;/ul&gt;\n&lt;h2&gt;&lt;strong&gt;About you:&lt;/strong&gt;&lt;/h2&gt;\n&lt;ul&gt;\n&lt;li&gt;You have strong organizational skills and the ability to manage multiple projects simultaneously&lt;/li&gt;\n&lt;li&gt;You have a proactive mindset—you take initiative and don’t wait for direction to add value&lt;/li&gt;\n&lt;li&gt;You have clear and effective English communication skills, both written and spoken&lt;/li&gt;\n&lt;li&gt;You&#39;re comfortable with tools like ChatGPT, Trello, Google Docs, and Notion (or similar project management tools)&lt;/li&gt;\n&lt;li&gt;You have experience working remotely, ideally with distributed or international teams&lt;/li&gt;\n&lt;li&gt;You take a reliable, accountable approach—others know they can count on you to follow through&lt;/li&gt;\n&lt;/ul&gt;\n&lt;h3&gt;&lt;strong&gt;Nice to have:&lt;/strong&gt;&lt;/h3&gt;\n&lt;ul&gt;\n&lt;li&gt;Experience working with creatives, agencies, or freelancers&lt;/li&gt;\n&lt;li&gt;Familiarity with digital marketing tools or workflows&lt;/li&gt;\n&lt;li&gt;Prior experience managing small teams or coordinating complex projects&lt;/li&gt;\n&lt;/ul&gt;\n&lt;h3&gt;&lt;strong&gt;Join our Team&lt;/strong&gt;&lt;/h3&gt;\n&lt;p style=&quot;text-align: left;&quot;&gt;If you are passionate about Fueled&#39;s mission and think you have what it takes to be successful in this role, even if you don&#39;t check all the boxes - please apply. We&#39;d appreciate the opportunity to personally review your application. Everyone gets a response.&lt;/p&gt;\n&lt;p style=&quot;text-align: left;&quot;&gt;We don&#39;t want you to miss any communication from us! To ensure you receive updates on your application, please add &lt;a href=&quot;mailto:jobs@fueled.com&quot;&gt;jobs@fueled.com&lt;/a&gt; to your contacts list!&lt;/p&gt;\n&lt;p style=&quot;text-align: left;&quot;&gt;Any data provided will be processed in accordance with applicable law and our&amp;nbsp;&lt;a href=&quot;https://fueled.com/privacy-policy/&quot;&gt;privacy policy&lt;/a&gt;. Curious&amp;nbsp;about what to expect during our talent process? Check it out &lt;a href=&quot;https://www.notion.so/fueled/What-to-Expect-from-the-Interview-Process-at-Fueled-1d84dccd9d8b80f8a0b0d40b244f4caf?pvs=4&quot;&gt;here&lt;/a&gt;. &amp;nbsp;&lt;/p&gt;","tags":"[\"management\",\"engineering\"]","pubDate":"2025-05-13T23:11:23.000Z","link":"https://job-boards.greenhouse.io/10up/jobs/4602593008","slug":"marketing-program-manager-10up-5644"},{"id":5260666546,"title":"Revenue Enablement, Learning Experience Manager","company":"Owner","image":"https://avatars.githubusercontent.com/u/87661266?s=200&v=4","description":"<div><span style=\"font-size: 24px;\">👋&nbsp;</span><b style=\"font-size: 24px;\">About&nbsp;<a href=\"http://owner.com/\">Owner.com</a></b></div><div>Owner is the all-in-one platform that restaurants use to succeed online.</div><div><br></div><div>Thousands of restaurant owners use our tools to build their website, drive online orders, create their own branded app, manage their customer relationships, and set up marketing automations.</div><div><br></div><div>You can think of it as Shopify meets HubSpot, but specifically for restaurants.</div><div><br></div><div>Learn more about the problems we are solving for our customers&nbsp;<a href=\"https://www.owner.com/our-story\">here</a>.</div><div><br></div><div><span style=\"font-size: 24px;\">🌎&nbsp;</span><b style=\"font-size: 24px;\">Our vision</b></div><div>We’re starting by helping independent restaurants succeed online.</div><div><br></div><div>But it’s not just restaurants that need our help. Most local businesses are struggling with these same problems. Huge technology corporations are taking their customers, bleeding their profits, and making it hard for them to survive.</div><div>Once we nail the solution for restaurants&nbsp;–&nbsp;we’ll scale it into every other local business type.</div><div><br></div><div>In the future we envision, tens of millions of local business owners will use our technology to succeed in the digital age.</div><div><br></div><div><span style=\"font-size: 24px;\">🚀&nbsp;</span><b style=\"font-size: 24px;\">Our traction</b></div><div>In just over 3 years we've generated&nbsp;tens of millions in revenue, served millions of guests, and processed hundreds of millions of online orders.</div><div><br></div><div>More importantly, we’ve helped thousands of restaurant owners save their businesses - and not&nbsp; only survive, but thrive.</div><div><br></div><div><span style=\"font-size: 24px;\">⭐&nbsp;</span><b style=\"font-size: 24px;\">Our team</b></div><div>Our team grew from under 100 to nearly 200 talented people in 2024. We’ve got top talent from the most successful companies in SMB software, including: Shopify, HubSpot, DoorDash, ServiceTitan, Rappi, Faire and Stripe.</div><div><br></div><div>We’ll be scaling even faster in 2025 to keep pace with our customer growth.</div><div><br></div><div><span style=\"font-size: 24px;\">🌆&nbsp;</span><b style=\"font-size: 24px;\">Where we work</b></div><div>Owner is a remote-first, global company headquartered in San Francisco, with a sales hub in Toronto. For a few of our roles we prioritize in-person collaboration at one of our office locations. Most of our employees are distributed throughout the globe. Please review the role description and discuss with your recruiter for more details on location.</div><div><br></div><div><span style=\"font-size: 24px;\">🔍 Why we’re looking for you</span></div><div><br></div><div>We’re looking for a passionate, creative, and meticulous Revenue Enablement Professional to help accelerate the trajectory of our revenue and activations by ensuring each customer facing team member is equipped with the knowledge, information, and skills needed to express and enact the transformative value of Owner to our customers through being obsessively passionate about designing and delivering world class science based curriculum and learning experiences. In this role you’ll work directly with our Enablement, Revenue Leadership, and Customer Success &amp; Support Leadership Teams to help create and deliver World Class quality Revenue Learning and Instructional Design.</div><div><br></div><div>This role is 100% remote and can be based anywhere in the United States or Canada.</div><div><span style=\"font-size: 24px;\">🔍 Why we’re looking for you</span></div><div><br></div><div>We’re looking for a passionate, creative, and meticulous Revenue Enablement Professional to help accelerate the trajectory of our revenue and activations by ensuring each customer facing team member is equipped with the knowledge, information, and skills needed to express and enact the transformative value of Owner to our customers through being obsessively passionate about designing and delivering world class science based curriculum and learning experiences. In this role you’ll work directly with our Enablement, Revenue Leadership, and Customer Success &amp; Support Leadership Teams to help create and deliver World Class quality Revenue Learning and Instructional Design.</div><div><br></div><div>This role is 100% remote and can be based anywhere in the United States or Canada.</div><h3>💻 The impact you will have</h3><li>Drive and elevate the end-to-end curriculum strategy and content design, aligning it to a unified proficiency matrix that spans Sales, Success, Support, and Launch.</li><li>Apply instructional design best practices to every asset—from job aids to full certifications—ensuring clarity, retention, and engagement.</li><li>Build learning paths and assessments in our LMS WorkRamp that support initial onboarding, role transitions, and continuous development.</li><li>Partner with Embedded Enablement Specialists to translate tribal knowledge into repeatable, scalable training experiences, housed in Guru and WorkRamp.</li><li>Design and deliver our “Finishing School” programs to support internal mobility, mastery, and role evolution.</li><li>Collaborate with leadership to implement a skills-based economy model, integrating performance data, manager feedback, and training outcomes.</li><h3>👥 Who you’ll work with</h3><li>Enablement Team </li><li>Revue Team Leadership</li><li>Customer Success &amp; Support  Leadership</li><h3>✅ Minimum requirements</h3><li>3+ Years in Revenue Enablement</li><li>An academic background in adult learning, and instructional design </li><li>A proven track record of successfully delivering world-class science-based training content in a high paced corporate or start up environment</li><li>Expertise in delivering upskilling and new hire Sales Academy programs</li><li>Innovation-minded, and remarkably flexible </li><li>Relentlessly detail-oriented and organized</li><h3>🏆 Pay and benefits</h3><li>The estimated base salary range for this role is USD 115,000-125,000k plus a generous equity pre-IPO equity package</li><li> Other benefits include comprehensive health coverage, work from anywhere (100% remote workplace), unlimited PTO - plus extra fun perks!</li><div><b><span style=\"font-size: 10px\">🚩 Notice - Employment Scams</span></b></div><div><span style=\"font-size: 10px\">Communication from our team regarding job opportunities will only be made by an Owner employee with an @owner.com email address.</span></div><div><span style=\"font-size: 10px\">We do not conduct interviews over email or chat platforms, and we will never ask you to provide personal or financial information such as your mailing address, social security number, credit card numbers or banking information.&nbsp; If you believe you are being contacted by scammer, please mark the communication as \"phishing\" or “spam” and do not respond.</span></div><div><span style=\"font-size: 24px;\">👋&nbsp;</span><b style=\"font-size: 24px;\">About&nbsp;<a href=\"http://owner.com/\">Owner.com</a></b></div><div>Owner is the all-in-one platform that restaurants use to succeed online.</div><div><br></div><div>Thousands of restaurant owners use our tools to build their website, drive online orders, create their own branded app, manage their customer relationships, and set up marketing automations.</div><div><br></div><div>You can think of it as Shopify meets HubSpot, but specifically for restaurants.</div><div><br></div><div>Learn more about the problems we are solving for our customers&nbsp;<a href=\"https://www.owner.com/our-story\">here</a>.</div><div><br></div><div><span style=\"font-size: 24px;\">🌎&nbsp;</span><b style=\"font-size: 24px;\">Our vision</b></div><div>We’re starting by helping independent restaurants succeed online.</div><div><br></div><div>But it’s not just restaurants that need our help. Most local businesses are struggling with these same problems. Huge technology corporations are taking their customers, bleeding their profits, and making it hard for them to survive.</div><div>Once we nail the solution for restaurants&nbsp;–&nbsp;we’ll scale it into every other local business type.</div><div><br></div><div>In the future we envision, tens of millions of local business owners will use our technology to succeed in the digital age.</div><div><br></div><div><span style=\"font-size: 24px;\">🚀&nbsp;</span><b style=\"font-size: 24px;\">Our traction</b></div><div>In just over 3 years we've generated&nbsp;tens of millions in revenue, served millions of guests, and processed hundreds of millions of online orders.</div><div><br></div><div>More importantly, we’ve helped thousands of restaurant owners save their businesses - and not&nbsp; only survive, but thrive.</div><div><br></div><div><span style=\"font-size: 24px;\">⭐&nbsp;</span><b style=\"font-size: 24px;\">Our team</b></div><div>Our team grew from under 100 to nearly 200 talented people in 2024. We’ve got top talent from the most successful companies in SMB software, including: Shopify, HubSpot, DoorDash, ServiceTitan, Rappi, Faire and Stripe.</div><div><br></div><div>We’ll be scaling even faster in 2025 to keep pace with our customer growth.</div><div><br></div><div><span style=\"font-size: 24px;\">🌆&nbsp;</span><b style=\"font-size: 24px;\">Where we work</b></div><div>Owner is a remote-first, global company headquartered in San Francisco, with a sales hub in Toronto. For a few of our roles we prioritize in-person collaboration at one of our office locations. Most of our employees are distributed throughout the globe. Please review the role description and discuss with your recruiter for more details on location.</div>","tags":"[]","pubDate":"2025-05-13T22:40:33.173Z","link":"https://jobs.lever.co/owner/61048665-76fc-4c0e-9d83-39aa09691480","slug":"revenue-enablement-learning-experience-manager-owner-4145"},{"id":8555349732,"title":"Security Engineer [IC3]","company":"Sourcegraph","image":"https://avatars.githubusercontent.com/u/3979584?s=200&v=4","description":"&lt;div class=&quot;content-intro&quot;&gt;&lt;h2&gt;&lt;span style=&quot;color: rgb(243, 78, 63);&quot;&gt;&lt;strong&gt;Who we are&lt;/strong&gt;&lt;/span&gt;&lt;/h2&gt;\n&lt;p&gt;Our mission at Sourcegraph is to make it so that &lt;a href=&quot;https://www.notion.so/sourcegraph/Mission-values-e9d37e6b972a4ef395c3076aea2bd07d?pvs=4&quot;&gt;everyone can code&lt;/a&gt;, not just ~0.1% of the population.&amp;nbsp;&lt;/p&gt;\n&lt;p&gt;We are transforming how the world’s most important companies build software by industrializing development with AI. Today, most professional developers spend a disproportionate amount of time understanding code and performing repetitive, low-level tasks—leaving less time for innovation and meaningful impact.&lt;/p&gt;\n&lt;p&gt;We’re changing that. Sourcegraph brings AI-powered search and agents to the enterprise, helping teams automate the mundane and amplify what developers do best— solving hard problems and creating great products.&lt;/p&gt;\n&lt;p&gt;Here’s how we’re making a difference:&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;&lt;strong&gt;Accelerating developers &lt;/strong&gt;with AI agents that deliver insights and precision—enabling 5x faster test creation, 30% increase in merge requests, and saving 20 minutes per developer daily.&lt;/li&gt;\n&lt;li&gt;&lt;strong&gt;Automating repetitive tasks,&lt;/strong&gt; from remediating vulnerabilities (saving teams 1,000+ hours annually) to speeding up migrations that would take years to months.&amp;nbsp;&lt;/li&gt;\n&lt;li&gt;&lt;strong&gt;Enabling innovation&lt;/strong&gt; by addressing complex problems like automated bug triage, vulnerability detection, and AI-driven code reviews seamlessly integrated into workflows.&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;Trusted by 7/10 top software companies by market cap, 4/6 top US banks and many of the companies leading global innovation, like Stripe, Indeed, Tesla, and 1Password, and with $225M in funding from investors like &lt;a href=&quot;https://techcrunch.com/2021/07/13/sourcegraph-raises-125m-series-d-on-2-6b-valuation-for-universal-code-search-tool/&quot;&gt;a16z&lt;/a&gt;, &lt;a href=&quot;https://about.sourcegraph.com/blog/series-c-with-sequoia/&quot;&gt;Sequoia&lt;/a&gt;, and &lt;a href=&quot;https://www.redpoint.com/companies/sourcegraph/&quot;&gt;Redpoint&lt;/a&gt;, we are building the tools that will define the next era of enterprise software development.&lt;/p&gt;\n&lt;p&gt;If you’re passionate about solving the hardest problems in software and shaping the future of technology, join us. Let’s build something extraordinary together.&lt;/p&gt;&lt;/div&gt;&lt;h2&gt;&lt;span style=&quot;color: rgb(243, 78, 63);&quot;&gt;&lt;strong&gt;Hours &amp;amp; location&lt;/strong&gt;&lt;/span&gt;&lt;/h2&gt;\n&lt;p&gt;🌎 While we hire &lt;a href=&quot;https://sourcegraph.notion.site/How-we-engage-talent-outside-of-the-US-218f7193695a46cbb1ef39ef9c1f72d4&quot;&gt;almost anywhere&lt;/a&gt; in the world, we have a preference for someone to reside in the following locations for this role. However, if you feel qualified, we welcome you to apply regardless of location. No matter what, working hours must overlap with Mountain Time for at least 20 hours/week.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Preferred locations:&lt;/strong&gt;&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;North America&lt;/li&gt;\n&lt;li&gt;South America&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;We do not subscribe to “I do my best work when I work 40 hours a week.”&amp;nbsp; People we hire at Sourcegraph believe that building outstanding things means working very hard — smarter and more hours than the competition.&lt;/p&gt;\n&lt;h2&gt;&lt;span style=&quot;color: rgb(243, 78, 63);&quot;&gt;&lt;strong&gt;Why this job is exciting&lt;/strong&gt;&lt;/span&gt;&lt;/h2&gt;\n&lt;p&gt;As a Security Engineer, you will join our exceptional&lt;a href=&quot;https://sourcegraph.notion.site/Security-81d50b5ac5474b07bdbadd5359993c80&quot;&gt; security team&lt;/a&gt; tasked with building world-class security into our product offerings by working on vulnerability management, application security testing and vulnerability scanning automation, bug bounty programs, and security reviews for both application and infrastructure security. You will proactively improve the security of our codebase, our product, our cloud, and our customers&#39; on-premise deployments.&amp;nbsp;&lt;/p&gt;\n&lt;p&gt;Within one month, you will…&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;You will contribute to the team&#39;s goals and deliverables for securing the largest deployment of Sourcegraph (sourcegraph.com), enabling customers to upload private code repositories&lt;/li&gt;\n&lt;li&gt;You will discover, fix, and mitigate infrastructure vulnerabilities by updating libraries, base images, and analyzing containers&lt;/li&gt;\n&lt;li&gt;You will enhance our application security with audits, best practices, code fixes, and continuous education&lt;/li&gt;\n&lt;li&gt;You will perform reactive incident response if a security event occurs&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;Within three months, you will…&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;You will enhance our security measures and policies to support organizations on sourcegraph.com and ampcode.com&lt;/li&gt;\n&lt;li&gt;You will work with other teams to triage, troubleshoot and mitigate customer concerns and questions about our security&lt;/li&gt;\n&lt;li&gt;You and your manager will work together on a career plan with actionable goals&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;Within six months, you will…&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;You will work with other teams and engineers to implement secure coding guidelines and best practices&lt;/li&gt;\n&lt;li&gt;You will perform proactive research to detect new attack vectors&lt;/li&gt;\n&lt;li&gt;You will perform threat modeling for existing and future applications&amp;nbsp;&lt;/li&gt;\n&lt;li&gt;You will assess and integrate new tools and technologies to improve our operational efficiencies&lt;/li&gt;\n&lt;li&gt;You will help maintain compliance with SOC 2, ISO 27001 &amp;amp; GDPR standards&lt;/li&gt;\n&lt;/ul&gt;\n&lt;h2&gt;&lt;span style=&quot;color: rgb(243, 78, 63);&quot;&gt;&lt;strong&gt;About you&amp;nbsp;&lt;/strong&gt;&lt;/span&gt;&lt;/h2&gt;\n&lt;p&gt;Equal parts engineer and security professional, you are excited about joining a team that is building a world class security system trusted by some of the biggest tech companies in the world.&amp;nbsp; You and your teammates are Sourcegraph’s first line of defense against bad actors using all the newest and dirtiest tricks to hack us and (more importantly) our customers.&amp;nbsp; You want to be a part of the foundational team, the first steps we are taking to build something big, something trusted, something critical to software and our customers&lt;/p&gt;\n&lt;p&gt;Your skill-set:&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;Practical experience securing SaaS applications, including infrastructure security, application security, and/or compliance&lt;/li&gt;\n&lt;li&gt;Experience using and automating a wide range of defensive security tools&lt;/li&gt;\n&lt;li&gt;Experience developing software as an engineer (i.e., writing code and contributing directly to applications)&lt;/li&gt;\n&lt;li&gt;Experience working across engineering teams to support secure coding across the organization.&lt;/li&gt;\n&lt;li&gt;You are high agency&lt;/li&gt;\n&lt;li&gt;You communicate effectively in writing and documentation&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;Nice to haves:&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;Experience working in a startup environment&lt;/li&gt;\n&lt;li&gt;Experience with Go, TypeScript, Terraform&lt;/li&gt;\n&lt;li&gt;Experience with Kubernetes, GCP&lt;/li&gt;\n&lt;li&gt;Experience securing AI products&lt;/li&gt;\n&lt;/ul&gt;\n&lt;h2&gt;&lt;span style=&quot;color: rgb(243, 78, 63);&quot;&gt;&lt;strong&gt;Level&lt;/strong&gt;&lt;/span&gt;&lt;/h2&gt;\n&lt;p&gt;📊 This job is an IC3.&amp;nbsp; You can read more about &lt;a href=&quot;https://www.notion.so/sourcegraph/Leveling-Guide-0e1b5c76ada64b9caac387f8b7c4fc66&quot;&gt;our job leveling philosophy&lt;/a&gt; in our Handbook.&lt;/p&gt;\n&lt;h2&gt;&lt;span style=&quot;color: rgb(243, 78, 63);&quot;&gt;&lt;strong&gt;Compensation&lt;/strong&gt;&lt;/span&gt;&lt;/h2&gt;\n&lt;p&gt;&lt;strong&gt;💸 We pay you an above-average salary&lt;/strong&gt; because we want to hire the best people who are fully focused on helping Sourcegraph succeed, not worried about paying bills. As an &lt;a href=&quot;https://sourcegraph.notion.site/Mission-values-e9d37e6b972a4ef395c3076aea2bd07d&quot;&gt;open and transparent&lt;/a&gt; company that values &lt;a href=&quot;https://www.notion.so/sourcegraph/Compensation-Pay-Transparency-at-Sourcegraph-d58d0774f51b4b489d41c3628d30ff8d?pvs=4&quot;&gt;competitive compensation&lt;/a&gt;, our compensation ranges are visible to every single Sourcegraph teammate.&lt;/p&gt;\n&lt;p&gt;Your salary is determined by your pay band for the IC3 job level. For determining pay bands, we use a number of market and data-driven salary sources, along with your location zone, and target the high-end of the range to ensure we’re always paying above market regardless of where you live in the world. Both U.S. and international locations are divided into one of four zones, determined by the cost of labor index for each area. The salary for a successful candidate will be based on level, job-related skills, experience, qualifications, and location zone. Please note that the salaries below may be adjusted in the future.&lt;/p&gt;\n&lt;p&gt;💰 The target compensation for this role is based on the IC3 pay band for your zone. The start of the IC3 pay band for each zone is listed below:&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;Zone 2: $144,000&lt;/li&gt;\n&lt;li&gt;Zone 3: $108,000&lt;/li&gt;\n&lt;li&gt;Zone 4: $72,000&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;Please speak with a recruiter for additional information regarding zone locations.&lt;/p&gt;\n&lt;p&gt;📈 In addition to our cash compensation, we offer equity (because when we succeed as a company, we want you to succeed, too) and generous &lt;a href=&quot;https://sourcegraph.notion.site/Benefits-Perks-dd1da4b6b3a64780abed010a144d34ba&quot;&gt;perks &amp;amp; benefits&lt;/a&gt;.&lt;/p&gt;\n&lt;h2&gt;&lt;span style=&quot;color: rgb(243, 78, 63);&quot;&gt;&lt;strong&gt;Interview process&amp;nbsp;&lt;/strong&gt;&lt;/span&gt;&lt;/h2&gt;\n&lt;p&gt;&lt;em&gt;Below is the interview process you can expect for this role (you can read more about &lt;/em&gt;&lt;a href=&quot;https://sourcegraph.notion.site/Types-of-interviews-f279f080583d49ee9f2c60e30c8cb1f7&quot;&gt;&lt;em&gt;the types of interviews&lt;/em&gt;&lt;/a&gt;&lt;em&gt; in our Handbook). It may look like a lot of steps, but rest assured that we move quickly and the steps are designed to help you get the information needed to determine if we’re the right fit for you… Interviewing is a two-way street, after all!&amp;nbsp;&lt;/em&gt;&lt;/p&gt;\n&lt;p&gt;We expect the interview process to take &amp;lt;5 hours in total.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;👋 Introduction Stage&lt;/strong&gt; - we have initial conversations to get to know you better…&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;[20m] &lt;a href=&quot;https://www.notion.so/sourcegraph/Types-of-interviews-sample-questions-f279f080583d49ee9f2c60e30c8cb1f7?pvs=4#99be5ff628b2414194a0ba79d9f25f13&quot;&gt;Recruiter Screen&lt;/a&gt;&lt;/li&gt;\n&lt;li&gt;[30m] &lt;a href=&quot;https://www.notion.so/sourcegraph/Types-of-interviews-sample-questions-f279f080583d49ee9f2c60e30c8cb1f7?pvs=4#1919882c0cf147c487eb1df40db8a694&quot;&gt;Hiring Manager Screen&lt;/a&gt;&lt;/li&gt;\n&lt;li&gt;[60m] &lt;a href=&quot;https://www.notion.so/sourcegraph/Types-of-interviews-sample-questions-f279f080583d49ee9f2c60e30c8cb1f7?pvs=4#c678a2a86e0e47e4958507e869bf7ded&quot;&gt;Resume Deep Dive&lt;/a&gt; / Technical Screen&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;&lt;strong&gt;🧑‍💻 Team Interview Stage&lt;/strong&gt; - we then delve into your experience in more depth and introduce you to members of the team, including cross-functional partners…&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;[60m] Technical Interview: General&lt;/li&gt;\n&lt;li&gt;[60m] Technical Interview: Complex Problem Deep Dive&lt;/li&gt;\n&lt;li&gt;[45m] Cross-functional Team Collaboration / Values&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;&lt;strong&gt;🎉 Final Interview Stage &lt;/strong&gt;- we move you to our final round, where you gain a better understanding of our business and values holistically…&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;[15m] &lt;a href=&quot;https://www.notion.so/sourcegraph/How-to-work-with-Quinn-Slack-CEO-807673e0864d473f959cc4efd9642a5a?pvs=4#6f185c0e2011411eac5be9c675f9056c&quot;&gt;Leadership&lt;/a&gt; with co-founder&amp;nbsp;&lt;/li&gt;\n&lt;li&gt;We check references and conduct your background check&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;Please note - you are welcome to request additional conversations with anyone you would like to meet, but didn’t get to meet during the interview process.&lt;/p&gt;&lt;div class=&quot;content-conclusion&quot;&gt;&lt;h2&gt;&lt;span style=&quot;color: rgb(243, 78, 63);&quot;&gt;&lt;strong&gt;Learn more about us&lt;/strong&gt;&lt;/span&gt;&lt;/h2&gt;\n&lt;p&gt;You can learn more about what it is like to work at Sourcegraph by reading &lt;a href=&quot;https://sourcegraph.notion.site/d7614e3e9dc04c09ac2d42d57f1816e6?v=2a6d426dbae14390b155120b0c029ce0&quot;&gt;our handbook&lt;/a&gt;.&lt;/p&gt;\n&lt;p&gt;We are an ambitious team who are collectively working hard to build the most influential company in the world.&amp;nbsp; You can read more about our &lt;a href=&quot;https://sourcegraph.notion.site/What-it-s-like-working-at-Sourcegraph-119a8e11265880b18911eee4d9b7c460#119a8e1126588062b935fc66104b6115&quot;&gt;culture&lt;/a&gt;, &lt;a href=&quot;https://sourcegraph.notion.site/Compensation-Pay-Transparency-at-Sourcegraph-d58d0774f51b4b489d41c3628d30ff8d?pvs=74&quot;&gt;competitive compensation&lt;/a&gt; and &lt;a href=&quot;https://sourcegraph.notion.site/Benefits-Perks-dd1da4b6b3a64780abed010a144d34ba?pvs=74&quot;&gt;benefits&lt;/a&gt; here.&lt;/p&gt;\n&lt;p&gt;Sourcegraph is an equal opportunity workplace; we welcome people from all backgrounds.&amp;nbsp;&lt;/p&gt;\n&lt;p&gt;&lt;em&gt;Sourcegraph participates in &lt;/em&gt;&lt;a href=&quot;https://sourcegraph.notion.site/E-Verify-2ab3286dde3446d6bac2898c83610107&quot;&gt;&lt;em&gt;E-Verify&lt;/em&gt;&lt;/a&gt;&lt;em&gt; for U.S. Employees. &lt;/em&gt;&lt;/p&gt;&lt;/div&gt;","tags":"[\"typescript\",\"management\",\"engineering\"]","pubDate":"2025-05-13T19:41:42.000Z","link":"https://job-boards.greenhouse.io/sourcegraph91/jobs/5536232004","slug":"security-engineer-ic3-sourcegraph-7035"},{"id":2021579861,"title":"Strategic Account Manager","company":"Sardine","image":"https://avatars.githubusercontent.com/u/65879301?s=200&v=4","description":"<p style=\"min-height:1.5em\"><strong>Who we are:</strong></p><p style=\"min-height:1.5em\">We are a leader in fraud prevention and AML compliance. Our platform uses device intelligence, behavior biometrics, machine learning, and AI to stop fraud before it happens. Today, over 300 banks, retailers, and fintechs worldwide use Sardine to stop identity fraud, payment fraud, account takeovers, and social engineering scams. We have raised $145M from world-class investors, including Andreessen Horowitz, Activant, Visa, Experian, FIS, and Google Ventures.</p><p style=\"min-height:1.5em\"></p><p style=\"min-height:1.5em\"><strong>Our culture:</strong></p><ul style=\"min-height:1.5em\"><li><p style=\"min-height:1.5em\">We have hubs in the Bay Area, NYC, Austin, and Toronto. However, we maintain a remote-first work culture. #WorkFromAnywhere</p></li><li><p style=\"min-height:1.5em\">We hire talented, self-motivated individuals with extreme ownership and high growth orientation. </p></li><li><p style=\"min-height:1.5em\">We value performance and not hours worked. We believe you shouldn't have to miss your family dinner, your kid's school play, friends get-together, or doctor's appointments for the sake of adhering to an arbitrary work schedule.</p></li></ul><p style=\"min-height:1.5em\"></p><p style=\"min-height:1.5em\"><strong>Location:</strong></p><ul style=\"min-height:1.5em\"><li><p style=\"min-height:1.5em\">US or Canada (East Coast Preferred) - Remote</p></li><li><p style=\"min-height:1.5em\">From Home / Beach / Mountain / Cafe / Anywhere!</p></li><li><p style=\"min-height:1.5em\">We are a remote-first company with a globally distributed team. So you can find your productive zone and work from there.</p><p style=\"min-height:1.5em\"></p></li></ul><p style=\"min-height:1.5em\"><strong>About the Role:</strong></p><p style=\"min-height:1.5em\">Sardine is rapidly acquiring new customers and executing on an ambitious roadmap. As a result, we're building a world-class customer success team to support our fraud, payments, and compliance-related products as we grow. This role is a combination of Account Manager and Solution Architect. You'll manage a handful of customers and act as their stakeholder within Sardine, helping maximize the value of our products and services. In addition, you will collaborate daily with Sardine teams to help customers meet their risk, fraud, compliance, and payment needs, including risk analytics, data science, integrations, and products.  </p><p style=\"min-height:1.5em\"></p><p style=\"min-height:1.5em\"><strong>You will:</strong></p><ul style=\"min-height:1.5em\"><li><p style=\"min-height:1.5em\">Be the primary point of contact for our customers, attending to day-to-day and 'big picture' problems and opportunities and helping maximize the customer's ROI in Sardine</p></li><li><p style=\"min-height:1.5em\">Build a thorough understanding of our product, technology, and strategy and be able to message these succinctly to customers.</p></li><li><p style=\"min-height:1.5em\">Translate complex product and technology problems into simple and actionable solutions. Be able to manage the solution process both internally and externally.</p></li><li><p style=\"min-height:1.5em\">Speak knowledgeably and advise on best practices relating to fraud and compliance</p></li><li><p style=\"min-height:1.5em\">Build, monitor, and communicate KPIs to clients.</p></li><li><p style=\"min-height:1.5em\">Provide strategic analysis and critical thinking as we plan long-term expansion.</p></li><li><p style=\"min-height:1.5em\">Work with Sardine's risk analytics teams to proactively solve new fraud typologies and actively communicate findings to customers.</p></li></ul><p style=\"min-height:1.5em\"><br /><strong>You are an ideal candidate if:</strong></p><ul style=\"min-height:1.5em\"><li><p style=\"min-height:1.5em\">You've 7+ years of experience in Account Management, Customer Success, Risk Management, or Solutions Architecture within B2B SaaS, with an understanding of how customers integrate API's</p></li><li><p style=\"min-height:1.5em\">You've domain experience in compliance, fintech, or AML/KYC </p></li><li><p style=\"min-height:1.5em\">Your analytical skills are second to none; you excel at number crunching and drawing insights</p></li><li><p style=\"min-height:1.5em\">You are proficient in using business intelligence tools</p></li><li><p style=\"min-height:1.5em\">You're capable of translating complex strategies into actionable processes and outcomes</p></li><li><p style=\"min-height:1.5em\">You're a natural at building relationships and collaborating with others</p></li><li><p style=\"min-height:1.5em\">You've got strong presentation skills for both virtual and in-person meetings with various stakeholders</p></li><li><p style=\"min-height:1.5em\">You've previous customer-facing experience, preferably with a technical product</p></li><li><p style=\"min-height:1.5em\">You're an exceptional project manager, synthesizing all inputs and balancing the needs of multiple stakeholders</p></li><li><p style=\"min-height:1.5em\">You constantly think about ways to improve processes</p></li><li><p style=\"min-height:1.5em\">You love making customers more efficient as much as we do!</p></li></ul><p style=\"min-height:1.5em\"></p><p style=\"min-height:1.5em\"><strong>Compensation:</strong> Base pay range of $150,000 - $180,000 + equity with tremendous upside potential + Attractive benefits</p><p style=\"min-height:1.5em\"></p><p style=\"min-height:1.5em\">The compensation offered for this role will depend on various factors, including the candidate's location, qualifications, work history, and interview performance, and may differ from the stated range.</p><p style=\"min-height:1.5em\"></p><p style=\"min-height:1.5em\"><strong>Benefits we offer:</strong></p><ul style=\"min-height:1.5em\"><li><p style=\"min-height:1.5em\">Generous compensation in cash and equity</p></li><li><p style=\"min-height:1.5em\">Early exercise for all options, including pre-vested</p></li><li><p style=\"min-height:1.5em\">Work from anywhere: Remote-first Culture</p></li><li><p style=\"min-height:1.5em\">Flexible paid time off, Year-end break, Self care days off</p></li><li><p style=\"min-height:1.5em\">Health insurance, dental, and vision coverage for employees and dependents - <em>US and Canada specific</em></p></li><li><p style=\"min-height:1.5em\">4% matching in 401k / RRSP - <em>US and Canada specific</em></p></li><li><p style=\"min-height:1.5em\">MacBook Pro delivered to your door</p></li><li><p style=\"min-height:1.5em\">One-time stipend to set up a home office — desk, chair, screen, etc.</p></li><li><p style=\"min-height:1.5em\">Monthly meal stipend</p></li><li><p style=\"min-height:1.5em\">Monthly social meet-up stipend</p></li><li><p style=\"min-height:1.5em\">Annual health and wellness stipend</p></li><li><p style=\"min-height:1.5em\">Annual Learning stipend</p></li><li><p style=\"min-height:1.5em\">Unlimited access to an expert financial advisory</p></li></ul><p style=\"min-height:1.5em\"></p><p style=\"min-height:1.5em\">Join a fast-growing company with world-class professionals from around the world. If you are seeking a meaningful career, you found the right place, and we would love to hear from you.</p><p style=\"min-height:1.5em\"></p><p style=\"min-height:1.5em\"><em>To learn more about how we process your personal information and your rights in regards to your personal information as an applicant and Sardine employee, please visit our </em><a target=\"_blank\" rel=\"noopener noreferrer nofollow\" class=\"text-link-blue\" href=\"https://www.sardine.ai/applicant-and-worker-privacy-notice\"><em>Applicant and Worker Privacy Notice</em></a><em>.</em></p>","tags":"[\"management\",\"engineering\",\"b2b\"]","pubDate":"2025-05-13T14:57:38.226Z","link":"https://jobs.ashbyhq.com/sardine/9d6e2797-71e3-4244-9cf0-7ccbf0f707da","slug":"strategic-account-manager-sardine-1250"},{"id":1934113608,"title":"Linux Kernel Developer (Remote/Anywhere)","company":"Collabora","image":"https://avatars.githubusercontent.com/u/4499761?s=200&v=4","description":"<div>Collabora is currently looking for a very technically capable, enthusiastic and  passionate Linux Kernel Software Developer to join its ever growing  engineering team.</div><div><br></div><div>As a member of the Kernel domain team, you primary focus will be to participate in the development, integration, validation and deployment of Linux board support packages and kernel device drivers, merging code upstream, working together with the mainline Linux community, configuring kernels, troubleshooting functional and performance problems for different customers’ projects and products.</div><div>Collabora is currently looking for a very technically capable, enthusiastic and  passionate Linux Kernel Software Developer to join its ever growing  engineering team.</div><div><br></div><div>As a member of the Kernel domain team, you primary focus will be to participate in the development, integration, validation and deployment of Linux board support packages and kernel device drivers, merging code upstream, working together with the mainline Linux community, configuring kernels, troubleshooting functional and performance problems for different customers’ projects and products.</div><h3>Key Responsibilities</h3><li>Discuss Linux core system technologies with clients and promote our leadership in the open source arena</li><li>Analyze client problems and design solutions leveraging open source technologies and Collabora's technical expertise</li><li>Define and scope client projects in collaboration with the delivery team</li><li>Contribute publicly to open source projects to further strengthen Collabora's technical leadership</li><li>Gain working knowledge of customers’ products, applications, technical and business strengths and target markets</li><li>Understand client needs and reconciling time constraints, available technologies and resources, and open source best practices</li><h3>Desired Skills</h3><li>Linux Kernel and kernel module development</li><li>Linux driver development</li><li>Cross-compiling and porting</li><li>Understanding of open-source development methodology and practices as well as prior experience/contributions with/to the Open Source Linux Kernel community</li><li>Linux distribution package development/management (Debian, Yocto...) is a nice to have</li><li>Exposure to Continuous Integration environments (Jenkins, <a href=\"http://kernelci.org\">kernelci.org</a>...) is a plus</li><li>Self learning skill to get sufficient knowledge of Collabora's services, business model, project delivery life cycle and other related technical domains</li><li>Good English language skills (both verbal and written)</li><li>Ability to work and communicate in an online fully distributed environment</li><div>Collabora  is a software consultancy specializing in bringing companies and the  Open Source community together. We combine years of Open Source software  leadership with an understanding of the challenges that businesses,  non-profits, and governments face. Collabora brings deep technical  expertise in system integration &amp; architecture, graphics,  multimedia, web engines and communications to a number of market  verticals, including mobile, IVI / automotive, set top box / smart TV,  and a range of other specialized embedded applications.</div><div><br></div><div>Collabora  has the unique business model of enabling enterprises to leverage Open  Source software in their solutions. Having worked with notable industry  leading companies in the automotive, aerospace and handset mobile  verticals amongst many others, Collabora has established a broad  customer portfolio.</div><div><br></div><div>#LI-Remote</div>","tags":"[\"management\",\"engineering\"]","pubDate":"2025-05-13T13:16:12.215Z","link":"https://jobs.lever.co/collabora/95c2f0cd-d006-47dc-a3ff-7de4545e46fb","slug":"linux-kernel-developer-remote-anywhere-collabora-4931"},{"id":2165111036,"title":"Sales Manager - coming soon ✨","company":"Owner","image":"https://avatars.githubusercontent.com/u/87661266?s=200&v=4","description":"<div><b style=\"font-size: 32px\">Sales Manager</b></div><div><span style=\"font-size: 15px\">We expect to open this role within the next few months - please feel free to submit your resume in advance to express interest. More specific details on this opportunity coming soon!&nbsp;</span></div><div><br></div><div><br></div><div><span style=\"font-size: 13pt\">👋&nbsp;</span><b style=\"font-size: 13pt\">About&nbsp;</b><b><a class=\"postings-link\" style=\"font-size: 13pt\" href=\"http://owner.com/\">Owner.com</a></b></div><div><span style=\"font-size: 11pt\">Owner is the all-in-one platform that restaurants use to succeed online.&nbsp;</span></div><div><br></div><div><span style=\"font-size: 11pt\">Thousands of restaurant owners use our tools to build their website, drive online orders, create their own branded app, manage their customer relationships, and set up marketing automations.&nbsp;</span></div><div><br></div><div><span style=\"font-size: 14.6667px\">You can think of it as Shopify meets HubSpot, but specifically for restaurants.&nbsp;</span></div><div><br></div><div><span style=\"font-size: 11pt\">Learn more about the problems we are solving for our customers&nbsp;</span><a class=\"postings-link\" style=\"font-size: 11pt\" href=\"https://www.owner.com/our-story\">here</a><span style=\"font-size: 11pt\">.&nbsp;</span></div><div><br></div><div><span style=\"font-size: 13pt\">🌎&nbsp;</span><b style=\"font-size: 13pt\">Our vision</b></div><div><span style=\"font-size: 11pt\">We’re starting by helping independent restaurants succeed online.</span></div><div><br></div><div><span style=\"font-size: 11pt\">But it’s not just restaurants that need our help. All local service-based businesses are struggling with these same problems. Huge technology corporations are taking their customers, bleeding their profits, and making it hard for them to survive.</span></div><div><br></div><div><span style=\"font-size: 11pt\">So, once we nail the solution for restaurants&nbsp;–&nbsp;we’ll scale it into every other local business type.</span></div><div><br></div><div><span style=\"font-size: 11pt\">In the future we envision, we’ll build the technology that tens of millions of local business owners need to succeed in the digital age.</span></div><div><br></div><div><br></div><div><span style=\"font-size: 13pt\">⭐&nbsp;</span><b style=\"font-size: 13pt\">Our team</b></div><div><span style=\"font-size: 15px\">We’ve got top talent from the most successful companies in SMB software like Shopify, HubSpot, DoorDash, Procore, and ServiceTitan.</span></div><div><br></div><div><span style=\"font-size: 15px\">We’re scaling even faster in 2025 to keep pace with our customer growth.</span></div><div><br></div><div><br></div><div><b style=\"font-size: 13pt\">🚀&nbsp;Our traction</b></div><div><span style=\"font-size: 11pt\">In just over 3 years we've generated&nbsp;</span><span style=\"font-size: 15px\">tens of millions in revenue, served millions of guests, and have processed hundreds of millions of orders.</span></div><div><br></div><div><span style=\"font-size: 11pt\">More importantly, we’ve helped thousands of restaurant owners save their businesses - and not&nbsp; only survive, but thrive.</span></div><div><br></div><div><br></div><div><span style=\"font-size: 18px\">🌆&nbsp;</span><b style=\"font-size: 18px\">Where we work</b></div><div>Owner is a remote-first, global company headquartered in San Francisco, with a sales hub in Toronto. For a few of our roles we prioritize in-person collaboration at one of our office locations. Most of our employees are distributed throughout the globe. Please review the job description and discuss with your recruiter for more details on role location.</div><div><b style=\"font-size: 32px\">Sales Manager</b></div><div><span style=\"font-size: 15px\">We expect to open this role within the next few months - please feel free to submit your resume in advance to express interest. More specific details on this opportunity coming soon!&nbsp;</span></div><div><br></div><div><br></div><div><span style=\"font-size: 13pt\">👋&nbsp;</span><b style=\"font-size: 13pt\">About&nbsp;</b><b><a href=\"http://owner.com/\" style=\"font-size: 13pt\" class=\"postings-link\">Owner.com</a></b></div><div><span style=\"font-size: 11pt\">Owner is the all-in-one platform that restaurants use to succeed online.&nbsp;</span></div><div><br></div><div><span style=\"font-size: 11pt\">Thousands of restaurant owners use our tools to build their website, drive online orders, create their own branded app, manage their customer relationships, and set up marketing automations.&nbsp;</span></div><div><br></div><div><span style=\"font-size: 14.6667px\">You can think of it as Shopify meets HubSpot, but specifically for restaurants.&nbsp;</span></div><div><br></div><div><span style=\"font-size: 11pt\">Learn more about the problems we are solving for our customers&nbsp;</span><a href=\"https://www.owner.com/our-story\" style=\"font-size: 11pt\" class=\"postings-link\">here</a><span style=\"font-size: 11pt\">.&nbsp;</span></div><div><br></div><div><span style=\"font-size: 13pt\">🌎&nbsp;</span><b style=\"font-size: 13pt\">Our vision</b></div><div><span style=\"font-size: 11pt\">We’re starting by helping independent restaurants succeed online.</span></div><div><br></div><div><span style=\"font-size: 11pt\">But it’s not just restaurants that need our help. All local service-based businesses are struggling with these same problems. Huge technology corporations are taking their customers, bleeding their profits, and making it hard for them to survive.</span></div><div><br></div><div><span style=\"font-size: 11pt\">So, once we nail the solution for restaurants&nbsp;–&nbsp;we’ll scale it into every other local business type.</span></div><div><br></div><div><span style=\"font-size: 11pt\">In the future we envision, we’ll build the technology that tens of millions of local business owners need to succeed in the digital age.</span></div><div><br></div><div><br></div><div><span style=\"font-size: 13pt\">⭐&nbsp;</span><b style=\"font-size: 13pt\">Our team</b></div><div><span style=\"font-size: 15px\">We’ve got top talent from the most successful companies in SMB software like Shopify, HubSpot, DoorDash, Procore, and ServiceTitan.</span></div><div><br></div><div><span style=\"font-size: 15px\">We’re scaling even faster in 2025 to keep pace with our customer growth.</span></div><div><br></div><div><br></div><div><b style=\"font-size: 13pt\">🚀&nbsp;Our traction</b></div><div><span style=\"font-size: 11pt\">In just over 3 years we've generated&nbsp;</span><span style=\"font-size: 15px\">tens of millions in revenue, served millions of guests, and have processed hundreds of millions of orders.</span></div><div><br></div><div><span style=\"font-size: 11pt\">More importantly, we’ve helped thousands of restaurant owners save their businesses - and not&nbsp; only survive, but thrive.</span></div><div><br></div><div><br></div><div><span style=\"font-size: 18px\">🌆&nbsp;</span><b style=\"font-size: 18px\">Where we work</b></div><div>Owner is a remote-first, global company headquartered in San Francisco, with a sales hub in Toronto. For a few of our roles we prioritize in-person collaboration at one of our office locations. Most of our employees are distributed throughout the globe. Please review the job description and discuss with your recruiter for more details on role location.</div>","tags":"[]","pubDate":"2025-05-13T03:56:37.599Z","link":"https://jobs.lever.co/owner/0e6aeb34-8cdc-41ce-9b1e-2411896a757a","slug":"sales-manager-coming-soon-owner-1971"}]