[{"id":6603823416,"title":"Freelance | Contract Senior Visual Designer - EMEA Team","company":"10up","image":"https://pbs.twimg.com/profile_images/2738508979/760be3edebfa0195e36fb3dba07297c1_400x400.png","description":"<div class=\"section page-centered\" data-qa=\"job-description\"><div><b>Location: Remote - EMEA Team</b> (Open to applicants located anywhere aligned with EMEA time zones.)</div><div><br></div><div>As a Senior Visual Designer at 10up, you’ll work collaboratively alongside our Content and UX Design teams, and will lead UI design - expanding your portfolio - on award-winning, enterprise-level digital experiences.</div><div><br></div><div>You’ll have the creative flexibility to explore and experiment across design tools and processes on a combination of unique, challenging projects and ongoing support engagements. As a leading digital agency, 10up’s client roster spans from innovative startups and impactful non-profits, to some of the biggest names in the industry, such as ESPN, Google, The New York Times Co., Microsoft, and The Nobel Prize Committee.</div><div><br></div><div>As a 10upper, you have options for flexible and alternative work schedules. Intentionally remote since day one, spanning six continents and 40 countries, 10up fully embraces the benefits of distributed work.</div></div><div class=\"section page-centered\"><div><h3>What you will do: </h3><ul class=\"posting-requirements plain-list\"><ul><li>Partner with Project and Account Managers to plan design-related activities within project timelines and ideal project outcomes while mitigating risks.</li><li>Be part of design workshops, discussions, and co-creation sessions.</li><li>Engage in iterative, modular design production, documentation, and communication at various fidelity levels, such as visual concepts, style tiles, production style guides, user journeys, interactive prototypes, wireframes and layouts, high-fidelity comps, motion, animation definition, etc.</li><li>Collaborate with other disciplines on scope definition and design deliverables, fostering a psychologically safe collaboration and critique environment.</li><li>Turning insights into actionable recommendations and design solutions.</li></ul></ul></div></div><div class=\"section page-centered\"><div><h3>About you: </h3><ul class=\"posting-requirements plain-list\"><ul><li>You have 5+ years of experience working with modern website and app design principles across multiple devices - with a particular focus on layout, typography, color, media, and accessibility</li><li>You are equally comfortable with conceptual design and tactical design production in a fast-paced agency environment with effective time management. You have the ability to balance business, audience, and technical needs to drive positive design outcomes.</li><li>You have clear and concise client communication skills, with the ability to confidently present design work with supporting rationale and compelling storytelling with confident workshop facilitation skills and co-creation mindset to define problems, ideate, and define solutions.</li><li>You are proficient with modern design, prototyping, remote collaboration tools (e.g., Figma and Miro), and come with interactive prototyping expertise.</li><li>You have systematic design thinking and expertise in creating modular component libraries and design systems.</li><li>You have experience with large-scale content publishing or relevant adjacent expertise around designing for digital-first, editorial content.</li><li>You are able to work collaboratively within a diverse multidisciplinary team and efficiently manage design feedback from multiple stakeholders with an agility to adapt to various organizational working styles (e.g. agile, waterfall, lean etc.)</li><li>You are comfortable with ambiguity and have the ability to reduce it.</li><li>You work in a timezone with at least 4-6 hours of overlap with the GMT timezone.</li></ul></ul></div></div><div class=\"section page-centered\" data-qa=\"salary-range\"><div>$0 - $60 an hour</div><small><div>The expected hourly rate for this role is up to <b>$60 USD</b> per hour. Compensation is determined based on a variety of factors including relevant experience, projects, geographic location, and business needs.</div></small></div><div class=\"section page-centered\" data-qa=\"closing-description\"><div>If you are passionate about 10up's mission and think you have what it takes to be successful in this role even if you don't check all the boxes, please apply. We'd appreciate the opportunity to personally review your application. Everyone gets a response.</div><div><br></div><div>Read more about <a href=\"https://drive.google.com/file/d/1nQ9yWRqfDAdrriYRnBNzYo7w59auYxMe/view\">What to Expect</a> through our Recruiting process.</div><div><br></div><div>Upon meeting the necessary criteria, you'll join the 10up contractor network. This grants you access to project invitations tailored to your expertise and time availability, although project opportunities may not arise instantly.</div></div><div class=\"section page-centered last-section-apply\" data-qa=\"btn-apply-bottom\"><a class=\"postings-btn template-btn-submit hex-color\" data-qa=\"show-page-apply\" href=\"https://jobs.lever.co/10up-2/6e3b39f2-7f2c-48f7-9b94-b5503726213a/apply\">Apply for this job</a></div>","tags":"[\"management\"]","pubDate":"2024-06-16 09:41:40.353","link":"https://jobs.lever.co/10up-2/6e3b39f2-7f2c-48f7-9b94-b5503726213a","savedDate":"2024-06-16 09:41:40.353","slug":"freelance-contract-senior-visual-designer-emea-team-10up-8474"},{"id":1219636822,"title":"Software Engineer, Developer Productivity","company":"Neondatabase","image":"https://remotive.com/job/1917805/logo","description":"<div class=\"h2\"><strong>Neon is an open-source company on a mission to create a cloud-native Postgres database as a service for every developer</strong></div>\n<p>We are looking for a <em>Senior Software Engineer</em> who will join our Developer Productivity team.</p>\n<p>The Developer Productivity team’s mission is to support Neon engineers be productive and to ensure they have the right tooling to test, build, and release code efficiently.</p>\n<p><strong>If you are passionate about reducing build and Continuous Integration run times, improving developer satisfaction, and reducing test flakiness - this role is for you!</strong></p>\n<hr>\n<p>As a DevProd engineer you innately understand the importance of fast feedback cycles and early discovery of bugs. You are an expert at at least one of Python, Golang, Rust, Javascript/Typescript. Ideally, you have experience defining and operating GitHub Action workflows or a similar technology, as well as experience with build systems.</p>\n<p>You are data driven and collect and utilize data from various systems to make sensible changes that positively affect engineer happiness! You are a self-starter and own projects end-to-end, driving them to completion with minimal supervision.</p>\n<p>You have empathy for engineering teams, care strongly about quality code, and implementing and scaling development best-practices.</p>\n<p>The ideal candidate for this role:</p>\n<ul style=\"\">\n<li style=\"\">has experience with Python, Golang, Rust, Javascript/Typescript (and related build chains for these languages, i.e., pip, poetry, bazel, go, cargo, webpack)</li>\n<li style=\"\">has used Docker containers (Dockerfiles, networking, caching, running images) and has a general understanding of Kubernetes concepts (pods, CRDs, rollouts, Helm charts)</li>\n<li style=\"\">has defined, operated, monitored, and improved CI/CD pipelines for multiple languages/build systems (i.e., GitHub Action workflows)</li>\n<li style=\"\">has strong troubleshooting and problem solving skills</li>\n<li style=\"\">has empathy for other engineers</li>\n<li style=\"\">enjoys building and owning services</li>\n<li style=\"\">collaborates effectively with colleagues in multiple locations, working on multiple timezones (we are a fully remote company!)</li>\n</ul>\n<div class=\"h3\"><strong>About Neon</strong></div>\n<p>Neon is building open-source cloud-native PostgreSQL. Our architecture separates storage from compute, allowing for stateless and serverless Postgres. We're a well-funded startup with deep knowledge of Postgres internals and decades of experience building databases. We are a systems company; we work on low-level code with strict performance and correctness requirements.</p>\n<p>Neon was created by a team of Postgres hackers and led by CEO Nikita Shamgunov (co-founder of SingleStore). Neon is built on open-source principles and is focused on giving back to the Postgres and developer communities.</p>\n<div class=\"h3\"><strong>Our Team</strong></div>\n<ul style=\"\">\n<li style=\"\">We are a distributed team of 90 people working from 29 countries (concentrating around North American and European time zones)</li>\n<li style=\"\">We are a team built on open-source cultural principles (transparency, contribution, accountability, and proactivity)</li>\n<li style=\"\">Team with decades of experience building databases and deep knowledge of Postgres internals. We are deeply technical.</li>\n<li style=\"\">We have experienced Postgres committers and hackers on the team (check <a href=\"%22https:/github.com/hlinnaka%22\" rel=\"nofollow\">Heikki</a>, <a href=\"%22https:/github.com/lubennikovaav%22\" rel=\"nofollow\">Anastasia</a>, <a href=\"%22https:/github.com/arssher%22\" rel=\"nofollow\">Arseny</a>, <a href=\"%22https:/github.com/MMeent%22\" rel=\"nofollow\">Matthias</a> profiles)</li>\n<li style=\"\">We believe in the efficacy of collaborative open-source</li>\n<li style=\"\">We aim for a diversity of thoughts and backgrounds</li>\n<li style=\"\">We are keen to be a fast-moving, flat org and avoid hierarchical structures</li>\n</ul>\n<div class=\"h3\"><strong>Our Investors</strong></div>\n<ul style=\"\">\n<li style=\"\">Top-tier investors backed up Neon's vision:\n<ul style=\"\">\n<li style=\"\">We raised $104 million in funding from Menlo Ventures, Notable Capital, Khosla Ventures, General Catalyst, and Founders Fund.</li>\n<li style=\"\">Venture vehicles of Snowflake and Databricks invested in Neon.</li>\n<li style=\"\">Our angel investors are prominent technologists and ecosystem players. More than 20 awesome angels supported Neon, including Nat Friedman, Elad Gil, Mike Ovitz, Ajeet Singh, Guillermo Rauch, Søren Brammer Schmidt, and Wes McKinney.</li>\n<li style=\"\">Our Board includes Quentin Clark, Glenn Solomon, Joe Morrissey, and Tim Tully.</li>\n</ul>\n</li>\n</ul>\n<div class=\"h3\"><strong>Our Offer</strong></div>\n<ul style=\"\">\n<li style=\"\">You have an opportunity to be an early employee in the fast-scaling ambitious team</li>\n<li style=\"\">You can work 100% remote: we'll handle all formalities to arrange work from your home</li>\n<li style=\"\">We pay top of the market in most parts of the world</li>\n<li style=\"\">We grant equity (stock options) to all full-time hires</li>\n<li style=\"\">We offer a competitive benefits package in line with all tech companies (top-notch equipment, unlimited vacations, paid parental leaves, and much more)</li>\n<li style=\"\">We are distributed, yet make our bonds during regular offsites (the last one was in Barcelona)</li>\n</ul>\n<p> </p>\n<img src=\"https://remotive.com/job/track/1917805/blank.gif?source=public_api\" alt=\"\"/>","tags":"[\"golang\",\"python\",\"rust\"]","pubDate":"2024-06-15 03:20:26.000","link":"https://remotive.com/remote-jobs/software-dev/software-engineer-developer-productivity-1917805","savedDate":"2024-06-16 09:41:40.351","slug":"software-engineer-developer-productivity-neondatabase-317"},{"id":8544445920,"title":"Senior Software Engineer, Windows Desktop App (Remote)","company":"DuckDuckGo","image":"https://spreadprivacy.com/content/images/2023/05/duckduckgo-logo_wide.png","description":"<p>Hi, we’re DuckDuckGo, the Internet privacy company for everyone who wants to take back their privacy now. For over a decade, we've been building our all-in-one product, developing new privacy technology, and working with policymakers to make online privacy simple and accessible for all.  <br /></p>\n<p><br /></p>\n<p>Our browsers and extensions have been downloaded over 250 million times with our built-in private search engine, which has delivered over 100 billion searches and is the 2nd largest search engine on mobile in the United States and 17 other countries, including the United Kingdom, Canada, Australia, Germany, Poland, and Spain. Our private search engine is also 3rd in market share in the U.S. and over 20 major markets. Oh, and we've been profitable since 2014, with annual revenue exceeding $100 million!</p>\n<p><br /></p>\n<p>The DuckDuckGo browser’s uniquely comprehensive privacy protections are used by tens of millions of people to protect their everyday online activities on <a href=\"https://spreadprivacy.com/introducing-duckduckgo-for-mac/\" rel=\"noopener\">Mac</a>, <a href=\"https://spreadprivacy.com/windows-browser-open-beta/\" rel=\"noopener\">Windows</a>, <a href=\"https://spreadprivacy.com/duckduckgo-privacy-browser-ios14/\" rel=\"noopener\">iOS</a>, and <a href=\"https://spreadprivacy.com/introducing-app-tracking-protection/\" rel=\"noopener\">Android</a>, from searching to browsing, emailing, and more. We also offer <a href=\"https://spreadprivacy.com/meetprivacypro/\" rel=\"noopener\">Privacy Pro</a>, a three-in-one subscription service that includes a VPN, Personal Information Removal, and Identity Theft Restoration.</p>\n<p><br /></p>\n<p>We’re looking for a <strong><strong>Senior Software Engineer, Windows Desktop App</strong></strong> to help shape our all-in-one privacy solution and join our mission to show the world that protecting your privacy online can be simple.  </p>\n<p><br /></p>\n<p><strong>The Opportunity</strong> </p>\n<p>In this role, you will work on the team responsible for launching our first ever DuckDuckGo Privacy App for Windows. You'll collaborate with Product Managers, Designers, and Engineers across Native Apps to craft a world-class browser with embedded privacy features that will revolutionize the way people search, surf, and exist online. </p>\n<p><br /></p>\n<p>You will be critical to the successful launch of this product and responsible for taking pieces of the puzzle and autonomously building solutions to get us closer to our first release. You will help define the roadmap, take ownership of significant application features and experiment with ways to improve them. </p>\n<p><br /></p>\n<p>You will lay the foundations of what will become one of DuckDuckGo's flagship products and critical levers for growing privacy online. </p>\n<p><br /></p>\n<p><strong>What You Will Bring to DuckDuckGo</strong> </p>\n<ul><li>Experience implementing ideas from scratch, owning major application features, and taking responsibility for their maintenance and improvement over time.</li><li>Experience participating in technical architecture decisions for complex products, essentially shaping the software architecture of a consumer product.</li><li>Experience building at least one desktop application (ideally with WPF, UWP, WinUI, WinForms, or other relevant .NET UI).</li><li>An advanced level of programming expertise, with knowledge of C#. We currently use .NET 6.</li><li>A significant level of experience in building customer facing applications, including crafting user interfaces.<br /></li><li>Deep understanding of software design patterns such as MVVM, MVP, etc.</li><li>Event-driven programming (e.g., using Rx.NET) experience is considered an advantage.</li></ul>\n<p><br /></p>\n<p><strong>How We Will Support You </strong> </p>\n<p>Our core values -- build trust, question assumptions, and validate direction -- underpin how we work day-to-day and the support we give our team members. We strive to empower our team members to be self-directed and self-motivated in their work.  </p>\n<p><br /></p>\n<ul><li><strong>Remote First, Always</strong>: We've always been a fully distributed company with team members all over the world. We trust you to get your work done wherever, whenever.</li><li><strong>Commitment to Personal Growth:</strong> Every team member has an annual budget of $1,250 USD to invest in their professional development. Every team member also has a dedicated Career Advisor, who serves as a guide to help you develop your strengths, identify your motivations, and understand your opportunities for growth.</li><li><strong>Leadership:</strong> We have many different types of leaders and possible combinations of leadership roles, so you can grow your career in a way that aligns best with your personal goals. You can seek additional leadership roles by being directly responsible for projects, taking ownership of areas of the company, developing and maintaining internal processes, or pursuing advisory roles.</li><li><strong>Work/Life Balance: </strong>Team members have the freedom and flexibility to organize their own work schedules. We want you to thrive both in and out of the office. We trust you to use good judgment and take the time off that you need to bring your best self to work.  </li></ul>\n<p><br /></p>\n<p>We also offer <strong>paid parental leave, a co-working stipend, office setup reimbursement, </strong>and<strong> a wellness stipend.</strong> More support resources can be found in our, <u><a href=\"https://duckduckgo.com/assets/hiring/team_support_guide.pdf\" rel=\"noopener\">Team Member Support Guide</a></u>, which explains how we make your well-being a priority. </p>\n<p><br /></p>\n<p>For more information on how we collaborate worldwide, from leadership in our relatively flat organization to start-to-finish ownership, check out <u><a href=\"https://duckduckgo.com/how-we-work\" rel=\"noopener\">DuckDuckGo Culture: How We Work.</a></u> </p>\n<p><br /></p>\n<p><strong>Compensation</strong> </p>\n<p>Annual compensation: <strong>$176,000</strong> <strong>USD</strong> and stock options. Compensation is the same within a professional level, regardless of geographic location or functional area, and the compensation for each professional level is transparent across the organization.</p>\n<p><br /></p>\n<p><strong>Hiring Process</strong> </p>\n<p>Hiring works best when it's a two-way street. Learn how we help you get to know DuckDuckGo and envision your future role here. Find out more about <u><a href=\"https://duckduckgo.com/how-we-hire\" rel=\"noopener\">how we hire</a></u>. </p>\n<p><br /></p>\n<p><strong>Diversity, Equity, and Inclusion</strong> </p>\n<p>DuckDuckGo provides equal work opportunities to all team members and applicants<u>,</u> and it prohibits discrimination and harassment of any type on the basis of race, color, ethnicity, caste, religion, age, sex (including pregnancy), national origin, disability status, genetics, protected veteran status, sexual orientation, gender identity or expression, or any other characteristic protected by our policies or federal, state, or local laws.</p>\n<p><br /></p>\n<p>We want to ensure that our hiring process is accessible. If you need reasonable accommodation for any part of the application process because of a medical condition or disability, please send an email to <u><a rel=\"noopener\">careers@duckduckgo.com</a></u> to let us know the nature of your request.  </p>\n<p><br /></p>\n<p>If you think you might thrive in this environment, we would love to hear from you. </p>\n<p><br /></p>\n<p><strong>Please note that:</strong> </p>\n<ul><li><p>Sometimes we meet up! Expect to travel at least two times a year: once for our all-hands meetup and again for a team retreat (each around 4-5 days). While extenuating circumstances may impact attendance, everyone is strongly encouraged to attend.</p></li><li>While we offer a flexible work arrangement with no core hours, expect an average full-time commitment of 40 hours per week. </li><li>A successful candidate will be subject to a background check and must receive satisfactory results of the same, as a condition of joining the team. </li><li>By applying for this role, you confirm that all information submitted is accurate and complete. You further acknowledge that providing false or fraudulent information during the application process is cause for denial of an offer, revocation of any existing offer, or other adverse action, up to and including termination after the start of your commencement of work.</li></ul>\n<p><br /></p>\n<p>#US #UK #SP #PL #IR #IC #HN #CR #CN #AU</p>","tags":"[\"aws\"]","pubDate":"2024-06-14 23:22:10.000","link":"https://duckduckgo.recruitee.com/o/senior-windows","savedDate":"2024-06-16 09:41:40.353","slug":"senior-software-engineer-windows-desktop-app-remote-duckduckgo-114"},{"id":1205245836,"title":"Full Stack Developer (Backend)","company":"Reverse Tech","image":"https://remotive.com/job/1917887/logo","description":"<p>At Reverse Tech, we are on a mission to create, launch, and scale digital product brands in the health and wellness space. Our goal is ambitious – we aim to help 10 million people improve their health by 2026 through hyper-targeted, mass-scale brands. We specialize in subscription-based business models and pride ourselves on being results-focused, with no big egos, just big data.</p>\n<p><strong>What We Want to Achieve:</strong></p>\n<p>Our vision is to discover novel self-serve solutions to the world's greatest health problems, all while adhering to our core values.</p>\n<p>We're looking for a Full Stack Developer, focused on Backend that will be a vital part of our dynamic remote team. Your role is instrumental in building and scaling our mobile apps within the health and wellness vertical.</p>\n<p><strong>Requirements</strong></p>\n<ul style=\"\">\n<li style=\"\">At least 5 years of experience working in a similar role</li>\n<li style=\"\">Proficient in Node.js and TypeScript</li>\n<li style=\"\">Experience developing applications using frameworks such as NestJS and Express</li>\n<li style=\"\">Knowledge and experience with Docker</li>\n<li style=\"\">Experience with Non-Relational (Redis, MongoDB) and Relational DB (PostgreSQL)</li>\n<li style=\"\">Strong knowledge of DDD and Hexagonal Architecture</li>\n<li style=\"\">Experience developing and sacaling RESTful APIs</li>\n<li style=\"\">Experience with Event Driven Architecture</li>\n<li style=\"\">Ensure high code quality through code reviews, writing tests, and adhering to best practices in software development</li>\n<li style=\"\">You have a keen interest in testing culture</li>\n<li style=\"\">Experience creating efficient real-time systems using Pub/Sub models</li>\n<li style=\"\">Experience contributing to the design and architecture of scalable, high-performance, and reliable systems</li>\n<li style=\"\">Proficiency in working with git and gitflow</li>\n<li style=\"\">Knowledge of software security standards, threat assessment, and secure programming methodologies</li>\n<li style=\"\">You are a strong team player, being part of an agile team, actively taking care of team culture and the product value towards our customers</li>\n<li style=\"\">Our company language is English, so you should write, read and speak it fluently</li>\n</ul>\n<p> </p>\n<p><strong>Desired Skills</strong></p>\n<ul style=\"\">\n<li style=\"\">Experience working in Product Team/s focusing on delivering value</li>\n<li style=\"\">Experience working under Agile frameworks/methods such as Scrum, Kanban, SAFe, Lean, etc</li>\n<li style=\"\">Experience working in a performance marketing product</li>\n<li style=\"\">Experience working in e-commerce</li>\n</ul>\n<p> </p>\n<div class=\"h3\">Our Values:</div>\n<ul style=\"\">\n<li style=\"\"><strong> Care: </strong>We support and stand by our team members in any situation, ensuring that no one is left behind.</li>\n<li style=\"\"><strong> Extreme Ownership: </strong>We take responsibility not only for tasks under our direct control but for anything that impacts our mission's success.</li>\n<li style=\"\"><strong> Identification: </strong>We take pride in being part of something bigger than ourselves, with the goal of changing the world by helping people get healthier.</li>\n<li style=\"\"><strong> Communication: </strong>We value honesty and direct language, fostering a culture free of politics.</li>\n<li style=\"\"><strong> Performance: </strong>We believe in providing full freedom while striving for top-notch performance from everyone.</li>\n<li style=\"\"><strong> Trust: </strong>We value the words and qualities of our team members, fostering an environment of trust and respect</li>\n</ul>\n<p><strong>Benefits</strong></p>\n<p><strong>What Our Team Members Get:</strong></p>\n<ul style=\"\">\n<li style=\"\">100% remote and flexible work hours</li>\n<li style=\"\">Top notch equipment (MacBook Pro or PC, you decide)</li>\n<li style=\"\">Full-time or freelance opportunities</li>\n<li style=\"\">Learning from the best, including ex-Googlers and more</li>\n<li style=\"\">Unlimited growth prospects</li>\n<li style=\"\">Inclusion in a winning team</li>\n<li style=\"\">Competitive compensation</li>\n<li style=\"\">A fun, non-corporate atmosphere</li>\n</ul>\n<p> </p>\n<p>If you're passionate about Engineering, have experience in Full Stack, and are ready to join a dynamic, global team, we encourage you to apply. Help us shape the future of health and wellness through technology.</p>\n<p>Learn more about us at <a class=\"external\" href=\"https://www.reverse.tech/\" rel=\"nofollow\">https://www.reverse.tech/</a> and apply today to become a key player in our exciting journey.</p>\n<p> </p>\n<p><em>*This position is offered as a Remote option, reach out to us to evaluate the options according to your location.</em></p>\n<p><br><br></p>\n<div class=\"h2\">About the company</div>\n<p> </p>\n<p>At Reverse Tech, we're a rapidly growing digital health and wellness company on a mission to create, launch, and scale hyper-targeted, mass-scale brands. Our ambitious goal is to improve the health of 10 million people by 2026 through innovative subscription-based solutions.</p>\n<p>With a presence in over 205 countries and a 5x year-over-year growth rate, we offer a dynamic, remote work environment across 20+ locations worldwide.</p>\n<p>We attract top-tier professionals who hunger for success and reward them with competitive salaries. Our culture is free of corporate nonsense, providing a place for you to enjoy your work and achieve your professional ambitions. Join us for an exciting venture!</p>\n<img src=\"https://remotive.com/job/track/1917887/blank.gif?source=public_api\" alt=\"\"/>","tags":"[\"docker\",\"node.js\"]","pubDate":"2024-06-14 11:20:50.000","link":"https://remotive.com/remote-jobs/software-dev/full-stack-developer-backend-1917887","savedDate":"2024-06-16 09:41:40.352","slug":"full-stack-developer-backend-reverse-tech-6094"},{"id":3441515108,"title":"Investment consultant","company":"REALISTE Technology LTD","image":"https://remotive.com/job/1918852/logo","description":"<p style=\"font-style: normal; font-variant-caps: normal; font-stretch: normal; line-height: normal; font-kerning: auto; font-variant-alternates: normal; font-variant-ligatures: normal; font-variant-numeric: normal; font-variant-east-asian: normal; font-variant-position: normal; font-variant-emoji: normal; font-feature-settings: normal; font-optical-sizing: auto; font-variation-settings: normal; color: #000000;\"> </p>\n<p style=\"font-style: normal; font-variant-caps: normal; font-stretch: normal; line-height: normal; font-kerning: auto; font-variant-alternates: normal; font-variant-ligatures: normal; font-variant-numeric: normal; font-variant-east-asian: normal; font-variant-position: normal; font-variant-emoji: normal; font-feature-settings: normal; font-optical-sizing: auto; font-variation-settings: normal; color: #000000; min-height: 15px;\"> </p>\n<p style=\"font-style: normal; font-variant-caps: normal; font-stretch: normal; line-height: normal; font-kerning: auto; font-variant-alternates: normal; font-variant-ligatures: normal; font-variant-numeric: normal; font-variant-east-asian: normal; font-variant-position: normal; font-variant-emoji: normal; font-feature-settings: normal; font-optical-sizing: auto; font-variation-settings: normal; color: #000000;\">Realiste AI, the world's first AI for Real Estate, is seeking sales professionals experienced in Real Estate to manage inquiries from international investors eager to acquire properties across the globe.</p>\n<p style=\"font-style: normal; font-variant-caps: normal; font-stretch: normal; line-height: normal; font-kerning: auto; font-variant-alternates: normal; font-variant-ligatures: normal; font-variant-numeric: normal; font-variant-east-asian: normal; font-variant-position: normal; font-variant-emoji: normal; font-feature-settings: normal; font-optical-sizing: auto; font-variation-settings: normal; color: #000000; min-height: 15px;\"> </p>\n<p style=\"font-style: normal; font-variant-caps: normal; font-stretch: normal; line-height: normal; font-kerning: auto; font-variant-alternates: normal; font-variant-ligatures: normal; font-variant-numeric: normal; font-variant-east-asian: normal; font-variant-position: normal; font-variant-emoji: normal; font-feature-settings: normal; font-optical-sizing: auto; font-variation-settings: normal; color: #000000; min-height: 15px;\"> </p>\n<p style=\"font-style: normal; font-variant-caps: normal; font-stretch: normal; line-height: normal; font-kerning: auto; font-variant-alternates: normal; font-variant-ligatures: normal; font-variant-numeric: normal; font-variant-east-asian: normal; font-variant-position: normal; font-variant-emoji: normal; font-feature-settings: normal; font-optical-sizing: auto; font-variation-settings: normal; color: #000000;\"><strong>What is in it for you:</strong></p>\n<p style=\"font-style: normal; font-variant-caps: normal; font-stretch: normal; line-height: normal; font-kerning: auto; font-variant-alternates: normal; font-variant-ligatures: normal; font-variant-numeric: normal; font-variant-east-asian: normal; font-variant-position: normal; font-variant-emoji: normal; font-feature-settings: normal; font-optical-sizing: auto; font-variation-settings: normal; color: #000000; min-height: 15px;\"> </p>\n<p style=\"font-style: normal; font-variant-caps: normal; font-stretch: normal; line-height: normal; font-kerning: auto; font-variant-alternates: normal; font-variant-ligatures: normal; font-variant-numeric: normal; font-variant-east-asian: normal; font-variant-position: normal; font-variant-emoji: normal; font-feature-settings: normal; font-optical-sizing: auto; font-variation-settings: normal; color: #000000;\"> • Competitive income: $180k-$550k/year income</p>\n<p style=\"font-style: normal; font-variant-caps: normal; font-stretch: normal; line-height: normal; font-kerning: auto; font-variant-alternates: normal; font-variant-ligatures: normal; font-variant-numeric: normal; font-variant-east-asian: normal; font-variant-position: normal; font-variant-emoji: normal; font-feature-settings: normal; font-optical-sizing: auto; font-variation-settings: normal; color: #000000;\"> • Comprehensive training provided</p>\n<p style=\"font-style: normal; font-variant-caps: normal; font-stretch: normal; line-height: normal; font-kerning: auto; font-variant-alternates: normal; font-variant-ligatures: normal; font-variant-numeric: normal; font-variant-east-asian: normal; font-variant-position: normal; font-variant-emoji: normal; font-feature-settings: normal; font-optical-sizing: auto; font-variation-settings: normal; color: #000000;\"> • High demand: unlimited customer traffic with global sales opportunities, receiving at least 5 customer inquiries per day</p>\n<p style=\"font-style: normal; font-variant-caps: normal; font-stretch: normal; line-height: normal; font-kerning: auto; font-variant-alternates: normal; font-variant-ligatures: normal; font-variant-numeric: normal; font-variant-east-asian: normal; font-variant-position: normal; font-variant-emoji: normal; font-feature-settings: normal; font-optical-sizing: auto; font-variation-settings: normal; color: #000000;\"> • Established client base, steady stream of incoming orders.</p>\n<p style=\"font-style: normal; font-variant-caps: normal; font-stretch: normal; line-height: normal; font-kerning: auto; font-variant-alternates: normal; font-variant-ligatures: normal; font-variant-numeric: normal; font-variant-east-asian: normal; font-variant-position: normal; font-variant-emoji: normal; font-feature-settings: normal; font-optical-sizing: auto; font-variation-settings: normal; color: #000000;\"> • Strong market presence with an office in Dubai, offering flexibility to work from the office or remotely</p>\n<p style=\"font-style: normal; font-variant-caps: normal; font-stretch: normal; line-height: normal; font-kerning: auto; font-variant-alternates: normal; font-variant-ligatures: normal; font-variant-numeric: normal; font-variant-east-asian: normal; font-variant-position: normal; font-variant-emoji: normal; font-feature-settings: normal; font-optical-sizing: auto; font-variation-settings: normal; color: #000000;\"> • A team of top-notch professionals</p>\n<p style=\"font-style: normal; font-variant-caps: normal; font-stretch: normal; line-height: normal; font-kerning: auto; font-variant-alternates: normal; font-variant-ligatures: normal; font-variant-numeric: normal; font-variant-east-asian: normal; font-variant-position: normal; font-variant-emoji: normal; font-feature-settings: normal; font-optical-sizing: auto; font-variation-settings: normal; color: #000000;\"> • Multiple financial bonuses and company social events </p>\n<p style=\"font-style: normal; font-variant-caps: normal; font-stretch: normal; line-height: normal; font-kerning: auto; font-variant-alternates: normal; font-variant-ligatures: normal; font-variant-numeric: normal; font-variant-east-asian: normal; font-variant-position: normal; font-variant-emoji: normal; font-feature-settings: normal; font-optical-sizing: auto; font-variation-settings: normal; color: #000000; min-height: 15px;\"> </p>\n<p style=\"font-style: normal; font-variant-caps: normal; font-stretch: normal; line-height: normal; font-kerning: auto; font-variant-alternates: normal; font-variant-ligatures: normal; font-variant-numeric: normal; font-variant-east-asian: normal; font-variant-position: normal; font-variant-emoji: normal; font-feature-settings: normal; font-optical-sizing: auto; font-variation-settings: normal; color: #000000;\"><strong>The Role:</strong></p>\n<p style=\"font-style: normal; font-variant-caps: normal; font-stretch: normal; line-height: normal; font-kerning: auto; font-variant-alternates: normal; font-variant-ligatures: normal; font-variant-numeric: normal; font-variant-east-asian: normal; font-variant-position: normal; font-variant-emoji: normal; font-feature-settings: normal; font-optical-sizing: auto; font-variation-settings: normal; color: #000000; min-height: 15px;\"> </p>\n<p style=\"font-style: normal; font-variant-caps: normal; font-stretch: normal; line-height: normal; font-kerning: auto; font-variant-alternates: normal; font-variant-ligatures: normal; font-variant-numeric: normal; font-variant-east-asian: normal; font-variant-position: normal; font-variant-emoji: normal; font-feature-settings: normal; font-optical-sizing: auto; font-variation-settings: normal; color: #000000;\"> • Lead management: efficient communication with warm leads</p>\n<p style=\"font-style: normal; font-variant-caps: normal; font-stretch: normal; line-height: normal; font-kerning: auto; font-variant-alternates: normal; font-variant-ligatures: normal; font-variant-numeric: normal; font-variant-east-asian: normal; font-variant-position: normal; font-variant-emoji: normal; font-feature-settings: normal; font-optical-sizing: auto; font-variation-settings: normal; color: #000000;\"> • Handling a high volume of calls each day</p>\n<p style=\"font-style: normal; font-variant-caps: normal; font-stretch: normal; line-height: normal; font-kerning: auto; font-variant-alternates: normal; font-variant-ligatures: normal; font-variant-numeric: normal; font-variant-east-asian: normal; font-variant-position: normal; font-variant-emoji: normal; font-feature-settings: normal; font-optical-sizing: auto; font-variation-settings: normal; color: #000000;\"> • Investment guidance: you’ll ask insightful questions to understand investor goals and guide them through the investment process</p>\n<p style=\"font-style: normal; font-variant-caps: normal; font-stretch: normal; line-height: normal; font-kerning: auto; font-variant-alternates: normal; font-variant-ligatures: normal; font-variant-numeric: normal; font-variant-east-asian: normal; font-variant-position: normal; font-variant-emoji: normal; font-feature-settings: normal; font-optical-sizing: auto; font-variation-settings: normal; color: #000000;\"> • Proposal development: send detailed email proposals on investment opportunities</p>\n<p style=\"font-style: normal; font-variant-caps: normal; font-stretch: normal; line-height: normal; font-kerning: auto; font-variant-alternates: normal; font-variant-ligatures: normal; font-variant-numeric: normal; font-variant-east-asian: normal; font-variant-position: normal; font-variant-emoji: normal; font-feature-settings: normal; font-optical-sizing: auto; font-variation-settings: normal; color: #000000;\"> • Perform related administrative tasks to support sales activities</p>\n<p style=\"font-style: normal; font-variant-caps: normal; font-stretch: normal; line-height: normal; font-kerning: auto; font-variant-alternates: normal; font-variant-ligatures: normal; font-variant-numeric: normal; font-variant-east-asian: normal; font-variant-position: normal; font-variant-emoji: normal; font-feature-settings: normal; font-optical-sizing: auto; font-variation-settings: normal; color: #000000;\"> • Assist with sales progression and coordinate with third parties to ensure transaction completion</p>\n<p style=\"font-style: normal; font-variant-caps: normal; font-stretch: normal; line-height: normal; font-kerning: auto; font-variant-alternates: normal; font-variant-ligatures: normal; font-variant-numeric: normal; font-variant-east-asian: normal; font-variant-position: normal; font-variant-emoji: normal; font-feature-settings: normal; font-optical-sizing: auto; font-variation-settings: normal; color: #000000; min-height: 15px;\"> </p>\n<p style=\"font-style: normal; font-variant-caps: normal; font-stretch: normal; line-height: normal; font-kerning: auto; font-variant-alternates: normal; font-variant-ligatures: normal; font-variant-numeric: normal; font-variant-east-asian: normal; font-variant-position: normal; font-variant-emoji: normal; font-feature-settings: normal; font-optical-sizing: auto; font-variation-settings: normal; color: #000000;\"><span style=\"letter-spacing: 0.75px;\"><strong>Skills required:<br></strong></span> </p>\n<p style=\"font-style: normal; font-variant-caps: normal; font-stretch: normal; line-height: normal; font-kerning: auto; font-variant-alternates: normal; font-variant-ligatures: normal; font-variant-numeric: normal; font-variant-east-asian: normal; font-variant-position: normal; font-variant-emoji: normal; font-feature-settings: normal; font-optical-sizing: auto; font-variation-settings: normal; color: #000000;\"> • Exceptional verbal, written and communication skills.</p>\n<p style=\"font-style: normal; font-variant-caps: normal; font-stretch: normal; line-height: normal; font-kerning: auto; font-variant-alternates: normal; font-variant-ligatures: normal; font-variant-numeric: normal; font-variant-east-asian: normal; font-variant-position: normal; font-variant-emoji: normal; font-feature-settings: normal; font-optical-sizing: auto; font-variation-settings: normal; color: #000000;\"> • Minimum of 5 years of real estate sales experience with a consistent earning of &gt;$7,000/month</p>\n<p style=\"font-style: normal; font-variant-caps: normal; font-stretch: normal; line-height: normal; font-kerning: auto; font-variant-alternates: normal; font-variant-ligatures: normal; font-variant-numeric: normal; font-variant-east-asian: normal; font-variant-position: normal; font-variant-emoji: normal; font-feature-settings: normal; font-optical-sizing: auto; font-variation-settings: normal; color: #000000;\"> • Deep understanding of investment instruments and terminology is a must </p>\n<p style=\"font-style: normal; font-variant-caps: normal; font-stretch: normal; line-height: normal; font-kerning: auto; font-variant-alternates: normal; font-variant-ligatures: normal; font-variant-numeric: normal; font-variant-east-asian: normal; font-variant-position: normal; font-variant-emoji: normal; font-feature-settings: normal; font-optical-sizing: auto; font-variation-settings: normal; color: #000000;\"> • Strong ability to listen and follow instructions to enhance product, industry and sales knowledge</p>\n<p style=\"font-style: normal; font-variant-caps: normal; font-stretch: normal; line-height: normal; font-kerning: auto; font-variant-alternates: normal; font-variant-ligatures: normal; font-variant-numeric: normal; font-variant-east-asian: normal; font-variant-position: normal; font-variant-emoji: normal; font-feature-settings: normal; font-optical-sizing: auto; font-variation-settings: normal; color: #000000;\"> • Deep understanding of investment instruments and terminology</p>\n<p style=\"font-style: normal; font-variant-caps: normal; font-stretch: normal; line-height: normal; font-kerning: auto; font-variant-alternates: normal; font-variant-ligatures: normal; font-variant-numeric: normal; font-variant-east-asian: normal; font-variant-position: normal; font-variant-emoji: normal; font-feature-settings: normal; font-optical-sizing: auto; font-variation-settings: normal; color: #000000; min-height: 15px;\"> </p>\n<p style=\"font-style: normal; font-variant-caps: normal; font-stretch: normal; line-height: normal; font-kerning: auto; font-variant-alternates: normal; font-variant-ligatures: normal; font-variant-numeric: normal; font-variant-east-asian: normal; font-variant-position: normal; font-variant-emoji: normal; font-feature-settings: normal; font-optical-sizing: auto; font-variation-settings: normal; color: #000000;\">Please note that completing the onboarding process is a crucial step in our candidate selection process. You will receive a link to this process after applying for the position. The onboarding should take no more than 10-15 minutes, enabling us to quickly review your application and provide feedback. </p>\n<p style=\"font-style: normal; font-variant-caps: normal; font-stretch: normal; line-height: normal; font-kerning: auto; font-variant-alternates: normal; font-variant-ligatures: normal; font-variant-numeric: normal; font-variant-east-asian: normal; font-variant-position: normal; font-variant-emoji: normal; font-feature-settings: normal; font-optical-sizing: auto; font-variation-settings: normal; color: #000000; min-height: 15px;\"> </p>\n<p style=\"font-style: normal; font-variant-caps: normal; font-stretch: normal; line-height: normal; font-kerning: auto; font-variant-alternates: normal; font-variant-ligatures: normal; font-variant-numeric: normal; font-variant-east-asian: normal; font-variant-position: normal; font-variant-emoji: normal; font-feature-settings: normal; font-optical-sizing: auto; font-variation-settings: normal; color: #000000;\">We highly value your time and welcome your feedback on our candidate selection process.</p>\n<img src=\"https://remotive.com/job/track/1918852/blank.gif?source=public_api\" alt=\"\"/>","tags":"[\"AI/ML\",\"onboarding\"]","pubDate":"2024-06-14 06:39:45.000","link":"https://remotive.com/remote-jobs/sales-business/investment-consultant-1918852","savedDate":"2024-06-16 09:41:40.352","slug":"investment-consultant-realiste-technology-ltd-4379"},{"id":2190925564,"title":"Junior Data Annotation Specialist - AI Tutor","company":"Mindrift","image":"https://remotive.com/job/1918851/logo","description":"<p>Annotation drives AI’s capabilities.</p>\n<p>Industries across the board are embracing AI, and the backbone of this revolution is accurate data labeling (data annotation). As an <strong>AI Tutor - Expert Annotator</strong>, you will not just be performing routine tasks; you are a meticulous specialist ensuring the highest quality of data markup. In this role, you help pave the way for more reliable and responsible AI models by laying the groundwork through precise annotation.</p>\n<p><strong><br>Responsibilities:</strong></p>\n<ul style=\"\">\n<li style=\"\">Accurately label and annotate data following comprehensive project guidelines.</li>\n<li style=\"\">Make justified decisions on ambiguous content by applying critical thinking to preserve the integrity of the dataset. </li>\n<li style=\"\">Actively collaborate with team members to discuss and resolve ambiguities, align on best practices, and enhance project outcomes.</li>\n<li style=\"\">Consistently adhere to established data labeling standards and protocols, ensuring the highest quality and reliability of data.</li>\n</ul>\n<p><br><br><strong>Requirements</strong><br><br></p>\n<p>Our ideal candidate:</p>\n<ul style=\"\">\n<li style=\"\">Has great command of English: advanced (C1) / proficiency (C2) / native level.</li>\n<li style=\"\">Has a keen eye for detail: precision is paramount in data labeling.</li>\n<li style=\"\">Is a dedicated performer who recognizes the importance of even routine tasks.</li>\n</ul>\n<p><br><br><strong>Benefits</strong><br><br></p>\n<ul style=\"\">\n<li style=\"\">Be part of a significant project for a leading technology company, making a substantial impact on the future of AI.</li>\n<li style=\"\">Enjoy the flexibility of a part-time, remote role that accommodates your schedule.</li>\n<li style=\"\">Try your hand at an AI project and enrich your portfolio with new experiences.</li>\n</ul>\n<img src=\"https://remotive.com/job/track/1918851/blank.gif?source=public_api\" alt=\"\"/>","tags":"[\"AI/ML\",\"backbone\"]","pubDate":"2024-06-14 06:38:32.000","link":"https://remotive.com/remote-jobs/all-others/junior-data-annotation-specialist-ai-tutor-1918851","savedDate":"2024-06-16 09:41:40.352","slug":"junior-data-annotation-specialist-ai-tutor-mindrift-2737"},{"id":1821275088,"title":"Director of Cloud Engineering","company":"Halcyon","image":"https://remotive.com/job/1917889/logo","description":"<div class='\"content-intro\"'>\n<p><strong>What we do:</strong><br>Halcyon is the industry’s first dedicated, adaptive security platform that combines multiple proprietary advanced prevention engines along with AI models focused specifically on stopping ransomware.</p>\n<p><strong>Who we are:</strong><br>Halcyon was formed in 2021 by a team of cyber industry veterans after battling the scourge of ransomware (and advanced threats) for years at some of the largest global security vendors. Comprised of leaders from Cylance (now Blackberry), Accuvant (now Optiv), Fireye and ISS X-Force (now IBM), Halcyon is focused on building products and solutions for mid-market and enterprise customers.</p>\n<p>As a remote-native, completely distributed global team, we recognize great talent can exist anywhere. We invite you to apply to a job you’re interested in and we'll work a plan to meet your needs.</p>\n</div>\n<p><strong>The Role:</strong></p>\n<p>Halcyon’s goal is to deliver an anti-ransomware solution that breaks new ground as to what a security product can deliver.  Aligned with this goal, Halcyon is looking for an experienced Director of Cloud Engineering who will be responsible for leading a talented team of engineers focused on building and maintaining Halcyon’s cloud infrastructure and applications that power the Halcyon anti-ransomware platform. You will oversee all aspects of cloud product development, from initial design to deployment and support, ensuring that our solutions meet the highest standards of performance, reliability and scalability. Your leadership will be pivotal in driving innovation and ensuring Halcyon’s competitive edge in the cybersecurity market. The ideal person will be comfortable getting their hands dirty and being highly technical as required in a startup environment, but balance that with being an exceptional leader of engineering teams, leading from the front with a focus on execution and delivery.</p>\n<p><strong>Responsibilities:</strong></p>\n<ul class='\"ak-ul\"' style=\"\">\n<li style=\"\">\n<p><strong>Leadership and Management:</strong> Lead, mentor, and manage a team of engineers with diverse backgrounds, fostering a culture of collaboration, innovation, and continuous improvement. This includes ownership of development and delivery of streaming data pipelines, internal and customer facing API’s, Web based UI, and DevOps.</p>\n</li>\n<li style=\"\">\n<p><strong>Product Development:</strong> Oversee the design, development, testing, deployment, and support of cloud-based product features, ensuring they meet business and technical requirements.</p>\n</li>\n<li style=\"\">\n<p><strong>Technical Oversight:</strong> Ensure the team writes high-quality, scalable code that interacts with various data stores like Postgres, DynamoDB, OpenSearch, and Kafka.</p>\n</li>\n<li style=\"\">\n<p><strong>Code Quality and Reviews:</strong> Promote and enforce best practices for coding, testing, and documentation. Conduct and facilitate peer code reviews to maintain code quality and consistency.</p>\n</li>\n<li style=\"\">\n<p><strong>Performance Optimization:</strong> Diagnose and enhance code performance, addressing any overhead or incompatibilities that arise.</p>\n</li>\n<li style=\"\">\n<p><strong>Collaboration:</strong> Work closely with other development teams, product, and engineering peers along with other stakeholders to ensure seamless integration of components within the product architecture.</p>\n</li>\n<li style=\"\">\n<p><strong>Infrastructure Management:</strong> Oversee the management of AWS infrastructure using infrastructure as code principles and ensure smooth deployment of applications on Kubernetes.</p>\n</li>\n<li style=\"\">\n<p><strong>Continuous Integration:</strong> Maintain and enhance the continuous integration pipeline to streamline development processes and improve deployment efficiency.</p>\n</li>\n<li style=\"\">\n<p><strong>Communication:</strong> Act as a key point of contact for the Cloud Engineering team, ensuring clear communication of goals, progress, and challenges across the organization.</p>\n</li>\n</ul>\n<p> </p>\n<p><strong>Skills and Qualifications:</strong></p>\n<ul class='\"ak-ul\"' style=\"\">\n<li style=\"\">\n<p><strong>Architectural and Implementation Guidance:</strong> Strong ability to provide architectural and implementation guidance to the team, ensuring best practices and strategic alignment in design and execution.</p>\n</li>\n<li style=\"\">\n<p><strong>Technical Expertise:</strong> Strong background in developing high-quality code with experience in multiple programming languages. Comfort and experience building cloud components or leading teams responsible for streaming data pipelines, API’s, UI, in Scala/Java/Kotlin, Python, Rust and React.</p>\n</li>\n<li style=\"\">\n<p><strong>Database Proficiency:</strong> Experience with Postgres, DynamoDB, OpenSearch, or comparable databases.</p>\n</li>\n<li style=\"\">\n<p><strong>Cloud Infrastructure:</strong> Comfortable managing AWS infrastructure and deploying applications on Kubernetes. Experience with infrastructure as code tools.</p>\n</li>\n<li style=\"\">\n<p><strong>Leadership Experience:</strong> Proven track record of leading and managing engineering teams, with the ability to inspire and motivate team members.</p>\n</li>\n<li style=\"\">\n<p><strong>Analytical Skills:</strong> Strong problem-solving and analytical skills, with the ability to diagnose and address performance issues.</p>\n</li>\n<li style=\"\">\n<p><strong>Communication Skills:</strong> Excellent communication and interpersonal skills, with the ability to work effectively with cross-functional teams and stakeholders.</p>\n</li>\n</ul>\n<p><strong>Benefits: </strong></p>\n<p><strong> </strong>Halcyon offers the following benefits to eligible employees:</p>\n<ul style=\"\">\n<li style=\"\">\n<p>Comprehensive healthcare (medical, dental, and vision) with premiums paid in full for employees and dependents.</p>\n</li>\n<li style=\"\">\n<p>401k plan with a generous employer contribution.</p>\n</li>\n<li style=\"\">\n<p>Short and long-term disability coverage, basic life and AD&amp;D insurance plans.</p>\n</li>\n<li style=\"\">\n<p>Medical and dependent care FSA options.</p>\n</li>\n<li style=\"\">\n<p>Flexible PTO policy.</p>\n</li>\n<li style=\"\">\n<p>Parental leave.</p>\n</li>\n<li style=\"\">\n<p>Generous equity offering.</p>\n</li>\n</ul>\n<p>The Company reserves the right to modify or change these benefits programs at any time, with or without notice.​</p>\n<p><strong>Base Salary Range</strong>: $200,000 - $250,000</p>\n<p><strong>Bonus Target:</strong> 15%</p>\n<div class='\"content-conclusion\"'>\n<p>In accordance with applicable state and federal laws, the range provided is Halcyon’s reasonable estimate of the base compensation for this role. The actual amount may differ based on non-discriminatory factors such as experience, knowledge, skills, abilities, and location. Base pay is one part of the total package that is provided to compensate and recognize employees for their work, and this role may be eligible for additional discretionary bonuses/incentives, and equity in the Company.</p>\n<p><strong>We understand it takes a diverse team of highly intelligent, passionate, curious, and creative people to develop the exceptional product we are building. Our dynamic team has incredible perspectives to share, just as we know you do, and we take great pride in being an equal opportunity employer.</strong></p>\n</div>\n<img src=\"https://remotive.com/job/track/1917889/blank.gif?source=public_api\" alt=\"\"/>","tags":"[\"AWS\",\"kubernetes\",\"python\",\"react\",\"rust\"]","pubDate":"2024-06-14 05:20:41.000","link":"https://remotive.com/remote-jobs/software-dev/director-of-cloud-engineering-1917889","savedDate":"2024-06-16 09:41:40.352","slug":"director-of-cloud-engineering-halcyon-9821"},{"id":5923861066,"title":"General Magic - Praise Technical Community Manager","company":"Giveth","image":"https://remotive.com/job/1918053/logo","description":"<p dir=\"ltr\"><em><strong>Who are we at General Magic and Praise?</strong></em></p>\n<p dir=\"ltr\">We’re an elite squad of designers, developers, system architects, researchers, writers and seasoned Web3 professionals. Our Mission is to make magic happen! We do this by building user-centric products and supporting blockchain startups in their mission to bring positive change to society. We are dedicated to enhancing the user experience of a decentralized, censorship-resistant, and democratic internet.</p>\n<p dir=\"ltr\"> </p>\n<p dir=\"ltr\">Praise is a community intelligence system that promotes active participation and collaboration through peer recognition and rewards. We help communities become more intelligent, productive and inclusive by providing a simple way for community members to acknowledge, praise and reward each other’s contributions. Check out more product details on our website, <a href=\"https://givepraise.xyz/\" rel=\"nofollow\">https://givepraise.xyz/</a>.</p>\n<p dir=\"ltr\"><em> </em></p>\n<p dir=\"ltr\"><strong><em>About the Role?</em></strong><br>We're seeking a dedicated Technical Community Growth Manager to drive the adoption and future planning of our Praise system. Praise is a recognition tool designed to acknowledge and reward community contributions through attestations and, potentially. This role is pivotal in ensuring that the system not only achieves widespread use but also continues to evolve in alignment in reaching more Web3 communities and governance objectives.</p>\n<p dir=\"ltr\"> </p>\n<p><strong><em>Qualifications</em></strong></p>\n<ul style=\"\">\n<li style=\"\">Expertise in leveraging data for strategic decisions, measuring impact, and guiding future development of community tools.</li>\n<li style=\"\">Demonstrated ability to lead projects with a strategic vision, particularly those focused on technology adoption and community engagement.</li>\n<li style=\"\">A strong grasp of Praise recognition system; Praise’s impact on community dynamics, and decentralized governance.</li>\n<li style=\"\">Proven experience in fostering active and engaged communities, with a talent for motivating participation and recognizing contributions.</li>\n<li style=\"\">Competence in using data to guide strategic decisions, measure impact, and plan for the future development of community tools.</li>\n<li style=\"\">Exceptional skills in communicating complex ideas simply and gathering input from a diverse range of stakeholders. Be fluent in written and verbal English, and maintain confidentiality.</li>\n</ul>\n<ul style=\"\">\n<li style=\"\">Technical Strategy: Propose and contribute to the development of the Praise roadmap from a technical perspective.<br>Architecture of Praise: Develop the Praise infrastructure to improve the adoption of Praise.</li>\n<li style=\"\">Operational Oversight: Monitor the performance of the Praise system, addressing any technical or usability issues promptly to maintain a high level of user satisfaction.</li>\n<li style=\"\">Governance Integration: Involvement in governance to understand the needs of the communities and translate them into improved functionality.</li>\n<li style=\"\">Community Engagement: Support the community area with new ideas to to build a culture of recognition and participation through growth on Twitter and Farcaster.</li>\n<li style=\"\">Drive Praise Adoption: Strategize and implement initiatives to increase the use of Praise across Web3 communities and organizations.</li>\n<li style=\"\">Stakeholder Collaboration: Engage with various stakeholders, including community members, developers, and governance bodies, to ensure the Praise system aligns with broader technical goals.</li>\n</ul>\n<p><strong><em>Why Join Us?</em></strong></p>\n<ul style=\"\">\n<li style=\"\">Stakeholder Collaboration: Engage with various stakeholders, including community members, developers, and governance bodies, to ensure the Praise system aligns with broader technical goals.</li>\n<li style=\"\">Impactful Mission: Play a crucial role in enhancing governance accessibility and community engagement within a leading blockchain ecosystem.</li>\n<li style=\"\">Dynamic Environment: Thrive in a role that offers continuous learning and the opportunity to shape the future of decentralized governance.</li>\n<li style=\"\">Collaborative Team: Work with a passionate team dedicated to creating a positive and inclusive community culture.</li>\n<li style=\"\">Flexible Work Schedule: Our team navigates time zones all over the world.<strong><em><br></em></strong></li>\n</ul>\n<p><strong><em><br>Payment and Perks</em></strong></p>\n<ul style=\"\">\n<li style=\"\">Work in the remote location of your choice; ideally between Europe, North America, and South America.</li>\n<li style=\"\">Stablecoin crypto payment.</li>\n<li style=\"\">Additional compensation package of tokens - reap the rewards of what you help create!</li>\n<li style=\"\">Flexible vacation time - Because the personal/work life balance matters.</li>\n</ul>\n<p>The ecosystem of decentralized technology is quickly expanding in Web3, Open Source, and beyond. If you value exponential professional growth and learning about new technology while contributing to the greater good; this position is for you. We look forward to meeting you and Building the Future of Praise together!</p>\n<p><strong> </strong></p>\n<p><strong>More Resources about Praise and General Magic </strong><br><a href=\"https://gov.optimism.io/t/final-improving-governance-accessibility-through-praise-and-contribution-based-attestations/6150\" rel=\"nofollow\">https://gov.optimism.io/t/final-improving-governance-accessibility-through-praise-and-contribution-based-attestations/6150</a></p>\n<p><a href=\"https://www.generalmagic.io/\" rel=\"nofollow\">https://www.generalmagic.io/</a></p>\n<img src=\"https://remotive.com/job/track/1918053/blank.gif?source=public_api\" alt=\"\"/>","tags":"[\"crypto\",\"blockchain\",\"infrastructure\"]","pubDate":"2024-06-13 17:21:02.000","link":"https://remotive.com/remote-jobs/all-others/general-magic-praise-technical-community-manager-1918053","savedDate":"2024-06-16 09:41:40.352","slug":"general-magic-praise-technical-community-manager-giveth-6995"},{"id":7151927210,"title":"Senior Frontend Engineer, Javascript (Remote)","company":"DuckDuckGo","image":"https://spreadprivacy.com/content/images/2023/05/duckduckgo-logo_wide.png","description":"<p>Hi, we’re DuckDuckGo, the Internet privacy company for everyone who wants to take back their privacy now. For over a decade, we've been building our all-in-one product, developing new privacy technology, and working with policymakers to make online privacy simple and accessible for all.</p>\n<p><br /></p>\n<p>Our browsers and extensions have been downloaded over 250 million times with our built-in private search engine, which has seen over 100 billion searches and is the 2nd largest search engine on mobile in the United States and 20 other countries, including the United Kingdom, Canada, Australia, Poland, Italy, and Spain. Our private search engine is also 3rd in market share in the U.S. and over 15 major markets. Oh, and we've been profitable since 2014, with annual revenue exceeding $100 million!</p>\n<p><br /></p>\n<p>The DuckDuckGo browser’s uniquely comprehensive privacy protections are used by tens of millions of people to protect their everyday online activities on <a href=\"https://spreadprivacy.com/introducing-duckduckgo-for-mac/\" rel=\"noopener\">Mac</a>, <a href=\"https://spreadprivacy.com/windows-browser-open-beta/\" rel=\"noopener\">Windows</a>, <a href=\"https://spreadprivacy.com/duckduckgo-privacy-browser-ios14/\" rel=\"noopener\">iOS</a>, and <a href=\"https://spreadprivacy.com/introducing-app-tracking-protection/\" rel=\"noopener\">Android</a>, from searching to browsing, emailing, and more. We also offer <a href=\"https://spreadprivacy.com/meetprivacypro/\" rel=\"noopener\">Privacy Pro</a>, a three-in-one subscription service that includes a VPN, Personal Information Removal, and Identity Theft Restoration.</p>\n<p><br /></p>\n<p>We’re looking for a <strong>Senior Frontend Engineer</strong> to help shape our all-in-one privacy solution and join our mission to show the world that protecting your privacy online can be simple.  </p>\n<p><br /></p>\n<p><strong>The Opportunity</strong> </p>\n<p>In this role, you will lead and contribute to developing new and existing products and features, demonstrating ownership over major components of our codebase while taking responsibility for their maintenance and improvement over time. By writing pragmatic, performant, and testable code that works consistently across settings, devices, and browsers, you'll play a key role in improving the frontend software architecture, all while prioritizing privacy and user experience throughout the engineering process.</p>\n<p><br /></p>\n<p>As a senior engineer, you will mentor peers and work closely with cross-functional team members through remote collaboration opportunities, including product brainstorms, technical design discussions, code reviews, and more.</p>\n<p><br /></p>\n<p><strong>What You Will Bring to DuckDuckGo</strong> </p>\n<ul><li>7+ years experience in positions where your primary responsibility was writing code.</li><li>Advanced level of JavaScript/HTML/CSS expertise.</li><li>Advanced level of React and Typescript.</li><li>Advanced level of web application architecture expertise.</li><li>Ability to lead engineering projects with little to no oversight.</li><li>Experience building large-scale web applications.</li><li>Experience identifying success criteria and metrics and validating decisions against them.</li><li>Experience collaborating with engineers on the backend and other platforms, such as Android and iOS.</li><li>Experience collaborating with product and design to build polished consumer-facing products.</li><li>Ability to contribute to technical architecture decisions for complex products.</li><li>Willingness to learn new technologies and ideas.</li></ul>\n<p><br /></p>\n<p><strong>How We Will Support You </strong> </p>\n<p>Our core values -- build trust, question assumptions, and validate direction -- underpin how we work day-to-day and the support we give our team members. We strive to empower our team members to be self-directed and self-motivated in their work.  </p>\n<p><br /></p>\n<ul><li><strong>Remote First, Always</strong>: We've always been a fully distributed company with team members all over the world. We trust you to get your work done wherever, and whenever.   </li><li><strong>Commitment to Personal Growth:</strong> Every team member has an annual budget of $1,250 USD to invest in their professional development. Every team member also has a dedicated Career Advisor, who serves as a guide to help you develop your strengths, identify your motivations, and understand your opportunities for growth. </li><li><strong>Leadership:</strong> We have many different types of leaders and possible combinations of leadership roles, so you can grow your career in a way that aligns best with your personal goals. You can seek additional leadership roles by being directly responsible for projects, taking ownership of areas of the company, developing and maintaining internal processes, or pursuing advisory roles. </li><li><strong>Work/Life Balance: </strong>Team members have the freedom and flexibility to organize their own work schedules. We want you to thrive both in and out of the office. We trust you to use good judgment and take the time off that you need to bring your best self to work.  </li></ul>\n<p><br /></p>\n<p>We also offer paid parental leave, a co-working stipend, office setup reimbursement, and a wellness stipend. More support resources can be found in our <u><a href=\"https://duckduckgo.com/assets/hiring/team_support_guide.pdf\" rel=\"noopener\">Team Member Support Guide</a></u>, which explains how we make your well-being a priority. </p>\n<p><br /></p>\n<p>For more information on how we collaborate worldwide, from leadership in our relatively flat organization to start-to-finish ownership<strong>,</strong> check out <u><a href=\"https://duckduckgo.com/how-we-work\" rel=\"noopener\">DuckDuckGo Culture: How We Work.</a></u> </p>\n<p><br /></p>\n<p><strong>Compensation</strong> </p>\n<p>Annual compensation: $176,000 USD and stock options. Compensation is the same within a professional level, regardless of geographic location or functional area, and the compensation for each professional level is transparent across the organization.</p>\n<p><br /></p>\n<p><strong>Hiring Process</strong> </p>\n<p>Hiring works best when it's a two-way street. Learn how we help you get to know DuckDuckGo and envision your future role here. Find out more about <u><a href=\"https://duckduckgo.com/how-we-hire\" rel=\"noopener\">how we hire</a></u>. </p>\n<p><br /></p>\n<p><strong>Diversity, Equity, and Inclusion</strong> </p>\n<p>DuckDuckGo provides equal work opportunities to all team members and applicants<u>,</u> and it prohibits discrimination and harassment of any type on the basis of race, color, ethnicity, caste, religion, age, sex (including pregnancy), national origin, disability status, genetics, protected veteran status, sexual orientation, gender identity or expression, or any other characteristic protected by our policies or federal, state, or local laws.</p>\n<p><br /></p>\n<p>We want to ensure that our hiring process is accessible. If you need reasonable accommodation for any part of the application process because of a medical condition or disability, please send an email to <u><a href=\"mailto:careers@duckduckgo.com\" rel=\"noopener\">careers@duckduckgo.com</a></u> to let us know the nature of your request.  </p>\n<p><br /></p>\n<p>If you think you might thrive in this environment, we would love to hear from you. </p>\n<p><br /></p>\n<p><strong>Please note that:</strong> </p>\n<ol><li>Sometimes we meet up! Expect to travel at least two times a year: once for our all-hands meetup and again for a team retreat (each around 4-5 days). While extenuating circumstances may impact attendance, everyone is strongly encouraged to attend.</li><li>While we offer a flexible work arrangement with no core hours, expect an average full-time commitment of 40 hours per week. </li><li>A successful candidate will be subject to a background check and must receive satisfactory results of the same, as a condition of joining the team. </li><li>By applying for this role, you confirm that all information submitted is accurate and complete. You further acknowledge that providing false or fraudulent information during the application process is cause for denial of an offer, revocation of any existing offer, or other adverse action, up to and including termination after the start of your commencement of work.  </li></ol>\n<p><br /></p>\n<p>#LI-DNI</p>","tags":"[\"javascript\",\"typescript\",\"engineering\",\"aws\"]","pubDate":"2024-05-28 18:13:20.000","link":"https://duckduckgo.recruitee.com/o/senior-frontend-engineer-javascript-remote-2-5","savedDate":"2024-06-16 09:41:40.352","slug":"senior-frontend-engineer-javascript-remote-duckduckgo-2346"}]