[{"id":7558899654,"title":"Enterprise Technical Advisor, (Post-Sales Customer Success) [IC2 - IC3]","company":"Sourcegraph","image":"https://avatars.githubusercontent.com/u/3979584?s=200&v=4","description":"&lt;div class=&quot;content-intro&quot;&gt;&lt;h2&gt;&lt;span style=&quot;color: rgb(243, 78, 63);&quot;&gt;&lt;strong&gt;Who we are&lt;/strong&gt;&lt;/span&gt;&lt;/h2&gt;\n&lt;p&gt;Our mission at Sourcegraph is to make it so that &lt;a href=&quot;https://www.notion.so/sourcegraph/Mission-values-e9d37e6b972a4ef395c3076aea2bd07d?pvs=4&quot;&gt;everyone can code&lt;/a&gt;, not just ~0.1% of the population.&amp;nbsp;&lt;/p&gt;\n&lt;p&gt;We are transforming how the world’s most important companies build software by industrializing development with AI. Today, most professional developers spend a disproportionate amount of time understanding code and performing repetitive, low-level tasks—leaving less time for innovation and meaningful impact.&lt;/p&gt;\n&lt;p&gt;We’re changing that. Sourcegraph brings AI-powered search and agents to the enterprise, helping teams automate the mundane and amplify what developers do best— solving hard problems and creating great products.&lt;/p&gt;\n&lt;p&gt;Here’s how we’re making a difference:&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;&lt;strong&gt;Accelerating developers &lt;/strong&gt;with AI agents that deliver insights and precision—enabling 5x faster test creation, 30% increase in merge requests, and saving 20 minutes per developer daily.&lt;/li&gt;\n&lt;li&gt;&lt;strong&gt;Automating repetitive tasks,&lt;/strong&gt; from remediating vulnerabilities (saving teams 1,000+ hours annually) to speeding up migrations that would take years to months.&amp;nbsp;&lt;/li&gt;\n&lt;li&gt;&lt;strong&gt;Enabling innovation&lt;/strong&gt; by addressing complex problems like automated bug triage, vulnerability detection, and AI-driven code reviews seamlessly integrated into workflows.&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;Trusted by 7/10 top software companies by market cap, 4/6 top US banks and many of the companies leading global innovation, like Stripe, Indeed, Tesla, and 1Password, and with $225M in funding from investors like &lt;a href=&quot;https://techcrunch.com/2021/07/13/sourcegraph-raises-125m-series-d-on-2-6b-valuation-for-universal-code-search-tool/&quot;&gt;a16z&lt;/a&gt;, &lt;a href=&quot;https://about.sourcegraph.com/blog/series-c-with-sequoia/&quot;&gt;Sequoia&lt;/a&gt;, and &lt;a href=&quot;https://www.redpoint.com/companies/sourcegraph/&quot;&gt;Redpoint&lt;/a&gt;, we are building the tools that will define the next era of enterprise software development.&lt;/p&gt;\n&lt;p&gt;If you’re passionate about solving the hardest problems in software and shaping the future of technology, join us. Let’s build something extraordinary together.&lt;/p&gt;&lt;/div&gt;&lt;h2&gt;&lt;span style=&quot;color: rgb(161, 18, 255);&quot;&gt;&lt;strong&gt;Location&lt;/strong&gt;&lt;/span&gt;&lt;/h2&gt;\n&lt;p&gt;🌎 While we are an all-remote company and hire &lt;a href=&quot;https://sourcegraph.notion.site/How-we-engage-talent-outside-of-the-US-218f7193695a46cbb1ef39ef9c1f72d4&quot;&gt;almost anywhere&lt;/a&gt; in the world, we have a requirement for this person to reside in San Francisco, CA or Denver, CO.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Preferred locations:&lt;/strong&gt;&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;Denver, CO&lt;/li&gt;\n&lt;li&gt;San Francisco, CA&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;We do not subscribe to “I do my best work when I work 40 hours a week.” &amp;nbsp;People we hire at Sourcegraph believe that building outstanding things means working very hard — smarter and more hours than the competition.&lt;/p&gt;\n&lt;h2&gt;&lt;span style=&quot;color: rgb(161, 18, 255);&quot;&gt;&lt;strong&gt;Why this job is exciting&lt;/strong&gt;&lt;/span&gt;&lt;/h2&gt;\n&lt;p&gt;You will have responsibility and growth potential in helping us shape and build our young team. As an Enterprise CSM (note: we refer to this role as an Enterprise Technical Advisor), you will manage the relationships with roughly 15 Enterprise customers. You’ll ensure your customer&#39;s developers love our product, remain happy customers and grow month over month. You&#39;ll also help our customers solve technical problems while driving key metrics like adoption, usage/consumption, NPS, NDR (Net Dollar Retention) and renewal rate.&lt;/p&gt;\n&lt;p&gt;📅 Within one month, you will…&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;Start building a trusting relationship with your team and partners on Customer Engineering (pre-sales, Sales, and Support teams)&lt;/li&gt;\n&lt;li&gt;Learn about our product, our value proposition, our customers &amp;amp; use cases, our team, and our processes.&lt;/li&gt;\n&lt;li&gt;Join or review customer and prospect calls with some of our largest (Fortune 500) customers to understand their technical challenges and needs.&lt;/li&gt;\n&lt;li&gt;Be assigned your first customers with whom you’ll begin to establish trusted relationships to earn and maintain credibility.&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;📅 Within three months, you will…&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;Meet regularly with your customer champions and advocates; establish yourself as their key point of contact.&lt;/li&gt;\n&lt;li&gt;Ensure your customers derive maximum value from their investment in Sourcegraph; develop account success plans based on insights and needs where necessary.&lt;/li&gt;\n&lt;li&gt;Develop and implement tailored programs and playbooks, contributing to internal team strategy, that provide continued value to our customers and ensure long-term growth beyond just your assigned customers.&lt;/li&gt;\n&lt;li&gt;Provide recommendations based on the customer&#39;s infrastructure and use cases, and provide feedback to internal teams as the voice of your customer.&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;📅 Within six months, you will…&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;Drive the ultimate success of your customers, including their onboarding experience, ongoing feature adoption, renewal, and expansion.&lt;/li&gt;\n&lt;li&gt;Engage customers in product betas, case studies, and webinars as applicable.&lt;/li&gt;\n&lt;li&gt;Drive seamless onboarding processes and work cross-functionally with our support and services team to proactively lead successful deployments.&lt;/li&gt;\n&lt;li&gt;Translate customer sentiment to internal teams and appropriately advocate for strategic product decisions. Be the voice of the customer.&lt;/li&gt;\n&lt;li&gt;Guide your customers as they use Sourcegraph to solve technical problems.&lt;/li&gt;\n&lt;li&gt;Proactively identify new opportunities for expansion and up-sell opportunities across your book of business by collaborating with the sales team to ensure subscription growth and increased solution footprint.&lt;/li&gt;\n&lt;/ul&gt;\n&lt;h2&gt;&lt;span style=&quot;color: rgb(161, 18, 255);&quot;&gt;&lt;strong&gt;About you&lt;/strong&gt;&lt;/span&gt;&lt;/h2&gt;\n&lt;p&gt;You are an enthusiastic, self-driven, and results-oriented post-sales specialist who shares &lt;a href=&quot;https://handbook.sourcegraph.com/company-info-and-process/values/&quot;&gt;our values&lt;/a&gt; and is passionate about nurturing healthy customers.&lt;/p&gt;\n&lt;p&gt;Your skill set:&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;You are curious about the technical topics our customers deal with daily (migrations, code refactors, developer onboarding, etc.) and have the ability to partner with them on technical solutions both using and extending the Sourcegraph product. You use your technical skills to help guide customers and solve problems.&lt;/li&gt;\n&lt;li&gt;You are an influential and strategic thinker who co-develops success strategies with customers and your account team counterparts (AE, etc.) to ensure we bring value to our customers and continue to solve their ongoing needs. You commonly report on the status via Business Reviews with documented KPIs and success metrics associated with use cases.&lt;/li&gt;\n&lt;li&gt;You actively listen, synthesize information, communicate effectively, and present with confidence and customer empathy to various stakeholders (end-user devs to C-level stakeholders) and internal teams.&lt;/li&gt;\n&lt;li&gt;You are proactive. You can collaborate with multiple stakeholders to identify opportunities, address complex political situations, and support customers throughout.&lt;/li&gt;\n&lt;li&gt;You are naturally curious and seek to learn about product features and their benefits. You provide recommendations based on stated customer needs and use cases. You engage customers on relevant betas, updates, and educational material, as applicable.&lt;/li&gt;\n&lt;li&gt;You are exceptionally organized and have strong project management skills. You are a strong adopter of tools and standardized processes to document customer conversation goals and project customer health scores across your entire book of business. You can prioritize effectively and can set and deliver on expectations.&lt;/li&gt;\n&lt;li&gt;You are a team player who can proactively contribute to a positive environment that values people and work, openly share problems and successes, and work across teams to help refine processes and achieve goals. You can take responsibility for your actions and recognize mistakes as learning opportunities.&lt;/li&gt;\n&lt;/ul&gt;\n&lt;h2&gt;&lt;span style=&quot;color: rgb(161, 18, 255);&quot;&gt;&lt;strong&gt;Level&lt;/strong&gt;&lt;/span&gt;&lt;/h2&gt;\n&lt;p&gt;📊 This job is an IC2 - IC3.&amp;nbsp; You can read more about &lt;a href=&quot;https://sourcegraph.notion.site/Leveling-Guide-0e1b5c76ada64b9caac387f8b7c4fc66&quot;&gt;our job leveling philosophy&lt;/a&gt; in our Handbook.&lt;/p&gt;\n&lt;h2&gt;&lt;span style=&quot;color: rgb(161, 18, 255);&quot;&gt;&lt;strong&gt;Compensation&lt;/strong&gt;&lt;/span&gt;&lt;/h2&gt;\n&lt;p&gt;&lt;strong&gt;💸 We pay you an above-average salary&lt;/strong&gt; because we want to hire the best people who are fully focused on helping Sourcegraph succeed, not worried about paying bills. As an &lt;a href=&quot;https://sourcegraph.notion.site/Mission-values-e9d37e6b972a4ef395c3076aea2bd07d&quot;&gt;open and transparent&lt;/a&gt; company that values &lt;a href=&quot;https://www.notion.so/sourcegraph/Compensation-Pay-Transparency-at-Sourcegraph-d58d0774f51b4b489d41c3628d30ff8d?pvs=4&quot;&gt;competitive compensation&lt;/a&gt;, our compensation ranges are visible to every single Sourcegraph teammate.&lt;/p&gt;\n&lt;p&gt;To determine your salary, we use a number of market and data-driven salary sources, along with your location zone, and target the high-end of the range to ensure we’re always paying above market regardless of where you live in the world. Both U.S. and international locations are divided into one of four zones, determined by the cost of labor index for each area. The starting salary for a successful candidate will be based on level, job-related skills, experience, qualifications, and location zone. Please note that these salary ranges may be adjusted in the future.&lt;/p&gt;\n&lt;p&gt;💰The target compensation for IC Level 2 is $120,800.00 base + $30,200.00 commission for a total OTE of $151,000.00&lt;/p&gt;\n&lt;p&gt;💰The target compensation for IC Level 3 is $154,720.00 base + $38,680.00 commission for a total OTE of $193,400.00&lt;/p&gt;\n&lt;p&gt;Please speak with a recruiter for additional information regarding zone locations.&lt;/p&gt;\n&lt;p&gt;📈 In addition to our cash compensation, we offer equity (because when we succeed as a company, we want you to succeed, too) and generous &lt;a href=&quot;https://sourcegraph.notion.site/Benefits-Perks-dd1da4b6b3a64780abed010a144d34ba&quot;&gt;perks &amp;amp; benefits&lt;/a&gt;.&lt;/p&gt;\n&lt;h2&gt;&lt;span style=&quot;color: rgb(161, 18, 255);&quot;&gt;&lt;strong&gt;Interview process&lt;/strong&gt;&lt;/span&gt;&lt;/h2&gt;\n&lt;p&gt;&lt;em&gt;Below is the interview process you can expect for this role (you can read more about &lt;/em&gt;&lt;a href=&quot;https://sourcegraph.notion.site/Types-of-interviews-f279f080583d49ee9f2c60e30c8cb1f7&quot;&gt;&lt;em&gt;the types of interviews&lt;/em&gt;&lt;/a&gt;&lt;em&gt; in our Handbook). It may look like a lot of steps, but rest assured that we move quickly and the steps are designed to help you get the information needed to determine if we’re the right fit for you… Interviewing is a two-way street, after all!&amp;nbsp;&lt;/em&gt;&lt;/p&gt;\n&lt;p&gt;We expect the interview process to take 5 hours in total.&amp;nbsp;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;👋 Introduction Stage&lt;/strong&gt; - we have initial conversations to get to know you better…&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;[30m]&amp;nbsp;&lt;a href=&quot;https://www.notion.so/sourcegraph/Types-of-interviews-sample-questions-f279f080583d49ee9f2c60e30c8cb1f7?pvs=4#99be5ff628b2414194a0ba79d9f25f13&quot;&gt;Recruiter Screen&lt;/a&gt;&lt;/li&gt;\n&lt;li&gt;[45m] &lt;a href=&quot;https://www.notion.so/sourcegraph/Types-of-interviews-sample-questions-f279f080583d49ee9f2c60e30c8cb1f7?pvs=4#1919882c0cf147c487eb1df40db8a694&quot;&gt;Hiring Manager Screen&lt;/a&gt; / &lt;a href=&quot;https://www.notion.so/sourcegraph/Types-of-interviews-sample-questions-f279f080583d49ee9f2c60e30c8cb1f7?pvs=4#c678a2a86e0e47e4958507e869bf7ded&quot;&gt;Resume Deep Dive&lt;/a&gt;&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;&lt;strong&gt;🧑‍💻 Team Interview Stage&lt;/strong&gt; - we then delve into your experience in more depth and introduce you to members of the team, including cross-functional partners…&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;[60m] &lt;a href=&quot;https://www.notion.so/sourcegraph/Types-of-interviews-sample-questions-f279f080583d49ee9f2c60e30c8cb1f7?pvs=4#cb00697e95304550a146c32563c0255d&quot;&gt;Cross-functional team collaboration&lt;/a&gt; / &lt;a href=&quot;https://www.notion.so/sourcegraph/Types-of-interviews-sample-questions-f279f080583d49ee9f2c60e30c8cb1f7?pvs=4#88b9f826dee04ef98afc2aeec35b877a&quot;&gt;Peer &lt;/a&gt;&lt;/li&gt;\n&lt;li&gt;[60m] Working Session - Hiring Manager, 1 TA, 1 AE&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;&lt;strong&gt;🎉 Final Interview Stage &lt;/strong&gt;- we move you to our final round, where you gain a better understanding of our business and values holistically…&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;[30m]&amp;nbsp;&lt;a href=&quot;https://www.notion.so/sourcegraph/Types-of-interviews-sample-questions-f279f080583d49ee9f2c60e30c8cb1f7?pvs=4#e3a04291743048df87541a88aa8199dd&quot;&gt;Values&lt;/a&gt;&lt;/li&gt;\n&lt;li&gt;[30m]&amp;nbsp;&lt;a href=&quot;https://www.notion.so/sourcegraph/How-to-work-with-Quinn-Slack-CEO-807673e0864d473f959cc4efd9642a5a?pvs=4#6f185c0e2011411eac5be9c675f9056c&quot;&gt;Leadership&lt;/a&gt; with co-founder&amp;nbsp;&lt;/li&gt;\n&lt;li&gt;We check references and conduct your background check&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;Please note - you are welcome to request additional conversations with anyone you would like to meet, but didn’t get to meet during the interview process.&lt;/p&gt;&lt;div class=&quot;content-conclusion&quot;&gt;&lt;h2&gt;&lt;span style=&quot;color: rgb(243, 78, 63);&quot;&gt;&lt;strong&gt;Learn more about us&lt;/strong&gt;&lt;/span&gt;&lt;/h2&gt;\n&lt;p&gt;You can learn more about what it is like to work at Sourcegraph by reading &lt;a href=&quot;https://sourcegraph.notion.site/d7614e3e9dc04c09ac2d42d57f1816e6?v=2a6d426dbae14390b155120b0c029ce0&quot;&gt;our handbook&lt;/a&gt;.&lt;/p&gt;\n&lt;p&gt;We are an ambitious team who are collectively working hard to build the most influential company in the world.&amp;nbsp; You can read more about our &lt;a href=&quot;https://sourcegraph.notion.site/What-it-s-like-working-at-Sourcegraph-119a8e11265880b18911eee4d9b7c460#119a8e1126588062b935fc66104b6115&quot;&gt;culture&lt;/a&gt;, &lt;a href=&quot;https://sourcegraph.notion.site/Compensation-Pay-Transparency-at-Sourcegraph-d58d0774f51b4b489d41c3628d30ff8d?pvs=74&quot;&gt;competitive compensation&lt;/a&gt; and &lt;a href=&quot;https://sourcegraph.notion.site/Benefits-Perks-dd1da4b6b3a64780abed010a144d34ba?pvs=74&quot;&gt;benefits&lt;/a&gt; here.&lt;/p&gt;\n&lt;p&gt;Sourcegraph is an equal opportunity workplace; we welcome people from all backgrounds.&amp;nbsp;&lt;/p&gt;\n&lt;p&gt;&lt;em&gt;Sourcegraph participates in &lt;/em&gt;&lt;a href=&quot;https://sourcegraph.notion.site/E-Verify-2ab3286dde3446d6bac2898c83610107&quot;&gt;&lt;em&gt;E-Verify&lt;/em&gt;&lt;/a&gt;&lt;em&gt; for U.S. Employees. &lt;/em&gt;&lt;/p&gt;&lt;/div&gt;","tags":"[\"management\",\"engineering\"]","pubDate":"2025-02-23T17:07:48.000Z","link":"https://job-boards.greenhouse.io/sourcegraph91/jobs/5450594004","slug":"enterprise-technical-advisor-post-sales-customer-success-ic2-ic3-sourcegraph-2647"},{"id":2134060402,"title":"Client Implementations Data Solutions Architect","company":"Subscript","image":"https://remotive.com/job/1974820/logo","description":"<div class=\"h3\">Data Solutions works with new customers to set up their data in Subscript and verify everything is correct</div>\n<div class=\"h3\">The basics</div>\n<ul style=\"\">\n<li style=\"\">The <strong>product ✨</strong>: We're building the premier metrics-first finance and billing platform that empowers B2B SaaS leaders to invoice their customers, tell their ARR story, and track accounting revenue, all in one place—regardless of how complex their customers' contracts are</li>\n<li style=\"\">The <strong>role you'll play</strong> on our team:</li>\n<ul style=\"\">\n<li style=\"\">You'll be the first point of contact for new customers after they've signed on to Subscript 🙌🏽, and will work with them through complex, data-intensive implementations 🤔. You'll hook our new customers up to their source data, help them clean and validate their data in Subscript, and help do the types of analysis that give them the most value 👍🏽.</li>\n<li style=\"\">Over the course of each implementation, you'll work to get ARR metrics, invoices, and accounting revenue clean and complete, referencing clients' CRMs (e.g. Hubspot, Salesforce), general ledgers (e.g. Quickbooks, Xero), billing tools (e.g. Stripe, Maxio, Chargebee), and spreadsheets. To get there, we rely heavily on spreadsheets, external APIs, SQL, and occasionally Python.</li>\n<li style=\"\">You'll be the sixth member of the Data Solutions team<strong>,</strong> and will help define what the role becomes as we grow! You'll work closely with the whole company, including our co-founders <a class=\"external\" href=\"https://www.linkedin.com/in/sidharthkakkar/\" rel=\"nofollow\">Sidharth Kakkar</a> and <a class=\"external\" href=\"https://www.linkedin.com/in/michellehaeyunlee\" rel=\"nofollow\">Michelle Lee</a>. They formerly built and successfully exited a B2B SaaS company called <a class=\"external\" href=\"https://freckle.com/en-us/\" rel=\"nofollow\">Freckle Education</a>, and this is their second start-up.</li>\n<li style=\"\">We're a young company with a lean team (current under 30 people, but growing quickly!), so you'll have a huge say in how we shape and build all parts of our organization 👯‍♂️. You'll have a ton of autonomy in defining + iterating on best practices and processes to really help both our customers AND our teammates reach the moon!</li>\n<li style=\"\">You'll not only work directly with the new clients you take on, but also support other team members as they encounter new challenges and could learn from your experience and insight.</li>\n</ul>\n<li style=\"\">The <strong>way we work</strong>:</li>\n<ul style=\"\">\n<li style=\"\">We are an <strong>asynchronous 🕛</strong> team</li>\n<ul style=\"\">\n<li style=\"\">we don't do scheduled internal meetings, so the vast majority of communication is available to anybody at any time in written documentation, whole-company Slack channels, and video documentation. If you're sick of pointless meetings, this is the place for you!</li>\n</ul>\n<li style=\"\">We operate completely <strong>autonomously</strong> 💃🏿</li>\n<ul style=\"\">\n<li style=\"\">no one will tell you what to do; everyone gets transparent context and details about the company goals and you will figure out how to work towards them with the rest of the team!</li>\n</ul>\n<li style=\"\">This is a <strong>remote job 🌎</strong> - work anywhere you want</li>\n<ul style=\"\">\n<li style=\"\">Although we are fully remote and asynchronous internally, our clients are all over the world; you'll be taking live calls most days of the week with customers in California, Australia, or US-East, so a substantial overlap in your working hours is a must! You can expect to be working <strong>US-Pacific hours</strong></li>\n</ul>\n<li style=\"\">We're a team that <strong>loves working together</strong></li>\n<ul style=\"\">\n<li style=\"\">we love playing board games 🎲 (these we do synchronously 🙂). Full-time team members meet up multiple times per year for live off-sites around the world (expenses paid!)</li>\n</ul>\n</ul>\n</ul>\n<p> </p>\n<div class=\"h3\">Our interview process</div>\n<p>We like to be really transparent and communicative about everything at Subscript, including our interview process:</p>\n<p>Our interview process is designed to focus on your intuition with analytics, and your ability to <strong>communicate clearly (both written and in video calls)</strong>. We default to asynchronous communication internally, so the majority of the interview process follows suite 🙂.</p>\n<p>The interview will focus around your ability to understand, support, and engage our awesome customers 🤝</p>\n<ol style=\"\">\n<li style=\"\">First, we'll ask you to work on spreadsheet task similar to the type of data work you'll be doing with our customers! As part of this simulation, you'll get a chance to ask clarification questions about the data 🔢.</li>\n<li style=\"\">We'll then have a short live call to talk through your background, career goals, and working style, which will also offer you the chance to talk through questions you may have about the role, the product, the team, or whatever else is on your mind.</li>\n<li style=\"\">The second asynchronous task will be a SQL exercise (postgres) to show your ability in working with databases. We'll provide the data and details on the required output, and you'll provide the query to get there.</li>\n<li style=\"\">Next, you'll have a chance to show off your customer communication, as you prepare for and lead a live kick-off call with a brand new Subscript customer (who we will be taking on the role of for the purposes of the interview 🥸).</li>\n<li style=\"\">Finally, you'll have a chance to meet and talk with one of our cofounders. This isn't graded or used in evaluation, but is an opportunity for you to go to know us better and answer any lingering questions you might have. It's important for us that our company and working style is a good fit for <em>you </em>and that you have everything you need to make the right decision.</li>\n</ol>\n<p><strong>Requirements</strong></p>\n<ul style=\"\">\n<li style=\"\">Our ideal candidate loves data 🥰 (analyzing it, talking about it, advising our customers using it). You'll be acting as a key strategic advisor to our customers using that data!</li>\n<ul style=\"\">\n<li style=\"\">We're looking for...</li>\n<ul style=\"\">\n<li style=\"\">serious spreadsheet skills</li>\n<li style=\"\">experience requesting and reading JSON data from APIs</li>\n<li style=\"\">satisfaction in getting to <em>perfectly</em> clean data</li>\n<li style=\"\">SQL mastery</li>\n<li style=\"\">familiarity with B2B SaaS business models</li>\n<li style=\"\">ability to work US-Pacific time</li>\n<li style=\"\">5+ years relevant experience</li>\n</ul>\n</ul>\n<ul style=\"\">\n<li style=\"\">We're also happy to see (but don't require)…</li>\n<ul style=\"\">\n<li style=\"\">comfort in Python</li>\n<li style=\"\">experience with general ledgers used in SaaS finance (e.g. Quickbooks, Xero, and and Netsuite)</li>\n<li style=\"\">exposure to CRM software (Hubspot and Salesforce)</li>\n</ul>\n</ul>\n<li style=\"\">You're kind, empathetic, and communicative 😄. Both externally, as you'll be collaborating closely with customers, as well as internally, as you'll be supporting with the broader team in written docs 📄 + recorded videos.</li>\n</ul>\n<p><strong>Benefits</strong></p>\n<p>Like all start-ups we're scrappy, but <em><strong>not</strong></em> scrappy on compensation: Subscript is committed to paying our awesome team members at <strong>market-rate.</strong> We're funded by <a class=\"external\" href=\"https://firstround.com/\" rel=\"nofollow\">First Round Capital</a> and backed by several Angels at high-growth b2b saas companies.</p>\n<p><br><br></p>\n<div class=\"h2\">About the company</div>\n<p> </p>\n<p>Subscript helps finance teams at subscription companies better understand and manage revenue data and analytics. We're well funded by top Silicon Valley Venture Capitalists, and are a completely global team based all around the world.</p>\n<ul style=\"\">\n<li style=\"\">The <strong>way we work</strong>:\n<ul style=\"\">\n<li style=\"\">We are a <strong>remote company</strong> - work anywhere you want! Any timezone on earth (or outside earth, whatever)</li>\n<li style=\"\">We are an <strong>asynchronous</strong> team - we don't do scheduled meetings, and rely on each team member to pick their own schedule and to communicate clearly in writing and with recorded videos</li>\n<li style=\"\">We operate completely <strong>autonomously</strong> - no one will tell you what to do, we'll just tell you the goals and you will figure out how to work towards them with the rest of the team</li>\n</ul>\n</li>\n<li style=\"\">Like all start-ups we're scrappy, but not scrappy on compensation: Subscript is committed to paying our awesome team members at <strong>market-rate, including benefits</strong>.</li>\n</ul>\n<img src=\"https://remotive.com/job/track/1974820/blank.gif?source=public_api\" alt=\"\"/>","tags":"[\"accounting\",\"api\",\"go\",\"postgresql\",\"python\",\"saas\",\"salesforce\",\"sql\",\"video\",\"documentation\",\"CRM\",\"analytics\",\"spreadsheets\",\"JSON\",\"quickbooks\",\"hubspot\",\"NetSuite\",\"REST\"]","pubDate":"2025-02-23T05:51:15.000Z","link":"https://remotive.com/remote-jobs/data/client-implementations-data-solutions-architect-1974820","slug":"client-implementations-data-solutions-architect-subscript-522"}]