[{"id":9265357966,"title":"Junior Software Engineer - Colombia/Remote","company":"MixRank","image":"https://pbs.twimg.com/profile_images/378800000147745937/0fac42c12b433bbbd53ff3e15cd6fca4_400x400.png","description":"<p>At MixRank, we create B2B SaaS products that enable sales, marketing, finance, and business intelligence teams to accelerate their business with data and insights into their customers. One that provides the most comprehensive database of mobile apps and websites, technographics, companies, and decision makers. It's a platform created with the sole purpose of providing the fastest way for sales reps to build prospect lists, prioritize leads, and contact decision-makers.</p>\n<p>We're looking for remote engineers that have finished school within the last 2 years or will finish in the next 6 months. This is an open-ended entry-level role with mentorship, and diverse opportunities to work on all areas of our product: databases, distributed systems, infrastructure and tooling, data analysis, machine learning, frontend and backend web development, APIs, data mining, data modeling, and more.</p>\n<p>Our code base is very friendly to new contributors. You'll have a fully-functional development environment within hours (fully automated) and be pushing commits on your first day. Deployments to production happen multiple times per day and finish in less than 2 minutes. Effectively all of our codebase is written in Python, SQL, and Javascript/TypeScript. The core technologies you'll need familiarity with to be productive are Python, PostgreSQL, Linux, and Git.</p>\n<p>Why Join MixRank? Fully-remote, no HQ office. Team of 40 people across 15+ countries. Invested in by Y Combinator, 500 Startups, Mark Cuban. Profitable and growing 50% every year.</p>\n<p>Please include your updated resume when applying for this role.</p>\n<p><strong>Important:</strong>&nbsp;Only accept job offers from emails ending in @<a href=\"http://mixrank.com/\" target=\"_blank\">mixrank.com</a>. Offers from any other email addresses are fraudulent. Do not share personal information with unverified senders.</p>\n","tags":"[\"postgres\",\"javascript\",\"typescript\",\"Finance\",\"B2B\",\"database\"]","pubDate":"2024-08-20 08:25:27.231","link":"https://www.ycombinator.com/companies/mixrank/jobs/LQUXLxU-junior-software-engineer-colombia-remote","savedDate":"2024-08-20 08:25:27.231","slug":"junior-software-engineer-colombia-remote-mixrank-5226"},{"id":1116487723,"title":"Junior Software Engineer - Argentina/Remote","company":"MixRank","image":"https://pbs.twimg.com/profile_images/378800000147745937/0fac42c12b433bbbd53ff3e15cd6fca4_400x400.png","description":"<p>At MixRank, we create B2B SaaS products that enable sales, marketing, finance, and business intelligence teams to accelerate their business with data and insights into their customers. One that provides the most comprehensive database of mobile apps and websites, technographics, companies, and decision makers. It's a platform created with the sole purpose of providing the fastest way for sales reps to build prospect lists, prioritize leads, and contact decision-makers.</p>\n<p>We're looking for remote engineers that have finished school within the last 2 years or will finish in the next 6 months. This is an open-ended entry-level role with mentorship, and diverse opportunities to work on all areas of our product: databases, distributed systems, infrastructure and tooling, data analysis, machine learning, frontend and backend web development, APIs, data mining, data modeling, and more.</p>\n<p>Our code base is very friendly to new contributors. You'll have a fully-functional development environment within hours (fully automated) and be pushing commits on your first day. Deployments to production happen multiple times per day and finish in less than 2 minutes. Effectively all of our codebase is written in Python, SQL, and Javascript/TypeScript. The core technologies you'll need familiarity with to be productive are Python, PostgreSQL, Linux, and Git.</p>\n<p>Why Join MixRank? Fully-remote, no HQ office. Team of 40 people across 15+ countries. Invested in by Y Combinator, 500 Startups, Mark Cuban. Profitable and growing 50% every year.</p>\n<p>Please include your updated resume when applying for this role.</p>\n<p><strong>Important:</strong>&nbsp;Only accept job offers from emails ending in @<a href=\"http://mixrank.com/\" target=\"_blank\">mixrank.com</a>. Offers from any other email addresses are fraudulent. Do not share personal information with unverified senders.</p>\n","tags":"[\"postgres\",\"javascript\",\"typescript\",\"Finance\",\"B2B\",\"database\"]","pubDate":"2024-08-20 08:25:27.231","link":"https://www.ycombinator.com/companies/mixrank/jobs/zkkqsPc-junior-software-engineer-argentina-remote","savedDate":"2024-08-20 08:25:27.231","slug":"junior-software-engineer-argentina-remote-mixrank-2448"},{"id":2626156889,"title":"Junior Software Engineer - Brazil/Remote","company":"MixRank","image":"https://pbs.twimg.com/profile_images/378800000147745937/0fac42c12b433bbbd53ff3e15cd6fca4_400x400.png","description":"<p>At MixRank, we create B2B SaaS products that enable sales, marketing, finance, and business intelligence teams to accelerate their business with data and insights into their customers. One that provides the most comprehensive database of mobile apps and websites, technographics, companies, and decision makers. It's a platform created with the sole purpose of providing the fastest way for sales reps to build prospect lists, prioritize leads, and contact decision-makers.</p>\n<p>We're looking for remote engineers that have finished school within the last 2 years or will finish in the next 6 months. This is an open-ended entry-level role with mentorship, and diverse opportunities to work on all areas of our product: databases, distributed systems, infrastructure and tooling, data analysis, machine learning, frontend and backend web development, APIs, data mining, data modeling, and more.</p>\n<p>Our code base is very friendly to new contributors. You'll have a fully-functional development environment within hours (fully automated) and be pushing commits on your first day. Deployments to production happen multiple times per day and finish in less than 2 minutes. Effectively all of our codebase is written in Python, SQL, and Javascript/TypeScript. The core technologies you'll need familiarity with to be productive are Python, PostgreSQL, Linux, and Git.</p>\n<p>Why Join MixRank? Fully-remote, no HQ office. Team of 40 people across 15+ countries. Invested in by Y Combinator, 500 Startups, Mark Cuban. Profitable and growing 50% every year.</p>\n<p>Please include your updated resume when applying for this role.</p>\n<p><strong>Important:</strong>&nbsp;Only accept job offers from emails ending in @<a href=\"http://mixrank.com/\" target=\"_blank\">mixrank.com</a>. Offers from any other email addresses are fraudulent. Do not share personal information with unverified senders.</p>\n","tags":"[\"postgres\",\"javascript\",\"typescript\",\"Finance\",\"B2B\",\"database\"]","pubDate":"2024-08-20 08:25:27.231","link":"https://www.ycombinator.com/companies/mixrank/jobs/TxcsMYn-junior-software-engineer-brazil-remote","savedDate":"2024-08-20 08:25:27.231","slug":"junior-software-engineer-brazil-remote-mixrank-210"},{"id":4425759507,"title":"Job Title: Customer Success Manager (Remote, EST Availability)","company":"MixRank","image":"https://pbs.twimg.com/profile_images/378800000147745937/0fac42c12b433bbbd53ff3e15cd6fca4_400x400.png","description":"<h1>Who we are</h1>\n<p>MixRank is a YC-backed, profitable Data-as-a-Service (DaaS) company founded in 2011. We're building something sustainable and meaningful for the long haul. Our team of over 40 talented individuals spans the globe, working remotely to handle over 3 petabytes of data each month.</p>\n<p>We're proud of our decade-long journey, during which we've learned, grown, and become profitable. Our commitment is to continue running and improving our business indefinitely. This isn't just a job for us; it's our life's work. We’re not going to get acquired. Instead, we value steady growth, continuous learning, and making a lasting impact.</p>\n<p>Our customer base includes some of the world's largest sales platforms, recruitment solutions, venture capital firms, and private equity companies, as well as cutting-edge startups fresh out of YC.</p>\n<hr>\n<h1>Who we’re looking for</h1>\n<p>We're looking for an experienced Customer Success Manager — someone who has a track record of working with enterprise customers, and can handle seamless communications via Slack, email and calls with customers to handle tickets, escalations and new product/feature requests.</p>\n<p>This isn't just about support—it's about being a trusted advisor, technical liaison, and problem-solver all rolled into one. Your ability to navigate complex client relationships while understanding the technical intricacies of our products will be crucial to success.</p>\n<ol>\n<li>4+ years in Customer Success, Account Management, or Support roles, preferably in B2B data, DaaS, sales-tech, or enterprise recruitment spaces. You should be comfortable managing accounts in the $100-250k ACV range and interfacing confidently with C-suite and VP-level customer champions.</li>\n<li><strong>Truly exceptional</strong> communication skills: We're looking for more than just excellent speaking or writing skills. We need someone with deep empathy who can navigate complex client relationships, handle frustrated customers with grace, and make principled decisions that balance customer satisfaction with optimal outcomes.</li>\n<li>Ability to work within a multi-tool environment. We maintain direct Slack channels with all our enterprise customers, so you'll be juggling requests flowing in throughout the day via Slack and (on a smaller scale) email.</li>\n<li>Your ability to understand and explain the technical intricacies of our products is crucial. Experience working with APIs and basic SQL knowledge is a significant plus.</li>\n<li>Principled discipline: We're looking for someone with a meticulous approach to end-to-end ticket management. From creation to resolution, you'll need to identify problems, assign resources, provide constant updates, and drive issues to closure with unwavering attention to detail.</li>\n<li>As part of a globally distributed team, you must be self-motivated and able to manage your workload effectively. You should be comfortable collaborating across time zones while maintaining high productivity.</li>\n</ol>\n<h1>What you’ll be doing</h1>\n<ol>\n<li>Customer onboarding: You'll be the bridge from sales to success, working closely with our engineering team to launch data products or subscriptions for new customers. Your proactive approach will shine as you create and continuously update documents, FAQs, and resources to help customers quickly get up-to-speed.</li>\n<li>Customer support: As our customers' go-to problem solver, you'll handle a variety of requests:\n<ol>\n<li>How-tos: You'll guide customers through the complexities of working with massive datasets, especially in their crucial first 6 months. We want to make sure we're providing all the right resources and answering all questions, to make sure customers are getting the most out of their MixRank subscription.</li>\n<li>Bug Tickets: When working with over 1B rows of data, bugs are inevitable. You'll be the calm in the storm, acknowledging issues promptly, collaborating with our data engineering team, and orchestrating smooth solutions that keep our customers happy.</li>\n<li>Customer escalations: When customers are frustrated (even if it's beyond MixRank's control), you'll be our diplomat. You'll turn these challenging moments into opportunities for learning and improvement, always striving to exceed our high standards.</li>\n</ol>\n</li>\n<li>Documentation: You'll distill complex information into easily digestible content, ensuring our resources evolve with new customer questions and feature releases. Think of yourself as the architect of our collective wisdom, building a foundation that supports both our internal team and our clients.</li>\n<li>Proactive communication: You'll set the bar for customer engagement, keeping clients informed and feeling valued throughout their MixRank journey. This isn't just about responding to issues – it's about anticipating needs, sharing updates, and fostering a sense of partnership. Your proactive approach will turn clients into advocates, strengthening relationships and driving long-term success.</li>\n<li>You'll be the vital link between our clients and internal teams. But this is more than just relaying information – you'll be a strategic partner in shaping our product roadmap. By effectively communicating client needs, prioritizing issues, and contributing insights, you'll help drive solutions that not only meet but anticipate client expectations.</li>\n</ol>\n<hr>\n<h1>What’s in it for you</h1>\n<ol>\n<li>100% remote work: We trust you to manage your time effectively. Our focus is on your impact and results, not the hours you clock. Work from anywhere, anytime – we believe great work can happen outside the constraints of a traditional office.</li>\n<li>Home-office setup: We provide a Remote Office Grant to ensure you have a comfortable, productive home office. No compromises here – we want you to have the best tools for the job.</li>\n<li>Comprehensive health coverage: We offer 100% health coverage and term life insurance.</li>\n<li>Personal development: Enjoy an unlimited book budget to feed your mind. We also cover your Netflix and Spotify subscriptions under our Entertainment allowance.</li>\n<li>Flexible leave policy: Take the time off when you need to recharge — we recommend at least 15 days a year. Our only ask? Don't let your team down.</li>\n</ol>\n<hr>\n<h1>How to apply</h1>\n<p>Ready to join the MixRank team? Send an email to jobs+cs at <a href=\"http://mixrank.com\" target=\"_blank\">mixrank.com</a> with the subject line: \"[Your Name]: MixRank CS.\" For example, \"Jane Doe: MixRank CS.\"</p>\n<p>Please include the following in your application:</p>\n<ol>\n<li><strong>Profile:</strong> Please include your latest resume, as well as your LinkedIn profile.</li>\n<li><strong>Your biggest account: Tell us about the largest enterprise customer you've worked with (no names needed). And also describe the nature of the product/service, your role in managing the account, challenges you faced and how you overcame them, strategies you employed to ensure customer success.</strong></li>\n<li><strong>Specifics about your work:</strong> How many accounts have you managed simultaneously in previous roles? And what daily tools and processes did you use to maintain balance and discipline across multiple accounts?</li>\n<li><strong>Why we’d be a fit:</strong> Tell us 3 reasons why you think MixRank would be a great fit for you. And also list 3 reasons why you believe you would be a great fit for MixRank.</li>\n<li><strong>Explain MixRank API to a customer:</strong> Please review our API Documentation for our Audience Segments API (<a href=\"https://mixrank.com/api/documentation#/segment-features/%7Bsegment%7D\" target=\"_blank\">https://mixrank.com/api/documentation#/segment-features/{segment}</a>). In 4-5 sentences, explain how this API works as if you were describing it to a new customer. Focus on its key features and potential benefits.</li>\n<li><strong>Handle a customer cancellation</strong>: If you receive the following message from a customer, how would you react?</li>\n</ol>\n<p></p>\n<ul>\n<li>We’ve been working with Mixrank for a while now, trying to address the use cases we identified and tested before signing up. Unfortunately, after a thorough evaluation, the results haven’t been what we expected or were promised. Given this, even though we’ve signed an annual contract and we’re only in Month 4, we’d like to cancel our contract with Mixrank.</li>\n</ul>\n<hr>\n<h1>Two things to remember</h1>\n<ol>\n<li><strong>Direct applications only.</strong> We strongly prefer receiving applications directly via email. Unfortunately, applications through LinkedIn or other automated hiring platforms may not be processed due to high volumes.</li>\n<li><strong>Originality in applications.</strong> At MixRank, we value originality and a personal touch in applications. While we understand the growing trend of AI assistance, we discourage the use of AI tools like ChatGPT for crafting your application responses. We’re looking for genuine, human-written anecdotes and workflows — AI-generated responses tend to be lackluster and are easy to identify. If you do choose to use AI assistance, please be transparent about it. However, know that priority will be given to applications demonstrating personal effort and original thinking.</li>\n</ol>\n","tags":"[\"management\",\"engineering\",\"B2B\"]","pubDate":"2024-08-20 08:25:27.231","link":"https://www.ycombinator.com/companies/mixrank/jobs/Hax6XdN-job-title-customer-success-manager-remote-est-availability","savedDate":"2024-08-20 08:25:27.231","slug":"job-title-customer-success-manager-remote-est-availability-mixrank-772"},{"id":4176826986,"title":"Associate Opener/Sales Development Representative","company":"SafetyWing","image":"https://pbs.twimg.com/profile_images/1177267684574208000/54eG3WmW_400x400.jpg","description":"<h2>🧘 What we offer</h2> <ul><li><!--block-->Fully remote work environment – work from anywhere globally.&nbsp;</li><li><!--block-->Competitive compensation: base and commission.</li><li><!--block-->Global coverage with Remote Health and Nomad Insurance.</li><li><!--block-->A minimum of 20 days of compensated time off each year.</li><li><!--block-->Referral bonus - an incentive program rewarding you for helping us find exceptional talent to join our team.</li><li><!--block-->Opportunity to unlock more benefits as your tenure with SafetyWing grows.</li></ul><div><!--block--><br>We are looking forward to hearing from you!</div> <div><!--block-->We’re seeking a friendly and energetic Associate Opener to join our Direct Sales Team and help us connect with amazing customers! Your talent in pinpointing potential leads will steer <strong>SafetyWing</strong> toward achieving our goals.</div><div><!--block--><br>We are building a global social safety net, including health and retirement for remote workers worldwide, as a replacement for national welfare systems. If we succeed, we believe this will help ensure freedom and equal opportunity for everyone, and it is one of the more important tasks of our time that no one else is working on.</div> <h2>💻 Your responsibilities will include</h2>  <ul><li><!--block-->Create awareness and generate interest for Remote Health by SafetyWing among companies.</li><li><!--block-->Discover impactful leads.</li><li><!--block-->Conduct outreach through calling, emailing, and social media to engage potential clients.</li><li><!--block-->Set up qualified meetings between target buyers and our account executives (Closers).</li><li><!--block-->Assist in whipping up and executing lead-generation campaigns.</li><li><!--block-->Meticulously enter and manage sales data, ensuring accuracy and reliability in our CRM.</li></ul><div><!--block--><br></div> <h2>🧪 We are looking for someone who:</h2> <ul><li><!--block-->Has an exceptional knack for research – we value this highly!</li><li><!--block-->Has successful experience in proactive customer outreach.</li><li><!--block-->Has excellent communication skills in English, both verbal and written.</li><li><!--block-->Is tech-savvy and comfortable with Google Workspace, CRM software, and marketing automation tools.</li><li><!--block-->Is a continual learner, detailed, planning pro, and autonomous worker.</li><li><!--block-->Extra shine if you have experience in lead generation and a diploma or degree in marketing, business, or a related field.</li></ul><div><!--block--><strong>😀 We like to work with people who:</strong></div><ul><li><!--block-->Want to help build a global social safety net on the Internet.</li><li><!--block-->Think for themselves instead of copying others.</li><li><!--block-->Are willing to try new things, even with the risk of failure.</li><li><!--block-->Are intellectually curious and open to new ideas.</li><li><!--block-->Are creative and bold in the face of any problems.</li><li><!--block-->Have strong integrity and do the right thing.</li></ul>","tags":"[]","pubDate":"2024-08-20 08:25:27.230","link":"https://safetywing.pinpointhq.com/en/jobs/225573","savedDate":"2024-08-20 08:25:27.230","slug":"associate-opener-sales-development-representative-safetywing-3975"},{"id":6275496826,"title":"Product Analyst","company":"Vivid Money","image":"https://remotive.com/job/1929878/logo","description":"<p>Vivid is a dynamic fintech company that provides innovative solutions to enhance our users' financial experience. We are on a mission to identify and solve user problems, continuously improve our products, and introduce new features to make financial management more straightforward and more rewarding. As a<strong> Data Analyst </strong>at Vivid in the <strong>AFC Team</strong>, you will play a pivotal role in shaping the future of our products and services.</p>\n<p> </p>\n<p><strong>In this role, you will:<br><br></strong></p>\n<ul style=\"\">\n<li style=\"\">Building analytics for AFC.</li>\n<li style=\"\">Take an active role in improving Antifraud products: identify problems that users face and propose ways to solve them, and come up with new and enhanced existing rules and alerts.</li>\n<li style=\"\">Build and maintain a system of automated reports.</li>\n<li style=\"\">Support new features launch: create metrics that reflect the feature’s quality, and evaluate results.</li>\n<li style=\"\">Provide analytical support while decision-making.</li>\n<li style=\"\">Formulate hypotheses for A/B testing, design, analyse results.</li>\n<li style=\"\">Engage in effective communication with partners.</li>\n<li style=\"\">Track assigned projects progress.</li>\n<li style=\"\">Collaborate with adjacent teams to develop comprehensive cross-team solutions for products.</li>\n</ul>\n<p><strong>Requirements</strong></p>\n<ul style=\"\">\n<li style=\"\">At least 3 years of work experience in a similar position</li>\n<li style=\"\">Probability theory and mathematical statistics knowledge</li>\n<li style=\"\">Advanced SQL knowledge, familiar with Python (ex NumPy, Pandas)</li>\n<li style=\"\">Advanced knowledge of data visualisation tools (we use Tableau)</li>\n<li style=\"\">Ability to see a business meaning behind the data and communicate it in the clearest possible way (even if it’s complicated topic)</li>\n<li style=\"\">Upper intermediate level of English</li>\n</ul>\n<p><strong>Benefits</strong></p>\n<ul style=\"\">\n<li style=\"\">This job is only for those who are outside of Russia (remote work) or willing to relocate to Limassol (Cyprus), or Almaty (Kazakhstan).</li>\n<li style=\"\">We support relocation (visa, package) when needed.</li>\n<li style=\"\">This is a senior-level position with a competitive salary and benefits package (depending on location).</li>\n</ul>\n<p>If you're looking for an exciting new opportunity to advance your engineering skills and make an impact in the world of finance, Vivid is the perfect place for you. Join our talented team of professionals and help us revolutionize the way people think about their money!</p>\n<p><br><br></p>\n<div class=\"h2\">About the company</div>\n<p> </p>\n<p>Vivid offers a unique mobile banking app and a distinctive digital investing platform from a single app. Whether it’s payments, transfers, multi-currency accounts for your travels, spendings reports, split bills as well as the possibility to invest in international stocks, ETFs, precious metals and crypto. With Vivid, managing your finances is easy, flexible and 100% transparent.</p>\n<p> </p>\n<p>We founded Vivid wanting to bring a colourful and entirely different experience to modern banking. Banking needs to put the customer first and in control. With our knowledge and experience, we strive to help our customers earn more and increase their wealth. Online banking needs to be very easy, and on the other hand, very safe.</p>\n<p> </p>\n<p>On the 8th of June 2020, Vivid was launched in Germany as its first market, followed by France, Spain and Italy, with more European countries to come!</p>\n<img src=\"https://remotive.com/job/track/1929878/blank.gif?source=public_api\" alt=\"\"/>","tags":"[\"python\",\"sql\",\"data visualization\",\"A/B Testing\"]","pubDate":"2024-08-17 17:20:57.000","link":"https://remotive.com/remote-jobs/data/product-analyst-1929878","savedDate":"2024-08-20 08:25:27.230","slug":"product-analyst-vivid-money-9966"},{"id":7809846429,"title":"Account Executive, Mid-Market","company":"Circle","image":"https://dka575ofm4ao0.cloudfront.net/pages-transactional_logos/retina/155354/circle-icon-dark.png","description":"<div><b style=\"font-size: 18px\">About Us</b></div><div>Circle is building the world’s leading all-in-one platform for online communities. We make it possible for creators, coaches, educators, and businesses to bring together their audience with engaging discussions, live streams, events, chat, courses, and payments — all in one place, all under their own brand.</div><div><br></div><div>We’re proud to be a fully remote company of around 170 (and growing!) team members from 30+ countries around the world. We seek exceptional individuals around the world, set them up to do the best work of their lives, and in turn, create a meaningful impact in their own lives. We don't track hours, but we do manage for high expectations very closely. We collaborate across time zones, are highly async, and like to document a lot.</div><div><br></div><div>Twice a year, we bring the whole company together in beautiful places around the world for our company offsites. So far, we’ve hosted offsites in Turkey, Portugal, Mexico, Thailand, Colombia, and Italy, with more to come!</div><div><br></div><div><b><span style=\"font-size: 18px;\">About the role</span></b></div><div>In 2023, we launched <a rel=\"noopener noreferrer\" class=\"postings-link\" href=\"https://circle.so/plus\">Circle Plus</a> -branded apps- and have since acquired 170+ customers with this new offering. More recently, we expanded Circle Plus with the addition of headless SDK, which opens up an entirely new target market for us to penetrate. We're looking for a seasoned sales executive to join our team, and help bring new and existing Circle customers onto this industry-shaping product.</div><div><br></div><div>Your days will be a mixture of well-polished demos of Circle's platform, and the Circle Plus offering, ROI-based presentations to the executive teams, and reaching out to existing customers to help upgrade them into Circle Plus.</div><div><br></div><div>NOTE: Our next company offsite will be occurring the week of August 25th. Responses to applications may be delayed.</div><div>This role includes variable income, expected: $60,000-$70,000 USD/year (Base: $80,000/year + expected variable = <b>OTE: $140,000 - $150,000 USD/year)</b>.</div><h3>What you'll be doing</h3><li>Engaging prospective customers that have started a trial of Circle to help them become wildly successful with our platform. They will come from all over the world with very different types of businesses.</li><li>Executing a structured sales process. You’re good at doing discovery, demo’s, pricing/negotiation and building a mutual evaluation plan. You know how to navigate the deal to engage decision-makers, build business cases, and build evaluation plans.</li><li>Constantly learning about our product and how our customers are leveraging it. It’s changing daily as we release new features, and you’ll need to keep up.</li><li>Managing your pipeline with phone calls and emails to help the customer decide whether Circle is the right fit for them. You will be keeping your data in the CRM up to date, in real-time, all the time.</li><li>Sharing feedback with Revenue Enablement, Product and Marketing on process improvements or customer feedback.</li><li>Leading the team alongside the Sales Manager/Head of Sales. You'll help shape the vision for the team's future.</li>,<h3>What you'll need to be successful</h3><li>Strong alignment with our values.&nbsp;<a rel=\"noopener noreferrer\" class=\"postings-link\" href=\"https://www.notion.so/223a15ea312c4922b793593d07add7fe?pvs=21\">Find our values on our career page</a>&nbsp;if you haven’t read up on them yet.</li><li>You are proficient in English (spoken, written, and reading) at a&nbsp;<a rel=\"noopener noreferrer\" class=\"postings-link\" href=\"https://magoosh.com/english-speaking/english-proficiency-levels-a-guide-to-determining-your-level/\">CEFR Level C1</a>&nbsp;/&nbsp;<a rel=\"noopener noreferrer\" class=\"postings-link\" href=\"https://www.govtilr.org/\">ILR Level 5</a>.</li><li><b>You’ve done consultative sales before.</b> You have 3-5 years of experience in a closing role, selling $10k-$30k ACV offerings.</li><li><b>You're a top performer.</b> In previous roles, you find your way making your way to the top of the dashboard, and never give up until you get there.</li><li><b>You’re relatable.</b> You find it easy to connect with others because you seek common ground. You enjoy meeting new people.</li><li><b>You’re entrepreneurial or a creator yourself.</b> You’ve built and run your own business and know the challenges that come with it.</li><li><b>You’re technical and scrappy.</b> You enjoy hacking things together, have experience with automation software like Zapier, and like coming up with workarounds.</li><li><b>You’re analytical.</b> You like the data, and don’t shy away from it. Bonus points if you’re strong with Excel/Google Sheets.</li><li><b>Organization matters to you.</b> You'll be talking with many customers, and potential customers, while keeping your data up to date. You'll also need to be excellent at managing your time.</li><li><b>You're empathetic</b> and always put the customer first, even if it means they don't use Circle. We don't use aggressive sales tactics or sell Circle to people who don't need it. We tell customers that Circle isn't the right fit for them all the time. Acquiring customers is important. But they need to be right for the product.</li><li><b>You love creators</b> and brands that are building communities.</li><li><b>You have excellent writing skills.</b> A large part of this role will be about communicating, with customers, prospective customers, and internally on our team.</li><li><b>You’re very curious and resourceful.</b> You enjoy delving into the unknown, reading, networking, and researching to uncover the path forward.</li><li><b>You like working from home.</b> You thrive with autonomy and are self-motivated. This is essential since we’re a fully remote team. We take care of each other and like having fun, but we’ll never be in an office together. We do, however, get together every 6 months for a company offsite.</li><div><span style=\"font-size: 18px\"><b>The fun stuff</b></span></div><div>Fully remote:&nbsp;work from anywhere in the world!</div><div>Autonomy and trust to do your job:&nbsp;we care about outcomes over everything else.</div><div>Paid time away:&nbsp;all employees are given 35 days of PTO annually. We also offer a paid sabbatical after 5 years.</div><div>Generous U.S. benchmarked compensation&nbsp;and startup equity no matter where you are in the world.*</div><div>Awesome medical coverage&nbsp;with 100% coverage for you and your family, or medical reimbursement options where applicable!*</div><div>Parental leave&nbsp;for parents expanding their family, or just starting one.</div><div>Home office stipend&nbsp;to help you get up and running.</div><div>Learning &amp; development stipend&nbsp;to help you level up your professional skills.</div><div>Annual bonus potential&nbsp;for roles that don't already receive variable income or commission.</div><div>Company retreats:&nbsp;Twice a year, the Circle team gets together for a fully paid company retreat in incredible places around the world! We’ve had past retreats in Colombia, Portugal, and Mexico, with more planned on the horizon.</div><div>Check out our&nbsp;<a href=\"https://careers.circle.so/\">Careers</a>&nbsp;page for more.</div><div><span style=\"font-size: 10px\">*</span><i style=\"font-size: 10px\">Your role, location and unique circumstance may affect this.</i></div><div><br></div><div><span style=\"font-size: 18px\"><b>Diversity, Equity &amp; Inclusion</b></span></div><div>As a fully-remote international company, diversity is baked into our DNA. Here’s how our CEO, Sid Yadav, frames our hiring mission: “let’s find talent in underserved and under-represented corners of the world, set them up to do the best work of their lives, and in turn, change their life.” To achieve this hiring mission, we offer competitive&nbsp;U.S. benchmarked&nbsp;compensation no matter where someone’s located in the world, and we proactively seek candidates who expand representation of backgrounds, cultures and lived experiences in our teams.</div><div><br></div><div><span style=\"font-size: 18px\"><b>Equal Employment Opportunity</b></span></div><div>Circle is an equal opportunity employer and as such, we do not discriminate on the basis of race, color, religion, sex, sexual orientation, gender identity, national origin, age, disability, or any other characteristic protected by applicable laws.</div><div>If you require any accommodations during the recruitment process, please let us know and we will work with you to meet your needs.</div>","tags":"[\"aws\"]","pubDate":"2024-08-16 17:28:53.561","link":"https://jobs.lever.co/circleco/07580972-841f-48bc-bdf3-6e7130657969","savedDate":"2024-08-20 08:25:27.232","slug":"account-executive-mid-market-circle-5049"},{"id":7423173035,"title":"Content Marketing Intern (Immediate Hire) - Fully Remote","company":"CoverGo","image":"https://pbs.twimg.com/profile_images/1382655628523364355/MWPIbbID_400x400.jpg","description":"<p><strong>Top 3 Reasons To Join Us</strong></p><ul> <li>International Environment</li> <li>100% Remote</li> <li>Exposure to Marketing in a global company</li> </ul><p><strong>About Us</strong></p><p>At CoverGo, our mission is to empower all insurance companies to make insurance 100% digital and accessible to everyone.</p><ul> <li>We are a leading global no-code insurance platform for health, life, and P&amp;C</li> <li>We’re the winner of the Insurtech of the Year in all of Asia and other awards globally</li> <li>We work with insurance enterprise clients such as AXA, Bupa, MSIG, Dai-ichi, Bank of China Group Insurance, and many more</li> <li>We're an international, diverse team of over 120 people with 30 nationalities and team members working remotely from all over the world</li> <li>We are fully funded and backed by reputable VC funds and strategic institutional investors</li> <li>We have a global presence in Asia, EMEA and the Americas</li> <li>We’ve grown our annualized revenue by over 30x since January 2021</li> <li>We’re constantly working towards making CoverGo a workplace that you love coming to. We deeply believe that bringing together a diversity of thoughts, expressions, and perspectives is key to building the best culture for equally diverse communities all over the world</li> </ul><p><strong>What You Will Do</strong></p><p>As a Content Marketing Intern, you will have the opportunity to contribute to our content strategy and help drive brand awareness. You will work closely with the marketing team to create compelling and engaging content across various channels, including blog posts, social media, email campaigns, and website content. Your responsibilities will include:</p><ul> <li>Assisting in the creation and editing of blog posts, articles, and other written materials</li> <li>Conducting research to generate new content ideas</li> <li>Optimizing content for SEO purposes</li> <li>Managing and scheduling social media posts</li> <li>Creating engaging email campaigns to nurture leads</li> <li>Assisting in the maintenance and update of website content</li> <li>Collaborating with the design team to create visually appealing content</li> </ul><p><strong>What We Need</strong></p><ul> <li>Currently pursuing a degree in Marketing, Communications, or related field</li> <li>Strong written and verbal communication skills</li> <li>Attention to detail and ability to meet deadlines</li> <li>Proficiency in Microsoft Office Suite</li> <li>Experience with content management systems is a plus</li> <li>Knowledge of social media platforms and email marketing tools</li> <li>Proactive and eager to learn</li> <li>Positive attitude and ability to work well in a team</li> </ul><p>Please be advised that this internship opportunity is unpaid.</p><p><strong>Why You'll Love Working Here</strong></p><ul> <li>Remote Setup</li> <li>International Environment</li> <li>Professional Development Opportunities</li> <li>Company activities and events</li> </ul><p><strong>CoverGo Company</strong><a href=\"https://www.youtube.com/watch?v=YI0ezLxvFvA\" rel=\"nofollow noreferrer noopener\" class=\"external\"><strong> Video</strong></a></p><p>By submitting your application, you confirm that you have read, understood, and accepted the content of CoverGo’s <a href=\"https://apply.workable.com/covergo/gdpr_policy?lng=en\" target=\"_blank\" rel=\"nofollow noreferrer noopener\" class=\"external\">Privacy Notice</a> and you consent to the processing of your data as part of this application.</p><h3>Requirements: </h3><h3>Benefits: </h3>","tags":"[\"management\"]","pubDate":"2024-08-16 00:00:00.000","link":"https://apply.workable.com/covergo/j/22E24D3D28","savedDate":"2024-08-20 08:25:27.232","slug":"content-marketing-intern-immediate-hire-fully-remote-covergo-3630"},{"id":7556023663,"title":"Senior Solutions Architect","company":"E-studio","image":"https://remotive.com/job/1924495/logo","description":"<p><strong>Salary: $110k-150k annual salary prorated for part-time<br></strong><br><br><strong>Who We Are:</strong></p>\n<p>We're a private equity-backed company passionate about building impactful businesses, particularly in the health and wellness space. We prioritize a positive, collaborative work environment and value kindness, humility, and professionalism.</p>\n<p> </p>\n<p><strong>Why Tech?</strong></p>\n<p>While we're not a tech company, technology plays a vital role in improving our efficiency and supporting our portfolio companies. We're looking for a part-time (3-4 days/week) hands-on tech whiz to join our team.</p>\n<p> </p>\n<p><strong>What You'll Do:</strong></p>\n<p> </p>\n<ul style=\"\">\n<li style=\"\">Coordinate the Design and Development of Our In-House RAG System: You'll be the architect of our in-house Retrieval-Augmented Generation (RAG) system. This will initially involve evaluating/auditing our existing system. It may involve a rebuild, assembling a small team, or outsourcing development. You'll own the overall design and approach, ensuring it directly impacts the success of our portfolio companies.</li>\n<li style=\"\">Boost Our Workplace Efficiency: You'll identify opportunities to improve efficiency through digital tools and process automation. Think setting up ETL pipelines, building BI dashboards, and streamlining workflows.</li>\n<li style=\"\">Be a Tech Communicator: You'll bridge the gap between technical and non-technical teams. Translating complex concepts into clear language and collaborating with both internal and external stakeholders is key.</li>\n</ul>\n<p> </p>\n<p><strong>You Are:</strong></p>\n<p> </p>\n<ul style=\"\">\n<li style=\"\">A Hands-On Digital Handyman: A seasoned software engineer or architect with a passion for building innovative solutions that solve real-world business problems.</li>\n<li style=\"\">A Tech Ninja: You possess a full-stack development skill set, with experience in rapid prototyping, polyglot programming (JavaScript, Python, Go, etc.), and a good understanding of machine learning and data pipelines. Familiarity with RAG systems is a plus!</li>\n<li style=\"\">A Communication Powerhouse: You can effectively communicate with everyone, from executives to engineers. You'll translate tech jargon into clear language and represent our company confidently when discussing technical matters.</li>\n<li style=\"\">A Collaborative Problem-Solver: You thrive on translating broad goals into actionable plans and can work independently or lead a small team.</li>\n<li style=\"\">A Continuous Learner: You're committed to improvement and embrace lean/agile methodologies.</li>\n<li style=\"\">A Team Player: You're humble, professional, and enjoy working in a positive, collaborative environment.</li>\n<li style=\"\">Intrinsically Motivated: You're driven by creating meaningful impact, not just by a paycheck.</li>\n</ul>\n<p> </p>\n<p><strong>Requirements:</strong></p>\n<p> </p>\n<ul style=\"\">\n<li style=\"\">Bachelor's degree in Software Engineering or a related field.</li>\n<li style=\"\">10+ years of software development experience, with 5+ years in a leadership role (e.g., solutions architect, technical product manager).</li>\n<li style=\"\">Technical proficiency in cloud platforms (AWS, Azure, GCP), software architecture, design patterns, security, and performance.</li>\n<li style=\"\">Proficiency in TypeScript, Python, and SQL</li>\n</ul>\n<p> </p>\n<p><strong>Bonus Points:</strong></p>\n<p> </p>\n<ul style=\"\">\n<li style=\"\">Experience working at/with startups</li>\n<li style=\"\">Experience with any or all of the following: Docker, Kubernetes, NestJS, React, PyTorch, Pandas, Scikit-learn, Google Apps Script</li>\n<li style=\"\">Google Workspace administration certifications.</li>\n</ul>\n<p> </p>\n<p><strong>Benefits</strong></p>\n<p> </p>\n<ul style=\"\">\n<li style=\"\">Flexible hours and fully remote</li>\n<li style=\"\">USD $110-150K annual salary prorated for part-time, dependent on the candidate’s qualifications and geographical location</li>\n</ul>\n<p> </p>\n<p><strong>Work environment</strong></p>\n<p> </p>\n<ul style=\"\">\n<li style=\"\">On the days that you are working, you are available for at least 4 hours during the regular work day (Pacific Time Zone)</li>\n<li style=\"\">Travel may not be required but participation in some in-person, on-site work activities during the year will be encouraged</li>\n</ul>\n<p> </p>\n<p><strong>Application</strong></p>\n<p> </p>\n<ul style=\"\">\n<li style=\"\">Resume / CV</li>\n<li style=\"\">Cover letter (optional)</li>\n<li style=\"\">Project portfolio with source code, e.g. GitHub, GitLab, Bitbucket, etc.</li>\n</ul>\n<p> </p>\n<p>Join us and be the tech force that helps us and our portfolio companies thrive!</p>\n<img src=\"https://remotive.com/job/track/1924495/blank.gif?source=public_api\" alt=\"\"/>","tags":"[\"AWS\",\"azure\",\"cloud\",\"docker\",\"fullstack\",\"go\",\"javascript\",\"kubernetes\",\"python\",\"react\",\"security\",\"sql\",\"AI/ML\",\"agile\",\"automation\",\"product management\",\"Typescript \",\"GCP\",\"ETL\",\"prototyping\",\"gitlab\",\"github\",\"travel\",\"Pytorch\"]","pubDate":"2024-08-15 16:46:27.000","link":"https://remotive.com/remote-jobs/software-dev/senior-solutions-architect-1924495","savedDate":"2024-08-20 08:25:27.230","slug":"senior-solutions-architect-e-studio-7986"}]