[{"id":2771038158,"title":"Lead Credit Manager - Thrive","company":"Empower","image":"https://lever-client-logos.s3.us-west-2.amazonaws.com/2e1a369c-b58f-41ac-8d86-4b0a77695e68-1687915522032.png","description":"<p style=\"min-height:1.5em\"><strong>EMPOWER OVERVIEW</strong></p><p style=\"min-height:1.5em\"><a target=\"_blank\" rel=\"noopener noreferrer nofollow\" href=\"http://empower.me/\">Empower</a> is shaking up an outdated financial system by providing real opportunity for our customers: the opportunity to get the cash they need, to access fair credit, and to change their financial story. Today, we’re helping millions of people find financial security through machine learning models that evaluate creditworthiness using a more inclusive lens and mobile-first products: Cash Advance, Thrive line of credit, and Petal credit cards. Tomorrow? Creating even more financial paths for our customers (and their wallets) to succeed.</p><p style=\"min-height:1.5em\">This year, Empower ranked #65 on Inc. 5000’s Fastest-Growing Private Companies list — our third year in a row cracking the top 100 — and was named by Forbes as one of the 25 Next Billion-Dollar Startups for 2024. Empower was also featured by Forbes on America’s Best Startup Employers list in 2023, and our Thrive line of credit product was named by Fast Company as one of 2022’s Next Big Things in Tech.</p><p style=\"min-height:1.5em\">Empower is backed by Sequoia Capital, Blisce, and Icon Ventures. Ready to grow your impact and accelerate your career? Take a look at our open roles — we can’t wait to meet you.</p><p style=\"min-height:1.5em\"></p><p style=\"min-height:1.5em\"><strong>THE EMPOWER WAY</strong></p><p style=\"min-height:1.5em\"><strong>Great Expectations</strong>: We come up with bold, audacious goals for ourselves and go all out for impact</p><p style=\"min-height:1.5em\"><strong>Owner Mindset</strong>: We give every employee latitude to act independently, make smart choices, and move the business forward</p><p style=\"min-height:1.5em\"><strong>Spirited Debate</strong>: We love skeptics and seek counter opinions to challenge our personal assumptions and expand our view</p><p style=\"min-height:1.5em\"><strong>Customer Obsession:</strong> We listen to understand, empathize, and create a memorable, rewarding experience for our community</p><p style=\"min-height:1.5em\"><strong>Inclusive Collaboration</strong>: We believe diverse teams make the best decisions, and we strive to give diverse voices a seat at the table</p><p style=\"min-height:1.5em\"><strong>No Jerks Allowed</strong>: We value our relationships and take the time to build trust and connection and communicate respectfully</p><p style=\"min-height:1.5em\"></p><p style=\"min-height:1.5em\"><strong>WHAT EMPOWER OFFERS</strong></p><p style=\"min-height:1.5em\">Competitive salary</p><p style=\"min-height:1.5em\">Generous equity package</p><p style=\"min-height:1.5em\">Full healthcare benefits</p><p style=\"min-height:1.5em\">Technology expense reimbursement</p><p style=\"min-height:1.5em\">Work from anywhere</p><p style=\"min-height:1.5em\"><strong>JOB DESCRIPTION</strong></p><p style=\"min-height:1.5em\">Empower is looking for an experienced analytics leader to join our fintech startup and own the Credit function for Thrive line of credit product. Thrive is an innovative credit product that builds off Empower’s flagship Cash Advance product through more flexible use cases and larger credit limits. At over 300k approved customers, Thrive is a major contribution to Empower’s economics and mission to bring fair credit to the underserved.</p><p style=\"min-height:1.5em\">As part of the Credit and Data Science team, you will develop and iterate on risk models and credit policies that drive underwriting as a competitive advantage for Empower and launch innovative products that solve customer problems. This role will report to Empower’s Head of Credit.</p><p style=\"min-height:1.5em\">The ideal candidate is driven by a passion for leveraging data and analytics to fuel business growth and improve customer financial well-being. This individual will lead teams and workstreams that seek to understand consumer needs and behaviors and develop solutions to allow Empower to resiliently offer the right products. The right candidate thrives on tackling complex challenges and is proficient in utilizing a wide range of technical tools to achieve impactful outcomes.</p><p style=\"min-height:1.5em\"></p><p style=\"min-height:1.5em\">Empower is a remote-first company. We drive connectivity through regular company offsites. Travel for company offsites is expected at a minimum 2 times a year.</p><p style=\"min-height:1.5em\"></p><p style=\"min-height:1.5em\"><strong>Key Responsibilities</strong></p><ul style=\"min-height:1.5em\"><li><p style=\"min-height:1.5em\">Develop new credit policies for Empower’s Thrive Line of Credit and drive analysis to uncover novel insights that move our business forward</p></li><li><p style=\"min-height:1.5em\">Collaborate closely with the Data Science team to influence and use models that solve business outcomes</p></li><li><p style=\"min-height:1.5em\">Build out frameworks, infrastructure, and controls to manage credit programs with high quality</p></li><li><p style=\"min-height:1.5em\">Work with Empower’s leadership team to build out strategy and growth plans while managing financial outcomes</p></li><li><p style=\"min-height:1.5em\">Partner with leaders in product, engineering, marketing, and finance to ensure that the team’s work fits within the larger picture</p></li><li><p style=\"min-height:1.5em\">Hire talented team to staff new projects as the business grows</p></li></ul><p style=\"min-height:1.5em\"><strong>Candidate Qualifications</strong></p><ul style=\"min-height:1.5em\"><li><p style=\"min-height:1.5em\">Bachelor’s degree in Engineering, Business, Finance, Computer Science, or Mathematics</p></li><li><p style=\"min-height:1.5em\">6+ years of industry experience in data analytics and credit risk management</p></li><li><p style=\"min-height:1.5em\">Preferred: Experience leading a team of analysts</p></li><li><p style=\"min-height:1.5em\">Eagerness to learn new tools and analytical methods, staying up to date with innovative trends and new products in the industry</p></li><li><p style=\"min-height:1.5em\">Exceptionally strong problem solving and communication with the ability to both get in the weeds and communicate to an executive audience</p></li></ul><p style=\"min-height:1.5em\">At Empower, we hire for people that push themselves to understand others and seek out ways to challenge their personal assumptions. Our hope is that by fostering such an environment, we strengthen our business and relationships by putting people first. We are committed to building a diverse, inclusive, and equitable workspace where everyone (regardless of age, education, ethnicity, gender, sexual orientation, or any personal characteristics) feels like they belong. Even if your experience doesn’t exactly match up to our job description, you should feel empowered to apply regardless!</p>","tags":"[\"finance\",\"management\",\"engineering\"]","pubDate":"2024-12-31T21:10:29.612Z","link":"https://jobs.ashbyhq.com/empower%20finance/f9431ff2-a793-444f-a573-dfc3aaeaade5","slug":"lead-credit-manager-thrive-empower-6372"},{"id":6897298598,"title":"Customer Support Team Lead","company":"Growe","image":"https://remotive.com/job/1960321/logo","description":"<div class=\"h5\">Growe welcomes those who are excited to:</div>\n<ul style=\"\">\n<li style=\"\">Oversee daily operations, and provide strategic support, ensuring agent productivity and adherence to schedules;</li>\n<li style=\"\">Inspire and motivate the support team by providing real-time support and feedback enabling departmental growth;</li>\n<li style=\"\">Conduct regular team meetings for updates and promote training and development of supervisors and agents;</li>\n<li style=\"\">Be ready to support complex issues and escalated complaints, handling ticket processes in emergencies;</li>\n<li style=\"\">Proactively review customer interactions to maintain compliance with quality standards;</li>\n<li style=\"\">Continuously review and track key performance indicators (KPIs) such as response and resolution times;</li>\n<li style=\"\">Be creative in a dynamic work environment, by leading or participating in projects to improve &amp; enhance support operations;</li>\n<li style=\"\">Manage project timelines and deliverables, reporting on project progress and outcomes to senior management.</li>\n</ul>\n<div class=\"h5\">We need your professional experience:</div>\n<ul style=\"\">\n<li style=\"\">At least 2+ years of experience in a leadership role within the customer support industry;</li>\n<li style=\"\">Proven ability to develop, inspire, and train team members;</li>\n<li style=\"\">Analytical skills for data-driven strategic planning;</li>\n<li style=\"\">Experience working with culturally diverse teams;</li>\n<li style=\"\">Experience in the iGaming industry will be a plus;</li>\n<li style=\"\">Upper-Intermediate level of English.</li>\n</ul>\n<div class=\"h5\">We appreciate if you have those personal features:</div>\n<ul style=\"\">\n<li style=\"\">Excellent verbal and written communication skills;</li>\n<li style=\"\">Strong organizational and decision-making abilities;</li>\n<li style=\"\">Ability to thrive in a fast-paced environment.</li>\n</ul>\n<div class=\"h5\">We are seeking those who align with our core values:</div>\n<ul style=\"\">\n<li style=\"\">GROWE TOGETHER: Our team is our main asset. We work together and support each other to achieve our common goals;</li>\n<li style=\"\">DRIVE RESULT OVER PROCESS: We set ambitious, clear, measurable goals in line with our strategy and driving Growe to success;</li>\n<li style=\"\">BE READY FOR CHANGE: We see challenges as opportunities to grow and evolve. We adapt today to win tomorrow.</li>\n</ul><img src=\"https://remotive.com/job/track/1960321/blank.gif?source=public_api\" alt=\"\"/>","tags":"[\"team lead\"]","pubDate":"2024-12-31T07:50:57.000Z","link":"https://remotive.com/remote-jobs/customer-support/customer-support-team-lead-1960321","slug":"customer-support-team-lead-growe-8829"},{"id":7839707189,"title":"DL Researcher","company":"Eqvilentjobs","image":"https://remotive.com/job/1960282/logo","description":"<div class='\"jobDescription\"'>\n<div class='\"jobCell__left\"'>\n<p> </p>\n</div>\n<div class='\"jobCell__right\"'>\n<p>We are currently seeking a <strong>Deep Learning Researcher</strong>. You have stumbled upon a gem in Deep Learning vacancies. A place to put to use your hard-earned experience and show some state-of-the-art work in a highly competitive environment where all your skills will be put to test.<br>Feel free to go through the details and learn more from our recruitment team.</p>\n</div>\n</div>\n<div class='\"jobCell\"'>\n<p class='\"jobCell__left\"'><strong>What You’ll Be Doing:</strong></p>\n<ul class='\"jobCell__right\"' style=\"\">\n<li style=\"\">The team you’ll join is working on developing solutions based on DL with state-of-the-art performance in terms of accuracy/speed/scalability.</li>\n<li style=\"\">We expect you to have proficient skills in ML, in particular in one of Deep Learning domains.</li>\n</ul>\n</div>\n<div class='\"jobCell\"'>\n<p class='\"jobCell__left\"'><strong>What We Look For In You:</strong></p>\n<ul class='\"jobCell__right\"' style=\"\">\n<li style=\"\">Proficient knowledge in one of Deep Learning domains (CV, NLP, TimeSeries, Audio, etc.)</li>\n<li style=\"\">Experience in development scalable and reproducible ML pipelines</li>\n<li style=\"\">Competency in conducting experiments to facilitate rapid iterations and validate hypotheses</li>\n</ul>\n</div>\n<div class='\"jobCell\"'>\n<p class='\"jobCell__left\"'><strong>Nice-to-have:</strong></p>\n<ul class='\"jobCell__right\"' style=\"\">\n<li style=\"\">Top ranks in competitions with prizes and objective metrics (Kaggle, TopCoder, DrivenData, etc.)</li>\n<li style=\"\">Experience in Time Series tasks</li>\n</ul>\n</div>\n<div class='\"jobCell\"'>\n<p class='\"jobCell__left\"'><strong>Why Should You Join Our Team?</strong></p>\n<ul class='\"jobCell__right\"' style=\"\">\n<li style=\"\">Great challenges with fast feedback loops</li>\n<li style=\"\">A welcoming group of highly qualified international professionals</li>\n<li style=\"\">Cutting-edge hardware and technology</li>\n<li style=\"\">Comfortable office in Dubai, London and other locations or remotely anywhere in the world</li>\n<li style=\"\">Flexible schedule</li>\n<li style=\"\">40 paid days off</li>\n<li style=\"\">Competitive salary</li>\n</ul>\n</div>\n<img src=\"https://remotive.com/job/track/1960282/blank.gif?source=public_api\" alt=\"\"/>","tags":"[\"computer vision\",\"deep learning\",\"NLP\"]","pubDate":"2024-12-30T15:50:57.000Z","link":"https://remotive.com/remote-jobs/software-dev/dl-researcher-1960282","slug":"dl-researcher-eqvilentjobs-6769"},{"id":9722687262,"title":"Executive Assistant","company":"ProjectGrowth","image":"https://remotive.com/job/1960389/logo","description":"<p style=\"min-height: 1.5em;\">Our client, a seed-stage venture capital fund, is seeking an experienced, proactive, and highly motivated Executive Assistant to support the Managing Partner. This is a high-impact role requiring impeccable organizational skills, flawless written and spoken English, and the ability to thrive in a fast-paced, dynamic environment. The ideal candidate has a track record of supporting high-level executives in fast-paced environments and thrives on creating structure, solving problems, and contributing to a collaborative and mission-driven team. </p>\n<p style=\"min-height: 1.5em;\">As the Executive Assistant, you will play a critical role in ensuring the Managing Partner’s focus remains on high-impact activities. You will manage calendars, coordinate travel, optimize workflows, and oversee administrative and operational processes that support the fund’s success. This role requires a self-starter who can think beyond task execution, anticipate needs, and operate with minimal oversight.</p>\n<p style=\"min-height: 1.5em;\">Suppose you’re excited about working in venture capital, supporting visionary founders, and enabling transformative technologies that improve lives. In that case, this is an exceptional opportunity to play a key role in a high-performing team while growing professionally.</p>\n<p style=\"min-height: 1.5em;\"> </p>\n<p style=\"min-height: 1.5em;\"><strong>Location: Fully-Remote (Work from Home), 9 AM - 5 PM EST </strong></p>\n<p style=\"min-height: 1.5em;\"> </p>\n<p style=\"min-height: 1.5em;\"><strong><u>Key Responsibilities</u></strong></p>\n<p style=\"min-height: 1.5em;\"> </p>\n<p style=\"min-height: 1.5em;\"><strong>Executive Support</strong></p>\n<ul style=\"\">\n<li style=\"\">\n<p style=\"min-height: 1.5em;\">Manage the Managing Partner’s complex calendar, scheduling meetings with portfolio companies, LPs, and external stakeholders.</p>\n</li>\n<li style=\"\">\n<p style=\"min-height: 1.5em;\">Coordinate detailed travel arrangements, including flights, accommodations, and itineraries.</p>\n</li>\n<li style=\"\">\n<p style=\"min-height: 1.5em;\">Track key deliverables and deadlines, ensuring the Managing Partner remains organized and focused on priorities.</p>\n</li>\n<li style=\"\">\n<p style=\"min-height: 1.5em;\">Draft, proofread, and format correspondence, presentations, and reports.</p>\n</li>\n<li style=\"\">\n<p style=\"min-height: 1.5em;\">Proactively identify opportunities to improve workflows and solve problems before they arise.</p>\n</li>\n</ul>\n<p style=\"min-height: 1.5em;\"><strong>Operational Support</strong></p>\n<ul style=\"\">\n<li style=\"\">\n<p style=\"min-height: 1.5em;\">Work with the Chief of Staff to maintain the fund’s knowledge base (e.g., Google Drive or Notion), ensuring all documents are current and accessible.</p>\n</li>\n<li style=\"\">\n<p style=\"min-height: 1.5em;\">Support portfolio company onboarding by managing checklists, templates, and documentation.</p>\n</li>\n<li style=\"\">\n<p style=\"min-height: 1.5em;\">Collaborate with the Chief of Staff to document and streamline operational processes.</p>\n</li>\n<li style=\"\">\n<p style=\"min-height: 1.5em;\">Track action items and project progress from internal and external meetings to ensure follow-through.</p>\n</li>\n</ul>\n<p style=\"min-height: 1.5em;\"><strong>Administrative Tasks</strong></p>\n<ul style=\"\">\n<li style=\"\">\n<p style=\"min-height: 1.5em;\">Manage expense reporting and reimbursements for the Managing Partner with accuracy.</p>\n</li>\n<li style=\"\">\n<p style=\"min-height: 1.5em;\">Screen and prioritize incoming communications, responding or delegating as appropriate.</p>\n</li>\n<li style=\"\">\n<p style=\"min-height: 1.5em;\">Manage and optimize task management systems to ensure nothing falls through the cracks.</p>\n</li>\n<li style=\"\">\n<p style=\"min-height: 1.5em;\">Anticipate administrative needs and proactively address issues before they arise.</p>\n</li>\n</ul>\n<p style=\"min-height: 1.5em;\"><strong>Portfolio Support</strong></p>\n<ul style=\"\">\n<li style=\"\">\n<p style=\"min-height: 1.5em;\">Assist with creating high-quality communications, including newsletters and updates</p>\n</li>\n<li style=\"\">\n<p style=\"min-height: 1.5em;\">Coordinate and execute events, ensuring flawless execution (booking restaurants, preparing materials, coordinating logistics with excellence)</p>\n</li>\n<li style=\"\">\n<p style=\"min-height: 1.5em;\">Act as a liaison between the Managing Partner and portfolio companies, facilitating smooth communication and scheduling</p>\n</li>\n<li style=\"\">\n<p style=\"min-height: 1.5em;\">Suggest improvements to enhance communication opportunistically </p>\n<p style=\"min-height: 1.5em;\"> </p>\n</li>\n</ul>\n<p style=\"min-height: 1.5em;\"><strong><u>What Success Looks Like</u></strong></p>\n<ul style=\"\">\n<li style=\"\">\n<p style=\"min-height: 1.5em;\"><strong>Operational Excellence</strong>: Seamlessly managed schedules, workflows, and administrative tasks that enhance the Managing Partner’s efficiency.</p>\n</li>\n<li style=\"\">\n<p style=\"min-height: 1.5em;\"><strong>Proactive Support</strong>: Anticipated needs and implemented solutions before challenges arose, maintaining a calm and efficient workflow.</p>\n</li>\n<li style=\"\">\n<p style=\"min-height: 1.5em;\"><strong>High-Quality Deliverables</strong>: Well-organized communications, events, and reports that meet the highest standards of professionalism and attention to detail.</p>\n</li>\n<li style=\"\">\n<p style=\"min-height: 1.5em;\"><strong>Strong Relationships</strong>: Positive feedback from internal and external stakeholders, including LPs, portfolio companies, and team members.</p>\n</li>\n</ul>\n<p style=\"min-height: 1.5em;\"> </p>\n<p style=\"min-height: 1.5em;\"><strong><u>Key Qualifications</u></strong></p>\n<p style=\"min-height: 1.5em;\"> </p>\n<p style=\"min-height: 1.5em;\"><strong>Experience</strong></p>\n<ul style=\"\">\n<li style=\"\">\n<p style=\"min-height: 1.5em;\">3+ years of experience as an Executive Assistant, ideally in venture capital, private equity, technology, or a similarly fast-paced environment.</p>\n</li>\n<li style=\"\">\n<p style=\"min-height: 1.5em;\">Proven experience managing complex executive schedules and supporting high-level leadership independently.</p>\n</li>\n</ul>\n<p style=\"min-height: 1.5em;\"> </p>\n<p style=\"min-height: 1.5em;\"><strong>Skills</strong></p>\n<ul style=\"\">\n<li style=\"\">\n<p style=\"min-height: 1.5em;\">Exceptional organizational and time management skills, with the ability to multitask effectively.</p>\n</li>\n<li style=\"\">\n<p style=\"min-height: 1.5em;\">Native or near-native proficiency in written and spoken English</p>\n</li>\n<li style=\"\">\n<p style=\"min-height: 1.5em;\">Ability to write professionally and persuasively.</p>\n</li>\n<li style=\"\">\n<p style=\"min-height: 1.5em;\">Demonstrated history of handling sensitive information with discretion and integrity.</p>\n</li>\n<li style=\"\">\n<p style=\"min-height: 1.5em;\">Able to identify gaps, propose solutions, and execute improvements autonomously.</p>\n</li>\n<li style=\"\">\n<p style=\"min-height: 1.5em;\">Exceptional time management skills and ability to prioritize in high-pressure environments.</p>\n</li>\n<li style=\"\">\n<p style=\"min-height: 1.5em;\">Proficiency in Google Workspace (Docs, Sheets, Slides), Airtable, and CRM systems (e.g., Salesforce).</p>\n</li>\n<li style=\"\">\n<p style=\"min-height: 1.5em;\">Experience with event planning and logistics coordination.</p>\n</li>\n</ul>\n<p style=\"min-height: 1.5em;\"> </p>\n<p style=\"min-height: 1.5em;\"><strong>Preferred Attributes</strong></p>\n<ul style=\"\">\n<li style=\"\">\n<p style=\"min-height: 1.5em;\">Proactive, resourceful, and capable of anticipating needs and solving problems independently and self-sufficiently.</p>\n</li>\n<li style=\"\">\n<p style=\"min-height: 1.5em;\">Self-starter who thrives in environments with minimal oversight and takes initiative without hand-holding.</p>\n</li>\n<li style=\"\">\n<p style=\"min-height: 1.5em;\">A creative thinker who understands the big picture and can contribute beyond task execution.</p>\n</li>\n<li style=\"\">\n<p style=\"min-height: 1.5em;\">Calm under pressure with a positive, “can-do” attitude.</p>\n</li>\n<li style=\"\">\n<p style=\"min-height: 1.5em;\">A collaborative team player excited to work in a small, entrepreneurial environment.</p>\n</li>\n<li style=\"\">\n<p style=\"min-height: 1.5em;\">Curious, growth-oriented, and hungry to take on increasing responsibilities over time.</p>\n</li>\n</ul>\n<p style=\"min-height: 1.5em;\"> </p>\n<p style=\"min-height: 1.5em;\"><strong>Opportunity</strong></p>\n<p style=\"min-height: 1.5em;\">This role offers a unique chance to work closely with the Managing Partner of a mission-driven venture capital firm, gaining insight into the world of startups and technology investing. If you are proactive, detail-oriented, and passionate about creating systems that enable success, we encourage you to apply. This is a high-impact position where your contributions will directly support the fund’s operations and growth, with opportunities for long-term professional development.</p>\n<p style=\"min-height: 1.5em;\"> </p>\n<div class=\"h3\"><strong><u>Application Process:</u></strong></div>\n<div class=\"h3\">To be considered for this role these steps need to be followed:</div>\n<ul style=\"\">\n<li style=\"\">\n<p style=\"min-height: 1.5em;\">Fill in the application form</p>\n</li>\n<li style=\"\">\n<p style=\"min-height: 1.5em;\">Record a video showcasing your skill sets</p>\n</li>\n</ul>\n<img src=\"https://remotive.com/job/track/1960389/blank.gif?source=public_api\" alt=\"\"/>","tags":"[\"time management\"]","pubDate":"2024-12-30T13:52:13.000Z","link":"https://remotive.com/remote-jobs/all-others/executive-assistant-1960389","slug":"executive-assistant-projectgrowth-1272"},{"id":2379839789,"title":"DevSecOps engineer","company":"Growe","image":"https://remotive.com/job/1960296/logo","description":"<div class=\"h5\"><strong>Growe welcomes those who are excited to:</strong></div>\n<ul style=\"\">\n<li style=\"\">\n<p>Create automated security controls for company products/services/processes;</p>\n</li>\n<li style=\"\">\n<p>Implement security controls into CI/CD pipelines in development and DevOps teams;</p>\n</li>\n<li style=\"\">\n<p>Manage security settings in firewall/IPS/IDS systems, help with network access processes;</p>\n</li>\n<li style=\"\">\n<p>Manage VPN groups and resources for the company;</p>\n</li>\n<li style=\"\">\n<p>Review different reports from vulnerability/ security configuration systems and implement fixes/patches;</p>\n</li>\n<li style=\"\">\n<p>Helped create operational processes for the SOC team. </p>\n</li>\n</ul>\n<div class=\"h5\"><strong>We need your professional experience:</strong></div>\n<ul style=\"\">\n<li style=\"\">\n<p>Experience in cloud security domain (AWS/GCP/Azure);</p>\n</li>\n<li style=\"\">\n<p>Experience in the area of Kubernetes vulnerability, patch, and configuration management (will be a plus);</p>\n</li>\n<li style=\"\">\n<p>Experience with Terraform/Terragrant/Flux;</p>\n</li>\n<li style=\"\">\n<p>Ability to automate daily work with bash/python;</p>\n</li>\n<li style=\"\">\n<p>Experience with cloud network firewalls;</p>\n</li>\n<li style=\"\">\n<p>Experience with IPS/IDS systems: rule management, automatisation;</p>\n</li>\n<li style=\"\">\n<p>Experience in docker vulnerability, patch, and configuration management.</p>\n</li>\n</ul>\n<div class=\"h5\"><strong>We appreciate if you have those personal features:</strong></div>\n<ul style=\"\">\n<li style=\"\">\n<p>Analytical and observational skills;</p>\n</li>\n<li class='\"li1\"' style=\"\">\n<p>Outstanding ability to think creatively, strategically, identify and resolve problems;</p>\n</li>\n<li class='\"li1\"' style=\"\">\n<p>Responsibility.</p>\n</li>\n</ul>\n<div class=\"h5\">We are seeking those who align with our core values:</div>\n<ul style=\"\">\n<li style=\"\">\n<p>GROWE TOGETHER: Our team is our main asset. We work together and support each other to achieve our common goals;</p>\n</li>\n<li style=\"\">\n<p>DRIVE RESULT OVER PROCESS: We set ambitious, clear, measurable goals in line with our strategy and driving Growe to success;</p>\n</li>\n<li style=\"\">\n<p>BE READY FOR CHANGE: We see challenges as opportunities to grow and evolve. We adapt today to win tomorrow.</p>\n</li>\n</ul><img src=\"https://remotive.com/job/track/1960296/blank.gif?source=public_api\" alt=\"\"/>","tags":"[\"docker\",\"kubernetes\",\"automation\",\"terraform\"]","pubDate":"2024-12-30T13:51:12.000Z","link":"https://remotive.com/remote-jobs/devops/devsecops-engineer-1960296","slug":"devsecops-engineer-growe-3650"},{"id":5068722289,"title":"Marketing Analyst","company":"Growe","image":"https://remotive.com/job/1960372/logo","description":"<div class=\"h5\"><strong>Growe welcomes those who are excited to:</strong><strong> </strong></div>\n<ul style=\"\">\n<li style=\"\">\n<p>Define key metrics and methodologies for Marketing and CRM analytics, align them with overall business goals, and assist in efficient decision-making;</p>\n</li>\n<li style=\"\">\n<p>Identify opportunities and issues through data analysis, bring insights, and present them in an easy, actionable way;</p>\n</li>\n<li style=\"\">\n<p>Work independently and autonomously, collaborating closely across Marketing, Finance, and Product to provide regular updates on the effectiveness of all marketing channels on the acquisition pipeline;</p>\n</li>\n<li style=\"\">\n<p>Maintain data integrity from various sources, actively challenge and improve existing data flows;</p>\n</li>\n<li style=\"\">\n<p>Contribute to the enhancement of accuracy, reliability, and overall data quality;</p>\n</li>\n<li style=\"\">\n<p>Develop user-friendly Tableau dashboards to monitor primary Marketing and CRM KPIs, both existing and new;</p>\n</li>\n<li style=\"\">\n<p>Recommend innovative ideas for optimizing marketing performance and efficiency;</p>\n</li>\n<li style=\"\">\n<p>Lead automated reporting for timely and accurate information delivery.</p>\n</li>\n</ul>\n<div class=\"h5\"><strong>We need your professional experience:</strong></div>\n<ul style=\"\">\n<li style=\"\">\n<p>At least 2 years of analytical experience, preferably in B2C marketing analytics;</p>\n</li>\n<li style=\"\">\n<p>Understanding of multi-touch attribution mechanisms;</p>\n</li>\n<li style=\"\">\n<p>Advanced proficiency in SQL;</p>\n</li>\n<li style=\"\">\n<p>Proficiency in Tableau or similar tools;</p>\n</li>\n<li style=\"\">\n<p>Solid statistical knowledge and experience in using statistics to analyze complex data;</p>\n</li>\n<li style=\"\">\n<p>At least Intermediate level of English;</p>\n</li>\n<li style=\"\">\n<p>Familiarity with GIT and Airflow is a plus;</p>\n</li>\n<li style=\"\">\n<p>Experience with Python libraries is also a plus.</p>\n</li>\n</ul>\n<div class=\"h5\"><strong>We appreciate those skills and personal features:</strong><strong> </strong></div>\n<ul style=\"\">\n<li style=\"\">\n<p>Capability to work self-sufficiently;</p>\n</li>\n<li style=\"\">\n<p>Attention to detail and strong work ethic;</p>\n</li>\n<li style=\"\">\n<p>Proactive and result-oriented mindset.</p>\n</li>\n</ul>\n<div class=\"h5\"><strong>We are seeking those who align with our core values:</strong></div>\n<ul style=\"\">\n<li style=\"\">\n<p>GROWE TOGETHER:<strong> </strong>Our team is our main asset. We work together and support each other to achieve our common goals;</p>\n</li>\n<li style=\"\">\n<p>DRIVE RESULT OVER PROCESS: We set ambitious, clear, measurable goals in line with our strategy and driving Growe to success;</p>\n</li>\n<li style=\"\">\n<p>BE READY FOR CHANGE:<strong> </strong>We see challenges as opportunities to grow and evolve. We adapt today to win tomorrow.</p>\n</li>\n</ul><img src=\"https://remotive.com/job/track/1960372/blank.gif?source=public_api\" alt=\"\"/>","tags":"[\"git\",\"python\",\"sql\",\"tableau\"]","pubDate":"2024-12-30T13:50:58.000Z","link":"https://remotive.com/remote-jobs/data/marketing-analyst-1960372","slug":"marketing-analyst-growe-1471"},{"id":5825283210,"title":"Head of Brand","company":"Growe","image":"https://remotive.com/job/1960357/logo","description":"<div class=\"h5\">Growe welcomes those who are excited to:</div>\n<ul style=\"\">\n<li style=\"\">Develop and implement strategic vision of brand marketing plans to enhance brand awareness and perception;</li>\n<li style=\"\">Oversee the planning, execution, and optimization of brand marketing campaigns across events and all digital activities;</li>\n<li style=\"\">Manage Brand Team and control their effectiveness with clear objectives &amp; key results that align with the company's goals, values and tactical/strategic vision for brand activities;</li>\n<li style=\"\">Manage brand marketing budgets effectively, allocating resources to different initiatives and channels based on their potential for driving brand growth and impact;</li>\n<li style=\"\">Create KPI of affiliate brand promotion and evaluate the effectiveness of affiliate brand activities;</li>\n<li style=\"\">Collaborate cross-functionally with the acquisition department to ensure alignment and integration of brand messaging and values across Growe Partners;</li>\n<li style=\"\">Research opportunities for new brand activation campaigns and stay up-to-date on industry trends &amp; news.</li>\n</ul>\n<div class=\"h5\">We need your professional experience:</div>\n<ul style=\"\">\n<li style=\"\">At least 5 years of experience in Brand Marketing;</li>\n<li style=\"\">Over 1 year of experience in Lead or Head positions;</li>\n<li style=\"\">Experience in building brand strategies and proven brand growth results;</li>\n<li style=\"\">Experience in entering new markets and building brand awareness;</li>\n<li style=\"\">Experience with the affiliate marketing (would be a plus);</li>\n<li style=\"\">Advanced English.</li>\n</ul>\n<div class=\"h5\">We appreciate if you have those personal features:</div>\n<ul style=\"\">\n<li style=\"\">Strategic, out of the box and creative thinking;</li>\n<li style=\"\">Profound analytical skills, attention to details;</li>\n<li style=\"\">Excellent communication (incl. intercultural) and presentation skills;</li>\n<li style=\"\">Problem-solving skills, multitasking;</li>\n<li style=\"\">Self-organized and proactive;</li>\n<li style=\"\">Team player skills.</li>\n</ul>\n<div class=\"h5\">We are seeking those who align with our core values:</div>\n<ul style=\"\">\n<li style=\"\">GROWE TOGETHER: Our team is our main asset. We work together and support each other to achieve our common goals;</li>\n<li style=\"\">DRIVE RESULT OVER PROCESS: We set ambitious, clear, measurable goals in line with our strategy and driving Growe to success;</li>\n<li style=\"\">BE READY FOR CHANGE: We see challenges as opportunities to grow and evolve. We adapt today to win tomorrow.</li>\n</ul><img src=\"https://remotive.com/job/track/1960357/blank.gif?source=public_api\" alt=\"\"/>","tags":"[\"research\"]","pubDate":"2024-12-30T11:51:11.000Z","link":"https://remotive.com/remote-jobs/marketing/head-of-brand-1960357","slug":"head-of-brand-growe-439"}]