[{"id":9997661200,"title":"Account Executive Bilingual (English & Spanish)","company":"Bobtail","image":"https://media.licdn.com/dms/image/D4E0BAQGvUyfPVBWDyg/company-logo_200_200/0/1657595552015?e=2147483647&v=beta&t=EecsDCOy3Fh_26M1noQDDIYw8-JuGKz_d1JDvcBZ-yI","description":"\n    \n\n    <h2><strong>About Bobtail</strong></h2>\n<p>Bobtail is dedicated to increasing happiness for our customers by eliminating inefficiencies in the supply chain. We envision a supply chain without friction, fraud, waste, and abuse where companies succeed based on the value they create.</p>\n<p>&nbsp;</p>\n<p>We work uniquely at Bobtail, where we value teams over individuals and encourage experimentation and iteration to constantly improve. Teams are given flexibility in working towards a shared purpose and given the freedom to decide how they will accomplish their goals.</p>\n<p>If you are an out-of-the-box thinker who takes a proactive approach to collaborating with others to solve problems and achieve your goals - we would love to talk to you.</p>\n<p>The things we value:</p>\n<ul>\n<li>Mission</li>\n<li>Teams over individuals</li>\n<li>Collaboration</li>\n<li>Communication</li>\n<li>Iteration</li>\n<li>Experimentation and failing fast</li>\n<li>Initiative and solutions-oriented approach</li>\n<li>Documentation</li>\n<li>Data</li>\n<li>Mental health and work-life balance</li>\n<li>Diversity</li>\n<li>Transparency</li>\n</ul>\n<p><strong>You should apply if you have:</strong></p>\n<ul>\n<li>3–5 years of B2B cold calling &amp; outbound sales experience</li>\n<li>Bilingual, fluency in both languages is a must (English &amp; Spanish)</li>\n<li>Software as a Service (SaaS) experience is a must</li>\n<li>US Trucking Industry knowledge is a plus</li>\n<li>CRM usage experience is preferred (Salesforce is a plus)</li>\n<li>Start-up experience is a plus</li>\n<li>Ability to quickly learn in a fast-paced environment,</li>\n<li>Consistent track record of achievement and hitting quotas</li>\n<li>Confidence, as well as strong verbal &amp; written communication skills when interacting with clients</li>\n<li>Ability to discover and understand customer needs and propose solutions</li>\n<li>Dependable team player</li>\n<li>A motivated, driven, self-starter… We love those with grit and accountability!</li>\n<li>Must own a modern - not older than 3 years old laptop with a working camera.</li>\n<li>An Internet Speed of 50 Mbps is required</li>\n</ul>\n<p>&nbsp;</p>\n<p><strong>You will be responsible for:</strong></p>\n<ul>\n<li>Making daily cold calls &amp; sending emails/text to connect with prospects</li>\n<li>Converting prospects &amp; leads into Bobtail clients</li>\n<li>Collaborating as a team to accomplish individual, team, and company-wide goals</li>\n<li>Maintaining a pipeline of leads and opportunities using our CRM (Salesforce)</li>\n<li>Effectively using other sales tools to track progress and improve your performance</li>\n<li>Learning about each client’s needs, industry, and competitors.</li>\n<li>Building long-lasting, mutually beneficial relationships with prospects and clients to create a better customer experience.</li>\n<li>Following up with prospects throughout the sales cycle to continue nurturing them.</li>\n<li>Presenting the value of Bobtail products and services to prospects</li>\n<li>Staying current on company offerings and industry trends.</li>\n</ul>\n<p><strong>Educational background:</strong></p>\n<ul>\n<li>Bachelor’s degree preferred</li>\n<li>Sales or business education/certification preferred</li>\n<li>Completed studies preferred<br><br></li>\n</ul>\n<p><strong>Benefits:</strong></p>\n<ul>\n<li>Monthly Mental Break Day</li>\n<li>Paid Time Off</li>\n<li>Work from home (or wherever)</li>\n<li>Parental leave</li>\n</ul>\n<p><br>Creating a diverse and inclusive workplace is Bobtail’s nucleus. We are an equal opportunity employer and embrace people of different backgrounds, cultures, religions, national origins, races, colors, genders, gender expressions, sexual orientations, ages, marital status, veteran status, experiences, abilities, and perspectives.</p>\n<p><br><br></p>\n\n    \n\n    \n","tags":"[\"B2B\"]","pubDate":"2024-05-09 13:10:01.597","link":"https://boards.greenhouse.io/bobtail/jobs/4169747005","savedDate":"2024-05-09 13:10:01.597","slug":"account-executive-bilingual-english-spanish-bobtail-561"},{"id":7836785772,"title":"Senior Software Engineer - Python/MongoDB","company":"Canonical","image":"https://pbs.twimg.com/profile_images/1673959375340290050/x7pNtXQ7_400x400.jpg","description":"\n      <p>We're enabling high-performing, rock-solid MongoDB deployments on any cloud or platform our customers choose. We want to create the world's best open source analog to MongoDB Altas or Amazon DocumentDB, which can be owned, controlled and operated by end-users on their own multi-cloud or on-premise environments.</p>\n<p>Canonical is looking for an experienced Python developer with a background in MongoDB who will help us to build a fully managed MongoDB solution based on Juju. We're aiming to build the most reliable and secure way to deploy and operate MongoDB on machines, VMs, public cloud and Kubernetes. The MongoDB team is small, meaning you will be a key contributor and your work will have a significant impact on the product and the broader ecosystem.</p>\n<h3>Who you are</h3>\n<ul>\n<li>You love technology and working with brilliant people.</li>\n<li>You are an accomplished senior Python programmer that enjoys challenging projects in mission-critical environments.</li>\n<li>You have experience operating and managing MongoDB clusters.</li>\n<li>You are experienced with modern infrastructure deployment automations or with traditional Linux systems administration, operations, and package management.</li>\n<li>You are passionate about quality and automatic testing.</li>\n</ul>\n<p>Work with one of the industry's pioneers in open source with intelligent engineers at every level from engineer to&nbsp; CTO and CEO level. At Canonical we've honed our remote-first culture since 2004, established in the company from the very beginning. Enjoy a competitive salary, the flexibility to work and live where you wish, and the chance to work exclusively on impactful open source projects.</p>\n<p><em>Canonical is proud to foster a workplace free from discrimination. We truly believe that diversity of experience, perspectives, and background will lead to a better environment for our employees and a better platform for our users and customers. This is something we value deeply and we encourage everyone to come be a part of the world of Ubuntu.</em></p>\n    ","tags":"[\"management\",\"mongo\"]","pubDate":"2024-05-09 13:10:01.597","link":"https://canonical.com/careers/5937947","savedDate":"2024-05-09 13:10:01.597","slug":"senior-software-engineer-python-mongodb-canonical-7196"},{"id":1289312322,"title":"Senior C++ Software Engineer (Remote/Anywhere)","company":"Collabora","image":"https://pbs.twimg.com/profile_images/1545121577632763912/7FMnABb0_400x400.jpg","description":"<div class=\"section page-centered\" data-qa=\"job-description\"><div><span style=\"font-size: 11pt\">Collabora Productivity Ltd. is a software company specialising in bringing the innovation created in Open Source projects such as LibreOffice to the market, along with services, long term support and software consultancy. We combine years of open source software leadership with an understanding of the challenges that businesses, non-profits, and governments face.</span></div><div><br></div><div><span style=\"font-size: 11pt\">Collabora Productivity brings deep technical expertise around the Office space, from our preferred Open Document format to many other, including legacy, document formats such as OpenXML and Microsoft binary formats, using modern technologies like C++ 17.</span></div><div><br></div><div><br></div></div><div class=\"section page-centered\"><div><h3>Key Responsibilities</h3><ul class=\"posting-requirements plain-list\"><ul><li>Root cause analysis and fixing of document interoperability issues</li><li>Analysing client problems, designing, and implementing solutions leveraging open source technologies and communicating the solutions in a compelling fashion</li><li>Annual conference attendance to present progress made to the Open Source community</li><li>Self starting analysis of limited project descriptions, ability to break complex tasks down into smaller deliverables, execute and report progress against these</li><li>Assistance in estimation of project costs</li><li>Implementation of features based on unclear customer input to exceed their expectations</li><li>Communication with the community, other team members, and customers using mailing \tlists, chats, phone and video conference</li><li>Capacity to travel a few times per year worldwide</li><li>Reliable and timely delivery of quality solutions to clients and internal customers</li><li>Development of strong relationships with key personnel, decision makers and customers</li></ul></ul></div></div><div class=\"section page-centered\"><div><h3>Commercial Skills</h3><ul class=\"posting-requirements plain-list\"><ul><li>Understanding client needs and reconciling time constraints, available technologies and resources and open source best practices</li><li>Ability to work in a global context with clients and engineers spanning continents</li><li>Knowledge of customers’ organization, management, product, target market, applications and decision making internal process \t</li></ul></ul></div></div><div class=\"section page-centered\"><div><h3>Technical Skills</h3><ul class=\"posting-requirements plain-list\"><ul><li>Large scale C++ development experience, on projects of &gt; 1 million lines of code</li><li>LibreOffice development experience preferred</li><li>Excellent code reading skills</li><li>Office Suite, file format and binary file format reverse engineering experience a plus</li><li>Good interpersonal skills, along with knowledge of open source \tdevelopment methodologies and good standing in the open source community</li><li>Significant demonstrable contributions to components in the open source ecosystem</li><li>BS/BA or extensive experience in the role of Software Engineer </li><li>Experience of unit testing</li><li>Cross-platform aware, deep knowledge of either Linux, MS Windows, or OSX, and some knowledge of one more platform (Cygwin knowledge helpful if MS Windows is the core skill)</li><li>Experience with Android, iOS or another mobile operating system a bonus</li><li>Casual scripting in Perl / Python / BASH or other language(s)</li><li>Version control systems – ideally knowledge of git</li></ul></ul></div></div><div class=\"section page-centered\"><div><h3>Personal Skills</h3><ul class=\"posting-requirements plain-list\"><ul><li>Highly self motivated, reliable with a demonstrable passion for Open Source and the office domain</li><li>Able to work from home office, managing own time effectively</li><li>Self learning skill to get sufficient knowledge of Collabora's services, \tbusiness model, project delivery lifecycle and other related technical domains</li><li>Good interpersonal skills</li><li>Winsome presentation skills appreciated</li><li>Good English language skills (both verbal and written) </li><li>German language skills a bonus</li><li>Ability to work and communicate in an online distributed environment</li></ul></ul></div></div><div class=\"section page-centered\" data-qa=\"closing-description\"><div>#LI-Remote</div></div><div class=\"section page-centered last-section-apply\" data-qa=\"btn-apply-bottom\"><a class=\"postings-btn template-btn-submit hex-color\" data-qa=\"show-page-apply\" href=\"https://jobs.lever.co/collabora/afb6f2ea-9c39-498c-863c-82764ea247a0/apply\">Apply for this job</a></div>","tags":"[\"management\",\"engineering\"]","pubDate":"2024-05-09 13:10:01.597","link":"https://jobs.lever.co/collabora/afb6f2ea-9c39-498c-863c-82764ea247a0","savedDate":"2024-05-09 13:10:01.597","slug":"senior-c-software-engineer-remote-anywhere-collabora-9884"},{"id":4060676285,"title":"Marketing Generalist (Ex-Founders)","company":"MixRank","image":"https://pbs.twimg.com/profile_images/378800000147745937/0fac42c12b433bbbd53ff3e15cd6fca4_400x400.png","description":"<p>At MixRank, we’ve observed that some of our most successful hires have been ex-founders. We only recently came to this conclusion ourselves, and now want to discover startup founders, who have shut down their company, or are in the chasm before the next venture.</p>\n<p>If you're brimming with a founder's mentality, we're eager to welcome you to our team.</p>\n<h2>About MixRank</h2>\n<p>MixRank (YC S11) is a data mining company that was founded in 2011. We’ve gone through YC, and raised funding from folks like 500 Startups, Mark Cuban and a few other Silicon Valley investors.</p>\n<p>We’re a fully-remote company with over 40 team-mates all across the world. Almost half the team is comprised of data engineers, and the rest are Go-to-Market and Operations.</p>\n<p>We have a decade of experience (in making mistakes). We turned profitable over 5 years ago, and have no plans of an exit or getting acquired for the next decade. Our team is exceptionally strong in both engineering and sales. We process over 3 petabytes of data each month, and are (surprisingly) one of the few data companies that own all our hardware, and run everything bare-metal.</p>\n<p>Our customers include some of the world’s biggest sales platforms, recruitment solutions, VCs and PE firms, to startups that just launched in the latest YC batch.</p>\n<p>To learn more about our work culture, please look to Glassdoor reviews or speak with our (past or present) team members. Please also check out <a href=\"https://mixrank.com/about\" target=\"_blank\">https://mixrank.com/about</a>.</p>\n<h2>What You’ll Do</h2>\n<p>While we don't expect mastery in all, proficiency in <strong>at least one</strong> of the following is crucial:</p>\n<ul>\n<li><strong>Content &amp; SEO</strong>: Initiate and lead our content journey, crafting unique, data-driven content.</li>\n<li><strong>Technical SEO</strong>: Enhance website performance and discoverability, with the willingness to learn and apply new techniques.</li>\n<li><strong>Paid Ads</strong>: Reboot our ad strategy, focusing on branded keywords and conversion optimization.</li>\n<li><strong>CRO &amp; Landing Pages</strong>: Fine-tune our landing pages for better design, mobile optimization, and lead capture.</li>\n<li><strong>Product Marketing</strong>: Deepen customer relationships, providing valuable resources from decision-making to implementation.</li>\n</ul>\n<h3>Here’s the Opportunity</h3>\n<p>Our journey in marketing is just beginning. Prior to our website redesign 2 years ago, we went 5 years without any changes to our homepage. Up until early last year, ~90% of our leads came in via outbound &amp; referrals.</p>\n<p>But over the last 2 years, we’ve done a website redesign, and invested $500/mo into ads. In January 2024, we had 21 inbound leads (with an average ACV of $40k).</p>\n<p>Imagine what we could do if we were actually good at marketing? :)</p>\n<p>Jokes aside, we’re a fiscally conservative company. All our funding money ran out years ago. Since then, we’ve been spending from revenue. And so, we’re conservative in how we’d want to move forward in any new initiative (including marketing). But we’d love for someone to come in, start working within constraints, and help us scale in impact as well as budgets and spends.</p>\n<h2>Who We’re Looking For</h2>\n<ul>\n<li><strong>Flawless English</strong>: Absolutely no compromises here. Both the founders are anal about having clarity of thought and being able to communicate that effortlessly. Our team is fully distributed as well, so 90% of internal communication happens over Slack. As a marketer, that skill needs to extend to customers as well — You need to be great at getting your point across, both in writing and speaking. Imagine crafting a punchy headline or diving deep into a 3,000-word article — that's the range we're talking about.</li>\n<li>Have gone from <strong>0 to 1</strong>, in terms of marketing strategy. We really want someone that understands where we are, and what needs to be done. We’re also at a stage where there’s no one else. So, that means having to roll up your sleeves, and working without needing agencies or even a team (at least initially).</li>\n<li><strong>Highly Self-driven and Accountable</strong>: Here's the deal – we're 100% remote. No daily check-ins or endless meetings. It's mostly you, your goals, and your screen. That means you've got to be the kind of person who can really drive themselves. If you've got a history of working remotely or have demonstrated that you’re very good at managing yourself on a day-to-day basis, you're who we're looking for.</li>\n<li><strong>Long-term Commitment</strong>: MixRank has been around for over a decade. We're small but growing steadily, and we're not planning an exit anytime soon. We're in it for the long game — think long-term projects and steady growth that make a real impact over time. If you're looking to put down roots and really grow with a company, we could be a great fit.</li>\n<li><strong>Hardworking</strong>: This goes without saying, but we like to believe we’re all hard workers, and we want someone with a very similar work ethic. Because we’re a small team, it becomes obvious when someone isn’t pulling their weight because that impacts everyone else on the team. So, we want folks that are able to commit to MixRank during work hours, and follow a strong work ethic.</li>\n<li><strong>Detail-oriented</strong>: How many times do you proof-read something before it gets launched or published? We aim for perfection, and while we know it’s not reasonable to be perfect with every single thing, trying to do so goes a long way in ensuring everything we do is high-quality.</li>\n<li><strong>Project ownership</strong>: You’re capable of taking full ownership of everything you’re working on. Oftentimes, you end up working on projects that may require inputs or even help from other departments. Because of such external dependencies, projects may end up being on hold. The ideal candidate can take on accountability for such projects, and try and complete them without passing over the buck to someone else.</li>\n<li><strong>Resourceful</strong>: Being part of a startup, especially in a team without a dedicated marketing department, means sometimes you've got to get creative. You might find yourself in new territory, where there's no set path. We need someone who sees this as a challenge, not a roadblock. Roll up your sleeves, figure it out, and make things happen.</li>\n<li><strong>Action-biased and Analytical</strong> — there’s plenty to do, but sometimes the next item may not be as obvious. We believe the ideal candidate should always have a backlog of items they need to get to, but end up prioritizing the most significant and most urgent projects, at all times.</li>\n</ul>\n<h2>Compensation &amp; Benefits</h2>\n<ul>\n<li>Our compensation model is based on seniority and location. But being transparent, our current budget will likely not allow us to hire someone in the US full-time. But if you are based in the US and still want to apply, and we both find each other to be very strong fits, we would love to have you on a part-time basis, and evolve that into a full-time opportunity down the line.</li>\n<li>Remote Flexibility: Full freedom to work from anywhere.</li>\n<li>Health Coverage: 100% health (including vision and dental) insurance for you and your immediate family.</li>\n<li>Life Insurance: Ensuring peace of mind for you and your loved ones.</li>\n<li>Unlimited leave policy: Take as much time as you need, but do right by your team-mates.</li>\n<li>Learning and Growth: Unlimited book budget and personal development fund.</li>\n<li>Fitness Grant: Stay healthy and active with our fitness grant.</li>\n<li>Entertainment Perks: Enjoy streaming services with our entertainment grant.</li>\n</ul>\n","tags":"[\"engineering\"]","pubDate":"2024-05-09 13:10:01.596","link":"https://www.ycombinator.com/companies/mixrank/jobs/B4kyHsp-marketing-generalist-ex-founders","savedDate":"2024-05-09 13:10:01.596","slug":"marketing-generalist-ex-founders-mixrank-8978"},{"id":2322912788,"title":"Director of UX & Research","company":"10up","image":"https://pbs.twimg.com/profile_images/2738508979/760be3edebfa0195e36fb3dba07297c1_400x400.png","description":"<div class=\"section page-centered\" data-qa=\"job-description\"><div><b>Location: Remote - Americas Team</b> (Open to applicants located in the U.S. and Canada).</div><div><br></div><div>As Director of UX &amp; Research, you lead and champion 10up’s UX Design, Content Design, and User Research capabilities, craft, and processes. You shape the UX and research strategy across all of our clients, continuously refine and evolve our capabilities, and are accountable for ensuring we craft intuitive experiences that drive results. You will also oversee our UX, Content &amp; Research team.</div><div><br></div><div>As a leading digital agency, 10up’s client roster spans from innovative startups and impactful non-profits, to some of the biggest names in the industry, such as ESPN, Google, The New York Times Co., and The Nobel Prize Committee.</div><div><br></div><div>As a 10upper, you have options for flexible and alternative work schedules. Intentionally remote since day one, spanning six continents and 38+ countries, 10up fully embraces the benefits of distributed work.</div></div><div class=\"section page-centered\"><div><h3>What you will do: </h3><ul class=\"posting-requirements plain-list\"><ul><li>Serve as the owner of 10up’s UX, content and research services. Establish and maintain best practices, and ensure that process, methodologies, and tooling are constantly refined to best meet the needs of our clients.</li><li>Oversee (and be accountable for) our output and quality of delivery on client engagements at every stage of the project lifecycle. Ensure that all products we create produce true end-user value.</li><li>Provide strategic oversight and guidance for UX, Content &amp; UXR practitioners on projects, and support execution as necessary.</li><li>Establish, operationalize, and own internal initiatives to better define, position, and socialize UX, Content &amp; Research as a capability at 10up (both internally and externally).</li><li>Work with leaders within the discipline to grow and evolve practices and processes related to Content Strategy and Content Design, including content modeling &amp; information architecture, content analysis &amp; disposition planning, content governance and content production processes.</li><li>Stay current on industry trends and ensure our UX and research services are modern, innovative, and ahead of the curve relative to our competitors.</li><li>Work with Delivery leads to maintain appropriate staffing levels and utilization.</li><li>Support the allocation of UX/Content and UXR resources to different engagements and initiatives.</li><li>Collaborate with Product and Design leadership to foster synergy and collaboration across the broader strategy practice.</li><li>Serve as a senior escalation point for UX, Content &amp; Research practitioners and support the resolution of project or team issues.</li><li>Build, mentor, and manage a growing team of high-performing UX, Content &amp; Research practitioners. Work with our Resourcing Manager to most effectively allocate the team’s time.</li><li>Represent 10up’s UX, Content &amp; Research practice externally at conferences, events, and speaking engagements.</li><li>Support our Sales and Marketing teams in pitching and positioning our UX, Content &amp; Research services to prospective clients (and the world!).</li></ul></ul></div></div><div class=\"section page-centered\"><div><h3>About you: </h3><ul class=\"posting-requirements plain-list\"><ul><li>You bring 10+ years of experience in UX design and research for digital products, preferably in an agency setting.</li><li>You have 3+ years of management experience, with a proven track record of leading UX &amp; Research teams.</li><li>You have deep expertise in User Experience Design and User Research methodologies and best practices.</li><li>You demonstrate a strong understanding of design principles for creating intuitive and user-friendly digital experiences, and demonstrated experience in doing so for mobile apps and websites.</li><li>Your experience gives you a strategic understanding of large scale content-heavy digital experiences and the role of content strategy in ensuring success of such projects</li><li>You have excellent communication, presentation, and interpersonal skills with the ability to influence executive-level stakeholders and manage client relationships.</li><li>You are passionate about user-centered design and have a strong desire to create exceptional user experiences.</li><li>You are proficient in a broad variety of UX research tools and design software (including Figma).</li><li>You have experience working with and leading others as part of a distributed (remote) team</li></ul></ul></div></div><div class=\"section page-centered\"><div><h3>Benefits of interest:</h3><ul class=\"posting-requirements plain-list\"><ul><li>Multiple paid time off programs, including accrued PTO, parental leave, bereavement leave, and company holidays – including an all-company break from Christmas Eve to New Years Day.</li><li>Health, dental, and life insurance programs (available for United States team members).</li><li>Retirement contribution programs (currently available in the U.S. and U.K.).</li><li>$3,000 USD accrued annually in professional development budget for you to spend on conferences, training, or to buy back time for programs like independent study.</li><li>Flexible and alternate schedule programs - including options for 4-day work week (Monday-Thursday) configurations.</li><li>Global Company summits – opportunities to meet, socialize and learn with fellow 10uppers in person at remarkable destinations.</li><li>An end-of-year all-hands bonus program, along with smaller opportunities for recognition throughout the year.</li></ul></ul></div></div><div class=\"section page-centered\" data-qa=\"salary-range\"><div>$150,000 - $185,000 a year</div><small><div>The expected annual salary range for this position is between<b> $150,000 and $185,000</b> USD. Compensation is determined based on a variety of factors including relevant experience, other job related qualifications/skills, geographic location, and business needs.</div></small></div><div class=\"section page-centered\" data-qa=\"closing-description\"><div><b style=\"font-size: 18px\">Join our team!&nbsp;</b></div><div><br></div><div>If you are passionate about 10up's mission and think you have what it takes to be successful in this role even if you don't check all the boxes, please apply. We'd appreciate the opportunity to personally review your application. Everyone gets a response.</div><div><br></div><div>Read more about <a href=\"https://drive.google.com/file/d/1nQ9yWRqfDAdrriYRnBNzYo7w59auYxMe/view\" class=\"postings-link\">What to Expect </a>through our Recruiting process.</div><div><br></div><div>We don't want you to miss any communication from us! To ensure you receive updates on your application, please add jobs@10up.com to your contacts list! #LI-Remote</div></div><div class=\"section page-centered last-section-apply\" data-qa=\"btn-apply-bottom\"><a class=\"postings-btn template-btn-submit hex-color\" data-qa=\"show-page-apply\" href=\"https://jobs.lever.co/10up-2/baeec154-fd4b-4805-aefc-45d4b6fe0105/apply\">Apply for this job</a></div>","tags":"[\"management\"]","pubDate":"2024-05-09 13:10:01.596","link":"https://jobs.lever.co/10up-2/baeec154-fd4b-4805-aefc-45d4b6fe0105","savedDate":"2024-05-09 13:10:01.596","slug":"director-of-ux-research-10up-8082"},{"id":4938173102,"title":"Events and Community Manager","company":"Instrumentl","image":"https://pbs.twimg.com/profile_images/1263546899153502209/ObHsQoNr_400x400.jpg","description":"<div class=\"section page-centered\" data-qa=\"job-description\"><div>Instrumentl is growing! We are looking for an intellectually curious <b>Events &amp; Community Manager</b>, who will collaborate with our Growth team to scale and optimize multiple initiatives across our go-to-market teams. </div><div><br></div><div>Do you love putting together events and connecting people to quality education? Do you love testing and scaling hypotheses? Ready to make a social impact while working in tech? If so, this position is for you. </div><div><br></div><div><b style=\"font-size: 18px\">About us:</b><span style=\"font-size: 18px\">&nbsp;</span></div><div><br></div><div>Instrumentl (YC S16) is the best platform for nonprofits and grant writing consultants looking to grow revenue. We are building the future of fundraising automation, helping over 3,500 nonprofits to discover, track, and manage grants efficiently through our SaaS platform.</div><div><br></div><div>Our mission is to be a force multiplier on the nonprofit sector’s ability to drive impact. We’re profitable and doubling year-over-year, with strong product-market fit (NPS is 60+).</div><div><br></div><div><b style=\"font-size: 18px\">About the role: </b></div><div><br></div><div>As an Events &amp; Community Manager at Instrumentl, you’ll be responsible for planning, organizing, and executing educational events and managing community engagement initiatives. Your primary goal will be to generate demand by creating meaningful experiences and building a strong, enthusiastic community. You'll work closely with our other Events &amp; Community Manager, Rachel. </div><div><br></div><div>Instrumentl is a startup, so you’ll have the unique opportunity to contribute across many areas of the company and help define the future of your role as the <b>6th</b> member of the Growth team. You’ll have significant ownership over the event calendar and the creative freedom to pitch new event formats and community-building approaches.</div><div><br></div><div>We’re interested in candidates who think strategically,&nbsp;thrive on community engagement, and take every opportunity to improve existing processes.</div><div><br></div><div>You'll be working closely with:</div><div><br></div><div>- Rachel, Events &amp; Community Manager</div><div>- Ryan, Content Marketer</div><div>- Taylor, Email Marketer</div><div>- Michael, Product Marketer</div><div>- Emily, Growth Designer</div><div>- Will, Head of Growth &amp; Marketing</div><div><br></div><div>Get to know us at <a href=\"https://www.instrumentl.com/about\" class=\"postings-link\">instrumentl.com/about</a>!</div><div><br></div><div>The Instrumentl team is fully distributed <b>(read: no office!).</b>&nbsp;For this position, we are looking for someone based in the continental US, but open to candidates who have substantial overlap with&nbsp;standard working hours in the Central Time Zone. </div></div><div class=\"section page-centered\"><div><h3>What you'll get to do: </h3><ul class=\"posting-requirements plain-list\"><ul><li>Lead and scale a growing educational grant workshop series with thousands of nonprofit attendees</li><li>Conceptualize, plan, and coordinate events such as virtual summits, conferences, seminars, workshops, and networking sessions</li><li>Develop and implement marketing strategies to promote events (event collateral and offer development, social media campaigns, media partner coordination, and other promotional channels)</li><li>Establish and maintain relationships with key stakeholders, including event sponsors, industry influencers, community leaders, and nonprofit organizations</li><li>Grow our community by organizing activities, programs, and initiatives that encourage interaction, collaboration, and networking among members (e.g. online forums, user groups, meetups, and special interest groups)</li><li>Pitch and onboard new affiliates to our partner program</li><li>Test hypotheses and collaborate with our Demand Gen Lead to validate new opportunities </li></ul></ul></div></div><div class=\"section page-centered\"><div><h3>What we're looking for:</h3><ul class=\"posting-requirements plain-list\"><ul><li><b>2+ years of full-time work experience</b>: you have been part of a Growth, Sales, Customer Success, or Marketing team, preferably at a SaaS company. </li><li><b>Comfort and experience running online education events: </b>you’ve run online workshops with several hundred attendees at scale and feel comfortable doing so.</li><li><b>Strong business acumen</b>: you can answer unstructured business questions and interpret qualitative and quantitative data to drive projects to conclusion. </li><li><b>Excellent analytical skills: </b>you spot trends quickly, and are highly comfortable conducting analysis with tools like Google Analytics, Google Data Studio, Heap, and Excel.</li><li><b>Clear communication</b>: you pride yourself on your ability to communicate complex topics easily in person (or on video) and in writing. </li><li><b>Effective execution</b>: you work efficiently, meet deadlines, stay organized, and have a reputation for being incredibly dependable. It pains you to miss a goal or milestone.&nbsp; </li><li><b>Resourcefulness</b>: you are able to conduct research and figure out solutions to new problems, given general direction and guidance. </li><li><b>Tech savviness:</b> you love using tools like G Suite, Zoom, Slack, <a href=\"http://Close.io\" class=\"postings-link\">Close.io</a>, and Canva. You’re a fan of shortcuts and can name your favorites off the top of your head.</li><li><b>Growth mindset: </b>you’re a self-motivated learner, and you welcome the chance to exchange constructive feedback with colleagues. </li><li><b>Friendly demeanor</b>: you are warm and approachable, easy to work with, and genuinely enjoy connecting with others.</li><li><b>Bonus: </b>you have worked at early-stage startups and feel comfortable (or even thrive!) with ambiguity.</li><li><b>Bonus</b>: you have experience in the nonprofit sector, especially with grants.</li><div><br></div></ul></ul></div></div><div class=\"section page-centered\"><div><h3>Compensation and Benefits:</h3><ul class=\"posting-requirements plain-list\"><ul><li>$50,000 - $70,000/year DOE + equity</li><li>Health, dental, and vision insurance</li><li>Generous PTO policy, including parental leave</li><li>401(k)</li><li>Company laptop + stipend to set up your home workstation</li><li>Work with awesome nonprofits around the US. We partner with incredible organizations doing meaningful work, and you get to help power their success.</li></ul></ul></div></div><div class=\"section page-centered\" data-qa=\"closing-description\"><div><b style=\"font-size: 18px\">What to expect:</b></div><div><br></div><div>Instrumentl is evolving rapidly. You’ll always have new challenges and opportunities to grow in your role here - you won’t be bored! You’ll be the&nbsp;<b>50th&nbsp;</b>member of our small but mighty team, playing a huge part in shaping our culture for the years and teammates to come.</div><div><br></div><div><b>At Instrumentl:</b></div><div><br></div><div>-&nbsp;<b>We’re customer-focused.&nbsp;</b>We routinely seek feedback from our customers to improve the Instrumentl experience for everyone.</div><div>-&nbsp;<b>We love to experiment</b>. Our team is constantly generating new ideas and iterating to see what works - ideation and experimentation are key values.</div><div>-&nbsp;<b>We’re approachable and collaborative.</b>&nbsp;Everyone has a voice, and we’re all building Instrumentl together.</div><div>-&nbsp;<b>We kick it every day with some of the nicest people in the world.&nbsp;</b>No joke, our customers are often on the front lines educating kids, saving endangered species, and restoring watersheds. In helping them take advantage of Instrumentl’s technology, you’re helping them move the world forward.</div><div><br></div><div><b style=\"font-size: 18px\">Ready to apply?</b></div><div><br></div><div>Submit a cover letter or a 5-minute Loom video addressing:</div><div><br></div><div>1. Your past experience related to the responsibilities of this job&nbsp;</div><div>2. Three traits (and examples) that make you an ideal candidate for this position</div><div><br></div><div>Include the word <b>timberwolves </b>in your application to show you read this from start to finish! Along with your cover letter/Loom video, please attach your CV or resume.</div><div><br></div><div><i>At Instrumentl, we pride ourselves on building a diverse team from the ground up. Every role is an opportunity to teach, learn, and create some of your best work - if you’re excited to grow along with us, we encourage you to apply!</i></div><div><br></div></div><div class=\"section page-centered last-section-apply\" data-qa=\"btn-apply-bottom\"><a class=\"postings-btn template-btn-submit hex-color\" data-qa=\"show-page-apply\" href=\"https://jobs.lever.co/Instrumentl/524228f7-620d-48e9-a2a9-48283cbde326/apply\">Apply for this job</a></div>","tags":"[]","pubDate":"2024-05-09 13:10:01.595","link":"https://jobs.lever.co/Instrumentl/524228f7-620d-48e9-a2a9-48283cbde326","savedDate":"2024-05-09 13:10:01.595","slug":"events-and-community-manager-instrumentl-2165"},{"id":7406443367,"title":"Head of Partnerships","company":"SafetyWing","image":"https://pbs.twimg.com/profile_images/1177267684574208000/54eG3WmW_400x400.jpg","description":"<h2>🧘 What we offer</h2> <div><!--block-->We operate in a fully remote work environment – work from anywhere globally.&nbsp;<br><br>You will receive salary and equity compensation, premium health insurance that works in most countries worldwide, travel insurance, a laptop, an office stipend, a minimum of four weeks of vacation per year, and a personal development budget.<br><br>We also have fantastic annual team gatherings. The previous ones were in Ljubljana, San Francisco, Mexico, Bali, and Siglufjörður.<br><br>We are looking forward to hearing from you!</div> <div><!--block--><strong>SafetyWing (YC W18)</strong> is seeking a visionary Head of Partnerships to scale up our Partnerships growth channel for Nomad Insurance and Nomad Health products.<br><br></div><div><!--block-->Partnerships with affiliates and content creators have successfully supported the tremendous growth of SafetyWing since its first product launch in 2019.</div><div><!--block--><br></div><div><!--block-->Our influencer program (the ambassador program) was created in-house and designed according to our unique values of authenticity and simplicity. As a result, it has become the most strategic growth channel, accounting for more than 35% of sales.<br>You will manage a team of Partnership Managers while working closely with the General Manager and the Chief Revenue Officer to achieve your goals.</div> <h2>💻 Your responsibilities will include</h2>  <ul><li><!--block-->Lead and grow a team of Partnership and Sponsorship Managers, ensuring they have the support and direction needed to meet the program's expansion goals. Set clear performance standards and encourage ongoing learning and improvement.</li><li><!--block-->Create a solid plan to grow the ambassador program from over 1,100 to 2,000 active influencers by the end of 2024 using iterative improvements and funnel techniques.</li><li><!--block-->Continuously refine growth strategies to expand the ambassador network. Use a funnel approach to find and fix bottlenecks and increase overall efficiency and growth.</li><li><!--block-->Propose and test various scaling strategies to find the most effective ways to grow the ambassador program quickly.</li><li><!--block-->Ensure the affiliate marketing team achieves its goals through strategic guidance, detailed reporting, and proactive problem-solving.</li><li><!--block-->Work closely with key partners to improve relationships and unlock their growth potential.&nbsp;</li></ul> <h2>🧪 We are looking for someone who</h2> <ul><li><!--block-->Has a proven track record and extensive experience in the partnerships field.</li><li><!--block-->Has a deep understanding of influencer marketing dynamics and partnership development, and is knowledgeable about current trends and strategies.</li><li><!--block-->Brings a successful history of managing and significantly expanding an affiliate or ambassador program, with a focus on innovative growth tactics and measurable outcomes.</li><li><!--block-->Can effectively motivate and guide a team of Partnership and Sponsorship Managers, building a culture focused on high performance, ongoing learning, and smart planning.</li><li><!--block-->Has a “go-getter attitude”: an entrepreneurial spirit who creatively solves problems and works independently.</li></ul><div><!--block--><strong>😀 We like to work with people who:</strong></div><ul><li><!--block-->Want to help build a global social safety net on the Internet.</li><li><!--block-->Think for themselves instead of copying others.</li><li><!--block-->Are willing to try new things, even with the risk of failure.</li><li><!--block-->Are intellectually curious and open to new ideas.</li><li><!--block-->Are creative and bold in the face of any problems.</li><li><!--block-->Have strong integrity and do the right thing.</li></ul>","tags":"[]","pubDate":"2024-05-09 13:10:01.593","link":"https://safetywing.pinpointhq.com/en/jobs/195353","savedDate":"2024-05-09 13:10:01.593","slug":"head-of-partnerships-safetywing-1828"},{"id":2730727426,"title":"CUSTOMER SUCCESS DIRECTOR (Work from anywhere in the world)","company":"Wishpond","image":"https://scontent.fcmb4-2.fna.fbcdn.net/v/t39.30808-6/273499217_5218973671480777_3308731762242867065_n.jpg?_nc_cat=110&ccb=1-7&_nc_sid=efb6e6&_nc_ohc=YDi_Wd17RD8AX9wXcyR&_nc_zt=23&_nc_ht=scontent.fcmb4-2.fna&oh=00_AfB4sOOYpj6VyDSuvvuqhVnZbH22m89SqG99HwaOa-uslw&oe=65BE4336","description":"<div><b style=\"font-size: 18px\">Wishpond Technologies currently has the position of Customer Success Director available, and we’re excited to tell you about it!</b></div><div><span style=\"font-size: 16.5pt\">&nbsp;</span></div><div><b style=\"font-size: 24px\">OVERVIEW</b></div><div><span style=\"font-size: 16px\">We are searching for a Customer Success Director (we call it Partner Success Director at Wishpond),&nbsp; to join our team on a full-time basis. This new role is a fully remote position and the successful individual could be based anywhere in the world. Overseeing our Wishpond Customer Success and Customer Support Teams, this position will work closely with all teams to ensure the success of our Partners. Together with all Teams, the Partner Success Director is responsible for the continued success of Wishpond Technologies Ltd.</span></div><div><span style=\"font-size: 24px\">&nbsp;</span></div><div><b style=\"font-size: 24px\">RESPONSIBILITIES</b></div><div><span style=\"font-size: 16px\">• Work closely with the Executive Leadership Team, ensuring alignment with corporate goals and objectives.</span></div><div><span style=\"font-size: 16px\">• Lead the development and implementation of strategies to improve overall partner operational effectiveness and success.</span></div><div><span style=\"font-size: 16px\">• Drive partner value and retention by deploying programs and solutions to help drive business value.</span></div><div><span style=\"font-size: 16px\">• Collaborate across business lines to identify and pursue partner growth opportunities.</span></div><div><span style=\"font-size: 16px\">• Influence internal stakeholders by promoting a partner-centric mindset across the organization.</span></div><div><span style=\"font-size: 16px\">• Provide strong leadership, promote collaboration, show integrity, and foster transparency to create a positive and open culture.</span></div><div><span style=\"font-size: 16px\">• Manage complex projects, effectively balancing both business and client needs.</span></div><div><span style=\"font-size: 16px\">• Ensure the development and implementation of award-winning products and services.</span></div><div><span style=\"font-size: 16px\">Develop and manage budgets, monitoring expenditures closely</span></div><div><span style=\"font-size: 16px\">• Conduct partner, brand and product research initiatives.</span></div><div><span style=\"font-size: 16px\">• Recruit, mentor, and empower Team Members, developing and implementing training programs to ensure operational excellence.</span></div><div><span style=\"font-size: 16px\">• Work cross-functionally to increase the value we deliver to our partners and improve retention across the client lifecycle.</span></div><div><span style=\"font-size: 16px\">• Work with partners to better understand their business needs and goals, ensuring Wishpond products and services are part of their plan.</span></div><div><span style=\"font-size: 16px\">• Cultivate lasting relationships to grow Team Member and client loyalty.</span></div><div><span style=\"font-size: 16px\">• Communicate new initiatives, following up to ensure processes are upheld and consistent.</span></div><div><span style=\"font-size: 16px\">• Other duties as assigned.</span></div><div><span style=\"font-size: 12pt\">&nbsp;</span></div><div><b style=\"font-size: 24px\">QUALIFICATIONS</b></div><div>• <span style=\"font-size: 16px\">A minimum of 5-7 years experience, preferably within a SaaS-oriented marketing operation or marketing agency.</span></div><div>• <span style=\"font-size: 16px\">A degree or diploma that contributes to the organization is considered an asset.</span></div><div>• <span style=\"font-size: 16px\">Strong recruitment, training, leadership, and negotiation skills.</span></div><div>• <span style=\"font-size: 16px\">In-depth knowledge of marketing strategies and best practices.</span></div><div>• <span style=\"font-size: 16px\">Experience in sales is considered an asset.</span></div><div>• <span style=\"font-size: 16px\">Capacity to manage global teams and complex projects seamlessly.</span></div><div>• <span style=\"font-size: 16px\">Must be detail-oriented and creative and have a passion for helping partners and Team Members achieve their goals.</span></div><div>• <span style=\"font-size: 16px\">Self-motivated with the ability to establish and maintain solid relationships through a client-first mentality.&nbsp;</span></div><div>• <span style=\"font-size: 16px\">As part of a diverse team, ability to work both independently and collaboratively.</span></div><div>• <span style=\"font-size: 16px\">Must be technical, analytical, results-driven and have the ability to multi-task in a fast-paced environment.</span></div><div>• <span style=\"font-size: 16px\">Organized, administratively strong, and have solid writing, phone, and general communication skills.</span></div><div>• <span style=\"font-size: 16px\">Fluent in English (spoken and written). Knowledge of a second language is considered an asset.</span></div><div>• <span style=\"font-size: 16px\">Willing to participate in ongoing education and training for the role.</span></div><div><br></div><div><b style=\"font-size: 24px\">WORK ENVIRONMENT</b></div><div><span style=\"font-size: 16px\">• It is expected that the successful candidate will provide their own workstation, computer, and headset, and have a fast and reliable internet connection.&nbsp;Certain roles will be required to utilize and or download company-approved software.</span></div><div><span style=\"font-size: 16px\">• The individual must be prepared to work standard business hours on EST or PST</span></div><div><span style=\"font-size: 16px\">• Due to the nature of this role, we may verify backgrounds including conducting employment references, criminal record, and credit checks.</span></div><div><span style=\"font-size: 16px\">• Once hired, the successful candidate must provide a valid government-issued photo ID and proof of residential address as part of their onboarding process.</span></div><div><br></div><div><b style=\"font-size: 24px\">GREAT REASONS TO JOIN OUR TEAM!</b></div><div><span style=\"font-size: 16px\">• Fully remote position allowing you to </span><b><span style=\"font-size: 16px\">work from your home anywhere in the world!</span></b></div><div><span style=\"font-size: 16px\">• Exciting and dynamic environment with a great leadership team&nbsp;</span></div><div><span style=\"font-size: 16px\">• Comprehensive training program and regular performance reviews to facilitate your success</span></div><div><span style=\"font-size: 16px\">• Competitive compensation based on experience and proven abilities</span></div><div><span style=\"font-size: 16px\">• Great referral programs with incentives and bonuses</span></div><div><span style=\"font-size: 16px\">• Unbelievable product discounts when you use our products for your own business</span></div><div><span style=\"font-size: 16px\">• A global workforce of multi-cultural and talented colleagues&nbsp;</span></div><div><span style=\"font-size: 16px\">• A close-knit operation with amazing growth opportunities for your personal development</span></div><div><span style=\"font-size: 16px\">• A high-growth SaaS technology company publicly traded on the TSX Venture Exchange</span></div><div><span style=\"font-size: 16px\">• Corporate headquarters in beautiful Vancouver, British Columbia, Canada</span></div><div><span style=\"font-size: 16px\">• Access to our education credits program and so much more!</span></div><div><br></div><div><b style=\"font-size: 24px\">ABOUT US</b></div><div><span style=\"font-size: 16px\">Founded in 2009, Wishpond is a rapidly growing technology company providing digital marketing solutions targeted at small businesses.&nbsp; The cloud-based platform includes landing pages, social promotions, website pop-ups, online forms, and lead activity tracking. Wishpond has a dedicated team of professional project managers, designers, copywriters, and developers who provide marketing services tailored to our individual clients.</span></div><div><span style=\"font-size: 16px\">&nbsp;</span></div><div><span style=\"font-size: 16px\">Wishpond serves over 3,000 customers in various industries and sizes, from startups to large Fortune 500 companies. Wishpond has a rapidly growing global headcount and continues to hire dedicated and qualified employees and contractors who have what it takes to scale a successful software company.</span></div><div><br></div><div><span style=\"font-size: 16px\">To learn more about Wishpond Technologies, please visit our website or any of our social media platforms:</span></div><div><br></div><div><span style=\"font-size: 16px\">• Website: </span><a href=\"http://www.wishpond.com/\"><span style=\"font-size: 16px\">www.wishpond.com</span></a></div><div><span style=\"font-size: 16px\">• Instagram: @wishpondofficial</span></div><div><span style=\"font-size: 16px\">• Twitter: Wishpond</span></div><div><span style=\"font-size: 16px\">• Youtube: Thewishpond</span></div><div><span style=\"font-size: 16px\">• LinkedIn : Wishpond</span></div><div><br></div><div><b style=\"font-size: 24px\">APPLICATION PROCESS</b></div><div><b><span style=\"font-size: 16px\">If you are interested in applying for this exciting opportunity, please provide an updated resume in English (PDF or Word formats only), quoting the position title in the subject line of your cover letter</span></b></div><div><span style=\"font-size: 16px\">&nbsp;</span><b><span style=\"font-size: 16px\">&nbsp;</span></b></div><div><span style=\"font-size: 16px\">Wishpond Technologies is an equal-opportunity employer committed to hiring a diverse workforce and sustaining an inclusive culture that does not discriminate on the basis of disability, status, or any other basis protected under legislation</span></div><div><span style=\"font-size: 16px\">&nbsp;</span></div><div><span style=\"font-size: 16px\">We thank all applicants in advance for their interest in this position however due to the volume of applications we receive, we are unable to respond to phone, email, or agency inquiries.</span></div><div><br></div><div>&nbsp;</div><div><br></div><div>&nbsp;</div>","tags":"[]","pubDate":"2024-05-08 22:26:50.233","link":"https://jobs.lever.co/wishpond/c61a06a2-d781-49fe-b0de-db3ad6715a98","savedDate":"2024-05-09 13:10:01.599","slug":"customer-success-director-work-from-anywhere-in-the-world-wishpond-1207"},{"id":3645223614,"title":"Muhasebe Uzmanı","company":"Ciceksepeti","image":"https://lever-client-logos.s3.us-west-2.amazonaws.com/de4eebbf-97f1-4bdb-b542-4fa65a0b48ab-1662467464737.png","description":"<div><b>Bir teknolojisi firması olarak faaliyet gösterdiğimiz tüm pazarlarda lider olmak vizyonuyla çıktığımız yolda bize katılmak ister misiniz?</b></div><div><br></div><div>Kurumsalın alışılagelmiş ifadelerinden ve hiyerarşiden uzak heyecan verici bir kariyere başlamak için en iyi yönlerini ortaya çıkarmaya hazır, dinamik, entelektüel açıdan meraklı genç profesyoneller arıyoruz. Hızla büyümeye devam eden bir teknoloji şirketi olarak gerçek hayatta yaşanan sorunları çözme ve profesyonel yaşamı deneyimleme imkanı sunuyoruz. Yaptığın işin tüm sorumluluğunu almak istiyorsan, işine katkı sağlayacak yeni fikirlerin olduğunda sesini duyurmak istiyorsan ve olağanüstü bir işbaşında eğitim deneyimi yaşamaya hazırsan; o zaman meydan okumaya hazırsın.</div><h3>✨Aranan nitelikler</h3><li>Üniversitelerin İktisat, İşletme, İstatistik, Ekonometri, İİBF bölümlerinden mezun</li><li>Genel muhasebe alanında en az 2 yıl deneyimli</li><li>E-Fatura, E-Arşiv ve E-Defter süreçlerinde bilgi sahibi</li><li>MS Office programlarını iyi derecede kullanabilen</li><li>Planlı ve sonuç odaklı çalışan</li><li>Ekip çalışmasına yatkın, iletişim becerisi yüksek</li><li>ERP programlarında bilgi sahibi ve aktif olarak kullanmış (Tercihen Microsoft Axapta)</li><li>Cari hesap mutabakatları konusunda tecrübeli</li><li>Tek düzen hesap planı ve raporlama konusunda deneyimli</li><li>Muhasebe kayıtlarının atılması ve beyanname süreçleri konusunda kendini geliştirme hedefi olan</li><li>Tercihen SMMM stajını başlatmış olan</li><li>Güçlü planlama ve organizasyon becerisine sahip&nbsp;</li>,<h3> 🎯 Sorumluluklar</h3><li>Muhasebeye konu olan tüm işlemlerin Türk Vergi Mevzuatı ve Muhasebe ilkeleri doğrultusunda işleyişinin, muhasebeleştirilmesinin sağlanması</li><li>Cari hesap, borç-alacak takibi, kur farkı hesaplamaları ve muhatapları ile iletişime geçerek mutabakatların takip edilip, yönetilmesi</li><li>Haftalık ve aylık bayi faturalarının kesilmesi ve kontrolü</li><li>Genel muhasebe,&nbsp;Bilançolar, KDV, Muhtasar,&nbsp;Geçici Vergi, Kurumlar Vergisi, BA-BS ve Damga Vergisi Beyanname süreçlerinde görev alınması</li><li>Kredi kartı, poliçe, personel masraf ve avansların muhasebeleştirilmesi ve mutabakatının yapılması</li><li>Yurt dışı faturalarının stopaj sürecine uygun olarak sisteme alınmasını sağlamak</li><li>Ay-dönem sonu kapanış işlemlerinin yürütülmesi ve bu süreçlere destek olunması</li><div><b>😍 Hakkımızda</b></div><div><br></div><div>En kolay ve ekonomik yoldan çiçek göndermeyi sağlamak için 2006’da kurulan <u><a href=\"http://ciceksepeti.com/\" class=\"postings-link\">ciceksepeti.com</a></u>, Türkiye genelinde <u><a href=\"http://55.0.0.0/\" class=\"postings-link\">55.000</a></u>+ iş ortağı ve 70’den fazla ile gönderimini sağladığı binlerce siparişle, Türkiye'deki en büyük online çiçekçidir.😎</div><div><br></div><div>Çiçeksepeti; çiçek aranjmanları, kek ve kurabiye buketlerinin yanı sıra kişiselleştirilmiş hediyeler ile müşterilerine binlerce alternatif sunarak özel günlerde ilk akla gelen e-ticaret firmasıdır. Türkiye'deki başarı hikâyemizi, LolaFlora markası ile Meksika'da sürdürürken, bir teknoloji firması olarak, hediye alanındaki pazar liderliğimizi yeni iş modellerimize de taşımak vizyonu ile emin adımlarla ilerliyoruz. 💃</div><div><br></div><div><br></div><div>\"İşe alım süreçlerimizde kişisel verilerinizi nasıl işlediğimize dair bilgiye çalışan adayı aydınlatma metnimizden ulaşabilirsiniz./ Please see our candidate privacy note for information on how we process your personal data during our recruitment activities.\"</div><div><a href=\"https://cdn03.ciceksepeti.com/editor/hr/Ciceksepeti_CS-Teknoloji-Calisan-Adayi_Aydinlatma-Metni-15092023.pdf\" class=\"postings-link\">https://cdn03.ciceksepeti.com/editor/hr/Ciceksepeti_CS-Teknoloji-Calisan-Adayi_Aydinlatma-Metni-15092023.pdf</a>&nbsp;</div><div><a href=\"https://cdn03.ciceksepeti.com/editor/hr/Ciceksepeti_CS-Teknoloji-Calisan-Adayi_Aydinlatma-Metni-15092023.docx.pdf\" class=\"postings-link\">https://cdn03.ciceksepeti.com/editor/hr/Ciceksepeti_CS-Teknoloji-Calisan-Adayi_Aydinlatma-Metni-15092023.docx.pdf</a></div>","tags":"[]","pubDate":"2024-05-08 09:28:11.406","link":"https://jobs.lever.co/ciceksepeti/f8a9de23-c8d2-48fd-939d-24fd186bfb74","savedDate":"2024-05-09 13:10:01.604","slug":"muhasebe-uzman-ciceksepeti-8546"},{"id":2998073416,"title":"Channel Sales Specialist (UAE)","company":"Airalo","image":"https://lever-client-logos.s3.us-west-2.amazonaws.com/55028a36-609c-479c-9553-d4689ff2dd8c-1669620566663.png","description":"<div><b>About Airalo</b></div><div>Alo! Airalo is the world’s first eSIM store that helps people connect in over 200+ countries and regions across the globe. We are building the next digital service that revolutionizes the telecom industry. We are a travel-tech company and an equal-opportunity environment that values and executes diversity, inclusion, and equity. Our team is spread across 50+ countries and six continents. What glues us together is our commitment to changing the way you connect<span style=\"font-size: 13.3333px\">. </span></div><div><br></div><div><b>About you</b></div><div>We hope that you care deeply about the quality of your work, the intrinsic worth of tasks, and the success of your team. You are self-disciplined and do not require micromanagement in terms of your skillset and work ethic. You do your best to flourish as an individual every day while working hard to foster a collaborative team environment. You believe in the importance of being — and staying — authentic, honest, positive, and kind. You are a good interlocutor with clear and concise communication. You are able to manage multiple projects, have an analytical mind, pay keen attention to detail, and love to get your hands dirty. You are cognizant, tolerant, and welcoming of vulnerabilities and cultural differences.</div><div><br></div><div><b>About the Role</b></div><div><b>Position</b>: Full-time / Employee</div><div><b>Location:</b>&nbsp;Remote-first </div><div><b>Benefits:</b>&nbsp;Health Insurance, work-from-anywhere stipend, annual wellness &amp; learning credits, annual all-expenses-paid company retreat in a gorgeous destination &amp; other benefits</div><div><br></div><div>Airalo is looking for a retail <b>Channel Sales Specialist</b> to join the <b>Airalo Partnerships</b> department.</div><div>Physical SIM cards are passe. The future of connectivity, especially for travelers, is through eSIMs. As the undisputed industry leader in the B2C segment, we are now looking to expand our presence in the retail and traditional telecom sales channels to bring the eSIM revolution to hundreds of thousands of telecom retailers globally.</div><div>As the <b>Channel Sales Specialist</b> for UAE, you will own Airalo’s retail distribution strategy and execution to ensure Airalo’s presence across branded and unorganized travel, telecom and general retail stores.</div><h3>Responsibilities include but are not limited to:</h3><li>Work closely with the <b>Channel Sales Manager, Arabia &amp; Africa</b> and other team members in the department</li><li>Market mapping of the travel agent and telecom retail universe in key cities across UAE and creating a distribution roadmap to achieve maximum penetration across the universe</li><li>Onboard and support new partners as they join the Airalo partner community</li><li>Build and maintain fruitful relationships with the store managers / owners to drive mutual growth</li><li>Drive visibility and brand awareness for Airalo at point of sale through merchandising / employee training</li><li>Design and manage a program to educate retailers and travel agents on eSIM adoption</li><li>Conduct competitive research and define the Airalo retail distribution roadmap to maintain Airalo’s status as the preferred provider across partners</li><li>Collaborate and work with different internal and external stakeholders to develop and execute projects/opportunities successfully</li><li>Own and deliver monthly, quarterly and annual OKRs for your channel with regular tracking and progress reports</li><li>As a core member of the UAE squad, always explore ways and means to further consolidate Airalo’s dominance in UAE</li>,<h3>Must-haves:</h3><li>2+ years of experience in retail channel sales or business development in the travel or telecom industry</li><li>Good understanding of the retail (preferably the travel and / or telecom retail) channel in UAE</li><li>This is a largely relationship driven channel. You must be able to forge and nurture relationships with stakeholders across the channel</li><li>Ability to narrate a good story - Airalo’s unique story and the problem we solve for our users makes it a compelling pitch for partners</li><li>Ability to employ sales techniques, including effective questioning, objection handling, consultative selling, and solution selling</li><li>Ability to multi-task</li><li>Experience with sales and partnerships tools</li><li>Perfect verbal and written communication skills in English and Arabic.</li>,<h3>Good to have:</h3><li>Familiarity with the travel or telecom industry</li><li>Prior work experience in the travel or telecom industry</li><li>Knowledge of eSIM and GSMA-related technologies and services</li><li>Certificates and courses in sales and partnerships</li><div>If you are interested in this position, <b>please apply via the link.</b></div><div><br></div><div><i>We sincerely thank all applicants in advance for submitting their interest in this opportunity with Airalo. </i></div>","tags":"[\"management\",\"B2C\"]","pubDate":"2024-05-08 07:44:26.116","link":"https://jobs.lever.co/airalo/c2d0a493-ec3d-4850-a3a8-92479bc835e2","savedDate":"2024-05-09 13:10:01.602","slug":"channel-sales-specialist-uae-airalo-7610"},{"id":2462633665,"title":"Channel Sales Specialist (Saudi Arabia)","company":"Airalo","image":"https://lever-client-logos.s3.us-west-2.amazonaws.com/55028a36-609c-479c-9553-d4689ff2dd8c-1669620566663.png","description":"<div><b>About Airalo</b></div><div>Alo! Airalo is the world’s first eSIM store that helps people connect in over 200+ countries and regions across the globe. We are building the next digital service that revolutionizes the telecom industry. We are a travel-tech company and an equal-opportunity environment that values and executes diversity, inclusion, and equity. Our team is spread across 50+ countries and six continents. What glues us together is our commitment to changing the way you connect<span style=\"font-size: 13.3333px\">. </span></div><div><br></div><div><b>About you</b></div><div>We hope that you care deeply about the quality of your work, the intrinsic worth of tasks, and the success of your team. You are self-disciplined and do not require micromanagement in terms of your skillset and work ethic. You do your best to flourish as an individual every day while working hard to foster a collaborative team environment. You believe in the importance of being — and staying — authentic, honest, positive, and kind. You are a good interlocutor with clear and concise communication. You are able to manage multiple projects, have an analytical mind, pay keen attention to detail, and love to get your hands dirty. You are cognizant, tolerant, and welcoming of vulnerabilities and cultural differences.</div><div><br></div><div><b>About the Role</b></div><div><b>Position</b>: Full-time / Employee</div><div><b>Location:</b>&nbsp;Remote-first </div><div><b>Benefits:</b>&nbsp;Health Insurance, work-from-anywhere stipend, annual wellness &amp; learning credits, annual all-expenses-paid company retreat in a gorgeous destination &amp; other benefits</div><div><br></div><div>Airalo is looking for a retail <b>Channel Sales Specialist</b> to join the <b>Airalo Partnerships</b> department.</div><div>Physical SIM cards are passe. The future of connectivity, especially for travelers, is through eSIMs. As the undisputed industry leader in the B2C segment, we are now looking to expand our presence in the retail and traditional telecom sales channels to bring the eSIM revolution to hundreds of thousands of telecom retailers globally.</div><div>As the <b>Channel Sales Specialist</b> for Saudi Arabia, you will own Airalo’s retail distribution strategy and execution to ensure Airalo’s presence across branded and unorganized travel, telecom and general retail stores.</div><h3>Responsibilities include but are not limited to:</h3><li>Work closely with the <b>Channel Sales Manager, Arabia &amp; Africa</b> and other team members in the department</li><li>Market mapping of the travel agent and telecom retail universe in key cities across Saudi Arabia and creating a distribution roadmap to achieve maximum penetration across the universe</li><li>Onboard and support new partners as they join the Airalo partner community</li><li>Build and maintain fruitful relationships with the store managers / owners to drive mutual growth</li><li>Drive visibility and brand awareness for Airalo at point of sale through merchandising / employee training</li><li>Design and manage a program to educate retailers and travel agents on eSIM adoption</li><li>Conduct competitive research and define the Airalo retail distribution roadmap to maintain Airalo’s status as the preferred provider across partners</li><li>Collaborate and work with different internal and external stakeholders to develop and execute projects/opportunities successfully</li><li>Own and deliver monthly, quarterly and annual OKRs for your channel with regular tracking and progress reports</li><li>As a core member of the Saudi Arabia squad, always explore ways and means to further consolidate Airalo’s dominance in Saudi Arabia</li>,<h3>Must-haves:</h3><li>2+ years of experience in retail channel sales or business development in the travel or telecom industry</li><li>Good understanding of the retail (preferably the travel and / or telecom retail) channel in Saudi Arabia</li><li>This is a largely relationship driven channel. You must be able to forge and nurture relationships with stakeholders across the channel</li><li>Ability to narrate a good story - Airalo’s unique story and the problem we solve for our users makes it a compelling pitch for partners</li><li>Ability to employ sales techniques, including effective questioning, objection handling, consultative selling, and solution selling</li><li>Ability to multi-task</li><li>Experience with sales and partnerships tools</li><li>Perfect verbal and written communication skills in English and Arabic.</li>,<h3>Good to have:</h3><li>Familiarity with the travel or telecom industry</li><li>Prior work experience in the travel or telecom industry</li><li>Knowledge of eSIM and GSMA-related technologies and services</li><li>Certificates and courses in sales and partnerships</li><div>If you are interested in this position, <b>please apply via the link.</b></div><div><br></div><div><i>We sincerely thank all applicants in advance for submitting their interest in this opportunity with Airalo. </i></div>","tags":"[\"management\",\"B2C\"]","pubDate":"2024-05-08 07:39:29.523","link":"https://jobs.lever.co/airalo/05f58e3c-fe0a-4a43-9c81-18097500cb78","savedDate":"2024-05-09 13:10:01.601","slug":"channel-sales-specialist-saudi-arabia-airalo-1636"},{"id":7748334115,"title":"Product Owner, Risk Management","company":"Cayuse","image":"https://remotive.com/job/1910732/logo","description":"<div class='\"content-intro\"'><p><span style='\"font-weight:'>The exciting world of scientific research is fueled by people with a passion for solving complex problems. At Cayuse, we are committed to our customers’ success by empowering organizations to conduct globally connected research that advances their impact on science, discovery and society. We build on that commitment with proven, integrated and easy-to-use technology that delivers exceptional value, and world class service and support that accelerates outcomes.</span></p>\n<p><span style='\"font-weight:'>But we are more than just an empowering platform powered by advanced technologies. We are a collaboration of exceptional, highly skilled people with multi-disciplinary expertise, and are building our team to support our ambitious growth plans. Cayuse’s foundational strength comes from our customer and employee focused values and commitment to industry-leading solutions. It’s an exciting time to become a key member of our growing team.</span></p></div><p>Reporting to the Director of Product Management, the Product Owner’s responsibilities include gathering feature requests, scheduling releases and coordinating sprints. To be successful in this role, you should be able to identify user needs and work with cross-functional teams to manage product releases.</p>\n<p> </p>\n<p><strong>Responsibilities</strong></p>\n<ul style=\"\">\n<li style=\"\">Organize, prioritize and assess work for the scrum teams for the iRIS, Human Ethics and Outside Interests applications</li>\n<li style=\"\">Develop and write user stories with clear acceptance criteria</li>\n<li style=\"\">Utilize data, analysis, and user feedback to make decisions and influence others</li>\n<li style=\"\">Groom and prioritize backlog</li>\n<li style=\"\">Plan and communicate releases and upgrades</li>\n<li style=\"\">Follow progress of work and address production issues during sprints</li>\n<li style=\"\">Lead Agile execution ceremonies with the engineering team: sprint planning, story refinement, daily stand up, sprint review, and retrospective</li>\n<li style=\"\">Act as the main point of contact between teams and stakeholders</li>\n<li style=\"\">Work closely with Product Management colleagues to ensure alignment to the roadmap</li>\n<li style=\"\">Translates product roadmap features into well-defined product requirements including features, user stories, and acceptance test criteria.</li>\n<li style=\"\">Assist the scrum/product development teams to meet the objectives of each sprint</li>\n<li style=\"\">Monitor provided metrics for Say/Do, Scope Change, Software Quality, Dev Capacity, etc., and adjust practices to achieve targets.</li>\n<li style=\"\">Develop application subject matter expertise over time to act as the escalation point for questions from the customer support team</li>\n<li style=\"\">Complete final acceptance testing for items delivered each sprint</li>\n<li style=\"\">Report progress to Senior Leadership in scheduled monthly meetings</li>\n</ul>\n<p> </p>\n<p><strong>Skills and Requirements</strong></p>\n<ul style=\"\">\n<li style=\"\">5+ years in SaaS businesses</li>\n<li style=\"\">Previous work experience as a Product Owner or similar role</li>\n<li style=\"\">Proven experience creating effective business requirements and user stories</li>\n<li style=\"\">Hands-on experience managing all stages of the product life cycle</li>\n<li style=\"\">Technical background with knowledge of software development and SaaS technologies</li>\n<li style=\"\">In-depth knowledge of Agile methodologies</li>\n<li style=\"\">Strong analytical and problem-solving skills</li>\n<li style=\"\">Ability to effectively and actively communicate with both business and technical stakeholders and resources</li>\n<li style=\"\">Comfort with ambiguity; demonstrated track record of developing solutions to problems</li>\n<li style=\"\">Ability to earn and keep trust of customers, stakeholders, and engineering teams</li>\n<li style=\"\">Ability to communicate effectively with technical and non-technical individuals; excellent written and verbal communication skills</li>\n<li style=\"\">Strong leadership skills to help cultivate team cohesion and strong Agile habits with a mix of on-shore, near-shore and off-shore engineering resources</li>\n<li style=\"\">Bachelor's degree with BSc in Computer Science, Information Systems or similar preferred</li>\n</ul>\n<p> </p>\n<p><strong>Benefits</strong></p>\n<ul style=\"\">\n<li style=\"\">Competitive Medial Benefits (PPO + HSA available)</li>\n<li style=\"\">Vision, Dental, Short-Term Disability fully covered by Cayuse</li>\n<li style=\"\">Unlimited PTO + Holidays + Flexible Work Schedule</li>\n<li style=\"\">Remote Work Stipend</li>\n<li style=\"\">Equal Paid Parental Leave</li>\n<li style=\"\">401k with Employer Matching</li>\n<li style=\"\">Quarterly Wellness Reimbursement</li>\n<li style=\"\">Remote Work Environment, supporting the Ultimate Employee Experience  </li>\n</ul>\n<p> </p>\n<p> </p>\n<p><strong><em>Cayuse does not accept agency resumes. Please do not forward resumes to our jobs alias or any Cayuse employees. Cayuse is not responsible for any fees related to unsolicited resumes.</em></strong></p><div class='\"content-conclusion\"'><div class='\"\"' id='\"content\"'>\n<p>Our culture is one of inclusion and belonging where everyone feels respected, treated justly, supported and nourished. We all share responsibility for creating and sustaining a work environment where differences are celebrated and we are empowered to strive for excellence. We’re proud to be an equal opportunity employer and actively seek to recruit, develop, and retain a diverse and talented workforce.</p>\n</div></div><img src=\"https://remotive.com/job/track/1910732/blank.gif?source=public_api\" alt=\"\"/>","tags":"[\"saas\",\"scrum\",\"agile\",\"research\",\"product management\",\"product development\",\"product owner\",\"risk management\",\"testing\",\"computer science\"]","pubDate":"2024-05-08 05:21:33.000","link":"https://remotive.com/remote-jobs/product/product-owner-risk-management-1910732","savedDate":"2024-05-09 13:10:01.592","slug":"product-owner-risk-management-cayuse-9624"},{"id":9959161186,"title":"Paid Media Analyst","company":"Mechanism Ventures","image":"https://remotive.com/job/1910992/logo","description":"<div><!--block--><strong>About Bold.org</strong><br>Our mission is to fight student debt. We're a team of dozens, serving a platform of millions, with trillions of dollars in student debt at stake.<br><br>At Bold.org, anyone and any company can create customized scholarships, fellowships, and grants in minutes with the confidence that the award will go to deserving individuals who will boldly change the world.<br><br>Students and graduates use Bold.org to win scholarships, manage their finances, and redeem their earned rewards to pay for their education.<br><br>We're profitable, growing quickly, and hiring amazing people who want to change the education, finance, and philanthropy landscapes. If that resonates, we'd love to hear from you.<br><br><strong>About The Role</strong><br>We’re growing quickly, with millions of users on the platform, and are looking for an analytical-minded Paid Media Analyst to help grow our paid media marketing channels, including Google Ads, Meta Ads, TikTok Ads, and more.<br><br>In this role, you will work directly with our Paid Media Growth Lead to help launch, optimize, and measure ad campaigns as we execute on our growth roadmap across both students and donors. <br><br>While only a broad experience with paid media is required, this position will present numerous opportunities for growth and development. You will be successful in this role if you are eager to learn new paid media systems, have an engineering degree, and have a penchant for continuous growth.<br><br>We are fully remote and this role can be done from anywhere, but will require significant daily overlap with European CEST working hours.<br><br></div>\n<p><br><br></p>\n<div class=\"h3\">Key Responsibilities</div>\n<ul style=\"\">\n<li style=\"\"><!--block-->Launch new campaigns on Meta, Google, TikTok, and more.</li>\n<li style=\"\"><!--block-->Periodically optimize bids/budgets, review search terms, and run ad creative tests across our paid channels, by following some predefined optimization strategies.</li>\n<li style=\"\"><!--block-->Track, monitor, and analyze ad performance across our channels while keeping our dashboards up-to-date.</li>\n<li style=\"\"><!--block-->Collaborate with our Social Team as needed to craft outstanding ad creatives for our paid media campaigns.</li>\n<li style=\"\"><!--block-->Represent the Bold.org brand and mission of fighting student debt to many millions.</li>\n<li style=\"\"><!--block-->Be the steward of our vision and values across all communications.</li>\n</ul>\n<div><!--block--></div>\n<p><br><br></p>\n<div class=\"h3\">Skills, Knowledge and Expertise</div>\n<ul style=\"\">\n<li style=\"\"><!--block-->Engineering background (preferably a Chemical or Civil Engineering degree).</li>\n<li style=\"\"><!--block-->1-2 years of broad experience with paid media (Google/Facebook Ads preferred).</li>\n<li style=\"\"><!--block-->An excellent executor. You excel at learning and executing predetermined processes quickly and with strong attention to detail.</li>\n<li style=\"\"><!--block-->Analytical-minded. You excel at analyzing data and are comfortable with data-rich Google Sheets and advertising platforms to ensure our campaigns are optimized at their best.</li>\n<li style=\"\"><!--block-->Eagerness to learn new tools and technologies.</li>\n<li style=\"\"><!--block-->Excellent written English.</li>\n<li style=\"\"><!--block-->Any growth, A/B testing, conversion rate optimization, Google Analytics, Google Ads Editor, or Supermetrics experience is a plus but is not required.</li>\n</ul>\n<div><!--block--></div>\n<p><br><br></p>\n<div class=\"h3\">Logistics</div>\n<div><!--block--><strong>Time Commitment</strong></div>\n<div><!--block-->Full-time and will require a significant daily overlap with European CEST working hours.</div>\n<div><!--block--></div>\n<div><!--block--><strong>Location</strong></div>\n<div><!--block-->We are fully remote – you can work wherever you’re most productive.</div>\n<img src=\"https://remotive.com/job/track/1910992/blank.gif?source=public_api\" alt=\"\"/>","tags":"[\"google ads\",\"facebook ads\",\"paid media\"]","pubDate":"2024-05-08 05:21:15.000","link":"https://remotive.com/remote-jobs/marketing/paid-media-analyst-1910992","savedDate":"2024-05-09 13:10:01.592","slug":"paid-media-analyst-mechanism-ventures-2264"},{"id":3494525641,"title":"Sales Intern (Immediate Hire) - Fully Remote","company":"CoverGo","image":"https://pbs.twimg.com/profile_images/1382655628523364355/MWPIbbID_400x400.jpg","description":"<p><strong>Top 3 Reasons To Join Us</strong></p><ul> <li>International Environment</li> <li>100% Remote</li> <li>Access to Cutting-Edge Technology</li> </ul><p><strong>About Us</strong></p><p>At CoverGo, our mission is to empower all insurance companies to make insurance 100% digital and accessible to everyone.</p><ul> <li>We are a leading global no-code insurance platform for health, life, and P&amp;C</li> <li>We’re the winner of the Insurtech of the Year in all of Asia and other awards globally</li> <li>We work with insurance enterprise clients such as AXA, Bupa, MSIG, Dai-ichi, Bank of China Group Insurance, and many more</li> <li>We're an international, diverse team of over 120 people with 30 nationalities and team members working remotely from all over the world</li> <li>We are fully funded and backed by reputable VC funds and strategic institutional investors</li> <li>We have a global presence in Asia, EMEA and the Americas</li> <li>We’ve grown our annualized revenue by over 30x since January 2021</li> <li>We’re constantly working towards making CoverGo a workplace that you love coming to. We deeply believe that bringing together a diversity of thoughts, expressions, and perspectives is key to building the best culture for equally diverse communities all over the world</li> </ul><p><strong>What You Will Do&nbsp;</strong></p><ul> <li>Research and identify potential clients and market segments to target for business development opportunities, contributing to SDR upper funnel effort</li> <li>Generate leads through cold emails, LinkedIn Sales Navigator, networking, and other outreach efforts</li> <li>Conduct presentations and product demonstrations to potential clients.</li> <li>Use Salesforce as company CRM, ensure data accuracy for reporting analytics</li> <li>Track and report on sales performance metrics, including pipeline activity and revenue forecasts.</li> <li>Stay updated on industry trends, market conditions, and competitive activities.</li> </ul><p><strong>What We Need</strong></p><ul> <li>Bachelor's degree in Business Administration, Marketing, or related field (undergraduates are welcome)</li> <li>Proficiency in Google Workspace and Microsoft Office suite is required</li> <li>Proficiency in CRM software (Salesforce) is a plus</li> <li>Knowledge in the insurance industry is a major advantage</li> <li>Strong communication, negotiation, and interpersonal skills.</li> <li>Ability to work independently and as part of a team in a fast-paced environment.</li> <li>Excellent time management and organizational skills.</li> <li>Internship duration: Minimum of 2 months</li> <li>Please be advised that this internship opportunity is unpaid</li> </ul><p><strong>Why You'll Love Working Here</strong></p><ul> <li>Remote Setup</li> <li>International Environment</li> <li>Professional Development Opportunities</li> <li>Company activities and events</li> </ul><p><strong>CoverGo Company</strong><a href=\"https://www.youtube.com/watch?v=YI0ezLxvFvA\" rel=\"nofollow noreferrer noopener\" class=\"external\"><strong> Video</strong></a></p><p>By submitting your application, you confirm that you have read, understood, and accepted the content of CoverGo’s <a href=\"https://apply.workable.com/covergo/gdpr_policy?lng=en\" target=\"_blank\" rel=\"nofollow noreferrer noopener\" class=\"external\">Privacy Notice</a> and you consent to the processing of your data as part of this application.</p><h3>Requirements: </h3><h3>Benefits: </h3>","tags":"[\"management\"]","pubDate":"2024-05-08 00:00:00.000","link":"https://apply.workable.com/covergo/j/B8DB830338","savedDate":"2024-05-09 13:10:01.597","slug":"sales-intern-immediate-hire-fully-remote-covergo-9519"},{"id":1536248065,"title":"Senior Business Analyst - Insurance (Fully Remote)","company":"CoverGo","image":"https://pbs.twimg.com/profile_images/1382655628523364355/MWPIbbID_400x400.jpg","description":"<h3><strong>Top 3 Reasons To Join Us</strong></h3><ul> <li>Competitive Salary</li> <li>100% Remote</li> <li>Working on the latest tech for the Insurtech Market Leader</li> </ul><h3><strong>About Us</strong></h3><p>At CoverGo, our mission is to empower all insurance companies to make insurance 100% digital and accessible to everyone.</p><ul> <li>We are a leading global no-code insurance platform for health, life, and P&amp;C</li> <li>We’re the winner of the Insurtech of the Year in all of Asia and other awards globally</li> <li>We work with insurance enterprise clients such as AXA, Bupa, MSIG, Dai-ichi, Bank of China Group Insurance, and many more</li> <li>We're an international, diverse team of over 120 people with 30 nationalities and team members working remotely from all over the world</li> <li>We are fully funded and backed by reputable VC funds and strategic institutional investors</li> <li>We have a global presence in Asia, EMEA and the Americas</li> <li>We’ve grown our annualized revenue by over 30x since January 2021</li> <li>We’re constantly working towards making CoverGo a workplace that you love coming to. We deeply believe that bringing together a diversity of thoughts, expressions, and perspectives is key to building the best culture for equally diverse communities all over the world</li> </ul><h3>What You Will Do:</h3><ul> <li>Work with clients and technical resources to identify their business problems and develop the right approach and analytical solution</li> <li>Plan and design simple to semi-complex business processes and system modifications</li> <li>Make recommendations to improve and support business activities</li> <li>Gather business requirements through a variety of techniques such as work sessions and interviews then analyze and document client complex business requirements and processes; communicate these requirements to appropriate parties</li> <li>Create complex test case scenarios to be used in testing; monitor/oversee the testing of business applications to verify that all client requirements are incorporated into the system design</li> <li>Develop business requirements documents/user stories to support the required modifications</li> <li>May plan, allocate and monitor work of other business analysts</li> <li>Understand simple to complex systems and related data to surface actionable insights, demonstrate sound judgment and decision-making skills</li> <li>Assist in providing time estimates for project related tasks</li> <li>Aid in updating process and procedural documentation</li> <li>Develop basic understanding of technical development cycle of mobile application or web portals</li> <li>Support QA, UAT and Release phases of the project via defect analysis, change maintenance, etc.</li> <li>Any other task that may be assigned</li> </ul><h3>What We Need:</h3><ul> <li>Minimum 5 years of experience as Business Analyst</li> <li>A degree in Business, IT or any relevant field</li> <li>Previous experience working in the insurance industry or Insurtech is preferred</li> <li>Health Insurance-related domain certification from INS/LOMA or III is an added advantage</li> <li>Knowledge of business analysis concepts of defining requirements, translating to technical solutions, and Agile approach to prioritizing work to epics, sprints</li> <li>Business analysis skills including facilitation, process documentation, requirements gathering and user acceptance testing</li> <li>Good organizational/time management skills to prioritize work and meet deadlines within defined timeframes</li> <li>Experience in an Agile and/or Scrum environment is a must</li> <li>Basic knowledge in generating process documentation, and document system functionality, data integration, and workflow</li> <li>Excellent written and verbal communication skills in English</li> <li>Technical writing skills and knowledge of other languages (Chinese) is a plus</li> <li>Currently based in Thailand and speaks native Thai</li> </ul><h3><strong>Why You'll Love Working Here</strong></h3><ul> <li>Fully Remote</li> <li>Flexible Leave</li> <li>International Environment</li> <li>Competitive renumeration package</li> <li>Performance Bonus</li> <li>Stock Options after 6 months </li> <li>Company activities and events</li> <li>Learning and development plan</li> <li>Remote work allowance</li> </ul><p><strong>CoverGo Company </strong><a href=\"https://www.youtube.com/watch?v=YI0ezLxvFvA\" rel=\"nofollow noreferrer noopener\" class=\"external\"><strong>Video</strong></a></p><p>By submitting your application, you confirm that you have read, understood, and accepted the content of CoverGo’s <a href=\"https://apply.workable.com/covergo/gdpr_policy?lng=en\" target=\"_blank\" rel=\"nofollow noreferrer noopener\" class=\"external\">Privacy Notice</a> and you consent to the processing of your data as part of this application.</p><p><a href=\"https://www.youtube.com/watch?v=YI0ezLxvFvA\" rel=\"nofollow noreferrer noopener\" class=\"external\"></a></p><h3>Requirements: </h3><h3>Benefits: </h3>","tags":"[\"management\"]","pubDate":"2024-05-08 00:00:00.000","link":"https://apply.workable.com/covergo/j/7314E8F66B","savedDate":"2024-05-09 13:10:01.598","slug":"senior-business-analyst-insurance-fully-remote-covergo-8527"},{"id":1829948696,"title":"Engineering Manager","company":"Thedutchie","image":"https://remotive.com/job/1909630/logo","description":"<div class='\"content-intro\"'><p><strong>About Dutchie</strong></p>\n<p>Founded in 2017, Dutchie is a comprehensive technology platform powering dispensary operations, while providing consumers with safe and easy access to cannabis. Dutchie aims to further support the positive societal change the cannabis industry brings to the world through wellness benefits, social justice, and empowering local communities through tax revenue. Powering thousands of dispensaries across 40+ markets throughout the United States and Canada, Dutchie is the leading technology company in the cannabis space and was named in Fast Company’s 10 Most Innovative Companies in North America and listed two years in a row on LinkedIn’s Top 50 Startups.<u></u><u></u></p>\n<p>Dutchie has raised over $600M in funding to date, backed by D1 Capital Partners, Tiger Global, Dragoneer, DFJ Growth, Thrive Capital, Howard Schultz, Snoop Dogg’s Casa Verde Capital, Gron Ventures, members of the founding team at DoorDash, Kevin Durant’s Thirty Five Ventures, and other notable angel investors.</p></div><p><strong>About This Job</strong></p>\n<p>Dutchie, a frontrunner in the cannabis industry, is seeking an experienced and passionate Engineering Manager to lead our Inventory, Cultivation and Manufacturing Team. In this position, you will play a pivotal role in shaping the future of our software. You'll collaborate closely with our Product and Design teams to translate strategic vision into technical reality, building best-in-class point-of-sale (POS) and back-office solutions for our cannabis clients. As a leader, you'll be responsible for fostering a thriving engineering team environment. This includes establishing healthy development practices, effectively managing projects, and empowering team members to grow and develop their technical expertise.</p>\n<p>Do you thrive in a fast-paced, dynamic environment? Are you passionate about building innovative solutions? If so, we want to hear from you!</p>\n<p><strong>What You'll Do...</strong></p>\n<ul style=\"\">\n<li style=\"\">Lead a high-performing engineering team through effective hiring, coaching, mentoring, feedback, and career development.</li>\n<li style=\"\">Collaborate closely with stakeholders to ensure timely and sustainable delivery of technical solutions aligned with business requirements.</li>\n<li style=\"\">Communicate progress, risks, expectations, timelines, milestones, and other key project metrics to our organization including our leadership team</li>\n<li style=\"\">Advocate for and implement engineering best practices and guide technical strategy for short-term and long-term plans</li>\n<li style=\"\">Cultivate a healthy engineering culture that promotes teamwork and growth.<span style='\"font-weight:'> </span></li>\n</ul>\n<p><strong>What You Bring...</strong></p>\n<ul style=\"\">\n<li style=\"\">5+ years of development experience as an individual contributor and 2+ years in a management role</li>\n<li style=\"\">Experience leading complex engineering efforts, delivering results while maintaining a healthy team.</li>\n<li style=\"\">Proven track record in driving multi-stakeholder projects, achieving successful outcomes through effective collaboration</li>\n</ul>\n<p><strong>It's a bonus if you...</strong></p>\n<ul style=\"\">\n<li style=\"\">Retail Inventory systems experience (optional but a bonus!)</li>\n<li style=\"\">Cannabis Software/Industry Experience(optional but a bonus!)</li>\n</ul>\n<p><strong>You’ll Get…</strong></p>\n<p>We are targeting a starting salary of $165,000 based on the intended level for this role. There may be flexibility on individual compensation packages based candidate skill set, experience, qualifications and other position-related factors.</p>\n<p><span style='\"font-weight:'>In addition to cash compensation, our total rewards package includes:</span></p>\n<ul style=\"\">\n<li style=\"\"><span style='\"font-weight:'>Full medical benefits including dental and vision plans to ensure you always have the best care.</span></li>\n<li style=\"\"><span style='\"font-weight:'>Equity packages in the form of stock options to all employees.</span></li>\n<li style=\"\"><span style='\"font-weight:'>Technology (hardware, software, reading materials, etc..) allowance</span></li>\n<li style=\"\"><span style='\"font-weight:'>Flexible vacation and sick days</span></li>\n</ul>\n<p><span style='\"color:'>#LI-AH1</span></p><div class='\"content-conclusion\"'><p><span style='\"font-weight:'>At Dutchie, we’re committed to providing an environment of mutual respect where equal employment opportunities are available to all applicants and teammates without regard to race, color, religion, sex, sexual orientation, gender identity or expression, pregnancy, age, national origin, disability status, genetic information, protected veteran status, or any other characteristic protected by law. Dutchie believes that diversity and inclusion among our teammates is critical to our success, and we seek to recruit, develop and retain the most talented people from a diverse candidate pool.</span></p></div><img src=\"https://remotive.com/job/track/1909630/blank.gif?source=public_api\" alt=\"\"/>","tags":"[\"mentoring\",\"hardware\",\"retail\",\"engineering management\",\"diversity\"]","pubDate":"2024-05-07 21:21:08.000","link":"https://remotive.com/remote-jobs/software-dev/engineering-manager-1909630","savedDate":"2024-05-09 13:10:01.593","slug":"engineering-manager-thedutchie-4189"},{"id":7855483768,"title":"Channel Sales Specialist (Israel)","company":"Airalo","image":"https://lever-client-logos.s3.us-west-2.amazonaws.com/55028a36-609c-479c-9553-d4689ff2dd8c-1669620566663.png","description":"<div>Airalo is looking for a retail <b>Channel Sales Specialist</b> to join the <b>Airalo Partnerships</b> department.</div><div>Physical SIM cards are passe. The future of connectivity, especially for travelers, is through eSIMs. As the undisputed industry leader in the B2C segment, we are now looking to expand our presence in the retail and traditional telecom sales channels to bring the eSIM revolution to hundreds of thousands of telecom retailers globally.</div><div>As the <b>Channel Sales Specialist</b> for Israel, you will own Airalo’s retail distribution strategy and execution to ensure Airalo’s presence across branded and unorganized travel, telecom, and general retail stores.</div><h3>Responsibilities include but are not limited to:</h3><li>Work closely with the <b>Channel Sales Manager, (Europe &amp; CIS)</b> and other team members in the department</li><li>Market mapping of the travel agent and telecom retail universe in key cities across Israel and creating a distribution roadmap to achieve maximum penetration across the universe</li><li>Onboard and support new partners as they join the Airalo partner community</li><li>Build and maintain fruitful relationships with the store managers / owners to drive mutual growth</li><li>Drive visibility and brand awareness for Airalo at point of sale through merchandising / employee training</li><li>Design and manage a program to educate retailers and travel agents on eSIM adoption</li><li>Conduct competitive research and define the Airalo retail distribution roadmap to maintain Airalo’s status as the preferred provider across partners</li><li>Collaborate and work with different internal and external stakeholders to develop and execute projects/opportunities successfully</li><li>Own and deliver monthly, quarterly and annual OKRs for your channel with regular tracking and progress reports</li><li>As a core member of the Israeli squad, always explore ways and means to further consolidate Airalo’s dominance in Israel.</li>,<h3>Must-haves:</h3><li>2+ years of experience in retail channel sales or business development in the travel or telecom industry</li><li>Good understanding of the retail (preferably the travel and/or telecom retail) channel in Israel.</li><li>This is a largely relationship-driven channel. You must be able to forge and nurture relationships with stakeholders across the channel.</li><li>Ability to narrate a good story - Airalo’s unique story and the problem we solve for our users make it a compelling pitch for partners.</li><li>Ability to employ sales techniques, including effective questioning, objection handling, consultative selling, and solution selling.</li><li>Ability to multi-task.</li><li>Experience with sales and partnership tools.</li><li>Perfect verbal and written communication skills in English and Hebrew.</li>,<h3>Good to have:</h3><li>Familiarity with the travel or telecom industry</li><li>Prior work experience in the travel or telecom industry</li><li>Knowledge of eSIM and GSMA-related technologies and services</li><li>Certificates and courses in sales and partnerships</li>","tags":"[\"B2C\"]","pubDate":"2024-05-07 16:29:14.364","link":"https://jobs.lever.co/airalo/6d675ee9-7da6-444e-b3ed-89615a488522","savedDate":"2024-05-09 13:10:01.601","slug":"channel-sales-specialist-israel-airalo-5528"},{"id":9194554648,"title":"Channel Sales Specialist (Spain)","company":"Airalo","image":"https://lever-client-logos.s3.us-west-2.amazonaws.com/55028a36-609c-479c-9553-d4689ff2dd8c-1669620566663.png","description":"<div>Airalo is looking for a retail <b>Channel Sales Specialist</b> to join the <b>Airalo Partnerships</b> department.</div><div>Physical SIM cards are passe. The future of connectivity, especially for travelers, is through eSIMs. As the undisputed industry leader in the B2C segment, we are now looking to expand our presence in the retail and traditional telecom sales channels to bring the eSIM revolution to hundreds of thousands of telecom retailers globally.</div><div>As the <b>Channel Sales Specialist</b> for Spain, you will own Airalo’s retail distribution strategy and execution to ensure Airalo’s presence across branded and unorganized travel, telecom, and general retail stores.</div><h3>Responsibilities include but are not limited to:</h3><li>Work closely with the <b>Channel Sales Manager, (Europe &amp; CIS)</b> and other team members in the department</li><li>Market mapping of the travel agent and telecom retail universe in key cities across Spain and creating a distribution roadmap to achieve maximum penetration across the universe</li><li>Onboard and support new partners as they join the Airalo partner community</li><li>Build and maintain fruitful relationships with the store managers / owners to drive mutual growth</li><li>Drive visibility and brand awareness for Airalo at point of sale through merchandising / employee training</li><li>Design and manage a program to educate retailers and travel agents on eSIM adoption</li><li>Conduct competitive research and define the Airalo retail distribution roadmap to maintain Airalo’s status as the preferred provider across partners</li><li>Collaborate and work with different internal and external stakeholders to develop and execute projects/opportunities successfully</li><li>Own and deliver monthly, quarterly and annual OKRs for your channel with regular tracking and progress reports</li><li>As a core member of the Spanish squad, always explore ways and means to further consolidate Airalo’s dominance in Spain.</li>,<h3>Must-haves:</h3><li>2+ years of experience in retail channel sales or business development in the travel or telecom industry</li><li>Good understanding of the retail (preferably the travel and/or telecom retail) channel in Spain.</li><li>This is a largely relationship-driven channel. You must be able to forge and nurture relationships with stakeholders across the channel.</li><li>Ability to narrate a good story - Airalo’s unique story and the problem we solve for our users make it a compelling pitch for partners.</li><li>Ability to employ sales techniques, including effective questioning, objection handling, consultative selling, and solution selling.</li><li>Ability to multi-task.</li><li>Experience with sales and partnership tools.</li><li>Perfect verbal and written communication skills in English and in Spanish.</li>,<h3>Good to have:</h3><li>Familiarity with the travel or telecom industry</li><li>Prior work experience in the travel or telecom industry</li><li>Knowledge of eSIM and GSMA-related technologies and services</li><li>Certificates and courses in sales and partnerships</li>","tags":"[\"B2C\"]","pubDate":"2024-05-07 16:25:41.963","link":"https://jobs.lever.co/airalo/db403a28-d278-4d2c-b0dc-7ac2e9bed739","savedDate":"2024-05-09 13:10:01.602","slug":"channel-sales-specialist-spain-airalo-396"},{"id":8831734082,"title":"Channel Sales Specialist (Turkey)","company":"Airalo","image":"https://lever-client-logos.s3.us-west-2.amazonaws.com/55028a36-609c-479c-9553-d4689ff2dd8c-1669620566663.png","description":"<div>Airalo is looking for a retail <b>Channel Sales Specialist</b> to join the <b>Airalo Partnerships</b> department.</div><div>Physical SIM cards are passe. The future of connectivity, especially for travelers, is through eSIMs. As the undisputed industry leader in the B2C segment, we are now looking to expand our presence in the retail and traditional telecom sales channels to bring the eSIM revolution to hundreds of thousands of telecom retailers globally.</div><div>As the <b>Channel Sales Specialist</b> for Turkey, you will own Airalo’s retail distribution strategy and execution to ensure Airalo’s presence across branded and unorganized travel, telecom, and general retail stores.</div><h3>Responsibilities include but are not limited to:</h3><li>Work closely with the <b>Channel Sales Manager, (Europe &amp; CIS)</b> and other team members in the department</li><li>Market mapping of the travel agent and telecom retail universe in key cities across Turkey and creating a distribution roadmap to achieve maximum penetration across the universe</li><li>Onboard and support new partners as they join the Airalo partner community</li><li>Build and maintain fruitful relationships with the store managers / owners to drive mutual growth</li><li>Drive visibility and brand awareness for Airalo at point of sale through merchandising / employee training</li><li>Design and manage a program to educate retailers and travel agents on eSIM adoption</li><li>Conduct competitive research and define the Airalo retail distribution roadmap to maintain Airalo’s status as the preferred provider across partners</li><li>Collaborate and work with different internal and external stakeholders to develop and execute projects/opportunities successfully</li><li>Own and deliver monthly, quarterly and annual OKRs for your channel with regular tracking and progress reports</li><li>As a core member of the Turkey squad, always explore ways and means to further consolidate Airalo’s dominance in Turkey.</li>,<h3>Must-haves:</h3><li>2+ years of experience in retail channel sales or business development in the travel or telecom industry</li><li>Good understanding of the retail (preferably the travel and/or telecom retail) channel in Turkey.</li><li>This is a largely relationship-driven channel. You must be able to forge and nurture relationships with stakeholders across the channel.</li><li>Ability to narrate a good story - Airalo’s unique story and the problem we solve for our users make it a compelling pitch for partners.</li><li>Ability to employ sales techniques, including effective questioning, objection handling, consultative selling, and solution selling.</li><li>Ability to multi-task.</li><li>Experience with sales and partnership tools.</li><li>Perfect verbal and written communication skills in English and in Turkish.</li>,<h3>Good to have:</h3><li>Familiarity with the travel or telecom industry</li><li>Prior work experience in the travel or telecom industry</li><li>Knowledge of eSIM and GSMA-related technologies and services</li><li>Certificates and courses in sales and partnerships</li>","tags":"[\"B2C\"]","pubDate":"2024-05-07 16:21:43.528","link":"https://jobs.lever.co/airalo/49ec2bd1-fdd4-40a4-9b99-b3dfb8190e7c","savedDate":"2024-05-09 13:10:01.602","slug":"channel-sales-specialist-turkey-airalo-5068"},{"id":3046842692,"title":"Director of Engineering, Product Foundations","company":"VRChat","image":"https://pbs.twimg.com/profile_images/1719900921793003520/qPc3pV09_400x400.jpg","description":"<div><span style=\"font-size: 24px\">Join the VRChat Team!</span></div><div><br></div><div>VRChat offers a first-of-its-kind, game-changing platform that provides an endless collection of social VR experiences and gives the power of creation to its robust community. With over 250,000 worlds and growing, VRChat’s vision is to allow users to bring their imaginations to life and help shape the metaverse anywhere in the world on any device. VRChat has raised $100M to date with the support of investors Makers Fund, Anthos Capital and HTC. We have a great team which includes people from: Netflix, Twitter, Meta, Microsoft, Roblox, Google, Amazon, Unity, Spotify, Discord, Uber, eBay, Robinhood, Twitch, Zynga and TikTok.</div><div><br></div><div><span style=\"font-size: 11pt\">Come and join the mission!</span></div><div><br></div><div><span style=\"font-size: 24px\">Job Overview</span></div><div><br></div><div>The Director of Engineering for the Product Foundations team is a critical leadership role at VRChat. This person is accountable for a horizontal team building out the technical foundations for the entirety of the VRChat experience. This includes evolving our DevOps and release engineering functions, ensuring security &amp; privacy, while also leading the evolution of core technology such as authentication, real-time networking, and world and avatar loading.</div><div><br></div><div>This management position reports into the VP of Engineering at VRChat and will work closely with a dedicated cross functional team, heads of various functions, with periodical interaction with the exec team.</div><div><br></div><h3>Duties and Responsibilities</h3><li>Take ownership of the core VRChat platform, partnering closely with product, design and engineering leaders across the company to ensure we are supporting their ongoing needs.</li><li>Directly manage, support and inspire a team of approximately 15 engineers across multiple disciplines including release management, security, DevOps, API and client.</li><li>Foster a positive and high functioning team with solid technical practices that delivers timely and quality software.</li><li>Create the short and long term strategy for this space, and align it with higher level vision and strategy across the company.</li><li>Run a smooth and collaborative planning process to generate plans that reflect strategic goals, user insights and past learnings.</li><li>Make critical tradeoffs to ensure the long-term health and development of our platform.</li><li>Represent progress at periodic reviews and seek leadership support in a timely manner to unblock execution.</li><li>Partner with production to manage execution and work collaboratively to resolve issues to deliver against goals and objectives.&nbsp;</li><li>Stay current on industry trends and best practices in the technology behind gaming, UGC and social platforms to inform strategic decisions.</li><li>Develop and maintain strong relationships with key stakeholders, including internal teams, creators, partners, and the broader VRChat community.</li><li>Support the VP Engineering in critical strategy, organization and execution areas.</li>,<h3>Experience, Skills, and Qualifications</h3><li>5+ years of engineering management in a high-growth consumer or b2b tech company and solid technical background.</li><li>Experience in technical product management with a healthy obsession to discover and fulfill the needs of internal partners and our users.</li><li>Excellent verbal and written communication skills which are particularly important in our fully remote environment.</li><li>Technical experience with release engineering, security, DevOps, API and 3D gaming development a plus.</li><li>Past expertise in virtual economies, e-commerce, gaming, UGC and/or social platforms is a plus, though not required.</li><li>University degree or equivalent work experience with technical background</li><li>Experience defining metrics and making product and strategic decisions based on measurable impact.</li><li>Intellectually curious about new technologies and societal changes, and understands how to apply innovations and trends to product opportunities.</li><li>Comfortable dealing with ambiguity and operating in a fast-paced and evolving environment.</li>,<h3>Benefits</h3><li>Work from anywhere! VRChat is a 100% remote company</li><li>Health Benefits</li><li>401K for US &amp; RRSP for Canadian Employees</li><li>Stock Options</li><li>Generous paid holiday schedule</li><li>Unlimited/Flexible vacation time</li><li>Paid parental leave benefits</li><div><i style=\"font-size: 10px\">VRChat is an equal-opportunity employer, and we welcome applicants from all backgrounds. VRChat fosters a diverse, creative, and collaborative environment where anyone can contribute to any of the ongoing projects or direction of the roadmap at any time.  If you’re a passionate team player who wants to have an impact on a dynamic team, we’d love to hear from you!</i></div>","tags":"[\"management\",\"engineering\",\"B2B\"]","pubDate":"2024-05-07 14:51:50.671","link":"https://jobs.lever.co/vrchat/ef3b1412-1328-45f3-8385-4bc1372ed9f6","savedDate":"2024-05-09 13:10:01.600","slug":"director-of-engineering-product-foundations-vrchat-2258"},{"id":8433560810,"title":"Network Operations Manager","company":"Airalo","image":"https://lever-client-logos.s3.us-west-2.amazonaws.com/55028a36-609c-479c-9553-d4689ff2dd8c-1669620566663.png","description":"<div><span style=\"font-size: 16px\">The Network Operations Manager is pivotal in ensuring the smooth technical operations of our Telco Network Integration Platform. This position serves as the main Point Of Contact for technical matters, leading communication efforts with both external providers and internal stakeholders. With a focus on incident management and continuous improvement, the successful candidate will play a key role in optimizing our network operations and minimizing risks. If you enjoy working in a fast-paced environment, possess strong interpersonal skills, and have a passion for technology and telecommunications, we encourage you to explore further.</span></div><h3>Responsibilities include but are not limited to:</h3><li>Acts as a main Point Of Contact for the technical operations of the Telco Network Integration Platform</li><li>Lead the communication with external providers and internal stakeholders</li><li>Cooperates with Engineering Director, Networks, to navigate through external and internal escalations</li><li>Executes on and evolve the Network team’s incident management communications processes and framework</li><li>Ensures proper and timely communications and escalations for high-priority incidents</li><li>Tracking open incidents and identifying any change requests that require increased focus to meet committed service levels</li><li>Develops, maintains, communicates, and escalates key focus points and next steps with appointed vendor and telecom partner contacts</li><li>Manages projects for improvements in the operations, from initiation through delivery, including the generating of schedules, monitoring progress, managing change control, managing risks and issues</li><li>Triages, investigates and documents the issues. Drive Root Cause Analyses</li><li>Implements and manages a continuous improvement plan for the Network’s team with the final goal of optimizing the execution of monitoring and operations and minimizing risks</li><li>Coordinate and handle day to day operations related to eSIM management, such as eSIM manufacturing process, eSIM stock management, SQL-based data investigation</li><li>Monitors provider’s availability graphs for anomalies and escalates them</li><li>Ensures each provider reacts according to our SLA with them</li>,<h3>Must-haves:</h3><li>At least 3 years of experience in service coordination or in incident management</li><li>Knowledge of ITIL or other IT service delivery framework</li><li>Must possess strong interpersonal skills regarding interface with employees and external partners</li><li>A heightened ability to multitask and problem-solve within a fast-paced environment</li><li>Excellent English proficiency </li><li>Experience in using ticketing systems, knowledge base tools, root cause analysis techniques</li><li>Experience working with internet and technology companies</li>,<h3>Good to Have:</h3><li>Experience working with Telcos, knowledge of MNO, MVNO, MVNE operation models</li><li>Verbal/written fluency in additional local/regional languages</li><div><span style=\"font-size: 10pt\">If you are interested in this position, </span><b style=\"font-size: 10pt\">please apply via the link.</b></div>","tags":"[\"management\",\"engineering\"]","pubDate":"2024-05-07 13:14:10.378","link":"https://jobs.lever.co/airalo/7eb140e1-b79a-4ef1-8a75-779abae8334d","savedDate":"2024-05-09 13:10:01.603","slug":"network-operations-manager-airalo-828"},{"id":8479552385,"title":"Senior Product Manager","company":"Nauto","image":"https://remotive.com/job/1910821/logo","description":"<p>At Nauto you can make an impact at a high-impact company. Our technology helps prevent collisions and save lives with predictive-AI that detects driver state and vehicle surroundings in real-time. More than 90% of car crashes can be attributed to human error. Nauto technology is designed to predict risk and alerts the driver with advance warning to help prevent collisions, improve driver safety, and save lives.</p>\n<p>Our customers and prospects include many of the largest commercial fleets in the world along with vehicle manufacturers (OEMs), insurance providers, and autonomous vehicle companies. The company is backed by Greylock Partners, BMW iVentures, General Motors Ventures, Toyota AI Ventures, and SoftBank, and is well-positioned for continued growth.</p>\n<p>Nauto is a proud member of the Forbes AI 50 list, which recognizes standouts in privately-held North American companies making the most interesting and effective use of artificial intelligence technology.</p>\n<p>As a <strong>Product Manager</strong> at Nauto, you will report to the Senior Director, Product Management, AI and partner closely with other product leaders, designers, engineers, and stakeholders to make our vision of making safe driving simple a reality. In this role, you will own the success of core initiatives that are critical to Nauto’s continued growth. </p>\n<p>It is expected that you will quickly develop expert knowledge of our customers, our offerings, and the market. To accomplish this, you will have visibility across the organization and will be a key voice in one of the most exciting companies in the AI space. We are looking for candidates who are passionate about building and delivering full stack solutions for some of the largest commercial vehicle fleets to help keep their drivers safe and reduce operational costs.  </p>\n<p><strong>Responsibilities:</strong></p>\n<ul style=\"\">\n<li style=\"\">Lead critical elements of our device hardware and software portfolio to enable the next wave of automotive AI innovations </li>\n<li style=\"\">Define and continuously improve our embedded AI software stack including edge applications and AI SDKs</li>\n<li style=\"\">Engage directly with customers to understand their needs, validate product ideas, and support sales efforts. </li>\n<li style=\"\">Launch new internal and customer-facing features in close collaboration with Engineering and Marketing teams in a fast paced, agile environment</li>\n<li style=\"\">Ensure we are building globally usable, scalable products </li>\n<li style=\"\">Focus on KPIs and data-driven decision making to ensure we remain at the industry's forefront</li>\n<li style=\"\">Communicate the benefits and champion the product throughout the organization</li>\n<li style=\"\">Work with partners at sensor, SoC, and other systems component companies to ensure optimal product functionality </li>\n</ul>\n<p><strong>Requirements:</strong></p>\n<ul style=\"\">\n<li style=\"\">4+ years of proven experience in Product Management, Product Design, or Product Development</li>\n<li style=\"\">BS/MS in Computer Science, Engineering, or a related field (or equivalent experience)</li>\n<li style=\"\">Expertise with Automotive, Smart Home, Wearable, Telematics or other IoT products</li>\n<li style=\"\">Strong focus on user-centered design and measurable outcomes</li>\n<li style=\"\">Foundational knowledge of Computer Vision and Edge AI systems</li>\n<li style=\"\">Experience working with contract manufacturers/ODMs and design houses</li>\n<li style=\"\">Experience with SoCs, neural processing units (NPUs), image sensors and interfaces (MIPI, PCI-E)</li>\n<li style=\"\">Excellent verbal and written communication skills</li>\n<li style=\"\">Comfort wearing multiple hats and a bias-to-action to deliver measurable results</li>\n<li style=\"\">Excel in supporting prospective or existing customers in partnership with Sales</li>\n<li style=\"\">Proven experience in delivering commercially successful software and/or IoT products</li>\n<li style=\"\">Strong technical understanding, ability to establish credibility with engineers and customers alike</li>\n<li style=\"\">Willingness to roll up your sleeves and dig into data.</li>\n<li style=\"\">Ability to communicate effectively with technical and non-technical cross-functional teams.</li>\n</ul>\n<p><strong>Nice to have</strong></p>\n<ul style=\"\">\n<li style=\"\">Start-up Experience</li>\n<li style=\"\">Familiarity with automotive IoT, fleet management systems &amp; practices</li>\n<li style=\"\">Proficiency with SQL and Python and familiarity with analytics tools such as Databricks </li>\n<li style=\"\">MBA is also nice to have</li>\n</ul>\n<p><strong>Perks: </strong></p>\n<ul style=\"\">\n<li style=\"\">Experienced leadership with a great track record of growing startups</li>\n<li style=\"\">Exceptional health benefits coverage</li>\n<li style=\"\">Learning and development opportunities from a highly diverse and talented peer group including experts in a wide range of fields such as Artificial Intelligence &amp; Computer Vision, Systems &amp; Device Engineering, and Support &amp; Operations</li>\n</ul>\n<p>We are committed to creating a diverse and inclusive environment that fosters learning from each other. We celebrate people of diverse backgrounds, experiences, abilities, and perspectives. We are an equal opportunity employer and are committed to providing a work environment free of harassment and discrimination.  </p>\n<p>To all recruitment agencies: Nauto does not accept agency resumes. Please do not forward resumes to our jobs alias, Nauto employees or any other company location. Nauto is not responsible for any fees related to unsolicited resumes.</p><img src=\"https://remotive.com/job/track/1910821/blank.gif?source=public_api\" alt=\"\"/>","tags":"[\"product management\",\"product development\",\"IoT\"]","pubDate":"2024-05-07 05:20:19.000","link":"https://remotive.com/remote-jobs/product/senior-product-manager-1910821","savedDate":"2024-05-09 13:10:01.593","slug":"senior-product-manager-nauto-2380"},{"id":5700356209,"title":"Channel Sales Specialist (South Korea)","company":"Airalo","image":"https://lever-client-logos.s3.us-west-2.amazonaws.com/55028a36-609c-479c-9553-d4689ff2dd8c-1669620566663.png","description":"<div><b>About Airalo</b></div><div>Alo! Airalo is the world’s first eSIM store that helps people connect in over 200+ countries and regions across the globe. We are building the next digital service that revolutionizes the telecom industry. We are a travel-tech company and an equal-opportunity environment that values and executes diversity, inclusion, and equity. Our team is spread across 50+ countries and six continents. What glues us together is our commitment to changing the way you connect<span style=\"font-size: 13.3333px\">. </span></div><div><br></div><div><b>About you</b></div><div>We hope that you care deeply about the quality of your work, the intrinsic worth of tasks, and the success of your team. You are self-disciplined and do not require micromanagement in terms of your skillset and work ethic. You do your best to flourish as an individual every day while working hard to foster a collaborative team environment. You believe in the importance of being — and staying — authentic, honest, positive, and kind. You are a good interlocutor with clear and concise communication. You are able to manage multiple projects, have an analytical mind, pay keen attention to detail, and love to get your hands dirty. You are cognizant, tolerant, and welcoming of vulnerabilities and cultural differences.</div><div><br></div><div><b>About the Role</b></div><div><b>Position</b>: Full-time / Employee</div><div><b>Location:</b>&nbsp;Remote-first </div><div><b>Benefits:</b>&nbsp;Health Insurance, work-from-anywhere stipend, annual wellness &amp; learning credits, annual all-expenses-paid company retreat in a gorgeous destination &amp; other benefits</div><div><br></div><div>Airalo is looking for a retail <b>Channel Sales Specialist</b> to join the <b>Airalo Partnerships</b> department.</div><div>Physical SIM cards are passe. The future of connectivity, especially for travelers, is through eSIMs. As the undisputed industry leader in the B2C segment, we are now looking to expand our presence in the retail and traditional telecom sales channels to bring the eSIM revolution to hundreds of thousands of telecom retailers globally.</div><div>As the <b>Channel Sales Specialist</b> for South Korea, you will own Airalo’s retail distribution strategy and execution to ensure Airalo’s presence across branded and unorganized travel, telecom and general retail stores.</div><h3>Responsibilities include but are not limited to:</h3><li>Work closely with the <b>Channel Sales Manager, APAC</b> and other team members in the department</li><li>Market mapping of the travel agent and telecom retail universe in key cities across South Korea and creating a distribution roadmap to achieve maximum penetration across the universe</li><li>Onboard and support new partners as they join the Airalo partner community</li><li>Build and maintain fruitful relationships with the store managers / owners to drive mutual growth</li><li>Drive visibility and brand awareness for Airalo at point of sale through merchandising / employee training</li><li>Design and manage a program to educate retailers and travel agents on eSIM adoption</li><li>Conduct competitive research and define the Airalo retail distribution roadmap to maintain Airalo’s status as the preferred provider across partners</li><li>Collaborate and work with different internal and external stakeholders to develop and execute projects/opportunities successfully</li><li>Own and deliver monthly, quarterly and annual OKRs for your channel with regular tracking and progress reports</li><li>As a core member of the South Korea squad, always explore ways and means to further consolidate Airalo’s dominance in South Korea</li>,<h3>Must-haves:</h3><li>2+ years of experience in retail channel sales or business development in the travel or telecom industry</li><li>Good understanding of the retail (preferably the travel and / or telecom retail) channel in South Korea</li><li>This is a largely relationship driven channel. You must be able to forge and nurture relationships with stakeholders across the channel</li><li>Ability to narrate a good story - Airalo’s unique story and the problem we solve for our users makes it a compelling pitch for partners</li><li>Ability to employ sales techniques, including effective questioning, objection handling, consultative selling, and solution selling</li><li>Ability to multi-task</li><li>Experience with sales and partnerships tools</li><li>Perfect verbal and written communication skills in English and Korean</li>,<h3>Good to have:</h3><li>Familiarity with the travel or telecom industry</li><li>Prior work experience in the travel or telecom industry</li><li>Knowledge of eSIM and GSMA-related technologies and services</li><li>Certificates and courses in sales and partnerships</li><div>If you are interested in this position, <b>please apply via the link.</b></div><div><br></div><div><i>We sincerely thank all applicants in advance for submitting their interest in this opportunity with Airalo. </i></div>","tags":"[\"management\",\"B2C\"]","pubDate":"2024-05-07 01:14:41.467","link":"https://jobs.lever.co/airalo/c9db24e2-8d80-4721-a7ab-5d95b12cd9ae","savedDate":"2024-05-09 13:10:01.601","slug":"channel-sales-specialist-south-korea-airalo-9121"},{"id":1812073169,"title":"Channel Sales Specialist (Australia & New Zealand)","company":"Airalo","image":"https://lever-client-logos.s3.us-west-2.amazonaws.com/55028a36-609c-479c-9553-d4689ff2dd8c-1669620566663.png","description":"<div><b>About Airalo</b></div><div>Alo! Airalo is the world’s first eSIM store that helps people connect in over 200+ countries and regions across the globe. We are building the next digital service that revolutionizes the telecom industry. We are a travel-tech company and an equal-opportunity environment that values and executes diversity, inclusion, and equity. Our team is spread across 50+ countries and six continents. What glues us together is our commitment to changing the way you connect<span style=\"font-size: 13.3333px\">. </span></div><div><br></div><div><b>About you</b></div><div>We hope that you care deeply about the quality of your work, the intrinsic worth of tasks, and the success of your team. You are self-disciplined and do not require micromanagement in terms of your skillset and work ethic. You do your best to flourish as an individual every day while working hard to foster a collaborative team environment. You believe in the importance of being — and staying — authentic, honest, positive, and kind. You are a good interlocutor with clear and concise communication. You are able to manage multiple projects, have an analytical mind, pay keen attention to detail, and love to get your hands dirty. You are cognizant, tolerant, and welcoming of vulnerabilities and cultural differences.</div><div><br></div><div><b>About the Role</b></div><div><b>Position</b>: Full-time / Employee</div><div><b>Location:</b>&nbsp;Remote-first </div><div><b>Benefits:</b>&nbsp;Health Insurance, work-from-anywhere stipend, annual wellness &amp; learning credits, annual all-expenses-paid company retreat in a gorgeous destination &amp; other benefits</div><div><br></div><div>Airalo is looking for a retail <b>Channel Sales Specialist</b> to join the <b>Airalo Partnerships</b> department.</div><div>Physical SIM cards are passe. The future of connectivity, especially for travelers, is through eSIMs. As the undisputed industry leader in the B2C segment, we are now looking to expand our presence in the retail and traditional telecom sales channels to bring the eSIM revolution to hundreds of thousands of telecom retailers globally.</div><div>As the <b>Channel Sales Specialist</b> for Australia &amp; New Zealand (ANZ), you will own Airalo’s retail distribution strategy and execution to ensure Airalo’s presence across branded and unorganized travel, telecom and general retail stores.</div><h3>Responsibilities include but are not limited to:</h3><li>Work closely with the <b>Channel Sales Manager, APAC</b> and other team members in the department</li><li>Market mapping of the travel agent and telecom retail universe in key cities across ANZ and creating a distribution roadmap to achieve maximum penetration across the universe</li><li>Onboard and support new partners as they join the Airalo partner community</li><li>Build and maintain fruitful relationships with the store managers / owners to drive mutual growth</li><li>Drive visibility and brand awareness for Airalo at point of sale through merchandising / employee training</li><li>Design and manage a program to educate retailers and travel agents on eSIM adoption</li><li>Conduct competitive research and define the Airalo retail distribution roadmap to maintain Airalo’s status as the preferred provider across partners</li><li>Collaborate and work with different internal and external stakeholders to develop and execute projects/opportunities successfully</li><li>Own and deliver monthly, quarterly and annual OKRs for your channel with regular tracking and progress reports</li><li>As a core member of the ANZ squad, always explore ways and means to further consolidate Airalo’s dominance in ANZ</li>,<h3>Must-haves:</h3><li>2+ years of experience in retail channel sales or business development in the travel or telecom industry</li><li>Good understanding of the retail (preferably the travel and / or telecom retail) channel in ANZ</li><li>This is a largely relationship driven channel. You must be able to forge and nurture relationships with stakeholders across the channel</li><li>Ability to narrate a good story - Airalo’s unique story and the problem we solve for our users makes it a compelling pitch for partners</li><li>Ability to employ sales techniques, including effective questioning, objection handling, consultative selling, and solution selling</li><li>Ability to multi-task</li><li>Experience with sales and partnerships tools</li><li>Perfect verbal and written communication skills in English</li>,<h3>Good to have:</h3><li>Familiarity with the travel or telecom industry</li><li>Prior work experience in the travel or telecom industry</li><li>Knowledge of eSIM and GSMA-related technologies and services</li><li>Certificates and courses in sales and partnerships</li><div>If you are interested in this position, <b>please apply via the link.</b></div><div><br></div><div><i>We sincerely thank all applicants in advance for submitting their interest in this opportunity with Airalo. </i></div>","tags":"[\"management\",\"B2C\"]","pubDate":"2024-05-07 01:05:51.306","link":"https://jobs.lever.co/airalo/ce089e59-ca13-4dd6-97c0-c7a166d606b7","savedDate":"2024-05-09 13:10:01.601","slug":"channel-sales-specialist-australia-new-zealand-airalo-1702"},{"id":7760739090,"title":"Channel Sales Specialist (Japan)","company":"Airalo","image":"https://lever-client-logos.s3.us-west-2.amazonaws.com/55028a36-609c-479c-9553-d4689ff2dd8c-1669620566663.png","description":"<div><b>About Airalo</b></div><div>Alo! Airalo is the world’s first eSIM store that helps people connect in over 200+ countries and regions across the globe. We are building the next digital service that revolutionizes the telecom industry. We are a travel-tech company and an equal-opportunity environment that values and executes diversity, inclusion, and equity. Our team is spread across 50+ countries and six continents. What glues us together is our commitment to changing the way you connect<span style=\"font-size: 13.3333px\">. </span></div><div><br></div><div><b>About you</b></div><div>We hope that you care deeply about the quality of your work, the intrinsic worth of tasks, and the success of your team. You are self-disciplined and do not require micromanagement in terms of your skillset and work ethic. You do your best to flourish as an individual every day while working hard to foster a collaborative team environment. You believe in the importance of being — and staying — authentic, honest, positive, and kind. You are a good interlocutor with clear and concise communication. You are able to manage multiple projects, have an analytical mind, pay keen attention to detail, and love to get your hands dirty. You are cognizant, tolerant, and welcoming of vulnerabilities and cultural differences.</div><div><br></div><div><b>About the Role</b></div><div><b>Position</b>: Full-time / Employee</div><div><b>Location:</b>&nbsp;Remote-first </div><div><b>Benefits:</b>&nbsp;Health Insurance, work-from-anywhere stipend, annual wellness &amp; learning credits, annual all-expenses-paid company retreat in a gorgeous destination &amp; other benefits</div><div><br></div><div>Airalo is looking for a retail <b>Channel Sales Specialist</b> to join the <b>Airalo Partnerships</b> department.</div><div>Physical SIM cards are passe. The future of connectivity, especially for travelers, is through eSIMs. As the undisputed industry leader in the B2C segment, we are now looking to expand our presence in the retail and traditional telecom sales channels to bring the eSIM revolution to hundreds of thousands of telecom retailers globally.</div><div>As the <b>Channel Sales Specialist</b> for Japan, you will own Airalo’s retail distribution strategy and execution to ensure Airalo’s presence across branded and unorganized travel, telecom and general retail stores.</div><h3>Responsibilities include but are not limited to:</h3><li>Work closely with the <b>Channel Sales Manager, APAC</b> and other team members in the department</li><li>Market mapping of the travel agent and telecom retail universe in key cities across Japan and creating a distribution roadmap to achieve maximum penetration across the universe</li><li>Onboard and support new partners as they join the Airalo partner community</li><li>Build and maintain fruitful relationships with the store managers / owners to drive mutual growth</li><li>Drive visibility and brand awareness for Airalo at point of sale through merchandising / employee training</li><li>Design and manage a program to educate retailers and travel agents on eSIM adoption</li><li>Conduct competitive research and define the Airalo retail distribution roadmap to maintain Airalo’s status as the preferred provider across partners</li><li>Collaborate and work with different internal and external stakeholders to develop and execute projects/opportunities successfully</li><li>Own and deliver monthly, quarterly and annual OKRs for your channel with regular tracking and progress reports</li><li>As a core member of the Japan squad, always explore ways and means to further consolidate Airalo’s dominance in Japan</li>,<h3>Must-haves:</h3><li>2+ years of experience in retail channel sales or business development in the travel or telecom industry</li><li>Good understanding of the retail (preferably the travel and / or telecom retail) channel in Japan</li><li>This is a largely relationship driven channel. You must be able to forge and nurture relationships with stakeholders across the channel</li><li>Ability to narrate a good story - Airalo’s unique story and the problem we solve for our users makes it a compelling pitch for partners</li><li>Ability to employ sales techniques, including effective questioning, objection handling, consultative selling, and solution selling</li><li>Ability to multi-task</li><li>Experience with sales and partnerships tools</li><li>Perfect verbal and written communication skills in English and Japanese</li>,<h3>Good to have:</h3><li>Familiarity with the travel or telecom industry</li><li>Prior work experience in the travel or telecom industry</li><li>Knowledge of eSIM and GSMA-related technologies and services</li><li>Certificates and courses in sales and partnerships</li><div>If you are interested in this position, <b>please apply via the link.</b></div><div><br></div><div><i>We sincerely thank all applicants in advance for submitting their interest in this opportunity with Airalo. </i></div>","tags":"[\"management\",\"B2C\"]","pubDate":"2024-05-07 00:55:56.977","link":"https://jobs.lever.co/airalo/e522c828-40aa-4830-89a0-99df183bbe1e","savedDate":"2024-05-09 13:10:01.601","slug":"channel-sales-specialist-japan-airalo-5444"},{"id":1699199090,"title":"Security Engineer","company":"Uptime.com","image":"https://remotive.com/job/1910643/logo","description":"<p><a class=\"external\" href=\"http://uptime.com/\" rel=\"nofollow\" target=\"_blank\"> Uptime.com</a> is a dynamic tech company in the website monitoring space. Our mission is to ensure seamless digital experiences for our clients' users. We are currently seeking a dedicated Security Engineer to join our team and play a vital role in maintaining the security and integrity of our systems. <strong>This is a fully remote role. </strong></p>\n<p> </p>\n<p><strong>Role Overview</strong></p>\n<p>As a Security Engineer at <a class=\"external\" href=\"http://uptime.com/\" rel=\"nofollow\" target=\"_blank\">Uptime.com</a>, you will be responsible for implementing and maintaining robust security measures to protect our infrastructure and client data. You will collaborate with cross-functional teams to identify vulnerabilities, develop solutions, and ensure compliance with industry best practices. Your role will be critical in managing our applications using <strong>Python and Django, and familiarity with Go </strong>will be considered an advantage.</p>\n<p> </p>\n<p><strong>What you will do: </strong></p>\n<ul style=\"\">\n<li style=\"\">Implement and maintain security controls to protect our systems from potential threats, focusing on applications running on Kubernetes, including those hosted on Amazon Elastic Kubernetes Service (EKS).</li>\n<li style=\"\">Conduct regular vulnerability assessments and penetration testing to identify and address security vulnerabilities, particularly in containerized environments and Django-based applications.</li>\n<li style=\"\">Monitor and investigate security events and incidents, and take appropriate actions to mitigate risks.</li>\n<li style=\"\">Collaborate with development teams to incorporate security best practices into the software development lifecycle, with a focus on Python and Django applications.</li>\n<li style=\"\">Stay up-to-date with the latest security threats, trends, and technologies, and provide recommendations to enhance our security posture.</li>\n<li style=\"\">Develop and deliver security awareness training to educate employees on best practices.</li>\n<li style=\"\">Participate in incident response activities, including performing post-incident analysis and implementing remediation measures.</li>\n</ul>\n<p><strong>Requirements</strong></p>\n<p> </p>\n<ul style=\"\">\n<ul style=\"\">\n<li style=\"\">Bachelor's degree in Computer Science, Information Security, or a related field.</li>\n<li style=\"\">Proven experience (2+ years) in a security engineering or related role.</li>\n<li style=\"\"><strong>Strong proficiency in Python and Django for security automation and backend services.</strong></li>\n<li style=\"\">Nice to have: Experience with Go programming.</li>\n<li style=\"\">Deep understanding of network security, encryption technologies, and security best practices.</li>\n<li style=\"\">Strong experience with <strong>Kubernetes and Amazon Elastic Kubernetes Service (EKS)</strong> in managing and securing containerized applications.</li>\n<li style=\"\">Experience with vulnerability assessment tools and techniques.</li>\n<li style=\"\">Ability to conduct penetration testing and identify vulnerabilities.</li>\n<li style=\"\">Knowledge of security frameworks and standards (e.g., NIST, ISO).</li>\n<li style=\"\">Strong problem-solving and analytical skills.</li>\n<li style=\"\">Excellent communication and collaboration skills.</li>\n<li style=\"\">Security certifications such as CISSP, CISM, or CEH are a plus.</li>\n<li style=\"\">Experience with cloud-based environments (e.g., AWS, Azure) is preferred.</li>\n</ul>\n</ul>\n<p> </p>\n<p><strong>Benefits</strong></p>\n<p>Why Join <a class=\"external\" href=\"http://uptime.com/\" rel=\"nofollow\">Uptime.com</a>:</p>\n<p>At <a class=\"external\" href=\"http://uptime.com/\" rel=\"nofollow\">Uptime.com</a>, you'll be part of a passionate team dedicated to delivering exceptional digital experiences. We value innovation, collaboration, and a commitment to excellence. As our Data Privacy and Security Analyst, you'll have the opportunity to shape our data privacy practices and contribute to the success of our clients and our company. Join us in our mission to provide seamless digital experiences while upholding the highest standards of data privacy and security.</p>\n<p> </p>\n<p> </p>\n<div class=\"h3\">How we will support your growth and success:</div>\n<ul style=\"\">\n<li style=\"\">Work closely with executives, leadership and cross-functional organization including engineering, marketing and business operations.</li>\n<li style=\"\">Professional development opportunities to further skills and knowledge.</li>\n<li style=\"\">Opportunity to learn the ins and outs of monitoring, observability and SRE space to continue the advancement of the industry and Uptime.com.</li>\n<li style=\"\">A collaborative and supportive team of smart, passionate people who are all focused on a common goal to build and operate the best monitoring service in the world.</li>\n</ul>\n<ul style=\"\">\n<li style=\"\"><strong>Generous Paid Time Off bank </strong></li>\n<li style=\"\">Training &amp; Development</li>\n<li style=\"\">Work From Home - FULLY REMOTE!</li>\n</ul>\n<p><br><br></p>\n<div class=\"h2\">About the company</div>\n<p> </p>\n<p>Uptime.com is a leading provider of website monitoring and performance optimization solutions. We help businesses of all sizes ensure that their websites and online applications are always available and running smoothly.</p>\n<p> </p>\n<p>Our advanced monitoring platform checks websites and servers from locations all over the world, alerting users to potential issues and downtime. We also offer a range of tools and services to help businesses optimize their website performance, including website speed testing, load testing, and performance analytics.</p>\n<p> </p>\n<p>At Uptime.com, we are committed to providing our customers with the best possible experience and helping them succeed online. Our team is made up of skilled professionals with a passion for technology and a commitment to customer satisfaction. So, if you are looking for a reliable and efficient way to monitor and improve your website's uptime and performance, Uptime.com is the perfect choice.</p>\n<img src=\"https://remotive.com/job/track/1910643/blank.gif?source=public_api\" alt=\"\"/>","tags":"[\"django\",\"go\",\"kubernetes\",\"python\"]","pubDate":"2024-05-06 21:20:49.000","link":"https://remotive.com/remote-jobs/devops/security-engineer-1910643","savedDate":"2024-05-09 13:10:01.593","slug":"security-engineer-uptime-com-2"},{"id":7839398571,"title":"Senior FP&A Manager II (Remote)","company":"DuckDuckGo","image":"https://spreadprivacy.com/content/images/2023/05/duckduckgo-logo_wide.png","description":"<p>Hi, we’re DuckDuckGo, the Internet privacy company for everyone who wants to take back their privacy now. For over a decade, we've been building our all-in-one product, developing new privacy technology, and working with policymakers to make online privacy simple and accessible for all. </p>\n<p><br /></p>\n<p>Our browsers and extensions have been downloaded over 250 million times with our built-in private search engine, which has delivered over 100 billion searches and is the 2nd largest search engine on mobile in the United States and 17 other countries, including the United Kingdom, Canada, Australia, Germany, Poland, and Spain. Our private search engine is also 3rd in market share in the U.S. and over 20 major markets. Oh, and we've been profitable since 2014, with annual revenue exceeding $100 million!</p>\n<p><br /></p>\n<p>The DuckDuckGo browser’s uniquely comprehensive privacy protections are used by tens of millions of people to protect their everyday online activities on <a href=\"https://spreadprivacy.com/introducing-duckduckgo-for-mac/\" rel=\"noopener\">Mac</a>, <a href=\"https://spreadprivacy.com/windows-browser-open-beta/\" rel=\"noopener\">Windows</a>, <a href=\"https://spreadprivacy.com/duckduckgo-privacy-browser-ios14/\" rel=\"noopener\">iOS</a>, and <a href=\"https://spreadprivacy.com/introducing-app-tracking-protection/\" rel=\"noopener\">Android</a>, from searching to browsing, emailing, and more. We also offer <a href=\"https://spreadprivacy.com/meetprivacypro/\" rel=\"noopener\">Privacy Pro</a>, a three-in-one subscription service that includes a VPN, Personal Information Removal, and Identity Theft Restoration.</p>\n<p><br /></p>\n<p>We’re looking for a <strong>Senior Manager FP&amp;A II </strong>to help shape our all-in-one privacy solution and join our mission to show the world that protecting your privacy online can be simple.  </p>\n<p><br /></p>\n<p><strong>The Opportunity</strong> </p>\n<p>In this role, you will help lead FP&amp;A and strategic finance initiatives, partnering across functional teams to help drive key business decisions for a growing, high-performing, privacy-focused technology company. You'll optimize the financial forecasting and reporting processes, surface business risks, and identify opportunities to help our business grow and reach its potential. You'll lead with an entrepreneurial mindset and develop our organization's long-range plan, business partnering, perform ad hoc modeling, peer benchmarking, and implement future FP&amp;A software. </p>\n<p><br /></p>\n<p>You'll work with leaders across the business to ensure any issues across the company are solved, collaborating openly, transparently and autonomously. You'll be a key player on our team to ensure DuckDuckGo maintains sustainable growth. We are a highly collaborative, transparent, and self-motivated team. If you thrive in this environment and our core values resonate with you — build trust, question assumptions, and validate direction — you'll fit right in! </p>\n<p><br /></p>\n<p><strong>What We're Looking For</strong></p>\n<ul><li>10+ years of relevant experience in strategic finance (FP&amp;A, management consulting, accounting, etc). Experience in leadership roles a plus.<br /></li><li>Deep understanding of ad-based and subscription business models a plus. Public company experience a plus. </li><li>An expert in financial modeling with aptitude to develop financial models and analysis, leveraging advanced Excel skills. Experience with financial planning tools like Oracle, NetSuite, Anaplan a plus.</li><li>Ability to help support financial and valuation modeling for M&amp;A transactions and other strategic investments. </li><li>Comfort with creating dashboards to track key metrics and business performance. Tableau, Power BI, Grafana, and Sage Intacct experience a plus.</li><li>Ability to lead and collaborate on high-impact and complex projects from proposal through postmortem — you act with urgency to lead and close tight feedback loops in projects.</li><li>Excellent analytical and project management skills to wrangle vague problems in cross-functional teams, propose innovative and high-impact solutions, and execute them with a strong focus on metrics. </li><li>Excellent written and verbal communication skills — you're innovative, organized, and thorough, with the growth mindset to receive and act on direct feedback effectively. </li><li>Prior experience with corporate accounting and financial reporting in accordance with US GAAP. </li><li>At least 4 hours of overlap with East Coast working hours each day.</li></ul>\n<p><br /></p>\n<p><strong>How We Will Support You </strong> </p>\n<p>Our core values -- build trust, question assumptions, and validate direction -- underpin how we work day-to-day and the support we give our team members. We strive to empower our team members to be self-directed and self-motivated in their work.  </p>\n<p><br /></p>\n<ul><li><strong>Remote-First, Always</strong>: We've always been a fully distributed company with team members all over the world. We trust you to get your work done wherever, and whenever.   </li><li><strong>Commitment to Personal Growth:</strong> Every team member has an annual budget of $1,250 USD to invest in their professional development. For team members in designated leadership roles, we offer reimbursement for leadership coaching services. The reimbursement amount varies by professional level. Every team member also has a dedicated Career Advisor, who serves as a guide to help you develop your strengths, identify your motivations, and understand your opportunities for growth. </li><li><strong>Leadership:</strong> We have many different types of leaders and possible combinations of leadership roles, so you can grow your career in a way that aligns best with your personal goals. You can seek additional leadership roles by being directly responsible for projects, taking ownership of areas of the company, developing and maintaining internal processes, or pursuing advisory roles. </li><li><strong>Work/Life Balance: </strong>Team members have the freedom and flexibility to organize their own work schedules. We want you to thrive both in and out of the office. We trust you to use good judgment and take the time off that you need to bring your best self to work.  </li></ul>\n<p><br /></p>\n<p>We also offer paid parental leave, a co-working stipend, office setup reimbursement, and a wellness stipend. More support resources can be found in our <u><a href=\"https://duckduckgo.com/assets/hiring/team_support_guide.pdf\" rel=\"noopener\">Team Member Support Guide</a></u>, which explains how we make your well-being a priority. </p>\n<p><br /></p>\n<p>For more information on how we collaborate worldwide, from leadership in our relatively flat organization to start-to-finish ownership<strong>,</strong> check out <u><a href=\"https://duckduckgo.com/how-we-work\" rel=\"noopener\">How We Work.</a></u></p>\n<p><br /></p>\n<p><strong>Compensation</strong> </p>\n<p>Annual compensation: <strong>$198,000 USD and stock options</strong>. Compensation is the same within a professional level, regardless of geographic location or functional area, and the compensation for each professional level is transparent across the organization.</p>\n<p><br /></p>\n<p><strong>Hiring Process</strong> </p>\n<p>Hiring works best when it's a two-way street. Learn how we help you get to know DuckDuckGo and envision your future role here. Find out more about <u><a href=\"https://duckduckgo.com/how-we-hire\" rel=\"noopener\">How We Hire.</a></u></p>\n<p><br /></p>\n<p><strong>Diversity, Equity, and Inclusion</strong> </p>\n<p>DuckDuckGo provides equal work opportunities to all team members and applicants<u>,</u> and it prohibits discrimination and harassment of any type on the basis of race, color, ethnicity, caste, religion, age, sex (including pregnancy), national origin, disability status, genetics, protected veteran status, sexual orientation, gender identity or expression, or any other characteristic protected by our policies or federal, state, or local laws.</p>\n<p><br /></p>\n<p>We want to ensure that our hiring process is accessible. If you need reasonable accommodation for any part of the application process because of a medical condition or disability, please send an email to <u><a href=\"mailto:careers@duckduckgo.com\" rel=\"noopener\">careers@duckduckgo.com</a></u> to let us know the nature of your request.  </p>\n<p><br /></p>\n<p>If you think you might thrive in this environment, we would love to hear from you. </p>\n<p><br /></p>\n<p><strong>Please note that:</strong> </p>\n<ol><li>Sometimes we meet up! Expect to travel at least two times a year: once for our all-hands meetup and again for a team retreat (each around 4-5 days). While extenuating circumstances may impact attendance, everyone is strongly encouraged to attend.</li><li>While we offer a flexible work arrangement with no core hours, expect an average full-time commitment of 40 hours per week. </li><li>A successful candidate will be subject to a background check and must receive satisfactory results of the same, as a condition of joining the team. </li><li>By applying for this role, you confirm that all information submitted is accurate and complete. You further acknowledge that providing false or fraudulent information during the application process is cause for denial of an offer, revocation of any existing offer, or other adverse action, up to and including termination after the start of your commencement of work.</li></ol>\n<p>#US #UK #CN #IR #LI-REMOTE</p>","tags":"[\"Finance\",\"management\",\"aws\"]","pubDate":"2024-05-06 21:17:15.000","link":"https://duckduckgo.recruitee.com/o/fpa-ii","savedDate":"2024-05-09 13:10:01.594","slug":"senior-fp-a-manager-ii-remote-duckduckgo-1645"},{"id":8979605122,"title":"Senior IT Operations Engineer (Remote)","company":"DuckDuckGo","image":"https://spreadprivacy.com/content/images/2023/05/duckduckgo-logo_wide.png","description":"<p>Hi, we’re DuckDuckGo, the Internet privacy company for everyone who wants to take back their privacy now. For over a decade, we've been building our all-in-one product, developing new privacy technology, and working with policymakers to make online privacy simple and accessible for all.</p>\n<p><br /></p>\n<p>Our browsers and extensions have been downloaded over 250 million times with our built-in private search engine, which has delivered over 100 billion searches and is the 2nd largest search engine on mobile in the United States and 17 other countries, including the United Kingdom, Canada, Australia, Germany, Poland, and Spain. Our private search engine is also 3rd in market share in the U.S. and over 20 major markets. Oh, and we've been profitable since 2014, with annual revenue exceeding $100 million!</p>\n<p><br /></p>\n<p>The DuckDuckGo browser’s uniquely comprehensive privacy protections are used by tens of millions of people to protect their everyday online activities on <a href=\"https://spreadprivacy.com/introducing-duckduckgo-for-mac/\" rel=\"noopener\">Mac</a>, <a href=\"https://spreadprivacy.com/windows-browser-open-beta/\" rel=\"noopener\">Windows</a>, <a href=\"https://spreadprivacy.com/duckduckgo-privacy-browser-ios14/\" rel=\"noopener\">iOS</a>, and <a href=\"https://spreadprivacy.com/introducing-app-tracking-protection/\" rel=\"noopener\">Android</a>, from searching to browsing, emailing, and more. We also offer <a href=\"https://spreadprivacy.com/meetprivacypro/\" rel=\"noopener\">Privacy Pro</a>, a three-in-one subscription service that includes a VPN, Personal Information Removal, and Identity Theft Restoration.</p>\n<p><br /></p>\n<p>We’re looking for a <strong>Senior IT Operations Engineer</strong> to help shape our all-in-one privacy solution and join our mission to show the world that protecting your privacy online can be simple.  <br /><br /></p>\n\n\n<p><strong>The Opportunity</strong></p>\n<p><br /></p>\n<p>In this role, your primary responsibility will be to provide exceptional IT and infrastructure support for all team members. You will work closely with team members of all levels to ensure smooth operations and contribute to the organizations' overall success.</p>\n<p><br /></p>\n<p>You will have the opportunity to take ownership and be responsible for areas that significantly impact DuckDuckGo's internal infrastructure and continuously improve and maintain them over time. This will involve core service administration (e.g., Exchange, Entra, Office365, etc), building processes and procedures for new services (e.g., MDM), account management responsibilities (including single sign-on (SSO) implementation, provisioning and de-provisioning of accounts), and managing permissions, ensuring everything is secure.</p>\n<p><br /></p>\n<p>You will join your colleagues in an on-call rotation in which you will triage and resolve team member support requests as they arise. Your creativity and ability to find innovative solutions will be highly valued. You will have the opportunity to create playbooks and documentation to streamline these requests, and build on automations that enhance the experience for the team and expedite their work. </p>\n<p><br /></p>\n<p>You will be expected to review and evaluate standard procedures and practices related to team member support, identifying areas of improvement and implementing changes that enhance efficiency and effectiveness.</p>\n<p><br /></p>\n<p>This role and team are vital to ensuring members of DuckDuckGo have the necessary support and resources to perform their roles effectively and efficiently.</p>\n<p><br /></p>\n<p><strong>What you will bring</strong></p>\n<ul><li>Ability to lead and collaborate on high-impact and complex projects from proposal through post-mortem.</li><li>Critical thinking skills to wrangle vague problems, propose innovative solutions, and execute them with a strong focus on metrics. </li><li>Significant experience (&gt;= 7 years) in IT operations in a medium to large organization (500+), preferably in a remote work environment.</li><li>Experience administering and supporting cloud and SaaS applications such as Office 365.</li><li>Experience deploying and administrating Azure Active Directory/Entra, SSO, and configurations for new service providers/deployments from the IDP.</li><li>Experience deploying and managing device management (MDM) systems for desktop and mobile.</li><li>Ability to troubleshoot on macOS, Windows, Linux, iPhone, Android, and Office 365 remotely.</li><li>Basic familiarity with Linux sysadmin utilities.</li><li>Passion for process improvement, keen attention to detail, and a strong desire to be responsive, proactive, and efficient in addressing support tickets.</li></ul>\n<p><br /></p>\n<p><strong>How We Will Support You </strong></p>\n<p>Our core values -- build trust, question assumptions, and validate direction -- underpin how we work day-to-day and the support we give our team members. We strive to empower our team members to be self-directed and self-motivated in their work. </p>\n<p><br /></p>\n<ul><li><strong>Remote First, Always</strong>: We've always been a fully distributed company with team members all over the world. We trust you to get your work done wherever, whenever.</li><li><strong>Commitment to Personal Growth:</strong> Every team member has an annual budget of $1,250 USD to invest in their professional development. Every team member also has a dedicated Career Advisor, who serves as a guide to help you develop your strengths, identify your motivations, and understand your opportunities for growth.</li><li><strong>Leadership:</strong> We have many different types of leaders and possible combinations of leadership roles, so you can grow your career in a way that aligns best with your personal goals. You can seek additional leadership roles by being directly responsible for projects, taking ownership of areas of the company, developing and maintaining internal processes, or pursuing advisory roles.</li><li><strong>Work/Life Balance: </strong>Team members have the freedom and flexibility to organize their own work schedules. We want you to thrive both in and out of the office. We trust you to use good judgment and take the time off that you need to bring your best self to work. </li></ul>\n<p><br /></p>\n<p>We also offer <strong>paid parental leave, a co-working stipend, office setup reimbursement, </strong>and<strong> a wellness stipend.</strong> More support resources can be found in our, <u><a href=\"https://duckduckgo.com/assets/hiring/team_support_guide.pdf\" rel=\"noopener\">Team Member Support Guide</a></u>, which explains how we make your well-being a priority. </p>\n<p><br /></p>\n<p>For more information on how we collaborate worldwide, from leadership in our relatively flat organization to start-to-finish ownership, check out <u><a href=\"https://duckduckgo.com/assets/hiring/how_we_work.pdf\" rel=\"noopener\">DuckDuckGo Culture: How We Work.</a></u></p>\n<p><br /></p>\n<p><strong>Compensation</strong></p>\n<p>Annual compensation: <strong>$176,000</strong> <strong>USD</strong> and stock options. Compensation is the same within a professional level, regardless of geographic location or functional area, and the compensation for each professional level is transparent across the organization.</p>\n<p><br /></p>\n<p><strong>Hiring Process</strong></p>\n<p>Hiring works best when it's a two-way street. Learn how we help you get to know DuckDuckGo and envision your future role here. Find out more about <u><a href=\"https://duckduckgo.com/assets/hiring/how_we_hire.pdf\" rel=\"noopener\">how we hire</a></u>. </p>\n<p><br /></p>\n<p><strong>Diversity, Equity, and Inclusion</strong></p>\n<p>DuckDuckGo provides equal work opportunities to all team members and applicants<u>,</u> and it prohibits discrimination and harassment of any type on the basis of race, color, ethnicity, caste, religion, age, sex (including pregnancy), national origin, disability status, genetics, protected veteran status, sexual orientation, gender identity or expression, or any other characteristic protected by our policies or federal, state, or local laws.</p>\n<p><br /></p>\n<p>We want to ensure that our hiring process is accessible. If you need reasonable accommodation for any part of the application process because of a medical condition or disability, please send an email to <u><a rel=\"noopener\">careers@duckduckgo.com</a></u> to let us know the nature of your request. </p>\n<p><br /></p>\n<p>If you think you might thrive in this environment, we would love to hear from you. </p>\n<p><br /></p>\n<p><strong>Please note that:</strong></p>\n<ul><li>Sometimes we meet up! Expect to travel at least two times a year: once for our all-hands meetup and again for a team retreat (each around 4-5 days). While extenuating circumstances may impact attendance, everyone is strongly encouraged to attend.</li><li>While we offer a flexible work arrangement with no core hours, expect an average full-time commitment of 40 hours per week. </li><li>A successful candidate will be subject to a background check and must receive satisfactory results of the same, as a condition of joining the team. </li><li>By applying for this role, you confirm that all information submitted is accurate and complete. You further acknowledge that providing false or fraudulent information during the application process is cause for denial of an offer, revocation of any existing offer, or other adverse action, up to and including termination after the start of your commencement of work.</li></ul>\n<p><br /></p>","tags":"[\"management\",\"aws\"]","pubDate":"2024-05-06 21:02:26.000","link":"https://duckduckgo.recruitee.com/o/senior-it-operations-engineer-remote-2","savedDate":"2024-05-09 13:10:01.595","slug":"senior-it-operations-engineer-remote-duckduckgo-501"},{"id":7638916744,"title":"Escalation Engineer (B)","company":"Blue Coding","image":"https://lever-client-logos.s3.us-west-2.amazonaws.com/3c1d9ac7-6738-46c5-b6ca-a35fa2a0df57-1666278594128.png","description":"<div><i style=\"font-size: 18px\">Do you want to earn a salary in USD?&nbsp;</i></div><div><i style=\"font-size: 18px\">Would you like to work from wherever you want?</i></div><div><i style=\"font-size: 18px\">Would you like to be a part of the leading next-gen software developers?&nbsp;</i></div><div><br></div><div><b style=\"font-size: 24px\">Hi, you finally found us!</b><span style=\"font-size: 24px\">&nbsp;</span></div><div><br></div><div><b style=\"font-size: 24px\">Why work at Blue Coding?</b><span style=\"font-size: 24px\">&nbsp;</span></div><div><br></div><div>At Blue Coding we specialize in hiring excellent developers and amazing people from all over Latin America and other parts of the world. For the past 9 years, we’ve helped cutting-edge companies in the United States and Canada -both large and small, build great development teams and develop great products. Online shops, digital agencies, SaaS providers, and software consulting firms are a few of our clients. Our team of over 100 engineers is distributed in more than 10 countries across the Americas. We are a fully remote company working with a wide array of technologies and have expertise in every stage of the software development process.&nbsp;&nbsp;</div><div><br></div><div>Our team is highly connected, united, and culturally diverse, and our collaborators are involved in many initiatives around the world, from wildlife preservation to volunteering at local charities. We also participate in group activities like movie nights, trivia, and meme competitions. We stand for honesty, fairness, respect, efficiency, hard work, and cooperation.</div><div><br></div><div><b style=\"font-size: 13pt\">What are we looking for?</b></div><div><br></div><div><span style=\"font-size: 16px\">In this opportunity, we are looking for an Escalations Engineer to work with one of our foreign clients, who are offering great reporting software to call centers across de globe making them more efficient and enabling them to grow and scale their business. The ideal candidate will be responsible for providing technical assistance and support to our client’s Customer Success team when customers are experiencing problems with their company's products or services. This role will troubleshoot and resolve technical issues, and work with Customer Success to ensure their issues are resolved in a timely manner.</span></div><div><span style=\"font-size: 16px\">If you are independent, a great communicator, a problem solver, and have strong attention to detail, this is a great fit for you! Our jobs are fully remote – as long as you have the skills and can get the work done well, you can work anywhere in the listed countries you want.</span></div><div><span style=\"font-size: 16px\">So if you have the skills and can get the job done, join us and work from anywhere you want!</span></div><div><br></div><div><b style=\"font-size: 13pt\">What's unique about this job?</b></div><div><br></div><div><span style=\"font-size: 16px\">Our client wants to make the call center world more efficient and scale their business accordingly. They want to help them gain deep insights into their operations and make the necessary changes for them to succeed in a competitive market. </span></div><h3>Here are some of the exciting day-to-day challenges you will face in this role:</h3><li>Provide technical assistance and support to their Customer Success team when they deal with tickets that require technical knowledge of the product</li><li>Troubleshoot and diagnose technical issues and provide solutions to Customer Support that can be easily explained to customers</li><li>Work with internal teams to troubleshoot and resolve technical issuesEscalate customer issues as appropriate to ensure timely resolution</li><li>Communicate effectively with Customer Success to understand and document issues, and provide clear and concise updates on the status of the issue</li><li>Create and maintain detailed documentation of technical issues and their resolutions in our issue-tracking software</li><li>Continuously look for new ways to improve customer satisfaction and the technical support process</li><li>Implement and maintain systems and tools to improve the efficiency and effectiveness of revenue operations, such as CRM, marketing automation, and business intelligence platforms</li><li>Create and maintain process documentation and training materials</li>,<h3>You will shine if you have these:</h3><li>Bachelor's degree in a related field or equivalent experience.</li><li>3+ years of software development experience or 5+ years of technical support experience (must include at least 3 years’ hands-on debugging experience).</li><li>Experience with C#, Microsoft SQL, Azure, and business intelligence platforms is strongly preferred.&nbsp;</li><li>Strong technical debugging skills.</li><li>Strong ability to multitask and prioritize tasks.</li><li>Excellent customer service and communication skills.</li><li>Strong problem-solving and analytical skills.</li><li>Strong project management and cross-functional collaboration skills.</li><li>Proficient in troubleshooting and diagnostic tools.</li>,<h3>It doesn’t hurt if you also have:</h3><li>CRM and marketing automation experience </li><li>Experience in telephony engineering or the contact center industry </li>,<h3>Here are some of the perks we offer you:</h3><li>Salary in USD</li><li>Long-term</li><li>Flexible schedule (within US Time zones)</li><li>100% Remote</li><div><b style=\"font-size: 24px\">Hey, you are still here!</b><span style=\"font-size: 24px\">&nbsp;</span></div><div><br></div><div>So, let us ask a few questions. Do you like working in a friendly environment? Are you fluent in English? Do you have a strong work ethic, are detail-oriented and have an ownership mentality? And most importantly do you love music and puppies? If so, then what are you waiting for? Come join our team and become part of this awesome company! We will be expecting you.</div>","tags":"[\"management\",\"engineering\"]","pubDate":"2024-05-06 18:44:07.475","link":"https://jobs.lever.co/bluecoding/502a3b1b-fad3-4bdf-9faf-b075bfe229a6","savedDate":"2024-05-09 13:10:01.604","slug":"escalation-engineer-b-blue-coding-9775"},{"id":8769697744,"title":"Channel Sales Manager, LATAM","company":"Airalo","image":"https://lever-client-logos.s3.us-west-2.amazonaws.com/55028a36-609c-479c-9553-d4689ff2dd8c-1669620566663.png","description":"<div>Airalo is looking for a retail <b>Channel Sales Manager</b> to join the <b>Airalo Partnerships</b> department.</div><div>Physical SIM cards are passe. The future of connectivity, especially for travelers, is through eSIMs. As the undisputed industry leader in the B2C segment, we are now looking to expand our presence in the retail and traditional telecom sales channels to bring the eSIM revolution to hundreds of thousands of telecom retailers globally.</div><div>As the <b>Channel Sales Manager</b> for <b>LATAM</b>, you will lead Airalo’s retail distribution strategy and execution to ensure Airalo’s presence across branded and unorganized travel and telecom retail stores.</div><h3>Responsibilities include but are not limited to:</h3><li>Work closely with our Director/VP of Partnerships and other team members in the department</li><li>Hire and manage a team of Channel Sales Specialists in the LATAM region</li><li>Market mapping of the travel agent and telecom retail universe in key cities across LATAM and creating a distribution roadmap to achieve maximum penetration across the universe</li><li>Onboard and support new partners as they join the Airalo partner community</li><li>Build and maintain fruitful relationships with the store managers/owners to drive mutual growth</li><li>Drive visibility and brand awareness for Airalo at the point of sale through merchandising/employee training</li><li>Design and manage a program to educate retailers on eSIM adoption</li><li>Conduct competitive research and define the Airalo retail distribution roadmap to maintain Airalo’s status as the preferred provider across partners</li><li>Collaborate and work with different internal and external stakeholders to develop and execute projects/opportunities successfully</li><li>Own and deliver monthly, quarterly, and annual OKRs with regular tracking and progress reports</li>,<h3>Must-haves:</h3><li>5+ years of experience in retail channel sales or business development in the travel or telecom industry</li><li>At least 2 years experience in hiring and leading a team</li><li>Good understanding of the retail (preferably the travel and/or telecom retail) channel in LATAM</li><li>This is a largely relationship-driven channel. You must be able to forge and nurture relationships with stakeholders across the channel</li><li>Ability to narrate a good story - Airalo’s unique story and the problem we solve for our users make it a compelling pitch for partners</li><li>Ability to employ sales techniques, including effective questioning, objection handling, consultative selling, and solution selling</li><li>Ability to multi-task</li><li>Experience with sales and partnership tools</li><li>Perfect verbal and written communication skills in English</li>,<h3>Good to have:</h3><li>Familiarity with the travel or telecom industry</li><li>Prior work experience in the travel or telecom industry</li><li>Experience in building and leading a team</li><li>Certificates and courses in sales and partnerships</li><li>Verbal and written ability in additional local/regional languages</li>","tags":"[\"B2C\"]","pubDate":"2024-05-06 16:04:16.933","link":"https://jobs.lever.co/airalo/9cedbccf-c492-448b-bd5a-edeaed228660","savedDate":"2024-05-09 13:10:01.600","slug":"channel-sales-manager-latam-airalo-6052"},{"id":9939072030,"title":"Channel Sales Specialist, Brazil","company":"Airalo","image":"https://lever-client-logos.s3.us-west-2.amazonaws.com/55028a36-609c-479c-9553-d4689ff2dd8c-1669620566663.png","description":"<div>Airalo is looking for a retail <b>Channel Sales Specialist</b> to join the <b>Airalo Partnerships</b> department.</div><div>Physical SIM cards are passe. The future of connectivity, especially for travelers, is through eSIMs. As the undisputed industry leader in the B2C segment, we are now looking to expand our presence in the retail and traditional telecom sales channels to bring the eSIM revolution to hundreds of thousands of telecom retailers globally.</div><div>As the <b>Channel Sales Specialist</b> for <b>Brazil</b>, you will own Airalo’s retail distribution strategy and execution to ensure Airalo’s presence across branded and unorganized travel, telecom, and general retail stores.</div><h3>Responsibilities include but are not limited to:</h3><li>Work closely with the Channel Sales Manager, LATAM, and other team members in the department</li><li>Market mapping of the travel agent and telecom retail universe in key cities across Brazil and creating a distribution roadmap to achieve maximum penetration across the universe</li><li>Onboard and support new partners as they join the Airalo partner community</li><li>Build and maintain fruitful relationships with the store managers/owners to drive mutual growth</li><li>Drive visibility and brand awareness for Airalo at the point of sale through merchandising/employee training</li><li>Design and manage a program to educate retailers and travel agents on eSIM adoption</li><li>Conduct competitive research and define the Airalo retail distribution roadmap to maintain Airalo’s status as the preferred provider across partners</li><li>Collaborate and work with different internal and external stakeholders to develop and execute projects/opportunities successfully</li><li>Own and deliver monthly, quarterly, and annual OKRs for your channel with regular tracking and progress reports</li><li>As a core member of the Brazil squad, always explore ways and means to further consolidate Airalo’s dominance in Brazil</li>,<h3>Must-haves:</h3><li>2+ years of experience in retail channel sales or business development in the travel or telecom industry</li><li>Good understanding of the retail (preferably the travel and/or telecom retail) channel in Brazil</li><li>This is a largely relationship-driven channel. You must be able to forge and nurture relationships with stakeholders across the channel</li><li>Ability to narrate a good story - Airalo’s unique story and the problem we solve for our users make it a compelling pitch for partners</li><li>Ability to employ sales techniques, including effective questioning, objection handling, consultative selling, and solution selling</li><li>Ability to multi-task</li><li>Experience with sales and partnership tools</li><li>Perfect verbal and written communication skills in English and in Portuguese</li>,<h3>Good to have:</h3><li>Familiarity with the travel or telecom industry</li><li>Prior work experience in the travel or telecom industry</li><li>Knowledge of eSIM and GSMA-related technologies and services</li><li>Certificates and courses in sales and partnerships</li>","tags":"[\"B2C\"]","pubDate":"2024-05-06 15:49:22.989","link":"https://jobs.lever.co/airalo/6f340b8a-c9f9-488a-a9af-abad73497d8b","savedDate":"2024-05-09 13:10:01.602","slug":"channel-sales-specialist-brazil-airalo-9528"},{"id":8044459797,"title":"Junior Compliance Analyst (remote opportunity, work anywhere)","company":"CloudLinux","image":"https://pbs.twimg.com/profile_images/696718028084482050/ymY3OEPk_400x400.png","description":"<p>We are seeking a Junior Compliance Analyst to be responsible for managing the overall corporate risk profile, assisting in policy development and risk register updates, supporting compliance audits and monitoring, and maintaining documentation of compliance activities. This role plays a key part in ensuring the company's adherence to regulatory requirements. It will reporting to Compliance Officer.</p><p>Join us and become part of a company that goes beyond just business. At CloudLinux, we believe in making a meaningful impact in the Linux and hosting industry. You'll be joining a supportive team that promotes collaboration and shared success.</p><p>Learn more about us: <a href=\"https://cloudlinux.com/\" target=\"_blank\" rel=\"nofollow noreferrer noopener\" class=\"external\">https://cloudlinux.com/</a> </p><p><strong>As our Jr. Compliance Analyst you’ll be responsible for:&nbsp;</strong></p><ul> <li>Completing the risk assessments for assigned third-party relationships and gather due diligence documentation following the internal vendor risk assessment procedure (incl., KYC of our clients, Due Diligence of our critical vendors);</li> <li>Managing the Enterprise-Wide Risk Register with the relevant Risk Owners and monitoring the implementation of the Remediation actions plan;</li> <li>Contributing to internal audits to identify areas of compliance vulnerabilities and risks;</li> <li>Managing the updating of the Business Continuity and Disaster Recovery Plan and regular testing of its main scenarios;</li> <li>Contributing to quarter compliance monitoring with the final report preparation;</li> </ul><p></p><h3>Requirements: </h3><p><strong>To be successful in this role you should have:</strong></p><ul> <li>A University Degree (Bachelor of Laws, Finance or higher).</li> <li>Experience in compliance, internal audit, and risk management is advantageous, but not mandatory.</li> <li>Ability to conduct risk assessments for the company's operations, products, and services.</li> <li>Skills in performing compliance audits and monitoring to ensure policy adherence.</li> <li>Competence in documenting compliance activities and incidents, and in preparing detailed reports for both internal and external stakeholders.</li> <li>Strong interpersonal skills for effective collaboration across various departments including legal, IT, product development, and customer support.</li> <li>Analytical skills to understand and apply complex regulatory requirements to the company’s practices.</li> <li>Exceptional attention to detail to ensure thorough compliance with all regulations and internal policies.</li> </ul><h3>Benefits: </h3><p><strong>What's in it for you?</strong></p><ul> <li>A focus on professional development; </li> <li>Interesting and challenging projects</li> <li>Flexible working hours</li> <li>Paid one month vacation per year and unlimited sick leave</li> <li>Medical insurance reimbursement</li> <li>Co-working and gym/sports reimbursement</li> <li>The opportunity to receive a reward for the most innovative idea that the company can patent</li> </ul><p><em>By applying for this position, you agree with </em><a href=\"https://cloudlinux.com/privacy-policy\" rel=\"nofollow noreferrer noopener\" class=\"external\"><em>Cloudlinux Privacy Policy</em></a><em> and give us your consent to maintain and process your personal data with this respect. Please read our Privacy Policy for more information.</em></p>","tags":"[\"Finance\",\"management\",\"legal\",\"aws\"]","pubDate":"2024-05-06 00:00:00.000","link":"https://apply.workable.com/cloudlinux-1/j/59ADB43254","savedDate":"2024-05-09 13:10:01.597","slug":"junior-compliance-analyst-remote-opportunity-work-anywhere-cloudlinux-9147"},{"id":2882103326,"title":"Channel Sales Manager, North America","company":"Airalo","image":"https://lever-client-logos.s3.us-west-2.amazonaws.com/55028a36-609c-479c-9553-d4689ff2dd8c-1669620566663.png","description":"<h3>Responsibilities include but are not limited to:</h3><li>Work closely with our Director/VP of Partnerships and other team members in the department</li><li>Hire and manage a team of Channel Sales Specialists in the North America</li><li>Market mapping of the travel agent and telecom retail universe in key cities across North America and creating a distribution roadmap to achieve maximum penetration across the universe</li><li>Onboard and support new partners as they join the Airalo partner community</li><li>Build and maintain fruitful relationships with the store managers / owners to drive mutual growth</li><li>Drive visibility and brand awareness for Airalo at point of sale through merchandising / employee training</li><li>Design and manage a program to educate retailers on eSIM adoption</li><li>Conduct competitive research and define the Airalo retail distribution roadmap to maintain Airalo’s status as the preferred provider across partners</li><li>Collaborate and work with different internal and external stakeholders to develop and execute projects/opportunities successfully</li><li>Own and deliver monthly, quarterly and annual OKRs with regular tracking and progress reports</li>,<h3>Must-Haves</h3><li>5+ years of experience in retail channel sales or business development in the travel or telecom industry</li><li>At least 2 years’ experience in hiring and leading a team</li><li>Good understanding of the retail (preferably the travel and / or telecom retail) channel in North America</li><li>This is a largely relationship driven channel. You must be able to forge and nurture relationships with stakeholders across the channel</li><li>Ability to narrate a good story - Airalo’s unique story and the problem we solve for our users makes it a compelling pitch for partners</li><li>Ability to employ sales techniques, including effective questioning, objection handling, consultative selling, and solution selling</li><li>Ability to multi-task</li><li>Experience with sales and partnerships tools</li><li>Perfect verbal and written communication skills in English</li>,<h3>Good to Haves</h3><li>Familiarity with the travel or telecom industry</li><li>Prior work experience in the travel or telecom industry</li><li>Experience in building and leading a team</li><li>Certificates and courses in sales and partnerships</li><li>Verbal and written ability in additional local / regional languages</li>","tags":"[]","pubDate":"2024-05-03 21:48:37.353","link":"https://jobs.lever.co/airalo/1cef898a-e793-4209-911f-34b269fc9c74","savedDate":"2024-05-09 13:10:01.600","slug":"channel-sales-manager-north-america-airalo-1845"},{"id":7531777303,"title":"Channel Sales Specialist, North America","company":"Airalo","image":"https://lever-client-logos.s3.us-west-2.amazonaws.com/55028a36-609c-479c-9553-d4689ff2dd8c-1669620566663.png","description":"<h3>Responsibilities include but are not limited to </h3><li>Work closely with the&nbsp;<b>Channel Sales Manager, North America</b>&nbsp;and other team members in the department</li><li>Market mapping of the travel agent and telecom retail universe in key cities across North America and creating a distribution roadmap to achieve maximum penetration across the universe</li><li>Onboard and support new partners as they join the Airalo partner community</li><li>Build and maintain fruitful relationships with the store managers / owners to drive mutual growth</li><li>Drive visibility and brand awareness for Airalo at point of sale through merchandising / employee training</li><li>Design and manage a program to educate retailers and travel agents on eSIM adoption</li><li>Conduct competitive research and define the Airalo retail distribution roadmap to maintain Airalo’s status as the preferred provider across partners</li><li>Collaborate and work with different internal and external stakeholders to develop and execute projects/opportunities successfully</li><li>Own and deliver monthly, quarterly and annual OKRs for your channel with regular tracking and progress reports</li><li>As a core member of the North America squad, always explore ways and means to further consolidate Airalo’s dominance in North America</li>,<h3>Must-Haves</h3><li>2+ years of experience in retail channel sales or business development in the travel or telecom industry</li><li>Good understanding of the retail (preferably the travel and / or telecom retail) channel in North America</li><li>This is a largely relationship driven channel. You must be able to forge and nurture relationships with stakeholders across the channel</li><li>Ability to narrate a good story - Airalo’s unique story and the problem we solve for our users makes it a compelling pitch for partners</li><li>Ability to employ sales techniques, including effective questioning, objection handling, consultative selling, and solution selling</li><li>Ability to multi-task</li><li>Experience with sales and partnerships tools</li><li>Perfect verbal and written communication skills in English and, ideally, Spanish and/or French</li>,<h3>Good to Have</h3><li>Familiarity with the travel or telecom industry</li><li>Prior work experience in the travel or telecom industry</li><li>Knowledge of eSIM and GSMA-related technologies and services</li><li>Certificates and courses in sales and partnerships</li>","tags":"[]","pubDate":"2024-05-03 21:44:56.710","link":"https://jobs.lever.co/airalo/3c117a8e-7e2e-4665-842d-bca9b4772777","savedDate":"2024-05-09 13:10:01.602","slug":"channel-sales-specialist-north-america-airalo-6904"},{"id":4146884416,"title":"Front-end Developer (VM)","company":"Blue Coding","image":"https://lever-client-logos.s3.us-west-2.amazonaws.com/3c1d9ac7-6738-46c5-b6ca-a35fa2a0df57-1666278594128.png","description":"<div><i style=\"font-size: 18px\">Do you want to earn a salary in USD?&nbsp;</i></div><div><i style=\"font-size: 18px\">Would you like to work from wherever you want?</i></div><div><i style=\"font-size: 18px\">Would you like to be a part of the leading next-gen software developers?&nbsp;</i></div><div><br></div><div><b style=\"font-size: 24px\">Hi, you finally found us!</b><span style=\"font-size: 24px\">&nbsp;</span></div><div><br></div><div><b style=\"font-size: 24px\">Why work at Blue Coding?</b><span style=\"font-size: 24px\">&nbsp;</span></div><div><br></div><div>At Blue Coding we specialize in hiring excellent developers and amazing people from all over Latin America and other parts of the world. For the past 9 years, we’ve helped cutting-edge companies in the United States and Canada -both large and small, build great development teams and develop great products. Online shops, digital agencies, SaaS providers, and software consulting firms are a few of our clients. Our team of over 100 engineers is distributed in more than 10 countries across the Americas. We are a fully remote company working with a wide array of technologies and have expertise in every stage of the software development process.&nbsp;&nbsp;</div><div><br></div><div>Our team is highly connected, united, and culturally diverse, and our collaborators are involved in many initiatives around the world, from wildlife preservation to volunteering at local charities. We also participate in group activities like movie nights, trivia, and meme competitions. We stand for honesty, fairness, respect, efficiency, hard work, and cooperation.</div><div><br></div><div><b style=\"font-size: 18px\">What are we looking for?</b></div><div><br></div><div><span style=\"font-size: 16px\">In this opportunity, we are looking for a Front-end Developer to work with one of our foreign clients, who is a market leader in the consultation, design, procurement, implementation, and ongoing managed services for technology services for mid to large global enterprises. As a Telecom Managed Service company, they partner with over 300 service providers globally to help customers with technology design and find the best solutions to meet their needs.</span></div><div><br></div><div><span style=\"font-size: 16px\">If you are independent, a great communicator, a problem solver, and have strong attention to detail, this is a great fit for you! Our jobs are fully remote – as long as you have the skills and can get the work done well, you can work anywhere in the listed countries you want.</span></div><div><span style=\"font-size: 16px\">If you have the skills and can get the job done, join us and work from anywhere you want!</span></div><h3>You will shine if you have:</h3><li>Strong hands-on experience with HTML, CSS, Javascript and <a href=\"http://Vue.js\">Vue.js</a>.</li><li>Experience with Agile methodologies such as Scrum, and Kanban.</li><li>Experience with cloud environments like Azure or similar.</li><li>Knowledge or experience working or reading React or Typescript is plus</li>,<h3>Here are some of the perks we offer you:</h3><li>Salary in USD</li><li>Long-term</li><li>Flexible schedule (within US Time zones)</li><li>100% Remote</li><div><b style=\"font-size: 24px\">Hey, you are still here!</b><span style=\"font-size: 24px\">&nbsp;</span></div><div><br></div><div>So, let us ask a few questions. Do you like working in a friendly environment? Are you fluent in English? Do you have a strong work ethic, are detail-oriented and have an ownership mentality? And most importantly do you love music and puppies? If so, then what are you waiting for? Come join our team and become part of this awesome company! We will be expecting you.</div>","tags":"[\"javascript\",\"typescript\"]","pubDate":"2024-05-03 19:50:05.696","link":"https://jobs.lever.co/bluecoding/8358aab8-2d33-411c-802f-8cd71fdaf03c","savedDate":"2024-05-09 13:10:01.604","slug":"front-end-developer-vm-blue-coding-9981"},{"id":3757983466,"title":"Senior Front-end Developer (VM)","company":"Blue Coding","image":"https://lever-client-logos.s3.us-west-2.amazonaws.com/3c1d9ac7-6738-46c5-b6ca-a35fa2a0df57-1666278594128.png","description":"<div><i style=\"font-size: 18px\">Do you want to earn a salary in USD?&nbsp;</i></div><div><i style=\"font-size: 18px\">Would you like to work from wherever you want?</i></div><div><i style=\"font-size: 18px\">Would you like to be a part of the leading next-gen software developers?&nbsp;</i></div><div><br></div><div><b style=\"font-size: 24px\">Hi, you finally found us!</b><span style=\"font-size: 24px\">&nbsp;</span></div><div><br></div><div><b style=\"font-size: 24px\">Why work at Blue Coding?</b><span style=\"font-size: 24px\">&nbsp;</span></div><div><br></div><div>At Blue Coding we specialize in hiring excellent developers and amazing people from all over Latin America and other parts of the world. For the past 9 years, we’ve helped cutting-edge companies in the United States and Canada -both large and small, build great development teams and develop great products. Online shops, digital agencies, SaaS providers, and software consulting firms are a few of our clients. Our team of over 100 engineers is distributed in more than 10 countries across the Americas. We are a fully remote company working with a wide array of technologies and have expertise in every stage of the software development process.&nbsp;&nbsp;</div><div><br></div><div>Our team is highly connected, united, and culturally diverse, and our collaborators are involved in many initiatives around the world, from wildlife preservation to volunteering at local charities. We also participate in group activities like movie nights, trivia, and meme competitions. We stand for honesty, fairness, respect, efficiency, hard work, and cooperation.</div><div><br></div><div><b style=\"font-size: 18px\">What are we looking for?</b></div><div><br></div><div><span style=\"font-size: 16px\">In this opportunity, we are looking for a Senior Front-end Developer to work with one of our foreign clients, who is a market leader in the consultation, design, procurement, implementation, and ongoing managed services for technology services for mid to large global enterprises. As a Telecom Managed Service company, they partner with over 300 service providers globally to help customers with technology design and find the best solutions to meet their needs.</span></div><div><br></div><div><span style=\"font-size: 16px\">If you are independent, a great communicator, a problem solver, and have strong attention to detail, this is a great fit for you! Our jobs are fully remote – as long as you have the skills and can get the work done well, you can work anywhere in the listed countries you want.</span></div><div><span style=\"font-size: 16px\">If you have the skills and can get the job done, join us and work from anywhere you want!</span></div><h3>You will shine if you have:</h3><li>Strong hands-on experience with HTML, CSS, Javascript and Vue.js.</li><li>Experience with Agile methodologies such as Scrum, and Kanban.</li><li>Experience with cloud environments like Azure or similar.</li><li>Knowledge or experience working or reading React or Typescript is  plus.</li>,<h3>Here are some of the perks we offer you:</h3><li>Salary in USD</li><li>Long-term</li><li>Flexible schedule (within US Time zones)</li><li>100% Remote</li><div><b style=\"font-size: 24px\">Hey, you are still here!</b><span style=\"font-size: 24px\">&nbsp;</span></div><div><br></div><div>So, let us ask a few questions. Do you like working in a friendly environment? Are you fluent in English? Do you have a strong work ethic, are detail-oriented and have an ownership mentality? And most importantly do you love music and puppies? If so, then what are you waiting for? Come join our team and become part of this awesome company! We will be expecting you.</div>","tags":"[\"javascript\",\"typescript\"]","pubDate":"2024-05-03 19:26:22.619","link":"https://jobs.lever.co/bluecoding/c334b129-c8d7-48a0-8792-408f6ab35e91","savedDate":"2024-05-09 13:10:01.605","slug":"senior-front-end-developer-vm-blue-coding-7597"},{"id":8857064648,"title":"Accounting Manager (Fully Remote)","company":"CoverGo","image":"https://pbs.twimg.com/profile_images/1382655628523364355/MWPIbbID_400x400.jpg","description":"<p><strong>Top 3 Reasons To Join Us</strong></p><ul> <li>Competitive Salary</li> <li>100% Remote</li> </ul><ul><li>International team</li></ul><ul><li>Working on the latest tech for the Insurtech Market Leader</li></ul><p><strong>About Us</strong></p><p>At CoverGo, our mission is to empower all insurance companies to make insurance 100% digital and accessible to everyone.</p><ul> <li>We are a leading global no-code insurance platform for health, life, and P&amp;C</li> <li>We’re the winner of the Insurtech of the Year in all of Asia and other awards globally</li> <li>We work with insurance enterprise clients such as AXA, Bupa, MSIG, Dai-ichi, Bank of China Group Insurance, and many more</li> <li>We're an international, diverse team of over 120 people with 30 nationalities and team members working remotely from all over the world</li> <li>We are fully funded and backed by reputable VC funds and strategic institutional investors</li> <li>We have a global presence in Asia, EMEA and the Americas</li> <li>We’ve grown our annualized revenue by over 30x since January 2021</li> <li>We’re constantly working towards making CoverGo a workplace that you love coming to. We deeply believe that bringing together a diversity of thoughts, expressions, and perspectives is key to building the best culture for equally diverse communities all over the world</li> </ul><p><strong>About the Role</strong></p><p>As an Accounting Manager, you'll lead the financial operations of multiple entities within our group, ensuring compliance with regulations and company policies. Collaborating with executive management, you'll develop forecasts, budgets, and long-term financial plans to support our objectives, including potential IPO considerations. Your international financial expertise will guide us through cross-border complexities, while your hands-on approach will optimize cash flow management and budgeting processes. Additionally, any previous leadership experience will help you manage our existing team of accountants.</p><p><strong>What You Will Do</strong></p><ul> <li>Provide leadership in overseeing the financial operations of multiple entities within the group.</li> <li>Ensure compliance with accounting standards, financial regulations, and company policies.</li> <li>Collaborate with executive management to develop financial forecasts, budgets, and long-term financial plans aligned with the company's objectives. .</li> <li>Contribute to the development and execution of financial plans for future growth, including potential IPO considerations.</li> <li>Prepare comprehensive financial proposals, presentations, and due diligence documents to support fundraising efforts.</li> <li>Leverage extensive international financial experience to navigate the complexities of managing finances across borders.</li> <li>Handle multi-currency transactions and understand the nuances of financial regulations in various jurisdictions.</li> <li>Lead and mentor a high-performing finance team, fostering a culture of excellence and collaboration.</li> <li>Provide guidance on complex financial issues and ensure professional development within the team.</li> <li>Bring expertise in financial technology or insurtech, staying abreast of industry trends and implementing relevant technologies to enhance financial processes.</li> <li>Optimize cash flow management, working capital, and budgeting processes to maximize profitability and minimize financial risks.</li> </ul><p><strong>What We Need</strong></p><ul> <li>Bachelor's degree in Finance, Economics, or Business</li> <li>CPA or ACCA certification is mandatory</li> <li>10+ years of progressive experience in financial roles, with a strong preference for international companies</li> <li>Demonstrated experience overseeing financial operations across multiple jurisdictions</li> <li>Prior exposure to financial technology (FinTech) or insurtech is highly desirable</li> <li>Experience with initial public offerings (IPO) is a significant advantage</li> <li>Experience with Xero or Quickbooks is a plus</li> <li>Previous work experience in a Big Four accounting firm is a plus</li> <li>Able to work independently and under pressure in a fast-paced environment with an emphasis on accuracy and timeliness</li> <li>Meticulous, well-organized and conscientious with a high level of initiative at work</li> <li>Self-motivated, hardworking, a strong sense of responsibility with a positive working attitude</li> <li>Resourceful, can-do attitude and willingness to learn and go beyond</li> <li>Great English communication skills</li> <li>Based in the Philippines</li> </ul><p><strong>Why You'll Love Working Here</strong></p><ul> <li>Fully Remote</li> <li>Flexible Leave</li> <li>International Environment</li> <li>Competitive remuneration package</li> <li>Performance Bonus</li> <li>Stock Options after 6 months</li> <li>Company activities and events</li> <li>Learning and development plan</li> <li>Remote work allowance</li> </ul><p><strong>CoverGo Company</strong><a href=\"https://www.youtube.com/watch?v=YI0ezLxvFvA\" rel=\"nofollow noreferrer noopener\" class=\"external\"><strong> Video</strong></a></p><p>By submitting your application, you confirm that you have read, understood, and accepted the content of CoverGo’s<a href=\"https://apply.workable.com/covergo/gdpr_policy?lng=en\" rel=\"nofollow noreferrer noopener\" class=\"external\"> Privacy Notice</a> and you consent to the processing of your data as part of this application.</p><p></p><h3>Requirements: </h3><h3>Benefits: </h3>","tags":"[\"Finance\",\"management\"]","pubDate":"2024-05-03 00:00:00.000","link":"https://apply.workable.com/covergo/j/09502F175D","savedDate":"2024-05-09 13:10:01.598","slug":"accounting-manager-fully-remote-covergo-2739"},{"id":4920193276,"title":"Sales Intern (Immediate Hire) - Full Remote","company":"CoverGo","image":"https://pbs.twimg.com/profile_images/1382655628523364355/MWPIbbID_400x400.jpg","description":"<p><strong>Top 3 Reasons To Join Us</strong></p><ul> <li>International Environment</li> <li>100% Remote</li> <li>Access to Cutting-Edge Technology</li> </ul><p><strong>About Us</strong></p><p>At CoverGo, our mission is to empower all insurance companies to make insurance 100% digital and accessible to everyone.</p><ul> <li>We are a leading global no-code insurance platform for health, life, and P&amp;C</li> <li>We’re the winner of the Insurtech of the Year in all of Asia and other awards globally</li> <li>We work with insurance enterprise clients such as AXA, Bupa, MSIG, Dai-ichi, Bank of China Group Insurance, and many more</li> <li>We're an international, diverse team of over 120 people with 30 nationalities and team members working remotely from all over the world</li> <li>We are fully funded and backed by reputable VC funds and strategic institutional investors</li> <li>We have a global presence in Asia, EMEA and the Americas</li> <li>We’ve grown our annualized revenue by over 30x since January 2021</li> <li>We’re constantly working towards making CoverGo a workplace that you love coming to. We deeply believe that bringing together a diversity of thoughts, expressions, and perspectives is key to building the best culture for equally diverse communities all over the world</li> </ul><p><strong>What You Will Do&nbsp;</strong></p><ul> <li>Research and identify potential clients and market segments to target for business development opportunities, contributing to SDR upper funnel effort</li> <li>Generate leads through cold emails, LinkedIn Sales Navigator, networking, and other outreach efforts</li> <li>Conduct presentations and product demonstrations to potential clients.</li> <li>Use Salesforce as company CRM, ensure data accuracy for reporting analytics</li> <li>Track and report on sales performance metrics, including pipeline activity and revenue forecasts.</li> <li>Stay updated on industry trends, market conditions, and competitive activities.</li> </ul><p><strong>What We Need</strong></p><ul> <li>Bachelor's degree in Business Administration, Marketing, or related field (undergraduates are welcome)</li> <li>Proficiency in Google Workspace and Microsoft Office suite is required</li> <li>Proficiency in CRM software (Salesforce) is a plus</li> <li>Knowledge in the insurance industry is a major advantage</li> <li>Strong communication, negotiation, and interpersonal skills.</li> <li>Ability to work independently and as part of a team in a fast-paced environment.</li> <li>Excellent time management and organizational skills.</li> <li>Internship duration: Minimum of 2 months</li> <li>Please be advised that this internship opportunity is unpaid</li> </ul><p><strong>Why You'll Love Working Here</strong></p><ul> <li>Remote Setup</li> <li>International Environment</li> <li>Professional Development Opportunities</li> <li>Company activities and events</li> </ul><p><strong>CoverGo Company</strong><a href=\"https://www.youtube.com/watch?v=YI0ezLxvFvA\" rel=\"nofollow noreferrer noopener\" class=\"external\"><strong> Video</strong></a></p><p>By submitting your application, you confirm that you have read, understood, and accepted the content of CoverGo’s <a href=\"https://apply.workable.com/covergo/gdpr_policy?lng=en\" target=\"_blank\" rel=\"nofollow noreferrer noopener\" class=\"external\">Privacy Notice</a> and you consent to the processing of your data as part of this application.</p><h3>Requirements: </h3><h3>Benefits: </h3>","tags":"[\"management\"]","pubDate":"2024-05-03 00:00:00.000","link":"https://apply.workable.com/covergo/j/528A77C160","savedDate":"2024-05-09 13:10:01.598","slug":"sales-intern-immediate-hire-full-remote-covergo-7412"},{"id":1715628945,"title":"Satın Alma & İdari İşler Uzmanı","company":"Ciceksepeti","image":"https://lever-client-logos.s3.us-west-2.amazonaws.com/de4eebbf-97f1-4bdb-b542-4fa65a0b48ab-1662467464737.png","description":"<div><span style=\"font-size: 11pt\">Bir teknolojisi firması olarak faaliyet gösterdiğimiz tüm pazarlarda lider olmak vizyonuyla çıktığımız yolda bize katılmak ister misiniz?</span></div><div><br></div><div><span style=\"font-size: 11pt\">Kurumsalın alışılagelmiş ifadelerinden ve hiyerarşiden uzak heyecan verici bir kariyere başlamak için en iyi yönlerini ortaya çıkarmaya hazır, dinamik, entelektüel açıdan meraklı genç profesyoneller arıyoruz. Hızla büyümeye devam eden bir teknoloji şirketi olarak gerçek hayatta yaşanan sorunları çözme ve profesyonel yaşamı deneyimleme imkanı sunuyoruz. Yaptığın işin tüm sorumluluğunu almak istiyorsan, işine katkı sağlayacak yeni fikirlerin olduğunda sesini duyurmak istiyorsan ve olağanüstü bir işbaşında eğitim deneyimi yaşamaya hazırsan; o zaman meydan okumaya hazırsın.Bu heyecana ortak olup başarımızı daha da ileriye taşıyacak</span><b style=\"font-size: 11pt\"> Satın Alma &amp; İdari İşler Uzmanı </b><span style=\"font-size: 11pt\">arıyoruz.</span></div><div><br></div><h3>🎯 Sorumluluklar</h3><li>Bina hizmetlerinin (elektrik, su, gaz, asansör, otomatik kapılar, jeneratör, hidrofor, yangın tüpleri, fotokopi-faks vb.) bakım ve kontrolü, aksaklık ve arızaların&nbsp; teknik&nbsp; ekibe &nbsp; bildirilmesi ve süreç takibinin yapılması</li><li>Şirket araçları ile filonun takibinin yapılması (tedarikçi görüşmeleri, sözleşmeler, HGS,&nbsp; taşıt tanıma, servis, araç temizliği, onarım, trafik cezaları, yaz-kış lastik değişimi GPS&nbsp; kasko takibi vb.)</li><li>Tüm gıda/sarf/kırtasiye/teknik malzemelerin takibi, eksiklerin tespiti ve temini</li><li>Personel servisi, güvenlik ve temizlik konularının yönetim ve denetimi</li><li>Personel zimmetlerinin gerçekleştirilmesi (telefon, telefon hattı, araç,&nbsp; vb.) ve kullanım detaylarının takibinin yapılması</li><li>İşten ayrılan personelin üzerine zimmetli bulunan hakların iadesinin alınması</li><li>İlişki kurulan devlet kurumları ile gerekli yazışmaların gerçekleştirilmesi ve süreç takibinin yapılması</li><li>Gerektiğinde satınalma süreçlerine destek olmak </li>,<h3>✨Aranan nitelikler</h3><li>Tercihen üniversite mezunu</li><li>Benzer bir pozisyonda en az 2 yıl deneyimli</li><li>Haftada 5 gün merkez ofis (Zincirlikuyu’da) çalışabilecek</li><li>Yoğun, tempolu esnek çalışma saatlerine uyum sağlayabilecek</li><li>Aktif manuel araç kullanabilen</li><li>MS Office Programlarını iyi kullanabilen</li><li>Sorumluluk sahibi, iş odaklı ve disiplinli</li><li>Etkin sözlü ve yazılı iletişim becerisine sahip</li><li>Takım çalışmasına yatkın</li><div><b style=\"font-size: 16px\">😍 Hakkımızda</b></div><div><br></div><div>En kolay ve ekonomik yoldan çiçek göndermeyi sağlamak için 2006’da kurulan <a href=\"http://ciceksepeti.com/\" class=\"postings-link\">ciceksepeti.com</a>, Türkiye genelinde 55.000+ iş ortağı ve 70’den fazla ile gönderimini sağladığı binlerce siparişle, Türkiye'deki en büyük online çiçekçidir.😎</div><div><br></div><div>Çiçeksepeti; çiçek aranjmanları, kek ve kurabiye buketlerinin yanı sıra kişiselleştirilmiş hediyeler ile müşterilerine binlerce alternatif sunarak özel günlerde ilk akla gelen e-ticaret firmasıdır. Türkiye'deki başarı hikâyemizi, LolaFlora markası ile Meksika'da sürdürürken, bir teknoloji firması olarak, hediye alanındaki pazar liderliğimizi yeni iş modellerimize de taşımak vizyonu ile emin adımlarla ilerliyoruz. 💃</div><div><br></div><div>\"İşe alım süreçlerimizde kişisel verilerinizi nasıl işlediğimize dair bilgiye çalışan adayı aydınlatma metnimizden ulaşabilirsiniz./ Please see our candidate privacy note for information on how we process your personal data during our recruitment activities.\"</div><div><a href=\"https://cdn03.ciceksepeti.com/editor/hr/Ciceksepeti_CS-Teknoloji-Calisan-Adayi_Aydinlatma-Metni-15092023.pdf\" class=\"postings-link\">https://cdn03.ciceksepeti.com/editor/hr/Ciceksepeti_CS-Teknoloji-Calisan-Adayi_Aydinlatma-Metni-15092023.pdf</a></div><div><a href=\"https://cdn03.ciceksepeti.com/editor/hr/Ciceksepeti_CS-Teknoloji-Calisan-Adayi_Aydinlatma-Metni-15092023.docx.pdf\" class=\"postings-link\">https://cdn03.ciceksepeti.com/editor/hr/Ciceksepeti_CS-Teknoloji-Calisan-Adayi_Aydinlatma-Metni-15092023.docx.pdf</a></div>","tags":"[]","pubDate":"2024-05-02 12:38:57.912","link":"https://jobs.lever.co/ciceksepeti/61090f7d-fe7c-4fec-b5f5-7f9333d7c161","savedDate":"2024-05-09 13:10:01.604","slug":"sat-n-alma-dari-ler-uzman-ciceksepeti-3056"},{"id":1943250535,"title":"Product Owner for IDS/IPS team (worldwide remote, work anywhere)","company":"CloudLinux","image":"https://pbs.twimg.com/profile_images/696718028084482050/ymY3OEPk_400x400.png","description":"<p>Imunify Security team is looking for a Product Owner for IDS/IPS team. </p><p>Imunify360 Security Suite is a product of CloudLinux Inc., the maker of the #1 OS in security and stability for hosting providers. Imunify is an innovative security solution designed specifically for shared and VPS/Dedicated servers. The automated, easy-to-use solution with the six-layer approach to security delivers comprehensive and complete attack prevention. Check out our website for more information about our Imunify Product <a href=\"https://www.imunify360.com/\" target=\"_blank\" rel=\"nofollow noreferrer noopener\" class=\"external\">https://www.imunify360.com</a></p><p><strong>What is the job:</strong></p><ul> <li>Architect, implement, and oversee cloud-based cyber security solutions utilizing Linux networking technologies.</li> <li>Manage, mentor &amp; coach, hire, and train the Senior Security analysts and IPS/IDS developers including technical hands-on.</li> <li>Lead the group to success and high results in their daily tasks and projects, drive the group for constant improvement and ownership.</li> <li>Lead, develop and maintain deep technical knowledge, skills and experience in Networking, cyber security methodologies, AppSec, Denial-of-service attacks, API threats, and more among the group.</li> <li>Lead, develop and maintain customer-orientation, professional communication skills, and problem-solving skills among the group.</li> <li>Develop, maintain, and enforce technical and operational processes and procedures.</li> <li>Lead and support technical escalations with global customers, presenting post-attack analysis, reports, insights, and findings.</li> <li>Develop and maintain close and healthy relationships with peers from the other development units, customer success, presales and other stakeholders at Imunify.</li> </ul><h3>Requirements: </h3><p><strong>What you need:&nbsp;</strong></p><ul> <li>Hands-on experience in Linux (experience with popular distributions such as CentOS and Debian).</li> <li>At least 4 years experience in cyber security, specifically in the area of network threats, AppSec, DDoS, Webapp technology.</li> <li>At least 2 years of experience in the leading position in the domain of cyber security operation (SOC, MSSP, Blue Teaming, red teaming, etc.)- significant advantage.</li> <li>Deep knowledge and practical experience in security controls such as WAFs, IDS/IPS, FWs, Load Balancers, and reverse proxies.</li> <li>Knowledge and experience with Python, Bash, C and SQL.</li> <li>Can-do attitude, customer-facing, accountable, positive attitude, time management and multitasking skills.</li> <li>Excellent presentation skills, excellent communication skills, and excellent English (speaking, reading, and writing).</li> <li>Willing to be on alert during off-work hours as necessary.</li> <li>CTF participation experience will be a plus.</li> </ul><h3>Benefits: </h3><p><strong>What's in it for you?</strong></p><ul> <li>A focus on professional development; </li> <li>Interesting and challenging projects</li> <li>Flexible working hours</li> <li>Paid one month vacation per year and unlimited sick leave</li> <li>Medical insurance reimbursement</li> <li>Co-working and gym/sports reimbursement</li> <li>The opportunity to receive a reward for the most innovative idea that the company can patent</li> </ul><p><em>By applying for this position, you agree with </em><a href=\"https://cloudlinux.com/privacy-policy\" rel=\"nofollow noreferrer noopener\" class=\"external\"><em>Cloudlinux Privacy Policy</em></a><em> and give us your consent to maintain and process your personal data with this respect. Please read our Privacy Policy for more information.</em></p>","tags":"[\"management\",\"cyber security\"]","pubDate":"2024-05-02 00:00:00.000","link":"https://apply.workable.com/cloudlinux-1/j/3A172A63D5","savedDate":"2024-05-09 13:10:01.597","slug":"product-owner-for-ids-ips-team-worldwide-remote-work-anywhere-cloudlinux-3181"},{"id":3255729944,"title":"Sales Director (Primary Real Estate)","company":"Realiste AI","image":"https://remotive.com/job/1910740/logo","description":"<p dir=\"ltr\" style=\"line-height: 1.38; background-color: #ffffff; margin-top: 0pt; margin-bottom: 0pt; padding: 0pt 0pt 15pt 0pt;\"><span style=\"background-color: transparent; color: #0d0d0d; white-space-collapse: preserve;\">Job Opportunity: Sales Director (Primary Real Estate) at Realiste AI</span></p>\n<p dir=\"ltr\" style=\"line-height: 1.38; background-color: #ffffff; margin-top: 0pt; margin-bottom: 0pt; padding: 0pt 0pt 15pt 0pt;\"><span style=\"color: #0d0d0d; background-color: transparent; font-style: normal; font-variant: normal; text-decoration: none; vertical-align: baseline; white-space: pre-wrap;\"><strong>About the Company:</strong></span></p>\n<p dir=\"ltr\" style=\"line-height: 1.38; background-color: #ffffff; margin-top: 0pt; margin-bottom: 0pt; padding: 0pt 0pt 15pt 0pt;\"><span style=\"color: #0d0d0d; background-color: transparent; font-weight: 400; font-style: normal; font-variant: normal; text-decoration: none; vertical-align: baseline; white-space: pre-wrap;\">Realiste AI is seeking a dynamic, result-oriented Sales Director to join our team and drive substantial growth and success. We are an innovative leader in the real estate investment sector, occupying a unique position globally. Our one-of-a-kind product, akin to the \"Google of real estate investments,\" facilitates seamless investments in real estate by private and institutional investors across various global cities. </span></p>\n<p dir=\"ltr\" style=\"line-height: 1.38; background-color: #ffffff; margin-top: 0pt; margin-bottom: 0pt; padding: 0pt 0pt 15pt 0pt;\"><span style=\"color: #0d0d0d; background-color: transparent; font-weight: 400; font-style: normal; font-variant: normal; text-decoration: none; vertical-align: baseline; white-space: pre-wrap;\">Leveraging advanced AI algorithms, our platform curates and ranks investment opportunities based on factors such as projected ROI, growth forecasts, infrastructure trends, and future market dynamics. </span></p>\n<p dir=\"ltr\" style=\"line-height: 1.38; background-color: #ffffff; margin-top: 0pt; margin-bottom: 0pt; padding: 0pt 0pt 15pt 0pt;\"><span style=\"color: #0d0d0d; background-color: transparent; font-weight: 400; font-style: normal; font-variant: normal; text-decoration: none; vertical-align: baseline; white-space: pre-wrap;\">Realiste AI offers a wide selection of real estate properties exclusively from institutional sellers, including developers, banks, funds, and companies. Our current focus lies primarily on residential properties, with a strong emphasis on new developments due to their suitability for online transactions. Founded in the UAE, we are expanding into new markets rapidly, with real estate data from over 110 cities worldwide and counting.</span></p>\n<p dir=\"ltr\" style=\"line-height: 1.38; background-color: #ffffff; margin-top: 0pt; margin-bottom: 15pt;\"><span style=\"color: #0d0d0d; background-color: transparent; font-style: normal; font-variant: normal; text-decoration: none; vertical-align: baseline; white-space: pre-wrap;\"><strong>Skills Required:</strong></span></p>\n<ul style=\"\">\n<li dir=\"ltr\" style=\"\">\n<p dir=\"ltr\" style=\"line-height: 1.38; background-color: #ffffff; margin-top: 0pt; margin-bottom: 0pt;\"><span style=\"color: #0d0d0d; background-color: transparent; font-weight: 400; font-style: normal; font-variant: normal; text-decoration: none; vertical-align: baseline; white-space: pre-wrap;\">Proven experience in sales(consistently earning at least $7,000 on average over the last few months).</span></p>\n</li>\n<li dir=\"ltr\" style=\"\">\n<p dir=\"ltr\" style=\"line-height: 1.38; background-color: #ffffff; margin-top: 0pt; margin-bottom: 0pt;\"><span style=\"color: #0d0d0d; background-color: transparent; font-weight: 400; font-style: normal; font-variant: normal; text-decoration: none; vertical-align: baseline; white-space: pre-wrap;\">Familiarity with investment instruments and basic terminology, including ROI, IRR, Cash-on-cash return, and others.</span></p>\n</li>\n<li dir=\"ltr\" style=\"\">\n<p dir=\"ltr\" style=\"line-height: 1.38; background-color: #ffffff; margin-top: 0pt; margin-bottom: 0pt;\"><span style=\"color: #0d0d0d; background-color: transparent; font-weight: 400; font-style: normal; font-variant: normal; text-decoration: none; vertical-align: baseline; white-space: pre-wrap;\">Experience in selling real estate or financial products is preferred but not mandatory.</span></p>\n</li>\n<li dir=\"ltr\" style=\"\">\n<p dir=\"ltr\" style=\"line-height: 1.38; background-color: #ffffff; margin-top: 0pt; margin-bottom: 12pt;\"><span style=\"color: #0d0d0d; background-color: transparent; font-weight: 400; font-style: normal; font-variant: normal; text-decoration: none; vertical-align: baseline; white-space: pre-wrap;\">Strong communication skills, both written and verbal.</span></p>\n</li>\n</ul>\n<p dir=\"ltr\" style=\"line-height: 1.38; background-color: #ffffff; margin-top: 15pt; margin-bottom: 0pt; padding: 0pt 0pt 15pt 0pt;\"><span style=\"color: #0d0d0d; background-color: transparent; font-style: normal; font-variant: normal; text-decoration: none; vertical-align: baseline; white-space: pre-wrap;\"><strong>Our Working Style:</strong></span></p>\n<p dir=\"ltr\" style=\"line-height: 1.38; background-color: #ffffff; margin-top: 0pt; margin-bottom: 0pt; padding: 0pt 0pt 15pt 0pt;\"><span style=\"color: #0d0d0d; background-color: transparent; font-weight: 400; font-style: normal; font-variant: normal; text-decoration: none; vertical-align: baseline; white-space: pre-wrap;\">At Realiste, we prioritize innovation, data-driven solutions, and customer satisfaction. We believe in giving our employees the freedom to act, experiment, and develop their own work systems. We offer efficient training to ensure you're equipped to close deals swiftly. Our team is spread across various cities worldwide, so we're accustomed to remote collaboration and communication.</span></p>\n<p dir=\"ltr\" style=\"line-height: 1.38; background-color: #ffffff; margin-top: 0pt; margin-bottom: 15pt;\"><span style=\"color: #0d0d0d; background-color: transparent; font-style: normal; font-variant: normal; text-decoration: none; vertical-align: baseline; white-space: pre-wrap;\"><strong>Company Principles and Culture:</strong></span></p>\n<ul style=\"\">\n<li dir=\"ltr\" style=\"\">\n<p dir=\"ltr\" style=\"line-height: 1.38; background-color: #ffffff; margin-top: 0pt; margin-bottom: 0pt;\"><span style=\"color: #0d0d0d; background-color: transparent; font-weight: 400; font-style: normal; font-variant: normal; text-decoration: none; vertical-align: baseline; white-space: pre-wrap;\">Our clients come first. We always prioritize their interests over ours. We only win when our clients win. If our clients lose, we lose too.</span></p>\n</li>\n<li dir=\"ltr\" style=\"\">\n<p dir=\"ltr\" style=\"line-height: 1.38; background-color: #ffffff; margin-top: 0pt; margin-bottom: 0pt;\"><span style=\"color: #0d0d0d; background-color: transparent; font-weight: 400; font-style: normal; font-variant: normal; text-decoration: none; vertical-align: baseline; white-space: pre-wrap;\">Our AI provides our clients with an advantage over traditional investment methods. We aim to double our clients' earnings while minimizing risks.</span></p>\n</li>\n<li dir=\"ltr\" style=\"\">\n<p dir=\"ltr\" style=\"line-height: 1.38; background-color: #ffffff; margin-top: 0pt; margin-bottom: 0pt;\"><span style=\"color: #0d0d0d; background-color: transparent; font-weight: 400; font-style: normal; font-variant: normal; text-decoration: none; vertical-align: baseline; white-space: pre-wrap;\">Always act in the company's interests, not your personal interests.</span></p>\n</li>\n<li dir=\"ltr\" style=\"\">\n<p dir=\"ltr\" style=\"line-height: 1.38; background-color: #ffffff; margin-top: 0pt; margin-bottom: 0pt;\"><span style=\"color: #0d0d0d; background-color: transparent; font-weight: 400; font-style: normal; font-variant: normal; text-decoration: none; vertical-align: baseline; white-space: pre-wrap;\">Culture is important. Avoid working with unpleasant people - they won't take responsibility for their words and actions.</span></p>\n</li>\n<li dir=\"ltr\" style=\"\">\n<p dir=\"ltr\" style=\"line-height: 1.38; background-color: #ffffff; margin-top: 0pt; margin-bottom: 0pt;\"><span style=\"color: #0d0d0d; background-color: transparent; font-weight: 400; font-style: normal; font-variant: normal; text-decoration: none; vertical-align: baseline; white-space: pre-wrap;\">Always make sure the unit economics are positive.</span></p>\n</li>\n<li dir=\"ltr\" style=\"\">\n<p dir=\"ltr\" style=\"line-height: 1.38; background-color: #ffffff; margin-top: 0pt; margin-bottom: 0pt;\"><span style=\"color: #0d0d0d; background-color: transparent; font-weight: 400; font-style: normal; font-variant: normal; text-decoration: none; vertical-align: baseline; white-space: pre-wrap;\">Take action to prevent downtime.</span></p>\n</li>\n<li dir=\"ltr\" style=\"\">\n<p dir=\"ltr\" style=\"line-height: 1.38; background-color: #ffffff; margin-top: 0pt; margin-bottom: 0pt;\"><span style=\"color: #0d0d0d; background-color: transparent; font-weight: 400; font-style: normal; font-variant: normal; text-decoration: none; vertical-align: baseline; white-space: pre-wrap;\">We treat everyone equally, regardless of age, religion, orientation, nationality, or political views.</span></p>\n</li>\n<li dir=\"ltr\" style=\"\">\n<p dir=\"ltr\" style=\"line-height: 1.38; background-color: #ffffff; margin-top: 0pt; margin-bottom: 12pt;\"><span style=\"color: #0d0d0d; background-color: transparent; font-weight: 400; font-style: normal; font-variant: normal; text-decoration: none; vertical-align: baseline; white-space: pre-wrap;\">Every employee must be a shareholder. Share distribution is based on excellent work, and employees can also buy shares at a special price.</span></p>\n</li>\n</ul>\n<p dir=\"ltr\" style=\"line-height: 1.38; background-color: #ffffff; margin-top: 15pt; margin-bottom: 15pt;\"><span style=\"color: #0d0d0d; background-color: transparent; font-style: normal; font-variant: normal; text-decoration: none; vertical-align: baseline; white-space: pre-wrap;\"><strong>Additional Information:</strong></span></p>\n<ul style=\"\">\n<li dir=\"ltr\" style=\"\">\n<p dir=\"ltr\" style=\"line-height: 1.38; background-color: #ffffff; margin-top: 0pt; margin-bottom: 0pt;\"><span style=\"color: #0d0d0d; background-color: transparent; font-weight: 400; font-style: normal; font-variant: normal; text-decoration: none; vertical-align: baseline; white-space: pre-wrap;\">Enhanced access to the Realiste platform.</span></p>\n</li>\n<li dir=\"ltr\" style=\"\">\n<p dir=\"ltr\" style=\"line-height: 1.38; background-color: #ffffff; margin-top: 0pt; margin-bottom: 0pt;\"><span style=\"color: #0d0d0d; background-color: transparent; font-weight: 400; font-style: normal; font-variant: normal; text-decoration: none; vertical-align: baseline; white-space: pre-wrap;\">Opportunity to work from anywhere in the world, with potential relocation to Dubai.</span></p>\n</li>\n<li dir=\"ltr\" style=\"\">\n<p dir=\"ltr\" style=\"line-height: 1.38; background-color: #ffffff; margin-top: 0pt; margin-bottom: 12pt;\"><span style=\"color: #0d0d0d; background-color: transparent; font-weight: 400; font-style: normal; font-variant: normal; text-decoration: none; vertical-align: baseline; white-space: pre-wrap;\">Joining a movement to reshape the real estate industry. </span></p>\n</li>\n</ul>\n<p style=\"font-stretch: normal; line-height: normal;\"><span style=\"font-weight: 600; color: #000000; letter-spacing: 0.75px;\">How to apply:<br></span><br>1. Apply for this position.</p>\n<p style=\"font-stretch: normal; line-height: normal;\">2. Once you are referred to the onboarding page, complete the form by providing the required information and complete the onboarding tasks. Ensure that you fill in all the necessary fields accurately.</p>\n<img src=\"https://remotive.com/job/track/1910740/blank.gif?source=public_api\" alt=\"\"/>","tags":"[\"AI/ML\",\"onboarding\",\"infrastructure\"]","pubDate":"2024-05-01 18:42:05.000","link":"https://remotive.com/remote-jobs/sales-business/sales-director-primary-real-estate-1910740","savedDate":"2024-05-09 13:10:01.593","slug":"sales-director-primary-real-estate-realiste-ai-671"},{"id":1561934987,"title":"Content Writer","company":"ProWriterSites","image":"https://remotive.com/job/1910753/logo","description":"<p class=\"p1\" style=\"font-variant-numeric: normal; font-variant-east-asian: normal; font-variant-alternates: normal; font-kerning: auto; font-optical-sizing: auto; font-feature-settings: normal; font-variation-settings: normal; font-variant-position: normal; font-stretch: normal; line-height: normal; color: #000000;\">ProWriterSites is a highly-rated professional portfolio design and hosting service catering to freelancers. Our mission is to make professional portfolio websites easy and affordable to all freelancers. We are looking for a creative and skilled copywriter who will take the time to truly understand our brand and overarching messaging, and then communicate this in a compelling way that resonates with our target audience.<span class=\"Apple-converted-space\"> </span></p>\n<p class=\"p2\" style=\"font-variant-numeric: normal; font-variant-east-asian: normal; font-variant-alternates: normal; font-kerning: auto; font-optical-sizing: auto; font-feature-settings: normal; font-variation-settings: normal; font-variant-position: normal; font-stretch: normal; line-height: normal; min-height: 15px; color: #000000;\"> </p>\n<p class=\"p1\" style=\"font-variant-numeric: normal; font-variant-east-asian: normal; font-variant-alternates: normal; font-kerning: auto; font-optical-sizing: auto; font-feature-settings: normal; font-variation-settings: normal; font-variant-position: normal; font-stretch: normal; line-height: normal; color: #000000;\">Will you help us help thousands of freelancers elevate their careers and online presence?<span class=\"Apple-converted-space\"> </span></p>\n<p class=\"p2\" style=\"font-variant-numeric: normal; font-variant-east-asian: normal; font-variant-alternates: normal; font-kerning: auto; font-optical-sizing: auto; font-feature-settings: normal; font-variation-settings: normal; font-variant-position: normal; font-stretch: normal; line-height: normal; min-height: 15px; color: #000000;\"> </p>\n<p class=\"p1\" style=\"font-variant-numeric: normal; font-variant-east-asian: normal; font-variant-alternates: normal; font-kerning: auto; font-optical-sizing: auto; font-feature-settings: normal; font-variation-settings: normal; font-variant-position: normal; font-stretch: normal; line-height: normal; color: #000000;\"><strong>About the Role:</strong></p>\n<p class=\"p2\" style=\"font-variant-numeric: normal; font-variant-east-asian: normal; font-variant-alternates: normal; font-kerning: auto; font-optical-sizing: auto; font-feature-settings: normal; font-variation-settings: normal; font-variant-position: normal; font-stretch: normal; line-height: normal; min-height: 15px; color: #000000;\"> </p>\n<p class=\"p1\" style=\"font-variant-numeric: normal; font-variant-east-asian: normal; font-variant-alternates: normal; font-kerning: auto; font-optical-sizing: auto; font-feature-settings: normal; font-variation-settings: normal; font-variant-position: normal; font-stretch: normal; line-height: normal; color: #000000;\">As a content writer, you'll play a pivotal role in shaping the voice and messaging across our platform and marketing channels. Your words will inspire freelancers to dream big and trust in our service to showcase their talents. This role is ideal for someone who thrives in a creative, fast-paced environment and is passionate about storytelling, branding, and the freelance lifestyle.</p>\n<p class=\"p2\" style=\"font-variant-numeric: normal; font-variant-east-asian: normal; font-variant-alternates: normal; font-kerning: auto; font-optical-sizing: auto; font-feature-settings: normal; font-variation-settings: normal; font-variant-position: normal; font-stretch: normal; line-height: normal; min-height: 15px; color: #000000;\"> </p>\n<p class=\"p1\" style=\"font-variant-numeric: normal; font-variant-east-asian: normal; font-variant-alternates: normal; font-kerning: auto; font-optical-sizing: auto; font-feature-settings: normal; font-variation-settings: normal; font-variant-position: normal; font-stretch: normal; line-height: normal; color: #000000;\"><strong>Key Responsibilities:</strong></p>\n<p class=\"p2\" style=\"font-variant-numeric: normal; font-variant-east-asian: normal; font-variant-alternates: normal; font-kerning: auto; font-optical-sizing: auto; font-feature-settings: normal; font-variation-settings: normal; font-variant-position: normal; font-stretch: normal; line-height: normal; min-height: 15px; color: #000000;\"> </p>\n<p class=\"p1\" style=\"font-variant-numeric: normal; font-variant-east-asian: normal; font-variant-alternates: normal; font-kerning: auto; font-optical-sizing: auto; font-feature-settings: normal; font-variation-settings: normal; font-variant-position: normal; font-stretch: normal; line-height: normal; color: #000000;\">- Develop, write, and edit content for website pages, blog posts, email campaigns, and social media that resonates with our target audience of freelance professionals.</p>\n<p class=\"p1\" style=\"font-variant-numeric: normal; font-variant-east-asian: normal; font-variant-alternates: normal; font-kerning: auto; font-optical-sizing: auto; font-feature-settings: normal; font-variation-settings: normal; font-variant-position: normal; font-stretch: normal; line-height: normal; color: #000000;\">- Collaborate with the marketing and design teams to craft compelling narratives that enhance our branding and drive user engagement.</p>\n<p class=\"p1\" style=\"font-variant-numeric: normal; font-variant-east-asian: normal; font-variant-alternates: normal; font-kerning: auto; font-optical-sizing: auto; font-feature-settings: normal; font-variation-settings: normal; font-variant-position: normal; font-stretch: normal; line-height: normal; color: #000000;\">- Conduct market research to stay on top of industry trends and ensure our content is fresh, relevant, and impactful.</p>\n<p class=\"p1\" style=\"font-variant-numeric: normal; font-variant-east-asian: normal; font-variant-alternates: normal; font-kerning: auto; font-optical-sizing: auto; font-feature-settings: normal; font-variation-settings: normal; font-variant-position: normal; font-stretch: normal; line-height: normal; color: #000000;\">- Assist in developing content strategies that align with our business goals and increase our market presence.</p>\n<p class=\"p1\" style=\"font-variant-numeric: normal; font-variant-east-asian: normal; font-variant-alternates: normal; font-kerning: auto; font-optical-sizing: auto; font-feature-settings: normal; font-variation-settings: normal; font-variant-position: normal; font-stretch: normal; line-height: normal; color: #000000;\">- Provide creative input on visual and text-based campaigns.</p>\n<p class=\"p1\" style=\"font-variant-numeric: normal; font-variant-east-asian: normal; font-variant-alternates: normal; font-kerning: auto; font-optical-sizing: auto; font-feature-settings: normal; font-variation-settings: normal; font-variant-position: normal; font-stretch: normal; line-height: normal; color: #000000;\">- Edit and proofread content with a keen eye for detail, ensuring high-quality and consistency across all platforms.</p>\n<p class=\"p2\" style=\"font-variant-numeric: normal; font-variant-east-asian: normal; font-variant-alternates: normal; font-kerning: auto; font-optical-sizing: auto; font-feature-settings: normal; font-variation-settings: normal; font-variant-position: normal; font-stretch: normal; line-height: normal; min-height: 15px; color: #000000;\"> </p>\n<p class=\"p1\" style=\"font-variant-numeric: normal; font-variant-east-asian: normal; font-variant-alternates: normal; font-kerning: auto; font-optical-sizing: auto; font-feature-settings: normal; font-variation-settings: normal; font-variant-position: normal; font-stretch: normal; line-height: normal; color: #000000;\"><strong>Preferred Experience:</strong></p>\n<p class=\"p2\" style=\"font-variant-numeric: normal; font-variant-east-asian: normal; font-variant-alternates: normal; font-kerning: auto; font-optical-sizing: auto; font-feature-settings: normal; font-variation-settings: normal; font-variant-position: normal; font-stretch: normal; line-height: normal; min-height: 15px; color: #000000;\"> </p>\n<p class=\"p1\" style=\"font-variant-numeric: normal; font-variant-east-asian: normal; font-variant-alternates: normal; font-kerning: auto; font-optical-sizing: auto; font-feature-settings: normal; font-variation-settings: normal; font-variant-position: normal; font-stretch: normal; line-height: normal; color: #000000;\">- Strong portfolio of written work showcasing versatility across various digital platforms.</p>\n<p class=\"p1\" style=\"font-variant-numeric: normal; font-variant-east-asian: normal; font-variant-alternates: normal; font-kerning: auto; font-optical-sizing: auto; font-feature-settings: normal; font-variation-settings: normal; font-variant-position: normal; font-stretch: normal; line-height: normal; color: #000000;\">- Excellent command of the English language, including grammar, spelling, and stylistic flair.</p>\n<p class=\"p1\" style=\"font-variant-numeric: normal; font-variant-east-asian: normal; font-variant-alternates: normal; font-kerning: auto; font-optical-sizing: auto; font-feature-settings: normal; font-variation-settings: normal; font-variant-position: normal; font-stretch: normal; line-height: normal; color: #000000;\">- Familiarity with the freelance industry and its challenges and opportunities.</p>\n<p class=\"p2\" style=\"font-variant-numeric: normal; font-variant-east-asian: normal; font-variant-alternates: normal; font-kerning: auto; font-optical-sizing: auto; font-feature-settings: normal; font-variation-settings: normal; font-variant-position: normal; font-stretch: normal; line-height: normal; min-height: 15px; color: #000000;\"> </p>\n<p class=\"p1\" style=\"font-variant-numeric: normal; font-variant-east-asian: normal; font-variant-alternates: normal; font-kerning: auto; font-optical-sizing: auto; font-feature-settings: normal; font-variation-settings: normal; font-variant-position: normal; font-stretch: normal; line-height: normal; color: #000000;\"><strong>What We Offer:</strong></p>\n<p class=\"p2\" style=\"font-variant-numeric: normal; font-variant-east-asian: normal; font-variant-alternates: normal; font-kerning: auto; font-optical-sizing: auto; font-feature-settings: normal; font-variation-settings: normal; font-variant-position: normal; font-stretch: normal; line-height: normal; min-height: 15px; color: #000000;\"> </p>\n<p class=\"p1\" style=\"font-variant-numeric: normal; font-variant-east-asian: normal; font-variant-alternates: normal; font-kerning: auto; font-optical-sizing: auto; font-feature-settings: normal; font-variation-settings: normal; font-variant-position: normal; font-stretch: normal; line-height: normal; color: #000000;\">- A fully remote role with flexible working hours to suit your lifestyle.</p>\n<p class=\"p1\" style=\"font-variant-numeric: normal; font-variant-east-asian: normal; font-variant-alternates: normal; font-kerning: auto; font-optical-sizing: auto; font-feature-settings: normal; font-variation-settings: normal; font-variant-position: normal; font-stretch: normal; line-height: normal; color: #000000;\">- Competitive salary and performance-based bonuses.</p>\n<p class=\"p1\" style=\"font-variant-numeric: normal; font-variant-east-asian: normal; font-variant-alternates: normal; font-kerning: auto; font-optical-sizing: auto; font-feature-settings: normal; font-variation-settings: normal; font-variant-position: normal; font-stretch: normal; line-height: normal; color: #000000;\">- Opportunities for professional growth and creative freedom.</p>\n<p class=\"p1\" style=\"font-variant-numeric: normal; font-variant-east-asian: normal; font-variant-alternates: normal; font-kerning: auto; font-optical-sizing: auto; font-feature-settings: normal; font-variation-settings: normal; font-variant-position: normal; font-stretch: normal; line-height: normal; color: #000000;\">- A supportive and collaborative work environment that values new ideas and innovation.</p>\n<p class=\"p1\" style=\"font-variant-numeric: normal; font-variant-east-asian: normal; font-variant-alternates: normal; font-kerning: auto; font-optical-sizing: auto; font-feature-settings: normal; font-variation-settings: normal; font-variant-position: normal; font-stretch: normal; line-height: normal; color: #000000;\">- Regular team meet-ups and creative brainstorming sessions online.</p>\n<p class=\"p2\" style=\"font-variant-numeric: normal; font-variant-east-asian: normal; font-variant-alternates: normal; font-kerning: auto; font-optical-sizing: auto; font-feature-settings: normal; font-variation-settings: normal; font-variant-position: normal; font-stretch: normal; line-height: normal; min-height: 15px; color: #000000;\"> </p>\n<p class=\"p1\" style=\"font-variant-numeric: normal; font-variant-east-asian: normal; font-variant-alternates: normal; font-kerning: auto; font-optical-sizing: auto; font-feature-settings: normal; font-variation-settings: normal; font-variant-position: normal; font-stretch: normal; line-height: normal; color: #000000;\"><strong>Compensation:</strong></p>\n<p class=\"p2\" style=\"font-variant-numeric: normal; font-variant-east-asian: normal; font-variant-alternates: normal; font-kerning: auto; font-optical-sizing: auto; font-feature-settings: normal; font-variation-settings: normal; font-variant-position: normal; font-stretch: normal; line-height: normal; min-height: 15px; color: #000000;\"> </p>\n<p class=\"p1\" style=\"font-variant-numeric: normal; font-variant-east-asian: normal; font-variant-alternates: normal; font-kerning: auto; font-optical-sizing: auto; font-feature-settings: normal; font-variation-settings: normal; font-variant-position: normal; font-stretch: normal; line-height: normal; color: #000000;\">We would like to engage with a skilled content writer on a per-project or hourly basis of $35-40 per hour, however, our ultimate goal is to bring on a full-time copywriter for a $75K to $90K annual salaried role. </p>\n<p class=\"p2\" style=\"font-variant-numeric: normal; font-variant-east-asian: normal; font-variant-alternates: normal; font-kerning: auto; font-optical-sizing: auto; font-feature-settings: normal; font-variation-settings: normal; font-variant-position: normal; font-stretch: normal; line-height: normal; min-height: 15px; color: #000000;\"> </p>\n<p class=\"p1\" style=\"font-variant-numeric: normal; font-variant-east-asian: normal; font-variant-alternates: normal; font-kerning: auto; font-optical-sizing: auto; font-feature-settings: normal; font-variation-settings: normal; font-variant-position: normal; font-stretch: normal; line-height: normal; color: #000000;\"><strong>How to Apply:</strong></p>\n<p class=\"p2\" style=\"font-variant-numeric: normal; font-variant-east-asian: normal; font-variant-alternates: normal; font-kerning: auto; font-optical-sizing: auto; font-feature-settings: normal; font-variation-settings: normal; font-variant-position: normal; font-stretch: normal; line-height: normal; min-height: 15px; color: #000000;\"> </p>\n<p class=\"p1\" style=\"font-variant-numeric: normal; font-variant-east-asian: normal; font-variant-alternates: normal; font-kerning: auto; font-optical-sizing: auto; font-feature-settings: normal; font-variation-settings: normal; font-variant-position: normal; font-stretch: normal; line-height: normal; color: #000000;\">To apply for this position, please visit https://prowritersites.com/copywriter-role</p>\n<p class=\"p2\" style=\"font-variant-numeric: normal; font-variant-east-asian: normal; font-variant-alternates: normal; font-kerning: auto; font-optical-sizing: auto; font-feature-settings: normal; font-variation-settings: normal; font-variant-position: normal; font-stretch: normal; line-height: normal; min-height: 15px; color: #000000;\"> </p>\n<p class=\"p1\" style=\"font-variant-numeric: normal; font-variant-east-asian: normal; font-variant-alternates: normal; font-kerning: auto; font-optical-sizing: auto; font-feature-settings: normal; font-variation-settings: normal; font-variant-position: normal; font-stretch: normal; line-height: normal; color: #000000;\">We may only follow up with applicants who we are strongly considering for this position.</p>\n<img src=\"https://remotive.com/job/track/1910753/blank.gif?source=public_api\" alt=\"\"/>","tags":"[\"social media\",\"research\",\"market research\",\"brand design\"]","pubDate":"2024-05-01 18:37:28.000","link":"https://remotive.com/remote-jobs/writing/content-writer-1910753","savedDate":"2024-05-09 13:10:01.593","slug":"content-writer-prowritersites-2461"},{"id":2318737191,"title":"Operations Associate (Remote)","company":"Empower","image":"https://lever-client-logos.s3.us-west-2.amazonaws.com/2e1a369c-b58f-41ac-8d86-4b0a77695e68-1687915522032.png","description":"<div><b style=\"font-size: 24px\">EMPOWER OVERVIEW</b></div><div><br></div><div><a href=\"http://empower.me/\" style=\"font-size: 11pt\" class=\"postings-link\">Empower</a><span style=\"font-size: 11pt\">&nbsp;</span><span style=\"font-size: 10.5pt\">is a financial technology company on a mission to expand access to fair credit and give anyone in the world the opportunity to improve their financial security and mobility. Our vision is to underwrite the next billion people in the world using alternative data and machine learning to assess financial responsibility more thoughtfully and equitably. Through innovative credit products, offered in a user-friendly mobile experience, we’re making credit more accessible and inclusive and providing more people the chance they deserve to participate in our financial system.</span></div><div><br></div><div>Empower is backed by Sequoia Capital, Blisce, and Icon Ventures. Are we the next great place to grow your impact and accelerate your career? We think so:</div><div>Inc. ranked Empower #56 in the 2023 Inc. 5000 list of the fastest-growing private companies in the US (#55 in 2022). Forbes put Empower on its 2023 list of America's Best Startup Employers. Fast Company recognized the new Empower Thrive line of credit in their 2022 list of the Next Big Things in Tech. </div><div><br></div><div><b style=\"font-size: 18px\">THE EMPOWER WAY</b></div><div><b>Great Expectations</b>: We come up with bold, audacious goals for ourselves and go all out for impact</div><div><b>Owner Mindset</b>: We give every employee latitude to act independently, make smart choices, and move the business forward</div><div><b>Spirited Debate</b>: We love skeptics and seek counter opinions to challenge our personal assumptions and expand our view</div><div><b>Customer Obsession: </b>We listen to understand, empathize, and create a memorable, rewarding experience for our community</div><div><b>Inclusive Collaboration</b>: We believe diverse teams make the best decisions, and we strive to give diverse voices a seat at the table</div><div>N<b>o Jerks Allowed</b>: We value our relationships and take the time to build trust and connection and communicate respectfully</div><div><b>&nbsp;</b></div><div><b style=\"font-size: 18px\">&nbsp;</b></div><div><b style=\"font-size: 18px\">WHAT EMPOWER OFFERS</b></div><div>Competitive salary</div><div>Generous equity package</div><div>Full healthcare and dental benefits</div><div>Technology&nbsp; expense reimbursement</div><div>Work&nbsp; from anywhere</div><div><br></div><div><b style=\"font-size: 18px\">JOB DESCRIPTION</b></div><div><span style=\"font-size: 11pt\">In this role, you will contribute to Empower’s back office operations for the Thrive line of credit product. You will work alongside a team of dedicated operations specialists responsible for completing fraud investigations, responding to disputed transactions, KYC reviews and other internal procedures.&nbsp;The ideal candidate exhibits exceptional competency in managing various aspects of the workload while ensuring adherence to quality standards and regulatory requirements.</span></div><div><br></div><div>Travel for company offsites is expected at a minimum 2 times a year. </div><div><br></div><h3>Key Responsibilities</h3><li>Review user-submitted information &amp; documentation for inconsistencies</li><li>Regularly report on/escalate situations that require higher-level review</li><li>Actively discuss and provide your thoughts &amp; recommendations, both internally and with our partner, on individual user situations</li><li>Conduct investigations and gather evidence against users and high-risk dispute cases</li><li>Correspond with users via email (and occasionally, via phone)</li>,<h3>Candidate Qualifications</h3><li>Motivated by Empower’s mission and determined to create a personable and meaningful experience for our customers</li><li>BA/BS degree or 2+ years equivalent experience in financial services operations</li><li>Direct experience with BSA/AML/KYC programsFamiliarity with banking regulations and payment processes (e.g.s Reg E, Reg Z, Reg B, UDAAP, FCRA)</li><li>Specific experience with a comparable FinTech is a plus</li><li>Demonstrated passion for the customer experience and the ability to solve problems with a short turnaround time for customers with a high level of empathy</li><li>Ability to adapt rapidly to changing work environments, work priorities, and organizational needs</li><li>Excellent verbal and written communication skills with the ability to explain complex topics in easily understood, concise language</li><div><br></div><div>At Empower, we hire for people that push themselves to understand others and seek out ways to challenge their personal assumptions. Our hope is that by fostering such an environment, we strengthen our business and relationships by putting people first. We are committed to building a diverse, inclusive, and equitable workspace where everyone (regardless of age, education, ethnicity, gender, sexual orientation, or any personal characteristics) feels like they belong. Even if your experience doesn’t exactly match up to our job description, you should feel empowered to apply regardless!&nbsp;</div>","tags":"[]","pubDate":"2024-05-01 18:01:03.323","link":"https://jobs.lever.co/empower.me/63b9f997-0973-4063-8910-d3b3507431ff","savedDate":"2024-05-09 13:10:01.600","slug":"operations-associate-remote-empower-3996"},{"id":8520711385,"title":"Social Media and Influencer Marketing Specialist (France)","company":"Airalo","image":"https://lever-client-logos.s3.us-west-2.amazonaws.com/55028a36-609c-479c-9553-d4689ff2dd8c-1669620566663.png","description":"<div>Airalo is seeking a talented and highly motivated <b>Social Media and Influencer Marketing Specialist</b> to join our European marketing team and grow the <b>French market</b>.</div><div>You will be responsible for guiding the strategy and development of our entire social media ecosystem in your markets and you will develop and execute influencer marketing campaigns to raise brand awareness, drive user engagement and boost conversions.</div><div>This role offers an exciting opportunity to work with some of the most influential voices in the travel and tech industry.</div><h3>Responsibilities include but are not limited to:</h3><li><b>Strategy Development and Campaign Planning:</b> Brainstorm, develop and execute end-to-end influencer marketing campaigns aligned with Airalo's goals and target audience.</li><li><b>Identify and Recruit Influencers:</b> Partner with relevant <b>French</b> influencers, content creators and/or agencies to create authentic and engaging content that showcases Airalo's products.</li><li><b>Social Media Strategy:</b> Develop and execute an effective social media strategy tailored to the French market to increase brand awareness, engagement, and lead generation.</li><li><b>Community Engagement:</b> Monitor and actively engage with the Airalo community on social media platforms, respond to comments, questions, and feedback promptly, and build positive relationships with followers.</li><li><b>Performance Analysis and Reporting:</b> Monitor, analyze performance and prepare reports on the ROI and effectiveness of influencer marketing efforts, including KPIs and metrics</li><li><b>Budget Management:</b> Effectively manage the budget allocated for influencer marketing campaigns, ensuring efficient use of resources.</li><li><b>Compliance and Contracts:</b> Ensure that influencer partnerships comply with legal regulations and company policies. Manage influencer contracts and negotiations.</li><li><b>Crisis Management:</b> Handle potential social media crises effectively, maintain a positive brand image, and address customer concerns professionally. And ensure compliance with local laws (e.g., copyright and data protection)</li><li><b>Stay Up-to-Date:</b> Stay informed about industry trends, emerging influencers, and new platforms to continuously adapt and enhance Airalo's influencer marketing strategies.</li>,<h3>Must-haves</h3><li>At least 3+ years of experience in a similar role, even better if in the travel industry. Strong experience with <b>social media and influencer marketing</b> is a must</li><li>Knowledge of the <b>French market</b>, fluency in English, impeccable verbal and written communication skills</li><li>Extensive experience in brand management, content, social media, influencer and market insight with an in-depth understanding of the social and digital space</li><li>Excellent knowledge of Instagram/Facebook, TikTok, Youtube, Twitter, Telegram, Linkedin, Snapchat (and other eventual emerging social media) and abreast of social media best practices, and regional, and global trends</li><li>Owning a project that is not strictly part of your job description excites you and you take it as an opportunity to learn something new</li><li>Superior internal &amp; external communication &amp; cross-functional stakeholder management skills</li><li>Enjoying and excelling at handling multiple projects simultaneously in a matrix &amp; complex environment</li><li>Good time management with an eye for perfection &amp; a strong operational background</li>,<h3>Good to have</h3><li>Prior experience in the tech, travel, or telecommunications industry</li><li>A network of French influencers or influencers agencies you already worked with</li><li>Certificates and/or courses in digital marketing</li><div><span style=\"font-size: 16px\">If you are interested in this position, please</span><b style=\"font-size: 16px\">&nbsp;apply via the link.</b></div>","tags":"[\"management\",\"legal\",\"aws\"]","pubDate":"2024-05-01 14:26:17.259","link":"https://jobs.lever.co/airalo/c0309aa2-d92f-45dc-be97-db2b1c099fa6","savedDate":"2024-05-09 13:10:01.603","slug":"social-media-and-influencer-marketing-specialist-france-airalo-1761"},{"id":4400034231,"title":"Social Media and Influencer Marketing Specialist (Germany & Austria)","company":"Airalo","image":"https://lever-client-logos.s3.us-west-2.amazonaws.com/55028a36-609c-479c-9553-d4689ff2dd8c-1669620566663.png","description":"<div>Airalo is seeking a talented and highly motivated Social Media and Influencer Marketing Specialist to join our European marketing team and grow the markets in Germany and Austria.</div><div>You will be responsible for guiding the strategy and development of our entire social media ecosystem in your markets and you will develop and execute influencer marketing campaigns to raise brand awareness, drive user engagement and boost conversions.</div><div>This role offers an exciting opportunity to work with some of the most influential voices in the travel and tech industry.</div><h3>Responsibilities include but are not limited to:</h3><li><b>Strategy Development and Campaign Planning:</b> Brainstorm, develop and execute end-to-end influencer marketing campaigns aligned with Airalo's goals and target audience.</li><li><b>Identify and Recruit Influencers:</b> Partner with relevant <b>German/Austrian</b> influencers, content creators and/or agencies to create authentic and engaging content that showcases Airalo's products.</li><li><b>Social Media Strategy:</b> Develop and execute an effective social media strategy tailored to the German and Austrian markets to increase brand awareness, engagement, and lead generation.</li><li><b>Community Engagement:</b> Monitor and actively engage with the Airalo community on social media platforms, respond to comments, questions, and feedback promptly, and build positive relationships with followers.</li><li><b>Performance Analysis and Reporting:</b> Monitor, analyze performance and prepare reports on the ROI and effectiveness of influencer marketing efforts, including KPIs and metrics</li><li><b>Budget Management:</b> Effectively manage the budget allocated for influencer marketing campaigns, ensuring efficient use of resources.</li><li><b>Compliance and Contracts:</b> Ensure that influencer partnerships comply with legal regulations and company policies. Manage influencer contracts and negotiations.</li><li><b>Crisis Management:</b> Handle potential social media crises effectively, maintain a positive brand image, and address customer concerns professionally. And ensure compliance with local laws (e.g., copyright and data protection)</li><li><b>Stay Up-to-Date:</b> Stay informed about industry trends, emerging influencers, and new platforms to continuously adapt and enhance Airalo's influencer marketing strategies.</li>,<h3>Must-haves</h3><li>At least 3+ years of experience in a similar role, even better if in the travel industry. Strong experience with <b>social media and influencer marketing</b> is a must</li><li>Knowledge of the <b>German and Austrian markets</b>, fluency in English, impeccable verbal and written communication skills</li><li>Extensive experience in brand management, content, social media, influencer and market insight with an in-depth understanding of the social and digital space</li><li>Excellent knowledge of Instagram/Facebook, TikTok, Youtube, Twitter, Telegram, Linkedin, Snapchat (and other eventual emerging social media) and abreast of social media best practices, and regional, and global trends</li><li>Owning a project that is not strictly part of your job description excites you and you take it as an opportunity to learn something new</li><li>Superior internal &amp; external communication &amp; cross-functional stakeholder management skills</li><li>Enjoying and excelling at handling multiple projects simultaneously in a matrix &amp; complex environment</li><li>Good time management with an eye for perfection &amp; a strong operational background</li>,<h3>Good to have</h3><li>Prior experience in the tech, travel, or telecommunications industry</li><li>A network of German/Austrian influencers or influencers agencies you already worked with</li><li>Certificates and/or courses in digital marketing</li><div><span style=\"font-size: 16px\">If you are interested in this position, please</span><b style=\"font-size: 16px\">&nbsp;apply via the link.</b></div>","tags":"[\"management\",\"legal\",\"aws\"]","pubDate":"2024-05-01 14:07:47.561","link":"https://jobs.lever.co/airalo/002092e4-9469-4617-a36c-56ff04de8ce3","savedDate":"2024-05-09 13:10:01.603","slug":"social-media-and-influencer-marketing-specialist-germany-austria-airalo-4104"},{"id":7422959698,"title":"Social Media and Influencer Marketing Specialist (Ukraine)","company":"Airalo","image":"https://lever-client-logos.s3.us-west-2.amazonaws.com/55028a36-609c-479c-9553-d4689ff2dd8c-1669620566663.png","description":"<div>Airalo is seeking a talented and highly motivated Social Media and Influencer Marketing Specialist to join our European marketing team and grow our Ukranian markets.</div><div>You will be responsible for guiding the strategy and development of our entire social media ecosystem in your markets and you will develop and execute influencer marketing campaigns to raise brand awareness, drive user engagement and boost conversions.</div><div>This role offers an exciting opportunity to work with some of the most influential voices in the travel and tech industry.</div><h3>Responsibilities include but are not limited to:</h3><li><b>Strategy Development and Campaign Planning:</b> Brainstorm, develop and execute end-to-end influencer marketing campaigns aligned with Airalo's goals and target audience.</li><li><b>Identify and Recruit Influencers:</b> Partner with relevant <b>Ukranian</b> influencers, content creators and/or agencies to create authentic and engaging content that showcases Airalo's products.</li><li><b>Social Media Strategy:</b> Develop and execute an effective social media strategy tailored to the Ukranian market to increase brand awareness, engagement, and lead generation.</li><li><b>Community Engagement:</b> Monitor and actively engage with the Airalo community on social media platforms, respond to comments, questions, and feedback promptly, and build positive relationships with followers.</li><li><b>Performance Analysis and Reporting:</b> Monitor, analyze performance and prepare reports on the ROI and effectiveness of influencer marketing efforts, including KPIs and metrics</li><li><b>Budget Management:</b> Effectively manage the budget allocated for influencer marketing campaigns, ensuring efficient use of resources.</li><li><b>Compliance and Contracts:</b> Ensure that influencer partnerships comply with legal regulations and company policies. Manage influencer contracts and negotiations.</li><li><b>Crisis Management:</b> Handle potential social media crises effectively, maintain a positive brand image, and address customer concerns professionally. And ensure compliance with local laws (e.g., copyright and data protection)</li><li><b>Stay Up-to-Date:</b> Stay informed about industry trends, emerging influencers, and new platforms to continuously adapt and enhance Airalo's influencer marketing strategies.</li>,<h3>Must-haves</h3><li>At least 3+ years of experience in a similar role, even better if in the travel industry. Strong experience with social media and influencer marketing is a must</li><li>Knowledge of the Ukranian market, fluency in English, impeccable verbal and written communication skills</li><li>Extensive experience in brand management, content, social media, influencer and market insight with an in-depth understanding of the social and digital space</li><li>Excellent knowledge of Instagram/Facebook, TikTok, Youtube, Twitter, Telegram, Linkedin, Snapchat (and other eventual emerging social media) and abreast of social media best practices, and regional, and global trends</li><li>Owning a project that is not strictly part of your job description excites you and you take it as an opportunity to learn something new</li><li>Superior internal &amp; external communication &amp; cross-functional stakeholder management skills</li><li>Enjoying and excelling at handling multiple projects simultaneously in a matrix &amp; complex environment</li><li>Good time management with an eye for perfection &amp; a strong operational background</li>,<h3>Good to have</h3><li>Prior experience in the tech, travel, or telecommunications industry</li><li>A network of Ukrainian influencers or influencer agencies you already worked with</li><li>Certificates and/or courses in digital marketing</li><div><span style=\"font-size: 16px\">If you are interested in this position, please</span><b style=\"font-size: 16px\">&nbsp;apply via the link.</b></div>","tags":"[\"management\",\"legal\",\"aws\"]","pubDate":"2024-05-01 13:40:27.625","link":"https://jobs.lever.co/airalo/126e6e38-29e8-49fa-830d-b149e9093a29","savedDate":"2024-05-09 13:10:01.603","slug":"social-media-and-influencer-marketing-specialist-ukraine-airalo-8859"},{"id":6682404219,"title":"Social Media and Influencer Marketing Specialist (Turkey)","company":"Airalo","image":"https://lever-client-logos.s3.us-west-2.amazonaws.com/55028a36-609c-479c-9553-d4689ff2dd8c-1669620566663.png","description":"<div>Airalo is seeking a talented and highly motivated Social Media and Influencer Marketing Specialist to join our European marketing team and grow our Turkish markets.</div><div>You will be responsible for guiding the strategy and development of our entire social media ecosystem in your markets and you will develop and execute influencer marketing campaigns to raise brand awareness, drive user engagement and boost conversions.</div><div>This role offers an exciting opportunity to work with some of the most influential voices in the travel and tech industry.</div><h3>Responsibilities include but are not limited to:</h3><li><b>Strategy Development and Campaign Planning:</b> Brainstorm, develop and execute end-to-end influencer marketing campaigns aligned with Airalo's goals and target audience.</li><li><b>Identify and Recruit Influencers:</b> Partner with relevant <b>Turkish</b> influencers, content creators and/or agencies to create authentic and engaging content that showcases Airalo's products.</li><li><b>Social Media Strategy:</b> Develop and execute an effective social media strategy tailored to the Turkish market to increase brand awareness, engagement, and lead generation.</li><li><b>Community Engagement:</b> Monitor and actively engage with the Airalo community on social media platforms, respond to comments, questions, and feedback promptly, and build positive relationships with followers.</li><li><b>Performance Analysis and Reporting:</b> Monitor, analyze performance and prepare reports on the ROI and effectiveness of influencer marketing efforts, including KPIs and metrics</li><li><b>Budget Management:</b> Effectively manage the budget allocated for influencer marketing campaigns, ensuring efficient use of resources.</li><li><b>Compliance and Contracts:</b> Ensure that influencer partnerships comply with legal regulations and company policies. Manage influencer contracts and negotiations.</li><li><b>Crisis Management:</b> Handle potential social media crises effectively, maintain a positive brand image, and address customer concerns professionally. And ensure compliance with local laws (e.g., copyright and data protection)</li><li><b>Stay Up-to-Date:</b> Stay informed about industry trends, emerging influencers, and new platforms to continuously adapt and enhance Airalo's influencer marketing strategies.</li>,<h3>Must-haves</h3><li>At least 3+ years of experience in a similar role, even better if in the travel industry. Strong experience with <b>social media and influencer marketing</b> is a must</li><li>Knowledge of the <b>Turkish market</b>, fluency in English, impeccable verbal and written communication skills</li><li>Extensive experience in brand management, content, social media, influencer and market insight with an in-depth understanding of the social and digital space</li><li>Excellent knowledge of Instagram/Facebook, TikTok, Youtube, Twitter, Telegram, Linkedin, Snapchat (and other eventual emerging social media) and abreast of social media best practices, and regional, and global trends</li><li>Owning a project that is not strictly part of your job description excites you and you take it as an opportunity to learn something new</li><li>Superior internal &amp; external communication &amp; cross-functional stakeholder management skills</li><li>Enjoying and excelling at handling multiple projects simultaneously in a matrix &amp; complex environment</li><li>Good time management with an eye for perfection &amp; a strong operational background</li>,<h3>Good to have</h3><li>Prior experience in the tech, travel, or telecommunications industry</li><li>A network of Turkish influencers or influencers agencies you already worked with</li><li>Certificates and/or courses in digital marketing</li><div><span style=\"font-size: 16px\">If you are interested in this position, please</span><b style=\"font-size: 16px\">&nbsp;apply via the link.</b></div>","tags":"[\"management\",\"legal\",\"aws\"]","pubDate":"2024-05-01 13:28:42.633","link":"https://jobs.lever.co/airalo/5a9354aa-21ac-405a-a635-8ec407bfa909","savedDate":"2024-05-09 13:10:01.603","slug":"social-media-and-influencer-marketing-specialist-turkey-airalo-3628"},{"id":3656264820,"title":"Social Media and Influencer Marketing Specialist (Israel)","company":"Airalo","image":"https://lever-client-logos.s3.us-west-2.amazonaws.com/55028a36-609c-479c-9553-d4689ff2dd8c-1669620566663.png","description":"<div>Airalo is seeking a talented and highly motivated Social Media and Influencer Marketing Specialist to join our European marketing team and grow the Israeli market.</div><div>You will be responsible for guiding the strategy and development of our entire social media ecosystem in your markets and you will develop and execute influencer marketing campaigns to raise brand awareness, drive user engagement and boost conversions.</div><div>This role offers an exciting opportunity to work with some of the most influential voices in the travel and tech industry.</div><h3>Responsibilities include but are not limited to:</h3><li><b>Strategy Development and Campaign Planning:</b> Brainstorm, develop and execute end-to-end influencer marketing campaigns aligned with Airalo's goals and target audience.</li><li><b>Identify and Recruit Influencers:</b> Partner with relevant <b>Israeli</b> influencers, content creators and/or agencies to create authentic and engaging content that showcases Airalo's products.</li><li><b>Social Media Strategy:</b> Develop and execute an effective social media strategy tailored to the Israeli market to increase brand awareness, engagement, and lead generation.</li><li><b>Community Engagement:</b> Monitor and actively engage with the Airalo community on social media platforms, respond to comments, questions, and feedback promptly, and build positive relationships with followers.</li><li><b>Performance Analysis and Reporting:</b> Monitor, analyze performance and prepare reports on the ROI and effectiveness of influencer marketing efforts, including KPIs and metrics</li><li><b>Budget Management:</b> Effectively manage the budget allocated for influencer marketing campaigns, ensuring efficient use of resources.</li><li><b>Compliance and Contracts:</b> Ensure that influencer partnerships comply with legal regulations and company policies. Manage influencer contracts and negotiations.</li><li><b>Crisis Management:</b> Handle potential social media crises effectively, maintain a positive brand image, and address customer concerns professionally. And ensure compliance with local laws (e.g., copyright and data protection)</li><li><b>Stay Up-to-Date:</b> Stay informed about industry trends, emerging influencers, and new platforms to continuously adapt and enhance Airalo's influencer marketing strategies.</li>,<h3>Must-haves</h3><li>At least 3+ years of experience in a similar role, even better if in the travel industry. Strong experience with social media and influencer marketing is a must</li><li>Knowledge of the Israeli market, fluency in English, impeccable verbal and written communication skills</li><li>Extensive experience in brand management, content, social media, influencer and market insight with an in-depth understanding of the social and digital space</li><li>Excellent knowledge of Instagram/Facebook, TikTok, Youtube, Twitter, Telegram, Linkedin, Snapchat (and other eventual emerging social media) and abreast of social media best practices, and regional, and global trends</li><li>Owning a project that is not strictly part of your job description excites you and you take it as an opportunity to learn something new</li><li>Superior internal &amp; external communication &amp; cross-functional stakeholder management skills</li><li>Enjoying and excelling at handling multiple projects simultaneously in a matrix &amp; complex environment</li><li>Good time management with an eye for perfection &amp; a strong operational background</li>,<h3>Good to have</h3><li>Prior experience in the tech, travel, or telecommunications industry</li><li>A network of Israeli influencers or influencers agencies you already worked with</li><li>Certificates and/or courses in digital marketing</li><div><span style=\"font-size: 16px\">If you are interested in this position, please</span><b style=\"font-size: 16px\">&nbsp;apply via the link.</b></div>","tags":"[\"management\",\"legal\",\"aws\"]","pubDate":"2024-05-01 13:07:18.967","link":"https://jobs.lever.co/airalo/72a9feb6-f091-478a-98ca-6904fbcd6622","savedDate":"2024-05-09 13:10:01.603","slug":"social-media-and-influencer-marketing-specialist-israel-airalo-4621"},{"id":9781069536,"title":"Social Media and Influencer Marketing Specialist (UK & Ireland)","company":"Airalo","image":"https://lever-client-logos.s3.us-west-2.amazonaws.com/55028a36-609c-479c-9553-d4689ff2dd8c-1669620566663.png","description":"<div>Airalo is seeking a talented and highly motivated Social Media and Influencer Marketing Specialist to join our European marketing team and grow our UK &amp; Ireland markets.</div><div>You will be responsible for guiding the strategy and development of our entire social media ecosystem in your markets and you will develop and execute influencer marketing campaigns to raise brand awareness, drive user engagement and boost conversions.</div><div>This role offers an exciting opportunity to work with some of the most influential voices in the travel and tech industry.</div><h3>Responsibilities include but are not limited to:</h3><li><b>Strategy Development and Campaign Planning:</b> Brainstorm, develop and execute end-to-end influencer marketing campaigns aligned with Airalo's goals and target audience.</li><li><b>Identify and Recruit Influencers:</b> Partner with relevant UK/Irish influencers, content creators and/or agencies to create authentic and engaging content that showcases Airalo's products.</li><li><b>Social Media Strategy:</b> Develop and execute an effective social media strategy tailored to the UK and Irish markets to increase brand awareness, engagement, and lead generation.</li><li><b>Community Engagement:</b> Monitor and actively engage with the Airalo community on social media platforms, respond to comments, questions, and feedback promptly, and build positive relationships with followers.</li><li><b>Performance Analysis and Reporting:</b> Monitor, analyze performance and prepare reports on the ROI and effectiveness of influencer marketing efforts, including KPIs and metrics</li><li><b>Budget Management:</b> Effectively manage the budget allocated for influencer marketing campaigns, ensuring efficient use of resources.</li><li><b>Compliance and Contracts:</b> Ensure that influencer partnerships comply with legal regulations and company policies. Manage influencer contracts and negotiations.</li><li><b>Crisis Management:</b> Handle potential social media crises effectively, maintain a positive brand image, and address customer concerns professionally. And ensure compliance with local laws (e.g., copyright and data protection)</li><li><b>Stay Up-to-Date:</b> Stay informed about industry trends, emerging influencers, and new platforms to continuously adapt and enhance Airalo's influencer marketing strategies.</li>,<h3>Must-haves</h3><li>At least 3+ years of experience in a similar role, even better if in the travel industry. Strong experience with <b>social media and influencer marketing</b> is a must</li><li>Knowledge of the <b>UK and Ireland markets</b>, fluency in English, impeccable verbal and written communication skills</li><li>Extensive experience in brand management, content, social media, influencer and market insight with an in-depth understanding of the social and digital space</li><li>Excellent knowledge of Instagram/Facebook, TikTok, Youtube, Twitter, Telegram, Linkedin, Snapchat (and other eventual emerging social media) and abreast of social media best practices, and regional, and global trends</li><li>Owning a project that is not strictly part of your job description excites you and you take it as an opportunity to learn something new</li><li>Superior internal &amp; external communication &amp; cross-functional stakeholder management skills</li><li>Enjoying and excelling at handling multiple projects simultaneously in a matrix &amp; complex environment</li><li>Good time management with an eye for perfection &amp; a strong operational background</li>,<h3>Good to have</h3><li>Prior experience in the tech, travel, or telecommunications industry</li><li>A network of UK/Irish influencers or influencers agencies you already worked with</li><li>Certificates and/or courses in digital marketing</li><div><span style=\"font-size: 16px\">If you are interested in this position, please</span><b style=\"font-size: 16px\">&nbsp;apply via the link.</b></div>","tags":"[\"management\",\"legal\",\"aws\"]","pubDate":"2024-05-01 12:14:36.120","link":"https://jobs.lever.co/airalo/4eef408a-de09-4143-9500-736e7039481b","savedDate":"2024-05-09 13:10:01.603","slug":"social-media-and-influencer-marketing-specialist-uk-ireland-airalo-903"},{"id":5515083334,"title":"SENIOR COPYWRITER (Work from anywhere in the world)","company":"Wishpond","image":"https://scontent.fcmb4-2.fna.fbcdn.net/v/t39.30808-6/273499217_5218973671480777_3308731762242867065_n.jpg?_nc_cat=110&ccb=1-7&_nc_sid=efb6e6&_nc_ohc=YDi_Wd17RD8AX9wXcyR&_nc_zt=23&_nc_ht=scontent.fcmb4-2.fna&oh=00_AfB4sOOYpj6VyDSuvvuqhVnZbH22m89SqG99HwaOa-uslw&oe=65BE4336","description":"<div><b style=\"font-size: 16px\">Wishpond Technologies currently has the position of SENIOR COPYWRITER available, and we’re excited to tell you about it!</b><span style=\"font-size: 16px\">&nbsp;</span></div><div><br></div><div><b style=\"font-size: 24px\">OVERVIEW</b></div><div><span style=\"font-size: 16px\">Wishpond Technologies seeks a Senior Copywriter to join our dynamic team full-time. This position offers the flexibility of remote work, allowing you to work from anywhere in the world while collaborating with our exceptional team serving clients across the US and Canada. As a Senior Copywriter, you will be pivotal in leveraging digital marketing expertise and AI-powered solutions to drive efficiency and effectiveness in our copywriting processes.</span></div><div><br></div><div><b style=\"font-size: 24px\">RESPONSIBILITIES</b></div><div>• <span style=\"font-size: 16px\">The Senior Marketing Copywriter is responsible for&nbsp;meticulously review, edit, and provide constructive feedback to team members, ensuring high-quality output and adherence to best practices.</span></div><div>• <span style=\"font-size: 16px\">Mentor and coach junior writers, leveraging AI-driven personalized research to identify and address areas for improvement effectively.</span></div><div>• <span style=\"font-size: 16px\">Collaborate with senior copywriters and the copywriting team lead to develop and implement AI-driven strategies and procedures to optimize departmental and inter-departmental efficiencies.</span></div><div>• <span style=\"font-size: 16px\">Assign tasks to writers, optimizing workflow and productivity.</span></div><div>• <span style=\"font-size: 16px\">Generate compelling, high-converting copy for Wishpond clients, incorporating AI-driven insights and strategies to ensure brand integrity and success.</span></div><div>• <span style=\"font-size: 16px\">Collaborate with cross-functional teams, including the Creative Director, Designers, Account Managers, and clients, to align copy direction with branding and advertising initiatives.</span></div><div>• <span style=\"font-size: 16px\">Utilize AI-powered tools to Stay abreast of AI and digital marketing industry trends, leveraging AI, machine learning, Martech, and other innovative technologies to enhance the customer experience and drive results.</span></div><div>• <span style=\"font-size: 16px\">Perform other duties as assigned to support the overall success of Wishpond Technologies Ltd.</span></div><div><br></div><div><b style=\"font-size: 24px\">QUALIFICATIONS</b></div><div>• <span style=\"font-size: 16px\">3years of experience in a digital marketing agency, with a demonstrated understanding of AI-driven marketing strategies and techniques.</span></div><div>• <span style=\"font-size: 16px\">Profound knowledge of marketing concepts complementing copywriting, such as prospects’ stages of awareness, conversion funnel stages, retargeting, storytelling, and frameworks.</span></div><div>• <span style=\"font-size: 16px\">Mastery in crafting impactful headlines and concise copy, augmented by AI-driven insights.</span></div><div>• <span style=\"font-size: 16px\">Proven ability to conduct thorough message mining and research using AI-powered tools to inform content creation.</span></div><div>• <span style=\"font-size: 16px\">Proficiency in adapting content formats to meet diverse needs.Able to navigate multiple content formats while meeting their needs for maximum impact.</span></div><div>• <span style=\"font-size: 16px\">Strong habit of iterating and optimizing ideas based on campaign insights and feedback.</span></div><div>• <span style=\"font-size: 16px\">Self-motivated with a client-first mentality, capable of working independently and collaboratively in a diverse team environment.</span></div><div>• <span style=\"font-size: 16px\">Technical proficiency, analytical mindset, and ability to multitask in a fast-paced environment.</span></div><div>• <span style=\"font-size: 16px\">Must be technical, analytical, results-driven, and able to multi-task in a fast-paced environment.</span></div><div>• <span style=\"font-size: 16px\">Excellent organizational, administrative, and communication skills, with fluent English (spoken and written). </span>• <span style=\"font-size: 16px\">Knowledge of a second language is an asset.</span></div><div>• <span style=\"font-size: 16px\">Willingness to engage in ongoing education and training to stay updated on AI and industry trends.</span></div><div><br></div><div><b style=\"font-size: 24px\">WORK ENVIRONMENT</b></div><div>• It is expected that the successful candidate will provide their own workstation, computer, and headset, and have a fast and reliable internet connection.&nbsp;Certain roles will be required to utilize and or download company-approved software.</div><div>• The individual must be prepared to work standard business hours on EST or PST</div><div>• Due to the nature of this role, we may verify backgrounds including conducting employment references, criminal record, and credit checks.</div><div>• Once hired, the successful candidate must provide a valid government-issued photo ID and proof of residential address as part of their onboarding process.</div><div><br></div><div><b style=\"font-size: 24px\">GREAT REASONS TO JOIN OUR TEAM !</b></div><div>• Fully remote position allowing you to <b>work from your home anywhere in the world !</b></div><div>• Exciting and dynamic environment with a great leadership team&nbsp;</div><div>• Comprehensive training program and regular performance reviews to facilitate your success</div><div>• Competitive compensation based on experience and proven abilities</div><div>• Great referral programs with incentives and bonuses</div><div>• Unbelievable product discounts when you use our products for your own business</div><div>• A global workforce of multi-cultural and talented colleagues&nbsp;</div><div>• A close-knit operation with amazing growth opportunities for your personal development</div><div>• A high growth SaaS technology company publicly traded on the TSX Venture Exchange</div><div>• Corporate headquarters in beautiful Vancouver, British Columbia, Canada</div><div>• Access to our education credits program and so much more !</div><div><br></div><div><b style=\"font-size: 24px\">ABOUT US</b></div><div>Founded in 2009, Wishpond is a rapidly growing technology company providing digital marketing solutions targeted at small businesses.&nbsp; The cloud-based platform includes landing pages, social promotions, website pop-ups, online forms, and lead activity tracking. Wishpond has a dedicated team of professional project managers, designers, copywriters, and developers who provide marketing services tailored to our individual clients.</div><div>&nbsp;</div><div>Wishpond serves over 3,000 customers in various industries and sizes, from startups to large Fortune 500 companies. Wishpond has a rapidly growing global headcount and continues to hire dedicated and qualified employees and contractors who have what it takes to scale a successful software company.</div><div><br></div><div>To learn more about Wishpond Technologies, please visit our website or any of our social media platforms:</div><div><br></div><div>• Website: <a href=\"http://www.wishpond.com/\" class=\"postings-link\">www.wishpond.com</a></div><div>• Instagram: @wishpondofficial</div><div>• Twitter: Wishpond</div><div>• Youtube: Thewishpond</div><div>• LinkedIn : Wishpond</div><div><br></div><div><b style=\"font-size: 24px\">APPLICATION PROCESS</b></div><div><b>If you are interested in applying for this exciting opportunity, please provide an updated resume in English (PDF or Word formats only), quoting the position title in the subject line of your cover letter</b></div><div>&nbsp;<b>&nbsp;</b></div><div>Wishpond Technologies is an equal-opportunity employer committed to hiring a diverse workforce and sustaining an inclusive culture that does not discriminate on the basis of disability, status, or any other basis protected under legislation</div><div>&nbsp;</div><div>We thank all applicants in advance for their interest in this position however due to the volume of applications we receive, we are unable to respond to phone, email, or agency inquiries.</div><div><br></div>","tags":"[]","pubDate":"2024-04-30 17:12:48.968","link":"https://jobs.lever.co/wishpond/fe1bd2a3-d709-4d9e-ae74-3a00d7a0fe8c","savedDate":"2024-05-09 13:10:01.599","slug":"senior-copywriter-work-from-anywhere-in-the-world-wishpond-626"},{"id":4679651034,"title":"Financial Management Specialist","company":"Realiste AI","image":"https://remotive.com/job/1910452/logo","description":"<p><strong>About the Company:</strong></p>\n<p> </p>\n<p>Realiste AI is a pioneering force in the real estate investment sector, boasting a unique global position. Our revolutionary product fuels our rapid expansion, likening us to the \"Google of real estate investments.\"</p>\n<p> </p>\n<p>The Realiste platform facilitates seamless real estate investments for private and institutional investors worldwide. Powered by advanced AI algorithms, it evaluates and ranks investment opportunities based on factors such as projected ROI, growth forecasts, and market dynamics.</p>\n<p> </p>\n<p>We offer an exclusive array of real estate properties from institutional sellers, including developers, banks, funds, and companies. While our primary focus is on residential properties, we particularly emphasize new developments for their suitability in online transactions.</p>\n<p> </p>\n<p>Founded in the UAE, we are now expanding our footprint into new markets. With real estate data from over 110 cities globally, our platform's expansion is imminent.</p>\n<p> </p>\n<p><strong>Our Working Style:</strong></p>\n<p> </p>\n<p>At Realiste, we prioritize innovation, data-driven solutions, and customer satisfaction. We believe in giving our employees the freedom to act, experiment, and develop their own work systems. We offer efficient training to ensure you're equipped to close deals swiftly. Our team is spread across various cities worldwide, so we're accustomed to remote collaboration and communication.</p>\n<p> </p>\n<p><strong>Responsibilities:</strong></p>\n<p> </p>\n<p>Join Realiste's team and take on the following responsibilities:</p>\n<p> </p>\n<ul style=\"\">\n<li style=\"\">Obtain financial loans from banks and funds to facilitate real estate development projects.</li>\n<li style=\"\">Collaborate with developers to expedite timelines and secure Realiste commissions for closed deals, utilizing various methods such as document management and personal meetings.</li>\n<li style=\"\">Reduce overdue accounts receivable (1 week or more) to 5% of the total accounts receivable volume from developers in the UAE.</li>\n</ul>\n<p> </p>\n<p><strong>Candidate Expectations:</strong></p>\n<p> </p>\n<p>We are seeking candidates who meet the following criteria:</p>\n<p> </p>\n<ul style=\"\">\n<li style=\"\">Work experience as a B2B credit broker, B2B development manager, investment attraction manager, or receivables collection specialist (B2B) in the UAE, with a demonstrated track record of success.</li>\n<li style=\"\">Higher education and strong financial literacy.</li>\n<li style=\"\">Minimum 2 years of experience in the B2B segment in the UAE.</li>\n<li style=\"\">Positive reputation at previous workplaces.</li>\n<li style=\"\">Fluency in both Russian and English languages.</li>\n</ul>\n<p> </p>\n<p><strong>Job Conditions:</strong></p>\n<p> </p>\n<p>As part of our team, you will enjoy the following:</p>\n<p> </p>\n<ul style=\"\">\n<li style=\"\">Competitive compensation of 10,000 AED.</li>\n<li style=\"\">Opportunities for further career development based on financial results and KPIs.</li>\n<li style=\"\">Probation period of 1 month.</li>\n<li style=\"\">After 6 months of successful work with the team, the possibility of acquiring stock options of the company, rewarding your contributions to our innovative IT real estate investment platform.</li>\n</ul>\n<p> </p>\n<p>If you possess the necessary skills and experience and are ready to contribute to our mission of streamlining collaboration with real estate developers and securing funds from financial institutions, we encourage you to apply for this exciting opportunity.</p>\n<p> </p>\n<p><strong>Company Principles and Culture:</strong></p>\n<p> </p>\n<ul style=\"\">\n<li style=\"\">Our clients come first. We always prioritize their interests over ours. We only win when our clients win. If our clients lose, we lose too.</li>\n<li style=\"\">Our AI provides our clients with an advantage over traditional investment methods. We aim to double our clients' earnings while minimizing risks.</li>\n<li style=\"\">Always act in the company's interests, not your personal interests.</li>\n<li style=\"\">Culture is important. Avoid working with unpleasant people - they won't take responsibility for their words and actions.</li>\n<li style=\"\">Always make sure the unit economics are positive.</li>\n<li style=\"\">Take action to prevent downtime.</li>\n<li style=\"\">We treat everyone equally, regardless of age, religion, orientation, nationality, or political views.</li>\n<li style=\"\">Every employee must be a shareholder. Share distribution is based on excellent work, and employees can also buy shares at a special price.</li>\n</ul>\n<p> </p>\n<p style=\"font-stretch: normal; line-height: normal;\"><span style=\"font-weight: 600; color: #000000; letter-spacing: 0.75px;\">To begin the process:</span></p>\n<p style=\"font-stretch: normal; line-height: normal;\">1. Apply for this position.</p>\n<p style=\"font-stretch: normal; line-height: normal;\">2. Once you are referred to the onboarding page, complete the form by providing the required information and complete the onboarding tasks. Ensure that you fill in all the necessary fields accurately.</p>\n<img src=\"https://remotive.com/job/track/1910452/blank.gif?source=public_api\" alt=\"\"/>","tags":"[\"AI/ML\",\"onboarding\"]","pubDate":"2024-04-30 09:43:47.000","link":"https://remotive.com/remote-jobs/finance-legal/financial-management-specialist-1910452","savedDate":"2024-05-09 13:10:01.593","slug":"financial-management-specialist-realiste-ai-7177"},{"id":2781708760,"title":"Senior Sales Manager","company":"Realiste AI","image":"https://remotive.com/job/1910453/logo","description":"<div class=\"h4\" dir=\"ltr\" style=\"line-height: 1.7999999999999998; background-color: #ffffff; margin-top: 12pt; margin-bottom: 0pt; padding: 0pt 0pt 2pt 0pt;\"> </div>\n<p style=\"font-stretch: normal; line-height: normal;\"><span><strong>About the Position:</strong></span></p>\n<p style=\"font-stretch: normal; line-height: normal;\"><span><strong> </strong></span></p>\n<p style=\"font-stretch: normal; line-height: normal;\"><span>Realiste AI is seeking an experienced Senior Sales Manager to join our innovative team. This position offers a competitive income ranging from $15k to $45k monthly, with potential annual earnings up to $550k, including a base salary and commissions. Additionally, there are opportunities to acquire up to 0.1% in company share options.</span></p>\n<p style=\"font-stretch: normal; line-height: normal;\"><span> </span></p>\n<p style=\"font-stretch: normal; line-height: normal;\"><span><strong>About the Company:</strong></span></p>\n<p style=\"font-stretch: normal; line-height: normal;\"><span> </span></p>\n<p style=\"font-stretch: normal; line-height: normal;\"><span>Realiste AI is a pioneering force in the global real estate investment sector, revolutionizing the industry with our cutting-edge product. Our platform utilizes advanced AI algorithms to facilitate seamless real estate investments for private and institutional investors worldwide.</span></p>\n<p style=\"font-stretch: normal; line-height: normal;\"><span> </span></p>\n<p style=\"font-stretch: normal; line-height: normal;\"><span><strong>Business Model:</strong></span></p>\n<p style=\"font-stretch: normal; line-height: normal;\"><span> </span></p>\n<p style=\"font-stretch: normal; line-height: normal;\"><span>Our business model revolves around organic user engagement and delivering extensive market insights. We provide complimentary access to our platform, supported by a dedicated team to assist users in property selection and transaction facilitation. Real estate developers pay a nominal commission, generating a substantial revenue stream for the company.</span></p>\n<p style=\"font-stretch: normal; line-height: normal;\"><span> </span></p>\n<p style=\"font-stretch: normal; line-height: normal;\"><span><strong>What We Offer:</strong></span></p>\n<p style=\"font-stretch: normal; line-height: normal;\"><span> </span></p>\n<p style=\"font-stretch: normal; line-height: normal;\"> </p>\n<ul style=\"\">\n<li style=\"\"><span>High demand: 5 real customers per day per salesperson.</span></li>\n<li style=\"\"><span>Global reach: No limit on customer traffic; we sell worldwide.</span></li>\n<li style=\"\"><span>Established client base: Incoming orders.</span></li>\n<li style=\"\"><span>Strong brand presence: Detachment from the market, easy to explain why to work with us.</span></li>\n<li style=\"\"><span>Prime location: Great office in Dubai.</span></li>\n<li style=\"\"><span>Talented team: A class salespeople ready to excel.</span></li>\n</ul>\n<p style=\"font-stretch: normal; line-height: normal;\"><span> </span></p>\n<p style=\"font-stretch: normal; line-height: normal;\"><span><strong>Skills Required:</strong></span></p>\n<p style=\"font-stretch: normal; line-height: normal;\"><span> </span></p>\n<p style=\"font-stretch: normal; line-height: normal;\"> </p>\n<ul style=\"\">\n<li style=\"\"><span>Proven sales experience, consistently earning at least $7,000 monthly.</span></li>\n<li style=\"\"><span>Familiarity with investment instruments and terminology.</span></li>\n<li style=\"\"><span>Experience in selling real estate or financial products preferred.</span></li>\n<li style=\"\"><span>Strong communication skills, written and verbal.</span></li>\n</ul>\n<p> </p>\n<p style=\"font-stretch: normal; line-height: normal;\"><strong>How to apply:<br></strong><br>1. Apply for this position.</p>\n<p style=\"font-stretch: normal; line-height: normal;\">2. Once you are referred to the onboarding page, complete the form by providing the required information and complete the onboarding tasks. Ensure that you fill in all the necessary fields accurately.</p>\n<img src=\"https://remotive.com/job/track/1910453/blank.gif?source=public_api\" alt=\"\"/>","tags":"[\"onboarding\"]","pubDate":"2024-04-30 08:35:41.000","link":"https://remotive.com/remote-jobs/sales-business/senior-sales-manager-1910453","savedDate":"2024-05-09 13:10:01.593","slug":"senior-sales-manager-realiste-ai-5147"},{"id":4700214770,"title":"Business Development Manager for Hosting | Europe Focus (remote-only position)","company":"CloudLinux","image":"https://pbs.twimg.com/profile_images/696718028084482050/ymY3OEPk_400x400.png","description":"<p>We are on the lookout for a seasoned hosting sales professional with a strong background in selling Linux products. As our Business Development Manager at CloudLinux, you will play a key role in driving our sales initiatives and expanding our presence in the hosting sector. You will have the thrilling opportunity to work with diverse and dynamic customers, which calls for a proactive and engaging approach.</p><p>Join us and become part of a company that goes beyond just business. At CloudLinux, we believe in making a meaningful impact in the Linux and hosting industry. You'll be joining a supportive team that promotes collaboration and shared success.</p><p><strong>As our Business Development Manager, you will be responsible for:</strong></p><ul> <li>Engaging regularly with new and existing customers who are passionate and enthusiastic about our products.</li> <li>Using your proactive and \"hunter\" approach to make initial contact with potential clients and explore new sales opportunities.</li> <li>Effectively presenting our value proposition to decision-makers and key individuals within organizations.</li> <li>Managing a pipeline of opportunities in Hubspot and maintaining regular communication on progress and status.</li> <li>Identifying prospects who can serve as public advocates for CloudLinux through testimonials and case studies.</li> <li>Working closely with company leadership to identify and pursue new market opportunities.</li> <li>Collaborating with SEs and Customer Success Managers to ensure successful customer adoption and onboarding.</li> </ul><h3>Requirements: </h3><p><strong>To be successful in this role you should have:</strong></p><ul> <li>3-5 years of sales experience, consistently achieving high close rates and rapid sales cycles.</li> <li>Deep understanding of Linux infrastructure and/or security software in the hosting industry.</li> <li>Excellent communication, organization, collaboration, and attention to detail.</li> <li>Ability to effectively prioritize and manage multiple tasks.</li> <li>Proven ability to build and nurture relationships, mitigate risks, and successfully close deals.</li> <li>Familiarity with Hubspot is a valuable asset.</li> <li>Fluent in English.</li> <li>Hunter Personality: Demonstrates strong initiative and drive to pursue new sales leads and business opportunities.</li> <li>Passionate and knowledgeable about technology, specifically in the domains of hosting and Linux.</li> <li>Adept at data entry tasks with a focus on upselling and cross-selling.</li> <li>Up to date passport</li> </ul><h3>Benefits: </h3><p><strong>What's in it for you?</strong></p><ul> <li>A focus on professional development; </li> <li>Interesting and challenging projects</li> <li>Flexible working hours</li> <li>Paid one month vacation per year and unlimited sick leave</li> <li>Medical insurance reimbursement</li> <li>Co-working and gym/sports reimbursement</li> <li>The opportunity to receive a reward for the most innovative idea that the company can patent</li> </ul><p><em>By applying for this position, you agree with </em><a href=\"https://cloudlinux.com/privacy-policy\" rel=\"nofollow noreferrer noopener\" class=\"external\"><em>Cloudlinux Privacy Policy</em></a><em> and give us your consent to maintain and process your personal data with this respect. Please read our Privacy Policy for more information.</em></p>","tags":"[]","pubDate":"2024-04-30 00:00:00.000","link":"https://apply.workable.com/cloudlinux-1/j/C698956091","savedDate":"2024-05-09 13:10:01.597","slug":"business-development-manager-for-hosting-europe-focus-remote-only-position-cloudlinux-2697"}]