[{"id":5100809540,"title":"Senior Product Manager, Multi-Products","company":"Clutch","image":"https://app.ashbyhq.com/api/images/org-theme-logo/87f6e542-ae68-4ff1-ab48-f05e9dab1964/e24aecd5-3955-404a-8728-c08806c78730.png","description":"<h2><strong>About the role</strong></h2><p style=\"min-height:1.5em\">We’re seeking a Senior Product Manager to focus on creating impactful Internal Tooling for Implementation Engineers, which will evolve into a world-class Admin Experience for Customers. You’ll play a pivotal role in shaping the tools and workflows that empower our internal teams to deliver seamless onboarding and drive exceptional customer outcomes.</p><p style=\"min-height:1.5em\">This role offers the unique opportunity to own end-to-end product delivery in a critical area of our platform while directly contributing to Clutch’s mission of scaling and transforming credit unions.</p><p style=\"min-height:1.5em\"><strong>As the Senior Product Manager, you will:</strong></p><ul style=\"min-height:1.5em\"><li><p style=\"min-height:1.5em\"><strong>Develop tools for success:</strong> Drive the strategy and execution of internal tools that enable Implementation Engineers to onboard credit unions more efficiently and with higher accuracy.</p></li><li><p style=\"min-height:1.5em\"><strong>Shape the admin experience:</strong> Lay the groundwork for customer-facing admin features that provide our clients with powerful yet intuitive ways to configure and manage their digital experiences.</p></li><li><p style=\"min-height:1.5em\"><strong>Bridge internal and external needs:</strong> Partner with Implementation, Engineering, and Customer Success teams to align internal workflows with the broader customer journey.</p></li><li><p style=\"min-height:1.5em\"><strong>Deliver scalable outcomes:</strong> Build reusable, extensible tools and admin systems that scale across our multi-product platform, including Lending, Account Opening, and Business Banking products.</p></li><li><p style=\"min-height:1.5em\">Beyond your immediate role, help shape the broader strategy and execution for multi-product ecosystem.</p></li></ul><h2><strong>About the Team</strong></h2><p style=\"min-height:1.5em\">Our team spans the U.S. and LATAM (primarily Brazil), creating a collaborative, diverse, and distributed environment.</p><p style=\"min-height:1.5em\">Product Management drives our innovation, with PMs, designers, and engineers working closely to build exceptional products. PMs also partner with leadership and teams across Customer Success, Implementation, Legal &amp; Compliance, Sales, and Support to shape strategy and ensure successful adoption.</p><p style=\"min-height:1.5em\">The Multi-Product team focuses on scaling our platform through core building blocks. You’ll join the team responsible for building core internal and admin tools, reporting to the Group Product Manager who leads foundational capabilities across our platform.</p><p style=\"min-height:1.5em\">We’re an ambitious, supportive, and mission-driven team within a product-focused company.<br /></p><h2><strong>What You’ll Do</strong></h2><p style=\"min-height:1.5em\"><strong>Within 3 months, you will:</strong></p><ul style=\"min-height:1.5em\"><li><p style=\"min-height:1.5em\">Take ownership of existing internal tooling initiatives and run discovery sprints to build a strategy for tooling (We don’t want to feature match competition but build customer obsessed and scalable tooling)</p></li><li><p style=\"min-height:1.5em\">Set up the new team alongside the engineering manager</p></li><li><p style=\"min-height:1.5em\">Partner with Design and Engineering to define and refine roadmaps for internal tools that accelerate onboarding and delivery for credit unions</p></li><li><p style=\"min-height:1.5em\">Launch critical internal tooling features that improve efficiency and reduce complexity for Implementation Engineers.</p></li><li><p style=\"min-height:1.5em\">Conduct discovery with customers and stakeholders to inform the evolution of internal tools into a robust admin experience.</p></li></ul><p style=\"min-height:1.5em\"><strong>Within 6 months, you will:</strong></p><ul style=\"min-height:1.5em\"><li><p style=\"min-height:1.5em\">Collaborate with the GPM to establish clear principles for scalable, reusable systems that impact multiple products.</p></li><li><p style=\"min-height:1.5em\">Identify opportunities to streamline internal processes and translate them into actionable product features.</p></li><li><p style=\"min-height:1.5em\">Lead cross-functional teams to scale and optimize tools for growing customer bases and product lines.</p></li><li><p style=\"min-height:1.5em\">Build alignment across product verticals to ensure a seamless integration of admin tools with broader platform capabilities.</p></li></ul><p style=\"min-height:1.5em\"><strong>Within 9 months, you will:</strong></p><ul style=\"min-height:1.5em\"><li><p style=\"min-height:1.5em\">You will have demonstrated success within the first 6 months positioning you to lead additional areas as the company grows</p></li></ul><h2><strong>What You Bring</strong></h2><p style=\"min-height:1.5em\">You’re committed to delivering impactful results for consumers and customers and share our vision for transforming Credit Unions. Additionally, you bring:</p><ul style=\"min-height:1.5em\"><li><p style=\"min-height:1.5em\"><strong>4+ years of product management experience</strong>, ideally in fintech, SaaS, or a B2B/B2B2C environment.</p></li><li><p style=\"min-height:1.5em\">Some experience of delivering internal tools and/or admin-facing features that blend operational efficiency with customer impact.</p></li><li><p style=\"min-height:1.5em\">Deep empathy for implementation engineering and customer success</p></li><li><p style=\"min-height:1.5em\">(Nice to have) You have worked in an implementation, solution specialist or similar role before transitioning to product</p></li><li><p style=\"min-height:1.5em\">Strong strategic thinking, balancing immediate execution with scalable long-term goals.</p></li><li><p style=\"min-height:1.5em\">Exceptional collaboration and communication skills, with experience working cross-functionally in fast-paced environments.</p></li><li><p style=\"min-height:1.5em\">The ability to deeply understand technical workflows and translate them into user-friendly tools and experiences.</p></li><li><p style=\"min-height:1.5em\">A passion for creating scalable systems that enable both internal teams and external customers.</p></li><li><p style=\"min-height:1.5em\">An entrepreneurial mindset, thriving in ambiguity while remaining focused on outcomes.</p></li></ul><p style=\"min-height:1.5em\"><em>Please note that this role may evolve as our business needs change, so we appreciate your flexibility and adaptability.</em></p><p style=\"min-height:1.5em\"><strong>What’s In It For You?</strong></p><ul style=\"min-height:1.5em\"><li><p style=\"min-height:1.5em\"><strong>Remote Flexibility:</strong> Enjoy the freedom of remote work from anywhere, balancing life and career seamlessly.</p></li><li><p style=\"min-height:1.5em\"><strong>Unforgettable Off-Sites:</strong> Twice a year, bond with colleagues in exciting destinations, fostering teamwork and fresh ideas.</p></li><li><p style=\"min-height:1.5em\"><strong>Paid Time Off:</strong> Enjoy flexible PTO days yearly for relaxation and rejuvenation.</p></li><li><p style=\"min-height:1.5em\"><strong>Stock Options:</strong> Joining us means having a stake in our success, so you'll receive stock options as part of your compensation package.</p></li><li><p style=\"min-height:1.5em\"><strong>Home Office Setup:</strong> Create your ideal workspace with a dedicated budget for home office essentials.</p></li><li><p style=\"min-height:1.5em\"><strong>Work Trip Budget:</strong> Grow personally and professionally with a budget for work-related trips and co-working.</p></li><li><p style=\"min-height:1.5em\"><strong>Health Coverage:</strong> Prioritize your well-being with comprehensive health and dental insurance plans.</p></li></ul><p style=\"min-height:1.5em\"><strong>About Us</strong></p><p style=\"min-height:1.5em\"><strong>Clutch</strong> is a revolutionary vertical SaaS company, proudly backed by Andreessen Horowitz (A16z), aimed at revolutionizing the way Credit Unions engage and change the lives of their members. As a champion of financial well-being, we address the urgent need for affordable lending solutions in an era where the average American grapples with over $155,000 in household debt.  Unlike traditional financial institutions, Clutch develops software to turn Credit Unions into FinTech lenders and leverage their balance sheets to responsibly lend to over 130M Americans. Our mission extends beyond mere financial transactions; we strive to fundamentally enhance the way credit unions interact with their members. By integrating cutting-edge technologies and user-centric designs, we help credit unions provide seamless digital experiences that are on par with leading tech companies. This approach not only preserves but revitalizes the longstanding tradition of community and member-focused service inherent to credit unions.</p><p style=\"min-height:1.5em\">Clutch is an equal opportunity employer. All applicants will be considered for employment without attention to race, color, religion, sex, sexual orientation, gender identity, national origin, veteran or disability status.</p><p style=\"min-height:1.5em\"><em>Our organization participates in E-Verify. Click </em><a target=\"_blank\" rel=\"noopener noreferrer\" href=\"https://www.e-verify.gov/about-e-verify/what-is-e-verify\"><em>here</em></a><em> to learn about E-Verify.</em></p>","tags":"[\"management\",\"engineering\",\"b2c\",\"b2b\",\"legal\"]","pubDate":"2025-01-11T18:55:21.255Z","link":"https://jobs.ashbyhq.com/withclutch/d45fbba5-4bd9-40d9-9eba-cb8fdc2e0452","slug":"senior-product-manager-multi-products-clutch-2431"},{"id":9417292147,"title":"Data Analytics Manager","company":"Kalibri Labs","image":"https://remotive.com/job/1962055/logo","description":"<p><em>We are looking for a Data Analytics Manager who is passionate about leading a team responsible for building and enhancing complex data processing pipelines. The manager will work with a cross-functional team to build and implement Kalibri's entity resolution engine, construct a continuously operating data pipeline, release iterative improvements to the data system, and ensure the highest levels of data quality and accuracy.</em></p>\n<p> </p>\n<div class=\"h3\"><strong>Responsibilities</strong></div>\n<ul style=\"\">\n<li style=\"\">Advances Kalibri's mission through the design and execution of a new data pipeline that improves data quality, processing speed, and automates existing manual processes</li>\n<li style=\"\">Manage data projects and lead a mission-focused team to ensure successful execution against product roadmap</li>\n<li style=\"\">Define and implement team SLAs and KPIs around data quality and data delivery</li>\n<li style=\"\">Define SOPs for a team including new data processes and resolving production data issues</li>\n<li style=\"\">Act as the primary domain expert for Kalibri's core hotel data</li>\n<li style=\"\">Directly manage a growing cross-functional team of 2-4 data engineers and analysts</li>\n<li style=\"\">Mentors direct reports to develop skills in designing data systems, improving data processes, and creating data analyses</li>\n</ul>\n<p> </p>\n<p><strong>Skills &amp; Requirements</strong></p>\n<ul style=\"\">\n<li style=\"\">5+ years in building data processes and 2+ years of experience on leading cross-functional teams responsible for implementing data processes</li>\n<li style=\"\">Demonstrated production ability to design, implement, and improve complex data processes with entity resolution, governance, lineage, aggregation, and optimization</li>\n<li style=\"\">Strong background in analytics tools and software (e.g. SQL, Python, Looker, Excel)</li>\n<li style=\"\">Demonstrated ability to design, build, and maintain high quality data processing systems</li>\n<li style=\"\">Proven ability to independently solve ambiguous problems and have ownership of a complex data system</li>\n<li style=\"\">Skilled at communicating and collaborating with a variety of stakeholders at all levels of an organization, including data analysts, data engineers, product, customer success, and data science</li>\n<li style=\"\">Experience in Agile or Scrum Methodologies</li>\n<li style=\"\">Bachelor's degree in Business Administration, Information Technology, Computer Science, or relevant experience</li>\n</ul>\n<img src=\"https://remotive.com/job/track/1962055/blank.gif?source=public_api\" alt=\"\"/>","tags":"[\"python\",\"sql\",\"agile\"]","pubDate":"2025-01-11T07:50:58.000Z","link":"https://remotive.com/remote-jobs/data/data-analytics-manager-1962055","slug":"data-analytics-manager-kalibri-labs-3595"},{"id":2187955455,"title":"Web/Graphic Designer","company":"Growe","image":"https://remotive.com/job/1961804/logo","description":"<div class=\"h5\">Growe welcomes those who are excited to:</div>\n<ul style=\"\">\n<li style=\"\">Collaborate on projects that engage sport fans and game players through compelling visuals;</li>\n<li style=\"\">Stay updated on trends in sports and gaming design to create fresh, relevant content;</li>\n<li style=\"\">Push creative boundaries and explore innovative design solutions;</li>\n<li style=\"\">Contribute to a collaborative and inclusive team culture;</li>\n<li style=\"\">Work closely with international teams on developing the creative part of the project;</li>\n<li style=\"\">Deliver high-quality work that makes a measurable impact;</li>\n<li style=\"\">Adapt to new challenges and thrive in a fast-paced, dynamic environment.</li>\n</ul>\n<div class=\"h5\">We need your professional experience:</div>\n<ul style=\"\">\n<li style=\"\">Excellent knowledge of Figma, Adobe Photoshop, and Illustrator, AI;</li>\n<li style=\"\">Web and graphic design experience;</li>\n<li style=\"\">Solid knowledge of UX/UI;</li>\n<li style=\"\">Experience in preparing marketing assets: Landing pages, emails, banners and merchandise;</li>\n<li style=\"\">Motion design skills;</li>\n<li style=\"\">3D Design: develop high-quality 3D assets;</li>\n<li style=\"\">Upper-Intermediate level of English;</li>\n<li style=\"\">Experience with iGaming projects will be a plus.</li>\n</ul>\n<div class=\"h5\">We appreciate if you have those personal features:</div>\n<ul style=\"\">\n<li style=\"\">Demonstrates strong time-management skills and the ability to excel in a fast-paced, multitasking environment;</li>\n<li style=\"\">Proactivity and initiative;</li>\n<li style=\"\">Attention to details.</li>\n</ul>\n<div class=\"h5\">We are seeking those who align with our core values:</div>\n<ul style=\"\">\n<li style=\"\">GROWE TOGETHER: Our team is our main asset. We work together and support each other to achieve our common goals; </li>\n<li style=\"\">DRIVE RESULT OVER PROCESS: We set ambitious, clear, measurable goals in line with our strategy and driving Growe to success;</li>\n<li style=\"\">BE READY FOR CHANGE: We see challenges as opportunities to grow and evolve. We adapt today to win tomorrow.</li>\n</ul><img src=\"https://remotive.com/job/track/1961804/blank.gif?source=public_api\" alt=\"\"/>","tags":"[\"illustrator\",\"Figma\",\"adobe photoshop\"]","pubDate":"2025-01-10T21:51:11.000Z","link":"https://remotive.com/remote-jobs/design/web-graphic-designer-1961804","slug":"web-graphic-designer-growe-2563"},{"id":6131637266,"title":"Code Wrangler - Support Tooling","company":"Automattic Careers","image":"https://remotive.com/job/1962165/logo","description":"<p>At <a href=\"%22https:/automattic.com/%22\" rel=\"nofollow\">Automattic</a>, we believe in making the web a better place, and making our workplace a happy place. We hope you can join us on this journey! </p>\n<p>To support customers of Automattic products in the WordPress ecosystem, we empower the work of our customer support agents, whom we call Happiness Engineers, through tooling. Code wranglers on our Happiness operations team are essential to our ability to provide fast and stable connections between customers and support. They automate, create, and update custom tools that help Automattic serve our customers in the best way possible. They are heroes because they make Happiness Engineers' jobs easier and more efficient, build tools to provide customer insights to product teams, and continually solve problems to improve the customer experience. </p>\n<p>We’re looking for talented engineers worldwide, excited to help Automattic’s product ecosystem and Happiness team, and join <a href=\"%22https:/automattic.com/about/%22\" rel=\"nofollow\">our mission to make the web a better place</a>. </p>\n<p><strong>What have we worked on recently?</strong></p>\n<ul style=\"\">\n<li style=\"\">Happiness Assistant Widget is a customizable chat widget that provides a seamless user experience for interacting with a product’s AI assistant.</li>\n<li style=\"\">Happiness Support API brings together AI and human interactions (Zendesk Messaging) into one conversation stream. It enables product teams to implement a bespoke support experience.</li>\n<li style=\"\">Happy Schedule is a scheduling tool that empowers our globally distributed Happiness team to achieve our coverage goals without boxing people into predefined work shifts.</li>\n<li style=\"\">AI classifiers label support interactions as they enter Zendesk to automatically triage and route them to the correct support queues.</li>\n<li style=\"\"><a href=\"%22https:/wordpress.org/gutenberg/%22\" rel=\"nofollow\">Gutenberg</a> is a new block-level editor with clean abstractions for users, too, not just developers.</li>\n<li style=\"\"><a href=\"%22https:/woocommerce.com/%22\" rel=\"nofollow\">WooCommerce</a> is the most popular e-commerce platform on the web.</li>\n<li style=\"\">To view more of our recent work, check out our longer product list on <a href=\"%22https:/automattic.com/%22\" rel=\"nofollow\">Automattic.com</a>.</li>\n</ul>\n<p><strong>How do we work?</strong></p>\n<ul style=\"\">\n<li style=\"\">We’re <a href=\"%22https:/automattic.com/creed/help-a-colleague/%22\" rel=\"nofollow\">kind to each other</a> and our users – we strive to build a positive, supportive, and inclusive culture of cohesive teams focused on delivering value to our customers.</li>\n<li style=\"\">We make up a global, distributed workforce, resulting in a unique way of working built around <a href=\"%22https:/automattic.com/creed%22\" rel=\"nofollow\">our creed</a>. </li>\n<li style=\"\">We offer flexible work arrangements, allowing our team members to work when they feel best.</li>\n<li style=\"\">We are open-source! We’re cool with <a href=\"%22https:/github.com/Automattic%22\" rel=\"nofollow\">open-sourcing</a> everything except passwords, or secret keys.</li>\n<li style=\"\">We ship often, <a href=\"%22https:/automattic.com/about/%22\" rel=\"nofollow\">deploying many</a> times daily with the help of peer code review, continuous integration, and our global workforce in over 90 countries.</li>\n<li style=\"\">We welcome collaboration, and you can be involved in any discussion across our many communication channels.</li>\n</ul>\n<p><strong>Enough about us, let’s talk more about you. The Software Engineer position might be a good fit if you:</strong></p>\n<ul style=\"\">\n<li style=\"\">Have production experience with several programming languages. We mostly use PHP and JavaScript at Automattic. You should either be familiar with them already, or the idea of using them on a daily basis should not be a blocker for you.</li>\n<li style=\"\">Have experience working on a large-scale system—making it faster, more scalable, and fault-tolerant.</li>\n<li style=\"\">Know about systems architecture.</li>\n<li style=\"\">Are highly collaborative and love participating in code reviews and discussions about architecture or design.</li>\n<li style=\"\">Are passionate about and experienced in software development; in particular, advanced JavaScript knowledge is a plus.</li>\n<li style=\"\">Are knowledgeable about design patterns and testability; experience with testing frameworks, performance testing, and unit testing is very welcome.</li>\n<li style=\"\">Are thoughtful about product design, with good user experience instincts.</li>\n<li style=\"\">Are open and able to travel 3-4 weeks per year to meet up with your teammates in person. </li>\n</ul>\n<p><strong>Extra credit:</strong></p>\n<ul style=\"\">\n<li style=\"\">Experience building and improving internal tools.</li>\n<li style=\"\">Experience developing customer support workflows and solutions.</li>\n<li style=\"\">Managing the support experience across different products.</li>\n<li style=\"\">Understanding metrics and impact to measure effective customer support.</li>\n<li style=\"\">Experience with Zendesk and Webhooks.</li>\n<li style=\"\">Experience integrating AI into existing products.</li>\n<li style=\"\">WordPress programming experience.</li>\n<li style=\"\">Open source contributions or contributions to programs designed to help. underrepresented people enter the tech field.</li>\n</ul>\n<p><strong>Speaking of interests and skills, here are some areas in which you can grow and have further impact in the future at the company:</strong></p>\n<ul style=\"\">\n<li style=\"\">Leadership: We offer a variety of leadership options to those who have interest, including becoming a team lead and managing releases.</li>\n<li style=\"\">Learning and development:We have a generous personal development budget and encourage you to grow your skills through courses, books, and conferences.</li>\n<li style=\"\">Architecture:  We encourage developers to develop expertise in the systems they work with, guide their evolution and mentor other developers working on them.</li>\n<li style=\"\">Engineering effectiveness:  We believe in helping other developers become more effective through tools, practices, cross-team collaborations, and process improvements.</li>\n</ul>\n<p>These are exciting times at Automattic, and you’ll have a unique opportunity to shape the future of our products. Join us! We look forward to hearing from you.</p>\n<p><em>Curious who works in engineering at Automattic? </em><a href=\"%22https:/www.youtube.com/watch?list=PLQFhxUeNFfdLVtK-tsuAZbDa4a-LqFZlx&amp;v=jyhYkuuzL_0%22\" rel=\"nofollow\"><em>Meet our Code Wranglers</em></a><em> – Brandon, Jeremy, Mark, Jennifer, Roy and Kat!</em> </p>\n<p><strong>What to Expect:</strong></p>\n<p>We know applying to jobs can be stressful and we want to ease the stress by giving clear expectations upfront about our process. We’ve outlined <a href=\"%22https:/automattic.com/work-with-us/how-we-hire-developers/%22\" rel=\"nofollow\">everything you need to know here</a>, including all of the steps in the process as well as how we approach hiring. </p>\n<p>Please note that we pay extra attention to your answers to the questions in the application form. They are a significant part of the hiring process, and we will review them just like we would review any other step of the hiring process. We’re always iterating, so if you happen to join us in the process, please feel free to offer feedback on what else we can include there!</p>\n<p><strong>Salary range: $70,000-$170,000 USD.</strong>  Please note that salary ranges are global, regardless of location, and we pay in local currency.</p>\n<p>We are searching for high-caliber candidates with the skills and qualities to have a net positive for Automattic. Pay will reflect the potential contribution and the impact you can bring, which may, in some cases, go beyond the range stated.</p>\n<p>This isn’t your typical work-from-home job—we are a fully-remote company with an open vacation policy. Read more about our<a href=\"%22https:/automattic.com/compensation/%22\" rel=\"nofollow\"> compensation philosophy</a>. To see a full list of benefits by country, consult our <a href=\"%22https:/automattic.com/benefits/%22\" rel=\"nofollow\">Benefits Page</a>. And check out these links to learn more about <a href=\"%22https:/automattic.com/how-we-hire/%22\" rel=\"nofollow\">How We Hire</a> and <a href=\"%22https:/automattic.com/expectations/%22\" rel=\"nofollow\">What We Expect from Ourselves</a>.</p>\n<div class='\"content-conclusion\"'>\n<p><strong>About Automattic</strong> </p>\n<p>We are the people behind <a href=\"%22http:/wordpress.com/%22\" rel=\"nofollow\">WordPress.com</a>, <a href=\"%22http:/woocommerce.com/%22\" rel=\"nofollow\">WooCommerce</a>, <a href=\"%22https:/www.tumblr.com/%22\" rel=\"nofollow\">Tumblr</a>, <a href=\"%22http:/simplenote.com/%22\" rel=\"nofollow\">Simplenote</a>, <a href=\"%22http:/jetpack.com/%22\" rel=\"nofollow\">Jetpack</a>, <a href=\"%22http:/longreads.com/%22\" rel=\"nofollow\">Longreads</a>, <a href=\"%22https:/dayoneapp.com/%22\" rel=\"nofollow\">Day One</a>, <a href=\"%22https:/www.pocketcasts.com/%22\" rel=\"nofollow\">Pocket Casts</a>, and more. We believe in making the web a better place.</p>\n<p>We’re a distributed company with more than 1700 Automatticians in 92 countries speaking 110+ different languages. And, even more than growth and profitability (although we’re plenty profitable), above all, we’re driven by a mission:  We democratize publishing and commerce so anyone with a story can tell it, and anyone with a product can sell it, regardless of income, gender, politics, language, or country.</p>\n<p><a href=\"%22https:/github.com/Automattic%22\" rel=\"nofollow\">We believe in Open Source</a>, and the vast majority of our work is available under the <a href=\"%22https:/en.wikipedia.org/wiki/GNU_General_Public_License%22\" rel=\"nofollow\">GPL</a>.</p>\n<p><strong>Diversity, Equity, &amp; Inclusion at Automattic</strong> </p>\n<p>We’re improving diversity in the tech industry. At Automattic, we want people to love their work and show respect and empathy to all. We welcome differences and strive to increase participation from traditionally underrepresented groups. Our DEI committee involves Automatticians across the company and drives grassroots change. For example, this group has helped facilitate private online spaces for affiliated Automatticians to gather and helps run a monthly DEI People Lab series for further learning. DEI is a priority at Automattic, though our dedication influences far more than just Automatticians: We make our products freely available and translate our products into and offer customer support in numerous languages. We require unconscious bias training for our hiring teams and ensure our products are accessible across different bandwidths and devices. </p>\n<p>Automattic is a <a href=\"%22https:/mostlovedworkplace.com/companies/automattic-inc/%22\" rel=\"nofollow\">Most Loved Company</a> and <a href=\"%22https:/disabilityconfident.campaign.gov.uk/%22\" rel=\"nofollow\">Disability Confident Committed</a>. (<a href=\"%22https:/happinessengineer.blog/2022/09/08/happiness-for-everyone-working-with-a-disability-at-automattic/%22\" rel=\"nofollow\">Here’s what that might mean for you</a>.) Learn more about our dedication to <a href=\"%22https:/href.li/?https://automattic.com/diversity-and-inclusion/%22\" rel=\"nofollow\">diversity, equity, and inclusion</a> and our <a href=\"%22https:/automattic.com/automattician-resource-groups/%22\" rel=\"nofollow\">Employee Resource Groups</a>.</p>\n</div>\n<img src=\"https://remotive.com/job/track/1962165/blank.gif?source=public_api\" alt=\"\"/>","tags":"[\"javascript\",\"php\",\"systems architecture\"]","pubDate":"2025-01-10T19:50:40.000Z","link":"https://remotive.com/remote-jobs/software-dev/code-wrangler-support-tooling-1962165","slug":"code-wrangler-support-tooling-automattic-careers-4807"},{"id":2441635595,"title":"Software Engineer, Storage","company":"Neon.tech","image":"https://remotive.com/job/1961861/logo","description":"<p style=\"min-height: 1.5em;\">Neon is an open-source company on a mission to create a cloud-native Postgres database service for every developer.</p>\n<p style=\"min-height: 1.5em;\"> </p>\n<p style=\"min-height: 1.5em;\">We are seeking a skilled <strong>Systems Software Engineer</strong> to join our Storage Engineering team. You will work on the Neon storage services, written in Rust:</p>\n<ul style=\"\">\n<li style=\"\">\n<p style=\"min-height: 1.5em;\">Scaling our services to support millions of databases, each of which can grow to terabytes in size.</p>\n</li>\n<li style=\"\">\n<p style=\"min-height: 1.5em;\">Optimizing throughput and latency for PostgreSQL clients</p>\n</li>\n<li style=\"\">\n<p style=\"min-height: 1.5em;\">Operating a global fleet of storage servers at a high level of reliability.</p>\n</li>\n</ul>\n<p style=\"min-height: 1.5em;\">For example, recent projects in our team included:</p>\n<ul style=\"\">\n<li style=\"\">\n<p style=\"min-height: 1.5em;\">Implementing scale-out sharding of our storage for higher capacity</p>\n</li>\n<li style=\"\">\n<p style=\"min-height: 1.5em;\">A fast vectored read path for coalescing reads of adjacent blocks</p>\n</li>\n<li style=\"\">\n<p style=\"min-height: 1.5em;\">A joint consensus mechanism for reconfiguring Paxos replication groups</p>\n</li>\n</ul>\n<p style=\"min-height: 1.5em;\">Our core storage services are open source at <a href=\"https://github.com/neondatabase/neon/\" rel=\"nofollow\" target=\"_blank\">https://github.com/neondatabase/neon/</a></p>\n<p style=\"min-height: 1.5em;\"> </p>\n<div class=\"h2\"><strong>You will also</strong></div>\n<ul style=\"\">\n<li style=\"\">\n<p style=\"min-height: 1.5em;\">Participate in the design and implementation of features</p>\n</li>\n<li style=\"\">\n<p style=\"min-height: 1.5em;\">Drive continuous improvement in code quality and robustness.</p>\n</li>\n<li style=\"\">\n<p style=\"min-height: 1.5em;\">Write highly efficient systems code with a focus on testability &amp; correctness</p>\n</li>\n<li style=\"\">\n<p style=\"min-height: 1.5em;\">Participate in on-call rotation and drive operational excellence</p>\n</li>\n</ul>\n<p style=\"min-height: 1.5em;\"> </p>\n<div class=\"h2\"><strong>We're looking for a senior-level engineer who has</strong></div>\n<ul style=\"\">\n<li style=\"\">\n<p style=\"min-height: 1.5em;\">At least 4 years of production experience as a software engineer</p>\n</li>\n<li style=\"\">\n<p style=\"min-height: 1.5em;\">Experience building high-scale systems where correctness is critical</p>\n</li>\n<li style=\"\">\n<p style=\"min-height: 1.5em;\">Experience with maintaining and developing large codebases</p>\n</li>\n<li style=\"\">\n<p style=\"min-height: 1.5em;\">Passion for building systems software. Performance engineering and distributed systems are topics that excite you!</p>\n</li>\n<li style=\"\">\n<p style=\"min-height: 1.5em;\">Passion for joining a fast-paced, early-stage startup</p>\n</li>\n<li style=\"\">\n<p style=\"min-height: 1.5em;\">Strong sense of ownership, accountability, and pride</p>\n</li>\n</ul>\n<p style=\"min-height: 1.5em;\"> </p>\n<div class=\"h2\"><strong>It would be great if you have:</strong></div>\n<ul style=\"\">\n<li style=\"\">\n<p style=\"min-height: 1.5em;\">Experience with Rust or modern C++ with an interest in learning Rust</p>\n</li>\n<li style=\"\">\n<p style=\"min-height: 1.5em;\">Experience with open-source projects and developing publicly</p>\n</li>\n</ul>\n<p style=\"min-height: 1.5em;\"> </p>\n<div class=\"h2\"><strong>About Neon</strong></div>\n<p style=\"min-height: 1.5em;\">Neon is building open-source cloud-native PostgreSQL. Our architecture separates storage from compute, allowing for serverless Postgres. We're a well-funded startup with deep knowledge of Postgres internals and decades of experience building databases. We are a systems company; we work on low-level code with strict performance and correctness requirements.</p>\n<p style=\"min-height: 1.5em;\">Neon was created by a team of Postgres hackers and led by CEO Nikita Shamgunov (co-founder of SingleStore). Neon is built on open-source principles and is focused on giving back to the Postgres and developer communities.</p>\n<p style=\"min-height: 1.5em;\"> </p>\n<div class=\"h2\"><strong>Our Team</strong></div>\n<ul style=\"\">\n<li style=\"\">\n<p style=\"min-height: 1.5em;\">We are a distributed team of 100+ people working from 25+ countries (concentrating around North American and European time zones)</p>\n</li>\n<li style=\"\">\n<p style=\"min-height: 1.5em;\">We are a team built on open-source cultural principles (transparency, contribution, accountability, and proactivity)</p>\n</li>\n<li style=\"\">\n<p style=\"min-height: 1.5em;\">Team with decades of experience building databases and deep knowledge of Postgres internals. We are deeply technical</p>\n</li>\n<li style=\"\">\n<p style=\"min-height: 1.5em;\">We have experienced Postgres committers and hackers on the team (check <a href=\"https://github.com/hlinnaka\" rel=\"nofollow\" target=\"_blank\">Heikki</a>, <a href=\"https://github.com/lubennikovaav\" rel=\"nofollow\" target=\"_blank\">Anastasia</a>, <a href=\"https://github.com/arssher\" rel=\"nofollow\" target=\"_blank\">Arseny</a>, <a href=\"https://github.com/MMeent\" rel=\"nofollow\" target=\"_blank\">Matthias</a> profiles)</p>\n</li>\n<li style=\"\">\n<p style=\"min-height: 1.5em;\">We believe in the efficacy of collaborative open-source</p>\n</li>\n<li style=\"\">\n<p style=\"min-height: 1.5em;\">We aim for a diversity of thoughts and backgrounds</p>\n</li>\n<li style=\"\">\n<p style=\"min-height: 1.5em;\">We are keen to be a fast-moving, flat org and avoid hierarchical structures</p>\n</li>\n</ul>\n<p style=\"min-height: 1.5em;\"> </p>\n<div class=\"h2\"><strong>Our Investors</strong></div>\n<ul style=\"\">\n<li style=\"\">\n<p style=\"min-height: 1.5em;\">Top-tier investors backed up Neon's vision:</p>\n<ul style=\"\">\n<li style=\"\">\n<p style=\"min-height: 1.5em;\">We raised $104 million in funding from Menlo Ventures, Notable Capital, Khosla Ventures, General Catalyst, and Founders Fund.</p>\n</li>\n<li style=\"\">\n<p style=\"min-height: 1.5em;\">Venture vehicles of Snowflake and Databricks invested in Neon.</p>\n</li>\n</ul>\n</li>\n<li style=\"\">\n<p style=\"min-height: 1.5em;\">Our angel investors are prominent technologists and ecosystem players. More than 20 awesome angels supported Neon, including Nat Friedman, Elad Gil, Mike Ovitz, Ajeet Singh, Guillermo Rauch, Søren Brammer Schmidt, and Wes McKinney.</p>\n</li>\n<li style=\"\">\n<p style=\"min-height: 1.5em;\">Our Board includes Quentin Clark, Glenn Solomon, Joe Morrissey, and Tim Tully.</p>\n</li>\n</ul>\n<p style=\"min-height: 1.5em;\"> </p>\n<div class=\"h2\"><strong>Our Offer</strong></div>\n<ul style=\"\">\n<li style=\"\">\n<p style=\"min-height: 1.5em;\">You have an opportunity to be an early employee in the fast-scaling, ambitious team</p>\n</li>\n<li style=\"\">\n<p style=\"min-height: 1.5em;\">You can work 100% remote: we'll handle all formalities to arrange work from your home</p>\n</li>\n<li style=\"\">\n<p style=\"min-height: 1.5em;\">We grant equity (stock options) to all full-time hires</p>\n</li>\n<li style=\"\">\n<p style=\"min-height: 1.5em;\">We offer a competitive benefits package in line with all tech companies (top-notch equipment, unlimited vacations, paid parental leaves, and much more)</p>\n</li>\n<li style=\"\">\n<p style=\"min-height: 1.5em;\">We are distributed, yet make our bonds during regular offsites (the last one was in Portugal)</p>\n</li>\n</ul>\n<p style=\"min-height: 1.5em;\"> </p>\n<img src=\"https://remotive.com/job/track/1961861/blank.gif?source=public_api\" alt=\"\"/>","tags":"[\"C++\",\"rust\",\"distributed systems\"]","pubDate":"2025-01-10T19:50:39.000Z","link":"https://remotive.com/remote-jobs/software-dev/software-engineer-storage-1961861","slug":"software-engineer-storage-neon-tech-9360"},{"id":8683533309,"title":"Software Engineer III, Release Engineering","company":"Wikimedia","image":"https://remotive.com/job/1962166/logo","description":"<p><strong>Software Engineer III, Release Engineering</strong></p>\n<p><strong>Summary</strong></p>\n<p>The Wikimedia Foundation is looking for a mid-level software engineer to join the Release Engineering Team.</p>\n<p>Software engineers on the Release Engineering team build development environments, maintain CI/CD infrastructure, and design tools and processes to support our developer community.</p>\n<p>Release Engineering is a geographically distributed remote team of seven people in three time zones.</p>\n<p><strong>You are responsible for:</strong></p>\n<ul style=\"\">\n<li style=\"\">Deploying Wikipedia and our other wikis</li>\n<li style=\"\">Maintaining and adding features to our continuous delivery system</li>\n<li style=\"\">Using Docker, BuildKit, and Kubernetes to enhance our deployment pipeline</li>\n<li style=\"\">Upgrading and maintaining Release Engineering tools for our large developer community:</li>\n<ul style=\"\">\n<li style=\"\">CI/CD infrastructure: Jenkins, Zuul-CI, Docker, GitLab</li>\n<li style=\"\">Code review: GitLab, Gerrit</li>\n<li style=\"\">Issue tracking: Phabricator/Phorge</li>\n<li style=\"\">Deployment tooling: Kubernetes, Helm, and custom tooling written in Python and Go</li>\n</ul>\n</ul>\n<p><strong>Skills and Experience:</strong></p>\n<ul style=\"\">\n<li style=\"\">Bachelor's degree or equivalent in related work experience</li>\n<li style=\"\">Written and verbal English communication skills sufficient for a remote work environment</li>\n<li style=\"\">Collaboration and consensus-making skills</li>\n<li style=\"\">Professional experience with systems/DevOps engineering</li>\n<li style=\"\">Experience with complex software development</li>\n<li style=\"\">Experience with continuous integration/delivery (CI/CD) systems</li>\n<li style=\"\">Experience with Kubernetes and containerization</li>\n<li style=\"\">Familiarity with server configuration management software (e.g., Ansible, SaltStack, Chef, or Puppet)</li>\n<li style=\"\">Familiarity with infrastructure as code tools (e.g., Terraform/OpenTofu)</li>\n</ul>\n<p><strong>Qualities that are important to us:</strong></p>\n<ul style=\"\">\n<li style=\"\">Professional experience with one or more of the following: Python, Go, PHP</li>\n<li style=\"\">Experience with Puppet</li>\n</ul>\n<p><strong>Being a role model for <a href=\"%22https:/wikimediafoundation.org/about/values/%22\" rel=\"nofollow\">Wikimedia's values</a></strong></p>\n<p><strong>Additionally, we’d love it if you have:</strong></p>\n<ul style=\"\">\n<li style=\"\"><a href=\"%22https:/meta.wikimedia.org/wiki/Wikimedia_Foundation_Guiding_Principles#Freedom_and_open_source%22\" rel=\"nofollow\">Free culture/Free software experience</a></li>\n<li style=\"\">Remote work experience</li>\n<li style=\"\">You are inspired by our <a href=\"%22https:/meta.wikimedia.org/wiki/Wikimedia_Foundation_Guiding_Principles%22\" rel=\"nofollow\">guiding principles</a> and our <a href=\"%22https:/wikimediafoundation.org/about/mission/%22\" rel=\"nofollow\">mission</a></li>\n<li style=\"\">Familiarity with/involvement in the Wikimedia community</li>\n<li style=\"\">Experience maintaining other specific software systems we use: Phabricator/Phorge, Jenkins, GitLab, and Gerrit</li>\n<li style=\"\"><strong>Located within UTC+3–UTC-8 time zones</strong></li>\n</ul>\n<div class=\"h4\">About the Wikimedia Foundation</div>\n<p>The Wikimedia Foundation is the nonprofit organization that operates Wikipedia and the other Wikimedia free knowledge projects. Our vision is a world in which every single human can freely share in the sum of all knowledge. We believe that everyone has the potential to contribute something to our shared knowledge, and that everyone should be able to access that knowledge freely. We host Wikipedia and the Wikimedia projects, build software experiences for reading, contributing, and sharing Wikimedia content, support the volunteer communities and partners who make Wikimedia possible, and advocate for policies that enable Wikimedia and free knowledge to thrive. </p>\n<p>The Wikimedia Foundation is a charitable, not-for-profit organization that relies on donations. We receive donations from millions of individuals around the world, with an average donation of about $15. We also receive donations through institutional grants and gifts. The Wikimedia Foundation is a United States 501(c)(3) tax-exempt organization with offices in San Francisco, California, USA.</p>\n<p><em><strong>As an equal opportunity employer, the Wikimedia Foundation values having a diverse workforce and continuously strives to maintain an inclusive and equitable workplace. We encourage people with a diverse range of backgrounds to apply. We do not discriminate against any person based upon their race, traits historically associated with race, religion, color, national origin, sex, pregnancy or related medical conditions, parental status, sexual orientation, gender identity, gender expression, age, status as a protected veteran, status as an individual with a disability, genetic information, or any other legally protected characteristics.</strong></em></p>\n<p>The Wikimedia Foundation is a remote-first organization with staff members including contractors based 40+ countries<strong>*</strong>. Salaries at the Wikimedia Foundation are set in a way that is competitive, equitable, and consistent with our values and culture. The anticipated annual pay range of this position for applicants based within the United States is US$ 88,975 o US$ 139,056 with multiple individualized factors, including cost of living in the location, being the determinants of the offered pay. For applicants located outside of the US, the pay range will be adjusted to the country of hire. We neither ask for nor take into consideration the salary history of applicants. The compensation for a successful applicant will be based on their skills, experience and location. </p>\n<p><strong>*Please note that we are currently able to hire in the following countries: </strong>Australia, Austria, Bangladesh, Belgium, Brazil, Canada, Colombia, Costa Rica, Croatia, Czech Republic, Denmark, Egypt, Estonia, Finland, France, Germany, Ghana, Greece, India, Indonesia, Ireland, Israel, Italy, Kenya, Mexico, Netherlands, Nigeria, Peru, Poland, Singapore, South Africa, Spain, Sweden, Switzerland, Uganda, United Arab Emirates, United Kingdom, United States of America and Uruguay.  Our non-US employees are hired through a local third party Employer of Record (EOR). </p>\n<p>We periodically review this list to streamline to ensure alignment with our hiring requirements. </p>\n<p>All applicants can reach out to their recruiter to understand more about the specific pay range for their location during the interview process.</p>\n<p><em><strong>If you are a qualified applicant requiring assistance or an accommodation to complete any step of the application process due to a disability, you may contact us at recruiting@wikimedia.org or +1 (415) 839-6885.</strong></em></p>\n<p><strong>More information</strong></p>\n<p><a href=\"%22https:/wikimediafoundation.org/about/jobs/#section-12%22\" rel=\"nofollow\"><strong>U.S. Benefits &amp; Perks</strong></a></p>\n<p><a href=\"%22https:/foundation.wikimedia.org/wiki/Applicant_privacy_policy%22\" rel=\"nofollow\"><strong>Applicant Privacy Policy</strong></a></p>\n<p><a href=\"%22https:/wikimediafoundation.org/%22\" rel=\"nofollow\"><strong>Wikimedia Foundation</strong></a></p>\n<p><a href=\"%22https:/www.youtube.com/watch?v=8mvPYF_erNA&amp;list=PLVx9pX-VnGVh9Akb-O-SAKZ-GDTVTHZqS&amp;index=8%22\" rel=\"nofollow\"><strong>What does the Wikimedia Foundation do?</strong></a></p>\n<p><a href=\"%22https:/www.youtube.com/watch?v=7gATwhhGrPk&amp;list=PLVx9pX-VnGVh9Akb-O-SAKZ-GDTVTHZqS&amp;index=1%22\" rel=\"nofollow\"><strong>What makes Wikipedia different from social media platforms?</strong></a></p>\n<p><a href=\"%22https:/wikimediafoundation.org/wiki/Our_projects%22\" rel=\"nofollow\"><strong>Our Projects</strong></a></p>\n<p><a href=\"%22https:/techblog.wikimedia.org/%22\" rel=\"nofollow\"><strong>Our Tech Stack</strong></a></p>\n<p><a href=\"%22https:/wikimediafoundation.org/news/%22\" rel=\"nofollow\"><strong>News from across the Wikimedia movement</strong></a></p>\n<p><a href=\"%22https:/diff.wikimedia.org/%22\" rel=\"nofollow\"><strong>Wikimedia Blog</strong></a></p>\n<p><a href=\"%22https:/meta.wikimedia.org/wiki/Strategy/Wikimedia_movement/2017%22\" rel=\"nofollow\"><strong>Wikimedia 2030</strong></a></p>\n<p> </p>\n<div id='\"l-content\"'> </div>\n<img src=\"https://remotive.com/job/track/1962166/blank.gif?source=public_api\" alt=\"\"/>","tags":"[\"docker\",\"go\",\"kubernetes\",\"python\",\"CI/CD\"]","pubDate":"2025-01-10T19:50:39.000Z","link":"https://remotive.com/remote-jobs/software-dev/software-engineer-iii-release-engineering-1962166","slug":"software-engineer-iii-release-engineering-wikimedia-3278"}]