[{"id":2638183292,"title":"QA Specialist (Remote / Anywhere)","company":"Collabora","image":"https://pbs.twimg.com/profile_images/1545121577632763912/7FMnABb0_400x400.jpg","description":"<div class=\"section page-centered\" data-qa=\"job-description\"><div>We  are looking for a detail-oriented and proactive Quality Assurance  Specialist to ensure the quality and reliability of our  products/services.</div><div><br></div><div>The  ideal candidate will have a strong understanding of QA methodologies,  excellent communication skills, and a passion for delivering top-notch  solutions.</div><div><br></div><div>As  a QA Specialist, you will collaborate with cross-functional teams to  identify and address issues, conduct thorough testing, and contribute to  the continuous improvement of our processes.</div></div><div class=\"section page-centered\"><div><h3>Responsibilities:</h3><ul class=\"posting-requirements plain-list\"><ul><li>Find a cause of the issue and test to check the fix works in a complex environment involving multi-tier web applications</li><li>Perform functional, regression and performance testing to identify and report defects or inconsistencies in product functionality</li><li>Collaborate with product development and project management teams to understand project requirements and provide input on testability and quality  aspects</li><li>Document and track test results, issues and resolution efforts to ensure clear communication and visibility of QA activities</li><li>Conduct root cause analysis for identified defects and work with the development team to facilitate timely resolutions</li><li>Contribute to the establishment and enhancement of quality assurance standards and best practices within the organization</li><li>Willingness to take part in meetings</li><li>\"Can do” attitude in different situations</li></ul></ul></div></div><div class=\"section page-centered\"><div><h3>Primary Qualifications:</h3><ul class=\"posting-requirements plain-list\"><ul><li>Proven experience in software quality assurance, with a focus on manual testing</li><li>Strong understanding of QA methodologies, tools and processes</li><li>Knowledge and experience of Linux</li><li>Excellent analytical and problem-solving skills</li><li>Strong communication and collaboration skills with the ability to work effectively in a team environment</li><li>Detail-oriented with a commitment to delivering high-quality results</li></ul></ul></div></div><div class=\"section page-centered\"><div><h3>Additional Skills:</h3><ul class=\"posting-requirements plain-list\"><ul><li>Bachelor's degree in Computer Science, Engineering, or a related field</li><li>Experience with test automation tools and frameworks is a plus (e.g., Cypress, Cppunit)</li><li>Experience working in an open source environment is a plus</li></ul></ul></div></div><div class=\"section page-centered\" data-qa=\"closing-description\"><div>If you are passionate about ensuring the highest level of quality in products/services and are ready to contribute to a dynamic and  innovative team, we encourage you to apply.</div><div><br></div><div>Join us in our commitment to excellence and be a key player in our continued success.</div><div><br></div><div><br></div><div><br></div><div>#LI-Remote</div></div><div class=\"section page-centered last-section-apply\" data-qa=\"btn-apply-bottom\"><a class=\"postings-btn template-btn-submit hex-color\" data-qa=\"show-page-apply\" href=\"https://jobs.lever.co/collabora/fe632e11-5ffb-4892-b983-012036488066/apply\">Apply for this job</a></div>","tags":"[\"management\",\"engineering\"]","pubDate":"2024-05-28 08:34:09.960","link":"https://jobs.lever.co/collabora/fe632e11-5ffb-4892-b983-012036488066","savedDate":"2024-05-28 08:34:09.960","slug":"qa-specialist-remote-anywhere-collabora-1373"},{"id":5111279290,"title":"Graduate Sales Development Representative","company":"Canonical","image":"https://pbs.twimg.com/profile_images/1673959375340290050/x7pNtXQ7_400x400.jpg","description":"\n      <p>Canonical is a global software company that publishes Ubuntu and open-source enterprise solutions for cloud, developer, IoT and AI. Ubuntu is the fastest growing Linux distribution and ranks as the number #1 OS&nbsp; in the cloud.</p>\n<p>In partnership with Google, Amazon, IBM and Microsoft, Canonical helps companies become more agile, productive and adopt new technologies faster. Examples of customer success include&nbsp; AI, Blockchain, IoT, Advanced Robotics and self-driving cars, where Ubuntu is the preferred development platform.</p>\n<p><strong>The role of a Sales Development Representative at Canonical</strong></p>\n<p>Canonical is profitable and growing. We consider our sales development organization to be the best technology sales academy in the market, and as such, we select exceptional and ambitious candidates to join our team. You will enjoy this role if you are organized, persistent, charismatic, and hard-working. You will need to be interested in tech and its business implications. In this role, you will collaborate with a regional sales and marketing team, and your primary objective is to find customer projects that fit our product lines and spread the good name of Canonical across multiple different industries and geographies.</p>\n<p>Click <a href=\"https://youtu.be/ufnDZIWpcjg\">HERE</a>&nbsp; to watch our SDR team discuss their role in Canonical</p>\n<p><strong>What your day will look like</strong></p>\n<ul>\n<li>Handle inbound customer inquiries across email, phone and chat</li>\n<li>Execute outbound sales &amp; marketing campaigns</li>\n<li>Travel to events and conferences worldwide, presenting on booths and driving face-to-face marketing and sales opportunities</li>\n<li>Collaborate across multiple teams and senior stakeholders to drive results&nbsp;</li>\n<li>Work directly with marketing on campaigns</li>\n<li>Research information about prospective customers</li>\n<li>Generate a multi-million pound pipeline</li>\n<li>Identify prospects and market trends</li>\n<li>Help define the processes and policies for the team</li>\n<li>Liaise with new and existing customers, setting up and attending meetings whilst actively mapping accounts to identify new opportunities</li>\n<li>Accurately create, update, maintain and nurture leads on global opportunities</li>\n</ul>\n<p><strong>What we are looking for in you</strong></p>\n<ul>\n<li>Excellent academic results at school and university</li>\n<li>Passion for business and technology</li>\n<li>Commitment to continuous learning and improvement - curious, flexible, scientific</li>\n<li>Creative problem solving and cross team collaboration</li>\n<li>Verbal and written communication skills</li>\n<li>Result driven with an over-achiever spirit</li>\n<li>Persistence &amp; perseverance</li>\n</ul>\n<p><strong>What we offer you</strong></p>\n<p>Your base pay will depend on various factors including your geographical location, level of experience, knowledge and skills. In addition to the benefits above, certain roles are also eligible for additional benefits and rewards including annual bonuses and sales incentives based on revenue or utilisation. Our compensation philosophy is to ensure equity right across our global workforce.&nbsp;&nbsp;</p>\n<p>In addition to a competitive base pay, we provide all team members with additional benefits, which reflect our values and ideals. Please note that additional benefits may apply depending on the work location and, for more information on these, please ask your Talent Partner.</p>\n<ul>\n<li>Personal learning and development budget of 2,000USD per year</li>\n<li>Annual compensation review</li>\n<li>Recognition rewards</li>\n<li>Annual holiday leave</li>\n<li>Parental Leave</li>\n<li>Employee Assistance Programme</li>\n<li>Opportunity to travel to new locations to meet colleagues at ‘sprints’</li>\n<li>Priority Pass for travel and travel upgrades for long haul company events</li>\n</ul>\n<p><strong><em>Canonical is an equal opportunity employer</em></strong></p>\n<p>We are proud to foster a workplace free from discrimination. Diversity of experience, perspectives, and background create a better work environment and better products. <a href=\"https://canonical.com/careers/diversity/identity\">Whatever your identity, we will give your application fair consideration.</a></p>\n\n<p>#LI-remote&nbsp;</p>\n    ","tags":"[]","pubDate":"2024-05-28 08:34:09.959","link":"https://canonical.com/careers/5915299","savedDate":"2024-05-28 08:34:09.959","slug":"graduate-sales-development-representative-canonical-7890"},{"id":1924670669,"title":"Customer Champion","company":"Expensify","image":"https://pbs.twimg.com/profile_images/1387074696831672327/C7WTpiAb_400x400.jpg","description":"<div class=\"sqs-block html-block sqs-block-html\" data-block-type=\"2\" data-border-radii=\"{&quot;topLeft&quot;:{&quot;unit&quot;:&quot;px&quot;,&quot;value&quot;:0.0},&quot;topRight&quot;:{&quot;unit&quot;:&quot;px&quot;,&quot;value&quot;:0.0},&quot;bottomLeft&quot;:{&quot;unit&quot;:&quot;px&quot;,&quot;value&quot;:0.0},&quot;bottomRight&quot;:{&quot;unit&quot;:&quot;px&quot;,&quot;value&quot;:0.0}}\" id=\"block-1be9e68add57e5a3b2f2\"><div class=\"sqs-block-content\">\n\n<div class=\"sqs-html-content\">\n  <h2 style=\"white-space:pre-wrap;\">Your Mission, Should You Choose To Accept </h2><p class=\"\" style=\"white-space:pre-wrap;\">Join our passionate team of customer experts to solve a real-world problem, and help people spend less time managing expenses and more time pursuing their real goals. As we revolutionize the way people manage their expenses, being part of the Expensify team means building the easiest, fastest, and most efficient platform to automate everything expense-related.</p><h2 style=\"white-space:pre-wrap;\">Customer Champions At Expensify </h2><p class=\"\" style=\"white-space:pre-wrap;\">The Expensify Concierge team is responsible for guaranteeing an amazing end to end user experience for all customers by being Expensify product experts. We work closely alongside a tight network of internal and external partners to manage the Expensify customer ecosystem. We take a unique immersive approach to understanding every part of the customer journey: from account management, frontline support and troubleshooting, KYC checks, quality assurance, documentation, to producing training material, and more - this is a generalist Customer Champion role like no other!&nbsp;</p><h2 style=\"white-space:pre-wrap;\"><strong>About You </strong></h2><ul data-rte-list=\"default\"><li><p class=\"\" style=\"white-space:pre-wrap;\">You are eager to grind through a stack of well-defined, repeatable micro-tasks every day, with attention to detail and sustained urgency.</p></li><li><p class=\"\" style=\"white-space:pre-wrap;\">You revel in improving processes to make your micro-tasks more efficient and scalable.</p></li><li><p class=\"\" style=\"white-space:pre-wrap;\">You are able to discover and teach yourself the nuanced details of a complex, continuously changing product serving a sophisticated, international accounting audience with minimal support.</p></li><li><p class=\"\" style=\"white-space:pre-wrap;\">You are patient and calm when things go wrong, recognizing that you are directly responsible for hearing and managing customer concerns with a positive spirit.</p></li><li><p class=\"\" style=\"white-space:pre-wrap;\">You are a skilled communicator, especially in written form, to simplify financial topics to customers and complex topics to your teammates.&nbsp;</p></li><li><p class=\"\" style=\"white-space:pre-wrap;\">You thrive in an environment with minimal supervision and can stay on task and find ways to fill your extra time constructively without a direct manager.</p></li><li><p class=\"\" style=\"white-space:pre-wrap;\">You are tech-savvy and can learn new tools, both open and proprietary, as well as largely support your own IT needs.</p></li><li><p class=\"\" style=\"white-space:pre-wrap;\">You embrace change when the company changes and grow to ensure you get better year after year.&nbsp;</p></li><li><p class=\"\" style=\"white-space:pre-wrap;\">You collaborate with enthusiasm and humility, without regard for whose idea is best, and celebrate being wrong as an opportunity for self-improvement.</p></li><li><p class=\"\" style=\"white-space:pre-wrap;\">You’re excited by our culture of <a href=\"https://we.are.expensify.com/inclusion\"><span style=\"text-decoration:underline\">Live Rich, Have Fun, and Save the World</span></a>, and have an ambition you’re incredibly passionate about that Expensify can help you achieve.</p></li></ul><h2 style=\"white-space:pre-wrap;\">Daily Focus &amp; Responsibilities </h2><h3 style=\"white-space:pre-wrap;\"><br><strong>Operational Support: Protecting Expensify and customer funds</strong></h3><ul data-rte-list=\"default\"><li><p class=\"\" style=\"white-space:pre-wrap;\">Directly managing banking operations KYC flows</p></li><li><p class=\"\" style=\"white-space:pre-wrap;\">Diligently following operational protocols and written instructions across a broad range of operational tasks&nbsp;</p></li><li><p class=\"\" style=\"white-space:pre-wrap;\">Flagging and blocking fraud risks</p></li></ul><p class=\"\" style=\"white-space:pre-wrap;\"><strong>Account Management: Building and maintaining strong customer relationships with our biggest enterprise users and increase retention</strong></p><ul data-rte-list=\"default\"><li><p class=\"\" style=\"white-space:pre-wrap;\">Actively engaging key contacts over chat and calls</p></li><li><p class=\"\" style=\"white-space:pre-wrap;\">Educating users on best practices and in-product solutions to their problems</p></li><li><p class=\"\" style=\"white-space:pre-wrap;\">Upselling the adoption of new features</p></li><li><p class=\"\" style=\"white-space:pre-wrap;\">Researching and understanding advanced features like APIs, accounting, and HR integrations</p></li><li><p class=\"\" style=\"white-space:pre-wrap;\">Identifying, responding to, and reversing churn signals</p></li></ul><p class=\"\" style=\"white-space:pre-wrap;\"><strong>Frontline Customer Support: Maintaining standards of excellence across our multiple support tiers </strong></p><ul data-rte-list=\"default\"><li><p class=\"\" style=\"white-space:pre-wrap;\">Developing and delivering high-quality training</p></li><li><p class=\"\" style=\"white-space:pre-wrap;\">Quality assuring frontline support customer interactions&nbsp;</p></li><li><p class=\"\" style=\"white-space:pre-wrap;\">Meeting KPIs&nbsp;</p></li></ul><p class=\"\" style=\"white-space:pre-wrap;\"><strong>Product Support: Identifying and resolving bugs</strong></p><ul data-rte-list=\"default\"><li><p class=\"\" style=\"white-space:pre-wrap;\">Triaging and troubleshooting user errors</p></li><li><p class=\"\" style=\"white-space:pre-wrap;\">Gathering comprehensive details about customer bugs, and being able to classify bugs based on their severity and the extent to which they affect user experience or system functionality</p></li><li><p class=\"\" style=\"white-space:pre-wrap;\">Working alongside our engineering community to identify and deploy solutions&nbsp;</p></li><li><p class=\"\" style=\"white-space:pre-wrap;\">Developing and sharing expertise of Expensify and its partners’ platforms</p></li><li><p class=\"\" style=\"white-space:pre-wrap;\">Synthesizing customer feedback and data to inform decisions on the product roadmap and product improvements</p></li></ul><h2 style=\"white-space:pre-wrap;\"><strong>We’re Looking For Someone Who Can  <br></strong></h2><ul data-rte-list=\"default\"><li><p class=\"\" style=\"white-space:pre-wrap;\">Context switch their #focus between multiple problem areas across every working day</p></li><li><p class=\"\" style=\"white-space:pre-wrap;\">Fix the small things AND the big things with the same can-do positive attitude and #humility</p></li><li><p class=\"\" style=\"white-space:pre-wrap;\">Deliver quality #results by taking a concept from ideation to execution</p></li><li><p class=\"\" style=\"white-space:pre-wrap;\">Work autonomously with a good awareness of how to self-service vs when to ask for help</p></li><li><p class=\"\" style=\"white-space:pre-wrap;\">Show commitment to developing diverse new skill sets that directly help the team</p></li><li><p class=\"\" style=\"white-space:pre-wrap;\">Express themselves confidently and effectively in both written and verbal contexts</p></li><li><p class=\"\" style=\"white-space:pre-wrap;\">Break down technical concepts in non-technical and jargon-free language</p></li><li><p class=\"\" style=\"white-space:pre-wrap;\">Ask AND answer questions thoughtfully, by proactively taking time to share knowledge with others</p></li><li><p class=\"\" style=\"white-space:pre-wrap;\">Think critically and apply reasoning to solve problems when written instructions do not exist</p></li><li><p class=\"\" style=\"white-space:pre-wrap;\">Use logic and research to surface what opportunities are the best use of resources for ROI&nbsp;</p></li></ul><h2 style=\"white-space:pre-wrap;\"><strong>Compensation &amp; Benefits  <br></strong></h2><ul data-rte-list=\"default\"><li><p class=\"\" style=\"white-space:pre-wrap;\">Full-time, salaried position</p></li><li><p class=\"\" style=\"white-space:pre-wrap;\">401k with employer match</p></li><li><p class=\"\" style=\"white-space:pre-wrap;\">100% Medical/Dental/Mental Health support/Vision contributions</p></li><li><p class=\"\" style=\"white-space:pre-wrap;\">$20k annual family planning benefit through Carrot</p></li><li><p class=\"\" style=\"white-space:pre-wrap;\">Up to three months of fully paid parental leave, with up to six months for birthing parents</p></li><li><p class=\"\" style=\"white-space:pre-wrap;\">Commuter benefits</p></li><li><p class=\"\" style=\"white-space:pre-wrap;\">Flexible vacation policy</p></li></ul><h2 style=\"white-space:pre-wrap;\"><strong>Next Steps </strong></h2><p class=\"\" style=\"white-space:pre-wrap;\">Like what you see? Applying is easy, but it takes time. See, while we know you're awesome, it's actually really hard and time-consuming to find you in the midst of literally hundreds of other applications we get from everyone else. So this is where we're going to ask our first favor: can you make it really easy and obvious how great you are, so we don't accidentally overlook you? There are many ways to do that, but the easiest way to help us out is by answering the following questions:</p><ol data-rte-list=\"default\"><li><p class=\"\" style=\"white-space:pre-wrap;\">When did you first start supporting customers, and what is your proudest customer success story from your career so far?</p></li><li><p class=\"\" style=\"white-space:pre-wrap;\">Can you describe a time when you dealt with a particularly complex customer situation? What were the challenges involved, and what specific actions did you take to achieve a positive resolution?</p></li><li><p class=\"\" style=\"white-space:pre-wrap;\">If you were tasked with analyzing customer behavior and recommending product-driven solutions, how would you approach that problem?</p></li><li><p class=\"\" style=\"white-space:pre-wrap;\">What do you want to do with the rest of your life, and how is Expensify a step toward your long-term goals? <em>(We’re serious, we want to know! Share what you’re comfortable sharing, but we are a group of ambitious individuals building a community of people who want to achieve success in every aspect of our lives, and we encourage employees to figure out how they can use Expensify to realize their personal goals with the support of the company around them.)</em></p></li><li><p class=\"\" style=\"white-space:pre-wrap;\">How did you hear about us? A job posting? Chalk on a sidewalk? From a friend? Let us know where you saw this opening.</p></li></ol><p class=\"\" style=\"white-space:pre-wrap;\"><strong>Please note that we are only looking for candidates who are based in San Francisco, CA, or Portland, OR.</strong> </p><h2 style=\"white-space:pre-wrap;\"><strong>Resume not your thing? That’s great, we don’t really read them anyway! Forward your responses to the questions to </strong><a href=\"mailto:apply@expensify.com\">apply@expensify.com</a><strong>. We're excited to hear from you!</strong></h2>\n</div>\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n  \n  \n\n\n\n</div></div>","tags":"[\"management\",\"engineering\"]","pubDate":"2024-05-28 08:34:09.957","link":"https://we.are.expensify.com/customer-champion","savedDate":"2024-05-28 08:34:09.957","slug":"customer-champion-expensify-4913"},{"id":3313863427,"title":"Technical Data Analyst","company":"SafetyWing","image":"https://pbs.twimg.com/profile_images/1177267684574208000/54eG3WmW_400x400.jpg","description":"<h2>🧘 What we offer</h2> <ul><li><!--block-->Fully remote work environment – work from anywhere globally.&nbsp;</li><li><!--block-->Competitive compensation.</li><li><!--block-->Global coverage with Remote Health and Nomad Insurance.</li><li><!--block-->A minimum of 20 days of compensated time off each year.</li><li><!--block-->Referral bonus - an incentive program rewarding you for helping us find exceptional talent to join our team.</li><li><!--block-->Opportunity to unlock more benefits as your tenure with SafetyWing grows.</li></ul><div><!--block-->We are looking forward to hearing from you!</div> <div><!--block--><strong>SafetyWing</strong> (YC W18) is seeking a <strong>Technical Data Analyst</strong> interested in building a global safety net.</div><div><!--block--><br>We are building a global social safety net, including health and retirement for remote workers worldwide, as a replacement for national welfare systems. If we succeed, we believe this will help ensure freedom and equal opportunity for everyone, and it is one of the more important tasks of our time that no one else is working on.</div><div><!--block--><br><strong>👩‍💻 About this Role</strong></div><div><!--block--><br>You will be part of a small analytics team supporting the organization by creating tools and insights to keep track of the facts and help people work smarter.</div> <h2>💻 Your responsibilities will include</h2>  <ul><li><!--block-->Design and implement visually compelling Tableau dashboards that drive actionable insights.</li><li><!--block-->Streamline and restructure our current Tableau environment, ensuring efficient organization and ease of use.</li><li><!--block-->Vigilantly monitor and validate data consistency across dashboards and reports, ensuring we trust every bit.</li><li><!--block-->Perform complex data transformations using SQL, ensuring our insights are based on the best possible datasets.</li><li><!--block-->Revamp our analytics by transforming raw Google Analytics data into insightful reports. Plus, champion the implementation of effective tracking via Google Tag Manager (GTM).</li></ul><div><!--block--><br></div> <h2>👩‍💻 We are looking for someone who has</h2> <ul><li><!--block-->experience as a data analyst and a deep understanding of popular data analysis tools and data warehouse technologies such as Tableau and Google bigQuery</li><li><!--block-->outstanding analytical skills with the ability to collect, organize, analyze, and disseminate significant amounts of information with attention to detail and accuracy</li></ul><div><!--block-->🤖<strong> Tools we use:</strong></div><ul><li><!--block-->Tableau</li><li><!--block-->Google bigQuery</li><li><!--block-->Python</li><li><!--block-->SQL</li><li><!--block-->Airflow</li></ul><div><!--block--><strong>😀 We like to work with people who:</strong></div><ul><li><!--block-->Want to help build a global social safety net on the Internet.</li><li><!--block-->Think for themselves instead of copying others.</li><li><!--block-->Are willing to try new things, even with the risk of failure.</li><li><!--block-->Are intellectually curious and open to new ideas.</li><li><!--block-->Are creative and bold in the face of any problems.</li><li><!--block-->Have strong integrity and do the right thing.</li></ul><div><!--block--><br></div>","tags":"[]","pubDate":"2024-05-28 08:34:09.956","link":"https://safetywing.pinpointhq.com/en/jobs/177969","savedDate":"2024-05-28 08:34:09.956","slug":"technical-data-analyst-safetywing-8113"},{"id":6508089025,"title":"Global Events Coordinator and Host","company":"SafetyWing","image":"https://pbs.twimg.com/profile_images/1177267684574208000/54eG3WmW_400x400.jpg","description":"<h2>🧘 What we offer</h2> <ul><li><!--block-->Fully remote work environment – work from anywhere globally.&nbsp;</li><li><!--block-->Competitive compensation.</li><li><!--block-->Global coverage with Remote Health and Nomad Insurance.</li><li><!--block-->A minimum of 20 days of compensated time off each year.</li><li><!--block-->Referral bonus - an incentive program rewarding you for helping us find exceptional talent to join our team.</li><li><!--block-->Opportunity to unlock more benefits as your tenure with SafetyWing grows.</li></ul><div><!--block-->We are looking forward to hearing from you!</div><div><!--block--><br></div> <div><!--block--><a href=\"https://safetywing.com/\"><strong>SafetyWing</strong></a> (YC W18) is seeking a creative event coordinator to make our team gatherings and virtual team gatherings something our team loves so much that they’ll tell their friends about it.&nbsp;</div><div><!--block-->If you're someone who loves planning, organizing, and hosting events, from big team gatherings to smaller meetings, then this could be the perfect role for you</div><div><!--block--><br></div><div><!--block-->We are on a mission to remove the role of geographical borders as a barrier to equal opportunities and freedom for everyone. And we are doing that by creating simple health, insurance, and retirement products for remote workers worldwide as a replacement for national welfare systems.</div> <h2>💻 Your responsibilities will include</h2>  <ul><li><!--block-->Create and host our team gatherings around the world, as well as online all-hands sessions and virtual team gatherings.</li><li><!--block-->Create fun and engaging programming for our gatherings, ensuring that everyone has a joyful and productive time.</li><li><!--block-->Booking venues and arranging transportation with great taste and judgment to create a unique and magical experience.</li><li><!--block-->Create a fun and welcoming atmosphere for everyone, whether we're meeting in person or online.</li><li><!--block-->Research exciting locations around the world. Our previous team gatherings were in Ljubljana, San Francisco, Mexico, Bali, and Siglufjörður.</li><li><!--block-->Find great and unique venues and partners for our events and ensure everything runs smoothly with our vendors and service providers.</li><li><!--block-->&nbsp;Collect feedback after each event to share ideas and keep track of what the team enjoys the most and areas where we can improve.</li></ul> <h2>🧪 We are looking for someone who</h2> <ul><li><!--block-->Has experience organizing great events, big and small, with a creative touch.</li><li><!--block-->Possesses strong organizational skills and pays attention to detail, including experience with event budgeting and expense tracking.</li><li><!--block-->Excels in communication, especially when collaborating with people from all over the world.</li><li><!--block-->Is an expert in leveraging technology and integrating innovative tools and software to elevate event planning processes and experiences.</li><li><!--block-->Is open to occasional travel for in-person events.</li><li><!--block-->Is a great speaker and adept at engaging with and energizing the audience.</li><li><!--block-->Has the ability to plan a project, gather the resources through and see it through to completion no matter what challenges you encounter</li><li><!--block-->Has good judgment in creating something people love so much they tell their friends.</li></ul><div><!--block--><strong>😀 We like to work with people who:</strong></div><ul><li><!--block-->Want to help build a global social safety net on the Internet.</li><li><!--block-->Think for themselves instead of copying others.</li><li><!--block-->Are willing to try new things, even with the risk of failure.</li><li><!--block-->Are intellectually curious and open to new ideas.</li><li><!--block-->Are creative and bold in the face of any problems.</li><li><!--block-->Have strong integrity and do the right thing.</li></ul>","tags":"[]","pubDate":"2024-05-28 08:34:09.956","link":"https://safetywing.pinpointhq.com/en/jobs/191315","savedDate":"2024-05-28 08:34:09.956","slug":"global-events-coordinator-and-host-safetywing-5635"},{"id":6791127807,"title":"Social Copywriter","company":"Supraoracles","image":"https://remotive.com/job/1914430/logo","description":"<div class='\"content-intro\"'>\n<div class=\"h1\"><strong>Who We Are</strong></div>\n<p>Supra is pioneering the future of information services in global markets. As an exciting, ambitious, and well-funded startup with unique technical capabilities, we aim to be a future leader in decentralized data. Our team includes professionals, academics, and advisors with experience from leading institutions such as Purdue University, University of Cambridge, University of Pennsylvania, Columbia University, and University of Oxford. Additionally, our industry experience includes prestigious companies like JPMorgan Chase &amp; Co., Qualcomm, ConsenSys, and Binance. Based in Switzerland with a remote-first policy, our globally distributed team spans over 35 countries. We are dedicated to solving the Oracle Dilemma through innovative solutions in consensus mechanisms, real-time data services, decentralized finance (DeFi), and Layer 1 (L1) technologies.</p>\n<p>Trust, kindness, honesty, and a commitment to ethical, decentralized technologies are the cornerstones of our culture.</p>\n<p> </p>\n</div>\n<p> </p>\n<div class=\"h1\"><strong>What we’re looking for</strong></div>\n<p>Supra is looking for a Social Copywriter with agency experience, who is well versed in Web3 culture - from decentralization, to memes. You’re part Satoshi, part reply guy. And you can seamlessly switch your writing voice from a pontificating decentralization philosopher, to a pithy memecoin degen. </p>\n<div class=\"h1\"><strong>Responsibilities</strong></div>\n<ul style=\"\">\n<li style=\"\">Write for multiple X handles under the Supra brand, in a variety of voices</li>\n<li style=\"\">Write long-form technical pieces regarding our Web3 stack</li>\n<li style=\"\">Write witty replies and retweets</li>\n<li style=\"\">Monitor comments and respond accordingly</li>\n<li style=\"\">Monitor Web3 culture by living eternally online</li>\n<li style=\"\">Create memes on your own</li>\n</ul>\n<div class=\"h2\"><strong>Ideal candidate has</strong></div>\n<ul style=\"\">\n<li style=\"\">Passion for Web3 culture and tech</li>\n<li style=\"\">A track record of exponential follower growth</li>\n<li style=\"\">The ability to intuit what social algorithms are doing beneath the surface</li>\n<li style=\"\">A love for data and a track record of putting it to use</li>\n</ul>\n<div class=\"h2\"><strong>Preferred skills</strong></div>\n<ul style=\"\">\n<li style=\"\">Quick copy turnaround is essential</li>\n<li style=\"\">Understanding of Blockchain technology and Web3</li>\n<li style=\"\">Proficient in AI image generation</li>\n</ul>\n<div class=\"h1\"><br><br></div>\n<div class='\"content-conclusion\"'>\n<div class=\"h1\"><strong>What's In It For You</strong></div>\n<p>Joining Supra means joining a fast-growing startup with a diverse and dynamic team. Every role is impactful, allowing you to engage in meaningful work that contributes to our success.</p>\n<p>You will enjoy the flexibility of a fully remote environment with adaptable working hours, enabling you to work from anywhere globally.</p>\n<ul style=\"\">\n<li style=\"\"><strong>Competitive Compensation:</strong> We offer competitive salaries for full-time, salaried positions.</li>\n<li style=\"\"><strong>Work-Life Balance:</strong> Flexible PTO, sick leave, and unpaid time off.</li>\n<li style=\"\"><strong>National Holidays:</strong> Paid national holidays specific to your country.</li>\n<li style=\"\"><strong>Health Benefits:</strong> Medical, dental, and vision benefits for full-time employees.</li>\n</ul>\n<p><strong>Getting Started with Supra</strong></p>\n<p>We believe in giving you the space to settle in. Your first month is about orientation and learning:</p>\n<ul style=\"\">\n<li style=\"\">Engage with your team to understand our business, vision, mission, and strategic goals.</li>\n<li style=\"\">Enhance your skills to navigate the evolving DeFi landscape.</li>\n<li style=\"\">Absorb our core values and establish connections with your colleagues through one-on-one meetings.</li>\n<li style=\"\">Familiarize yourself with the tools and processes vital to our operations.</li>\n<li style=\"\">Analyze our product offerings and contribute to discussions that shape our future.</li>\n</ul>\n<p>We're here to support your integration and ensure you have the resources you need!</p>\n<p><strong>Looking Ahead</strong></p>\n<p>Regular check-ins with your manager will help align your priorities with our team and company goals, setting you up for success. At Supra, you're not just joining a company but embarking on a journey to enhance blockchain technology with a team of exceptional individuals.</p>\n</div>\n<img src=\"https://remotive.com/job/track/1914430/blank.gif?source=public_api\" alt=\"\"/>","tags":"[\"oracle\",\"blockchain\",\"AI/ML\",\"startup\"]","pubDate":"2024-05-26 13:21:20.000","link":"https://remotive.com/remote-jobs/writing/social-copywriter-1914430","savedDate":"2024-05-28 08:34:09.954","slug":"social-copywriter-supraoracles-2540"},{"id":7061029531,"title":"Junior Recruitment Assistant","company":"Supraoracles","image":"https://remotive.com/job/1914550/logo","description":"<div class='\"content-intro\"'>\n<div class=\"h1\"><strong>Who We Are</strong></div>\n<p>Supra is pioneering the future of information services in global markets. As an exciting, ambitious, and well-funded startup with unique technical capabilities, we aim to be a future leader in decentralized data. Our team includes professionals, academics, and advisors with experience from leading institutions such as Purdue University, University of Cambridge, University of Pennsylvania, Columbia University, and University of Oxford. Additionally, our industry experience includes prestigious companies like JPMorgan Chase &amp; Co., Qualcomm, ConsenSys, and Binance. Based in Switzerland with a remote-first policy, our globally distributed team spans over 35 countries. We are dedicated to solving the Oracle Dilemma through innovative solutions in consensus mechanisms, real-time data services, decentralized finance (DeFi), and Layer 1 (L1) technologies.</p>\n<p>Trust, kindness, honesty, and a commitment to ethical, decentralized technologies are the cornerstones of our culture.</p>\n<p> </p>\n</div>\n<div class=\"h1\">What we're looking for</div>\n<p>We are seeking a Junior Recruitment Assistant with substantial experience in tech recruitment, specifically 3-4 years in the tech industry and 2-3 years in the Web3 space, with exceptional interpersonal and critical thinking skills who can manage and foster new hires for our engineering and technical teams. This position requires a professional who is adept at managing complex recruitment processes and maintaining high standards of confidentiality and efficiency in a dynamic environment.  We are growing rapidly and need the resources to keep up with our growth and continue to grow the best blockchain oracle in the world.  </p>\n<p>If you’re the right candidate, you’ll be passionate about finding candidates who are passionate about the future of data and the potential of DeFi, computer science, blockchain, and technology.</p>\n<p>We prefer a technical candidate with experience in finding senior and lead-level engineers who are willing to push themselves and continue learning new technologies at breakneck speeds.</p>\n<div class=\"h1\">Responsibilities</div>\n<ul style=\"\">\n<li style=\"\">Prepare and manage recruitment communications with the utmost confidentiality and trustworthiness.</li>\n<li style=\"\">Maintain and optimize the Applicant Tracking System (ATS) for efficiency and compliance.</li>\n<li style=\"\">Take part in outsourcing candidates </li>\n<li style=\"\">Post and remove job listings, manage applications, and ensure a seamless flow of information.</li>\n<li style=\"\">Demonstrate exceptional administrative skills and strong problem-solving capabilities.</li>\n<li style=\"\">Effectively prioritize and manage time to ensure timely completion of recruitment tasks.</li>\n<li style=\"\">Exhibit reliability, dependability, and strong motivation in all professional endeavors.</li>\n<li style=\"\">Maintain excellent organizational skills and the ability to communicate orally and in writing effectively.</li>\n<li style=\"\">Work efficiently in a fast-paced environment while maintaining a keen attention to detail.</li>\n<li style=\"\">Handle multiple tasks simultaneously, balancing various recruitment activities with ease.</li>\n<li style=\"\">Deliver exceptional client service, catering to both internal and external stakeholders.</li>\n<li style=\"\">Display flexibility and willingness to work additional hours as needed to meet departmental goals.</li>\n</ul>\n<div class=\"h1\">Are you the right person for this role?</div>\n<p>The ideal candidate for us has:</p>\n<div class=\"h3\"><strong>Qualifications</strong></div>\n<ul style=\"\">\n<li style=\"\">Must possess a BS/BA degree from an accredited institution.</li>\n<li style=\"\">At least 3-4 years of experience in tech recruitment, with an additional 2-3 years explicitly focused on Web3 recruitment and engineering/tech roles.</li>\n<li style=\"\">Demonstrated ability to manage sensitive and confidential information with integrity.</li>\n<li style=\"\">Proven administrative, organizational, and problem-solving skills.</li>\n<li style=\"\">Strong communication skills and the ability to manage tasks effectively across a distributed team.</li>\n<li style=\"\">Have experience with outsourcing for candidates</li>\n</ul>\n<div class=\"h3\">Preferred Skills:</div>\n<ul style=\"\">\n<li style=\"\">Experience with global hiring practices </li>\n<li style=\"\">Proficiency in using advanced recruitment software and ATS functionalities.</li>\n<li style=\"\">A proactive approach to recruitment, constantly seeking to refine and enhance processes.</li>\n</ul>\n<div class='\"content-conclusion\"'>\n<div class=\"h1\"><strong>What's In It For You</strong></div>\n<p>Joining Supra means joining a fast-growing startup with a diverse and dynamic team. Every role is impactful, allowing you to engage in meaningful work that contributes to our success.</p>\n<p>You will enjoy the flexibility of a fully remote environment with adaptable working hours, enabling you to work from anywhere globally.</p>\n<ul style=\"\">\n<li style=\"\"><strong>Competitive Compensation:</strong> We offer competitive salaries for full-time, salaried positions.</li>\n<li style=\"\"><strong>Work-Life Balance:</strong> Flexible PTO, sick leave, and unpaid time off.</li>\n<li style=\"\"><strong>National Holidays:</strong> Paid national holidays specific to your country.</li>\n<li style=\"\"><strong>Health Benefits:</strong> Medical, dental, and vision benefits for full-time employees.</li>\n</ul>\n<p><strong>Getting Started with Supra</strong></p>\n<p>We believe in giving you the space to settle in. Your first month is about orientation and learning:</p>\n<ul style=\"\">\n<li style=\"\">Engage with your team to understand our business, vision, mission, and strategic goals.</li>\n<li style=\"\">Enhance your skills to navigate the evolving DeFi landscape.</li>\n<li style=\"\">Absorb our core values and establish connections with your colleagues through one-on-one meetings.</li>\n<li style=\"\">Familiarize yourself with the tools and processes vital to our operations.</li>\n<li style=\"\">Analyze our product offerings and contribute to discussions that shape our future.</li>\n</ul>\n<p>We're here to support your integration and ensure you have the resources you need!</p>\n<p><strong>Looking Ahead</strong></p>\n<p>Regular check-ins with your manager will help align your priorities with our team and company goals, setting you up for success. At Supra, you're not just joining a company but embarking on a journey to enhance blockchain technology with a team of exceptional individuals.</p>\n</div>\n<img src=\"https://remotive.com/job/track/1914550/blank.gif?source=public_api\" alt=\"\"/>","tags":"[\"oracle\",\"blockchain\",\"startup\",\"ATS\",\"computer science\"]","pubDate":"2024-05-26 09:21:05.000","link":"https://remotive.com/remote-jobs/hr/junior-recruitment-assistant-1914550","savedDate":"2024-05-28 08:34:09.955","slug":"junior-recruitment-assistant-supraoracles-569"},{"id":4782399475,"title":"Senior Business Analyst - Insurance (Fully Remote)","company":"CoverGo","image":"https://pbs.twimg.com/profile_images/1382655628523364355/MWPIbbID_400x400.jpg","description":"<h3><strong>Top 3 Reasons To Join Us</strong></h3><ul> <li>Competitive Salary</li> <li>100% Remote</li> <li>Working on the latest tech for the Insurtech Market Leader</li> </ul><h3><strong>About Us</strong></h3><p>At CoverGo, our mission is to empower all insurance companies to make insurance 100% digital and accessible to everyone.</p><ul> <li>We are a leading global no-code insurance platform for health, life, and P&amp;C</li> <li>We’re the winner of the Insurtech of the Year in all of Asia and other awards globally</li> <li>We work with insurance enterprise clients such as AXA, Bupa, MSIG, Dai-ichi, Bank of China Group Insurance, and many more</li> <li>We're an international, diverse team of over 120 people with 30 nationalities and team members working remotely from all over the world</li> <li>We are fully funded and backed by reputable VC funds and strategic institutional investors</li> <li>We have a global presence in Asia, EMEA and the Americas</li> <li>We’ve grown our annualized revenue by over 30x since January 2021</li> <li>We’re constantly working towards making CoverGo a workplace that you love coming to. We deeply believe that bringing together a diversity of thoughts, expressions, and perspectives is key to building the best culture for equally diverse communities all over the world</li> </ul><h3><strong>What You Will Do:</strong></h3><ul> <li>Work with clients and technical resources to identify their business problems and develop the right approach and analytical solution</li> <li>Plan and design simple to semi-complex business processes and system modifications</li> <li>Make recommendations to improve and support business activities</li> <li>Gather business requirements through a variety of techniques such as work sessions and interviews then analyze and document client complex business requirements and processes; communicate these requirements to appropriate parties</li> <li>Create complex test case scenarios to be used in testing; monitor/oversee the testing of business applications to verify that all client requirements are incorporated into the system design</li> <li>Develop business requirements documents/user stories to support the required modifications</li> <li>May plan, allocate and monitor work of other business analysts</li> <li>Understand simple to complex systems and related data to surface actionable insights, demonstrate sound judgment and decision-making skills</li> <li>Assist in providing time estimates for project related tasks</li> <li>Aid in updating process and procedural documentation</li> <li>Develop basic understanding of technical development cycle of mobile application or web portals</li> <li>Support QA, UAT and Release phases of the project via defect analysis, change maintenance, etc.</li> <li>Any other task that may be assigned</li> </ul><h3><strong>What We Need:</strong></h3><ul> <li>Minimum 5 years of experience as Business Analyst</li> <li>A degree in Business, IT or any relevant field</li> <li>Previous experience working in the insurance industry or Insurtech is preferred </li> <li>Health Insurance-related domain certification from INS/LOMA or III is an added advantage</li> <li>Knowledge of business analysis concepts of defining requirements, translating to technical solutions, and Agile approach to prioritizing work to epics, sprints</li> <li>Business analysis skills including facilitation, process documentation, requirements gathering and user acceptance testing</li> <li>Good organizational/time management skills to prioritize work and meet deadlines within defined timeframes</li> <li>Experience in an Agile and/or Scrum environment is a must</li> <li>Basic knowledge in generating process documentation, and document system functionality, data integration, and workflow</li> <li>Excellent written and verbal communication skills in English</li> <li>Technical writing skills and knowledge of other languages (Chinese) is a plus</li> <li>Currently based in the Philippines</li> </ul><h3><strong>Why You'll Love Working Here</strong></h3><ul> <li>Fully Remote</li> <li>Flexible Leave</li> <li>International Environment</li> <li>Competitive renumeration package</li> <li>Performance Bonus</li> <li>Stock Options after 6 months </li> <li>Company activities and events</li> <li>Learning and development plan</li> <li>Remote work allowance</li> </ul><p><strong>CoverGo Company </strong><a href=\"https://www.youtube.com/watch?v=YI0ezLxvFvA\" rel=\"nofollow noreferrer noopener\" class=\"external\"><strong>Video</strong></a></p><p>By submitting your application, you confirm that you have read, understood, and accepted the content of CoverGo’s <a href=\"https://apply.workable.com/covergo/gdpr_policy?lng=en\" target=\"_blank\" rel=\"nofollow noreferrer noopener\" class=\"external\">Privacy Notice</a> and you consent to the processing of your data as part of this application.</p><p><a href=\"https://www.youtube.com/watch?v=YI0ezLxvFvA\" rel=\"nofollow noreferrer noopener\" class=\"external\"></a></p><h3>Requirements: </h3><h3>Benefits: </h3>","tags":"[\"management\"]","pubDate":"2024-05-26 00:00:00.000","link":"https://apply.workable.com/covergo/j/3431A38A74","savedDate":"2024-05-28 08:34:09.960","slug":"senior-business-analyst-insurance-fully-remote-covergo-9804"},{"id":1862076496,"title":"Senior Python Developer","company":"emergn","image":"https://remotive.com/job/1913886/logo","description":"<div><!--block-->We are a global digital business services organization with a mission to improve the way people and companies work. Forever. Our Consulting, Technology and Learning teams design and deliver transformational digital products and experiences that add value to our clients’ businesses and to their customers' lives.  </div><div><!--block--> </div><div><!--block-->Every day, across the world, our teams are pioneering faster, better ways to bring our client’s most exciting ideas to life. Are you ready to make an impact? <br><br></div><div><!--block-->As a <strong>Senior Python Developer</strong> at Emergn, you'll help us shape Emergn’s exciting future and play an important role in our growth.  </div><div><!--block--> </div><div><!--block-->Join our team and let's make an impact together!  </div><br><br><div class=\"h3\">We want you to:</div><ul style=\"\"><li style=\"\"><!--block-->Design the overall architecture of the web applications.</li><li style=\"\"><!--block-->Maintain code integrity and organization that delivers real business value.</li><li style=\"\"><!--block-->Ensure the quality covering your code with unit tests.</li><li style=\"\"><!--block-->Actively participate in all development activities including testing.</li></ul><div><!--block--><br></div><br><br><div class=\"h3\">You’re a perfect fit if you have:</div><ul style=\"\"><li style=\"\"><!--block--><strong>5+ years of experience with Python.</strong></li><li style=\"\"><!--block--><strong>2+ years of experience with React or Angular or Vue.</strong></li><li style=\"\"><!--block-->Demonstrated experience in State management.</li><li style=\"\"><!--block-->Demonstrated experience with Flask and MongoDB.</li><li style=\"\"><!--block-->Experience in fine tuning the performance of applications.</li><li style=\"\"><!--block-->Good English skills - written and spoken.</li></ul><div><!--block--><br></div><br><br><div class=\"h3\">What we offer:</div><ul style=\"\"><li style=\"\"><!--block-->A comprehensive health and life insurance.</li><li style=\"\"><!--block-->A flexible work environment: you can work remotely or hybrid from one of our locations. </li><li style=\"\"><!--block-->Working with the latest tools (Mac or Windows) and technologies on meaningful client engagements. </li><li style=\"\"><!--block-->Career growth opportunities and a clear progression framework. </li><li style=\"\"><!--block-->Educational programs and opportunities of training and certification at the expense of the company.  </li><li style=\"\"><!--block-->Local teambuilding activities and get-togethers.  </li><li style=\"\"><!--block-->Two weeks per year for you to work from a location of your choice, expanding your horizons while staying connected to your team. </li><li style=\"\"><!--block-->Generous referral bonus program, quarterly and yearly company awards with financial incentives. </li><li style=\"\"><!--block-->8 hours of paid volunteering. </li><li style=\"\"><!--block-->Meal allowance. </li><li style=\"\"><!--block-->23 vacation days yearly. </li></ul><div><!--block--><br><strong>The best part</strong> </div><div><!--block--><br>Emergn is a global digital business services firm with a mission to improve the way people and companies work. Forever. We partner with some of the world's most respected businesses, including Fortune 500, FTSE 100, and Global 2000 companies, to turn their most promising ideas into valuable digital products and customer experiences faster. <br><br></div><div><!--block-->Our experts work with clients to transform their business in three ways:  </div><ul style=\"\"><li style=\"\"><!--block-->Helping to better <strong>define their thinking</strong>, including shaping their product organization and clarifying and communicating their product strategy.  </li><li style=\"\"><!--block--><strong>Developing their people</strong> by delivering exemplary training in product management, modern ways of working, and leadership.  </li><li style=\"\"><!--block--><strong>Delivering their outcomes</strong> by building customer-centric products and customer experiences.  </li></ul><div><!--block-->Emergn's unique approach, Value, Flow, Quality (VFQ), combines the best of Agile, Lean, design thinking, and systems thinking to turn investments in new ways of working into tangible results. With a strong presence in over a dozen countries and headquarters in Boston (US) and London (EMEA), we're making an impact every day. <br><br></div><div><!--block--><strong>Are you ready to make an impact?</strong> <br><br></div><div><!--block-->Join us today! </div><div><!--block--><br></div><img src=\"https://remotive.com/job/track/1913886/blank.gif?source=public_api\" alt=\"\"/>","tags":"[\"mongoDB\",\"python\",\"react\",\"flask\"]","pubDate":"2024-05-25 17:20:43.000","link":"https://remotive.com/remote-jobs/software-dev/senior-python-developer-1913886","savedDate":"2024-05-28 08:34:09.955","slug":"senior-python-developer-emergn-9426"},{"id":8159391675,"title":"Senior Director of People & Empowerment","company":"Sandstone Care","image":"https://remotive.com/job/1913971/logo","description":"<p> </p>\n<p><strong>Sandstone Care is a mission-driven age-specific behavioral health treatment provider, specializing in the treatment of substance use and mood disorders.</strong> If you are ready to make a profound difference in the lives of individuals seeking support Sandstone Care invites you to join our team as our Senior Director of People &amp; Empowerment (Human Resources).</p>\n<p>Sandstone Care is dedicated to transforming lives through comprehensive and compassionate treatment. With a focus on helping young adults and adolescents struggling with substance abuse and mental health challenges, we provide a safe and nurturing environment where healing and growth can flourish. In this Senior Director role, you will have a unique opportunity to shape the services provided as <span class='\"NormalTextRun'>a critical enabler of the business and a vital contributor to the success of </span><span class='\"NormalTextRun'>our operations.</span></p>\n<p> </p>\n<div class=\"h3\"><strong>Job Summary:</strong></div>\n<p>The Senior Director, People &amp; Empowerment (P&amp;E) will build and deliver HR services for Sandstone Care. The role is responsible for overseeing the HR Business Partners that provide proactive and strategic advice to our facilities and the HR Compliance/Administrative services at Sandstone Care. People and Empowerment is a critical enabler of the business and vital to the success of our operations. The role will also support senior leadership with complex HR issues, particularly around staff performance development, talent management and employee engagement. </p>\n<p> </p>\n<div class=\"h3\">Responsibilities:</div>\n<ul style=\"\">\n<li style=\"\"><strong>Championing Our People</strong>: <span class='\"TextRun' lang='\"EN-US\"'><span class='\"NormalTextRun'>In partnership with the Chief People Officer and P&amp;E leadership team, develop the strategic </span><span class='\"NormalTextRun'>p</span><span class='\"NormalTextRun'>eople</span><span class='\"NormalTextRun'> agenda to drive staff engagement</span><span class='\"NormalTextRun'> through excellent employee experiences </span><span class='\"NormalTextRun'>everyday</span><span class='\"NormalTextRun'>.</span></span><span class='\"EOP'> </span></li>\n<li style=\"\"><strong>Shaping Strategy: </strong><span class='\"TextRun' lang='\"EN-US\"'><span class='\"NormalTextRun'>Drive </span><span class='\"NormalTextRun'>talent management</span><span class='\"NormalTextRun'> processes on workforce planning, talent assessment, retention, leadership training and development, succession planning, and </span><span class='\"NormalTextRun'>DEI</span><span class='\"NormalTextRun'>.</span></span><span class='\"EOP'> </span></li>\n<li style=\"\"><strong>Empowering Growth and Development: </strong><span class='\"TextRun' lang='\"EN-US\"'><span class='\"NormalTextRun'>Lead and build the HR Compliance </span><span class='\"NormalTextRun'>&amp; </span><span class='\"NormalTextRun'>Operations team; develop automation, SLAs, </span><span class='\"NormalTextRun'>process &amp; procedures, </span><span class='\"NormalTextRun'>frameworks,</span><span class='\"NormalTextRun'> and</span><span class='\"NormalTextRun'> metrics ensuring compliance and adherence to all SSC and regulatory standards.</span></span><span class='\"EOP'> </span><span class='\"TextRun' lang='\"EN-US\"'><span class='\"NormalTextRun'>Lead and build the HR Compliance </span><span class='\"NormalTextRun'>&amp; </span><span class='\"NormalTextRun'>Operations team; develop automation, SLAs, </span><span class='\"NormalTextRun'>process &amp; procedures, </span><span class='\"NormalTextRun'>frameworks,</span><span class='\"NormalTextRun'> and</span><span class='\"NormalTextRun'> metrics ensuring compliance and adherence to all SSC and regulatory standards.</span></span><span class='\"EOP'> </span></li>\n<li style=\"\"><strong>Promote Best Practice:</strong> share and harmonize HR processes by developing a strategic approach to automation, enabling the efficient delivery of high-quality HR processes and tools to our employees.  </li>\n<li style=\"\"><strong>Ensure legal compliance </strong>and alignment with applicable labor law, business strategy, policies, and standards. Work with compliance and senior leadership to ensure we provide a safe work environment for employees and work together to implement programs, initiatives, and audits</li>\n</ul>\n<p> </p>\n<div class=\"h3\"><strong>Qualifications:</strong></div>\n<ul style=\"\">\n<li style=\"\"><span><span>Bachelor’s</span><span> degree in a related field </span><span>required</span><span>, </span><span>master’s</span><span> degree preferred</span><span>.</span></span><span> </span></li>\n<li style=\"\"><span><span>SHRM-CP or PHR certification preferred.</span></span><span> </span></li>\n<li style=\"\"><span><span class='\"TextRun' lang='\"EN-US\"'><span class='\"NormalTextRun'>10</span><span class='\"NormalTextRun'>+</span><span class='\"NormalTextRun'> years in HR</span><span class='\"NormalTextRun'> with 5</span><span class='\"NormalTextRun'>+</span><span class='\"NormalTextRun'> years in</span><span class='\"NormalTextRun'> leadership </span><span class='\"NormalTextRun'>with a focus on employee relations, compliance, performance management,</span><span class='\"NormalTextRun'> leadership development</span><span class='\"NormalTextRun'> and</span> <span class='\"NormalTextRun'>HR strategy.</span></span><span class='\"EOP'> </span></span></li>\n<li style=\"\"><span><span class='\"TextRun' lang='\"EN-US\"'><span class='\"NormalTextRun'>Experience in healthcare</span> <span class='\"NormalTextRun'>highly</span><span class='\"NormalTextRun'> beneficial.</span></span><span class='\"EOP'> </span></span></li>\n</ul>\n<p> </p>\n<p><span><span class='\"EOP'></span></span></p>\n<div class=\"h3\"><strong>Total Rewards:</strong></div>\n<ul style=\"\">\n<li style=\"\">Compensation: $120,000-150,000 Annual Salary </li>\n<li style=\"\">Comprehensive and competitive benefits package including high quality / low cost healthcare coverage, unlimited PTO, 401k with a 5% company match, robust employee assistance programs, and more</li>\n</ul>\n<p><span><span class='\"EOP'></span></span></p>\n<p> </p>\n<p><strong>By joining Sandstone Care as our Senior Director of People &amp; Empowerment, you will become an integral part of our mission to heal and transform lives. We offer a dynamic and supportive work environment where innovation is encouraged, and your contributions will be valued and celebrated. If you are ready to take on this fulfilling and impactful leadership role, we invite you to apply today!</strong></p>\n<p> </p>\n<p> </p>\n<p><span></span></p>\n<p> </p><img src=\"https://remotive.com/job/track/1913971/blank.gif?source=public_api\" alt=\"\"/>","tags":"[\"performance management\"]","pubDate":"2024-05-25 11:21:27.000","link":"https://remotive.com/remote-jobs/hr/senior-director-of-people-empowerment-1913971","savedDate":"2024-05-28 08:34:09.955","slug":"senior-director-of-people-empowerment-sandstone-care-5388"},{"id":4864369726,"title":"Editorial & Graphic Design Consultant","company":"WI-HER","image":"https://remotive.com/job/1914486/logo","description":"<p><strong>Company Description:</strong></p>\n<p>WI-HER, LLC is a small woman-owned small business based in Northern Virginia. Our diverse global team is committed to delivering effective and equitable change through innovative solutions that are human-centered, sustainably delivered, transparently managed, and consistently documented. Our focus on tailored capacity development and rigorous monitoring and evaluation processes ensures excellence and impact in all of our programs across various sectors—while our small size brings flexibility and speed in response to our client needs. </p>\n<p>At WI-HER, we address inequities by supporting individuals to be at the heart and in the driver's seat of designing and delivering mutually inclusive locally-led solutions, which do no harm. WI-HER Founder and President Dr. Taroub Harb Faramand developed an innovative and results-based methodology called iDARETM to put this principle into practice.</p>\n<p><strong>PRIMARY PURPOSE:</strong></p>\n<p>WI-HER seeks to build a roster of communications and/or graphic design experts to work on communications projects/deliverables on an as-needed basis.</p>\n<div class=\"h1\"><strong>SCOPE OF SERVICE:</strong></div>\n<p>WI-HER is seeking the services of an individual with experience in professional writing, editing, and graphic design. Projects will be on a short-term, as-needed basis, and WI-HER will select consultants from the roster based on specific project needs, consultant availability, and area of expertise.</p>\n<p>Projects may include, but are not limited to:</p>\n<p>1.     Copy-editing documents (such as reports, learning briefs, and proposals), including ensuring documents are consistent in tone, voice, and structure.</p>\n<p>2.     Formatting documents in Microsoft Office products</p>\n<p>3.     Ensuring documents are 508 compliant</p>\n<p>4.     Creating graphs/charts and other graphic elements</p>\n<p>5.     Edit photos for insertion into the final document when necessary.</p>\n<div class=\"h1\"><strong>FOR COMMUNICATIONS-FOCUSED PROJECTS: SKILLS</strong></div>\n<ul style=\"\">\n<li style=\"\">Professional writing, editing, and communication skills, including an eye for detail</li>\n<li style=\"\">Proficiency in APA style</li>\n<li style=\"\">Strong knowledge of Microsoft Office products</li>\n<li style=\"\">Ability to distill complex, technical language into language that is more accessible to a broader population</li>\n<li style=\"\">Knowledge of 508 compliance</li>\n</ul>\n<div class=\"h1\"><strong>FOR GRAPHIC DESIGN-FOCUSED PROJECTS: SKILLS</strong></div>\n<ul style=\"\">\n<li style=\"\">Strong knowledge of Microsoft PowerPoint, Word, Excel (non-technical), and Adobe Acrobat Pro</li>\n<li style=\"\">Strong knowledge of Adobe Creative Suite</li>\n<li style=\"\">A strong understanding of design for both print and digital</li>\n<li style=\"\">Strong conceptual skills, knowledge, and experience designing page layouts, infographics, charts, tables, and graphs</li>\n<li style=\"\">Ability to take ideas and think creatively to make professional, aesthetically pleasing layouts while maintaining company identity standards</li>\n<li style=\"\">Knowledge of 508 compliance</li>\n</ul>\n<div class=\"h1\"><strong>NEXT STEPS</strong></div>\n<p>To apply, please submit your proposal by Tuesday, June 5, 2024. Please limit your submission to 2 pages, double spaced and include the following:</p>\n<p>●   A brief overview of your core competencies and experience related to the scope</p>\n<p>●   Your background, with links to past work, if publicly available</p>\n<p>●   CV</p>\n<p><strong>●  Your hourly rate</strong></p>\n<p>● References and any other relevant materials (e.g. previous work) are welcome as appendices</p>\n<p><em>WI-HER is committed to fostering a diverse, multicultural work environment and welcomes a range of backgrounds, life experiences, perspectives, and opinions. WI-HER provides equal employment to all and has zero tolerance towards discrimination on the basis of race, color, religion, sex, sexual orientation, gender identity or expression, pregnancy, national origin, citizenship, age, marital status, disability, medical condition, or any other characteristic protected by state or federal laws.</em></p>\n<p><br><br></p>\n<img src=\"https://remotive.com/job/track/1914486/blank.gif?source=public_api\" alt=\"\"/>","tags":"[\"adobe creative suite\",\"graphic design\",\"editing\",\"microsoft office\"]","pubDate":"2024-05-25 11:20:53.000","link":"https://remotive.com/remote-jobs/design/editorial-graphic-design-consultant-1914486","savedDate":"2024-05-28 08:34:09.955","slug":"editorial-graphic-design-consultant-wi-her-9865"},{"id":8552533773,"title":"Senior C++ Engineer (Remote)","company":"DuckDuckGo","image":"https://spreadprivacy.com/content/images/2023/05/duckduckgo-logo_wide.png","description":"<p>Hi, we’re DuckDuckGo, the Internet privacy company for everyone who wants to take back their privacy now. For over a decade, we've been building our all-in-one product, developing new privacy technology, and working with policymakers to make online privacy simple and accessible for all.</p>\n<p><br /></p>\n<p>Our browsers and extensions have been downloaded over 250 million times with our built-in private search engine, which has delivered over 100 billion searches and is the 2nd largest search engine on mobile in the United States and 17 other countries, including the United Kingdom, Canada, Australia, Germany, Poland, and Spain. Our private search engine is also 3rd in market share in the U.S. and over 20 major markets. Oh, and we've been profitable since 2014, with annual revenue exceeding $100 million!</p>\n<p><br /></p>\n<p>The DuckDuckGo browser’s uniquely comprehensive privacy protections are used by tens of millions of people to protect their everyday online activities on <a href=\"https://spreadprivacy.com/introducing-duckduckgo-for-mac/\" rel=\"noopener\">Mac</a>, <a href=\"https://spreadprivacy.com/windows-browser-open-beta/\" rel=\"noopener\">Windows</a>, <a href=\"https://spreadprivacy.com/duckduckgo-privacy-browser-ios14/\" rel=\"noopener\">iOS</a>, and <a href=\"https://spreadprivacy.com/introducing-app-tracking-protection/\" rel=\"noopener\">Android</a>, from searching to browsing, emailing, and more. We also offer <a href=\"https://spreadprivacy.com/meetprivacypro/\" rel=\"noopener\">Privacy Pro</a>, a three-in-one subscription service that includes a VPN, Personal Information Removal, and Identity Theft Restoration.</p>\n<p><br /></p>\n<p>We’re looking for a Senior C++ Engineer to help shape our all-in-one privacy solution and join our mission to show the world that protecting your privacy online can be simple.  </p>\n<p><br /></p>\n<p><strong>The Opportunity</strong> </p>\n<p>In this role, you will be a critical part of our product evolution and scale, building a cross-platform solution that empowers our Windows, Apple and Android teams to build highly performant features efficiently, with less breakage, allowing us to deliver more impact and value to our users. </p>\n<p><br /></p>\n<p>You'll have the opportunity to explore a vague, complex problem space, interfacing with the open-source world, unlocking not only our product's potential but also other web products - architecting a solution that grows privacy on the web. </p>\n<p><br /></p>\n<p><strong>What You Will Bring to DuckDuckGo</strong> </p>\n<ul><li>Ability to lead and collaborate on high-impact and complex projects from proposal through post-mortem.  </li><li>Skills to wrangle vague problems, propose innovative solutions, and execute them with a strong focus on metrics.</li><li>7+ years of Software Engineering experience</li><li>Advanced C++ expertise</li><li>Direct experience with browsers - Chromium, WebKit, or WebView development</li><li>Recent experience defining and driving technical work end-to-end on large-scale (modern C++14 or more recent) C++ codebases</li><li>Experience with other modern languages (C#, Swift, Kotlin, Rust)</li><li>Experience developing software for Mobile platforms or Desktop (Android/iOS/Windows)</li><li>Expertise with general browser architecture</li><li>Low-level C/C++ programming experience / Systems level development</li><li>Solid computer science foundation (algorithms and data structures)</li></ul>\n<p><br /></p>\n<p><strong>How We Will Support You </strong> </p>\n<p>Our core values -- build trust, question assumptions, and validate direction -- underpin how we work day-to-day and the support we give our team members. We strive to empower our team members to be self-directed and self-motivated in their work.  </p>\n<p><br /></p>\n<ul><li><strong>Remote First, Always</strong>: We've always been a fully distributed company with team members all over the world. We trust you to get your work done wherever, and whenever.   </li><li><strong>Commitment to Personal Growth:</strong> Every team member has an annual budget of $1,250 USD to invest in their professional development. Every team member also has a dedicated Career Advisor, who serves as a guide to help you develop your strengths, identify your motivations, and understand your opportunities for growth. </li><li><strong>Leadership:</strong> We have many different types of leaders and possible combinations of leadership roles, so you can grow your career in a way that aligns best with your personal goals. You can seek additional leadership roles by being directly responsible for projects, taking ownership of areas of the company, developing and maintaining internal processes, or pursuing advisory roles. </li><li><strong>Work/Life Balance: </strong>Team members have the freedom and flexibility to organize their own work schedules. We want you to thrive both in and out of the office. We trust you to use good judgment and take the time off that you need to bring your best self to work.  </li></ul>\n<p><br /></p>\n<p>We also offer paid parental leave, a co-working stipend, office setup reimbursement, and a wellness stipend. More support resources can be found in our <u><a href=\"https://duckduckgo.com/assets/hiring/team_support_guide.pdf\" rel=\"noopener\">Team Member Support Guide</a></u>, which explains how we make your well-being a priority. </p>\n<p><br /></p>\n<p>For more information on how we collaborate worldwide, from leadership in our relatively flat organization to start-to-finish ownership<strong>,</strong> check out <u><a href=\"https://duckduckgo.com/how-we-work \" rel=\"noopener\">DuckDuckGo Culture: How We Work.</a></u> </p>\n<p><br /></p>\n<p><strong>Compensation</strong> </p>\n<p>Annual compensation: $176,000 USD and stock options. Compensation is the same within a professional level, regardless of geographic location or functional area, and the compensation for each professional level is transparent across the organization.</p>\n<p><br /></p>\n<p><strong>Hiring Process</strong> </p>\n<p>Hiring works best when it's a two-way street. Learn how we help you get to know DuckDuckGo and envision your future role here. Find out more about <u><a href=\"https://duckduckgo.com/how-we-hire\" rel=\"noopener\">how we hire</a></u>. </p>\n<p><br /></p>\n<p><strong>Diversity, Equity, and Inclusion</strong> </p>\n<p>DuckDuckGo provides equal work opportunities to all team members and applicants<u>,</u> and it prohibits discrimination and harassment of any type on the basis of race, color, ethnicity, caste, religion, age, sex (including pregnancy), national origin, disability status, genetics, protected veteran status, sexual orientation, gender identity or expression, or any other characteristic protected by our policies or federal, state, or local laws.</p>\n<p><br /></p>\n<p>We want to ensure that our hiring process is accessible. If you need reasonable accommodation for any part of the application process because of a medical condition or disability, please send an email to <u><a href=\"mailto:careers@duckduckgo.com\" rel=\"noopener\">careers@duckduckgo.com</a></u> to let us know the nature of your request.  </p>\n<p><br /></p>\n<p>If you think you might thrive in this environment, we would love to hear from you. </p>\n<p><br /></p>\n<p><strong>Please note that:</strong> </p>\n<ul><li>Sometimes we meet up! Expect to travel at least two times a year: once for our all-hands meetup and again for a team retreat (each around 4-5 days). While extenuating circumstances may impact attendance, everyone is strongly encouraged to attend.</li><li>While we offer a flexible work arrangement with no core hours, expect an average full-time commitment of 40 hours per week. </li><li>A successful candidate will be subject to a background check and must receive satisfactory results of the same, as a condition of joining the team. </li><li>By applying for this role, you confirm that all information submitted is accurate and complete. You further acknowledge that providing false or fraudulent information during the application process is cause for denial of an offer, revocation of any existing offer, or other adverse action, up to and including termination after the start of your commencement of work.  </li></ul>\n<p><br /></p>\n<p>#US #UK #SP #PL #IR #IC #HN #CR #CN #AU</p>","tags":"[\"engineering\",\"aws\"]","pubDate":"2024-05-24 21:19:07.000","link":"https://duckduckgo.recruitee.com/o/senior-cplusplus-engineer-remote","savedDate":"2024-05-28 08:34:09.959","slug":"senior-c-engineer-remote-duckduckgo-204"},{"id":5107860830,"title":"Sr. Credit Analyst- Cashalo/Empower, Asia Pacific (Remote)","company":"Empower","image":"https://lever-client-logos.s3.us-west-2.amazonaws.com/2e1a369c-b58f-41ac-8d86-4b0a77695e68-1687915522032.png","description":"<div><b>EMPOWER OVERVIEW</b></div><div><a href=\"http://empower.me/\" class=\"postings-link\">Empower</a>&nbsp;is a fast-growing fintech on a mission to expand access to fair credit to give anyone the opportunity to improve their financial security and mobility. We recently launched in Southeast Asia through our acquisition of Cashalo, the leading online lending platform in the Philippines. Our mission to expand access to credit in the region will take creativity, passion, and drive. Are you in?</div><div>Empower is backed by Sequoia Capital, Blisce, and Icon Ventures. Are we the next great place to grow your impact and accelerate your career? We think so:</div><div><br></div><div>Inc. ranked Empower #56 in the 2023 Inc. 5000 list of the fastest-growing private companies in the US (#55 in 2022). Forbes put Empower on its 2023 list of America's Best Startup Employers. Fast Company recognized the new Empower Thrive line of credit in their 2022 list of the Next Big Things in Tech.</div><div><br></div><div><b>THE EMPOWER WAY</b></div><div>Great Expectations: We come up with bold, audacious goals for ourselves and go all out for impact</div><div>Owner Mindset: We give every employee latitude to act independently, make smart choices, and move the business forward</div><div>Spirited Debate: We love skeptics and seek counter opinions to challenge our personal assumptions and expand our view</div><div>Customer Obsession:&nbsp;We listen to understand, empathize, and create a memorable, rewarding experience for our community</div><div>Inclusive Collaboration: We believe diverse teams make the best decisions, and we strive to give diverse voices a seat at the table</div><div>No Jerks Allowed: We value our relationships and take the time to build trust and connection and communicate respectfully</div><div><br></div><div><b>JOB DESCRIPTION</b></div><div>Empower is searching for a talented problem solver to grow our business and manage credit risk of our lending products. You will be joining in the early stages of a fast growing company, and have the opportunity to jump right in on many exciting and impactful credit projects. The ideal candidate is passionate about using data and analytics to drive business growth and help customers improve their financial situations.&nbsp; This individual will own workstreams across credit policy, testing, and valuations and will be asked to take projects from ideation to execution.&nbsp; They will also need to partner with product, tech, and finance teams to build out solutions that drive value for Empower and our customers.&nbsp; The right person for this role is someone who shines while solving complex problems and is comfortable with a wide variety of technical tools.</div><div><br></div><div>Travel for company offsites is expected at a minimum 2 times a year.</div><h3>Key Responsibilities</h3><li>Use data to optimize policies, driving better outcomes for Empower and our customers</li><li>Design tests to measure effectiveness of new strategies where data is limited or non-existent</li><li>Build financial models to provide detailed estimates and refine strategies</li><li>Create automated systems to monitor business performance</li><li>Become an expert in and owner of one or multiple subsections within the credit space</li>,<h3>Candidate Qualifications</h3><li>B.S. degree in engineering, business, finance, computer science or mathematics</li><li>2+ years industry experience in data analytics, with a focus on using data to solve complicated and ambiguous problems</li><li>Strong SQL abilities</li><li>Excellent verbal and written communication skills, with an emphasis on data driven story-telling for wide audiences</li><li>Comfort with ambiguity; the ability to lay out and test clear hypotheses, and solve problems without well-defined direction</li><div>At Empower, we hire for people that push themselves to understand others and seek out ways to challenge their personal assumptions. Our hope is that by fostering such an environment, we strengthen our business and relationships by putting people first. We are committed to building a diverse, inclusive, and equitable workspace where everyone (regardless of age, education, ethnicity, gender, sexual orientation, or any personal characteristics) feels like they belong. Even if your experience doesn’t exactly match up to our job description, you should feel empowered to apply regardless!</div>","tags":"[\"Finance\",\"engineering\"]","pubDate":"2024-05-23 22:27:23.081","link":"https://jobs.lever.co/empower.me/73e6f77b-d512-4267-ad7e-1f21c1d4809c","savedDate":"2024-05-28 08:34:09.961","slug":"sr-credit-analyst-cashalo-empower-asia-pacific-remote-empower-7868"},{"id":3445424495,"title":"Junior Legal Officer - Fresh Grads (Fully Remote)","company":"CoverGo","image":"https://pbs.twimg.com/profile_images/1382655628523364355/MWPIbbID_400x400.jpg","description":"<p><strong>Top 3 Reasons To Join Us</strong></p><ul> <li>Competitive Salary</li> <li>100% Remote</li> <li>International team</li> <li>Working on the latest tech for the Insurtech Market Leader</li> </ul><p><strong>About Us</strong></p><p>At CoverGo, our mission is to empower all insurance companies to make insurance 100% digital and accessible to everyone.</p><ul> <li>We are a leading global no-code insurance platform for health, life, and P&amp;C</li> <li>We’re the winner of the Insurtech of the Year in all of Asia and other awards globally</li> <li>We work with insurance enterprise clients such as AXA, Bupa, MSIG, Dai-ichi, Bank of China Group Insurance, and many more</li> <li>We're an international, diverse team of over 120 people with 30 nationalities and team members working remotely from all over the world</li> <li>We are fully funded and backed by reputable VC funds and strategic institutional investors</li> <li>We have a global presence in Asia, EMEA and the Americas</li> <li>We’ve grown our annualized revenue by over 30x since January 2021</li> <li>We’re constantly working towards making CoverGo a workplace that you love coming to. We deeply believe that bringing together a diversity of thoughts, expressions, and perspectives is key to building the best culture for equally diverse communities all over the world</li> </ul><p><strong>What You Will Do</strong></p><ul> <li>Review contracts, ensuring compliance with applicable laws and regulations.</li> <li>Suggest corrections and alternations for&nbsp; legal agreements/ contracts.</li> <li>Conduct legal research on matters related to employment or commercial law.</li> <li>Analyze legal issues and provide valuable insights to support decision-making processes.</li> <li>Maintain organized records of legal documents, contracts, and correspondence.</li> <li>Ensure the accessibility and integrity of legal files.</li> <li>Stay abreast of changes in employment and commercial laws to ensure ongoing compliance.</li> <li>Assist in developing and implementing processes to ensure adherence to legal requirements.</li> <li>Communicate effectively with internal teams, external legal entities, and clients.</li> <li>Collaborate with team members to facilitate smooth legal operations.</li> <li>Provide administrative support if needed&nbsp;</li> </ul><p><strong>What We Need</strong></p><ul> <li>Must possess a Juris Doctor degree from an accredited institution</li> <li>Experience in a legal assistant or similar role is an advantage</li> <li>Proven experience in drafting, reviewing, and editing contracts</li> <li>Strong legal research and analytical skills</li> <li>Excellent organizational skills, with the ability to manage multiple tasks efficiently</li> <li>High proficiency in English</li> <li>Clear and effective communication skills, both written and verbal</li> <li>Keen attention to detail and accuracy in legal documentation</li> <li>Collaborative mindset with the ability to work effectively within a team</li> <li>Specialized knowledge and practical experience in employment or commercial law is a major advantage</li> <li>Physically based in the Philippines </li> </ul><p><strong>Why You'll Love Working Here</strong></p><ul> <li>Fully Remote</li> <li>Flexible Leave</li> <li>International Environment</li> <li>Competitive remuneration package</li> <li>Performance Bonus</li> <li>Stock Options after 6 months</li> <li>Company activities and events</li> <li>Learning and development plan</li> <li>Remote work allowance</li> </ul><p><strong>CoverGo Company</strong><a href=\"https://www.youtube.com/watch?v=YI0ezLxvFvA\" rel=\"nofollow noreferrer noopener\" class=\"external\"><strong> Video</strong></a></p><p>By submitting your application, you confirm that you have read, understood, and accepted the content of CoverGo’s<a href=\"https://apply.workable.com/covergo/gdpr_policy?lng=en\" rel=\"nofollow noreferrer noopener\" class=\"external\"> Privacy Notice</a> and you consent to the processing of your data as part of this application.</p><p></p><h3>Requirements: </h3><h3>Benefits: </h3>","tags":"[\"legal\",\"aws\"]","pubDate":"2024-05-23 00:00:00.000","link":"https://apply.workable.com/covergo/j/F3D5727395","savedDate":"2024-05-28 08:34:09.961","slug":"junior-legal-officer-fresh-grads-fully-remote-covergo-1667"},{"id":8810170944,"title":"Director of Content Marketing & SEO","company":"ShopPad Inc.","image":"https://remotive.com/job/1914648/logo","description":"<p>Director of Content Marketing &amp; SEO (Hands-On Role)</p>\n<p>MESA is the most flexible workflow automation platform in the Shopify App Store. We’re a young yet promising product that creates real value for Shopify merchants and enhances their lives. We’re looking for a multi-talented leader to head up the Marketing team and drive the next level of acquisition. Having conducted meaningful tests across various marketing channels, we believe a broad approach to long-tail Content Marketing is our clear path to hyper-growth. That’s where you come in. We’re seeking an experienced Content Marketing leader who excels at understanding complex technical concepts and translating them into clear, relatable terms. If you know “what works” for Content Marketing and SEO, can prioritize across many good ideas, and have a knack for writing engaging copy, managing SEO functions, leveraging data for strategic decisions, and making technical ideas accessible to a broad audience, you might be the perfect fit to lead our small but mighty Marketing team.</p>\n<p> </p>\n<p><strong>About The Company</strong></p>\n<p>ShopPad Inc. has been building forward-thinking software for over a decade. Our flagship product, MESA, now takes center stage, representing 99% of the company’s focus. MESA allows online businesses to build tailored automations for their business without the need to code. Thousands of ecommerce retailers, from nationally recognized brands to rapidly growing startups and all kinds of cool companies in between, use MESA every day. The team behind MESA is comprised of smart, kind individuals who are genuinely excited about automation. We have a supportive culture that values craftsmanship and emphasizes serving our customers with excellence.</p>\n<p> </p>\n<p><strong>About You</strong></p>\n<p>You are an experienced marketing leader with hands-on expertise in ecommerce, content marketing, copywriting, and SEO. You thrive in the dual role of guiding a small team and directly crafting compelling, optimized content to drive organic traffic. With a strong background in ecommerce, you understand the dynamics of digital marketing and are skilled in leveraging content to drive user engagement and conversions. Your ability to analyze data informs your strategic decisions, enhancing your impactful execution of content strategies that resonate deeply with ecommerce operators. As a dynamic team leader, you inspire your team to exceed goals while fostering an environment of growth and innovation. You excel in crafting clear and compelling stories and messages that meet market demand and deeply resonate with customers, setting the brand apart in a competitive landscape. You understand the importance of balancing strategic leadership with hands-on execution. While you will set goals for the department and attend weekly leadership team meetings, you are also ready to roll up your sleeves and directly contribute to content creation and SEO optimization.</p>\n<p>What You’ll Get To Do</p>\n<ul style=\"\">\n<li style=\"\">Develop and execute a comprehensive content marketing strategy to drive long-tail organic traffic.</li>\n<li style=\"\">Create compelling, SEO-friendly content tailored to ecommerce operators.</li>\n<li style=\"\">Optimize conversion rates across all channels, including our main website and Shopify App Store.</li>\n<li style=\"\">Experiment with video marketing initiatives and engage with online communities to boost brand presence.</li>\n<li style=\"\">Mentor and grow a high-performing marketing team aligned with MESA’s strategic goals.</li>\n<li style=\"\">Set goals for the department and attend weekly leadership team meetings.</li>\n<li style=\"\">Travel to the Bay Area four times a year for leadership planning sessions.</li>\n</ul>\n<p><br><br><strong>Requirements</strong><br><br></p>\n<ul style=\"\">\n<li style=\"\">5+ years of experience in content marketing and SEO</li>\n<li style=\"\">Proven track record of developing and implementing successful content strategies</li>\n<li style=\"\">Strong knowledge of SEO best practices and on-page optimization techniques</li>\n<li style=\"\">Experience with keyword research and SEO tools</li>\n<li style=\"\">Excellent writing and editing skills</li>\n<li style=\"\">Proficiency in Google Analytics</li>\n<li style=\"\">Ability to work independently and manage multiple projects</li>\n<li style=\"\">Experience in the e-commerce industry is a plus</li>\n</ul>\n<p><br><br><strong>Benefits</strong><br><br></p>\n<ul style=\"\">\n<li style=\"\"><strong>Competitive Salary:</strong> Your compensation is the same no matter where you live.</li>\n<li style=\"\"><strong>Wellness:</strong> Medical (Anthem, employees in California also have Kaiser HMO as an option), Dental (Guardian) &amp; Vision (CoPower) + 72 hours of paid sick time each year.</li>\n<li style=\"\"><strong>Paid Time-Off:</strong> Three weeks of vacation (increasing to four after your 4-year anniversary) + fourteen company holidays + your birthday.</li>\n<li style=\"\"><strong>401k:</strong> We match 100% of your contribution up to 2% of your salary.</li>\n<li style=\"\"><strong>Remote Work:</strong> You can work from home, a coffee shop, a coworking space or a hut on the beach.</li>\n<li style=\"\"><strong>Sabbatical:</strong> Once you’ve been at ShopPad for 5 years, you get a fully paid month off in addition to regular vacation.</li>\n<li style=\"\"><strong>Home Office:</strong> $1,000 to make your home office awesome &amp; $65 a month for your home internet.</li>\n<li style=\"\"><strong>Parental Leave:</strong> 4 weeks of paid leave for all new parents (including adoption).</li>\n<li style=\"\"><strong>Fun:</strong> Every month, we host company-wide events like trivia, cooking classes, game nights, virtual escape rooms, wine tastings, movies, and more.</li>\n<li style=\"\"><strong>Giving Back:</strong> We will match your charitable donations up to $500 each year because we want to support the organizations that are important to you.</li>\n<li style=\"\"><strong>Equipment:</strong> We’ll provide ShopPad swag, a new MacBook Pro, and all of the basics to get you started.</li>\n<li style=\"\"><strong>Team Trips:</strong> Week-long, all-expenses-paid retreats to work and play in person.</li>\n</ul>\n<img src=\"https://remotive.com/job/track/1914648/blank.gif?source=public_api\" alt=\"\"/>","tags":"[\"ecommerce\",\"excel\",\"seo\",\"shopify\",\"video\",\"automation\",\"research\",\"content marketing\",\"analytics\",\"digital marketing\",\"google analytics\",\"marketing strategy\",\"editing\",\"travel\"]","pubDate":"2024-05-22 06:07:51.000","link":"https://remotive.com/remote-jobs/marketing/director-of-content-marketing-seo-1914648","savedDate":"2024-05-28 08:34:09.955","slug":"director-of-content-marketing-seo-shoppad-inc-4879"}]