[{"id":9331291586,"title":"Senior Designer - WordPress Themes","company":"Automattic Careers","image":"https://remotive.com/job/1981312/logo","description":"<p>Automattic, the tech powerhouse behind <a href=\"%22https:/wordpress.com/%22\" rel=\"nofollow\">WordPress.com</a>, <a href=\"%22https:/jetpack.com/%22\" rel=\"nofollow\">Jetpack</a>, <a href=\"%22http:/www.tumblr.com%22\" rel=\"nofollow\">Tumblr</a>, <a href=\"%22https:/woocommerce.com/%22\" rel=\"nofollow\">WooCommerce</a>, <a href=\"%22https:/simplenote.com/%22\" rel=\"nofollow\">Simplenote</a>, and more, is looking for seasoned Product Designers to help us keep the web free and open.</p>\n<p><strong>About the role:</strong></p>\n<p>Design is at the core of what we do: designing experiences for millions of users who actively use WordPress, WooCommerce, Tumblr, and all of the products within our ecosystem. You can visit our  <a href=\"%22https:/automattic.design/%22\" rel=\"nofollow\">Design Blog</a>, to learn more about our team and read articles on design, software, and user experience.</p>\n<p>We’re on the lookout for talented designers who are passionate about world-class user experience, deeply understand the needs of our users, and are interested in working with a diverse and global team. You will also be working closely with engineers, marketers, and customer support specialists from around the world in a fully remote company to create websites and themes that make online publishing and commerce accessible to everyone.</p>\n<p><strong>What you’ll do:</strong></p>\n<ul style=\"\">\n<li style=\"\">Design exceptional WordPress websites and themes for multiple clients, events, and Automattic products.</li>\n<li style=\"\">Iterate actively on designs at all levels of fidelity, from wireframes to mockups to site builds, informed by project scope, client strategy, and business goals.</li>\n<li style=\"\">Communicate and share often in written, verbal, and visual forms (including client calls) to create alignment and move the work toward implementation.</li>\n<li style=\"\">Collaborate regularly with engineers to QA and launch high-quality experiences.</li>\n<li style=\"\">Contribute to both Automattic products (via feedback) and the larger open-source and design communities.</li>\n</ul>\n<p><strong>What we’re looking for:</strong></p>\n<ul style=\"\">\n<li style=\"\">Deep understanding of modern website design and theming considerations. Knowledge of WordPress block themes and Gutenberg is a huge bonus.</li>\n<li style=\"\">Past work experience that is relevant for Automattic: remote work, WordPress, e-commerce, site editors, etc.</li>\n<li style=\"\">A keenness for identifying user needs, defining clear solutions, and delivering those through detailed design.</li>\n<li style=\"\">The flexibility to design in low and high fidelity and choose the most efficient and responsible process for the job at hand.</li>\n<li style=\"\">The ability to integrate feedback, validate, and iterate on designs while being mindful of our customers, contributors, and insights gleaned by our support teams.</li>\n<li style=\"\">Excellent written and verbal communication skills—you’ll collaborate with others and present your work regularly in a written format.</li>\n<li style=\"\">Proficiency in design and prototyping tools (we use Figma) and familiarity with website development cycles.</li>\n<li style=\"\">Strong UI and visual design skills with a portfolio showcasing your craft in both written and visual form.</li>\n<li style=\"\">Familiarity with remote work (or excitement to try it!)</li>\n</ul>\n<p><strong>Salary range: $95,000-$200,000 USD</strong> - Please note that salary ranges are global, regardless of location, and we pay in local currency. #LI-PJ </p>\n<p>We are searching for high-caliber candidates with the skills and qualities to have a net positive for Automattic. Pay will reflect the potential contribution and the impact you can bring, which may, in some cases, go beyond the range stated.</p>\n<p>We’re pleased to offer a straightforward, competitive base salary, providing financial clarity without complex variable components. This isn’t your typical work-from-home job: we are a fully-remote company with an open vacation policy. To see a full list of benefits by country, consult our <a href=\"%22https:/automattic.com/benefits/%22\" rel=\"nofollow\">Benefits Page</a>. And check out these links to learn more about <a href=\"%22https:/automattic.com/how-we-hire/%22\" rel=\"nofollow\">How We Hire</a> and <a href=\"%22https:/automattic.com/expectations/%22\" rel=\"nofollow\">What We Expect from Ourselves</a>. </p>\n<div class='\"content-conclusion\"'>\n<p><strong>About Automattic</strong> </p>\n<p>We’re the people behind <a href=\"%22http:/wordpress.com/%22\" rel=\"nofollow\">WordPress.com</a>, <a href=\"%22https:/href.li/?http://woocommerce.com/%22\" rel=\"nofollow\">WooCommerce</a>, <a href=\"%22https:/href.li/?https://www.tumblr.com/%22\" rel=\"nofollow\">Tumblr</a>, <a href=\"%22https:/href.li/?http://simplenote.com/%22\" rel=\"nofollow\">Simplenote</a>, <a href=\"%22https:/href.li/?http://jetpack.com/%22\" rel=\"nofollow\">Jetpack</a>, <a href=\"%22https:/href.li/?http://longreads.com/%22\" rel=\"nofollow\">Longreads</a>, <a href=\"%22https:/href.li/?https://dayoneapp.com/%22\" rel=\"nofollow\">Day One</a>, <a href=\"%22https:/href.li/?https://www.pocketcasts.com/%22\" rel=\"nofollow\">PocketCasts</a>, and more. We believe in making the web a better place.</p>\n<p>We’re a distributed company with more than 1700 Automatticians in nearly every corner of the globe, speaking over a hundred different languages. Enriched by this diversity, we’re united by a singular mission: to democratize publishing, commerce, and messaging so anyone with a story can tell it, anyone with a product can sell it, and everyone can manage their communications from a single source. In short, we help maintain a balance in society, creating and continually refining powerful tools people can use to compete fairly—regardless of income, gender, politics, language, or where they live in the world.</p>\n<p><a href=\"%22https:/github.com/Automattic%22\" rel=\"nofollow\">We believe in Open Source</a>, and the vast majority of our work is available under the <a href=\"%22https:/en.wikipedia.org/wiki/GNU_General_Public_License%22\" rel=\"nofollow\">GPL</a>. Automattic is a <a href=\"%22https:/mostlovedworkplace.com/companies/automattic-inc/%22\" rel=\"nofollow\">Most Loved Company</a> and <a href=\"%22https:/disabilityconfident.campaign.gov.uk/%22\" rel=\"nofollow\">Disability Confident Committed</a>. (<a href=\"%22https:/happinessengineer.blog/2022/09/08/happiness-for-everyone-working-with-a-disability-at-automattic/%22\" rel=\"nofollow\">Here’s what that might mean for you</a>.) Learn more about our dedication to <a href=\"%22https:/href.li/?https://automattic.com/diversity-and-inclusion/%22\" rel=\"nofollow\">diversity, equity, and inclusion</a> and our <a href=\"%22https:/automattic.com/automattician-resource-groups/%22\" rel=\"nofollow\">Employee Resource Groups</a>.</p>\n<p>If you need disability-related accommodations during the application or interview process, please <a href=\"%22https:/automattic.com/disability-related-accommodation-request/%22\" rel=\"nofollow\" target='\"_blank\"'>fill out this form</a>. We are committed to ensuring an accessible hiring process for all candidates.</p>\n<p><em>All qualified applicants will receive consideration for employment without regard to race, color, religion, sex, sexual orientation, gender identity, national origin, disability, or status as a protected veteran.</em></p>\n</div>\n<img src=\"https://remotive.com/job/track/1981312/blank.gif?source=public_api\" alt=\"\"/>","tags":"[\"wordpress\",\"Figma\",\"prototyping\"]","pubDate":"2025-03-07T13:51:04.000Z","link":"https://remotive.com/remote-jobs/design/senior-designer-wordpress-themes-1981312","slug":"senior-designer-wordpress-themes-automattic-careers-7709"}]