[{"id":4105362126,"title":"Open Source Networking Software Engineer - ToR Switch / SmartNIC / DPU ","company":"Canonical","image":"https://pbs.twimg.com/profile_images/1673959375340290050/x7pNtXQ7_400x400.jpg","description":"\n      <p>Software has moved to play a central role in network technology. From outstanding routing implementations like Bird and FRR to overlay networking technology such as OVN/OVS and Cilium, from kernel with SwitchDev to userspace with DPDK, from P4 to OpenFlow, the relationship between network innovation and software continues to deepen. We are building teams to bring the very best open source networking software to market in a well integrated and opinionated stack that brings the latest hyperscaler innovation to end users and enterprise customers.</p>\n<p>We work with networking silicon providers to optimize Ubuntu and related applications for their ASICs, boards and appliances. We aim to provide a complete open source stack for data center networking, from bare metal through virtualization, container and serverless, and also to address IoT networking systematically.</p>\n<p>You will have a good chance of success if you are an outstanding software engineer, passionate about networking, with a special interest in the interface of hardware ASICs for acceleration and software for innovation and control. We value experience in open switch initiatives such as SoNIC and DENT, and upstream experience with components such as routing, kernel networking, eBPF, DNS, firewalls and load balancers.&nbsp;Our selection process is rigorous and requires work from the candidate as six to eight interviews over a period of months. We look for excellent academic results and a commitment to quality, resilience, documentation, security and performance in your work.</p>\n<p>At Canonical you will have the opportunity to engage with the broader open-source community and industry leading partners in developing future-proof networking solutions. We're looking for individuals who can help build a thriving community, contribute to a broad range of technologies, and contribute to the deployment of Ubuntu, Ubuntu Core, Private Clouds, MAAS and Kubernetes across a broad range of devices and use cases.</p>\n<p><strong>Location</strong>: we have network software engineering roles in EMEA and Americas time zones</p>\n<h2>What your day will look like</h2>\n<ul>\n<li>Work with the most advanced operating systems and network application technologies available</li>\n<li>Participate upstream and deliver the Ubuntu SoNIC or DENT stacks</li>\n<li>Collaborate with public clouds and network silicon providers</li>\n<li>Design and implement the best software-defined networking experience for the data center</li>\n<li>Write high-quality, well-designed, fast, secure and well-documented software</li>\n<li>Debug issues and produce high-quality fixes</li>\n<li>Collaborate proactively with a globally distributed organization</li>\n<li>Contribute to technical documentation to make it the best of its kind</li>\n<li>Display technical leadership internally, towards our partners, and in the open source communities</li>\n<li>Influence open-source projects and communities</li>\n<li>Work from home, with global travel twice a year for company events of up to two weeks duration</li>\n</ul>\n<h2>What we are looking for in you</h2>\n<ul>\n<li>An exceptional academic track record</li>\n<li>Undergraduate degree in Computer Science or STEM, or a compelling narrative about your alternative path</li>\n<li>Drive and a track record of going above-and-beyond expectations</li>\n<li>Knowledge of networking: architecture, design, and protocols</li>\n<li>Understanding of Linux networking, from kernel to user space</li>\n<li>Fluency in C/C++ and at least one of Rust, Python or Golang</li>\n<li>Professional written and spoken English&nbsp;</li>\n<li>Experience with Linux</li>\n<li>Excellent interpersonal skills, curiosity, flexibility, and accountability&nbsp;</li>\n<li>Passion, thoughtfulness, and self-motivation&nbsp;</li>\n<li>Excellent communication and presentation skills&nbsp;</li>\n<li>Result-oriented, with a personal drive to meet commitments&nbsp;</li>\n<li>Ability to travel twice a year, for company events up to two weeks each</li>\n</ul>\n<h2>Additional skills that you might also bring</h2>\n<ul>\n<li>Familiarity with existing open source networking technologies: SONIC / SAI, DENT, kernel (e.g. eBPF, AF_XDP), DPDK, Switchdev, OVN, Open vSwitch.</li>\n<li>Familiarity with data path hardware acceleration protocols and interfaces, such as RDMA, RoCE, iWARP, NVMe, SR-IOV</li>\n<li>Computer architecture knowledge of x86, ARM, and RISC-V</li>\n<li>Experience in complex IP network engineering and implementation</li>\n<li>Experience with virtualization technologies, e.g., QEMU, KVM, etc.</li>\n<li>Previous contribution to open source projects and community involvement</li>\n<li>Performance engineering and security experience</li>\n</ul>\n<h2>What we offer you</h2>\n<p>We consider geographical location, experience, and performance in shaping compensation worldwide. We revisit compensation annually (and more often for graduates and associates) to ensure we recognise outstanding performance. In addition to base pay, we offer a performance-driven annual bonus. We provide all team members with additional benefits, which reflect our values and ideals. We balance our programs to meet local needs and ensure fairness globally.</p>\n<ul>\n<li>Distributed work environment with twice-yearly team sprints in person</li>\n<li>Personal learning and development budget of USD 2,000 per year</li>\n<li>Annual compensation review</li>\n<li>Recognition rewards</li>\n<li>Annual holiday leave</li>\n<li>Maternity and paternity leave</li>\n<li>Employee Assistance Programme</li>\n<li>Opportunity to travel to new locations to meet colleagues</li>\n<li>Priority Pass, and travel upgrades for long haul company events</li>\n</ul>\n<h2>About Canonical</h2>\n<p>Canonical is a pioneering tech firm at the forefront of the global move to open source. As the company that publishes Ubuntu, one of the most important open source projects and the platform for AI, IoT and the cloud, we are changing the world every day. We recruit on a global basis and set a very high standard for people joining the company. We expect excellence - in order to succeed, we need to be the best at what we do. Canonical has been a remote-first company since its inception in 2004.​ Working here is a step into the future, and will challenge you to think differently, work smarter, learn new skills, and raise your game.</p>\n<h2>Canonical is an equal opportunity employer</h2>\n<p>We are proud to foster a workplace free from discrimination. Diversity of experience, perspectives, and background create a better work environment and better products.<a href=\"https://canonical.com/careers/diversity/identity\"> Whatever your identity, we will give your application fair consideration.</a></p>\n<p>#LI-remote</p><p>Requisition ID: 1140</p><p></p>\n    ","tags":"[\"engineering\"]","pubDate":"2024-06-20 09:30:04.283","link":"https://canonical.com/careers/5660661","savedDate":"2024-06-20 09:30:04.283","slug":"open-source-networking-software-engineer-tor-switch-smartnic-dpu-canonical-9293"},{"id":2685077903,"title":"Product Marketer","company":"SafetyWing","image":"https://pbs.twimg.com/profile_images/1177267684574208000/54eG3WmW_400x400.jpg","description":"<h2>🧘 What we offer</h2> <ul><li><!--block-->Fully remote work environment – work from anywhere globally.&nbsp;</li><li><!--block-->Competitive compensation.</li><li><!--block-->Global coverage with Remote Health and Nomad Insurance.</li><li><!--block-->A minimum of 20 days of compensated time off each year.</li><li><!--block-->Referral bonus - an incentive program rewarding you for helping us find exceptional talent to join our team.</li><li><!--block-->Opportunity to unlock more benefits as your tenure with SafetyWing grows.</li></ul><div><!--block-->We are looking forward to hearing from you!</div> <div><!--block--><strong>SafetyWing (YC W18)</strong> is seeking a <strong>Product Marketer </strong>who will streamline our marketing strategies to enhance the success of our insurance products. In this role, you will dive into market research, craft compelling messaging, oversee product launches, and develop tools to boost customer acquisition and retention. Your efforts will ensure our audience understands and values our products, directly contributing to our growth.&nbsp;</div><div><!--block--><br></div><div><!--block-->We are on a mission to remove the role of geographical borders as a barrier to equal opportunities and freedom for everyone. And we are doing that by creating simple health, insurance, and retirement products for remote workers worldwide as a replacement for national welfare systems.</div><div><!--block--><br></div> <h2>💻 Your responsibilities will include</h2>  <ul><li><!--block-->Talking to our customers to find out why they buy our products and keeping an eye on market trends.</li><li><!--block-->Crafting clear and engaging messages that resonate with our diverse audience.</li><li><!--block-->Leading efforts to track and refine our growth, making data-driven suggestions for enhancements.</li><li><!--block-->Ensuring that both our team and customers have a deep understanding and appreciation of our product.</li><li><!--block-->Managing our website in collaboration with the design team to ensure it reflects our core messaging.</li><li><!--block-->Coordinating the launch of new features and product updates, prioritizing alignment with our product's core principles.&nbsp;</li><li><!--block-->Crafting marketing tools like web pages and ads to attract and keep customers, always seeking ways to do it better.</li><li><!--block-->Collaborating with customer success to proactively tackle customer issues and refine their experience.</li><li><!--block-->Leveraging your deep understanding of our product principles to make wise decisions, especially in managing projects and product launches.</li></ul> <h2>🧪 We are looking for someone who</h2> <ul><li><!--block-->Has a background in product marketing.</li><li><!--block-->Is passionate about creating strategies that resonate with target audiences.</li><li><!--block-->Is a team player who's eager to collaborate across functions to achieve shared goals.</li><li><!--block-->Is an innovative thinker, always looking for new ways to engage customers and improve their experience with our products.</li><li><!--block-->Has a strong ability to communicate complex ideas simply and attractively.</li><li><!--block-->Is driven by data to make decisions and improve product positioning.</li></ul><div><!--block--><strong>😀 We like to work with people who:</strong></div><ul><li><!--block-->Want to help build a global social safety net on the Internet.</li><li><!--block-->Think for themselves instead of copying others.</li><li><!--block-->Are willing to try new things, even with the risk of failure.</li><li><!--block-->Are intellectually curious and open to new ideas.</li><li><!--block-->Are creative and bold in the face of any problems.</li><li><!--block-->Have strong integrity and do the right thing.</li></ul>","tags":"[]","pubDate":"2024-06-20 09:30:04.282","link":"https://safetywing.pinpointhq.com/en/jobs/179044","savedDate":"2024-06-20 09:30:04.282","slug":"product-marketer-safetywing-3234"},{"id":3269823928,"title":"Customer Care Specialist (Asia-Pacific time zones)","company":"SafetyWing","image":"https://pbs.twimg.com/profile_images/1177267684574208000/54eG3WmW_400x400.jpg","description":"<h2>🧘 What we offer</h2> <ul><li><!--block-->Fully remote work environment – work from anywhere globally.&nbsp;</li><li><!--block-->A part-time opportunity (up to 25 hours per week) for a long-term contract.</li><li><!--block-->20 days of compensated time off each year.<br><br></li></ul><div><!--block-->In addition, if you join our team for more than 30 hours per week, you will get health and travel insurance.<br>As your journey continues with us, after six months, you can also benefit from a personal development budget and office stipend.<br><br>We are looking forward to hearing from you!</div> <div><!--block--><strong>SafetyWing</strong> (YC W18) is seeking a part-time customer care specialist interested in building a global safety net with us.</div><div><!--block--><br></div><div><!--block-->We are headquartered in San Francisco, while our international team is fully distributed, stretching ten time zones. We are on a mission to remove the role of geographical borders as a barrier to equal opportunities and freedom for everyone. And we are doing that by creating simple health insurance and retirement products for remote workers worldwide as a replacement for national welfare systems. Currently, we support two main products: Travel Medical Insurance and Health Insurance (for companies and individuals).<br><br></div><div><!--block-->We provide 24/7 support to our members and work with a ‘follow the sun’ model. That means we don’t do night shifts or very early mornings. While we work remotely, we have a friendly and helpful global team, and we’re also definitely looking for someone who is a joy to work with. &nbsp;<br><br>Below are some of the principles we live by:</div><ul><li><!--block-->Be honest</li><li><!--block-->Help the customer</li><li><!--block-->Be clear and concise</li><li><!--block-->Be kind and make the customer happy</li></ul> <h2>💻 Your responsibilities will include</h2>  <ul><li><!--block-->Answer customer questions via live chat, email, and phone support.</li><li><!--block-->Proactively look at how to improve the customer experience.</li></ul><div><!--block-->Our top priority is to help our customers find solutions that help them get what they want and need. Within the boundaries of honesty and effective communication, we aim to have conversations that make our customers not only happy supporters of SafetyWing but happy in general.</div> <h2>🧪 We are looking for someone who:</h2> <ul><li><!--block-->Has excellent English language skills (written and spoken).</li><li><!--block-->Has the ability to work independently and be a problem-solver.</li><li><!--block-->Is comfortable working on weekends (usual shifts are between 6 and 8 hours long) and available for up to 25 hours a week.</li><li><!--block-->Extra shine if you have experience with insurance, customer service, or healthcare.</li><li><!--block--><strong>Is comfortable working within the Asia-Pacific time zones (the working hours generally fall between UTC+7 to UTC+10).</strong></li></ul><div><!--block-->😀 We like to work with people who:</div><ul><li><!--block-->Want to help build a global social safety net on the Internet.</li><li><!--block-->Think for themselves instead of copying others.</li><li><!--block-->Are willing to try new things, even with the risk of failure.</li><li><!--block-->Are intellectually curious and open to new ideas.</li><li><!--block-->Are creative and bold in the face of any problems.</li><li><!--block-->Have strong integrity and do the right thing.</li></ul>","tags":"[]","pubDate":"2024-06-20 09:30:04.282","link":"https://safetywing.pinpointhq.com/en/jobs/207721","savedDate":"2024-06-20 09:30:04.282","slug":"customer-care-specialist-asia-pacific-time-zones-safetywing-8870"},{"id":8946135887,"title":"Senior Engineering Manager - Core Database","company":"Timescale","image":"https://pbs.twimg.com/profile_images/1542681228666671107/L5LYJLAD_400x400.png","description":"&lt;p&gt;At Timescale, we are looking for a seasoned engineering leader to manage our Core Database teams. This group represents a core part of what we build and, therefore, a key success factor in our vision of building the next-generation Cloud database.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Engineering managers at Timescale&lt;/strong&gt; are responsible for the overall operation of the team. You will be working directly with the engineers on your team to ensure they have the ability to grow in their careers and feel fulfilled in their work.&amp;nbsp; You will also be working to define and iteratively improve team processes with high-quality, rapid iteration of product features in mind.&amp;nbsp; You will work directly with Senior Product Managers to ensure roadmap items are properly defined, groomed, estimated, and delivered.&amp;nbsp; You will work with engineering and product managers from other teams to ensure any dependencies are scheduled and met.&lt;/p&gt;\n&lt;h3&gt;&lt;strong&gt;Responsibilities&lt;/strong&gt;&lt;/h3&gt;\n&lt;ul&gt;\n&lt;li&gt;Partner with the product manager, engineers, and other engineering managers to deliver the vision, strategy, and adoption of our Core Database.&lt;/li&gt;\n&lt;li&gt;Design and manage the development career of the Database group.&lt;/li&gt;\n&lt;li&gt;Foster a strong accountability culture to enable the team to deliver results in a timely manner that are aligned with the company&#39;s goals.&lt;/li&gt;\n&lt;li&gt;Enable the team to make the right decisions, providing context to make trade-offs accordingly.&lt;/li&gt;\n&lt;li&gt;Hire and coach a top-notch group of engineers with an extensive track record in the industry.&lt;/li&gt;\n&lt;li&gt;Set the quality standards for how we deliver software.&lt;/li&gt;\n&lt;/ul&gt;\n&lt;h3&gt;&lt;strong&gt;Requirements&lt;/strong&gt;&lt;/h3&gt;\n&lt;ul&gt;\n&lt;li&gt;Proven track record managing software engineering teams&lt;/li&gt;\n&lt;li&gt;Proven track record of on-time, quality product delivery.&lt;/li&gt;\n&lt;li&gt;Product mindset.&lt;/li&gt;\n&lt;li&gt;Ability to understand engineer career growth and assist team members in setting and working toward career goals&lt;/li&gt;\n&lt;li&gt;Ability to build strong partnerships with stakeholders.&lt;/li&gt;\n&lt;li&gt;Excellent communication and collaboration skills.&lt;/li&gt;\n&lt;li&gt;Experience hiring and onboarding high-performing engineers&lt;/li&gt;\n&lt;/ul&gt;\n&lt;h3&gt;&lt;strong&gt;Preferred&lt;/strong&gt;&lt;/h3&gt;\n&lt;ul&gt;\n&lt;li&gt;Experience managing fully remote teams&lt;/li&gt;\n&lt;li&gt;Experience with observability, DBaaS, PostgreSQL, Observability tools, and/or cloud-native engineering&lt;/li&gt;\n&lt;/ul&gt;\n&lt;h3&gt;&lt;strong&gt;About Timescale&amp;nbsp;&lt;/strong&gt;&lt;/h3&gt;\n&lt;p&gt;At Timescale, we are dedicated to serving developers worldwide, enabling them to build exceptional data-driven products that measure everything that matters: software applications, industrial equipment, financial markets, blockchain activity, consumer behavior, machine learning models, climate change, and more. Analyzing this data across the time dimension (“time-series data”) enables developers to understand what is happening right now, how that is changing, and why that is changing. Timescale develops TimescaleDB, the category-defining open-source relational database for time-series data, and offers fully-managed TimescaleDB and related database services. Timescale is a remote-first company with a global workforce and is backed by Benchmark Capital, New Enterprise Associates, Redpoint Ventures, Icon Ventures, Two Sigma Ventures, and other leading investors.&lt;/p&gt;&lt;div class=&quot;content-conclusion&quot;&gt;&lt;p&gt;By applying for this position, you are agreeing to &lt;a href=&quot;https://www.timescale.com/legal/timescale-applicant-privacy-notice&quot;&gt;Timescale&#39;s Applicant Privacy Notice.&amp;nbsp;&lt;/a&gt;&lt;/p&gt;&lt;/div&gt;","tags":"[\"postgres\",\"engineering\",\"legal\",\"database\"]","pubDate":"2024-06-20 09:30:04.282","link":"https://www.timescale.com/careers/7311518002?gh_jid=7311518002","savedDate":"2024-06-20 09:30:04.282","slug":"senior-engineering-manager-core-database-timescale-7982"},{"id":3252915715,"title":"HR Intern (Immediate Hire) - Fully Remote","company":"CoverGo","image":"https://pbs.twimg.com/profile_images/1382655628523364355/MWPIbbID_400x400.jpg","description":"<p><strong>Top 3 Reasons To Join Us</strong></p><ul> <li>International Environment</li> <li>100% Remote</li> <li>Exposure to Diverse HR Functions</li> </ul><p><strong>About Us</strong></p><p>At CoverGo, our mission is to empower all insurance companies to make insurance 100% digital and accessible to everyone.</p><ul> <li>We are a leading global no-code insurance platform for health, life, and P&amp;C</li> <li>We’re the winner of the Insurtech of the Year in all of Asia and other awards globally</li> <li>We work with insurance enterprise clients such as AXA, Bupa, MSIG, Dai-ichi, Bank of China Group Insurance, and many more</li> <li>We're an international, diverse team of over 120 people with 30 nationalities and team members working remotely from all over the world</li> <li>We are fully funded and backed by reputable VC funds and strategic institutional investors</li> <li>We have a global presence in Asia, EMEA and the Americas</li> <li>We’ve grown our annualized revenue by over 30x since January 2021</li> <li>We’re constantly working towards making CoverGo a workplace that you love coming to. We deeply believe that bringing together a diversity of thoughts, expressions, and perspectives is key to building the best culture for equally diverse communities all over the world</li> </ul><p><strong>About the Role</strong></p><p>We are seeking a motivated and enthusiastic Human Resources Intern to join our HR team. This is a fantastic opportunity for a student or recent graduate who is looking to gain practical experience in a dynamic and fast-paced environment.</p><p>The HR Intern will assist with various HR tasks and projects, including recruitment, employee onboarding, HR administration, and employee engagement initiatives.</p><p><strong>What You Will Do</strong></p><ul> <li>Assist with recruitment activities, such as posting job ads, screening resumes, and scheduling interviews</li> <li>Support the onboarding process for new hires</li> <li>Assist with HR administrative tasks, including but not limited to maintaining employee records and updating HR databases</li> <li>Organize employee engagement initiatives and events</li> <li>Contribute to HR projects and process improvements</li> <li>Provide general HR support as needed</li> </ul><p><strong>What We Need</strong></p><ul> <li>Currently enrolled in a Bachelor's degree program in Human Resources, Business Administration, or a related field, or a recent graduate</li> <li>Strong organizational and time management skills</li> <li>Excellent communication and interpersonal skills</li> <li>Ability to maintain confidentiality and handle sensitive information</li> <li>Proficiency in Google Workspace</li> <li>Keen attention to detail</li> <li>Proactive and willing to take initiative</li> <li>Ability to work collaboratively in a team environment</li> <li>Positive attitude and eagerness to learn</li> <li>Please be advised that this internship opportunity is unpaid</li> </ul><p><strong>Why You'll Love Working Here</strong></p><ul> <li>Remote Setup</li> <li>International Environment</li> <li>Professional Development Opportunities</li> <li>Company activities and events</li> </ul><p><strong>CoverGo Company</strong><a href=\"https://www.youtube.com/watch?v=YI0ezLxvFvA\" rel=\"nofollow noreferrer noopener\" class=\"external\"><strong> Video</strong></a></p><p>By submitting your application, you confirm that you have read, understood, and accepted the content of CoverGo’s <a href=\"https://apply.workable.com/covergo/gdpr_policy?lng=en\" target=\"_blank\" rel=\"nofollow noreferrer noopener\" class=\"external\">Privacy Notice</a> and you consent to the processing of your data as part of this application.</p><h3>Requirements: </h3><h3>Benefits: </h3>","tags":"[\"management\",\"database\"]","pubDate":"2024-06-20 00:00:00.000","link":"https://apply.workable.com/covergo/j/F4B21724F9","savedDate":"2024-06-20 09:30:04.284","slug":"hr-intern-immediate-hire-fully-remote-covergo-2182"},{"id":9311887987,"title":"Product Manager - Treasury & Corporate Accounts (Remote - Work from Anywhere)","company":"Xapo Bank","image":"https://s3-recruiting.cdn.greenhouse.io/external_greenhouse_job_boards/logos/400/530/000/resized/greyBackground.jpg?1692112526","description":"&lt;div class=&quot;content-intro&quot;&gt;&lt;p style=&quot;text-align: left;&quot;&gt;&lt;span style=&quot;font-weight: 900;&quot;&gt;Work from anywhere, impact everywhere&amp;nbsp;&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;Diversity is at the heart of who we are at Xapo Bank. We’re a fully distributed team of over 140 Xapiens that work remotely from 40+ countries around the world.&amp;nbsp;&lt;/p&gt;\n&lt;p&gt;Our beginning: A world that enjoys economic freedom and wealth protection, no matter where you live or who is running your country. This is the dream that drove Wences Casares, our Founder and Chairman, to quietly transform the world of banking.&lt;/p&gt;\n&lt;p&gt;To achieve that, we search the world for the best people for the job. We work hard, think globally, and inspire each other to learn and grow. We are committed to changing the way things are done.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Risk is inherent in all of our business activities and managing risk well is the responsibility of every Xapien. Sound risk management enables us to serve our customers and deliver value for our shareholders, and helps make Xapo a great place to work.&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&amp;nbsp;&lt;/p&gt;\n&lt;p style=&quot;text-align: left;&quot;&gt;&lt;em&gt;&lt;span style=&quot;font-weight: 500;&quot;&gt;Although we are headquartered in Gibraltar, this is a full time, 100% remote position&amp;nbsp;&lt;br&gt;&lt;/span&gt;&lt;/em&gt;&lt;em&gt;&lt;span style=&quot;font-weight: 500;&quot;&gt;Work from anywhere!&lt;/span&gt;&lt;/em&gt;&lt;/p&gt;\n&lt;p style=&quot;text-align: left;&quot;&gt;&amp;nbsp;&lt;/p&gt;&lt;/div&gt;&lt;p&gt;&lt;strong&gt;&lt;em&gt;Position overview&lt;/em&gt;&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;As a Product Manager for Treasury and Corporate Accounts at Xapo Bank, you will play a pivotal role in optimizing the deployment of funds for our internal Treasury team. You will lead product discovery and MVP development for a new corporate account offering that acts like a treasury account. This role involves close collaboration with cross-functional teams to ensure the successful launch and continuous improvement of our treasury and corporate account products.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;&lt;em&gt;Responsibilities&lt;/em&gt;&lt;/strong&gt;&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;&lt;strong&gt;Treasury Optimization. &lt;/strong&gt;Our Treasury team is the heartbeat of how we earn. You’ll work closely with the Treasury team to understand their needs and optimize fund deployment strategies - developing tools and processes to enhance our treasury.&lt;/li&gt;\n&lt;li&gt;&lt;strong&gt;Product Discovery and Development.&lt;/strong&gt; Lead extensive product discovery for corporate accounts that function like treasury accounts. Define MVP features and the creation of a potential roadmap moving forward.&amp;nbsp;&lt;/li&gt;\n&lt;li&gt;&lt;strong&gt;Market Research and Analysis.&lt;/strong&gt; Conduct in-depth market research to identify trends, customer needs, and opportunities for product innovation.&amp;nbsp;&lt;/li&gt;\n&lt;li&gt;&lt;strong&gt;Product Development Support.&lt;/strong&gt; Collaborate with cross-functional teams, including your tech lead, developers, our treasury function and others to create comprehensive product requirements, user stories, and feature prioritisation. You’ll coordinate with legal, compliance, and risk management teams as well to ensure successful launches and adherence to regulatory standards.&lt;/li&gt;\n&lt;li&gt;&lt;strong&gt;Product Testing and Quality Assurance. &lt;/strong&gt;Ensure rigorous testing and quality assurance for new product releases and feature updates. Maintain high standards of performance, security, and reliability.&lt;/li&gt;\n&lt;li&gt;&lt;strong&gt;Performance Monitoring and Analysis. &lt;/strong&gt;Track key performance indicators (KPIs), user engagement metrics, and customer feedback to identify areas for improvement and drive product optimization.&lt;/li&gt;\n&lt;li&gt;&lt;strong&gt;Professional Development.&lt;/strong&gt; You’ll have to stay updated on the latest trends and technologies in fintech, blockchain, and cryptocurrency markets to continuously enhance your knowledge and skills.&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;&lt;strong&gt;&lt;em&gt;Skills needed&lt;/em&gt;&lt;/strong&gt;&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;Bachelor&#39;s degree in a related field.&lt;/li&gt;\n&lt;li&gt;Proven experience in product management, preferably within fintech, banking, or cryptocurrency markets.&lt;/li&gt;\n&lt;li&gt;Excellent analytical, problem-solving, and critical thinking skills.&lt;/li&gt;\n&lt;li&gt;Strong communication and interpersonal skills, with the ability to collaborate effectively in a global, multicultural environment.&lt;/li&gt;\n&lt;li&gt;Detail-oriented with strong organizational and project management abilities.&lt;/li&gt;\n&lt;li&gt;Experience with market research, data analysis, and performance monitoring.&lt;/li&gt;\n&lt;li&gt;Knowledge of treasury management and corporate banking is a plus.&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;&lt;strong&gt;&lt;em&gt;Other requirements&lt;/em&gt;&lt;/strong&gt;&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;A dedicated workspace.&lt;/li&gt;\n&lt;li&gt;A reliable internet connection with the fastest speed possible in your area.&lt;/li&gt;\n&lt;li&gt;Devices and other essential equipment that meet minimal technical specifications.&lt;/li&gt;\n&lt;li&gt;Alignment with Our Values and the Xapo Values-Driven Leadership principles.&lt;/li&gt;\n&lt;/ul&gt;&lt;div class=&quot;content-conclusion&quot;&gt;&lt;p&gt;&lt;span style=&quot;font-size: 12pt;&quot;&gt;&lt;strong&gt;Why work for Xapo?&lt;/strong&gt;&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span style=&quot;font-weight: 500; font-size: 10pt;&quot;&gt;IMPACT GLOBALLY, WORK REMOTELY.&lt;/span&gt;&lt;/p&gt;\n&lt;ul&gt;\n&lt;li style=&quot;font-weight: 500;&quot;&gt;&lt;strong&gt;Shape the Future:&lt;/strong&gt;&lt;span style=&quot;font-weight: 500;&quot;&gt; Improve lives through cutting-edge technology, work 100% remotely from anywhere in the world.&lt;/span&gt;&lt;/li&gt;\n&lt;li style=&quot;font-weight: 500;&quot;&gt;&lt;strong&gt;Great work-life balance:&lt;/strong&gt;&lt;span style=&quot;font-weight: 500;&quot;&gt; &lt;/span&gt;&lt;span style=&quot;font-weight: 500;&quot;&gt;Build amazing things with a balance of autonomy and collaborative teamwork. Set your own work schedule and make use of a flexible PTO plan when you need to recharge.&lt;/span&gt;&lt;span style=&quot;font-weight: 500;&quot;&gt;&amp;nbsp;&lt;/span&gt;&lt;/li&gt;\n&lt;li style=&quot;font-weight: 500;&quot;&gt;&lt;strong&gt;Expect Excellence:&lt;/strong&gt;&lt;span style=&quot;font-weight: 500;&quot;&gt; Collaborate, learn, and grow with a high-performance team. Learn&lt;/span&gt;&lt;span style=&quot;font-weight: 500;&quot;&gt; how you learn best - from books to conferences, you’ll get a yearly budget for your individual learning and development goals.&lt;/span&gt;&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;&lt;strong&gt;At Xapo, we prioritize consumer protection and adhere to regulatory requirements by ensuring that all Xapiens are accountable for upholding principles of fair treatment, transparency, and ethical conduct in their interactions with customers and stakeholders.&lt;/strong&gt;&lt;/p&gt;&lt;/div&gt;","tags":"[\"management\",\"legal\"]","pubDate":"2024-06-19 13:14:57.000","link":"https://boards.greenhouse.io/xapo61/jobs/6025637003","savedDate":"2024-06-20 09:30:04.289","slug":"product-manager-treasury-corporate-accounts-remote-work-from-anywhere-xapo-bank-4213"},{"id":3561671879,"title":"Cyber Security Analyst - Fully Remote","company":"CoverGo","image":"https://pbs.twimg.com/profile_images/1382655628523364355/MWPIbbID_400x400.jpg","description":"<p><strong>Top 3 Reasons To Join Us</strong></p><ul> <li>Competitive Salary</li> <li>100% Remote</li> <li>Working on the latest tech for the Insurtech Market Leader</li> </ul><p><strong>About Us</strong></p><p>At CoverGo, our mission is to empower all insurance companies to make insurance 100% digital and accessible to everyone.</p><ul> <li>We are a leading global no-code insurance platform for health, life, and P&amp;C</li> <li>We’re the winner of the Insurtech of the Year in all of Asia and other awards globally</li> <li>We work with insurance enterprise clients such as AXA, Bupa, MSIG, Dai-ichi, Bank of China Group Insurance, and many more</li> <li>We're an international, diverse team of over 120 people with 30 nationalities and team members working remotely from all over the world</li> <li>We are fully funded and backed by reputable VC funds and strategic institutional investors</li> <li>We have a global presence in Asia, EMEA and the Americas</li> <li>We’ve grown our annualized revenue by over 30x since January 2021</li> <li>We’re constantly working towards making CoverGo a workplace that you love coming to. We deeply believe that bringing together a diversity of thoughts, expressions, and perspectives is key to building the best culture for equally diverse communities all over the world</li> </ul><p><strong>About the Role</strong></p><p>As a Cyber Security Analyst, your primary duties will involve handling operational security tasks to enhance CoverGo's overall cybersecurity posture. This opportunity is ideal for someone with the determination and passion to safeguard a startup company against contemporary cyber threats. Initially, you will focus on your areas of expertise, gradually expanding your proficiency across multiple domains.</p><p><strong>What You Will Do</strong></p><ul> <li>Oversee and run different operational security tasks, ranging from SOC L1/L2 analyst duties and employee awareness campaigns to ensuring compliance control performance</li> <li>Efficiently address day-to-day cybersecurity challenges</li> <li>Effectively communicate, solicit feedback, and be proactive in working on the company’s cyber security practices</li> <li>Perform daily tasks which consist of some of the following activities: agile team ceremonies, SIEM alert validation, incident management, providing training &amp; awareness, performance of ISO 27001 compliance controls</li> <li>Other tasks that depend on your previous experience on the following security domains:</li> </ul><ol> <li>ISO 27001 or SOC2 (or similar) internal control performance and experience in passing external audits</li> <li>Security Operations Center Experience in an in-house Security Operations Center (threat analysis, SIEM configuration, incident management)</li> <li>Infrastructure security (vulnerability scanning, Kubernetes security)</li> <li>Secure software development and DevSecOps practices (SAST, DAST, AppSec requirements)</li> </ol><ul><li>Join our cybersecurity team with a direct report to the Head of Security</li></ul><ul><li>Perform ad hoc cyber security related assignments and projects as required</li></ul><p><strong>What We Need</strong></p><ul> <li>At least 1 year of experience as a Cyber Security Analyst or in a similar role</li> <li>Hands-on experience in at least 2 of the following 4 security domains:</li> <ul> <li>ISO 27001 or SOC2 (or similar) internal control performance and experience in passing external audits</li> <li>Security Operations Center Experience in an in-house Security Operations Center (threat analysis, SIEM configuration, incident management)</li> <li>Infrastructure security (vulnerability scanning, Kubernetes security)</li> <li>Secure software development and DevSecOps practices (SAST, DAST, AppSec requirements)</li> </ul> <li>​​A university degree in Computer Science, or any relevant science or engineering discipline; alternatively a track record in cyber security upskilling</li> <li>Experience in organizations that leverage heavily public cloud providers such as AWS &amp; Azure</li> <li>Relevant experience in pentesting, internal audit, and actual software development experience is an advantage</li> <li>Fully remote position but must be currently based in the Philippines due to timezone requirements</li> <li>Excellent English skills, both written and spoken</li> <li>Ability to work independently, be a self starter, and have a solution-driven approach, actively solving problems and driving positive change in the organization</li> <li>Ability to obtain organizational buy-in and explain security concepts to both engineers and business people</li> <li>Someone who understands accountability and who is well-organized and conscientious with a high level of initiative at work</li> </ul><p><strong>Why You'll Love Working Here</strong></p><ul> <li>Fully Remote</li> <li>Flexible Leave</li> <li>International Environment</li> <li>Competitive renumeration package</li> <li>Performance Bonus</li> <li>Stock Options after 6 months </li> <li>Company activities and events</li> <li>Learning and development plan</li> </ul><p><strong>CoverGo Company </strong><a href=\"https://www.youtube.com/watch?v=YI0ezLxvFvA\" rel=\"nofollow noreferrer noopener\" class=\"external\"><strong>Video</strong></a></p><p>By submitting your application, you confirm that you have read, understood, and accepted the content of CoverGo’s <a href=\"https://apply.workable.com/covergo/gdpr_policy?lng=en\" target=\"_blank\" rel=\"nofollow noreferrer noopener\" class=\"external\">Privacy Notice</a> and you consent to the processing of your data as part of this application.</p><h3>Requirements: </h3><h3>Benefits: </h3>","tags":"[\"management\",\"engineering\",\"cyber security\",\"aws\"]","pubDate":"2024-06-19 00:00:00.000","link":"https://apply.workable.com/covergo/j/F82F7BFF45","savedDate":"2024-06-20 09:30:04.284","slug":"cyber-security-analyst-fully-remote-covergo-5016"},{"id":7837710669,"title":"Sr. Product Designer (Remote)","company":"Empower","image":"https://lever-client-logos.s3.us-west-2.amazonaws.com/2e1a369c-b58f-41ac-8d86-4b0a77695e68-1687915522032.png","description":"<div><b style=\"font-size: 24px\">EMPOWER OVERVIEW</b></div><div><br></div><div><a href=\"http://empower.me/\" class=\"postings-link\">Empower</a>&nbsp;is a high-growth financial technology company on a mission to expand access to fair credit to give anyone in the world the opportunity to improve their financial security and mobility. We dream up and launch one-of-a-kind features that help our members get money instantly whenever they need it, save for the future, and rewrite their financial story. Our members see Empower Cash Advance as a life-saver, Empower Automatic Savings as a game-changer, and the new Empower Thrive line of credit as a lifeline to low-cost borrowing and the only practical path to building good credit.</div><div><br></div><div>Empower is backed by Sequoia Capital, Blisce, and Icon Ventures. Are we the next great place to grow your impact and accelerate your career? We think so:</div><div><br></div><div>Inc. ranked Empower #56 in the 2023 Inc. 5000 list of the fastest-growing private companies in the US (#55 in 2022). Forbes put Empower on its 2023 list of America's Best Startup Employers. Fast Company recognized the new Empower Thrive line of credit in their 2022 list of the Next Big Things in Tech. </div><div><br></div><div><b style=\"font-size: 18px\">THE EMPOWER WAY</b></div><div><b>Great Expectations</b>: We come up with bold, audacious goals for ourselves and go all out for impact</div><div><b>Owner Mindset</b>: We give every employee latitude to act independently, make smart choices, and move the business forward</div><div><b>Spirited Debate</b>: We love skeptics and seek counter opinions to challenge our personal assumptions and expand our view</div><div><b>Customer Obsession: </b>We listen to understand, empathize, and create a memorable, rewarding experience for our community</div><div><b>Inclusive Collaboration</b>: We believe diverse teams make the best decisions, and we strive to give diverse voices a seat at the table</div><div>N<b>o Jerks Allowed</b>: We value our relationships and take the time to build trust and connection and communicate respectfully</div><div><span style=\"font-size: 12pt\">&nbsp;</span></div><div><br></div><div><b style=\"font-size: 18px\">WHAT EMPOWER OFFERS</b></div><div><br></div><div>Competitive salary</div><div>Generous equity package</div><div>Full healthcare and dental benefits</div><div>Technology expense reimbursement</div><div>Work from anywhere</div><div><br></div><div>&nbsp;</div><div><b style=\"font-size: 18px\">JOB DESCRIPTION</b></div><div>As a Senior Product Designer at Empower, you’ll be integral to the entire design process. Our Product Designers are customer-centric and collaborate closely with other designers, product managers, and engineers to bring innovative ideas to life, ensuring our products positively impact our customers’ financial lives.</div><div><br></div><div>Successful Senior Product Designers are ambitious and relentlessly pursue excellence. Design thinking is at the core of their creative process. They push boundaries and innovate, applying design thinking principles to solve complex problems and create user-centered solutions. This involves empathizing with users, defining clear and actionable insights, ideating on potential solutions, prototyping, and rigorously testing their designs to ensure they meet the highest standards. Their ambition drives them to continuously improve and refine their skills, staying ahead of industry trends and delivering exceptional value through thoughtful, well-crafted design.</div><div><br></div><div><span style=\"font-size: 10.5pt\">Empower is a remote-first company. We drive connectivity through regular company offsites. Travel for company offsites is expected at a minimum 2 times a year.</span></div><div>For US based employee's, this salary range includes several career levels of consideration and will be discussed further during the interview process. The salary range is based on a variety of factors such as candidate experience, qualifications, and business needs. The base pay range is subject to change and may be modified in the future. </div><h3>Qualifications</h3><li>4-5+ years of work experience in product design, visual design, UI/UX and mobile app design</li><li>Own design projects across the entire product lifecycle and iterations that follow</li><li>Work closely with our product, engineering, and ops teams to find visually appealing and practical solutions to business problems</li><li>Influence and help shape the design culture at Empower</li><li>Strong customer empathy and experience shaping product’s User Experience and execution based on customer needs</li><li>Strong strategic thinking, problem-solving, and logical structuring abilities</li><li>An excellent portfolio that demonstrates love and care for their craft (Please submit your portfolio)</li><li>Proven experience building high-quality consumer-facing mobile products</li><li>Experience quickly iterating and building prototypes</li><li>Excellent verbal and written communication skills</li><li>Expert level skills in Figma or Sketch </li><li>Relevant fintech experience is a plus</li><div>At Empower, we hire for people that push themselves to understand others and seek out ways to challenge their personal assumptions. Our hope is that by fostering such an environment, we strengthen our business and relationships by putting people first. We are committed to building a diverse, inclusive, and equitable workspace where everyone (regardless of age, education, ethnicity, gender, sexual orientation, or any personal characteristics) feels like they belong. Even if your experience doesn’t exactly match up to our job description, you should feel empowered to apply regardless!&nbsp;</div>","tags":"[\"engineering\"]","pubDate":"2024-06-18 22:16:19.190","link":"https://jobs.lever.co/empower.me/d4fae1b5-44aa-4ee7-b192-080ddcf52e9c","savedDate":"2024-06-20 09:30:04.285","slug":"sr-product-designer-remote-empower-1485"},{"id":2306748983,"title":"Senior  Technical Project Manager (IB)","company":"Blue Coding","image":"https://lever-client-logos.s3.us-west-2.amazonaws.com/3c1d9ac7-6738-46c5-b6ca-a35fa2a0df57-1666278594128.png","description":"<div><i style=\"font-size: 18px\">Do you want to earn a salary in USD?&nbsp;</i></div><div><i style=\"font-size: 18px\">Would you like to work from wherever you want?</i></div><div><i style=\"font-size: 18px\">Would you like to be a part of the leading next-gen software developers?&nbsp;</i></div><div><br></div><div><b style=\"font-size: 24px\">Hi, you finally found us!</b><span style=\"font-size: 24px\">&nbsp;</span></div><div><br></div><div><b style=\"font-size: 24px\">Why work at Blue Coding?</b><span style=\"font-size: 24px\">&nbsp;</span></div><div><br></div><div>At Blue Coding we specialize in hiring excellent developers and amazing people from all over Latin America and other parts of the world. For the past 9 years, we’ve helped cutting-edge companies in the United States and Canada -both large and small, build great development teams and develop great products. Online shops, digital agencies, SaaS providers, and software consulting firms are a few of our clients. Our team of over 100 engineers is distributed in more than 10 countries across the Americas. We are a fully remote company working with a wide array of technologies and have expertise in every stage of the software development process.&nbsp;&nbsp;</div><div><br></div><div>Our team is highly connected, united, and culturally diverse, and our collaborators are involved in many initiatives around the world, from wildlife preservation to volunteering at local charities. We also participate in group activities like movie nights, trivia, and meme competitions. We stand for honesty, fairness, respect, efficiency, hard work, and cooperation.</div><div><br></div><div><b style=\"font-size: 24px\">What are we looking for?</b></div><div><br></div><div>We are looking for a <b>Technical Project Manager</b> to support our client's Technology Organization. Our client drives cross-functional alignment, creates process efficiencies, and delivers large-scale strategic initiatives in a rapidly growing Legal Technology space.</div><div><span style=\"font-size: 10pt\">&nbsp;</span></div><div><span style=\"font-size: 10pt\">The ideal candidate will join a team of technical project and program managers who focus on driving&nbsp;business-critical initiatives across the product development organization. You will be a strong self-starter and, therefore, able to drill into business data and technical trade-offs to identify clear direction and focus for your tasks, projects, and programs. You know how to continue to move forward in the face of ambiguity&nbsp;and imperfect knowledge.&nbsp;</span></div><div><span style=\"font-size: 10pt\">You will have experience working with multiple partners across an organization and are skilled at building&nbsp;and maintaining relationships. You’ll demonstrate a successful track record leading medium to large&nbsp;projects using agile methodologies. You’ll be able to thrive and succeed in an entrepreneurial&nbsp;environment and not be hindered by ambiguity or competing priorities. You show good judgment, making&nbsp;trade-offs between immediate and long-term business needs.&nbsp;</span></div><div><br></div><div><b style=\"font-size: 24px\">What's unique about this job?</b></div><div><br></div><div>Our client is a new media company based in El Segundo, California, United States, that operates online media, community, and e-commerce sites in vertical markets. The company also develops and licenses internet software and social media applications.</div><div><br></div><div>They’ve grown to become the leading digital franchise focused on large vertical markets, headlined by their current focus on the Health and Legal markets.</div><div><br></div><div>Their unique and focused approach scales rapidly, drives consistent growth and enables rapid innovation to meet their users' and commercial partners' evolving needs. This approach also enables them to unlock new market segments quickly and efficiently.</div><div><br></div><div><br></div><h3>Here are some of the exciting day-to-day challenges you will face in this role:</h3><li>Drive end-to-end program planning and execution across multi-disciplinary teams</li><li>Support strategic cross-functional planning, leading discovery and prioritization by closely&nbsp;collaborating with product and engineering leads to develop program plans&nbsp;</li><li>Partner with product and engineering to develop project milestones, track progress, handle&nbsp;cross-team dependencies, resource planning, mitigate risks and run effective communications&nbsp;</li><li>Proactively identify and remove impediments to drive momentum and progress. Identify&nbsp;</li><li>communication gaps, lead issue resolution and provide support to teams balancing competing&nbsp;priorities&nbsp;</li><li>Work closely with stakeholders and product managers to ensure that requirements are translated&nbsp;to the technology requirements that subsequently drive the execution of software development&nbsp;from design through successful deployment and adoption.&nbsp;</li><li>Collaborate to define the technical architecture of solutions for services and support technical&nbsp;implementation and integration efforts.&nbsp;</li><li>Document project plans for cross-team initiatives and drive on-schedule delivery of results&nbsp;</li><li>Contribute to the definition, development and tracking of product and team metrics and&nbsp;operational improvements&nbsp;</li><li>Drive consistent, high-quality project management practices by creating and maintaining a&nbsp;repository of templates and best practices&nbsp;</li><li>Communicate project risks, progress, launches and retrospectives across all stakeholders and&nbsp;teams – consistently and transparently&nbsp;</li>,<h3>You will shine if you have these:</h3><li>5+ years of experience in technical program management working directly with software&nbsp;engineering teams&nbsp;</li><li>5+ years of experience working at a technology company, preferably within a SaaS model&nbsp;</li><li>3+ years of experience leading software development projects with schedules and deadlines&nbsp;</li><li>Direct experience using iterative or agile methodologies&nbsp;</li><li>Proven track record of successful program delivery and handling complex initiatives across a&nbsp;variety of cross-functional teams&nbsp;</li><li>Must have experience using project planning, road mapping and issue tracking tools - JIRA,&nbsp;Confluence, Smartsheet, Roadmunk&nbsp;</li><li>BS/BA degree required, preferably in computer science or technical disciplines</li>,<h3>It doesn't hurt if you also have:</h3><li>Scrum Master, Scaled Agilist, or PMP Certification&nbsp;</li><li>Experience working cross-functionally with product management, design, engineering,&nbsp;marketing, customer support and operations&nbsp;</li><li>Experience owning program strategy, end-to-end delivery, and communicating results to senior&nbsp;leadership&nbsp;</li>,<h3>Here are some of the perks we offer you:</h3><li>Salary in USD</li><li>Flexible schedule (within US Time zones)</li><li>Benefits Package</li><li>100% remote</li><li>Long-term and full-time</li><div><b style=\"font-size: 24px\">Hey, you are still here!</b><span style=\"font-size: 24px\">&nbsp;</span></div><div><br></div><div>So, let us ask a few questions. Do you like working in a friendly environment? Are you fluent in English? Do you have a strong work ethic, are detail-oriented and have an ownership mentality? And most importantly do you love music and puppies? If so, then what are you waiting for? Come join our team and become part of this awesome company! We will be expecting you.</div>","tags":"[\"management\",\"engineering\",\"legal\"]","pubDate":"2024-06-18 20:30:47.128","link":"https://jobs.lever.co/bluecoding/627d69ab-459b-4afd-8def-8b2df53fd97d","savedDate":"2024-06-20 09:30:04.287","slug":"senior-technical-project-manager-ib-blue-coding-4804"},{"id":2856428642,"title":"Content Specialist, Germany & Austria","company":"Airalo","image":"https://lever-client-logos.s3.us-west-2.amazonaws.com/55028a36-609c-479c-9553-d4689ff2dd8c-1669620566663.png","description":"<div><b>About Airalo</b></div><div>Alo! Airalo is the world’s first eSIM store that helps people connect in over 200+ countries and regions across the globe. We are building the next digital service that revolutionizes the telecom industry. We are a travel-tech company and an equal-opportunity environment that values and executes diversity, inclusion, and equity. Our team is spread across 50+ countries and six continents. What glues us together is our commitment to changing the way you connect.</div><div><b>About you</b></div><div>We hope that you care deeply about the quality of your work, the intrinsic worth of tasks, and the success of your team. You are self-disciplined and do not require micromanagement in terms of your skillset and work ethic. You do your best to flourish as an individual every day while working hard to foster a collaborative team environment. You believe in the importance of being — and staying — authentic, honest, positive, and kind. You are a good interlocutor with clear and concise communication. You are able to manage multiple projects, have an analytical mind, pay keen attention to detail, and love to get your hands dirty. You are cognizant, tolerant, and welcoming of vulnerabilities and cultural differences.</div><div><b>About the Role</b></div><div><b>Position</b>: Full-time / Employee</div><div><b>Location:</b></div><div>Remote-first</div><div><b>Benefits:</b></div><div>Employee Stock Options, Health Insurance, work-from-anywhere stipend, annual wellness &amp; learning credits, annual all-expenses-paid company retreat in a gorgeous destination &amp; other benefits.</div><div>As a <b>Content Specialist, Germany &amp; Austria</b> at Airalo, you will work closely with the rest of the European and Global team to apply the best practices around content production, SEO, PR and ASO. The role will be responsible for developing and monitoring different content channels using analytic tracking tools and performing strategies to identify opportunities where Airalo can increase brand awareness/conversion rates and improve organic visibility in those channels.</div><div>You will be owning and leading the entire content processes for the German and Austrian markets from the creative stage to running all tests and reporting on results to stakeholders.</div><h3>Responsibilities include but are not limited to:</h3><li>Working directly with the Growth Director Europe to develop content strategies aligned with Airalo's short-term and long-term country targets</li><li>Developing an editorial calendar together with the German Social media and Influencer Specialist and with the support of the Global team members</li><li>Creating and publishing engaging content for your market, including: email marketing, paid advertising assets, video marketing scripts, educational content, PR, App store listings, blog, podcasts etc</li><li>Optimizing the content according to SEO and ASO best practices for the German market</li><li>Using content management systems to analyze website traffic and user engagement metrics and reporting results back to the European team</li><li>Staying up-to-date with developments and generating new ideas, including the use of multimedia to produce rich content</li>,<h3>Must-haves:</h3><li>3+ years of experience in Content, SEO, PR and ASO, preferably in a startup/scaleup international context</li><li>Excellent knowledge of the German and Austrian market</li><li>Strong understanding of SEO and keyword research</li><li>Experience with ASO: knowledge of app store algorithms, optimization methods and effective strategies for growing app installs including campaign measurement and attribution</li><li>A balanced mix of creativity (content creation) and analytical skills (reporting results) with the ability to spot patterns and trends using the latest app analytics tools</li><li>Experience in creating multimedia content, including blog, press releases, social and video production</li><li>Experience with analytics tools and/or other market research tools, e.g. SEMrush, Ahrefs</li><li>Fluency in English, with impeccable verbal and written communication skills</li>,<h3>Nice to have: </h3><li>Experience targeting a large B2C and B2B2C audience, even better if in the travel industry</li><li>Understanding of UX copywriting and technical content</li><li>Knowledge of eSIM and GSMA-related technologies and services</li>","tags":"[\"management\",\"B2C\",\"B2B\"]","pubDate":"2024-06-18 16:59:58.492","link":"https://jobs.lever.co/airalo/f6eca286-c42b-4717-86c2-865dd23f6d07","savedDate":"2024-06-20 09:30:04.286","slug":"content-specialist-germany-austria-airalo-1840"},{"id":8638702075,"title":"Senior Account Manager - APAC (Remote - Work from Anywhere)","company":"Xapo Bank","image":"https://s3-recruiting.cdn.greenhouse.io/external_greenhouse_job_boards/logos/400/530/000/resized/greyBackground.jpg?1692112526","description":"&lt;div class=&quot;content-intro&quot;&gt;&lt;p style=&quot;text-align: left;&quot;&gt;&lt;span style=&quot;font-weight: 900;&quot;&gt;Work from anywhere, impact everywhere&amp;nbsp;&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;Diversity is at the heart of who we are at Xapo Bank. We’re a fully distributed team of over 140 Xapiens that work remotely from 40+ countries around the world.&amp;nbsp;&lt;/p&gt;\n&lt;p&gt;Our beginning: A world that enjoys economic freedom and wealth protection, no matter where you live or who is running your country. This is the dream that drove Wences Casares, our Founder and Chairman, to quietly transform the world of banking.&lt;/p&gt;\n&lt;p&gt;To achieve that, we search the world for the best people for the job. We work hard, think globally, and inspire each other to learn and grow. We are committed to changing the way things are done.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Risk is inherent in all of our business activities and managing risk well is the responsibility of every Xapien. Sound risk management enables us to serve our customers and deliver value for our shareholders, and helps make Xapo a great place to work.&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&amp;nbsp;&lt;/p&gt;\n&lt;p style=&quot;text-align: left;&quot;&gt;&lt;em&gt;&lt;span style=&quot;font-weight: 500;&quot;&gt;Although we are headquartered in Gibraltar, this is a full time, 100% remote position&amp;nbsp;&lt;br&gt;&lt;/span&gt;&lt;/em&gt;&lt;em&gt;&lt;span style=&quot;font-weight: 500;&quot;&gt;Work from anywhere!&lt;/span&gt;&lt;/em&gt;&lt;/p&gt;\n&lt;p style=&quot;text-align: left;&quot;&gt;&amp;nbsp;&lt;/p&gt;&lt;/div&gt;&lt;p&gt;&lt;strong&gt;&lt;em&gt;Position overview&lt;/em&gt;&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;The Senior Account Manager role is an integral part of the Customer Success Team and will be responsible for managing an assigned portfolio of high net worth customer accounts at Xapo Bank. Account Managers are responsible for identifying leads, building relationships with their customers and assisting them when the need arises on all Xapo Banks products. In collaboration with the regional Customer Success Advisors, Account Managers ensure that our customers enjoy consistent support during the onboarding process and throughout their journey with Xapo, creating a “customer for life” experience.&amp;nbsp;&amp;nbsp;&amp;nbsp;&lt;/p&gt;\n&lt;p&gt;Account Managers are tasked with achieving a defined revenue target through retention of existing business and acquisition of new business, in order to maximise the bank’s profitability.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;&lt;em&gt;Responsibilities&lt;/em&gt;&lt;/strong&gt;&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;Originate, onboard and maintain HNW customer relationships in the APAC region.&lt;/li&gt;\n&lt;li&gt;Understand their customers needs and formulate appropriate solutions to meet the needs based on the customers circumstances and risk appetite&lt;/li&gt;\n&lt;li&gt;Act as an escalation point regionally for Customer Success Advisors when provide banking services to customers&lt;/li&gt;\n&lt;li&gt;Attend regional events to promote the Xapo brand&lt;/li&gt;\n&lt;li&gt;Monitor customers portfolio and provide timely update to clients as appropriate&lt;/li&gt;\n&lt;li&gt;Perform regular reviews with customers to re-assess client’s risk profile, wealth management needs and other customer details&lt;/li&gt;\n&lt;li&gt;Perform tasks in accordance with regulatory and compliance requirements&lt;/li&gt;\n&lt;li&gt;Achieving your KPIs/targets in alignment with the overall objectives of the team and business&lt;/li&gt;\n&lt;li&gt;Providing product demonstrations to prospects and customers.&lt;/li&gt;\n&lt;li&gt;Working alongside the team to draw up strategies to increase customer base and cross selling opportunities to grow AUM.&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;&lt;strong&gt;Take all measures, go above and beyond, to ensure clients needs are met whether this is through the onboarding process or when they have become a member&lt;/strong&gt;&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;Keeping up-to-date with advancements in the crypto and traditional finance industries&lt;/li&gt;\n&lt;li&gt;Escalate issues that are specific to the region to Product and other partner teams&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;&lt;strong&gt;&lt;em&gt;Skills needed&lt;/em&gt;&lt;/strong&gt;&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;Fluent in English and Mandarin&lt;/li&gt;\n&lt;li&gt;5+ years of customer facing banking experience in private banking, private wealth, investment banking or commercial banking.&lt;/li&gt;\n&lt;li&gt;Professional or personal exposure to the crypto markets.&lt;/li&gt;\n&lt;li&gt;Track record of originating leads and managing existing relationships with customers in the financial services industry.&lt;/li&gt;\n&lt;li&gt;Confidence in orchestrating face to face and online meetings with customers and handling enquiries from prospects at industry events.&lt;/li&gt;\n&lt;li&gt;Track record of achieving KPIs/targets relating to conversion and AUM growth&lt;/li&gt;\n&lt;li&gt;Strong regional network in the financial services sector&lt;/li&gt;\n&lt;li&gt;A solid understanding of fiat payment rails and stablecoins.&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;&lt;strong&gt;&lt;em&gt;Other requirements&lt;/em&gt;&lt;/strong&gt;&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;A dedicated workspace.&lt;/li&gt;\n&lt;li&gt;A reliable internet connection with the fastest speed possible in your area.&lt;/li&gt;\n&lt;li&gt;Devices and other essential equipment that meet minimal technical specifications.&lt;/li&gt;\n&lt;li&gt;Alignment with Our Values and the Xapo Values-Driven Leadership principles.&lt;/li&gt;\n&lt;/ul&gt;&lt;div class=&quot;content-conclusion&quot;&gt;&lt;p&gt;&lt;span style=&quot;font-size: 12pt;&quot;&gt;&lt;strong&gt;Why work for Xapo?&lt;/strong&gt;&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span style=&quot;font-weight: 500; font-size: 10pt;&quot;&gt;IMPACT GLOBALLY, WORK REMOTELY.&lt;/span&gt;&lt;/p&gt;\n&lt;ul&gt;\n&lt;li style=&quot;font-weight: 500;&quot;&gt;&lt;strong&gt;Shape the Future:&lt;/strong&gt;&lt;span style=&quot;font-weight: 500;&quot;&gt; Improve lives through cutting-edge technology, work 100% remotely from anywhere in the world.&lt;/span&gt;&lt;/li&gt;\n&lt;li style=&quot;font-weight: 500;&quot;&gt;&lt;strong&gt;Great work-life balance:&lt;/strong&gt;&lt;span style=&quot;font-weight: 500;&quot;&gt; &lt;/span&gt;&lt;span style=&quot;font-weight: 500;&quot;&gt;Build amazing things with a balance of autonomy and collaborative teamwork. Set your own work schedule and make use of a flexible PTO plan when you need to recharge.&lt;/span&gt;&lt;span style=&quot;font-weight: 500;&quot;&gt;&amp;nbsp;&lt;/span&gt;&lt;/li&gt;\n&lt;li style=&quot;font-weight: 500;&quot;&gt;&lt;strong&gt;Expect Excellence:&lt;/strong&gt;&lt;span style=&quot;font-weight: 500;&quot;&gt; Collaborate, learn, and grow with a high-performance team. Learn&lt;/span&gt;&lt;span style=&quot;font-weight: 500;&quot;&gt; how you learn best - from books to conferences, you’ll get a yearly budget for your individual learning and development goals.&lt;/span&gt;&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;&lt;strong&gt;At Xapo, we prioritize consumer protection and adhere to regulatory requirements by ensuring that all Xapiens are accountable for upholding principles of fair treatment, transparency, and ethical conduct in their interactions with customers and stakeholders.&lt;/strong&gt;&lt;/p&gt;&lt;/div&gt;","tags":"[\"Finance\",\"management\"]","pubDate":"2024-06-18 14:38:01.000","link":"https://boards.greenhouse.io/xapo61/jobs/6028875003","savedDate":"2024-06-20 09:30:04.289","slug":"senior-account-manager-apac-remote-work-from-anywhere-xapo-bank-9868"},{"id":8361251782,"title":"Senior Software Engineer - CAO (Remote - Work from Anywhere)","company":"Xapo Bank","image":"https://s3-recruiting.cdn.greenhouse.io/external_greenhouse_job_boards/logos/400/530/000/resized/greyBackground.jpg?1692112526","description":"&lt;div class=&quot;content-intro&quot;&gt;&lt;p style=&quot;text-align: left;&quot;&gt;&lt;span style=&quot;font-weight: 900;&quot;&gt;Work from anywhere, impact everywhere&amp;nbsp;&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;Diversity is at the heart of who we are at Xapo Bank. We’re a fully distributed team of over 140 Xapiens that work remotely from 40+ countries around the world.&amp;nbsp;&lt;/p&gt;\n&lt;p&gt;Our beginning: A world that enjoys economic freedom and wealth protection, no matter where you live or who is running your country. This is the dream that drove Wences Casares, our Founder and Chairman, to quietly transform the world of banking.&lt;/p&gt;\n&lt;p&gt;To achieve that, we search the world for the best people for the job. We work hard, think globally, and inspire each other to learn and grow. We are committed to changing the way things are done.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Risk is inherent in all of our business activities and managing risk well is the responsibility of every Xapien. Sound risk management enables us to serve our customers and deliver value for our shareholders, and helps make Xapo a great place to work.&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&amp;nbsp;&lt;/p&gt;\n&lt;p style=&quot;text-align: left;&quot;&gt;&lt;em&gt;&lt;span style=&quot;font-weight: 500;&quot;&gt;Although we are headquartered in Gibraltar, this is a full time, 100% remote position&amp;nbsp;&lt;br&gt;&lt;/span&gt;&lt;/em&gt;&lt;em&gt;&lt;span style=&quot;font-weight: 500;&quot;&gt;Work from anywhere!&lt;/span&gt;&lt;/em&gt;&lt;/p&gt;\n&lt;p style=&quot;text-align: left;&quot;&gt;&amp;nbsp;&lt;/p&gt;&lt;/div&gt;&lt;p&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Position Overview:&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;We’re looking for a Senior Software Engineer to join our engineering function. At Xapo, we are building truly cross-functional teams with full ownership of design, architecture, building, testing, delivery, data, and operations.&lt;/p&gt;\n&lt;p&gt;You will collaborate closely with fellow team members from the product, apps, design, and QA communities of practice. You will be part of the product team (we call them SATs, the Stream Aligned Teams, as in the Team Topologies) in charge of the Onboarding, Marketing, and Customer Service aspects of Xapo products.&lt;/p&gt;\n&lt;p&gt;As a Senior Software Engineer, you will develop a high-impact service, provide guidance and coaching around technical good practices, and play an active, critical role in the Development Community of practice. You will shape architectural and technical patterns used in the company to solve the problems for operational teams, improve UX, and cause a WOW effect in the eyes of our Members. With that in mind, you will have an immense impact on how the future of finance looks.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Our main tech stack includes:&lt;/strong&gt;&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;AWS for all of our Infrastructure&lt;/li&gt;\n&lt;li&gt;Docker&lt;/li&gt;\n&lt;li&gt;Python (Django, Flask)&lt;/li&gt;\n&lt;li&gt;MySQL&lt;/li&gt;\n&lt;li&gt;MongoDB&lt;/li&gt;\n&lt;li&gt;Redis&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;We also use:&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;Cassandra&lt;/li&gt;\n&lt;li&gt;PostgreSQL&lt;/li&gt;\n&lt;li&gt;Node.js&lt;/li&gt;\n&lt;li&gt;Java&lt;/li&gt;\n&lt;li&gt;BigQuery&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;&lt;strong&gt;Responsibilities:&lt;/strong&gt;&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;Support, coach, and develop team members into top-performing engineers.&lt;/li&gt;\n&lt;li&gt;Work closely in cross-functional teams where everyone is responsible for the outcome.&lt;/li&gt;\n&lt;li&gt;Build a great place to work for talented and motivated people.&lt;/li&gt;\n&lt;li&gt;Design, develop, and deploy backend services focusing on high availability, fault tolerance, low latency, and security.&lt;/li&gt;\n&lt;li&gt;Take full end-to-end responsibility for the services your team owns, from development to production, operations, and data.&lt;/li&gt;\n&lt;li&gt;Develop innovative solutions with Bitcoin at its core.&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;&lt;strong&gt;Skills needed:&lt;/strong&gt;&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;Significant software engineering experience in one or more general-purpose programming languages (we use Python).&lt;/li&gt;\n&lt;li&gt;Excellent teamwork and communication skills, comfortable preparing high-quality documentation and designs to aid understanding and knowledge sharing.&lt;/li&gt;\n&lt;li&gt;Understanding of microservices architecture, container-based 12-factor apps, and cloud-native patterns around fault tolerance.&lt;/li&gt;\n&lt;li&gt;Track record of using Event Storming and Domain-Driven Design, delivering highly scalable asynchronous software.&lt;/li&gt;\n&lt;li&gt;Experience building contract-first services and adopting patterns and frameworks to enable appropriate automated testing at the unit, contract, service, and end-to-end levels.&lt;/li&gt;\n&lt;li&gt;Experience building services that can be deployed on demand, quickly, and with quality.&lt;/li&gt;\n&lt;li&gt;Excellent understanding of CI/CD patterns and good practices.&lt;/li&gt;\n&lt;li&gt;Understand the role of high-quality observability in building highly scalable and performant software.&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;&lt;strong&gt;Other requirements:&lt;/strong&gt;&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;A dedicated workspace.&lt;/li&gt;\n&lt;li&gt;A reliable internet connection with the fastest speed possible in your area.&lt;/li&gt;\n&lt;li&gt;Devices and other essential equipment that meet minimal technical specifications.&lt;/li&gt;\n&lt;li&gt;Alignment with Our Values and the Xapo Values-Driven Leadership principles.&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;&lt;/p&gt;&lt;div class=&quot;content-conclusion&quot;&gt;&lt;p&gt;&lt;span style=&quot;font-size: 12pt;&quot;&gt;&lt;strong&gt;Why work for Xapo?&lt;/strong&gt;&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span style=&quot;font-weight: 500; font-size: 10pt;&quot;&gt;IMPACT GLOBALLY, WORK REMOTELY.&lt;/span&gt;&lt;/p&gt;\n&lt;ul&gt;\n&lt;li style=&quot;font-weight: 500;&quot;&gt;&lt;strong&gt;Shape the Future:&lt;/strong&gt;&lt;span style=&quot;font-weight: 500;&quot;&gt; Improve lives through cutting-edge technology, work 100% remotely from anywhere in the world.&lt;/span&gt;&lt;/li&gt;\n&lt;li style=&quot;font-weight: 500;&quot;&gt;&lt;strong&gt;Great work-life balance:&lt;/strong&gt;&lt;span style=&quot;font-weight: 500;&quot;&gt; &lt;/span&gt;&lt;span style=&quot;font-weight: 500;&quot;&gt;Build amazing things with a balance of autonomy and collaborative teamwork. Set your own work schedule and make use of a flexible PTO plan when you need to recharge.&lt;/span&gt;&lt;span style=&quot;font-weight: 500;&quot;&gt;&amp;nbsp;&lt;/span&gt;&lt;/li&gt;\n&lt;li style=&quot;font-weight: 500;&quot;&gt;&lt;strong&gt;Expect Excellence:&lt;/strong&gt;&lt;span style=&quot;font-weight: 500;&quot;&gt; Collaborate, learn, and grow with a high-performance team. Learn&lt;/span&gt;&lt;span style=&quot;font-weight: 500;&quot;&gt; how you learn best - from books to conferences, you’ll get a yearly budget for your individual learning and development goals.&lt;/span&gt;&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;&lt;strong&gt;At Xapo, we prioritize consumer protection and adhere to regulatory requirements by ensuring that all Xapiens are accountable for upholding principles of fair treatment, transparency, and ethical conduct in their interactions with customers and stakeholders.&lt;/strong&gt;&lt;/p&gt;&lt;/div&gt;","tags":"[\"postgres\",\"Finance\",\"management\",\"engineering\",\"mysql\",\"mongo\",\"aws\"]","pubDate":"2024-06-18 11:36:58.000","link":"https://boards.greenhouse.io/xapo61/jobs/6028673003","savedDate":"2024-06-20 09:30:04.289","slug":"senior-software-engineer-cao-remote-work-from-anywhere-xapo-bank-7446"},{"id":4355069426,"title":"Senior Game Security Engineer","company":"Crytek","image":"https://lever-client-logos.s3-us-west-2.amazonaws.com/2a61cdfd-29d3-4707-b965-c4527aa67d0c-1593500521772.png","description":"<div><span style=\"font-size: 11pt\">Dealing with cheaters and ensuring a secure and fair environment in the online gaming sphere is a constant challenge, we are looking for an experienced Game Security Engineer to add to the Fair Play Task Force of Hunt: Showdown that will contribute to the research, technical implementation and monitoring of unfair activities, vulnerability discovery and game exploitation.</span></div><div><span style=\"font-size: 11pt\">&nbsp;</span></div><div><b>Introduction</b></div><div><span style=\"font-size: 11pt\">&nbsp;</span></div><div><span style=\"font-size: 11pt\">The ideal candidate will be working on:</span></div><div><span style=\"font-size: 11pt\">Client - research and development of additional features to prevent and actively detect unfair practices, as well as implementing additional in-house and third-party services to improve its security state.</span></div><div><span style=\"font-size: 11pt\">Server - Blocking game exploitation and implementing additional security services, ensuring the game server data is secure and uncompromised integrity; developing additional in-house security components to improve the entire ecosystem for correct detection and prevention, including performing vulnerability assessments on our infrastructure.</span></div><div><span style=\"font-size: 11pt\">&nbsp;</span></div><div><span style=\"font-size: 11pt\">Candidate will join the Fair Play Task Force team, working closely with the various Hunt: Showdown game development teams and involved in several steps from design to release of every initiative.</span></div><h3>Responsibilities </h3><li>Vulnerability assessments of the game ecosystem.</li><li>Research and implementation of additional security measures on top of the game ecosystem.</li><li>Ensure client &amp; server logic are secure, validated, and safe from exploitation followed by technical reports and documentation for the production and game security teams.</li><li>Self-manage programming tasks and report to key stakeholders for coordination with the inner production teams.</li><li>Own and maintain the documentation surrounding the research and implementation of the tasks the candidate is involved in.</li>,<h3>Requirements </h3><li>Solid C/C++ skills</li><li>Extended knowledge of the game development process</li><li>Autonomy and problem-solving attitude</li><li>Dynamic and static analysis (Reverse Engineering)</li><li>Fair understanding of memory manipulation and Windows Internals</li><li>At least 5 years of experience in a relevant role</li><li>Solid English skills and excellent communication</li>,<h3>Pluses</h3><li>Knowledge of obfuscation and LLVM practices</li><li>CryEngine experience</li><li>Direct experience with cheat development</li>","tags":"[\"engineering\"]","pubDate":"2024-06-18 10:38:18.639","link":"https://jobs.lever.co/crytek/48f6b7a6-84d6-4cad-aa74-86b2fd2b8645","savedDate":"2024-06-20 09:30:04.288","slug":"senior-game-security-engineer-crytek-6646"},{"id":4089915193,"title":"Staff Software Engineer (Remote) - Mexico","company":"Empower","image":"https://lever-client-logos.s3.us-west-2.amazonaws.com/2e1a369c-b58f-41ac-8d86-4b0a77695e68-1687915522032.png","description":"<div><b><span style=\"font-size: 24px\">EMPOWER OVERVIEW</span></b></div><div><br></div><div>Empower is a high-growth financial technology company on a mission to expand access to fair credit to give anyone in the world the opportunity to improve their financial security and mobility. We dream up and launch one-of-a-kind features that help our members get money instantly whenever they need it, save for the future, and rewrite their financial story. Our members see Empower Cash Advance as a life-saver, Empower Automatic Savings as a game-changer, and the new Empower Thrive line of credit as a lifeline to low-cost borrowing and the only practical path to building good credit.</div><div><br></div><div>Empower México is a new venture for the company. We offer small loans ranging from $150 to $2,000 MXN to help Mexican customers in a pinch, using non-traditional data to underwrite customers. </div><div><br></div><div>Empower is backed by Sequoia Capital, Blisce, and Icon Ventures. Are we the next great place to grow your impact and accelerate your career? We think so:</div><div><br></div><div>Inc. ranked Empower #56 in the 2023 Inc. 5000 list of the fastest-growing private companies in the US (#55 in 2022). Forbes put Empower on its 2023 list of America's Best Startup Employers. Fast Company recognized the new Empower Thrive line of credit in their 2022 list of the Next Big Things in Tech. </div><div><br></div><div><b><span style=\"font-size: 18px\">THE EMPOWER WAY</span></b></div><div><b>Great Expectations</b>: We come up with bold, audacious goals for ourselves and go all out for impact</div><div><b>Owner Mindset</b>: We give every employee latitude to act independently, make smart choices, and move the business forward</div><div><b>Spirited Debate</b>: We love skeptics and seek counter opinions to challenge our personal assumptions and expand our view</div><div><b>Customer Obsession: </b>We listen to understand, empathize, and create a memorable, rewarding experience for our community</div><div><b>Inclusive Collaboration</b>: We believe diverse teams make the best decisions, and we strive to give diverse voices a seat at the table</div><div>N<b>o Jerks Allowed</b>: We value our relationships and take the time to build trust and connection and communicate respectfully</div><div><b>&nbsp;</b></div><div><b>&nbsp;</b></div><div><b><span style=\"font-size: 18px\">WHAT EMPOWER OFFERS</span></b></div><div><br></div><div>Competitive salary</div><div>Generous equity package</div><div>Full healthcare and dental benefits</div><div>Technology&nbsp; expense reimbursement</div><div>Work&nbsp; from anywhere</div><div><br></div><div><b><span style=\"font-size: 18px\">JOB DESCRIPTION</span></b></div><div>As a Staff Backend Engineer for Empower Mexico,&nbsp; you will play a pivotal role in shaping the technical direction of our solutions. You will identify strategic technical needs, lead large-scale and complex product initiatives, and optimize our engineering processes. You will also take ownership of technological initiatives, from management and execution to solution design and progress reporting. In addition, you will serve as a lead interviewer, mentor other engineers, and lead incident responses. You will also own technical ORKs for the Mexico business, serving as the driving force to achieve them.</div><div><br></div><div>Your role will also involve designing, building, and deploying server application code, implementing secure coding standards, and meeting sprint goals. You will monitor the performance of our server application, participate in the server ops on-call schedule, and work towards minimizing defects and improving reliability.</div><div><br></div><div>This role has a high impact in creating and owning a full business solution that is reliable, available and scalable, that meets our customer’s critical loan needs. We are a .NET / Azure stack and are looking for .NET engineers with strong experience with Azure.</div><div><br></div><div>Travel for company offsites is expected at a minimum 2 times a year.</div><div>For US based employee's, this salary range includes several career levels of consideration and will be discussed further during the interview process. The salary range is based on a variety of factors such as candidate experience, qualifications, and business needs. The base pay range is subject to change and may be modified in the future. </div><h3>Key Responsibilities</h3><li>Identify opportunities to foster optimal product direction, collaborate closely with business stakeholders to streamline and simplify designs, and proactively identify areas of risk and tradeoffs that can be enhanced.</li><li>Interfacing the financial business system into the customer facing Empower México Android app and internal “Back of House” support portal</li><li>Integrating with 3rd party services</li><li>Ownership of technical initiatives, being accountable for the initiative's outcome, managing and executing the project, designing the solution and defining its requirements, reporting on the initiative's progress, and coordinating resources.</li><li>Perform as a lead technical interviewer</li><li>Lead technical reviewer of Empower Engineering blog posts</li><li>Mentor Engineers up to and including Senior levels</li><li>Lead SEV1 and lower incident response through to resolution</li><li>Lead engineering of&nbsp; large scale and complex product initiatives</li><li>Culture leader across the engineering organization, delivery team and platform team</li>,<h3>Candidate Qualifications</h3><li>Minimum 10 years, ideally 15+ years developing web APIs within .NET (C#)</li><li>Working experience with ORMs such as Entity Framework</li><li>Working experience constructing and optimising RDMS queries</li><li>Working experience within the asynchronous programming model</li><li>Working experience with Azure solutions systems like Azure Functions and Azure Blob storage, and working knowledge of common .NET libraries like MediatR and Xunit for testing</li><li>General knowledge of Messaging Queues eg. AMQP</li><li>General knowledge of PaaS environments eg. Azure</li><div><br></div>,<h3>Preferred Qualifications</h3><li>Worked on a “zero to one” project taking a business from an idea to a profitable venture</li><li>Experience scaling a solution from tens of thousands to millions of customers (Scaling databases, queues, caching, monitoring and security with Azure)</li><li>Contributed to and/or owned a large, complex, critical banking or lending solution</li><div>At Empower, we hire for people that push themselves to understand others and seek out ways to challenge their personal assumptions. Our hope is that by fostering such an environment, we strengthen our business and relationships by putting people first. We are committed to building a diverse, inclusive, and equitable workspace where everyone (regardless of age, education, ethnicity, gender, sexual orientation, or any personal characteristics) feels like they belong. Even if your experience doesn’t exactly match up to our job description, you should feel empowered to apply regardless!&nbsp;</div>","tags":"[\"management\",\"engineering\",\"database\"]","pubDate":"2024-06-17 22:52:43.018","link":"https://jobs.lever.co/empower.me/e6e53b71-6824-4f11-bc34-d2b059b91c8b","savedDate":"2024-06-20 09:30:04.285","slug":"staff-software-engineer-remote-mexico-empower-7818"},{"id":3010276391,"title":"Senior Full-Stack TypeScript Developer (E)","company":"Blue Coding","image":"https://lever-client-logos.s3.us-west-2.amazonaws.com/3c1d9ac7-6738-46c5-b6ca-a35fa2a0df57-1666278594128.png","description":"<div><i style=\"font-size: 18px\">Do you want to earn a salary in USD?&nbsp;</i></div><div><i style=\"font-size: 18px\">Would you like to work from wherever you want?</i></div><div><i style=\"font-size: 18px\">Would you like to be a part of the leading next-gen software developers?&nbsp;</i></div><div><br></div><div><b style=\"font-size: 24px\">Hi, you finally found us!</b><span style=\"font-size: 24px\">&nbsp;</span></div><div><br></div><div><b style=\"font-size: 24px\">Why work at Blue Coding?</b><span style=\"font-size: 24px\">&nbsp;</span></div><div><br></div><div>At Blue Coding we specialize in hiring excellent developers and amazing people from all over Latin America and other parts of the world. For the past 9 years, we’ve helped cutting-edge companies in the United States and Canada -both large and small, build great development teams and develop great products. Online shops, digital agencies, SaaS providers, and software consulting firms are a few of our clients. Our team of over 100 engineers is distributed in more than 10 countries across the Americas. We are a fully remote company working with a wide array of technologies and have expertise in every stage of the software development process.&nbsp;&nbsp;</div><div><br></div><div>Our team is highly connected, united, and culturally diverse, and our collaborators are involved in many initiatives around the world, from wildlife preservation to volunteering at local charities. We also participate in group activities like movie nights, trivia, and meme competitions. We stand for honesty, fairness, respect, efficiency, hard work, and cooperation.</div><div><br></div><div><b style=\"font-size: 18px\">What are we looking for?</b></div><div><br></div><div>In this opportunity, we are looking for a Senior Full-Stack TypeScript Developer to work with one of our foreign clients, who works in Ad Tech with an in-house advertising and marketing agency pushing the limits of advertising performance. The company uses its unique combination of marketing strategies and proprietary technologies to target users using mobile and internet-connected device-matching technology. You'll work on managing and developing the client's APIs and front-end applications using Keystone, Prisma, React, and NextJS. The ideal candidate has experience with multiple data providers and understands the complexities of working within a cloud-based, micro-services architecture.</div><div><br></div><h3>Here are some of the exciting day-to-day challenges you will face in this role:</h3><li>Develop and manage data schemas, authentication, and runtime processing of requests to our GraphQL APIs using Keystone.</li><li>Handle multiple Keystone and Prisma instances within the same project.</li><li>Build and maintain user interfaces with React.</li><li>Implement and manage micro-services using NextJS.</li><li>Work with various data providers including Azure SQL, Azure Serverless Synapse, Azure Blob Storage, and Azure Flexible PostgreSQL.</li><li>Write scalable and maintainable code in TypeScript.</li><li>Guide less experienced developers and help them improve their skills.</li>,<h3>You will shine if you have:</h3><li>Proficiency in TypeScript.</li><li>Experience with Keystone and Prisma.</li><li>Strong knowledge of React and NextJS.</li><li>Familiarity with Azure data services (SQL, Serverless Synapse, Blob Storage, Flexible PostgreSQL).</li><li>Understanding of micro-services architecture and cloud-based services.</li><li>Ability to manage multiple Keystone and Prisma instances within a single project.</li><li>Awareness of clustering and horizontal scaling impacts development, particularly within an AKS cluster.</li>,<h3>It doesn't hurt if you also have:</h3><li>Experience with Azure Kubernetes Services (AKS).</li><li>Familiarity with third-party data providers.</li><div><b style=\"font-size: 24px\">Hey, you are still here!</b><span style=\"font-size: 24px\">&nbsp;</span></div><div><br></div><div>So, let us ask a few questions. Do you like working in a friendly environment? Are you fluent in English? Do you have a strong work ethic, are detail-oriented and have an ownership mentality? And most importantly do you love music and puppies? If so, then what are you waiting for? Come join our team and become part of this awesome company! We will be expecting you.</div>","tags":"[\"postgres\",\"typescript\"]","pubDate":"2024-06-17 20:40:29.788","link":"https://jobs.lever.co/bluecoding/a931134c-a5e4-476b-9ada-2e602f7d32f2","savedDate":"2024-06-20 09:30:04.287","slug":"senior-full-stack-typescript-developer-e-blue-coding-600"},{"id":9158780676,"title":"Customer Success Advisor","company":"Xapo Bank","image":"https://s3-recruiting.cdn.greenhouse.io/external_greenhouse_job_boards/logos/400/530/000/resized/greyBackground.jpg?1692112526","description":"&lt;div class=&quot;content-intro&quot;&gt;&lt;p style=&quot;text-align: left;&quot;&gt;&lt;span style=&quot;font-weight: 900;&quot;&gt;Work from anywhere, impact everywhere&amp;nbsp;&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;Diversity is at the heart of who we are at Xapo Bank. We’re a fully distributed team of over 140 Xapiens that work remotely from 40+ countries around the world.&amp;nbsp;&lt;/p&gt;\n&lt;p&gt;Our beginning: A world that enjoys economic freedom and wealth protection, no matter where you live or who is running your country. This is the dream that drove Wences Casares, our Founder and Chairman, to quietly transform the world of banking.&lt;/p&gt;\n&lt;p&gt;To achieve that, we search the world for the best people for the job. We work hard, think globally, and inspire each other to learn and grow. We are committed to changing the way things are done.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Risk is inherent in all of our business activities and managing risk well is the responsibility of every Xapien. Sound risk management enables us to serve our customers and deliver value for our shareholders, and helps make Xapo a great place to work.&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&amp;nbsp;&lt;/p&gt;\n&lt;p style=&quot;text-align: left;&quot;&gt;&lt;em&gt;&lt;span style=&quot;font-weight: 500;&quot;&gt;Although we are headquartered in Gibraltar, this is a full time, 100% remote position&amp;nbsp;&lt;br&gt;&lt;/span&gt;&lt;/em&gt;&lt;em&gt;&lt;span style=&quot;font-weight: 500;&quot;&gt;Work from anywhere!&lt;/span&gt;&lt;/em&gt;&lt;/p&gt;\n&lt;p style=&quot;text-align: left;&quot;&gt;&amp;nbsp;&lt;/p&gt;&lt;/div&gt;&lt;p&gt;&lt;strong&gt;&lt;em&gt;Position overview&lt;/em&gt;&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;The Customer Success team works closely with the Product, Tech and Compliance teams, understanding the challenges experienced by customers to ensure we provide accurate and timely responses to their questions. The team also works towards a common goal of conversion optimization and customer growth.&amp;nbsp;&lt;/p&gt;\n&lt;p&gt;Customer Success Advisors, report into the Customer Success Team Lead, and form an integral part of the Customer Success team will be responsible for providing constant support across different channels to our customers. They ensure that our customers enjoy seamless support during the onboarding process and throughout their journey with us - creating a “customer for life” experience. As our products and services cover multiple regions across the globe, the aim is to provide our customers with a standard of service that is world class.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;&lt;em&gt;Role objectives&lt;/em&gt;&lt;/strong&gt;&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;Represent the company to our customer effectively by developing comprehensive knowledge of its offerings&lt;/li&gt;\n&lt;li&gt;Maximise conversions and customer base growth through building strong relationships with customer and an awareness of their needs&lt;/li&gt;\n&lt;li&gt;Achieve daily, weekly and monthly KPIs&lt;/li&gt;\n&lt;li&gt;Conduct incisive and insightful research of markets and competitors&lt;/li&gt;\n&lt;li&gt;Ensure customers&#39; pain points are addressed to the right team and solved asap&lt;/li&gt;\n&lt;li&gt;Take all measures, go above and beyond, to ensure customers needs are met whether this is through the onboarding process or when they have become a member&lt;/li&gt;\n&lt;li&gt;Accumulate feedback from the clients and share product improvement ideas&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;&lt;strong&gt;&lt;em&gt;KPIs/Targets&lt;/em&gt;&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;As a Customer Success Advisor, your role will include daily/weekly/monthly targets set by your Manager and in alignment with the overall customer conversion strategy.&amp;nbsp;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;&lt;em&gt;Responsibilities&lt;/em&gt;&lt;/strong&gt;&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;Service will extend across all channels including our in-app live chat, phone, email, and video call.&lt;/li&gt;\n&lt;li&gt;Develop and maintain thorough knowledge of the company and all&amp;nbsp; its products.&lt;/li&gt;\n&lt;li&gt;Efficient at following and creating procedures.&amp;nbsp;&lt;/li&gt;\n&lt;li&gt;Proactively approach clients, using outside-the-box thinking to develop new and unique sales tactics&lt;/li&gt;\n&lt;li&gt;Work with Account Managers to design industry-specific outreach efforts&lt;/li&gt;\n&lt;li&gt;Conduct month-end and year-end close processes&lt;/li&gt;\n&lt;li&gt;Provide our customers with a world-class experience&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;&lt;strong&gt;&lt;em&gt;Skills needed&lt;/em&gt;&lt;/strong&gt;&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;Strong communication skills in both verbal and written form, English being the business language of choice.&amp;nbsp; In addition, Mandarin is a non-negotiable requirement to be able to support our customers in parts of Asia&lt;/li&gt;\n&lt;li&gt;Bachelor’s degree or equivalent&lt;/li&gt;\n&lt;li&gt;Strong customer facing experience in either crypto or traditional banking&lt;/li&gt;\n&lt;li&gt;Ability to translate complex/technical issues into easy to understand language for clients&lt;/li&gt;\n&lt;li&gt;Strong attention to detail and analytical skills&lt;/li&gt;\n&lt;li&gt;Empathy and a passion for delivering excellent service to customers&lt;/li&gt;\n&lt;li&gt;Driven, self-motivated, collaborative and highly flexible team player approach&lt;/li&gt;\n&lt;li&gt;Self-learner, and an avid problem-solver&lt;/li&gt;\n&lt;li&gt;Ability to effectively prioritize and execute tasks in a high-pressure environment&lt;/li&gt;\n&lt;li&gt;Technical experience supporting customer support systems or specialized applications like Kustomer is a plus&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;&lt;strong&gt;&lt;em&gt;Other requirements&lt;/em&gt;&lt;/strong&gt;&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;A dedicated workspace.&lt;/li&gt;\n&lt;li&gt;A reliable internet connection with the fastest speed possible in your area.&lt;/li&gt;\n&lt;li&gt;Devices and other essential equipment that meet minimal technical specifications.&lt;/li&gt;\n&lt;li&gt;Alignment with Our Values and the Xapo Values-Driven Leadership principles.&lt;/li&gt;\n&lt;/ul&gt;&lt;div class=&quot;content-conclusion&quot;&gt;&lt;p&gt;&lt;span style=&quot;font-size: 12pt;&quot;&gt;&lt;strong&gt;Why work for Xapo?&lt;/strong&gt;&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span style=&quot;font-weight: 500; font-size: 10pt;&quot;&gt;IMPACT GLOBALLY, WORK REMOTELY.&lt;/span&gt;&lt;/p&gt;\n&lt;ul&gt;\n&lt;li style=&quot;font-weight: 500;&quot;&gt;&lt;strong&gt;Shape the Future:&lt;/strong&gt;&lt;span style=&quot;font-weight: 500;&quot;&gt; Improve lives through cutting-edge technology, work 100% remotely from anywhere in the world.&lt;/span&gt;&lt;/li&gt;\n&lt;li style=&quot;font-weight: 500;&quot;&gt;&lt;strong&gt;Great work-life balance:&lt;/strong&gt;&lt;span style=&quot;font-weight: 500;&quot;&gt; &lt;/span&gt;&lt;span style=&quot;font-weight: 500;&quot;&gt;Build amazing things with a balance of autonomy and collaborative teamwork. Set your own work schedule and make use of a flexible PTO plan when you need to recharge.&lt;/span&gt;&lt;span style=&quot;font-weight: 500;&quot;&gt;&amp;nbsp;&lt;/span&gt;&lt;/li&gt;\n&lt;li style=&quot;font-weight: 500;&quot;&gt;&lt;strong&gt;Expect Excellence:&lt;/strong&gt;&lt;span style=&quot;font-weight: 500;&quot;&gt; Collaborate, learn, and grow with a high-performance team. Learn&lt;/span&gt;&lt;span style=&quot;font-weight: 500;&quot;&gt; how you learn best - from books to conferences, you’ll get a yearly budget for your individual learning and development goals.&lt;/span&gt;&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;&lt;strong&gt;At Xapo, we prioritize consumer protection and adhere to regulatory requirements by ensuring that all Xapiens are accountable for upholding principles of fair treatment, transparency, and ethical conduct in their interactions with customers and stakeholders.&lt;/strong&gt;&lt;/p&gt;&lt;/div&gt;","tags":"[\"management\"]","pubDate":"2024-06-17 07:48:16.000","link":"https://boards.greenhouse.io/xapo61/jobs/5926127003","savedDate":"2024-06-20 09:30:04.288","slug":"customer-success-advisor-xapo-bank-1026"},{"id":3724847861,"title":"Senior Frontend Web Application Developer","company":"KoboToolbox","image":"https://remotive.com/job/1919346/logo","description":"<p><strong>Location:</strong> Remote<br><strong>Availability:</strong> 35-40 hours per week<br><strong>Working hours:</strong> US East business hours<br><strong>Reporting to:</strong> Lead developer</p>\n<p><a href=\"http://www.kobotoolbox.org/\" rel=\"nofollow\">KoboToolbox</a> has an immediate opening for a Senior Frontend Web Application Developer to fill a full-time position of approximately 35-40 hours per week, ideally for a commitment of at least 1 year. As a member of our team, you will share in the challenge and excitement of writing code used by over 14,000 nonprofit organizations around the world. These organizations create data-driven change through the collection and analysis of more than 20 million surveys per month.</p>\n<p>Only senior candidates who already have experience working on large web applications will be considered. Beyond technical acumen, we are seeking a team member who demonstrates curiosity, initiative, and a cooperative approach to problem solving and decision-making.</p>\n<p>If you're passionate about leveraging technology to make a positive impact, we want to hear from you!</p>\n<p>Responsibilities</p>\n<ul style=\"\">\n<li style=\"\">Searching and reading the extensive, long-lived code base to understand existing behavior and conventions.</li>\n<li style=\"\">Evolving these conventions, without dogmatism, toward contemporary best practices that are appropriate for our project.</li>\n<li style=\"\">Formulating plans to implement new conventions incrementally into the existing code base.</li>\n<li style=\"\">Mentoring other developers, guiding them to follow these conventions, and encouraging their professional growth.</li>\n<li style=\"\">Writing robust, concise, and reusable code with accompanying tests and documentation.</li>\n<li style=\"\">Reviewing other developers' code and providing constructive feedback.</li>\n<li style=\"\">Distilling requests from the humanitarian community into technically detailed feature requests (and bug reports).</li>\n<li style=\"\">Scoping, prioritizing, estimating, and organizing work into manageably-sized tasks.</li>\n<li style=\"\">Attending regular videoconference check-ins with other members of the technical team.</li>\n<li style=\"\">Communicating with the public in conjunction with our support staff or directly through forums, issue trackers, etc.</li>\n<li style=\"\">Shaping the design and architecture of the overall tool suite collaboratively with the larger team.</li>\n<li style=\"\">Performing other related duties as directed by the lead developer.</li>\n</ul>\n<p><br><br><strong>Requirements</strong><br><br>Required Qualifications</p>\n<ul style=\"\">\n<li style=\"\">Experience writing, deploying, and maintaining client-side code for real-world, API-driven single-page applications.</li>\n<li style=\"\">Thorough understanding of TypeScript, React, and related technologies, including styling, state management, and efficient data exchange over HTTP.</li>\n<li style=\"\">Unflinching ability to work with legacy technologies such as Backbone and CoffeeScript.</li>\n<li style=\"\">Recent experience giving and receiving code reviews.</li>\n<li style=\"\">Interest in data collection (surveying), particularly in humanitarian emergencies and other challenging contexts, and a desire to improve our platform for our users.</li>\n<li style=\"\">Proficiency with spoken and written English.</li>\n<li style=\"\">Fluency with Git.</li>\n<li style=\"\">Overlap with working hours in the Eastern time zone.</li>\n<li style=\"\">Average availability of <em>at least</em> 30 hours per week, preferably 35 hours or more.</li>\n</ul>\n<p>Preferred Qualifications</p>\n<p>Experience with the following is preferred but not required to apply:</p>\n<ul style=\"\">\n<li style=\"\">Serving as the leader of a technical team.</li>\n<li style=\"\">Using Docker and Docker Compose in a development environment.</li>\n<li style=\"\">Programming in Python, ideally with Django (and particularly Django REST Framework).</li>\n<li style=\"\">Optimizing queries for relational and document-oriented databases.</li>\n<li style=\"\">Surveying with XLSForm, ODK XForm, and OpenRosa.</li>\n<li style=\"\">Integrating with Stripe for payment processing.</li>\n</ul>\n<p><br><br><strong>Benefits</strong><br><br></p>\n<ul style=\"\">\n<li style=\"\">Genuine Impact: Contribute directly to projects that impact millions of people around the world globally, working alongside the largest international humanitarian organizations as well as thousands of national and small community based partners in 200 countries.</li>\n<li style=\"\">Meaningful Work Environment: Join a team that believes work should be meaningful as well as fun, tackling global challenges through innovative data collection and management tools with a proven impact for lasting change.</li>\n<li style=\"\">Diverse Team: Be part of an amazing, progressive, and globally diverse team that values diversity, equity, and inclusion across all spectrums.</li>\n<li style=\"\">Flexible Work Culture: Enjoy mutual flexibility, and the option for a 4-day workweek, supported by a culture that prioritizes work-life balance.</li>\n<li style=\"\">Professional Development: Benefit from generous professional development options.</li>\n</ul>\n<img src=\"https://remotive.com/job/track/1919346/blank.gif?source=public_api\" alt=\"\"/>","tags":"[\"api\",\"django\",\"docker\",\"frontend\",\"git\",\"python\",\"react\",\"documentation\",\"mentoring\",\"Typescript \",\"nonprofit\",\"backbone\",\"diversity\",\"REST\"]","pubDate":"2024-06-17 06:55:11.000","link":"https://remotive.com/remote-jobs/software-dev/senior-frontend-web-application-developer-1919346","savedDate":"2024-06-20 09:30:04.281","slug":"senior-frontend-web-application-developer-kobotoolbox-3515"}]