[{"id":6413992113,"title":"Director, Enterprise Technical Advisory (Post-Sales Customer Success) [M4]","company":"Sourcegraph","image":"https://pbs.twimg.com/profile_images/1428393724527190022/4mt5PACL_400x400.png","description":"\n    <div class=\"content-intro\"><h3>ALL SOURCEGRAPH ROLES ARE FULLY REMOTE</h3>\n<h2><strong><span style=\"color: #a112ff;\">Who we are</span></strong></h2>\n<p>Our mission at Sourcegraph is to make it so that&nbsp;<a class=\"c-link\" href=\"https://sourcegraph.notion.site/Mission-values-e9d37e6b972a4ef395c3076aea2bd07d\" target=\"_blank\" data-stringify-link=\"https://handbook.sourcegraph.com/strategy-goals/strategy\" data-sk=\"tooltip_parent\">everyone can code</a>, not just ~0.1% of the population. Our code graph powers Cody, the most powerful and accurate AI coding assistant, as well as our Code Search product, which helps devs explore their entire codebase and make large-scale migrations and security fixes. We’re building software that builds software, and in doing so we’re making devs more productive and preparing for a world where a lot more code gets written.</p>\n<p>It’s an exciting time to join Sourcegraph. AI has taken over the world, and we’ve spent the last 10 years building infrastructure that’s integral to making AI generated code more powerful and accurate. Our customers include 4/5 FAANG companies, 4 of the top 10 banks, government organizations, Uber, Plaid, and many other companies building the software that pushes the world forward. We’ve raised $225M at a $2.625B valuation from <a class=\"c-link\" href=\"https://techcrunch.com/2021/07/13/sourcegraph-raises-125m-series-d-on-2-6b-valuation-for-universal-code-search-tool/\" target=\"_blank\" data-stringify-link=\"https://techcrunch.com/2021/07/13/sourcegraph-raises-125m-series-d-on-2-6b-valuation-for-universal-code-search-tool/\" data-sk=\"tooltip_parent\">a16z</a>,&nbsp;<a class=\"c-link\" href=\"https://sourcegraph.com/blog/series-c-with-sequoia/\" target=\"_blank\" data-stringify-link=\"https://about.sourcegraph.com/blog/series-c-with-sequoia/\" data-sk=\"tooltip_parent\">Sequoia</a>,&nbsp;<a class=\"c-link\" href=\"https://www.redpoint.com/companies/sourcegraph/\" target=\"_blank\" data-stringify-link=\"https://www.redpoint.com/companies/sourcegraph/\" data-sk=\"tooltip_parent\">Redpoint</a>,&nbsp;<a class=\"c-link\" href=\"https://medium.com/craft-ventures/why-we-invested-in-sourcegraph-5ace28317e3d\" target=\"_blank\" data-stringify-link=\"https://medium.com/craft-ventures/why-we-invested-in-sourcegraph-5ace28317e3d\" data-sk=\"tooltip_parent\">Craft</a>&nbsp;and others. We’re making ambitious bets on our future and we’re looking to hire exceptional people to join our team as we make Sourcegraph one of the biggest and most influential companies in the world.</p></div>\n\n    <h2><span style=\"color: rgb(140, 51, 236);\"><strong>Working hours</strong></span></h2>\n<p>🌎 While we are an all-remote company and hire <a href=\"https://handbook.sourcegraph.com/departments/people-ops/process/how-we-engage-talent-outside-the-us/\">almost anywhere</a> in the world, we have a preference for someone to reside in the following locations for this role. However, if you feel qualified, we welcome you to apply regardless of location. No matter what, working hours must overlap with PST for at least 32 hours/week.</p>\n<p><strong>Preferred locations:</strong></p>\n<ul>\n<li>Remote - United States - Denver, CO or San Francisco, CA</li>\n</ul>\n<h2><span style=\"color: rgb(140, 51, 236);\"><strong>Why this job is exciting</strong></span></h2>\n<p>As Director, Enterprise Technical Advisory, you’ll lead our exceptional team of Enterprise Technical Advisors (our post-sales customer success team) focused on customer onboarding and adoption &amp; nurture that leads to retention and expansion. This role reports into the VP of Technical Success. This role will balance operational, programmatic, strategic, and planning responsibilities in support of our customers and the overall business.</p>\n<p>In this role, you will:</p>\n<ol>\n<li>Lead a globally distributed team of Enterprise Technical Advisors - serving as both a coach and career mentor</li>\n<li>Help formulate the overall strategy of post-sales success at Sourcegraph, including building the Enterprise customer journey focused on how we deliver value to customers by understanding customer outcomes, business challenges, and key KPIs</li>\n<li>Create programs that drive product adoption, education, and usage in order to deliver meaningful business outcomes</li>\n<li>Formulate strategies for your team to grow revenue within existing customers by demonstrating value and generating positive results from success plans</li>\n<li>Represent the voice of the customer by identifying themes, trends, and needs across our customers and advocating for change internally with Engineering and Product</li>\n</ol>\n<p>📅 Within one month, you will…</p>\n<ul>\n<li>Go through a multi-week onboarding process including training on our product, our value propositions, our customers, our team, and our processes.</li>\n<li>Meet our Technical Advisory team and begin the process of forging a long standing partnership with each of them.</li>\n<li>Learn about how we discover relevant use cases, map those to key product capabilities and demonstrate the value of Sourcegraph to customers.</li>\n<li>Dive deep into our existing customer experience - processes, tools, and templates.</li>\n<li>Build relationships with Regional Sales Directors (RSDs) and Account Executives (AEs)</li>\n<li>Meet other internal organization leads from EPD and begin establishing working relationships.</li>\n</ul>\n<p>📅 Within two months, you will…</p>\n<ul>\n<li>Take over direct front-line management of the existing team, which includes:</li>\n<li>Based on your observations thus far, make recommendations to leadership for improvement or the stand up of new processes, tools, templates, etc.</li>\n<li>Participate directly in Customer Business Reviews (CBRs) and formulate direct relationships with customers as a champion and advocate internally</li>\n</ul>\n<p>📅 Within three months &amp; beyond, you will…</p>\n<ul>\n<li>Place your unique stamp on Sourcegraph by capturing and sharing the innovative approaches you and your team come up with and driving those through the rest of the organization.</li>\n<li>Take ownership of and execute the processes that will enable us to innovate and scale the TA function at Sourcegraph.</li>\n<li>Develop and grow the TA team by cultivating a first class team, culture, process, and results. Results can be seen in Sourcegraph growth (revenue and adoption) and customer happiness.</li>\n</ul>\n<h2><span style=\"color: rgb(140, 51, 236);\"><strong>About you</strong></span></h2>\n<p>You are an experienced, hands-on, collaborative, people-driven leader who has the skills to effectively drive progress toward our organization’s ambitious and technically challenging objectives. You build strong relationships with your team and peers alike and are a solid communicator. You are strongly aligned with our values and inspired by our mission to make it so that everyone codes.</p>\n<p>If you are passionate about technical customer success, then this role might be a perfect mutual match.</p>\n<p>Your skillset:</p>\n<ul>\n<li>Minimum 5 years experience leading post-sales Customer Success teams in a recurring-revenue SaaS environment where you had retention / expansion targets</li>\n<li>Proven experience leading teams creating and implementing playbooks and strategies such as adoption and onboarding, champion building and nurture, customer health saves, and expansion programs</li>\n<li>As a leader are able to coach, influence, develop, motivate and empower employees to achieve their best; acts as a servant leader and collaborator with your team</li>\n<li>Direct experience leading a team that works with a technical product (dev tooling or adjacent) and buyer (developers up to VP of Eng)</li>\n<li>Ideal location is either San Francisco or Denver</li>\n</ul>\n<h2><span style=\"color: rgb(140, 51, 236);\"><strong>Level</strong></span></h2>\n<p>📊 This job is an M4.&nbsp; You can read more about <a href=\"https://handbook.sourcegraph.com/benefits-pay-perks/pay-expenses/compensation/leveling-guide/\">our job leveling philosophy</a> in our Handbook.</p>\n<h2><span style=\"color: rgb(140, 51, 236);\"><strong>Compensation</strong></span></h2>\n<p><strong>💸 We pay you an above-average salary</strong> because we want to hire the best people who are fully focused on helping Sourcegraph succeed, not worried about paying bills. As an <a href=\"https://handbook.sourcegraph.com/company-info-and-process/values/#sts=Open%20and%20transparent\">open and transparent</a> company that values competitive compensation, our <a href=\"https://handbook.sourcegraph.com/benefits-pay-perks/pay-expenses/compensation/\">compensation ranges are visible</a> to every single Sourcegraph teammate. To determine your salary, we use a number of market and data-driven salary sources, along with your location zone, and target the high-end of the range to ensure we’re always paying above market regardless of where you live in the world.&nbsp;&nbsp;</p>\n<p>💰 If base + variable only, insert: The target compensation for this role is $184,000 USD base + $46,000 USD variable ($230,000 USD on-target-earnings).&nbsp;</p>\n<p>📈 In addition to our cash compensation, we offer equity (because when we succeed as a company, we want you to succeed, too) and generous <a href=\"https://handbook.sourcegraph.com/benefits-pay-perks/benefits-perks/\">perks &amp; benefits</a>.</p>\n<h2><span style=\"color: rgb(140, 51, 236);\"><strong>Interview process</strong></span></h2>\n<p><em>Below is the interview process you can expect for this role (you can read more about </em><a href=\"https://handbook.sourcegraph.com/talent/types_of_interviews\"><em>the types of interviews</em></a><em> in our Handbook). It may look like a lot of steps, but rest assured that we move quickly and the steps are designed to help you get the information needed to determine if we’re the right fit for you… Interviewing is a two-way street, after all!&nbsp;</em></p>\n<p>We expect the interview process to take 5 hours in total.&nbsp;<br><br></p>\n<p><strong>👋 Introduction Stage</strong> - we have initial conversations to get to know you better…</p>\n<ul>\n<li>[30m]&nbsp;<a href=\"https://handbook.sourcegraph.com/departments/people-talent/talent/process/types_of_interviews/#recruiter-screen\">Recruiter Screen</a> - Kelsey Nagel</li>\n<li>[45m]&nbsp;<a href=\"https://handbook.sourcegraph.com/departments/people-talent/talent/process/types_of_interviews/#hiring-manager-screen\">Hiring Manager Screen</a> - Aimee Menne</li>\n</ul>\n<p><strong>🧑‍💻 Team Interview Stage</strong> - we then delve into your experience in more depth and introduce you to members of the team, including cross-functional partners…</p>\n<ul>\n<li>[30m] Cross-functional Peer Collaboration - Brock Perko or Connor O'Brien</li>\n<li>[45m]&nbsp;<a href=\"https://handbook.sourcegraph.com/departments/people-talent/talent/process/types_of_interviews/#resume-deep-dive\">Resume Deep Dive</a> - Aimee Menne</li>\n<li>[45m] Leadership Interview with two direct reports</li>\n<li>[45m] Working Session - Aimee Menne + another peer leader</li>\n</ul>\n<p><strong>🎉 Final Interview Stage </strong>- we move you to our final round, where you gain a better understanding of our business and values holistically…</p>\n<ul>\n<li>[30m] <a href=\"https://handbook.sourcegraph.com/departments/people-talent/talent/process/types_of_interviews/#values-interview\">Values Interview</a></li>\n<li>[30m]&nbsp;<a href=\"https://handbook.sourcegraph.com/departments/people-talent/talent/process/types_of_interviews/#leadership-interview\">Leadership Interview</a> with co-founder&nbsp;</li>\n<li>We check references and conduct your background check</li>\n</ul>\n<p>Please note - you are welcome to request additional conversations with anyone you would like to meet, but didn’t get to meet during the interview process.</p>\n\n    \n\n    <div class=\"content-conclusion\"><h2><strong><span style=\"color: #a112ff;\">Not sure if this is you?</span></strong></h2>\n<p><span style=\"font-weight: 400;\">We want a diverse, global team, with a broad range of experience and perspectives. If this job sounds great, but you’re not sure if you qualify, apply anyway! We carefully consider every application, and will either move forward with you, find another team that might be a better fit, keep in touch for future opportunities, or thank you for your time.</span></p>\n<h2><strong><span style=\"color: #a112ff;\">Learn more about us</span></strong></h2>\n<p><span style=\"font-weight: 400;\">To create a product that serves the needs of all developers, we are building a diverse </span><a href=\"https://sourcegraph.notion.site/All-remote-guidelines-4d1270d806294bf4ae6db7ab02911957\"><span style=\"font-weight: 400;\">all-remote team</span></a><span style=\"font-weight: 400;\"> that is </span><a href=\"https://www.notion.so/sourcegraph/7ed54d4ec4624475a4b45619901236d7?v=e06d936c673f46ca8c313a557bd4410f\"><span style=\"font-weight: 400;\">distributed across the world</span></a><span style=\"font-weight: 400;\">. Sourcegraph is an equal opportunity workplace; we welcome people from all backgrounds and communities.&nbsp;</span></p>\n<p><span style=\"font-weight: 400;\">We provide </span><a href=\"https://sourcegraph.notion.site/Compensation-Pay-Transparency-at-Sourcegraph-d58d0774f51b4b489d41c3628d30ff8d?pvs=74\"><span style=\"font-weight: 400;\">competitive compensation</span></a><span style=\"font-weight: 400;\"> and </span><a href=\"https://sourcegraph.notion.site/Benefits-Perks-dd1da4b6b3a64780abed010a144d34ba?pvs=74\"><span style=\"font-weight: 400;\">practical benefits</span></a><span style=\"font-weight: 400;\"> to keep you happy and healthy so that you can do your best work.&nbsp;</span><span style=\"font-weight: 400;\">&nbsp;</span></p>\n<p><span style=\"font-weight: 400;\">Learn more about what it is like to work at Sourcegraph by reading </span><a href=\"https://sourcegraph.notion.site/d7614e3e9dc04c09ac2d42d57f1816e6?v=2a6d426dbae14390b155120b0c029ce0\"><span style=\"font-weight: 400;\">our handbook</span></a><span style=\"font-weight: 400;\">.</span></p>\n<p><span style=\"font-weight: 400;\">We want to ensure Sourcegraph is an environment that suits your working style and empowers you to do your best work, so we are eager to answer any questions that you have about us at any point in the interview process.</span></p>\n<p><span style=\"font-weight: 400;\">Go back to the </span><a href=\"https://about.sourcegraph.com/jobs/\"><span style=\"font-weight: 400;\">careers page</span></a><span style=\"font-weight: 400;\"> for all open positions.</span></p>\n<p>&nbsp;</p>\n<p><em><span style=\"font-weight: 400;\">Sourcegraph participates in <a href=\"https://sourcegraph.notion.site/E-Verify-2ab3286dde3446d6bac2898c83610107\" target=\"_blank\">E-Verify</a> for U.S. Employees</span></em></p></div>\n","tags":"[\"management\",\"engineering\"]","pubDate":"2024-05-16 16:39:17.074","link":"https://boards.greenhouse.io/sourcegraph91/jobs/5180384004","savedDate":"2024-05-16 16:39:17.074","slug":"director-enterprise-technical-advisory-post-sales-customer-success-m4-sourcegraph-3593"},{"id":7702605444,"title":"Portfolio Risk Manager ","company":"Bobtail","image":"https://media.licdn.com/dms/image/D4E0BAQGvUyfPVBWDyg/company-logo_200_200/0/1657595552015?e=2147483647&v=beta&t=EecsDCOy3Fh_26M1noQDDIYw8-JuGKz_d1JDvcBZ-yI","description":"\n    \n\n    <p></p>\n<h3>About Bobtail</h3>\n<p>Bobtail is dedicated to increasing happiness by eliminating inefficiencies in the supply chain.&nbsp; We envision a supply chain without friction, fraud, waste, and abuse where companies succeed based on the value they create.</p>\n<p>We work in a unique way at Bobtail, where we value teams over individuals and encourage experimentation and iteration to constantly improve.&nbsp; Teams are given flexibility in working towards a shared purpose and given the freedom to decide how they will accomplish their goals.</p>\n<p>If you are an out-of-the box thinker that takes a proactive approach in collaborating with others to solve problems and achieve your goals - we would love to talk to you.</p>\n<p>The things we value:</p>\n<ol>\n<li>Mission</li>\n<li>Teams over individuals</li>\n<li>Collaboration</li>\n<li>Communication</li>\n<li>Iteration</li>\n<li>Experimentation and failing fast</li>\n<li>Initiative and solutions-oriented approach</li>\n<li>Documentation</li>\n<li>Data</li>\n<li>Mental health and work- life balance</li>\n<li>Diversity</li>\n<li>Transparency</li>\n</ol>\n<h2>Position Summary</h2>\n<p>We are looking for a skilled Portfolio Risk Manager to assess, identify, and mitigate potential risks associated with our operations. The ideal candidate will have a strong background in risk management. Experience in the transportation, freight factoring, or fleet card industry is preferred but not required. The Portfolio Risk Manager will be responsible for developing and implementing risk management strategies to safeguard our company's assets and ensure compliance with regulatory requirements.</p>\n<h2>You should apply if you have:</h2>\n<ul>\n<li>Bachelor’s degree in business, finance, risk management, or a related field</li>\n<li>Proven experience in a risk management role</li>\n<li>Strong understanding of risk management principles, methodologies, and best practices.</li>\n<li>Excellent analytical and problem-solving skills, with the ability to identify and assess complex risks.</li>\n<li>Proficiency in utilizing MS Office applications and other data analytics tools, especially Excel</li>\n<li>Commitment to excellent customer service</li>\n<li>Excellent written and verbal communication, as well as interpersonal skills</li>\n<li>Ability to prioritize and manage multiple responsibilities</li>\n<li>Ability to work independently and accomplish tasks with little to no supervision</li>\n</ul>\n<h2>Responsibilities:</h2>\n<ul>\n<li>Develop and implement risk management policies, procedures, and controls to mitigate identified risks.</li>\n<li>Monitor and evaluate the effectiveness of risk management strategies and make recommendations for improvement as needed.</li>\n<li>Create and maintain reports on key risk metrics, concentrations, and stratifications of the A/R portfolio.</li>\n<li>Compile detailed financial/risk analysis across multiple, semi-disparate data sets to investigate potential risks, trends, and expected impact of risk mitigation strategies.</li>\n<li>Perform research to prepare and provide clear and accurate information as requested by auditors and other stakeholders.</li>\n<li>Provide guidance and support to internal teams on risk identification, assessment, and mitigation.</li>\n<li>Collaborate with cross-functional teams, including finance, operations, and compliance, to ensure alignment on risk management objectives.</li>\n<li>Stay abreast of industry developments and best practices in risk management.</li>\n<li>Prepare ad-hoc risk management reports as assigned.</li>\n<li>Perform other assigned tasks and duties as assigned.</li>\n</ul>\n<h2>Benefits</h2>\n<ul>\n<li>Monthly Mental Break Day</li>\n<li>Paid Time Off</li>\n<li>Work from home (or wherever)</li>\n<li>Parental leave</li>\n</ul>\n<p>Creating a diverse and inclusive workplace is Bobtail’s nucleus. We are an equal opportunity employer and embrace people of different backgrounds, cultures, religions, national origins, races, colors, genders, gender expressions, sexual orientations, ages, marital status, veteran status, experiences, abilities, and perspectives.</p>\n<p></p>\n\n    \n\n    \n","tags":"[\"Finance\",\"management\"]","pubDate":"2024-05-16 16:39:17.074","link":"https://boards.greenhouse.io/bobtail/jobs/4023257005","savedDate":"2024-05-16 16:39:17.074","slug":"portfolio-risk-manager-bobtail-598"},{"id":8106846620,"title":"Partnerships Manager","company":"SafetyWing","image":"https://pbs.twimg.com/profile_images/1177267684574208000/54eG3WmW_400x400.jpg","description":"<h2>🧘 What we offer</h2> <ul><li><!--block-->Fully remote work environment – work from anywhere globally.&nbsp;</li><li><!--block-->Competitive compensation.</li><li><!--block-->Global coverage with Remote Health and Nomad Insurance.</li><li><!--block-->A minimum of 20 days of compensated time off each year.</li><li><!--block-->Referral bonus - an incentive program rewarding you for helping us find exceptional talent to join our team.</li><li><!--block-->Opportunity to unlock more benefits as your tenure with SafetyWing grows.</li><li><!--block-->We are looking forward to hearing from you!</li></ul><div><!--block--><br></div> <div><!--block--><strong>SafetyWing</strong> (YC W18) seeks a <strong>Partnerships Manager (YouTube)</strong>&nbsp; to support our growing Partnerships team and our network of Ambassadors with care and personalized attention as we scale the program.<br><br></div><div><!--block-->Partnerships with affiliates and content creators have successfully supported the tremendous growth of SafetyWing since the launch of the Nomad Insurance product in 2019.<br><br></div><div><!--block-->Our influencer program (the ambassador program) was created in-house and designed according to our unique values of authenticity and simplicity. As a result, it became the most strategic growth channel for Nomad Insurance, accounting for more than 35% of sales.</div> <h2>💻 Your responsibilities will include</h2>  <ul><li><!--block-->Identifying the best YouTube creators that could fit our affiliate program well.</li><li><!--block-->Reaching out to these creators using genuine outreach/messaging.</li><li><!--block-->Signing up ambassadors through 1:1 calls and pitch presentations.</li><li><!--block-->Helping them create the first piece of content that includes SafetyWing products.</li><li><!--block-->Allocating budgets and crafting creative briefs for sponsored campaigns.</li><li><!--block-->Monitoring the results from both the outreach efforts and the Ambassadors’ successes.</li><li><!--block-->Helping in finding creative ways to scale the acquisition of quality ambassadors for SafetyWing.</li></ul> <h2>🧪 We are looking for someone who</h2> <ul><li><!--block-->Has experience and a strong interest in developing in the sales/partnerships field.</li><li><!--block-->Has hands-on experience working with YouTube content creators.</li><li><!--block-->Has experience working autonomously and understands remote work specifics.</li><li><!--block-->Has excellent written and verbal communication skills.</li><li><!--block-->Understands influence marketing, blogging and SEO.</li><li><!--block-->Has a “go-getter attitude”: an entrepreneurial spirit who creatively solves problems and works independently.</li></ul><div><!--block--><strong>😀 We like to work with people who:</strong></div><ul><li><!--block-->Want to help build a global social safety net on the Internet.</li><li><!--block-->Think for themselves instead of copying others.</li><li><!--block-->Are willing to try new things, even with the risk of failure.</li><li><!--block-->Are intellectually curious and open to new ideas.</li><li><!--block-->Are creative and bold in the face of any problems.</li><li><!--block-->Have strong integrity and do the right thing.</li></ul><div><!--block--><br></div>","tags":"[]","pubDate":"2024-05-16 16:39:17.073","link":"https://safetywing.pinpointhq.com/en/jobs/188488","savedDate":"2024-05-16 16:39:17.073","slug":"partnerships-manager-safetywing-2710"},{"id":4345579985,"title":"Business Operations and Finance Manager - Cashalo/Empower, Asia Pacific (Remote)","company":"Empower","image":"https://lever-client-logos.s3.us-west-2.amazonaws.com/2e1a369c-b58f-41ac-8d86-4b0a77695e68-1687915522032.png","description":"<div><b>EMPOWER OVERVIEW</b></div><div><a href=\"http://empower.me/\" class=\"postings-link\">Empower</a>&nbsp;is a fast-growing fintech on a mission to expand access to fair credit to give anyone the opportunity to improve their financial security and mobility. We recently launched in Southeast Asia through our acquisition of Cashalo, the leading online lending platform in the Philippines. Our mission to expand access to credit in the region will take creativity, passion, and drive. Are you in?</div><div>Empower is backed by Sequoia Capital, Blisce, and Icon Ventures. Are we the next great place to grow your impact and accelerate your career? We think so:</div><div>Inc. ranked Empower #56 in the 2023 Inc. 5000 list of the fastest-growing private companies in the US (#55 in 2022). Forbes put Empower on its 2023 list of America's Best Startup Employers. Fast Company recognized the new Empower Thrive line of credit in their 2022 list of the Next Big Things in Tech.</div><div><br></div><div><b>THE EMPOWER WAY</b></div><div>Great Expectations: We come up with bold, audacious goals for ourselves and go all out for impact</div><div>Owner Mindset: We give every employee latitude to act independently, make smart choices, and move the business forward</div><div>Spirited Debate: We love skeptics and seek counter opinions to challenge our personal assumptions and expand our view</div><div>Customer Obsession:&nbsp;We listen to understand, empathize, and create a memorable, rewarding experience for our community</div><div>Inclusive Collaboration: We believe diverse teams make the best decisions, and we strive to give diverse voices a seat at the table</div><div>No Jerks Allowed: We value our relationships and take the time to build trust and connection and communicate respectfully</div><div><br></div><div><b><span>JOB DESCRIPTION</span></b></div><div>The Business Operations &amp; Finance Manager, SEA will help build out Empower’s analytical capabilities, identify opportunities to improve operational efficiency, and share strategic recommendations and data-based insights for products and programs critical to Empower’s growth , customer acquisition, and customer retention in the Philippines and Southeast Asia. You will partner closely with our leadership team to develop insights and execute impactful programs. Your insights will build the foundation for our scaled success as we bring new products to market and expand access to fair credit in the region.</div><div><br></div><div>Travel for company offsites is expected at a minimum 2 times a year.</div><h3>Key Responsibilities</h3><li>Build analytical tools: Surface data-based insights through dashboards, automated reporting, and presentations to inform critical decision-making; experience in SQL and Tableau a strong plus</li><li>Establish and monitor KPIs: Monitor day-to-day business, conduct data analysis to identify trends, patterns, and insights that inform business decision-making.</li><li>Identify opportunities for automation and process improvement, work with the team to set up processes that allow us to keep scaling.</li><li>Set strategic priorities: Partner with different teams to build business cases, refine product pricing, and develop incentive structures for our product.</li><li>Wear multiple hats: Embrace the dynamic nature of our team at this exciting stage. Demonstrate versatility by willingly taking on a variety of tasks, contributing to the multifaceted growth of the team and the company.</li><li>Lead cross-functional initiatives: Collaborate with cross-functional colleagues in Product, Data Science, Marketing, and Engineering.</li>,<h3>Candidate Qualifications</h3><li>Based in an Asia Pacific time zone</li><li>Willingness to travel 1-2 times per quarter to Manila (&amp; potentially other cities in Southeast Asia)</li><li>Minimum of 2+ years work experience in management consulting, startup operations, strategic finance, and/or investment banking</li><li>Strong analytical abilities and comfort building and working with complex Excel models; SQL and Tableau experience are a strong plus</li><li>A get-it-done mindset; you’re resourceful and happy to roll up your sleeves and be in the weeds</li><li>Experience delivering complex, cross-functional operational initiatives</li><li>A interest in addressing complicated and impactful product &amp; business problems</li><li>Strong strategic thinking, problem solving, and logical structuring abilities</li><li>Comfort with ambiguity; the ability to independently lay out and test clear hypotheses, and solve problems without well-defined direction</li><li>Excellent verbal and written communication skills</li><div>At Empower, we hire for people that push themselves to understand others and seek out ways to challenge their personal assumptions. Our hope is that by fostering such an environment, we strengthen our business and relationships by putting people first. We are committed to building a diverse, inclusive, and equitable workspace where everyone (regardless of age, education, ethnicity, gender, sexual orientation, or any personal characteristics) feels like they belong. Even if your experience doesn’t exactly match up to our job description, you should feel empowered to apply regardless!</div>","tags":"[\"Finance\",\"management\",\"engineering\"]","pubDate":"2024-05-16 01:59:51.062","link":"https://jobs.lever.co/empower.me/06a561b2-2f41-48cf-b0be-b6136b68e5ab","savedDate":"2024-05-16 16:39:17.074","slug":"business-operations-and-finance-manager-cashalo-empower-asia-pacific-remote-empower-1975"},{"id":9968433075,"title":"Data Scientist, Analytics (Senior / Staff)","company":"Bio Render","image":"https://lever-client-logos.s3-us-west-2.amazonaws.com/0f4b434e-502f-4390-9819-c058d43028c1-1595260531860.png","description":"<div>At BioRender, our mission is to accelerate the world’s ability to learn, discover and communicate science. We are passionate about democratizing science communication in order to accelerate scientific discovery and understanding. We're looking for amazing people to help create the world’s go-to-place and platform where science is communicated. Come join us!</div><div><br></div><div><span style=\"font-size: 11pt\">As a Senior/Staff Data Scientist at BioRender, you'll be part of our centralized Data organization, contributing to our strategic roadmap, building our data foundations, and ensuring we tackle high-impact projects for long-term success. Partnering closely with Data Engineering, our mission is to empower self-service, user-driven insights to fuel BioRender's growth. This role offers the chance to deliver impactful insights, analytics, and reporting. As a small team, you'll also engage in ETL, dbt, and data model design. In this role, you'll elevate our team's understanding of statistics and best practices while defining processes, recruiting, mentoring, and shaping our growing team. If managing diverse projects from KPI definition to compelling data visualizations and deep analytical work excites you, come say hello!</span></div><div><br></div><h3>In your first 3 months:</h3><li>Meet all stakeholders and develop a regular cadence for meeting with them; assess and learn about our existing KPIs; get up to speed on our dbt / data modeling best practices and identify opportunities for improvement&nbsp;</li><li>Help define + model out at least 1-2 core, company KPI and build out / refine existing dashboards to use this new definition</li>,<h3>In your first 6 months:</h3><li>Champion analyses or dashboards for 1 key stakeholder (e.g. activation milestones, validate hypotheses for if a metric is the correct one to be looking at, help the product team set up a dashboard to monitor quarterly goals / new features, etc.); help contribute to our quarterly planning initiatives&nbsp;</li><li>Have exposure to + impact on multiple analyses, dashboards, and KPI definitions; at least some projects should be cross-functional in nature (i.e. impact multiple teams, not just 1 stakeholder)</li>,<h3>In your first year:</h3><li>Have done extensive development in our dbt environment; have helped the Data org assess our existing BI tooling + helped BioRender migrate / roll out to another more scalable vendor</li><li>Participate in hiring / onboarding for more junior team members; helped team establish best practices across analysis, data visualization, leveraging statistics for insights, and building out data sources in dbt</li><li>Have significantly impacted BioRender’s ability to provide self-service analytics for the majority of asks; helped recruit for, onboard, and mentor a team of data scientists</li>,<h3>Our Ideal Fit </h3><li>6+ years of experience post academia, working in an analytical role – leading data discoveries, strategies and discussion with non technical stakeholders in the business</li><li>Advanced proficiency in SQL and data visualization tools such as Metabase, Mode, Tableau or Looker; strong ability to craft meaningful dashboards that tell a story</li><li>Experience collaborating with stakeholders to define KPIs, then build them into a data warehouse with tooling such as dbt and Airflow/Dagster/Luigi. Knowledge of ETL / data warehouse principles (but don’t worry - you’ll have ample data engineering support!)</li><li>Strong written and verbal communication skills to influence non-technical audiences with analytical insights and data visualizations; past experience with data dictionaries / documentation / data governance&nbsp;</li><li>Comfort working with complex and fast-evolving data sets; the ability to document assumptions and communicate data limitations&nbsp;</li><li>Stakeholder management and prioritization - you feel comfortable working with stakeholders of varying technical abilities and empathize with their pain points; you want to use data to make their lives easier&nbsp;</li><li>Basic knowledge of Github/version control and command line preferred&nbsp;</li><li>[Bonus] Experience with notebook tools (e.g. Hex, Databricks, Jupyter) to run statistical analysis in a repeatable way&nbsp;&nbsp;</li><li>[Bonus] Past experience with helping an organization “level up” their data skills and competencies&nbsp;</li><li>[Bonus] Experience working with event data / event streams for funnel analysis, product KPIs, and monitoring new feature rollouts&nbsp;</li><div><br></div><div>We typically expect candidates to have 6+ years of experience to achieve these accomplishments. However, we recognize that career paths vary, and your unique journey may have equipped you with the necessary skills. If you believe you have what it takes to excel in this role, we encourage you to apply!</div>,<h3>Why join us?</h3><li>We are mission-driven, and work collaboratively towards our shared vision of improving scientific communication and accelerating scientific discovery: BioRender figures have appeared in more than 16,000 publications!&nbsp;</li><li>It’s a product that users love! We have a world-class NPS and a community of loyal fans. Check out our Testimonials page to see what our customers are saying about us: <a href=\"https://biorender.com/testimonials/\" class=\"postings-link\">https://biorender.com/testimonials/&nbsp;</a></li><li>We are in the top quartile for profitability and year-over-year revenue growth, with users in 200+ <a href=\"http://countries.biorender/\" class=\"postings-link\">countries.</a></li><li>BioRender is an equal opportunity employer, and an inclusive hiring process and work environment is a part of our DNA.&nbsp;</li><li>We’re remote-first and have team members across Canada and the United States. A physical office in Toronto is available, but you have the flexibility to work from anywhere.&nbsp;</li><li>We’re backed by top investors, accelerators, and some of the most successful life science entrepreneurs and philanthropists in the world including Y Combinator, Malala Fund founders, and Fifty Years VC.&nbsp;</li><li>We are committed to building a warm, inclusive, and diverse environment. Check out how we make sure our <a href=\"https://www.biorender.com/biorender-careers\" class=\"postings-link\">employees come first</a>.</li><div>Check out our candidate resource - <a href=\"https://biorender.notion.site/Engineering-Product-Design-66275a3c2cca42e39234412881621467\" class=\"postings-link\">Engineering, Product &amp; Design at BioRender!</a>&nbsp;</div><div>You can also read more about the <a href=\"https://biorender.notion.site/BioRender-Candidate-Resources-8255c155797f442a950720a33b4764d5\" class=\"postings-link\">BioRender interview process and FAQs here</a>! </div><div>Check out what it's like to work at BioRender in <a href=\"https://biorender.notion.site/biorender/Working-at-BioRender-as-a-Canada-Based-Employee-f6e12ab844154bb9948b22b32e3f0c70\" class=\"postings-link\">Canada</a> and the <a href=\"https://biorender.notion.site/biorender/Working-at-BioRender-as-a-U-S-Based-Employee-4ab2cc8e48f546f89aa98c318bccebc9\" class=\"postings-link\">US</a>!</div><div><br></div><div>#LI-KS1</div>","tags":"[\"management\",\"engineering\",\"B2C\"]","pubDate":"2024-05-16 01:55:26.830","link":"https://jobs.lever.co/biorender/ab775951-32ad-49ae-a13a-4b2f6f18e03e","savedDate":"2024-05-16 16:39:17.075","slug":"data-scientist-analytics-senior-staff-bio-render-6377"},{"id":3551426455,"title":"Social Media & Influencer Marketing Specialist (Arabia & Africa)","company":"Airalo","image":"https://lever-client-logos.s3.us-west-2.amazonaws.com/55028a36-609c-479c-9553-d4689ff2dd8c-1669620566663.png","description":"<div><b>About Airalo</b></div><div>Alo! Airalo is the world’s first eSIM store that helps people connect in over 200+ countries and regions across the globe. We are building the next digital service that revolutionizes the telecom industry. We are a travel-tech company and an equal-opportunity environment that values and executes diversity, inclusion, and equity. Our team is spread across 50+ countries and six continents. What glues us together is our commitment to changing the way you connect<span style=\"font-size: 13.3333px\">. </span></div><div><br></div><div><b>About you</b></div><div>We hope that you care deeply about the quality of your work, the intrinsic worth of tasks, and the success of your team. You are self-disciplined and do not require micromanagement in terms of your skillset and work ethic. You do your best to flourish as an individual every day while working hard to foster a collaborative team environment. You believe in the importance of being — and staying — authentic, honest, positive, and kind. You are a good interlocutor with clear and concise communication. You are able to manage multiple projects, have an analytical mind, pay keen attention to detail, and love to get your hands dirty. You are cognizant, tolerant, and welcoming of vulnerabilities and cultural differences.</div><div><br></div><div><b>About the Role</b></div><div><b>Position</b>: Full-time / Employee</div><div><b>Location:</b>&nbsp;Remote-first </div><div><b>Benefits:</b>&nbsp;Health Insurance, work-from-anywhere stipend, annual wellness &amp; learning credits, annual all-expenses-paid company retreat in a gorgeous destination &amp; other benefits</div><div><br></div><div>Airalo is seeking a talented and highly motivated <b>Social Media and Influencer Marketing Specialist</b> to join our Growth team and grow our <b>Arabia &amp; Africa markets</b>. You will be responsible for guiding the strategy and development of our entire social media ecosystem in your markets and you will develop and execute influencer marketing campaigns to raise brand awareness, drive user engagement, and boost conversions. This role offers an exciting opportunity to work with some of the most influential voices in the travel and tech industry.</div><h3>Responsibilities include but are not limited to:</h3><li><b>Strategy Development and Campaign Planning:</b> Brainstorm, develop, and execute end-to-end influencer marketing campaigns aligned with Airalo's goals and target audience.</li><li><b>Identify and Recruit Influencers:</b> Partner with relevant Arabic/African influencers, content creators, and/or agencies to create authentic and engaging content that showcases Airalo's products.</li><li><b>Social Media Strategy:</b> Develop and execute an effective social media strategy tailored to the Arabia &amp; Africa markets to increase brand awareness, engagement, and lead generation.</li><li><b>Community Engagement:</b> Monitor and actively engage with the Airalo community on social media platforms, respond to comments, questions, and feedback promptly, and build positive relationships with followers.</li><li><b>Performance Analysis and Reporting:</b> Monitor, analyze performance, and prepare reports on the ROI and effectiveness of influencer marketing efforts, including KPIs and metrics</li><li><b>Budget Management:</b> Effectively manage the budget allocated for influencer marketing campaigns, ensuring efficient use of resources.</li><li><b>Compliance and Contracts:</b> Ensure that influencer partnerships comply with legal regulations and company policies. Manage influencer contracts and negotiations.</li><li><b>Crisis Management:</b> Handle potential social media crises effectively, maintain a positive brand image, and address customer concerns professionally. And ensure compliance with local laws (e.g., copyright and data protection)</li><li><b>Stay Up-to-Date:</b> Stay informed about industry trends, emerging influencers, and new platforms to continuously adapt and enhance Airalo's influencer marketing strategies.</li>,<h3>Must-haves:</h3><li>At least 3+ years of experience in a similar role, even better if in the travel industry. Strong experience with <b>social media and influencer marketing</b> is a must</li><li>Knowledge of the <b>Arabia &amp; Africa markets</b></li><li>Fluency in <b>English and Arabic,</b> with impeccable verbal and written communication skills</li><li>Experience in brand management, content, social media, influencer, and market insight with an in-depth understanding of the social and digital space</li><li>Excellent knowledge of Instagram/Facebook, TikTok, Youtube, Twitter, Telegram, Linkedin, Snapchat (and other eventual emerging social media) and abreast of social media best practices, and regional, and global trends</li><li>Owning a project that is not strictly part of your job description excites you and you take it as an opportunity to learn something new</li><li>Superior internal &amp; external communication &amp; cross-functional stakeholder management skills</li><li>Enjoying and excelling at handling multiple projects simultaneously in a matrix &amp; complex environment</li><li>Good time management with an eye for perfection &amp; a strong operational background</li>,<h3>Good to have:</h3><li>Prior experience in the tech, travel, or telecommunications industry</li><li>A network of influencers or influencer agencies you already worked with</li><li>Knowledge of eSIM and GSMA-related technologies and services</li><li>French language proficiency is a plus</li><div>If you are interested in this position, <b>please apply via the link.</b></div><div><br></div><div><i>We sincerely thank all applicants in advance for submitting their interest in this opportunity with Airalo. </i></div>","tags":"[\"management\",\"legal\",\"aws\"]","pubDate":"2024-05-16 01:39:08.843","link":"https://jobs.lever.co/airalo/42e02332-be26-4ac2-8cec-5a5065827997","savedDate":"2024-05-16 16:39:17.075","slug":"social-media-influencer-marketing-specialist-arabia-africa-airalo-2810"},{"id":3497397186,"title":"Customer Support Representative","company":"Zentro","image":"https://remotive.com/job/1913120/logo","description":"<p> </p>\n<p>Zentro is one of the fastest-growing internet service providers in the country, and we’re not about to stop there.</p>\n<p>We’re putting the corporate giants on notice by providing residential and business customers with remarkably fast, exceptionally reliable internet service for less. And we’re doing it all with uncommonly responsive customer service and technical support — something the other guys can only manage in their dreams. Maybe.</p>\n<p><strong>READY TO BECOME A ZENTRO PRO?</strong></p>\n<p>Keeping internet connections up and running all day every day is kind of a big deal, and our people are proud to be doing it. Some might consider us the unsung heroes of the digital age. That’s what we think of ourselves anyway. Every person and every role here is important, and the positive energy you bring to work with you has tremendous value.</p>\n<p>Zentro Pros come to work every day excited to make an impact. If you have an entrepreneurial spirit like we do, a strong work ethic, and a common-sense style to conducting business, there’s no doubt you’d fit right in. Zentro leadership also places great value on initiative, rewarding employees who exceed goals and expectations. So, if you’re a real go-getter, you’re definitely going to get noticed.</p>\n<p><strong>A COMFORTABLE PLACE TO DO YOUR BEST WORK</strong></p>\n<p>It’s no secret – happy people do better work. So we proudly provide a pleasant, highly functional work environment where our Zentro Pros can find their center and excel. Our headquarters is presently situated in Chicago’s burgeoning West Loop tech hub, surrounded by fast-growing technology companies of all kinds and sizes. We’re a short distance from public transportation, not to mention a growing variety of Michelin-rated restaurants, entertainment venues, and the Fulton Market District. With a job here, work is only the beginning.</p>\n<p><strong>A SOFT SPOT FOR THE PEOPLE WE SERVE</strong></p>\n<p>Zentro is proudly committed to playing an important role in the communities we serve. We’ve even partnered with large municipalities (like the City of Chicago) to provide free Wi-Fi to parks and beaches. It’s all about keeping people connected wherever they go. But, seriously, enough about us…we’re really excited to learn more about YOU!</p>\n<p>Zentro is seeking to hire phone support specialists who will support customers of our Gigabit Internet services. Potential candidates should have a basic understanding of computer hardware, software, and wireless routers. If you have some knowledge and a strong interest in computers/networking along with customer service skills and experience, we are willing to train advanced skills.</p>\n<p><strong>Essential Duties and Responsibilities</strong></p>\n<ul style=\"\">\n<li style=\"\">Configure and troubleshoot wired and wireless network issues for customers over the phone.</li>\n<li style=\"\">Recognize and understand how to configure customers' equipment to connect to the Internet via a wireless router, which may include connecting standard consumer electronic devices such as streaming devices, computers, laptops, tablets, smartphones and more.</li>\n<li style=\"\">Provide a high level of customer service, educate customers on the use of products and services, and recommend products and services to meet customer needs.</li>\n<li style=\"\">Conduct follow-up calls to customers with recent completed service requests or calls</li>\n<li style=\"\">Reply to customer email inquiries.</li>\n<li style=\"\">Work with customers to sign up for new service and resolve basic billing issues.</li>\n<li style=\"\">Troubleshoot advanced networking protocols within the company network.</li>\n</ul>\n<p><strong>Qualifications:</strong></p>\n<ul style=\"\">\n<li style=\"\">High School Diploma or equivalent education</li>\n<li style=\"\">Requires either previous networking or telephone customer service/support experience</li>\n<li style=\"\">A basic understanding of computer hardware and software and consumer wireless routers</li>\n<li style=\"\">High ethical standards, strong work ethic with an emphasis on team commitment, respect for others, the ability to acknowledge and build on others' ideas, and support for group decisions</li>\n<li style=\"\">Must have the ability to solve problems with patience and a positive approach.</li>\n<li style=\"\">Self-motivated, detail-oriented and organized with the ability to work efficiently to meet deadlines.</li>\n</ul>\n<p><strong>Compensation</strong></p>\n<ul style=\"\">\n<li style=\"\">Salary: $16 - $18 / hour + Bonus Opportunities</li>\n<li style=\"\">Health and Dental benefits; paid vacation, sick leave, and holidays; and more great perks.</li>\n</ul>\n<p> </p>\n<img src=\"https://remotive.com/job/track/1913120/blank.gif?source=public_api\" alt=\"\"/>","tags":"[\"excel\",\"go\",\"hardware\",\"technical support\",\"responsive\"]","pubDate":"2024-05-14 09:06:23.000","link":"https://remotive.com/remote-jobs/customer-support/customer-support-representative-1913120","savedDate":"2024-05-16 16:39:17.071","slug":"customer-support-representative-zentro-1638"},{"id":5427826536,"title":"Partnerships Director (Europe & CIS)","company":"Airalo","image":"https://lever-client-logos.s3.us-west-2.amazonaws.com/55028a36-609c-479c-9553-d4689ff2dd8c-1669620566663.png","description":"<div><b>About Airalo</b></div><div>Alo! Airalo is the world’s first eSIM store that helps people connect in over 200+ countries and regions across the globe. We are building the next digital service that revolutionizes the telecom industry. We are a travel-tech company and an equal-opportunity environment that values and executes diversity, inclusion, and equity. Our team is spread across 50+ countries and six continents. What glues us together is our commitment to changing the way you connect<span style=\"font-size: 13.3333px\">. </span></div><div><br></div><div><b>About you</b></div><div>We hope that you care deeply about the quality of your work, the intrinsic worth of tasks, and the success of your team. You are self-disciplined and do not require micromanagement in terms of your skillset and work ethic. You do your best to flourish as an individual every day while working hard to foster a collaborative team environment. You believe in the importance of being — and staying — authentic, honest, positive, and kind. You are a good interlocutor with clear and concise communication. You are able to manage multiple projects, have an analytical mind, pay keen attention to detail, and love to get your hands dirty. You are cognizant, tolerant, and welcoming of vulnerabilities and cultural differences.</div><div><br></div><div><b>About the Role</b></div><div><b>Position</b>: Full-time / Employee</div><div><b>Location:</b>&nbsp;Remote-first </div><div><b>Benefits:</b>&nbsp;Health Insurance, work-from-anywhere stipend, annual wellness &amp; learning credits, annual all-expenses-paid company retreat in a gorgeous destination &amp; other benefits</div><div><br></div><div><span style=\"font-size: 11pt\">We are looking for a seasoned Partnerships leader to join the </span><b style=\"font-size: 11pt\">Airalo Partnerships</b><span style=\"font-size: 11pt\"> department. The undisputed industry leader in the B2C segment in the eSIM industry, we are now looking to expand our presence in the B2B2C and B2B space to bring the eSIM revolution to adjacent industries. As the Director of Partnerships for Europe &amp; CIS, you will lead Airalo’s partnership efforts across our four key Partnerships streams - Strategic Partnerships, Affiliate Marketing, Channel Sales and Corporate Sales for Europe &amp; CIS.</span></div><h3>Responsibilities include but are not limited to:</h3><li>Work closely with the VP of Partnerships and other team members in the department</li><li>Build, lead and groom a team of Partnerships Managers, further supported by in-country teams for Affiliate Marketing, Channel Sales and Corporate Sales for key countries within Europe &amp; CIS</li><li>Be a core member of the Partnerships Leadership Team that shapes Airalo’s global Partnerships strategy</li><li>Shape the future of Airalo’s Partnerships products by working closely with the Partner Experience Product and Engineering teams</li><li>Find, identify, prospect and lead negotiations with large strategic partners within Europe &amp; CIS</li><li>Maintain relationships with key partners to drive partner profitability and grow the B2B/B2B2C partnerships contribution to the business</li><li>Refine the Airalo Partnerships roadmap to anticipate and fulfill partner needs, thereby maintaining Airalo’s status as the preferred provider across industry partners in Europe &amp; CIS</li><li>Collaborate and work with different internal and external stakeholders to develop and execute joint projects/opportunities</li><li>Define and improve SOPs for the Partnerships department to streamline operations and improve efficiency across workflows</li><li>Represent Airalo at leading industry events and conferences across Europe &amp; CIS</li><li>Own the Airalo Partnerships OKRs for Europe &amp; CIS</li>,<h3>Must-haves:</h3><li>10+ years of experience in partnerships, sales, account management or business development in a high-growth B2B and/or B2B2C environment</li><li>5+ years of prior experience building and managing high performance teams</li><li>Partner-first mentality and a genuine passion to help your stakeholders succeed while creating a win-win relationships</li><li>Ability to narrate a good story - Airalo’s unique story and the problem we solve for our users makes it a compelling partnership proposition</li><li>Ability to employ, and teach to your team, various sales techniques, including effective questioning, objection handling, consultative selling, and solution selling</li><li>Ability to develop thought leadership skills and build trust with key stakeholders - internally and externally</li><li>Ability to multi-task in a complex &amp; matrix environment</li><li>Experience with sales and partnerships tools</li><li>Perfect verbal and written communication skills in English</li>,<h3>Good to have:</h3><li>Familiarity with the travel industry</li><li>Prior work experience in a travel tech or telecom company</li><li>Graduate degree in a related field</li><li>Verbal and written ability in relevant, additional languages</li><div>If you are interested in this position, <b>please apply via the link.</b></div><div><br></div><div><i>We sincerely thank all applicants in advance for submitting their interest in this opportunity with Airalo. </i></div>","tags":"[\"management\",\"engineering\",\"B2C\",\"B2B\"]","pubDate":"2024-05-14 06:13:43.586","link":"https://jobs.lever.co/airalo/3db03329-a330-4f30-8776-c0713312e35d","savedDate":"2024-05-16 16:39:17.074","slug":"partnerships-director-europe-cis-airalo-8927"},{"id":4052669330,"title":"Engineering Manager - Search and Discovery","company":"Bio Render","image":"https://lever-client-logos.s3-us-west-2.amazonaws.com/0f4b434e-502f-4390-9819-c058d43028c1-1595260531860.png","description":"<div><span style=\"font-size: 11pt\">At BioRender, our mission is to accelerate the world’s ability to learn, discover and communicate science. We are passionate about democratizing science communication in order to accelerate scientific discovery and understanding. We're looking for amazing people to help create the world’s go-to-place where science is communicated. Come join us!</span></div><div><br></div><div><span style=\"font-size: 11pt\">You can think of BioRender as the “Figma or Canva for scientists,” with a suite of web-based graphics communication products that empower scientists to create beautiful scientific visuals and presentations with ease.</span></div><div><br></div><div><span style=\"font-size: 16px\">As an Engineering Manager leading Search and Discovery, you will help accelerate our ability to return billions of hours to scientists by empowering them with the most relevant content in the most highly trafficked part of our application: the core illustrator. We want to help scientists find the science they're looking for in their own language, and build a 'visual auto complete' that can personalize and anticipate what scientific content would be most relevant to a scientist using our product. You will lead the strategic direction for how we can make BioRender as revolutionary as the breakthroughs communicated using our product.&nbsp;&nbsp;</span></div><h3>What you'll do at BioRender: </h3><li><b>People</b>: Lead, nurture and grow a high-performing team to deliver an incredible amount of user value</li><li><b>Product</b>: Collaborate with product and design to deeply understand the user, the product problem space, and how engineering can accelerate product advancements</li><li><b>Execution / Delivery:</b> Lead your team to deliver search and personalization systems to empower users to instantly find the content they are looking for. We are looking for an engineering leader who'll be comfortable doing anything from working with the platform team to set up new python services, to working with data engineering to enable a new data streams, to working with legal to work through privacy issues</li><li><b>Technical depth:</b> Facilitate great technical decision-making across a broad technical stack, having passion for the technical aspects of your work, but a desire to let engineers drive the details</li>,<h3>What we Value: </h3><li>Have experience managing a cross functional engineering team with embedded ML engineers that developed impactful solutions of machine learning &amp; NLP problems at scale to production applications, i.e, search (keyword and semantic), embeddings, reranking, recommendation, personalization</li><li>Successful track record managing a high performing product engineering team of 5-8 engineers and consistently delivering value to users (2+ years of management experience)</li><li>Previous experience delivering large-scale, reliable systems that require a lot of cross functional collaboration</li><li>A technical background that gives you the ability to relate to the team's problems, facilitate discussion, and guide/coach engineers when making tradeoffs and technical decisions. (7+ years of software engineering experience)</li>,<h3>Why Join Us?</h3><li>We are mission-driven, and work collaboratively towards our shared vision of improving scientific communication and accelerating scientific discovery: BioRender figures have appeared in more than 54,000 publications!&nbsp;</li><li>It’s a product that users love! We have a world-class NPS and a community of loyal fans. Check out our Testimonials page to see what our customers are saying about us: <a href=\"https://biorender.com/testimonials/\">https://biorender.com/testimonials/</a>&nbsp;</li><li>We are in the top quartile for profitability and year-over-year revenue growth, with users in 200+ <a href=\"http://countries.biorender/\">countries.</a></li><div><br></div><div>BioRender is an equal opportunity employer, and an inclusive hiring process and work environment is a part of our DNA.&nbsp;We’re remote-first and have team members across Canada and the United States. A physical office in Toronto is available, but you have the flexibility to work from anywhere.&nbsp;We’re backed by top investors, accelerators, and some of the most successful life science entrepreneurs and philanthropists in the world including Y Combinator, Malala Fund founders, and Fifty Years VC.&nbsp;We are committed to building a warm, inclusive, and diverse environment. Check out how we make sure <a href=\"https://careers.biorender.com/\">our employees come first</a>.</div>","tags":"[\"management\",\"engineering\",\"legal\"]","pubDate":"2024-05-13 20:04:26.723","link":"https://jobs.lever.co/biorender/2d1e0929-2a91-4013-89f6-1c3d451ec044","savedDate":"2024-05-16 16:39:17.075","slug":"engineering-manager-search-and-discovery-bio-render-2382"}]