[{"id":2585100255,"title":"Sales Development Representative","company":"Clutch","image":"https://app.ashbyhq.com/api/images/org-theme-logo/87f6e542-ae68-4ff1-ab48-f05e9dab1964/e24aecd5-3955-404a-8728-c08806c78730.png","description":"<p style=\"min-height:1.5em\"><strong>About the Role</strong></p><p style=\"min-height:1.5em\">As an SDR, you will play a critical role in our revenue growth strategy, supporting both inbound and outbound prospecting efforts. You will:</p><ul style=\"min-height:1.5em\"><li><p style=\"min-height:1.5em\">Engage with inbound leads, including website visitors, content downloads, and event attendees.</p></li><li><p style=\"min-height:1.5em\">Execute outbound prospecting campaigns, targeting Chief Lending Officers (CLOs), VPs of Lending, Chief Digital Officers (CDOs), CXOs, COOs, and other decision-makers at mid-to-large-sized credit unions.</p></li><li><p style=\"min-height:1.5em\">Qualify leads and schedule meetings for the sales team.</p></li><li><p style=\"min-height:1.5em\">Maintain CRM hygiene and leverage email automation tools to nurture prospects.</p></li><li><p style=\"min-height:1.5em\">Support trade show and event efforts, including booth duty and post-event follow-ups.</p></li><li><p style=\"min-height:1.5em\">Collaborate closely with the sales team to ensure a seamless handoff of sales-qualified leads (SQLs).</p></li></ul><p style=\"min-height:1.5em\"><strong>About the Team</strong></p><p style=\"min-height:1.5em\">Clutch’s marketing organization is a small but fast-growing team that’s driving awareness of how Clutch is reshaping credit union lending and account origination. As part of this team, you’ll gain valuable experience across sales, marketing, and financial technology while working with a high-energy, collaborative group. Your work will have a direct impact on revenue growth, and you'll have the opportunity to grow your career in areas such as sales, account management, or marketing.</p><p style=\"min-height:1.5em\"><strong>What You’ll Do</strong></p><p style=\"min-height:1.5em\">Within 3 months, you will:</p><ul style=\"min-height:1.5em\"><li><p style=\"min-height:1.5em\">Identify and reach out to potential credit union clients through a mix of cold calls, emails, and LinkedIn outreach.</p></li><li><p style=\"min-height:1.5em\">Follow up with inbound leads and nurture them until they are sales-qualified.</p></li><li><p style=\"min-height:1.5em\">Conduct discovery calls to assess credit union needs and challenges.</p></li><li><p style=\"min-height:1.5em\">Maintain accurate records in the CRM, ensuring timely follow-ups and reporting.</p></li></ul><p style=\"min-height:1.5em\">Within 6 months, you will:</p><ul style=\"min-height:1.5em\"><li><p style=\"min-height:1.5em\">Work with marketing and sales to refine messaging and optimize outreach strategies.</p></li><li><p style=\"min-height:1.5em\">Provide regular updates on prospecting activities, pipeline, and conversion rates.</p></li><li><p style=\"min-height:1.5em\">Develop and execute sales plans in partnership with AEs and GTM leaders</p></li><li><p style=\"min-height:1.5em\">Achieving sales targets</p></li></ul><p style=\"min-height:1.5em\">Within 9 months, you will:</p><ul style=\"min-height:1.5em\"><li><p style=\"min-height:1.5em\">Operating as an integral part of the GTM motion</p></li></ul><p style=\"min-height:1.5em\"><strong>What You’ll Bring</strong></p><ul style=\"min-height:1.5em\"><li><p style=\"min-height:1.5em\">1-2 years of sales, business development, or marketing experience, ideally in B2B fintech, SaaS, or financial services.</p></li><li><p style=\"min-height:1.5em\">Experience with CRM software (HubSpot, Salesforce, or similar) and email automation tools.</p></li><li><p style=\"min-height:1.5em\">Strong communication and interpersonal skills—comfortable engaging with executive-level prospects.</p></li><li><p style=\"min-height:1.5em\">Self-motivated with a hunter mentality and a results-driven approach.</p></li><li><p style=\"min-height:1.5em\">Ability to manage multiple touchpoints and nurture long sales cycles.</p></li><li><p style=\"min-height:1.5em\">Experience with cold calling, outbound prospecting, and/or event support is a must.</p></li><li><p style=\"min-height:1.5em\">Ability to travel up to 20%</p></li></ul><p style=\"min-height:1.5em\"><em>Please note that this role may evolve as our business needs change, so we appreciate your flexibility and adaptability.</em></p><p style=\"min-height:1.5em\"><strong>What’s In It For You?</strong></p><ul style=\"min-height:1.5em\"><li><p style=\"min-height:1.5em\"><strong>Remote Flexibility:</strong> Enjoy the freedom of remote work from anywhere, balancing life and career seamlessly.</p></li><li><p style=\"min-height:1.5em\"><strong>Unforgettable Off-Sites:</strong> Twice a year, bond with colleagues in exciting destinations, fostering teamwork and fresh ideas.</p></li><li><p style=\"min-height:1.5em\"><strong>Paid Time Off:</strong> Enjoy flexible PTO days yearly for relaxation and rejuvenation.</p></li><li><p style=\"min-height:1.5em\"><strong>Stock Options:</strong> Joining us means having a stake in our success, so you'll receive stock options as part of your compensation package.</p></li><li><p style=\"min-height:1.5em\"><strong>Home Office Setup:</strong> Create your ideal workspace with a dedicated budget for home office essentials.</p></li><li><p style=\"min-height:1.5em\"><strong>Work Trip Budget:</strong> Grow personally and professionally with a budget for work-related trips and co-working.</p></li><li><p style=\"min-height:1.5em\"><strong>Health Coverage:</strong> Prioritize your well-being with comprehensive health and dental insurance plans.</p></li></ul><p style=\"min-height:1.5em\"><strong>About Us</strong></p><p style=\"min-height:1.5em\"><strong>Clutch</strong> is a revolutionary vertical SaaS company, proudly backed by Andreessen Horowitz (A16z), aimed at revolutionizing the way Credit Unions engage and change the lives of their members. As a champion of financial well-being, we address the urgent need for affordable lending solutions in an era where the average American grapples with over $155,000 in household debt.  Unlike traditional financial institutions, Clutch develops software to turn Credit Unions into FinTech lenders and leverage their balance sheets to responsibly lend to over 130M Americans. Our mission extends beyond mere financial transactions; we strive to fundamentally enhance the way credit unions interact with their members. By integrating cutting-edge technologies and user-centric designs, we help credit unions provide seamless digital experiences that are on par with leading tech companies. This approach not only preserves but revitalizes the longstanding tradition of community and member-focused service inherent to credit unions.</p><p style=\"min-height:1.5em\">Clutch is an equal opportunity employer. All applicants will be considered for employment without attention to race, color, religion, sex, sexual orientation, gender identity, national origin, veteran or disability status.</p><p style=\"min-height:1.5em\"><em>Our organization participates in E-Verify. Click </em><a target=\"_blank\" rel=\"noopener noreferrer\" href=\"https://www.e-verify.gov/about-e-verify/what-is-e-verify\"><em>here</em></a><em> to learn about E-Verify.</em></p>","tags":"[\"management\",\"b2b\"]","pubDate":"2025-03-25T00:52:44.338Z","link":"https://jobs.ashbyhq.com/withclutch/f34e3421-8668-41c6-acb3-f24e8f0168f3","slug":"sales-development-representative-clutch-2546"},{"id":2992241803,"title":"Manager, Customer Success Manager","company":"BioRender","image":"https://avatars.githubusercontent.com/u/46490948?s=200&v=4","description":"<p style=\"min-height:1.5em\">At BioRender, we’re on a mission to accelerate the world’s ability to learn, discover, and communicate science — transforming how knowledge is shared and making science open, collaborative, and easily understandable by all. </p><p style=\"min-height:1.5em\"></p><p style=\"min-height:1.5em\">We’re shaping the future of science communication and are looking for talented individuals to help bring this vision to life! 🚀</p><p style=\"min-height:1.5em\"></p><p style=\"min-height:1.5em\">BioRender is seeking a <strong>Manager, Customer Success</strong> to lead a high-performing team in delivering exceptional enterprise customer experiences. You will drive retention, expansion, and engagement, ensuring scientists maximize BioRender’s value.</p><p style=\"min-height:1.5em\"></p><p style=\"min-height:1.5em\">As a <strong>strategic and empathetic leader,</strong> you’ll mentor your team and collaborate cross-functionally to refine scalable success strategies. Data-driven and process-oriented, you excel in fast-paced environments, leveraging insights to enhance customer outcomes and business impact.</p><p style=\"min-height:1.5em\"></p><p style=\"min-height:1.5em\"><strong>What you'll be doing </strong></p><ul style=\"min-height:1.5em\"><li><p style=\"min-height:1.5em\"><strong>Lead and develop</strong> a high-performing team of Customer Success Managers, driving 98%+ retention and 180%+ net retention while fostering strong, long-term client relationships.</p></li><li><p style=\"min-height:1.5em\"><strong>Recruit, mentor, and support</strong> CSMs in their professional growth, continuously enhancing the onboarding program for new team members.</p></li><li><p style=\"min-height:1.5em\"><strong>Establish a data-driven, standardized management framework</strong> that empowers the Customer Success team to consistently achieve key customer outcomes.</p></li><li><p style=\"min-height:1.5em\"><strong>Collaborate cross-functionally</strong> with Product, Sales, Marketing, and Operations to analyze, refine, and optimize BioRender’s Customer Success strategies and playbooks.</p></li><li><p style=\"min-height:1.5em\"><strong>Ensure CRM excellence,</strong> maintaining strong data hygiene while developing standardized KPIs and dashboards to track team performance and progress.</p></li></ul><p style=\"min-height:1.5em\"></p><p style=\"min-height:1.5em\"><strong>What you bring to the table </strong></p><ul style=\"min-height:1.5em\"><li><p style=\"min-height:1.5em\"><strong>1+ years</strong> leading a high-performing team of Customer Success Managers in a fast-growing SaaS environment, with a background in organizations that have scaled rapidly.</p></li><li><p style=\"min-height:1.5em\"><strong>5+ years of experience</strong> in Customer Success, Account Management, or Sales within a SaaS environment.</p></li><li><p style=\"min-height:1.5em\"><strong>Proven track record</strong> of managing and developing team members to drive key revenue outcomes, including customer retention, expansion, CSQL generation, and forecast accuracy.</p></li><li><p style=\"min-height:1.5em\"><strong>Expertise in customer value creation</strong>, guiding customers through all stages of the lifecycle to maximize license adoption, feature utilization, and overall business impact.</p></li><li><p style=\"min-height:1.5em\"><strong>Strong technical acumen</strong>, with the ability to deeply understand a product’s features, capabilities, and business model, effectively aligning them with customer needs.</p></li><li><p style=\"min-height:1.5em\"><strong>Bonus:</strong> Prior experience in life sciences and/or a Bachelor of Science degree (or equivalent) in a related field such as biology, biotechnology, biomedical engineering, or biochemistry.</p><ul style=\"min-height:1.5em\"><li><p style=\"min-height:1.5em\"></p></li></ul></li></ul><p style=\"min-height:1.5em\"><strong>Why join us?</strong></p><ul style=\"min-height:1.5em\"><li><p style=\"min-height:1.5em\"><strong>We are mission-driven</strong>: we work collaboratively towards our shared vision of improving scientific communication and accelerating scientific discovery. BioRender figures have appeared in more than 54,000 publications! </p></li><li><p style=\"min-height:1.5em\"><strong>BioRender is loved by millions!</strong> We have a world-class NPS and a community of loyal fans and users in 200+ countries!</p></li><li><p style=\"min-height:1.5em\"><strong>Our company is backed by top investors</strong> and accelerators like Y Combinator, and we are on a growth trajectory comparable to many top-performing SaaS companies </p></li><li><p style=\"min-height:1.5em\"><strong>We’re remote-first</strong> with team members across Canada and the U.S., offering you the flexibility to work from anywhere. </p></li></ul><p style=\"min-height:1.5em\"></p><p style=\"min-height:1.5em\">BioRender is an Equal Opportunity Employer. We celebrate diversity and are committed to creating an inclusive environment for all employees. All qualified applicants will receive consideration for employment without regard to race, color, religion, sex, sexual orientation, gender identity, national origin, disability, or veteran status.</p>","tags":"[\"management\",\"engineering\"]","pubDate":"2025-03-24T21:46:22.352Z","link":"https://jobs.ashbyhq.com/biorender/b6b121a1-96df-46f8-be1b-75ab3339a386","slug":"manager-customer-success-manager-biorender-7282"},{"id":8415403852,"title":" Senior Product Designer","company":"Kit","image":"https://avatars.githubusercontent.com/u/10557747?s=200&v=4","description":"&lt;div class=&quot;content-intro&quot;&gt;&lt;h4&gt;Description&lt;/h4&gt;\n&lt;div&gt;\n&lt;p class=&quot;p1&quot;&gt;Kit is an email-first operating system for creators who mean business. We help creators grow and monetize their audience with ease. For coaches, YouTubers, authors, podcasters, and other creatives, there isn’t a better marketing hub to rely on to grow audiences, automate email marketing, and sell digital products - all within one platform. More importantly, there isn’t a team more committed to helping creators earn a living.&lt;/p&gt;\n&lt;p&gt;We’re on a mission to help creators earn $1 billion using our creator marketing platform. We have always been 100% independent and 100% remote. We are proud to have built a product that our customers love, and we look for people who have enthusiasm and belief in our mission, vision, and values to join our team.&lt;/p&gt;\n&lt;p&gt;The Kit culture is one where emotional intelligence is valued, radical candor is encouraged, and where everyone works together to uphold a set of shared team principles.&lt;/p&gt;\n&lt;hr&gt;\n&lt;p&gt;&amp;nbsp;&lt;/p&gt;\n&lt;/div&gt;&lt;/div&gt;&lt;h4&gt;&lt;strong&gt;The role&amp;nbsp;&lt;/strong&gt;&lt;/h4&gt;\n&lt;p&gt;We’re hiring a &lt;strong&gt;Senior Product Designer&lt;/strong&gt; for the Analytics, Compliance, and Security team. You will lead the design of new analytics and reporting functionality, which is critical for customer satisfaction and retention.&lt;/p&gt;\n&lt;p&gt;We’re looking for a well-rounded product designer with strong skills in visual design, interaction design, product analysis and user research. A background in data visualization design will be especially beneficial for this role.&lt;/p&gt;\n&lt;p&gt;As part of our product design team, you’ll report to the Director of Product Design and will be the fourth member of our product design team. You will work closely with your product squad—a product manager, an engineering manager, and 5 to 8 engineers—to help shape the future of our platform.&lt;/p&gt;\n&lt;h4&gt;&lt;strong&gt;Responsibilities&lt;/strong&gt;&lt;/h4&gt;\n&lt;p&gt;As a Senior Product Designer, you will:&amp;nbsp;&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;Own the end-to-end design process for your squad, from problem discovery to research, iteration, and final implementation.&lt;/li&gt;\n&lt;li&gt;Analyse user behaviour using Mixpanel and identify opportunities to improve product engagement and retention.&lt;/li&gt;\n&lt;li&gt;Take the lead on discovery and research by talking to customers, reviewing survey insights, and facilitating usability testing—we don’t have dedicated researchers.&lt;/li&gt;\n&lt;li&gt;Define and implement research processes for your team, including user testing plans, validation frameworks, and structured feedback loops.&lt;/li&gt;\n&lt;li&gt;Create high-fidelity prototypes and production-ready designs in Figma, ensuring alignment with Kit’s design system.&lt;/li&gt;\n&lt;li&gt;Collaborate closely with PMs and engineers to ensure design decisions are well-informed, feasible, and drive measurable impact.&lt;/li&gt;\n&lt;li&gt;Help shape the design culture at Kit by improving workflows, documentation, and cross-functional collaboration practices.&lt;/li&gt;\n&lt;li&gt;Advocate for a more structured approach to design by introducing best practices for validation, usability testing, and iterative improvements.&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;&lt;strong&gt;Requirements&lt;/strong&gt;&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;A track record of delivering impactful solutions on complex web applications.&amp;nbsp;&lt;/li&gt;\n&lt;li&gt;Experience connecting their work to product metrics and business goals.&amp;nbsp;&lt;/li&gt;\n&lt;li&gt;5+ years of experience as a product designer working on SaaS applications or other complex web-based software.&lt;/li&gt;\n&lt;li&gt;A portfolio that demonstrates how your design decisions were informed by research or data insights and the impact they had on user experience &lt;em&gt;and&lt;/em&gt;or business outcomes.&amp;nbsp;&lt;/li&gt;\n&lt;li&gt;Experience facilitating workshops, brainstorming and scope refinement sessions, etc. and working closely with product managers and engineers to align design solutions with business and user needs.&lt;/li&gt;\n&lt;li&gt;Proficiency in Figma and working with and contributing to an established design system.&lt;/li&gt;\n&lt;li&gt;Experience conducting user research activities such as interviews, usability testing, and surveys to inform design decisions.&lt;/li&gt;\n&lt;li&gt;Experience using analytics tools (such as Mixpanel, FullStory, or similar) to identify usability issues and measure the impact of design changes.&lt;/li&gt;\n&lt;li&gt;Excellent time management skills with the ability to prioritize your workload effectively to deliver high-quality work on time with minimal supervision.&lt;/li&gt;\n&lt;li&gt;Strong communication and collaboration skills with the ability to effectively articulate design concepts and rationale to stakeholders at all levels.&amp;nbsp;&lt;/li&gt;\n&lt;li&gt;A few hours of overlap with EST. Whilst we try to keep scheduled meetings to a minimum, for this role, it’s essential you attend planning and retro meetings with your colleagues. Typically, these will occur between 9am to 2pm EST.&lt;/li&gt;\n&lt;/ul&gt;\n&lt;h4&gt;&lt;strong&gt;Benefits Section&lt;/strong&gt;&amp;nbsp;&lt;/h4&gt;\n&lt;p&gt;Kit has standardized salaries based on position, no matter where you live. For this role, we’re hiring at a Level 4 ($169,000). The level is determined based on experience and our interview process.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Perks + benefits include:&lt;/strong&gt;&lt;/p&gt;\n&lt;ul&gt;\n&lt;li data-stringify-indent=&quot;0&quot; data-stringify-border=&quot;0&quot;&gt;\n&lt;div&gt;&lt;a class=&quot;c-link&quot; href=&quot;https://www.linkedin.com/posts/nathanbarry_convertkit-compensation-model-activity-6991414959247147008-i9V3/?utm_source=share&amp;amp;utm_medium=member_desktop&quot; target=&quot;_blank&quot; data-stringify-link=&quot;https://www.linkedin.com/posts/nathanbarry_convertkit-compensation-model-activity-6991414959247147008-i9V3/?utm_source=share&amp;amp;utm_medium=member_desktop&quot; data-sk=&quot;tooltip_parent&quot;&gt;Profit Sharing&lt;/a&gt;&lt;/div&gt;\n&lt;/li&gt;\n&lt;li data-stringify-indent=&quot;0&quot; data-stringify-border=&quot;0&quot;&gt;Kit equity&lt;/li&gt;\n&lt;li data-stringify-indent=&quot;0&quot; data-stringify-border=&quot;0&quot;&gt;401k with a 5% match&lt;/li&gt;\n&lt;li&gt;We cover up to $1,950 per month toward medical premiums, with dental and vision premiums fully covered. We offer Health Insurance plans through Aetna.&lt;/li&gt;\n&lt;li data-stringify-indent=&quot;0&quot; data-stringify-border=&quot;0&quot;&gt;$4,000 equipment allowance for your first two years, $3,000 budget every following two years&lt;/li&gt;\n&lt;li data-stringify-indent=&quot;0&quot; data-stringify-border=&quot;0&quot;&gt;Individual learning + development budget ($3,500/year)&lt;/li&gt;\n&lt;li data-stringify-indent=&quot;0&quot; data-stringify-border=&quot;0&quot;&gt;Gender affirming benefits&lt;/li&gt;\n&lt;li data-stringify-indent=&quot;0&quot; data-stringify-border=&quot;0&quot;&gt;Childcare benefit up to $3,000 annually&lt;/li&gt;\n&lt;li data-stringify-indent=&quot;0&quot; data-stringify-border=&quot;0&quot;&gt;Twenty (20) days of paid time off during each year of employment&lt;/li&gt;\n&lt;li data-stringify-indent=&quot;0&quot; data-stringify-border=&quot;0&quot;&gt;Paid paid vacation: An after-tax bonus of $1,000 for taking five consecutive days of vacation where you’re fully unplugged from work&lt;/li&gt;\n&lt;li data-stringify-indent=&quot;0&quot; data-stringify-border=&quot;0&quot;&gt;Ten (10) paid holidays a year&lt;/li&gt;\n&lt;li data-stringify-indent=&quot;0&quot; data-stringify-border=&quot;0&quot;&gt;Two weeks of paid sick time each year, including mental health + well being days&lt;/li&gt;\n&lt;li data-stringify-indent=&quot;0&quot; data-stringify-border=&quot;0&quot;&gt;Twelve (12) weeks paid parental leave and flexible scheduling in your child’s first year&lt;/li&gt;\n&lt;li data-stringify-indent=&quot;0&quot; data-stringify-border=&quot;0&quot;&gt;Up to six weeks of paid bereavement leave, medical leave, and disaster after six months of employment, two weeks of each paid leave in your first six months&lt;/li&gt;\n&lt;li data-stringify-indent=&quot;0&quot; data-stringify-border=&quot;0&quot;&gt;Winter Break Closure: Kit closes for a week at the end of December, giving everyone a collective break to enjoy the holiday season.&amp;nbsp;&lt;em data-stringify-type=&quot;italic&quot;&gt;Essential support services remain available, with teams coordinating to ensure coverage during this period&lt;/em&gt;&lt;/li&gt;\n&lt;li data-stringify-indent=&quot;0&quot; data-stringify-border=&quot;0&quot;&gt;Four-week, paid sabbatical after five years with the team&lt;/li&gt;\n&lt;li&gt;Fantastic in-person or virtual retreats with the team twice a year&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;&amp;nbsp;&lt;/p&gt;\n&lt;h4&gt;&lt;strong&gt;How to Apply&lt;/strong&gt;&lt;/h4&gt;\n&lt;p&gt;We usually receive a large number of applications, and our goal is to follow up with you within two weeks. You’ll hear from us either way. Here’s what you can expect from the rest of our hiring process:&lt;/p&gt;\n&lt;ol&gt;\n&lt;li data-stringify-indent=&quot;0&quot; data-stringify-border=&quot;0&quot;&gt;Portfolio review&lt;/li&gt;\n&lt;li data-stringify-indent=&quot;0&quot; data-stringify-border=&quot;0&quot;&gt;30 min - Recruiter screen&lt;/li&gt;\n&lt;li data-stringify-indent=&quot;0&quot; data-stringify-border=&quot;0&quot;&gt;45 min - Hiring Manager screen&lt;/li&gt;\n&lt;li data-stringify-indent=&quot;0&quot; data-stringify-border=&quot;0&quot;&gt;60 min - Project presentation with the team&lt;/li&gt;\n&lt;li data-stringify-indent=&quot;0&quot; data-stringify-border=&quot;0&quot;&gt;60 min - Culture Contribution Chat&lt;/li&gt;\n&lt;li data-stringify-indent=&quot;0&quot; data-stringify-border=&quot;0&quot;&gt;Take-home test&lt;/li&gt;\n&lt;li data-stringify-indent=&quot;0&quot; data-stringify-border=&quot;0&quot;&gt;30 min- Wrap up with the Hiring Manager&lt;/li&gt;\n&lt;li data-stringify-indent=&quot;0&quot; data-stringify-border=&quot;0&quot;&gt;Reference Checks&lt;/li&gt;\n&lt;/ol&gt;\n&lt;p&gt;We’ll keep you informed through every step. To get started, complete this application, including a cover letter and answers to the questions on the next page. We read every single application, and your cover letter and responses help put your experience into context.&lt;/p&gt;&lt;div class=&quot;content-conclusion&quot;&gt;&lt;hr&gt;\n&lt;p&gt;&amp;nbsp;&lt;/p&gt;\n&lt;p&gt;Kit is an equal opportunity employer. We value diversity in all of its forms, and we hire the best person we can for each role, no matter your personal background. Research tells us that applicants who are female or non-binary, as well as applicants who are people of color, are less likely to apply for roles they do not feel 100% qualified for. If you think you meet more than 50% of our requirements but fewer than 100% of them, please apply. We’re imperfect communicators, so think of our job postings as the starting point for discussion rather than proof that you shouldn’t apply.&lt;/p&gt;\n&lt;p&gt;Kit does not discriminate on the basis of race, sex, color, religion, age, national origin, marital status, disability, veteran status, genetic information, sexual orientation, gender identity or any other reason prohibited by law in provision of employment opportunities and benefits.&lt;/p&gt;&lt;/div&gt;","tags":"[\"management\",\"engineering\"]","pubDate":"2025-03-24T19:51:54.000Z","link":"https://job-boards.greenhouse.io/kit/jobs/4687534007","slug":"senior-product-designer-kit-9029"},{"id":9489418896,"title":"Risk Solutions Consultant","company":"Sardine","image":"https://avatars.githubusercontent.com/u/65879301?s=200&v=4","description":"<p style=\"min-height:1.5em\"><strong>Who we are:</strong></p><p style=\"min-height:1.5em\">We are a leader in fraud prevention and AML compliance. Our platform uses device intelligence, behavior biometrics, machine learning, and AI to stop fraud before it happens. Today, over 300 banks, retailers, and fintechs worldwide use Sardine to stop identity fraud, payment fraud, account takeovers, and social engineering scams. We have raised $145M from world-class investors, including Andreessen Horowitz, Activant, Visa, Experian, FIS, and Google Ventures.</p><p style=\"min-height:1.5em\"></p><p style=\"min-height:1.5em\"><strong>Our culture:</strong></p><ul style=\"min-height:1.5em\"><li><p style=\"min-height:1.5em\">We have hubs in the Bay Area, NYC, Austin, and Toronto. However, we maintain a remote-first work culture. #WorkFromAnywhere</p></li><li><p style=\"min-height:1.5em\">We hire talented, self-motivated individuals with extreme ownership and high growth orientation. </p></li><li><p style=\"min-height:1.5em\">We value performance and not hours worked. We believe you shouldn't have to miss your family dinner, your kid's school play, friends get-together, or doctor's appointments for the sake of adhering to an arbitrary work schedule.</p></li></ul><p style=\"min-height:1.5em\"></p><p style=\"min-height:1.5em\">As a <strong>Risk Solutions Consultant</strong> at Sardine, you will design and implement scalable, secure solutions to address fraud prevention, compliance, and transaction risk challenges. You will leverage your deep expertise in fraud prevention to understand client needs, conduct proof-of-concepts, and provide strategic recommendations. Your work will directly impact our clients' ability to protect their businesses from evolving fraud threats.</p><p style=\"min-height:1.5em\"></p><p style=\"min-height:1.5em\"><strong>What You’ll be Doing:</strong></p><ul style=\"min-height:1.5em\"><li><p style=\"min-height:1.5em\">Engage directly with clients to understand their unique fraud prevention challenges, acting as a trusted advisor to provide expert guidance on Sardine's innovative solutions.</p></li><li><p style=\"min-height:1.5em\">Collaborate with clients to craft bespoke fraud prevention strategies, developing compelling proposals and presentations that address their specific needs.</p></li><li><p style=\"min-height:1.5em\">Lead POCs alongside Sardine’s Data Analyst Team, showcasing the effectiveness of our solutions. Analyze results to provide actionable implementation recommendations.</p></li><li><p style=\"min-height:1.5em\">Dive deep into data to uncover fraud patterns and trends, conducting investigations that support client inquiries and enhance solution optimization.</p></li><li><p style=\"min-height:1.5em\">Maintain an in-depth understanding of Sardine's cutting-edge fraud prevention products.</p></li><li><p style=\"min-height:1.5em\">Stay ahead of industry trends and best practices, collaborating with product teams to identify gaps and drive continuous improvement.</p></li><li><p style=\"min-height:1.5em\">Work seamlessly with product, engineering, and sales teams to ensure the flawless delivery of solutions. Provide insightful feedback to the product team to fuel ongoing innovation.</p><p style=\"min-height:1.5em\"></p></li></ul><p style=\"min-height:1.5em\"><strong>What You’ll Need:</strong></p><ul style=\"min-height:1.5em\"><li><p style=\"min-height:1.5em\">8+ years of experience in Solution Consulting, Sales Engineering, Product Management, or Business Analysis within the Fraud Prevention domain.</p></li><li><p style=\"min-height:1.5em\">Client-facing experience at a fraud technology company designing solutions for financial institutions, e-commerce merchants, fintechs, marketplaces, etc.</p></li><li><p style=\"min-height:1.5em\">Proven experience as a Subject Matter Expert (SME) in fraud prevention.</p></li><li><p style=\"min-height:1.5em\">Strong understanding of fraud prevention techniques and technologies.</p></li><li><p style=\"min-height:1.5em\">Ability to design and implement complex fraud prevention solutions.</p></li><li><p style=\"min-height:1.5em\">Strong ability to communicate complex fraud concepts to both technical and non-technical audiences, including executives.</p></li><li><p style=\"min-height:1.5em\">Ability to work effectively with internal teams (Sales, Product, Customer Success) and external stakeholders (clients, partners).</p></li><li><p style=\"min-height:1.5em\">Experience conducting POCs and presenting results.</p></li><li><p style=\"min-height:1.5em\">Strong analytical and problem-solving skills.</p></li></ul><p style=\"min-height:1.5em\"><strong>Nice to Have:</strong></p><ul style=\"min-height:1.5em\"><li><p style=\"min-height:1.5em\">Understanding of AML/Compliance.</p></li><li><p style=\"min-height:1.5em\">Experience working at a merchant, bank, or fintech.</p></li></ul><p style=\"min-height:1.5em\"></p><p style=\"min-height:1.5em\">The compensation offered for this role will depend on various factors, including the candidate's location, qualifications, work history, and interview performance, and may differ from the stated range.</p><p style=\"min-height:1.5em\"></p><p style=\"min-height:1.5em\"><strong>Benefits we offer:</strong></p><ul style=\"min-height:1.5em\"><li><p style=\"min-height:1.5em\">Generous compensation in cash and equity</p></li><li><p style=\"min-height:1.5em\">Early exercise for all options, including pre-vested</p></li><li><p style=\"min-height:1.5em\">Work from anywhere: Remote-first Culture</p></li><li><p style=\"min-height:1.5em\">Flexible paid time off, Year-end break, Self care days off</p></li><li><p style=\"min-height:1.5em\">Health insurance, dental, and vision coverage for employees and dependents - <em>US and Canada specific</em></p></li><li><p style=\"min-height:1.5em\">4% matching in 401k / RRSP - <em>US and Canada specific</em></p></li><li><p style=\"min-height:1.5em\">MacBook Pro delivered to your door</p></li><li><p style=\"min-height:1.5em\">One-time stipend to set up a home office — desk, chair, screen, etc.</p></li><li><p style=\"min-height:1.5em\">Monthly meal stipend</p></li><li><p style=\"min-height:1.5em\">Monthly social meet-up stipend</p></li><li><p style=\"min-height:1.5em\">Annual health and wellness stipend</p></li><li><p style=\"min-height:1.5em\">Annual Learning stipend</p></li><li><p style=\"min-height:1.5em\">Unlimited access to an expert financial advisory</p></li></ul><p style=\"min-height:1.5em\"></p><p style=\"min-height:1.5em\">Join a fast-growing company with world-class professionals from around the world. If you are seeking a meaningful career, you found the right place, and we would love to hear from you.</p>","tags":"[\"management\",\"engineering\"]","pubDate":"2025-03-24T19:50:42.827Z","link":"https://jobs.ashbyhq.com/sardine/cd0b1a96-c529-4ab6-adad-85dd5b1e9759","slug":"risk-solutions-consultant-sardine-8285"},{"id":1100728344,"title":"Senior Sales Operations Manager","company":"Airalo","image":"https://lever-client-logos.s3.us-west-2.amazonaws.com/55028a36-609c-479c-9553-d4689ff2dd8c-1669620566663.png","description":"<div><b>About Airalo</b></div><div>Alo! Airalo is the world’s first eSIM store that helps people connect in over 200+ countries and regions across the globe. We are building the next digital service that revolutionizes the telecom industry. We are a travel-tech company and an equal-opportunity environment that values and executes diversity, inclusion, and equity. Our team is spread across 50+ countries and six continents. What glues us together is our commitment to changing the way you connect<span style=\"font-size: 13.3333px\">. </span></div><div><br></div><div><b>About you</b></div><div>We hope that you care deeply about the quality of your work, the intrinsic worth of tasks, and the success of your team. You are self-disciplined and do not require micromanagement in terms of your skillset and work ethic. You do your best to flourish as an individual every day while working hard to foster a collaborative team environment. You believe in the importance of being — and staying — authentic, honest, positive, and kind. You are a good interlocutor with clear and concise communication. You are able to manage multiple projects, have an analytical mind, pay keen attention to detail, and love to get your hands dirty. You are cognizant, tolerant, and welcoming of vulnerabilities and cultural differences.</div><div><br></div><div><b>About the Role</b></div><div><b>Position</b>: Full-time / Employee</div><div><b>Location:</b>&nbsp;Remote-first </div><div><b>Benefits:</b>&nbsp;Health Insurance, work-from-anywhere stipend, annual wellness &amp; learning credits, annual all-expenses-paid company retreat in a gorgeous destination &amp; other benefits</div><div><br></div><div><span style=\"font-size: 10.5pt;\">Airalo is looking for a Senior Sales Operations Manager to drive operational excellence within our Partnerships team. This role, Airalo’s first Sales Ops position, involves owning and optimizing our CRM, managing the sales pipeline lifecycle, and collaborating with data teams to integrate revenue reporting. You'll establish best practices and drive efficiency across our global B2B sales operations.</span></div><h3>Responsibilities include but are not limited to:</h3><li>Responsible for the ownership of the CRM and its processes&nbsp;</li><li>Ability to analyze the complex dataset and current sales process workflows to come up with overall business impact and derive improved solution design for GTM</li><li>Collaborat with the Partnerships teams to improve sales processes (pipeline, forecasting, opportunity management, approval workflows, splits, commissions, partnership workflows)&nbsp;</li><li>Work closely with multiple stakeholders across Partnerships, Marketing, Finance etc&nbsp;Identify and improve processes to deliver effective, scalable solutions. </li><li>Drive cross-functional collaboration to implement these changes and ensure they deliver value to business</li><li>Develop and manage the full global end-to-end quote and booking process, partner ecosystem</li><li>Efficiently manage and prioritize projects and the requirements, ensuring alignment with broader business objectives and timely resolution of issues. Coordinate with relevant stakeholders to maintain focus on high-impact initiatives</li><li>Understand compensation, forecasting models and consumption based booking data models and identify key bottlenecks and opportunities for improvement</li><li>Support the Sales team to address their questions &amp; issues, gather feedback, and provide resolution and insights</li><li>Generate and distribute regular reports with actionable insights, empowering senior leaders and sales teams to make informed strategic choices</li><li>Cultivate and maintain strong relationships with key stakeholders across departments to ensure alignment on objectives, priorities, and outcomes. </li>,<h3>Must Haves:</h3><li>Bachelor’s degree &amp; 5+ years Experience in Sales Operations/Revenue Operations</li><li>Candidates must have a proven track record of effectively managing CRM and pipeline management systems in <b>Hubspot</b> and <b>Salesforce</b> in a professional setting</li><li>Adaptable to changing priorities with experience of working in fast paced environments</li><div><br></div><div><u>Project &amp; Process Management:</u></div><li>Proven ability to manage and lead projects effectively and produce comprehensive documentationAbility to understand &amp; create business processes through workflow diagrams and translate them into actionable solutions</li><div><br></div><div><u>Technical Skills:</u></div><li>Proficient with <b>Hubspot</b>,&nbsp; including custom configurations, API integrations, and complex workflow automation. Proven ability to create insightful reports, implement partner segmentation, partner management and develop revenue forecasts within HubSpot.</li><li>Strong data analysis skills, with proficiency in extracting and interpreting insights from CRM data. Experience with data visualization tools like QuickSight or Looker Studio preferred.</li><li>Hands-on experience on working with large datasets.</li><li>Experience in SQL/SOQL is preferred.</li><li>Proficient in sales funnels, deal stages, and lead generation, with strong CRM data analysis skills. </li><li>Experience with QuickSight or Looker Studio for insightful reporting and dashboard creation is preferred.</li><div><span style=\"font-size: 10.5pt;\">If you are interested in this position, please apply via the link.</span></div><div><br></div><div>We sincerely thank all applicants in advance for submitting their interest in this opportunity. Airalo is an equal opportunity employer and values diversity, equity &amp; inclusion. We do not discriminate on the basis of race, religion, national origin, gender, sexual orientation, age, marital status, veteran status, or disability status. We are committed to providing reasonable accommodations upon request for individuals with disabilities throughout our job interview process.</div>","tags":"[\"finance\",\"management\",\"b2b\"]","pubDate":"2025-03-24T19:40:34.623Z","link":"https://jobs.lever.co/airalo/fca3225e-3712-47c8-a664-6278ee676c4f","slug":"senior-sales-operations-manager-airalo-7785"},{"id":8874023949,"title":"Customer Success Engineer, APAC","company":"Fingerprint","image":"https://avatars.githubusercontent.com/u/67208791?s=200&v=4","description":"&lt;div class=&quot;content-intro&quot;&gt;&lt;p&gt;&lt;strong&gt;Fingerprint&lt;/strong&gt;&amp;nbsp;empowers developers to stop online fraud at the source.&lt;/p&gt;\n&lt;p&gt;We work on turning radical new ideas in the fraud detection space into reality. Our products are developer-focused and our clients range from solo developers to publicly traded companies.&amp;nbsp;&lt;strong&gt;We are a globally dispersed, 100% remote company&lt;/strong&gt; with a strong open-source focus. Our flagship open-source project is &lt;a class=&quot;c-link c-link--focus-visible&quot; href=&quot;https://github.com/fingerprintjs/fingerprintjs&quot; target=&quot;_blank&quot; data-stringify-link=&quot;https://github.com/fingerprintjs/fingerprintjs&quot; data-sk=&quot;tooltip_parent&quot;&gt;FingerprintJS&lt;/a&gt; (20K stars on GitHub).&lt;/p&gt;\n&lt;p&gt;&lt;a class=&quot;c-link c-link--focus-visible&quot; href=&quot;https://www.crunchbase.com/organization/fingerprintjs&quot; target=&quot;_blank&quot; data-stringify-link=&quot;https://www.crunchbase.com/organization/fingerprintjs&quot; data-sk=&quot;tooltip_parent&quot;&gt;We have raised $77M&amp;nbsp;&lt;/a&gt;and are backed by Craft Ventures (previously invested in&amp;nbsp;&lt;a class=&quot;c-link c-link--focus-visible&quot; href=&quot;https://www.tesla.com/&quot; target=&quot;_blank&quot; data-stringify-link=&quot;https://www.tesla.com/&quot; data-sk=&quot;tooltip_parent&quot;&gt;Tesla,&amp;nbsp;&lt;/a&gt;&lt;a class=&quot;c-link c-link--focus-visible&quot; href=&quot;https://facebook.com/&quot; target=&quot;_blank&quot; data-stringify-link=&quot;https://facebook.com/&quot; data-sk=&quot;tooltip_parent&quot;&gt;Facebook,&amp;nbsp;&lt;/a&gt;&lt;a class=&quot;c-link c-link--focus-visible&quot; href=&quot;https://www.airbnb.com/&quot; target=&quot;_blank&quot; data-stringify-link=&quot;https://www.airbnb.com/&quot; data-sk=&quot;tooltip_parent&quot;&gt;Airbnb&amp;nbsp;&lt;/a&gt;), Nexus Venture Partners (previously invested in &lt;a href=&quot;https://www.postman.com/&quot;&gt;Postman&lt;/a&gt;, &lt;a href=&quot;https://www.apollo.io/&quot;&gt;Apollo.io,&lt;/a&gt; &lt;a href=&quot;https://min.io/&quot;&gt;MinIO&lt;/a&gt;, Druva)&amp;nbsp;and Uncorrelated Ventures (previously invested in&amp;nbsp;&lt;a class=&quot;c-link c-link--focus-visible&quot; href=&quot;https://redis.io/&quot; target=&quot;_blank&quot; data-stringify-link=&quot;https://redis.io/&quot; data-sk=&quot;tooltip_parent&quot;&gt;Redis,&amp;nbsp;&lt;/a&gt;&lt;a class=&quot;c-link c-link--focus-visible&quot; href=&quot;https://rollbar.com/&quot; target=&quot;_blank&quot; data-stringify-link=&quot;https://rollbar.com/&quot; data-sk=&quot;tooltip_parent&quot;&gt;Rollbar&amp;nbsp;&lt;/a&gt;&amp;amp;&lt;a class=&quot;c-link c-link--focus-visible&quot; href=&quot;https://gradle.org/&quot; target=&quot;_blank&quot; data-stringify-link=&quot;https://gradle.org/&quot; data-sk=&quot;tooltip_parent&quot;&gt;&amp;nbsp;Gradle&lt;/a&gt;).&lt;/p&gt;\n&lt;p&gt;&lt;em&gt;We have noticed a rise in recruiting impersonations across the industry, where scammers attempt to access candidates&#39; personal and financial information through fake interviews and offers. All Fingerprint recruiting email communications will always come from the @fingerprint.com domain. Any outreach claiming to be from Fingerprint via other sources should be ignored.&lt;/em&gt;&lt;/p&gt;\n&lt;p&gt;&amp;nbsp;&lt;/p&gt;\n&lt;hr&gt;\n&lt;p&gt;&amp;nbsp;&lt;/p&gt;\n&lt;p&gt;&amp;nbsp;&lt;/p&gt;\n&lt;p&gt;&amp;nbsp;&lt;/p&gt;&lt;/div&gt;&lt;p&gt;We are seeking an experienced and dynamic Customer Success Engineer to join our team. In this role, you will be the technical point of contact for our enterprise customers, ensuring they receive maximum value from our products and services. You will collaborate closely with our Customer Success Managers, Sales, Product, and Engineer teams to deliver tailored solutions that meet the unique needs of our most strategic clients. Your ability to understand customer challenges, provide technical guidance, and drive successful product adoption will be critical to the long-term success of our customers and our company.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Key Responsibilities:&lt;/strong&gt;&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;&lt;strong&gt;Technical Expertise:&lt;/strong&gt; Act as the primary technical resource for our customers, providing expert guidance on the deployment, integration, and optimization of our products.&lt;/li&gt;\n&lt;li&gt;&lt;strong&gt;Customer Onboarding:&lt;/strong&gt; Lead the technical onboarding process for new strategic customers, ensuring a smooth and efficient setup that meets their specific requirements and goals.&lt;/li&gt;\n&lt;li&gt;&lt;strong&gt;Ongoing Support:&lt;/strong&gt; Provide ongoing technical support and troubleshooting to enterprise clients, addressing their concerns promptly and effectively.&lt;/li&gt;\n&lt;li&gt;&lt;strong&gt;Customer Advocacy:&lt;/strong&gt; Serve as the voice of the customer within the company, advocating for their needs and working with internal teams to ensure customer satisfaction.&lt;/li&gt;\n&lt;li&gt;&lt;strong&gt;Product Adoption:&lt;/strong&gt; Work closely with customers to drive product adoption, ensuring they fully leverage our solutions to meet their business goals.&lt;/li&gt;\n&lt;li&gt;&lt;strong&gt;Training and Enablement:&lt;/strong&gt; Conduct training sessions and workshops to educate customers on best practices and new features, empowering them to use our products effectively.&lt;/li&gt;\n&lt;li&gt;&lt;strong&gt;Feedback Loop:&lt;/strong&gt; Gather customer feedback on product performance and feature requests, collaborating with the product team to influence the product roadmap.&lt;/li&gt;\n&lt;li&gt;&lt;strong&gt;Relationship Management:&lt;/strong&gt; Build and maintain strong relationships with key stakeholders within enterprise accounts, acting as a trusted advisor and partner.&lt;/li&gt;\n&lt;li&gt;&lt;strong&gt;Reporting:&lt;/strong&gt; Monitor customer health metrics, usage data, and satisfaction levels, providing regular reports to internal teams and clients.&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;&amp;nbsp;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Qualifications:&lt;/strong&gt;&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;&lt;strong&gt;Experience:&lt;/strong&gt; 3+ years of experience in a customer-facing role, preferably as a Customer Success Engineer or Technical Support Engineer, with a focus on API products.&lt;/li&gt;\n&lt;li&gt;&lt;strong&gt;Location:&amp;nbsp;&lt;/strong&gt;Must be based in India&lt;/li&gt;\n&lt;li&gt;&lt;strong&gt;Technical Skills:&lt;/strong&gt; Strong technical acumen with experience in JavaScript, with a demonstrated ability to create and maintain automation scripts, RESTful architecture, SQL and web services.&lt;/li&gt;\n&lt;li&gt;Knowledge of cloud computing, APIs, and enterprise-level integrations is highly desirable.&lt;/li&gt;\n&lt;li&gt;&lt;strong&gt;Problem-Solving:&lt;/strong&gt; Exceptional troubleshooting skills with the ability to diagnose and resolve complex technical issues.&lt;/li&gt;\n&lt;li&gt;&lt;strong&gt;Communication:&lt;/strong&gt; Excellent communication skills, both verbal and written, with the ability to convey technical concepts to non-technical stakeholders.&lt;/li&gt;\n&lt;li&gt;&lt;strong&gt;Customer Focus:&lt;/strong&gt; Demonstrated ability to understand customer needs and deliver solutions that drive success.&lt;/li&gt;\n&lt;li&gt;&lt;strong&gt;Collaboration:&lt;/strong&gt; Proven ability to work cross-functionally with sales, product, and engineering teams to achieve common goals.&lt;/li&gt;\n&lt;li&gt;&lt;strong&gt;Education:&lt;/strong&gt; Bachelor’s degree in Computer Science, Engineering, or a related field is preferred.&lt;/li&gt;\n&lt;li&gt;&lt;strong&gt;Certifications:&lt;/strong&gt; Relevant certifications are a plus.&lt;/li&gt;\n&lt;/ul&gt;&lt;div class=&quot;content-conclusion&quot;&gt;&lt;p&gt;&lt;em&gt;We have noticed a rise in recruiting impersonations across the industry, where scammers attempt to access candidates&#39; personal and financial information through fake interviews and offers. All Fingerprint recruiting email communications will always come from the @fingerprint.com domain. Any outreach claiming to be from Fingerprint via other sources should be ignored.&lt;/em&gt;&lt;/p&gt;\n&lt;p&gt;Offers vary depending on, but not limited to, relevant experience, education, certifications/licenses, skills, training, and market conditions.&amp;nbsp;&lt;/p&gt;\n&lt;p&gt;Due to regulatory and security reasons, there’s a small number of countries where we cannot have Fingerprint teammates based.&amp;nbsp;&lt;strong data-stringify-type=&quot;bold&quot;&gt;Additionally, because Fingerprint is an all-remote company and people can join our workforce from almost any country, we do not sponsor visas. Fingerprint teammates need to be authorized to work from their home location&lt;/strong&gt;.&lt;/p&gt;\n&lt;p&gt;We are dedicated to creating an inclusive work environment for everyone. We embrace and celebrate the unique experiences, perspectives and cultural backgrounds that each employee brings to our workplace. Fingerprint strives to foster an environment where our employees feel respected, valued and empowered, and our team members are at the forefront in helping us promote and sustain an inclusive workplace. We highly encourage people from underrepresented groups in tech to apply.&lt;/p&gt;\n&lt;p&gt;If you are applying as a resident of California, please read our CCPA notice &lt;a href=&quot;https://dev.fingerprint.com/docs/dpa-ccpa&quot; target=&quot;_blank&quot;&gt;here&lt;/a&gt;&lt;/p&gt;\n&lt;p&gt;If you are applying as a resident of the EU, please read our GDPR notice &lt;a href=&quot;https://dev.fingerprint.com/docs/dpa-gdpr&quot; target=&quot;_blank&quot;&gt;here&lt;/a&gt;&lt;/p&gt;&lt;/div&gt;","tags":"[\"javascript\",\"management\",\"engineering\"]","pubDate":"2025-03-24T17:57:37.000Z","link":"https://fingerprint.com/careers/jobs/apply/?gh_jid=5482949004","slug":"customer-success-engineer-apac-fingerprint-186"},{"id":3716895717,"title":"Treasury Analyst (Remote - Work from Anywhere)","company":"Xapo Bank","image":"https://avatars.githubusercontent.com/u/6930305?s=200&v=4","description":"&lt;div class=&quot;content-intro&quot;&gt;&lt;p style=&quot;text-align: left;&quot;&gt;&lt;span style=&quot;font-weight: 900;&quot;&gt;Work from anywhere, impact everywhere&amp;nbsp;&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;Diversity is at the heart of who we are at Xapo Bank. We’re a fully distributed team of over 140 Xapiens that work remotely from 40+ countries around the world.&amp;nbsp;&lt;/p&gt;\n&lt;p&gt;Our beginning: A world that enjoys economic freedom and wealth protection, no matter where you live or who is running your country. This is the dream that drove Wences Casares, our Founder and Chairman, to quietly transform the world of banking.&lt;/p&gt;\n&lt;p&gt;To achieve that, we search the world for the best people for the job. We work hard, think globally, and inspire each other to learn and grow. We are committed to changing the way things are done.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Risk is inherent in all of our business activities and managing risk well is the responsibility of every Xapien. Sound risk management enables us to serve our customers and deliver value for our shareholders, and helps make Xapo a great place to work.&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&amp;nbsp;&lt;/p&gt;\n&lt;p style=&quot;text-align: left;&quot;&gt;&lt;em&gt;&lt;span style=&quot;font-weight: 500;&quot;&gt;Although we are headquartered in Gibraltar, this is a full time, 100% remote position&amp;nbsp;&lt;br&gt;&lt;/span&gt;&lt;/em&gt;&lt;em&gt;&lt;span style=&quot;font-weight: 500;&quot;&gt;Work from anywhere!&lt;/span&gt;&lt;/em&gt;&lt;/p&gt;\n&lt;p style=&quot;text-align: left;&quot;&gt;&amp;nbsp;&lt;/p&gt;&lt;/div&gt;&lt;p&gt;&lt;strong&gt;&lt;em&gt;Position overview&lt;/em&gt;&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;We are seeking a highly motivated and detail-oriented Treasury Analyst to join our Treasury team. This role will focus on supporting the team with management information, reporting, and daily treasury operations. The ideal candidate will possess strong analytical skills, a solid understanding of treasury functions, and the ability to work in a fast-paced environment.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;&lt;em&gt;Responsibilities&lt;/em&gt;&lt;/strong&gt;&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;Prepare and deliver accurate and timely management information (MI) and reporting to support decision-making.&lt;/li&gt;\n&lt;li&gt;Oversee and execute daily treasury operations, including cash management, liquidity monitoring, and payment processes.&lt;/li&gt;\n&lt;li&gt;Assist in the preparation of treasury-related reports for senior management.&lt;/li&gt;\n&lt;li&gt;Collaborate with internal teams (e.g., Finance, Accounting, Operations) to ensure data accuracy and alignment with reporting standards.&lt;/li&gt;\n&lt;li&gt;Identify opportunities to improve efficiency and automation in treasury operations and reporting.&lt;/li&gt;\n&lt;li&gt;Support ad-hoc treasury initiatives as required.&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;&lt;strong&gt;&lt;em&gt;Skills needed&lt;/em&gt;&lt;/strong&gt;&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;Attention to detail and a high level of accuracy in reporting.&lt;/li&gt;\n&lt;li&gt;Ability to manage multiple priorities and deliver under tight deadlines.&lt;/li&gt;\n&lt;li&gt;Excellent analytical and problem-solving abilities.&lt;/li&gt;\n&lt;li&gt;Advanced Excel skills and the ability to handle large datasets effectively.&lt;/li&gt;\n&lt;li&gt;Strong communication skills, with the ability to present information clearly and concisely.&lt;/li&gt;\n&lt;li&gt;Knowledge of financial instruments, foreign exchange, and hedging strategies.&lt;/li&gt;\n&lt;li&gt;Experience in process improvement and automation projects.&lt;/li&gt;\n&lt;li&gt;Understanding of regulatory frameworks related to treasury operations.&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;&lt;strong&gt;&lt;em&gt;Other requirements&lt;/em&gt;&lt;/strong&gt;&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;A dedicated workspace.&lt;/li&gt;\n&lt;li&gt;A reliable internet connection with the fastest speed possible in your area.&lt;/li&gt;\n&lt;li&gt;Devices and other essential equipment that meet minimal technical specifications.&lt;/li&gt;\n&lt;li&gt;Alignment with Our Values and the Xapo Values-Driven Leadership principles.&lt;/li&gt;\n&lt;/ul&gt;&lt;div class=&quot;content-conclusion&quot;&gt;&lt;p&gt;&lt;span style=&quot;font-size: 12pt;&quot;&gt;&lt;strong&gt;Why work for Xapo?&lt;/strong&gt;&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span style=&quot;font-weight: 500; font-size: 10pt;&quot;&gt;IMPACT GLOBALLY, WORK REMOTELY.&lt;/span&gt;&lt;/p&gt;\n&lt;ul&gt;\n&lt;li style=&quot;font-weight: 500;&quot;&gt;&lt;strong&gt;Shape the Future:&lt;/strong&gt;&lt;span style=&quot;font-weight: 500;&quot;&gt; Improve lives through cutting-edge technology, work 100% remotely from anywhere in the world.&lt;/span&gt;&lt;/li&gt;\n&lt;li style=&quot;font-weight: 500;&quot;&gt;&lt;strong&gt;Great work-life balance:&lt;/strong&gt;&lt;span style=&quot;font-weight: 500;&quot;&gt; &lt;/span&gt;&lt;span style=&quot;font-weight: 500;&quot;&gt;Build amazing things with a balance of autonomy and collaborative teamwork. Set your own work schedule and make use of a flexible PTO plan when you need to recharge.&lt;/span&gt;&lt;span style=&quot;font-weight: 500;&quot;&gt;&amp;nbsp;&lt;/span&gt;&lt;/li&gt;\n&lt;li style=&quot;font-weight: 500;&quot;&gt;&lt;strong&gt;Expect Excellence:&lt;/strong&gt;&lt;span style=&quot;font-weight: 500;&quot;&gt; Collaborate, learn, and grow with a high-performance team. Learn&lt;/span&gt;&lt;span style=&quot;font-weight: 500;&quot;&gt; how you learn best - from books to conferences, you’ll get a yearly budget for your individual learning and development goals.&lt;/span&gt;&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;&lt;strong&gt;At Xapo, we prioritize consumer protection and adhere to regulatory requirements by ensuring that all Xapiens are accountable for upholding principles of fair treatment, transparency, and ethical conduct in their interactions with customers and stakeholders.&lt;/strong&gt;&lt;/p&gt;&lt;/div&gt;","tags":"[\"finance\",\"management\"]","pubDate":"2025-03-24T13:33:52.000Z","link":"https://job-boards.greenhouse.io/xapo61/jobs/6509692003","slug":"treasury-analyst-remote-work-from-anywhere-xapo-bank-5715"},{"id":7813981432,"title":"Strategic Partnerships Manager, Africa (Loyalty & Fintech)","company":"Airalo","image":"https://lever-client-logos.s3.us-west-2.amazonaws.com/55028a36-609c-479c-9553-d4689ff2dd8c-1669620566663.png","description":"<div><b>About Airalo</b></div><div>Alo! Airalo is the world’s first eSIM store that helps people connect in over 200+ countries and regions across the globe. We are building the next digital service that revolutionizes the telecom industry. We are a travel-tech company and an equal-opportunity environment that values and executes diversity, inclusion, and equity. Our team is spread across 50+ countries and six continents. What glues us together is our commitment to changing the way you connect<span style=\"font-size: 13.3333px\">. </span></div><div><br></div><div><b>About you</b></div><div>We hope that you care deeply about the quality of your work, the intrinsic worth of tasks, and the success of your team. You are self-disciplined and do not require micromanagement in terms of your skillset and work ethic. You do your best to flourish as an individual every day while working hard to foster a collaborative team environment. You believe in the importance of being — and staying — authentic, honest, positive, and kind. You are a good interlocutor with clear and concise communication. You are able to manage multiple projects, have an analytical mind, pay keen attention to detail, and love to get your hands dirty. You are cognizant, tolerant, and welcoming of vulnerabilities and cultural differences.</div><div><br></div><div><b>About the Role</b></div><div><b>Position</b>: Full-time / Employee</div><div><b>Location:</b>&nbsp;Remote-first </div><div><b>Benefits:</b>&nbsp;Health Insurance, work-from-anywhere stipend, annual wellness &amp; learning credits, annual all-expenses-paid company retreat in a gorgeous destination &amp; other benefits</div><div><br></div><div><span style=\"font-size: 10.5pt\">As the Strategic Partnerships Manager - Loyalty &amp; Fintech, you will lead partnerships with medium to large businesses in Africa across Fintech/Loyalty and other adjacent industries to offer Airalo’s travel connectivity solutions to their end customers.</span></div><h3>Responsibilities include but are not limited to:</h3><li>Work closely with our Director of Partnerships and other team members in the department</li><li>Develop and execute comprehensive go-to-market strategies to Identify, prospect, and lead negotiations with key loyalty programs and fintech companies across Africa to establish strategic partnerships.</li><li>Develop and execute partnership strategies aligned with Airalo’s market penetration goals in the African region</li><li>Leverage deep understanding of the African loyalty and fintech landscapes to identify high-potential partners.</li><li>Tailor Airalo's partnership offerings to meet the specific needs of loyalty programs and fintech platforms in Africa</li><li>Onboard and provide ongoing support to new partners, ensuring successful integration into the Airalo partner community.</li><li>Cultivate and maintain strong relationships with key partners to maximize profitability and drive channel growth.</li><li>Conduct thorough competitive research and market analysis to refine Airalo’s partnership roadmap for the African market.</li><li>Maintain Airalo’s position as the preferred eSIM provider within the African loyalty and fintech sectors.</li><li>Collaborate with internal and external stakeholders to develop and execute successful partnership projects and initiatives.</li><li>Represent Airalo at relevant industry events and conferences, particularly those focused on African loyalty, fintech, and telecommunications</li><li>Own the Airalo Strategic Partnerships OKRs</li>,<h3>Must Haves:</h3><li>7+ years of proven experience in partnerships, sales, account management, or business development specifically within the loyalty and fintech sectors, operating in B2B and/or B2B2C environments.</li><li>Deep understanding of loyalty program mechanics, customer engagement strategies, and the intricacies of fintech integrations.</li><li>Demonstrated partner-first mentality, with a genuine passion for fostering successful, mutually beneficial relationships with loyalty and fintech stakeholders.</li><li>Ability to narrate a good story - Airalo’s unique story and the problem we solve for our users makes it a compelling partnership proposition</li><li>Proficiency in employing advanced sales techniques, including consultative selling, effective questioning, objection handling, and solution-oriented approaches, tailored to the loyalty and fintech industries.</li><li>Proven ability to develop thought leadership and establish credibility, building trust and rapport with key stakeholders in the loyalty and fintech ecosystems.</li><li>Ability to thrive in complex, matrixed environments, effectively managing multiple priorities and projects simultaneously.</li><li>Proficiency in utilizing sales and partnership management tools relevant to the loyalty and fintech sectors.</li><li>Perfect verbal and written communication skills in English</li><div><span style=\"font-size: 10.5pt\">If you are interested in this position, please apply via the link.</span></div><div><br></div><div>We sincerely thank all applicants in advance for submitting their interest in this opportunity. Airalo is an equal opportunity employer and values diversity, equity &amp; inclusion. We do not discriminate on the basis of race, religion, national origin, gender, sexual orientation, age, marital status, veteran status, or disability status. We are committed to providing reasonable accommodations upon request for individuals with disabilities throughout our job interview process.</div>","tags":"[\"management\",\"b2c\",\"b2b\"]","pubDate":"2025-03-24T12:15:39.969Z","link":"https://jobs.lever.co/airalo/5c45994b-b2e1-4181-bfe1-9cd3270bf69f","slug":"strategic-partnerships-manager-africa-loyalty-fintech-airalo-7019"}]