[{"id":4228293282,"title":"Head of Marketing","company":"SafetyWing","image":"https://pbs.twimg.com/profile_images/1177267684574208000/54eG3WmW_400x400.jpg","description":"<h2>🧘 What we offer:</h2> <ul><li><!--block-->Fully remote work environment – work from anywhere globally</li><li><!--block-->Competitive compensation and&nbsp; equity compensation</li><li><!--block-->A minimum of four weeks of vacation per year</li><li><!--block-->A personal development budget</li><li><!--block-->Premium health insurance that travels with you</li><li><!--block-->Travel insurance any time you travel outside of your home country</li><li><!--block-->New laptop, office allowance and more!</li><li><!--block-->Multiple team gatherings per year in amazing locations—our previous meetups were in Mexico, Bali, Siglufjörður and Hoi An</li></ul><div><!--block--><br>🚀 We look forward to hearing from you!</div> <div><!--block--><strong>SafetyWing (YC W18)</strong> is seeking a <strong>Head of Marketing </strong>to scale our marketing function. We’re looking for&nbsp; a strategic, creative, hands-on marketing leader who can establish our marketing strategy while building a high performing team. This role combines strategic leadership with tactical execution, and we’re looking for someone equally comfortable crafting strategy and rolling up their sleeves to get things done.</div><div><!--block--><br></div><div><!--block-->At <strong>SafetyWing</strong>, we’re building a global social safety net for remote workers—simple health, insurance, and retirement products designed to replace national welfare systems. Our mission is to remove geographical borders as a barrier to equal opportunity and freedom for everyone. If we succeed, we believe this will be one of the most important tasks of our time.</div> <h2>💻 Your responsibilities will include:</h2>  <ul><li><!--block-->Develop our marketing strategy, focusing on brand establishment, demand generation, and market education across all our products</li><li><!--block-->Formalize&nbsp; our brand voice and positioning, differentiating us from both traditional insurance providers and competing startups</li><li><!--block-->Drive data-driven decision-making by establishing KPIs and analytics frameworks to measure marketing effectiveness across our marketing teams</li><li><!--block-->Collaborate closely with founders and executive team to align marketing strategy with company vision and growth targets</li><li><!--block-->Lead the development and execution of high-impact brand initiatives—set the strategic direction, collaborate with creative team and external agencies, and oversee the successful rollout of campaigns</li><li><!--block-->Serve as liaison between creative and marketing, bridging the gap between growth marketing goals and creative strategies</li><li><!--block-->Drive our content strategy, including steering cohesive messaging across the entire organization</li><li><!--block-->Assess various creative options and prioritize initiatives based on potential impact and alignment with business objectives</li><li><!--block-->Oversee all brand and comms touchpoints—including campaigns, emails, social media, podcasts, media relations, events, newsletters, merchandise, videos, thought leadership and more—to ensure a consistent and compelling brand experience that builds brand love and cultural impact</li></ul> <h2>🧪 We are looking for someone who:</h2> <ul><li><!--block-->Has a strong background leading a marketing team, preferably in both B2C and B2B environments</li><li><!--block-->Has experience in creating strategies and building new categories that resonate with target audiences</li><li><!--block-->Comfortable in data analytics and experience setting team targets and ensuring they’re met</li><li><!--block-->Is a team player who's eager to collaborate across functions to achieve shared goals</li><li><!--block-->Is an innovative thinker, always looking for new ways to engage customers and improve their experience with our products</li><li><!--block-->Has a strong ability to communicate complex ideas simply and attractively</li><li><!--block-->Is driven by data to make decisions and improve product positioning</li></ul><div><!--block--><strong>😀 We like to work with people who:</strong></div><ul><li><!--block-->Want to help build a global social safety net on the Internet</li><li><!--block-->Think for themselves instead of copying others</li><li><!--block-->Are willing to try new things, even with the risk of failure</li><li><!--block-->Are intellectually curious and open to new ideas</li><li><!--block-->Are creative and bold in the face of any problems</li><li><!--block-->Have strong integrity and do the right thing</li></ul>","tags":"[\"b2c\",\"b2b\"]","pubDate":"2025-01-21T09:12:23.216Z","link":"https://safetywing.pinpointhq.com/en/jobs/305372","slug":"head-of-marketing-safetywing-2727"},{"id":7256572813,"title":"Linux Kernel Engineer - Ubuntu","company":"Canonical","image":"https://pbs.twimg.com/profile_images/1673959375340290050/x7pNtXQ7_400x400.jpg","description":"\n      <p>This is a general track for applications to any team at Canonical that works with the Linux kernel, across all seniority levels. Apply here if you are an exceptional software engineer who wants to work on both stable and cutting edge Linux kernels for Ubuntu and its wider ecosystem.</p>\n<p>Canonical has a large and rapidly growing kernel team that underpins Ubuntu and open source more widely across a very wide range of hardware and use cases. We partner with the biggest kernel contributors - the silicon companies - to ensure that their work reaches the widest possible audience as quickly&nbsp; as possible, with a 10 year enterprise security commitment.</p>\n<p>The Canonical Linux Kernel Organization has teams in every time zone. We have opportunities for technical leadership, engineering management, and engineering directorships. The team is responsible for all supported Ubuntu Linux kernels, on all platforms and architectures from small embedded devices to standard desktop/server systems to large scale cloud environments, mainframes and supercomputers.</p>\n<p>We care most about hardware and virtualization enablement, security, reliability and performance. There are a number of areas where we lead upstream, but for the most part we are interested in ensuring production readiness and performance for the latest patch-sets, rather than subsystem maintenance or evolution.</p>\n<p>Kernel Team projects include but are not limited to:</p>\n<ul>\n<li>Ubuntu Linux kernel plan, execution, benchmarking and stress testing</li>\n<li>Optimised kernels for key silicon and cloud partners</li>\n<li>Confidential computing and next-generation security primitives</li>\n<li>Developer platforms such as Raspberry Pi and RISC-V</li>\n<li>Enabling Ubuntu on a wide range of embedded systems</li>\n<li>Kernel Livepatch, which delivers critical kernel fixes without rebooting</li>\n<li>FIPS compliance</li>\n<li>Real-Time and Low Latency kernel variants and patch-sets</li>\n<li>Virtualisation or abstraction engines</li>\n<li>Container technology</li>\n<li>Security with AppArmor, SECCOMP, namespaces and more</li>\n<li>Networking - in particular performance and security</li>\n<li>Storage - we are particularly interested in Ceph and DRBD</li>\n</ul>\n<p>We hire candidates of all experience levels from recent university graduates through seasoned industry experts. We select those who are enthusiastic to work in multiple areas including security mitigation, feature development, patching and test.&nbsp; You must have outstanding academic results, a background in software engineering, be motivated to work in a distributed team and willing to travel globally twice a year for company engineering events.</p>\n<p><strong>Location:</strong> Working from home, worldwide.&nbsp; &nbsp;We have kernel teams and openings in every time zone and with the notable exception of Taipei, Taiwan, have no offices and therefore no pressure to work from an office.</p>\n<h2>What your day will look like</h2>\n<ul>\n<li>Collaborate regularly and proactively with a globally distributed team&nbsp;</li>\n<li>Work closely with silicon, cloud, or hardware manufacturers</li>\n<li>Diagnose and resolve issues in the kernel</li>\n<li>Take personal responsibility for a flavour of the Ubuntu Linux kernel</li>\n<li>Improve tooling and automation for delivery and test of Ubuntu Linux kernels</li>\n<li>Submit, review, and apply kernel patches</li>\n</ul>\n<h2>What we are looking for in you</h2>\n<ul>\n<li>An exceptional academic track record from both high school and university</li>\n<li>Undergraduate degree in Computer Science or STEM, or a compelling narrative about your alternative path</li>\n<li>Drive and a track record of going above-and-beyond expectations</li>\n<li>Well-organised, self-starting and able to deliver to fixed schedules</li>\n<li>Professional manner interacting with colleagues, partners, and community</li>\n<li>Ability to communicate effectively in English, both written and oral</li>\n<li>Significant programming experience in C</li>\n<li>Solid background with git</li>\n<li>Broad knowledge of the Linux kernel and kernel subsystems</li>\n<li>Demonstrated experience with kernel patching and debugging</li>\n<li>Understanding of Linux kernel upstream processes and release cycle</li>\n<li>Strong grasp of device drivers, BSP’s, and other low level system engineering</li>\n<li>Professional written and spoken English&nbsp;</li>\n<li>Experience with Linux (Debian or Ubuntu preferred)&nbsp;</li>\n<li>Excellent interpersonal skills, curiosity, flexibility, and accountability&nbsp;</li>\n<li>Passion, thoughtfulness, and self-motivation&nbsp;</li>\n<li>Excellent communication and presentation skills&nbsp;</li>\n<li>Result-oriented, with a personal drive to meet commitments&nbsp;</li>\n<li>Ability to travel twice a year, for company events up to two weeks each</li>\n</ul>\n<h2>Additional skills that you might also bring</h2>\n<ul>\n<li>Python and Bash scripting</li>\n<li>Prior experience with Ubuntu/Debian/Snap packaging</li>\n<li>Performance engineering and security experience</li>\n</ul>\n<h2>What we offer you</h2>\n<p>We consider geographical location, experience, and performance in shaping compensation worldwide. We revisit compensation annually (and more often for graduates and associates) to ensure we recognise outstanding performance. In addition to base pay, we offer a performance-driven annual bonus. We provide all team members with additional benefits, which reflect our values and ideals. We balance our programs to meet local needs and ensure fairness globally.</p>\n<ul>\n<li>Distributed work environment with twice-yearly team sprints in person</li>\n<li>Personal learning and development budget of USD 2,000 per year</li>\n<li>Annual compensation review</li>\n<li>Recognition rewards</li>\n<li>Annual holiday leave</li>\n<li>Maternity and paternity leave</li>\n<li>Employee Assistance Programme</li>\n<li>Opportunity to travel to new locations to meet colleagues</li>\n<li>Priority Pass, and travel upgrades for long haul company events</li>\n</ul>\n<h2>About Canonical</h2>\n<p>Canonical is a pioneering tech firm at the forefront of the global move to open source. As the company that publishes Ubuntu, one of the most important open source projects and the platform for AI, IoT and the cloud, we are changing the world on a daily basis. We recruit on a global basis and set a very high standard for people joining the company. We expect excellence - in order to succeed, we need to be the best at what we do. Canonical has been a remote-first company since its inception in 2004.​ Working here is a step into the future, and will challenge you to think differently, work smarter, learn new skills, and raise your game.</p>\n<h2>Canonical is an equal opportunity employer</h2>\n<p>We are proud to foster a workplace free from discrimination. Diversity of experience, perspectives, and background create a better work environment and better products.<a href=\"https://canonical.com/careers/diversity/identity\"> Whatever your identity, we will give your application fair consideration.</a></p>\n<p>#LI-remote</p><p>Requisition ID: 466</p><p></p>\n    ","tags":"[\"management\",\"engineering\"]","pubDate":"2025-01-21T09:12:23.216Z","link":"https://canonical.com/careers/6559708","slug":"linux-kernel-engineer-ubuntu-canonical-8105"},{"id":5101475438,"title":"Product Designer","company":"SafetyWing","image":"https://pbs.twimg.com/profile_images/1177267684574208000/54eG3WmW_400x400.jpg","description":"<h2>🧘 What we offer:</h2> <ul><li><!--block-->Fully remote work environment – work from anywhere globally</li><li><!--block-->Competitive compensation and&nbsp; equity compensation</li><li><!--block-->A minimum of four weeks of vacation per year</li><li><!--block-->A personal development budget</li><li><!--block-->Premium health insurance that travels with you</li><li><!--block-->Travel insurance any time you travel outside of your home country</li><li><!--block-->New laptop, office allowance and more!</li><li><!--block-->Multiple team gatherings per year in amazing locations—our previous meetups were in Mexico, Bali, Siglufjörður and Hoi An<br><br></li></ul><div><!--block-->🚀 We look forward to hearing from you!</div> <div><!--block-->At <strong>SafetyWing</strong>, we’re building a global social safety net for remote workers—simple health, insurance, and retirement products designed to replace national welfare systems. Our mission is to remove geographical borders as a barrier to equal opportunity and freedom for everyone. If we succeed, we believe this will be one of the most important tasks of our time.</div><div><!--block--><br>As the <strong>Product Designer</strong> at <a href=\"https://safetywing.com/\">SafetyWing</a>, you will drive the design and development of our products. Your role extends beyond crafting exceptional designs; it's about adding depth and meaning to the experience while maintaining our core values.</div> <h2>👨‍🎤 As our Product Designer, you will:</h2>  <ul><li><!--block-->Lead product design initiatives from conception to final execution</li><li><!--block-->Drive continuous improvements in our design processes, proposing strategies to elevate the quality of outputs</li><li><!--block-->Ensure consistency in design outputs by collaborating closely with product managers, other designers and engineers</li><li><!--block-->Drive the evolution and adherence to SafetyWing's design system</li><li><!--block-->Present product design ideas to cross-functional teams and senior leadership</li></ul><div><!--block--><br></div> <h2>🧪 We are looking for someone who:</h2> <ul><li><!--block-->Has advanced product design experience demonstrated through a portfolio of impactful design solutions</li><li><!--block-->Has experience designing user experiences within insurance, finance or other compliance regulated sectors</li><li><!--block-->Is proficient in using design and prototyping tools such as Figma and is committed to continuous learning of new features</li><li><!--block-->Has experience conducting user research and usability testing</li><li><!--block-->Can communicate design ideas clearly and champion design principles across diverse audiences, including design and non-design stakeholders</li><li><!--block-->Can think beyond the immediate design task and understand the bigger business and product strategy</li></ul><div><!--block--><strong>😀 We like to work with people who:</strong></div><ul><li><!--block-->Want to help build a global social safety net on the internet</li><li><!--block-->Think for themselves instead of copying others</li><li><!--block-->Are willing to try new things, even with the risk of failure</li><li><!--block-->Are intellectually curious and open to new ideas</li><li><!--block-->Are creative and bold in the face of any problems</li><li><!--block-->Have strong integrity and do the right thing</li></ul>","tags":"[\"finance\"]","pubDate":"2025-01-21T09:12:23.215Z","link":"https://safetywing.pinpointhq.com/en/jobs/305326","slug":"product-designer-safetywing-2481"},{"id":5880741455,"title":"Product Marketer","company":"SafetyWing","image":"https://pbs.twimg.com/profile_images/1177267684574208000/54eG3WmW_400x400.jpg","description":"<h2>🧘 What we offer:</h2> <ul><li><!--block-->Fully remote work environment – work from anywhere globally</li><li><!--block-->Competitive compensation and&nbsp; equity compensation</li><li><!--block-->A minimum of four weeks of vacation per year</li><li><!--block-->A personal development budget</li><li><!--block-->Premium health insurance that travels with you</li><li><!--block-->Travel insurance any time you travel outside of your home country</li><li><!--block-->New laptop, office allowance and more!</li><li><!--block-->Multiple team gatherings per year in amazing locations—our previous meetups were in Mexico, Bali, Siglufjörður and Hoi An<br><br></li></ul><div><!--block-->🚀 We look forward to hearing from you!</div><div><!--block--><br></div> <div><!--block--><strong>SafetyWing (YC W18)</strong> is seeking a <strong>Product Marketer </strong>who will streamline our marketing strategies to enhance the success of our insurance products. In this role, you will dive into market research, craft compelling messaging, oversee product launches, and develop tools to boost customer acquisition and retention. Your efforts will ensure our audience understands and values our products, directly contributing to our growth.&nbsp;</div><div><!--block--><br></div><div><!--block-->We are on a mission to remove the role of geographical borders as a barrier to equal opportunities and freedom for everyone. And we are doing that by creating simple health, insurance, and retirement products for remote workers worldwide as a replacement for national welfare systems.</div> <h2>💻 Your responsibilities will include:</h2>  <ul><li><!--block-->Owning the product marketing strategy and execution for our core product lines, including positioning, messaging, and go-to-market planning</li><li><!--block-->Lead product launches and campaigns, coordinating cross-functionally with Sales, Customer Success, and Marketing teams and ensuring alignment with our core principles</li><li><!--block-->Talking to our customers to find out why they buy our products, assessing price sensitivity, and understanding market trends</li><li><!--block-->Craft clear, engaging messages that resonate with our diverse audience</li><li><!--block-->Overseeing successful product launches, serving as intermediary between product, creative and growth</li><li><!--block-->Leading efforts to track and refine our growth, making data-driven suggestions for enhancements</li><li><!--block-->Ensuring that both our team and customers have a deep understanding and appreciation of our product</li><li><!--block-->Work closely with our creative team to ensure brand-consistent messaging across channels&nbsp;</li><li><!--block-->Crafting marketing tools like web pages and ads to attract and keep customers, always seeking ways to do it better</li><li><!--block-->Collaborating with customer success to proactively tackle customer issues and refine their experience</li><li><!--block-->Leveraging your deep understanding of our product principles to make wise decisions, especially in managing projects and product launches</li></ul><div><!--block--><br></div> <h2>🧪 We are looking for someone who:</h2> <ul><li><!--block-->Has a strong background in product marketing, preferably in both B2C and B2B environments</li><li><!--block-->Is driven by data to make decisions and improve product positioning</li><li><!--block-->Has experience in creating strategies that resonate with target audiences</li><li><!--block-->Is creative, you’re familiar with and excited by brand storytelling (bonus if you have copywriting skills)</li><li><!--block-->Is a team player who's eager to collaborate across functions to achieve shared goals</li><li><!--block-->Is an innovative thinker, always looking for new ways to engage customers and improve their experience with our products</li><li><!--block-->Has a strong ability to communicate complex ideas simply and attractively</li></ul><div><!--block--><strong>😀 We like to work with people who:</strong></div><ul><li><!--block-->Want to help build a global social safety net on the internet</li><li><!--block-->Think for themselves instead of copying others</li><li><!--block-->Are willing to try new things, even with the risk of failure</li><li><!--block-->Are intellectually curious and open to new ideas</li><li><!--block-->Are creative and bold in the face of any problems</li><li><!--block-->Have strong integrity and do the right thing</li></ul>","tags":"[\"b2c\",\"b2b\"]","pubDate":"2025-01-21T09:12:23.215Z","link":"https://safetywing.pinpointhq.com/en/jobs/305368","slug":"product-marketer-safetywing-7371"},{"id":1798306021,"title":"Senior QA Engineer","company":"Synthflow","image":"https://yt3.googleusercontent.com/d1EZViC7xXJl3O7DDUguF5UgjjvGXpqeKMhl-ivOftHbUeIFJDURN3TR8MnKewBKI44oO3n5HA=s160-c-k-c0x00ffffff-no-rj","description":"<p style=\"min-height:1.5em\">This is a fully remote role, allowing you to work from anywhere in the world.</p><p style=\"min-height:1.5em\"></p><h1><strong>About Synthflow</strong></h1><p style=\"min-height:1.5em\">At <a target=\"_blank\" rel=\"noopener noreferrer nofollow\" href=\"http://synthflow.ai/\">Synthflow</a> we’re building the easiest way for businesses to create AI-powered phone agents. No coding, no fuss—just smarter automation. We’re passionate about delivering the future of voice technology with lightning-fast, scalable solutions. It’s an exciting time at Synthflow: we’re early, fast-growing, and laser-focused on impact. Join us to do the best work of your career while helping businesses thrive.</p><p style=\"min-height:1.5em\"></p><h1><strong>About the role</strong></h1><p style=\"min-height:1.5em\">We’re looking for a Senior QA Engineer to define testing strategies and maintain product reliability. You will play a crucial role in ensuring the quality and robustness of our Voice AI products. You will work closely with our engineering and product teams to perform both automated and manual testing, ensuring our solutions meet high standards for performance, reliability, and usability.</p><p style=\"min-height:1.5em\"></p><h2><strong>Your responsibilities will include:</strong></h2><ul style=\"min-height:1.5em\"><li><p style=\"min-height:1.5em\">Design and implement comprehensive testing strategies for Voice AI products, including both automated and manual testing.</p></li><li><p style=\"min-height:1.5em\">Develop and maintain test cases, scripts, and frameworks to validate product functionality and performance.</p></li><li><p style=\"min-height:1.5em\">Collaborate with developers and product managers to understand features and their impact on product behavior, ensuring thorough test coverage.</p></li><li><p style=\"min-height:1.5em\">Identify, document, and track defects, ensuring timely resolution and continuous quality improvement.</p></li><li><p style=\"min-height:1.5em\">Monitor testing processes, analyze results, and provide feedback to improve testing efficiency and product quality.</p></li></ul><p style=\"min-height:1.5em\"></p><h1><strong>Who you are:</strong></h1><ul style=\"min-height:1.5em\"><li><p style=\"min-height:1.5em\">Experienced in QA engineering, with a proven track record in both automated and manual testing.</p></li><li><p style=\"min-height:1.5em\">Proficient in Python for writing test scripts and automating test processes.</p></li><li><p style=\"min-height:1.5em\">Familiarity with testing frameworks and tools such as Selenium, PyTest, or equivalent.</p></li><li><p style=\"min-height:1.5em\">Strong communication skills, capable of collaborating effectively with both technical and non-technical teams.</p></li></ul><p style=\"min-height:1.5em\"></p><h1><strong>Minimum Qualifications:</strong></h1><ul style=\"min-height:1.5em\"><li><p style=\"min-height:1.5em\">Bachelor’s degree in Computer Science, Engineering, or a related technical field.</p></li><li><p style=\"min-height:1.5em\">5+ years of experience in software development or software testing.</p></li><li><p style=\"min-height:1.5em\">Proficiency in creating and executing test plans, test cases, and test scripts.</p></li><li><p style=\"min-height:1.5em\">Strong problem-solving skills and attention to detail, with a passion for quality assurance.</p></li><li><p style=\"min-height:1.5em\">Familiarity with RDBMS and NoSQL databases and validations.</p></li><li><p style=\"min-height:1.5em\">Familiarity with CI/CD pipelines and agile development practices is a plus.</p></li></ul><p style=\"min-height:1.5em\"></p><h1><strong>What we offer:</strong></h1><ul style=\"min-height:1.5em\"><li><p style=\"min-height:1.5em\"><strong>Autonomy at speed: </strong>High-ownership roles in a fast-moving startup.</p></li><li><p style=\"min-height:1.5em\"><strong>Remote-first flexibility: </strong>Contribute from anywhere, on your schedule.</p></li><li><p style=\"min-height:1.5em\"><strong>Cutting-edge technology:</strong> Work on what interests you most.</p></li><li><p style=\"min-height:1.5em\"><strong>Career growth: </strong>Scale your impact as the company grows.</p></li><li><p style=\"min-height:1.5em\"><strong>Rewarding package: </strong>Competitive pay, equity options, and comprehensive benefits that reflect your skills and experience. </p></li></ul>","tags":"[\"engineering\",\"database\"]","pubDate":"2025-01-21T09:05:13.187Z","link":"https://jobs.ashbyhq.com/synthflow/9fca96ac-163c-4359-8135-fa59ab7c797f","slug":"senior-qa-engineer-synthflow-8765"},{"id":9279649416,"title":"Senior Go Software Engineer","company":"Synthflow","image":"https://yt3.googleusercontent.com/d1EZViC7xXJl3O7DDUguF5UgjjvGXpqeKMhl-ivOftHbUeIFJDURN3TR8MnKewBKI44oO3n5HA=s160-c-k-c0x00ffffff-no-rj","description":"<h1><strong>About Synthflow</strong></h1><p style=\"min-height:1.5em\">At <a target=\"_blank\" rel=\"noopener noreferrer nofollow\" href=\"http://synthflow.ai/\">Synthflow</a> we’re building the easiest way for businesses to create AI-powered phone agents. No coding, no fuss—just smarter automation. We’re passionate about delivering the future of voice technology with lightning-fast, scalable solutions. It’s an exciting time at Synthflow: we’re early, fast-growing, and laser-focused on impact. Join us to do the best work of your career while helping businesses thrive.</p><p style=\"min-height:1.5em\"></p><h1><strong>About the role</strong></h1><p style=\"min-height:1.5em\">We’re looking for a Senior Go Software Engineer to build real-time voice AI systems that set the standard.</p><p style=\"min-height:1.5em\"></p><h2><strong>Your responsibilities will include:</strong></h2><ul style=\"min-height:1.5em\"><li><p style=\"min-height:1.5em\"><strong>Design and enhance backend infrastructure</strong> focusing on scalability, performance, and reliability. Implement features and maintain the systems that power our next-generation products.</p></li><li><p style=\"min-height:1.5em\"><strong>Expertly manage concurrency and parallelism</strong> in Go using goroutines, channels, and synchronization primitives like mutexes and wait groups.</p></li><li><p style=\"min-height:1.5em\"><strong>Develop robust networking and streaming capabilities</strong>, including experience with network programming, sockets, and protocols like WebSockets and WebRTC.</p></li><li><p style=\"min-height:1.5em\"><strong>Lead performance optimization initiatives</strong> by profiling Go code, reducing latency, and efficiently managing memory and garbage collection.</p></li><li><p style=\"min-height:1.5em\"><strong>Build fault-tolerant systems</strong> with strong recovery mechanisms and failover strategies to maintain service continuity.</p></li><li><p style=\"min-height:1.5em\"><strong>Implement comprehensive logging and tracing</strong> using tools such as zap, klog, OpenTelemetry, and Jaeger to enhance monitoring and troubleshooting.</p></li><li><p style=\"min-height:1.5em\"><strong>Apply Test-Driven Development (TDD) and engage in Pair Programming</strong> to ensure high code quality and promote team collaboration.</p></li><li><p style=\"min-height:1.5em\"><strong>Participate actively in code reviews</strong>, offering constructive feedback to uphold code quality and adhere to best practices.</p></li><li><p style=\"min-height:1.5em\"><strong>Stay informed on the latest in software development</strong> and contribute to the team's continuous learning and improvement.</p></li></ul><h1><strong>You have:</strong></h1><ul style=\"min-height:1.5em\"><li><p style=\"min-height:1.5em\"><strong>At least 5 years of professional experience</strong> with Go, along with a track record of developing scalable and extensible systems.</p></li><li><p style=\"min-height:1.5em\">Additional proficiency in Python and familiarity with infrastructure containerization, DevOps &amp; MLOps tools (preferably GCP or AWS).</p></li><li><p style=\"min-height:1.5em\">Extensive experience in <strong>creating and maintaining robust APIs</strong> and implementing advanced CI/CD pipelines.</p></li><li><p style=\"min-height:1.5em\">A strong foundation in software engineering principles and a commitment to leading-edge practices including TDD, pair programming, and continuous integration.</p></li></ul><p style=\"min-height:1.5em\"></p><h1><strong>Beyond the basics: </strong></h1><ul style=\"min-height:1.5em\"><li><p style=\"min-height:1.5em\">Exposure to <strong>voice technologies</strong> like WebRTC and Twilio.</p></li><li><p style=\"min-height:1.5em\">A background in <strong>AI</strong>, particularly around Large Language Models, Speech to Text, and Voice Synthesis applications.</p></li><li><p style=\"min-height:1.5em\">Experience in <strong>AI-related fields</strong>, such as low-latency audio stream processing or leveraging LLMs in product environments.</p></li><li><p style=\"min-height:1.5em\">Knowledge of <strong>distributed computing and cloud infrastructure</strong> at scale.</p></li></ul><p style=\"min-height:1.5em\"></p><h1><strong>What We Offer:</strong></h1><ul style=\"min-height:1.5em\"><li><p style=\"min-height:1.5em\"><strong>Autonomy at speed: </strong>High-ownership roles in a fast-moving startup.</p></li><li><p style=\"min-height:1.5em\"><strong>Remote-first flexibility: </strong>Contribute from anywhere, on your schedule.</p></li><li><p style=\"min-height:1.5em\"><strong>Cutting-edge technology:</strong> Work on what interests you most.</p></li><li><p style=\"min-height:1.5em\"><strong>Career growth: </strong>Scale your impact as the company grows.</p></li><li><p style=\"min-height:1.5em\"><strong>Rewarding package: </strong>Competitive pay, equity options, and comprehensive benefits that reflect your skills and experience. </p></li></ul><h2></h2>","tags":"[\"engineering\",\"aws\"]","pubDate":"2025-01-21T09:04:59.783Z","link":"https://jobs.ashbyhq.com/synthflow/95f3f5e2-f51d-4e50-bff2-0149677cf0a0","slug":"senior-go-software-engineer-synthflow-8493"},{"id":7086818111,"title":"Senior NLP/LLM Engineer","company":"Synthflow","image":"https://yt3.googleusercontent.com/d1EZViC7xXJl3O7DDUguF5UgjjvGXpqeKMhl-ivOftHbUeIFJDURN3TR8MnKewBKI44oO3n5HA=s160-c-k-c0x00ffffff-no-rj","description":"<p style=\"min-height:1.5em\">This is a fully remote role, allowing you to work from anywhere in the world.</p><p style=\"min-height:1.5em\"></p><h1><strong>About Synthflow</strong></h1><p style=\"min-height:1.5em\">At <a target=\"_blank\" rel=\"noopener noreferrer nofollow\" href=\"http://synthflow.ai/\">Synthflow</a> we’re building the easiest way for businesses to create AI-powered phone agents. No coding, no fuss—just smarter automation. We’re passionate about delivering the future of voice technology with lightning-fast, scalable solutions. It’s an exciting time at Synthflow: we’re early, fast-growing, and laser-focused on impact. Join us to do the best work of your career while helping businesses thrive.</p><p style=\"min-height:1.5em\"></p><h1><strong>About the role</strong></h1><p style=\"min-height:1.5em\">We’re looking for a Senior NLP Engineer to create groundbreaking LLM applications.</p><p style=\"min-height:1.5em\"></p><h2><strong>Your responsibilities will include:</strong></h2><ul style=\"min-height:1.5em\"><li><p style=\"min-height:1.5em\">Develop and enhance large language models (LLMs) for various NLP tasks including text generation, language understanding, and conversational AI.</p></li><li><p style=\"min-height:1.5em\">Implement state-of-the-art machine learning techniques for natural language processing and ensure their integration into our product infrastructure.</p></li><li><p style=\"min-height:1.5em\">Collaborate with cross-functional teams to translate business and technical requirements into robust NLP solutions.</p></li><li><p style=\"min-height:1.5em\">Conduct experimental design and hypothesis testing to evaluate model performance and iterate based on results.</p></li><li><p style=\"min-height:1.5em\">Stay abreast of the latest developments in NLP and LLM research to continuously innovate and apply best practices to our projects.</p></li></ul><p style=\"min-height:1.5em\"></p><h1><strong>Who you are:</strong></h1><ul style=\"min-height:1.5em\"><li><p style=\"min-height:1.5em\">Passionate about NLP and experienced in building and deploying large language models.</p></li><li><p style=\"min-height:1.5em\">Skilled in programming, particularly in Python, and familiar with NLP libraries such as Hugging Face Transformers, NLTK, or spaCy.</p></li><li><p style=\"min-height:1.5em\">Adept at working in fast-paced environments and translating complex technical challenges into actionable solutions.</p></li><li><p style=\"min-height:1.5em\">Strong communicator with the ability to collaborate effectively with both technical and non-technical team members.</p></li></ul><p style=\"min-height:1.5em\"></p><h1><strong>What you bring:</strong></h1><ul style=\"min-height:1.5em\"><li><p style=\"min-height:1.5em\">Master’s degree in Computer Science, AI, Linguistics, or a related field.</p></li><li><p style=\"min-height:1.5em\">At least 4 years of experience in NLP or related fields, with a strong focus on machine learning.</p></li><li><p style=\"min-height:1.5em\">Proficiency in machine learning frameworks such as TensorFlow or PyTorch.</p></li><li><p style=\"min-height:1.5em\">Demonstrated experience with model training, LLM fine-tuning, and deployment in a production setup.</p></li></ul><p style=\"min-height:1.5em\"></p><h1><strong>What We Offer:</strong></h1><ul style=\"min-height:1.5em\"><li><p style=\"min-height:1.5em\"><strong>Autonomy at speed: </strong>High-ownership roles in a fast-moving startup.</p></li><li><p style=\"min-height:1.5em\"><strong>Remote-first flexibility: </strong>Contribute from anywhere, on your schedule.</p></li><li><p style=\"min-height:1.5em\"><strong>Cutting-edge technology:</strong> Work on what interests you most.</p></li><li><p style=\"min-height:1.5em\"><strong>Career growth: </strong>Scale your impact as the company grows.</p></li><li><p style=\"min-height:1.5em\"><strong>Rewarding package: </strong>Competitive pay, equity options, and comprehensive benefits that reflect your skills and experience. </p></li></ul>","tags":"[]","pubDate":"2025-01-21T09:04:43.038Z","link":"https://jobs.ashbyhq.com/synthflow/a848cb4d-03d7-4d04-9345-d2c17e5ec1fd","slug":"senior-nlp-llm-engineer-synthflow-1605"},{"id":6501988927,"title":"Senior Full-Stack Software Engineer","company":"Synthflow","image":"https://yt3.googleusercontent.com/d1EZViC7xXJl3O7DDUguF5UgjjvGXpqeKMhl-ivOftHbUeIFJDURN3TR8MnKewBKI44oO3n5HA=s160-c-k-c0x00ffffff-no-rj","description":"<p style=\"min-height:1.5em\">This is a fully remote role, allowing you to work from anywhere in the world.</p><p style=\"min-height:1.5em\"></p><h1><strong>About Synthflow</strong></h1><p style=\"min-height:1.5em\">At <a target=\"_blank\" rel=\"noopener noreferrer nofollow\" href=\"http://synthflow.ai/\">Synthflow</a> we’re building the easiest way for businesses to create AI-powered phone agents. No coding, no fuss—just smarter automation. We’re passionate about delivering the future of voice technology with lightning-fast, scalable solutions. It’s an exciting time at Synthflow: we’re early, fast-growing, and laser-focused on impact. Join us to do the best work of your career while helping businesses thrive.</p><p style=\"min-height:1.5em\"></p><h1><strong>About the role</strong></h1><p style=\"min-height:1.5em\">We’re looking for a Senior Full-Stack Engineer to build and scale Synthflow’s core platform.</p><p style=\"min-height:1.5em\"></p><h2><strong>Your responsibilities will include:</strong></h2><ul style=\"min-height:1.5em\"><li><p style=\"min-height:1.5em\"><strong>Build and maintain our full-stack architecture</strong> using React/Next.js, Node.js, and to deliver a robust, scalable, and high-performance platform.</p></li><li><p style=\"min-height:1.5em\"><strong>Implement user-facing features and backend services</strong> that support our evolving product.</p></li><li><p style=\"min-height:1.5em\"><strong>Collaborate closely</strong> with designers, product managers, and other engineers to deliver high-quality, user-friendly solutions.</p></li><li><p style=\"min-height:1.5em\"><strong>Optimize SQL queries and database interactions</strong> to ensure efficiency across our application stack.</p></li><li><p style=\"min-height:1.5em\"><strong>Leverage your experience in automated testing and CI/CD pipelines</strong> to drive quality and streamline deployment.</p></li><li><p style=\"min-height:1.5em\"><strong>Work in a fast-paced, startup environment</strong> where innovation, speed, and scalability are key.</p></li></ul><p style=\"min-height:1.5em\"></p><h1><strong>You Have:</strong></h1><ul style=\"min-height:1.5em\"><li><p style=\"min-height:1.5em\">A <strong>minimum of 4 years of professional experience</strong> as a Full-Stack Engineer with a strong focus on JavaScript/TypeScript</p></li><li><p style=\"min-height:1.5em\">Extensive experience with <strong>React, Node.js, TypeScript, CSS, and Next.js</strong>.</p></li><li><p style=\"min-height:1.5em\">Strong proficiency in <strong>SQL</strong> and optimizing complex queries.</p></li><li><p style=\"min-height:1.5em\"><strong>Experience with cloud platforms</strong> such as GCP or AWS.</p></li><li><p style=\"min-height:1.5em\">Familiarity with <strong>DevOps and containerization</strong> tools like Docker.</p></li><li><p style=\"min-height:1.5em\">Strong verbal and written communication skills, with a track record of effective collaboration in cross-functional teams.</p></li><li><p style=\"min-height:1.5em\"><strong>Contribute to a culture of learning and knowledge-sharing,</strong> participating in code reviews and pair programming.</p></li></ul><h3></h3><h1>Beyond the basics:</h1><ul style=\"min-height:1.5em\"><li><p style=\"min-height:1.5em\">Experience with <strong>Redis</strong> and relational databases for caching and data handling.</p></li><li><p style=\"min-height:1.5em\">Experience with AI Tooling and Framework like Langchain or OpenAI SDK</p></li><li><p style=\"min-height:1.5em\"><strong>Early-stage startup experience</strong> is a big plus, as we value adaptability and innovative problem-solving.</p><p style=\"min-height:1.5em\"></p></li></ul><h1><strong>What We Offer:</strong></h1><ul style=\"min-height:1.5em\"><li><p style=\"min-height:1.5em\"><strong>Autonomy at speed: </strong>High-ownership roles in a fast-moving startup.</p></li><li><p style=\"min-height:1.5em\"><strong>Remote-first flexibility: </strong>Contribute from anywhere, on your schedule.</p></li><li><p style=\"min-height:1.5em\"><strong>Cutting-edge technology:</strong> Work on what interests you most.</p></li><li><p style=\"min-height:1.5em\"><strong>Career growth: </strong>Scale your impact as the company grows.</p></li><li><p style=\"min-height:1.5em\"><strong>Rewarding package: </strong>Competitive pay, equity options, and comprehensive benefits that reflect your skills and experience. </p></li></ul>","tags":"[\"javascript\",\"typescript\",\"database\",\"aws\"]","pubDate":"2025-01-21T09:04:30.036Z","link":"https://jobs.ashbyhq.com/synthflow/011b1ed3-f877-4327-89c7-15160f497fac","slug":"senior-full-stack-software-engineer-synthflow-4510"},{"id":6334883705,"title":"Senior Python Software Engineer ","company":"Synthflow","image":"https://yt3.googleusercontent.com/d1EZViC7xXJl3O7DDUguF5UgjjvGXpqeKMhl-ivOftHbUeIFJDURN3TR8MnKewBKI44oO3n5HA=s160-c-k-c0x00ffffff-no-rj","description":"<p style=\"min-height:1.5em\">This is a fully remote role, allowing you to work from anywhere in the world.</p><p style=\"min-height:1.5em\"></p><h1><strong>About Synthflow</strong></h1><p style=\"min-height:1.5em\">At <a target=\"_blank\" rel=\"noopener noreferrer nofollow\" href=\"http://synthflow.ai/\">Synthflow</a> we’re building the easiest way for businesses to create AI-powered phone agents. No coding, no fuss—just smarter automation. We’re passionate about delivering the future of voice technology with lightning-fast, scalable solutions. It’s an exciting time at Synthflow: we’re early, fast-growing, and laser-focused on impact. Join us to do the best work of your career while helping businesses thrive.</p><p style=\"min-height:1.5em\"></p><h1><strong>About the role</strong></h1><p style=\"min-height:1.5em\">We’re looking for a Senior Python Engineer to craft reliable, production-ready software for AI tools.</p><p style=\"min-height:1.5em\"></p><h2><strong>Your responsibilities will include:</strong></h2><ul style=\"min-height:1.5em\"><li><p style=\"min-height:1.5em\"><strong>Develop and maintain our backend infrastructure</strong>, focusing on scalability, performance, and reliability.</p></li><li><p style=\"min-height:1.5em\"><strong>Implement new features</strong> in collaboration with our engineering team.</p></li><li><p style=\"min-height:1.5em\"><strong>Participate in the entire software development lifecycle</strong>, including requirements analysis, design, implementation, testing, and deployment.</p></li><li><p style=\"min-height:1.5em\"><strong>Apply Test-Driven Development (TDD) practices</strong> to ensure robust and reliable code.</p></li><li><p style=\"min-height:1.5em\"><strong>Engage in Pair Programming</strong> to enhance code quality and foster team collaboration.</p></li><li><p style=\"min-height:1.5em\"><strong>Implement and maintain Continuous Integration/Continuous Deployment (CI/CD) pipelines</strong> to streamline development and deployment processes.</p></li><li><p style=\"min-height:1.5em\"><strong>Conduct code reviews</strong>, providing constructive feedback to maintain high standards of code quality and best practices.</p></li><li><p style=\"min-height:1.5em\"><strong>Stay updated with the latest trends in software development</strong>, sharing knowledge and contributing to continuous improvement.</p></li></ul><p style=\"min-height:1.5em\"></p><h1><strong>You have:</strong></h1><ul style=\"min-height:1.5em\"><li><p style=\"min-height:1.5em\">A <strong>minimum of 5 years of experience</strong> as a Python developer.</p></li><li><p style=\"min-height:1.5em\">Strong experience in <strong>building scalable and extensible data infrastructure</strong>.</p></li><li><p style=\"min-height:1.5em\">Proficiency in <strong>infrastructure containerization, DevOps &amp; MLOps</strong> (preferably GCP or AWS).</p></li><li><p style=\"min-height:1.5em\">Experience in <strong>building and maintaining enterprise-grade APIs</strong> (e.g., with FastAPI).</p></li><li><p style=\"min-height:1.5em\">Demonstrated experience with <strong>TDD, pair programming, and CI/CD practices</strong>.</p></li></ul><p style=\"min-height:1.5em\"></p><h1><strong>Beyond the basics:</strong></h1><ul style=\"min-height:1.5em\"><li><p style=\"min-height:1.5em\">Familiarity with <strong>voice technologies</strong> like WebRTC and Twilio.</p></li><li><p style=\"min-height:1.5em\">Knowledge of <strong>AI</strong>, particularly Large Language Models (LLMs), Speech To Text and Voice Synthesis models.</p></li><li><p style=\"min-height:1.5em\">Experience in <strong>AI-related fields</strong> like low-latency audio stream processing or building applications with LLMs.</p></li><li><p style=\"min-height:1.5em\">Familiarity with <strong>AI frameworks</strong> such as LangChain, LlamaIndex, etc.</p></li><li><p style=\"min-height:1.5em\">Experience with <strong>large-scale distributed computing and cloud infrastructure</strong>.</p></li></ul><h3></h3><h1><strong>What we offer:</strong></h1><ul style=\"min-height:1.5em\"><li><p style=\"min-height:1.5em\"><strong>Autonomy at speed: </strong>High-ownership roles in a fast-moving startup.</p></li><li><p style=\"min-height:1.5em\"><strong>Remote-first flexibility: </strong>Contribute from anywhere, on your schedule.</p></li><li><p style=\"min-height:1.5em\"><strong>Cutting-edge technology:</strong> Work on what interests you most.</p></li><li><p style=\"min-height:1.5em\"><strong>Career growth: </strong>Scale your impact as the company grows.</p></li><li><p style=\"min-height:1.5em\"><strong>Rewarding package: </strong>Competitive pay, equity options, and comprehensive benefits that reflect your skills and experience. </p></li></ul>","tags":"[\"engineering\",\"aws\"]","pubDate":"2025-01-21T09:04:17.582Z","link":"https://jobs.ashbyhq.com/synthflow/e46f4ec1-399a-41ff-9d0e-19a77931e786","slug":"senior-python-software-engineer-synthflow-9217"},{"id":1862405956,"title":"Senior ML Engineer – Speech/Audio (TTS / STT)","company":"Synthflow","image":"https://yt3.googleusercontent.com/d1EZViC7xXJl3O7DDUguF5UgjjvGXpqeKMhl-ivOftHbUeIFJDURN3TR8MnKewBKI44oO3n5HA=s160-c-k-c0x00ffffff-no-rj","description":"<p style=\"min-height:1.5em\">This is a fully remote role, allowing you to work from anywhere in the world.</p><p style=\"min-height:1.5em\"></p><h1><strong>About Synthflow</strong></h1><p style=\"min-height:1.5em\">At <a target=\"_blank\" rel=\"noopener noreferrer nofollow\" href=\"http://synthflow.ai/\">Synthflow</a> we’re building the easiest way for businesses to create AI-powered phone agents. No coding, no fuss—just smarter automation. We’re passionate about delivering the future of voice technology with lightning-fast, scalable solutions. It’s an exciting time at Synthflow: we’re early, fast-growing, and laser-focused on impact. Join us to do the best work of your career while helping businesses thrive.</p><p style=\"min-height:1.5em\"></p><h1><strong>About the role</strong></h1><p style=\"min-height:1.5em\">We’re looking for a Senior ML Engineer to build the next generation of AI-powered speech tools. In this role, you will focus on the design, development, and optimization of cutting-edge TTS and STT models. Your work will play a crucial role in enhancing the performance, naturalness, and accuracy of our speech solutions, directly impacting the user experience.</p><p style=\"min-height:1.5em\"></p><h2><strong>Your responsibilities will include:</strong></h2><ul style=\"min-height:1.5em\"><li><p style=\"min-height:1.5em\">Architect and develop state-of-the-art machine learning models for TTS and STT applications.</p></li><li><p style=\"min-height:1.5em\">Lead the training, fine-tuning, and optimization processes to ensure our speech models achieve top-tier performance.</p></li><li><p style=\"min-height:1.5em\">Collaborate with cross-functional teams to integrate these technologies into scalable and robust products.</p></li><li><p style=\"min-height:1.5em\">Drive innovation by staying updated with the latest industry trends and research in speech technologies.</p></li><li><p style=\"min-height:1.5em\">Collaborate with NLP researchers and Software Engineers for the integration of new speech processing algorithms.</p></li></ul><p style=\"min-height:1.5em\"></p><h1><strong>Who you are:</strong></h1><ul style=\"min-height:1.5em\"><li><p style=\"min-height:1.5em\">You have a solid background in speech technologies with a strong focus on TTS and STT.</p></li><li><p style=\"min-height:1.5em\">You have over 3 years of practical experience in applying machine learning to develop and optimize speech processing systems.</p></li><li><p style=\"min-height:1.5em\">You are proficient in Python and familiar with modern ML frameworks and tools.</p></li><li><p style=\"min-height:1.5em\">You are a problem solver with a keen analytical mind, capable of tackling complex challenges in a dynamic environment.</p></li></ul><p style=\"min-height:1.5em\"></p><h1><strong>Beyond the basics:</strong></h1><ul style=\"min-height:1.5em\"><li><p style=\"min-height:1.5em\">Master's degree in Computer Science, Electrical Engineering, or a related field.</p></li><li><p style=\"min-height:1.5em\">At least 3 years of hands-on experience in speech technology, specifically in developing TTS and STT systems.</p></li><li><p style=\"min-height:1.5em\">Strong software development skills and experience with machine learning model implementation.</p></li><li><p style=\"min-height:1.5em\">Demonstrated capability in delivering effective solutions in speech processing.</p></li></ul><h3></h3><h1><strong>What We Offer:</strong></h1><ul style=\"min-height:1.5em\"><li><p style=\"min-height:1.5em\"><strong>Autonomy at speed: </strong>High-ownership roles in a fast-moving startup.</p></li><li><p style=\"min-height:1.5em\"><strong>Remote-first flexibility: </strong>Contribute from anywhere, on your schedule.</p></li><li><p style=\"min-height:1.5em\"><strong>Cutting-edge technology:</strong> Work on what interests you most.</p></li><li><p style=\"min-height:1.5em\"><strong>Career growth: </strong>Scale your impact as the company grows.</p></li><li><p style=\"min-height:1.5em\"><strong>Rewarding package: </strong>Competitive pay, equity options, and comprehensive benefits that reflect your skills and experience. </p></li></ul>","tags":"[\"engineering\"]","pubDate":"2025-01-21T09:03:06.645Z","link":"https://jobs.ashbyhq.com/synthflow/dd2d4bbb-cd96-40fe-8c49-95c19d505bc8","slug":"senior-ml-engineer-speech-audio-tts-stt-synthflow-8546"},{"id":4922390651,"title":"Senior Go Developer - Real-Time Voice Telephony AI","company":"Synthflow","image":"https://yt3.googleusercontent.com/d1EZViC7xXJl3O7DDUguF5UgjjvGXpqeKMhl-ivOftHbUeIFJDURN3TR8MnKewBKI44oO3n5HA=s160-c-k-c0x00ffffff-no-rj","description":"<p style=\"min-height:1.5em\"><strong>Location:</strong> Fully Remote | <strong>Type:</strong> Full-time or Contract</p><p style=\"min-height:1.5em\">Salary: $100 - $180k (DOE) + Stock</p><h2></h2><h1><strong>About Synthflow</strong></h1><p style=\"min-height:1.5em\">At <a target=\"_blank\" rel=\"noopener noreferrer nofollow\" href=\"http://synthflow.ai/\">Synthflow</a> we’re building the easiest way for businesses to create AI-powered phone agents. No coding, no fuss—just smarter automation. We’re passionate about delivering the future of voice technology with lightning-fast, scalable solutions. It’s an exciting time at Synthflow: we’re early, fast-growing, and laser-focused on impact. Join us to do the best work of your career while helping businesses thrive.</p><p style=\"min-height:1.5em\"></p><h1><strong>About the role</strong></h1><p style=\"min-height:1.5em\">We’re looking for a Senior Go Developer to build real-time voice AI systems that set the standard.</p><p style=\"min-height:1.5em\"></p><h2><strong>Your responsibilities will include:</strong></h2><ul style=\"min-height:1.5em\"><li><p style=\"min-height:1.5em\"><strong>Building &amp; Optimising</strong>: Develop and fine-tune our Go-based real-time, low-latency voice telephony AI service, ensuring it runs smoothly and efficiently. ⚙️</p></li><li><p style=\"min-height:1.5em\"><strong>Scalable Solutions</strong>: Leverage Go’s powerful concurrency features—like goroutines and channels—to build scalable systems that can handle heavy traffic with ease. 📈</p></li><li><p style=\"min-height:1.5em\"><strong>Cloud Infrastructure</strong>: Design and implement cloud infrastructure that supports flexible and reliable deployment models, ensuring our services are always available when our users need them. ☁️</p></li><li><p style=\"min-height:1.5em\"><strong>Cross-Language Collaboration</strong>: Work closely with our backend teams to integrate Go services with Python components, creating a seamless experience across our platform. 🤝</p></li><li><p style=\"min-height:1.5em\"><strong>Infrastructure-as-Code</strong>: Use Terraform to manage cloud deployments, ensuring that our infrastructure is scalable, consistent, and easy to maintain. 🛠️</p></li></ul><p style=\"min-height:1.5em\"></p><h1><strong>What you bring:</strong></h1><ul style=\"min-height:1.5em\"><li><p style=\"min-height:1.5em\"><strong>Go Expertise</strong>: <strong>You have a strong proficiency in Go</strong>, with a deep understanding of concurrency, goroutines, and channels. You know how to use these tools to build efficient, scalable, and maintainable systems. 💪</p></li><li><p style=\"min-height:1.5em\"><strong>Cloud Savvy</strong>: Extensive experience in cloud infrastructure, preferably across multiple providers like AWS, GCP, or Azure. 🌍</p></li><li><p style=\"min-height:1.5em\"><strong>Terraform Pro</strong>: Skilled in using Terraform for infrastructure-as-code, making cloud deployments straightforward and reliable. 📜</p></li><li><p style=\"min-height:1.5em\"><strong>Real-Time Systems Experience</strong>: Experience in developing and optimising real-time, low-latency systems, with a focus on performance and scalability. ⏱️</p></li><li><p style=\"min-height:1.5em\"><strong>Python Knowledge</strong>: While Go is your primary tool, you’re also comfortable with Python and can contribute to cross-language integrations. 🐍</p></li><li><p style=\"min-height:1.5em\"><strong>Voice Telephony or Audio Processing</strong>: Experience with voice telephony systems or audio processing is a big plus! 🎧</p></li></ul><p style=\"min-height:1.5em\"></p><h1><strong>Who you are:</strong></h1><ul style=\"min-height:1.5em\"><li><p style=\"min-height:1.5em\"><strong>Problem Solver</strong>: You love tackling complex technical challenges and coming up with innovative solutions. 🧠</p></li><li><p style=\"min-height:1.5em\"><strong>Team Player</strong>: You thrive in a collaborative environment and are excited to share ideas and learn from others. 🤗</p></li><li><p style=\"min-height:1.5em\"><strong>Performance-Oriented</strong>: Always looking for ways to optimise systems and improve performance. 🚀</p></li><li><p style=\"min-height:1.5em\"><strong>Communicator</strong>: Excellent communication skills, able to explain technical concepts clearly to both technical and non-technical team members. 💬</p></li></ul><p style=\"min-height:1.5em\"></p><h1><strong>What We Offer:</strong></h1><ul style=\"min-height:1.5em\"><li><p style=\"min-height:1.5em\"><strong>Autonomy at speed: </strong>High-ownership roles in a fast-moving startup.</p></li><li><p style=\"min-height:1.5em\"><strong>Remote-first flexibility: </strong>Contribute from anywhere, on your schedule.</p></li><li><p style=\"min-height:1.5em\"><strong>Cutting-edge technology:</strong> Work on what interests you most.</p></li><li><p style=\"min-height:1.5em\"><strong>Career growth: </strong>Scale your impact as the company grows.</p></li><li><p style=\"min-height:1.5em\"><strong>Rewarding package: </strong>Competitive pay, equity options, and comprehensive benefits that reflect your skills and experience. </p></li></ul><h2></h2>","tags":"[\"aws\"]","pubDate":"2025-01-21T09:01:27.936Z","link":"https://jobs.ashbyhq.com/synthflow/12c8a764-b1c4-49e6-a39a-178adcf0337e","slug":"senior-go-developer-real-time-voice-telephony-ai-synthflow-9843"},{"id":8744519284,"title":"AI Prompt Engineer | Ruby Labs","company":"Ruby Labs","image":"https://media.licdn.com/dms/image/v2/D4D0BAQF7VVv61POIFw/company-logo_200_200/company-logo_200_200/0/1721937953426?e=1743033600&v=beta&t=_qAkZ_qGO7Du2NSUdHDNbUKIbz28Y1HDm1g9mwNIOnk","description":"<h1><strong>About us</strong></h1><p style=\"min-height:1.5em\">Ruby Labs is a leading tech company that creates and operates innovative consumer products. We offer a diverse range of opportunities across the health, education, and entertainment industries. Our innovative teams are driving the future of consumer-led products, and we're always looking for passionate individuals to join us. Learn more about our story at: <a target=\"_blank\" rel=\"noopener noreferrer nofollow\" href=\"https://rubylabs.com/about-us/\">https://rubylabs.com/about-us/</a></p><p style=\"min-height:1.5em\"></p><h1><strong>About the role</strong></h1><p style=\"min-height:1.5em\">We are seeking an experienced and talented AI Prompt Engineer to join our Ad Labs team at Ruby Labs. This full-time role is crucial for scaling our ad production using AI tools for video and image generation. You will report directly to the Ad Creative Director and collaborate closely with our creative and technical teams to develop innovative advertising creatives.</p><p style=\"min-height:1.5em\"></p><h1><strong>Key Responsibilities</strong></h1><ul style=\"min-height:1.5em\"><li><p style=\"min-height:1.5em\"><strong>AI Creative Leadership:</strong> Oversee the use of AI tools to produce ad creatives (static images and videos), enhancing scalability and efficiency. Lead the entire AI-generated creative process from concept to execution.</p></li><li><p style=\"min-height:1.5em\"><strong>Strategic Collaboration:</strong> Partner with the Ad Creative Director and creative teams to transform advertising concepts into high-quality, ready-to-launch AI-generated visuals and videos.</p></li><li><p style=\"min-height:1.5em\"><strong>Innovative Development:</strong> Remain at the cutting edge of AI technology, proactively exploring and integrating new tools and methods to elevate ad quality and streamline production processes.</p></li><li><p style=\"min-height:1.5em\"><strong>Performance Optimization:</strong> Continuously monitor and analyze the effectiveness of AI-generated ads, utilizing performance data to drive creative improvements and report on outcomes.</p></li></ul><p style=\"min-height:1.5em\"></p><h1><strong>Qualifications</strong></h1><ul style=\"min-height:1.5em\"><li><p style=\"min-height:1.5em\"><strong>Experience:</strong> At least 1 year of experience in an AI-focused role, bonus points if it is within the advertising or creative industry.</p></li><li><p style=\"min-height:1.5em\"><strong>Technical Skills:</strong> Proficient with AI content generation tools like Sora AI, Midjourney, Runway, Arcads, ElevenLabs, Pika AI, ChatGPT, among others. Strong understanding of the advertising production process.</p></li><li><p style=\"min-height:1.5em\"><strong>Education:</strong> Bachelor's degree in Computer Science, AI, Marketing, or related field preferred.</p></li><li><p style=\"min-height:1.5em\"><strong>Portfolio:</strong> Must submit a portfolio showcasing past projects with AI tools, ideally related to advertising.</p></li></ul><p style=\"min-height:1.5em\"></p><h1><strong>Location</strong></h1><p style=\"min-height:1.5em\">Ruby Labs operates within the CET (Central European Time) zone. Applicants from any country are welcome to apply for the position as long as they are located within approximately ± 4 hours of CET. This ensures optimal collaboration and communication during working hours.</p><p style=\"min-height:1.5em\"></p><h1><strong>Benefits</strong></h1><p style=\"min-height:1.5em\">Discover the perks of being part of our vibrant team! We offer:</p><ul style=\"min-height:1.5em\"><li><p style=\"min-height:1.5em\"><strong>Remote Work Environment:</strong> Embrace the freedom to work from anywhere, anytime, promoting a healthy work-life balance. 🏡⏰</p></li><li><p style=\"min-height:1.5em\"><strong>Unlimited PTO:</strong> Enjoy unlimited paid time off to recharge and prioritize your well-being, without counting days. 🌴💼</p></li><li><p style=\"min-height:1.5em\"><strong>Paid National Holidays:</strong> Celebrate and relax on national holidays with paid time off to unwind and recharge. 🎉🌟</p></li><li><p style=\"min-height:1.5em\"><strong>Company-provided MacBook:</strong> Experience seamless productivity with top-notch Apple MacBooks provided to all employees who need them. 💻🚀</p></li><li><p style=\"min-height:1.5em\"><strong>Flexible Independent Contractor Agreement:</strong> Unlock the benefits of flexibility, autonomy, and entrepreneurial opportunities. Benefit from tax advantages, networking opportunities, reduced employment obligations, and the freedom to work from anywhere. Read more about it here: <a target=\"_blank\" rel=\"noopener noreferrer nofollow\" href=\"https://docs.google.com/document/d/1dHF4ctKlez75whdn-ybUwP5d5Wr0BdwVrorrm_fM40Q/preview\">https://docs.google.com/document/d/1dHF4ctKlez75whdn-ybUwP5d5Wr0BdwVrorrm_fM40Q/preview</a> 📈💼</p></li></ul><p style=\"min-height:1.5em\">Be part of our fast-growing team and seize this excellent opportunity for personal and professional growth!</p><p style=\"min-height:1.5em\"></p><h1><strong>Interview Process</strong></h1><ul style=\"min-height:1.5em\"><li><p style=\"min-height:1.5em\"><strong>Application Submission:</strong> Provide your CV along with a portfolio showcasing a variety of AI-generated projects.</p></li><li><p style=\"min-height:1.5em\"><strong>Recruiter Screening (30 minutes):</strong> Discuss your background, experience, and fit for the role.</p></li><li><p style=\"min-height:1.5em\"><strong>Task Assignment:</strong> Demonstrate your skills with AI tools through a practical task related to ad production.</p></li><li><p style=\"min-height:1.5em\"><strong>Final Interview (60 minutes):</strong> Meet with the Ad Creative Director and CEO to discuss your vision for the role and potential impact at Ruby Labs.</p></li></ul><p style=\"min-height:1.5em\"></p><h1><strong>Life at Ruby Labs</strong></h1><p style=\"min-height:1.5em\">At Ruby Labs, we are more than a team; we're a community united in pushing the boundaries of technology and innovation. Our combined passion fuels our ambition for excellence, driving impact that resonates around the globe.</p><p style=\"min-height:1.5em\">We are an equal-opportunity employer and celebrate diversity, recognizing that a diversity of thought and backgrounds builds stronger teams. We approach diversity and inclusion seriously and thoughtfully. We do not discriminate based on race, ethnicity, religion, color, place of birth, sex, gender identity or expression, sexual orientation, age, marital status, military service status, or disability status. Join us and be part of a company that is crafting the future of technology across multiple industries.</p><p style=\"min-height:1.5em\"></p><p style=\"min-height:1.5em\">#Li-Remote</p>","tags":"[]","pubDate":"2025-01-21T08:46:05.390Z","link":"https://jobs.ashbyhq.com/ruby-labs/f7a08877-0fa2-4f50-8fcb-fad90e3cce50","slug":"ai-prompt-engineer-ruby-labs-ruby-labs-8530"},{"id":1570664496,"title":"Website Specialist (Remote - Work from Anywhere)","company":"Xapo Bank","image":"https://avatars.githubusercontent.com/u/6930305?s=200&v=4","description":"&lt;div class=&quot;content-intro&quot;&gt;&lt;p style=&quot;text-align: left;&quot;&gt;&lt;span style=&quot;font-weight: 900;&quot;&gt;Work from anywhere, impact everywhere&amp;nbsp;&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;Diversity is at the heart of who we are at Xapo Bank. We’re a fully distributed team of over 140 Xapiens that work remotely from 40+ countries around the world.&amp;nbsp;&lt;/p&gt;\n&lt;p&gt;Our beginning: A world that enjoys economic freedom and wealth protection, no matter where you live or who is running your country. This is the dream that drove Wences Casares, our Founder and Chairman, to quietly transform the world of banking.&lt;/p&gt;\n&lt;p&gt;To achieve that, we search the world for the best people for the job. We work hard, think globally, and inspire each other to learn and grow. We are committed to changing the way things are done.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Risk is inherent in all of our business activities and managing risk well is the responsibility of every Xapien. Sound risk management enables us to serve our customers and deliver value for our shareholders, and helps make Xapo a great place to work.&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&amp;nbsp;&lt;/p&gt;\n&lt;p style=&quot;text-align: left;&quot;&gt;&lt;em&gt;&lt;span style=&quot;font-weight: 500;&quot;&gt;Although we are headquartered in Gibraltar, this is a full time, 100% remote position&amp;nbsp;&lt;br&gt;&lt;/span&gt;&lt;/em&gt;&lt;em&gt;&lt;span style=&quot;font-weight: 500;&quot;&gt;Work from anywhere!&lt;/span&gt;&lt;/em&gt;&lt;/p&gt;\n&lt;p style=&quot;text-align: left;&quot;&gt;&amp;nbsp;&lt;/p&gt;&lt;/div&gt;&lt;p&gt;&lt;strong&gt;&lt;em&gt;Position overview&lt;/em&gt;&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;Xapo Bank is seeking an innovative expert to craft and optimize our website strategy, transforming it into a dynamic growth engine that drives traffic, engagement, and conversions while delivering an exceptional user experience. This role seamlessly blends analytical insights, backend expertise, and creative design, ensuring our website not only performs at the highest level but also aligns perfectly with the company’s ambitious objectives.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;&lt;em&gt;Responsibilities&lt;/em&gt;&lt;/strong&gt;&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;Develop and execute the strategy for optimizing Xapo’s website to maximize traffic, engagement, and conversions.&lt;/li&gt;\n&lt;li&gt;Work closely with product and engineering teams to implement and improve website analytics tracking, translating business analytics needs into technical requirements.&lt;/li&gt;\n&lt;li&gt;Apply technical SEO principles to ensure optimal organic search rankings and site performance.&lt;/li&gt;\n&lt;li&gt;Monitor website performance using analytics tools, making data-driven recommendations for improvement.&lt;/li&gt;\n&lt;li&gt;Create comprehensive reports on site performance, SEO performance, and key metrics to inform content and growth strategies.&lt;/li&gt;\n&lt;li&gt;Utilize content management systems (CMS) to create and manage website content effectively.&lt;/li&gt;\n&lt;li&gt;Enhance website UI/UX to provide a sticky and engaging user experience.&lt;/li&gt;\n&lt;li&gt;Collaborate with the design team to create and integrate design elements into the website.&lt;/li&gt;\n&lt;li&gt;Leverage web analytics tools (e.g., Google Analytics), CDPs (e.g., Segment), BI tools (e.g., Looker), and Google Tag Manager to track and analyze performance.&lt;/li&gt;\n&lt;li&gt;Web development skills (e.g., HTML, JavaScript) are a plus for implementing technical changes and enhancements.&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;&lt;strong&gt;&lt;em&gt;Skills needed&lt;/em&gt;&lt;/strong&gt;&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;Proven experience in website management, digital marketing, or related roles in the crypto industry.&lt;/li&gt;\n&lt;li&gt;Demonstrated expertise in website optimization, analytics, and SEO strategies.&lt;/li&gt;\n&lt;li&gt;Proficiency with web analytics tools (e.g., Google Analytics, Amplitude), CDPs (e.g., Segment), BI tools (e.g., Looker), and Google Tag Manager.&lt;/li&gt;\n&lt;li&gt;Fluent in technical SEO principles, including on-page, off-page, and backend optimization&lt;/li&gt;\n&lt;li&gt;Strong analytical mindset with the ability to translate data insights into actionable strategies.&lt;/li&gt;\n&lt;li&gt;Experience in creating detailed performance reports for website and SEO metrics.&lt;/li&gt;\n&lt;li&gt;Ability to align website strategy with broader business objectives and growth goals.&lt;/li&gt;\n&lt;li&gt;Experience working cross-functionally with product, engineering, and marketing teams to implement improvements.&lt;/li&gt;\n&lt;li&gt;Knowledge of UX/UI principles to enhance the user experience.&lt;/li&gt;\n&lt;li&gt;Familiarity with web development technologies (HTML, CSS, JavaScript) is a plus.&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;&lt;strong&gt;&lt;em&gt;Other requirements&lt;/em&gt;&lt;/strong&gt;&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;A dedicated workspace.&lt;/li&gt;\n&lt;li&gt;A reliable internet connection with the fastest speed possible in your area.&lt;/li&gt;\n&lt;li&gt;Devices and other essential equipment that meet minimal technical specifications.&lt;/li&gt;\n&lt;li&gt;Alignment with Our Values and the Xapo Values-Driven Leadership principles.&lt;/li&gt;\n&lt;/ul&gt;&lt;div class=&quot;content-conclusion&quot;&gt;&lt;p&gt;&lt;span style=&quot;font-size: 12pt;&quot;&gt;&lt;strong&gt;Why work for Xapo?&lt;/strong&gt;&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span style=&quot;font-weight: 500; font-size: 10pt;&quot;&gt;IMPACT GLOBALLY, WORK REMOTELY.&lt;/span&gt;&lt;/p&gt;\n&lt;ul&gt;\n&lt;li style=&quot;font-weight: 500;&quot;&gt;&lt;strong&gt;Shape the Future:&lt;/strong&gt;&lt;span style=&quot;font-weight: 500;&quot;&gt; Improve lives through cutting-edge technology, work 100% remotely from anywhere in the world.&lt;/span&gt;&lt;/li&gt;\n&lt;li style=&quot;font-weight: 500;&quot;&gt;&lt;strong&gt;Great work-life balance:&lt;/strong&gt;&lt;span style=&quot;font-weight: 500;&quot;&gt; &lt;/span&gt;&lt;span style=&quot;font-weight: 500;&quot;&gt;Build amazing things with a balance of autonomy and collaborative teamwork. Set your own work schedule and make use of a flexible PTO plan when you need to recharge.&lt;/span&gt;&lt;span style=&quot;font-weight: 500;&quot;&gt;&amp;nbsp;&lt;/span&gt;&lt;/li&gt;\n&lt;li style=&quot;font-weight: 500;&quot;&gt;&lt;strong&gt;Expect Excellence:&lt;/strong&gt;&lt;span style=&quot;font-weight: 500;&quot;&gt; Collaborate, learn, and grow with a high-performance team. Learn&lt;/span&gt;&lt;span style=&quot;font-weight: 500;&quot;&gt; how you learn best - from books to conferences, you’ll get a yearly budget for your individual learning and development goals.&lt;/span&gt;&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;&lt;strong&gt;At Xapo, we prioritize consumer protection and adhere to regulatory requirements by ensuring that all Xapiens are accountable for upholding principles of fair treatment, transparency, and ethical conduct in their interactions with customers and stakeholders.&lt;/strong&gt;&lt;/p&gt;&lt;/div&gt;","tags":"[\"javascript\",\"management\",\"engineering\"]","pubDate":"2025-01-21T07:26:23.000Z","link":"https://job-boards.greenhouse.io/xapo61/jobs/6306335003","slug":"website-specialist-remote-work-from-anywhere-xapo-bank-4524"},{"id":7668033364,"title":"Freelance | Contract Senior Quality Assurance Analyst","company":"10up","image":"https://pbs.twimg.com/profile_images/2738508979/760be3edebfa0195e36fb3dba07297c1_400x400.png","description":"&lt;p&gt;&lt;strong&gt;Location: Remote - Asia &lt;/strong&gt;&lt;span style=&quot;font-weight: 400;&quot;&gt;(Open to applicants located anywhere IST timezone (+/-4))&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span style=&quot;font-weight: 400;&quot;&gt;As an experienced Senior Quality Assurance Analyst at 10up, you’ll be responsible for carrying out manual, visual and functional testing throughout the software development life cycle on unique projects across large web builds and ongoing retainers for high priority clients - ensuring that we not only meet defined requirements, but that we consistently deliver the highest quality experience for our end users.&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span style=&quot;font-weight: 400;&quot;&gt;As a leading digital agency, 10up’s client roster spans from innovative startups and impactful non-profits to some of the biggest names in the industry, such as ESPN, Google, The New York Times Co., Microsoft, and The Nobel Prize Committee.&lt;/span&gt;&lt;span style=&quot;font-weight: 400;&quot;&gt;&lt;br&gt;&lt;/span&gt;&lt;span style=&quot;font-weight: 400;&quot;&gt;&lt;br&gt;&lt;/span&gt;As a 10up contractor, you have options for flexible and alternative work schedules. Intentionally remote since day one, spanning six continents and 40 countries, 10up fully embraces the benefits of distributed work.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;What you will do:&amp;nbsp;&lt;/strong&gt;&lt;/p&gt;\n&lt;ul&gt;\n&lt;li style=&quot;font-weight: 400;&quot;&gt;&lt;span style=&quot;font-weight: 400;&quot;&gt;Act as the day-to-day QA Owner for dedicated client projects, exhibiting senior-level ownership over QA planning and execution.&lt;/span&gt;&lt;/li&gt;\n&lt;li style=&quot;font-weight: 400;&quot;&gt;&lt;span style=&quot;font-weight: 400;&quot;&gt;Lead QA ownership on multiple projects (mix of build and retainer).&amp;nbsp;&lt;/span&gt;&lt;/li&gt;\n&lt;li style=&quot;font-weight: 400;&quot;&gt;&lt;span style=&quot;font-weight: 400;&quot;&gt;Successfully create and execute on QA and test case plans by exhibiting ownership of assigned work, proactively flagging blockers, and ensuring alignment of individual output with expected milestones and deadlines. Test cases should follow industry standards and cover all aspects of the property being tested.&lt;/span&gt;&lt;/li&gt;\n&lt;li style=&quot;font-weight: 400;&quot;&gt;&lt;span style=&quot;font-weight: 400;&quot;&gt;Ensure superior quality deliverables by engaging cross-discipline leadership, enforcing rigorous QA processes and standards, and taking senior-level ownership of end to end delivery and client satisfaction.&lt;/span&gt;&lt;/li&gt;\n&lt;li style=&quot;font-weight: 400;&quot;&gt;&lt;span style=&quot;font-weight: 400;&quot;&gt;Leverage 10up tools, standards, and processes in all client work. Maintain highly collaborative relationships with project managers and discipline directors to achieve elite project outcomes.&lt;/span&gt;&lt;/li&gt;\n&lt;li style=&quot;font-weight: 400;&quot;&gt;&lt;span style=&quot;font-weight: 400;&quot;&gt;Actively participate in project discovery to align on QA project requirements. Assist with translating requirements into comprehensive approaches for QA and test case plans that meet established timelines and budgets.&lt;/span&gt;&lt;/li&gt;\n&lt;li style=&quot;font-weight: 400;&quot;&gt;&lt;span style=&quot;font-weight: 400;&quot;&gt;Demonstrate a senior-level consultative, client-focused approach through an understanding of underlying client business goals and objectives and support the project team to identify strategic and proactive preventative QA solutions.&amp;nbsp;&lt;/span&gt;&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;&lt;strong&gt;About you:&amp;nbsp;&lt;/strong&gt;&lt;/p&gt;\n&lt;ul&gt;\n&lt;li style=&quot;font-weight: 400;&quot;&gt;&lt;span style=&quot;font-weight: 400;&quot;&gt;You have at least 4+ years of Quality Assurance experience (preferably in an agency environment) for web-based technology projects; specifically focused on quality assurance testing for web applications and software products, including cross-browser and cross-device testing -- emulated and on-device.&lt;/span&gt;&lt;/li&gt;\n&lt;li style=&quot;font-weight: 400;&quot;&gt;&lt;span style=&quot;font-weight: 400;&quot;&gt;You are comfortable with major computer and mobile operating systems, including Windows 10, Mac OS/X, iOS, Android, and the major browsers that operate on them (e.g. Safari, Firefox, Chrome), as well as having experience defining tests and reviewing test results with BrowserStack and other cross-platform testing tools.&lt;/span&gt;&lt;/li&gt;\n&lt;li style=&quot;font-weight: 400;&quot;&gt;&lt;span style=&quot;font-weight: 400;&quot;&gt;You have experience writing detail-oriented test plans and test cases for manual testing.&lt;/span&gt;&lt;/li&gt;\n&lt;li style=&quot;font-weight: 400;&quot;&gt;&lt;span style=&quot;font-weight: 400;&quot;&gt;You apply critical thinking, user empathy, adaptability, and an attention to detail in everything you do, enabling you to not only troubleshoot bugs, but to also identify and offer preventative solutions to potential quality issues before they become problems.&amp;nbsp;&lt;/span&gt;&lt;/li&gt;\n&lt;li style=&quot;font-weight: 400;&quot;&gt;&lt;span style=&quot;font-weight: 400;&quot;&gt;You are comfortable being a part of and managing time against multiple parallel cross-functional delivery teams, and directly owning the success of QA across your projects.&lt;/span&gt;&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;&lt;strong&gt;Join our Contractor Pool!&amp;nbsp;&lt;/strong&gt;&lt;span style=&quot;font-weight: 400;&quot;&gt;&lt;br&gt;&lt;/span&gt;&lt;span style=&quot;font-weight: 400;&quot;&gt;&lt;br&gt;&lt;/span&gt;&lt;span style=&quot;font-weight: 400;&quot;&gt;We are currently accepting applications for potential upcoming freelance QA opportunities. If you are passionate about 10up&#39;s mission and great QA work, please apply. We&#39;d appreciate the opportunity to personally review your application. Everyone gets a response.&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span style=&quot;font-weight: 400;&quot;&gt;Read more about &lt;/span&gt;&lt;a href=&quot;https://drive.google.com/file/d/1nQ9yWRqfDAdrriYRnBNzYo7w59auYxMe/view&quot;&gt;&lt;span style=&quot;font-weight: 400;&quot;&gt;What to Expect&lt;/span&gt;&lt;/a&gt;&lt;span style=&quot;font-weight: 400;&quot;&gt; through our Recruiting process.&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span style=&quot;font-weight: 400;&quot;&gt;We don&#39;t want you to miss any communication from us! To ensure you receive updates on your application, please add jobs@10up.com to your contacts list! #LI-Remote&lt;/span&gt;&lt;/p&gt;","tags":"[]","pubDate":"2025-01-20T23:45:13.000Z","link":"https://job-boards.greenhouse.io/10up/jobs/4500249008","slug":"freelance-contract-senior-quality-assurance-analyst-10up-7045"},{"id":4020942719,"title":"Account Executive (Inbound & Outbound)","company":"Owner","image":"https://avatars.githubusercontent.com/u/87661266?s=200&v=4","description":"<div><span style=\"font-size: 13pt\">👋 </span><b style=\"font-size: 13pt;\">About </b><b><a style=\"font-size: 13pt;\" href=\"http://owner.com/\">Owner.com</a></b></div><div><br></div><div><span style=\"font-size: 11pt;\">Owner is the all-in-one platform that restaurants use to succeed online.&nbsp;</span></div><div><br></div><div><span style=\"font-size: 11pt;\">Thousands of restaurant owners use our tools to build their website, drive online orders, create their own branded app, manage their customer relationships, and set up marketing automations.&nbsp;</span></div><div><br></div><div><span style=\"font-size: 14.6667px;\">You can think of it as Shopify meets HubSpot, but specifically for restaurants.&nbsp;</span></div><div><br></div><div><span style=\"font-size: 11pt;\">Learn more about the problems we are solving for our customers </span><a style=\"font-size: 11pt;\" href=\"https://www.owner.com/our-story\">here</a><span style=\"font-size: 11pt;\">.&nbsp;</span></div><div><br></div><div><span style=\"font-size: 13pt\">🌎</span><b style=\"font-size: 13pt;\"> Our vision</b></div><div><br></div><div><span style=\"font-size: 11pt;\">We’re starting by helping independent restaurants succeed online.</span></div><div><br></div><div><span style=\"font-size: 11pt;\">But it’s not just restaurants that need our help. All local service-based businesses are struggling with these same problems. Huge technology corporations are taking their customers, bleeding their profits, and making it hard for them to survive.</span></div><div><br></div><div><span style=\"font-size: 11pt;\">So, once we nail the solution for restaurants&nbsp;–&nbsp;we’ll scale it into every other local business type.</span></div><div><br></div><div><span style=\"font-size: 11pt;\">In the future we envision, we’ll build the technology that tens of millions of local business owners need to succeed in the digital age.</span></div><div><br></div><div><br></div><div><span style=\"font-size: 13pt\">🚀 </span><b style=\"font-size: 13pt;\">Our traction</b></div><div><br></div><div><span style=\"font-size: 11pt;\">In just over 3 years we've generated </span><span style=\"font-size: 15px;\">tens of millions in revenue, served millions of guests, and have processed hundreds of millions of orders.</span></div><div><br></div><div><span style=\"font-size: 11pt;\">More importantly, we’ve helped thousands of restaurant owners save their businesses - and not&nbsp; only survive, but thrive.</span></div><div><br></div><div><br></div><div><span style=\"font-size: 13pt\">⭐ </span><b style=\"font-size: 13pt;\">Our team</b></div><div><br></div><div><span style=\"font-size: 15px;\">Our team grew from 90 people to over 150 people in 2024. We’ve got top talent from the most successful companies in SMB software like Shopify, HubSpot, DoorDash, Procore and ServiceTitan. We’ll be scaling even faster in 2025 to keep pace with our customer growth.</span></div><div><br></div><div>How we work: Owner is a remote-first, global company with a home base in San Francisco. For some of our creative teams we prioritize in-person collaboration at our SF HQ. The rest of our employees are distributed throughout the world.</div><div><br></div><div>🫵 <b>Why we’re looking for you</b></div><div>We are looking for Account Executives to join our growing sales team. This role is best suited for people who are passionate about helping small businesses grow, have a track record of sales excellence and are committed to building trusting relationships with restaurant owners.</div><div><br></div><div>This role is 100% remote and can be based anywhere in the United States or Canada.</div><div>🫵 <b>Why we’re looking for you</b></div><div>We are looking for Account Executives to join our growing sales team. This role is best suited for people who are passionate about helping small businesses grow, have a track record of sales excellence and are committed to building trusting relationships with restaurant owners.</div><div><br></div><div>This role is 100% remote and can be based anywhere in the United States or Canada.</div><h3>💻 The impact you will have</h3><li>Become an expert in our product and the industry so that you can advise restaurant owners in a high-trust manner.</li><li>Collaborate with restaurant owners to align their goals and objectives with our product capabilities.</li><li>Sell on value and return on investment (ROI) vs. technical functionality</li><li>Build and maintain a strong sales pipeline alongside the XDR team. </li><li>Collaborate closely with our onboarding team to deliver a seamless launch of product to our clients.</li><li>Educate yourself daily by reading, listening to podcasts, and learning from your teammates and peers.</li><li>Go above and beyond delivering and exceeding your quota to help your teammates and the company succeed.</li><h3>✅ Minimum requirements</h3><li>2+ years of experience in software sales, preferably high-volume SMB SaaS sales - with closing experience</li><li>Consultative, customer-first sales approach</li><li>History of personal and professional excellence </li><li>Lifelong learner mindset and commitment to professional growth and development</li><li>You thrive while working in a fast-paced environment where change is common.</li><li>You have strong sales acumen, effective time management and organization skills.</li><li>Experience with restaurants (selling to or working in!) is a huge plus.</li><h3>🏆 Pay and benefits</h3><li>The compensation range for these roles is USD $130,000 -  150,000, on-Target Earnings (50/50 base + variable bonus), plus a generous equity pre-IPO equity package.</li><li>Other benefits include comprehensive health coverage, work from anywhere (100% remote workplace), unlimited PTO - plus extra fun perks!</li><div><br></div><div><b><span style=\"font-size: 10px\">🚩 Notice - Employment Scams</span></b></div><div><span style=\"font-size: 10px\">Please note that any communication from our hiring team regarding job opportunities will only be made by an Owner employee with an @owner.com email address.</span></div><div><br></div><div><span style=\"font-size: 10px\">We will never ask you to provide personal or financial information, including but not limited to: your social security number, credit card numbers, passport information and other related banking information.&nbsp;If you believe you are being contacted by scammer, please mark the communication as \"phishing\" or “spam” and do not respond.</span></div><div><span style=\"font-size: 13pt\">👋 </span><b style=\"font-size: 13pt;\">About </b><b><a href=\"http://owner.com/\" style=\"font-size: 13pt;\">Owner.com</a></b></div><div><br></div><div><span style=\"font-size: 11pt;\">Owner is the all-in-one platform that restaurants use to succeed online.&nbsp;</span></div><div><br></div><div><span style=\"font-size: 11pt;\">Thousands of restaurant owners use our tools to build their website, drive online orders, create their own branded app, manage their customer relationships, and set up marketing automations.&nbsp;</span></div><div><br></div><div><span style=\"font-size: 14.6667px;\">You can think of it as Shopify meets HubSpot, but specifically for restaurants.&nbsp;</span></div><div><br></div><div><span style=\"font-size: 11pt;\">Learn more about the problems we are solving for our customers </span><a href=\"https://www.owner.com/our-story\" style=\"font-size: 11pt;\">here</a><span style=\"font-size: 11pt;\">.&nbsp;</span></div><div><br></div><div><span style=\"font-size: 13pt\">🌎</span><b style=\"font-size: 13pt;\"> Our vision</b></div><div><br></div><div><span style=\"font-size: 11pt;\">We’re starting by helping independent restaurants succeed online.</span></div><div><br></div><div><span style=\"font-size: 11pt;\">But it’s not just restaurants that need our help. All local service-based businesses are struggling with these same problems. Huge technology corporations are taking their customers, bleeding their profits, and making it hard for them to survive.</span></div><div><br></div><div><span style=\"font-size: 11pt;\">So, once we nail the solution for restaurants&nbsp;–&nbsp;we’ll scale it into every other local business type.</span></div><div><br></div><div><span style=\"font-size: 11pt;\">In the future we envision, we’ll build the technology that tens of millions of local business owners need to succeed in the digital age.</span></div><div><br></div><div><br></div><div><span style=\"font-size: 13pt\">🚀 </span><b style=\"font-size: 13pt;\">Our traction</b></div><div><br></div><div><span style=\"font-size: 11pt;\">In just over 3 years we've generated </span><span style=\"font-size: 15px;\">tens of millions in revenue, served millions of guests, and have processed hundreds of millions of orders.</span></div><div><br></div><div><span style=\"font-size: 11pt;\">More importantly, we’ve helped thousands of restaurant owners save their businesses - and not&nbsp; only survive, but thrive.</span></div><div><br></div><div><br></div><div><span style=\"font-size: 13pt\">⭐ </span><b style=\"font-size: 13pt;\">Our team</b></div><div><br></div><div><span style=\"font-size: 15px;\">Our team grew from 90 people to over 150 people in 2024. We’ve got top talent from the most successful companies in SMB software like Shopify, HubSpot, DoorDash, Procore and ServiceTitan. We’ll be scaling even faster in 2025 to keep pace with our customer growth.</span></div><div><br></div><div>How we work: Owner is a remote-first, global company with a home base in San Francisco. For some of our creative teams we prioritize in-person collaboration at our SF HQ. The rest of our employees are distributed throughout the world.</div>","tags":"[\"management\"]","pubDate":"2025-01-20T17:30:39.857Z","link":"https://jobs.lever.co/owner/40be2474-c614-4028-9023-3f6f124d9c11","slug":"account-executive-inbound-outbound-owner-4855"},{"id":7245993027,"title":"Head of Business Development (DACH, BNL, Nordics)","company":"Airalo","image":"https://lever-client-logos.s3.us-west-2.amazonaws.com/55028a36-609c-479c-9553-d4689ff2dd8c-1669620566663.png","description":"<div><b>About Airalo</b></div><div>Alo! Airalo is the world’s first eSIM store that helps people connect in over 200+ countries and regions across the globe. We are building the next digital service that revolutionizes the telecom industry. We are a travel-tech company and an equal-opportunity environment that values and executes diversity, inclusion, and equity. Our team is spread across 50+ countries and six continents. What glues us together is our commitment to changing the way you connect<span style=\"font-size: 13.3333px\">. </span></div><div><br></div><div><b>About you</b></div><div>We hope that you care deeply about the quality of your work, the intrinsic worth of tasks, and the success of your team. You are self-disciplined and do not require micromanagement in terms of your skillset and work ethic. You do your best to flourish as an individual every day while working hard to foster a collaborative team environment. You believe in the importance of being — and staying — authentic, honest, positive, and kind. You are a good interlocutor with clear and concise communication. You are able to manage multiple projects, have an analytical mind, pay keen attention to detail, and love to get your hands dirty. You are cognizant, tolerant, and welcoming of vulnerabilities and cultural differences.</div><div><br></div><div><b>About the Role</b></div><div><b>Position</b>: Full-time / Employee</div><div><b>Location:</b>&nbsp;Remote-first </div><div><b>Benefits:</b>&nbsp;Health Insurance, work-from-anywhere stipend, annual wellness &amp; learning credits, annual all-expenses-paid company retreat in a gorgeous destination &amp; other benefits</div><div><br></div><div>Airalo is looking for a <b>Head of Business Development</b> to join the <b>Airalo Partnerships</b> department.</div><div>Expensive roaming and physical SIM cards are passe. The future of connectivity, for leisure and business travelers, is through eSIMs. As the undisputed industry leader in the B2C segment, we are looking to extend our leadership to the B2B (business travel) and the B2B2C (resellers) channels.</div><div>As the <b>Head of Business Development for then DACH, BNL and Nordic regions</b>, you will lead Airalo’s B2B and B2B2C strategy and execution to ensure Airalo’s presence across the business travel and reseller channels.</div><h3>Responsibilities include but are not limited to:</h3><li>Work closely with our Director of Partnerships and other team members in the department</li><li>Collaborate with the Growth team and partnerships specialists for market mapping of small, medium and enterprise prospects for Airalo Business and travel agents, tour operators and retail stores for Airalo Partner Platform</li><li>Onboard and support new partners as they join the Airalo Partners community</li><li>Build and maintain fruitful relationships with key stakeholders in the partner organization to drive mutual benefits</li><li>Drive visibility, awareness and adoption for Airalo in the partner organization</li><li>Design and manage a program to educate businesses on eSIM adoption</li><li>Support research efforts to keep track of competing developments in the market(s) to help maintain Airalo’s status as the preferred provider across partners</li><li>Collaborate and work with different internal and external stakeholders to develop and execute projects/opportunities successfully</li><li>Own and deliver monthly, quarterly and annual OKRs with regular tracking and progress reports</li><div><br></div><div><b>Must-haves:</b></div><li>7+ years of experience in corporate sales (preferred) or channel sales in the relevant market(s)</li><li>Experience in the travel and / or telecom industry or with corporate sales in a consumer business</li><li>You must be able to forge and nurture relationships with stakeholders across the channel</li><li>Ability to narrate a good story - Airalo’s unique story and the problem we solve for our users makes it a compelling pitch for customers and partners</li><li>Ability to employ sales techniques, including effective questioning, objection handling, consultative selling, and solution selling</li><li>Ability to multi-task</li><li>Experience with sales and partnerships tools e.g. Hubspot</li><li>Fluency in both English and German</li><div>If you are interested in this position, <b>please apply via the link.</b></div><div><br></div><div>We sincerely thank all applicants in advance for submitting their interest in this opportunity. Airalo is an equal opportunity employer and values diversity, equity &amp; inclusion. We do not discriminate on the basis of race, religion, national origin, gender, sexual orientation, age, marital status, veteran status, or disability status. We are committed to providing reasonable accommodations upon request for individuals with disabilities throughout our job interview process.</div>","tags":"[\"management\",\"b2c\",\"b2b\"]","pubDate":"2025-01-20T16:56:23.349Z","link":"https://jobs.lever.co/airalo/f8210310-e3fc-4663-b16e-f928ba72efea","slug":"head-of-business-development-dach-bnl-nordics-airalo-6687"},{"id":6822078975,"title":"Head of Business Development (Andean Region)","company":"Airalo","image":"https://lever-client-logos.s3.us-west-2.amazonaws.com/55028a36-609c-479c-9553-d4689ff2dd8c-1669620566663.png","description":"<div><b>About Airalo</b></div><div>Alo! Airalo is the world’s first eSIM store that helps people connect in over 200+ countries and regions across the globe. We are building the next digital service that revolutionizes the telecom industry. We are a travel-tech company and an equal-opportunity environment that values and executes diversity, inclusion, and equity. Our team is spread across 50+ countries and six continents. What glues us together is our commitment to changing the way you connect<span style=\"font-size: 13.3333px\">. </span></div><div><br></div><div><b>About you</b></div><div>We hope that you care deeply about the quality of your work, the intrinsic worth of tasks, and the success of your team. You are self-disciplined and do not require micromanagement in terms of your skillset and work ethic. You do your best to flourish as an individual every day while working hard to foster a collaborative team environment. You believe in the importance of being — and staying — authentic, honest, positive, and kind. You are a good interlocutor with clear and concise communication. You are able to manage multiple projects, have an analytical mind, pay keen attention to detail, and love to get your hands dirty. You are cognizant, tolerant, and welcoming of vulnerabilities and cultural differences.</div><div><br></div><div><b>About the Role</b></div><div><b>Position</b>: Full-time / Employee</div><div><b>Location:</b>&nbsp;Remote-first </div><div><b>Benefits:</b>&nbsp;Health Insurance, work-from-anywhere stipend, annual wellness &amp; learning credits, annual all-expenses-paid company retreat in a gorgeous destination &amp; other benefits</div><div><br></div><div>Airalo is looking for a <b>Head of Business Development</b> to join the <b>Airalo Partnerships</b> department.</div><div>Expensive roaming and physical SIM cards are passe. The future of connectivity, for leisure and business travelers, is through eSIMs. As the undisputed industry leader in the B2C segment, we are looking to extend our leadership to the B2B (business travel) and the B2B2C (resellers) channels.</div><div>As the <b>Head of Business Development for the Andean Region</b>, you will lead Airalo’s B2B and B2B2C strategy and execution to ensure Airalo’s presence across the business travel and reseller channels.</div><h3>Responsibilities include but are not limited to:</h3><li>Work closely with our Director of Partnerships and other team members in the department</li><li>Collaborate with the Growth team and partnerships specialists for market mapping of small, medium and enterprise prospects for Airalo Business and travel agents, tour operators and retail stores for Airalo Partner Platform</li><li>Onboard and support new partners as they join the Airalo Partners community</li><li>Build and maintain fruitful relationships with key stakeholders in the partner organization to drive mutual benefits</li><li>Drive visibility, awareness and adoption for Airalo in the partner organization</li><li>Design and manage a program to educate businesses on eSIM adoption</li><li>Support research efforts to keep track of competing developments in the market(s) to help maintain Airalo’s status as the preferred provider across partners</li><li>Collaborate and work with different internal and external stakeholders to develop and execute projects/opportunities successfully</li><li>Own and deliver monthly, quarterly and annual OKRs with regular tracking and progress reports</li><div><br></div><div><b>Must-haves:</b></div><li>7+ years of experience in corporate sales (preferred) or channel sales in the relevant market(s)</li><li>Experience in the travel and / or telecom industry or with corporate sales in a consumer business</li><li>You must be able to forge and nurture relationships with stakeholders across the channel</li><li>Ability to narrate a good story - Airalo’s unique story and the problem we solve for our users makes it a compelling pitch for customers and partners</li><li>Ability to employ sales techniques, including effective questioning, objection handling, consultative selling, and solution selling</li><li>Ability to multi-task</li><li>Experience with sales and partnerships tools</li><li>Perfect verbal and written communication skills in English</li><div>If you are interested in this position, <b>please apply via the link.</b></div><div><br></div><div>We sincerely thank all applicants in advance for submitting their interest in this opportunity. Airalo is an equal opportunity employer and values diversity, equity &amp; inclusion. We do not discriminate on the basis of race, religion, national origin, gender, sexual orientation, age, marital status, veteran status, or disability status. We are committed to providing reasonable accommodations upon request for individuals with disabilities throughout our job interview process.</div>","tags":"[\"management\",\"b2c\",\"b2b\"]","pubDate":"2025-01-20T16:51:51.446Z","link":"https://jobs.lever.co/airalo/4241f2ce-f857-43e8-af07-8365e1aaf486","slug":"head-of-business-development-andean-region-airalo-3758"},{"id":3768214111,"title":"Content Designer","company":"Airalo","image":"https://lever-client-logos.s3.us-west-2.amazonaws.com/55028a36-609c-479c-9553-d4689ff2dd8c-1669620566663.png","description":"<div><b>About Airalo</b></div><div>Alo! Airalo is the world’s first eSIM store that helps people connect in over 200+ countries and regions across the globe. We are building the next digital service that revolutionizes the telecom industry. We are a travel-tech company and an equal-opportunity environment that values and executes diversity, inclusion, and equity. Our team is spread across 50+ countries and six continents. What glues us together is our commitment to changing the way you connect<span style=\"font-size: 13.3333px\">. </span></div><div><br></div><div><b>About you</b></div><div>We hope that you care deeply about the quality of your work, the intrinsic worth of tasks, and the success of your team. You are self-disciplined and do not require micromanagement in terms of your skillset and work ethic. You do your best to flourish as an individual every day while working hard to foster a collaborative team environment. You believe in the importance of being — and staying — authentic, honest, positive, and kind. You are a good interlocutor with clear and concise communication. You are able to manage multiple projects, have an analytical mind, pay keen attention to detail, and love to get your hands dirty. You are cognizant, tolerant, and welcoming of vulnerabilities and cultural differences.</div><div><br></div><div><b>About the Role</b></div><div><b>Position</b>: Full-time / Employee</div><div><b>Location:</b>&nbsp;Remote-first </div><div><b>Benefits:</b>&nbsp;Health Insurance, work-from-anywhere stipend, annual wellness &amp; learning credits, annual all-expenses-paid company retreat in a gorgeous destination &amp; other benefits</div><div><br></div><div>As a Content Designer working solely in our Partner Experience division (PX), you’ll also be a part of our Product Design Guild and will work to improve each step of our users’ experience across our B2B products. You’ll use your expert copy and content skills to deliver clear content hierarchies, interface language, and product education materials.</div><div><br></div><div>You’ll play a key role in defining product content strategy, collaborating with Product, Design, Brand, Growth, and Support teams to ensure an aligned approach to content across channels. You’ll be a voice of the user and have a deep understanding of our partners’ needs, utilizing quantitative and qualitative research to inform your decision making.</div><div><br></div><div>You’ll regularly review and edit product content to ensure it serves our users’ needs. You’ll contribute to defining the tone of voice and style for Airalo’s B2B products, including the maintenance of living documents such as guidelines and glossaries. You’ll always keep a global audience in mind, working closely with our localization manager to scale the impact of your work to our partners across the globe.</div><h3>Responsibilities include, but are not limited to:</h3><li>Deliver clear, concise product copy for Airalo’s B2B products.</li><li>Work closely with designers, product managers, and engineers to implement user-centric content decisions.</li><li>Drive B2B product content strategy in collaboration with key stakeholders in Design, Research, Product, Engineering, Brand, Growth, and Support.</li><li>Support in defining our product copy style guide, tone of voice, and glossary.</li><li>Manage translations in collaboration with localization managers.</li><li>Iterate on content and copy based on both qualitative and quantitative user feedback.</li><li>Create efficient content workflow from brief to delivery.</li><li>Demonstrate the impact of considered, consistent content to greater the Airalo team.</li><li>Ability to work proactively, autonomously, and remotely.</li><li>Quickly become a subject matter expert across Airalo’s product suite.</li>,<h3>Must-haves:</h3><li>Degree or equivalent practical experience.</li><li>3+ years or similar of dedicated experience writing or editing content for web and mobile applications.</li><li>Prior experience working in a tech/startup environment.</li><li>Excellent written and verbal communication skills in English (English is Airalo’s working language, American English is our source language for content).</li><li>Ability to effectively manage multiple work streams and deadlines.</li><li>A portfolio of work and collection case studies that show a range of content you’ve created&nbsp;— such as interaction flows, emails, product tours, educational materials, and style guides (A link to your online portfolio, or a PDF, is required. Applications without it are unlikely to be considered).</li>,<h3>Good-to-have:</h3><li>Experience working on at least two substantial product cycles, from inception to delivery.</li><li>Prior work experience in telecommunications.</li><li>Prior work experience working on B2B/SaaS products.</li><li>Experience working with teams across multiple time zones.</li><li>Experience working with Figma.</li><div><span style=\"font-size: 15px;\">If you are interested in this position,&nbsp;</span><b style=\"font-size: 15px;\">please apply via the link.</b></div><div><br></div><div><i style=\"font-size: 15px;\">Please note that our Engineering &amp; Product team works in the CET timezone, so candidates will need to reside in countries with the same time zone or similar to it and will need to already have permit to work in the country where they are based.</i></div><div><br></div><div>We sincerely thank all applicants in advance for submitting their interest in this opportunity. Airalo is an equal opportunity employer and values diversity, equity &amp; inclusion. We do not discriminate on the basis of race, religion, national origin, gender, sexual orientation, age, marital status, veteran status, or disability status. We are committed to providing reasonable accommodations upon request for individuals with disabilities throughout our job interview process.</div>","tags":"[\"management\",\"engineering\",\"b2b\"]","pubDate":"2025-01-20T14:27:17.842Z","link":"https://jobs.lever.co/airalo/c7c31c43-b6bc-4ca1-bbf0-8117c7be3ad3","slug":"content-designer-airalo-1"},{"id":1484722739,"title":"Senior Product Designer","company":"Airalo","image":"https://lever-client-logos.s3.us-west-2.amazonaws.com/55028a36-609c-479c-9553-d4689ff2dd8c-1669620566663.png","description":"<div><b>About Airalo</b></div><div>Alo! Airalo is the world’s first eSIM store that helps people connect in over 200+ countries and regions across the globe. We are building the next digital service that revolutionizes the telecom industry. We are a travel-tech company and an equal-opportunity environment that values and executes diversity, inclusion, and equity. Our team is spread across 50+ countries and six continents. What glues us together is our commitment to changing the way you connect<span style=\"font-size: 13.3333px\">. </span></div><div><br></div><div><b>About you</b></div><div>We hope that you care deeply about the quality of your work, the intrinsic worth of tasks, and the success of your team. You are self-disciplined and do not require micromanagement in terms of your skillset and work ethic. You do your best to flourish as an individual every day while working hard to foster a collaborative team environment. You believe in the importance of being — and staying — authentic, honest, positive, and kind. You are a good interlocutor with clear and concise communication. You are able to manage multiple projects, have an analytical mind, pay keen attention to detail, and love to get your hands dirty. You are cognizant, tolerant, and welcoming of vulnerabilities and cultural differences.</div><div><br></div><div><b>About the Role</b></div><div><b>Position</b>: Full-time / Employee</div><div><b>Location:</b>&nbsp;Remote-first </div><div><b>Benefits:</b>&nbsp;Health Insurance, work-from-anywhere stipend, annual wellness &amp; learning credits, annual all-expenses-paid company retreat in a gorgeous destination &amp; other benefits</div><div><br></div><div>Our Senior Product Designers are self-starters, able to work autonomously, and with purpose. They’re output-focused and able to use, adjust or invent processes and tools when needed and you know when ‘perfect’ is and isn’t the appropriate solution.</div><div><br></div><div>We’re looking for someone who is a remarkable communicator, and can hold a room with their articulate thinking and ideas. Finally, they are design practitioners, constantly striving to improve their approach to work and will share this across disciplines with your peers.</div><div><br></div><div>You will share the responsibility for helping to deploy the design vision for highly successful Airalo products in the User Experience Division - purely focusing on our consumer products. You will also become a close-knit member of the Airalo Product Design Guild.</div><div><br></div><div>You will work in lockstep with peers from Design, Product Management, Research, Engineering, and Growth to ensure that our strategy is executed and delivered to our business customers within the design standards set together with the utmost attention to detail. You have a mentor mindset, and take pride in seeing others succeed as a result of your support and mentorship.</div><h3>Responsibilities:</h3><li>Designing high-fidelity user interfaces for consumer native mobile (Android &amp; iOS) and web applications.</li><li>Creating and delivering process flows, wireframes, interactive prototypes, user journeys, screen flows, high-fidelity mockups, and design system for the development and other disciplines to follow.</li><li>Collaborating and working closely with Senior Stakeholders, Product Managers, Engineers, Designers, Content Designers, and Researchers.</li><li>Creating animated motion graphics for the product(s), across platforms.</li><li>Contributing to the creation of clear, compelling, and persuasive customer-facing copy.</li><li>Continuously improving the overarching user experience.</li><li>Articulating challenges faced clearly along the design pathway, sharing those with your peers, and working collectively to resolve them.</li><li>Working with members from the Research and Data team to test and refine the product, and various pre and post-service journeys.</li><li>Take an insight-led, research-based position and ‘sell’ that to peers and stakeholders across the business.</li><li>Supporting and mentoring more junior members of the team.</li><li>Keeping up with the latest design trends and becoming a trusted source of knowledge in the business.</li><li>Ensure that Airalo has advanced understanding of the competitive landscape for consumer products in the mobile technology space.</li>,<h3>Must-haves:</h3><li>4+ years or similar of dedicated experience in product design at a tech startup or product-focused agency.</li><li>You are a designer at heart with evidence of the product design craft, sweating on the UI details and striving to make the best experience possible.</li><li>Ability to clearly communicate ideas and explain the rationale behind them.</li><li>Experience designing and testing native mobile and web applications for B2C.</li><li>Excellent written and verbal communication in English - ideally with experience crafting UX copy and microcopy.</li><li>A strong portfolio demonstrating your product design skill set - online or downloadable PDF.</li><li>Advanced knowledge of Figma, Figjam, and Adobe Suite design tools.</li><li>Previous experience leading a design system initiative in-house.</li><li>Ability to lead the current Design System to achieve consistency for end-product(s) and together with your deep understanding of Pattern Libraries in Design Systems and the efficiencies to be gained by using them effectively.</li><li>Advanced knowledge of web desktop and mobile web trends &amp; technologies.</li><li>In-depth understanding of responsive design for mobile and desktop web applications across the spectrum of various screen sizes.</li><li>Experience in creating material to support new features such as process flows, wireframes, interactive prototypes, product specification documentation.</li><li>Ability to keep a balance between user feedback, development and product goals during the product design process in order to deliver the best end product.</li><li>Experience working within Lean and / or Agile processes, knowledge of relevant practices and tools e.g. JIRA etc.</li><li>Be able to create and facilitate design workshops and ideation sessions.</li>,<h3>Good-to-have:</h3><li>Worked from inception to delivery on at least two shipped and launched native mobile or web applications.</li><li>Prior work experience in telecommunications.</li><li>Knowledge of eSIMs and GSMA related technologies and services.</li><div><span style=\"font-size: 15px;\">If you are interested in this position,&nbsp;</span><b style=\"font-size: 15px;\">please apply via the link.</b></div><div><br></div><div><i style=\"font-size: 15px;\">Please note that our Engineering &amp; Product team works in the CET timezone, so candidates will need to reside in countries with the same time zone or similar to it and will need to already have permit to work in the country where they are based.</i></div><div><br></div><div>We sincerely thank all applicants in advance for submitting their interest in this opportunity. Airalo is an equal opportunity employer and values diversity, equity &amp; inclusion. We do not discriminate on the basis of race, religion, national origin, gender, sexual orientation, age, marital status, veteran status, or disability status. We are committed to providing reasonable accommodations upon request for individuals with disabilities throughout our job interview process.</div>","tags":"[\"management\",\"engineering\",\"b2c\"]","pubDate":"2025-01-20T14:20:14.002Z","link":"https://jobs.lever.co/airalo/d25d0825-4405-4911-bae5-f36ed560e83b","slug":"senior-product-designer-airalo-6300"},{"id":3134200974,"title":"Sales Specialist (Morocco)","company":"Airalo","image":"https://lever-client-logos.s3.us-west-2.amazonaws.com/55028a36-609c-479c-9553-d4689ff2dd8c-1669620566663.png","description":"<div><b>About Airalo</b></div><div>Alo! Airalo is the world’s first eSIM store that helps people connect in over 200+ countries and regions across the globe. We are building the next digital service that revolutionizes the telecom industry. We are a travel-tech company and an equal-opportunity environment that values and executes diversity, inclusion, and equity. Our team is spread across 50+ countries and six continents. What glues us together is our commitment to changing the way you connect<span style=\"font-size: 13.3333px\">. </span></div><div><br></div><div><b>About you</b></div><div>We hope that you care deeply about the quality of your work, the intrinsic worth of tasks, and the success of your team. You are self-disciplined and do not require micromanagement in terms of your skillset and work ethic. You do your best to flourish as an individual every day while working hard to foster a collaborative team environment. You believe in the importance of being — and staying — authentic, honest, positive, and kind. You are a good interlocutor with clear and concise communication. You are able to manage multiple projects, have an analytical mind, pay keen attention to detail, and love to get your hands dirty. You are cognizant, tolerant, and welcoming of vulnerabilities and cultural differences.</div><div><br></div><div><b>About the Role</b></div><div><b>Position</b>: Full-time / Employee</div><div><b>Location:</b>&nbsp;Remote-first </div><div><b>Benefits:</b>&nbsp;Health Insurance, work-from-anywhere stipend, annual wellness &amp; learning credits, annual all-expenses-paid company retreat in a gorgeous destination &amp; other benefits</div><div><br></div><div>Airalo is looking for a<b> Sales Specialist</b> to join the <b>Airalo Partnerships</b> department.</div><div>Physical SIM cards are passe. The future of connectivity, including for business travelers, is through eSIMs. As the undisputed industry leader in the B2C segment, we are now looking to expand our presence in the corporate channel. </div><div>As the <b>Corporate Sales Specialist</b> for Morocco, you will own Airalo’s sales strategy and execution to ensure Airalo’s adoption as the business travel connectivity solution across small, medium and large enterprises.</div><h3>Responsibilities include but are not limited to:</h3><li>Work closely with the Partnerships Director for Africa &amp; Arabia and, other team members in the department</li><li>Conduct competitive research and define the Airalo corporate distribution roadmap to maintain Airalo’s status as the preferred provider across corporate partners</li><li>Market mapping of the top corporate prospects in key cities across Egypt and creating a distribution roadmap to achieve maximum penetration across the universe</li><li>Onboard and support new corporate partners as they join the Airalo partner community</li><li>Build and maintain fruitful relationships with key stakeholders (Human resources, travel admins, IT admins) at corporate partners to drive mutual growth</li><li>Organize events and roadshows at key corporates to educate employees about benefits of eSIMs over other travel connectivity options</li><li>Collaborate and work with different internal and external stakeholders to develop and execute projects/opportunities successfully</li><li>Own and deliver monthly, quarterly and annual OKRs for your channel with regular tracking and progress reports</li><li>As a core member of the Morocco squad, always explore ways and means to further consolidate Airalo’s dominance in Morocco</li><div><br></div><div><b>Must-haves:</b></div><li>4+ years of experience in corporate channel sales or business development in the tech, travel or telecom industry</li><li>Good understanding of the corporate channel (preferably the travel and / or telecom corporate) in Morocco</li><li>This is a largely relationship driven channel. You must be able to forge and nurture relationships with stakeholders across the channel</li><li>Ability to narrate a good story - Airalo’s unique story and the problem we solve for our users makes it a compelling pitch for partners</li><li>Ability to employ sales techniques, including effective questioning, objection handling, consultative selling, and solution selling</li><li>Ability to multi-task</li><li>Experience with sales and partnerships tools e.g. Hubspot</li><li>Perfect verbal and written communication skills in English </li><div>If you are interested in this position, <b>please apply via the link.</b></div><div><br></div><div>We sincerely thank all applicants in advance for submitting their interest in this opportunity. Airalo is an equal opportunity employer and values diversity, equity &amp; inclusion. We do not discriminate on the basis of race, religion, national origin, gender, sexual orientation, age, marital status, veteran status, or disability status. We are committed to providing reasonable accommodations upon request for individuals with disabilities throughout our job interview process.</div>","tags":"[\"management\",\"b2c\"]","pubDate":"2025-01-20T08:22:10.118Z","link":"https://jobs.lever.co/airalo/0627a20f-94a7-4a6b-9042-a4654ddd16f2","slug":"sales-specialist-morocco-airalo-4048"},{"id":3770116091,"title":"Sales Specialist (Egypt)","company":"Airalo","image":"https://lever-client-logos.s3.us-west-2.amazonaws.com/55028a36-609c-479c-9553-d4689ff2dd8c-1669620566663.png","description":"<div><b>About Airalo</b></div><div>Alo! Airalo is the world’s first eSIM store that helps people connect in over 200+ countries and regions across the globe. We are building the next digital service that revolutionizes the telecom industry. We are a travel-tech company and an equal-opportunity environment that values and executes diversity, inclusion, and equity. Our team is spread across 50+ countries and six continents. What glues us together is our commitment to changing the way you connect<span style=\"font-size: 13.3333px\">. </span></div><div><br></div><div><b>About you</b></div><div>We hope that you care deeply about the quality of your work, the intrinsic worth of tasks, and the success of your team. You are self-disciplined and do not require micromanagement in terms of your skillset and work ethic. You do your best to flourish as an individual every day while working hard to foster a collaborative team environment. You believe in the importance of being — and staying — authentic, honest, positive, and kind. You are a good interlocutor with clear and concise communication. You are able to manage multiple projects, have an analytical mind, pay keen attention to detail, and love to get your hands dirty. You are cognizant, tolerant, and welcoming of vulnerabilities and cultural differences.</div><div><br></div><div><b>About the Role</b></div><div><b>Position</b>: Full-time / Employee</div><div><b>Location:</b>&nbsp;Remote-first </div><div><b>Benefits:</b>&nbsp;Health Insurance, work-from-anywhere stipend, annual wellness &amp; learning credits, annual all-expenses-paid company retreat in a gorgeous destination &amp; other benefits</div><div><br></div><div>Airalo is looking for a <b> Sales Specialist</b> to join the <b>Airalo Partnerships</b> department.</div><div>Physical SIM cards are passe. The future of connectivity, including for business travelers, is through eSIMs. As the undisputed industry leader in the B2C segment, we are now looking to expand our presence in the corporate channel. Through the ‘Airalo for Corporates’ solution, we will offer significant savings and considerable ease to corporates when their employees travel for work.</div><div>As a<b> Sales Specialist</b> for Egypt, you will own Airalo’s corporate sales strategy and execution to ensure Airalo’s adoption as the business travel connectivity solution across small, medium and large enterprises.</div><h3>Responsibilities include but are not limited to:</h3><li>Work closely with the Partnerships Director, Africa &amp; Arabia and other team members in the department</li><li>Conduct competitive research and define the Airalo corporate distribution roadmap to maintain Airalo’s status as the preferred provider across corporate partners</li><li>Market mapping of the top corporate prospects in key cities across Egypt and creating a distribution roadmap to achieve maximum penetration across the universe</li><li>Onboard and support new corporate partners as they join the Airalo partner community</li><li>Build and maintain fruitful relationships with key stakeholders (Human resources, travel admins, IT admins) at corporate partners to drive mutual growth</li><li>Organize events and roadshows at key corporates to educate employees about benefits of eSIMs over other travel connectivity options</li><li>Collaborate and work with different internal and external stakeholders to develop and execute projects/opportunities successfully</li><li>Own and deliver monthly, quarterly and annual OKRs for your channel with regular tracking and progress reports</li><li>As a core member of the Egypt squad, always explore ways and means to further consolidate Airalo’s dominance in Egypt</li><div><br></div><li><b>Must-haves:</b></li><li>4+ years of experience in corporate channel sales or business development in the tech, travel or telecom industry</li><li>Good understanding of the corporate channel (preferably the travel and / or telecom corporate) in Egypt</li><li>This is a largely relationship driven channel. You must be able to forge and nurture relationships with stakeholders across the channel</li><li>Ability to narrate a good story - Airalo’s unique story and the problem we solve for our users makes it a compelling pitch for partners</li><li>Ability to employ sales techniques, including effective questioning, objection handling, consultative selling, and solution selling</li><li>Ability to multi-task</li><li>Experience with sales and partnerships tools e.g. Hubspot</li><li>Perfect verbal and written communication skills in English &amp; Arabic</li><div>If you are interested in this position, <b>please apply via the link.</b></div><div><br></div><div>We sincerely thank all applicants in advance for submitting their interest in this opportunity. Airalo is an equal opportunity employer and values diversity, equity &amp; inclusion. We do not discriminate on the basis of race, religion, national origin, gender, sexual orientation, age, marital status, veteran status, or disability status. We are committed to providing reasonable accommodations upon request for individuals with disabilities throughout our job interview process.</div>","tags":"[\"management\",\"b2c\"]","pubDate":"2025-01-20T08:18:49.464Z","link":"https://jobs.lever.co/airalo/3438a4b0-a074-4d0f-934f-e316bb1181b2","slug":"sales-specialist-egypt-airalo-559"},{"id":4312151839,"title":"Head of Business Development (MENA)","company":"Airalo","image":"https://lever-client-logos.s3.us-west-2.amazonaws.com/55028a36-609c-479c-9553-d4689ff2dd8c-1669620566663.png","description":"<div><b>About Airalo</b></div><div>Alo! Airalo is the world’s first eSIM store that helps people connect in over 200+ countries and regions across the globe. We are building the next digital service that revolutionizes the telecom industry. We are a travel-tech company and an equal-opportunity environment that values and executes diversity, inclusion, and equity. Our team is spread across 50+ countries and six continents. What glues us together is our commitment to changing the way you connect<span style=\"font-size: 13.3333px\">. </span></div><div><br></div><div><b>About you</b></div><div>We hope that you care deeply about the quality of your work, the intrinsic worth of tasks, and the success of your team. You are self-disciplined and do not require micromanagement in terms of your skillset and work ethic. You do your best to flourish as an individual every day while working hard to foster a collaborative team environment. You believe in the importance of being — and staying — authentic, honest, positive, and kind. You are a good interlocutor with clear and concise communication. You are able to manage multiple projects, have an analytical mind, pay keen attention to detail, and love to get your hands dirty. You are cognizant, tolerant, and welcoming of vulnerabilities and cultural differences.</div><div><br></div><div><b>About the Role</b></div><div><b>Position</b>: Full-time / Employee</div><div><b>Location:</b>&nbsp;Remote-first </div><div><b>Benefits:</b>&nbsp;Health Insurance, work-from-anywhere stipend, annual wellness &amp; learning credits, annual all-expenses-paid company retreat in a gorgeous destination &amp; other benefits</div><div><br></div><div>Airalo is looking for a <b>Head of Business Development</b> to join the <b>Airalo Partnerships</b> department.</div><div>Expensive roaming and physical SIM cards are passe. The future of connectivity, for leisure and business travelers, is through eSIMs. As the undisputed industry leader in the B2C segment, we are looking to extend our leadership to the B2B (business travel) and the B2B2C (resellers) channels.</div><div>As the <b>Head of Business Development for MENA</b>, you will lead Airalo’s B2B and B2B2C strategy and execution to ensure Airalo’s presence across the business travel and reseller channels.</div><h3>Respinsibilities include but are not limited to:</h3><li>Work closely with our Director of Partnerships and other team members in the department</li><li>Collaborate with the Growth team and partnerships specialists for market mapping of small, medium and enterprise prospects for Airalo Business and travel agents, tour operators and retail stores for Airalo Partner Platform</li><li>Onboard and support new partners as they join the Airalo Partners community</li><li>Build and maintain fruitful relationships with key stakeholders in the partner organization to drive mutual benefits</li><li>Drive visibility, awareness and adoption for Airalo in the partner organization</li><li>Design and manage a program to educate businesses on eSIM adoption</li><li>Support research efforts to keep track of competing developments in the market(s) to help maintain Airalo’s status as the preferred provider across partners</li><li>Collaborate and work with different internal and external stakeholders to develop and execute projects/opportunities successfully</li><li>Own and deliver monthly, quarterly and annual OKRs with regular tracking and progress reports</li><div><br></div><div><b>Must-haves:</b></div><li>7+ years of experience in corporate sales (preferred) or channel sales in the relevant market(s)</li><li>Experience in the travel and / or telecom industry or with corporate sales in a consumer business</li><li>You must be able to forge and nurture relationships with stakeholders across the channel</li><li>Ability to narrate a good story - Airalo’s unique story and the problem we solve for our users makes it a compelling pitch for customers and partners</li><li>Ability to employ sales techniques, including effective questioning, objection handling, consultative selling, and solution selling</li><li>Ability to multi-task</li><li>Experience with sales and partnerships tools e.g. Hubspot</li><li>Perfect verbal and written communication skills in English and Arabic</li><div><br></div><div><b>Good to have:</b></div><li>Familiarity with the travel or telecom industry</li><li>Experience in building and leading a team</li><li>Certificates and courses in sales and partnerships</li><li>Verbal and written ability in additional local / regional languages</li><div>If you are interested in this position, <b>please apply via the link.</b></div><div><br></div><div>We sincerely thank all applicants in advance for submitting their interest in this opportunity. Airalo is an equal opportunity employer and values diversity, equity &amp; inclusion. We do not discriminate on the basis of race, religion, national origin, gender, sexual orientation, age, marital status, veteran status, or disability status. We are committed to providing reasonable accommodations upon request for individuals with disabilities throughout our job interview process.</div>","tags":"[\"management\",\"b2c\",\"b2b\"]","pubDate":"2025-01-20T08:14:25.980Z","link":"https://jobs.lever.co/airalo/317cb35c-8b9f-4143-8d39-17b6ff9d1d83","slug":"head-of-business-development-mena-airalo-2717"},{"id":7893495769,"title":"Sales Manager","company":"Automattic Careers","image":"https://remotive.com/job/1964264/logo","description":"<p><a href=\"%22https:/newspack.com/%22\" rel=\"nofollow\">Newspack</a> is seeking an experienced sales manager to drive lead generation, support our partnership managers, and help shape our sales strategy.</p>\n<p>Newspack is part of <a href=\"%22https:/automattic.com/%22\" rel=\"nofollow\">Automattic</a>, the company behind <a href=\"%22http:/wordpress.com%22\" rel=\"nofollow\">WordPress.com</a>, <a href=\"%22https:/wpvip.com/%22\" rel=\"nofollow\">WordPress VIP</a> and more. Our mission is to help independent news organizations publish great stories, develop a loyal audience, and find a path to financial sustainability at a moment when local journalism faces immense challenges.</p>\n<p>We do that by deploying a publishing solution, developed in partnership with the <a href=\"%22https:/newsinitiative.withgoogle.com/%22\" rel=\"nofollow\">Google News Initiative</a> and WordPress.com, that is tailored to the needs of digital news publishers, incorporates industry best practices, and provides best-in-class support.</p>\n<p>In just over three years, more than 175 publications have joined Newspack, from venerable publications like Washington Monthly and Center for Public Integrity to vibrant digital startups like The Voice of SanDiego and MLK50. </p>\n<p>As sales manager, you will be a pivotal part of our sales operation, working directly with our partnership team and the wider Newspack business team to manage day-to-day operations, drive new business, help shape our sales strategy, and maintain our marketing materials.</p>\n<p><strong>Key Responsibilities:</strong> </p>\n<ul style=\"\">\n<li style=\"\">Manage day-to-day sales and revenue operations.</li>\n<li style=\"\">Work with the team to help evolve  sales and growth strategies.</li>\n<li style=\"\">Qualify prospects to ensure they are a good fit.</li>\n<li style=\"\">Help sales leadership and partnership managers move prospects through various stages of the sales pipeline and maintain a steady deal flow.</li>\n<li style=\"\">Facilitate weekly sales forecasting meetings.</li>\n<li style=\"\">Identify potential prospects via industry conferences, sponsorship opportunities, email marketing and content marketing campaigns.</li>\n<li style=\"\">Work with business leads to increase Newspack’s visibility across the industry</li>\n<li style=\"\">Represent Newspack at industry events.</li>\n<li style=\"\">Maintain sales and marketing collateral.</li>\n</ul>\n<p><strong>We are seeking candidates who:</strong> </p>\n<ul style=\"\">\n<li style=\"\">Have demonstrated sales and marketing experience, with proven results.</li>\n<li style=\"\">Have a strong sense of organization and follow-through, and are comfortable moving between strategic planning and day-to-day operations.</li>\n<li style=\"\">Are capable of taking initiative, being proactive, and driving business results without significant supervision.</li>\n<li style=\"\">Have excellent planning, time management, and organizational skills.</li>\n<li style=\"\">Can communicate complex ideas effectively – verbally and in writing.</li>\n</ul>\n<p><strong>These attributes are not required though preferred: </strong></p>\n<ul style=\"\">\n<li style=\"\">Experience with/interest in news and publishing.</li>\n<li style=\"\">Experience creating new and/or managing existing collateral materials (Pitch decks/materials of various lengths).</li>\n<li style=\"\">Experience with WordPress in a content management/marketing/publishing context (engineering experience not required).</li>\n</ul>\n<p><strong>Salary range: $90,000-$130,000 USD.</strong>  Please note that salary ranges are global, regardless of location, and we pay in local currency.</p>\n<p>We are searching for high-caliber candidates with the skills and qualities to have a net positive for Automattic. Pay will reflect the potential contribution and the impact you can bring, which may, in some cases, go beyond the range stated.</p>\n<p>This isn’t your typical work-from-home job—we are a fully-remote company with an open vacation policy. Read more about our<a href=\"%22https:/automattic.com/compensation/%22\" rel=\"nofollow\"> compensation philosophy</a>. To see a full list of benefits by country, consult our <a href=\"%22https:/automattic.com/benefits/%22\" rel=\"nofollow\">Benefits Page</a>. And check out these links to learn more about <a href=\"%22https:/automattic.com/how-we-hire/%22\" rel=\"nofollow\">How We Hire</a> and <a href=\"%22https:/automattic.com/expectations/%22\" rel=\"nofollow\">What We Expect from Ourselves</a>.</p>\n<div class='\"content-conclusion\"'>\n<p><strong>About Automattic</strong> </p>\n<p>We are the people behind <a href=\"%22http:/wordpress.com/%22\" rel=\"nofollow\">WordPress.com</a>, <a href=\"%22http:/woocommerce.com/%22\" rel=\"nofollow\">WooCommerce</a>, <a href=\"%22https:/www.tumblr.com/%22\" rel=\"nofollow\">Tumblr</a>, <a href=\"%22http:/simplenote.com/%22\" rel=\"nofollow\">Simplenote</a>, <a href=\"%22http:/jetpack.com/%22\" rel=\"nofollow\">Jetpack</a>, <a href=\"%22http:/longreads.com/%22\" rel=\"nofollow\">Longreads</a>, <a href=\"%22https:/dayoneapp.com/%22\" rel=\"nofollow\">Day One</a>, <a href=\"%22https:/www.pocketcasts.com/%22\" rel=\"nofollow\">Pocket Casts</a>, and more. We believe in making the web a better place.</p>\n<p>We’re a distributed company with more than 1700 Automatticians in 92 countries speaking 110+ different languages. And, even more than growth and profitability (although we’re plenty profitable), above all, we’re driven by a mission:  We democratize publishing and commerce so anyone with a story can tell it, and anyone with a product can sell it, regardless of income, gender, politics, language, or country.</p>\n<p><a href=\"%22https:/github.com/Automattic%22\" rel=\"nofollow\">We believe in Open Source</a>, and the vast majority of our work is available under the <a href=\"%22https:/en.wikipedia.org/wiki/GNU_General_Public_License%22\" rel=\"nofollow\">GPL</a>.</p>\n<p><strong>Diversity, Equity, &amp; Inclusion at Automattic</strong> </p>\n<p>We’re improving diversity in the tech industry. At Automattic, we want people to love their work and show respect and empathy to all. We welcome differences and strive to increase participation from traditionally underrepresented groups. Our DEI committee involves Automatticians across the company and drives grassroots change. For example, this group has helped facilitate private online spaces for affiliated Automatticians to gather and helps run a monthly DEI People Lab series for further learning. DEI is a priority at Automattic, though our dedication influences far more than just Automatticians: We make our products freely available and translate our products into and offer customer support in numerous languages. We require unconscious bias training for our hiring teams and ensure our products are accessible across different bandwidths and devices. </p>\n<p>Automattic is a <a href=\"%22https:/mostlovedworkplace.com/companies/automattic-inc/%22\" rel=\"nofollow\">Most Loved Company</a> and <a href=\"%22https:/disabilityconfident.campaign.gov.uk/%22\" rel=\"nofollow\">Disability Confident Committed</a>. (<a href=\"%22https:/happinessengineer.blog/2022/09/08/happiness-for-everyone-working-with-a-disability-at-automattic/%22\" rel=\"nofollow\">Here’s what that might mean for you</a>.) Learn more about our dedication to <a href=\"%22https:/href.li/?https://automattic.com/diversity-and-inclusion/%22\" rel=\"nofollow\">diversity, equity, and inclusion</a> and our <a href=\"%22https:/automattic.com/automattician-resource-groups/%22\" rel=\"nofollow\">Employee Resource Groups</a>.</p>\n<p>If you need any accommodations during the application or interview process, please <a href=\"%22mailto:hr+hiringaccommodation@automattic.com%22\" rel=\"nofollow\">send us an email</a>. We’re committed to ensuring our hiring process is accessible to all candidates.</p>\n<p><em>All qualified applicants will receive consideration for employment without regard to race, color, religion, sex, sexual orientation, gender identity, national origin, disability, or status as a protected veteran.</em></p>\n</div>\n<img src=\"https://remotive.com/job/track/1964264/blank.gif?source=public_api\" alt=\"\"/>","tags":"[\"lead generation\",\"sales management\"]","pubDate":"2025-01-20T03:51:00.000Z","link":"https://remotive.com/remote-jobs/sales-business/sales-manager-1964264","slug":"sales-manager-automattic-careers-617"}]