[{"id":9621284552,"title":"People Operations Officer (French speaking, Remote/Anywhere)","company":"Collabora","image":"https://pbs.twimg.com/profile_images/1545121577632763912/7FMnABb0_400x400.jpg","description":"<div class=\"section page-centered\" data-qa=\"job-description\"><div>We are looking for an enthusiastic and passionate individual to provide HR support to the People Operations team at Collabora Ltd. and all its entities.</div><div><br></div><div>Due to the nature of our business, it is essential that you feel equipped to embrace open source technologies. No two days will be the  same within our energised, fast-paced organisation. If you are a well  organised team player and an effective communicator who is passionate  about doing right by people, then we want to hear from you!</div><div><br></div><div>Role responsibilities can be found below (not in order of priority):</div></div><div class=\"section page-centered\"><div><h3>Supporting Managers:</h3><ul class=\"posting-requirements plain-list\"><ul><li>Advise managers of end of probationary reviews and follow up accordingly</li><li>Oversea sabbaticals/retention of services and highlight possible issues to the relevant individuals</li><li>Provide support to the HR Business Partner on employee relation issues</li><li>Liaise with solicitors, benefit providers and payroll providers as and when required to seek advice</li><li>Help develop 1:1’s, appraisals and L&amp;D initiatives in support of the People Lead Team</li><li>Support the Collabora Productivity Management Team as and when required on all HR related matters</li></ul></ul></div></div><div class=\"section page-centered\"><div><h3>Maintaining HR Data, Reporting and General Administration:</h3><ul class=\"posting-requirements plain-list\"><ul><li>Managing the database and electronic files of employees and contractors, alongside any related information such as contracts, letters, file notes etc.</li><li>Preparation of reports as and when required</li><li>Regular HR Audit checks to ensure data held is accurate and up to date</li><li>Manage the POps Mailbox, distributing tasks as necessary</li><li>Update the internal wiki when necessary</li></ul></ul></div></div><div class=\"section page-centered\"><div><h3>Project Work:</h3><ul class=\"posting-requirements plain-list\"><ul><li>Translate employee handbook into French for French and Canadian employees</li><li>Translate the internal wiki pages into French as required in line with Bill 96 (Canada/Quebec)</li><li>Re-draft employee contracts for Canada to be bilingual</li><li>Translate templates (e.g. employment contracts, amendment letters, policies...) into French for CA employees</li><li>Help to develop HR Process manuals for all countries where we have employees</li><li>Automation and development of HR processes and systems</li></ul></ul></div></div><div class=\"section page-centered\"><div><h3>Onboarding/Offboarding:</h3><ul class=\"posting-requirements plain-list\"><ul><li>Draft offers of employment, employment contracts and contract amendments ensuring compliance (for employees in UK, US, Canada, and France &amp; contractors worldwide)</li><li>Handle onboarding process from start to finish ensuring compliance and that procedures are followed and documented accordingly (i.e. checking ID, reference checks, background checks, producing first day info document, scheduling induction calls, liaising with office managers for shipping of equipment, liaising with system admins to create accounts and give access etc.)</li><li>Process offboarding (i.e. drafting resignation acceptance letter, organizing equipment pick up with office managers, internal announcements and general offboarding)</li></ul></ul></div></div><div class=\"section page-centered\"><div><h3>Payroll &amp; Benefits Administration:</h3><ul class=\"posting-requirements plain-list\"><ul><li>Provide accurate and timely information/records to the payroll providers for CA &amp; US (bimonthly) and UK &amp; France (monthly)</li><li>Administer benefits for employees in UK, CA and France (pension, insurances)</li><li>Work with the finance team for year end reporting</li></ul></ul></div></div><div class=\"section page-centered\"><div><h3>Visa &amp; Immigration:</h3><ul class=\"posting-requirements plain-list\"><ul><li>Work with the Travel Coordinator (and the immigration lawyers) to support contractors’ visa and work permit applications as and when required</li><li>Provide relocation advice and assistance as and when necessary</li></ul></ul></div></div><div class=\"section page-centered\"><div><h3>Key Requirements:</h3><ul class=\"posting-requirements plain-list\"><ul><li>&nbsp;Able to communicate fluently in French at a business level, verbally and written</li><li>Experience of working in a fast paced environment</li><li>Analytical and methodical</li><li>Great attention to detail</li><li>People Person</li><li>Experience of working in a HR Officer/Admin level role</li><li> Ability to adapt to new technology</li><li>Able to communicate well at all levels</li><li>Think like an HR person</li></ul></ul></div></div><!--[2022-11-28] [GOLD-2535] Remove payTransparencyV1 when feature flag is fully removed--><div class=\"section page-centered\" data-qa=\"closing-description\"><div>Collabora  is a software consultancy specialising in bringing companies and the  Open Source community together. We combine years of Open Source software  leadership with an understanding of the challenges that businesses, non-profits and governments face. Collabora brings deep technical expertise in  system integration &amp; architecture, graphics, multimedia, web engines  and communications to a number of market verticals, including mobile,  IVI / automotive, set top box / smart TV, and a range of other  specialised embedded applications.</div><div><br></div><div>Collabora  has the unique business model of enabling enterprises to leverage Open  Source software in their solutions. Having worked with notable industry  leading companies in the automotive, aerospace and handset mobile  verticals amongst many others, Collabora has established a broad  customer portfolio.</div><div><br></div><div><br></div><div><br></div><div>#LI-Remote</div></div><div class=\"section page-centered last-section-apply\" data-qa=\"btn-apply-bottom\"><a class=\"postings-btn template-btn-submit hex-color\" data-qa=\"show-page-apply\" href=\"https://jobs.lever.co/collabora/0fe5d138-26f3-40e3-92c0-e1a77887cedd/apply\">Apply for this job</a></div>","tags":"[\"Finance\",\"management\",\"database\"]","pubDate":"2023-11-17 08:25:38.912","link":"https://jobs.lever.co/collabora/0fe5d138-26f3-40e3-92c0-e1a77887cedd","savedDate":"2023-11-17 08:25:38.912","slug":"people-operations-officer-french-speaking-remote-anywhere-collabora-960"},{"id":5332167315,"title":"Software Engineer (Test Simulation)","company":"Status","image":"https://pbs.twimg.com/profile_images/966759182589308928/s5rZXoWk_400x400.jpg","description":"\n    <div class=\"content-intro\"><p style=\"text-align: justify;\"><strong>About Status</strong></p>\n<p style=\"text-align: justify;\"><span style=\"font-weight: 400;\">Status is building the tools and infrastructure for the advancement of a secure, private, and open web3.&nbsp;</span></p>\n<p style=\"text-align: justify;\"><span style=\"font-weight: 400;\">With the high level goals of preserving the right to privacy, mitigating the risk of censorship, and promoting economic trade in a transparent, open manner, Status is building a community where anyone is welcome to join and contribute.</span></p>\n<p style=\"text-align: justify;\"><span style=\"font-weight: 400;\">As an organization, Status seeks to push the web3 ecosystem forward through research, creation of developer tools, and support of the open source community.&nbsp;</span></p>\n<p style=\"text-align: justify;\"><span style=\"font-weight: 400;\">As a product, Status is an open source, Ethereum-based app that gives users the power to chat, transact, and access a revolutionary world of DApps on the decentralized web. But Status is also building foundational infrastructure for the whole Ethereum ecosystem, including the Nimbus ETH 1.0 and 2.0 clients, the Keycard hardware wallet, and the Waku messaging protocol; the p2p communication layer for Web3.</span></p>\n<p style=\"text-align: justify;\"><span style=\"font-weight: 400;\">As a team, Status has been completely distributed since inception.&nbsp; Our team is currently 200+ core contributors strong, and welcomes a growing number of community members from all walks of life, scattered all around the globe.&nbsp;</span></p>\n<p style=\"text-align: justify;\"><span style=\"font-weight: 400;\">We care deeply about open source, and our organizational structure has minimal hierarchy and no fixed work hours. We believe in working with a high degree of autonomy while supporting the organization's priorities.</span></p></div>\n\n    <div class=\"careers-block__trix external-panel text-left\">\n<div><strong>About Waku</strong></div>\n<p>&nbsp;</p>\n<div>\n<p>We are building Waku as a public good infrastructure. Waku is uncompromising Web3 communication at scale. It is a decentralized, censorship-resistant, privacy-preserving communication network that enables anyone to send and receive messages without worrying about surveillance or deplatforming.</p>\n<p>We are enabling Ethereum builders to create new projects with a fully decentralized architecture, think dApp to Wallet notifications, NFT marketplaces, censorship-resistant chat, layer-2 and more.&nbsp;</p>\n<p>Waku enables a variety of complex use cases and applications. To facilitate the adoption of Waku, you will design and implement application protocols to provide to dapp developers as off-the-shelf SDKs.</p>\n<p><a href=\"https://waku.org/\">https://waku.org/</a>&nbsp;</p>\n<p><strong>Key responsibilities:</strong></p>\n</div>\n<div>\n<ul>\n<li>Design and implement network simulation tools and solutions to validate the functionality and performance of distributed systems.</li>\n<li>Run, analyze, and report on small-scale simulations to test the behavior of a specific protocol change or software implementation, or to simulate a type of attack on the Waku clients.</li>\n<li>Own, maintain and improve the <a href=\"https://github.com/waku-org/waku-simulator\">waku-simulator</a> framework to enable running local simulations of the Waku network.</li>\n<li>Work closely with Waku engineers and researchers to help design and analyze simulations needed to validate assumptions.</li>\n<li>Assist engineers by conducting ad-hoc regression testing, reproducing bugs, and testing bug fixes.</li>\n<li>Be the point of contact within the Waku team for the the Vac/DST (Distributed System Test) Team who is in charge of large scale simulations and QA activities.</li>\n<li>Pre-empt and plan small scale simulations to study the behaviour of Waku clients, identify potential bottlenecks and performance optimization, then handover to DST for large scale simulation to confirm findings.</li>\n<li>Foresee, and help plan and execute any other testing activities that helps ensure the production readiness of Waku, including secure scaling.</li>\n<li>Help provide visibility on testing and simulation output, to ensure that the wider Waku ecosystem is informed of the expected performance of the Waku protocol and software.</li>\n</ul>\n</div>\n<div>\n<p><strong>You ideally will have:</strong></p>\n</div>\n<div>\n<ul>\n<li>A passion for blockchain technology, privacy-preserving technology and decentralization.</li>\n<li>Solid experience with scripting languages (Python, Shell) and a systems language like Rust, C++, Nim, Go.</li>\n<li>Strong foundation in networks and system programming.</li>\n<li>Working knowledge of Docker and POSIX-like systems.</li>\n<li>Algorithm design skills.&nbsp;</li>\n<li>Have a strong alignment to our principles: <a class=\"anchor_c8ddc0 anchorUnderlineOnHover__78236\" href=\"https://status.app/manifesto\" target=\"_blank\">https://status.app/manifesto</a></li>\n</ul>\n<p><strong>Hiring process:</strong></p>\n<ul>\n<li>Call with Talent.</li>\n<li>Interview with Waku Research team member or lead.</li>\n<li>Take home task (paid).</li>\n<li>Interview with another Waku Research team member or Lead to present home task and discuss further.</li>\n<li>Interview with Waku lead.</li>\n</ul>\n<p><strong>Compensation:</strong></p>\n</div>\n<p>We are happy to pay in any mix of fiat/crypto.</p>\n</div>\n\n    \n\n    \n","tags":"[]","pubDate":"2023-11-17 08:25:38.910","link":"https://boards.greenhouse.io/embed/job_app?for=status72&token=5512256&b=https%3A%2F%2Fjobs.status.im%2F","savedDate":"2023-11-17 08:25:38.910","slug":"software-engineer-test-simulation-status-4026"},{"id":3450468837,"title":"Business Development Representative (New York City - Hybrid)","company":"Timescale","image":"https://pbs.twimg.com/profile_images/1542681228666671107/L5LYJLAD_400x400.png","description":"&lt;p&gt;As a Business Development Representative (BDR), you will support our sales team by generating meetings and creating pipelines by identifying and engaging with key prospects at our target accounts. This role offers unique opportunity for advancement and promotion, and we’re looking for someone who is looking to build a career in tech sales.&lt;/p&gt;\n&lt;p&gt;&lt;em&gt;Note: Although Timescale is primarily a remote organization, we anticipate this role will be hybrid, in-office approximately 2-3 days per week in the &lt;strong&gt;New York City &lt;/strong&gt;area beginning in 2024.&lt;/em&gt;&lt;/p&gt;\n&lt;p&gt;Timescale is committed to empowering businesses with a mature PostgreSQL cloud, specialized for demanding workloads. As a Business Development Representative, you&#39;ll play a pivotal role in driving our growth by identifying and engaging with potential clients, helping them discover the power of our innovative technology. By working collaboratively with our go-to-market teams, you will gain a cross-functional perspective while directly contributing to the revenue goals of the company. This role reports to our Head of Business Development &amp;amp; Partnerships.&lt;/p&gt;\n&lt;h4&gt;&lt;strong&gt;What you&#39;ll do:&amp;nbsp;&lt;/strong&gt;&lt;/h4&gt;\n&lt;ul&gt;\n&lt;li&gt;Research accounts, identify key buyers, and create interest to generate sales opportunities&lt;/li&gt;\n&lt;li&gt;Build email sequences that drive urgency and engage buyers at key accounts&lt;/li&gt;\n&lt;li&gt;Attend industry conferences and events&lt;/li&gt;\n&lt;li&gt;Qualify “in-market” leads for the sales team&lt;/li&gt;\n&lt;li&gt;Take notes for account executives and help shepherd deals until closed&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;&lt;strong&gt;What you bring&lt;/strong&gt;:&amp;nbsp;&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;You’re a self-motivated individual who has a history of hitting ambitious targets&lt;/li&gt;\n&lt;li&gt;You’re comfortable talking with senior executives, and you excel at building long-lasting relationships with prospective customers&lt;/li&gt;\n&lt;li&gt;1+ years of work experience, either in sales/business development, or finance, consulting, or a related analytical field&lt;/li&gt;\n&lt;li&gt;Experience balancing multiple priorities and owning challenging targets&lt;/li&gt;\n&lt;li&gt;Excellent time management skills that can be shared and spread throughout the team&lt;/li&gt;\n&lt;li&gt;Someone who is energized by navigating ambiguity and can create structure in a dynamic, fast-paced environment.&amp;nbsp;&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;&lt;strong&gt;Nice to have:&lt;/strong&gt;&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;1+ years experience working in sales or customer facing roles.&amp;nbsp;&lt;/li&gt;\n&lt;li&gt;Prior Sales/SDR experience at a technology company.&amp;nbsp;&lt;/li&gt;\n&lt;li&gt;Previous experience working with a technical audience.&amp;nbsp;&lt;/li&gt;\n&lt;li&gt;Experience using sales productivity tools (e.g. Salesforce, Linkedin, GoogleSuite, Outreach, Apollo)&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;&lt;strong&gt;What you’ll get out of it:&lt;/strong&gt;&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;You will create a name for yourself by getting to work with and support some of the fastest-growing, most forward-thinking companies&amp;nbsp;&lt;/li&gt;\n&lt;li&gt;You will get exposure to real technical problems every company faces (databases) that you will be able to use for the rest of your career, whether that’s starting your own company or helping scale another.&lt;/li&gt;\n&lt;li&gt;You will experience the best of both worlds in a hybrid work setting, with 2-3 days in office in the New York area&amp;nbsp;&lt;/li&gt;\n&lt;li&gt;You will work in a supportive and inclusive culture where your ideas are heard and valued. Collaborate with a diverse and talented team that shares a passion for innovation.&lt;/li&gt;\n&lt;/ul&gt;\n&lt;h3&gt;&lt;strong&gt;Our Values:&lt;/strong&gt;&lt;/h3&gt;\n&lt;p&gt;These values define how we approach our work every single day:&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;Get sh*t done&lt;/li&gt;\n&lt;li&gt;Be direct, with respect&lt;/li&gt;\n&lt;li&gt;Embrace the challenge&lt;/li&gt;\n&lt;li&gt;Absolutely own the outcome&lt;/li&gt;\n&lt;li&gt;Be excellent but humble&lt;/li&gt;\n&lt;li&gt;Win together&lt;/li&gt;\n&lt;/ul&gt;\n&lt;h3&gt;&lt;strong&gt;Compensation&lt;/strong&gt;&lt;/h3&gt;\n&lt;p&gt;Timescale is proud to offer a compensation package that includes base salary, equity, and comprehensive benefits to all full-time employees. The estimated salary range for this role for New York City based employees is $90,000 - $100,000 OTE ($60,000 -&amp;nbsp; $70,000 base + $30,000 variable)&lt;/p&gt;\n&lt;p&gt;&lt;em&gt;These ranges may be modified in the future.&lt;/em&gt;&lt;/p&gt;\n&lt;h4&gt;&lt;strong&gt;Additional benefits:&lt;/strong&gt;&lt;/h4&gt;\n&lt;ul&gt;\n&lt;li&gt;Flexible paid time off and generous parental leave&lt;/li&gt;\n&lt;li&gt;100% medical, dental, and vision coverage&lt;/li&gt;\n&lt;li&gt;Office stipend&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;&lt;strong&gt;About Timescale🐯&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;Timescale is the creator of TimescaleDB, the industry-leading relational database for time-series. Tens of thousands of organizations trust TimescaleDB today with their mission-critical time-series applications. The company is dedicated to serving software developers and businesses worldwide, enabling them to build exceptional data-driven products that &lt;strong&gt;measure everything that matters&lt;/strong&gt;: software applications, industrial equipment, financial markets, blockchain activity, consumer behavior, machine learning models, climate change, and more. Analyzing data across the time dimension (“time-series data”) enables developers to understand what is happening right now, how that is changing, and why that is changing. Timescale has a global🌎 workforce and is backed by Tiger Global, Benchmark Capital, New Enterprise Associates, Redpoint Ventures, Icon Ventures, Two Sigma Ventures, and other leading investors. For more information, visit &lt;a href=&quot;http://www.timescale.com&quot;&gt;www.timescale.com&lt;/a&gt; or follow @TimescaleDB.&lt;/p&gt;&lt;div class=&quot;content-conclusion&quot;&gt;&lt;p&gt;By applying for this position, you are agreeing to &lt;a href=&quot;https://www.timescale.com/legal/timescale-applicant-privacy-note&quot; target=&quot;_blank&quot;&gt;Timescale&#39;s Applicant Privacy Notice.&lt;/a&gt;&amp;nbsp;&lt;/p&gt;&lt;/div&gt;","tags":"[\"postgres\",\"Finance\",\"management\",\"legal\",\"database\"]","pubDate":"2023-11-17 08:25:38.909","link":"https://www.timescale.com/careers/7024014002?gh_jid=7024014002","savedDate":"2023-11-17 08:25:38.909","slug":"business-development-representative-new-york-city-hybrid-timescale-9983"},{"id":6397481862,"title":"Content Writer","company":"CI Web Group, Inc.","image":"https://remotive.com/job/1833285/logo","description":"<div><span style=\"\">CI Web Group, Inc. is a Digital Marketing Agency with employees located all over the world, working remotely. We are creative, customer-centric, data-forward and our goal is to provide a caring, educated, results-driven, experience for our customers. We are a full service digital marketing agency that provides various services to primarily Home Service Companies throughout the United States &amp; Canada.</span></div>\n<div> </div>\n<div><span style=\"\">The ideal candidate will be a key contributor to our content marketing team's success. You will primarily be in charge of creating unique home service content and providing fantastic customer service by collaborating with customers on their content marketing goals. We are looking for someone that is kind, a self-starter, a team player, and has a strong desire to learn and grow. Our content writer should be professional, respectful of customer homes, willing to ask questions, and prompt. </span></div>\n<p><br><br></p>\n<div class=\"h3\">Responsibilities</div>\n<ul style=\"\">\n<li style=\"\">Proven experience in writing unique and engaging content within specified deadlines, including a strong portfolio showcasing work on various platforms like Blogs and Pillar Website Content.</li>\n</ul>\n<ul style=\"\">\n<li style=\"\">Meticulous attention to detail in proofreading and editing written content to ensure accuracy, clarity, and adherence to established style guidelines before publication.</li>\n</ul>\n<ul style=\"\">\n<li style=\"\">Excellent communication skills, including proficiency in interacting with customers through various mediums such as email, text, phone, and Zoom meetings, with the ability to convey information effectively and maintain professional rapport.</li>\n</ul>\n<ul style=\"\">\n<li style=\"\">Capability to document and manage customer communication within designated accounts, ensuring comprehensive and organized record-keeping for future reference and follow-up.</li>\n</ul>\n<ul style=\"\">\n<li style=\"\">Demonstrated ability to work collaboratively with the content marketing team to meet content marketing objectives, contributing innovative ideas and solutions that align with the company's overall strategies and goals.</li>\n</ul>\n<ul style=\"\">\n<li style=\"\">Willingness and availability to participate in internal company meetings, contributing actively to discussions and providing valuable insights to support the team's collective efforts and initiatives.</li>\n</ul>\n<p><br><br></p>\n<div class=\"h3\">Qualifications</div>\n<ul style=\"\">\n<li style=\"\">Over 2 years of professional experience</li>\n</ul>\n<ul style=\"\">\n<li style=\"\">Demonstrated exceptional grammar skills, ensuring precise and effective communication in all written materials.</li>\n</ul>\n<ul style=\"\">\n<li style=\"\">Proficiency in crafting impactful, professional emails that uphold the highest standards of business communication.</li>\n</ul>\n<ul style=\"\">\n<li style=\"\">Technologically adept and quick to grasp new technologies, consistently staying updated with the latest advancements in the field.</li>\n</ul>\n<ul style=\"\">\n<li style=\"\">Basic proficiency in Google applications such as Docs, Sheets, Slides, and other relevant tools.</li>\n</ul>\n<ul style=\"\">\n<li style=\"\">Dedication and motivation to continuously learn and grow, with a proactive approach to self-improvement and professional development.</li>\n</ul>\n<ul style=\"\">\n<li style=\"\">Familiarity with SEO practices or a strong willingness to acquire knowledge in this area.</li>\n</ul>\n<ul style=\"\">\n<li style=\"\">Ability to present 2-3 compelling examples of previous work that highlight relevant skills and accomplishments.</li>\n</ul>\n<div>Benefits:</div>\n<div><strong style=\"\">Remote First: We offer flexibility to work remotely from anywhere</strong></div>\n<div><strong style=\"\">Compensation:</strong><span style=\"\"> Base Salary + Discretionary Bonus</span></div>\n<div><strong style=\"\">Generous PTO: </strong><span style=\"\">We offer ample time off to encourage work life flexibility including 3 weeks of PTO, 6 Mental Health Days, and company closure between Christmas and New Years </span></div>\n<div><strong style=\"\">100% company paid Health and Medical Coverage, </strong><span style=\"\">including</span><strong style=\"\">:</strong><span style=\"\">Medical, Dental ,Vision, Long-Term Disability, Life Insurance</span></div>\n<div><strong style=\"\">401k: </strong><span style=\"\">We offer a 3% 401k annual contribution</span></div>\n<img src=\"https://remotive.com/job/track/1833285/blank.gif?source=public_api\" alt=\"\"/>","tags":"[\"seo\",\"content marketing\",\"digital marketing\",\"editing\",\"insurance\",\"mental health\"]","pubDate":"2023-11-14 17:21:14.000","link":"https://remotive.com/remote-jobs/writing/content-writer-1833285","savedDate":"2023-11-17 08:25:38.907","slug":"content-writer-ci-web-group-inc-1013"}]