[{"id":5800511961,"title":"Senior Recruiter","company":"Kindred","image":"https://instagram.fcmb2-2.fna.fbcdn.net/v/t51.2885-19/278488600_362609942591349_5608095197475222823_n.jpg?_nc_ht=instagram.fcmb2-2.fna.fbcdn.net&_nc_cat=1&_nc_oc=Q6cZ2AGpE9ghK6FVW-SUB3AI4p7-QXdLJ2cyAQzC5L8eRJDQ4hPTFMD5v99r3e08B8ISLJU&_nc_ohc=10EvF-gTgGEQ7kNvgH-nAe-&_nc_gid=24073162fb2e4f89ba6e1396958855ee&edm=AP4sbd4BAAAA&ccb=7-5&oh=00_AYDpVQxFijM0gWMzp6mC80WuwFFKSztyKYeZhcngAbZEXw&oe=67708C4E&_nc_sid=7a9f4b","description":"<p style=\"min-height:1.5em\">Kindred is a members-only home swapping network that unlocks the ability to live a travel-rich lifestyle through the power of community. By exchanging primary residences with trusted peers, renters and owners alike can match with Kindred spirits and explore new destinations without breaking the bank.</p><p style=\"min-height:1.5em\">We are on a mission to build a sharing economy that lives up to the name, and we’ve raised significant capital from some of the best investors in Silicon Valley, including Index Ventures, Andreessen Horowitz, New Enterprise Associates, Bessemer Venture Partners, Caffeinated Capital, Elad Gil, and the founders of Opendoor, Figma, ClassPass, Clubhouse, Divvy, Gem, and Homebound.</p><p style=\"min-height:1.5em\">The co-founders are proven leaders from the early team at proptech company Opendoor ($15B+ exit) and have each separately built and scaled products that today do $1B+ annual revenue combined.</p><p style=\"min-height:1.5em\">We’re looking for the world’s top builders, executors, and believers to join us on this ride.</p><p style=\"min-height:1.5em\">You can learn more about us in <a target=\"_blank\" rel=\"noopener noreferrer nofollow\" href=\"https://www.forbes.com/sites/bridgetarsenault/2022/06/10/a-new-home-swapping-platform-allows-you-to-travel-the-world-like-cameron-diaz-and-kate-winslet/?sh=203a5d0722cb\">Forbes</a> and <a target=\"_blank\" rel=\"noopener noreferrer nofollow\" href=\"https://techcrunch.com/2023/04/19/opendoor-alums-raise-15m-for-kindred-a-home-swapping-network/\">TechCrunch</a>.</p><p style=\"min-height:1.5em\"><br /><strong>The Role:</strong></p><p style=\"min-height:1.5em\">We are seeking an experienced Senior Recruiter to help build a world-class team at Kindred. As our first full-time, in-house recruiter, this role is critical to Kindred’s ability to scale and achieve its mission by identifying, attracting, and hiring exceptional talent. This is a unique opportunity to get in on the ground floor of a fast-paced startup and play a critical role in growing the team at Kindred. You’ll partner closely with hiring managers and cross-functional teams to ensure we bring on individuals who align with our values and contribute to our vision.</p><p style=\"min-height:1.5em\">This role blends tactical execution and strategic thinking, as you’ll manage the full-cycle recruiting process for technical, operational, and G&amp;A roles while also shaping our candidate experience and employer brand. As a trusted advisor and talent expert, you will play a pivotal role in shaping Kindred’s culture and success by creating an inclusive and seamless hiring experience that reflects our human-first approach.<br /><br /></p><p style=\"min-height:1.5em\"><strong>You Will:</strong></p><ul style=\"min-height:1.5em\"><li><p style=\"min-height:1.5em\">Manage the full-cycle recruiting process, including sourcing, screening, interviews, feedback, and offers, for a variety of roles. As our first in-house Talent Acquisition team member, you will do your own coordination and scheduling until we build out the TA team.</p></li><li><p style=\"min-height:1.5em\">Build diverse talent pipeline for multiple requisitions across business teams, geographies and levels, considering equity and inclusion and the importance of balanced candidate slates.</p></li><li><p style=\"min-height:1.5em\">Partner with hiring managers to define role requirements, develop hiring plans, and provide guidance throughout the process, designing a smooth and positive internal recruiting experience for our hiring managers and interviewers.</p></li><li><p style=\"min-height:1.5em\">Deliver a seamless and thoughtful candidate experience that aligns with Kindred’s values and mission. Find the best, brightest and most passionate people for Kindred using new and creative ways to find and engage them.</p></li><li><p style=\"min-height:1.5em\">Represent Kindred with integrity and professionalism. Speak passionately and authentically about Kindred and our mission, and reflect our values throughout the recruiting process.</p></li><li><p style=\"min-height:1.5em\">Use data and metrics to track progress, inform decisions, and continuously improve recruiting practices.</p></li><li><p style=\"min-height:1.5em\">Contribute to the development of creative, innovative, and efficient strategies to attract top talent in a competitive market.</p></li><li><p style=\"min-height:1.5em\">Partner with People Operations to develop a consistent employee experience and establish our employer brand.<br /><br /></p></li></ul><p style=\"min-height:1.5em\"><strong>You may be a fit for this role if you:</strong></p><ul style=\"min-height:1.5em\"><li><p style=\"min-height:1.5em\">Have 7+ years of full-cycle recruiting experience, preferably in a high-growth or startup environment.</p></li><li><p style=\"min-height:1.5em\">Possess strong skills in advising and influencing hiring managers while balancing immediate and long-term business needs.</p></li><li><p style=\"min-height:1.5em\">Are deeply committed to fostering diversity and equity in hiring practices.</p></li><li><p style=\"min-height:1.5em\">Communicate effectively and navigate complex conversations with clarity and empathy.</p></li><li><p style=\"min-height:1.5em\">Adapt quickly to ambiguous and fast-changing environments.</p></li><li><p style=\"min-height:1.5em\">Excel at building collaborative relationships across teams and functions.</p></li><li><p style=\"min-height:1.5em\">Leverage data and metrics to drive decisions and continuously improve processes.</p></li><li><p style=\"min-height:1.5em\">Embrace feedback, learning, and continuous growth with enthusiasm.</p></li><li><p style=\"min-height:1.5em\">Are based in San Francisco and can come into the office at least 2 days per week to organize on-site interviews.<br /><br /></p></li></ul><p style=\"min-height:1.5em\"><strong>Bonus points if you:</strong></p><ul style=\"min-height:1.5em\"><li><p style=\"min-height:1.5em\">Have experience using Ashby<br /><br /></p></li></ul><h1><strong>Our Benefits:</strong></h1><p style=\"min-height:1.5em\">At Kindred, we know that good things happen when we look out for one another. We offer our employees the following benefits:</p><ul style=\"min-height:1.5em\"><li><p style=\"min-height:1.5em\">Our opening spans more than one career level. The base salary offered depends on many factors, such as work experience, transferable skills, business needs and impact, and market demands.</p></li><li><p style=\"min-height:1.5em\">A vibrant, inclusive, and highly skilled team that ferociously protects team chemistry</p></li><li><p style=\"min-height:1.5em\">A culture of championship (vs. just mentorship), feedback, and continual development</p></li><li><p style=\"min-height:1.5em\">Competitive cash compensation and equity</p></li><li><p style=\"min-height:1.5em\">Comprehensive health benefits</p></li><li><p style=\"min-height:1.5em\">Flexible vacation policy</p></li><li><p style=\"min-height:1.5em\">Unlimited credits to stay at Kindred homes during your time as an employee</p></li><li><p style=\"min-height:1.5em\">$4,000 annual travel stipend to use toward travel costs to stay at a Kindred home</p></li><li><p style=\"min-height:1.5em\">Remote-flexible work environment. We encourage team members to travel and adventure, including working from Kindred HQ in San Francisco!</p></li><li><p style=\"min-height:1.5em\">Regular offsites to co-locate with the team</p></li></ul><p style=\"min-height:1.5em\"><em>At Kindred, we believe that bringing together people who have different worldviews, personal circumstances, and unique experiences improves our customer service, work environment, and one another. Diverse strengths, abilities, ideas, and perspectives power the flow of innovation and creativity, which is vital to our success. We encourage people from all walks of life — all backgrounds, identities, genders, ages, races, religions, abilities, and socioeconomic statuses — to apply.</em></p><p style=\"min-height:1.5em\"><em>We are committed to providing equal employment opportunities for all applicants and employees. Kindred does not discriminate on the basis of any protected characteristic, including race, color, ancestry, national origin, religion, creed, age, disability, sex, gender, sexual orientation, gender identity, gender expression, medical condition, genetic information, family care or medical leave status, marital status, domestic partner status, military and veteran status, or any other characteristic protected by US federal, state or local laws, or the laws of the country or jurisdiction where you work. Pursuant to the San Francisco Fair Chance Ordinance, we will consider for employment qualified applicants with arrest and conviction records.</em></p>","tags":"[\"aws\"]","pubDate":"2024-12-30T16:25:41.430Z","link":"https://jobs.ashbyhq.com/kindred/48f426c1-337f-4942-b4a3-e18b4b2ffa12","slug":"senior-recruiter-kindred-94"},{"id":9172323121,"title":"Ad Creative Producer","company":"Ruby Labs","image":"https://media.licdn.com/dms/image/v2/D4D0BAQF7VVv61POIFw/company-logo_200_200/company-logo_200_200/0/1721937953426?e=1743033600&v=beta&t=_qAkZ_qGO7Du2NSUdHDNbUKIbz28Y1HDm1g9mwNIOnk","description":"<h1><strong>About us</strong></h1><p style=\"min-height:1.5em\">Ruby Labs is a leading tech company that creates and operates innovative consumer products. We offer a diverse range of opportunities across the health, education, and entertainment industries. Our innovative teams are driving the future of consumer-led products, and we're always looking for passionate individuals to join us. Learn more about our story at: <a target=\"_blank\" rel=\"noopener noreferrer nofollow\" href=\"https://rubylabs.com/about-us/\">https://rubylabs.com/about-us/</a></p><p style=\"min-height:1.5em\"></p><h1><strong>About the role</strong></h1><p style=\"min-height:1.5em\">We are seeking a talented and innovative Ad Creative Producer to join our dynamic marketing team at Ruby Labs. This full-time role is central to driving our advertising creative process across multiple consumer-focused brands. You will be responsible for developing new ad concepts, managing production timelines, and collaborating with various teams to ensure that our creatives not only captivate but also convert. As a key player in the ad production lifecycle, you will work directly under the Ad Creative Director and maintain close coordination with User Acquisition Managers to refine and optimize our advertising strategies based on performance data.</p><p style=\"min-height:1.5em\"></p><h1><strong>Key Responsibilities</strong></h1><ul style=\"min-height:1.5em\"><li><p style=\"min-height:1.5em\"><strong>Creative Development:</strong></p><ul style=\"min-height:1.5em\"><li><p style=\"min-height:1.5em\">Lead the ideation and conceptualization of new ad creatives that resonate with diverse audiences, with an emphasis on strategies that enhance customer acquisition.</p></li><li><p style=\"min-height:1.5em\">Stay ahead of industry trends to integrate innovative elements into creative production, ensuring our creatives are captivating and effectively convert viewers into customers.</p></li><li><p style=\"min-height:1.5em\">Collaborate with design teams to transform ideas into compelling ad creatives that align with brand values and effectively meet campaign goals.</p></li></ul></li><li><p style=\"min-height:1.5em\"><strong>Project Management:</strong></p><ul style=\"min-height:1.5em\"><li><p style=\"min-height:1.5em\">Oversee the production process to ensure all projects are delivered on time and meet the creative vision, with particular attention to optimizing the impact on customer acquisition.</p></li><li><p style=\"min-height:1.5em\">Coordinate with designers, user acquisition managers, and other team members to ensure smooth workflow and high-quality outputs.</p></li></ul></li><li><p style=\"min-height:1.5em\"><strong>Performance Analysis:</strong></p><ul style=\"min-height:1.5em\"><li><p style=\"min-height:1.5em\">Work closely with User Acquisition Managers to analyze the performance of ad creatives across various platforms, identifying those that best contribute to customer acquisition.</p></li><li><p style=\"min-height:1.5em\">Generate and test hypotheses in A/B testing to refine creatives, with a focus on optimizing conversion rates and improving overall campaign performance.</p></li><li><p style=\"min-height:1.5em\">Provide regular reports to the Ad Creative Director on the impact and effectiveness of ad creatives, highlighting their role in driving customer acquisition.</p></li></ul></li><li><p style=\"min-height:1.5em\"><strong>Market and Competitor Analysis:</strong></p><ul style=\"min-height:1.5em\"><li><p style=\"min-height:1.5em\">Conduct thorough competitor research to understand market benchmarks and creative standards, particularly those successful in acquiring customers.</p></li><li><p style=\"min-height:1.5em\">Identify emerging trends in ad creative production and propose innovative solutions to leverage these trends for better market positioning and customer engagement.</p></li></ul></li><li><p style=\"min-height:1.5em\"><strong>Collaborative Efforts:</strong></p><ul style=\"min-height:1.5em\"><li><p style=\"min-height:1.5em\">Liaise between creative teams and user acquisition managers to ensure that ad creatives are optimized for performance based on real-time data.</p></li><li><p style=\"min-height:1.5em\">Facilitate brainstorming sessions that encourage a culture of creativity and continuous improvement, aimed at boosting customer acquisition and retention.</p></li></ul></li></ul><h1><strong>Qualifications</strong></h1><ul style=\"min-height:1.5em\"><li><p style=\"min-height:1.5em\"><strong>Experience:</strong></p><ul style=\"min-height:1.5em\"><li><p style=\"min-height:1.5em\">3+ years of experience in creative production or a similar role, preferably in a tech-focused or consumer product company.</p></li><li><p style=\"min-height:1.5em\">Proven track record of managing creative projects from inception to completion.</p></li><li><p style=\"min-height:1.5em\">Strong portfolio demonstrating expertise in producing high-performing digital ads.</p></li></ul></li><li><p style=\"min-height:1.5em\"><strong>Technical Skills:</strong></p><ul style=\"min-height:1.5em\"><li><p style=\"min-height:1.5em\">Expertise in digital advertising platforms and understanding of performance metrics.</p></li><li><p style=\"min-height:1.5em\">Proficiency in project management tools and collaboration software.</p></li><li><p style=\"min-height:1.5em\">Ability to perform data analysis to draw actionable insights from campaign results. </p></li><li><p style=\"min-height:1.5em\">Up-to-date knowledge of AI tools used in creative production, with the ability to leverage them effectively to generate innovative ad creatives.</p></li></ul></li><li><p style=\"min-height:1.5em\"><strong>Personal Qualities:</strong></p><ul style=\"min-height:1.5em\"><li><p style=\"min-height:1.5em\">Strong creative vision with the ability to think out of the box and challenge the status quo.</p></li><li><p style=\"min-height:1.5em\">Excellent communication and interpersonal skills to manage diverse teams and stakeholders.</p></li><li><p style=\"min-height:1.5em\">Detail-oriented with strong organizational skills to manage multiple projects simultaneously.</p></li></ul></li><li><p style=\"min-height:1.5em\"><strong>Adaptability:</strong></p><ul style=\"min-height:1.5em\"><li><p style=\"min-height:1.5em\">Ability to quickly adapt to new technologies and changes in the digital marketing landscape.</p></li><li><p style=\"min-height:1.5em\">Willingness to experiment with new creative ideas and approaches to advertising.</p><p style=\"min-height:1.5em\"></p></li></ul></li></ul><h1><strong>Location</strong></h1><p style=\"min-height:1.5em\">Ruby Labs operates within the CET (Central European Time) zone. Applicants from any country are welcome to apply for the position as long as they are located within approximately ± 4 hours of CET. This ensures optimal collaboration and communication during working hours.</p><p style=\"min-height:1.5em\"></p><h1><strong>Benefits</strong></h1><p style=\"min-height:1.5em\">Discover the perks of being part of our vibrant team! We offer:</p><ul style=\"min-height:1.5em\"><li><p style=\"min-height:1.5em\"><strong>Remote Work Environment:</strong> Embrace the freedom to work from anywhere, anytime, promoting a healthy work-life balance. 🏡⏰</p></li><li><p style=\"min-height:1.5em\"><strong>Unlimited PTO:</strong> Enjoy unlimited paid time off to recharge and prioritize your well-being, without counting days. 🌴💼</p></li><li><p style=\"min-height:1.5em\"><strong>Paid National Holidays:</strong> Celebrate and relax on national holidays with paid time off to unwind and recharge. 🎉🌟</p></li><li><p style=\"min-height:1.5em\"><strong>Company-provided MacBook:</strong> Experience seamless productivity with top-notch Apple MacBooks provided to all employees who need them. 💻🚀</p></li><li><p style=\"min-height:1.5em\"><strong>Flexible Independent Contractor Agreement:</strong> Unlock the benefits of flexibility, autonomy, and entrepreneurial opportunities. Benefit from tax advantages, networking opportunities, reduced employment obligations, and the freedom to work from anywhere. Read more about it here: <a target=\"_blank\" rel=\"noopener noreferrer nofollow\" href=\"https://docs.google.com/document/d/1dHF4ctKlez75whdn-ybUwP5d5Wr0BdwVrorrm_fM40Q/preview\">https://docs.google.com/document/d/1dHF4ctKlez75whdn-ybUwP5d5Wr0BdwVrorrm_fM40Q/preview</a> 📈💼</p></li></ul><p style=\"min-height:1.5em\">Be part of our fast-growing team and seize this excellent opportunity for personal and professional growth!</p><p style=\"min-height:1.5em\"></p><h1><strong>Interview Process</strong></h1><p style=\"min-height:1.5em\">After submitting your application, we conduct a thorough review which typically takes 3 to 5 days, but may occasionally take longer due to the volume of applications received. If we see a potential fit, we proceed with the following steps:</p><ul style=\"min-height:1.5em\"><li><p style=\"min-height:1.5em\">Recruiter Screening (40 minutes)</p></li><li><p style=\"min-height:1.5em\">Technical Interview (90 minutes)</p></li><li><p style=\"min-height:1.5em\">Final Interview (60 minutes)</p></li></ul><p style=\"min-height:1.5em\"></p><h1><strong>Life at Ruby Labs</strong></h1><p style=\"min-height:1.5em\">At Ruby Labs, we are more than a team; we're a community united in pushing the boundaries of technology and innovation. Our combined passion fuels our ambition for excellence, driving impact that resonates around the globe.</p><p style=\"min-height:1.5em\">We are an equal-opportunity employer and celebrate diversity, recognizing that a diversity of thought and backgrounds builds stronger teams. We approach diversity and inclusion seriously and thoughtfully. We do not discriminate based on race, ethnicity, religion, color, place of birth, sex, gender identity or expression, sexual orientation, age, marital status, military service status, or disability status. Join us and be part of a company that is crafting the future of technology across multiple industries.</p><p style=\"min-height:1.5em\"></p><p style=\"min-height:1.5em\">#Li-Remote</p>","tags":"[\"management\"]","pubDate":"2024-12-30T11:44:23.895Z","link":"https://jobs.ashbyhq.com/ruby-labs/076b2098-99a8-48d9-8f7e-d2fde0492a9d","slug":"ad-creative-producer-ruby-labs-3339"},{"id":6050728749,"title":"Senior Growth Product Manager","company":"Ruby Labs","image":"https://media.licdn.com/dms/image/v2/D4D0BAQF7VVv61POIFw/company-logo_200_200/company-logo_200_200/0/1721937953426?e=1743033600&v=beta&t=_qAkZ_qGO7Du2NSUdHDNbUKIbz28Y1HDm1g9mwNIOnk","description":"<h1><strong>About us</strong></h1><p style=\"min-height:1.5em\">At Hint, we revolutionize the way people engage with astrology by combining cutting-edge NASA data with personalized guidance from professional astrologers. Our app offers hyper-personalized insights, 1-on-1 consultations, and detailed astrological charts, helping users navigate their lives with greater awareness and confidence. We are committed to delivering a fun and friendly user experience while empowering our community to lead happier and healthier lives. Join us and be a part of the future of digital astrology.</p><p style=\"min-height:1.5em\"></p><h1><strong>About the role</strong></h1><p style=\"min-height:1.5em\">We at Hint are looking for a highly experienced and specialized Senior Growth Product Manager to join our team. Hint is a web astrology app, operating as a web-to-web business. The primary focus of this role is to drive top-of-funnel growth through optimizing our web quizzes, leading to user registration and payment. This role requires direct experience in managing and improving web funnels in a B2C environment.</p><p style=\"min-height:1.5em\"></p><h1><strong>Key Responsibilities</strong></h1><ul style=\"min-height:1.5em\"><li><p style=\"min-height:1.5em\"><strong>Funnel Optimization:</strong> Define and implement hypotheses to improve the conversion rate (CR) to purchase and lifetime value (LTV) within the web funnel.</p></li><li><p style=\"min-height:1.5em\"><strong>Data-Driven Strategy:</strong> Dive deep into data on the competitive environment and user behavior to propose strategies that drive customer acquisition efficiency and improve ROAS.</p></li><li><p style=\"min-height:1.5em\"><strong>Testing Roadmap:</strong> Run a robust testing roadmap, driving continuous improvement in the web funnel. You will ensure that strict quarterly KPIs are met and exceeded.</p></li><li><p style=\"min-height:1.5em\"><strong>Cross-Functional Collaboration:</strong> Collaborate closely with designers, developers, and other key stakeholders to seamlessly execute optimization strategies, from product requirement documents to execution.</p></li><li><p style=\"min-height:1.5em\"><strong>Agile Ceremonies:</strong> Assist Engineering team in leading agile software development ceremonies, including daily standups, grooming, planning, and retrospectives.</p></li><li><p style=\"min-height:1.5em\"><strong>Ownership of Results:</strong> Lead the entire growth process, taking full responsibility for results, from hypothesis creation to final implementation and evaluation.</p></li><li><p style=\"min-height:1.5em\"><strong>UA Collaboration:</strong> Work hand-in-hand with the User Acquisition (UA) team to build and optimize the full flow, ensuring that every step, from the first user interaction through registration and payment, is optimized for growth.</p></li><li><p style=\"min-height:1.5em\"><strong>User Pain Points:</strong> Deeply understand user pain points and behaviors, leveraging this understanding to determine the most effective strategies for selling our product.</p></li></ul><p style=\"min-height:1.5em\"></p><h1><strong>Qualifications</strong></h1><ul style=\"min-height:1.5em\"><li><p style=\"min-height:1.5em\">Proven experience with <strong>web funnel optimization</strong> in a B2C environment.</p></li><li><p style=\"min-height:1.5em\">4+ years of growth product management experience, specializing in B2C subscription models.</p></li><li><p style=\"min-height:1.5em\">Ability to define, run, and analyze <strong>A/B tests</strong> specifically for web-based funnels.</p></li><li><p style=\"min-height:1.5em\">Experience leading growth initiatives with a focus on <strong>improving CR, LTV,</strong> and other performance metrics.</p></li><li><p style=\"min-height:1.5em\">Strong collaboration skills to work effectively with <strong>cross-functional teams</strong> including designers, developers, and data science teams.</p></li><li><p style=\"min-height:1.5em\">Ability to manage multiple growth initiatives and meet strict <strong>quarterly KPIs</strong>.</p></li><li><p style=\"min-height:1.5em\">Strong problem-solving skills with a <strong>user-first mindset</strong>, aiming to understand pain points and optimize user experience.</p></li><li><p style=\"min-height:1.5em\">Experience in building and executing <strong>strategic roadmaps</strong> for growth testing.</p></li><li><p style=\"min-height:1.5em\">Familiarity with leading <strong>agile software development</strong> ceremonies is a plus.</p></li></ul><p style=\"min-height:1.5em\"></p><h1><strong>Location</strong></h1><p style=\"min-height:1.5em\">Hint operates within the CET (Central European Time) zone. Applicants from any country are welcome to apply for the position as long as they are located within approximately ± 4 hours of CET. This ensures optimal collaboration and communication during working hours.</p><p style=\"min-height:1.5em\"></p><h1><strong>Benefits</strong></h1><p style=\"min-height:1.5em\">Discover the perks of being part of our vibrant team! We offer:</p><ul style=\"min-height:1.5em\"><li><p style=\"min-height:1.5em\"><strong>Remote Work Environment:</strong> Embrace the freedom to work from anywhere, anytime, promoting a healthy work-life balance. 🏡⏰</p></li><li><p style=\"min-height:1.5em\"><strong>Unlimited PTO:</strong> Enjoy unlimited paid time off to recharge and prioritize your well-being, without counting days. 🌴💼</p></li><li><p style=\"min-height:1.5em\"><strong>Paid National Holidays:</strong> Celebrate and relax on national holidays with paid time off to unwind and recharge. 🎉🌟</p></li><li><p style=\"min-height:1.5em\"><strong>Company-provided MacBook:</strong> Experience seamless productivity with top-notch Apple MacBooks provided to all employees who need them. 💻🚀</p></li><li><p style=\"min-height:1.5em\"><strong>Flexible Independent Contractor Agreement:</strong> Unlock the benefits of flexibility, autonomy, and entrepreneurial opportunities. Benefit from tax advantages, networking opportunities, reduced employment obligations, and the freedom to work from anywhere. Read more about it here: <a target=\"_blank\" rel=\"noopener noreferrer nofollow\" href=\"https://docs.google.com/document/d/1dHF4ctKlez75whdn-ybUwP5d5Wr0BdwVrorrm_fM40Q/preview\">https://docs.google.com/document/d/1dHF4ctKlez75whdn-ybUwP5d5Wr0BdwVrorrm_fM40Q/preview</a> 📈💼</p></li></ul><p style=\"min-height:1.5em\">Be part of our fast-growing team and seize this excellent opportunity for personal and professional growth!</p><p style=\"min-height:1.5em\"></p><h1><strong>Interview Process</strong></h1><p style=\"min-height:1.5em\">After submitting your application, we conduct a thorough review which typically takes 3 to 5 days, but may occasionally take longer due to the volume of applications received. If we see a potential fit, we proceed with the following steps:</p><ul style=\"min-height:1.5em\"><li><p style=\"min-height:1.5em\">Recruiter Screening (40 minutes)</p></li><li><p style=\"min-height:1.5em\">Technical Interview (60 minutes)</p></li><li><p style=\"min-height:1.5em\">Final Interview (60 minutes)</p></li></ul><p style=\"min-height:1.5em\"></p><h1><strong>Life at Hint</strong></h1><p style=\"min-height:1.5em\">By joining Hint, you’ll become part of a team that picks each other up, collaborates daily, and works hard, fast, and intelligently because they’re motivated and passionate about being the best in the industry. We thrive on innovation, push the boundaries, and are proud of our work!</p><p style=\"min-height:1.5em\">At Hint, we foster a culture of creativity and continuous learning, where everyone's ideas are valued. We believe in maintaining a healthy work-life balance, supporting each other's growth, and celebrating our successes together.</p><p style=\"min-height:1.5em\"></p><p style=\"min-height:1.5em\">#Li-Remote</p>","tags":"[\"management\",\"engineering\",\"b2c\"]","pubDate":"2024-12-30T11:43:13.395Z","link":"https://jobs.ashbyhq.com/ruby-labs/561027a7-e42e-49fe-9a82-f1ef47c06378","slug":"senior-growth-product-manager-ruby-labs-3585"},{"id":9364871325,"title":"Director of Sales - (Remote-only position)","company":"CloudLinux","image":"https://pbs.twimg.com/profile_images/696718028084482050/ymY3OEPk_400x400.png","description":"<p>We are looking for a highly experienced and results-driven Vice President of Sales to lead our sales department and drive revenue growth. As the VP of Sales, you will be responsible for developing and executing strategic sales plans, managing a high-performing sales team, and building strong relationships with key clients. You will work closely with the executive team to define sales objectives, set targets, and implement effective sales strategies that align with TuxCare's business goals.</p><p></p><p>TuxCare is a leading provider of comprehensive IT infrastructure and security solutions. We specialize in delivering top-quality services to ensure our clients' systems and networks are secure, reliable, and optimized for maximum performance. With our cutting-edge technology solutions and a customer-centric approach, we empower organizations to focus on their core business operations while we take care of their IT needs. For more information, go to <a href=\"http://tuxcare.com/\" rel=\"nofollow noreferrer noopener\" class=\"external\">tuxcare.com</a>.</p><p></p><p><strong>As our Director/VP of Sales, you will be responsible for:</strong></p><ul> <li>Develop and implement a sales strategy to achieve revenue targets and drive business growth.</li> <li>Identify new market opportunities and plan strategies to expand into those markets.</li> <li>Coach and develop the sales team to achieve targets and key success metrics.</li> <li>Build strong relationships with key clients and understand their needs.</li> <li>Analyze sales data and market trends for improvement opportunities.</li> <li>Collaborate across departments and align sales efforts with marketing campaigns.</li> <li>Represent TuxCare at industry events.</li> <li>Prepare weekly sales reports for review.</li> </ul><h3>Requirements: </h3><p><strong>To be successful in this role you should have:</strong></p><ul> <li>Proven track record of success in sales leadership roles, preferably in the IT infrastructure or technology industry.</li> <li>Extensive experience in driving sales growth, meeting revenue targets, and expanding market share.</li> <li>Strong leadership skills with the ability to inspire and motivate a sales team to achieve exceptional results.</li> <li>Excellent interpersonal and communication skills, with the ability to build relationships with key clients and stakeholders.</li> <li>Strategic thinker with a deep understanding of market dynamics and the ability to identify new business opportunities.</li> <li>Analytical mindset with the ability to interpret sales data and make data-driven decisions.</li> <li>Strong negotiation and presentation skills.</li> <li>Willingness to travel as needed.</li> </ul><p></p><h3>Benefits: </h3><p><strong>What's in it for you?</strong></p><ul> <li>A focus on professional development; </li> <li>Interesting and challenging projects</li> <li>Flexible working hours</li> <li>Paid one month vacation per year and unlimited sick leave</li> <li>Medical insurance reimbursement</li> <li>Co-working and gym/sports reimbursement</li> <li>The opportunity to receive a reward for the most innovative idea that the company can patent</li> </ul><p></p><p><em>By applying for this position, you consent to the processing of your personal data as described in our Privacy Policy (</em><a href=\"https://cloudlinux.com/candidate-privacy-notice\" target=\"_blank\" rel=\"nofollow noreferrer noopener\" class=\"external\"><em>https://cloudlinux.com/candidate-privacy-notice</em></a><em>), which provides detailed information on how we maintain and handle your data.</em></p>","tags":"[]","pubDate":"2024-12-30T00:00:00.000Z","link":"https://apply.workable.com/cloudlinux-1/j/292799A441","slug":"director-of-sales-remote-only-position-cloudlinux-3654"},{"id":1475037158,"title":"Senior Software Engineer","company":"Wealthwizards","image":"https://remotive.com/job/1959489/logo","description":"<div><!--block--><em>** Please note that any applications submitted for this role will not be reviewed until January 2025** </em><br><br>Our vision is a future where everybody in society has access to financial advice and guidance. Our Software as a Service (SaaS) platform provides engaging digital experiences for consumers and powerful tools for financial advisers.</div><div><!--block--><br>In our cross-functional product teams, Software Engineers work directly with Product Owners and UX Designers to build our customer journeys and services. We are a true Fintech with a strong engineering culture and focus on innovation and agile methodology. We have an excellent Developer Experience and use a modern AWS-based serverless web stack including SST, Next.js and Typescript.</div><div><!--block--><br>As a Software Engineer, you are empowered to own the full lifecycle of the software you create: designing the system, writing code, building automated tests and running the system in production.</div><br><br><div class=\"h3\">About the Role</div><div><!--block-->As a <strong>Senior Software Engineer (backend development)</strong>, you will play a pivotal role in designing, building, testing, deploying, and maintaining our innovative financial advice platform, contributing significantly to our mission of making financial advice accessible to everyone. You will report directly to the Lead Software Engineer and work collaboratively with Product Managers and other team members to deliver high-quality software solutions. </div><div><!--block--><br>You will contribute to design discussions within the team, write code, pair with others, review PRs, solve problems, and ensure a high standard of quality. You will use your experience to mentor and guide other Software Engineers in the team. You will also assist in monitoring the services in production and contribute to technical Golden Path patterns shared across multiple teams.<br><br><strong>Responsibilities </strong></div><ul style=\"\"><li style=\"\"><!--block-->Collaborate closely with the Lead Software Engineer and Product Managers to deliver software solutions that align with the team's objectives and the company's vision.</li><li style=\"\"><!--block-->Demonstrate expertise in applying agile delivery principles in your work, ensuring efficient and effective software delivery.</li><li style=\"\"><!--block-->Take a leading role in building, supporting, and maintaining products that are continuously delivered into our production environments.</li><li style=\"\"><!--block-->Write clear, well-tested, and maintainable code, focusing on quality, scalability, and maintainability.</li><li style=\"\"><!--block-->Engage in technical discussions, task analysis, design meetings, and code reviews, providing valuable insights and feedback.</li><li style=\"\"><!--block-->Advocate and adhere to our coding standards and engineering principles, contributing to their continuous improvement.</li><li style=\"\"><!--block-->Use deliberate analysis and planning to address complex situations and challenges.</li><li style=\"\"><!--block-->Ensure that all aspects of product delivery are covered, with a strong focus on non-functional quality attributes like security, reliability, scalability, maintainability, and accessibility.</li><li style=\"\"><!--block-->Mentor and guide Software Engineers, sharing knowledge and best practices, and assisting in their professional development.</li></ul><br><br><div class=\"h3\">Your Skills</div><ul style=\"\"><li style=\"\"><!--block-->Proven knowledge and experience in <strong>Node.js </strong>development, preferably using <strong>Typescript</strong>, as evidenced by our remote technical test.</li><li style=\"\"><!--block-->Strong experience in React or similar front-end frameworks, as well as in developing <strong>back-end</strong> <strong>REST APIs</strong> and working with relational or NoSQL databases.</li><li style=\"\"><!--block-->Familiarity with <strong>serverless architecture</strong>, preferably within the <strong>AWS</strong> ecosystem.</li><li style=\"\"><!--block-->Skilled in refactoring systems towards cleaner architecture using techniques such as abstraction and facades.</li><li style=\"\"><!--block-->A commitment to continuous learning and skill development.</li><li style=\"\"><!--block-->Ability to take ownership of tasks, analyse them, and solve new problems independently.</li><li style=\"\"><!--block-->Strong collaboration skills, with a desire to work closely with team members, learn from them, and share your own knowledge.</li><li style=\"\"><!--block-->Technical curiosity, resilience in problem-solving, and a habit of seeking feedback early and often.</li><li style=\"\"><!--block-->Excellent communication skills, capable of effectively sharing context and understanding of problems with the team.</li><li style=\"\"><!--block-->Experience working as a software engineer in a team environment, open to pair programming.</li><li style=\"\"><!--block-->Understanding of agile practices and principles.</li><li style=\"\"><!--block-->Experience with unit and integration testing.</li><li style=\"\"><!--block-->Knowledge of data structures and data-driven design is a plus.</li><li style=\"\"><!--block-->Regular contributions to FoSS projects or technical articles is a bonus.</li><li style=\"\"><!--block-->Up-to-date with modern development practices, aware of the latest trends and tools.</li><li style=\"\"><!--block-->Confidence in both written and verbal communication skills.</li></ul><div><!--block--><br>This position offers an exceptional opportunity for a <strong>Senior Software Engineer, with a backend leaning focus</strong> to play a significant role in revolutionising the financial advice industry.</div><br><br><div class=\"h3\">Our Perks</div><ul style=\"\"><li style=\"\"><!--block-->Flexible working</li><li style=\"\"><!--block-->We prioritise a sustainable work/life balance</li><li style=\"\"><!--block-->We have a collaborative learning culture that promotes psychological safety</li><li style=\"\"><!--block-->25 days annual leave plus every bank holiday</li><li style=\"\"><!--block-->Company pension (up to 10% employer contribution)</li><li style=\"\"><!--block-->Company performance based Bonus scheme</li><li style=\"\"><!--block-->Paid day off to celebrate your birthday</li><li style=\"\"><!--block-->Additional holiday purchase (up to 5 days per year)</li><li style=\"\"><!--block-->Additional holidays for length of service (up to 3 days)</li><li style=\"\"><!--block-->Private medical insurance</li><li style=\"\"><!--block-->Dental and health cash plans</li><li style=\"\"><!--block-->Enhanced parental leave and pay</li><li style=\"\"><!--block-->Discounts on gym membership and health screening</li><li style=\"\"><!--block-->Employee assistance programme</li><li style=\"\"><!--block-->Life assurance of 4x basic salary</li><li style=\"\"><!--block-->£500 pension advice per year</li><li style=\"\"><!--block-->6 paid days per year for self development</li><li style=\"\"><!--block-->£500 individual training budget per year</li><li style=\"\"><!--block-->Professional memberships funded</li><li style=\"\"><!--block-->Salary sacrifice car scheme</li><li style=\"\"><!--block-->Cycle, Home &amp; Tech scheme</li></ul><div><!--block--><br></div><div><!--block--><em>** Please note that any applications submitted for this role will not be reviewed until January 2025**</em></div><img src=\"https://remotive.com/job/track/1959489/blank.gif?source=public_api\" alt=\"\"/>","tags":"[\"AWS\",\"node.js\",\"react\"]","pubDate":"2024-12-29T11:50:02.000Z","link":"https://remotive.com/remote-jobs/software-dev/senior-software-engineer-1959489","slug":"senior-software-engineer-wealthwizards-6139"}]