[{"id":1336471066,"title":"Director, Customer Support","company":"Empower","image":"https://lever-client-logos.s3.us-west-2.amazonaws.com/2e1a369c-b58f-41ac-8d86-4b0a77695e68-1687915522032.png","description":"<p style=\"min-height:1.5em\"><strong>EMPOWER OVERVIEW</strong></p><p style=\"min-height:1.5em\"><a target=\"_blank\" rel=\"noopener noreferrer nofollow\" href=\"http://empower.me/\">Empower</a> is shaking up an outdated financial system by providing real opportunity for our customers: the opportunity to get the cash they need, to access fair credit, and to change their financial story. Today, we’re helping millions of people find financial security through machine learning models that evaluate creditworthiness using a more inclusive lens and mobile-first products: Cash Advance, Thrive line of credit, and Petal credit cards. Tomorrow? Creating even more financial paths for our customers (and their wallets) to succeed.</p><p style=\"min-height:1.5em\">This year, Empower ranked #65 on Inc. 5000’s Fastest-Growing Private Companies list — our third year in a row cracking the top 100 — and was named by Forbes as one of the 25 Next Billion-Dollar Startups for 2024. Empower was also featured by Forbes on America’s Best Startup Employers list in 2023, and our Thrive line of credit product was named by Fast Company as one of 2022’s Next Big Things in Tech.</p><p style=\"min-height:1.5em\">Empower is backed by Sequoia Capital, Blisce, and Icon Ventures. Ready to grow your impact and accelerate your career? Take a look at our open roles — we can’t wait to meet you.</p><p style=\"min-height:1.5em\"></p><h2>The Opportunity: Director, Customer Support</h2><p style=\"min-height:1.5em\">Empower is looking for a Director of Customer Support to lead our Customer Support team, focusing on training and development, process optimization and operational efficiencies, relationship management, and data analysis to measure team performance. The ideal candidate is a strategic leader who understands the “voice of the customer,” and can guide the team toward achieving company goals, fostering customer retention, and ensuring the overall satisfaction of our users. We are open to multiple levels depending on the candidate’s level of experience.<br /><br />Empower is a remote-first company. We drive connectivity through regular company offsites. Travel for company offsites is expected at a minimum 2 times a year. For this role, you will also be expected to travel to the Philippines at a minimum of 3 times a year.</p><p style=\"min-height:1.5em\"></p><h2>How You'll Make an Impact</h2><ul style=\"min-height:1.5em\"><li><p style=\"min-height:1.5em\"><strong>Team Leadership: </strong>Manage, mentor, and coach the Customer Support team, in addition to overseeing offshore resources</p></li><li><p style=\"min-height:1.5em\"><strong>Growth and Optimization: </strong>Oversee hiring functions to<strong> </strong>scale the team; drive process improvements and ensure optimal resource allocation to enhance team performance</p></li><li><p style=\"min-height:1.5em\"><strong>Performance Tracking:</strong> Identify, track, and manage key performance indicators (KPIs) to measure customer success and team performance; ensure metrics are consistently met or exceeded by implementing effective performance management practices</p></li><li><p style=\"min-height:1.5em\"><strong>Data Analysis:</strong> Provide data-driven insights to the leadership team on Customer Support performance, potential risks, and opportunities for value expansion</p></li><li><p style=\"min-height:1.5em\"><strong>Relationship Management:</strong> Facilitate relationship-building across the Customer Support team, both with internal cross-functional departments and external partners/vendors  </p></li><li><p style=\"min-height:1.5em\"><strong>Customer Advocacy:</strong> Act as the voice of the customer, advocating for customer needs and aligning company offerings with customer expectations</p></li></ul><p style=\"min-height:1.5em\"></p><h2>Why You're a Great Fit</h2><ul style=\"min-height:1.5em\"><li><p style=\"min-height:1.5em\">7+ years of management experience, with at least 3+ years specifically managing a Customer Support team</p></li><li><p style=\"min-height:1.5em\">Proven track record of success in driving performance toward business objectives, achieving measurable results such as increased customer retention, growth, and satisfaction</p></li><li><p style=\"min-height:1.5em\">Deep understanding of Customer Support tools such as Zendesk (CRM), Maestro/Nice (QA), LMS, and performance management tools</p></li><li><p style=\"min-height:1.5em\">Experience managing outsourced vendors in global locations, ensuring alignment with internal goals and customer expectations</p></li><li><p style=\"min-height:1.5em\">Passionate about leveraging AI to transform customer support and drive business success</p></li><li><p style=\"min-height:1.5em\">Excellent communication, interpersonal, and presentation skills, with the ability to build strong relationships with customers and stakeholders </p></li><li><p style=\"min-height:1.5em\">Ability to thrive in a fast-paced startup environment; background in fintech is a plus</p><p style=\"min-height:1.5em\"></p></li></ul><h2>Our Interview Process</h2><ol style=\"min-height:1.5em\"><li><p style=\"min-height:1.5em\"><strong>Initial Recruiter Call:</strong> A conversation to learn about your experience and what you're looking for in your next role.</p></li><li><p style=\"min-height:1.5em\"><strong>Hiring Manager Interview:</strong> A deeper discussion about your background and the Director, Customer Support opportunity.</p></li><li><p style=\"min-height:1.5em\"><strong>Skills Panel:</strong> Meet with Empower team members to discuss your expertise and problem-solving approach.</p></li><li><p style=\"min-height:1.5em\"><strong>Leadership Conversation:</strong> A final conversation with our CEO to discuss how you'll contribute to Empower's mission (and how we can help you achieve your career goals along the way).</p></li></ol><p style=\"min-height:1.5em\"><strong>Don't meet every qualification? If you're excited about this challenge and driven to innovate, we still want to hear from you!</strong></p><p style=\"min-height:1.5em\"></p><h2>What You'll Get at Empower</h2><ul style=\"min-height:1.5em\"><li><p style=\"min-height:1.5em\"><strong>Meaningful Ownership:</strong> Competitive salary and generous equity in a profitable, fast growing company.</p></li><li><p style=\"min-height:1.5em\"><strong>Complete Support:</strong> 100% coverage for medical, dental, vision, and life insurance, plus a generous WFH reimbursement.</p></li><li><p style=\"min-height:1.5em\"><strong>High-Impact Teams:</strong> The chance to thrive in a small, focused team where your contributions directly shape outcomes for our business and customers.</p></li><li><p style=\"min-height:1.5em\"><strong>Remote First:</strong> A virtual first environment built on trust and outcomes.</p></li><li><p style=\"min-height:1.5em\"><strong>Team Connection:</strong> Twice-yearly company onsites where we come together to connect, learn, and build for the future (our last few have been in San Diego, Vail, and Flagstaff)!</p></li><li><p style=\"min-height:1.5em\"><strong>Growth Path:</strong> Ongoing opportunities for development in a dynamic, supportive, and creative environment.</p></li></ul><p style=\"min-height:1.5em\"></p><h2>The Empower Way</h2><p style=\"min-height:1.5em\">The Empower Way is one where bold ambition meets an owner mindset, where open dialogue and spirited debate are encouraged, and where everyone works together to put our customers first. We believe diverse voices lead to the best ideas, and we foster an environment where every individual is valued, heard, and supported as part of one unified team working to change lives and build a more inclusive future.</p><p style=\"min-height:1.5em\"><strong>If that sounds like you, join us and be part of a team that's helping millions of people reshape their financial futures.</strong></p>","tags":"[\"management\"]","pubDate":"2025-05-05T22:12:46.910Z","link":"https://jobs.ashbyhq.com/empower%20finance/030a603b-e3ac-4894-be25-06ced93fd9c1","slug":"director-customer-support-empower-7591"},{"id":6752088287,"title":"Software Engineer, iOS Core Product","company":"Speechify","image":"https://avatars.githubusercontent.com/u/32529485?s=200&v=4","description":"&lt;p&gt;The mission of Speechify is to make sure that reading is never a barrier to learning.&lt;/p&gt;\n&lt;p&gt;Over 30 million people use Speechify’s text-to-speech products to turn whatever they’re reading – PDFs, books, Google Docs, news articles, websites – into audio, so they can read faster, read more, and remember more. Speechify’s text-to-speech reading products include its iOS app, Android App, Mac App, Chrome Extension, and Web App. Google recently named Speechify the Chrome Extension of the Year and Apple named Speechify its App of the Day.&lt;/p&gt;\n&lt;p&gt;Today, nearly 200 people around the globe work on Speechify in a 100% distributed setting – Speechify has no office. These include frontend and backend engineers, AI research scientists, and others from Amazon, Microsoft, and Google, leading PhD programs like Stanford, high growth startups like Stripe, Vercel, Bolt, and many founders of their own companies.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Overview&lt;/strong&gt;&lt;/p&gt;\n&lt;p data-speechify-sentence=&quot;&quot;&gt;With the growth of our iOS app, being the #18 productivity app in the App Store category, we find the need for a Senior iOS Engineer to help us support the new user base as well as work on new and exciting projects to push our missing forward. &amp;nbsp;&amp;nbsp;&lt;/p&gt;\n&lt;p data-speechify-sentence=&quot;&quot;&gt;This is a key role and ideal for someone who thinks strategically, enjoys fast-paced environments, passionate about making product decisions, and has experience building great user experiences that delight users.&lt;/p&gt;\n&lt;p data-speechify-sentence=&quot;&quot;&gt;We are a flat organization that allows anyone to become a leader by showing excellent technical skills and delivering results consistently and fast. Work ethic, solid communication skills, and obsession with winning are paramount.&amp;nbsp;&lt;/p&gt;\n&lt;p data-speechify-sentence=&quot;&quot;&gt;Our interview process involves several technical interviews and we aim to complete them within 1 week.&amp;nbsp;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;What Yo&lt;/strong&gt;&lt;strong&gt;u’&lt;/strong&gt;&lt;strong&gt;ll Do&lt;/strong&gt;&lt;/p&gt;\n&lt;ul&gt;\n&lt;li data-speechify-sentence=&quot;&quot;&gt;Opportunity to lead key engineering and product decisions&lt;/li&gt;\n&lt;li data-speechify-sentence=&quot;&quot;&gt;Actively shipping production code for the Speechify iOS app&lt;/li&gt;\n&lt;li data-speechify-sentence=&quot;&quot;&gt;Work within a dedicated product team&lt;/li&gt;\n&lt;li data-speechify-sentence=&quot;&quot;&gt;Participate in product discussions to shape the product roadmap&lt;/li&gt;\n&lt;li data-speechify-sentence=&quot;&quot;&gt;Maintain and enhance the existing complex app architecture&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;&lt;strong&gt;An Ideal Candidate Should Have&lt;/strong&gt;&lt;/p&gt;\n&lt;ul&gt;\n&lt;li data-speechify-sentence=&quot;&quot;&gt;Experience. You&#39;ve worked on products that scaled to a large user base&lt;/li&gt;\n&lt;li data-speechify-sentence=&quot;&quot;&gt;Track record. You have worked on various products from inception to decent traction. You have been responsible for engineering the product&lt;/li&gt;\n&lt;li data-speechify-sentence=&quot;&quot;&gt;Customer obsession. We expect every team member whose responsibilities directly impact customers to be constantly obsessed about providing the best possible experience&lt;/li&gt;\n&lt;li data-speechify-sentence=&quot;&quot;&gt;Product thinking. You make thoughtful decisions about the evolution of your product and support internal teams and designers into taking the right direction&lt;/li&gt;\n&lt;li data-speechify-sentence=&quot;&quot;&gt;Speed. You work quickly to generate ideas and know how to decide which things can ship now and what things need time&lt;/li&gt;\n&lt;li data-speechify-sentence=&quot;&quot;&gt;Focus. We’re a high-growth startup with a busy, remote team. You know how and when to engage or be heads down&lt;/li&gt;\n&lt;li&gt;Technical skills. Swift, SwiftUI&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;&lt;strong&gt;Technical Requirements:&lt;/strong&gt;&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;Swift Programming Language&lt;/li&gt;\n&lt;li&gt;SwiftUI experience&lt;/li&gt;\n&lt;li&gt;Experience in Multithreading Programming&lt;/li&gt;\n&lt;li&gt;Working with CI/CD infrastructure&lt;/li&gt;\n&lt;li&gt;Experience with Fastlane&lt;/li&gt;\n&lt;li&gt;SOLID principles, the ability to write every single class according to SOLID&lt;/li&gt;\n&lt;li&gt;Experience with Git and understanding of different Git strategies&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p data-speechify-sentence=&quot;&quot;&gt;&lt;strong&gt;What We offer:&lt;/strong&gt;&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;A fast-growing environment where you can help shape the company and product&lt;/li&gt;\n&lt;li&gt;An entrepreneurial crew that supports risk, intuition, and hustle&lt;/li&gt;\n&lt;li&gt;The opportunity to make a big impact in a transformative industry&lt;/li&gt;\n&lt;li&gt;A competitive salary, a collegiate atmosphere, and a commitment to building a great asynchronous culture&lt;/li&gt;\n&lt;li&gt;Work on a product that millions of people use and where daily feedback includes users sharing that they cried when they first found the product because it was so impactful on their lives&lt;/li&gt;\n&lt;li&gt;Support people with learning differences like Dyslexia, ADD, Low Vision, Concussions, Autism, and Second Language Learners, and give reading superpowers to professionals all over the world&lt;/li&gt;\n&lt;li&gt;Work in one of the fastest growing sectors of tech: Intersection of Artificial Intelligence and Audio&amp;nbsp;&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;&lt;strong&gt;Compensation&lt;/strong&gt;: The US base salary range for this full-time position is $140,000-$200,000 + bonus + equity depending on experience&lt;br&gt;&amp;nbsp; &amp;nbsp; &amp;nbsp; &amp;nbsp; &amp;nbsp; &amp;nbsp; &amp;nbsp; &amp;nbsp; &amp;nbsp; &amp;nbsp; &amp;nbsp; &amp;nbsp; &amp;nbsp; &amp;nbsp; &amp;nbsp; &amp;nbsp; &amp;nbsp; &amp;nbsp; &amp;nbsp; &amp;nbsp; &amp;nbsp; &amp;nbsp; &amp;nbsp; &amp;nbsp; &amp;nbsp; &amp;nbsp; &amp;nbsp; &amp;nbsp; &amp;nbsp; &amp;nbsp; &amp;nbsp; &amp;nbsp; &amp;nbsp; &amp;nbsp; &amp;nbsp; &amp;nbsp; &amp;nbsp; &amp;nbsp; &amp;nbsp; &amp;nbsp; &amp;nbsp; &amp;nbsp; &amp;nbsp; &amp;nbsp; &amp;nbsp; &amp;nbsp; &amp;nbsp; &amp;nbsp; &amp;nbsp; &amp;nbsp; &amp;nbsp; &amp;nbsp; &amp;nbsp; &amp;nbsp; &amp;nbsp; &amp;nbsp; &amp;nbsp; &amp;nbsp; &amp;nbsp; &amp;nbsp; &amp;nbsp; &amp;nbsp;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Think you’re a good fit for this job?&amp;nbsp;&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;Tell us more about yourself and why you&#39;re interested in the role when you apply. &lt;br&gt;And don’t forget to include links to your portfolio and LinkedIn.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Not looking but know someone who would make a great fit?&amp;nbsp;&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;Refer them!&amp;nbsp;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Speechify is committed to a diverse and inclusive workplace.&amp;nbsp;&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;Speechify does not discriminate on the basis of race, national origin, gender, gender identity, sexual orientation, protected veteran status, disability, age, or other legally protected status.&lt;/p&gt;","tags":"[\"engineering\",\"legal\"]","pubDate":"2025-05-05T21:14:54.000Z","link":"https://job-boards.greenhouse.io/speechify/jobs/5527897004","slug":"software-engineer-ios-core-product-speechify-9909"},{"id":9173312831,"title":"Software Engineer, Web Core Product & Chrome Extension","company":"Speechify","image":"https://avatars.githubusercontent.com/u/32529485?s=200&v=4","description":"&lt;p&gt;The mission of Speechify is to make sure that reading is never a barrier to learning.&lt;/p&gt;\n&lt;p&gt;Over 30 million people use Speechify’s text-to-speech products to turn whatever they’re reading – PDFs, books, Google Docs, news articles, websites – into audio, so they can read faster, read more, and remember more. Speechify’s text-to-speech reading products include its iOS app, Android App, Mac App, Chrome Extension, and Web App. Google recently named Speechify the Chrome Extension of the Year and Apple named Speechify its App of the Day.&lt;/p&gt;\n&lt;p&gt;Today, nearly 200 people around the globe work on Speechify in a 100% distributed setting – Speechify has no office. These include frontend and backend engineers, AI research scientists, and others from Amazon, Microsoft, and Google, leading PhD programs like Stanford, high growth startups like Stripe, Vercel, Bolt, and many founders of their own companies.&lt;/p&gt;\n&lt;p&gt;&amp;nbsp;This is a key role and ideal for someone who thinks strategically, enjoys fast-paced environments, passionate about making product decisions, and has experience building great user experiences that delight users.&lt;/p&gt;\n&lt;p&gt;We are a flat organization that allows anyone to become a leader by showing excellent technical skills and delivering results consistently and fast. Work ethic, solid communication skills, and obsession with winning are paramount.&amp;nbsp;&lt;/p&gt;\n&lt;p&gt;Our interview process involves several technical interviews and we aim to complete them within 1 week.&amp;nbsp;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;What Yo&lt;/strong&gt;&lt;strong&gt;u’&lt;/strong&gt;&lt;strong&gt;ll Do&lt;/strong&gt;&lt;/p&gt;\n&lt;ul&gt;\n&lt;li data-speechify-sentence=&quot;&quot;&gt;Actively ship production code to the web products&lt;/li&gt;\n&lt;li data-speechify-sentence=&quot;&quot;&gt;Work closely with your dedicated product team&lt;/li&gt;\n&lt;li data-speechify-sentence=&quot;&quot;&gt;Participate in product discussions to shape the product roadmap&lt;/li&gt;\n&lt;li data-speechify-sentence=&quot;&quot;&gt;Have the opportunity to work on new and exciting features that will impact millions of lives&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;&lt;strong&gt;An Ideal Candidate Should Have&lt;/strong&gt;&lt;/p&gt;\n&lt;ul&gt;\n&lt;li data-speechify-sentence=&quot;&quot;&gt;Experience. You&#39;ve built and ship products that have scaled to thousands or millions of users&lt;/li&gt;\n&lt;li data-speechify-sentence=&quot;&quot;&gt;Customer obsession. You are passionate about the field and have the desire to build high quality product that serves customer needs&lt;/li&gt;\n&lt;li data-speechify-sentence=&quot;&quot;&gt;Speed. You work quickly to generate ideas and know how to decide which things can ship now and what things need time&lt;/li&gt;\n&lt;li data-speechify-sentence=&quot;&quot;&gt;Focus. We’re a high-growth startup with a busy, remote team. You know how and when to engage or be heads down&lt;/li&gt;\n&lt;li data-speechify-sentence=&quot;&quot;&gt;Collaboration. You know how to inspire, play, and negotiate with opinionated designers, marketers, and PMs&lt;/li&gt;\n&lt;li data-speechify-sentence=&quot;&quot;&gt;Tech Stack: Vanilla JS, ReactJS, Redux, Firebase, Typescript&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p data-speechify-sentence=&quot;&quot;&gt;&lt;strong&gt;What We Offer &lt;/strong&gt;&lt;/p&gt;\n&lt;ul&gt;\n&lt;li data-speechify-sentence=&quot;&quot;&gt;A fast-growing environment where you can help shape the culture&lt;/li&gt;\n&lt;li data-speechify-sentence=&quot;&quot;&gt;An entrepreneurial crew that supports risk, intuition, and hustle&lt;/li&gt;\n&lt;li data-speechify-sentence=&quot;&quot;&gt;A hands-off approach so you can focus and do your best work&lt;/li&gt;\n&lt;li data-speechify-sentence=&quot;&quot;&gt;The opportunity to make an impact in a transformative industry&lt;/li&gt;\n&lt;li data-speechify-sentence=&quot;&quot;&gt;A competitive salary, a collegiate atmosphere, and a commitment to building a great asynchronous culture&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;&lt;strong&gt;Compensation:&lt;/strong&gt; The US base salary range for this full-time position is $140,000-$200,000 + bonus + equity depending on experience&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Think you’re a good fit for this job?&amp;nbsp; &amp;nbsp; &amp;nbsp; &amp;nbsp; &amp;nbsp; &amp;nbsp; &amp;nbsp; &amp;nbsp; &amp;nbsp;&amp;nbsp;&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;Tell us more about yourself and why you&#39;re interested in the role when you apply. &lt;br&gt;And don’t forget to include links to your portfolio and LinkedIn.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Not looking but know someone who would make a great fit?&amp;nbsp;&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;Refer them!&amp;nbsp;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Speechify is committed to a diverse and inclusive workplace.&amp;nbsp;&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;Speechify does not discriminate on the basis of race, national origin, gender, gender identity, sexual orientation, protected veteran status, disability, age, or other legally protected status.&lt;/p&gt;","tags":"[\"typescript\",\"legal\"]","pubDate":"2025-05-05T21:09:02.000Z","link":"https://job-boards.greenhouse.io/speechify/jobs/5527873004","slug":"software-engineer-web-core-product-chrome-extension-speechify-1597"},{"id":8252479603,"title":"Developer Relations Engineer","company":"Clerk","image":"https://avatars.githubusercontent.com/u/49538330?s=200&v=4","description":"<h2>About the role</h2><p style=\"min-height:1.5em\">As a member of Developer Relations, you will be tasked with building experiments that drive growth for Clerk by creating content and engaging with the community. Combining your engineering expertise with strong technical content skills, you'll build our organic presence through various forms of content, from explanations of Clerk to thought pieces on industry topics.</p><p style=\"min-height:1.5em\"></p><h2>What you will do</h2><ul style=\"min-height:1.5em\"><li><p style=\"min-height:1.5em\"><strong>Creating developer-first content that drives acquisition:</strong> Create engaging, technically-accurate content that helps developers understand and implement Clerk. This includes fostering existing content hubs (Our blog, YouTube channel, GitHub repo, socials) and exploring new opportunities.</p></li><li><p style=\"min-height:1.5em\"><strong>Building interactive demonstrations:</strong> Develop working code examples and interactive demos that accompany the content you create, allowing developers to see Clerk's features in action. This includes maintaining technical accuracy while ensuring content is accessible to developers of varying experience levels.</p></li><li><p style=\"min-height:1.5em\"><strong>Contributing to content strategy:</strong> Own content strategy end-to-end.</p><ul style=\"min-height:1.5em\"><li><p style=\"min-height:1.5em\">Research and identify high-impact technical topics that resonate with our developer audience.</p></li><li><p style=\"min-height:1.5em\">Ensure all content serves the developer journey from exploration to implementation.</p></li><li><p style=\"min-height:1.5em\">Produce content independently or in collaboration with other teams.</p></li><li><p style=\"min-height:1.5em\">Own the strategy of repurposing content across multiple content mediums.</p></li><li><p style=\"min-height:1.5em\">Measure the quantifiable impact of each content initiative to Clerk’s growth.</p></li></ul></li><li><p style=\"min-height:1.5em\"><strong>Collaborating across teams:</strong> Work closely with Product, Design, and Growth teams to align content with product updates, technical insights, and growth initiatives.</p></li></ul><h2>Who you are</h2><ul style=\"min-height:1.5em\"><li><p style=\"min-height:1.5em\"><strong>You code and create content:</strong> You have strong frontend development experience, particularly with React and Next.js, combined with a proven track record of creating engaging technical content. Your portfolio demonstrates clear, accessible explanations of complex concepts across our core content mediums (written, video, code examples, social).</p></li><li><p style=\"min-height:1.5em\"><strong>You understand developers:</strong> You have experience creating content for developer audiences and understand their needs, challenges, where they live on the internet, and how they consume content. You can break down complex technical concepts into understandable components while maintaining technical depth.</p></li><li><p style=\"min-height:1.5em\"><strong>You have a high quality bar</strong>: You recognize that, while it is important to work efficiently and quickly ship content, the purpose of doing so is to build Clerk’s reputation as well as your own. This means that you refuse to publish anything that isn’t a polished explanation of the point you’re making.</p></li><li><p style=\"min-height:1.5em\"><strong>You're data-driven:</strong> You use data signals and community feedback to guide content decisions while maintaining high standards for technical accuracy and depth. You understand principles of each content environment, being well-versed in what success looks like and how to optimize blog posts, YouTube videos, GitHub repositories, social posts, dev-to-dev interactions for reach and conversion.</p></li><li><p style=\"min-height:1.5em\"><strong>You're self-directed:</strong> You create and manage a content pipeline independently, prioritize effectively, and collaborate with a remote team. You're proactive in identifying valuable content opportunities and following through from ideation to publication.</p></li></ul><h2>What Clerk has to offer</h2><ul style=\"min-height:1.5em\"><li><p style=\"min-height:1.5em\"><strong>Competitive salary</strong> – We want you to know that we value the skills and experience you bring to the table. We go out of our way to make sure that you feel fairly compensated.</p></li><li><p style=\"min-height:1.5em\"><strong>Equity ownership</strong> – At Clerk, we believe in shared success. That's why we offer a stock option plan so that everyone can benefit from the growth and prosperity of the company.</p></li><li><p style=\"min-height:1.5em\"><strong>Health coverage</strong> – We care about your well-being. That's why we offer top-tier health insurance to ensure that your health needs are fully met.</p></li><li><p style=\"min-height:1.5em\"><strong>Work gear</strong> - Set up your ideal home office with the gear of your choice. At Clerk, we want to ensure that you have everything you need to perform at your best.</p></li><li><p style=\"min-height:1.5em\"><strong>Flexible vacation policy</strong> – We believe in work-life balance and trust you to take the time you need. Although we recommend 25 days per year, our vacation policy is unlimited. This is in addition to observing national holidays specific to your country of residence.</p></li><li><p style=\"min-height:1.5em\"><strong>Diverse and inclusive team</strong> – Join our exceptional, diverse, and globally distributed team at Clerk. We are committed to fostering an inclusive environment where everyone can contribute their best in building impactful products and tools for the modern web.</p></li></ul>","tags":"[\"engineering\"]","pubDate":"2025-05-05T20:54:27.673Z","link":"https://jobs.ashbyhq.com/clerk/5e899b61-1dcc-4c8e-83af-5e67d8ec1387","slug":"developer-relations-engineer-clerk-853"},{"id":8787986273,"title":"Developer Advocate - based in San Francisco, CA [IC2]","company":"Sourcegraph","image":"https://avatars.githubusercontent.com/u/3979584?s=200&v=4","description":"&lt;div class=&quot;content-intro&quot;&gt;&lt;h2&gt;&lt;span style=&quot;color: rgb(243, 78, 63);&quot;&gt;&lt;strong&gt;Who we are&lt;/strong&gt;&lt;/span&gt;&lt;/h2&gt;\n&lt;p&gt;Our mission at Sourcegraph is to make it so that &lt;a href=&quot;https://www.notion.so/sourcegraph/Mission-values-e9d37e6b972a4ef395c3076aea2bd07d?pvs=4&quot;&gt;everyone can code&lt;/a&gt;, not just ~0.1% of the population.&amp;nbsp;&lt;/p&gt;\n&lt;p&gt;We are transforming how the world’s most important companies build software by industrializing development with AI. Today, most professional developers spend a disproportionate amount of time understanding code and performing repetitive, low-level tasks—leaving less time for innovation and meaningful impact.&lt;/p&gt;\n&lt;p&gt;We’re changing that. Sourcegraph brings AI-powered search and agents to the enterprise, helping teams automate the mundane and amplify what developers do best— solving hard problems and creating great products.&lt;/p&gt;\n&lt;p&gt;Here’s how we’re making a difference:&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;&lt;strong&gt;Accelerating developers &lt;/strong&gt;with AI agents that deliver insights and precision—enabling 5x faster test creation, 30% increase in merge requests, and saving 20 minutes per developer daily.&lt;/li&gt;\n&lt;li&gt;&lt;strong&gt;Automating repetitive tasks,&lt;/strong&gt; from remediating vulnerabilities (saving teams 1,000+ hours annually) to speeding up migrations that would take years to months.&amp;nbsp;&lt;/li&gt;\n&lt;li&gt;&lt;strong&gt;Enabling innovation&lt;/strong&gt; by addressing complex problems like automated bug triage, vulnerability detection, and AI-driven code reviews seamlessly integrated into workflows.&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;Trusted by 7/10 top software companies by market cap, 4/6 top US banks and many of the companies leading global innovation, like Stripe, Indeed, Tesla, and 1Password, and with $225M in funding from investors like &lt;a href=&quot;https://techcrunch.com/2021/07/13/sourcegraph-raises-125m-series-d-on-2-6b-valuation-for-universal-code-search-tool/&quot;&gt;a16z&lt;/a&gt;, &lt;a href=&quot;https://about.sourcegraph.com/blog/series-c-with-sequoia/&quot;&gt;Sequoia&lt;/a&gt;, and &lt;a href=&quot;https://www.redpoint.com/companies/sourcegraph/&quot;&gt;Redpoint&lt;/a&gt;, we are building the tools that will define the next era of enterprise software development.&lt;/p&gt;\n&lt;p&gt;If you’re passionate about solving the hardest problems in software and shaping the future of technology, join us. Let’s build something extraordinary together.&lt;/p&gt;&lt;/div&gt;&lt;h2&gt;&lt;span style=&quot;color: rgb(243, 78, 63);&quot;&gt;&lt;strong&gt;Working hours&lt;/strong&gt;&lt;/span&gt;&lt;/h2&gt;\n&lt;p&gt;🌎 The ideal candidate for this role will reside in San Francisco, California. Regular attendance at weekly Developer and AI events in the city is an essential aspect of this position.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Required locations:&lt;/strong&gt;&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;&amp;nbsp;San Francisco, California&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;We do not subscribe to “I do my best work when I work 40 hours a week.” &amp;nbsp;People we hire at Sourcegraph believe that building outstanding things means working very hard — smarter and more hours than the competition.&lt;/p&gt;\n&lt;h2&gt;&lt;span style=&quot;color: rgb(243, 78, 63);&quot;&gt;&lt;strong&gt;Why this job is exciting&lt;/strong&gt;&lt;/span&gt;&lt;/h2&gt;\n&lt;p&gt;As a Developer Advocate at Sourcegraph, you will be a champion for how developers understand and navigate complex codebases using our platform. You&#39;ll be connecting with the developer community and sharing the value of our AI Code Assistant and Code Search platform through written, video, and live engagements. You&#39;ll be part of a small but impactful team, representing Sourcegraph and its commitment to improving the developer experience. You&#39;ll have the opportunity to help developers at the most successful and sophisticated companies in the world (our customers) implement and scale code AI capabilities. We&#39;re looking for someone passionate about driving adoption and empowering engineers through creative story telling and genuine community building.&lt;/p&gt;\n&lt;p&gt;As a Developer Advocate, you will spend 25% of your time engaging with Developers at events in-person and 75% of your time creating content and recording videos.&lt;/p&gt;\n&lt;h2&gt;&lt;span style=&quot;color: rgb(243, 78, 63);&quot;&gt;&lt;strong&gt;Job responsibilities&lt;/strong&gt;&lt;/span&gt;&lt;/h2&gt;\n&lt;ul&gt;\n&lt;li&gt;Attend and host 2-5 meet-ups and events in San Francisco monthly&lt;/li&gt;\n&lt;li&gt;Represent our user community within Sourcegraph&lt;/li&gt;\n&lt;li&gt;Build apps with Sourcegraph in public&lt;/li&gt;\n&lt;li&gt;Build integrations on top of Sourcegraph (such as teaching Sourcegraph how to use and gather information from other dev tools, including logging, perf, etc., tools)&lt;/li&gt;\n&lt;li&gt;Livestream and record demos of what you build, for Twitter, YouTube, Twitch, etc.&lt;/li&gt;\n&lt;li&gt;Be an incredibly helpful and inspirational member of our dev community yourself and help grow it&lt;/li&gt;\n&lt;li&gt;Write awesome technical blog posts&lt;/li&gt;\n&lt;li&gt;Promote Sourcegraph on social media&lt;/li&gt;\n&lt;li&gt;Help connect our user community growth to our product-led growth engine&lt;/li&gt;\n&lt;li&gt;Overall, help define what dev advocacy means at Sourcegraph&lt;/li&gt;\n&lt;/ul&gt;\n&lt;h2&gt;&lt;span style=&quot;color: rgb(243, 78, 63);&quot;&gt;&lt;strong&gt;Skills and experience&lt;/strong&gt;&lt;/span&gt;&lt;/h2&gt;\n&lt;p&gt;Your skill-set:&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;You are intrinsically motivated by Sourcegraph’s mission.&amp;nbsp;&lt;/li&gt;\n&lt;li&gt;Experience as a software engineer or prolific coding&lt;/li&gt;\n&lt;li&gt;TypeScript, JavaScript, and/or Go skills Able to communicate technical concepts in a simple and engaging way&lt;/li&gt;\n&lt;li&gt;Experience creating high-quality technical writing and videos&lt;/li&gt;\n&lt;li&gt;Experience working in a high-agency environment that requires ownership&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;&amp;nbsp;Bonus Points:&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;You’ve established a strong following on social media platforms&lt;/li&gt;\n&lt;/ul&gt;\n&lt;h2&gt;&lt;span style=&quot;color: rgb(243, 78, 63);&quot;&gt;&lt;strong&gt;Level&lt;/strong&gt;&lt;/span&gt;&lt;/h2&gt;\n&lt;p&gt;This job is an IC2.&amp;nbsp; You can read more about &lt;a href=&quot;https://handbook.sourcegraph.com/benefits-pay-perks/pay-expenses/compensation/leveling-guide/&quot;&gt;our job leveling philosophy&lt;/a&gt; in our Handbook.&lt;/p&gt;\n&lt;h2&gt;&lt;span style=&quot;color: rgb(243, 78, 63);&quot;&gt;&lt;strong&gt;Compensation&lt;/strong&gt;&lt;/span&gt;&lt;/h2&gt;\n&lt;p&gt;&lt;strong&gt;💸 We pay you an above-average salary&lt;/strong&gt; because we want to hire the best people who are fully focused on helping Sourcegraph succeed, not worried about paying bills. As an &lt;a href=&quot;https://handbook.sourcegraph.com/company-info-and-process/values/#sts=Open%20and%20transparent&quot;&gt;open and transparent&lt;/a&gt; company that values competitive compensation, our &lt;a href=&quot;https://handbook.sourcegraph.com/benefits-pay-perks/pay-expenses/compensation/&quot;&gt;compensation ranges are visible&lt;/a&gt; to every single Sourcegraph teammate. To determine your salary, we use a number of market and data-driven salary sources, along with your location zone, and target the high-end of the range to ensure we’re always paying above market regardless of where you live in the world.&amp;nbsp;&amp;nbsp;&lt;/p&gt;\n&lt;p&gt;💰 The target compensation for this role is: (depending on level &amp;amp; location).&amp;nbsp;&amp;nbsp;&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;IC2 / Zone 1: $140,000&lt;/li&gt;\n&lt;li&gt;IC2 / Zone 2: $112,000&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;📈 In addition to our cash compensation, we offer equity (because when we succeed as a company, we want you to succeed, too) and generous &lt;a href=&quot;https://handbook.sourcegraph.com/benefits-pay-perks/benefits-perks/&quot;&gt;perks &amp;amp; benefits&lt;/a&gt;.&lt;/p&gt;\n&lt;h2&gt;&lt;span style=&quot;color: rgb(243, 78, 63);&quot;&gt;&lt;strong&gt;Interview process&amp;nbsp;&lt;/strong&gt;&lt;/span&gt;&lt;/h2&gt;\n&lt;p&gt;&lt;em&gt;&lt;span style=&quot;font-weight: 400;&quot;&gt;Below is the interview process you can expect for this role (you can read more about &lt;/span&gt;&lt;/em&gt;&lt;a href=&quot;https://handbook.sourcegraph.com/talent/types_of_interviews&quot;&gt;&lt;em&gt;&lt;span style=&quot;font-weight: 400;&quot;&gt;the types of interviews&lt;/span&gt;&lt;/em&gt;&lt;/a&gt;&lt;em&gt;&lt;span style=&quot;font-weight: 400;&quot;&gt; in our Handbook). It may look like a lot of steps, but rest assured that we move quickly and the steps are designed to help you get the information needed to determine if we’re the right fit for you… Interviewing is a two-way street, after all!&amp;nbsp;&lt;/span&gt;&lt;/em&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span style=&quot;font-weight: 400;&quot;&gt;We expect the interview process to take 4.5&lt;/span&gt;&lt;span style=&quot;font-weight: 400;&quot;&gt;&amp;nbsp;&lt;/span&gt;&lt;span style=&quot;font-weight: 400;&quot;&gt;hours in total.&lt;/span&gt;&lt;span style=&quot;font-weight: 400;&quot;&gt;&amp;nbsp;&lt;/span&gt;&lt;span style=&quot;font-weight: 400;&quot;&gt;&lt;br&gt;&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;👋 Introduction Stage&lt;/strong&gt;&lt;span style=&quot;font-weight: 400;&quot;&gt; - we have initial conversations to get to know you better…&lt;/span&gt;&lt;/p&gt;\n&lt;ul&gt;\n&lt;li style=&quot;font-weight: 400;&quot;&gt;&lt;span style=&quot;font-weight: 400;&quot;&gt;[30m] &lt;/span&gt;&lt;a href=&quot;https://handbook.sourcegraph.com/departments/people-talent/talent/process/types_of_interviews/#recruiter-screen&quot;&gt;&lt;span style=&quot;font-weight: 400;&quot;&gt;Recruiter Screen&lt;/span&gt;&lt;/a&gt;&lt;span style=&quot;font-weight: 400;&quot;&gt; with Kelsey Nagel&lt;/span&gt;&lt;/li&gt;\n&lt;li style=&quot;font-weight: 400;&quot;&gt;&lt;span style=&quot;font-weight: 400;&quot;&gt;[60m] &lt;/span&gt;&lt;a href=&quot;https://handbook.sourcegraph.com/departments/people-talent/talent/process/types_of_interviews/#hiring-manager-screen&quot;&gt;&lt;span style=&quot;font-weight: 400;&quot;&gt;Hiring Manager Screen&lt;/span&gt;&lt;/a&gt; / &lt;a href=&quot;https://handbook.sourcegraph.com/departments/people-talent/talent/process/types_of_interviews/#resume-deep-dive&quot;&gt;&lt;span style=&quot;font-weight: 400;&quot;&gt;Resume Deep Dive&lt;/span&gt;&lt;/a&gt;&amp;nbsp;with Ado Kukic&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;&lt;strong&gt;🧑‍💻 Team Interview Stage&lt;/strong&gt;&lt;span style=&quot;font-weight: 400;&quot;&gt; - we then delve into your experience in more depth and introduce you to members of the team…&lt;/span&gt;&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;[45m]&amp;nbsp;&lt;a href=&quot;https://about.sourcegraph.com/handbook/talent/types_of_interviews#cross-functional-team-collaboration-interview&quot;&gt;Cross-functional team collaboration&lt;/a&gt;&amp;nbsp;&lt;/li&gt;\n&lt;li&gt;[60m]&amp;nbsp;&lt;a href=&quot;https://handbook.sourcegraph.com/departments/people-talent/talent/process/types_of_interviews/#developer-relations-working-session&quot;&gt;Working Session&lt;/a&gt;&amp;nbsp;&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;&lt;strong&gt;🎉 Final Interview Stage &lt;/strong&gt;&lt;span style=&quot;font-weight: 400;&quot;&gt;- we move you to our final round, where you meet cross-functional partners and gain a better understanding of our business and values holistically…&lt;/span&gt;&lt;/p&gt;\n&lt;ul&gt;\n&lt;li style=&quot;font-weight: 400;&quot;&gt;&lt;span style=&quot;font-weight: 400;&quot;&gt;[30m] &lt;/span&gt;&lt;a href=&quot;https://handbook.sourcegraph.com/departments/people-talent/talent/process/types_of_interviews/#values-interview&quot;&gt;&lt;span style=&quot;font-weight: 400;&quot;&gt;Values Interview&lt;/span&gt;&lt;/a&gt;&lt;/li&gt;\n&lt;li style=&quot;font-weight: 400;&quot;&gt;&lt;span style=&quot;font-weight: 400;&quot;&gt;[30m] &lt;/span&gt;&lt;a href=&quot;https://handbook.sourcegraph.com/departments/people-talent/talent/process/types_of_interviews/#leadership-interview&quot;&gt;&lt;span style=&quot;font-weight: 400;&quot;&gt;Leadership Interview&lt;/span&gt;&lt;/a&gt;&lt;span style=&quot;font-weight: 400;&quot;&gt; with Quinn Slack or Beyang Liu&amp;nbsp;&lt;/span&gt;&lt;/li&gt;\n&lt;li style=&quot;font-weight: 400;&quot;&gt;&lt;span style=&quot;font-weight: 400;&quot;&gt;We check references and conduct your background check&lt;/span&gt;&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;&lt;span style=&quot;font-weight: 400;&quot;&gt;Please note - you are welcome to request additional conversations with anyone you would like to meet, but didn’t get to meet during the interview process. You can learn more about the team&amp;nbsp;&lt;a href=&quot;https://handbook.sourcegraph.com/team/&quot;&gt;here&lt;/a&gt;.&amp;nbsp;&lt;/span&gt;&lt;/p&gt;&lt;div class=&quot;content-conclusion&quot;&gt;&lt;h2&gt;&lt;span style=&quot;color: rgb(243, 78, 63);&quot;&gt;&lt;strong&gt;Learn more about us&lt;/strong&gt;&lt;/span&gt;&lt;/h2&gt;\n&lt;p&gt;You can learn more about what it is like to work at Sourcegraph by reading &lt;a href=&quot;https://sourcegraph.notion.site/d7614e3e9dc04c09ac2d42d57f1816e6?v=2a6d426dbae14390b155120b0c029ce0&quot;&gt;our handbook&lt;/a&gt;.&lt;/p&gt;\n&lt;p&gt;We are an ambitious team who are collectively working hard to build the most influential company in the world.&amp;nbsp; You can read more about our &lt;a href=&quot;https://sourcegraph.notion.site/What-it-s-like-working-at-Sourcegraph-119a8e11265880b18911eee4d9b7c460#119a8e1126588062b935fc66104b6115&quot;&gt;culture&lt;/a&gt;, &lt;a href=&quot;https://sourcegraph.notion.site/Compensation-Pay-Transparency-at-Sourcegraph-d58d0774f51b4b489d41c3628d30ff8d?pvs=74&quot;&gt;competitive compensation&lt;/a&gt; and &lt;a href=&quot;https://sourcegraph.notion.site/Benefits-Perks-dd1da4b6b3a64780abed010a144d34ba?pvs=74&quot;&gt;benefits&lt;/a&gt; here.&lt;/p&gt;\n&lt;p&gt;Sourcegraph is an equal opportunity workplace; we welcome people from all backgrounds.&amp;nbsp;&lt;/p&gt;\n&lt;p&gt;&lt;em&gt;Sourcegraph participates in &lt;/em&gt;&lt;a href=&quot;https://sourcegraph.notion.site/E-Verify-2ab3286dde3446d6bac2898c83610107&quot;&gt;&lt;em&gt;E-Verify&lt;/em&gt;&lt;/a&gt;&lt;em&gt; for U.S. Employees. &lt;/em&gt;&lt;/p&gt;&lt;/div&gt;","tags":"[\"javascript\",\"typescript\"]","pubDate":"2025-05-05T19:55:31.000Z","link":"https://job-boards.greenhouse.io/sourcegraph91/jobs/5532129004","slug":"developer-advocate-based-in-san-francisco-ca-ic2-sourcegraph-946"},{"id":5782450882,"title":"Growth Engineer","company":"Instrumentl","image":"https://avatars.githubusercontent.com/u/43759528?s=200&v=4","description":"<div><b style=\"font-size: 18px\">Hello, we’re Instrumentl.</b></div><div><br></div><div><span style=\"font-size: 16px\">We’re a mission-driven startup helping the nonprofit sector to drive impact, and we’re well on our way to becoming the</span><b style=\"font-size: 16px\"> #1</b><span style=\"font-size: 16px\"> most-loved grant discovery and management tool. To help us get there, we’re hiring a </span><b style=\"font-size: 16px\">Growth Engineer</b><span style=\"font-size: 16px\"> to design experiments and implement features that drive user acquisition, activation, retention, and engagement.</span></div><div><br></div><div><b style=\"font-size: 18px\">About us:</b></div><div><br></div><div><a class=\"postings-link\" style=\"font-size: 12pt\" href=\"https://www.instrumentl.com/\">Instrumentl</a><span style=\"font-size: 12pt\"> is a hypergrowth YC-backed startup with over 4,000 nonprofit clients, from local homeless shelters to larger organizations like the San Diego Zoo and the University of Alaska. We are building the future of fundraising automation, helping nonprofits to discover, track, and manage grants efficiently through our SaaS platform. </span><span style=\"font-size: 16px\">Since 2015, our customers have used Instrumentl to find, win, and manage over $6.7 billion in grant funding.&nbsp;</span></div><div><br></div><div><span style=\"font-size: 12pt\">Our charts are dramatically up-and-to-the-right 📈 — we’re cash flow positive and doubling year-over-year, with customers who love us (NPS is 65+ and Ellis PMF survey is 60+). Join us on this rocket ship!</span></div><div><br></div><div><b style=\"font-size: 18px\">About the role:</b></div><div><br></div><div><span style=\"font-size: 16px\">As a Growth Engineer at Instrumentl, you’ll collaborate closely with our Product, Marketing, Design, and Data teams, playing a pivotal role in accelerating our company’s expansion through rapid iteration and data-driven decision-making. Get to know us at <a href=\"http://instrumentl.com/about\">instrumentl.com/about</a>!</span></div><div><br></div><div><span style=\"font-size: 16px\">Our ideal candidate is eager to learn, willing to experiment, and excited to empower both teammates and customers to accelerate social progress and propel innovation.</span></div><div><br></div><div><span style=\"font-size: 16px\">The Instrumentl team is fully distributed (though if you’d like to work from our Oakland office, we would love to see you there). For this position, we are looking for someone who has significant overlap with Pacific Time Zone working hours.</span></div><div><br></div><div><b style=\"font-size: 18px\">Hello, we’re Instrumentl.</b></div><div><br></div><div><span style=\"font-size: 16px\">We’re a mission-driven startup helping the nonprofit sector to drive impact, and we’re well on our way to becoming the</span><b style=\"font-size: 16px\"> #1</b><span style=\"font-size: 16px\"> most-loved grant discovery and management tool. To help us get there, we’re hiring a </span><b style=\"font-size: 16px\">Growth Engineer</b><span style=\"font-size: 16px\"> to design experiments and implement features that drive user acquisition, activation, retention, and engagement.</span></div><div><br></div><div><b style=\"font-size: 18px\">About us:</b></div><div><br></div><div><a href=\"https://www.instrumentl.com/\" style=\"font-size: 12pt\" class=\"postings-link\">Instrumentl</a><span style=\"font-size: 12pt\"> is a hypergrowth YC-backed startup with over 4,000 nonprofit clients, from local homeless shelters to larger organizations like the San Diego Zoo and the University of Alaska. We are building the future of fundraising automation, helping nonprofits to discover, track, and manage grants efficiently through our SaaS platform. </span><span style=\"font-size: 16px\">Since 2015, our customers have used Instrumentl to find, win, and manage over $6.7 billion in grant funding.&nbsp;</span></div><div><br></div><div><span style=\"font-size: 12pt\">Our charts are dramatically up-and-to-the-right 📈 — we’re cash flow positive and doubling year-over-year, with customers who love us (NPS is 65+ and Ellis PMF survey is 60+). Join us on this rocket ship!</span></div><div><br></div><div><b style=\"font-size: 18px\">About the role:</b></div><div><br></div><div><span style=\"font-size: 16px\">As a Growth Engineer at Instrumentl, you’ll collaborate closely with our Product, Marketing, Design, and Data teams, playing a pivotal role in accelerating our company’s expansion through rapid iteration and data-driven decision-making. Get to know us at <a href=\"http://instrumentl.com/about\">instrumentl.com/about</a>!</span></div><div><br></div><div><span style=\"font-size: 16px\">Our ideal candidate is eager to learn, willing to experiment, and excited to empower both teammates and customers to accelerate social progress and propel innovation.</span></div><div><br></div><div><span style=\"font-size: 16px\">The Instrumentl team is fully distributed (though if you’d like to work from our Oakland office, we would love to see you there). For this position, we are looking for someone who has significant overlap with Pacific Time Zone working hours.</span></div><div><br></div><h3>What you'll do:</h3><li>Design, build, and deploy experiments and features, using Ruby on Rails to enhance user experiences and drive key growth metrics.</li><li>Work side by side with our Product, Marketing, Design, and Data teams to ensure that our best-in-class product retains its crown.&nbsp;</li><li>Maintain and improve our growth experimentation platform, ensuring robust and reliable experiment tracking and analysis.</li><li>Implement and analyze A/B tests to validate hypotheses and inform product decisions.</li><li>Own problems from end to end, managing complexity and engaging directly with stakeholders to develop short-term and long-term solutions.</li><li>Apply a product-focused mindset, balancing speed, quality, and user experience in all deliverables.</li><li>Uphold Instrumentl’s high standards for product quality and mentor newer team members to do the same.</li><h3>What we're looking for: </h3><li><b>Experienced:</b> you’ve been a software engineer for 3+ years, with a strong emphasis on Ruby on Rails development. Startup experience and comfort operating in fast, scrappy environments is a huge plus!</li><li><b>Technically adaptable:</b> you’re familiar with front-end technologies (HTML, CSS, JavaScript) and their integration with Rails applications, and you’re open to learning new tools or frameworks to move faster and build better.</li><li><b>Customer-focused: </b>you take pride in delivering exceptional user experiences—from first touch to deep engagement—and love being part of projects that help users quickly realize value.&nbsp;</li><li><b>Collaborative: </b>you thrive in a cross-functional environment involving product managers, designers, marketers, and data analysts, and you value the unique perspective each person brings to the table.</li><li><b>Experimental:</b> You’re comfortable with rapid iteration, feature flagging, and A/B testing. You have experience (or are excited by the idea of) running experiments at different points in the funnel - from onboarding to activation - and using those results to drive decisions.</li><li><b>Highly analytical:</b> you approach problem-solving with a data-first mindset and can readily interpret experiment results, behavioral analytics, and product telemetry to guide next steps.</li><li><b>Hungry:</b> you’re on a mission to make an impact. You’re motivated by fast learning cycles, continuous improvement, and seeing your work move the needle.</li><li><b>Results-Driven: </b>you’ve demonstrated the ability to ship value in fast-paced environments and are energized by getting things out the door and into users’ hands.</li><li><b>Passionate: </b>you’re excited about Instrumentl’s mission to propel nonprofits into a bigger, brighter future—and you’re particularly energized by our early bets on AI and LLM-powered experiences to help users onboard and find value faster.</li><h3>Bonus points: </h3><li>Experience working on growth-focused teams or in growth engineering roles.</li><li>Proficiency with analytics tools (e.g., Amplitude, Segment, Mixpanel) and languages like SQL.</li><li>Familiarity with product-led growth (PLG) principles and how they apply across onboarding, activation, and engagement.</li><li>Experience with email marketing tools, SEO, or other acquisition/retention channels.</li><li>Knowledge of Tailwind and/or the Hotwire stack.</li><li>Familiarity or hands-on experience with building or integrating LLM-powered features to support user onboarding, product education, or self-service flows.</li><h3>Compensation and Benefits: </h3><li>Salary ranges are based on market data, relative to our size, industry, and stage of growth. Salary is one part of total compensation, which also includes equity, perks, and competitive benefits.&nbsp;</li><li>For US-based candidates, our target salary band is <b>$120,000 - $160,000/year + equity. </b>Salary decisions will be based on multiple factors including geographic location, qualifications for the role, skillset, proficiency, and experience level.&nbsp;</li><li>100% covered health, dental, and vision insurance for employees, 50% for dependents</li><li>Generous PTO policy, including parental leave</li><li>401(k)</li><li>Company laptop + stipend to set up your home workstation</li><li>Company retreats for in-person time with your colleagues</li><li>Work with awesome nonprofits around the US. We partner with incredible organizations doing meaningful work, and you get to help power their success.</li><div><b style=\"font-size: 18px\">What to expect:</b></div><div><br></div><div><span style=\"font-size: 16px\">Instrumentl is evolving rapidly. You’ll always have new challenges and opportunities to grow in your role - you won’t be bored! You’ll be an early member of our small but mighty team, playing a huge part in shaping our culture for the years and teammates to come.</span></div><div><br></div><div><b style=\"font-size: 16px\">At Instrumentl:</b></div><div><br></div><div><b style=\"font-size: 16px\">- We’re customer-focused. </b><span style=\"font-size: 16px\">We routinely seek feedback from our customers to improve the Instrumentl experience for everyone. Our first company value is \"The customer is the hero\" and we mean it.</span></div><div><b style=\"font-size: 16px\">- We love to experiment. </b><span style=\"font-size: 16px\">We are constantly generating new concepts and iterating to see what works - ideation and experimentation are essential here. \"Bend the curve\" is another key company value.</span></div><div><b style=\"font-size: 16px\">- We appreciate authenticity. </b><span style=\"font-size: 16px\">We have a diverse range of life experiences, and we encourage open, clear communication with each other about the things that matter most to us.</span></div><div><b style=\"font-size: 16px\">- We’re approachable and collaborative.</b><span style=\"font-size: 16px\"> Everyone has a voice, and we’re all building Instrumentl together.</span></div><div><b style=\"font-size: 16px\">- We kick it every day with some of the nicest people in the world.</b><span style=\"font-size: 16px\"> No joke, our customers are often on the front lines educating kids, saving endangered species, and restoring watersheds. In helping them take advantage of Instrumentl’s technology, you’re helping them move the world forward.</span></div><div><br></div><div><b style=\"font-size: 18px\">Ready to apply?</b></div><div><br></div><div><span style=\"font-size: 16px\">Please submit a written response addressing the prompts below:</span></div><div><br></div><div><span style=\"font-size: 16px\"><b>1. Why are you interested in Instrumentl?</b></span></div><div><span style=\"font-size: 16px\"><b>2. What makes you a good fit for the Growth Engineer role? </b></span></div><div><br></div><div><span style=\"font-size: 16px\">Don't forget to include the word </span><b style=\"font-size: 16px\">moxie </b><span style=\"font-size: 16px\">in your application to show you read this from start to finish! Along with your written response, please attach your CV or resume.</span></div><div><br></div><div><i style=\"font-size: 16px\">At Instrumentl, we pride ourselves on building a diverse team from the ground up. Every role is an opportunity to teach, learn, and create some of your best work - if you’re excited to grow along with us, we encourage you to apply!</i></div>","tags":"[\"javascript\",\"management\",\"engineering\"]","pubDate":"2025-05-05T19:49:11.192Z","link":"https://jobs.lever.co/Instrumentl/fbb37ac1-972f-4a42-84d0-eab210856ff2","slug":"growth-engineer-instrumentl-2396"},{"id":5625878672,"title":"HR Operations Manager","company":"Winona","image":"https://yt3.googleusercontent.com/k45HnnNMWgPv-xF3D-u2ThxmesDOeU0p02rNJpbRWLes2Z18WpkLgXEE7XuBLkkzN_38AFnp3A=s160-c-k-c0x00ffffff-no-rj","description":"<p style=\"min-height:1.5em\"><strong>About Winona:</strong></p><p style=\"min-height:1.5em\"><a target=\"_blank\" rel=\"noopener noreferrer nofollow\" href=\"https://bywinona.com\">Winona</a> is one of the leading telemedicine companies providing HRT for women in menopause. We’ve built all of our technology in house including an EHR, patient care admin system, patient portal, website, marketing technology etc. Winona has two compounding pharmacies and a team of in house physicians providing world-class care via a fully vertically integrated business model.</p><p style=\"min-height:1.5em\"></p><p style=\"min-height:1.5em\"><strong>About the role:</strong></p><p style=\"min-height:1.5em\">We are looking for a proactive and adaptable <strong>HR</strong> <strong>Operations Manager</strong> to join our fast-growing team. This role requires a well-rounded professional with a strong background in human resources and operations. The ideal candidate will be an excellent multi-tasker with a sharp eye for detail and a passion for fostering a positive and engaging employee experience.</p><p style=\"min-height:1.5em\"></p><p style=\"min-height:1.5em\"><strong>Seniority Level: </strong>Senior Level </p><p style=\"min-height:1.5em\"></p><p style=\"min-height:1.5em\"><strong>Responsibilities:</strong></p><p style=\"min-height:1.5em\"><strong>Human Resources:</strong></p><p style=\"min-height:1.5em\">Manage the full employee lifecycle, including onboarding, offboarding, and ongoing employee relations.</p><ul style=\"min-height:1.5em\"><li><p style=\"min-height:1.5em\">Process international payroll, benefits administration, and time and attendance, ensuring timely and accurate processing.</p></li><li><p style=\"min-height:1.5em\">Maintain accurate employee records and ensure compliance with local and international employment laws and regulations.</p></li><li><p style=\"min-height:1.5em\">Provide continuous support and guidance to employees regarding HR policies, procedures, and benefits.</p></li><li><p style=\"min-height:1.5em\">Coordinate training and development programs, fostering a growth-oriented and constantly improving environment.</p></li><li><p style=\"min-height:1.5em\">Facilitate performance reviews and goal-setting processes, ensuring effective feedback mechanisms are in place.</p></li></ul><p style=\"min-height:1.5em\"><strong>Operations:</strong></p><ul style=\"min-height:1.5em\"><li><p style=\"min-height:1.5em\">Manage vendor relationships and oversee vendor payments, ensuring smooth and efficient workflows.</p></li><li><p style=\"min-height:1.5em\">Plan and coordinate all-hands meetings and other company events, creating opportunities for interaction across all organizational levels.</p></li><li><p style=\"min-height:1.5em\">Oversee operational tasks, ensuring the efficient functioning of the organization and collaborating with other departments to address urgent needs.</p></li><li><p style=\"min-height:1.5em\">Collaborate in improving and optimizing internal operational processes and implementing new strategies to enhance organizational efficiency.</p><p style=\"min-height:1.5em\"></p></li></ul><p style=\"min-height:1.5em\"><strong>Requirements:</strong></p><ul style=\"min-height:1.5em\"><li><p style=\"min-height:1.5em\">Bachelor's degree in Human Resources, Business Administration, or related field.</p></li><li><p style=\"min-height:1.5em\">Ideally, a minimum of 3+ years of experience in human resources or operations roles in a high-growth environment.</p></li><li><p style=\"min-height:1.5em\">Experience in international payroll administration.</p></li><li><p style=\"min-height:1.5em\">Knowledge of U.S. employment laws and regulations, including tax compliance, labor laws, and benefits administration, ensuring full compliance and minimizing legal risks.</p></li><li><p style=\"min-height:1.5em\">Experience managing vendor relationships and payments.</p></li><li><p style=\"min-height:1.5em\">Strong attention to detail and accuracy, with excellent organizational and time management skills.</p></li><li><p style=\"min-height:1.5em\">Ability to prioritize tasks, work independently, and maintain flexibility in a fast-paced, dynamic environment.</p></li><li><p style=\"min-height:1.5em\">Exceptional interpersonal and communication skills, with the ability to interact effectively at all organizational levels.</p></li><li><p style=\"min-height:1.5em\">Ability to maintain discretion when handling highly sensitive and confidential employee and organizational matters.</p></li><li><p style=\"min-height:1.5em\">A positive and solution-oriented attitude</p><p style=\"min-height:1.5em\"></p></li></ul><p style=\"min-height:1.5em\"><strong>Nice to have:</strong></p><ul style=\"min-height:1.5em\"><li><p style=\"min-height:1.5em\">Experience working with international remote teams, with a strong understanding of the dynamics and challenges of managing a distributed workforce.</p></li><li><p style=\"min-height:1.5em\">Experience in telemedicine or related medical contexts, particularly in managing operations within healthcare or telehealth settings.</p></li><li><p style=\"min-height:1.5em\">Familiarity with software platforms such as Gusto, Deel, Mercury, Slack, and Google Suite.</p><p style=\"min-height:1.5em\"></p></li></ul><h2><strong>What’s in it for you?</strong></h2><p style=\"min-height:1.5em\">As full-time member of our team, you’ll enjoy:</p><ul style=\"min-height:1.5em\"><li><p style=\"min-height:1.5em\">Flexible hours</p></li><li><p style=\"min-height:1.5em\">Work wherever you choose</p></li><li><p style=\"min-height:1.5em\">Fun and casual work environment</p></li><li><p style=\"min-height:1.5em\">Employee engagement activities and virtual gatherings</p></li><li><p style=\"min-height:1.5em\">We are a diverse, global team! 🌍</p></li></ul><p style=\"min-height:1.5em\"></p><p style=\"min-height:1.5em\"><em><strong>Equal Employment Opportunity</strong></em></p><p style=\"min-height:1.5em\"><em>Winona provides equal employment opportunities to all qualified individuals without regard to race, color, religion, sex, gender identity, sexual orientation, pregnancy, age, national origin, physical or mental disability, military or veteran status, genetic information, or any other protected classification. Equal employment opportunity extends to all aspects of employment including, but not limited to, recruitment, hiring, training, promotion, demotion, transfer, leaves of absence, and termination. Winona takes allegations of discrimination, harassment, and retaliation seriously and will promptly investigate such behaviors.</em></p>","tags":"[\"management\",\"legal\",\"aws\"]","pubDate":"2025-05-05T19:48:38.966Z","link":"https://jobs.ashbyhq.com/winona/a2d54412-2acf-4656-abeb-bf1b87742be1","slug":"hr-operations-manager-winona-7245"},{"id":5878691170,"title":"Video Editor","company":"Winona","image":"https://yt3.googleusercontent.com/k45HnnNMWgPv-xF3D-u2ThxmesDOeU0p02rNJpbRWLes2Z18WpkLgXEE7XuBLkkzN_38AFnp3A=s160-c-k-c0x00ffffff-no-rj","description":"<p style=\"min-height:1.5em\"><strong>About Winona:</strong></p><p style=\"min-height:1.5em\"><a target=\"_blank\" rel=\"noopener noreferrer nofollow\" href=\"https://bywinona.com\">Winona</a> is one of the leading telemedicine companies providing HRT for women in menopause. We’ve built all of our technology in house including an EHR, patient care admin system, patient portal, website, marketing technology etc. Winona has two compounding pharmacies and a team of in house physicians providing world-class care via a fully vertically integrated business model.</p><p style=\"min-height:1.5em\"></p><p style=\"min-height:1.5em\"><strong>About the role:</strong></p><p style=\"min-height:1.5em\">We’re looking to hire a full-time, remote <strong>Video Editor</strong> to join our creative team. You’ll have the opportunity to choose your hours and work and learn with a team of world-class designers, through a commitment to team collaboration, communication, and product quality.</p><p style=\"min-height:1.5em\"></p><p style=\"min-height:1.5em\"><strong>Seniority Level</strong>: Junior</p><p style=\"min-height:1.5em\"></p><p style=\"min-height:1.5em\"><strong>Responsibilities:</strong></p><ul style=\"min-height:1.5em\"><li><p style=\"min-height:1.5em\">Lead the video editing process from start to finish </p></li><li><p style=\"min-height:1.5em\">Edit and organize raw video footage </p></li><li><p style=\"min-height:1.5em\">Collaborate with other departments and teams </p></li><li><p style=\"min-height:1.5em\">Develop video concepts and storyboards </p></li><li><p style=\"min-height:1.5em\">Enhance video’s visual and audio quality</p></li><li><p style=\"min-height:1.5em\">Create and implement video style guides </p></li><li><p style=\"min-height:1.5em\">Stay updated with current emerging trends and techniques</p><p style=\"min-height:1.5em\"></p></li></ul><p style=\"min-height:1.5em\"><strong>Requirements:</strong></p><ul style=\"min-height:1.5em\"><li><p style=\"min-height:1.5em\">Minimum of 5 years of experience as an editor</p></li><li><p style=\"min-height:1.5em\">Expert knowledge in Adobe Premiere and Adobe After Effects</p></li><li><p style=\"min-height:1.5em\">Strong sense of visual storytelling</p></li><li><p style=\"min-height:1.5em\">Can manage multiple post-production projects at the same time</p></li><li><p style=\"min-height:1.5em\">Great interpersonal skills, good judgment, and comfortable working with other creatives and management</p></li><li><p style=\"min-height:1.5em\">Has an understanding of devices, frame rates, codecs, file formats, and cameras</p></li><li><p style=\"min-height:1.5em\">Has an understanding of the post-production timeline: Offline Edit, Online Edit, Animation, Sound Design, and Color Grading</p></li><li><p style=\"min-height:1.5em\">A personal computer with stable internet</p><p style=\"min-height:1.5em\"></p></li></ul><p style=\"min-height:1.5em\"><strong>What’s in it for you?</strong></p><p style=\"min-height:1.5em\">As full-time member of our team, you’ll enjoy:</p><ul style=\"min-height:1.5em\"><li><p style=\"min-height:1.5em\">Flexible hours</p></li><li><p style=\"min-height:1.5em\">Work wherever you choose</p></li><li><p style=\"min-height:1.5em\">Fun and casual work environment</p></li><li><p style=\"min-height:1.5em\">Employee engagement activities and virtual gatherings</p></li><li><p style=\"min-height:1.5em\">We are a diverse, global team! 🌍</p><p style=\"min-height:1.5em\"></p></li></ul><p style=\"min-height:1.5em\"><em>This company is affiliated  for recruitment efforts. Each entity maintains operational independence, and no personal data is shared between them except as necessary for coordinated recruitment activities. Both teams are committed to protecting applicant privacy and ensuring a respectful, transparent hiring process.</em></p><p style=\"min-height:1.5em\"><em><strong>Equal Employment Opportunity</strong></em></p><p style=\"min-height:1.5em\"><em>Winona provides equal employment opportunities to all qualified individuals without regard to race, color, religion, sex, gender identity, sexual orientation, pregnancy, age, national origin, physical or mental disability, military or veteran status, genetic information, or any other protected classification. Equal employment opportunity extends to all aspects of employment including, but not limited to, recruitment, hiring, training, promotion, demotion, transfer, leaves of absence, and termination. Winona takes allegations of discrimination, harassment, and retaliation seriously and will promptly investigate such behaviors.</em></p>","tags":"[\"management\"]","pubDate":"2025-05-05T19:47:29.412Z","link":"https://jobs.ashbyhq.com/winona/b3183581-17bc-460a-a40b-4d2cf6ef61d2","slug":"video-editor-winona-3925"},{"id":2208454297,"title":"Junior Product Manager","company":"Winona","image":"https://yt3.googleusercontent.com/k45HnnNMWgPv-xF3D-u2ThxmesDOeU0p02rNJpbRWLes2Z18WpkLgXEE7XuBLkkzN_38AFnp3A=s160-c-k-c0x00ffffff-no-rj","description":"<p style=\"min-height:1.5em\"><strong>About Winona:</strong></p><p style=\"min-height:1.5em\"><a target=\"_blank\" rel=\"noopener noreferrer nofollow\" href=\"https://bywinona.com\">Winona</a> is one of the leading telemedicine companies providing HRT for women in menopause. We’ve built all of our technology in house including an EHR, patient care admin system, patient portal, website, marketing technology etc. Winona has two compounding pharmacies and a team of in house physicians providing world-class care via a fully vertically integrated business model.</p><p style=\"min-height:1.5em\"></p><p style=\"min-height:1.5em\"><strong>About the role:</strong></p><p style=\"min-height:1.5em\">We are looking for a talented and passionate <strong>Junior Product Manager </strong>to join our team. In this full-time position, you will lead experimentation efforts, leveraging data-driven insights to refine website copy, design, and image assets. Your day by day will have a strong focus on A/B testing and website optimization to enhance conversion rates. </p><p style=\"min-height:1.5em\"></p><p style=\"min-height:1.5em\"><strong>Responsibilities:</strong></p><ul style=\"min-height:1.5em\"><li><p style=\"min-height:1.5em\">Design, execute, and analyze A/B tests to optimize conversion rates across key website pages.</p></li><li><p style=\"min-height:1.5em\">Continuously refine copy, design, and visual assets to enhance user engagement and overall performance.</p></li><li><p style=\"min-height:1.5em\">Collaborate cross-functionally with design, development, and marketing teams to implement test results and drive improvements.</p></li><li><p style=\"min-height:1.5em\">Utilize experimentation platforms like Optimizely (or similar tools) to manage and track testing efforts.</p></li><li><p style=\"min-height:1.5em\">Define, monitor, and interpret key performance metrics to assess test effectiveness and inform decision-making.</p></li><li><p style=\"min-height:1.5em\">Support broader product management initiatives, including roadmap development, stakeholder communication, and feature prioritization.</p><p style=\"min-height:1.5em\"></p></li></ul><p style=\"min-height:1.5em\"><strong>Requirements:</strong></p><ul style=\"min-height:1.5em\"><li><p style=\"min-height:1.5em\">+2 years of experience as a Product Manager or in a similar role.</p></li><li><p style=\"min-height:1.5em\">Hands-on experience with A/B testing and conversion rate optimization (CRO).</p></li><li><p style=\"min-height:1.5em\">Familiarity with tools like Optimizely, Google Optimize, or other experimentation platforms (preferred but not required).</p></li><li><p style=\"min-height:1.5em\">Strong analytical skills, with the ability to translate data into actionable insights.</p></li><li><p style=\"min-height:1.5em\">Experience working on website or digital product optimization projects.</p></li><li><p style=\"min-height:1.5em\">Excellent collaboration and communication skills, with the ability to work effectively across cross-functional teams.</p></li><li><p style=\"min-height:1.5em\">Passion for data-driven decision-making and using A/B testing to enhance user experience and business impact.</p></li></ul><p style=\"min-height:1.5em\"></p><p style=\"min-height:1.5em\"><strong>What’s in it for you?</strong></p><p style=\"min-height:1.5em\">As full-time member of our team, you’ll enjoy:</p><ul style=\"min-height:1.5em\"><li><p style=\"min-height:1.5em\">Flexible hours</p></li><li><p style=\"min-height:1.5em\">Work wherever you choose</p></li><li><p style=\"min-height:1.5em\">Fun and casual work environment</p></li><li><p style=\"min-height:1.5em\">Employee engagement activities and virtual gatherings</p></li><li><p style=\"min-height:1.5em\">We are a diverse, global team! 🌍</p><p style=\"min-height:1.5em\"></p></li></ul><p style=\"min-height:1.5em\"><em>This company is affiliated  for recruitment efforts. Each entity maintains operational independence, and no personal data is shared between them except as necessary for coordinated recruitment activities. Both teams are committed to protecting applicant privacy and ensuring a respectful, transparent hiring process.</em></p><p style=\"min-height:1.5em\"><em><strong>Equal Employment Opportunity</strong></em></p><p style=\"min-height:1.5em\"><em>Winona provides equal employment opportunities to all qualified individuals without regard to race, color, religion, sex, gender identity, sexual orientation, pregnancy, age, national origin, physical or mental disability, military or veteran status, genetic information, or any other protected classification. Equal employment opportunity extends to all aspects of employment including, but not limited to, recruitment, hiring, training, promotion, demotion, transfer, leaves of absence, and termination. Winona takes allegations of discrimination, harassment, and retaliation seriously and will promptly investigate such behaviors.</em></p>","tags":"[\"management\"]","pubDate":"2025-05-05T19:46:56.933Z","link":"https://jobs.ashbyhq.com/winona/169c318d-419b-427c-8404-abf152573024","slug":"junior-product-manager-winona-4072"},{"id":5447870882,"title":"Software Engineer - Payments","company":"Sardine","image":"https://avatars.githubusercontent.com/u/65879301?s=200&v=4","description":"<p style=\"min-height:1.5em\"><strong>Who we are:</strong></p><p style=\"min-height:1.5em\">We are a leader in fraud prevention and AML compliance. Our platform uses device intelligence, behavior biometrics, machine learning, and AI to stop fraud before it happens. Today, over 300 banks, retailers, and fintechs worldwide use Sardine to stop identity fraud, payment fraud, account takeovers, and social engineering scams. We have raised $145M from world-class investors, including Andreessen Horowitz, Activant, Visa, Experian, FIS, and Google Ventures.</p><p style=\"min-height:1.5em\"></p><p style=\"min-height:1.5em\"><strong>Our culture:</strong></p><ul style=\"min-height:1.5em\"><li><p style=\"min-height:1.5em\">We have hubs in the Bay Area, NYC, Austin, and Toronto. However, we maintain a remote-first work culture. #WorkFromAnywhere</p></li><li><p style=\"min-height:1.5em\">We hire talented, self-motivated individuals with extreme ownership and high growth orientation. </p></li><li><p style=\"min-height:1.5em\">We value performance and not hours worked. We believe you shouldn't have to miss your family dinner, your kid's school play, friends get-together, or doctor's appointments for the sake of adhering to an arbitrary work schedule.</p></li></ul><p style=\"min-height:1.5em\"></p><p style=\"min-height:1.5em\"><strong>Location: </strong>Remote - Brazil</p><p style=\"min-height:1.5em\">To be considered for this position, you must reside in one of the following cities:</p><ul style=\"min-height:1.5em\"><li><p style=\"min-height:1.5em\"><strong>São Paulo: </strong>São Paulo, Campinas, São José dos Campos</p></li><li><p style=\"min-height:1.5em\"><strong>Rio de Janeiro: </strong>Rio de Janeiro</p></li><li><p style=\"min-height:1.5em\"><strong>Minas Gerais: </strong>Belo Horizonte</p></li><li><p style=\"min-height:1.5em\"><strong>Paraná: </strong>Curitiba<strong> </strong></p></li><li><p style=\"min-height:1.5em\"><strong>Santa Catarina:</strong> Florianópolis</p></li></ul><p style=\"min-height:1.5em\"></p><p style=\"min-height:1.5em\"><strong>About the Role:</strong></p><p style=\"min-height:1.5em\">We’re looking for a backend-focused Software Engineer to join the Payments Team at Sardine. In this role, you’ll help design and build the APIs, services, and systems that power our crypto onramp and offramp infrastructure. You’ll work across the stack to launch impactful features, drive scalability, and contribute to product and technical direction. This is a high-ownership, high-impact role for an engineer passionate about building reliable systems at scale.</p><p style=\"min-height:1.5em\"></p><p style=\"min-height:1.5em\"><strong>What you'll be doing:</strong></p><ul style=\"min-height:1.5em\"><li><p style=\"min-height:1.5em\">Build and maintain backend services for our crypto onramp/offramp platform used by hundreds of thousands of users worldwide.</p></li><li><p style=\"min-height:1.5em\">Design and implement APIs and data pipelines with a focus on high availability, fault tolerance, and zero downtime.</p></li><li><p style=\"min-height:1.5em\">Collaborate closely with cross-functional teams including product, compliance, and business to launch features end-to-end.</p></li><li><p style=\"min-height:1.5em\">Work with partners and vendors to deliver seamless payment integrations.</p></li><li><p style=\"min-height:1.5em\">Help shape the team’s technical roadmap, improve developer tooling, and optimize internal workflows.</p></li><li><p style=\"min-height:1.5em\">Participate in an on-call rotation and production support to ensure system health and uptime.</p></li></ul><p style=\"min-height:1.5em\"></p><p style=\"min-height:1.5em\"><strong>What you'll bring:</strong></p><ul style=\"min-height:1.5em\"><li><p style=\"min-height:1.5em\">5+ years of proven experience as a Software Engineer specializing in web backend development.</p></li><li><p style=\"min-height:1.5em\">Proficiency in Ruby (our primary backend language on the Payments Team)</p></li><li><p style=\"min-height:1.5em\">Experience building APIs, services, and data pipelines.</p></li><li><p style=\"min-height:1.5em\">Strong sense of ownership, with attention to detail and a proactive attitude toward learning and improvement.</p></li><li><p style=\"min-height:1.5em\">Experience in frontend development is a plus.</p></li><li><p style=\"min-height:1.5em\">Proven ability to deliver high-quality, reliable systems in production environments.</p></li><li><p style=\"min-height:1.5em\">A user-first mindset with strong empathy for customers and their needs.</p></li><li><p style=\"min-height:1.5em\">Bonus: relevant industry experience, particularly in crypto, fintech or banking, and domain knowledge in fraud prevention or compliance. </p></li><li><p style=\"min-height:1.5em\">Proficient in English - from casual chats to formal reports.</p></li></ul><p style=\"min-height:1.5em\"></p><p style=\"min-height:1.5em\"><strong>Technologies we use:</strong></p><ul style=\"min-height:1.5em\"><li><p style=\"min-height:1.5em\">Ruby</p></li><li><p style=\"min-height:1.5em\">Python</p></li><li><p style=\"min-height:1.5em\">Java</p></li><li><p style=\"min-height:1.5em\">Terraform</p></li><li><p style=\"min-height:1.5em\">TypeScript (React + node)</p></li><li><p style=\"min-height:1.5em\">Golang</p></li><li><p style=\"min-height:1.5em\">Bigtable</p></li><li><p style=\"min-height:1.5em\">Postgres / PostgreSQL</p></li><li><p style=\"min-height:1.5em\">GCP dataflow (apache beam)</p></li><li><p style=\"min-height:1.5em\">BigQuery</p></li></ul><p style=\"min-height:1.5em\"></p><p style=\"min-height:1.5em\"><strong>Compensation:</strong> Base pay range of $50,000 - $70,000 + equity with tremendous upside potential + Attractive benefits</p><p style=\"min-height:1.5em\"></p><p style=\"min-height:1.5em\">The compensation offered for this role will depend on various factors, including the candidate's location, qualifications, work history, and interview performance, and may differ from the stated range.</p><p style=\"min-height:1.5em\"></p><p style=\"min-height:1.5em\"><strong>Benefits we offer:</strong></p><ul style=\"min-height:1.5em\"><li><p style=\"min-height:1.5em\">Generous compensation in cash and equity</p></li><li><p style=\"min-height:1.5em\">Early exercise for all options, including pre-vested</p></li><li><p style=\"min-height:1.5em\">Work from anywhere: Remote-first Culture</p></li><li><p style=\"min-height:1.5em\">Flexible paid time off, Year-end break, Self care days off</p></li><li><p style=\"min-height:1.5em\">Health insurance, dental, and vision coverage for employees and dependents - <em>US and Canada specific</em></p></li><li><p style=\"min-height:1.5em\">4% matching in 401k / RRSP - <em>US and Canada specific</em></p></li><li><p style=\"min-height:1.5em\">MacBook Pro delivered to your door</p></li><li><p style=\"min-height:1.5em\">One-time stipend to set up a home office — desk, chair, screen, etc.</p></li><li><p style=\"min-height:1.5em\">Monthly meal stipend</p></li><li><p style=\"min-height:1.5em\">Monthly social meet-up stipend</p></li><li><p style=\"min-height:1.5em\">Annual health and wellness stipend</p></li><li><p style=\"min-height:1.5em\">Annual Learning stipend</p></li><li><p style=\"min-height:1.5em\">Unlimited access to an expert financial advisory</p></li></ul><p style=\"min-height:1.5em\"></p><p style=\"min-height:1.5em\">Join a fast-growing company with world-class professionals from around the world. If you are seeking a meaningful career, you found the right place, and we would love to hear from you.</p>","tags":"[\"postgres\",\"typescript\",\"engineering\"]","pubDate":"2025-05-05T18:30:49.483Z","link":"https://jobs.ashbyhq.com/sardine/4a9709c2-0fc1-4990-8357-c036d1e50a06","slug":"software-engineer-payments-sardine-7033"},{"id":3632068463,"title":"Account Executive (English & Punjabi)","company":"Bobtail","image":"https://www.bobtail.com/wp-content/uploads/2023/09/cropped-cropped-favicon-180x180.png","description":"&lt;p&gt;&lt;strong&gt;About Bobtail&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;Bobtail is dedicated to increasing happiness for our customers by eliminating inefficiencies in the supply chain. We envision a supply chain without friction, fraud, waste, and abuse where companies succeed based on the value they create. We work in a unique way at Bobtail, where we value teams over individuals and encourage experimentation and iteration to constantly improve. Teams are given flexibility in working towards a shared purpose, and given the freedom to decide how they will accomplish their goals.&lt;/p&gt;\n&lt;p&gt;If you are an out-of-the-box thinker that takes a proactive approach to collaborating with others to solve problems and achieve your goals - we would love to talk to you.&lt;/p&gt;\n&lt;p&gt;The things we value:&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;Mission&lt;/li&gt;\n&lt;li&gt;Teams over individuals&lt;/li&gt;\n&lt;li&gt;Collaboration&lt;/li&gt;\n&lt;li&gt;Communication&lt;/li&gt;\n&lt;li&gt;Iteration&lt;/li&gt;\n&lt;li&gt;Experimentation and failing fast&lt;/li&gt;\n&lt;li&gt;Initiative and solutions-oriented approach&lt;/li&gt;\n&lt;li&gt;Documentation&lt;/li&gt;\n&lt;li&gt;Data&lt;/li&gt;\n&lt;li&gt;Mental health and work-life balance&lt;/li&gt;\n&lt;li&gt;Diversity&lt;/li&gt;\n&lt;li&gt;Transparency&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;&lt;strong&gt;You should apply if you have:&lt;/strong&gt;&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;3–5 years of B2B cold calling &amp;amp; outbound sales experience&lt;/li&gt;\n&lt;li&gt;Bilingual is a must (English/Punjabi)&lt;/li&gt;\n&lt;li&gt;Software as a Service (SaaS) experience is a must&lt;/li&gt;\n&lt;li&gt;US Trucking Industry knowledge is a plus&lt;/li&gt;\n&lt;li&gt;CRM usage experience is preferred (Salesforce is a plus)&lt;/li&gt;\n&lt;li&gt;Start-up experience is a plus&lt;/li&gt;\n&lt;li&gt;Ability to quickly learn in a fast-paced environment,&lt;/li&gt;\n&lt;li&gt;Consistent track record of achievement and hitting quotas&lt;/li&gt;\n&lt;li&gt;Confidence, as well as strong verbal &amp;amp; written communication skills when interacting with clients&lt;/li&gt;\n&lt;li&gt;Ability to discover and understand customer needs and propose solutions&lt;/li&gt;\n&lt;li&gt;Dependable team player&lt;/li&gt;\n&lt;li&gt;A motivated, driven, self-starter… We love those with grit and accountability!&lt;/li&gt;\n&lt;li&gt;Must own a modern - not older than 3 years old laptop with a working camera.&lt;/li&gt;\n&lt;li&gt;An Internet Speed of 50 Mbps is required&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;&lt;strong&gt;You will be responsible for:&lt;/strong&gt;&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;Making daily cold calls &amp;amp; sending emails/text to connect with prospects&lt;/li&gt;\n&lt;li&gt;Converting prospects &amp;amp; leads into Bobtail clients&lt;/li&gt;\n&lt;li&gt;Collaborating as a team to accomplish individual, team, and company-wide goals&lt;/li&gt;\n&lt;li&gt;Maintaining a pipeline of leads and opportunities using our CRM (Salesforce)&lt;/li&gt;\n&lt;li&gt;Effectively using other sales tools to track progress and improve your performance&lt;/li&gt;\n&lt;li&gt;Learning about each client’s needs, industry, and competitors.&lt;/li&gt;\n&lt;li&gt;Building long-lasting, mutually beneficial relationships with prospects and clients to create a better customer experience.&lt;/li&gt;\n&lt;li&gt;Following up with prospects throughout the sales cycle to continue nurturing them.&lt;/li&gt;\n&lt;li&gt;Presenting the value of Bobtail products and services to prospects&lt;/li&gt;\n&lt;li&gt;Staying current on company offerings and industry trends.&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;&lt;strong&gt;Educational background:&lt;/strong&gt;&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;Bachelor’s degree preferred&lt;/li&gt;\n&lt;li&gt;Sales or business education/certification preferred&lt;/li&gt;\n&lt;li&gt;Completed studies preferred&lt;br&gt;&lt;br&gt;&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;&lt;strong&gt;Benefits:&lt;/strong&gt;&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;Monthly Mental Break Day&lt;/li&gt;\n&lt;li&gt;Paid Time Off&lt;/li&gt;\n&lt;li&gt;Work from home (or wherever)&lt;/li&gt;\n&lt;li&gt;Parental leave&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;&lt;br&gt;Creating a diverse and inclusive workplace is Bobtail’s nucleus. We are an equal opportunity employer and embrace people of different backgrounds, cultures, religions, national origins, races, colours, genders, gender expressions, sexual orientations, ages, marital status, veteran status, experiences, abilities, and perspectives.&lt;/p&gt;\n&lt;p&gt;&amp;nbsp;&lt;/p&gt;","tags":"[\"b2b\"]","pubDate":"2025-05-05T11:54:46.000Z","link":"https://job-boards.greenhouse.io/bobtail/jobs/4560821005","slug":"account-executive-english-punjabi-bobtail-8322"},{"id":8534664274,"title":"Chief Technology Officer -  French fluent 🇫🇷","company":"Paradox","image":"https://cdn.prod.website-files.com/63ef5a85ffdee87c27e6573a/66e0418f9e22dd4e4cacb077_Black%20symbol%20(1)%20(2).png","description":"<p style=\"min-height:1.5em\"><strong>Wait a minute. </strong></p><p style=\"min-height:1.5em\"><em>Deep inside you are looking for a new adventure with 🗽Freedom, 🔥Ambition and 😍Impact</em></p><p style=\"min-height:1.5em\"><em>Are you inspired in being a key player in building a massive EdTech company that will empower millions of people?</em></p><p style=\"min-height:1.5em\"><em>Are you a mission-driven technologist who wants to shape the future of education — and human potential — using cutting-edge tech?</em></p><p style=\"min-height:1.5em\">At <strong>Paradox</strong>, we’re not building just another learning platform. We’re on a mission to <strong>redefine how millions of people unlock their ambition</strong>—through breakthrough digital experiences, captivating storytelling, and frontier technology.</p><p style=\"min-height:1.5em\"><strong>Deep inside you are looking for a new adventure with… </strong></p><ul style=\"min-height:1.5em\"><li><p style=\"min-height:1.5em\"><strong>🗽 Freedom: </strong>feeling free to work remotely or hybrid and being trusted to deliver</p></li><li><p style=\"min-height:1.5em\">🔥 <strong>Ambition:</strong> growing up surrounded by smart colleagues driven to create an iconic brand like Nike big </p></li><li><p style=\"min-height:1.5em\">😍 <strong>Impact:</strong> contributing to transform people lives at scale and feel your own impact in the company</p></li></ul><p style=\"min-height:1.5em\">For us, being Iconic is to innovate at the intersection of Psychology x Creativity x Technology.</p><div style=\"text-align:left\"><img style=\"max-width:100%\" src=\"https://app.ashbyhq.com/api/images/user-content/9f216e31-710a-4d14-8a7c-747665aa0e4a/fcc861cb-5a08-4eae-a24a-f8034cdbc5ca/pic%20job%20desc3.png\" /></div><p style=\"min-height:1.5em\"></p><p style=\"min-height:1.5em\">You also happen to want to use your experience as an awesome CTO to contribute to impacting the lives of thousands of people? </p><p style=\"min-height:1.5em\">Then, you have found the next adventure that will fulfill you !</p><p style=\"min-height:1.5em\"></p><div style=\"text-align:center\"><img style=\"max-width:100%\" src=\"https://app.ashbyhq.com/api/images/user-content/9f216e31-710a-4d14-8a7c-747665aa0e4a/be66ea66-5e5e-47cc-b164-96ffe930a9a3/ParadoxApp-LD-2000px.jpg\" /></div><p style=\"min-height:1.5em\">You'll work closely with our founding team to define our technical vision.</p><p style=\"min-height:1.5em\"><strong>This is a full-time position, carried out from our beautiful offices in Dubai, Lisbon or full-remote from anywhere in the world (with frequent travels to Dubaï).</strong></p><p style=\"min-height:1.5em\"><strong>French and English fluency is required.</strong></p><p style=\"min-height:1.5em\"><br /></p><h2>YOUR MISSION 🚀 </h2><p style=\"min-height:1.5em\">-------------------------------</p><p style=\"min-height:1.5em\">Think <strong>Nike meets Netflix</strong>, powered by <strong>neuroscience and soft skills</strong>. Now inject it with <strong>AI, immersive media, and obsession-level execution.</strong> That’s where we’re headed—and we need a <strong>visionary CTO</strong> to take us there.</p><p style=\"min-height:1.5em\"></p><p style=\"min-height:1.5em\"><strong>🎯 Your main goal will be to build the platform that powers our ecosystem.</strong></p><p style=\"min-height:1.5em\"></p><p style=\"min-height:1.5em\"><strong>As our CTO</strong>, you’ll shape the tech vision, architect scalable systems, and lead our engineering efforts in close partnership with product. Together, you’ll move fast—from idea to prototype to live product — crafting seamless learning experiences that set us apart. This product–tech collaboration is core to our strategy and central to how we build, iterate, and differentiate.</p><p style=\"min-height:1.5em\">You’ll sit on the leadership team, driving the evolution of the platform, the product, and long-term performance.</p><p style=\"min-height:1.5em\">Our sources of inspiration are Apple, Nike, Spotify, Disney for their obsession of excelling, having a worldwide impact and not just selling products but <strong>crafting experiences.</strong> You will be playing a pivotal role in making Paradox play at that level and becoming an iconic brand.</p><p style=\"min-height:1.5em\"></p><p style=\"min-height:1.5em\"><u>Here are your 7 responsibilities : </u></p><p style=\"min-height:1.5em\"></p><h2>1 | SET THE TECH VISION</h2><ul style=\"min-height:1.5em\"><li><p style=\"min-height:1.5em\">Architect the future of learning tech.</p></li><li><p style=\"min-height:1.5em\">Align tech with product, growth &amp; design for maximum impact.</p></li><li><p style=\"min-height:1.5em\">Explore and apply breakthrough tech—AI, speech recognition, adaptive learning engines, and mobile-native UX—to enhance how users learn.</p></li></ul><p style=\"min-height:1.5em\"></p><h2>2 | BUILD THE PRODUCT &amp; PROTOTYPES</h2><ul style=\"min-height:1.5em\"><li><p style=\"min-height:1.5em\">Lead the full-stack development of our core platform.</p></li><li><p style=\"min-height:1.5em\">Co-create MVPs with product &amp; design, test relentlessly, iterate and ship fast.</p></li><li><p style=\"min-height:1.5em\">Prioritize simplicity, performance, and “wow” moments.<br /></p></li></ul><p style=\"min-height:1.5em\"></p><h2>3 | SUPERCHARGE INTERNAL SYSTEMS </h2><ul style=\"min-height:1.5em\"><li><p style=\"min-height:1.5em\">Streamline infrastructure, automation, and back-office tooling.</p></li><li><p style=\"min-height:1.5em\">Choose best-in-class tools (buy vs build) to scale fast and stay lean.</p></li><li><p style=\"min-height:1.5em\">Design robust, scalable architectures that power every business unit (finance, ops, CS).<br /></p></li></ul><p style=\"min-height:1.5em\"></p><h2>4 | DRIVE DATA STRATEGY &amp; OBSERVABILITY <strong> </strong></h2><ul style=\"min-height:1.5em\"><li><p style=\"min-height:1.5em\">Build a modern data stack that enables real-time decisions.</p></li><li><p style=\"min-height:1.5em\">Implement clean pipelines, automated dashboards, and A/B testing.</p></li><li><p style=\"min-height:1.5em\">Ensure full visibility on product usage, engagement, and outcomes.<br /></p></li></ul><p style=\"min-height:1.5em\"></p><h2>5 | OWN DELIVERY &amp; PRIORITIZATION </h2><ul style=\"min-height:1.5em\"><li><p style=\"min-height:1.5em\">Translate the product vision into a real life roadmap.</p></li><li><p style=\"min-height:1.5em\">Align with product on what ships when, with ruthless prioritization.</p></li><li><p style=\"min-height:1.5em\">Manage tech budgets, timelines, and key metrics.<br /></p></li></ul><p style=\"min-height:1.5em\"></p><h2>6 | REPRESENT TECH INTERNALLY &amp; EXTERNALLY </h2><ul style=\"min-height:1.5em\"><li><p style=\"min-height:1.5em\">Speak at events, write articles, and build our visibility in tech circles.</p></li><li><p style=\"min-height:1.5em\">Be a true partner to business, product, and design teams.<br /></p></li></ul><p style=\"min-height:1.5em\"></p><h2>7 I LEAD YOUR TEAM TO EXCELLENCE </h2><ul style=\"min-height:1.5em\"><li><p style=\"min-height:1.5em\">Mentor, and retain world-class engineers.</p></li><li><p style=\"min-height:1.5em\">Set high standards in code quality, documentation, and velocity.</p></li><li><p style=\"min-height:1.5em\">Cultivate a culture of ownership, experimentation, and high performance.</p></li></ul><p style=\"min-height:1.5em\"><br /></p><h2>DO YOU RECOGNIZE YOURSELF? 😍</h2><h3>-------------------------------</h3><p style=\"min-height:1.5em\"></p><ul style=\"min-height:1.5em\"><li><p style=\"min-height:1.5em\">You have a track-record being startup-savvy CTO building world-class teams and products from 0 → 1.</p></li><li><p style=\"min-height:1.5em\">You’re obsessed with shipping, learning, and improving—always data-informed, never perfectionist.</p></li><li><p style=\"min-height:1.5em\">You’re both strategic and hands-on: able to design architecture and jump into code when needed.</p></li><li><p style=\"min-height:1.5em\">You care deeply about education, personal growth, and impact—and want your work to matter.</p></li><li><p style=\"min-height:1.5em\">You lead with energy, clarity, and empathy—and attract A-players who want to follow your lead.</p></li></ul><p style=\"min-height:1.5em\"><br /></p><h3><strong>LANGUAGES</strong></h3><p style=\"min-height:1.5em\">French &amp; English fluency</p><p style=\"min-height:1.5em\"><em>Currently, 20% of the team is International, from the cherry blossoms of Japan, the Canadian lakes and to the forest of Madagascar. </em></p><p style=\"min-height:1.5em\"></p><h3><strong>OUR STACK (AND WHAT’S NEXT)</strong></h3><ul style=\"min-height:1.5em\"><li><p style=\"min-height:1.5em\">Backend: Nest.js (with Typescript),</p></li><li><p style=\"min-height:1.5em\">Frontend: Next.js</p></li><li><p style=\"min-height:1.5em\">Architecture: microservices, AWS (EC2, Lambdas, RDS, Cloudwatch), Vercel</p></li><li><p style=\"min-height:1.5em\">Containers &amp; DevOps: Docker, CI/CD pipelines</p></li><li><p style=\"min-height:1.5em\">Data:, DBT, ETLs,Metabase, Redshift</p></li><li><p style=\"min-height:1.5em\">Productivity: Notion, Webflow, Make, Airtable, N8N</p></li></ul><p style=\"min-height:1.5em\">We love clean code. We move fast. We optimize for impact.</p><p style=\"min-height:1.5em\"></p><h2>IT MIGHT NOT BE FOR YOU 🙅‍♀️</h2><h3>-------------------------------</h3><p style=\"min-height:1.5em\">Let’s be clear, we are looking for someone who is not just Great, and for whom Paradox ambition isn’t just another cool project; but a true mission.</p><p style=\"min-height:1.5em\"></p><p style=\"min-height:1.5em\">So if those <strong>personal interests :</strong> personal development / coaching / professional growth / education / edtech / teaching / edutainment<strong> are not things you REALLY love, and want to solve for other, let’s forget it</strong></p><p style=\"min-height:1.5em\"></p><p style=\"min-height:1.5em\">Let’s forget about it also if,</p><ul style=\"min-height:1.5em\"><li><p style=\"min-height:1.5em\">You <strong>don’t like to be challenged</strong> and grow in your job</p></li><li><p style=\"min-height:1.5em\">You don't like <strong>receiving or giving tough feedbacks</strong></p></li><li><p style=\"min-height:1.5em\">You <strong>don’t question the status quo: </strong>the process are there for a reason, we have always done it this way</p></li><li><p style=\"min-height:1.5em\">You <strong>like to have very specific &amp; fixed tasks</strong> assigned to you. Be told what to do and how to do it.</p></li><li><p style=\"min-height:1.5em\"><strong>Your only driver is joining a full-remote company</strong>: yes, our company culture is cool, but we want people to care about our mission, products, and their job!</p></li></ul><h2>🤩 JOIN US IF YOU CRAVE</h2><h3>-------------------------------</h3><div style=\"text-align:left\"><img style=\"max-width:100%\" src=\"https://app.ashbyhq.com/api/images/user-content/9f216e31-710a-4d14-8a7c-747665aa0e4a/fa58b8af-ec0a-4bd3-a2d9-fd4c908e2f86/pic%20job%20desc1.png\" /></div><p style=\"min-height:1.5em\"></p><p style=\"min-height:1.5em\"><em><strong>Growth &amp; Ambition 🚀</strong></em></p><p style=\"min-height:1.5em\">🏅 We hire only the best, it’s exhilarating to be <strong>surrounded by A-players</strong> who strive to perform whilst being in a good mood. You'll be working with some of the best minds. We understand that \"A\" people attract \"A\" people.</p><p style=\"min-height:1.5em\">🏋️‍♀️ No more bosses, but ongoing conversations to support your professional development.</p><p style=\"min-height:1.5em\">⚡️ Being part of an ambitious company with a lot of growth opportunities</p><p style=\"min-height:1.5em\"></p><p style=\"min-height:1.5em\"><em><strong>Impact &amp; Meaning </strong></em><strong>🔥</strong></p><p style=\"min-height:1.5em\">🦄 <strong>Playing a crucial role in the development of a company</strong> whose content and products are enjoyed by millions of people<br /><strong>🤩 Waking up in the morning knowing you are making a difference:</strong> <em>we receive messages every day from clients who have successfully lost weight, quit smoking, reach a milestone in their business, built better relationships, and made positive changes in their lives.<br /><br /><strong>But that’s not all, we believe that driven people deserve…</strong></em></p><p style=\"min-height:1.5em\"></p><p style=\"min-height:1.5em\"><em><strong>Freedom &amp; Well Being* 🗽☀️</strong></em></p><p style=\"min-height:1.5em\">😎 A company culture based on <strong>autonomy &amp; accountability<br /></strong>🗽 <strong>Flexible working hours<br /></strong>🌎 <strong>A remote culture from day one with the freedom to work from wherever you want<br /></strong>🏤 <strong>Magnificent offices in Dubai and Lisbon:</strong> you’re at home worldwide<br /><strong>⌨️ Standing desks</strong> paid by the company, if you live far from our offices<br />💻 <strong>Macbook:</strong> <em>to be the most efficient in your work<br /></em>🏀 <strong>350€ per year paid by the company to take care of yourself</strong> <em>(for your gym, or dance class or whatever make you feel great)<br /></em>📚 <strong>150€ per year paid by the company to boost your knowledge</strong> (books, education): we are passionate about learning and want to support your growth)<br />🤝 <strong>1:1 coachings</strong>: a Paradox coach supporting you personally or professionally to live your best life<br />✈️ <strong>Team building</strong></p><p style=\"min-height:1.5em\"><em>* those benefits are only for full-time employees</em></p><p style=\"min-height:1.5em\"></p><h2>HIRING PROCESS 📃</h2><h3>-------------------------------</h3><p style=\"min-height:1.5em\">That job description resonated with you?</p><p style=\"min-height:1.5em\"><strong>Here is your tailor made hiring process</strong></p><p style=\"min-height:1.5em\"><strong>📃 A 6 to 8 minutes </strong>application survey (with a short video assignment)</p><p style=\"min-height:1.5em\"><strong>📞 A 15–20 minute </strong>WhatsApp call with Chloé, our Talent Manager, to tell you more about the challenge and see if it fits your experience and expectations</p><p style=\"min-height:1.5em\"><strong>💻 A video call </strong>with Chloé to deep dive into your career path and ambitions</p><p style=\"min-height:1.5em\"><strong>💻 A video call</strong> with Rashad, Head of Product, to explore your technical skills and see how we can align your goals with our needs</p><p style=\"min-height:1.5em\"><strong>💻 A video call with Gab, </strong>Head of Engineering, to discuss how you'd fit into Paradox’s tech team</p><p style=\"min-height:1.5em\"><strong>💻 A culture-fit video call with Timy, </strong>our Culture Coach, to assess alignment with our values and mindset</p><p style=\"min-height:1.5em\"><strong>💻 A final Tech Case Study </strong>presentation to our Leadership Team—your chance to showcase your vision, strategy, and how you’d contribute to building our succes<strong>s</strong></p><p style=\"min-height:1.5em\"><strong>💼 Reference check </strong>to understand how you operate across environments and help set you up for a smooth onboarding</p><p style=\"min-height:1.5em\"><strong>🫵🚀 Welcome aboard!</strong></p><p style=\"min-height:1.5em\"></p><p style=\"min-height:1.5em\"><strong>About our hiring process</strong></p><p style=\"min-height:1.5em\">Our recruitment process is tailored to do our best to avoid that you or us realize that we’re not a perfect fit. Every step serves a purpose and will allow us to get to know you better as much as it’ll help you understand more where you’ll be stepping in.</p><p style=\"min-height:1.5em\">We also want you to have time to ask all of your questions regarding the mission, the long-term vision of your team and the company, our values, with the relevant interlocutor in front of you.</p><p style=\"min-height:1.5em\"></p><h2>But maybe YOU WONDER WHAT’S OUR STORY ? 😉</h2><p style=\"min-height:1.5em\">-------------------------------</p><p style=\"min-height:1.5em\">At Paradox, we are convinced that people do not want “just a job” anymore.</p><p style=\"min-height:1.5em\">We are all craving to have an impact through our professional journey. Some want to start their own venture, some want to become an intrapreneur in their current organization, some others just want their day-to-day tasks to have more meaning.</p><p style=\"min-height:1.5em\"><strong>🎯 PARADOX HAS ONE GOAL: TO EMPOWER PEOPLE AND ORGANIZATIONS TO LIVE THEIR TRUE AMBITIONS.</strong></p><p style=\"min-height:1.5em\">But where do we start?</p><p style=\"min-height:1.5em\">If you have an interest in personal development, you probably already know that:</p><ul style=\"min-height:1.5em\"><li><p style=\"min-height:1.5em\">Making things happen is a real struggle when you don’t know what truly inspires you and how to get there ;</p></li><li><p style=\"min-height:1.5em\">Available resources are either boring 😴 or full of crazy unsubstantiated theories 🤪.</p></li></ul><p style=\"min-height:1.5em\">It needs to change, and we’re here to make it happen!</p><p style=\"min-height:1.5em\"><strong>⭐️ OUR AMBITION IS TO MAKE SUCCESS THE ONLY POSSIBLE OUTCOME FOR OUR CLIENTS (WHATEVER SUCCESS MEANS FOR THEM), BY CRAFTING INNOVATIVE &amp; CAPTIVATING BREAKTHROUGH EXPERIENCES.</strong></p><p style=\"min-height:1.5em\">In other words, we want to make personal growth <strong>as entertaining as watching Netflix.</strong></p><p style=\"min-height:1.5em\">How, you might be wondering?</p><ul style=\"min-height:1.5em\"><li><p style=\"min-height:1.5em\">We travel the world and surround ourselves with <strong>top entrepreneurs</strong> <em>(Richard Branson - Founder of Virgin, Marc Simoncini - Founder of Meeting, Fred Mazzella - Founder of BlablaCar)</em>, <strong>world</strong> <strong>athletes</strong> <em>(Tony Parker - Hall of fame NBA Player, Frederick Bousquet - World record in 50m free swimming, Frank Leboeuf - WorldCup Footballer)</em>, and <strong>artists</strong> <em>(Gad Elmaleh - Comedian, Franck Dubosc, Barry Osborne - Producer of Lord of the Rings and Matrix)</em> ✊;</p></li><li><p style=\"min-height:1.5em\">We reverse engineer their <strong>strategies for achieving success</strong> and fulfillment and lean on the <strong>latest researches</strong> about neurosciences ⚙️;</p></li><li><p style=\"min-height:1.5em\">We deliver trainings &amp; educational contents around Power Skills (critical thinking, productivity, leadership, public speaking, coaching, stress management, etc.), <strong>self-growth and performance</strong>, through a balanced set of <strong>e-learning programs, events and edutainment videos</strong> 💡.</p></li></ul><div style=\"text-align:left\"><img style=\"max-width:100%\" src=\"https://app.ashbyhq.com/api/images/user-content/9f216e31-710a-4d14-8a7c-747665aa0e4a/ec9fe1ea-f8c2-41b8-84ec-8548d649bc0f/pic%20job%20desc.png\" /></div><p style=\"min-height:1.5em\">From one well-known<a target=\"_blank\" rel=\"noopener noreferrer nofollow\" href=\"https://www.linkedin.com/in/davidlarochefr/\"> <u>Founder</u></a> to a team of +40 people today (and counting!), this approach has paid off and enabled us to exceed 2 million followers on social networks, and to have thousands of people attending our online events and training courses.</p><p style=\"min-height:1.5em\"><strong>🔥 TOGETHER, WE ARE DRIVEN BY ONE DREAM:</strong></p><ol style=\"min-height:1.5em\"><li><p style=\"min-height:1.5em\">Helping 100 000 people achieve their dream and display their pictures on what we call the “100 000 dreams wall” ;</p></li><li><p style=\"min-height:1.5em\">Giving our clients access to constant personal growth by reinventing their learning experience ;</p></li><li><p style=\"min-height:1.5em\">Leverage AI and other technology to provide an outstanding customized experience to millions of people for them to transform their lives. </p></li></ol><p style=\"min-height:1.5em\"><strong>And that’s where you come in. Join the Paradox Revolution !</strong></p><p style=\"min-height:1.5em\"></p>","tags":"[\"typescript\",\"finance\",\"management\",\"engineering\",\"aws\"]","pubDate":"2025-05-05T08:55:26.985Z","link":"https://jobs.ashbyhq.com/paradox/456924b0-e6e4-489a-b0d0-6cf3f9b50ce7","slug":"chief-technology-officer-french-fluent-paradox-9515"},{"id":9007111589,"title":"Business Development Manager for Hosting - (Worldwide REMOTE)","company":"CloudLinux","image":"https://avatars.githubusercontent.com/u/16290369?s=200&v=4","description":"<p>CloudLinux is a leading global, remote-first company specializing in high volume, low-cost Linux infrastructure and security products. We prioritize our employees, embrace remote working, and are committed to doing the right thing. Our team is collaborative and supportive, ensuring everyone's success and making CloudLinux a great place to work.</p><p>We are seeking an experienced hosting sales professional with a background in selling Linux products. As a Business Development Manager at CloudLinux, you will play a key role in driving our sales initiatives and expanding our presence in the hosting sector. You will have the opportunity to work with exciting and dynamic customers, requiring a proactive and engaging approach.</p><p>Join us to be part of a company that is not just about business, but about making a meaningful impact in the Linux and hosting industry. At CloudLinux, you'll be part of a team that supports each other and collaborates towards shared success.</p><p><strong>As our Business Development Manager, you will be responsible for:</strong></p><ul> <li>Regularly interacting with new and existing customers who are dynamic and enthusiastic about our products.</li> <li>Utilizing your proactive, 'hunter' approach to initiate contact with potential clients and explore new sales opportunities.</li> <li>Effectively presenting our value proposition to decision-makers and key personnel within organizations.</li> <li>Managing a pipeline of opportunities in Hubspot, and maintaining regular communication on progress and status.</li> <li>Identifying prospects who can act as public advocates for CloudLinux (e.g., through testimonials, case studies).</li> <li>Working in sync with company leadership to identify and pursue new market opportunities.</li> <li>Collaborating with SEs and Customer Success Managers to ensure successful customer adoption and onboarding.</li> </ul><p><strong>Requirements</strong></p><p><strong>To be successful in this role you should have:</strong></p><ul> <li>Proven track record of closing high-value sales and achieving quick sales cycles in the past 3-5 years</li> <li>In-depth understanding of Linux infrastructure and/or security software in the hosting industry</li> <li>Exceptional communication, organization, collaboration, and attention to detail</li> <li>Ability to effectively handle multiple tasks and prioritize them</li> <li>Demonstrated ability to build and maintain strong relationships, mitigate risks, and successfully close deals</li> <li>Familiarity with Hubspot is a plus</li> <li>Fluency in English</li> <li>A \"Hunter Personality\" with strong initiative and drive to pursue new sales leads and business opportunities</li> <li>Passionate and knowledgeable about technology, especially in the hosting and Linux domains</li> <li>Proficient in data entry tasks with a focus on upselling and cross-selling</li> </ul><p><strong>Benefits</strong></p><p><strong>What's in it for you?</strong></p><ul> <li>A focus on professional development; </li> <li>Interesting and challenging projects</li> <li>Flexible working hours</li> <li>Paid one month vacation per year and unlimited sick leave</li> <li>Medical insurance reimbursement</li> <li>Co-working and gym/sports reimbursement</li> <li>The opportunity to receive a reward for the most innovative idea that the company can patent</li> </ul><p><em>By applying for this position, you agree with </em><a href=\"https://cloudlinux.com/privacy-policy\" rel=\"nofollow noreferrer noopener\" class=\"external\"><em>Cloudlinux Privacy Policy</em></a><em> and give us your consent to maintain and process your personal data with this respect. Please read our Privacy Policy for more information.</em></p>","tags":"[]","pubDate":"2025-05-05T00:00:00.000Z","link":"https://apply.workable.com/j/FAC0194009","slug":"business-development-manager-for-hosting-worldwide-remote-cloudlinux-1058"},{"id":7500624568,"title":"Business Development Manager for Hosting - (Worldwide REMOTE)","company":"CloudLinux","image":"https://avatars.githubusercontent.com/u/16290369?s=200&v=4","description":"<p>CloudLinux is a leading global, remote-first company specializing in high volume, low-cost Linux infrastructure and security products. We prioritize our employees, embrace remote working, and are committed to doing the right thing. Our team is collaborative and supportive, ensuring everyone's success and making CloudLinux a great place to work.</p><p>We are seeking an experienced hosting sales professional with a background in selling Linux products. As a Business Development Manager at CloudLinux, you will play a key role in driving our sales initiatives and expanding our presence in the hosting sector. You will have the opportunity to work with exciting and dynamic customers, requiring a proactive and engaging approach.</p><p>Join us to be part of a company that is not just about business, but about making a meaningful impact in the Linux and hosting industry. At CloudLinux, you'll be part of a team that supports each other and collaborates towards shared success.</p><p><strong>As our Business Development Manager, you will be responsible for:</strong></p><ul> <li>Regularly interacting with new and existing customers who are dynamic and enthusiastic about our products.</li> <li>Utilizing your proactive, 'hunter' approach to initiate contact with potential clients and explore new sales opportunities.</li> <li>Effectively presenting our value proposition to decision-makers and key personnel within organizations.</li> <li>Managing a pipeline of opportunities in Hubspot, and maintaining regular communication on progress and status.</li> <li>Identifying prospects who can act as public advocates for CloudLinux (e.g., through testimonials, case studies).</li> <li>Working in sync with company leadership to identify and pursue new market opportunities.</li> <li>Collaborating with SEs and Customer Success Managers to ensure successful customer adoption and onboarding.</li> </ul><p><strong>Requirements</strong></p><p><strong>To be successful in this role you should have:</strong></p><ul> <li>Proven track record of closing high-value sales and achieving quick sales cycles in the past 3-5 years</li> <li>In-depth understanding of Linux infrastructure and/or security software in the hosting industry</li> <li>Exceptional communication, organization, collaboration, and attention to detail</li> <li>Ability to effectively handle multiple tasks and prioritize them</li> <li>Demonstrated ability to build and maintain strong relationships, mitigate risks, and successfully close deals</li> <li>Familiarity with Hubspot is a plus</li> <li>Fluency in English</li> <li>A \"Hunter Personality\" with strong initiative and drive to pursue new sales leads and business opportunities</li> <li>Passionate and knowledgeable about technology, especially in the hosting and Linux domains</li> <li>Proficient in data entry tasks with a focus on upselling and cross-selling</li> </ul><p><strong>Benefits</strong></p><p><strong>What's in it for you?</strong></p><ul> <li>A focus on professional development; </li> <li>Interesting and challenging projects</li> <li>Flexible working hours</li> <li>Paid one month vacation per year and unlimited sick leave</li> <li>Medical insurance reimbursement</li> <li>Co-working and gym/sports reimbursement</li> <li>The opportunity to receive a reward for the most innovative idea that the company can patent</li> </ul><p><em>By applying for this position, you agree with </em><a href=\"https://cloudlinux.com/privacy-policy\" rel=\"nofollow noreferrer noopener\" class=\"external\"><em>Cloudlinux Privacy Policy</em></a><em> and give us your consent to maintain and process your personal data with this respect. Please read our Privacy Policy for more information.</em></p>","tags":"[]","pubDate":"2025-05-05T00:00:00.000Z","link":"https://apply.workable.com/j/FAC0194009","slug":"business-development-manager-for-hosting-worldwide-remote-cloudlinux-7118"},{"id":2054665049,"title":"Business Development Manager for Hosting - (Worldwide REMOTE)","company":"CloudLinux","image":"https://avatars.githubusercontent.com/u/16290369?s=200&v=4","description":"<p>CloudLinux is a leading global, remote-first company specializing in high volume, low-cost Linux infrastructure and security products. We prioritize our employees, embrace remote working, and are committed to doing the right thing. Our team is collaborative and supportive, ensuring everyone's success and making CloudLinux a great place to work.</p><p>We are seeking an experienced hosting sales professional with a background in selling Linux products. As a Business Development Manager at CloudLinux, you will play a key role in driving our sales initiatives and expanding our presence in the hosting sector. You will have the opportunity to work with exciting and dynamic customers, requiring a proactive and engaging approach.</p><p>Join us to be part of a company that is not just about business, but about making a meaningful impact in the Linux and hosting industry. At CloudLinux, you'll be part of a team that supports each other and collaborates towards shared success.</p><p><strong>As our Business Development Manager, you will be responsible for:</strong></p><ul> <li>Regularly interacting with new and existing customers who are dynamic and enthusiastic about our products.</li> <li>Utilizing your proactive, 'hunter' approach to initiate contact with potential clients and explore new sales opportunities.</li> <li>Effectively presenting our value proposition to decision-makers and key personnel within organizations.</li> <li>Managing a pipeline of opportunities in Hubspot, and maintaining regular communication on progress and status.</li> <li>Identifying prospects who can act as public advocates for CloudLinux (e.g., through testimonials, case studies).</li> <li>Working in sync with company leadership to identify and pursue new market opportunities.</li> <li>Collaborating with SEs and Customer Success Managers to ensure successful customer adoption and onboarding.</li> </ul><p><strong>Requirements</strong></p><p><strong>To be successful in this role you should have:</strong></p><ul> <li>Proven track record of closing high-value sales and achieving quick sales cycles in the past 3-5 years</li> <li>In-depth understanding of Linux infrastructure and/or security software in the hosting industry</li> <li>Exceptional communication, organization, collaboration, and attention to detail</li> <li>Ability to effectively handle multiple tasks and prioritize them</li> <li>Demonstrated ability to build and maintain strong relationships, mitigate risks, and successfully close deals</li> <li>Familiarity with Hubspot is a plus</li> <li>Fluency in English</li> <li>A \"Hunter Personality\" with strong initiative and drive to pursue new sales leads and business opportunities</li> <li>Passionate and knowledgeable about technology, especially in the hosting and Linux domains</li> <li>Proficient in data entry tasks with a focus on upselling and cross-selling</li> </ul><p><strong>Benefits</strong></p><p><strong>What's in it for you?</strong></p><ul> <li>A focus on professional development; </li> <li>Interesting and challenging projects</li> <li>Flexible working hours</li> <li>Paid one month vacation per year and unlimited sick leave</li> <li>Medical insurance reimbursement</li> <li>Co-working and gym/sports reimbursement</li> <li>The opportunity to receive a reward for the most innovative idea that the company can patent</li> </ul><p><em>By applying for this position, you agree with </em><a href=\"https://cloudlinux.com/privacy-policy\" rel=\"nofollow noreferrer noopener\" class=\"external\"><em>Cloudlinux Privacy Policy</em></a><em> and give us your consent to maintain and process your personal data with this respect. Please read our Privacy Policy for more information.</em></p>","tags":"[]","pubDate":"2025-05-05T00:00:00.000Z","link":"https://apply.workable.com/j/FAC0194009","slug":"business-development-manager-for-hosting-worldwide-remote-cloudlinux-2646"},{"id":9345857474,"title":"Freelance Writer","company":"IAPWE","image":"https://remotive.com/job/1185979/logo","description":"<p class=\"p1\" style=\"font-variant-numeric: normal; font-variant-east-asian: normal; font-stretch: normal; line-height: normal; color: #000000;\">Our organization is seeking content writers to create articles and blog posts on a variety of topics.</p>\n<p class=\"p1\" style=\"font-variant-numeric: normal; font-variant-east-asian: normal; font-stretch: normal; line-height: normal; color: #000000;\"> </p>\n<p class=\"p1\" style=\"font-variant-numeric: normal; font-variant-east-asian: normal; font-stretch: normal; line-height: normal; color: #000000;\">The rate of pay is $20 per 100 words (this comes out to approximately $100 per article or $50 per hour).</p>\n<p> </p>\n<p class=\"p1\" style=\"font-variant-numeric: normal; font-variant-east-asian: normal; font-stretch: normal; line-height: normal; color: #000000;\">Some topics you may be asked to write about include the following (you can always turn down a topic if you do not feel comfortable writing about it, however if you have experience or expertise in a specific area, please let us know):</p>\n<p> </p>\n<ul class=\"ul1\" style=\"\">\n<li class=\"li1\" style=\"\">Health &amp; beauty</li>\n<li class=\"li1\" style=\"\">Fitness</li>\n<li class=\"li1\" style=\"\">Home Decor</li>\n<li class=\"li1\" style=\"\">Fashion</li>\n<li class=\"li1\" style=\"\">Sports</li>\n<li class=\"li1\" style=\"\">Do it yourself</li>\n<li class=\"li1\" style=\"\">Finance</li>\n<li class=\"li1\" style=\"\">Legal</li>\n<li class=\"li1\" style=\"\">Medical</li>\n<li class=\"li1\" style=\"\">Family/Parenting</li>\n<li class=\"li1\" style=\"\">Relationships</li>\n<li class=\"li1\" style=\"\">Real Estate</li>\n<li class=\"li1\" style=\"\">Restaurants</li>\n<li class=\"li1\" style=\"\">Contracting (plumbing, pool building, remodeling, etc.)</li>\n</ul>\n<p> </p>\n<p><span style=\"color: #000000;\">These are just some of the more general industries and topics that we cover.</span></p>\n<p> </p>\n<p><span style=\"font-weight: 600; color: #000000; letter-spacing: 0.75px;\">Requirements</span><span style=\"color: #000000;\">:</span></p>\n<ul style=\"\">\n<li style=\"\">We ask that all work be completed using a word processor such as Microsoft Word or Open Office</li>\n<li style=\"\">A reliable internet connection and the ability to meet deadlines</li>\n<li style=\"\">Good communication skills and respond in a timely manner to editorial staff when they ask for updates on tasks, etc</li>\n<li style=\"\">Work well as a team member with the rest of our content management and editorial staff</li>\n</ul>\n<p><br><br><em><strong>Note</strong>: Applicants to this job signaled that accessing some writing tasks may require payment.</em></p>\n<img src=\"https://remotive.com/job/track/1185979/blank.gif?source=public_api\" alt=\"\"/>","tags":"[\"REST\"]","pubDate":"2025-05-04T15:01:24.000Z","link":"https://remotive.com/remote-jobs/writing/freelance-writer-1185979","slug":"freelance-writer-iapwe-2045"},{"id":6763483227,"title":"Solutions Engineer","company":"Allium","image":"https://remotive.com/job/2001802/logo","description":"<div class=\"h1\"><strong>Allium makes blockchain data accurate, simple and fast</strong></div>\n<p style=\"min-height: 1.5em;\"> </p>\n<div class=\"h2\"><strong>Blockchain data is hard, messy, and chaotic</strong></div>\n<p style=\"min-height: 1.5em;\">When we started out in late 2021 our thesis was simple - blockchain data, despite it being public and free, was difficult to understand, clunky to access and troublesome to maintain. Answering a simple question like <em>“Who are the biggest Ethereum token holders over time?”</em> requires an engineering team to run their own RPC nodes, ingest the full history of the blockchain, clean the data, transform the data and finally summon a wizard to cast a complex SQL query.</p>\n<p style=\"min-height: 1.5em;\"> </p>\n<div class=\"h2\"><strong>Accessing data is hard because blockchains are optimized for Writes and not Reads</strong></div>\n<p style=\"min-height: 1.5em;\">Why is it so hard? Blockchains have historically been optimized for Writes (getting data onto the blockchain) and less for Reads (getting data OUT of the blockchain). This is because optimization efforts were focused on increasing transaction throughput and building fault tolerant and scalable consensus algorithms. This neglect makes it hard to get data out efficiently and reliably at scale.</p>\n<p style=\"min-height: 1.5em;\"> </p>\n<div class=\"h2\"><strong>Parsing and interpreting blockchain data requires both deep domain expertise and data manipulation</strong></div>\n<p style=\"min-height: 1.5em;\">To quote Tim Roughgarden, Columbia Professor, <a href=\"https://twitter.com/Tim_Roughgarden/status/1512847113599729668\" rel=\"nofollow\" target=\"_blank\"><em><u>“Blockchains are (virtual) computers, not databases.”</u></em></a>  They are Turing machines that support general computations, and anyone can write and deploy their own smart contract for their own use case. This nearly infinite number of use cases leads to the fragmentation of data schemas for different purposes. Standardizing these schemas requires deep domain expertise to turn esoteric technical outputs into clear information for specific concepts like tokens, NFTs, stablecoins and DEXs.</p>\n<p style=\"min-height: 1.5em;\"> </p>\n<div class=\"h2\"><strong>Allium abstracts the complexity with a simple way to query blockchain data</strong></div>\n<p style=\"min-height: 1.5em;\">Allium tames the chaos by ingesting, sanitizing, and standardizing all this data. As of this post, the data we’ve archived across 40+ blockchains is in the petabytes and growing exponentially.</p>\n<p style=\"min-height: 1.5em;\"> </p>\n<div class=\"h2\">Google and Bloomberg had to organize the world's public financial and webpage data, Allium is on a mission to do the same for blockchain data</div>\n<p style=\"min-height: 1.5em;\">This is one of the rare times in history where indexing a giant public dataset is sorely needed by all - similar to what Bloomberg did for financial data and what Google organized for public webpage data. With this indexed data, we are fortunate to support trailblazers in this industry and play some role the industry’s most exciting trends:</p>\n<p style=\"min-height: 1.5em;\"> </p>\n<div class=\"h1\">About our customers</div>\n<p style=\"min-height: 1.5em;\">We serve 2 groups of customers today with the same data but different platform. <strong>Analysts</strong> who need to answer data questions about the blockchain (think BI) and <strong>Engineers</strong> who need highly reliable data queryable in near realtime (think Application backends). Our customers include the biggest institutions <a href=\"https://www.coindesk.com/policy/2024/07/18/visas-data-partner-allium-labs-raises-165m-as-their-new-findings-show-stablecoin-activity-is-back-up/\" rel=\"nofollow\" target=\"_blank\">Visa</a>, Stripe, Grayscale and also the biggest crypto companies such as Phantom, Uniswap. Allium is one of the unique companies in the industry that bridge blockchain and non blockchain worlds.</p>\n<p style=\"min-height: 1.5em;\">Role Overview</p>\n<p style=\"min-height: 1.5em;\">The Solutions Engineer at <a href=\"http://Allium.so\" rel=\"nofollow\" target=\"_blank\">Allium.so</a> works closely with customers to ensure they get the most value from the entire Allium platform. This role is technical, customer-facing, and involves designing custom solutions to meet specific blockchain data needs.</p>\n<p style=\"min-height: 1.5em;\">Responsibilities</p>\n<ul style=\"\">\n<li style=\"\">\n<p style=\"min-height: 1.5em;\">Engage with customers to understand their blockchain data requirements and provide expert guidance on using <a href=\"http://Allium.so\" rel=\"nofollow\" target=\"_blank\">Allium.so</a>'s platform.</p>\n</li>\n<li style=\"\">\n<p style=\"min-height: 1.5em;\">Design and implement tailored data analytics solutions, such as dashboards for transaction trends or custom reports for blockchain metrics.</p>\n</li>\n<li style=\"\">\n<p style=\"min-height: 1.5em;\">Offer ongoing technical support, troubleshooting issues to ensure smooth platform usage.</p>\n</li>\n<li style=\"\">\n<p style=\"min-height: 1.5em;\">Gather customer feedback to inform product improvements and work with product and engineering teams to prioritize new features.</p>\n</li>\n<li style=\"\">\n<p style=\"min-height: 1.5em;\">Create and maintain documentation for customer implementations to support future operations.</p>\n</li>\n</ul>\n<p style=\"min-height: 1.5em;\">Requirements</p>\n<ul style=\"\">\n<li style=\"\">\n<p style=\"min-height: 1.5em;\">2-5 years experience in a similar role.</p>\n</li>\n<li style=\"\">\n<p style=\"min-height: 1.5em;\">A Bachelor's degree in Computer Science, Data Science, Engineering, or a related field, with a Master's degree preferred.</p>\n</li>\n<li style=\"\">\n<p style=\"min-height: 1.5em;\">Strong proficiency in programming languages like Python, SQL, and JavaScript, and experience with data analytics tools.</p>\n</li>\n<li style=\"\">\n<p style=\"min-height: 1.5em;\">2-5 years of experience in data engineering, data analytics, or similar, with a track record of designing customer solutions.</p>\n</li>\n<li style=\"\">\n<p style=\"min-height: 1.5em;\">Excellent communication and interpersonal skills, problem-solving abilities, and project management skills to handle multiple customer projects.</p>\n</li>\n<li style=\"\">\n<p style=\"min-height: 1.5em;\">A solid understanding of blockchain technology and its data structures, with knowledge of data security and privacy best practices as a plus.</p>\n</li>\n</ul>\n<div class=\"h1\">Don't take our word for it, what our customers say about us (<a href=\"https://www.allium.so/blog#love\" rel=\"nofollow\" target=\"_blank\">https://www.allium.so/blog#love)</a></div>\n<div style=\"text-align: center;\"><img src=\"https://app.ashbyhq.com/api/images/user-content/2f62de56-0dd0-4792-90f8-069c5cb51068/585a3023-4036-4ec0-af76-ed3198f80890/image.png\" style=\"max-width: 100%;\" width=\"478.3507080078125\"></div>\n<p style=\"min-height: 1.5em;\"> </p>\n<div class=\"h2\">What some <em>~cool</em> people have to say about us:</div>\n<ul style=\"\">\n<li style=\"\">\n<p style=\"min-height: 1.5em;\"><strong>Mario Gabriele from The Generalist's Future 50 Startup List: </strong><a href=\"https://www.allium.so/post/allium-named-awardee-of-the-generalists-inaugural-future-50-startups\" rel=\"nofollow\" target=\"_blank\">https://www.allium.so/post/allium-named-awardee-of-the-generalists-inaugural-future-50-startups</a></p>\n</li>\n<li style=\"\">\n<p style=\"min-height: 1.5em;\"><strong>Tomasz Tungus from Theory Ventures:</strong> <a href=\"https://tomtunguz.com/allium/\" rel=\"nofollow\" target=\"_blank\">https://tomtunguz.com/allium/</a></p>\n</li>\n<li style=\"\">\n<p style=\"min-height: 1.5em;\"><strong>Bucky Moore from Kleiner Perkins: </strong><a href=\"https://www.kleinerperkins.com/perspectives/allium-series-a/\" rel=\"nofollow\" target=\"_blank\">https://www.kleinerperkins.com/perspectives/allium-series-a/</a></p>\n</li>\n</ul>\n<p style=\"min-height: 1.5em;\"> </p>\n<div class=\"h2\">Ok.. now for some tough love, here are the values we strive for at Allium:</div>\n<ul style=\"\">\n<li style=\"\">\n<p style=\"min-height: 1.5em;\"><strong>Pro Athlete Mindset</strong> - Consistency. Day in and day out, in pursuit of excellence. A win yesterday does not guarantee (or even imply!) a win tomorrow. I hope anyone who supports a failing sports team will feel the pain (<em>cough Man United fan</em>s) of inconsistency</p>\n</li>\n<li style=\"\">\n<p style=\"min-height: 1.5em;\"><strong>Figure It Out &amp; Extreme Ownership</strong> - Every day is unexplored territory. There are new engineering frameworks, new legal docs, new compliance, new sales, new regulations, and new operational procedures every single day. If you don’t know it, learn it. If you can’t learn it, find someone or a product that does it. If you can’t find someone, find someone who can find someone.</p>\n</li>\n<li style=\"\">\n<p style=\"min-height: 1.5em;\"><strong>High Agency</strong> - (One of) the highest commonality between all successful people is their responsiveness, most successful billionaire CEOs still reply to emails within minutes (within working hours). And when you reply, respond fast with effective solutions - and even better, resolutions. If you’re looking for a superpower, you can’t go wrong with responsiveness. Well of course this doesn't make sense when you're an engineer coding in flow, but in general high agency of problem solving gets one very far in life</p>\n</li>\n<li style=\"\">\n<p style=\"min-height: 1.5em;\"><strong>Leading from the Front </strong>- No one is going to listen (and adopt) your suggestion unless you lead by example. It’s one thing to say <em>We need to do XYZ this better </em>&amp; it’s another thing to build an MVP and say <em>“This is the way we should do things”. </em>The proof of work and momentum goes a long way.</p>\n</li>\n<li style=\"\">\n<p style=\"min-height: 1.5em;\"><strong>Strong Opinions On the Future (loosely held) </strong>It is okay to be wrong, but what is not okay is not to have an idea of how a better future should be. Alliumites take pride in trying to improving everything about the company all the time.</p>\n</li>\n<li style=\"\">\n<p style=\"min-height: 1.5em;\"><strong>Sense of (allium) business smell</strong> - There are number of folks who live to eat at Allium, but the Allium smell we are talking about is that we love folks who naturally want to know why and how the work they are doing builds leverage for their teammates and also relates to the business goals</p>\n</li>\n</ul>\n<p style=\"min-height: 1.5em;\"> </p>\n<div class=\"h1\">About the team</div>\n<p style=\"min-height: 1.5em;\">We invite people of all backgrounds (<a href=\"https://www.allium.so/about\" rel=\"nofollow\" target=\"_blank\">https://www.allium.so/about</a>). We have engineers who learnt coding much later in life, who learnt coding on the side, we have engineers who are still in school and we also have engineers who went to the top schools (CMU, Stanford, UIUC, UPenn, Oxford, NUS, Cornell), all are welcome if one comes in with a curious mind and an infectious work ethic.</p>\n<p style=\"min-height: 1.5em;\"> </p>\n<div style=\"text-align: center;\"><img src=\"https://app.ashbyhq.com/api/images/user-content/2f62de56-0dd0-4792-90f8-069c5cb51068/68e40347-6f06-4fcd-a99a-68f539058433/allium team montage.jpeg\" style=\"max-width: 100%;\" width=\"585\"></div>\n<p style=\"min-height: 1.5em;\"> </p>\n<div style=\"text-align: center;\"><img src=\"https://app.ashbyhq.com/api/images/user-content/2f62de56-0dd0-4792-90f8-069c5cb51068/1d38ca35-e23a-4c10-9a8f-8a79993c8cb3/image.png\" style=\"max-width: 100%;\" width=\"452\"></div>\n<p style=\"min-height: 1.5em;\"> </p>\n<div class=\"h2\"><strong>Administrative Benefits</strong></div>\n<p style=\"min-height: 1.5em;\"><strong>Medical, Dental, Vision, Life and AD&amp;D insurance </strong>- US folks get 100% coverage for Gold plans, 80% for dependents</p>\n<p style=\"min-height: 1.5em;\"> </p>\n<p style=\"min-height: 1.5em;\"><em><strong>Note: </strong>The sun never sets on Allium - we hire from any geographical location as long as you are willing to overlap 2 hours overlap on NYC mornings Mon-Thurs from 10am-12pm ET. We have people based in New York, Seattle, Singapore and Australia</em></p>\n<p style=\"min-height: 1.5em;\"> </p>\n<p style=\"min-height: 1.5em;\"><em>All applicants have to answer this pop quiz: \"</em><a href=\"https://www.allium.so/post/how-allium-got-its-name\" rel=\"nofollow\" target=\"_blank\"><em>What is an Allium? What is your favorite Allium?</em></a><em>\". Bonus points for the right pronunciation. </em></p>\n<img src=\"https://remotive.com/job/track/2001802/blank.gif?source=public_api\" alt=\"\"/>","tags":"[\"javascript\",\"python\",\"sql\"]","pubDate":"2025-05-04T04:51:06.000Z","link":"https://remotive.com/remote-jobs/software-dev/solutions-engineer-2001802","slug":"solutions-engineer-allium-3741"}]