[{"id":4793311267,"title":"Technical Support Representative","company":"MixRank","image":"https://pbs.twimg.com/profile_images/378800000147745937/0fac42c12b433bbbd53ff3e15cd6fca4_400x400.png","description":"<p>A Call to Diverse Talents:</p>\n<p>We're particularly interested in welcoming individuals looking to pivot from a traditional software engineering career towards a role that blends technology with customer engagement. If you have a robust engineering background and a passion for the data domain, MixRank offers a unique opportunity to leverage your technical skills in a customer-facing capacity. Join us in our journey to redefine data intelligence and foster lasting relationships with the world's leading companies.</p>\n<p>About the Role: Technical Support Executive</p>\n<p>As a pivotal connector between MixRank and our esteemed enterprise clientele, the Technical Support Executive will manage day-to-day interactions with our key accounts. This role involves handling all customer inquiries, proactive communication regarding new products, updates, bug fixes, and more. Additionally, the Technical Support Executive will collaborate closely with Account Executives to identify opportunities for upsells and cross-sells, besides managing ongoing renewals for our enterprise customers.</p>\n<p>This role is entirely remote, requiring availability during PST work hours.</p>\n<p>Key Responsibilities:</p>\n<p>Facilitate customer onboarding and maintain a comprehensive knowledge base.\nUtilize SQL queries to address common customer inquiries effectively.\nGain expertise in client use cases, database configurations, and more.\nServe as the primary MixRank contact for customer escalations and communications.\nDevelop customer health scores to aid the sales team in renewal forecasts and other sales-related activities.</p>\n<p>Qualifications:</p>\n<p>Outstanding communication skills, both written and oral.\nProficiency in SQL and a solid understanding of database systems.\nProven ability to manage client escalations and serve as the main point of contact for communications.\nExperience in project management, with the ability to allocate engineering resources efficiently and prioritize requests and bug fixes.\nAn innate ability to learn independently and a strong sense of responsibility.</p>\n<p>Why work at MixRank</p>\n<p>MixRank is a data intelligence platform that's backed by YCombinator, 500 Startups, Mark Cuban, and other Silicon Valley investors. Founded in 2011, we started off crawling websites and apps trying to decode tech stacks and what tools/products companies use.\nFast-forward to today, we're now among the top data providers in the world. Our ultra-high frequency datasets make their way into Fortune 500 companies, leading sales intelligence platforms &amp; recruitment solutions, venture capital, private equity and public market firms.\nOur customers are highly data-driven, and are experts at handling billions of records of data. We help provide a world-class data experience, and help our customers focus on their customer experience and outcomes, while we focus on ensuring instant and constant access to high quality, highly refreshed data.\nWe've been a 100% globally distributed company since 2018, spanning 14+ countries. We've been growing consistently 50% year over year the last 5 years. We're not a rocketship nor are we building things at hyperscale. Our focus is on making sure we're doing what's best by our customers, investors, and employees, while building a long-lasting business that teammates that join us would consider investing their life's work into.\nWe offer competitive salaries and remote work benefits, prefer asynchronous communication, and offer a healthy work culture.</p>\n","tags":"[\"management\",\"engineering\",\"database\"]","pubDate":"2024-03-02 05:22:14.298","link":"https://www.ycombinator.com/companies/mixrank/jobs/SG0hpTt-technical-support-representative","savedDate":"2024-03-02 05:22:14.298","slug":"technical-support-representative-mixrank-5116"},{"id":4206347683,"title":"Revenue Operations Manager","company":"SafetyWing","image":"https://pbs.twimg.com/profile_images/1177267684574208000/54eG3WmW_400x400.jpg","description":"<h2>🧘 What we offer</h2> <ul><li><!--block-->Fully remote work environment – work from anywhere globally.&nbsp;</li><li><!--block-->Competitive compensation.</li><li><!--block-->Global coverage with Remote Health and Nomad Insurance.</li><li><!--block-->A minimum of 20 days of compensated time off each year.</li><li><!--block-->Referral bonus - an incentive program rewarding you for helping us find exceptional talent to join our team.</li><li><!--block-->Opportunity to unlock more benefits as your tenure with SafetyWing grows.</li></ul><div><!--block-->We are looking forward to hearing from you!</div> <div><!--block--><strong>SafetyWing</strong> (YC W18) is seeking a R<strong>evenue Operations Manager </strong>eager to craft and implement innovative operational strategies. Your role will ensure that our teams work smoothly towards common goals, dive deep into data for actionable insights, and refine our sales and reporting frameworks.&nbsp;</div><div><!--block--><br></div><div><!--block-->We are on a mission to remove the role of geographical borders as a barrier to equal opportunities and freedom for everyone. And we are doing that by creating simple health, insurance, and retirement products for remote workers worldwide as a replacement for national welfare systems.</div><div><!--block--><br></div> <h2>💻 Your responsibilities will include</h2>  <ul><li><!--block-->Diving deep into our current goals, commissions, and incentives to find and fix misalignments.</li><li><!--block-->Refreshing quotas, compensation plans, and key metrics, ensuring they're in tune with our big-picture goals and crystal clear to everyone.</li><li><!--block-->Optimizing attribution processes to enhance team synergy and accelerate revenue growth.</li><li><!--block-->Leading growth reporting and monthly analysis by providing data, identifying trends, and making proactive recommendations to ensure our reports maintain transparency and hold the team accountable.</li><li><!--block-->Conducting detailed data analyses, including how each channel contributes to our success, to inform strategic decisions.</li><li><!--block-->Perfecting our forecasting methods to achieve highly accurate future predictions.</li><li><!--block-->Integrating our sales tools into a cohesive system that improves efficiency for our team and enhances the customer experience.</li><li><!--block-->Connecting Hubspot with our API to simplify operations for various teams.</li></ul><div><!--block--><br></div> <h2>🧪 We are looking for someone who</h2> <ul><li><!--block-->Has a proven track record of success in a similar Revenue Operations role, demonstrating a history of improving processes, aligning team goals, and driving significant revenue growth.</li><li><!--block-->Is an expert with Hubspot and proficient in Tableau (and other analytics tools).</li><li><!--block-->Understands the importance of aligning business objectives with operational activities, with a knack for using data-driven insights to make impactful recommendations.</li><li><!--block-->Is familiar with working in a fast-paced, rapidly growing startup environment.</li><li><!--block-->Has strong analytical skills, with the ability to conduct comprehensive analyses.</li><li><!--block-->Has excellent communication skills and experience managing cross-functional team communications and ensuring clarity and transparency in all reporting and forecasting activities.</li></ul><div><!--block--><strong>😀 We like to work with people who:</strong></div><ul><li><!--block-->Want to help build a global social safety net on the Internet.</li><li><!--block-->Think for themselves instead of copying others.</li><li><!--block-->Are willing to try new things, even with the risk of failure.</li><li><!--block-->Are intellectually curious and open to new ideas.</li><li><!--block-->Are creative and bold in the face of any problems.</li><li><!--block-->Have strong integrity and do the right thing.</li></ul><div><!--block--><br></div>","tags":"[]","pubDate":"2024-03-02 05:22:14.294","link":"https://safetywing.pinpointhq.com/en/jobs/177425","savedDate":"2024-03-02 05:22:14.294","slug":"revenue-operations-manager-safetywing-2469"},{"id":9669635075,"title":"Technical Data Analyst","company":"SafetyWing","image":"https://pbs.twimg.com/profile_images/1177267684574208000/54eG3WmW_400x400.jpg","description":"<h2>🧘 What we offer</h2> <ul><li><!--block-->Fully remote work environment – work from anywhere globally.&nbsp;</li><li><!--block-->Competitive compensation.</li><li><!--block-->Global coverage with Remote Health and Nomad Insurance.</li><li><!--block-->A minimum of 20 days of compensated time off each year.</li><li><!--block-->Referral bonus - an incentive program rewarding you for helping us find exceptional talent to join our team.</li><li><!--block-->Opportunity to unlock more benefits as your tenure with SafetyWing grows.</li></ul><div><!--block-->We are looking forward to hearing from you!</div> <div><!--block--><strong>SafetyWing</strong> (YC W18) is seeking a <strong>Technical Data Analyst</strong> interested in building a global safety net.</div><div><!--block--><br>We are building a global social safety net, including health and retirement for remote workers worldwide, as a replacement for national welfare systems. If we succeed, we believe this will help ensure freedom and equal opportunity for everyone, and it is one of the more important tasks of our time that no one else is working on.</div><div><!--block--><br><strong>👩‍💻 About this Role</strong></div><div><!--block--><br>You will be part of a small analytics team supporting the organization by creating tools and insights to keep track of the facts and help people work smarter.</div> <h2>💻 Your responsibilities will include</h2>  <ul><li><!--block-->Design and implement visually compelling Tableau dashboards that drive actionable insights.</li><li><!--block-->Streamline and restructure our current Tableau environment, ensuring efficient organization and ease of use.</li><li><!--block-->Vigilantly monitor and validate data consistency across dashboards and reports, ensuring we trust every bit.</li><li><!--block-->Perform complex data transformations using SQL, ensuring our insights are based on the best possible datasets.</li><li><!--block-->Revamp our analytics by transforming raw Google Analytics data into insightful reports. Plus, champion the implementation of effective tracking via Google Tag Manager (GTM).</li></ul><div><!--block--><br></div> <h2>👩‍💻 We are looking for someone who has</h2> <ul><li><!--block-->experience as a data analyst and a deep understanding of popular data analysis tools and data warehouse technologies such as Tableau and Google bigQuery</li><li><!--block-->outstanding analytical skills with the ability to collect, organize, analyze, and disseminate significant amounts of information with attention to detail and accuracy</li></ul><div><!--block-->🤖<strong> Tools we use:</strong></div><ul><li><!--block-->Tableau</li><li><!--block-->Google bigQuery</li><li><!--block-->Python</li><li><!--block-->SQL</li><li><!--block-->Airflow</li></ul><div><!--block--><strong>😀 We like to work with people who:</strong></div><ul><li><!--block-->Want to help build a global social safety net on the Internet.</li><li><!--block-->Think for themselves instead of copying others.</li><li><!--block-->Are willing to try new things, even with the risk of failure.</li><li><!--block-->Are intellectually curious and open to new ideas.</li><li><!--block-->Are creative and bold in the face of any problems.</li><li><!--block-->Have strong integrity and do the right thing.</li></ul><div><!--block--><br></div>","tags":"[]","pubDate":"2024-03-02 05:22:14.294","link":"https://safetywing.pinpointhq.com/en/jobs/177969","savedDate":"2024-03-02 05:22:14.294","slug":"technical-data-analyst-safetywing-7784"},{"id":3824358610,"title":"SRE: Security Focus","company":"Supabase","image":"https://pbs.twimg.com/profile_images/1651226564728700928/h0tz5UT1_400x400.jpg","description":"\n    <div class=\"content-intro\"><p><img src=\"https://pbs.twimg.com/media/FIdU8GJWQAUGWRA?format=jpg&amp;name=small\" alt=\"Join Supabase\" width=\"680\" height=\"453\"></p></div>\n\n    <p>Supabase is an Open Source and fully remote company building developer tools for databases.</p>\n<p>We are seeking an experienced Site Reliability Engineer to manage the security of our hosted cloud offering, which currently serves over 1M Postgres instances and is growing at a rate of 10% each month. We are custodians of user data and securing their data is fundamental in ensuring users continue to trust us.</p>\n<p>You will:</p>\n<ul>\n<li>Help secure the Supabase Cloud offering.</li>\n<li>Constantly improve the baseline security of the product suite by evaluating them from a security-centric perspective and making it part of our software development lifecycle</li>\n<li>Investigate, triage and mitigate attacks on our platform.</li>\n<li>Improve our SOC2 and GDPR offering by building out security features like network restrictions, audit logs, etc.</li>\n<li>Work on our auditor on our annual SOC2 and HIPAA audits</li>\n<li>Collaborate with external penetration testers and engage in ethical hacking to identify vulnerabilities in our system, while conducting regular security audits.</li>\n<li>Oversee our Mobile Device Management (MDM) and manage endpoint security operations.</li>\n<li>Implement and maintain intrusion detection, automated remediation and patch management systems.</li>\n</ul>\n<p>You are:</p>\n<ul>\n<li>Passionate about cybersecurity with a keen interest in breaking systems</li>\n<li>The role is going to be SRE heavy but you will also be working with Golang, Typescript, etc for some aspects of the role.</li>\n<li>5+ years working in the security or SRE domain</li>\n<li>Knowledge of regulatory compliance requirements like SOC2, HIPAA and ISO 27001</li>\n<li>Experience in configuration, troubleshooting and maintenance of the security infrastructure of a fast-growing company</li>\n</ul>\n<p><strong>We offer:</strong></p>\n<ul>\n<li>100% remote work from anywhere in the world. No location-based adjustment to your salary.</li>\n<li>ESOP (equity ownership in the company)</li>\n<li>Autonomous work. We work collaboratively on projects, but you set your own pace.</li>\n<li>Health, Vision and Dental benefits. Supabase covers 100% of the cost for employees and 80% for dependents</li>\n<li>Tech Allowance for any office setup you need&nbsp;</li>\n<li>Annual Education Allowance ($1000)</li>\n<li>Annually run off-sites.</li>\n</ul>\n<p>&nbsp;</p>\n\n    \n\n    <div class=\"content-conclusion\"><h3>BUILD IN A WEEKEND. SCALE TO BILLIONS</h3>\n<p>Supabase adds auth, realtime, and restful APIs to Postgres without a single line of code.</p>\n<p>Each project within Supabase is an isolated&nbsp;Postgres cluster, allowing customers to scale independently, while still providing the features that you need to build: instant database setup, auth, row level security, realtime data streams, auto-generating APIs, and a simple to use web interface.</p>\n<p>We are a fully remote company.</p>\n<p>Key Tech: Javascript, Typescript, Go, Elixir, PostgREST (haskell), Postgres, Pulumi.</p>\n<h3><a id=\"about-the-team\" class=\"anchor\"></a>About the team</h3>\n<ul>\n<li>We're a startup. It's unstructured.</li>\n<li>Collectively founded more than a dozen venture-backed companies.</li>\n<li>More than 10 different nationalities.</li>\n<li>We deeply believe in <a href=\"https://supabase.com/blog/2022/03/25/should-i-open-source-my-company\" target=\"_blank\">the efficacy of collaborative open source</a>. We support existing communities and tools, rather than building \"yet another xx\".</li>\n<li>We \"dogfood\" everything. If you use it in your project, we use it in Supabase.</li>\n</ul>\n<h2><a id=\"process\" class=\"anchor\"></a>Process</h2>\n<ul>\n<li>The entire process is fully remote and all communication will happen over email or via video chat.</li>\n<li>Once you've submitted your application, the team will review your submission, and may reach out for a short screening interview over video call.</li>\n<li>If you pass the screen you will be invited to up to four follow up interviews. The calls:\n<ul>\n<li>usually take between 20-45 minutes each depending on the interviewer.</li>\n<li>are all 1:1.</li>\n<li>will be with both founders, a member of either the growth or engineering team (depending on the role), and usually one other person from your immediate team or function.</li>\n</ul>\n</li>\n<li>Once the interviews are over, the team will meet to discuss several roles and candidates and may:\n<ul>\n<li>ask one or two follow-up questions over email or a quick call.</li>\n<li>go directly to making an offer.</li>\n</ul>\n</li>\n</ul>\n<h2>&nbsp;</h2></div>\n","tags":"[\"postgres\",\"pulumi\",\"javascript\",\"typescript\",\"elixir\",\"management\",\"engineering\",\"database\"]","pubDate":"2024-03-02 05:22:14.293","link":"https://boards.greenhouse.io/supabase/jobs/5094802004","savedDate":"2024-03-02 05:22:14.293","slug":"sre-security-focus-supabase-6829"},{"id":5958880583,"title":"Senior Front-end Developer (A)","company":"Blue Coding","image":"https://lever-client-logos.s3.us-west-2.amazonaws.com/3c1d9ac7-6738-46c5-b6ca-a35fa2a0df57-1666278594128.png","description":"<div><i style=\"font-size: 18px\">Do you want to earn a salary in USD?&nbsp;</i></div><div><i style=\"font-size: 18px\">Would you like to work from wherever you want?</i></div><div><i style=\"font-size: 18px\">Would you like to be a part of the leading next-gen software developers?&nbsp;</i></div><div><br></div><div><b style=\"font-size: 24px\">Hi, you finally found us!</b><span style=\"font-size: 24px\">&nbsp;</span></div><div><br></div><div><b style=\"font-size: 24px\">Why work at Blue Coding?</b><span style=\"font-size: 24px\">&nbsp;</span></div><div><br></div><div>At Blue Coding we specialize in hiring excellent developers and amazing people from all over Latin America and other parts of the world. For the past 9 years, we’ve helped cutting-edge companies in the United States and Canada -both large and small, build great development teams and develop great products. Online shops, digital agencies, SaaS providers, and software consulting firms are a few of our clients. Our team of over 100 engineers is distributed in more than 10 countries across the Americas. We are a fully remote company working with a wide array of technologies and have expertise in every stage of the software development process.&nbsp;&nbsp;</div><div><br></div><div>Our team is highly connected, united, and culturally diverse, and our collaborators are involved in many initiatives around the world, from wildlife preservation to volunteering at local charities. We also participate in group activities like movie nights, trivia, and meme competitions. We stand for honesty, fairness, respect, efficiency, hard work, and cooperation.</div><div><br></div><div><b style=\"font-size: 18px\">What are we looking for?</b></div><div><br></div><div><span style=\"font-size: 16px\">In this opportunity, we are looking for a Senior FrontEnd Developer to work with one of our foreign clients, who is a market leader in the consultation, design, procurement, implementation, and ongoing managed services for technology services for mid to large global enterprises. As a Telecom Managed Service company, they partner with over 300 service providers globally to help customers with technology design and find the best solutions to meet their needs.</span></div><div><br></div><div><span style=\"font-size: 16px\">If you are independent, a great communicator, a problem solver, and have strong attention to detail, this is a great fit for you! Our jobs are fully remote – as long as you have the skills and can get the work done well, you can work anywhere in the listed countries you want.</span></div><div><span style=\"font-size: 16px\">If you have the skills and can get the job done, join us and work from anywhere you want!</span></div><div><br></div><div><b style=\"font-size: 13pt\">What's unique about this job?</b></div><div><br></div><div><span style=\"font-size: 16px\">As a Senior FrontEnd Developer, you’ll be part of a massive migration, rebuilding, and rewriting of our client's existing application working alongside a top-of-the-line team creating this application from the ground up to transition it to modern languages and practices.  This transition will be divided into 5 phases and post-launch support and iteration. This is a very long-term project.</span></div><div><br></div><div><span style=\"font-size: 16px\">The platform supports all business functions from sourcing and pricing, purchasing, implementation and project management, customer lifecycle management, incident management, financial management, expense management, and business process automation and integrations. This is written in Coldfusion running on Lucee with ColdBox. About half of the source code has been refactored into an MVC framework while other pages may still be in a single file approach. There is some code that is still tag-based but much of this has been migrated to a script-based code structure.</span></div><div><br></div><div><span style=\"font-size: 16px\">As the platform is rebuilt, the client will be implementing a new UI based on their design standards which are based on Bootstrap 5. Additionally, they will deprecate certain functionality or data points from the application to streamline the User Experience and better align with how the company operates various parts of the business.</span></div><h3>Here are some of the exciting day-to-day challenges you will face in this role:</h3><li>You'll participate in doing a transition and migrate all existing functionality from Ruby to .Net Core MVC.</li><li>All of the migration will be done using Agile methodologies and Scrum.</li><li>Rebuilding the UI based on the client's design standards which are based in Bootstrap 5.</li><li>Build out and maintain the CSS and core JS files to support the developers in implementing the code in .NET</li>,<h3>You will shine if you have:</h3><li>Strong hands-on experience with HTML, CSS, and Javascript.</li><li>Experience with Agile methodologies such as Scrum, and Kanban.</li><li>Experience with cloud environments like Azure or similar.</li><li>Knowledge or experience working or reading React, Typescript, C# and .NET code is  plus.</li>,<h3>Here are some of the perks we offer you:</h3><li>Salary in USD</li><li>Long-term</li><li>Flexible schedule (within US Time zones)</li><li>100% Remote</li><div><b style=\"font-size: 24px\">Hey, you are still here!</b><span style=\"font-size: 24px\">&nbsp;</span></div><div><br></div><div>So, let us ask a few questions. Do you like working in a friendly environment? Are you fluent in English? Do you have a strong work ethic, are detail-oriented and have an ownership mentality? And most importantly do you love music and puppies? If so, then what are you waiting for? Come join our team and become part of this awesome company! We will be expecting you.</div>","tags":"[\"javascript\",\"typescript\",\"management\"]","pubDate":"2024-03-01 21:38:22.920","link":"https://jobs.lever.co/bluecoding/5690d472-9e8e-468a-b8f5-961b3a655acd","savedDate":"2024-03-02 05:22:14.307","slug":"senior-front-end-developer-a-blue-coding-2116"},{"id":8300366485,"title":"Social Media & Influencer Specialist (Japan)","company":"Airalo","image":"https://lever-client-logos.s3.us-west-2.amazonaws.com/55028a36-609c-479c-9553-d4689ff2dd8c-1669620566663.png","description":"<div><b>About Airalo</b></div><div>Alo! Airalo is the world’s first eSIM store that helps people connect in over 200+ countries and regions across the globe. We are building the next digital service that revolutionizes the telecom industry. We are a travel-tech company and an equal-opportunity environment that values and executes diversity, inclusion, and equity. Our team is spread across 40+ countries and six continents. What glues us together is our commitment to changing the way you connect<span style=\"font-size: 13.3333px\">. </span></div><div><br></div><div><b>About you</b></div><div>We hope that you care deeply about the quality of your work, the intrinsic worth of tasks, and the success of your team. You are self-disciplined and do not require micromanagement in terms of your skillset and work ethic. You do your best to flourish as an individual every day while working hard to foster a collaborative team environment. You believe in the importance of being — and staying — authentic, honest, positive, and kind. You are a good interlocutor with clear and concise communication. You are able to manage multiple projects, have an analytical mind, pay keen attention to detail, and love to get your hands dirty. You are cognizant, tolerant, and welcoming of vulnerabilities and cultural differences.</div><div><br></div><div><b>About the Role</b></div><div><b>Position</b>: Full-time / Employee</div><div><b>Location:</b>&nbsp;Remote-first </div><div><b>Benefits:</b>&nbsp;Health Insurance, work-from-anywhere stipend, annual wellness &amp; learning credits, annual all-expenses-paid company retreat in a gorgeous destination &amp; other benefits</div><div><br></div><div>As a <b>Social Media &amp; Influencer Specialist,</b> you will be responsible for guiding the strategy and development of our entire social media ecosystem and influencer relations across <b>Japan</b>, including creative content, community engagement, and growth.</div><div>Reporting to the <b>Director of Growth</b>; this role will lead our social media channels and influencer relations within <b>Japan</b> to develop a best-in-class social media and influencer program. You will play a pivotal role in shaping the brand's online presence and expanding our reach across social media platforms. With a strong understanding of storytelling, brand, and design, you'll lead the end-to-end process of social media and influencer campaigns, including the ability to plan, curate, and tailor engaging content and copy for different social channels and audiences.</div><h3>Responsibilities include but are not limited to:</h3><li><b>Social Media Strategy:</b> Develop and execute an effective social media strategy tailored to your market to increase brand awareness, engagement, and growth.</li><li><b>Content Creation: </b></li><li>Create compelling and shareable social media content, including text, images, videos, and infographics,       aligning with Airalo's brand voice and values.</li><li>Develop and execute strategies on social media channels and other region-specific community platforms.</li><li><b>Community Engagement:</b> Monitor and actively engage with the Airalo community on social media platforms, responding promptly to comments, questions, and feedback, and fostering positive relationships with followers.</li><li><b>Influencer Strategy Development:</b> Collaborate to develop and execute influencer marketing strategies aligned with Airalo's goals and target audience.</li><li><b>Influencer Identification and Recruitment:</b> Identify and establish partnerships with relevant influencers and content creators who align with Airalo's brand values and target audience.</li><li><b>Campaign Planning:</b> Create and manage end-to-end influencer marketing campaigns, including content ideation, production, and distribution across various social media platforms.</li><li><b>Content Collaboration:</b> Collaborate with influencers to create authentic and engaging content showcasing Airalo's products and services.</li><li><b>Performance Analysis:</b> Monitor and analyze the performance of influencer marketing campaigns, providing insights and recommendations for optimization.</li>,<h3>Must-haves:</h3><li>Bachelor’s degree with a strong similar professional background &amp; 3+ years experience in a similar capacity</li><li>Extensive experience in brand management, content, social media, and customer and market insight in <b>Japan</b> with an in-depth understanding of the social and digital space</li><li>Excellent knowledge of Facebook, Twitter, LinkedIn, Instagram, Snapchat, TikTok, YouTube, and any Regional Social Media channels while keeping abreast of social media best practices, and regional and global trends</li><li>Fluency in <b>Japanese</b> and English, with impeccable verbal and written communication skills</li><li>Experience with executing and implementing channel and audience research</li><li>Superior internal &amp; external communication &amp; cross-functional stakeholder management skills</li><li>Enjoying and excelling at handling multiple projects simultaneously in a matrix &amp; complex environment</li><li>Good time management with an eye for perfection &amp; a strong operational background</li><li>Ability to write your own copy</li>,<h3>Good to have:</h3><li>Prior experience in the tech, travel, or telecommunications industry</li><li>Certificates and courses in digital marketing and research methods</li><li>Knowledge of eSIM and GSMA-related technologies and services</li><div>If you are interested in this position, please<b> apply via the link.</b></div><div><br></div><div><i>We sincerely thank all applicants in advance for submitting their interest in this opportunity with Airalo. </i></div>","tags":"[\"management\"]","pubDate":"2024-03-01 15:35:54.444","link":"https://jobs.lever.co/airalo/b09f00ba-0731-4292-bb6b-9fa83501eebc","savedDate":"2024-03-02 05:22:14.303","slug":"social-media-influencer-specialist-japan-airalo-7316"},{"id":1154607692,"title":"Enterprise Support Specialist - CentOS, EOL - REMOTE/ Work Anywhere","company":"CloudLinux","image":"https://pbs.twimg.com/profile_images/696718028084482050/ymY3OEPk_400x400.png","description":"<p>We are looking for a seasoned Level 3/4 Technical Support Specialist with over 15 years of experience to provide advanced technical support for various Linux distributions, including CentOS, and other popular distros. This role demands extensive knowledge of Linux environments, particularly CentOS Extended Lifecycle Support (ELS) for versions 6, 7, and 8, across x86, x64, and ARM architectures. The ideal candidate must be adept at managing high and critical CVEs and comfortable in English-speaking conference calls. This role will require some 24x7 “on-call” support and weekends.</p><p></p><p><strong>As our L3 Technical Support Engineer you will:</strong></p><ul> <li>Offer expert-level technical support for CentOS and other Linux distributions, addressing complex issues across diverse versions and architectures.</li> <li>Lead the installation and configuration of Linux environments, ensuring optimal setup for various distributions.</li> <li>Evaluate alternative solutions for EOL Linux distributions, guiding clients towards the most suitable replacements.</li> <li>Manage release planning and testing for multiple Linux distributions, including CentOS.</li> <li>Provide scalability guidance for Linux-based systems, ensuring efficient growth and adaptation to increased demands.</li> <li>Implement upgrades and patches across various Linux distributions, maintaining system security and up-to-date functionality.</li> <li>Conduct CVE impact assessments for Linux environments, recommending appropriate mitigation strategies.</li> <li>Perform risk assessments for system migrations, focusing on potential challenges and solutions.</li> <li>Assist in integration and performance optimization for a range of Linux distributions.</li> <li>Guide clients on containerization strategies and Linux-specific best practices.</li> <li>Handle feature and functionality queries for Linux systems, clarifying capabilities and potential configurations.</li> </ul><h3>Requirements: </h3><p><strong>To be successful you should have;</strong></p><ul> <li>Bachelor's degree in Computer Science, Information Technology, or related field.</li> <li>At least 10 years of experience in technical support or system architecture, with a strong focus on Linux systems, including Fedora and Debian-based distributions.</li> <li>Comprehensive knowledge of Linux environments and architectures (x86, x64, ARM).</li> <li>Experience in managing high and critical CVEs within Linux systems.</li> <li>Strong experience with Open-source software.</li> <li>Some experience in backporting patches and updates for Linux distributions.</li> <li>Experience working with package managers and repositories</li> <li>Exceptional problem-solving, analytical, and technical skills.</li> <li>Excellent communication and customer service skills, proficient in English for conference calls and emails/documentation; native or fluent level.</li> <li>Should be able to work some&nbsp; 24x7 “on-call” support and weekends. </li> </ul><h3>Benefits: </h3><p><strong>What's in it for you?</strong></p><ul> <li>A focus on professional development; </li> <li>Interesting and challenging projects</li> <li>Flexible working hours</li> <li>Paid one month vacation per year and unlimited sick leave</li> <li>Medical insurance reimbursement</li> <li>Co-working and gym/sports reimbursement</li> <li>The opportunity to receive a reward for the most innovative idea that the company can patent</li> </ul><p><em>By applying for this position, you agree with </em><a href=\"https://cloudlinux.com/privacy-policy\" rel=\"nofollow noreferrer noopener\" class=\"external\"><em>Cloudlinux Privacy Policy</em></a><em> and give us your consent to maintain and process your personal data with this respect. Please read our Privacy Policy for more information.</em></p>","tags":"[]","pubDate":"2024-03-01 00:00:00.000","link":"https://apply.workable.com/cloudlinux-1/j/BD53B6C55A","savedDate":"2024-03-02 05:22:14.298","slug":"enterprise-support-specialist-centos-eol-remote-work-anywhere-cloudlinux-5268"},{"id":8838420604,"title":"Product Manager - Contracts and Ecosystems","company":"OpenZeppelin","image":"https://remotive.com/job/1898376/logo","description":"<div class='\"content-intro\"'><div class=\"h3\"><strong>About us</strong></div>\n<p><span style='\"font-weight:'>Founded in 2015 with the mission to protect the open economy, OpenZeppelin is the world leader in securing blockchain applications and smart contracts. </span></p>\n<p><span style='\"font-weight:'>Its bedrock open source Contract Libraries are a public good and industry standard for smart contract development. </span></p>\n<p><span style='\"font-weight:'>OpenZeppelin’s professional expertise, unified with the Defender developer security platform, integrates through clients’ development lifecycles, so teams can plan, code, audit, deploy and operate projects faster and more safely.</span></p>\n<p><span style='\"font-weight:'><strong>Please note:</strong> Always refer to OpenZeppelin's official job page for the most accurate information about our open roles, as we have seen multiple third party job sites posting inaccurate information.</span></p></div><div class=\"h3\"><strong>The Product Team ❤️<br></strong></div>\n<p><span style='\"font-weight:'>Our product team is responsible for the strategy, planning, launch, and adoption of the different OpenZeppelin products. This role will be focused on adoption and helping developers thrive using the full OpenZeppelin stack. It will require experience and skills in go-to-market, product marketing, and developer relations, as well as product management.</span></p>\n<p><span style='\"font-weight:'>The Product team works closely with all the functions in order to achieve our goal of protecting the open economy by enabling developers and companies to securely code, audit, deploy, and operate smart contracts. We put a strong emphasis on user experience and analytics, and we love to experiment!</span></p>\n<div class=\"h3\"><strong>What you'll be doing</strong></div>\n<ul style=\"\">\n<li style=\"\"><span style='\"font-weight:'>Craft and execute the product vision to make OpenZeppelin’s products complementary to each other.</span></li>\n<li style=\"\"><span style='\"font-weight:'>Design and ship the OpenZeppelin Contracts roadmap for investments in Solidity, Cairo, and the future, including managing OpenZeppelin’s partnerships and ecosystem strategy.</span></li>\n<li style=\"\"><span style='\"font-weight:'>Ship open source products, templates, libraries, and prototypes at a high velocity with the Contracts engineering team and Developer Relations.</span></li>\n<li style=\"\"><span style='\"font-weight:'>Identify and prioritize products that grow the ecosystem and empower more developers to build compelling smart contract applications using Contracts and Defender.</span></li>\n<li style=\"\"><span style='\"font-weight:'>Develop and execute a cohesive marketing strategy for the full OpenZeppelin stack.</span></li>\n<li style=\"\"><span style='\"font-weight:'>Live and breathe the customer experience by talking to our users every day, researching the smart contract development market, and incorporating learnings into the product and marketing strategy.</span></li>\n<li style=\"\"><span style='\"font-weight:'>Define and maintain metrics and counter metrics to determine the success of our ecosystem products and marketing efforts</span></li>\n</ul>\n<div class=\"h3\"><strong>You have</strong></div>\n<ul style=\"\">\n<li style=\"\"><span style='\"font-weight:'>Hands-on and practical experience of at least 5 years as a Product Manager and/or Product Marketing Manager.</span></li>\n<li style=\"\"><span style='\"font-weight:'>Been in the market already as a professional or hobbyist, spending time each day understanding web3 and smart contract applications, including technical details.</span></li>\n<li style=\"\"><span style='\"font-weight:'>Shipped products to millions of users and/or thousands of developers, and your track record shows a keen sense of design and painstaking attention to detail.</span></li>\n<li style=\"\"><span style='\"font-weight:'>Worked in an organization that delivers multiple products, and you’ve designed complementary offerings. You’ve seen these products go from zero to wide adoption.</span></li>\n<li style=\"\"><span style='\"font-weight:'>Communication skills, able to write about complex topics accurately, precisely, and simply for millions of readers to consume.</span></li>\n<li style=\"\"><span style='\"font-weight:'>A team player attitude and you know that producing great results takes a team. You defend your decisions but welcome feedback and are able to work collaboratively in a distributed team.</span></li>\n<li style=\"\"><span style='\"font-weight:'>High self-motivation, able to make decisions and relish owning the journey of your work from concept through to use by our customers.</span></li>\n</ul>\n<div class=\"h3\"><strong>Nice to have</strong></div>\n<ul style=\"\">\n<li style=\"\"><span style='\"font-weight:'>Experience in security software products.</span></li>\n<li style=\"\"><span style='\"font-weight:'>Working in a startup.</span></li>\n<li style=\"\"><span style='\"font-weight:'>Experience managing Web3 products.</span></li>\n</ul>\n<div class=\"h3\"><strong>Logistics:</strong></div>\n<p><span style='\"font-weight:'>The interview process takes place on Zoom and will consist of the following stages:</span></p>\n<ul style=\"\">\n<li style=\"\"><span style='\"font-weight:'>Recruiter Call (45 mins)</span></li>\n<li style=\"\"><span style='\"font-weight:'>Team Interview (45 mins)</span></li>\n<li style=\"\"><span style='\"font-weight:'>Hiring Manager Call (45 mins)</span></li>\n<li style=\"\"><span style='\"font-weight:'>Leadership Interview (30 mins)</span></li>\n<li style=\"\"><span style='\"font-weight:'>Reference checks</span></li>\n</ul><div class='\"content-conclusion\"'><section class='\"j-content\"'>\n<div class='\"container\"'>\n<div class=\"h3\"><strong>Benefits</strong></div>\n<ul style=\"\">\n<li style=\"\"><span style='\"font-weight:'>Unlimited holidays 🏝</span></li>\n<li style=\"\"><span style='\"font-weight:'>Fully remote: your way of working 🌎</span></li>\n<li style=\"\"><span style='\"font-weight:'>Paid parental leave &amp; benefits for primary or second caregiver 💙</span></li>\n<li style=\"\"><span style='\"font-weight:'>Company retreats in different locations around the world 😎</span></li>\n<li style=\"\"><span style='\"font-weight:'>Work from home office equipment stipend of up to $500 USD 🪑</span></li>\n<li style=\"\"><span style='\"font-weight:'>Monthly allowance for wellness activities 💪</span></li>\n<li style=\"\"><span style='\"font-weight:'>Coworking: access to a coworking space of your choice 👩‍💻</span></li>\n<li style=\"\"><span style='\"font-weight:'>Learning: technical training; spoken language lessons in any language of your choice (using Italki) 🗣</span></li>\n<li style=\"\"><span style='\"font-weight:'>Working with a global team in a fast-growing industry 🚀</span></li>\n</ul>\n<p class='\"job-description\"'><span style='\"font-family:'><span style='\"font-weight:'>At </span><strong>OpenZeppelin</strong><span style='\"font-weight:'>, we are an equal opportunity employer and we value different perspectives. We are committed to building a diverse workforce. This includes but is not limited to gender, race, sexual orientation, religion, national origin and other characteristics that make each one of us unique. In this uniqueness, we find the most value. Come join us!</span></span></p>\n<p> </p>\n</div>\n</section></div><img src=\"https://remotive.com/job/track/1898376/blank.gif?source=public_api\" alt=\"\"/>","tags":"[\"product marketing\",\"product management\",\"analytics\"]","pubDate":"2024-02-29 17:21:36.000","link":"https://remotive.com/remote-jobs/product/product-manager-contracts-and-ecosystems-1898376","savedDate":"2024-03-02 05:22:14.291","slug":"product-manager-contracts-and-ecosystems-openzeppelin-7076"},{"id":1646737223,"title":"Global Mobility Agent","company":"Jobbatical","image":"https://remotive.com/job/1899134/logo","description":"<p><br><br></p>\n<div class=\"h3\">Company Description</div>\n<p><strong>Moving to a new country is as easy as booking a flight!</strong></p>\n<p>Jobbatical is using AI and automation to make the employee visa and relocation process faster and less expensive, so businesses can hire whoever they want, from wherever they want. Jobbatical today is the go-to immigration and relocation partner for tech startups and traditional companies alike. Our team is on a mission to make moving to a new country as easy as booking a flight. The best way to do that is by making the hardest part of relocating to another country – immigration – ridiculously easy. </p>\n<p>We help clients like N26, Pipedrive, and Travelperk to relocate people to 30+ countries and are backed by some of the best investors in the world including Union Square Ventures, Inventure, Karma VC, Swiss Post Ventures, et al.</p>\n<p>We’re looking for a Global Mobility Agent who will help the Global Mobility Team to make immigration and relocation process as smooth and seamless for our talents as possible. You can work remotely.</p>\n<p><br><br></p>\n<div class=\"h3\">Job Description</div>\n<p><strong>Your responsibility areas:</strong></p>\n<ul style=\"\">\n<li style=\"\">assisting and managing Spanish relocation cases, including designing relocation process, preparing immigration-related documentation, arranging consultants to accompany in-person immigration appointments, communicating with partners, clients, talents, Embassies and Government institutions</li>\n<li style=\"\">assisting in immigration and relocation-related projects </li>\n<li style=\"\">updating and keeping up to date our platform with regard to the activities that you are assigned</li>\n<li style=\"\">supporting the Global Mobility Team with the adequate tasks that they need help with </li>\n<li style=\"\">support our clients with accommodation search</li>\n<li style=\"\">a point of contact for our external partners</li>\n<li style=\"\">preparing immigration-related forms and letters</li>\n<li style=\"\">preparing materials for consultation of our clients with settle-in processes</li>\n</ul>\n<p><br><br></p>\n<div class=\"h3\">Qualifications</div>\n<p><strong>What helps you to succeed in this role:</strong></p>\n<ul style=\"\">\n<li style=\"\">you are a fluent communicator in<strong> English and Spanish language in B2 level.</strong> Other languages are a plus</li>\n<li style=\"\">you are comfortable with working remotely</li>\n<li style=\"\">you are tech savvy</li>\n<li style=\"\">you know how to prioritise &amp; focus &amp; get things done </li>\n<li style=\"\">natural ability to connect with foreign talent and empathize with their struggles</li>\n<li style=\"\">independent working style</li>\n<li style=\"\">attention to detail</li>\n<li style=\"\">you like to communicate with people and can explain complicated things in an understandable way</li>\n</ul>\n<p><strong>You get some extra points if you have:</strong></p>\n<ul style=\"\">\n<li style=\"\">some knowledge of the immigration and settle-in processes</li>\n<li style=\"\">experience in a client-facing position</li>\n<li style=\"\">experience in multicultural and international environments</li>\n<li style=\"\">lived abroad and understand what the challenges that the talents relocating are facing</li>\n</ul>\n<p><br><br></p>\n<div class=\"h3\">Additional Information</div>\n<p>Our Global Mobility team is made of awesome people!</p>\n<p><strong>Our offer to you includes:</strong></p>\n<ul style=\"\">\n<li style=\"\">Great compensation package with company options</li>\n<li style=\"\">Possibility to work with passionate professionals</li>\n<li style=\"\">International challenges that grow your knowledge and skills</li>\n<li style=\"\">Extra working days as annual holiday days</li>\n<li style=\"\">Any hardware necessary: Mac, headphones, etc</li>\n<li style=\"\">Flexible Work. Work from home or office</li>\n<li style=\"\">Annual offsite and other fun events</li>\n</ul>\n<p>You can learn more about the company and the team here: https://jobbatical.com/about</p>\n<img src=\"https://remotive.com/job/track/1899134/blank.gif?source=public_api\" alt=\"\"/>","tags":"[\"go\",\"AI/ML\",\"automation\",\"documentation\",\"hardware\",\"pipedrive\"]","pubDate":"2024-02-29 07:20:09.000","link":"https://remotive.com/remote-jobs/hr/global-mobility-agent-1899134","savedDate":"2024-03-02 05:22:14.293","slug":"global-mobility-agent-jobbatical-9809"},{"id":2103737255,"title":"Marketing HubSpot Specialist","company":"Laagencia","image":"https://remotive.com/job/1898062/logo","description":"<div>Proper Expression is a boutique growth marketing firm focused on the B2B SaaS space. We work with some of the coolest tech organizations in the industry. We’re a young agency, but we’re growing quickly.</div>\n<div> </div>\n<div>We support our clients through a suite of services including inbound marketing, content production and digital advertising. Our work culture is fast-paced, team-oriented and, dare we say, fun. Clients love us for our thoughtful work that pushes boundaries as well as sales. This position is available remotely, world-wide, though is expected to adhere to USA East Coast time.  </div>\n<p><br><br></p>\n<div class=\"h3\"> </div>\n<ul style=\"\">\n<li style=\"\">5+ years of HubSpot experience</li>\n<li style=\"\">Specifically, HubSpot Marketing and Sales Hubs</li>\n<li style=\"\">Operations and Service Hub experience is a plus</li>\n<li style=\"\">Extensive experience in HubSpot onboarding, migrations, and integrations.</li>\n<li style=\"\">HubSpot certified.</li>\n<li style=\"\">Strong understanding of inbound marketing and sales strategy.</li>\n<li style=\"\">Intimate knowledge of HubSpot Reporting.</li>\n<li style=\"\">Excellent organization and communication skills.</li>\n</ul>\n<p><br><br></p>\n<div class=\"h3\"> </div>\n<ul style=\"\">\n<li style=\"\">Develop and implement comprehensive HubSpot strategies that align with our client’s marketing goals.</li>\n<li style=\"\">Configure and maintain HubSpot CRM, including custom fields, workflows, reports, and dashboards.</li>\n<li style=\"\">Oversee the integration of HubSpot with other systems and tools.</li>\n<li style=\"\">Train and support team members in using HubSpot effectively.</li>\n<li style=\"\">Lead marketing automation efforts, including email campaigns, lead nurturing and lead scoring models.</li>\n<li style=\"\">Analyze and report on the performance of HubSpot initiatives, providing insights and recommendations for improvement.</li>\n<li style=\"\">Stay updated with HubSpot features and industry best practices to enhance our systems continuously.</li>\n</ul>\n<img src=\"https://remotive.com/job/track/1898062/blank.gif?source=public_api\" alt=\"\"/>","tags":"[\"saas\",\"automation\",\"CRM\",\"advertising\",\"onboarding\",\"marketing automation\",\"hubspot\",\"growth marketing\",\"Digital advertising\"]","pubDate":"2024-02-29 01:20:55.000","link":"https://remotive.com/remote-jobs/marketing/marketing-hubspot-specialist-1898062","savedDate":"2024-03-02 05:22:14.293","slug":"marketing-hubspot-specialist-laagencia-1797"},{"id":7926272931,"title":"Unified Support Engineer (CloudLinux Focus) -REMOTE/ Work Anywhere","company":"CloudLinux","image":"https://pbs.twimg.com/profile_images/696718028084482050/ymY3OEPk_400x400.png","description":"<p>CloudLinux is on the lookout for a highly skilled Support Engineer to join our global, remote-first team. As a key player in our support department, you'll be at the forefront of addressing customer inquiries and issues, ensuring they're off to a successful start. Your main responsibilities will include gathering information from tickets, searching for resolutions within our knowledge base, reviewing known errors/bugs databases, and working towards a quick resolution. In instances where a resolution isn't readily available, you'll be tasked with escalating the issue to a higher level.</p><p>The ideal candidate is someone who thrives on assisting customers, simplifying technical details, and has a solid foundation in Linux. This role is particularly focused on supporting CloudLinux OS products, the world's leading web-hosting Linux-based operating system, among other premier Linux-based offerings.</p><p>CloudLinux prides itself on being a remote-first company, driven by principles such as doing the right thing, putting employees first, and delivering high-volume, low-cost Linux infrastructure and security products. These products significantly enhance operational efficiency for companies worldwide. Every team member is supported and encouraged to succeed, making CloudLinux a truly exceptional place to work.</p><p>For more information, visit<a href=\"https://cloudlinux.com/\" rel=\"nofollow noreferrer noopener\" class=\"external\"> cloudlinux.com</a></p><p></p><p><strong>As our Support Engineer, you will be responsible for:</strong></p><ul> <li>Deliver world-class technical support to our global clientele, ensuring customer satisfaction and loyalty.</li> <li>Utilize your extensive Linux expertise to analyze, troubleshoot, and resolve a variety of technical issues.</li> <li>Collaborate closely with our development team for bug-fixing, troubleshooting, and issue tracking.</li> <li>Directly engage with customers to ensure their happiness with our products and services.</li> <li>Contribute to product development by sharing insights gained from customers' issues and use cases.</li> <li>Create and contribute to Knowledge Base articles to aid in problem resolution.</li> </ul><h3>Requirements: </h3><p><strong>To be successful in this role you should have:</strong></p><ul> <li>A technical, passionate problem-solver with a customer-centric mindset.</li> <li>Strong familiarity with Linux, as you'll be supporting the world’s premier web-hosting Linux-based operating system and other leading Linux products.</li> <li>Organized, resourceful, and responsive, with the ability to work effectively in a remote setting.</li> <li>Flexibility to work shifts and provide support on a 24/7/365 basis.</li> </ul><p><strong>Shifts:</strong></p><ul> <li>Primary shift: 8 AM - 4 PM EST</li> <li>Openness to work weekends, with flexibility for different shifts.</li> </ul><h3>Benefits: </h3><p><strong>What's in it for you?</strong><br></p><ul> <li>A focus on professional development; </li> <li>Interesting and challenging projects</li> <li>Flexible working hours</li> <li>Paid one month vacation per year and unlimited sick leave</li> <li>Medical insurance reimbursement</li> <li>Co-working and gym/sports reimbursement</li> <li>The opportunity to receive a reward for the most innovative idea that the company can patent</li> </ul><p></p><p><em>By applying for this position, you agree with </em><a href=\"https://cloudlinux.com/privacy-policy\" rel=\"nofollow noreferrer noopener\" class=\"external\"><em>Cloudlinux Privacy Policy</em></a><em> and give us your consent to maintain and process your personal data with this respect. Please read our Privacy Policy for more information.</em></p>","tags":"[\"database\"]","pubDate":"2024-02-29 00:00:00.000","link":"https://apply.workable.com/cloudlinux-1/j/D390C76D28","savedDate":"2024-03-02 05:22:14.298","slug":"unified-support-engineer-cloudlinux-focus-remote-work-anywhere-cloudlinux-5289"},{"id":8891251687,"title":"Associate Actuary","company":"Steadily","image":"https://remotive.com/job/1899056/logo","description":"<p>Steadily is an insurance technology company that specializes in rental property insurance for landlords. We’re three years old, just over 100 people, manage $6B in risk, and are intent on becoming the world’s best and largest insurer of rental properties.</p>\n<p>We exist to deliver fast, affordable insurance and to pay claims quickly and fairly. To do that, we hire the best engineers, actuaries, sales, and service people in the country to build the experience that we’d want if we were the client.</p>\n<p>Steadily is hiring an <strong>Associate</strong> <strong>Actuary </strong>who is the very best at what they do. You'll be surrounded by team members who are also the very best at what they do, which will just make you even better.</p>\n<p><strong>What You'll Do</strong></p>\n<ul style=\"\">\n<li style=\"\">You’ll have ultimate responsibility for the growth and profitability of our DP products nationwide </li>\n<li style=\"\">Enhance pricing of existing products.</li>\n<li style=\"\">Expand our product into new geographies.</li>\n<li style=\"\">Analyze the drivers of profitability including loss ratios, actuarial indications, frequency/severity trends, retention and other data for all products, books, and channels.</li>\n<li style=\"\">Manage rate filings across multiple states to ensure we are priced to achieve the required return across all products and segments.</li>\n<li style=\"\">Develop and implement robust data-driven action plans to continually improve performance.</li>\n<li style=\"\">Driving innovation by finding new and different way to price better than the traditional solutions.</li>\n</ul>\n<p><strong>Your Background</strong></p>\n<ul style=\"\">\n<li style=\"\"><strong>Experienced</strong>: You’ve been a high achiever in insurance for three years or more. You have experience managing property products (<strong>preferably personal lines - HO or DP</strong>). You understand the current US property market.</li>\n<li style=\"\"><strong>Education: </strong>You have passed a minimum of 3 actuarial exams.</li>\n<li style=\"\"><strong>Builder</strong>: You have a builder’s mindset and can take projects and products from inception to launch and beyond. You have a bias towards action. </li>\n<li style=\"\"><strong>Digital</strong>: Your tech savvy is exceptional. You have strong product sense and are a master of learning and implementing new software and processes. Your technical and analytical skills are top notch. </li>\n<li style=\"\"><strong>Hungry</strong>: You want to make the leap into an earlier-stage tech company to rapidly accelerate your growth. You want to roll up your sleeves and hustle – you are not looking for a traditional 9-5 job.   </li>\n</ul>\n<p><strong>Compensation and Benefits</strong></p>\n<ul style=\"\">\n<li style=\"\">Compensation $100k -$140k + equity in the company\n<ul style=\"\">\n<li style=\"\">We believe in paying top-of-market to attract the best person for each role. However, the compensation package is usually the second reason people choose to join a startup. The primary reason is they want to experience the growth that comes from pouring your heart and soul into building something that people love. That’s what we do.</li>\n</ul>\n</li>\n<li style=\"\">Health Insurance </li>\n<li style=\"\">401K</li>\n<li style=\"\">Free snacks &amp; regular team lunches</li>\n</ul>\n<p><strong>Locations</strong></p>\n<ul style=\"\">\n<li style=\"\">Remote </li>\n</ul>\n<p><strong>Why Join Us</strong></p>\n<ul style=\"\">\n<li style=\"\">You'll be in good company. Our founders have three successful startups under their belt and have recruited a stellar team to match.</li>\n<li style=\"\">We pay top of market (see comp).</li>\n<li style=\"\">We're earlier stage, so you'll get to wear a lot of hats and shape product decisions.</li>\n<li style=\"\">We have a good time. Culture matters a ton to us.</li>\n<li style=\"\">We're growing fast and are exceptionally well-funded.</li>\n<li style=\"\">Steadily boasts a very unique culture that our teammates love. We call it like we see it and we’re nothing if not candid. Check out our culture deck<a href=\"%22https://www.steadily.com/culture%22\" rel=\"nofollow\"> here</a> to learn what we’re all about.</li>\n<li style=\"\">Steadily was awarded Comparably’s Best Company Leadership 2023, Best CEOs for Women 2023, and Best Company for Women 2022</li>\n</ul>\n<p><strong>We’re excited to meet you!</strong></p>\n<p><a href=\"%22http://www.steadily.com/press-room%22\" rel=\"nofollow\"><strong>Press Room</strong></a><strong> </strong><em><span style='\"font-weight:'>(News) </span></em><strong>|</strong><a href=\"%22https://www.trustpilot.com/review/steadily.com%22\" rel=\"nofollow\"><strong> </strong><strong>TrustPilot</strong></a><strong> </strong><em><span style='\"font-weight:'>(Clients)</span></em><strong> |</strong><a href=\"%22https://www.comparably.com/companies/steadily%22\" rel=\"nofollow\"><strong> </strong><strong>Comparably</strong></a><em><span style='\"font-weight:'> (Employees)</span></em></p>\n<p><em><span style='\"font-weight:'><a href=\"%22https://twitter.com/steadilyinsure?lang=en%22\" rel=\"nofollow\" target='\"_blank\"'><img height='\"16\"' src=\"%22https://uploads-ssl.webflow.com/61fafbc7edc1722dc7a9fc74/623a229ec3b5c52f7bd02e9f_twitter-icon.png%22\" width='\"16\"'></a> <a href=\"%22https://www.facebook.com/steadilyinsurance/%22\" rel=\"nofollow\" target='\"_blank\"'><img height='\"16\"' src=\"%22https://uploads-ssl.webflow.com/61fafbc7edc1722dc7a9fc74/623a229ec3b5c56a13d02e9e_facebook-icon.png%22\" width='\"16\"'></a> <a href=\"%22https://www.linkedin.com/company/steadily%22\" rel=\"nofollow\" target='\"_blank\"'><img height='\"16\"' src=\"%22https://uploads-ssl.webflow.com/61fafbc7edc1722dc7a9fc74/623a229d99798b59e516923b_linkedin-icon.png%22\" width='\"16\"'></a>  <a href=\"%22https://www.instagram.com/steadilyinsure/%22\" rel=\"nofollow\" target='\"_blank\"'><img height='\"16\"' src=\"%22https://uploads-ssl.webflow.com/61fafbc7edc1722dc7a9fc74/623a229e61f58952588fae07_instagram-icon.png%22\" width='\"16\"'></a></span></em></p><img src=\"https://remotive.com/job/track/1899056/blank.gif?source=public_api\" alt=\"\"/>","tags":"[\"product development\",\"data analysis\"]","pubDate":"2024-02-28 23:20:39.000","link":"https://remotive.com/remote-jobs/finance-legal/associate-actuary-1899056","savedDate":"2024-03-02 05:22:14.293","slug":"associate-actuary-steadily-3354"},{"id":1235678980,"title":"MARKETING ASSISTANT at VIRAL LOOPS","company":"Wishpond","image":"https://scontent.fcmb4-2.fna.fbcdn.net/v/t39.30808-6/273499217_5218973671480777_3308731762242867065_n.jpg?_nc_cat=110&ccb=1-7&_nc_sid=efb6e6&_nc_ohc=YDi_Wd17RD8AX9wXcyR&_nc_zt=23&_nc_ht=scontent.fcmb4-2.fna&oh=00_AfB4sOOYpj6VyDSuvvuqhVnZbH22m89SqG99HwaOa-uslw&oe=65BE4336","description":"<div><b style=\"font-size: 18px\">Wishpond Technologies currently has the position of Marketing Assistant available and we’re excited to tell you about it!</b></div><div><br></div><div><b style=\"font-size: 24px\">ABOUT VIRAL LOOPS</b></div><div><span style=\"font-size: 16px\">Viral Loops is a fast-growing, innovative tech company specializing in growth marketing solutions. We work with businesses of all sizes to design and execute viral marketing campaigns that leverage the power of social media and user engagement. With a focus on delivering top-notch user experiences, we are searching for a talented Full-Stack Software Engineer to join our dynamic engineering team.</span></div><div><br></div><div><span style=\"font-size: 16px\">Since 2022 Viral Loops is a subsidiary of Wishpond Technologies. Founded in 2009, Wishpond is a rapidly growing technology company providing digital marketing solutions targeted at small businesses. Wishpond serves over 3,000 customers in various industries and sizes, from startups to large Fortune 500 companies. Wishpond has a rapidly growing global headcount and continues to hire dedicated and qualified employees and contractors who have what it takes to scale a successful software company. To learn more about Wishpond, please visit www.wishpond.com</span></div><div><br></div><div><b style=\"font-size: 24px\">OVERVIEW</b></div><div><span style=\"font-size: 16px\">Are you a content wizard with a knack for compelling storytelling that captures hearts and minds? Do you dream in blog posts, live for the perfect video script, and have a sixth sense for optimizing conversion funnels? Viral Loops is on the hunt for a Marketing Assistant who can weave magic into our marketing strategies, working closely with our Head of Growth. This is your stage to shine, showcase your creativity, and be part of a dynamic team that’s redefining the marketing landscape.</span></div><div><br></div><div><b style=\"font-size: 24px\">RESPONSIBILITIES</b></div><div>• <span style=\"font-size: 16px\">Collaborate with the Head of Growth to craft and execute innovative content strategies that drive engagement and conversions.</span></div><div>• <span style=\"font-size: 16px\">Produce spellbinding content for our website, ensuring each word aligns with our brand voice and SEO goals.</span></div><div>• <span style=\"font-size: 16px\">Create blog content that not only ranks but resonates, turning readers into loyal followers and customers.</span></div><div>• <span style=\"font-size: 16px\">Script and develop video content that tells our story in a way that captivates and converts.</span></div><div>• <span style=\"font-size: 16px\">Dive deep into conversion funnel analytics, identifying opportunities for optimization and implementing strategies that enhance performance.</span></div><div><span style=\"font-size: 16px\">• Other duties as assigned.</span></div><div><span style=\"font-size: 24px\">&nbsp;</span></div><div><b style=\"font-size: 24px\">QUALIFICATIONS</b></div><div>•<span style=\"font-size: 16px\"> A creative soul with 1-2 years of experience in content creation, marketing, or a related field.</span></div><div>• <span style=\"font-size: 16px\">Exceptional writing and storytelling skills, with a portfolio that showcases your prowess across various mediums.</span></div><div>• <span style=\"font-size: 16px\">A keen understanding of SEO principles and how they intertwine with content creation to boost visibility and engagement.</span></div><div>• <span style=\"font-size: 16px\">Proficiency in content management systems and tools that bring your ideas to life.</span></div><div>• <span style=\"font-size: 16px\">Analytical agility, with an ability to glean insights from data and translate them into actionable growth strategies.</span></div><div>• <span style=\"font-size: 16px\">A team player who thrives in collaborative environments but can also steer the ship solo when needed.</span></div><div><br></div><div><b style=\"font-size: 24px\">WORK ENVIRONMENT</b></div><div><span style=\"font-size: 16px\">• Given the nature of this role, it is expected that the successful candidate will provide their own workstation, computer, headset, and have a fast and reliable internet connection. Certain roles will be required to utilize and or download company-approved software.</span></div><div><span style=\"font-size: 16px\">• This position is expected to work European timezones.</span></div><div><span style=\"font-size: 16px\">• Due to the nature of this role, we may verify backgrounds, including conducting employment references, criminal records, and credit checks.</span></div><div><span style=\"font-size: 16px\">• Once hired, the successful candidate must provide valid governmental photo ID and proof of residential address.</span></div><div>&nbsp;</div><div><b style=\"font-size: 24px\">GREAT REASONS TO APPLY FOR THIS ROLE</b><span style=\"font-size: 24px\">&nbsp;</span></div><div><span style=\"font-size: 16px\">• Fully remote position allowing you to </span><b><span style=\"font-size: 16px\">work from your home anywhere in the world!</span></b></div><div><span style=\"font-size: 16px\">• Exciting and dynamic environment with a great leadership team&nbsp;</span></div><div><span style=\"font-size: 16px\">•&nbsp;Comprehensive training program and regular performance reviews to facilitate your success</span></div><div><span style=\"font-size: 16px\">•&nbsp;Competitive compensation based on experience and proven abilities</span></div><div><span style=\"font-size: 16px\">• Great referral programs with incentives and bonuses</span></div><div><span style=\"font-size: 16px\">•&nbsp;Unbelievable product discounts when you use our products for your own business</span></div><div><span style=\"font-size: 16px\">•&nbsp;A global workforce of multi-cultural and talented colleagues&nbsp;</span></div><div><span style=\"font-size: 16px\">• A close-knit operation with amazing growth opportunities for your personal development</span></div><div><span style=\"font-size: 16px\">• A high-growth SaaS technology company publicly traded on the TSX Venture Exchange</span></div><div><span style=\"font-size: 16px\">• Corporate headquarters in beautiful Vancouver, British Columbia, Canada</span></div><div><span style=\"font-size: 16px\">• Access to our education credits program and so much more!</span></div><div>&nbsp;</div><div><b style=\"font-size: 24px\">ABOUT US</b><span style=\"font-size: 18px\">&nbsp;</span></div><div><span style=\"font-size: 16px\">Founded in 2009, Wishpond is a rapidly growing technology company providing digital marketing solutions targeted at small businesses.&nbsp; The cloud-based platform includes landing pages, social promotions, website pop-ups, online forms, and lead activity tracking. Wishpond has a dedicated team of professional project managers, designers, copywriters, and developers who provide marketing services tailored to our individual clients.</span></div><div><span style=\"font-size: 16px\">&nbsp;</span></div><div><span style=\"font-size: 16px\">Wishpond serves over 3,000 customers in various industries and sizes, from startups to large fortune 500 companies. Wishpond has a rapidly growing global headcount and continues to hire dedicated and qualified employees and contractors who have what it takes to scale a successful software company.</span></div><div><br></div><div><span style=\"font-size: 16px\"> To learn more about Wishpond Technologies, please visit our website or any of our social media platforms:</span></div><div><span style=\"font-size: 16px\">&nbsp;</span></div><div><span style=\"font-size: 16px\">• Website: </span><a href=\"http://www.wishpond.com/\"><span style=\"font-size: 16px\">www.wishpond.com</span></a></div><div><span style=\"font-size: 16px\">• Instagram: @wishpondofficial</span></div><div><span style=\"font-size: 16px\">• Twitter: Wishpond</span></div><div><span style=\"font-size: 16px\">•  Youtube: Thewishpond</span></div><div><span style=\"font-size: 16px\">•&nbsp;LinkedIn : Wishpond</span></div><div>&nbsp;</div><div><b style=\"font-size: 24px\">APPLICATION PROCESS</b></div><div><b><span style=\"font-size: 16px\">If you are interested in applying for this exciting opportunity, please provide an updated resume in English (PDF or Word formats only), quoting the position title in the subject line of your cover letter.</span></b></div><div><span style=\"font-size: 16px\">&nbsp;</span></div><div><span style=\"font-size: 16px\">Wishpond Technologies is an equal-opportunity employer committed to hiring a diverse workforce and sustaining an inclusive culture that does not discriminate on the basis of disability, status or any other basis protected under legislation.</span></div><div><span style=\"font-size: 16px\">&nbsp;</span></div><div><span style=\"font-size: 16px\">We thank all applicants in advance for their interest in this position however, due to the volume of applications we receive, we are unable to respond to phone, email or agency inquiries.</span></div>","tags":"[\"management\",\"engineering\"]","pubDate":"2024-02-28 22:31:33.601","link":"https://jobs.lever.co/wishpond/09a662d3-48e1-44f3-b691-1748f7e65c65","savedDate":"2024-03-02 05:22:14.301","slug":"marketing-assistant-at-viral-loops-wishpond-6170"},{"id":7131125360,"title":"Analytics Engineer","company":"Circle","image":"https://lever-client-logos.s3.us-west-2.amazonaws.com/3b00b20d-12c8-4ed9-ae9e-97d8601567b2-1706111761671.png","description":"<div><b style=\"font-size: 18px\">About Us</b></div><div>Circle is building the world’s leading all-in-one platform for online communities. We make it possible for creators, coaches, educators, and businesses to bring together their audience with engaging discussions, live streams, events, chat, courses, and payments — all in one place, all under their own brand.</div><div><br></div><div>We’re proud to be a fully remote company of around 130 (and growing!) team members from 30+ countries around the world. We strive to find exceptional talent, empower them to do their best work, and in turn, have a meaningful impact in their own lives. We don’t track hours, but we manage for outcomes in an a-synchronous culture.</div><div><br></div><div>Twice a year, we bring the whole company together for incredible company retreats in beautiful places around the world!</div><div><br></div><div><b style=\"font-size: 18px\">About the role</b></div><div>Our Data team is growing! We are seeking an experienced Analytics Engineer to empower data-driven decision-making across the organization. You'll enhance our fundamental data infrastructure to facilitate our expansion into new business verticals. Taking full ownership of the analytics infrastructure for these products, you'll be responsible for every aspect, from data ingestion to reporting. Your focus will be on maintaining high standards of data quality and ensuring the availability of our core datasets.</div><div><span style=\"font-size: 13.3333px\">Cash compensation is a starting point, and we want all of our team members to be able to grow in their roles. In addition to equity, benefits and perks, our cash compensation is subject to an annual review and increase on a once per year basis on the hire date anniversary.</span></div><h3>What you'll be doing</h3><li>Drive the evolution of our foundational data infrastructure to support expansion into new verticals.</li><li>Ensure scalability and adaptability of the infrastructure to meet the growing needs of the organization.</li><li>Take ownership of the analytics infrastructure for new products end-to-end.</li><li>Lead data projects from ingestion to reporting, showing your ability to manage scope and work with ambiguity.</li><li>Liaise between Business, Engineering, and Data teams to translate business requirements into effective data capture and schema design.</li><li>Foster collaboration and communication to ensure seamless execution of data-related initiatives.</li><li>Provide strategic insights and recommendations for optimizing data architecture and analytics processes.</li><li>Demonstrate adaptability and problem-solving skills in addressing the complexities of data space.</li>,<h3>What you'll need to be successful</h3><li>Strong alignment with our values.&nbsp;<a href=\"https://www.notion.so/Circle-Careers-223a15ea312c4922b793593d07add7fe?pvs=21\" class=\"postings-link\">Find our values on our career page</a>&nbsp;if you haven’t read up on them yet.</li><li>You are proficient in English (spoken, written, and reading) at a&nbsp;<a href=\"https://magoosh.com/english-speaking/english-proficiency-levels-a-guide-to-determining-your-level/\" class=\"postings-link\">CEFR Level C2</a>&nbsp;/&nbsp;<a href=\"https://www.govtilr.org/\" class=\"postings-link\">ILR Level 5</a>.</li><li>A minimum of 3 years of experience in data management and analysis.</li><li><b>Must have experience owning dbt environment.</b></li><li>Strong knowledge of data visualization and analysis tools (e.g. SQL, Python, R, Looker).</li><li>Experience managing data environments.</li><li>Strong communication and presentation skills, ability to explain technical concepts to non-technical stakeholders.</li><li>Proven ability to work in a fast-paced, deadline-driven environment.</li><div><b style=\"font-size: 18px\">The fun stuff</b></div><div><b>Fully remote:</b>&nbsp;work from anywhere in the world!</div><div><b>Autonomy and trust to do your job:</b>&nbsp;we care about outcomes over everything else.</div><div><b>Paid time away:</b>&nbsp;all employees are given 35 days of PTO annually.</div><div><b>Generous U.S. benchmarked compensation</b>&nbsp;and startup equity no matter where you are in the world.*</div><div><b>Awesome medical coverage</b>&nbsp;with 100% coverage for you and your family, or medical reimbursement options where applicable!*</div><div><b>Home office stipend</b>&nbsp;to help you get up and running.</div><div><b>Learning &amp; development stipend</b>&nbsp;to help you level up your professional skills.</div><div><b>Annual bonus potential</b>&nbsp;for roles that don't already receive variable income or commission.</div><div><b>Company retreats:</b>&nbsp;Twice a year, the Circle team gets together for a fully paid company retreat in incredible places around the world! We’ve had past retreats in Colombia, Portugal, and Mexico, with more planned on the horizon.</div><div><b>Check out our&nbsp;</b><a href=\"https://careers.circle.so/\" class=\"postings-link\"><b>Careers</b></a><b>&nbsp;page for more.</b></div><div><span style=\"font-size: 10px\">*</span><i style=\"font-size: 10px\">Your role, location and unique circumstance may affect this.</i></div><div><br></div><div><b>Diversity, Equity &amp; Inclusion</b></div><div>As a fully-remote international company, diversity is baked into our DNA. Here’s how our CEO, Sid Yadav, frames our hiring mission: “let’s find talent in underserved and under-represented corners of the world, set them up to do the best work of their lives, and in turn, change their life.” To achieve this hiring mission, we offer competitive&nbsp;<a href=\"http://u.s.-benchmarked/\" class=\"postings-link\">U.S.-benchmarked</a>&nbsp;compensation no matter where someone’s located in the world, and we proactively seek candidates who expand representation of backgrounds, cultures and lived experiences in our teams.</div><div><br></div><div><b>Equal Employment Opportunity</b></div><div>Circle is an equal opportunity employer and as such, we do not discriminate on the basis of race, color, religion, sex, sexual orientation, gender identity, national origin, age, disability, or any other characteristic protected by applicable laws.</div><div>If you require any accommodations during the recruitment process, please let us know and we will work with you to meet your needs.</div>","tags":"[\"management\",\"engineering\",\"aws\"]","pubDate":"2024-02-28 21:08:20.183","link":"https://jobs.lever.co/circleco/d0d275af-f428-4b4e-96cd-1e432ec7aa3d","savedDate":"2024-03-02 05:22:14.303","slug":"analytics-engineer-circle-66"},{"id":6325698288,"title":"Head of Strategic Partnerships","company":"VRChat","image":"https://pbs.twimg.com/profile_images/1719900921793003520/qPc3pV09_400x400.jpg","description":"<div><span style=\"font-size: 24px\">Join the VRChat Team!</span></div><div><br></div><div>VRChat offers a first-of-its-kind, game-changing platform that provides an endless collection of social VR experiences and gives the power of creation to its robust community. With over 250,000 worlds and growing, VRChat’s vision is to allow users to bring their imaginations to life and help shape the metaverse anywhere in the world on any device. VRChat has raised $100M to date with the support of investors Makers Fund, Anthos Capital and HTC and is building out a strong team to achieve hyper-growth in the coming years.</div><div><br></div><div><span style=\"font-size: 24px\">Job Overview</span></div><div><br></div><div><span style=\"font-size: 11pt\">The Head of Strategic Partnerships is a key leadership role at VRChat. This person will nourish all external facing strategic relationships, including platform/technology partners (e.g. Unity, Steam, Apple, Google, Meta, Tilia, AWS etc.) and business partners looking to integrate with the VRChat platform. As the first dedicated partnerships hire, this person will play a pivotal role in establishing strong and sustaining relationships with external stakeholders, and using those relationships to create business impact.</span></div><div><span style=\"font-size: 11pt\">This role reports into VRChat’s VP of Operations &amp; Legal, and will support the existing business development team. This person will work with heads of various functions, with periodic interactions with the exec team and VRChat’s Board of Directors.&nbsp; </span></div><div><br></div><div><span style=\"font-size: 24px\">Job &amp; Team Impact</span></div><div><br></div><div><span style=\"font-size: 11pt\">In this role, you will help build VRChat’s formal partnerships function from zero to one.&nbsp; There are many partnerships that keep VRChat running, including those with vendors and platform partners. With the launch of VRChat’s creator economy, there is also a great opportunity to work with additional partners who want to leverage the VRChat platform and drive our creator content flywheel. Your work and relationships will directly impact VRChat’s ability to provide an incredible experience for its millions of users. </span></div><h3>Duties & Responsibilities</h3><li>Work with VRChat’s VP of Operations &amp; Legal and broader executive team to formulate strategic partnerships and business development strategy</li><li>Manage new and existing platform/technology partner and major vendor relationships, including negotiating contracts, participating in regular touchpoints and generally maintaining strong relationships&nbsp;</li><li>Pitch new partners, including service providers and strategic partners, and define, negotiate and manage the agreements covering such relationships</li><li>Support product and operations teams by building and managing relationships and agreements with appropriate partners</li><li>Meet with prospective business partner creators who want to participate in VRChat’s creator economy, understand their needs and help bring them onto the VRChat platform</li><li>Represent VRChat&nbsp; in meetings with executives from other companies</li>,<h3>Experience, Skills & Qualifications</h3><li>7+ years of work experience, including 3+ years of related partnerships experience&nbsp; for technology or gaming companies</li><li>Experience in the technology and/or gaming industries working with large brands, intellectual property owners, developers and/or hardware platforms</li><li>Highly strategic and capable of structuring and negotiating complex agreements, including experience in interpreting legal documents and working with attorneys to complete agreements</li><li>Experience working cross-functionally to orchestrate and successfully complete deals</li><li>Experience in a fast-paced, highly ambiguous start-up environment</li><li>High level of enthusiasm and innovation with experience adapting easily to change and ability to multitask</li><li>Creative, resourceful, detail-oriented, and highly organized</li>,<h3>Bonus Points</h3><li>Demonstrated interest in VR, online communities, or be a VRChat user and creator! Knowing how our platform and community works helps our team succeed</li><li>Experience working at a VR or metaverse-related company</li><li>Experience working on a “live” app, shipping frequent updates and responding to user feedback</li>,<h3>Benefits</h3><li>Work from anywhere! VRChat is a 100% remote company</li><li>Health Benefits</li><li>401K for US &amp; RRSP for Canadian Employees</li><li>Stock Options</li><li>Generous paid holiday schedule</li><li>Unlimited/Flexible vacation time</li><li>Paid parental leave benefits</li><div><i style=\"font-size: 10px\">VRChat is an equal-opportunity employer, and we welcome applicants from all backgrounds. VRChat fosters a diverse, creative, and collaborative environment where anyone can contribute to any of the ongoing projects or direction of the roadmap at any time.  If you’re a passionate team player who wants to have an impact on a dynamic team, we’d love to hear from you!</i></div><div><br></div><div><i style=\"font-size: 10px\">*Offers are subject to satisfactory background and reference checks.</i><span style=\"font-size: 11pt\">&nbsp;</span></div>","tags":"[\"legal\",\"aws\"]","pubDate":"2024-02-28 16:12:14.958","link":"https://jobs.lever.co/vrchat/942233e4-4375-4204-80e2-e8b6e9c14e61","savedDate":"2024-03-02 05:22:14.302","slug":"head-of-strategic-partnerships-vrchat-3433"},{"id":8473798273,"title":"Lead Writer","company":"Theroom","image":"https://remotive.com/job/1898472/logo","description":"<p><strong>ABOUT US</strong></p>\n<p>Africa has an untapped talent pool that is increasing exponentially, with a projected workforce that will exceed India and China by 2035 Fuelled by this, our mission is to create work opportunities for millions of Africa’s youth and solve the world’s shortage of technology talent. </p>\n<p>Our company SAND has 170+ staff members from 30+ countries with plans to acquire several companies around the world to become a multi-billion dollar global technology services provider that employs over 100K employees across the globe.</p>\n<p>We have 3 brands represented in our ecosystem:</p>\n<ul style=\"\">\n<li style=\"\">With <a href=\"%22https://www.alxafrica.com/%22\" rel=\"nofollow\"><strong>ALX</strong></a>, we are building the fastest-growing pool of technology talent in the world, training young talent across Software Engineering, Cloud Computing, Data Science and Salesforce. We are shaping the next generation of software engineers in over 60 countries. </li>\n<li style=\"\">Through our talent agent, <a href=\"%22https://www.theroom.com/%22\" rel=\"nofollow\"><strong>The Room</strong></a>, we are creating a community (43+ countries represented to date) for the World’s top tech talent sparking transformative careers by connecting top technology talent with extraordinary opportunities for impact. </li>\n<li style=\"\">Through <a href=\"%22https://sandtech.com/%22\" rel=\"nofollow\"><strong>Sand Technologies</strong></a><strong> </strong>we support enterprises and  scale-ups around the world to develop world class technology products, build great technology teams, generate more revenue, and deliver outstanding customer experience. Our clients include one of the largest cloud computing providers in the world as well as Bestseller A/S (Denmark), Create Prime (New Zealand), Stanbic Bank (Kenya), and Tamara (Dubai). </li>\n</ul>\n<p>With varying levels of expertise in software development, data, cloud, machine learning, artificial intelligence, UX design, web development, etc, we providing unparalleled opportunities to technology talent worldwide while reshaping industries, disrupting traditional business models, and creating new opportunities for innovation and growth.</p>\n<p>We do hard things!</p>\n<p><strong>ABOUT THE SAND TECHNOLOGIES MARKETING TEAM</strong></p>\n<p>Our global team is scrappy, strategic and obsessed with excellence. Working as a cohesive unit, the marketing team pushes hard in our respective areas to drive revenue and build the Sand Technologies brand. We have fun, aren’t afraid to experiment intelligently, and roll-up our sleeves to do the work. We consider ourselves strategic storytellers, creating marketing assets and integrated programs that captivate audiences and empower colleagues to win new customers and partners. Our focus is on delivering value, not volume, and our mission is simple: inspire prospects to do business with Sand Technologies. If you have a fire in your belly and are ready to contribute to a marketing organization with high expectations, come join the party.</p>\n<p><strong>ABOUT THE ROLE</strong></p>\n<p>The Managing Editor (OR Lead Writer) is responsible for writing and editing the full spectrum of marketing content for use in thought-leadership programs, media bylines, and multichannel industry campaigns. In collaboration with marketing and business stakeholders, this individual leads the creation of written material that articulates Sand Technologies’ value propositions in creative and effective ways. The Managing Editor (OR Lead Writer) is responsible for:</p>\n<ul style=\"\">\n<li style=\"\">Interviewing marketing leads, business leads and subject-matter experts to uncover the unique angles and ways to tell our clients’ and company’s compelling stories</li>\n<li style=\"\">Writing and editing thought-leadership articles, case studies, webpages, reports, video scripts, emails, social-media posts, brochures and other materials that clearly and concisely communicate our business and marketing priorities</li>\n<li style=\"\">Contributing his/her expertise and insights to inform an annual editorial calendar</li>\n<li style=\"\">Maintaining a status update of individual assets from concept to completion</li>\n</ul>\n<p>Success in this role requires hands-on experience writing and producing high-quality B2B marketing content. Understanding of Sand Technologies’ target industries and the competitive landscape of tech-services consultancies is a significant benefit. The Managing Editor (OR Lead Writer) uses this background to turn complex concepts into relevant, creative stories that are devoid of jargon, engage audiences and generate or nurture business leads.</p>\n<p>Key performance indicators for this position include:</p>\n<ul style=\"\">\n<li style=\"\">Number and quality of marketing assets published on internal and external channels</li>\n<li style=\"\">Audience engagement metrics (as an indicator of quality and perception)</li>\n<li style=\"\">Time required to advance from content request to publication</li>\n<li style=\"\">Adherence to agreed-upon deadlines and deliverables</li>\n<li style=\"\">Ability to accommodate shifting priorities and evolving needs for marketing content</li>\n<li style=\"\">Positive and collaborative approach to working with the Sand Technologies marketing team, including designer(s) and campaign, industry and event marketers</li>\n</ul>\n<p><strong>REQUIREMENTS:</strong></p>\n<ul style=\"\">\n<li style=\"\">10+ years writing engaging marketing content, ideally with a focus on B2B technology</li>\n<li style=\"\">Proven ability to follow editorial guidelines while adapting tone/style to accommodate individual authors in an on-brand way</li>\n<li style=\"\">Expertise at uncovering a narrative’s unique angles based on interviews and research</li>\n<li style=\"\">Track record of developing marketing content that strives to avoid jargon and buzzwords, yet still articulates complex tech issues while driving audience engagement</li>\n<li style=\"\">Ability to successfully and simultaneously manage multiple assets at various stages of planning and execution</li>\n<li style=\"\">Ability to work and deliver independently, with the flexibility to support global time zones</li>\n</ul><img src=\"https://remotive.com/job/track/1898472/blank.gif?source=public_api\" alt=\"\"/>","tags":"[\"cloud\",\"data science\",\"salesforce\",\"UI/UX\",\"video\",\"research\",\"editing\"]","pubDate":"2024-02-28 15:22:09.000","link":"https://remotive.com/remote-jobs/writing/lead-writer-1898472","savedDate":"2024-03-02 05:22:14.293","slug":"lead-writer-theroom-6592"},{"id":6751978604,"title":"QA Automation Engineer - Online","company":"Crytek","image":"https://lever-client-logos.s3-us-west-2.amazonaws.com/2a61cdfd-29d3-4707-b965-c4527aa67d0c-1593500521772.png","description":"<div><span style=\"font-size: 16px\">We are looking for a passionate and experienced</span><b style=\"font-size: 16px\"> QA Automation Engineer</b><span style=\"font-size: 16px\"> to support our HUNT Team.</span></div><div><br></div><div><span style=\"font-size: 16px\">This role is based on site in our headquarters in Frankfurt, Germany. You will have the chance to work alongside our worldclass team that features some of the best developers in the industry and take advantage of our attractive relocation package.</span></div><h3>Responsibilities</h3><li>Provide specification and implementation of the test      cases for automatic verification.</li><li>Design, implement and extend CI/CD pipelines with E2E tests.</li><li>Design documentation for automated processes.</li><li>Support the team analyzing user stories and/use      cases/requirements for validity and feasibility.</li><li>Fill the role of a QA champion and assist developers in      writing their own tests.</li><li>Integrate or build new tools and frameworks to improve      and automate QA and development processes even further.</li><li>Troubleshooting automation software issues.</li><li>Creating test plans and cases.</li><li>Conducting regression testing.</li><li>Helping identify weaknesses and problem areas in the      software application.</li><li>Tracking software bugs and investigating the causes.</li><li>Identify problem areas.</li>,<h3>Requirements</h3><li>Experience with automation tools like pytest.</li><li>Experience with source control like Git or Perforce.</li><li>Experience with CI tools like GitLab CI/Jenkins/Github      Actions.</li><li>Proficiency in Python.</li><li>Able to read, understand, and review code.</li><li>An understanding of the modern testing and delivering      approaches.</li><li>Understanding of testing protocols.</li><li>API clients like POSTMAN, SOAPUI and JMeter</li>,<h3>Pluses</h3><li>Proficiency Junit, SQL, and testing for gRPC &nbsp;services</li><li>Proficiency in Go.</li><li>Knowledge of quality metrics gathering and      presentation.</li><div><b style=\"font-size: 16px\"><u>What you can expect from us</u></b></div><div><b style=\"font-size: 16px\">Career Path&nbsp;</b></div><div><span style=\"font-size: 16px\">Your professional development is important to us, so we have laid out a career plan to help you progress towards your goals and objectives.&nbsp;</span></div><div><b style=\"font-size: 16px\">Company Apartment&nbsp;</b></div><div><span style=\"font-size: 16px\">To help you get settled, we provide you with a fully furnished company apartment during your first three months in Frankfurt.*&nbsp;</span></div><div><span style=\"font-size: 16px\">&nbsp;</span></div><div><b style=\"font-size: 16px\">Relocation&nbsp;Support&nbsp;</b></div><div><span style=\"font-size: 16px\">We offer a relocation budget and full coverage of flights to Frankfurt for you and your family.&nbsp;</span></div><div><span style=\"font-size: 16px\">You can expect extensive assistance with visa, work permits, and communication with authorities during the relocation process, as well as help settling into Germany (e.g. setting up appointments with banks, government agencies, schools, landlords, finding apartments etc.).*&nbsp;</span></div><div><b style=\"font-size: 16px\">&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;</b></div><div><b style=\"font-size: 16px\">Public Transport Pass&nbsp;</b></div><div><span style=\"font-size: 16px\">Discover Frankfurt by bus, tram and metro – free of charge.*&nbsp;</span></div><div><span style=\"font-size: 16px\">&nbsp;</span></div><div><b style=\"font-size: 16px\">Gym Card&nbsp;</b></div><div><span style=\"font-size: 16px\">A healthy body is a healthy mind. We offer a membership at the premium gym chain Fitness First in Germany. Work out, join group fitness classes, or relax in the wellness facilities.</span></div><div><span style=\"font-size: 16px\">&nbsp;</span></div><div><b style=\"font-size: 16px\">International Environment&nbsp;</b></div><div><span style=\"font-size: 16px\">We truly embody diversity at Crytek. With employees from over 42 different countries, we define ourselves by our cultural diversity.&nbsp;</span></div><div><span style=\"font-size: 16px\">&nbsp;</span></div><div><b style=\"font-size: 16px\">German Classes&nbsp;</b></div><div><span style=\"font-size: 16px\">Understanding the local culture will make your stay abroad more enjoyable, and Crytek supports that by offering German language courses for you and your family.&nbsp;</span></div><div><span style=\"font-size: 16px\">&nbsp;&nbsp;</span></div><div><b style=\"font-size: 16px\">Events</b></div><div><span style=\"font-size: 16px\">Join us on our exciting company events, including new starter breakfasts, summer and winter parties, our annual trip to Gamescom in Cologne, and many more!*&nbsp;</span></div><div><span style=\"font-size: 16px\">We are all gamers: stay connected and play games with your colleagues at our remote gaming parties.</span></div><div><span style=\"font-size: 16px\">&nbsp;</span></div><div><b style=\"font-size: 16px\">Vacation Days&nbsp;</b></div><div><span style=\"font-size: 16px\">At our Frankfurt office you can enjoy 24 days of vacation per year, and every 2 years you get 1 more (up to a maximum of 28 days). You will also have on average 10 public holidays on top of the days you take off. If you are working from another country, local standards apply.</span></div><div><span style=\"font-size: 16px\">&nbsp;&nbsp;</span></div><div><span style=\"font-size: 16px\">*only applicable to employees in Frankfurt.</span></div>","tags":"[]","pubDate":"2024-02-28 11:37:02.997","link":"https://jobs.lever.co/crytek/69ecebbb-415c-43d7-86ed-dd63531cf6a7","savedDate":"2024-03-02 05:22:14.308","slug":"qa-automation-engineer-online-crytek-5017"},{"id":1559644308,"title":"DevOps Engineer Remote/Work Anywhere","company":"CloudLinux","image":"https://pbs.twimg.com/profile_images/696718028084482050/ymY3OEPk_400x400.png","description":"<p>We are seeking an experienced DevOps/Ops Engineer to join our dynamic team. The ideal candidate will be responsible for enhancing and maintaining our cloud infrastructure, monitoring systems, and CI/CD pipelines. This role involves working with a variety of technologies and platforms, including AWS, Azure, GCP, Jenkins, Linux, Ansible, Docker, Python, InfluxDB, and Grafana.<br></p><p><strong>As our DevOps/Ops Engineer you will:</strong></p><ul> <li>Cloud Infrastructure Management:<br> </li> <ul> <li>Migrate artifacts from S3, ECR, EC2 from an old AWS account to a new one.</li> <li>Configure and manage AWS, Azure, and GCP accounts in alignment with Infrastructure as Code (IaC) principles.</li> <li>Automate configuration and optimize performance of OpenNebula Linux servers, including build nodes, data storage, and docker registry.</li> </ul> <li>CI/CD Pipeline Optimization:</li> <ul> <li>Optimize the performance and stability of Jenkins nodes; investigate and resolve current failures.</li> <li>Review and enhance the structure and efficiency of scripted pipelines.</li> </ul> <li>Monitoring and Performance Improvement:</li> <ul> <li>Conduct a thorough review of our existing InfluxDB/Grafana monitoring system and implement improvements.</li> <li>Optimize Docker files to reduce size and enhance efficiency.</li> <li>Expertise in Linux performance optimization.</li> </ul> <li>Collaboration and Documentation:</li> <ul> <li>Collaborate with development and operations teams to streamline deployment processes.</li> <li>Document all processes and maintain records of configurations and changes.</li> </ul> </ul><p><strong>In your first 180 days you will.</strong>..</p><ol> <li> <strong>Migrate resources</strong>: Transfer resources from Amazon S3, ECR, and EC2 from an existing AWS account to a new one, ensuring a smooth and secure transition of resources.</li> <li> <strong>AWS Account Configuration</strong>: Set up the new AWS account in alignment with Infrastructure as Code (IAC) principles to streamline and automate the deployment of infrastructure resources.</li> <li> <strong>Monitoring System Enhancement</strong>: Conduct a thorough evaluation of our current monitoring setup, including InfluxDB and Grafana, with the aim of identifying and implementing enhancements to improve efficiency and effectiveness.</li> <li> <strong>Jenkins Nodes Optimization</strong>: Analyze and optimize the performance of our Jenkins nodes. Investigate and resolve existing issues to enhance node reliability and stability.</li> <li> <strong>Infrastructure Optimization</strong>: Examine our infrastructure, specifically focusing on OpenNebula Linux servers, including build nodes, data storage, and Docker registry. Automate configuration processes and implement performance improvements.</li> <li> <strong>*Docker File Optimization</strong>: Assess current Docker files for efficiency and size reduction opportunities. Implement strategies to streamline and minimize Docker image sizes without compromising functionality.</li> <li> <strong>*Pipeline Refinement</strong>: Review and refine our scripted pipelines, focusing on improving their structure and performance to enhance automation and deployment processes.</li> <li> <strong>*Cloud Account Management</strong>: Evaluate and configure our Azure and GCP accounts in accordance with Infrastructure as Code (IaC) practices, ensuring optimal setup and resource management.</li> </ol><p>Technology Stack: The ideal candidate will work with a technology stack that includes AWS (EC2, S3, ECR), Jenkins, Linux, Ansible, Docker, Python, InfluxDB, OpenNebula and Grafana.<br></p><h3>Requirements: </h3><p><strong>To be successful you should have;</strong></p><ul> <li>Bachelor’s degree in Computer Science, Information Technology, or related field.</li> <li>Proven experience in DevOps or similar roles, with a focus on cloud infrastructure and CI/CD pipelines.</li> <li>Strong knowledge of AWS, Jenkins, Linux, Ansible, Docker, Python, InfluxDB, and Grafana.</li> <li>Experience with Azure and GCP is highly desirable.</li> <li>Demonstrated experience in Linux performance optimization.</li> <li>Strong problem-solving skills and ability to work under pressure.</li> <li>Excellent communication and teamwork abilities.</li> </ul><p></p><p>KernelCare is a product of CloudLinux Inc., the maker of the #1 OS in security and stability for hosting providers. KernelCare, a live kernel patching service provides security patches and bug fixes for a range of popular Linux kernels that can be installed without rebooting the system. &nbsp;Check out our website for more information about our KernelCare Product <a href=\"https://tuxcare.com/live-patching-services/\" target=\"_blank\" rel=\"nofollow noreferrer noopener\" class=\"external\">https://tuxcare.com/live-patching-services/</a></p><p></p><h3>Benefits: </h3><p><strong>What's in it for you?</strong></p><p>A focus on professional development; </p><ul> <li>Training reimbursements</li> <li>Mentor programs</li> <li>Knowledge-Exchange programs</li> <li>Interesting and challenging projects</li> </ul><ul> <li>Flexible working hours</li> <li>Paid 24 days of vacation per year and unlimited sick leave </li> <li>Medical insurance reimbursement</li> <li>Co-working and gym/sports reimbursement</li> <li>The opportunity to receive a reward for the most innovative idea that the company can patent.</li> </ul><em>By applying for this position, you agree with </em><a href=\"https://cloudlinux.com/privacy-policy\" rel=\"nofollow noreferrer noopener\" class=\"external\"><em>Cloudlinux Privacy Policy</em></a><em> and give us your consent to maintain and process your personal data with this respect. Please read our Privacy Policy for more information.</em>","tags":"[\"management\",\"aws\"]","pubDate":"2024-02-28 00:00:00.000","link":"https://apply.workable.com/cloudlinux-1/j/E2A23E46F4","savedDate":"2024-03-02 05:22:14.299","slug":"devops-engineer-remote-work-anywhere-cloudlinux-8300"},{"id":5487391087,"title":"Solutions Architect (Fully Remote)","company":"CoverGo","image":"https://pbs.twimg.com/profile_images/1382655628523364355/MWPIbbID_400x400.jpg","description":"<p><strong>Top 3 Reasons To Join Us</strong></p><ul> <li>Competitive Salary</li> <li>100% Remote</li> <li>Working on the latest tech for the Insurtech Market Leader</li> </ul><p><strong>About Us</strong></p><p>At CoverGo, our mission is to empower all insurance companies to make insurance 100% digital and accessible to everyone.</p><ul> <li>We are a leading global no-code insurance platform for health, life, and P&amp;C</li> <li>We’re the winner of the Insurtech of the Year in all of Asia and other awards globally</li> <li>We work with insurance enterprise clients such as AXA, Bupa, MSIG, Dai-ichi, Bank of China Group Insurance, and many more</li> <li>We're an international, diverse team of over 120 people with 30 nationalities and team members working remotely from all over the world</li> <li>We are fully funded and backed by reputable VC funds and strategic institutional investors</li> <li>We have a global presence in Asia, EMEA and the Americas</li> <li>We’ve grown our annualized revenue by over 30x since January 2021</li> <li>We’re constantly working towards making CoverGo a workplace that you love coming to. We deeply believe that bringing together a diversity of thoughts, expressions, and perspectives is key to building the best culture for equally diverse communities all over the world</li> </ul><p><strong>About the Role</strong></p><p>A cloud technology-focused individual who has demonstrated design &amp; delivery expertise in forward-looking solutions in a modern cloud-based insurance environment. The successful candidate will be technology agnostic but with a bias towards solutions leveraging heavily on an AWS and/or GCP environment that comprises elements of open-source, PaaS and SaaS components.</p><p>The Solution Architect works closely with Covergo-product and customer-project stakeholders to assess, design and support business initiatives, vetting them against defined roadmaps and incorporating them into Solution Approaches.</p><p>The Solution Architect will be responsible for defining the solution approach for the products, capabilities and technologies utilised in accordance with the Architecture Roadmap. The Solution Architect supports the development and maintenance of Enterprise Architecture (EA) roadmaps. This position is responsible for the implementation of enterprise-level API-led service-oriented and component-based solutions. This role also supports the promotion of EA standards, policies and guidelines to ensure appropriate application, implementation, and compatibility with company-wide information architectural and technical standards.</p><p><strong>What You Will Do</strong></p><ul> <li>Working with other Solution Architects and the CTO to build out the enterprise strategy for specific components of the Covergo Insurance Capability Framework</li> <li>Work closely with Product Managers to advise and define appropriate solution architectures</li> <li>Work closely with Delivery Managers to advise on the architecture approach to deploying the Covergo solution</li> <li>Explore a range of possibilities and creative alternatives to identify the most effective solutions</li> <li>Ensure the solutions designed are being implemented in the approved manner</li> <li>Assist in identifying, specifying and selecting off-the-shelf components for areas of the solution we wish to buy rather than build</li> <li>Divide large-scale initiatives into manageable easily deliverable solution components</li> <li>Knowledge transfer for Technical/Software Architects, BA’s and developers around what is required and providing support as required to ensure delivery of the architected solution</li> <li>Maintain an awareness of business solution components that fit our current and future operational needs to avoid building non-core IP areas of the product offering</li> </ul><p><strong>Required Skills and Knowledge</strong></p><ul> <li>At least 10 years of professional experience in solution architecture design and delivery roles in the insurance vertical with exposure to multiple lines of business</li> <li>Experienced in delivering cloud-based technology product solutions in an enterprise environment</li> <li>Ability to assist in defining and socialising a product/enterprise roadmap</li> <li>Ability to translate the roadmap into executable steps</li> <li>Understand business architecture models &amp; patterns</li> <li>Has designed and implemented innovative and creative solutions to business problems</li> <li>Can think \"outside the box\", but also be able to understand the business constraints that lead to “in the box” approaches</li> <li>Understand the optimum approaches for cloud-based applications with high availability and highly scalable solutions</li> <li>Experienced in designing solutions in a Relational DB and noSQL environment&nbsp;</li> <li>Experienced in designing for API &amp; Micro-services centric environments&nbsp;</li> <li>Demonstrated capability to self-learn new technology trends and approaches</li> <li>Ideally has experience or understanding of the benefits of low-code platforms&nbsp;</li> <li>While the Solution Architect is not expected to build the solutions experience of multiple development languages &amp; various DB engines will be advantageous</li> <li>Exposure to authentication and authorisation concepts (SSO, SAML integration, identity federation etc)</li> <li>Excellent communication skills (written and verbal)</li> </ul><p><strong>Required Competencies</strong></p><ul> <li>Must be equally comfortable discussing the solution strategies and enterprise roadmap with people at all levels of our organisation and CxO to project-level teams in our clients</li> <li>Excellent organisational, interpersonal &amp; communication skills and an ability to engage audiences</li> <li>Excellent decision-making and judgment skills</li> <li>Understanding of insurance business processes across all areas and at least two lines of business</li> <li>Maintains direction and focus through proactive planning and organized approaches to work</li> <li>Certification in one architecture discipline (TOGAF, Zachman, etc.) is a distinct advantage</li> <li>Certification in one cloud environment is a distinct advantage with a broad knowledge and experience of the cloud platform’s capabilities</li> <li>A high proficiency in working in English as your primary language</li> </ul><p><strong>Why You'll Love Working Here</strong></p><ul> <li>Fully Remote</li> <li>Flexible Leave</li> <li>International Environment</li> <li>Competitive renumeration package</li> <li>Performance Bonus</li> <li>Stock Options after 6 months </li> <li>Company activities and events</li> <li>Learning and development plan</li> </ul><p><strong>CoverGo Company </strong><a href=\"https://www.youtube.com/watch?v=YI0ezLxvFvA\" rel=\"nofollow noreferrer noopener\" class=\"external\"><strong>Video</strong></a></p><p>By submitting your application, you confirm that you have read, understood, and accepted the content of CoverGo’s <a href=\"https://apply.workable.com/covergo/gdpr_policy?lng=en\" target=\"_blank\" rel=\"nofollow noreferrer noopener\" class=\"external\">Privacy Notice</a> and you consent to the processing of your data as part of this application.</p><h3>Requirements: </h3><h3>Benefits: </h3>","tags":"[\"aws\"]","pubDate":"2024-02-28 00:00:00.000","link":"https://apply.workable.com/covergo/j/93F9578297","savedDate":"2024-03-02 05:22:14.300","slug":"solutions-architect-fully-remote-covergo-6929"},{"id":2872681837,"title":"Solutions Architect (Fully Remote)","company":"CoverGo","image":"https://pbs.twimg.com/profile_images/1382655628523364355/MWPIbbID_400x400.jpg","description":"<p><strong>Top 3 Reasons To Join Us</strong></p><ul> <li>Competitive Salary</li> <li>100% Remote</li> <li>Working on the latest tech for the Insurtech Market Leader</li> </ul><p><strong>About Us</strong></p><p>At CoverGo, our mission is to empower all insurance companies to make insurance 100% digital and accessible to everyone.</p><ul> <li>We are a leading global no-code insurance platform for health, life, and P&amp;C</li> <li>We’re the winner of the Insurtech of the Year in all of Asia and other awards globally</li> <li>We work with insurance enterprise clients such as AXA, Bupa, MSIG, Dai-ichi, Bank of China Group Insurance, and many more</li> <li>We're an international, diverse team of over 120 people with 30 nationalities and team members working remotely from all over the world</li> <li>We are fully funded and backed by reputable VC funds and strategic institutional investors</li> <li>We have a global presence in Asia, EMEA and the Americas</li> <li>We’ve grown our annualized revenue by over 30x since January 2021</li> <li>We’re constantly working towards making CoverGo a workplace that you love coming to. We deeply believe that bringing together a diversity of thoughts, expressions, and perspectives is key to building the best culture for equally diverse communities all over the world</li> </ul><p><strong>About the Role</strong></p><p>A cloud technology-focused individual who has demonstrated design &amp; delivery expertise in forward-looking solutions in a modern cloud-based insurance environment. The successful candidate will be technology agnostic but with a bias towards solutions leveraging heavily on an AWS and/or GCP environment that comprises elements of open-source, PaaS and SaaS components.</p><p>The Solution Architect works closely with Covergo-product and customer-project stakeholders to assess, design and support business initiatives, vetting them against defined roadmaps and incorporating them into Solution Approaches.</p><p>The Solution Architect will be responsible for defining the solution approach for the products, capabilities and technologies utilised in accordance with the Architecture Roadmap. The Solution Architect supports the development and maintenance of Enterprise Architecture (EA) roadmaps. This position is responsible for the implementation of enterprise-level API-led service-oriented and component-based solutions. This role also supports the promotion of EA standards, policies and guidelines to ensure appropriate application, implementation, and compatibility with company-wide information architectural and technical standards.</p><p><strong>What You Will Do</strong></p><ul> <li>Working with other Solution Architects and the CTO to build out the enterprise strategy for specific components of the Covergo Insurance Capability Framework</li> <li>Work closely with Product Managers to advise and define appropriate solution architectures</li> <li>Work closely with Delivery Managers to advise on the architecture approach to deploying the Covergo solution</li> <li>Explore a range of possibilities and creative alternatives to identify the most effective solutions</li> <li>Ensure the solutions designed are being implemented in the approved manner</li> <li>Assist in identifying, specifying and selecting off-the-shelf components for areas of the solution we wish to buy rather than build</li> <li>Divide large-scale initiatives into manageable easily deliverable solution components</li> <li>Knowledge transfer for Technical/Software Architects, BA’s and developers around what is required and providing support as required to ensure delivery of the architected solution</li> <li>Maintain an awareness of business solution components that fit our current and future operational needs to avoid building non-core IP areas of the product offering</li> </ul><p><strong>Required Skills and Knowledge</strong></p><ul> <li>At least 10 years of professional experience in solution architecture design and delivery roles in the insurance vertical with exposure to multiple lines of business</li> <li>Experienced in delivering cloud-based technology product solutions in an enterprise environment</li> <li>Ability to assist in defining and socialising a product/enterprise roadmap</li> <li>Ability to translate the roadmap into executable steps</li> <li>Understand business architecture models &amp; patterns</li> <li>Has designed and implemented innovative and creative solutions to business problems</li> <li>Can think \"outside the box\", but also be able to understand the business constraints that lead to “in the box” approaches</li> <li>Understand the optimum approaches for cloud-based applications with high availability and highly scalable solutions</li> <li>Experienced in designing solutions in a Relational DB and noSQL environment&nbsp;</li> <li>Experienced in designing for API &amp; Micro-services centric environments&nbsp;</li> <li>Demonstrated capability to self-learn new technology trends and approaches</li> <li>Ideally has experience or understanding of the benefits of low-code platforms&nbsp;</li> <li>While the Solution Architect is not expected to build the solutions experience of multiple development languages &amp; various DB engines will be advantageous</li> <li>Exposure to authentication and authorisation concepts (SSO, SAML integration, identity federation etc)</li> <li>Excellent communication skills (written and verbal)</li> </ul><p><strong>Required Competencies</strong></p><ul> <li>Must be equally comfortable discussing the solution strategies and enterprise roadmap with people at all levels of our organisation and CxO to project-level teams in our clients</li> <li>Excellent organisational, interpersonal &amp; communication skills and an ability to engage audiences</li> <li>Excellent decision-making and judgment skills</li> <li>Understanding of insurance business processes across all areas and at least two lines of business</li> <li>Maintains direction and focus through proactive planning and organized approaches to work</li> <li>Certification in one architecture discipline (TOGAF, Zachman, etc.) is a distinct advantage</li> <li>Certification in one cloud environment is a distinct advantage with a broad knowledge and experience of the cloud platform’s capabilities</li> <li>A high proficiency in working in English as your primary language</li> </ul><p><strong>Why You'll Love Working Here</strong></p><ul> <li>Fully Remote</li> <li>Flexible Leave</li> <li>International Environment</li> <li>Competitive renumeration package</li> <li>Performance Bonus</li> <li>Stock Options after 6 months </li> <li>Company activities and events</li> <li>Learning and development plan</li> </ul><p><strong>CoverGo Company </strong><a href=\"https://www.youtube.com/watch?v=YI0ezLxvFvA\" rel=\"nofollow noreferrer noopener\" class=\"external\"><strong>Video</strong></a></p><p>By submitting your application, you confirm that you have read, understood, and accepted the content of CoverGo’s <a href=\"https://apply.workable.com/covergo/gdpr_policy?lng=en\" target=\"_blank\" rel=\"nofollow noreferrer noopener\" class=\"external\">Privacy Notice</a> and you consent to the processing of your data as part of this application.</p><h3>Requirements: </h3><h3>Benefits: </h3>","tags":"[\"aws\"]","pubDate":"2024-02-28 00:00:00.000","link":"https://apply.workable.com/covergo/j/AD89F6BC35","savedDate":"2024-03-02 05:22:14.300","slug":"solutions-architect-fully-remote-covergo-3390"},{"id":1606008454,"title":"Business and Strategy Analyst - Empower Mexico","company":"Empower","image":"https://lever-client-logos.s3.us-west-2.amazonaws.com/2e1a369c-b58f-41ac-8d86-4b0a77695e68-1687915522032.png","description":"<div><b style=\"font-size: 24px\">EMPOWER OVERVIEW</b></div><div><br></div><div><a href=\"http://empower.me/\" class=\"postings-link\">Empower</a>&nbsp;is a fast-growing fintech based in San Francisco. We’re on a mission to expand access to fair credit to give anyone the opportunity to improve their financial security and mobility. Our mission started in the US, but we recently launched in Mexico, our first international market. That mission takes creativity, passion, and drive. Are you in?</div><div><br></div><div>Empower is backed by Sequoia Capital, Blisce, and Icon Ventures. Are we the next great place to grow your impact and accelerate your career? We think so:</div><div><br></div><div>Inc. ranked Empower #56 in the 2023 Inc. 5000 list of the fastest-growing private companies in the US (#55 in 2022). Forbes put Empower on its 2023 list of America's Best Startup Employers. Fast Company recognized the new Empower Thrive line of credit in their 2022 list of the Next Big Things in Tech. </div><div><br></div><div><b style=\"font-size: 18px\">THE EMPOWER WAY</b></div><div><b>Great Expectations</b>: We come up with bold, audacious goals for ourselves and go all out for impact</div><div><b>Owner Mindset</b>: We give every employee latitude to act independently, make smart choices, and move the business forward</div><div><b>Spirited Debate</b>: We love skeptics and seek counter opinions to challenge our personal assumptions and expand our view</div><div><b>Customer Obsession: </b>We listen to understand, empathize, and create a memorable, rewarding experience for our community</div><div><b>Inclusive Collaboration</b>: We believe diverse teams make the best decisions, and we strive to give diverse voices a seat at the table</div><div>N<b>o Jerks Allowed</b>: We value our relationships and take the time to build trust and connection and communicate respectfully</div><div><b>&nbsp;</b></div><div><b>&nbsp;</b></div><div><b style=\"font-size: 18px\">WHAT EMPOWER OFFERS</b></div><div>Competitive salary</div><div>Generous equity package</div><div>Full healthcare and dental benefits</div><div>Technology&nbsp; expense reimbursement</div><div>Work&nbsp; from anywhere</div><div><br></div><div><b style=\"font-size: 18px\">JOB DESCRIPTION</b></div><div>The Strategy and Business Analyst will help build out Empower Mexico’s analytical capabilities, business planning, and share strategic recommendations and data-based insights for products and programs critical to Empower Mexico’s growth, customer acquisition, and customer retention. You will partner closely with our leadership team to develop and present insights. Your insights will build the foundation for Empower Mexico’s scaled success as we scale the current product and bring new products to market. You will work as part of a small cross-functional remote team within the company that is exclusively dedicated to the Mexico operation. This role will allow you to wear multiple hats, making meaningful impact across diverse tasks. You will be working closely with Empower Mexico’s Business Lead and will have the opportunity to contribute to multiple areas of the business, including finance, operations, credit, compliance, and product development.</div><div><br></div><div>Travel for company offsites is expected at a minimum 2 times a year. </div><div><br></div><h3>Key Responsibilities</h3><li>Build analytical tools: Surface data-based insights through dashboards, automated reporting, and presentations that give both our internal stakeholders information critical to make decisions. Drive improvements to our data analysis infrastructure and processes.&nbsp;</li><li>Establish and monitor KPIs: Monitor day-to-day business, conduct data analysis to identify trends, patterns, and insights that inform business decision-making.</li><li>Help drive product positioning: Leverage customer data to inform product positioning and optimize our&nbsp;scaling efforts. Lead complex analyses on our products, develop case studies, and design experiments to improve product performance.</li><li>Build and maintain key partnerships: Oversee and nurture relationships with key vendors to ensure the consistent delivery of quality service.</li><li>Identify opportunities for automation and process improvement, work with the team to set up processes that allow us to keep scaling.</li><li>Help set strategic priorities: Partner with different teams to build business cases, refine product pricing, and develop incentive structures for our product.</li><li>Lead cross-functional initiatives: Collaborate with cross-functional colleagues in Product, Data Science, Credit, Marketing, Compliance and Engineering.</li><li>Wear multiple hats: Embrace the dynamic nature of our team at this exciting stage. Demonstrate versatility by willingly taking on a variety of tasks, contributing to the multifaceted growth of the team and the company.&nbsp;</li>,<h3>Candidate Qualifications</h3><li>Fluent written and verbal communication in both Spanish and English</li><li>Work authorization in Mexico or in the US</li><li>​​Motivated by Empower’s mission and determined to create a personable and meaningful experience for our customers</li><li>Minimum of&nbsp; 2+ years work experience in business, strategy, operations, management consulting and/or investment banking</li><li>Strong analytical abilities and are comfortable defining and measuring goals consistently</li><li>Strong customer empathy and experience shaping product direction and execution based on customer needs</li><li>A get-it-done mindset; you’re resourceful and happy to be hands on and in the weeds&nbsp;</li><li>An interest in addressing complicated and impactful product &amp; business problems</li><li>up your sleeves and building complex financial models in Excel or similar tools.</li><li>Strong strategic thinking, problem solving, and logical structuring abilities; enjoy rolling up your sleeves and building complex models in Excel or similar tools</li><li>Comfort with ambiguity; the ability to independently lay out and test clear hypotheses, and solve problems without well-defined direction</li><li>Excellent verbal and written communication skills</li><div><br></div><div>A strong plus if you:</div><li>Experience in SQL and / or Tableau</li><div>At Empower, we hire for people that push themselves to understand others and seek out ways to challenge their personal assumptions. Our hope is that by fostering such an environment, we strengthen our business and relationships by putting people first. We are committed to building a diverse, inclusive, and equitable workspace where everyone (regardless of age, education, ethnicity, gender, sexual orientation, or any personal characteristics) feels like they belong. Even if your experience doesn’t exactly match up to our job description, you should feel empowered to apply regardless!&nbsp;</div>","tags":"[\"Finance\",\"management\",\"engineering\"]","pubDate":"2024-02-27 22:52:56.939","link":"https://jobs.lever.co/empower.me/456428da-7789-4d0e-8508-b70a8eba34b7","savedDate":"2024-03-02 05:22:14.302","slug":"business-and-strategy-analyst-empower-mexico-empower-7502"},{"id":1752727383,"title":"Paralegal (Remote)","company":"DuckDuckGo","image":"https://spreadprivacy.com/content/images/2023/05/duckduckgo-logo_wide.png","description":"<p>Hi, we’re DuckDuckGo, the Internet privacy company for everyone who wants to take back their privacy now. For over a decade, we've been building our all-in-one product, developing new privacy technology, and working with policymakers to make online privacy simple and accessible for all.<br /></p>\n<p><br /></p>\n<p>Our app is now downloaded more than 78M times a year, and our private search engine packaged with it has become the #2 search engine on mobile in the United States and 18 other countries, including the United Kingdom, Canada, Australia, Germany, and the Netherlands. Oh, and we've been profitable since 2014, with revenue exceeding $100 million a year! Now, we’re rolling out a suite of new privacy solutions, including <u><a href=\"https://www.spreadprivacy.com/introducing-email-protection-beta/\" rel=\"noopener\">Email Protection</a></u>,  <u><a href=\"https://spreadprivacy.com/introducing-app-tracking-protection/\" rel=\"noopener\">App Tracking Protection</a></u> and our first-ever Desktop Apps for <u><a href=\"https://spreadprivacy.com/introducing-duckduckgo-for-mac/\" rel=\"noopener\">Mac</a></u><a href=\"https://spreadprivacy.com/introducing-duckduckgo-for-mac/\" rel=\"noopener\"> </a>and <u><a href=\"https://spreadprivacy.com/windows-browser-open-beta/\" rel=\"noopener\">Windows</a></u>.</p>\n<p><br /></p>\n<p>We’re looking for a Paralegal to help shape our all-in-one privacy solution and join our mission to show the world that protecting your privacy online can be simple.  </p>\n<p><br /></p>\n<p><strong>The Opportunity</strong> </p>\n<p>In this role, you will provide legal and administrative support to DuckDuckGo’s small but mighty team of seven attorneys. Our operations span the globe, so our lawyers do as well! We’re looking for someone who has the desire to work in a variety of legal subject matters. Your expertise and proactive approach will be instrumental in maintaining compliance, facilitating strategic decision-making, and ensuring that corporate legal processes function smoothly.</p>\n<p><br /></p>\n<p><strong>What you will do (non-exclusive list)</strong></p>\n<ul><li>Review, organize, and triage incoming legal matters.</li><li>Assist in drafting and maintaining legal documents, including contracts, agreements, and corporate governance documents.</li><li>Manage and maintain legal files and documentation, ensuring compliance with record-keeping requirements and corporate filings.</li><li>Coordinate with external counsel and other third-party vendors as needed.</li><li>Support the legal team in responding to government inquiries, subpoenas, or other requests for information, including managing production.</li><li>Keep up with relevant laws, regulations, and industry trends to provide proactive support to the legal team.</li></ul>\n<p><br /></p>\n<p><strong>What You Will Bring to DuckDuckGo</strong> </p>\n<ul><li>Ability to lead and/or collaborate on projects from proposal through postmortem.  </li><li>Skills to wrangle vague problems, propose innovative solutions, and execute them with a strong focus on metrics. </li><li>Strong research and analytical skills, with the ability to synthesize complex legal information.</li><li>Excellent organizational and time management skills, with a keen attention to detail.</li><li>Strong written and verbal communication skills.</li><li>Proficiency in Microsoft Office, including Word, Outlook, and Excel.</li><li>Experience with Asana or other project management software preferred.</li><li>Certification or degree in paralegal studies, or equivalent work experience.</li><li>Minimum of 3 years of paralegal experience, with in-house experience a plus.</li></ul>\n<p><br /></p>\n<p><strong>How We Will Support You </strong> </p>\n<p>Our core values -- build trust, question assumptions, and validate direction -- underpin how we work day-to-day and the support we give our team members. We strive to empower our team members to be self-directed and self-motivated in their work.  </p>\n<p><br /></p>\n<ul><li><strong>Remote First, Always</strong>: We've always been a fully distributed company with team members all over the world. We trust you to get your work done wherever, and whenever.   </li><li><strong>Commitment to Personal Growth:</strong> Every team member has an annual budget of $1,250 USD to invest in their professional development. Every team member also has a dedicated Career Advisor, who serves as a guide to help you develop your strengths, identify your motivations, and understand your opportunities for growth. </li><li><strong>Leadership:</strong> We have many different types of leaders and possible combinations of leadership roles, so you can grow your career in a way that aligns best with your personal goals. You can seek additional leadership roles by being directly responsible for projects, taking ownership of areas of the company, developing and maintaining internal processes, or pursuing advisory roles. </li><li><strong>Work/Life Balance: </strong>Team members have the freedom and flexibility to organize their own work schedules. We want you to thrive both in and out of the office. We trust you to use good judgment and take the time off that you need to bring your best self to work.  </li></ul>\n<p><br /></p>\n<p>We also offer paid parental leave, a co-working stipend, office setup reimbursement, and a wellness stipend. More support resources can be found in our <u><a href=\"https://duckduckgo.com/assets/hiring/team_support_guide.pdf\" rel=\"noopener\">Team Member Support Guide</a></u>, which explains how we make your well-being a priority. </p>\n<p><br /></p>\n<p>For more information on how we collaborate worldwide, from leadership in our relatively flat organization to start-to-finish ownership<strong>,</strong> check out <u><a href=\"https://duckduckgo.com/assets/hiring/how_we_work.pdf\" rel=\"noopener\">DuckDuckGo Culture: How We Work.</a></u> </p>\n<p><br /></p>\n<p><strong>Compensation</strong> </p>\n<p>Annual compensation: $115,000-$129,000 USD, based on experience, and stock options. Compensation is the same within a professional level, regardless of geographic location or functional area, and the compensation for each professional level is transparent across the organization.</p>\n<p><br /></p>\n<p><strong>Hiring Process</strong> </p>\n<p>Hiring works best when it's a two-way street. Learn how we help you get to know DuckDuckGo and envision your future role here. Find out more about <u><a href=\"https://duckduckgo.com/assets/hiring/how_we_hire.pdf\" rel=\"noopener\">how we hire</a></u>. </p>\n<p><br /></p>\n<p><strong>Diversity, Equity, and Inclusion</strong> </p>\n<p>DuckDuckGo provides equal work opportunities to all team members and applicants<u>,</u> and it prohibits discrimination and harassment of any type on the basis of race, color, ethnicity, caste, religion, age, sex (including pregnancy), national origin, disability status, genetics, protected veteran status, sexual orientation, gender identity or expression, or any other characteristic protected by our policies or federal, state, or local laws.</p>\n<p><br /></p>\n<p>We want to ensure that our hiring process is accessible. If you need reasonable accommodation for any part of the application process because of a medical condition or disability, please send an email to <u><a href=\"mailto:careers@duckduckgo.com\" rel=\"noopener\">careers@duckduckgo.com</a></u> to let us know the nature of your request.  </p>\n<p><br /></p>\n<p>If you think you might thrive in this environment, we would love to hear from you. </p>\n<p><br /></p>\n<p><strong>Please note that:</strong> </p>\n<ol><li>Sometimes we meet up! Expect to travel at least two times a year: once for our all-hands meetup and again for a team retreat (each around 4-5 days). While extenuating circumstances may impact attendance, everyone is strongly encouraged to attend.</li><li>While we offer a flexible work arrangement with no core hours, expect an average full-time commitment of 40 hours per week. </li><li>A successful candidate will be subject to a background check and must receive satisfactory results of the same, as a condition of joining the team. </li><li>By applying for this role, you confirm that all information submitted is accurate and complete. You further acknowledge that providing false or fraudulent information during the application process is cause for denial of an offer, revocation of any existing offer, or other adverse action, up to and including termination after the start of your commencement of work.  </li></ol>\n<p>#LI-DNI</p>","tags":"[\"management\",\"legal\",\"aws\"]","pubDate":"2024-02-21 20:33:02.000","link":"https://duckduckgo.recruitee.com/o/paralegal","savedDate":"2024-03-02 05:22:14.296","slug":"paralegal-remote-duckduckgo-5918"},{"id":8363214555,"title":"BI Analyst - Strategic Finance (Remote)","company":"DuckDuckGo","image":"https://spreadprivacy.com/content/images/2023/05/duckduckgo-logo_wide.png","description":"<p>Hi, we’re DuckDuckGo, the Internet privacy company for everyone who wants to take back their privacy now. For over a decade, we've been building our all-in-one product, developing new privacy technology, and working with policymakers to make online privacy simple and accessible for all. </p>\n<p><br /></p>\n<p>Our app is now downloaded more than 78M times a year, and our private search engine packaged with it has become the #2 search engine on mobile in the United States and 18 other countries, including the United Kingdom, Canada, Australia, Germany, and the Netherlands. Oh, and we've been profitable since 2014, with revenue exceeding $100 million a year! Now, we’re rolling out a suite of new privacy solutions, including <u><a href=\"https://www.spreadprivacy.com/introducing-email-protection-beta/\" rel=\"noopener\">Email Protection</a></u>,  <u><a href=\"https://spreadprivacy.com/introducing-app-tracking-protection/ \" rel=\"noopener\">App Tracking Protection</a></u> and our first-ever Desktop Apps for <u><a href=\"https://spreadprivacy.com/introducing-duckduckgo-for-mac/\" rel=\"noopener\">Mac</a></u><a href=\"https://spreadprivacy.com/introducing-duckduckgo-for-mac/\" rel=\"noopener\"> </a>and <u><a href=\"https://spreadprivacy.com/windows-browser-open-beta/\" rel=\"noopener\">Windows</a></u>.</p>\n<p><br /></p>\n<p>We’re looking for a <strong>BI Analyst - Strategic Finance</strong> to help shape our all-in-one privacy solution and join our mission to show the world that protecting your privacy online can be simple.  </p>\n<p><br /></p>\n<p><strong>The Opportunity</strong> </p>\n<p>In this role, you'll be a data analytics subject matter expert within our Finance team, partnering with various business teams to develop visualizations of core metrics and analyzing performance trends to drive business insights. Additionally, you'll support the development of metric target setting and financial forecasts as we continue on our journey to accelerate growth.</p>\n<p><br /></p>\n<p><strong>What You Will Bring to DuckDuckGo</strong> </p>\n<ul><li>Ability to lead and collaborate on high-impact and complex projects from proposal through post-mortem.  </li><li>Skills to wrangle vague problems, propose innovative solutions, and execute them with a strong focus on metrics. </li><li>5+ years of experience working in Business Intelligence, with a focus on BI/Data Visualization</li><li>At least 2 years of experience working on financial analysis (P&amp;L, reporting, forecasting etc.)</li><li>Advanced proficiency with Tableau, SQL and Microsoft Excel</li><li>Passion for teaching, mentoring and guiding other stakeholders to use BI tools and best practices</li></ul>\n<p><br /></p>\n<p><strong>How We Will Support You </strong> </p>\n<p>Our core values -- build trust, question assumptions, and validate direction -- underpin how we work day-to-day and the support we give our team members. We strive to empower our team members to be self-directed and self-motivated in their work.  </p>\n<p><br /></p>\n<ul><li><strong>Remote First, Always</strong>: We've always been a fully distributed company with team members all over the world. We trust you to get your work done wherever, and whenever.   </li><li><strong>Commitment to Personal Growth:</strong> Every team member has an annual budget of $1,250 USD to invest in their professional development. Every team member also has a dedicated Career Advisor, who serves as a guide to help you develop your strengths, identify your motivations, and understand your opportunities for growth. </li><li><strong>Leadership:</strong> We have many different types of leaders and possible combinations of leadership roles, so you can grow your career in a way that aligns best with your personal goals. You can seek additional leadership roles by being directly responsible for projects, taking ownership of areas of the company, developing and maintaining internal processes, or pursuing advisory roles. </li><li><strong>Work/Life Balance: </strong>Team members have the freedom and flexibility to organize their own work schedules. We want you to thrive both in and out of the office. We trust you to use good judgment and take the time off that you need to bring your best self to work.  </li></ul>\n<p><br /></p>\n<p>We also offer paid parental leave, a co-working stipend, office setup reimbursement, and a wellness stipend. More support resources can be found in our <u><a href=\"https://duckduckgo.com/assets/hiring/team_support_guide.pdf\" rel=\"noopener\">Team Member Support Guide</a></u>, which explains how we make your well-being a priority. </p>\n<p><br /></p>\n<p>For more information on how we collaborate worldwide, from leadership in our relatively flat organization to start-to-finish ownership<strong>,</strong> check out <u><a href=\"https://duckduckgo.com/assets/hiring/how_we_work.pdf\" rel=\"noopener\">DuckDuckGo Culture: How We Work.</a></u> </p>\n<p><br /></p>\n<p><strong>Compensation</strong> </p>\n<p>Annual compensation: <strong>$144,667</strong> USD and stock options. Compensation is the same within a professional level, regardless of geographic location or functional area, and the compensation for each professional level is transparent across the organization.</p>\n<p><br /></p>\n<p><strong>Hiring Process</strong> </p>\n<p>Hiring works best when it's a two-way street. Learn how we help you get to know DuckDuckGo and envision your future role here. Find out more about <u><a href=\"https://duckduckgo.com/assets/hiring/how_we_hire.pdf\" rel=\"noopener\">how we hire</a></u>. </p>\n<p><br /></p>\n<p><strong>Diversity, Equity, and Inclusion</strong> </p>\n<p>DuckDuckGo provides equal work opportunities to all team members and applicants<u>,</u> and it prohibits discrimination and harassment of any type on the basis of race, color, ethnicity, caste, religion, age, sex (including pregnancy), national origin, disability status, genetics, protected veteran status, sexual orientation, gender identity or expression, or any other characteristic protected by our policies or federal, state, or local laws.</p>\n<p><br /></p>\n<p>We want to ensure that our hiring process is accessible. If you need reasonable accommodation for any part of the application process because of a medical condition or disability, please send an email to <u><a href=\"mailto:careers@duckduckgo.com\" rel=\"noopener\">careers@duckduckgo.com</a></u> to let us know the nature of your request.  </p>\n<p><br /></p>\n<p>If you think you might thrive in this environment, we would love to hear from you. </p>\n<p><br /></p>\n<p><strong>Please note that:</strong> </p>\n<ol><li>Sometimes we meet up! Expect to travel at least two times a year: once for our all-hands meetup and again for a team retreat (each around 4-5 days). While extenuating circumstances may impact attendance, everyone is strongly encouraged to attend.</li><li>While we offer a flexible work arrangement with no core hours, expect an average full-time commitment of 40 hours per week. </li><li>A successful candidate will be subject to a background check and must receive satisfactory results of the same, as a condition of joining the team. </li><li>By applying for this role, you confirm that all information submitted is accurate and complete. You further acknowledge that providing false or fraudulent information during the application process is cause for denial of an offer, revocation of any existing offer, or other adverse action, up to and including termination after the start of your commencement of work.  </li></ol>\n<p><br /></p>\n<div><p>#US #UK #SP #PL #IR #IC #HN #CR #CN #AU</p></div>\n<div><br /></div>\n<p><br /></p>","tags":"[\"Finance\",\"aws\"]","pubDate":"2024-02-20 20:00:01.000","link":"https://duckduckgo.recruitee.com/o/bi-analyst-strategic-finance-remote","savedDate":"2024-03-02 05:22:14.295","slug":"bi-analyst-strategic-finance-remote-duckduckgo-69"},{"id":3371361113,"title":"Engineering Director, Desktop Apps","company":"DuckDuckGo","image":"https://spreadprivacy.com/content/images/2023/05/duckduckgo-logo_wide.png","description":"<p><strong><u>Job Description</u></strong></p>\n<p>Hi, we’re DuckDuckGo, the Internet privacy company for everyone who wants to take back their privacy now. For over a decade, we've been building our all-in-one product, developing new privacy technology, and working with policymakers to make online privacy simple and accessible for all. </p>\n<p><br /></p>\n<p>Our app is now downloaded more than 78M times a year, and our private search engine packaged with it has become the #2 search engine on mobile in the United States and 18 other countries, including the United Kingdom, Canada, Australia, Germany, and the Netherlands. Oh, and we've been profitable since 2014, with revenue exceeding $100 million a year! Now, we’re rolling out a suite of new privacy solutions, including <u><a href=\"https://www.spreadprivacy.com/introducing-email-protection-beta/\" rel=\"noopener\">Email Protection</a></u>,  <u><a href=\"https://spreadprivacy.com/introducing-app-tracking-protection/\" rel=\"noopener\">App Tracking Protection</a></u> and our first-ever Desktop Apps for <u><a href=\"https://spreadprivacy.com/introducing-duckduckgo-for-mac/\" rel=\"noopener\">Mac</a></u><a href=\"https://spreadprivacy.com/introducing-duckduckgo-for-mac/\" rel=\"noopener\"> </a>and <u><a href=\"https://spreadprivacy.com/windows-browser-open-beta/\" rel=\"noopener\">Windows</a></u>.</p>\n<p><br /></p>\n<p>We’re looking for an Engineering Director, Desktop Apps to help shape our all-in-one privacy solution and join our mission to show the world that protecting your privacy online can be simple.  </p>\n<p><br /></p>\n<p><strong>The Opportunity</strong></p>\n<p>In this role, you will not only influence how our Desktop browsing applications are built but also shape how the engineering team grows, coaching and mentoring technically focused developers - helping them make solid decisions that scale and are performant.</p>\n<p><br /></p>\n<p>As a leader on a core DuckDuckGo product, you'll take ownership of complex projects and work to guide solutions on our most ambiguous and challenging problems.</p>\n<p><br /></p>\n<p><strong>What You Will Bring to DuckDuckGo</strong></p>\n<ul><li>Proven ability to lead and collaborate on high-impact and complex projects from proposal through post-mortem.</li><li>Proven ability to handle vague problems, propose innovative solutions, and execute on them with a strong focus on metrics and impact.</li><li>10+ years experience leading teams of technically strong developers working on large, complex consumer-facing products, desktop in particular.</li><li>Proven leadership experience across multiple consumer-facing products — you've made critical decisions that have broad, positive, and cascading impacts.</li><li>4+ years experience in senior leadership roles including people management, coaching, and mentoring experience.</li><li>Proven experience of leading technical teams through periods of rapid growth and scaling.</li></ul>\n<p><br /></p>\n<p><strong>How We Will Support You </strong> </p>\n<p>Our core values -- build trust, question assumptions, and validate direction -- underpin how we work day-to-day and the support we give our team members. We strive to empower our team members to be self-directed and self-motivated in their work.  </p>\n<p><br /></p>\n<ol><li><strong>Remote First, Always</strong>: We've always been a fully distributed company with team members all over the world. We trust you to get your work done wherever, and whenever.   </li><li><strong>Commitment to Personal Growth:</strong> Every team member has an annual budget of $1,250 USD to invest in their professional development. <em><strong>For team members in designated leadership roles, we offer reimbursement for leadership coaching services. The reimbursement amount varies by professional level. </strong></em>Every team member also has a dedicated Career Advisor, who serves as a guide to help you develop your strengths, identify your motivations, and understand your opportunities for growth. </li><li><strong>Leadership:</strong> We have many different types of leaders and possible combinations of leadership roles, so you can grow your career in a way that aligns best with your personal goals. You can seek additional leadership roles by being directly responsible for projects, taking ownership of areas of the company, developing and maintaining internal processes, or pursuing advisory roles. </li><li><strong>Work/Life Balance: </strong>Team members have the freedom and flexibility to organize their own work schedules. We want you to thrive both in and out of the office. We trust you to use good judgment and take the time off that you need to bring your best self to work.  </li></ol>\n<p><br /></p>\n<p>We also offer paid parental leave, a co-working stipend, office setup reimbursement, and a wellness stipend. More support resources can be found in our <u><a href=\"https://duckduckgo.com/assets/hiring/team_support_guide.pdf\" rel=\"noopener\">Team Member Support Guide</a></u>, which explains how we make your well-being a priority. </p>\n<p><br /></p>\n<p>For more information on how we collaborate worldwide, from leadership in our relatively flat organization to start-to-finish ownership<strong>,</strong> check out <u><a href=\"https://duckduckgo.com/assets/hiring/how_we_work.pdf\" rel=\"noopener\">DuckDuckGo Culture: How We Work.</a></u> </p>\n<p><br /></p>\n<p><strong>Compensation</strong> </p>\n<p>Annual compensation: 242,000 USD and stock options. Compensation is the same within a professional level, regardless of geographic location or functional area, and the compensation for each professional level is transparent across the organization.</p>\n<p><br /></p>\n<p><strong>Hiring Process</strong> </p>\n<p>Hiring works best when it's a two-way street. Learn how we help you get to know DuckDuckGo and envision your future role here. Find out more about <u><a href=\"https://duckduckgo.com/assets/hiring/how_we_hire.pdf\" rel=\"noopener\">how we hire</a></u>. </p>\n<p><br /></p>\n<p><strong>Diversity, Equity, and Inclusion</strong> </p>\n<p>DuckDuckGo provides equal work opportunities to all team members and applicants<u>,</u> and it prohibits discrimination and harassment of any type on the basis of race, color, ethnicity, caste, religion, age, sex (including pregnancy), national origin, disability status, genetics, protected veteran status, sexual orientation, gender identity or expression, or any other characteristic protected by our policies or federal, state, or local laws.</p>\n<p><br /></p>\n<p>We want to ensure that our hiring process is accessible. If you need reasonable accommodation for any part of the application process because of a medical condition or disability, please send an email to <u><a href=\"mailto:careers@duckduckgo.com\" rel=\"noopener\">careers@duckduckgo.com</a></u> to let us know the nature of your request.  </p>\n<p><br /></p>\n<p>If you think you might thrive in this environment, we would love to hear from you. </p>\n<p><br /></p>\n<p><strong>Please note that:</strong> </p>\n<ol><li>Sometimes we meet up! Expect to travel at least two times a year: once for our all-hands meetup and again for a team retreat (each around 4-5 days). While extenuating circumstances may impact attendance, everyone is strongly encouraged to attend.</li><li>While we offer a flexible work arrangement with no core hours, expect an average full-time commitment of 40 hours per week. </li><li>A successful candidate will be subject to a background check and must receive satisfactory results of the same, as a condition of joining the team. </li><li>By applying for this role, you confirm that all information submitted is accurate and complete. You further acknowledge that providing false or fraudulent information during the application process is cause for denial of an offer, revocation of any existing offer, or other adverse action, up to and including termination after the start of your commencement of work.  </li></ol>","tags":"[\"management\",\"engineering\",\"aws\"]","pubDate":"2024-02-20 15:05:04.000","link":"https://duckduckgo.recruitee.com/o/engineering-director-desktop-apps","savedDate":"2024-03-02 05:22:14.298","slug":"engineering-director-desktop-apps-duckduckgo-8506"},{"id":2871677680,"title":"Big Data Engineer (IB)","company":"Blue Coding","image":"https://lever-client-logos.s3.us-west-2.amazonaws.com/3c1d9ac7-6738-46c5-b6ca-a35fa2a0df57-1666278594128.png","description":"<div><i style=\"font-size: 18px\">Do you want to earn a salary in USD?&nbsp;</i></div><div><i style=\"font-size: 18px\">Would you like to work from wherever you want?</i></div><div><i style=\"font-size: 18px\">Would you like to be a part of the leading next-gen software developers?&nbsp;</i></div><div><br></div><div><b style=\"font-size: 24px\">Hi, you finally found us!</b><span style=\"font-size: 24px\">&nbsp;</span></div><div><br></div><div><b style=\"font-size: 24px\">Why work at Blue Coding?</b><span style=\"font-size: 24px\">&nbsp;</span></div><div><br></div><div>At Blue Coding we specialize in hiring excellent developers and amazing people from all over Latin America and other parts of the world. For the past 9 years, we’ve helped cutting-edge companies in the United States and Canada -both large and small, build great development teams and develop great products. Online shops, digital agencies, SaaS providers, and software consulting firms are a few of our clients. Our team of over 100 engineers is distributed in more than 10 countries across the Americas. We are a fully remote company working with a wide array of technologies and have expertise in every stage of the software development process.&nbsp;&nbsp;</div><div><br></div><div>Our team is highly connected, united, and culturally diverse, and our collaborators are involved in many initiatives around the world, from wildlife preservation to volunteering at local charities. We also participate in group activities like movie nights, trivia, and meme competitions. We stand for honesty, fairness, respect, efficiency, hard work, and cooperation.</div><div><br></div><div><b style=\"font-size: 16px\">What are we looking for?</b></div><div><span style=\"font-size: 16px\">In this opportunity, we are looking for a Big Data Engineer to work with one of our foreign clients, who are providing work with diverse clients in different industries including, Health, Legal, and Automotive.</span></div><div><a href=\"http://automotive.if/\" style=\"font-size: 16px\" class=\"postings-link\">If</a><span style=\"font-size: 16px\"> you are independent, a great communicator, a problem solver, and have strong attention to detail, this is a great fit for you! Our jobs are fully remote – as long as you have the skills and can get the work done well, you can work anywhere in the listed countries you want.</span></div><div><span style=\"font-size: 16px\">If you have the skills and can get the job done, join us and work from anywhere you want!</span></div><div><br></div><div><b style=\"font-size: 16px\">What's unique about this job?</b></div><div><span style=\"font-size: 16px\">As a Big Data Engineer, you’ll be </span><span style=\"font-size: 15px\">working with a great group of technologists interested in finding the right database to use, the right technology for the job in a culture that encourages innovation. We are looking for individuals who can design and solve any data problems using different types of databases and technologies supported within our team. We use MPP databases to analyze billions of rows in seconds. We use Spark and Iceberg, batch or streaming to process whatever the data needs are. We also use Trino to connect all different types of data without moving them around.</span></div><h3>Here are some of the exciting day-to-day challenges you will face in this role:</h3><li>Implement ETL/ELT processes using various tools and programming languages (Scala, Python) against our MPP databases StarRocks, Vertica and Snowflake</li><li>Work with the Hadoop team and optimize Hive and Iceberg tables</li><li>Contribute to the existing Data Lake and Data Warehouse imitative using Hive, Spark, Iceberg, Presto/Trino</li><li>Analyze business requirements, design and implement required data models</li>,<h3>You will shine if you have these:</h3><li>BA/BS in Computer Science or in related field</li><li>1+ years of experience with MPP databases such as StarRocks, Vertica, Snowflake</li><li>3+ years of experience with RDBMS databases such as Oracle, MSSQL or PostgreSQL</li><li>Programming background with Scala, Python, Java or C/C++</li><li>Strong in any of the Linux distributions, RHEL,CentOS or Fedora</li><li>Experience working in both OLAP and OLTP environments</li><li>Experience working on-prem, not just cloud environments</li><div><br></div>,<h3>Nice to have qualifications:</h3><li>Experience with Elasticsearch or ELK stack</li><li>Working knowledge of streaming technologies such as Kafka</li><li>Working knowledge of orchestration tools such Oozie and Airflow</li><li>Experience with Spark. PySpark, SparkSQL, Spark Streaming, etc…</li><li>Experience using ETL tools such as Informatica, Talend and/or Pentaho</li><li>Understanding of Healthcare data</li><li>Data Analyst or Business Intelligence would be a plus</li>,<h3>Here are some of the perks we offer you:</h3><li>Salary in USD</li><li>Long-term</li><li>Flexible schedule (within US Time zones)</li><li>100% Remote</li><div><b style=\"font-size: 24px\">Hey, you are still here!</b><span style=\"font-size: 24px\">&nbsp;</span></div><div><br></div><div>So, let us ask a few questions. Do you like working in a friendly environment? Are you fluent in English? Do you have a strong work ethic, are detail-oriented and have an ownership mentality? And most importantly do you love music and puppies? If so, then what are you waiting for? Come join our team and become part of this awesome company! We will be expecting you.</div>","tags":"[\"postgres\",\"legal\",\"database\"]","pubDate":"2024-01-30 20:43:16.469","link":"https://jobs.lever.co/bluecoding/38d6b7d7-cfb3-4ab7-b084-8437c752ce85","savedDate":"2024-03-02 05:22:14.306","slug":"big-data-engineer-ib-blue-coding-1337"},{"id":3578380143,"title":"Senior Big Data Engineer (IB)","company":"Blue Coding","image":"https://lever-client-logos.s3.us-west-2.amazonaws.com/3c1d9ac7-6738-46c5-b6ca-a35fa2a0df57-1666278594128.png","description":"<div><i style=\"font-size: 18px\">Do you want to earn a salary in USD?&nbsp;</i></div><div><i style=\"font-size: 18px\">Would you like to work from wherever you want?</i></div><div><i style=\"font-size: 18px\">Would you like to be a part of the leading next-gen software developers?&nbsp;</i></div><div><br></div><div><b style=\"font-size: 24px\">Hi, you finally found us!</b><span style=\"font-size: 24px\">&nbsp;</span></div><div><br></div><div><b style=\"font-size: 24px\">Why work at Blue Coding?</b><span style=\"font-size: 24px\">&nbsp;</span></div><div><br></div><div>At Blue Coding we specialize in hiring excellent developers and amazing people from all over Latin America and other parts of the world. For the past 9 years, we’ve helped cutting-edge companies in the United States and Canada -both large and small, build great development teams and develop great products. Online shops, digital agencies, SaaS providers, and software consulting firms are a few of our clients. Our team of over 100 engineers is distributed in more than 10 countries across the Americas. We are a fully remote company working with a wide array of technologies and have expertise in every stage of the software development process.&nbsp;&nbsp;</div><div><br></div><div>Our team is highly connected, united, and culturally diverse, and our collaborators are involved in many initiatives around the world, from wildlife preservation to volunteering at local charities. We also participate in group activities like movie nights, trivia, and meme competitions. We stand for honesty, fairness, respect, efficiency, hard work, and cooperation.</div><div><br></div><div><b style=\"font-size: 16px\">What are we looking for?</b></div><div><span style=\"font-size: 16px\">In this opportunity, we are looking for a Senior Big Data Engineer to work with one of our foreign clients, who are providing work with diverse clients in different industries including, Health, Legal, and Automotive.</span></div><div><span style=\"font-size: 16px\">If you are independent, a great communicator, a problem solver, and have strong attention to detail, this is a great fit for you! Our jobs are fully remote – as long as you have the skills and can get the work done well, you can work anywhere in the listed countries you want.</span></div><div><span style=\"font-size: 16px\">If you have the skills and can get the job done, join us and work from anywhere you want!</span></div><h3>Here are some of the exciting day-to-day challenges you will face in this role:</h3><li>Implement ETL/ELT processes using various tools and programming languages (Scala, Python) against our MPP databases StarRocks, Vertica and Snowflake&nbsp;</li><li>As Data Engineers, not only are we developers, but we also maintain and administrate our MPP ecosystem.&nbsp; We will tune and maximize our hardware potential from OS, network and storage levels&nbsp;</li><li>Work with the Hadoop team and optimize Hive and Iceberg tables&nbsp;</li><li>Running POC between different table formats&nbsp;</li><li>Contribute to the existing Data Lake and Data Warehouse imitative using Hive, Spark, Iceberg, Presto/Trino&nbsp;</li><li>Analyze business requirements, design and implement required data models&nbsp;</li>,<h3>You will shine if you have these:</h3><li>BA/BS in Computer Science or in related field&nbsp;</li><li>2+ years of experience with MPP databases such as StarRocks, Vertica, Snowflake&nbsp;</li><li>5+ years of experience with RDBMS databases such as Oracle, MSSQL or PostgreSQL&nbsp;</li><li>2+ years of experience managing or developing in the Hadoop ecosystem&nbsp;</li><li>Programming background with Scala, Python, Java or C/C++&nbsp;</li><li>Experience with Elasticsearch or ELK stack&nbsp;</li><li>Working knowledge of streaming technologies such as Kafka&nbsp;</li><li>Strong in any of the Linux distributions, RHEL,CentOS or Fedora&nbsp;</li><li>Deep knowledge shell scripting, scheduling, and monitoring processes on Linux&nbsp;</li><li>Experience working in both OLAP and OLTP environments&nbsp;</li><li>Experience working on-prem, not just cloud environments&nbsp;</li>,<h3>It doesn't hurt if you also have:</h3><li>Working knowledge of data unification and setup using Presto/Trino&nbsp;</li><li>Working knowledge of orchestration tools such Oozie and Airflow&nbsp;</li><li>Experience with Spark. PySpark, SparkSQL, Spark Streaming, etc…&nbsp;</li><li>Experience using ETL tools such as Informatica, Talend and/or Pentaho&nbsp;</li><li>Understanding of Healthcare data&nbsp;</li><li>Data Analyst or Business Intelligence would be a plus&nbsp;</li>,<h3>Here are some of the perks we offer you:</h3><li>Salary in USD</li><li>Long-term</li><li>Flexible schedule (within US Time zones)</li><li>100% Remote</li><div><b style=\"font-size: 24px\">Hey, you are still here!</b><span style=\"font-size: 24px\">&nbsp;</span></div><div><br></div><div>So, let us ask a few questions. Do you like working in a friendly environment? Are you fluent in English? Do you have a strong work ethic, are detail-oriented and have an ownership mentality? And most importantly do you love music and puppies? If so, then what are you waiting for? Come join our team and become part of this awesome company! We will be expecting you.</div>","tags":"[\"postgres\",\"legal\",\"database\"]","pubDate":"2024-01-30 20:37:01.479","link":"https://jobs.lever.co/bluecoding/06b1fd9b-1f41-43ea-aa2c-0f2281d34a14","savedDate":"2024-03-02 05:22:14.306","slug":"senior-big-data-engineer-ib-blue-coding-4392"}]