[{"id":6452605488,"title":"Support Engineer","company":"Kinsta","image":"https://avatars.githubusercontent.com/u/4136982?s=200&v=4","description":"<div><span style=\"font-size: 16px;\">Kinsta is one of the top-managed </span><b style=\"font-size: 16px;\">WordPress hosting companies,</b><span style=\"font-size: 16px;\"> with a growing club of 120,000+ businesses including startups, universities and Fortune 500 firms. We're motivated by excellent quality, and proud to have received a</span><b style=\"font-size: 16px;\"> 97% satisfaction rating from our customers</b><span style=\"font-size: 16px;\">.</span></div><div><br></div><div><span style=\"font-size: 16px;\">That's because, to us, each day is a chance to </span><b style=\"font-size: 16px;\">grow</b><span style=\"font-size: 16px;\">. As a team, we continuously inspire each other to learn new and better ways to make an impact. We own our jobs proudly - our leaders don't hold our hands, but they're in our corner whenever we ask for help - and our environment is </span><b style=\"font-size: 16px;\">flexible</b><span style=\"font-size: 16px;\"> and </span><b style=\"font-size: 16px;\">remote-first.</b></div><div><br></div><div><span style=\"font-size: 16px;\">As our new Support Engineer, you'll use your technical knowledge, curiosity, and eloquence to provide world-class technical support to our customers through our live chat system. Reporting to the Support Manager, you will join the beating heart of Kinsta - a team embodying our DNA and desire to provide industry-leading support.</span></div><div><br></div><div><span style=\"font-size: 16px;\">This role's shift needs are </span><b><span style=\"font-size: 16px;\">2 PM—10 PM&nbsp;UTC </span></b><span style=\"font-size: 16px;\">(our team uses UTC for scheduling).</span></div><div><span style=\"font-size: 16px;\">Kinsta is one of the top-managed </span><b style=\"font-size: 16px;\">WordPress hosting companies,</b><span style=\"font-size: 16px;\"> with a growing club of 120,000+ businesses including startups, universities and Fortune 500 firms. We're motivated by excellent quality, and proud to have received a</span><b style=\"font-size: 16px;\"> 97% satisfaction rating from our customers</b><span style=\"font-size: 16px;\">.</span></div><div><br></div><div><span style=\"font-size: 16px;\">That's because, to us, each day is a chance to </span><b style=\"font-size: 16px;\">grow</b><span style=\"font-size: 16px;\">. As a team, we continuously inspire each other to learn new and better ways to make an impact. We own our jobs proudly - our leaders don't hold our hands, but they're in our corner whenever we ask for help - and our environment is </span><b style=\"font-size: 16px;\">flexible</b><span style=\"font-size: 16px;\"> and </span><b style=\"font-size: 16px;\">remote-first.</b></div><div><br></div><div><span style=\"font-size: 16px;\">As our new Support Engineer, you'll use your technical knowledge, curiosity, and eloquence to provide world-class technical support to our customers through our live chat system. Reporting to the Support Manager, you will join the beating heart of Kinsta - a team embodying our DNA and desire to provide industry-leading support.</span></div><div><br></div><div><span style=\"font-size: 16px;\">This role's shift needs are </span><b><span style=\"font-size: 16px;\">2 PM—10 PM&nbsp;UTC </span></b><span style=\"font-size: 16px;\">(our team uses UTC for scheduling).</span></div><h3>What You Will Do:</h3><li>Take ownership of issues reported by customers and see problems through to resolution.</li><li>Research, troubleshoot, and identify solutions to resolve customer issues.</li><li>Follow standard procedures for proper escalation of unresolved issues to the appropriate internal teams.</li><li>Provide prompt and accurate feedback to customers.</li><li>Crave knowledge and continue to hone and improve your own technical and non-technical skills.</li><h3>What You Bring To The Role:</h3><li>You are completely fluent in English with excellent written communication skills.</li><li>Great customer service skills with online customer service experience. </li><h3>Bonus Points If You:</h3><li>Have experience with the following technologies: Linux, NGINX, MySQL/MariaDB, PHP, DNS, CDN, and caching (object and page).</li><li>Have an understanding of WordPress: database structure, file/directory structure, wp-config.php directives, and other common WordPress topics. Experience with WP-CLI is preferable.</li><li>Are comfortable navigating within a command line environment, including file management, reading and interpreting server logs, and attention to detail with command line syntax.</li><li>Have familiarity with Cloudflare, Buildpacks, Dockerfiles, third-party Git repository services (such as GitHub, GitLab, and Bitbucket), npm, or Composer is beneficial.</li><h3>Our Benefits: </h3><li><b>Annual remote expense budge</b>t.</li><li><b>Flexible PTO.</b></li><li><b>Paid parental leave.</b></li><li><b>Annual professional development budget:</b> available after one year with Kinsta.</li><li><b>Sabbatical:</b> available after three years with Kinsta (and every three years thereafter).</li><li><b>Location-specific healthcare benefits</b> (includes vision and dental) for employees hired in the USA, UK, and Hungary.</li><li><b>Pension plan</b> for employees hired in the UK, and 401k contributions for employees hired in the USA</li><div>Kinsta is proud to be an equal opportunity employer. We will not discriminate and we will take actions to ensure against discrimination in employment, recruitment, advertisements for employment, compensation, termination, promotions, and other conditions of employment against any employee or job applicant on the basis of race, color, gender, national origin, citizenship, age, religion, creed, disability, marital status, veteran’s status, sexual orientation, gender identity, gender expression, or any other status protected by the laws or regulations in the locations where we operate.</div><div><br></div><div><span style=\"font-size: small;\">By applying to one of our positions, you agree to the processing of the submitted personal data in accordance with Kinsta's </span><a rel=\"noopener noreferrer\" class=\"postings-link\" href=\"https://kinsta.com/legal/privacy-policy/\">Privacy Policy</a><span style=\"font-size: small;\">, including the transfer of your data to the United States.</span></div><div><br></div><div><i>#LI-Remote, #IHSRemote</i></div>","tags":"[\"management\",\"legal\",\"database\",\"mysql\",\"aws\"]","pubDate":"2024-12-17T15:26:47.000Z","link":"https://jobs.lever.co/kinsta/6f39da5c-6bcc-4f6e-a5c1-05c20de580ea","slug":"support-engineer-kinsta-6888"},{"id":9462751237,"title":"Senior Front End Performance Engineer","company":"Float","image":"https://avatars.githubusercontent.com/u/5396037?s=200&v=4","description":"<h3><strong>Who We Are</strong></h3><p>Float is the world’s leading software for teams to plan their time. Launched in 2012, we’ve grown every year since, and remain proudly independent, self-funded and profitable.</p><p>As a certified B Corporation, we’re committed to making a positive contribution to our team, customers, the environment, and the remote community. We’re a team of 55 working 100% remotely who believe in living our Best Work Life.</p><p>You’ll partner with team members globally, including Australia, Mexico, Italy, Nigeria, Canada, and the USA. Review our data security guidelines about where we hire <a href=\"https://www.notion.so/5a44ff7c04bb4a55a05873f6d5d7743b?pvs=21\" rel=\"nofollow noreferrer noopener\" class=\"external\">here</a>.</p><p>Hear what our team has to say by browsing <a href=\"https://www.float.com/blog/\" rel=\"nofollow noreferrer noopener\" class=\"external\">our blog</a>, or reading our <a href=\"https://www.glassdoor.com/Overview/Working-at-Float-EI_IE2055330.11,16.htm\" rel=\"nofollow noreferrer noopener\" class=\"external\">Glassdoor reviews</a>. Check out what our customers think of Float <a href=\"https://www.g2.com/products/float-float/reviews\" rel=\"nofollow noreferrer noopener\" class=\"external\">from our G2 reviews</a>.</p><p>We’re on a scale up journey, and we’re seeking people who thrive in this stage, given the autonomy, and the opportunity, to do the best work of their career.</p><p></p><h3><strong>Why We’re Hiring For This Role</strong></h3><p>At Float, we’re dedicated to delivering a fast, seamless experience for our customers. As our average customer size continues to grow, so does the complexity of their needs. This role is critical to ensuring that Float remains a best-in-class resource management tool, providing a smooth and intuitive experience for every user.</p><p>The Senior Front End Performance Engineer role is essential in helping us tackle one of our biggest challenges: optimizing the performance of our web application for larger teams, particularly those within our target audience of 11 - 1,000 members.</p><p>Our customers rely on the Float schedule as their “home view,” and its performance directly impacts how quickly and easily they can plan, adjust, and succeed. One of your main responsibilities will be optimizing the performance of this feature.</p><p>Beyond optimizing our current product, this role is also about shaping the future. You’ll ensure new features are scalable, performance regressions are avoided, and our product evolves to meet the demands of a growing customer base. Your specialized expertise in front-end performance will directly support Float’s growth goals, both in expanding our customer numbers and increasing the team sizes we serve.</p><p>You will also help foster a “culture of performance” in the larger Interfaces team by advocating for best practices and tooling, reviewing new code, implementing performance monitoring, and by sharing knowledge with other team members.</p><p>This is a unique opportunity to not only make an impact within our team but to influence the experience of thousands of professional services organizations who rely on Float every day.</p><p>This role reports to Haakon, our Team Lead (Interfaces). You can meet them below, where they explain the important role you will play within our Interfaces team. <a href=\"https://www.loom.com/share/8557f50952254e049d68286387cef7dd?sid=1bd15f25-2a0e-4c30-be97-266ac9751156\" target=\"_blank\" rel=\"nofollow noreferrer noopener\" class=\"external\"><strong>Watch this video!</strong></a></p><p><img src=\"https://cdn.loom.com/sessions/thumbnails/8557f50952254e049d68286387cef7dd-58c2df2234300b55-full-play.gif\" width=\"640px\" height=\"auto\" style=\"width:640px;height:auto;\"></p><p>You’ll be working asynchronously with a bright, dedicated team from across the globe, with a strong focus on taking complex problems and creating solutions that feel simple and intuitive for our customers.</p><p></p><h3><strong>What You’ll Be Responsible For</strong></h3><p>Early on, you’ll jump right into:</p><ul> <li> <strong>Upgrading to React 19:</strong> Upgrading us from React 18 to 19, as well as optimizing for the new React Compiler</li> <li> <strong>Schedule Optimization:</strong> Working on the performance of the schedule, as well as working on existing performance issues that have been flagged</li> <li> <strong>Performance Test Suite:</strong> Becoming familiar with and work on stabilizing our internal performance test suite</li> </ul><p></p><p>Once you are a bit more settled, we expect that you will jump into the following projects:</p><ul> <li> <strong>Front-end performance</strong>: You will be contributing to a best-in-class front-end performance of our product</li> <li> <strong>Tooling and Processes</strong>: Defining performance-oriented tooling and implementing best-practices for the larger Interfaces Team, as well as sharing your knowledge.</li> <li> <strong>Roadmap</strong>: Own and define the roadmap for performances initiatives and improvements</li> <li> <strong>Ownership:</strong> Of the performance and front-end for web app functions like the schedule, live updates, and search</li> </ul><p></p><h3><strong>What You’ll Need To Be Successful</strong></h3><p>We want you to love your work and believe that these skills will allow you to succeed in the role. Applying these skills requires: </p><p>Technical skills</p><ul> <li>Expertise in Javascript/Typescript and React</li> <li>Experience optimizing React applications</li> <li>Ownership or strong contribution to front-end performance on products with large user bases and high data volumes</li> </ul><p>Essential skills</p><ul> <li>Customer-oriented mindset</li> <li>Investigative mindset</li> <li>High levels of autonomy</li> </ul><p>As a fully remote team, we’re looking for someone comfortable with asynchronous communication as the default, which means you have previous remote experience and are comfortable using tools like Slack, Loom, and Linear to communicate as needed. Don’t worry—you will have significant deep work time since we have <a href=\"https://www.float.com/blog/how-to-create-a-culture-with-fewer-meetings/\" rel=\"nofollow noreferrer noopener\" class=\"external\">very few meetings</a>.</p><p></p><h3><strong>Why Join Us</strong></h3><p>Pay for this role is US $167,471 (Level 3). Here’s a <a href=\"https://www.float.com/blog/why-were-changing-the-way-we-compensate-at-float/\" rel=\"nofollow noreferrer noopener\" class=\"external\">blog post</a> with more information on how we determine our salaries.</p><p>We’re a global <a href=\"https://www.float.com/blog/giving-our-team-agency-over-their-time/\" rel=\"nofollow noreferrer noopener\" class=\"external\">async remote company</a> with a diverse team of people from all over the world who share a common belief in living our <a href=\"https://www.float.com/blog/\" rel=\"nofollow noreferrer noopener\" class=\"external\">best work life</a>. We believe deeply in the idea of transparency and share our <a href=\"https://www.notion.so/Float-Handbook-9bf7a6a869744d41b2adfaa1c9131746?pvs=21\" rel=\"nofollow noreferrer noopener\" class=\"external\">Float Handbook</a> publicly so potential new team members can see first hand our <a href=\"https://www.notion.so/Pay-Perks-Benefits-and-Time-Away-From-Work-67c2928515af45729501aaf7d5195d8c?pvs=21\" rel=\"nofollow noreferrer noopener\" class=\"external\">perks &amp; benefits</a> as well as our <a href=\"https://www.notion.so/4727bfc669f647e790f2809efa92f8fe?pvs=21\" rel=\"nofollow noreferrer noopener\" class=\"external\">ways of working</a>. If you feel like you can thrive at Float to do your best work, we would love to hear from you.</p><p></p><h3><strong>Hiring Process For This Role</strong></h3><p>You’ll find a lot of useful information about our interview process and what it’s like to join our global team on the <a href=\"https://www.float.com/careers\" rel=\"nofollow noreferrer noopener\" class=\"external\">Float careers page</a>. The hiring process for this role looks like this:</p><p><strong>Initial First Meet (20 min):</strong> You'll meet with Julia, Talent Manager, to discuss your interest in the role and review your questions about working at Float.</p><p><strong>Technical Assignment (4 hours):</strong> You’ll complete a take-home technical assignment that will assess your ability to identify and communicate performance issues on a real application and suggest solutions. You will be paid an honorarium after completion of your take-home assignment, and will receive feedback on your assignment regardless of the outcome. </p><p><strong>Technical Interview (45 min)</strong>: You’ll meet with Gevorg &amp; Fabio, to discuss your technical capability, front-end engineering experience, as well as your approach to the take-home assignment. </p><p><strong>Manager Interview (45 min):</strong> You’ll meet with Haakon, Team Lead (Interfaces), to dive deeper into your skills, experience, and goals for the role. </p><p><strong>Founder Interview (30 min)</strong>: You’ll meet with Lars, Float’s CEO, to get to know you and see if you have potential to be a great addition to the team.</p><p></p><p><em>Note: Industry research shows that women and those in traditionally underrepresented groups generally don’t apply to jobs unless they check all the boxes for the role. If you feel strongly that you have what it takes for this role but don’t check 100% of the boxes—that’s okay—we encourage you to apply anyway and highlight what you can bring to the table.</em></p>","tags":"[\"javascript\",\"typescript\",\"management\",\"engineering\"]","pubDate":"2024-12-13T00:00:00.000Z","link":"https://apply.workable.com/j/8CD705196F","slug":"senior-front-end-performance-engineer-float-1602"},{"id":6728861263,"title":"Sales Operations Intern","company":"Kinsta","image":"https://avatars.githubusercontent.com/u/4136982?s=200&v=4","description":"<div><span style=\"font-size: 16px;\">Kinsta is one of the top-managed </span><b style=\"font-size: 16px;\">WordPress hosting companies,</b><span style=\"font-size: 16px;\"> with a growing club of 120,000+ businesses including startups, universities and Fortune 500 firms. We're motivated by excellent quality, and proud to have received a</span><b style=\"font-size: 16px;\"> 97% satisfaction rating from our customers</b><span style=\"font-size: 16px;\">.</span></div><div><br></div><div><span style=\"font-size: 16px;\">That's because, to us, each day is a chance to </span><b style=\"font-size: 16px;\">grow</b><span style=\"font-size: 16px;\">. As a team, we continuously inspire each other to learn new and better ways to make an</span><b style=\"font-size: 16px;\"> impact</b><span style=\"font-size: 16px;\">. We own our jobs proudly - our leaders don't hold our hands, but they're in our corner whenever we ask for help - and our environment is </span><b style=\"font-size: 16px;\">flexible</b><span style=\"font-size: 16px;\"> and </span><b style=\"font-size: 16px;\">remote-first</b><span style=\"font-size: 16px;\">.</span></div><div><br></div><div><span style=\"font-size: 16px;\">We’re looking for a </span><b style=\"font-size: 16px;\">Sales Operations Intern</b><span style=\"font-size: 16px;\"> to play a key support role within the Sales Operations team, helping to maintain smooth processes and accurate data. This intern will assist with KPI monitoring, project coordination, and documentation management, ensuring everything stays organized and accessible. This role provides essential support for the team to focus on strategic initiatives, contributing to streamlined processes and better outcomes across our department.</span></div><div><br></div><div><b style=\"font-size: 16px;\">This role will be for an initial 6-month contract.</b></div><div><br></div><div><span style=\"font-size: 16px;\">Kinsta is one of the top-managed </span><b style=\"font-size: 16px;\">WordPress hosting companies,</b><span style=\"font-size: 16px;\"> with a growing club of 120,000+ businesses including startups, universities and Fortune 500 firms. We're motivated by excellent quality, and proud to have received a</span><b style=\"font-size: 16px;\"> 97% satisfaction rating from our customers</b><span style=\"font-size: 16px;\">.</span></div><div><br></div><div><span style=\"font-size: 16px;\">That's because, to us, each day is a chance to </span><b style=\"font-size: 16px;\">grow</b><span style=\"font-size: 16px;\">. As a team, we continuously inspire each other to learn new and better ways to make an</span><b style=\"font-size: 16px;\"> impact</b><span style=\"font-size: 16px;\">. We own our jobs proudly - our leaders don't hold our hands, but they're in our corner whenever we ask for help - and our environment is </span><b style=\"font-size: 16px;\">flexible</b><span style=\"font-size: 16px;\"> and </span><b style=\"font-size: 16px;\">remote-first</b><span style=\"font-size: 16px;\">.</span></div><div><br></div><div><span style=\"font-size: 16px;\">We’re looking for a </span><b style=\"font-size: 16px;\">Sales Operations Intern</b><span style=\"font-size: 16px;\"> to play a key support role within the Sales Operations team, helping to maintain smooth processes and accurate data. This intern will assist with KPI monitoring, project coordination, and documentation management, ensuring everything stays organized and accessible. This role provides essential support for the team to focus on strategic initiatives, contributing to streamlined processes and better outcomes across our department.</span></div><div><br></div><div><b style=\"font-size: 16px;\">This role will be for an initial 6-month contract.</b></div><div><br></div><h3>What you’ll do:</h3><li><b>KPI Monitoring &amp; Reporting:</b> Help update and track key performance indicators (KPIs) to monitor sales process effectiveness and uncover areas for improvement.</li><li><b>Project Assistance:</b> Coordinate and support the execution of sales operations projects, such as implementing new tools or improving workflows.</li><li><b>CRM Workflow Optimisation:</b> Assist in maintaining and optimising CRM workflows, templates, and processes to ensure our sales team operates smoothly and efficiently.</li><li><b>Data Quality Management:</b> Generate and distribute bi-monthly data cleanup reports to ensure the accuracy, reliability, and integrity of sales data.</li><li><b>Report Generation &amp; Insights:</b> Support the sales team by creating minor reports, analysing trends, and highlighting key insights that can drive strategic decisions.</li><li><b>Enablement Support:</b> Assist the Sales Operations Manager in distributing training materials and tracking sales team engagement with enablement plans.</li><li><b>New Hire Onboarding:</b> Partner with the Sales Operations Manager to support onboarding new sales reps, ensuring they have the resources and knowledge needed to start strong.</li><li><b>Documentation Management:</b> Maintain and organise sales operations documents, including SOPs and process guidelines, so they’re always accessible and current.</li><h3>What you’ll bring to the role:</h3><li><b>Data Handling and Analysis</b>: You are comfortable working with data to generate reports and analyze trends. Experience with Excel or Google Sheets is required.</li><li><b>Attention to Detail: </b>You have ability to ensure accuracy in tracking KPIs and managing data, essential for maintaining data quality.</li><li><b>Organizational Skills:</b> You have the ability to keep documents and processes well-organized. You’ll need to keep track of various projects, documentation, and enablement materials.</li><li><b>Adaptability and curiosity:</b> You can take feedback constructively and adapt quickly, learning new processes or tools as needed.</li><li><b>Willingness to Learn:</b> We’re looking for someone who’s genuinely excited to grow in this role and tackle new challenges.</li><li><b>Clear Communicator:</b> We support different team members, so strong communication skills are essential.</li><h3>Bonus points if you have:  </h3><li>Prior experience in sales, operations, or a data-related internship.&nbsp;</li><li>Experience with Hubspot, Jira, and Google Sheets.</li><h3>Our benefits:</h3><li><b>Flexible </b>and<b> remote-first </b>environment.</li><li><b>Annual remote expense budge</b>t.</li><li><b>Flexible PTO.</b></li><li><b>Paid parental leave.</b></li><li><b>Annual professional development budget:</b> available after one year with Kinsta.</li><li><b>Sabbatical:</b> available after three years with Kinsta (and every three years thereafter).</li><li><b>Location-specific healthcare benefits</b> (includes vision and dental) for employees hired in the USA, UK, and Hungary.</li><li><b>Pension plan</b> for employees hired in the UK, and 401k contributions for employees hired in the USA.</li><div>Kinsta is proud to be an equal opportunity employer. We will not discriminate and we will take actions to ensure against discrimination in employment, recruitment, advertisements for employment, compensation, termination, promotions, and other conditions of employment against any employee or job applicant on the basis of race, color, gender, national origin, citizenship, age, religion, creed, disability, marital status, veteran’s status, sexual orientation, gender identity, gender expression, or any other status protected by the laws or regulations in the locations where we operate.</div><div><br></div><div><span style=\"font-size: small;\">By applying to one of our positions, you agree to the processing of the submitted personal data in accordance with Kinsta's </span><a rel=\"noopener noreferrer\" class=\"postings-link\" href=\"https://kinsta.com/legal/privacy-policy/\">Privacy Policy</a><span style=\"font-size: small;\">, including the transfer of your data to the United States.</span></div><div><br></div><div><i>#LI-Remote, #IHSRemote</i></div>","tags":"[\"management\",\"legal\",\"aws\"]","pubDate":"2024-12-05T10:52:33.502Z","link":"https://jobs.lever.co/kinsta/a99add71-9acb-4d03-9f83-06476c78cfcc","slug":"sales-operations-intern-kinsta-5729"}]