[{"id":7745036853,"title":"Senior Sales Engineer","company":"Mechanical Orchard","image":"https://pbs.twimg.com/profile_images/1592609773958025216/CaG1yAqK_400x400.png","description":"<div class=\"section page-centered\" data-qa=\"job-description\"><div><span style=\"font-size: 11pt\">Mechanical Orchard is a fast-growing startup that takes a fresh view on old problems. We replace legacy computing systems for the Global 2000, with a focus on mitigating risk and creating a genuinely solid foundation for innovating and adapting.&nbsp;</span></div><div><br></div><div><span style=\"font-size: 11pt\">Our background in software development and the impact on the industry is well known, and we've literally helped write the book on XP and other impactful agile practices. We’re applying the same thoughtfulness and rigor in weaving AI into everything we do. We believe in the durable principles behind agile, and embrace the power of cross-functional teams, collective ownership, test driven development, short feedback loops, and continuous improvement.</span></div><div><br></div><div><span style=\"font-size: 11pt\">We are Generous, Ethical, Effective, and Kind.</span></div><div><br></div><div><span style=\"font-size: 24px\">About the role</span></div><div><br></div><div>Mechanical Orchard is looking for an experienced technical sales enthusiast to join our talented and collaborative Sales team. Your main responsibility will be to partner with our Sales Directors on owning the technical sales strategy and execution for Fortune 500 opportunities across new customer wins, extensions, expansions, and renewals.</div><div><br></div><div>You will play a critical role in driving the success of our sales efforts by combining your technical expertise, pre-sales experience, and passion to support our customers in achieving their legacy modernization and related business goals.</div></div><div class=\"section page-centered\"><div><h3>You will</h3><ul class=\"posting-requirements plain-list\"><ul><li>Help qualify and bring to closure a growing number of opportunities originating across hyper-scaler channel partners, our executive and VC network, and outbound efforts.</li><li>Act as a trusted advisor to customers by understanding their challenges and articulating how Mechanical Orchard’s unique approach is best suited to help them meet their technical needs as well as their desired business outcomes.</li><li>Work with Sales and Delivery to facilitate or participate in technical workshops and other technical validation activities, involving cross-functional Mechanical Orchard and customer resources.</li><li>Partner with our internal R&amp;D and Product teams to translate customer requirements to tooling that our internal software craftspeople are constantly building to increase the speed with which we ship quality working software.&nbsp;</li><div><br></div></ul></ul></div></div><div class=\"section page-centered\"><div><h3>You have</h3><ul class=\"posting-requirements plain-list\"><ul><li>10+ years of experience as a sales engineer or equivalent pre-sales technical role with a proven track record of winning large deals (mid 7-figure to 8-figure annually) with Fortune 500 customers.</li><li>Experience following a repeatable sales process and qualification framework (MEDDPICC, etc).</li><li>Experience in reframing customers away from status quo solutions and towards newer, better ways of solving their problems.</li><li>Exceptional presentation and communication skills, with the ability to articulate complex technical concepts to both technical and non-technical audiences.</li><li>Engineering skills to quickly develop proofs of concept and/or technical demonstrations for customer prospects.</li><li>Ability to successfully manage multiple priorities, while maintaining a high sense of urgency.</li><li>Broad industry knowledge pertaining to cloud infrastructure, software development and open source software.</li><li>Strong personal motivation to meet and exceed measurable performance goals.</li><li>Skillset to establish trust with clients, and ability to influence key decision makers in the sales cycle.</li><li>A growth mentality with the instinct to be creative and collaboratively problem-solve.</li><li>Willingness to travel occasionally for qualified customer meetings, conferences, and industry events as needed.</li></ul></ul></div></div><div class=\"section page-centered\"><div><h3>Nice to have</h3><ul class=\"posting-requirements plain-list\"><ul><li>3+ years of pre-sales or delivery experience at a hyper-scaler, GSI, or modernization tool company.</li><li>Experience with legacy systems and programming languages (mainframes, COBOL, etc) as well as new cloud native technologies.</li><li>Experience or strong interest in AI, and its practical application in software development.</li></ul></ul></div></div><div class=\"section page-centered\" data-qa=\"closing-description\"><div><span style=\"font-size: 11pt\">Mechanical Orchard, Inc. is an Equal Opportunity Employer and Prohibits Discrimination and Harassment of Any Kind. Mechanical Orchard, Inc. is committed to the principle of equal employment opportunity for all employees and to providing employees with a work environment free of discrimination and harassment. All employment decisions at Mechanical Orchard, Inc. are based on business needs, job requirements and individual qualifications, without regard to race, color, religion or belief, national, social or ethnic origin, sex (including pregnancy), age, physical, mental or sensory disability, HIV Status, sexual orientation, gender identity and/or expression, marital, civil union or domestic partnership status, past or present military service, family medical history or genetic information, family or parental status, or any other status protected by the laws or regulations in the locations where we operate. Mechanical Orchard, Inc. will not tolerate discrimination or harassment based on any of these characteristics. Mechanical Orchard, Inc. encourages applicants of all ages. Mechanical Orchard, Inc. will provide reasonable accommodation to employees who have protected disabilities consistent with local law.</span></div><div><br></div><div>We look forward to reviewing your application. Thanks!</div></div><div class=\"section page-centered last-section-apply\" data-qa=\"btn-apply-bottom\"><a class=\"postings-btn template-btn-submit hex-color\" data-qa=\"show-page-apply\" href=\"https://jobs.lever.co/mechanicalorchard/c1324939-39df-410f-bd80-3a4280085721/apply\">Apply for this job</a></div>","tags":"[\"engineering\",\"aws\"]","pubDate":"2024-02-27 05:49:48.365","link":"https://jobs.lever.co/mechanicalorchard/c1324939-39df-410f-bd80-3a4280085721","savedDate":"2024-02-27 05:49:48.365","slug":"senior-sales-engineer-mechanical-orchard-4081"},{"id":2074345319,"title":"Engineering Director, Sustaining Engineering ","company":"Canonical","image":"https://pbs.twimg.com/profile_images/1673959375340290050/x7pNtXQ7_400x400.jpg","description":"\n      <p>This is an Engineering Director position, responsible for the worldwide Sustaining Engineering team of software engineers at Canonical. This position reports to the VP Support at Canonical.</p>\n<p>The Sustaining Engineering group is a worldwide team of generalist open source software engineers, responsible for driving software issues reported by Canonical customers to successful resolution. We tackle problems in any package in Ubuntu, and for our largest customers, will engage on deep issues in upstream projects not yet packaged in the distribution. We are Canonical's open source special forces, or SWAT team, or firefighting ladder, as you prefer. We work on the hardest-to-debug production problems in the kernel, and we work in every programming language you can find in open source. Depending on your perspective this is either an absolute engineering nightmare or the world's best way to spend a fully paid day :)</p>\n<p>We take care over career and skills development for our colleagues, and we are in a unique position to offer engineers an incredibly wide range of topics into which they can delve deeply to become our first and best expert. As our customer base expands, and as we have become more confident to make service commitments to a wider and wider range of open source, we have expanded the range of technologies in which we can justify investing time and attention. We are now in a push to become the world's leading provider of open source from the public cloud to the edge, from desktops to servers and IoT.</p>\n<p>As an Engineering Director role, this position will manage the managers of multiple teams. We try to keep each frontline team in a single timezone, but this position of necessity has global responsibility, so the successful candidate will need to be able to set expectations and manage remotely. In this role, you will:</p>\n<ul>\n<li>Define the strategy of the Sustaining Engineering group, as a part of the overall direction set for the wider organization</li>\n<li>Act as an escalation point for key customers and internal escalations, occasionally over weekends</li>\n<li>Be an advocate for your group and shape the overall Support strategy along with other senior leaders</li>\n<li>Hire, organize, grow, nurture and lead a diverse set of technical contributors to provide excellent customer support for the platform at the heart of cloud and enterprise computing</li>\n<li>Be involved with contracts, customers and executives across the table in renewal and sales discussions</li>\n<li>Influence others and be a committed, vocal leader across the organization</li>\n<li>Define and ensure adherence to company and team processes</li>\n<li>Use analytics to shape and drive the team and business</li>\n<li>Be comfortable and confident leading and working across geographically dispersed teams</li>\n<li>Work from home with global travel up to 20% for company and industry events and customer meetings</li>\n</ul>\n<p>This role will suit a dynamic and driven leader with a passion for open-source and a penchant for building world class teams, who prefers to tackle hard problems under pressure without needing to manage a long-term roadmap.</p>\n<p><strong>Location:&nbsp;</strong>This is a home-based role that can be filled in any timezone.</p>\n<h3>What we are looking for in you</h3>\n<ul>\n<li>You are an articulate communicator and want to lead a global business</li>\n<li>You love technology and working with brilliant people</li>\n<li>You have a solid understanding of three or more of: Ubuntu - kernel or userspace, Kubernetes, OpenStack, Ceph, QEMU/KVM, LXC/LXD, Postgresql, Mongo, deb or snap packaging</li>\n<li>You value getting things done the right way</li>\n<li>You follow industry trends and new technologies</li>\n<li>Experience in leading, coaching and mentoring software developers</li>\n<li>Experience with Open Source and Open Source Business Models</li>\n<li>Outstanding Linux based software engineering track record</li>\n<li>You value soft skills and are passionate, enterprising, thoughtful, and self-motivated</li>\n<li>You will bring an exceptional academic track record</li>\n</ul>\n<h3>What we offer you</h3>\n<p>We consider geographical location, experience, and performance in shaping compensation worldwide. We revisit compensation annually (and more often for graduates and associates) to ensure we recognise outstanding performance. In addition to base pay, we offer a performance-driven annual bonus. We provide all team members with additional benefits, which reflect our values and ideals. We balance our programs to meet local needs and ensure fairness globally.</p>\n<ul>\n<li>Distributed work environment with twice-yearly team sprints in person</li>\n<li>Personal learning and development budget of USD 2,000 per year</li>\n<li>Annual compensation review</li>\n<li>Recognition rewards</li>\n<li>Annual holiday leave</li>\n<li>Maternity and paternity leave</li>\n<li>Employee Assistance Programme</li>\n<li>Opportunity to travel to new locations to meet colleagues</li>\n<li>Priority Pass, and travel upgrades for long haul company events</li>\n</ul>\n<h3>About Canonical</h3>\n<p>Canonical is a pioneering tech firm at the forefront of the global move to open source. As the company that publishes Ubuntu, one of the most important open source projects and the platform for AI, IoT and the cloud, we are changing the world on a daily basis. We recruit on a global basis and set a very high standard for people joining the company. We expect excellence - in order to succeed, we need to be the best at what we do. Canonical has been a remote-first company since its inception in 2004.​ Working here is a step into the future, and will challenge you to think differently, work smarter, learn new skills, and raise your game.</p>\n<h3>Canonical is an equal opportunity employer</h3>\n<p>We are proud to foster a workplace free from discrimination. Diversity of experience, perspectives, and background create a better work environment and better products. <a href=\"https://canonical.com/careers/diversity/identity\">Whatever your identity, we will give your application fair consideration.</a></p>\n<p>#LI-remote</p>\n    ","tags":"[\"postgres\",\"engineering\",\"mongo\"]","pubDate":"2024-02-27 05:49:48.364","link":"https://canonical.com/careers/5650799","savedDate":"2024-02-27 05:49:48.364","slug":"engineering-director-sustaining-engineering-canonical-2674"},{"id":7073569375,"title":"Junior Kernel Engineer - Ubuntu","company":"Canonical","image":"https://pbs.twimg.com/profile_images/1673959375340290050/x7pNtXQ7_400x400.jpg","description":"\n      <p>Every year we select new junior professionals into the Canonical kernel team, to work on the Linux kernel for Ubuntu. If you’ve enjoyed operating systems in your coursework or current role, you are confident in your ability to write high quality C and possibly Rust, and are ready to take the plunge and see how it all works, then this would be a great place to pursue your next career stage. We are a global team working to ship the world's most widely used Linux kernel, across the very latest silicon and cloud, where you can apply and grow your software engineering skills.</p>\n<p>The Canonical Kernel Team builds and maintains all supported Ubuntu Linux kernels for a variety of platforms and architectures from small embedded devices to standard desktop/server systems to large-scale cloud environments. In your first year you will tackle serious initiatives, which include but are not limited to:</p>\n<ul>\n<li>Optimized solutions for key Silicon and Cloud partner platforms</li>\n<li>Developer platforms such as Raspberry Pi and RISC-V</li>\n<li>Enabling Ubuntu on a wide range of embedded systems</li>\n<li>Security hardening and exploit mitigation</li>\n<li>Third-party driver integration and distribution, such as graphics</li>\n<li>Expanded driver support for bleeding-edge PC platforms</li>\n</ul>\n<p>We select candidates that are recent university graduates or early career professionals who are enthusiastic to develop kernel-level software in multiple areas including security updates, patching, and testing. The successful candidate will have a background in software engineering, be motivated to work in a distributed team and willing and able to travel globally twice a year for company engineering events.</p>\n<p>These are full-time positions available to prospective or recently graduated students.</p>\n<p><strong>Location:</strong> We have home-based kernel teams in every timezone.</p>\n<h2>What your day will look like</h2>\n<ul>\n<li>Collaborate regularly and proactively with a globally distributed team&nbsp;</li>\n<li>Learn from senior mentors to demystify the inner workings of the Linux kernel and how it is distributed</li>\n<li>Work closely with external silicon, cloud, or hardware manufacturer delivery teams on bleeding-edge platforms</li>\n<li>Diagnose and resolve issues in the kernel reported by customers, the community, and discovered by your own rigorous testing</li>\n<li>Take personal responsibility for the delivery of various flavors of the Ubuntu Linux kernel</li>\n<li>Improve tooling and automation for delivery and test of Ubuntu Linux kernels</li>\n<li>Submit, review, and apply kernel patches, working with both internal and external upstream maintainers</li>\n</ul>\n<h2>What we are looking for in you</h2>\n<ul>\n<li>Well-organized and motivated self-starter able to thrive in a remote work environment</li>\n<li>Professional manner with colleagues, business partners, and the open-source community</li>\n<li>Ability to communicate effectively in English, both written and verbal</li>\n<li>Programming experience in C and/or Rust</li>\n<li>Familiarity with version control practices, ideally with git</li>\n<li>Understanding of operating system kernel fundamentals</li>\n<li>Ability to travel twice a year for company events of up to two weeks length</li>\n</ul>\n<h2>Additional skills that you might also bring</h2>\n<ul>\n<li>Interest and experience in Rust</li>\n<li>Python and Bash scripting ability</li>\n<li>Prior experience with Ubuntu/Debian/Snap packaging</li>\n<li>Demonstrated experience with kernel patching and debugging</li>\n<li>Strong grasp of device drivers, BSP’s, and other low level system engineering</li>\n</ul>\n<h2>What we offer you</h2>\n<p>We consider geographical location, experience, and performance in shaping compensation worldwide. We revisit compensation annually (and more often for graduates and associates) to ensure we recognise outstanding performance. In addition to base pay, we offer a performance-driven annual bonus. We provide all team members with additional benefits, which reflect our values and ideals. We balance our programs to meet local needs and ensure fairness globally.</p>\n<ul>\n<li>Home-based work environment with twice-yearly team sprints in person</li>\n<li>Personal learning and development budget of USD 2,000 per year</li>\n<li>Annual compensation review</li>\n<li>Recognition rewards</li>\n<li>Annual holiday leave</li>\n<li>Maternity and paternity leave</li>\n<li>Employee Assistance Programme</li>\n<li>Opportunity to travel to new locations to meet colleagues</li>\n<li>Priority Pass, and travel upgrades for long haul company events</li>\n</ul>\n<h2>About Canonical</h2>\n<p>Canonical is a pioneering tech firm at the forefront of the global move to open source. As the company that publishes Ubuntu, one of the most important open source projects and the platform for AI, IoT and the cloud, we are changing the world on a daily basis. We recruit on a global basis and set a very high standard for people joining the company. We expect excellence - in order to succeed, we need to be the best at what we do. Canonical has been a remote-first company since its inception in 2004.​ Working here is a step into the future, and will challenge you to think differently, work smarter, learn new skills, and raise your game.</p>\n<h2>Canonical is an equal opportunity employer</h2>\n<p>We are proud to foster a workplace free from discrimination. Diversity of experience, perspectives, and background create a better work environment and better products. <a href=\"https://canonical.com/careers/diversity/identity\">Whatever your identity, we will give your application fair consideration.</a></p>\n<p>#LI-remote</p>\n\n    ","tags":"[\"engineering\"]","pubDate":"2024-02-27 05:49:48.364","link":"https://canonical.com/careers/5370815","savedDate":"2024-02-27 05:49:48.364","slug":"junior-kernel-engineer-ubuntu-canonical-5441"},{"id":7647073651,"title":"Product Intern (Remote Health)","company":"SafetyWing","image":"https://pbs.twimg.com/profile_images/1177267684574208000/54eG3WmW_400x400.jpg","description":"<h2>🧘 What we offer</h2> <div><!--block-->We offer a great team to learn from and collaborate with and a fully remote work environment – work from anywhere globally 🌏<br><br>You will get a monthly compensation, and if you are successful with your Summer internship, we will do our best to offer you a longer-term collaboration 🚀<br><br>We are looking forward to hearing from you!</div> <div><!--block--><strong>SafetyWing</strong> (YC W18) is seeking an intern to join us for Summer 2023.<br>&nbsp;</div><div><!--block-->We are building a global social safety net, including health and retirement for remote workers worldwide, as a replacement for national welfare systems. If we succeed, we believe this will help ensure freedom and equal opportunity for everyone, and it is one of the more important tasks of our time that no one else is working on.</div> <h2>💻 Your responsibilities will include</h2>  <ul><li><!--block-->Get to know our Remote Health product by talking to users and the team. You'll be all about understanding what makes it tick and how to make it even better.</li><li><!--block-->Develop clear and detailed user stories, blueprinting our development efforts.</li><li><!--block-->Partner with our engineering and design teams to transform user stories into viable features.&nbsp;</li><li><!--block-->You'll have the freedom to guide your projects from start to finish.&nbsp;</li></ul> <h2>🧪 We are looking for someone who</h2> <ul><li><!--block-->Are entrepreneurial and self-driven.</li><li><!--block-->Passionate about shaping products that people love.</li><li><!--block-->Have a grasp understanding of the Product Management lifecycle.</li><li><!--block-->Can take on responsibility for end-to-end processes from product research to implementation.&nbsp;</li><li><!--block-->Committed to dedicating at least 3 months to this internship and able to work full time.</li></ul><div><!--block--><strong>😀 We like to work with people who:</strong></div><ul><li><!--block-->Want to help build a global social safety net on the Internet.</li><li><!--block-->Think for themselves instead of copying others.</li><li><!--block-->Are willing to try new things, even with the risk of failure.</li><li><!--block-->Are intellectually curious and open to new ideas.</li><li><!--block-->Are creative and bold in the face of any problems.</li><li><!--block-->Have strong integrity and do the right thing.</li></ul><div><!--block--><br></div>","tags":"[\"management\",\"engineering\"]","pubDate":"2024-02-27 05:49:48.363","link":"https://safetywing.pinpointhq.com/en/jobs/167496","savedDate":"2024-02-27 05:49:48.363","slug":"product-intern-remote-health-safetywing-1618"},{"id":8831090905,"title":"Account Executive (English & Spanish)","company":"Bobtail","image":"https://media.licdn.com/dms/image/D4E0BAQGvUyfPVBWDyg/company-logo_200_200/0/1657595552015?e=2147483647&v=beta&t=EecsDCOy3Fh_26M1noQDDIYw8-JuGKz_d1JDvcBZ-yI","description":"\n    \n\n    <h2><strong>About Bobtail</strong></h2>\n<p>Bobtail is dedicated to increasing happiness for our customers by eliminating inefficiencies in the supply chain. We envision a supply chain without friction, fraud, waste, and abuse where companies succeed based on the value they create.</p>\n<p>&nbsp;</p>\n<p>We work uniquely at Bobtail, where we value teams over individuals and encourage experimentation and iteration to constantly improve. Teams are given flexibility in working towards a shared purpose and given the freedom to decide how they will accomplish their goals.</p>\n<p>If you are an out-of-the-box thinker who takes a proactive approach to collaborating with others to solve problems and achieve your goals - we would love to talk to you.</p>\n<p>The things we value:</p>\n<ul>\n<li>Mission</li>\n<li>Teams over individuals</li>\n<li>Collaboration</li>\n<li>Communication</li>\n<li>Iteration</li>\n<li>Experimentation and failing fast</li>\n<li>Initiative and solutions-oriented approach</li>\n<li>Documentation</li>\n<li>Data</li>\n<li>Mental health and work-life balance</li>\n<li>Diversity</li>\n<li>Transparency</li>\n</ul>\n<p><strong>You should apply if you have:</strong></p>\n<ul>\n<li>3–5 years of B2B cold calling &amp; outbound sales experience</li>\n<li>Bilingual is a must (English/Spanish)</li>\n<li>Software as a Service (SaaS) experience is a must</li>\n<li>US Trucking Industry knowledge is a plus</li>\n<li>CRM usage experience is preferred (Salesforce is a plus)</li>\n<li>Start-up experience is a plus</li>\n<li>Ability to quickly learn in a fast-paced environment,</li>\n<li>Consistent track record of achievement and hitting quotas</li>\n<li>Confidence, as well as strong verbal &amp; written communication skills when interacting with clients</li>\n<li>Ability to discover and understand customer needs and propose solutions</li>\n<li>Dependable team player</li>\n<li>A motivated, driven, self-starter… We love those with grit and accountability!</li>\n<li>Must own a modern - not older than 3 years old laptop with a working camera.</li>\n<li>An Internet Speed of 50 Mbps is required</li>\n</ul>\n<p>&nbsp;</p>\n<p><strong>You will be responsible for:</strong></p>\n<ul>\n<li>Making daily cold calls &amp; sending emails/text to connect with prospects</li>\n<li>Converting prospects &amp; leads into Bobtail clients</li>\n<li>Collaborating as a team to accomplish individual, team, and company-wide goals</li>\n<li>Maintaining a pipeline of leads and opportunities using our CRM (Salesforce)</li>\n<li>Effectively using other sales tools to track progress and improve your performance</li>\n<li>Learning about each client’s needs, industry, and competitors.</li>\n<li>Building long-lasting, mutually beneficial relationships with prospects and clients to create a better customer experience.</li>\n<li>Following up with prospects throughout the sales cycle to continue nurturing them.</li>\n<li>Presenting the value of Bobtail products and services to prospects</li>\n<li>Staying current on company offerings and industry trends.</li>\n</ul>\n<p><strong>Educational background:</strong></p>\n<ul>\n<li>Bachelor’s degree preferred</li>\n<li>Sales or business education/certification preferred</li>\n<li>Completed studies preferred<br><br></li>\n</ul>\n<p><strong>Benefits:</strong></p>\n<ul>\n<li>Monthly Mental Break Day</li>\n<li>Paid Time Off</li>\n<li>Work from home (or wherever)</li>\n<li>Parental leave</li>\n</ul>\n<p><br>Creating a diverse and inclusive workplace is Bobtail’s nucleus. We are an equal opportunity employer and embrace people of different backgrounds, cultures, religions, national origins, races, colors, genders, gender expressions, sexual orientations, ages, marital status, veteran status, experiences, abilities, and perspectives.</p>\n<p><br><br></p>\n\n    \n\n    \n","tags":"[\"B2B\"]","pubDate":"2024-02-27 05:49:48.363","link":"https://boards.greenhouse.io/bobtail/jobs/4169747005","savedDate":"2024-02-27 05:49:48.363","slug":"account-executive-english-spanish-bobtail-6670"},{"id":7041857897,"title":"Associate Opener/Sales Development Representative","company":"SafetyWing","image":"https://pbs.twimg.com/profile_images/1177267684574208000/54eG3WmW_400x400.jpg","description":"<h2>🧘 What we offer</h2> <ul><li><!--block-->Fully remote work environment – work from anywhere globally.&nbsp;</li><li><!--block-->Competitive compensation.</li><li><!--block-->Global coverage with Remote Health and Nomad Insurance.</li><li><!--block-->A minimum of 20 days of compensated time off each year.</li><li><!--block-->Referral bonus - an incentive program rewarding you for helping us find exceptional talent to join our team.</li><li><!--block-->Opportunity to unlock more benefits as your tenure with SafetyWing grows.</li></ul><div><!--block--><br>We are looking forward to hearing from you!</div> <div><!--block-->We’re seeking a friendly and energetic Associate Opener to join our Direct Sales Team and help us connect with amazing customers! Your talent in pinpointing potential leads will steer <strong>SafetyWing</strong> toward achieving our goals.</div><div><!--block--><br>We are building a global social safety net, including health and retirement for remote workers worldwide, as a replacement for national welfare systems. If we succeed, we believe this will help ensure freedom and equal opportunity for everyone, and it is one of the more important tasks of our time that no one else is working on.</div> <h2>💻 Your responsibilities will include</h2>  <ul><li><!--block-->Create awareness and generate interest for Remote Health by SafetyWing among companies.</li><li><!--block-->Discover impactful leads.</li><li><!--block-->Conduct outreach through calling, emailing, and social media to engage potential clients.</li><li><!--block-->Set up qualified meetings between target buyers and our account executives (Closers).</li><li><!--block-->Assist in whipping up and executing lead-generation campaigns.</li><li><!--block-->Meticulously enter and manage sales data, ensuring accuracy and reliability in our CRM.</li></ul><div><!--block--><br></div> <h2>🧪 We are looking for someone who:</h2> <ul><li><!--block-->Has an exceptional knack for research – we value this highly!</li><li><!--block-->Has successful experience in proactive customer outreach.</li><li><!--block-->Has excellent communication skills in English, both verbal and written.</li><li><!--block-->Is tech-savvy and comfortable with Google Workspace, CRM software, and marketing automation tools.</li><li><!--block-->Is a continual learner, detailed, planning pro, and autonomous worker.</li><li><!--block-->Extra shine if you have experience in lead generation and a diploma or degree in marketing, business, or a related field.</li></ul><div><!--block--><strong>😀 We like to work with people who:</strong></div><ul><li><!--block-->Want to help build a global social safety net on the Internet.</li><li><!--block-->Think for themselves instead of copying others.</li><li><!--block-->Are willing to try new things, even with the risk of failure.</li><li><!--block-->Are intellectually curious and open to new ideas.</li><li><!--block-->Are creative and bold in the face of any problems.</li><li><!--block-->Have strong integrity and do the right thing.</li></ul>","tags":"[]","pubDate":"2024-02-27 05:49:48.362","link":"https://safetywing.pinpointhq.com/en/jobs/166731","savedDate":"2024-02-27 05:49:48.362","slug":"associate-opener-sales-development-representative-safetywing-6503"},{"id":5364060058,"title":"Full Stack Engineer (Fully Remote)","company":"CoverGo","image":"https://pbs.twimg.com/profile_images/1382655628523364355/MWPIbbID_400x400.jpg","description":"<p><strong>Top 3 Reasons To Join Us</strong></p><ul> <li>Competitive Salary</li> <li>100% Remote</li> <li>Working on the latest tech for the Insurtech Market Leader</li> </ul><p><strong>About Us</strong></p><p>At CoverGo, our mission is to empower all insurance companies to make insurance 100% digital and accessible to everyone.</p><ul> <li>We are a leading global no-code insurance platform for health, life, and P&amp;C</li> <li>We’re the winner of the Insurtech of the Year in all of Asia and other awards globally</li> <li>We work with insurance enterprise clients such as AXA, Bupa, MSIG, Dai-ichi, Bank of China Group Insurance, and many more</li> <li>We're an international, diverse team of over 120 people with 30 nationalities and team members working remotely from all over the world</li> <li>We are fully funded and backed by reputable VC funds and strategic institutional investors</li> <li>We have a global presence in Asia, EMEA and the Americas</li> <li>We’ve grown our annualized revenue by over 30x since January 2021</li> <li>We’re constantly working towards making CoverGo a workplace that you love coming to. We deeply believe that bringing together a diversity of thoughts, expressions, and perspectives is key to building the best culture for equally diverse communities all over the world</li> </ul><p><strong>About the Role</strong></p><p>As a Full Stack Engineer at CoverGo, you will contribute to the ongoing development and enhancement of our innovative insurance enterprise software solutions. Showcase your proficiency with both front-end and back-end technologies. Collaborate with cross-functional teams, participate in code reviews, and contribute to maintaining code quality through testing. Investigate and address bugs promptly to ensure the reliability and security of our platform while staying informed about the latest technologies and best practices in software development.</p><p><strong>What You Will Do</strong></p><ul> <li>Contribute to the design, implementation, and maintenance of new features and functionalities for our SaaSplatform.</li> <li>Work with both front-end and back-end technologies.</li> <li>Collaborate with cross-functional teams to understand end-user requirements, translating them into scalable and efficient software solutions.</li> <li>Participate in code reviews, adhere to coding best practices, and contribute to maintaining code quality through unit and integration testing.</li> <li>Investigate and address bugs promptly to ensure the reliability of the platform.</li> <li>Contribute to ensuring security and compliance by following best practices and adhering to industry regulations.</li> <li>Stay informed about the latest technologies, frameworks, and best practices in software development.</li> </ul><p><strong>What We Need</strong></p><ul> <li>Proven experience of 4+ years as a Full Stack Engineer, with experience working on SaaS applications.</li> <li>Strong technical background with proficiency in front-end and back-end technologies, such as Java, Kotlin, Spring, Hibernate, Vue/React, PostgreSQL, and MongoDB. Experience with Docker and Kubernetes is advantageous.</li> <li>Familiarity with cloud platforms like AWS, Azure, or Google Cloud for building scalable applications</li> <li>Understanding of Test-Driven Development (TDD) principles.</li> <li>Experience with unit, integration and function testing using front-end and back-end testing libraries</li> <li>Understanding of web security best practices and compliance with industry regulations.</li> <li>Familiarity with container technologies like Docker and cloud infrastructure solutions.</li> <li>Experience in collaborating with cross-functional teams</li> <li>Excellent problem-solving skills and a proactive approach to troubleshooting and bug-fixing</li> <li>Strong communication skills to effectively interact with both technical and non-technical team members with diverse backgrounds</li> <li>A passion for staying updated with the latest trends, technologies, and best practices in software development</li> </ul><p><strong>Why You'll Love Working Here</strong></p><ul> <li>Fully Remote</li> <li>Flexible Leave</li> <li>International Environment</li> <li>Competitive renumeration package</li> <li>Performance Bonus</li> <li>Stock Options after 6 months </li> <li>Company activities and events</li> <li>Learning and development plan</li> </ul><p><strong>CoverGo Company</strong><a href=\"https://www.youtube.com/watch?v=YI0ezLxvFvA\" rel=\"nofollow noreferrer noopener\" class=\"external\"><strong> Video</strong></a></p><p>By submitting your application, you confirm that you have read, understood, and accepted the content of CoverGo’s <a href=\"https://apply.workable.com/covergo/gdpr_policy?lng=en\" target=\"_blank\" rel=\"nofollow noreferrer noopener\" class=\"external\">Privacy Notice</a> and you consent to the processing of your data as part of this application.</p><p><a href=\"https://www.youtube.com/watch?v=YI0ezLxvFvA\" rel=\"nofollow noreferrer noopener\" class=\"external\"></a></p><h3>Requirements: </h3><h3>Benefits: </h3>","tags":"[\"postgres\",\"mongo\",\"aws\"]","pubDate":"2024-02-27 00:00:00.000","link":"https://apply.workable.com/covergo/j/B28F3B55FF","savedDate":"2024-02-27 05:49:48.365","slug":"full-stack-engineer-fully-remote-covergo-794"},{"id":2010882151,"title":"Full Stack Engineer (Fully Remote)","company":"CoverGo","image":"https://pbs.twimg.com/profile_images/1382655628523364355/MWPIbbID_400x400.jpg","description":"<p><strong>Top 3 Reasons To Join Us</strong></p><ul> <li>Competitive Salary</li> <li>100% Remote</li> <li>Working on the latest tech for the Insurtech Market Leader</li> </ul><p><strong>About Us</strong></p><p>At CoverGo, our mission is to empower all insurance companies to make insurance 100% digital and accessible to everyone.</p><ul> <li>We are a leading global no-code insurance platform for health, life, and P&amp;C</li> <li>We’re the winner of the Insurtech of the Year in all of Asia and other awards globally</li> <li>We work with insurance enterprise clients such as AXA, Bupa, MSIG, Dai-ichi, Bank of China Group Insurance, and many more</li> <li>We're an international, diverse team of over 120 people with 30 nationalities and team members working remotely from all over the world</li> <li>We are fully funded and backed by reputable VC funds and strategic institutional investors</li> <li>We have a global presence in Asia, EMEA and the Americas</li> <li>We’ve grown our annualized revenue by over 30x since January 2021</li> <li>We’re constantly working towards making CoverGo a workplace that you love coming to. We deeply believe that bringing together a diversity of thoughts, expressions, and perspectives is key to building the best culture for equally diverse communities all over the world</li> </ul><p><strong>About the Role</strong></p><p>As a Full Stack Engineer at CoverGo, you will contribute to the ongoing development and enhancement of our innovative insurance enterprise software solutions. Showcase your proficiency with both front-end and back-end technologies. Collaborate with cross-functional teams, participate in code reviews, and contribute to maintaining code quality through testing. Investigate and address bugs promptly to ensure the reliability and security of our platform while staying informed about the latest technologies and best practices in software development.</p><p><strong>What You Will Do</strong></p><ul> <li>Contribute to the design, implementation, and maintenance of new features and functionalities for our SaaSplatform.</li> <li>Work with both front-end and back-end technologies.</li> <li>Collaborate with cross-functional teams to understand end-user requirements, translating them into scalable and efficient software solutions.</li> <li>Participate in code reviews, adhere to coding best practices, and contribute to maintaining code quality through unit and integration testing.</li> <li>Investigate and address bugs promptly to ensure the reliability of the platform.</li> <li>Contribute to ensuring security and compliance by following best practices and adhering to industry regulations.</li> <li>Stay informed about the latest technologies, frameworks, and best practices in software development.</li> </ul><p><strong>What We Need</strong></p><ul> <li>Proven experience of 4+ years as a Full Stack Engineer, with experience working on SaaS applications.</li> <li>Strong technical background with proficiency in front-end and back-end technologies, such as Java, Kotlin, Spring, Hibernate, Vue/React, PostgreSQL, and MongoDB. Experience with Docker and Kubernetes is advantageous.</li> <li>Familiarity with cloud platforms like AWS, Azure, or Google Cloud for building scalable applications</li> <li>Understanding of Test-Driven Development (TDD) principles.</li> <li>Experience with unit, integration and function testing using front-end and back-end testing libraries</li> <li>Understanding of web security best practices and compliance with industry regulations.</li> <li>Familiarity with container technologies like Docker and cloud infrastructure solutions.</li> <li>Experience in collaborating with cross-functional teams</li> <li>Excellent problem-solving skills and a proactive approach to troubleshooting and bug-fixing</li> <li>Strong communication skills to effectively interact with both technical and non-technical team members with diverse backgrounds</li> <li>A passion for staying updated with the latest trends, technologies, and best practices in software development</li> </ul><p><strong>Why You'll Love Working Here</strong></p><ul> <li>Fully Remote</li> <li>Flexible Leave</li> <li>International Environment</li> <li>Competitive renumeration package</li> <li>Performance Bonus</li> <li>Stock Options after 6 months </li> <li>Company activities and events</li> <li>Learning and development plan</li> </ul><p><strong>CoverGo Company</strong><a href=\"https://www.youtube.com/watch?v=YI0ezLxvFvA\" rel=\"nofollow noreferrer noopener\" class=\"external\"><strong> Video</strong></a></p><p>By submitting your application, you confirm that you have read, understood, and accepted the content of CoverGo’s <a href=\"https://apply.workable.com/covergo/gdpr_policy?lng=en\" target=\"_blank\" rel=\"nofollow noreferrer noopener\" class=\"external\">Privacy Notice</a> and you consent to the processing of your data as part of this application.</p><p><a href=\"https://www.youtube.com/watch?v=YI0ezLxvFvA\" rel=\"nofollow noreferrer noopener\" class=\"external\"></a></p><h3>Requirements: </h3><h3>Benefits: </h3>","tags":"[\"postgres\",\"mongo\",\"aws\"]","pubDate":"2024-02-27 00:00:00.000","link":"https://apply.workable.com/covergo/j/7E4C0C12C5","savedDate":"2024-02-27 05:49:48.366","slug":"full-stack-engineer-fully-remote-covergo-3437"},{"id":6839306275,"title":"Full Stack Engineer (Fully Remote)","company":"CoverGo","image":"https://pbs.twimg.com/profile_images/1382655628523364355/MWPIbbID_400x400.jpg","description":"<p><strong>Top 3 Reasons To Join Us</strong></p><ul> <li>Competitive Salary</li> <li>100% Remote</li> <li>Working on the latest tech for the Insurtech Market Leader</li> </ul><p><strong>About Us</strong></p><p>At CoverGo, our mission is to empower all insurance companies to make insurance 100% digital and accessible to everyone.</p><ul> <li>We are a leading global no-code insurance platform for health, life, and P&amp;C</li> <li>We’re the winner of the Insurtech of the Year in all of Asia and other awards globally</li> <li>We work with insurance enterprise clients such as AXA, Bupa, MSIG, Dai-ichi, Bank of China Group Insurance, and many more</li> <li>We're an international, diverse team of over 120 people with 30 nationalities and team members working remotely from all over the world</li> <li>We are fully funded and backed by reputable VC funds and strategic institutional investors</li> <li>We have a global presence in Asia, EMEA and the Americas</li> <li>We’ve grown our annualized revenue by over 30x since January 2021</li> <li>We’re constantly working towards making CoverGo a workplace that you love coming to. We deeply believe that bringing together a diversity of thoughts, expressions, and perspectives is key to building the best culture for equally diverse communities all over the world</li> </ul><p><strong>About the Role</strong></p><p>As a Full Stack Engineer at CoverGo, you will contribute to the ongoing development and enhancement of our innovative insurance enterprise software solutions. Showcase your proficiency with both front-end and back-end technologies. Collaborate with cross-functional teams, participate in code reviews, and contribute to maintaining code quality through testing. Investigate and address bugs promptly to ensure the reliability and security of our platform while staying informed about the latest technologies and best practices in software development.</p><p><strong>What You Will Do</strong></p><ul> <li>Contribute to the design, implementation, and maintenance of new features and functionalities for our SaaSplatform.</li> <li>Work with both front-end and back-end technologies.</li> <li>Collaborate with cross-functional teams to understand end-user requirements, translating them into scalable and efficient software solutions.</li> <li>Participate in code reviews, adhere to coding best practices, and contribute to maintaining code quality through unit and integration testing.</li> <li>Investigate and address bugs promptly to ensure the reliability of the platform.</li> <li>Contribute to ensuring security and compliance by following best practices and adhering to industry regulations.</li> <li>Stay informed about the latest technologies, frameworks, and best practices in software development.</li> </ul><p><strong>What We Need</strong></p><ul> <li>Proven experience of 4+ years as a Full Stack Engineer, with experience working on SaaS applications.</li> <li>Strong technical background with proficiency in front-end and back-end technologies, such as Java, Kotlin, Spring, Hibernate, Vue/React, PostgreSQL, and MongoDB. Experience with Docker and Kubernetes is advantageous.</li> <li>Familiarity with cloud platforms like AWS, Azure, or Google Cloud for building scalable applications</li> <li>Understanding of Test-Driven Development (TDD) principles.</li> <li>Experience with unit, integration and function testing using front-end and back-end testing libraries</li> <li>Understanding of web security best practices and compliance with industry regulations.</li> <li>Familiarity with container technologies like Docker and cloud infrastructure solutions.</li> <li>Experience in collaborating with cross-functional teams</li> <li>Excellent problem-solving skills and a proactive approach to troubleshooting and bug-fixing</li> <li>Strong communication skills to effectively interact with both technical and non-technical team members with diverse backgrounds</li> <li>A passion for staying updated with the latest trends, technologies, and best practices in software development</li> </ul><p><strong>Why You'll Love Working Here</strong></p><ul> <li>Fully Remote</li> <li>Flexible Leave</li> <li>International Environment</li> <li>Competitive renumeration package</li> <li>Performance Bonus</li> <li>Stock Options after 6 months </li> <li>Company activities and events</li> <li>Learning and development plan</li> </ul><p><strong>CoverGo Company</strong><a href=\"https://www.youtube.com/watch?v=YI0ezLxvFvA\" rel=\"nofollow noreferrer noopener\" class=\"external\"><strong> Video</strong></a></p><p>By submitting your application, you confirm that you have read, understood, and accepted the content of CoverGo’s <a href=\"https://apply.workable.com/covergo/gdpr_policy?lng=en\" target=\"_blank\" rel=\"nofollow noreferrer noopener\" class=\"external\">Privacy Notice</a> and you consent to the processing of your data as part of this application.</p><p><a href=\"https://www.youtube.com/watch?v=YI0ezLxvFvA\" rel=\"nofollow noreferrer noopener\" class=\"external\"></a></p><h3>Requirements: </h3><h3>Benefits: </h3>","tags":"[\"postgres\",\"mongo\",\"aws\"]","pubDate":"2024-02-27 00:00:00.000","link":"https://apply.workable.com/covergo/j/D2EB7E6DE0","savedDate":"2024-02-27 05:49:48.366","slug":"full-stack-engineer-fully-remote-covergo-5190"},{"id":4564748348,"title":"HR Admin (Fully Remote)","company":"CoverGo","image":"https://pbs.twimg.com/profile_images/1382655628523364355/MWPIbbID_400x400.jpg","description":"<p><strong>Top 3 Reasons To Join Us</strong></p><ul> <li>Competitive Salary</li> <li>100% Remote</li> <li>Working on the latest tech for the Insurtech Market Leader</li> </ul><p><strong>About Us:</strong></p><ul> <li>At CoverGo, our mission is to empower all insurance companies to make insurance 100% digital and accessible to everyone.</li> <li>We are a leading global no-code insurance platform for health, life, and P&amp;C</li> <li>We’re the winner of the Insurtech of the Year in all of Asia and other awards globally</li> <li>We work with insurance enterprise clients such as AXA, Bupa, MSIG, Dai-ichi, Bank of China Group Insurance, and many more</li> <li>We're an international, diverse team of over 120 people with 30 nationalities and team members working remotely from all over the world</li> <li>We are fully funded and backed by reputable VC funds and strategic institutional investors</li> <li>We have a global presence in Asia, EMEA and the Americas</li> <li>We’ve grown our annualized revenue by over 30x since January 2021</li> <li>We’re constantly working towards making CoverGo a workplace that you love coming to. We deeply believe that bringing together a diversity of thoughts, expressions, and perspectives is key to building the best culture for equally diverse communities all over the world</li> </ul><p><strong>What you will do:</strong></p><ul> <li>Assist the HR team in end-to-end recruitment processes, primarily managing the applicant tracking system</li> <li>Monitor the onboarding and offboarding task lists for joiners and leavers and assist in preparing and gathering documentation</li> <li>Prepare employment contracts, offer letters, and other HR-related documents.</li> <li>Collaborate with the staff club to develop and execute engagement strategies.</li> <li>Participate in HR team meetings and provide updates as required.</li> <li>Support HR team with administrative tasks.</li> <li>Maintain confidentiality of HR information and handle sensitive matters appropriately.</li> <li>Adapt to changing priorities and take on additional responsibilities when needed.</li> </ul><p><strong>What we are looking for:</strong></p><ul> <li>Degree in Psychology, Human Resource Development, or any related course</li> <li>Previous experience working for a startup or in Human resources is a plus</li> <li>Excellent skills in the use of Microsoft Office</li> <li>Able to work independently and under pressure in a fast-paced environment with an emphasis on accuracy and timeliness</li> <li>Self-motivated, hardworking, a strong sense of responsibility with a positive working attitude</li> <li>Good command of English is a must</li> </ul><p><a href=\"https://www.youtube.com/watch?v=YI0ezLxvFvA\" rel=\"nofollow noreferrer noopener\" class=\"external\"></a><strong>Why You'll Love Working Here</strong></p><ul> <li>Fully Remote</li> <li>Flexible Leave</li> <li>International Environment</li> <li>Competitive renumeration package</li> <li>Performance Bonus</li> <li>Stock Options after 6 months </li> <li>Company activities and events</li> <li>Learning and development plan</li> </ul><p><strong>CoverGo Company</strong><a href=\"https://www.youtube.com/watch?v=YI0ezLxvFvA\" rel=\"nofollow noreferrer noopener\" class=\"external\"><strong> Video</strong></a></p><p>By submitting your application, you confirm that you have read, understood, and accepted the content of CoverGo’s <a href=\"https://apply.workable.com/covergo/gdpr_policy?lng=en\" target=\"_blank\" rel=\"nofollow noreferrer noopener\" class=\"external\">Privacy Notice</a> and you consent to the processing of your data as part of this application.</p><h3>Requirements: </h3><h3>Benefits: </h3>","tags":"[]","pubDate":"2024-02-26 00:00:00.000","link":"https://apply.workable.com/covergo/j/A0C7E0BC24","savedDate":"2024-02-27 05:49:48.369","slug":"hr-admin-fully-remote-covergo-9256"},{"id":5644607781,"title":"Sr. Analytics Manager, Operations","company":"Himshers","image":"https://remotive.com/job/1898649/logo","description":"<div class='\"content-intro\"'><p>Hims &amp; Hers Health, Inc. (better known as Hims &amp; Hers) is the leading health and wellness platform, on a mission to help the world feel great through the power of better health. We are revolutionizing telehealth for providers and their patients alike. Making personalized solutions accessible is of paramount importance to Hims &amp; Hers and we are focused on continued innovation in this space. Hims &amp; Hers offers nonprescription products and access to highly personalized prescription solutions for a variety of conditions related to mental health, sexual health, hair care, skincare, heart health, and more.</p>\n<p>Hims &amp; Hers is a public company, traded on the NYSE under the ticker symbol “HIMS”. To learn more about the brand and offerings, you can visit<a href=\"%22http://forhims.com/%22\" rel=\"nofollow\"> hims.com</a> and<a href=\"%22http://forhers.com/%22\" rel=\"nofollow\"> forhers.com</a>, or visit our<a href=\"%22https://investors.hims.com/overview/default.aspx%22\" rel=\"nofollow\"> investor site</a>. For information on the company’s outstanding benefits, culture, and its talent-first flexible/remote work approach, see below and visit <a href=\"%22http://www.hims.com/careers-professionals%22\" rel=\"nofollow\">www.hims.com/careers-professionals</a>.</p></div><div class=\"h3\"><strong>​​About the Role:</strong></div>\n<p>Hims &amp; Hers is seeking an experienced analytics leader to manage and grow a team, enabling the Customer Experience (CX) team to make data-driven decisions. Reporting to the Director of Analytics, you will evolve the core operations data infrastructure to deliver a singular goal: every patient gets access to timely, high-quality, affordable healthcare. The Senior Manager will be the key advisor to the CX team to help build the data-driven foundation that powers business decisions at Hims &amp; Hers, from executive-level strategy to day-to-day operational execution.</p>\n<div class=\"h3\"><strong>You Will:</strong></div>\n<ul style=\"\">\n<li style=\"\">Manage, mentor, and build a high-performing team of analysts who are able to gather and synthesize data quickly and accurately</li>\n<li style=\"\">Build for scale: proactively identify, codify, and implement a core platform for data-driven decision-making across multiple business lines, modalities, and treatment types</li>\n<li style=\"\">Think through complex problems, determine proper analytical processes and procedures, independently derive conclusions, and present results to the organization</li>\n<li style=\"\">Measure the impact of throughput through the creation of KPIs to help measure against business outcomes</li>\n<li style=\"\">Lead the team by identifying growth optimization opportunities; collaborating cross-functionally to structure, measure, and execute tests; and driving adoption and knowledge at all levels of the organization</li>\n<li style=\"\">Challenge status quo: initiate and debate key strategic topics and opportunities from your team’s work, and drive bold high-impact decisions  </li>\n<li style=\"\">Leverage internal and external data to identify growth opportunities, providing data-driven recommendations for business expansion</li>\n<li style=\"\">Collaborate with cross-functional partners in data engineering, operations, data science, and finance to define and build data-informed business strategies and roadmaps</li>\n<li style=\"\">Deliver high-quality insights &amp; dashboards for executive-level consumption</li>\n</ul>\n<div class=\"h3\"><strong>You Have:</strong></div>\n<ul style=\"\">\n<li style=\"\">Superb written and verbal communication skills; experience presenting to senior, cross-functional stakeholders</li>\n<li style=\"\">Ability to contextualize data and insights within the business context, collaborating with, and communicating findings to the technical and non-technical teammates</li>\n<li style=\"\">Ability to thrive and adapt in a fast-paced, high-growth, and rapidly changing environment</li>\n<li style=\"\">6+ years experience in a customer experience or customer service-focused role in areas such as data engineering, business intelligence, operations, or analytics</li>\n<li style=\"\">3+ years of experience hiring, managing, and developing high-performing teams</li>\n<li style=\"\">Exceptional SQL skills</li>\n<li style=\"\">Hands-on experience working with a modern analytics tech stack (Looker, Google BigQuery, DBT, Python, R, etc.)</li>\n<li style=\"\">2+ years of experience with ML/ automation solutions in an operational environment</li>\n<li style=\"\">Advanced degree (MS) in mathematics, statistics, data analytics, or a related field</li>\n</ul>\n<div class=\"h3\"><strong>Our Benefits (there are more but here are some highlights):</strong></div>\n<ul style=\"\">\n<li style=\"\">Competitive salary &amp; equity compensation for full-time roles</li>\n<li style=\"\">Unlimited PTO, company holidays, and quarterly mental health days</li>\n<li style=\"\">Comprehensive health benefits including medical, dental &amp; vision, and parental leave</li>\n<li style=\"\">Employee Stock Purchase Program (ESPP)</li>\n<li style=\"\">Employee discounts on hims &amp; hers &amp; Apostrophe online products</li>\n<li style=\"\">401k benefits with employer matching contribution</li>\n<li style=\"\">Offsite team retreats</li>\n</ul>\n<p><em>#LI-Remote</em></p><div class='\"content-pay-transparency\"'><div class='\"pay-input\"'><div class='\"description\"'>Outlined below is a reasonable estimate of H&amp;H’s compensation range for this role.  <br><br>H&amp;H also offers a comprehensive Total Rewards package that includes equity grants of restricted stock (RSU’s) so that H&amp;H employees own a piece of our company.<br><br>The actual amount will take into account a range of factors that are considered in making compensation decisions including but not limited to, skill sets, experience and training, licensure and certifications, and location.<br><br>Consult with your Recruiter during any potential screening to determine a more targeted range based on the job-related factors. We don’t ever want the pay range to act as a deterrent from you applying! </div><div class='\"title\"'>An estimate of the current salary range for US-based employees is</div><div class='\"pay-range\"'><span>$150,000</span><span class='\"divider\"'>—</span><span>$190,000 USD</span></div></div></div><div class='\"content-conclusion\"'><p>We are focused on building a diverse and inclusive workforce. If you’re excited about this role, but do not meet 100% of the qualifications listed above, we encourage you to apply.</p>\n<p>Hims is an Equal Opportunity Employer and considers applicants for employment without regard to race, color, religion, sex, orientation, national origin, age, disability, genetics or any other basis forbidden under federal, state, or local law. Hims considers all qualified applicants in accordance with the San Francisco Fair Chance Ordinance.</p>\n<p><em>Hims &amp; hers is committed to providing reasonable accommodations for qualified individuals with disabilities and disabled veterans in our job application procedures. If you need assistance or an accommodation due to a disability, you may contact us at <a href=\"%22mailto:accommodations@forhims.com%22\" rel=\"nofollow\">accommodations@forhims.com</a>. Please do not send resumes to this email address.</em></p>\n<p><em>For our California-based applicants – Please see our <a href=\"%22https://www.hims.com/california-employment-candidate-privacy-policy%22\" rel=\"nofollow\" target='\"_blank\"'>California Employment Candidate Privacy Policy</a> to learn more about how we collect, use, retain, and disclose Personal Information. </em></p></div><img src=\"https://remotive.com/job/track/1898649/blank.gif?source=public_api\" alt=\"\"/>","tags":"[\"python\",\"sql\"]","pubDate":"2024-02-25 19:21:06.000","link":"https://remotive.com/remote-jobs/data/sr-analytics-manager-operations-1898649","savedDate":"2024-02-27 05:49:48.361","slug":"sr-analytics-manager-operations-himshers-1229"},{"id":3778493100,"title":"Implementation and Success Lead","company":"Better Health","image":"https://remotive.com/job/1898334/logo","description":"<p>Better Health is seeking a highly motivated and experienced Implementation and Success Lead to join our team and play a pivotal role in the successful deployment of our comprehensive medical supplies and peer support solutions. </p>\n<p>As our Implementation and Success Lead, you will be responsible for overseeing the end-to-end implementation process, ensuring seamless integration of our solutions with payers. This is a new position due to company growth, and you will have the opportunity to help develop and craft your future with the company. Initially, your primary focus will be on managing project timelines, coordinating with cross-functional teams, and ensuring that implementations are executed with precision to meet the unique needs of our clients in the healthcare industry. You will bring your experience in project management, customer implementations, and client success to deliver amazing experiences for our new healthcare payer channel and help to manage these relationships.</p>\n<p>The pay range for this role is between $70,000 and $95,000, depending on candidate experience and qualifications.</p>\n<p>You will be joining an exciting, fast-growing healthcare startup and will have a voice and opportunity to bring about meaningful change in the chronic condition management space.  <br><br></p>\n<p><strong>Responsibilities:</strong></p>\n<ul style=\"\">\n<li style=\"\">Project Planning and Coordination:\n<ul style=\"\">\n<li style=\"\">Develop comprehensive project plans outlining tasks, timelines, and resource requirements and lead projects</li>\n<li style=\"\">Collaborate with internal teams, including development, quality assurance, and support, to ensure alignment on project goals and milestones</li>\n<li style=\"\">Create and maintain comprehensive documentation, including project plans, technical specifications, and client communication records.</li>\n<li style=\"\">Work closely with clients to gather and analyze their business requirements for successful system integration.</li>\n<li style=\"\">Translate client needs into detailed specifications for the development team</li>\n<li style=\"\">Oversee the testing phase to ensure that implemented solutions meet quality standards and client expectations</li>\n</ul>\n</li>\n<li style=\"\">Client Communication and Relationship Management\n<ul style=\"\">\n<li style=\"\">Serve as the primary point of contact for payer clients during the implementation phase, working closely with sales, ops, product and marketing</li>\n<li style=\"\">Conduct regular client status meetings and provide timely updates on project progress and ongoing relationship management</li>\n<li style=\"\">Foster positive relationships with clients to understand their unique requirements and address concerns effectively</li>\n<li style=\"\">Prepare internal and external reports on project performance and progress</li>\n<li style=\"\">Accountability to drive retention and customer success<br><br></li>\n</ul>\n</li>\n</ul>\n<p><strong>Qualifications:</strong></p>\n<ul style=\"\">\n<li style=\"\">Proven experience as an Implementation/Project Lead or similar role, preferably in healthcare</li>\n<li style=\"\">Strong project management skills with the ability to manage multiple projects simultaneously</li>\n<li style=\"\">Bachelor’s degree in a relevant field (e.g., Business, Healthcare Management)</li>\n<li style=\"\">Excellent communication and interpersonal skills</li>\n<li style=\"\">Excellent customer service skills</li>\n<li style=\"\">Excellent attention to detail and organizational skills  </li>\n<li style=\"\">Understanding of health insurance industry</li>\n<li style=\"\">Strong Technical proficiency </li>\n<li style=\"\">Problem-solving mindset and the ability to adapt to evolving project requirements</li>\n</ul>\n<img src=\"https://remotive.com/job/track/1898334/blank.gif?source=public_api\" alt=\"\"/>","tags":"[\"project management\"]","pubDate":"2024-02-24 13:20:09.000","link":"https://remotive.com/remote-jobs/business/implementation-and-success-lead-1898334","savedDate":"2024-02-27 05:49:48.362","slug":"implementation-and-success-lead-better-health-4389"},{"id":6973535402,"title":"QA Automation Engineer","company":"Tabby","image":"https://remotive.com/job/1898039/logo","description":"<div><!--block--><br></div><div><!--block-->We are hiring for Senior QA Automation Engineer to join one of our Core Teams! In this role, you'll be an integral part of our backend development team, ensuring that our product meets the highest standards of quality. You'll thrive in our fast-paced, ever-evolving environment, utilizing your expertise to implement robust QA processes.</div><br><br><div class=\"h3\">Key Responsibilities</div><ul style=\"\"><li style=\"\"><!--block-->Implement and refine QA processes within the backend development team, leveraging company tools such as golang, gitlab, qase.io, and jira.</li><li style=\"\"><!--block-->Conduct comprehensive functional and non-functional testing to uncover potential issues and ensure seamless product performance.</li><li style=\"\"><!--block-->Develop and maintain automated tests in alignment with the testing pyramid, ensuring efficient and effective testing coverage.</li></ul><div><!--block--><br></div><br><br><div class=\"h3\">Skills, Knowledge and Expertise</div><ul style=\"\"><li style=\"\"><!--block-->Proven experience in testing and automating APIs, demonstrating a deep understanding of API testing best practices.</li><li style=\"\"><!--block-->A product-oriented approach to QA, with a keen eye for detail and a focus on delivering a flawless user experience.</li><li style=\"\"><!--block-->2+ years of hands-on experience in the role of \"QA Automation,\" showcasing expertise in building and executing automated testing suites.</li><li style=\"\"><!--block-->Proficiency in programming languages such as golang, python, or java (golang preferred), allowing you to create robust and efficient automation scripts.</li><li style=\"\"><!--block-->Strong knowledge of CI/CD pipelines in any form, indicating your ability to integrate automated testing seamlessly into our development workflows.</li></ul><div><!--block--><br></div><br><br><div class=\"h3\">Benefits</div><ul style=\"\"><li style=\"\"><!--block-->We offer flexible working hours and trust you to work enough hours to do your job well, at times that suit you and your team.</li><li style=\"\"><!--block-->A working environment that gives you autonomy and responsibility from day one.</li><li style=\"\"><!--block-->You should be comfortable with the idea that the quality of your work will influence the shape of your career.</li><li style=\"\"><!--block-->Participation in company’s employee stock options program.</li><li style=\"\"><!--block-->Health Insurance</li></ul><div><!--block--><br></div><img src=\"https://remotive.com/job/track/1898039/blank.gif?source=public_api\" alt=\"\"/>","tags":"[\"golang\",\"python\",\"CI/CD\"]","pubDate":"2024-02-23 21:21:56.000","link":"https://remotive.com/remote-jobs/qa/qa-automation-engineer-1898039","savedDate":"2024-02-27 05:49:48.362","slug":"qa-automation-engineer-tabby-6205"},{"id":2797392331,"title":"Trainee Junior Software Tester","company":"Onion Training","image":"https://remotive.com/job/1898761/logo","description":"<p class=\"MsoNormal\" style=\"margin-bottom:0cm;line-height:normal\"><strong><span style=\"mso-ascii-theme-font:\r\nminor-latin;mso-hansi-theme-font:minor-latin;mso-bidi-theme-font:minor-latin\">Location</span></strong><span style=\"mso-bidi-mso-bidi-theme-font:minor-latin\">:\r\nRemote – Anywhere<p></p></span></p><p class=\"MsoNormal\" style=\"margin-bottom:0cm;line-height:normal\"><strong><span style=\"mso-ascii-theme-font:\r\nminor-latin;mso-hansi-theme-font:minor-latin;mso-bidi-theme-font:minor-latin\">Duration</span></strong><span style=\"mso-bidi-mso-bidi-theme-font:minor-latin\">:\r\n6-Month Contract<p></p></span></p><p class=\"MsoNormal\" style=\"margin-bottom:0cm;line-height:normal\"><strong><span style=\"mso-ascii-theme-font:\r\nminor-latin;mso-hansi-theme-font:minor-latin;mso-bidi-theme-font:minor-latin\">Full-time</span></strong><span style=\"mso-bidi-mso-bidi-theme-font:minor-latin\">:\r\nEntry Level<p></p></span></p><p class=\"MsoNormal\" style=\"margin-bottom:0cm;line-height:normal\"><strong>Daily\r\nRate</strong><span style=\"mso-bidi-\r\nmso-bidi-theme-font:minor-latin\">: $125.00 </span><span style=\"\r\nmso-fareast-mso-bidi-\r\nmso-bidi-theme-font:minor-latin;mso-font-kerning:0pt;mso-ligatures:none;\r\nmso-fareast-language:EN-GB\"><p></p></span></p><p class=\"MsoNormal\" style=\"mso-margin-top-alt:auto;mso-margin-bottom-alt:auto;\r\nline-height:normal\"><span style=\"mso-fareast-\r\nmso-bidi-mso-bidi-theme-font:minor-latin;mso-font-kerning:\r\n0pt;mso-ligatures:none;mso-fareast-language:EN-GB\"><br></span></p><p class=\"MsoNormal\" style=\"mso-margin-top-alt:auto;mso-margin-bottom-alt:auto;\r\nline-height:normal\"><span style=\"mso-fareast-\r\nmso-bidi-mso-bidi-theme-font:minor-latin;mso-font-kerning:\r\n0pt;mso-ligatures:none;mso-fareast-language:EN-GB\">Are you curious about the\r\nworld of software quality assurance and development? Do you have a desire to\r\nenhance your software testing skills? If you do, we've got something exciting\r\nfor you.<p></p></span></p><p class=\"MsoNormal\" style=\"mso-margin-top-alt:auto;mso-margin-bottom-alt:auto;\r\nline-height:normal\"><strong><br></strong></p><p class=\"MsoNormal\" style=\"mso-margin-top-alt:auto;mso-margin-bottom-alt:auto;\r\nline-height:normal\"><strong>Role\r\nOverview</strong><span style=\"mso-fareast-\r\nmso-bidi-mso-bidi-theme-font:minor-latin;mso-font-kerning:\r\n0pt;mso-ligatures:none;mso-fareast-language:EN-GB\">:<p></p></span></p><p class=\"MsoNormal\" style=\"mso-margin-top-alt:auto;mso-margin-bottom-alt:auto;\r\nline-height:normal\"><span style=\"mso-fareast-\r\nmso-bidi-mso-bidi-theme-font:minor-latin;mso-font-kerning:\r\n0pt;mso-ligatures:none;mso-fareast-language:EN-GB\">As a Software Testing\r\nTrainee, you're about to embark on an exciting journey. This adventure will\r\nhelp you sharpen your manual software testing skills while diving deep into the\r\nworld of software development. You won't be on the sidelines; you'll be an essential\r\npart of our team, working closely with our developers. This programme isn't\r\njust about learning; it's about doing. You'll get to pick the brains of pros,\r\napply your newfound wisdom in real-world scenarios, and set the stage for a\r\nrewarding career in quality software engineering.<p></p></span></p><p class=\"MsoNormal\" style=\"mso-margin-top-alt:auto;mso-margin-bottom-alt:auto;\r\nline-height:normal\"><strong><br></strong></p><p class=\"MsoNormal\" style=\"mso-margin-top-alt:auto;mso-margin-bottom-alt:auto;\r\nline-height:normal\"><strong>Qualifications:</strong><span style=\"mso-fareast-mso-bidi-font-family:\r\nCalibri;mso-bidi-theme-font:minor-latin;mso-font-kerning:0pt;mso-ligatures:\r\nnone;mso-fareast-language:EN-GB\"><p></p></span></p><ul style=\"\" type=\"disc\">\n<li class=\"MsoNormal\" style=\"\"><span style=\"mso-fareast-\r\n     mso-bidi-mso-bidi-theme-font:minor-latin;mso-font-kerning:\r\n     0pt;mso-ligatures:none;mso-fareast-language:EN-GB\">A burning desire to\r\n     build a career in software testing.<p></p></span></li>\n<li class=\"MsoNormal\" style=\"\"><span style=\"mso-fareast-\r\n     mso-bidi-mso-bidi-theme-font:minor-latin;mso-font-kerning:\r\n     0pt;mso-ligatures:none;mso-fareast-language:EN-GB\">Fantastic communication\r\n     skills and a knack for getting along with others.<p></p></span></li>\n<li class=\"MsoNormal\" style=\"\"><span style=\"mso-fareast-\r\n     mso-bidi-mso-bidi-theme-font:minor-latin;mso-font-kerning:\r\n     0pt;mso-ligatures:none;mso-fareast-language:EN-GB\">An analytical mind with\r\n     a laser focus on the details.<p></p></span></li>\n<li class=\"MsoNormal\" style=\"\"><span style=\"mso-fareast-\r\n     mso-bidi-mso-bidi-theme-font:minor-latin;mso-font-kerning:\r\n     0pt;mso-ligatures:none;mso-fareast-language:EN-GB\">The ability to shine\r\n     both in a team and when flying solo.<p></p></span></li>\n<li class=\"MsoNormal\" style=\"\"><span style=\"mso-fareast-\r\n     mso-bidi-mso-bidi-theme-font:minor-latin;mso-font-kerning:\r\n     0pt;mso-ligatures:none;mso-fareast-language:EN-GB\">A hunger for learning\r\n     and a fearless attitude towards challenges.<p></p></span></li>\n<li class=\"MsoNormal\" style=\"\"><span style=\"mso-fareast-\r\n     mso-bidi-mso-bidi-theme-font:minor-latin;mso-font-kerning:\r\n     0pt;mso-ligatures:none;mso-fareast-language:EN-GB\">Knowing a bit about\r\n     software development processes is a bonus, but don't worry if you're not\r\n     there yet, we’ve got you covered.<p></p></span></li>\n</ul><p class=\"MsoNormal\" style=\"mso-margin-top-alt:auto;mso-margin-bottom-alt:auto;\r\nline-height:normal\"><strong><br></strong></p><p class=\"MsoNormal\" style=\"mso-margin-top-alt:auto;mso-margin-bottom-alt:auto;\r\nline-height:normal\"><strong>What We\r\nBring to the Table</strong><span style='mso-fareast-font-family:\r\n\"Times New Roman\";mso-bidi-mso-bidi-theme-font:minor-latin;\r\nmso-font-kerning:0pt;mso-ligatures:none;mso-fareast-language:EN-GB'>:<p></p></span></p><ul style=\"\" type=\"disc\">\n<li class=\"MsoNormal\" style=\"\"><span style=\"mso-fareast-\r\n     mso-bidi-mso-bidi-theme-font:minor-latin;mso-font-kerning:\r\n     0pt;mso-ligatures:none;mso-fareast-language:EN-GB\">A well-structured\r\n     6-month training programme that's packed with skill-building\r\n     opportunities.<p></p></span></li>\n<li class=\"MsoNormal\" style=\"\"><span style=\"mso-fareast-\r\n     mso-bidi-mso-bidi-theme-font:minor-latin;mso-font-kerning:\r\n     0pt;mso-ligatures:none;mso-fareast-language:EN-GB\">Real-world experience,\r\n     working on live projects.<p></p></span></li>\n<li class=\"MsoNormal\" style=\"\"><span style=\"mso-fareast-\r\n     mso-bidi-mso-bidi-theme-font:minor-latin;mso-font-kerning:\r\n     0pt;mso-ligatures:none;mso-fareast-language:EN-GB\">Guidance from\r\n     experienced professionals in the field.<p></p></span></li>\n<li class=\"MsoNormal\" style=\"\"><span style=\"mso-fareast-\r\n     mso-bidi-mso-bidi-theme-font:minor-latin;mso-font-kerning:\r\n     0pt;mso-ligatures:none;mso-fareast-language:EN-GB\">A competitive day rate\r\n     that will make you smile.<p></p></span></li>\n<li class=\"MsoNormal\" style=\"\"><span style=\"mso-fareast-\r\n     mso-bidi-mso-bidi-theme-font:minor-latin;mso-font-kerning:\r\n     0pt;mso-ligatures:none;mso-fareast-language:EN-GB\">A supportive and\r\n     teamwork-friendly atmosphere.<p></p></span></li>\n<li class=\"MsoNormal\" style=\"\"><span style=\"mso-fareast-\r\n     mso-bidi-mso-bidi-theme-font:minor-latin;mso-font-kerning:\r\n     0pt;mso-ligatures:none;mso-fareast-language:EN-GB\">The chance to build a\r\n     long-term career with us.<p></p></span></li>\n</ul><p class=\"MsoNormal\" style=\"mso-margin-top-alt:auto;mso-margin-bottom-alt:auto;\r\nline-height:normal\"><strong><br></strong></p><p class=\"MsoNormal\" style=\"mso-margin-top-alt:auto;mso-margin-bottom-alt:auto;\r\nline-height:normal\"><strong>How to Get Onboard</strong><span style=\"mso-fareast-mso-bidi-font-family:\r\nCalibri;mso-bidi-theme-font:minor-latin;mso-font-kerning:0pt;mso-ligatures:\r\nnone;mso-fareast-language:EN-GB\">:<p></p></span></p><p>\n<span style=\"line-height:107%;\r\nmso-ascii-theme-font:minor-latin;mso-fareast-\r\nmso-hansi-theme-font:minor-latin;mso-bidi-theme-font:minor-latin;mso-font-kerning:\r\n0pt;mso-ligatures:none;mso-ansi-language:EN-GB;mso-fareast-language:EN-GB;\r\nmso-bidi-language:AR-SA\">If you're all set to kick-start your journey in\r\nsoftware testing, apply at </span><span style=\"line-height:\r\n107%;mso-ascii-theme-font:minor-latin;\r\nmso-fareast-mso-fareast-theme-font:minor-latin;mso-hansi-theme-font:\r\nminor-latin;mso-bidi-mso-bidi-theme-font:minor-bidi;\r\nmso-ansi-language:EN-GB;mso-fareast-language:EN-US;mso-bidi-language:AR-SA\"><a href=\"https://onion.training/careers/trainee-junior-software-tester/\" rel=\"nofollow\"><span style=\"line-height:107%;mso-fareast-\r\nmso-bidi-mso-bidi-theme-font:minor-latin;mso-font-kerning:\r\n0pt;mso-ligatures:none;mso-fareast-language:EN-GB\">https://onion.training/careers/trainee-junior-software-tester</span></a></span><span style=\"line-height:107%;\r\nmso-ascii-theme-font:minor-latin;mso-fareast-\r\nmso-hansi-theme-font:minor-latin;mso-bidi-theme-font:minor-latin;mso-font-kerning:\r\n0pt;mso-ligatures:none;mso-ansi-language:EN-GB;mso-fareast-language:EN-GB;\r\nmso-bidi-language:AR-SA\"></span></p>\n<img src=\"https://remotive.com/job/track/1898761/blank.gif?source=public_api\" alt=\"\"/>","tags":"[\"testing\"]","pubDate":"2024-02-23 06:02:02.000","link":"https://remotive.com/remote-jobs/qa/trainee-junior-software-tester-1898761","savedDate":"2024-02-27 05:49:48.362","slug":"trainee-junior-software-tester-onion-training-1495"},{"id":1174465025,"title":"Events Producer (Contractor)","company":"Scroll","image":"https://avatars.githubusercontent.com/u/87750292?s=200&v=4","description":"<div>Scroll is now looking to add an Event Producer to our community-oriented Events team. Working closely with the Event and Ecosystem team to help produce events globally to bring Scroll’s community closer.  </div><div><br></div><div>Your day-to-day work will involve getting your hands on with coordinating all aspects of Scroll produced events, including logistics, venue selection, and event content. We are looking for someone with a deep understanding of the Ethereum Ecosystem events culture with experience in event production. The ideal candidate will be able to be creative in expanding our event strategy and execution while collaborating with different departments within the team.</div><h3>Responsibilities</h3><li>Manage and coordinate events overall planning and detailed execution, from events calendar planning, objective settings, budget control, pre-event and on-site coordination.</li><li>Overseeing the Swag production for Scroll produced events end-to-end.</li><li>Managing vendor contracts, including negotiation, review, and execution.</li><li>Collaborating with Comms and Design teams to create event materials + copy such as invites and campaigns; coordinating with local video/photographers to get content.</li><li>Overseeing event setup and ensuring that all elements are in place according to the event plan.</li><li>Conducting post-event evaluations to assess the success of the event and identify areas for improvement.</li><li>Collaborate on a worldwide database of venues, vendors and partners to work with.</li><li>Plan, manage and coordinate internal team events, including internal offsites.</li>,<h3>Required Skills</h3><li>Individual contributor who is well organized, disciplined and effective when working autonomously on tasks and projects</li><li>Detail oriented and execution-focussed, proactive, responsible and responsive</li><li>Efficient executor who can work across multiple tasks, at pace, in a start-up environment</li><li>Ability to think and work strategically</li><li>Ability to track progress and push through completion of tasks expediently</li><li>Proficient at using data and metrics to review performance of tasks and projects</li><li>Have attended multiple Ethereum Ecosystem events is preferred</li><li>2 years experience in event production experience is preferred</li>,<h3>About You</h3><li>Hands-on, responsive, collaborative and committed person with a high work ethic</li><li>High class communicator who can articulate their views succinctly on calls or asynchronously</li><li>A great listener who understands when to listen first and engages well with colleagues</li><li>Balanced and calm nature which allows you to navigate the peaks and troughs of working for a web3 start-up</li>","tags":"[\"database\"]","pubDate":"2024-02-02 10:04:02.511","link":"https://jobs.lever.co/ScrollFoundation/6347d99f-492f-4773-be08-bca2d35842a4","savedDate":"2024-02-27 05:49:48.370","slug":"events-producer-contractor-scroll-6355"}]