[{"id":8125455478,"title":"Backend Test Engineer","company":"Ancient Gaming","image":"https://remotive.com/job/1852744/logo","description":"<p><strong>🌟 Allow us to introduce ourselves</strong></p>\n<p>Ancient Gaming, an innovative software creator for the future of iGaming, bucks the trend that has lacked innovation for two decades. <strong>We're not trend followers; we're trendsetters. </strong>As iGaming pioneers, we challenge the status quo, crafting not just appealing software but a whole new experience for the younger, high-spending generation seeking to reinvent gaming interactions.</p>\n<p> </p>\n<p>Founded in 2018 in Malta, we've become a global presence with <strong>50+ dedicated team members </strong>spanning <strong>25+ countries</strong>. And yes, we're proudly remote-first!</p>\n<p> </p>\n<p><strong>🚀 Your mission as a Backend Test Engineer!</strong></p>\n<p>As a Backend Test Engineer, you will be the one point of connection between Backend Developers and the QA team to ensure the excellence and reliability of our products by raising our Backend testing efficiency to a whole new level. You'll craft and maintain comprehensive Backend test suites to fortify the integrity of our platforms, focusing on using JavaScript automation suites. Your sharp eye will catch development defects before they hit production and Your prowess in identifying essential test data and debugging will be instrumental in eliminating any hindrances to the success of our automation suites.</p>\n<p><strong> </strong></p>\n<p><strong>What you’ll be doing:</strong></p>\n<ul style=\"\">\n<li style=\"\">Collaborating closely with our dedicated Backend Development and QA teams to write and develop test suits in order to improve the reliability of our products (including Integration, Unit, and Load tests)</li>\n<li style=\"\">Creating and maintaining test case documentation in the testing tool</li>\n<li style=\"\">Utilizing JavaScript automation suites</li>\n<li style=\"\">Reviewing QA Engineer’s test case creation to make sure they follow business requirements</li>\n<li style=\"\">Independently identifying development defects before items go into production</li>\n<li style=\"\">Identifying necessary test data to support testing</li>\n<li style=\"\">Debugging code that has been written to remove any defects that hinder the success of any automation suites</li>\n<li style=\"\">Utilizing an array of development tools to verify automation effectiveness</li>\n</ul>\n<p><strong>Examples of projects you’ll be working on:</strong></p>\n<ul style=\"\">\n<li style=\"\"><a href=\"https://www.csgoroll.com/\" rel=\"nofollow\" title=\"https://www.csgoroll.com/\">CSGORoll</a>: A community social gaming platform targeted towards CSGO players, featuring unique in-house custom-built games such as Roulette, Crash, Unboxing, and PVP. Users have the capability to bet and win Skins in real time.</li>\n<li style=\"\"><a href=\"https://www.hypedrop.com/\" rel=\"nofollow\" title=\"https://www.hypedrop.com/\">HypeDrop</a>: A platform for buying and opening Mystery Boxes in real-time, featuring an unboxing game where people can unbox real-life products and have them shipped to their houses.</li>\n<li style=\"\"><a href=\"https://www.hypeup.com/\" rel=\"nofollow\" title=\"https://www.hypeup.com/\">HypeUp</a>: An iGaming brand where users can wager their balance or items from their \"Inventory\" against other people's items, such as watches, electronics, sneakers, and more, and can physically redeem their contents upon withdrawal.</li>\n<li style=\"\">These projects use the same codebase and share libraries of components and modules.</li>\n</ul>\n<div>\n<div>\n<div>\n<div>\n<div>\n<div>\n<div>\n<div>\n<div>\n<p><strong><strong>You will thrive in this role if you have:</strong></strong></p>\n<ul style=\"\">\n<li style=\"\">Having at least 2 years of previous experience in Backend Development and Automated Testing (writing advanced Integration, Load and Unit tests).</li>\n<li style=\"\">Having a strong knowledge of JavaScript and TypeScript.</li>\n<li style=\"\">Someone who has previous experience working within the Node.js ecosystem.</li>\n<li style=\"\">Having previous experience in working with PostgreSQL/MySQL.</li>\n</ul>\n<p><strong><strong><strong>It will be good if you have:</strong></strong></strong></p>\n<ul style=\"\">\n<li style=\"\">Have previous experience with Redis, as well as Jest or K6 testing suits.</li>\n<li style=\"\">Have good Project Management skills.</li>\n</ul>\n<p><br><strong>What’s in it for you?</strong></p>\n<ul style=\"\">\n<li dir=\"ltr\" style=\"\"><strong>Flexibility Policy</strong> – It's about giving you the freedom to structure your workday in a way that best suits your lifestyle and responsibilities outside of work</li>\n<li dir=\"ltr\" style=\"\"><strong>Work-from-anywhere Policy</strong> – you have the chance to work from anywhere in the world, we are a remote-first company and we are proud of it!</li>\n<li dir=\"ltr\" style=\"\">Every year for our <strong>team-building </strong>we choose a location and go there to celebrate our achievements together</li>\n<li dir=\"ltr\" style=\"\">A<strong> dedicated budget</strong> to purchase all the equipment you need to set up your home office</li>\n<li dir=\"ltr\" style=\"\"><strong>L&amp;D budget</strong> for you to develop your skills!</li>\n<li dir=\"ltr\" style=\"\"><strong>Spill Mental Health Service </strong>– full access to counselling for any employees who need it</li>\n<li dir=\"ltr\" style=\"\">Young, fun, flat structured <strong>rapidly growing</strong> company with endless opportunities to grow</li>\n<li style=\"\">A <strong>diverse portfolio</strong> that includes gamified e-commerce, video game arcade and iGaming</li>\n<li style=\"\">Entirely <strong>modern</strong> stack, <strong>no legacy</strong> code!</li>\n</ul>\n<p> </p>\n<p><em>This post not only outlines our ideal candidate but also serves as an inspiration for what this role can evolve into. Even if you consider yourself an 80% fit but have a genuine passion for this position, we encourage you to apply. We're eager to hear from individuals who share our enthusiasm.</em></p>\n<p><br><em>Ancient Gaming is an equal-opportunity employer. All applicants will be considered for employment without attention to race, color, religion, sex, sexual orientation, gender identity, national origin, veteran or disability status.</em><em><br></em></p>\n</div>\n</div>\n</div>\n</div>\n</div>\n</div>\n</div>\n</div>\n</div>\n<img src=\"https://remotive.com/job/track/1852744/blank.gif?source=public_api\" alt=\"\"/>","tags":"[\"backend\",\"go\",\"javascript\",\"node.js\",\"postgresql\",\"video\",\"automation\",\"project management\",\"documentation\",\"Typescript \",\"Redis\",\"MySQL\",\"debugging\",\"testing\",\"jest\",\"workday\",\"mental health\"]","pubDate":"2023-12-06 15:20:24.000","link":"https://remotive.com/remote-jobs/qa/backend-test-engineer-1852744","savedDate":"2023-12-08 08:48:04.820","slug":"backend-test-engineer-ancient-gaming-2601"},{"id":1254866056,"title":"Applied Policy Researcher","company":"Hugging Face","image":"https://remotive.com/job/1849945/logo","description":"<p>Here at Hugging Face, we’re on a journey to advance good Machine Learning and make it more accessible. Along the way, we contribute to the development of technology for the better.</p>\n<p>We have built the fastest-growing, open-source, collaborative library of pre-trained models in the world. With more than 500K+ models and 250K+ stars on GitHub, over 15.000 companies are using HF technology in production, including leading AI organizations such as Google, Elastic, Salesforce, Algolia, and Grammarly.</p>\n<p>Hugging Face has become the most popular, community-driven project for training, sharing, and deploying the most advanced machine learning models. Workload efficiency is key to our mission of democratizing state of the art and we are always looking to push the boundaries for faster, and more efficient ways to train and deploy models.</p>\n<p><strong>About the job</strong></p>\n<p>We are looking for an Applied Policy Researcher to join our Machine Learning and Society team. You will work at the intersection of regulatory and technical questions to help bridge policymakers' and developers' perspectives by building tools and participating in policy conversations, through written communications and in person.</p>\n<p>Hugging Face's mission includes making ML systems more accessible and beneficial to people with all levels of technical expertise. As regulations and standards are taking a growing place in public conversations on AI, this increasingly includes ensuring that policymakers have sufficient visibility into the specifics of the technology and that developers have the tools they need to implement new requirements; especially in an open and collaborative development setting. The Applied Policy Researcher will be at the forefront of these efforts, developing tools and integrating state-of-the-art evaluations to help support ongoing public governance efforts - with a focus on evaluating the technology's social impacts. They will also leverage this experience to provide feedback on regulatory proposals reflecting the current state of the technology’s capabilities and social context.</p>\n<p>For additional context, you may want to have a look at our recent collaborations on <a class=\"external\" href=\"https://huggingface.co/datasets/bigcode/governance-card\" rel=\"nofollow\">governance in the BigCode project</a> and evaluating the <a class=\"external\" href=\"https://arxiv.org/abs/2306.05949\" rel=\"nofollow\">social impact of generative AI systems</a>, as well as our recent policy communications on the <a class=\"external\" href=\"https://huggingface.co/blog/eu-ai-act-oss\" rel=\"nofollow\">EU AI Act</a>, <a class=\"external\" href=\"https://huggingface.co/blog/policy-ntia-rfc\" rel=\"nofollow\">NTIA RFC on AI Accountability</a>, and <a class=\"external\" href=\"https://huggingface.co/blog/us-national-ai-research-resource\" rel=\"nofollow\">NAIRR RFC</a>.</p>\n<p><strong>About you</strong></p>\n<p>We are looking for candidates who love building tools for and collaborating with the wider community and share our vision for accessible technology.</p>\n<p>A good candidate for this role will have a multidisciplinary mindset and be comfortable working at the intersection of technical, regulatory, and ethical questions. The ability to quickly iterate on prototypes and to build accessible visualization tools to help analyze and explain the workings of recent ML systems, especially aspects that are the subject of proposed regulations, will be particularly valuable. The position also requires familiarity with prominent AI policy questions and regulatory proposals and an interest in writing regular policy memos and analyses. If you want to contribute to taking one of the fastest-growing ML companies to the next level, then we can't wait to see your application!</p>\n<p>If you're interested in joining us, but your experience is different from the traditional mold, we still encourage you to apply! We're building a diverse team whose skills, experiences, and backgrounds complement one another, and we value and encourage having multiple perspectives. We're happy to consider where you might be able to have the most impact.</p>\n<p><strong>More about Hugging Face</strong></p>\n<p><em><strong>We are actively working to build a culture that values diversity, equity, and inclusivity.</strong></em> We are intentionally building a workplace where people feel respected and supported—regardless of who you are or where you come from. We believe this is foundational to building a great company and community. Hugging Face is an equal-opportunity employer and we do not discriminate on the basis of race, religion, color, national origin, gender, sexual orientation, age, marital status, veteran status, or disability status.</p>\n<p><em><strong>We value development.</strong></em> You will work with some of the smartest people in our industry. We are an organization that has a bias for impact and is always challenging ourselves to continuously grow. We provide all employees with reimbursement for relevant conferences, training, and education.</p>\n<p><em><strong>We care about your well-being.</strong></em> We offer flexible working hours and remote options. We offer health, dental, and vision benefits for employees and their dependents. We also offer parental leave and unlimited paid time off.</p>\n<p><em><strong>We support our employees wherever they are.</strong></em> While we have office spaces in NYC and Paris, we’re very distributed and all remote employees have the opportunity to visit our offices. If needed, we’ll also outfit your workstation to ensure you succeed.</p>\n<p><em><strong>We want our teammates to be shareholders.</strong></em> All employees have company equity as part of their compensation package. If we succeed in becoming a category-defining platform in machine learning and artificial intelligence, everyone enjoys the upside.</p>\n<p><em><strong>We support the community.</strong></em> We believe major scientific advancements are the result of collaboration across the field. Join a community supporting the ML/AI community.</p>\n<img src=\"https://remotive.com/job/track/1849945/blank.gif?source=public_api\" alt=\"\"/>","tags":"[\"salesforce\",\"AI/ML\",\"research\",\"OSS\",\"github\",\"diversity\"]","pubDate":"2023-12-06 09:20:45.000","link":"https://remotive.com/remote-jobs/finance-legal/applied-policy-researcher-1849945","savedDate":"2023-12-08 08:48:04.820","slug":"applied-policy-researcher-hugging-face-9539"},{"id":9038774873,"title":"Senior iOS Developer","company":"Xapo61","image":"https://remotive.com/job/1856007/logo","description":"<div class='\"content-intro\"'>\n<p>Work from anywhere, impact everywhere </p>\n<p>We’re a fully distributed team of over 150 talented people that work remotely from 40+ countries around the world. We work hard, think globally, and inspire each other to learn and grow. <br>We are committed to changing the way things are done. To achieve that, we search the world for the best people for the job. This is how we are transforming the world of digital banking. </p>\n<p>Our team is worldwide, our capacity for innovation, limitless.</p>\n<p><strong>Risk is inherent in all of our business activities and managing risk well is the responsibility of every Xapien. <br>Sound risk management enables us to serve our customers and deliver value for our shareholders, and helps make Xapo a great place to work.</strong></p>\n<p><em>Although we are headquartered in Gibraltar, this is a full time, 100% remote position <br></em><em>Work from anywhere!</em></p>\n</div>\n<p> </p>\n<p><strong>Position overview</strong></p>\n<p>At Xapo we are building truly cross functional teams with full ownership of design, architecture, build and  test. You will collaborate closely with your fellow team members from the product, backend, design and QA communities of practice.</p>\n<p><strong>Responsibilities</strong></p>\n<p>As a Senior iOS Developer, you will be responsible for building components of our mobile app that will enable users all over the world to send, spend, save, and receive money and Bitcoin safely and globally. The impact of what you will help develop at Xapo will help people protect their life savings.</p>\n<p>If you are a passionate, enthusiastic engineer interested in revolutionizing the world of banking, join us!</p>\n<p><strong><br></strong>Our tech stack includes:</p>\n<ul style=\"\">\n<li style=\"\">Latest Swift</li>\n</ul>\n<ul style=\"\">\n<li style=\"\">Our own UI Component Library (Mostly SwiftUI, but still we have some UIKit remaining)</li>\n<li style=\"\">Unit tests, snapshot tests, integration tests, UITests</li>\n<li style=\"\">Swift Package Manager</li>\n<li style=\"\">Kotlin Multiplatform</li>\n</ul>\n<p><strong>Requirements:</strong></p>\n<ul style=\"\">\n<li style=\"\">5+ years’ experience in iOS development Swift.</li>\n<li style=\"\">SwiftUI experience.</li>\n<li style=\"\">Experience working with code sharing, pull requests and code reviews (Git).</li>\n<li style=\"\">Experience working with teams in an agile environment (Jira).</li>\n<li style=\"\">Passion for clean code where re-usability, testability and readability are a must (SOLID).</li>\n<li style=\"\">Experience with the tech stack described above.</li>\n<li style=\"\">A good understanding of software architecture &amp; object-oriented design patterns</li>\n<li style=\"\">Self-motivated, with initiative and enthusiasm, willing to work with a remote team.</li>\n<li style=\"\">Great communication skills in English.</li>\n</ul>\n<p><strong>Nice to have:</strong></p>\n<ul style=\"\">\n<li style=\"\">Experience in CI/CD (CircleCI), Fastlane and static code quality analytics.</li>\n<li style=\"\">Experience in BDD.</li>\n<li style=\"\">Kotlin, including multiplatform, KMM (believe it! — we use it both Android and iOS)</li>\n<li style=\"\">Open source contributions.</li>\n<li style=\"\">Experience with Combine</li>\n<li style=\"\">Experience working with modular architectures</li>\n<li style=\"\">Experience with Swift Package Manager, Carthage, Cocoapods</li>\n<li style=\"\">Shipped successful iOS app(s), ideally still available in the App Store</li>\n</ul>\n<p><strong>Other requirements:</strong></p>\n<ul style=\"\">\n<li style=\"\">A dedicated workspace.</li>\n<li style=\"\">A reliable internet connection with the fastest speed possible in your area.</li>\n<li style=\"\">Devices and other essential equipment that meet minimal technical specifications.</li>\n<li style=\"\">Alignment with Our Values.</li>\n</ul>\n<div class='\"content-conclusion\"'>\n<p><strong>Why work for Xapo?</strong></p>\n<p>IMPACT GLOBALLY, WORK REMOTELY.</p>\n<ul style=\"\">\n<li style=\"\"><strong>Shape the Future:</strong> Improve lives through cutting-edge technology, work 100% remotely from anywhere in the world.</li>\n<li style=\"\"><strong>Great work-life balance:</strong> Build amazing things with a balance of autonomy and collaborative teamwork. Set your own work schedule and make use of a flexible PTO plan when you need to recharge. </li>\n<li style=\"\"><strong>Expect Excellence:</strong> Collaborate, learn, and grow with a high-performance team. Learn how you learn best - from books to conferences, you’ll get a yearly budget for your individual learning and development goals.</li>\n</ul>\n</div>\n<img src=\"https://remotive.com/job/track/1856007/blank.gif?source=public_api\" alt=\"\"/>","tags":"[\"android\",\"backend\",\"git\",\"ios\",\"swift\",\"UI/UX\",\"open source\",\"kotlin\",\"agile\",\"jira\",\"CI/CD\",\"analytics\",\"bitcoin\",\"SOLID\",\"risk management\",\"UIKit\",\"CircleCI\",\"banking\"]","pubDate":"2023-12-05 19:20:23.000","link":"https://remotive.com/remote-jobs/software-dev/senior-ios-developer-1856007","savedDate":"2023-12-08 08:48:04.820","slug":"senior-ios-developer-xapo61-1628"},{"id":7647068481,"title":"Product Owner","company":"Moro Tech","image":"https://remotive.com/job/1851545/logo","description":"<p><strong>Our Company </strong></p>\n<p>Moro Tech is a proud member of Moro Global with presence in Greece, Cyprus, Belgium and Japan, while we continue to transform and grow.</p>\n<p>We support organizations at every step of their business-journey, from planning to execution, by adopting a hands-on approach and providing a powerful mix of business strategy, technical domain expertise and data centric solutions.</p>\n<p>If you are the type of person who is committed to achieving outstanding results, shows up as their whole self and values diversity and inclusion, then be sure to check the job description below ‘cause we are looking forward to meeting you!</p>\n<p> </p>\n<p><strong>The impact of the role:</strong></p>\n<p>This is an amazing opportunity to be part of the future of the automotive industry. Together with your peers you will be defining the future connected services for one of the largest OEMs in the world.</p>\n<p>As our <strong>Product Owner</strong> you will play a pivotal role in defining the product vision, aligning the product roadmap with strategic goals, and ensuring the successful deployment of projects.</p>\n<p> </p>\n<p><strong>On a given day, a Product Owner will:</strong></p>\n<ul style=\"\">\n<li style=\"\">Have the ownership of our projects from ideation, through development, to launch, growth and maintenance.</li>\n<li style=\"\">Engage with a diverse group of stakeholders and clients to define a clear project vision and align it with strategic direction.</li>\n<li style=\"\">Create and maintain a delivery plan, while monitoring progress, deviations and dependencies.</li>\n<li style=\"\">Set success metrics and feature roadmap to align with business goals and drive the roadmap to completion.</li>\n</ul>\n<p><strong>Requirements</strong></p>\n<p><strong>In order to be successful in this role you will need:</strong></p>\n<ul style=\"\">\n<li style=\"\">Minimal 5 years of proven experience working in the product management field.</li>\n<li style=\"\">Excellent communication and problem-solving skills along with the ability to effectively collaborate with cross-functional teams and clients.</li>\n<li style=\"\">Previous experience with project management tools, such as Jira, Confluence, MIRO.</li>\n<li style=\"\">Proficiency in Agile/Scrum/SAFe methodologies.</li>\n<li style=\"\">Any previous experience of working within projects related to smart mobility or smart cities would be greatly appreciated.</li>\n<li style=\"\">We are a multinational company, fluency in English is a must.</li>\n<li style=\"\">We thrive through team collaboration, we are on the lookout for team players.</li>\n<li style=\"\">We encourage everyone to think out of the box; curiosity and willingness to learn new technologies and evolve as an individual and as a team member is highly appreciated.</li>\n</ul>\n<p><strong>Benefits</strong></p>\n<p><strong>Benefits for you:</strong></p>\n<ul style=\"\">\n<li style=\"\">We value each individual's values and unique skill set:\n<ul style=\"\">\n<li style=\"\">We offer a competitive remuneration package for what you bring in!</li>\n<li style=\"\">We have all the right tools in place to enable your growth as our member, with performance feedback, Growth Plans, bi annual Salary Reviews and more!</li>\n</ul>\n</li>\n<li style=\"\">We take care of our people and value work life balance:\n<ul style=\"\">\n<li style=\"\">We offer an advantageous Private Health insurance</li>\n<li style=\"\">We offer extra paid time off per year</li>\n<li style=\"\">We offer monthly Meal Vouchers</li>\n<li style=\"\">We offer flexible working hours</li>\n</ul>\n</li>\n<li style=\"\">We have a people first approach and we are committed to providing our people the tools and power to thrive\n<ul style=\"\">\n<li style=\"\">We offer an annual budget for training activities</li>\n<li style=\"\">We offer Mac equipment</li>\n</ul>\n</li>\n<li style=\"\">We are location fluid with a work from anywhere mentality! Our offices offer a lot of collaboration spaces and is open for all of our Morotechies to come whenever they wish and collaborate in person!</li>\n</ul>\n<p><em>Please note that benefits may vary based on the location.</em></p>\n<p><strong>A glimpse at our principles:</strong></p>\n<p><strong>We move at the speed of culture.</strong> We are technologically and culturally agile, having the mindset -we call it entrepreneurial spirit- to transform, adapt, be flexible, in order to be updated and relevant, always.</p>\n<p><strong>We feel comfortable with the unknown.</strong> We have embraced uncertainty and we feel comfortable with the unknown, as there is no other way to create lasting growth and real impact.</p>\n<p><strong>We act with passion.</strong> We succeed with passion and we fail with passion. Everything we do, our daily tasks, our long-term projects, internally and externally, the way we are chasing our dreams and vision, we do it passionately.</p>\n<p><strong>We enjoy being diverse</strong>. We are committed to fostering an environment where we can celebrate and embrace our diversity and each person's individuality so that people can bring their whole selves to work. A mosaic of personalities, views, perspectives, and crafts, is who we are. We wouldn't have been the same otherwise. So simple.</p>\n<img src=\"https://remotive.com/job/track/1851545/blank.gif?source=public_api\" alt=\"\"/>","tags":"[\"scrum\",\"agile\",\"project management\",\"jira\",\"product management\",\"product owner\",\"diversity\",\"insurance\"]","pubDate":"2023-12-05 17:20:53.000","link":"https://remotive.com/remote-jobs/product/product-owner-1851545","savedDate":"2023-12-08 08:48:04.820","slug":"product-owner-moro-tech-9173"},{"id":2823546169,"title":"QA Specialist","company":"Ancient Gaming","image":"https://remotive.com/job/1852745/logo","description":"<p><strong>🌟 Allow us to introduce ourselves</strong></p>\n<p>Ancient Gaming, an innovative software creator for the future of iGaming, bucks the trend that has lacked innovation for two decades. <strong>We're not trend followers; we're trendsetters. </strong>As iGaming pioneers, we challenge the status quo, crafting not just appealing software but a whole new experience for the younger, high-spending generation seeking to reinvent gaming interactions.</p>\n<p> </p>\n<p>Founded in 2018 in Malta, we've become a global presence with <strong>50+ dedicated team members </strong>spanning <strong>25+ countries</strong>. And yes, we're proudly remote-first!</p>\n<p> </p>\n<p><strong>🚀 Your mission as a QA Specialist!</strong></p>\n<p>As a vital member of our team, you'll meticulously test and assess games, identifying issues and ensuring flawless gameplay. Your expertise will drive the refinement of player experiences and contribute to our commitment to excellence.</p>\n<p> </p>\n<p><strong>What you’ll be doing:</strong></p>\n<ul style=\"\">\n<li style=\"\">\n<p dir=\"ltr\">Review requirements, specifications, and technical design documents to provide timely and meaningful feedback.</p>\n</li>\n<li style=\"\">\n<p dir=\"ltr\">Create detailed, comprehensive, and well-structured test plans and test cases.</p>\n</li>\n<li style=\"\">\n<p dir=\"ltr\">Estimate, prioritise, plan, and coordinate testing activities.</p>\n</li>\n<li style=\"\">\n<p dir=\"ltr\">Identify, record, provide thorough documentation on and track bugs.</p>\n</li>\n<li style=\"\">\n<p dir=\"ltr\">Perform thorough regression testing when bugs are resolved.</p>\n</li>\n<li style=\"\">\n<p dir=\"ltr\">Regular regression testing on the production environment to identify unreported bugs or areas for general quality improvement.</p>\n</li>\n<li style=\"\">\n<p dir=\"ltr\">Liaise with customer support team and directly with customers via community chat portals to review and onboard valuable customer feedback.</p>\n</li>\n<li style=\"\">\n<p dir=\"ltr\">Develop and apply testing processes for new and existing products to meet client needs.</p>\n</li>\n<li style=\"\">\n<p dir=\"ltr\">Liaise with internal teams (e.g. developers and product managers) to identify system requirements.</p>\n</li>\n<li style=\"\">\n<p dir=\"ltr\">Monitor debugging process results.</p>\n</li>\n<li style=\"\">\n<p dir=\"ltr\">Stay up-to-date with new testing tools and test strategies.</p>\n</li>\n</ul>\n<div>\n<p><strong>Examples of projects you’ll be working on:</strong></p>\n<ul style=\"\">\n<li style=\"\"><a href=\"https://www.csgoroll.com/\" rel=\"nofollow\" title=\"https://www.csgoroll.com\">CSGORoll</a>: A community social gaming platform targeted towards CSGO players, featuring unique in-house custom-built games such as Roulette, Crash, Unboxing, and PVP. Users have the capability to bet and win Skins in real time.</li>\n<li style=\"\"><a href=\"https://www.hypedrop.com/\" rel=\"nofollow\" title=\"https://www.hypedrop.com\">HypeDrop</a>: A platform for buying and opening Mystery Boxes in real-time, featuring an unboxing game where people can unbox real-life products and have them shipped to their houses.</li>\n<li style=\"\"><a href=\"https://www.hypeup.com/\" rel=\"nofollow\" title=\"https://www.hypeup.com\">HypeUp</a>: An iGaming brand where users can wager their balance or items from their \"Inventory\" against other people's items, such as watches, electronics, sneakers, and more, and can physically redeem their contents upon withdrawal.</li>\n<li style=\"\">These projects use the same codebase and share libraries of components and modules</li>\n</ul>\n</div>\n<p><strong><strong>You will thrive in this role if you have:</strong></strong></p>\n<ul style=\"\">\n<li style=\"\">\n<p dir=\"ltr\">Minimum 3 years of experience in a similar QA role.</p>\n</li>\n<li style=\"\">\n<p dir=\"ltr\">Proficient understanding of web application functionalities including JavaScript/TypeScript, GraphQL, and WebSockets.</p>\n</li>\n<li style=\"\">\n<p dir=\"ltr\">Demonstrated experience in API testing using tools like GraphQL, Postman, and SoapUI, and creating custom scripts for API testing.</p>\n</li>\n<li style=\"\">\n<p dir=\"ltr\">Experience with SQL databases, including writing complex queries and understanding database schema design.</p>\n</li>\n<li style=\"\">\n<p dir=\"ltr\">Good knowledge of Git.</p>\n</li>\n<li style=\"\">\n<p dir=\"ltr\">Proven experience using issue-tracking platforms like Jira.</p>\n</li>\n<li style=\"\">\n<p dir=\"ltr\">Experience with agile methodology.</p>\n</li>\n<li style=\"\">\n<p dir=\"ltr\">Hands-on experience and knowledge in Smoke testing, Sanity testing, Manual end-to-end testing, and Regression testing.</p>\n</li>\n</ul>\n<div> </div>\n<div><strong><strong>It will be good if you have:</strong></strong></div>\n<ul style=\"\">\n<li style=\"\">\n<p dir=\"ltr\">Experience with performance testing tools like JMeter, LoadRunner, or similar to ensure backend scalability and reliability.</p>\n</li>\n<li style=\"\">\n<p dir=\"ltr\">Experience with server-side rendering frameworks.</p>\n</li>\n<li style=\"\">\n<p dir=\"ltr\">Knowledge of security best practices and experience with security testing.</p>\n</li>\n<li style=\"\">\n<p dir=\"ltr\">A degree in Computer Science, Information Technology, or a related field.</p>\n</li>\n</ul>\n<p><strong><br></strong><strong>What’s in it for you?</strong></p>\n<ul style=\"\">\n<li dir=\"ltr\" style=\"\"><strong>Flexibility Policy</strong> – It's about giving you the freedom to structure your workday in a way that best suits your lifestyle and responsibilities outside of work</li>\n<li dir=\"ltr\" style=\"\"><strong>Work-from-anywhere Policy</strong> – you have the chance to work from anywhere in the world, we are a remote-first company and we are proud of it!</li>\n<li dir=\"ltr\" style=\"\">Every year for our <strong>team-building </strong>we choose a location and go there to celebrate our achievements together</li>\n<li dir=\"ltr\" style=\"\">A<strong> dedicated budget</strong> to purchase all the equipment you need to set up your home office</li>\n<li dir=\"ltr\" style=\"\"><strong>L&amp;D budget</strong> for you to develop your skills!</li>\n<li dir=\"ltr\" style=\"\"><strong>Spill Mental Health Service </strong>– full access to counselling for any employees who need it</li>\n<li dir=\"ltr\" style=\"\">Young, fun, flat structured <strong>rapidly growing</strong> company with endless opportunities to grow</li>\n<li style=\"\">A <strong>diverse portfolio</strong> that includes gamified e-commerce, video game arcade and iGaming</li>\n<li style=\"\">Entirely <strong>modern</strong> stack, <strong>no legacy</strong> code!</li>\n</ul>\n<p> </p>\n<p><em>This post not only outlines our ideal candidate but also serves as an inspiration for what this role can evolve into. Even if you consider yourself an 80% fit but have a genuine passion for this position, we encourage you to apply. We're eager to hear from individuals who share our enthusiasm. </em></p>\n<p><br><em>Ancient Gaming is an equal-opportunity employer. All applicants will be considered for employment without attention to race, color, religion, sex, sexual orientation, gender identity, national origin, veteran or disability status.</em></p>\n<img src=\"https://remotive.com/job/track/1852745/blank.gif?source=public_api\" alt=\"\"/>","tags":"[\"api\",\"backend\",\"git\",\"go\",\"graphql\",\"javascript\",\"security\",\"sql\",\"video\",\"agile\",\"jira\",\"documentation\",\"Typescript \",\"SoapUI\",\"chat\",\"debugging\",\"Postman\",\"JMeter\",\"testing\",\"computer science\",\"information technology\",\"web sockets\",\"workday\",\"mental health\"]","pubDate":"2023-12-05 15:20:09.000","link":"https://remotive.com/remote-jobs/qa/qa-specialist-1852745","savedDate":"2023-12-08 08:48:04.820","slug":"qa-specialist-ancient-gaming-1411"},{"id":5565954525,"title":"Management Accountant","company":"Ancient Gaming","image":"https://remotive.com/job/1852746/logo","description":"<p><strong>🌟 Allow us to introduce ourselves</strong></p>\n<p>Ancient Gaming, an innovative software creator for the future of iGaming, bucks the trend that has lacked innovation for two decades. <strong>We're not trend followers; we're trendsetters. </strong>As iGaming pioneers, we challenge the status quo, crafting not just appealing software but a whole new experience for the younger, high-spending generation seeking to reinvent gaming interactions.</p>\n<p> </p>\n<p>Founded in 2018 in Malta, we've become a global presence with <strong>50+ dedicated team members </strong>spanning <strong>25+ countries</strong>. And yes, we're proudly remote-first!</p>\n<p><strong> </strong></p>\n<p><strong>🚀 Your mission as a Management Accountant!</strong></p>\n<p>As a Management Accountant, you will be upholding our commitment to precision and efficiency in financial management. We have a great passion for building reusable workbooks that speed up our work and we’re looking for super-organized and structure-focused people to join our Financial team!</p>\n<p> </p>\n<p><strong>What you’ll be doing:</strong></p>\n<ul style=\"\">\n<li style=\"\">Preparing and maintaining monthly management accounts.</li>\n<li style=\"\">Handling the year-end process and dealing with feedback sent by auditors.</li>\n<li style=\"\">Working with and supporting the Accounts Payable section to ensure that data is captured in our books correctly at source.</li>\n<li style=\"\">Analysing financial data, and variances to provide insights and recommendations to support informed decision-making.</li>\n<li style=\"\">Preparing Budgets and re-forecasting.</li>\n</ul>\n<div>\n<div>\n<p><strong>You will thrive in this role if you have:</strong></p>\n<ul style=\"\">\n<li style=\"\">Bachelor's degree in Accounting or equivalent field.</li>\n<li style=\"\">At least 3 years of previous experience in an Accountant role.</li>\n<li style=\"\">Advanced knowledge of English Language, both written and spoken.</li>\n<li style=\"\">Advanced proficiency in Microsoft Excel.</li>\n<li style=\"\">Strong analytical skills.</li>\n<li style=\"\">Detail-oriented, organized, and committed approach as well as a strong focus on delivering accurate results.</li>\n</ul>\n<p><strong> It will be a plus if you have:</strong></p>\n<ul style=\"\">\n<li style=\"\">Proficiency in the use of XERO, including generating reports from XERO, uploading bulk uploads, and others.</li>\n</ul>\n<p><strong> </strong></p>\n</div>\n</div>\n<p><strong>What’s in it for you?</strong><strong><br></strong></p>\n<ul style=\"\">\n<li style=\"\">\n<p dir=\"ltr\"><strong>Flexibility Policy</strong> – It's about giving you the freedom to structure your workday in a way that best suits your lifestyle and responsibilities outside of work</p>\n</li>\n<li style=\"\">\n<p dir=\"ltr\"><strong>Work-from-anywhere Policy</strong> – you have the chance to work from anywhere in the world, we are a remote-first company and we are proud of it!</p>\n</li>\n<li style=\"\">\n<p dir=\"ltr\">Every year for our <strong>team-building </strong>we choose a location and go there to celebrate our achievements together</p>\n</li>\n<li style=\"\">\n<p dir=\"ltr\">A<strong> dedicated budget</strong> to purchase all the equipment you need to set up your home office</p>\n</li>\n<li style=\"\">\n<p dir=\"ltr\"><strong>L&amp;D budget</strong> for you to develop your skills!</p>\n</li>\n<li style=\"\">\n<p dir=\"ltr\"><strong>Spill Mental Health Service </strong>– full access to counselling for any employees who need it</p>\n</li>\n<li style=\"\">\n<p dir=\"ltr\">Young, fun, flat structured <strong>rapidly growing</strong> company with endless opportunities to grow</p>\n</li>\n</ul>\n<p> </p>\n<p><em>This post not only outlines our ideal candidate but also serves as an inspiration for what this role can evolve into. Even if you consider yourself an 80% fit but have a genuine passion for this position, we encourage you to apply. We're eager to hear from individuals who share our enthusiasm. </em></p>\n<p><br><em>Ancient Gaming is an equal-opportunity employer. All applicants will be considered for employment without attention to race, color, religion, sex, sexual orientation, gender identity, national origin, veteran or disability status.</em></p>\n<img src=\"https://remotive.com/job/track/1852746/blank.gif?source=public_api\" alt=\"\"/>","tags":"[\"accounting\",\"excel\",\"go\",\"workday\",\"mental health\"]","pubDate":"2023-12-05 09:20:20.000","link":"https://remotive.com/remote-jobs/finance-legal/management-accountant-1852746","savedDate":"2023-12-08 08:48:04.820","slug":"management-accountant-ancient-gaming-8212"},{"id":3207172016,"title":"General Counsel","company":"Flashbots.net","image":"https://remotive.com/job/1854636/logo","description":"<div class=\"h1\">What we're looking for</div>\n<p style=\"min-height: 1.5em;\">Flashbots is seeking a General Counsel who will play a pivotal role in defining our regulatory strategy and shaping the narrative of our organization in a clear and comprehensible manner.</p>\n<p style=\"min-height: 1.5em;\">The General Counsel must be attuned to the unique market structures within the crypto industry, translating regulatory expectations into a system that best suits our unique positioning.</p>\n<p style=\"min-height: 1.5em;\">This role is not just about managing existing legal and compliance matters but also about envisioning a future landscape where Flashbots continues to thrive.<br><br></p>\n<div class=\"h1\">Responsibilities</div>\n<ul style=\"\">\n<li style=\"\">\n<p style=\"min-height: 1.5em;\">Ensuring compliance with relevant laws, regulations, and industry standards.</p>\n</li>\n<li style=\"\">\n<p style=\"min-height: 1.5em;\">Providing legal advice and guidance to the executive team and other departments.</p>\n</li>\n<li style=\"\">\n<p style=\"min-height: 1.5em;\">Drafting, reviewing, and negotiating contracts, agreements, and legal documents.</p>\n</li>\n<li style=\"\">\n<p style=\"min-height: 1.5em;\">Managing and overseeing regulatory filings, licenses, and permits.</p>\n</li>\n<li style=\"\">\n<p style=\"min-height: 1.5em;\">Developing and implementing internal policies and procedures.</p>\n</li>\n<li style=\"\">\n<p style=\"min-height: 1.5em;\">Conducting legal research to stay updated on industry trends and changes in regulations.</p>\n</li>\n<li style=\"\">\n<p style=\"min-height: 1.5em;\">Managing and collaborating with external legal counsel when necessary.</p>\n</li>\n<li style=\"\">\n<p style=\"min-height: 1.5em;\">Assessing and mitigating legal risks and potential liabilities.</p>\n</li>\n<li style=\"\">\n<p style=\"min-height: 1.5em;\">Participating in strategic decision-making and providing guidance on legal matters.<br><br></p>\n</li>\n</ul>\n<div class=\"h1\">Qualifications</div>\n<ul style=\"\">\n<li style=\"\">\n<p style=\"min-height: 1.5em;\">Juris Doctor (J.D.) degree and active membership in the bar association.</p>\n</li>\n<li style=\"\">\n<p style=\"min-height: 1.5em;\">Extensive experience in legal practice, with a focus on regulatory compliance, financial services, or cryptocurrency.</p>\n</li>\n<li style=\"\">\n<p style=\"min-height: 1.5em;\">Strong knowledge of relevant laws and regulations, such as securities, anti-money laundering (AML), know your customer (KYC), and data privacy.</p>\n</li>\n<li style=\"\">\n<p style=\"min-height: 1.5em;\">Experience working in or with the crypto industry, understanding its unique challenges and opportunities.</p>\n</li>\n<li style=\"\">\n<p style=\"min-height: 1.5em;\">Proven track record of successfully managing regulatory issues and compliance programs.</p>\n</li>\n<li style=\"\">\n<p style=\"min-height: 1.5em;\">Excellent drafting, negotiation, and communication skills.</p>\n</li>\n<li style=\"\">\n<p style=\"min-height: 1.5em;\">Ability to collaborate effectively with cross-functional teams and senior executives.<br><br></p>\n</li>\n</ul>\n<div class=\"h1\">Desired traits and skills</div>\n<ul style=\"\">\n<li style=\"\">\n<p style=\"min-height: 1.5em;\">Strong analytical and problem-solving skills.</p>\n</li>\n<li style=\"\">\n<p style=\"min-height: 1.5em;\">Ability to adapt and navigate through a rapidly evolving regulatory landscape.</p>\n</li>\n<li style=\"\">\n<p style=\"min-height: 1.5em;\">High ethical standards and integrity.</p>\n</li>\n<li style=\"\">\n<p style=\"min-height: 1.5em;\">Strong leadership and decision-making abilities.</p>\n</li>\n<li style=\"\">\n<p style=\"min-height: 1.5em;\">Exceptional communication and interpersonal skills.</p>\n</li>\n<li style=\"\">\n<p style=\"min-height: 1.5em;\">Detail-oriented with strong business acumen and strategic thinking.</p>\n</li>\n<li style=\"\">\n<p style=\"min-height: 1.5em;\">Ability to translate complex legal and regulatory language into layman's terms for internal stakeholders.</p>\n</li>\n<li style=\"\">\n<p style=\"min-height: 1.5em;\">A visionary, yet grounded approach to legal matters, with an ability to balance vision with operational considerations.<br><br></p>\n</li>\n</ul>\n<div class=\"h1\">About Flashbots</div>\n<p style=\"min-height: 1.5em;\">Flashbots started in 2020 as a research and development organization formed to mitigate the negative externalities and existential risks posed by Maximal Extractable Value (MEV) to smart-contract blockchains, starting with Ethereum. We build products to maximally decentralize public blockchains, redistribute MEV, and empower users. We work closely with our community to ensure that our products have a positive impact, are secure, and can be used in production at scale.<br><br></p>\n<div class=\"h2\">Our Impact</div>\n<p style=\"min-height: 1.5em;\">Since the launch of Flashbots, we have had an immense impact on the world of cryptocurrency. The Flashbots Auction was launched in alpha in January 2021 and was quickly adopted by almost all Ethereum miners. Prior to Ethereum's Merge in 2022, Flashbots launched MEV-Boost, a temporary solution for out-of-protocol proposer-builder separation. MEV-Boost has since been adopted by over 90% of Ethereum validators and has significantly influenced the Ethereum PoS ecosystem. Now, Flashbots continues its journey with the introduction of MEV-Share as we continue our journey toward SUAVE.<br><br></p>\n<div class=\"h2\">Our Research</div>\n<p style=\"min-height: 1.5em;\">Flashbots Research is an independent arm of the organization that aims to become the hub of MEV research. In addition to conducting in-house analysis, Flashbots Research collaborates with external researchers at other institutions via an external grants program. Flashbots Research continues to publish seminal research on MEV, covering a wide range of topics including cross-chain MEV, EIP1559 and MEV, how ETH2 affects MEV, SGX and privacy, and more. For a full list of publications, visit <a href=\"http://writings.flashbots.net\" rel=\"nofollow\" target=\"_blank\">writings.flashbots.net</a>.<br><br></p>\n<div class=\"h2\">Why Flashbots?</div>\n<ul style=\"\">\n<li style=\"\">\n<p style=\"min-height: 1.5em;\">Competitive salary</p>\n</li>\n<li style=\"\">\n<p style=\"min-height: 1.5em;\">Significantly above market rate equity compensation package</p>\n</li>\n<li style=\"\">\n<p style=\"min-height: 1.5em;\">Unlimited PTO with a high level of freedom and autonomy for your work</p>\n</li>\n<li style=\"\">\n<p style=\"min-height: 1.5em;\">Attractive health cover package for US employees</p>\n</li>\n<li style=\"\">\n<p style=\"min-height: 1.5em;\">Yearly budget for your individual learning and development goals</p>\n</li>\n<li style=\"\">\n<p style=\"min-height: 1.5em;\">Work alongside the brightest minds in the crypto space</p>\n</li>\n<li style=\"\">\n<p style=\"min-height: 1.5em;\">Help build the future of blockchain technology</p>\n</li>\n<li style=\"\">\n<p style=\"min-height: 1.5em;\">Remote working - travel and work from anywhere in the world</p>\n</li>\n<li style=\"\">\n<p style=\"min-height: 1.5em;\">Paid travel - team on-sites in different parts of the world, several times a year</p>\n</li>\n</ul>\n<p style=\"min-height: 1.5em;\">At Flashbots, we are committed to building a diverse and inclusive team. We welcome applications from all qualified candidates regardless of their gender, race, ethnicity, religion, sexual orientation, age, or disability status.</p>\n<img src=\"https://remotive.com/job/track/1854636/blank.gif?source=public_api\" alt=\"\"/>","tags":"[\"crypto\",\"blockchain\",\"research\",\"Ethereum\",\"financial services\",\"travel\"]","pubDate":"2023-12-05 07:20:48.000","link":"https://remotive.com/remote-jobs/finance-legal/general-counsel-1854636","savedDate":"2023-12-08 08:48:04.820","slug":"general-counsel-flashbots-net-7166"},{"id":3162863503,"title":"Software Engineer","company":"IOVLabs","image":"https://remotive.com/job/1855154/logo","description":"<div><strong>About IOV Labs</strong></div>\n<div>IOV Labs is on a mission to provide the next generation of fintech innovators with the decentralized tools and technology to build a new global economy.</div>\n<div>IOV Labs develops, promotes, and supports the RSK Blockchain, a Bitcoin merge-mined smart contract platform – the most secure smart contract platform in the world. IOV Labs also develops the RSK Infrastructure Framework (RIF) to provide our partners with everything they need to build decentralized apps and new Open Finance services on the RSK Blockchain.</div>\n<div>Every day our teams come to work to build a more decentralized world, for a freer and fairer future.</div>\n<div><strong>About the role</strong></div>\n<div>We are looking for a Semi-senior Software Engineer to join our Rollup Squad.</div>\n<div>The candidate will be collaborating to analyze existing open-source solutions, design, implement and maintain protocols and services, reviewing peers’ code, documenting and testing features.</div>\n<div>The candidate is also expected to be involved in improving the squad's work processes, implementing changes to streamline operations, and bringing best practices from his/her experience.  </div>\n<div>Should be open-minded, passionate, analytical, and hard-working; interested in agile and decentralized organizations and enthusiastic about the blockchain ecosystem. As a member of an autonomous squad, the candidate will be encouraged to raise their opinions, to suggest and to help implement changes, be it regarding the projects, methodology, or anything else. </div>\n<div> </div>\n<p><br><br></p>\n<div class=\"h3\">What You'll Be Doing</div>\n<ul style=\"\">\n<li style=\"\">Actively participate during the product design phases, analysing requirements and proposing innovative and alternative solutions.</li>\n</ul>\n<ul style=\"\">\n<li style=\"\">Collaborate on architecture definitions, always thinking of solutions that are scalable and secure.</li>\n</ul>\n<ul style=\"\">\n<li style=\"\">Develop quality code, with emphasis on correctness of implementation.</li>\n</ul>\n<ul style=\"\">\n<li style=\"\">Write and support unit/integration tests</li>\n</ul>\n<ul style=\"\">\n<li style=\"\">Collaborate in the evolutionary maintenance of the product.</li>\n</ul>\n<ul style=\"\">\n<li style=\"\">Conduct independent research in your area of ownership; design, implement, and document solutions.</li>\n</ul>\n<p><br><br></p>\n<div class=\"h3\">What You Bring to the Table</div>\n<ul style=\"\">\n<li style=\"\">Bachelor or advanced student of Computer Science, Computer Engineering or other related degree</li>\n</ul>\n<ul style=\"\">\n<li style=\"\">Strong experience with 3+ years as a Software Engineer.</li>\n</ul>\n<ul style=\"\">\n<li style=\"\">Knowledge about software architecture principles, design patterns, performance, and software engineering best practices.</li>\n</ul>\n<ul style=\"\">\n<li style=\"\">Vast experience in some mainstream language (e.g.:  Javascript, Typescript, Golang, Rust, Java)</li>\n</ul>\n<ul style=\"\">\n<li style=\"\">Keen interest in learning decentralized/distributed technologies and work on all layers of the stack.</li>\n</ul>\n<ul style=\"\">\n<li style=\"\">Motivation to continuously learn from new technologies/languages and work in a fast-paced team with many diverse projects.</li>\n</ul>\n<ul style=\"\">\n<li style=\"\">English language proficiency.</li>\n</ul>\n<ul style=\"\">\n<li style=\"\">Willingness to research emerging solutions</li>\n</ul>\n<div><strong>Bonus points:</strong></div>\n<ul style=\"\">\n<li style=\"\">Experience working with Rust/Go</li>\n</ul>\n<ul style=\"\">\n<li style=\"\">Experience working in blockchain technology projects, smart contract development and/or dApps development.</li>\n</ul>\n<ul style=\"\">\n<li style=\"\">Grasp of the Bitcoin and/or the Ethereum protocol</li>\n</ul>\n<ul style=\"\">\n<li style=\"\">Experience in relational and non-relational databases.</li>\n</ul>\n<ul style=\"\">\n<li style=\"\">Experience with functional programming is a plus.</li>\n</ul>\n<ul style=\"\">\n<li style=\"\">Computer security knowledge.</li>\n</ul>\n<ul style=\"\">\n<li style=\"\">Have experience working for objectives with remote teams.</li>\n</ul>\n<div> </div>\n<p><br><br></p>\n<div class=\"h3\">What You’ll Get Back</div>\n<ul style=\"\">\n<li style=\"\">Competitive salary, annual bonus.</li>\n</ul>\n<ul style=\"\">\n<li style=\"\">100% remote working (External Employee) from anywhere in the world.</li>\n</ul>\n<ul style=\"\">\n<li style=\"\">Global WeWork membership. </li>\n</ul>\n<ul style=\"\">\n<li style=\"\">Flexible working hours – you’re free to work in any way you work the best.</li>\n</ul>\n<ul style=\"\">\n<li style=\"\">Paid leave and national holidays observed. </li>\n</ul>\n<ul style=\"\">\n<li style=\"\">Opportunity to work with state-of-the-art technology through challenging and unique projects.</li>\n</ul>\n<ul style=\"\">\n<li style=\"\">Culturally diverse and dynamic team with a clear vision and strategy. </li>\n</ul>\n<ul style=\"\">\n<li style=\"\">Training programs to learn everything about crypto. </li>\n</ul>\n<ul style=\"\">\n<li style=\"\">Language courses: English, Spanish. </li>\n</ul>\n<ul style=\"\">\n<li style=\"\">Independent employee assistance program offering legal, financial, family, psychological, healthcare, and wellness counseling for you and your family</li>\n</ul>\n<p><br><br></p>\n<div class=\"h3\">IOV Labs Mission, Vision &amp; Purpose</div>\n<ul style=\"\">\n<li style=\"\"><strong>Our purpose is to… </strong>build a more decentralized world, for a freer and fairer future.</li>\n</ul>\n<ul style=\"\">\n<li style=\"\"><strong>Our vision is…</strong> a safe and equitable global financial system that enables everyone to participate and prosper.</li>\n</ul>\n<ul style=\"\">\n<li style=\"\"><strong>We’re on a mission to… </strong>provide the next generation of fintech innovators with the decentralized tools and technology to build a new global economy.</li>\n</ul>\n<div> </div>\n<div><strong>IOV Labs Values</strong></div>\n<div>Our values reflect the fact that we are a global, distributed team who embrace complex and revolutionary decentralized technologies, guided by a strong social purpose.</div>\n<ul style=\"\">\n<li style=\"\">Focus</li>\n</ul>\n<ul style=\"\">\n<li style=\"\">Take Responsibility</li>\n</ul>\n<ul style=\"\">\n<li style=\"\">Make it Useful</li>\n</ul>\n<ul style=\"\">\n<li style=\"\">Stay Open</li>\n</ul>\n<ul style=\"\">\n<li style=\"\">Be Fair</li>\n</ul>\n<div>We are excited to see what you're made of!</div>\n<div> </div>\n<div><em>IOV Labs embraces diversity and is proud to be an equal opportunity employer open to all qualified applicants regardless of race, color, ancestry, religion, sex, national origin, sexual orientation, age, citizenship, marital status, disability, gender identity or expression, Veteran status, or any other legally protected status.</em></div>\n<div> </div>\n<img src=\"https://remotive.com/job/track/1855154/blank.gif?source=public_api\" alt=\"\"/>","tags":"[\"crypto\",\"go\",\"golang\",\"java\",\"javascript\",\"security\",\"blockchain\",\"agile\",\"research\",\"rust\",\"healthcare\",\"Ethereum\",\"Typescript \",\"functional programming\",\"bitcoin\",\"fintech\",\"testing\",\"computer science\",\"infrastructure\",\"diversity\",\"relational databases\"]","pubDate":"2023-12-04 23:20:14.000","link":"https://remotive.com/remote-jobs/software-dev/software-engineer-1855154","savedDate":"2023-12-08 08:48:04.820","slug":"software-engineer-iovlabs-9266"},{"id":7897767518,"title":"Digital Insurance Project Manager (Fully Remote)","company":"CoverGo","image":"https://pbs.twimg.com/profile_images/1382655628523364355/MWPIbbID_400x400.jpg","description":"<p><strong>Top 3 Reasons To Join Us</strong></p><ul> <li>Share Option Plan</li> <li>100% Remote </li> <li>Insurtech industry leader worldwide </li> </ul><p><strong>About Us</strong></p><p>At CoverGo, our mission is to empower all insurance companies to make insurance 100% digital and accessible to everyone.</p><ul> <li>We are a leading global no-code insurance platform for health, life, and P&amp;C</li> <li>We’re the winner of the Insurtech of the Year in all of Asia and other awards globally</li> <li>We work with insurance enterprise clients such as AXA, Bupa, MSIG, Dai-ichi, Bank of China Group Insurance, and many more</li> <li>We're an international, diverse team of over 120 people with 30 nationalities and team members working remotely from all over the world</li> <li>We are fully funded and backed by reputable VC funds and strategic institutional investors</li> <li>We have a global presence in Asia, EMEA and the Americas</li> <li>We’ve grown our annualized revenue by over 30x since January 2021</li> <li>We’re constantly working towards making CoverGo a workplace that you love coming to. We deeply believe that bringing together a diversity of thoughts, expressions, and perspectives is key to building the best culture for equally diverse communities all over the world</li> </ul><p><strong>What You Will Do</strong></p><ul> <li>Engage and manage relationships with clients and stakeholders</li> <li>Leading project planning sessions with internal and client staff</li> <li>Support solution proposals for client pursuits, proposals, and PoCs</li> <li>Participating in proposal and POC processes (i.e. design, submission and review)</li> <li>Support the creation of contracts and related communication with clients</li> <li>Identifying and helping secure growth opportunities for existing clients</li> <li>Managing project progress and adapting work as required</li> <li>Ensuring projects meet deadlines</li> <li>Managing relationships with clients and stakeholders</li> <li>Lead the team to reach objectives and manage resources in an Agile way (Scrum \\ Kanban) using backlogs, planning, retrospectives</li> <li>Regular/weekly project review and creating reports with key metrics about team and project status using company standard metrics</li> <li>Overseeing all incoming and outgoing project documentation</li> <li>Identify and manage issues, risks, assumptions, and dependencies</li> <li>Continuously optimize and improve processes and the overall approach where necessary</li> </ul><p><strong>What We Need</strong></p><ul> <li>Bachelor's degree in computer science or a related technical field is a plus</li> <li>5+ years experience as a Project Manager</li> <li>Insurance domain knowledge in general is an advantage</li> <li>Strong Client facing experience is a plus</li> <li>Technical skills is a plus</li> <li>Experience seeing projects through the full life cycle</li> <li>Excellent analytical skills and problem-solving skills</li> <li>Strong interpersonal skills and extremely resourceful</li> <li>Proven ability to complete projects according to outlined scope, budget, and timeline</li> <li>Self-motivated and able to work independently</li> <li>Able, willing and excited to work in a fast-paced collaborative startup environment</li> </ul><p><a href=\"https://www.youtube.com/watch?v=YI0ezLxvFvA\" rel=\"nofollow noreferrer noopener\" class=\"external\"></a><strong>Why You'll Love Working Here</strong></p><ul> <li>Fully Remote</li> <li>Flexible Leave</li> <li>International Environment</li> <li>Competitive renumeration package</li> <li>Performance Bonus</li> <li>Stock Options after 6 months </li> <li>Company activities and events</li> <li>Learning and development plan</li> </ul><p><strong>CoverGo Company </strong><a href=\"https://www.youtube.com/watch?v=YI0ezLxvFvA\" rel=\"nofollow noreferrer noopener\" class=\"external\"><strong>Video</strong></a></p><p>By submitting your application, you confirm that you have read, understood, and accepted the content of CoverGo’s <a href=\"https://apply.workable.com/covergo/gdpr_policy?lng=en\" target=\"_blank\" rel=\"nofollow noreferrer noopener\" class=\"external\">Privacy Notice</a> and you consent to the processing of your data as part of this application.</p><p><a href=\"https://www.youtube.com/watch?v=YI0ezLxvFvA\" rel=\"nofollow noreferrer noopener\" class=\"external\"></a></p><h3>Requirements: </h3><h3>Benefits: </h3>","tags":"[]","pubDate":"2023-11-22 00:00:00.000","link":"https://apply.workable.com/covergo/j/D7F47EBF79","savedDate":"2023-12-08 08:48:04.821","slug":"digital-insurance-project-manager-fully-remote-covergo-338"}]