[{"id":6776660440,"title":"Technical Advisor, Digital [IC2]","company":"Sourcegraph","image":"https://pbs.twimg.com/profile_images/1428393724527190022/4mt5PACL_400x400.png","description":"\n    <div class=\"content-intro\"><h3>ALL SOURCEGRAPH ROLES ARE FULLY REMOTE</h3>\n<h2><span style=\"color: #a112ff;\">Who we are</span></h2>\n<p>Our mission at Sourcegraph is to make it so that&nbsp;<a class=\"c-link\" href=\"https://handbook.sourcegraph.com/strategy-goals/strategy\" target=\"_blank\" data-stringify-link=\"https://handbook.sourcegraph.com/strategy-goals/strategy\" data-sk=\"tooltip_parent\">everyone can code</a>, not just ~0.1% of the population. Our code graph powers Cody, the most powerful and accurate AI coding assistant, as well as our Code Search product, which helps devs explore their entire codebase and make large-scale migrations and security fixes. We’re building software that builds software, and in doing so we’re making devs more productive and preparing for a world where a lot more code gets written.</p>\n<p>It’s an exciting time to join Sourcegraph. AI has taken over the world, and we’ve spent the last 10 years building infrastructure that’s integral to making AI generated code more powerful and accurate. Our customers include 4/5 FAANG companies, 4 of the top 10 banks, government organizations, Uber, Plaid, and many other companies building the software that pushes the world forward. We’ve raised $225M at a $2.625B valuation from <a class=\"c-link\" href=\"https://techcrunch.com/2021/07/13/sourcegraph-raises-125m-series-d-on-2-6b-valuation-for-universal-code-search-tool/\" target=\"_blank\" data-stringify-link=\"https://techcrunch.com/2021/07/13/sourcegraph-raises-125m-series-d-on-2-6b-valuation-for-universal-code-search-tool/\" data-sk=\"tooltip_parent\">Andreessen Horowitz</a>,&nbsp;<a class=\"c-link\" href=\"https://about.sourcegraph.com/blog/series-c-with-sequoia/\" target=\"_blank\" data-stringify-link=\"https://about.sourcegraph.com/blog/series-c-with-sequoia/\" data-sk=\"tooltip_parent\">Sequoia</a>,&nbsp;<a class=\"c-link\" href=\"https://www.redpoint.com/companies/sourcegraph/\" target=\"_blank\" data-stringify-link=\"https://www.redpoint.com/companies/sourcegraph/\" data-sk=\"tooltip_parent\">Redpoint</a>,&nbsp;<a class=\"c-link\" href=\"https://medium.com/craft-ventures/why-we-invested-in-sourcegraph-5ace28317e3d\" target=\"_blank\" data-stringify-link=\"https://medium.com/craft-ventures/why-we-invested-in-sourcegraph-5ace28317e3d\" data-sk=\"tooltip_parent\">Craft</a>&nbsp;and others. We’re making ambitious bets on our future and we’re looking to hire exceptional people to join our team as we make Sourcegraph one of the biggest and most influential companies in the world.</p></div>\n\n    <h2><span style=\"color: rgb(140, 51, 236);\"><strong>Working hours</strong></span></h2>\n<p>🌎 Given that we are an all-remote company and hire <a href=\"https://handbook.sourcegraph.com/departments/people-ops/process/how-we-engage-talent-outside-the-us/\">almost anywhere</a> in the world, we don’t have a location requirement for this role. However, your working hours must overlap with PST for at least 30 hours/week.</p>\n<h2><span style=\"color: rgb(140, 51, 236);\"><strong>Why this job is exciting</strong></span></h2>\n<p>You will help establish the newly formed Digital Success team at Sourcegraph. As a Digital Technical Advisor, you will provide non-dedicated, on-demand coverage across a large set of our innovative customers. You’ll build and manage tech-nurtured campaigns to reach our customers and developers. You’ll ensure the customers' developers love our platform, remain happy customers, and grow month after month. You'll also help our customers solve technical problems while driving key metrics like adoption, usage and consumption.</p>\n<p>Within one month, you will…</p>\n<ul>\n<li>Start building a trusting relationship with your partners across Technical Advisory (post-sales), Customer Engineering (pre-sales), Implementation Engineering, Sales, and Support Engineering teams.</li>\n<li>Learn about our product, our value proposition, our customers, our team, and our processes.</li>\n<li>Join or review customer and prospect calls to understand their challenges and needs.</li>\n<li>Help define and build across the Digital Success customer journey.</li>\n<li>Have built an on-demand and on-rotation coverage plan process for Digital Success customers to review common success plans and goals.</li>\n</ul>\n<p>Within three months, you will…</p>\n<ul>\n<li>Be assigned your first customers with whom you’ll begin to define common success plans and goals to be worked on and reviewed frequently.</li>\n<li>Ensure your customers derive maximum value from their investment in Sourcegraph; develop account success plans based on insights and needs where necessary.</li>\n<li>Execute current processes and playbooks that provide value to our customers and ensure long-term growth beyond just your assigned customers.</li>\n<li>Provide recommendations based on the customer's infrastructure and use cases, and provide feedback to internal teams as your customer's voice.</li>\n</ul>\n<p>Within six months, you will…</p>\n<ul>\n<li>Drive your customers' success, including their onboarding experience, ongoing feature adoption, renewal, and expansion through a digitally nurtured program.</li>\n<li>Conduct streamlined onboarding processes, product enablement and customer success plans on an ongoing basis.</li>\n<li>Translate customer sentiment to internal teams by logging product gaps and providing supporting evidence that helps product teams prioritize our roadmap. Be the voice of the customer.</li>\n<li>Help solve technical problems with and for our customers.</li>\n<li>Flag potential opportunities for expansion and up-sell across your book of business to our Sales counterparts so they can pursue account growth and increased solution footprint.</li>\n</ul>\n<h2><span style=\"color: rgb(140, 51, 236);\"><strong>About you</strong></span></h2>\n<p>You are an enthusiastic, self-driven, and results-oriented post-sales specialist who shares <a href=\"https://handbook.sourcegraph.com/company-info-and-process/values/\">our values</a> and is passionate about nurturing healthy customers in Digital Success teams.</p>\n<p>Your skill set:</p>\n<ul>\n<li>You have 1+ years of experience working in teams that provide customer post-sales coverage and support on an on-demand and on-rotation basis. Having experience with automation tools and AI for customer management is a plus.</li>\n<li>You are proactive. You can collaborate with multiple stakeholders to identify opportunities, address complex political situations, and support customers throughout.</li>\n<li>You are exceptionally organized and have strong project management skills. You are a strong adopter of tools and standardized processes to document customer conversation goals and project customer health scores across your entire book of business. You can prioritize effectively and can set and deliver on expectations.</li>\n<li>You are naturally curious and seek to learn about product features and their benefits. You provide recommendations based on stated customer needs and use cases. You engage customers on relevant betas, updates, and educational material, as applicable.</li>\n<li>You are a team player who can proactively contribute to a positive environment that values people and work, openly share problems and successes, and work across teams to help refine processes and achieve goals. You can take responsibility for your actions and recognize mistakes as learning opportunities.</li>\n<li>You are knowledgeable in the technical topics our customers deal with daily (migrations, code refactors, developer onboarding, etc.) and have the ability to partner with them on technical solutions both using and extending the Sourcegraph product. You use your technical skills to solve problems.</li>\n<li>You actively listen, synthesize information, communicate effectively, and present with confidence and customer empathy to various stakeholders (end-user devs to C-level stakeholders) and internal teams.</li>\n</ul>\n<h2><span style=\"color: rgb(140, 51, 236);\"><strong>Level</strong></span></h2>\n<p>📊 This job is an IC2.&nbsp; You can read more about <a href=\"https://handbook.sourcegraph.com/benefits-pay-perks/pay-expenses/compensation/leveling-guide/\">our job leveling philosophy</a> in our Handbook.</p>\n<h2><span style=\"color: rgb(140, 51, 236);\"><strong>Compensation</strong></span></h2>\n<p><strong>💸 We pay you an above-average salary</strong> because we want to hire the best people who are fully focused on helping Sourcegraph succeed, not worried about paying bills. You will have the flexibility to work and live anywhere in the world<em> (unless specified otherwise in the job description)</em>, and we’ll never take your location or current/past salary information into account when determining your compensation.&nbsp; As an <a href=\"https://handbook.sourcegraph.com/company-info-and-process/values/#sts=Open%20and%20transparent\">open and transparent </a>company that values equitable and competitive compensation for everyone, our <a href=\"https://handbook.sourcegraph.com/benefits-pay-perks/pay-expenses/compensation/\">compensation ranges are visible</a> to every single Sourcegraph Teammate. To determine your salary, we use a number of market and data-driven salary sources and target the high-end of the range, ensuring that we’re always paying above market regardless of where you live in the world.&nbsp;&nbsp;</p>\n<p>💰 The target compensation for this role is $120,800 USD base + $30,200 USD variable ($151,000 USD on-target-earnings).</p>\n<p>📈 In addition to our cash compensation, we offer equity (because when we succeed as a company, we want you to succeed, too) and generous <a href=\"https://handbook.sourcegraph.com/benefits-pay-perks/benefits-perks/\">perks &amp; benefits</a>.</p>\n<h2><span style=\"color: rgb(140, 51, 236);\"><strong>Interview process</strong></span></h2>\n<p><em>Below is the interview process you can expect for this role (you can read more about </em><a href=\"https://handbook.sourcegraph.com/talent/types_of_interviews\"><em>the types of interviews</em></a><em> in our Handbook). It may look like a lot of steps, but rest assured that we move quickly and the steps are designed to help you get the information needed to determine if we’re the right fit for you… Interviewing is a two-way street, after all!&nbsp;</em></p>\n<p>We expect the interview process to take ___ hours in total. [Note- this should not exceed 5.5 hours!]<br><br></p>\n<p><strong>👋 Introduction Stage</strong> - we have initial conversations to get to know you better…</p>\n<ul>\n<li>[30m]&nbsp;<a href=\"https://handbook.sourcegraph.com/departments/people-talent/talent/process/types_of_interviews/#recruiter-screen\">Recruiter Screen</a> - Kelsey Nagel</li>\n<li>[30m]&nbsp;<a href=\"https://handbook.sourcegraph.com/departments/people-talent/talent/process/types_of_interviews/#hiring-manager-screen\">Hiring Manager Screen</a> - Aimee Menne</li>\n<li>Take-home assignment prep work sent</li>\n</ul>\n<p><strong>🧑‍💻 Team Interview Stage</strong> - we then delve into your experience in more depth and introduce you to members of the team, including cross-functional partners…</p>\n<ul>\n<li>[45m] Assignment Review / Peer Interview</li>\n<li>[30m] Cross-team Collaboartion&nbsp;</li>\n<li>[60m]&nbsp;<a href=\"https://handbook.sourcegraph.com/departments/people-talent/talent/process/types_of_interviews/#resume-deep-dive\">Resume Deep Dive</a> - Aimee Menne</li>\n</ul>\n<p><strong>🎉 Final Interview Stage </strong>- we move you to our final round, where you gain a better understanding of our business and values holistically…</p>\n<ul>\n<li>[30m] <a href=\"https://handbook.sourcegraph.com/departments/people-talent/talent/process/types_of_interviews/#values-interview\">Values Interview</a></li>\n<li>[Time] <a href=\"https://handbook.sourcegraph.com/departments/people-talent/talent/process/types_of_interviews/#leadership-interview\">Leadership Interview</a> with co-founder&nbsp;</li>\n<li>We check references and conduct your background check</li>\n</ul>\n<p>Please note - you are welcome to request additional conversations with anyone you would like to meet, but didn’t get to meet during the interview process.</p>\n\n    \n\n    <div class=\"content-conclusion\"><h2><span style=\"color: #a112ff;\">Not sure if this is you?</span></h2>\n<p><span style=\"font-weight: 400;\">We want a diverse, global team, with a broad range of experience and perspectives. If this job sounds great, but you’re not sure if you qualify, apply anyway! We carefully consider every application, and will either move forward with you, find another team that might be a better fit, keep in touch for future opportunities, or thank you for your time.</span></p>\n<h2><span style=\"color: #a112ff;\">Learn more about us</span></h2>\n<p><span style=\"font-weight: 400;\">To create a product that serves the needs of all developers, we are building a diverse </span><a href=\"https://handbook.sourcegraph.com/company-info-and-process/remote\"><span style=\"font-weight: 400;\">all-remote team</span></a><span style=\"font-weight: 400;\"> that is </span><a href=\"https://handbook.sourcegraph.com/team\"><span style=\"font-weight: 400;\">distributed across the world</span></a><span style=\"font-weight: 400;\">. Sourcegraph is an equal opportunity workplace; we welcome people from all backgrounds and communities.&nbsp;</span></p>\n<p><span style=\"font-weight: 400;\">We provide </span><a href=\"https://about.sourcegraph.com/handbook/people-ops/compensation\"><span style=\"font-weight: 400;\">competitive compensation</span></a><span style=\"font-weight: 400;\"> and </span><a href=\"https://about.sourcegraph.com/handbook/people-ops/benefits-and-perks\"><span style=\"font-weight: 400;\">practical benefits</span></a><span style=\"font-weight: 400;\"> to keep you happy and healthy so that you can do your best work.&nbsp;</span><span style=\"font-weight: 400;\">&nbsp;</span></p>\n<p><span style=\"font-weight: 400;\">Learn more about what it is like to work at Sourcegraph by reading </span><a href=\"https://about.sourcegraph.com/handbook/\"><span style=\"font-weight: 400;\">our handbook</span></a><span style=\"font-weight: 400;\">.</span></p>\n<p><span style=\"font-weight: 400;\">We want to ensure Sourcegraph is an environment that suits your working style and empowers you to do your best work, so we are eager to answer any questions that you have about us at any point in the interview process.</span></p>\n<p><span style=\"font-weight: 400;\">Go back to the </span><a href=\"https://about.sourcegraph.com/jobs/\"><span style=\"font-weight: 400;\">careers page</span></a><span style=\"font-weight: 400;\"> for all open positions.</span></p>\n<p>&nbsp;</p>\n<p><em><span style=\"font-weight: 400;\">Sourcegraph participates in <a href=\"https://handbook.sourcegraph.com/departments/people-talent/e-verify/\" target=\"_blank\">E-Verify</a> for U.S. Employees</span></em></p></div>\n","tags":"[\"management\",\"engineering\"]","pubDate":"2024-02-17 07:04:00.945","link":"https://boards.greenhouse.io/sourcegraph91/jobs/5084318004","savedDate":"2024-02-17 07:04:00.945","slug":"technical-advisor-digital-ic2-sourcegraph-7705"},{"id":5953832593,"title":"Customer Care Specialist (Americas)","company":"SafetyWing","image":"https://pbs.twimg.com/profile_images/1177267684574208000/54eG3WmW_400x400.jpg","description":"<h2>🧘 What we offer</h2> <div><!--block-->We operate in a fully remote work environment – work from anywhere globally.&nbsp;<br>This is a part-time opportunity (up to 20 hours per week) for a long-term contract (can transfer to full-time).<br><br>You will receive an hourly salary compensation and 20 days off per year. In addition, if you join our team for more than 30 hours per week, you will get health and travel insurance.<br>As your journey continues with us, after six months, you can also benefit from a personal development budget and office stipend.<br><br>We are looking forward to hearing from you!</div> <div><!--block--><strong>SafetyWing</strong> (YC W18) is seeking a Customer Care Specialist interested in building a global safety net with us.</div><div><!--block--><br><strong><br>🚀 About SafetyWing<br></strong><br></div><div><!--block-->Our top priority is to help our customers find solutions that help them get what they want and need. Within the boundaries of honesty and effective communication, we aim to have conversations that make our customers not only happy supporters of SafetyWing but happy in general.<br><br></div><div><!--block-->We are headquartered in San Francisco, while our international team is fully distributed, stretching ten time zones. We are on a mission to remove the role of geographical borders as a barrier to equal opportunities and freedom for everyone. And we are doing that by creating simple health insurance and retirement products for remote workers worldwide as a replacement for national welfare systems.<br><br></div><div><!--block-->We provide 24/7 support to our members and work with a ‘follow the sun’ model. That means we don’t do night shifts or very early mornings. While we work location independently, we do have a friendly and helpful global team, and we’re also definitely working for someone who is a joy to work with. &nbsp;<br><br>Below are some of the principles we live by:</div><ul><li><!--block-->Be honest</li><li><!--block-->Help the customer</li><li><!--block-->Be clear and concise</li><li><!--block-->Be kind and make the customer happy</li></ul><div><!--block--><strong><br>👩‍💻 The position<br></strong><br></div><div><!--block-->We are looking for a Customer Care Specialist (part-time, up to 20 hours /week with the option of going full-time)&nbsp; to join our fully remote team. We love to be helpful and guide our customers with any problem, big or small.</div><div><!--block-->Currently, we have two products: Travel Medical Insurance and Health Insurance (for companies and individuals).</div> <h2>💻 Your responsibilities will include</h2>  <ul><li><!--block-->Answer customer questions via live chat, email and phone support</li><li><!--block-->Proactively look at how to improve the customer experience</li></ul><div><!--block--><strong>🧪 What’s needed for this position:</strong></div><ul><li><!--block-->Excellent English language skills (written and spoken)</li><li><!--block-->The ability to work independently and to be a problem solver</li><li><!--block-->Weekend availability (we have shifts)</li><li><!--block-->Extra shine if you have experience with insurance, customer service or healthcare.</li><li><!--block--><strong>You are comfortable working within the American, Central, and Eastern South American time zones.</strong></li></ul> <h2>🧪 We like to work with people who:</h2> <ul><li><!--block-->Want to help build a global social safety net on the Internet.</li><li><!--block-->Think for themselves instead of copying others.</li><li><!--block-->Are willing to try new things, even with the risk of failure.</li><li><!--block-->Are intellectually curious and open to new ideas.</li><li><!--block-->Are creative and bold in the face of any problems.</li><li><!--block-->Have strong integrity and do the right thing.</li></ul>","tags":"[]","pubDate":"2024-02-17 07:04:00.943","link":"https://safetywing.pinpointhq.com/en/jobs/174184","savedDate":"2024-02-17 07:04:00.943","slug":"customer-care-specialist-americas-safetywing-1129"},{"id":4632855210,"title":"Content and Sponsorships Coordinator","company":"SafetyWing","image":"https://pbs.twimg.com/profile_images/1177267684574208000/54eG3WmW_400x400.jpg","description":"<h2>🧘 What we offer</h2> <ul><li><!--block-->Fully remote work environment – work from anywhere globally.&nbsp;</li><li><!--block-->Competitive compensation.</li><li><!--block-->Global coverage with Remote Health and Nomad Insurance.</li><li><!--block-->A minimum of 20 days of compensated time off each year.</li><li><!--block-->Referral bonus - an incentive program rewarding you for helping us find exceptional talent to join our team.</li><li><!--block-->Opportunity to unlock more benefits as your tenure with SafetyWing grows.</li></ul><div><!--block-->We are looking forward to hearing from you!</div><div><!--block--><br></div> <div><!--block--><strong>SafetyWing</strong> (YC W18) is seeking a <strong>Content and Sponsorships Coordinator</strong> to support our growing Partnerships team and our network of Ambassadors with care and personalized attention as we scale the program. You'll play a pivotal role in this growth, leveraging your creativity and strategic insight to craft compelling briefs, messages, and content. Your work will promote SafetyWing's innovative products, mission, and vision and empower our Ambassadors to create authentic, impactful projects that resonate with our brand's integrity.</div><div><!--block--><br></div><div><!--block-->Our influencer program (the ambassador program) was created in-house and designed according to our unique values of authenticity and simplicity. As a result, it became the most strategic growth channel for Nomad Insurance, accounting for more than 35% of sales.</div> <h2>💻 Your responsibilities will include</h2>  <ul><li><!--block-->Setting up a process for sponsorship, including the selection of Ambassadors and topics most efficient for a paid collaboration, reviewing submissions, monitoring deadlines, reviewing content to ensure compliance and brand integrity, and reviewing performance (return on investment);</li><li><!--block-->creating briefs for sponsored content creators and educating them through 1:1 calls and e-mails;</li><li><!--block-->writing content that will be featured through our collaboration with ambassadors, such as copies for social media campaigns, articles for external blogs, webinar decks, etc.;</li><li><!--block-->coordinating payments for sponsored ambassadors;</li><li><!--block-->Monitoring external content to ensure that SafetyWing is promoted in a way that is true to our product features and mission;</li><li><!--block-->receiving inbound requests for sponsorships and reaching out to high-potential influencers regarding their options for sponsorships;</li><li><!--block-->Helping in finding creative ways to scale the acquisition of quality ambassadors for SafetyWing.</li></ul> <h2>🧪 We are looking for someone who</h2> <ul><li><!--block-->Has experience and a strong interest in developing in the affiliate marketing/partnerships field.</li><li><!--block-->Has hands-on experience working with content creators.</li><li><!--block-->Can craft compelling content for various platforms, including social media, blogs, and webinars.</li><li><!--block-->Enjoys managing projects from inception to completion, including setting up processes, monitoring deadlines, and coordinating payments.</li><li><!--block-->Has the ability to review performance metrics (ROI) of sponsorships and content to guide strategic decisions.</li><li><!--block-->Is experienced in handling inbound requests and conducting outreach to potential influencers.</li><li><!--block-->Can maintain brand integrity across all content and partnerships, with a keen eye for detail in reviewing submissions for compliance.</li><li><!--block-->Has excellent written and verbal communication skills to educate and guide ambassadors and collaborate with team members effectively.</li></ul><div><!--block--><br></div><div><!--block--><strong>😀 We like to work with people who:</strong></div><ul><li><!--block-->Want to help build a global social safety net on the Internet.</li><li><!--block-->Think for themselves instead of copying others.</li><li><!--block-->Are willing to try new things, even with the risk of failure.</li><li><!--block-->Are intellectually curious and open to new ideas.</li><li><!--block-->Are creative and bold in the face of any problems.</li><li><!--block-->Have strong integrity and do the right thing.</li></ul>","tags":"[]","pubDate":"2024-02-17 07:04:00.942","link":"https://safetywing.pinpointhq.com/en/jobs/172165","savedDate":"2024-02-17 07:04:00.942","slug":"content-and-sponsorships-coordinator-safetywing-4566"},{"id":5922933532,"title":"Claims Experience Lead","company":"SafetyWing","image":"https://pbs.twimg.com/profile_images/1177267684574208000/54eG3WmW_400x400.jpg","description":"<h2>🧘 What we offer</h2> <ul><li><!--block-->Fully remote work environment – work from anywhere globally.&nbsp;</li><li><!--block-->Competitive compensation.</li><li><!--block-->Global coverage with Remote Health and Nomad Insurance.</li><li><!--block-->A minimum of 20 days of compensated time off each year.</li><li><!--block-->Referral bonus - an incentive program rewarding you for helping us find exceptional talent to join our team.</li><li><!--block-->Opportunity to unlock more benefits as your tenure with SafetyWing grows.</li></ul><div><!--block-->We are looking forward to hearing from you!</div> <div><!--block--><strong>SafetyWing</strong> (YC W18) is looking for a <strong>Claims Experience Lead</strong> to drive the way in changing how our members go through the claims process. Your mission would be to ensure that SafetyWing delivers the best claims experiences globally.</div><div><!--block--><br></div> <h2>💻 Your responsibilities will include</h2>  <ul><li><!--block-->Streamline our claims handling to be fast, straightforward, and empathetic.</li><li><!--block-->Lead our Claims team, ensuring they are joyful and productive and we have enough people to assist with incoming requests.</li><li><!--block-->Step in on complex cases with a mix of operational know-how and genuine care, ensuring every member feels valued.</li><li><!--block-->Collaborate with tech teams and the Insurance Operations Manager to innovate and improve our processes, making claims handling smoother and smarter.</li><li><!--block-->Partner with Claims QA to audit and review the performance of our teams and partners.</li><li><!--block-->Develop and lead training and knowledge sharing that empowers your team to build operational excellence and be great at what they do, from talking to members to handling the details of their claims.</li><li><!--block-->Use data and insights to tell the story of how we're doing, where we can improve, and celebrate our wins.</li></ul><div><!--block--><br></div> <h2>🧪 We are looking for someone who</h2> <ul><li><!--block-->Has a solid background in leading, inspiring, and guiding teams.</li><li><!--block-->Has a genuine talent for empathising with customers – we consider this crucial.</li><li><!--block-->Has solid experience in managing and resolving customer claims with care and efficiency.</li><li><!--block-->Has strong skills in strategic planning and is capable of analyzing data.</li><li><!--block-->Excels at building and maintaining collaborative relationships with external partners, broadening our capabilities and impact.</li><li><!--block-->Uses creative thinking to solve complex issues, turning challenges into opportunities for improvement.</li><li><!--block-->Extra shine if you have a background in customer service or claims handling within the insurance or highly regulated industry.</li></ul><div><!--block--><strong>😀 We like to work with people who:</strong></div><ul><li><!--block-->Want to help build a global social safety net on the Internet.</li><li><!--block-->Think for themselves instead of copying others.</li><li><!--block-->Are willing to try new things, even with the risk of failure.</li><li><!--block-->Are intellectually curious and open to new ideas.</li><li><!--block-->Are creative and bold in the face of any problems.</li><li><!--block-->Have strong integrity and do the right thing.</li></ul>","tags":"[]","pubDate":"2024-02-17 07:04:00.942","link":"https://safetywing.pinpointhq.com/en/jobs/173816","savedDate":"2024-02-17 07:04:00.942","slug":"claims-experience-lead-safetywing-9400"},{"id":3526414762,"title":"Product Designer","company":"SafetyWing","image":"https://pbs.twimg.com/profile_images/1177267684574208000/54eG3WmW_400x400.jpg","description":"<h2>🧘 What we offer:</h2> <div><!--block-->We operate in a fully remote work environment – work from anywhere globally.&nbsp;<br><br>You will receive salary and equity compensation, health insurance, a laptop, a minimum of four weeks of yearly vacation, a personal development budget, attendance of professional conferences and more.&nbsp;<br><br>We have a minimum of two annual team gatherings where you will join us. The previous gatherings were in Ljubljana, San Francisco, Mexico, Bali and Siglufjörður.<br><br>We are looking forward to hearing from you!</div> <div><!--block-->As the<strong> Product Designer </strong>at <a href=\"https://safetywing.com/\"><strong>SafetyWing</strong></a>,<strong> </strong>you will drive the design and development of our products, particularly within the insurance-tech industry for B2B. Your role extends beyond crafting exceptional designs; it's about adding depth and meaning to our projects while maintaining our core values.&nbsp;</div> <h2>👨‍🎤 As our Product Designer, you will:</h2>  <ul><li><!--block-->Lead product design initiatives from conception to final execution.</li><li><!--block-->Drive continuous improvements in our design processes, proposing strategies to elevate the quality of outputs.</li><li><!--block-->Ensure consistency in design outputs by collaborating closely with product managers, other designers and engineers.</li><li><!--block-->Drive the evolution and adherence to SafetyWing's design system.</li><li><!--block-->Present product design ideas to cross-functional teams and senior leadership.</li></ul> <h2>🧪 We are looking for someone who:</h2> <ul><li><!--block-->Has advanced product design experience demonstrated through a portfolio of impactful design solutions.</li><li><!--block-->Has experience designing user experiences within insurance, finance or B2B space sectors.</li><li><!--block-->Is proficient in using design and prototyping tools such as Figma and is committed to continuous learning of new features.</li><li><!--block-->Has experience conducting user research and usability testing</li><li><!--block-->Can communicate design ideas clearly and champion design principles across diverse audiences, including design and non-design stakeholders.</li><li><!--block-->Can think beyond the immediate design task and understand the bigger business and product strategy.</li><li><!--block-->Is comfortable with ambiguity</li><li><!--block-->Has a strong sense of empathy for both the user and team members</li><li><!--block-->Interested in helping build a global social safety net</li><li><!--block-->Thinks for themselves instead of copying others</li><li><!--block-->Is creative and bold in the face of any problem</li><li><!--block-->Intellectually honest and has high integrity</li><li><!--block-->While not mandatory, experience working in globally distributed and remote teams in a start-up environment would be a bonus.</li></ul>","tags":"[\"Finance\",\"B2B\"]","pubDate":"2024-02-17 07:04:00.942","link":"https://safetywing.pinpointhq.com/en/jobs/174183","savedDate":"2024-02-17 07:04:00.942","slug":"product-designer-safetywing-4139"},{"id":6943856060,"title":"Senior Full-stack Engineer (Special Projects)","company":"Circle","image":"https://lever-client-logos.s3.us-west-2.amazonaws.com/3b00b20d-12c8-4ed9-ae9e-97d8601567b2-1706111761671.png","description":"<div><b style=\"font-size: 18px\">About Us</b></div><div>Circle is building the world’s leading all-in-one platform for online communities. We make it possible for creators, coaches, educators, and businesses to bring together their audience with engaging discussions, live streams, events, chat, courses, and payments — all in one place, all under their own brand.</div><div><br></div><div>We’re proud to be a fully remote company of around 130 (and growing!) team members from 30+ countries around the world. We strive to find exceptional talent, empower them to do their best work, and in turn, have a meaningful impact in their own lives. We don’t track hours, but we manage for outcomes in an a-synchronous culture.</div><div><br></div><div>Twice a year, we bring the whole company together for incredible company retreats in beautiful places around the world!</div><div><br></div><div><b><span style=\"font-size: 18px\">About the role</span></b></div><div>We're looking for a Senior Full-stack Engineer to join the Special Projects team as we aim to make Circle the top choice for creator/brand-led communities. You’ll be working on internal tools used by everyone at Circle, cutting-edge AI features, and new customer-facing features used by millions.</div><div><br></div><div>In this role, you will collaborate with our leaders, designers, and other engineers and participate in all stages of the development lifecycle, from initial task definition to final deployment. As a senior engineer, you'll break down large epics into actionable tasks, follow through with development and testing, review PRs, push updates to production, and gradually release behind feature flags. Your responsibilities will also include bug-fixing and continuous improvement of the codebase. This role requires a high level of technical proficiency and a strong understanding of software development best practices.</div><div><br></div><div><b>We have a strong preference for someone working out of EMEA (Europe, Middle East, Africa) time zones.</b></div><div><span style=\"font-size: 13.3333px\">Cash compensation is a starting point, and we want all of our team members to be able to grow in their roles. In addition to equity, benefits and perks, our cash compensation is subject to an annual review and increase on a once per year basis on the hire date anniversary.</span></div><h3>What you'll be doing</h3><li>Work autonomously on a product built in <b>Ruby on Rails </b>backend and <b>React </b>front-end.</li><li>Build critical features and improvements for our web app, with a product-first mindset.</li><li>Work closely with Circle's leaders throughout the feature design process.</li><li>Work closely with our designers to create a world-class user experience.</li><li>Improve the quality of our codebase and identify architectural deficiencies</li><li>Learn, implement, and maintain new integrations with services like OpenAI, Zendesk, Hubspot, Notion, and Slack to improve the daily operations of our customer-facing teams.</li><li>Foster a bias for action, prioritizing speed of iteration without compromising on the quality of code or user experience.</li>,<h3>What you'll need to be successful</h3><li><b>6+ years experience working as a full-stack engineer on complex web applications with significant scale (100k+ rpm, 100GB+ databases).</b></li><li>Strong proficiency in <b>Ruby on Rails, MySQL/PostgreSQL, ReactJS, TypeScript, CSS/SCCS, TailwindCSS.</b></li><li>Familiarity with both frontend and backend is necessary, but a high degree of proficiency in both is not a requirement. Or, put another way: you should be able to individually build most small to medium features end-to-end across the stack, but you can be much better at backend than at front-end.</li><li>A desire to work in an environment which values speed of iteration and individual autonomy, while also embracing personal accountability and the ability to collaborate effectively as part of a dynamic team.</li><li>Great communication skills both in writing and verbal/oral (English).</li><li>Should be able to lead a complex project end to end with judgment and an attention to detail when it comes to architectural, product, design, and process decisions, your judgment should inspire a high level of trust within the team.</li><li>Experience working on a fully distributed remote team.</li><li>Comfortable in a fast-paced environment with a certain level of ambiguity, especially when learning and picking up new technologies when projects require it.</li>,<h3>Bonus points</h3><li>Previous experience working with community and / or creator platforms.</li><li>Experience with creating robust integrations with external services.</li><li>Experience with OpenAI, large language models, or other AI tools.</li><li>Experience at a fast-growing start-up.</li><li>A track record of picking up new technologies and skills as you ship high-quality code.</li><div><b style=\"font-size: 18px\">The fun stuff</b></div><div><b>Fully remote:</b>&nbsp;work from anywhere in the world!</div><div><b>Autonomy and trust to do your job:</b>&nbsp;we care about outcomes over everything else.</div><div><b>Paid time away:</b>&nbsp;all employees are given 35 days of PTO annually.</div><div><b>Generous U.S. benchmarked compensation</b>&nbsp;and startup equity no matter where you are in the world.*</div><div><b>Awesome medical coverage</b>&nbsp;with 100% coverage for you and your family, or medical reimbursement options where applicable!*</div><div><b>Home office stipend</b>&nbsp;to help you get up and running.</div><div><b>Learning &amp; development stipend</b>&nbsp;to help you level up your professional skills.</div><div><b>Annual bonus potential</b>&nbsp;for roles that don't already receive variable income or commission.</div><div><b>Company retreats:</b>&nbsp;Twice a year, the Circle team gets together for a fully paid company retreat in incredible places around the world! We’ve had past retreats in Colombia, Portugal, and Mexico, with more planned on the horizon.</div><div><b>Check out our&nbsp;<a href=\"https://careers.circle.so/\">Careers</a>&nbsp;page for more.</b></div><div><span style=\"font-size: 10px\">*</span><i style=\"font-size: 10px\">Your role, location and unique circumstance may affect this.</i></div><div><br></div><div><b>Diversity, Equity &amp; Inclusion</b></div><div>As a fully-remote international company, diversity is baked into our DNA. Here’s how our CEO, Sid Yadav, frames our hiring mission: “let’s find talent in underserved and under-represented corners of the world, set them up to do the best work of their lives, and in turn, change their life.” To achieve this hiring mission, we offer competitive&nbsp;<a href=\"http://u.s.-benchmarked/\">U.S.-benchmarked</a>&nbsp;compensation no matter where someone’s located in the world, and we proactively seek candidates who expand representation of backgrounds, cultures and lived experiences in our teams.</div><div><br></div><div><b>Equal Employment Opportunity</b></div><div>Circle is an equal opportunity employer and as such, we do not discriminate on the basis of race, color, religion, sex, sexual orientation, gender identity, national origin, age, disability, or any other characteristic protected by applicable laws.</div><div>If you require any accommodations during the recruitment process, please let us know and we will work with you to meet your needs.</div>","tags":"[\"postgres\",\"typescript\",\"database\",\"mysql\",\"aws\"]","pubDate":"2024-02-16 19:17:13.259","link":"https://jobs.lever.co/circleco/6c5c6fa1-6d89-4a38-bac7-bbdef3a383b8","savedDate":"2024-02-17 07:04:00.947","slug":"senior-full-stack-engineer-special-projects-circle-6842"},{"id":6529813464,"title":"Networks Manager","company":"Airalo","image":"https://lever-client-logos.s3.us-west-2.amazonaws.com/55028a36-609c-479c-9553-d4689ff2dd8c-1669620566663.png","description":"<div><b>About Airalo</b></div><div>Alo! Airalo is the world’s first eSIM store that helps people connect in over 200+ countries and regions across the globe. We are building the next digital service that revolutionizes the telecom industry. We are a travel-tech company and an equal-opportunity environment that values and executes diversity, inclusion, and equity. Our team is spread across 40+ countries and six continents. What glues us together is our commitment to changing the way you connect<span style=\"font-size: 13.3333px\">. </span></div><div><br></div><div><b>About you</b></div><div>We hope that you care deeply about the quality of your work, the intrinsic worth of tasks, and the success of your team. You are self-disciplined and do not require micromanagement in terms of your skillset and work ethic. You do your best to flourish as an individual every day while working hard to foster a collaborative team environment. You believe in the importance of being — and staying — authentic, honest, positive, and kind. You are a good interlocutor with clear and concise communication. You are able to manage multiple projects, have an analytical mind, pay keen attention to detail, and love to get your hands dirty. You are cognizant, tolerant, and welcoming of vulnerabilities and cultural differences.</div><div><br></div><div><b>About the Role</b></div><div><b>Position</b>: Full-time / Employee</div><div><b>Location:</b>&nbsp;Remote-first </div><div><b>Benefits:</b>&nbsp;Health Insurance, work-from-anywhere stipend, annual wellness &amp; learning credits, annual all-expenses-paid company retreat in a gorgeous destination &amp; other benefits</div><div><br></div><div><span style=\"font-size: 10pt\">As a </span><b style=\"font-size: 10pt\">Networks Manager</b><span style=\"font-size: 10pt\"> at Airalo, you will be responsible for expanding into new partner networks across the globe as well as permanently improving the rates, services, and quality of our existing partner networks. You are someone who is obsessed with providing the best rate possible (without compromising network quality) to global travelers in need of a reliable data connection when leaving their home network.</span></div><h3>Responsibilities include but are not limited to:</h3><li>Represent Airalo as the ideal interface to mobile network partners on a global level</li><li>Add &amp; improve network partnerships</li><li>Negotiate terms and conditions of wholesale and reseller contracts with host mobile network operators</li><li>Manage and assure regulatory compliance requirements for all our local markets and provide information to product management</li><li>Monitor and ensure network quality is provided by our partners</li><li>Define and run traffic, sales, and monetary analytics</li><li>Develop methods to ensure the unification of conditions and agreements</li><li>Prepare the rollout of new markets</li><li>Connect and integrate foreign mobile networks with Airalo’s OSS and BSS platform</li><li>Perform escalations in case of network quality issues and availabilities</li><li>Define and perform reconciliation processes</li>,<h3>Must-haves:</h3><li>Sound understanding of eSIM technology and use cases</li><li>Good overview in Telecommunication Network technologies like Mobile Core (PGW, IMS, Voice GW, HSS), OSS &amp; BSS</li><li>Understanding of different Mobile Services such as MOC/MTC, SM-MO, SM-MT, Data, Roaming, International Calling</li><li>Understanding of different Mobile Network Generations like 2G, 3G/UMTS, 4G/LTE, 5G NSA, and 5 G SA and how it influences customer experiences</li><li>Ideally, having served on the management team of an MVNO or MVNA, respectively, with a hands-on mentality</li><li>Having negotiated at least two different wholesale agreements on behalf of, or with, MVNOs with Host Mobile Network operators</li><li>Deep knowledge of subscriber life cycles with mobile services</li><li>Understanding the regulatory requirements for providing mobile services</li><li>Be familiar with KYC processes for mobile subscriptions</li><li>Excellent English skills; in writing, speaking, and reading – business fluent</li><li>5 years minimum relevant experience in the mobile telco industry</li>,<h3>Good to haves:</h3><li>Master Studies and/or MBA highly preferred</li><li>Clear communication skills</li><li>International working experience is highly preferred</li><li>Pro-activeness and Management skills in international environments</li><div><i>We sincerely thank all applicants in advance for submitting their interest in this opportunity with Airalo. </i></div>","tags":"[\"management\"]","pubDate":"2024-02-16 17:11:57.047","link":"https://jobs.lever.co/airalo/7f0a3d37-c7ce-43de-ac56-298c36d838fc","savedDate":"2024-02-17 07:04:00.949","slug":"networks-manager-airalo-4273"},{"id":6068605220,"title":"Senior Backend Developer (W-G)","company":"Blue Coding","image":"https://lever-client-logos.s3.us-west-2.amazonaws.com/3c1d9ac7-6738-46c5-b6ca-a35fa2a0df57-1666278594128.png","description":"<div><i style=\"font-size: 18px\">Do you want to earn a salary in USD?&nbsp;</i></div><div><i style=\"font-size: 18px\">Would you like to work from wherever you want?</i></div><div><i style=\"font-size: 18px\">Would you like to be a part of the leading next-gen software developers?&nbsp;</i></div><div><br></div><div><b style=\"font-size: 24px\">Hi, you finally found us!</b><span style=\"font-size: 24px\">&nbsp;</span></div><div><br></div><div><b style=\"font-size: 24px\">Why work at Blue Coding?</b><span style=\"font-size: 24px\">&nbsp;</span></div><div><br></div><div>At Blue Coding we specialize in hiring excellent developers and amazing people from all over Latin America and other parts of the world. For the past 9 years, we’ve helped cutting-edge companies in the United States and Canada -both large and small, build great development teams and develop great products. Online shops, digital agencies, SaaS providers, and software consulting firms are a few of our clients. Our team of over 100 engineers is distributed in more than 10 countries across the Americas. We are a fully remote company working with a wide array of technologies and have expertise in every stage of the software development process.&nbsp;&nbsp;</div><div><br></div><div>Our team is highly connected, united, and culturally diverse, and our collaborators are involved in many initiatives around the world, from wildlife preservation to volunteering at local charities. We also participate in group activities like movie nights, trivia, and meme competitions. We stand for honesty, fairness, respect, efficiency, hard work, and cooperation.</div><div><br></div><div><b style=\"font-size: 13pt\">What are we looking for?</b></div><div><br></div><div><span style=\"font-size: 11pt\">In this opportunity, we are looking for a Senior Backend Developer to work with one of our foreign clients, an independent, non-profit global research organization that turns big ideas into action at the nexus of environment, economic opportunity and human well-being.&nbsp;</span></div><div><br></div><div><span style=\"font-size: 11pt\">If you are independent, a great communicator, a problem solver, and have strong attention to detail, this is a great fit for you! Our jobs are fully remote – as long as you have the skills and can get the work done well, you can work anywhere in the listed countries you want.</span></div><div><br></div><div><span style=\"font-size: 11pt\">So if you have the skills and can get the job done, join us and work from anywhere you want!</span></div><div><br></div><div><b style=\"font-size: 13pt\">What's unique about this job?</b></div><div><br></div><div><span style=\"font-size: 11pt\">Our Client has an open-source web application that enables near real-time monitoring of global forests. Users can explore hundreds of spatial datasets related to forest change in a dynamic web map, view summary statistics with interactive dashboards, and subscribe to near real-time deforestation and fire alerts for custom areas of interest.&nbsp;</span></div><div><span style=\"font-size: 11pt\">In this role, you will work closely with the rest of the team to develop innovative new features that solve critical sustainability problems for our customers. The initial focus of your work will be the design and implementation of new integrated sustainability reporting features for global and local compliance that are aligned with industry standards. You will be part of a team responsible for all aspects of software development, including developing high-quality, reliable, secure, highly available, and scalable web-based applications.&nbsp;</span></div><div><br></div><div><span style=\"font-size: 11pt\">This client is passionate. They value their diversity of interests, skills, and backgrounds. They have a flexible work environment. And they share a common goal to catalyze change that will improve people's lives. Their shared ideals are at the core of their approach. They include integrity, innovation, urgency, independence, and respect. The foundation of their work is delivering high-quality research, data, maps, and analysis to solve the world’s greatest environmental and international development challenges and improve people’s lives. They work with </span>government, business, and civil society leaders&nbsp;<span style=\"font-size: 11pt\">to drive ambitious action and create change on the ground. Equally important, they bring together partners to develop breakthrough ideas and scale-up solutions for far-reaching, enduring impact.</span></div><h3>Here are some of the exciting day-to-day challenges you will face in this role:</h3><li><b><i>Product Development (90% of time required)</i></b></li><li>Participate in the design and development of the product vision, strategy, and prioritization considering institutional priorities, user needs, and budget in coordination with the client’s Product and Engagement teams</li><li>Participate in the prioritization of platform improvements and plan releases in coordination with the client’s Product Team and vendors as needed to optimize user experience and address user needs and technical debt, while considering additional dependencies</li><li>Collaboratively design client-side and server-side architecture for long-term agility, maintainability, security, and reliability.</li><li>Develop, test, release new features, and improve existing functionality of the client’s platform and responsive web application</li><li>Write automated tests and technical documentation</li><li>Troubleshoot, diagnose and fix software issues across the stack</li><li>Understand the customer through automation of the collection of user feedback, analytics, and industry trends and translate into improved and new product features</li><li>Work with the cross-cutting client’s product organization (Product, Engagement, Research, and Data teams) to improve the client’s software</li><li>Participate in developing appropriate cross-product technology standards and guidelines</li><li><b><i>Technology Operations Support (10% of time required):&nbsp;</i></b></li><li>Support the client’s operational support by improving the onboarding experience and understanding trends in support requests</li><li>Respond to, diagnose, and fix bugs, ensuring issues are not repeated, and coordinate with the product team and external vendors as needed</li><li>Set up and maintain an automated system for collecting and reporting on key product metrics</li><li>Participate in the response to incoming inquiries and questions on the application</li>,<h3>You will shine if you have these:</h3><li>4+ years of experience with NodeJS (Typescript), Express, Jest, and Python&nbsp;</li><li>Experience with SQL and NoSQL databases</li><li>Proficiency with cloud services like AWS (ECS, Lambda, SQS, S3, EMR, etc)</li><li>Experience in building maintainable and reliable backend software in agile environments</li><li>Experience with continuous integration and deployment (CI/CD)</li><li>Demonstrated understanding of the product development lifecycle and creating user-friendly data interfaces</li><li>Excellent communication and interpersonal skills</li><li>Fluency in English</li>,<h3>It doesn’t hurt if you also have:</h3><li>Bachelor’s degree preferred</li><li>Experience and desire to work with Agile processes</li><li>Experience and desire to work with geospatial data systems</li><li>Experience working across a matrixed team</li><li>Experience with continuous integration and delivery (CI/CD)</li><li>Experience in data analysis and product development</li><li>Fluency in Spanish, Portuguese, or Bahasa is a plus</li><div><b style=\"font-size: 24px\">Hey, you are still here!</b><span style=\"font-size: 24px\">&nbsp;</span></div><div><br></div><div>So, let us ask a few questions. Do you like working in a friendly environment? Are you fluent in English? Do you have a strong work ethic, are detail-oriented and have an ownership mentality? And most importantly do you love music and puppies? If so, then what are you waiting for? Come join our team and become part of this awesome company! We will be expecting you.</div>","tags":"[\"typescript\",\"database\",\"aws\"]","pubDate":"2024-02-16 13:56:26.841","link":"https://jobs.lever.co/bluecoding/1389e4b2-c87b-4cde-9ee7-3e7d35a76e05","savedDate":"2024-02-17 07:04:00.951","slug":"senior-backend-developer-w-g-blue-coding-5965"},{"id":9793959342,"title":"Senior Product Designer","company":"Airalo","image":"https://lever-client-logos.s3.us-west-2.amazonaws.com/55028a36-609c-479c-9553-d4689ff2dd8c-1669620566663.png","description":"<div><b>About Airalo</b></div><div>Alo! Airalo is the world’s first eSIM store that helps people connect in over 200+ countries and regions across the globe. We are building the next digital service that revolutionizes the telecom industry. We are a travel-tech company and an equal-opportunity environment that values and executes diversity, inclusion, and equity. Our team is spread across 40+ countries and six continents. What glues us together is our commitment to changing the way you connect<span style=\"font-size: 13.3333px\">. </span></div><div><br></div><div><b>About you</b></div><div>We hope that you care deeply about the quality of your work, the intrinsic worth of tasks, and the success of your team. You are self-disciplined and do not require micromanagement in terms of your skillset and work ethic. You do your best to flourish as an individual every day while working hard to foster a collaborative team environment. You believe in the importance of being — and staying — authentic, honest, positive, and kind. You are a good interlocutor with clear and concise communication. You are able to manage multiple projects, have an analytical mind, pay keen attention to detail, and love to get your hands dirty. You are cognizant, tolerant, and welcoming of vulnerabilities and cultural differences.</div><div><br></div><div><b>About the Role</b></div><div><b>Position</b>: Full-time / Employee</div><div><b>Location:</b>&nbsp;Remote-first </div><div><b>Benefits:</b>&nbsp;Health Insurance, work-from-anywhere stipend, annual wellness &amp; learning credits, annual all-expenses-paid company retreat in a gorgeous destination &amp; other benefits</div><div><br></div><div>Our Senior Product Designers are self-starters, able to work autonomously, and with purpose. They’re output-focused and able to use, adjust or invent processes and tools when needed and you know when ‘perfect’ is and isn’t the appropriate solution.</div><div><br></div><div>We’re looking for someone who is a remarkable communicator, and can hold a room with their articulate thinking and ideas. Finally, they are design practitioners, constantly striving to improve their approach to work and will share this across disciplines with your peers.</div><div><br></div><div>You will share the responsibility for helping to deploy the design vision for highly successful Airalo products in the User Experience Division - purely focusing on our consumer products. You will also become a close-knit member of the Airalo product design guild.</div><div><br></div><div>You will work in lockstep with peers from Design, Product Management, Research, Engineering, and Growth to ensure that our strategy is executed and delivered to our business customers within the design standards set together with the utmost attention to detail. You have a mentor mindset, and take pride in seeing others succeed as a result of your support and mentorship</div><h3>Responsibilities include but are not limited to:</h3><li>Designing high-fidelity user interfaces for consumer native mobile (Android &amp; iOS) and web applications.</li><li>Creating and delivering process flows, wireframes, interactive prototypes, user journeys, screen flows, high-fidelity mockups, and design system for the development and other disciplines to follow.</li><li>Collaborating and working closely with Senior Stakeholders, Product Managers, Engineers, Designers, UX Writers, and Researchers.</li><li>Creating animated motion graphics for the product(s), across platforms.</li><li>Contributing to the creation of clear, compelling, and persuasive customer-facing copy.</li><li>Continuously improving the overarching user experience.</li><li>Articulating challenges faced clearly along the design pathway, sharing those with your peers, and working collectively to resolve them.</li><li>Working with members from the Research &amp; Insights team to test and refine the product, and various pre and post-service journeys.</li><li>Take an insight-led, research-based position and ‘sell’ that to peers and stakeholders across the business.</li><li>Supporting and mentoring more junior members of the team.</li><li>Keeping up with the latest design trends and becoming a trusted source of knowledge in the business.</li><li>Ensure that Airalo has advanced understanding of the competitive landscape for consumer products in the mobile technology space.</li>,<h3>Must-haves:</h3><li>4+ years or similar of dedicated experience in product design at a tech startup or product-focused agency.</li><li>You are a designer at heart with evidence of the product design craft, sweating on the UI details and striving to make the best experience possible.</li><li>Ability to clearly communicate ideas and explain the rationale behind them.</li><li>Experience designing and testing native mobile and web applications for B2C.</li><li>Excellent written and verbal communication in English - ideally with experience crafting UX copy and microcopy.</li><li>A strong portfolio demonstrating your product design skill set - online or downloadable PDF.</li><li>Advanced knowledge of Figma, Figjam, and Adobe Suite design tools.</li><li>Ability to work with the current Design System to achieve consistency for end-product(s) and together with your deep understanding of Pattern Libraries in Design Systems and the efficiencies to be gained by using them effectively.</li><li>Advanced knowledge of web desktop and mobile web trends &amp; technologies.</li><li>In-depth understanding of responsive design for mobile and desktop web applications across the spectrum of various screen sizes.</li><li>Experience in creating material to support new features such as process flows, wireframes, interactive prototypes, product specification documentation.</li><li>Ability to keep a balance between user feedback, development and product goals during the product design process in order to deliver the best end product.</li><li>Experience working within Lean and / or Agile processes, knowledge of relevant practices and tools e.g. JIRA etc.</li><li>Be able to create and facilitate design workshops and ideation sessions.</li><div><i>We sincerely thank all applicants in advance for submitting their interest in this opportunity with Airalo. </i></div>","tags":"[\"management\",\"engineering\",\"B2C\"]","pubDate":"2024-02-16 09:10:56.012","link":"https://jobs.lever.co/airalo/131481bd-66ce-41df-8499-dcb3980b441e","savedDate":"2024-02-17 07:04:00.950","slug":"senior-product-designer-airalo-4240"},{"id":8005423569,"title":"IT Operations Manager","company":"Airalo","image":"https://lever-client-logos.s3.us-west-2.amazonaws.com/55028a36-609c-479c-9553-d4689ff2dd8c-1669620566663.png","description":"<div><b>About Airalo</b></div><div>Alo! Airalo is the world’s first eSIM store that helps people connect in over 200+ countries and regions across the globe. We are building the next digital service that revolutionizes the telecom industry. We are a travel-tech company and an equal-opportunity environment that values and executes diversity, inclusion, and equity. Our team is spread across 40+ countries and six continents. What glues us together is our commitment to changing the way you connect<span style=\"font-size: 13.3333px\">. </span></div><div><br></div><div><b>About you</b></div><div>We hope that you care deeply about the quality of your work, the intrinsic worth of tasks, and the success of your team. You are self-disciplined and do not require micromanagement in terms of your skillset and work ethic. You do your best to flourish as an individual every day while working hard to foster a collaborative team environment. You believe in the importance of being — and staying — authentic, honest, positive, and kind. You are a good interlocutor with clear and concise communication. You are able to manage multiple projects, have an analytical mind, pay keen attention to detail, and love to get your hands dirty. You are cognizant, tolerant, and welcoming of vulnerabilities and cultural differences.</div><div><br></div><div><b>About the Role</b></div><div><b>Position</b>: Full-time / Employee</div><div><b>Location:</b>&nbsp;Remote-first </div><div><b>Benefits:</b>&nbsp;Health Insurance, work-from-anywhere stipend, annual wellness &amp; learning credits, annual all-expenses-paid company retreat in a gorgeous destination &amp; other benefits</div><div><br></div><div>We are seeking an <b>IT &amp; Operations Manager</b> who is not only technically adept but also deeply committed to the quality of their work and the success of the team. The ideal candidate embodies self-discipline, requiring minimal oversight, and possesses a strong skill set coupled with a robust work ethic. Your role involves flourishing as an individual while contributing significantly to a collaborative team environment. Authenticity, honesty, positivity, and kindness are values we hold in high regard.</div><div><br></div><div>As our <b>IT &amp; Operations Manager</b>, you should be an excellent communicator, able to articulate complex technical concepts clearly and concisely. Your responsibilities will include managing multiple projects with an analytical mindset, focusing on the minutest details, and actively engaging in hands-on tasks. We value cognizance, tolerance, and appreciation of cultural differences. The role demands a proactive approach, ensuring the streamlined operation of our IT systems through effective management of access to applications, SSO configurations, MDM policies, and process optimization.</div><div><br></div><div>You will be responsible for identifying which tools and equipment the organization will provide as support for remote workers and what the individual employees are expected to procure, creating digital workflows that automate core onboarding/off-boarding  processes. Collaborate with HR to create remote work onboarding portals that feature “Getting Started” videos for setup and tips for succeeding with remote work. You’ll be working closely with the HR team including HR Managers and TA Managers.</div><h3>Responsibilities include but are not limited to:</h3><li>Collaborate with various departments to implement new IT solutions and modifications to existing systems.</li><li>Enhance IT processes and controls, focusing on the ITIL framework, particularly in areas of change management.</li><li>Develop and maintain comprehensive policies, procedures, and documentation for IT systems.</li><li>Oversee software/hardware asset management, including updating asset lists, managing licenses, and handling maintenance contracts.</li><li>Evaluate, recommend, and procure new IT systems and hardware solutions.</li><li>Lead the selection, testing, implementation, and integration of new technical systems/applications.</li><li>Identify and drive technological improvements and efficiency initiatives in collaboration with business units.</li><li>Manage access control systems and maintain the security of IT infrastructure, including implementation of security measures like anti-malware and regular system patching.</li><li>Liaise with third-party service providers and offer necessary assistance.</li><li>Conduct IT systems and procedures training for staff.</li><li>Documenting processes, as well as ensuring data security/compliance</li><li>Maintaining IT documentation e.g. Asset List</li>,<h3>Must-haves:</h3><li>BS or BA degree in Information Systems, Information Technology, Computer Science or related technology degree. Alternatively, equivalent work experience</li><li>Proven experience in setting up and enhancing IT processes and operations, with a strong understanding of ITIL frameworks.</li><li>Proficient in managing Google Workspace and other cloud services.</li><li>Strong knowledge of Single Sign-On (SSO) and Mobile Device Management (MDM) solutions (JumpCloud).</li><li>Demonstrated ability in implementing and integrating new IT solutions.</li><li>Hands-on technical management skills, with a readiness to engage in operational tasks as needed.</li><li>Experience in vendor and supplier management, from procurement to ongoing support.</li><li>Competence in managing enterprise security systems and compliance measures.</li><li>Research and development skills for exploring and integrating new systems.</li><li>Excellent organizational and documentation skills.</li><li>Good experience in stakeholder management.</li><div><i>We sincerely thank all applicants in advance for submitting their interest in this opportunity with Airalo. </i></div>","tags":"[\"management\"]","pubDate":"2024-02-16 09:05:15.018","link":"https://jobs.lever.co/airalo/7014c629-084e-4749-a211-2db38e8c0cdc","savedDate":"2024-02-17 07:04:00.949","slug":"it-operations-manager-airalo-2008"},{"id":7460944523,"title":"Junior Web Analyst for anti-malware product - Remote/WorkAnywhere","company":"CloudLinux","image":"https://pbs.twimg.com/profile_images/696718028084482050/ymY3OEPk_400x400.png","description":"<p>Our growing Imunify Security team is looking for a Junior Web Analyst. You will be responsible for analyzing a stream of suspicious websites and making classifications according to the provided guidelines.</p><p>Imunify360 Security Suite is a product of CloudLinux Inc., the maker of the #1 OS in security and stability for hosting providers. Imunify is an innovative security solution designed specifically for shared and VPS/Dedicated servers. The automated, easy-to-use solution with the six-layer approach to security delivers comprehensive and complete attack prevention.</p><p>Work is fully remote, with flexible hours, so you can plan your day and work from anywhere in the world. More details about the project you can find on the product website imunify360.com. Join us to make a difference!</p><p><strong>What you will do:</strong></p><ul> <li>Analyze various types of redirects</li> <li>Collect phishing domains</li> <li>Classify websites depending on observed results</li> </ul><h3>Requirements: </h3><p></p><ul> <li>At least basic English knowledge (A1-A2) is mandatory</li> <li>HTML and JS skills will be a plus</li> <li>Experience in the web security industry would be a plus</li> <li>Linux console skills will be a plus</li> </ul><h3>Benefits: </h3><p><strong>What's in it for you?</strong></p><ul> <li>A focus on professional development; </li> <li>Interesting and challenging projects</li> <li>Flexible working hours</li> <li>Paid one month vacation per year and unlimited sick leave</li> <li>Medical insurance reimbursement</li> <li>Co-working and gym/sports reimbursement</li> <li>The opportunity to receive a reward for the most innovative idea that the company can patent</li> </ul><p><em>By applying for this position, you agree with </em><a href=\"https://cloudlinux.com/privacy-policy\" rel=\"nofollow noreferrer noopener\" class=\"external\"><em>Cloudlinux Privacy Policy</em></a><em> and give us your consent to maintain and process your personal data with this respect. Please read our Privacy Policy for more information.</em></p>","tags":"[]","pubDate":"2024-02-16 00:00:00.000","link":"https://apply.workable.com/cloudlinux-1/j/3CD380A386","savedDate":"2024-02-17 07:04:00.945","slug":"junior-web-analyst-for-anti-malware-product-remote-workanywhere-cloudlinux-848"},{"id":9429558590,"title":"Sales Expert","company":"Quadcode","image":"https://remotive.com/job/1897157/logo","description":"<p>We are <strong>Quadcode</strong>, a company that develops a SaaS trading platform for clients around the world.<br><strong>Sabio Trade</strong> is a trading firm dedicated to empowering talented traders to reach their full potential and attain financial success. Our commitment to fostering a dynamic trading environment is reflected in our company culture and values.</p>\n<p>As a <strong>Sales Expert </strong>you will play a crucial role in identifying business opportunities, understanding customer needs, and promoting our products or services.</p>\n<p>The working model of the role is a <strong>part time.</strong></p>\n<p><strong>Task in the role</strong></p>\n<ul style=\"\"><li style=\"\">Contact clients generated in the company's database;</li><li style=\"\">Sell and promote our products through Discord and WhatsApp;</li><li style=\"\">Create a buzz around Sabio Trade.</li></ul>\n<p><strong>Qualifications:</strong><br></p>\n<ul style=\"\"><li style=\"\">Proven experience in sales, with a successful track record of meeting or exceeding targets;</li><li style=\"\">Proficiency in English language, Italian, Portuguese or Spain is a plus</li><li style=\"\">Excellent communication and interpersonal skills;</li><li style=\"\">Strong negotiation and closing abilities.</li></ul>\n<p><strong>Key Requirements:</strong></p>\n<ul style=\"\"><li style=\"\">Proactive and results-oriented mindset;</li><li style=\"\">Ability to work independently and collaboratively within a team;</li><li style=\"\">Strong organizational and time management skills;</li><li style=\"\">Adaptability and resilience in a fast-paced sales environment.</li></ul>\n<p></p>\n<p>As a part of the Sabio Trade team, you'll become a vital player in our mission to empower traders and drive financial success. Join us today and be a part of a community that values talent, innovation, and dedication.</p>\n<p>Your journey to financial achievement starts here with Sabio Trade!</p>\n<p><em>Note: All applications will be treated with strict confidence. We thank all applicants for their interest, however only those candidates selected for interviews will be contacted.</em></p>\n<p>#LI-EN1, #LI-Remote</p>\n<p></p>\n<p></p><img src=\"https://remotive.com/job/track/1897157/blank.gif?source=public_api\" alt=\"\"/>","tags":"[\"saas\",\"trading\",\"time management\"]","pubDate":"2024-02-15 17:21:01.000","link":"https://remotive.com/remote-jobs/sales/sales-expert-1897157","savedDate":"2024-02-17 07:04:00.940","slug":"sales-expert-quadcode-2494"},{"id":6514080704,"title":"Senior Growth Marketing Manager","company":"Roo","image":"https://remotive.com/job/1895282/logo","description":"<div> <b>About Roo</b></div><div><br></div><div>Happy vets make for happy pets. </div><div><br></div><div>Roo is on a mission to create a world of increased opportunity, professional empowerment, and improved animal care for animal hospitals and veterinarian professionals.  By connecting hospitals in need with professionals with a new groundbreaking platform, our goal is to optimize hospital talent staffing and improve quality of life for veterinarians, all while giving pets a chance to have access to safe, high-quality care. </div><div><br></div><div>Over the next decade, Roo will unlock millions in economic opportunities, improve quality of life for tens of thousands of veterinarians, and facilitate millions of hours of pet care. We've been growing tremendously since launching in early 2019 and now seeing even more traction as we scale up fast.</div><div><br></div><div><b>What We Do</b></div><div><br></div><div>Roo (<a class=\"postings-link\" href=\"http://www.roo.vet\" rel=\"nofollow\">www.roo.vet</a>) has created the first B2B labor marketplace in animal healthcare that connects veterinary professionals with hospitals through innovative technology, with opportunities to expand and offer more opportunities for both our demand &amp; supply of users. </div><div><br></div><div>Our dynamic platform enables hospitals to fulfill personnel needs in real time, while allowing high-quality veterinary professionals to secure work at the click of a button.  Beyond the platform, Roo represents a growing opportunity to help hospitals meet all-things staffing, and a growing community of resilient vet industry professionals who value flexibility and work-life balance, in addition to providing the best possible outcomes for clients and their pets.  </div><div><br></div><div>Our aim is to combine experienced healthcare expertise with Silicon Valley talent to shake up this industry and change the way veterinarians and hospitals work!</div><div><br></div><div><b style=\"font-size: 18px\">About the Role</b></div><div><br></div><div>We are seeking a Senior Growth Marketing Manager to spearhead our acquisition strategies and oversee key marketing functions. This role is integral to driving Roo's growth by effectively managing and guiding our content, social media, and veterinarian recruitment efforts. Your strategic vision and leadership will play a crucial role in expanding our market presence and user base.</div><br><br><div class=\"h3\">Your Responsibilities</div><li style=\"\">Drive marketing acquisition strategies to attract top veterinary talent, ensuring alignment with Roo's value proposition and strategic goals.</li><li style=\"\">Develop and implement a comprehensive digital marketing strategy that aligns with Roo's business goals, particularly focusing on acquisition and user engagement.</li><li style=\"\">Lead and manage a digital marketing team, focused on paid and organic acquisition, ensuring a cohesive and effective approach to marketing.</li><li style=\"\">Oversee the creation and distribution of engaging content across various digital platforms to increase brand awareness and drive user acquisition.</li><li style=\"\">Utilize data-driven insights to optimize paid ad campaigns and strategies for maximum effectiveness.</li><li style=\"\">Collaborate with cross-functional teams to align digital marketing efforts with overall company objectives.</li><li style=\"\">Track and analyze key digital marketing metrics, adjusting strategies to improve performance and ROI.</li><br><br><div class=\"h3\">Qualifications</div><li style=\"\">7+ years of experience in growth marketing, with a proven track record in user acquisition and team management.</li><li style=\"\">Strong leadership skills with experience managing a diverse team.</li><li style=\"\">Expertise in digital advertising, email and content marketing, as well as social media management.</li><li style=\"\">Excellent analytical skills with experience in data-driven decision making.</li><li style=\"\">Proficient in digital marketing tools and platforms (e.g., Google/LinkedIn/Facebook ads and Hubspot or comparable CRM platforms)</li><li style=\"\">Outstanding verbal and written communication skills.</li><li style=\"\">Experience at a marketplace company, or the veterinary or healthcare industry is a plus.</li><li style=\"\">Demonstrated ability to work in a fast-paced environment and manage multiple projects simultaneously.</li><div>We have diverse, passionate &amp; driven team members from a variety of backgrounds. For permanent, full time employees, we offer:</div><div><br></div><div>- Accelerated growth &amp; learning potential</div><div>- Stipends for home office setup, continuing education, and monthly wellness</div><div>- Comprehensive health benefits to fit your needs with base medical plan covered at 100% with optional   </div><div>  premium buy up plans.</div><div>- 401K</div><div>- Unlimited Paid Time Off</div><div>- Paid Maternity/Paternity and reproductive care leave</div><div>- Gifts on your birthday &amp; anniversary</div><div>- Opportunity for domestic travel, including for regional team building events</div><div><br></div><div>Overall, you would be part of a mission-driven company that will significantly empower the lives of all veterinary professionals and the health of the overall animal industry that seeks massive innovation.</div><div><br></div><div>We believe in diversity of experience and background, and understand that your individual experience may not check every box. We still encourage you to apply even if you are not confident in every expectation listed.</div><div><br></div><div>Ready to join the Roo-volution?!</div><img src=\"https://remotive.com/job/track/1895282/blank.gif?source=public_api\" alt=\"\"/>","tags":"[\"digital marketing\",\"team management\",\"user acquisition\"]","pubDate":"2024-02-14 15:21:11.000","link":"https://remotive.com/remote-jobs/marketing/senior-growth-marketing-manager-1895282","savedDate":"2024-02-17 07:04:00.941","slug":"senior-growth-marketing-manager-roo-1854"},{"id":6041153023,"title":"IT Operations Administrator","company":"CoverGo","image":"https://pbs.twimg.com/profile_images/1382655628523364355/MWPIbbID_400x400.jpg","description":"<p><strong>Top 3 Reasons To Join Us</strong></p><ul> <li>Competitive Salary</li> <li>100% Remote</li> <li>Working on the latest tech for the Insurtech Market Leader</li> </ul><p><strong>About Us</strong></p><p>At CoverGo, our mission is to empower all insurance companies to make insurance 100% digital and accessible to everyone.</p><ul> <li>We are a leading global no-code insurance platform for health, life, and P&amp;C</li> <li>We’re the winner of the Insurtech of the Year in all of Asia and other awards globally</li> <li>We work with insurance enterprise clients such as AXA, Bupa, MSIG, Dai-ichi, Bank of China Group Insurance, and many more</li> <li>We're an international, diverse team of over 120 people with 30 nationalities and team members working remotely from all over the world</li> <li>We are fully funded and backed by reputable VC funds and strategic institutional investors</li> <li>We have a global presence in Asia, EMEA and the Americas</li> <li>We’ve grown our annualized revenue by over 30x since January 2021</li> <li>We’re constantly working towards making CoverGo a workplace that you love coming to. We deeply believe that bringing together a diversity of thoughts, expressions, and perspectives is key to building the best culture for equally diverse communities all over the world</li> </ul><p><strong>About the Role</strong></p><p>As an IT Operations Administrator, you will contribute to the seamless operation and security of our IT business systems with a customer-focused, hands-on approach to delivering efficient and secure IT services. The role involves a combination of hard skills, including proficiency in identity and access management, endpoint configuration, and IT service management, as well as essential soft skills like problem-solving, communication, and a proactive attitude. Ultimately, the IT Operations Administrator is vital in maintaining a stable IT environment and fostering continuous improvement within the organization.</p><p><strong>What You Will Do</strong></p><ul> <li>Efficient resolution of day-to-day IT tasks and&nbsp; execute existing IT operations while continually improving and automating processes</li> <li>Work in agile environments, organize tasks in a ticketing system, and engage in daily time tracking</li> <li>Perform daily tasks which consists some of the following activities: Agile team ceremonies, ticket backlog grooming, incident management, change management, problem management, and endpoint configuration</li> <li>Actively engage with the user base, solicit feedback, and enhance processes for maximum user satisfaction</li> <li>Work with Google Workspace, Okta, Slack, Office365, MS InTune, Atlassian</li> <li>Other tasks that depend on your previous experience on the 4 IT domains listed below:</li> <ul> <li>Google Workspace/Microsoft Entra ID/Active Directory or similar Identity and Access Management solutions</li> <li>Endpoint management (group policies, secure default configuration, app provisioning, etc.)</li> <li>Internal IT Service Desk/Help Desk/administrator operations in L2 or above</li> <li>IT service documentation and hands-on service improvement for internally facing IT services.</li> </ul> <li>Join our IT administration team with a direct report to the Head of Security</li> <li>Perform ad hoc IT-operations related assignments and projects as required</li> </ul><p><strong>What We Need</strong></p><ul> <li>Minimum 1 year of experience as IT Operations Administrator or in a similar role</li> <li>Expertise in at least 2 of the following 4 IT operation domains:&nbsp;</li> </ul><ol> <li>Google Workspace/Microsoft Entra ID/Active Directory or similar Identity and Access Management solutions</li> <li>Endpoint management (group policies, secure default configuration, app provisioning, etc.)</li> <li>Internal IT Service Desk/Help Desk/administrator operations in L2 or above</li> <li>IT service documentation and hands-on service improvement for internally facing IT services</li> </ol><ul> <li>A university degree in Computer Science, or any relevant science or engineering discipline; alternatively, a track record in technical IT upskilling</li> <li>Relevant experience in areas such as cybersecurity, software development, or bash scripting would be an advantage&nbsp;</li> </ul><ul> <li>Experience in all or at least some of following systems: Google Workspace, Okta, Slack, Office365, MS InTune, and Atlassian</li> <li>Fully remote position but must be currently based in the Philippines due to timezone requirements</li> <li>Excellent English skills, both written and spoken</li> <li>Ability to work independently, be a self starter, and have a solution-driven approach, actively solving problems and driving positive change in the organization</li> <li>Ability to obtain organizational buy-in and exercise nondisruptive change management</li> <li>Creativity to build engaging, secure IT services that enhance user experience</li> <li>Someone who is meticulous, well-organized and conscientious with a high level of initiative at work</li> </ul><p><strong>Why You'll Love Working Here</strong></p><ul> <li>Fully Remote</li> <li>Flexible Leave</li> <li>International Environment</li> <li>Competitive renumeration package</li> <li>Performance Bonus</li> <li>Stock Options after 6 months </li> <li>Company activities and events</li> <li>Learning and development plan</li> </ul><p><strong>CoverGo Company </strong><a href=\"https://www.youtube.com/watch?v=YI0ezLxvFvA\" rel=\"nofollow noreferrer noopener\" class=\"external\"><strong>Video</strong></a></p><p>By submitting your application, you confirm that you have read, understood, and accepted the content of CoverGo’s <a href=\"https://apply.workable.com/covergo/gdpr_policy?lng=en\" target=\"_blank\" rel=\"nofollow noreferrer noopener\" class=\"external\">Privacy Notice</a> and you consent to the processing of your data as part of this application.</p><h3>Requirements: </h3><h3>Benefits: </h3>","tags":"[\"management\",\"engineering\"]","pubDate":"2024-02-01 00:00:00.000","link":"https://apply.workable.com/covergo/j/BA63D4A69D","savedDate":"2024-02-17 07:04:00.946","slug":"it-operations-administrator-covergo-5599"},{"id":1925149336,"title":"HR Manager (Europe)","company":"Airalo","image":"https://lever-client-logos.s3.us-west-2.amazonaws.com/55028a36-609c-479c-9553-d4689ff2dd8c-1669620566663.png","description":"<div><b>About Airalo</b></div><div>Alo! Airalo is the world’s first eSIM store that helps people connect in over 200+ countries and regions across the globe. We are building the next digital service that revolutionizes the telecom industry. We are a travel-tech company and an equal-opportunity environment that values and executes diversity, inclusion, and equity. Our team is spread across 40+ countries and six continents. What glues us together is our commitment to changing the way you connect<span style=\"font-size: 13.3333px\">. </span></div><div><br></div><div><b>About you</b></div><div>We hope that you care deeply about the quality of your work, the intrinsic worth of tasks, and the success of your team. You are self-disciplined and do not require micromanagement in terms of your skillset and work ethic. You do your best to flourish as an individual every day while working hard to foster a collaborative team environment. You believe in the importance of being — and staying — authentic, honest, positive, and kind. You are a good interlocutor with clear and concise communication. You are able to manage multiple projects, have an analytical mind, pay keen attention to detail, and love to get your hands dirty. You are cognizant, tolerant, and welcoming of vulnerabilities and cultural differences.</div><div><br></div><div><b>About the Role</b></div><div><b>Position</b>: Full-time / Employee</div><div><b>Location:</b>&nbsp;Remote-first </div><div><b>Benefits:</b>&nbsp;Health Insurance, work-from-anywhere stipend, annual wellness &amp; learning credits, annual all-expenses-paid company retreat in a gorgeous destination &amp; other benefits</div><div><br></div><div>As an <b>HR Manager</b>, you will be responsible for all day-to-day people-partnering matters within your tribe and be a key driver for change &amp; operational excellence, aligning business &amp; people strategies to develop a pleasant, rewarding &amp; high-performance culture within Airalo. You’ll be working closely with our founders, C-level executives, VPs &amp; Directors of your assigned tribe, as well as the entire People &amp; Talent team.&nbsp;</div><h3>Responsibilities include but are not limited to:</h3><li>Drive Airalo’s global HR strategy in close collaboration with the VP, People, Director of People Operations, department heads &amp; key stakeholders;</li><li>Support with yearly Headcount Planning &amp; Forecasts with the People Director, Talent, and Hiring Managers;</li><li>Assists senior management in the development of solutions for current and future business needs through employee development, organizational development, cultural and process-oriented perspectives;</li><li>Offer an optimal, welcoming &amp; automated onboarding experience to all our staff. Work with our partners to establish employment contracts for all our new joiners, ensuring full compliance with local regulations;</li><li>Documentation: Centralize &amp; maintain all employees’ personal &amp; professional information/documentation on various HCM tools &amp; systems;</li><li>Reporting: Provide regular &amp; metrics to your tribe managers: Performance, Employee Engagement, Pulse Study, Employee Retention, etc;</li><li>L&amp;D: Act as an integral consultant &amp; train your tribe leaders &amp; managers on best management practices, performance management, labor regulations, etc;</li><li>Conflict Management: consult with employees &amp; managers to address &amp; resolve the root causes of any human resources issues objectively &amp; impartially;</li><li>Participates in company-wide programs &amp; initiatives (ie. salary review, workforce planning, organizational change, ESOP, C&amp;B, etc).</li>,<h3>Must-haves:</h3><li>Bachelor’s degree in human resources, business administration, or similar relevant field &amp; a minimum of 4 years of experience in HR business partnering role;</li><li>Proven experience in taking charge of projects and guiding them to successful completion;</li><li>Possesses strong leadership skills and is resilient;</li><li>Possesses strong customer-centric skills with a passion for service, ensuring all our interactions with people are handled professionally and with thorough attention to detail;</li><li>Proven experience in strategic HR plans and solutions, dealing with organization strategies and complex business/HR-related topics;</li><li>Strong stakeholder management, interpersonal, and communication skills with all levels of seniority in a cross-functional &amp; global environment;</li><li>Effective &amp; analytical mindset, creative and pragmatic problem-solving skills with strong business acumen &amp; user-centric philosophy;</li><li>Self-driven, optimistic, and keen to work as part of a professional and closely-knit team while highly organized with excellent time management skills;</li><li>Experience with HRIS, HCM &amp; other tools, ensuring the highest level of confidentiality &amp; accuracy on personal &amp; professional information.</li>,<h3>Good to have:</h3><li>Experience in the travel tech and/or telco industry;</li><li>Relevant HR certifications (iHRP, CIPD, SHRM, etc);</li><li>Additional written/spoken languages.</li><div><i>We sincerely thank all applicants in advance for submitting their interest in this opportunity with Airalo. </i></div>","tags":"[\"management\"]","pubDate":"2024-01-24 14:29:59.102","link":"https://jobs.lever.co/airalo/b4704c93-bb9d-456b-b51c-c8140ff7be9a","savedDate":"2024-02-17 07:04:00.948","slug":"hr-manager-europe-airalo-8461"}]