[{"id":5602469050,"title":"HR Operations Manager","company":"Winona","image":"https://yt3.googleusercontent.com/k45HnnNMWgPv-xF3D-u2ThxmesDOeU0p02rNJpbRWLes2Z18WpkLgXEE7XuBLkkzN_38AFnp3A=s160-c-k-c0x00ffffff-no-rj","description":"<p style=\"min-height:1.5em\"><strong>About Winona:</strong></p><p style=\"min-height:1.5em\"><a target=\"_blank\" rel=\"noopener noreferrer nofollow\" href=\"https://bywinona.com\">Winona</a> is one of the leading telemedicine companies providing HRT for women in menopause. We’ve built all of our technology in house including an EHR, patient care admin system, patient portal, website, marketing technology etc. Winona has two compounding pharmacies and a team of in house physicians providing world-class care via a fully vertically integrated business model.</p><p style=\"min-height:1.5em\"></p><p style=\"min-height:1.5em\"><strong>About the role:</strong></p><p style=\"min-height:1.5em\">We are looking for a proactive and adaptable <strong>HR</strong> <strong>Operations Manager</strong> to join our fast-growing team. This role requires a well-rounded professional with a strong background in human resources and operations. The ideal candidate will be an excellent multi-tasker with a sharp eye for detail and a passion for fostering a positive and engaging employee experience.</p><p style=\"min-height:1.5em\"></p><p style=\"min-height:1.5em\"><strong>Seniority Level: </strong>Senior Level </p><p style=\"min-height:1.5em\"></p><p style=\"min-height:1.5em\"><strong>Responsibilities:</strong></p><p style=\"min-height:1.5em\"><strong>Human Resources:</strong></p><p style=\"min-height:1.5em\">Manage the full employee lifecycle, including onboarding, offboarding, and ongoing employee relations.</p><ul style=\"min-height:1.5em\"><li><p style=\"min-height:1.5em\">Process international payroll, benefits administration, and time and attendance, ensuring timely and accurate processing.</p></li><li><p style=\"min-height:1.5em\">Maintain accurate employee records and ensure compliance with local and international employment laws and regulations.</p></li><li><p style=\"min-height:1.5em\">Provide continuous support and guidance to employees regarding HR policies, procedures, and benefits.</p></li><li><p style=\"min-height:1.5em\">Coordinate training and development programs, fostering a growth-oriented and constantly improving environment.</p></li><li><p style=\"min-height:1.5em\">Facilitate performance reviews and goal-setting processes, ensuring effective feedback mechanisms are in place.</p></li></ul><p style=\"min-height:1.5em\"><strong>Operations:</strong></p><ul style=\"min-height:1.5em\"><li><p style=\"min-height:1.5em\">Manage vendor relationships and oversee vendor payments, ensuring smooth and efficient workflows.</p></li><li><p style=\"min-height:1.5em\">Plan and coordinate all-hands meetings and other company events, creating opportunities for interaction across all organizational levels.</p></li><li><p style=\"min-height:1.5em\">Oversee operational tasks, ensuring the efficient functioning of the organization and collaborating with other departments to address urgent needs.</p></li><li><p style=\"min-height:1.5em\">Collaborate in improving and optimizing internal operational processes and implementing new strategies to enhance organizational efficiency.</p><p style=\"min-height:1.5em\"></p></li></ul><p style=\"min-height:1.5em\"><strong>Requirements:</strong></p><ul style=\"min-height:1.5em\"><li><p style=\"min-height:1.5em\">Bachelor's degree in Human Resources, Business Administration, or related field.</p></li><li><p style=\"min-height:1.5em\">Ideally, a minimum of 3+ years of experience in human resources or operations roles in a high-growth environment.</p></li><li><p style=\"min-height:1.5em\">Experience in international payroll administration.</p></li><li><p style=\"min-height:1.5em\">Knowledge of U.S. employment laws and regulations, including tax compliance, labor laws, and benefits administration, ensuring full compliance and minimizing legal risks.</p></li><li><p style=\"min-height:1.5em\">Experience managing vendor relationships and payments.</p></li><li><p style=\"min-height:1.5em\">Strong attention to detail and accuracy, with excellent organizational and time management skills.</p></li><li><p style=\"min-height:1.5em\">Ability to prioritize tasks, work independently, and maintain flexibility in a fast-paced, dynamic environment.</p></li><li><p style=\"min-height:1.5em\">Exceptional interpersonal and communication skills, with the ability to interact effectively at all organizational levels.</p></li><li><p style=\"min-height:1.5em\">Ability to maintain discretion when handling highly sensitive and confidential employee and organizational matters.</p></li><li><p style=\"min-height:1.5em\">A positive and solution-oriented attitude</p><p style=\"min-height:1.5em\"></p></li></ul><p style=\"min-height:1.5em\"><strong>Nice to have:</strong></p><ul style=\"min-height:1.5em\"><li><p style=\"min-height:1.5em\">Experience working with international remote teams, with a strong understanding of the dynamics and challenges of managing a distributed workforce.</p></li><li><p style=\"min-height:1.5em\">Experience in telemedicine or related medical contexts, particularly in managing operations within healthcare or telehealth settings.</p></li><li><p style=\"min-height:1.5em\">Familiarity with software platforms such as Gusto, Deel, Mercury, Slack, and Google Suite.</p><p style=\"min-height:1.5em\"></p></li></ul><h2><strong>What’s in it for you?</strong></h2><p style=\"min-height:1.5em\">As full-time member of our team, you’ll enjoy:</p><ul style=\"min-height:1.5em\"><li><p style=\"min-height:1.5em\">Flexible hours</p></li><li><p style=\"min-height:1.5em\">Work wherever you choose</p></li><li><p style=\"min-height:1.5em\">Fun and casual work environment</p></li><li><p style=\"min-height:1.5em\">Employee engagement activities and virtual gatherings</p></li><li><p style=\"min-height:1.5em\">We are a diverse, global team! 🌍</p><p style=\"min-height:1.5em\"></p></li></ul><p style=\"min-height:1.5em\"><em>This company is affiliated for recruitment efforts. Each entity maintains operational independence, and no personal data is shared between them except as necessary for coordinated recruitment activities. Both teams are committed to protecting applicant privacy and ensuring a respectful, transparent hiring process.</em></p><p style=\"min-height:1.5em\"><em><strong>Equal Employment Opportunity</strong></em></p><p style=\"min-height:1.5em\"><em>Winona provides equal employment opportunities to all qualified individuals without regard to race, color, religion, sex, gender identity, sexual orientation, pregnancy, age, national origin, physical or mental disability, military or veteran status, genetic information, or any other protected classification. Equal employment opportunity extends to all aspects of employment including, but not limited to, recruitment, hiring, training, promotion, demotion, transfer, leaves of absence, and termination. Winona takes allegations of discrimination, harassment, and retaliation seriously and will promptly investigate such behaviors.</em></p>","tags":"[\"aws\",\"legal\"]","pubDate":"2025-05-18T14:28:39.226Z","link":"https://jobs.ashbyhq.com/winona/a2d54412-2acf-4656-abeb-bf1b87742be1","slug":"hr-operations-manager-winona-7058"},{"id":4614321767,"title":"Network Engineer","company":"Shieldtp","image":"https://remotive.com/job/2008558/logo","description":"<div><!--block-->IronOrbit is seeking a skilled and motivated <strong>Network Engineer</strong> responsible for maintaining the infrastructure within our managed facilities. The ideal candidate will oversee day-to-day operations of the infrastructure and play a key role in defining and supporting the organization’s strategy, architecture, standards, and procedures.<br><br></div><div><!--block-->This individual will work collaboratively with internal teams and third-party service providers to ensure the delivery of secure, reliable, and highly available network and server infrastructure services, meeting our 99.999% SLA.</div><br><br><div class=\"h3\">Key Responsibilities</div><div><!--block--><strong>Infrastructure Operations:</strong><br>\t•\tMaintain security and integrity of network infrastructure and facilities.<br>\t•\tEnsure system uptime in line with company SLA targets.<br>\t•\tManage equipment and services including physical/virtual servers, communication devices, and security hardware.<br>\t•\tProvision, configure, and deploy hardware resources.<br>\t•\tMaintain systems supporting Disaster Recovery and Business Continuity.<br>\t•\tMaintain up-to-date infrastructure documentation, including systems, maps, and procedures.<br><br><strong>Service Delivery:</strong><br>\t•\tReview and act on daily tickets in accordance with SLA priority levels.<br>\t•\tRespond to out-of-hours critical alerts as required.<br>\t•\tEnsure changes follow appropriate internal and client change management processes.<br><br><strong>Collaboration &amp; Communication:</strong><br>\t•\tDevelop and maintain strong working relationships with management and peers.<br>\t•\tProvide consistent, clear communication across all levels of the organization.<br>\t•\tEffectively manage projects through planning, coordination, and evaluation.<br><br><strong>Continuous Learning &amp; Compliance:</strong><br>\t•\tStay current with technological developments relevant to the role.<br>\t•\tContribute to a learning-focused and positive organizational culture.<br>\t•\tRepresent the company professionally with both internal and external stakeholders.<br>\t•\tAdhere to company policies, procedures, and employment contract obligations.</div><br><br><div class=\"h3\">Skills, Knowledge &amp; Expertise</div><div><!--block-->Experience with Cisco (routing &amp; switching), Juniper (switching), and Palo Alto firewalls<br><br><strong>Preferred:</strong><br>\t•\tAzure networking and Cisco Call Manager/UCM<br>\t•\tStrong experience with BGP, OSPF<br>\t•\tVirtualization: VMware, Hyper-V<br>\t•\tBackground in Managed Services<br>\t•\tFamiliarity with cloud platforms (AWS, Azure)<br>\t•\tProficiency in configuring/managing data center networks<br>\t•\tUnderstanding of networking protocols: VXLAN, EVPN, MPLS<br>\t•\tExposure to SDN solutions (e.g., Cisco ACI)<br>\t•\tExperience with network automation (Python, Ansible)<br>\t•\tSkilled in using monitoring and performance troubleshooting tools<br>\t•\tStrong analytical and problem-solving abilities</div><img src=\"https://remotive.com/job/track/2008558/blank.gif?source=public_api\" alt=\"\"/>","tags":"[\"aws\",\"azure\",\"python\"]","pubDate":"2025-05-17T04:50:36.000Z","link":"https://remotive.com/remote-jobs/devops/network-engineer-2008558","slug":"network-engineer-shieldtp-8650"}]