[{"id":8437592966,"title":"Junior Account Executive","company":"SafetyWing","image":"https://pbs.twimg.com/profile_images/1177267684574208000/54eG3WmW_400x400.jpg","description":"<h2>🧘 What we offer</h2> <ul><li><!--block-->Fully remote work environment – work from anywhere globally</li><li><!--block-->Competitive compensation in line with global benchmarks</li><li><!--block-->Potential to unlock equity compensation</li><li><!--block-->A minimum of four weeks of vacation per year</li><li><!--block-->Premium health insurance that travels with you</li><li><!--block-->Travel insurance any time you travel outside of your home country</li><li><!--block-->New laptop, home office allowance and more!</li></ul><div><!--block-->🚀 We look forward to hearing from you!</div> <div><!--block-->SafetyWing is looking for a <strong>Junior Account Executive </strong>to join our sales team. Your role will be pivotal in understanding the challenges of remote and distributed teams and our prospective client's unique needs and offering them insights and ideas to leverage our solutions effectively. You will be vital in expanding SafetyWing's impact.</div><div><!--block--><br></div><div><!--block--><strong>🚀 About SafetyWing</strong></div><div><!--block--><br></div><div><!--block-->We’re building a global social safety net for remote workers—simple health, insurance, and retirement products designed to replace national welfare systems. Our mission is to remove geographical borders as a barrier to equal opportunity and freedom for everyone. If we succeed, we believe this will be one of the most important tasks of our time.</div><div><!--block--><br></div><div><!--block-->We’re a fully remote team, stretching across 15+ timezones.</div> <h2>💻 Your responsibilities will include</h2>  <ul><li><!--block-->Getting to the heart of remote and geographically distributed teams' needs through helpful insights and consultative selling.</li><li><!--block-->Navigating the full sales cycle, from discovery and engagement to negotiation and closure.</li><li><!--block-->Using a consultative approach to pinpoint customer needs, crafting value-added propositions, and developing complex proposals.</li><li><!--block-->Guiding our customers to see the optimal value in our solutions, building consensus and enthusiasm.</li><li><!--block-->Proactively finding ways to tackle any deal-related obstacles.</li><li><!--block-->Keeping our CRM updated with the latest client info for top-notch planning and strategy.</li><li><!--block-->Gathering and integrating product feedback from clients to guide product enhancements.</li></ul> <h2>🌩 What you’ll do</h2> <ul><li><!--block-->Engage with interested prospects to help them evaluate our product</li><li><!--block-->Become a product and Remote Health benefits expert&nbsp;</li><li><!--block-->Ideate, test and iterate on new ways to position Remote Health as we go up-market</li><li><!--block-->Creatively problem-solve in a fast paced environment</li><li><!--block-->Work with our Account Management team to ensure a smooth hand-off and beautiful client experience&nbsp;</li><li><!--block-->Accurately forecast pipeline and manage pipeline in CRM</li><li><!--block-->Synthesize product feedback from clients to help inform product improvements</li></ul><div><!--block-->🧪 <strong>Qualifications</strong></div><ul><li><!--block-->2-3 years of sales experience or a background in engaging prospects and supporting sales cycles</li><li><!--block-->Passion for learning the full sales process, from discovery to closed won</li><li><!--block-->Experience in a fast-paced startup environment</li><li><!--block-->Excellent written and verbal skills</li><li><!--block-->Familiarity with CRM tools and the ability to manage pipelines effectively</li></ul><div><!--block-->😀 <strong>We like to work with people who</strong></div><ul><li><!--block-->Want to help build a global social safety net on the Internet</li><li><!--block-->Think for themselves instead of copying others</li><li><!--block-->Are willing to try new things, even with the risk of failure</li><li><!--block-->Are intellectually curious and open to new ideas</li><li><!--block-->Are creative and bold in the face of any problems</li><li><!--block-->Have strong integrity and do the right thing</li></ul>","tags":"[\"management\"]","pubDate":"2025-02-21T11:47:52.680Z","link":"https://safetywing.pinpointhq.com/en/jobs/309289","slug":"junior-account-executive-safetywing-8695"},{"id":6576549680,"title":"FP&A Analyst","company":"Circle","image":"https://media.licdn.com/dms/image/v2/D4E0BAQGsuyBYT8Wy1A/company-logo_200_200/company-logo_200_200/0/1709246393415/circleco_logo?e=1746662400&v=beta&t=KH2t1NJ7bcXknchnvYTCh2X0_q0BdXf-vERJqIz2p1k","description":"&lt;div class=&quot;content-intro&quot;&gt;&lt;h2&gt;About Us&lt;/h2&gt;\n&lt;p&gt;Circle is building the world’s leading all-in-one platform for online communities. We make it possible for creators, coaches, educators, and businesses to bring together their audience with engaging discussions, live streams, events, chat, courses, and payments — all in one place, all under their own brand.&lt;/p&gt;\n&lt;p&gt;We’re proud to be a fully remote company of around 170 (and growing!) team members from 30+ countries around the world. We seek exceptional individuals around the world, set them up to do the best work of their lives, and in turn, create a meaningful impact in their own lives. We don&#39;t track hours, but we do manage for high expectations very closely. We collaborate across time zones, are highly async, and like to document a lot.&lt;/p&gt;\n&lt;p&gt;Twice a year, we bring the whole company together in beautiful places around the world for our company offsites. So far, we’ve hosted offsites in Turkey, Portugal, Mexico, Thailand, Colombia, Italy, Ireland, and more, with still more to come!&lt;/p&gt;&lt;/div&gt;&lt;h2&gt;About the role&lt;/h2&gt;\n&lt;p&gt;We are looking for an FP&amp;amp;A Analyst to join our growing finance team at Circle. Over the past year, we’ve built a strong foundation of data and reporting that gives us critical visibility into our business.&lt;/p&gt;\n&lt;p&gt;This role will be instrumental in building dashboards, conducting ad-hoc analyses, supporting financial modeling, and providing decision support to stakeholders across the company. The FP&amp;amp;A Analyst will work closely with our FP&amp;amp;A lead and the Head of Finance, collaborating with teams across the organization to drive financial insights that shape our strategy.&lt;/p&gt;\n&lt;p&gt;This is an opportunity to work in a high-impact role, gain exposure to leadership, and develop deep technical and analytical skills in a fast-growing SaaS business.&lt;/p&gt;\n&lt;h2&gt;What you’ll be doing&lt;/h2&gt;\n&lt;ul&gt;\n&lt;li&gt;Work with BI tools to build dashboards and reports for key stakeholders across the company.&lt;/li&gt;\n&lt;li&gt;Perform ad-hoc analyses that support strategic decision-making and operational efficiency.&lt;/li&gt;\n&lt;li&gt;Support financial modeling efforts, including scenario analysis and maintaining our core financial model to reflect changes in business performance.&lt;/li&gt;\n&lt;li&gt;Collaborate cross-functionally with teams such as Sales, Marketing, Customer Success, Product, and Engineering to provide financial insights.&lt;/li&gt;\n&lt;li&gt;Identify and automate recurring reporting tasks to improve efficiency.&lt;/li&gt;\n&lt;li&gt;Support annual budgeting and and quarterly forecasting processes.&lt;/li&gt;\n&lt;/ul&gt;\n&lt;h2&gt;What you’ll need to be successful&lt;/h2&gt;\n&lt;ul&gt;\n&lt;li&gt;Strong alignment with our values. &lt;a href=&quot;https://www.notion.so/Circle-Careers-223a15ea312c4922b793593d07add7fe?pvs=21&quot;&gt;Find our values on our career page&lt;/a&gt; if you haven’t read up on them yet.&lt;/li&gt;\n&lt;li&gt;You are proficient in English (spoken, written, and reading) at a &lt;a href=&quot;https://magoosh.com/english-speaking/english-proficiency-levels-a-guide-to-determining-your-level/&quot;&gt;CEFR Level C2&lt;/a&gt; / &lt;a href=&quot;https://www.govtilr.org/&quot;&gt;ILR Level 5&lt;/a&gt;.&lt;/li&gt;\n&lt;li&gt;1-3 years of experience in FP&amp;amp;A, investment banking, consulting, or a related analytical field.&lt;/li&gt;\n&lt;li&gt;Experience working with BI tools such as Looker, Tableau, or Power BI.&lt;/li&gt;\n&lt;li&gt;Proficiency in Excel and financial modeling best practices.&lt;/li&gt;\n&lt;li&gt;Willingness to develop advanced technical skills (financial modeling, SQL, etc.).&lt;/li&gt;\n&lt;li&gt;Coachable, honest, accountable, and a self-starter.&lt;/li&gt;\n&lt;li&gt;Insatiable curiosity with a desire to understand how the business operates.&lt;/li&gt;\n&lt;li&gt;Strong business acumen and ability to translate financial insights into strategic actions.&lt;/li&gt;\n&lt;li&gt;High attention to detail and ability to work with large datasets.&lt;/li&gt;\n&lt;li&gt;Strong communication skills and ability to work cross-functionally with different teams.&lt;/li&gt;\n&lt;/ul&gt;\n&lt;h2&gt;Bonus points&lt;/h2&gt;\n&lt;ul&gt;\n&lt;li&gt;Experience in a high-growth tech environment (SaaS, Marketplace, Fintech, etc.).&lt;/li&gt;\n&lt;li&gt;SQL experience and ability to query databases for analysis.&lt;/li&gt;\n&lt;li&gt;Python experience for data analysis and automation.&lt;/li&gt;\n&lt;li&gt;Familiarity with SaaS metrics and subscription-based business models.&lt;/li&gt;\n&lt;/ul&gt;\n&lt;h2&gt;$80,000 - $100,000 USD per year&lt;/h2&gt;\n&lt;p&gt;&lt;em&gt;The cash compensation range shown is a starting point. In addition to equity, benefits and perks, your cash compensation is subject to an annual review and increase on a once per year basis.&lt;/em&gt;&lt;/p&gt;&lt;div class=&quot;content-conclusion&quot;&gt;&lt;h2&gt;The fun stuff&lt;/h2&gt;\n&lt;ul&gt;\n&lt;li&gt;Fully remote:&amp;nbsp;work from anywhere in the world!&lt;/li&gt;\n&lt;li&gt;Autonomy and trust to do your job:&amp;nbsp;we care about outcomes over everything else.&lt;/li&gt;\n&lt;li&gt;Paid time away:&amp;nbsp;all employees are given 35 days of PTO annually. We also offer a paid sabbatical after 5 years.&lt;/li&gt;\n&lt;li&gt;Generous U.S. benchmarked compensation&amp;nbsp;and startup equity no matter where you are in the world.*&lt;/li&gt;\n&lt;li&gt;Awesome medical coverage&amp;nbsp;with 100% coverage for you and your family, or medical reimbursement options where applicable!*&lt;/li&gt;\n&lt;li&gt;Parental leave&amp;nbsp;for parents expanding their family, or just starting one.&lt;/li&gt;\n&lt;li&gt;Home office stipend&amp;nbsp;to help you get up and running.&lt;/li&gt;\n&lt;li&gt;Learning &amp;amp; development stipend&amp;nbsp;to help you level up your professional skills.&lt;/li&gt;\n&lt;li&gt;Annual bonus potential&amp;nbsp;for roles that don&#39;t already receive variable income or commission.&lt;/li&gt;\n&lt;li&gt;Company retreats:&amp;nbsp;Twice a year, the Circle team gets together for a fully paid company retreat in incredible places around the world! We’ve had past retreats in Colombia, Portugal, and Mexico, with more planned on the horizon.&lt;/li&gt;\n&lt;li&gt;Check out our&amp;nbsp;&lt;a href=&quot;https://careers.circle.so/&quot;&gt;Careers&lt;/a&gt;&amp;nbsp;page for more.&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;&lt;span style=&quot;font-size: 10pt;&quot;&gt;*&lt;em&gt;Your role, location and unique circumstance may affect this.&lt;/em&gt;&lt;/span&gt;&lt;/p&gt;\n&lt;h3&gt;Diversity, Equity &amp;amp; Inclusion&lt;/h3&gt;\n&lt;p&gt;As a fully-remote international company, diversity is baked into our DNA. Here’s how our CEO, Sid Yadav, frames our hiring mission: “let’s find talent in underserved and under-represented corners of the world, set them up to do the best work of their lives, and in turn, change their life.” To achieve this hiring mission, we offer competitive&amp;nbsp;U.S. benchmarked&amp;nbsp;compensation no matter where someone’s located in the world, and we proactively seek candidates who expand representation of backgrounds, cultures and lived experiences in our teams.&lt;/p&gt;\n&lt;h3&gt;Equal Employment Opportunity&lt;/h3&gt;\n&lt;p&gt;Circle is an equal opportunity employer and as such, we do not discriminate on the basis of race, color, religion, sex, sexual orientation, gender identity, national origin, age, disability, or any other characteristic protected by applicable laws.&amp;nbsp;If you require any accommodations during the recruitment process, please let us know and we will work with you to meet your needs.&lt;/p&gt;\n&lt;div class=&quot;&quot;&gt;\n&lt;h3 class=&quot;&quot;&gt;How We Use Candidate Data&lt;/h3&gt;\n&lt;p&gt;At Circle, we are committed to protecting your personal information. As a job applicant, the personal data you provide to us is collected and processed in accordance with the&amp;nbsp;&lt;strong&gt;General Data Protection Regulation (GDPR)&lt;/strong&gt; in the EU and the &lt;strong&gt;California Consumer Privacy Act (CCPA)&lt;/strong&gt;. This notice outlines the types of personal information we collect, the purpose for collecting it, and your rights.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Information We Collect:&lt;/strong&gt; We collect the following categories of personal information from job applicants:&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;Contact information (such as name, email address, phone number)&lt;/li&gt;\n&lt;li&gt;Employment history and qualifications&lt;/li&gt;\n&lt;li&gt;Education history&lt;/li&gt;\n&lt;li&gt;References and any other information you choose to share with us during the application process&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;&lt;strong&gt;Purpose of Collection:&lt;/strong&gt; We collect this information for the following purposes:&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;To assess your qualifications and suitability for the position&lt;/li&gt;\n&lt;li&gt;To communicate with you during the recruitment process&lt;/li&gt;\n&lt;li&gt;To comply with legal and regulatory obligations&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;&lt;strong&gt;Your Rights Under GDPR and CCPA:&lt;/strong&gt; You have the following rights regarding your personal information:&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;The right to request access to the personal information we hold about you.&lt;/li&gt;\n&lt;li&gt;The right to request the deletion of your personal information, subject to certain legal exceptions.&lt;/li&gt;\n&lt;li&gt;The right to opt out of the sale of your personal information (Note: We do not sell personal information).&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;For more information about how we handle your personal data or to exercise your rights, please refer to our full &lt;a href=&quot;https://circle.so/privacy&quot; target=&quot;_blank&quot;&gt;Privacy Policy&lt;/a&gt;.&lt;/p&gt;\n&lt;p&gt;By submitting your application, you acknowledge that you have read and understood this privacy notice.&lt;/p&gt;\n&lt;/div&gt;&lt;/div&gt;","tags":"[\"finance\",\"engineering\",\"legal\",\"database\",\"aws\"]","pubDate":"2025-02-21T03:06:45.000Z","link":"https://job-boards.greenhouse.io/circleso/jobs/4552506008","slug":"fp-a-analyst-circle-2093"},{"id":2689654639,"title":"Website Coordinator (3-Month Contract)","company":"OneLocal","image":"https://photos.wellfound.com/startups/i/257661-3abe9f68928f2e0407dca967aca86e67-medium_jpg.jpg","description":"&lt;p&gt;OneLocal is looking to hire a &lt;strong&gt;Website Coordinator&lt;/strong&gt; on a &lt;strong&gt;3-month&lt;/strong&gt; contract basis to assist in the coordination and creation of new client sites. This role requires a keen eye for design, strong organizational skills, and a process-oriented mindset to ensure the seamless execution of site development and maintenance tasks.&lt;/p&gt;\n&lt;p&gt;&lt;strong data-stringify-type=&quot;bold&quot;&gt;Key Responsibilities:&lt;/strong&gt;&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;Drive design and architectural problem-solving for new client sites and features.&lt;/li&gt;\n&lt;li&gt;Manage and maintain websites, ensuring quality and consistency across all projects.&lt;/li&gt;\n&lt;li&gt;Perform QA on websites, troubleshooting and resolving technical issues.&lt;/li&gt;\n&lt;li&gt;Complete change requests efficiently while maintaining high-quality standards.&lt;/li&gt;\n&lt;li&gt;Oversee the day-to-day operations of site maintenance, including building, strategizing, and improving existing sites.&lt;/li&gt;\n&lt;li&gt;Ensure exceptional attention to detail and quality assurance for all deliverables.&lt;/li&gt;\n&lt;li&gt;Provide suggestions for potential improvements or additions to site templates and design tools.&lt;/li&gt;\n&lt;li&gt;Collaborate with the Content team to ensure design choices align with industry standards.&lt;/li&gt;\n&lt;li&gt;Educate and mentor team members on design/UI best practices, including accessibility and UX principles.&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;&lt;strong data-stringify-type=&quot;bold&quot;&gt;Qualifications:&lt;/strong&gt;&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;2-3 years of experience in website design and maintenance.&lt;/li&gt;\n&lt;li&gt;Previous experience working with WYSIWYG CMS platforms (WordPress, Wix, Squarespace, or others).&lt;/li&gt;\n&lt;li&gt;HTML, CSS, JavaScript.&amp;nbsp;&lt;/li&gt;\n&lt;li&gt;Experience with Elementor is an asset.&lt;/li&gt;\n&lt;li&gt;Experience working in fast-paced environments, preferably within the technology or startup sectors.&lt;/li&gt;\n&lt;li&gt;Detail-oriented with strong organizational skills and the ability to execute tasks with minimal supervision.&lt;/li&gt;\n&lt;li&gt;Impeccable communication skills, both verbal and written.&lt;/li&gt;\n&lt;li&gt;Ability to give and receive feedback effectively.&lt;/li&gt;\n&lt;li&gt;Experience working with website performance testing tools is an asset.&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;&lt;strong data-stringify-type=&quot;bold&quot;&gt;Nice to Have:&lt;/strong&gt;&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;Understanding of SEO best practices and WCAG 2.0 accessibility standards.&lt;/li&gt;\n&lt;li&gt;Design background.&amp;nbsp;&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;&lt;strong data-stringify-type=&quot;bold&quot;&gt;Time Commitment:&amp;nbsp;&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;This is a &lt;strong&gt;3-month contract&lt;/strong&gt; position with the potential for extension based on performance and business needs.&amp;nbsp;&lt;/p&gt;","tags":"[\"javascript\"]","pubDate":"2025-02-21T00:06:39.000Z","link":"https://boards.greenhouse.io/onelocal/jobs/5459322004","slug":"website-coordinator-3-month-contract-onelocal-597"},{"id":4788176504,"title":"Technical Support Engineer","company":"Fingerprint","image":"https://avatars.githubusercontent.com/u/67208791?s=200&v=4","description":"&lt;div class=&quot;content-intro&quot;&gt;&lt;p&gt;&lt;strong&gt;Fingerprint&lt;/strong&gt;&amp;nbsp;empowers developers to stop online fraud at the source.&lt;/p&gt;\n&lt;p&gt;We work on turning radical new ideas in the fraud detection space into reality. Our products are developer-focused and our clients range from solo developers to publicly traded companies.&amp;nbsp;&lt;strong&gt;We are a globally dispersed, 100% remote company&lt;/strong&gt; with a strong open-source focus. Our flagship open-source project is &lt;a class=&quot;c-link c-link--focus-visible&quot; href=&quot;https://github.com/fingerprintjs/fingerprintjs&quot; target=&quot;_blank&quot; data-stringify-link=&quot;https://github.com/fingerprintjs/fingerprintjs&quot; data-sk=&quot;tooltip_parent&quot;&gt;FingerprintJS&lt;/a&gt; (20K stars on GitHub).&lt;/p&gt;\n&lt;p&gt;&lt;a class=&quot;c-link c-link--focus-visible&quot; href=&quot;https://www.crunchbase.com/organization/fingerprintjs&quot; target=&quot;_blank&quot; data-stringify-link=&quot;https://www.crunchbase.com/organization/fingerprintjs&quot; data-sk=&quot;tooltip_parent&quot;&gt;We have raised $77M&amp;nbsp;&lt;/a&gt;and are backed by Craft Ventures (previously invested in&amp;nbsp;&lt;a class=&quot;c-link c-link--focus-visible&quot; href=&quot;https://www.tesla.com/&quot; target=&quot;_blank&quot; data-stringify-link=&quot;https://www.tesla.com/&quot; data-sk=&quot;tooltip_parent&quot;&gt;Tesla,&amp;nbsp;&lt;/a&gt;&lt;a class=&quot;c-link c-link--focus-visible&quot; href=&quot;https://facebook.com/&quot; target=&quot;_blank&quot; data-stringify-link=&quot;https://facebook.com/&quot; data-sk=&quot;tooltip_parent&quot;&gt;Facebook,&amp;nbsp;&lt;/a&gt;&lt;a class=&quot;c-link c-link--focus-visible&quot; href=&quot;https://www.airbnb.com/&quot; target=&quot;_blank&quot; data-stringify-link=&quot;https://www.airbnb.com/&quot; data-sk=&quot;tooltip_parent&quot;&gt;Airbnb&amp;nbsp;&lt;/a&gt;), Nexus Venture Partners (previously invested in &lt;a href=&quot;https://www.postman.com/&quot;&gt;Postman&lt;/a&gt;, &lt;a href=&quot;https://www.apollo.io/&quot;&gt;Apollo.io,&lt;/a&gt; &lt;a href=&quot;https://min.io/&quot;&gt;MinIO&lt;/a&gt;, Druva)&amp;nbsp;and Uncorrelated Ventures (previously invested in&amp;nbsp;&lt;a class=&quot;c-link c-link--focus-visible&quot; href=&quot;https://redis.io/&quot; target=&quot;_blank&quot; data-stringify-link=&quot;https://redis.io/&quot; data-sk=&quot;tooltip_parent&quot;&gt;Redis,&amp;nbsp;&lt;/a&gt;&lt;a class=&quot;c-link c-link--focus-visible&quot; href=&quot;https://rollbar.com/&quot; target=&quot;_blank&quot; data-stringify-link=&quot;https://rollbar.com/&quot; data-sk=&quot;tooltip_parent&quot;&gt;Rollbar&amp;nbsp;&lt;/a&gt;&amp;amp;&lt;a class=&quot;c-link c-link--focus-visible&quot; href=&quot;https://gradle.org/&quot; target=&quot;_blank&quot; data-stringify-link=&quot;https://gradle.org/&quot; data-sk=&quot;tooltip_parent&quot;&gt;&amp;nbsp;Gradle&lt;/a&gt;).&lt;/p&gt;\n&lt;p&gt;&lt;em&gt;We have noticed a rise in recruiting impersonations across the industry, where scammers attempt to access candidates&#39; personal and financial information through fake interviews and offers. All Fingerprint recruiting email communications will always come from the @fingerprint domain. Any outreach claiming to be from Fingerprint via other sources should be ignored.&lt;/em&gt;&lt;/p&gt;&lt;/div&gt;&lt;p data-start=&quot;194&quot; data-end=&quot;372&quot;&gt;Are you passionate about web technologies and skilled in JavaScript? Do you enjoy solving technical challenges and helping customers succeed? If so, we’d love to hear from you!&lt;/p&gt;\n&lt;p data-start=&quot;374&quot; data-end=&quot;818&quot;&gt;Fingerprint is looking for a &lt;strong data-start=&quot;403&quot; data-end=&quot;433&quot;&gt;Technical Support Engineer&lt;/strong&gt; to join our &lt;strong data-start=&quot;446&quot; data-end=&quot;471&quot;&gt;Customer Success team&lt;/strong&gt;. In this role, you&#39;ll be a key partner to our customers, helping them troubleshoot issues, integrate our API seamlessly, and maximize the value of our technology. You’ll work closely with the &lt;strong data-start=&quot;664&quot; data-end=&quot;703&quot;&gt;Senior Director of Customer Success&lt;/strong&gt;, as well as cross-functional teams, to ensure customers have a smooth and positive experience with our platform.&lt;/p&gt;\n&lt;h3 data-start=&quot;820&quot; data-end=&quot;844&quot;&gt;&lt;strong data-start=&quot;824&quot; data-end=&quot;842&quot;&gt;What You’ll Do&lt;/strong&gt;&lt;/h3&gt;\n&lt;h4 data-start=&quot;846&quot; data-end=&quot;893&quot;&gt;&lt;strong data-start=&quot;851&quot; data-end=&quot;891&quot;&gt;Technical Support &amp;amp; Issue Resolution&lt;/strong&gt;&lt;/h4&gt;\n&lt;ul data-start=&quot;894&quot; data-end=&quot;1227&quot;&gt;\n&lt;li data-start=&quot;894&quot; data-end=&quot;1052&quot;&gt;Serve as the primary technical contact for self-serve customers, responding to inquiries, troubleshooting issues, and providing solutions through Zendesk.&lt;/li&gt;\n&lt;li data-start=&quot;1053&quot; data-end=&quot;1135&quot;&gt;Analyze internal logs to diagnose and resolve customer challenges efficiently.&lt;/li&gt;\n&lt;li data-start=&quot;1136&quot; data-end=&quot;1227&quot;&gt;Monitor API usage and performance to proactively identify and address potential issues.&lt;/li&gt;\n&lt;/ul&gt;\n&lt;h4 data-start=&quot;1229&quot; data-end=&quot;1273&quot;&gt;&lt;strong data-start=&quot;1234&quot; data-end=&quot;1271&quot;&gt;Customer Onboarding &amp;amp; Integration&lt;/strong&gt;&lt;/h4&gt;\n&lt;ul data-start=&quot;1274&quot; data-end=&quot;1525&quot;&gt;\n&lt;li data-start=&quot;1274&quot; data-end=&quot;1421&quot;&gt;Guide customers through the integration of our APIs into their web and mobile applications via written communication and live working sessions.&lt;/li&gt;\n&lt;li data-start=&quot;1422&quot; data-end=&quot;1525&quot;&gt;Ensure customers have the resources and support they need to successfully implement our technology.&lt;/li&gt;\n&lt;/ul&gt;\n&lt;h4 data-start=&quot;1527&quot; data-end=&quot;1567&quot;&gt;&lt;strong data-start=&quot;1532&quot; data-end=&quot;1565&quot;&gt;JavaScript &amp;amp; API Optimization&lt;/strong&gt;&lt;/h4&gt;\n&lt;ul data-start=&quot;1568&quot; data-end=&quot;1779&quot;&gt;\n&lt;li data-start=&quot;1568&quot; data-end=&quot;1703&quot;&gt;Provide technical guidance by creating sample code snippets and offering tailored recommendations to improve customer integrations.&lt;/li&gt;\n&lt;li data-start=&quot;1704&quot; data-end=&quot;1779&quot;&gt;Develop automation scripts for API testing, validation, and monitoring.&lt;/li&gt;\n&lt;/ul&gt;\n&lt;h4 data-start=&quot;1781&quot; data-end=&quot;1825&quot;&gt;&lt;strong data-start=&quot;1786&quot; data-end=&quot;1823&quot;&gt;Customer Training &amp;amp; Documentation&lt;/strong&gt;&lt;/h4&gt;\n&lt;ul data-start=&quot;1826&quot; data-end=&quot;2166&quot;&gt;\n&lt;li data-start=&quot;1826&quot; data-end=&quot;1925&quot;&gt;Create and maintain clear, user-friendly documentation to support self-service troubleshooting.&lt;/li&gt;\n&lt;li data-start=&quot;1926&quot; data-end=&quot;2053&quot;&gt;Collaborate with the &lt;strong data-start=&quot;1949&quot; data-end=&quot;1980&quot;&gt;Product Enablement Engineer&lt;/strong&gt; to enhance onboarding, retention, and growth strategies for customers.&lt;/li&gt;\n&lt;li data-start=&quot;2054&quot; data-end=&quot;2166&quot;&gt;Act as a bridge between customers and the &lt;strong data-start=&quot;2098&quot; data-end=&quot;2114&quot;&gt;Product team&lt;/strong&gt;, sharing insights to inform product improvements.&lt;/li&gt;\n&lt;/ul&gt;\n&lt;h3 data-start=&quot;2168&quot; data-end=&quot;2200&quot;&gt;&lt;strong data-start=&quot;2172&quot; data-end=&quot;2198&quot;&gt;What We’re Looking For&lt;/strong&gt;&lt;/h3&gt;\n&lt;ul data-start=&quot;2202&quot; data-end=&quot;2820&quot;&gt;\n&lt;li data-start=&quot;2202&quot; data-end=&quot;2305&quot;&gt;Experience in a &lt;strong data-start=&quot;2220&quot; data-end=&quot;2280&quot;&gt;technical support, customer success, or engineering role&lt;/strong&gt; (2-3 years preferred).&lt;/li&gt;\n&lt;li data-start=&quot;2306&quot; data-end=&quot;2407&quot;&gt;Strong proficiency in &lt;strong data-start=&quot;2330&quot; data-end=&quot;2344&quot;&gt;JavaScript&lt;/strong&gt;, with experience writing and maintaining automation scripts.&lt;/li&gt;\n&lt;li data-start=&quot;2408&quot; data-end=&quot;2486&quot;&gt;Understanding of &lt;strong data-start=&quot;2427&quot; data-end=&quot;2483&quot;&gt;API concepts, RESTful architecture, and web services&lt;/strong&gt;.&lt;/li&gt;\n&lt;li data-start=&quot;2487&quot; data-end=&quot;2624&quot;&gt;Excellent &lt;strong data-start=&quot;2499&quot; data-end=&quot;2539&quot;&gt;problem-solving and debugging skills&lt;/strong&gt;, with the ability to analyze technical challenges and propose effective solutions.&lt;/li&gt;\n&lt;li data-start=&quot;2625&quot; data-end=&quot;2730&quot;&gt;Strong &lt;strong data-start=&quot;2634&quot; data-end=&quot;2658&quot;&gt;communication skills&lt;/strong&gt;, with the ability to explain technical concepts to diverse audiences.&lt;/li&gt;\n&lt;li data-start=&quot;2731&quot; data-end=&quot;2820&quot;&gt;Self-motivated, proactive, and comfortable working independently and collaboratively.&lt;/li&gt;\n&lt;/ul&gt;\n&lt;h3 data-start=&quot;2822&quot; data-end=&quot;2878&quot;&gt;&lt;strong data-start=&quot;2826&quot; data-end=&quot;2876&quot;&gt;Bonus Points (Not Required, but Nice to Have!)&lt;/strong&gt;&lt;/h3&gt;\n&lt;ul data-start=&quot;2879&quot; data-end=&quot;3010&quot;&gt;\n&lt;li data-start=&quot;2879&quot; data-end=&quot;2936&quot;&gt;Experience with &lt;strong data-start=&quot;2897&quot; data-end=&quot;2918&quot;&gt;API testing tools&lt;/strong&gt; and frameworks.&lt;/li&gt;\n&lt;li data-start=&quot;2937&quot; data-end=&quot;2980&quot;&gt;Exposure to &lt;strong data-start=&quot;2951&quot; data-end=&quot;2977&quot;&gt;mobile app development&lt;/strong&gt;.&lt;/li&gt;\n&lt;li data-start=&quot;2981&quot; data-end=&quot;3010&quot;&gt;Familiarity with &lt;strong data-start=&quot;3000&quot; data-end=&quot;3007&quot;&gt;SQL&lt;/strong&gt;.&lt;/li&gt;\n&lt;/ul&gt;&lt;div class=&quot;content-conclusion&quot;&gt;&lt;p&gt;&lt;em&gt;We have noticed a rise in recruiting impersonations across the industry, where scammers attempt to access candidates&#39; personal and financial information through fake interviews and offers. All Fingerprint recruiting email communications will always come from the @fingerprint domain. Any outreach claiming to be from Fingerprint via other sources should be ignored.&lt;/em&gt;&lt;/p&gt;\n&lt;p&gt;Offers vary depending on, but not limited to, relevant experience, education, certifications/licenses, skills, training, and market conditions.&amp;nbsp;&lt;/p&gt;\n&lt;p&gt;Due to regulatory and security reasons, there’s a small number of countries where we cannot have Fingerprint teammates based.&amp;nbsp;&lt;strong data-stringify-type=&quot;bold&quot;&gt;Additionally, because Fingerprint is an all-remote company and people can join our workforce from almost any country, we do not sponsor visas. Fingerprint teammates need to be authorized to work from their home location&lt;/strong&gt;.&lt;/p&gt;\n&lt;p&gt;We are dedicated to creating an inclusive work environment for everyone. We embrace and celebrate the unique experiences, perspectives and cultural backgrounds that each employee brings to our workplace. Fingerprint strives to foster an environment where our employees feel respected, valued and empowered, and our team members are at the forefront in helping us promote and sustain an inclusive workplace. We highly encourage people from underrepresented groups in tech to apply.&lt;/p&gt;\n&lt;p&gt;If you are applying as a resident of California, please read our CCPA notice &lt;a href=&quot;https://dev.fingerprint.com/docs/dpa-ccpa&quot; target=&quot;_blank&quot;&gt;here&lt;/a&gt;&lt;/p&gt;\n&lt;p&gt;If you are applying as a resident of the EU, please read our GDPR notice &lt;a href=&quot;https://dev.fingerprint.com/docs/dpa-gdpr&quot; target=&quot;_blank&quot;&gt;here&lt;/a&gt;&lt;/p&gt;&lt;/div&gt;","tags":"[\"javascript\",\"engineering\"]","pubDate":"2025-02-20T19:38:09.000Z","link":"https://fingerprint.com/careers/jobs/apply/?gh_jid=5458690004","slug":"technical-support-engineer-fingerprint-4902"},{"id":2510935825,"title":"Software Engineer - Graph [IC3]","company":"Sourcegraph","image":"https://avatars.githubusercontent.com/u/3979584?s=200&v=4","description":"&lt;div class=&quot;content-intro&quot;&gt;&lt;h2&gt;&lt;span style=&quot;color: rgb(243, 78, 63);&quot;&gt;&lt;strong&gt;Who we are&lt;/strong&gt;&lt;/span&gt;&lt;/h2&gt;\n&lt;p&gt;Our mission at Sourcegraph is to make it so that &lt;a href=&quot;https://www.notion.so/sourcegraph/Mission-values-e9d37e6b972a4ef395c3076aea2bd07d?pvs=4&quot;&gt;everyone can code&lt;/a&gt;, not just ~0.1% of the population.&amp;nbsp;&lt;/p&gt;\n&lt;p&gt;We are transforming how the world’s most important companies build software by industrializing development with AI. Today, most professional developers spend a disproportionate amount of time understanding code and performing repetitive, low-level tasks—leaving less time for innovation and meaningful impact.&lt;/p&gt;\n&lt;p&gt;We’re changing that. Sourcegraph brings AI-powered search and agents to the enterprise, helping teams automate the mundane and amplify what developers do best— solving hard problems and creating great products.&lt;/p&gt;\n&lt;p&gt;Here’s how we’re making a difference:&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;&lt;strong&gt;Accelerating developers &lt;/strong&gt;with AI agents that deliver insights and precision—enabling 5x faster test creation, 30% increase in merge requests, and saving 20 minutes per developer daily.&lt;/li&gt;\n&lt;li&gt;&lt;strong&gt;Automating repetitive tasks,&lt;/strong&gt; from remediating vulnerabilities (saving teams 1,000+ hours annually) to speeding up migrations that would take years to months.&amp;nbsp;&lt;/li&gt;\n&lt;li&gt;&lt;strong&gt;Enabling innovation&lt;/strong&gt; by addressing complex problems like automated bug triage, vulnerability detection, and AI-driven code reviews seamlessly integrated into workflows.&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;Trusted by 7/10 top software companies by market cap, 4/6 top US banks and many of the companies leading global innovation, like Stripe, Indeed, Tesla, and 1Password, and with $225M in funding from investors like &lt;a href=&quot;https://techcrunch.com/2021/07/13/sourcegraph-raises-125m-series-d-on-2-6b-valuation-for-universal-code-search-tool/&quot;&gt;a16z&lt;/a&gt;, &lt;a href=&quot;https://about.sourcegraph.com/blog/series-c-with-sequoia/&quot;&gt;Sequoia&lt;/a&gt;, and &lt;a href=&quot;https://www.redpoint.com/companies/sourcegraph/&quot;&gt;Redpoint&lt;/a&gt;, we are building the tools that will define the next era of enterprise software development.&lt;/p&gt;\n&lt;p&gt;If you’re passionate about solving the hardest problems in software and shaping the future of technology, join us. Let’s build something extraordinary together.&lt;/p&gt;&lt;/div&gt;&lt;h2&gt;&lt;span style=&quot;color: rgb(243, 78, 63);&quot;&gt;&lt;strong&gt;Hours &amp;amp; location&lt;/strong&gt;&lt;/span&gt;&lt;/h2&gt;\n&lt;p&gt;🌎&amp;nbsp; While we are an all-remote company and hire &lt;a href=&quot;https://sourcegraph.notion.site/How-we-engage-talent-outside-of-the-US-218f7193695a46cbb1ef39ef9c1f72d4&quot;&gt;almost anywhere&lt;/a&gt; in the world, we have a preference for someone to reside in the following locations for this role. However, if you feel qualified, we welcome you to apply regardless of location. No matter what, working hours must overlap with UTC +8 for at least 8 hours/week.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Preferred locations:&lt;/strong&gt;&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;Remote, European timezone&amp;nbsp;&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;We do not subscribe to “I do my best work when I work 40 hours a week.” &amp;nbsp;People we hire at Sourcegraph believe that building outstanding things means working very hard — smarter and more hours than the competition.&lt;/p&gt;\n&lt;h2&gt;&lt;span style=&quot;color: rgb(243, 78, 63);&quot;&gt;&lt;strong&gt;Why this job is exciting&amp;nbsp;&lt;/strong&gt;&lt;/span&gt;&lt;/h2&gt;\n&lt;p&gt;As a software engineer on the Graph team at Sourcegraph, you will play a key role in improving how developers understand and navigate complex codebases. Your main contributions will include building advanced compiler-type indexers and robust backend APIs and services. This role requires a mix of skills in distributed systems, end-to-end development, database optimization and programming language specifics.&amp;nbsp;&lt;/p&gt;\n&lt;p&gt;You’ll be part of a small but impactful team that is essential to the developer experience worldwide. We value innovation, collaboration, and continuous learning. You’ll have the chance to work on cutting-edge technology challenges and make a real difference in the software development community. We seek an engineer who is passionate about advancing the industry standard for engineering productivity by helping engineers understand codebases faster and creating world-class context for AI.&lt;/p&gt;\n&lt;p&gt;📅 Within one month, you will…&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;Actively drive bug fixes and small enhancements in both our code indexer and backend APIs&lt;/li&gt;\n&lt;li&gt;Embed in the teams processes and partner with team members to learn and make immediate impact&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;📅 Within three months, you will…&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;Develop and maintain compiler integrations and distributed systems primarily using Go, focusing on scalability and reliability across multiple programming languages.&lt;/li&gt;\n&lt;li&gt;Actively shape the direction and participate in the planning of the features we&#39;re going to build&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;📅 Within six months, you will…&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;Driving significant features such as cross-language precise navigation, dependency graph analysis or auto-inference of how to build and compile customer projects automatically.&lt;/li&gt;\n&lt;li&gt;Make a significant impact by being a key contributor and help us improve our existing engineering practices.&lt;/li&gt;\n&lt;li&gt;Feel confident working more autonomously, leaning into our values, especially customer-driven, teamwork and high agency.&lt;/li&gt;\n&lt;/ul&gt;\n&lt;h2&gt;&lt;span style=&quot;color: rgb(243, 78, 63);&quot;&gt;&lt;strong&gt;About you&lt;/strong&gt;&lt;/span&gt;&lt;/h2&gt;\n&lt;ul&gt;\n&lt;li&gt;Strong background in software engineering with a particular interest in compilers, databases, and distributed systems.&lt;/li&gt;\n&lt;li&gt;Experience with or willingness to learn Go, and a demonstrated ability to become proficient in new technologies.&lt;/li&gt;\n&lt;li&gt;Prior involvement with small teams that manage a wide surface area of functionality is highly desirable.&lt;/li&gt;\n&lt;li&gt;Appreciation for deep dives into specific technical silos, with the capability to contribute effectively to broad architectural discussions and decisions.&lt;/li&gt;\n&lt;li&gt;Exposure to distributed system design and a solid understanding of its challenges and intricacies.&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;Nice to haves:&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;Familiarity with compiler construction or integration is a significant plus.&lt;/li&gt;\n&lt;/ul&gt;\n&lt;h2&gt;&lt;span style=&quot;color: rgb(243, 78, 63);&quot;&gt;&lt;strong&gt;Level&lt;/strong&gt;&lt;/span&gt;&lt;/h2&gt;\n&lt;p&gt;📊 This job is an IC3.&amp;nbsp; You can read more about &lt;a href=&quot;https://www.notion.so/sourcegraph/Leveling-Guide-0e1b5c76ada64b9caac387f8b7c4fc66&quot;&gt;our job leveling philosophy&lt;/a&gt; in our Handbook.&lt;/p&gt;\n&lt;h2&gt;&lt;span style=&quot;color: rgb(243, 78, 63);&quot;&gt;&lt;strong&gt;Compensation&lt;/strong&gt;&lt;/span&gt;&lt;/h2&gt;\n&lt;p&gt;&lt;strong&gt;💸 We pay you an above-average salary&lt;/strong&gt; because we want to hire the best people who are fully focused on helping Sourcegraph succeed, not worried about paying bills. As an &lt;a href=&quot;https://sourcegraph.notion.site/Mission-values-e9d37e6b972a4ef395c3076aea2bd07d&quot;&gt;open and transparent&lt;/a&gt; company that values &lt;a href=&quot;https://www.notion.so/sourcegraph/Compensation-Pay-Transparency-at-Sourcegraph-d58d0774f51b4b489d41c3628d30ff8d?pvs=4&quot;&gt;competitive compensation&lt;/a&gt;, our compensation ranges are visible to every single Sourcegraph teammate.&lt;/p&gt;\n&lt;p&gt;Your salary is determined by your pay band for the IC3 &amp;nbsp;job level. For determining pay bands, we use a number of market and data-driven salary sources, along with your location zone, and target the high-end of the range to ensure we’re always paying above market regardless of where you live in the world. Both U.S. and international locations are divided into one of four zones, determined by the cost of labor index for each area. The salary for a successful candidate will be based on level, job-related skills, experience, qualifications, and location zone. Please note that the salaries below may be adjusted in the future.&lt;/p&gt;\n&lt;p&gt;💰 The target compensation for this role is based on the IC3 pay band for your zone. The start of the IC3 pay band for each zone is listed below:&lt;/p&gt;\n&lt;p&gt;Zone 1: $170,000 USD&lt;br&gt;Zone 2: $136,000 USD&lt;br&gt;Zone 3: $102,000 USD&lt;br&gt;Zone 4: $68,000 USD&lt;/p&gt;\n&lt;p&gt;Please speak with a recruiter for additional information regarding zone locations.&lt;/p&gt;\n&lt;p&gt;📈 In addition to our cash compensation, we offer equity (because when we succeed as a company, we want you to succeed, too) and generous &lt;a href=&quot;https://sourcegraph.notion.site/Benefits-Perks-dd1da4b6b3a64780abed010a144d34ba&quot;&gt;perks &amp;amp; benefits&lt;/a&gt;.&lt;/p&gt;\n&lt;h2&gt;&lt;span style=&quot;color: rgb(243, 78, 63);&quot;&gt;&lt;strong&gt;Interview process&lt;/strong&gt;&lt;/span&gt;&lt;/h2&gt;\n&lt;p&gt;&lt;em&gt;Below is the interview process you can expect for this role (you can read more about &lt;/em&gt;&lt;a href=&quot;https://sourcegraph.notion.site/Types-of-interviews-f279f080583d49ee9f2c60e30c8cb1f7&quot;&gt;&lt;em&gt;the types of interviews&lt;/em&gt;&lt;/a&gt;&lt;em&gt; in our Handbook). It may look like a lot of steps, but rest assured that we move quickly and the steps are designed to help you get the information needed to determine if we’re the right fit for you… Interviewing is a two-way street, after all!&amp;nbsp;&lt;/em&gt;&lt;/p&gt;\n&lt;p&gt;We expect the interview process to take ~6 hours in total.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;👋 Introduction Stage&lt;/strong&gt; - we have initial conversations to get to know you better…&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;[30m]&lt;a href=&quot;https://www.notion.so/sourcegraph/Types-of-interviews-sample-questions-f279f080583d49ee9f2c60e30c8cb1f7?pvs=4#99be5ff628b2414194a0ba79d9f25f13&quot;&gt; Recruiter Screen&lt;/a&gt;&lt;/li&gt;\n&lt;li&gt;[20m]&lt;a href=&quot;https://sourcegraph.notion.site/Resources-for-Candidates-Engineering-Interview-Process-c37a70dea5794085bee0c0818c9ef0b3#6a6deb280d374652b21d5aa3061c82d2&quot;&gt; Hiring Manager Intro&lt;/a&gt;&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;&lt;strong&gt;🧑‍💻 Team Interview Stage&lt;/strong&gt; - we then schedule an all-day onsite interview to delve into your experience in more depth and introduce you to members of the team, including cross-functional partners…&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;[60m] &lt;a href=&quot;https://sourcegraph.notion.site/Resources-for-Candidates-Engineering-Interview-Process-c37a70dea5794085bee0c0818c9ef0b3#e83edd987754460e839138a4bbfd592e&quot;&gt;Coding Exercise&lt;/a&gt;&lt;/li&gt;\n&lt;li&gt;[60m] &lt;a href=&quot;https://www.notion.so/sourcegraph/Resources-for-Candidates-Engineering-Interview-Process-c37a70dea5794085bee0c0818c9ef0b3?pvs=4#e83edd987754460e839138a4bbfd592e&quot;&gt;Coding Exercise&lt;/a&gt;&lt;/li&gt;\n&lt;li&gt;[60m] &lt;a href=&quot;https://www.notion.so/sourcegraph/Resources-for-Candidates-Engineering-Interview-Process-c37a70dea5794085bee0c0818c9ef0b3?pvs=4#b37f3b535e894775b9c64f53675b5549&quot;&gt;System Design&lt;/a&gt;&lt;/li&gt;\n&lt;li&gt;[45m]&lt;a href=&quot;https://sourcegraph.notion.site/Resources-for-Candidates-Engineering-Interview-Process-c37a70dea5794085bee0c0818c9ef0b3#da568e7854bb4aaa9b027157088e2d71&quot;&gt; Technical Screen / Resume Deep Dive&lt;/a&gt;&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;&lt;strong&gt;🎉 Final Interview Stage &lt;/strong&gt;- we move you to our final round, where you gain a better understanding of our business and values holistically…&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;[45m]&lt;a href=&quot;https://sourcegraph.notion.site/Types-of-interviews-sample-questions-f279f080583d49ee9f2c60e30c8cb1f7#cb00697e95304550a146c32563c0255d&quot;&gt; Cross-functional Team Collaboration Interview&lt;/a&gt; /&lt;a href=&quot;https://www.notion.so/sourcegraph/Types-of-interviews-sample-questions-f279f080583d49ee9f2c60e30c8cb1f7?pvs=4#e3a04291743048df87541a88aa8199dd&quot;&gt; Values Interview&lt;/a&gt;&lt;/li&gt;\n&lt;li&gt;[15m]&lt;a href=&quot;https://www.notion.so/sourcegraph/How-to-work-with-Quinn-Slack-CEO-807673e0864d473f959cc4efd9642a5a?pvs=4#6f185c0e2011411eac5be9c675f9056c&quot;&gt; Leadership&lt;/a&gt; with a co-founder&amp;nbsp;&lt;/li&gt;\n&lt;li&gt;We check references and conduct your background check&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;Please note - you are welcome to request additional conversations with anyone you would like to meet, but didn’t get to meet during the interview process.&lt;/p&gt;&lt;div class=&quot;content-conclusion&quot;&gt;&lt;h2&gt;&lt;span style=&quot;color: rgb(243, 78, 63);&quot;&gt;&lt;strong&gt;Learn more about us&lt;/strong&gt;&lt;/span&gt;&lt;/h2&gt;\n&lt;p&gt;You can learn more about what it is like to work at Sourcegraph by reading &lt;a href=&quot;https://sourcegraph.notion.site/d7614e3e9dc04c09ac2d42d57f1816e6?v=2a6d426dbae14390b155120b0c029ce0&quot;&gt;our handbook&lt;/a&gt;.&lt;/p&gt;\n&lt;p&gt;We are an ambitious team who are collectively working hard to build the most influential company in the world.&amp;nbsp; You can read more about our &lt;a href=&quot;https://sourcegraph.notion.site/What-it-s-like-working-at-Sourcegraph-119a8e11265880b18911eee4d9b7c460#119a8e1126588062b935fc66104b6115&quot;&gt;culture&lt;/a&gt;, &lt;a href=&quot;https://sourcegraph.notion.site/Compensation-Pay-Transparency-at-Sourcegraph-d58d0774f51b4b489d41c3628d30ff8d?pvs=74&quot;&gt;competitive compensation&lt;/a&gt; and &lt;a href=&quot;https://sourcegraph.notion.site/Benefits-Perks-dd1da4b6b3a64780abed010a144d34ba?pvs=74&quot;&gt;benefits&lt;/a&gt; here.&lt;/p&gt;\n&lt;p&gt;Sourcegraph is an equal opportunity workplace; we welcome people from all backgrounds.&amp;nbsp;&lt;/p&gt;\n&lt;p&gt;&lt;em&gt;Sourcegraph participates in &lt;/em&gt;&lt;a href=&quot;https://sourcegraph.notion.site/E-Verify-2ab3286dde3446d6bac2898c83610107&quot;&gt;&lt;em&gt;E-Verify&lt;/em&gt;&lt;/a&gt;&lt;em&gt; for U.S. Employees. &lt;/em&gt;&lt;/p&gt;&lt;/div&gt;","tags":"[\"engineering\",\"database\"]","pubDate":"2025-02-20T18:31:08.000Z","link":"https://job-boards.greenhouse.io/sourcegraph91/jobs/5451636004","slug":"software-engineer-graph-ic3-sourcegraph-3307"},{"id":1421765605,"title":"Senior Content Marketing Manager","company":"Synthflow","image":"https://pbs.twimg.com/profile_images/1879924055165272064/o-V7OZKb_400x400.jpg","description":"<p style=\"min-height:1.5em\">At Synthflow, we’re building the easiest way for businesses to create AI-powered phone agents. We’re looking for a <strong>Senior Content Marketing Manager</strong> to own and execute our content strategy, creating high-impact materials that engage enterprise customers, support sales, and strengthen our brand. This is an exciting opportunity to shape how we communicate with the market while working closely with cross-functional teams.</p><p style=\"min-height:1.5em\"></p><p style=\"min-height:1.5em\"><strong>What You’ll Do</strong></p><ul style=\"min-height:1.5em\"><li><p style=\"min-height:1.5em\"><strong>Lead Thought Leadership &amp; Enterprise Content</strong></p><ul style=\"min-height:1.5em\"><li><p style=\"min-height:1.5em\">Write and develop <strong>white papers, case studies, and research-backed reports</strong> to position Synthflow as an industry leader.</p></li><li><p style=\"min-height:1.5em\">Craft compelling content that supports enterprise sales, including <strong>sales collateral, one-pagers, and pitch decks</strong>.</p></li></ul></li><li><p style=\"min-height:1.5em\"><strong>Own LinkedIn Content &amp; Executive Positioning</strong></p><ul style=\"min-height:1.5em\"><li><p style=\"min-height:1.5em\">Manage content creation for our LinkedIn company page, ensuring consistent, engaging, and thought-provoking posts.</p></li><li><p style=\"min-height:1.5em\">Collaborate with leadership to craft personal LinkedIn content that establishes our executives as key voices in the AI industry.</p></li></ul></li><li><p style=\"min-height:1.5em\"><strong>Support Sales &amp; Demand Generation</strong></p><ul style=\"min-height:1.5em\"><li><p style=\"min-height:1.5em\">Work closely with sales and marketing teams to develop <strong>high-value content</strong> that nurtures leads and accelerates the enterprise sales cycle.</p></li><li><p style=\"min-height:1.5em\">Create compelling <strong>customer case studies</strong> that highlight success stories and business impact.</p></li></ul></li><li><p style=\"min-height:1.5em\"><strong>Work Closely with Design</strong></p><ul style=\"min-height:1.5em\"><li><p style=\"min-height:1.5em\">Collaborate with designers to develop visually engaging content, including infographics, eBooks, and multimedia assets.</p></li><li><p style=\"min-height:1.5em\">Ensure brand consistency across all marketing materials.</p></li></ul></li></ul><p style=\"min-height:1.5em\"></p><p style=\"min-height:1.5em\"><strong>What We’re Looking For</strong></p><ul style=\"min-height:1.5em\"><li><p style=\"min-height:1.5em\"><strong>5+ years of experience in content marketing, B2B marketing, or enterprise sales enablement.</strong></p></li><li><p style=\"min-height:1.5em\">Proven ability to create high-quality <strong>white papers, case studies, and long-form content.</strong></p></li><li><p style=\"min-height:1.5em\">Experience writing for LinkedIn and optimizing content for engagement.</p></li><li><p style=\"min-height:1.5em\">Strong storytelling skills with the ability to simplify complex topics.</p></li><li><p style=\"min-height:1.5em\">Excellent collaboration skills and experience working cross-functionally with sales, design, and product teams.</p></li><li><p style=\"min-height:1.5em\"><strong>Bonus:</strong> Experience in AI, SaaS, or B2B technology industries.</p></li></ul>","tags":"[\"b2b\"]","pubDate":"2025-02-20T13:15:41.272Z","link":"https://jobs.ashbyhq.com/synthflow/9fbbd9c7-9552-4bca-90c3-157a366c16bc","slug":"senior-content-marketing-manager-synthflow-9381"},{"id":5201597247,"title":"Growth Marketing Manager","company":"Synthflow","image":"https://pbs.twimg.com/profile_images/1879924055165272064/o-V7OZKb_400x400.jpg","description":"<p style=\"min-height:1.5em\"><strong>Location: </strong>Remote </p><p style=\"min-height:1.5em\"><strong>Type: </strong>Full-Time </p><p style=\"min-height:1.5em\"><strong>Salary:</strong> 60,000-100,000 USD, depending on experience and location</p><p style=\"min-height:1.5em\"><strong>About Synthflow:</strong><br />At Synthflow, we’re building the easiest way for businesses to create AI-powered phone agents. We’re early, fast-growing, and laser-focused on making a massive impact. Our mission is to empower businesses to thrive by simplifying complex AI workflows. Join us to do the best work of your career while helping shape the future of AI-driven communication.</p><p style=\"min-height:1.5em\"><strong>The Role:</strong><br />We’re looking for a <strong>Growth Marketing Manager</strong> to work across Growth, Lifecycle, and Product Marketing to help drive our product’s branding, positioning, and messaging. You’ll <strong>own</strong> key areas like email communications, community building, influencer marketing, and content creation.</p><p style=\"min-height:1.5em\">This is a unique opportunity to join a fast-paced, early-stage startup and make a tangible impact on our trajectory. If you’re passionate about growth, love working at the intersection of marketing and product, and thrive in a dynamic environment, we want to hear from you.</p><p style=\"min-height:1.5em\"><strong>What You’ll Do:</strong></p><ul style=\"min-height:1.5em\"><li><p style=\"min-height:1.5em\"><strong>Own Community Building:</strong> Oversee and grow our vibrant communities on platforms like Discord, Skool, and Circle. Foster meaningful interactions, plan live events (webinars, Q&amp;A sessions, etc.), and create a sense of belonging among users.</p></li><li><p style=\"min-height:1.5em\"><strong>Own Email Comms:</strong> Craft and execute email campaigns that engage, educate, and convert our audience.</p></li><li><p style=\"min-height:1.5em\"><strong>Own Influencer Marketing:</strong> Scout and manage influencers to create engaging content about Synthflow across platforms like YouTube (videos), LinkedIn, newsletters, and more.</p></li><li><p style=\"min-height:1.5em\"><strong>Manage Content Creation &amp; Organic Social:</strong> Write compelling content (blogs, social posts, newsletters) and manage organic content on our social profiles (Facebook, Instagram, LinkedIn) to keep our audience engaged and up-to-date on all things Synthflow AI.</p></li><li><p style=\"min-height:1.5em\"><strong>Help with Branding &amp; Messaging:</strong> Collaborate with the team to refine our product’s branding, positioning, and messaging.</p></li><li><p style=\"min-height:1.5em\"><strong>Collaborate on Creative Assets:</strong> Work with our design team to create compelling assets for ads, social media posts, and other marketing materials.</p></li></ul><p style=\"min-height:1.5em\"><strong>What We’re Looking For:</strong></p><ul style=\"min-height:1.5em\"><li><p style=\"min-height:1.5em\">Proven experience in growth marketing, lifecycle marketing, or product marketing.</p></li><li><p style=\"min-height:1.5em\">Strong writing and storytelling skills with the ability to craft clear, compelling messaging.</p></li><li><p style=\"min-height:1.5em\">Experience managing and growing online communities (Discord, Skool, Circle, etc.).</p></li><li><p style=\"min-height:1.5em\">A track record of working with influencers and managing influencer campaigns.</p></li><li><p style=\"min-height:1.5em\">Empathy and enthusiasm for engaging with users and building relationships.</p></li><li><p style=\"min-height:1.5em\">Nice to have: Willingness to learn and advocate for a technical product.</p></li><li><p style=\"min-height:1.5em\">Nice to have: Experience with no-code and automation tools.</p></li></ul><p style=\"min-height:1.5em\"><strong>Why Join Synthflow?</strong></p><ul style=\"min-height:1.5em\"><li><p style=\"min-height:1.5em\">Be part of a fast-growing, early-stage startup with a mission to democratize AI.</p></li><li><p style=\"min-height:1.5em\">Work on a product that users love and rely on to grow their businesses.</p></li><li><p style=\"min-height:1.5em\">Collaborate with a passionate, empathetic, and talented team.</p></li><li><p style=\"min-height:1.5em\">Enjoy the flexibility of remote work and a supportive, impact-driven culture.</p></li></ul><p style=\"min-height:1.5em\"><strong>Ready to Make an Impact?</strong><br />If you’re excited to take ownership of key growth initiatives at a high-impact startup, we’d love to hear from you. Apply now and let’s build something incredible together.</p>","tags":"[]","pubDate":"2025-02-20T13:04:42.597Z","link":"https://jobs.ashbyhq.com/synthflow/e2588216-d6cb-4ca3-80fe-384edc0d1866","slug":"growth-marketing-manager-synthflow-4609"},{"id":7967752739,"title":"Learning Program Manager","company":"Wikimedia Foundation","image":"https://remotive.com/job/1973931/logo","description":"<p><strong>Hours: </strong>40 hours/week</p>\n<p><strong>Duration: </strong>9 months</p>\n<p><strong>Location: </strong>Remote</p>\n<p><strong>Team Overview</strong></p>\n<p>The Wikimedia vision is a world in which every single human being can freely share in the sum of all knowledge and the People Growth &amp; Belonging Team leads the Wikimedia Foundation’s effort to provide staff with the tools, opportunities, and learning materials needed to shape a welcoming and supportive workplace environment where <em>everyone</em> has the chance to thrive. </p>\n<p>This role will report into the Manager, People Growth &amp; Belonging and is fully remote. The candidate will work closely with the wider People Growth &amp; Belonging team to coordinate and drive key learning and development initiatives, including leadership development, staff upskilling, and global event learning tracks. The candidate will do so by managing stakeholders, vendors, and logistics while contributing to projects and programs which impact the staff experience at the Wikimedia Foundation. They may also work closely with the rest of the People Department to help develop, execute, assess, and improve our growing suite of staff development, organizational learning, and orientation programs.</p>\n<p><strong>Main Responsibilities</strong></p>\n<ul style=\"\">\n<li style=\"\">Act as a project coordinator for our <strong>flagship, in-person leadership development program</strong>, ensuring all deliverables are met on time and aligned with organizational goals, from the socialization plan to training and coaching delivery. Make the connection between the different stakeholders who are responsible for the deliverables including organizing teams, travel/logistics, and content providers, ensuring seamless coordination. Support the project and its content's design and development as needed.</li>\n<li style=\"\">Lead the coordination of our <strong>broader staff upskilling initiatives</strong>, including but not limited to: (1) vendor management, (2) creation and execution of a comprehensive internal communication plan to drive awareness and participation, (3) coordination and running of training sessions, including schedules, attendance, and post-training evaluations/metrics, (4) facilitation of internally-led classes as needed.</li>\n<li style=\"\">Be a learning design partner for our <strong>upcoming global, in-person staff gathering</strong>, supporting the learning track design alongside the project’s team, leading negotiation with vendors, onboarding those vendors, and supporting the implementation of learning sessions during the event.</li>\n<li style=\"\">Be a learning design partner and a project coordinator for a Foundation-wide <strong>initiative to foster healthy interactions across lines of difference</strong>, collaborating with the project team and with vendors to shape and deliver successful provisions which will ultimately help staff co-create spaces to have dialogue on various topics with respect and care for diversity of thought.</li>\n</ul>\n<p><strong>Required Skills and Experience</strong>:</p>\n<ul style=\"\">\n<li style=\"\">Proven ability to manage multiple, complex projects to completion;</li>\n<li style=\"\">Demonstrated success in managing org-wide L&amp;D initiatives.;</li>\n<li style=\"\">Knowledge of adult learning principles, facilitation techniques, and Learning Management Systems (LMS);</li>\n<li style=\"\">Experience in vendor management;</li>\n<li style=\"\">Essential skills on diversity, equity and inclusion;</li>\n<li style=\"\">Versatility acting in both coordination and facilitation of training sessions;</li>\n<li style=\"\">Ability and willingness to travel as needed;</li>\n<li style=\"\">Fluent in written and spoken English.</li>\n</ul>\n<p><strong>Desired Skills and Experience</strong>:</p>\n<ul style=\"\">\n<li style=\"\">Familiarity with the free knowledge movement;</li>\n<li style=\"\">Experience in tech and/or not-for-profit organizations;</li>\n<li style=\"\">Experience working across different sociopolitical and cultural contexts;</li>\n<li style=\"\">Ability to adapt and pivot in complex environments.</li>\n</ul>\n<div class=\"h4\">About the Wikimedia Foundation</div>\n<p>The Wikimedia Foundation is the nonprofit organization that operates Wikipedia and the other Wikimedia free knowledge projects. Our vision is a world in which every single human can freely share in the sum of all knowledge. We believe that everyone has the potential to contribute something to our shared knowledge, and that everyone should be able to access that knowledge freely. We host Wikipedia and the Wikimedia projects, build software experiences for reading, contributing, and sharing Wikimedia content, support the volunteer communities and partners who make Wikimedia possible, and advocate for policies that enable Wikimedia and free knowledge to thrive. </p>\n<p>The Wikimedia Foundation is a charitable, not-for-profit organization that relies on donations. We receive donations from millions of individuals around the world, with an average donation of about $15. We also receive donations through institutional grants and gifts. The Wikimedia Foundation is a United States 501(c)(3) tax-exempt organization with offices in San Francisco, California, USA.</p>\n<p><em><strong>As an equal opportunity employer, the Wikimedia Foundation values having a diverse workforce and continuously strives to maintain an inclusive and equitable workplace. We encourage people with a diverse range of backgrounds to apply. We do not discriminate against any person based upon their race, traits historically associated with race, religion, color, national origin, sex, pregnancy or related medical conditions, parental status, sexual orientation, gender identity, gender expression, age, status as a protected veteran, status as an individual with a disability, genetic information, or any other legally protected characteristics.</strong></em></p>\n<p>The Wikimedia Foundation is a remote-first organization with staff members including contractors based 40+ countries<strong>*</strong>. Salaries at the Wikimedia Foundation are set in a way that is competitive, equitable, and consistent with our values and culture. The anticipated annual pay range of this position for applicants based within the United States is US$34.93/hour to US$53.61/hour with multiple individualized factors, including cost of living in the location, being the determinants of the offered pay. For applicants located outside of the US, the pay range will be adjusted to the country of hire. We neither ask for nor take into consideration the salary history of applicants. The compensation for a successful applicant will be based on their skills, experience and location. </p>\n<p><strong>*Please note that we are currently able to hire in the following countries: </strong>Australia, Austria, Bangladesh, Belgium, Brazil, Canada, Colombia, Costa Rica, Croatia, Czech Republic, Denmark, Egypt, Estonia, Finland, France, Germany, Ghana, Greece, India, Indonesia, Ireland, Israel, Italy, Kenya, Mexico, Netherlands, Nigeria, Peru, Poland, Singapore, South Africa, Spain, Sweden, Switzerland, Uganda, United Arab Emirates, United Kingdom, United States of America and Uruguay.  Our non-US employees are hired through a local third party Employer of Record (EOR). </p>\n<p>We periodically review this list to streamline to ensure alignment with our hiring requirements. </p>\n<p>All applicants can reach out to their recruiter to understand more about the specific pay range for their location during the interview process.</p>\n<p><em><strong>If you are a qualified applicant requiring assistance or an accommodation to complete any step of the application process due to a disability, you may contact us at recruiting@wikimedia.org or +1 (415) 839-6885.</strong></em></p>\n<p><strong>More information</strong></p>\n<p><a href=\"%22https:/foundation.wikimedia.org/wiki/Applicant_privacy_policy%22\" rel=\"nofollow\"><strong>Applicant Privacy Policy</strong></a></p>\n<p><a href=\"%22https:/wikimediafoundation.org/%22\" rel=\"nofollow\"><strong>Wikimedia Foundation</strong></a></p>\n<p><a href=\"%22https:/www.youtube.com/watch?v=8mvPYF_erNA&amp;list=PLVx9pX-VnGVh9Akb-O-SAKZ-GDTVTHZqS&amp;index=8%22\" rel=\"nofollow\"><strong>What does the Wikimedia Foundation do?</strong></a></p>\n<p><a href=\"%22https:/www.youtube.com/watch?v=7gATwhhGrPk&amp;list=PLVx9pX-VnGVh9Akb-O-SAKZ-GDTVTHZqS&amp;index=1%22\" rel=\"nofollow\"><strong>What makes Wikipedia different from social media platforms?</strong></a></p>\n<p><a href=\"%22https:/wikimediafoundation.org/wiki/Our_projects%22\" rel=\"nofollow\"><strong>Our Projects</strong></a></p>\n<p><a href=\"%22https:/techblog.wikimedia.org/%22\" rel=\"nofollow\"><strong>Our Tech Stack</strong></a></p>\n<p><a href=\"%22https:/wikimediafoundation.org/news/%22\" rel=\"nofollow\"><strong>News from across the Wikimedia movement</strong></a></p>\n<p><a href=\"%22https:/diff.wikimedia.org/%22\" rel=\"nofollow\"><strong>Wikimedia Blog</strong></a></p>\n<p><a href=\"%22https:/meta.wikimedia.org/wiki/Strategy/Wikimedia_movement/2017%22\" rel=\"nofollow\"><strong>Wikimedia 2030</strong></a></p>\n<p> </p>\n<div id='\"l-content\"'> </div>\n<img src=\"https://remotive.com/job/track/1973931/blank.gif?source=public_api\" alt=\"\"/>","tags":"[\"social media\",\"onboarding\",\"program manager\",\"nonprofit\",\"diversity\",\"travel\",\"REST\"]","pubDate":"2025-02-20T03:50:28.000Z","link":"https://remotive.com/remote-jobs/hr/learning-program-manager-1973931","slug":"learning-program-manager-wikimedia-foundation-6302"},{"id":8247722651,"title":"Software Engineer","company":"Discourse","image":"https://remotive.com/job/1974725/logo","description":"<p><em>Salary depends on location and experience, able to provide up front</em></p>\n<p class=\"h2\"> </p>\n<p class=\"h2\">About the job</p>\n<p>Discourse is looking to hire a frontend specialist. We are looking for someone with a passion to build user interfaces and make our product better every day, with a strong focus on quality.</p>\n<p> </p>\n<p>The majority of the work you will do will be open source, and you will communicate with our users openly on Discourse Meta.</p>\n<p> </p>\n<p>Discourse is primarily a hosting company. Some of your focus will be around resolving issues for customers, or assisting with customer-specific themes, plugins, and other customizations.</p>\n<p> </p>\n<p>Applicants will have a 10-40 hour paid trial project (over 2-10 weeks) prior to joining the team. The trial project usually involves adding a feature to Discourse or a Discourse plugin.</p>\n<p> </p>\n<p class=\"h4\">Your responsibilities will include:</p>\n<ul style=\"\">\n<li style=\"\">Developing, testing, and documenting features for Discourse</li>\n<li style=\"\">Creating and maintaining reusable components to facilitate building user interfaces</li>\n<li style=\"\">Correcting bugs in Discourse, and working with legacy code in an established codebase</li>\n<li style=\"\">Documenting and clearly communicating fixes and features requests that are completed</li>\n<li style=\"\">Working with design and product colleagues when planning and implementing work</li>\n<li style=\"\">Assisting with pre-sales, support, and operations as needed</li>\n</ul>\n<p> </p>\n<p class=\"h4\">We’re looking for someone who: </p>\n<ul style=\"\">\n<li style=\"\">Has extremely good JavaScript and web API knowledge, Ruby/Rails experience is a plus, SQL is a plus</li>\n<li style=\"\">Maintains a positive mindset and actively improves the code beyond its original state</li>\n<li style=\"\">Is passionate about open source and comfortable with public code reviews</li>\n</ul>\n<p> </p>\n<p>Discourse is made with the Ember.js framework, knowing the framework is a plus, but not mandatory, we can help you learn it. If you have experience in other JavaScript frameworks or libraries it will be helpful.</p>\n<p> </p>\n<p>We are also careful about the accessibility of our product, and would consider a plus a candidate with a good knowledge of accessibility on the web.</p>\n<p> </p>\n<p>At Discourse, the ability to communicate well in writing is paramount. We use our own software, Discourse, for most communication and most of your interaction with customers and team members will be in writing. In order to live these values, we look for folks who are:</p>\n<p> </p>\n<ul style=\"\">\n<li style=\"\">Detail-oriented, proactive, and organized</li>\n<li style=\"\">Able to make decisions quickly and communicate effectively</li>\n<li style=\"\">Work well independently and remotely</li>\n<li style=\"\">Kind to their co-workers</li>\n<li style=\"\">Highly driven with an execution focus and a strong belief in our mission to make the internet a better place</li>\n</ul>\n<p> </p>\n<p class=\"h2\">About our Pay &amp; Benefits</p>\n<p>We believe that high-quality benefits make our team more effective. We’ve been thoughtful about our benefits package which includes a completely flexible schedule, 5 weeks of vacation per year, funding for a co-working stipend, and much more!</p>\n<p> </p>\n<p>Our Salary Framework is location and experience based, and we’re happy to provide a range up front. We also give every employee a stake in the success of the business, regardless of seniority or role. All full-time employees are eligible to receive equity options in the company as part of our equity incentive program.</p>\n<p> </p>\n<p>Lastly, we believe in having a welcoming workplace where people with diverse backgrounds and cultures can create something great together. We encourage you to apply, even if you don’t meet every qualification! Apply to <span style=\"color: var(--remotive-chocolate);\">jobs@discourse.org.</span><span style=\"color: var(--remotive-chocolate);\"> Send your resume and a little intro for us to get to know you, with insight into why you want this job here at Discourse.</span></p>\n<img src=\"https://remotive.com/job/track/1974725/blank.gif?source=public_api\" alt=\"\"/>","tags":"[\"api\",\"CSS\",\"frontend\",\"html\",\"javascript\",\"postgresql\",\"ruby/rails\",\"open source\",\"Redis\",\"infrastructure\"]","pubDate":"2025-02-19T19:07:45.000Z","link":"https://remotive.com/remote-jobs/software-dev/software-engineer-1974725","slug":"software-engineer-discourse-1701"}]