[{"id":1623695563,"title":"Temporary Deal Desk Manager [IC3]","company":"Sourcegraph","image":"https://pbs.twimg.com/profile_images/1428393724527190022/4mt5PACL_400x400.png","description":"\n    <div class=\"content-intro\"><h3>ALL SOURCEGRAPH ROLES ARE FULLY REMOTE</h3>\n<h2><span style=\"color: #a112ff;\">Who we are</span></h2>\n<p>Our mission at Sourcegraph is to make it so that&nbsp;<a class=\"c-link\" href=\"https://handbook.sourcegraph.com/strategy-goals/strategy\" target=\"_blank\" data-stringify-link=\"https://handbook.sourcegraph.com/strategy-goals/strategy\" data-sk=\"tooltip_parent\">everyone can code</a>, not just ~0.1% of the population. Our code graph powers Cody, the most powerful and accurate AI coding assistant, as well as our Code Search product, which helps devs explore their entire codebase and make large-scale migrations and security fixes. We’re building software that builds software, and in doing so we’re making devs more productive and preparing for a world where a lot more code gets written.</p>\n<p>It’s an exciting time to join Sourcegraph. AI has taken over the world, and we’ve spent the last 10 years building infrastructure that’s integral to making AI generated code more powerful and accurate. Our customers include 4/5 FAANG companies, 4 of the top 10 banks, government organizations, Uber, Plaid, and many other companies building the software that pushes the world forward. We’ve raised $225M at a $2.625B valuation from <a class=\"c-link\" href=\"https://techcrunch.com/2021/07/13/sourcegraph-raises-125m-series-d-on-2-6b-valuation-for-universal-code-search-tool/\" target=\"_blank\" data-stringify-link=\"https://techcrunch.com/2021/07/13/sourcegraph-raises-125m-series-d-on-2-6b-valuation-for-universal-code-search-tool/\" data-sk=\"tooltip_parent\">Andreessen Horowitz</a>,&nbsp;<a class=\"c-link\" href=\"https://about.sourcegraph.com/blog/series-c-with-sequoia/\" target=\"_blank\" data-stringify-link=\"https://about.sourcegraph.com/blog/series-c-with-sequoia/\" data-sk=\"tooltip_parent\">Sequoia</a>,&nbsp;<a class=\"c-link\" href=\"https://www.redpoint.com/companies/sourcegraph/\" target=\"_blank\" data-stringify-link=\"https://www.redpoint.com/companies/sourcegraph/\" data-sk=\"tooltip_parent\">Redpoint</a>,&nbsp;<a class=\"c-link\" href=\"https://medium.com/craft-ventures/why-we-invested-in-sourcegraph-5ace28317e3d\" target=\"_blank\" data-stringify-link=\"https://medium.com/craft-ventures/why-we-invested-in-sourcegraph-5ace28317e3d\" data-sk=\"tooltip_parent\">Craft</a>&nbsp;and others. We’re making ambitious bets on our future and we’re looking to hire exceptional people to join our team as we make Sourcegraph one of the biggest and most influential companies in the world.</p></div>\n\n    <h2><span style=\"color: rgb(140, 51, 236);\"><strong>Why this job is exciting</strong></span></h2>\n<p>Sourcegraph is looking for a Temporary (approximately 16 weeks) Deal Desk Manager to join our team! This is a cross-functional role and the person filling it will partner closely across Finance, Accounting, SalesOps, and the Go-To-Market (“GTM”) teams to run the Deal Desk function.&nbsp; Reporting to the Controller,&nbsp; you will provide Deal Desk support for our dynamic and collaborative team across the globe. Additionally, this individual will have exciting opportunities to implement and improve processes that support Sourcegraph’s rapid growth.&nbsp;&nbsp;</p>\n<p>Within one month:</p>\n<ul>\n<li>You will start building a trusting relationship with your peers.</li>\n<li>You will understand the what, why, and how of the projects that your business partner teams are working on, how those projects contribute to our company goals, as well as current status, risks, and mitigations.</li>\n<li>Provide general support and respond to inquiries from the Revenue Organization around bookings, sales activities, and reporting</li>\n</ul>\n<p>Within three months:</p>\n<ul>\n<li>Partner with our sales, customer success, finance, and legal team leaders to define standard and non-standard deal criteria and related approval processes.</li>\n<li>Manage the day-to-day optimization of non-standard deals and serve as the primary point of contact for sales, finance, and legal in these transactions.</li>\n<li>Manage current and future state quote-to-close processes, including quote creation, quote approval, contract generation, contract signatures, contract management, and order completion.</li>\n</ul>\n<h2><span style=\"color: rgb(140, 51, 236);\"><strong>About you</strong></span></h2>\n<p>We are looking for someone who:</p>\n<ul>\n<li>Has 3-5 Years relevant experience in Deal Desk, Legal, Accounting, Sales, or Sales Operations.</li>\n<li>Displays a high-level of intellectual curiosity about our business, not scared to ask questions, displays an eagerness to learn and has a bias towards action.</li>\n<li>Flexibility: Can thrive in a start-up environment, self-motivated, detail-oriented, analytical with demonstrated problem solving skills and have sound business decision making skills in a fast growing/fast paced environment</li>\n<li>Experience with Salesforce and Salesforce CPQ (or other quoting systems) working directly with Sales Reps and Sales Leadership on standard and non-standard deals, the RFX deliverables.</li>\n<li>Deep understanding of SaaS contract structuring and ability to communicate potential financial and business impacts</li>\n<li>Experience in leading internal Deal Desk forums; familiarity with the GAAP and best practice revenue recognition criteria.</li>\n</ul>\n<p>Nice to haves:</p>\n<ul>\n<li>Start up experienceSalesforce CPQ experienceExperience working with Accounting to automate billing</li>\n</ul>\n<h2><span style=\"color: rgb(140, 51, 236);\"><strong>Level</strong></span></h2>\n<p>📊 This job is an IC3.&nbsp; You can read more about <a href=\"https://handbook.sourcegraph.com/benefits-pay-perks/pay-expenses/compensation/leveling-guide/\">our job leveling philosophy</a> in our Handbook.</p>\n<h2><span style=\"color: rgb(140, 51, 236);\"><strong>Compensation</strong></span></h2>\n<p>💰 The target compensation for this role is $57.63 / hour USD. Please read more about <a href=\"https://handbook.sourcegraph.com/departments/people-talent/people-ops/process/how-we-engage-talent-outside-the-us/#temporary-contractors-very-short-term-likely-less-than-3-months\">how we engage with temporary contractors in our handbook here!</a></p>\n<h2><span style=\"color: rgb(140, 51, 236);\"><strong>Interview process</strong></span></h2>\n<p><strong>👋 Introduction Stage</strong> - we have initial conversations to get to know you better…</p>\n<ul>\n<li>[30m]&nbsp;<a href=\"https://handbook.sourcegraph.com/departments/people-talent/talent/process/types_of_interviews/#recruiter-screen\">Recruiter Screen</a>&nbsp;</li>\n<li>[60m]&nbsp;<a href=\"https://handbook.sourcegraph.com/departments/people-talent/talent/process/types_of_interviews/#hiring-manager-screen\">Hiring Manager Screen</a> / <a href=\"https://handbook.sourcegraph.com/departments/people-talent/talent/process/types_of_interviews/#resume-deep-dive\">Resume Deep Dive</a></li>\n</ul>\n<p><strong>🧑‍💻 Team Interview Stage</strong> - we then delve into your experience in more depth and introduce you to members of the team, including cross-functional partners…</p>\n<ul>\n<li>[30m] Cross-Functional Team Interview</li>\n<li>[30m] Cross-Functional Team Interview</li>\n<li>We check references and conduct your background check</li>\n</ul>\n\n    \n\n    <div class=\"content-conclusion\"><h2><span style=\"color: #a112ff;\">Not sure if this is you?</span></h2>\n<p><span style=\"font-weight: 400;\">We want a diverse, global team, with a broad range of experience and perspectives. If this job sounds great, but you’re not sure if you qualify, apply anyway! We carefully consider every application, and will either move forward with you, find another team that might be a better fit, keep in touch for future opportunities, or thank you for your time.</span></p>\n<h2><span style=\"color: #a112ff;\">Learn more about us</span></h2>\n<p><span style=\"font-weight: 400;\">To create a product that serves the needs of all developers, we are building a diverse </span><a href=\"https://handbook.sourcegraph.com/company-info-and-process/remote\"><span style=\"font-weight: 400;\">all-remote team</span></a><span style=\"font-weight: 400;\"> that is </span><a href=\"https://handbook.sourcegraph.com/team\"><span style=\"font-weight: 400;\">distributed across the world</span></a><span style=\"font-weight: 400;\">. Sourcegraph is an equal opportunity workplace; we welcome people from all backgrounds and communities.&nbsp;</span></p>\n<p><span style=\"font-weight: 400;\">We provide </span><a href=\"https://about.sourcegraph.com/handbook/people-ops/compensation\"><span style=\"font-weight: 400;\">competitive compensation</span></a><span style=\"font-weight: 400;\"> and </span><a href=\"https://about.sourcegraph.com/handbook/people-ops/benefits-and-perks\"><span style=\"font-weight: 400;\">practical benefits</span></a><span style=\"font-weight: 400;\"> to keep you happy and healthy so that you can do your best work.&nbsp;</span><span style=\"font-weight: 400;\">&nbsp;</span></p>\n<p><span style=\"font-weight: 400;\">Learn more about what it is like to work at Sourcegraph by reading </span><a href=\"https://about.sourcegraph.com/handbook/\"><span style=\"font-weight: 400;\">our handbook</span></a><span style=\"font-weight: 400;\">.</span></p>\n<p><span style=\"font-weight: 400;\">We want to ensure Sourcegraph is an environment that suits your working style and empowers you to do your best work, so we are eager to answer any questions that you have about us at any point in the interview process.</span></p>\n<p><span style=\"font-weight: 400;\">Go back to the </span><a href=\"https://about.sourcegraph.com/jobs/\"><span style=\"font-weight: 400;\">careers page</span></a><span style=\"font-weight: 400;\"> for all open positions.</span></p>\n<p>&nbsp;</p>\n<p><em><span style=\"font-weight: 400;\">Sourcegraph participates in <a href=\"https://handbook.sourcegraph.com/departments/people-talent/e-verify/\" target=\"_blank\">E-Verify</a> for U.S. Employees</span></em></p></div>\n","tags":"[\"Finance\",\"management\",\"legal\"]","pubDate":"2024-01-20 06:58:28.131","link":"https://boards.greenhouse.io/sourcegraph91/jobs/5061321004","savedDate":"2024-01-20 06:58:28.131","slug":"temporary-deal-desk-manager-ic3-sourcegraph-396"},{"id":7285588069,"title":"Security Engineer","company":"Mechanical Orchard","image":"https://pbs.twimg.com/profile_images/1592609773958025216/CaG1yAqK_400x400.png","description":"<div class=\"section page-centered\" data-qa=\"job-description\"><div><span style=\"font-size: 11pt\">Mechanical Orchard is a fast-growing startup that takes a fresh view on old problems. We replace legacy computing systems for the Global 2000, with a focus on mitigating risk and creating a genuinely solid foundation for innovating and adapting.&nbsp;</span></div><div><br></div><div><span style=\"font-size: 11pt\">Our background in software development and the impact on the industry is well known, and we've literally helped write the book on XP and other impactful agile practices. We’re applying the same thoughtfulness and rigor in weaving AI into everything we do. We believe in the durable principles behind agile, and embrace the power of cross-functional teams, collective ownership, test driven development, short feedback loops, and continuous improvement.</span></div><div><br></div><div><span style=\"font-size: 11pt\">We are Generous, Ethical, Effective, and Kind.</span></div><div><br></div><div>As a member of Mechanical Orchard's Information Security team, you will be expected to, assist with, perform, or manage the following tasks:</div><div><br></div><div><br></div><div>- Help evolve, implement, and manage the organization's information security program, policies, and procedures.</div><div>- Conduct risk assessments to identify vulnerabilities in our systems and processes.</div><div>- Design and implement security controls and measures to secure the company's data, endpoint systems, networks, cloud-based infrastructure, and company processes.</div><div>- Work with engineering organizations to ensure their development processes, code, systems and operations are secure (DevSecOps, AppSec).</div><div>- Implement and oversee security awareness and training programs.</div><div>- Work with customer InfoSec teams, answer their questions when they are analyzing our security posture.</div><div>- Lead incident response in the event of a security incident or breach, including forensic analysis, mitigation strategies and recovery efforts.</div><div>- Work with third-party vendors to evaluate their security practices and ensure they meet our    organization's standards.</div><div>- Lead internal security audits, manage external security audits and compliance audits.</div><div>- Stay up-to-date with the latest information security threats, trends, technologies, and best practices.</div><div><br></div><div><br></div><div>The ideal candidate will have had experience securing an organization that performs agile software development and operates production infrastructure using cloud service providers.</div><div><br></div><div><br></div><div>Strong communication and collaboration skills as well as empathy are essential for working closely with the development team, customers, and others at Mechanical Orchard.</div><div><br></div></div><div class=\"section page-centered\" data-qa=\"closing-description\"><div><span style=\"font-size: 11pt\">Mechanical Orchard, Inc. is an Equal Opportunity Employer and Prohibits Discrimination and Harassment of Any Kind. Mechanical Orchard, Inc. is committed to the principle of equal employment opportunity for all employees and to providing employees with a work environment free of discrimination and harassment. All employment decisions at Mechanical Orchard, Inc. are based on business needs, job requirements and individual qualifications, without regard to race, color, religion or belief, national, social or ethnic origin, sex (including pregnancy), age, physical, mental or sensory disability, HIV Status, sexual orientation, gender identity and/or expression, marital, civil union or domestic partnership status, past or present military service, family medical history or genetic information, family or parental status, or any other status protected by the laws or regulations in the locations where we operate. Mechanical Orchard, Inc. will not tolerate discrimination or harassment based on any of these characteristics. Mechanical Orchard, Inc. encourages applicants of all ages. Mechanical Orchard, Inc. will provide reasonable accommodation to employees who have protected disabilities consistent with local law.</span></div><div><br></div><div>We look forward to reviewing your application. Thanks!</div></div><div class=\"section page-centered last-section-apply\" data-qa=\"btn-apply-bottom\"><a class=\"postings-btn template-btn-submit hex-color\" data-qa=\"show-page-apply\" href=\"https://jobs.lever.co/mechanicalorchard/bdd5b69a-06f9-4e50-9212-14d818eb1c3d/apply\">Apply for this job</a></div>","tags":"[\"engineering\",\"aws\"]","pubDate":"2024-01-20 06:58:28.131","link":"https://jobs.lever.co/mechanicalorchard/bdd5b69a-06f9-4e50-9212-14d818eb1c3d","savedDate":"2024-01-20 06:58:28.131","slug":"security-engineer-mechanical-orchard-9623"},{"id":3747954562,"title":"Associate Opener (Webinars)","company":"SafetyWing","image":"https://pbs.twimg.com/profile_images/1177267684574208000/54eG3WmW_400x400.jpg","description":"<h2>🧘 What we offer</h2> <ul><li><!--block-->Fully remote work environment – work from anywhere globally.&nbsp;</li><li><!--block-->Competitive compensation.</li><li><!--block-->Global coverage with Remote Health and Nomad Insurance.</li><li><!--block-->A minimum of 20 days of compensated time off each year.</li><li><!--block-->Referral bonus - an incentive program rewarding you for helping us find exceptional talent to join our team.</li><li><!--block-->Opportunity to unlock more benefits as your tenure with SafetyWing grows.</li></ul><div><!--block--><br>We are looking forward to hearing from you!</div> <div><!--block-->We're seeking a Direct Sales Associate Opener to engage with our webinar registrants. Your talent in pinpointing potential leads will steer <strong>SafetyWing</strong> toward achieving our goals.</div><div><!--block--><br>We are building a global social safety net, including health and retirement for remote workers worldwide, as a replacement for national welfare systems. If we succeed, we believe this will help ensure freedom and equal opportunity for everyone, and it is one of the more important tasks of our time that no one else is working on.</div> <h2>💻 Your responsibilities will include</h2>  <ul><li><!--block-->Be the first point of contact for people interested in our webinars. Your job is to identify potential leads, understand their needs, and get them excited about what SafetyWing offers.</li><li><!--block-->Schedule qualified meetings with our sales team (Closers), ensuring we have a smooth transition from initial contact to sales engagement.</li><li><!--block-->Work closely with our sales and marketing teams, sharing ideas and strategies to boost client engagement.</li><li><!--block-->Maintain accurate records of outreach efforts and meeting schedules in our CRM system.</li><li><!--block-->Participate in weekly team meetings to discuss progress and strategy.</li></ul><div><!--block--><br></div> <h2>🧪 We are looking for someone who:</h2> <ul><li><!--block-->Has an exceptional knack for research – we value this highly!</li><li><!--block-->Has successful experience in proactive customer outreach.</li><li><!--block-->Has excellent communication skills in English, both verbal and written.</li><li><!--block-->Is tech-savvy and comfortable with Google Workspace, CRM software, and marketing automation tools.</li><li><!--block-->Is a continual learner, detailed, planning pro, and autonomous worker.</li><li><!--block-->Extra shine if you have experience in lead generation and a diploma or degree in marketing, business, or a related field.</li></ul><div><!--block--><strong>😀 We like to work with people who:</strong></div><ul><li><!--block-->Want to help build a global social safety net on the Internet.</li><li><!--block-->Think for themselves instead of copying others.</li><li><!--block-->Are willing to try new things, even with the risk of failure.</li><li><!--block-->Are intellectually curious and open to new ideas.</li><li><!--block-->Are creative and bold in the face of any problems.</li><li><!--block-->Have strong integrity and do the right thing.</li></ul>","tags":"[]","pubDate":"2024-01-20 06:58:28.130","link":"https://safetywing.pinpointhq.com/en/jobs/166734","savedDate":"2024-01-20 06:58:28.130","slug":"associate-opener-webinars-safetywing-2867"},{"id":1262204699,"title":"Associate Opener/Sales Development Representative","company":"SafetyWing","image":"https://pbs.twimg.com/profile_images/1177267684574208000/54eG3WmW_400x400.jpg","description":"<h2>🧘 What we offer</h2> <ul><li><!--block-->Fully remote work environment – work from anywhere globally.&nbsp;</li><li><!--block-->Competitive compensation.</li><li><!--block-->Global coverage with Remote Health and Nomad Insurance.</li><li><!--block-->A minimum of 20 days of compensated time off each year.</li><li><!--block-->Referral bonus - an incentive program rewarding you for helping us find exceptional talent to join our team.</li><li><!--block-->Opportunity to unlock more benefits as your tenure with SafetyWing grows.</li></ul><div><!--block--><br>We are looking forward to hearing from you!</div> <div><!--block-->We’re seeking a friendly and energetic Associate Opener to join our Direct Sales Team and help us connect with amazing customers! Your talent in pinpointing potential leads will steer <strong>SafetyWing</strong> toward achieving our goals.</div><div><!--block--><br>We are building a global social safety net, including health and retirement for remote workers worldwide, as a replacement for national welfare systems. If we succeed, we believe this will help ensure freedom and equal opportunity for everyone, and it is one of the more important tasks of our time that no one else is working on.</div> <h2>💻 Your responsibilities will include</h2>  <ul><li><!--block-->Create awareness and generate interest for Remote Health by SafetyWing among companies.</li><li><!--block-->Discover impactful leads.</li><li><!--block-->Conduct outreach through calling, emailing, and social media to engage potential clients.</li><li><!--block-->Set up qualified meetings between target buyers and our account executives (Closers).</li><li><!--block-->Assist in whipping up and executing lead-generation campaigns.</li><li><!--block-->Meticulously enter and manage sales data, ensuring accuracy and reliability in our CRM.</li></ul><div><!--block--><br></div> <h2>🧪 We are looking for someone who:</h2> <ul><li><!--block-->Has an exceptional knack for research – we value this highly!</li><li><!--block-->Has successful experience in proactive customer outreach.</li><li><!--block-->Has excellent communication skills in English, both verbal and written.</li><li><!--block-->Is tech-savvy and comfortable with Google Workspace, CRM software, and marketing automation tools.</li><li><!--block-->Is a continual learner, detailed, planning pro, and autonomous worker.</li><li><!--block-->Extra shine if you have experience in lead generation and a diploma or degree in marketing, business, or a related field.</li></ul><div><!--block--><strong>😀 We like to work with people who:</strong></div><ul><li><!--block-->Want to help build a global social safety net on the Internet.</li><li><!--block-->Think for themselves instead of copying others.</li><li><!--block-->Are willing to try new things, even with the risk of failure.</li><li><!--block-->Are intellectually curious and open to new ideas.</li><li><!--block-->Are creative and bold in the face of any problems.</li><li><!--block-->Have strong integrity and do the right thing.</li></ul>","tags":"[]","pubDate":"2024-01-20 06:58:28.129","link":"https://safetywing.pinpointhq.com/en/jobs/166731","savedDate":"2024-01-20 06:58:28.129","slug":"associate-opener-sales-development-representative-safetywing-154"},{"id":7275601090,"title":"Java Technical Director - Remote / Work Anywhere","company":"CloudLinux","image":"https://pbs.twimg.com/profile_images/696718028084482050/ymY3OEPk_400x400.png","description":"<p>CloudLinux is a global remote-first company. We are driven by our principles: Do the right thing, employees first, we are remote first, and&nbsp; we deliver high volume, low-cost Linux infrastructure and security products that help companies to increase the efficiency of their operations. Every person on our team supports each other and does what we can to ensure everyone is successful. We are truly a great place to work. For more details about our company go to <a href=\"http://cloudlinux.com/\" rel=\"nofollow noreferrer noopener\" class=\"external\">Cloudlinux.com</a>.</p><p>CLN is an integral SaaS platform tasked with the licensing of all CloudLinux products. It manages server operations and oversees the billing process for customers. This is a unique self-provisioning system created by CloudLinux for internal needs. The automated, easy-to-use robust solution delivers comprehensive and complete user experience. We will give you a place to strive and grow, where you will have the opportunity to work on interesting, yet challenging product. Applying your thinking to build a better system founded on intelligent technologies.</p><p>Work is fully remote, so you can work from anywhere.&nbsp;Join us to make a difference!</p><p>As our Java Technical Director you will:</p><ul> <li>Join our team and unleash your creativity as you design, build, and passionately oversee the delivery of top-notch code. As you embark on this exciting role, you'll have the opportunity to be hands-on from the start, making a tangible impact on our projects.</li> <li>Take complete control and responsibility for the entire CLN team from a technical standpoint.</li> <li>Collaborate extensively with talented Java developers, Business Analytics professionals, and Front-End Engineers.</li> <li>Thoroughly assess and enhance our architecture to support our remarkable growth.</li> <li>Continuously evaluate and improve the architecture to maintain utmost security of sensitive data at all times.</li> <li>Engage in architecting solutions and document technical specifications.</li> <li>Make crucial managerial decisions and assume full responsibility for a product's success.</li> </ul><h3>Requirements: </h3><p>To be successful you should have;</p><ul> <li>Vast Experience in building enterprise-grade applications using Java</li> <li>Strong knowledge of Functional programming in Java</li> <li>Experience in creating applications with embedded CI/CD to ensure frequent and reliable software delivery</li> <li>Expertise in Java, Spring Boot, Postgre, Redis, Gradle, Kafka, and APIs</li> <li>A true passion for the SaaS field</li> <li>Comfortable explaining solution designs and code to architects and developers</li> <li>Experience in Linux server administration is a plus</li> <li>Managerial experience is a big plus, but not a requirement. Extensive experience as a Java Principal developer or architect will suffice</li> <li>Intermediate level of English language or higher</li> </ul><p></p><p>In addition, you should be;</p><ul> <li>Quick to learn and eager to take initiative.</li> <li>Highest level of self-motivation, dedicated to accomplishing goals.</li> <li>Exceptional communication skills and a passion for sharing knowledge.</li> <li>Excellent ability to prioritize tasks and adapt to changing circumstances.</li> <li>Capable of independently analyzing problems to find optimal solutions.</li> <li>Able to work with ambiguous requirements and make independent decisions.</li> <li>Experienced in working collaboratively and leading teams.</li> </ul><p></p><p></p><h3>Benefits: </h3><p><strong>What's in it for you?</strong></p><ul> <li>A focus on professional development; </li> <li>Interesting and challenging projects</li> <li>Flexible working hours</li> <li>Paid one month vacation per year and unlimited sick leave</li> <li>Medical insurance reimbursement</li> <li>Co-working and gym/sports reimbursement</li> <li>The opportunity to receive a reward for the most innovative idea that the company can patent</li> </ul><p><em>By applying for this position, you agree with </em><a href=\"https://cloudlinux.com/privacy-policy\" rel=\"nofollow noreferrer noopener\" class=\"external\"><em>Cloudlinux Privacy Policy</em></a><em> and give us your consent to maintain and process your personal data with this respect. Please read our Privacy Policy for more information.</em></p>","tags":"[]","pubDate":"2024-01-18 00:00:00.000","link":"https://apply.workable.com/cloudlinux-1/j/B06E488360","savedDate":"2024-01-20 06:58:28.132","slug":"java-technical-director-remote-work-anywhere-cloudlinux-6973"},{"id":9905542243,"title":"Senior Python Developer Remote / Work Anywhere","company":"CloudLinux","image":"https://pbs.twimg.com/profile_images/696718028084482050/ymY3OEPk_400x400.png","description":"<p>KernelCare, CloudLinux’s fastest-growing product, provides automated kernel security updates without reboots for most popular Linux distributions. It ensures optimal performance and uptime by allowing hosting providers and enterprises to keep kernels up-to-date with all security patches while keeping servers online.</p><p>Work is fully remote, with flexible hours, where you can plan your day and work from anywhere in the world.</p><p>More details about the project you can find on the product website TuxCare.com</p><p>As our Senior Python Developer you will;</p><ul> <li>Get hands-on with developing our cutting-edge KernelCare products using Python.</li> <li>Ensure the quality of your code by writing comprehensive unit tests with Python and/or functional tests.</li> <li>Collaborate with your colleagues by reviewing their code through Gerrit.</li> <li>Contribute to the growth of our products through architecture development and creating detailed technical documentation for new features.</li> <li>Dive into reported issues from our clients, partners, or support team to investigate and find solutions.</li> <li>Work closely with our 3rd level support team, providing consultations and assistance on matters related to KernelCare products.</li> </ul><h3>Requirements: </h3><p>To be successful you should have;</p><ul><li>Experience with ClickHouse is a must</li></ul><ul> <li>4+ years of Python programming experience.</li> <li>Experience with System programming Sockets, filesystem, process management.</li> <li>GNU/Linux operating system and shell scripting experience.</li> <li>Experience with git-based development processes.</li> <li>PyTest.</li> <li>Intermediate level of English language.</li> </ul><p>It would be ideal if you also know;</p><ul> <li>Ansible, Jenkins.</li> <li>rpm/deb package management (writing rpm spec, deb rules).</li> <li>C language.</li> <li>Python frameworks: Flask, SQLAlchemy.</li> <li>NGINX.</li> </ul><p>In addition you should be;</p><ul> <li>Quick to learn and proactive.</li> <li>Highly self-motivated, determined to accomplish set goals.</li> <li>Able to independently analyze tasks and identify optimal solutions.</li> <li>Skilled at collaboration and working effectively in teams.</li> </ul><h3>Benefits: </h3><p><strong>What's in it for you?</strong></p><ul> <li>A focus on professional development; </li> <li>Interesting and challenging projects</li> <li> Flexible working hours</li> <li>Paid one month vacation per year and unlimited sick leave</li> <li>Medical insurance reimbursement</li> <li>Co-working and gym/sports reimbursement</li> <li>The opportunity to receive a reward for the most innovative idea that the company can patent</li> </ul><p><em>By applying for this position, you agree with </em><a href=\"https://cloudlinux.com/privacy-policy\" rel=\"nofollow noreferrer noopener\" class=\"external\"><em>Cloudlinux Privacy Policy</em></a><em> and give us your consent to maintain and process your personal data with this respect. Please read our Privacy Policy for more information.</em></p>","tags":"[\"management\"]","pubDate":"2024-01-18 00:00:00.000","link":"https://apply.workable.com/cloudlinux-1/j/D7E64E778E","savedDate":"2024-01-20 06:58:28.132","slug":"senior-python-developer-remote-work-anywhere-cloudlinux-2671"},{"id":2652036475,"title":"Quantitative Software Engineer","company":"Ethena Labs","image":"https://remotive.com/job/1888123/logo","description":"<div><strong style=\"\">Who We Are:</strong></div>\n<div>Ethena Labs is building the first ETH based yield-bearing synthetic dollar. Arthur Hayes is a founding advisor and the team has deep experience across traditional finance and crypto engineering from firms such as Cerberus, Wintermute, Flow Traders, Deribit, Paradigm, Aave, Blockdaemon and Kaiko. We are backed by every major exchange and trading entities in the space.</div>\n<div> </div>\n<div><strong style=\"\">What we are Doing:</strong></div>\n<div>We are building derivative infrastructure to enable Ethereum to transform into the Internet Bond via delta-neutral derivatives positions, to create the first crypto-native, yield bearing synthetic dollar: sUSDe.</div>\n<div> </div>\n<div>We believe creating a synthetic dollar which is not reliant on existing banking infrastructure is the single most important problem to solve and largest opportunity in crypto today.</div>\n<div> </div>\n<div>USDe will form the first part of a broader ecosystem of products we are building including fixed and floating rate internet bonds and composable repo leveraged markets.</div>\n<div> </div>\n<div>Join us!!</div>\n<div> </div>\n<div><strong style=\"\">The Team:</strong></div>\n<div>The quantitative team is building the required trading infrastructure to maintain our delta-neutral USDe positions.</div>\n<div> </div>\n<div>We believe creating a synthetic dollar which is not reliant on existing banking infrastructure is the single most important problem to solve and the largest opportunity in crypto today.</div>\n<div> </div>\n<div>USDe will form the first part of a broader ecosystem of products.</div>\n<div> </div>\n<div> </div>\n<div><strong style=\"\">The ideal candidate would be in one of the following time zones: EST, GMT, CET, EEST</strong></div>\n<p><br><br></p>\n<div class=\"h3\">Who We are Looking For:</div>\n<ul style=\"\">\n<li style=\"\">An experienced quantitative/trading engineer who is passionate about building products/applications within the crypto derivative landscape.</li>\n</ul>\n<ul style=\"\">\n<li style=\"\">A creative and collaborative individual excited by the opportunity of joining an early stage team and taking ownership of products from conception to production.</li>\n</ul>\n<ul style=\"\">\n<li style=\"\">At least 2 years of experience in developing trading-related software at a market-making, exchange or trading oriented firm.</li>\n</ul>\n<ul style=\"\">\n<li style=\"\">A genuine interest in building technology and pushing forward innovation within the space.</li>\n</ul>\n<p><br><br></p>\n<div class=\"h3\">Responsibilities</div>\n<ul style=\"\">\n<li style=\"\">Work on the internal trading system focused on centralized venues, that covers topics such as: pricing, risk-management, low latency data capture, order management etc.</li>\n</ul>\n<ul style=\"\">\n<li style=\"\">Design and build automated delta-neutral derivative strategies with a focus on portfolio hedging.</li>\n</ul>\n<ul style=\"\">\n<li style=\"\">Collaborate with custody and exchange partners to build secure and reliable connectivity to various venues.</li>\n</ul>\n<p><br><br></p>\n<div class=\"h3\">Requirements</div>\n<ul style=\"\">\n<li style=\"\">Prior experience working for a start-up is strongly preferred.</li>\n</ul>\n<ul style=\"\">\n<li style=\"\">2+ years working at a trading-related firm.</li>\n</ul>\n<ul style=\"\">\n<li style=\"\">Strong Python skills.</li>\n</ul>\n<ul style=\"\">\n<li style=\"\">Computational fundamentals, such as networking, system-utilization etc.</li>\n</ul>\n<ul style=\"\">\n<li style=\"\">Excellent analytical skills.</li>\n</ul>\n<ul style=\"\">\n<li style=\"\">Clear and concise communication ability.</li>\n</ul>\n<ul style=\"\">\n<li style=\"\">Fluent English, both written and spoken.</li>\n</ul>\n<div>Nice to haves:</div>\n<ul style=\"\">\n<li style=\"\">Experience running and building market making engines.</li>\n</ul>\n<ul style=\"\">\n<li style=\"\">Knowledge of DeFi engineering principles and tools.</li>\n</ul>\n<ul style=\"\">\n<li style=\"\">Systems level programming experience (C, C++, Rust etc.).</li>\n</ul>\n<div> </div>\n<p><br><br></p>\n<div class=\"h3\">Our Engineering Stack</div>\n<ul style=\"\">\n<li style=\"\">Frontend: React, NextJS, Wagmi, Viem, TailwindCSS</li>\n</ul>\n<ul style=\"\">\n<li style=\"\">Backend: Python, Solidity, SQL, GraphQL, DGraph, Docker, AWS, Ethereum.</li>\n</ul>\n<div>If you subscribe to the mission of separating the dollar from the state, then we want to hear from you!</div>\n<div> </div>\n<div>We look forward to receiving your application and will be in touch after having a chance to review. </div>\n<div> </div>\n<div><strong style=\"\">In the meantime, here are some links to more information about Ethena Labs to help you check us out:</strong></div>\n<div><a class=\"postings-link\" href=\"https://www.ethena.fi/\" rel=\"nofollow\"><strong>Website</strong></a></div>\n<div><a class=\"postings-link\" href=\"https://twitter.com/ethena_labs?s=21&amp;t=axGgKq-f7xtb_IGY1vq9gA\" rel=\"nofollow\"><strong>Twitter</strong></a></div>\n<div><a class=\"postings-link\" href=\"https://www.linkedin.com/company/ethena-labs\" rel=\"nofollow\"><strong>LinkedIn</strong></a></div>\n<div><a class=\"postings-link\" href=\"https://discord.gg/cydRJR5b\" rel=\"nofollow\"><strong>Discord</strong></a></div>\n<img src=\"https://remotive.com/job/track/1888123/blank.gif?source=public_api\" alt=\"\"/>","tags":"[\"AWS\",\"backend\",\"C\",\"C++\",\"crypto\",\"docker\",\"frontend\",\"graphql\",\"python\",\"react\",\"sql\",\"rust\",\"solidity\",\"Ethereum\",\"trading\",\"infrastructure\",\"banking\"]","pubDate":"2024-01-17 23:24:51.000","link":"https://remotive.com/remote-jobs/software-dev/quantitative-software-engineer-1888123","savedDate":"2024-01-20 06:58:28.128","slug":"quantitative-software-engineer-ethena-labs-3569"}]