[{"id":9392562244,"title":"Senior Technical Support Engineer","company":"Scroll","image":"https://avatars.githubusercontent.com/u/87750292?s=200&v=4","description":"&lt;div class=&quot;content-intro&quot;&gt;&lt;p&gt;Scroll is a Layer 2 scaling solution for Ethereum, specifically focusing on zkRollups. Key aspects of Scroll are zkRollup technology, Scalability, Efficiency, Security, and Developer-friendly. Overall, Scroll plays a crucial role in addressing Ethereum&#39;s scalability challenges and facilitating the growth of decentralized finance (DeFi) and other blockchain-based applications by providing a scalable and efficient Layer 2 solution.&amp;nbsp;&lt;/p&gt;&lt;/div&gt;&lt;p&gt;&lt;strong&gt;Position Overview&amp;nbsp;&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;Scroll is seeking an experienced Senior Technical Support Engineer to lead our technical support function. As the first hire in this role, you will shape support processes, tools, and metrics, addressing issues from partners and developers efficiently. You will collaborate closely with Engineering and Product teams to resolve issues and enhance the customer experience.&lt;/p&gt;\n&lt;p&gt;This is a dynamic role in a fast-paced blockchain environment, ideal for someone eager to grow with us.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Responsibilities&amp;nbsp;&lt;/strong&gt;&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;Act as the main point of contact for technical support, triaging and resolving issues with internal teams.&lt;/li&gt;\n&lt;li&gt;Develop scalable support processes, tools, and documentation to improve efficiency and satisfaction.&lt;/li&gt;\n&lt;li&gt;Define and report key support metrics, providing insights to leadership.&lt;/li&gt;\n&lt;li&gt;Provide feedback to the Product team on customer pain points and suggest improvements.&lt;/li&gt;\n&lt;li&gt;Serve as a technical liaison between customers and the Engineering team.&lt;/li&gt;\n&lt;li&gt;Stay updated on Scroll’s technology and the evolving blockchain landscape.&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;&lt;strong&gt;Requirements&amp;nbsp;&lt;/strong&gt;&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;3+ years of experience in technical customer support or a related role.&lt;/li&gt;\n&lt;li&gt;Strong problem-solving skills and the ability to work independently.&lt;/li&gt;\n&lt;li&gt;Excellent communication skills in English, with the ability to simplify technical concepts.&lt;/li&gt;\n&lt;li&gt;Proficiency in scripting languages like JavaScript, Python, or Bash.&lt;/li&gt;\n&lt;li&gt;Familiarity with monitoring tools such as Grafana or Prometheus.&lt;/li&gt;\n&lt;li&gt;A “Customer First” mindset and eagerness to learn in a fast-evolving field.&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;&lt;strong&gt;Preferred Qualifications&lt;/strong&gt;&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;Experience in blockchain, Layer 2 solutions, or crypto technologies.&lt;/li&gt;\n&lt;li&gt;Startup experience or familiarity with fast-paced environments.&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;&lt;/p&gt;&lt;div class=&quot;content-conclusion&quot;&gt;&lt;h3&gt;&lt;strong&gt;About You&lt;/strong&gt;&lt;/h3&gt;\n&lt;ul&gt;\n&lt;li&gt;You are a self-starter and ability to take ownership, well organised, self-disciplined and effective when working autonomously on tasks and projects;&lt;/li&gt;\n&lt;li&gt;You are responsive, collaborative and committed person with a high work ethic;&lt;/li&gt;\n&lt;li&gt;You are a high class communicator who can articulate their views succinctly on calls or asynchronously in globally distributed, remote teams;&lt;/li&gt;\n&lt;li&gt;You relish working in an agile start-up environment;&lt;/li&gt;\n&lt;li&gt;You are a great listener who understands when to listen first and engages well with colleagues;&lt;/li&gt;\n&lt;li&gt;You are a resilient, driven individual who is willing and able to continually develop and iterate to succeed;&lt;/li&gt;\n&lt;/ul&gt;\n&lt;h3&gt;&lt;strong&gt;What We Offer&lt;/strong&gt;&lt;/h3&gt;\n&lt;ul&gt;\n&lt;li&gt;A mission-led, collaborative culture&lt;/li&gt;\n&lt;li&gt;Opportunity to work with cutting edge technology and like-minded people who are contributing to the progression of Ethereum&lt;/li&gt;\n&lt;li&gt;Competitive salary package / generous paid time off / annual growth budget&lt;/li&gt;\n&lt;li&gt;100% remote from any location with flexible hours&lt;/li&gt;\n&lt;li&gt;Home office set up / co-working membership allowance&lt;/li&gt;\n&lt;li&gt;Private healthcare in selected countries&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;&lt;em&gt;Scroll is proud to be an equal opportunity workplace. We are committed to equal employment opportunities regardless of race, color, ancestry, religion, sex, national origin, sexual orientation, age, citizenship, marital status, disability, gender identity, or Veteran status. If you have a disability or special need, please let us know and we&#39;ll do our best to accommodate.&lt;/em&gt;&lt;/p&gt;\n&lt;p&gt;&amp;nbsp;&lt;/p&gt;&lt;/div&gt;","tags":"[\"javascript\",\"Finance\",\"engineering\"]","pubDate":"2024-12-26T03:29:51.000Z","link":"https://job-boards.eu.greenhouse.io/scrollio/jobs/4501355101","slug":"senior-technical-support-engineer-scroll-6331"},{"id":6371501897,"title":"Talent Manager / HR Generalist","company":"Woolf","image":"https://remotive.com/job/1959242/logo","description":"<p><strong>About Woolf</strong></p>\n<p>Woolf is a pioneering force in higher education, backed by leading Silicon Valley investors. Our mission is to reshape the future of learning by expanding access to high-quality education on a global scale. Learn more at <a class=\"external\" href=\"https://woolf.university/\" rel=\"nofollow\">Woolf University</a>.</p>\n<p>We’re a rapidly growing startup, already partnering with colleges that generate over $750 million in annual course sales. With a globally distributed, primarily remote team, we thrive on collaboration across diverse locations, perspectives, and expertise.</p>\n<p><br><strong>The Role</strong></p>\n<p>Woolf We are seeking a dynamic HR professional who specializes in talent acquisition while also possessing a strong foundational understanding of other HR functions. This role is ideal for someone looking to grow into a future Global HR Manager role. In this role, you will be responsible for overseeing all aspects of talent acquisition efforts, ensuring that we attract and hire exceptional talent globally. This individual will also support and contribute to other HR areas such as compliance, payroll, employee engagement, and performance management. The ideal candidate is proactive, organized, and eager to grow with our team.</p>\n<p> </p>\n<p>Duties &amp; Responsibilities:</p>\n<ul style=\"\">\n<li style=\"\"><strong>Talent Acquisition:</strong></li>\n<ul style=\"\">\n<li style=\"\">Lead the end-to-end hiring process, including collaborating with internal and external talent partners, sourcing, screening, interviewing, extending offers, and ensuring a seamless onboarding experience.</li>\n<li style=\"\">Develop and execute strategic global talent acquisition plans to attract top-tier talent.</li>\n<li style=\"\">Build and maintain a robust talent pipeline through proactive sourcing methods, including leveraging platforms like <strong>Workable</strong>, <strong>Upwork</strong>, LinkedIn, and job boards.</li>\n<li style=\"\">Partner with hiring managers to define role requirements and deliver top candidates with efficiency and precision.</li>\n<li style=\"\">Monitor and analyze recruiting metrics to continuously improve hiring processes and outcomes.</li>\n</ul>\n<li style=\"\"><strong>HR Operational Excellence:</strong></li>\n<ul style=\"\">\n<li style=\"\">Optimize talent acquisition workflows and ensure alignment with broader HR operational goals.</li>\n<li style=\"\">Develop and document standardized processes for hiring, onboarding, and HR compliance.</li>\n<li style=\"\">Use HRIS tools like <strong>Rippling</strong> to streamline processes, track performance, and ensure accurate record-keeping.</li>\n<li style=\"\">Identify areas for process improvement across talent acquisition and general HR operations, driving efficiency and consistency.</li>\n</ul>\n<li style=\"\"><strong>HR Generalist Support:</strong></li>\n<ul style=\"\">\n<li style=\"\">Contribute to the creation and maintenance of HR policies and procedures to ensure compliance with global and local regulations.</li>\n<li style=\"\">Support payroll, compliance, and benefits administration as needed.</li>\n<li style=\"\">Provide guidance and support on employee relations, performance management, and retention initiatives.</li>\n</ul>\n<li style=\"\"><strong>Collaboration and Strategic Contributions:</strong></li>\n<ul style=\"\">\n<li style=\"\">Collaborate with global teams to align HR strategies with business goals.</li>\n<li style=\"\">Act as a trusted partner to managers and employees, fostering a positive work environment.</li>\n<li style=\"\">Contribute to long-term HR strategies, including developing a global compensation philosophy and preparing for future leadership opportunities.</li>\n</ul>\n</ul>\n<p><strong>Requirements</strong></p>\n<ul style=\"\">\n<li style=\"\"><strong>Minimum Requirements:</strong></li>\n<ul style=\"\">\n<li style=\"\">Bachelor’s degree in Human Resources, Business Administration, or a related field.</li>\n<li style=\"\">SHRM-CP/SHRM-SCP, PHR/SPHR, global HR or equivalent certification preferred.</li>\n<li style=\"\">3-5+ years of experience in talent acquisition and generalist HR functions.</li>\n<li style=\"\">Strong recruitment and sourcing skills</li>\n<li style=\"\">Knowledge of performance management, payroll, and compliance best practices.</li>\n<li style=\"\">Excellent interpersonal and communication skills.</li>\n<li style=\"\">Ability to multitask and work in a fast-paced, remote environment.</li>\n</ul>\n<ul style=\"\">\n<li style=\"\"><strong>Working hours:</strong> Must be able to work standard business hours in <strong>either the US or UK timezones</strong>, with availability to overlap and collaborate with our global teams in both regions.</li>\n</ul>\n<li style=\"\"><strong>Preferred Requirements:</strong></li>\n<ul style=\"\">\n<li style=\"\">Demonstrated success in a <strong>startup environment</strong>, thriving with minimal direction while delivering exceptional results preferred.</li>\n</ul>\n<ul style=\"\">\n<li style=\"\">Proficiency with <strong>Rippling HRIS and payroll</strong> systems.</li>\n<li style=\"\">Proficiency in using ATS platforms like <strong>Workable.</strong></li>\n<li style=\"\">Proficiency in using sourcing tools like LinkedIn Recruiter.</li>\n<li style=\"\">Experience in a <strong>global</strong> HR environment is a plus.</li>\n</ul>\n</ul>\n<p><strong>Benefits</strong></p>\n<p><strong>Why Woolf?</strong></p>\n<ul style=\"\">\n<li style=\"\"><strong>Competitive Compensation</strong>: Salary commensurate with experience</li>\n<li style=\"\"><strong>Benefits:</strong> US employee benefits include health insurance and 401k</li>\n<li style=\"\"><strong>Work-Life Balance</strong>: Enjoy the flexibility of a fully remote work environment, along with flexible PTO policy and working hours.</li>\n<li style=\"\"><strong>Tools for Success</strong>: We provide you with a company laptop and the resources needed to succeed and grow within your role.</li>\n</ul>\n<p> </p>\n<p>At Woolf, you’ll have the chance to make a meaningful impact on the future of education while working in an innovative, mission-driven company. If you’re ready to join us in our mission to transform higher education, apply today!</p>\n<p><br><br></p>\n<div class=\"h2\">About the company</div>\n<p> </p>\n<p>Our mission at Woolf is to increase access to world-class higher education and ensure that it is globally recognized and transferable. Woolf is the first global collegiate university that lets qualified organizations join as accredited member colleges.</p>\n<img src=\"https://remotive.com/job/track/1959242/blank.gif?source=public_api\" alt=\"\"/>","tags":"[\"performance management\"]","pubDate":"2024-12-25T05:51:55.000Z","link":"https://remotive.com/remote-jobs/hr/talent-manager-hr-generalist-1959242","slug":"talent-manager-hr-generalist-woolf-8969"},{"id":4560026848,"title":"Backend Tech Lead","company":"Tabby","image":"https://remotive.com/job/1959149/logo","description":"<div><!--block--><strong>Tabby</strong> creates financial freedom in the way people shop, earn and save by reshaping their relationship with money. Over 5,000,000 active users choose Tabby to stay in control of their spending and make the most out of their money.<br>Over 30,000 global brands and small businesses, including H&amp;M, Adidas, IKEA, SHEIN, noon, Amazon, and Bloomingdale’s use Tabby’s technology to accelerate growth and gain loyal customers by offering flexible payments online and in stores. Tabby is active in Saudi Arabia, UAE, Bahrain, Qatar and Kuwait and backed by leading investors, including Sequoia Capital India, STV, PayPal Ventures, Mubadala Investment Capital, Arbor Ventures and others.<br><br>We're looking for a <strong>Backend Tech Lead</strong> for our <strong>Identity</strong> team. This pivotal role involves overseeing the development and management of our systems for collecting and storing data while ensuring secure and reliable user identity verification. Become a significant part of a core business unit with high visibility and impact by taking ownership of projects that directly influence the safety and trustworthiness of our services!</div>\n<p><br><br></p>\n<div class=\"h3\">What you'll get to do:</div>\n<div><!--block-->• Lead the development of backend solutions that are critical to securing customer data and maintaining company reputation; </div>\n<div><!--block--> • Drive the implementation of scalable systems to manage and score user data effectively;</div>\n<div><!--block--> • Ensure top-tier security practices to protect company assets and customer information.<br><strong><br>Some of the technologies you'll get to work with:</strong></div>\n<ul style=\"\">\n<li style=\"\"><!--block-->Golang;</li>\n<li style=\"\"><!--block-->PostgreSQL;</li>\n<li style=\"\"><!--block-->Redis;</li>\n<li style=\"\"><!--block-->Kubernetes;</li>\n<li style=\"\"><!--block-->Google Cloud Platform;</li>\n<li style=\"\"><!--block-->Gitlab.</li>\n</ul>\n<div><!--block--><br><br></div>\n<p><br><br></p>\n<div class=\"h3\">Job benefits:</div>\n<ul style=\"\">\n<li style=\"\"><!--block-->We offer flexible working hours and trust you to work enough hours to do your job well, at times that suit you and your team.</li>\n<li style=\"\"><!--block-->A working environment that gives you autonomy and responsibility from day one.</li>\n<li style=\"\"><!--block-->You should be comfortable with the idea that the quality of your work will influence the shape of your career.</li>\n<li style=\"\"><!--block-->Participation in company’s employee stock options program.</li>\n<li style=\"\"><!--block-->Health Insurance</li>\n</ul>\n<div><!--block--><strong>Relocation<br><br></strong>We offer remote work from anywhere in the world and are happy to work out an individual relocation plan for you.<br><br>Our employees have the opportunity to choose a country for registration: at the moment those are Armenia/Georgia/Serbia/Portugal/Spain.<br><br>We will help you open a legal entity and a bank account. In Armenia and Georgia the taxes are compensated by Tabby. In other countries we provide partial compensation of taxes.<br><br><strong>We employ according to B2B contracts (service agreements).</strong><br><br><strong>For our employees we cover the following:</strong></div>\n<ul style=\"\">\n<li style=\"\"><!--block-->Flight to one of the mentioned countries.</li>\n<li style=\"\"><!--block-->Accommodation during the paperwork completion period.</li>\n<li style=\"\"><!--block-->Opening a bank account and getting a residence permit in one of the mentioned countries.</li>\n<li style=\"\"><!--block-->Family relocation (dependants).</li>\n</ul>\n<div><!--block-->New employees can also choose an alternative method of relocation to another country of their choice. In this case, Tabby will reimburse up to $5,000 of verified costs upon opening a legal entity and a bank account.<br><br>We are passionate about creating an inclusive, high-performing workplace that gives people from all backgrounds the support they need to thrive, grow and meet their goals (whatever they may be).</div>\n<div><!--block--><br>If this sounds exciting to you, we’d love to hear from you!</div>\n<div><!--block--></div>\n<div><!--block--></div>\n<div><!--block--></div>\n<img src=\"https://remotive.com/job/track/1959149/blank.gif?source=public_api\" alt=\"\"/>","tags":"[\"golang\",\"kubernetes\",\"postgresql\",\"Redis\"]","pubDate":"2024-12-25T05:51:00.000Z","link":"https://remotive.com/remote-jobs/software-dev/backend-tech-lead-1959149","slug":"backend-tech-lead-tabby-5146"}]