[{"id":1466314136,"title":"Senior Kernel Developer for KernelCare - REMOTE/Work Anywhere","company":"CloudLinux","image":"https://pbs.twimg.com/profile_images/696718028084482050/ymY3OEPk_400x400.png","description":"<p>We are looking for <strong>Senior Kernel Developers</strong> to work on our KernelCare team. The ideal candidate is someone looking for a rewarding and challenging career developing Linux Kernels and patches. This role requires someone with strong C development skills and a passion for all that is Linux. Our Kernel Developers create patches with a cyber security focus while finding solutions for our customers. Please note, this is <strong>not</strong> an embedded Kernel role.  </p><p>KernelCare is a product of CloudLinux Inc., the maker of the #1 OS in security and stability for hosting providers. KernelCare, a live kernel patching service provides security patches and bug fixes for a range of popular Linux kernels that can be installed without rebooting the system. Check out our website for more information about our KernelCare Product <a href=\"https://tuxcare.com/live-patching-services/\" rel=\"nofollow noreferrer noopener\" class=\"external\">https://tuxcare.com/live-patching-services/</a></p><p></p><p>We are truly a great place to work. </p><p><strong>As our Senior Kernel Developer, you will be responsible for:</strong></p><ul> <li>Support existing functionality and implementation of several new features</li> <li>Update existing kernels including security fixes and CVEs patches</li> <li>Develop and support Python and Bash scripts for task automation</li> </ul><h3>Requirements: </h3><p><strong>To be successful in this role you should have:</strong></p><ul> <li>Excellent C programming and debugging skills</li> <li>Good level knowledge of Linux kernel core subsystems</li> <li>CPU and cache architectures</li> <li>Experience with GDB and other debuggers</li> <li>CPU performance and power analysis</li> <li>Independent and self-motivated problem solver and strategic thinker</li> <li>Proficient in Git for development and patch/branch management</li> <li>Good planning, time management, decision-making, presentation, and organization skills</li> <li>Effective written and verbal communication</li> <li>Excellent interpersonal and teamwork skills</li> <li>Happy in an agile, fast-paced environment</li> </ul><ul> <li>Experience with python, shell scripting</li> <li>Experience with Jenkins</li> </ul><h3>Benefits: </h3><p><strong>What's in it for you?</strong><br></p><ul> <li>A focus on professional development; </li> <li>Interesting and challenging projects</li> <li> Flexible working hours</li> <li>Paid one month vacation per year and unlimited sick leave</li> <li>Medical insurance reimbursement</li> <li>Co-working and gym/sports reimbursement</li> <li>The opportunity to receive a reward for the most innovative idea that the company can patent</li> </ul><p></p><p><em>By applying for this position, you agree with </em><a href=\"https://cloudlinux.com/privacy-policy\" rel=\"nofollow noreferrer noopener\" class=\"external\"><em>Cloudlinux Privacy Policy</em></a><em> and give us your consent to maintain and process your personal data with this respect. Please read our Privacy Policy for more information.</em></p>","tags":"[\"management\",\"cyber security\"]","pubDate":"2024-01-23 00:00:00.000","link":"https://apply.workable.com/cloudlinux-1/j/FD1C1CF92A","savedDate":"2024-01-24 03:15:03.669","slug":"senior-kernel-developer-for-kernelcare-remote-work-anywhere-cloudlinux-9296"},{"id":2710690178,"title":"Python Developer Internship - Remote Opportunity","company":"CloudLinux","image":"https://pbs.twimg.com/profile_images/696718028084482050/ymY3OEPk_400x400.png","description":"<p>We are seeking talented and motivated Python Developer Interns to join our CloudLinux team. As an intern at CloudLinux, you will have the opportunity to gain hands-on experience in Python development and contribute to the development of our innovative projects.</p><p>CloudLinux is a leading provider of Linux-based operating systems and security solutions for web hosting providers. Our products, including CloudLinux OS, KernelCare, and Imunify360, are used by thousands of companies worldwide.</p><p>As a Python Developer Intern, you will have the opportunity to:</p><ul> <li>Work on real-world projects and contribute to the development of our products</li> <li>Collaborate with our experienced development team and learn from industry professionals</li> <li>Gain experience in writing clean, efficient, and maintainable code</li> <li>Participate in code reviews and follow best practices</li> <li>Learn how to write effective unit tests and ensure quality in software development</li> <li>Get exposure to different areas of Python development, including backend development and system programming</li> </ul><p></p><p>This is a remote internship opportunity, allowing you to work from anywhere and have a flexible schedule.</p><p>If you are a passionate individual interested in gaining practical experience in Python development and contributing to meaningful projects, we would love to hear from you!</p><p>Apply now and kick-start your career with CloudLinux!</p><h3>Requirements: </h3><p><strong>To be considered for the Python Developer Internship role, you should have:</strong></p><ul> <li>Basic knowledge of Python programming language</li> <li>Understanding of software development principles and concepts</li> <li>Good problem-solving skills</li> <li>Ability to work independently and collaborate in a team environment</li> <li>Strong communication skills</li> <li>Enthusiasm and eagerness to learn</li> <li>Pursuing a degree in Computer Science, Software Engineering, or a related field (preferred)</li> <li>Availability to work part-time or full-time during the internship period</li> </ul><p>No prior work experience is required for this internship opportunity. We value motivation, willingness to learn, and a strong passion for software development.</p><h3>Benefits: </h3><p><strong>What's in it for you?</strong></p><ul> <li>Work on real project tasks in an Agile team</li> <li>A part-time role with 50% of your time dedicated to self-development (we'll provide a competency matrix and self-study materials)</li> <li>A dedicated mentor who's always ready to answer your questions</li> </ul><ul> <li>A focus on professional development;</li> <ul> <li>Training reimbursements</li> <li>Mentor programs</li> <li>Knowledge-Exchange programs</li> <li>Interesting and challenging projects</li> </ul> <li>Flexible working hours</li> </ul><p><em>By applying for this position, you agree with </em><a href=\"https://cloudlinux.com/privacy-policy\" rel=\"nofollow noreferrer noopener\" class=\"external\"><em>Cloudlinux Privacy Policy</em></a><em> and give us your consent to maintain and process your personal data with this respect. Please read our Privacy Policy for more information.</em></p>","tags":"[\"engineering\"]","pubDate":"2024-01-23 00:00:00.000","link":"https://apply.workable.com/cloudlinux-1/j/5346CFC870","savedDate":"2024-01-24 03:15:03.669","slug":"python-developer-internship-remote-opportunity-cloudlinux-3054"},{"id":8055599684,"title":"Finance Analyst","company":"Yield Guild Games","image":"https://remotive.com/job/1891735/logo","description":"<p></p><div class=\"h3\"><strong>Our Mission</strong></div>\n<p>At Yield Guild Games (YGG), we make gaming history. We are pioneers in blockchain gaming and a decentralized network of gaming guilds focused on blockchain games and web3 ecosystem development. YGG is on a mission to onboard millions into the open metaverse by providing high-value networks, access, and opportunities. We believe that by providing an equal opportunity support system, players around the world can achieve more - so we can all become power players in games and in life.</p>\n<div class=\"h3\"><strong>The Role</strong></div>\n<p>As a Finance Analyst, you will play a pivotal role in ensuring our organization's financial health and stability. Your primary responsibility will be maintaining accurate and comprehensive monthly reports on budgeting and treasury activities. By leveraging your analytical skills and financial acumen, you will contribute to informed decision-making processes and aid in the company's strategic financial planning.</p>\n<p><strong>Responsibilities</strong></p>\n<ul style=\"\"><li style=\"\">Prepare and analyze monthly budget reports, ensuring alignment with financial goals and objectives</li><li style=\"\">Monitor and track asset positions to ensure alignment with our asset management strategy</li><li style=\"\">Maintain a timely and orderly process for all monthly reports</li><li style=\"\">Works with team to improve system processes for, but not limited to, payments, operations, and reporting</li><li style=\"\">Assist the asset management team with strategy</li><li style=\"\">Ensure record-keeping and documentation are preserved throughout the organization pertaining to financial transactions</li></ul>\n<div class=\"h3\"><strong>What we're looking for</strong></div>\n<ul style=\"\"><li style=\"\">Bachelor's degree in Finance, Economics, or related field, or equivalent practical experience</li><li style=\"\">Min 1 year of professional experience</li><li style=\"\">Proficient in MS Office (e.g. Excel, PowerPoint, etc.)</li><li style=\"\">Bias for action, self-starter attitude, and the ability to execute new ideas with autonomy</li><li style=\"\">Proactive with good communication and interpersonal skills, a good team player</li><li style=\"\">A good problem solver, be able to work independently and under pressure </li><li style=\"\">Strong interests in blockchain and web3 technology</li></ul><p></p>\n<img src=\"https://remotive.com/job/track/1891735/blank.gif?source=public_api\" alt=\"\"/>","tags":"[\"excel\",\"blockchain\",\"documentation\",\"MS Office\",\"treasury\"]","pubDate":"2024-01-22 19:20:51.000","link":"https://remotive.com/remote-jobs/finance-legal/finance-analyst-1891735","savedDate":"2024-01-24 03:15:03.668","slug":"finance-analyst-yield-guild-games-6011"},{"id":5752534084,"title":"Director, Research & Development","company":"SOULCHI","image":"https://remotive.com/job/1886926/logo","description":"<p>Welcome to the forefront of transformational change. At SOULCHI, we are driven by a vision that blends virtues-based leadership, conscious growth, and a commitment to the United Nations Sustainable Development Goals. As an equity-based startup team member, you're not just joining a team; you're embarking on a journey to shape a more harmonious and sustainable world. We believe that true progress stems from the fusion of innovation and values, and that's exactly what you'll find here – a dynamic environment where your talents will thrive, your ideas will flourish, and your impact will resonate far beyond. Join us in rewriting the narrative of leadership and making a lasting difference that echoes through generations.</p>\n<p> </p>\n<p>This is more than a job; it's an opportunity to shape the future and claim a stake in our mission. Flexibility is at the core of this position, offering you the chance to contribute your strengths on either a full-time or part-time basis.  We are flexible for the right candidate.</p>\n<p><strong> </strong></p>\n<p><strong>Unleash Creativity, Shape Tomorrow: Join the SOULCHI Innovation &amp; Research Team</strong></p>\n<p>Are you fueled by curiosity, driven by innovation, and passionate about shaping the future? Here's your chance to be a pioneer of transformation, a seeker of knowledge, and a catalyst for change – become an integral part of the SOULCHI Innovation &amp; Research Team.</p>\n<p><strong>Ignite Curiosity: Explore Boundless Horizons of Possibility:</strong></p>\n<p>As a member of our Innovation &amp; Research Team, you'll embark on a journey of endless exploration. Your insatiable curiosity will lead you to new horizons, uncovering insights, trends, and technologies that hold the key to shaping the world of conscious leadership, personal growth, and positive impact.</p>\n<p><strong>Be the Architect of Change: Transform Ideas into Actionable Solutions:</strong></p>\n<p>Your role goes beyond mere observation – you'll be the architect of change, transforming innovative ideas into actionable solutions. Your creative thinking and strategic vision will help us enhance the SOULCHI experience, creating tools, features, and strategies that empower individuals and organizations to thrive.</p>\n<p><strong>Challenge the Norm: Pioneer New Paradigms of Growth:</strong></p>\n<p>By joining our Innovation &amp; Research Team, you're embracing the call to challenge the norm and pioneer new paradigms of growth. Your insights will disrupt conventional thinking, leading to breakthroughs that redefine how we approach personal development, virtues-based leadership, and global transformation.</p>\n<p><strong>Uncover Hidden Gems: Illuminate Insights that Inspire Impact</strong></p>\n<p>Each research endeavor is a journey to uncover hidden gems – insights that hold the power to inspire profound impact. Your dedication to unearthing these gems will contribute to the refinement of our offerings, making virtues-based growth accessible, actionable, and deeply transformative.</p>\n<p><strong>Collaborate and Elevate: Shape the Future with Like-Minded Visionaries:</strong></p>\n<p>Innovation knows no boundaries, and as a member of our team, you'll collaborate with like-minded visionaries. Together, you'll engage in thought-provoking discussions, brainstorming sessions, and creative endeavors that have the potential to reshape societies, organizations, and lives.</p>\n<p><strong>Champions of Progress: Lead the Charge for Continuous Advancement</strong></p>\n<p>By becoming a part of the SOULCHI Innovation &amp; Research Team, you're stepping into the role of a champion of progress. Your efforts will drive us forward, ensuring that we remain at the forefront of transformative technologies, strategies, and methodologies that fuel positive change.</p>\n<p><strong>Embrace the Journey of Discovery: Ignite Minds, Shape Destinies:</strong></p>\n<p>Embrace the journey of discovery, the path of innovation, and the opportunity to ignite minds and shape destinies. Apply now to be a part of the SOULCHI Innovation &amp; Research Team and embark on a transformative adventure that leads us toward a brighter, more harmonious future.</p>\n<p><strong>Equity-Based Opportunity:</strong></p>\n<p>This is more than a job; it's an opportunity to own a piece of the future. As part of the SOULCHI team, you'll take part in our equity-based compensation model, aligning your success with the success of our mission.</p>\n<p><strong>Be the Change: Join SOULCHI!</strong></p>\n<p>Embark on a journey that goes beyond the ordinary. Join us in rewriting the narrative of leadership and sustainable impact. This is not just a job; it's an invitation to be part of something revolutionary. Apply now, and let's shape the future together.</p>\n<img src=\"https://remotive.com/job/track/1886926/blank.gif?source=public_api\" alt=\"\"/>","tags":"[\"research\",\"startup\",\"Fusion\",\"catalyst\"]","pubDate":"2024-01-22 17:20:21.000","link":"https://remotive.com/remote-jobs/business/director-research-development-1886926","savedDate":"2024-01-24 03:15:03.668","slug":"director-research-development-soulchi-8836"}]