[{"id":1020666254,"title":"HR Intern (Immediate Hire) - Fully Remote","company":"CoverGo","image":"https://pbs.twimg.com/profile_images/1382655628523364355/MWPIbbID_400x400.jpg","description":"<p><strong>Top 3 Reasons To Join Us</strong></p><ul> <li>International Environment</li> <li>100% Remote</li> <li>Exposure to Diverse HR Functions</li> </ul><p><strong>About Us</strong></p><p>At CoverGo, our mission is to empower all insurance companies to make insurance 100% digital and accessible to everyone.</p><ul> <li>We are a leading global no-code insurance platform for health, life, and P&amp;C</li> <li>We’re the winner of the Insurtech of the Year in all of Asia and other awards globally</li> <li>We work with insurance enterprise clients such as AXA, Bupa, MSIG, Dai-ichi, Bank of China Group Insurance, and many more</li> <li>We're an international, diverse team of over 120 people with 30 nationalities and team members working remotely from all over the world</li> <li>We are fully funded and backed by reputable VC funds and strategic institutional investors</li> <li>We have a global presence in Asia, EMEA and the Americas</li> <li>We’ve grown our annualized revenue by over 30x since January 2021</li> <li>We’re constantly working towards making CoverGo a workplace that you love coming to. We deeply believe that bringing together a diversity of thoughts, expressions, and perspectives is key to building the best culture for equally diverse communities all over the world</li> </ul><p><strong>About the Role</strong></p><p>We are seeking a motivated and enthusiastic Human Resources Intern to join our HR team. This is a fantastic opportunity for a student or recent graduate who is looking to gain practical experience in a dynamic and fast-paced environment.</p><p>The HR Intern will assist with various HR tasks and projects, including recruitment, employee onboarding, HR administration, and employee engagement initiatives.</p><p><strong>What You Will Do</strong></p><ul> <li>Assist with recruitment activities, such as posting job ads, screening resumes, and scheduling interviews</li> <li>Support the onboarding process for new hires</li> <li>Assist with HR administrative tasks, including but not limited to maintaining employee records and updating HR databases</li> <li>Organize employee engagement initiatives and events</li> <li>Contribute to HR projects and process improvements</li> <li>Provide general HR support as needed</li> </ul><p><strong>What We Need</strong></p><ul> <li>Currently enrolled in a Bachelor's degree program in Human Resources, Business Administration, or a related field, or a recent graduate</li> <li>Strong organizational and time management skills</li> <li>Excellent communication and interpersonal skills</li> <li>Ability to maintain confidentiality and handle sensitive information</li> <li>Proficiency in Google Workspace</li> <li>Keen attention to detail</li> <li>Proactive and willing to take initiative</li> <li>Ability to work collaboratively in a team environment</li> <li>Positive attitude and eagerness to learn</li> <li>Must be based in the Philippines</li> </ul><p>Please be advised that this internship opportunity is unpaid</p><p><strong>Why You'll Love Working Here</strong></p><ul> <li>Remote Setup</li> <li>International Environment</li> <li>Professional Development Opportunities</li> <li>Company activities and events</li> </ul><p><strong>CoverGo Company</strong><a href=\"https://www.youtube.com/watch?v=YI0ezLxvFvA\" rel=\"nofollow noreferrer noopener\" class=\"external\"><strong> Video</strong></a></p><p>By submitting your application, you confirm that you have read, understood, and accepted the content of CoverGo’s <a href=\"https://apply.workable.com/covergo/gdpr_policy?lng=en\" target=\"_blank\" rel=\"nofollow noreferrer noopener\" class=\"external\">Privacy Notice</a> and you consent to the processing of your data as part of this application.</p><h3>Requirements: </h3><h3>Benefits: </h3>","tags":"[\"management\",\"database\"]","pubDate":"2024-12-20T00:00:00.000Z","link":"https://apply.workable.com/covergo/j/6A91C293A0","slug":"hr-intern-immediate-hire-fully-remote-covergo-9812"},{"id":3523221328,"title":"TECHNICAL IMPLEMENTATION SPECIALIST (Work from anywhere in the world)","company":"Wishpond","image":"https://yt3.googleusercontent.com/godmUZWusLdpmQ_8MgednMJQy7ZInLrCJ0KkUxuHnx3jeZubp774PPTdp_8MAWcWlbjYx9SX=s160-c-k-c0x00ffffff-no-rj","description":"<div><b style=\"font-size: 18px;\">Wishpond Technologies currently has the position of&nbsp;Technical Implementation Specialist available, and we’re excited to tell you about it !</b></div><div><span style=\"font-size: 22px;\">&nbsp;</span></div><div><b style=\"font-size: 24px;\">OVERVIEW</b></div><div>As a Technical Implementation Specialist&nbsp;<b>(with fluent English skills)</b>, your primary focus will be on building, setting up , and optimizing AI-driven automation that enhances the efficiency and productivity of our sales team. Additionally, you will be responsible for QA, ensuring all systems and agents perform flawlessly in live environments. At Wishpond, we specialize in providing cutting-edge solutions for modern sales teams, enabling them to work smarter and close deals faster. We are seeking a Technical Account Manager with a unique blend of technical expertise and sales acumen to design and build automation. This is a new role for us, and we’re excited about it.</div><div><br></div><div><b style=\"font-size: 24px;\">RESPONSIBILITIES</b></div><div>• Quality Assurance (QA): Test and review chat agents and other sales solutions to ensure they are functioning as intended, troubleshooting any issues and implementing necessary fixes.</div><div>• Solution Customization: Work with Technical Account Managers to customize chat agent behavior and responses to align with specific customer workflows and business objectives.</div><div>• Feedback Loop: Collect feedback to continuously improve chat agents and other sales technologies.</div><div>• Documentation: Create clear and comprehensive documentation for chat agents, including their setup, capabilities, and any troubleshooting guides.</div><div>• Estimate, prioritize, plan and coordinate testing activities.</div><div>•  Design, develop and improve test processes including setting up test environments and tools to maximize the efficiency and effectiveness of Salescloser AI.</div><div>• Other duties as assigned</div><div><br></div><div><b style=\"font-size: 24px;\">QUALIFICATIONS</b></div><div>• Bachelor’s Degree in Engineering, Information Technology, Computer Science, or related fields (or equivalent experience)</div><div>• Strong communication skills, capable of presenting technical information on sales calls in a clear and compelling manner</div><div>• Experience in Quality Assurance (QA) testing and troubleshooting, ensuring reliable performance in real-world settings</div><div>• Experience working with sales teams in a fast-paced, tech-driven environment.</div><div>• Familiarity with customer service automation and its application in sales processes.</div><div>• A problem-solving mindset with a focus on continuous improvement of sales and technical workflows</div><div>• As part of a diverse team, ability to work both independently and collaboratively&nbsp;in a fast-paced, results-oriented environment</div><div>• Organized, administratively strong,&nbsp;great time management, and have solid writing, phone, and general communication skills</div><div>• Fluent in English (spoken and written). Knowledge of a second language is considered an asset</div><div>• Willing to participate in ongoing education and training for the role</div><div><br></div><div><b style=\"font-size: 24px;\">WORK ENVIRONMENT</b></div><div>• It is expected that the successful candidate will provide their own workstation, computer, and headset, and have a fast and reliable internet connection. This position may be required to download and utilize company software</div><div>• The individual must be prepared to work standard business hours based on Pacific Time Zone</div><div>• Due to the nature of this role, we may verify backgrounds including conducting employment references, criminal record, and credit checks</div><div>• Once hired, the successful candidate must provide valid government-issued photo ID and proof of residential address as part of their onboarding process</div><div><br></div><div><b style=\"font-size: 24px;\">GREAT REASONS TO JOIN OUR TEAM</b></div><div>• Fully remote position allowing you to <b>work from your home anywhere in the world !</b></div><div>• Exciting and dynamic environment with a great leadership team&nbsp;</div><div>• Comprehensive training program and regular performance reviews to facilitate your success</div><div>• Competitive compensation based on experience and proven abilities</div><div>• Great referral programs with incentives and bonuses</div><div>• Unbelievable product discounts when you use our products for your own business</div><div>• A global workforce of multi-cultural and talented colleagues&nbsp;</div><div>• A close-knit operation with amazing growth opportunities for your personal development</div><div>• A high growth SaaS technology company publicly traded on the TSX Venture Exchange</div><div>• Corporate headquarters in beautiful Vancouver, British Columbia, Canada</div><div>• Access to our education credits program and so much more !</div><div><br></div><div><b style=\"font-size: 24px;\">ABOUT US</b></div><div><span style=\"font-size: 15px;\">Founded in 2009, Wishpond is a rapidly growing technology company providing digital marketing solutions targeted at small businesses.&nbsp; The cloud-based platform includes landing pages, social promotions, website pop-ups, online forms, and lead activity tracking. Wishpond has a dedicated team of professional project managers, designers, copywriters, and developers who provide marketing services tailored to our individual clients.</span></div><div><span style=\"font-size: 16px;\">&nbsp;</span></div><div><span style=\"font-size: 15px;\">Wishpond serves over 3,000 customers in various industries and sizes, from startups to large fortune 500 companies. Wishpond has a rapidly growing global headcount and continues to hire dedicated and qualified employees and contractors who have what it takes to scale a successful software company.</span></div><div><br></div><div><span style=\"font-size: 16px;\">To learn more about Wishpond Technologies, please visit our website or any of our social media platforms:</span></div><div><br></div><div><span style=\"font-size: 16px;\">• Website: </span><a rel=\"noopener noreferrer\" class=\"postings-link\" style=\"font-size: 16px;\" href=\"http://www.wishpond.com/\">www.wishpond.com</a></div><div><span style=\"font-size: 16px;\">• Glassdoor: Wishpond Technologies</span></div><div><span style=\"font-size: 16px;\">• Instagram: @wishpondofficial</span></div><div><span style=\"font-size: 16px;\">• Twitter: Wishpond</span></div><div><span style=\"font-size: 16px;\">• Youtube: Thewishpond</span></div><div><span style=\"font-size: 16px;\">• LinkedIn : Wishpond</span></div><div><br></div><div><b style=\"font-size: 24px;\">APPLICATION PROCESS</b></div><div>&nbsp;<b style=\"font-size: 16px;\">If you are interested in applying for this exciting opportunity, please provide an updated resume in English (PDF or Word formats only), quoting the position title in the subject line of your cover letter</b></div><div><span style=\"font-size: 16px;\">&nbsp;</span></div><div><span style=\"font-size: 15px;\">Wishpond Technologies is an equal opportunity employer committed to hiring a diverse workforce and sustaining an inclusive culture that does not discriminate on the basis of disability, status or any other basis protected under legislation</span></div><div><span style=\"font-size: 16px;\">&nbsp;</span></div><div><span style=\"font-size: 15px;\">We thank all applicants in advance for their interest in this position however due to the volume of applications we receive, we are unable to respond to phone, email, or agency inquiries</span></div><div><br></div><div><b><i><span style=\"font-size: 24px;\">Internal applications close on Wednesday, December 25th at 5:00PM PT</span></i></b></div>","tags":"[\"management\",\"engineering\"]","pubDate":"2024-12-19T23:05:50.406Z","link":"https://jobs.lever.co/wishpond/159edbba-7ba0-41a6-9c6a-9ed994b68c75","slug":"technical-implementation-specialist-work-from-anywhere-in-the-world-wishpond-5127"},{"id":1061859193,"title":"Staff Move Engineer","company":"Avara","image":"https://pbs.twimg.com/profile_images/1725197105923293184/0HcwlDMy_400x400.jpg","description":"<div><b style=\"font-size: 16px;\">About us:</b></div><div><span style=\"font-size: 16px;\">Avara is a group of software development companies that build open-source, blockchain-based software for the Web3 world. With a mission to reinvent our modern paradigms in the realm of finance, social media and beyond, we are focused on building revolutionary products and protocols that will reinvent the ways we communicate, our financial systems, and our cultural norms. United with one clear goal, Avara is determined to build a future for users that provide them with better control over their finances, data and social experiences.</span></div><div><br></div><div><b style=\"font-size: 16px;\">Our culture:</b></div><div><span style=\"font-size: 16px;\">Having cultivated a thriving, collaborative culture, our team is kind, welcoming and passionate about what we are building. We celebrate differences and seek to develop and retain the most talented people from a diverse candidate pool from all over the world. No matter where you are based, no ghost will be left behind and we appreciate every moment we get to work and have fun together.</span></div><div><br></div><div><b style=\"font-size: 16px;\">About the role:</b></div><div><span style=\"font-size: 16px;\">Avara is looking for a staff Move engineer to innovate and build upon our various products and services. You should have a strong passion for web3 technology and an understanding of smart contract development and blockchain systems. In this role, you will be responsible for designing, implementing, and writing smart contracts in Move. You will also be interacting with smart contracts in solidity and other EVM based networks. You will work closely with the Avara leadership, product and technical teams.</span></div><div><b style=\"font-size: 16px;\">About us:</b></div><div><span style=\"font-size: 16px;\">Avara is a group of software development companies that build open-source, blockchain-based software for the Web3 world. With a mission to reinvent our modern paradigms in the realm of finance, social media and beyond, we are focused on building revolutionary products and protocols that will reinvent the ways we communicate, our financial systems, and our cultural norms. United with one clear goal, Avara is determined to build a future for users that provide them with better control over their finances, data and social experiences.</span></div><div><br></div><div><b style=\"font-size: 16px;\">Our culture:</b></div><div><span style=\"font-size: 16px;\">Having cultivated a thriving, collaborative culture, our team is kind, welcoming and passionate about what we are building. We celebrate differences and seek to develop and retain the most talented people from a diverse candidate pool from all over the world. No matter where you are based, no ghost will be left behind and we appreciate every moment we get to work and have fun together.</span></div><div><br></div><div><b style=\"font-size: 16px;\">About the role:</b></div><div><span style=\"font-size: 16px;\">Avara is looking for a staff Move engineer to innovate and build upon our various products and services. You should have a strong passion for web3 technology and an understanding of smart contract development and blockchain systems. In this role, you will be responsible for designing, implementing, and writing smart contracts in Move. You will also be interacting with smart contracts in solidity and other EVM based networks. You will work closely with the Avara leadership, product and technical teams.</span></div><h3>How you can make an impact:</h3><li>Designing, crafting, and testing secure Move based code</li><li>Participating in the development of protocol-level infrastructure and tools</li><li>Collaborating with cross-functional teams to define, design, and ship new features and functionality</li><li>Responding to security vulnerabilities, simulating the scenario, and evaluating a strategy and response</li><li>Debugging and troubleshooting issues that arise during the development process</li><li>Reviewing code written by other engineers to ensure it meets the required standards and specifications with a focus on security</li><li>Staying up to date with developments in the web3 ecosystem and incorporating new technologies as appropriate</li><li>Providing technical guidance, support, and mentoring to other engineers as needed</li><h3>Let's connect if:</h3><li>Extensive experience with Rust and/or Move</li><li>You have previous experience and/or an adequate understanding of DeFi concepts such as tokens, minting, lending/borrowing, financial pools, staking and related concepts</li><li>Previous experience in writing smart contracts (EVM, non-EVM chains) and profound understanding of contracts architecture, attack vectors, vulnerabilities and design patterns are very welcome</li><li>Previous experience with decentralized financial oracles is very welcome</li><li>You are someone who builds, innovates, and ships features with the highest standards</li><li>You have expertise in Move and have high degree of comfort with advanced concepts</li><li>You have experience with network and distributed systems programming in particular as a nice-to-have as well</li><li>You research constantly and keep up with the latest hacks, tooling, and security practices</li><li>Are passionate about DeFi and Social</li><div>Haven’t quite met all the criteria? Let’s not miss out on the chance to speak. Whilst you might not meet every single requirement, you might bring other, more exciting skills to the companies! </div><div><br></div><div><b>What we stand for: </b></div><div><br></div><div><i><b>Craft</b> — Seek excellence.</i></div><div><b>Accountability</b> —&nbsp;<i>One for all. All for one.</i></div><div><b>Integrity</b> —&nbsp;<i>Be true.</i></div><div><i><b>Sisu</b> — Dig deep.</i></div><div><b>Community</b> —&nbsp;<i>We’re in it together.</i>&nbsp;</div><div><br></div><div><b>Equal opportunities statement:</b>&nbsp;</div><div><br></div><div>Avara celebrates diversity and views each and every team member as a separate individual with their own unique identity. No matter your race, religion, gender, ethnicity, age, disability, sexual orientation or even the wallet you use, we welcome you at Avara. As an equal opportunities employer, we take accountability and believe in everyone's potential to build, create and inspire changes. With a mission to build a diverse workforce, we are proud to foster a working environment in which everyone can feel safe and valued for who they are.</div>","tags":"[\"Finance\"]","pubDate":"2024-12-19T12:30:39.312Z","link":"https://jobs.eu.lever.co/avara/87cc183a-39cc-44dc-a7da-88f1ab8fa2ad","slug":"staff-move-engineer-avara-5349"},{"id":7410332826,"title":"Staff Move Engineer","company":"Avara","image":"https://pbs.twimg.com/profile_images/1725197105923293184/0HcwlDMy_400x400.jpg","description":"<div><b style=\"font-size: 16px;\">About us:</b></div><div><span style=\"font-size: 16px;\">Avara is a group of software development companies that build open-source, blockchain-based software for the Web3 world. With a mission to reinvent our modern paradigms in the realm of finance, social media and beyond, we are focused on building revolutionary products and protocols that will reinvent the ways we communicate, our financial systems, and our cultural norms. United with one clear goal, Avara is determined to build a future for users that provide them with better control over their finances, data and social experiences.</span></div><div><br></div><div><b style=\"font-size: 16px;\">Our culture:</b></div><div><span style=\"font-size: 16px;\">Having cultivated a thriving, collaborative culture, our team is kind, welcoming and passionate about what we are building. We celebrate differences and seek to develop and retain the most talented people from a diverse candidate pool from all over the world. No matter where you are based, no ghost will be left behind and we appreciate every moment we get to work and have fun together.</span></div><div><br></div><div><b style=\"font-size: 16px;\">About the role:</b></div><div><span style=\"font-size: 16px;\">Avara is looking for a staff Move engineer to innovate and build upon our various products and services. You should have a strong passion for web3 technology and an understanding of smart contract development and blockchain systems. In this role, you will be responsible for designing, implementing, and writing smart contracts in Move. You will also be interacting with smart contracts in solidity and other EVM based networks. You will work closely with the Avara leadership, product and technical teams.</span></div><div><b style=\"font-size: 16px;\">About us:</b></div><div><span style=\"font-size: 16px;\">Avara is a group of software development companies that build open-source, blockchain-based software for the Web3 world. With a mission to reinvent our modern paradigms in the realm of finance, social media and beyond, we are focused on building revolutionary products and protocols that will reinvent the ways we communicate, our financial systems, and our cultural norms. United with one clear goal, Avara is determined to build a future for users that provide them with better control over their finances, data and social experiences.</span></div><div><br></div><div><b style=\"font-size: 16px;\">Our culture:</b></div><div><span style=\"font-size: 16px;\">Having cultivated a thriving, collaborative culture, our team is kind, welcoming and passionate about what we are building. We celebrate differences and seek to develop and retain the most talented people from a diverse candidate pool from all over the world. No matter where you are based, no ghost will be left behind and we appreciate every moment we get to work and have fun together.</span></div><div><br></div><div><b style=\"font-size: 16px;\">About the role:</b></div><div><span style=\"font-size: 16px;\">Avara is looking for a staff Move engineer to innovate and build upon our various products and services. You should have a strong passion for web3 technology and an understanding of smart contract development and blockchain systems. In this role, you will be responsible for designing, implementing, and writing smart contracts in Move. You will also be interacting with smart contracts in solidity and other EVM based networks. You will work closely with the Avara leadership, product and technical teams.</span></div><h3>How you can make an impact:</h3><li>Designing, crafting, and testing secure Move based code</li><li>Participating in the development of protocol-level infrastructure and tools</li><li>Collaborating with cross-functional teams to define, design, and ship new features and functionality</li><li>Responding to security vulnerabilities, simulating the scenario, and evaluating a strategy and response</li><li>Debugging and troubleshooting issues that arise during the development process</li><li>Reviewing code written by other engineers to ensure it meets the required standards and specifications with a focus on security</li><li>Staying up to date with developments in the web3 ecosystem and incorporating new technologies as appropriate</li><li>Providing technical guidance, support, and mentoring to other engineers as needed</li><h3>Let's connect if:</h3><li>Extensive experience with Rust and/or Move</li><li>You have previous experience and/or an adequate understanding of DeFi concepts such as tokens, minting, lending/borrowing, financial pools, staking and related concepts</li><li>Previous experience in writing smart contracts (EVM, non-EVM chains) and profound understanding of contracts architecture, attack vectors, vulnerabilities and design patterns are very welcome</li><li>Previous experience with decentralized financial oracles is very welcome</li><li>You are someone who builds, innovates, and ships features with the highest standards</li><li>You have expertise in Move and have high degree of comfort with advanced concepts</li><li>You have experience with network and distributed systems programming in particular as a nice-to-have as well</li><li>You research constantly and keep up with the latest hacks, tooling, and security practices</li><li>Are passionate about DeFi and Social</li><div>Haven’t quite met all the criteria? Let’s not miss out on the chance to speak. Whilst you might not meet every single requirement, you might bring other, more exciting skills to the companies! </div><div><br></div><div><b>What we stand for: </b></div><div><br></div><div><i><b>Craft</b> — Seek excellence.</i></div><div><b>Accountability</b> —&nbsp;<i>One for all. All for one.</i></div><div><b>Integrity</b> —&nbsp;<i>Be true.</i></div><div><i><b>Sisu</b> — Dig deep.</i></div><div><b>Community</b> —&nbsp;<i>We’re in it together.</i>&nbsp;</div><div><br></div><div><b>Equal opportunities statement:</b>&nbsp;</div><div><br></div><div>Avara celebrates diversity and views each and every team member as a separate individual with their own unique identity. No matter your race, religion, gender, ethnicity, age, disability, sexual orientation or even the wallet you use, we welcome you at Avara. As an equal opportunities employer, we take accountability and believe in everyone's potential to build, create and inspire changes. With a mission to build a diverse workforce, we are proud to foster a working environment in which everyone can feel safe and valued for who they are.</div>","tags":"[\"Finance\"]","pubDate":"2024-12-19T12:28:29.660Z","link":"https://jobs.eu.lever.co/avara/9cc47e4d-7cd7-44f0-bfe3-ee72718ff597","slug":"staff-move-engineer-avara-3463"},{"id":5027650738,"title":"SEO Outreach Specialist","company":"Skrapp.io","image":"https://remotive.com/job/1951743/logo","description":"<p>Skrapp.io is seeking a proactive and strategic <strong>Outreach Specialist</strong> to join our team. This role is pivotal in building and maintaining relationships that drive the success of our SEO and digital marketing initiatives. The ideal candidate is a natural networker, highly organized, and has a strong understanding of SEO and link-building strategies.</p>\n<p> </p>\n<p><strong>Key Responsibilities:</strong></p>\n<p><strong> </strong></p>\n<p><strong>Backlink Acquisition</strong></p>\n<ul style=\"\">\n<li style=\"\">Identify opportunities for gaining high-quality backlinks by reaching out to relevant websites, influencers, and bloggers.</li>\n<li style=\"\">Develop personalized outreach strategies to ensure maximum success in backlink acquisition efforts.</li>\n</ul>\n<p><strong>Relationship Building</strong></p>\n<ul style=\"\">\n<li style=\"\">Establish and nurture connections with webmasters, bloggers, and industry influencers.</li>\n<li style=\"\">Negotiate guest posting opportunities, content collaborations, or mention placements to build mutually beneficial relationships.</li>\n</ul>\n<p><strong>Content Promotion</strong></p>\n<ul style=\"\">\n<li style=\"\">Promote content to external platforms to expand its reach and visibility.</li>\n<li style=\"\">Pitch shareable content to relevant websites for syndication or sharing.</li>\n</ul>\n<p><strong>Guest Blogging</strong></p>\n<ul style=\"\">\n<li style=\"\">Write or coordinate the creation of guest posts on third-party websites that strategically include backlinks to our target website.</li>\n</ul>\n<p><strong>Competitor Research</strong></p>\n<ul style=\"\">\n<li style=\"\">Analyze competitor backlink profiles to uncover potential opportunities and refine outreach strategies.</li>\n<li style=\"\">Identify and leverage content or backlink gaps for a competitive edge.</li>\n</ul>\n<p><strong>Link Monitoring and Reporting</strong></p>\n<ul style=\"\">\n<li style=\"\">Track acquired backlinks to ensure they remain active and valuable.</li>\n<li style=\"\">Regularly report on outreach effectiveness and the impact of link-building campaigns.</li>\n</ul>\n<p><strong>Collaboration with Content Teams</strong></p>\n<ul style=\"\">\n<li style=\"\">Work closely with content creators to develop high-quality, shareable content that adds value to external websites and audiences.</li>\n</ul>\n<p><strong>Competitor Analysis</strong></p>\n<ul style=\"\">\n<li style=\"\">Examine SEO strategies of competitors to uncover new opportunities and innovative approaches.</li>\n<li style=\"\">Identify and act on content or backlink opportunities based on competitor research.</li>\n</ul>\n<p><strong>Monitoring and Reporting</strong></p>\n<ul style=\"\">\n<li style=\"\">Track metrics such as rankings, organic traffic, click-through rates (CTR), and conversion rates.</li>\n<li style=\"\">Provide stakeholders with actionable reports on SEO performance and adjust strategies based on data insights.</li>\n</ul>\n<p><strong>Staying Updated with SEO Trends</strong></p>\n<ul style=\"\">\n<li style=\"\">Keep up-to-date with search engine algorithm changes and industry trends.</li>\n<li style=\"\">Adjust outreach and SEO strategies to align with the latest updates and best practices.</li>\n<li style=\"\">Attend industry conferences, participate in online communities, and follow authoritative SEO resources to stay ahead.</li>\n</ul>\n<p><strong> </strong></p>\n<p><strong>Requirements</strong></p>\n<ul style=\"\">\n<li style=\"\">5-10 years of experience in successfully executing SEO outreach strategies and other aspects of SEO.</li>\n<li style=\"\">Understanding of search engine algorithms and ranking methods.</li>\n<li style=\"\">Experience with SEO industry programs, such as Google Analytics.</li>\n<li style=\"\">Knowledge of keyword research and data mining tools.</li>\n<li style=\"\">Able to complete competitive analysis of other companies within the industry.</li>\n<li style=\"\">Excellent written and verbal communication skills (email, phone, etc.).</li>\n<li style=\"\">Comfortable analyzing high volumes of data on a daily basis.</li>\n<li style=\"\">Familiarity with SEO tools like SEMrush, AHrefs, Similarweb, Moz, and Google Search Console.</li>\n<li style=\"\">Experience with other aspects of marketing, such as customer growth and promotion, is a plus.</li>\n</ul>\n<p><strong> </strong></p>\n<p><strong>Benefits</strong></p>\n<p><strong><em><u> </u></em></strong></p>\n<p><em><u>Contract</u></em></p>\n<p>We only offer contractor/freelancer contracts to our team members with yearly paid days off:</p>\n<p><strong>- 25</strong> days per year</p>\n<p><strong>- 5</strong> national days off per year per choice depending on your country of residence</p>\n<p>The contractor will pay for your local health insurance and retirement plan independently.<em><br><br><u>Work Environment</u></em></p>\n<p>We are a team of young professionals working remotely from Spain, France, Egypt, India, Brazil, USA, and the United Arab Emirates. The position is fully remote; you will enjoy flexible working hours from anywhere worldwide.</p>\n<p><u> </u></p>\n<p><strong>Note</strong></p>\n<p>Please be aware that the default job country listed in our job posting is a requirement of our Applicant Tracking System (ATS) and does not reflect any geographic restrictions for this position.</p>\n<p>We welcome applications from candidates <strong>worldwide</strong>, regardless of location. This role is open to individuals from all countries.</p>\n<img src=\"https://remotive.com/job/track/1951743/blank.gif?source=public_api\" alt=\"\"/>","tags":"[\"seo\",\"research\",\"analytics\",\"digital marketing\",\"google analytics\",\"ATS\",\"SEMRush\",\"insurance\"]","pubDate":"2024-12-18T19:00:49.000Z","link":"https://remotive.com/remote-jobs/marketing/seo-outreach-specialist-1951743","slug":"seo-outreach-specialist-skrapp-io-5493"},{"id":9293043824,"title":"Senior/Team Lead CV Engineer","company":"Social Discovery Group","image":"https://remotive.com/job/1957995/logo","description":"<p> </p>\n<p><a href=\"https://socialdiscoverygroup.com/about-us\" rel=\"nofollow\" style=\"text-decoration: none;\"><strong>Social Discovery Group</strong></a> (SDG) is the 3rd largest social discovery company in the world, uniting 60+ brands with 500 million users. We solve the problems of loneliness, isolation, and disconnection by transforming virtual intimacy into the new normal. Our portfolio includes online communication platforms focusing on AI, game mechanics, and video streaming - Dating.com, DateMyAge, Cupid Media, Dil Mil, Kiseki, and others. </p>\n<p><strong>SDG invests in IT startups around the world.</strong> Our investments include Open AI, Patreon, Flo, Clubhouse, Woebot, Flure, Astry, Coursera, Academia.edu, and many others.</p>\n<p>We bring together a team of like-minded people and IT professionals specializing in the creation and development of globally impactful social discovery products. Our international team of 1200 professionals and digital nomads works all over the world. </p>\n<p><strong>Our teams of digital nomads</strong> work remotely from <strong>Cyprus, Malta, the USA, Armenia, Georgia, Kazakhstan, Montenegro, Poland, Latvia, Serbia, Spain, Portugal, UAE,  Israel, Turkey, Thailand, Indonesia, Japan, Hong Kong, Australia and many other locations. </strong></p>\n<p>In August 2024, we achieved <strong>Great Place to Work US Certification™! </strong>This achievement reflects our core belief that a truly exceptional workplace is built on trust, pride, and camaraderie—not just great perks.</p>\n<p>We are looking for a<strong> Senior or Team Lead CV Engineer </strong>to join one of our investment products in the Conversational AI field.</p>\n<p>Our product consists of virtual partners for interactive communication and flirting. These are customizable characters that users can interact with on any topic, including the most intimate ones, using text, voice messages, photos, and videos. Full confidentiality is our top priority.</p>\n<p>We aim to improve the quality of communication between bots and users. The main goal is to optimize the relevance and engagement of dialogues, as well as to increase the average transaction value.</p>\n<p> </p>\n<p><strong>Your main tasks will be:</strong></p>\n<p> </p>\n<ul style=\"\">\n<li style=\"\">Train and fine-tune generative models such as text-to-image, video-to-image, image-to-image, and IP-adapters;</li>\n<li style=\"\">Train image classifiers, rankers, and image/video captioning models;</li>\n<li style=\"\">Develop a CV roadmap for the ML team, keeping up with the latest technologies and advancements in open-source solutions;</li>\n<li style=\"\">Establish a process for iterative improvement and validation of CV model quality;</li>\n<li style=\"\">Optionally, train multimodal bots;</li>\n<li style=\"\">Lead a CV team of approximately 2-3 members.</li>\n</ul>\n<p><strong>We expect from you:</strong></p>\n<ul style=\"\">\n<li style=\"\">Proven experience in training diffusion models and modifying their architectures;</li>\n<li style=\"\">Familiarity with Diffusers and Transformers libraries;</li>\n<li style=\"\">Hands-on experience with IP-adapters;</li>\n<li style=\"\">Proficiency in training flow matching;</li>\n<li style=\"\">Knowledge of diffusion model distillation;</li>\n<li style=\"\">Experience with DPO and other methods for fine-tuning text-to-image models;</li>\n<li style=\"\">Proficiency in fine-tuning text-to-video models;</li>\n<li style=\"\">Experience with fine-tuning CLIP models;</li>\n<li style=\"\">Work with multimodal large language models (LLMs) is a significant plus;</li>\n<li style=\"\">Expertise in face swap technologies;</li>\n<li style=\"\">Bonus: Experience in NLP, particularly in training language models and preparing chatbots.</li>\n</ul>\n<p><strong>What do we offer:</strong><strong><br></strong></p>\n<ul style=\"\">\n<li style=\"\"><strong>REMOTE OPPORTUNITY</strong> to work full time;</li>\n<li style=\"\"><strong>Vacation</strong> 28 calendar days per year;</li>\n<li style=\"\"><strong>7 wellness days per year</strong> (time off) that can be used to deal with household issues, to lie down and recover without taking sick leave;</li>\n<li style=\"\"><strong>Bonuses up to $5000 </strong>for recommending successful applicants for positions in the company;</li>\n<li style=\"\">Full payment for <strong>professional training, international conferences and meetings;</strong></li>\n<li style=\"\">Corporate discount for <strong>English lessons;</strong></li>\n<li style=\"\">​<strong>Health benefits. </strong>According to the paychecks, if you are not eligible for corporate medical insurance, the company will compensate you with up to $ 1,000 gross per year per employee. This can be spent on self-purchase of health insurance or on doctor's fees for yourself and close relatives (spouse, children);</li>\n<li style=\"\">​<strong>Workplace organization. </strong>The company provides all employees with an equipped workplace and all the necessary equipment (table, armchair, wifi, etc.) in our offices or co-working locations. In the other locations, the company provides reimbursement of workplace costs up to $ 1000 gross once every 3 years, according to the paychecks. This money can be spent on the rent of the co-working room, on equipping the working place at home (desk, chair, Internet, etc.) during those 3 years;</li>\n<li style=\"\"><strong>Internal gamified gratitude system: </strong>receive bonuses from colleagues and exchange them for time off, merch, team building activities, massage certificates, etc. </li>\n</ul>\n<p><strong>Sounds good? Join us now!</strong> </p>\n<img src=\"https://remotive.com/job/track/1957995/blank.gif?source=public_api\" alt=\"\"/>","tags":"[\"video\",\"AI/ML\",\"NLP\",\"team lead\",\"insurance\"]","pubDate":"2024-12-18T17:51:10.000Z","link":"https://remotive.com/remote-jobs/software-dev/senior-team-lead-cv-engineer-1957995","slug":"senior-team-lead-cv-engineer-social-discovery-group-437"},{"id":7379550200,"title":"NODE.JS DEVELOPER (m/f/d)","company":"OMNIPEAK GmbH","image":"https://remotive.com/job/1958307/logo","description":"<p>Become a key player at OMNIPEAK, where innovation and team spirit go hand in hand. In our agile, young B2B SaaS company, it's passion and ideas that count - and yours especially. With cutting-edge, AI-powered products, we are revolutionizing the way marketing and sales teams work in the future to generate sustainable growth and more sales. Our innovative company, headquartered in the vibrant heart of Frankfurt am Main, pursues a remote-first philosophy that creates flexibility and freedom for creative solutions.<br><br></p>\n<p><strong>Our Culture</strong></p>\n<p>At OMNIPEAK, we foster a culture of ambition, courage, and teamwork. We are passionate about our cutting-edge AI products, our world-class team, and our beloved customers. We thrive on tackling challenges and appreciate a good sense of humor. Our corporate culture is rooted in transparency, clarity, and openness. We reject hierarchical structures and things like unnecessary meetings. We are always looking for talented individuals who share our commitment to making OMNIPEAK better every single day.<br><br></p>\n<div class=\"h2\">Tasks<br><br></div>\n<p><strong>Your Mission</strong></p>\n<p>We are looking for a highly motivated, self-driven Node.js Developer to join OMNIPEAKs Product Engineering team. As a Node.js Developer, you will take a central role in designing, developing, and maintaining high-performance, scalable web applications. With your expertise in Node.js, and ideally Node-RED, you will collaborate closely with our talented team to deliver innovative and impactful solutions tailored to our clients' needs. The ideal candidate is passionate about shaping the future of AI in the industry and brings high energy and a strong sense of ownership to help accelerate OMNIPEAK’s growth.</p>\n<p>This role is fully remote. As a fast-growing company and team, we value collaboration and connection, which we foster through virtual tools and regular online interactions. Please apply if you're comfortable working remotely and thrive in a remote-first environment.<br><br></p>\n<p><strong>Your Responsibility</strong></p>\n<p>Design and build innovative, scalable solutions that push the boundaries of technology. As a Node.js Developer at OMNIPEAK, you will take on unprecedented challenges, refining systems that unlock transformative possibilities for the future of AI.</p>\n<div class=\"h2\"><br>Requirements</div>\n<p><strong><br>Your Talent &amp; Profile</strong></p>\n<ul style=\"\">\n<li style=\"\">Proven experience in backend development with Node.js, delivering scalable and high-performance applications.</li>\n<li style=\"\">Preferably hands-on experience with Node-RED, including designing and managing workflows.</li>\n<li style=\"\">Solid knowledge of JavaScript and related frameworks (e.g., Express, NestJS).</li>\n<li style=\"\">Familiarity with SQL and NoSQL databases and a strong understanding of database optimization.</li>\n<li style=\"\">Experience working in agile development environments, with a focus on iterative, collaborative development.</li>\n<li style=\"\">Strong problem-solving skills and the ability to think analytically and strategically to overcome technical challenges.</li>\n<li style=\"\">Confident communication skills in both German and English (spoken and written).</li>\n</ul>\n<div class=\"h2\"><br>Benefits</div>\n<p><strong><br>What we offer</strong></p>\n<ul style=\"\">\n<li style=\"\">To become part of our Product Engineering team of a company that has tremendous potential.</li>\n<li style=\"\">The freedom to work 100% remotely.</li>\n<li style=\"\">A permanent, full-time position at the forefront of AI technology.</li>\n<li style=\"\">An engaging, professional work environment with highly motivated colleagues.</li>\n<li style=\"\">An attractive compensation.</li>\n</ul>\n<p><br>Feel free to contact us, even if this job posting could be a better fit for you. We review every application and respond promptly. Take the next step in your career and join OMNIPEAK - where innovation and collaboration drive success.</p>\n<img src=\"https://remotive.com/job/track/1958307/blank.gif?source=public_api\" alt=\"\"/>","tags":"[\"backend\",\"go\",\"javascript\",\"node.js\",\"saas\",\"sql\",\"AI/ML\",\"agile\",\"product engineering\",\"NoSQL\",\"web applications\",\"SOLID\"]","pubDate":"2024-12-18T11:35:38.000Z","link":"https://remotive.com/remote-jobs/software-dev/node-js-developer-m-f-d-1958307","slug":"node-js-developer-m-f-d-omnipeak-gmbh-9614"},{"id":4874998567,"title":"Senior Frontend Engineer","company":"Airalo","image":"https://lever-client-logos.s3.us-west-2.amazonaws.com/55028a36-609c-479c-9553-d4689ff2dd8c-1669620566663.png","description":"<div><b>About Airalo</b></div><div>Alo! Airalo is the world’s first eSIM store that helps people connect in over 200+ countries and regions across the globe. We are building the next digital service that revolutionizes the telecom industry. We are a travel-tech company and an equal-opportunity environment that values and executes diversity, inclusion, and equity. Our team is spread across 50+ countries and six continents. What glues us together is our commitment to changing the way you connect<span style=\"font-size: 13.3333px\">. </span></div><div><br></div><div><b>About you</b></div><div>We hope that you care deeply about the quality of your work, the intrinsic worth of tasks, and the success of your team. You are self-disciplined and do not require micromanagement in terms of your skillset and work ethic. You do your best to flourish as an individual every day while working hard to foster a collaborative team environment. You believe in the importance of being — and staying — authentic, honest, positive, and kind. You are a good interlocutor with clear and concise communication. You are able to manage multiple projects, have an analytical mind, pay keen attention to detail, and love to get your hands dirty. You are cognizant, tolerant, and welcoming of vulnerabilities and cultural differences.</div><div><br></div><div><b>About the Role</b></div><div><b>Position</b>: Full-time / Employee</div><div><b>Location:</b>&nbsp;Remote-first </div><div><b>Benefits:</b>&nbsp;Health Insurance, work-from-anywhere stipend, annual wellness &amp; learning credits, annual all-expenses-paid company retreat in a gorgeous destination &amp; other benefits</div><div><br></div><div>Are you an experienced and passionate Senior Frontend Engineer looking to make an impact in a dynamic, collaborative team? Join us to design, build, and enhance features in our User Experience team. Whether you're skilled with Vue.js or bring equivalent React experience and a strong desire to learn, we’d love to hear from you. Our team values innovation, technical excellence, and knowledge sharing, and we’re looking for someone who does too!</div><h3>Your main responsibilities will be to:</h3><li>Designing and developing enterprise-quality software components based on product specifications</li><li>Developing new features or enhancements to existing features</li><li>Collaborating daily with other developers across the full software development lifecycle</li><li>Working on a single-page application and improving its SEO and performance</li><li>Evaluating user interaction issues and delivering the optimized product</li><li>Implementing unit tests</li><li>Identifying and mitigating project risks</li><li>Estimating the execution of frontend development tasks</li><li>Communicating project status and updates to stakeholders</li><li>Troubleshooting issues and problem-solving as necessary</li><li>Translating user and business needs into frontend code</li><li>Troubleshooting issues and problem-solving as necessary</li>,<h3>Does this sound like you?</h3><li>A Bachelor’s degree in Computer Engineering or a related discipline, or equivalent professional experience.</li><li>Proficiency in building single-page applications with modern frameworks.</li><li>At least 4 years of hands-on experience in JavaScript, CSS, and frontend development.</li><li>A minimum of 2 years working with Vue.js (or equivalent experience in React with a motivation to learn Vue.js).</li><li>Proven experience in delivering at least two enterprise-level projects.</li><li>Familiarity with modern frontend build pipelines and tools.</li><li>Strong skills in responsive design and cross-browser compatibility.</li><li>Experience working with RESTful web services.</li><li>Proficiency with JavaScript test frameworks and version control systems like Git.</li><li>Knowledge of distributed caching and cloud computing architectures.</li><li>Solid understanding of OOP concepts, SOLID principles, and design patterns.</li><li>Experience working in an Agile environment.</li><li>Excellent communication skills and fluency in English.</li><div><span style=\"font-size: 15px;\">f you are interested in this position,&nbsp;</span><b style=\"font-size: 15px;\">please apply via the link.</b></div><div><br></div><div><i style=\"font-size: 15px;\">Please note that our Engineering team works in the CET timezone, so candidates will need to reside in countries with the same time zone or similar to it and will need to already have permit to work in the country where they are based.</i></div><div><br></div><div>We sincerely thank all applicants in advance for submitting their interest in this opportunity. Airalo is an equal opportunity employer and values diversity, equity &amp; inclusion. We do not discriminate on the basis of race, religion, national origin, gender, sexual orientation, age, marital status, veteran status, or disability status. We are committed to providing reasonable accommodations upon request for individuals with disabilities throughout our job interview process.</div>","tags":"[\"javascript\",\"management\",\"engineering\"]","pubDate":"2024-12-18T09:05:08.245Z","link":"https://jobs.lever.co/airalo/fcf80bc8-1107-4fda-a375-e110719a7688","slug":"senior-frontend-engineer-airalo-6684"},{"id":6478993416,"title":"Senior Backend Engineer","company":"Airalo","image":"https://lever-client-logos.s3.us-west-2.amazonaws.com/55028a36-609c-479c-9553-d4689ff2dd8c-1669620566663.png","description":"<div><b>About Airalo</b></div><div>Alo! Airalo is the world’s first eSIM store that helps people connect in over 200+ countries and regions across the globe. We are building the next digital service that revolutionizes the telecom industry. We are a travel-tech company and an equal-opportunity environment that values and executes diversity, inclusion, and equity. Our team is spread across 50+ countries and six continents. What glues us together is our commitment to changing the way you connect<span style=\"font-size: 13.3333px\">. </span></div><div><br></div><div><b>About you</b></div><div>We hope that you care deeply about the quality of your work, the intrinsic worth of tasks, and the success of your team. You are self-disciplined and do not require micromanagement in terms of your skillset and work ethic. You do your best to flourish as an individual every day while working hard to foster a collaborative team environment. You believe in the importance of being — and staying — authentic, honest, positive, and kind. You are a good interlocutor with clear and concise communication. You are able to manage multiple projects, have an analytical mind, pay keen attention to detail, and love to get your hands dirty. You are cognizant, tolerant, and welcoming of vulnerabilities and cultural differences.</div><div><br></div><div><b>About the Role</b></div><div><b>Position</b>: Full-time / Employee</div><div><b>Location:</b>&nbsp;Remote-first </div><div><b>Benefits:</b>&nbsp;Health Insurance, work-from-anywhere stipend, annual wellness &amp; learning credits, annual all-expenses-paid company retreat in a gorgeous destination &amp; other benefits</div><div><br></div><div>Are you a backend engineer with a knack for building complex, scalable systems? Join our team as a Senior Backend Engineer, where you’ll craft innovative features, optimize large-scale distributed systems, and shape the future of our core product. We value expertise, creativity, and a passion for excellence. While our focus is Laravel, we’re open to seasoned Symfony developers eager to transition and make an impact.</div><h3>Responsibilities include but are not limited to:</h3><li>Design and maintain large-scale, high-performance systems.</li><li>Develop and refine services to improve scalability and efficiency.</li><li>Create RESTful APIs that power our front-end and third-party integrations.</li><li>Collaborate on our migration to a service-oriented architecture (SOA).</li><li>Write clean, maintainable, and testable code using industry best practices.</li><li>Troubleshoot, debug, and resolve technical challenges.</li><li>Actively contribute to all phases of the software development lifecycle.</li>,<h3>Does this sound like you?</h3><li>5+ years of backend development experience in PHP.</li><li>2+ years working with Laravel to build enterprise-level applications or equivalent experience with Symfony and a strong motivation to learn Laravel.</li><li>Expertise in distributed systems, scalable services, and RESTful APIs.</li><li>Familiarity with event-driven architecture and messaging systems (e.g., queues, pub/sub).</li><li>Strong SQL/NoSQL knowledge and caching strategies.</li><li>Proficiency in OOP, SOLID principles, and design patterns.</li><li>Experience with AWS services (e.g., EC2, Lambda, SQS, Aurora, DynamoDB).</li><li>Hands-on containerization skills with Docker.</li><li>Fluent English communication skills.</li>,<h3>Bonus points:</h3><li>Knowledge of PaaS/SaaS, SOA, and microservices architecture.</li><li>Prior experience in telecommunications or network infrastructure.</li><li>Familiarity with eSIM and GSMA technologies.</li><li>Experience in Traveltech</li><div>If you are interested in this position, <b>please apply via the link.</b></div><div><br></div><div><i style=\"font-size: 15px;\">Please note that our Engineering team works in the CET timezone, so candidates will need to reside in countries with the same time zone or similar to it and will need to already have permit to work in the country where they are based.</i></div><div><br></div><div>We sincerely thank all applicants in advance for submitting their interest in this opportunity. Airalo is an equal opportunity employer and values diversity, equity &amp; inclusion. We do not discriminate on the basis of race, religion, national origin, gender, sexual orientation, age, marital status, veteran status, or disability status. We are committed to providing reasonable accommodations upon request for individuals with disabilities throughout our job interview process.</div>","tags":"[\"management\",\"engineering\",\"aws\"]","pubDate":"2024-12-17T12:26:06.371Z","link":"https://jobs.lever.co/airalo/ee1044db-9052-4b68-890a-573a267e245c","slug":"senior-backend-engineer-airalo-5144"},{"id":1520763048,"title":"Senior Quality Assurance Engineer","company":"Airalo","image":"https://lever-client-logos.s3.us-west-2.amazonaws.com/55028a36-609c-479c-9553-d4689ff2dd8c-1669620566663.png","description":"<div><b>About Airalo</b></div><div>Alo! Airalo is the world’s first eSIM store that helps people connect in over 200+ countries and regions across the globe. We are building the next digital service that revolutionizes the telecom industry. We are a travel-tech company and an equal-opportunity environment that values and executes diversity, inclusion, and equity. Our team is spread across 50+ countries and six continents. What glues us together is our commitment to changing the way you connect<span style=\"font-size: 13.3333px\">. </span></div><div><br></div><div><b>About you</b></div><div>We hope that you care deeply about the quality of your work, the intrinsic worth of tasks, and the success of your team. You are self-disciplined and do not require micromanagement in terms of your skillset and work ethic. You do your best to flourish as an individual every day while working hard to foster a collaborative team environment. You believe in the importance of being — and staying — authentic, honest, positive, and kind. You are a good interlocutor with clear and concise communication. You are able to manage multiple projects, have an analytical mind, pay keen attention to detail, and love to get your hands dirty. You are cognizant, tolerant, and welcoming of vulnerabilities and cultural differences.</div><div><br></div><div><b>About the Role</b></div><div><b>Position</b>: Full-time / Employee</div><div><b>Location:</b>&nbsp;Remote-first </div><div><b>Benefits:</b>&nbsp;Health Insurance, work-from-anywhere stipend, annual wellness &amp; learning credits, annual all-expenses-paid company retreat in a gorgeous destination &amp; other benefits</div><div><br></div><div>We are looking for an experienced and responsible senior QA automation engineer who will create and improve automation strategy and framework, making it part of our CI/CD pipeline . You will be part of our QA team that maximizes product quality and minimize regression risks by creating automated tests for our API, Web and Mobile applications.</div><h3>Responsibilities include but are not limited to:</h3><li>Designing, implementing, and executing automated and performance tests for native mobile and web applications</li><li>Running User Acceptance and Regression tests by reviewing the user stories, acceptance criteria &amp; design documents, and creating user acceptance cases (UAC)</li><li>Caring for the quality of user interfaces as pixel-perfect and experience, as much as software quality</li><li>Ensuring version releases with 0 critical bug all the time</li><li>Collaborating and working closely with Product Managers, Developers, Designers to share bug reports, ensure business requirements are met, and increase code and automated test coverages</li><li>Tracking and measuring quality metrics to take any necessary corrective actions proactively for one thing: the best quality can be achieved</li><li>Evaluating, building, and improving the roadmap and infrastructure of the overall QA strategy and testing cycle for the end-products, making recommendations as necessary</li><li>Helping to build and grow a strong and dedicated QA Team</li>,<h3>Must-haves:</h3><li>5+ years of dedicated experience in Quality Assurance (QA)</li><li>3+ years of dedicated experience with web and mobile automating application</li><li>Understanding of software testing theory and methodologies</li><li>Experience in manual testing across the spectrum of acceptance criteria of the user stories and test cases</li><li>Ability to run User Acceptance and Regression tests from the perspective of the end-users</li><li>Good understanding of HTTP protocol, WebSocket</li><li>Experience in automated functional, API, and UI testing</li><li>Understanding of distributed apps and client-server architecture</li><li>Good knowledge of at least one programming language e.g., Java, Python, JavaScript, etc.</li><li>Experience with test automation frameworks for UI/API e.g., XCUITest, Selenium, Cucumber, Cypress, Playwright, Maestro mobile, Axios, RestAssured, etc.</li><li>Experience in performance testing and tools e.g., Apache Jmeter, Gatlin, etc.</li><li>Experience with software development tools e.g., Xcode, Android Studio, etc.</li><li>Experience with continuous integration (CI/CD) pipelines and tools e.g., Github Actions, Bitrise, etc.</li><li>Experience with setting up&nbsp;testing environments and Docker containers for automated tests</li><li>Ability to troubleshoot and debug test infrastructure (test environments, docker containers, CI/CD pipeline workflows related to test automation)</li><li>Strong critical and analytical thinking, ability to determine gaps and inconsistencies in product requirements and collaborate with product managers and developers to improve them</li><li>Good verbal and written communication skills in English</li>,<h3>Good-to-have:</h3><li>Knowledge of Agile product development practices and tools e.g. JIRA etc.</li><li>Graduate degree in a related field</li><li>Prior work experience in telecommunications</li><li>Knowledge of eSIM and GSMA related technologies and services</li><div>If you are interested in this position, <b>please apply via the link.</b></div><div><br></div><div>We sincerely thank all applicants in advance for submitting their interest in this opportunity. Airalo is an equal opportunity employer and values diversity, equity &amp; inclusion. We do not discriminate on the basis of race, religion, national origin, gender, sexual orientation, age, marital status, veteran status, or disability status. We are committed to providing reasonable accommodations upon request for individuals with disabilities throughout our job interview process.</div>","tags":"[\"javascript\",\"management\"]","pubDate":"2024-12-17T11:51:17.320Z","link":"https://jobs.lever.co/airalo/cd2b9b0f-b0d1-4fd3-93e5-e52422d9f852","slug":"senior-quality-assurance-engineer-airalo-7501"},{"id":5147529226,"title":"Senior Data Analyst","company":"Airalo","image":"https://lever-client-logos.s3.us-west-2.amazonaws.com/55028a36-609c-479c-9553-d4689ff2dd8c-1669620566663.png","description":"<div><b>About Airalo</b></div><div>Alo! Airalo is the world’s first eSIM store that helps people connect in over 200+ countries and regions across the globe. We are building the next digital service that revolutionizes the telecom industry. We are a travel-tech company and an equal-opportunity environment that values and executes diversity, inclusion, and equity. Our team is spread across 50+ countries and six continents. What glues us together is our commitment to changing the way you connect<span style=\"font-size: 13.3333px\">. </span></div><div><br></div><div><b>About you</b></div><div>We hope that you care deeply about the quality of your work, the intrinsic worth of tasks, and the success of your team. You are self-disciplined and do not require micromanagement in terms of your skillset and work ethic. You do your best to flourish as an individual every day while working hard to foster a collaborative team environment. You believe in the importance of being — and staying — authentic, honest, positive, and kind. You are a good interlocutor with clear and concise communication. You are able to manage multiple projects, have an analytical mind, pay keen attention to detail, and love to get your hands dirty. You are cognizant, tolerant, and welcoming of vulnerabilities and cultural differences.</div><div><br></div><div><b>About the Role</b></div><div><b>Position</b>: Full-time / Employee</div><div><b>Location:</b>&nbsp;Remote-first </div><div><b>Benefits:</b>&nbsp;Health Insurance, work-from-anywhere stipend, annual wellness &amp; learning credits, annual all-expenses-paid company retreat in a gorgeous destination &amp; other benefits</div><div><br></div><div><span style=\"font-size: 11pt;\">As a Senior Data Analyst, you have strong analytical and technical skills and are comfortable collaborating with various departments including Product, Engineering, Design, Growth, Finance, and Partnerships. You will provide actionable insights to drive decision-making and help shape the Airalo strategy and roadmaps across departments. You will play a key role in further growing our Data Analytics function and help us define best practices to improve our ways of working. You’ll be the go-to person in the team to run ad-hoc analyses, find root causes of problems, and evaluate business impact.</span></div><h3>Responsibilities include, but are not limited to: </h3><li>Collaborate with multiple departments to understand their data analysis needs and provide strategic insights to support decision-making, define strategy and prioritize roadmaps</li><li>Serve as the primary point of contact for ad-hoc analyses, root cause analysis, and evaluation of business impact across the company</li><li>Partner with Product, Engineering, and Design to define tracking, AB testing strategy, and measure post-launch feature and product impact</li><li>Develop data dashboards, charts, and visual aids to support decision-making across departments</li><li>Convey insights through both reports and visual presentations.</li><li>Create documentation associated with the dashboards highlighting definitions, event schema, data models, analyses</li><li>Gather and cleanse data from primary and secondary sources</li>,<h3>Must-haves: </h3><li>4+ years of experience in a hands-on analytics role</li><li>Strong ability to synthesize data into actionable insights</li><li>Strong SQL proficiency and understanding of data modeling concepts</li><li>Experience with using data visualization tools and analytics tools</li><li>A clear understanding of A/B testing methodologies</li><li>Demonstrate curiosity and data fluency</li><li>Bachelor’s degree (or equivalent) in mathematics, computer science, economics, or statistics</li>,<h3>Good to haves:</h3><li>Experience using QuickSight, CleverTap, Hotjar, Google Analytics</li><li>Experience with consumer and SaaS products</li><li>Prior work experience in telecommunications</li><li>Knowledge of eSIM and GSMA-related technologies and services</li><div>If you are interested in this position, <b>please apply via the link.</b></div><div><br></div><div>We sincerely thank all applicants in advance for submitting their interest in this opportunity. Airalo is an equal opportunity employer and values diversity, equity &amp; inclusion. We do not discriminate on the basis of race, religion, national origin, gender, sexual orientation, age, marital status, veteran status, or disability status. We are committed to providing reasonable accommodations upon request for individuals with disabilities throughout our job interview process.</div>","tags":"[\"Finance\",\"management\",\"engineering\"]","pubDate":"2024-12-17T10:06:34.725Z","link":"https://jobs.lever.co/airalo/72f49645-5833-44d6-98b6-79780335f476","slug":"senior-data-analyst-airalo-4166"},{"id":8327450402,"title":"Senior Analytics Engineer","company":"Airalo","image":"https://lever-client-logos.s3.us-west-2.amazonaws.com/55028a36-609c-479c-9553-d4689ff2dd8c-1669620566663.png","description":"<div><b>About Airalo</b></div><div>Alo! Airalo is the world’s first eSIM store that helps people connect in over 200+ countries and regions across the globe. We are building the next digital service that revolutionizes the telecom industry. We are a travel-tech company and an equal-opportunity environment that values and executes diversity, inclusion, and equity. Our team is spread across 50+ countries and six continents. What glues us together is our commitment to changing the way you connect<span style=\"font-size: 13.3333px\">. </span></div><div><br></div><div><b>About you</b></div><div>We hope that you care deeply about the quality of your work, the intrinsic worth of tasks, and the success of your team. You are self-disciplined and do not require micromanagement in terms of your skillset and work ethic. You do your best to flourish as an individual every day while working hard to foster a collaborative team environment. You believe in the importance of being — and staying — authentic, honest, positive, and kind. You are a good interlocutor with clear and concise communication. You are able to manage multiple projects, have an analytical mind, pay keen attention to detail, and love to get your hands dirty. You are cognizant, tolerant, and welcoming of vulnerabilities and cultural differences.</div><div><br></div><div><b>About the Role</b></div><div><b>Position</b>: Full-time / Employee</div><div><b>Location:</b>&nbsp;Remote-first </div><div><b>Benefits:</b>&nbsp;Health Insurance, work-from-anywhere stipend, annual wellness &amp; learning credits, annual all-expenses-paid company retreat in a gorgeous destination &amp; other benefits</div><div><br></div><div><span style=\"font-size: 11pt;\">Join Airalo as a </span><b style=\"font-size: 11pt;\">Senior Analytics Engineer</b><span style=\"font-size: 11pt;\"> and be at the forefront of our data initiatives. In this pivotal role, you will collaborate with various departments to understand and address their data needs, design and implement data models, and provide actionable insights that drive decision-making. Your expertise will ensure the highest quality of analytics code. Your contributions will be crucial in helping us leverage data to its fullest potential, ultimately supporting our strategic goals and enhancing overall business performance.</span></div><h3>Responsibilities include, but are not limited to:</h3><li>Work with multiple departments to understand and address their data needs</li><li>Design and implement efficient ELT pipelines to streamline data processing</li><li>Build and maintain dashboards that support strategic decision-making</li><li>Maintain accurate data documentation and definitions</li><li>Advocate for best practices, tools, and methods to ensure high-quality analytics code</li><li>Train business users on effective use of data visualization tools</li><li>Stay up to date with the latest industry trends and technologies, recommending new techniques and tools to keep us ahead of the curve</li>,<h3>Must-haves:</h3><li>4+ years of related work experience with a track record of driving business insights</li><li>Exceptional skills in data modeling</li><li>Familiarity with EL solutions such as Fivetran or Stitch</li><li>Expert knowledge of SQL and dbt</li><li>Working knowledge of Python, Git and the command line</li><li>Proficiency with Looker or a similar tool</li><li>Clear and direct communication skills about complex, technical topics</li><li>Natural passion for structure and efficiency, and excellent attention to detail</li>,<h3>Good to Have:</h3><li>Experience working with GCP stack, especially BigQuery</li><li>Experience working with telco, MNOs &amp; MNVOs</li><div>If you are interested in this position, <b>please apply via the link.</b></div><div><br></div><div><i style=\"font-size: 15px;\">Please note that our Data team works in the CET timezone, so candidates will need to reside in countries with the same time zone or similar to it and will need to already have permit to work in the country where they are based.</i></div><div><br></div><div>We sincerely thank all applicants in advance for submitting their interest in this opportunity. Airalo is an equal opportunity employer and values diversity, equity &amp; inclusion. We do not discriminate on the basis of race, religion, national origin, gender, sexual orientation, age, marital status, veteran status, or disability status. We are committed to providing reasonable accommodations upon request for individuals with disabilities throughout our job interview process.</div>","tags":"[\"management\"]","pubDate":"2024-12-17T10:00:35.587Z","link":"https://jobs.lever.co/airalo/6dae9ad7-a90d-45e5-9446-feceaaecc310","slug":"senior-analytics-engineer-airalo-2950"}]