[{"id":4100540656,"title":"QA Specialist (Remote/Anywhere)","company":"Collabora","image":"https://media.licdn.com/dms/image/D4E0BAQFdRsd49YG4fQ/company-logo_200_200/0/1688735422027/collabora_logo?e=2147483647&v=beta&t=COQKgdesE_abHpZN-7BjhNZ1IKm2nhQyHB637TbP88E","description":"<div class=\"section page-centered\" data-qa=\"job-description\"><div> We are looking for a detail-oriented and proactive Quality Assurance Specialist to ensure the quality and reliability of our products/services.</div><div><br></div><div>The ideal candidate will have a strong understanding of QA methodologies, excellent communication skills, and a passion for delivering top-notch solutions.</div><div><br></div><div>As a QA Specialist, you will collaborate with cross-functional teams to identify and address issues, conduct thorough testing, and contribute to the continuous improvement of our processes.</div></div><div class=\"section page-centered\"><div><h3>Responsibilities:</h3><ul class=\"posting-requirements plain-list\"><ul><li>Find a cause of the issue and test to check the fix works in a complex environment involving multi-tier web applications</li><li>Perform functional, regression and performance testing to identify and report defects or inconsistencies in product functionality</li><li>Collaborate with product development and project management teams to understand project requirements and provide input on testability and quality aspects</li><li>Document and track test results, issues and resolution efforts to ensure clear communication and visibility of QA activities</li><li>Conduct root cause analysis for identified defects and work with the development team to facilitate timely resolutions</li><li>Contribute to the establishment and enhancement of quality assurance standards and best practices within the organization</li><li>Active participation on regular internal QA calls</li><li>Hands-on troubleshooting sessions with customers via video conferencing and/or remote desktop tools</li><li>\"Can do” attitude in different situations</li></ul></ul></div></div><div class=\"section page-centered\"><div><h3>Primary Qualifications:</h3><ul class=\"posting-requirements plain-list\"><ul><li>Proven experience in software quality assurance, with a focus on manual testing</li><li>Strong understanding of QA methodologies, tools and processes</li><li>Knowledge and experience of Linux</li><li>Knowledge and experience of Docker and Kubernetes</li><li>Basic knowledge of version control systems, specifically Git</li><li>Excellent analytical and problem-solving skills</li><li>Strong communication and collaboration skills with the ability to work effectively in a team environment</li><li>Detail-oriented with a commitment to delivering high-quality results</li></ul></ul></div></div><div class=\"section page-centered\"><div><h3>Additional Skills:</h3><ul class=\"posting-requirements plain-list\"><ul><li>Bachelor's degree in Computer Science, Engineering, or a related field</li><li>Experience with test automation tools and frameworks is a plus (e.g., Cypress, Cppunit)</li><li>Experience working in an open source environment is a plus</li></ul></ul></div></div><div class=\"section page-centered\" data-qa=\"closing-description\"><div> If you are passionate about ensuring the highest level of quality in products/services and are ready to contribute to a dynamic and innovative team, we encourage you to apply.</div><div><br></div><div>Join us in our commitment to excellence and be a key player in our continued success.</div><div><br></div><div><br></div><div><br></div><div><br></div><div><br></div><div>#LI-Remote</div></div><div class=\"section page-centered last-section-apply\" data-qa=\"btn-apply-bottom\"><a class=\"postings-btn template-btn-submit hex-color\" data-qa=\"show-page-apply\" href=\"https://jobs.lever.co/collabora/89c22358-910f-44d6-a759-1937d4517d85/apply\">Apply for this job</a></div>","tags":"[\"management\",\"engineering\"]","pubDate":"2024-10-14 10:18:31.243","link":"https://jobs.lever.co/collabora/89c22358-910f-44d6-a759-1937d4517d85","savedDate":"2024-10-14 10:18:31.243","slug":"qa-specialist-remote-anywhere-collabora-6434"},{"id":3166230374,"title":"Web Developer","company":"Status","image":"https://avatars.githubusercontent.com/u/11767950?s=200&v=4","description":"\n    <div class=\"content-intro\"><p style=\"text-align: justify;\"><strong>About Status</strong></p>\n<p style=\"text-align: justify;\"><span style=\"font-weight: 400;\">Status is building the tools and infrastructure for the advancement of a secure, private, and open web3.&nbsp;</span></p>\n<p style=\"text-align: justify;\"><span style=\"font-weight: 400;\">With the high level goals of preserving the right to privacy, mitigating the risk of censorship, and promoting economic trade in a transparent, open manner, Status is building a community where anyone is welcome to join and contribute.</span></p>\n<p style=\"text-align: justify;\"><span style=\"font-weight: 400;\">As an organization, Status seeks to push the web3 ecosystem forward through research, creation of developer tools, and support of the open source community.&nbsp;</span></p>\n<p style=\"text-align: justify;\"><span style=\"font-weight: 400;\">As a product, Status is an open source, Ethereum-based app that gives users the power to chat, transact, and access a revolutionary world of Apps on the decentralized web. But Status is also building foundational infrastructure for the whole Ethereum ecosystem, including the Nimbus ETH 1.0 and 2.0 clients, the Keycard hardware wallet, and the Waku messaging protocol, the p2p communication layer for Web3.</span></p>\n<p style=\"text-align: justify;\"><span style=\"font-weight: 400;\">As a team, Status has been completely distributed since inception. Our team is currently 200+ core contributors strong, and welcomes a growing number of community members from all walks of life, scattered all around the globe.&nbsp;</span></p>\n<p style=\"text-align: justify;\"><span style=\"font-weight: 400;\">We care deeply about open source, and our organizational structure has minimal hierarchy and no fixed work hours. We believe in working with a high degree of autonomy while supporting the organization's priorities.</span></p></div>\n\n    <p><strong>Who are we?</strong></p>\n<p>IFT is a pioneering force in the Web3 ecosystem, committed to the development, adoption, and accessibility of solutions to digital age problems; guided by our principles: liberty, censorship resistance, security, privacy, and inclusivity. Our mission is to build public goods to safeguard civil liberties in the digital age.</p>\n<p>&nbsp;</p>\n<p><strong>The role</strong></p>\n<p>As a Web Developer at IFT, you will be responsible for As a Web Developer, you will be responsible for the development and technical maintenance of various web-based projects in the studio. Your role will involve decision-making for code architecture, writing tests, choosing the right technology stack, and any other related tasks. You will work closely with the development team, project management, studio lead, and design team to bring our web projects to life.</p>\n<p>&nbsp;</p>\n<p><strong>Key responsibilities:</strong>&nbsp;</p>\n<ul>\n<li>You will take care of all technical aspects of all web projects (from development and testing to deployment and maintenance)</li>\n<li>You will be developing and implementing websites, internal tools and our design systems implementation in React.</li>\n<li>You will co-write documentation for all the above mentioned products/projects</li>\n<li>You will be responsible for maintaining our open-sourced codebases on Github.</li>\n</ul>\n<p>&nbsp;</p>\n<p><strong>You will ideally have:&nbsp;</strong></p>\n<ul>\n<li>Proficiency in Design Tools: Extensive experience with design tools that cater to UX, UI, and micro-interactions, such as Figma and Framer.</li>\n<li>Frontend and Backend Expertise: Experience in implementation of frontend libraries and design systems (ReactJS, NextJS), and backend (NodeJs, NestJS), all in Typescript</li>\n<li>Software Architecture Knowledge: Solid understanding of software architecture principles, ensuring scalable and maintainable code.</li>\n<li>DevOps and Deployment Experience: Hands-on experience with Git, Docker, coupled with expertise in deployment platforms like Vercel.</li>\n<li>MDX-Based Content Management: Knowledgeable in managing content using MDX with Docusaurus.</li>\n<li>Experience with JAMstack: Familiarity with JAMstack architecture, including static site generators, headless CMS, and modern web technologies.</li>\n<li>Alignment with our principles: Strong alignment with our core principles: <a href=\"https://status.app/manifesto\">https://status.app/manifesto</a></li>\n</ul>\n<p>&nbsp;</p>\n<p><strong>Bonus points:&nbsp;</strong></p>\n<ul>\n<li>You are comfortable working remotely and asynchronously</li>\n<li>You have experience working for an open-source organisation</li>\n<li>You have exposure to creative coding (processing, openframeworks, WebGL, writing shaders, p5js)</li>\n</ul>\n<p><em>[Don’t worry if you don’t meet all of these criteria, we’d still love to hear from you anyway if you think you’d be a great fit for this role. Just explain to us why in your cover letter].</em></p>\n<p>&nbsp;</p>\n<p><strong>Hiring process:</strong></p>\n<ol>\n<li>Interview with our People Ops team</li>\n<li>Interview with Jerry</li>\n<li>Interview with Jinho</li>\n<li>Assessment<a href=\"https://docs.google.com/document/d/1-KCt5RPaSZ-E1h8CRJUHw8jDfAZThVombgNLdARdpds/edit\"> </a></li>\n<li>Interview with Nick</li>\n</ol>\n<p><em>The steps may change along the way if we see it makes sense to adapt the interview stages, so please consider the above as a guideline.&nbsp;</em></p>\n<p><strong><br></strong><strong>Compensation</strong></p>\n<p>We are happy to pay in any mix of fiat/crypto.</p>\n\n    \n\n    \n","tags":"[\"typescript\",\"management\"]","pubDate":"2024-10-14 10:18:31.242","link":"https://boards.greenhouse.io/embed/job_app?for=status72&token=6242476&b=https%3A%2F%2Fjobs.status.im%2F","savedDate":"2024-10-14 10:18:31.242","slug":"web-developer-status-6753"},{"id":7437388280,"title":"Revenue Strategy and Operations Manager [IC4]","company":"Sourcegraph","image":"https://pbs.twimg.com/profile_images/1428393724527190022/4mt5PACL_400x400.png","description":"\n    <div class=\"content-intro\"><h2><strong><span style=\"color: #a112ff;\">Who we are</span></strong></h2>\n<p>Our mission at Sourcegraph is to make it so that <a href=\"https://www.notion.so/sourcegraph/Mission-values-e9d37e6b972a4ef395c3076aea2bd07d?pvs=4\">everyone can code</a>, not just ~0.1% of the population. We're building the code intelligence platform that powers the world's best code search and the most popular open-source code AI tool. It’s an exciting time to join Sourcegraph—AI has taken over the world, and we aim to automate 99% of the toil in software engineering with our code understanding and code AI tools, leaving the remaining 1% to the irreplicable creative spark from humans.&nbsp;</p>\n<p>Our customers range from startups to the Fortune 500, 4/5 FAANG companies, government organizations, Uber, Plaid, and more. We’ve raised $225M at a $2.625B valuation from <a href=\"https://techcrunch.com/2021/07/13/sourcegraph-raises-125m-series-d-on-2-6b-valuation-for-universal-code-search-tool/\">a16z</a>,<a href=\"https://about.sourcegraph.com/blog/series-c-with-sequoia/\"> Sequoia</a>, <a href=\"https://www.redpoint.com/companies/sourcegraph/\">Redpoint</a>, <a href=\"https://medium.com/craft-ventures/why-we-invested-in-sourcegraph-5ace28317e3d\">Craft</a> and others. We’re making ambitious bets on our future and we’re looking to hire exceptional people to join our team as we make Sourcegraph one of the biggest and most influential companies in the world.</p></div>\n\n    <h2><span style=\"color: rgb(161, 18, 255);\"><strong>Working hours</strong></span></h2>\n<p>🌎 While we are an all-remote company and hire almost anywhere in the world, we do require successful candidates to be located in the United States, specifically on the West Coast.</p>\n<ul>\n<li>Preferred location: USA - West Coast</li>\n</ul>\n<h2><span style=\"color: rgb(161, 18, 255);\"><strong>Why this job is exciting</strong></span></h2>\n<p>As the Revenue Strategy and Operations Manager at Sourcegraph, you are stepping into a pivotal role that will shape our most strategic initiatives across the entire revenue organization. This isn’t just a job, it is a career-defining opportunity to lead the charge, craft innovative strategies to refine and optimize our TAM and launch new products in the dynamic AI space.</p>\n<p>This is a ‘multi-altitudinal’ role where you’ll be both setting direction and executing on the details: building models, writing ROE docs, crafting comp plans, analyzing data, and unearthing insights to find ‘GTM Fit’ as we scale to $100M and beyond.</p>\n<ul>\n<li>Partner with the VPs of Sales and Technical Success to develop and execute innovative strategies that improve internal stakeholder experiences and increase revenue generation.</li>\n<li>Collaborate closely with GTM leadership to craft, drive, align, and communicate key initiatives within our overall go-to-market strategy, across sales, post-sales, and marketing.</li>\n<li>Develop and implement a cohesive GTM strategy that includes launching new products and expanding into new markets, all while optimizing our core revenue processes, operational policies, and procedures to boost revenue productivity.</li>\n<li>Lead the Annual Planning process for GTM, including territory planning, quota planning, workforce management planning, capacity analysis, and TAM/productivity analyses.</li>\n<li>Co-lead all pipeline generation efforts with Marketing to build a robust and healthy sales pipeline, ensuring a steady flow of high-quality leads to support our growth targets.</li>\n<li>Find and unearth key revenue insights to help us attract, land, retain, and expand customers.</li>\n<li>Standardize and automate reporting through dashboards and other self-service methods to better understand performance and enhance the efficiency of the revenue machine.</li>\n<li>Provide thought leadership in the area of sales compensation and program management, from plan design to evaluation.</li>\n<li>Create and enhance Sourcegraph’s Sales and Technical Success Rules of Engagement, outlining segmentation strategy, territory structure, and account team collaboration guidelines.</li>\n<li>Partner with revenue leadership and finance to generate an accurate revenue forecast (including new lands, expansions, and renewals) on a weekly/quarterly/annual basis.</li>\n<li>Manage and maintain the Sourcegraph <a href=\"https://www.notion.so/sourcegraph/Sales-d407cdf6343b4f44bc4ccba10a98ab31?pvs=4\">Sales</a> and <a href=\"https://www.notion.so/sourcegraph/Technical-Success-40ce7648316740c49a236c260c626e0e?pvs=4\">Technical Success</a> Handbook Pages.</li>\n</ul>\n<h2><span style=\"color: rgb(161, 18, 255);\"><strong>About you&nbsp;</strong></span></h2>\n<p>You are a dynamic leader with a knack for strategic thinking and a drive to execute. With a background in revenue strategy and operations, you thrive in fast-paced environments and excel at turning complex challenges into scalable solutions. You possess a robust analytical mindset, enabling you to generate actionable insights that propel growth and efficiency.</p>\n<p>Your proactive approach makes you a key player in enhancing the effectiveness of our sales and technical success teams by reducing friction, identifying opportunities, and preemptively navigating potential pitfalls. Through meticulous data analysis and insights, you continuously refine processes and improve operational outcomes. Known for your ability to drive initiatives that significantly enhance customer engagement and business performance, you are detail-oriented yet visionary. You excel in both planning and execution phases, ensuring that strategic goals are aligned to tactics and execution.</p>\n<p>You are a highly visible member of the revenue leadership team with great communication skills, who can articulate ideas clearly and persuade stakeholders effectively, aligning teams toward common goals.</p>\n<p>Your skill-set:</p>\n<ul>\n<li>7+ years of professional experience with a core focus in sales and post-sales strategy and planning; high growth B2B technology sales</li>\n<li>Proven analytical and quantitative skills with a data-driven approach to problem-solving</li>\n<li>Understanding of core business processes in a B2B technology environment; sales, marketing, finance, product development, customer support and success, professional services</li>\n<li>Experience identifying, evaluating and analyzing business opportunities while working across multiple business units to drive decisions</li>\n<li>Experience with business modeling; operational, financial and statistical analysis</li>\n<li>Proven ability to thrive in a fluid, fast-paced, unpredictable environment.</li>\n<li>Experience growing within a small start-up. Strong ability to interact and influence effectively with all C-level executives and team members</li>\n</ul>\n<p><em>Nice to haves:</em></p>\n<ul>\n<li>Familiarity with our tech stack: Salesforce (CRM), LeadIQ / ZoomInfo (data and enrichment), Outreach (Outbound automation), Chorus (call insights), HubSpot (Marketing Automation), and Looker (BI)</li>\n</ul>\n<h2><span style=\"color: rgb(161, 18, 255);\"><strong>Level</strong></span></h2>\n<p>📊 This job is an IC4.&nbsp; You can read more about <a href=\"https://www.notion.so/sourcegraph/Leveling-Guide-0e1b5c76ada64b9caac387f8b7c4fc66\">our job leveling philosophy</a> in our Handbook.</p>\n<h2><span style=\"color: rgb(161, 18, 255);\"><strong>Compensation</strong></span></h2>\n<p><strong>💸 We pay you an above-average salary</strong> because we want to hire the best people who are fully focused on helping Sourcegraph succeed, not worried about paying bills. As an <a href=\"https://sourcegraph.notion.site/Mission-values-e9d37e6b972a4ef395c3076aea2bd07d\">open and transparent</a> company that values <a href=\"https://www.notion.so/sourcegraph/Compensation-Pay-Transparency-at-Sourcegraph-d58d0774f51b4b489d41c3628d30ff8d?pvs=4\">competitive compensation</a>, our compensation ranges are visible to every single Sourcegraph teammate.</p>\n<p>Your salary is determined by your pay band for the IC4 job level. For determining pay bands, we use a number of market and data-driven salary sources, along with your location zone, and target the high-end of the range to ensure we’re always paying above market regardless of where you live in the world. Both U.S. and international locations are divided into one of four zones, determined by the cost of labor index for each area. The salary for a successful candidate will be based on level, job-related skills, experience, qualifications, and location zone. Please note that the salaries below may be adjusted in the future.</p>\n<p>💰 The target compensation for this role is based on the IC4&nbsp; pay band for your zone. The start of the IC4 pay band for each zone is listed below:</p>\n<p>Zone 1: $150,500 USD<br>Zone 2: $120,400 USD</p>\n<p>Please speak with a recruiter for additional information regarding zone locations.</p>\n<p>📈 In addition to our cash compensation, we offer equity (because when we succeed as a company, we want you to succeed, too) and generous <a href=\"https://sourcegraph.notion.site/Benefits-Perks-dd1da4b6b3a64780abed010a144d34ba\">perks &amp; benefits</a>.</p>\n<h2><span style=\"color: rgb(161, 18, 255);\"><strong>Interview process</strong></span></h2>\n<p><em>Below is the interview process you can expect for this role (you can read more about </em><a href=\"https://sourcegraph.notion.site/Types-of-interviews-f279f080583d49ee9f2c60e30c8cb1f7\"><em>the types of interviews</em></a><em> in our Handbook). It may look like a lot of steps, but rest assured that we move quickly and the steps are designed to help you get the information needed to determine if we’re the right fit for you… Interviewing is a two-way street, after all!&nbsp;</em></p>\n<p>We expect the interview process to take 4.5 hours in total.&nbsp;</p>\n<p><strong>👋 Introduction Stage</strong> - we have initial conversations to get to know you better…</p>\n<ul>\n<li>[30m]&nbsp;<a href=\"https://www.notion.so/sourcegraph/Types-of-interviews-sample-questions-f279f080583d49ee9f2c60e30c8cb1f7?pvs=4#99be5ff628b2414194a0ba79d9f25f13\">Recruiter Screen</a></li>\n<li>[30m] <a href=\"https://www.notion.so/sourcegraph/Types-of-interviews-sample-questions-f279f080583d49ee9f2c60e30c8cb1f7?pvs=4#1919882c0cf147c487eb1df40db8a694\">Hiring Manager Screen</a></li>\n</ul>\n<p><strong>🧑‍💻 Team Interview Stage</strong> - we then delve into your experience in more depth and introduce you to members of the team, including cross-functional partners…</p>\n<ul>\n<li>[60m] <a href=\"https://www.notion.so/sourcegraph/Types-of-interviews-sample-questions-f279f080583d49ee9f2c60e30c8cb1f7?pvs=4#c678a2a86e0e47e4958507e869bf7ded\">Resume Deep Dive</a></li>\n<li>[30m]&nbsp;<a href=\"https://www.notion.so/sourcegraph/Types-of-interviews-sample-questions-f279f080583d49ee9f2c60e30c8cb1f7?pvs=4#cb00697e95304550a146c32563c0255d\">Cross-functional team collaboration</a>&nbsp;</li>\n<li>[30m]&nbsp;<a href=\"https://www.notion.so/sourcegraph/Types-of-interviews-sample-questions-f279f080583d49ee9f2c60e30c8cb1f7?pvs=4#88b9f826dee04ef98afc2aeec35b877a\">Peer</a></li>\n</ul>\n<p><strong>🎉 Final Interview Stage </strong>- we move you to our final round, where you gain a better understanding of our business and values holistically…</p>\n<ul>\n<li>[30m]&nbsp;<a href=\"https://www.notion.so/sourcegraph/Types-of-interviews-sample-questions-f279f080583d49ee9f2c60e30c8cb1f7?pvs=4#e3a04291743048df87541a88aa8199dd\">Values</a></li>\n<li>[30m] <a href=\"https://www.notion.so/sourcegraph/How-to-work-with-Quinn-Slack-CEO-807673e0864d473f959cc4efd9642a5a?pvs=4#6f185c0e2011411eac5be9c675f9056c\">Leadership</a> with co-founder&nbsp;</li>\n<li>We check references and conduct your background check</li>\n</ul>\n<p>Please note - you are welcome to request additional conversations with anyone you would like to meet, but didn’t get to meet during the interview process.</p>\n\n    \n\n    <div class=\"content-conclusion\"><h2><strong><span style=\"color: #a112ff;\">Learn more about us</span></strong></h2>\n<p>We want to ensure Sourcegraph is an environment that suits your working style and empowers you to do your best work, so we are eager to answer any questions that you have about us at any point in the interview process. You can learn more about what it is like to work at Sourcegraph by reading <a href=\"https://sourcegraph.notion.site/d7614e3e9dc04c09ac2d42d57f1816e6?v=2a6d426dbae14390b155120b0c029ce0\">our handbook</a>.</p>\n<p><span style=\"font-weight: 400;\">We provide </span><a href=\"https://sourcegraph.notion.site/Compensation-Pay-Transparency-at-Sourcegraph-d58d0774f51b4b489d41c3628d30ff8d?pvs=74\"><span style=\"font-weight: 400;\">competitive compensation</span></a><span style=\"font-weight: 400;\"> and </span><a href=\"https://sourcegraph.notion.site/Benefits-Perks-dd1da4b6b3a64780abed010a144d34ba?pvs=74\"><span style=\"font-weight: 400;\">practical benefits</span></a><span style=\"font-weight: 400;\"> to keep you happy and healthy so that you can do your best work.&nbsp;</span><span style=\"font-weight: 400;\">&nbsp;</span></p>\n<p>Sourcegraph is an equal opportunity workplace; we welcome people from all backgrounds.&nbsp;</p>\n<p><em>Sourcegraph participates in&nbsp;<a href=\"https://sourcegraph.notion.site/E-Verify-2ab3286dde3446d6bac2898c83610107\">E-Verify</a> for U.S. Employees.&nbsp;</em></p></div>\n","tags":"[\"Finance\",\"management\",\"engineering\",\"B2B\"]","pubDate":"2024-10-14 10:18:31.234","link":"https://boards.greenhouse.io/sourcegraph91/jobs/5348325004","savedDate":"2024-10-14 10:18:31.241","slug":"revenue-strategy-and-operations-manager-ic4-sourcegraph-9119"},{"id":4599050059,"title":"Motion Designer (APAC)","company":"Airalo","image":"https://lever-client-logos.s3.us-west-2.amazonaws.com/55028a36-609c-479c-9553-d4689ff2dd8c-1669620566663.png","description":"<div><b>About Airalo</b></div><div>Alo! Airalo is the world’s first eSIM store that helps people connect in over 200+ countries and regions across the globe. We are building the next digital service that revolutionizes the telecom industry. We are a travel-tech company and an equal-opportunity environment that values and executes diversity, inclusion, and equity. Our team is spread across 50+ countries and six continents. What glues us together is our commitment to changing the way you connect<span style=\"font-size: 13.3333px\">. </span></div><div><br></div><div><b>About you</b></div><div>We hope that you care deeply about the quality of your work, the intrinsic worth of tasks, and the success of your team. You are self-disciplined and do not require micromanagement in terms of your skillset and work ethic. You do your best to flourish as an individual every day while working hard to foster a collaborative team environment. You believe in the importance of being — and staying — authentic, honest, positive, and kind. You are a good interlocutor with clear and concise communication. You are able to manage multiple projects, have an analytical mind, pay keen attention to detail, and love to get your hands dirty. You are cognizant, tolerant, and welcoming of vulnerabilities and cultural differences.</div><div><br></div><div><b>About the Role</b></div><div><b>Position</b>: Full-time / Employee</div><div><b>Location:</b>&nbsp;Remote-first </div><div><b>Benefits:</b>&nbsp;Health Insurance, work-from-anywhere stipend, annual wellness &amp; learning credits, annual all-expenses-paid company retreat in a gorgeous destination &amp; other benefits</div><div><br></div><div>We’re looking for a <b>Motion Designer </b>with attention to detail who loves growing global brands through video and animations. You take responsibility for the video initiatives at Airalo, a leading global eSIM marketplace for travelers that wants to revolutionize the way people think about global connectivity. You will be working closely with the growth, product, and support teams to utilize the video area as much as possible. You’re the video and animation ninja who wants to work alongside experienced team members on improving our global user acquisition and education efforts.</div><h3>Responsibilities include but are not limited to:</h3><li>We’ll need you to lead the way! Develop and establish a unique video style tailored specifically for Airalo's Multi-Media content;</li><li>Create visually compelling animations that align with Airalo’s brand identity and messaging;</li><li>Collaborate with cross-functional teams, including marketing, design, and business teams, to ensure cohesive and impactful visuals across creatives;</li><li>Conceptualize and design engaging and effective motion graphics for a variety of platforms, including social media, websites, and marketing campaigns;</li><li>Deliver impeccably executed, conversion-focused, motion and video design assets for our growth team (team instructional, tutorial-led videos, Facebook ads, google ads, app store previews, etc);</li><li>Deliver educational videos/animations that can play a crucial role in our help center and YouTube channel and will help our users understand how eSIMs work;</li><li>Record screencasts (also from mobile apps) and edit stock video assets when necessary;</li><li>Take an active part in creative brainstorming and assets conceptualization, Working with the creative team to conceptualize and transform ideas into visually engaging motion design elements;</li><li>Accountable for complete ownership of established projects.</li>,<h3>Must-haves:</h3><li>Relevant education in Motion Graphics, Animation, or a related field with demonstrable experience as a Motion Graphics Designer;</li><li>A strong design portfolio demonstrating digital (motion)design across various customer touchpoints;</li><li>Experience with sharing brand stories via video, animation, and GIFs;</li><li>Ability to ideate creative assets based on creative concepts;</li><li>Ability to be organized and prioritize effectively;</li><li>Ability to understand and follow brand guidelines and solid typographic skills;</li><li>Ability to deliver high-quality assets in line with the brief, the brand story, and the target audience;</li><li>Experience working on motion designs for social media and search advertising is a plus;</li><li>Be adaptable to various styles and project requirements, from corporate animations to more playful and creative visuals;</li><li>Great sense of design and composition, with a strong eye for layout;</li><li>Strong attention to detail - Ability to maintain accuracy throughout the creative process;</li><li>Understanding how to pitch ideas with sketches, wireframes, and mock-ups is a plus;</li><li>Tools you must be fluent with: Adobe After Effects, Adobe Illustrator, Adobe Photoshop, Adobe Premiere Pro, Adobe Animate (nice to have);</li><li>Strong Portfolio with a showcase of previous work, preferably in the Entertainment Space, utilizing tools like Adobe Creative Suite, and After Effects.</li><div><br></div><div><b>Please note that candidates without a portfolio will not be considered.</b></div>,<h3>Good to have:</h3><li>Bilingual capabilities.</li><div>If you are interested in this position, <b>please apply via the link.</b></div><div><br></div><div>We sincerely thank all applicants in advance for submitting their interest in this opportunity. Airalo is an equal opportunity employer and values diversity, equity &amp; inclusion. We do not discriminate on the basis of race, religion, national origin, gender, sexual orientation, age, marital status, veteran status, or disability status. We are committed to providing reasonable accommodations upon request for individuals with disabilities throughout our job interview process.</div>","tags":"[\"management\"]","pubDate":"2024-10-14 08:54:56.220","link":"https://jobs.lever.co/airalo/a194877a-9d9e-4956-a3c7-3ef78984ffc5","savedDate":"2024-10-14 10:18:31.244","slug":"motion-designer-apac-airalo-7283"},{"id":4017570588,"title":"Manager, Content Marketing (Remote - Work from Anywhere)","company":"Xapo Bank","image":"https://pbs.twimg.com/profile_images/1630623773090037787/M9jBuyQv_400x400.png","description":"&lt;div class=&quot;content-intro&quot;&gt;&lt;p style=&quot;text-align: left;&quot;&gt;&lt;span style=&quot;font-weight: 900;&quot;&gt;Work from anywhere, impact everywhere&amp;nbsp;&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;Diversity is at the heart of who we are at Xapo Bank. We’re a fully distributed team of over 140 Xapiens that work remotely from 40+ countries around the world.&amp;nbsp;&lt;/p&gt;\n&lt;p&gt;Our beginning: A world that enjoys economic freedom and wealth protection, no matter where you live or who is running your country. This is the dream that drove Wences Casares, our Founder and Chairman, to quietly transform the world of banking.&lt;/p&gt;\n&lt;p&gt;To achieve that, we search the world for the best people for the job. We work hard, think globally, and inspire each other to learn and grow. We are committed to changing the way things are done.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Risk is inherent in all of our business activities and managing risk well is the responsibility of every Xapien. Sound risk management enables us to serve our customers and deliver value for our shareholders, and helps make Xapo a great place to work.&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&amp;nbsp;&lt;/p&gt;\n&lt;p style=&quot;text-align: left;&quot;&gt;&lt;em&gt;&lt;span style=&quot;font-weight: 500;&quot;&gt;Although we are headquartered in Gibraltar, this is a full time, 100% remote position&amp;nbsp;&lt;br&gt;&lt;/span&gt;&lt;/em&gt;&lt;em&gt;&lt;span style=&quot;font-weight: 500;&quot;&gt;Work from anywhere!&lt;/span&gt;&lt;/em&gt;&lt;/p&gt;\n&lt;p style=&quot;text-align: left;&quot;&gt;&amp;nbsp;&lt;/p&gt;&lt;/div&gt;&lt;p&gt;&lt;strong&gt;&lt;em&gt;Position overview&lt;/em&gt;&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;The Manager of Content Marketing, reporting into the VP of Marketing, will play a crucial role in developing and executing Xapo Bank’s content strategy to drive brand awareness, engagement, and ultimately, conversions.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;&lt;em&gt;Responsibilities&lt;/em&gt;&lt;/strong&gt;&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;Develop and implement a comprehensive content marketing strategy that aligns with the company’s growth objectives and brand positioning.&lt;/li&gt;\n&lt;li&gt;Lead SEO efforts to increase visibility and organic search rankings, collaborating closely with web developers.&lt;/li&gt;\n&lt;li&gt;Manage content production across various formats including blogs, white papers, video, and social media, ensuring all content is on-brand, consistent in terms of style, quality, and tone of voice, and optimized for search and user experience.&lt;/li&gt;\n&lt;li&gt;Oversee the editorial calendar and ensure content is scheduled, produced, and published in a timely manner.&lt;/li&gt;\n&lt;li&gt;Analyze content marketing data and SEO performance to continually refine strategies and tactics, maximizing effectiveness and ROI.&lt;/li&gt;\n&lt;li&gt;Own the content and design for Xapo Bank&#39;s website&lt;/li&gt;\n&lt;li&gt;Collaborate with cross-functional teams, including product, PR, and digital marketing, to create synergies and leverage content across all channels.&lt;/li&gt;\n&lt;li&gt;Lead and expand the content marketing team, nurturing talent and developing skills to meet evolving market and organizational demands.&lt;/li&gt;\n&lt;li&gt;Foster relationships with key influencers, thought leaders, and external partners to amplify outreach and content distribution efforts.&lt;/li&gt;\n&lt;li&gt;Stay current with industry trends and competitor strategies to ensure that our content is ahead of the curve.&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;&lt;strong&gt;&lt;em&gt;Skills needed&lt;/em&gt;&lt;/strong&gt;&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;At least 6 years of experience in a similar role spanning content and organic marketing&lt;/li&gt;\n&lt;li&gt;Bachelor’s degree in Marketing, Communications, Journalism, or a related field. Advanced degree preferred.&lt;/li&gt;\n&lt;li&gt;Proven experience in content marketing and SEO, with a strong track record of enhancing organic search and engagement.&lt;/li&gt;\n&lt;li&gt;Strong analytical skills with an ability to interpret data to make informed content decisions.&lt;/li&gt;\n&lt;li&gt;Exceptional writing and editing skills, with a keen understanding of what resonates with target audiences.&lt;/li&gt;\n&lt;li&gt;Experience with content management systems, SEO tools (e.g., SEMrush, Ahrefs), and analytics platforms (e.g., GA4, Search Console).&lt;/li&gt;\n&lt;li&gt;Experience having worked in the Crypto industry.&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;&lt;strong&gt;&lt;em&gt;Other requirements&lt;/em&gt;&lt;/strong&gt;&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;A dedicated workspace.&lt;/li&gt;\n&lt;li&gt;A reliable internet connection with the fastest speed possible in your area.&lt;/li&gt;\n&lt;li&gt;Devices and other essential equipment that meet minimal technical specifications.&lt;/li&gt;\n&lt;li&gt;Alignment with Our Values and the Xapo Values-Driven Leadership principles.&lt;/li&gt;\n&lt;/ul&gt;&lt;div class=&quot;content-conclusion&quot;&gt;&lt;p&gt;&lt;span style=&quot;font-size: 12pt;&quot;&gt;&lt;strong&gt;Why work for Xapo?&lt;/strong&gt;&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span style=&quot;font-weight: 500; font-size: 10pt;&quot;&gt;IMPACT GLOBALLY, WORK REMOTELY.&lt;/span&gt;&lt;/p&gt;\n&lt;ul&gt;\n&lt;li style=&quot;font-weight: 500;&quot;&gt;&lt;strong&gt;Shape the Future:&lt;/strong&gt;&lt;span style=&quot;font-weight: 500;&quot;&gt; Improve lives through cutting-edge technology, work 100% remotely from anywhere in the world.&lt;/span&gt;&lt;/li&gt;\n&lt;li style=&quot;font-weight: 500;&quot;&gt;&lt;strong&gt;Great work-life balance:&lt;/strong&gt;&lt;span style=&quot;font-weight: 500;&quot;&gt; &lt;/span&gt;&lt;span style=&quot;font-weight: 500;&quot;&gt;Build amazing things with a balance of autonomy and collaborative teamwork. Set your own work schedule and make use of a flexible PTO plan when you need to recharge.&lt;/span&gt;&lt;span style=&quot;font-weight: 500;&quot;&gt;&amp;nbsp;&lt;/span&gt;&lt;/li&gt;\n&lt;li style=&quot;font-weight: 500;&quot;&gt;&lt;strong&gt;Expect Excellence:&lt;/strong&gt;&lt;span style=&quot;font-weight: 500;&quot;&gt; Collaborate, learn, and grow with a high-performance team. Learn&lt;/span&gt;&lt;span style=&quot;font-weight: 500;&quot;&gt; how you learn best - from books to conferences, you’ll get a yearly budget for your individual learning and development goals.&lt;/span&gt;&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;&lt;strong&gt;At Xapo, we prioritize consumer protection and adhere to regulatory requirements by ensuring that all Xapiens are accountable for upholding principles of fair treatment, transparency, and ethical conduct in their interactions with customers and stakeholders.&lt;/strong&gt;&lt;/p&gt;&lt;/div&gt;","tags":"[\"management\"]","pubDate":"2024-10-14 08:44:28.000","link":"https://job-boards.greenhouse.io/xapo61/jobs/6238550003","savedDate":"2024-10-14 10:18:31.246","slug":"manager-content-marketing-remote-work-from-anywhere-xapo-bank-105"},{"id":8357969783,"title":"Creative Designer - (Japan)","company":"Airalo","image":"https://lever-client-logos.s3.us-west-2.amazonaws.com/55028a36-609c-479c-9553-d4689ff2dd8c-1669620566663.png","description":"<div><b>About Airalo</b></div><div>Alo! Airalo is the world’s first eSIM store that helps people connect in over 200+ countries and regions across the globe. We are building the next digital service that revolutionizes the telecom industry. We are a travel-tech company and an equal-opportunity environment that values and executes diversity, inclusion, and equity. Our team is spread across 50+ countries and six continents. What glues us together is our commitment to changing the way you connect<span style=\"font-size: 13.3333px\">. </span></div><div><br></div><div><b>About you</b></div><div>We hope that you care deeply about the quality of your work, the intrinsic worth of tasks, and the success of your team. You are self-disciplined and do not require micromanagement in terms of your skillset and work ethic. You do your best to flourish as an individual every day while working hard to foster a collaborative team environment. You believe in the importance of being — and staying — authentic, honest, positive, and kind. You are a good interlocutor with clear and concise communication. You are able to manage multiple projects, have an analytical mind, pay keen attention to detail, and love to get your hands dirty. You are cognizant, tolerant, and welcoming of vulnerabilities and cultural differences.</div><div><br></div><div><b>About the Role</b></div><div><b>Position</b>: Full-time / Employee</div><div><b>Location:</b>&nbsp;Remote-first </div><div><b>Benefits:</b>&nbsp;Health Insurance, work-from-anywhere stipend, annual wellness &amp; learning credits, annual all-expenses-paid company retreat in a gorgeous destination &amp; other benefits</div><div><br></div><div>As a <b>Creative Designer</b>, you’ll be tasked with bringing ideas to life through visual design, engaging graphics, short-form content, videos, and content for Airalo.</div><div><br></div><div>eSIM technology is a relatively new concept to the majority of the population. It will be your mission to find creative ways to explain the beauty and simplicity of what Airalo can bring to an individual. The creative content you’ll create will be used to improve our global user acquisition and education efforts. You’ll harness the Airalo voice, bring narratives to life, and engage a variety of different audiences in a fun and meaningful way.</div><h3>Responsibilities include but are not limited to:</h3><li>Delivering creative visual assets, and static and motion design that brings our brand to life.</li><li>Concepting and developing content for marketing campaigns, partnership, and affiliate materials, as well as social campaigns.</li><li>You’ll be working primarily in the Growth (marketing) and Partnerships team to deliver the best solutions for our projects.</li><li>Taking ownership of projects, from concept through to completion</li><li>Working across multiple project deadlines</li><li>Help maintain visual and brand consistency</li><li>Engaging with the strategic dimension of our work</li><li>Collaborate with a diverse and distributed group of teammates across multiple locations and time zones.</li><li>Display creativity, cultural awareness, and excellent communication judgment as you advise on multimedia strategies to support communications objectives.</li><li>You’ll be working in a startup environment which calls for flexibility and willingness to collaborate within a team environment</li>,<h3>Must-haves:</h3><li>At least 1 year of working experience in a company or as a freelancer.</li><li>Degree or Diploma in a relevant design field or equivalent practical experience.</li><li>At least 3 years of experience working in Adobe’s range of Creative Cloud products including Photoshop, Illustrator, Premiere, and After Effects. Knowledge of Figma is a bonus.</li><li>A portfolio highlighting excellence and flexibility of design work and responding to a variety of briefs.</li><li>Your portfolio should showcase your design process, conceptual ability, and examples in communication design.</li><li>Fluency in Japanese and English, with impeccable verbal and written communication skills</li><div><br></div><div><b>Please note that candidates without a portfolio will not be considered.</b></div><div><br></div>,<h3>What we’re looking out for:</h3><li>An all-rounder!</li><li>Imaginative problem-solvers who can look at the big picture while reading between the lines.</li><li>Flexibility, you will need to be comfortable navigating ambiguity, tight deadlines, and shifting requirements.</li><li>Ability to turn complicated ideas into compelling, easy-to-understand visuals.</li><li>Strong communication and visual storytelling skills.</li><li>Ability to work calmly and maintain good judgment in fast-paced, high-stress environments.</li><li>Ability to solicit feedback and incorporate it quickly while meeting deadlines.</li><li>Exceptional project management and negotiation skills.</li><li>Strong attention to detail and organizational skills.</li><li>A strong understanding of Brand systems, and the ability to provide flexibility where needed, while still adhering to Brand guidelines</li><li>A clear communicator - the ability to express complex ideas clearly and succinctly, while collaborating closely with teams outside of the Creative Group</li><li>Ability to lead and also execute creative work, independently and remotely</li><li>Collaborate with cross-functional teams throughout the design process.</li><li>Comfortable working in a completely remote environment.</li>,<h3>Good to have:</h3><li>The ability to create motion graphics, and short videos to help tell stories through a variety of different channels.</li><li>Bilingual capabilities.</li><div>If you are interested in this position, <b>please apply via the link.</b></div><div><br></div><div>We sincerely thank all applicants in advance for submitting their interest in this opportunity. Airalo is an equal opportunity employer and values diversity, equity &amp; inclusion. We do not discriminate on the basis of race, religion, national origin, gender, sexual orientation, age, marital status, veteran status, or disability status. We are committed to providing reasonable accommodations upon request for individuals with disabilities throughout our job interview process.</div>","tags":"[\"management\"]","pubDate":"2024-10-11 14:29:09.687","link":"https://jobs.lever.co/airalo/025ed6dc-217b-46be-a777-aff3d8ba4bb8","savedDate":"2024-10-14 10:18:31.244","slug":"creative-designer-japan-airalo-4904"},{"id":5103494368,"title":"Freelance | Contract Senior UI Designer","company":"10up","image":"https://pbs.twimg.com/profile_images/2738508979/760be3edebfa0195e36fb3dba07297c1_400x400.png","description":"&lt;div&gt;\n&lt;div&gt;\n&lt;div&gt;&lt;strong&gt;Location: Remote - EMEA Team&lt;/strong&gt; (Open to applicants located anywhere aligned with EMEA time zones.)&lt;/div&gt;\n&lt;div&gt;&amp;nbsp;&lt;/div&gt;\n&lt;div&gt;As a Senior UI Designer at 10up, you’ll work collaboratively alongside our Content and UX Design teams, and will lead UI design - expanding your portfolio - on award-winning, enterprise-level digital experiences.&lt;/div&gt;\n&lt;div&gt;&amp;nbsp;&lt;/div&gt;\n&lt;div&gt;You’ll have the creative flexibility to explore and experiment across design tools and processes on a combination of unique, challenging projects and ongoing support engagements. As a leading digital agency, 10up’s client roster spans from innovative startups and impactful non-profits, to some of the biggest names in the industry, such as ESPN, Google, The New York Times Co., Microsoft, and The Nobel Prize Committee.&lt;/div&gt;\n&lt;div&gt;&amp;nbsp;&lt;/div&gt;\n&lt;div&gt;As a 10upper, you have options for flexible and alternative work schedules. Intentionally remote since day one, spanning six continents and 40 countries, 10up fully embraces the benefits of distributed work.&lt;/div&gt;\n&lt;/div&gt;\n&lt;div&gt;&amp;nbsp;&lt;/div&gt;\n&lt;/div&gt;\n&lt;div&gt;What you will do:&amp;nbsp;&lt;/div&gt;\n&lt;div&gt;\n&lt;ul&gt;\n&lt;li&gt;Partner with Project and Account Managers to plan design-related activities within project timelines and ideal project outcomes while mitigating risks.&lt;/li&gt;\n&lt;li&gt;Be part of design workshops, discussions, and co-creation sessions.&lt;/li&gt;\n&lt;li&gt;Engage in iterative, modular design production, documentation, and communication at various fidelity levels, such as visual concepts, style tiles, production style guides, user journeys, interactive prototypes, wireframes and layouts, high-fidelity comps, motion, animation definition, etc.&lt;/li&gt;\n&lt;li&gt;Collaborate with other disciplines on scope definition and design deliverables, fostering a psychologically safe collaboration and critique environment.&lt;/li&gt;\n&lt;li&gt;Turning insights into actionable recommendations and design solutions.&lt;/li&gt;\n&lt;/ul&gt;\n&lt;/div&gt;\n&lt;div&gt;\n&lt;p&gt;About you:&amp;nbsp;&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;You have 5+ years of experience working with modern website and app design principles across multiple devices - with a particular focus on layout, typography, color, media, and accessibility&lt;/li&gt;\n&lt;li&gt;You are equally comfortable with conceptual design and tactical design production in a fast-paced agency environment with effective time management. You have the ability to balance business, audience, and technical needs to drive positive design outcomes.&lt;/li&gt;\n&lt;li&gt;You have clear and concise client communication skills, with the ability to confidently present design work with supporting rationale and compelling storytelling with confident workshop facilitation skills and co-creation mindset to define problems, ideate, and define solutions.&lt;/li&gt;\n&lt;li&gt;You are proficient with modern design, prototyping, remote collaboration tools (e.g., Figma and Miro), and come with interactive prototyping expertise.&lt;/li&gt;\n&lt;li&gt;You have systematic design thinking and expertise in creating modular component libraries and design systems.&lt;/li&gt;\n&lt;li&gt;You have experience with large-scale content publishing or relevant adjacent expertise around designing for digital-first, editorial content.&lt;/li&gt;\n&lt;li&gt;You are able to work collaboratively within a diverse multidisciplinary team and efficiently manage design feedback from multiple stakeholders with an agility to adapt to various organizational working styles (e.g. agile, waterfall, lean etc.)&lt;/li&gt;\n&lt;li&gt;You are comfortable with ambiguity and have the ability to reduce it.&lt;/li&gt;\n&lt;li&gt;You work in a timezone with at least 4-6 hours of overlap with the GMT timezone.&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;The expected hourly rate for this role is up to &lt;strong&gt;$60 USD&lt;/strong&gt; per hour. Compensation is determined based on a variety of factors including relevant experience, projects, geographic location, and business needs.&lt;/p&gt;\n&lt;div&gt;\n&lt;div&gt;\n&lt;div&gt;&lt;strong&gt;Join our Contractor Pool!&amp;nbsp;&lt;/strong&gt;&lt;/div&gt;\n&lt;div&gt;&amp;nbsp;&lt;/div&gt;\n&lt;div&gt;We are currently accepting applications for upcoming freelance opportunities. If you are passionate about 10up&#39;s mission and great UI work, please apply. We&#39;d appreciate the opportunity to personally review your application. Everyone gets a response.&lt;/div&gt;\n&lt;div&gt;&amp;nbsp;&lt;/div&gt;\n&lt;/div&gt;\n&lt;/div&gt;\n&lt;div&gt;Read more about &lt;a class=&quot;postings-link&quot; href=&quot;https://drive.google.com/file/d/1nQ9yWRqfDAdrriYRnBNzYo7w59auYxMe/view&quot;&gt;What to Expect &lt;/a&gt;through our Recruiting process.&lt;/div&gt;\n&lt;div&gt;&amp;nbsp;&lt;/div&gt;\n&lt;div&gt;We don&#39;t want you to miss any communication from us! To ensure you receive updates on your application, please add jobs@10up.com to your contacts list! #LI-DNI #LI-remote&lt;/div&gt;\n&lt;/div&gt;\n&lt;div&gt;&amp;nbsp;&lt;/div&gt;","tags":"[\"management\"]","pubDate":"2024-10-10 17:27:24.000","link":"https://job-boards.greenhouse.io/10up/jobs/4054603008","savedDate":"2024-10-14 10:18:31.242","slug":"freelance-contract-senior-ui-designer-10up-3236"},{"id":5980865700,"title":"Senior Technical Recruiter","company":"Airalo","image":"https://lever-client-logos.s3.us-west-2.amazonaws.com/55028a36-609c-479c-9553-d4689ff2dd8c-1669620566663.png","description":"<div><b>About Airalo</b></div><div>Alo! Airalo is the world’s first eSIM store that helps people connect in over 200+ countries and regions across the globe. We are building the next digital service that revolutionizes the telecom industry. We are a travel-tech company and an equal-opportunity environment that values and executes diversity, inclusion, and equity. Our team is spread across 50+ countries and six continents. What glues us together is our commitment to changing the way you connect<span style=\"font-size: 13.3333px\">. </span></div><div><br></div><div><b>About you</b></div><div>We hope that you care deeply about the quality of your work, the intrinsic worth of tasks, and the success of your team. You are self-disciplined and do not require micromanagement in terms of your skillset and work ethic. You do your best to flourish as an individual every day while working hard to foster a collaborative team environment. You believe in the importance of being — and staying — authentic, honest, positive, and kind. You are a good interlocutor with clear and concise communication. You are able to manage multiple projects, have an analytical mind, pay keen attention to detail, and love to get your hands dirty. You are cognizant, tolerant, and welcoming of vulnerabilities and cultural differences.</div><div><br></div><div><b>About the Role</b></div><div><b>Position</b>: Full-time / Employee</div><div><b>Location:</b>&nbsp;Remote-first </div><div><b>Benefits:</b>&nbsp;Health Insurance, work-from-anywhere stipend, annual wellness &amp; learning credits, annual all-expenses-paid company retreat in a gorgeous destination &amp; other benefits</div><div><br></div><div>As a <b>Senior Technical Recruiter</b>, you will play a hands-on role in finding, interviewing, and hiring top talent for Airalo’s <b>Engineering, Product and Data teams</b>. With a focus on technical roles, you’ll work closely with hiring managers and key stakeholders to identify and onboard the best candidates.</div><div>Your primary focus will be full-cycle recruitment, from sourcing to interviewing while providing a high-touch experience for every candidate from application stage to offer, in a high-growth environment.</div><h3>Responsibilities include but are not limited to:</h3><li>Actively drive the recruitment process for <b>Engineering, Product and Data</b> roles, collaborating with hiring managers to understand specific hiring needs and technical requirements.</li><li>Conduct full-cycle recruitment: sourcing, initial screenings, interviews, managing candidate pipelines, and coordinating interview processes with hiring managers.</li><li>Craft and post job descriptions on various job boards, ensuring a targeted approach to reach the most qualified candidates.</li><li>Screen and interview candidates, focusing on their technical expertise and cultural fit for the company, while managing a smooth process from interview to offer.</li><li>Build and maintain strong relationships with technical talent, ensuring a pipeline of top-tier candidates for future roles.</li><li>Collaborate with the TA Lead, Directors and team members to create innovative strategies for attracting top technical talent.</li><li>Ensure candidates’ data is well-maintained across recruitment systems (ATS), and provide regular reports on hiring metrics (pipeline strength, time-to-hire, etc.).</li><li>Offer insights to hiring managers on recruitment best practices, help train and coach interviewers, and support candidate evaluations.</li>,<h3>Must-haves:</h3><li>A relevant degree or equivalent work experience</li><li><b>5+ years</b> of experience in technical recruitment, preferably a background in agency recruitment</li><li>Proven experience hiring for <b>technical roles</b>, particularly in Engineering &amp; Product teams, and a deep understanding of <b>relevant technical terminology</b>.</li><li>Experience working in high-growth tech environments</li><li>Strong knowledge of <b>full-cycle recruiting</b>, from sourcing candidates to negotiating offers, with the ability to recruit for highly specialized and hard-to-fill technical roles.</li><li>Skilled in a variety of talent sourcing techniques, including Boolean searches and technical talent mapping.</li><li>Experience coaching and training hiring managers and interviewers.</li><li>Experience with <b>ATS</b> systems (Lever preferred) and other tools for recruitment.</li><li>Solid understanding of technical hiring needs and the ability to assess candidates on both <b>technical skills</b> and <b>cultural fit</b>.</li><li>Excellent communication skills and experience working closely with hiring managers in fast-paced, tech-driven environments.</li>,<h3>Good to have:</h3><li>Experience working with <b>Lever</b> (ATS) and <b>Notion</b>.</li><li>Familiarity with the <b>traveltech</b> or <b>telco</b> industries.</li><li>Experience implementing employer branding initiatives</li><li>Experience leveraging AI tools in recruitment such as <b>Metaview, Gemini or GPT</b></li><div>We sincerely thank all applicants in advance for submitting their interest in this opportunity. Airalo is an equal opportunity employer and values diversity, equity &amp; inclusion. We do not discriminate on the basis of race, religion, national origin, gender, sexual orientation, age, marital status, veteran status, or disability status. We are committed to providing reasonable accommodations upon request for individuals with disabilities throughout our job interview process.</div>","tags":"[\"management\",\"engineering\"]","pubDate":"2024-10-10 16:03:45.952","link":"https://jobs.lever.co/airalo/6d1f3f9c-b985-44dc-b1a3-653258ae8b60","savedDate":"2024-10-14 10:18:31.245","slug":"senior-technical-recruiter-airalo-4790"},{"id":2439597635,"title":"Freelance | Contract Senior Front End Engineer","company":"10up","image":"https://pbs.twimg.com/profile_images/2738508979/760be3edebfa0195e36fb3dba07297c1_400x400.png","description":"&lt;div&gt;\n&lt;div&gt;\n&lt;div&gt;\n&lt;div&gt;&lt;strong&gt;Location: Remote - EMEA Team&lt;/strong&gt; (Open to applicants located anywhere aligned with EMEA time zones.)&lt;/div&gt;\n&lt;div&gt;&amp;nbsp;&lt;/div&gt;\n&lt;div&gt;At 10up, we call developers like you engineers because you aren&#39;t just a &quot;coder&quot;: you&#39;re an innovative problem solver that uses web programming skills to divine smart, creative solutions to client challenges.&amp;nbsp;&lt;/div&gt;\n&lt;div&gt;&amp;nbsp;&lt;/div&gt;\n&lt;div&gt;As a leading digital agency, 10up&#39;s client roster spans from innovative startups and impactful non-profits to some of the biggest names in the industry, such as ESPN, Google, The New York Times Co., Microsoft, and The Nobel Prize Committee. 10uppers have been pushing the boundaries of web experiences for over 12 years—become an engineer that innovates the internet by building exciting projects alongside a top-in-the-field team.&lt;/div&gt;\n&lt;div&gt;&amp;nbsp;&lt;/div&gt;\n&lt;div&gt;As a 10up contractor, you have options for flexible and alternative work schedules. Intentionally remote since day one, spanning six continents and 40 countries, 10up fully embraces the benefits of distributed work.&lt;/div&gt;\n&lt;div&gt;&amp;nbsp;&lt;/div&gt;\n&lt;/div&gt;\n&lt;/div&gt;\n&lt;/div&gt;\n&lt;div&gt;&lt;strong&gt;What you will do:&amp;nbsp;&lt;/strong&gt;&lt;/div&gt;\n&lt;div&gt;\n&lt;ul&gt;\n&lt;li&gt;Develop large-scale modular applications with advanced knowledge of HTML, CSS, and JavaScript.&lt;/li&gt;\n&lt;li&gt;Provide code reviews.&lt;/li&gt;\n&lt;li&gt;Bring art direction to life on the web through quality craftsmanship defined by performance, accessibility, maintainability, and aesthetic refinement on large-scale projects.&lt;/li&gt;\n&lt;li&gt;Solve complex problems in simple yet elegant ways.&lt;/li&gt;\n&lt;li&gt;Ultimately you will make the web better by finely crafting websites, apps, and tools that reach millions of online visitors every day.&lt;/li&gt;\n&lt;/ul&gt;\n&lt;/div&gt;\n&lt;div&gt;\n&lt;p&gt;&lt;strong&gt;About you:&amp;nbsp;&lt;/strong&gt;&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;You love perfecting your skills in cross-browser/device front-end engineering through crafting custom UI components in either React or a WordPress (block editor) stack.&lt;/li&gt;\n&lt;li&gt;You have a code portfolio of real-world samples showcasing your technical abilities. Link us to your best custom work on GitHub and you’ll never have to do any live coding or whiteboard testing!&amp;nbsp;&lt;/li&gt;\n&lt;li&gt;You are comfortable talking to clients and team members to clearly present your thoughts.&lt;/li&gt;\n&lt;li&gt;You’re proficient at building coded style guides and creating highly componentized systems.&lt;/li&gt;\n&lt;li&gt;You prefer to work fully remote and are effectively engaging in a distributed team from the location of your choosing.&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;The expected hourly rate for this role is between &lt;strong&gt;$50 and $90 USD&lt;/strong&gt;. Compensation is determined based on a variety of factors including relevant experience, projects, geographic location, and business needs.&lt;/p&gt;\n&lt;div&gt;\n&lt;div&gt;&lt;strong&gt;Join our Contractor Pool!&amp;nbsp;&lt;/strong&gt;&lt;/div&gt;\n&lt;div&gt;&amp;nbsp;&lt;/div&gt;\n&lt;div&gt;We are currently accepting applications for upcoming freelance opportunities. If you are passionate about 10up&#39;s mission and great UI work, please apply. We&#39;d appreciate the opportunity to personally review your application. Everyone gets a response.&lt;/div&gt;\n&lt;div&gt;&amp;nbsp;&lt;/div&gt;\n&lt;/div&gt;\n&lt;div&gt;Read more about &lt;a class=&quot;postings-link&quot; href=&quot;https://drive.google.com/file/d/1nQ9yWRqfDAdrriYRnBNzYo7w59auYxMe/view&quot;&gt;What to Expect &lt;/a&gt;through our Recruiting process.&lt;/div&gt;\n&lt;div&gt;&amp;nbsp;&lt;/div&gt;\n&lt;div&gt;We don&#39;t want you to miss any communication from us! To ensure you receive updates on your application, please add jobs@10up.com to your contacts list! #LI-Remote&amp;nbsp;&lt;/div&gt;\n&lt;/div&gt;\n&lt;div&gt;&amp;nbsp;&lt;/div&gt;","tags":"[\"javascript\",\"engineering\"]","pubDate":"2024-10-10 14:54:59.000","link":"https://job-boards.greenhouse.io/10up/jobs/4173617008","savedDate":"2024-10-14 10:18:31.242","slug":"freelance-contract-senior-front-end-engineer-10up-6691"},{"id":7752610160,"title":"Supply Chain Specialist / Sr. Specialist","company":"Ciceksepeti","image":"https://lever-client-logos.s3.us-west-2.amazonaws.com/de4eebbf-97f1-4bdb-b542-4fa65a0b48ab-1662467464737.png","description":"<div><b>Want to join us as we move closer to be a leader in all markets in which we operate, as a pioneering tech company?</b>&nbsp;</div><div><br></div><div><span style=\"font-size: 10.5pt;\">We’re looking for bright, intellectually curious professionals ready to bring out the best in themselves devoid of corporate buzzwords and bureaucracy in a global environment. We offer real-life cases to resolve and a true taste of professional life in a high-growth, high-speed tech company.</span></div><div><span style=\"font-size: 10.5pt;\">If you want to hold full accountability of your work, if you want to be heard when you have new ideas to contribute to the business, and if you’re ready to experience exceptional on-the-job training; then you’re ready for the challenge.</span></div><h3>🎯Your Journey Begins: Embrace the Exciting Adventure Ahead!</h3><li>Execution of all transactions in support of the inventory management strategies.</li><li>Develop and measure inventory levels and service performance through KPIs</li><li>Forecasts demand and stocking strategy for supplies based on usage, supply availability and seasonality</li><li>SKU based demand planning forecast on the basis of sales data</li><li>Constantly working with category and operations related to sales forecasts, campaigns, seasonal effects and product parameters</li><li>Preparing weekly and monthly performance reports (Forecast accuracy, OTIF, Stock adequacy)</li><li>Measure, report and improve the demand planning KPIs</li><li>Managing the processes of all materials such as flowers and consumables to be sent to dealers</li><li>Determining the website sales prices of the flower arrangements on the site and monitor consumer purchasing behavior.</li>,<h3>✨Let Your Skills Shine with Us!</h3><li>University degree with background in Engineering, Economics (Preferably Industrial Engineer)</li><li>Minimum 3-4 years professional experience at relevant positions</li><li>Excellent command of both written and spoken English</li><li>Professional knowledge of MS Office applications,Preferably having experience with Power BI and Microsoft AX</li><li>Strong ability to research and follow-up, successful time management, strong analysis, and reporting skills</li>,<h3>😎What’s in here for you?</h3><li>🎉Fun and Adventure Await: Get ready for exhilarating team adventures and unforgettable company activities that will create memories to cherish!&nbsp;🌈</li><li>🛍️Take excellent care of yourself : HiDoctor, Momento, and More!&nbsp;👩🏻‍⚕️</li><li>🎩Express Your Unique Style: No more stuffy suits or uncomfortable attire. Embrace your personal style and wear whatever makes you feel confident and comfortable. 👗👕</li><li>📚Unlock Your Potential: Biweekly Learning Hours and a Vast Training Library Await! 🎓 Never stop learning and growing! With unlimited access to top-notch training resources like Udemy and more, your professional growth knows no limits! 🚀</li><li>🥰Join Vibrant Social Clubs: Connect, Collaborate, and Create Lifelong Friendships!🎉Be part of our vibrant social clubs, where you can engage with colleagues who share your passions and interests. Cultivate meaningful connections, foster collaboration, and create memories that extend beyond the workplace.🤝</li><li>🤝Seamless Onboarding: Receive a Warm Welcome and a Smooth Transition! 📋 Our dedicated onboarding process ensures you feel supported and empowered from day one. We provide comprehensive training and resources to help you settle into your role quickly and effectively. 🌟</li><li>Join us on this exciting journey a dynamic work ecosystem, thrilling team activities, entertainment galore, a flexible dress code, and endless learning opportunities await you! It’s time to unleash your full potential and embrace the future of work!&nbsp;💃</li><div><b>😍About Us</b></div><div><br></div><div>As a pioneering tech company in gifts, our vision is to be a leader in all markets in which we operate. We create lifelong value in the lives of our employees, customers and all our business partners! 💪</div><div><br></div><div>Founded in 2006 by Emre Aydın, <a href=\"http://ciceksepeti.com/\">Ciceksepeti.com</a> offers the broadest selection of flowers &amp; gifts delivered same day within a single experience. We are very proud to have created a culture of celebration among people with our gift arrangements and our brand Bonnyfood. We are committed to continuing this tradition by making every special day memorable. In addition to our original mission of bringing a new perspective to the e-commerce sector in Turkey and making shipping faster and easier, now we offer a diverse range of products under various categories, such as electronics, home &amp; living, personal care, supermarket, cosmetics, fashion, sports &amp; outdoor, hobby, pet shop, jewelry &amp; accessories, as well as flowers and edible flowers since 2019.</div><div><br></div><div><a href=\"http://ciceksepeti.com/\">Ciceksepeti.com</a> is the most visited floral and gifting website according to SimilarWeb data, having 4 times more visitors than the second largest player in the world. 😎</div><div><br></div><div>Besides covering 70+ cities in Turkey through 55.000+ vendors and 24x7 customer support, Ciceksepeti has expanded into Mexico with its international brand, LolaFlora.💃</div><div><br></div><div>We are so happy and proud to have been selected the Best Employer Brand at LinkedIn Turkey Talent Awards in 2019 and 2022! 🥳</div><div><br></div><div>Headquartered in İstanbul, we’re a young, nimble, dedicated team of professionals, who are not only hard workers but also smart workers; who know how to get things done in the right way, as well as getting the right things done for our customers. Moreover, we’re on the verge of an exciting episode in our journey as we simultaneously set foot on international markets and grow further in the domestic market.</div><div><br></div><div>\"İşe alım süreçlerimizde kişisel verilerinizi nasıl işlediğimize dair bilgiye çalışan adayı aydınlatma metnimizden ulaşabilirsiniz./ Please see our candidate privacy note for information on how we process your personal data during our recruitment activities.\"</div><div><a style=\"font-size: 15px;\" href=\"https://cdn03.ciceksepeti.com/editor/hr/Ciceksepeti_Calisan_Adayi_Aydinlatma_Metni_2024-08-29.pdf\">https://cdn03.ciceksepeti.com/editor/hr/Ciceksepeti_Calisan_Adayi_Aydinlatma_Metni_2024-08-29.pdf</a></div><div><a style=\"font-size: 15px;\" href=\"https://cdn03.ciceksepeti.com/editor/hr/CS_Teknoloji_Calisan_Adayi_Aydinlatma_Metni_2024-08-29.pdf\">https://cdn03.ciceksepeti.com/editor/hr/CS_Teknoloji_Calisan_Adayi_Aydinlatma_Metni_2024-08-29.pdf</a></div>","tags":"[\"management\",\"engineering\"]","pubDate":"2024-10-10 11:15:26.698","link":"https://jobs.lever.co/ciceksepeti/3c439208-0435-4ab6-b08e-f5eaac4813d6","savedDate":"2024-10-14 10:18:31.245","slug":"supply-chain-specialist-sr-specialist-ciceksepeti-5729"},{"id":7412557536,"title":"Senior Python Developer (worldwide remote, work anywhere)","company":"CloudLinux","image":"https://pbs.twimg.com/profile_images/696718028084482050/ymY3OEPk_400x400.png","description":"<p>AlmaLinux Team is offering you an opportunity to improve one of the well-known open-source projects — AlmaLinux OS. AlmaLinux OS is 1:1 binary compatible with RHEL and the most popular CentOS replacement. It’s completely free and driven by the community. There are infrastructure projects that you are going to develop and contribute to. AlmaLinux Build System is one of these. It includes several stages, from building and releasing a package to automating the process and enhancing its features. The Team invites you to work closely with the community on such valuable and open projects.</p><p>Moreover, as part of this expert team, you will work on interesting and ambitious internal projects.<br><br><strong>What you will do</strong></p><ul> <li>You will be involved in designing the AlmaLinux OS <a href=\"https://github.com/AlmaLinux/build-system\" rel=\"nofollow noreferrer noopener\" class=\"external\"><u>Build automation system</u></a> and other open-source projects.</li> <li>You will also work on other open-source projects that are part of the ecosystem: <a href=\"https://pulpproject.org/\" rel=\"nofollow noreferrer noopener\" class=\"external\">Pulp</a>, <a href=\"https://gitea.io/ru-ru/\" rel=\"nofollow noreferrer noopener\" class=\"external\"><u>Gitea</u></a>, <a href=\"https://github.com/rpm-software-management/mock\" rel=\"nofollow noreferrer noopener\" class=\"external\">Mock</a>, <a href=\"https://github.com/ansible/ansible\" rel=\"nofollow noreferrer noopener\" class=\"external\">Ansible</a>, etc.</li> </ul><ul><li>You will be an active member of the AlmaLinux community.</li></ul><p><strong><br>Technology Stack</strong></p><ul> <li>Python 3;</li> <li>MongoDB, PostgreSQL, SQLAlchemy, Redis;</li> <li>FastAPI, Flask, Celery;</li> <li>VueJS, Quasar framework.</li> </ul><h3>Requirements: </h3><ul> <li>5+ years of Python programming experience.</li> <li>GNU/Linux operating system and shell scripting experience.&nbsp;&nbsp;</li> <li>Experience with git-based development processes.&nbsp;&nbsp;</li> <li>English - intermediate and higher.</li> </ul><p></p><p><strong>Will be a plus:</strong></p><ul> <li>CI/CD (e.g. Jenkins, GitHub Actions).</li> <li>AWS S3/EC2, Azure experience.</li> <li>Terraform/Ansible.</li> <li>Knowledge of RPM/DEB packages build process (mock, pbuilder, etc.).</li> <li>Experience with Django.</li> </ul><h3>Benefits: </h3><p><strong>What's in it for you?</strong></p><ul> <li>A focus on professional development.</li> <li>Interesting and challenging projects.</li> <li>Fully remote work with flexible working hours, that allows you to schedule your day and work from any location worldwide.</li> <li>Paid 24 days of vacation per year, 10 days of national holidays, and unlimited sick leaves.</li> <li>Compensation for private medical insurance. </li> <li>Co-working and gym/sports reimbursement.</li> <li>Budget for education.</li> <li>The opportunity to receive a reward for the most innovative idea that the company can patent.</li> </ul><p></p><p><em>By applying for this position, you agree with the </em><a href=\"https://cloudlinux.com/privacy-policy\" target=\"_blank\" rel=\"nofollow noreferrer noopener\" class=\"external\">CloudLinux Privacy Policy</a><a href=\"https://cloudlinux.com/privacy-policy\" target=\"_blank\" rel=\"nofollow noreferrer noopener\" class=\"external\">https://cloudlinux.com/privacy-policy</a><em>  - </em><a href=\"https://cloudlinux.com/privacy-policy\" target=\"_blank\" rel=\"nofollow noreferrer noopener\" class=\"external\"></a><a href=\"https://cloudlinux.com/privacy-policy\" target=\"_blank\" rel=\"nofollow noreferrer noopener\" class=\"external\"></a><em>and give us your consent to maintain and process your personal data in this respect. Please read </em><a href=\"https://cloudlinux.com/privacy-policy\" target=\"_blank\" rel=\"nofollow noreferrer noopener\" class=\"external\">Privacy Policy </a><em>for more information.</em></p>","tags":"[\"postgres\",\"management\",\"mongo\",\"aws\"]","pubDate":"2024-10-10 00:00:00.000","link":"https://apply.workable.com/cloudlinux-1/j/B96DBB2356","savedDate":"2024-10-14 10:18:31.243","slug":"senior-python-developer-worldwide-remote-work-anywhere-cloudlinux-8568"},{"id":7904487365,"title":"Malware Intelligence Analyst (worldwide remote, work anywhere)","company":"CloudLinux","image":"https://pbs.twimg.com/profile_images/696718028084482050/ymY3OEPk_400x400.png","description":"<p><strong>Imunify360 Security Suite is a product of CloudLinux Inc., the maker of the #1 OS in security and stability for hosting providers.</strong> Imunify is an innovative security solution designed specifically for shared and VPS/Dedicated servers. The automated, easy-to-use solution with the six-layer approach to security delivers comprehensive and complete attack prevention. Check out our website for more information about our Imunify Product: <a href=\"https://www.imunify360.com/.\" target=\"_blank\" rel=\"nofollow noreferrer noopener\" class=\"external\">https://www.imunify360.com/</a><strong>.</strong></p><p><strong>Our growing Imunify Security Team is looking for a Malware Intelligence Analyst.</strong> You will be responsible for analyzing various types of malware attacking the web hosting servers and creating improvements in our products that will help prevent infections for our clients in the future. The position is fully remote with flexible hours, allowing you to plan your day and work from anywhere in the world. Join us and take your career to the next level!</p><h3>Requirements: </h3><p><strong>To be successful in this role you should have:</strong></p><ul> <li>Excellent knowledge of regular expressions (PCRE). We expect you to know the difference between \\A and ^, why you need to use modifiers (?: ...), and why you should not start regex with \\w to find a fragment in a file, etc.</li> <li>3+ years of experience working with PHP and JavaScript</li> <li>Experience cleaning up websites from malware (big plus)</li> <li>Experience with web attacks (web application and browser security) and their mitigation methods</li> <li>Solid understanding of web server software and hosting systems architectures</li> <li>Web-based malware reverse engineering skills (JS deobfuscation, PHP deobfuscation)</li> <li>Proficiency in English above intermediate level</li> </ul><p></p><p><strong>We would be thrilled to connect with you if:</strong></p><ul> <li>You are a fast-learning and proactive person</li> <li>You want to work in a fast-paced growing deadline-driven startupup environment</li> <li>You have strong self-motivation and are driven to achieve committed milestones</li> <li>You have the ability to work both in a team and independently</li> <li>You are open to and value cooperation and feedback from others</li> <li>You can make decisions and be accountable for your actions</li> <li>You can independently analyze a task and find the right solution</li> <li>You are adaptable and able to work in a fast-paced, rapidly changing environment</li> </ul><h3>Benefits: </h3><p><strong>What's in it for you?</strong></p><ul> <li>A focus on professional development</li> <li>Interesting and challenging projects</li> <li>Remote work on a full-time basis under a long-term contract</li> <li>Flexible working hours</li> <li>Paid one month vacation per year and unlimited sick leave</li> <li>Days off on national holidays</li> <li>Medical insurance reimbursement</li> <li>Co-working and gym/sports reimbursement</li> <li>The opportunity to receive a reward for the most innovative idea that the company can patent</li> </ul><p></p><p></p><p></p><p><em>By applying for this position, you agree with </em><a href=\"https://cloudlinux.com/privacy-policy\" rel=\"nofollow noreferrer noopener\" class=\"external\"><em>Cloudlinux Privacy Policy</em></a><em> and give us your consent to maintain and process your personal data with this respect. Please read our Privacy Policy for more information.</em></p>","tags":"[\"javascript\",\"engineering\"]","pubDate":"2024-10-10 00:00:00.000","link":"https://apply.workable.com/cloudlinux-1/j/25E7266D0B","savedDate":"2024-10-14 10:18:31.243","slug":"malware-intelligence-analyst-worldwide-remote-work-anywhere-cloudlinux-3264"},{"id":9237645914,"title":"Malware Remediation Analyst (worldwide remote, work anywhere)","company":"CloudLinux","image":"https://pbs.twimg.com/profile_images/696718028084482050/ymY3OEPk_400x400.png","description":"<p><strong>Imunify360 Security Suite is a product of CloudLinux Inc., the maker of the #1 OS in security and stability for hosting providers.</strong> Imunify is an innovative security solution designed specifically for shared and VPS/Dedicated servers. The automated, easy-to-use solution with the six-layer approach to security delivers comprehensive and complete attack prevention. Check out our website for more information about our Imunify Product: <a href=\"https://www.imunify360.com/.\" target=\"_blank\" rel=\"nofollow noreferrer noopener\" class=\"external\">https://www.imunify360.com/</a><strong>.</strong></p><p><strong>Our growing Imunify Security Team is looking for a Malware Remediation Analyst </strong>to analyze various types of malware attacks on web hosting servers and develop improvements to our products that will help prevent future infections for our clients.</p><p></p><p><strong>As a Malware Remediation Analyst, your key responsibilities will include:</strong></p><ul> <li>Analyzing malware samples to determine their purpose and origin, including scanning files for virus detection</li> <li>Identifying security vulnerabilities in websites, networks, and operating systems</li> <li>Reviewing historical attack data to assess and implement effective responses to new threats</li> <li>Building and testing prototypes of security measures to prevent future attacks</li> <li>Evaluating potential security risks and devising strategies to mitigate hacking attempts</li> <li>Researching emerging malware types to develop detection methods for new and evolving threats</li> <li>Developing antivirus software to identify and remove malware from infected computers</li> <li>Documenting malware analysis findings for future reference and knowledge sharing</li> </ul><h3>Requirements: </h3><p><strong>To be successful in this role you should have:</strong></p><ul> <li>Experience with GNU/Linux operating systems and shell scripting</li> <li>2+ years of experience working with PHP</li> <li>Knowledge of web-based malware analysis (e.g., unpacking, deobfuscation)</li> <li>Experience in cleaning up malware-infected websites</li> <li>Familiarity with Apache and Nginx (LightSpeed experience is a plus)</li> <li>An analytical mindset for analyzing security threats</li> <li>Proficiency in English above intermediate level</li> </ul><p><strong>It will be a plus if you have:</strong></p><ul> <li>Python programming skills</li> <li>Understanding of security standards and frameworks such as CVE, CWE, CVSS, MITRE ATT&amp;CK, etc.</li> <li>Knowledge of regular expressions (PCRE)</li> </ul><h3>Benefits: </h3><p><strong>What's in it for you?</strong></p><ul> <li>A focus on professional development</li> <li>Interesting and challenging projects</li> <li>Remote work on a full-time basis under a long-term contract</li> <li>Flexible working hours</li> <li>Paid one month vacation per year and unlimited sick leave</li> <li>Days off on national holidays</li> <li>Medical insurance reimbursement</li> <li>Co-working and gym/sports reimbursement</li> <li>The opportunity to receive a reward for the most innovative idea that the company can patent</li> </ul><p></p><p></p><p></p><p><em>By applying for this position, you agree with </em><a href=\"https://cloudlinux.com/privacy-policy\" rel=\"nofollow noreferrer noopener\" class=\"external\"><em>Cloudlinux Privacy Policy</em></a><em> and give us your consent to maintain and process your personal data with this respect. Please read our Privacy Policy for more information.</em></p>","tags":"[]","pubDate":"2024-10-10 00:00:00.000","link":"https://apply.workable.com/cloudlinux-1/j/5E256AA9E3","savedDate":"2024-10-14 10:18:31.244","slug":"malware-remediation-analyst-worldwide-remote-work-anywhere-cloudlinux-4735"},{"id":1882562144,"title":"Operations Assistant (remote-only opportunity, location - Europe&CIS)","company":"CloudLinux","image":"https://pbs.twimg.com/profile_images/696718028084482050/ymY3OEPk_400x400.png","description":"<p></p><p>CloudLinux is a global remote-first company. We are driven by our principles: do the right thing, employees first, we are remote first, and we deliver high volume, low-cost Linux infrastructure and security products that help companies to increase the efficiency of their operations. Every person on our team supports each other and does what we can to ensure we all are successful.</p><p><br>We are looking for a proactive and detail-oriented Operations Assistant to support our Operations team with daily administrative tasks, ensuring smooth and efficient business processes. This role is perfect for someone who enjoys organization, multitasking, and supporting company-wide operations.<br></p><p><strong>Key responsibilities:</strong></p><p></p><ul> <li>Provide timely administrative support to the Executives and Operations team, including data entry, maintaining records, organizing and filing documents, assisting with project coordination, managing team calendars, mailing out important information within the company</li> <li>Act as the point of contact between Executives, employees, and external vendors</li> <li>Plan and organize business appointments and events for team members</li> <li>Coordinate travel arrangements, including preparing transport/flight option and itineraries while offering remote support during business trips</li> <li>Monitor and maintain documentation for processes, procedures, and operations-related information</li> <li>Coordinate and follow up on ongoing projects, ensuring timelines are met</li> <li>Manage multiple Google docs and spreadsheets efficiently</li> <li>Conduct research and gather information as requested by Executives and the Operations team</li> <li>Perform such other duties as may be assigned</li> </ul><h3>Requirements: </h3><ul> <li>Excellent organizational and multi-tasking skills with an ability to prioritize the tasks and a keen attention to detail</li> <li>Strong self-motivation, capable of delivering results with minimal supervision</li> <li>Strong problem-solving skills and a proactive mindset</li> <li>The ability to analyze tasks independently and identify the best solution</li> <li>Strong English communication skills (both verbal &amp; written)</li> <li>Proficient in Google Workspace and Microsoft Office Suite (Word, Excel, PowerPoint)&nbsp;</li> <li>Being reliable, adaptable, and flexible</li> </ul><h3>Benefits: </h3><p><strong>What's in it for you?</strong></p><ul> <li>A focus on professional development; </li> <li>Interesting and challenging projects</li> <li>Flexible working hours</li> <li>Paid one month vacation per year and unlimited sick leave</li> <li>Medical insurance reimbursement</li> <li>Co-working and gym/sports reimbursement</li> <li>The opportunity to receive a reward for the most innovative idea that the company can patent</li> </ul><p><em>By applying for this position, you agree with </em><a href=\"https://cloudlinux.com/privacy-policy\" rel=\"nofollow noreferrer noopener\" class=\"external\"><em>Cloudlinux Privacy Policy</em></a><em> and give us your consent to maintain and process your personal data with this respect. Please read our Privacy Policy for more information.</em></p>","tags":"[]","pubDate":"2024-10-04 00:00:00.000","link":"https://apply.workable.com/cloudlinux-1/j/28D25BE4D0","savedDate":"2024-10-14 10:18:31.244","slug":"operations-assistant-remote-only-opportunity-location-europe-cis-cloudlinux-884"}]