[{"id":2586716795,"title":"Software Engineer - Remote (Global)","company":"MixRank","image":"https://pbs.twimg.com/profile_images/378800000147745937/0fac42c12b433bbbd53ff3e15cd6fca4_400x400.png","description":"<p><strong>Who we are</strong></p>\n<p>MixRank processes petabytes of data every month from web crawling. We have hundreds of customers using our data products including Google, Amazon, Facebook, Intel, and Adobe, across industries Sales, Marketing, Finance, and Security.</p>\n<p>Team is 40 full-time, full-remote from 20+ countries. We're growing, profitable, employee-owned, no dependence on outside funding. Applicants from all geographies and backgrounds are welcome.</p>\n<p>We are looking for passionate individuals for whom programming is not just a job but it’s something they love to do. We're obsessed with computers, programming, big data, databases, compilers, hardware, math, data science, and the internet. Does this sound like you? Please apply to join our team.</p>\n<p>Our code base is very friendly to new contributors. You'll have a fully-functional development environment within hours (fully automated) and be pushing commits on your first day. Deployments to production happen multiple times per day and finish in less than 2 minutes. Effectively all of our codebase is written in Python, Rust, SQL, Javascript/TypeScript, and Nix. The core technologies you'll need familiarity with to be productive are Python, PostgreSQL, Linux, and Git.</p>\n<p>We operate at a larger scale than typical startups. We operate two datacenters with high performance servers we've built that are capable of dealing with the volumes of data we process. We've implemented our own distributed file system. We do full-scale web crawls. We download and perform static analysis on the entire universe of Android APKs and iOS IPAs that are published. Unlike a typical startup where you'll spend half of your time in meetings, and the other half fixing bugs from Jira tickets— at MixRank you'll get to challenge yourself with difficult technical problems that will help you to grow as an individual.</p>\n<p><strong>Who we’re looking for</strong></p>\n<p>We're hiring generalist software engineers to work on web applications, data mining, machine learning/data science, data transformation/ETL, data modeling, database scaling, infrastructure, devops, and more. We'll cater the role to whatever subset of these areas match your interests.</p>\n<p>Beneficial experience includes PostgreSQL, Python, Rust, Linux, TypeScript, Nix, frontend/backend web development, and data mining.</p>\n<p>Please include your updated resume when applying for this role.</p>\n<p><strong>Important:</strong> Only accept job offers from emails ending in @<a href=\"http://mixrank.com\" target=\"_blank\">mixrank.com</a><a href=\"http://mixrank.com/\" target=\"_blank\">. Offers fr</a>om any other email addresses are fraudulent. Do not share personal information with unverified senders.</p>\n","tags":"[\"postgres\",\"javascript\",\"typescript\",\"finance\",\"database\"]","pubDate":"2025-01-03T09:12:43.311Z","link":"https://www.ycombinator.com/companies/mixrank/jobs/RXQspen-software-engineer-remote-global","slug":"software-engineer-remote-global-mixrank-6262"},{"id":2296112771,"title":"Junior Software Engineer - Remote (Global)","company":"MixRank","image":"https://pbs.twimg.com/profile_images/378800000147745937/0fac42c12b433bbbd53ff3e15cd6fca4_400x400.png","description":"<p>At MixRank, we create B2B SaaS products that enable sales, marketing, finance, and business intelligence teams to accelerate their business with data and insights into their customers. One that provides the most comprehensive database of mobile apps and websites, technographics, companies, and decision makers. It's a platform created with the sole purpose of providing the fastest way for sales reps to build prospect lists, prioritize leads, and contact decision-makers.</p>\n<p>We're looking for remote engineers that have finished school within the last 2 years or will finish in the next 6 months. This is an open-ended entry-level role with mentorship, and diverse opportunities to work on all areas of our product: databases, distributed systems, infrastructure and tooling, data analysis, machine learning, frontend and backend web development, APIs, data mining, data modeling, and more.</p>\n<p>Our code base is very friendly to new contributors. You'll have a fully-functional development environment within hours (fully automated) and be pushing commits on your first day. Deployments to production happen multiple times per day and finish in less than 2 minutes. Effectively all of our codebase is written in Python, SQL, and Javascript/TypeScript. The core technologies you'll need familiarity with to be productive are Python, PostgreSQL, Linux, and Git.</p>\n<p>Why Join MixRank? Fully-remote, no HQ office. Team of 40 people across 15+ countries. Invested in by Y Combinator, 500 Startups, Mark Cuban. Profitable and growing 50% every year.</p>\n<p>Please include your updated resume when applying for this role.</p>\n<p><strong>Important:</strong> Only accept job offers from emails ending in @<a href=\"http://mixrank.com\" target=\"_blank\">mixrank.com</a>. Offers from any other email addresses are fraudulent. Do not share personal information with unverified senders.</p>\n","tags":"[\"postgres\",\"javascript\",\"typescript\",\"finance\",\"b2b\",\"database\"]","pubDate":"2025-01-03T09:12:43.311Z","link":"https://www.ycombinator.com/companies/mixrank/jobs/WdgITmW-junior-software-engineer-remote-global","slug":"junior-software-engineer-remote-global-mixrank-1359"},{"id":3528525135,"title":"Data Analyst - Payments & Fraud Prevention | Ruby Labs ","company":"Ruby Labs","image":"https://media.licdn.com/dms/image/v2/D4D0BAQF7VVv61POIFw/company-logo_200_200/company-logo_200_200/0/1721937953426?e=1743033600&v=beta&t=_qAkZ_qGO7Du2NSUdHDNbUKIbz28Y1HDm1g9mwNIOnk","description":"<h1><strong>About us</strong></h1><p style=\"min-height:1.5em\">Ruby Labs is a leading tech company that creates and operates innovative consumer products. We offer a diverse range of opportunities across the health, education, and entertainment industries. Our innovative teams are driving the future of consumer-led products, and we're always looking for passionate individuals to join us. Learn more about our story at: <a target=\"_blank\" rel=\"noopener noreferrer nofollow\" href=\"https://rubylabs.com/about-us/\">https://rubylabs.com/about-us/</a></p><p style=\"min-height:1.5em\"></p><h1><strong>About the role</strong></h1><p style=\"min-height:1.5em\">We're looking for a data-savvy risk analyst who lives and breathes payment metrics and loves turning complex data into actionable insights. You'll be our early warning system, monitoring fraud and dispute patterns across multiple merchant accounts while crafting recommendations that keep our risk metrics healthy. If you get excited about diving deep into data, spotting patterns, and preventing issues before they happen – we want to talk to you!</p><p style=\"min-height:1.5em\"></p><h1><strong>Key Responsibilities</strong></h1><ul style=\"min-height:1.5em\"><li><p style=\"min-height:1.5em\"> Monitor and analyze dispute and fraud metrics across multiple merchant accounts</p></li><li><p style=\"min-height:1.5em\"> Create and maintain comprehensive weekly risk reports for stakeholders</p></li><li><p style=\"min-height:1.5em\"> Perform deep-dive analyses into risk factors (countries, banks, BINs)</p></li><li><p style=\"min-height:1.5em\"> Track compliance with card scheme programs (VISA, Mastercard)</p></li><li><p style=\"min-height:1.5em\"> Identify emerging risk patterns and propose mitigation strategies</p></li><li><p style=\"min-height:1.5em\"> Generate and maintain risk monitoring dashboards</p></li><li><p style=\"min-height:1.5em\"> Provide data-driven recommendations for risk optimization</p></li><li><p style=\"min-height:1.5em\"> Collaborate with payment processors on risk management initiatives</p></li><li><p style=\"min-height:1.5em\"> Develop and implement early warning systems for risk metrics</p></li><li><p style=\"min-height:1.5em\"> Create and automate reporting workflows for efficient monitoring</p></li></ul><h1><strong>Qualifications</strong></h1><ul style=\"min-height:1.5em\"><li><p style=\"min-height:1.5em\"> 2+ years of experience in risk analysis, fraud prevention, or a similar role</p></li><li><p style=\"min-height:1.5em\"> Strong analytical skills with excellent attention to detail</p></li><li><p style=\"min-height:1.5em\"> Advanced Excel skills (pivot tables, complex formulas, data modeling)</p></li><li><p style=\"min-height:1.5em\"> Working knowledge of SQL for data querying and analysis</p></li><li><p style=\"min-height:1.5em\"> Experience with JSON data parsing and manipulation</p></li><li><p style=\"min-height:1.5em\"> Experience with data visualization and reporting</p></li><li><p style=\"min-height:1.5em\"> Ability to translate complex data into clear recommendations</p></li><li><p style=\"min-height:1.5em\"> Strong written and verbal communication skills</p></li><li><p style=\"min-height:1.5em\"> Experience working with multiple stakeholders</p></li><li><p style=\"min-height:1.5em\"> Proactive problem-solving approach</p></li></ul><p style=\"min-height:1.5em\"></p><h1><strong>Nice to have</strong></h1><ul style=\"min-height:1.5em\"><li><p style=\"min-height:1.5em\"> Understanding of payment processing and risk metrics</p></li><li><p style=\"min-height:1.5em\"> Experience with high-risk merchant accounts</p></li><li><p style=\"min-height:1.5em\"> Background in subscription-based business models</p></li><li><p style=\"min-height:1.5em\"> Knowledge of card scheme compliance programs</p></li><li><p style=\"min-height:1.5em\"> Experience with Tableau or similar BI tools</p></li><li><p style=\"min-height:1.5em\"> Familiarity with payment processors (Stripe, PayPal, etc.)</p></li><li><p style=\"min-height:1.5em\"> Understanding of payment orchestration platforms</p></li><li><p style=\"min-height:1.5em\"> Experience with fraud prevention tools (Ethoca, Verifi)</p></li></ul><p style=\"min-height:1.5em\"></p><h1><strong>Location</strong></h1><p style=\"min-height:1.5em\">Ruby Labs operates within the CET (Central European Time) zone. Applicants from any country are welcome to apply for the position as long as they are located within approximately ± 4 hours of CET. This ensures optimal collaboration and communication during working hours.</p><p style=\"min-height:1.5em\"></p><h1><strong>Benefits</strong></h1><p style=\"min-height:1.5em\">Discover the perks of being part of our vibrant team! We offer:</p><ul style=\"min-height:1.5em\"><li><p style=\"min-height:1.5em\"><strong>Remote Work Environment:</strong> Embrace the freedom to work from anywhere, anytime, promoting a healthy work-life balance. 🏡⏰</p></li><li><p style=\"min-height:1.5em\"><strong>Unlimited PTO:</strong> Enjoy unlimited paid time off to recharge and prioritize your well-being, without counting days. 🌴💼</p></li><li><p style=\"min-height:1.5em\"><strong>Paid National Holidays:</strong> Celebrate and relax on national holidays with paid time off to unwind and recharge. 🎉🌟</p></li><li><p style=\"min-height:1.5em\"><strong>Company-provided MacBook:</strong> Experience seamless productivity with top-notch Apple MacBooks provided to all employees who need them. 💻🚀</p></li><li><p style=\"min-height:1.5em\"><strong>Flexible Independent Contractor Agreement:</strong> Unlock the benefits of flexibility, autonomy, and entrepreneurial opportunities. Benefit from tax advantages, networking opportunities, reduced employment obligations, and the freedom to work from anywhere. Read more about it here: <a target=\"_blank\" rel=\"noopener noreferrer nofollow\" href=\"https://docs.google.com/document/d/1dHF4ctKlez75whdn-ybUwP5d5Wr0BdwVrorrm_fM40Q/preview\">https://docs.google.com/document/d/1dHF4ctKlez75whdn-ybUwP5d5Wr0BdwVrorrm_fM40Q/preview</a> 📈💼</p></li></ul><p style=\"min-height:1.5em\">Be part of our fast-growing team and seize this excellent opportunity for personal and professional growth!</p><p style=\"min-height:1.5em\"></p><h1><strong>Interview Process</strong></h1><p style=\"min-height:1.5em\">After submitting your application, we conduct a thorough review which typically takes 3 to 5 days, but may occasionally take longer due to the volume of applications received. If we see a potential fit, we proceed with the following steps:</p><ul style=\"min-height:1.5em\"><li><p style=\"min-height:1.5em\">Recruiter Screening (40 minutes)</p></li><li><p style=\"min-height:1.5em\">Technical Interview (90 minutes)</p></li><li><p style=\"min-height:1.5em\">Final Interview (60 minutes)</p></li></ul><p style=\"min-height:1.5em\"></p><h1><strong>Life at Ruby Labs</strong></h1><p style=\"min-height:1.5em\">At Ruby Labs, we are more than a team; we're a community united in pushing the boundaries of technology and innovation. Our combined passion fuels our ambition for excellence, driving impact that resonates around the globe.</p><p style=\"min-height:1.5em\">We are an equal-opportunity employer and celebrate diversity, recognizing that a diversity of thought and backgrounds builds stronger teams. We approach diversity and inclusion seriously and thoughtfully. We do not discriminate based on race, ethnicity, religion, color, place of birth, sex, gender identity or expression, sexual orientation, age, marital status, military service status, or disability status. Join us and be part of a company that is crafting the future of technology across multiple industries.</p><p style=\"min-height:1.5em\"></p><p style=\"min-height:1.5em\">#Li-Remote</p>","tags":"[\"management\"]","pubDate":"2025-01-02T15:54:52.546Z","link":"https://jobs.ashbyhq.com/ruby-labs/00019bbb-88c6-42d6-b03b-a40f0057744d","slug":"data-analyst-payments-fraud-prevention-ruby-labs-ruby-labs-7308"},{"id":2056966860,"title":"Accounts Payable Analyst","company":"Xapo Bank","image":"https://avatars.githubusercontent.com/u/6930305?s=200&v=4","description":"&lt;div class=&quot;content-intro&quot;&gt;&lt;p style=&quot;text-align: left;&quot;&gt;&lt;span style=&quot;font-weight: 900;&quot;&gt;Work from anywhere, impact everywhere&amp;nbsp;&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;Diversity is at the heart of who we are at Xapo Bank. We’re a fully distributed team of over 140 Xapiens that work remotely from 40+ countries around the world.&amp;nbsp;&lt;/p&gt;\n&lt;p&gt;Our beginning: A world that enjoys economic freedom and wealth protection, no matter where you live or who is running your country. This is the dream that drove Wences Casares, our Founder and Chairman, to quietly transform the world of banking.&lt;/p&gt;\n&lt;p&gt;To achieve that, we search the world for the best people for the job. We work hard, think globally, and inspire each other to learn and grow. We are committed to changing the way things are done.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Risk is inherent in all of our business activities and managing risk well is the responsibility of every Xapien. Sound risk management enables us to serve our customers and deliver value for our shareholders, and helps make Xapo a great place to work.&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&amp;nbsp;&lt;/p&gt;\n&lt;p style=&quot;text-align: left;&quot;&gt;&lt;em&gt;&lt;span style=&quot;font-weight: 500;&quot;&gt;Although we are headquartered in Gibraltar, this is a full time, 100% remote position&amp;nbsp;&lt;br&gt;&lt;/span&gt;&lt;/em&gt;&lt;em&gt;&lt;span style=&quot;font-weight: 500;&quot;&gt;Work from anywhere!&lt;/span&gt;&lt;/em&gt;&lt;/p&gt;\n&lt;p style=&quot;text-align: left;&quot;&gt;&amp;nbsp;&lt;/p&gt;&lt;/div&gt;&lt;p&gt;&lt;strong&gt;Responsibilities:&lt;/strong&gt;&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;Handled full cycle accounts payable processing invoices for various subsidiaries&lt;/li&gt;\n&lt;li&gt;Developed and maintained professional relationships with key vendors with an approachable and dedicated attitude to guarantee a high level of customer service.&lt;/li&gt;\n&lt;li&gt;Periodic sample audits of expense reports to ensure compliance with the company’s travel policy&lt;/li&gt;\n&lt;li&gt;Ensure that the expenses are booked in an accurate and timely manner. Taking into account the company audit and compliance requirements.&lt;/li&gt;\n&lt;li&gt;Executed set-up of new vendors and updating the existing ones by reflecting the accurate information&lt;/li&gt;\n&lt;li&gt;Actively participated in process improvements of the accounts payable function through the automation of the vendor, vendor bill, expense report approval process&lt;/li&gt;\n&lt;li&gt;Establish and maintain audit controls for the reconciliation of vendor bills and invoice&lt;/li&gt;\n&lt;li&gt;Proficient in the use of the Oracle + NetSuite ERP system&lt;/li&gt;\n&lt;li&gt;Assisted, researched, and resolved invoice and payment issues for internal employees and external vendors.&lt;/li&gt;\n&lt;li&gt;Managed weekly payment runs to ensure accuracy of payments.&lt;/li&gt;\n&lt;li&gt;Processed and managed all wire payments to international vendors as well as consultants and employee salary payments&lt;/li&gt;\n&lt;li&gt;Performed month-end closing activities by preparing monthly journal entries and assisted accounting staff with month end closing and year end closing analysis&lt;/li&gt;\n&lt;li&gt;Submitted various journal entries for account reconciliations and AP re-classes.&lt;/li&gt;\n&lt;li&gt;Managed the preparation and improvement of documentation of accounts payable operational activities including month-end procedures for internal and external audits&lt;/li&gt;\n&lt;li&gt;Participated in Netsuite enhancements by conducting User Acceptance Testing (UAT)&lt;/li&gt;\n&lt;li&gt;Resolved queries pertaining to accounts payable function with vendors and other departmental units&lt;/li&gt;\n&lt;li&gt;Assisted with annual audit by generating reports, collecting and consolidating information invoice information.&lt;/li&gt;\n&lt;li&gt;Processing invoices and issuing payments in a timely and accurate manner.&lt;/li&gt;\n&lt;li&gt;Dealing with internal and external queries related to invoice processing and payment.&lt;/li&gt;\n&lt;li&gt;Troubleshoot issues with payments as required.&lt;/li&gt;\n&lt;li&gt;Obtain proper information and/or data regarding invoice payments.&lt;/li&gt;\n&lt;li&gt;Review invoices prior to issuing payment to ensure compliance without internal requirements.&lt;/li&gt;\n&lt;li&gt;Assist in the production of financial statements and applications, preparation of spreadsheets, reports, and correspondence as required.&lt;/li&gt;\n&lt;li&gt;Reconcile bank statements on a monthly basis.&lt;/li&gt;\n&lt;li&gt;Maintain financial records and databases.&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;&lt;strong&gt;&amp;nbsp;&amp;nbsp;Job Requirement:&lt;/strong&gt;&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;&amp;nbsp;2+ years of accounts payable experience.&lt;/li&gt;\n&lt;li&gt;&amp;nbsp;Previous working experience with PO invoices, corporate credit cards, payroll in a multinational environment&lt;/li&gt;\n&lt;/ul&gt;\n&lt;ul&gt;\n&lt;li&gt;&amp;nbsp;Good knowledge of NetSuite or similar systems such as Oracle or SAP&lt;/li&gt;\n&lt;li&gt;&amp;nbsp;Able to work autonomously and take ownership with little supervision&lt;/li&gt;\n&lt;li&gt;&amp;nbsp;Analytical and detail-oriented mindset&lt;/li&gt;\n&lt;li&gt;&amp;nbsp;Proactiveness and focus on process improvement&lt;/li&gt;\n&lt;li&gt;&amp;nbsp;Excellent command of Excel/Google Sheets&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;OTHER REQUIREMENTS&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;&amp;nbsp;A dedicated workspace.&lt;/li&gt;\n&lt;li&gt;&amp;nbsp;A reliable internet connection with the fastest speed possible in your area&lt;/li&gt;\n&lt;li&gt;&amp;nbsp;Devices and other essential equipment that meet minimal technical specifications.&lt;/li&gt;\n&lt;li&gt;&amp;nbsp;Alignment with Our Values.&lt;/li&gt;\n&lt;/ul&gt;&lt;div class=&quot;content-conclusion&quot;&gt;&lt;p&gt;&lt;span style=&quot;font-size: 12pt;&quot;&gt;&lt;strong&gt;Why work for Xapo?&lt;/strong&gt;&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span style=&quot;font-weight: 500; font-size: 10pt;&quot;&gt;IMPACT GLOBALLY, WORK REMOTELY.&lt;/span&gt;&lt;/p&gt;\n&lt;ul&gt;\n&lt;li style=&quot;font-weight: 500;&quot;&gt;&lt;strong&gt;Shape the Future:&lt;/strong&gt;&lt;span style=&quot;font-weight: 500;&quot;&gt; Improve lives through cutting-edge technology, work 100% remotely from anywhere in the world.&lt;/span&gt;&lt;/li&gt;\n&lt;li style=&quot;font-weight: 500;&quot;&gt;&lt;strong&gt;Great work-life balance:&lt;/strong&gt;&lt;span style=&quot;font-weight: 500;&quot;&gt; &lt;/span&gt;&lt;span style=&quot;font-weight: 500;&quot;&gt;Build amazing things with a balance of autonomy and collaborative teamwork. Set your own work schedule and make use of a flexible PTO plan when you need to recharge.&lt;/span&gt;&lt;span style=&quot;font-weight: 500;&quot;&gt;&amp;nbsp;&lt;/span&gt;&lt;/li&gt;\n&lt;li style=&quot;font-weight: 500;&quot;&gt;&lt;strong&gt;Expect Excellence:&lt;/strong&gt;&lt;span style=&quot;font-weight: 500;&quot;&gt; Collaborate, learn, and grow with a high-performance team. Learn&lt;/span&gt;&lt;span style=&quot;font-weight: 500;&quot;&gt; how you learn best - from books to conferences, you’ll get a yearly budget for your individual learning and development goals.&lt;/span&gt;&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;&lt;strong&gt;At Xapo, we prioritize consumer protection and adhere to regulatory requirements by ensuring that all Xapiens are accountable for upholding principles of fair treatment, transparency, and ethical conduct in their interactions with customers and stakeholders.&lt;/strong&gt;&lt;/p&gt;&lt;/div&gt;","tags":"[\"management\",\"database\"]","pubDate":"2025-01-02T12:51:09.000Z","link":"https://job-boards.greenhouse.io/xapo61/jobs/6300305003","slug":"accounts-payable-analyst-xapo-bank-4353"},{"id":5069187268,"title":"Junior Accountant | Ruby Labs","company":"Ruby Labs","image":"https://media.licdn.com/dms/image/v2/D4D0BAQF7VVv61POIFw/company-logo_200_200/company-logo_200_200/0/1721937953426?e=1743033600&v=beta&t=_qAkZ_qGO7Du2NSUdHDNbUKIbz28Y1HDm1g9mwNIOnk","description":"<p style=\"min-height:1.5em\"></p><div style=\"text-align:center\"><img style=\"max-width:100%\" src=\"https://app.ashbyhq.com/api/images/user-content/49307af8-ad4e-48bf-ab90-4953176fd044/227f800c-4c16-4a97-b4a6-a110a2a90538/image.png\" width=\"600\" /></div><h1><br /><strong>About us</strong></h1><p style=\"min-height:1.5em\">Ruby Labs is a leading tech company that creates and operates innovative consumer products. We offer a diverse range of opportunities across the health, education, and entertainment industries. Our innovative teams are driving the future of consumer-led products, and we're always looking for passionate individuals to join us. Learn more about our story at: <a target=\"_blank\" rel=\"noopener noreferrer nofollow\" href=\"https://rubylabs.com/about-us/\">https://rubylabs.com/about-us/</a></p><p style=\"min-height:1.5em\"></p><h1><strong>About the role</strong></h1><p style=\"min-height:1.5em\">We are looking for a Junior Accountant who will be responsible for day-to-day accounting, monthly close, and assisting the team with ad-hoc projects.</p><p style=\"min-height:1.5em\"></p><h1><strong>Key Responsibilities</strong></h1><ul style=\"min-height:1.5em\"><li><p style=\"min-height:1.5em\">Post and process journal entries to ensure all business transactions are recorded</p></li><li><p style=\"min-height:1.5em\">Record day-to-day financial transactions and perform reconciliations</p></li><li><p style=\"min-height:1.5em\">Enter data and maintain records</p></li><li><p style=\"min-height:1.5em\">Perform other tasks to assist the team such as processing payments, reviewing expenses, and processing invoices</p></li><li><p style=\"min-height:1.5em\">Assist the Supervisor Accountant in the preparation of monthly closings</p></li><li><p style=\"min-height:1.5em\">Perform other job-related duties as assigned</p></li></ul><h1><strong>Qualifications</strong></h1><ul style=\"min-height:1.5em\"><li><p style=\"min-height:1.5em\">Bachelor's degree in Accounting &amp; Finance or similar</p></li><li><p style=\"min-height:1.5em\">1-3 years of experience</p></li><li><p style=\"min-height:1.5em\">Knowledge of accounting principles and practices</p></li><li><p style=\"min-height:1.5em\">Excel / Google Sheets knowledge</p></li><li><p style=\"min-height:1.5em\">Analytical thinking skills and attention to detail</p></li><li><p style=\"min-height:1.5em\">Ability to work well in a remote setting</p></li></ul><h1><strong>Nice to have</strong></h1><ul style=\"min-height:1.5em\"><li><p style=\"min-height:1.5em\">Experience with Sage Intacct</p></li></ul><h1><strong>Location</strong></h1><p style=\"min-height:1.5em\">Ruby Labs operates within the CET (Central European Time) zone. Applicants from any country are welcome to apply for the position as long as they are located within approximately ± 4 hours of CET. This ensures optimal collaboration and communication during working hours.</p><p style=\"min-height:1.5em\"></p><h1><strong>Benefits</strong></h1><p style=\"min-height:1.5em\">Discover the perks of being part of our vibrant team! We offer:</p><ul style=\"min-height:1.5em\"><li><p style=\"min-height:1.5em\"><strong>Remote Work Environment:</strong> Embrace the freedom to work from anywhere, anytime, promoting a healthy work-life balance. 🏡⏰</p></li><li><p style=\"min-height:1.5em\"><strong>Unlimited PTO:</strong> Enjoy unlimited paid time off to recharge and prioritize your well-being, without counting days. 🌴💼</p></li><li><p style=\"min-height:1.5em\"><strong>Paid National Holidays:</strong> Celebrate and relax on national holidays with paid time off to unwind and recharge. 🎉🌟</p></li><li><p style=\"min-height:1.5em\"><strong>Company-provided MacBook:</strong> Experience seamless productivity with top-notch Apple MacBooks provided to all employees who need them. 💻🚀</p></li><li><p style=\"min-height:1.5em\"><strong>Flexible Independent Contractor Agreement:</strong> Unlock the benefits of flexibility, autonomy, and entrepreneurial opportunities. Benefit from tax advantages, networking opportunities, reduced employment obligations, and the freedom to work from anywhere. Read more about it here: <a target=\"_blank\" rel=\"noopener noreferrer nofollow\" href=\"https://docs.google.com/document/d/1dHF4ctKlez75whdn-ybUwP5d5Wr0BdwVrorrm_fM40Q/preview\">https://docs.google.com/document/d/1dHF4ctKlez75whdn-ybUwP5d5Wr0BdwVrorrm_fM40Q/preview</a> 📈💼</p></li></ul><p style=\"min-height:1.5em\">Be part of our fast-growing team and seize this excellent opportunity for personal and professional growth!</p><p style=\"min-height:1.5em\"></p><h1><strong>Interview Process</strong></h1><p style=\"min-height:1.5em\">After submitting your application, we conduct a thorough review which typically takes 3 to 5 days, but may occasionally take longer due to the volume of applications received. If we see a potential fit, we proceed with the following steps:</p><ul style=\"min-height:1.5em\"><li><p style=\"min-height:1.5em\">Recruiter Screening (40 minutes)</p></li><li><p style=\"min-height:1.5em\">Technical Interview (60 minutes)</p></li><li><p style=\"min-height:1.5em\">Final Interview (30 minutes)</p></li></ul><p style=\"min-height:1.5em\"></p><h1><strong>Life at Ruby Labs</strong></h1><p style=\"min-height:1.5em\">At Ruby Labs, we are more than a team; we're a community united in pushing the boundaries of technology and innovation. Our combined passion fuels our ambition for excellence, driving impact that resonates around the globe.</p><p style=\"min-height:1.5em\">We are an equal-opportunity employer and celebrate diversity, recognizing that a diversity of thought and backgrounds builds stronger teams. We approach diversity and inclusion seriously and thoughtfully. We do not discriminate based on race, ethnicity, religion, color, place of birth, sex, gender identity or expression, sexual orientation, age, marital status, military service status, or disability status. Join us and be part of a company that is crafting the future of technology across multiple industries.</p><p style=\"min-height:1.5em\"></p><p style=\"min-height:1.5em\">#Li-Remote</p>","tags":"[\"finance\"]","pubDate":"2025-01-02T09:51:13.843Z","link":"https://jobs.ashbyhq.com/ruby-labs/9d42a39c-c241-4b47-a62b-158a01791cf6","slug":"junior-accountant-ruby-labs-ruby-labs-377"},{"id":9757896095,"title":"Engineering Manager - Feature Engineering","company":"Wikimedia","image":"https://remotive.com/job/1959693/logo","description":"<p><strong>Engineering Manager, Feature Engineering</strong></p>\n<p><strong>Summary</strong></p>\n<p>The Wikimedia Foundation is looking for an engineering manager to join the Feature Engineering department, reporting to Nat Baca, the Director of Engineering, Reading Experiences. Within Feature Engineering, we work to improve the user experience for the readers and contributors of Wikimedia sites. Our readers are responsible for 25 Billion monthly page views, from up to 2 Billion unique devices. The Feature Engineering team also supports new and experienced volunteers working in 300+ languages with the tools they need to keep Wikipedia accurate and up to date on the contributors side. </p>\n<p>As an engineering manager working in this area, you will be responsible for supporting and driving the team’s efforts to enhance the user experience across Wikimedia sites, helping to evolve our engineering strategy, hiring new headcount, and identifying and working with future audiences. You will collaborate with cross-functional partners, manage technical initiatives, and ensure the successful delivery of key projects that impact billions of users worldwide. This position will focus on building a healthy team culture, coaching and growing engineers, and fostering partnerships with other disciplines.</p>\n<p><strong>You are responsible for:</strong></p>\n<ul style=\"\">\n<li style=\"\">Collaborating with your team and cross-functional stakeholders to plan, prioritize, and delegate work, balancing project goals with technical requirements and team skillsets.</li>\n<li style=\"\">Driving execution–ensuring projects are on track, key performance metrics are being met, and work is being actively unblocked.</li>\n<li style=\"\">Communicating proactively on progress, risks, and outcomes to stakeholders.</li>\n<li style=\"\">Ensuring the engineering team is engaged and productive, and understands the big picture of the project and how their efforts contribute to it.</li>\n<li style=\"\">Coaching your team, conducting performance reviews, providing career guidance, and building a professional and inclusive work culture.</li>\n<li style=\"\">Managing risk and succession planning for the project, documenting and implementing lifecycle management and best practices for the software we build.</li>\n<li style=\"\">Interviewing, hiring, onboarding, and mentoring engineers with the goal of quickly making them productive and engaged members of your team.</li>\n<li style=\"\">Participating in strategic direction-setting, team formation, and staffing allocation</li>\n</ul>\n<p><strong>Skills and Experience:</strong></p>\n<ul style=\"\">\n<li style=\"\">3-5 years of experience as an engineering manager or equivalent experience</li>\n<li style=\"\">Technical expertise in fullstack web development</li>\n<li style=\"\">Experience working with engineering teams with a focus on building user-facing web applications and services.</li>\n<li style=\"\">An established track record and prior success in working with a multicultural, distributed team.</li>\n<li style=\"\">Excellent written and verbal communication skills in English.</li>\n<li style=\"\">Excellent interpersonal skills–the ability to interact constructively and develop productive working relationships with management, peers, direct reports, and communities, including non-technical staff.</li>\n<li style=\"\">Experience with open source development methodologies and open source community.</li>\n<li style=\"\">Robust analytical, problem-solving, and conceptual skills with the ability to deliver on detail as well as strategy.</li>\n<li style=\"\">Must be comfortable with evolving requirements and priorities in a dynamic environment.</li>\n</ul>\n<p><strong>Qualities that are important to us:</strong></p>\n<ul style=\"\">\n<li style=\"\">Experience with remote work and the level of engagement and communication it takes to build a geographically distributed team that is functional and healthy</li>\n<li style=\"\">Experience with large-scale, global developer ecosystems and platforms and managing the risks and opportunities associated with them.</li>\n<li style=\"\">Alignment with our mission and values.</li>\n<li style=\"\">Resilience—we work on new and interesting problems in public and collaborative ways.</li>\n<li style=\"\">Working together for outcomes, and being willing to change course.</li>\n<li style=\"\">Sharing a culture of constructive criticism and respect.</li>\n</ul>\n<p><strong>Additionally, we’d love it if you have:</strong></p>\n<ul style=\"\">\n<li style=\"\">Experience editing Wikipedia or with the Wikipedia, Wikidata, or Wikimedia Commons communities or other collaborative enterprises.</li>\n<li style=\"\">Familiarity with MediaWiki.</li>\n<li style=\"\">Experience supporting and leading teams developing Web-scale deployments in javascript and PHP.</li>\n</ul>\n<div class=\"h4\">About the Wikimedia Foundation</div>\n<p>The Wikimedia Foundation is the nonprofit organization that operates Wikipedia and the other Wikimedia free knowledge projects. Our vision is a world in which every single human can freely share in the sum of all knowledge. We believe that everyone has the potential to contribute something to our shared knowledge, and that everyone should be able to access that knowledge freely. We host Wikipedia and the Wikimedia projects, build software experiences for reading, contributing, and sharing Wikimedia content, support the volunteer communities and partners who make Wikimedia possible, and advocate for policies that enable Wikimedia and free knowledge to thrive. </p>\n<p>The Wikimedia Foundation is a charitable, not-for-profit organization that relies on donations. We receive donations from millions of individuals around the world, with an average donation of about $15. We also receive donations through institutional grants and gifts. The Wikimedia Foundation is a United States 501(c)(3) tax-exempt organization with offices in San Francisco, California, USA.</p>\n<p><em><strong>As an equal opportunity employer, the Wikimedia Foundation values having a diverse workforce and continuously strives to maintain an inclusive and equitable workplace. We encourage people with a diverse range of backgrounds to apply. We do not discriminate against any person based upon their race, traits historically associated with race, religion, color, national origin, sex, pregnancy or related medical conditions, parental status, sexual orientation, gender identity, gender expression, age, status as a protected veteran, status as an individual with a disability, genetic information, or any other legally protected characteristics.</strong></em></p>\n<p>The Wikimedia Foundation is a remote-first organization with staff members including contractors based 40+ countries<strong>*</strong>. Salaries at the Wikimedia Foundation are set in a way that is competitive, equitable, and consistent with our values and culture. The anticipated annual pay range of this position for applicants based within the United States is US$127,714 to US$200,943 with multiple individualized factors, including cost of living in the location, being the determinants of the offered pay. For applicants located outside of the US, the pay range will be adjusted to the country of hire. We neither ask for nor take into consideration the salary history of applicants. The compensation for a successful applicant will be based on their skills, experience and location. </p>\n<p><strong>*Please note that we are currently able to hire in the following countries: </strong>Australia, Austria, Bangladesh, Belgium, Brazil, Canada, Colombia, Costa Rica, Croatia, Czech Republic, Denmark, Egypt, Estonia, Finland, France, Germany, Ghana, Greece, India, Indonesia, Ireland, Israel, Italy, Kenya, Mexico, Netherlands, Nigeria, Peru, Poland, Singapore, South Africa, Spain, Sweden, Switzerland, Uganda, United Arab Emirates, United Kingdom, United States of America and Uruguay.  Our non-US employees are hired through a local third party Employer of Record (EOR). </p>\n<p>We periodically review this list to streamline to ensure alignment with our hiring requirements. </p>\n<p>All applicants can reach out to their recruiter to understand more about the specific pay range for their location during the interview process.</p>\n<p><em><strong>If you are a qualified applicant requiring assistance or an accommodation to complete any step of the application process due to a disability, you may contact us at recruiting@wikimedia.org or +1 (415) 839-6885.</strong></em></p>\n<p><strong>More information</strong></p>\n<p><a href=\"%22https:/wikimediafoundation.org/about/jobs/#section-12%22\" rel=\"nofollow\"><strong>U.S. Benefits &amp; Perks</strong></a></p>\n<p><a href=\"%22https:/foundation.wikimedia.org/wiki/Applicant_privacy_policy%22\" rel=\"nofollow\"><strong>Applicant Privacy Policy</strong></a></p>\n<p><a href=\"%22https:/wikimediafoundation.org/%22\" rel=\"nofollow\"><strong>Wikimedia Foundation</strong></a></p>\n<p><a href=\"%22https:/www.youtube.com/watch?v=8mvPYF_erNA&amp;list=PLVx9pX-VnGVh9Akb-O-SAKZ-GDTVTHZqS&amp;index=8%22\" rel=\"nofollow\"><strong>What does the Wikimedia Foundation do?</strong></a></p>\n<p><a href=\"%22https:/www.youtube.com/watch?v=7gATwhhGrPk&amp;list=PLVx9pX-VnGVh9Akb-O-SAKZ-GDTVTHZqS&amp;index=1%22\" rel=\"nofollow\"><strong>What makes Wikipedia different from social media platforms?</strong></a></p>\n<p><a href=\"%22https:/wikimediafoundation.org/wiki/Our_projects%22\" rel=\"nofollow\"><strong>Our Projects</strong></a></p>\n<p><a href=\"%22https:/techblog.wikimedia.org/%22\" rel=\"nofollow\"><strong>Our Tech Stack</strong></a></p>\n<p><a href=\"%22https:/wikimediafoundation.org/news/%22\" rel=\"nofollow\"><strong>News from across the Wikimedia movement</strong></a></p>\n<p><a href=\"%22https:/diff.wikimedia.org/%22\" rel=\"nofollow\"><strong>Wikimedia Blog</strong></a></p>\n<p><a href=\"%22https:/meta.wikimedia.org/wiki/Strategy/Wikimedia_movement/2017%22\" rel=\"nofollow\"><strong>Wikimedia 2030</strong></a></p>\n<p> </p>\n<div id='\"l-content\"'> </div>\n<img src=\"https://remotive.com/job/track/1959693/blank.gif?source=public_api\" alt=\"\"/>","tags":"[\"engineering management\"]","pubDate":"2025-01-02T07:50:44.000Z","link":"https://remotive.com/remote-jobs/software-dev/engineering-manager-feature-engineering-1959693","slug":"engineering-manager-feature-engineering-wikimedia-593"},{"id":1476432090,"title":"Growth Manager","company":"Awesome Motive","image":"https://avatars.githubusercontent.com/u/8514352?s=200&v=4","description":"<p>Are you a data-driven change agent who can weave user insights into compelling campaigns and drive measurable growth? If leading growth initiatives to drive business impact excite you, let's connect!</p><p>We are Awesome Motive, the company behind popular web apps and business tools like All in One SEO (AIOSEO), OptinMonster, MonsterInsights, WPForms, and many others. Over 25 million websites use our tools to get more traffic, subscribers, and sales. We're passionate about helping Small Businesses Grow &amp; Compete with the Big Guys, and we believe marketing plays a crucial role in delivering on that promise.</p><p>This is your chance to join a dynamic team and lead strategic initiatives across marketing channels to acquire, engage, and retain users. You'll wear many hats – strategist, analyst, campaign champion – all aimed at one goal: accelerating our growth to reach more small businesses.</p><p>💡 <strong>Interested in applying?</strong></p><p>🔍 <strong>Please read/follow the next steps outlined in \"How to Apply\" at the bottom of this listing. </strong></p><p><em>Attention to detail is one of our </em><a href=\"https://awesomemotive.com/core-values/\" target=\"_blank\" rel=\"nofollow noreferrer noopener\" class=\"external\">core values</a><em>! This is your chance to stand out :) </em></p><h3>To love this role, here’s the type of person you are:</h3><ul> <li>You can leverage imperfect data to create and execute winning digital marketing campaigns and funnels.</li> <li>You’re extremely self-driven and curious to find creative answers to complex questions.</li> <li>You’re comfortable seeing the big picture and how the small details get you there.</li> <li>You love to create systems, tools, and processes for others where they don’t already exist.</li> <li>You have a passion for digital marketing and customer acquisition.</li> </ul><h3>Common responsibilities include (but are not limited to):</h3><ul> <li>Utilize Content Marketing, Email and SMS Marketing, Pay Per Click, Sponsorships, Affiliates and Partnerships, Social Media, and Freemium Software to grow new sales.</li> <li>Strategize, plan, and implement both long and short-term processes to meet targets, emphasizing priorities in process development and documentation.</li> <li>Facilitate data-driven decision-making by collecting, analyzing, interpreting, and visualizing data, providing actionable insights, and promoting data literacy within the organization.</li> <li>Directly manage a team of growth professionals, including independently making decisions to ensure team performance &amp; cohesion.</li> <li>Design and implement website A/B tests to improve conversion rates and funnel performance.</li> <li>Conceptualize and build new targeted landing pages for various channels and users.</li> <li>Provide conversion-focused copywriting feedback and suggestions for newsletters, customer-facing websites, our apps and plugins, and ad copy.</li> <li>Strategize and execute high-visibility promotions across all digital marketing channels.</li> <li>Research competitor's UI/UX trends and work with the team to articulate new features/ideas to help us remain competitive.</li> <li>Control qualified traffic to our website by designing and executing strategies to improve our search engine rankings.</li> <li>Develop and execute an outbound marketing strategy to complement our existing inbound strengths.</li> <li>Maintain in-depth familiarity with growth-related procedures and workflows.</li> <li>Respond promptly to growth team members' queries and escalations.</li> <li>Uphold and promote the core values of Awesome Motive.</li> <li>Conduct research before escalating issues and proactively identify trends and process improvements.</li> <li>Provide oversight for PPC campaigns, PPC keyword research, and program ROAS.</li> <li>Provide oversight for Affiliate Marketing and Partnerships.</li> <li>Directly supervise the work of content marketing team members.</li> <li>Assist in crafting better internal processes and systems by documenting the work of the Growth team.</li> </ul><p><strong>Requirements</strong></p><ul> <li>Relevant experience:&nbsp; With over 4 years of experience in growth marketing for product-led/ freemium SaaS, ideally in the B2B/SMB space, you have achieved direct business growth impact through successful growth initiatives.</li> <li>SEO &amp; Content Marketing: You are well-versed in best practices for SEO in marketing site content, including blog posts. You are fluent in other commonly used tools such as Semrush, Clearscope, and Ahrefs.</li> <li>Copywriting: You have strong personal experience with copywriting, as well as leading and reviewing the work of copywriters. Your expertise in hiring and managing copywriters will be invaluable.</li> <li>Email Marketing: You can demonstrate and teach best practices within email marketing, from crafting individual emails to creating complete targeted campaigns and evaluating effectiveness to drive improvement over time. You must have personally written and iterated upon multiple email campaigns for SaaS products.</li> <li>CRO / Funnels / Testing &amp; Optimization: You must have expertise in best practices for SaaS products. Knowledge and experience in pricing page tests, countdown timers, popups, etc, is required.</li> <li>PPC / Paid Advertising: You have experience in Google Ads, Facebook Ads, and Google Search Console for PPC</li> <li>Affiliates &amp; Partnerships: You know how to build and maintain partnership relationships. You have managed an affiliate program.</li> <li>Data &amp; Analytics: You are experienced in using GA (preferably GA4), and digital marketing channels.   </li> </ul><p><strong>Bonus points if you also have:</strong></p><ul> <li>You have experience working in the admin area of self-hosted WordPress sites as a site owner/developer/etc.</li> <li>You have experience with support specifically for WordPress.</li> <li>You have trained managers and had managers as direct reports.</li> </ul><p><strong>Benefits</strong></p><p>Working for a fast-growing bootstrapped company is a rare opportunity, one we consider a lifestyle choice rather than a job choice. Our positions are challenging, but also come with amazing advantages and fulfillment to those who earn them. Here’s what we offer.</p><ul> <li>Competitive Salary.</li> <li>Term Life Insurance and Accidental Death &amp; Dismemberment for all full-time team members during their employment.</li> <li>Health, Dental, and Vision Insurance benefits for full-time U.S. employees.</li> <li>Health Insurance benefits for all employees in India, Pakistan, Brazil, Philippines, Ukraine, Poland, Romania, Nepal, Kenya, Mexico, Nigeria, Spain &amp; Jamaica.</li> <li>Work from your home. We’re spread out all over the world – United States, Canada, Ukraine, India, Pakistan, Singapore, and more.</li> <li>Flexible PTO after 90 days of employment. We encourage employees to take the time they need for a vacation, stay healthy, and spend time with friends and family.</li> <li>Holidays (based on your location).</li> <li>Paid Parental Leave.</li> <li>We happily provide or reimburse software you’ll need as well as books or courses that promote continued learning.</li> <li>We cover all costs of company travel (including our annual all-company retreat and mini-team meetups).</li> <li>Additional Perks include AM Welcome Box for new team members, Yearly Anniversary Gifts, and Technology Stipend each work anniversary.</li> <li>We give you the opportunity to solve challenging and meaningful problems that make a difference.</li> <li>Ability to work with some of the best people in the business through frequent, if not daily, interactions.</li> <li>And in case you were wondering: no politics, no b.s., and no jerks.</li> </ul><p><strong>Location </strong>This is a remote position - our team is spread around the globe! Our home base is in Florida, USA, so company operating hours are 9am - 5pm ET (UTC -5). While full coverage is not a requirement, you must be available for a portion of the day.</p><p><strong>Inclusion Statement </strong>At Awesome Motive, we strive to have the broadest possible view of diversity, going beyond visible differences to include the background, experiences, skills, and perspectives that make each person unique. Awesome Motive is proud to be an equal opportunity workplace and is committed to equal employment opportunity regardless of race, color, ancestry, religion, sex, national origin, sexual orientation, age, citizenship, marital status, disability, gender identity, veteran status, or any other basis protected by federal, state, or local law.</p><p><strong>How to apply? </strong>If all of this sounds interesting, then please submit your application!</p><p><strong>Please clearly include the following in your cover letter:</strong></p><ul> <li>Do you have experience in creating revenue impact through marketing?</li> <li>Do you have experience in directly managing teams?</li> <li>Do you have a minimum of 3 years of experience in SaaS marketing?</li> <li>What is your proficiency level (from 1 to 5, 5 highest) in programmatic SEO? Share an example of the impact created.</li> <li>What is your proficiency in GA4? </li> </ul><p>Also note, don't forget to proofread before submitting. Check spelling, capitalization, etc. This is your chance to make your application stand out :)</p><p>We won’t be able to individually respond to all applications, but if we feel you’re a strong match, someone will be in touch shortly. </p><p><strong>Thanks and we look forward to hearing from you!</strong></p>","tags":"[\"b2b\"]","pubDate":"2025-01-02T00:00:00.000Z","link":"https://apply.workable.com/j/948D68E0D8","slug":"growth-manager-awesome-motive-4336"},{"id":9488006615,"title":"QA Automation Engineer","company":"Awesome Motive","image":"https://avatars.githubusercontent.com/u/8514352?s=200&v=4","description":"<p>As a QA Automation Engineer at Awesome Motive, you’ll join the WPForms team, where you will collaborate with awesome team members and tackle a wide range of responsibilities.</p><p>We are looking for an Automation Quality Assurance Engineer to help us test the Software, all the plugins, and its add-ons by ensuring that everything works as expected and according to our documentation.</p><p>This role plays an important part in our company’s product development process. Our ideal candidate will be responsible for writing and maintaining end-to-end tests to ensure software runs smoothly and meets client and internal needs. Ultimately, you should have the experience to monitor all stages of software development to identify and resolve system malfunctions to meet quality standards.</p><p></p><p>💡 <strong>Interested in applying?</strong></p><p>🔍 <strong>Please read/follow the next steps outlined in \"How to Apply\" at the bottom of this listing.<br></strong></p><p><em>Attention to detail is one of our </em><a href=\"https://awesomemotive.com/career/\" rel=\"nofollow noreferrer noopener\" class=\"external\">core values</a><em>! This is your chance to stand out :)<br></em></p><h3>To love this role, here’s the type of person you are:</h3><ul> <li>You’re a self-starter who loves taking the initiative and seeing things through from conception to completion.</li> <li>You’re an excellent communicator, fluent in both verbal and written English, who makes sure nothing slips through the cracks. We believe communication is critical, and there is no such thing as over-communicating.</li> <li>You take pride in the quality and craftsmanship of your work rather than just doing it to get it done - with attention to detail.</li> <li>You love mentoring your peers and helping them “level up” just as much as testing code.</li> <li>You are comfortable giving critical feedback to peers (respectfully and productively) and don’t take the feedback personally.</li> <li>You’re happy working on tasks of all sizes.<br> </li> </ul><h3>Common responsibilities include (but are not limited to):</h3><ul> <li>Review requirements, specifications, and technical design documents to provide timely and meaningful feedback.</li> <li>Produce thorough, stable and clean tests conforming to our standards.</li> <li>Maintain our suite of tests.</li> <li>Identify, record, document thoroughly, and track bugs.</li> <li>Extend our documentation.</li> <li>Liaise with internal teams to identify system requirements and improve development procedures.</li> </ul><p><strong>Requirements</strong></p><ul> <li>Proven work experience in web-software quality assurance, 3+ years.</li> <li>Experience with automated browser testing frameworks, 2+ years.</li> <li>Solid Experience with WordPress.</li> <li>Strong knowledge of QA methodologies, tools, and processes</li> <li>Good knowledge of software development methodology and software lifecycle processes</li> <li>Ability to keep complex ideas and features simple. (Simplicity is a core value!)</li> <li>Experience in writing clear, concise, and comprehensive test plans and test cases.</li> <li>Experience in automation and manual testing and can integrate manual with automation.</li> <li>Experience with Git and working with different branches.</li> <li>Experience in writing code or tests with PHP.</li> <li>Experience with testing APIs.</li> <li>Testing 3rd-party integrations (payment and marketing providers)</li> <li>English at the upper intermediate level or higher</li> <li>Personal Computer with Internet Access</li> <li>Availability to participate in audio/video meetings between 9am and 5 pm ET.<br><br> </li> </ul><p><strong>Bonus points if you also have:</strong></p><ul> <li>Experience with Codeception.</li> <li>Experience with Continuous Integration (preferably GitHub Actions).</li> <li>Experience with performance and/or security testing.</li> <li>Knowledge and practical experience with MySQL and database structure.</li> <li>ISTQB certificate.</li> <li>Previous remote work experience.</li> </ul><p><strong>Benefits</strong></p><p>Working for a fast-growing bootstrapped company is a rare opportunity, one we consider a lifestyle choice rather than a job choice. Our positions are challenging, but also come with amazing advantages and fulfillment for those who earn them. Here’s what we offer.</p><ul> <li>Competitive Salary.</li> <li>Term Life Insurance and Accidental Death &amp; Dismemberment for all full-time team members during their employment.</li> <li>Health, Dental, and Vision Insurance benefits for full-time U.S. employees.</li> <li>Health Insurance benefits for all employees in India, Pakistan, Brazil, Philippines, Ukraine, Poland, Romania, Nepal, Kenya, Mexico, Nigeria, Spain &amp; Jamaica.</li> <li>Work from your home. We’re spread out all over the world – United States, Canada, Ukraine, India, Pakistan, Singapore, and more.</li> <li>Flexible PTO after 90 days of employment. We encourage employees to take the time they need for a vacation, stay healthy, and spend time with friends and family.</li> <li>Holidays (based on your location)</li> <li>Paid maternity and paternity leave.</li> <li>We happily provide or reimburse software you’ll need as well as books or courses that promote continued learning.</li> <li>We cover all costs of company travel (including our annual all-company retreat and mini-team meetups).</li> <li>Additional Perks include AM Welcome Box for new team members, Yearly Anniversary Gifts, and Technology Stipend each work anniversary.</li> <li>We give you the opportunity to solve challenging and meaningful problems that make a difference.</li> <li>Ability to work with some of the best people in the business through frequent, if not daily, interactions.</li> <li>And in case you were wondering: no politics, no b.s., and no jerks.</li> </ul><p><strong>Location<br></strong>This is a remote position - our team is spread around the globe! Our home base is in Florida, USA, so company operating hours are 9am - 5pm ET (UTC -5). While full coverage is not a requirement, you must be available during a portion of the day.</p><p><strong>Inclusion Statement<br></strong>At Awesome Motive, we strive to have the broadest possible view of diversity, going beyond visible differences to include the background, experiences, skills, and perspectives that make each person unique. Awesome Motive is proud to be an equal opportunity workplace and is committed to equal employment opportunity regardless of race, color, ancestry, religion, sex, national origin, sexual orientation, age, citizenship, marital status, disability, gender identity, veteran status, or any other basis protected by federal, state, or local law.</p><p><strong>How to apply?<br></strong>If all of this sounds interesting, then please submit your application!</p><p><strong>Please clearly include the following in your cover letter:</strong></p><ul> <li>What type of projects have you worked on?</li> <li>What kind of testing have you done?</li> <li>Which bug took you the most time to identify and replicate?</li> <li>Tell us a bit about yourself and why you should be considered the top candidate for this position. Details about your experience, qualifications, personality, etc., are very helpful.</li> <li>Other profile links if available (Your website, Twitter, LinkedIn, etc.)<br> </li> </ul><p>Also note, don't forget to proofread before submitting. Check spelling, capitalization, etc. This is your chance to make your application stand out :)</p><p>We won’t be able to individually respond to all applications, but if we feel you’re a strong match, someone will be in touch shortly. </p><p><strong>Thanks and we look forward to hearing from you!</strong></p>","tags":"[\"database\",\"mysql\"]","pubDate":"2025-01-02T00:00:00.000Z","link":"https://apply.workable.com/j/6E675E846C","slug":"qa-automation-engineer-awesome-motive-970"},{"id":4976304694,"title":"WordPress Developer","company":"Awesome Motive","image":"https://avatars.githubusercontent.com/u/8514352?s=200&v=4","description":"<p>As a WordPress Developer, you're responsible for Making Stuff Go. You will build infrastructure to create new features, improve existing code, squash bugs, and help us rapidly scale our platform.<br></p><p>💡 <strong>Interested in applying?</strong></p><p>🔍 <strong>Please read/follow the next steps outlined in \"How to Apply\" at the bottom of this listing.<br></strong></p><p><em>Attention to detail is one of our </em><a href=\"https://awesomemotive.com/core-values/\" target=\"_blank\" rel=\"nofollow noreferrer noopener\" class=\"external\">core values</a><em>! This is your chance to stand out :)<br></em></p><h3>To love this role, here’s the type of person you are:</h3><ul> <li>You’re a self-starter who loves taking initiative and seeing things through from conception to completion. Our developers often \"own\" features/tasks and are responsible for scoping, development, and testing.</li> <li>You're an excellent communicator, fluent in both verbal and written English, who makes sure nothing slips through the cracks. We believe communication is critical, and there is no such thing as overcommunication.</li> <li>You have the curiosity and desire to learn and grow your skills.</li> <li>You're passionate about leaving your mark on the web for all to see and are excited to work on tasks that impact <em>millions</em> of users.</li> <li>You take pride in the quality and craftsmanship of your work rather than just doing it to get it done.</li> <li>You're a team player who is comfortable working alongside and helping other developers, and you don't take critical feedback personally.</li> <li>You're happy jumping between front-end and back-end development tasks, or tackling tasks which require both.</li> <li>You're happy working on tasks of all sizes - from small bug fixes and enhancements to large features/rewrites.</li> </ul><h3>Common responsibilities include (but are not limited to):</h3><ul> <li>Triaging bugs and small enhancements that come into GitHub.</li> <li>Scoping, writing, and testing new product features and addons.</li> <li>Refactoring legacy code with a particular attention to backwards compatibility.</li> <li>Providing feedback and peer review for other developers (Github PRs).</li> <li>Communicating with the team and supporting your peers using chat, audio, and video.</li> </ul><p><strong>Requirements</strong></p><ul> <li>Professional experience with WordPress plugin development, architecture, and standards.</li> <li>Advanced proficiency with PHP and MySQL, including modern PHP practices (OOP, autoloading, namespacing, traits, interfaces, etc).</li> <li>Strong familiarity with JavaScript (vanilla JS, jQuery, ES6, etc).</li> <li>Ability to use and extend build tools like gulp and webpack.</li> <li>Familiarity with package managers such as Composer and NPM.</li> <li>Experience working with third-party APIs (Eg Stripe, Drip, Zapier, etc).</li> <li>Competent with version control through git and GitHub.</li> <li>The ability to iterate and ship ideas quickly.</li> <li>Exceptional troubleshooting skills.</li> <li>Ability to keep complex ideas and features <em>simple</em>. (Simplicity is a core value!)</li> <li>Previous freelance or remote work experience.</li> <li>Personal Computer with Internet Access</li> <li>Availability to participate in audio/video meetings between the hours 9 am - 5 pm EST.</li> </ul><p><strong>Bonus points if you also have:</strong></p><ul> <li>Advanced proficiency in JavaScript frameworks like VueJS or React.</li> <li>Experience with e-commerce platforms or related APIs (Easy Digital Downloads, WooCommerce, Stripe, PayPal, etc).</li> <li>Experience with DevOps or infrastructure management.</li> </ul><p><strong>Benefits</strong></p><p>Working for a fast-growing bootstrapped company is a rare opportunity, one we consider a lifestyle choice rather than a job choice. Our positions are challenging, but also come with amazing advantages and fulfillment to those who earn them. Here’s what we offer.</p><ul> <li>Competitive Salary.</li> <li>Term Life Insurance and Accidental Death &amp; Dismemberment for all full-time team members during their employment.</li> <li>Health, Dental, and Vision Insurance benefits for full-time U.S. employees.</li> <li>Health Insurance benefits for all employees in India, Pakistan, Brazil, Philippines, Ukraine, Poland, Romania, Nepal, Kenya, Mexico, Nigeria, Spain &amp; Jamaica.</li> <li>Work from your home. We’re spread out all over the world – United States, Canada, Ukraine, India, Pakistan, Singapore, and more.</li> <li>Flexible PTO after 90 days of employment. We encourage employees to take the time they need for a vacation, stay healthy, and spend time with friends and family.</li> <li>Holidays (based on your location)</li> <li>Paid Parental Leave.</li> <li>We happily provide or reimburse software you’ll need as well as books or courses that promote continued learning.</li> <li>We cover all costs of company travel (including our annual all-company retreat and mini-team meetups).</li> <li>Additional Perks include AM Welcome Box for new team members, Yearly Anniversary Gifts, and Technology Stipend each work anniversary.</li> <li>We give you the opportunity to solve challenging and meaningful problems that make a difference.</li> <li>Ability to work with some of the best people in the business through frequent, if not daily, interactions.</li> <li>And in case you were wondering: no politics, no b.s., and no jerks.</li> </ul><p><strong>Location<br></strong>This is a remote position - our team is spread around the globe! Our home base is in Florida, USA, so company operating hours are 9am - 5pm ET (UTC -5). While full coverage is not a requirement, you must be available during a portion of the day.</p><p><strong>Inclusion Statement<br></strong>At Awesome Motive, we strive to have the broadest possible view of diversity, going beyond visible differences to include the background, experiences, skills, and perspectives that make each person unique. Awesome Motive is proud to be an equal opportunity workplace and is committed to equal employment opportunity regardless of race, color, ancestry, religion, sex, national origin, sexual orientation, age, citizenship, marital status, disability, gender identity, veteran status, or any other basis protected by federal, state, or local law.</p><p><strong>How to apply?<br></strong>If all of this sounds interesting, then please submit your application!</p><p><strong>Please clearly include the following in your cover letter:</strong></p><ul> <li>Your experience with WordPress plugin development.</li> <li>What is your favorite WordPress hook/function and why.</li> <li>Tell us a bit about yourself and why you should be considered. Details about your experience, qualifications, personality, etc are very helpful.</li> <li>Profile links with code samples (GitHub, GitLab, WordPress.org, etc).</li> <li>Other profile links if available (Your website, Twitter, LinkedIn, etc).</li> </ul><p>Also note, don't forget to proofread before submitting. Check spelling, capitalization, etc. This is your chance to make your application stand out :)</p><p>We won’t be able to individually respond to all applications, but if we feel you’re a strong match, someone will be in touch shortly. </p><p><strong>Thanks and we look forward to hearing from you!</strong></p>","tags":"[\"javascript\",\"management\",\"mysql\"]","pubDate":"2025-01-02T00:00:00.000Z","link":"https://apply.workable.com/j/F2C4D10A5A","slug":"wordpress-developer-awesome-motive-7228"}]