[{"id":6806959701,"title":"Founding K-12 Partner Success Manager","company":"EQL Edtech","image":"https://remotive.com/job/2006948/logo","description":"<p><strong>🌍 Remote | Full-Time | US Timezones | $25–40k</strong></p>\n<div class=\"h3\">Founding K–12 Partner Success Manager</div>\n<p><strong>Help Bring AI-Powered Learning to Classrooms Across the World</strong><br><em>EQL Edtech is recruiting on behalf of one of the fastest-growing, most beloved AI tools in K–12 education.</em></p>\n<p>Our partner client is on a mission to transform teaching and learning with powerful, easy-to-use AI technology - already loved and trusted by thousands of educators. Now, they’re looking for a <strong>Founding K–12 Partner Success Manager</strong> to help drive growth, deepen school partnerships, and deliver lasting impact.</p>\n<p>This is a high-ownership, high-autonomy role for someone with <strong>proven experience selling into K–12 schools or districts</strong> (ideally in the US) and a passion for building strong, lasting relationships in education.</p>\n<p> </p>\n<div class=\"h3\"><strong>What You’ll Do</strong></div>\n<ul style=\"\">\n<li style=\"\">Be the trusted advisor for a portfolio of school and district partners, ensuring successful onboarding, adoption, and long-term engagement.</li>\n<li style=\"\">Take full ownership of renewals, upsells, and expansion opportunities - growing school-level usage and district-wide buy-in.</li>\n<li style=\"\">Systematize success. Design and implement scalable, repeatable processes to support and retain a high volume of accounts - while providing tailored support where needed.</li>\n<li style=\"\">Use data to spot risks, uncover opportunities, and continuously refine your approach.</li>\n<li style=\"\">Partner with internal teams to improve the customer experience and advocate for users’ needs and feedback.</li>\n<li style=\"\">Lay the foundations for a world-class success function inside a fast-moving startup.</li>\n</ul>\n<p><strong>Requirements</strong></p>\n<div class=\"h3\"><strong>Who We’re Looking For</strong></div>\n<ul style=\"\">\n<li style=\"\">You <strong>must have experience selling to or managing K–12 school or district accounts - </strong>ideally in the US education system. You know how schools buy, how districts operate, and how to build trust in an education context.</li>\n<li style=\"\">You’re a <strong>strong communicator</strong> who can engage both frontline teachers and senior administrators with confidence.</li>\n<li style=\"\">You’re <strong>empathetic</strong>, curious, and passionate about making a difference for educators.</li>\n<li style=\"\">You’re a <strong>systems thinker - </strong>able to design scalable processes while staying close to the details.</li>\n<li style=\"\">You’re <strong>data-savvy</strong> and outcomes-driven. You see the story behind the numbers.</li>\n<li style=\"\">You’re a <strong>self-starter</strong> who thrives in ambiguity, adapts quickly, and gets things done.</li>\n<li style=\"\">You’re <strong>collaborative and low-ego</strong>, excited to contribute to a supportive and high-performing team.</li>\n</ul>\n<p> </p>\n<div class=\"h3\"><strong>Bonus Points If You:</strong></div>\n<ul style=\"\">\n<li style=\"\">Have a background in teaching or school leadership - you’ll bring credibility and a deep understanding of educator needs.</li>\n<li style=\"\">Have worked in an early-stage edtech startup and built playbooks from the ground up.</li>\n</ul>\n<p><strong>Benefits</strong></p>\n<div class=\"h3\"><strong>What’s On Offer</strong></div>\n<ul style=\"\">\n<li style=\"\"><strong>$25–40k salary</strong> depending on experience (higher for the right person).</li>\n<li style=\"\">Fully remote role with flexibility to work from anywhere - <strong>must be available during core US timezones.</strong></li>\n<li style=\"\">Opportunity for regular in-person offsites with the team.</li>\n<li style=\"\">A unique opportunity to shape the future of K–12 education with a fast-growing, mission-driven company.</li>\n</ul>\n<p> </p>\n<p><strong>📩 Apply now to join a transformative edtech journey.</strong><br>This is your chance to grow with a product that’s changing classrooms - and lives - every day.</p>\n<p><br><br></p>\n<div class=\"h2\">About the company</div>\n<p> </p>\n<p><strong>Looking to grow your career in edtech?</strong></p>\n<p>At <strong><a class=\"external\" href=\"https://www.eqledtech.com/\" rel=\"nofollow\" target=\"_blank\">EQL Edtech</a></strong>, we connect ambitious professionals with exciting opportunities at the heart of innovation - from early-stage startups to rapidly scaling edtech powerhouses.</p>\n<p>Whether you're exploring your next move or ready to make a big leap, we specialise in permanent, contract, and fractional recruitment that aligns your skills and passion with companies shaping the future of learning.</p>\n<p>As a specialist division of Equal Education Partners, we bring over 15 years of expertise in education recruitment. Our deep sector knowledge and trusted network mean we don’t just match people to jobs - we help build impactful careers in edtech.</p>\n<p><strong>Your next step starts here. Let’s make it count.</strong></p>\n<img src=\"https://remotive.com/job/track/2006948/blank.gif?source=public_api\" alt=\"\"/>","tags":"[\"teaching\",\"AI/ML\",\"partnerships\",\"onboarding\",\"startup\",\"EdTech\"]","pubDate":"2025-05-10T14:50:48.000Z","link":"https://remotive.com/remote-jobs/sales-business/founding-k-12-partner-success-manager-2006948","slug":"founding-k-12-partner-success-manager-eql-edtech-6019"}]