[{"id":7425706950,"title":"Sr. Software Engineer - Credit Card","company":"Empower","image":"https://lever-client-logos.s3.us-west-2.amazonaws.com/2e1a369c-b58f-41ac-8d86-4b0a77695e68-1687915522032.png","description":"<p style=\"min-height:1.5em\"><strong>EMPOWER OVERVIEW</strong></p><p style=\"min-height:1.5em\"><a target=\"_blank\" rel=\"noopener noreferrer nofollow\" href=\"http://empower.me/\">Empower</a> is shaking up an outdated financial system by providing real opportunity for our customers: the opportunity to get the cash they need, to access fair credit, and to change their financial story. Today, we’re helping millions of people find financial security through machine learning models that evaluate creditworthiness using a more inclusive lens and mobile-first products: Cash Advance, Thrive line of credit, and Petal credit cards. Tomorrow? Creating even more financial paths for our customers (and their wallets) to succeed.</p><p style=\"min-height:1.5em\">This year, Empower ranked #65 on Inc. 5000’s Fastest-Growing Private Companies list — our third year in a row cracking the top 100 — and was named by Forbes as one of the 25 Next Billion-Dollar Startups for 2024. Empower was also featured by Forbes on America’s Best Startup Employers list in 2023, and our Thrive line of credit product was named by Fast Company as one of 2022’s Next Big Things in Tech.</p><p style=\"min-height:1.5em\">Empower is backed by Sequoia Capital, Blisce, and Icon Ventures. Ready to grow your impact and accelerate your career? Take a look at our open roles — we can’t wait to meet you.</p><p style=\"min-height:1.5em\"></p><p style=\"min-height:1.5em\"></p><p style=\"min-height:1.5em\"><strong>The Opportunity: Sr. Software Engineer - Credit Card</strong></p><p style=\"min-height:1.5em\">As a Senior Engineer on our Card team, you'll join a high-caliber engineering organization at a critical inflection point in Empower's growth trajectory. You'll work across our Card Spend and Card Payments domains, implementing key features that power our AI-driven credit platform. This role reports to the Engineering Manager for the team and collaborates with Staff and Principal Engineers to execute our card platform strategy.</p><p style=\"min-height:1.5em\"></p><p style=\"min-height:1.5em\">Within our team structure, you'll independently execute on features of moderate to high complexity. You'll bring valuable opinions to discussions about product direction and team roadmap, helping shape how we approach critical challenges in both the spending and payments domains. While you'll have guidance from more senior team members, you'll be self-sufficient in managing your work and communicating progress to stakeholders.</p><p style=\"min-height:1.5em\"></p><p style=\"min-height:1.5em\">Empower is a remote-first company. We drive connectivity through regular company offsites. Travel for company offsites is expected at a minimum 2 times a year.</p><p style=\"min-height:1.5em\"></p><p style=\"min-height:1.5em\"><strong>How You'll Make an Impact</strong></p><p style=\"min-height:1.5em\"></p><p style=\"min-height:1.5em\">You'll make a significant impact by implementing and enhancing features that directly drive adoption and utilization of our card products. Our credit business represents a substantial and rapidly growing portion of Empower's revenue - your engineering contributions will be directly tied to achieving our ambitious growth targets.</p><p style=\"min-height:1.5em\">We're looking for someone to improve and scale systems with proven market fit. instead, you'll be improving and scaling systems that have proven market fit. You'll implement features that enhance the user experience, optimize our infrastructure, and help transition our platform from serving our initial customer base to supporting a rapidly growing portfolio of card products.</p><h2></h2><p style=\"min-height:1.5em\">Depending on team needs and your interests, you'll implement features across the card lifecycle, such as:</p><ul style=\"min-height:1.5em\"><li><p style=\"min-height:1.5em\">Enhancing user interfaces for transaction visibility and spending insights</p></li><li><p style=\"min-height:1.5em\">Building components of our rewards system to increase engagement</p></li><li><p style=\"min-height:1.5em\">Implementing account status management and payment scheduling features</p></li><li><p style=\"min-height:1.5em\">Creating integration points with our AI-driven risk management systems</p></li><li><p style=\"min-height:1.5em\">Developing tools for both customers and internal teams to manage card operations</p></li></ul><p style=\"min-height:1.5em\">Your work will span both customer-facing features that drive engagement and internal systems that ensure reliability and performance as we scale. You'll work with clear requirements but will have the autonomy to make implementation decisions and suggest improvements to product plans.</p><p style=\"min-height:1.5em\"></p><p style=\"min-height:1.5em\"><strong>Why You're a Great Fit</strong></p><p style=\"min-height:1.5em\"></p><p style=\"min-height:1.5em\">As a Senior Engineer on the Card team, you'll need:</p><ul style=\"min-height:1.5em\"><li><p style=\"min-height:1.5em\">Strong software engineering fundamentals and coding skills</p></li><li><p style=\"min-height:1.5em\">Experience implementing features for consumer-facing products</p></li><li><p style=\"min-height:1.5em\">Understanding of financial transactions and payment systems</p></li><li><p style=\"min-height:1.5em\">Ability to work with distributed systems and data-intensive applications</p></li><li><p style=\"min-height:1.5em\">Skill in translating product requirements into effective technical solutions</p></li><li><p style=\"min-height:1.5em\">Experience with handling complex state management in user interfaces</p></li><li><p style=\"min-height:1.5em\">Knowledge of secure coding practices for financial applications</p></li><li><p style=\"min-height:1.5em\">Self-sufficiency in communicating work status and managing tasks</p></li><li><p style=\"min-height:1.5em\">Comfort bringing opinions to technical and product discussions</p></li><li><p style=\"min-height:1.5em\">Ability to collaborate effectively with product managers, designers, and other engineers</p></li></ul><p style=\"min-height:1.5em\">This role offers an excellent opportunity to make a meaningful impact on products that directly improve people's financial lives while growing your skills in a rapidly scaling fintech environment.</p><p style=\"min-height:1.5em\"><strong>Don't meet every qualification? If you're excited about this challenge and driven to innovate, we still want to hear from you!</strong></p><p style=\"min-height:1.5em\"></p><h2>What You'll Get at Empower</h2><ul style=\"min-height:1.5em\"><li><p style=\"min-height:1.5em\"><strong>Meaningful Ownership:</strong> Competitive salary and generous equity in a profitable, fast growing company.</p></li><li><p style=\"min-height:1.5em\"><strong>Complete Support:</strong> 100% coverage for medical, dental, vision, and life insurance, plus a generous WFH reimbursement.</p></li><li><p style=\"min-height:1.5em\"><strong>High-Impact Teams:</strong> The chance to thrive in a small, focused team where your contributions directly shape outcomes for our business and customers.</p></li><li><p style=\"min-height:1.5em\"><strong>Remote First:</strong> A virtual first environment built on trust and outcomes.</p></li><li><p style=\"min-height:1.5em\"><strong>Team Connection:</strong> Twice-yearly company onsites where we come together to connect, learn, and build for the future (our last few have been in San Diego, Vail, and Flagstaff)!</p></li><li><p style=\"min-height:1.5em\"><strong>Growth Path:</strong> Ongoing opportunities for development in a dynamic, supportive, and creative environment.</p></li></ul><p style=\"min-height:1.5em\"></p><h2>The Empower Way</h2><p style=\"min-height:1.5em\">The Empower Way is one where bold ambition meets an owner mindset, where open dialogue and spirited debate are encouraged, and where everyone works together to put our customers first. We believe diverse voices lead to the best ideas, and we foster an environment where every individual is valued, heard, and supported as part of one unified team working to change lives and build a more inclusive future.</p><p style=\"min-height:1.5em\"><strong>If that sounds like you, join us and be part of a team that's helping millions of people reshape their financial futures.</strong></p>","tags":"[]","pubDate":"2025-05-21T00:48:27.171Z","link":"https://jobs.ashbyhq.com/empower%20finance/ccd5da56-73cc-47d6-babe-9a884ae8ad25","slug":"sr-software-engineer-credit-card-empower-8756"},{"id":8312289590,"title":"Management Liability Lead","company":"Counterpart","image":"https://pbs.twimg.com/profile_images/1702672942587326464/RLmfo_44_400x400.jpg","description":"&lt;p&gt;&lt;strong&gt;Management Liability Lead&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;Counterpart believes in small businesses and is dedicated to helping them do more with less risk. By pairing leading insurance experts with cutting-edge technology, Counterpart empowers small business owners to grow with confidence. Exceptional underwriters, trusted insurance brokers, and prominent insurance carriers come together on the Counterpart platform to support small businesses by providing AI-driven management and professional liability underwriting and claims services. That’s where you come in.&lt;/p&gt;\n&lt;p&gt;You will lead a variety of strategic, analytical, and operational projects to enhance carrier and broker relationships, build underwriting workflows, underwrite a profitable book, and launch new insurance products. You will partner with senior leaders, external carrier partners, and cross-functional teams to drive and support our Professional Liability growth efforts while managing and strengthening our most important relationships. You will own the success of our professional liability product line.&lt;/p&gt;\n&lt;p&gt;We are seeking a strategic, execution-oriented leader to own and scale our admitted &amp;amp; surplus Management Liability product portfolio, including Directors &amp;amp; Officers (D&amp;amp;O), Employment Practices Liability (EPLI), Fiduciary, and Crime insurance on a primary and excess basis. You will be accountable for the P&amp;amp;L of our Management Liability portfolio, guiding growth strategy, underwriting structure, and go-to-market execution in partnership with our insurance, data, and engineering teams.&lt;/p&gt;\n&lt;p&gt;This role requires someone who can design structured, scalable underwriting systems, while also bringing underwriting gravitas to the field — supporting senior territory leads, brokers, and carrier partners with clarity, expertise, and decisiveness. We are looking for a proactive individual who takes ownership over initiatives and drives execution with limited oversight.&lt;/p&gt;\n&lt;p&gt;&amp;nbsp;&lt;strong&gt;YOU WILL&lt;/strong&gt;&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;Own and Optimize the Management Liability Portfolio&lt;/li&gt;\n&lt;ul&gt;\n&lt;li&gt;Be directly accountable for the P&amp;amp;L of our Management Liability products — balancing growth, compliance, and profitability.&lt;/li&gt;\n&lt;li&gt;Drive national and regional growth targets in partnership with senior territory leads and broker partners.&lt;/li&gt;\n&lt;li&gt;Underwrite or support the most complex submissions, especially those escalated through authority guidelines or strategic priorities.&lt;/li&gt;\n&lt;li&gt;Act as the escalation point for underwriting guideline referrals, and be seen by the field as a trusted expert.&lt;/li&gt;\n&lt;/ul&gt;\n&lt;li&gt;Set and Execute Product Strategy&lt;/li&gt;\n&lt;ul&gt;\n&lt;li&gt;Lead go-to-market (GTM) strategy for Management Liability: messaging, broker training, coordination with the rest of the underwriting team, enablement materials, and external positioning.&lt;/li&gt;\n&lt;li&gt;Develop and iterate target market initiatives, identifying classes, geographies, or niches where our value proposition gives us a strategic edge.&lt;/li&gt;\n&lt;li&gt;Shape and oversee product audits, ensuring underwriting consistency, guideline adherence, and feedback loop closure.&lt;/li&gt;\n&lt;/ul&gt;\n&lt;li&gt;Build Scalable, Systematic Infrastructure&lt;/li&gt;\n&lt;ul&gt;\n&lt;li&gt;Own or coordinate the creation of underwriting guidelines, decision trees, and rating logic, ensuring alignment across manual, automated, and hybrid workflows and overall company goals.&lt;/li&gt;\n&lt;li&gt;Work with data and engineering teams to codify underwriting logic, enabling automation, default recommendations, and triage logic.&lt;/li&gt;\n&lt;li&gt;Develop structured processes to capture and act on market trends, adjusting rate strategy, appetite, and workflow defaults to maintain competitiveness and profit.&lt;/li&gt;\n&lt;/ul&gt;\n&lt;li&gt;Partner with Carriers and Brokers&lt;/li&gt;\n&lt;ul&gt;\n&lt;li&gt;Lead carrier relationships for Management Liability, including new filings, audits, product approvals, and ad hoc initiatives.&lt;/li&gt;\n&lt;li&gt;Serve as the face of product leadership to strategic brokers — building trust through responsiveness, underwriting depth, and insight.&lt;/li&gt;\n&lt;li&gt;Deliver training and support to distribution teams to maximize broker engagement and quote-to-bind efficiency.&lt;/li&gt;\n&lt;/ul&gt;\n&lt;li&gt;Optimize with Data&lt;/li&gt;\n&lt;ul&gt;\n&lt;li&gt;Collaborate with data science to run scenario models, pricing experiments, and profit optimization analyses across products and segments.&lt;/li&gt;\n&lt;li&gt;Use performance data to recommend updates to appetite, coverage terms, pricing, and underwriting strategy.&lt;/li&gt;\n&lt;li&gt;Track and synthesize portfolio KPIs — translating into product strategy and operational changes.&lt;/li&gt;\n&lt;/ul&gt;\n&lt;/ul&gt;\n&lt;p&gt;&lt;strong&gt;YOU HAVE&lt;/strong&gt;&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;10+ years of experience in management liability insurance, including extensive experience developing and managing rating manuals, underwriting guidelines, and policy forms.&lt;/li&gt;\n&lt;li&gt;Expertise in pricing, portfolio management, and risk modeling across management liability lines, with a deep understanding of emerging and complex industries.&lt;/li&gt;\n&lt;li&gt;Proven experience in drafting and optimizing insurance forms: Demonstrated ability to design declarations, GTCs, and endorsements that align with both carrier risk tolerances and market demands.&lt;/li&gt;\n&lt;li&gt;Strong organizational and analytical skills: Ability to conduct sophisticated data analysis, distill insights, and present actionable recommendations to internal and external stakeholders.&lt;/li&gt;\n&lt;li&gt;Experience developing and executing strategies to scale: Proven track record of launching new products, optimizing product-market-fit, and driving profitable growth in a dynamic, fast-paced environment.&lt;/li&gt;\n&lt;li&gt;Exceptional leadership and collaboration skills: Ability to lead cross-functional teams and drive change across underwriting, product, engineering, and data functions.&lt;/li&gt;\n&lt;li&gt;A self-starter mindset: Comfortable with rolling up your sleeves to meet aggressive growth goals and continuously iterate on product offerings.&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;&lt;strong&gt;WHO YOU WILL WORK WITH:&lt;/strong&gt;&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;&lt;strong&gt;Tanner Hackett, CEO &amp;amp; Founder&lt;/strong&gt;: Having founded two other major startups, including Button and Lazada, Tanner now spends his time focused on mental health through his philanthropy,&lt;a href=&quot;http://openminded.org&quot;&gt; Openminded.org&lt;/a&gt;, in addition to reading, surfing, yoga, and enjoying the outdoors.&amp;nbsp;&lt;/li&gt;\n&lt;li&gt;&lt;strong&gt;Satwik Mysore, Risk Engineer: &lt;/strong&gt;After graduating with an actuarial science degree, Satwik has spent most of his career at Travelers, where he built one of the largest and most profitable management liability books by forming strong broker relationships.&lt;/li&gt;\n&lt;li&gt;&lt;strong&gt;Tobias Schuler, Head of Data Analytics&lt;/strong&gt;: After becoming a Fellow of the Casualty Actuarial Society &amp;amp; working as a consultant actuary at EY for several years, Tobias went on to drive the actuarial data &amp;amp; systems teams at QBE. He further leveraged his deep insurance &amp;amp; technical expertise at Munich Re Digital Partners in North America, where he headed data &amp;amp; analytics &amp;amp; oversaw the data infrastructure behind some of their largest programs.&lt;/li&gt;\n&lt;li&gt;&lt;strong&gt;Stanley Wang, Director, Pricing Analytics&lt;/strong&gt;: Before joining Counterpart, Stanley worked as an actuary within the pricing solutions and methods team at USAA to combine actuarial pricing with data science models. Before that, he was a leading data scientist for Digital Partners, a Munich Re Company where he specialized in building data science models and insights for leading insurtech companies. He has had many other relevant roles such as capital modeling, risk management etc. He lives in New York with his growing family.&lt;/li&gt;\n&lt;li&gt;&lt;strong&gt;Mike Foster, Insurance Operations Lead&lt;/strong&gt;: MIke has over two decades of experience in insurance operations, strategy, transformation, and customer experience. Before joining Counterpart, Mike led a 120+ person team at Lincoln Financial, overseeing strategy, analytics, and service operations for group benefits. Earlier in his career, he spearheaded digital transformation efforts and managed large-scale operations teams at both Lincoln and Liberty Mutual, where he launched new service models and built cloud-native platforms from scratch. Mike is known for their thoughtful leadership, data-driven decision-making, and ability to scale operational excellence in complex environments.&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;&lt;strong&gt;WHAT WE OFFER&lt;/strong&gt;&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;&lt;strong&gt;Unlimited Vacation&lt;/strong&gt;: We offer flexible time off, allowing you to take time when you need it.&lt;/li&gt;\n&lt;li&gt;&lt;strong&gt;Work from Anywhere&lt;/strong&gt;: Counterpart is a fully distributed company, meaning there is no office. We allow employees to work from wherever they do their best work, and invite the team to meet in person a couple times per year.&lt;/li&gt;\n&lt;li&gt;&lt;strong&gt;Stock Options&amp;nbsp;&lt;/strong&gt;&lt;/li&gt;\n&lt;li&gt;&lt;strong&gt;Health, Dental, and Vision Coverage&lt;/strong&gt;&lt;/li&gt;\n&lt;li&gt;&lt;strong&gt;401(k) Retirement Plan&lt;/strong&gt;&lt;/li&gt;\n&lt;li&gt;&lt;strong&gt;Parental Leave&lt;/strong&gt;&lt;/li&gt;\n&lt;li&gt;&lt;strong&gt;Home Office Allowance&lt;/strong&gt;: &lt;strong&gt;to set up your home office&lt;/strong&gt; with the necessary equipment and accessories.&lt;/li&gt;\n&lt;li&gt;&lt;strong&gt;Book stipend&lt;/strong&gt;&lt;/li&gt;\n&lt;li&gt;&lt;strong&gt;Professional Development Reimbursement&lt;/strong&gt;&lt;/li&gt;\n&lt;li&gt;&lt;strong&gt;No working birthdays&lt;/strong&gt;: &lt;strong&gt;Take your birthday off&lt;/strong&gt;, giving you the opportunity to relax, enjoy your special day, and spend time with loved ones.&lt;/li&gt;\n&lt;li&gt;&lt;strong&gt;Charitable Contribution Matching&lt;/strong&gt;&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;&lt;strong&gt;COUNTERPART&#39;S VALUES&lt;/strong&gt;&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;&lt;strong&gt;Conjoin Expectations&lt;/strong&gt; - it is the cornerstone of autonomy. Ensure you are aware of what is expected of you and clearly articulate what you expect of others.&amp;nbsp;&lt;/li&gt;\n&lt;li&gt;&lt;strong&gt;Speak Boldly &amp;amp; Honestly&lt;/strong&gt; - the only failure is not learning from mistakes. Don’t cheat yourself and your colleagues of the feedback needed when&amp;nbsp; expectations aren’t being met.&amp;nbsp;&lt;/li&gt;\n&lt;li&gt;&lt;strong&gt;Be Entrepreneurial&lt;/strong&gt; - control your own destiny.&amp;nbsp; Embrace action over perfection while navigating any obstacles that stand in the way of your ultimate goal.&amp;nbsp;&lt;/li&gt;\n&lt;li&gt;&lt;strong&gt;Practice Omotenashi&lt;/strong&gt; (“selfless hospitality”) - trust will follow.&amp;nbsp; Consider every interaction with internal and external partners an opportunity to develop trust by going above and beyond what is expected.&amp;nbsp;&lt;/li&gt;\n&lt;li&gt;&lt;strong&gt;Hold Nothing As Sacred&lt;/strong&gt; - create routines but modify them routinely.&lt;strong&gt;&amp;nbsp; &lt;/strong&gt;Take the time to reflect on where the business is today, where it needs to&amp;nbsp; go, and what you have to change in order to get there.&amp;nbsp;&lt;/li&gt;\n&lt;li&gt;&lt;strong&gt;Prioritize Wellness&lt;/strong&gt; - some things should never be sacrificed. We create an environment that stretches everyone to grow and improve, which is fulfilling, but is only one part of a meaningful life.&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;We are committed to being a welcoming and inclusive workplace for everyone, and we are intentional about making sure people feel respected, supported and connected at work—regardless of who you are or where you come from. We value and celebrate our differences and we believe being open about who we are allows us to do the best work of our lives.&lt;/p&gt;\n&lt;p&gt;We are an Equal Opportunity Employer. We do not discriminate against qualified applicants or employees on the basis of race, color, religion, gender identity, sex, sexual preference, sexual identity, pregnancy, national origin, ancestry, citizenship, age, marital status, physical disability, mental disability, medical condition, military status, or any other characteristic protected by federal, state, or local law, rule, or regulation.&lt;/p&gt;","tags":"[\"scala\",\"vite\"]","pubDate":"2025-05-20T23:19:42.000Z","link":"https://job-boards.greenhouse.io/counterpart/jobs/4012706005","slug":"management-liability-lead-counterpart-8629"},{"id":6637036461,"title":"Senior Legal Counsel","company":"Kit","image":"https://avatars.githubusercontent.com/u/10557747?s=200&v=4","description":"&lt;div class=&quot;content-intro&quot;&gt;&lt;h4&gt;Description&lt;/h4&gt;\n&lt;div&gt;\n&lt;p class=&quot;p1&quot;&gt;Kit is an email-first operating system for creators who mean business. We help creators grow and monetize their audience with ease. For coaches, YouTubers, authors, podcasters, and other creatives, there isn’t a better marketing hub to rely on to grow audiences, automate email marketing, and sell digital products - all within one platform. More importantly, there isn’t a team more committed to helping creators earn a living.&lt;/p&gt;\n&lt;p&gt;We’re on a mission to help creators earn $1 billion using our creator marketing platform. We have always been 100% independent and 100% remote. We are proud to have built a product that our customers love, and we look for people who have enthusiasm and belief in our mission, vision, and values to join our team.&lt;/p&gt;\n&lt;p&gt;The Kit culture is one where emotional intelligence is valued, radical candor is encouraged, and where everyone works together to uphold a set of shared team principles.&lt;/p&gt;\n&lt;hr&gt;\n&lt;p&gt;&amp;nbsp;&lt;/p&gt;\n&lt;/div&gt;&lt;/div&gt;&lt;h3&gt;&lt;strong&gt;The role&lt;/strong&gt;&lt;/h3&gt;\n&lt;p&gt;Kit is growing, and so are the legal complexities of our business. We’re looking for a &lt;strong&gt;Senior Legal Counsel&lt;/strong&gt; to help us navigate them with clarity, speed, and commercial savvy. You’ll serve as our first in-house legal hire, partnering closely with the executive team to lead commercial legal strategy and execution—especially around contracts, compliance, and M&amp;amp;A.&lt;/p&gt;\n&lt;p&gt;You’ll help shape the legal backbone of a fast-moving tech company with four revenue streams—including SaaS, digital commerce, and advertising—and a rapidly growing platform for creators. From structuring new monetization models to supporting our App Store expansion, you’ll be at the center of complex, cross-functional problems where product, business, and legal strategy meet—all in service of empowering the next generation of independent creators.&lt;/p&gt;\n&lt;h3&gt;&lt;strong&gt;The team&lt;/strong&gt;&lt;/h3&gt;\n&lt;p&gt;You’ll report to our VP Operations, Ashley Alexander, and partner regularly with leaders across product, sales, finance, and people operations. We’ll continue to work with outside counsel on employment, immigration, tax, real estate, and litigation—but you’ll own our core legal work in-house, and know when and how to pull in expert help.&lt;/p&gt;\n&lt;h3&gt;&lt;strong&gt;What you’ll do&lt;/strong&gt;&lt;/h3&gt;\n&lt;ul&gt;\n&lt;li&gt;&lt;strong&gt;First week:&lt;/strong&gt; Get up to speed on our business model, current goals, and product. Meet key internal stakeholders and our external counsel. Review our most common legal agreements and assess where we have risk, opportunity, or ambiguity.&lt;/li&gt;\n&lt;li&gt;&lt;strong&gt;First month:&lt;/strong&gt; Take ownership of our commercial contract review and documentation process. Begin partnering with Sales and Sponsorships to move faster without cutting corners. Get your arms around active data processing, AI, and other legal initiatives, and build a “what’s on deck” view of upcoming legal needs.&amp;nbsp;&lt;/li&gt;\n&lt;li&gt;&lt;strong&gt;First six months:&lt;/strong&gt; Become the go-to partner for legal counsel across the business. Streamline legal workflows to reduce friction, increase confidence, and allow for more self-service. Help us apply legal frameworks practically, not just academically. Be a trusted partner to the executive team, balancing speed and rigor in service of our mission.&lt;/li&gt;\n&lt;li&gt;&lt;strong&gt;First year:&lt;/strong&gt; Help Kit operate at a higher level of legal maturity. Support due diligence and integration work on any acquisitions.&amp;nbsp; Shape how we think about risk, compliance, and contracts as strategic enablers—not just boxes to check.&amp;nbsp;&lt;/li&gt;\n&lt;/ul&gt;\n&lt;h3&gt;&lt;strong&gt;What will S.E.T. you up for success&lt;/strong&gt;&lt;/h3&gt;\n&lt;p&gt;&lt;strong&gt;Skills&lt;/strong&gt;&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;Deep expertise in commercial contracts, compliance, and M&amp;amp;A—this is where you’ll spend most of your time&lt;/li&gt;\n&lt;li&gt;Working knowledge of U.S. and European data privacy laws (e.g., GDPR, CCPA), including familiarity with data controller vs. processor distinctions and how they shape vendor and product decisions&lt;/li&gt;\n&lt;li&gt;Basic understanding of intellectual property law, especially related to brand, content, and software&lt;/li&gt;\n&lt;li&gt;Clear communicator and trusted advisor—able to simplify complexity and help others make informed decisions&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;&lt;strong&gt;Experiences&lt;/strong&gt;&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;Experience as in-house counsel at a tech company or serving a tech portfolio at a top-tier firm that’s well-known for their work with startups (e.g., Fenwick &amp;amp; West, Cooley)&lt;/li&gt;\n&lt;li&gt;J.D. from an accredited law school in the United States&lt;/li&gt;\n&lt;li&gt;Active member in good standing of a State Bar Association&lt;br&gt;&lt;br&gt;&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;&lt;strong&gt;Traits&lt;/strong&gt;&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;Strategic thinker who sees legal as a lever, not a blocker&lt;/li&gt;\n&lt;li&gt;Deeply curious and business-oriented—you start by understanding the goals, then explore the smartest paths to get there.&lt;/li&gt;\n&lt;li&gt;Collaborative partner who can navigate conflict productively&lt;/li&gt;\n&lt;li&gt;Deep belief that creator success is our success—you consider both Kit and our customers in every recommendation&lt;/li&gt;\n&lt;li&gt;A “how might we” problem-solver who finds creative, business-aligned paths through legal challenges&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;&lt;strong&gt;What won’t set you up for success&lt;/strong&gt;&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;Needing a team of in-house peers or co-counsel to pressure-test every decision—you’ll be our sole in-house legal expert, with outside counsel available as needed&lt;/li&gt;\n&lt;li&gt;A strongly risk-averse or “no-before-yes” mindset—we need you to help us move, not just stop us from tripping&lt;/li&gt;\n&lt;li&gt;Thinking in a legal vacuum—if you’re not factoring in our goals, numbers, or creators, your advice won’t land&lt;/li&gt;\n&lt;li&gt;Struggling with speed or ownership—if you prefer long timelines or wait to be told what to do, this won’t be the right environment. We move quickly and expect people to take initiative, spot problems, and drive solutions.&lt;/li&gt;\n&lt;/ul&gt;\n&lt;h3&gt;&lt;strong&gt;Working hours and location&lt;/strong&gt;&lt;/h3&gt;\n&lt;p&gt;We&#39;re 100% remote with team members across the globe. For this role, we’re looking for someone &lt;strong&gt;located in the United States.&lt;/strong&gt;&lt;/p&gt;\n&lt;h3&gt;&lt;strong&gt;Compensation and benefits&lt;/strong&gt;&lt;/h3&gt;\n&lt;p&gt;Kit has standardized salaries based on position, no matter where you live. This role is an &lt;strong&gt;individual contributor&lt;/strong&gt; &lt;strong&gt;level 4 ($227,000) or 5 ($251,000).&lt;/strong&gt; Our other perks and benefits include:&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;&lt;a href=&quot;https://www.linkedin.com/posts/nathanbarry_convertkit-compensation-model-activity-6991414959247147008-i9V3/?utm_source=share&amp;amp;utm_medium=member_desktop&quot;&gt;Profit Sharing&lt;/a&gt;&lt;/li&gt;\n&lt;li&gt;Kit equity&lt;/li&gt;\n&lt;li&gt;401k with a 5% match&lt;/li&gt;\n&lt;li&gt;We cover up to $1,950 per month toward medical premiums, with dental and vision fully covered. We offer health insurance plans through Aetna.&lt;/li&gt;\n&lt;li&gt;$4,000 equipment allowance for your first two years, $3,000 every two years after&lt;/li&gt;\n&lt;li&gt;$3,500 annual learning and development budget&lt;/li&gt;\n&lt;li&gt;$3,000 annual childcare benefit&lt;/li&gt;\n&lt;li&gt;20 days paid time off per year&lt;/li&gt;\n&lt;li&gt;Paid paid vacation: $1,000 bonus for taking five consecutive days full unplugged&lt;/li&gt;\n&lt;li&gt;10 paid holidays per year&lt;/li&gt;\n&lt;li&gt;2 weeks of paid sick time each year, including mental health days&lt;/li&gt;\n&lt;li&gt;12 weeks paid parental leave with flexible scheduling&lt;/li&gt;\n&lt;li&gt;Up to 6 weeks of paid bereavement, medical, and disaster leave&lt;/li&gt;\n&lt;li&gt;Winter Break: Kit closes for a week at the end of December to give everyone a collective break to enjoy the holiday season. &lt;em&gt;Essential support services remain available, with teams coordinating to ensure coverage during this period&lt;/em&gt;&lt;/li&gt;\n&lt;li&gt;4 week paid sabbatical after 5 years with the team&lt;/li&gt;\n&lt;li&gt;Fantastic in-person team retreats 2x per year&lt;/li&gt;\n&lt;/ul&gt;\n&lt;h3&gt;&lt;strong&gt;Interview process&lt;/strong&gt;&lt;/h3&gt;\n&lt;p&gt;We know applying to jobs takes time and energy. Our goal is to run a clear and thoughtful process that respects your effort and gives you a real sense of what it’s like to work at Kit — from first hello to final decision.&amp;nbsp;&lt;/p&gt;\n&lt;p&gt;We typically receive a high volume of applications, but we aim to review all submissions within two weeks of your application submission. You’ll hear from us either way.&lt;/p&gt;\n&lt;p&gt;Here’s what our process usually looks like:&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;Recruiter phone screen&lt;/li&gt;\n&lt;li&gt;Hiring manager interview&lt;/li&gt;\n&lt;li&gt;Work sample&lt;/li&gt;\n&lt;li&gt;A cross-functional interview&amp;nbsp;&lt;/li&gt;\n&lt;li&gt;Board interview&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;To apply, complete the form on the next page—including your answers to a few short questions. &lt;strong&gt;We read every application. &lt;/strong&gt;Your responses help us understand your experience and how you think, beyond just what’s on your resume.&lt;/p&gt;\n&lt;p&gt;We’ll stay in touch throughout. Thanks for taking the time—we’re excited to meet you.&lt;/p&gt;&lt;div class=&quot;content-conclusion&quot;&gt;&lt;hr&gt;\n&lt;p&gt;&amp;nbsp;&lt;/p&gt;\n&lt;p&gt;Kit is an equal opportunity employer. We value diversity in all of its forms, and we hire the best person we can for each role, no matter your personal background. Research tells us that applicants who are female or non-binary, as well as applicants who are people of color, are less likely to apply for roles they do not feel 100% qualified for. If you think you meet more than 50% of our requirements but fewer than 100% of them, please apply. We’re imperfect communicators, so think of our job postings as the starting point for discussion rather than proof that you shouldn’t apply.&lt;/p&gt;\n&lt;p&gt;Kit does not discriminate on the basis of race, sex, color, religion, age, national origin, marital status, disability, veteran status, genetic information, sexual orientation, gender identity or any other reason prohibited by law in provision of employment opportunities and benefits.&lt;/p&gt;&lt;/div&gt;","tags":"[\"aws\",\"advertising\",\"legal\"]","pubDate":"2025-05-20T20:18:15.000Z","link":"https://job-boards.greenhouse.io/kit/jobs/4703325007","slug":"senior-legal-counsel-kit-1891"},{"id":7025434404,"title":"Senior Legal Counsel","company":"Kit","image":"https://avatars.githubusercontent.com/u/10557747?s=200&v=4","description":"&lt;div class=&quot;content-intro&quot;&gt;&lt;h4&gt;Description&lt;/h4&gt;\n&lt;div&gt;\n&lt;p class=&quot;p1&quot;&gt;Kit is an email-first operating system for creators who mean business. We help creators grow and monetize their audience with ease. For coaches, YouTubers, authors, podcasters, and other creatives, there isn’t a better marketing hub to rely on to grow audiences, automate email marketing, and sell digital products - all within one platform. More importantly, there isn’t a team more committed to helping creators earn a living.&lt;/p&gt;\n&lt;p&gt;We’re on a mission to help creators earn $1 billion using our creator marketing platform. We have always been 100% independent and 100% remote. We are proud to have built a product that our customers love, and we look for people who have enthusiasm and belief in our mission, vision, and values to join our team.&lt;/p&gt;\n&lt;p&gt;The Kit culture is one where emotional intelligence is valued, radical candor is encouraged, and where everyone works together to uphold a set of shared team principles.&lt;/p&gt;\n&lt;hr&gt;\n&lt;p&gt;&amp;nbsp;&lt;/p&gt;\n&lt;/div&gt;&lt;/div&gt;&lt;h3&gt;&lt;strong&gt;The role&lt;/strong&gt;&lt;/h3&gt;\n&lt;p&gt;Kit is growing, and so are the legal complexities of our business. We’re looking for a &lt;strong&gt;Senior Legal Counsel&lt;/strong&gt; to help us navigate them with clarity, speed, and commercial savvy. You’ll serve as our first in-house legal hire, partnering closely with the executive team to lead commercial legal strategy and execution—especially around contracts, compliance, and M&amp;amp;A.&lt;/p&gt;\n&lt;p&gt;You’ll help shape the legal backbone of a fast-moving tech company with four revenue streams—including SaaS, digital commerce, and advertising—and a rapidly growing platform for creators. From structuring new monetization models to supporting our App Store expansion, you’ll be at the center of complex, cross-functional problems where product, business, and legal strategy meet—all in service of empowering the next generation of independent creators.&lt;/p&gt;\n&lt;h3&gt;&lt;strong&gt;The team&lt;/strong&gt;&lt;/h3&gt;\n&lt;p&gt;You’ll report to our VP Operations, Ashley Alexander, and partner regularly with leaders across product, sales, finance, and people operations. We’ll continue to work with outside counsel on employment, immigration, tax, real estate, and litigation—but you’ll own our core legal work in-house, and know when and how to pull in expert help.&lt;/p&gt;\n&lt;h3&gt;&lt;strong&gt;What you’ll do&lt;/strong&gt;&lt;/h3&gt;\n&lt;ul&gt;\n&lt;li&gt;&lt;strong&gt;First week:&lt;/strong&gt; Get up to speed on our business model, current goals, and product. Meet key internal stakeholders and our external counsel. Review our most common legal agreements and assess where we have risk, opportunity, or ambiguity.&lt;/li&gt;\n&lt;li&gt;&lt;strong&gt;First month:&lt;/strong&gt; Take ownership of our commercial contract review and documentation process. Begin partnering with Sales and Sponsorships to move faster without cutting corners. Get your arms around active data processing, AI, and other legal initiatives, and build a “what’s on deck” view of upcoming legal needs.&amp;nbsp;&lt;/li&gt;\n&lt;li&gt;&lt;strong&gt;First six months:&lt;/strong&gt; Become the go-to partner for legal counsel across the business. Streamline legal workflows to reduce friction, increase confidence, and allow for more self-service. Help us apply legal frameworks practically, not just academically. Be a trusted partner to the executive team, balancing speed and rigor in service of our mission.&lt;/li&gt;\n&lt;li&gt;&lt;strong&gt;First year:&lt;/strong&gt; Help Kit operate at a higher level of legal maturity. Support due diligence and integration work on any acquisitions.&amp;nbsp; Shape how we think about risk, compliance, and contracts as strategic enablers—not just boxes to check.&amp;nbsp;&lt;/li&gt;\n&lt;/ul&gt;\n&lt;h3&gt;&lt;strong&gt;What will S.E.T. you up for success&lt;/strong&gt;&lt;/h3&gt;\n&lt;p&gt;&lt;strong&gt;Skills&lt;/strong&gt;&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;Deep expertise in commercial contracts, compliance, and M&amp;amp;A—this is where you’ll spend most of your time&lt;/li&gt;\n&lt;li&gt;Working knowledge of U.S. and European data privacy laws (e.g., GDPR, CCPA), including familiarity with data controller vs. processor distinctions and how they shape vendor and product decisions&lt;/li&gt;\n&lt;li&gt;Basic understanding of intellectual property law, especially related to brand, content, and software&lt;/li&gt;\n&lt;li&gt;Clear communicator and trusted advisor—able to simplify complexity and help others make informed decisions&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;&lt;strong&gt;Experiences&lt;/strong&gt;&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;Experience as in-house counsel at a tech company or serving a tech portfolio at a top-tier firm that’s well-known for their work with startups (e.g., Fenwick &amp;amp; West, Cooley)&lt;/li&gt;\n&lt;li&gt;J.D. from an accredited law school in the United States&lt;/li&gt;\n&lt;li&gt;Active member in good standing of a State Bar Association&lt;br&gt;&lt;br&gt;&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;&lt;strong&gt;Traits&lt;/strong&gt;&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;Strategic thinker who sees legal as a lever, not a blocker&lt;/li&gt;\n&lt;li&gt;Deeply curious and business-oriented—you start by understanding the goals, then explore the smartest paths to get there.&lt;/li&gt;\n&lt;li&gt;Collaborative partner who can navigate conflict productively&lt;/li&gt;\n&lt;li&gt;Deep belief that creator success is our success—you consider both Kit and our customers in every recommendation&lt;/li&gt;\n&lt;li&gt;A “how might we” problem-solver who finds creative, business-aligned paths through legal challenges&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;&lt;strong&gt;What won’t set you up for success&lt;/strong&gt;&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;Needing a team of in-house peers or co-counsel to pressure-test every decision—you’ll be our sole in-house legal expert, with outside counsel available as needed&lt;/li&gt;\n&lt;li&gt;A strongly risk-averse or “no-before-yes” mindset—we need you to help us move, not just stop us from tripping&lt;/li&gt;\n&lt;li&gt;Thinking in a legal vacuum—if you’re not factoring in our goals, numbers, or creators, your advice won’t land&lt;/li&gt;\n&lt;li&gt;Struggling with speed or ownership—if you prefer long timelines or wait to be told what to do, this won’t be the right environment. We move quickly and expect people to take initiative, spot problems, and drive solutions.&lt;/li&gt;\n&lt;/ul&gt;\n&lt;h3&gt;&lt;strong&gt;Working hours and location&lt;/strong&gt;&lt;/h3&gt;\n&lt;p&gt;We&#39;re 100% remote with team members across the globe. For this role, we’re looking for someone &lt;strong&gt;located in the United States.&lt;/strong&gt;&lt;/p&gt;\n&lt;h3&gt;&lt;strong&gt;Compensation and benefits&lt;/strong&gt;&lt;/h3&gt;\n&lt;p&gt;Kit has standardized salaries based on position, no matter where you live. This role is an &lt;strong&gt;individual contributor&lt;/strong&gt; &lt;strong&gt;level 4 ($227,000) or 5 ($251,000).&lt;/strong&gt; Our other perks and benefits include:&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;&lt;a href=&quot;https://www.linkedin.com/posts/nathanbarry_convertkit-compensation-model-activity-6991414959247147008-i9V3/?utm_source=share&amp;amp;utm_medium=member_desktop&quot;&gt;Profit Sharing&lt;/a&gt;&lt;/li&gt;\n&lt;li&gt;Kit equity&lt;/li&gt;\n&lt;li&gt;401k with a 5% match&lt;/li&gt;\n&lt;li&gt;We cover up to $1,950 per month toward medical premiums, with dental and vision fully covered. We offer health insurance plans through Aetna.&lt;/li&gt;\n&lt;li&gt;$4,000 equipment allowance for your first two years, $3,000 every two years after&lt;/li&gt;\n&lt;li&gt;$3,500 annual learning and development budget&lt;/li&gt;\n&lt;li&gt;$3,000 annual childcare benefit&lt;/li&gt;\n&lt;li&gt;20 days paid time off per year&lt;/li&gt;\n&lt;li&gt;Paid paid vacation: $1,000 bonus for taking five consecutive days full unplugged&lt;/li&gt;\n&lt;li&gt;10 paid holidays per year&lt;/li&gt;\n&lt;li&gt;2 weeks of paid sick time each year, including mental health days&lt;/li&gt;\n&lt;li&gt;12 weeks paid parental leave with flexible scheduling&lt;/li&gt;\n&lt;li&gt;Up to 6 weeks of paid bereavement, medical, and disaster leave&lt;/li&gt;\n&lt;li&gt;Winter Break: Kit closes for a week at the end of December to give everyone a collective break to enjoy the holiday season. &lt;em&gt;Essential support services remain available, with teams coordinating to ensure coverage during this period&lt;/em&gt;&lt;/li&gt;\n&lt;li&gt;4 week paid sabbatical after 5 years with the team&lt;/li&gt;\n&lt;li&gt;Fantastic in-person team retreats 2x per year&lt;/li&gt;\n&lt;/ul&gt;\n&lt;h3&gt;&lt;strong&gt;Interview process&lt;/strong&gt;&lt;/h3&gt;\n&lt;p&gt;We know applying to jobs takes time and energy. Our goal is to run a clear and thoughtful process that respects your effort and gives you a real sense of what it’s like to work at Kit — from first hello to final decision.&amp;nbsp;&lt;/p&gt;\n&lt;p&gt;We typically receive a high volume of applications, but we aim to review all submissions within two weeks of your application submission. You’ll hear from us either way.&lt;/p&gt;\n&lt;p&gt;Here’s what our process usually looks like:&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;Recruiter phone screen&lt;/li&gt;\n&lt;li&gt;Hiring manager interview&lt;/li&gt;\n&lt;li&gt;Work sample&lt;/li&gt;\n&lt;li&gt;A cross-functional interview&amp;nbsp;&lt;/li&gt;\n&lt;li&gt;Board interview&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;To apply, complete the form on the next page—including your answers to a few short questions. &lt;strong&gt;We read every application. &lt;/strong&gt;Your responses help us understand your experience and how you think, beyond just what’s on your resume.&lt;/p&gt;\n&lt;p&gt;We’ll stay in touch throughout. Thanks for taking the time—we’re excited to meet you.&lt;/p&gt;&lt;div class=&quot;content-conclusion&quot;&gt;&lt;hr&gt;\n&lt;p&gt;&amp;nbsp;&lt;/p&gt;\n&lt;p&gt;Kit is an equal opportunity employer. We value diversity in all of its forms, and we hire the best person we can for each role, no matter your personal background. Research tells us that applicants who are female or non-binary, as well as applicants who are people of color, are less likely to apply for roles they do not feel 100% qualified for. If you think you meet more than 50% of our requirements but fewer than 100% of them, please apply. We’re imperfect communicators, so think of our job postings as the starting point for discussion rather than proof that you shouldn’t apply.&lt;/p&gt;\n&lt;p&gt;Kit does not discriminate on the basis of race, sex, color, religion, age, national origin, marital status, disability, veteran status, genetic information, sexual orientation, gender identity or any other reason prohibited by law in provision of employment opportunities and benefits.&lt;/p&gt;&lt;/div&gt;","tags":"[\"aws\",\"advertising\",\"legal\"]","pubDate":"2025-05-20T20:18:14.000Z","link":"https://job-boards.greenhouse.io/kit/jobs/4699729007","slug":"senior-legal-counsel-kit-7527"},{"id":4815983362,"title":"Senior Software Engineer (Gen AI)","company":"Clutch","image":"https://avatars.githubusercontent.com/u/69215121?s=200&v=4","description":"<h1><strong>About the Role</strong></h1><p style=\"min-height:1.5em\">We are looking for a forward-thinking Software Engineer to build cutting-edge generative AI systems driven by autonomous, multi-agent architectures. You’ll be hands-on with the latest LLMs and work at the intersection of systems design, AI behavior, and automation.</p><p style=\"min-height:1.5em\">This role offers the opportunity to invent novel interactions between intelligent agents and help define how they collaborate, learn, and evolve over time.</p><p style=\"min-height:1.5em\"></p><h1><strong>About the Team</strong></h1><ul style=\"min-height:1.5em\"><li><p style=\"min-height:1.5em\">We're a fast-moving, cross-functional team focused on applying Gen AI to real-world problems with measurable impact</p></li><li><p style=\"min-height:1.5em\">We value experimentation, ownership, and shipping functional prototypes quickly</p></li><li><p style=\"min-height:1.5em\">Our culture emphasizes collaboration, openness to new ideas, and constantly pushing the boundaries of what's possible with AI</p></li></ul><p style=\"min-height:1.5em\"></p><h1><strong>What You’ll Do</strong></h1><p style=\"min-height:1.5em\"></p><h2>Within 3 months, you will:</h2><ul style=\"min-height:1.5em\"><li><p style=\"min-height:1.5em\">Design and prototype agent-to-agent interaction protocols using LLMs like GPT-4 or Claude</p></li><li><p style=\"min-height:1.5em\">Implement and test agent behavior using LangChain, CrewAI, PydanticAI, or similar stacks</p></li><li><p style=\"min-height:1.5em\">Collaborate with product manager and data scientists to define system metrics and agent performance indicators</p></li><li><p style=\"min-height:1.5em\">Deploy your first multi-agent changes into a test environment</p></li></ul><h2>Within 6 months, you will:</h2><ul style=\"min-height:1.5em\"><li><p style=\"min-height:1.5em\">Develop scalable orchestration system enabling complex task decomposition among agents</p></li><li><p style=\"min-height:1.5em\">Run experiments comparing agent behaviors under different prompting and architecture strategies</p></li><li><p style=\"min-height:1.5em\">Begin integrating external APIs and data pipelines into your agent ecosystem, including systems that support credit unions to fully automate common user queries</p></li></ul><h2>Within 9 months, you will:</h2><ul style=\"min-height:1.5em\"><li><p style=\"min-height:1.5em\">As a true teammate, continuously improve the team’s processes, brainstorm ideas, and communicate statuses, and progress</p></li><li><p style=\"min-height:1.5em\">Mentor junior engineers and contribute to the technical vision of the Gen AI platform.</p></li><li><p style=\"min-height:1.5em\">Lead and deliver a small-scoped project independently</p></li><li><p style=\"min-height:1.5em\">Build trust with external stakeholders by communicating technical constraints effectively</p></li></ul><h1><strong>What You’ll Bring</strong></h1><ul style=\"min-height:1.5em\"><li><p style=\"min-height:1.5em\">Strong software engineering skills with a focus on writing high-quality, maintainable code in Python and TypeScript</p></li><li><p style=\"min-height:1.5em\">Experience working with LLMs and generative AI APIs (e.g., OpenAI, Anthropic)</p></li><li><p style=\"min-height:1.5em\">Ability to rapidly prototype, experiment, and iterate in ambiguous problem spaces</p></li><li><p style=\"min-height:1.5em\">Is engaged with the use of LLMs tools like to accomplish their own tasks (e.g., Cursor, ChatGPT) </p></li><li><p style=\"min-height:1.5em\">Familiarity with frameworks like LangChain, CrewAI, PydanticAI, or similar</p></li><li><p style=\"min-height:1.5em\">Passion for building autonomous systems and solving problems creatively</p></li><li><p style=\"min-height:1.5em\">Plus: Previously worked with Integrations</p></li><li><p style=\"min-height:1.5em\">Plus: Understanding of distributed systems or intelligent agent-based architectures</p></li></ul><p style=\"min-height:1.5em\"><em>Please note that this role may evolve as our business needs change, so we appreciate your flexibility and adaptability.</em></p><p style=\"min-height:1.5em\"><strong>What’s In It For You?</strong></p><ul style=\"min-height:1.5em\"><li><p style=\"min-height:1.5em\"><strong>Remote Flexibility:</strong> Enjoy the freedom of remote work from anywhere, balancing life and career seamlessly.</p></li><li><p style=\"min-height:1.5em\"><strong>Unforgettable Off-Sites:</strong> Twice a year, bond with colleagues in exciting destinations, fostering teamwork and fresh ideas.</p></li><li><p style=\"min-height:1.5em\"><strong>Paid Time Off and National Holidays:</strong> Enjoy 20 PTO days yearly and the National Holidays for relaxation and rejuvenation.</p></li><li><p style=\"min-height:1.5em\"><strong>Stock Options:</strong> Joining us means having a stake in our success, so you'll receive stock options as part of your compensation package.</p></li><li><p style=\"min-height:1.5em\"><strong>Home Office Setup:</strong> Create your ideal workspace with a dedicated budget for home office essentials.</p></li><li><p style=\"min-height:1.5em\"><strong>Work Trip Budget:</strong> Grow personally and professionally with a budget for work-related trips and co-working.</p></li></ul><p style=\"min-height:1.5em\"><strong>About Us</strong></p><p style=\"min-height:1.5em\"><strong>Clutch</strong> is a revolutionary vertical SaaS company, proudly backed by Andreessen Horowitz (A16z), aimed at revolutionizing the way Credit Unions engage and change the lives of their members. As a champion of financial well-being, we address the urgent need for affordable lending solutions in an era where the average American grapples with over $155,000 in household debt.  Unlike traditional financial institutions, Clutch develops software to turn Credit Unions into FinTech lenders and leverage their balance sheets to responsibly lend to over 130M Americans. Our mission extends beyond mere financial transactions; we strive to fundamentally enhance the way credit unions interact with their members. By integrating cutting-edge technologies and user-centric designs, we help credit unions provide seamless digital experiences that are on par with leading tech companies. This approach not only preserves but revitalizes the longstanding tradition of community and member-focused service inherent to credit unions.</p><p style=\"min-height:1.5em\"><strong>Please note:</strong> This position is offered on a contractor basis. Applicants must have the necessary documentation and authorization to work in the country where the job is located. Clutch cannot provide sponsorship or assist with obtaining work permits for this role.<br /><br /><strong>A Note About AI at Clutch</strong><br />We love AI. We use it often and encourage our team to creatively and effectively leverage AI tools in their work. If you join Clutch, we hope you'll bring the same enthusiasm for exploring how AI can amplify impact, productivity, and innovation.<br /><br />That said, during the interview process, <strong>we want to hear </strong><em><strong>your</strong></em><strong> thoughts</strong>. Please approach interviews without the use of AI tools—our goal is to get to know how <em>you</em> think, solve problems, and communicate. Once you're in the seat, bring on the prompts!</p>","tags":"[\"python\",\"typescript\",\"scala\",\"llm\"]","pubDate":"2025-05-20T18:15:58.734Z","link":"https://jobs.ashbyhq.com/withclutch/5ced4b34-774b-4c50-be14-1b4f3772d0c4","slug":"senior-software-engineer-gen-ai-clutch-1894"},{"id":9470059251,"title":"Senior Software Engineer (Infrastructure)","company":"Clutch","image":"https://avatars.githubusercontent.com/u/69215121?s=200&v=4","description":"<h1><strong>About the Role</strong></h1><p style=\"min-height:1.5em\">As part of the Infrastructure Team, you will be part of a team that drives the implementation of core cloud infrastructure components and infrastructure/platform for cloud-native applications, creates tools and services that power our Engineering teams, and collaborates with them, influencing the design and delivery of our footprint.</p><p style=\"min-height:1.5em\"></p><h1><strong>About the Team</strong></h1><p style=\"min-height:1.5em\">The Security, Infrastructure &amp; Platform team is a multidisciplinary group focused on scaling our systems securely and efficiently.</p><ul style=\"min-height:1.5em\"><li><p style=\"min-height:1.5em\">We value pragmatism, ownership, and curiosity — always asking “how can we make this safer and faster?”</p></li><li><p style=\"min-height:1.5em\">We’re building a security-first engineering culture that doesn't slow teams down, but enables them to move fast responsibly.</p></li></ul><p style=\"min-height:1.5em\">The Cloud Infrastructure team provides the components that enable engineering productivity. You will work on building and maintaining cloud-native infrastructure through infrastructure as code, create toolsets and services for the delivery of applications and infrastructure components. Some of these components include container orchestration platforms like ECS, container provisioning engines, configuration and secrets management, provisioning Terraform modules, managing and updating database systems and others.</p><p style=\"min-height:1.5em\"></p><h1><strong>What You’ll Do</strong></h1><p style=\"min-height:1.5em\"></p><h2>Within 3 months, you will:</h2><ul style=\"min-height:1.5em\"><li><p style=\"min-height:1.5em\">Dive deep into our existing cloud setup (AWS) and IaC (Terraform) to understand how services are deployed, secured, and monitored</p></li><li><p style=\"min-height:1.5em\">Improve or refactor CI/CD pipelines (GitHub Actions or similar) to reduce friction and improve deployment speed</p></li><li><p style=\"min-height:1.5em\">Implement guardrails for infrastructure changes, including cost visibility, IAM controls, and policy-as-code</p></li><li><p style=\"min-height:1.5em\">Work closely with developers to troubleshoot platform issues and ensure smooth delivery of features</p></li></ul><h2>Within 6 months, you will:</h2><ul style=\"min-height:1.5em\"><li><p style=\"min-height:1.5em\">Lead the redesign or scaling of key infrastructure components — such as networking, container orchestration (e.g., EKS), or secrets management</p></li><li><p style=\"min-height:1.5em\">Roll out infrastructure blueprints (e.g., templates for new services, databases, queues) with built-in security, monitoring, and scaling defaults</p></li><li><p style=\"min-height:1.5em\">Own and evolve our observability stack, improving logs, metrics, traces, and alerting standards across teams</p></li><li><p style=\"min-height:1.5em\">Drive cost-efficiency efforts by identifying cloud spend bottlenecks and setting up automated monitoring</p></li></ul><h2>Within 9 months, you will:</h2><ul style=\"min-height:1.5em\"><li><p style=\"min-height:1.5em\">Co-own the internal platform roadmap and collaborate with engineering leads to prioritize developer experience improvements</p></li><li><p style=\"min-height:1.5em\">Help design and implement multi-environment strategies (e.g., preview environments, canary deploys, infra versioning)</p></li><li><p style=\"min-height:1.5em\">Act as a subject matter expert in SRE and cloud security, supporting incident reviews and contributing to infra hardening</p></li><li><p style=\"min-height:1.5em\">Contribute to our long-term infra evolution, from managed services to self-hosted components, based on business needs</p></li></ul><p style=\"min-height:1.5em\"></p><h1><strong>What You’ll Bring</strong></h1><ul style=\"min-height:1.5em\"><li><p style=\"min-height:1.5em\">Experience working with AWS.</p></li><li><p style=\"min-height:1.5em\">Understanding of cloud networking concepts like VPCs, load balancers, etc.</p></li><li><p style=\"min-height:1.5em\">Hands-on experience with container technologies like Docker.</p></li><li><p style=\"min-height:1.5em\">Understanding about cloud security concepts, specifically IAM roles and policies, encryption keys, security groups, etc.</p></li><li><p style=\"min-height:1.5em\">Experience working with infrastructure as code tools such as Terraform.</p></li><li><p style=\"min-height:1.5em\">Ability to code in at least one language/script language (e.g. Ruby, Python, Golang, Bash etc.)</p></li><li><p style=\"min-height:1.5em\">Experience with relational databases like PostgreSQL is a nice to have.</p></li><li><p style=\"min-height:1.5em\">Experience with continuous integration and continuous delivery pipelines using tools like Github Actions or CircleCI.</p></li></ul><p style=\"min-height:1.5em\"><em>Please note that this role may evolve as our business needs change, so we appreciate your flexibility and adaptability.</em></p><p style=\"min-height:1.5em\"><strong>What’s In It For You?</strong></p><ul style=\"min-height:1.5em\"><li><p style=\"min-height:1.5em\"><strong>Remote Flexibility:</strong> Enjoy the freedom of remote work from anywhere, balancing life and career seamlessly.</p></li><li><p style=\"min-height:1.5em\"><strong>Unforgettable Off-Sites:</strong> Twice a year, bond with colleagues in exciting destinations, fostering teamwork and fresh ideas.</p></li><li><p style=\"min-height:1.5em\"><strong>Paid Time Off and National Holidays:</strong> Enjoy 20 PTO days yearly and the National Holidays for relaxation and rejuvenation.</p></li><li><p style=\"min-height:1.5em\"><strong>Stock Options:</strong> Joining us means having a stake in our success, so you'll receive stock options as part of your compensation package.</p></li><li><p style=\"min-height:1.5em\"><strong>Home Office Setup:</strong> Create your ideal workspace with a dedicated budget for home office essentials.</p></li><li><p style=\"min-height:1.5em\"><strong>Work Trip Budget:</strong> Grow personally and professionally with a budget for work-related trips and co-working.</p></li></ul><p style=\"min-height:1.5em\"><strong>About Us</strong></p><p style=\"min-height:1.5em\"><strong>Clutch</strong> is a revolutionary vertical SaaS company, proudly backed by Andreessen Horowitz (A16z), aimed at revolutionizing the way Credit Unions engage and change the lives of their members. As a champion of financial well-being, we address the urgent need for affordable lending solutions in an era where the average American grapples with over $155,000 in household debt.  Unlike traditional financial institutions, Clutch develops software to turn Credit Unions into FinTech lenders and leverage their balance sheets to responsibly lend to over 130M Americans. Our mission extends beyond mere financial transactions; we strive to fundamentally enhance the way credit unions interact with their members. By integrating cutting-edge technologies and user-centric designs, we help credit unions provide seamless digital experiences that are on par with leading tech companies. This approach not only preserves but revitalizes the longstanding tradition of community and member-focused service inherent to credit unions.</p><p style=\"min-height:1.5em\"><strong>Please note:</strong> This position is offered on a contractor basis. Applicants must have the necessary documentation and authorization to work in the country where the job is located. Clutch cannot provide sponsorship or assist with obtaining work permits for this role.<br /><br /><strong>A Note About AI at Clutch</strong><br />We love AI. We use it often and encourage our team to creatively and effectively leverage AI tools in their work. If you join Clutch, we hope you'll bring the same enthusiasm for exploring how AI can amplify impact, productivity, and innovation.<br /><br />That said, during the interview process, <strong>we want to hear </strong><em><strong>your</strong></em><strong> thoughts</strong>. Please approach interviews without the use of AI tools—our goal is to get to know how <em>you</em> think, solve problems, and communicate. Once you're in the seat, bring on the prompts!</p>","tags":"[\"postgres\",\"docker\",\"aws\",\"python\",\"golang\",\"ruby\"]","pubDate":"2025-05-20T18:05:15.701Z","link":"https://jobs.ashbyhq.com/withclutch/e203972d-ddb8-42ca-8838-fceafbdcd25b","slug":"senior-software-engineer-infrastructure-clutch-8304"},{"id":5412754920,"title":"Senior Software Engineer (Security)","company":"Clutch","image":"https://avatars.githubusercontent.com/u/69215121?s=200&v=4","description":"<h1><strong>About the Role</strong></h1><p style=\"min-height:1.5em\">As a Senior Software Security Engineer at Clutch, you will play a critical role in shaping and executing our application and infrastructure security posture. You’ll be embedded in engineering, driving secure-by-design practices, threat modeling, and proactive risk mitigation. This is a hands-on role for someone passionate about building secure systems and influencing security culture across a fast-paced fintech startup.</p><p style=\"min-height:1.5em\">You’ll act as a key advisor for secure architecture and be responsible for identifying, fixing, and preventing vulnerabilities in our services, tooling, and developer workflows.</p><p style=\"min-height:1.5em\"></p><h1><strong>About the Team</strong></h1><p style=\"min-height:1.5em\">The Security, Infrastructure &amp; Platform team is a multidisciplinary group focused on scaling our systems securely and efficiently.</p><ul style=\"min-height:1.5em\"><li><p style=\"min-height:1.5em\">We partner closely with product engineering to embed security throughout the SDLC.</p></li><li><p style=\"min-height:1.5em\">We value pragmatism, ownership, and curiosity — always asking “how can we make this safer and faster?”</p></li><li><p style=\"min-height:1.5em\">We’re building a security-first engineering culture that doesn't slow teams down, but enables them to move fast responsibly.</p></li></ul><p style=\"min-height:1.5em\"></p><h1><strong>What You’ll Do</strong></h1><p style=\"min-height:1.5em\"></p><h2>Within 3 months, you will:</h2><ul style=\"min-height:1.5em\"><li><p style=\"min-height:1.5em\">Embed with engineering teams to review and co-develop security-critical features, providing practical guidance on secure design and implementation.</p></li><li><p style=\"min-height:1.5em\">Perform code and architecture reviews focused on identifying and mitigating risks in our backend services and web applications.</p></li><li><p style=\"min-height:1.5em\">Integrate developer-friendly security tooling (SAST, SCA, secret scanners) into our CI/CD pipelines and improve feedback loops.</p></li><li><p style=\"min-height:1.5em\">Work closely with developers to fix early security issues, promote secure coding standards, and minimize recurring vulnerabilities.</p></li></ul><h2>Within 6 months, you will:</h2><ul style=\"min-height:1.5em\"><li><p style=\"min-height:1.5em\">Lead the design and rollout of a developer-focused Secure SDLC, with actionable security gates and clear ownership per stage.</p></li><li><p style=\"min-height:1.5em\">Collaborate with product and engineering to build features securely by default, including auth, encryption, and access control layers.</p></li><li><p style=\"min-height:1.5em\">Build internal tools or contribute to platform codebases to help automate threat detection or harden developer workflows.</p></li><li><p style=\"min-height:1.5em\">Launch an internal security knowledge base or playbook, based on real scenarios and tailored to Clutch’s tech stack and dev needs.</p></li></ul><h2>Within 9 months, you will:</h2><ul style=\"min-height:1.5em\"><li><p style=\"min-height:1.5em\">Develop and maintain secure libraries and frameworks used across engineering (e.g., auth modules, secure wrappers, input validators).</p></li><li><p style=\"min-height:1.5em\">Contribute code and reviews to critical systems or developer tooling, ensuring security is deeply integrated — not bolted on.</p></li><li><p style=\"min-height:1.5em\">Support and mentor a security champion network inside engineering teams to scale knowledge and influence through code.</p></li><li><p style=\"min-height:1.5em\">Partner with developers to threat model new services and architecture evolutions, helping teams make informed trade-offs.</p></li></ul><p style=\"min-height:1.5em\"></p><h1><strong>What You’ll Bring</strong></h1><ul style=\"min-height:1.5em\"><li><p style=\"min-height:1.5em\">5+ years of experience in software/application security, ideally in fast-growing startups or fintech environments.</p></li><li><p style=\"min-height:1.5em\">Deep knowledge of web application security, secure software design, API hardening, and threat modeling.</p></li><li><p style=\"min-height:1.5em\">Experience integrating security into CI/CD pipelines, including use of SAST, DAST, SCA, and IaC scanning tools.</p></li><li><p style=\"min-height:1.5em\">Familiarity with common compliance frameworks (e.g., SOC 2, GLBA, PCI-DSS) and cloud-native security (AWS, GCP preferred).</p></li><li><p style=\"min-height:1.5em\">Strong coding background (e.g., Node.js, Python, Go) and ability to read, understand, and debug code securely.</p></li><li><p style=\"min-height:1.5em\">Excellent communication skills, with the ability to influence without authority and foster cross-functional collaboration.</p></li></ul><p style=\"min-height:1.5em\"><em>Please note that this role may evolve as our business needs change, so we appreciate your flexibility and adaptability.</em></p><p style=\"min-height:1.5em\"><strong>What’s In It For You?</strong></p><ul style=\"min-height:1.5em\"><li><p style=\"min-height:1.5em\"><strong>Remote Flexibility:</strong> Enjoy the freedom of remote work from anywhere, balancing life and career seamlessly.</p></li><li><p style=\"min-height:1.5em\"><strong>Unforgettable Off-Sites:</strong> Twice a year, bond with colleagues in exciting destinations, fostering teamwork and fresh ideas.</p></li><li><p style=\"min-height:1.5em\"><strong>Paid Time Off and National Holidays:</strong> Enjoy 20 PTO days yearly and the National Holidays for relaxation and rejuvenation.</p></li><li><p style=\"min-height:1.5em\"><strong>Stock Options:</strong> Joining us means having a stake in our success, so you'll receive stock options as part of your compensation package.</p></li><li><p style=\"min-height:1.5em\"><strong>Home Office Setup:</strong> Create your ideal workspace with a dedicated budget for home office essentials.</p></li><li><p style=\"min-height:1.5em\"><strong>Work Trip Budget:</strong> Grow personally and professionally with a budget for work-related trips and co-working.</p></li></ul><p style=\"min-height:1.5em\"><strong>About Us</strong></p><p style=\"min-height:1.5em\"><strong>Clutch</strong> is a revolutionary vertical SaaS company, proudly backed by Andreessen Horowitz (A16z), aimed at revolutionizing the way Credit Unions engage and change the lives of their members. As a champion of financial well-being, we address the urgent need for affordable lending solutions in an era where the average American grapples with over $155,000 in household debt.  Unlike traditional financial institutions, Clutch develops software to turn Credit Unions into FinTech lenders and leverage their balance sheets to responsibly lend to over 130M Americans. Our mission extends beyond mere financial transactions; we strive to fundamentally enhance the way credit unions interact with their members. By integrating cutting-edge technologies and user-centric designs, we help credit unions provide seamless digital experiences that are on par with leading tech companies. This approach not only preserves but revitalizes the longstanding tradition of community and member-focused service inherent to credit unions.</p><p style=\"min-height:1.5em\"><strong>Please note:</strong> This position is offered on a contractor basis. Applicants must have the necessary documentation and authorization to work in the country where the job is located. Clutch cannot provide sponsorship or assist with obtaining work permits for this role.<br /><br /><strong>A Note About AI at Clutch</strong><br />We love AI. We use it often and encourage our team to creatively and effectively leverage AI tools in their work. If you join Clutch, we hope you'll bring the same enthusiasm for exploring how AI can amplify impact, productivity, and innovation.<br /><br />That said, during the interview process, <strong>we want to hear </strong><em><strong>your</strong></em><strong> thoughts</strong>. Please approach interviews without the use of AI tools—our goal is to get to know how <em>you</em> think, solve problems, and communicate. Once you're in the seat, bring on the prompts!</p>","tags":"[\"aws\",\"node.js\",\"python\"]","pubDate":"2025-05-20T17:48:57.254Z","link":"https://jobs.ashbyhq.com/withclutch/4084e333-888e-4c40-8bee-305ebc02a3db","slug":"senior-software-engineer-security-clutch-8806"},{"id":7956426002,"title":"Project Coordinator","company":"Circle","image":"https://circle.so/apple-icon.png","description":"&lt;div class=&quot;content-intro&quot;&gt;&lt;h2&gt;About Us&lt;/h2&gt;\n&lt;p&gt;Circle is building the world’s leading all-in-one platform for online communities. We make it possible for creators, coaches, educators, and businesses to bring together their audience with engaging discussions, live streams, events, chat, courses, and payments — all in one place, all under their own brand.&lt;/p&gt;\n&lt;p&gt;We’re proud to be a fully remote company of around 180 (and growing!) team members from 30+ countries around the world. We seek exceptional individuals around the world, set them up to do the best work of their lives, and in turn, create a meaningful impact in their own lives. We don&#39;t track hours, but we do manage for high expectations very closely. We collaborate across time zones, are highly async, and like to document a lot.&lt;/p&gt;\n&lt;p&gt;Twice a year, we bring the whole company together in beautiful places around the world for our company offsites. So far, we’ve hosted offsites in Turkey, Portugal, Mexico, Thailand, Colombia, Italy, Ireland, and more, with still more to come!&lt;/p&gt;&lt;/div&gt;&lt;h2&gt;About the role&lt;/h2&gt;\n&lt;p&gt;&lt;/p&gt;\n&lt;p&gt;We are looking for a Project Coordinator to join our team to play an instrumental role in helping us deliver key services offered today to customers: Circle Plus mobile app launches. Our Circle Plus customer segments is continuing to see explosive growth and it’s time we expand the team.&lt;/p&gt;\n&lt;p&gt;You’ll have a unique opportunity to work cross-functionally alongside almost every department at Circle (engineering, design, sales, customer success, and customer support) to help our customers build, launch, and maintain their mobile apps in the Google Play Store and Apple App Store.&lt;/p&gt;\n&lt;p&gt;&lt;/p&gt;\n&lt;h2&gt;What you&#39;ll be doing&lt;/h2&gt;\n&lt;p&gt;&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;Be the main point of contact for anything related to a customer’s Circle Plus app launch. You’ll coordinate the app submission process from end-to-end and own all aspects of project planning, tracking, and communications. &lt;strong&gt;See more on the app submission process below.&lt;/strong&gt;&lt;/li&gt;\n&lt;li&gt;Proactively handling schedule and scope changes, identifying risks, and managing escalations throughout the app submission process.&lt;/li&gt;\n&lt;li&gt;Partnering closely with other internal stakeholders to share feedback and experiences that help us improve our customers experience on Circle.&lt;/li&gt;\n&lt;li&gt;Spotting inefficiencies in the way we do things, identifying problems, proposing solutions, and leading process improvement projects to root out inefficiencies.&lt;/li&gt;\n&lt;li&gt;Maintaining a deep understanding of the Circle platform and our white-labelled apps, and making recommendations on how customers can use it to accelerate their desired outcomes.&lt;/li&gt;\n&lt;li&gt;Partner closely with Customer Success Managers to communicate proactively and collaborate to ensure customers migrations and launches are a seamless experience.&lt;/li&gt;\n&lt;li&gt;Work directly with both new and existing customers on assessing project requirements &amp;amp; feasibility, helping them understand key changes alongside migrations and owning project execution &amp;amp; communication from end-to-end.&lt;/li&gt;\n&lt;li&gt;Documenting key processes and implementing necessary changes as needed based on efficiency improvements or platform changes that require adjustments to our services&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;&lt;/p&gt;\n&lt;h3&gt;What goes on during the app submission process?&lt;/h3&gt;\n&lt;ul&gt;\n&lt;li&gt;Outlining the app submission process to customers&lt;/li&gt;\n&lt;li&gt;Setting expectations with customers about the app submission process&lt;/li&gt;\n&lt;li&gt;Helping customers set up their app accounts&lt;/li&gt;\n&lt;li&gt;Coordinating the design asset process on behalf of our customers&lt;/li&gt;\n&lt;li&gt;Submitting the apps into the Apple app store / Google play store&lt;/li&gt;\n&lt;li&gt;Maintaining the apps when updates are needed&lt;/li&gt;\n&lt;/ul&gt;\n&lt;h2&gt;What you&#39;ll need to be successful&lt;/h2&gt;\n&lt;ul&gt;\n&lt;li&gt;Strong alignment with our values, &lt;a href=&quot;https://circle.so/careers&quot;&gt;find our values on our career page&lt;/a&gt; if you haven’t read up on them yet&lt;/li&gt;\n&lt;li&gt;You are proficient in English (spoken, written, and reading) at a &lt;a href=&quot;https://magoosh.com/english-speaking/english-proficiency-levels-a-guide-to-determining-your-level/&quot;&gt;CEFR Level C2&lt;/a&gt; / &lt;a href=&quot;https://www.govtilr.org/&quot;&gt;ILR Level 5&lt;/a&gt;.&lt;/li&gt;\n&lt;li&gt;You have 2+ years of experience working as a project coordinator, project manager, implementation partner, or any role that has managed processes end-to-end with customers.&lt;/li&gt;\n&lt;li&gt;You have worked in a similar role at a SaaS company, ideally that serves SMB businesses with a high-volume of customers.&lt;/li&gt;\n&lt;li&gt;You’re resourceful. You may not have all the answers, but you know how to find them.&lt;/li&gt;\n&lt;li&gt;You’re committed to making sure the customer has an enjoyable experience throughout each step in their journey and are constantly thinking about ways to improve it.&lt;/li&gt;\n&lt;li&gt;You’re a team player, with a high level of integrity and desire to assist your team. You enjoy working with cross-functional teams and are able to effectively balance competing priorities to make decisions that best support the customer, the team, and Circle.&lt;/li&gt;\n&lt;li&gt;You have an aptitude for digesting and effectively communicating technical concepts across audiences of varying technical ability.&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;&lt;/p&gt;\n&lt;h2&gt;Bonus points&lt;/h2&gt;\n&lt;ul&gt;\n&lt;li&gt;Experience setting up integrations and understanding how systems communicate with each other.&lt;/li&gt;\n&lt;/ul&gt;\n&lt;h2&gt;$75,000 - $90,000 USD per year&lt;/h2&gt;\n&lt;p&gt;&lt;em&gt;The cash compensation range shown is a starting point. In addition to equity, benefits and perks, your cash compensation is subject to an annual review and increase on a once per year basis.&lt;/em&gt;&lt;/p&gt;&lt;div class=&quot;content-conclusion&quot;&gt;&lt;h2&gt;The fun stuff&lt;/h2&gt;\n&lt;ul&gt;\n&lt;li&gt;Fully remote:&amp;nbsp;work from anywhere in the world!&lt;/li&gt;\n&lt;li&gt;Autonomy and trust to do your job:&amp;nbsp;we care about outcomes over everything else.&lt;/li&gt;\n&lt;li&gt;Paid time away:&amp;nbsp;all employees are given 35 days of PTO annually. We also offer a paid sabbatical after 5 years.&lt;/li&gt;\n&lt;li&gt;Generous U.S. benchmarked compensation&amp;nbsp;and startup equity no matter where you are in the world.*&lt;/li&gt;\n&lt;li&gt;Awesome medical coverage&amp;nbsp;with 100% coverage for you and your family, or medical reimbursement options where applicable!*&lt;/li&gt;\n&lt;li&gt;Parental leave&amp;nbsp;for parents expanding their family, or just starting one.&lt;/li&gt;\n&lt;li&gt;Home office stipend&amp;nbsp;to help you get up and running.&lt;/li&gt;\n&lt;li&gt;Learning &amp;amp; development stipend&amp;nbsp;to help you level up your professional skills.&lt;/li&gt;\n&lt;li&gt;Annual bonus potential&amp;nbsp;for roles that don&#39;t already receive variable income or commission.&lt;/li&gt;\n&lt;li&gt;Company retreats:&amp;nbsp;Twice a year, the Circle team gets together for a fully paid company retreat in incredible places around the world! We’ve had past retreats in Colombia, Portugal, and Mexico, with more planned on the horizon.&lt;/li&gt;\n&lt;li&gt;Check out our&amp;nbsp;&lt;a href=&quot;https://careers.circle.so/&quot;&gt;Careers&lt;/a&gt;&amp;nbsp;page for more.&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;&lt;span style=&quot;font-size: 10pt;&quot;&gt;*&lt;em&gt;Your role, location and unique circumstance may affect this.&lt;/em&gt;&lt;/span&gt;&lt;/p&gt;\n&lt;h3&gt;Diversity, Equity &amp;amp; Inclusion&lt;/h3&gt;\n&lt;p&gt;As a fully-remote international company, diversity is baked into our DNA. Here’s how our CEO, Sid Yadav, frames our hiring mission: “let’s find talent in underserved and under-represented corners of the world, set them up to do the best work of their lives, and in turn, change their life.” To achieve this hiring mission, we offer competitive&amp;nbsp;U.S. benchmarked&amp;nbsp;compensation no matter where someone’s located in the world, and we proactively seek candidates who expand representation of backgrounds, cultures and lived experiences in our teams.&lt;/p&gt;\n&lt;h3&gt;Equal Employment Opportunity&lt;/h3&gt;\n&lt;p&gt;Circle is an equal opportunity employer and as such, we do not discriminate on the basis of race, color, religion, sex, sexual orientation, gender identity, national origin, age, disability, or any other characteristic protected by applicable laws.&amp;nbsp;If you require any accommodations during the recruitment process, please let us know and we will work with you to meet your needs.&lt;/p&gt;\n&lt;div class=&quot;&quot;&gt;\n&lt;h3 class=&quot;&quot;&gt;How We Use Candidate Data&lt;/h3&gt;\n&lt;p&gt;At Circle, we are committed to protecting your personal information. As a job applicant, the personal data you provide to us is collected and processed in accordance with the&amp;nbsp;&lt;strong&gt;General Data Protection Regulation (GDPR)&lt;/strong&gt; in the EU and the &lt;strong&gt;California Consumer Privacy Act (CCPA)&lt;/strong&gt;. This notice outlines the types of personal information we collect, the purpose for collecting it, and your rights.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Information We Collect:&lt;/strong&gt; We collect the following categories of personal information from job applicants:&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;Contact information (such as name, email address, phone number)&lt;/li&gt;\n&lt;li&gt;Employment history and qualifications&lt;/li&gt;\n&lt;li&gt;Education history&lt;/li&gt;\n&lt;li&gt;References and any other information you choose to share with us during the application process&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;&lt;strong&gt;Purpose of Collection:&lt;/strong&gt; We collect this information for the following purposes:&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;To assess your qualifications and suitability for the position&lt;/li&gt;\n&lt;li&gt;To communicate with you during the recruitment process&lt;/li&gt;\n&lt;li&gt;To comply with legal and regulatory obligations&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;&lt;strong&gt;Your Rights Under GDPR and CCPA:&lt;/strong&gt; You have the following rights regarding your personal information:&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;The right to request access to the personal information we hold about you.&lt;/li&gt;\n&lt;li&gt;The right to request the deletion of your personal information, subject to certain legal exceptions.&lt;/li&gt;\n&lt;li&gt;The right to opt out of the sale of your personal information (Note: We do not sell personal information).&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;For more information about how we handle your personal data or to exercise your rights, please refer to our full &lt;a href=&quot;https://circle.so/privacy&quot; target=&quot;_blank&quot;&gt;Privacy Policy&lt;/a&gt;.&lt;/p&gt;\n&lt;p&gt;By submitting your application, you acknowledge that you have read and understood this privacy notice.&lt;/p&gt;\n&lt;/div&gt;&lt;/div&gt;","tags":"[\"aws\",\"scala\",\"legal\"]","pubDate":"2025-05-20T16:30:28.000Z","link":"https://job-boards.greenhouse.io/circleso/jobs/4699926008","slug":"project-coordinator-circle-8770"},{"id":7982997955,"title":"Customer Success Engineer - EMEA","company":"Fingerprint","image":"https://avatars.githubusercontent.com/u/67208791?s=200&v=4","description":"&lt;div class=&quot;content-intro&quot;&gt;&lt;p&gt;&lt;strong&gt;Fingerprint&lt;/strong&gt;&amp;nbsp;empowers developers to stop online fraud at the source.&lt;/p&gt;\n&lt;p&gt;We work on turning radical new ideas in the fraud detection space into reality. Our products are developer-focused and our clients range from solo developers to publicly traded companies.&amp;nbsp;&lt;strong&gt;We are a globally dispersed, 100% remote company&lt;/strong&gt; with a strong open-source focus. Our flagship open-source project is &lt;a class=&quot;c-link c-link--focus-visible&quot; href=&quot;https://github.com/fingerprintjs/fingerprintjs&quot; target=&quot;_blank&quot; data-stringify-link=&quot;https://github.com/fingerprintjs/fingerprintjs&quot; data-sk=&quot;tooltip_parent&quot;&gt;FingerprintJS&lt;/a&gt; (20K stars on GitHub).&lt;/p&gt;\n&lt;p&gt;&lt;a class=&quot;c-link c-link--focus-visible&quot; href=&quot;https://www.crunchbase.com/organization/fingerprintjs&quot; target=&quot;_blank&quot; data-stringify-link=&quot;https://www.crunchbase.com/organization/fingerprintjs&quot; data-sk=&quot;tooltip_parent&quot;&gt;We have raised $77M&amp;nbsp;&lt;/a&gt;and are backed by Craft Ventures (previously invested in&amp;nbsp;&lt;a class=&quot;c-link c-link--focus-visible&quot; href=&quot;https://www.tesla.com/&quot; target=&quot;_blank&quot; data-stringify-link=&quot;https://www.tesla.com/&quot; data-sk=&quot;tooltip_parent&quot;&gt;Tesla,&amp;nbsp;&lt;/a&gt;&lt;a class=&quot;c-link c-link--focus-visible&quot; href=&quot;https://facebook.com/&quot; target=&quot;_blank&quot; data-stringify-link=&quot;https://facebook.com/&quot; data-sk=&quot;tooltip_parent&quot;&gt;Facebook,&amp;nbsp;&lt;/a&gt;&lt;a class=&quot;c-link c-link--focus-visible&quot; href=&quot;https://www.airbnb.com/&quot; target=&quot;_blank&quot; data-stringify-link=&quot;https://www.airbnb.com/&quot; data-sk=&quot;tooltip_parent&quot;&gt;Airbnb&amp;nbsp;&lt;/a&gt;), Nexus Venture Partners (previously invested in &lt;a href=&quot;https://www.postman.com/&quot;&gt;Postman&lt;/a&gt;, &lt;a href=&quot;https://www.apollo.io/&quot;&gt;Apollo.io,&lt;/a&gt; &lt;a href=&quot;https://min.io/&quot;&gt;MinIO&lt;/a&gt;, Druva)&amp;nbsp;and Uncorrelated Ventures (previously invested in&amp;nbsp;&lt;a class=&quot;c-link c-link--focus-visible&quot; href=&quot;https://redis.io/&quot; target=&quot;_blank&quot; data-stringify-link=&quot;https://redis.io/&quot; data-sk=&quot;tooltip_parent&quot;&gt;Redis,&amp;nbsp;&lt;/a&gt;&lt;a class=&quot;c-link c-link--focus-visible&quot; href=&quot;https://rollbar.com/&quot; target=&quot;_blank&quot; data-stringify-link=&quot;https://rollbar.com/&quot; data-sk=&quot;tooltip_parent&quot;&gt;Rollbar&amp;nbsp;&lt;/a&gt;&amp;amp;&lt;a class=&quot;c-link c-link--focus-visible&quot; href=&quot;https://gradle.org/&quot; target=&quot;_blank&quot; data-stringify-link=&quot;https://gradle.org/&quot; data-sk=&quot;tooltip_parent&quot;&gt;&amp;nbsp;Gradle&lt;/a&gt;).&lt;/p&gt;\n&lt;p&gt;&lt;em&gt;We have noticed a rise in recruiting impersonations across the industry, where scammers attempt to access candidates&#39; personal and financial information through fake interviews and offers. All Fingerprint recruiting email communications will always come from the @fingerprint.com domain. Any outreach claiming to be from Fingerprint via other sources should be ignored.&lt;/em&gt;&lt;/p&gt;\n&lt;p&gt;&amp;nbsp;&lt;/p&gt;\n&lt;hr&gt;\n&lt;p&gt;&amp;nbsp;&lt;/p&gt;\n&lt;p&gt;&amp;nbsp;&lt;/p&gt;\n&lt;p&gt;&amp;nbsp;&lt;/p&gt;&lt;/div&gt;&lt;p&gt;As a &lt;strong&gt;Customer Success Engineer&lt;/strong&gt; at Fingerprint, you’ll have the opportunity to become a leading expert in our product and be the face of Fingerprint to our users as they sign up and experience the product for the first time. Each user has unique needs, and you will act as a trusted advisor, helping them effectively leverage our product to drive maximum impact for their business.&lt;/p&gt;\n&lt;p&gt;You will help customers with onboarding, questions, feature requests, and bug reports via 1:1 video calls and emails. You&#39;ll educate them about best practices and help them navigate our API, integrations, and features. Armed with this experience, you’ll be a liaison between the product team and our customers. Within the organization, you will amplify our customers’ voices in product development, and encourage that dialogue through our support channels.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;What You’ll Do&lt;/strong&gt;&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;&lt;strong&gt;Onboarding &amp;amp; Integration: &lt;/strong&gt;Conduct 1:1 onboarding consultations to assist customers in seamlessly integrating our APIs into their web and mobile applications.&lt;/li&gt;\n&lt;li&gt;&lt;strong&gt;Technical Support:&lt;/strong&gt; Serve as the primary technical contact for our customers, addressing inquiries, troubleshooting issues, and providing effective solutions.&lt;/li&gt;\n&lt;li&gt;&lt;strong&gt;Customer Advocacy: &lt;/strong&gt;Act as a liaison between the product team and customers, amplifying customer voices in product development.&lt;/li&gt;\n&lt;li&gt;&lt;strong&gt;Proactive Monitoring:&lt;/strong&gt; Monitor API usage and performance to identify and resolve potential issues before they impact customers.&lt;/li&gt;\n&lt;li&gt;&lt;strong&gt;JavaScript Expertise: &lt;/strong&gt;Utilize your JavaScript skills to craft sample code snippets and offer tailored recommendations to optimize customer integrations.&lt;/li&gt;\n&lt;li&gt;&lt;strong&gt;Automation: &lt;/strong&gt;Develop automation scripts for API testing, validation, and monitoring processes.&lt;/li&gt;\n&lt;li&gt;&lt;strong&gt;Education &amp;amp; Relationship Building: &lt;/strong&gt;Educate users on product nuances, build strong relationships, manage the self-service book of business, and identify expansion opportunities.&lt;/li&gt;\n&lt;li&gt;&lt;strong&gt;User Engagement: &lt;/strong&gt;Increase user adoption and activation through training, consultations, demos, and office hours.&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;&lt;strong&gt;Who You Are&lt;/strong&gt;&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;Bachelor’s degree in Computer Science, Engineering, or a related technical field.&lt;/li&gt;\n&lt;li&gt;You enjoy talking to people and helping them solve their problems.&lt;/li&gt;\n&lt;li&gt;2-3 years in a customer-facing role, preferably as a Customer Success Engineer, Technical Support Engineer, or similar role, with a focus on API products.&lt;/li&gt;\n&lt;li&gt;Strong proficiency in JavaScript and a solid understanding of API concepts, RESTful architecture, and web services.&lt;/li&gt;\n&lt;li&gt;Strong written and verbal skills in English.&lt;/li&gt;\n&lt;li&gt;Naturally empathetic, with a willingness to step into customers’ shoes.&lt;/li&gt;\n&lt;li&gt;Some familiarity with SQL.&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;&lt;strong&gt;Nice-to-Haves&lt;/strong&gt;&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;Experience with API testing tools and frameworks.&lt;/li&gt;\n&lt;li&gt;Experience with mobile app development.&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;&amp;nbsp;&lt;/p&gt;&lt;div class=&quot;content-conclusion&quot;&gt;&lt;p&gt;&lt;em&gt;We have noticed a rise in recruiting impersonations across the industry, where scammers attempt to access candidates&#39; personal and financial information through fake interviews and offers. All Fingerprint recruiting email communications will always come from the @fingerprint.com domain. Any outreach claiming to be from Fingerprint via other sources should be ignored.&lt;/em&gt;&lt;/p&gt;\n&lt;p&gt;Offers vary depending on, but not limited to, relevant experience, education, certifications/licenses, skills, training, and market conditions.&amp;nbsp;&lt;/p&gt;\n&lt;p&gt;Due to regulatory and security reasons, there’s a small number of countries where we cannot have Fingerprint teammates based.&amp;nbsp;&lt;strong data-stringify-type=&quot;bold&quot;&gt;Additionally, because Fingerprint is an all-remote company and people can join our workforce from almost any country, we do not sponsor visas. Fingerprint teammates need to be authorized to work from their home location&lt;/strong&gt;.&lt;/p&gt;\n&lt;p&gt;We are dedicated to creating an inclusive work environment for everyone. We embrace and celebrate the unique experiences, perspectives and cultural backgrounds that each employee brings to our workplace. Fingerprint strives to foster an environment where our employees feel respected, valued and empowered, and our team members are at the forefront in helping us promote and sustain an inclusive workplace. We highly encourage people from underrepresented groups in tech to apply.&lt;/p&gt;\n&lt;p&gt;If you are applying as a resident of California, please read our CCPA notice &lt;a href=&quot;https://dev.fingerprint.com/docs/dpa-ccpa&quot; target=&quot;_blank&quot;&gt;here&lt;/a&gt;&lt;/p&gt;\n&lt;p&gt;If you are applying as a resident of the EU, please read our GDPR notice &lt;a href=&quot;https://dev.fingerprint.com/docs/dpa-gdpr&quot; target=&quot;_blank&quot;&gt;here&lt;/a&gt;&lt;/p&gt;&lt;/div&gt;","tags":"[\"redis\",\"java\",\"javascript\"]","pubDate":"2025-05-20T14:40:14.000Z","link":"https://fingerprint.com/careers/jobs/apply/?gh_jid=5545157004","slug":"customer-success-engineer-emea-fingerprint-7357"},{"id":8642462383,"title":"Strategic Account Manager Lead","company":"Sardine","image":"https://avatars.githubusercontent.com/u/65879301?s=200&v=4","description":"<p style=\"min-height:1.5em\"><strong>Who we are:</strong></p><p style=\"min-height:1.5em\">We are a leader in fraud prevention and AML compliance. Our platform uses device intelligence, behavior biometrics, machine learning, and AI to stop fraud before it happens. Today, over 300 banks, retailers, and fintechs worldwide use Sardine to stop identity fraud, payment fraud, account takeovers, and social engineering scams. We have raised $145M from world-class investors, including Andreessen Horowitz, Activant, Visa, Experian, FIS, and Google Ventures.</p><p style=\"min-height:1.5em\"></p><p style=\"min-height:1.5em\"><strong>Our culture:</strong></p><ul style=\"min-height:1.5em\"><li><p style=\"min-height:1.5em\">We have hubs in the Bay Area, NYC, Austin, and Toronto. However, we maintain a remote-first work culture. #WorkFromAnywhere</p></li><li><p style=\"min-height:1.5em\">We hire talented, self-motivated individuals with extreme ownership and high growth orientation. </p></li><li><p style=\"min-height:1.5em\">We value performance and not hours worked. We believe you shouldn't have to miss your family dinner, your kid's school play, friends get-together, or doctor's appointments for the sake of adhering to an arbitrary work schedule.</p></li></ul><p style=\"min-height:1.5em\"></p><p style=\"min-height:1.5em\"><strong>Location:</strong></p><ul style=\"min-height:1.5em\"><li><p style=\"min-height:1.5em\">US / Canada (NYC Area, Chicago, Toronto or Atlanta Preferred)</p></li><li><p style=\"min-height:1.5em\">From Home / Beach / Mountain / Cafe / Anywhere!</p></li><li><p style=\"min-height:1.5em\">We are a remote-first company with a globally distributed team. You can find your productive zone and work from there.</p></li></ul><p style=\"min-height:1.5em\"></p><p style=\"min-height:1.5em\"><strong>About the role:</strong></p><p style=\"min-height:1.5em\">Sardine is rapidly acquiring new customers and executing on an ambitious roadmap. As a result, we're building a world-class customer success team to support our fraud, payments, and compliance-related products as we grow. </p><p style=\"min-height:1.5em\">We’re looking for a Strategic Account Manager Lead to join our team. This is a true player-coach role—70% focused on hands-on account management and 30% on mentoring and guiding the team.</p><p style=\"min-height:1.5em\">You’ll manage an exclusive portfolio of high profile enterprise customers, serving as their strategic advocate within Sardine to help them maximize the value of our products and services. This role blends account management with solution architecture, requiring close collaboration with internal teams across risk, fraud, compliance, payments, data science, and product to support each customer’s evolving needs.</p><p style=\"min-height:1.5em\"><br /><strong>What you’ll be doing:</strong></p><ul style=\"min-height:1.5em\"><li><p style=\"min-height:1.5em\">Balance individual account ownership with team leadership responsibilities, guiding both strategy and execution across key client relationships.</p></li><li><p style=\"min-height:1.5em\">Lead a team with compassion and trust, fostering a culture of collaboration and continuous development.</p></li><li><p style=\"min-height:1.5em\">Be the primary point of contact for our very high profile customers, attending to day-to-day and 'big picture' problems and opportunities and helping maximize the customer's ROI in Sardine</p></li><li><p style=\"min-height:1.5em\">Build a team to expand at key strategic accounts and resellers and collaborate with our hunters (Saes AEs)</p></li><li><p style=\"min-height:1.5em\">Build a thorough understanding of our product, technology, and strategy and be able to message these succinctly to customers.</p></li><li><p style=\"min-height:1.5em\">Translate complex product and technology problems into simple and actionable solutions. Be able to manage the solution process both internally and externally.</p></li><li><p style=\"min-height:1.5em\">Speak knowledgeably and advise on best practices relating to fraud and compliance</p></li><li><p style=\"min-height:1.5em\">Build, monitor, and communicate KPIs to clients.</p></li><li><p style=\"min-height:1.5em\">Provide strategic analysis and critical thinking as we plan long-term expansion.</p></li><li><p style=\"min-height:1.5em\">Work with Sardine's risk analytics teams to proactively solve new fraud typologies and actively communicate findings to customers.</p></li></ul><p style=\"min-height:1.5em\"></p><p style=\"min-height:1.5em\"><strong>What you’ll need:</strong></p><ul style=\"min-height:1.5em\"><li><p style=\"min-height:1.5em\">You have 10+ years of experience in Account Management, Customer Success, Risk Management, or Solutions Architecture within B2B SaaS, with an understanding of how customers integrate API's</p></li><li><p style=\"min-height:1.5em\">You've domain experience in compliance, fintech, or AML/KYC</p></li><li><p style=\"min-height:1.5em\">Your analytical skills are second to none; you excel at number crunching and drawing insights</p></li><li><p style=\"min-height:1.5em\">You are proficient in using business intelligence tools</p></li><li><p style=\"min-height:1.5em\">You're capable of translating complex strategies into actionable processes and outcomes</p></li><li><p style=\"min-height:1.5em\">You're a natural at building relationships and collaborating with others</p></li><li><p style=\"min-height:1.5em\">You've got strong presentation skills for both virtual and in-person meetings with various stakeholders</p></li><li><p style=\"min-height:1.5em\">You've previous customer-facing experience, preferably with a technical product</p></li><li><p style=\"min-height:1.5em\">You're an exceptional project manager, synthesizing all inputs and balancing the needs of multiple stakeholders</p></li><li><p style=\"min-height:1.5em\">You constantly think about ways to improve processes</p></li><li><p style=\"min-height:1.5em\">You love making customers more efficient as much as we do!</p></li></ul><p style=\"min-height:1.5em\"><br /><strong>Compensation: </strong>Base pay range of $180,000 - $200,000 + bonus + equity with tremendous upside potential + Attractive benefits</p><p style=\"min-height:1.5em\"></p><p style=\"min-height:1.5em\">The compensation offered for this role will depend on various factors, including the candidate's location, qualifications, work history, and interview performance, and may differ from the stated range.</p><p style=\"min-height:1.5em\"></p><p style=\"min-height:1.5em\"><strong>Benefits we offer:</strong></p><ul style=\"min-height:1.5em\"><li><p style=\"min-height:1.5em\">Generous compensation in cash and equity</p></li><li><p style=\"min-height:1.5em\">Early exercise for all options, including pre-vested</p></li><li><p style=\"min-height:1.5em\">Work from anywhere: Remote-first Culture</p></li><li><p style=\"min-height:1.5em\">Flexible paid time off, Year-end break, Self care days off</p></li><li><p style=\"min-height:1.5em\">Health insurance, dental, and vision coverage for employees and dependents - <em>US and Canada specific</em></p></li><li><p style=\"min-height:1.5em\">4% matching in 401k / RRSP - <em>US and Canada specific</em></p></li><li><p style=\"min-height:1.5em\">MacBook Pro delivered to your door</p></li><li><p style=\"min-height:1.5em\">One-time stipend to set up a home office — desk, chair, screen, etc.</p></li><li><p style=\"min-height:1.5em\">Monthly meal stipend</p></li><li><p style=\"min-height:1.5em\">Monthly social meet-up stipend</p></li><li><p style=\"min-height:1.5em\">Annual health and wellness stipend</p></li><li><p style=\"min-height:1.5em\">Annual Learning stipend</p></li><li><p style=\"min-height:1.5em\">Unlimited access to an expert financial advisory</p></li></ul><p style=\"min-height:1.5em\"></p><p style=\"min-height:1.5em\">Join a fast-growing company with world-class professionals from around the world. If you are seeking a meaningful career, you found the right place, and we would love to hear from you.</p><p style=\"min-height:1.5em\"></p><p style=\"min-height:1.5em\"><em>To learn more about how we process your personal information and your rights in regards to your personal information as an applicant and Sardine employee, please visit our </em><a target=\"_blank\" rel=\"noopener noreferrer nofollow\" class=\"text-link-blue\" href=\"https://www.sardine.ai/applicant-and-worker-privacy-notice\"><em>Applicant and Worker Privacy Notice</em></a><em>.</em></p>","tags":"[]","pubDate":"2025-05-20T13:55:52.677Z","link":"https://jobs.ashbyhq.com/sardine/1ed41d7d-a0d8-4002-9785-2b2d1f85ccb8","slug":"strategic-account-manager-lead-sardine-1496"},{"id":5582661735,"title":"Senior Full Stack Engineer | Web3","company":"Status","image":"https://avatars.githubusercontent.com/u/11767950?s=200&v=4","description":"&lt;div class=&quot;content-intro&quot;&gt;&lt;p style=&quot;text-align: justify;&quot;&gt;&lt;strong&gt;About Status&lt;/strong&gt;&lt;/p&gt;\n&lt;p style=&quot;text-align: justify;&quot;&gt;&lt;span style=&quot;font-weight: 400;&quot;&gt;Status is building the tools and infrastructure for the advancement of a secure, private, and open web3.&amp;nbsp;&lt;/span&gt;&lt;/p&gt;\n&lt;p style=&quot;text-align: justify;&quot;&gt;&lt;span style=&quot;font-weight: 400;&quot;&gt;With the high level goals of preserving the right to privacy, mitigating the risk of censorship, and promoting economic trade in a transparent, open manner, Status is building a community where anyone is welcome to join and contribute.&lt;/span&gt;&lt;/p&gt;\n&lt;p style=&quot;text-align: justify;&quot;&gt;&lt;span style=&quot;font-weight: 400;&quot;&gt;As an organization, Status seeks to push the web3 ecosystem forward through research, creation of developer tools, and support of the open source community.&amp;nbsp;&lt;/span&gt;&lt;/p&gt;\n&lt;p style=&quot;text-align: justify;&quot;&gt;&lt;span style=&quot;font-weight: 400;&quot;&gt;As a product, Status is an open source, Ethereum-based app that gives users the power to chat, transact, and access a revolutionary world of Apps on the decentralized web. But Status is also building foundational infrastructure for the whole Ethereum ecosystem, including the Nimbus ETH 1.0 and 2.0 clients, the Keycard hardware wallet, and the Waku messaging protocol, the p2p communication layer for Web3.&lt;/span&gt;&lt;/p&gt;\n&lt;p style=&quot;text-align: justify;&quot;&gt;&lt;span style=&quot;font-weight: 400;&quot;&gt;As a team, Status has been completely distributed since inception. Our team is currently 200+ core contributors strong, and welcomes a growing number of community members from all walks of life, scattered all around the globe.&amp;nbsp;&lt;/span&gt;&lt;/p&gt;\n&lt;p style=&quot;text-align: justify;&quot;&gt;&lt;span style=&quot;font-weight: 400;&quot;&gt;We care deeply about open source, and our organizational structure has minimal hierarchy and no fixed work hours. We believe in working with a high degree of autonomy while supporting the organization&#39;s priorities.&lt;/span&gt;&lt;/p&gt;&lt;/div&gt;&lt;p&gt;We are looking for an experienced JavaScript developer to join our Web team, who will take ownership of certain web-related areas at Status, including a web browser crypto wallet. Your role will include working on our crypto wallet and other other Status web assets while collaborating with colleagues across the stack (QA, other developers, ui/ux, product, etc.) to deliver great features to our users.&amp;nbsp;&lt;/p&gt;\n&lt;p&gt;Our stack is built on modern foundations – a monorepo powered by TypeScript, React, Storybook, Vite, Vitest, Playwright, ESLint, Prettier, pnpm, and Turborepo. As we work in the open and are fully open-source, you can get a better idea of who we are and the work we are doing by browsing our &lt;a href=&quot;https://github.com/status-im/status-web&quot;&gt;Status Web&lt;/a&gt; repository. We strive to build solid foundations that will enable us to continuously make progress and provide composable and extensible solutions. We don&#39;t expect you to have a background in everything we use, but we do expect strong JavaScript fundamentals and experience working with React, TypeScript, and crypto web browser wallets.&lt;/p&gt;\n&lt;p&gt;We function as generalists, often undertaking a variety of challenges, and deeply care about the quality of our work. We look forward to collaborating with experienced individuals who can operate independently, make important decisions, and take ownership. The ideal candidate is comfortable working in European (or nearby) time zones, along with the majority of the existing team, but we welcome applications from other regions as well.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Key responsibilities:&amp;nbsp;&lt;/strong&gt;&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;Building secure, robust, and well-cached APIs&lt;/li&gt;\n&lt;li&gt;Cost-effective calling of RPC and node provider APIs&lt;/li&gt;\n&lt;li&gt;Working with various browser storage solutions&lt;/li&gt;\n&lt;li&gt;Integrating libraries to create, sign, and decode transactions&lt;/li&gt;\n&lt;/ul&gt;\n&lt;ul&gt;\n&lt;li&gt;Building and maintaining the new React implementation of Status’ design system&lt;/li&gt;\n&lt;li&gt;Collaborating with other people across the teams (QA, other developers, ui/ux, product, etc.)&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;&lt;strong&gt;You ideally will have:&lt;/strong&gt;&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;Clear and effective communication skills, both verbally and written&lt;/li&gt;\n&lt;li&gt;Thoughtful and pragmatic problem-solving&lt;/li&gt;\n&lt;li&gt;5+ years of software engineering experience, with 3+ years of experience with React&lt;/li&gt;\n&lt;li&gt;Experience writing modern, performant, and accessible React code&amp;nbsp;&lt;/li&gt;\n&lt;li&gt;Strong knowledge of JavaScript, and ideally TypeScript&lt;/li&gt;\n&lt;li&gt;Experience with UTXOs, derivation paths, ordinals, and consolidations&lt;/li&gt;\n&lt;li&gt;Experience with integrating hardware crypto wallets (Ledger, Trezor, QR-code crypto wallets, etc.) into a web browser wallet&lt;/li&gt;\n&lt;li&gt;Prior experience working for an open source organisation / contributing to OS projects&lt;/li&gt;\n&lt;li&gt;Comfortable working in (and experience of) start-up environments&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;&lt;strong&gt;Hiring process:&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;em&gt;The steps may change along the way if we see it makes sense to adapt the interview stages, so please consider the above as a guideline.&amp;nbsp;&lt;/em&gt;&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;Call with our Talent Team&lt;/li&gt;\n&lt;li&gt;Technical interview (a Q&amp;amp;A tech interview)&lt;/li&gt;\n&lt;li&gt;Live coding interview&lt;/li&gt;\n&lt;li&gt;Interview with Design Team&amp;nbsp;&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;&lt;strong&gt;Compensation:&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;The expected compensation range for this role is negotiable, dependent on how we assess your skills and experience throughout our interview process. We are happy to pay in any mix of fiat/crypto.&lt;/p&gt;","tags":"[\"java\",\"javascript\",\"typescript\",\"react\",\"vite\",\"ethereum\"]","pubDate":"2025-05-20T12:58:55.000Z","link":"https://status.app/jobs?gh_jid=6899709","slug":"senior-full-stack-engineer-web3-status-90"},{"id":1806471918,"title":"PostgreSQL Tech Lead","company":"Percona","image":"https://avatars.githubusercontent.com/u/1683025?s=200&v=4","description":"<p style=\"min-height:1.5em\">Are you deeply passionate about PostgreSQL, dedicated to customer success, and eager to shape the future of technical support for open source databases? If so, the PostgreSQL Technical Lead position at Percona is an ideal opportunity.</p><p style=\"min-height:1.5em\"></p><p style=\"min-height:1.5em\">This role is pivotal in maintaining the high technical standards of Percona’s PostgreSQL products and services. You'll enhance Percona's reputation within the PostgreSQL ecosystem, ensuring we remain leaders in the field.</p><p style=\"min-height:1.5em\"></p><p style=\"min-height:1.5em\">This is a hands-on technical role with a strong emphasis on PostgreSQL expertise and thought leadership. You'll create valuable technical content for customers and the wider community, aligning with Percona's strategic focus on Kubernetes and related technologies, guided by the Marketing team.</p><p style=\"min-height:1.5em\"></p><p style=\"min-height:1.5em\">You'll collaborate closely with Service Delivery as an escalation point for complex PostgreSQL support tickets and other technical requests. Additionally, you'll influence Percona's product strategy by providing feedback to the Engineering team.</p><p style=\"min-height:1.5em\"></p><p style=\"min-height:1.5em\">Working collaboratively with Sales, Marketing, Global Services, Customer Success, and Engineering teams, you'll contribute significantly to Percona’s PostgreSQL goals. This dynamic role offers the chance to impact product strategy and direction from both deliverability and functionality perspectives. The role requires flexible hours across the Americas and European time zones.</p><p style=\"min-height:1.5em\"></p><p style=\"min-height:1.5em\"><strong>What You Will Do:</strong></p><ul style=\"min-height:1.5em\"><li><p style=\"min-height:1.5em\"><strong>Content Creation:</strong> Develop technical content (blogs, white papers, knowledge base articles, webinars, training, conference talks) for the community and Percona subscribers.</p></li><li><p style=\"min-height:1.5em\"><strong>Technical Escalation:</strong> Act as a technical escalation point for Global Services, managing complex support tickets to resolution.</p></li><li><p style=\"min-height:1.5em\"><strong>Service Improvement:</strong> Enhance Percona's support and service delivery quality by participating in ticket reviews and identifying improvement areas related to new PostgreSQL ecosystem software.</p></li><li><p style=\"min-height:1.5em\"><strong>Managed Services:</strong> Contribute to the PostgreSQL Managed Services solution by defining and implementing best practices for efficiency and continual improvement.</p></li><li><p style=\"min-height:1.5em\"><strong>Consulting:</strong> Deliver professional services and consulting engagements for strategic or complex projects.</p></li><li><p style=\"min-height:1.5em\"><strong>Product Strategy:</strong> Provide feedback and guidance on Percona’s PostgreSQL product strategy and extensions, contributing to functional specifications for product enhancements, changes, or new software.</p></li><li><p style=\"min-height:1.5em\"><strong>Industry Awareness:</strong> Stay current with industry developments and competitor activities.</p></li><li><p style=\"min-height:1.5em\"><strong>Trend Identification:</strong> Research industry events, publications, and announcements to identify emerging trends.</p></li><li><p style=\"min-height:1.5em\"><strong>Sales Support:</strong> Assist the Percona field sales team with strategic, PostgreSQL-related opportunities.</p></li><li><p style=\"min-height:1.5em\"><strong>Public Speaking:</strong> Present at key conferences throughout the year.</p></li><li><p style=\"min-height:1.5em\"><strong>Community Building:</strong> Lead, build, and participate in a collaborative community of PostgreSQL experts within Percona.</p></li></ul><p style=\"min-height:1.5em\"></p><p style=\"min-height:1.5em\"><strong>Your Experience:</strong></p><ul style=\"min-height:1.5em\"><li><p style=\"min-height:1.5em\">Expert-level knowledge of PostgreSQL and the extensions that Percona supports </p></li><li><p style=\"min-height:1.5em\">Advanced Kubernetes skills.</p></li><li><p style=\"min-height:1.5em\">Proven technical support experience, including adherence to SLAs.</p></li><li><p style=\"min-height:1.5em\">Experience communicating with management at customers and partners in escalation management.</p></li><li><p style=\"min-height:1.5em\">Fluent written and spoken English communication skills.</p></li><li><p style=\"min-height:1.5em\">Professional, customer service-oriented attitude.</p></li><li><p style=\"min-height:1.5em\">Strong work ethic and entrepreneurial approach.</p></li><li><p style=\"min-height:1.5em\">Ability to communicate clearly and professionally under pressure.</p></li><li><p style=\"min-height:1.5em\">Availability for a 24x7 on-call roster for escalations.</p></li><li><p style=\"min-height:1.5em\">Strong mentoring and coaching skills.</p></li><li><p style=\"min-height:1.5em\">Ability to work independently with minimal direction.</p></li><li><p style=\"min-height:1.5em\">Willingness to travel internationally and speak at conferences.</p><p style=\"min-height:1.5em\"></p></li></ul><p style=\"min-height:1.5em\"><strong>What Will Make You Stand Out:</strong></p><ul style=\"min-height:1.5em\"><li><p style=\"min-height:1.5em\">Familiarity with other open source databases (MySQL, MariaDB, MongoDB).</p></li><li><p style=\"min-height:1.5em\">Familiarity with Percona Monitoring and Management software.</p></li><li><p style=\"min-height:1.5em\">Familiarity with Percona Everest software.</p></li><li><p style=\"min-height:1.5em\">Expertise with DBaaS environments (Amazon RDS or Aurora for PostgreSQL).</p></li><li><p style=\"min-height:1.5em\">Software development experience and source-level familiarity with PostgreSQL.</p></li></ul><p style=\"min-height:1.5em\"><strong>Why Percona?</strong></p><p style=\"min-height:1.5em\">At Percona, we believe an open world is a better world. Our mission is to enable everyone to innovate freely, by providing the best open source database software, support, and services. We make databases and applications run better through a unique combination of expertise and open source software built with the community for you. Our technical teams are experts in MySQL, MongoDB, PostgreSQL, and MariaDB.</p><p style=\"min-height:1.5em\"></p><p style=\"min-height:1.5em\">Percona is proud to be a remote-only and globally dispersed workforce – we have colleagues in more than 50 countries! We offer a collaborative, highly-engaged culture where your ideas are welcome and your voice is heard.</p><p style=\"min-height:1.5em\"></p><p style=\"min-height:1.5em\">Our staff receives generous benefits including flexible work hours and various paid time off programs, all your equipment for your remote office, funds for career development (external training, certifications, conferences), ongoing connectivity allowances, and the opportunity to participate in our equity incentive plan. We also have benefits that support a healthy work/life balance such as The Percona Adventure Team, Work-from-Anywhere, FlowDays, FryDays, and overall flexibility. We also support being socially responsible through our PAVE volunteering program and Women Transforming Technology.</p><p style=\"min-height:1.5em\"></p><p style=\"min-height:1.5em\">If you love the idea of working with a high-growth tech company that is one of the best in the business and known globally as a leader in the open-source database space, let’s talk!</p><p style=\"min-height:1.5em\"></p><p style=\"min-height:1.5em\">Connect with us and stay up to date on our latest news and developments by following us on <a target=\"_blank\" rel=\"noopener noreferrer\" class=\"postings-link\" href=\"https://www.linkedin.com/search/results/all/?fetchDeterministicClustersOnly=true&amp;heroEntityKey=urn:li:organization:421929&amp;keywords=percona&amp;origin=RICH_QUERY_TYPEAHEAD_HISTORY&amp;position=0&amp;searchId=29912b91-aeb0-4aa6-b3ab-fc70c59fa57f&amp;sid=u0N\">LinkedIn</a> and <a target=\"_blank\" rel=\"noopener noreferrer\" class=\"postings-link\" href=\"https://twitter.com/Percona?ref_src=twsrc%5Egoogle%7Ctwcamp%5Eserp%7Ctwgr%5Eauthor\">Twitter</a>. We look forward to connecting with you!</p>","tags":"[\"postgres\",\"mysql\",\"mongo\",\"kubernetes\",\"scala\"]","pubDate":"2025-05-20T09:37:31.260Z","link":"https://jobs.ashbyhq.com/percona/4a3370b0-d724-4866-bd4b-222137f429c3","slug":"postgresql-tech-lead-percona-8303"},{"id":9302857248,"title":"Organic Growth Analyst","company":"omniscient","image":"https://remotive.com/job/2010822/logo","description":"<p style=\"min-height: 1.5em;\">Omniscient Digital is an organic growth agency that partners with ambitious B2B SaaS companies like SAP, Adobe, Loom, and Hotjar to turn SEO and content into growth engines.</p>\n<div class=\"h3\"><strong>About this role</strong></div>\n<p style=\"min-height: 1.5em;\">We’re hiring an Organic Growth Analyst to support our client-facing strategists and help execute high-impact work across SEO and content..</p>\n<p style=\"min-height: 1.5em;\">This is an early-career role with room to grow. You’ll assist in research, reporting, and execution. You’ll learn how to build strategies that actually drive pipeline and revenue. And over time, you’ll have the chance to level up into a strategist role yourself.</p>\n<p style=\"min-height: 1.5em;\">You’ll report to an Organic Growth Strategist and work closely with the rest of our strategy and content teams. The application password is ORGANIC25.</p>\n<p style=\"min-height: 1.5em;\"> </p>\n<p style=\"min-height: 1.5em;\"><strong>This is a remote position, but you must have at least 5 hours of overlap with Eastern Time (ET) working hours.</strong></p>\n<p style=\"min-height: 1.5em;\"> </p>\n<div class=\"h3\"><strong>Your responsibilities</strong></div>\n<p style=\"min-height: 1.5em;\">Your job as the Organic Growth Analyst would include …</p>\n<ul style=\"\">\n<li style=\"\">\n<p style=\"min-height: 1.5em;\">Support the execution of SEO and organic growth strategies for B2B SaaS clients</p>\n</li>\n<li style=\"\">\n<p style=\"min-height: 1.5em;\">Conduct keyword research, competitive analysis, content audits, and backlink research</p>\n</li>\n<li style=\"\">\n<p style=\"min-height: 1.5em;\">Build and maintain reports and dashboards that show how strategies are performing</p>\n</li>\n<li style=\"\">\n<p style=\"min-height: 1.5em;\">Track and analyze client data to identify insights and opportunities</p>\n</li>\n<li style=\"\">\n<p style=\"min-height: 1.5em;\">Help ensure deliverables meet our internal standards and drive real results</p>\n</li>\n<li style=\"\">\n<p style=\"min-height: 1.5em;\">Join team brainstorms and client calls to observe and learn</p>\n</li>\n<li style=\"\">\n<p style=\"min-height: 1.5em;\">Take initiative on internal projects, research, and R&amp;D efforts</p>\n</li>\n</ul>\n<p style=\"min-height: 1.5em;\"> </p>\n<div class=\"h3\"><strong>Time breakdown</strong></div>\n<p style=\"min-height: 1.5em;\">Here’s how your time might shake out:</p>\n<ul style=\"\">\n<li style=\"\">\n<p style=\"min-height: 1.5em;\">50% on research, reporting, analysis, and task execution</p>\n</li>\n<li style=\"\">\n<p style=\"min-height: 1.5em;\">20% on team collaboration and internal updates</p>\n</li>\n<li style=\"\">\n<p style=\"min-height: 1.5em;\">20% on skill development and process improvements</p>\n</li>\n<li style=\"\">\n<p style=\"min-height: 1.5em;\">10% on supporting client communications and meetings</p>\n</li>\n</ul>\n<p style=\"min-height: 1.5em;\"> </p>\n<div class=\"h3\"><strong>What we’re looking for</strong></div>\n<ul style=\"\">\n<li style=\"\">\n<p style=\"min-height: 1.5em;\">1 to 2 years of experience in SEO, content, or digital marketing, or a strong interest in building a career in this space</p>\n</li>\n<li style=\"\">\n<p style=\"min-height: 1.5em;\">An analytical mindset with basic experience using tools like Google Analytics, Looker Studio, or Ahrefs</p>\n</li>\n<li style=\"\">\n<p style=\"min-height: 1.5em;\">Excellent attention to detail and ability to follow through on tasks</p>\n</li>\n<li style=\"\">\n<p style=\"min-height: 1.5em;\">Willingness to learn fast and take feedback</p>\n</li>\n<li style=\"\">\n<p style=\"min-height: 1.5em;\">Clear, concise communicator who is comfortable asking questions</p>\n</li>\n<li style=\"\">\n<p style=\"min-height: 1.5em;\">Comfortable working in a remote team with high standards and high trust</p>\n</li>\n<li style=\"\">\n<p style=\"min-height: 1.5em;\">Availability that overlaps with at least 5 hours of ET time on weekdays</p>\n</li>\n</ul>\n<p style=\"min-height: 1.5em;\"> </p>\n<div class=\"h3\"><strong>What you’ll get</strong></div>\n<p style=\"min-height: 1.5em;\">We're here to help you do great work and grow personally and professionally.</p>\n<ul style=\"\">\n<li style=\"\">\n<p style=\"min-height: 1.5em;\">A clear growth path toward a Strategist role</p>\n</li>\n<li style=\"\">\n<p style=\"min-height: 1.5em;\">Hands-on experience in SEO, content strategy, analytics, and CRO</p>\n</li>\n<li style=\"\">\n<p style=\"min-height: 1.5em;\">The chance to work with fast-growing SaaS brands and learn from experienced growth strategists</p>\n</li>\n<li style=\"\">\n<p style=\"min-height: 1.5em;\">Autonomy to take on projects, explore ideas, and improve how we work</p>\n</li>\n<li style=\"\">\n<p style=\"min-height: 1.5em;\">Confidence and skills that translate to in-house, agency, or freelance roles</p>\n</li>\n<li style=\"\">\n<p style=\"min-height: 1.5em;\">Remote flexibility to work from anywhere</p>\n</li>\n<li style=\"\">\n<p style=\"min-height: 1.5em;\">Coaching and upskilling opportunities </p>\n</li>\n<li style=\"\">\n<p style=\"min-height: 1.5em;\">Fun team offsites to places all around the world (last year we went to Costa Rica)</p>\n</li>\n</ul>\n<p style=\"min-height: 1.5em;\"> </p>\n<div class=\"h3\"><strong>Benefits</strong></div>\n<p style=\"min-height: 1.5em;\">We’re fortunate to offer competitive salaries and benefits, and we strive to create an environment that allows you to do your best work, develop your skills, and grow your career.</p>\n<p style=\"min-height: 1.5em;\"> </p>\n<ul style=\"\">\n<li style=\"\">\n<p style=\"min-height: 1.5em;\"><strong>Health insurance</strong> - 90% of medical, dental, and vision insurance premiums paid for employees in the US</p>\n</li>\n<li style=\"\">\n<p style=\"min-height: 1.5em;\"><strong>401k with employer match</strong> - We’ll match 100% of your contributions up to the first 3% of pay. Then match 50% of your contributions on the next 2% of pay.</p>\n</li>\n<li style=\"\">\n<p style=\"min-height: 1.5em;\"><strong>Profit share</strong> - Opportunity to participate in quarterly profit share program after 1 year of employment.</p>\n</li>\n<li style=\"\">\n<p style=\"min-height: 1.5em;\"><strong>Unlimited vacation</strong> - We trust you to take care of your work and communicate when you need time off. We recommend taking a minimum of 14 days a year.</p>\n</li>\n<li style=\"\">\n<p style=\"min-height: 1.5em;\"><strong>Learning and development stipend</strong> - $2,000 to spend on professional development after 1 year of employment.</p>\n</li>\n<li style=\"\">\n<p style=\"min-height: 1.5em;\"><strong>Free books program</strong> - We’ll cover the cost of a Kindle and 1 Kindle book a month.</p>\n</li>\n<li style=\"\">\n<p style=\"min-height: 1.5em;\"><strong>Networking stipend</strong> - $50 per month to spend on coffee or lunch for professional networking.</p>\n</li>\n<li style=\"\">\n<p style=\"min-height: 1.5em;\"><strong>100% remote flexibility</strong> - Work from wherever you want</p>\n</li>\n<li style=\"\">\n<p style=\"min-height: 1.5em;\"><strong>Annual offsites</strong> - Meet and work with team members in person, usually in an interesting location.</p>\n</li>\n</ul>\n<p style=\"min-height: 1.5em;\"><strong>Ready to apply?</strong></p>\n<p style=\"min-height: 1.5em;\">Keep scrolling to submit your information. We’re excited to meet you!</p>\n<p style=\"min-height: 1.5em;\">___</p>\n<p style=\"min-height: 1.5em;\"><em>We know the</em><a href=\"https://www.theatlantic.com/magazine/archive/2014/05/the-confidence-gap/359815/\" rel=\"nofollow\" target=\"_blank\"><em><u> confidence gap</u></em></a><em> and imposter syndrome (</em><a href=\"https://beomniscient.com/blog/kitchen-side-the-ultimate-imposter-syndrome-episode/\" rel=\"nofollow\" target=\"_blank\"><em><u>yes, we have it, too</u></em></a><em>) can sometimes hold us back from applying for a job. But there’s no such thing as a \"perfect\" candidate. Omniscient Digital is a place where everyone can grow. So however you identify and whatever background you bring with you, please apply if the idea of this role excites you.</em></p>\n<p style=\"min-height: 1.5em;\">Omniscient Digital is an equal opportunity employer. We ensure equal opportunity and all candidates are considered without regard to race, color, religion, national origin, age, sex, sexual orientation, gender identity, marital status, ancestry, physical or mental disability, veteran status, or any other legally protected characteristics.</p>\n<p style=\"min-height: 1.5em;\">___</p>\n<p style=\"min-height: 1.5em;\"><strong>About Omniscient Digital</strong></p>\n<p style=\"min-height: 1.5em;\">Omniscient Digital is an organic growth agency that partners with ambitious B2B SaaS companies like SAP, Adobe, Loom, and Hotjar to turn SEO and content into growth engines.</p>\n<p style=\"min-height: 1.5em;\">We pride ourselves on being lean, agile, and experimental. Our team thrives on R&amp;D and innovation, always exploring the smartest ways to deliver exceptional results. We believe in a culture of building and shipping — whether it’s client deliverables, new services, or internal tools that keep us ahead of the game.</p>\n<p style=\"min-height: 1.5em;\">If you’re looking for a role where you’ll tackle challenging problems, work with ambitious brands, and help shape the future of organic growth, let’s talk.</p>\n<p style=\"min-height: 1.5em;\">Learn about the <a href=\"https://beomniscient.com/principles/\" rel=\"nofollow\" target=\"_blank\"><u>principles</u></a> that drive how we work and build a company.</p>\n<p style=\"min-height: 1.5em;\">___</p>\n<p style=\"min-height: 1.5em;\"><em>By submitting your application, you agree that Omniscient Digital may collect your personal data for recruiting, global organization planning, and related purposes. Omniscient Digital’s Privacy Policy explains what personal information we may process, where we may process your personal information, our purposes for processing your personal information, and the rights you can exercise over Omniscient Digital’s use of your personal information. </em></p>\n<img src=\"https://remotive.com/job/track/2010822/blank.gif?source=public_api\" alt=\"\"/>","tags":"[\"seo\",\"digital marketing\",\"legal\"]","pubDate":"2025-05-19T22:51:53.000Z","link":"https://remotive.com/remote-jobs/data/organic-growth-analyst-2010822","slug":"organic-growth-analyst-omniscient-296"},{"id":7150320974,"title":"Middle .Net Developer for CRM Team","company":"Gr8tech","image":"https://remotive.com/job/2008859/logo","description":"<div class='\"content-intro\"'><p><strong>GR8 Tech is a global product company that provides innovative, scalable platforms and business solutions for the iGaming industry.</strong></p>\n<p>We have а great experience: GR8 Tech platform successfully handles millions of active players and offers best practices to develop and grow in the gambling industry. We are here to provide great gaming tech to satisfy even greater ambition!</p>\n<p>We develop complete tech coverage for gambling businesses worldwide, including iGaming platform solutions, consulting, integration, and long-lasting operation services.</p>\n<p><strong>We are driven by our ambition to make a great product with great people! Together we move the world of iGaming forward — join!</strong></p></div><div class=\"h2\"><strong>About your key responsibilities and impact:</strong></div>\n<ul style=\"\">\n<li style=\"\">Designing, developing, and maintaining .NET applications, ensuring high-quality software solutions;</li>\n<li style=\"\">Working independently or in a team, adhering to coding standards and best practices;</li>\n<li style=\"\">Mentoring junior developers and participating in technical discussions;</li>\n<li style=\"\">Improving software development processes and ensuring system resilience;</li>\n<li style=\"\">Eliciting, analyzing, and documenting software requirements from stakeholders;</li>\n<li style=\"\">Implementing observability and monitoring through logging and instrumentation.</li>\n</ul>\n<div class=\"h2\"><strong>Essential professional experience:</strong></div>\n<p><strong>System Analysis and Design:</strong></p>\n<ul style=\"\">\n<li style=\"\">Understanding microservice and monolith architectures, their advantages, and drawbacks;</li>\n<li style=\"\">Ability to design event-driven systems and resilient architectures;</li>\n<li style=\"\">Familiarity with architectural patterns, resilience strategies, and designing for failure;</li>\n<li style=\"\">Strong analytical skills in gathering and documenting software requirements;</li>\n<li style=\"\">Understanding of functional and non-functional requirements;</li>\n<li style=\"\">Knowledge of connection pooling, rate-limiter, circuit breaker, and bulkhead patterns.</li>\n</ul>\n<p><strong>Database Management:</strong></p>\n<ul style=\"\">\n<li style=\"\">Understanding relational and non-relational databases (key-value and object-oriented);</li>\n<li style=\"\">Proficiency in writing SQL queries and designing relational database models;</li>\n<li style=\"\">Knowledge of normalization/de-normalization strategies and primary/foreign key relationships;</li>\n<li style=\"\">Familiarity with database security best practices (access controls, encryption, SQL injection prevention).</li>\n</ul>\n<p><strong>Hard Skills:</strong></p>\n<ul style=\"\">\n<li style=\"\">C# Programming: Strong knowledge of object-oriented design, LINQ, asynchronous programming, dependency injection, and .NET framework libraries;</li>\n<li style=\"\">Web API Development: Proficiency in ASP.NET Core for architecting scalable RESTful services, performance optimization, and cloud integrations;</li>\n<li style=\"\">Database Expertise: Advanced SQL optimization, schema design, performance tuning, indexing strategies, and PostgreSQL;</li>\n<li style=\"\">Message Brokers: Experience with Kafka, including architecture, producer/consumer APIs, and stream processing in microservices;</li>\n<li style=\"\">Debugging &amp; Optimization: Advanced skills in profiling, identifying, and resolving performance bottlenecks;</li>\n<li style=\"\">Unit Testing &amp; TDD: Experience with xUnit and test-driven development to ensure code quality;</li>\n<li style=\"\">Microservices Architecture: Proficiency in ASP.NET Core, Docker, Kubernetes, and applying patterns like service discovery, circuit breakers, event sourcing, and CQRS;</li>\n<li style=\"\">Observability &amp; Monitoring: Implementing logging, instrumentation, and monitoring tools like Serilog for system health and troubleshooting.</li>\n</ul><div class='\"content-conclusion\"'><p> </p>\n<div class=\"h2\"><strong>What we offer:</strong></div>\n<p><strong>Benefits Cafeteria:</strong></p>\n<ul style=\"\">\n<li style=\"\">Sports compensation;</li>\n<li style=\"\">Medical coverage;</li>\n<li style=\"\">Psychological support;</li>\n<li style=\"\">Home-office coverage.</li>\n</ul>\n<p><strong>Work-life:</strong></p>\n<ul style=\"\">\n<li style=\"\">Remote work, Coworking compensation;</li>\n<li style=\"\">Childcare budget;</li>\n<li style=\"\">Maternity leave;</li>\n<li style=\"\">Paternity leave;</li>\n<li style=\"\">Additional 2 days for family events.</li>\n</ul>\n<p><strong>Our GR8 Culture:</strong></p>\n<ul style=\"\">\n<li style=\"\">Open feedback and transparent direct communications;</li>\n<li style=\"\">Growth and development: better every day;</li>\n<li style=\"\">High tolerance to experiment and mistakes;</li>\n<li style=\"\">Supportive friendly environment.</li>\n</ul>\n<p> </p>\n<p> </p>\n<p>Data Protection Information regarding the processing of your personal data in connection with the recruitment and selection process can be found in the Candidate Privacy Notice at <a class='\"c-link\"' href=\"%22https://gr8.tech/candidate-privacy-notice/%22\" rel=\"nofollow\" target='\"_blank\"'>https://gr8.tech/candidate-privacy-notice/</a>.</p></div><img src=\"https://remotive.com/job/track/2008859/blank.gif?source=public_api\" alt=\"\"/>","tags":"[\"postgres\",\"docker\",\"kubernetes\",\"c#\",\"scala\",\"kafka\"]","pubDate":"2025-05-19T22:51:00.000Z","link":"https://remotive.com/remote-jobs/software-dev/middle-net-developer-for-crm-team-2008859","slug":"middle-net-developer-for-crm-team-gr8tech-235"},{"id":2173026024,"title":"Compliance Specialist ","company":"OnTheGoSystems","image":"https://remotive.com/job/2008652/logo","description":"<div class=\"h3\" dir=\"ltr\">About Us</div>\n<p> </p>\n<p dir=\"ltr\">At OnTheGoSystems, we build software that powers thousands of websites across the globe. We are creators of <a href=\"https://wpml.org/\" rel=\"nofollow\">WPML</a> - the #1 multilingual plugin for WordPress. We're a remote-first company, united by a passion for building reliable, secure, and meaningful tools that help people connect across languages and borders.</p>\n<p dir=\"ltr\">As we grow, we are looking for a proactive and detail-oriented Compliance Specialist to help us stay ahead of regulatory, privacy, and audit requirements.</p>\n<p dir=\"ltr\"> </p>\n<div class=\"h3\" dir=\"ltr\">Key Responsibilities</div>\n<p> </p>\n<ul style=\"\">\n<li dir=\"ltr\" style=\"\">\n<p dir=\"ltr\">Ensure ongoing compliance with ISO 27001, GDPR, SOC 2, and internal policies.</p>\n</li>\n<li dir=\"ltr\" style=\"\">\n<p dir=\"ltr\">Manage documentation and readiness for third-party audits and security assessments.</p>\n</li>\n<li dir=\"ltr\" style=\"\">\n<p dir=\"ltr\">Monitor privacy practices and support data protection activities (e.g., RoPA, DPIAs).</p>\n</li>\n<li dir=\"ltr\" style=\"\">\n<p dir=\"ltr\">Conduct internal audits and follow up on findings and risk control.</p>\n</li>\n<li dir=\"ltr\" style=\"\">\n<p dir=\"ltr\">Maintain and improve compliance-related policies and educate internal teams.</p>\n</li>\n<li dir=\"ltr\" style=\"\">\n<p dir=\"ltr\">Handle customer and regulatory compliance requests (e.g., DPA, SOC reports).</p>\n</li>\n<li dir=\"ltr\" style=\"\">\n<p dir=\"ltr\">Support legal agreement reviews (NDAs, supplier contracts) and IP protection.</p>\n</li>\n<li dir=\"ltr\" style=\"\">\n<p dir=\"ltr\">Manage trademarks and intellectual property rights.</p>\n</li>\n<li dir=\"ltr\" style=\"\">\n<p dir=\"ltr\">Contribute to accessibility compliance planning under the European Accessibility Act.</p>\n</li>\n</ul>\n<p> </p>\n<div class=\"h3\" dir=\"ltr\">Qualifications</div>\n<p> </p>\n<ul style=\"\">\n<li dir=\"ltr\" style=\"\">\n<p dir=\"ltr\">5+ years of experience in compliance, privacy, or information security, in a SaaS or technology company.</p>\n</li>\n<li dir=\"ltr\" style=\"\">\n<p dir=\"ltr\">Working knowledge of ISO 27001, GDPR, and SOC 2 frameworks.</p>\n</li>\n<li dir=\"ltr\" style=\"\">\n<p dir=\"ltr\">Experience with internal audits and/or risk assessments.</p>\n</li>\n<li dir=\"ltr\" style=\"\">\n<p dir=\"ltr\">Strong documentation, organizational, and communication skills.</p>\n</li>\n<li dir=\"ltr\" style=\"\">\n<p dir=\"ltr\">Ability to work independently, collaborate across departments, and lead without authority.</p>\n</li>\n<li dir=\"ltr\" style=\"\">\n<p dir=\"ltr\">Certifications such as CIPP/E, ISO 27001 Lead Implementer/Auditor, or similar are a plus.</p>\n</li>\n</ul>\n<p> </p>\n<div class=\"h3\" dir=\"ltr\">What We Offer</div>\n<p> </p>\n<ul style=\"\">\n<li dir=\"ltr\" style=\"\">\n<p dir=\"ltr\">100% remote work, async-friendly</p>\n</li>\n<li dir=\"ltr\" style=\"\">\n<p dir=\"ltr\">BAMM program to support hobbies and movement</p>\n</li>\n<li dir=\"ltr\" style=\"\">\n<p dir=\"ltr\">Budget for your workspace and gear</p>\n</li>\n<li dir=\"ltr\" style=\"\">\n<p dir=\"ltr\">Kindle + access to our company Amazon account for unlimited reading</p>\n</li>\n<li dir=\"ltr\" style=\"\">\n<p dir=\"ltr\">National holidays respected wherever you live</p>\n</li>\n<li dir=\"ltr\" style=\"\">\n<p dir=\"ltr\">Smart, driven colleagues around the world</p>\n</li>\n<li dir=\"ltr\" style=\"\">\n<p dir=\"ltr\">Clear opportunity for growth and ownership</p>\n</li>\n</ul>\n<p> </p>\n<p><!-- x-hugerte/html --></p>\n<p>If you'd like to get a role with real impact and visibility in a growing company, <strong>apply today</strong> and we are eager to hear from you!</p>\n<img src=\"https://remotive.com/job/track/2008652/blank.gif?source=public_api\" alt=\"\"/>","tags":"[\"wordpress\",\"legal\"]","pubDate":"2025-05-19T12:54:46.000Z","link":"https://remotive.com/remote-jobs/finance-legal/compliance-specialist-2008652","slug":"compliance-specialist-onthegosystems-8495"},{"id":2051015707,"title":"Customer Success Executive","company":"Clearer","image":"https://avatars.githubusercontent.com/u/100294047?s=200&v=4","description":"<div><b style=\"font-size: 11pt;\">About Us&nbsp;</b></div><div><a rel=\"noopener noreferrer\" class=\"postings-link\" style=\"font-size: 11pt;\" href=\"http://clearer.io\">clearer.io</a><span style=\"font-size: 11pt;\">'s  mission is to continue to create software to advance the future of commerce. We’re achieving this by delivering and building upon a comprehensive suite of ecosystem leading apps all providing unparalleled customer support that helps e-commerce businesses reach new heights.</span></div><div><br></div><div><span style=\"font-size: 11pt;\">Our comprehensive product lineup encompasses 25 individual solutions that cater to various aspects a ecommerce retailer will need such as reviews, conversion, marketing, and shipping, all of which are compatible with both Shopify and non-Shopify platforms. Our integrated and bundled solutions deliver a smoother experience for retailers at any stage of their journey.</span></div><div><br></div><div><span style=\"font-size: 11pt;\">Joining the clearer.io global team is an incredibly exciting opportunity right now. We are currently on an exceptional trajectory of growth and investment, fueled by our unwavering commitment to providing the highest quality products in the ecommerce marketplace.&nbsp;</span></div><div><br></div><div><span style=\"font-size: 11pt;\">The Customer Success executive plays a pivotal role in strategic projects focused on enhancing our global customer success maturity. The role will involve collaborating with cross-functional teams, identifying customer success improvement areas, and implementing and monitoring strategies to ensure customer satisfaction, retention, and expansion. Additionally, you will drive improvements to processes and operations through Vitally.i.o, our internal customer success operations platform to support your Customer Success peers.</span></div><div><b style=\"font-size: 11pt;\">About Us&nbsp;</b></div><div><a href=\"http://clearer.io\" style=\"font-size: 11pt;\" class=\"postings-link\" target=\"_blank\" rel=\"noopener noreferrer\">clearer.io</a><span style=\"font-size: 11pt;\">'s  mission is to continue to create software to advance the future of commerce. We’re achieving this by delivering and building upon a comprehensive suite of ecosystem leading apps all providing unparalleled customer support that helps e-commerce businesses reach new heights.</span></div><div><br></div><div><span style=\"font-size: 11pt;\">Our comprehensive product lineup encompasses 25 individual solutions that cater to various aspects a ecommerce retailer will need such as reviews, conversion, marketing, and shipping, all of which are compatible with both Shopify and non-Shopify platforms. Our integrated and bundled solutions deliver a smoother experience for retailers at any stage of their journey.</span></div><div><br></div><div><span style=\"font-size: 11pt;\">Joining the clearer.io global team is an incredibly exciting opportunity right now. We are currently on an exceptional trajectory of growth and investment, fueled by our unwavering commitment to providing the highest quality products in the ecommerce marketplace.&nbsp;</span></div><div><br></div><div><span style=\"font-size: 11pt;\">The Customer Success executive plays a pivotal role in strategic projects focused on enhancing our global customer success maturity. The role will involve collaborating with cross-functional teams, identifying customer success improvement areas, and implementing and monitoring strategies to ensure customer satisfaction, retention, and expansion. Additionally, you will drive improvements to processes and operations through Vitally.i.o, our internal customer success operations platform to support your Customer Success peers.</span></div><h3>What you’ll do: </h3><li>Develop and execute a comprehensive global customer success strategy with the VP of Global Growth aligned with the company's objectives. (Retention, Expansion, and Churn Prevention)</li><li>Trial strategies on Customers to personalize and optimize before roll out&nbsp;Drive enablement and adoption of new strategies internally with the Customer Success Team</li><li>Serve as a strategic advisor to the internal Customer Success Team and Customers, leveraging your in-depth understanding of the platform and industry best practices. </li><li>Provide insights and recommendations to maximize the value customers derive from our platform.</li><li>Analyze customer data and feedback to identify key trends and areas for improvement in customer success initiatives.</li><li>Collaborate with the marketing and sales teams to identify upsell and cross-sell opportunities within the existing customer base.</li><li>Monitor and report on key performance metrics, providing regular updates to the management team on the effectiveness of customer success initiatives.</li><li>Act as a point of escalation for customer concerns, working closely with internal teams to address and resolve issues promptly.  Ensure timely communication and a high level of customer satisfaction</li><li>Design and implement scalable processes and frameworks to enhance customer onboarding, adoption, and retention using Vitally.io.</li><li>Implement and optimize processes and operations using Vitally.io to streamline customer success operations and enhance the overall efficiency of the Customer Success team.</li><h3>What you’ll need: </h3><li>To live in US or Canada </li><li>Proven experience in customer success or account management, preferably in a global SaaS company.</li><li>Demonstrated experience in leading and implementing strategic customer success initiatives that have led to improved customer satisfaction and retention.</li><li>Strong analytical skills with the ability to interpret complex data and customer feedback to drive actionable insights.</li><li>Excellent communication and interpersonal skills with the ability to build strong relationships with customers and internal stakeholders.</li><li>Exceptional project management skills with the ability to manage multiple projects simultaneously.</li><li>Familiarity with CRM software and customer success management tools.</li><li>A passion for delivering exceptional customer experiences and a deep understanding of customer needs and pain points.</li><li>Strong problem-solving skills and the ability to thrive in a fast-paced, dynamic work environment.</li><h3>Why clearer.io </h3><li><b>Customers at the heart</b>: We make our customers the stars of our show and help them thrive. When they grow, so do we. We obsess over their needs so we can dream big on their behalf.</li><li><b>Purposeful progress:</b> We harness our ingenuity to keep leveling up and growing stronger. We take initiative, think boldly, and don’t settle for the status quo. Every risk teaches us something new.</li><li><b>Endless innovation: </b>We take action, refine our work, and drive meaningful growth for each other and our customers. Humble in our pursuit, we continuously seek to improve. We ask ‘How can we help?’ striving always to make a meaningful</li><li><b>Always open:</b> With transparency we simplify the complex, collaborate globally and empower everyone. We believe openness in our communication—with customers, partners, and team members—is essential for building strong relationships.</li><li><b>Clear Benefits</b>: Comprehensive medical, dental and vision coverage</li><div><b style=\"font-size: 10pt;\">Be a part of clearer.io</b><span style=\"font-size: 10pt;\">—where your expertise fuels real change in eCommerce. Come and join us- it’s clear we’re the place to be!</span></div>","tags":"[\"scala\",\"shopify\"]","pubDate":"2025-05-16T19:46:21.092Z","link":"https://jobs.lever.co/Clearer/29a699cd-83a2-4fe1-8b58-30b579f3033d","slug":"customer-success-executive-clearer-5584"}]