[{"id":3264281516,"title":"Inside Sales Representative","company":"Supabase","image":"https://pbs.twimg.com/profile_images/1651226564728700928/h0tz5UT1_400x400.jpg","description":"\n    <div class=\"content-intro\"><p><img src=\"https://pbs.twimg.com/media/FIdU8GJWQAUGWRA?format=jpg&amp;name=small\" alt=\"Join Supabase\" width=\"680\" height=\"453\"></p></div>\n\n    <p><strong>About Supabase:</strong> Supabase is an open-source Firebase alternative that provides all the backend services you need to build a scalable and robust application. Our mission is to empower developers to create extraordinary products with simplicity and speed.</p>\n<p><strong>Job Description:</strong></p>\n<p>We're looking for a motivated Inside Sales Rep to join our team at Supabase. In this role, you'll help us develop new sales opportunities, manage incoming sales inquiries, and support our growth initiatives.</p>\n<p><strong>What You’ll Do:</strong></p>\n<ul>\n<li>Focus on outbound sales to create new opportunities.</li>\n<li>Handle inbound sales tickets and spot potential sales leads.</li>\n<li>Schedule meetings for our Field Sales Reps (FSRs).</li>\n<li>Qualify initial opportunities.</li>\n<li>Assist with new projects aimed at growing our revenue.</li>\n</ul>\n<p><strong>What We’re Looking For:</strong></p>\n<ul>\n<li>At least 2 years of experience in the SaaS tech industry.</li>\n<li>Bonus points for cloud and database knowledge.</li>\n<li>Familiarity with Hubspot CRM to manage sales pipelines and related workflows</li>\n<li>High energy and a strong work ethic.</li>\n<li>Proven experience in a similar Inside Sales Rep role.</li>\n<li>Comfortable working remotely with excellent time management skills.</li>\n</ul>\n<p><strong>What We Offer:</strong></p>\n<ul>\n<li>A fun and inclusive work environment.</li>\n<li>Opportunities to grow and develop your career.</li>\n<li>The chance to work with cutting-edge tech and a passionate team.</li>\n</ul>\n<p>If you’re excited about sales, technology, and helping a cool company grow, we’d love to hear from you!</p>\n<p></p>\n\n    \n\n    <div class=\"content-conclusion\"><h3>BUILD IN A WEEKEND. SCALE TO BILLIONS</h3>\n<p>Supabase adds auth, realtime, and restful APIs to Postgres without a single line of code.</p>\n<p>Each project within Supabase is an isolated&nbsp;Postgres cluster, allowing customers to scale independently, while still providing the features that you need to build: instant database setup, auth, row level security, realtime data streams, auto-generating APIs, and a simple to use web interface.</p>\n<p>We are a fully remote company.</p>\n<p>Key Tech: Javascript, Typescript, Go, Elixir, PostgREST (haskell), Postgres, Pulumi.</p>\n<h3><a id=\"about-the-team\" class=\"anchor\"></a>About the team</h3>\n<ul>\n<li>We're a startup. It's unstructured.</li>\n<li>Collectively founded more than a dozen venture-backed companies.</li>\n<li>More than 10 different nationalities.</li>\n<li>We deeply believe in <a href=\"https://supabase.com/blog/2022/03/25/should-i-open-source-my-company\" target=\"_blank\">the efficacy of collaborative open source</a>. We support existing communities and tools, rather than building \"yet another xx\".</li>\n<li>We \"dogfood\" everything. If you use it in your project, we use it in Supabase.</li>\n</ul>\n<h2><a id=\"process\" class=\"anchor\"></a>Process</h2>\n<ul>\n<li>The entire process is fully remote and all communication will happen over email or via video chat.</li>\n<li>Once you've submitted your application, the team will review your submission, and may reach out for a short screening interview over video call.</li>\n<li>If you pass the screen you will be invited to up to four follow up interviews. The calls:\n<ul>\n<li>usually take between 20-45 minutes each depending on the interviewer.</li>\n<li>are all 1:1.</li>\n<li>will be with both founders, a member of either the growth or engineering team (depending on the role), and usually one other person from your immediate team or function.</li>\n</ul>\n</li>\n<li>Once the interviews are over, the team will meet to discuss several roles and candidates and may:\n<ul>\n<li>ask one or two follow-up questions over email or a quick call.</li>\n<li>go directly to making an offer.</li>\n</ul>\n</li>\n</ul>\n<h2>&nbsp;</h2></div>\n","tags":"[\"postgres\",\"pulumi\",\"javascript\",\"typescript\",\"elixir\",\"management\",\"engineering\",\"database\"]","pubDate":"2024-07-05 16:09:14.855","link":"https://boards.greenhouse.io/supabase/jobs/5219964004","savedDate":"2024-07-05 16:09:14.855","slug":"inside-sales-representative-supabase-2111"},{"id":5658419437,"title":"Creative Manager (Arabia & Africa)","company":"Airalo","image":"https://lever-client-logos.s3.us-west-2.amazonaws.com/55028a36-609c-479c-9553-d4689ff2dd8c-1669620566663.png","description":"<div><b>About Airalo</b></div><div>Alo! Airalo is the world’s first eSIM store that helps people connect in over 200+ countries and regions across the globe. We are building the next digital service that revolutionizes the telecom industry. We are a travel-tech company and an equal-opportunity environment that values and executes diversity, inclusion, and equity. Our team is spread across 50+ countries and six continents. What glues us together is our commitment to changing the way you connect<span style=\"font-size: 13.3333px\">. </span></div><div><br></div><div><b>About you</b></div><div>We hope that you care deeply about the quality of your work, the intrinsic worth of tasks, and the success of your team. You are self-disciplined and do not require micromanagement in terms of your skillset and work ethic. You do your best to flourish as an individual every day while working hard to foster a collaborative team environment. You believe in the importance of being — and staying — authentic, honest, positive, and kind. You are a good interlocutor with clear and concise communication. You are able to manage multiple projects, have an analytical mind, pay keen attention to detail, and love to get your hands dirty. You are cognizant, tolerant, and welcoming of vulnerabilities and cultural differences.</div><div><br></div><div><b>About the Role</b></div><div><b>Position</b>: Full-time / Employee</div><div><b>Location:</b>&nbsp;Remote-first </div><div><b>Benefits:</b>&nbsp;Health Insurance, work-from-anywhere stipend, annual wellness &amp; learning credits, annual all-expenses-paid company retreat in a gorgeous destination &amp; other benefits</div><div><br></div><div>Airalo is looking for a talented and motivated <b>Creative Manager (Arabia &amp; Africa)</b> to join our team and support our rapid growth as we expand into multiple additional global markets while building our B2B &amp; B2B2C offerings. In this role, you will have the opportunity to be one of the first growth leaders to join Airalo, hence defining our brand vision &amp; team structure moving forward. The ideal candidate should have similar experiences implementing rapid growth structures from scratch &amp; possess a strong passion for Tech, Travel &amp; Telecommunications.</div><div>As <b>Creative Manager, (Arabia &amp; Africa)</b> at Airalo, you will implement &amp; oversee all Brand activities across the company for all our active markets (APAC, Arabia &amp; Africa, Europe, North &amp; South America). You will directly manage Brand for our B2C, B2B &amp; B2B2C products. Reporting directly to our <b>Growth Director, Brand</b>, you will manage a team of <b>Regional Creative designers</b> in the company &amp; drive our global brand.</div><h3>Responsibilities include but are not limited to:</h3><li>Working alongside the Growth Director, Brand to develop and formulate brand strategy and roadmaps with a deep understanding of our users, market trends, and competitive landscape, backed by brand and category data analysis</li><li>Develop the overall brand direction for the region, handle impactful product launches, channel, geographic expansion plans, and go-to-market strategies in all our active markets within the region.</li><li>Responsible for maintaining the quality of the brand, acting as a gatekeeper for all created assets by the regional creative team, ensuring that the level of the graphics do not fluctuate or deviate away from the gold standard.</li><li>Develop and execute innovation projects from conceptualization to deployment to drive brand growth across the region.</li><li>Lead the development of the regional creative team, ensuring good mentorship and growth in each individual under their charge.</li><li>Responsible for the project management of the regional creative team, organizing the resources required for a project while developing strategic procedures to fulfill project needs.</li><li>Develop and implement workflow processes for animation and graphic deliverables.</li><li>Keep proper documentation of projects, and prepare and present project status reports at meetings.</li><li>Collaborate with internal departments and their stakeholders to ensure project service deliveries are achieved.</li><li>Responsible for the development of marketing plans by identifying the key opportunities (incorporating understanding of users, competition, and external environment) and developing action plans for the brands in line with business objectives</li><li>Responsible for creating engaging brand experience through strong big Ideas at relevant user touch points including promotions and/or discounts</li><li>Lead internal teams and creative agencies to develop initiatives fit-for-use toolkits (including copy, prints, digital i-banners, social &amp; eCommerce contents, sampling trial toolkits, in-store activation, and demos, etc.), and deploy/guide local delivery team for execution</li><li>Cultivate content marketing strategies targeted at driving traffic, engagement, generating leads, delivering sales, retaining users, and building brand awareness; ongoing creation, optimization, and governance of content including management of brand tone of voice and guidelines; channel management of all content, including email, newsletters, blogs and other</li>,<h3>Must-haves:</h3><li>Degree or Diploma in a relevant design field or equivalent practical experience.</li><li>At least 7 years of experience working in Adobe’s range of Creative Cloud products including Photoshop, Illustrator, Premiere, and After Effects.</li><li>A portfolio highlighting excellence and flexibility of design work and responding to a variety of briefs.</li><li>Your portfolio should showcase your design process, conceptual ability, and examples in communication design, and illustration.</li><li>Relevant degree in marketing with 7+ years of marketing experience in product-led, hyper-growth &amp; fast-paced, B2C, B2B and/or B2B2C environments</li><li>Proven experience in developing brands, portfolios, and categories in a highly competitive environment while building, managing, and expanding creative teams.</li><li>Ability to lead projects and collaborate well with cross-functional teams across brand, go-to-market, tech, operations, and new product development to identify opportunities for expansion</li><li>Excellent interpersonal and communication skills including experience in group presentation and public speaking</li><li>Demonstrates high-quality judgement and decision-making, end-to-end thinking, as well as strong analytical skills</li><li>Strong ownership and entrepreneurial drive. A self-starter who takes initiative is comfortable with ambiguity &amp; complexity and is willing to get hands dirty</li><div><br></div><div><b>Please note that candidates without a portfolio will not be considered.</b></div>,<h3>Good to Have: </h3><li>Experience working with internet and technology companies</li><li>eSims, Telco, MNOs &amp; MNVOs customer marketing experience will be a strong advantage</li><li>Verbal/written fluency in additional local/regional languages</li><div>If you are interested in this position, <b>please apply via the link.</b></div><div><br></div><div><i>We sincerely thank all applicants in advance for submitting their interest in this opportunity with Airalo. </i></div>","tags":"[\"management\",\"B2C\",\"B2B\"]","pubDate":"2024-07-05 01:59:26.002","link":"https://jobs.lever.co/airalo/e5306a66-874d-4926-9fed-fdba44c66c86","savedDate":"2024-07-05 16:09:14.858","slug":"creative-manager-arabia-africa-airalo-8058"},{"id":5545345542,"title":"Junior Accountant (Fully Remote)","company":"CoverGo","image":"https://pbs.twimg.com/profile_images/1382655628523364355/MWPIbbID_400x400.jpg","description":"<p><strong>Top 3 Reasons To Join Us </strong></p><ul> <li>Competitive Salary</li> <li>100% Globally Remote</li> <li>Working on the latest tech for the Insurtech Market Leader</li> </ul><p><strong>About Us</strong></p><p>At CoverGo, our mission is to empower all insurance companies to make insurance 100% digital and accessible to everyone.</p><ul> <li>We are a leading global no-code insurance platform for health, life, and P&amp;C</li> <li>We’re the winner of the Insurtech of the Year in all of Asia and other awards globally</li> <li>We work with insurance enterprise clients such as AXA, Bupa, MSIG, Dai-ichi, Bank of China Group Insurance, and many more</li> <li>We're an international, diverse team of over 120 people with 30 nationalities and team members working remotely from all over the world</li> <li>We are fully funded and backed by reputable VC funds and strategic institutional investors</li> <li>We have a global presence in Asia, EMEA and the Americas</li> <li>We’ve grown our annualized revenue by over 30x since January 2021</li> <li>We’re constantly working towards making CoverGo a workplace that you love coming to. We deeply believe that bringing together a diversity of thoughts, expressions, and perspectives is key to building the best culture for equally diverse communities all over the world</li> </ul><p><strong>What you will do:</strong></p><ul> <li>Responsible for daily accounting operations in Xero system for multiple entities</li> <li>Maintain proper and accurate records and supporting documents</li> <li>Assist with the preparation of the budget, forecast, and financial analysis</li> <li>Cash flow analysis and monthly reporting</li> <li>Daily communication with suppliers and various stakeholders on payments and accounting documentation</li> <li>Responsible for AP function of the firm</li> <li>Manage Inter-company reconciliations</li> <li>Perform ad hoc assignments and projects as required</li> </ul><p><strong>What we are looking for:</strong></p><ul> <li>Degree holder in Accounting, Finance, and related discipline</li> <li>CPA, ACCA or similar</li> <li>Minimum of 2 years of accounting experience</li> <li>Xero accounting software experience</li> <li>Excellent skills in the use of Microsoft Office</li> <li>Competent in to use of various software, App and IT solutions</li> <li>Working experience with international businesses</li> <li>Able to work independently and under pressure in a fast-paced environment with an emphasis on accuracy and timeliness</li> <li>Meticulous, well-organized and conscientious with a high level of initiative at work</li> <li>Self-motivated, hardworking, a strong sense of responsibility with a positive working attitude</li> <li>Resourceful, can-do attitude and willingness to learn and go beyond</li> <li>Good command of English is a must, knowing other languages would be an advantage</li> </ul><p><strong>Why You'll Love Working Here</strong></p><ul> <li>Fully Remote</li> <li>Flexible Leave</li> <li>International Environment</li> <li>Competitive renumeration package</li> <li>Performance Bonus</li> <li>Company activities and events</li> <li>Learning and development plan</li> </ul><p><strong>CoverGo Company</strong><a href=\"https://www.youtube.com/watch?v=YI0ezLxvFvA\" rel=\"nofollow noreferrer noopener\" class=\"external\"><strong> Video</strong></a></p><p>By submitting your application, you confirm that you have read, understood, and accepted the content of CoverGo’s <a href=\"https://apply.workable.com/covergo/gdpr_policy?lng=en\" target=\"_blank\" rel=\"nofollow noreferrer noopener\" class=\"external\">Privacy Notice</a> and you consent to the processing of your data as part of this application.</p><h3>Requirements: </h3><h3>Benefits: </h3>","tags":"[\"Finance\"]","pubDate":"2024-07-05 00:00:00.000","link":"https://apply.workable.com/covergo/j/A437EF15E3","savedDate":"2024-07-05 16:09:14.856","slug":"junior-accountant-fully-remote-covergo-6940"},{"id":1530608802,"title":"Senior Business Analyst - Insurance (Fully Remote)","company":"CoverGo","image":"https://pbs.twimg.com/profile_images/1382655628523364355/MWPIbbID_400x400.jpg","description":"<h3><strong>Top 3 Reasons To Join Us</strong></h3><ul> <li>Competitive Salary</li> <li>100% Remote</li> <li>Working on the latest tech for the Insurtech Market Leader</li> </ul><h3><strong>About Us</strong></h3><p>At CoverGo, our mission is to empower all insurance companies to make insurance 100% digital and accessible to everyone.</p><ul> <li>We are a leading global no-code insurance platform for health, life, and P&amp;C</li> <li>We’re the winner of the Insurtech of the Year in all of Asia and other awards globally</li> <li>We work with insurance enterprise clients such as AXA, Bupa, MSIG, Dai-ichi, Bank of China Group Insurance, and many more</li> <li>We're an international, diverse team of over 120 people with 30 nationalities and team members working remotely from all over the world</li> <li>We are fully funded and backed by reputable VC funds and strategic institutional investors</li> <li>We have a global presence in Asia, EMEA and the Americas</li> <li>We’ve grown our annualized revenue by over 30x since January 2021</li> <li>We’re constantly working towards making CoverGo a workplace that you love coming to. We deeply believe that bringing together a diversity of thoughts, expressions, and perspectives is key to building the best culture for equally diverse communities all over the world</li> </ul><h3><strong>What You Will Do:</strong></h3><ul> <li>Work with clients and technical resources to identify their business problems and develop the right approach and analytical solution</li> <li>Plan and design simple to semi-complex business processes and system modifications</li> <li>Make recommendations to improve and support business activities</li> <li>Gather business requirements through a variety of techniques such as work sessions and interviews then analyze and document client complex business requirements and processes; communicate these requirements to appropriate parties</li> <li>Create complex test case scenarios to be used in testing; monitor/oversee the testing of business applications to verify that all client requirements are incorporated into the system design</li> <li>Develop business requirements documents/user stories to support the required modifications</li> <li>May plan, allocate and monitor work of other business analysts</li> <li>Understand simple to complex systems and related data to surface actionable insights, demonstrate sound judgment and decision-making skills</li> <li>Assist in providing time estimates for project related tasks</li> <li>Aid in updating process and procedural documentation</li> <li>Develop basic understanding of technical development cycle of mobile application or web portals</li> <li>Support QA, UAT and Release phases of the project via defect analysis, change maintenance, etc.</li> <li>Any other task that may be assigned</li> </ul><h3><strong>What We Need:</strong></h3><ul> <li>Minimum 5 years of experience as Business Analyst</li> <li>A degree in Business, IT or any relevant field</li> <li>Previous experience working in the insurance industry is required (Insurtech or health insurance experience is preferred)</li> <li>Health Insurance-related domain certification from INS/LOMA or III is an added advantage</li> <li>Knowledge of business analysis concepts of defining requirements, translating to technical solutions, and Agile approach to prioritizing work to epics, sprints</li> <li>Business analysis skills including facilitation, process documentation, requirements gathering and user acceptance testing</li> <li>Good organizational/time management skills to prioritize work and meet deadlines within defined timeframes</li> <li>Experience in an Agile and/or Scrum environment is a must</li> <li>Basic knowledge in generating process documentation, and document system functionality, data integration, and workflow</li> <li>Excellent written and verbal communication skills in English</li> <li>Technical writing skills and knowledge of other languages (Chinese) is a plus</li> <li>Currently based in the Philippines</li> </ul><h3><strong>Why You'll Love Working Here</strong></h3><ul> <li>Fully Remote</li> <li>Flexible Leave</li> <li>International Environment</li> <li>Competitive renumeration package</li> <li>Performance Bonus</li> <li>Stock Options after 6 months </li> <li>Company activities and events</li> <li>Learning and development plan</li> <li>Remote work allowance</li> </ul><p><strong>CoverGo Company </strong><a href=\"https://www.youtube.com/watch?v=YI0ezLxvFvA\" rel=\"nofollow noreferrer noopener\" class=\"external\"><strong>Video</strong></a></p><p>By submitting your application, you confirm that you have read, understood, and accepted the content of CoverGo’s <a href=\"https://apply.workable.com/covergo/gdpr_policy?lng=en\" target=\"_blank\" rel=\"nofollow noreferrer noopener\" class=\"external\">Privacy Notice</a> and you consent to the processing of your data as part of this application.</p><p><a href=\"https://www.youtube.com/watch?v=YI0ezLxvFvA\" rel=\"nofollow noreferrer noopener\" class=\"external\"></a></p><h3>Requirements: </h3><h3>Benefits: </h3>","tags":"[\"management\"]","pubDate":"2024-07-05 00:00:00.000","link":"https://apply.workable.com/covergo/j/80E91A9EC3","savedDate":"2024-07-05 16:09:14.856","slug":"senior-business-analyst-insurance-fully-remote-covergo-7118"},{"id":9931204855,"title":"Senior Business Analyst - Insurance (Fully Remote)","company":"CoverGo","image":"https://pbs.twimg.com/profile_images/1382655628523364355/MWPIbbID_400x400.jpg","description":"<h3><strong>Top 3 Reasons To Join Us</strong></h3><ul> <li>Competitive Salary</li> <li>100% Remote</li> <li>Working on the latest tech for the Insurtech Market Leader</li> </ul><h3><strong>About Us</strong></h3><p>At CoverGo, our mission is to empower all insurance companies to make insurance 100% digital and accessible to everyone.</p><ul> <li>We are a leading global no-code insurance platform for health, life, and P&amp;C</li> <li>We’re the winner of the Insurtech of the Year in all of Asia and other awards globally</li> <li>We work with insurance enterprise clients such as AXA, Bupa, MSIG, Dai-ichi, Bank of China Group Insurance, and many more</li> <li>We're an international, diverse team of over 120 people with 30 nationalities and team members working remotely from all over the world</li> <li>We are fully funded and backed by reputable VC funds and strategic institutional investors</li> <li>We have a global presence in Asia, EMEA and the Americas</li> <li>We’ve grown our annualized revenue by over 30x since January 2021</li> <li>We’re constantly working towards making CoverGo a workplace that you love coming to. We deeply believe that bringing together a diversity of thoughts, expressions, and perspectives is key to building the best culture for equally diverse communities all over the world</li> </ul><h3>What You Will Do:</h3><ul> <li>Work with clients and technical resources to identify their business problems and develop the right approach and analytical solution</li> <li>Plan and design simple to semi-complex business processes and system modifications</li> <li>Make recommendations to improve and support business activities</li> <li>Gather business requirements through a variety of techniques such as work sessions and interviews then analyze and document client complex business requirements and processes; communicate these requirements to appropriate parties</li> <li>Create complex test case scenarios to be used in testing; monitor/oversee the testing of business applications to verify that all client requirements are incorporated into the system design</li> <li>Develop business requirements documents/user stories to support the required modifications</li> <li>May plan, allocate and monitor work of other business analysts</li> <li>Understand simple to complex systems and related data to surface actionable insights, demonstrate sound judgment and decision-making skills</li> <li>Assist in providing time estimates for project related tasks</li> <li>Aid in updating process and procedural documentation</li> <li>Develop basic understanding of technical development cycle of mobile application or web portals</li> <li>Support QA, UAT and Release phases of the project via defect analysis, change maintenance, etc.</li> <li>Any other task that may be assigned</li> </ul><h3>What We Need:</h3><ul> <li>Minimum 5 years of experience as Business Analyst</li> <li>A degree in Business, IT or any relevant field</li> <li>Previous experience working in the insurance industry is required (Insurtech or health insurance experience is preferred)</li> <li>Health Insurance-related domain certification from INS/LOMA or III is an added advantage</li> <li>Knowledge of business analysis concepts of defining requirements, translating to technical solutions, and Agile approach to prioritizing work to epics, sprints</li> <li>Business analysis skills including facilitation, process documentation, requirements gathering and user acceptance testing</li> <li>Good organizational/time management skills to prioritize work and meet deadlines within defined timeframes</li> <li>Experience in an Agile and/or Scrum environment is a must</li> <li>Basic knowledge in generating process documentation, and document system functionality, data integration, and workflow</li> <li>Excellent written and verbal communication skills in English</li> <li>Technical writing background is a plus</li> <li>Currently based in Thailand and speaks native Thai (required)</li> </ul><h3><strong>Why You'll Love Working Here</strong></h3><ul> <li>Fully Remote</li> <li>Flexible Leave</li> <li>International Environment</li> <li>Competitive renumeration package</li> <li>Performance Bonus</li> <li>Stock Options after 6 months </li> <li>Company activities and events</li> <li>Learning and development plan</li> <li>Remote work allowance</li> </ul><p><strong>CoverGo Company </strong><a href=\"https://www.youtube.com/watch?v=YI0ezLxvFvA\" rel=\"nofollow noreferrer noopener\" class=\"external\"><strong>Video</strong></a></p><p>By submitting your application, you confirm that you have read, understood, and accepted the content of CoverGo’s <a href=\"https://apply.workable.com/covergo/gdpr_policy?lng=en\" target=\"_blank\" rel=\"nofollow noreferrer noopener\" class=\"external\">Privacy Notice</a> and you consent to the processing of your data as part of this application.</p><p><a href=\"https://www.youtube.com/watch?v=YI0ezLxvFvA\" rel=\"nofollow noreferrer noopener\" class=\"external\"></a></p><h3>Requirements: </h3><h3>Benefits: </h3>","tags":"[\"management\"]","pubDate":"2024-07-05 00:00:00.000","link":"https://apply.workable.com/covergo/j/89629A64BC","savedDate":"2024-07-05 16:09:14.857","slug":"senior-business-analyst-insurance-fully-remote-covergo-9734"},{"id":5929966797,"title":"Corporate Sales Specialist (Germany)","company":"Airalo","image":"https://lever-client-logos.s3.us-west-2.amazonaws.com/55028a36-609c-479c-9553-d4689ff2dd8c-1669620566663.png","description":"<div><b>About Airalo</b></div><div>Alo! Airalo is the world’s first eSIM store that helps people connect in over 200+ countries and regions across the globe. We are building the next digital service that revolutionizes the telecom industry. We are a travel-tech company and an equal-opportunity environment that values and executes diversity, inclusion, and equity. Our team is spread across 50+ countries and six continents. What glues us together is our commitment to changing the way you connect<span style=\"font-size: 13.3333px\">. </span></div><div><br></div><div><b>About you</b></div><div>We hope that you care deeply about the quality of your work, the intrinsic worth of tasks, and the success of your team. You are self-disciplined and do not require micromanagement in terms of your skillset and work ethic. You do your best to flourish as an individual every day while working hard to foster a collaborative team environment. You believe in the importance of being — and staying — authentic, honest, positive, and kind. You are a good interlocutor with clear and concise communication. You are able to manage multiple projects, have an analytical mind, pay keen attention to detail, and love to get your hands dirty. You are cognizant, tolerant, and welcoming of vulnerabilities and cultural differences.</div><div><br></div><div><b>About the Role</b></div><div><b>Position</b>: Full-time / Employee</div><div><b>Location:</b>&nbsp;Remote-first </div><div><b>Benefits:</b>&nbsp;Health Insurance, work-from-anywhere stipend, annual wellness &amp; learning credits, annual all-expenses-paid company retreat in a gorgeous destination &amp; other benefits</div><div><br></div><div>Airalo is looking for a <b>Corporate Sales Specialist</b> to join the <b>Airalo Partnerships</b> department.</div><div>Physical SIM cards are passe. The future of connectivity, including for business travelers, is through eSIMs. As the undisputed industry leader in the B2C segment, we are now looking to expand our presence in the corporate channel. Through the ‘Airalo for Corporates’ solution, we will offer significant savings and considerable ease to corporates when their employees travel for work.</div><div>As the <b>Corporate Sales Specialist</b> for Germany, you will own Airalo’s corporate sales strategy and execution to ensure Airalo’s adoption as the business travel connectivity solution across small, medium and large enterprises.</div><h3>Responsibilities include but are not limited to:</h3><li>Work closely with the Corporate Sales Manager, (Europe &amp; CIS) and other team members in the department</li><li>Conduct competitive research and define the Airalo corporate distribution roadmap to maintain Airalo’s status as the preferred provider across corporate partners</li><li>Market mapping of the top corporate prospects in key cities across Germany and creating a distribution roadmap to achieve maximum penetration across the universe</li><li>Onboard and support new corporate partners as they join the Airalo partner community</li><li>Build and maintain fruitful relationships with key stakeholders (Human resources, travel admins, IT admins) at corporate partners to drive mutual growth</li><li>Organize events and roadshows at key corporates to educate employees about benefits of eSIMs over other travel connectivity options</li><li>Collaborate and work with different internal and external stakeholders to develop and execute projects/opportunities successfully</li><li>Own and deliver monthly, quarterly and annual OKRs for your channel with regular tracking and progress reports</li><li>As a core member of the German squad, always explore ways and means to further consolidate Airalo’s dominance in Germany.</li>,<h3>Must-haves:</h3><li>2+ years of experience in corporate channel sales or business development in the tech, travel or telecom industry</li><li>Good understanding of the corporate channel (preferably the travel and/or telecom corporate) in Germany.</li><li>This is a largely relationship-driven channel. You must be able to forge and nurture relationships with stakeholders across the channel</li><li>Ability to narrate a good story - Airalo’s unique story and the problem we solve for our users make it a compelling pitch for partners</li><li>Ability to employ sales techniques, including effective questioning, objection handling, consultative selling, and solution selling</li><li>Ability to multi-task</li><li>Experience with sales and partnerships tools</li><li>Perfect verbal and written communication skills in German and English.</li>,<h3>Good to have:</h3><li>Familiarity with the travel or telecom industry</li><li>Prior work experience in the travel or telecom industry</li><li>Knowledge of eSIM and GSMA-related technologies and services</li><li>Certificates and courses in sales and partnerships</li><div>If you are interested in this position, <b>please apply via the link.</b></div><div><br></div><div><i>We sincerely thank all applicants in advance for submitting their interest in this opportunity with Airalo. </i></div>","tags":"[\"management\",\"B2C\"]","pubDate":"2024-07-04 20:16:59.349","link":"https://jobs.lever.co/airalo/916172c4-792e-4795-90c4-d8a8d029d312","savedDate":"2024-07-05 16:09:14.858","slug":"corporate-sales-specialist-germany-airalo-3715"},{"id":9819338378,"title":"Corporate Sales Specialist (UK/I)","company":"Airalo","image":"https://lever-client-logos.s3.us-west-2.amazonaws.com/55028a36-609c-479c-9553-d4689ff2dd8c-1669620566663.png","description":"<div><b>About Airalo</b></div><div>Alo! Airalo is the world’s first eSIM store that helps people connect in over 200+ countries and regions across the globe. We are building the next digital service that revolutionizes the telecom industry. We are a travel-tech company and an equal-opportunity environment that values and executes diversity, inclusion, and equity. Our team is spread across 50+ countries and six continents. What glues us together is our commitment to changing the way you connect<span style=\"font-size: 13.3333px\">. </span></div><div><br></div><div><b>About you</b></div><div>We hope that you care deeply about the quality of your work, the intrinsic worth of tasks, and the success of your team. You are self-disciplined and do not require micromanagement in terms of your skillset and work ethic. You do your best to flourish as an individual every day while working hard to foster a collaborative team environment. You believe in the importance of being — and staying — authentic, honest, positive, and kind. You are a good interlocutor with clear and concise communication. You are able to manage multiple projects, have an analytical mind, pay keen attention to detail, and love to get your hands dirty. You are cognizant, tolerant, and welcoming of vulnerabilities and cultural differences.</div><div><br></div><div><b>About the Role</b></div><div><b>Position</b>: Full-time / Employee</div><div><b>Location:</b>&nbsp;Remote-first </div><div><b>Benefits:</b>&nbsp;Health Insurance, work-from-anywhere stipend, annual wellness &amp; learning credits, annual all-expenses-paid company retreat in a gorgeous destination &amp; other benefits</div><div><br></div><div>Airalo is looking for a <b>Corporate Sales Specialist</b> to join the <b>Airalo Partnerships</b> department.</div><div>Physical SIM cards are passe. The future of connectivity, including for business travelers, is through eSIMs. As the undisputed industry leader in the B2C segment, we are now looking to expand our presence in the corporate channel. Through the ‘Airalo for Corporates’ solution, we will offer significant savings and considerable ease to corporates when their employees travel for work.</div><div>As the <b>Corporate Sales Specialist</b> for UK/I, you will own Airalo’s corporate sales strategy and execution to ensure Airalo’s adoption as the business travel connectivity solution across small, medium and large enterprises.</div><h3>Responsibilities include but are not limited to:</h3><li>Work closely with the Corporate Sales Manager, (Europe &amp; CIS) and other team members in the department</li><li>Conduct competitive research and define the Airalo corporate distribution roadmap to maintain Airalo’s status as the preferred provider across corporate partners</li><li>Market mapping of the top corporate prospects in key cities across UK/I and creating a distribution roadmap to achieve maximum penetration across the universe</li><li>Onboard and support new corporate partners as they join the Airalo partner community</li><li>Build and maintain fruitful relationships with key stakeholders (Human resources, travel admins, IT admins) at corporate partners to drive mutual growth</li><li>Organize events and roadshows at key corporates to educate employees about benefits of eSIMs over other travel connectivity options</li><li>Collaborate and work with different internal and external stakeholders to develop and execute projects/opportunities successfully</li><li>Own and deliver monthly, quarterly and annual OKRs for your channel with regular tracking and progress reports</li><li>As a core member of the UK/I squad, always explore ways and means to further consolidate Airalo’s dominance in UK/I.</li>,<h3>Must-haves:</h3><li>2+ years of experience in corporate channel sales or business development in the tech, travel or telecom industry</li><li>Good understanding of the corporate channel (preferably the travel and / or telecom corporate) in UK/I.</li><li>This is a largely relationship driven channel. You must be able to forge and nurture relationships with stakeholders across the channel</li><li>Ability to narrate a good story - Airalo’s unique story and the problem we solve for our users makes it a compelling pitch for partners</li><li>Ability to employ sales techniques, including effective questioning, objection handling, consultative selling, and solution selling</li><li>Ability to multi-task</li><li>Experience with sales and partnerships tools</li><li>Perfect verbal and written communication skills in English</li>,<h3>Good to have:</h3><li>Familiarity with the travel or telecom industry</li><li>Prior work experience in the travel or telecom industry</li><li>Knowledge of eSIM and GSMA-related technologies and services</li><li>Certificates and courses in sales and partnerships</li><div>If you are interested in this position, <b>please apply via the link.</b></div><div><br></div><div><i>We sincerely thank all applicants in advance for submitting their interest in this opportunity with Airalo. </i></div>","tags":"[\"management\",\"B2C\"]","pubDate":"2024-07-04 20:09:57.629","link":"https://jobs.lever.co/airalo/cd8c4cea-768c-441a-941d-615d896ea0a9","savedDate":"2024-07-05 16:09:14.858","slug":"corporate-sales-specialist-uk-i-airalo-8769"},{"id":9427941191,"title":"Senior Software Engineer (Frontend)","company":"Pluto Card","image":"https://pbs.twimg.com/profile_images/1520019984780513281/qnVtutKu_400x400.jpg","description":"<h3><strong>Company Overview</strong></h3><p>Pluto is a modern financial operating system for global businesses. We combine global payments infrastructure with intelligent workflow automation to provide businesses with unparalleled insights, control, and automation over their spending.</p><p>Pluto is a venture-capital funded company backed by top-tier Silicon Valley investors and built by folks from some of the best technology institutions in the world -- Google, Shopify, Square, Uber, PayPal, Cash App, Digital Ocean, Y Combinator, and more</p><p>We are reinventing corporate finance for the modern age and are solving challenging problems in the B2B payments space. With a stronghold in Dubai and sights set on expansion, we're now looking for a seasoned&nbsp;frontend engineer to help shape our next chapter</p><p></p><h3>Role</h3><p>As a Senior Frontend Engineer, you will lead the development of cutting-edge web applications and libraries for our flagship product. This role involves collaborating with high-performing cross-functional teams to build and ship greenfield projects.</p><p></p><h3><strong>Key Responsibilities</strong></h3><ul> <li>Develop and maintain complex software applications using React, Typescript, and GraphQL</li> <li>Lead the development lifecycle of features and work streams from design to deployment</li> <li>Collaborate with product managers, designers, and backend engineers to deliver world-class products</li> <li>Become a voracious problem solver who can tackle difficult issues on tight timelines, manage cross-functional dependencies and set an exemplary bar for engineering within the organization</li> <li>Write and maintain clean, maintainable and testable code, leveraging design patterns and architecture where appropriate</li> <li>Participate in code reviews, pair-programming sessions and provide constructive feedback to peers</li> <li>Develop a strong understanding of the domain and bring a deep product and design mindset while building solutions</li> </ul><h3>Requirements: </h3><ul> <li>Bachelor’s or Master’s degree in Computer Science, Software Engineering or related field</li> <li>Strong fundamentals in computer science, algorithms and data structures</li> <li>5+ years of experience in software development</li> <li>Mastery in React and Typescript, familiarity with GraphQL</li> <li>Strong understanding of web fundamentals, web performance, software design patterns and architecture</li> <li>Experience with modern front-end development tools and frameworks</li> <li>Excellent problem-solving and analytical skills</li> <li>Excellent communication and collaboration skills</li> <li>Experience working with nimble, cross-functional teams with high shipping velocity</li> </ul><p></p><h3><strong>Our Values</strong></h3><p>At Pluto, we live by the following core values:<br></p><ul> <li> <a href=\"https://handbook.gitlab.com/handbook/people-group/directly-responsible-individuals/\" rel=\"nofollow noreferrer noopener\" class=\"external\"><strong>Directly Responsible Individuals (DRI)</strong></a>: We empower team members with autonomy to own their projects and outcomes fully, fostering a culture of accountability, clarity and outsized impact. As the DRI you are the driver of success for your projects — proactively identifying, communicating and mitigating risks and resolving blockers to ensure success.<br> </li> <li> <strong>Clear Communication</strong>: At Pluto, we emphasize clear, transparent communication as fundamental to our success. We strive for clarity, succinctness and transparency in all interactions, ensuring that every message is articulated clearly and understood universally across our teams. This commitment to clarity reduces misunderstandings and fosters a more productive environment especially for distributed teams.<br> </li> <li> <strong>Systems Thinking &amp; First Principles Reasoning</strong>: We love to deconstruct problems and innovate from the ground up. By understanding complex systems and questioning assumptions, we are able to develop creative solutions to difficult problems.<br> </li> <li> <strong>Fact-centric</strong>: We are intentional about questioning our assumptions, and bringing the facts to focus by diving into the data, quick-fire experimentation &amp; swift prototyping. We make room for varied perspectives &amp; calibrate our goals with metrics that track our progress, and accurately reflect reality.</li> </ul><h3>Benefits: </h3><ul> <li>Competitive compensation &amp; stock options so you have skin in the game</li> <li>Remote-first work environment</li> <li>We'll ship you a new MacBook</li> <li>Monthly fitness benefit up to $100 USD</li> <li>Home-office budget up to $1000 USD</li> <li>Discretionary learning budget</li> </ul>","tags":"[\"typescript\",\"Finance\",\"engineering\",\"B2B\"]","pubDate":"2024-07-04 00:00:00.000","link":"https://apply.workable.com/pluto-card/j/DE0D8F8E7B","savedDate":"2024-07-05 16:09:14.856","slug":"senior-software-engineer-frontend-pluto-card-3535"},{"id":2837173925,"title":"Fullstack Developer (React.js + Java)","company":"Software Mind","image":"https://remotive.com/job/1921044/logo","description":"<p><br><br></p>\n<div class=\"h3\">Company Description</div>\n<p>We are<strong> Software Mind</strong>, an awesome team of engineers who are ready to ramp up any top-notch company’s projects! Our aim? To always be one step ahead. Become part of a multicultural company in constant growth with an excellent work environment certified by Great Place To Work!</p>\n<p><br><br></p>\n<div class=\"h3\">Job Description</div>\n<p>We're looking for a skilled <strong>Fullstack Developer (Frontend oriented)</strong> to join our team and work with one of our inspiring US clients, a powerful Social Media Platform that helps global companies and organizations boost and enhance their marketing and branding actions. </p>\n<p>If you enjoy working with cutting-edge technologies in a fast-paced environment this opportunity is for you!</p>\n<p> </p>\n<p><br><br></p>\n<div class=\"h3\">Qualifications</div>\n<p><strong>Expectations - the experience you need</strong></p>\n<ul style=\"\">\n<li style=\"\">BS/MS in Computer Science, Engineering, or related experience. </li>\n<li style=\"\">4+ years of relevant experience as a software engineer. </li>\n<li style=\"\">4+ years of experience with frontend technologies including HTML, JavaScript, CSS, React.js. </li>\n<li style=\"\">Experience with Java programming language including object-oriented design.</li>\n<li style=\"\">Experience building scalable infrastructure, REST interfaces, and distributed systems. </li>\n</ul>\n<p><strong>Nice to have</strong></p>\n<ul style=\"\">\n<li style=\"\">Open Source tech such as: Elastic search, Redis, MySQL. </li>\n<li style=\"\">Experience with AWS technologies (EC2, DynamoDB) or equivalent. </li>\n<li style=\"\">Understanding of Git, pull requests. </li>\n<li style=\"\">Continuous integration tools such as Jenkins.</li>\n</ul>\n<p><strong>What you will do:</strong></p>\n<ul style=\"\">\n<li style=\"\">Collaborating with the team making sure deliverables are delivered on time with high quality. </li>\n<li style=\"\">Developing and unit testing high quality code to implement features. </li>\n<li style=\"\">Testing peer features during the development process. </li>\n<li style=\"\">Performing code reviews and improving code quality by applying solid design principles. </li>\n<li style=\"\">Exhibiting end-to-end ownership of a feature/task/bug. </li>\n<li style=\"\">Supporting the application in production.</li>\n</ul>\n<p><strong>Our benefits </strong></p>\n<ul style=\"\">\n<li style=\"\">\n<p>Educational resources  </p>\n</li>\n<li style=\"\">\n<p>Flexible schedule and Work From Anywhere  </p>\n</li>\n<li style=\"\">\n<p>Referral Program  </p>\n</li>\n<li style=\"\">\n<p>Supportive and chill atmosphere </p>\n</li>\n</ul>\n<p> </p>\n<p><strong>Position at: Software Mind Latam</strong></p>\n<p><br><br></p>\n<div class=\"h3\">Additional Information</div>\n<img src=\"https://remotive.com/job/track/1921044/blank.gif?source=public_api\" alt=\"\"/>","tags":"[\"CSS\",\"html\",\"java\",\"javascript\"]","pubDate":"2024-07-03 23:20:21.000","link":"https://remotive.com/remote-jobs/software-dev/fullstack-developer-react-js-java-1921044","savedDate":"2024-07-05 16:09:14.854","slug":"fullstack-developer-react-js-java-software-mind-2558"},{"id":4061077618,"title":"Finnish Writing Gig","company":"Outlierai","image":"https://remotive.com/job/1922135/logo","description":"<p>FOR FINNISH WRITING EXPERTS ONLY</p>\n<p><strong>Are you interested in helping to train AI models to become better writers?</strong></p>\n<p><strong>How it works:</strong></p>\n<ul style=\"\">\n<li style=\"\"><span style='\"font-weight:'>We have several open projects where we are looking for talented writers to help train generative artificial intelligence models to become better writers.</span></li>\n<li style=\"\"><span style='\"font-weight:'>You can work on all of our projects remotely. Hours are flexible, so you can work whenever is best for you.</span></li>\n<li style=\"\"><span style='\"font-weight:'>Your earnings from ongoing projects are sent out weekly.</span></li>\n</ul>\n<p><strong>You Will: </strong></p>\n<ul style=\"\">\n<li style=\"\"><span style='\"font-weight:'>Work on various writing in Finnish projects to train generative AI models.</span></li>\n<li style=\"\"><span style='\"font-weight:'>Some examples of projects you might work on: </span></li>\n<ul style=\"\">\n<li style=\"\"><span style='\"font-weight:'>Rank a series of responses that were produced by an AI model.</span></li>\n<li style=\"\"><span style='\"font-weight:'>Based on a given topic, write a short story about that topic.</span></li>\n<li style=\"\"><span style='\"font-weight:'>Assess whether a piece of text produced by an AI model is factually accurate or not.</span></li>\n</ul>\n</ul>\n<p><strong>Preferred Qualifications: </strong></p>\n<p><span style='\"font-weight:'>These are not must-have qualifications! You should apply if you meet </span><strong>any</strong><span style='\"font-weight:'> of these (or anything similar you think makes you a good fit).</span></p>\n<ul style=\"\">\n<li style=\"\"><span style='\"font-weight:'>Professional Translator</span></li>\n<li style=\"\"><span style='\"font-weight:'>Enrollment or completion of an undergraduate program in a humanities field or field related to writing</span></li>\n<li style=\"\"><span style='\"font-weight:'>Enrollment or completion in a graduate program related to creative writing</span></li>\n<li style=\"\"><span style='\"font-weight:'>Experience writing professionally (copywriter, journalist, technical writer, editor, etc.)</span></li>\n</ul>\n<p><strong>Earnings &amp; Duration:</strong></p>\n<ul style=\"\">\n<li style=\"\"><span style='\"font-weight:'>&lt;span data-sheets-root=\"1\" data-sheets-value=\"{\"1\":2,\"2\":\"5 - 7.5 USD / hr\"}\" data-sheets-userformat=\"{\"2\":1,\"3\":{\"1\":2,\"2\":\"_(\\\"$\\\"* #,##0.00_);_(\\\"$\\\"* \\\\(#,##0.00\\\\);_(\\\"$\\\"* \\\"-\\\"??_);_(@_)\",\"3\":1}}\" data-sheets-formula=\"=R[0]C[-3]&amp;\" - \"&amp;R[0]C[-2]&amp;\" USD / hr\"\"&gt;<strong>Base Pay Rate:</strong> Up to $30 per hour</span></li>\n<li style=\"\">Location: Remote (Globally)</li>\n<li style=\"\"><span style='\"font-weight:'>Duration: Variable depending on project length, flexible hours</span></li>\n</ul>\n<p> </p>\n<p>This opportunity involves contracting for Smart Ecosystem, Inc.</p>\n<p> </p><div class='\"content-conclusion\"'><p><em>Base pay is determined by multiple factors, including the area of expertise, years of experience, and skillset needed for the project. Pay rates vary during the project lifecycle. For example, rates for onboarding are lower.</em></p>\n<p><em><strong>PLEASE NOTE</strong></em>: <em>We collect, retain and use personal data for our professional business purposes, including notifying you of job opportunities that may be of interest and sharing with our affiliates. We limit the personal data we collect to that which we believe is appropriate and necessary to manage applicants’ needs, provide our services, and comply with applicable laws. Any information we collect in connection with your application will be treated in accordance with our internal policies and programs designed to protect personal data.</em></p></div><img src=\"https://remotive.com/job/track/1922135/blank.gif?source=public_api\" alt=\"\"/>","tags":"[\"AI/ML\",\"editing\",\"onboarding\"]","pubDate":"2024-07-03 21:20:58.000","link":"https://remotive.com/remote-jobs/writing/finnish-writing-gig-1922135","savedDate":"2024-07-05 16:09:14.855","slug":"finnish-writing-gig-outlierai-8137"},{"id":8069733167,"title":"Staff Software Engineer, Team Lead","company":"Helika","image":"https://remotive.com/job/1921143/logo","description":"<div class=\"h2\"><strong>About Helika:</strong></div><p style=\"min-height:1.5em\">Helika provides industry leading solutions to help studios build, grow, and optimize their games. We are an industry-leading data analytics, marketing, and game management platform that focuses on solving these main challenges for studios:</p><ul style=\"\"><li style=\"\"><p style=\"min-height:1.5em\">Driving scalable profitable User Acquisition via <strong>Helika Acquire </strong></p></li><li style=\"\"><p style=\"min-height:1.5em\">Providing comprehensive insights that lead to a holistic understandings of a game’s ecosystem via <strong>Helika Analyze</strong></p></li><li style=\"\"><p style=\"min-height:1.5em\">Providing the tools to create compelling and engaging user experiences via <strong>Helika Engage</strong></p></li><li style=\"\"><p style=\"min-height:1.5em\">Optimizing user experiences to improve player engagement, retention, and monetization via <strong>Helika Optimize</strong></p></li><li style=\"\"><p style=\"min-height:1.5em\">Programmatically creating contextual experiences relative to segments and individual users via <strong>Helika AI</strong></p></li></ul><p style=\"min-height:1.5em\">Regardless of technical or analytical expertise, studios can double down on what's working, cut what isn't, and spend more time building the best games with Helika. </p><p style=\"min-height:1.5em\">Helika is one tool to solve all data problems for Game Studios.</p><div class=\"h2\"><strong>About the Role:</strong></div><p style=\"min-height:1.5em\">As our Staff Software Engineer, Team Lead, you will play a key role in shaping and enhancing the Helika platform. Reporting directly to the Head of Engineering, you will be responsible for designing, developing, and maintaining scalable and efficient full-stack solutions that drive our platform's functionality and performance. Working with a tech stack that includes Python, JavaScript, FastAPI, and AWS, you will lead a team of talented engineers, collaborating closely with cross-functional teams to deliver innovative features and solutions that address the evolving needs of our clients.</p><p style=\"min-height:1.5em\"></p><div class=\"h2\"><strong>Key Responsibilities:</strong></div><p style=\"min-height:1.5em\"><strong>Lead the Design and Implementation of Full-Stack Solutions:</strong></p><ul style=\"\"><li style=\"\"><p style=\"min-height:1.5em\">Architect and develop robust and scalable full-stack applications using Python, JavaScript, and FastAPI.</p></li><li style=\"\"><p style=\"min-height:1.5em\">Collaborate with data, frontend, and backend engineers to ensure seamless integration of features and functionalities.</p></li><li style=\"\"><p style=\"min-height:1.5em\">Review PRs across different engineering pods and document knowledge for team context sharing.</p></li><li style=\"\"><p style=\"min-height:1.5em\">Implement best practices for code quality, performance, and security across the entire stack.</p></li></ul><p style=\"min-height:1.5em\"><strong>Drive Technical Innovation and Excellence:</strong></p><ul style=\"\"><li style=\"\"><p style=\"min-height:1.5em\">Stay updated on emerging technologies and industry trends to drive technical innovation within the team.</p></li><li style=\"\"><p style=\"min-height:1.5em\">Propose and implement solutions to optimize system architecture, performance, and scalability.</p></li><li style=\"\"><p style=\"min-height:1.5em\">Mentor junior engineers and foster a culture of continuous learning and improvement.</p></li></ul><p style=\"min-height:1.5em\"><strong>Collaborate with Cross-Functional Teams:</strong></p><ul style=\"\"><li style=\"\"><p style=\"min-height:1.5em\">Work closely with product managers, designers, and other stakeholders to understand requirements and translate them into technical solutions.</p></li><li style=\"\"><p style=\"min-height:1.5em\">Collaborate with QA engineers to ensure the quality and reliability of the platform.</p></li><li style=\"\"><p style=\"min-height:1.5em\">Participate in code reviews, sprint planning, and other Agile ceremonies to ensure timely delivery of features and enhancements.</p></li></ul><p style=\"min-height:1.5em\"></p><div class=\"h2\"><strong>Requirements:</strong></div><ul style=\"\"><li style=\"\"><p style=\"min-height:1.5em\">Proven experience (8+ years) as a Full-Stack Engineer with a strong background in designing and developing complex web applications.</p></li><li style=\"\"><p style=\"min-height:1.5em\">Expertise in Python and JavaScript, with experience using frameworks like FastAPI for backend development.</p></li><li style=\"\"><p style=\"min-height:1.5em\">Proficiency in frontend development using modern JavaScript frameworks such as React.js or Vue.js.</p></li><li style=\"\"><p style=\"min-height:1.5em\">Experience with cloud services, particularly AWS, and containerization technologies like Docker.</p></li><li style=\"\"><p style=\"min-height:1.5em\">Strong understanding of software engineering best practices, including Agile methodologies, code versioning tools (e.g., Git), and CI/CD pipelines.</p></li><li style=\"\"><p style=\"min-height:1.5em\">Excellent problem-solving skills and the ability to thrive in a fast-paced, dynamic environment.</p></li><li style=\"\"><p style=\"min-height:1.5em\">Strong communication skills and the ability to collaborate effectively with cross-functional teams.</p></li><li style=\"\"><p style=\"min-height:1.5em\">Passion for gaming and a keen interest in leveraging technology to enhance gaming experiences.</p></li></ul><div class=\"h2\"><strong>Why Join Helika?</strong></div><p style=\"min-height:1.5em\"><strong>The Most Powerful Partner in Gaming:</strong> Empowering the Gaming Universe with Cutting-Edge Insights and Next-Level AI Optimization.</p><p style=\"min-height:1.5em\">At Helika, our mission is to revolutionize the gaming industry by providing unparalleled analytics, game management infrastructure, and AI-driven optimization solutions. We provide the tools that empower studios to create and sustain fun and enduring games.As part of our team, you will work alongside innovative minds, enjoy opportunities for professional growth, and contribute significantly to an exciting, fast-paced industry. We are committed to diversity and inclusivity, providing an empowering environment for all our team members</p><p style=\"min-height:1.5em\">Many top AAA studios, including Yuga Labs, Animoca Brands, Ubisoft, Wildcard, Treasure, Proof of Play, Azra Games, and more rely on Helika to support their core analytics and data infrastructure needs. Helika is backed by top VC firms including Pantera, Diagram Ventures, Sfermion, Sparkle Ventures, Big Brain Holdings, Fenbushi and Builder Capital.</p><img src=\"https://remotive.com/job/track/1921143/blank.gif?source=public_api\" alt=\"\"/>","tags":"[\"AWS\",\"backend\",\"cloud\",\"docker\",\"frontend\",\"fullstack\",\"git\",\"javascript\",\"python\",\"react js\",\"security\",\"vue.js\",\"AI/ML\",\"agile\",\"CI/CD\",\"analytics\",\"web applications\",\"user acquisition\",\"team lead\",\"infrastructure\",\"system architecture\",\"diversity\"]","pubDate":"2024-07-03 13:20:32.000","link":"https://remotive.com/remote-jobs/software-dev/staff-software-engineer-team-lead-1921143","savedDate":"2024-07-05 16:09:14.855","slug":"staff-software-engineer-team-lead-helika-5304"},{"id":3926637616,"title":"Director of Lifecycle Marketing","company":"Automattic Careers","image":"https://remotive.com/job/1921543/logo","description":"<p>The Director of Lifecycle Marketing will play a pivotal role in guiding potential customers through stages in the customer journey. You’ll help build a team that collaborates across the organization to unlock growth in all stages of the customer journey. </p>\n<p>This strategic position requires an individual who can design and implement comprehensive marketing strategies that engage customers at each stage of their lifecycle, from acquisition through retention and loyalty. The ideal candidate will bring a proven track record of success in data-driven marketing, CRM, and automated marketing platforms. Email plays a pivotal role in how we communicate with customers, and you’ll be at the heart of how we leverage this channel tactically and operationally. This role requires a blend of creativity and analytical prowess, with a capacity for collaborating with cross-functional teams to meet business goals</p>\n<div class=\"h4\">Responsibilities: </div>\n<ul style=\"\">\n<li style=\"\"><strong>Develop and Implement Marketing Strategies:</strong> Design and execute lifecycle marketing strategies that effectively nurture leads, convert prospects, and increase customer retention and loyalty.</li>\n<li style=\"\"><strong>Lead Management</strong>: Oversee lead nurturing processes to ensure that leads are effectively converted into active customers, using targeted marketing techniques and personalization strategies.</li>\n<li style=\"\"><strong>Customer Segmentation and Personalization:</strong> Create and manage advanced segmentation strategies to deliver personalized marketing campaigns that resonate with different customer segments.</li>\n<li style=\"\"><strong>Analytics and Performance Measurement</strong>: Monitor and analyze campaign performance across various channels to evaluate success and identify areas for improvement. Use data insights to drive decisions and optimize future marketing efforts.</li>\n<li style=\"\"><strong>Cross-Functional Collaboration:</strong> Work closely with Product, Design, and Happiness Engineers teams to align marketing initiatives with company goals and ensure a cohesive customer experience across all touchpoints.</li>\n<li style=\"\"><strong>CRM Management:</strong> Set CRM best practices to streamline marketing processes, enhance customer data management, and enable more effective marketing campaigns.</li>\n<li style=\"\">Marketing Campaigns: Building out ad-hoc campaigns and automated workflows in our tooling.</li>\n<li style=\"\"><strong>Email Best Practices:</strong> Owning and establishing best practices for email marketing across the business.</li>\n<li style=\"\"><strong>Team Leadership and Development</strong>: Lead and develop a team of marketing professionals, fostering a culture of continuous improvement, innovation, and alignment with broader business objectives.</li>\n</ul>\n<div class=\"h4\">Requirements: </div>\n<ul style=\"\">\n<li style=\"\">Minimum of 7 years of experience in marketing, with at least 3 years in a leadership role focused on lifecycle or customer relationship marketing.</li>\n<li style=\"\">Proven track record of designing and implementing successful marketing campaigns that increase customer acquisition, retention, and growth.</li>\n<li style=\"\">Extensive experience with CRM software, marketing automation tools, and data analytics platforms.</li>\n<li style=\"\">Strong analytical skills with the ability to interpret extensive data to make actionable recommendations.</li>\n<li style=\"\">Excellent communication and interpersonal skills, capable of working effectively with cross-functional teams and presenting to stakeholders.</li>\n<li style=\"\">Proficient in project management, with a proven ability to lead projects to completion on time.</li>\n<li style=\"\">Strategic thinker with a customer-first mindset, adept at understanding customer needs and market trends.</li>\n<li style=\"\">Innovative and creative, with the capacity to conceptualize and implement new marketing initiatives that drive brand engagement and loyalty.</li>\n<li style=\"\">Extensive experience working with enterprise-grade email automation systems and email lists of 1M+. </li>\n<li style=\"\">Experience building complex automation logic and knowledge of how to test sizable workflows effectively.</li>\n<li style=\"\">Proactive, highly organized, and comfortable working asynchronously.</li>\n<li style=\"\">Can provide examples of how campaigns you’ve managed have driven incremental revenue/growth.</li>\n<li style=\"\">Are a specialist in all things email marketing. Your passion and depth of knowledge within this area are undeniable.</li>\n</ul>\n<p><strong>Salary range: $120,000-$185,000 USD - </strong><em>Please note that salary ranges are global, regardless of location, and we pay in local currency.</em></p>\n<p><em>Read more about </em><a href=\"%22https:/automattic.com/compensation/%22\" rel=\"nofollow\"><em>our compensation philosophy</em></a><em> and</em><a href=\"%22https:/automattic.com/benefits/%22\" rel=\"nofollow\"> <em>benefits</em></a><em>.</em></p>\n<div class='\"content-conclusion\"'>\n<p><br><strong>About Automattic</strong> </p>\n<p>We are the people behind <a href=\"%22http:/wordpress.com/%22\" rel=\"nofollow\">WordPress.com</a>, <a href=\"%22http:/woocommerce.com/%22\" rel=\"nofollow\">WooCommerce</a>, <a href=\"%22https:/www.tumblr.com/%22\" rel=\"nofollow\">Tumblr</a>, <a href=\"%22http:/simplenote.com/%22\" rel=\"nofollow\">Simplenote</a>, <a href=\"%22http:/jetpack.com/%22\" rel=\"nofollow\">Jetpack</a>, <a href=\"%22http:/longreads.com/%22\" rel=\"nofollow\">Longreads</a>, <a href=\"%22https:/dayoneapp.com/%22\" rel=\"nofollow\">Day One</a>, <a href=\"%22https:/www.pocketcasts.com/%22\" rel=\"nofollow\">PocketCasts</a>, and more. We believe in making the web a better place.</p>\n<p>We’re a distributed company with more than 1900 Automatticians in 96 countries speaking 120+ different languages. And, even more than growth and profitability (although we’re plenty profitable), above all, we’re driven by a mission:  We democratize publishing and commerce so anyone with a story can tell it, and anyone with a product can sell it, regardless of income, gender, politics, language, or country.</p>\n<p><a href=\"%22https:/github.com/Automattic%22\" rel=\"nofollow\">We believe in Open Source</a>, and the vast majority of our work is available under the <a href=\"%22https:/en.wikipedia.org/wiki/GNU_General_Public_License%22\" rel=\"nofollow\">GPL</a>.</p>\n<p><strong>Diversity, Equity, &amp; Inclusion at Automattic</strong> </p>\n<p>We’re improving diversity in the tech industry. At Automattic, we want people to love their work and show respect and empathy to all. We welcome differences and strive to increase participation from traditionally underrepresented groups. Our DEI committee involves Automatticians across the company and drives grassroots change. For example, this group has helped facilitate private online spaces for affiliated Automatticians to gather and helps run a monthly DEI People Lab series for further learning. DEI is a priority at Automattic, though our dedication influences far more than just Automatticians: We make our products freely available and translate our products into and offer customer support in numerous languages. We require unconscious bias training for our hiring teams and ensure our products are accessible across different bandwidths and devices. </p>\n<p>Automattic is a <a href=\"%22https:/mostlovedworkplace.com/companies/automattic-inc/%22\" rel=\"nofollow\">Most Loved Company</a> and <a href=\"%22https:/disabilityconfident.campaign.gov.uk/%22\" rel=\"nofollow\">Disability Confident Committed</a>. (<a href=\"%22https:/happinessengineer.blog/2022/09/08/happiness-for-everyone-working-with-a-disability-at-automattic/%22\" rel=\"nofollow\">Here’s what that might mean for you</a>.) Learn more about our dedication to <a href=\"%22https:/href.li/?https://automattic.com/diversity-and-inclusion/%22\" rel=\"nofollow\">diversity, equity, and inclusion</a> and our <a href=\"%22https:/automattic.com/automattician-resource-groups/%22\" rel=\"nofollow\">Employee Resource Groups</a>.</p>\n</div>\n<img src=\"https://remotive.com/job/track/1921543/blank.gif?source=public_api\" alt=\"\"/>","tags":"[\"CRM\",\"marketing strategy\",\"email marketing\"]","pubDate":"2024-07-03 03:20:57.000","link":"https://remotive.com/remote-jobs/marketing/director-of-lifecycle-marketing-1921543","savedDate":"2024-07-05 16:09:14.855","slug":"director-of-lifecycle-marketing-automattic-careers-7989"}]