[{"id":2295083317,"title":"People Operations Specialist (Remote)","company":"Empower","image":"https://lever-client-logos.s3.us-west-2.amazonaws.com/2e1a369c-b58f-41ac-8d86-4b0a77695e68-1687915522032.png","description":"<div><b style=\"font-size: 18px\">EMPOWER OVERVIEW</b></div><div><br></div><div><a href=\"http://empower.me/\" class=\"postings-link\">Empower</a>&nbsp;is a high-growth financial technology company on a mission to expand access to fair credit to give anyone in the world the opportunity to improve their financial security and mobility. We dream up and launch one-of-a-kind features that help our members get money instantly whenever they need it, save for the future, and rewrite their financial story. Our members see Empower Cash Advance as a life-saver, Empower Automatic Savings as a game-changer, and the new Empower Thrive line of credit (currently in beta, launching soon) as a lifeline to low-cost borrowing and the only practical path to building good credit.</div><div><br></div><div>Empower is backed by Sequoia Capital, Blisce, and Icon Ventures. Are we the next great place to grow your impact and accelerate your career? We think so:</div><div><br></div><div>Inc. ranked Empower #56 in the 2023 Inc. 5000 list of the fastest-growing private companies in the US (#55 in 2022). Forbes put Empower on its 2023 list of America's Best Startup Employers. Fast Company recognized the new Empower Thrive line of credit in their 2022 list of the Next Big Things in Tech. </div><div><br></div><div><b>WHAT EMPOWER OFFERS</b></div><div>Competitive salary</div><div>Generous equity package</div><div>Full healthcare benefits</div><div>Technology expense reimbursement</div><div>Work from anywhere</div><div><br></div><div><b>JOB DESCRIPTION</b></div><div>As a People Operations Specialist at Empower, you will play a pivotal role in the People Team organization. This multifaceted position encompasses recruitment coordination, people operations, and program management. The ideal candidate is a true HR generalist, well-versed in various aspects of human resources, and passionate about creating an environment where employees can excel.</div><div><br></div><div>Travel for company offsites is expected at a minimum 2 times a year. </div><h3>Key Responsibilities</h3><li><b>People Operations:</b></li><li>Oversee visa and leave administration processes, ensuring compliance with regulations and a seamless experience for employees.</li><li>End to end ownership of HRIS  (Rippling), creating workflows, setting up process and procedures and owning the onboarding and off-boarding process</li><li>Own Employee verification process and maintain meticulous and up-to-date employee records and documentation, ensuring confidentiality and compliance.</li><li>Lead benefits administration</li><li>Contribute to the development and implementation of various HR programs and initiatives that align with organizational goals including building and running new employee onboarding program</li><li><br></li><li><b>Events Management:</b></li><li>Own designing and launching all company offsites and events, taking on end-to-end project management responsibilities to ensure successful and impactful events.</li><li><br></li><li><b>People Partnership (HRBP)</b></li><li>Collaborate with cross-functional teams to drive employee engagement, diversity, equity, and inclusion programs.</li><li>First point of contact for all people concerns and connections </li><li>Identify, create and implement areas of opportunities to build remote culture</li><li>Launch, maintain, and build insights from various surveys - utilize Culture Amp and Rippling</li><div><br></div>,<h3>Candidate Qualifications</h3><li>Bachelor's degree in Human Resources, Business Administration, or a related field.</li><li>3-5 years experience in HR operations</li><li>Strong knowledge of HR best practices, employment laws, and regulations.</li><li>Excellent interpersonal and communication skills, with the ability to build relationships at all levels of the organization.</li><li>Detail-oriented with strong organizational and time-management skills.</li><li>Ability to handle confidential information with discretion and professionalism.</li><li>Ability to work in fast pace ever changing environment</li><li>Strong Analytical skills</li><div>At Empower, we hire for people that push themselves to understand others and seek out ways to challenge their personal assumptions. Our hope is that by fostering such an environment, we strengthen our business and relationships by putting people first. We are committed to building a diverse, inclusive, and equitable workspace where everyone (regardless of age, education, ethnicity, gender, sexual orientation, or any personal characteristics) feels like they belong. Even if your experience doesn’t exactly match up to our job description, you should feel empowered to apply regardless!&nbsp;</div>","tags":"[\"management\",\"aws\"]","pubDate":"2024-02-01 00:17:57.021","link":"https://jobs.lever.co/empower.me/0baa54b6-4935-4a98-ae22-8504b93dcf8b","savedDate":"2024-02-01 05:45:15.153","slug":"people-operations-specialist-remote-empower-895"},{"id":2046969995,"title":"Partnerships Manager Germany (DACH)","company":"Airalo","image":"https://lever-client-logos.s3.us-west-2.amazonaws.com/55028a36-609c-479c-9553-d4689ff2dd8c-1669620566663.png","description":"<div><b>About Airalo</b></div><div>Alo! Airalo is the world’s first eSIM store that helps people connect in over 200+ countries and regions across the globe. We are building the next digital service that revolutionizes the telecom industry. We are a travel-tech company and an equal-opportunity environment that values and executes diversity, inclusion, and equity. Our team is spread across 40+ countries and six continents. What glues us together is our commitment to changing the way you connect<span style=\"font-size: 13.3333px\">. </span></div><div><br></div><div><b>About you</b></div><div>We hope that you care deeply about the quality of your work, the intrinsic worth of tasks, and the success of your team. You are self-disciplined and do not require micromanagement in terms of your skillset and work ethic. You do your best to flourish as an individual every day while working hard to foster a collaborative team environment. You believe in the importance of being — and staying — authentic, honest, positive, and kind. You are a good interlocutor with clear and concise communication. You are able to manage multiple projects, have an analytical mind, pay keen attention to detail, and love to get your hands dirty. You are cognizant, tolerant, and welcoming of vulnerabilities and cultural differences.</div><div><br></div><div><b>About the Role</b></div><div><b>Position</b>: Full-time / Employee</div><div><b>Location:</b>&nbsp;Remote-first </div><div><b>Benefits:</b>&nbsp;Employee Stock Options, Health Insurance, work-from-anywhere stipend, annual wellness &amp; learning credits, annual all-expenses-paid company retreat in a gorgeous destination &amp; other benefits</div><div><br></div><div><span style=\"font-size: 11pt\">We are looking for a Partnerships superstar to join the </span><b style=\"font-size: 11pt\">Airalo Partnerships</b><span style=\"font-size: 11pt\">&nbsp;</span><a href=\"http://department.Airalo\" style=\"font-size: 11pt\" class=\"postings-link\">department.Airalo</a><span style=\"font-size: 11pt\"> is the undisputed industry leader in the B2C segment in the eSIM industry, we are now looking to expand our presence in the B2B2C and B2B space to bring the eSIM revolution to global </span><a href=\"http://markets.As\" style=\"font-size: 11pt\" class=\"postings-link\">markets.As</a><span style=\"font-size: 11pt\"> the Partnerships Manager for Germany, you will lead and oversee various partnerships across Airalo’s four key Partnerships streams - Strategic Partnerships, Channel Sales, Corporate Sales, and Affiliate Marketing. The main goal is to develop our partnership vertical; as well as manage the partnership cycle from leads creation down to partner launch to achieve our business objectives.</span></div><h3>Responsibilities include but are not limited to:</h3><li>Find, identify, prospect, and lead negotiations with potential partners across Partnerships streams, specially within Strategic Partnerships, to support Airalo’s market penetration efforts.</li><li>Onboard and support new partners as they join the Airalo Partner Community.</li><li>Maintain relationships with key partners to drive partner profitability and grow the B2B/B2B2C partnerships’ contribution to the business.</li><li>Conduct ongoing competitive analysis to establish and maintain Airalo’s status as the leading eSIM provider across partner industries.</li><li>As a senior member of the Germany squad, drive the overall growth strategy for Airalo.</li><li>Own the Airalo partnerships OKRs in Germany.</li><li>Hire and develop talent within the partnerships streams to support Airalo’s partnerships initiatives and efforts.</li><li>Collaborate and work with different internal and external stakeholders to develop and execute projects/opportunities.</li><li>Identify relevant events and conferences across verticals and represent Airalo as a speaker, delegate, or exhibitor to educate the ecosystem about eSIMs and our solutions.</li><li>Work closely with the Director of Partnerships, Americas, and with other team members in the department.</li><div><br></div>,<h3>Must-haves:</h3><li>7+ years of experience in partnerships, business development, sales, or account management, in a high-growth B2B and/or B2B2C travel tech or travel e-commerce environment.</li><li>Perfect verbal and written communication skills in English &amp; German</li><li>Proven expertise across one or more of Airalo’s four Partnerships streams.</li><li>Deep understanding of the travel or/and telecom partnerships ecosystem in Germany with a strong and existing network of market contacts.</li><li>Partner-first mentality and a genuine passion to help your stakeholders succeed while creating win-win relationships.</li><li>Ability to narrate a good story - make a compelling partnership proposition with Airalo’s unique story and the problem we solve for travelers.</li><li>Experience with sales and partnerships models.</li><li>Ability to employ sales techniques, including effective questioning, objection handling, consultative selling, and solution selling.</li><li>Self-starter with the ability to multi-task in a complex &amp; matrix environment.</li><li>Extreme comfort with technology tools.</li><li>Dedicated, high-energy, collaborative, attention to details, excellent organization, data-driven, and problem solving skills.</li><li>Experienced with CRM systems like Salesforce or HubSpot to manage the target lead pipeline and nurture partnerships.</li><div><br></div>,<h3>Good to have:</h3><li>Preferably a mix of startup and mid to large companies level experience.</li><li>Familiarity with an e-commerce/technology travel industry or telecom company.</li><li>2+ years experience in building and/or leading a team.</li><li>Familiarity with data insights visualization tools.</li><li>Graduate degree in a related field.</li><li>Certificates and courses in sales and partnerships.</li><li>Experienced in leveraging AI tooling to maximize efficiency.</li><div><br></div><div>If you are interested in this position, <b>please apply via the link.</b></div><div><br></div><div><i>We sincerely thank all applicants in advance for submitting their interest in this opportunity with Airalo. </i></div>","tags":"[\"management\",\"B2C\",\"B2B\"]","pubDate":"2024-01-31 15:24:21.558","link":"https://jobs.lever.co/airalo/2f753912-3f4e-4c6a-a29f-78394ba60108","savedDate":"2024-02-01 05:45:15.154","slug":"partnerships-manager-germany-dach-airalo-9831"},{"id":1445112081,"title":"Partnerships Manager The Netherlands & Belgium","company":"Airalo","image":"https://lever-client-logos.s3.us-west-2.amazonaws.com/55028a36-609c-479c-9553-d4689ff2dd8c-1669620566663.png","description":"<div><b>About Airalo</b></div><div>Alo! Airalo is the world’s first eSIM store that helps people connect in over 200+ countries and regions across the globe. We are building the next digital service that revolutionizes the telecom industry. We are a travel-tech company and an equal-opportunity environment that values and executes diversity, inclusion, and equity. Our team is spread across 40+ countries and six continents. What glues us together is our commitment to changing the way you connect<span style=\"font-size: 13.3333px\">. </span></div><div><br></div><div><b>About you</b></div><div>We hope that you care deeply about the quality of your work, the intrinsic worth of tasks, and the success of your team. You are self-disciplined and do not require micromanagement in terms of your skillset and work ethic. You do your best to flourish as an individual every day while working hard to foster a collaborative team environment. You believe in the importance of being — and staying — authentic, honest, positive, and kind. You are a good interlocutor with clear and concise communication. You are able to manage multiple projects, have an analytical mind, pay keen attention to detail, and love to get your hands dirty. You are cognizant, tolerant, and welcoming of vulnerabilities and cultural differences.</div><div><br></div><div><b>About the Role</b></div><div><b>Position</b>: Full-time / Employee</div><div><b>Location:</b>&nbsp;Remote-first </div><div><b>Benefits:</b>&nbsp;Employee Stock Options, Health Insurance, work-from-anywhere stipend, annual wellness &amp; learning credits, annual all-expenses-paid company retreat in a gorgeous destination &amp; other benefits</div><div><br></div><div>We are looking for a Partnerships superstar to join the <b>Airalo Partnerships</b> department.</div><div><br></div><div>Airalo is the undisputed industry leader in the B2C segment in the eSIM industry, we are now looking to expand our presence in the B2B2C and B2B space to bring the eSIM revolution to global markets.</div><div><br></div><div>As the Partnerships Manager for The Netherlands &amp; Belgium, you will lead and oversee various partnerships across Airalo’s four key Partnerships streams - Strategic Partnerships, Channel Sales, Corporate Sales, and Affiliate Marketing. The main goal is to develop our partnership vertical; as well as manage the partnership cycle from lead creation down to partner launch to achieve our business objectives.</div><h3>Responsibilities include but are not limited to:</h3><li>Find, identify, prospect, and lead negotiations with potential partners across Partnerships streams, specially within Strategic Partnerships, to support Airalo’s market penetration efforts.</li><li>Onboard and support new partners as they join the Airalo Partner Community.</li><li>Maintain relationships with key partners to drive partner profitability and grow the B2B/B2B2C partnerships’ contribution to the business.</li><li>Conduct ongoing competitive analysis to establish and maintain Airalo’s status as the leading eSIM provider across partner industries.</li><li>As a senior member of the The Netherlands &amp; Belgium squad, drive the overall growth strategy for Airalo.</li><li>Own the Airalo partnerships OKRs in The Netherlands &amp; Belgium</li><li>Hire and develop talent within the partnerships streams to support Airalo’s partnerships initiatives and efforts.</li><li>Collaborate and work with different internal and external stakeholders to develop and execute projects/opportunities.</li><li>Identify relevant events and conferences across verticals and represent Airalo as a speaker, delegate, or exhibitor to educate the ecosystem about eSIMs and our solutions.</li><li>Work closely with the Director of Partnerships, Americas, and with other team members in the department.</li>,<h3>Must-haves:</h3><li>7+ years of experience in partnerships, business development, sales, or account management, in a high-growth B2B and/or B2B2C travel tech or travel e-commerce environment.</li><li>Perfect verbal and written communication skills in English &amp; Dutch</li><li>Proven expertise across one or more of Airalo’s four Partnerships streams.</li><li>Deep understanding of the travel or/and telecom partnerships ecosystem in The Netherlands &amp; Belgium with a strong and existing network of market contacts.</li><li>Partner-first mentality and a genuine passion to help your stakeholders succeed while creating win-win relationships.</li><li>Ability to narrate a good story - make a compelling partnership proposition with Airalo’s unique story and the problem we solve for travellers.</li><li>Experience with sales and partnership models.</li><li>Ability to employ sales techniques, including effective questioning, objection handling, consultative selling, and solution selling.</li><li>Self-starter with the ability to multi-task in a complex &amp; matrix environment.</li><li>Extreme comfort with technology tools.</li><li>Dedicated, high-energy, collaborative, attention to detail, excellent organization, data-driven, and problem-solving skills.</li><li>Experienced with CRM systems like Salesforce or HubSpot to manage the target lead pipeline and nurture partnerships</li>,<h3>Good to have:</h3><li>Preferably a mix of startup and mid to large companies level experience.</li><li>Familiarity with an e-commerce/technology travel industry or telecom company.</li><li>2+ years experience in building and/or leading a team.</li><li>Familiarity with data insights visualization tools.</li><li>Graduate degree in a related field.</li><li>Certificates and courses in sales and partnerships.</li><li>Experienced in leveraging AI tooling to maximize efficiency</li><div>If you are interested in this position, <b>please apply via the link.</b></div><div><br></div><div><i>We sincerely thank all applicants in advance for submitting their interest in this opportunity with Airalo. </i></div>","tags":"[\"management\",\"B2C\",\"B2B\"]","pubDate":"2024-01-31 12:47:49.326","link":"https://jobs.lever.co/airalo/8c7d24fc-cb42-4288-a9a3-5c69b2b14d0f","savedDate":"2024-02-01 05:45:15.155","slug":"partnerships-manager-the-netherlands-belgium-airalo-6091"},{"id":9616749673,"title":"DevOps engineer","company":"BeInCrypto","image":"https://remotive.com/job/1894789/logo","description":"<p><strong>BE[IN]CRYPTO</strong> goes beyond being a media publication – we're creators, educators, and innovators. Our content spans 15 languages, covering major news and generating original content. Beyond media, we've packed our digital nomad backpack with products like Learn, Rankings, Academy, and Jobs. Our culture is open, dynamic, and fun, driving constant reinvention.  </p>\n<p>Like our products and solutions – our teams are agile, dynamic, and innovative. We work hard, and we have a lot of fun – while keeping up the quality and accuracy for which we’re known. It’s what keeps us inventing and reinventing, all the time. Our culture is wide open, just like our spaces.  </p>\n<p>We're embarking on an exciting journey in our R&amp;D department, where we're launching the development of a groundbreaking product from the ground up. Unlike traditional modifications, our R&amp;D teams collaborate seamlessly to create something entirely new. The challenge lies not just in fixing issues but in breaking away from conventional scalability constraints. We're determined to chart our own path, prioritize our vision, and carve out a USP that sets us apart. </p>\n<p>Our 2024 focus is clear: to be a strong contender in the cryptocurrency market analytics space.  </p>\n<p><strong>We're on the lookout for a skilled DevOps Engineer with expertise in AWS and Kubernetes to join our dynamic team.</strong> As a vital team member, you'll play a crucial role in building our operations and development processes, ensuring the high availability and performance of our services, and actively contributing to our continuous integration and deployment strategies.</p>\n<div class=\"h2\">Tasks</div>\n<ul style=\"\">\n<li style=\"\">Lead the implementation and management of continuous delivery systems and methodologies on AWS for our revolutionary product.</li>\n<li style=\"\">Design, manage, and maintain tools for automating operational processes, leveraging the power of Kubernetes.</li>\n<li style=\"\">Develop and maintain solutions for operational administration, including system/data backup, disaster recovery, and security/performance monitoring, tailored to the specific needs of our new product.</li>\n<li style=\"\">Institute and oversee a robust CI/CD pipeline, ensuring the seamless deployment of microservices and applications for our groundbreaking tool.</li>\n<li style=\"\">Evaluate and enhance existing systems, with a forward-looking approach to scalability, reliability, and efficiency for a 5-10 years vision.</li>\n<li style=\"\">Collaborate closely with the architect and development teams to align operations with the overall goals of our R&amp;D and business strategy.</li>\n<li style=\"\">Troubleshoot and resolve issues across development, test, and production environments, ensuring the stability and performance of our evolving product.</li>\n<li style=\"\">Stay abreast of emerging trends in DevOps, cloud computing, and system architecture, applying relevant insights to the evolution of our new tool.</li>\n</ul>\n<div class=\"h2\">Requirements</div>\n<ul style=\"\">\n<li style=\"\">Strong experience with AWS services and Kubernetes, showcasing proficiency in Microservices architecture with a keen focus on scalability.</li>\n<li style=\"\">Proficiency in automation tools (e.g., Terraform, Ansible) and strong SysOps knowledge, collaborating with the project architect to define infrastructure and architecture for the next years.</li>\n<li style=\"\">Experience in networking, storage, and database AWS services, coupled with familiarity with basic infrastructure and efficient scaling on AWS tailored to the specific needs of our groundbreaking product.</li>\n<li style=\"\">Expertise in building and maintaining CI/CD pipelines, demonstrating a track record in deploying services rapidly and ensuring adaptability for future developments.</li>\n<li style=\"\">Experience with system monitoring tools and strategies, including previous exposure to external monitoring tools, with a desire to internalize monitoring processes for the unique requirements of our new tool.</li>\n<li style=\"\">Strong scripting skills (e.g., Python, Bash) are considered valuable assets.</li>\n<li style=\"\">Familiarity with Linux/Unix administration.</li>\n<li style=\"\">Strong problem-solving skills and the ability to work in a fast-paced environment.</li>\n<li style=\"\">Excellent communication and teamwork abilities.</li>\n</ul>\n<p><strong>Nice to have</strong></p>\n<ul style=\"\">\n<li style=\"\">NodeJS skills are considered a valuable asset.</li>\n<li style=\"\">Knowledge of how backend infrastructure impacts SEO would be a bonus.</li>\n</ul>\n<div class=\"h2\">Benefits</div>\n<ul style=\"\">\n<li style=\"\">A true startup experience – no rules, no bureaucracy, and the opportunity to have a meaningful impact on a growing business.</li>\n<li style=\"\">A culture of autonomy and accountability.</li>\n<li style=\"\">A people-focused organization dedicated to making sure you’re maxing out on learning, growth, and impact, and getting recognized for the great work you do along the way.</li>\n<li style=\"\">Constant growth opportunities.</li>\n<li style=\"\">The chance to join a stellar team of talents and learn from them.</li>\n<li style=\"\">We have team members in 60 countries all over the world! Wherever you go, you can meet someone from the BeInCrypto family.</li>\n</ul>\n<p><strong>Join our BIC team and take your professional experience to the next level!</strong></p><div class=\"h1\">About the company</div><p>What is <strong>BeInCrypto</strong> about?</p>\n<p>BeInCrypto was created to unite and set you free from the hands, pockets, and minds of a controlling monetary system.</p>\n<p>Here, we create educational content and products for all things crypto that will help you to pave your way in Web3.</p>\n<img src=\"https://remotive.com/job/track/1894789/blank.gif?source=public_api\" alt=\"\"/>","tags":"[\"AWS\",\"kubernetes\",\"terraform\"]","pubDate":"2024-01-30 13:21:30.000","link":"https://remotive.com/remote-jobs/devops/devops-engineer-1894789","savedDate":"2024-02-01 05:45:15.151","slug":"devops-engineer-beincrypto-2837"},{"id":2858081558,"title":"Marketing Specialist","company":"AdKings Agency","image":"https://remotive.com/job/1894219/logo","description":"<p>As a Marketing Specialist, you will be responsible for executing marketing strategies and campaigns for our digital marketing agency itself. This role will involve working directly alongside the CMO and Co-Founders of the business to work exclusively on the execution of growth strategies. If you are a consummate and efficient campaign executor with the proven ability to have delivered all the working parts of complex digital marketing campaigns effectively, this job is for you.</p>\n<p>The role does come with some support from our 30+ highly experienced client delivery team across creative production, development, design, media buying, copywriting, and CRO. However, you will be expected to have experience and a good understanding of these roles to effectively collaborate and deliver high-standard campaigns. </p>\n<p>*This is a <strong>COMPLETELY REMOTE</strong> position so we hire worldwide, but it would be best if you are around the <strong>European timezone</strong>, as the majority of the team is located around this continent. </p>\n<p><strong>Job Responsibilities: </strong></p>\n<ul style=\"\">\n<li style=\"\">\n<p>Execute and optimize high-quality Facebook ads campaigns with the guidance from the CMO to deliver on KPIs - this will include account set-up and maintenance with assistance from our client delivery media buying team. </p>\n</li>\n<li style=\"\">\n<p>Execute and optimize high-quality Google ads campaigns (including display, search &amp; YouTube) with the guidance from the CMO to deliver on KPIs - this will include account set-up and maintenance with assistance from our client delivery media buying team. </p>\n</li>\n<li style=\"\">\n<p>Coordinate the delivery of creatives to support campaign delivery. Working alongside our client delivery creative production team, to bring the company's branding, voice, and vision to life to constantly keep testing and optimizing our campaigns for higher performance. </p>\n</li>\n<li style=\"\">\n<p>Constantly have your finger on the pulse of marketing metrics, understand their significance, and proactively provide feedback and suggestions to the CMO &amp; Co-Founders for areas of opportunity. </p>\n</li>\n<li style=\"\">\n<p>Complete regular reports and be comfortable presenting them within company meetings. </p>\n</li>\n<li style=\"\">\n<p>To coordinate a busy content production schedule of short clips, articles, podcasts, and videos, collaborating with internal teams to gather, organize and produce content in line with our content marketing strategy. </p>\n</li>\n<li style=\"\">\n<p>Build landing pages across WebFlow, ClickFunnels, or Unbounce as a preference, bringing our CRO &amp; Graphic Design team's visions to life within a WYSIWYG editor. Entry level HTML &amp; CSS is a bonus. </p>\n</li>\n<li style=\"\">\n<p>Update and maintain software integrations across our Martech suite to ensure our RevGen machine is always fully functioning.</p>\n</li>\n</ul>\n<p>The ideal candidate will be someone who has executed multiple complex digital marketing campaigns with high attention to detail and will have the experience to work alone to deliver marketing campaigns to an extremely high standard and on time.<br><br>The profile of the ideal candidate will be a forward-thinking, intuitive, and analytical personality who can foresee potential issues and rectify them accordingly.<br><br><strong>Job Requirements: </strong></p>\n<ul style=\"\">\n<li style=\"\">Fluent in English (reading, writing, and speaking). </li>\n<li style=\"\">Degree educated </li>\n<li style=\"\">Minimum of 4 years in a digital marketing execution role.</li>\n<li style=\"\">Experience working agency side within a digital marketing agency is a bonus. </li>\n<li style=\"\">An experienced project manager with the ability to manage multiple ongoing projects in collaboration with multiple other teams. </li>\n<li style=\"\">High numerical reasoning with a strong understanding of marketing metrics and reporting. </li>\n<li style=\"\">Experience with Unbounce, Google Ads, Meta Suite and basic graphic design tools is a bonus. </li>\n</ul>\n<p><strong>Our Hiring Process: </strong></p>\n<ul style=\"\">\n<li style=\"\">Stage (1): Reviewing your application.</li>\n<li style=\"\">Stage (2): Inviting you for a practical task to evaluate your practical skills, experience, and expertise.</li>\n<li style=\"\">Stage (3): Inviting you for an interview with HR team to evaluate your knowledge and culture-fit.</li>\n<li style=\"\">Stage (4) if needed): Inviting you for an interview with the line manager/department's manager for final decision.</li>\n</ul>\n<p><strong>Why Joining Us? </strong></p>\n<p><u>A) Be among A-level team members who love challenges, bringing results &amp; never stop learning:</u></p>\n<ul style=\"\">\n<li style=\"\">Every month we are spending over 1M on Facebook ads profitably</li>\n<li style=\"\">We recently scaled several brands from ±200K/month to $1M &amp; $4M/MO</li>\n<li style=\"\">Most of the time we 2X or 3X our clients within 2-3 months</li>\n</ul>\n<p><u>B) We value Next Level Team Experience:</u></p>\n<ul style=\"\">\n<li style=\"\">Even by working remotely, we have a 5/5 rating on Glassdoor</li>\n<li style=\"\">Team Buddy system, bookclub, Wim Hof (and other) challenges, as well as best gifs and discussions happening on Slack</li>\n<li style=\"\">We have 2 team retreats per year to connect and catch up with each other (on-hold due to Covid 😭)</li>\n<li style=\"\">We have regular feedback forms, 1on1, and team calls, so we always listen to feedback from our team.</li>\n</ul>\n<p><strong>About Adkings Agency:</strong></p>\n<p>We offer full eCommerce services needed for omnichannel funnels creation: Facebook and Instagram Ads, Adwords, Youtube Ads, Sales Funnels Creation, Emails and LTV Maximization, Conversion Rate Optimization, Average Cart Value Optimization and help eCommerce businesses grow their revenue worldwide. AdKings is a small boutique team of close to 15 top-notch driven people. Now ready for our next stage of growth and planning to jump up to 20-25 people this year so we're looking for KEY individuals who could help us shape this agency and unleash its potential.<br><br></p>\n<p>🚀 Ready to be a part of our team!? Hit that Apply button!</p>\n<p><img class='\"fr-fic' src=\"%22https:/adoptoprod.blob.core.windows.net/careers/d4b61ecb-bfa0-416f-82f7-461aee3618a0.jpeg%22\"></p>\n<p> </p>\n<img src=\"https://remotive.com/job/track/1894219/blank.gif?source=public_api\" alt=\"\"/>","tags":"[\"project management\",\"google ads\",\"facebook ads\"]","pubDate":"2024-01-30 13:21:18.000","link":"https://remotive.com/remote-jobs/marketing/marketing-specialist-1894219","savedDate":"2024-02-01 05:45:15.152","slug":"marketing-specialist-adkings-agency-2202"},{"id":6343900268,"title":"People Development Manager (Europe)","company":"Airalo","image":"https://lever-client-logos.s3.us-west-2.amazonaws.com/55028a36-609c-479c-9553-d4689ff2dd8c-1669620566663.png","description":"<div><b>About Airalo</b></div><div>Alo! Airalo is the world’s first eSIM store that helps people connect in over 200+ countries and regions across the globe. We are building the next digital service that revolutionizes the telecom industry. We are a travel-tech company and an equal-opportunity environment that values and executes diversity, inclusion, and equity. Our team is spread across 40+ countries and six continents. What glues us together is our commitment to changing the way you connect<span style=\"font-size: 13.3333px\">. </span></div><div><br></div><div><b>About you</b></div><div>We hope that you care deeply about the quality of your work, the intrinsic worth of tasks, and the success of your team. You are self-disciplined and do not require micromanagement in terms of your skillset and work ethic. You do your best to flourish as an individual every day while working hard to foster a collaborative team environment. You believe in the importance of being — and staying — authentic, honest, positive, and kind. You are a good interlocutor with clear and concise communication. You are able to manage multiple projects, have an analytical mind, pay keen attention to detail, and love to get your hands dirty. You are cognizant, tolerant, and welcoming of vulnerabilities and cultural differences.</div><div><br></div><div><b>About the Role</b></div><div><b>Position</b>: Full-time / Employee</div><div><b>Location:</b>&nbsp;Remote-first </div><div><b>Benefits:</b>&nbsp;Employee Stock Options, Health Insurance, work-from-anywhere stipend, annual wellness &amp; learning credits, annual all-expenses-paid company retreat in a gorgeous destination &amp; other benefits</div><div><br></div><div>As a <b>People Development Manager</b>, you will take the lead in managing day-to-day training and development initiatives, playing a pivotal role in driving change and operational excellence. Your focus will be on aligning business and people strategies to cultivate a pleasant, rewarding, and high-performance culture within Airalo. Working closely with our founders, C-level executives, VPs, and Directors of your assigned community, you will collaborate seamlessly with the entire People &amp; Talent team. Your goal is to foster continuous learning and development, ensuring that our team thrives in an environment conducive to personal and professional growth.</div><h3>Responsibilities include but are not limited to:</h3><li>Develop and implement internal training programs across various HR pillars, ensuring alignment with organizational objectives, and deliver engaging and impactful training sessions to enhance the skills and knowledge of internal leaders and team members;</li><li>Collaborate with stakeholders to identify training needs, customizing programs to address specific requirements;</li><li>Support and collaborate with engagement initiatives to ensure effective employee engagement and experience, while also motivating and inspiring team members to actively engage in training activities;</li><li>Independently create, launch, and oversee training initiatives from inception to completion;</li><li>Ensure meticulous data collection of training initiatives and hours, with the ability to translate data into actionable insights;</li><li>Exhibit expertise in structuring a training and development function from the ground up;</li><li>Demonstrate the capability to craft compelling business cases for budget approval;</li><li>Oversee the internal Learning System, optimizing it for extraordinary training experiences;</li><li>Establish key performance indicators and metrics to assess the effectiveness of training programs, refining and improving offerings;</li><li>Assist departmental leaders with training needs at different stages of the employee lifecycle such as new hire onboarding and induction training.</li>,<h3>Must-haves:</h3><li>Bachelor’s degree in human resources, business administration, or similar relevant field &amp; a minimum of 5+ years of experience in Learning &amp; Development, and 3 years in a lead or management role;</li><li>Proven experience in taking charge of projects, guiding them to successful completion, and a track record of designing and implementing successful internal training programs;</li><li>Possesses strong leadership skills, negotiating and maintaining relationships with suppliers and vendors;</li><li>Efficiently manage a diverse workload, concurrently handling multiple projects;</li><li>Adhere to specified deadlines, ensuring the timely delivery of high-quality training initiatives;</li><li>Demonstrates resilience, effectively handling pressure and navigating challenging situations;</li><li>Have the knowledge and ability to implement different learning methodologies and approaches;</li><li>Possesses strong customer-centric skills with a passion for service, ensuring all our interactions with people are handled professionally and with thorough attention to detail;</li><li>Inspires and fosters a culture of continuous learning across Airalo;</li><li>Works autonomously, taking ownership of projects and aligning them with organizational goals;</li><li>Strong stakeholder management, interpersonal, and communication skills with all levels of seniority in a cross-functional &amp; global environment;</li><li>Effective &amp; analytical mindset, creative and pragmatic problem-solving skills with strong business acumen &amp; user-centric philosophy;</li><li>Self-driven, optimistic, and keen to work as part of a professional and closely-knit team while highly organized with excellent time management skills;</li><li>Experience with HRIS, HCM &amp; other tools, ensuring the highest level of confidentiality &amp; accuracy on personal &amp; professional information.</li>,<h3>Good to have:</h3><li>Experience in the travel tech and/or telco industry;</li><li>Strong interpersonal and communication skills;</li><li>Proficient in various training methodologies and tools;</li><li>Demonstrated leadership skills with a motivational approach to team collaboration;</li><li>Relevant HR certifications (iHRP, CIPD, SHRM, etc);</li><li>Additional written/spoken languages.</li><div><i>We sincerely thank all applicants in advance for submitting their interest in this opportunity with Airalo. </i></div>","tags":"[\"management\"]","pubDate":"2024-01-24 14:43:24.215","link":"https://jobs.lever.co/airalo/2ffd5134-9369-4812-8dc3-2fdaaae01de0","savedDate":"2024-02-01 05:45:15.156","slug":"people-development-manager-europe-airalo-6475"},{"id":9111754380,"title":"HR Manager (Europe)","company":"Airalo","image":"https://lever-client-logos.s3.us-west-2.amazonaws.com/55028a36-609c-479c-9553-d4689ff2dd8c-1669620566663.png","description":"<div><b>About Airalo</b></div><div>Alo! Airalo is the world’s first eSIM store that helps people connect in over 200+ countries and regions across the globe. We are building the next digital service that revolutionizes the telecom industry. We are a travel-tech company and an equal-opportunity environment that values and executes diversity, inclusion, and equity. Our team is spread across 40+ countries and six continents. What glues us together is our commitment to changing the way you connect<span style=\"font-size: 13.3333px\">. </span></div><div><br></div><div><b>About you</b></div><div>We hope that you care deeply about the quality of your work, the intrinsic worth of tasks, and the success of your team. You are self-disciplined and do not require micromanagement in terms of your skillset and work ethic. You do your best to flourish as an individual every day while working hard to foster a collaborative team environment. You believe in the importance of being — and staying — authentic, honest, positive, and kind. You are a good interlocutor with clear and concise communication. You are able to manage multiple projects, have an analytical mind, pay keen attention to detail, and love to get your hands dirty. You are cognizant, tolerant, and welcoming of vulnerabilities and cultural differences.</div><div><br></div><div><b>About the Role</b></div><div><b>Position</b>: Full-time / Employee</div><div><b>Location:</b>&nbsp;Remote-first </div><div><b>Benefits:</b>&nbsp;Employee Stock Options, Health Insurance, work-from-anywhere stipend, annual wellness &amp; learning credits, annual all-expenses-paid company retreat in a gorgeous destination &amp; other benefits</div><div><br></div><div>As an <b>HR Manager</b>, you will be responsible for all day-to-day people-partnering matters within your tribe and be a key driver for change &amp; operational excellence, aligning business &amp; people strategies to develop a pleasant, rewarding &amp; high-performance culture within Airalo. You’ll be working closely with our founders, C-level executives, VPs &amp; Directors of your assigned tribe, as well as the entire People &amp; Talent team.&nbsp;</div><h3>Responsibilities include but are not limited to:</h3><li>Drive Airalo’s global HR strategy in close collaboration with the VP, People, Director of People Operations, department heads &amp; key stakeholders;</li><li>Support with yearly Headcount Planning &amp; Forecasts with the People Director, Talent, and Hiring Managers;</li><li>Assists senior management in the development of solutions for current and future business needs through employee development, organizational development, cultural and process-oriented perspectives;</li><li>Offer an optimal, welcoming &amp; automated onboarding experience to all our staff. Work with our partners to establish employment contracts for all our new joiners, ensuring full compliance with local regulations;</li><li>Documentation: Centralize &amp; maintain all employees’ personal &amp; professional information/documentation on various HCM tools &amp; systems;</li><li>Reporting: Provide regular &amp; metrics to your tribe managers: Performance, Employee Engagement, Pulse Study, Employee Retention, etc;</li><li>L&amp;D: Act as an integral consultant &amp; train your tribe leaders &amp; managers on best management practices, performance management, labor regulations, etc;</li><li>Conflict Management: consult with employees &amp; managers to address &amp; resolve the root causes of any human resources issues objectively &amp; impartially;</li><li>Participates in company-wide programs &amp; initiatives (ie. salary review, workforce planning, organizational change, ESOP, C&amp;B, etc).</li>,<h3>Must-haves:</h3><li>Bachelor’s degree in human resources, business administration, or similar relevant field &amp; a minimum of 4 years of experience in HR business partnering role;</li><li>Proven experience in taking charge of projects and guiding them to successful completion;</li><li>Possesses strong leadership skills and is resilient;</li><li>Possesses strong customer-centric skills with a passion for service, ensuring all our interactions with people are handled professionally and with thorough attention to detail;</li><li>Proven experience in strategic HR plans and solutions, dealing with organization strategies and complex business/HR-related topics;</li><li>Strong stakeholder management, interpersonal, and communication skills with all levels of seniority in a cross-functional &amp; global environment;</li><li>Effective &amp; analytical mindset, creative and pragmatic problem-solving skills with strong business acumen &amp; user-centric philosophy;</li><li>Self-driven, optimistic, and keen to work as part of a professional and closely-knit team while highly organized with excellent time management skills;</li><li>Experience with HRIS, HCM &amp; other tools, ensuring the highest level of confidentiality &amp; accuracy on personal &amp; professional information.</li>,<h3>Good to have:</h3><li>Experience in the travel tech and/or telco industry;</li><li>Relevant HR certifications (iHRP, CIPD, SHRM, etc);</li><li>Additional written/spoken languages.</li><div><i>We sincerely thank all applicants in advance for submitting their interest in this opportunity with Airalo. </i></div>","tags":"[\"management\"]","pubDate":"2024-01-24 14:29:59.102","link":"https://jobs.lever.co/airalo/b4704c93-bb9d-456b-b51c-c8140ff7be9a","savedDate":"2024-02-01 05:45:15.153","slug":"hr-manager-europe-airalo-7139"},{"id":4694049003,"title":"HR Manager (Singapore)","company":"Airalo","image":"https://lever-client-logos.s3.us-west-2.amazonaws.com/55028a36-609c-479c-9553-d4689ff2dd8c-1669620566663.png","description":"<div><b>About Airalo</b></div><div>Alo! Airalo is the world’s first eSIM store that helps people connect in over 200+ countries and regions across the globe. We are building the next digital service that revolutionizes the telecom industry. We are a travel-tech company and an equal-opportunity environment that values and executes diversity, inclusion, and equity. Our team is spread across 40+ countries and six continents. What glues us together is our commitment to changing the way you connect<span style=\"font-size: 13.3333px\">. </span></div><div><br></div><div><b>About you</b></div><div>We hope that you care deeply about the quality of your work, the intrinsic worth of tasks, and the success of your team. You are self-disciplined and do not require micromanagement in terms of your skillset and work ethic. You do your best to flourish as an individual every day while working hard to foster a collaborative team environment. You believe in the importance of being — and staying — authentic, honest, positive, and kind. You are a good interlocutor with clear and concise communication. You are able to manage multiple projects, have an analytical mind, pay keen attention to detail, and love to get your hands dirty. You are cognizant, tolerant, and welcoming of vulnerabilities and cultural differences.</div><div><br></div><div><b>About the Role</b></div><div><b>Position</b>: Full-time / Employee</div><div><b>Location:</b>&nbsp;Remote-first </div><div><b>Benefits:</b>&nbsp;Employee Stock Options, Health Insurance, work-from-anywhere stipend, annual wellness &amp; learning credits, annual all-expenses-paid company retreat in a gorgeous destination &amp; other benefits</div><div><br></div><div>As an <b>HR Manager</b>, you will be responsible for all day-to-day people-partnering matters within your tribe and be a key driver for change &amp; operational excellence, aligning business &amp; people strategies to develop a pleasant, rewarding &amp; high-performance culture within Airalo. You’ll be working closely with our founders, C-level executives, VPs &amp; Directors of your assigned tribe, as well as the entire People &amp; Talent team.&nbsp;</div><h3>Responsibilities include but are not limited to:</h3><li>Drive Airalo’s global HR strategy in close collaboration with the VP, People, Director of People Operations, department heads &amp; key stakeholders;</li><li>Support with yearly Headcount Planning &amp; Forecasts with the People Director, Talent, and Hiring Managers;</li><li>Assists senior management in the development of solutions for current and future business needs through employee development, organizational development, cultural and process-oriented perspectives;</li><li>Offer an optimal, welcoming &amp; automated onboarding experience to all our staff. Work with our partners to establish employment contracts for all our new joiners, ensuring full compliance with local regulations;</li><li>Documentation: Centralize &amp; maintain all employees’ personal &amp; professional information/documentation on various HCM tools &amp; systems;</li><li>Reporting: Provide regular &amp; metrics to your tribe managers: Performance, Employee Engagement, Pulse Study, Employee Retention, etc;</li><li>L&amp;D: Act as an integral consultant &amp; train your tribe leaders &amp; managers on best management practices, performance management, labor regulations, etc;</li><li>Conflict Management: consult with employees &amp; managers to address &amp; resolve the root causes of any human resources issues objectively &amp; impartially;</li><li>Participates in company-wide programs &amp; initiatives (ie. salary review, workforce planning, organizational change, ESOP, C&amp;B, etc).</li>,<h3>Must-haves:</h3><li>Bachelor’s degree in human resources, business administration, or similar relevant field &amp; a minimum of 4 years of experience in HR business partnering role;</li><li>Proven experience in taking charge of projects and guiding them to successful completion;</li><li>Possesses strong leadership skills and is resilient;</li><li>Possesses strong customer-centric skills with a passion for service, ensuring all our interactions with people are handled professionally and with thorough attention to detail;</li><li>Proven experience in strategic HR plans and solutions, dealing with organization strategies and complex business/HR-related topics;</li><li>Strong stakeholder management, interpersonal, and communication skills with all levels of seniority in a cross-functional &amp; global environment;</li><li>Effective &amp; analytical mindset, creative and pragmatic problem-solving skills with strong business acumen &amp; user-centric philosophy;</li><li>Self-driven, optimistic, and keen to work as part of a professional and closely-knit team while highly organized with excellent time management skills;</li><li>Experience with HRIS, HCM &amp; other tools, ensuring the highest level of confidentiality &amp; accuracy on personal &amp; professional information.</li>,<h3>Good to have:</h3><li>Experience in the travel tech and/or telco industry;</li><li>Relevant HR certifications (iHRP, CIPD, SHRM, etc);</li><li>Additional written/spoken languages.</li><div><i>We sincerely thank all applicants in advance for submitting their interest in this opportunity with Airalo. </i></div>","tags":"[\"management\"]","pubDate":"2024-01-24 14:28:16.828","link":"https://jobs.lever.co/airalo/4329e822-4566-41c9-87f9-d52dabbff1f0","savedDate":"2024-02-01 05:45:15.154","slug":"hr-manager-singapore-airalo-7158"},{"id":3040159019,"title":"People Director, HR (Europe)","company":"Airalo","image":"https://lever-client-logos.s3.us-west-2.amazonaws.com/55028a36-609c-479c-9553-d4689ff2dd8c-1669620566663.png","description":"<div><b>About Airalo</b></div><div>Alo! Airalo is the world’s first eSIM store that helps people connect in over 200+ countries and regions across the globe. We are building the next digital service that revolutionizes the telecom industry. We are a travel-tech company and an equal-opportunity environment that values and executes diversity, inclusion, and equity. Our team is spread across 40+ countries and six continents. What glues us together is our commitment to changing the way you connect<span style=\"font-size: 13.3333px\">. </span></div><div><br></div><div><b>About you</b></div><div>We hope that you care deeply about the quality of your work, the intrinsic worth of tasks, and the success of your team. You are self-disciplined and do not require micromanagement in terms of your skillset and work ethic. You do your best to flourish as an individual every day while working hard to foster a collaborative team environment. You believe in the importance of being — and staying — authentic, honest, positive, and kind. You are a good interlocutor with clear and concise communication. You are able to manage multiple projects, have an analytical mind, pay keen attention to detail, and love to get your hands dirty. You are cognizant, tolerant, and welcoming of vulnerabilities and cultural differences.</div><div><br></div><div><b>About the Role</b></div><div><b>Position</b>: Full-time / Employee</div><div><b>Location:</b>&nbsp;Remote-first </div><div><b>Benefits:</b>&nbsp;Employee Stock Options, Health Insurance, work-from-anywhere stipend, annual wellness &amp; learning credits, annual all-expenses-paid company retreat in a gorgeous destination &amp; other benefits</div><div><br></div><div>As a <b>People Director,</b> you will be responsible for all day-to-day people-partnering matters and be a key driver for change &amp; operational excellence, aligning business &amp; people strategies to develop a pleasant, rewarding &amp; high-performance culture within Airalo. You’ll be working closely with our founders, C-level executives, VPs &amp; Directors of your assigned tribe, as well as the entire People &amp; Talent team.&nbsp;</div><h3>Responsibilities include but are not limited to:</h3><li>Lead and manage a team of People Managers, fostering a collaborative and high-performance work environment;</li><li>Provide guidance, coaching, and support to ensure the team achieves strategic objectives and individual professional development;</li><li>Develop and execute HR projects within various pillars, including Reward and Recognition, Performance Management, Training &amp; Development, Internal Communications, Wellness, and Employee Lifecycle. This includes; onboarding, contract Management, and offering an optimal, welcoming &amp; automated onboarding experience to all our people;</li><li>Align HR initiatives with organizational goals, ensuring seamless integration and impact;</li><li>Play a key role in shaping and executing the organization's People strategy. Stay informed about industry trends, best practices, and emerging technologies, contributing insights to enhance the effectiveness of the People function;</li><li>Drive and manage change initiatives within the People team and across the organization, ensuring a smooth transition to successfully impact employee engagement and retention;</li><li>Collaborate with the Talent Acquisition team to attract, recruit, and retain top talent;</li><li>Establish and monitor key performance indicators (KPIs) to assess the effectiveness of the People programs;</li><li>Generate regular reports and analyses to inform decision-making and identify areas for improvement;</li><li>Ensure HR practices comply with relevant laws and regulations;</li><li>Oversee the design and implementation of training programs that enhance the skills and capabilities of Airalo’s team members to build a high-performance workforce;</li><li>Develop and implement internal communication strategies and policies that enhance people’s experience;</li><li>Oversee and support the upkeep of the communication channels and management systems across the organization;</li><li>Collaborate with senior leadership to identify and develop potential leaders within the organization, ensuring a pipeline of talent for key roles;</li><li>Implement strategies to create an inclusive and welcoming work environment for all employees;</li><li>Collaborate with leaders from various departments to understand their People's needs and provide strategic HR support aligned with the overall business strategy;</li><li>Implement innovative solutions to enhance the People team’s efficiency and effectiveness;</li><li>Consolidate and manage comprehensive records of both personal and professional information for all team members using diverse tools and systems. Additionally, meticulously document and uphold all processes and procedures through adherence to the company's standardized documentation process;</li><li>Consult with team members &amp; leaders to address &amp; resolve the root causes of any human resources issues objectively &amp; impartially.</li>,<h3>Must-haves:</h3><li>A proven track record as a senior leader responsible for leading a People team. Ideally with 10+ years of experience in a people leadership role;</li><li>A proven track record of exceptional execution skills, adept at navigating projects to successful completion;</li><li>Self-driven, optimistic, and keen to work as part of a professional and closely-knit team while highly organized with excellent time management skills;</li><li>Demonstrates a genuine enthusiasm for surpassing expectations, consistently striving to exceed assigned responsibilities. Committed to executing all tasks within the People team's purview in a world-class manner, dedicated to providing the Airalo team with an unparalleled experience;</li><li>Proven experience in strategic HR plans and solutions, dealing with organization strategies and complex business/HR-related topics;</li><li>Strong stakeholder management, interpersonal, and communication skills with all levels of seniority in a cross-functional &amp; global environment;</li><li>Effective &amp; analytical mindset, creative and pragmatic problem-solving skills with strong business acumen &amp; user-centric philosophy;</li><li>Experience with HRIS, HCM &amp; other tools, ensuring the highest level of confidentiality &amp; accuracy on personal &amp; professional information.</li>,<h3>Good to have:</h3><li>Bachelor’s degree in human resources, business administration, or similar relevant field;</li><li>Experience in the travel tech and/or telco industry;</li><li>Possesses a keen affinity for HRIS and Management tools systems, finding enjoyment in navigating and optimizing these systems. Serves as the champion within the People team, adept at training newcomers and ensuring that all team members utilize systems in the most effective and efficient manner possible;</li><li>Relevant HR certifications (iHRP, CIPD, SHRM, etc);</li><li>Additional written/spoken languages.</li><div><i>We sincerely thank all applicants in advance for submitting their interest in this opportunity with Airalo. </i></div>","tags":"[\"management\",\"aws\"]","pubDate":"2024-01-24 14:19:37.780","link":"https://jobs.lever.co/airalo/f4f2ba78-510d-46ef-8584-ca973079cd13","savedDate":"2024-02-01 05:45:15.156","slug":"people-director-hr-europe-airalo-6841"}]