[{"id":6226425068,"title":"Director/Lead Product Marketing Manager","company":"Timescale","image":"https://pbs.twimg.com/profile_images/1542681228666671107/L5LYJLAD_400x400.png","description":"&lt;p&gt;Timescale is looking for an experienced &lt;strong&gt;Director of Product Marketing/Lead Product Marketing Manager&lt;/strong&gt; with a successful track record of driving sales growth of developer tools products. The ideal candidate will bring a proven track record of enabling sales and marketing teams in companies that have built a very successful sales motion on top of a PLG, bottoms-up motion to accelerate growth. We are looking for a hands-on leader with experience building and growing product marketing teams.&lt;/p&gt;\n&lt;p&gt;This is an exciting opportunity to build the next great cloud database company for the 25 million developers in the world. Today, timescale is an excellent database with a clear product-market fit in the time series market, and we are expanding our offerings to go after.&amp;nbsp;You&#39;ll succeed at Timescale if you are entrepreneurial, bold, scrappy, decisive, fired up in front of challenges and uncertainty, and get things done.&lt;/p&gt;\n&lt;p&gt;&lt;em&gt;Although Timescale is primarily a remote organization, we are ideally hiring for this role in San Francisco, CA, to allow for frequent collaboration with local team members.&amp;nbsp;&lt;/em&gt;&lt;/p&gt;\n&lt;p&gt;Responsibilities:&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;Collaborate closely with the sales team to create effective sales enablement tools, including product collateral, case studies, and training materials that empower the sales force to communicate the value of our products effectively.&lt;/li&gt;\n&lt;li&gt;Develop and articulate a compelling value proposition for Timescale&#39;s products, ensuring alignment with the needs and preferences of our developer audience.&lt;/li&gt;\n&lt;li&gt;Craft and execute comprehensive go-to-market plans for new product launches, feature releases, and updates. Work cross-functionally to coordinate marketing efforts and ensure a unified message.&lt;/li&gt;\n&lt;li&gt;Stay abreast of industry trends, competitor offerings, and customer needs to inform product positioning, messaging, and overall marketing strategy.&lt;/li&gt;\n&lt;li&gt;Develop and nurture relationships with key customers to leverage their success stories for marketing collateral, case studies, and testimonials.&lt;/li&gt;\n&lt;li&gt;Collaborate with product management, engineering, sales, and other teams to ensure a cohesive and consistent message across all customer touchpoints.&lt;/li&gt;\n&lt;li&gt;Define and monitor key performance indicators (KPIs) to measure the effectiveness of product marketing initiatives and adjust strategies accordingly.&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;Qualifications:&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;Experience: 7+ years of product marketing experience, focusing on developer-focused products, and a track record of success in sales enablement.&lt;/li&gt;\n&lt;li&gt;Extensive experience building Sales Enablement programs, including creating sales collateral, building sales training&lt;/li&gt;\n&lt;li&gt;Experience leading or managing a team of Product Marketing Managers. It is a huge plus if you have built a function from the ground up!&amp;nbsp;&lt;/li&gt;\n&lt;li&gt;Familiarity with the database technology space, particularly time-series databases, is highly desirable.&lt;/li&gt;\n&lt;li&gt;Proven experience in a product-led growth environment, with a deep understanding of leveraging product capabilities to drive user acquisition and retention.&lt;/li&gt;\n&lt;li&gt;Exceptional written and verbal communication skills, with the ability to tailor messaging to both technical and non-technical audiences.&lt;/li&gt;\n&lt;li&gt;Demonstrated leadership skills with the ability to lead and inspire cross-functional teams.&lt;/li&gt;\n&lt;li&gt;Strong analytical and strategic thinking skills, with the ability to use data to inform decisions and measure success.&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;Total compensation range: $180,000 - $220,000 per year. Total compensation may vary based on qualifications and experience.&lt;/p&gt;&lt;div class=&quot;content-conclusion&quot;&gt;&lt;p&gt;By applying for this position, you are agreeing to &lt;a href=&quot;https://www.timescale.com/legal/timescale-applicant-privacy-note&quot; target=&quot;_blank&quot;&gt;Timescale&#39;s Applicant Privacy Notice.&lt;/a&gt;&amp;nbsp;&lt;/p&gt;&lt;/div&gt;","tags":"[\"management\",\"engineering\",\"legal\",\"database\"]","pubDate":"2024-02-06 03:12:33.965","link":"https://www.timescale.com/careers/7129506002?gh_jid=7129506002","savedDate":"2024-02-06 03:12:33.965","slug":"director-lead-product-marketing-manager-timescale-6276"},{"id":5240566882,"title":"Director, People Operations (Remote)","company":"DuckDuckGo","image":"https://spreadprivacy.com/content/images/2023/05/duckduckgo-logo_wide.png","description":"<p>Hi, we’re DuckDuckGo, the Internet privacy company for everyone who wants to take back their privacy now. For over a decade, we've been building our all-in-one product, developing new privacy technology, and working with policymakers to make online privacy simple and accessible for all. </p>\n<p><br /></p>\n<p>Our app is now downloaded more than 78M times a year, and our private search engine packaged with it has become the #2 search engine on mobile in the United States and 18 other countries, including the United Kingdom, Canada, Australia, Germany, and the Netherlands. Oh, and we've been profitable since 2014, with revenue exceeding $100 million a year! Now, we’re rolling out a suite of new privacy solutions, including <u><a href=\"https://www.spreadprivacy.com/introducing-email-protection-beta/\" rel=\"noopener\">Email Protection</a></u>,  <u><a href=\"https://spreadprivacy.com/introducing-app-tracking-protection/\" rel=\"noopener\">App Tracking Protection</a></u> and our first-ever Desktop Apps for <u><a href=\"https://spreadprivacy.com/introducing-duckduckgo-for-mac/\" rel=\"noopener\">Mac</a></u><a href=\"https://spreadprivacy.com/introducing-duckduckgo-for-mac/\" rel=\"noopener\"> </a>and <u><a href=\"https://spreadprivacy.com/windows-browser-open-beta/\" rel=\"noopener\">Windows</a></u>.</p>\n<p><br /></p>\n<p>We’re looking for a Director, People Operations to continue building the fabric of our organisation, which empowers everyone to shape our all-in-one privacy solution and accelerate our mission; to show the world that protecting your privacy online can be simple.  </p>\n<p><br /></p>\n<p><strong>The Opportunity</strong> </p>\n<p>In this role, you will drive business-critical work forward by improving organizational effectiveness — enabling team member performance and engagement, empowering managers across teams and functions, and supervising general HR operations. You'll also be responsible for evaluating the success of our end-to-end performance review cycles, while adapting and scaling these review processes to meet DuckDuckGo's needs as we continue to grow.</p>\n<p><br /></p>\n<p>As a key contributor to one of our highest-priority objectives, you'll use data to develop strategic direction focused on team satisfaction, and execute your vision by leading and advising on initiatives within it. You will also identify new areas of opportunity that could positively impact our organizational effectiveness, such as scaling existing processes and coaching others to do the same.</p>\n<p><br /></p>\n<p>Leveraging your broad leadership skills, you will support a group of talented People Operation Partners in identifying high-impact projects that allow our team members to maximize impact and enable organizational and individual growth. You can expect your work to be data-driven, but also expect our Privacy mission and values to require creativity, where you may need to identify proxy metrics and continually adjust assumptions to communicate and evaluate success.</p>\n<p><br /></p>\n<p>What You Will Bring to DuckDuckGo </p>\n<ul><li>10+ years of experience in People Operations with 4+ years of experience in leadership roles (Head, Director, etc.).</li><li>Deep People Ops functional expertise across multiple domains, specifically performance management, employee relations, recognition, engagement, manager enablement, and other HR operations for a scaling tech company.</li><li>Expert-level coaching and leadership skills. </li><li>Experience scaling a People Operations team and establishing efficient processes for specialties (eg, benefits, performance).</li><li>Demonstrated ability to prioritize critical People Ops work to maximize impact effectively.</li><li>Ability to apply compassion, consistency, and a high level of discretion in complex People Ops scenarios.</li><li>Pragmatic and analytical, with a proven track record of creating People Ops strategies (rooted in data) for global, remote tech organizations.</li><li>Demonstrated ability to empower managers as an organization is scaling.</li><li>Experience creating complex systems from scratch.</li></ul>\n<p><br /></p>\n<p><strong>How We Will Support You </strong> </p>\n<p>Our core values -- build trust, question assumptions, and validate direction -- underpin how we work day-to-day and the support we give our team members. We strive to empower our team members to be self-directed and self-motivated in their work.  </p>\n<p><br /></p>\n<ul><li><strong>Remote First, Always</strong>: We've always been a fully distributed company with team members all over the world. We trust you to get your work done wherever, and whenever.   </li><li><strong>Commitment to Personal Growth:</strong> Every team member has an annual budget of $1,250 USD to invest in their professional development. For team members in designated leadership roles, we offer reimbursement for leadership coaching services. The reimbursement amount varies by professional level. Every team member also has a dedicated Career Advisor, who serves as a guide to help you develop your strengths, identify your motivations, and understand your opportunities for growth. </li><li><strong>Leadership:</strong> We have many different types of leaders and possible combinations of leadership roles, so you can grow your career in a way that aligns best with your personal goals. You can seek additional leadership roles by being directly responsible for projects, taking ownership of areas of the company, developing and maintaining internal processes, or pursuing advisory roles. </li><li><strong>Work/Life Balance: </strong>Team members have the freedom and flexibility to organize their own work schedules. We want you to thrive both in and out of the office. We trust you to use good judgment and take the time off that you need to bring your best self to work.  </li></ul>\n<p><br /></p>\n<p>We also offer paid parental leave, a co-working stipend, office setup reimbursement, and a wellness stipend. More support resources can be found in our <u><a href=\"https://duckduckgo.com/assets/hiring/team_support_guide.pdf\" rel=\"noopener\">Team Member Support Guide</a></u>, which explains how we make your well-being a priority. </p>\n<p><br /></p>\n<p>For more information on how we collaborate worldwide, from leadership in our relatively flat organization to start-to-finish ownership<strong>,</strong> check out <u><a href=\"https://duckduckgo.com/assets/hiring/how_we_work.pdf\" rel=\"noopener\">DuckDuckGo Culture: How We Work.</a></u> </p>\n<p><br /></p>\n<p><strong>Compensation</strong> </p>\n<p>Annual compensation: $242,000 USD and stock options. Compensation is the same within a professional level, regardless of geographic location or functional area, and the compensation for each professional level is transparent across the organization.</p>\n<p><br /></p>\n<p><strong>Hiring Process</strong> </p>\n<p>Hiring works best when it's a two-way street. Learn how we help you get to know DuckDuckGo and envision your future role here. Find out more about <u><a href=\"https://duckduckgo.com/assets/hiring/how_we_hire.pdf\" rel=\"noopener\">how we hire</a></u>. </p>\n<p><br /></p>\n<p><strong>Diversity, Equity, and Inclusion</strong> </p>\n<p>DuckDuckGo provides equal work opportunities to all team members and applicants<u>,</u> and it prohibits discrimination and harassment of any type on the basis of race, color, ethnicity, caste, religion, age, sex (including pregnancy), national origin, disability status, genetics, protected veteran status, sexual orientation, gender identity or expression, or any other characteristic protected by our policies or federal, state, or local laws.</p>\n<p><br /></p>\n<p>We want to ensure that our hiring process is accessible. If you need reasonable accommodation for any part of the application process because of a medical condition or disability, please send an email to <u><a href=\"mailto:careers@duckduckgo.com\" rel=\"noopener\">careers@duckduckgo.com</a></u> to let us know the nature of your request.  </p>\n<p><br /></p>\n<p>If you think you might thrive in this environment, we would love to hear from you. </p>\n<p><br /></p>\n<p><strong>Please note that:</strong> </p>\n<ul><li>Sometimes we meet up! Expect to travel at least two times a year: once for our all-hands meetup and again for a team retreat (each around 4-5 days). While extenuating circumstances may impact attendance, everyone is strongly encouraged to attend.</li><li>While we offer a flexible work arrangement with no core hours, expect an average full-time commitment of 40 hours per week. </li><li>A successful candidate will be subject to a background check and must receive satisfactory results of the same, as a condition of joining the team. </li><li>By applying for this role, you confirm that all information submitted is accurate and complete. You further acknowledge that providing false or fraudulent information during the application process is cause for denial of an offer, revocation of any existing offer, or other adverse action, up to and including termination after the start of your commencement of work.  </li></ul>","tags":"[\"management\",\"aws\"]","pubDate":"2024-02-06 02:50:53.000","link":"https://duckduckgo.recruitee.com/o/director-people-operations-remote-global","savedDate":"2024-02-06 03:12:33.965","slug":"director-people-operations-remote-duckduckgo-8157"},{"id":5998842051,"title":"HR Admin (Fully Remote)","company":"CoverGo","image":"https://pbs.twimg.com/profile_images/1382655628523364355/MWPIbbID_400x400.jpg","description":"<p><strong>Top 3 Reasons To Join Us</strong></p><ul> <li>Competitive Salary</li> <li>100% Remote</li> <li>Working on the latest tech for the Insurtech Market Leader</li> </ul><p><strong>About Us:</strong></p><ul> <li>At CoverGo, our mission is to empower all insurance companies to make insurance 100% digital and accessible to everyone.</li> <li>We are a leading global no-code insurance platform for health, life, and P&amp;C</li> <li>We’re the winner of the Insurtech of the Year in all of Asia and other awards globally</li> <li>We work with insurance enterprise clients such as AXA, Bupa, MSIG, Dai-ichi, Bank of China Group Insurance, and many more</li> <li>We're an international, diverse team of over 120 people with 30 nationalities and team members working remotely from all over the world</li> <li>We are fully funded and backed by reputable VC funds and strategic institutional investors</li> <li>We have a global presence in Asia, EMEA and the Americas</li> <li>We’ve grown our annualized revenue by over 30x since January 2021</li> <li>We’re constantly working towards making CoverGo a workplace that you love coming to. We deeply believe that bringing together a diversity of thoughts, expressions, and perspectives is key to building the best culture for equally diverse communities all over the world</li> </ul><p><strong>What you will do:</strong></p><ul> <li>Assist the HR team in end-to-end recruitment processes, primarily managing the applicant tracking system</li> <li>Monitor the onboarding and offboarding task lists for joiners and leavers and assist in preparing and gathering documentation</li> <li>Prepare employment contracts, offer letters, and other HR-related documents.</li> <li>Collaborate with the staff club to develop and execute engagement strategies.</li> <li>Participate in HR team meetings and provide updates as required.</li> <li>Support HR team with administrative tasks.</li> <li>Maintain confidentiality of HR information and handle sensitive matters appropriately.</li> <li>Adapt to changing priorities and take on additional responsibilities when needed.</li> </ul><p><strong>What we are looking for:</strong></p><ul> <li>Fresh graduates are welcome to apply</li> <li>Degree in Psychology, Human Resource Development, or any related course</li> <li>Previous experience working for a startup or in Human resources is a plus</li> <li>Excellent skills in the use of Microsoft Office</li> <li>Able to work independently and under pressure in a fast-paced environment with an emphasis on accuracy and timeliness</li> <li>Self-motivated, hardworking, a strong sense of responsibility with a positive working attitude</li> <li>Good command of English is a must</li> </ul><p><a href=\"https://www.youtube.com/watch?v=YI0ezLxvFvA\" rel=\"nofollow noreferrer noopener\" class=\"external\"></a><strong>Why You'll Love Working Here</strong></p><ul> <li>Fully Remote</li> <li>Flexible Leave</li> <li>International Environment</li> <li>Competitive renumeration package</li> <li>Performance Bonus</li> <li>Stock Options after 6 months </li> <li>Company activities and events</li> <li>Learning and development plan</li> </ul><p><strong>CoverGo Company</strong><a href=\"https://www.youtube.com/watch?v=YI0ezLxvFvA\" rel=\"nofollow noreferrer noopener\" class=\"external\"><strong> Video</strong></a></p><p>By submitting your application, you confirm that you have read, understood, and accepted the content of CoverGo’s <a href=\"https://apply.workable.com/covergo/gdpr_policy?lng=en\" target=\"_blank\" rel=\"nofollow noreferrer noopener\" class=\"external\">Privacy Notice</a> and you consent to the processing of your data as part of this application.</p><h3>Requirements: </h3><h3>Benefits: </h3>","tags":"[]","pubDate":"2024-02-05 00:00:00.000","link":"https://apply.workable.com/covergo/j/A0C7E0BC24","savedDate":"2024-02-06 03:12:33.966","slug":"hr-admin-fully-remote-covergo-5776"},{"id":8127909043,"title":"Senior Backend Engineer - .NET/C#","company":"Janeasystems","image":"https://remotive.com/job/1895263/logo","description":"<p>Janea Systems (USA) is a dynamic team of the best &amp; brightest software engineering specialists and solutions innovators, from around the world. From kernel to cloud, we provide high-impact software development services to Fortune 500 companies. </p>\n<p>We are seeking an exceptionally talented Lead Backend Engineer to join our rapidly growing consulting team. In this role, you will have the opportunity to work on high profile projects at the cutting edge of the software industry.</p>\n<p><strong>To be considered for this position, you must have the following qualifications:</strong></p>\n<ul style=\"\">\n<li style=\"\">5+ years development experience with backend technologies, including experience with modern backend architecture (i.e. microservices, etc.)</li>\n<li style=\"\">3+ years development experience with .NET/C# (with ASP.NET)</li>\n<li style=\"\">Experience building and deploying solutions on cloud services (Azure preferred)</li>\n<li style=\"\">Experience with relational databases (Postgres, SQL Server, MySQL, etc.) </li>\n<li style=\"\">Fast learner with a can-do attitude and exceptional problem-solving abilities</li>\n<li style=\"\">Self-sufficient, proactive, and comfortable working collaboratively on remote projects</li>\n<li style=\"\">Experience in a client-facing role managing and delivering software engineering projects</li>\n<li style=\"\">English skills (ability to effectively communicate via written and spoken English)</li>\n<li style=\"\">A degree in computer science (or equivalent)</li>\n</ul>\n<p><strong>Ideal candidates will also have:</strong></p>\n<ul style=\"\">\n<li style=\"\">Experience architecting solutions on modern backend platforms</li>\n<li style=\"\">Strong understanding of DevOps concepts and process and CI/CD tools</li>\n</ul>\n<p><strong>Why join Janea? Because world-class talent deserves a world-class opportunity. What we offer:</strong></p>\n<ul style=\"\">\n<li style=\"\">Competitive compensation with benefits, paid vacation, and sick leave</li>\n<li style=\"\">The opportunity to work with a globally diverse team of top engineering talent on the industry’s toughest engineering challenges</li>\n<li style=\"\">Ultra-flexible work conditions – Work from home using our virtual office setup or, if you prefer, we provide you with a desk at an office facility near you. Or use both. </li>\n<li style=\"\">Flexible working hours – as a remote-first company, our focus has always been on getting the job done well, not when or where it gets done</li>\n<li style=\"\">A startup work environment, with excellent opportunities for professional growth and enjoyment</li>\n</ul>\n<p> </p>\n<img src=\"https://remotive.com/job/track/1895263/blank.gif?source=public_api\" alt=\"\"/>","tags":"[\"relational databases\"]","pubDate":"2024-02-04 13:20:25.000","link":"https://remotive.com/remote-jobs/software-dev/senior-backend-engineer-net-c-1895263","savedDate":"2024-02-06 03:12:33.963","slug":"senior-backend-engineer-net-c-janeasystems-9782"},{"id":7508033862,"title":"Senior UX Engineer","company":"ConsenSys","image":"https://remotive.com/job/1895215/logo","description":"<p>Our mission is to unlock the collaborative power of communities by making Web3 universally easy to use, access, and build on.</p>\n<p>Working with Consensys puts you at the <strong>forefront of an evolving paradigm</strong>, transforming our society for the better. We fundamentally believe blockchain is the next generation of technology that can lay the foundation for a more just and equitable society. </p>\n<p>Blockchain tech is just over 10 years old. Ethereum itself is still a toddler and we’re far from reaching our full potential. You’ll get to work on the tools, infrastructure, and apps that scale these platforms to billions of users. </p>\n<p>You’ll be constantly exposed to new concepts, ideas, and frameworks from your peers, and as you work on different projects — challenging you to stay at the <strong>top of your game</strong>. You’ll join a network of entrepreneurs and technologists that reaches the <strong>edge of our ecosystem</strong>. Consensys alumni have moved on to become tech entrepreneurs, CEOs, and team leads at tech companies. </p>\n<p><strong>About MetaMask</strong></p>\n<p>We’re building for a future where the internet and world economy empowers people through interactions based on consent, privacy, and free association. Where both communities and individuals flourish. To accomplish that, we’re working hard to make web3 accessible for everyone around the world.</p>\n<p>MetaMask is both a crypto wallet and a gateway to the decentralized web. Our tools help people create communities, play video games, access financial services, make payments, invest in assets, protect against economic turmoil, and more. Our browser extension and mobile platforms meet the needs of millions of users and developers across the world.</p>\n<p>Originally a humble key manager, today MetaMask serves over<a href=\"%22https:/techcrunch.com/2022/03/15/metamask-parent-company-consensys-raises-series-d-at-7b-valuation/?guccounter=1&amp;guce_referrer=aHR0cHM6Ly93d3cuZ29vZ2xlLmNvbS8&amp;guce_referrer_sig=AQAAAA17TpZSF_aCYTb-Ju92B34bkm5hs-N4Cxdpk5lR_Ve3lZQOiYFcfqkk_oNHMu1faSa-Ht5LMGxK7LHEnzCg3bAQJH3KI8SPhqQTd31XsNZyNQ3HUFwhID8cZGy9qzjoXK7tUdxKlfXV2mikuuez0jodL5s1UMpbed6hY3dhwUQO#:~:text=MetaMask alone has over 30,Ethereum wallet by this metric.%22\" rel=\"nofollow\"> 30 million monthly active users</a> as a<a href=\"%22https:/docs.metamask.io/guide/%22\" rel=\"nofollow\"> decentralized application development platform</a>, an<a href=\"%22https:/medium.com/metamask/introducing-metamask-swaps-84318c643785%22\" rel=\"nofollow\"> aggregator of decentralized cryptocurrency exchanges</a>, and a decentralized identity manager.</p>\n<p><strong>What you’ll do</strong></p>\n<p>Candidate will be responsible for improving and implementing user experiences in both the MetaMask extension client as well as the MetaMask mobile.  </p>\n<p><strong>Would be great if you brought this to the role</strong></p>\n<ul style=\"\">\n<li style=\"\">6+ years working with web and mobile-based technologies.</li>\n<li style=\"\">Hands-on experience with at least one: React, React Native, Vue, or Angular.</li>\n<li style=\"\">Extensive experience with modern Javascript (ES6/TypeScript/etc.).</li>\n<li style=\"\">Fundamental knowledge of CSS and CSS preprocessors (Sass / LESS)</li>\n<li style=\"\">Strong working knowledge developing cross platform/browser compatibility. </li>\n<li style=\"\">Experience working in an agile development team.</li>\n<li style=\"\">Experience developing medium to large-scale applications across the entire stack with minimal tech debt through sensible abstractions, testing, linting, and adherence to coding/web standards.</li>\n<li style=\"\">Experience consuming APIs.</li>\n<li style=\"\">A demonstrable understanding of Continuous Integration.</li>\n<li style=\"\">Strong understanding of web-based security threats and prevention techniques.</li>\n<li style=\"\">Mobile experience strongly preferred.</li>\n</ul>\n<p>Don't meet all the requirements? Don't sweat it. We’re passionate about building a diverse team of humans and as such, if you think you've got what it takes for our chaotic-but-fun, remote-friendly, start-up environment—apply anyway, detailing your relevant transferable skills in your cover letter. While we have a pretty good idea of what we need, we're ready for you to challenge our thinking on who needs to be in this role.</p>\n<p><em>Consensys is an equal opportunity employer. We encourage people from all backgrounds to apply. We are committed to ensuring that our technology is made available and accessible to everyone. All employment decisions are made without regard to race, color, national origin, ancestry, sex, gender, gender identity or expression, sexual orientation, age, genetic information, religion, disability, medical condition, pregnancy, marital status, family status, veteran status, or any other characteristic protected by law. Consensys is aware of fraudulent recruitment practices and we encourage all applicants to review our best practices to protect yourself which can be found (<a href=\"%22https:/consensys.net/careers/best-practices-to-avoid-recruitment-fraud/)%22\" rel=\"nofollow\">https://consensys.net/careers/best-practices-to-avoid-recruitment-fraud/)</a></em><em>.</em></p>\n<p>#LI-HG1</p>\n<div class='\"content-pay-transparency\"'>\n<div class='\"pay-input\"'>\n<div class='\"description\"'>\n<p><em>The salary range for US-based candidates only will be determined throughout the interview process depending on experience and skills.</em></p>\n</div>\n<div class='\"title\"'>US pay range (not including bonus, equity or other benefits)</div>\n<div class='\"pay-range\"'>$100,000<span class='\"divider\"'>—</span>$177,000 USD</div>\n</div>\n</div>\n<img src=\"https://remotive.com/job/track/1895215/blank.gif?source=public_api\" alt=\"\"/>","tags":"[\"javascript\",\"react\",\"react native\"]","pubDate":"2024-02-04 13:20:23.000","link":"https://remotive.com/remote-jobs/software-dev/senior-ux-engineer-1895215","savedDate":"2024-02-06 03:12:33.964","slug":"senior-ux-engineer-consensys-7585"},{"id":5929234276,"title":"Product Marketing Manager","company":"HealthRhythms","image":"https://remotive.com/job/1894018/logo","description":"<p style=\"min-height:1.5em\"><strong>About HealthRhythms</strong> </p><p style=\"min-height:1.5em\">Backed by elite Silicon Valley VCs and strategics ($40M), our mission is to alleviate unnecessary suffering by bringing mental health into the modern era of medicine. The market now recognizes that there is no health without mental health.  By combining the multi-dimensional sensing capabilities of mobile phones with the power of embedded and cloud computing platforms and novel AI algorithms, we continuously, objectively, and accurately measure mental health status for the very first time. We are realizing the vision of precision medicine for mental health by anticipating clinical deterioration before it reaches crisis proportions and by delivering personalized, just-in-time interventions based on each patient’s own behavioral profile.  </p><p style=\"min-height:1.5em\">Our deep tech solution founded on 35 years of empirical evidence - led by our four co-founders and over 957 peer reviewed papers between them - addresses at the root cause the dual crises of insufficient access to mental health care and lack of measurement to assess intervention effectiveness. We have the advantage of a 35 year head start, best in class team, robust IP portfolio, and the largest mental health AI data set. </p><p style=\"min-height:1.5em\">UCHealth ($6B) declared \"HealthRhythms will change the face of care,\" and its #1 strategic priority is to deploy our platform to its 2.5M patients. UC invested twice and put its Chief Innovation Officer on our Board. Otsuka ($18B pharma) invested in HealthRhythms after assessing 500+ mental health companies, recognizing our potential to revolutionize the industry. Otsuka put its CMO on our Board. </p><p style=\"min-height:1.5em\">If joining an accelerating 100% remote startup, working with an extraordinary team who have united behind a mission to significantly improve the lives of patients  sounds meaningful and exciting to you, <strong>please read on and apply. </strong></p><p style=\"min-height:1.5em\">As a Product Marketing Manager you will play a pivotal role in driving successful market adoption of our solutions. You will be responsible for developing and executing comprehensive product marketing strategies that enable the adoption and growth of our platform among pharmaceutical companies, healthcare providers, payers, and other key stakeholders. Your expertise will be critical in positioning our solution, creating effective sales materials, understanding customer needs, and driving go-to-market efforts.</p><p style=\"min-height:1.5em\">Key Responsibilities:</p><ul style=\"\"><li style=\"\"><p style=\"min-height:1.5em\">Market Research and Analysis:</p><ul style=\"\"><li style=\"\"><p style=\"min-height:1.5em\">Conduct market research to identify healthcare industry trends, competitor offerings, and customer needs.</p></li><li style=\"\"><p style=\"min-height:1.5em\">Analyze market data to define target customer segments and opportunities.</p></li></ul></li><li style=\"\"><p style=\"min-height:1.5em\">Product Positioning and Messaging:</p><ul style=\"\"><li style=\"\"><p style=\"min-height:1.5em\">Develop clear and compelling value propositions for our digital healthcare solutions.</p></li><li style=\"\"><p style=\"min-height:1.5em\">Craft product messaging that resonates with healthcare professionals and decision-makers.</p></li></ul></li><li style=\"\"><p style=\"min-height:1.5em\">Go-to-Market Strategy:</p><ul style=\"\"><li style=\"\"><p style=\"min-height:1.5em\">Collaborate with cross-functional teams to create and execute go-to-market plans for new product releases and updates.</p></li><li style=\"\"><p style=\"min-height:1.5em\">Define pricing strategies and packaging options to maximize market penetration and profitability.</p></li></ul></li><li style=\"\"><p style=\"min-height:1.5em\">Content Creation:</p><ul style=\"\"><li style=\"\"><p style=\"min-height:1.5em\">Create high-impact marketing collateral, including product brochures, whitepapers, case studies, and web content.</p></li><li style=\"\"><p style=\"min-height:1.5em\">Collaborate with the content team to produce engaging content that educates and informs our target audience.</p></li></ul></li><li style=\"\"><p style=\"min-height:1.5em\">Sales Enablement:</p><ul style=\"\"><li style=\"\"><p style=\"min-height:1.5em\">Equip the sales team with the tools, training, and resources needed to effectively communicate product value.</p></li><li style=\"\"><p style=\"min-height:1.5em\">Develop sales enablement materials, such as presentations, FAQs, and objection handling guides.</p></li></ul></li><li style=\"\"><p style=\"min-height:1.5em\">Customer Engagement:</p><ul style=\"\"><li style=\"\"><p style=\"min-height:1.5em\">Establish strong relationships with key customers and gather feedback to inform product development.</p></li><li style=\"\"><p style=\"min-height:1.5em\">Develop customer success stories and testimonials to showcase the impact of our solution.</p></li></ul></li><li style=\"\"><p style=\"min-height:1.5em\">Product Launches:</p><ul style=\"\"><li style=\"\"><p style=\"min-height:1.5em\">Plan and execute product launch campaigns, including digital marketing, email campaigns, and events.</p></li><li style=\"\"><p style=\"min-height:1.5em\">Coordinate product launch events and webinars to engage prospects and customers.</p></li></ul></li><li style=\"\"><p style=\"min-height:1.5em\">Performance Analytics:</p><ul style=\"\"><li style=\"\"><p style=\"min-height:1.5em\">Measure and report on the effectiveness of marketing campaigns and product adoption.</p></li><li style=\"\"><p style=\"min-height:1.5em\">Use data-driven insights to refine marketing strategies and improve product positioning.</p></li></ul></li></ul><p style=\"min-height:1.5em\">Qualifications:</p><ul style=\"\"><li style=\"\"><p style=\"min-height:1.5em\">Bachelor's degree in Marketing, Business, or a related field (Master's degree preferred).</p></li><li style=\"\"><p style=\"min-height:1.5em\">Proven experience in product marketing, preferably in the healthcare or B2B SaaS industry.</p></li><li style=\"\"><p style=\"min-height:1.5em\">Strong understanding of the healthcare landscape and digital healthcare solutions.</p></li><li style=\"\"><p style=\"min-height:1.5em\">Excellent written and verbal communication skills.</p></li><li style=\"\"><p style=\"min-height:1.5em\">Creative thinker with a data-driven approach to decision-making.</p></li><li style=\"\"><p style=\"min-height:1.5em\">Proficiency in marketing automation tools and analytics platforms. Preference for experience with Braze and Amplitude.</p></li><li style=\"\"><p style=\"min-height:1.5em\">Ability to collaborate effectively with cross-functional teams.</p></li></ul><p style=\"min-height:1.5em\">Until now, mental health has been the only field of medicine lacking objective measurement. Health Rhythms captures data to create objective and actionable insights to improve mental health outcomes globally. Providers use Health Rhythms data to improve outcomes for their patients, and life science companies use Health Rhythms data to study and create better therapeutic solutions.</p><p style=\"min-height:1.5em\">We believe that the 3B supercomputers in pockets around the world can be a platform to deliver mental health as a human right. If you believe the same, let's talk. </p><img src=\"https://remotive.com/job/track/1894018/blank.gif?source=public_api\" alt=\"\"/>","tags":"[\"product marketing\",\"market research\"]","pubDate":"2024-02-04 05:21:11.000","link":"https://remotive.com/remote-jobs/marketing/product-marketing-manager-1894018","savedDate":"2024-02-06 03:12:33.964","slug":"product-marketing-manager-healthrhythms-5401"},{"id":9460509100,"title":"Product Page Graphic Designer","company":"Eli Z Group","image":"https://remotive.com/job/1895456/logo","description":"<p>Hello! In Eli Zeta Group, we’re reimagining how to make the world’s trendy and most-loved products accessible to everyone. Launched in Spain in 2016, we have been fully remote with team members in more than 20 countries. We own several branded stores that speak up to 7 languages, selling and shipping worldwide.</p>\n<div class=\"h2\">Tasks</div>\n<p>Responsibilities: </p>\n<ul style=\"\">\n<li style=\"\">Follow an existing workflow for ads production in the company </li>\n<li style=\"\">Planning concepts by studying relevant information and materials.</li>\n<li style=\"\">Illustrating concepts by designing examples of art arrangement, size, type size and style and submitting them for approval</li>\n<li style=\"\">Communicating with clients about layout and design</li>\n<li style=\"\">Reviewing the layouts and suggesting improvements when necessary</li>\n<li style=\"\">Understand the conversion principles for social media ads</li>\n</ul>\n<div class=\"h2\">Requirements</div>\n<ul style=\"\">\n<li style=\"\">Showcase your skills through a dynamic portfolio that highlights your ability to create visually compelling designs.</li>\n<li style=\"\">Demonstrate a discerning eye for visual composition, ensuring your designs not only capture attention but also convey the intended message effectively.</li>\n<li style=\"\">Proactive Initiative: Demonstrate a proactive approach to tasks and projects, taking the initiative to suggest improvements and explore creative solutions independently.</li>\n<li style=\"\">Understanding of marketing, production, website design, brand identity, product packaging, advertisements, and multimedia design.</li>\n<li style=\"\">Knowledge how to use Slack and Monday.com (similar to Asana or other PM tools)</li>\n<li style=\"\">Develop product page design concepts that align with project requirements and contribute to an innovative and engaging online shopping experience.</li>\n<li style=\"\">Collaborative mindset, actively contributing to team discussions and working harmoniously to achieve shared goals.</li>\n<li style=\"\">Display an eagerness to learn and improve, staying updated with industry trends and incorporating new design techniques into your skill set.</li>\n</ul>\n<div class=\"h2\">Benefits</div>\n<ul style=\"\">\n<li style=\"\">Unlimited growth in a team of passionate and enthusiastic marketers</li>\n<li style=\"\">Fully remote position with flexible working schedule</li>\n<li style=\"\">Possibility to receive a bonus based on performance as you grow</li>\n</ul><img src=\"https://remotive.com/job/track/1895456/blank.gif?source=public_api\" alt=\"\"/>","tags":"[\"graphic design\"]","pubDate":"2024-02-03 19:20:30.000","link":"https://remotive.com/remote-jobs/design/product-page-graphic-designer-1895456","savedDate":"2024-02-06 03:12:33.964","slug":"product-page-graphic-designer-eli-z-group-8989"},{"id":5959581659,"title":"Office Assistant ","company":"Coalition Technologies ","image":"https://remotive.com/job/1749306/logo","description":"<p class=\"h3\">WHY YOU SHOULD APPLY</p>\n<p>Coalition Technologies is devoted to delivering clients the highest quality work while providing our team a fun, thriving, and innovative environment. Along with the opportunity for tremendous career growth and rapid advancement, CT offers:</p>\n<ul style=\"\">\n<li style=\"\">The most competitive profit-sharing bonus plan in the industry, paying up to 50% of company profits to full-time employees each month!</li>\n<li style=\"\">A highly competitive Paid Time Off plan, promoting quality work-life balance.</li>\n<li style=\"\">Subsidized gym memberships to help team members feel their best.</li>\n<li style=\"\">Medical, dental, vision, and life insurance packages for all US-based team members.</li>\n<li style=\"\">International Health Insurance Reimbursement Program for all international team members, a benefit unique to Coalition.</li>\n<li style=\"\">Device upgrade and learning reimbursement programs.</li>\n<li style=\"\">Motivating career development plans with clearly defined goals and rewards.</li>\n<li style=\"\">Additional job-specific incentives and bonuses.</li>\n</ul>\n<p>Plus, 100% of our team works remotely with the support of time tracking software. Our company culture specializes in supporting remote team members, and we’ve been doing so for more than a decade. CT welcomes your application, wherever in the world it's coming from!</p>\n<p> </p>\n<p class=\"h3\">YOUR DUTIES AND TASKS:</p>\n<ul style=\"\">\n<li style=\"\">Answer phones and direct calls.</li>\n<li style=\"\">Complete entry-level bookkeeping, including recording expenses, organizing receipts, and completing other transaction records.</li>\n<li style=\"\">Resolve billing issues with clients and internal team members.</li>\n<li style=\"\">Provide account access, usage reports, data analysis, and other ad hoc requests for team members.</li>\n<li style=\"\">Support quality assurance checks of various internal and client facing reporting.</li>\n<li style=\"\">Organize new client contracts, create invoices, and process client payments.</li>\n<li style=\"\">Contribute to internal database maintenance, upkeep and data entry.</li>\n<li style=\"\">Research, order, &amp; distribute company-wide gifts (2-3 times per year).</li>\n<li style=\"\">Organize company events, competitions, and special projects throughout the year.</li>\n<li style=\"\">Facilitate company holiday, time off, and schedule variation calendars.</li>\n</ul>\n<p> </p>\n<p class=\"h3\">YOU SHOULD HAVE:</p>\n<ul style=\"\">\n<li style=\"\">Willingness to learn, grow, and collaborate with the team and company as a whole</li>\n<li style=\"\">Excellent verbal and written communication skills</li>\n<li style=\"\">A high level of discretion, ethics, and trustworthiness</li>\n<li style=\"\">Intermediate spreadsheet skills (preferred)</li>\n<li style=\"\">Innovative thinking and willingness to challenge existing methods where improvement is possible</li>\n<li style=\"\">Experience in bookkeeping / financial record keeping (preferred)</li>\n<li style=\"\">Experience with Google Sheets or Excel, Quickbooks Online, and G Suite (preferred)</li>\n<li style=\"\">The availability to work 40 hours per week from 9:00 am to 6:00 pm PST</li>\n<li style=\"\">Reliable space to work remotely - fast computer, quality internet, camera, microphone, speakers</li>\n</ul>\n<p>This is a position with a high opportunity for the right candidate to grow! Our successful office assistants have seen fast growth and promotion, both within the Accounting team and to other teams.</p>\n<p> </p>\n<p class=\"h5\">We are looking for talented and diligent candidates who excel in our skills tests, and will consider these candidates even if past experience or educational background criteria aren't met.</p>\n<p> </p>\n<p>*California, New York, Washington, and Colorado: starting base pay for this position ranges between $15 - $25 per hour.</p>\n<p>Compensation may vary based on factors such as experience, \r\nqualifications, skills test performance, geographic location, and \r\nseniority of the position offered. Outside of California, New York, \r\nWashington, and Colorado compensation may fall outside the above ranges.</p>\n<p class=\"h2\"><a class=\"text-primary\" href=\"https://app.testedrecruits.com/faqs?id=1\" rel=\"nofollow\" target=\"_blank\"> </a></p>\n<img src=\"https://remotive.com/job/track/1749306/blank.gif?source=public_api\" alt=\"\"/>","tags":"[\"accounting\",\"excel\",\"research\",\"data analysis\",\"bookkeeping\",\"google sheets\",\"quickbooks\",\"data entry\",\"insurance\",\"G Suite\"]","pubDate":"2024-02-02 14:45:54.000","link":"https://remotive.com/remote-jobs/all-others/office-assistant-1749306","savedDate":"2024-02-06 03:12:33.964","slug":"office-assistant-coalition-technologies-6805"},{"id":2788427503,"title":"Front End Developer (G)","company":"Blue Coding","image":"https://lever-client-logos.s3.us-west-2.amazonaws.com/3c1d9ac7-6738-46c5-b6ca-a35fa2a0df57-1666278594128.png","description":"<div><i style=\"font-size: 18px\">Do you want to earn a salary in USD?&nbsp;</i></div><div><i style=\"font-size: 18px\">Would you like to work from wherever you want?</i></div><div><i style=\"font-size: 18px\">Would you like to be a part of the leading next-gen software developers?&nbsp;</i></div><div><br></div><div><b style=\"font-size: 24px\">Hi, you finally found us!</b><span style=\"font-size: 24px\">&nbsp;</span></div><div><br></div><div><b style=\"font-size: 24px\">Why work at Blue Coding?</b><span style=\"font-size: 24px\">&nbsp;</span></div><div><br></div><div>At Blue Coding we specialize in hiring excellent developers and amazing people from all over Latin America and other parts of the world. For the past 9 years, we’ve helped cutting-edge companies in the United States and Canada -both large and small, build great development teams and develop great products. Online shops, digital agencies, SaaS providers, and software consulting firms are a few of our clients. Our team of over 100 engineers is distributed in more than 10 countries across the Americas. We are a fully remote company working with a wide array of technologies and have expertise in every stage of the software development process.&nbsp;&nbsp;</div><div><br></div><div>Our team is highly connected, united, and culturally diverse, and our collaborators are involved in many initiatives around the world, from wildlife preservation to volunteering at local charities. We also participate in group activities like movie nights, trivia, and meme competitions. We stand for honesty, fairness, respect, efficiency, hard work, and cooperation.</div><div><br></div><div><b>What are we looking for?</b></div><div>In this opportunity, we are looking for a Software Engineer to work with one of our foreign clients, who is a leader in the admission and ticketing space.</div><div>If you are independent, a great communicator, a problem solver, and have strong attention to detail, this is a great fit for you! Our jobs are fully remote – as long as you have the skills and can get the work done well, you can work anywhere in the listed countries you want.</div><div>If you have the skills and can get the job done, join us and work from anywhere you want!</div><div><br></div><div><b>What's unique about this job?</b></div><div>As a Front End Developer, you’ll be developing and maintaining the front end of the website project for multiple tenants.</div><h3>Here are some of the exciting day-to-day challenges you will face in this role:</h3><li>You'll be working with Javascript, React, and Azure to develop the website for one of our client's clients and help them do so in a creative and agile manner.</li>,<h3>You will shine if you have these:</h3><li>Hands-on experience with Javascript, Typescript, and React</li><li>Demonstrated experience working with Azure.</li><li>Experience working as a solo developer.</li>,<h3>Here are some of the perks we offer you:</h3><li>Salary in USD</li><li>Flexible schedule (within US Time zones)</li><li>100% Remote</li><div><b style=\"font-size: 24px\">Hey, you are still here!</b><span style=\"font-size: 24px\">&nbsp;</span></div><div><br></div><div>So, let us ask a few questions. Do you like working in a friendly environment? Are you fluent in English? Do you have a strong work ethic, are detail-oriented and have an ownership mentality? And most importantly do you love music and puppies? If so, then what are you waiting for? Come join our team and become part of this awesome company! We will be expecting you.</div>","tags":"[\"javascript\",\"typescript\"]","pubDate":"2024-01-15 21:01:32.729","link":"https://jobs.lever.co/bluecoding/46354f08-a0fb-4de1-9884-cdc765bd1e7f","savedDate":"2024-02-06 03:12:33.966","slug":"front-end-developer-g-blue-coding-3647"}]