[{"id":8335161219,"title":"Partnerships Manager (Saudi Arabia)","company":"Airalo","image":"https://lever-client-logos.s3.us-west-2.amazonaws.com/55028a36-609c-479c-9553-d4689ff2dd8c-1669620566663.png","description":"<div><b>About Airalo</b></div><div>Alo! Airalo is the world’s first eSIM store that helps people connect in over 200+ countries and regions across the globe. We are building the next digital service that revolutionizes the telecom industry. We are a travel-tech company and an equal-opportunity environment that values and executes diversity, inclusion, and equity. Our team is spread across 40+ countries and six continents. What glues us together is our commitment to changing the way you connect<span style=\"font-size: 13.3333px\">. </span></div><div><br></div><div><b>About you</b></div><div>We hope that you care deeply about the quality of your work, the intrinsic worth of tasks, and the success of your team. You are self-disciplined and do not require micromanagement in terms of your skillset and work ethic. You do your best to flourish as an individual every day while working hard to foster a collaborative team environment. You believe in the importance of being — and staying — authentic, honest, positive, and kind. You are a good interlocutor with clear and concise communication. You are able to manage multiple projects, have an analytical mind, pay keen attention to detail, and love to get your hands dirty. You are cognizant, tolerant, and welcoming of vulnerabilities and cultural differences.</div><div><br></div><div><b>About the Role</b></div><div><b>Position</b>: Full-time / Employee</div><div><b>Location:</b>&nbsp;Remote-first </div><div><b>Benefits:</b>&nbsp;Employee Stock Options, Health Insurance, work-from-anywhere stipend, annual wellness &amp; learning credits, annual all-expenses-paid company retreat in a gorgeous destination &amp; other benefits</div><div><br></div><div>We are looking for a Partnerships superstar to join the <b>Airalo Partnerships</b> department. The undisputed industry leader in the B2C segment in the eSIM industry, we are now looking to expand our presence in the B2B2C and B2B space to bring the eSIM revolution to global markets. As the Partnerships Manager for Saudi Arabia, you will lead and oversee various partnerships mainly in Saudi Arabia and support other countries in GCC &amp; Middle East across Airalo’s four key Partnerships streams - Strategic Partnerships, Corporate Sales, Channel Sales and Affiliates.</div><h3>Responsibilities include but are not limited to:</h3><li>Work closely with the Partnerships Director, Arabia &amp; Africa and other team members in the department</li><li>Hire and develop talent in the Strategic partnerships, Corporate Sales and Channel Sales streams to support Airalo’s partnerships initiatives and efforts for Saudi Arabia &amp; GCC countries.</li><li>Find, identify, prospect, and lead negotiations with potential partners across Partnerships streams, specifically Strategic Partnerships, to support Airalo’s market penetration efforts</li><li>Onboard and support new partners as they join the Airalo Partner Community</li><li>Maintain relationships with key partners to drive partner profitability and grow the B2B/B2B2C partnerships’ contribution to the business</li><li>Conduct ongoing competitive analysis in Saudi Arabia &amp; GCC to establish and maintain Airalo’s status as the leading eSIM provider across partner industries</li><li>Collaborate and work with different internal and external stakeholders to develop and execute projects/opportunities</li><li>Identify relevant events and conferences across Saudi Arabia &amp; GCC and represent Airalo as a speaker, delegate, or exhibitor to educate the ecosystem about eSIMs and Airalo</li><li>Own the Airalo Partnerships OKRs in Saudi Arabia.</li><li>As a senior member of Saudi Arabia squad, drive the overall growth strategy for Airalo in Saudi Arabia &amp; GCC</li>,<h3>Must-haves:</h3><li>7+ years of experience in partnerships, sales, account management, or business development in a high-growth B2B and/or B2B2C environment</li><li>Proven expertise across one or more of Airalo’s four Partnerships streams</li><li>Deep understanding of the travel/partnerships ecosystem in GCC &amp; Middle East with a strong, existing network</li><li>Partner-first mentality and a genuine passion to help your stakeholders succeed while creating win-win relationships</li><li>Ability to narrate a good story - Airalo’s unique story and the problem we solve for our users make it a compelling partnership proposition</li><li>Ability to employ sales techniques, including effective questioning, objection handling, consultative selling, and solution selling</li><li>Ability to multi-task in a complex &amp; matrix environment</li><li>Extreme comfort with technology</li><li>Experience with sales and partnerships tools</li><li>Perfect verbal and written communication skills in English and Arabic.</li>,<h3>Good to have:</h3><li>Familiarity with the travel industry</li><li>Prior experience in a travel tech/telco company</li><li>2+ years experience in building and/or leading a team</li><li>Graduate degree in a related field</li><li>Certificates and courses in sales and partnerships</li><div>If you are interested in this position, <b>please apply via the link.</b></div><div><br></div><div><i>We sincerely thank all applicants in advance for submitting their interest in this opportunity with Airalo. </i></div>","tags":"[\"management\",\"B2C\",\"B2B\"]","pubDate":"2024-01-26 08:44:27.462","link":"https://jobs.lever.co/airalo/2ea90ee3-0b9f-4420-8dfa-b623ac1c253e","savedDate":"2024-01-31 10:14:43.144","slug":"partnerships-manager-saudi-arabia-airalo-4251"},{"id":6781423064,"title":"Senior Paid Search Specialist, User Experience","company":"Airalo","image":"https://lever-client-logos.s3.us-west-2.amazonaws.com/55028a36-609c-479c-9553-d4689ff2dd8c-1669620566663.png","description":"<div><b>About Airalo</b></div><div>Alo! Airalo is the world’s first eSIM store that helps people connect in over 200+ countries and regions across the globe. We are building the next digital service that revolutionizes the telecom industry. We are a travel-tech company and an equal-opportunity environment that values and executes diversity, inclusion, and equity. Our team is spread across 40+ countries and six continents. What glues us together is our commitment to changing the way you connect<span style=\"font-size: 13.3333px\">. </span></div><div><br></div><div><b>About you</b></div><div>We hope that you care deeply about the quality of your work, the intrinsic worth of tasks, and the success of your team. You are self-disciplined and do not require micromanagement in terms of your skillset and work ethic. You do your best to flourish as an individual every day while working hard to foster a collaborative team environment. You believe in the importance of being — and staying — authentic, honest, positive, and kind. You are a good interlocutor with clear and concise communication. You are able to manage multiple projects, have an analytical mind, pay keen attention to detail, and love to get your hands dirty. You are cognizant, tolerant, and welcoming of vulnerabilities and cultural differences.</div><div><br></div><div><b>About the Role</b></div><div><b>Position</b>: Full-time / Employee</div><div><b>Location:</b>&nbsp;Remote-first </div><div><b>Benefits:</b>&nbsp;Employee Stock Options, Health Insurance, work-from-anywhere stipend, annual wellness &amp; learning credits, annual all-expenses-paid company retreat in a gorgeous destination &amp; other benefits</div><div><br></div><div>As a <b>Senior Paid Search Specialist, User Experience</b>, you'll steer search strategy, centralize processes, and own growth tools, data, and reporting infrastructure supporting mobile and web search acquisition strategies across diverse regions on paid search channels.</div><div>Reporting to the <b>Growth Director, User Experience</b>, you'll lead an outcome-driven approach to app and web marketing, ensuring our paid acquisition efforts on search platforms are top-notch. With a high bar for quality, you'll emphasize attention to detail and employ experimentation frameworks to set up and optimize campaigns effectively. Support to regional counterparts will be provided through sharing best practices, learnings, and mentorship, fostering a culture of shared learning.</div><h3>Responsibilities include but are not limited to:</h3><li>Developing and executing mobile app and web acquisition campaigns across various search marketing channels.</li><li>Continuously supporting regions in testing and experimenting on acquisition campaigns to drive cost-effective user growth, meeting KPIs such as CAC, ROAS, CPS, CPP, LTV, AOV, and payback periods.</li><li>Owning the data and reporting infrastructure, analyzing user acquisition and engagement data to inform strategy, and being the go-to resource for data-related queries.</li><li>Collaborating cross-functionally with product, engineering, and brand teams to identify levers for improvement and opportunities to enhance ROI.</li><li>Conducting market and competitor research to identify innovation opportunities supporting growth targets.</li><li>Staying up-to-date with industry trends, especially in travel, and best practices in mobile app acquisition.</li>,<h3>Must-haves:</h3><li>7+ years of experience managing mobile app acquisition campaigns at scale in performance-driven, competitive verticals, with deep MarTech/MarOps experience.</li><li>Deep hands-on expertise in Search channels (Google Search, Display, Video, Discovery, Performance Max, etc.).</li><li>Strong analytical skills and MarTech expertise across various analytics and MMP tools (e.g., Google Analytics, Google Tag Manager, Looker, AppsFlyer, Adjust, etc.).</li><li>Experience in the digital advertising and mobile space, managing $MM annual ad budgets and maximizing ROI across channel mixes.</li><li>Fluency in English with impeccable verbal and written communication skills.</li><li>Superior internal and external communication and cross-functional stakeholder management skills.</li><li>Good time management with an eye for perfection and a strong operational background.</li>,<h3>Good to have:</h3><li>Prior experience in the tech, travel, or telecommunications industry.</li><li>Ad platform and analytical platform certifications.</li><li>Working knowledge of other search platforms like Bing, Naver, etc. is a plus.</li><li>Knowledge of eSIM and GSMA-related technologies and services.</li><div>If you are interested in this position, <b>please apply via the link.</b></div><div><br></div><div><i>We sincerely thank all applicants in advance for submitting their interest in this opportunity with Airalo. </i></div>","tags":"[\"management\",\"engineering\"]","pubDate":"2024-01-23 17:51:21.064","link":"https://jobs.lever.co/airalo/6145fd75-09a6-42ed-bbbf-27ae278d16e9","savedDate":"2024-01-31 10:14:43.146","slug":"senior-paid-search-specialist-user-experience-airalo-3615"},{"id":6230242237,"title":"Paid Search Specialist (LATAM)","company":"Airalo","image":"https://lever-client-logos.s3.us-west-2.amazonaws.com/55028a36-609c-479c-9553-d4689ff2dd8c-1669620566663.png","description":"<div><b>About Airalo</b></div><div>Alo! Airalo is the world’s first eSIM store that helps people connect in over 200+ countries and regions across the globe. We are building the next digital service that revolutionizes the telecom industry. We are a travel-tech company and an equal-opportunity environment that values and executes diversity, inclusion, and equity. Our team is spread across 40+ countries and six continents. What glues us together is our commitment to changing the way you connect<span style=\"font-size: 13.3333px\">. </span></div><div><br></div><div><b>About you</b></div><div>We hope that you care deeply about the quality of your work, the intrinsic worth of tasks, and the success of your team. You are self-disciplined and do not require micromanagement in terms of your skillset and work ethic. You do your best to flourish as an individual every day while working hard to foster a collaborative team environment. You believe in the importance of being — and staying — authentic, honest, positive, and kind. You are a good interlocutor with clear and concise communication. You are able to manage multiple projects, have an analytical mind, pay keen attention to detail, and love to get your hands dirty. You are cognizant, tolerant, and welcoming of vulnerabilities and cultural differences.</div><div><br></div><div><b>About the Role</b></div><div><b>Position</b>: Full-time / Employee</div><div><b>Location:</b>&nbsp;Remote-first </div><div><b>Benefits:</b>&nbsp;Employee Stock Options, Health Insurance, work-from-anywhere stipend, annual wellness &amp; learning credits, annual all-expenses-paid company retreat in a gorgeous destination &amp; other benefits</div><div><br></div><div>As a Paid Search Specialist, you will be responsible for guiding the strategy, and then executing our mobile and web search acquisition strategy across multiple markets on paid search channels.</div><div>Reporting to the Senior Growth Manager, LATAM, you will lead an outcome-driven approach to app and web marketing and ensure that our paid acquisition efforts on search platforms are best in class. You will have a high bar for the quality of our search marketing efforts and drive the deep attention to detail needed to ensure our campaigns are set up well and optimized efficiently.</div><h3>Responsibilities include but are not limited to:</h3><li>Developing and executing mobile app acquisition campaigns across a variety of search marketing channels for the Latin American market, including keyword research, campaign structuring, and budget management;</li><li>Continuously testing and experimenting on acquisition campaigns to drive cost-effective user growth. Monitor and optimize paid search campaigns to maximize performance, improve click-through rates, and achieve conversion goals;</li><li>Analyzing user acquisition and engagement data to inform acquisition strategy and decision-making;</li><li>Develop compelling ad copy that resonates with the Latin American audience, considering language preferences and cultural nuances;</li><li>Working cross-functionally with product, engineering, and brand teams to effectively drive paid search marketing strategy and outcomes;</li><li>Conducting market and competitor research to identify new acquisition opportunities;</li><li>Utilize analytics tools to analyze ad performance, generate insights, and make data-driven recommendations for improvement;</li><li>Effectively manage advertising budgets, allocate resources strategically, and provide regular reporting on budget utilization and performance;</li><li>Staying up to date with industry trends, especially in travel and best practices in mobile app acquisition. Stay informed about market trends, competitor activities, and changes in search engine algorithms to adapt strategies accordingly;</li><li>Work closely with cross-functional teams, including marketing, content, and analytics, to align paid search initiatives with overall marketing objectives.</li>,<h3>Must-haves:</h3><li>3+ years of experience in managing mobile app acquisition campaigns at scale in performance-driven competitive verticals such as gaming, tech, travel, etc;</li><li>Hands-on expertise on the Google Ads Stack (Search, Display, Video, Discovery, Performance Max, etc);</li><li>Strong analytical skills and expertise in Analytics and MMP tools (e.g. Google Analytics, AppsFlyer, Adjust, etc);</li><li>Experience working in the digital advertising and mobile space, with experience in performance solutions, competitive landscape, and local markets;</li><li>Fluency in English and Spanish, with impeccable verbal and written communication skills;</li><li>Superior internal &amp; external communication &amp; cross-functional stakeholder management skills;</li><li>Good time management with an eye for perfection &amp; a strong operational background.</li>,<h3>Good to have:</h3><li>Prior experience in the tech, travel, or telecommunications industry;</li><li>Ad platform and Analytical platform certifications;</li><li>Working knowledge of other search platforms like Bing, Naver, etc is a plus;</li><li>Knowledge of eSIM and GSMA-related technologies and services.</li><div><i>We sincerely thank all applicants in advance for submitting their interest in this opportunity with Airalo. </i></div>","tags":"[\"management\",\"engineering\"]","pubDate":"2024-01-22 18:12:02.227","link":"https://jobs.lever.co/airalo/3d8a4d35-6fe2-4d43-9e88-c3ddc1853dcf","savedDate":"2024-01-31 10:14:43.142","slug":"paid-search-specialist-latam-airalo-7698"},{"id":9167512836,"title":"Paid Social Specialist (LATAM)","company":"Airalo","image":"https://lever-client-logos.s3.us-west-2.amazonaws.com/55028a36-609c-479c-9553-d4689ff2dd8c-1669620566663.png","description":"<div><b>About Airalo</b></div><div>Alo! Airalo is the world’s first eSIM store that helps people connect in over 200+ countries and regions across the globe. We are building the next digital service that revolutionizes the telecom industry. We are a travel-tech company and an equal-opportunity environment that values and executes diversity, inclusion, and equity. Our team is spread across 40+ countries and six continents. What glues us together is our commitment to changing the way you connect<span style=\"font-size: 13.3333px\">. </span></div><div><br></div><div><b>About you</b></div><div>We hope that you care deeply about the quality of your work, the intrinsic worth of tasks, and the success of your team. You are self-disciplined and do not require micromanagement in terms of your skillset and work ethic. You do your best to flourish as an individual every day while working hard to foster a collaborative team environment. You believe in the importance of being — and staying — authentic, honest, positive, and kind. You are a good interlocutor with clear and concise communication. You are able to manage multiple projects, have an analytical mind, pay keen attention to detail, and love to get your hands dirty. You are cognizant, tolerant, and welcoming of vulnerabilities and cultural differences.</div><div><br></div><div><b>About the Role</b></div><div><b>Position</b>: Full-time / Employee</div><div><b>Location:</b>&nbsp;Remote-first </div><div><b>Benefits:</b>&nbsp;Employee Stock Options, Health Insurance, work-from-anywhere stipend, annual wellness &amp; learning credits, annual all-expenses-paid company retreat in a gorgeous destination &amp; other benefits</div><div><br></div><div>As a Paid Social Specialist (LATAM), you will be responsible for guiding the strategy and development, and then executing our mobile app acquisition strategy across multiple markets on paid social channels.</div><div>Reporting to the Senior Growth Manager LATAM, you will lead an outcome-driven approach to app marketing and ensure that our paid acquisition efforts on social platforms are best in class. You will have a high bar for the quality of our paid social marketing efforts and drive the deep attention to detail needed to ensure our campaigns are set up well and optimized efficiently.</div><h3>Responsibilities include but are not limited to:</h3><li>Developing and executing mobile app acquisition campaigns across a variety of social marketing channels;</li><li>Design and create visually appealing and culturally relevant ad campaigns that resonate with the Latin American audience, considering preferences and regional nuances;</li><li>Continuously testing and experimenting on acquisition campaigns to drive cost-effective user growth;</li><li>Analyzing user acquisition and engagement data to inform acquisition strategy and decision-making;</li><li>Utilize advanced targeting options on social media platforms to reach specific demographics, interests, and behaviors in the Latin American market;</li><li>Effectively manage advertising budgets, allocate resources strategically, and provide regular reporting on budget utilization and campaign performance;</li><li>Continuously optimize ad copy and creative elements to improve engagement, click-through rates, and overall campaign performance;</li><li>Working cross-functionally with product, engineering, and brand/creative teams to effectively drive paid social marketing strategy and outcomes;</li><li>Conducting market and competitor research to identify new acquisition opportunities;</li><li>Utilize analytics tools to analyze ad performance, generate insights, and make data-driven recommendations for improvement;</li><li>Staying up to date with industry trends, especially in travel, and best practices in mobile app acquisition, algorithm changes, and competitor activities to adapt strategies accordingly.</li>,<h3>Must-haves:</h3><li>3+ years of experience in managing mobile app acquisition campaigns at scale in performance-driven competitive verticals such as gaming, tech, travel, etc;</li><li>Hands-on expertise on the Facebook ads stack (including Instagram) and TikTok ads stack. Well-versed with performance levers - audience, targeting, messaging, measurement, creative, budgeting, and bidding;</li><li>Strong analytical skills and expertise in Analytics and MMP tools (e.g. Google Analytics, AppsFlyer, Adjust, etc.);</li><li>Experience working in the digital advertising and mobile space, with experience in performance solutions, competitive landscape, and local markets;</li><li>Strong creative skills with the ability to develop visually appealing and engaging ad content that aligns with the brand and resonates with the target audience;</li><li>Fluency in Spanish and English, with impeccable verbal and written communication skills;</li><li>Superior internal &amp; external communication &amp; cross-functional stakeholder management skills;</li><li>Strong analytical skills to interpret social media analytics, identify trends, and make strategic decisions to enhance campaign performance;</li><li>Understanding of Latin American consumer behavior and the ability to tailor ad campaigns to specific audience segments;</li><li>Good time management with an eye for perfection &amp; a strong operational background.</li>,<h3>Good to have:</h3><li>Ad platform and Analytical platform certifications;</li><li>Working knowledge of other social media platforms like Twitter, LinkedIn, etc;</li><li>Prior experience in the tech, travel, or telecommunications industry;</li><li>Knowledge of eSIM and GSMA-related technologies and services;</li><li>Experience in coordinating paid social efforts with other digital marketing channels for integrated campaigns.</li><div><i>We sincerely thank all applicants in advance for submitting their interest in this opportunity with Airalo. </i></div>","tags":"[\"management\",\"engineering\"]","pubDate":"2024-01-22 17:44:43.102","link":"https://jobs.lever.co/airalo/e49b1c6a-59ce-47f6-b323-1dd64871a3ff","savedDate":"2024-01-31 10:14:43.142","slug":"paid-social-specialist-latam-airalo-2363"},{"id":7400937466,"title":"Content Manager (LATAM)","company":"Airalo","image":"https://lever-client-logos.s3.us-west-2.amazonaws.com/55028a36-609c-479c-9553-d4689ff2dd8c-1669620566663.png","description":"<div><b>About Airalo</b></div><div>Alo! Airalo is the world’s first eSIM store that helps people connect in over 200+ countries and regions across the globe. We are building the next digital service that revolutionizes the telecom industry. We are a travel-tech company and an equal-opportunity environment that values and executes diversity, inclusion, and equity. Our team is spread across 40+ countries and six continents. What glues us together is our commitment to changing the way you connect<span style=\"font-size: 13.3333px\">. </span></div><div><br></div><div><b>About you</b></div><div>We hope that you care deeply about the quality of your work, the intrinsic worth of tasks, and the success of your team. You are self-disciplined and do not require micromanagement in terms of your skillset and work ethic. You do your best to flourish as an individual every day while working hard to foster a collaborative team environment. You believe in the importance of being — and staying — authentic, honest, positive, and kind. You are a good interlocutor with clear and concise communication. You are able to manage multiple projects, have an analytical mind, pay keen attention to detail, and love to get your hands dirty. You are cognizant, tolerant, and welcoming of vulnerabilities and cultural differences.</div><div><br></div><div><b>About the Role</b></div><div><b>Position</b>: Full-time / Employee</div><div><b>Location:</b>&nbsp;Remote-first </div><div><b>Benefits:</b>&nbsp;Employee Stock Options, Health Insurance, work-from-anywhere stipend, annual wellness &amp; learning credits, annual all-expenses-paid company retreat in a gorgeous destination &amp; other benefits</div><div><br></div><div>As a Content Manager, LATAM at Airalo, you will work closely with the rest of the User Experience, Brand, and Regional divisions to apply the best practices around blog content, social content, SEO, and ASO. The role will be responsible for developing and monitoring different content channels using analytic tracking tools and performing strategies to identify opportunities where Airalo can increase brand awareness and conversion rates and improve organic visibility in those channels.</div><div>You will be owning and leading the entire content processes for the assigned LATAM countries from the creative stage to running all tests and reporting on results to stakeholders.</div><h3>Responsibilities include but are not limited to:</h3><li>Working directly with the Senior Growth Manager LATAM developing content strategies aligned with Airalo's short-term and long-term country targets in all Latin American countries, considering cultural nuances, language preferences, and regional trends;</li><li>Developing an editorial calendar together with the rest of your Global team members;</li><li>Collaborating with Airalo Growth divisions to create and publish compelling and high-quality content for various platforms, including app interfaces, social media, blogs, and other marketing channels, including modifying styles and layouts;</li><li>Creating and publishing engaging content for the assigned country or countries in the region. Oversee the localization of content, ensuring accurate translation and adaptation to meet the linguistic and cultural preferences of the target audience;</li><li>Optimizing or coordinating the optimization of content according to SEO and ASO best practices for the assigned country/language;</li><li>Using content management systems to analyze website traffic and user engagement metrics;</li><li>Managing content distribution to online channels and social media platforms with the rest of the Social Media team members to increase traffic;</li><li>Work closely with cross-functional teams, including marketing, design, and product development, to align content initiatives with overall business objectives;</li><li>Implement strategies to enhance user engagement, including the creation of interactive and user-friendly content that resonates with the Latin American audience;</li><li>Ensuring compliance with local laws (e.g., copyright and data protection);</li><li>Staying up-to-date with developments and generating new ideas, including the use of multimedia to produce rich content.</li>,<h3>Must-haves:</h3><li>Bachelor’s degree &amp; 3+ years of proven Content, SEO, and ASO achievement with a large B2C and B2B2C audience;</li><li>Excellent understanding of SEO and ASO channel management and best practices;</li><li>Strong understanding of web/mobile app campaign measurement and attribution;</li><li>A strong understanding of keyword research with excellent analytical skills;</li><li>Excellent understanding of ASO best practices, as well as knowledge of app store algorithms, optimization methods, and effective strategies for growing app installs;</li><li>Experience in writing app descriptions and titles using researched keywords;</li><li>An analytical mind with the ability to spot patterns and trends using the latest app analytics tools;</li><li>Experience in creating multimedia content, including blog, podcast, social, and video production;</li><li>Experience with analytics tools and/or other market research tools, e.g. SEMrush, Ahrefs;</li><li>Deep understanding of Latin American cultures, consumer behavior, and market trends;</li><li>Fluency in Spanish and English, with impeccable verbal and written communication skills.</li>,<h3>Good to have:</h3><li>Understanding of UX copywriting and technical content;</li><li>Ability to assess campaign performance, identify consumer behavior and creative opportunities, and manage cost-per-acquisition targets;</li><li>Experience working on international brands;</li><li>Experience working on cross-functional teams in an agile environment;</li><li>Experience in the travel industry;</li><li>Knowledge of eSIM and GSMA-related technologies and services;</li><li>Journalistic background.</li><div><i>We sincerely thank all applicants in advance for submitting their interest in this opportunity with Airalo. </i></div>","tags":"[\"management\",\"B2C\",\"B2B\",\"aws\"]","pubDate":"2024-01-22 17:28:36.646","link":"https://jobs.lever.co/airalo/a7d6186b-9d2b-4370-b740-00132ee14919","savedDate":"2024-01-31 10:14:43.140","slug":"content-manager-latam-airalo-4962"}]