[{"id":1840053981,"title":"CEO/Managing Director","company":"Ruby Labs","image":"https://media.licdn.com/dms/image/v2/D4D0BAQF7VVv61POIFw/company-logo_200_200/company-logo_200_200/0/1721937953426?e=1743033600&v=beta&t=_qAkZ_qGO7Du2NSUdHDNbUKIbz28Y1HDm1g9mwNIOnk","description":"<h1><strong>Role </strong></h1><p style=\"min-height:1.5em\">We are launching an innovative online gambling operator focused on the MENA region and are seeking a Managing Director to oversee day-to-day operations, execution, and the development of a world-class team. This platform aims to deliver exceptional gaming experiences with a focus on customer engagement and satisfaction. You will be responsible for driving operational excellence, guiding strategic initiatives, and ensuring the platform achieves its growth and revenue objectives.</p><p style=\"min-height:1.5em\"></p><p style=\"min-height:1.5em\"><strong>Profit Share</strong></p><p style=\"min-height:1.5em\">This role comes with the profit share incentive and stock option that is quite generous for this role, more details would be shared at the interview.</p><p style=\"min-height:1.5em\"></p><p style=\"min-height:1.5em\"><strong>The team</strong></p><p style=\"min-height:1.5em\">You will be building a strong team with high talent density who enjoy working in our fast-paced, 100% remote environment.</p><p style=\"min-height:1.5em\"></p><p style=\"min-height:1.5em\"><strong>Employment</strong></p><p style=\"min-height:1.5em\">We offer an <a target=\"_blank\" rel=\"noopener noreferrer nofollow\" href=\"https://docs.google.com/document/d/1dHF4ctKlez75whdn-ybUwP5d5Wr0BdwVrorrm_fM40Q/preview\"><u>Independent Contractor Agreement </u></a>for this position.</p><p style=\"min-height:1.5em\"></p><p style=\"min-height:1.5em\"><strong>About you</strong></p><p style=\"min-height:1.5em\">You are a dynamic and hands-on leader with substantial experience in direct-to-consumer products, ideally within the gambling or related industries (gaming, social casino, sweepstakes or similar). You excel at driving growth and innovation, with a comprehensive understanding of product development, marketing, and strategic growth initiatives. In this role, you will be at the helm, leading all departments with a focus on executing strategic projects and optimizing performance across the organization. Your ability to learn quickly and acquire expertise in the gambling niche will be crucial, as is your proven aptitude for managing teams, delivering results under pressure, and engaging deeply in both the technical and operational facets of the business. These qualities make you the ideal candidate to guide our company toward sustained success.</p><p style=\"min-height:1.5em\"></p><p style=\"min-height:1.5em\"><strong>What you’ll do</strong></p><ul style=\"min-height:1.5em\"><li><p style=\"min-height:1.5em\">Lead the company's strategic growth by developing and executing initiatives that drive business expansion, optimize market positioning, and advance overall progress.</p></li><li><p style=\"min-height:1.5em\">Lead cross-functional teams in executing complex strategic initiatives, ensuring alignment across engineering, product development, growth, marketing, and sales.</p></li><li><p style=\"min-height:1.5em\">Drive revenue growth and profitability while optimizing operational expenses.</p></li><li><p style=\"min-height:1.5em\">Oversee the product development lifecycle, ensuring products meet market needs and quality standards.</p></li><li><p style=\"min-height:1.5em\">Collaborate closely with engineering teams to deliver innovative solutions that align with customer expectations and business goals.</p></li><li><p style=\"min-height:1.5em\">Demonstrate a solid understanding of engineering concepts, including current trends such as artificial intelligence (AI), and best practices like modern code patterns and DevOps practices.</p></li><li><p style=\"min-height:1.5em\">Ensure that the product roadmap is aligned with business strategy and customer feedback.</p></li><li><p style=\"min-height:1.5em\">Oversee marketing campaigns, ensuring they are data-driven, customer-centric, and aligned with product launches and sales strategies.</p></li><li><p style=\"min-height:1.5em\">Utilize data analytics to refine and optimize growth strategies, ensuring sustainable revenue growth.</p></li><li><p style=\"min-height:1.5em\">Continuously monitor and analyze key financial and operational metrics, such as revenue growth, EBITDA margins, and customer acquisition costs (CAC).</p></li><li><p style=\"min-height:1.5em\">Evaluate customer lifetime value (LTV) and return on ad spend (ROAS) to optimize marketing efficiency and resource allocation.</p></li><li><p style=\"min-height:1.5em\">Track onboarding conversion rates to identify areas for improvement in user experience and increase customer activation and analyze average revenue per user (ARPU) and user retention rates to inform product development and enhance long-term profitability.</p></li><li><p style=\"min-height:1.5em\">Conduct thorough research on market features and competitors to inform strategic decisions and maintain competitive advantage.</p></li><li><p style=\"min-height:1.5em\">Demonstrate the ability to learn quickly and acquire essential knowledge in the gambling niche to support informed decision-making and drive business success.</p></li></ul><p style=\"min-height:1.5em\"></p><p style=\"min-height:1.5em\"><strong>What we offer</strong></p><ul style=\"min-height:1.5em\"><li><p style=\"min-height:1.5em\"><strong>Remote Work Environment:</strong> Embrace the freedom of working from anywhere, anytime, fostering a better work-life balance.</p></li><li><p style=\"min-height:1.5em\"><strong>Structured PTO:</strong> Experience the advantage of 28 days of paid time off, coupled with extra days for paid sick leave, fostering personal well-being and ensuring optimal work rejuvenation.</p></li><li><p style=\"min-height:1.5em\"><strong>Stock options:</strong> We acknowledge the commitment required for the COO role. Hence, we offer generous company stock options and revenue sharing to appreciate and reward your hard work.</p></li><li><p style=\"min-height:1.5em\"><strong>Company-provided MacBook:</strong> We offer employees access to powerful MacBooks if needed, ensuring top-notch performance, energy efficiency, and seamless productivity.</p></li></ul><p style=\"min-height:1.5em\"></p><p style=\"min-height:1.5em\"><strong>Life at Winlux</strong></p><p style=\"min-height:1.5em\">By joining Winlux, you’ll become part of a collaborative team that supports one another and thrives on innovation. We work hard, fast, and smart, driven by a shared passion to lead the industry. Our commitment to pushing boundaries and delivering exceptional gaming experiences is at the heart of what we do, impacting thousands of gaming enthusiasts and setting new standards in online entertainment.</p><p style=\"min-height:1.5em\"></p><p style=\"min-height:1.5em\"><strong>Equality</strong></p><p style=\"min-height:1.5em\">All qualified applicants will receive consideration for employment without regard to sex, gender identity, sexual orientation, race, color, religion, national origin, disability, protected Veteran status, age, or any other characteristic protected by law.</p><p style=\"min-height:1.5em\"></p><p style=\"min-height:1.5em\">#LI-Remote</p>","tags":"[\"engineering\"]","pubDate":"2024-12-27T09:01:26.268Z","link":"https://jobs.ashbyhq.com/ruby-labs/ccd56ac2-d775-4e1e-a35c-77452977bca4","slug":"ceo-managing-director-ruby-labs-7490"},{"id":8421335172,"title":"Senior Growth Product Manager | Hint","company":"Ruby Labs","image":"https://media.licdn.com/dms/image/v2/D4D0BAQF7VVv61POIFw/company-logo_200_200/company-logo_200_200/0/1721937953426?e=1743033600&v=beta&t=_qAkZ_qGO7Du2NSUdHDNbUKIbz28Y1HDm1g9mwNIOnk","description":"<h1><strong>About us</strong></h1><p style=\"min-height:1.5em\">At Hint, we revolutionize the way people engage with astrology by combining cutting-edge NASA data with personalized guidance from professional astrologers. Our app offers hyper-personalized insights, 1-on-1 consultations, and detailed astrological charts, helping users navigate their lives with greater awareness and confidence. We are committed to delivering a fun and friendly user experience while empowering our community to lead happier and healthier lives. Join us and be a part of the future of digital astrology.</p><p style=\"min-height:1.5em\"></p><h1><strong>About the role</strong></h1><p style=\"min-height:1.5em\">We at Hint are looking for a highly experienced and specialized Senior Growth Product Manager to join our team. Hint is a web astrology app, operating as a web-to-web business. The primary focus of this role is to drive top-of-funnel growth through optimizing our web quizzes, leading to user registration and payment. This role requires direct experience in managing and improving web funnels in a B2C environment.</p><p style=\"min-height:1.5em\"></p><h1><strong>Key Responsibilities</strong></h1><ul style=\"min-height:1.5em\"><li><p style=\"min-height:1.5em\"><strong>Funnel Optimization:</strong> Define and implement hypotheses to improve the conversion rate (CR) to purchase and lifetime value (LTV) within the web funnel.</p></li><li><p style=\"min-height:1.5em\"><strong>Data-Driven Strategy:</strong> Dive deep into data on the competitive environment and user behavior to propose strategies that drive customer acquisition efficiency and improve ROAS.</p></li><li><p style=\"min-height:1.5em\"><strong>Testing Roadmap:</strong> Run a robust testing roadmap, driving continuous improvement in the web funnel. You will ensure that strict quarterly KPIs are met and exceeded.</p></li><li><p style=\"min-height:1.5em\"><strong>Cross-Functional Collaboration:</strong> Collaborate closely with designers, developers, and other key stakeholders to seamlessly execute optimization strategies, from product requirement documents to execution.</p></li><li><p style=\"min-height:1.5em\"><strong>Agile Ceremonies:</strong> Assist Engineering team in leading agile software development ceremonies, including daily standups, grooming, planning, and retrospectives.</p></li><li><p style=\"min-height:1.5em\"><strong>Ownership of Results:</strong> Lead the entire growth process, taking full responsibility for results, from hypothesis creation to final implementation and evaluation.</p></li><li><p style=\"min-height:1.5em\"><strong>UA Collaboration:</strong> Work hand-in-hand with the User Acquisition (UA) team to build and optimize the full flow, ensuring that every step, from the first user interaction through registration and payment, is optimized for growth.</p></li><li><p style=\"min-height:1.5em\"><strong>User Pain Points:</strong> Deeply understand user pain points and behaviors, leveraging this understanding to determine the most effective strategies for selling our product.</p></li></ul><p style=\"min-height:1.5em\"></p><h1><strong>Qualifications</strong></h1><ul style=\"min-height:1.5em\"><li><p style=\"min-height:1.5em\">Proven experience with <strong>web funnel optimization</strong> in a B2C environment.</p></li><li><p style=\"min-height:1.5em\">4+ years of growth product management experience, specializing in B2C subscription models.</p></li><li><p style=\"min-height:1.5em\">Ability to define, run, and analyze <strong>A/B tests</strong> specifically for web-based funnels.</p></li><li><p style=\"min-height:1.5em\">Experience leading growth initiatives with a focus on <strong>improving CR, LTV,</strong> and other performance metrics.</p></li><li><p style=\"min-height:1.5em\">Strong collaboration skills to work effectively with <strong>cross-functional teams</strong> including designers, developers, and data science teams.</p></li><li><p style=\"min-height:1.5em\">Ability to manage multiple growth initiatives and meet strict <strong>quarterly KPIs</strong>.</p></li><li><p style=\"min-height:1.5em\">Strong problem-solving skills with a <strong>user-first mindset</strong>, aiming to understand pain points and optimize user experience.</p></li><li><p style=\"min-height:1.5em\">Experience in building and executing <strong>strategic roadmaps</strong> for growth testing.</p></li><li><p style=\"min-height:1.5em\">Familiarity with leading <strong>agile software development</strong> ceremonies is a plus.</p></li></ul><p style=\"min-height:1.5em\"></p><h1><strong>Location</strong></h1><p style=\"min-height:1.5em\">Hint operates within the CET (Central European Time) zone. Applicants from any country are welcome to apply for the position as long as they are located within approximately ± 4 hours of CET. This ensures optimal collaboration and communication during working hours.</p><p style=\"min-height:1.5em\"></p><h1><strong>Benefits</strong></h1><p style=\"min-height:1.5em\">Discover the perks of being part of our vibrant team! We offer:</p><ul style=\"min-height:1.5em\"><li><p style=\"min-height:1.5em\"><strong>Remote Work Environment:</strong> Embrace the freedom to work from anywhere, anytime, promoting a healthy work-life balance. 🏡⏰</p></li><li><p style=\"min-height:1.5em\"><strong>Unlimited PTO:</strong> Enjoy unlimited paid time off to recharge and prioritize your well-being, without counting days. 🌴💼</p></li><li><p style=\"min-height:1.5em\"><strong>Paid National Holidays:</strong> Celebrate and relax on national holidays with paid time off to unwind and recharge. 🎉🌟</p></li><li><p style=\"min-height:1.5em\"><strong>Company-provided MacBook:</strong> Experience seamless productivity with top-notch Apple MacBooks provided to all employees who need them. 💻🚀</p></li><li><p style=\"min-height:1.5em\"><strong>Flexible Independent Contractor Agreement:</strong> Unlock the benefits of flexibility, autonomy, and entrepreneurial opportunities. Benefit from tax advantages, networking opportunities, reduced employment obligations, and the freedom to work from anywhere. Read more about it here: <a target=\"_blank\" rel=\"noopener noreferrer nofollow\" href=\"https://docs.google.com/document/d/1dHF4ctKlez75whdn-ybUwP5d5Wr0BdwVrorrm_fM40Q/preview\">https://docs.google.com/document/d/1dHF4ctKlez75whdn-ybUwP5d5Wr0BdwVrorrm_fM40Q/preview</a> 📈💼</p></li></ul><p style=\"min-height:1.5em\">Be part of our fast-growing team and seize this excellent opportunity for personal and professional growth!</p><p style=\"min-height:1.5em\"></p><h1><strong>Interview Process</strong></h1><p style=\"min-height:1.5em\">After submitting your application, we conduct a thorough review which typically takes 3 to 5 days, but may occasionally take longer due to the volume of applications received. If we see a potential fit, we proceed with the following steps:</p><ul style=\"min-height:1.5em\"><li><p style=\"min-height:1.5em\">Recruiter Screening (40 minutes)</p></li><li><p style=\"min-height:1.5em\">Technical Interview (60 minutes)</p></li><li><p style=\"min-height:1.5em\">Final Interview (60 minutes)</p></li></ul><p style=\"min-height:1.5em\"></p><h1><strong>Life at Hint</strong></h1><p style=\"min-height:1.5em\">By joining Hint, you’ll become part of a team that picks each other up, collaborates daily, and works hard, fast, and intelligently because they’re motivated and passionate about being the best in the industry. We thrive on innovation, push the boundaries, and are proud of our work!</p><p style=\"min-height:1.5em\">At Hint, we foster a culture of creativity and continuous learning, where everyone's ideas are valued. We believe in maintaining a healthy work-life balance, supporting each other's growth, and celebrating our successes together.</p><p style=\"min-height:1.5em\"></p><p style=\"min-height:1.5em\">#Li-Remote</p>","tags":"[\"management\",\"engineering\",\"B2C\"]","pubDate":"2024-12-27T07:50:46.289Z","link":"https://jobs.ashbyhq.com/ruby-labs/8f530bff-e115-4986-9b06-b84760fba343","slug":"senior-growth-product-manager-hint-ruby-labs-7946"},{"id":7961813432,"title":"Senior Platform Engineer","company":"Wealthwizards","image":"https://remotive.com/job/1959423/logo","description":"<div><!--block--><em>** Please note that any applications submitted for this role will not be reviewed until January 2025**<br></em><br>At Wealth Wizards our vision is a future where everybody in society has access to affordable financial advice and guidance. Our Software as a Service (SaaS) platform provides engaging digital experiences for consumers and powerful tools for financial advisers.<br><br>We are a true Fintech with a strong engineering culture and focus on innovation and agile methodology.<br><br>We welcome individuals from all walks of life and strive to build a culture where all voices are heard, differences are embraced, and everyone has equal access to opportunities. We encourage applications from individuals of all races, ethnicities, genders, sexual orientations, ages, abilities, and backgrounds.</div><div><!--block--><br>If you require any reasonable adjustments to be made during the application or interview process, please let us know, and we will be happy to help.</div><br><br><div class=\"h3\">Responsibilities</div><div><!--block--><strong>What you'll be doing...</strong></div><ul style=\"\"><li style=\"\"><!--block-->Assist in designing and maintaining a robust, scalable platform infrastructure that supports seamless application performance and growth.</li><li style=\"\"><!--block-->Implement security controls and compliance measures within the platform, ensuring alignment with industry best practices and regulatory requirements.</li><li style=\"\"><!--block-->Troubleshoot and resolve platform-related issues, conducting root cause analysis and contributing to long-term platform enhancements based on identified improvements.</li><li style=\"\"><!--block-->Develop and optimise CI/CD pipelines to automate and streamline software delivery, testing, and deployment processes across environments.</li><li style=\"\"><!--block-->Participate in code reviews to maintain high-quality standards and share best practices across the team.</li><li style=\"\"><!--block-->Document platform architecture, configurations, and processes thoroughly, and collaborate with team members to ensure knowledge continuity and ease of troubleshooting.</li><li style=\"\"><!--block-->Implement and maintain monitoring solutions to track system performance, proactively identify bottlenecks, and optimise resource usage for improved reliability.</li><li style=\"\"><!--block-->Adhere to all Information Security policies and procedures</li></ul><br><br><div class=\"h3\">About you</div><div><!--block--><strong>Your skills<br><br></strong>When it comes to skills and experience, the ideal candidate would have:</div><ul style=\"\"><li style=\"\"><!--block-->Extensive experience with key technologies, including Linux, containers (e.g., Docker, Kubernetes, EKS), AWS, Terraform and IaC.</li><li style=\"\"><!--block-->Skilled in automating repetitive tasks using scripting languages to improve efficiency and consistency.</li><li style=\"\"><!--block-->High attention to detail and commitment to accuracy in configurations, documentation, and deployment processes.</li><li style=\"\"><!--block-->Able to manage time and prioritise tasks effectively, balancing project work with day-to-day operational responsibilities.</li><li style=\"\"><!--block-->Able to clearly communicate technical concepts and updates with team members and stakeholders at various technical levels.</li><li style=\"\"><!--block-->A passion for technology and a proactive approach to staying updated on industry trends and emerging practices.</li></ul><div><!--block--><br><strong>Your experience</strong></div><ul style=\"\"><li style=\"\"><!--block-->Proven experience in service delivery and monitoring in a commercial environment, with a focus on proactive maintenance and performance optimisation.</li><li style=\"\"><!--block-->Experience working within Agile teams, participating actively in sprints and team-based collaboration.</li><li style=\"\"><!--block-->Hands-on experience with Docker and Kubernetes for containerisation and orchestration, including deploying and managing containerised applications.</li><li style=\"\"><!--block-->Demonstrated experience in AWS for deploying, managing, and optimising cloud infrastructure and services.</li><li style=\"\"><!--block-->Practical experience in setting up and managing CI/CD pipelines, enabling automated software deployment and testing.</li><li style=\"\"><!--block-->Applied knowledge of security best practices, with experience implementing secure, compliant infrastructure solutions.</li><li style=\"\"><!--block-->Evidence of professional development e.g. achieving AWS certifications.</li><li style=\"\"><!--block-->Experience of mentoring junior/mid-level platform engineers.</li></ul><div><!--block--><br>This position is ideal for a skilled and detail-oriented engineer who can support the platform's reliability, security, and scalability, working closely within the platform engineering team under the guidance of the Platform Engineering Team Lead. <br><br>The Senior Platform Engineer will play an essential role in enhancing Wealth Wizards’ infrastructure, ensuring efficiency and resilience in all aspects of platform operations.</div><div><!--block--><br><br><strong>Characteristics</strong></div><ul style=\"\"><li style=\"\"><!--block--><strong>Pioneering </strong>| Driven and passionate about software engineering excellence. Self-motivated and enthusiastic team player. Proactive, innovative, resilient and energetic.</li><li style=\"\"><!--block--><strong>Expert </strong>| Constantly seeking new learning/ self-development opportunities. Ability to represent Wealth Wizards at all times.</li><li style=\"\"><!--block--><strong>Accessible</strong> | Adaptable and enjoys a challenge. Builds strong collaborative relationships. Flexibility to work in a fast-moving business which is developing rapidly.</li><li style=\"\"><!--block--><strong>Reliable </strong>| Total trustworthiness essential. Conscientious and tenacious. Highly organised, methodical, meticulous and disciplined.</li><li style=\"\"><!--block--><strong>Hungry </strong>| Always looking for ways to improve the way we develop software and how we work as teams. Active in open-source communities, industry meetups or publication of blog posts. Acts as an advocate for new and emerging technology within our business.</li></ul><div><!--block--><br>Not sure if you tick every box? Don’t worry. If you think you have most of what we’re looking for, go ahead and apply. We’d love to hear from you.</div><br><br><div class=\"h3\">Our perks</div><ul style=\"\"><li style=\"\"><!--block-->Flexible working</li><li style=\"\"><!--block-->We prioritise a sustainable work/life balance</li><li style=\"\"><!--block-->We have a collaborative learning culture that promotes psychological safety</li><li style=\"\"><!--block-->25 days annual leave plus every bank holiday</li><li style=\"\"><!--block-->Company pension (up to 10% employer contribution)</li><li style=\"\"><!--block-->Company performance based Bonus scheme</li><li style=\"\"><!--block-->Paid day off to celebrate your birthday</li><li style=\"\"><!--block-->Additional holiday purchase (up to 5 days per year)</li><li style=\"\"><!--block-->Additional holidays for length of service (up to 3 days)</li><li style=\"\"><!--block-->Private medical insurance</li><li style=\"\"><!--block-->Dental and health cash plans</li><li style=\"\"><!--block-->Enhanced parental leave and pay</li><li style=\"\"><!--block-->Discounts on gym membership and health screening</li><li style=\"\"><!--block-->Employee assistance programme</li><li style=\"\"><!--block-->Life assurance of 4x basic salary</li><li style=\"\"><!--block-->£500 pension advice per year</li><li style=\"\"><!--block-->6 paid days per year for self development</li><li style=\"\"><!--block-->Individual training budget per year</li><li style=\"\"><!--block-->Professional memberships funded</li><li style=\"\"><!--block-->Salary sacrifice car scheme</li><li style=\"\"><!--block-->Cycle, Home &amp; Tech scheme</li></ul><div><!--block--><em>** Please note that any applications submitted for this role will not be reviewed until January 2025**</em></div><img src=\"https://remotive.com/job/track/1959423/blank.gif?source=public_api\" alt=\"\"/>","tags":"[\"AWS\",\"docker\",\"kubernetes\",\"terraform\"]","pubDate":"2024-12-25T19:50:12.000Z","link":"https://remotive.com/remote-jobs/devops/senior-platform-engineer-1959423","slug":"senior-platform-engineer-wealthwizards-7987"},{"id":9851553023,"title":"Operations Administrative Assistant","company":"Blue Coding","image":"https://media.licdn.com/dms/image/C4D0BAQHlK67hgnhzQw/company-logo_200_200/0/1631346154820?e=2147483647&v=beta&t=_R2Ssj7L_f4xqmSCcq0nOLCyCz0QN2lFnHssxxhj3YY","description":"<div><span style=\"font-size: 24px;\">Hi, you finally found us!&nbsp;</span></div><div><br></div><div><span style=\"font-size: 24px;\">Why work at Blue Coding?&nbsp;</span></div><div><br></div><div><span style=\"font-size: 16px;\">At Blue Coding we specialize in hiring excellent developers and amazing people from all over Latin America and other parts of the world. For the past 10 years, we’ve helped cutting-edge companies in the United States and Canada -both large and small, build great development teams and develop great products. Online shops, digital agencies, SaaS providers, and software consulting firms are a few of our clients. Our team of over 100 engineers is distributed in more than 10 countries across the Americas. We are a fully remote company working with a wide array of technologies and have expertise in every stage of the software development process.&nbsp;&nbsp;</span></div><div><br></div><div><span style=\"font-size: 16px;\">Our team is highly connected, united, and culturally diverse, and our collaborators are involved in many initiatives around the world, from wildlife preservation to volunteering at local charities. We also participate in group activities like movie nights, trivia, and meme competitions. We stand for honesty, fairness, respect, efficiency, hard work, and cooperation.</span></div><div><br></div><div><span style=\"font-size: 16px;\">We are looking for an </span><b style=\"font-size: 16px;\">Operations Administrative Assistant </b><span style=\"font-size: 16px;\">who can provide support to the Operations Department. The focus of the Department is maintaining ongoing client and contractor relationships, growing existing accounts to expand our book of business and grow revenue, and ensuring smooth collaboration and communication across all departments to improve operational efficiency.</span></div><h3>Responsabilities</h3><li>Provide support to the Operations Department by maintaining CRM systems, client contract data, and internal records.</li><li>Assist in managing contracts and documentation, ensuring that all information is up to date and accurately reflected in internal systems. </li><li>Answer frequently asked questions related to invoicing, payment processes, PTO, contracts, and other administrative tasks.</li><li>Support the Operations team with additional administrative tasks, including data entry, scheduling, and report generation.</li><li>Support the People &amp; Culture team by assisting with administrative tasks related to client services, including documentation, contractor agreements, and internal processes.</li>,<h3>You will shine if you have these skills:</h3><li><b>Organizational Skills</b>: Experience managing large volumes of data and ensuring accurate record-keeping.</li><li><b>Communication &amp; Client Support:</b> Ability to respond to client and internal inquiries in a timely and professional manner. This person is expected to be fluent in English.</li><li><b>CRM &amp; Data Management:</b> Proficiency in maintaining CRM systems and managing contract data.</li><li><b>Process Management:</b> Ability to follow standard operating procedures and assist in streamlining administrative processes.</li><li><b>Google Workspace</b>: Proficiency in Google products like Drive, Docs, Spreadsheets, Meets, etc.</li>,<h3>Here are some of the perks we offer you:</h3><li>Work from anywhere.</li><li>You'll have 14 days of paid vacation per year.</li><li>We will cover your national holidays.</li>","tags":"[\"management\"]","pubDate":"2024-12-04T19:17:03.972Z","link":"https://jobs.lever.co/bluecoding/dda22ca2-37f6-46ca-8cd4-aad24734c72e","slug":"operations-administrative-assistant-blue-coding-3586"}]