[{"id":6042288849,"title":"Graduate Customer Success Manager","company":"Canonical","image":"https://pbs.twimg.com/profile_images/1673959375340290050/x7pNtXQ7_400x400.jpg","description":"\n      <p><strong>The role of a Graduate Customer Success Manager at Canonical</strong></p>\n<p>Customer success is a new and strategic department at Canonical, with a clear objective to reduce risk and churn, facilitate the adoption of new products or services and support expansion within existing accounts. Customer Success Managers (CSM)&nbsp; are responsible for developing trust with their assigned customers and committing to providing them with the best possible experience navigating Canonical's vast offering. Through a clear understanding of their customer’s objectives, the CSM can activate a large range of internal and external capabilities to alleviate any pain point, align expectations, as well as help draw and deliver on an appropriate&nbsp; collaboration roadmap.&nbsp;</p>\n<p>We are growing our Customer Success team to continue to offer thoughtful, smart, precise interactions across all our product portfolio, from Ubuntu to open source infrastructure and applications.&nbsp;</p>\n<p>This role is a first step in the CSM organisation. Primarily focusing on the Tech segment, including the store customers, you will also have a the portfolio assigned. Ubuntu is chosen by thousands of new users every month. This is our responsibility to ensure the best user experience for them through problem solving, onboarding, enablement and value realisation, the all the way to success. Through collaborative problem solving and participation in campaign efforts, you will connect with a large range of users of Canonical’ products and identify our future champions.&nbsp;</p>\n<p><strong>Location: </strong>&nbsp;This role will be based remotely worldwide.</p>\n\n<p><strong>What your day will look like&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;</strong></p>\n<ul>\n<li>A strong focus on supporting customers by finding solutions to ticket requests.</li>\n<li>Enrich documentation about problem solving, Q&amp;A, onboarding materials.</li>\n<li>Drive campaigns targeting multiple customers through digital touch-points and activities.</li>\n<li>Identify high potential as well as high risk customers from newly onboarded users or customers</li>\n<li>Onboard new customers and introduce them to our products and support processes. Products include: Ubuntu Pro, MAAS, Landscape, Openstack, Ceph, Kubernetes, data applications and many more.&nbsp;</li>\n<li>Collaborate with Sales and Support in developing and delivering engagement plans that fulfill the customer's objectives.</li>\n<li>Engage with your portfolio of customers to ensure risk identification</li>\n<li>Collect feedback from customers and format them for review by the product team</li>\n</ul>\n\n<p><strong>What we are looking for in you</strong></p>\n<ul>\n<li>Customer-facing experience</li>\n<li>An empathetic individual with a natural drive to help others</li>\n<li>Passion for technology, infrastructure and Ubuntu in particular is a must</li>\n<li>Excellent presentation skills</li>\n<li>Strong organisational skills, ability to structure and constantly update documentation</li>\n<li>A team player capable of interacting with all departments internally&nbsp;</li>\n</ul>\n\n<p><strong>Additional skills that you might also bring</strong></p>\n<ul>\n<li>Fluency in a language other than English</li>\n</ul>\n\n<p><strong>What we offer you</strong></p>\n<p>We consider geographical location, experience, and performance in shaping compensation worldwide. We revisit compensation annually (and more often for graduates and associates) to ensure we recognise outstanding performance. In addition to base pay, we offer a performance-driven annual bonus. We provide all team members with additional benefits, which reflect our values and ideals. We balance our programs to meet local needs and ensure fairness globally.</p>\n<ul>\n<li>Distributed work environment with twice-yearly team sprints in person - we’ve been working remotely since 2004!</li>\n<li>Personal learning and development budget of USD 2,000 per year</li>\n<li>Annual compensation review</li>\n<li>Recognition rewards</li>\n<li>Annual holiday leave</li>\n<li>Maternity and paternity leave</li>\n<li>Employee Assistance Programme</li>\n<li>Opportunity to travel to new locations to meet colleagues from your team and others</li>\n<li>Priority Pass for travel and travel upgrades for long haul company events</li>\n</ul>\n\n<p><strong>About Canonical</strong></p>\n<p>Canonical is a pioneering tech firm that is at the forefront of the global move to open source. As the company that publishes Ubuntu, one of the most important open source projects and the platform for AI, IoT and the cloud, we are changing the world on a daily basis. We recruit on a global basis and set a very high standard for people joining the company. We expect excellence - in order to succeed, we need to be the best at what we do.</p>\n<p>Canonical has been a remote-first company since its inception in 2004.​ Work at Canonical is a step into the future, and will challenge you to think differently, work smarter, learn new skills, and raise your game. Canonical provides a unique window into the world of 21st-century digital business.</p>\n\n<p><strong>Canonical is an equal opportunity employer</strong></p>\n<p>We are proud to foster a workplace free from discrimination. Diversity of experience, perspectives, and background create a better work environment and better products. <a href=\"https://canonical.com/careers/diversity/identity\">Whatever your identity, we will give your application fair consideration.</a></p>\n\n<p>#LI-remote&nbsp;</p>\n    ","tags":"[]","pubDate":"2024-02-23 07:42:24.588","link":"https://canonical.com/careers/5381836","savedDate":"2024-02-23 07:42:24.588","slug":"graduate-customer-success-manager-canonical-9727"},{"id":7359488936,"title":"Sr. Frontend Engineer","company":"Bobtail","image":"https://media.licdn.com/dms/image/D4E0BAQGvUyfPVBWDyg/company-logo_200_200/0/1657595552015?e=2147483647&v=beta&t=EecsDCOy3Fh_26M1noQDDIYw8-JuGKz_d1JDvcBZ-yI","description":"\n    \n\n    <h2><span style=\"font-weight: 400;\">About Bobtail</span></h2>\n<p><span style=\"font-weight: 400;\">Bobtail is dedicated to increasing happiness by eliminating inefficiencies in the supply chain.&nbsp; We envision a supply chain without friction, fraud, waste, and abuse where companies succeed based on the value they create.&nbsp;&nbsp;</span></p>\n<p><span style=\"font-weight: 400;\">We work in a unique way at Bobtail, where we value teams over individuals and encourage experimentation and iteration to constantly improve.&nbsp; Teams are given flexibility in working towards a shared purpose and given the freedom to decide how they will accomplish their goals.&nbsp;&nbsp;</span></p>\n<p><span style=\"font-weight: 400;\">If you are an out of the box thinker that takes a proactive approach in collaborating with others to solve problems and achieve your goals - we would love to talk to you.&nbsp;&nbsp;</span></p>\n<p><span style=\"font-weight: 400;\">The things we value:</span></p>\n<ol>\n<li style=\"font-weight: 400;\"><span style=\"font-weight: 400;\">Mission</span></li>\n<li style=\"font-weight: 400;\"><span style=\"font-weight: 400;\">Teams over individuals</span></li>\n<li style=\"font-weight: 400;\"><span style=\"font-weight: 400;\">Collaboration</span></li>\n<li style=\"font-weight: 400;\"><span style=\"font-weight: 400;\">Communication</span></li>\n<li style=\"font-weight: 400;\"><span style=\"font-weight: 400;\">Iteration</span></li>\n<li style=\"font-weight: 400;\"><span style=\"font-weight: 400;\">Experimentation and failing fast</span></li>\n<li style=\"font-weight: 400;\"><span style=\"font-weight: 400;\">Initiative and solutions oriented approach</span></li>\n<li style=\"font-weight: 400;\"><span style=\"font-weight: 400;\">Documentation</span></li>\n<li style=\"font-weight: 400;\"><span style=\"font-weight: 400;\">Data</span></li>\n<li style=\"font-weight: 400;\"><span style=\"font-weight: 400;\">Mental health and work life balance</span></li>\n<li style=\"font-weight: 400;\"><span style=\"font-weight: 400;\">Diversity</span></li>\n<li style=\"font-weight: 400;\"><span style=\"font-weight: 400;\">Transparency</span><span style=\"font-weight: 400;\"><br><br></span></li>\n</ol>\n<h2><span style=\"font-weight: 400;\">You should apply if you have:</span></h2>\n<ul>\n<li style=\"font-weight: 400;\"><span style=\"font-weight: 400;\">Solve technical problems of high scope and complexity.</span></li>\n<li style=\"font-weight: 400;\"><span style=\"font-weight: 400;\">Exert influence on the overall objectives and long-range goals of your team.</span></li>\n<li style=\"font-weight: 400;\"><span style=\"font-weight: 400;\">Experience with performance and optimization problems, particularly at large scale, and a demonstrated ability to both diagnose and prevent these problems</span></li>\n<li style=\"font-weight: 400;\"><span style=\"font-weight: 400;\">Help to define and improve our internal standards for style, maintainability, and best practices for a high-scale web environment. Maintain and advocate for these standards through code review.</span></li>\n<li style=\"font-weight: 400;\"><span style=\"font-weight: 400;\">Provide mentorship for Junior Engineers on your team to help them grow in their technical responsibilities and remove blockers to their autonomy.</span></li>\n<li style=\"font-weight: 400;\"><span style=\"font-weight: 400;\">Confidently ship moderately sized features and improvements with minimal guidance and support from other team members. Collaborate with the team on larger projects.</span></li>\n</ul>\n<h2><span style=\"font-weight: 400;\">You will be responsible for:</span></h2>\n<ul>\n<li style=\"font-weight: 400;\"><span style=\"font-weight: 400;\">Craft user experiences that work on devices that our users use (primarily mobile devices and desktop browsers).</span></li>\n<li style=\"font-weight: 400;\"><span style=\"font-weight: 400;\">Writing reusable, testable, efficient and secure code.</span></li>\n<li style=\"font-weight: 400;\"><span style=\"font-weight: 400;\">Working with large scale, highly available and resilient modern financial systems.</span></li>\n<li style=\"font-weight: 400;\"><span style=\"font-weight: 400;\">Working with automated deployment, enabling code release multiple times a day.</span></li>\n<li style=\"font-weight: 400;\"><span style=\"font-weight: 400;\">Working with modern tools and languages that excite you.</span></li>\n<li style=\"font-weight: 400;\"><span style=\"font-weight: 400;\">Being an integral part of a team, in addition to its culture and ways of working. Common practices include agile methodologies.</span></li>\n</ul>\n<h2><span style=\"font-weight: 400;\">Some of the technologies you’ll get to work with:</span></h2>\n<ul>\n<li style=\"font-weight: 400;\"><span style=\"font-weight: 400;\">HTML, CSS, SCSS.</span></li>\n<li style=\"font-weight: 400;\"><span style=\"font-weight: 400;\">Typescript &amp; Javascript.</span></li>\n<li style=\"font-weight: 400;\"><span style=\"font-weight: 400;\">Vue.js with Build Tools.</span></li>\n<li style=\"font-weight: 400;\"><span style=\"font-weight: 400;\">Docker, AWS S3 and CloudFront.</span></li>\n</ul>\n<h2><span style=\"font-weight: 400;\">Benefits</span></h2>\n<ul>\n<li style=\"font-weight: 400;\"><span style=\"font-weight: 400;\">Monthly Mental Break Day</span></li>\n<li style=\"font-weight: 400;\"><span style=\"font-weight: 400;\">Unlimited vacation</span></li>\n<li style=\"font-weight: 400;\"><span style=\"font-weight: 400;\">Work from home (or wherever)</span></li>\n<li style=\"font-weight: 400;\"><span style=\"font-weight: 400;\">Parental leave</span></li>\n</ul>\n<p><span style=\"font-weight: 400;\"><br><br></span><span style=\"font-weight: 400;\">Creating a diverse and inclusive workplace is Bobtail’s nucleus. We are an equal opportunity employer and embrace people of different backgrounds, cultures, religions, national origins, races, colors, genders, gender expressions, sexual orientations, ages, marital status, veteran status, experiences, abilities and perspective</span><span style=\"font-weight: 400;\">s.</span> <span style=\"font-weight: 400;\"><br><br></span></p>\n\n    \n\n    \n","tags":"[\"javascript\",\"typescript\",\"aws\"]","pubDate":"2024-02-23 07:42:24.587","link":"https://boards.greenhouse.io/bobtail/jobs/4004576005","savedDate":"2024-02-23 07:42:24.587","slug":"sr-frontend-engineer-bobtail-9222"},{"id":2934288766,"title":"Senior Python/Django Developer (NSG)","company":"Blue Coding","image":"https://lever-client-logos.s3.us-west-2.amazonaws.com/3c1d9ac7-6738-46c5-b6ca-a35fa2a0df57-1666278594128.png","description":"<div><i style=\"font-size: 18px\">Do you want to earn a salary in USD?&nbsp;</i></div><div><i style=\"font-size: 18px\">Would you like to work from wherever you want?</i></div><div><i style=\"font-size: 18px\">Would you like to be a part of the leading next-gen software developers?&nbsp;</i></div><div><br></div><div><b style=\"font-size: 24px\">Hi, you finally found us!</b><span style=\"font-size: 24px\">&nbsp;</span></div><div><br></div><div><b style=\"font-size: 24px\">Why work at Blue Coding?</b><span style=\"font-size: 24px\">&nbsp;</span></div><div><br></div><div>At Blue Coding we specialize in hiring excellent developers and amazing people from all over Latin America and other parts of the world. For the past 9 years, we’ve helped cutting-edge companies in the United States and Canada -both large and small, build great development teams and develop great products. Online shops, digital agencies, SaaS providers, and software consulting firms are a few of our clients. Our team of over 100 engineers is distributed in more than 10 countries across the Americas. We are a fully remote company working with a wide array of technologies and have expertise in every stage of the software development process.&nbsp;&nbsp;</div><div><br></div><div>Our team is highly connected, united, and culturally diverse, and our collaborators are involved in many initiatives around the world, from wildlife preservation to volunteering at local charities. We also participate in group activities like movie nights, trivia, and meme competitions. We stand for honesty, fairness, respect, efficiency, hard work, and cooperation.</div><div><br></div><div><b>What are we looking for?</b></div><div><br></div><div>In this opportunity, we are looking for a Senior Python/Django Developer to work with one of our foreign clients, who is ensuring that national construction companies in the US not only meet but exceed their goals, delivering unparalleled quality and service to their clients. Together, they support the&nbsp;future of construction through teamwork, innovation, and relentless improvement.&nbsp;</div><div><br></div><div>If you are independent, a great communicator, a problem solver, and have strong attention to detail, this is a great fit for you! Our jobs are fully remote – as long as you have the skills and can get the work done well, you can work anywhere in the listed countries you want.</div><div>If you have the skills and can get the job done, join us and work from anywhere you want!</div><div><br></div><div><b>What's unique about this job?</b></div><div><br></div><div>As a Senior Python/Django Developer, you’ll be part of a great team of veterans who have been working with Python for over 20 years. They are looking for developers who can help them develop their applications using Django. Their projects have slowed down because of code reviews where there is not a lot of Django knowledge.</div><div><br></div><div>They work on a CRM product for construction companies and help them track all the ongoing projects they have.</div><h3>Here are some of the exciting day-to-day challenges you will face in this role:</h3><li>Development of new features and releases using deliver using Python and Django.</li><li>Helping with any development work that has to be done in order to deliver the projects.</li>,<h3>You will shine if you have:</h3><li>Strong hands-on experience with Python and the Django framework.</li><li>Experience with cloud environments such as AWS.</li><li>Experience with agile methodologies like Scrum or Kanban.</li>,<h3>Here are some of the perks we offer you:</h3><li>Salary in USD</li><li>Long-term</li><li>Flexible schedule (within US Time zones)</li><li>100% Remote</li><div><b style=\"font-size: 24px\">Hey, you are still here!</b><span style=\"font-size: 24px\">&nbsp;</span></div><div><br></div><div>So, let us ask a few questions. Do you like working in a friendly environment? Are you fluent in English? Do you have a strong work ethic, are detail-oriented and have an ownership mentality? And most importantly do you love music and puppies? If so, then what are you waiting for? Come join our team and become part of this awesome company! We will be expecting you.</div>","tags":"[\"aws\"]","pubDate":"2024-02-22 18:01:11.403","link":"https://jobs.lever.co/bluecoding/bd865ada-9be9-4401-9cab-d20adc90ceb0","savedDate":"2024-02-23 07:42:24.589","slug":"senior-python-django-developer-nsg-blue-coding-175"},{"id":2538654494,"title":"Python/Django Developer (NSG)","company":"Blue Coding","image":"https://lever-client-logos.s3.us-west-2.amazonaws.com/3c1d9ac7-6738-46c5-b6ca-a35fa2a0df57-1666278594128.png","description":"<div><i style=\"font-size: 18px\">Do you want to earn a salary in USD?&nbsp;</i></div><div><i style=\"font-size: 18px\">Would you like to work from wherever you want?</i></div><div><i style=\"font-size: 18px\">Would you like to be a part of the leading next-gen software developers?&nbsp;</i></div><div><br></div><div><b style=\"font-size: 24px\">Hi, you finally found us!</b><span style=\"font-size: 24px\">&nbsp;</span></div><div><br></div><div><b style=\"font-size: 24px\">Why work at Blue Coding?</b><span style=\"font-size: 24px\">&nbsp;</span></div><div><br></div><div>At Blue Coding we specialize in hiring excellent developers and amazing people from all over Latin America and other parts of the world. For the past 9 years, we’ve helped cutting-edge companies in the United States and Canada -both large and small, build great development teams and develop great products. Online shops, digital agencies, SaaS providers, and software consulting firms are a few of our clients. Our team of over 100 engineers is distributed in more than 10 countries across the Americas. We are a fully remote company working with a wide array of technologies and have expertise in every stage of the software development process.&nbsp;&nbsp;</div><div><br></div><div>Our team is highly connected, united, and culturally diverse, and our collaborators are involved in many initiatives around the world, from wildlife preservation to volunteering at local charities. We also participate in group activities like movie nights, trivia, and meme competitions. We stand for honesty, fairness, respect, efficiency, hard work, and cooperation.</div><div><br></div><div><b>What are we looking for?</b></div><div><br></div><div>In this opportunity, we are looking for a Python/Django Developer to work with one of our foreign clients, who is ensuring that national construction companies in the US not only meet but exceed their goals, delivering unparalleled quality and service to their clients. Together, they support the&nbsp;future of construction through teamwork, innovation, and relentless improvement.&nbsp;</div><div><br></div><div>If you are independent, a great communicator, a problem solver, and have strong attention to detail, this is a great fit for you! Our jobs are fully remote – as long as you have the skills and can get the work done well, you can work anywhere in the listed countries you want.</div><div>If you have the skills and can get the job done, join us and work from anywhere you want!</div><div><br></div><div><b>What's unique about this job?</b></div><div><br></div><div>As a Python/Django Developer, you’ll be part of a great team of veterans who have been working with Python for over 20 years. They are looking for developers who can help them develop their applications using Django. Their projects have slowed down because of code reviews where there is not a lot of Django knowledge.</div><div><br></div><div>They work on a CRM product for construction companies and help them track all the ongoing projects they have.</div><h3>Here are some of the exciting day-to-day challenges you will face in this role:</h3><li>Development of new features and releases using deliver using Python and Django.</li><li>Helping with any development work that has to be done in order to deliver the projects.</li>,<h3>You will shine if you have:</h3><li>Strong hands-on experience with Python and the Django framework.</li><li>Experience with cloud environments such as AWS.</li><li>Experience with agile methodologies like Scrum or Kanban.</li>,<h3>Here are some of the perks we offer you:</h3><li>Salary in USD</li><li>Long-term</li><li>Flexible schedule (within US Time zones)</li><li>100% Remote</li><div><b style=\"font-size: 24px\">Hey, you are still here!</b><span style=\"font-size: 24px\">&nbsp;</span></div><div><br></div><div>So, let us ask a few questions. Do you like working in a friendly environment? Are you fluent in English? Do you have a strong work ethic, are detail-oriented and have an ownership mentality? And most importantly do you love music and puppies? If so, then what are you waiting for? Come join our team and become part of this awesome company! We will be expecting you.</div>","tags":"[\"aws\"]","pubDate":"2024-02-21 20:37:50.085","link":"https://jobs.lever.co/bluecoding/c6fff3cc-896a-4a26-b645-40349b2fd67c","savedDate":"2024-02-23 07:42:24.588","slug":"python-django-developer-nsg-blue-coding-3709"},{"id":6648104370,"title":"Python/Django Team Leader (NSG)","company":"Blue Coding","image":"https://lever-client-logos.s3.us-west-2.amazonaws.com/3c1d9ac7-6738-46c5-b6ca-a35fa2a0df57-1666278594128.png","description":"<div><i style=\"font-size: 18px\">Do you want to earn a salary in USD?&nbsp;</i></div><div><i style=\"font-size: 18px\">Would you like to work from wherever you want?</i></div><div><i style=\"font-size: 18px\">Would you like to be a part of the leading next-gen software developers?&nbsp;</i></div><div><br></div><div><b style=\"font-size: 24px\">Hi, you finally found us!</b><span style=\"font-size: 24px\">&nbsp;</span></div><div><br></div><div><b style=\"font-size: 24px\">Why work at Blue Coding?</b><span style=\"font-size: 24px\">&nbsp;</span></div><div><br></div><div>At Blue Coding we specialize in hiring excellent developers and amazing people from all over Latin America and other parts of the world. For the past 9 years, we’ve helped cutting-edge companies in the United States and Canada -both large and small, build great development teams and develop great products. Online shops, digital agencies, SaaS providers, and software consulting firms are a few of our clients. Our team of over 100 engineers is distributed in more than 10 countries across the Americas. We are a fully remote company working with a wide array of technologies and have expertise in every stage of the software development process.&nbsp;&nbsp;</div><div><br></div><div>Our team is highly connected, united, and culturally diverse, and our collaborators are involved in many initiatives around the world, from wildlife preservation to volunteering at local charities. We also participate in group activities like movie nights, trivia, and meme competitions. We stand for honesty, fairness, respect, efficiency, hard work, and cooperation.</div><div><br></div><div><b>What are we looking for?</b></div><div><br></div><div>In this opportunity, we are looking for a Python/Django Team Leader to work with one of our foreign clients, who is ensuring that national construction companies in the US not only meet but exceed their goals, delivering unparalleled quality and service to their clients. Together, they support the&nbsp;future of construction through teamwork, innovation, and relentless improvement.&nbsp;</div><div><br></div><div>If you are independent, a great communicator, a problem solver, and have strong attention to detail, this is a great fit for you! Our jobs are fully remote – as long as you have the skills and can get the work done well, you can work anywhere in the listed countries you want.</div><div>If you have the skills and can get the job done, join us and work from anywhere you want!</div><div><br></div><div><b>What's unique about this job?</b></div><div><br></div><div>As a Python/Django Team Leader, you’ll be part of a great team of veterans who have been working with Python for over 20 years. They are looking for an experienced team leader who can help them manage their team and mentor them in Django. Their projects have slowed down because of code reviews where there is not a lot of Django knowledge.</div><div><br></div><div>They work on a CRM product for construction companies and help them track all the ongoing projects they have.</div><h3>Here are some of the exciting day-to-day challenges you will face in this role:</h3><li>You'll be managing a small team of developers and guiding them to be able to deliver top-quality code. <b>This is a managing first, coding second role.</b></li><li>Lead the efforts for the team to learn and improve their Django skills.</li><li>Documenting the step-by-step process.</li><li>Helping with any development work that has to be done in order to deliver the projects. If you want to do development you just have to ask for it as there is plenty of work to be done!</li>,<h3>You will shine if you have:</h3><li>Strong hands-on experience with Python and the Django framework.</li><li>Experience as a lead developer.</li><li>Experience with cloud enviroments such as AWS.</li><li>Experience with agile methodologies like Scrum or Kanban.</li>,<h3>Here are some of the perks we offer you:</h3><li>Salary in USD</li><li>Long-term</li><li>Flexible schedule (within US Time zones)</li><li>100% Remote</li><div><b style=\"font-size: 24px\">Hey, you are still here!</b><span style=\"font-size: 24px\">&nbsp;</span></div><div><br></div><div>So, let us ask a few questions. Do you like working in a friendly environment? Are you fluent in English? Do you have a strong work ethic, are detail-oriented and have an ownership mentality? And most importantly do you love music and puppies? If so, then what are you waiting for? Come join our team and become part of this awesome company! We will be expecting you.</div>","tags":"[\"aws\"]","pubDate":"2024-02-21 20:35:34.200","link":"https://jobs.lever.co/bluecoding/a394a682-3dab-4db4-a8d1-a34755c03c00","savedDate":"2024-02-23 07:42:24.589","slug":"python-django-team-leader-nsg-blue-coding-3522"}]