[{"id":4316666185,"title":"Senior C++ Software Engineer (Remote/Anywhere)","company":"Collabora","image":"https://media.licdn.com/dms/image/D4E0BAQFdRsd49YG4fQ/company-logo_200_200/0/1688735422027/collabora_logo?e=2147483647&v=beta&t=COQKgdesE_abHpZN-7BjhNZ1IKm2nhQyHB637TbP88E","description":"<div class=\"section page-centered\" data-qa=\"job-description\"><div><span style=\"font-size: 11pt\">Collabora Productivity Ltd. is a software company specialising in bringing the innovation created in Open Source projects such as LibreOffice to the market, along with services, long term support and software consultancy. We combine years of open source software leadership with an understanding of the challenges that businesses, non-profits, and governments face.</span></div><div><br></div><div><span style=\"font-size: 11pt\">Collabora Productivity brings deep technical expertise around the Office space, from our preferred Open Document format to many other, including legacy, document formats such as OpenXML and Microsoft binary formats, using modern technologies like C++ 17.</span></div><div><br></div><div><br></div></div><div class=\"section page-centered\"><div><h3>Key Responsibilities</h3><ul class=\"posting-requirements plain-list\"><ul><li>Root cause analysis and fixing of document interoperability issues</li><li>Analysing client problems, designing, and implementing solutions leveraging open source technologies and communicating the solutions in a compelling fashion</li><li>Annual conference attendance to present progress made to the Open Source community</li><li>Self starting analysis of limited project descriptions, ability to break complex tasks down into smaller deliverables, execute and report progress against these</li><li>Assistance in estimation of project costs</li><li>Implementation of features based on unclear customer input to exceed their expectations</li><li>Communication with the community, other team members, and customers using mailing \tlists, chats, phone and video conference</li><li>Capacity to travel a few times per year worldwide</li><li>Reliable and timely delivery of quality solutions to clients and internal customers</li><li>Development of strong relationships with key personnel, decision makers and customers</li></ul></ul></div></div><div class=\"section page-centered\"><div><h3>Commercial Skills</h3><ul class=\"posting-requirements plain-list\"><ul><li>Understanding client needs and reconciling time constraints, available technologies and resources and open source best practices</li><li>Ability to work in a global context with clients and engineers spanning continents</li><li>Knowledge of customers’ organization, management, product, target market, applications and decision making internal process \t</li></ul></ul></div></div><div class=\"section page-centered\"><div><h3>Technical Skills</h3><ul class=\"posting-requirements plain-list\"><ul><li>Large scale C++ development experience, on projects of &gt; 1 million lines of code</li><li>LibreOffice development experience preferred</li><li>Excellent code reading skills</li><li>Office Suite, file format and binary file format reverse engineering experience a plus</li><li>Good interpersonal skills, along with knowledge of open source \tdevelopment methodologies and good standing in the open source community</li><li>Significant demonstrable contributions to components in the open source ecosystem</li><li>BS/BA or extensive experience in the role of Software Engineer </li><li>Experience of unit testing</li><li>Cross-platform aware, deep knowledge of either Linux, MS Windows, or OSX, and some knowledge of one more platform (Cygwin knowledge helpful if MS Windows is the core skill)</li><li>Experience with Android, iOS or another mobile operating system a bonus</li><li>Casual scripting in Perl / Python / BASH or other language(s)</li><li>Version control systems – ideally knowledge of git</li></ul></ul></div></div><div class=\"section page-centered\"><div><h3>Personal Skills</h3><ul class=\"posting-requirements plain-list\"><ul><li>Highly self motivated, reliable with a demonstrable passion for Open Source and the office domain</li><li>Able to work from home office, managing own time effectively</li><li>Self learning skill to get sufficient knowledge of Collabora's services, \tbusiness model, project delivery lifecycle and other related technical domains</li><li>Good interpersonal skills</li><li>Winsome presentation skills appreciated</li><li>Good English language skills (both verbal and written) </li><li>German language skills a bonus</li><li>Ability to work and communicate in an online distributed environment</li></ul></ul></div></div><div class=\"section page-centered\" data-qa=\"closing-description\"><div>#LI-Remote</div></div><div class=\"section page-centered last-section-apply\" data-qa=\"btn-apply-bottom\"><a class=\"postings-btn template-btn-submit hex-color\" data-qa=\"show-page-apply\" href=\"https://jobs.lever.co/collabora/afb6f2ea-9c39-498c-863c-82764ea247a0/apply\">Apply for this job</a></div>","tags":"[\"management\",\"engineering\"]","pubDate":"2024-08-06 13:37:51.251","link":"https://jobs.lever.co/collabora/afb6f2ea-9c39-498c-863c-82764ea247a0","savedDate":"2024-08-06 13:37:51.251","slug":"senior-c-software-engineer-remote-anywhere-collabora-8800"},{"id":2158772002,"title":"Partnership Program (b2b)","company":"SafetyWing","image":"https://pbs.twimg.com/profile_images/1177267684574208000/54eG3WmW_400x400.jpg","description":"<h2>🧘 What we offer:</h2> <ul><li><!--block-->Up to 10 % success fees for referred customers who end up buying.</li><li><!--block-->Access to quality product onboarding, pre-approved marketing materials, and templates to assist you in promoting SafetyWing’s Remote Health product effectively.Webinars, workshops, and a supportive community to enhance your sales skills, product knowledge, and professional growth.&nbsp;</li><li><!--block-->The freedom to work independently and manage your schedule.</li></ul><div><!--block-->We are looking forward to hearing from you!</div> <div><!--block--><a href=\"https://safetywing.com/\"><strong>SafetyWing</strong></a> (YC W18) is establishing a partnership network and seeking independent B2B insurance sales professionals.</div><div><!--block--><br>We are building a global social safety net, including health and retirement for remote workers worldwide, as a replacement for national welfare systems. If we succeed, we believe this will help ensure freedom and equal opportunity for everyone, and it is one of the more important tasks of our time that no one else is working on.<br><br></div><div><!--block--><a href=\"https://safetywing.com/remote-health\"><strong>Remote Health</strong></a> is a global health insurance plan that works in over 175 countries and follows you wherever you go. It is used by globally distributed teams and businesses that operate remotely. Most companies we work with promote a remote-friendly or work-from-anywhere policy.</div><div><!--block--><br></div> <h2>😀 How you will help:</h2>  <ul><li><!--block-->Connect prospective customers with SafetyWing.</li><li><!--block-->Conduct end-to-end sales process, including product comparisons and finalizing sales.<br><br><br></li></ul><div><!--block--><br></div> <h2>🧪 We are looking for someone who:</h2> <ul><li><!--block-->Is an experienced B2B insurance salesperson.</li><li><!--block-->&nbsp;Has insurance seller license.</li><li><!--block-->Has a strong network and can operate independently.</li><li><!--block-->Wants to supplement their income by promoting a product they believe in, whether to their clients, audience, or colleagues/friends.</li><li><!--block-->Believes in our mission and wants to help build a global social safety net on the Internet.</li></ul>","tags":"[\"B2B\"]","pubDate":"2024-08-06 13:37:51.250","link":"https://safetywing.pinpointhq.com/en/jobs/221766","savedDate":"2024-08-06 13:37:51.250","slug":"partnership-program-b2b-safetywing-1013"},{"id":3983388092,"title":"Creative Designer","company":"Airalo","image":"https://lever-client-logos.s3.us-west-2.amazonaws.com/55028a36-609c-479c-9553-d4689ff2dd8c-1669620566663.png","description":"<div><b>About Airalo</b></div><div>Alo! Airalo is the world’s first eSIM store that helps people connect in over 200+ countries and regions across the globe. We are building the next digital service that revolutionizes the telecom industry. We are a travel-tech company and an equal-opportunity environment that values and executes diversity, inclusion, and equity. Our team is spread across 50+ countries and six continents. What glues us together is our commitment to changing the way you connect<span style=\"font-size: 13.3333px\">. </span></div><div><br></div><div><b>About you</b></div><div>We hope that you care deeply about the quality of your work, the intrinsic worth of tasks, and the success of your team. You are self-disciplined and do not require micromanagement in terms of your skillset and work ethic. You do your best to flourish as an individual every day while working hard to foster a collaborative team environment. You believe in the importance of being — and staying — authentic, honest, positive, and kind. You are a good interlocutor with clear and concise communication. You are able to manage multiple projects, have an analytical mind, pay keen attention to detail, and love to get your hands dirty. You are cognizant, tolerant, and welcoming of vulnerabilities and cultural differences.</div><div><br></div><div><b>About the Role</b></div><div><b>Position</b>: Full-time / Employee</div><div><b>Location:</b>&nbsp;Remote-first </div><div><b>Benefits:</b>&nbsp;Health Insurance, work-from-anywhere stipend, annual wellness &amp; learning credits, annual all-expenses-paid company retreat in a gorgeous destination &amp; other benefits</div><div><br></div><div>As a <b>Creative Designer</b>, you’ll be tasked with bringing ideas to life through visual design, engaging graphics, short-form content, videos, and content for Airalo.</div><div>eSIM technology is a relatively new concept to the majority of the population. It will be your mission to find creative ways to explain the beauty and simplicity of what Airalo can bring to an individual. The creative content you’ll create will be used to improve our global user acquisition and education efforts. You’ll harness the Airalo voice, bring narratives to life, and engage a variety of different audiences in a fun and meaningful way.</div><h3>Responsibilities include but are not limited to:</h3><li>Delivering creative visual assets, static and motion design that brings our brand to life.</li><li>Concepting and developing content for marketing campaigns, partnership, and affiliate materials, as well as social campaigns.</li><li>You’ll be working primarily in the Growth (marketing) and Partnerships team to deliver the best solutions for our projects.</li><li>Taking ownership of projects, from concept through to completion</li><li>Working across multiple project deadlines</li><li>Help maintain visual and brand consistency</li><li>Engaging with the strategic dimension of our work</li><li>Collaborate with a diverse and distributed group of teammates across multiple locations and time zones.</li><li>Display creativity, cultural awareness, and excellent communications judgment as you advise on multimedia strategies to support communications objectives.</li><li>You’ll be working in a startup environment which calls for flexibility and willingness to collaborate within a team environment</li>,<h3>Must-haves:</h3><li>At least 1 year of working experience in a company or as a freelancer.</li><li>Degree or Diploma in a relevant design field or equivalent practical experience.</li><li>At least 3 years of experience working in Adobe’s range of Creative Cloud products including Photoshop, Illustrator, Premiere, and After Effects. Knowledge of Figma is a bonus.</li><li>A portfolio highlighting excellence and flexibility of design work and responding to a variety of briefs.</li><li>Your portfolio should showcase your design process, conceptual ability, and examples in communication design</li><div><br></div><div><b>Please note that candidates without a portfolio will not be considered.</b></div>,<h3>What we’re looking out for:</h3><li>An all-rounder!</li><li>Imaginative problem-solvers who can look at the big picture while reading between the lines.</li><li>Flexibility, you will need to be comfortable navigating ambiguity, tight deadlines, and shifting requirements.</li><li>Ability to turn complicated ideas into compelling, easy-to-understand visuals.</li><li>Strong communication and visual storytelling skills.</li><li>Ability to work calmly and maintain good judgment in fast-paced, high-stress environments.</li><li>Ability to solicit feedback and incorporate it quickly while meeting deadlines.</li><li>Exceptional project management and negotiation skills.</li><li>Strong attention to detail and organizational skills.</li><li>A strong understanding of Brand systems, and the ability to provide flexibility where needed, while still adhering to Brand guidelines</li><li>A clear communicator - the ability to express complex ideas clearly and succinctly, while collaborating closely with teams outside of the Creative Group</li><li>Ability to lead and also execute creative work, independently and remotely</li><li>Collaborate with cross-functional teams throughout the design process.</li><li>Comfortable working in a completely remote environment.</li>,<h3>Good to have:</h3><li>The ability to create motion graphics, and short videos to help tell stories through a variety of different channels.</li><li>Bilingual capabilities.</li><div>If you are interested in this position, <b>please apply via the link.</b></div><div><br></div><div><i>We sincerely thank all applicants in advance for submitting their interest in this opportunity with Airalo. </i></div>","tags":"[\"management\"]","pubDate":"2024-08-06 10:14:53.625","link":"https://jobs.lever.co/airalo/b204d294-5a7e-40cb-a024-1d4392bad032","savedDate":"2024-08-06 13:37:51.252","slug":"creative-designer-airalo-7906"},{"id":4504850541,"title":"Product Owner/WordPress optimization (worldwide remote, work anywhere)","company":"CloudLinux","image":"https://pbs.twimg.com/profile_images/696718028084482050/ymY3OEPk_400x400.png","description":"<p>CloudLinux is a global remote-first company. We are driven by our principles: do the right thing, employees first, we are remote first, and we deliver high volume, low-cost Linux infrastructure and security products that help companies to increase the efficiency of their operations. Every person on our team supports each other and does what we can to ensure we all are successful. </p><p>CloudLinux OS, our flagship product, runs on more than 50,000 production servers today, powering over 40 million websites, and is recognized as the best OS for security and efficiency in a shared hosting environment. CloudLinux OS increases server density and enhances security, thus reducing operating costs, decreasing churn rates, and increasing profitability. </p><p>As a part of the CloudLinux OS department, the CL PRO Team focuses on the diagnostic and optimization of WordPress sites (PHP X-Ray, AccelerateWP), advanced automation, deep-look performance analytics, and centralized monitoring tools. </p><p>Check out our website for more information about our CLOS Product <a href=\"https://www.cloudlinux.com/\" target=\"_blank\" rel=\"nofollow noreferrer noopener\" class=\"external\">https://www.cloudlinux.com/</a></p><p></p><p><strong>Key Responsibilities:</strong></p><ul> <li>Define the main strategy, product vision, roadmap, and backlog for optimizing PHP/WordPress sites</li> <li>Develop and evolve the existing optimization and diagnostic features</li> <li>Make an active comparison with analogs and search for the best website optimization solutions in the market </li> <li>Generate and explore ideas for optimization</li> <li>Implement necessary metrics to monitor product success and provide ongoing oversight of these metrics</li> <li>Lead and manage a team of web developers and designers, ensuring effective collaboration and high-quality output</li> <li>Lead and support technical escalations with global customers, presenting analysis, reports, insights, and findings</li> <li>Collaborate closely with stakeholders to understand their needs and expectations, translating these into actionable tasks for the team</li> <li>Ensure the product meets user needs and provides an excellent user experience, with a particular focus on website performance and speed</li> <li>Identify potential risks and develop strategies to mitigate them, ensuring the smooth delivery of the product</li> <li>Develop and maintain strong and healthy relationships with peers from the other development units, customer success, presales, and other stakeholders at Imunify</li> </ul><p></p><h3>Requirements: </h3><p><strong>Required Skills and Knowledge:</strong></p><ul> <li>Minimum 5 years of experience in site optimization and web technologies</li> <li>Active engagement in the WordPress community</li> <li>Proficiency with programming languages such as PHP and JavaScript, and in web technologies such as HTML and CSS</li> <li>Strong knowledge of WordPress, including themes, plugins, optimization techniques, and explicit development of plugins</li> <li>Understanding and applying different existing solutions/plugins for performance improvement; understanding the variances between different optimization features</li> <li>Experience with tools that measure web page performance and a strong understanding of the most important evaluating performance metrics</li> <li>Good understanding of caching mechanisms</li> <li>Understanding of the most important and popular paint points in WordPress</li> <li>Knowledge of popular frameworks and libraries such as AngularJS, ReactJS, or Vue.js.</li> <li>Strong understanding of web servers such as Apache, Nginx, Litespeed and their advantages/disadvantages</li> <li>Familiarity with web design principles, user experience (UX) design, and accessibility standards</li> <li>Knowledge of SEO practices and web analytics to improve a website’s visibility and performance</li> <li>Understanding of how to create websites that work well on a variety of devices and screen sizes</li> <li>Knowledge of web security practices to protect websites from threats and vulnerabilities</li> <li>Understanding of how to ensure websites function and display correctly across different web browsers</li> <li>Knowledge of web services like REST or SOAP, which allow different software applications to communicate with each other</li> <li>Proficiency in database management and optimization, with knowledge of SQL or NoSQL databases</li> <li>Experience with e-commerce platforms, which are used to create online stores</li> <li>Hands-on experience in Linux (experience with popular distributions such as CentOS, Almalinux, CloudLinux, and Debian)</li> </ul><p></p><p><strong>It would be great if you also have:</strong></p><ul> <li>Experience with other CMS like Drupal or Joomla </li> <li>Knowledge of web hosting control panels such as cPanel, Plesk, or DirectAdmin</li> </ul><p></p><p><strong>Personal Qualities:</strong></p><ul> <li>Strong leadership and communication skills, with the ability to inspire and motivate a team</li> <li>A problem-solving mindset, with the ability to think creatively and come up with innovative solutions to challenges</li> <li>Ability to work under pressure and meet tight deadlines, while maintaining a high standard of work</li> <li>Attention to detail, ensuring all aspects of the product are thoroughly considered and executed</li> <li>Strong organizational skills, with the ability to manage multiple tasks and priorities effectively</li> <li>Can-do attitude, customer-facing, accountable, positive attitude, time management, and multitasking skills</li> <li>Willing to be on alert during off-work hours as necessary</li> <li>Excellent presentation, communication skills, and excellent English (speaking, reading, and writing)</li> </ul><h3>Benefits: </h3><p><strong>What's in it for you?</strong></p><ul> <li>A focus on professional development</li> <li>Interesting and challenging projects</li> <li>Fully remote work with flexible working hours, that allows you to schedule your day and work from any location worldwide</li> <li>Paid 24 days of vacation per year, 10 days of national holidays, and unlimited sick leaves</li> <li>Compensation for private medical insurance </li> <li>Co-working and gym/sports reimbursement</li> <li>Budget for education</li> <li>The opportunity to receive a reward for the most innovative idea that the company can patent</li> </ul><p></p><p></p><p><em>By applying for this position, you agree with </em><a href=\"https://cloudlinux.com/privacy-policy%20\" rel=\"nofollow noreferrer noopener\" class=\"external\">the Cloudlinux Privacy Policy</a><em>and give us your consent to maintain and process your personal data in this respect. Please read our Privacy Policy for more information.</em></p>","tags":"[\"javascript\",\"management\",\"database\"]","pubDate":"2024-08-06 00:00:00.000","link":"https://apply.workable.com/cloudlinux-1/j/38CAF3BF5E","savedDate":"2024-08-06 13:37:51.252","slug":"product-owner-wordpress-optimization-worldwide-remote-work-anywhere-cloudlinux-3969"},{"id":7220027416,"title":"RoR - Software Developer (VM)","company":"Blue Coding","image":"https://media.licdn.com/dms/image/C4D0BAQHlK67hgnhzQw/company-logo_200_200/0/1631346154820?e=2147483647&v=beta&t=_R2Ssj7L_f4xqmSCcq0nOLCyCz0QN2lFnHssxxhj3YY","description":"<div><i style=\"font-size: 18px\">Do you want to earn a salary in USD?&nbsp;</i></div><div><i style=\"font-size: 18px\">Would you like to work from wherever you want?</i></div><div><i style=\"font-size: 18px\">Would you like to be a part of the leading next-gen software developers?&nbsp;</i></div><div><br></div><div><b style=\"font-size: 24px\">Hi, you finally found us!</b><span style=\"font-size: 24px\">&nbsp;</span></div><div><br></div><div><b style=\"font-size: 24px\">Why work at Blue Coding?</b><span style=\"font-size: 24px\">&nbsp;</span></div><div><br></div><div>At Blue Coding we specialize in hiring excellent developers and amazing people from all over Latin America and other parts of the world. For the past 10 years, we’ve helped cutting-edge companies in the United States and Canada -both large and small, build great development teams and develop great products. Online shops, digital agencies, SaaS providers, and software consulting firms are a few of our clients. Our team of over 100 engineers is distributed in more than 10 countries across the Americas. We are a fully remote company working with a wide array of technologies and have expertise in every stage of the software development process.&nbsp;&nbsp;</div><div><br></div><div>Our team is highly connected, united, and culturally diverse, and our collaborators are involved in many initiatives around the world, from wildlife preservation to volunteering at local charities. We also participate in group activities like movie nights, trivia, and meme competitions. We stand for honesty, fairness, respect, efficiency, hard work, and cooperation.</div><div><br></div><div><b style=\"font-size: 24px\">What are we looking for?</b></div><div><br></div><div>In this opportunity, we are looking for a Software Developer to work with one of our foreign clients, who is a market leader in the consultation, design, procurement, implementation, and ongoing managed services for technology services for mid to large global enterprises. As a Telecom Managed Service company, they partner with over 300 service providers globally to help customers with technology design and find the best solutions to meet their needs.</div><div><br></div><div>As a Software Developer, you will use coding languages to write, compile, and test programs and applications aimed at delivering cellular cost optimization services for enterprises. Joining our client's team, you will be dedicated to helping reduce their clients' monthly cell phone bills and simplifying the management of their mobile device inventory and services.</div><div><br></div><div>If you are independent, a great communicator, a problem solver, and have strong attention to detail, this is a great fit for you! Our jobs are fully remote – as long as you have the skills and can get the work done well, you can work anywhere in the listed countries you want.</div><div><br></div><div>If you have the skills and can get the job done, join us and work from anywhere you want!</div><h3>Here are some of the exciting day-to-day challenges you will face in this role:</h3><li>Build new applications that will increase clients' value. Write clean, high-quality, high-performance, maintainable code. </li><li>Develop and support software, including applications, database integration, interfaces, and new functionality enhancements. </li><li>Analyze existing program logic to identify causes of program malfunctions; modify program logic to eliminate problems or increase the program's operational efficiency. </li><li>Collaborate with internal and external stakeholders to understand user needs. </li><li>Support test and deployment of new products and features. </li><li>Shape our product and deliver new features monthly, improving our effectiveness and making our users happier. </li><li>Maintain knowledge of trends and developments in related areas of technology and programming.</li>,<h3>You will shine if you have:</h3><li>Bachelor's degree in Computer Science or a related field, or equivalent work experience.</li><li>3+ of related work experience.</li><li>Extensive knowledge of coding languages and systems.</li><li>Expertise in developing front-end UX using CSS3, HTML5, and Bootstrap, and delivering content from MSSQL via Ruby on Rails.</li><li>Strong understanding of design, testing, and modification of programs and applications.</li><li>Proficiency in the technologies, coding, and programming languages used in the organization.</li><li>Proven experience in writing high-quality code to solve complex business problems and automate processes.</li><li>Excellent problem-solving and analytical skills.</li><li>Strong organizational skills and attention to detail.</li><li>Effective time management skills.</li><li>Proficiency with Microsoft Office Suite and related software.</li>,<h3>Here are some of the perks we offer you:</h3><li>Salary in USD</li><li>Long-term</li><li>Flexible schedule (within US Time zones)</li><li>100% Remote</li><div><b style=\"font-size: 24px\">Hey, you are still here!</b><span style=\"font-size: 24px\">&nbsp;</span></div><div><br></div><div>So, let us ask a few questions. Do you like working in a friendly environment? Are you fluent in English? Do you have a strong work ethic, are detail-oriented and have an ownership mentality? And most importantly do you love music and puppies? If so, then what are you waiting for? Come join our team and become part of this awesome company! We will be expecting you.</div>","tags":"[\"management\",\"database\"]","pubDate":"2024-08-05 15:55:49.344","link":"https://jobs.lever.co/bluecoding/72ff027c-724c-4a32-ae9b-d1aeced78cd2","savedDate":"2024-08-06 13:37:51.253","slug":"ror-software-developer-vm-blue-coding-3824"},{"id":7943817243,"title":"Senior Python/Go Developer for Imunify (worldwide, remote)","company":"CloudLinux","image":"https://pbs.twimg.com/profile_images/696718028084482050/ymY3OEPk_400x400.png","description":"<p>CloudLinux is a global remote-first company. We are driven by our principles: do the right thing, employees first, we are remote first, and we deliver high volume, low-cost Linux infrastructure and security products that help companies to increase the efficiency of their operations. Every person in our team supports each other and does what we can to ensure we all are successful. </p><p>We are looking for a talented Senior Python/Go Developer to join our dynamic team at Imunify. You will have the opportunity to work on cutting-edge projects that are pushing the boundaries of enterprise cyber security applications. As a Senior Python/Go Developer, you will be given the chance to grow and thrive through engaging leadership programs and challenging assignments.</p><p>Imunify Security Suite is our innovative security solution designed specifically for shared and VPS/Dedicated servers. The automated, easy-to-use solution with the six-layer approach to security delivers comprehensive and complete attack prevention. </p><p>Check out our website for more information about our Imunify Product <a href=\"https://www.imunify360.com/\" target=\"_blank\" rel=\"nofollow noreferrer noopener\" class=\"external\">https://www.imunify360.com/</a></p><p></p><p><strong>Join our team as a Senior Python/Go Developer and take on exciting challenges: </strong></p><ul> <li>Be involved in the development of Imunify360 products using Python.</li> <li>Be involved in the porting of Python code to Golang.</li> <li>Cover your code with unit tests and/or functional tests.</li> <li>Review of code written by your colleagues using Gerrit.</li> <li>Architecture development and writing technical documentation for new features.</li> <li>Investigating issues reported by our clients, partners, or support team.</li> </ul><h3>Requirements: </h3><p><a href=\"https://cloudlinux.com/privacy-policy\" rel=\"nofollow noreferrer noopener\" class=\"external\"></a><strong>To thrive in this role, we are looking for someone who has:</strong></p><ul> <li>3+ years of Python programming experience</li> <li>Experience in GoLang or willing to learn it </li> <li>Experience in system programming: sockets, filesystem, process management</li> <li>Proven experience working with Linux</li> <li>Intermediate level of English language</li> </ul><p></p><p><strong>It would be great if you also have:</strong></p><ul> <li>Experience with Linux server administration </li> <li>Experience with network security </li> <li>Experience with automated testing and CI/CD systems </li> <li>Knowledge about rpm/deb package management </li> </ul><p></p><p><strong>Personal skills:</strong></p><ul> <li>Fast learning, proactivity</li> <li>Strong self-motivation, driven to achieve committed milestones</li> <li>Strong prioritization skills and a flexible mindset&nbsp;</li> <li>The ability to independently analyze a task and find the right solution.</li> <li>The ability to work with vague requirements and make independent decisions</li> <li>The ability to work in a team</li> </ul><h3>Benefits: </h3><p><strong>What's in it for you?</strong></p><ul> <li>A focus on professional development</li> <li>Interesting and challenging projects</li> <li>Fully remote work with flexible working hours, that allows you to schedule your day and work from any location worldwide</li> <li>Paid 24 days of vacation per year, 10 days of national holidays, and unlimited sick leaves</li> <li>Compensation for private medical insurance </li> <li>Co-working and gym/sports reimbursement</li> <li>Budget for education</li> <li>The opportunity to receive a reward for the most innovative idea that the company can patent</li> </ul><p></p><p></p><p><em>By applying for this position, you agree with </em><a href=\"https://cloudlinux.com/privacy-policy\" rel=\"nofollow noreferrer noopener\" class=\"external\">the Cloudlinux Privacy Policy</a><a href=\"https://cloudlinux.com/privacy-policy\" rel=\"nofollow noreferrer noopener\" class=\"external\"></a><em> and give us your consent to maintain and process your personal data in this respect. Please read our Privacy Policy for more information.</em></p>","tags":"[\"management\",\"cyber security\"]","pubDate":"2024-08-05 00:00:00.000","link":"https://apply.workable.com/cloudlinux-1/j/D97FC612A0","savedDate":"2024-08-06 13:37:51.252","slug":"senior-python-go-developer-for-imunify-worldwide-remote-cloudlinux-2142"},{"id":8781281664,"title":"Senior Go Developer for Imunify (worldwide remote)","company":"CloudLinux","image":"https://pbs.twimg.com/profile_images/696718028084482050/ymY3OEPk_400x400.png","description":"<p>CloudLinux is a global remote-first company. We are driven by our principles: do the right thing, employees first, we are remote first, and we deliver high volume, low-cost Linux infrastructure and security products that help companies to increase the efficiency of their operations. Every person in our team supports each other and does what we can to ensure we all are successful. </p><p></p><p>We are looking for a talented Senior Go Developer to join our dynamic team at Imunify. You will have the opportunity to work on cutting-edge projects that are pushing the boundaries of enterprise cyber security applications. As a Senior Go Developer, you will be given the chance to grow and thrive through engaging leadership programs and challenging assignments.</p><p></p><p>Imunify Security Suite is our innovative security solution designed specifically for shared and VPS/Dedicated servers. The automated, easy-to-use solution with the six-layer approach to security delivers comprehensive and complete attack prevention. </p><p>Check out our website for more information about our Imunify Product <a href=\"https://www.imunify360.com/\" target=\"_blank\" rel=\"nofollow noreferrer noopener\" class=\"external\">https://www.imunify360.com/</a></p><p></p><p><strong>Join our team as a Senior Go Developer and take on exciting challenges: </strong></p><ul> <li>Internal services development for Imunify360</li> <li>Maintaining, refactoring, and optimization of the existing services </li> <li>Development of the new functionality </li> <li>Development and improvement of the other products written in Go</li> </ul><h3>Requirements: </h3><p><strong>To thrive in this role, we are looking for someone who has:</strong></p><ul> <li>3+ years experience in software development with Go</li> <li>5+ years of experience with Linux</li> <li>Knowledge, understanding, and ability to select and analyze the performance of classical algorithms and data structures</li> <li>Ability to write and maintain code in accordance with the Go style guide</li> <li>Experience in multithreaded programming and development of asynchronous applications</li> <li>Good understanding of the network stack and TCP / IP, HTTP in particular</li> <li>Knowledge of Go-testing and debugging tools</li> <li>Monitor deployments, application performance</li> <li>Identify and troubleshoot emerging issues; optimize the application for performance and scalability</li> <li>Ability to patch any upstream solution written on Go</li> <li>Knowledge of Git</li> <li>Good Linux / Unix proficiency: experience with RHEL/CentOS/Almalinux</li> <li>Experience with Shell scripting</li> <li>Teamwork skills</li> <li>Ability to read and understand someone else's code</li> <li>Good English level, ability to read technical documentation </li> </ul><p></p><p><strong>It would be great if you also have:</strong></p><ul> <li>Experience with WAF, particularly ModSecurity</li> <li>Good knowledge and understanding of Nginx/Apache architecture for the development of additional components changing the main behavior Experience in system programming </li> <li>Knowledge of Python, C/C++ or any other programming language</li> <li>Experience in open-source projects</li> <li>Knowledge of Internet security basics</li> <li>Knowledge and ability to select suitable data serialization algorithms</li> <li>Familiarity with embedded databases (storage engines) BoltDB, LevelDB, and/or others</li> <li>Integration with C code and libraries</li> </ul><p></p><h3>Benefits: </h3><p><strong>What's in it for you?</strong></p><ul> <li>A focus on professional development</li> <li>Interesting and challenging projects</li> <li>Fully remote work with flexible working hours, that allows you to schedule your day and work from any location worldwide</li> <li>Paid 24 days of vacation per year, 10 days of national holidays, and unlimited sick leaves</li> <li>Compensation for private medical insurance </li> <li>Co-working and gym/sports reimbursement</li> <li>Budget for education</li> <li>The opportunity to receive a reward for the most innovative idea that the company can patent</li> </ul><p></p><p><em>By applying for this position, you agree with </em><a href=\"https://cloudlinux.com/privacy-policy%20\" rel=\"nofollow noreferrer noopener\" class=\"external\">the Cloudlinux Privacy Policy</a><a href=\"https://cloudlinux.com/privacy-policy\" rel=\"nofollow noreferrer noopener\" class=\"external\"></a><em> and give us your consent to maintain and process your personal data in this respect. Please read our Privacy Policy for more information.</em></p>","tags":"[\"cyber security\",\"database\"]","pubDate":"2024-08-05 00:00:00.000","link":"https://apply.workable.com/cloudlinux-1/j/6DA528B050","savedDate":"2024-08-06 13:37:51.252","slug":"senior-go-developer-for-imunify-worldwide-remote-cloudlinux-2905"},{"id":6576612323,"title":"Freelance Writer","company":"IAPWE","image":"https://remotive.com/job/1185979/logo","description":"<p class=\"p1\" style=\"font-variant-numeric: normal; font-variant-east-asian: normal; font-stretch: normal; line-height: normal; color: #000000;\">Our organization is seeking content writers to create articles and blog posts on a variety of topics.</p>\n<p class=\"p1\" style=\"font-variant-numeric: normal; font-variant-east-asian: normal; font-stretch: normal; line-height: normal; color: #000000;\"> </p>\n<p class=\"p1\" style=\"font-variant-numeric: normal; font-variant-east-asian: normal; font-stretch: normal; line-height: normal; color: #000000;\">The rate of pay is $20 per 100 words (this comes out to approximately $100 per article or $50 per hour).</p>\n<p> </p>\n<p class=\"p1\" style=\"font-variant-numeric: normal; font-variant-east-asian: normal; font-stretch: normal; line-height: normal; color: #000000;\">Some topics you may be asked to write about include the following (you can always turn down a topic if you do not feel comfortable writing about it, however if you have experience or expertise in a specific area, please let us know):</p>\n<p> </p>\n<ul class=\"ul1\" style=\"\">\n<li class=\"li1\" style=\"\">Health &amp; beauty</li>\n<li class=\"li1\" style=\"\">Fitness</li>\n<li class=\"li1\" style=\"\">Home Decor</li>\n<li class=\"li1\" style=\"\">Fashion</li>\n<li class=\"li1\" style=\"\">Sports</li>\n<li class=\"li1\" style=\"\">Do it yourself</li>\n<li class=\"li1\" style=\"\">Finance</li>\n<li class=\"li1\" style=\"\">Legal</li>\n<li class=\"li1\" style=\"\">Medical</li>\n<li class=\"li1\" style=\"\">Family/Parenting</li>\n<li class=\"li1\" style=\"\">Relationships</li>\n<li class=\"li1\" style=\"\">Real Estate</li>\n<li class=\"li1\" style=\"\">Restaurants</li>\n<li class=\"li1\" style=\"\">Contracting (plumbing, pool building, remodeling, etc.)</li>\n</ul>\n<p> </p>\n<p><span style=\"color: #000000;\">These are just some of the more general industries and topics that we cover.</span></p>\n<p> </p>\n<p><span style=\"font-weight: 600; color: #000000; letter-spacing: 0.75px;\">Requirements</span><span style=\"color: #000000;\">:</span></p>\n<ul style=\"\">\n<li style=\"\">We ask that all work be completed using a word processor such as Microsoft Word or Open Office</li>\n<li style=\"\">A reliable internet connection and the ability to meet deadlines</li>\n<li style=\"\">Good communication skills and respond in a timely manner to editorial staff when they ask for updates on tasks, etc</li>\n<li style=\"\">Work well as a team member with the rest of our content management and editorial staff</li>\n</ul>\n<p><br><br><em><strong>Note</strong>: Applicants to this job signaled that accessing some writing tasks may require payment.</em></p>\n<img src=\"https://remotive.com/job/track/1185979/blank.gif?source=public_api\" alt=\"\"/>","tags":"[\"REST\"]","pubDate":"2024-08-04 11:30:33.000","link":"https://remotive.com/remote-jobs/writing/freelance-writer-1185979","savedDate":"2024-08-06 13:37:51.249","slug":"freelance-writer-iapwe-8318"},{"id":4393480364,"title":"Senior Software Engineer, Backend","company":"Tactic","image":"https://remotive.com/job/1928556/logo","description":"<p><span style=\"font-weight: 600; color: #000000; letter-spacing: 0.75px;\">About Us</span></p>\n<p>Join our fast-paced startup environment where we craft clean, elegant code and simplify the complex. We are a dynamic team dedicated to innovation and excellence, and we’re looking for a talented Senior Software Engineer who specializes in and enjoys working in Go to help us build scalable and efficient software solutions.</p>\n<p><span style=\"font-weight: 600; color: #000000; letter-spacing: 0.75px;\"> </span></p>\n<p><span style=\"font-weight: 600; color: #000000; letter-spacing: 0.75px;\">Job Summary</span></p>\n<p>We are seeking a Senior Software Engineer with extensive experience in Go to join our team. The ideal candidate will excel in developing and maintaining high-quality software applications and collaborating effectively with cross-functional teams. If you have a passion for coding in Go, a knack for solving complex problems, and experience working in a startup environment, we want to hear from you.</p>\n<p> </p>\n<p><span style=\"font-weight: 600; color: #000000; letter-spacing: 0.75px;\">Responsibilities</span></p>\n<ul style=\"\">\n<li style=\"\">Design, develop, and maintain high-quality software solutions using Golang and SQL.</li>\n<li style=\"\">Implement secure, scalable, and efficient software applications.</li>\n<li style=\"\">Collaborate with cross-functional teams to understand business requirements and translate them into technical solutions.</li>\n<li style=\"\">Perform code reviews to ensure adherence to best practices and maintain high code quality.</li>\n<li style=\"\">Troubleshoot and resolve technical issues promptly.</li>\n<li style=\"\">Continuously research and implement industry best practices to enhance our development processes.</li>\n<li style=\"\">Mentor and coach junior developers, fostering a culture of continuous learning.</li>\n<li style=\"\">Stay updated with the latest trends and technologies in software development.</li>\n</ul>\n<p> </p>\n<p><span style=\"font-weight: 600; color: #000000; letter-spacing: 0.75px;\">Qualifications</span></p>\n<ul style=\"\">\n<li style=\"\">7+ years of experience in software development, with a focus on Go and SQL.</li>\n<li style=\"\">Strong proficiency in the Go programming language and SQL databases.</li>\n<li style=\"\">Experience with NodeJS and C# .NET highly desired.</li>\n</ul>\n<ul style=\"\">\n<li style=\"\">Experience in designing and implementing secure, scalable software solutions.</li>\n<li style=\"\">Experience with REST API-based design.</li>\n<li style=\"\">Excellent problem-solving skills and keen attention to detail.</li>\n<li style=\"\">Ability to work both independently and as part of a team.</li>\n<li style=\"\">Strong communication and interpersonal skills.</li>\n<li style=\"\">Experience with Agile development methodologies.</li>\n<li style=\"\">Bachelor's or Master's degree in Computer Science or equivalent experience.</li>\n</ul>\n<p> </p>\n<p><span style=\"font-weight: 600; color: #000000; letter-spacing: 0.75px;\">Nice to Have</span></p>\n<ul style=\"\">\n<li style=\"\">Knowledge of AWS.</li>\n<li style=\"\">Full stack experience.</li>\n</ul>\n<p> </p>\n<p><span style=\"font-weight: 600; color: #000000; letter-spacing: 0.75px;\">Why Join Us</span></p>\n<ul style=\"\">\n<li style=\"\">Be a key early member of a dynamic and innovative team.</li>\n<li style=\"\">Work in a collaborative environment where your ideas matter.</li>\n<li style=\"\">Opportunities for professional growth and development.</li>\n<li style=\"\">Seed stage equity offers.</li>\n</ul>\n<p> </p>\n<p>Tactic allows engineers to work remotely, and this role could work anywhere provided sufficient overlap with Tactic HQ based in Lehi, UT USA Mountain Time zone (GMT-6). Please provide us with your available working hours during Mountain Time when applying for this role.</p>\n<img src=\"https://remotive.com/job/track/1928556/blank.gif?source=public_api\" alt=\"\"/>","tags":"[\".Net\",\"api\",\"AWS\",\"backend\",\"C\",\"C#\",\"excel\",\"fullstack\",\"go\",\"golang\",\"node.js\",\"sql\",\"agile\",\"research\",\"startup\",\"computer science\",\"REST\"]","pubDate":"2024-08-04 10:02:15.000","link":"https://remotive.com/remote-jobs/software-dev/senior-software-engineer-backend-1928556","savedDate":"2024-08-06 13:37:51.250","slug":"senior-software-engineer-backend-tactic-439"}]