[{"id":6273460272,"title":"Legal Counsel II","company":"BioRender","image":"https://yt3.googleusercontent.com/8szApiN8P0n8pp0GeXj_z9R4Wh1gJBGW5OJZDocvTtvuCF69U0Q4h2lXDct74mL2_F7vuUwKMA","description":"<p style=\"min-height:1.5em\">At BioRender, our mission is to accelerate the world’s ability to learn, discover and communicate science. We are passionate about democratizing science communication in order to accelerate scientific discovery and understanding. We're looking for amazing people to help create the world’s go-to-place and platform where science is communicated. Come join us!</p><p style=\"min-height:1.5em\"></p><p style=\"min-height:1.5em\">As our <strong>Legal Counsel II</strong> you will provide legal support to the company by offering recommendations on best practices in areas such as intellectual property, including copyright and trademark protection for company icons and branding. Additionally, ensure compliance with global data privacy and data protection regulations, while supporting product development, particularly in the use of data for AI/ML features, and addressing general legal matters. Further, deliver comprehensive legal assistance for Go-To-Market and commercial activities, negotiating and closing various SaaS-related agreements, such as MSAs, DPAs, order forms, and security exhibits, leveraging experience with Fortune 500 companies and global universities.</p><p style=\"min-height:1.5em\"></p><p style=\"min-height:1.5em\"><strong>What you'll be doing:</strong></p><ul style=\"min-height:1.5em\"><li><p style=\"min-height:1.5em\">Facilitate Go-To-Market (GTM) deal closings and renewals with prompt legal review and support, enabling the Director of Legal to focus on strategic company objectives, within the first 4 weeks.</p></li><li><p style=\"min-height:1.5em\">Oversee legal operational matters, including administering our IronClad platform, collaborating with the Deal Desk lead, coordinating contract signatures, and managing vendor review requests within the first 2 months.</p></li><li><p style=\"min-height:1.5em\">Serve as the go-to legal expert for intellectual property (IP), privacy, GTM, and product support, providing key insights and guidance across these critical areas.</p></li><li><p style=\"min-height:1.5em\">Analyze, update, and optimize the legal playbook, specifically focusing on licensing, agreement negotiation, and other key policies, within the first 3 months.</p></li><li><p style=\"min-height:1.5em\">Offer broad legal support across all company departments, including security, corporate, employment, and engineering, ensuring comprehensive legal coverage as needed.</p></li></ul><p style=\"min-height:1.5em\"></p><p style=\"min-height:1.5em\"><strong>Responsible for:</strong> </p><ol style=\"min-height:1.5em\"><li><p style=\"min-height:1.5em\">Intellectual Property:  Advise and provide best practices on IP matters, particularly with copyrights, brand protection and proactive measures for marketplace monitoring and enforcement of BioRender IP. </p></li><li><p style=\"min-height:1.5em\">Commercial:  Provide contract review support for new and renewal deals, including contract drafting and negotiation of NDA’s, SSA’s, DPA’s and review of order confirmations and quotes and any customer-provided paperwork.  </p></li><li><p style=\"min-height:1.5em\">Privacy:  Identify and resolve gaps in our global data privacy compliance requirements. </p></li><li><p style=\"min-height:1.5em\">Procurement:  Provide contract support for procurement requests for new and existing vendors, including contract negotiation of NDA’s, MSA’s, DPA’s and review of vendor order forms and other vendor-provided paperwork. </p></li><li><p style=\"min-height:1.5em\">Contracts:  Maintain our contract management system (IronClad) and assist with contract intake and repository management, including obligation tracking. Coordinate signatures in Docusign for all documents requiring signatures.</p></li><li><p style=\"min-height:1.5em\">Legal Support: Provide assistance to our Customer Experience team by addressing licensing inquiries and responding to ad hoc legal matters.</p></li><li><p style=\"min-height:1.5em\">Corporate:  Assist with maintaining our corporate organizational documents and assist with general corporate legal matters including equity administration and other duties, as needed. </p></li><li><p style=\"min-height:1.5em\">Enablement:  Provide enablement/training for new Sales, CS and CX members on legal processes.  Maintain and build out our internal Legal resource pages in Notion.</p></li><li><p style=\"min-height:1.5em\">Legal Operations:  Identify and provide solutions for any inefficiencies or gaps with our legal processes and provide solutions.  </p></li><li><p style=\"min-height:1.5em\">Collaboration:  Collaborate with cross-functional teams on various projects and initiatives.    </p></li></ol><p style=\"min-height:1.5em\"></p><p style=\"min-height:1.5em\"><strong>What we value:</strong></p><ul style=\"min-height:1.5em\"><li><p style=\"min-height:1.5em\">5-10 years (Attorney) of in-house SaaS legal experience, particularly with IP, Commercial and Procurement support, Privacy, Product counseling.  </p></li><li><p style=\"min-height:1.5em\">Has strong personal success as a cross-functional team player</p></li><li><p style=\"min-height:1.5em\">US or Canada-based with global experience.</p></li></ul><p style=\"min-height:1.5em\"></p><p style=\"min-height:1.5em\"><em>Note: We recognize that career paths vary, and your unique journey may have equipped you with the necessary skills even if you don’t meet all of the criteria above. If you believe you have what it takes to excel in this role, we encourage you to apply!</em></p><p style=\"min-height:1.5em\"></p><p style=\"min-height:1.5em\"><strong>Why Join Us?</strong></p><ul style=\"min-height:1.5em\"><li><p style=\"min-height:1.5em\"> We are mission-driven, and work collaboratively towards our shared vision of improving scientific communication and accelerating scientific discovery: BioRender figures have appeared in more than 54,000 publications! </p></li><li><p style=\"min-height:1.5em\">It’s a product that users love! We have a world-class NPS and a community of loyal fans. Check out our Testimonials page to see what our customers are saying about us: <a target=\"_blank\" rel=\"noopener noreferrer nofollow\" href=\"https://biorender.com/testimonials/\">https://biorender.com/testimonials/</a> </p></li><li><p style=\"min-height:1.5em\">We are in the top quartile for profitability and year-over-year revenue growth, with users in 200+ countries.</p></li><li><p style=\"min-height:1.5em\">BioRender is an equal opportunity employer, and an inclusive hiring process and work environment is a part of our DNA. </p></li><li><p style=\"min-height:1.5em\">We’re remote-first and have team members across Canada and the United States. A physical office in Toronto is available, but you have the flexibility to work from anywhere. </p></li><li><p style=\"min-height:1.5em\">We’re backed by top investors, accelerators, and some of the most successful life science entrepreneurs and philanthropists in the world including Y Combinator, Malala Fund founders, and Fifty Years VC. </p></li><li><p style=\"min-height:1.5em\">We’re proud that women make up 2 of 3 co-founders, 53% of our team, and 37% of leadership. This representation continues to grow and we are hiring!</p></li><li><p style=\"min-height:1.5em\">We are committed to building a warm, inclusive, and diverse environment. Check out how we make sure <a target=\"_blank\" rel=\"noopener noreferrer nofollow\" class=\"postings-link\" href=\"https://careers.biorender.com/\"><u>our employees come first</u></a>.</p></li></ul><p style=\"min-height:1.5em\"></p><p style=\"min-height:1.5em\">BioRender is an equal opportunity employer and as such does not discriminate on the basis of race, colour, religion, sex, national origins, age, sexual orientation, disability or any other characteristic protected by applicable laws.  Selection decisions are solely based on job-related factors.</p><p style=\"min-height:1.5em\"></p><p style=\"min-height:1.5em\">You can read more about the <a target=\"_blank\" rel=\"noopener noreferrer nofollow\" class=\"postings-link\" href=\"https://biorender.notion.site/BioRender-Candidate-Resources-8255c155797f442a950720a33b4764d5\"><u>BioRender interview process and FAQs here</u></a>!</p><p style=\"min-height:1.5em\">Check out what it's like to work at BioRender in <a target=\"_blank\" rel=\"noopener noreferrer\" class=\"postings-link\" href=\"https://biorender.notion.site/biorender/Working-at-BioRender-as-a-Canada-Based-Employee-f6e12ab844154bb9948b22b32e3f0c70\">Canada</a> and the <a target=\"_blank\" rel=\"noopener noreferrer\" class=\"postings-link\" href=\"https://biorender.notion.site/biorender/Working-at-BioRender-as-a-U-S-Based-Employee-4ab2cc8e48f546f89aa98c318bccebc9\">US</a>!</p>","tags":"[\"management\",\"engineering\",\"B2C\",\"legal\",\"aws\"]","pubDate":"2024-09-16 04:49:58.350","link":"https://jobs.ashbyhq.com/biorender/53d6c60d-af5d-453b-b421-de52c8269e26","savedDate":"2024-09-16 04:49:58.350","slug":"legal-counsel-ii-biorender-5080"},{"id":2959058954,"title":"Business Development Representative","company":"BioRender","image":"https://yt3.googleusercontent.com/8szApiN8P0n8pp0GeXj_z9R4Wh1gJBGW5OJZDocvTtvuCF69U0Q4h2lXDct74mL2_F7vuUwKMA","description":"<p style=\"min-height:1.5em\"></p><p style=\"min-height:1.5em\">At BioRender, our mission is to accelerate the world’s ability to learn, discover and communicate science. We are passionate about democratizing science communication in order to accelerate scientific discovery and understanding. We're looking for amazing people to help create the world’s go-to-place and platform where science is communicated. Come join us!</p><p style=\"min-height:1.5em\"></p><p style=\"min-height:1.5em\">We are looking for a passionate and motivated Business Development Representative with a love for selling and a tenacious and methodical approach to prospecting and developing new business opportunities. </p><p style=\"min-height:1.5em\"></p><p style=\"min-height:1.5em\"><strong>This role is remote-friendly within Greater Boston</strong>.</p><p></p><p style=\"min-height:1.5em\"></p><p style=\"min-height:1.5em\"><strong>You will be successful in this role with</strong></p><p></p><ul style=\"min-height:1.5em\"><li><p style=\"min-height:1.5em\"><strong>Exceptional customer curiosity: </strong>You have a genuine interest in learning about the clients we serve, their goals, and their science communication pain points. You are curious, love asking questions, and can think outside of the box.</p></li><li><p style=\"min-height:1.5em\"><strong>A continuous improvement approach: </strong>You have a growth mindset and you’re open to coaching and continuous feedback. You are able to thrive in a fast-paced and collaborative environment with changing goals and priorities.</p></li><li><p style=\"min-height:1.5em\"><strong>A self-starter attitude: </strong>You are self-motivated, resourceful, and know how to hustle.</p></li></ul><p style=\"min-height:1.5em\"></p><p style=\"min-height:1.5em\"><strong>Your responsibilities</strong></p><p></p><ul style=\"min-height:1.5em\"><li><p style=\"min-height:1.5em\">Prospect new leads (outbound) and create amazing first impressions with potential customers and partners while building pipeline for account executives and senior management</p></li><li><p style=\"min-height:1.5em\">Follow up and qualify inbound requests via telephone and email, for scientific and business fit</p></li><li><p style=\"min-height:1.5em\">Organize, categorize, and prioritize sales leads in CRM and measure lead conversion and performance against quota</p></li><li><p style=\"min-height:1.5em\">Become an expert in the features, benefits and application of BioRender’s software</p></li><li><p style=\"min-height:1.5em\">Leverage prospecting tools to research companies and identify key stakeholders at new accounts</p></li><li><p style=\"min-height:1.5em\">Develop customized pitches for different target accounts and personas</p></li><li><p style=\"min-height:1.5em\">Work with Account Executives to drive outbound prospecting activities, including cold calling, emailing, and communicating our value proposition to decision-makers</p></li><li><p style=\"min-height:1.5em\">Work with the field marketing and sales teams to drive attendance at BioRender field events such as executive dinners and happy hours</p></li></ul><p style=\"min-height:1.5em\"></p><p style=\"min-height:1.5em\"><strong>What you bring to the table</strong></p><p></p><ul style=\"min-height:1.5em\"><li><p style=\"min-height:1.5em\">1+ year of prior experience as a BDR in a SaaS environment</p></li><li><p style=\"min-height:1.5em\">Strong verbal and written communication skills</p></li><li><p style=\"min-height:1.5em\">Not afraid to pick up the phone and cold call</p></li><li><p style=\"min-height:1.5em\">Strong self-motivation and willingness to go beyond strict job responsibilities</p></li><li><p style=\"min-height:1.5em\">Committed to meet/exceed goals with a proven history of consistent high achievement Bachelor of Science degree or equivalent is a plus (e.g. within the fields of life science including biology, biotechnology, biomedical engineering, biochemistry, etc)</p></li></ul><p style=\"min-height:1.5em\"></p><p style=\"min-height:1.5em\"><strong>What you can expect from our interview process</strong></p><p></p><ul style=\"min-height:1.5em\"><li><p style=\"min-height:1.5em\"><strong>Introductory call: </strong>We will set up a 20-30 minute phone call with one of our recruiters, during which you’ll have the opportunity to share more about your experience and interests. </p></li><li><p style=\"min-height:1.5em\"><strong>Hiring Manager interview</strong>: You will meet with one of our Business Development Managers, Michael Litwin or Paige Anderson. You’ll learn more about BioRender and the team you’re interviewing with. Feel free to ask any questions throughout these calls!</p></li><li><p style=\"min-height:1.5em\"><strong>Practical interview: </strong>You’ll be completing a practical exercise so we can see your skills in action and give you a realistic role preview. This exercise will be conducted with our BD Manager.</p></li><li><p style=\"min-height:1.5em\"><strong>Meet the team: </strong>Throughout our interview process, you can expect to meet with some of your potential colleagues.</p></li></ul><p style=\"min-height:1.5em\"></p><p style=\"min-height:1.5em\"><strong>Why join us?</strong></p><p></p><ul style=\"min-height:1.5em\"><li><p style=\"min-height:1.5em\">We are mission-driven, and work collaboratively towards our shared vision of improving scientific communication and accelerating scientific discovery: BioRender figures have appeared in more than 16,000 publications! </p></li><li><p style=\"min-height:1.5em\">It’s a product that users love! We have a world-class NPS and a community of loyal fans. Check out our Testimonials page to see what our customers are saying about us: <a target=\"_blank\" rel=\"noopener noreferrer\" class=\"postings-link\" href=\"https://biorender.com/testimonials/\">https://biorender.com/testimonials/ </a></p></li><li><p style=\"min-height:1.5em\">We are in the top quartile for profitability and year-over-year revenue growth, with users in 200+ countries.</p></li><li><p style=\"min-height:1.5em\">BioRender is an equal opportunity employer, and an inclusive hiring process and work environment is a part of our DNA. </p></li><li><p style=\"min-height:1.5em\">We’re remote-first and have team members across Canada and the United States. A physical office in Toronto is available, but you have the flexibility to work from anywhere. </p></li><li><p style=\"min-height:1.5em\">We’re backed by top investors, accelerators, and some of the most successful life science entrepreneurs and philanthropists in the world including Y Combinator, Malala Fund founders, and Fifty Years VC. </p></li><li><p style=\"min-height:1.5em\">We are committed to building a warm, inclusive, and diverse environment. Check out how we make sure our <a target=\"_blank\" rel=\"noopener noreferrer\" class=\"postings-link\" href=\"https://www.biorender.com/biorender-careers\">employees come first</a>.</p></li></ul><p style=\"min-height:1.5em\"></p><p style=\"min-height:1.5em\">You can read more about the <a target=\"_blank\" rel=\"noopener noreferrer\" class=\"postings-link\" href=\"https://biorender.notion.site/BioRender-Candidate-Resources-8255c155797f442a950720a33b4764d5\">BioRender interview process and FAQs here</a>!</p><p></p>","tags":"[\"management\",\"engineering\"]","pubDate":"2024-09-16 04:49:58.349","link":"https://jobs.ashbyhq.com/biorender/9466c8d4-4837-4d89-b7e3-a9c32db88f1d","savedDate":"2024-09-16 04:49:58.349","slug":"business-development-representative-biorender-5938"},{"id":3493837143,"title":"Linux Kernel Developer - Drivers (Remote/Anywhere)","company":"Collabora","image":"https://media.licdn.com/dms/image/D4E0BAQFdRsd49YG4fQ/company-logo_200_200/0/1688735422027/collabora_logo?e=2147483647&v=beta&t=COQKgdesE_abHpZN-7BjhNZ1IKm2nhQyHB637TbP88E","description":"<div class=\"section page-centered\" data-qa=\"job-description\"><div>Collabora  is currently looking for a very technically capable, enthusiastic and  passionate Linux Kernel Software Developer to join its ever growing  engineering team.</div><div><br></div><div>As  a member of the Kernel team, your primary focus will be to participate  in the development, integration, validation and deployment of Linux  board support packages and kernel device drivers, configuring kernels,  troubleshooting functional and performance problems for different  customers’ projects and products and participating in the mainline Linux  with code contributions, reviews and discussions.</div></div><div class=\"section page-centered\"><div><h3>Key Responsibilities</h3><ul class=\"posting-requirements plain-list\"><ul><li>Discuss  Linux core system technologies with clients and represent Collabora at  conferences and trade shows to demonstrate and promote our leadership in  the open source arena</li><li>Analyze client problems and design solutions leveraging open source technologies and Collabora's technical expertise</li><li>Define and scope client projects in collaboration with the delivery team</li><li>Contribute publicly to open source projects to further strengthen Collabora's technical leadership</li><li>Gain working knowledge of customers’ products, applications, technical and business strengths and target markets</li><li>Understand client needs and reconciling time constraints, available technologies and resources, and open source best practices</li></ul></ul></div></div><div class=\"section page-centered\"><div><h3>Desired Skills</h3><ul class=\"posting-requirements plain-list\"><ul><li>Linux kernel and kernel module development</li><li>Linux driver development</li><li>Cross-compiling and porting</li><li>Understanding  of open source development methodology and practices as well as prior  experience/contributions with/to the Open Source Linux Kernel community</li><li>Linux distribution package development/management (Debian, Yocto...) is a nice to have</li><li>Exposure to Continuous Integration environments (GitLab, <a rel=\"noopener noreferrer\" class=\"postings-link\" href=\"http://kernelci.org\">kernelci.org</a>...) is a plus</li><li>Self  learning skill to get sufficient knowledge of Collabora's services,  busines model, project delivery life cycle and other related technical  domains</li><li>Good English language skills (both verbal and written)</li><li>Ability to work and communicate in an online fully distributed environment</li></ul></ul></div></div><div class=\"section page-centered\" data-qa=\"closing-description\"><div>Collabora  is a software consultancy specializing in bringing companies and the  Open Source community together. We combine years of Open Source software  leadership with an understanding of the challenges that businesses,  non-profits, and governments face. Collabora brings deep technical  expertise in system integration &amp; architecture, graphics,  multimedia, web engines and communications to a number of market  verticals, including mobile, IVI / automotive, set top box / smart TV,  and a range of other specialized embedded applications.</div><div><br></div><div>Collabora  has the unique business model of enabling enterprises to leverage Open  Source software in their solutions. Having worked with notable industry  leading companies in the automotive, aerospace and handset mobile  verticals amongst many others, Collabora has established a broad  customer portfolio.</div><div><br></div><div>#LI-Remote</div></div><div class=\"section page-centered last-section-apply\" data-qa=\"btn-apply-bottom\"><a class=\"postings-btn template-btn-submit hex-color\" data-qa=\"show-page-apply\" href=\"https://jobs.lever.co/collabora/477381bb-3cce-414c-ad07-982c004ac5ba/apply\">Apply for this job</a></div>","tags":"[\"management\",\"engineering\"]","pubDate":"2024-09-16 04:49:58.344","link":"https://jobs.lever.co/collabora/477381bb-3cce-414c-ad07-982c004ac5ba","savedDate":"2024-09-16 04:49:58.344","slug":"linux-kernel-developer-drivers-remote-anywhere-collabora-3019"},{"id":2094948978,"title":"Senior Data Analyst (Remote)","company":"MixRank","image":"https://pbs.twimg.com/profile_images/378800000147745937/0fac42c12b433bbbd53ff3e15cd6fca4_400x400.png","description":"<p><strong>Who We Are</strong><br>\nMixRank is a YC-backed, profitable Data-as-a-Service (DaaS) company, founded in 2011. We manage over 3 petabytes of data monthly and are focused on building something meaningful and sustainable for the long term. Our globally distributed team of over 40 remote professionals is committed to continuous learning, steady growth, and making a lasting impact. We’re proud of our decade-long journey of growth and profitability. Our customers include some of the world's largest sales platforms, recruitment solutions, venture capital firms, and private equity companies, as well as cutting-edge startups from Y Combinator.<br>\n<br>\n<strong>Who We're Looking For</strong><br>\nWe're seeking an experienced <strong>Senior Data Analyst</strong> to join our team, who can not only excel in data analysis but also take ownership of customer relationships. In this role, you'll operate as an independent contributor, working directly with enterprise clients to provide data insights while also managing all aspects of the client relationship—much like a Customer Success Manager. You’ll ensure clients achieve their business goals using our data products and build long-term partnerships with them.<br>\n<br>\n<strong>Key Qualifications</strong></p>\n<ul>\n<li>5+ years of experience as a Data Analyst, with a demonstrated ability to work independently and manage end-to-end data projects.</li>\n<li>Previous experience in a Customer Success, Account Management, or related role, with a focus on managing enterprise client relationships.</li>\n<li>Strong proficiency in SQL, data visualization tools, and experience working with large datasets.</li>\n<li>Excellent communication skills, with the ability to explain data-driven insights to both technical and non-technical stakeholders.</li>\n<li>Proven ability to manage multiple projects, prioritize tasks, and deliver high-quality results in a remote, fast-paced environment.</li>\n<li>Self-starter with a strong sense of ownership and accountability, comfortable working independently.</li>\n</ul>\n<p><strong>What You’ll Be Doing</strong></p>\n<ul>\n<li><strong>Independent Data Analysis:</strong> Work closely with enterprise clients to gather requirements, analyze large datasets, and deliver actionable insights that help them achieve their business objectives.</li>\n<li><strong>Customer Success:</strong> Take full responsibility for the success of your clients. Act as the primary point of contact for all client communication, ensuring they maximize the value of our data products. Handle support requests, escalations, and proactively engage with clients to anticipate their needs.</li>\n<li><strong>Client Relationship Management:</strong> Build and maintain strong client relationships, acting as a trusted advisor. Ensure customers are satisfied and help them get the most out of our data services.</li>\n<li><strong>Project Management:</strong> Oversee the lifecycle of data projects, ensuring timely delivery, clear communication, and successful outcomes for the client.</li>\n<li><strong>Cross-functional Collaboration:</strong> Work closely with product, engineering, and other internal teams to align our data solutions with client needs, offering feedback and insights to drive improvements.</li>\n</ul>\n<p><strong>Opportunities for Growth</strong><br>\nAs you excel in this role, you will have the opportunity to <strong>build and lead a team of data analysts</strong> and customer success professionals. You’ll mentor junior team members and play a crucial role in expanding the data and customer success functions as we continue to grow.</p>\n<p><strong>What’s In It for You</strong></p>\n<ul>\n<li><strong>100% Remote Work:</strong> Work from anywhere, anytime. We value results, not the hours you clock, and trust you to manage your time effectively.</li>\n<li><strong>Home-office Setup:</strong> We provide a Remote Office Grant to ensure you have a comfortable, productive workspace.</li>\n<li><strong>Comprehensive Health Coverage:</strong> We offer 100% health coverage and term life insurance.</li>\n<li><strong>Personal Development:</strong> Enjoy an unlimited book budget to continue learning, plus we cover Netflix and Spotify subscriptions as part of our Entertainment Allowance.</li>\n<li><strong>Flexible Leave Policy:</strong> Recharge with flexible time off, as long as you’re supporting your team and meeting expectations.</li>\n</ul>\n<p>If you're a skilled data analyst who enjoys working directly with clients and is ready to take on the dual responsibility of driving both data insights and customer success, we'd love to hear from you! Apply now and help shape the future of MixRank's data-driven customer solutions.</p>\n","tags":"[\"management\",\"engineering\"]","pubDate":"2024-09-16 04:49:58.343","link":"https://www.ycombinator.com/companies/mixrank/jobs/ACcr5Iv-senior-data-analyst-remote","savedDate":"2024-09-16 04:49:58.343","slug":"senior-data-analyst-remote-mixrank-4237"},{"id":5899101939,"title":"Web Developer","company":"Status","image":"https://avatars.githubusercontent.com/u/11767950?s=200&v=4","description":"\n    <div class=\"content-intro\"><p style=\"text-align: justify;\"><strong>About Status</strong></p>\n<p style=\"text-align: justify;\"><span style=\"font-weight: 400;\">Status is building the tools and infrastructure for the advancement of a secure, private, and open web3.&nbsp;</span></p>\n<p style=\"text-align: justify;\"><span style=\"font-weight: 400;\">With the high level goals of preserving the right to privacy, mitigating the risk of censorship, and promoting economic trade in a transparent, open manner, Status is building a community where anyone is welcome to join and contribute.</span></p>\n<p style=\"text-align: justify;\"><span style=\"font-weight: 400;\">As an organization, Status seeks to push the web3 ecosystem forward through research, creation of developer tools, and support of the open source community.&nbsp;</span></p>\n<p style=\"text-align: justify;\"><span style=\"font-weight: 400;\">As a product, Status is an open source, Ethereum-based app that gives users the power to chat, transact, and access a revolutionary world of Apps on the decentralized web. But Status is also building foundational infrastructure for the whole Ethereum ecosystem, including the Nimbus ETH 1.0 and 2.0 clients, the Keycard hardware wallet, and the Waku messaging protocol, the p2p communication layer for Web3.</span></p>\n<p style=\"text-align: justify;\"><span style=\"font-weight: 400;\">As a team, Status has been completely distributed since inception. Our team is currently 200+ core contributors strong, and welcomes a growing number of community members from all walks of life, scattered all around the globe.&nbsp;</span></p>\n<p style=\"text-align: justify;\"><span style=\"font-weight: 400;\">We care deeply about open source, and our organizational structure has minimal hierarchy and no fixed work hours. We believe in working with a high degree of autonomy while supporting the organization's priorities.</span></p></div>\n\n    <p><strong>Who are we?</strong></p>\n<p>IFT is a pioneering force in the Web3 ecosystem, committed to the development, adoption, and accessibility of solutions to digital age problems; guided by our principles: liberty, censorship resistance, security, privacy, and inclusivity. Our mission is to build public goods to safeguard civil liberties in the digital age.</p>\n<p>&nbsp;</p>\n<p><strong>The role</strong></p>\n<p>As a Web Developer at IFT, you will be responsible for As a Web Developer, you will be responsible for the development and technical maintenance of various web-based projects in the studio. Your role will involve decision-making for code architecture, writing tests, choosing the right technology stack, and any other related tasks. You will work closely with the development team, project management, studio lead, and design team to bring our web projects to life.</p>\n<p>&nbsp;</p>\n<p><strong>Key responsibilities:</strong>&nbsp;</p>\n<ul>\n<li>You will take care of all technical aspects of all web projects (from development and testing to deployment and maintenance)</li>\n<li>You will be developing and implementing websites, internal tools and our design systems implementation in React.</li>\n<li>You will co-write documentation for all the above mentioned products/projects</li>\n<li>You will be responsible for maintaining our open-sourced codebases on Github.</li>\n</ul>\n<p>&nbsp;</p>\n<p><strong>You will ideally have:&nbsp;</strong></p>\n<ul>\n<li>Proficiency in Design Tools: Extensive experience with design tools that cater to UX, UI, and micro-interactions, such as Figma and Framer.</li>\n<li>Frontend and Backend Expertise: Experience in implementation of frontend libraries and design systems (ReactJS, NextJS), and backend (NodeJs, NestJS), all in Typescript</li>\n<li>Software Architecture Knowledge: Solid understanding of software architecture principles, ensuring scalable and maintainable code.</li>\n<li>DevOps and Deployment Experience: Hands-on experience with Git, Docker, coupled with expertise in deployment platforms like Vercel.</li>\n<li>MDX-Based Content Management: Knowledgeable in managing content using MDX with Docusaurus.</li>\n<li>Experience with JAMstack: Familiarity with JAMstack architecture, including static site generators, headless CMS, and modern web technologies.</li>\n<li>Alignment with our principles: Strong alignment with our core principles: <a href=\"https://status.app/manifesto\">https://status.app/manifesto</a></li>\n</ul>\n<p>&nbsp;</p>\n<p><strong>Bonus points:&nbsp;</strong></p>\n<ul>\n<li>You are comfortable working remotely and asynchronously</li>\n<li>You have experience working for an open-source organisation</li>\n<li>You have exposure to creative coding (processing, openframeworks, WebGL, writing shaders, p5js)</li>\n</ul>\n<p><em>[Don’t worry if you don’t meet all of these criteria, we’d still love to hear from you anyway if you think you’d be a great fit for this role. Just explain to us why in your cover letter].</em></p>\n<p>&nbsp;</p>\n<p><strong>Hiring process:</strong></p>\n<ol>\n<li>Interview with our People Ops team</li>\n<li>Interview with Jerry</li>\n<li>Interview with Jinho</li>\n<li>Assessment<a href=\"https://docs.google.com/document/d/1-KCt5RPaSZ-E1h8CRJUHw8jDfAZThVombgNLdARdpds/edit\"> </a></li>\n<li>Interview with Nick</li>\n</ol>\n<p><em>The steps may change along the way if we see it makes sense to adapt the interview stages, so please consider the above as a guideline.&nbsp;</em></p>\n<p><strong><br></strong><strong>Compensation</strong></p>\n<p>We are happy to pay in any mix of fiat/crypto.</p>\n\n    \n\n    \n","tags":"[\"typescript\",\"management\"]","pubDate":"2024-09-16 04:49:58.343","link":"https://boards.greenhouse.io/embed/job_app?for=status72&token=6242476&b=https%3A%2F%2Fjobs.status.im%2F","savedDate":"2024-09-16 04:49:58.343","slug":"web-developer-status-9629"},{"id":7789988341,"title":"Linux Kernel Developer - Core Kernel (Remote/Anywhere)","company":"Collabora","image":"https://media.licdn.com/dms/image/D4E0BAQFdRsd49YG4fQ/company-logo_200_200/0/1688735422027/collabora_logo?e=2147483647&v=beta&t=COQKgdesE_abHpZN-7BjhNZ1IKm2nhQyHB637TbP88E","description":"<div class=\"section page-centered\" data-qa=\"job-description\"><div>Collabora is currently looking for a very technically capable, enthusiastic and  passionate Linux Kernel Software Developer to join its ever growing  engineering team.</div><div><br></div><div>As  a member of the Kernel team, your primary focus will be to participate  in the development and upstreaming of core kernel infrastructure such as  schedulers, real time, file systems, block layer, memory management,  system call interfaces, architecture-specific code (x86, ARM,  RISC-V)virtio and more. You will be working together with the mainline  Linux community, pushing forward the kernel core needs for different  customers’ projects and products</div></div><div class=\"section page-centered\"><div><h3>Key Responsibilities</h3><ul class=\"posting-requirements plain-list\"><ul><li>Discuss  Linux core system technologies with clients and represent Collabora at conferences and trade shows to demonstrate and promote our leadership in  the open source arena</li><li>Analyze client problems and design solutions leveraging open source technologies and Collabora's technical expertise</li><li>Define and scope client projects in collaboration with the delivery team</li><li>Contribute publicly to open source projects to further strengthen Collabora's technical leadership</li><li>Gain working knowledge of customers’ products, applications, technical and business strengths and target markets</li><li>Understand client needs and reconciling time constraints, available technologies and resources, and open source best practices</li></ul></ul></div></div><div class=\"section page-centered\"><div><h3>Desired Skills</h3><ul class=\"posting-requirements plain-list\"><ul><li>Linux kernel and kernel module development</li><li>Linux experience in one or more of the following areas: schedulers, real-time,&nbsp; filesystems, block layer, memory management, system call interfaces, architecture-specific code (x86, ARM, RISC-V), virtio, etc.</li><li>Good understanding of debugging mechanisms in the Linux kernel (ftrace, kdump, ktraces, ...)</li><li>Understanding of open source development methodology and practices as well as prior experience/contributions with/to the upstream Linux kernel community</li><li>Diligence and focus to drive development and upstream discussions that may last multiple months</li><li>Exposure to Continuous Integration environments (GitLab, <a rel=\"noopener noreferrer\" class=\"postings-link\" href=\"http://kernelci.org\">kernelci.org</a>...) is a plus</li><li>Self learning skill to get sufficient knowledge of Collabora's services, business model, project delivery life cycle and related technical domains</li><li>Good English language skills (both verbal and written)</li><li>Ability to work and communicate in an online fully distributed environment</li></ul></ul></div></div><div class=\"section page-centered\" data-qa=\"closing-description\"><div>Collabora  is a software consultancy specializing in bringing companies and the  Open Source community together. We combine years of Open Source software  leadership with an understanding of the challenges that businesses,  non-profits, and governments face. Collabora brings deep technical  expertise in system integration &amp; architecture, graphics,  multimedia, web engines and communications to a number of market  verticals, including mobile, IVI / automotive, set top box / smart TV,  and a range of other specialized embedded applications.</div><div><br></div><div>Collabora  has the unique business model of enabling enterprises to leverage Open  Source software in their solutions. Having worked with notable industry  leading companies in the automotive, aerospace and handset mobile  verticals amongst many others, Collabora has established a broad  customer portfolio.</div><div><br></div><div>#LI-Remote</div></div><div class=\"section page-centered last-section-apply\" data-qa=\"btn-apply-bottom\"><a class=\"postings-btn template-btn-submit hex-color\" data-qa=\"show-page-apply\" href=\"https://jobs.lever.co/collabora/3f822c30-d5d0-4ea0-80ac-db50aded0132/apply\">Apply for this job</a></div>","tags":"[\"management\",\"engineering\"]","pubDate":"2024-09-16 04:49:58.343","link":"https://jobs.lever.co/collabora/3f822c30-d5d0-4ea0-80ac-db50aded0132","savedDate":"2024-09-16 04:49:58.343","slug":"linux-kernel-developer-core-kernel-remote-anywhere-collabora-2165"},{"id":3840291260,"title":"Senior Fullstack Engineer","company":"Scroll","image":"https://avatars.githubusercontent.com/u/87750292?s=200&v=4","description":"&lt;div class=&quot;content-intro&quot;&gt;&lt;p&gt;Scroll is a Layer 2 scaling solution for Ethereum, specifically focusing on zkRollups. Key aspects of Scroll are zkRollup technology, Scalability, Efficiency, Security, and Developer-friendly. Overall, Scroll plays a crucial role in addressing Ethereum&#39;s scalability challenges and facilitating the growth of decentralized finance (DeFi) and other blockchain-based applications by providing a scalable and efficient Layer 2 solution.&amp;nbsp;&lt;/p&gt;&lt;/div&gt;&lt;p&gt;&lt;strong&gt;About Scroll…&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;Scroll is building an open source, bytecode level compatible zkEVM layer 2 solution for Ethereum. Our mission is to scale Ethereum while maintaining our values of credible neutrality, openness, and community driven.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;About the Team/Role&lt;/strong&gt; &lt;br&gt;&lt;br&gt;You will join a fast-paced, dynamic, and highly skilled engineering team dedicated to building one of the most cutting-edge Layer 2 solutions in the blockchain space. As a Fullstack Engineer, you’ll work at the intersection of decentralized technology and scalable applications. You’ll be responsible for contributing to the development of both the frontend and backend components of Scroll&#39;s architecture, using technologies such as React, Next.js, and Node.js. If you&#39;re passionate about Ethereum, excited about working with zkEVMs, and want to play a critical role in building the future of scalable blockchain infrastructure, this role is for you.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;What you’ll do:&lt;/strong&gt;&amp;nbsp;&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;Design, develop, and maintain the frontend and backend of Scroll&#39;s Layer 2 solution.&lt;/li&gt;\n&lt;li&gt;Collaborate closely with the product team to ensure seamless integration and feature development.&lt;/li&gt;\n&lt;li&gt;Write clean, efficient, and well-documented code that follows best practices.&lt;/li&gt;\n&lt;li&gt;Debug, troubleshoot, and optimize existing code to improve performance and scalability.&lt;/li&gt;\n&lt;li&gt;Participate in design and code reviews, and mentor junior team members.&lt;/li&gt;\n&lt;li&gt;Ensure the technical feasibility of UI/UX designs and optimize applications for maximum speed and scalability.&lt;/li&gt;\n&lt;li&gt;Contribute to the overall architecture and technical direction of the Scroll project.&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;&lt;strong&gt;What you&#39;ll need:&lt;/strong&gt;&amp;nbsp;&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;Proficiency in Fullstack development with expertise in React, Next.js, and Node.js.&lt;/li&gt;\n&lt;li&gt;Strong understanding of JavaScript, TypeScript, and modern web development tools.&lt;/li&gt;\n&lt;li&gt;Experience with building and consuming RESTful APIs and working with databases like PostgreSQL or MongoDB.&lt;/li&gt;\n&lt;li&gt;Ability to work in a collaborative team environment, using version control (Git) and modern development workflows.&lt;/li&gt;\n&lt;li&gt;Strong problem-solving skills with a focus on delivering high-quality code.&lt;/li&gt;\n&lt;li&gt;Excellent communication skills and the ability to work in a fast-paced, decentralized team.&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;&lt;strong&gt;Nice to haves:&lt;/strong&gt;&amp;nbsp;&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;Experience working in the blockchain or decentralized technology space, especially with Ethereum or Layer 2 solutions.&lt;/li&gt;\n&lt;li&gt;Prior experience working in open-source projects and contributing to decentralized communities.&lt;/li&gt;\n&lt;li&gt;Familiarity with hosting platforms like Vercel for easy and scalable deployments.&lt;/li&gt;\n&lt;li&gt;Experience with Go is a plus.&lt;/li&gt;\n&lt;li&gt;Chinese language ability is a plus.&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;&amp;nbsp;&lt;/p&gt;&lt;div class=&quot;content-conclusion&quot;&gt;&lt;h3&gt;&lt;strong&gt;About You&lt;/strong&gt;&lt;/h3&gt;\n&lt;ul&gt;\n&lt;li&gt;You are a self-starter and ability to take ownership, well organised, self-disciplined and effective when working autonomously on tasks and projects;&lt;/li&gt;\n&lt;li&gt;You are responsive, collaborative and committed person with a high work ethic;&lt;/li&gt;\n&lt;li&gt;You are a high class communicator who can articulate their views succinctly on calls or asynchronously in globally distributed, remote teams;&lt;/li&gt;\n&lt;li&gt;You relish working in an agile start-up environment;&lt;/li&gt;\n&lt;li&gt;You are a great listener who understands when to listen first and engages well with colleagues;&lt;/li&gt;\n&lt;li&gt;You are a resilient, driven individual who is willing and able to continually develop and iterate to succeed;&lt;/li&gt;\n&lt;/ul&gt;\n&lt;h3&gt;&lt;strong&gt;What We Offer&lt;/strong&gt;&lt;/h3&gt;\n&lt;ul&gt;\n&lt;li&gt;A mission-led, collaborative culture&lt;/li&gt;\n&lt;li&gt;Opportunity to work with cutting edge technology and like-minded people who are contributing to the progression of Ethereum&lt;/li&gt;\n&lt;li&gt;Competitive salary package / generous paid time off / annual growth budget&lt;/li&gt;\n&lt;li&gt;100% remote from any location with flexible hours&lt;/li&gt;\n&lt;li&gt;Home office set up / co-working membership allowance&lt;/li&gt;\n&lt;li&gt;Private healthcare in selected countries&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;&lt;em&gt;Scroll is proud to be an equal opportunity workplace. We are committed to equal employment opportunities regardless of race, color, ancestry, religion, sex, national origin, sexual orientation, age, citizenship, marital status, disability, gender identity, or Veteran status. If you have a disability or special need, please let us know and we&#39;ll do our best to accommodate.&lt;/em&gt;&lt;/p&gt;\n&lt;p&gt;&amp;nbsp;&lt;/p&gt;&lt;/div&gt;","tags":"[\"postgres\",\"javascript\",\"typescript\",\"Finance\",\"engineering\",\"database\",\"mongo\"]","pubDate":"2024-09-16 03:13:00.000","link":"https://job-boards.eu.greenhouse.io/scrollio/jobs/4392052101","savedDate":"2024-09-16 04:49:58.346","slug":"senior-fullstack-engineer-scroll-1451"},{"id":2657130851,"title":"Manager of Data Infrastructure","company":"Invisibletech","image":"https://remotive.com/job/1937119/logo","description":"<p><strong>About Invisible</strong></p>\n<p>Invisible is the operations innovation company transforming how companies are built and run.</p>\n<p>We are a tech-enabled service providing solutions to the world’s most complex business problems. Driven by our proprietary process orchestration platform, we seamlessly integrate advanced AI and automation with a global network of thousands of experts. This powerful combination delivers new capabilities and eliminates barriers to execution for our clients, unlocking unprecedented efficiency, scale, and growth opportunities.</p>\n<p>Invisible has experienced exponential growth, quadrupling in size year over year for the past three years. At the beginning of 2024, we surpassed an Annual Recurring Revenue (ARR) of $100 million and continue to grow at speed. Operating as a profitable business, we maintain near complete ownership, with a firm foundation built on creating long-term shareholder value. We are excited to offer substantial equity compensation as part of our commitment to our team, presenting life-changing opportunities for our partners.</p>\n<p> </p>\n<p><strong>About The Role</strong></p>\n<p>The Sr Analytics Associate will play a pivotal part in the analytical culture of Invisible. They will be responsible for managing their internal stakeholders, in this case XYZ, driving insights and strategic decisions. Reporting into the Manager of Analytics, the Sr Analytics Associate will use data, data-related products (pipelines, models, dashboards, analyses) and an analytical approach to lead and support the needs of the business. </p>\n<p> </p>\n<p><strong>What You’ll Do</strong></p>\n<ul style=\"\">\n<li style=\"\">Lead a team of infrastructure engineers </li>\n<li style=\"\">Set robust data definitions, sources of truth, and nomenclature</li>\n<li style=\"\">Monitor data integrity and accuracy </li>\n<li style=\"\">Manage our data pipelines </li>\n<li style=\"\">Maintain and optimize data transformation layer and data models </li>\n<li style=\"\">Ensure efficient data processing and resourcing </li>\n<li style=\"\">Build data pipelines between different systems (eg. ERP, HRIS, CRM, etc.) </li>\n<li style=\"\">Manage data permissions </li>\n<li style=\"\">Write and enforce company-wide data policies  </li>\n</ul>\n<p> </p>\n<p><strong>What We Need</strong></p>\n<ul style=\"\">\n<li style=\"\">6+ years of  experience in a data architecture, data infrastructure, data warehousing, or analytics engineering role</li>\n<li style=\"\">3+ years of experience managing a team of engineers, architects,and/ or analysts </li>\n<li style=\"\">Experience with modern tech stack for analytics / BI </li>\n<li style=\"\">Ability to translate business needs to optimal data structure </li>\n<li style=\"\">Experience setting the data architecture for external systems </li>\n<li style=\"\">Proficient in SQL</li>\n<li style=\"\">Proficient in Python for data pipelines and analytics </li>\n</ul>\n<p> </p>\n<p><strong>What’s In It For You</strong></p>\n<p>We believe in recognizing exceptional work with exceptional benefits. That’s why we empower our Partners to work remotely around the world on a schedule that suits their lifestyle. Our Partner Pay Model is fully transparent and designed for co-ownership, recognizing that professionals have unique needs. We balance profitability and growth by reinvesting annual profits to fuel expansion and fairly compensate our partners. With over 65% ownership already in the hands of our partners, we are committed to achieving 100% partner ownership. Moreover, our leadership team is legally obligated to buy back partner shares according to a formal liquidity plan. This ensures a clear path for those who choose to sell their stake in the company.</p>\n<p>Compensation: </p>\n<ul style=\"\">\n<li style=\"\">Base: $195,000 </li>\n<li style=\"\">Base + Bonus Target:$260,000 </li>\n<li style=\"\">This role is eligible to participate in Invisible’s equity plan.</li>\n</ul>\n<p>The amount listed above is the expected annual base salary for this role, subject to change.</p>\n<p> </p>\n<p><strong><em>Country Hiring Guidelines:</em></strong><strong><em><br></em></strong><em>Invisible hires new team members in countries around the world. All of our roles are remote, however some roles may carry specific location-based eligibility requirements. Our Talent Acquisition team can help answer any questions about location after starting the recruiting process. </em></p>\n<p><strong><em>Privacy Policy: </em></strong><strong><em><br></em></strong><em>All candidates and residents of California may visit our Recruitment Privacy Policy and Notice at Collection </em><a href=\"%22https://docs.google.com/document/d/1wMSVQSC8RdT1eVvZQbh4OlKK9d9kIfyw2t_H0_SJ_Xo/edit%22\" rel=\"nofollow\"><em>here</em></a><em>. </em></p>\n<p><strong><em>Accessibility Statement:</em></strong><strong><em><br></em></strong><em>We are committed to providing reasonable accommodations for individuals with disabilities. If you need assistance or accommodation due to a disability, please contact our Talent Acquisition team during the recruitment process at </em><a href=\"%22mailto:accommodation@invisible.email%22\" rel=\"nofollow\"><em>accommodation@invisible.email</em></a><em>. </em></p>\n<p><strong><em>Equal Opportunity Statement:</em></strong><strong><em><br></em></strong><em>We are an equal opportunity employer. All qualified applicants will receive consideration for employment without regard to race, color, religion, sex, national origin, disability, or veteran status, or any other basis protected by law.</em></p>\n<p><em>You may view </em><a href=\"%22https://docs.google.com/document/u/0/d/1PtHTpaXlSGhh-G_Rhep301xqJvLhimGO_1xvJBgTcuI/edit%22\" rel=\"nofollow\"><em>Invisible Pay Transparency Policy</em></a><em>, and </em><a href=\"%22https://www.eeoc.gov/sites/default/files/2023-06/22-088_EEOC_KnowYourRights6.12ScreenRdr.pdf%22\" rel=\"nofollow\"><em>Equal Employment Opportunity is the Law notice</em></a><em>, by clicking on the corresponding links.</em></p>\n<p> </p>\n<p><em>Due to a high volume of candidates, Invisible may use automated decision-maker technologies to filter candidates based on response to our application questions and other provided information. Our use of automated decision-making enables us to be efficient by providing a manageable list of possible candidates that meet our mandatory hiring criteria. If you object to our use of automated decision-making please contact us. </em></p><img src=\"https://remotive.com/job/track/1937119/blank.gif?source=public_api\" alt=\"\"/>","tags":"[\"sql\",\"data warehousing\"]","pubDate":"2024-09-14 17:21:13.000","link":"https://remotive.com/remote-jobs/data/manager-of-data-infrastructure-1937119","savedDate":"2024-09-16 04:49:58.339","slug":"manager-of-data-infrastructure-invisibletech-8767"},{"id":4444632799,"title":"Senior UX/UI Designer","company":"Gameplaygalaxy","image":"https://remotive.com/job/1936485/logo","description":"<div><!--block-->We are looking for a talented and experienced <strong>Senior UX/UI Designer</strong> who will be responsible for designing intuitive and visually compelling user interfaces for our cutting-edge mobile gaming experiences. This role will work closely with our game designers, developers, and art team to create seamless and engaging user experiences that captivate our players and elevate our games. You'll play a key part in shaping the look and feel of our games, ensuring they are not only beautiful but also easy to navigate and enjoyable to play.</div><br><br><div class=\"h3\">All the responsibilities we'll trust you with:</div><ul style=\"\"><li style=\"\"><!--block-->You'll collaborate closely with product managers, game designers, and developers to define and implement innovative solutions for the product direction, visuals, and experience.</li><li style=\"\"><!--block-->You'll create wireframes, storyboards, user flows, and prototypes to effectively communicate interaction and design ideas.</li><li style=\"\"><!--block-->You'll design user interfaces that prioritize ease of navigation, intuitive gameplay, and visual appeal, ensuring a seamless user experience across platforms.</li><li style=\"\"><!--block-->You’ll create Astonishing UI animations that would bring UI to life</li><li style=\"\"><!--block-->You'll conduct user research and evaluate user feedback to enhance user satisfaction by improving usability, accessibility, and interaction design.</li><li style=\"\"><!--block-->You'll collaborate with artists and developers to ensure visual design integrity and consistency throughout the game development lifecycle.</li><li style=\"\"><!--block-->You'll advocate for user-centered design principles and best practices, staying updated on industry trends and emerging technologies.</li></ul><br><br><div class=\"h3\">What you'll bring to the team:</div><ul style=\"\"><li style=\"\"><!--block-->5+ years of experience as a UX/UI Designer in the gaming or interactive media industry, with a strong portfolio showcasing your design process and results.</li><li style=\"\"><!--block-->Proficiency in design tools such as Adobe XD, Sketch, Figma, or similar software.</li><li style=\"\"><!--block-->Experience with prototyping tools (e.g., InVision, Marvel, Principle) to create interactive prototypes.</li><li style=\"\"><!--block-->Excellent knowledge of Unity.</li><li style=\"\"><!--block-->Strong understanding of user-centered design principles, user interface guidelines, usability, and accessibility standards.</li><li style=\"\"><!--block-->Ability to effectively communicate design ideas and rationale, and to collaborate with cross-functional teams.</li><li style=\"\"><!--block-->Experience in conducting user research, usability testing, and incorporating feedback into design iterations.</li><li style=\"\"><!--block-->Excellent attention to detail and a passion for creating exceptional user experiences.</li><li style=\"\"><!--block-->Knowledge of mobile gaming trends and familiarity with responsive design principles is a plus.</li><li style=\"\"><!--block-->Excellent English proficiency to collaborate effectively with our international team.</li></ul><br><br><div class=\"h3\">Why you'll love working with us:</div><ul style=\"\"><li style=\"\"><!--block-->We’re 100% remote, work wherever you want forever!</li><li style=\"\"><!--block-->We offer unlimited holidays and sick days. Take as much time off as you need, to spend time with your family and friends or just because you feel like playing games all day. We trust our team and want to offer a modern work life balance that allows you to thrive both at work and in your personal life.</li><li style=\"\"><!--block-->You’ll be able to make an impact, to work closely with the rest of the team and its leads to work on one of the most promising upcoming games in the mobile gaming industry and the Web3 space.</li><li style=\"\"><!--block-->You’ll have a comfortable work schedule and stable workload. With a variety of tasks that will allow your constant professional development.</li><li style=\"\"><!--block-->We want our team to grow personally and professionally and support learning opportunities, especially with a focus around new AI tools and methods. </li><li style=\"\"><!--block-->We have a culture that puts our people first. We believe in open communication, creativity and the value of unique contributions from everyone in the team.</li><li style=\"\"><!--block-->We offer a competitive salary in addition to equity option plans.</li></ul><img src=\"https://remotive.com/job/track/1936485/blank.gif?source=public_api\" alt=\"\"/>","tags":"[\"Figma\",\"unity\",\"adobe XD\"]","pubDate":"2024-09-13 23:20:18.000","link":"https://remotive.com/remote-jobs/design/senior-ux-ui-designer-1936485","savedDate":"2024-09-16 04:49:58.340","slug":"senior-ux-ui-designer-gameplaygalaxy-4741"},{"id":2727732422,"title":"Back-end Developer (VM)","company":"Blue Coding","image":"https://media.licdn.com/dms/image/C4D0BAQHlK67hgnhzQw/company-logo_200_200/0/1631346154820?e=2147483647&v=beta&t=_R2Ssj7L_f4xqmSCcq0nOLCyCz0QN2lFnHssxxhj3YY","description":"<div><i style=\"font-size: 18px\">Do you want to earn a salary in USD?&nbsp;</i></div><div><i style=\"font-size: 18px\">Would you like to work from wherever you want?</i></div><div><i style=\"font-size: 18px\">Would you like to be a part of the leading next-gen software developers?&nbsp;</i></div><div><br></div><div><b style=\"font-size: 24px\">Hi, you finally found us!</b><span style=\"font-size: 24px\">&nbsp;</span></div><div><br></div><div><b style=\"font-size: 24px\">Why work at Blue Coding?</b><span style=\"font-size: 24px\">&nbsp;</span></div><div><br></div><div>At Blue Coding we specialize in hiring excellent developers and amazing people from all over Latin America and other parts of the world. For the past 10 years, we’ve helped cutting-edge companies in the United States and Canada -both large and small, build great development teams and develop great products. Online shops, digital agencies, SaaS providers, and software consulting firms are a few of our clients. Our team of over 100 engineers is distributed in more than 10 countries across the Americas. We are a fully remote company working with a wide array of technologies and have expertise in every stage of the software development process.&nbsp;&nbsp;</div><div><br></div><div>Our team is highly connected, united, and culturally diverse, and our collaborators are involved in many initiatives around the world, from wildlife preservation to volunteering at local charities. We also participate in group activities like movie nights, trivia, and meme competitions. We stand for honesty, fairness, respect, efficiency, hard work, and cooperation.</div><div><br></div><div><b style=\"font-size: 18px\">What are we looking for?</b></div><div><br></div><div><span style=\"font-size: 16px\">In this opportunity, we are looking for a Back-end Developer to work with one of our foreign clients, who is a market leader in the consultation, design, procurement, implementation, and ongoing managed services for technology services for mid to large global enterprises. As a Telecom Managed Service company, they partner with over 300 service providers globally to help customers with technology design and find the best solutions to meet their needs. This Software Developer will be responsible for using C# to compose, compile,</span><span style=\"font-size: 16px;\"> and test programs and applications to provide cellular cost optimization services to enterprises. Also, will join the client's talented A-team with a shared commitment to reducing their clients’ monthly cell phone bills while making it easier to manage their mobile device inventory and services.</span></div><div><br></div><div><span style=\"font-size: 16px\">If you are independent, a great communicator, a problem solver, and have strong attention to detail, this is a great fit for you! Our jobs are fully remote – as long as you have the skills and can get the work done well, you can work anywhere in the listed countries you want.</span></div><div><span style=\"font-size: 16px\">If you have the skills and can get the job done, join us and work from anywhere you want!</span></div><h3>Here are some of the exciting day-to-day challenges you will face in this role:</h3><li>Build new applications that will increase value to clients. Write clean, high-quality, high-performance, maintainable code. </li><li>Develop and support software, including applications, database integration, interfaces, and new functionality enhancements. </li><li>Analyze existing program logic to identify causes of program malfunctions; modify program logic to eliminate problems or increase operational efficiency. </li><li>Collaborate with internal and external stakeholders to understand user needs. </li><li>Support test and deployment of new products and features. </li><li>Shape our product and deliver new features monthly, improving our effectiveness and making our users happier. </li><li>Maintain knowledge of trends and developments in related areas of technology and programming.</li>,<h3>You will shine if you have:</h3><li>2+ years of experience in software development</li><li>Extensive knowledge of C# and .NET frameworks. </li><li>Thorough understanding of design, testing, and modification of programs and applications. </li><li>Proficiency with or the ability to quickly learn the technologies, coding, and programming languages used in the organization. </li><li>Demonstrated experience in writing excellent code to solve complex business problems and process automation. </li><li>Excellent problem-solving and analytical skills. </li><li>Excellent organizational skills and attention to detail. </li><li>Excellent time management skills.</li>,<h3>It wouldn't hurt if you also have:</h3><li>Knowledge of Reveal BI. </li><li>Knowledge of other coding languages and systems, such as Ruby/Rails</li>,<h3>Here are some of the perks we offer you:</h3><li>Salary in USD</li><li>Long-term</li><li>Flexible schedule (within US Time zones)</li><li>100% Remote</li><div><b style=\"font-size: 24px\">Hey, you are still here!</b><span style=\"font-size: 24px\">&nbsp;</span></div><div><br></div><div>So, let us ask a few questions. Do you like working in a friendly environment? Are you fluent in English? Do you have a strong work ethic, are detail-oriented and have an ownership mentality? And most importantly do you love music and puppies? If so, then what are you waiting for? Come join our team and become part of this awesome company! We will be expecting you.</div>","tags":"[\"management\",\"database\"]","pubDate":"2024-09-13 16:51:20.707","link":"https://jobs.lever.co/bluecoding/b964ae53-0019-456f-bf67-a1c0183a8db7","savedDate":"2024-09-16 04:49:58.348","slug":"back-end-developer-vm-blue-coding-6612"},{"id":2274140152,"title":"Sr. Growth Marketing Specialist","company":"Ciceksepeti","image":"https://lever-client-logos.s3.us-west-2.amazonaws.com/de4eebbf-97f1-4bdb-b542-4fa65a0b48ab-1662467464737.png","description":"<div><b>Want to join us as we move closer to be a leader in all markets in which we operate, as a pioneering tech company?</b>&nbsp;</div><div><br></div><div>We’re looking for bright, intellectually curious professionals ready to bring out the best in themselves devoid of corporate buzzwords and bureaucracy in a global environment. We offer real-life cases to resolve and a true taste of professional life in a high-growth, high-speed tech company.&nbsp;</div><div><br></div><div>If you want to hold full accountability of your work, if you want to be heard when you have new ideas to contribute to the business, and if you’re ready to experience exceptional on-the-job training; then you’re ready for the challenge.</div><h3>🎯Your Journey Begins: Embrace the Exciting Adventure Ahead!</h3><li><b>This is a great opportunity to grow your career while you grow the business, where you’ll be accountable for the digital growth strategies. Your responsibilities will include:</b>&nbsp;</li><div><br></div><li>Executing digital marketing operations: Campaign setup, budget and bid optimization, audience and creative strategy (SEM, Social Media Ads, App Install, Retargeting etc.)</li><li>Monitoring and optimizing campaigns on a daily basis to meet company goals</li><li>Creating and testing ad copy variations for best results</li><li>Identifying threats and opportunities within competitors and overall digital space</li><li>Analyzing web (GA4) &amp; app (Adjust, AppsFlyer, Firebase) performance data to monitor campaign performance</li><li>Creating reports on marketing channels regularly</li><li>Maintaining communication with 3rd party marketing tools &amp; advertising partners</li>,<h3>✨Let Your Skills Shine with Us!</h3><li><b>We need a strategic team player who won’t hesitate to roll up their sleeves to get results. We know that sounds ambitious, therefore the minimum requirements to handle the challenge are as follows:&nbsp;</b></li><li>You have minimum 4 years experience in digital marketing </li><li>You have preferably knowledge about Excel, Google Ads, Meta Ads, TikTok Ads, GA4 and Adjust</li><li>You’re fluent in written and oral English</li><li>You’re passionate about digital marketing and eager to learn new technologies</li><li>You’re a deadline oriented, fast-paced producer</li><li>You have excellent written and verbal communication skills</li><li>You have the ability to adjust quickly to changing priorities&nbsp;</li>,<h3>😎What’s in here for you?</h3><li>🎉Fun and Adventure Await: Get ready for exhilarating team adventures and unforgettable company activities that will create memories to cherish!&nbsp;🌈</li><li>🛍️Take excellent care of yourself : HiDoctor, Momento, and More!&nbsp;👩🏻‍⚕️</li><li>🎩Express Your Unique Style: No more stuffy suits or uncomfortable attire. Embrace your personal style and wear whatever makes you feel confident and comfortable. 👗👕</li><li>📚Unlock Your Potential: Biweekly Learning Hours and a Vast Training Library Await! 🎓 Never stop learning and growing! With unlimited access to top-notch training resources like Udemy and more, your professional growth knows no limits! 🚀</li><li>🥰Join Vibrant Social Clubs: Connect, Collaborate, and Create Lifelong Friendships!🎉Be part of our vibrant social clubs, where you can engage with colleagues who share your passions and interests. Cultivate meaningful connections, foster collaboration, and create memories that extend beyond the workplace.🤝</li><li>🤝Seamless Onboarding: Receive a Warm Welcome and a Smooth Transition! 📋 Our dedicated onboarding process ensures you feel supported and empowered from day one. We provide comprehensive training and resources to help you settle into your role quickly and effectively. 🌟</li><li>Join us on this exciting journey a dynamic work ecosystem, thrilling team activities, entertainment galore, a flexible dress code, and endless learning opportunities await you! It’s time to unleash your full potential and embrace the future of work!&nbsp;💃</li><div><b>😍About Us</b></div><div><br></div><div>As a pioneering tech company in gifts, our vision is to be a leader in all markets in which we operate. We create lifelong value in the lives of our employees, customers and all our business partners! 💪</div><div><br></div><div>Founded in 2006 by Emre Aydın, <a rel=\"noopener noreferrer\" class=\"postings-link\" href=\"http://ciceksepeti.com/\">Ciceksepeti.com</a> offers the broadest selection of flowers &amp; gifts delivered same day within a single experience. We are very proud to have created a culture of celebration among people with our gift arrangements and our brand Bonnyfood. We are committed to continuing this tradition by making every special day memorable. In addition to our original mission of bringing a new perspective to the e-commerce sector in Turkey and making shipping faster and easier, now we offer a diverse range of products under various categories, such as electronics, home &amp; living, personal care, supermarket, cosmetics, fashion, sports &amp; outdoor, hobby, pet shop, jewellery &amp; accessories, as well as flowers and edible flowers since 2019.</div><div><br></div><div><a rel=\"noopener noreferrer\" class=\"postings-link\" href=\"http://ciceksepeti.com/\">Ciceksepeti.com</a> is the most visited floral and gifting website according to SimilarWeb data, having 4 times more visitors than the second largest player in the world. 😎</div><div><br></div><div>Besides covering 70+ cities in Turkey through 55.000+ vendors and 24x7 customer support, Ciceksepeti has expanded into Mexico with its international brand, LolaFlora.💃</div><div><br></div><div>We are so happy and proud to have been selected the Best Employer Brand at LinkedIn Turkey Talent Awards in 2019 and 2022! 🥳</div><div><br></div><div>Headquartered in İstanbul, we’re a young, nimble, dedicated team of professionals, who are not only hard workers but also smart workers; who know how to get things done in the right way, as well as getting the right things done for our customers. Moreover, we’re on the verge of an exciting episode in our journey as we simultaneously set foot on international markets and grow further in domestic market.</div><div><br></div><div>\"İşe alım süreçlerimizde kişisel verilerinizi nasıl işlediğimize dair bilgiye çalışan adayı aydınlatma metnimizden ulaşabilirsiniz./ Please see our candidate privacy note for information on how we process your personal data during our recruitment activities.\"</div><div><a rel=\"noopener noreferrer\" class=\"postings-link\" style=\"font-size: 15px;\" href=\"https://cdn03.ciceksepeti.com/editor/hr/Ciceksepeti_Calisan_Adayi_Aydinlatma_Metni_2024-08-29.pdf\">https://cdn03.ciceksepeti.com/editor/hr/Ciceksepeti_Calisan_Adayi_Aydinlatma_Metni_2024-08-29.pdf</a></div><div><a rel=\"noopener noreferrer\" class=\"postings-link\" style=\"font-size: 15px;\" href=\"https://cdn03.ciceksepeti.com/editor/hr/CS_Teknoloji_Calisan_Adayi_Aydinlatma_Metni_2024-08-29.pdf\">https://cdn03.ciceksepeti.com/editor/hr/CS_Teknoloji_Calisan_Adayi_Aydinlatma_Metni_2024-08-29.pdf</a></div>","tags":"[]","pubDate":"2024-09-13 06:22:44.536","link":"https://jobs.lever.co/ciceksepeti/b3dee858-4058-4756-87a4-a7d83f0d7a0c","savedDate":"2024-09-16 04:49:58.348","slug":"sr-growth-marketing-specialist-ciceksepeti-2619"},{"id":2002954146,"title":"Digital Insurance Project Manager (Fully Remote)","company":"CoverGo","image":"https://pbs.twimg.com/profile_images/1382655628523364355/MWPIbbID_400x400.jpg","description":"<p><strong>Top 3 Reasons To Join Us</strong></p><ul> <li>Competitive Salary</li> <li>100% Remote</li> <li>Working on the latest tech for the Insurtech Market Leader</li> </ul><p><strong>About Us</strong></p><p>At CoverGo, our mission is to empower all insurance companies to make insurance 100% digital and accessible to everyone.</p><ul> <li>We are a leading global no-code insurance platform for health, life, and P&amp;C</li> <li>We’re the winner of the Insurtech of the Year in all of Asia and other awards globally</li> <li>We work with insurance enterprise clients such as AXA, Bupa, MSIG, Dai-ichi, Bank of China Group Insurance, and many more</li> <li>We're an international, diverse team of over 120 people with 30 nationalities and team members working remotely from all over the world</li> <li>We are fully funded and backed by reputable VC funds and strategic institutional investors</li> <li>We have a global presence in Asia, EMEA and the Americas</li> <li>We’ve grown our annualized revenue by over 30x since January 2021</li> <li>We’re constantly working towards making CoverGo a workplace that you love coming to. We deeply believe that bringing together a diversity of thoughts, expressions, and perspectives is key to building the best culture for equally diverse communities all over the world and a workplace that you love coming to. We deeply believe that bringing together a diversity of thoughts, expressions, and perspectives is key to building the best culture for equally diverse communities all over the world</li> </ul><p><strong>About the Role</strong></p><p>As a Digital Insurance Project Manager, your core responsibility will be to oversee and manage the implementation of new and/or existing projects within CoverGo's operations. This role presents an exciting opportunity for an individual with a strong drive to lead transformative projects in the insurtech industry. </p><p><strong>What You Will Do</strong></p><ul> <li>Engage and manage relationships with clients and stakeholders</li> <li>Lead project planning sessions with the internal team and client's staff</li> <li>Support solution proposals for client pursuits, proposals, and PoCs</li> <li>Participate in proposal and POC processes (i.e. design, submission, and review)</li> <li>Support the creation of contracts and related communication with clients</li> <li>Identify and help secure growth opportunities for existing clients</li> <li>Manage project progress and adapt work as required</li> <li>Ensure projects meet deadlines</li> <li>Manage relationships with clients and stakeholders</li> <li>Host regular/weekly project review and create reports with key metrics about team and project status using company standard metrics</li> <li>Oversee all incoming and outgoing project documentation</li> <li>Identify and manage issues, risks, assumptions, and dependencies</li> <li>Continuously optimize and improve processes and the overall approach where necessary</li> </ul><p><strong>What We Need</strong></p><ul> <li>Bachelor's degree in computer science or a related technical field is a plus</li> <li>5+ years experience as a Project Manager</li> <li>Insurance domain knowledge is a must</li> <li>Strong client facing experience is a must</li> <li>Technical skills are a plus</li> <li>Has experience seeing projects through the full life cycle</li> <li>Excellent analytical skills and problem-solving skills</li> <li>Strong interpersonal skills and extremely resourceful</li> <li>Proven ability to complete projects according to outlined scope, budget, and timeline</li> <li>Self-motivated and able to work independently</li> <li>Able, willing, and excited to work in a fast-paced collaborative startup environment</li> <li>Must be based in India</li> </ul><p><strong>Why You'll Love Working Here</strong></p><ul> <li>Fully Remote</li> <li>Flexible Leave</li> <li>International Environment</li> <li>Competitive renumeration package</li> <li>Performance Bonus</li> <li>Company activities and events</li> <li>Learning and development plan</li> <li>Remote work allowance</li> </ul><p><strong>CoverGo Company </strong><a href=\"https://www.youtube.com/watch?v=YI0ezLxvFvA\" rel=\"nofollow noreferrer noopener\" class=\"external\"><strong>Video</strong></a></p><p>By submitting your application, you confirm that you have read, understood, and accepted the content of CoverGo’s <a href=\"https://apply.workable.com/covergo/gdpr_policy?lng=en\" target=\"_blank\" rel=\"nofollow noreferrer noopener\" class=\"external\">Privacy Notice</a> and you consent to the processing of your data as part of this application.</p><p><a href=\"https://www.youtube.com/watch?v=YI0ezLxvFvA\" rel=\"nofollow noreferrer noopener\" class=\"external\"></a></p><h3>Requirements: </h3><h3>Benefits: </h3>","tags":"[]","pubDate":"2024-09-13 00:00:00.000","link":"https://apply.workable.com/covergo/j/A1576760D0","savedDate":"2024-09-16 04:49:58.345","slug":"digital-insurance-project-manager-fully-remote-covergo-6858"},{"id":6876231874,"title":"Digital Insurance Project Manager (Fully Remote)","company":"CoverGo","image":"https://pbs.twimg.com/profile_images/1382655628523364355/MWPIbbID_400x400.jpg","description":"<p><strong>Top 3 Reasons To Join Us</strong></p><ul> <li>Competitive Salary</li> <li>100% Remote</li> <li>Working on the latest tech for the Insurtech Market Leader</li> </ul><p><strong>About Us</strong></p><p>At CoverGo, our mission is to empower all insurance companies to make insurance 100% digital and accessible to everyone.</p><ul> <li>We are a leading global no-code insurance platform for health, life, and P&amp;C</li> <li>We’re the winner of the Insurtech of the Year in all of Asia and other awards globally</li> <li>We work with insurance enterprise clients such as AXA, Bupa, MSIG, Dai-ichi, Bank of China Group Insurance, and many more</li> <li>We're an international, diverse team of over 120 people with 30 nationalities and team members working remotely from all over the world</li> <li>We are fully funded and backed by reputable VC funds and strategic institutional investors</li> <li>We have a global presence in Asia, EMEA and the Americas</li> <li>We’ve grown our annualized revenue by over 30x since January 2021</li> <li>We’re constantly working towards making CoverGo a workplace that you love coming to. We deeply believe that bringing together a diversity of thoughts, expressions, and perspectives is key to building the best culture for equally diverse communities all over the world and a workplace that you love coming to. We deeply believe that bringing together a diversity of thoughts, expressions, and perspectives is key to building the best culture for equally diverse communities all over the world</li> </ul><p><strong>About the Role</strong></p><p>As a Digital Insurance Project Manager, your core responsibility will be to oversee and manage the implementation of new and/or existing projects within CoverGo's operations. This role presents an exciting opportunity for an individual with a strong drive to lead transformative projects in the insurtech industry. </p><p><strong>What You Will Do</strong></p><ul> <li>Engage and manage relationships with clients and stakeholders</li> <li>Lead project planning sessions with the internal team and client's staff</li> <li>Support solution proposals for client pursuits, proposals, and PoCs</li> <li>Participate in proposal and POC processes (i.e. design, submission, and review)</li> <li>Support the creation of contracts and related communication with clients</li> <li>Identify and help secure growth opportunities for existing clients</li> <li>Manage project progress and adapt work as required</li> <li>Ensure projects meet deadlines</li> <li>Manage relationships with clients and stakeholders</li> <li>Host regular/weekly project review and create reports with key metrics about team and project status using company standard metrics</li> <li>Oversee all incoming and outgoing project documentation</li> <li>Identify and manage issues, risks, assumptions, and dependencies</li> <li>Continuously optimize and improve processes and the overall approach where necessary</li> </ul><p><strong>What We Need</strong></p><ul> <li>Bachelor's degree in computer science or a related technical field is a plus</li> <li>5+ years experience as a Project Manager</li> <li>Insurance domain knowledge is a must</li> <li>Strong client facing experience is a must</li> <li>Technical skills are a plus</li> <li>Has experience seeing projects through the full life cycle</li> <li>Excellent analytical skills and problem-solving skills</li> <li>Strong interpersonal skills and extremely resourceful</li> <li>Proven ability to complete projects according to outlined scope, budget, and timeline</li> <li>Self-motivated and able to work independently</li> <li>Able, willing, and excited to work in a fast-paced collaborative startup environment</li> <li>Must be based in Canada and must be fluent in French</li> </ul><p><strong>Why You'll Love Working Here</strong></p><ul> <li>Fully Remote</li> <li>Flexible Leave</li> <li>International Environment</li> <li>Competitive renumeration package</li> <li>Performance Bonus</li> <li>Company activities and events</li> <li>Learning and development plan</li> <li>Remote work allowance</li> </ul><p><strong>CoverGo Company </strong><a href=\"https://www.youtube.com/watch?v=YI0ezLxvFvA\" rel=\"nofollow noreferrer noopener\" class=\"external\"><strong>Video</strong></a></p><p>By submitting your application, you confirm that you have read, understood, and accepted the content of CoverGo’s <a href=\"https://apply.workable.com/covergo/gdpr_policy?lng=en\" target=\"_blank\" rel=\"nofollow noreferrer noopener\" class=\"external\">Privacy Notice</a> and you consent to the processing of your data as part of this application.</p><p><a href=\"https://www.youtube.com/watch?v=YI0ezLxvFvA\" rel=\"nofollow noreferrer noopener\" class=\"external\"></a></p><h3>Requirements: </h3><h3>Benefits: </h3>","tags":"[]","pubDate":"2024-09-13 00:00:00.000","link":"https://apply.workable.com/covergo/j/6DB7088F00","savedDate":"2024-09-16 04:49:58.345","slug":"digital-insurance-project-manager-fully-remote-covergo-5024"},{"id":6739226141,"title":"Senior Business Analyst - Insurance (Fully Remote)","company":"CoverGo","image":"https://pbs.twimg.com/profile_images/1382655628523364355/MWPIbbID_400x400.jpg","description":"<h3><strong>Top 3 Reasons To Join Us</strong></h3><ul> <li>Competitive Salary</li> <li>100% Remote</li> <li>Working on the latest tech for the Insurtech Market Leader</li> </ul><h3><strong>About Us</strong></h3><p>At CoverGo, our mission is to empower all insurance companies to make insurance 100% digital and accessible to everyone.</p><ul> <li>We are a leading global no-code insurance platform for health, life, and P&amp;C</li> <li>We’re the winner of the Insurtech of the Year in all of Asia and other awards globally</li> <li>We work with insurance enterprise clients such as AXA, Bupa, MSIG, Dai-ichi, Bank of China Group Insurance, and many more</li> <li>We're an international, diverse team of over 120 people with 30 nationalities and team members working remotely from all over the world</li> <li>We are fully funded and backed by reputable VC funds and strategic institutional investors</li> <li>We have a global presence in Asia, EMEA and the Americas</li> <li>We’ve grown our annualized revenue by over 30x since January 2021</li> <li>We’re constantly working towards making CoverGo a workplace that you love coming to. We deeply believe that bringing together a diversity of thoughts, expressions, and perspectives is key to building the best culture for equally diverse communities all over the world</li> </ul><h3><strong>What You Will Do:</strong></h3><ul> <li>Work with clients and technical resources to identify their business problems and develop the right approach and analytical solution</li> <li>Plan and design simple to semi-complex business processes and system modifications</li> <li>Make recommendations to improve and support business activities</li> <li>Gather business requirements through a variety of techniques such as work sessions and interviews then analyze and document client complex business requirements and processes; communicate these requirements to appropriate parties</li> <li>Create complex test case scenarios to be used in testing; monitor/oversee the testing of business applications to verify that all client requirements are incorporated into the system design</li> <li>Develop business requirements documents/user stories to support the required modifications</li> <li>May plan, allocate and monitor work of other business analysts</li> <li>Understand simple to complex systems and related data to surface actionable insights, demonstrate sound judgment and decision-making skills</li> <li>Assist in providing time estimates for project related tasks</li> <li>Aid in updating process and procedural documentation</li> <li>Develop basic understanding of technical development cycle of mobile application or web portals</li> <li>Support QA, UAT and Release phases of the project via defect analysis, change maintenance, etc.</li> <li>Any other task that may be assigned</li> </ul><h3><strong>What We Need:</strong></h3><ul> <li>Minimum 5 years of experience as Business Analyst</li> <li>A degree in Business, IT or any relevant field</li> <li>Previous experience working in the insurance industry is required (Insurtech or health insurance experience is preferred)</li> <li>Health Insurance-related domain certification from INS/LOMA or III is an added advantage</li> <li>Knowledge of business analysis concepts of defining requirements, translating to technical solutions, and Agile approach to prioritizing work to epics, sprints</li> <li>Business analysis skills including facilitation, process documentation, requirements gathering and user acceptance testing</li> <li>Good organizational/time management skills to prioritize work and meet deadlines within defined timeframes</li> <li>Experience in an Agile and/or Scrum environment is a must</li> <li>Basic knowledge in generating process documentation, and document system functionality, data integration, and workflow</li> <li>Excellent written and verbal communication skills in English</li> <li>Technical writing skills and knowledge of other languages (Chinese) is a plus</li> <li>Currently based in India</li> </ul><h3><strong>Why You'll Love Working Here</strong></h3><ul> <li>Fully Remote</li> <li>Flexible Leave</li> <li>International Environment</li> <li>Competitive renumeration package</li> <li>Performance Bonus</li> <li>Stock Options after 6 months </li> <li>Company activities and events</li> <li>Learning and development plan</li> <li>Remote work allowance</li> </ul><p><strong>CoverGo Company </strong><a href=\"https://www.youtube.com/watch?v=YI0ezLxvFvA\" rel=\"nofollow noreferrer noopener\" class=\"external\"><strong>Video</strong></a></p><p>By submitting your application, you confirm that you have read, understood, and accepted the content of CoverGo’s <a href=\"https://apply.workable.com/covergo/gdpr_policy?lng=en\" target=\"_blank\" rel=\"nofollow noreferrer noopener\" class=\"external\">Privacy Notice</a> and you consent to the processing of your data as part of this application.</p><p><a href=\"https://www.youtube.com/watch?v=YI0ezLxvFvA\" rel=\"nofollow noreferrer noopener\" class=\"external\"></a></p><h3>Requirements: </h3><h3>Benefits: </h3>","tags":"[\"management\"]","pubDate":"2024-09-13 00:00:00.000","link":"https://apply.workable.com/covergo/j/0106C71256","savedDate":"2024-09-16 04:49:58.345","slug":"senior-business-analyst-insurance-fully-remote-covergo-4996"},{"id":6314662298,"title":"Senior Business Analyst - Insurance (Fully Remote)","company":"CoverGo","image":"https://pbs.twimg.com/profile_images/1382655628523364355/MWPIbbID_400x400.jpg","description":"<h3><strong>Top 3 Reasons To Join Us</strong></h3><ul> <li>Competitive Salary</li> <li>100% Remote</li> <li>Working on the latest tech for the Insurtech Market Leader</li> </ul><h3><strong>About Us</strong></h3><p>At CoverGo, our mission is to empower all insurance companies to make insurance 100% digital and accessible to everyone.</p><ul> <li>We are a leading global no-code insurance platform for health, life, and P&amp;C</li> <li>We’re the winner of the Insurtech of the Year in all of Asia and other awards globally</li> <li>We work with insurance enterprise clients such as AXA, Bupa, MSIG, Dai-ichi, Bank of China Group Insurance, and many more</li> <li>We're an international, diverse team of over 120 people with 30 nationalities and team members working remotely from all over the world</li> <li>We are fully funded and backed by reputable VC funds and strategic institutional investors</li> <li>We have a global presence in Asia, EMEA and the Americas</li> <li>We’ve grown our annualized revenue by over 30x since January 2021</li> <li>We’re constantly working towards making CoverGo a workplace that you love coming to. We deeply believe that bringing together a diversity of thoughts, expressions, and perspectives is key to building the best culture for equally diverse communities all over the world</li> </ul><h3><strong>What You Will Do:</strong></h3><ul> <li>Work with clients and technical resources to identify their business problems and develop the right approach and analytical solution</li> <li>Plan and design simple to semi-complex business processes and system modifications</li> <li>Make recommendations to improve and support business activities</li> <li>Gather business requirements through a variety of techniques such as work sessions and interviews then analyze and document client complex business requirements and processes; communicate these requirements to appropriate parties</li> <li>Create complex test case scenarios to be used in testing; monitor/oversee the testing of business applications to verify that all client requirements are incorporated into the system design</li> <li>Develop business requirements documents/user stories to support the required modifications</li> <li>May plan, allocate and monitor work of other business analysts</li> <li>Understand simple to complex systems and related data to surface actionable insights, demonstrate sound judgment and decision-making skills</li> <li>Assist in providing time estimates for project related tasks</li> <li>Aid in updating process and procedural documentation</li> <li>Develop basic understanding of technical development cycle of mobile application or web portals</li> <li>Support QA, UAT and Release phases of the project via defect analysis, change maintenance, etc.</li> <li>Any other task that may be assigned</li> </ul><h3><strong>What We Need:</strong></h3><ul> <li>Minimum 5 years of experience as Business Analyst</li> <li>A degree in Business, IT or any relevant field</li> <li>Previous experience working in the insurance industry is required (Insurtech or health insurance experience is preferred)</li> <li>Health Insurance-related domain certification from INS/LOMA or III is an added advantage</li> <li>Knowledge of business analysis concepts of defining requirements, translating to technical solutions, and Agile approach to prioritizing work to epics, sprints</li> <li>Business analysis skills including facilitation, process documentation, requirements gathering and user acceptance testing</li> <li>Good organizational/time management skills to prioritize work and meet deadlines within defined timeframes</li> <li>Experience in an Agile and/or Scrum environment is a must</li> <li>Basic knowledge in generating process documentation, and document system functionality, data integration, and workflow</li> <li>Excellent written and verbal communication skills in English</li> <li>Technical writing skills </li> <li>Must be based in Canada and must be fluent in French</li> </ul><h3><strong>Why You'll Love Working Here</strong></h3><ul> <li>Fully Remote</li> <li>Flexible Leave</li> <li>International Environment</li> <li>Competitive renumeration package</li> <li>Performance Bonus</li> <li>Stock Options after 6 months </li> <li>Company activities and events</li> <li>Learning and development plan</li> <li>Remote work allowance</li> </ul><p><strong>CoverGo Company </strong><a href=\"https://www.youtube.com/watch?v=YI0ezLxvFvA\" rel=\"nofollow noreferrer noopener\" class=\"external\"><strong>Video</strong></a></p><p>By submitting your application, you confirm that you have read, understood, and accepted the content of CoverGo’s <a href=\"https://apply.workable.com/covergo/gdpr_policy?lng=en\" target=\"_blank\" rel=\"nofollow noreferrer noopener\" class=\"external\">Privacy Notice</a> and you consent to the processing of your data as part of this application.</p><p><a href=\"https://www.youtube.com/watch?v=YI0ezLxvFvA\" rel=\"nofollow noreferrer noopener\" class=\"external\"></a></p><h3>Requirements: </h3><h3>Benefits: </h3>","tags":"[\"management\"]","pubDate":"2024-09-13 00:00:00.000","link":"https://apply.workable.com/covergo/j/3B8CE41066","savedDate":"2024-09-16 04:49:58.346","slug":"senior-business-analyst-insurance-fully-remote-covergo-730"},{"id":2780271307,"title":"Legal Counsel, Commercial & Product (Remote)","company":"DuckDuckGo","image":"https://spreadprivacy.com/content/images/2023/05/duckduckgo-logo_wide.png","description":"<p>Hi, we’re DuckDuckGo, the Internet privacy company for everyone who wants to take back their privacy now. For over a decade, we've been building our all-in-one product, developing new privacy technology, and working with policymakers to make online privacy simple and accessible for all.</p>\n<p><br /></p>\n<p>Our browsers and extensions have been downloaded over 250 million times with our built-in private search engine, which has seen over 100 billion searches and is the 2nd largest search engine on mobile in the United States and 20 other countries, including the United Kingdom, Canada, Australia, Poland, Italy, and Spain. Our private search engine is also 3rd in market share in the U.S. and over 15 major markets. Oh, and we've been profitable since 2014, with annual revenue exceeding $100 million!</p>\n<p><br /></p>\n<p>The DuckDuckGo browser’s uniquely comprehensive privacy protections are used by tens of millions of people to protect their everyday online activities on <a href=\"https://spreadprivacy.com/introducing-duckduckgo-for-mac/\" rel=\"noopener\">Mac</a>, <a href=\"https://spreadprivacy.com/windows-browser-open-beta/\" rel=\"noopener\">Windows</a>, <a href=\"https://spreadprivacy.com/duckduckgo-privacy-browser-ios14/\" rel=\"noopener\">iOS</a>, and <a href=\"https://spreadprivacy.com/introducing-app-tracking-protection/\" rel=\"noopener\">Android</a>, from searching to browsing, emailing, and more. We also offer <a href=\"https://spreadprivacy.com/meetprivacypro/\" rel=\"noopener\">Privacy Pro</a>, a three-in-one subscription service that includes a VPN, Personal Information Removal, and Identity Theft Restoration.<br /><br /></p>\n<p>We’re looking for a <strong>Legal Counsel, Commercial &amp; Product</strong> to help shape our all-in-one privacy solution and join our mission to show the world that protecting your privacy online can be simple.  </p>\n<p><br /><br /></p>\n<p><strong>The Opportunity</strong> </p>\n<p>In this role, you will provide direct day-to-day legal support and advice on DuckDuckGo’s global offerings throughout the product life cycle. You'll work closely with product managers, engineers, copywriters, and other stakeholders across the company to help identify and manage a wide range of legal issues, including consumer protection, privacy, data security, and intellectual property. You will also draft, review, and interpret a wide array of commercial agreements, including SaaS contracts, IP licenses, strategic partnerships, and more. </p>\n<p><br /></p>\n<p><strong>What You Will Bring to DuckDuckGo</strong> </p>\n<ul><li>A curious and open mind with a learner’s mindset.</li><li>Skills to wrangle vague problems, propose innovative solutions, and execute them efficiently.</li><li>5+ years of experience working on tech-related legal issues (e.g., consumer protection, privacy, data security, and/or intellectual property);</li><li>Broad legal knowledge that enables you to spot and resolve a variety of legal issues in product offerings (e.g., regulatory, contract, IP, privacy, and consumer protection).</li><li>Licensed to practice law from an ABA-accredited law school and membership in good standing in one U.S. state bar.</li><li>Demonstrated ability to work autonomously and collaborate with team members in multiple functional areas, taking guidance from other members of the legal team and translating legal advice into practical, actionable guidance for non-lawyers.</li><li>Superior written communication skills demonstrated organizational skills, and ability to manage time and effectively prioritize within a fast-paced environment.</li></ul>\n<p><br /></p>\n<p><strong>How We Will Support You </strong> </p>\n<p>Our core values -- build trust, question assumptions, and validate direction -- underpin how we work day-to-day and the support we give our team members. We strive to empower our team members to be self-directed and self-motivated in their work.  </p>\n<p><br /></p>\n<ul><li><strong>Remote First, Always</strong>: We've always been a fully distributed company with team members all over the world. We trust you to get your work done wherever, whenever.</li></ul>\n<ul><li><strong>Commitment to Personal Growth:</strong> Every team member has an annual budget of $1,250 USD to invest in their professional development. Every team member also has a dedicated Career Advisor, who serves as a guide to help you develop your strengths, identify your motivations, and understand your opportunities for growth.</li></ul>\n<ul><li><strong>Leadership:</strong> We have many different types of leaders and possible combinations of leadership roles, so you can grow your career in a way that aligns best with your personal goals. You can seek additional leadership roles by being directly responsible for projects, taking ownership of areas of the company, developing and maintaining internal processes, or pursuing advisory roles.</li></ul>\n<ul><li><strong>Work/Life Balance: </strong>Team members have the freedom and flexibility to organize their own work schedules. We want you to thrive both in and out of the office. We trust you to use good judgment and take the time off that you need to bring your best self to work.  </li></ul>\n<p><br /></p>\n<p>We also offer <strong>paid parental leave, a co-working stipend, office setup reimbursement, </strong>and<strong> a wellness stipend.</strong> More support resources can be found in our, <u><a href=\"https://duckduckgo.com/assets/hiring/team_support_guide.pdf\" rel=\"noopener\">Team Member Support Guide</a></u>, which explains how we make your well-being a priority. </p>\n<p><br /></p>\n<p>For more information on how we collaborate worldwide, from <strong>leadership in our relatively flat organization </strong>to <strong>start-to-finish ownership,</strong> check out <u><a href=\"https://duckduckgo.com/how-we-work\" rel=\"noopener\">DuckDuckGo Culture: How We Work.</a></u> </p>\n<p><br /></p>\n<p><strong>Compensation</strong> </p>\n<p>Annual compensation: <strong>$176,000 </strong>USD and stock options.  Compensation is the same within a professional level, regardless of geographic location or functional area, and the compensation for each professional level is transparent across the organization.</p>\n<p><br /></p>\n<p><strong>Hiring Process</strong> </p>\n<p>Hiring works best when it's a two-way street. Learn how we help you get to know DuckDuckGo and envision your future role here. Find out more about <u><a href=\"https://duckduckgo.com/how-we-hire\" rel=\"noopener\">how we hire</a></u>. </p>\n<p><br /></p>\n<p><strong>Diversity, Equity, and Inclusion</strong> </p>\n<p>DuckDuckGo provides equal work opportunities to all team members and applicants<u>,</u> and it prohibits discrimination and harassment of any type on the basis of race, color, ethnicity, caste, religion, age, sex (including pregnancy), national origin, disability status, genetics, protected veteran status, sexual orientation, gender identity or expression, or any other characteristic protected by our policies or federal, state, or local laws.</p>\n<p><br /></p>\n<p>We want to ensure that our hiring process is accessible. If you need reasonable accommodation for any part of the application process because of a medical condition or disability, please send an email to <u><a href=\"mailto:careers@duckduckgo.com\" rel=\"noopener\">careers@duckduckgo.com</a></u> to let us know the nature of your request.  </p>\n<p><br /></p>\n<p>If you think you might thrive in this environment, we would love to hear from you. </p>\n<p><br /></p>\n<p><strong>Please note that:</strong> </p>\n<ul><li><p>Sometimes we meet up! Expect to travel at least two times a year: once for our all-hands meetup and again for a team retreat (each around 4-5 days). While extenuating circumstances may impact attendance, everyone is strongly encouraged to attend.</p></li><li>While we offer a flexible work arrangement with no core hours, expect an average full-time commitment of 40 hours per week. </li><li>A successful candidate will be subject to a background check and must receive satisfactory results of the same, as a condition of joining the team. </li><li>By applying for this role, you confirm that all information submitted is accurate and complete. You further acknowledge that providing false or fraudulent information during the application process is cause for denial of an offer, revocation of any existing offer, or other adverse action, up to and including termination after the start of your commencement of work.</li></ul>\n<p>#US</p>\n<p><br /></p>","tags":"[\"legal\",\"aws\"]","pubDate":"2024-09-12 12:10:56.000","link":"https://duckduckgo.recruitee.com/o/legalcounselproduct","savedDate":"2024-09-16 04:49:58.342","slug":"legal-counsel-commercial-product-remote-duckduckgo-6536"},{"id":5724851522,"title":"AI Fluent Graphic Designer","company":"Contra","image":"https://remotive.com/job/1937174/logo","description":"<div class=\"h3\" id=\"a9a657ad-b9f2-4676-aa88-9383dea31de4\">About the role:</div>\n<p>Contra is looking for creative and tech-savvy AI-Fluent Graphic Designer to join our team. The ideal candidate is a highly skilled designer who is comfortable leveraging AI tools to streamline the design process, create innovative visual content, and enhance productivity. You will work closely with our creative and marketing teams to produce impactful designs that align with Contra's brand and business goals. You can balance creativity with technical efficiency, leveraging AI to enhance design speed and output.</p>\n<p> </p>\n<div class=\"h3\" id=\"9cb40dd2-5987-4bdc-a077-ffe803e6ab1f\">What you’ll deliver:</div>\n<ul class=\"_listContainer_1wyhh_1\" style=\"\">\n<li style=\"\">Create visually compelling graphics for a variety of platforms, including web, social media, digital ads, and print.</li>\n<li style=\"\">Utilize AI-powered design tools to optimize workflows and generate creative solutions.</li>\n<li style=\"\">Collaborate with marketing, content, and product teams to develop designs that meet project goals and brand guidelines.</li>\n<li style=\"\">Use AI for rapid prototyping, image generation, layout suggestions, and other design functions to boost creativity and efficiency.</li>\n<li style=\"\">Stay up-to-date on the latest AI design technologies, tools, and trends, and integrate them into your design process.</li>\n<li style=\"\">Maintain consistency across all designs, ensuring high-quality, on-brand deliverables.</li>\n<li style=\"\">Adapt designs based on feedback and provide quick revisions using AI-supported tools.</li>\n<li style=\"\">Assist in creating design templates, mockups, and wireframes to support UX/UI projects</li>\n</ul>\n<img src=\"https://remotive.com/job/track/1937174/blank.gif?source=public_api\" alt=\"\"/>","tags":"[\"social media\",\"UI/UX\",\"AI/ML\",\"graphic design\",\"prototyping\"]","pubDate":"2024-09-12 10:32:44.000","link":"https://remotive.com/remote-jobs/design/ai-fluent-graphic-designer-1937174","savedDate":"2024-09-16 04:49:58.340","slug":"ai-fluent-graphic-designer-contra-9828"},{"id":2540932658,"title":"Content Creator","company":"Contra","image":"https://remotive.com/job/1937172/logo","description":"<p>Contra is looking for Content Creators. The ideal candidate can produce engaging, high-quality content across various platforms. A strong storyteller with a knack for crafting compelling content that drives engagement and aligns with Contra's brand’s goals. You will be responsible for generating content for social media, blogs, websites, and other digital channels, ensuring it resonates with our target audience.</p>\n<p> </p>\n<div class=\"h3\" id=\"9cb40dd2-5987-4bdc-a077-ffe803e6ab1f\">What you’ll deliver:</div>\n<ul class=\"_listContainer_1wyhh_1\" style=\"\">\n<li style=\"\">Develop, write, and edit engaging content for social media, blogs, websites, and other digital platforms.</li>\n<li style=\"\">Collaborate with marketing, design, and other teams to create compelling visuals and multimedia content.</li>\n<li style=\"\">Research to ensure content is accurate, relevant, and up-to-date.</li>\n<li style=\"\">Monitor industry trends and audience preferences to inform content strategies.</li>\n<li style=\"\">Optimize content for SEO and ensure it adheres to brand guidelines and tone.</li>\n<li style=\"\">Edit and proofread content for accuracy, clarity, and consistency.</li>\n<li style=\"\">Manage content calendars and deliver content on time for campaigns and promotions.</li>\n<li style=\"\">Analyze content performance using analytics tools and suggest improvements.</li>\n<li style=\"\">Stay current with content trends, platform changes, and best practice</li>\n</ul>\n<img src=\"https://remotive.com/job/track/1937172/blank.gif?source=public_api\" alt=\"\"/>","tags":"[\"seo\",\"social media\",\"research\",\"analytics\"]","pubDate":"2024-09-12 10:25:39.000","link":"https://remotive.com/remote-jobs/writing/content-creator-1937172","savedDate":"2024-09-16 04:49:58.340","slug":"content-creator-contra-6247"},{"id":3298218563,"title":"Social Media Manager","company":"Contra","image":"https://remotive.com/job/1937171/logo","description":"<p>Contra is looking for a creative and strategic Social Media Manager to oversee our brand’s social media presence. The ideal candidate is an experienced social media expert who can create and implement effective strategies to engage our target audience, build brand awareness, and drive growth across multiple platforms. You will manage day-to-day social media activities, including content creation, community management, and performance analysis. You will work independently to create and implement effective social media strategies that align with Contra's brand's mission and goals.</p>\n<p> </p>\n<div class=\"h3\" id=\"9cb40dd2-5987-4bdc-a077-ffe803e6ab1f\">What you’ll deliver:</div>\n<ul class=\"_listContainer_1wyhh_1\" style=\"\">\n<li style=\"\">Develop and execute social media strategies to meet Contra's brand and marketing goals.</li>\n<li style=\"\">Create, schedule, and publish engaging content across social media platforms (Facebook, Instagram, Twitter, LinkedIn, TikTok, etc.).</li>\n<li style=\"\">Monitor social media channels, respond to comments, messages, and interact with followers to foster a strong online community.</li>\n<li style=\"\">Collaborate with the marketing and creative teams to align social media content with broader campaigns.</li>\n<li style=\"\">Use social media management tools (e.g., Hootsuite, Buffer, etc.) to plan and track content.</li>\n<li style=\"\">Analyze social media performance using analytics tools, generating reports, and identifying opportunities for improvement.</li>\n<li style=\"\">Stay up-to-date with industry trends, platform updates, and emerging best practices.</li>\n<li style=\"\">Manage paid social media advertising campaigns and optimize for performance.</li>\n<li style=\"\">Work with influencers, brand ambassadors, and partners to amplify content.</li>\n</ul>\n<img src=\"https://remotive.com/job/track/1937171/blank.gif?source=public_api\" alt=\"\"/>","tags":"[\"social media\",\"community management\",\"analytics\",\"advertising\"]","pubDate":"2024-09-12 10:25:10.000","link":"https://remotive.com/remote-jobs/marketing/social-media-manager-1937171","savedDate":"2024-09-16 04:49:58.340","slug":"social-media-manager-contra-3032"},{"id":6823417658,"title":"AI Video Editor","company":"Contra","image":"https://remotive.com/job/1937167/logo","description":"<div class=\"h3\" id=\"e79c2045-9b42-470d-9562-93b632eb5647\">About the role</div>\n<p>We are seeking a talented AI Video Editor. As an AI Video Editor, you will leverage your skills to produce high-quality video content. This role is perfect for those who are passionate about video editing and are eager to work in a dynamic and independent environment. This role requires a deep understanding of video editing processes, strong creative instincts, and experience working with AI-powered platforms.</p>\n<p> </p>\n<div class=\"h3\" id=\"b2db80b6-488c-43b8-9cc7-f55c2d2c4bd1\">What you’ll be doing</div>\n<ul class=\"_listContainer_1wyhh_1\" style=\"\">\n<li style=\"\">Edit and create engaging video content using AI tools.</li>\n<li style=\"\">Collaborate with our team to understand project requirements and deliverables.</li>\n<li style=\"\">Ensure all video content meets our quality standards and aligns with our brand guidelines.</li>\n<li style=\"\">Integrate AI-based insights for video performance, analyzing engagement and viewer behavior for iterative improvements.</li>\n<li style=\"\">Apply AI to create dynamic visual effects, motion graphics, and animations that align with project goals.</li>\n<li style=\"\">Experiment with AI techniques to create innovative and original video content, including AI-generated subtitles, automated scene changes, and facial recognition for editing.</li>\n</ul>\n<img src=\"https://remotive.com/job/track/1937167/blank.gif?source=public_api\" alt=\"\"/>","tags":"[\"video\",\"AI/ML\",\"editing\",\"video editing\",\"motion design\"]","pubDate":"2024-09-12 10:24:09.000","link":"https://remotive.com/remote-jobs/all-others/ai-video-editor-1937167","savedDate":"2024-09-16 04:49:58.340","slug":"ai-video-editor-contra-8942"},{"id":4047731976,"title":"Brand Designer","company":"Contra","image":"https://remotive.com/job/1937170/logo","description":"<p>Contra is looking for a Brand Designer to develop and execute creative visual solutions that represent and enhance our brand identity. The ideal candidate will have a strong eye for design, an understanding of brand strategy, and the ability to translate brand values into impactful visuals across various mediums. You will collaborate with marketing, product, and other teams to ensure cohesive and consistent branding. As a brand designer, you will play a key role in shaping the visual identity of our networking platform, giving our users the freedom and opportunity to work independently.</p>\n<p> </p>\n<div class=\"h3\" id=\"9cb40dd2-5987-4bdc-a077-ffe803e6ab1f\">What you’ll deliver:</div>\n<ul class=\"_listContainer_1wyhh_1\" style=\"\">\n<li style=\"\">Design and develop brand assets, including logos, typography, color schemes, and style guides.</li>\n<li style=\"\">Create visually compelling content for web, social media, print, and other marketing channels.</li>\n<li style=\"\">Collaborate with cross-functional teams to ensure a consistent brand identity across all touchpoints.</li>\n<li style=\"\">Maintain and evolve brand guidelines, ensuring that all internal and external materials adhere to Contra's brand standards.</li>\n<li style=\"\">Conceptualize and execute design projects such as packaging, product visuals, presentations, and event materials.</li>\n<li style=\"\">Work closely with marketing and content teams to create on-brand visuals that align with campaigns and objectives.</li>\n<li style=\"\">Stay up to date with design trends and best practices to ensure the brand remains relevant and fresh.</li>\n<li style=\"\">Present design concepts to stakeholders and incorporate feedback effectively.</li>\n<li style=\"\">Manage multiple projects simultaneously while adhering to deadlines and quality standards.</li>\n</ul>\n<img src=\"https://remotive.com/job/track/1937170/blank.gif?source=public_api\" alt=\"\"/>","tags":"[\"social media\",\"packaging\",\"brand design\"]","pubDate":"2024-09-12 10:23:40.000","link":"https://remotive.com/remote-jobs/design/brand-designer-1937170","savedDate":"2024-09-16 04:49:58.340","slug":"brand-designer-contra-9413"},{"id":6664593727,"title":"Product Designer","company":"Contra","image":"https://remotive.com/job/1937169/logo","description":"<p>Contra is looking for a creative Product Designer. The ideal candidate will be responsible for designing intuitive, user-centric products that enhance user experience and align with Contra's business goals. As a Product Designer, you will collaborate closely with product managers, engineers, and other stakeholders to bring ideas from concept to execution, ensuring the final product is functional and visually appealing. This is an exciting opportunity for creative individuals who thrive in a collaborative environment and are passionate about user-centric design.</p>\n<p> </p>\n<div class=\"h3\" id=\"9cb40dd2-5987-4bdc-a077-ffe803e6ab1f\">What you’ll deliver:</div>\n<ul class=\"_listContainer_1wyhh_1\" style=\"\">\n<li style=\"\">Lead the design process from ideation to execution for new product features and enhancements.</li>\n<li style=\"\">Create wireframes, prototypes, and high-fidelity designs that effectively communicate design concepts and solutions.</li>\n<li style=\"\">Collaborate with product managers and engineers to understand product requirements and user needs.</li>\n<li style=\"\">Conduct user research, and usability testing, and gather feedback to refine and improve designs.</li>\n<li style=\"\">Ensure a seamless and engaging user experience by incorporating user feedback, data, and best practices into your designs.</li>\n<li style=\"\">Maintain and evolve design systems, ensuring consistency across all product interfaces.</li>\n<li style=\"\">Work within agile teams to deliver design assets in a timely manner and support development teams during implementation.</li>\n<li style=\"\">Stay up-to-date with the latest design trends, tools, and technologies to continuously improve Contra's product design.</li>\n</ul>\n<img src=\"https://remotive.com/job/track/1937169/blank.gif?source=public_api\" alt=\"\"/>","tags":"[\"agile\",\"research\",\"testing\"]","pubDate":"2024-09-12 10:22:08.000","link":"https://remotive.com/remote-jobs/design/product-designer-1937169","savedDate":"2024-09-16 04:49:58.340","slug":"product-designer-contra-6431"},{"id":6659629084,"title":"AI Video Creator","company":"Contra","image":"https://remotive.com/job/1937166/logo","description":"<div class=\"h4\" id=\"a5332034-4f5f-48a3-830e-0a64117d4ad1\">About the position</div>\n<p>We are looking for a skilled AI Video Creator. The ideal candidate will have a passion for video creation and a strong understanding of AI tools that automate and enhance the video production process. This role combines technical expertise with creative vision to create compelling video content at scale.</p>\n<p> </p>\n<div class=\"h4\" id=\"822c8af2-5b98-477f-8266-4864587a3b4d\">What you’ll achieve</div>\n<ul class=\"_listContainer_1wyhh_1\" style=\"\">\n<li style=\"\">Develop high-quality videos using AI tools and software</li>\n<li style=\"\">Collaborate with the team to conceptualize and produce video content</li>\n<li style=\"\">Stay updated on industry trends, emerging AI video creation tools, and best practices.</li>\n<li style=\"\">Analyze and refine AI-generated content, making necessary adjustments to ensure videos meet creative and brand standards</li>\n<li style=\"\">Customize AI-generated content to fit brand guidelines and ensure that the final output aligns with project objectives.</li>\n<li style=\"\">Manage multiple video projects simultaneously, ensuring timely delivery and high-quality output.</li>\n<li style=\"\">Monitor video performance metrics (views, engagement, click-through rates) and use AI-based analytics to suggest content improvements.</li>\n</ul>\n<img src=\"https://remotive.com/job/track/1937166/blank.gif?source=public_api\" alt=\"\"/>","tags":"[\"video\",\"AI/ML\",\"analytics\",\"video production\"]","pubDate":"2024-09-12 10:14:04.000","link":"https://remotive.com/remote-jobs/all-others/ai-video-creator-1937166","savedDate":"2024-09-16 04:49:58.340","slug":"ai-video-creator-contra-5123"},{"id":9409400964,"title":"AI Engineer","company":"Contra","image":"https://remotive.com/job/1937168/logo","description":"<div class=\"h3\" id=\"189ddca3-b252-4731-a8c0-733bc6202985\">About the role:</div>\n<p>Contra is looking for a skilled and innovative AI Engineer. The ideal candidate will have a strong background in artificial intelligence, machine learning, and data science, with a passion for designing and implementing AI-driven solutions. You will work closely with cross-functional teams to develop, deploy, and maintain AI models and algorithms that address business challenges and improve products. As an AI Engineer, you will have the opportunity to work independently on innovative AI projects.</p>\n<p> </p>\n<div class=\"h3\" id=\"732faa39-ba77-46af-97c9-a4879f80b962\">What you’ll deliver:</div>\n<ul class=\"_listContainer_1wyhh_1\" style=\"\">\n<li style=\"\">Design, develop, and implement machine learning models and AI algorithms to solve real-world problems.</li>\n<li style=\"\">Collaborate with data scientists, engineers, and product teams to integrate AI solutions into products and services.</li>\n<li style=\"\">Analyze large datasets to extract insights, train models, and enhance predictive accuracy.</li>\n<li style=\"\">Optimize models for performance, scalability, and efficiency.</li>\n<li style=\"\">Monitor and maintain AI systems, ensuring they are reliable and operate in production environments.</li>\n<li style=\"\">Research and experiment with new AI tools, frameworks, and technologies to enhance existing systems.</li>\n<li style=\"\">Conduct model validation, testing, and performance analysis to ensure high-quality deliverables.</li>\n<li style=\"\">Document AI processes, techniques, and model outcomes to share with the broader team.</li>\n<li style=\"\">Stay current with advancements in AI, machine learning, deep learning, and data science to ensure Contra's solutions remain cutting-edge.</li>\n</ul>\n<img src=\"https://remotive.com/job/track/1937168/blank.gif?source=public_api\" alt=\"\"/>","tags":"[\"data science\",\"AI/ML\",\"research\",\"deep learning\",\"testing\"]","pubDate":"2024-09-12 10:04:30.000","link":"https://remotive.com/remote-jobs/software-dev/ai-engineer-1937168","savedDate":"2024-09-16 04:49:58.340","slug":"ai-engineer-contra-9019"},{"id":2639967130,"title":"Senior Editor","company":"The Heartbeat Fund","image":"https://remotive.com/job/1937153/logo","description":"<p dir=\"ltr\" style=\"line-height: 1.656; margin-top: 12pt; margin-bottom: 12pt;\"><span style=\"color: #000000; background-color: transparent; font-weight: bold; font-style: normal; font-variant: normal; text-decoration: none; vertical-align: baseline; white-space: pre-wrap;\">Position Overview:</span><span style=\"color: #000000; background-color: transparent; font-weight: 400; font-style: normal; font-variant: normal; text-decoration: none; vertical-align: baseline; white-space: pre-wrap;\"> </span></p>\n<p dir=\"ltr\" style=\"line-height: 1.656; margin-top: 12pt; margin-bottom: 12pt;\"><span style=\"color: #000000; background-color: transparent; font-weight: 400; font-style: normal; font-variant: normal; text-decoration: none; vertical-align: baseline; white-space: pre-wrap;\">We are seeking an experienced romance novel author with excellent writing and editing skills to join our growing team as a Senior Editor to help us grow our library of curated books. We’re not just looking for an editor - we’re seeking a visionary who can breathe new life into love stories. This is a full-time and fully remote position, offering flexibility and creative freedom. As our Senior Editor, you’ll be the alchemist who turns good stories into unforgetting experiences, alongside our growing team of creatives. </span></p>\n<p dir=\"ltr\" style=\"line-height: 1.656; margin-top: 12pt; margin-bottom: 12pt;\"><span style=\"color: #000000; background-color: transparent; font-weight: bold; font-style: normal; font-variant: normal; text-decoration: none; vertical-align: baseline; white-space: pre-wrap;\">What Sets You Apart:</span></p>\n<ul style=\"\">\n<li dir=\"ltr\" style=\"\">\n<p dir=\"ltr\" style=\"line-height: 1.656; margin-top: 12pt; margin-bottom: 0pt;\"><span style=\"color: #000000; background-color: transparent; font-weight: 400; font-style: normal; font-variant: normal; text-decoration: none; vertical-align: baseline; white-space: pre-wrap;\">You love romance novels and read at least 4-5 a month</span></p>\n</li>\n<li dir=\"ltr\" style=\"\">\n<p dir=\"ltr\" style=\"line-height: 1.656; margin-top: 0pt; margin-bottom: 0pt;\"><span style=\"color: #000000; background-color: transparent; font-weight: 400; font-style: normal; font-variant: normal; text-decoration: none; vertical-align: baseline; white-space: pre-wrap;\">You’ve either written or ghostwritten 3 romance novels that have been published, and can link those books for us to review</span></p>\n</li>\n<li dir=\"ltr\" style=\"\">\n<p dir=\"ltr\" style=\"line-height: 1.656; margin-top: 0pt; margin-bottom: 0pt;\"><span style=\"color: #000000; background-color: transparent; font-weight: 400; font-style: normal; font-variant: normal; text-decoration: none; vertical-align: baseline; white-space: pre-wrap;\">You have minimum 3 years of experience writing or editing professionally</span></p>\n</li>\n<li dir=\"ltr\" style=\"\">\n<p dir=\"ltr\" style=\"line-height: 1.656; margin-top: 0pt; margin-bottom: 0pt;\"><span style=\"color: #000000; background-color: transparent; font-weight: 400; font-style: normal; font-variant: normal; text-decoration: none; vertical-align: baseline; white-space: pre-wrap;\">You have a perfect grasp of written and spoken English</span></p>\n</li>\n<li dir=\"ltr\" style=\"\">\n<p dir=\"ltr\" style=\"line-height: 1.656; margin-top: 0pt; margin-bottom: 0pt;\"><span style=\"color: #000000; background-color: transparent; font-weight: 400; font-style: normal; font-variant: normal; text-decoration: none; vertical-align: baseline; white-space: pre-wrap;\">Deep understanding of what people want to read when it comes to romance stories</span></p>\n</li>\n<li dir=\"ltr\" style=\"\">\n<p dir=\"ltr\" style=\"line-height: 1.656; margin-top: 0pt; margin-bottom: 0pt;\"><span style=\"color: #000000; background-color: transparent; font-weight: 400; font-style: normal; font-variant: normal; text-decoration: none; vertical-align: baseline; white-space: pre-wrap;\">You have the ability to work independently and can collaborate cross-functionally when you need to</span></p>\n</li>\n<li dir=\"ltr\" style=\"\">\n<p dir=\"ltr\" style=\"line-height: 1.656; margin-top: 0pt; margin-bottom: 0pt;\"><span style=\"color: #000000; background-color: transparent; font-weight: 400; font-style: normal; font-variant: normal; text-decoration: none; vertical-align: baseline; white-space: pre-wrap;\">You can be brutally honest with edits that are needed to improve a story</span></p>\n</li>\n<li dir=\"ltr\" style=\"\">\n<p dir=\"ltr\" style=\"line-height: 1.656; margin-top: 0pt; margin-bottom: 12pt;\"><span style=\"color: #000000; background-color: transparent; font-weight: 400; font-style: normal; font-variant: normal; text-decoration: none; vertical-align: baseline; white-space: pre-wrap;\">You have strong organizational and project management skills, with an ability to meet tight deadlines</span></p>\n</li>\n</ul>\n<p dir=\"ltr\" style=\"line-height: 1.656; margin-top: 12pt; margin-bottom: 12pt;\"><span style=\"color: #000000; background-color: transparent; font-weight: bold; font-style: normal; font-variant: normal; text-decoration: none; vertical-align: baseline; white-space: pre-wrap;\">What You’ll Do:</span></p>\n<ul style=\"\">\n<li dir=\"ltr\" style=\"\">\n<p dir=\"ltr\" style=\"line-height: 1.656; margin-top: 12pt; margin-bottom: 0pt;\"><span style=\"color: #000000; background-color: transparent; font-weight: 400; font-style: normal; font-variant: normal; text-decoration: none; vertical-align: baseline; white-space: pre-wrap;\">Identify and choose the most compelling plots that you know are addictive page-turners</span></p>\n</li>\n<li dir=\"ltr\" style=\"\">\n<p dir=\"ltr\" style=\"line-height: 1.656; margin-top: 0pt; margin-bottom: 0pt;\"><span style=\"color: #000000; background-color: transparent; font-weight: 400; font-style: normal; font-variant: normal; text-decoration: none; vertical-align: baseline; white-space: pre-wrap;\">Deep-dive into editing and polishing the stories; noting inconsistencies in tone, pacing or where improvements can be made overall</span></p>\n</li>\n<li dir=\"ltr\" style=\"\">\n<p dir=\"ltr\" style=\"line-height: 1.656; margin-top: 0pt; margin-bottom: 0pt;\"><span style=\"color: #000000; background-color: transparent; font-weight: 400; font-style: normal; font-variant: normal; text-decoration: none; vertical-align: baseline; white-space: pre-wrap;\">Ensure the narrative voice and pacing of each book remains consistent and genre or trope-specific</span></p>\n</li>\n<li dir=\"ltr\" style=\"\">\n<p dir=\"ltr\" style=\"line-height: 1.656; margin-top: 0pt; margin-bottom: 0pt;\"><span style=\"color: #000000; background-color: transparent; font-weight: 400; font-style: normal; font-variant: normal; text-decoration: none; vertical-align: baseline; white-space: pre-wrap;\">Keep tabs on romance novel trends and work them into plotlines, whenever and wherever appropriate</span></p>\n</li>\n<li dir=\"ltr\" style=\"\">\n<p dir=\"ltr\" style=\"line-height: 1.656; margin-top: 0pt; margin-bottom: 0pt;\"><span style=\"color: #000000; background-color: transparent; font-weight: 400; font-style: normal; font-variant: normal; text-decoration: none; vertical-align: baseline; white-space: pre-wrap;\">Manage yourself and your work independently, staying on top of the books you are working on</span></p>\n</li>\n<li dir=\"ltr\" style=\"\">\n<p dir=\"ltr\" style=\"line-height: 1.656; margin-top: 0pt; margin-bottom: 12pt;\"><span style=\"color: #000000; background-color: transparent; font-weight: 400; font-style: normal; font-variant: normal; text-decoration: none; vertical-align: baseline; white-space: pre-wrap;\">You must be open to working across all popular romance sub-genres and tropes</span></p>\n</li>\n</ul>\n<p dir=\"ltr\" style=\"line-height: 1.656; margin-top: 12pt; margin-bottom: 12pt;\"><span style=\"color: #000000; background-color: transparent; font-weight: bold; font-style: normal; font-variant: normal; text-decoration: none; vertical-align: baseline; white-space: pre-wrap;\">What We Offer</span></p>\n<ul style=\"\">\n<li dir=\"ltr\" style=\"\">\n<p dir=\"ltr\" style=\"line-height: 1.656; margin-top: 12pt; margin-bottom: 0pt;\"><span style=\"color: #000000; background-color: transparent; font-weight: 400; font-style: normal; font-variant: normal; text-decoration: none; vertical-align: baseline; white-space: pre-wrap;\">The compensation range for this position is: $62,000 - $64,000 USD</span></p>\n</li>\n<li dir=\"ltr\" style=\"\">\n<p dir=\"ltr\" style=\"line-height: 1.656; margin-top: 0pt; margin-bottom: 0pt;\"><span style=\"color: #000000; background-color: transparent; font-weight: 400; font-style: normal; font-variant: normal; text-decoration: none; vertical-align: baseline; white-space: pre-wrap;\">Anything you need to up-grade your home office to ensure a productive work environment</span></p>\n</li>\n<li dir=\"ltr\" style=\"\">\n<p dir=\"ltr\" style=\"line-height: 1.656; margin-top: 0pt; margin-bottom: 0pt;\"><span style=\"color: #000000; background-color: transparent; font-weight: 400; font-style: normal; font-variant: normal; text-decoration: none; vertical-align: baseline; white-space: pre-wrap;\">Independence and freedom to manage your own schedule as long as you meet the KPIs</span></p>\n</li>\n<li dir=\"ltr\" style=\"\">\n<p dir=\"ltr\" style=\"line-height: 1.656; margin-top: 0pt; margin-bottom: 12pt;\"><span style=\"color: #000000; background-color: transparent; font-weight: 400; font-style: normal; font-variant: normal; text-decoration: none; vertical-align: baseline; white-space: pre-wrap;\">A fast-paced team and culture</span></p>\n</li>\n</ul>\n<p dir=\"ltr\" style=\"line-height: 1.656; margin-top: 12pt; margin-bottom: 12pt;\"><span style=\"color: #000000; background-color: transparent; font-weight: bold; font-style: normal; font-variant: normal; text-decoration: none; vertical-align: baseline; white-space: pre-wrap;\">Candidate Referral Program</span></p>\n<p dir=\"ltr\" style=\"line-height: 1.656; margin-top: 12pt; margin-bottom: 12pt;\"><span style=\"color: #000000; background-color: transparent; font-weight: 400; font-style: normal; font-variant: normal; text-decoration: none; vertical-align: baseline; white-space: pre-wrap;\">If you know someone who would be a great fit for this role, and you’re interested in possibly earning $1,500 - fill out this form or email us at </span><a href=\"mailto:writers@theheartbeatfund.com\" rel=\"nofollow\" style=\"text-decoration: none;\"><span style=\"color: #1155cc; background-color: transparent; font-weight: 400; font-style: normal; font-variant: normal; text-decoration: underline; -webkit-text-decoration-skip: none; text-decoration-skip-ink: none; vertical-align: baseline; white-space: pre-wrap;\">writers@theheartbeatfund.com</span></a><span style=\"color: #000000; background-color: transparent; font-weight: 400; font-style: normal; font-variant: normal; text-decoration: none; vertical-align: baseline; white-space: pre-wrap;\"> with ‘referral’ in the title. If your referred candidate is hired by The Heartbeat Fund, we will pay you a referral fee of $1,500. Please note that if we are already in contact with the referred candidate </span><span style=\"color: #000000; background-color: transparent; font-weight: 400; font-style: italic; font-variant: normal; text-decoration: none; vertical-align: baseline; white-space: pre-wrap;\">prior</span><span style=\"color: #000000; background-color: transparent; font-weight: 400; font-style: normal; font-variant: normal; text-decoration: none; vertical-align: baseline; white-space: pre-wrap;\"> to your referral, you will not be eligible for the Referral Bonus. The Heartbeat Fund retains the right to make all final decisions when it comes to the Referral Bonus or Candidate Referral Program</span></p>\n<p dir=\"ltr\" style=\"line-height: 1.656; margin-top: 12pt; margin-bottom: 12pt;\"><span style=\"color: #000000; background-color: transparent; font-weight: bold; font-style: normal; font-variant: normal; text-decoration: none; vertical-align: baseline; white-space: pre-wrap;\">How to Apply</span> </p>\n<p dir=\"ltr\" style=\"line-height: 1.656; margin-top: 12pt; margin-bottom: 12pt;\"><span style=\"color: #000000; background-color: transparent; font-weight: 400; font-style: normal; font-variant: normal; text-decoration: none; vertical-align: baseline; white-space: pre-wrap;\">Please email us with your CV, cover letter and a link to your 3 published books (ghostwritten is OK, but please let us know) at </span><a href=\"mailto:writers@theheartbeatfund.com\" rel=\"nofollow\" style=\"text-decoration: none;\"><span style=\"color: #1155cc; background-color: transparent; font-weight: 400; font-style: normal; font-variant: normal; text-decoration: underline; -webkit-text-decoration-skip: none; text-decoration-skip-ink: none; vertical-align: baseline; white-space: pre-wrap;\">writers@theheartbeatfund.com</span></a><span style=\"color: #000000; background-color: transparent; font-weight: 400; font-style: normal; font-variant: normal; text-decoration: none; vertical-align: baseline; white-space: pre-wrap;\"> </span></p>\n<img src=\"https://remotive.com/job/track/1937153/blank.gif?source=public_api\" alt=\"\"/>","tags":"[\"project management\",\"editing\"]","pubDate":"2024-09-12 09:08:27.000","link":"https://remotive.com/remote-jobs/writing/senior-editor-1937153","savedDate":"2024-09-16 04:49:58.340","slug":"senior-editor-the-heartbeat-fund-4040"},{"id":8363865354,"title":"Front-End Developer (worldwide remote, work anywhere)","company":"CloudLinux","image":"https://pbs.twimg.com/profile_images/696718028084482050/ymY3OEPk_400x400.png","description":"<p>CloudLinux is a global remote-first company. We are driven by our principles: Do the right thing, employees first, we are remote first, and&nbsp; we deliver high volume, low-cost Linux infrastructure and security products that help companies to increase the efficiency of their operations. Every person on our team supports each other and does what we can to ensure everyone is successful. We are truly a great place to work. For more details about our company go to <a href=\"http://cloudlinux.com/\" rel=\"nofollow noreferrer noopener\" class=\"external\">CloudLinux</a>.</p><p>We are actively seeking a Front-End Developer to become an integral part of our dynamic CloudLinux Network team.</p><p>CLN is an integral SaaS platform tasked with the licensing of all CloudLinux products. It manages server operations and oversees the billing process for customers. This is a unique self-provisioning system created by CloudLinux for internal needs. The automated, easy-to-use robust solution delivers comprehensive and complete user experience. We will give you a place to strive and grow, where you will have the opportunity to work on interesting, yet challenging product. Applying your thinking to build a better system founded on intelligent technologies.</p><p>The perfect candidate will possess an in-depth understanding of Angular, complemented by prior experience in backend development and familiarity with various other frameworks.</p><p>We offer a fully remote work environment with flexible hours, allowing you the freedom to structure your day and work from any location worldwide. Join us in our mission to provide top-tier services to our valued customers.<a href=\"https://docs.cloudlinux.com/cln/introduction/\" target=\"_blank\" rel=\"nofollow noreferrer noopener\" class=\"external\"></a></p><p></p><p><strong>What you will do:</strong></p><p>As a key member of our team, you will spend approximately 80% of your time crafting a user-friendly customer portal. This platform will empower our clients to effortlessly manage their subscriptions and servers, while also providing an intuitive admin panel designed to deliver an unparalleled licensing and billing experience.</p><p>Occasionally, you will also be able to contribute to diverse front-end projects for our Extended Lifecycle Support (ELS) initiative. ELS is our commitment to helping organizations securely utilize Linux distributions and software languages that have reached their end of life or no longer receive standard security support. We provide essential vulnerability patches for unsupported versions of CentOS, CentOS Stream, Ubuntu, Debian, Oracle Linux, PHP, Python, and the Spring software development framework.</p><h3>Requirements: </h3><p><strong>To thrive in this role, we are looking for someone who has:</strong></p><ul> <li>5+ years of experience with Javascript.</li> <li>Strong knowledge of TypeScript/JavaScript, Angular.</li> <li>Experience and understanding of optimization principles.</li> <li>The practice of unit testing.</li> <li>Experience HTML &amp; CSS/SCSS.</li> <li>Version control/code management (git).</li> <li>Intermediate level of English.<br> </li> </ul><p><strong>It would be great if you also have:</strong></p><ul> <li>Experience in backend and PHP.</li> <li>Knowledge of NodeJS, Lumen, VueJS.</li> <li>Experience with Database IDE, such as MySQL.<br> </li> </ul><p><strong>Personal skills:</strong></p><ul> <li>Decency, responsibility, and a high level of discipline.</li> <li>Fast-learning, proactivity.</li> <li>Desire to work in a fast-paced growing environment.</li> <li>Strong self-motivation, driven to achieve committed milestones.</li> <li>Ability to independently analyze a task and find the right solution.</li> <li>Ability to work in a team.</li> </ul><h3>Benefits: </h3><p><strong>What's in it for you?</strong></p><ul> <li>A focus on professional development</li> <li>Interesting and challenging projects</li> <li>Fully remote work with flexible working hours, that allows you to schedule your day and work from any location worldwide</li> <li>Paid 24 days of vacation per year, 10 days of national holidays, and unlimited sick leaves</li> <li>Compensation for private medical insurance</li> <li>Co-working and gym/sports reimbursement</li> <li>Budget for education</li> <li>The opportunity to receive a reward for the most innovative idea that the company can patent</li> </ul><p></p><p><em>By applying for this position, you agree with the CloudLinux Privacy Policy - </em><a href=\"https://cloudlinux.com/privacy-policy\" target=\"_blank\" rel=\"nofollow noreferrer noopener\" class=\"external\">https://cloudlinux.com/privacy-policy</a><a href=\"https://cloudlinux.com/privacy-policy\" target=\"_blank\" rel=\"nofollow noreferrer noopener\" class=\"external\"></a><em> and give us your consent to maintain and process your personal data in this respect. Please read our Privacy Policy for more information - </em><a href=\"https://cloudlinux.com/privacy-policy\" target=\"_blank\" rel=\"nofollow noreferrer noopener\" class=\"external\">https://cloudlinux.com/privacy-policy</a><em> .</em></p>","tags":"[\"javascript\",\"typescript\",\"management\",\"database\",\"mysql\"]","pubDate":"2024-09-12 00:00:00.000","link":"https://apply.workable.com/cloudlinux-1/j/9286FE20AF","savedDate":"2024-09-16 04:49:58.344","slug":"front-end-developer-worldwide-remote-work-anywhere-cloudlinux-7850"},{"id":9060202847,"title":"Lead Growth Engineer","company":"Circle","image":"https://dka575ofm4ao0.cloudfront.net/pages-transactional_logos/retina/155354/circle-icon-dark.png","description":"<div><b style=\"font-size: 18px\">About Us</b></div><div>Circle is building the world’s leading all-in-one platform for online communities. We make it possible for creators, coaches, educators, and businesses to bring together their audience with engaging discussions, live streams, events, chat, courses, and payments — all in one place, all under their own brand.</div><div><br></div><div>We’re proud to be a fully remote company of around 170 (and growing!) team members from 30+ countries around the world. We seek exceptional individuals around the world, set them up to do the best work of their lives, and in turn, create a meaningful impact in their own lives. We don't track hours, but we do manage for high expectations very closely. We collaborate across time zones, are highly async, and like to document a lot.</div><div><br></div><div>Twice a year, we bring the whole company together in beautiful places around the world for our company offsites. So far, we’ve hosted offsites in Turkey, Portugal, Mexico, Thailand, Colombia, and Italy, with more to come!</div><div><br></div><div><b style=\"font-size: 18px;\">About the role</b></div><div>We’re looking for a Lead Growth Engineer to supercharge our product’s growth by crafting data-driven experiments that directly impact user acquisition, increase MRR, reduce churn, and support all go-to-market functions. Whether you’re optimizing onboarding flows to boost sign-ups, refining billing infrastructure with our payment providers to enhance subscription models, or building internal tools for the sales team, you’ll be at the forefront of our growth strategy. You'll work closely with Sales to identify friction points and improve conversion paths, and with a global team of two senior engineers and a product leader who brings years of experience growing products. This is a hands-on, cross-functional role where you'll drive key decisions, collaborate closely with marketing, sales, and internal teams, and turn insights into impactful actions that help us scale Circle.  </div><div><br></div><div>This year, our growth team has already driven significant expansion revenue through subscription upgrade paths, enhanced our billing infrastructure to support geographic expansion and new product launches, rebuilt our marketing attribution flows, and redesigned our onboarding experience for our recent <a rel=\"noopener noreferrer\" class=\"postings-link\" href=\"https://circle.so/v3\">Circle 3.0 launch</a>. If this sounds exciting to you, we’d love to chat!</div><div><span style=\"font-size: 13.3333px;\">The cash compensation range shown is a starting point. In addition to equity, benefits and perks, your cash compensation is subject to an annual review and increase on a once per year basis.</span></div><h3>What you'll be doing</h3><li>Shipping often and with care, balancing speed with thoughtful, quality work.</li><li>Leading and mentoring a global team of engineers, driving execution and fostering continuous growth.</li><li>Developing and executing data-driven experiments to boost user acquisition, retention, and MRR.</li><li>Collaborating across the go-to-market org, aligning with sales and marketing to achieve growth targets.</li><li>Rethinking and refining our billing infrastructure to grow MRR and provide pricing transparency to Circle communities</li><li>Working on a team obsessed with product-led growth, constantly iterating and pushing boundaries.</li><li>Owning end-to-end project management, from concept to execution, for impactful results.</li><li>Designing and implementing A/B tests to validate changes and drive measurable improvements.</li><li>Analyzing user data proactively to identify growth opportunities and refine the product experience.</li><li>Engaging regularly with internal stakeholders to align on growth priorities and initiatives seamlessly.</li>,<h3>What you'll need to be successful</h3><li>Strong alignment with our values. <a rel=\"noopener noreferrer\" class=\"postings-link\" href=\"https://www.notion.so/Circle-Careers-223a15ea312c4922b793593d07add7fe?pvs=21\">Find our values on our career page</a> if you haven’t read up on them yet.</li><li>You are proficient in English (spoken, written, and reading) at a <a rel=\"noopener noreferrer\" class=\"postings-link\" href=\"https://magoosh.com/english-speaking/english-proficiency-levels-a-guide-to-determining-your-level/\">CEFR Level C2</a> / <a rel=\"noopener noreferrer\" class=\"postings-link\" href=\"https://www.govtilr.org/\">ILR Level 5</a>.</li><li>You have&nbsp;at least<b> 2 years of&nbsp;experience leading and mentoring engineers</b>, ideally in growth-focused environments.</li><li>You have <b>5+ years of hands-on full-stack development experience</b>, with deep knowledge of <b>Ruby on Rails, React, Sidekiq, Kafka </b>and payment integrations<b>&nbsp;</b>(we heavily use <b>Stripe</b>).</li><li>You have a knack for product-led growth and love experimenting with A/B tests, data analysis, and optimization.</li><li>You’re great at managing projects end-to-end and thrive on turning ideas into action.</li><li>You think strategically but aren’t afraid to roll up your sleeves for tactical work.</li><li>You communicate clearly, aligning teams and explaining technical things in a way everyone gets.</li><li>You’re a self-starter who takes initiative and enjoys a fast-paced, ever-evolving environment.</li><li>You’re data-driven, constantly using insights to validate your next move.</li><li>You’re passionate about creating user-centric solutions that drive growth and make a real impact.</li>,<h3>Bonus points</h3><li>Examples of using AI tools to do data analysis, boost your productivity, or solving cool problems.</li><li>Familiarity with growth strategies in community / creator platforms.</li><li>Previous experience working with or integrating payment providers (i.e. <b>Stripe</b>).</li><li>Familiarity with usage-based subscription and membership models.</li><li>Strong background in UX/UI design principles - every pixel counts.</li><li>Experience in scaling teams or building engineering processes in fast-growing startups.</li><li>Previous experience as a founder or in a highly entrepreneurial environment.</li><div><span style=\"font-size: 18px\"><b>The fun stuff</b></span></div><div>Fully remote:&nbsp;work from anywhere in the world!</div><div>Autonomy and trust to do your job:&nbsp;we care about outcomes over everything else.</div><div>Paid time away:&nbsp;all employees are given 35 days of PTO annually. We also offer a paid sabbatical after 5 years.</div><div>Generous U.S. benchmarked compensation&nbsp;and startup equity no matter where you are in the world.*</div><div>Awesome medical coverage&nbsp;with 100% coverage for you and your family, or medical reimbursement options where applicable!*</div><div>Parental leave&nbsp;for parents expanding their family, or just starting one.</div><div>Home office stipend&nbsp;to help you get up and running.</div><div>Learning &amp; development stipend&nbsp;to help you level up your professional skills.</div><div>Annual bonus potential&nbsp;for roles that don't already receive variable income or commission.</div><div>Company retreats:&nbsp;Twice a year, the Circle team gets together for a fully paid company retreat in incredible places around the world! We’ve had past retreats in Colombia, Portugal, and Mexico, with more planned on the horizon.</div><div>Check out our&nbsp;<a href=\"https://careers.circle.so/\">Careers</a>&nbsp;page for more.</div><div><span style=\"font-size: 10px\">*</span><i style=\"font-size: 10px\">Your role, location and unique circumstance may affect this.</i></div><div><br></div><div><span style=\"font-size: 18px\"><b>Diversity, Equity &amp; Inclusion</b></span></div><div>As a fully-remote international company, diversity is baked into our DNA. Here’s how our CEO, Sid Yadav, frames our hiring mission: “let’s find talent in underserved and under-represented corners of the world, set them up to do the best work of their lives, and in turn, change their life.” To achieve this hiring mission, we offer competitive&nbsp;U.S. benchmarked&nbsp;compensation no matter where someone’s located in the world, and we proactively seek candidates who expand representation of backgrounds, cultures and lived experiences in our teams.</div><div><br></div><div><span style=\"font-size: 18px\"><b>Equal Employment Opportunity</b></span></div><div>Circle is an equal opportunity employer and as such, we do not discriminate on the basis of race, color, religion, sex, sexual orientation, gender identity, national origin, age, disability, or any other characteristic protected by applicable laws.</div><div>If you require any accommodations during the recruitment process, please let us know and we will work with you to meet your needs.</div>","tags":"[\"management\",\"engineering\",\"aws\"]","pubDate":"2024-09-11 15:31:00.695","link":"https://jobs.lever.co/circleco/d1d97a4e-9555-4868-85c3-e9645f194dd5","savedDate":"2024-09-16 04:49:58.347","slug":"lead-growth-engineer-circle-5388"},{"id":8419091302,"title":"Product Specialist (W)","company":"Blue Coding","image":"https://media.licdn.com/dms/image/C4D0BAQHlK67hgnhzQw/company-logo_200_200/0/1631346154820?e=2147483647&v=beta&t=_R2Ssj7L_f4xqmSCcq0nOLCyCz0QN2lFnHssxxhj3YY","description":"<div><i style=\"font-size: 18px\">Do you want to earn a salary in USD?&nbsp;</i></div><div><i style=\"font-size: 18px\">Would you like to work from wherever you want?</i></div><div><i style=\"font-size: 18px\">Would you like to be a part of the leading next-gen software developers?&nbsp;</i></div><div><br></div><div><b style=\"font-size: 24px\">Hi, you finally found us!</b><span style=\"font-size: 24px\">&nbsp;</span></div><div><br></div><div><b style=\"font-size: 24px\">Why work at Blue Coding?</b><span style=\"font-size: 24px\">&nbsp;</span></div><div><br></div><div>At Blue Coding we specialize in hiring excellent developers and amazing people from all over Latin America and other parts of the world. For the past 10 years, we’ve helped cutting-edge companies in the United States and Canada -both large and small, build great development teams and develop great products. Online shops, digital agencies, SaaS providers, and software consulting firms are a few of our clients. Our team of over 100 engineers is distributed in more than 10 countries across the Americas. We are a fully remote company working with a wide array of technologies and have expertise in every stage of the software development process.&nbsp;&nbsp;</div><div><br></div><div>Our team is highly connected, united, and culturally diverse, and our collaborators are involved in many initiatives around the world, from wildlife preservation to volunteering at local charities. We also participate in group activities like movie nights, trivia, and meme competitions. We stand for honesty, fairness, respect, efficiency, hard work, and cooperation.</div><div><br></div><div><b style=\"font-size: 13pt\">What are we looking for?</b></div><div><br></div><div>In this opportunity, we are seeking a Product Specialist to work with one of our foreign clients, an independent, non-profit global research organization that turns big ideas into action at the nexus of environment, economic opportunity and human well-being. You will be part of the Product team and will be supported by user researchers, designers, product managers, data scientists, and engineers across different areas and international offices. In this role, you will be the focal point between users and software development teams, ensuring that user needs are represented, incorporating user research insights into product requirements, and managing product backlogs.</div><div><br></div><div>If you are independent, with great attention to detail, and a problem solver, this is a great fit for you! </div><div><br></div><div><b style=\"font-size: 13pt\">What's unique about this job?</b></div><div><br></div><div>Our client focuses on inspiring and driving data innovation, product development, and technical infrastructure for the organization and its community partners. They collaborate with various stakeholders to leverage advancements in data and technology to improve lives, protect the environment, and promote equitable transitions. The team includes core members from engineering, product, and data, and it supports a broad network of quantitative researchers, data scientists, and policy analysts across the organization.</div><div><br></div><div>In this role, you will be dedicated to developing data and tools to support urban decision-makers in building climate-resilient, equitable, and healthy cities. The Product Specialist will contribute to managing the development of various geospatial data products, including decision support tools, dashboards, datasets, and APIs. The team’s portfolio includes tools that help city officials mitigate urban heat by optimizing the deployment of cooling infrastructure, web applications providing insights on the health impacts of extreme heat, and dashboards that enable cities to assess and track indicators on climate risk, urban biodiversity, and access to services.</div><div><br></div><div>This client is passionate. They value their diversity of interests, skills, and backgrounds. They have a flexible work environment. They share a common goal: to catalyze change to improve people's lives. Their shared ideals are at the core of their approach. They include integrity, innovation, urgency, independence, and respect. The foundation of their work is delivering high-quality research, data, maps, and analysis to solve the world’s most significant environmental and international development challenges and improve people’s lives. They work with government, business, and civil society leaders to drive ambitious action and create change on the ground. Equally important, they bring together partners to develop breakthrough ideas and scale-up solutions for far-reaching, enduring impact.</div><h3>Here are some of the exciting day-to-day challenges you will face in this role:</h3><li>Contribute to developing and communicating the product vision and strategy in alignment with the programs.&nbsp;</li><li>Contribute to collecting and prioritizing requirements from stakeholders, city officials, and users and conduct market analysis.&nbsp;</li><li>Coordinate with the User Researcher and Product Managers to ensure alignment between product development roadmap and stakeholder engagement.&nbsp;</li><li>Participate in product demonstration and user testing sessions and incorporate user feedback into product development to enhance user experience and satisfaction.&nbsp;</li><li>Together with the product manager and user researcher, they engage with existing and new users to gather feedback and understand their needs.&nbsp;</li><li>Maintain and prioritize the products’ backlogs based on users’ needs&nbsp;</li><li>Define clear and actionable user stories with acceptance criteria&nbsp;</li><li>Ensure that the development team understands the items in the product backlog&nbsp;</li><li>Participate in sprint planning meetings and ensure that the team understands the development items&nbsp;</li><li>Review and accept completed user stories and ensure they meet the definition of done&nbsp;</li>,<h3>You will shine if you have these:</h3><li>Bachelor’s degree preferred</li><li>3+ years of work experience as a Product Owner, product specialist, or a similar role in product management.</li><li>Experience with Agile methodologies, particularly Scrum and Kanban&nbsp;</li><li>BSc in Computer Science, Software Engineering, or related field.</li><li>Hands-on experience managing all stages of the product life cycle.</li><li>Technical background with knowledge of software development and web technologies.</li><li>Experience communicating with internal stakeholders.</li><li>Experience organizing work for small teams</li><li>Experience in producing high-quality digital products.</li><li><span>Fluency in English</span></li>,<h3>It doesn’t hurt if you also have:</h3><li>Basic programming skills (SQL, HTML), experience with Jira, GitHub, and knowledge of Carto or other mapping technologies is a bonus.</li><li>Demonstrated experience using Google Analytics and other product analytics software.</li><li>Fluency in Spanish, Portuguese, or Bahasa is a plus</li>,<h3>Here are some of the perks we offer you:</h3><li>Salary in USD</li><li>Flexible schedule (within US Time zones)</li><li>100% Remote</li><li>Long term&nbsp;</li><div><b style=\"font-size: 24px\">Hey, you are still here!</b><span style=\"font-size: 24px\">&nbsp;</span></div><div><br></div><div>So, let us ask a few questions. Do you like working in a friendly environment? Are you fluent in English? Do you have a strong work ethic, are detail-oriented and have an ownership mentality? And most importantly do you love music and puppies? If so, then what are you waiting for? Come join our team and become part of this awesome company! We will be expecting you.</div>","tags":"[\"management\",\"engineering\"]","pubDate":"2024-09-10 21:36:43.255","link":"https://jobs.lever.co/bluecoding/f47fb4f4-0cbc-459a-9354-c9e2a58853b1","savedDate":"2024-09-16 04:49:58.349","slug":"product-specialist-w-blue-coding-6832"},{"id":7365675949,"title":"Senior Software Engineer - FCP (Remote - Work from Anywhere)","company":"Xapo Bank","image":"https://pbs.twimg.com/profile_images/1630623773090037787/M9jBuyQv_400x400.png","description":"&lt;div class=&quot;content-intro&quot;&gt;&lt;p style=&quot;text-align: left;&quot;&gt;&lt;span style=&quot;font-weight: 900;&quot;&gt;Work from anywhere, impact everywhere&amp;nbsp;&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;Diversity is at the heart of who we are at Xapo Bank. We’re a fully distributed team of over 140 Xapiens that work remotely from 40+ countries around the world.&amp;nbsp;&lt;/p&gt;\n&lt;p&gt;Our beginning: A world that enjoys economic freedom and wealth protection, no matter where you live or who is running your country. This is the dream that drove Wences Casares, our Founder and Chairman, to quietly transform the world of banking.&lt;/p&gt;\n&lt;p&gt;To achieve that, we search the world for the best people for the job. We work hard, think globally, and inspire each other to learn and grow. We are committed to changing the way things are done.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Risk is inherent in all of our business activities and managing risk well is the responsibility of every Xapien. Sound risk management enables us to serve our customers and deliver value for our shareholders, and helps make Xapo a great place to work.&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&amp;nbsp;&lt;/p&gt;\n&lt;p style=&quot;text-align: left;&quot;&gt;&lt;em&gt;&lt;span style=&quot;font-weight: 500;&quot;&gt;Although we are headquartered in Gibraltar, this is a full time, 100% remote position&amp;nbsp;&lt;br&gt;&lt;/span&gt;&lt;/em&gt;&lt;em&gt;&lt;span style=&quot;font-weight: 500;&quot;&gt;Work from anywhere!&lt;/span&gt;&lt;/em&gt;&lt;/p&gt;\n&lt;p style=&quot;text-align: left;&quot;&gt;&amp;nbsp;&lt;/p&gt;&lt;/div&gt;&lt;p&gt;&lt;strong&gt;Position Overview:&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;We’re looking for a Senior Software Engineer to join our engineering function. At Xapo, we are building truly cross-functional teams with full ownership of design, architecture, building, testing, delivery, data, and operations.&lt;/p&gt;\n&lt;p&gt;You will collaborate closely with fellow team members from the product, apps, design, and QA communities of practice. You will be part of the product team (we call them SATs, the Stream Aligned Teams, as in the Team Topologies) in charge of the Financial Crime Prevention products.&lt;/p&gt;\n&lt;p&gt;As a Senior Software Engineer, you will develop a high-impact service, provide guidance and coaching around technical good practices, and play an active, critical role in the Development Community of practice. You will shape architectural and technical patterns used in the company to solve the problems for operational teams, improve UX, and cause a WOW effect in the eyes of our Members. With that in mind, you will have an immense impact on how the future of finance looks.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Our main tech stack includes:&lt;/strong&gt;&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;AWS for all of our Infrastructure&lt;/li&gt;\n&lt;li&gt;Docker&lt;/li&gt;\n&lt;li&gt;Python (Django, Flask)&lt;/li&gt;\n&lt;li&gt;MySQL&lt;/li&gt;\n&lt;li&gt;MongoDB&lt;/li&gt;\n&lt;li&gt;Redis&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;We also use:&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;Cassandra&lt;/li&gt;\n&lt;li&gt;PostgreSQL&lt;/li&gt;\n&lt;li&gt;Node.js&lt;/li&gt;\n&lt;li&gt;Java&lt;/li&gt;\n&lt;li&gt;BigQuery&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;&lt;strong&gt;Responsibilities:&lt;/strong&gt;&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;Support, coach, and develop team members into top-performing engineers.&lt;/li&gt;\n&lt;li&gt;Work closely in cross-functional teams where everyone is responsible for the outcome.&lt;/li&gt;\n&lt;li&gt;Build a great place to work for talented and motivated people.&lt;/li&gt;\n&lt;li&gt;Design, develop, and deploy backend services focusing on high availability, fault tolerance, low latency, and security.&lt;/li&gt;\n&lt;li&gt;Take full end-to-end responsibility for the services your team owns, from development to production, operations, and data.&lt;/li&gt;\n&lt;li&gt;Develop innovative solutions with Bitcoin at its core.&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;&lt;strong&gt;Skills needed:&lt;/strong&gt;&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;Significant software engineering experience in one or more general-purpose programming languages (we use Python).&lt;/li&gt;\n&lt;li&gt;Excellent teamwork and communication skills, comfortable preparing high-quality documentation and designs to aid understanding and knowledge sharing.&lt;/li&gt;\n&lt;li&gt;Understanding of microservices architecture, container-based 12-factor apps, and cloud-native patterns around fault tolerance.&lt;/li&gt;\n&lt;li&gt;Track record of using Event Storming and Domain-Driven Design, delivering highly scalable asynchronous software.&lt;/li&gt;\n&lt;li&gt;Experience building contract-first services and adopting patterns and frameworks to enable appropriate automated testing at the unit, contract, service, and end-to-end levels.&lt;/li&gt;\n&lt;li&gt;Experience building services that can be deployed on demand, quickly, and with quality.&lt;/li&gt;\n&lt;li&gt;Excellent understanding of CI/CD patterns and good practices.&lt;/li&gt;\n&lt;li&gt;Understand the role of high-quality observability in building highly scalable and performant software.&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;&lt;strong&gt;Other requirements:&lt;/strong&gt;&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;A dedicated workspace.&lt;/li&gt;\n&lt;li&gt;A reliable internet connection with the fastest speed possible in your area.&lt;/li&gt;\n&lt;li&gt;Devices and other essential equipment that meet minimal technical specifications.&lt;/li&gt;\n&lt;li&gt;Alignment with Our Values and the Xapo Values-Driven Leadership principles.&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;&amp;nbsp;&lt;/p&gt;&lt;div class=&quot;content-conclusion&quot;&gt;&lt;p&gt;&lt;span style=&quot;font-size: 12pt;&quot;&gt;&lt;strong&gt;Why work for Xapo?&lt;/strong&gt;&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span style=&quot;font-weight: 500; font-size: 10pt;&quot;&gt;IMPACT GLOBALLY, WORK REMOTELY.&lt;/span&gt;&lt;/p&gt;\n&lt;ul&gt;\n&lt;li style=&quot;font-weight: 500;&quot;&gt;&lt;strong&gt;Shape the Future:&lt;/strong&gt;&lt;span style=&quot;font-weight: 500;&quot;&gt; Improve lives through cutting-edge technology, work 100% remotely from anywhere in the world.&lt;/span&gt;&lt;/li&gt;\n&lt;li style=&quot;font-weight: 500;&quot;&gt;&lt;strong&gt;Great work-life balance:&lt;/strong&gt;&lt;span style=&quot;font-weight: 500;&quot;&gt; &lt;/span&gt;&lt;span style=&quot;font-weight: 500;&quot;&gt;Build amazing things with a balance of autonomy and collaborative teamwork. Set your own work schedule and make use of a flexible PTO plan when you need to recharge.&lt;/span&gt;&lt;span style=&quot;font-weight: 500;&quot;&gt;&amp;nbsp;&lt;/span&gt;&lt;/li&gt;\n&lt;li style=&quot;font-weight: 500;&quot;&gt;&lt;strong&gt;Expect Excellence:&lt;/strong&gt;&lt;span style=&quot;font-weight: 500;&quot;&gt; Collaborate, learn, and grow with a high-performance team. Learn&lt;/span&gt;&lt;span style=&quot;font-weight: 500;&quot;&gt; how you learn best - from books to conferences, you’ll get a yearly budget for your individual learning and development goals.&lt;/span&gt;&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;&lt;strong&gt;At Xapo, we prioritize consumer protection and adhere to regulatory requirements by ensuring that all Xapiens are accountable for upholding principles of fair treatment, transparency, and ethical conduct in their interactions with customers and stakeholders.&lt;/strong&gt;&lt;/p&gt;&lt;/div&gt;","tags":"[\"postgres\",\"Finance\",\"management\",\"engineering\",\"mysql\",\"mongo\",\"aws\"]","pubDate":"2024-09-10 14:28:38.000","link":"https://job-boards.greenhouse.io/xapo61/jobs/6112655003","savedDate":"2024-09-16 04:49:58.351","slug":"senior-software-engineer-fcp-remote-work-from-anywhere-xapo-bank-8742"},{"id":3591908543,"title":"Senior People Partner (Remote)","company":"DuckDuckGo","image":"https://spreadprivacy.com/content/images/2023/05/duckduckgo-logo_wide.png","description":"<p>Hi, we’re DuckDuckGo, the Internet privacy company for everyone who wants to take back their privacy now. For over a decade, we've been building our all-in-one product, developing new privacy technology, and working with policymakers to make online privacy simple and accessible for all.</p>\n<p><br /></p>\n<p>Our browsers and extensions have been downloaded over 250 million times with our built-in private search engine, which has seen over 100 billion searches and is the 2nd largest search engine on mobile in the United States and 20 other countries, including the United Kingdom, Canada, Australia, Poland, Italy, and Spain. Our private search engine is also 3rd in market share in the U.S. and over 15 major markets. Oh, and we've been profitable since 2014, with annual revenue exceeding $100 million!</p>\n<p><br /></p>\n<p>The DuckDuckGo browser’s uniquely comprehensive privacy protections are used by tens of millions of people to protect their everyday online activities on <a href=\"https://spreadprivacy.com/introducing-duckduckgo-for-mac/\" rel=\"noopener\">Mac</a>, <a href=\"https://spreadprivacy.com/windows-browser-open-beta/\" rel=\"noopener\">Windows</a>, <a href=\"https://spreadprivacy.com/duckduckgo-privacy-browser-ios14/\" rel=\"noopener\">iOS</a>, and <a href=\"https://spreadprivacy.com/introducing-app-tracking-protection/\" rel=\"noopener\">Android</a>, from searching to browsing, emailing, and more. We also offer <a href=\"https://spreadprivacy.com/meetprivacypro/\" rel=\"noopener\">Privacy Pro</a>, a three-in-one subscription service that includes a VPN, Personal Information Removal, and Identity Theft Restoration.<br /></p>\n<p><br /></p>\n<p>We’re looking for a Senior People Partner to help shape our all-in-one privacy solution and join our mission to show the world that protecting your privacy online can be simple.  <br /><br /><strong>The Opportunity</strong> </p>\n<p>In this role, you will leverage your empathy, critical thinking, and wealth of experience to empower individuals and teams across DuckDuckGo to achieve our goals. <br /></p>\n<p>Our People Ops organization is hands-on and committed to working closely with team members across DuckDuckGo to support and meet the organization's evolving requirements as we scale. You'll provide guidance through high-touch performance management, which will require you to constantly learn about new domains in order to provide exceptional support. You'll apply this same quality bar to your support of Functional Teams as they navigate the changes that come with a scaling tech organization. </p>\n<p><br /></p>\n<p>DuckDuckGo operates on a distributed leadership model that will ask you to question your assumptions and creatively apply your knowledge in forward-thinking ways to serve the team as you identify and execute projects to serve the organization. We've got team members in 20+ countries working on unique challenges in online privacy, and the People Operations team provides them with the support they need to succeed.</p>\n<p><br /></p>\n<p><strong>What You Will Bring to DuckDuckGo</strong> </p>\n<ul><li>7+ years of People Operations experience working in a tech-driven organization, with deep experience in HRBP activities, including professional development, performance management, organizational behavior, employee relations, DEI, and labor law and compliance.</li><li>Demonstrated ability to effectively resolve complex engagement, performance, and employee relations issues with discretion, humanity, and critical thinking.</li><li>Ability to adapt an HR Business Partner mindset to a distributed environment and identify the highest impact ways to partner with our teams.</li><li>Pragmatic and analytical, with a proven track record of creating data-driven projects, process improvements, and substantive change within high-growth organizations.  </li><li>Ability to lead and collaborate on high-impact and complex projects from proposal through postmortem.  </li><li>Skills to wrangle vague problems, propose innovative solutions, and execute them with a strong focus on metrics. </li><li>Proven conflict resolution skills and keen emotional intelligence.</li><li>Exceptional verbal and written communication skills.</li></ul>\n<p><br /></p>\n<p><strong>How We Will Support You </strong> </p>\n<p>Our core values -- build trust, question assumptions, and validate direction -- underpin how we work day-to-day and the support we give our team members. We strive to empower our team members to be self-directed and self-motivated in their work.  </p>\n<p><br /></p>\n<ul><li><strong>Remote First, Always</strong>: We've always been a fully distributed company with team members all over the world. We trust you to get your work done wherever, and whenever.   </li><li><strong>Commitment to Personal Growth:</strong> Every team member has an annual budget of $1,250 USD to invest in their professional development.  Every team member also has a dedicated Career Advisor, who serves as a guide to help you develop your strengths, identify your motivations, and understand your opportunities for growth. </li><li><strong>Leadership:</strong> We have many different types of leaders and possible combinations of leadership roles, so you can grow your career in a way that aligns best with your personal goals. You can seek additional leadership roles by being directly responsible for projects, taking ownership of areas of the company, developing and maintaining internal processes, or pursuing advisory roles. </li><li><strong>Work/Life Balance: </strong>Team members have the freedom and flexibility to organize their own work schedules. We want you to thrive both in and out of the office. We trust you to use good judgment and take the time off that you need to bring your best self to work.  </li></ul>\n<p><br /></p>\n<p>We also offer paid parental leave, a co-working stipend, office setup reimbursement, and a wellness stipend. More support resources can be found in our <u><a href=\"https://duckduckgo.com/assets/hiring/team_support_guide.pdf\" rel=\"noopener\">Team Member Support Guide</a></u>, which explains how we make your well-being a priority. </p>\n<p><br /></p>\n<p>For more information on how we collaborate worldwide, from leadership in our relatively flat organization to start-to-finish ownership<strong>,</strong> check out <u><a href=\"https://duckduckgo.com/how-we-work\" rel=\"noopener\">DuckDuckGo Culture: How We Work.</a></u> </p>\n<p><br /></p>\n<p><strong>Compensation</strong> </p>\n<p>Annual compensation: $176,000 USD and stock options. Compensation is the same within a professional level, regardless of geographic location or functional area, and the compensation for each professional level is transparent across the organization.</p>\n<p><br /></p>\n<p><strong>Hiring Process</strong> </p>\n<p>Hiring works best when it's a two-way street. Learn how we help you get to know DuckDuckGo and envision your future role here. Find out more about <u><a href=\"https://duckduckgo.com/how-we-hire\" rel=\"noopener\">how we hire</a></u>. </p>\n<p><br /></p>\n<p><strong>Diversity, Equity, and Inclusion</strong> </p>\n<p>DuckDuckGo provides equal work opportunities to all team members and applicants<u>,</u> and it prohibits discrimination and harassment of any type on the basis of race, color, ethnicity, caste, religion, age, sex (including pregnancy), national origin, disability status, genetics, protected veteran status, sexual orientation, gender identity or expression, or any other characteristic protected by our policies or federal, state, or local laws.</p>\n<p><br /></p>\n<p>We want to ensure that our hiring process is accessible. If you need reasonable accommodation for any part of the application process because of a medical condition or disability, please send an email to <u><a href=\"mailto:careers@duckduckgo.com\" rel=\"noopener\">careers@duckduckgo.com</a></u> to let us know the nature of your request.  </p>\n<p><br /></p>\n<p>If you think you might thrive in this environment, we would love to hear from you. </p>\n<p><br /></p>\n<p><strong>Please note that:</strong> </p>\n<ul><li>Sometimes we meet up! Expect to travel at least two times a year: once for our all-hands meetup and again for a team retreat (each around 4-5 days). While extenuating circumstances may impact attendance, everyone is strongly encouraged to attend.</li><li>While we offer a flexible work arrangement with no core hours, expect an average full-time commitment of 40 hours per week. </li><li>A successful candidate will be subject to a background check and must receive satisfactory results of the same, as a condition of joining the team. </li><li>By applying for this role, you confirm that all information submitted is accurate and complete. You further acknowledge that providing false or fraudulent information during the application process is cause for denial of an offer, revocation of any existing offer, or other adverse action, up to and including termination after the start of your commencement of work.  </li></ul>\n<p><br /></p>\n<p>#UK #CN</p>","tags":"[\"management\",\"aws\"]","pubDate":"2024-08-29 18:29:54.000","link":"https://duckduckgo.recruitee.com/o/senior-people-people-partner","savedDate":"2024-09-16 04:49:58.342","slug":"senior-people-partner-remote-duckduckgo-8671"}]