[{"id":9029408261,"title":"Community Manager (Chinese-Speaking)","company":"Scroll","image":"https://avatars.githubusercontent.com/u/87750292?s=200&v=4","description":"&lt;div class=&quot;content-intro&quot;&gt;&lt;p&gt;Scroll is a Layer 2 scaling solution for Ethereum, specifically focusing on zkRollups. Key aspects of Scroll are zkRollup technology, Scalability, Efficiency, Security, and Developer-friendly. Overall, Scroll plays a crucial role in addressing Ethereum&#39;s scalability challenges and facilitating the growth of decentralized finance (DeFi) and other blockchain-based applications by providing a scalable and efficient Layer 2 solution.&amp;nbsp;&lt;/p&gt;&lt;/div&gt;&lt;p&gt;&lt;span style=&quot;font-size: 12pt;&quot;&gt;&lt;strong&gt;Position Overview&amp;nbsp;&lt;/strong&gt;&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;Scroll is seeking a dynamic and bilingual Chinese-Speaking Community Manager to lead engagement efforts across our developer and user communities in China and the broader APAC region. As a key member of the team, you will manage interactions across platforms like Discord, Telegram, and WhatsApp, ensuring our communities stay informed, engaged, and connected. You’ll also work closely with partners, assist with translations, and organize both online and offline events to grow Scroll’s ecosystem.&lt;/p&gt;\n&lt;p&gt;This role is ideal for someone passionate about fostering vibrant blockchain communities, fluent in Chinese and English, and eager to support developers and users in the fast-evolving world of Layer 2 solutions.&lt;/p&gt;\n&lt;p&gt;&lt;span style=&quot;font-size: 12pt;&quot;&gt;&lt;strong&gt;Responsibilities&amp;nbsp;&lt;/strong&gt;&lt;/span&gt;&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;&lt;strong&gt;Community Management:&lt;/strong&gt;\n&lt;ul&gt;\n&lt;li&gt;Actively manage, moderate, and grow Scroll’s Chinese-speaking communities across Discord, Telegram, WhatsApp, X, and other relevant platforms.&lt;/li&gt;\n&lt;li&gt;Respond promptly to community inquiries, share updates, and ensure a positive and collaborative environment.&lt;/li&gt;\n&lt;li&gt;Plan, host, and attend online and offline events, such as meetups, workshops, and community calls, to engage developers and users.&lt;/li&gt;\n&lt;/ul&gt;\n&lt;/li&gt;\n&lt;li&gt;&lt;strong&gt;Translations &amp;amp; Localized Content:&lt;/strong&gt;\n&lt;ul&gt;\n&lt;li&gt;Translate technical and marketing materials from English to Chinese and vice versa, ensuring accuracy and cultural relevance.&lt;/li&gt;\n&lt;li&gt;Proofread and localize content to align with Chinese-speaking audiences’ needs.&lt;/li&gt;\n&lt;/ul&gt;\n&lt;/li&gt;\n&lt;li&gt;&lt;strong&gt;Partner Engagement:&lt;/strong&gt;\n&lt;ul&gt;\n&lt;li&gt;Build relationships with developers, local businesses, and KOLs (Key Opinion Leaders) to expand Scroll’s presence in APAC.&lt;/li&gt;\n&lt;li&gt;Work with local influencers and micro-influencers to execute surface opportunities for promotional campaigns.&lt;/li&gt;\n&lt;/ul&gt;\n&lt;/li&gt;\n&lt;li&gt;&lt;strong&gt;Community Expansion:&lt;/strong&gt;\n&lt;ul&gt;\n&lt;li&gt;Identify opportunities to scale community engagement across social media and messaging platforms popular in the region.&lt;/li&gt;\n&lt;li&gt;Track feedback and report insights to internal teams, ensuring the voice of the community informs Scroll’s roadmap.&lt;/li&gt;\n&lt;/ul&gt;\n&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;&lt;strong&gt;Requirements&amp;nbsp;&lt;/strong&gt;&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;&lt;strong&gt;Location &amp;amp; Language Skills:&lt;/strong&gt;&lt;br&gt;\n&lt;ul&gt;\n&lt;li&gt;Fluency in both Chinese (Mandarin) and English, with excellent communication skills in both languages.&lt;/li&gt;\n&lt;li&gt;Located in Asia.&lt;/li&gt;\n&lt;/ul&gt;\n&lt;/li&gt;\n&lt;li&gt;&lt;strong&gt;Community Management Experience:&lt;/strong&gt;\n&lt;ul&gt;\n&lt;li&gt;Proven experience managing and growing online communities, including on Discord, Telegram, and WhatsApp.&lt;/li&gt;\n&lt;li&gt;Familiarity with engaging both developer and user communities in the crypto space, maybe even running a few degen groups yourself!&lt;/li&gt;\n&lt;li&gt;Experience organizing and hosting online and offline events such as meetups, hackathons, or community calls.&lt;/li&gt;\n&lt;/ul&gt;\n&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;&lt;strong&gt;Preferred Qualifications&lt;/strong&gt;&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;Experience working in blockchain, Layer 2, or crypto-focused roles.&lt;/li&gt;\n&lt;li&gt;Connections with developer communities or KOLs in APAC.&lt;/li&gt;\n&lt;li&gt;Startup experience or familiarity with high-growth environments.&lt;/li&gt;\n&lt;li&gt;Experience contributing to or managing open-source projects and experience with using Github.&lt;/li&gt;\n&lt;/ul&gt;&lt;div class=&quot;content-conclusion&quot;&gt;&lt;h4&gt;&lt;strong data-stringify-type=&quot;bold&quot;&gt;What We Offer&lt;/strong&gt;&lt;/h4&gt;\n&lt;ul class=&quot;p-rich_text_list p-rich_text_list__bullet p-rich_text_list--nested&quot; data-stringify-type=&quot;unordered-list&quot; data-list-tree=&quot;true&quot; data-indent=&quot;0&quot; data-border=&quot;0&quot;&gt;\n&lt;li data-stringify-indent=&quot;0&quot; data-stringify-border=&quot;0&quot;&gt;Mission-Driven, Collaborative, and Innovative Environment:&amp;nbsp;Join a team united by a shared vision, working with like-minded individuals and cutting-edge technology to advance Ethereum and blockchain innovation.&lt;/li&gt;\n&lt;li data-stringify-indent=&quot;0&quot; data-stringify-border=&quot;0&quot;&gt;Comprehensive Compensation and Remote Flexibility:&amp;nbsp;Benefit from a competitive salary package and generous discretionary benefits, while enjoying the remote work from anywhere with flexible hours. Additionally, receive support for your workspace with a home office setup allowance and monthly co-working membership stipend.&lt;/li&gt;\n&lt;li data-stringify-indent=&quot;0&quot; data-stringify-border=&quot;0&quot;&gt;Remote Hiring: For team members outside the US, UK, Canada, and Hong Kong, we engage under an independent consulting arrangement, offering the flexibility of payment (in Fiat, USDC, or etc).&lt;/li&gt;\n&lt;li data-stringify-indent=&quot;0&quot; data-stringify-border=&quot;0&quot;&gt;Private Healthcare Benefits:&amp;nbsp;Private healthcare benefits through the Employer of Record (EoR) are only available in the US, UK, Canada, and Hong Kong.&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;&lt;em&gt;Scroll is proud to be an equal opportunity workplace. We are committed to equal employment opportunities regardless of race, color, ancestry, religion, sex, national origin, sexual orientation, age, citizenship, marital status, disability, gender identity, or Veteran status. If you have a disability or special need, please let us know and we&#39;ll do our best to accommodate.&lt;/em&gt;&lt;/p&gt;\n&lt;p&gt;&amp;nbsp;&lt;/p&gt;&lt;/div&gt;","tags":"[\"finance\",\"management\"]","pubDate":"2025-01-23T07:42:59.000Z","link":"https://job-boards.eu.greenhouse.io/scrollio/jobs/4523970101","slug":"community-manager-chinese-speaking-scroll-4287"},{"id":8247988269,"title":"Freelance | Contract Senior Quality Assurance Analyst","company":"10up","image":"https://pbs.twimg.com/profile_images/2738508979/760be3edebfa0195e36fb3dba07297c1_400x400.png","description":"&lt;p&gt;&lt;strong&gt;Location: Remote - Asia &lt;/strong&gt;&lt;span style=&quot;font-weight: 400;&quot;&gt;(Open to applicants located anywhere IST timezone (+/-4))&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span style=&quot;font-weight: 400;&quot;&gt;As an experienced Senior Quality Assurance Analyst at 10up, you’ll be responsible for carrying out manual, visual and functional testing throughout the software development life cycle on unique projects across large web builds and ongoing retainers for high priority clients - ensuring that we not only meet defined requirements, but that we consistently deliver the highest quality experience for our end users.&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span style=&quot;font-weight: 400;&quot;&gt;As a leading digital agency, 10up’s client roster spans from innovative startups and impactful non-profits to some of the biggest names in the industry, such as ESPN, Google, The New York Times Co., Microsoft, and The Nobel Prize Committee.&lt;/span&gt;&lt;span style=&quot;font-weight: 400;&quot;&gt;&lt;br&gt;&lt;/span&gt;&lt;span style=&quot;font-weight: 400;&quot;&gt;&lt;br&gt;&lt;/span&gt;As a 10up contractor, you have options for flexible and alternative work schedules. Intentionally remote since day one, spanning six continents and 40 countries, 10up fully embraces the benefits of distributed work.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;What you will do:&amp;nbsp;&lt;/strong&gt;&lt;/p&gt;\n&lt;ul&gt;\n&lt;li style=&quot;font-weight: 400;&quot;&gt;&lt;span style=&quot;font-weight: 400;&quot;&gt;Act as the day-to-day QA Owner for dedicated client projects, exhibiting senior-level ownership over QA planning and execution.&lt;/span&gt;&lt;/li&gt;\n&lt;li style=&quot;font-weight: 400;&quot;&gt;&lt;span style=&quot;font-weight: 400;&quot;&gt;Lead QA ownership on multiple projects (mix of build and retainer).&amp;nbsp;&lt;/span&gt;&lt;/li&gt;\n&lt;li style=&quot;font-weight: 400;&quot;&gt;&lt;span style=&quot;font-weight: 400;&quot;&gt;Successfully create and execute on QA and test case plans by exhibiting ownership of assigned work, proactively flagging blockers, and ensuring alignment of individual output with expected milestones and deadlines. Test cases should follow industry standards and cover all aspects of the property being tested.&lt;/span&gt;&lt;/li&gt;\n&lt;li style=&quot;font-weight: 400;&quot;&gt;&lt;span style=&quot;font-weight: 400;&quot;&gt;Ensure superior quality deliverables by engaging cross-discipline leadership, enforcing rigorous QA processes and standards, and taking senior-level ownership of end to end delivery and client satisfaction.&lt;/span&gt;&lt;/li&gt;\n&lt;li style=&quot;font-weight: 400;&quot;&gt;&lt;span style=&quot;font-weight: 400;&quot;&gt;Leverage 10up tools, standards, and processes in all client work. Maintain highly collaborative relationships with project managers and discipline directors to achieve elite project outcomes.&lt;/span&gt;&lt;/li&gt;\n&lt;li style=&quot;font-weight: 400;&quot;&gt;&lt;span style=&quot;font-weight: 400;&quot;&gt;Actively participate in project discovery to align on QA project requirements. Assist with translating requirements into comprehensive approaches for QA and test case plans that meet established timelines and budgets.&lt;/span&gt;&lt;/li&gt;\n&lt;li style=&quot;font-weight: 400;&quot;&gt;&lt;span style=&quot;font-weight: 400;&quot;&gt;Demonstrate a senior-level consultative, client-focused approach through an understanding of underlying client business goals and objectives and support the project team to identify strategic and proactive preventative QA solutions.&amp;nbsp;&lt;/span&gt;&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;&lt;strong&gt;About you:&amp;nbsp;&lt;/strong&gt;&lt;/p&gt;\n&lt;ul&gt;\n&lt;li style=&quot;font-weight: 400;&quot;&gt;&lt;span style=&quot;font-weight: 400;&quot;&gt;You have at least 4+ years of Quality Assurance experience (preferably in an agency environment) for web-based technology projects; specifically focused on quality assurance testing for web applications and software products, including cross-browser and cross-device testing -- emulated and on-device.&lt;/span&gt;&lt;/li&gt;\n&lt;li style=&quot;font-weight: 400;&quot;&gt;&lt;span style=&quot;font-weight: 400;&quot;&gt;You are comfortable with major computer and mobile operating systems, including Windows 10, Mac OS/X, iOS, Android, and the major browsers that operate on them (e.g. Safari, Firefox, Chrome), as well as having experience defining tests and reviewing test results with BrowserStack and other cross-platform testing tools.&lt;/span&gt;&lt;/li&gt;\n&lt;li style=&quot;font-weight: 400;&quot;&gt;&lt;span style=&quot;font-weight: 400;&quot;&gt;You have experience writing detail-oriented test plans and test cases for manual testing.&lt;/span&gt;&lt;/li&gt;\n&lt;li style=&quot;font-weight: 400;&quot;&gt;&lt;span style=&quot;font-weight: 400;&quot;&gt;You apply critical thinking, user empathy, adaptability, and an attention to detail in everything you do, enabling you to not only troubleshoot bugs, but to also identify and offer preventative solutions to potential quality issues before they become problems.&amp;nbsp;&lt;/span&gt;&lt;/li&gt;\n&lt;li style=&quot;font-weight: 400;&quot;&gt;&lt;span style=&quot;font-weight: 400;&quot;&gt;You are comfortable being a part of and managing time against multiple parallel cross-functional delivery teams, and directly owning the success of QA across your projects.&lt;/span&gt;&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;&lt;strong&gt;Join our Contractor Pool!&amp;nbsp;&lt;/strong&gt;&lt;span style=&quot;font-weight: 400;&quot;&gt;&lt;br&gt;&lt;/span&gt;&lt;span style=&quot;font-weight: 400;&quot;&gt;&lt;br&gt;&lt;/span&gt;&lt;span style=&quot;font-weight: 400;&quot;&gt;We are currently accepting applications for potential upcoming freelance QA opportunities. If you are passionate about 10up&#39;s mission and great QA work, please apply. We&#39;d appreciate the opportunity to personally review your application. Everyone gets a response.&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span style=&quot;font-weight: 400;&quot;&gt;Read more about &lt;/span&gt;&lt;a href=&quot;https://drive.google.com/file/d/1nQ9yWRqfDAdrriYRnBNzYo7w59auYxMe/view&quot;&gt;&lt;span style=&quot;font-weight: 400;&quot;&gt;What to Expect&lt;/span&gt;&lt;/a&gt;&lt;span style=&quot;font-weight: 400;&quot;&gt; through our Recruiting process.&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span style=&quot;font-weight: 400;&quot;&gt;We don&#39;t want you to miss any communication from us! To ensure you receive updates on your application, please add jobs@10up.com to your contacts list! #LI-Remote&lt;/span&gt;&lt;/p&gt;","tags":"[]","pubDate":"2025-01-23T01:33:05.000Z","link":"https://job-boards.greenhouse.io/10up/jobs/4500249008","slug":"freelance-contract-senior-quality-assurance-analyst-10up-6893"},{"id":3469834051,"title":"Enterprise Technical Advisor, (Post-Sales Customer Success) [IC3 - IC4]","company":"Sourcegraph","image":"https://avatars.githubusercontent.com/u/3979584?s=200&v=4","description":"&lt;div class=&quot;content-intro&quot;&gt;&lt;h2&gt;&lt;strong&gt;&lt;span style=&quot;color: #a112ff;&quot;&gt;Who we are&lt;/span&gt;&lt;/strong&gt;&lt;/h2&gt;\n&lt;p&gt;Our mission at Sourcegraph is to make it so that &lt;a href=&quot;https://www.notion.so/sourcegraph/Mission-values-e9d37e6b972a4ef395c3076aea2bd07d?pvs=4&quot;&gt;everyone can code&lt;/a&gt;, not just ~0.1% of the population.&amp;nbsp;&lt;/p&gt;\n&lt;p&gt;We are transforming how the world’s most important companies build software by industrializing development with AI. Today, most professional developers spend a disproportionate amount of time understanding code and performing repetitive, low-level tasks—leaving less time for innovation and meaningful impact.&lt;/p&gt;\n&lt;p&gt;We’re changing that. Sourcegraph brings AI-powered search and agents to the enterprise, helping teams automate the mundane and amplify what developers do best— solving hard problems and creating great products.&lt;/p&gt;\n&lt;p&gt;Here’s how we’re making a difference:&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;&lt;strong&gt;Accelerating developers &lt;/strong&gt;with AI agents that deliver insights and precision—enabling 5x faster test creation, 30% increase in merge requests, and saving 20 minutes per developer daily.&lt;/li&gt;\n&lt;li&gt;&lt;strong&gt;Automating repetitive tasks,&lt;/strong&gt; from remediating vulnerabilities (saving teams 1,000+ hours annually) to speeding up migrations that would take years to months.&amp;nbsp;&lt;/li&gt;\n&lt;li&gt;&lt;strong&gt;Enabling innovation&lt;/strong&gt; by addressing complex problems like automated bug triage, vulnerability detection, and AI-driven code reviews seamlessly integrated into workflows.&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;Trusted by 7/10 top software companies by market cap, 4/6 top US banks and many of the companies leading global innovation, like Stripe, Indeed, Tesla, and 1Password, and with $225M in funding from investors like &lt;a href=&quot;https://techcrunch.com/2021/07/13/sourcegraph-raises-125m-series-d-on-2-6b-valuation-for-universal-code-search-tool/&quot;&gt;a16z&lt;/a&gt;, &lt;a href=&quot;https://about.sourcegraph.com/blog/series-c-with-sequoia/&quot;&gt;Sequoia&lt;/a&gt;, and &lt;a href=&quot;https://www.redpoint.com/companies/sourcegraph/&quot;&gt;Redpoint&lt;/a&gt;, we are building the tools that will define the next era of enterprise software development.&lt;/p&gt;\n&lt;p&gt;If you’re passionate about solving the hardest problems in software and shaping the future of technology, join us. Let’s build something extraordinary together.&lt;/p&gt;&lt;/div&gt;&lt;h2&gt;&lt;span style=&quot;color: rgb(161, 18, 255);&quot;&gt;&lt;strong&gt;Location&lt;/strong&gt;&lt;/span&gt;&lt;/h2&gt;\n&lt;p&gt;🌎 While we are an all-remote company and hire &lt;a href=&quot;https://sourcegraph.notion.site/How-we-engage-talent-outside-of-the-US-218f7193695a46cbb1ef39ef9c1f72d4&quot;&gt;almost anywhere&lt;/a&gt; in the world, we have a requirement for this person to reside in San Francisco, CA or Denver, CO.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Preferred locations:&lt;/strong&gt;&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;Denver, CO&lt;/li&gt;\n&lt;li&gt;San Francisco, CA&lt;/li&gt;\n&lt;/ul&gt;\n&lt;h2&gt;&lt;span style=&quot;color: rgb(161, 18, 255);&quot;&gt;&lt;strong&gt;Why this job is exciting&lt;/strong&gt;&lt;/span&gt;&lt;/h2&gt;\n&lt;p&gt;You will have responsibility and growth potential in helping us shape and build our young team. As an Enterprise CSM (note: we refer to this role as an Enterprise Technical Advisor), you will manage the relationships with roughly 15 Enterprise customers. You’ll ensure your customer&#39;s developers love our product, remain happy customers and grow month over month. You&#39;ll also help our customers solve technical problems while driving key metrics like adoption, usage/consumption, NPS, NDR (Net Dollar Retention) and renewal rate.&lt;/p&gt;\n&lt;p&gt;📅 Within one month, you will…&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;Start building a trusting relationship with your team and partners on Customer Engineering (pre-sales, Sales, and Support teams)&lt;/li&gt;\n&lt;li&gt;Learn about our product, our value proposition, our customers &amp;amp; use cases, our team, and our processes.&lt;/li&gt;\n&lt;li&gt;Join or review customer and prospect calls with some of our largest (Fortune 500) customers to understand their technical challenges and needs.&lt;/li&gt;\n&lt;li&gt;Be assigned your first customers with whom you’ll begin to establish trusted relationships to earn and maintain credibility.&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;📅 Within three months, you will…&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;Meet regularly with your customer champions and advocates; establish yourself as their key point of contact.&lt;/li&gt;\n&lt;li&gt;Ensure your customers derive maximum value from their investment in Sourcegraph; develop account success plans based on insights and needs where necessary.&lt;/li&gt;\n&lt;li&gt;Develop and implement tailored programs and playbooks, contributing to internal team strategy, that provide continued value to our customers and ensure long-term growth beyond just your assigned customers.&lt;/li&gt;\n&lt;li&gt;Provide recommendations based on the customer&#39;s infrastructure and use cases, and provide feedback to internal teams as the voice of your customer.&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;📅 Within six months, you will…&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;Drive the ultimate success of your customers, including their onboarding experience, ongoing feature adoption, renewal, and expansion.&lt;/li&gt;\n&lt;li&gt;Engage customers in product betas, case studies, and webinars as applicable.&lt;/li&gt;\n&lt;li&gt;Drive seamless onboarding processes and work cross-functionally with our support and services team to proactively lead successful deployments.&lt;/li&gt;\n&lt;li&gt;Translate customer sentiment to internal teams and appropriately advocate for strategic product decisions. Be the voice of the customer.&lt;/li&gt;\n&lt;li&gt;Guide your customers as they use Sourcegraph to solve technical problems.&lt;/li&gt;\n&lt;li&gt;Proactively identify new opportunities for expansion and up-sell opportunities across your book of business by collaborating with the sales team to ensure subscription growth and increased solution footprint.&lt;/li&gt;\n&lt;/ul&gt;\n&lt;h2&gt;&lt;span style=&quot;color: rgb(161, 18, 255);&quot;&gt;&lt;strong&gt;About you&lt;/strong&gt;&lt;/span&gt;&lt;/h2&gt;\n&lt;p&gt;You are an enthusiastic, self-driven, and results-oriented post-sales specialist who shares &lt;a href=&quot;https://handbook.sourcegraph.com/company-info-and-process/values/&quot;&gt;our values&lt;/a&gt; and is passionate about nurturing healthy customers.&lt;/p&gt;\n&lt;p&gt;Your skill set:&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;You are curious about the technical topics our customers deal with daily (migrations, code refactors, developer onboarding, etc.) and have the ability to partner with them on technical solutions both using and extending the Sourcegraph product. You use your technical skills to help guide customers and solve problems.&lt;/li&gt;\n&lt;li&gt;You are an influential and strategic thinker who co-develops success strategies with customers and your account team counterparts (AE, etc.) to ensure we bring value to our customers and continue to solve their ongoing needs. You commonly report on the status via Business Reviews with documented KPIs and success metrics associated with use cases.&lt;/li&gt;\n&lt;li&gt;You actively listen, synthesize information, communicate effectively, and present with confidence and customer empathy to various stakeholders (end-user devs to C-level stakeholders) and internal teams.&lt;/li&gt;\n&lt;li&gt;You are proactive. You can collaborate with multiple stakeholders to identify opportunities, address complex political situations, and support customers throughout.&lt;/li&gt;\n&lt;li&gt;You are naturally curious and seek to learn about product features and their benefits. You provide recommendations based on stated customer needs and use cases. You engage customers on relevant betas, updates, and educational material, as applicable.&lt;/li&gt;\n&lt;li&gt;You are exceptionally organized and have strong project management skills. You are a strong adopter of tools and standardized processes to document customer conversation goals and project customer health scores across your entire book of business. You can prioritize effectively and can set and deliver on expectations.&lt;/li&gt;\n&lt;li&gt;You are a team player who can proactively contribute to a positive environment that values people and work, openly share problems and successes, and work across teams to help refine processes and achieve goals. You can take responsibility for your actions and recognize mistakes as learning opportunities.&lt;/li&gt;\n&lt;/ul&gt;\n&lt;h2&gt;&lt;span style=&quot;color: rgb(161, 18, 255);&quot;&gt;&lt;strong&gt;Level&lt;/strong&gt;&lt;/span&gt;&lt;/h2&gt;\n&lt;p&gt;📊 This job is an IC3 - IC4.&amp;nbsp; You can read more about &lt;a href=&quot;https://sourcegraph.notion.site/Leveling-Guide-0e1b5c76ada64b9caac387f8b7c4fc66&quot;&gt;our job leveling philosophy&lt;/a&gt; in our Handbook.&lt;/p&gt;\n&lt;h2&gt;&lt;span style=&quot;color: rgb(161, 18, 255);&quot;&gt;&lt;strong&gt;Compensation&lt;/strong&gt;&lt;/span&gt;&lt;/h2&gt;\n&lt;p&gt;&lt;strong&gt;💸 We pay you an above-average salary&lt;/strong&gt; because we want to hire the best people who are fully focused on helping Sourcegraph succeed, not worried about paying bills. As an &lt;a href=&quot;https://sourcegraph.notion.site/Mission-values-e9d37e6b972a4ef395c3076aea2bd07d&quot;&gt;open and transparent&lt;/a&gt; company that values &lt;a href=&quot;https://www.notion.so/sourcegraph/Compensation-Pay-Transparency-at-Sourcegraph-d58d0774f51b4b489d41c3628d30ff8d?pvs=4&quot;&gt;competitive compensation&lt;/a&gt;, our compensation ranges are visible to every single Sourcegraph teammate.&lt;/p&gt;\n&lt;p&gt;To determine your salary, we use a number of market and data-driven salary sources, along with your location zone, and target the high-end of the range to ensure we’re always paying above market regardless of where you live in the world. Both U.S. and international locations are divided into one of four zones, determined by the cost of labor index for each area. The starting salary for a successful candidate will be based on level, job-related skills, experience, qualifications, and location zone. Please note that these salary ranges may be adjusted in the future.&lt;/p&gt;\n&lt;p&gt;💰The target compensation for this role is $154,720 - $178,400 USD base + $38,680 - $44,600 USD variable ($193,400 - $223,000 USD on-target-earnings).&amp;nbsp;&lt;/p&gt;\n&lt;p&gt;Please speak with a recruiter for additional information regarding zone locations.&lt;/p&gt;\n&lt;p&gt;📈 In addition to our cash compensation, we offer equity (because when we succeed as a company, we want you to succeed, too) and generous &lt;a href=&quot;https://sourcegraph.notion.site/Benefits-Perks-dd1da4b6b3a64780abed010a144d34ba&quot;&gt;perks &amp;amp; benefits&lt;/a&gt;.&lt;/p&gt;\n&lt;h2&gt;&lt;span style=&quot;color: rgb(161, 18, 255);&quot;&gt;&lt;strong&gt;Interview process&lt;/strong&gt;&lt;/span&gt;&lt;/h2&gt;\n&lt;p&gt;&lt;em&gt;Below is the interview process you can expect for this role (you can read more about &lt;/em&gt;&lt;a href=&quot;https://sourcegraph.notion.site/Types-of-interviews-f279f080583d49ee9f2c60e30c8cb1f7&quot;&gt;&lt;em&gt;the types of interviews&lt;/em&gt;&lt;/a&gt;&lt;em&gt; in our Handbook). It may look like a lot of steps, but rest assured that we move quickly and the steps are designed to help you get the information needed to determine if we’re the right fit for you… Interviewing is a two-way street, after all!&amp;nbsp;&lt;/em&gt;&lt;/p&gt;\n&lt;p&gt;We expect the interview process to take 5 hours in total.&amp;nbsp;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;👋 Introduction Stage&lt;/strong&gt; - we have initial conversations to get to know you better…&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;[30m]&amp;nbsp;&lt;a href=&quot;https://www.notion.so/sourcegraph/Types-of-interviews-sample-questions-f279f080583d49ee9f2c60e30c8cb1f7?pvs=4#99be5ff628b2414194a0ba79d9f25f13&quot;&gt;Recruiter Screen&lt;/a&gt;&lt;/li&gt;\n&lt;li&gt;[60m] &lt;a href=&quot;https://www.notion.so/sourcegraph/Types-of-interviews-sample-questions-f279f080583d49ee9f2c60e30c8cb1f7?pvs=4#1919882c0cf147c487eb1df40db8a694&quot;&gt;Hiring Manager Screen&lt;/a&gt; / &lt;a href=&quot;https://www.notion.so/sourcegraph/Types-of-interviews-sample-questions-f279f080583d49ee9f2c60e30c8cb1f7?pvs=4#c678a2a86e0e47e4958507e869bf7ded&quot;&gt;Resume Deep Dive&lt;/a&gt;&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;&lt;strong&gt;🧑‍💻 Team Interview Stage&lt;/strong&gt; - we then delve into your experience in more depth and introduce you to members of the team, including cross-functional partners…&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;[60m] &lt;a href=&quot;https://www.notion.so/sourcegraph/Types-of-interviews-sample-questions-f279f080583d49ee9f2c60e30c8cb1f7?pvs=4#cb00697e95304550a146c32563c0255d&quot;&gt;Cross-functional team collaboration&lt;/a&gt; / &lt;a href=&quot;https://www.notion.so/sourcegraph/Types-of-interviews-sample-questions-f279f080583d49ee9f2c60e30c8cb1f7?pvs=4#88b9f826dee04ef98afc2aeec35b877a&quot;&gt;Peer&lt;/a&gt;&lt;/li&gt;\n&lt;li&gt;[60m] Working Session - Hiring Manager, 1 TA, 1 AE&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;&lt;strong&gt;🎉 Final Interview Stage &lt;/strong&gt;- we move you to our final round, where you gain a better understanding of our business and values holistically…&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;[30m]&amp;nbsp;&lt;a href=&quot;https://www.notion.so/sourcegraph/Types-of-interviews-sample-questions-f279f080583d49ee9f2c60e30c8cb1f7?pvs=4#e3a04291743048df87541a88aa8199dd&quot;&gt;Values&lt;/a&gt;&lt;/li&gt;\n&lt;li&gt;[30m]&amp;nbsp;&lt;a href=&quot;https://www.notion.so/sourcegraph/How-to-work-with-Quinn-Slack-CEO-807673e0864d473f959cc4efd9642a5a?pvs=4#6f185c0e2011411eac5be9c675f9056c&quot;&gt;Leadership&lt;/a&gt; with co-founder&amp;nbsp;&lt;/li&gt;\n&lt;li&gt;We check references and conduct your background check&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;Please note - you are welcome to request additional conversations with anyone you would like to meet, but didn’t get to meet during the interview process.&lt;/p&gt;&lt;div class=&quot;content-conclusion&quot;&gt;&lt;h2&gt;&lt;strong&gt;&lt;span style=&quot;color: #a112ff;&quot;&gt;Learn more about us&lt;/span&gt;&lt;/strong&gt;&lt;/h2&gt;\n&lt;p&gt;You can learn more about what it is like to work at Sourcegraph by reading &lt;a href=&quot;https://sourcegraph.notion.site/d7614e3e9dc04c09ac2d42d57f1816e6?v=2a6d426dbae14390b155120b0c029ce0&quot;&gt;our handbook&lt;/a&gt;.&lt;/p&gt;\n&lt;p&gt;We are an ambitious team who are collectively working hard to build the most influential company in the world.&amp;nbsp; You can read more about our &lt;a href=&quot;https://sourcegraph.notion.site/What-it-s-like-working-at-Sourcegraph-119a8e11265880b18911eee4d9b7c460#119a8e1126588062b935fc66104b6115&quot;&gt;culture&lt;/a&gt;, &lt;a href=&quot;https://sourcegraph.notion.site/Compensation-Pay-Transparency-at-Sourcegraph-d58d0774f51b4b489d41c3628d30ff8d?pvs=74&quot;&gt;competitive compensation&lt;/a&gt; and &lt;a href=&quot;https://sourcegraph.notion.site/Benefits-Perks-dd1da4b6b3a64780abed010a144d34ba?pvs=74&quot;&gt;benefits&lt;/a&gt; here&lt;/p&gt;\n&lt;p&gt;Sourcegraph is an equal opportunity workplace; we welcome people from all backgrounds.&amp;nbsp;&lt;/p&gt;\n&lt;p&gt;&lt;em&gt;Sourcegraph participates in &lt;/em&gt;&lt;a href=&quot;https://sourcegraph.notion.site/E-Verify-2ab3286dde3446d6bac2898c83610107&quot;&gt;&lt;em&gt;E-Verify&lt;/em&gt;&lt;/a&gt;&lt;em&gt; for U.S. Employees. &lt;/em&gt;&lt;/p&gt;&lt;/div&gt;","tags":"[\"management\",\"engineering\"]","pubDate":"2025-01-22T20:13:43.000Z","link":"https://boards.greenhouse.io/sourcegraph91/jobs/5412014004","slug":"enterprise-technical-advisor-post-sales-customer-success-ic3-ic4-sourcegraph-551"},{"id":8884363106,"title":"Senior Server Engineer - Experience","company":"VRChat","image":"https://avatars.githubusercontent.com/u/7309826?s=200&v=4","description":"<div><span style=\"font-size: 11pt;\">We’re looking for someone who’s interested in designing and building the backend tech that powers the VRChat community. VRChat’s mission is to enrich the world through immersive social connection, and we’re doing this by developing a “live” platform that’s constantly updated and evolving, so you’ll see your work have an immediate impact on our massive global community of users.</span></div><div><br></div><div><span style=\"font-size: 11pt;\">As a Server Engineer you’ll be joining a full-stack team of Engineers as an expert in cloud application development. Help us build the services and experiences that empower our users to connect to and create their part of the VRChat universe. If you’re interested in the data layer behind new feature development, then this role could be right up your alley.</span></div><div><br></div><div><span style=\"font-size: 11pt;\">VRChat offers a first-of-its-kind, game-changing platform that provides an endless collection of social VR experiences and gives the power of creation to its robust community. With over 250,000 worlds and growing, VRChat’s vision is to enable users to bring their imaginations to life and help shape the metaverse anywhere in the world on any device.&nbsp;</span></div><div><br></div><div><span style=\"font-size: 11pt;\">VRChat has raised around $100M to date with the support of our investors, which include: Makers Fund, Anthos Capital and HTC. We have a great team which includes people from: Netflix, Twitter, Meta, Microsoft, Roblox, Google, Amazon, Unity, Spotify, Discord, Uber, eBay, Robinhood, Twitch, Zynga and TikTok.&nbsp;</span></div><div><br></div><div><span style=\"font-size: 11pt;\">Come and join the mission!</span></div><h3>Responsibilities:</h3><li>Work within a full-stack team of Engineers to develop a scalable backend and infrastructure for VRChat</li><li>Design, implement, and maintain systems involving REST APIs, websocket APIs, databases, caching systems, mailing systems, payment processing, queueing systems, networked storage, logging systems, cloud orchestration, and more</li><li>Work with cross-functional collaborators to ensure technical excellence in service of meaningful user experiences</li><li>Be available to occasionally jump into action to solve an outage, even at inconvenient times</li>,<h3>Preferred Skills and Experience:</h3><li>Five or more years of experience iteratively developing and designing scalable and modular backends and infrastructure for websites, SaaS products, online games, or similar systems</li><li>Able to architect applications and features (for example, social features and search)</li><li>Experienced with using cloud providers at scale, such as AWS or Google Cloud</li><li>Able to work in a variety of languages and technologies, specifically backend JavaScript, C#, Mongo, and Redis</li><li>Strong collaboration and communication skills</li>,<h3>Bonus Points:</h3><li>Demonstrated interest in VR, online communities, or be a VRChat user and creator! </li><li>Knowing how our platform and community works will be helpful for this role</li><li>Experience with social networks and social data, financial system integration, or recommendation and discovery systems</li><li>Experience working on consumer products, e-commerce, or two-sided marketplaces</li>,<h3>Benefits:</h3><li>Work from anywhere! VRChat is a 100% remote company offering flexible working hours in combination with core hours supporting real-time collaboration</li><li>Health Benefits</li><li>401K for US &amp; Group RRSP for Canadian Employees</li><li>Stock Options</li><li>Generous paid holiday schedule</li><li>Unlimited/Flexible vacation time</li><li>Paid parental leave benefits</li><div><span style=\"font-size: 10px;\">VRChat is an equal-opportunity employer, and we welcome applicants from all backgrounds.</span></div><div><br></div><div><span style=\"font-size: 10px;\">VRChat fosters a diverse, creative, and collaborative environment where anyone can contribute to any of the ongoing projects or direction of the roadmap at any time.&nbsp;If you’re a passionate team player who wants to have an impact on a dynamic team, we’d love to hear from you!</span></div><div><br></div><div><span style=\"font-size: 10px;\">All job offers are subject to satisfactory referencing and background checks.</span></div>","tags":"[\"javascript\",\"database\",\"mongo\",\"aws\"]","pubDate":"2025-01-22T16:28:36.068Z","link":"https://jobs.lever.co/vrchat/79275492-017b-47fa-92cd-9e7390084a5c","slug":"senior-server-engineer-experience-vrchat-4216"},{"id":5024794219,"title":"Senior Customer Success Manager","company":"Synthflow","image":"https://yt3.googleusercontent.com/d1EZViC7xXJl3O7DDUguF5UgjjvGXpqeKMhl-ivOftHbUeIFJDURN3TR8MnKewBKI44oO3n5HA=s160-c-k-c0x00ffffff-no-rj","description":"<p style=\"min-height:1.5em\">This is a fully remote role, allowing you to work from anywhere in the world. However, to facilitate contact with our US clients we strongly prefer candidates in US time zones. </p><p style=\"min-height:1.5em\"></p><h1><strong>About Synthflow</strong></h1><p style=\"min-height:1.5em\">At <a target=\"_blank\" rel=\"noopener noreferrer nofollow\" href=\"http://synthflow.ai/\">Synthflow</a> we’re building the easiest way for businesses to create AI-powered phone agents. No coding, no fuss—just smarter automation. We’re passionate about delivering the future of voice technology with lightning-fast, scalable solutions. It’s an exciting time at Synthflow: we’re early, fast-growing, and laser-focused on impact. Join us to do the best work of your career while helping businesses thrive.</p><p style=\"min-height:1.5em\"></p><h1><strong>About the role</strong></h1><p style=\"min-height:1.5em\">As a Senior Customer Success Manager at Synthflow, your primary responsibility will be ensuring the success of our enterprise customers as they go live with their AI phone agents. You will help with prompting, integrations, and directly with customers to make sure they have whatever they need to succeed. This is a hands on, customer facing role.</p><p style=\"min-height:1.5em\"><br />We aren’t a super traditional team, but we are an extremely effective one. We love unique backgrounds, hard workers, and intelligent people who take pride in everything they do.<br /></p><h2>Your responsibilities will include:</h2><ul style=\"min-height:1.5em\"><li><p style=\"min-height:1.5em\">Onboard enterprise customers, helping with initial prompting, integrations, and set-up.</p></li><li><p style=\"min-height:1.5em\">Help out with technical tickets</p></li><li><p style=\"min-height:1.5em\">Weekly check-in calls with project leaders, weekly workshops with engineers.</p></li><li><p style=\"min-height:1.5em\">Anything the customer needs, we make happen, your job is to take the actions needed to do just that</p></li></ul><p style=\"min-height:1.5em\"></p><h2>You will:</h2><ul style=\"min-height:1.5em\"><li><p style=\"min-height:1.5em\">Work closely with our customer success and sales teams to better understand our customers needs and how we can ensure their success.</p></li><li><p style=\"min-height:1.5em\">Build conversational pathways for and with our customers.</p></li><li><p style=\"min-height:1.5em\">Spend time on customer calls, providing support to sales.</p></li></ul><p style=\"min-height:1.5em\"></p><h1>Who you are:</h1><ul style=\"min-height:1.5em\"><li><p style=\"min-height:1.5em\">You have a minimum of 5+ years of work experience in customer success, sales engineering, or customer support.</p></li><li><p style=\"min-height:1.5em\">You have experience with AI/ML applications, and are comfortable with prompt engineering.</p></li><li><p style=\"min-height:1.5em\">You have experience leading teams/junior colleagues.</p></li><li><p style=\"min-height:1.5em\">You have a minimum of 1+ years in a customer facing engineering role, ideally in enterprise settings.</p></li><li><p style=\"min-height:1.5em\">You are obsessed with ensuring customers are successful.</p></li><li><p style=\"min-height:1.5em\">You pay attention to small details and enjoy collaborating cross-functionally on a small team.</p></li></ul><p style=\"min-height:1.5em\"></p><h1>Beyond the basics:</h1><ul style=\"min-height:1.5em\"><li><p style=\"min-height:1.5em\">Experience in building enterprise level for AI Services</p></li><li><p style=\"min-height:1.5em\">Experience with LLMs</p></li><li><p style=\"min-height:1.5em\">Experience at a fast growing startup is a must</p></li><li><p style=\"min-height:1.5em\">Experience with enterprise customers is a plus</p></li><li><p style=\"min-height:1.5em\">Deep understanding in processes encompassing Sales, CSM and Engineering</p></li></ul><p style=\"min-height:1.5em\"></p><h1><strong>What we offer:</strong></h1><ul style=\"min-height:1.5em\"><li><p style=\"min-height:1.5em\"><strong>Autonomy at speed: </strong>High-ownership roles in a fast-moving startup.</p></li><li><p style=\"min-height:1.5em\"><strong>Remote-first flexibility: </strong>Contribute from anywhere, on your schedule.</p></li><li><p style=\"min-height:1.5em\"><strong>Cutting-edge technology:</strong> Work on what interests you most.</p></li><li><p style=\"min-height:1.5em\"><strong>Career growth: </strong>Scale your impact as the company grows.</p></li><li><p style=\"min-height:1.5em\"><strong>Rewarding package: </strong>Competitive pay, equity options, and comprehensive benefits that reflect your skills and experience. </p></li></ul>","tags":"[\"engineering\"]","pubDate":"2025-01-22T14:51:54.481Z","link":"https://jobs.ashbyhq.com/synthflow/c89c8a27-c390-4066-a218-230370afad55","slug":"senior-customer-success-manager-synthflow-1706"},{"id":9100412329,"title":"Junior Recruitment Specialist","company":"Ruby Labs","image":"https://media.licdn.com/dms/image/v2/D4D0BAQF7VVv61POIFw/company-logo_200_200/company-logo_200_200/0/1721937953426?e=1743033600&v=beta&t=_qAkZ_qGO7Du2NSUdHDNbUKIbz28Y1HDm1g9mwNIOnk","description":"<div style=\"text-align:left\"><img style=\"max-width:100%\" src=\"https://app.ashbyhq.com/api/images/user-content/49307af8-ad4e-48bf-ab90-4953176fd044/6ecd2b79-121c-4426-8dde-67a93f437788/Ruby%20Labs.jpg\" /></div><h1><strong>About us</strong></h1><p style=\"min-height:1.5em\">Ruby Labs is a leading tech company that creates and operates innovative consumer products. We offer a diverse range of opportunities across the health, education, and entertainment industries. Our innovative teams are driving the future of consumer-led products, and we're always looking for passionate individuals to join us. Learn more about our story at: <a target=\"_blank\" rel=\"noopener noreferrer nofollow\" href=\"https://rubylabs.com/about-us/\"><u>https://rubylabs.com/about-us/</u></a></p><p style=\"min-height:1.5em\"></p><h1><strong>About the role</strong></h1><p style=\"min-height:1.5em\">Thrive as a Junior Recruitment Specialist at Ruby Labs and play a key role in attracting top talent to our growing team! You'll collaborate closely with hiring managers to understand their specific needs and source qualified candidates across various departments, including product, marketing, and engineering. This exciting opportunity is ideal for someone with a passion for talent acquisition, strong organizational skills, and a keen eye for detail. We are especially looking for someone with international experience, as you'll be engaging with candidates from diverse backgrounds and locations, bringing a global perspective to our recruitment strategy.</p><p style=\"min-height:1.5em\"></p><h1><strong>Responsibilities</strong></h1><ul style=\"min-height:1.5em\"><li><p style=\"min-height:1.5em\">Screen resumes and conduct recruiter screenings of applicants to identify potential candidates.</p></li><li><p style=\"min-height:1.5em\">Source high-quality candidates through various channels, including job boards, social media, and networking events.</p></li><li><p style=\"min-height:1.5em\">Manage candidate pipelines and maintain accurate records in our ATS, ensuring organizational efficiency throughout the recruitment process.</p></li><li><p style=\"min-height:1.5em\">Provide timely feedback to candidates throughout the recruitment process, contributing to a smooth and positive candidate experience.</p></li><li><p style=\"min-height:1.5em\">Build and maintain strong relationships with hiring managers to understand their needs and priorities.</p></li><li><p style=\"min-height:1.5em\">Collaborate with the Recruitment team to continuously improve recruitment processes and procedures.</p></li><li><p style=\"min-height:1.5em\">Stay informed about industry trends and best practices in talent acquisition.</p></li></ul><p style=\"min-height:1.5em\"></p><h1><strong>Qualifications</strong></h1><ul style=\"min-height:1.5em\"><li><p style=\"min-height:1.5em\">1+ year of experience in recruitment, preferably in a tech company environment.</p></li><li><p style=\"min-height:1.5em\">Familiarity with well-known ATS platforms such as Greenhouse, Lever, Ashby, etc.</p></li><li><p style=\"min-height:1.5em\">Strong organizational skills and attention to detail.</p></li><li><p style=\"min-height:1.5em\">Excellent communication and interpersonal skills.</p></li><li><p style=\"min-height:1.5em\">Ability to work independently and as part of a team in a fast-paced environment.</p></li><li><p style=\"min-height:1.5em\">Passion for talent acquisition and recruitment.</p></li><li><p style=\"min-height:1.5em\">Ability to work in a fast-paced environment and manage multiple priorities effectively.</p></li><li><p style=\"min-height:1.5em\">Excellent written and verbal communication skills in English.</p></li></ul><p style=\"min-height:1.5em\"></p><h1><strong>Location</strong></h1><p style=\"min-height:1.5em\">Ruby Labs operates within the CET (Central European Time) time zone. Applicants from any country are welcome to apply for the position as long as they are located within approximately ± 4 hours of CET. This ensures optimal collaboration and communication during working hours.</p><p style=\"min-height:1.5em\"></p><h1><strong>What we offer</strong></h1><p style=\"min-height:1.5em\">Discover the perks of being part of our vibrant team! We offer:</p><ul style=\"min-height:1.5em\"><li><p style=\"min-height:1.5em\"><strong>Remote Work Environment</strong>: Embrace the freedom to work from anywhere, anytime, promoting a healthy work-life balance. 🏡⏰</p></li><li><p style=\"min-height:1.5em\"><strong>Unlimited PTO</strong>: Enjoy unlimited paid time off to recharge and prioritize your well-being, without counting days. 🌴💼</p></li><li><p style=\"min-height:1.5em\"><strong>Paid National Holidays</strong>: Celebrate and relax on national holidays with paid time off to unwind and recharge. 🎉🌟</p></li><li><p style=\"min-height:1.5em\"><strong>Company-provided MacBook</strong>: Experience seamless productivity with top-notch Apple MacBooks provided to all employees who need them. 💻🚀</p></li><li><p style=\"min-height:1.5em\"><strong>Flexible Independent Contractor Agreement</strong>: Unlock the benefits of flexibility, autonomy, and entrepreneurial opportunities. Benefit from tax advantages, networking opportunities, reduced employment obligations, and the freedom to work from anywhere. Read more about it here: <a target=\"_blank\" rel=\"noopener noreferrer nofollow\" href=\"https://wiki.rubylabs.com/s/b11227c3-fa74-4c39-bd1d-3e59056a2cf4\">https://wiki.rubylabs.com/s/b11227c3-fa74-4c39-bd1d-3e59056a2cf4</a> 📈💼</p></li></ul><p style=\"min-height:1.5em\">Be part of our fast-growing team and seize this excellent opportunity for personal and professional growth!</p><p style=\"min-height:1.5em\"></p><h1><strong>Interview Process</strong></h1><p style=\"min-height:1.5em\">After submitting your application, we conduct a thorough review which typically takes 3 to 5 days, but may occasionally take longer due to the volume of applications received. If we see a potential fit, we proceed with the following steps:</p><ul style=\"min-height:1.5em\"><li><p style=\"min-height:1.5em\">Recruiter Screening (40 minutes)</p></li><li><p style=\"min-height:1.5em\">Take-home Assignment</p></li><li><p style=\"min-height:1.5em\">Hiring Manager Interview (40 minutes)</p></li></ul><p style=\"min-height:1.5em\"></p><h1><strong>Life at Ruby Labs</strong></h1><p style=\"min-height:1.5em\">At Ruby Labs, we are more than a team; we're a community united in pushing the boundaries of technology and innovation. Our combined passion fuels our ambition for excellence, driving impact that resonates around the globe.</p><p style=\"min-height:1.5em\">We are an equal opportunity employer and celebrate diversity, recognizing that a diversity of thought and backgrounds builds stronger teams. We approach diversity and inclusion seriously and thoughtfully. We do not discriminate based on race, ethnicity, religion, color, place of birth, sex, gender identity or expression, sexual orientation, age, marital status, military service status, or disability status. Join us and be part of a company that is crafting the future of technology across multiple industries.</p><p style=\"min-height:1.5em\"></p><p style=\"min-height:1.5em\">#Li-Remote</p>","tags":"[\"engineering\"]","pubDate":"2025-01-22T14:17:14.897Z","link":"https://jobs.ashbyhq.com/ruby-labs/7083dacd-3f55-4714-9098-17910e414cc2","slug":"junior-recruitment-specialist-ruby-labs-797"},{"id":7200375581,"title":"Junior Talent Partner","company":"Ruby Labs","image":"https://media.licdn.com/dms/image/v2/D4D0BAQF7VVv61POIFw/company-logo_200_200/company-logo_200_200/0/1721937953426?e=1743033600&v=beta&t=_qAkZ_qGO7Du2NSUdHDNbUKIbz28Y1HDm1g9mwNIOnk","description":"<div style=\"text-align:left\"><img style=\"max-width:100%\" src=\"https://app.ashbyhq.com/api/images/user-content/49307af8-ad4e-48bf-ab90-4953176fd044/6ecd2b79-121c-4426-8dde-67a93f437788/Ruby%20Labs.jpg\" /></div><h1><strong>About us</strong></h1><p style=\"min-height:1.5em\">Ruby Labs is a leading tech company that creates and operates innovative consumer products. We offer a diverse range of opportunities across the health, education, and entertainment industries. Our innovative teams are driving the future of consumer-led products, and we're always looking for passionate individuals to join us. Learn more about our story at: <a target=\"_blank\" rel=\"noopener noreferrer nofollow\" href=\"https://rubylabs.com/about-us/\"><u>https://rubylabs.com/about-us/</u></a></p><p style=\"min-height:1.5em\"></p><h1><strong>About the role</strong></h1><p style=\"min-height:1.5em\">Thrive as a Junior Recruitment Specialist at Ruby Labs and play a key role in attracting top talent to our growing team! You'll collaborate closely with hiring managers to understand their specific needs and source qualified candidates across various departments, including product, marketing, and engineering. This exciting opportunity is ideal for someone with a passion for talent acquisition, strong organizational skills, and a keen eye for detail. We are especially looking for someone with international experience, as you'll be engaging with candidates from diverse backgrounds and locations, bringing a global perspective to our recruitment strategy.</p><p style=\"min-height:1.5em\"></p><h1><strong>Responsibilities</strong></h1><ul style=\"min-height:1.5em\"><li><p style=\"min-height:1.5em\">Screen resumes and conduct recruiter screenings of applicants to identify potential candidates.</p></li><li><p style=\"min-height:1.5em\">Source high-quality candidates through various channels, including job boards, social media, and networking events.</p></li><li><p style=\"min-height:1.5em\">Manage candidate pipelines and maintain accurate records in our ATS, ensuring organizational efficiency throughout the recruitment process.</p></li><li><p style=\"min-height:1.5em\">Provide timely feedback to candidates throughout the recruitment process, contributing to a smooth and positive candidate experience.</p></li><li><p style=\"min-height:1.5em\">Build and maintain strong relationships with hiring managers to understand their needs and priorities.</p></li><li><p style=\"min-height:1.5em\">Collaborate with the Recruitment team to continuously improve recruitment processes and procedures.</p></li><li><p style=\"min-height:1.5em\">Stay informed about industry trends and best practices in talent acquisition.</p></li></ul><p style=\"min-height:1.5em\"></p><h1><strong>Qualifications</strong></h1><ul style=\"min-height:1.5em\"><li><p style=\"min-height:1.5em\">1+ year of experience in recruitment, preferably in a tech company environment.</p></li><li><p style=\"min-height:1.5em\">Familiarity with well-known ATS platforms such as Greenhouse, Lever, Ashby, etc.</p></li><li><p style=\"min-height:1.5em\">Strong organizational skills and attention to detail.</p></li><li><p style=\"min-height:1.5em\">Excellent communication and interpersonal skills.</p></li><li><p style=\"min-height:1.5em\">Ability to work independently and as part of a team in a fast-paced environment.</p></li><li><p style=\"min-height:1.5em\">Passion for talent acquisition and recruitment.</p></li><li><p style=\"min-height:1.5em\">Ability to work in a fast-paced environment and manage multiple priorities effectively.</p></li><li><p style=\"min-height:1.5em\">Excellent written and verbal communication skills in English.</p></li></ul><p style=\"min-height:1.5em\"></p><h1><strong>Location</strong></h1><p style=\"min-height:1.5em\">Ruby Labs operates within the CET (Central European Time) time zone. Applicants from any country are welcome to apply for the position as long as they are located within approximately ± 4 hours of CET. This ensures optimal collaboration and communication during working hours.</p><p style=\"min-height:1.5em\"></p><h1><strong>What we offer</strong></h1><p style=\"min-height:1.5em\">Discover the perks of being part of our vibrant team! We offer:</p><ul style=\"min-height:1.5em\"><li><p style=\"min-height:1.5em\"><strong>Remote Work Environment</strong>: Embrace the freedom to work from anywhere, anytime, promoting a healthy work-life balance. 🏡⏰</p></li><li><p style=\"min-height:1.5em\"><strong>Unlimited PTO</strong>: Enjoy unlimited paid time off to recharge and prioritize your well-being, without counting days. 🌴💼</p></li><li><p style=\"min-height:1.5em\"><strong>Paid National Holidays</strong>: Celebrate and relax on national holidays with paid time off to unwind and recharge. 🎉🌟</p></li><li><p style=\"min-height:1.5em\"><strong>Company-provided MacBook</strong>: Experience seamless productivity with top-notch Apple MacBooks provided to all employees who need them. 💻🚀</p></li><li><p style=\"min-height:1.5em\"><strong>Flexible Independent Contractor Agreement</strong>: Unlock the benefits of flexibility, autonomy, and entrepreneurial opportunities. Benefit from tax advantages, networking opportunities, reduced employment obligations, and the freedom to work from anywhere. Read more about it here: <a target=\"_blank\" rel=\"noopener noreferrer nofollow\" href=\"https://wiki.rubylabs.com/s/b11227c3-fa74-4c39-bd1d-3e59056a2cf4\">https://wiki.rubylabs.com/s/b11227c3-fa74-4c39-bd1d-3e59056a2cf4</a> 📈💼</p></li></ul><p style=\"min-height:1.5em\">Be part of our fast-growing team and seize this excellent opportunity for personal and professional growth!</p><p style=\"min-height:1.5em\"></p><h1><strong>Interview Process</strong></h1><p style=\"min-height:1.5em\">After submitting your application, we conduct a thorough review which typically takes 3 to 5 days, but may occasionally take longer due to the volume of applications received. If we see a potential fit, we proceed with the following steps:</p><ul style=\"min-height:1.5em\"><li><p style=\"min-height:1.5em\">Recruiter Screening (40 minutes)</p></li><li><p style=\"min-height:1.5em\">Take-home Assignment</p></li><li><p style=\"min-height:1.5em\">Hiring Manager Interview (40 minutes)</p></li></ul><p style=\"min-height:1.5em\"></p><h1><strong>Life at Ruby Labs</strong></h1><p style=\"min-height:1.5em\">At Ruby Labs, we are more than a team; we're a community united in pushing the boundaries of technology and innovation. Our combined passion fuels our ambition for excellence, driving impact that resonates around the globe.</p><p style=\"min-height:1.5em\">We are an equal opportunity employer and celebrate diversity, recognizing that a diversity of thought and backgrounds builds stronger teams. We approach diversity and inclusion seriously and thoughtfully. We do not discriminate based on race, ethnicity, religion, color, place of birth, sex, gender identity or expression, sexual orientation, age, marital status, military service status, or disability status. Join us and be part of a company that is crafting the future of technology across multiple industries.</p><p style=\"min-height:1.5em\"></p><p style=\"min-height:1.5em\">#Li-Remote</p>","tags":"[\"engineering\"]","pubDate":"2025-01-22T14:14:28.958Z","link":"https://jobs.ashbyhq.com/ruby-labs/adf59085-d981-4320-95ee-fe347ef30ed6","slug":"junior-talent-partner-ruby-labs-8240"},{"id":1123486906,"title":"Senior IT Operations Systems Engineer","company":"Airalo","image":"https://lever-client-logos.s3.us-west-2.amazonaws.com/55028a36-609c-479c-9553-d4689ff2dd8c-1669620566663.png","description":"<div><b>About Airalo</b></div><div>Alo! Airalo is the world’s first eSIM store that helps people connect in over 200+ countries and regions across the globe. We are building the next digital service that revolutionizes the telecom industry. We are a travel-tech company and an equal-opportunity environment that values and executes diversity, inclusion, and equity. Our team is spread across 50+ countries and six continents. What glues us together is our commitment to changing the way you connect<span style=\"font-size: 13.3333px\">. </span></div><div><br></div><div><b>About you</b></div><div>We hope that you care deeply about the quality of your work, the intrinsic worth of tasks, and the success of your team. You are self-disciplined and do not require micromanagement in terms of your skillset and work ethic. You do your best to flourish as an individual every day while working hard to foster a collaborative team environment. You believe in the importance of being — and staying — authentic, honest, positive, and kind. You are a good interlocutor with clear and concise communication. You are able to manage multiple projects, have an analytical mind, pay keen attention to detail, and love to get your hands dirty. You are cognizant, tolerant, and welcoming of vulnerabilities and cultural differences.</div><div><br></div><div><b>About the Role</b></div><div><b>Position</b>: Full-time / Employee</div><div><b>Location:</b>&nbsp;Remote-first </div><div><b>Benefits:</b>&nbsp;Health Insurance, work-from-anywhere stipend, annual wellness &amp; learning credits, annual all-expenses-paid company retreat in a gorgeous destination &amp; other benefits</div><div><br></div><div>The Senior IT Operations Systems Engineer is pivotal in helping shape the future of how our Internal Users work. The systems engineer will have a big role in building out automation within the IT organization and will be a POC/escalation point for the IT operations team. With this role being the first of its kind at Airalo, You will be responsible for helping with building out structures and processes for the team, having an eye for continuous process improvement, and always looking for ways to improve our internal user experience. If you enjoy working in a fast-paced environment, possess strong interpersonal skills, and have a passion for technology and telecommunications, we encourage you to explore further.</div><h3>Responsibilities include but are not limited to:</h3><li>Identify and solve team, organizational, and business IT infrastructure problems.</li><li>Making technical decisions on behalf of the department and organization while providing presentation support to leaders during technical discussions.</li><li>Joint collaboration with Compliance, IT, People, and Security team members for improving automation efficiency, security posture, and vulnerability management.</li><li>Designing and developing software that improves back office automation.</li><li>Participate in the Global IT planning process and ensure architectural designs and principles are incorporated in enterprise implementations</li><li>Provide senior level direction to the Information Technology team, assist with mentoring and providing technical guidance to more junior staff members</li><li>Build roadmaps for acquiring, integrating, and implementing high-value technology and processes. Oversee efforts (e.g. proof of concepts) to measure and prove new technology value</li><li>Create and manage access policies to improve security and adhere to compliance standards.</li><li>Build and maintain cross-functional relationships with internal teams to drive initiatives</li><li>Work with Security, PeopleOps and IT to develop automated onboarding and offboarding processes</li>,<h3>Must-haves:</h3><li>5+ years of experience in user support in a cloud-first modern IT environment</li><li>Proven experience designing and deploying SaaS applications such as MDM and IDP Solutions</li><li>In-depth knowledge of identity and access management concepts and practices.</li><li>Developing automation workflows and integrations for repetitive or manual tasks</li><li>Ability to work independently and collaboratively in a fast-paced environment.</li><li>Team player and open to new ideas.</li><li>Good communication skills and fluency in English.</li>,<h3>Good to have:</h3><li>Knowledge in one of the following scripting languages - Python or Ruby</li><li>Experience with workflow automation and Saas tools that can deliver on that such as, but not limited to Okta, JAMF/Jumpcloud, Zapier etc. (Okta &amp; JAMF/Jumpcloud certification)</li><li>Experience in supporting other departments with high priority projects</li><li>Experience with HRIS systems</li><li>Cloud computing administration experience (AWS/GCP)</li><li>Have strong fundamental knowledge of security best practices.</li><li>Prior work experience in telecommunications.</li><li>Knowledge of eSIM and GSMA related technologies and services.</li><div>If you are interested in this position, <b>please apply via the link.</b></div><div><br></div><div><i style=\"font-size: 15px\">Please note that our Engineering team works in the CET timezone, so candidates will need to reside in countries with the same time zone or similar to it and will need to already have permit to work in the country where they are based.</i></div><div><br></div><div>We sincerely thank all applicants in advance for submitting their interest in this opportunity. Airalo is an equal opportunity employer and values diversity, equity &amp; inclusion. We do not discriminate on the basis of race, religion, national origin, gender, sexual orientation, age, marital status, veteran status, or disability status. We are committed to providing reasonable accommodations upon request for individuals with disabilities throughout our job interview process.</div>","tags":"[\"management\",\"engineering\",\"aws\"]","pubDate":"2025-01-22T13:08:10.278Z","link":"https://jobs.lever.co/airalo/a3c239ec-0b4a-483a-8a00-e91e7c6b5ea0","slug":"senior-it-operations-systems-engineer-airalo-7456"},{"id":3035130200,"title":"Junior Talent Acquisition Specialist","company":"Ruby Labs","image":"https://media.licdn.com/dms/image/v2/D4D0BAQF7VVv61POIFw/company-logo_200_200/company-logo_200_200/0/1721937953426?e=1743033600&v=beta&t=_qAkZ_qGO7Du2NSUdHDNbUKIbz28Y1HDm1g9mwNIOnk","description":"<div style=\"text-align:left\"><img style=\"max-width:100%\" src=\"https://app.ashbyhq.com/api/images/user-content/49307af8-ad4e-48bf-ab90-4953176fd044/6ecd2b79-121c-4426-8dde-67a93f437788/Ruby%20Labs.jpg\" /></div><h1><strong>About us</strong></h1><p style=\"min-height:1.5em\">Ruby Labs is a leading tech company that creates and operates innovative consumer products. We offer a diverse range of opportunities across the health, education, and entertainment industries. Our innovative teams are driving the future of consumer-led products, and we're always looking for passionate individuals to join us. Learn more about our story at: <a target=\"_blank\" rel=\"noopener noreferrer nofollow\" href=\"https://rubylabs.com/about-us/\"><u>https://rubylabs.com/about-us/</u></a></p><p style=\"min-height:1.5em\"></p><h1><strong>About the role</strong></h1><p style=\"min-height:1.5em\">Thrive as a Junior Recruitment Specialist at Ruby Labs and play a key role in attracting top talent to our growing team! You'll collaborate closely with hiring managers to understand their specific needs and source qualified candidates across various departments, including product, marketing, and engineering. This exciting opportunity is ideal for someone with a passion for talent acquisition, strong organizational skills, and a keen eye for detail. We are especially looking for someone with international experience, as you'll be engaging with candidates from diverse backgrounds and locations, bringing a global perspective to our recruitment strategy.</p><p style=\"min-height:1.5em\"></p><h1><strong>Responsibilities</strong></h1><ul style=\"min-height:1.5em\"><li><p style=\"min-height:1.5em\">Screen resumes and conduct recruiter screenings of applicants to identify potential candidates.</p></li><li><p style=\"min-height:1.5em\">Source high-quality candidates through various channels, including job boards, social media, and networking events.</p></li><li><p style=\"min-height:1.5em\">Manage candidate pipelines and maintain accurate records in our ATS, ensuring organizational efficiency throughout the recruitment process.</p></li><li><p style=\"min-height:1.5em\">Provide timely feedback to candidates throughout the recruitment process, contributing to a smooth and positive candidate experience.</p></li><li><p style=\"min-height:1.5em\">Build and maintain strong relationships with hiring managers to understand their needs and priorities.</p></li><li><p style=\"min-height:1.5em\">Collaborate with the Recruitment team to continuously improve recruitment processes and procedures.</p></li><li><p style=\"min-height:1.5em\">Stay informed about industry trends and best practices in talent acquisition.</p></li></ul><p style=\"min-height:1.5em\"></p><h1><strong>Qualifications</strong></h1><ul style=\"min-height:1.5em\"><li><p style=\"min-height:1.5em\">1+ year of experience in recruitment, preferably in a tech company environment.</p></li><li><p style=\"min-height:1.5em\">Familiarity with well-known ATS platforms such as Greenhouse, Lever, Ashby, etc.</p></li><li><p style=\"min-height:1.5em\">Strong organizational skills and attention to detail.</p></li><li><p style=\"min-height:1.5em\">Excellent communication and interpersonal skills.</p></li><li><p style=\"min-height:1.5em\">Ability to work independently and as part of a team in a fast-paced environment.</p></li><li><p style=\"min-height:1.5em\">Passion for talent acquisition and recruitment.</p></li><li><p style=\"min-height:1.5em\">Ability to work in a fast-paced environment and manage multiple priorities effectively.</p></li><li><p style=\"min-height:1.5em\">Excellent written and verbal communication skills in English.</p></li></ul><p style=\"min-height:1.5em\"></p><h1><strong>Location</strong></h1><p style=\"min-height:1.5em\">Ruby Labs operates within the CET (Central European Time) time zone. Applicants from any country are welcome to apply for the position as long as they are located within approximately ± 4 hours of CET. This ensures optimal collaboration and communication during working hours.</p><p style=\"min-height:1.5em\"></p><h1><strong>What we offer</strong></h1><p style=\"min-height:1.5em\">Discover the perks of being part of our vibrant team! We offer:</p><ul style=\"min-height:1.5em\"><li><p style=\"min-height:1.5em\"><strong>Remote Work Environment</strong>: Embrace the freedom to work from anywhere, anytime, promoting a healthy work-life balance. 🏡⏰</p></li><li><p style=\"min-height:1.5em\"><strong>Unlimited PTO</strong>: Enjoy unlimited paid time off to recharge and prioritize your well-being, without counting days. 🌴💼</p></li><li><p style=\"min-height:1.5em\"><strong>Paid National Holidays</strong>: Celebrate and relax on national holidays with paid time off to unwind and recharge. 🎉🌟</p></li><li><p style=\"min-height:1.5em\"><strong>Company-provided MacBook</strong>: Experience seamless productivity with top-notch Apple MacBooks provided to all employees who need them. 💻🚀</p></li><li><p style=\"min-height:1.5em\"><strong>Flexible Independent Contractor Agreement</strong>: Unlock the benefits of flexibility, autonomy, and entrepreneurial opportunities. Benefit from tax advantages, networking opportunities, reduced employment obligations, and the freedom to work from anywhere. Read more about it here: <a target=\"_blank\" rel=\"noopener noreferrer nofollow\" href=\"https://wiki.rubylabs.com/s/b11227c3-fa74-4c39-bd1d-3e59056a2cf4\">https://wiki.rubylabs.com/s/b11227c3-fa74-4c39-bd1d-3e59056a2cf4</a> 📈💼</p></li></ul><p style=\"min-height:1.5em\">Be part of our fast-growing team and seize this excellent opportunity for personal and professional growth!</p><p style=\"min-height:1.5em\"></p><h1><strong>Interview Process</strong></h1><p style=\"min-height:1.5em\">After submitting your application, we conduct a thorough review which typically takes 3 to 5 days, but may occasionally take longer due to the volume of applications received. If we see a potential fit, we proceed with the following steps:</p><ul style=\"min-height:1.5em\"><li><p style=\"min-height:1.5em\">Recruiter Screening (40 minutes)</p></li><li><p style=\"min-height:1.5em\">Take-home Assignment</p></li><li><p style=\"min-height:1.5em\">Hiring Manager Interview (40 minutes)</p></li></ul><p style=\"min-height:1.5em\"></p><h1><strong>Life at Ruby Labs</strong></h1><p style=\"min-height:1.5em\">At Ruby Labs, we are more than a team; we're a community united in pushing the boundaries of technology and innovation. Our combined passion fuels our ambition for excellence, driving impact that resonates around the globe.</p><p style=\"min-height:1.5em\">We are an equal opportunity employer and celebrate diversity, recognizing that a diversity of thought and backgrounds builds stronger teams. We approach diversity and inclusion seriously and thoughtfully. We do not discriminate based on race, ethnicity, religion, color, place of birth, sex, gender identity or expression, sexual orientation, age, marital status, military service status, or disability status. Join us and be part of a company that is crafting the future of technology across multiple industries.</p><p style=\"min-height:1.5em\"></p><p style=\"min-height:1.5em\">#Li-Remote</p>","tags":"[\"engineering\"]","pubDate":"2025-01-22T12:59:52.687Z","link":"https://jobs.ashbyhq.com/ruby-labs/3ca2dc72-40e5-4f90-923a-40c60a78e977","slug":"junior-talent-acquisition-specialist-ruby-labs-3779"},{"id":5444528865,"title":"Head of Finance & Corporate","company":"Didask","image":"https://avatars.githubusercontent.com/u/14350668?s=200&v=4","description":"<p style=\"min-height:1.5em\"><em>🇫🇷 La langue de travail à Didask est l'anglais et sa maîtrise est requise pour nous rejoindre. Néanmoins, nous publions l'intégralité de nos offres d'emploi en français et en anglais. Vous pouvez retrouver toutes nos offres d'emploi sur </em><a target=\"_blank\" rel=\"noopener noreferrer nofollow\" href=\"https://jobs.ashbyhq.com/didask\"><em>cette page</em></a><em>, ainsi que plus d'informations sur Didask, notre culture et nos avantages.</em></p><p style=\"min-height:1.5em\"></p><p style=\"min-height:1.5em\"><em>🇬🇧🇺🇸 While English is our working language at Didask and proficiency is required to join us, we publish all our job openings in both English and French. You can find all our positions on </em><a target=\"_blank\" rel=\"noopener noreferrer nofollow\" href=\"https://jobs.ashbyhq.com/didask\"><em>this page</em></a><em>, along with more information about Didask, our culture and benefits.</em></p><h1>Job description</h1><p style=\"min-height:1.5em\"><em>Note: we describe our ideal candidate below. For an exceptional profile, this role could evolve into a Chief Financial Officer position. Please feel free to apply even if you don't think you match all items — we know these are ambitious expectations!</em></p><p style=\"min-height:1.5em\">As Head of Finance &amp; Corporate at Didask, you'll play a pivotal role in our next phase of growth. With over 65 team members today and plans to reach 100+ in the coming year, we're looking for someone to build and lead world-class finance and corporate functions while preserving the agility and transparency that make our culture unique.</p><p style=\"min-height:1.5em\">This role embodies our values of distributed ownership, radical transparency, and data-driven decision making:</p><h2>Financial Leadership</h2><p style=\"min-height:1.5em\">- Own our entire financial strategy, from daily operations to long-term planning</p><p style=\"min-height:1.5em\">- Build and maintain transparent financial models that drive decision-making across the company</p><p style=\"min-height:1.5em\">- Optimize cash management and financial operations at scale</p><p style=\"min-height:1.5em\">- Lead non-dilutive fundraising initiatives (debt, public funding, grants)</p><p style=\"min-height:1.5em\">- Lead relationships with investors, banks, and auditors with our signature transparency</p><p style=\"min-height:1.5em\">- Structure and manage our equity programs (BSA/BSPCE) to share our success</p><h2>Corporate Leadership</h2><p style=\"min-height:1.5em\">- Lead all legal and compliance matters, from contracts to corporate governance</p><p style=\"min-height:1.5em\">- Oversee and optimize our administrative operations</p><p style=\"min-height:1.5em\">- Manage our workplace strategy and facilities</p><p style=\"min-height:1.5em\">- Build and maintain relationships with key external partners (law firms, accounting firms)</p><p style=\"min-height:1.5em\">- Ensure our corporate structure supports our growth while staying lean and efficient</p><h2>Strategic Impact</h2><p style=\"min-height:1.5em\">- Partner with leadership to align financial and corporate strategy with company objectives</p><p style=\"min-height:1.5em\">- Champion data-driven decision making across the organization</p><p style=\"min-height:1.5em\">- Build scalable foundations that support both growth and cultural values</p><p style=\"min-height:1.5em\">- Be a key voice in strategic discussions, bringing both financial insight and cultural awareness</p><p style=\"min-height:1.5em\">- Embody and strengthen our culture of radical transparency in all matters</p><h2>Team Building</h2><p style=\"min-height:1.5em\">- Define and execute the long-term vision for the Finance &amp; Corporate team</p><p style=\"min-height:1.5em\">- Identify and attract key talent as we scale</p><p style=\"min-height:1.5em\">- Mentor and develop team members, fostering a culture of continuous learning</p><p style=\"min-height:1.5em\">- Create opportunities for internal growth and skill development</p><p style=\"min-height:1.5em\">- Build a team that embodies our values of transparency and distributed ownership</p><h1>Your profile</h1><p style=\"min-height:1.5em\">We're looking for someone with both strong financial expertise and a deep commitment to building transparent, scalable organizations. Here's what we expect:</p><ul style=\"min-height:1.5em\"><li><p style=\"min-height:1.5em\"><strong>Financial Excellence</strong>: You have significant experience in B2B SaaS startups, with a deep understanding of French accounting and tax regulations. You've built financial processes from the ground up, and your experience includes both equity and non-dilutive fundraising.</p></li><li><p style=\"min-height:1.5em\"><strong>Business Acumen</strong>: Beyond pure finance, you understand B2B SaaS metrics and what drives business value. You have experience with pricing strategies, unit economics, and translating business objectives into financial planning.</p></li><li><p style=\"min-height:1.5em\"><strong>Legal &amp; Corporate</strong>: You have a solid understanding of French corporate law and governance. You're experienced in managing legal matters in a high-growth environment and comfortable working with external counsel.</p></li><li><p style=\"min-height:1.5em\"><strong>Ownership Mindset</strong>: You thrive in environments where ownership is distributed and initiative is valued over hierarchy. You're comfortable making decisions with imperfect information and taking responsibility for outcomes. You believe in empowering teams through transparency rather than controlling through process.</p></li><li><p style=\"min-height:1.5em\"><strong>Communication Master</strong>: Written communication is at the heart of our culture, and you excel at it. You can make complex financial concepts accessible to non-finance stakeholders and practice radical transparency in your communications. You build trust through clear, thoughtful documentation and embrace async-first collaboration.</p></li><li><p style=\"min-height:1.5em\"><strong>Strategic &amp; Hands-on</strong>: You combine big-picture thinking with a willingness to dive into the details. You're equally comfortable building financial models and optimizing day-to-day operations. You know when to delegate and when to roll up your sleeves, always keeping our mission and values in mind.</p></li><li><p style=\"min-height:1.5em\"><strong>Growth Mindset</strong>: You're passionate about continuous learning and developing others. You see challenges as opportunities for growth and actively seek feedback. You have experience mentoring team members and creating learning opportunities.</p></li><li><p style=\"min-height:1.5em\"><strong>Tech Savvy</strong>: While not technical, you're comfortable with modern tools and excited about using technology to automate and scale operations. You have a track record of selecting and implementing tools that drive efficiency.</p></li></ul><h1>Interview process</h1><p style=\"min-height:1.5em\">Apply by answering a few written questions about your vision and expertise. Use your own words - we value authentic communication.</p><p style=\"min-height:1.5em\">If your profile catches our attention, here's what to expect:</p><ul style=\"min-height:1.5em\"><li><p style=\"min-height:1.5em\"><strong>Screening Interview</strong>: A first conversation to understand your background and motivations. We'll discuss your experience with transparent organizations and distributed ownership, and how you approach building scalable finance and corporate operations.</p></li><li><p style=\"min-height:1.5em\"><strong>Take-home Exercise</strong>: A practical challenge combining financial modeling and strategic thinking. We assess both technical skills and communication clarity, with emphasis on documentation and transparency.</p></li><li><p style=\"min-height:1.5em\"><strong>Leadership Discussion</strong>: A deeper conversation about scaling finance and corporate operations with key stakeholders. We'll explore your vision for the role and discuss concrete collaboration scenarios.</p></li><li><p style=\"min-height:1.5em\"><strong>Final Conversation</strong>: A discussion with cofounders about vision, values, and culture. We'll align on expectations and explore how you see the future of finance and corporate functions at Didask.</p></li></ul><p style=\"min-height:1.5em\"><em>🇫🇷 Sauf mention contraire, toutes nos offres sont accessibles en télétravail complet à condition de travailler dans un fuseau horaire proche de celui de Paris et de disposer des bonnes conditions de travail (notamment connexion Internet). Attention, nous ne pouvons à l'heure actuelle embaucher que des résidents fiscaux français.</em></p><p style=\"min-height:1.5em\"><em>🇬🇧🇺🇸 Unless specified otherwise, all positions are fully remote, provided you work in a timezone close to Paris and have suitable working conditions (including Internet connection). Please note that we can currently only hire French tax residents.</em></p>","tags":"[\"finance\",\"management\",\"b2b\",\"legal\"]","pubDate":"2025-01-22T09:59:06.394Z","link":"https://jobs.ashbyhq.com/didask/066808be-36d8-46d7-9711-268b8a84ace3","slug":"head-of-finance-corporate-didask-8568"},{"id":7762030173,"title":"Client Communications Coordinator","company":"Adaptive Teams","image":"https://remotive.com/job/1965450/logo","description":"<p>Join a rapidly growing advertising agency, where we focus on helping clients succeed on the Amazon advertising platform. Be at the forefront of our client relations team and lead the way to success with your outstanding organizational and communication skills.</p>\n<hr>\n<p><strong>Your Mission: Day to Day Responsibilities</strong></p>\n<p>As a Client Communications Coordinator, you'll be the primary point of contact for a subset of our clients. Your day-to-day responsibilities include:</p>\n<ul style=\"\">\n<li style=\"\">Manage client communications, ensuring timely and professional responses.</li>\n<li style=\"\">Serve as a liaison between clients and PPC Account Managers, ensuring account objectives are met.</li>\n<li style=\"\">Prepare for and conduct biweekly or monthly client calls, delivering performance reports and actionable insights.</li>\n<li style=\"\">Track and analyze advertising performance, providing clear explanations to clients.</li>\n<li style=\"\">Hold PPC Account Managers accountable for delivering client goals.</li>\n<li style=\"\">Report directly to the COO, sharing progress, challenges, and client updates.</li>\n<li style=\"\">Keep current information up-to-date in our knowledge base and team tools.</li>\n</ul>\n<p><strong>Your Toolbox: Skills to be Successful</strong></p>\n<p>To thrive in this remote role, you should have:</p>\n<ul style=\"\">\n<li style=\"\"><strong>Organization</strong>: Ability to manage your own time and delegate when necessary, with a focus on accountability and task follow-through.</li>\n<li style=\"\"><strong>Communication</strong>: Exceptional skills in client relationship management and team collaboration.</li>\n<li style=\"\"><strong>Creativity</strong>: Proactive in discovering innovative ways to delight our clients.</li>\n<li style=\"\"><strong>Amazon Advertising Knowledge</strong>: Basic understanding of Amazon PPC, or the eagerness to learn with our support.</li>\n<li style=\"\"><strong>Customer Support</strong>: Prior experience in maintaining strong client satisfaction.</li>\n<li style=\"\"><strong>Tech-Savvy</strong>: Comfortable with tools like Google Suite, Slack, Teamwork, and Excel.</li>\n<li style=\"\"><strong>Flexible Availability</strong>: Work within North/South American or EU time zones for seamless communication.</li>\n</ul>\n<p><strong>Your Perks: What's in it for you<br></strong></p>\n<ul style=\"\">\n<li style=\"\">Working completely remote</li>\n<li style=\"\">Location independence</li>\n<li style=\"\">15 paid leave days</li>\n<li style=\"\">Quarterly bonus</li>\n<li style=\"\">Annual (performance-based) salary increase policy</li>\n<li style=\"\">Great opportunity to grow</li>\n<li style=\"\">Receive the training needed to sharpen your Amazon advertising skills and take your career to new heights.</li>\n<li style=\"\">You’ll be joining a high-level and fast-paced team, working with exciting businesses and projects</li>\n</ul>\n<hr>\n<p><strong>Why Adaptive Teams?</strong><br>At Adaptive Teams, we don’t just fill positions – we create pathways to success. Whether you’re a seasoned pro or just starting out, we’re here to help you grow, innovate, and make an impact. If you’re looking for exciting opportunities and, a team that’s as passionate as you are, this is the place to be.</p>\n<hr>\n<p><strong>What to Expect from Our Application Process?</strong><br>Once you apply, you’ll <strong>receive an email</strong> guiding you through the next steps, including an assessment tailored to the role. <br><br>After that, we’ll ask you a few brief questions about your experiences and work style—this is your opportunity to showcase what makes you unique and how you approach challenges. Be sure to <strong>check your inbox</strong> (and <strong>your spam folder</strong>, just in case) for further instructions.<br><br>We understand <strong>your time is valuable</strong>, so we strive to keep the assessments <strong>under 45 minutes</strong> whenever possible, though some roles may require a slightly longer time investment.<br><br>Once selected, you’ll have the chance to <strong>schedule an interview</strong> with our team. We aim to make the process as smooth and transparent as possible, so you’ll always know where you stand.</p>\n<img src=\"https://remotive.com/job/track/1965450/blank.gif?source=public_api\" alt=\"\"/>","tags":"[\"amazon\",\"excel\",\"advertising\",\"PPC\",\"google suite\"]","pubDate":"2025-01-22T07:50:50.000Z","link":"https://remotive.com/remote-jobs/customer-support/client-communications-coordinator-1965450","slug":"client-communications-coordinator-adaptive-teams-693"},{"id":8919284539,"title":"Middle QA Automation Engineer","company":"Gr8tech","image":"https://remotive.com/job/1964038/logo","description":"<div class='\"content-intro\"'><p><strong>GR8 Tech is a global product company that provides innovative, scalable platforms and business solutions for the iGaming industry.</strong></p>\n<p>We have а great experience: GR8 Tech platform successfully handles millions of active players and offers best practices to develop and grow in the gambling industry. We are here to provide great gaming tech to satisfy even greater ambition!</p>\n<p>We develop complete tech coverage for gambling businesses worldwide, including iGaming platform solutions, consulting, integration, and long-lasting operation services.</p>\n<p><strong>We are driven by our ambition to make a great product with great people! Together we move the world of iGaming forward — join!</strong></p></div><div class=\"h2\"><strong>About your key responsibilities and impact:</strong></div>\n<ul style=\"\">\n<li style=\"\">Analyzing and documenting features of the product and business requirements;</li>\n<li style=\"\">Working in a cross-functional team to guarantee the quality of developed systems;</li>\n<li style=\"\">Taking part in continuous improvements of QA processes in the team;</li>\n<li style=\"\">Developing, maintaining and executing automation tests of all levels;</li>\n<li style=\"\">Developing and maintaining automation frameworks;</li>\n<li style=\"\">Taking part in release preparations (planning, re-testing, regression testing, post-deploy support);</li>\n<li style=\"\">Collaborating with other teams;</li>\n<li style=\"\">Being an active member of the team, suggesting improvements of the processes to increase the quality of the product and performance of the team;</li>\n<li style=\"\">Rooting causes analysis of failed tests and report issues to take corrective actions.</li>\n</ul>\n<div class=\"h2\"><strong>Essential professional experience:</strong></div>\n<ul style=\"\">\n<li style=\"\"><strong>2+ years of experience</strong> in test automation using Java;</li>\n<li style=\"\">Strong knowledge of <strong>Java 11+, JavaScript/TypeScript, Playwright, Appium, and JUnit;</strong></li>\n<li style=\"\">Proficiency in Docker containerization, including Docker Compose;</li>\n<li style=\"\">Hands-on experience in test automation for web and native iOS/Android applications;</li>\n<li style=\"\">Skilled in setting up jobs and pipelines in GitLab or other CI tools;</li>\n<li style=\"\">Good understanding of microservices architecture and concepts;</li>\n<li style=\"\">Experience in backend application testing;</li>\n<li style=\"\">Expertise in integration testing;</li>\n<li style=\"\">Strong communication and investigative skills;</li>\n<li style=\"\">At least an Intermediate level of English;</li>\n</ul>\n<div class=\"h2\"><strong>Desirable skills and personal features:</strong></div>\n<ul style=\"\">\n<li style=\"\">Experience with AWS services (e.g., EC2, S3);</li>\n<li style=\"\">Experience with Rancher;</li>\n<li style=\"\">Experience with performance testing.</li>\n</ul><div class='\"content-conclusion\"'><p> </p>\n<div class=\"h2\"><strong>What we offer:</strong></div>\n<p><strong>Benefits Cafeteria:</strong></p>\n<ul style=\"\">\n<li style=\"\">Sports compensation;</li>\n<li style=\"\">Medical coverage;</li>\n<li style=\"\">Psychological support;</li>\n<li style=\"\">Home-office coverage.</li>\n</ul>\n<p><strong>Work-life:</strong></p>\n<ul style=\"\">\n<li style=\"\">Remote work, Coworking compensation;</li>\n<li style=\"\">Childcare budget;</li>\n<li style=\"\">Maternity leave;</li>\n<li style=\"\">Paternity leave;</li>\n<li style=\"\">Additional 2 days for family events.</li>\n</ul>\n<p><strong>Our GR8 Culture:</strong></p>\n<ul style=\"\">\n<li style=\"\">Open feedback and transparent direct communications;</li>\n<li style=\"\">Growth and development: better every day;</li>\n<li style=\"\">High tolerance to experiment and mistakes;</li>\n<li style=\"\">Supportive friendly environment.</li>\n</ul>\n<p> </p>\n<p> </p>\n<p>Data Protection Information regarding the processing of your personal data in connection with the recruitment and selection process can be found in the Candidate Privacy Notice at <a class='\"c-link\"' href=\"%22https://gr8.tech/candidate-privacy-notice/%22\" rel=\"nofollow\" target='\"_blank\"'>https://gr8.tech/candidate-privacy-notice/</a>.</p></div><img src=\"https://remotive.com/job/track/1964038/blank.gif?source=public_api\" alt=\"\"/>","tags":"[\"java\",\"javascript\",\"appium\"]","pubDate":"2025-01-21T21:51:23.000Z","link":"https://remotive.com/remote-jobs/qa/middle-qa-automation-engineer-1964038","slug":"middle-qa-automation-engineer-gr8tech-8437"},{"id":4655777376,"title":"Senior DevOps Engineer","company":"Gr8tech","image":"https://remotive.com/job/1965258/logo","description":"<div class='\"content-intro\"'><p><strong>GR8 Tech is a global product company that provides innovative, scalable platforms and business solutions for the iGaming industry.</strong></p>\n<p>We have а great experience: GR8 Tech platform successfully handles millions of active players and offers best practices to develop and grow in the gambling industry. We are here to provide great gaming tech to satisfy even greater ambition!</p>\n<p>We develop complete tech coverage for gambling businesses worldwide, including iGaming platform solutions, consulting, integration, and long-lasting operation services.</p>\n<p><strong>We are driven by our ambition to make a great product with great people! Together we move the world of iGaming forward — join!</strong></p></div><div class=\"h2\"><strong>About your key responsibilities and impact:</strong></div>\n<ul style=\"\">\n<li style=\"\">Leading the design and maintenance of high-load and high-availability infrastructure within Cloud;</li>\n<li style=\"\">Conducting in-depth analysis of service infrastructure needs and justifying proposed solutions;</li>\n<li style=\"\">Designing and implementing Infrastructure as Code;</li>\n<li style=\"\">Implementing, maintaining, and enhancing performance monitoring systems;</li>\n<li style=\"\">Optimizing performance through advanced autoscaling and other optimization strategies;</li>\n<li style=\"\">Writing, updating, and optimizing scripts for automation and infrastructure management;</li>\n<li style=\"\">Maintaining Kubernetes clusters to ensure high availability and reliability;</li>\n<li style=\"\">Collaborating with cross-functional teams for smooth deployment and operation of applications;</li>\n<li style=\"\">Handling complex ad-hoc project tasks based on business needs.</li>\n</ul>\n<div class=\"h2\"><strong>Essential professional experience:</strong></div>\n<ul style=\"\">\n<li style=\"\">A minimum of 5 years of experience in a similar senior engineering role, with a strong track record of leadership, advanced technical skills, and successful project delivery;</li>\n<li style=\"\">Proficiency in AWS cloud infrastructure and services (EC2, VPC, EKS, RDS, S3, CloudWatch, SNS, CloudTrail, etc.); </li>\n<li style=\"\">Proficiency in Terraform for Infrastructure as Code (IaC); </li>\n<li style=\"\">Proficiency in Ansible for configuration management; </li>\n<li style=\"\">Strong knowledge of Kubernetes and containerization technologies;</li>\n<li style=\"\">Proficiency in Sql and NoSql: Cassandra, Scylla, Redis, Neo4j, PostgreSQL, MySQL;</li>\n<li style=\"\">Proficiency in Bash scripting, Python languages; </li>\n<li style=\"\">Strong understanding of monitoring and observability tools, such as Victoriametrics, Prometheus, Grafana, and ELK stack; </li>\n<li style=\"\">Knowledge of version control systems like Git for code management;</li>\n<li style=\"\">Strong knowledge of best practices of scalable applications cloud architecture: partitioning, scaling, clustering, load balancing; </li>\n<li style=\"\">Desirable skills and personal features: Ability to work collaboratively in a team environment and communicate effectively; </li>\n<li style=\"\">Strong problem-solving skills and attention to detail; </li>\n<li style=\"\">Experience with agile development methodologies;</li>\n<li style=\"\">At least Intermediate+ English level.</li>\n</ul><div class='\"content-conclusion\"'><p> </p>\n<div class=\"h2\"><strong>What we offer:</strong></div>\n<p><strong>Benefits Cafeteria:</strong></p>\n<ul style=\"\">\n<li style=\"\">Sports compensation;</li>\n<li style=\"\">Medical coverage;</li>\n<li style=\"\">Psychological support;</li>\n<li style=\"\">Home-office coverage.</li>\n</ul>\n<p><strong>Work-life:</strong></p>\n<ul style=\"\">\n<li style=\"\">Remote work, Coworking compensation;</li>\n<li style=\"\">Childcare budget;</li>\n<li style=\"\">Maternity leave;</li>\n<li style=\"\">Paternity leave;</li>\n<li style=\"\">Additional 2 days for family events.</li>\n</ul>\n<p><strong>Our GR8 Culture:</strong></p>\n<ul style=\"\">\n<li style=\"\">Open feedback and transparent direct communications;</li>\n<li style=\"\">Growth and development: better every day;</li>\n<li style=\"\">High tolerance to experiment and mistakes;</li>\n<li style=\"\">Supportive friendly environment.</li>\n</ul>\n<p> </p>\n<p> </p>\n<p>Data Protection Information regarding the processing of your personal data in connection with the recruitment and selection process can be found in the Candidate Privacy Notice at <a class='\"c-link\"' href=\"%22https://gr8.tech/candidate-privacy-notice/%22\" rel=\"nofollow\" target='\"_blank\"'>https://gr8.tech/candidate-privacy-notice/</a>.</p></div><img src=\"https://remotive.com/job/track/1965258/blank.gif?source=public_api\" alt=\"\"/>","tags":"[\"kubernetes\",\"python\",\"terraform\"]","pubDate":"2025-01-21T15:50:32.000Z","link":"https://remotive.com/remote-jobs/devops/senior-devops-engineer-1965258","slug":"senior-devops-engineer-gr8tech-1449"},{"id":9125644474,"title":"Administrative & Team Culture Specialist","company":"Wikimedia","image":"https://remotive.com/job/1965016/logo","description":"<p><strong>ADMINISTRATIVE &amp; TEAM CULTURE SPECIALIST, PRODUCT &amp; TECHNOLOGY DEPARTMENT</strong></p>\n<p><strong>Summary</strong></p>\n<p>The Administrative &amp; Team Culture Specialist - Product &amp; Technology Department will support the Wikimedia Foundation Product &amp; Technology Department in facilitating and fostering a connected team culture, ensuring that intra- and extra- department communications are clear and aligned and providing the Chief Product &amp; Technology Officer and Product &amp; Technology Vice Presidents with daily administrative support.  </p>\n<p>Reporting to the Chief Product &amp; Technology Officer (CPTO), you will be responsible for managing the calendar of the CPTO and two VPs, working with others within the organization to manage complex calendaring requests across many time zones. Additionally, this role will be responsible for coordinating and leading the weekly Office of CPTO meeting, note-taking and supporting special projects. You will also lead our department culture-building; designing impactful virtual and in-person activities that are thoughtfully coordinated and executed within budget. Last, this role will provide foundational communication support needed to increase collaboration and transparency within the P&amp;T Department and between P&amp;T Department staff and other WMF staff.  On average, this role will require travel 2-4 times per year.</p>\n<p><strong>You are responsible for:</strong></p>\n<ul style=\"\">\n<li style=\"\">Provide the Chief Product &amp; Technology Officer with regular administrative support, including calendaring and expense management</li>\n<li style=\"\">Provide two (2) Vice Presidents with calendar management </li>\n<li style=\"\">Develop agendas for all-department meetings and create and disseminate all-department communications</li>\n<li style=\"\">Partner with the internal Admin team for scheduling logistics related to cross-team projects and department gatherings</li>\n<li style=\"\">Coordinate venue, location and activity planning for team and department events</li>\n<li style=\"\">Understanding procurement and contract processes, including but not limited to booking event speakers</li>\n</ul>\n<p><strong>Skills and Experience:</strong></p>\n<ul style=\"\">\n<li style=\"\">Deep attention to detail and a commitment to accuracy</li>\n<li style=\"\">Experience consistently producing high-quality work, managing multiple tasks, and executing under deadlines, occasionally during high-pressure situations</li>\n<li style=\"\">Proven track record of handling confidential/sensitive information with grace and care</li>\n<li style=\"\">Demonstrated ability to work independently and as part of a team</li>\n<li style=\"\">Experience in managing projects using Asana or similar project management and progress tracking tools</li>\n<li style=\"\">Experience creating clear and realistic timelines, tracking progress and helping others stick to deadlines, always considering the dynamic and flexibility of the process</li>\n<li style=\"\">Understanding of best practices for cultural inclusivity to ensure culture-building activities reflects multiple perspectives</li>\n<li style=\"\">Ability to establish clear metrics for participation and engagement across multiple teams</li>\n<li style=\"\">Ability to craft strategic and creative messages, with experience in writing compelling emails, Slack messages and newsletters</li>\n<li style=\"\">Ability to edit a range of voices and styles for diverse audience</li>\n</ul>\n<p><strong>Additionally, we’d love it if you have:</strong></p>\n<ul style=\"\">\n<li style=\"\">Experience working with organizations both inside and outside the U.S.</li>\n<li style=\"\">Experience working in the non-profit sector and/or a tech-focused organization</li>\n<li style=\"\">Interest in learning more about the different aspects of product and engineering work</li>\n<li style=\"\">Enthusiastic about finding ways to add culture-building and connection opportunities and/or creative touches to your work</li>\n<li style=\"\">General understanding of the existing landscape of the Wikimedia movement</li>\n<li style=\"\">Passion for our mission to share free knowledge with the world</li>\n</ul>\n<div class=\"h4\">About the Wikimedia Foundation</div>\n<p>The Wikimedia Foundation is the nonprofit organization that operates Wikipedia and the other Wikimedia free knowledge projects. Our vision is a world in which every single human can freely share in the sum of all knowledge. We believe that everyone has the potential to contribute something to our shared knowledge, and that everyone should be able to access that knowledge freely. We host Wikipedia and the Wikimedia projects, build software experiences for reading, contributing, and sharing Wikimedia content, support the volunteer communities and partners who make Wikimedia possible, and advocate for policies that enable Wikimedia and free knowledge to thrive. </p>\n<p>The Wikimedia Foundation is a charitable, not-for-profit organization that relies on donations. We receive donations from millions of individuals around the world, with an average donation of about $15. We also receive donations through institutional grants and gifts. The Wikimedia Foundation is a United States 501(c)(3) tax-exempt organization with offices in San Francisco, California, USA.</p>\n<p><em><strong>As an equal opportunity employer, the Wikimedia Foundation values having a diverse workforce and continuously strives to maintain an inclusive and equitable workplace. We encourage people with a diverse range of backgrounds to apply. We do not discriminate against any person based upon their race, traits historically associated with race, religion, color, national origin, sex, pregnancy or related medical conditions, parental status, sexual orientation, gender identity, gender expression, age, status as a protected veteran, status as an individual with a disability, genetic information, or any other legally protected characteristics.</strong></em></p>\n<p>The Wikimedia Foundation is a remote-first organization with staff members including contractors based 40+ countries<strong>*</strong>. Salaries at the Wikimedia Foundation are set in a way that is competitive, equitable, and consistent with our values and culture. The anticipated annual pay range of this position for applicants based within the United States is US$75,893 to US$99,172 with multiple individualized factors, including cost of living in the location, being the determinants of the offered pay. For applicants located outside of the US, the pay range will be adjusted to the country of hire. We neither ask for nor take into consideration the salary history of applicants. The compensation for a successful applicant will be based on their skills, experience and location. </p>\n<p><strong>*Please note that we are currently able to hire in the following countries: </strong>Australia, Austria, Bangladesh, Belgium, Brazil, Canada, Colombia, Costa Rica, Croatia, Czech Republic, Denmark, Egypt, Estonia, Finland, France, Germany, Ghana, Greece, India, Indonesia, Ireland, Israel, Italy, Kenya, Mexico, Netherlands, Nigeria, Peru, Poland, Singapore, South Africa, Spain, Sweden, Switzerland, Uganda, United Arab Emirates, United Kingdom, United States of America and Uruguay.  Our non-US employees are hired through a local third party Employer of Record (EOR). </p>\n<p>We periodically review this list to streamline to ensure alignment with our hiring requirements. </p>\n<p>All applicants can reach out to their recruiter to understand more about the specific pay range for their location during the interview process.</p>\n<p><em><strong>If you are a qualified applicant requiring assistance or an accommodation to complete any step of the application process due to a disability, you may contact us at recruiting@wikimedia.org or +1 (415) 839-6885.</strong></em></p>\n<p><strong>More information</strong></p>\n<p><a href=\"%22https:/wikimediafoundation.org/about/jobs/#section-12%22\" rel=\"nofollow\"><strong>U.S. Benefits &amp; Perks</strong></a></p>\n<p><a href=\"%22https:/foundation.wikimedia.org/wiki/Applicant_privacy_policy%22\" rel=\"nofollow\"><strong>Applicant Privacy Policy</strong></a></p>\n<p><a href=\"%22https:/wikimediafoundation.org/%22\" rel=\"nofollow\"><strong>Wikimedia Foundation</strong></a></p>\n<p><a href=\"%22https:/www.youtube.com/watch?v=8mvPYF_erNA&amp;list=PLVx9pX-VnGVh9Akb-O-SAKZ-GDTVTHZqS&amp;index=8%22\" rel=\"nofollow\"><strong>What does the Wikimedia Foundation do?</strong></a></p>\n<p><a href=\"%22https:/www.youtube.com/watch?v=7gATwhhGrPk&amp;list=PLVx9pX-VnGVh9Akb-O-SAKZ-GDTVTHZqS&amp;index=1%22\" rel=\"nofollow\"><strong>What makes Wikipedia different from social media platforms?</strong></a></p>\n<p><a href=\"%22https:/wikimediafoundation.org/wiki/Our_projects%22\" rel=\"nofollow\"><strong>Our Projects</strong></a></p>\n<p><a href=\"%22https:/techblog.wikimedia.org/%22\" rel=\"nofollow\"><strong>Our Tech Stack</strong></a></p>\n<p><a href=\"%22https:/wikimediafoundation.org/news/%22\" rel=\"nofollow\"><strong>News from across the Wikimedia movement</strong></a></p>\n<p><a href=\"%22https:/diff.wikimedia.org/%22\" rel=\"nofollow\"><strong>Wikimedia Blog</strong></a></p>\n<p><a href=\"%22https:/meta.wikimedia.org/wiki/Strategy/Wikimedia_movement/2017%22\" rel=\"nofollow\"><strong>Wikimedia 2030</strong></a></p>\n<p> </p>\n<div id='\"l-content\"'> </div>\n<img src=\"https://remotive.com/job/track/1965016/blank.gif?source=public_api\" alt=\"\"/>","tags":"[\"admin\",\"social media\",\"project management\",\"asana\",\"nonprofit\",\"travel\"]","pubDate":"2025-01-21T09:51:15.000Z","link":"https://remotive.com/remote-jobs/all-others/administrative-team-culture-specialist-1965016","slug":"administrative-team-culture-specialist-wikimedia-8396"},{"id":8244364770,"title":"Head of Community","company":"Owner","image":"https://avatars.githubusercontent.com/u/87661266?s=200&v=4","description":"<div><span style=\"font-size: 13pt\">👋 </span><b style=\"font-size: 13pt;\">About </b><b><a style=\"font-size: 13pt;\" href=\"http://owner.com/\">Owner.com</a></b></div><div><br></div><div><span style=\"font-size: 11pt;\">Owner is the all-in-one platform that restaurants use to succeed online.&nbsp;</span></div><div><br></div><div><span style=\"font-size: 11pt;\">Thousands of restaurant owners use our tools to build their website, drive online orders, create their own branded app, manage their customer relationships, and set up marketing automations.&nbsp;</span></div><div><br></div><div><span style=\"font-size: 14.6667px;\">You can think of it as Shopify meets HubSpot, but specifically for restaurants.&nbsp;</span></div><div><br></div><div><span style=\"font-size: 11pt;\">Learn more about the problems we are solving for our customers </span><a style=\"font-size: 11pt;\" href=\"https://www.owner.com/our-story\">here</a><span style=\"font-size: 11pt;\">.&nbsp;</span></div><div><br></div><div><span style=\"font-size: 13pt\">🌎</span><b style=\"font-size: 13pt;\"> Our vision</b></div><div><br></div><div><span style=\"font-size: 11pt;\">We’re starting by helping independent restaurants succeed online.</span></div><div><br></div><div><span style=\"font-size: 11pt;\">But it’s not just restaurants that need our help. All local service-based businesses are struggling with these same problems. Huge technology corporations are taking their customers, bleeding their profits, and making it hard for them to survive.</span></div><div><br></div><div><span style=\"font-size: 11pt;\">So, once we nail the solution for restaurants&nbsp;–&nbsp;we’ll scale it into every other local business type.</span></div><div><br></div><div><span style=\"font-size: 11pt;\">In the future we envision, we’ll build the technology that tens of millions of local business owners need to succeed in the digital age.</span></div><div><br></div><div><br></div><div><span style=\"font-size: 13pt\">🚀 </span><b style=\"font-size: 13pt;\">Our traction</b></div><div><br></div><div><span style=\"font-size: 11pt;\">In just over 3 years we've generated </span><span style=\"font-size: 15px;\">tens of millions in revenue, served millions of guests, and have processed hundreds of millions of orders.</span></div><div><br></div><div><span style=\"font-size: 11pt;\">More importantly, we’ve helped thousands of restaurant owners save their businesses - and not&nbsp; only survive, but thrive.</span></div><div><br></div><div><br></div><div><span style=\"font-size: 13pt\">⭐ </span><b style=\"font-size: 13pt;\">Our team</b></div><div><br></div><div><span style=\"font-size: 15px;\">Our team grew from 90 people to over 150 people in 2024. We’ve got top talent from the most successful companies in SMB software like Shopify, HubSpot, DoorDash, Procore and ServiceTitan. We’ll be scaling even faster in 2025 to keep pace with our customer growth.</span></div><div><br></div><div>How we work: Owner is a remote-first, global company with a home base in San Francisco. For some of our creative teams we prioritize in-person collaboration at our SF HQ. The rest of our employees are distributed throughout the world.</div><div><br></div><div><span style=\"font-size: 1em;\">🫵 </span><b>Why we’re looking for you</b></div><div>We’re building a movement of ambitious restaurant owners. We’ve started with our content on social media, which has gotten a great reception, and our audience has told us that they want to connect more and more with each other. As our head of community, you’ll lead our efforts for building relationships within our audience. We’re looking for a marketer who is coming from a restaurant leadership or restaurant management background.</div><div><br></div><div>This role is 100% remote and can be based anywhere in the United States.</div><div><span style=\"font-size: 1em;\">🫵 </span><b>Why we’re looking for you</b></div><div>We’re building a movement of ambitious restaurant owners. We’ve started with our content on social media, which has gotten a great reception, and our audience has told us that they want to connect more and more with each other. As our head of community, you’ll lead our efforts for building relationships within our audience. We’re looking for a marketer who is coming from a restaurant leadership or restaurant management background.</div><div><br></div><div>This role is 100% remote and can be based anywhere in the United States.</div><h3>💻 The impact you will have</h3><li>Build and foster the best community in the industry of like-minded, ambitious restaurant owners by creating opportunities for connection, collaboration and shared learning.</li><li>Act as a critical bridge between Owner and its audience of restaurant owners, providing feedback that influences product development and marketing strategies.</li><li>Empower restaurant owners with educational content and resources, positioning the community as a go-to destination for growth, learning and inspiration.</li><li>Lead the charge in hosting engaging events — both virtual and in-person that boost brand recognition and encourage meaningful customer interactions.</li><li>Drive tangible outcomes around customer retention, increased feature adoption and sales efficiency.</li><li>Develop and execute strategies to increase audience engagement through webinars, community initiatives and customer education.</li><h3>👥 Who you’ll work with</h3><li>CEO</li><li>VP of Marketing</li><li>Director of Content Marketing</li><h3>✅ Minimum requirements</h3><li>Restaurant leadership or management experience. Restaurant owners should look at you as a peer, or someone to learn from.</li><li>Social media / content marketing background. A big part of this role is creating content. You’ll be running webinars and capturing moments from offline events that you lead.</li><li>You’re okay with lots of travel. Since restaurant owners are very IRL, we want to meet them where they are, and so you should expect to be on the road on a monthly basis.</li><li>Strong understanding of restaurant operations to be able to share best practices and competitive insights with customers.</li><h3>🏆 Pay and benefits</h3><li>The estimated starting base salary range for this role is $130,000 - $150,000 USD, plus a generous equity pre-IPO equity package</li><li>Other benefits include comprehensive health coverage, work from anywhere, unlimited PTO - plus extra fun perks!</li><div><br></div><div><b><span style=\"font-size: 10px\">🚩 Notice - Employment Scams</span></b></div><div><span style=\"font-size: 10px\">Please note that any communication from our hiring team regarding job opportunities will only be made by an Owner employee with an @owner.com email address.</span></div><div><br></div><div><span style=\"font-size: 10px\">We will never ask you to provide personal or financial information, including but not limited to: your social security number, credit card numbers, passport information and other related banking information.&nbsp;If you believe you are being contacted by scammer, please mark the communication as \"phishing\" or “spam” and do not respond.</span></div><div><span style=\"font-size: 13pt\">👋 </span><b style=\"font-size: 13pt;\">About </b><b><a href=\"http://owner.com/\" style=\"font-size: 13pt;\">Owner.com</a></b></div><div><br></div><div><span style=\"font-size: 11pt;\">Owner is the all-in-one platform that restaurants use to succeed online.&nbsp;</span></div><div><br></div><div><span style=\"font-size: 11pt;\">Thousands of restaurant owners use our tools to build their website, drive online orders, create their own branded app, manage their customer relationships, and set up marketing automations.&nbsp;</span></div><div><br></div><div><span style=\"font-size: 14.6667px;\">You can think of it as Shopify meets HubSpot, but specifically for restaurants.&nbsp;</span></div><div><br></div><div><span style=\"font-size: 11pt;\">Learn more about the problems we are solving for our customers </span><a href=\"https://www.owner.com/our-story\" style=\"font-size: 11pt;\">here</a><span style=\"font-size: 11pt;\">.&nbsp;</span></div><div><br></div><div><span style=\"font-size: 13pt\">🌎</span><b style=\"font-size: 13pt;\"> Our vision</b></div><div><br></div><div><span style=\"font-size: 11pt;\">We’re starting by helping independent restaurants succeed online.</span></div><div><br></div><div><span style=\"font-size: 11pt;\">But it’s not just restaurants that need our help. All local service-based businesses are struggling with these same problems. Huge technology corporations are taking their customers, bleeding their profits, and making it hard for them to survive.</span></div><div><br></div><div><span style=\"font-size: 11pt;\">So, once we nail the solution for restaurants&nbsp;–&nbsp;we’ll scale it into every other local business type.</span></div><div><br></div><div><span style=\"font-size: 11pt;\">In the future we envision, we’ll build the technology that tens of millions of local business owners need to succeed in the digital age.</span></div><div><br></div><div><br></div><div><span style=\"font-size: 13pt\">🚀 </span><b style=\"font-size: 13pt;\">Our traction</b></div><div><br></div><div><span style=\"font-size: 11pt;\">In just over 3 years we've generated </span><span style=\"font-size: 15px;\">tens of millions in revenue, served millions of guests, and have processed hundreds of millions of orders.</span></div><div><br></div><div><span style=\"font-size: 11pt;\">More importantly, we’ve helped thousands of restaurant owners save their businesses - and not&nbsp; only survive, but thrive.</span></div><div><br></div><div><br></div><div><span style=\"font-size: 13pt\">⭐ </span><b style=\"font-size: 13pt;\">Our team</b></div><div><br></div><div><span style=\"font-size: 15px;\">Our team grew from 90 people to over 150 people in 2024. We’ve got top talent from the most successful companies in SMB software like Shopify, HubSpot, DoorDash, Procore and ServiceTitan. We’ll be scaling even faster in 2025 to keep pace with our customer growth.</span></div><div><br></div><div>How we work: Owner is a remote-first, global company with a home base in San Francisco. For some of our creative teams we prioritize in-person collaboration at our SF HQ. The rest of our employees are distributed throughout the world.</div>","tags":"[\"management\"]","pubDate":"2025-01-21T01:27:16.259Z","link":"https://jobs.lever.co/owner/38b1deb7-07c9-492e-a2ea-3c49fe80deb3","slug":"head-of-community-owner-331"}]