[{"id":9062713584,"title":"Product Manager","company":"SafetyWing","image":"https://pbs.twimg.com/profile_images/1177267684574208000/54eG3WmW_400x400.jpg","description":"<h2>🧘 What we offer</h2> <div><!--block-->We operate in a fully remote work environment – work from anywhere globally.&nbsp;<br><br>You will receive salary and equity compensation, premium health insurance that works in most countries worldwide, travel insurance, a laptop, an office stipend, a minimum of four weeks of vacation per year, and a personal development budget.</div><div><!--block--><br>We also have fantastic annual team gatherings. The previous ones were in Ljubljana, San Francisco, Mexico, Bali, and Siglufjörður.</div><div><!--block--><br>We are looking forward to hearing from you!</div> <div><!--block--><a href=\"https://safetywing.com\"><strong>SafetyWing</strong></a> (YC W18) is seeking an ambitious and creative <strong>Product Manager</strong> to help make our product something our customers love so much that they’ll tell their friends about it.</div><div><!--block--><br>We are on a mission to remove the role of geographical borders as a barrier to equal opportunities and freedom for everyone. We are doing that by creating simple health, insurance, and retirement products for remote workers worldwide as a replacement for national welfare systems.</div> <h2>💻 What you can help with:</h2>  <ul><li><!--block-->End-to-end product management, taking the first seeds of an idea and carrying it through to implementation and optimization.</li><li><!--block-->Executing a product vision and strategy to enhance our Remote Health B2B product, targeting startups</li><li><!--block-->Talking to users and translating their desirers, suggestions and pain points into products and features</li><li><!--block-->Leading a cross-functional team of engineers and designers, and managing stakeholders such as legal and compliance</li><li><!--block-->Building operational systems and automations as your team scales and grows</li><li><!--block-->Inspiring people across the company to believe in the impact of you and your team’s work</li><li><!--block-->Making quarterly and yearly plans for execution with a variety of stakeholders involved</li></ul> <h2>🧪 We are looking for someone who:</h2> <ul><li><!--block-->Has great judgement, meaning an intuitive understanding of what makes a product amazing</li><li><!--block-->Can use their own intuition in combination with user feedback to delight new and existing users at every step of the product interaction</li><li><!--block-->Is a strong leader who can guide and motivate a team towards project completion and iterations</li><li><!--block-->Can make well rounded product priorities while weighing product considerations, business needs and available resources</li><li><!--block-->Has extensive professional leadership experience in a product adjacent role. Experience in one or more of the following areas are particularly welcome but not required: founding a company, product management, technical background</li></ul><div><!--block--><strong>😀 We like to work with people who:</strong></div><ul><li><!--block-->Want to help build a global social safety net on the Internet.</li><li><!--block-->Think for themselves instead of copying others.</li><li><!--block-->Are willing to try new things, even with the risk of failure.</li><li><!--block-->Are intellectually curious and open to new ideas.</li><li><!--block-->Are creative and bold in the face of any problems.</li><li><!--block-->Have strong integrity and do the right thing.</li></ul>","tags":"[\"management\",\"b2b\",\"legal\"]","pubDate":"2025-02-12T11:47:23.298Z","link":"https://safetywing.pinpointhq.com/en/jobs/247938","slug":"product-manager-safetywing-5247"},{"id":3874687765,"title":"Junior Account Executive","company":"SafetyWing","image":"https://pbs.twimg.com/profile_images/1177267684574208000/54eG3WmW_400x400.jpg","description":"<h2>🧘 What we offer</h2> <ul><li><!--block-->Fully remote work environment – work from anywhere globally</li><li><!--block-->Competitive compensation in line with global benchmarks</li><li><!--block-->Potential to unlock equity compensation</li><li><!--block-->A minimum of four weeks of vacation per year</li><li><!--block-->Premium health insurance that travels with you</li><li><!--block-->Travel insurance any time you travel outside of your home country</li><li><!--block-->New laptop, home office allowance and more!</li></ul><div><!--block-->🚀 We look forward to hearing from you!</div> <div><!--block-->SafetyWing is looking for a <strong>Junior Account Executive </strong>to join our sales team. Your role will be pivotal in understanding the challenges of remote and distributed teams and our prospective client's unique needs and offering them insights and ideas to leverage our solutions effectively. You will be vital in expanding SafetyWing's impact.</div><div><!--block--><br></div><div><!--block--><strong>🚀 About SafetyWing</strong></div><div><!--block--><br></div><div><!--block-->We’re building a global social safety net for remote workers—simple health, insurance, and retirement products designed to replace national welfare systems. Our mission is to remove geographical borders as a barrier to equal opportunity and freedom for everyone. If we succeed, we believe this will be one of the most important tasks of our time.</div><div><!--block--><br></div><div><!--block-->We’re a fully remote team, stretching across 15+ timezones.</div> <h2>💻 Your responsibilities will include</h2>  <ul><li><!--block-->Getting to the heart of remote and geographically distributed teams' needs through helpful insights and consultative selling.</li><li><!--block-->Navigating the full sales cycle, from discovery and engagement to negotiation and closure.</li><li><!--block-->Using a consultative approach to pinpoint customer needs, crafting value-added propositions, and developing complex proposals.</li><li><!--block-->Guiding our customers to see the optimal value in our solutions, building consensus and enthusiasm.</li><li><!--block-->Proactively finding ways to tackle any deal-related obstacles.</li><li><!--block-->Keeping our CRM updated with the latest client info for top-notch planning and strategy.</li><li><!--block-->Gathering and integrating product feedback from clients to guide product enhancements.</li></ul> <h2>🌩 What you’ll do</h2> <ul><li><!--block-->Engage with interested prospects to help them evaluate our product</li><li><!--block-->Become a product and Remote Health benefits expert&nbsp;</li><li><!--block-->Ideate, test and iterate on new ways to position Remote Health as we go up-market</li><li><!--block-->Creatively problem-solve in a fast paced environment</li><li><!--block-->Work with our Account Management team to ensure a smooth hand-off and beautiful client experience&nbsp;</li><li><!--block-->Accurately forecast pipeline and manage pipeline in CRM</li><li><!--block-->Synthesize product feedback from clients to help inform product improvements</li></ul><div><!--block-->🧪 <strong>Qualifications</strong></div><ul><li><!--block-->2-3 years of sales experience or a background in engaging prospects and supporting sales cycles</li><li><!--block-->Passion for learning the full sales process, from discovery to closed won</li><li><!--block-->Experience in a fast-paced startup environment</li><li><!--block-->Excellent written and verbal skills</li><li><!--block-->Familiarity with CRM tools and the ability to manage pipelines effectively</li></ul><div><!--block-->😀 <strong>We like to work with people who</strong></div><ul><li><!--block-->Want to help build a global social safety net on the Internet</li><li><!--block-->Think for themselves instead of copying others</li><li><!--block-->Are willing to try new things, even with the risk of failure</li><li><!--block-->Are intellectually curious and open to new ideas</li><li><!--block-->Are creative and bold in the face of any problems</li><li><!--block-->Have strong integrity and do the right thing</li></ul>","tags":"[\"management\"]","pubDate":"2025-02-12T11:47:23.298Z","link":"https://safetywing.pinpointhq.com/en/jobs/309289","slug":"junior-account-executive-safetywing-2395"},{"id":8121440510,"title":"Executive Assistant to the CEO","company":"Kit","image":"https://avatars.githubusercontent.com/u/10557747?s=200&v=4","description":"&lt;div class=&quot;content-intro&quot;&gt;&lt;h4&gt;Description&lt;/h4&gt;\n&lt;div&gt;\n&lt;p class=&quot;p1&quot;&gt;Kit is an email-first operating system for creators who mean business. We help creators grow and monetize their audience with ease. For coaches, YouTubers, authors, podcasters, and other creatives, there isn’t a better marketing hub to rely on to grow audiences, automate email marketing, and sell digital products - all within one platform. More importantly, there isn’t a team more committed to helping creators earn a living.&lt;/p&gt;\n&lt;p&gt;We’re on a mission to help creators earn $1 billion using our creator marketing platform. We have always been 100% independent and 100% remote. We are proud to have built a product that our customers love, and we look for people who have enthusiasm and belief in our mission, vision, and values to join our team.&lt;/p&gt;\n&lt;p&gt;The Kit culture is one where emotional intelligence is valued, radical candor is encouraged, and where everyone works together to uphold a set of shared team principles.&lt;/p&gt;\n&lt;hr&gt;\n&lt;p&gt;&amp;nbsp;&lt;/p&gt;\n&lt;/div&gt;&lt;/div&gt;&lt;h4&gt;&lt;strong&gt;The role&amp;nbsp;&lt;/strong&gt;&lt;/h4&gt;\n&lt;p&gt;As the Executive Assistant to the CEO, you will be a strategic partner in ensuring smooth operations, effective communication, and high-impact execution across the company. This role extends far beyond traditional administrative support—you’ll be a force multiplier for the CEO, driving efficiency, maximizing opportunities, and keeping high-priority initiatives moving forward.&lt;/p&gt;\n&lt;p&gt;The CEO is highly ambitious, constantly advancing multiple initiatives at once. We’re looking for someone who thrives in this dynamic environment—someone energized, not intimidated, by a leader who pushes to do all the things. You should be excited by the challenge of keeping up, anticipating needs, and ensuring seamless execution.&lt;/p&gt;\n&lt;p&gt;You’ll report directly to the CEO and collaborate closely with teams across sales, marketing, product, and operations. Given the CEO’s high expectations around turnaround times, follow-ups, and project deadlines, this role often involves moving things across the finish line outside of core working hours.&lt;/p&gt;\n&lt;p&gt;Success in this role requires adaptability, problem-solving, and strategic thinking in a fast-paced, ever-evolving environment. With many competing priorities, the right candidate will embrace AI and automation to enhance systems, optimize workflows, and ensure&amp;nbsp;&lt;em&gt;everything&lt;/em&gt; gets done—efficiently and on time. Additionally, this role includes support with personal tasks, requiring a high level of discretion and trust.&lt;/p&gt;\n&lt;p&gt;If you’re someone who sees complexity as an opportunity, thrives on pace and impact, and is eager to leverage technology to drive execution, we’d love to hear from you.&lt;/p&gt;\n&lt;h4&gt;&lt;strong&gt;The Work:&lt;/strong&gt;&lt;/h4&gt;\n&lt;p&gt;As the Executive Assistant to the CEO, you will:&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;Manage high-priority projects by conducting research, preparing compelling pitches, and securing executive buy-in.&lt;/li&gt;\n&lt;li&gt;Own the CEO’s email, calendar, and priorities, ensuring fast follow-up on sales leads, investor inquiries, and strategic partnerships.&lt;/li&gt;\n&lt;li&gt;Develop and maintain systems for organization, outreach, and follow-up, maximizing opportunities from the CEO’s inbox and social media channels.&lt;/li&gt;\n&lt;li&gt;Support executive collaboration by prepping board updates, pulling relevant data, and proactively surfacing key conversations.&lt;/li&gt;\n&lt;li&gt;Proactively engage with key contacts, partners, and opportunities to keep the CEO ahead of critical relationships and initiatives.&lt;/li&gt;\n&lt;li&gt;Create content that aligns with Kit’s brand guidelines, working with Kit’s marketing leaders to support the CEO’s external presence.&lt;/li&gt;\n&lt;li&gt;Use AI and automation tools to optimize workflows, improving efficiency and freeing up time for strategic work.&lt;/li&gt;\n&lt;li&gt;Balance short-term tactical execution with long-term strategic planning, ensuring the CEO’s focus remains on high-impact priorities.&lt;/li&gt;\n&lt;li&gt;Act as a gatekeeper and problem solver, anticipating challenges and removing roadblocks before they escalate.&lt;/li&gt;\n&lt;li&gt;Travel with the CEO to events to optimize his time and enhance engagement with customers and potential partners.&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;&lt;strong&gt;The Skills:&lt;/strong&gt;&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;Experience in high-intensity, fast-paced environments—for example, investment banking, management consulting, Hollywood talent agencies, or supporting a high-profile executive. This role is 60+ hours per week and very challenging.&lt;/li&gt;\n&lt;li&gt;Exceptional organizational skills—you thrive on managing complexity, keeping everything running smoothly behind the scenes.&lt;/li&gt;\n&lt;li&gt;AI-savvy—you leverage AI tools to automate and streamline workflows.&lt;/li&gt;\n&lt;li&gt;Strong written and verbal communication—you can distill complex information into clear, concise updates for executives and stakeholders.&lt;/li&gt;\n&lt;li&gt;Proactive and resourceful—you don’t wait for direction; you anticipate needs, identify opportunities, and take action.&lt;/li&gt;\n&lt;li&gt;Strong decision-making skills—you can prioritize effectively, balancing urgent tasks with long-term strategy.&lt;/li&gt;\n&lt;li&gt;Growth mindset and adaptability—you’re comfortable operating in a rapidly changing environment and enjoy finding creative solutions.&lt;/li&gt;\n&lt;li&gt;Integrity and discretion—you handle confidential information with the utmost professionalism.&lt;/li&gt;\n&lt;li&gt;Tech fluency—proficiency in or ability to quickly learn tools like Google Workspace, Notion, Slack, and CRM systems.&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;This role is for someone world-class—someone who thrives in a fast-moving environment, has an exceptional ability to problem-solve and execute, and is eager to be a key force behind the CEO’s success.&lt;/p&gt;\n&lt;h4&gt;&lt;strong&gt;Benefits Section&lt;/strong&gt;&amp;nbsp;&lt;/h4&gt;\n&lt;p&gt;Kit has standardized salaries based on position, no matter where you live. For this role, we’re hiring at Level 4 ($137,000) or Level 5 ($160,000). Level is determined based on experience and our interview process.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Perks + benefits include:&lt;/strong&gt;&lt;/p&gt;\n&lt;ul&gt;\n&lt;li data-stringify-indent=&quot;0&quot; data-stringify-border=&quot;0&quot;&gt;\n&lt;div&gt;&lt;a class=&quot;c-link&quot; href=&quot;https://www.linkedin.com/posts/nathanbarry_convertkit-compensation-model-activity-6991414959247147008-i9V3/?utm_source=share&amp;amp;utm_medium=member_desktop&quot; target=&quot;_blank&quot; data-stringify-link=&quot;https://www.linkedin.com/posts/nathanbarry_convertkit-compensation-model-activity-6991414959247147008-i9V3/?utm_source=share&amp;amp;utm_medium=member_desktop&quot; data-sk=&quot;tooltip_parent&quot;&gt;Profit Sharing&lt;/a&gt;&lt;/div&gt;\n&lt;/li&gt;\n&lt;li data-stringify-indent=&quot;0&quot; data-stringify-border=&quot;0&quot;&gt;Kit equity&lt;/li&gt;\n&lt;li data-stringify-indent=&quot;0&quot; data-stringify-border=&quot;0&quot;&gt;401k with a 5% match&lt;/li&gt;\n&lt;li data-stringify-indent=&quot;0&quot; data-stringify-border=&quot;0&quot;&gt;Monthly medical benefits up to $1,950 a month toward premiums. Dental and vision premiums covered 100%&lt;/li&gt;\n&lt;li data-stringify-indent=&quot;0&quot; data-stringify-border=&quot;0&quot;&gt;$4,000 equipment allowance for your first two years, $3,000 budget every following two years&lt;/li&gt;\n&lt;li data-stringify-indent=&quot;0&quot; data-stringify-border=&quot;0&quot;&gt;Individual learning + development budget ($3,500/year)&lt;/li&gt;\n&lt;li data-stringify-indent=&quot;0&quot; data-stringify-border=&quot;0&quot;&gt;Gender affirming benefits&lt;/li&gt;\n&lt;li data-stringify-indent=&quot;0&quot; data-stringify-border=&quot;0&quot;&gt;Childcare benefit up to $3,000 annually&lt;/li&gt;\n&lt;li data-stringify-indent=&quot;0&quot; data-stringify-border=&quot;0&quot;&gt;Twenty (20) days of paid time off during each year of employment&lt;/li&gt;\n&lt;li data-stringify-indent=&quot;0&quot; data-stringify-border=&quot;0&quot;&gt;Paid paid vacation: An after-tax bonus of $1,000 for taking five consecutive days of vacation where you’re fully unplugged from work&lt;/li&gt;\n&lt;li data-stringify-indent=&quot;0&quot; data-stringify-border=&quot;0&quot;&gt;Ten (10) paid holidays a year&lt;/li&gt;\n&lt;li data-stringify-indent=&quot;0&quot; data-stringify-border=&quot;0&quot;&gt;Two weeks of paid sick time each year, including mental health + well being days&lt;/li&gt;\n&lt;li data-stringify-indent=&quot;0&quot; data-stringify-border=&quot;0&quot;&gt;Twelve (12) weeks paid parental leave and flexible scheduling in your child’s first year&lt;/li&gt;\n&lt;li data-stringify-indent=&quot;0&quot; data-stringify-border=&quot;0&quot;&gt;Up to six weeks of paid bereavement leave, medical leave, and disaster after six months of employment, two weeks of each paid leave in your first six months&lt;/li&gt;\n&lt;li data-stringify-indent=&quot;0&quot; data-stringify-border=&quot;0&quot;&gt;Winter Break Closure: Kit closes for a week at the end of December, giving everyone a collective break to enjoy the holiday season.&amp;nbsp;&lt;em data-stringify-type=&quot;italic&quot;&gt;Essential support services remain available, with teams coordinating to ensure coverage during this period&lt;/em&gt;&lt;/li&gt;\n&lt;li data-stringify-indent=&quot;0&quot; data-stringify-border=&quot;0&quot;&gt;Four-week, paid sabbatical after five years with the team&lt;/li&gt;\n&lt;li&gt;Fantastic in-person or virtual retreats with the team twice a year&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;&amp;nbsp;&lt;/p&gt;\n&lt;h4&gt;&lt;strong&gt;How to Apply&lt;/strong&gt;&lt;/h4&gt;\n&lt;p&gt;We usually receive a large number of applications, and our goal is to follow up with you within two weeks. You’ll hear from us either way. Here’s what you can expect from the rest of our hiring process:&lt;/p&gt;\n&lt;ol&gt;\n&lt;li data-stringify-indent=&quot;0&quot; data-stringify-border=&quot;0&quot;&gt;Recruiter screen (30 min)&lt;/li&gt;\n&lt;li data-stringify-indent=&quot;0&quot; data-stringify-border=&quot;0&quot;&gt;Work sample part 1&lt;/li&gt;\n&lt;li data-stringify-indent=&quot;0&quot; data-stringify-border=&quot;0&quot;&gt;Work sample part 2&lt;/li&gt;\n&lt;li data-stringify-indent=&quot;0&quot; data-stringify-border=&quot;0&quot;&gt;Work sample discussion and technical interview (60 mins)&amp;nbsp;&lt;/li&gt;\n&lt;li data-stringify-indent=&quot;0&quot; data-stringify-border=&quot;0&quot;&gt;Culture contribution interview&lt;/li&gt;\n&lt;li data-stringify-indent=&quot;0&quot; data-stringify-border=&quot;0&quot;&gt;Interview with our CEO (30 mins)&lt;/li&gt;\n&lt;li data-stringify-indent=&quot;0&quot; data-stringify-border=&quot;0&quot;&gt;Interview with our board member&lt;/li&gt;\n&lt;li data-stringify-indent=&quot;0&quot; data-stringify-border=&quot;0&quot;&gt;In person interview in Boise, Idaho&lt;/li&gt;\n&lt;/ol&gt;\n&lt;p&gt;&amp;nbsp;&lt;/p&gt;\n&lt;p&gt;We’ll keep you informed through every step. To get started, complete this application, including a cover letter and answers to the questions on the next page. We read every single application, and your cover letter and responses help put your experience into context.&lt;/p&gt;&lt;div class=&quot;content-conclusion&quot;&gt;&lt;hr&gt;\n&lt;p&gt;&amp;nbsp;&lt;/p&gt;\n&lt;p&gt;Kit is an equal opportunity employer. We value diversity in all of its forms, and we hire the best person we can for each role, no matter your personal background. Research tells us that applicants who are female or non-binary, as well as applicants who are people of color, are less likely to apply for roles they do not feel 100% qualified for. If you think you meet more than 50% of our requirements but fewer than 100% of them, please apply. We’re imperfect communicators, so think of our job postings as the starting point for discussion rather than proof that you shouldn’t apply.&lt;/p&gt;\n&lt;p&gt;Kit does not discriminate on the basis of race, sex, color, religion, age, national origin, marital status, disability, veteran status, genetic information, sexual orientation, gender identity or any other reason prohibited by law in provision of employment opportunities and benefits.&lt;/p&gt;&lt;/div&gt;","tags":"[\"management\"]","pubDate":"2025-02-12T11:22:44.000Z","link":"https://job-boards.greenhouse.io/convertkit/jobs/4649728007","slug":"executive-assistant-to-the-ceo-kit-651"},{"id":8082167413,"title":"Junior Developer (Students) | Ruby Labs","company":"Ruby Labs","image":"https://media.licdn.com/dms/image/v2/D4D0BAQF7VVv61POIFw/company-logo_200_200/company-logo_200_200/0/1721937953426?e=1743033600&v=beta&t=_qAkZ_qGO7Du2NSUdHDNbUKIbz28Y1HDm1g9mwNIOnk","description":"<h1><strong>About us</strong></h1><p style=\"min-height:1.5em\">Ruby Labs is a leading tech company that creates and operates innovative consumer products. We offer a diverse range of opportunities across the health, education, and entertainment industries. Our innovative teams are driving the future of consumer-led products, and we're always looking for passionate individuals to join us. Learn more about our story at: <a target=\"_blank\" rel=\"noopener noreferrer nofollow\" href=\"https://rubylabs.com/about-us/\">https://rubylabs.com/about-us/</a></p><p style=\"min-height:1.5em\"></p><h1><strong>About the role</strong></h1><p style=\"min-height:1.5em\">As a Junior Developer at Ruby Labs, you’ll have the unique opportunity to develop comparison and review websites in collaboration with our experienced developers. This role is designed to give you practical exposure to building high-performing, user-friendly web applications using <strong>Next.js</strong> and related technologies. You’ll work in a supportive environment where your learning and growth are a top priority.</p><p style=\"min-height:1.5em\"></p><h1><strong>Key Responsibilities</strong></h1><ul style=\"min-height:1.5em\"><li><p style=\"min-height:1.5em\">Develop and optimize websites focused on user engagement and performance.</p></li><li><p style=\"min-height:1.5em\">Collaborate with the SEO Manager to integrate SEO best practices into web applications.</p></li><li><p style=\"min-height:1.5em\">Gain hands-on experience with cutting-edge tools and frameworks.</p></li><li><p style=\"min-height:1.5em\">Participate in code reviews and contribute ideas to improve functionality and user experience.</p></li></ul><h1><strong>Qualifications</strong></h1><ul style=\"min-height:1.5em\"><li><p style=\"min-height:1.5em\">Enthusiastic final-year university students with a background in Computer Science, Software Engineering, or a related field.</p></li><li><p style=\"min-height:1.5em\"> experience with <strong>JavaScript</strong> and <strong>Next.js</strong>.</p></li><li><p style=\"min-height:1.5em\">Passion for creating efficient, visually appealing, and user-friendly applications.</p></li><li><p style=\"min-height:1.5em\">Strong problem-solving skills and a collaborative mindset.</p></li></ul><h1><strong>Location</strong></h1><p style=\"min-height:1.5em\">Ruby Labs operates within the CET (Central European Time) zone. Applicants from any country are welcome to apply for the position as long as they are located within approximately ± 4 hours of CET. This ensures optimal collaboration and communication during working hours.</p><p style=\"min-height:1.5em\"></p><h1><strong>Benefits</strong></h1><p style=\"min-height:1.5em\">Discover the perks of being part of our vibrant team! We offer:</p><ul style=\"min-height:1.5em\"><li><p style=\"min-height:1.5em\"><strong>Remote Work Environment:</strong> Embrace the freedom to work from anywhere, anytime, promoting a healthy work-life balance. 🏡⏰</p></li><li><p style=\"min-height:1.5em\"><strong>Unlimited PTO:</strong> Enjoy unlimited paid time off to recharge and prioritize your well-being, without counting days. 🌴💼</p></li><li><p style=\"min-height:1.5em\"><strong>Paid National Holidays:</strong> Celebrate and relax on national holidays with paid time off to unwind and recharge. 🎉🌟</p></li><li><p style=\"min-height:1.5em\"><strong>Company-provided MacBook:</strong> Experience seamless productivity with top-notch Apple MacBooks provided to all employees who need them. 💻🚀</p></li><li><p style=\"min-height:1.5em\"><strong>Flexible Independent Contractor Agreement:</strong> Unlock the benefits of flexibility, autonomy, and entrepreneurial opportunities. Benefit from tax advantages, networking opportunities, reduced employment obligations, and the freedom to work from anywhere. Read more about it here: <a target=\"_blank\" rel=\"noopener noreferrer nofollow\" href=\"https://docs.google.com/document/d/1dHF4ctKlez75whdn-ybUwP5d5Wr0BdwVrorrm_fM40Q/preview\">https://docs.google.com/document/d/1dHF4ctKlez75whdn-ybUwP5d5Wr0BdwVrorrm_fM40Q/preview</a> 📈💼</p></li></ul><p style=\"min-height:1.5em\">Be part of our fast-growing team and seize this excellent opportunity for personal and professional growth!</p><p style=\"min-height:1.5em\"></p><h1><strong>Interview Process</strong></h1><p style=\"min-height:1.5em\">After submitting your application, we conduct a thorough review which typically takes 3 to 5 days, but may occasionally take longer due to the volume of applications received. If we see a potential fit, we proceed with the following steps:</p><ul style=\"min-height:1.5em\"><li><p style=\"min-height:1.5em\">Recruiter Screening (40 minutes)</p></li><li><p style=\"min-height:1.5em\">Technical Interview (90 minutes)</p></li></ul><p style=\"min-height:1.5em\"></p><h1><strong>Life at Ruby Labs</strong></h1><p style=\"min-height:1.5em\">At Ruby Labs, we are more than a team; we're a community united in pushing the boundaries of technology and innovation. Our combined passion fuels our ambition for excellence, driving impact that resonates around the globe.</p><p style=\"min-height:1.5em\">We are an equal-opportunity employer and celebrate diversity, recognizing that a diversity of thought and backgrounds builds stronger teams. We approach diversity and inclusion seriously and thoughtfully. We do not discriminate based on race, ethnicity, religion, color, place of birth, sex, gender identity or expression, sexual orientation, age, marital status, military service status, or disability status. Join us and be part of a company that is crafting the future of technology across multiple industries.</p><p style=\"min-height:1.5em\"></p><p style=\"min-height:1.5em\">#Li-Remote</p>","tags":"[\"javascript\",\"engineering\"]","pubDate":"2025-02-12T09:30:51.391Z","link":"https://jobs.ashbyhq.com/ruby-labs/9dfcb336-5d43-41b9-926d-0b67d8b83c93","slug":"junior-developer-students-ruby-labs-ruby-labs-2321"},{"id":7248456992,"title":"Principal Engineer","company":"Primer","image":"https://pbs.twimg.com/profile_images/1533245276764372993/AtyqkzHz_400x400.jpg","description":"<h2><strong>An Introduction to Primer</strong></h2><p style=\"min-height:1.5em\">The 21st century has witnessed remarkable expansion within the payments ecosystem with the introduction of new payment services, growth in cross-border commerce, and the development of multi-payment processor payment strategies.</p><p style=\"min-height:1.5em\">The bottom line is that payment is no longer just another step in the purchasing funnel but a strategic asset that can drive business growth and innovation.</p><p style=\"min-height:1.5em\">Enter Primer - the world's first unified payment infrastructure, empowering businesses worldwide to unleash their payment potential. By choosing our platform, merchants can take control over their payment stack, create unique commerce experiences, accelerate their roadmap and increase payment success.</p><p style=\"min-height:1.5em\">Primer's enterprise-grade infrastructure, frameworks, and tooling allow merchants to unify their disparate payment solutions and services to build optimised payment flows tailored to their unique business needs with no code or additional complexity. We strive to make something complex incredibly simple and intuitive.</p><p style=\"min-height:1.5em\">Our success so far has been reflected in the trust placed in us by category leaders such as Printify, NewLook, Voi, and Dabble, who are using Primer to transform their payments into a growth lever. Moreover, the world's top investors, including Accel, Balderton, Iconiq, and Tencent, have also invested in Primer's vision to rebuild payments and commerce from the ground up.</p><p style=\"min-height:1.5em\">Join us in shaping the future of payments and commerce. Let's pave the way for a world where businesses can fully realise their payment potential.</p><p style=\"min-height:1.5em\"></p><p style=\"min-height:1.5em\"><strong>What will you be doing in this role?</strong> </p><ul style=\"min-height:1.5em\"><li><p style=\"min-height:1.5em\">You will play a critical role in shaping the technical direction of our engineering department at Primer</p></li><li><p style=\"min-height:1.5em\">Reporting directly to our CTO, you will help ensure that our technical strategy aligns with our business goals as we continue to scale effectively</p></li><li><p style=\"min-height:1.5em\">Act as a technical authority and mentor for our Staff Engineers and Engineering Leadership</p></li><li><p style=\"min-height:1.5em\">Advocate for technical excellence, scalability, reliability, and balancing innovation with pragmatism</p></li><li><p style=\"min-height:1.5em\">Provide hands-on contributions through system design, coding, technical decision-making and picking the right tools for the job</p></li><li><p style=\"min-height:1.5em\">Foster a strong engineering culture based on continuous learning and development in a collaborative, low-ego environment</p></li><li><p style=\"min-height:1.5em\">Collaborate closely with business stakeholders, acting as a domain expert and technical authority to drive cross-functional initiatives</p></li><li><p style=\"min-height:1.5em\">Shape and implement best practices for engineering, ensuring industry-leading standards</p></li></ul><p style=\"min-height:1.5em\"><strong>What are we looking for?</strong> </p><ul style=\"min-height:1.5em\"><li><p style=\"min-height:1.5em\">Ideally a Principal Engineer (or similar) who has successfully navigated the transition from startup to scale-up</p></li><li><p style=\"min-height:1.5em\">The ability to shape and implement technical strategy at an organisational level</p></li><li><p style=\"min-height:1.5em\">A proven track record of leading and mentoring engineers at Staff+ level, fostering both their technical and professional growth</p></li><li><p style=\"min-height:1.5em\">Experience working in high-scale, low-latency environments, with a deep understanding of backend and infrastructure challenges</p></li><li><p style=\"min-height:1.5em\">Hands-on expertise in coding, with the ability to dive into technical work when needed</p></li><li><p style=\"min-height:1.5em\">A background in a strong engineering culture, where high standards for technical quality and operational excellence are the norm</p></li><li><p style=\"min-height:1.5em\">Excellent communication skills, with the ability to work closely with non-engineering stakeholders to drive company-wide initiatives</p></li></ul><p style=\"min-height:1.5em\"></p><p style=\"min-height:1.5em\">Our engineering teams work fully remotely across Europe and operate within local timezones</p><p style=\"min-height:1.5em\">Unfortunately we are unable to offer VISA sponsorships or relocation packages at this time<br /></p><p style=\"min-height:1.5em\"></p><h2><strong>What’s the culture like at Primer?</strong></h2><p style=\"min-height:1.5em\">We’re building a culture where people can come and do their best work and enjoy it. We want our people to be proud of the impact that they have at Primer, and of the work that they are doing. You will be working with a team of people who are mission-driven, smart, and reflective, and who are invested in building exceptional products and delivering success for our merchants <em>(and we also know how to have fun along the way).</em></p><p style=\"min-height:1.5em\">We work remotely. We believe that building a successful, profitable company goes beyond proximity. We invest in our relationships with each other through great remote working practices and thoughtfully designed face-to-face time together. Our heads-together time comes in the form of workstations, our annual company retreat, and co-working space access worldwide.</p><p style=\"min-height:1.5em\">Finally, let’s go ahead and say it. The work that we do is challenging. Startups are a challenge, building category defining products is a challenge. You should be prepared for a challenge at Primer. But, there’s a big difference between a challenge and a struggle. The key difference is that the right challenge comes with the right support structures, an acceptance that not everything always goes to plan, a collaborative environment, and a great team around you. It’s never a challenge that you will face alone.</p><p style=\"min-height:1.5em\"></p><h2><strong>Our benefits:</strong></h2><ul style=\"min-height:1.5em\"><li><p style=\"min-height:1.5em\">We are fully remote</p></li><li><p style=\"min-height:1.5em\">Competitive share options</p></li><li><p style=\"min-height:1.5em\">Uncapped holiday, with 25 days minimum to be taken</p></li><li><p style=\"min-height:1.5em\">Co-working space access</p></li><li><p style=\"min-height:1.5em\">Workations &amp; company retreat</p></li><li><p style=\"min-height:1.5em\">The best equipment for your role</p></li><li><p style=\"min-height:1.5em\">£500 towards your home office setup</p></li><li><p style=\"min-height:1.5em\">Generous learning budget</p></li><li><p style=\"min-height:1.5em\">Medical insurance</p></li><li><p style=\"min-height:1.5em\">A broad set of additional perks and benefits (<em>depending on location)</em></p></li></ul><p style=\"min-height:1.5em\"></p><h2><strong>Don’t meet every single requirement?</strong></h2><p style=\"min-height:1.5em\">At Primer, we’re dedicated to building a diverse, inclusive, and authentic workplace. If you’re excited about this role but your past experience doesn’t align perfectly with every qualification in the job description, we encourage you to apply. You may be the right candidate for this or other roles. Primer is committed to the equal treatment of all current and prospective employees, regardless of background or beliefs—see our diversity commitment statement for more details</p><p style=\"min-height:1.5em\"><a target=\"_blank\" rel=\"noopener noreferrer nofollow\" href=\"https://www.notion.so/Equity-diversity-inclusion-and-belonging-policy-7904d43d137848fda9cdc19772e43cec?pvs=21\"><strong>Equity, diversity, inclusion and belonging policy</strong></a></p><p style=\"min-height:1.5em\">Primer adopts a zero-tolerance approach to discrimination.</p><p style=\"min-height:1.5em\">We are committed to providing equal opportunities to all current and prospective employees regardless of age, disability, sex, sexual orientation, pregnancy and maternity, race or ethnicity, religion or belief, gender identity, or marriage and civil partnership.</p>","tags":"[\"engineering\"]","pubDate":"2025-02-12T09:30:31.669Z","link":"https://jobs.ashbyhq.com/primer.io/1a6f1bd5-54fb-4508-bf6a-8c6a3f9a6084","slug":"principal-engineer-primer-1813"},{"id":8242738748,"title":"Head of Channel Management","company":"Clutch","image":"https://app.ashbyhq.com/api/images/org-theme-logo/87f6e542-ae68-4ff1-ab48-f05e9dab1964/e24aecd5-3955-404a-8728-c08806c78730.png","description":"<p style=\"min-height:1.5em\"><strong>About the Role</strong></p><p style=\"min-height:1.5em\">The Credit Union movement is a close-knit community focused on improving Americans' financial wellness, and our partnerships with key industry players like TruStage and Credit Union Leagues are vital to this mission. As we scale our go-to-market efforts, we seek a Head of Channel Partnerships to deepen these relationships and build Clutch’s channel partner ecosystem.</p><p style=\"min-height:1.5em\">In this role, you’ll build strong relationships, structure collaborations for mutual success, and keep partners updated on product developments. As the main point of contact, you’ll coordinate partner events, develop incentive plans, and ensure partners are well-equipped to promote Clutch’s offerings. Success will be measured by the strength and impact of our partnerships.</p><h2></h2><p style=\"min-height:1.5em\"><strong>What You’ll Do</strong></p><p style=\"min-height:1.5em\"><strong>Within 3 months:</strong></p><ul style=\"min-height:1.5em\"><li><p style=\"min-height:1.5em\">Connect with TruStage sales managers and 30 League leaders to form an initial strategy for partnership alignment.</p></li><li><p style=\"min-height:1.5em\">Build strong relationships with product and sales teams and develop a V1.0 partner playbook.</p></li><li><p style=\"min-height:1.5em\">Attend industry events to establish connections with Clutch’s existing partners.</p></li><li><p style=\"min-height:1.5em\">Set up regular performance reviews, remove AE-led tasks for event planning, and create tracking guidelines for partnership effectiveness.</p></li><li><p style=\"min-height:1.5em\">Turn newly signed partnerships into productive collaborations to support Clutch’s long-term goals.</p></li></ul><p style=\"min-height:1.5em\"><strong>Within 6 months:</strong></p><ul style=\"min-height:1.5em\"><li><p style=\"min-height:1.5em\">Develop a solid understanding of customer success stories and demonstrate closed deals from partner-generated leads.</p></li><li><p style=\"min-height:1.5em\">Establish ROI metrics, a refined playbook, and partner performance rankings.</p></li><li><p style=\"min-height:1.5em\">Become the primary resource for questions related to any of our existing partnerships and ensure partnerships generate leads beyond sales team capacity.</p></li><li><p style=\"min-height:1.5em\">Build a relationship manager org design that allows you to scale your initial relationship-building efforts into a scalable and repeatable motion, ultimately supported by several relationship managers under you.</p></li></ul><p style=\"min-height:1.5em\"><strong>Within 9 months:</strong></p><ul style=\"min-height:1.5em\"><li><p style=\"min-height:1.5em\">Gain insight into top target accounts and partner influence, managing underperforming partners with improvement plans.</p></li><li><p style=\"min-height:1.5em\">Expand high-level partnerships with CEOs, especially with TruStage and League leaders.</p></li><li><p style=\"min-height:1.5em\">Build out the team of relationship managers commensurate to the signed and active partnerships beyond TruStage and the Leagues.</p></li></ul><p style=\"min-height:1.5em\"><strong>What You’ll Bring</strong></p><ul style=\"min-height:1.5em\"><li><p style=\"min-height:1.5em\">Proven experience in early-stage companies and managing partnerships.</p></li><li><p style=\"min-height:1.5em\">Highly independent, adaptable, and driven to succeed.</p></li><li><p style=\"min-height:1.5em\">Skilled in relationship-building and managing complex partnerships; able to “farm” effectively, i.e. get the most out of existing partnerships.</p></li><li><p style=\"min-height:1.5em\">Strategic thinker with strong project management skills; detail-oriented, and deadline-focused.</p></li><li><p style=\"min-height:1.5em\">Capable of aligning diverse stakeholder interests and building credibility in partner ecosystems.</p></li><li><p style=\"min-height:1.5em\">Willing to travel for relationship-building and in-person industry engagements when the digital channels aren’t leading to the desired outcomes.</p></li><li><p style=\"min-height:1.5em\">Background in banking, credit unions, or fintech, with a valuable network in the credit union industry preferred.</p></li></ul><p style=\"min-height:1.5em\"><em>Please note that this role may evolve as our business needs change, so we appreciate your flexibility and adaptability.</em></p><h1></h1><p style=\"min-height:1.5em\"><strong>What's In It For You?</strong></p><ul style=\"min-height:1.5em\"><li><p style=\"min-height:1.5em\"><strong>Remote Flexibility:</strong> Enjoy the freedom of remote work from anywhere, balancing life and career seamlessly.</p></li><li><p style=\"min-height:1.5em\"><strong>Unforgettable Off-Sites:</strong> Twice a year, bond with colleagues in exciting destinations, fostering teamwork and fresh ideas.</p></li><li><p style=\"min-height:1.5em\"><strong>Paid Time Off:</strong> Enjoy flexible PTO days yearly for relaxation and rejuvenation.</p></li><li><p style=\"min-height:1.5em\"><strong>Stock Options:</strong> Joining us means having a stake in our success, so you'll receive stock options as part of your compensation package.</p></li><li><p style=\"min-height:1.5em\"><strong>Home Office Setup:</strong> Create your ideal workspace with a dedicated budget for home office essentials.</p></li><li><p style=\"min-height:1.5em\"><strong>Work Trip Budget:</strong> Grow personally and professionally with a budget for work-related trips and co-working.</p></li><li><p style=\"min-height:1.5em\"><strong>Health Coverage:</strong> Prioritize your well-being with comprehensive health and dental insurance plans.</p></li></ul><p style=\"min-height:1.5em\"><strong>About Us</strong></p><p style=\"min-height:1.5em\"><strong>Clutch</strong> is a revolutionary vertical SaaS company, proudly backed by Andreessen Horowitz (A16z), aimed at revolutionizing the way Credit Unions engage and change the lives of their members. As a champion of financial well-being, we address the urgent need for affordable lending solutions in an era where the average American grapples with over $155,000 in household debt.  Unlike traditional financial institutions, Clutch develops software to turn Credit Unions into FinTech lenders and leverage their balance sheets to responsibly lend to over 130M Americans. Our mission extends beyond mere financial transactions; we strive to fundamentally enhance the way credit unions interact with their members. By integrating cutting-edge technologies and user-centric designs, we help credit unions provide seamless digital experiences that are on par with leading tech companies. This approach not only preserves but revitalizes the longstanding tradition of community and member-focused service inherent to credit unions.</p><p style=\"min-height:1.5em\">Clutch is an equal-opportunity employer. All applicants will be considered for employment without attention to race, color, religion, sex, sexual orientation, gender identity, national origin, veteran or disability status. </p><p style=\"min-height:1.5em\"><em>Our organization participates in E-Verify. Click </em><a target=\"_blank\" rel=\"noopener noreferrer\" class=\"notion-link-token notion-focusable-token notion-enable-hover\" href=\"https://www.e-verify.gov/about-e-verify/what-is-e-verify\"><em>here</em></a><em> to learn about E-Verify.</em></p>","tags":"[\"management\"]","pubDate":"2025-02-12T00:11:06.235Z","link":"https://jobs.ashbyhq.com/withclutch/63d3267d-9fc5-4cda-9858-08def973d4f5","slug":"head-of-channel-management-clutch-3652"},{"id":6319425549,"title":"Senior AI Engineer","company":"BioRender","image":"https://avatars.githubusercontent.com/u/46490948?s=200&v=4","description":"<p style=\"min-height:1.5em\">At BioRender, we are accelerating the world’s ability to discover, learn, and communicate science faster through visuals. Today, BioRender empowers millions of scientists to create beautiful, accurate biological figures for communication within pharma companies and academic research.</p><p style=\"min-height:1.5em\"></p><p style=\"min-height:1.5em\">Our vision is to make BioRender the place where humans read biology—translating human and AI-generated data into scientifically accurate, human-understandable visuals. As AI automates large parts of research, BioRender will transform complex data, experimental results, and text inputs into clear, intuitive visuals that scientists, decision-makers, and broader audiences can quickly interpret. Visual communication will be critical to accelerating breakthroughs across academia and industry, and BioRender will bridge the gap between specialized knowledge domains.</p><p style=\"min-height:1.5em\"></p><p style=\"min-height:1.5em\"><strong>About Us:<br /></strong>We’re on a mission to democratize science communication with cutting-edge AI-powered products. As a Senior AI Engineer, you’ll not only build full-stack solutions but also integrate AI into every layer of our product—turning innovative ideas into production-ready features that delight our users.</p><p style=\"min-height:1.5em\"></p><p style=\"min-height:1.5em\"><strong>What you'll be doing :</strong></p><ul style=\"min-height:1.5em\"><li><p style=\"min-height:1.5em\"><strong>Collaborate Across Teams:</strong> Work side-by-side with product managers, designers, and data scientists to shape a roadmap that leverages AI for smarter, more engaging user experiences.</p></li><li><p style=\"min-height:1.5em\"><strong>Prototype &amp; Productionize:</strong> Rapidly prototype AI-driven features (e.g., natural language &amp; multimodal processing, intelligent recommendations) and productionize them into our core product to help scientists communicate faster.</p></li><li><p style=\"min-height:1.5em\"><strong>Champion AI Innovation:</strong> Serve as the AI evangelist on your team—experiment with the latest AI models &amp; techniques (LLMs, few-shot learning, RAG..) and share your insights to uplift the entire engineering organization.</p></li><li><p style=\"min-height:1.5em\"><strong>Own and Improve:</strong> Take end-to-end ownership of key components of our codebase, ensuring that both traditional and AI-powered features are robust, scalable, and maintainable.</p></li><li><p style=\"min-height:1.5em\"><strong>Drive Creative Problem-Solving:</strong> Embrace ambiguity, experiment boldly, and develop creative solutions that push the boundaries of what our product can do.</p></li></ul><p style=\"min-height:1.5em\"></p><p style=\"min-height:1.5em\"><strong>Our ideal fit brings:</strong></p><ul style=\"min-height:1.5em\"><li><p style=\"min-height:1.5em\"><strong>AI Fluency &amp; Passion:</strong> You’re genuinely curious about AI, continuously explore emerging tools, and love applying them in real-world projects.</p></li><li><p style=\"min-height:1.5em\"><strong>Builder Mentality:</strong> With 7+ years of full-stack development experience, you’ve built products from concept to production and are eager to prototype and iterate quickly.</p></li><li><p style=\"min-height:1.5em\"><strong>Tech Expertise:</strong> Proficient in modern JavaScript frameworks (e.g., ReactJS), NodeJS/ExpressJS, cloud infrastructure (e.g., AWS), and experienced with Python along with ML libraries (e.g., PyTorch or TensorFlow).</p></li><li><p style=\"min-height:1.5em\"><strong>LLM tooling: </strong>has experience leveraging modern tools to develop with LLMs and deploy/monitor/experiment with them in production.</p></li><li><p style=\"min-height:1.5em\"><strong>Creative Problem Solver:</strong> You thrive in ambiguous environments and can creatively tackle challenges—both in standard product features and in integrating advanced AI functionalities.</p></li><li><p style=\"min-height:1.5em\"><strong>Mentorship &amp; Collaboration:</strong> You love sharing your knowledge, helping peers adopt AI best practices, and continuously improving team processes.</p></li></ul><p style=\"min-height:1.5em\"></p><p style=\"min-height:1.5em\"><strong>Why join us?</strong></p><ul style=\"min-height:1.5em\"><li><p style=\"min-height:1.5em\"><strong>We are mission-driven</strong>: we work collaboratively towards our shared vision of improving scientific communication and accelerating scientific discovery. BioRender figures have appeared in more than 54,000 publications! </p></li><li><p style=\"min-height:1.5em\"><strong>BioRender is loved by millions!</strong> We have a world-class NPS and a community of loyal fans and users in 200+ countries!</p></li><li><p style=\"min-height:1.5em\"><strong>Our company is backed by top investors</strong> and accelerators like Y Combinator, and we are on a growth trajectory comparable to many top-performing SaaS companies </p></li><li><p style=\"min-height:1.5em\"><strong>We’re remote-first</strong> with team members across Canada and the U.S., offering you the flexibility to work from anywhere. </p></li></ul><p style=\"min-height:1.5em\"></p><p style=\"min-height:1.5em\">BioRender is an Equal Opportunity Employer. We celebrate diversity and are committed to creating an inclusive environment for all employees. All qualified applicants will receive consideration for employment without regard to race, color, religion, sex, sexual orientation, gender identity, national origin, disability, or veteran status.</p>","tags":"[\"javascript\",\"engineering\",\"aws\"]","pubDate":"2025-02-11T21:04:08.706Z","link":"https://jobs.ashbyhq.com/biorender/001c591c-90cd-4441-aef1-c0818d6159d9","slug":"senior-ai-engineer-biorender-5600"},{"id":5015953082,"title":"Senior Machine Learning Engineer","company":"Aiwyn","image":"https://media.licdn.com/dms/image/v2/D4E0BAQEvDOFt9VDmfg/company-logo_200_200/company-logo_200_200/0/1714673337921/aiwyn_logo?e=1743033600&v=beta&t=0yqXd-p9YeUPxD_oaEkvrGENa6XLG5S4Q4dDXCettEY","description":"<div><b>Who is Aiwyn and what do we do?</b></div><div><br></div><div>Aiwyn is the fastest-growing software company serving the accounting profession.&nbsp;Founded in 2020, we now work with 100+ of the largest CPA firms in the world.&nbsp;Our “Job to be done”: speed up cash flow, save Partner time, &amp; deliver best-in-class client experiences. We do this by automating day-to-day firm operations with our Practice Automation solutions. Aiwyn is led by serial entrepreneurs with multiple exits and funded by top-tier investors (Bessemer, KKR, &amp; Revolution). We're passionate about building a remarkable company with world-class people, processes, and technology.</div><div><br></div><div>To learn more, visit our <a class=\"postings-link\" href=\"https://aiwyn.ai/\"><b>website</b></a></div><div><br></div><div><b>Job Summary:</b></div><div><br></div><div>We are seeking an experienced Senior Machine Learning Engineer to design, develop, and implement solutions across a wide range of business problems. The AI Engineering team is tasked with building AI into the fabric of both our products and our operations company-wide at Aiwyn. To deliver, not only must you have exceptional technical skills, you will also need to partner effectively with SMEs to deliver maintainable solutions and uplevel the understanding of and adoption of AI/ML everywhere we touch.</div><div><br></div><div>You will build pipelines that support the consumption and interpretation of complex document corpora, each with a variety of encoded knowledge. You will work extensively with knowledge graphs, modern AI/ML tools, and GAI infrastructure, while collaborating across frontend and backend teams (in a mostly Python stack) to ensure rapid iteration and deployment of AI solutions.</div><div><b>Who is Aiwyn and what do we do?</b></div><div><br></div><div>Aiwyn is the fastest-growing software company serving the accounting profession.&nbsp;Founded in 2020, we now work with 100+ of the largest CPA firms in the world.&nbsp;Our “Job to be done”: speed up cash flow, save Partner time, &amp; deliver best-in-class client experiences. We do this by automating day-to-day firm operations with our Practice Automation solutions. Aiwyn is led by serial entrepreneurs with multiple exits and funded by top-tier investors (Bessemer, KKR, &amp; Revolution). We're passionate about building a remarkable company with world-class people, processes, and technology.</div><div><br></div><div>To learn more, visit our <a href=\"https://aiwyn.ai/\" class=\"postings-link\"><b>website</b></a></div><div><br></div><div><b>Job Summary:</b></div><div><br></div><div>We are seeking an experienced Senior Machine Learning Engineer to design, develop, and implement solutions across a wide range of business problems. The AI Engineering team is tasked with building AI into the fabric of both our products and our operations company-wide at Aiwyn. To deliver, not only must you have exceptional technical skills, you will also need to partner effectively with SMEs to deliver maintainable solutions and uplevel the understanding of and adoption of AI/ML everywhere we touch.</div><div><br></div><div>You will build pipelines that support the consumption and interpretation of complex document corpora, each with a variety of encoded knowledge. You will work extensively with knowledge graphs, modern AI/ML tools, and GAI infrastructure, while collaborating across frontend and backend teams (in a mostly Python stack) to ensure rapid iteration and deployment of AI solutions.</div><h3>Key Responsibilities:</h3><li><b>Solution Design, Development &amp; Evaluation:</b></li><li>Collaborate with stakeholders to define business problems and determine the best AI/ML approaches.</li><li>Design and implement robust, scalable, and efficient machine learning systems to support the ingestion, processing, and interpretation of large document corpora.</li><li>Develop machine learning models, particularly in the context of knowledge graphs, to enhance the interpretation and utility of complex datasets.</li><li>Implement evaluation frameworks to assess model performance, iterating rapidly based on feedback and results.</li><div><br></div><div><b>Generative AI Expertise and Education:&nbsp;</b></div><li>Leverage your deep knowledge of Generative AI (GAI) to stay ahead of industry trends and evaluate and integrate the latest advancements into our workflows.&nbsp;</li><li>Integrate GAI into existing and new machine learning pipelines, enhancing the overall capability of our products.</li><li>Integrate observability and evaluation into our GAI applications to ensure consistent system performance.</li><div><br></div><div><b>Build an AI-centric Company:</b></div><li>Engage with stakeholders to help them understand what is possible and enable them to get their hands dirty prototyping and building their own AI-driven solutions.</li><li>Engage with the internal AI/ML community to share knowledge, stay informed of emerging trends, and integrate innovative ideas into our work.</li><h3>Qualifications:</h3><li>5+ years of experience in machine learning engineering, with a focus on AI/ML solution development and delivery.</li><li>Proven expertise in working with Generative AI (GAI) and staying at the forefront of advancements in the field.&nbsp;</li><li>Expert proficiency in Python, with experience in cross-language collaboration and codebase management.&nbsp;</li><li>Proven experience collaborating across cross-functional teams to drive AI/ML adoption and impact.&nbsp;</li><li>Advanced knowledge of AI/ML model development, evaluation, and rapid iteration.&nbsp;</li><li>Strong problem-solving skills, with the ability to architect and implement scalable solutions for complex problems.</li><li>Experience with MLOps and delivering solutions in a cloud environment (e.g. GCP, AWS, Azure).</li><li>Strong experience with modern version control systems (e.g., GitHub).&nbsp;</li><li>Excellent communication and collaboration skills, with the ability to work effectively in a fast-paced, start-up environment.</li><li>The ability to travel occasionally for onsite Company meetings</li><h3>Why Work at Aiwyn?</h3><li>The big-picture value proposition of this role is simple: join us, and you'll be paid competitively to have freedom in solving worthwhile, challenging problems alongside other A-players at a fast-growing SaaS startup led by an experienced and successful team with industry experience.</li><div><br></div><div>Other benefits include:</div><li><b>Adventure travel stipend</b> - you receive a $1,000 travel reimbursement on your work anniversary each year. We encourage our team to recharge and explore the world beyond their home office walls.</li><li><b>Remote, work-from-anywhere culture</b></li><li><b>Flexible PTO</b></li><li><b>World Class health benefits</b> - we believe in fostering flourishing teams by providing benefits that go beyond the usual standards - Health, vision, dental, HSA/FSA, and mental health support.</li><li><b>Stock options</b> - every Full Time Employee has ownership in Aiwyn's future and success.</li><li><b>401(k) matching</b></li><h3>Our Values:</h3><li><b>Trust</b> - We champion transparency, welcome differing perspectives, uphold accountability, and trust that others have good intentions</li><li><b>Courage</b> - We have the courage to take calculated risks and embrace change, knowing what worked in the past won’t always work in the future</li><li><b>Impact</b> - Rooted in determination and innovation, we chase extraordinary outcomes and impactful results</li><li><b>Relentlessness</b> - We approach challenges with an unwavering resolve, never settling for mediocrity, and always striving to surpass expectations</li><h3>Learn more about Aiwyn</h3><li><b><a class=\"postings-link\" href=\"https://www.aiwyn.ai/about\">About us</a></b></li><li><b><a class=\"postings-link\" href=\"https://www.aiwyn.ai/why-aiwyn\">Why Aiwyn</a></b></li><li><b><a class=\"postings-link\" href=\"https://www.youtube.com/@AiwynAI\">YouTube page</a></b></li><div>Aiwyn is an equal opportunity employer. All qualified applicants will receive consideration for employment without regard to age, ancestry, color, family or medical care leave, gender identity or expression, genetic information, marital status, medical condition, national origin, physical or mental disability, political affiliation, protected veteran status, race, religion, sex (including pregnancy), sexual orientation, or any other characteristic protected by applicable laws, regulations and ordinances.</div><div><br></div><div>Candidate information will be treated in accordance with our CCPA privacy notice which can be found here: <a class=\"postings-link\" href=\"https://www.aiwyn.ai/ccpa\">https://www.aiwyn.ai/ccpa</a></div>","tags":"[\"management\",\"engineering\",\"aws\"]","pubDate":"2025-02-11T18:45:18.676Z","link":"https://jobs.lever.co/aiwyn/6d7fe5e5-b309-46c5-85d6-9b3d3d0df25a","slug":"senior-machine-learning-engineer-aiwyn-3017"},{"id":5697690581,"title":"Senior Business Development (Web3 Security)","company":"Nethermind","image":"https://avatars.githubusercontent.com/u/43478154?s=200&v=4","description":"&lt;div class=&quot;content-intro&quot;&gt;&lt;h2&gt;What are we all about?&lt;/h2&gt;\n&lt;p&gt;We are a team of builders and researchers on a mission to empower enterprises and developers worldwide to access and build on decentralized systems.&lt;/p&gt;\n&lt;p&gt;Our expertise covers several domains: Ethereum and Starknet protocol engineering, layer-2, AI, cryptography research, protocol research, decentralized finance (DeFi), security auditing, formal verification, real-time monitoring, smart contract development, and dapps and enterprise engineering.&lt;/p&gt;\n&lt;p&gt;Working to solve some of the most challenging problems in the blockchain space, we frequently collaborate with renowned companies, such as Ethereum Foundation, Starknet Foundation, Gnosis Chain, Flashbots, Forta Protocol, Lido, EigenLayer, Open Zeppelin, RISCZero, Aleph Zero, and many more.&lt;/p&gt;\n&lt;p&gt;Today, we are a 350+ strong team working remotely across 66+ countries.&lt;/p&gt;\n&lt;p&gt;View all our open positions here: &lt;a href=&quot;https://www.nethermind.io/open-roles&quot;&gt;https://www.nethermind.io/open-roles&amp;nbsp;&lt;/a&gt;&lt;/p&gt;&lt;/div&gt;&lt;p&gt;&lt;strong&gt;About the role:&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;The &lt;strong data-stringify-type=&quot;bold&quot;&gt;Senior Business Development&lt;/strong&gt; role will utilize Nethermind Security’s engineering talent to accelerate the adoption &amp;amp; development of permissionless, open &amp;amp; decentralized systems. You will have the opportunity to be at the forefront of a pivotal time in Web3.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Responsibilities:&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;As a member of the Business Development team, you will focus on the growth of Nethermind Security’s Business Unit.&lt;/p&gt;\n&lt;p&gt;Your responsibilities will be&amp;nbsp;multifaceted and&amp;nbsp;require you to be proactive and motivated. You will attract new clients, build relationships, generate leads, negotiate, and close deals. Other duties will include market research, developing business strategies and pitches, and identifying new business opportunities. You will focus on working with Security Audits, formal verification, and real-time monitoring.&lt;/p&gt;\n&lt;p&gt;This is an enormous opportunity to utilize your problem-solving ability and pave the path for the future of Blockchain technology.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;A Day in the Life&lt;/strong&gt;&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;Identifying and evaluating new business opportunities&lt;/li&gt;\n&lt;li&gt;Generating leads&lt;/li&gt;\n&lt;li&gt;Negotiating and closing deals&lt;/li&gt;\n&lt;li&gt;Conducting market research and identifying potential clients&lt;/li&gt;\n&lt;li&gt;Building strong relationships with new clients while maintaining existing client relationships&lt;/li&gt;\n&lt;li&gt;Engaging with projects across ecosystems&lt;/li&gt;\n&lt;li&gt;Identify and invent new value propositions&lt;/li&gt;\n&lt;li&gt;Assisting with drafting business plans, sales pitches, presentations, reference material, etc&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;&lt;strong&gt;Must Haves:&lt;/strong&gt;&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;5+ years of work experience in sales&lt;/li&gt;\n&lt;li&gt;Experience in Web3 is&amp;nbsp;&lt;strong&gt;required&lt;/strong&gt;&lt;/li&gt;\n&lt;li&gt;Previous experience selling security services and products is &lt;strong&gt;preferred&lt;/strong&gt;&lt;/li&gt;\n&lt;li&gt;Proven experience in sales and leads generation (provide measurable results)&lt;/li&gt;\n&lt;li&gt;Strong negotiation skills&lt;/li&gt;\n&lt;li&gt;Strong written/verbal communication &amp;amp; presentation skills&lt;/li&gt;\n&lt;li&gt;Ability to generate and acquire new leads&lt;/li&gt;\n&lt;li&gt;Strong network in Web3 space (Ethereum, Starknet, other L2s)&lt;/li&gt;\n&lt;li&gt;Experience in working with marketing on lead-generation campaigns&lt;/li&gt;\n&lt;li&gt;Comfort in making decisions autonomously and explaining your ideas concisely&lt;/li&gt;\n&lt;li&gt;Self Driven / Entrepreneurial mindset. Ability to work fast and autonomously&lt;/li&gt;\n&lt;li&gt;Good knowledge of Blockchain technology &amp;amp; the crypto space&lt;/li&gt;\n&lt;li&gt;Great at building &amp;amp; leveraging relationships while maintaining existing ones&lt;/li&gt;\n&lt;li&gt;Data-savvy, understand basic metrics of sales, marketing, and operations&lt;/li&gt;\n&lt;/ul&gt;&lt;div class=&quot;content-conclusion&quot;&gt;&lt;div&gt;&lt;span style=&quot;font-size: 8pt;&quot;&gt;&lt;em&gt;&lt;span style=&quot;text-decoration: underline;&quot;&gt;&lt;strong&gt;Disclaimer&lt;/strong&gt;&lt;/span&gt;: I hereby consent to my personal information being stored and processed by Demerzel Solutions Limited (t/a Nethermind) (the “Company”) for recruitment purposes in relation to both the selected job role and any other role the Company considers me a qualified candidate for. All data storing and processing by the Company takes place in accordance with the UK GDPR. Kindly refer to our privacy policy for more details.&amp;nbsp;&lt;/em&gt;&lt;/span&gt;&lt;br&gt;&lt;span style=&quot;font-size: 8pt;&quot;&gt;&lt;em&gt;Your consent to share personal information is entirely voluntary, and you may withdraw your consent at any time. Should you have any questions about this process, or wish to withdraw your consent please contact: legalnotices@nethermind.io&amp;nbsp;&lt;/em&gt;&lt;/span&gt;&lt;br&gt;&lt;br&gt;Keep up to date on what we are working on by following&amp;nbsp;&lt;span class=&quot;il&quot;&gt;us&lt;/span&gt;&amp;nbsp;on &lt;strong&gt;our social channels&lt;br&gt;&lt;br&gt;&lt;/strong&gt;&lt;/div&gt;\n&lt;div&gt;&lt;a href=&quot;https://twitter.com/nethermindeth&quot; target=&quot;_blank&quot;&gt;&lt;img src=&quot;https://cdn4.iconfinder.com/data/icons/social-media-icons-the-circle-set/48/twitter_circle-512.png&quot; alt=&quot;&quot; width=&quot;50&quot; height=&quot;50&quot;&gt;&lt;/a&gt; &amp;nbsp; &lt;a href=&quot;https://discord.com/invite/PaCMRFdvWT&quot; target=&quot;_blank&quot;&gt;&lt;img src=&quot;https://cdn3.iconfinder.com/data/icons/popular-services-brands-vol-2/512/discord-1024.png&quot; alt=&quot;&quot; width=&quot;49&quot; height=&quot;49&quot;&gt;&lt;/a&gt; &amp;nbsp; &lt;a href=&quot;https://www.linkedin.com/company/nethermind/mycompany/&quot; target=&quot;_blank&quot;&gt;&lt;img src=&quot;https://cdn1.iconfinder.com/data/icons/logotypes/32/circle-linkedin-1024.png&quot; alt=&quot;&quot; width=&quot;49&quot; height=&quot;49&quot;&gt;&lt;/a&gt;&lt;/div&gt;\n&lt;div&gt;&amp;nbsp;&lt;/div&gt;\n&lt;div&gt;&lt;strong&gt;&lt;a href=&quot;https://www.nethermind.io/legal&quot; target=&quot;_blank&quot;&gt;&lt;em&gt;Click here to view our Privacy Policy.&lt;/em&gt;&lt;/a&gt;&lt;/strong&gt;&lt;/div&gt;&lt;/div&gt;","tags":"[\"finance\",\"engineering\",\"legal\"]","pubDate":"2025-02-11T15:59:53.000Z","link":"https://job-boards.eu.greenhouse.io/nethermind/jobs/4534191101","slug":"senior-business-development-web3-security-nethermind-1259"},{"id":9441823729,"title":"Junior User Acquisition Manager | Ruby Labs","company":"Ruby Labs","image":"https://media.licdn.com/dms/image/v2/D4D0BAQF7VVv61POIFw/company-logo_200_200/company-logo_200_200/0/1721937953426?e=1743033600&v=beta&t=_qAkZ_qGO7Du2NSUdHDNbUKIbz28Y1HDm1g9mwNIOnk","description":"<h1><strong>About us</strong></h1><p style=\"min-height:1.5em\">Ruby Labs is a leading tech company that creates and operates innovative consumer products. We offer a diverse range of opportunities across the health, education, and entertainment industries. Our innovative teams are driving the future of consumer-led products, and we're always looking for passionate individuals to join us. Learn more about our story at: <a target=\"_blank\" rel=\"noopener noreferrer nofollow\" href=\"https://rubylabs.com/about-us/\">https://rubylabs.com/about-us/</a></p><p style=\"min-height:1.5em\"></p><h1><strong>About the role</strong></h1><p style=\"min-height:1.5em\">We are seeking a Junior User Acquisition Manager to join our growing team and help drive subscriptions across three brands within our holding company. The ideal candidate should have experience with 2+ advertising platforms (FB/Google Ads, Telegram, TikTok, SnapChat, X, etc) and must be ready to quickly learn new platforms as part of their role. This position requires adaptability and enthusiasm for mastering new advertising channels, as you'll be expected to become proficient with various platforms beyond your current expertise.</p><p style=\"min-height:1.5em\"></p><h1><strong>Key Responsibilities</strong></h1><ol style=\"min-height:1.5em\"><li><p style=\"min-height:1.5em\">Campaign Management:</p><ul style=\"min-height:1.5em\"><li><p style=\"min-height:1.5em\">Manage and optimize advertising campaigns across multiple platforms.</p></li><li><p style=\"min-height:1.5em\">Learn new advertising platforms and implement best practices.</p></li><li><p style=\"min-height:1.5em\">Monitor campaign performance and make data-driven optimizations.</p></li><li><p style=\"min-height:1.5em\">Assist in budget allocation and management.</p></li></ul></li><li><p style=\"min-height:1.5em\">Data Analysis and Insights:</p><ul style=\"min-height:1.5em\"><li><p style=\"min-height:1.5em\">Conduct in-depth analysis of campaign performance metrics.</p></li><li><p style=\"min-height:1.5em\">Collaborate closely with the data team to leverage reports and data tools.</p></li><li><p style=\"min-height:1.5em\">Use data-driven insights to inform strategy and tactical decisions.</p></li></ul></li><li><p style=\"min-height:1.5em\">Campaign Structure and Optimization:</p><ul style=\"min-height:1.5em\"><li><p style=\"min-height:1.5em\">Design and implement optimal campaign structures.</p></li><li><p style=\"min-height:1.5em\">Continuously test and refine ad creatives, targeting, and bidding strategies.</p></li><li><p style=\"min-height:1.5em\">Conduct A/B testing to improve campaign performance and identify scaling opportunities.</p></li></ul></li><li><p style=\"min-height:1.5em\">Telegram-Focused Management:</p><ul style=\"min-height:1.5em\"><li><p style=\"min-height:1.5em\">Oversee and optimize user acquisition efforts exclusively on Telegram.</p></li><li><p style=\"min-height:1.5em\">Allocate budget effectively based on performance and potential.</p></li><li><p style=\"min-height:1.5em\">Stay updated on Telegram platform changes and new features, adjusting strategies accordingly.</p></li></ul></li><li><p style=\"min-height:1.5em\">Strategy Development:</p><ul style=\"min-height:1.5em\"><li><p style=\"min-height:1.5em\">Collaborate with leadership to establish clear acquisition goals, KPIs, and budgets.</p></li><li><p style=\"min-height:1.5em\">Develop comprehensive user acquisition strategies aligned with company objectives.</p></li><li><p style=\"min-height:1.5em\">Continuously adapt strategies based on performance data and market trends.</p></li></ul></li><li><p style=\"min-height:1.5em\">Market Research:</p><ul style=\"min-height:1.5em\"><li><p style=\"min-height:1.5em\">Stay abreast of industry trends, ad platforms updates, and best practices in user acquisition.</p></li><li><p style=\"min-height:1.5em\">Identify and evaluate new acquisition methods within Telegram.</p></li></ul></li><li><p style=\"min-height:1.5em\">Cross-functional Collaboration:</p><ul style=\"min-height:1.5em\"><li><p style=\"min-height:1.5em\">Partner with the data team to leverage insights and improve decision-making.</p></li><li><p style=\"min-height:1.5em\">Collaborate with creative producers to ensure ad creatives align with performance goals.</p></li><li><p style=\"min-height:1.5em\">Work with other teams (e.g., product, marketing) to ensure cohesive user acquisition efforts.</p><p style=\"min-height:1.5em\"></p></li></ul></li></ol><h1><strong>Qualifications</strong></h1><ol style=\"min-height:1.5em\"><li><p style=\"min-height:1.5em\">Experience:</p><ul style=\"min-height:1.5em\"><li><p style=\"min-height:1.5em\">1+ years of experience in digital marketing or user acquisition.</p></li><li><p style=\"min-height:1.5em\">Hands-on experience with at least 2 major advertising platforms (e.g., Meta, Google, TikTok).</p></li><li><p style=\"min-height:1.5em\">Experience with performance marketing and campaign optimization.</p></li></ul></li><li><p style=\"min-height:1.5em\">Technical Skills:</p><ul style=\"min-height:1.5em\"><li><p style=\"min-height:1.5em\">Strong analytical skills and data-driven mindset.</p></li><li><p style=\"min-height:1.5em\">Proficiency in Excel and basic data analysis.</p></li><li><p style=\"min-height:1.5em\">Understanding of marketing metrics and KPIs.</p></li><li><p style=\"min-height:1.5em\">Familiarity with marketing analytics tools.</p></li></ul></li><li><p style=\"min-height:1.5em\">Personal Qualities:</p><ul style=\"min-height:1.5em\"><li><p style=\"min-height:1.5em\">Eager to learn new platforms and technologies.</p></li><li><p style=\"min-height:1.5em\">Detail-oriented and organized.</p></li><li><p style=\"min-height:1.5em\">Strong problem-solving abilities.</p></li><li><p style=\"min-height:1.5em\">Excellent communication skills.</p></li><li><p style=\"min-height:1.5em\">Self-motivated and proactive.</p></li></ul></li><li><p style=\"min-height:1.5em\">Personal Attributes:</p><ul style=\"min-height:1.5em\"><li><p style=\"min-height:1.5em\">Results-oriented with a passion for achieving tangible business outcomes through digital marketing efforts.</p></li><li><p style=\"min-height:1.5em\">Strong problem-solving and decision-making capabilities.</p></li><li><p style=\"min-height:1.5em\">Adaptable and quick to learn in a dynamic digital landscape.</p></li></ul></li></ol><p style=\"min-height:1.5em\"></p><h1><strong>Location</strong></h1><p style=\"min-height:1.5em\">Ruby Labs operates within the CET (Central European Time) zone. Applicants from any country are welcome to apply for the position as long as they are located within approximately ± 4 hours of CET. This ensures optimal collaboration and communication during working hours.</p><p style=\"min-height:1.5em\"></p><h1><strong>Benefits</strong></h1><p style=\"min-height:1.5em\">Discover the perks of being part of our vibrant team! We offer:</p><ul style=\"min-height:1.5em\"><li><p style=\"min-height:1.5em\"><strong>Remote Work Environment:</strong> Embrace the freedom to work from anywhere, anytime, promoting a healthy work-life balance. 🏡⏰</p></li><li><p style=\"min-height:1.5em\"><strong>Unlimited PTO:</strong> Enjoy unlimited paid time off to recharge and prioritize your well-being, without counting days. 🌴💼</p></li><li><p style=\"min-height:1.5em\"><strong>Paid National Holidays:</strong> Celebrate and relax on national holidays with paid time off to unwind and recharge. 🎉🌟</p></li><li><p style=\"min-height:1.5em\"><strong>Company-provided MacBook:</strong> Experience seamless productivity with top-notch Apple MacBooks provided to all employees who need them. 💻🚀</p></li><li><p style=\"min-height:1.5em\"><strong>Flexible Independent Contractor Agreement:</strong> Unlock the benefits of flexibility, autonomy, and entrepreneurial opportunities. Benefit from tax advantages, networking opportunities, reduced employment obligations, and the freedom to work from anywhere. Read more about it here: <a target=\"_blank\" rel=\"noopener noreferrer nofollow\" href=\"https://docs.google.com/document/d/1dHF4ctKlez75whdn-ybUwP5d5Wr0BdwVrorrm_fM40Q/preview\">https://docs.google.com/document/d/1dHF4ctKlez75whdn-ybUwP5d5Wr0BdwVrorrm_fM40Q/preview</a> 📈💼</p></li></ul><p style=\"min-height:1.5em\">Be part of our fast-growing team and seize this excellent opportunity for personal and professional growth!</p><p style=\"min-height:1.5em\"></p><h1><strong>Interview Process</strong></h1><p style=\"min-height:1.5em\">After submitting your application, we conduct a thorough review which typically takes 3 to 5 days, but may occasionally take longer due to the volume of applications received. If we see a potential fit, we proceed with the following steps:</p><ul style=\"min-height:1.5em\"><li><p style=\"min-height:1.5em\">Recruiter Screening (40 minutes)</p></li><li><p style=\"min-height:1.5em\">Technical Interview (90 minutes)</p></li><li><p style=\"min-height:1.5em\">Final Interview (60 minutes)</p></li></ul><p style=\"min-height:1.5em\"></p><h1><strong>Life at Ruby Labs</strong></h1><p style=\"min-height:1.5em\">At Ruby Labs, we are more than a team; we're a community united in pushing the boundaries of technology and innovation. Our combined passion fuels our ambition for excellence, driving impact that resonates around the globe.</p><p style=\"min-height:1.5em\">We are an equal-opportunity employer and celebrate diversity, recognizing that a diversity of thought and backgrounds builds stronger teams. We approach diversity and inclusion seriously and thoughtfully. We do not discriminate based on race, ethnicity, religion, color, place of birth, sex, gender identity or expression, sexual orientation, age, marital status, military service status, or disability status. Join us and be part of a company that is crafting the future of technology across multiple industries.</p><p style=\"min-height:1.5em\"></p><p style=\"min-height:1.5em\">#Li-Remote</p>","tags":"[\"management\"]","pubDate":"2025-02-11T14:26:31.379Z","link":"https://jobs.ashbyhq.com/ruby-labs/b2d3a34b-c468-4d02-a939-b15d14b1b0a6","slug":"junior-user-acquisition-manager-ruby-labs-ruby-labs-3750"},{"id":9029469789,"title":"AI/Machine Learning Engineer Roles","company":"Modus","image":"https://avatars.githubusercontent.com/u/959059?s=200&v=4","description":"&lt;p&gt;&lt;/p&gt;\n&lt;p&gt;We are looking for an&lt;strong&gt; AI/Machine Learning Engineer&amp;nbsp;&lt;/strong&gt;to join the team at Modus Create.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;About You&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Experience Level: Senior&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;You are a well-rounded, self-starting data engineer with experience in cloud data platforms who has worked in AI / machine learning. Ideally you have experience deploying large language models (LLMs) in the cloud and with basic techniques for tailoring them such as prompt engineering and retrieval-augmented generation (RAG).&lt;/p&gt;\n&lt;p&gt;You should be capable of proposing a solution to a given customer problem. You will be working on design and implementation for applications built around Generative AI, but possibly also on other AI, machine learning, and data-centric projects. A background in data science fundamentals will be helpful, as well as familiarity with cloud services for machine learning, text extraction, speech recognition, etc.. You should also be comfortable with presenting work in these technical areas to an audience.&lt;/p&gt;\n&lt;p&gt;Proficiency in Python is a must. Experience with other programming languages like Java, Scala, Rust or R is highly desirable, as it will enable you to work on a broader range of engagements.&lt;/p&gt;\n&lt;p&gt;Finally, you’ll work side by side with cloud architects, DevOps specialists and front-end developers, so some knowledge and experience in any of these would help in collaboration.&lt;/p&gt;\n&lt;h3&gt;Technologies and Tools&lt;/h3&gt;\n&lt;ul&gt;\n&lt;li&gt;LLM deployment: familiarity with an LLM framework (e.g. LangChain), evaluation libraries and cloud deployment&lt;/li&gt;\n&lt;li&gt;Cloud AI services: experience with some of SageMaker, Bedrock, Rekognition, etc. or equivalents on other platforms&lt;/li&gt;\n&lt;li&gt;Machine learning frameworks: familiarity with frameworks like TensorFlow or PyTorch is a plus&lt;/li&gt;\n&lt;li&gt;Cloud platforms: solid experience with at least one major cloud provider (AWS preferred); infrastructure as code (e.g., Terraform) is a plus&lt;/li&gt;\n&lt;li&gt;Version control: Git, GitHub/GitLab; DevOps and CI/CD experience is a plus&lt;/li&gt;\n&lt;li&gt;Programming and scripting languages: Python, Bash; knowledge of other languages is a big plus&lt;/li&gt;\n&lt;li&gt;Data storage and querying: SQL and NoSQL databases&lt;/li&gt;\n&lt;li&gt;Data pipelines: Experience with processing / orchestration tools such as Airflow, Spark, Kafka, Nextflow, etc. would be highly appreciated&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;Above all, AI is a rapidly-evolving field so the interest and ability to learn are highly valued in addition to experience.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;[In order to requisition 1929]&lt;/strong&gt;&lt;/p&gt;","tags":"[\"engineering\",\"database\",\"aws\"]","pubDate":"2025-02-11T13:46:03.000Z","link":"https://moduscreate.com/careers/6283932003?gh_jid=6283932003","slug":"ai-machine-learning-engineer-roles-modus-7097"},{"id":6174677269,"title":"Graduate Designer (Remote - Work from Anywhere)","company":"Xapo Bank","image":"https://avatars.githubusercontent.com/u/6930305?s=200&v=4","description":"&lt;div class=&quot;content-intro&quot;&gt;&lt;p style=&quot;text-align: left;&quot;&gt;&lt;span style=&quot;font-weight: 900;&quot;&gt;Work from anywhere, impact everywhere&amp;nbsp;&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;Diversity is at the heart of who we are at Xapo Bank. We’re a fully distributed team of over 140 Xapiens that work remotely from 40+ countries around the world.&amp;nbsp;&lt;/p&gt;\n&lt;p&gt;Our beginning: A world that enjoys economic freedom and wealth protection, no matter where you live or who is running your country. This is the dream that drove Wences Casares, our Founder and Chairman, to quietly transform the world of banking.&lt;/p&gt;\n&lt;p&gt;To achieve that, we search the world for the best people for the job. We work hard, think globally, and inspire each other to learn and grow. We are committed to changing the way things are done.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Risk is inherent in all of our business activities and managing risk well is the responsibility of every Xapien. Sound risk management enables us to serve our customers and deliver value for our shareholders, and helps make Xapo a great place to work.&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&amp;nbsp;&lt;/p&gt;\n&lt;p style=&quot;text-align: left;&quot;&gt;&lt;em&gt;&lt;span style=&quot;font-weight: 500;&quot;&gt;Although we are headquartered in Gibraltar, this is a full time, 100% remote position&amp;nbsp;&lt;br&gt;&lt;/span&gt;&lt;/em&gt;&lt;em&gt;&lt;span style=&quot;font-weight: 500;&quot;&gt;Work from anywhere!&lt;/span&gt;&lt;/em&gt;&lt;/p&gt;\n&lt;p style=&quot;text-align: left;&quot;&gt;&amp;nbsp;&lt;/p&gt;&lt;/div&gt;&lt;p&gt;&lt;strong&gt;Our Graduate Programme runs for a period of 12 months giving successful graduates the opportunity to become a full time Xapien once the programme has concluded. This role would therefore be a 12 month contract.&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;We are searching for individuals at the start of their working life looking to propel their careers and make an impact in the Fintech, Banking, and Blockchain space. As part of our innovative business, you&#39;ll embark on a journey of professional growth, tackling real-world challenges, and shaping the future of Banking. From collaborating with top-tier professionals in this industry to leveraging cutting-edge technologies, this role promises a thrilling adventure filled with learning, creativity, and endless possibilities.&amp;nbsp;&lt;/p&gt;\n&lt;p&gt;We are committed to helping you unleash your potential and carve out a path to success, are you ready to take on this challenge?&lt;/p&gt;\n&lt;p&gt;&amp;nbsp;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;&lt;em&gt;Position overview&lt;/em&gt;&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;We&#39;re looking for a junior designer to help shape our brand and create compelling visual assets across different teams and platforms. This is a great opportunity to gain hands-on experience in product design, branding, and creative execution while working in the exciting world of fintech.&lt;br&gt;Are you a design graduate passionate about fintech, crypto, and the future of digital products? Do you want to grow your design skills while contributing to a fast-paced, forward-thinking team? If so, we&#39;d love to hear from you!&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;&lt;em&gt;Responsibilities&lt;/em&gt;&lt;/strong&gt;&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;Design creative assets that support teams across HR, marketing, and product.&lt;/li&gt;\n&lt;li&gt;Assist in executing our brand vision across various channels and mediums.&lt;/li&gt;\n&lt;li&gt;Provide creative and brand input to our app designers to enhance the overall user experience.&lt;/li&gt;\n&lt;li&gt;Stay up to date with the latest trends in product design, fintech, and crypto to ensure our visuals stay fresh and relevant.&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;&lt;strong&gt;&lt;em&gt;Skills needed&lt;/em&gt;&lt;/strong&gt;&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;A strong eye for visual design and a keen interest in digital products.&lt;/li&gt;\n&lt;li&gt;Bonus: Experience with motion design or UI/interaction design.&lt;/li&gt;\n&lt;li&gt;A portfolio (even if small) showcasing your creative work.&lt;/li&gt;\n&lt;li&gt;A passion for the world of fintech and crypto, with an eagerness to learn and contribute to a rapidly evolving industry.&lt;/li&gt;\n&lt;li&gt;A proactive mindset—you&#39;re curious, resourceful, and excited about design innovation.&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;&lt;strong&gt;&lt;em&gt;What’s in it for you?&lt;/em&gt;&lt;/strong&gt;&lt;strong&gt;&lt;em&gt;&lt;br&gt;&lt;/em&gt;&lt;/strong&gt;&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;A chance to play a key role in shaping and evolving our brand&#39;s visual identity.&lt;/li&gt;\n&lt;li&gt;An opportunity to learn and grow in a team that values design, creativity, and innovation.&lt;/li&gt;\n&lt;li&gt;Exposure to real-world product design challenges and hands-on experience in fintech.&lt;/li&gt;\n&lt;li&gt;The ability to work remotely with a diverse, collaborative, and fully remote team.&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;&lt;strong&gt;&lt;em&gt;Other requirements&lt;/em&gt;&lt;/strong&gt;&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;A dedicated workspace.&lt;/li&gt;\n&lt;li&gt;A reliable internet connection with the fastest speed possible in your area.&lt;/li&gt;\n&lt;li&gt;Devices and other essential equipment that meet minimal technical specifications.&lt;/li&gt;\n&lt;li&gt;Alignment with Our Values and the Xapo Values-Driven Leadership principles.&lt;/li&gt;\n&lt;/ul&gt;&lt;div class=&quot;content-conclusion&quot;&gt;&lt;p&gt;&lt;span style=&quot;font-size: 12pt;&quot;&gt;&lt;strong&gt;Why work for Xapo?&lt;/strong&gt;&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span style=&quot;font-weight: 500; font-size: 10pt;&quot;&gt;IMPACT GLOBALLY, WORK REMOTELY.&lt;/span&gt;&lt;/p&gt;\n&lt;ul&gt;\n&lt;li style=&quot;font-weight: 500;&quot;&gt;&lt;strong&gt;Shape the Future:&lt;/strong&gt;&lt;span style=&quot;font-weight: 500;&quot;&gt; Improve lives through cutting-edge technology, work 100% remotely from anywhere in the world.&lt;/span&gt;&lt;/li&gt;\n&lt;li style=&quot;font-weight: 500;&quot;&gt;&lt;strong&gt;Great work-life balance:&lt;/strong&gt;&lt;span style=&quot;font-weight: 500;&quot;&gt; &lt;/span&gt;&lt;span style=&quot;font-weight: 500;&quot;&gt;Build amazing things with a balance of autonomy and collaborative teamwork. Set your own work schedule and make use of a flexible PTO plan when you need to recharge.&lt;/span&gt;&lt;span style=&quot;font-weight: 500;&quot;&gt;&amp;nbsp;&lt;/span&gt;&lt;/li&gt;\n&lt;li style=&quot;font-weight: 500;&quot;&gt;&lt;strong&gt;Expect Excellence:&lt;/strong&gt;&lt;span style=&quot;font-weight: 500;&quot;&gt; Collaborate, learn, and grow with a high-performance team. Learn&lt;/span&gt;&lt;span style=&quot;font-weight: 500;&quot;&gt; how you learn best - from books to conferences, you’ll get a yearly budget for your individual learning and development goals.&lt;/span&gt;&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;&lt;strong&gt;At Xapo, we prioritize consumer protection and adhere to regulatory requirements by ensuring that all Xapiens are accountable for upholding principles of fair treatment, transparency, and ethical conduct in their interactions with customers and stakeholders.&lt;/strong&gt;&lt;/p&gt;&lt;/div&gt;","tags":"[\"management\"]","pubDate":"2025-02-11T13:18:09.000Z","link":"https://job-boards.greenhouse.io/xapo61/jobs/6343705003","slug":"graduate-designer-remote-work-from-anywhere-xapo-bank-46"}]