[{"id":4076828950,"title":"QA Automation Engineer","company":"Kyivstar","image":"https://remotive.com/job/1867980/logo","description":"<div>We are looking for a QA Automation Engineer to join our Product Development Team. You will join the in-house development team, whose main responsibility is building Kyivstar’s new products. The role has all the advantages of working in a product team — versatile projects, plenty of independence, chance to influence the direction of the development and opportunity to grow with the role. </div>\n<div> </div>\n<div><strong>Required skills:</strong></div>\n<div>• 3+ years of relevant working experience;</div>\n<div>• Great knowledge of automation tools (Selenium, Appium) and Java;</div>\n<div>• JMeter, SOAP UI knowledge;</div>\n<div>• Excellent knowledge of mobile/web UI manual testing principles;</div>\n<div>• Experience of composing test strategies and test plans;</div>\n<div>• Test design techniques knowledge;</div>\n<div>• Experience in integration testing;</div>\n<div>• Basic SQL knowledge;</div>\n<div>• Basic knowledge of web front-end technologies (HTML/CSS/JS);</div>\n<div>• RESTful API — understanding of principles and experience in tests automation;</div>\n<div>• Experience working in an Agile/Scrum team;</div>\n<div>• Good knowledge of Atlassian stack (Jira, Confluence);</div>\n<div>• Excellent analytical skills, critical mindset;</div>\n<div>• Strong communication, negotiation, problem-solving and troubleshooting skills.</div>\n<div> </div>\n<div><strong>Responsibilities:</strong></div>\n<div>• Work in a cross-functional team with a product manager, analysts, developers &amp; designers to deliver digital innovations;</div>\n<div>• Test management (plan, test scenarios design, execution, follow-up, control);</div>\n<div>• Acceptance testing;</div>\n<div>• Regression testing;</div>\n<div>• Tests automation and support of existing test builds;</div>\n<div>• Testing reporting and documentation.</div>\n<div> </div>\n<div><strong>We offer:</strong></div>\n<div>• Office or remote — it's up to you: you can work from anywhere, and we will arrange your workplace</div>\n<div>• Remote onboarding</div>\n<div>• Performance bonuses for everyone (annual or quarterly — depends on the role)</div>\n<div>• We train employees: the opportunity to learn through the company’s own library, internal resources and programs from partners</div>\n<div>• Health and life insurance</div>\n<div>• Wellbeing program and corporate psychologist</div>\n<div>• Reimbursement of expenses for Kyivstar mobile communication</div>\n<div> </div>\n<img src=\"https://remotive.com/job/track/1867980/blank.gif?source=public_api\" alt=\"\"/>","tags":"[\"api\",\"CSS\",\"html\",\"java\",\"javascript\",\"scrum\",\"sql\",\"UI/UX\",\"agile\",\"automation\",\"jira\",\"product management\",\"documentation\",\"product development\",\"selenium\",\"onboarding\",\"appium\",\"troubleshooting\",\"manual testing\",\"JMeter\",\"testing\",\"REST\",\"insurance\"]","pubDate":"2023-12-27 21:21:02.000","link":"https://remotive.com/remote-jobs/qa/qa-automation-engineer-1867980","savedDate":"2023-12-29 03:54:49.332","slug":"qa-automation-engineer-kyivstar-617"},{"id":9100402890,"title":"Unreal C++ Programmer","company":"Worlds","image":"https://remotive.com/job/1874494/logo","description":"<p style=\"min-height: 1.5em;\"><strong>About Worlds.org</strong>:</p>\n<p style=\"min-height: 1.5em;\">We are a remote-first studio and R&amp;D group on the frontier of game design and development. Our team thrives on innovation, creating unparalleled tools and immersive multiplayer experiences. Using the robust and advanced Unreal Engine 5, we aim to redefine the boundaries of gaming.</p>\n<p style=\"min-height: 1.5em;\"><strong>Responsibilities</strong></p>\n<p style=\"min-height: 1.5em;\">- Implement gameplay systems in a multiplayer FPS currently in development</p>\n<p style=\"min-height: 1.5em;\">- Convert existing Blueprints to performant C++ code and optimize C++ performance</p>\n<p style=\"min-height: 1.5em;\">- Work alongside a small team of Unreal Blueprints developers<br><br><strong>Requirements</strong></p>\n<p style=\"min-height: 1.5em;\">- C++ is your strongest skill. Don't apply if you primarily use Blueprints<br><br>- You have experience using with C++ on a game that has successfully shipped</p>\n<p style=\"min-height: 1.5em;\">- You have experience with Gameplay Ability System (GAS) and ideally multiplayer replication</p>\n<p style=\"min-height: 1.5em;\">- You excel at working independently, without excessive structure or oversight</p>\n<p style=\"min-height: 1.5em;\"> </p>\n<p style=\"min-height: 1.5em;\"><strong>Compensation</strong></p>\n<p style=\"min-height: 1.5em;\">- Industry-leading compensation + equity package</p>\n<p style=\"min-height: 1.5em;\">- Accelerated promotion and senior leadership opportunities</p>\n<p style=\"min-height: 1.5em;\"><strong>What We Offer</strong>:</p>\n<ul style=\"\">\n<li style=\"\">\n<p style=\"min-height: 1.5em;\"><strong>Global Opportunity</strong>: Open to candidates worldwide.</p>\n</li>\n<li style=\"\">\n<p style=\"min-height: 1.5em;\"><strong>Innovation-Driven Environment</strong>: Work on groundbreaking projects that push the limits of what's possible in gaming.</p>\n</li>\n<li style=\"\">\n<p style=\"min-height: 1.5em;\"><strong>Remote-First Culture</strong>: Benefit from a flexible work environment that values results over hours clocked in.</p>\n</li>\n</ul>\n<p style=\"min-height: 1.5em;\"> </p>\n<p style=\"min-height: 1.5em;\"><strong>Please Note:</strong> All email communications from Worlds use the domain, <a href=\"http://Worlds.org\" rel=\"nofollow\" target=\"_blank\">Worlds.org</a>. Any mail originating from another domain claiming to represent Worlds is fraudulent. Any emails coming from the domain “<a href=\"http://worlds-jobs.org\" rel=\"nofollow\" target=\"_blank\">worlds-jobs.org</a>” are fraudulent. The Worlds hiring team only interviews candidates via Google invites from email addresses with the domain <a href=\"http://Worlds.org\" rel=\"nofollow\" target=\"_blank\">Worlds.org</a>. We will never ask a candidate to download 3rd party software to their phone or computer, nor will we ever ask a candidate for their banking information.<br>.</p>\n<img src=\"https://remotive.com/job/track/1874494/blank.gif?source=public_api\" alt=\"\"/>","tags":"[\"C++\",\"excel\",\"game design\",\"banking\"]","pubDate":"2023-12-27 15:20:26.000","link":"https://remotive.com/remote-jobs/software-dev/unreal-c-programmer-1874494","savedDate":"2023-12-29 03:54:49.332","slug":"unreal-c-programmer-worlds-5289"},{"id":6724049435,"title":"Content Writer","company":"Flashbots.net","image":"https://remotive.com/job/1876008/logo","description":"<div class=\"h1\"><strong>What we're looking for</strong></div>\n<p style=\"min-height: 1.5em;\">Flashbots is seeking a talented and motivated Writer with an interest in Ethereum, crypto, and MEV to work with us part time. This role is ideal for individuals who are curious, fast learners and demonstrate an intuitive understanding of new ideas and concepts in the fast-evolving MEV ecosystem.</p>\n<p style=\"min-height: 1.5em;\">You will work closely with various teams within Flashbots that provide you with data, insights, and perspectives to then be transformed into written content. The content should uphold high standards, maintain accuracy, and be reflective of Flashbots’ ethos. Experience in content writing is beneficial but not a requirement – we value talent and a commitment to quality above all.<br><br></p>\n<div class=\"h1\"><strong>Responsibilities</strong></div>\n<ul style=\"\">\n<li style=\"\">\n<p style=\"min-height: 1.5em;\"><strong>Data-driven content:</strong> Work closely with the data team to produce content that highlights new trends and market dynamics in the MEV landscape.</p>\n</li>\n<li style=\"\">\n<p style=\"min-height: 1.5em;\"><strong>Educational content</strong>: Produce captivating material related to our products and their benefits for various audiences. This includes educational content focused on the features, use cases, and intricacies of SUAVE. You will collaborate closely with the SUAVE team to distill their insights into written form content.</p>\n</li>\n<li style=\"\">\n<p style=\"min-height: 1.5em;\"><strong>Illuminating content:</strong></p>\n<ul style=\"\">\n<li style=\"\">\n<p style=\"min-height: 1.5em;\"><a href=\"https://collective.flashbots.net/tag/transparency-report\" rel=\"nofollow\" target=\"_blank\"><strong>Flashbots Transparency Report</strong></a>: Take the lead in compiling bi-monthly Flashbots Transparency Reports, ensuring they are informative, accurate, and engaging.</p>\n</li>\n<li style=\"\">\n<p style=\"min-height: 1.5em;\"><a href=\"https://collective.flashbots.net/tag/the-mev-letter\" rel=\"nofollow\" target=\"_blank\"><strong>The MEV Letter</strong></a><strong>:</strong> Assist with Weekly newsletters that provide a comprehensive summary of the latest research, discussions, and developments in the space.</p>\n</li>\n<li style=\"\">\n<p style=\"min-height: 1.5em;\"><strong>Events:</strong> Create content related to our events that magnify our messages, brings our community together and connect the dots to our strategic goals.<br><br></p>\n</li>\n</ul>\n</li>\n</ul>\n<div class=\"h1\"><strong>Qualifications</strong></div>\n<ul style=\"\">\n<li style=\"\">\n<p style=\"min-height: 1.5em;\"><strong>Understanding of Ethereum and MEV</strong>: You should have a general understanding of Ethereum and MEV, with a willingness and ability to rapidly expand this knowledge.</p>\n</li>\n<li style=\"\">\n<p style=\"min-height: 1.5em;\"><strong>Communication Skills</strong>: Exhibit excellent communication skills and the capability of articulating complex concepts in a clear manner. Write content that resonates with our community and encourages them to engage in continued conversation.</p>\n</li>\n<li style=\"\">\n<p style=\"min-height: 1.5em;\"><strong>Detail-oriented</strong>: Pay close attention to details, ensuring accuracy and clarity in all forms of communication.</p>\n</li>\n<li style=\"\">\n<p style=\"min-height: 1.5em;\"><strong>Collaborative Spirit</strong>: Comfortable working in a collaborative remote environment, coordinating with multiple team members across various projects.<br><br></p>\n</li>\n</ul>\n<div class=\"h1\">About Flashbots</div>\n<p style=\"min-height: 1.5em;\">Flashbots started in 2020 as a research and development organization formed to mitigate the negative externalities and existential risks posed by Maximal Extractable Value (MEV) to smart-contract blockchains, starting with Ethereum. We build products to maximally decentralize public blockchains, redistribute MEV, and empower users. We work closely with our community to ensure that our products have a positive impact, are secure, and can be used in production at scale.<br><br></p>\n<div class=\"h2\">Our Impact</div>\n<p style=\"min-height: 1.5em;\">Since the launch of Flashbots, we have had an immense impact on the world of cryptocurrency. The Flashbots Auction was launched in alpha in January 2021 and was quickly adopted by almost all Ethereum miners. Prior to Ethereum's Merge in 2022, Flashbots launched MEV-Boost, a temporary solution for out-of-protocol proposer-builder separation. MEV-Boost has since been adopted by over 90% of Ethereum validators and has significantly influenced the Ethereum PoS ecosystem. Now, Flashbots continues its journey with the introduction of MEV-Share as we continue our journey toward SUAVE.<br><br></p>\n<div class=\"h2\">Our Research</div>\n<p style=\"min-height: 1.5em;\">Flashbots Research is an independent arm of the organization that aims to become the hub of MEV research. In addition to conducting in-house analysis, Flashbots Research collaborates with external researchers at other institutions via an external grants program. Flashbots Research continues to publish seminal research on MEV, covering a wide range of topics including cross-chain MEV, EIP1559 and MEV, how ETH2 affects MEV, SGX and privacy, and more. For a full list of publications, visit <a href=\"http://writings.flashbots.net\" rel=\"nofollow\" target=\"_blank\">writings.flashbots.net</a>.<br><br></p>\n<div class=\"h2\">Why Flashbots?</div>\n<ul style=\"\">\n<li style=\"\">\n<p style=\"min-height: 1.5em;\">Competitive salary</p>\n</li>\n<li style=\"\">\n<p style=\"min-height: 1.5em;\">Significantly above market rate equity compensation package</p>\n</li>\n<li style=\"\">\n<p style=\"min-height: 1.5em;\">Unlimited PTO with a high level of freedom and autonomy for your work</p>\n</li>\n<li style=\"\">\n<p style=\"min-height: 1.5em;\">Attractive health cover package for US employees</p>\n</li>\n<li style=\"\">\n<p style=\"min-height: 1.5em;\">Yearly budget for your individual learning and development goals</p>\n</li>\n<li style=\"\">\n<p style=\"min-height: 1.5em;\">Work alongside the brightest minds in the crypto space</p>\n</li>\n<li style=\"\">\n<p style=\"min-height: 1.5em;\">Help build the future of blockchain technology</p>\n</li>\n<li style=\"\">\n<p style=\"min-height: 1.5em;\">Remote working - travel and work from anywhere in the world</p>\n</li>\n<li style=\"\">\n<p style=\"min-height: 1.5em;\">Paid travel - team on-sites in different parts of the world, several times a year</p>\n</li>\n</ul>\n<p style=\"min-height: 1.5em;\">At Flashbots, we are committed to building a diverse and inclusive team. We welcome applications from all qualified candidates regardless of their gender, race, ethnicity, religion, sexual orientation, age, or disability status.</p>\n<img src=\"https://remotive.com/job/track/1876008/blank.gif?source=public_api\" alt=\"\"/>","tags":"[\"crypto\",\"blockchain\",\"research\",\"Ethereum\",\"travel\"]","pubDate":"2023-12-27 13:20:18.000","link":"https://remotive.com/remote-jobs/writing/content-writer-1876008","savedDate":"2023-12-29 03:54:49.332","slug":"content-writer-flashbots-net-7129"},{"id":7433204587,"title":"Interior Designer","company":"Wander","image":"https://remotive.com/job/1874102/logo","description":"<p style=\"min-height: 1.5em;\">$40k USD</p>\n<p style=\"min-height: 1.5em;\">Anywhere in the world</p>\n<p style=\"min-height: 1.5em;\">***Ability to create 3D renders</p>\n<p style=\"min-height: 1.5em;\"> </p>\n<p style=\"min-height: 1.5em;\"><strong>Job Title: Interior Designer (3D Rendering Specialist)</strong></p>\n<p style=\"min-height: 1.5em;\">We are seeking a talented and creative Interior Designer with a specialized skill set in 3D rendering to join our team. If you have a passion for turning concepts into immersive visual experiences, we invite you to apply for this exciting opportunity.</p>\n<p style=\"min-height: 1.5em;\"><strong>Position Overview:</strong></p>\n<p style=\"min-height: 1.5em;\">As an Interior Designer with a focus on 3D rendering, you will play a pivotal role in bringing our clients' visions to life. You will collaborate with our design team to conceptualize and execute interior design projects, utilizing your expertise in creating detailed and realistic 3D renders. The ideal candidate will have a keen eye for design aesthetics, a strong understanding of spatial relationships, and the ability to translate 2D concepts into compelling 3D visualizations.</p>\n<p style=\"min-height: 1.5em;\"><strong>Key Responsibilities:</strong></p>\n<p style=\"min-height: 1.5em;\">1. <strong>Conceptualization and Design:</strong> Collaborate with home owners and the home setup team to understand project requirements and objectives. Generate creative design concepts that align with client preferences and project goals.</p>\n<p style=\"min-height: 1.5em;\">2. <strong>3D Rendering:</strong> Utilize advanced 3D rendering software and tools to create detailed and realistic visualizations of interior spaces. Provide clients with immersive and accurate depictions of proposed designs.</p>\n<p style=\"min-height: 1.5em;\">3. <strong>Material and Color Selection:</strong> Assist in selecting appropriate materials, finishes, and color schemes based on design concepts and client preferences. Ensure that design elements harmonize and create cohesive, visually appealing spaces.</p>\n<p style=\"min-height: 1.5em;\">4. <strong>Presentation:</strong> Prepare and deliver compelling presentations to clients, showcasing 3D renders and design concepts. Effectively communicate design ideas and modifications based on client feedback.</p>\n<p style=\"min-height: 1.5em;\">5. <strong>Collaboration:</strong> Work closely with architects, contractors, and other stakeholders to ensure seamless integration of design concepts into the construction and implementation phases of projects.</p>\n<p style=\"min-height: 1.5em;\">6. <strong>Stay Current with Trends:</strong> Stay abreast of industry trends, emerging technologies, and new design tools to continually enhance the quality and innovation of our design work.</p>\n<p style=\"min-height: 1.5em;\"><strong>Qualifications:</strong></p>\n<p style=\"min-height: 1.5em;\">1. Bachelor's degree in Interior Design or a related field.</p>\n<p style=\"min-height: 1.5em;\">2. Proven experience as an Interior Designer with a strong portfolio of 3D rendering projects.</p>\n<p style=\"min-height: 1.5em;\">3. Proficient in 3D rendering software such as Autodesk 3ds Max, SketchUp, or similar tools.</p>\n<p style=\"min-height: 1.5em;\">4. Strong visual and spatial awareness, with a keen eye for design aesthetics.</p>\n<p style=\"min-height: 1.5em;\">5. Excellent communication and presentation skills.</p>\n<p style=\"min-height: 1.5em;\">6. Ability to manage multiple projects and deadlines simultaneously.</p>\n<p style=\"min-height: 1.5em;\">7. Detail-oriented and committed to delivering high-quality work.</p>\n<p style=\"min-height: 1.5em;\"><strong>How to Apply:</strong></p>\n<p style=\"min-height: 1.5em;\">If you are passionate about interior design, possess exceptional 3D rendering skills, and thrive in a collaborative environment, we encourage you to apply!</p>\n<p style=\"min-height: 1.5em;\"> </p>\n<img src=\"https://remotive.com/job/track/1874102/blank.gif?source=public_api\" alt=\"\"/>","tags":"[\"3ds Max\",\"interior design\"]","pubDate":"2023-12-27 09:20:50.000","link":"https://remotive.com/remote-jobs/design/interior-designer-1874102","savedDate":"2023-12-29 03:54:49.333","slug":"interior-designer-wander-8753"},{"id":8750949854,"title":"Customer Support Associate, Italian","company":"SquareSpace","image":"https://remotive.com/job/1874712/logo","description":"<p>At Squarespace, Customer Operations empowers users to give voice to their ideas and make it easy for them when they need help. Our team runs 24/7 with about 400 people between New York, Dublin, Portland and a remote workforce. Customer Support Associates are on the front lines working with our customers every day to ensure that issues with their accounts are resolved promptly. You will use your system knowledge and commitment to delivering an exceptional customer experience to solve problems for our users but advocate for our brand.</p>\n<p>This remote role reports to a Customer Support Team Lead in Dublin Ireland. You will begin on January 29, 2024. You must have both spoken and written fluency in English and Italian.</p>\n<div class=\"h2\">You'll Get To…</div>\n<ul style=\"\">\n<li style=\"\">Respond to customer-submitted live chats and emails in a timely manner</li>\n<li style=\"\">Queue-based, typing work will account for approximately 90% of the role.</li>\n<li style=\"\">Live Chat is our primary channel of support in this role.</li>\n<li style=\"\">Troubleshoot and guide customers through questions and issues with their Account, Billing, or other transactional inquiries</li>\n<li style=\"\">Independently meet targets across Quality, Productivity and Customer Satisfaction, in email and live chat.</li>\n<li style=\"\">Stay up to date on new product features and improvements</li>\n<li style=\"\">Identify isolated customer experiences and escalate important issues.</li>\n</ul>\n<div class=\"h2\">Who We're Looking For</div>\n<ul style=\"\">\n<li style=\"\">Open availability to work a 40 hour work week that spans weekends and holidays as our customers need us.</li>\n<li style=\"\">Bilingual fluency in English and Italian</li>\n<li style=\"\">1+ years customer-facing experience required in a similar role (retail, hospitality, online support).</li>\n<li style=\"\">Expertise with written communication and the ability to spot spelling and grammar errors.</li>\n<li style=\"\">Proficiency with decoding conversations, identifying the cause, and aligning on end goals.</li>\n<li style=\"\">Capability of prioritizing competing requests.</li>\n<li style=\"\">Familiarity with the Squarespace platform.</li>\n<li style=\"\">Consistent and dependable WiFi and a personal workspace that allows you to be free from distraction and fully customer focused</li>\n</ul>\n<div class=\"h2\">Benefits &amp; Perks</div>\n<ul style=\"\">\n<li style=\"\">Health insurance with 100% covered premiums for you and your dependent children</li>\n<li style=\"\">Fertility and adoption benefits</li>\n<li style=\"\">Headspace mindfulness app subscription</li>\n<li style=\"\">Retirement benefits with employer match</li>\n<li style=\"\">Flexible paid time off</li>\n<li style=\"\">Up to 20 weeks of paid family leave</li>\n<li style=\"\">Equity plan for all employees</li>\n<li style=\"\">Commuter benefit in the form of reduced tax</li>\n<li style=\"\">Education reimbursement</li>\n<li style=\"\">Employee donation match to community organizations</li>\n<li style=\"\">6 Global Employee Resource Groups (ERGs)</li>\n<li style=\"\">Free lunch and snacks</li>\n<li style=\"\">Close proximity to cultural landmarks such as Dublin Castle and St. Patrick's Cathedral</li>\n</ul>\n<div class=\"h2\">About Squarespace</div>\n<p>Squarespace (NYSE: SQSP) is a design-driven platform helping entrepreneurs build brands and businesses online. We empower millions of customers in more than 200 countries and territories with all the tools they need to create an online presence, build an audience, monetize, and scale their business. Our suite of products range from websites, domains, ecommerce, and marketing tools, as well as tools for scheduling with Acuity, creating and managing social media presence with Bio Sites and Unfold, and hospitality business management via Tock. Our team of more than 1,700 is headquartered in bustling New York City, with offices in Chicago, Dublin, Ireland, Aveiro, Portugal, and coworking spaces in the UK, Netherlands, and Australia. For more information about our company culture, visit <a href=\"%22http:/www.squarespace.com/about/careers%22\" rel=\"nofollow\" target='\"_blank\"'>www.squarespace.com/about/careers</a>.</p>\n<div class=\"h2\">Our Commitment</div>\n<p>Today, more than a million people around the globe use Squarespace to share different perspectives and experiences with the world. Not only do we embrace and celebrate the diversity of our customers, but we also work toward the same in our employees. At Squarespace, we are committed to equal employment opportunity regardless of race, color, ethnicity, ancestry, religion, national origin, gender, sex, gender identity or expression, sexual orientation, age, citizenship, marital or parental status, disability, veteran status, or other class protected by applicable law. We are proud to be an equal opportunity workplace.</p>\n<div class='\"content-conclusion\"'>\n<p><strong>Thank you in advance for providing the following details about your work history from your resume! This helps us ensure that your candidate information is accurate and consistent during the hiring process.</strong></p>\n</div>\n<img src=\"https://remotive.com/job/track/1874712/blank.gif?source=public_api\" alt=\"\"/>","tags":"[\"ecommerce\",\"social media\",\"retail\",\"chat\",\"team lead\",\"diversity\",\"insurance\"]","pubDate":"2023-12-26 07:20:16.000","link":"https://remotive.com/remote-jobs/customer-support/customer-support-associate-italian-1874712","savedDate":"2023-12-29 03:54:49.333","slug":"customer-support-associate-italian-squarespace-8174"},{"id":3772395628,"title":"Senior Kernel Developer for KernelCare - REMOTE/Work Anywhere","company":"CloudLinux","image":"https://pbs.twimg.com/profile_images/696718028084482050/ymY3OEPk_400x400.png","description":"<p>We are looking for <strong>Senior Kernel Developers</strong> to work on our KernelCare team. The ideal candidate is someone looking for a rewarding and challenging career developing Linux Kernels and patches. This role requires someone with strong C development skills and a passion for all that is Linux. Our Kernel Developers create patches with a cyber security focus while finding solutions for our customers. Please note, this is <strong>not</strong> an embedded Kernel role.  </p><p>KernelCare is a product of CloudLinux Inc., the maker of the #1 OS in security and stability for hosting providers. KernelCare, a live kernel patching service provides security patches and bug fixes for a range of popular Linux kernels that can be installed without rebooting the system. Check out our website for more information about our KernelCare Product <a href=\"https://tuxcare.com/live-patching-services/\" rel=\"nofollow noreferrer noopener\" class=\"external\">https://tuxcare.com/live-patching-services/</a></p><p></p><p>We are truly a great place to work. </p><p><strong>As our Senior Kernel Developer, you will be responsible for:</strong></p><ul> <li>Support existing functionality and implementation of several new features</li> <li>Update existing kernels including security fixes and CVEs patches</li> <li>Develop and support Python and Bash scripts for task automation</li> </ul><h3>Requirements: </h3><p><strong>To be successful in this role you should have:</strong></p><ul> <li>Excellent C programming and debugging skills</li> <li>Good level knowledge of Linux kernel core subsystems</li> <li>CPU and cache architectures</li> <li>Experience with GDB and other debuggers</li> <li>CPU performance and power analysis</li> <li>Independent and self-motivated problem solver and strategic thinker</li> <li>Proficient in Git for development and patch/branch management</li> <li>Good planning, time management, decision-making, presentation, and organization skills</li> <li>Effective written and verbal communication</li> <li>Excellent interpersonal and teamwork skills</li> <li>Happy in an agile, fast-paced environment</li> </ul><ul> <li>Experience with python, shell scripting</li> <li>Experience with Jenkins</li> </ul><h3>Benefits: </h3><p><strong>What's in it for you?</strong><br></p><ul> <li>A focus on professional development; </li> <li>Interesting and challenging projects</li> <li> Flexible working hours</li> <li>Paid one month vacation per year and unlimited sick leave</li> <li>Medical insurance reimbursement</li> <li>Co-working and gym/sports reimbursement</li> <li>The opportunity to receive a reward for the most innovative idea that the company can patent</li> </ul><p></p><p><em>By applying for this position, you agree with </em><a href=\"https://cloudlinux.com/privacy-policy\" rel=\"nofollow noreferrer noopener\" class=\"external\"><em>Cloudlinux Privacy Policy</em></a><em> and give us your consent to maintain and process your personal data with this respect. Please read our Privacy Policy for more information.</em></p>","tags":"[\"management\",\"cyber security\"]","pubDate":"2023-12-26 00:00:00.000","link":"https://apply.workable.com/cloudlinux-1/j/85CE5A906B","savedDate":"2023-12-29 03:54:49.333","slug":"senior-kernel-developer-for-kernelcare-remote-work-anywhere-cloudlinux-6053"}]