[{"id":6981846561,"title":"Senior Web Engineer","company":"10up","image":"https://pbs.twimg.com/profile_images/2738508979/760be3edebfa0195e36fb3dba07297c1_400x400.png","description":"<div class=\"section page-centered\" data-qa=\"job-description\"><div><b style=\"font-size: 18px\">Location: Remote - Anywhere</b> (Open to applicants located anywhere around the globe.)</div><div>&nbsp;</div><div>At 10up, we call developers like you engineers because you aren’t just a “coder”: you’re an innovative problem solver that uses web programming skills to divine smart, creative solutions to client challenges. As a Senior Web Engineer at 10up, you are an integral part in building websites and solutions utilized by millions of people daily. 10uppers have been pushing the boundaries of WordPress for over 12 years—become an engineer that innovates the internet by building exciting projects alongside a top-in-the-field team.</div><div><br></div><div>You’ll work on a combination of unique projects and ongoing support engagements that help season your skills. As a leading digital agency, 10up’s client roster spans from innovative startups and impactful non-profits to some of the biggest names in the industry, such as ESPN, Google, The New York Times Co., Microsoft, and The Nobel Prize Committee.</div><div><br></div><div>As a 10upper, you have options for flexible and alternative work schedules. Intentionally remote since day one, spanning six continents and 40 countries, 10up fully embraces the benefits of distributed work.</div></div><div class=\"section page-centered\"><div><h3>What you will do: </h3><ul class=\"posting-requirements plain-list\"><ul><li>Develop enterprise-level WordPress plugins and/or themes primarily using PHP and Gutenberg blocks in React.js.</li><li>Support learning by mentoring other fellow engineers and providing code reviews.</li><li>Drive strategy and lead back-end technical vision on large-scale projects.</li><li>Solve complex problems in simple yet elegant ways.</li><li>Ultimately you will make the web better by finely crafting websites, apps, and tools that reach millions of online visitors every day.</li></ul></ul></div></div><div class=\"section page-centered\"><div><h3>About you: </h3><ul class=\"posting-requirements plain-list\"><ul><li>You love perfecting your skills in WordPress engineering and Gutenberg.</li><li>You have experience supporting headless JavaScript projects with WordPress.</li><li>You have a code portfolio. Link us to your best WordPress work on GitHub and you’ll never have to do any live coding or whiteboard testing!&nbsp;</li><li>You are comfortable talking to clients and team members to clearly present your thoughts.</li><li>You have extensive Git workflow experience in back-end-focused web development.</li><li>You have the ability to expertly debug performance and caching issues.</li><li>You prefer to work fully remote and are effective at engaging in a distributed team from the location of your choosing.</li></ul></ul></div></div><div class=\"section page-centered\"><div><h3>Benefits of interest:</h3><ul class=\"posting-requirements plain-list\"><ul><li>Multiple paid time off programs, including accrued PTO, parental leave, bereavement leave, and company holidays – including an all-company break from Christmas Eve to New Years Day.</li><li>Health, dental, and life insurance programs (available for United States team members).</li><li>Retirement contribution programs (currently available in the U.S. and U.K.).Flexible and alternate schedule programs - including options for 4-day work week (Monday-Thursday) configurations.</li><li>$3,000 USD accrued annually in professional development budget for you to spend on conferences, training, or to buy back time for programs like independent study.</li><li>Global Company summits – opportunities to meet, socialize and learn with fellow 10uppers in person at remarkable destinations.&nbsp;</li><li>An end-of-year all-hands bonus program, along with smaller opportunities for recognition throughout the year.</li><li>A Director of Engineering that supports your career growth and development.</li></ul></ul></div></div><div class=\"section page-centered\"><div><h3></h3><ul class=\"posting-requirements plain-list\"><ul><li>If you are passionate about 10up's mission and think you have what it takes to be successful in this role even if you don't check all the boxes, please apply. We'd appreciate the opportunity to personally review your application. Everyone gets a response. Read more about <a href=\"https://drive.google.com/file/d/1nQ9yWRqfDAdrriYRnBNzYo7w59auYxMe/view\" class=\"postings-link\">What to Expect</a> through our Recruiting process.</li><li>We don't want you to miss any communication from us! To ensure you receive updates on your application, please add&nbsp;<b><a href=\"mailto:jobs@10up.com\" class=\"postings-link\">jobs@10up.com</a></b>&nbsp;to your contacts list! #LI-Remote</li></ul></ul></div></div><!--[2022-11-28] [GOLD-2535] Remove payTransparencyV1 when feature flag is fully removed--><div class=\"section page-centered\" data-qa=\"salary-range\"><div>$60,000 - $120,000 a year</div></div><div class=\"section page-centered\" data-qa=\"closing-description\"><div><b style=\"font-size: 18px\">Join our team!&nbsp;</b></div><div><br></div><div>If you are passionate about 10up's mission and think you have what it takes to be successful in this role even if you don't check all the boxes, please apply. If you consider yourself a Full-Stack Engineer, please choose the discipline and job title that most closely aligns with your focus/primary area of expertise. We personally review each application and can always pivot roles after you enter the hiring process. </div><div><br></div><div>Read more about <a href=\"https://drive.google.com/file/d/1nQ9yWRqfDAdrriYRnBNzYo7w59auYxMe/view\" class=\"postings-link\">What to Expect </a>through our Recruiting process.</div><div><br></div><div>Everyone gets a response and we don't want you to miss any communication from us! To ensure you receive updates on your application, please add jobs@10up.com to your contacts list! #LI-Remote</div></div><div class=\"section page-centered last-section-apply\" data-qa=\"btn-apply-bottom\"><a class=\"postings-btn template-btn-submit hex-color\" data-qa=\"show-page-apply\" href=\"https://jobs.lever.co/10up-2/2445a3ee-a695-4983-8cc5-792f0ff5ad7b/apply\">Apply for this job</a></div>","tags":"[\"javascript\",\"engineering\"]","pubDate":"2023-12-19 16:33:09.821","link":"https://jobs.lever.co/10up-2/2445a3ee-a695-4983-8cc5-792f0ff5ad7b","savedDate":"2023-12-19 16:33:09.821","slug":"senior-web-engineer-10up-2661"},{"id":6537754937,"title":"\n            Senior UX Writer\n          ","company":"DuckDuckGo","image":"https://spreadprivacy.com/content/images/2023/05/duckduckgo-logo_wide.png","description":"\n            <p>Hi, we’re DuckDuckGo, the Internet privacy company for everyone who wants to take back their privacy now. For over a decade, we've been building our all-in-one product, developing new privacy technology, and working with policymakers to make online privacy simple and accessible for all.<br></p>\n<p><br></p>\n<p>Our app is now downloaded more than 75M times a year, and our private search engine packaged with it has become the #2 search engine on mobile in over 21 countries, including the United States, United Kingdom, Canada, Australia, Germany, and the Netherlands. Oh, and we've been profitable since 2014 with revenue currently exceeding $100 million a year! Now, we’re rolling out a suite of new privacy solutions, including <u><a href=\"https://www.spreadprivacy.com/introducing-email-protection-beta/\" rel=\"noopener\">Email Protection</a></u>,  <u><a href=\"https://spreadprivacy.com/introducing-app-tracking-protection/\" rel=\"noopener\">App Tracking Protection</a></u> and our first-ever Desktop Apps for <u><a href=\"https://spreadprivacy.com/introducing-duckduckgo-for-mac/\" rel=\"noopener\">Mac</a></u><a href=\"https://spreadprivacy.com/introducing-duckduckgo-for-mac/\" rel=\"noopener\"> </a>and Windows.</p>\n<p><br></p>\n<p>We’re looking for a <strong>Senior UX Writer</strong> to help shape our all-in-one privacy solution and join our mission to show the world that protecting your privacy online can be simple.  </p>\n<p><br></p>\n<p><strong>The Opportunity</strong> </p>\n<p>In this role, you'll work closely with design, engineering, user insights, product, and legal teams to shape the DuckDuckGo product and brand experience, continuing to build the trust we’ve earned with users over the last decade and helping DuckDuckGo grow. </p>\n<p><br></p>\n<p>You'll encourage users to adopt and retain our products by developing clear, concise copy that elegantly transforms complex UX problems into opportunities for user action and education. As a company-wide authority on copy dilemmas, large and small, you'll manage multiple content projects simultaneously, validating content decisions through user research, reasoning, and data. </p>\n<p><br></p>\n<p><strong>What You Will Bring to DuckDuckGo</strong> </p>\n<ul>\n<li>At least four years of UX writing experience. </li>\n<li>Ability to lead and collaborate on high-impact and complex projects from proposal through postmortem.  </li>\n<li>Skills to wrangle vague problems, propose innovative solutions, and execute them with a strong focus on metrics. </li>\n<li>Proven success in moving product, design, and brand team KPIs through increased user adoption, retention, and engagement. </li>\n<li>Ability to translate product and brand goals into words that empower users to take action across platforms. </li>\n<li>Unyielding dedication to empathy and simplicity when finding the right words to help users understand technical concepts. </li>\n<li>A thorough understanding of how to refine and optimize short-form content via collaboration, user testing, and experimentation. </li>\n<li>Experience collaborating with experts across functions, including design, legal, engineering, and partnerships to distill requirements and validate direction.</li>\n<li>A well-defined, battle-tested, and flexible creative writing process. </li>\n<li>Grammatical excellence, expertise, and agility with the English language, with a vast vocabulary and deep understanding of style, diction, and structure.</li>\n</ul>\n<p><strong>How We Will Support You</strong><br></p>\n<p>Our core values — build trust, question assumptions, and validate direction — underpin how we work day-to-day and the support we give our team members. We strive to empower our team members to be self-directed and self-motivated in their work.  <br></p>\n<ul>\n<li>\n<strong>Remote-First, Always</strong>: We've always been a fully distributed company with team members all over the world. We trust you to get your work done wherever, whenever.   </li>\n<li>\n<strong>Commitment to Personal Growth:</strong> Every team member has an annual budget of $1,250 USD to invest in their professional development. Every team member also has a dedicated Career Advisor, who serves as a guide to help you develop your strengths, identify your motivations, and understand your opportunities for growth. </li>\n<li>\n<strong>Leadership:</strong> We have many different types of leaders and possible combinations of leadership roles, so you can grow your career in a way that aligns best with your personal goals. You can seek additional leadership roles by being directly responsible for projects, taking ownership of areas of the company, developing and maintaining internal processes, or pursuing advisory roles. </li>\n<li>\n<strong>Work/Life Balance: </strong>Team members have the freedom and flexibility to organize their own work schedules. We want you to thrive both in and out of the office. We trust you to use good judgment and take the time off that you need to bring your best self to work.  </li>\n</ul>\n<p><br></p>\n<p>We also offer paid parental leave, a co-working stipend, office setup reimbursement, and a wellness stipend. More support resources can be found in our <u><a href=\"https://duckduckgo.com/assets/hiring/team_support_guide.pdf\" rel=\"noopener\">Team Member Support Guide</a></u>, which explains how we make your well-being a priority. </p>\n<p><br></p>\n<p>For more information on how we collaborate worldwide, from leadership in our relatively flat organization to start-to-finish ownership<strong>,</strong> check out <u><a href=\"https://duckduckgo.com/assets/hiring/how_we_work.pdf\" rel=\"noopener\">DuckDuckGo Culture: How We Work.</a></u> </p>\n<p><br></p>\n<p><strong>Compensation</strong> </p>\n<p>Annual compensation: $176,000&nbsp;USD and stock options. Compensation is the same within a professional level, regardless of geographic location or functional area, and the compensation for each professional level is transparent across the organization.</p>\n<p><br></p>\n<p><strong>Hiring Process</strong> </p>\n<p>Hiring works best when it's a two-way street. Learn how we help you get to know DuckDuckGo and envision your future role here. Find out more about <u><a href=\"https://duckduckgo.com/assets/hiring/how_we_hire.pdf\" rel=\"noopener\">how we hire</a></u>. </p>\n<p><br></p>\n<p><strong>Diversity, Equity, and Inclusion</strong> </p>\n<p>DuckDuckGo provides equal work opportunities to all team members and applicants<u>,</u> and it prohibits discrimination and harassment of any type on the basis of race, color, ethnicity, caste, religion, age, sex (including pregnancy), national origin, disability status, genetics, protected veteran status, sexual orientation, gender identity or expression, or any other characteristic protected by our policies or federal, state, or local laws.</p>\n<p><br></p>\n<p>We want to ensure that our hiring process is accessible. If you need reasonable accommodation for any part of the application process because of a medical condition or disability, please send an email to <u><a href=\"mailto:careers@duckduckgo.com\" rel=\"noopener\">careers@duckduckgo.com</a></u> to let us know the nature of your request.  </p>\n<p><br></p>\n<p>If you think you might thrive in this environment, we would love to hear from you. </p>\n<p><br></p>\n<p><strong>Please note that:</strong> </p>\n<ol>\n<li>Sometimes we meet up! Expect to travel at least two times a year: once for our all-hands meetup and again for a team retreat (each around 4-5 days). While extenuating circumstances may impact attendance, everyone is strongly encouraged to attend.</li>\n<li>While we offer a flexible work arrangement with no core hours, expect an average full-time commitment of 40 hours per week. </li>\n<li>A successful candidate will be subject to a background check and must receive satisfactory results of the same, as a condition of joining the team. </li>\n<li>By applying for this role, you confirm that all information submitted is accurate and complete. You further acknowledge that providing false or fraudulent information during the application process is cause for denial of an offer, revocation of any existing offer, or other adverse action, up to and including termination after the start of your commencement of work.  </li>\n</ol>\n<p><br></p>\n          ","tags":"[\"engineering\",\"legal\",\"aws\"]","pubDate":"2023-12-19 16:33:09.820","link":"https://duckduckgo.recruitee.com/o/senioruxwriter","savedDate":"2023-12-19 16:33:09.820","slug":"senior-ux-writer-duckduckgo-10"},{"id":8005053708,"title":"Senior Frontend Developer (JS, Typescript, React)","company":"Status","image":"https://pbs.twimg.com/profile_images/966759182589308928/s5rZXoWk_400x400.jpg","description":"\n    <div class=\"content-intro\"><p style=\"text-align: justify;\"><strong>About Status</strong></p>\n<p style=\"text-align: justify;\"><span style=\"font-weight: 400;\">Status is building the tools and infrastructure for the advancement of a secure, private, and open web3.&nbsp;</span></p>\n<p style=\"text-align: justify;\"><span style=\"font-weight: 400;\">With the high level goals of preserving the right to privacy, mitigating the risk of censorship, and promoting economic trade in a transparent, open manner, Status is building a community where anyone is welcome to join and contribute.</span></p>\n<p style=\"text-align: justify;\"><span style=\"font-weight: 400;\">As an organization, Status seeks to push the web3 ecosystem forward through research, creation of developer tools, and support of the open source community.&nbsp;</span></p>\n<p style=\"text-align: justify;\"><span style=\"font-weight: 400;\">As a product, Status is an open source, Ethereum-based app that gives users the power to chat, transact, and access a revolutionary world of DApps on the decentralized web. But Status is also building foundational infrastructure for the whole Ethereum ecosystem, including the Nimbus ETH 1.0 and 2.0 clients, the Keycard hardware wallet, and the Waku messaging protocol; the p2p communication layer for Web3.</span></p>\n<p style=\"text-align: justify;\"><span style=\"font-weight: 400;\">As a team, Status has been completely distributed since inception.&nbsp; Our team is currently 200+ core contributors strong, and welcomes a growing number of community members from all walks of life, scattered all around the globe.&nbsp;</span></p>\n<p style=\"text-align: justify;\"><span style=\"font-weight: 400;\">We care deeply about open source, and our organizational structure has minimal hierarchy and no fixed work hours. We believe in working with a high degree of autonomy while supporting the organization's priorities.</span></p></div>\n\n    <div class=\"careers-block__trix external-panel text-left\">\n<p><strong>The role:</strong></p>\n<p>We are looking for an experienced React developer to join a small, fully asynchronous team, who will take ownership of certain web-related areas at Status. Your role will not only involve translating high-level designs into production-ready UI, but also collaborating with colleagues across the stack to deliver new features.&nbsp;</p>\n<p>Our stack is built on modern foundations – a monorepo powered by TypeScript, React, Storybook, Vite, Vitest, Playwright, ESLint, Prettier, Yarn Workspaces, and Turborepo. As we work in the open and are fully open-source, you can get a better idea of who we are and the work we are doing by browsing our <a href=\"https://github.com/status-im/status-web\">Status Web</a> repository. We strive to build solid foundations that will enable us to continuously make progress. We don't expect you to have a background in everything we use, but we do expect strong JavaScript fundamentals and experience working with React and TypeScript.</p>\n<p>We function as generalists, often undertaking a variety of challenges, and deeply care about the quality of our work. We look forward to collaborating with experienced individuals who can operate independently, make important decisions, and take ownership.</p>\n<p><strong>Key responsibilities:&nbsp;</strong></p>\n<ul>\n<li>Building new features with beautiful and scalable UI components from start to finish</li>\n<li>Building and maintaining the new React implementation of Status’ design system</li>\n<li>Collaborating with other people across the teams</li>\n<li>Gathering feedback from users and developers to better understand their needs</li>\n</ul>\n<p><strong>You ideally will have:</strong></p>\n<ul>\n<li>Clear and effective communication skills, both verbally and written</li>\n<li>Thoughtful and pragmatic problem-solving</li>\n<li>5+ years of software engineering experience, with 3+ years of experience with React</li>\n<li>Experience writing modern, performant, and accessible React code&nbsp;</li>\n<li>Strong knowledge of JavaScript, and ideally TypeScript</li>\n<li>Prior experience creating a component library</li>\n</ul>\n<p><strong>Hiring process:</strong></p>\n<p><em>The steps may change along the way if we see it makes sense to adapt the interview stages, so please consider the above as a guideline.&nbsp;</em></p>\n<ul>\n<li>Call with Talent</li>\n<li>Technical interview&nbsp;</li>\n<li>Paid task</li>\n<li>Technical interview</li>\n<li>Final interview</li>\n</ul>\n<p><strong>Compensation:</strong></p>\n<p>The expected compensation range for this role is negotiable, dependent on how we assess your skills and experience throughout our interview process. We are happy to pay in any mix of fiat/crypto.</p>\n</div>\n\n    \n\n    \n","tags":"[\"javascript\",\"typescript\",\"engineering\"]","pubDate":"2023-12-19 16:33:09.820","link":"https://boards.greenhouse.io/embed/job_app?for=status72&token=5567968&b=https%3A%2F%2Fjobs.status.im%2F","savedDate":"2023-12-19 16:33:09.820","slug":"senior-frontend-developer-js-typescript-react-status-1134"},{"id":3622961107,"title":"Ecosystem Marketing Associate","company":"Fuel Labs","image":"https://remotive.com/job/1862980/logo","description":"<div><strong>About Fuel</strong></div>\n<div>Fuel is building a high-performance blockchain operating system that provides high throughput without sacrificing decentralisation or security. Our project is a full-stack solution that lets anyone deploy a Fuel chain using any configuration they would like (Rollup on Ethereum, Sovereign chain, Appchain, etc.). Our focus is to launch an Ethereum rollup to help scale Ethereum beyond its current capacity.</div>\n<div> </div>\n<div><strong>Working at Fuel</strong></div>\n<div>Fuel is remote first and globally distributed, with English as our primary language for communication. We are looking for self-starters who are excited about working in a fast-paced startup environment. We do not require contributors to live in specific time zones, but much of the team lives and works in the European and US time zones. Contributors should endeavour to make themselves available as needed for scheduled team and company events.</div>\n<div> </div>\n<p><br><br></p>\n<div class=\"h3\">Responsibilities</div>\n<ul style=\"\">\n<li style=\"\">Ecosystem Strategy: Develop and execute a comprehensive marketing strategy to foster engagement, growth, and advocacy within our blockchain ecosystem.</li>\n</ul>\n<ul style=\"\">\n<li style=\"\">Co-marketing: Manage co-marketing needs from our grantees, partners and ecosystem.</li>\n</ul>\n<ul style=\"\">\n<li style=\"\">Co-branding: Make sure all Fuel ecosystem projects have the correct Fuel brand assets and messaging across their channels.</li>\n</ul>\n<ul style=\"\">\n<li style=\"\">Co-marketing activities: Initiate and support ecosystem co-marketing activities, such as Twitter Spaces, Announcements, Blog posts, Guild missions, and more.</li>\n</ul>\n<ul style=\"\">\n<li style=\"\">Content Creation: Lead the creation of compelling and educational content about the Fuel Ecosystem by engaging with the community of Fuel Ecosystem Partners and developers</li>\n</ul>\n<ul style=\"\">\n<li style=\"\">Partnership Marketing: Collaborate with strategic partners and influencers to amplify our reach, creating mutually beneficial marketing campaigns that drive ecosystem growth.</li>\n</ul>\n<ul style=\"\">\n<li style=\"\">Analytics and Reporting: Monitor and analyze key performance metrics to assess the impact of marketing initiatives, providing insights for continuous improvement and staying on top trends for marketing tools and styles will be important.</li>\n</ul>\n<p><br><br></p>\n<div class=\"h3\">Requirements</div>\n<ul style=\"\">\n<li style=\"\">Proven experience in marketing, with a focus on ecosystem or community marketing within the blockchain or tech industry.</li>\n</ul>\n<ul style=\"\">\n<li style=\"\">Strong understanding of blockchain technology and its applications, with the ability to communicate complex concepts effectively.</li>\n</ul>\n<ul style=\"\">\n<li style=\"\">Exceptional written and verbal communication skills, with an eye for storytelling and ability to differentiate tonality.</li>\n</ul>\n<ul style=\"\">\n<li style=\"\">Structured, with a demonstrated ability to manage multiple relationships and stakeholders simultaneously. </li>\n</ul>\n<ul style=\"\">\n<li style=\"\">Experience in managing social media platforms and executing successful marketing campaigns.</li>\n</ul>\n<ul style=\"\">\n<li style=\"\">Demonstrated success in managing partnerships and relationships in the blockchain space.</li>\n</ul>\n<ul style=\"\">\n<li style=\"\">Creative thinking and a proactive approach to problem-solving.</li>\n</ul>\n<p><br><br></p>\n<div class=\"h3\">Success Metrics</div>\n<ul style=\"\">\n<li style=\"\">Ecosystem Engagement</li>\n</ul>\n<ul style=\"\">\n<li style=\"\">Content Performance</li>\n</ul>\n<ul style=\"\">\n<li style=\"\">Partnership Impact</li>\n</ul>\n<ul style=\"\">\n<li style=\"\">Brand Consistency</li>\n</ul>\n<ul style=\"\">\n<li style=\"\">Community Growth</li>\n</ul>\n<ul style=\"\">\n<li style=\"\">Campaign ROI</li>\n</ul>\n<ul style=\"\">\n<li style=\"\">Analytics Proficiency</li>\n</ul>\n<img src=\"https://remotive.com/job/track/1862980/blank.gif?source=public_api\" alt=\"\"/>","tags":"[\"fullstack\",\"security\",\"social media\",\"blockchain\",\"analytics\",\"brand design\",\"Ethereum\",\"marketing strategy\",\"partnerships\",\"startup\"]","pubDate":"2023-12-17 23:22:14.000","link":"https://remotive.com/remote-jobs/marketing/ecosystem-marketing-associate-1862980","savedDate":"2023-12-19 16:33:09.819","slug":"ecosystem-marketing-associate-fuel-labs-3316"},{"id":3579923891,"title":"Copywriter (OBRIO)","company":"Genesis","image":"https://remotive.com/job/1865812/logo","description":"<p><a href=\"https://obrio.co/\" rel=\"nofollow\"><strong>OBRIO</strong></a> is an IT company with Ukrainian roots inside Genesis business ecosystem. Our team consists of more than<strong>120 </strong>talented professionals whose ambitions and striving for success help us build the best products on the market. Currently, the OBRIO team works remotely from various locations in Ukraine and <strong>12</strong> other countries. We have offices in Kyiv and Warsaw.</p>\n<p>We are developing <a href=\"http://asknebula.com/\" rel=\"nofollow\"><strong>Nebula</strong></a> – the biggest brand in the astrology niche. Nebula has over 30 million users worldwide and has been ranked as the № 1 lifestyle app of the day in the Apple Store and Play Market in the USA, Canada, and Australia several times. Nebula is available on iOS, Android, and Web. Also, Nebula is the top 1 astrological brand in the USA and Canada, according to Facebook Brand Audit.</p>\n<p><strong><em>Here are some details we would like to share with you:</em></strong></p>\n<ul style=\"\">\n<li style=\"\"><a href=\"http://asknebula.com/\" rel=\"nofollow\"><em>Nebula</em></a><em> is</em> #1 <em>in its niche in terms of downloads and revenue targets;</em></li>\n<li style=\"\"><em>30 million users worldwide;</em></li>\n<li style=\"\"><em>Users from 50+ countries;</em></li>\n<li style=\"\"><em>4.8 — our average AppStore rating (with more than 215 thousand ratings).</em></li>\n</ul>\n<p><strong>Who we are looking for?</strong></p>\n<p>We are seeking an experienced and skilled copywriter to join our team and create high-quality content for our product's website and external sites. Your primary focus will be to write SEO-optimized copy that outperforms our competitors and boosts our online visibility. The ideal candidate for this position should possess excellent writing skills, a strong understanding of SEO principles, and the ability to conduct thorough research on our industry and competitors. </p>\n<p>With us, you will have the opportunity to work on a product in a white niche. So, if you are a passionate copywriter with a desire to excel, we encourage you to apply for this exciting opportunity.</p>\n<p><strong><strong><strong>Your impact:</strong></strong></strong></p>\n<ul style=\"\">\n<li style=\"\">Create high-quality, SEO-optimized content for our product's website and external sites to enhance our online visibility.</li>\n<li style=\"\">Deliver around 1500 words of written content per day, that is factually accurate, informative, engaging, and free of grammatical errors.</li>\n<li style=\"\">Optimize existing content to improve its search engine ranking and engagement.</li>\n<li style=\"\">Write content for outreach purposes, depending on the workload.</li>\n</ul>\n<p><strong>About you:</strong></p>\n<ul style=\"\">\n<li style=\"\">Have at least 2 years of experience in SEO and content writing, with a proven track record of success.</li>\n<li style=\"\">Demonstrate your skills with a portfolio of your best content, showcasing your ability to write engaging and informative copy.</li>\n<li style=\"\">Possess an <strong>advanced level of English</strong>, with excellent knowledge of all aspects of written English.</li>\n<li style=\"\">Have solid knowledge of core SEO principles, including keywords, keyword variations, keyword stuffing, internal linking, and the ability to apply them effectively to written content.</li>\n</ul>\n<p><strong>Why OBRIO is the best place to work?</strong></p>\n<ul style=\"\">\n<li style=\"\"><strong>Unleash Your Ambitions:</strong> Our company was built by ambitious people who never settle for less. By joining OBRIO, you'll have the chance to unleash your own ambitions and achieve your career dreams.</li>\n<li style=\"\"><strong>Innovate and Be Creative:</strong> We embrace innovation and creativity at OBRIO, and we encourage our team members to bring their unique ideas to the table. You'll have the chance to explore new solutions and make a real impact on our company's success.</li>\n<li style=\"\">Here <strong>you'll be part of a strong family,</strong> surrounded by people ready to support you, who share your interests and contribute to your development. At OBRIO, we love our colleagues, spend time together outside of work, and are happy to invite our friends into the company.</li>\n<li style=\"\"><strong>At OBRIO, we've gathered influential experts,</strong> all of whom are open to sharing their knowledge and ready to help solve issues based on their experience. This is the company where you can quickly reach your potential and advance your career.</li>\n</ul>\n<p><strong>Our benefits:</strong></p>\n<ul style=\"\">\n<li style=\"\">Benefit from the flexibility to work from anywhere in the world;</li>\n<li style=\"\">Work from the comfort of your home or from one of our offices in Kyiv or Warsaw. The choice is yours!</li>\n<li style=\"\">Enjoy 20 annual vacation days and unlimited sick leave, all covered by the company;</li>\n<li style=\"\">Don't worry about getting the right equipment, we've got you covered if necessary;</li>\n<li style=\"\">Stay healthy with access to a corporate doctor online, and health insurance options in Ukraine or a fixed amount towards insurance abroad after your probation period;</li>\n<li style=\"\">Keep learning with our extensive corporate library, internal online meetings, and lectures;</li>\n<li style=\"\">Grow your skills with our training compensation program;</li>\n<li style=\"\">Take advantage of our supportive corporate culture, including assistance with relocation, advice on legal stay abroad, housing support, and help for third-country nationals;</li>\n<li style=\"\">Have fun with our online events and team-building activities</li>\n</ul>\n<p><strong>Here's what our hiring journey looks like:</strong> Initial Screening ➡ Optional Skill Assessment  ➡ Team Interview ➡ Final Check ➡ Job Offer.</p>\n<p><strong>Let's team up and reach for the stars together!</strong></p>\n<p>More about us on social media:<a href=\"https://www.facebook.com/obrio.genesis\" rel=\"nofollow\"> Facebook</a>,<a href=\"https://www.instagram.com/obrio.genesis/\" rel=\"nofollow\"> Instagram</a>,<a href=\"https://www.linkedin.com/company/obrio-genesis/\" rel=\"nofollow\"> LinkedIn</a>, <a href=\"https://www.tiktok.com/@obrio_genesis\" rel=\"nofollow\" target=\"_blank\">TikTok</a>.</p>\n<p> </p>\n<p> </p>\n<img src=\"https://remotive.com/job/track/1865812/blank.gif?source=public_api\" alt=\"\"/>","tags":"[\"android\",\"excel\",\"ios\",\"seo\",\"social media\",\"research\",\"SOLID\",\"apple\",\"insurance\"]","pubDate":"2023-12-16 21:20:40.000","link":"https://remotive.com/remote-jobs/writing/copywriter-obrio-1865812","savedDate":"2023-12-19 16:33:09.819","slug":"copywriter-obrio-genesis-1675"}]