[{"id":2545584822,"title":"Content Writer","company":"GrowthX Labs","image":"https://remotive.com/job/1973580/logo","description":"<p>👉 IMPORTANT: Upload your resume as a PDF. Resumes in other formats (e.g., DOC or DOCX) will be automatically disqualified by our AI systems.</p>\n<p>We're seeking a Content Writer who's passionate about storytelling and adapting their voice across diverse industries. At GrowthX AI, you'll collaborate with clients ranging from small startups to global enterprises, creating compelling, tailored content using AI-powered growth engines.</p>\n<p>(This is a fully remote role. We ask for a minimum of 4 hours of overlap with U.S. Pacific Time to collaborate with team members.)</p>\n<div class=\"h3\">Quick Intro</div>\n<p>At GrowthX AI, we build AI-powered growth engines that merge human expertise with advanced automation to help businesses expand their digital presence. We are at the forefront of leveraging AI for content creation, ensuring each piece aligns with our clients' voices and goals.</p>\n<p>We believe in the power of storytelling to drive digital growth. By combining human creativity with AI tools, we deliver content that is both efficient and impactful, catering to various industries and business sizes.</p>\n<div class=\"h3\">The Role: Content Writer</div>\n<p>We're seeking a Content Writer to craft high-quality content tailored to specific industries and client needs, working closely with our Managing Editors, SEO Strategists, and AI automation experts. You will produce engaging articles, adapt writing styles for diverse topics, and ensure content meets high-quality standards and aligns with target audiences.</p>\n<div class=\"h3\">Who You'll Work With</div>\n<p>As the Content Writer, you'll have access to resources and support for content development. You'll collaborate with:</p>\n<ul style=\"\">\n<li style=\"\">Managing Editors: To refine topics and ensure adherence to brand style guidelines</li>\n<li style=\"\">SEO Strategists: To integrate target keywords and implement SEO best practices</li>\n</ul>\n<div class=\"h3\">Day-to-Day Expectations</div>\n<p>Here's how you can expect to spend your time each week:</p>\n<p>60% – Content Creation: Research, outline, and write articles, blog posts, and other formats<br>20% – Collaboration &amp; Editorial Workflows: Work with editors and strategists to refine and optimize content<br>10% – Quality Assurance: Fact-check and self-edit content for accuracy and clarity<br>10% – Continuous Learning &amp; Adaptation: Stay updated on industry trends and AI tools</p>\n<div class=\"h3\">Requirements</div>\n<div class=\"h3\">Key Responsibilities &amp; Skills Needed</div>\n<ul style=\"\">\n<li style=\"\">Strong Writing &amp; Storytelling: Write clear, engaging copy with flexibility across industries</li>\n<li style=\"\">Research Proficiency: Dive into niche topics and distill complex information into reader-friendly language</li>\n<li style=\"\">SEO Awareness: Basic knowledge of on-page SEO practices and a willingness to learn more</li>\n<li style=\"\">Collaboration &amp; Feedback: Comfortable receiving feedback and iterating to meet standards</li>\n<li style=\"\">Time Management: Efficiently juggle multiple assignments and deadlines</li>\n</ul>\n<div class=\"h3\">Nice to Haves</div>\n<ul style=\"\">\n<li style=\"\">AI Tool Experience: Familiarity with GPT-based tools or automated content generation</li>\n<li style=\"\">Industry Certifications: Relevant certifications or degrees in specialized fields</li>\n<li style=\"\">Multilingual Skills: Proficiency in additional languages</li>\n</ul>\n<div class=\"h3\">Benefits</div>\n<ul style=\"\">\n<li style=\"\">Salary: Competitive compensation (depends on experience)</li>\n<li style=\"\">Fully Remote: Work from anywhere with the ability to coordinate with PST hours</li>\n<li style=\"\">Unlimited PTO: Encouragement to take at least 15 days off annually</li>\n<li style=\"\">Professional Growth: Access to AI training, editorial workshops, and skill-building opportunities</li>\n<li style=\"\">Dynamic Culture: Collaborate with a diverse, innovative team of strategists and AI specialists</li>\n</ul>\n<p><br><br></p>\n<div class=\"h2\">About the company</div>\n<p><br>We build end-to-end growth engines with expert-guided AI workflows. From content to distribution to conversion. <br><br>We're not another software company.<br>We're not trying to be an agency.<br>We're building something entirely different:<br><br></p>\n<ul style=\"\">\n<li style=\"\">AI-powered workflows that adapt to our clients</li>\n<li style=\"\">Expert guidance every step of the way</li>\n<li style=\"\">Zero burden on our clients team</li>\n<li style=\"\">Results that compound over time</li>\n</ul>\n<p><br><strong>Why?<br></strong><br>Because traditional options aren't cutting it:<br><br></p>\n<ul style=\"\">\n<li style=\"\">Agencies are expensive and often disconnected from your brand's reality.</li>\n<li style=\"\">Freelancers can be hit or miss, hard to manage, and challenging to retain.</li>\n<li style=\"\">In-house teams are costly to build and often bogged down by internal processes.</li>\n<li style=\"\">AI alone lacks the nuance and contextual understanding that human expertise brings.</li>\n<li style=\"\">Software tools require your team to do all the heavy lifting.</li>\n</ul>\n<p><br>We believe in combining the best of both worlds—AI and experts—to drive real growth.<br><br>Already, 25 incredible companies – from seed startups to public giants – are growing with us.<br><br>And we're just getting started... 🚀</p>\n<img src=\"https://remotive.com/job/track/1973580/blank.gif?source=public_api\" alt=\"\"/>","tags":"[\"time management\"]","pubDate":"2025-02-28T21:51:09.000Z","link":"https://remotive.com/remote-jobs/writing/content-writer-1973580","slug":"content-writer-growthx-labs-2740"},{"id":8492754399,"title":"Marketing Specialist","company":"1840 & Company","image":"https://remotive.com/job/1973868/logo","description":"<div>We are seeking a <strong>Marketing Specialist</strong> to join our team and support various marketing initiatives. This role will be responsible for staging content in HubSpot, managing basic project tasks, and assisting with other marketing-related activities.</div>\n<div> </div>\n<div>This is a fully remote position, allowing you to work from anywhere.</div>\n<div><strong>Working hours: 9AM - 5PM EST</strong></div>\n<p><br><br></p>\n<div class=\"h3\">Key Responsibilities:</div>\n<ul style=\"\">\n<li style=\"\"><strong>Stage and optimize content in HubSpot, including:</strong></li>\n<li style=\"\">Website pages</li>\n<li style=\"\">Landing pages</li>\n<li style=\"\">Emails</li>\n<li style=\"\">Blogs</li>\n<li style=\"\">Calls-to-Action (CTAs)</li>\n<li style=\"\">Ads and social media posts</li>\n<li style=\"\"><strong>Log and organize customer reviews in HubSpot.</strong></li>\n<li style=\"\"><strong>Assist in project management tasks, such as:</strong></li>\n<li style=\"\">Queueing up deliverables in our project management system.</li>\n<li style=\"\">Ensuring deadlines and workflows are followed.</li>\n<li style=\"\"><strong>Collaborate with internal teams to ensure seamless execution of marketing campaigns.</strong></li>\n<li style=\"\"><strong> Perform miscellaneous marketing-related tasks as needed.</strong></li>\n</ul>\n<p><br><br></p>\n<div class=\"h3\">Qualifications &amp; Experience:</div>\n<ul style=\"\">\n<li style=\"\">2-4 years of experience in digital marketing, content staging, or a related field.</li>\n<li style=\"\">Bachelor’s degree.</li>\n<li style=\"\">Hands-on experience with HubSpot (or similar marketing automation platforms).</li>\n<li style=\"\">Familiarity with project management tools (e.g., Asana, ClickUp, Trello, or <a class=\"postings-link\" href=\"http://Monday.com\" rel=\"nofollow\">Monday.com</a>).</li>\n<li style=\"\">Strong attention to detail and ability to follow processes accurately.</li>\n<li style=\"\">Ability to work independently in a fully remote environment.</li>\n<li style=\"\">Excellent communication and organizational skills.</li>\n</ul>\n<p><br><br></p>\n<div class=\"h3\">Why Join Us:</div>\n<ul style=\"\">\n<li style=\"\"> Work in a fully remote, flexible environment.</li>\n<li style=\"\"> Collaborate with a dynamic and innovative marketing team.</li>\n<li style=\"\"> Gain hands-on experience in HubSpot and digital marketing strategies.</li>\n<li style=\"\"> Be part of a fast-growing, customer-centric digital agency.</li>\n</ul>\n<div>About 1840 &amp; Company</div>\n<div> </div>\n<div>1840 &amp; Company is a global leader in Business Process Outsourcing (BPO) and remote talent solutions, dedicated to propelling businesses forward through our comprehensive suite of services. We specialize in connecting companies with world-class freelance professionals and delivering top-tier outsourcing services, across over 150 countries worldwide.</div>\n<div> </div>\n<div>Our mission is to empower growth for forward-thinking businesses, seamlessly bridging any skill or resource gaps with our expertly vetted talent pool. We firmly believe in fostering an environment where exceptional individuals can achieve an optimal work-life balance, working remotely from any location, while maximizing their professional growth and earning potential.</div>\n<div> </div>\n<div>We are headquartered in Overland Park, KS, USA with service delivery facilities in the Philippines, India, Ukraine, South Africa and Argentina. We invite you to explore the opportunities we offer and consider joining our exclusive network of global freelance talent. Visit <a class=\"postings-link\" href=\"http://www.1840andco.com/\" rel=\"nofollow\">www.1840andco.com</a> to learn more about us. To explore a wealth of career opportunities and find a role that suits your unique skills and aspirations, please visit our dedicated jobs portal at <a class=\"postings-link\" href=\"https://jobs.1840andco.com/\" rel=\"nofollow\">jobs.1840andco.com</a>. #LI-NY1</div>\n<img src=\"https://remotive.com/job/track/1973868/blank.gif?source=public_api\" alt=\"\"/>","tags":"[\"digital marketing\",\"hubspot\"]","pubDate":"2025-02-28T19:50:56.000Z","link":"https://remotive.com/remote-jobs/marketing/marketing-specialist-1973868","slug":"marketing-specialist-1840-company-8043"},{"id":3424671301,"title":"Startup Finance & Equity Writer","company":"omniscient","image":"https://remotive.com/job/1973582/logo","description":"<div class=\"h3\">About Omniscient Digital</div><p style=\"min-height:1.5em\">Omniscient Digital is an organic growth agency helping B2B software companies turn content and SEO into growth channels. We’ve helped build content and SEO programs for companies like Jasper, Adobe, Loom, <a href=\"http://Order.co\" rel=\"nofollow\" target=\"_blank\">Order.co</a>, Vendr, Hotjar, and more.</p><p style=\"min-height:1.5em\"></p><p style=\"min-height:1.5em\">Our work has been featured on websites like HubSpot, Shopify, Intercom, and CXL, and our strategies are used by many of the top content marketing teams around the world.</p><p style=\"min-height:1.5em\"></p><p style=\"min-height:1.5em\">Our team is 100% remote. Learn about the <a href=\"https://beomniscient.com/principles/\" rel=\"nofollow\" target=\"_blank\"><u>core values</u></a> that drive how we work and build a company.</p><p style=\"min-height:1.5em\"></p><div class=\"h3\">About this role</div><p style=\"min-height:1.5em\">Omniscient Digital is growing quickly, and we deeply believe in our commitment to never compromise content quality. It’s what differentiates us from other agencies. Writing great content requires great writers. </p><p style=\"min-height:1.5em\">We’re taking on an increasing number of technical clients and are seeking a stellar writer with <strong>experience working with or writing on topics related to startup finance, equity structures, and compliance regulations. </strong></p><p style=\"min-height:1.5em\"><em>*Please note that we don’t work with writers who subcontract their work.</em></p><div class=\"h3\">Responsibilities:</div><ul style=\"\"><li style=\"\"><p style=\"min-height:1.5em\"><strong>Create blog content (and potentially other types of marketing content) that appeals to:</strong> </p><ul style=\"\"><li style=\"\"><p style=\"min-height:1.5em\"><strong>Startup founders and CFOs </strong>by providing actionable insights on cap table management, fundraising, equity structures, and regulatory compliance.</p></li><li style=\"\"><p style=\"min-height:1.5em\"><strong>Venture-backed employees, </strong>focusing on the complexities of stock options, ESOPs, and secondary liquidity markets.</p></li><li style=\"\"><p style=\"min-height:1.5em\"><strong>Financial and legal professionals </strong>focusing on tax law, SEC compliance, and investor relations while still acknowledging their subject matter expertise.</p></li></ul></li><li style=\"\"><p style=\"min-height:1.5em\">Translate complex legal and financial concepts (e.g., <strong>IRC 409A, SEC regulations, dilution modeling</strong>) into engaging, accessible content</p></li><li style=\"\"><p style=\"min-height:1.5em\">Stay up-to-date with <strong>emerging trends</strong>, including crypto-based equity and alternative financing models, to ensure content reflects the latest industry developments</p></li><li style=\"\"><p style=\"min-height:1.5em\">Use company brand voice and messaging for written pieces to reinforce company culture</p></li><li style=\"\"><p style=\"min-height:1.5em\"><strong>QA content</strong> for factual accuracy, readability, and compliance with editorial guidelines</p></li><li style=\"\"><p style=\"min-height:1.5em\">Interview <strong>subject matter experts (SMEs)</strong> in venture finance, tax law, and compliance to enrich content with expert insights</p></li><li style=\"\"><p style=\"min-height:1.5em\">Ensure projects are completed on time and meet quality standards</p></li><li style=\"\"><p style=\"min-height:1.5em\">Suggest optimizations and content strategies based on industry trends and audience engagement</p></li><li style=\"\"><p style=\"min-height:1.5em\">Manage complex information and multiple projects within content specifications and budget restrictions</p></li></ul><div class=\"h3\">Job Qualifications and Technical Skill Sets:</div><ul style=\"\"><li style=\"\"><p style=\"min-height:1.5em\"><strong>2+ years of experience writing about startup finance and equity topics. </strong>You understand the nuances of fundraising, 409A valuations, cap tables, employee equity, tax law, and compliance. Strong knowledge of venture capital financing, including SAFE notes, priced rounds, pro-rata rights, and secondary sales.</p></li><li style=\"\"><p style=\"min-height:1.5em\"><strong>Ability to break down complex legal and financial concepts. </strong>You can take these concepts and transform them into clear, engaging narratives for startup founders and employees.</p></li><li style=\"\"><p style=\"min-height:1.5em\"><strong>Familiarity with cap table management tools and equity software is a plus.</strong></p></li><li style=\"\"><p style=\"min-height:1.5em\"><strong>Experience interviewing subject matter experts. </strong>You’re comfortable independently conducting SME interviews to add industry opinion and narrative to your content. You know how to draft insightful questions to extract key information and structure compelling narratives around SME responses.</p></li><li style=\"\"><p style=\"min-height:1.5em\"><strong>Time management and organizational skills.</strong> You always meet your deadlines—or communicate in advance when you may need a deadline pushed back. </p></li><li style=\"\"><p style=\"min-height:1.5em\"><strong>A passion for startups, venture capital, and financial storytelling. </strong>You stay updated with industry trends and enjoy making complex topics digestible.</p></li><li style=\"\"><p style=\"min-height:1.5em\"><strong>Experience writing for both technical and non-technical audiences (e.g., CFOs, founders, startup employees).</strong></p></li><li style=\"\"><p style=\"min-height:1.5em\"><strong>Excellent written and verbal communication skills, and healthy analytical and critical thinking skills. </strong>You turn complex financial and equity concepts into compelling narratives. You’re skilled at finding the story within complicated topics and can capture our client’s brand voice in every piece of writing.</p></li><li style=\"\"><p style=\"min-height:1.5em\"><strong>SEO experience</strong>. You’re not new to marketing and understand the various considerations that inform a piece of SEO content. You know how to search-optimize your content without sacrificing quality, and can balance the needs of both your client and reader. </p></li></ul><ul style=\"\"><li style=\"\"><p style=\"min-height:1.5em\"><strong>Positive attitude.</strong> You’re kind, passionate, curious, and friendly! You’re open to exploring new ideas, stay updated on trending topics in the venture-backed financial space, and feel passionately about crafting excellent content. You welcome feedback and love learning how to improve your craft. </p></li><li style=\"\"><p style=\"min-height:1.5em\"><strong>Experience with both print and digital media formats.</strong> You’re also proficient in word processor programs such as Microsoft Word and Google Docs and PDF software such as Adobe Acrobat.  </p></li></ul><p style=\"min-height:1.5em\">Other Preferred Qualifications:</p><ul style=\"\"><li style=\"\"><p style=\"min-height:1.5em\">Hands-on experience with <strong>startup equity management, venture finance, or tax law</strong> (even if not as a writer).</p></li><li style=\"\"><p style=\"min-height:1.5em\">Understanding of <strong>crypto-based equity compensation</strong> and its regulatory considerations.</p></li><li style=\"\"><p style=\"min-height:1.5em\">Experience with <strong>investor relations and compliance reporting</strong>.</p></li></ul><div class=\"h3\">Portfolio</div><p style=\"min-height:1.5em\">A recent portfolio with financial writing experience is a must. Please submit 3-5 sample articles that have been published within the past three years for consideration, at least 2 of which relate to startup finance and equity. Older samples will be accepted only if accompanied by newer works. </p><div class=\"h3\">Our hiring process</div><p style=\"min-height:1.5em\">We read every application and do our best to get back to each applicant within a few weeks of submission. However, response times may vary depending on the time of year, number of applicants, and other factors. </p><p style=\"min-height:1.5em\"><strong>Note:</strong> We’re urgently hiring for this role. If we’re interested in moving forward with your application, we’ll likely reach out sooner via email. </p><div class=\"h3\">Ready to apply?</div><p style=\"min-height:1.5em\">Apply below! We’re excited to meet you! 😎</p><p style=\"min-height:1.5em\">If you have any questions during or after the application process, feel free to reach out to our Managing Editor Sam Lund (samuel [at] beomniscient [dot] com).</p><p style=\"min-height:1.5em\"><em>Confidence can sometimes hold us back from applying for a job. But there’s no such thing as a \"perfect\" candidate. Omniscient Digital is a place where everyone can grow. So however you identify and whatever background you bring with you, please apply if the idea of this role excites you.</em></p><img src=\"https://remotive.com/job/track/1973582/blank.gif?source=public_api\" alt=\"\"/>","tags":"[\"time management\"]","pubDate":"2025-02-28T11:50:53.000Z","link":"https://remotive.com/remote-jobs/writing/startup-finance-equity-writer-1973582","slug":"startup-finance-equity-writer-omniscient-1756"}]