[{"id":3732400883,"title":"Senior QA Automation Engineer","company":"Clearer","image":"https://avatars.githubusercontent.com/u/100294047?s=200&v=4","description":"<div><b style=\"font-size: 16px;\">Take the Clearer route to smart career growth.</b><span style=\"font-size: 16px;\"> At </span><a rel=\"noopener noreferrer\" class=\"postings-link\" style=\"font-size: 16px;\" href=\"http://Clearer.io\">Clearer.io</a><span style=\"font-size: 16px;\">, we’re reimagining eCommerce by enhancing search, discovery, and customer engagement through a standout suite of innovative apps. Our mission is straightforward yet powerful: to empower our partners with solutions that streamline their operations, foster customer trust, and drive sustainable growth. We’re not just about technology—we’re about making eCommerce smarter, simpler, and more impactful, delivering solutions that inspire confidence and create real results.</span></div><div><span style=\"font-size: 16px;\">With fresh investment and rapid growth, this is the perfect time to join our journey. When you become part of </span><a rel=\"noopener noreferrer\" class=\"postings-link\" style=\"font-size: 16px;\" href=\"http://Clearer.io\">Clearer.io</a><span style=\"font-size: 16px;\">, you step into a role where your work truly matters. Here, you’ll have the opportunity to own your projects, drive outcomes, and make an impact within a supportive, diverse team of professionals dedicated to customer success. We value clarity, results, and a customer-centric approach that keeps us focused on delivering real value to our partners every step of the </span><a rel=\"noopener noreferrer\" class=\"postings-link\" style=\"font-size: 16px;\" href=\"http://way.If\">way.If</a><span style=\"font-size: 16px;\"> you’re ready to cut through the clutter and focus on what really matters in a dynamic eCommerce landscape, </span><a rel=\"noopener noreferrer\" class=\"postings-link\" style=\"font-size: 16px;\" href=\"http://Clearer.io\">Clearer.io</a><span style=\"font-size: 16px;\"> is the place to grow, lead, and shape the future of online retail. Join us, and be part of a team that’s committed to making eCommerce clearer, more efficient, and more rewarding for everyone.</span></div><div><br></div><div><b style=\"font-size: 16px;\">Your Impact: </b><span style=\"font-size: 16px;\">As a Senior QA Automation Engineer </span><b style=\"font-size: 16px;\">(Contract term: 06 months)</b><span style=\"font-size: 16px;\">, you will drive strategic quality initiatives, architect robust automation frameworks, and lead testing efforts for complex cloud-based systems. You will work across teams to implement best practices, ensure testability in design, and enhance CI/CD processes. Additionally, you will mentor junior engineers, advocate for continuous improvement, and play a key role in shaping the future of quality engineering within the organization.</span></div><div><b style=\"font-size: 16px;\">Take the Clearer route to smart career growth.</b><span style=\"font-size: 16px;\"> At </span><a href=\"http://Clearer.io\" style=\"font-size: 16px;\" class=\"postings-link\" target=\"_blank\" rel=\"noopener noreferrer\">Clearer.io</a><span style=\"font-size: 16px;\">, we’re reimagining eCommerce by enhancing search, discovery, and customer engagement through a standout suite of innovative apps. Our mission is straightforward yet powerful: to empower our partners with solutions that streamline their operations, foster customer trust, and drive sustainable growth. We’re not just about technology—we’re about making eCommerce smarter, simpler, and more impactful, delivering solutions that inspire confidence and create real results.</span></div><div><span style=\"font-size: 16px;\">With fresh investment and rapid growth, this is the perfect time to join our journey. When you become part of </span><a href=\"http://Clearer.io\" style=\"font-size: 16px;\" class=\"postings-link\" target=\"_blank\" rel=\"noopener noreferrer\">Clearer.io</a><span style=\"font-size: 16px;\">, you step into a role where your work truly matters. Here, you’ll have the opportunity to own your projects, drive outcomes, and make an impact within a supportive, diverse team of professionals dedicated to customer success. We value clarity, results, and a customer-centric approach that keeps us focused on delivering real value to our partners every step of the </span><a href=\"http://way.If\" style=\"font-size: 16px;\" class=\"postings-link\" target=\"_blank\" rel=\"noopener noreferrer\">way.If</a><span style=\"font-size: 16px;\"> you’re ready to cut through the clutter and focus on what really matters in a dynamic eCommerce landscape, </span><a href=\"http://Clearer.io\" style=\"font-size: 16px;\" class=\"postings-link\" target=\"_blank\" rel=\"noopener noreferrer\">Clearer.io</a><span style=\"font-size: 16px;\"> is the place to grow, lead, and shape the future of online retail. Join us, and be part of a team that’s committed to making eCommerce clearer, more efficient, and more rewarding for everyone.</span></div><div><br></div><div><b style=\"font-size: 16px;\">Your Impact: </b><span style=\"font-size: 16px;\">As a Senior QA Automation Engineer </span><b style=\"font-size: 16px;\">(Contract term: 06 months)</b><span style=\"font-size: 16px;\">, you will drive strategic quality initiatives, architect robust automation frameworks, and lead testing efforts for complex cloud-based systems. You will work across teams to implement best practices, ensure testability in design, and enhance CI/CD processes. Additionally, you will mentor junior engineers, advocate for continuous improvement, and play a key role in shaping the future of quality engineering within the organization.</span></div><h3>What you'll do:</h3><li>Define and drive the overall QA strategy for the team.</li><li>Expand automation coverage across UI, API, and backend services, incorporating AI-driven test optimization tools where applicable.</li><li>Lead the development of robust test automation frameworks for UI and API testing.</li><li>Establish best practices for testing cloud-native applications in AWS environments.</li><li>Drive continuous improvement in test automation, coverage, and execution efficiency.</li><li>Mentor and guide junior QA engineers, conducting code reviews for automation scripts.</li><li>Collaborate with DevOps to enhance test execution in CI/CD pipelines.</li><li>Influence testability in the SDLC by working closely with developers and product teams.</li><li>Analyze performance testing needs and implement strategies to identify bottlenecks.</li><li>Lead performance testing efforts, using tools like JMeter or k6 to identify system bottlenecks.</li><h3>What you’ll bring:</h3><li>Typically requires a minimum of 5 years of related experience with a Bachelor’s degree in Computer Science, Engineering, or equivalent.</li><li>Experience with e-commerce and with specific experience of Shopify a plus!</li><li>Deep knowledge of test automation frameworks (Selenium, REST Assured, Cypress, etc.).</li><li>Strong experience with Kubernetes (EKS, ECS), Docker, Terraform, and AWS services.</li><li>Hands-on experience with CI/CD pipelines, infrastructure automation, and GitHub workflows.</li><li>Proficiency in analyzing logs and debugging issues using Datadog or similar tools.</li><li>Experience in performance testing and optimization techniques.</li><li>Strong leadership and mentoring skills.</li><li>Good English skills.</li><h3>Why choose Clearer.io?</h3><li><b>Customers at the heart:</b> We make our customers the stars of our show and help them thrive. When they grow, so do we. We obsess over their needs so we can dream big on their behalf.</li><li><b>Purposeful progress:</b> We harness our ingenuity to keep leveling up and growing stronger. We take initiative, think boldly, and don’t settle for the status quo. Every risk teaches us something new.</li><li><b>Endless innovation:</b> We take action, refine our work, and drive meaningful growth for each other and our customers. Humble in our pursuit, we continuously seek to improve. We ask ‘How can we help?’ striving always to make a meaningful.</li><li><b>Always open: </b>With transparency we simplify the complex, collaborate globally and empower everyone. We believe openness in our communication—with customers, partners, and team members—is essential for building strong relationships.</li><div><br></div><div><b>Clear Benefits:</b></div><li>100% Remote Culture: Work from anywhere that brings you happiness.</li><li>Performance-based Year-End Bonus: Recognizing and rewarding your individual contributions.</li><li>Wellness Allowance: Support for classes promoting physical and mental health.</li><li>Time Off: 20 days/year, in addition to Vietnam holidays.</li><li>MacBook Provided.</li><li>Collaborative Events: Offline meet-ups, monthly gatherings, year-end party, and company trips.</li><li>Continuous Learning: Technical and general workshops, online resources.</li><li>Health and Wellness Benefits: Generali Health Care, annual check-up.</li><li>International Exposure: Enhance expertise and English communication skills.</li><div><br></div><div><b>Be a part of </b><a rel=\"noopener noreferrer\" class=\"postings-link\" href=\"http://Clearer.io\"><b>Clearer.io</b></a>—where your expertise fuels real change in eCommerce. Come and join us- it’s clear we’re the place to be!</div>","tags":"[\"engineering\",\"aws\"]","pubDate":"2025-03-03T03:11:06.921Z","link":"https://jobs.lever.co/Clearer/5add7940-c66d-4acb-9c4a-e6444e63743b","slug":"senior-qa-automation-engineer-clearer-3088"},{"id":4060820210,"title":"Affiliate Specialist","company":"Awesome Motive","image":"https://avatars.githubusercontent.com/u/8514352?s=200&v=4","description":"<p>At Awesome Motive, we are seeking an experienced and detail-oriented Affiliate Specialist to join our team. In this role, you’ll take the lead on outreach, relationship building, and operational support—helping to drive partnerships that fuel our growth.</p><p>💡 <strong>Interested in applying?</strong></p><p>🔍 <strong>Please read/follow the next steps outlined in \"How to Apply\" at the bottom of this listing.<br></strong></p><p><em>Attention to detail is one of our </em><a href=\"https://awesomemotive.com/core-values/\" target=\"_blank\" rel=\"nofollow noreferrer noopener\" class=\"external\">core values</a><em>! This is your chance to stand out :)<br></em></p><h3>To love this role, here’s the type of person you are:</h3><ul> <li>You have the ability to and passionate about building connections and opportunities with potential affiliates and partners across multiple brands.</li> <li>You are reliable and responsive - available at a moment’s notice to help our affiliates and partners.</li> <li>You’re comfortable with accepting critical feedback without taking it personally and incorporating that feedback to improve future performance.</li> <li>You’re a self-starter who loves taking the initiative to solve problems and learn new skills, and are comfortable working with minimal direction.&nbsp;</li> <li>You take pride in the quality and craftsmanship of your work rather than just doing it to get it done.</li> <li>You’re an excellent communicator who makes sure nothing slips through the cracks.</li> <li>You're results-oriented and focused on the outcome of your writing, not just the words themselves.<br> </li> </ul><h3>Common responsibilities include (but are not limited to):</h3><ul> <li>Affiliate/Partner Outreach:</li> <ol> <li>Assist in developing and implementing strategies to expand partner relationships and identify new partnership opportunities.</li> <li>Build relationships with existing partners through regular communication and issue resolution.</li> <li>Identify key players in the industry and generate interest in partnering with Awesome Motive.</li> </ol> <li>Operational Support:</li> <ol> <li>Manage day-to-day program activities, including affiliate onboarding, communication, tickets, and issue resolution.</li> <li>Assist in analyzing program performance data to identify trends and areas for improvement.</li> <li>Develop and track key performance indicators (KPIs) to measure program success.</li> </ol> <li>Affiliate Communication:</li> <ol> <li>Respond to affiliate inquiries and resolve issues in a timely manner.</li> <li>Coordinate with internal teams to ensure smooth execution of affiliate-related tasks.</li> <li>Provide support with affiliate communication, including email campaigns and newsletter management.</li> </ol> <li>Assist with data entry, reporting, and performance tracking to optimize affiliate program success.</li> <li>Collaborate on cross-functional initiatives, contributing to projects that enhance affiliate partnerships and overall growth.</li> <li>Stay informed on industry trends and best practices, applying insights to improve affiliate strategies and drive results.</li> </ul><p><strong>Requirements</strong></p><p></p><ul> <li>2+ years of experience in affiliate marketing, partnership management, or a related field within the B2B SaaS industry.</li> <li>Experience in partnership development or sales, with a track record of growing affiliate programs and managing key relationships.</li> <li>Proficiency in email marketing strategies, including outreach, engagement, and performance tracking.</li> <li>Strong analytical and problem-solving skills, with the ability to interpret affiliate performance data and optimize strategies for growth.</li> <li>Excellent communication and interpersonal skills, with the ability to collaborate effectively with cross-functional teams.<br> </li> </ul><p><strong>Bonus points if you also have:</strong></p><ul> <li>Hands-on experience with affiliate platforms and networks, such as ShareASale, AffiliateWP, or similar tools.</li> <li>Experience working with WordPress, including managing affiliate integrations, plugins, and tracking setups.</li> <li>Strong understanding of industry trends and best practices in affiliate marketing, particularly within the B2B SaaS space.</li> <li>Proven experience in partnership development or sales, with the ability to build and nurture affiliate relationships.</li> <li>Familiarity with program management tools for tracking performance, optimizing campaigns, and scaling affiliate programs.</li> </ul><p><strong>Benefits</strong></p><p>Working for a fast-growing bootstrapped company is a rare opportunity, one we consider a lifestyle choice rather than a job choice. Our positions are challenging, but also come with amazing advantages and fulfillment to those who earn them. Here’s what we offer.</p><ul> <li>Competitive Salary.</li> <li>Term Life Insurance and Accidental Death &amp; Dismemberment for all full-time team members during their employment.</li> <li>Health, Dental, and Vision Insurance benefits for full-time U.S. employees.</li> <li>Health Insurance benefits for all employees in India, Pakistan, Brazil, Philippines, Ukraine, Poland, Romania, Nepal, Kenya, Mexico, Nigeria, Spain &amp; Jamaica.</li> <li>Work from your home. We’re spread out all over the world – United States, Canada, Ukraine, India, Pakistan, Singapore, and more.</li> <li>Flexible PTO after 90 days of employment. We encourage employees to take the time they need for a vacation, stay healthy, and spend time with friends and family.</li> <li>Holidays (based on your location)</li> <li>Paid Parental Leave. </li> <li>We happily provide or reimburse software you’ll need as well as books or courses that promote continued learning.</li> <li>We cover all costs of company travel (including our annual all-company retreat and mini-team meetups).</li> <li>Additional Perks include AM Welcome Box for new team members, Yearly Anniversary Gifts, and Technology Stipend each work anniversary.</li> <li>We give you the opportunity to solve challenging and meaningful problems that make a difference.</li> <li>Ability to work with some of the best people in the business through frequent, if not daily, interactions.</li> <li>And in case you were wondering: no politics, no b.s., and no jerks.</li> </ul><p><strong>Location<br></strong>This is a remote position - our team is spread around the globe! Our home base is in Florida, USA, so company operating hours are 9am - 5pm ET (UTC -5). While full coverage is not a requirement, you must be available during a portion of the day.</p><p><strong>Inclusion Statement<br></strong>At Awesome Motive, we strive to have the broadest possible view of diversity, going beyond visible differences to include the background, experiences, skills, and perspectives that make each person unique. Awesome Motive is proud to be an equal opportunity workplace and is committed to equal employment opportunity regardless of race, color, ancestry, religion, sex, national origin, sexual orientation, age, citizenship, marital status, disability, gender identity, veteran status, or any other basis protected by federal, state, or local law.</p><p><strong>How to apply?<br></strong>If all of this sounds interesting, then please submit your application!<br> Also note, don't forget to proofread before submitting. Check spelling, capitalization, etc. This is your chance to make your application stand out :)</p><p>We won’t be able to individually respond to all applications, but if we feel you’re a strong match, someone will be in touch shortly. </p><p><strong>Thanks and we look forward to hearing from you!</strong></p>","tags":"[\"management\",\"b2b\"]","pubDate":"2025-03-03T00:00:00.000Z","link":"https://apply.workable.com/j/789C0C3C67","slug":"affiliate-specialist-awesome-motive-5433"}]