[{"id":3084552006,"title":"Support Engineer [IC1]","company":"Sourcegraph","image":"https://pbs.twimg.com/profile_images/1428393724527190022/4mt5PACL_400x400.png","description":"\n    <div class=\"content-intro\"><h3>ALL SOURCEGRAPH ROLES ARE FULLY REMOTE</h3>\n<h2><span style=\"color: #a112ff;\">Who we are</span></h2>\n<p>Our mission at Sourcegraph is to make it so that&nbsp;<a class=\"c-link\" href=\"https://handbook.sourcegraph.com/strategy-goals/strategy\" target=\"_blank\" data-stringify-link=\"https://handbook.sourcegraph.com/strategy-goals/strategy\" data-sk=\"tooltip_parent\">everyone can code</a>, not just ~0.1% of the population. Our code graph powers Cody, the most powerful and accurate AI coding assistant, as well as our Code Search product, which helps devs explore their entire codebase and make large-scale migrations and security fixes. We’re building software that builds software, and in doing so we’re making devs more productive and preparing for a world where a lot more code gets written.</p>\n<p>It’s an exciting time to join Sourcegraph. AI has taken over the world, and we’ve spent the last 10 years building infrastructure that’s integral to making AI generated code more powerful and accurate. Our customers include 4/5 FAANG companies, 4 of the top 10 banks, government organizations, Uber, Plaid, and many other companies building the software that pushes the world forward. We’ve raised $225M at a $2.625B valuation from <a class=\"c-link\" href=\"https://techcrunch.com/2021/07/13/sourcegraph-raises-125m-series-d-on-2-6b-valuation-for-universal-code-search-tool/\" target=\"_blank\" data-stringify-link=\"https://techcrunch.com/2021/07/13/sourcegraph-raises-125m-series-d-on-2-6b-valuation-for-universal-code-search-tool/\" data-sk=\"tooltip_parent\">Andreessen Horowitz</a>,&nbsp;<a class=\"c-link\" href=\"https://about.sourcegraph.com/blog/series-c-with-sequoia/\" target=\"_blank\" data-stringify-link=\"https://about.sourcegraph.com/blog/series-c-with-sequoia/\" data-sk=\"tooltip_parent\">Sequoia</a>,&nbsp;<a class=\"c-link\" href=\"https://www.redpoint.com/companies/sourcegraph/\" target=\"_blank\" data-stringify-link=\"https://www.redpoint.com/companies/sourcegraph/\" data-sk=\"tooltip_parent\">Redpoint</a>,&nbsp;<a class=\"c-link\" href=\"https://medium.com/craft-ventures/why-we-invested-in-sourcegraph-5ace28317e3d\" target=\"_blank\" data-stringify-link=\"https://medium.com/craft-ventures/why-we-invested-in-sourcegraph-5ace28317e3d\" data-sk=\"tooltip_parent\">Craft</a>&nbsp;and others. We’re making ambitious bets on our future and we’re looking to hire exceptional people to join our team as we make Sourcegraph one of the biggest and most influential companies in the world.</p></div>\n\n    <h2><span style=\"color: rgb(140, 51, 236);\"><strong>Working hours</strong></span></h2>\n<p>🌎 While&nbsp;we are an all-remote company, we are hiring for this role in one of the following countries: Argentina, Brazil, Mexico, Chile, Colombia, Costa Rica or Dominican Republic. Expected working hours for this position is 9:00am - 5:00pm PST.</p>\n<h2><span style=\"color: rgb(140, 51, 236);\"><strong>Why this job is exciting</strong></span></h2>\n<p>As part of the Technical Success organization, Support Engineering (SE) is at the forefront of the customer experience. Our customers simply wouldn’t be successful, happy, long term customers without the important work this team does! SE exists to not only resolve technical issues but educate our customers by answering reactive questions, and by importantly identifying improvements we can make to help improve the product. Our customers are developers and we help them throughout their customer journey.&nbsp;</p>\n<p>Within one month you will…</p>\n<ul>\n<li>Learn about our product, our value propositions, our customers, our team, and our practices.</li>\n<li>Learn how Sourcegraph’s Cody is used and learn common ways to resolve any issues that come with it.</li>\n<li>Meet for an initial chat with the teammates you will work with most</li>\n<li>Start working with customers to troubleshoot and solve reported issues (with lots of support and help from your team).</li>\n</ul>\n<p>Within three months you will…</p>\n<ul>\n<li>Work with customers to troubleshoot and solve reported issues</li>\n<li>Provide input on training materials based on your experiences and learning to enhance the onboarding process.</li>\n</ul>\n<p>Within six months you will…</p>\n<ul>\n<li>Collaborate with team members to develop basic solutions or workarounds for frequently encountered customer issues.</li>\n<li>Contribute ideas and feedback in team discussions aimed at improving customer experience and product development.</li>\n</ul>\n<h2><span style=\"color: rgb(140, 51, 236);\"><strong>About you</strong></span></h2>\n<p>You are curious and compassionate. You are a problem solver - you love the moment where you “figure it out”. You enjoy trying new technologies, breaking them and helping fix them. You want to be part of a technical organization while talking with customers.</p>\n<ul>\n<li>Profound curiosity to figure out why something works the way it does / to learn more</li>\n<li>Experience with Unix/Linux and/or Bash</li>\n<li>Compassion to meet our customers (who are all developers themselves) where they are, understand their issues, and be compelled to action</li>\n<li>Experience collaborating with cross-functional teams to solve difficult problems for customers</li>\n<li>Proficiency in communicating complex technical ideas and decisions to a variety of audiences (both technical and non-technical)</li>\n<li>Some experience using Large Language Models (LLMs) and how they work</li>\n</ul>\n<p>Nice to have</p>\n<ul>\n<li>Understanding of databases, especially SQL</li>\n<li>Proficiency in working independently, figuring things out when there aren’t a lot of people to ask real-time</li>\n<li>Foundational knowledge of APIs and/or Git</li>\n<li>Experience or training (formal or self-taught) with Kubernetes (or other container orchestration framework)</li>\n<li>Experience writing code in Go or another language</li>\n<li>Familiarity with Kubernetes containerized solutions</li>\n<li>Familiarity with code hosts such as GitHub, GitLab and BitBucket</li>\n</ul>\n<h2><span style=\"color: rgb(140, 51, 236);\"><strong>Level</strong></span></h2>\n<p>📊 This job is an IC1.&nbsp; You can read more about <a href=\"https://handbook.sourcegraph.com/benefits-pay-perks/pay-expenses/compensation/leveling-guide/\">our job leveling philosophy</a> in our Handbook.</p>\n<h2><span style=\"color: rgb(140, 51, 236);\"><strong>Interview process</strong></span></h2>\n<p><em>Below is the interview process you can expect for this role (you can read more about </em><a href=\"https://handbook.sourcegraph.com/talent/types_of_interviews\"><em>the types of interviews</em></a><em> in our Handbook). It may look like a lot of steps, but rest assured that we move quickly and the steps are designed to help you get the information needed to determine if we’re the right fit for you… Interviewing is a two-way street, after all!&nbsp;</em></p>\n<p>We expect the interview process to take 5 hours in total.&nbsp;<br><br></p>\n<p><strong>👋 Introduction Stage</strong> - we have initial conversations to get to know you better…</p>\n<ul>\n<li>[30m]&nbsp;<a href=\"https://handbook.sourcegraph.com/departments/people-talent/talent/process/types_of_interviews/#recruiter-screen\">Recruiter Screen</a>&nbsp;</li>\n<li>[30m]&nbsp;<a href=\"https://handbook.sourcegraph.com/departments/people-talent/talent/process/types_of_interviews/#hiring-manager-screen\">Hiring Manager Screen</a></li>\n</ul>\n<p><strong>🧑‍💻 Team Interview Stage</strong> - we then delve into your experience in more depth and introduce you to members of the team, including cross-functional partners…</p>\n<ul>\n<li>[45m] <a href=\"https://handbook.sourcegraph.com/departments/people-talent/talent/process/types_of_interviews/#resume-deep-dive\">Resume Deep Dive</a></li>\n<li>[1.5hr] Async take-home project</li>\n<li>[1hr] Cross-team Collaboration</li>\n</ul>\n<p><strong>🎉 Final Interview Stage </strong>- we move you to our final round, where you gain a better understanding of our business and values holistically…</p>\n<ul>\n<li>[30m] <a href=\"https://handbook.sourcegraph.com/departments/people-talent/talent/process/types_of_interviews/#values-interview\">Values Interview</a></li>\n<li>[30m]&nbsp;<a href=\"https://handbook.sourcegraph.com/departments/people-talent/talent/process/types_of_interviews/#leadership-interview\">Leadership Interview</a> with co-founder</li>\n<li>We check references and conduct your background check</li>\n</ul>\n<p>Please note - you are welcome to request additional conversations with anyone you would like to meet, but didn’t get to meet during the interview process.</p>\n\n    \n\n    <div class=\"content-conclusion\"><h2><span style=\"color: #a112ff;\">Not sure if this is you?</span></h2>\n<p><span style=\"font-weight: 400;\">We want a diverse, global team, with a broad range of experience and perspectives. If this job sounds great, but you’re not sure if you qualify, apply anyway! We carefully consider every application, and will either move forward with you, find another team that might be a better fit, keep in touch for future opportunities, or thank you for your time.</span></p>\n<h2><span style=\"color: #a112ff;\">Learn more about us</span></h2>\n<p><span style=\"font-weight: 400;\">To create a product that serves the needs of all developers, we are building a diverse </span><a href=\"https://handbook.sourcegraph.com/company-info-and-process/remote\"><span style=\"font-weight: 400;\">all-remote team</span></a><span style=\"font-weight: 400;\"> that is </span><a href=\"https://handbook.sourcegraph.com/team\"><span style=\"font-weight: 400;\">distributed across the world</span></a><span style=\"font-weight: 400;\">. Sourcegraph is an equal opportunity workplace; we welcome people from all backgrounds and communities.&nbsp;</span></p>\n<p><span style=\"font-weight: 400;\">We provide </span><a href=\"https://about.sourcegraph.com/handbook/people-ops/compensation\"><span style=\"font-weight: 400;\">competitive compensation</span></a><span style=\"font-weight: 400;\"> and </span><a href=\"https://about.sourcegraph.com/handbook/people-ops/benefits-and-perks\"><span style=\"font-weight: 400;\">practical benefits</span></a><span style=\"font-weight: 400;\"> to keep you happy and healthy so that you can do your best work.&nbsp;</span><span style=\"font-weight: 400;\">&nbsp;</span></p>\n<p><span style=\"font-weight: 400;\">Learn more about what it is like to work at Sourcegraph by reading </span><a href=\"https://about.sourcegraph.com/handbook/\"><span style=\"font-weight: 400;\">our handbook</span></a><span style=\"font-weight: 400;\">.</span></p>\n<p><span style=\"font-weight: 400;\">We want to ensure Sourcegraph is an environment that suits your working style and empowers you to do your best work, so we are eager to answer any questions that you have about us at any point in the interview process.</span></p>\n<p><span style=\"font-weight: 400;\">Go back to the </span><a href=\"https://about.sourcegraph.com/jobs/\"><span style=\"font-weight: 400;\">careers page</span></a><span style=\"font-weight: 400;\"> for all open positions.</span></p>\n<p>&nbsp;</p>\n<p><em><span style=\"font-weight: 400;\">Sourcegraph participates in <a href=\"https://handbook.sourcegraph.com/departments/people-talent/e-verify/\" target=\"_blank\">E-Verify</a> for U.S. Employees</span></em></p></div>\n","tags":"[\"engineering\",\"database\"]","pubDate":"2024-03-05 16:56:26.832","link":"https://boards.greenhouse.io/sourcegraph91/jobs/5086920004","savedDate":"2024-03-05 16:56:26.832","slug":"support-engineer-ic1-sourcegraph-8284"},{"id":3125638031,"title":"Linux Systems Software Engineering Manager","company":"Canonical","image":"https://pbs.twimg.com/profile_images/1673959375340290050/x7pNtXQ7_400x400.jpg","description":"\n      <p>The Partner Engineering team works with the leading silicon companies to optimise Ubuntu to get the most from each new chip. Our goal is to collaborate with specialist engineers from our partners to integrate next-generation features and performance enhancements for upcoming hardware, while also ensure a common operating experience for their users.</p>\n<p>This role is a fast-paced, problem-solving role that’s challenging yet very exciting. The right candidate must be resourceful, articulate, and able to deliver on a wide variety of solutions across iot, desktop, automotive or server and data center technologies.&nbsp;</p>\n<p>As a Partner Engineering Manager at Canonical you will lead an engineering team that works across the full Linux server stack from kernel to AI workloads, to optimise Ubuntu for the latest silicon. You will manage relationships with our key technology partners by ensuring timely delivery on agreed project milestones.&nbsp;</p>\n<p>As a lead for strong engineers, technical leadership and a solid background in software engineering is a must, so that you’re able to challenge and grow your team members. Code reviews and architectural leadership are part of the job. As manager, the commitment to healthy engineering practices, documentation, quality and performance optimisation are equally important technical responsibilities, as is the requirement for fair and clear management, and the obligation to ensure a high performing team. You will have the opportunity to influence the culture, facilitate technical delivery, and work with your team on strategy and execution.</p>\n<p>Location: This is a Globally remote role</p>\n<h2>What your day will look like</h2>\n<ul>\n<li>Lead a team of distributed engineers to design and implement the best Ubuntu integration for the latest iot, desktop and server-class hardware platforms and software stacks</li>\n<li>Engage with commercial partners to deliver a delightful, optimised, first class Ubuntu experience on their platforms</li>\n<li>Develop your team through coaching, mentoring, leading by example, and feedback</li>\n<li>Oversee commercial engagements and support timely delivery on agreed project milestones</li>\n<li>Ensure an ongoing commitment to strict quality and reliability standards</li>\n<li>Engage with other teams at Canonical to ensure alignment on product architecture and roadmaps</li>\n</ul>\n<h2>What we are looking for in you</h2>\n<ul>\n<li>You have experience with Linux packaging (Debian, RPM, Yocto)</li>\n<li>You have experience working with open source communities and licences</li>\n<li>You have experience working with Python, C, C++</li>\n<li>You have experience working directly with customers, going beyond resolving their technical issues, to interpreting their business challenges and effectively communicating how your solution will meet their needs</li>\n<li>You have experience managing software engineers with a track record of planning, delivery and quality</li>\n<li>You can work in a globally distributed team through self-discipline and self-motivation.</li>\n<li>You have experience collaboration across multiple internal teams, building trust and delivering results</li>\n</ul>\n<h2>Additional skills that you might also bring</h2>\n<ul>\n<li>Experience with server technologies, including UEFI firmware, GPU computing, RDMA/Infiniband and virtualization stacks</li>\n<li>Experience with server IoT / Embedded experience – from board and SoC, BMCs, bootloaders and firmware to OS, through apps and services</li>\n<li>Experience with graphics stacks</li>\n<li>Basic understanding of security best practices in IoT or server environments</li>\n<li>Good communication skills, ideally public speaking experience</li>\n<li>Some experience with Docker/OCI containers/K8s</li>\n<li>Experience working with CI automation platforms such as GitHub</li>\n<li>Experience with performance benchmarking and profiling</li>\n</ul>\n<h2>What we offer you</h2>\n<p>Your base pay will depend on various factors including your geographical location, level of experience, knowledge and skills. In addition to the benefits above, certain roles are also eligible for additional benefits and rewards including annual bonuses and sales incentives based on revenue or utilisation. Our compensation philosophy is to ensure equity right across our global workforce.&nbsp;&nbsp;</p>\n<p>In addition to a competitive base pay, we provide all team members with additional benefits, which reflect our values and ideals. Please note that additional benefits may apply depending on the work location and, for more information on these, you can ask in the later stages of the recruitment process.</p>\n<ul>\n<li>Fully remote working environment - we’ve been working remotely since 2004!</li>\n<li>Personal learning and development budget of 2,000USD per annum</li>\n<li>Annual compensation review</li>\n<li>Recognition rewards</li>\n<li>Annual holiday leave</li>\n<li>Parental Leave</li>\n<li>Employee Assistance Programme</li>\n<li>Opportunity to travel to new locations to meet colleagues at ‘sprints’</li>\n<li>Priority Pass for travel and travel upgrades for long haul company events</li>\n</ul>\n<h2>About Canonical</h2>\n<p>Canonical is a pioneering tech firm that is at the forefront of the global move to open source. As the company that publishes Ubuntu, one of the most important open source projects and the platform for AI, IoT and the cloud, we are changing the world on a daily basis. We recruit on a global basis and set a very high standard for people joining the company. We expect excellence - in order to succeed, we need to be the best at what we do.</p>\n<p>Canonical has been a remote-first company since its inception in 2004.​ Work at Canonical is a step into the future, and will challenge you to think differently, work smarter, learn new skills, and raise your game. Canonical provides a unique window into the world of 21st-century digital business.</p>\n<h2>Canonical is an equal opportunity employer</h2>\n<p>We are proud to foster a workplace free from discrimination. Diversity of experience, perspectives, and background create a better work environment and better products. <a href=\"https://canonical.com/careers/diversity/identity\">Whatever your identity, we will give your application fair consideration.</a></p>\n<p>&nbsp;#LI-remote</p>\n    ","tags":"[\"management\",\"engineering\"]","pubDate":"2024-03-05 16:56:26.832","link":"https://canonical.com/careers/5780677","savedDate":"2024-03-05 16:56:26.832","slug":"linux-systems-software-engineering-manager-canonical-4843"},{"id":4636335025,"title":"Social Media & Community Specialist (LATAM)","company":"Airalo","image":"https://lever-client-logos.s3.us-west-2.amazonaws.com/55028a36-609c-479c-9553-d4689ff2dd8c-1669620566663.png","description":"<div><b>About Airalo</b></div><div>Alo! Airalo is the world’s first eSIM store that helps people connect in over 200+ countries and regions across the globe. We are building the next digital service that revolutionizes the telecom industry. We are a travel-tech company and an equal-opportunity environment that values and executes diversity, inclusion, and equity. Our team is spread across 40+ countries and six continents. What glues us together is our commitment to changing the way you connect<span style=\"font-size: 13.3333px\">. </span></div><div><br></div><div><b>About you</b></div><div>We hope that you care deeply about the quality of your work, the intrinsic worth of tasks, and the success of your team. You are self-disciplined and do not require micromanagement in terms of your skillset and work ethic. You do your best to flourish as an individual every day while working hard to foster a collaborative team environment. You believe in the importance of being — and staying — authentic, honest, positive, and kind. You are a good interlocutor with clear and concise communication. You are able to manage multiple projects, have an analytical mind, pay keen attention to detail, and love to get your hands dirty. You are cognizant, tolerant, and welcoming of vulnerabilities and cultural differences.</div><div><br></div><div><b>About the Role</b></div><div><b>Position</b>: Full-time / Employee</div><div><b>Location:</b>&nbsp;Remote-first </div><div><b>Benefits:</b>&nbsp;Health Insurance, work-from-anywhere stipend, annual wellness &amp; learning credits, annual all-expenses-paid company retreat in a gorgeous destination &amp; other benefits</div><div><br></div><div>As a <b>Social Media &amp; Community Specialist,</b> you will be responsible for guiding the strategy and development of our entire social media ecosystem across Latin America (LATAM), including creative content, community engagement, and growth.</div><div><br></div><div>Reporting to the <b>Senior Growth Manager, LATAM</b>; you will set the future strategy for social editorial content, reputation management channels, and engagement tied to marketing and brand goals.</div><div><br></div><div>With a strong understanding of storytelling, brand, and design, you'll lead the end-to-end process of social media campaigns, including the ability to plan, curate, and tailor engaging content and copy for different social channels and audiences.</div><h3>Responsibilities include but are not limited to:</h3><li><b>Social Media Strategy:</b> Develop and execute an effective social media strategy tailored to the LATAM market to increase brand awareness, engagement, and lead generation;</li><li><b>Content Creation: </b>Create compelling and shareable social media content, including text, images, videos, and infographics, that aligns with Airalo's brand voice and values; develop an editorial calendar, and execute strategies on social media channels, and other region-specific community platforms;</li><li><b>Community Engagement:</b> Monitor and actively engage with the Airalo community on social media platforms, respond to comments, questions, and feedback promptly, and build positive relationships with followers;</li><li><b>Social Media Advertising:</b> Plan and execute paid social media campaigns to reach and convert the target audience, utilizing ad platforms such as Facebook Ads, Instagram Ads, and others;</li><li><b>Analytics and Reporting:</b> Monitor social media metrics, track KPIs, and generate regular reports to measure the effectiveness of social media efforts. Utilize insights to make data-driven improvements;</li><li><b>Crisis Management:</b> Handle potential social media crises effectively, maintain a positive brand image, and address customer concerns professionally. And ensure compliance with local laws (e.g., copyright and data protection);</li><li><b>Stay Updated:</b> Stay current with industry trends, social media best practices, and emerging platforms to suggest new ideas and strategies to maintain Airalo's competitive edge.</li>,<h3>Must-haves:</h3><li>Bachelor’s degree with a strong similar professional background &amp; 3+ years experience in a similar capacity;</li><li>Extensive experience in brand management, content, social media, and customer and market insight in LATAM with an in-depth understanding of the social and digital space;</li><li>Familiar with HootSuite or other social media publishing tools;</li><li>Excellent knowledge of Facebook, Twitter, LinkedIn, Instagram, Snapchat, TikTok, and YouTube, and as of social media best practices, and regional, and global trends;</li><li>Fluency in English, with impeccable verbal and written communication skills;</li><li>Experience with executing and implementing channel and audience research;</li><li>Superior internal &amp; external communication &amp; cross-functional stakeholder management skills;</li><li>Enjoying and excelling at handling multiple projects simultaneously in a matrix &amp; complex environment;</li><li>Good time management with an eye for perfection &amp; a strong operational background. </li>,<h3>Good to have:</h3><li>Prior experience in the tech, travel, or telecommunications industry;</li><li>Certificates and courses in digital marketing and research methods;</li><li>Knowledge of eSIM and GSMA-related technologies and services.</li><div><i>We sincerely thank all applicants in advance for submitting their interest in this opportunity with Airalo. </i></div>","tags":"[\"management\",\"aws\"]","pubDate":"2024-03-04 22:39:05.444","link":"https://jobs.lever.co/airalo/8fa60fbe-61ef-4579-a503-9a319dbc3a58","savedDate":"2024-03-05 16:56:26.836","slug":"social-media-community-specialist-latam-airalo-7248"},{"id":7994450438,"title":"Head of Data & Revenue Operations","company":"Circle","image":"https://lever-client-logos.s3.us-west-2.amazonaws.com/3b00b20d-12c8-4ed9-ae9e-97d8601567b2-1706111761671.png","description":"<div><b style=\"font-size: 18px\">About Us</b></div><div>Circle is building the world’s leading all-in-one platform for online communities. We make it possible for creators, coaches, educators, and businesses to bring together their audience with engaging discussions, live streams, events, chat, courses, and payments — all in one place, all under their own brand.</div><div><br></div><div>We’re proud to be a fully remote company of around 130 (and growing!) team members from 30+ countries around the world. We strive to find exceptional talent, empower them to do their best work, and in turn, have a meaningful impact in their own lives. We don’t track hours, but we manage for outcomes in an a-synchronous culture.</div><div><br></div><div>Twice a year, we bring the whole company together for incredible company retreats in beautiful places around the world!</div><div><br></div><div><b style=\"font-size: 18px\">About the role</b></div><div>We're looking for an experienced Revenue Operations &amp; Data leader ahead of Circle’s next phase of growth. This role sits on our leadership team and reports directly to Circle’s co-founder/Chief Revenue Officer. Ultimately, you will oversee and integrate the company's revenue operations, data analytics, and technology systems — all with the goal to drive growth, operational efficiency, and data-driven decision-making across Circle’s GTM org. You’ll do this by leading an experienced team of ~7 people in designing the strategy, choosing the technology, building and maintaining the analytics infrastructure of our go-to-market organization. The GTM org includes approximately 60 professionals in marketing, sales, and customer success.&nbsp;</div><div><br></div><div>Working on the RevOps &amp; Data team connects you to the entire organization. We are a close partner with nearly every function at the company. Our RevOps team may help design our CRM one day and develop a marketing attribution model the next. Other days, RevOps may lead our quarterly forecasting and financial budgeting process. The team plays a critical role in our growth.&nbsp;</div><h3>What you'll be doing</h3><li><b>You will oversee both revenue operations and data at Circle. </b>As part of this responsibility, you will design a revenue operations and data org that can support our sales, marketing, and customer success teams as Circle’s business continues to scale. You’re always looking 6-18 months ahead.</li><li><b>Co-develop the go-to-market strategy with the head of sales, head of customer success, and head of marketing.</b> This will include our quarterly &amp; annual planning processes.</li><li><b>Help develop the revenue operations roadmap.</b> You’ll set strategy when determining which projects to invest resources into and the sequencing of implementation. This could be migrating our CRM from Hubspot to Salesforce, implementing a new chat tool for our sales org, or partnering with the marketing team to setup a new lead scoring system. These are high-impact projects that the revenue operations team will drive across the finish line. You’ll empower the team to execute, while staying close to each project and ensuring high standards are met.</li><li><b>Own the data analytics roadmap.</b> At Circle, our data team reports into our head of revenue operations &amp; data, providing a holistic, Our team is making fast progress on key data projects, like implementing DBT, improving our Looker environment, introducing enablement for the GTM org, rolling out Monte Carlo to improve data monitoring and reliability. You will guide our team in developing the roadmap, finding new areas of opportunity, and ensuring we follow best-practices.</li><li><b>Oversee all technology decisions across the revenue org, including the CRM, our data stack, and automations.</b> This includes vendor evaluation, procurement and implementation. You’re able to look ahead and understand tradeoffs of certain technology decisions, limit technical debt, and only introduce complexity when needed.</li><li><b>Drive the adoption of data-driven decision-making processes throughout the organization</b>, enhancing our data analytics capabilities to support business strategies.</li><li><b>Ensure reliability, consistently, and accuracy for our reporting within the revenue org.</b> We should feel this in our daily operating reports, our monthly, quarterly, and annual planning. You’ll partner closely with our head of finance to establish these definitions.</li><li><b>Oversee all operations around variable comp payouts</b> — across sales, marketing and customer success.</li><li><b>Help run our weekly business review meeting for the revenue leadership team.</b> This includes setting the agenda, support in forecasting, improving predictions, and establishing pacing towards goals.</li><li><b>Collaborate with the product team and engineering to proactively improve our strategy for data warehousing and data architecture.</b> For instance, a strong relationship here will enable the revenue team to be able to see a 360 degree view of the customer in the CRM, including product usage, customer engagement (support tickets, sales emails, marketing campaigns, attribution) and contract data.</li>,<h3>What you'll need to be successful</h3><li>You have at least 7-10+ years of Revenue Operations and Data experience in a high-growth, software company environment. With at least 4 of those managing a related team. You’ve done this before.</li><li>You have a deep understanding of data environments and technology stacks.</li><li>You have experience in a product-led company like Circle and/or a software company with some self-serve motion. Or, you have experience in an org that sells multiple products.</li><li>You’re comfortable with Hubspot, Salesforce or a similar CRM, and you are an expert at CRM admin and implementation.</li><li>You’re able to thrive in a fast-growing, venture backed startup environment that requires quick decisions and action — while also knowing when to invest long-term and understand downstream effects of your decisions.</li><li>You have successfully managed a tech stack with common sales, marketing and data tools (such as Hubspot, Intercom, Monte Carlo, Marketo, Census, Drift, or others.)</li><li>Experience supporting the full spectrum of revenue functions — spanning marketing, sales &amp; CS.</li><li>You are a leader and a coach with a track record of helping members of your team grow in their roles. You have experience building a team, including hiring leaders and managers.</li><li>You have a strong work ethic. We’re a fast-growing venture backed startup with ambitious plans and our team has a lot to deliver on.</li><li>You are an excellent writer and communicator. We’re a fully-remote team, and excellent writing is a key requirement in the role, especially for a team lead.</li><li>You have strong presentation skills and executive presence.</li><div><b style=\"font-size: 18px\">The fun stuff</b></div><div><b>Fully remote:</b>&nbsp;work from anywhere in the world!</div><div><b>Autonomy and trust to do your job:</b>&nbsp;we care about outcomes over everything else.</div><div><b>Paid time away:</b>&nbsp;all employees are given 35 days of PTO annually.</div><div><b>Generous U.S. benchmarked compensation</b>&nbsp;and startup equity no matter where you are in the world.*</div><div><b>Awesome medical coverage</b>&nbsp;with 100% coverage for you and your family, or medical reimbursement options where applicable!*</div><div><b>Home office stipend</b>&nbsp;to help you get up and running.</div><div><b>Learning &amp; development stipend</b>&nbsp;to help you level up your professional skills.</div><div><b>Annual bonus potential</b>&nbsp;for roles that don't already receive variable income or commission.</div><div><b>Company retreats:</b>&nbsp;Twice a year, the Circle team gets together for a fully paid company retreat in incredible places around the world! We’ve had past retreats in Colombia, Portugal, and Mexico, with more planned on the horizon.</div><div><b>Check out our&nbsp;</b><a href=\"https://careers.circle.so/\" class=\"postings-link\"><b>Careers</b></a><b>&nbsp;page for more.</b></div><div><span style=\"font-size: 10px\">*</span><i style=\"font-size: 10px\">Your role, location and unique circumstance may affect this.</i></div><div><br></div><div><b>Diversity, Equity &amp; Inclusion</b></div><div>As a fully-remote international company, diversity is baked into our DNA. Here’s how our CEO, Sid Yadav, frames our hiring mission: “let’s find talent in underserved and under-represented corners of the world, set them up to do the best work of their lives, and in turn, change their life.” To achieve this hiring mission, we offer competitive&nbsp;<a href=\"http://u.s.-benchmarked/\" class=\"postings-link\">U.S.-benchmarked</a>&nbsp;compensation no matter where someone’s located in the world, and we proactively seek candidates who expand representation of backgrounds, cultures and lived experiences in our teams.</div><div><br></div><div><b>Equal Employment Opportunity</b></div><div>Circle is an equal opportunity employer and as such, we do not discriminate on the basis of race, color, religion, sex, sexual orientation, gender identity, national origin, age, disability, or any other characteristic protected by applicable laws.</div><div>If you require any accommodations during the recruitment process, please let us know and we will work with you to meet your needs.</div>","tags":"[\"Finance\",\"engineering\",\"aws\"]","pubDate":"2024-03-04 21:49:47.551","link":"https://jobs.lever.co/circleco/5442e87d-4018-4e42-93ec-30a24f968f03","savedDate":"2024-03-05 16:56:26.835","slug":"head-of-data-revenue-operations-circle-2395"},{"id":6115106529,"title":"Contracting Associate","company":"Spark Advisors","image":"https://remotive.com/job/1899252/logo","description":"<div><!--block-->We are hiring a Contracting Associate to support our Contracting Supervisor and become part of a team that delivers exceptional customer service! The ideal candidate is someone who enjoys speaking with clients, excels at creative problem-solving and learning new skill sets, and genuinely loves helping people. You will report directly to the Contracting Supervisor.</div><br><br><div class=\"h3\">Key Responsibilities</div><ul style=\"\"><li style=\"\"><!--block-->Become the go-to for all things carrier contracting &amp; certifications at Spark</li><li style=\"\"><!--block-->Assist Agents in transferring carrier contracts to Spark &amp; getting new contracts under Spark</li><li style=\"\"><!--block-->Handle inbound and outbound phone calls from Agents with a focus on providing exceptional customer experience by utilizing active listening and communication skills throughout the contracting process</li><li style=\"\"><!--block-->Leverage customer service techniques to troubleshoot customer inquiries and ensure the Agent’s issues are resolved via email, phone, and Zoom</li><li style=\"\"><!--block-->Provide a pleasant contracting onboarding experience for agents</li><li style=\"\"><!--block-->Adhere to the core values and mission of Spark and incorporate them into daily decision-making and initiatives </li></ul><br><br><div class=\"h3\">Skills, Knowledge and Expertise</div><ul style=\"\"><li style=\"\"><!--block-->1-3 years of experience working in customer success, account management, or operations </li><li style=\"\"><!--block-->1-3 years of experience working with Medicare (optional)</li><li style=\"\"><!--block-->Ability to utilize a customer relationship management system and other software to effectively triage support requests from agents</li><li style=\"\"><!--block-->Excellent verbal and written communication skills</li><li style=\"\"><!--block-->Quickly adapts to new technologies, workflows, and troubleshooting technical issues</li><li style=\"\"><!--block-->Self-starter able to work independently without much supervision</li><li style=\"\"><!--block-->Extremely detail-oriented</li><li style=\"\"><!--block-->Ability to work in a team environment</li></ul><br><br><div class=\"h3\">Benefits</div><div><!--block-->At Spark, one of our biggest priorities is helping you and your family thrive. We're committed to supporting your happiness, healthiness and overall wellbeing by providing a comprehensive benefits program. We offer:</div><ul style=\"\"><li style=\"\"><!--block-->Equity compensation</li><li style=\"\"><!--block-->Health care, including dental and vision through our PEO Sequoia</li><li style=\"\"><!--block-->Flexible work location; co-working available</li><li style=\"\"><!--block-->Paid Time Off</li><li style=\"\"><!--block-->Monthly Remote Work Stipend (help cover costs of home-office needs)</li><li style=\"\"><!--block-->Paid Parental Leave<ul style=\"\"><li style=\"\"><!--block-->Up to 12 weeks for birthing parents</li><li style=\"\"><!--block-->Up to 6 weeks for non-birth parents</li></ul></li><li style=\"\"><!--block-->11 paid holidays</li><li style=\"\"><!--block-->Wellbeing Perks through SpringHealth, OneMedical, PerkSpot, and SoFi</li></ul><div><!--block-->In addition, we are proud of our robust remote culture and annual opportunities for all employees to connect in person.</div><img src=\"https://remotive.com/job/track/1899252/blank.gif?source=public_api\" alt=\"\"/>","tags":"[\"CRM\",\"account management\"]","pubDate":"2024-03-04 03:20:44.000","link":"https://remotive.com/remote-jobs/customer-support/contracting-associate-1899252","savedDate":"2024-03-05 16:56:26.830","slug":"contracting-associate-spark-advisors-8274"},{"id":7328023533,"title":"Talent Acquisition Specialist","company":"CoverGo","image":"https://pbs.twimg.com/profile_images/1382655628523364355/MWPIbbID_400x400.jpg","description":"<p><strong>Top 3 Reasons To Join Us&nbsp;</strong></p><ul> <li>Competitive Salary</li> <li>100% Globally Remote</li> <li>Working on the latest tech for the Insurtech Market Leader</li> </ul><p></p><p><strong>About Us</strong></p><p>At CoverGo, our mission is to empower all insurance companies to make insurance 100% digital and accessible to everyone.</p><ul> <li>We are a leading global no-code insurance platform for health, life, and P&amp;C;</li> <li>We’re the winner of the Insurtech of the Year in all of Asia and other awards globally;</li> <li>We work with insurance enterprise clients such as AXA, Bupa, MSIG, Dai-ichi, Bank of China Group Insurance, and many more;</li> <li>We're an international, diverse team of over 120 people with 30 nationalities and team members working remotely from all over the world;</li> <li>We are fully funded and backed by reputable VC funds and strategic institutional investors;</li> <li>We have a global presence in Asia, EMEA and the Americas;</li> <li>We’ve grown our annualized revenue by over 30x since January 2021;</li> <li>We’re constantly working towards making CoverGo a workplace that you love coming to. We deeply believe that bringing together a diversity of thoughts, expressions, and perspectives is key to building the best culture for equally diverse communities all over the world.</li> </ul><p></p><p><strong>What you will do:</strong></p><ul> <li>Develop and implement innovative and effective recruitment strategies to attract qualified candidates.</li> <li>Collaborate with hiring managers to understand staffing needs and create tailored recruitment plans.</li> <li>Utilize various channels, including job boards, social media, and networking events, to source and attract high-quality candidates.</li> <li>Build and maintain a strong talent pipeline for current and future hiring needs.</li> <li>Conduct thorough candidate assessments, including resume reviews, initial interviews, and skills assessments.</li> <li>Present qualified candidates to hiring managers, providing detailed evaluations and recommendations.</li> <li>Foster positive relationships with hiring managers and department heads to understand team dynamics and cultural fit requirements.</li> <li>Act as a strategic partner in talent acquisition, providing guidance on market trends and best practices.</li> <li>Coordinate and schedule interviews between candidates and hiring teams.</li> <li>Provide guidance to interviewers on effective interview techniques and best practices.</li> <li>Collaborate with hiring managers to develop competitive and compelling job offers.</li> <li>Conduct salary negotiations and ensure a smooth offer acceptance process.</li> <li>Work closely with HR and hiring managers to facilitate a seamless onboarding process for new hires.</li> <li>Provide ongoing support and communication to new hires during their transition.</li> </ul><p></p><p><strong>What We Need:</strong></p><ul> <li>Bachelor's degree in Human Resources, Business Administration, or a related field.</li> <li>Proven experience as a Talent Acquisition Specialist or in a similar recruitment role.</li> <li>Strong understanding of recruitment best practices and market trends.</li> <li>Excellent communication and interpersonal skills.</li> <li>Good command of English is a must, knowing other languages would be an advantage.</li> <li>Ability to manage multiple priorities and work in a fast-paced environment.</li> <li>Familiarity with applicant tracking systems (ATS) and HR software.</li> <li>Working experience with international businesses</li> <li>Able to work independently and under pressure in a fast-paced environment with an emphasis on accuracy and timeliness</li> <li>Meticulous, well-organized and conscientious with a high level of initiative at work</li> <li>Self-motivated, hardworking, a strong sense of responsibility with a positive working attitude</li> <li>Resourceful, can-do attitude and willingness to learn and go beyond</li> </ul><p></p><p><strong>Why You'll Love Working Here</strong></p><ul> <li>Fully Remote</li> <li>Flexible Leave</li> <li>International Environment</li> <li>Competitive remuneration package</li> <li>Performance Bonus</li> <li>Stock Options after 6 months</li> <li>Company activities and events</li> <li>Learning and development plan</li> </ul><p><strong>Covergo Company</strong><a href=\"https://www.youtube.com/watch?v=YI0ezLxvFvA\" rel=\"nofollow noreferrer noopener\" class=\"external\"><strong> Video</strong></a></p><p>By submitting your application, you confirm that you have read, understood, and accepted the content of CoverGo’s <a href=\"https://apply.workable.com/covergo/gdpr_policy?lng=en\" target=\"_blank\" rel=\"nofollow noreferrer noopener\" class=\"external\">Privacy Notice</a> and you consent to the processing of your data as part of this application.</p><h3>Requirements: </h3><h3>Benefits: </h3>","tags":"[]","pubDate":"2024-03-04 00:00:00.000","link":"https://apply.workable.com/covergo/j/6FE4CDA25C","savedDate":"2024-03-05 16:56:26.834","slug":"talent-acquisition-specialist-covergo-3300"},{"id":9377017300,"title":"Full Stack Engineer (Fully Remote)","company":"CoverGo","image":"https://pbs.twimg.com/profile_images/1382655628523364355/MWPIbbID_400x400.jpg","description":"<p><strong>Top 3 Reasons To Join Us</strong></p><ul> <li>Competitive Salary</li> <li>100% Remote</li> <li>Working on the latest tech for the Insurtech Market Leader</li> </ul><p><strong>About Us</strong></p><p>At CoverGo, our mission is to empower all insurance companies to make insurance 100% digital and accessible to everyone.</p><ul> <li>We are a leading global no-code insurance platform for health, life, and P&amp;C</li> <li>We’re the winner of the Insurtech of the Year in all of Asia and other awards globally</li> <li>We work with insurance enterprise clients such as AXA, Bupa, MSIG, Dai-ichi, Bank of China Group Insurance, and many more</li> <li>We're an international, diverse team of over 120 people with 30 nationalities and team members working remotely from all over the world</li> <li>We are fully funded and backed by reputable VC funds and strategic institutional investors</li> <li>We have a global presence in Asia, EMEA and the Americas</li> <li>We’ve grown our annualized revenue by over 30x since January 2021</li> <li>We’re constantly working towards making CoverGo a workplace that you love coming to. We deeply believe that bringing together a diversity of thoughts, expressions, and perspectives is key to building the best culture for equally diverse communities all over the world</li> </ul><p><strong>About the Role</strong></p><p>As a Full Stack Engineer at CoverGo, you will contribute to the ongoing development and enhancement of our innovative insurance enterprise software solutions. Showcase your proficiency with both front-end and back-end technologies. Collaborate with cross-functional teams, participate in code reviews, and contribute to maintaining code quality through testing. Investigate and address bugs promptly to ensure the reliability and security of our platform while staying informed about the latest technologies and best practices in software development.</p><p><strong>What You Will Do</strong></p><ul> <li>Contribute to the design, implementation, and maintenance of new features and functionalities for our SaaSplatform.</li> <li>Work with both front-end and back-end technologies.</li> <li>Collaborate with cross-functional teams to understand end-user requirements, translating them into scalable and efficient software solutions.</li> <li>Participate in code reviews, adhere to coding best practices, and contribute to maintaining code quality through unit and integration testing.</li> <li>Investigate and address bugs promptly to ensure the reliability of the platform.</li> <li>Contribute to ensuring security and compliance by following best practices and adhering to industry regulations.</li> <li>Stay informed about the latest technologies, frameworks, and best practices in software development.</li> </ul><p><strong>What We Need</strong></p><ul><ul> <li>Proven experience +4 years as a Full Stack Engineer, working on complex SAAS applications</li> <li>Strong technical background with proficiency in front-end and back-end technologies, such as JavaScript, Vue, .NET Core, C#, GraphQL, MongoDB, Docker</li> <li>Familiarity with cloud platforms like AWS, Azure, or Google Cloud for building scalable applications</li> <li>Thorough understanding and practical experience with Test-Driven Development (TDD) to ensure robust and well-tested code</li> <li>Experience with unit, integration and function testing using front-end and back-end testing libraries</li> <li>Proficiency in Domain-Driven Design (DDD) principles to create a maintainable and modular architecture that aligns with business domains</li> <li>In-depth knowledge of web security best practices and experience in ensuring compliance with industry regulations</li> <li>Demonstrated experience in performance optimization for high-traffic web applications</li> <li>Experience with container technologies like docker and good understanding of cloud infrastructure and solutions.</li> <li>Experience with agile development methodologies and collaborating with cross-functional teams</li> <li>Excellent problem-solving skills and a proactive approach to troubleshooting and bug fixing</li> <li>Strong communication skills to effectively interact with both technical and non-technical team members with diverse backgrounds</li> <li>A passion for staying updated with the latest trends, technologies, and best practices in software development</li> </ul></ul><p><strong>Why You'll Love Working Here</strong></p><ul> <li>Fully Remote</li> <li>Flexible Leave</li> <li>International Environment</li> <li>Competitive renumeration package</li> <li>Performance Bonus</li> <li>Stock Options after 6 months </li> <li>Company activities and events</li> <li>Learning and development plan</li> </ul><p><strong>CoverGo Company</strong><a href=\"https://www.youtube.com/watch?v=YI0ezLxvFvA\" rel=\"nofollow noreferrer noopener\" class=\"external\"><strong> Video</strong></a></p><p>By submitting your application, you confirm that you have read, understood, and accepted the content of CoverGo’s <a href=\"https://apply.workable.com/covergo/gdpr_policy?lng=en\" target=\"_blank\" rel=\"nofollow noreferrer noopener\" class=\"external\">Privacy Notice</a> and you consent to the processing of your data as part of this application.</p><p><a href=\"https://www.youtube.com/watch?v=YI0ezLxvFvA\" rel=\"nofollow noreferrer noopener\" class=\"external\"></a></p><h3>Requirements: </h3><h3>Benefits: </h3>","tags":"[\"javascript\",\"mongo\",\"aws\"]","pubDate":"2024-03-04 00:00:00.000","link":"https://apply.workable.com/covergo/j/34D3EFA62F","savedDate":"2024-03-05 16:56:26.834","slug":"full-stack-engineer-fully-remote-covergo-5723"},{"id":3037026957,"title":"Senior Protocol Engineer, Node","company":"OP Labs","image":"https://remotive.com/job/1899594/logo","description":"<div class='\"content-intro\"'><p>We believe Ethereum has the potential to solve some of humanity’s most crucial coordination issues. Since our initial inception as a research group, we have sought to scale both its technology and values.</p>\n<p>At present, the most pressing bottleneck to the growth of Ethereum is its performance and scalability. We are building the most elegant solution to this problem. We do this in the open (<a href=\"%22https://github.com/ethereum-optimism/optimism%22\" rel=\"nofollow\">under an MIT open source license</a>) because we believe in open source innovation and its ability to accelerate growth.</p>\n<p>OP Labs is building Optimism mainnet, and by extension, the infrastructure that powers all OP-Stack chains. We are improving Ethereum’s performance by orders of magnitude and donating the profits from doing so to funding Ethereum public goods. By operating as a Public Benefit Corporation, OP Labs can align its incentives with the public good and take positive-sum steps toward a sustainable future for the internet.</p>\n<p> </p></div><div class=\"h3\">What are the role responsibilities?</div>\n<ul style=\"\">\n<li style=\"\">Work alongside the OP Labs Protocol Team to build the Optimism protocol</li>\n<li style=\"\">Act as a main driver of the core OP Stack development process. E.g. develop op-geth, op-node, op-batcher, and op-proposer</li>\n<li style=\"\">Implement protocol upgrades</li>\n<li style=\"\">Work with the OP Labs DevInfra team to maintain the production networks (OP Mainnet &amp; Sepolia) and the wider Superchain infrastructure</li>\n<li style=\"\">Support additional core development teams in contributing to the OP Stack</li>\n</ul>\n<div class=\"h3\">What skills do you bring?</div>\n<ul style=\"\">\n<li style=\"\">Extensive experience in a software engineering role shipping production code</li>\n<li style=\"\">Significant experience developing, testing, and deploying smart contracts to mainnet</li>\n<li style=\"\">Deep knowledge of Ethereum and the EVM</li>\n<li style=\"\">Strong grasp of computer science and distributed systems fundamentals</li>\n<li style=\"\">Experience writing Go and Solidity or a willingness to learn</li>\n</ul>\n<p> </p><div class='\"content-conclusion\"'><div class=\"h3\">What will you like about us?</div>\n<ul style=\"\">\n<li style=\"\">We take care of our employees. Competitive compensation, fully paid medical, dental, and vision, and a 4% 401K match—learn more about our <a href=\"%22https://www.notion.so/79f82dd0763e4344b99e9ce3ea1728da?pvs=21%22\" rel=\"nofollow\"><strong>benefits, culture, and all recruiting FAQ here.</strong></a></li>\n<li style=\"\">We take pride in the accomplishments of our teammates and support each other in doing the best work of our careers.</li>\n<li style=\"\">Our team is a diverse group of people from varied backgrounds. We cherish our eclecticism and consider it a great strength.</li>\n<li style=\"\">We’re fully remote, deeply engaged, highly skilled, and like to have fun.</li>\n<li style=\"\">We think long-term. Our founders have been scaling Ethereum since 2015.</li>\n</ul>\n<p><strong>We strongly encourage candidates of all different backgrounds to apply.</strong> We believe that our work is stronger with a variety of perspectives, and we’re eager to further diversify our company. If you have a background that you feel would make an impact at Optimism, please consider applying. We’re committed to building an inclusive, supportive place for you to do the best work of your career.</p></div><img src=\"https://remotive.com/job/track/1899594/blank.gif?source=public_api\" alt=\"\"/>","tags":"[\"go\",\"solidity\",\"Ethereum\"]","pubDate":"2024-03-03 19:20:23.000","link":"https://remotive.com/remote-jobs/software-dev/senior-protocol-engineer-node-1899594","savedDate":"2024-03-05 16:56:26.831","slug":"senior-protocol-engineer-node-op-labs-8374"}]