[{"id":6324159639,"title":"Financial Accountant","company":"Nethermind","image":"https://remotive.com/job/1990425/logo","description":"<div class='\"content-intro\"'><div class=\"h2\">What are we all about?</div>\n<p>We are a team of builders and researchers on a mission to empower enterprises and developers worldwide to access and build on decentralized systems.</p>\n<p>Our expertise covers several domains: Ethereum and Starknet protocol engineering, layer-2, AI, cryptography research, protocol research, decentralized finance (DeFi), security auditing, formal verification, real-time monitoring, smart contract development, and dapps and enterprise engineering.</p>\n<p>Working to solve some of the most challenging problems in the blockchain space, we frequently collaborate with renowned companies, such as Ethereum Foundation, Starknet Foundation, Gnosis Chain, Flashbots, Forta Protocol, Lido, EigenLayer, Open Zeppelin, RISCZero, Aleph Zero, and many more.</p>\n<p>Today, we are a 350+ strong team working remotely across 66+ countries.</p>\n<p>View all our open positions here: <a href=\"%22https://www.nethermind.io/open-roles%22\" rel=\"nofollow\">https://www.nethermind.io/open-roles </a></p></div><p>The Financial Accountant is <strong>r</strong>esponsible for assisting the Head of the Finance and Operations team with the day-to-day running of the finance function;</p>\n<div class=\"h3\">Objectives:</div>\n<ul style=\"\">\n<li style=\"\">To ensure the company has accurate financial books and records that are up-to-date</li>\n<li style=\"\">To ensure that the company has the right data to be able to make informed decisions</li>\n<li style=\"\">To assist the Head of Finance in building a scalable, efficient, and successful finance function and team</li>\n</ul>\n<div class=\"h3\">Responsibilities:</div>\n<ul style=\"\">\n<li style=\"\">Bookkeeping: Maintain accurate and up-to-date financial records by recording transactions in journals, ledgers, and accounting software.</li>\n<li style=\"\">Accounts Payable: Process invoices from suppliers, verify expenses, and prepare payments in a timely manner.</li>\n<li style=\"\">Accounts Receivable: Issue invoices to customers, track receivables, and follow up on overdue payments.</li>\n<li style=\"\">Bank Reconciliation: Reconcile bank statements with general ledger accounts to ensure accuracy and identify discrepancies.</li>\n<li style=\"\">Assisting with Month-End Close: Prepare journal entries, accruals, and prepayments to facilitate the month-end closing process.</li>\n<li style=\"\">Financial Reporting: Assist in the preparation of financial statements, including profit and loss statements, balance sheets, and cash flow statements.</li>\n<li style=\"\">VAT Returns: Calculate and submit Value Added Tax (VAT) returns to HM Revenue &amp; Customs (HMRC) in compliance with regulations.</li>\n<li style=\"\">Expense Management: Review employee expense reports, ensure compliance with company policies, and process reimbursements.</li>\n<li style=\"\">Assisting with Audits: Provide support during internal and external audits by preparing audit schedules, gathering documentation, and addressing auditor inquiries.</li>\n<li style=\"\">Ad Hoc Financial Analysis: Assist senior accountants or management with ad hoc financial analysis, budgeting, and forecasting tasks as required.</li>\n<li style=\"\">Compliance: Stay updated on changes in accounting regulations and ensure compliance with UK Generally Accepted Accounting Principles (UK GAAP) or International Financial Reporting Standards (IFRS).</li>\n<li style=\"\">Communication: Collaborate with colleagues in finance, as well as other departments, to address accounting-related queries and provide financial information as needed.</li>\n<li style=\"\">Process Improvement: Identify opportunities to streamline accounting processes, enhance efficiency, and strengthen internal controls.</li>\n<li style=\"\">Software Proficiency: Utilize accounting software (e.g., QuickBooks, Xero) and Microsoft Excel proficiently to perform tasks efficiently and accurately.</li>\n<li style=\"\">Professional Development: Pursue continuous learning and development opportunities to enhance accounting knowledge and skills.</li>\n</ul>\n<p><strong>Skills:</strong></p>\n<ul style=\"\">\n<li style=\"\">Bachelor’s degree in finance or any related field with 2 years of post qualification experience</li>\n<li style=\"\">Big 4 Background or equivalent</li>\n<li style=\"\">Knowledge of UK tax law and HMRC</li>\n<li style=\"\">Knowledge of IFRS</li>\n<li style=\"\">Strong numerical skills to help drive Nethermind's financial operations and improve financial performance</li>\n<li style=\"\">Ability to collaborate with all levels of management to organize, plan and achieve Nethermind’s financial goals</li>\n<li style=\"\">Proficiency in financial management software (including Xero and MS Excel)</li>\n</ul>\n<p><strong>Would be beneficial if you had:</strong></p>\n<ul style=\"\">\n<li style=\"\">Experience in blockchain (especially Ethereum) or crypto industry</li>\n<li style=\"\">Experience in Fintech</li>\n<li style=\"\">Previous experience with in-house accounting in a start-up environment</li>\n<li style=\"\">Fully remote setting work experience</li>\n<li style=\"\">Knowledge of US GAAP</li>\n</ul>\n<p> </p>\n<p> </p><div class='\"content-conclusion\"'><div><span style='\"font-size:'><em><span style='\"text-decoration:'><strong>Disclaimer</strong></span>: I hereby consent to my personal information being stored and processed by Demerzel Solutions Limited (t/a Nethermind) (the “Company”) for recruitment purposes in relation to both the selected job role and any other role the Company considers me a qualified candidate for. All data storing and processing by the Company takes place in accordance with the UK GDPR. Kindly refer to our privacy policy for more details. </em></span><br><span style='\"font-size:'><em>Your consent to share personal information is entirely voluntary, and you may withdraw your consent at any time. Should you have any questions about this process, or wish to withdraw your consent please contact: legalnotices@nethermind.io </em></span><br><br>Keep up to date on what we are working on by following <span class='\"il\"'>us</span> on <strong>our social channels<br><br></strong></div>\n<div><a href=\"%22https://twitter.com/nethermindeth%22\" rel=\"nofollow\" target='\"_blank\"'><img alt='\"\"' height='\"50\"' src=\"%22https://cdn4.iconfinder.com/data/icons/social-media-icons-the-circle-set/48/twitter_circle-512.png%22\" width='\"50\"'></a>   <a href=\"%22https://discord.com/invite/PaCMRFdvWT%22\" rel=\"nofollow\" target='\"_blank\"'><img alt='\"\"' height='\"49\"' src=\"%22https://cdn3.iconfinder.com/data/icons/popular-services-brands-vol-2/512/discord-1024.png%22\" width='\"49\"'></a>   <a href=\"%22https://www.linkedin.com/company/nethermind/mycompany/%22\" rel=\"nofollow\" target='\"_blank\"'><img alt='\"\"' height='\"49\"' src=\"%22https://cdn1.iconfinder.com/data/icons/logotypes/32/circle-linkedin-1024.png%22\" width='\"49\"'></a></div>\n<div> </div>\n<div><strong><a href=\"%22https://www.nethermind.io/legal%22\" rel=\"nofollow\" target='\"_blank\"'><em>Click here to view our Privacy Policy.</em></a></strong></div></div><img src=\"https://remotive.com/job/track/1990425/blank.gif?source=public_api\" alt=\"\"/>","tags":"[\"accounting\",\"crypto\",\"excel\",\"security\",\"blockchain\",\"AI/ML\",\"research\",\"documentation\",\"Ethereum\",\"bookkeeping\",\"GAAP\",\"quickbooks\",\"fintech\"]","pubDate":"2025-03-28T19:51:20.000Z","link":"https://remotive.com/remote-jobs/finance-legal/financial-accountant-1990425","slug":"financial-accountant-nethermind-4986"},{"id":1093275232,"title":"Software Engineer","company":"Canny","image":"https://remotive.com/job/1989192/logo","description":"<p>Thousands of companies build better software products with the help of Canny’s customer feedback platform. As a <strong>Software Engineer</strong> at Canny, you will play a central role in shaping our product's future, building new features, and refining our platform to offer an unparalleled user experience.</p>\n<p><br>We are...</p>\n<ul style=\"\">\n<li style=\"\">\n<p>Fully remote with no office</p>\n</li>\n<li style=\"\">\n<p>16 people, spread across 4 countries (US, Canada, Mexico, Spain, Turkey)</p>\n</li>\n<li style=\"\">\n<p>Bootstrapped (no outside funding) and profitable</p>\n</li>\n</ul>\n<p> </p>\n<p><strong>What you'll do at Canny</strong>:</p>\n<ul style=\"\">\n<li style=\"\">\n<p>Collaborate with the product and design teams to develop and implement new features that address user needs.</p>\n</li>\n<li style=\"\">\n<p>Optimize and refine existing code to improve performance, scalability, and maintainability.</p>\n</li>\n<li style=\"\">\n<p>Troubleshoot, identify, and resolve software defects to ensure a smooth user experience.</p>\n</li>\n<li style=\"\">\n<p>Participate in code reviews, fostering a culture of quality and collaborative learning.</p>\n</li>\n<li style=\"\">\n<p>Keep up-to-date with industry best practices and technologies to maintain Canny’s edge in the market.</p>\n</li>\n<li style=\"\">\n<p>Contribute to technical documentation, ensuring ease of use and understanding for future reference.</p>\n</li>\n</ul>\n<p> </p>\n<p><strong>Tech you’ll use every day:</strong></p>\n<ul style=\"\">\n<li style=\"\">\n<p>Our stack - TypeScript, ReactJS, Node.js, MongoDB</p>\n</li>\n<li style=\"\">\n<p>DevOps - AWS, GitHub, CircleCI, MongoDB Atlas</p>\n</li>\n<li style=\"\">\n<p>Slack - team and some customer communication</p>\n</li>\n<li style=\"\">\n<p>Canny - tracking user feedback 🙂</p>\n</li>\n<li style=\"\">\n<p>Missive - email collaboration</p>\n</li>\n<li style=\"\">\n<p>ClickUp - project management</p>\n</li>\n</ul>\n<p> </p>\n<p><strong>Compensation &amp; Benefits:</strong></p>\n<ul style=\"\">\n<li style=\"\">\n<p>Base salary, competitive in all major cities</p>\n</li>\n<li style=\"\">\n<p>Bonus program (8% of base salary, varies on performance)</p>\n</li>\n<li style=\"\">\n<p>Regular Compensation Reviews (conducted semi-annually)</p>\n</li>\n<li style=\"\">\n<p>Equity grant (RSUs)</p>\n</li>\n<li style=\"\">\n<p>20 paid vacation days, 15 paid holidays, and unlimited sick leave.</p>\n</li>\n<li style=\"\">\n<p>Benefits: medical, dental, and vision insurance</p>\n</li>\n<li style=\"\">\n<p>In-person team retreats twice a year</p>\n</li>\n</ul>\n<p> </p>\n<p>Join us at Canny and be a part of a team passionate about build high quality software products. We look forward to reviewing your application!</p>\n<div class=\"h4\">Experience you'll bring to Canny:</div>\n<ul style=\"\">\n<li style=\"\">\n<p>3-5 years of professional, full stack software engineering experience.</p>\n</li>\n<li style=\"\">\n<p>Production experience with JavaScript and/or TypeScript, React, Node.js, MongoDB, AWS.</p>\n</li>\n<li style=\"\">\n<p>Strong written and verbal communication skills</p>\n</li>\n<li style=\"\">\n<p>You are self-motivated and have strong organizational skills</p>\n</li>\n<li style=\"\">\n<p>A collaborative spirit, adept at fostering relationships with the product, engineering, and customer-facing teams.</p>\n</li>\n<li style=\"\">\n<p>Experience working autonomously and as a part of a small, preferably remote, team.</p>\n</li>\n<li style=\"\">\n<p>You have demonstrated the ability to onboard and integrate with an organization long-term:</p>\n<ul style=\"\">\n<li style=\"\">\n<p>within the last 5 years, you've worked at one company for at least 2 years</p>\n</li>\n</ul>\n</li>\n</ul>\n<p> </p>\n<div class=\"h4\"><strong>Bonus:</strong></div>\n<ul style=\"\">\n<li style=\"\">\n<p>Experience building enterprise and/or SaaS software</p>\n</li>\n</ul>\n<p><strong> </strong></p>\n<p><strong>Apply:</strong></p>\n<ul style=\"\">\n<li style=\"\">\n<p>In your application, please submit your resume, an optional cover letter, and explain your motivation for wanting to join Canny (we genuinely value understanding why you're drawn to us!).</p>\n</li>\n<li style=\"\">\n<p>A heads-up: Every application is carefully reviewed by our team. To stand out and ensure your success, please answer the screening questions diligently. Candidates who don't invest time in the screening questions rarely advance.</p>\n</li>\n<li style=\"\">\n<p>For some extra flair, share a link to your favorite GIF.</p>\n</li>\n</ul>\n<p><strong> </strong></p>\n<p><strong>Location:</strong></p>\n<ul style=\"\">\n<li style=\"\">\n<p>This role requires working North American hours to best serve our customers and coordinate with the team.</p>\n</li>\n</ul>\n<img src=\"https://remotive.com/job/track/1989192/blank.gif?source=public_api\" alt=\"\"/>","tags":"[\"javascript\",\"mongoDB\",\"node.js\",\"react\"]","pubDate":"2025-03-28T07:51:17.000Z","link":"https://remotive.com/remote-jobs/software-dev/software-engineer-1989192","slug":"software-engineer-canny-1618"},{"id":9658577178,"title":"Senior Software Engineer, Infrastructure (Platform - Networking)","company":"Coinbase Careers Page","image":"https://remotive.com/job/1989663/logo","description":"<div class='\"content-intro\"'>\n<p>Ready to be pushed beyond what you think you’re capable of?</p>\n<p>At Coinbase, our mission is to increase economic freedom in the world. It’s a massive, ambitious opportunity that demands the best of us, every day, as we build the emerging onchain platform — and with it, the future global financial system.</p>\n<p>To achieve our mission, we’re seeking a very specific candidate. We want someone who is passionate about our mission and who believes in the power of crypto and blockchain technology to update the financial system. We want someone who is eager to leave their mark on the world, who relishes the pressure and privilege of working with high caliber colleagues, and who actively seeks feedback to keep leveling up. We want someone who will run towards, not away from, solving the company’s hardest problems.</p>\n<p>Our <a href=\"%22https:/www.coinbase.com/mission%22\" rel=\"nofollow\">work culture</a> is intense and isn’t for everyone. But if you want to build the future alongside others who excel in their disciplines and expect the same from you, there’s no better place to be.</p>\n</div>\n<div class='\"p-rich_text_section\"'>The mission of the Platform Product Group engineers is to build a trusted, scalable and compliant platform to operate with speed, efficiency and quality. Our teams build and maintain the platforms critical to the existence of Coinbase. There are many teams that make up this group which include Product Foundations (i.e. Identity, Payment, Risk, Proofing &amp; Regulatory, Finhub), Machine Learning, Customer Experience, and Infrastructure.</div>\n<div class='\"p-rich_text_section\"'>\n<p>We are looking for an experienced Senior Software Engineer to join our Networks team to design, implement, and maintain our cloud-based network infrastructure. This team is a part of our Infrastructure org in our Platform Product Group. The mission of the Platform Product Group is to build a trusted, scalable and compliant platform to operate with speed, efficiency and quality. Our teams build and maintain the platforms critical to the existence of Coinbase.</p>\n<br><strong>What you’ll be doing (ie. job duties):</strong>\n<ul style=\"\">\n<li style=\"\">Architect, design, deploy, document and manage our Cloud-based network infrastructure. This includes all ingress and egress, both internal and external.</li>\n<li style=\"\">Implement customer-focused abstractions that simplify and standardize the way we offer our cloud services, topologies and implementations.</li>\n<li style=\"\">Coding IP tables and software defined networking</li>\n<li style=\"\">Lead and defend technical decisions providing design justification, coordination, and identifying value and requirements for other teams in the organization.</li>\n<li style=\"\">Learn and continue to foster an understanding of the long-term needs of our infrastructure.</li>\n<li style=\"\">Communicate to gather requirements and evangelize the Cloud offerings, and to understand gaps and improvements.</li>\n<li style=\"\">Produce professional documentation and diagrams to clearly and concisely communicate concepts and architectures to infrastructure colleagues, in addition to our users.</li>\n<li style=\"\">Manage and assist in the resolution of complicated technical problems and incidents, provide appropriate communication and escalation.</li>\n<li style=\"\">Support and maintain our current infrastructure offerings to maintain a high level of service and availability to the rest of the organization.</li>\n<li style=\"\">Develop strong and effective working relationships with the rest of the Infrastructure organization, Security, IT, business partners, stakeholders and vendors</li>\n<li style=\"\">Keep up to date with current developments and best practices within our domain and make bold and forward-looking recommendations.</li>\n</ul>\n<p><strong>What we look for in you (ie. job requirements):</strong></p>\n<ul style=\"\">\n<li style=\"\">At least 5+ years network engineering experience in industry</li>\n<li style=\"\">Built systems on public cloud providers such as AWS, GCP or Azure</li>\n<li style=\"\">Showcase strong proficiency within a modern tech stack, like Ruby, Go for languages and gRPC + Protobuf for communication.</li>\n<li style=\"\">Showcase proficiency with low-level primitives such as IP converged networks, AWS VPC, Transit Gateway, Direct connect, IAM role management and implementation</li>\n<li style=\"\">Know what high quality code — and software engineering processes — look like and know how to foster an environment that creates them.</li>\n<li style=\"\">Exhibit our core values: clear communication, positive energy, continuous learning, and efficient execution.</li>\n<li style=\"\">Flexibility to adapt and pivot in a dynamic and demanding environment where change is the only constant.</li>\n<li style=\"\">Ability to set priorities and balance multiple deadlines.</li>\n</ul>\n<p><strong>Nice to haves: </strong></p>\n<ul style=\"\">\n<li style=\"\">Crypto-forward experience, including familiarity with onchain activity such as interacting with Ethereum addresses, using ENS, and engaging with dApps or blockchain-based services.</li>\n</ul>\n<p>Job #: P61150</p>\n<p>*Answers to crypto-related questions may be used to evaluate your onchain experience.</p>\n</div>\n<div class='\"content-pay-transparency\"'>\n<div class='\"pay-input\"'>\n<div class='\"description\"'><strong>Pay Transparency Notice:</strong> Depending on your work location, the target annual salary for this position can range as detailed below. Full time offers from Coinbase also include target bonus + target equity + benefits (including medical, dental, vision and 401(k)).</div>\n<div class='\"title\"'>Pay Range:</div>\n<div class='\"pay-range\"'>$186,065<span class='\"divider\"'>—</span>$218,900 USD</div>\n</div>\n</div>\n<div class='\"content-conclusion\"'>\n<p>Please be advised that each candidate may submit a maximum of four applications within any 30-day period. We encourage you to carefully evaluate how your skills and interests align with Coinbase's roles before applying.</p>\n<div class=\"h3\">Commitment to Equal Opportunity</div>\n<p>Coinbase is committed to diversity in its workforce and is proud to be an Equal Opportunity Employer.  All qualified applicants will receive consideration for employment without regard to race, color, religion, creed, gender, national origin, age, disability, veteran status, sex, gender expression or identity, sexual orientation or any other basis protected by applicable law. Coinbase will also consider for employment qualified applicants with criminal histories in a manner consistent with applicable federal, state and local law.  For US applicants, you may view the Know Your Rights notice <a class='\"cds-link' href=\"%22https:/www.eeoc.gov/sites/default/files/2022-10/22-088_EEOC_KnowYourRights_10_20.pdf%22\" rel=\"nofollow\" target='\"_self\"'><span class='\"cds-typographyResets-t1xhpuq2'>here</span></a>.  Additionally, Coinbase participates in the <a class='\"c-link\"' href=\"%22https:/static-assets.coinbase.com/e-verify.pdf%22\" rel=\"nofollow\" target='\"_blank\"'>E-Verify program</a> in certain locations, as required by law. </p>\n<p>Coinbase is also committed to providing reasonable accommodations to individuals with disabilities. If you need a reasonable accommodation because of a disability for any part of the employment process, please contact us at accommodations[at]coinbase.com to let us know the nature of your request and your contact information.  For quick access to screen reading technology compatible with this site <a href=\"%22https:/chrome.google.com/webstore/detail/chromevox/kgejglhpjiefppelpmljglcjbhoiplfn%22\" rel=\"nofollow\">click here to download</a> a free compatible screen reader <a href=\"%22http:/www.chromevox.com/tutorial/%22\" rel=\"nofollow\">(free step by step tutorial can be found here)</a>.</p>\n<div class=\"h3\">Global Data Privacy Notice for Job Candidates and Applicants</div>\n<p>Depending on your location, the General Data Protection Regulation (GDPR) and California Consumer Privacy Act (CCPA) may regulate the way we manage the data of job applicants. Our full notice outlining how data will be processed as part of the application procedure for applicable locations is available <a href=\"%22https:/www.coinbase.com/legal/applicant_privacy_notice%22\" rel=\"nofollow\" target='\"_blank\"'>here</a>. By submitting your application, you are agreeing to our use and processing of your data as required. For US applicants only, by submitting your application you are agreeing to arbitration of disputes as outlined <a href=\"%22https:/www.coinbase.com/legal/application-arbitration-agreement%22\" rel=\"nofollow\">here.</a>    </p>\n<p> </p>\n</div>\n<img src=\"https://remotive.com/job/track/1989663/blank.gif?source=public_api\" alt=\"\"/>","tags":"[\"AWS\",\"GCP\"]","pubDate":"2025-03-28T07:51:16.000Z","link":"https://remotive.com/remote-jobs/software-dev/senior-software-engineer-infrastructure-platform-networking-1989663","slug":"senior-software-engineer-infrastructure-platform-networking-coinbase-careers-page-7859"},{"id":1914196767,"title":"Web3 Core Engineer","company":"Brave","image":"https://remotive.com/job/1989664/logo","description":"<div class=\"h4\"><strong>Web3 Core Engineer</strong></div>\n<p><strong>Remote</strong></p>\n<div class=\"h4\"><strong>About Brave</strong></div>\n<p>Brave is on a mission to protect the human right to privacy online. We’ve built a free web browser that blocks creepy ads and trackers by default, a private search engine with a <em>truly</em> independent index, a browser-native crypto wallet, and a private ad network (opt-in!) that directly rewards you for your attention. And we’re just getting started. Already 80 million people have switched to Brave for a faster, more private web. Millions more switch every month.</p>\n<p>The internet is a sea of ads, hackers, and echo chambers. Big Tech makes huge profits off our data, and tells us what’s true and what’s not. Brave is fighting back. Join us!</p>\n<div class=\"h4\"><strong>Summary</strong></div>\n<p>Brave is looking for an experienced Senior Software Engineer with a focus on blockchain integrations with Brave.  You'll work on our Brave Wallet.  This is a high profile and impactful, hands-on position.  Work together with our product designers, developers and privacy/security experts to help us take our wallet to the next level.</p>\n<p>Your responsibilities:</p>\n<ul style=\"\">\n<li style=\"\">Work closely with the backend team to understand intricacies and help iterate on components used to build our wallet libraries.</li>\n<li style=\"\">Integrate new features in brave-core that help our front-end team connect prototypes to live data.</li>\n<li style=\"\">Be up-to-date with upcoming protocol upgrades, BIPs, EIPs, etc.</li>\n<li style=\"\">Be involved in investigating bugs around blockchain edge cases.</li>\n</ul>\n<p> </p>\n<div class=\"h4\"><strong>Requirements</strong></div>\n<ul style=\"\">\n<li style=\"\">5+ years experience with application development.</li>\n<li style=\"\">Strong C++ development skills required.</li>\n<li style=\"\">Some JavaScript / TypeScript development skills are a plus.</li>\n<li style=\"\">History of open source contributions.</li>\n<li style=\"\">Good understanding of blockchain protocols (Bitcoin, Ethereum, Solana, etc.) and the DeFi ecosystem are a plus.</li>\n<li style=\"\">Familiarity with cryptocurrency wallet stack (mechanics, UX, etc.).</li>\n<li style=\"\">Experience with software development via distributed development teams.</li>\n<li style=\"\">Comfortable working in an open source setting.</li>\n<li style=\"\">A passion for helping protect users' privacy and security.</li>\n<li style=\"\">Written and verbal communication skills in English.</li>\n<li style=\"\">Proven record of getting things done.</li>\n</ul>\n<p> </p>\n<div class=\"h4\"><strong>Working at Brave</strong></div>\n<ul style=\"\">\n<li style=\"\">Industry-leader in privacy, with a research and engineering team that’s innovating everyday to keep people safer online and beat Big Tech</li>\n<li style=\"\">Highly competitive salaries &amp; benefits, and generous home-office stipends</li>\n<li style=\"\">Fully remote team (no office, no commute)</li>\n<li style=\"\">Welcoming, humble, ridiculously smart teammates, and a truly flat org structure</li>\n<li style=\"\">Opportunity to get in early at a hyper-growth company, and revolutionize the web</li>\n<li style=\"\">Oh, and did we mention Brendan, our CEO &amp; co-founder, <em>invented</em> JavaScript?</li>\n</ul>\n<div class=\"h4\"><strong> </strong></div>\n<p> </p>\n<img src=\"https://remotive.com/job/track/1989664/blank.gif?source=public_api\" alt=\"\"/>","tags":"[\"C++\",\"javascript\"]","pubDate":"2025-03-28T07:51:16.000Z","link":"https://remotive.com/remote-jobs/software-dev/web3-core-engineer-1989664","slug":"web3-core-engineer-brave-1107"}]