[{"id":9058211872,"title":"Product Designer","company":"SafetyWing","image":"https://pbs.twimg.com/profile_images/1177267684574208000/54eG3WmW_400x400.jpg","description":"<h2>🧘 What we offer:</h2> <ul><li><!--block-->Fully remote work environment – work from anywhere globally</li><li><!--block-->Competitive compensation and&nbsp; equity compensation</li><li><!--block-->A minimum of four weeks of vacation per year</li><li><!--block-->A personal development budget</li><li><!--block-->Premium health insurance that travels with you</li><li><!--block-->Travel insurance any time you travel outside of your home country</li><li><!--block-->New laptop, office allowance and more!</li><li><!--block-->Multiple team gatherings per year in amazing locations—our previous meetups were in Mexico, Bali, Siglufjörður and Hoi An<br><br></li></ul><div><!--block-->🚀 We look forward to hearing from you!</div> <div><!--block-->At <strong>SafetyWing</strong>, we’re building a global social safety net for remote workers—simple health, insurance, and retirement products designed to replace national welfare systems. Our mission is to remove geographical borders as a barrier to equal opportunity and freedom for everyone. If we succeed, we believe this will be one of the most important tasks of our time.</div><div><!--block--><br>As the <strong>Product Designer</strong> at <a href=\"https://safetywing.com/\">SafetyWing</a>, you will drive the design and development of our products. Your role extends beyond crafting exceptional designs; it's about adding depth and meaning to the experience while maintaining our core values.</div> <h2>👨‍🎤 As our Product Designer, you will:</h2>  <ul><li><!--block-->Lead product design initiatives from conception to final execution</li><li><!--block-->Drive continuous improvements in our design processes, proposing strategies to elevate the quality of outputs</li><li><!--block-->Ensure consistency in design outputs by collaborating closely with product managers, other designers and engineers</li><li><!--block-->Drive the evolution and adherence to SafetyWing's design system</li><li><!--block-->Present product design ideas to cross-functional teams and senior leadership</li></ul><div><!--block--><br></div> <h2>🧪 We are looking for someone who:</h2> <ul><li><!--block-->Has advanced product design experience demonstrated through a portfolio of impactful design solutions</li><li><!--block-->Has experience designing user experiences within insurance, finance or other compliance regulated sectors</li><li><!--block-->Is proficient in using design and prototyping tools such as Figma and is committed to continuous learning of new features</li><li><!--block-->Has experience conducting user research and usability testing</li><li><!--block-->Can communicate design ideas clearly and champion design principles across diverse audiences, including design and non-design stakeholders</li><li><!--block-->Can think beyond the immediate design task and understand the bigger business and product strategy</li></ul><div><!--block--><strong>😀 We like to work with people who:</strong></div><ul><li><!--block-->Want to help build a global social safety net on the internet</li><li><!--block-->Think for themselves instead of copying others</li><li><!--block-->Are willing to try new things, even with the risk of failure</li><li><!--block-->Are intellectually curious and open to new ideas</li><li><!--block-->Are creative and bold in the face of any problems</li><li><!--block-->Have strong integrity and do the right thing</li></ul>","tags":"[\"finance\"]","pubDate":"2025-02-22T11:47:38.174Z","link":"https://safetywing.pinpointhq.com/en/jobs/305326","slug":"product-designer-safetywing-6526"},{"id":3381771571,"title":"Product Marketer","company":"SafetyWing","image":"https://pbs.twimg.com/profile_images/1177267684574208000/54eG3WmW_400x400.jpg","description":"<h2>🧘 What we offer:</h2> <ul><li><!--block-->Fully remote work environment – work from anywhere globally</li><li><!--block-->Competitive compensation and&nbsp; equity compensation</li><li><!--block-->A minimum of four weeks of vacation per year</li><li><!--block-->A personal development budget</li><li><!--block-->Premium health insurance that travels with you</li><li><!--block-->Travel insurance any time you travel outside of your home country</li><li><!--block-->New laptop, office allowance and more!</li><li><!--block-->Multiple team gatherings per year in amazing locations—our previous meetups were in Mexico, Bali, Siglufjörður and Hoi An<br><br></li></ul><div><!--block-->🚀 We look forward to hearing from you!</div><div><!--block--><br></div> <div><!--block--><strong>SafetyWing (YC W18)</strong> is seeking a <strong>Product Marketer </strong>who will streamline our marketing strategies to enhance the success of our insurance products. In this role, you will dive into market research, craft compelling messaging, oversee product launches, and develop tools to boost customer acquisition and retention. Your efforts will ensure our audience understands and values our products, directly contributing to our growth.&nbsp;</div><div><!--block--><br></div><div><!--block-->We are on a mission to remove the role of geographical borders as a barrier to equal opportunities and freedom for everyone. And we are doing that by creating simple health, insurance, and retirement products for remote workers worldwide as a replacement for national welfare systems.</div> <h2>💻 Your responsibilities will include:</h2>  <ul><li><!--block-->Owning the product marketing strategy and execution for our core product lines, including positioning, messaging, and go-to-market planning</li><li><!--block-->Lead product launches and campaigns, coordinating cross-functionally with Sales, Customer Success, and Marketing teams and ensuring alignment with our core principles</li><li><!--block-->Talking to our customers to find out why they buy our products, assessing price sensitivity, and understanding market trends</li><li><!--block-->Craft clear, engaging messages that resonate with our diverse audience</li><li><!--block-->Overseeing successful product launches, serving as intermediary between product, creative and growth</li><li><!--block-->Leading efforts to track and refine our growth, making data-driven suggestions for enhancements</li><li><!--block-->Ensuring that both our team and customers have a deep understanding and appreciation of our product</li><li><!--block-->Work closely with our creative team to ensure brand-consistent messaging across channels&nbsp;</li><li><!--block-->Crafting marketing tools like web pages and ads to attract and keep customers, always seeking ways to do it better</li><li><!--block-->Collaborating with customer success to proactively tackle customer issues and refine their experience</li><li><!--block-->Leveraging your deep understanding of our product principles to make wise decisions, especially in managing projects and product launches</li></ul><div><!--block--><br></div> <h2>🧪 We are looking for someone who:</h2> <ul><li><!--block-->Has a strong background in product marketing, preferably in both B2C and B2B environments</li><li><!--block-->Is driven by data to make decisions and improve product positioning</li><li><!--block-->Has experience in creating strategies that resonate with target audiences</li><li><!--block-->Is creative, you’re familiar with and excited by brand storytelling (bonus if you have copywriting skills)</li><li><!--block-->Is a team player who's eager to collaborate across functions to achieve shared goals</li><li><!--block-->Is an innovative thinker, always looking for new ways to engage customers and improve their experience with our products</li><li><!--block-->Has a strong ability to communicate complex ideas simply and attractively</li></ul><div><!--block--><strong>😀 We like to work with people who:</strong></div><ul><li><!--block-->Want to help build a global social safety net on the internet</li><li><!--block-->Think for themselves instead of copying others</li><li><!--block-->Are willing to try new things, even with the risk of failure</li><li><!--block-->Are intellectually curious and open to new ideas</li><li><!--block-->Are creative and bold in the face of any problems</li><li><!--block-->Have strong integrity and do the right thing</li></ul>","tags":"[\"b2c\",\"b2b\"]","pubDate":"2025-02-22T11:47:38.174Z","link":"https://safetywing.pinpointhq.com/en/jobs/305368","slug":"product-marketer-safetywing-6091"},{"id":9426591153,"title":"Head of Marketing","company":"SafetyWing","image":"https://pbs.twimg.com/profile_images/1177267684574208000/54eG3WmW_400x400.jpg","description":"<h2>🧘 What we offer:</h2> <ul><li><!--block-->Fully remote work environment – work from anywhere globally</li><li><!--block-->Competitive compensation and&nbsp; equity compensation</li><li><!--block-->A minimum of four weeks of vacation per year</li><li><!--block-->A personal development budget</li><li><!--block-->Premium health insurance that travels with you</li><li><!--block-->Travel insurance any time you travel outside of your home country</li><li><!--block-->New laptop, office allowance and more!</li><li><!--block-->Multiple team gatherings per year in amazing locations—our previous meetups were in Mexico, Bali, Siglufjörður and Hoi An</li></ul><div><!--block--><br>🚀 We look forward to hearing from you!</div> <div><!--block--><strong>SafetyWing (YC W18)</strong> is seeking a <strong>Head of Marketing </strong>to scale our marketing function. We’re looking for&nbsp; a strategic, creative, hands-on marketing leader who can establish our marketing strategy while building a high performing team. This role combines strategic leadership with tactical execution, and we’re looking for someone equally comfortable crafting strategy and rolling up their sleeves to get things done.</div><div><!--block--><br></div><div><!--block-->At <strong>SafetyWing</strong>, we’re building a global social safety net for remote workers—simple health, insurance, and retirement products designed to replace national welfare systems. Our mission is to remove geographical borders as a barrier to equal opportunity and freedom for everyone. If we succeed, we believe this will be one of the most important tasks of our time.</div> <h2>💻 Your responsibilities will include:</h2>  <ul><li><!--block-->Develop our marketing strategy, focusing on brand establishment, demand generation, and market education across all our products</li><li><!--block-->Formalize&nbsp; our brand voice and positioning, differentiating us from both traditional insurance providers and competing startups</li><li><!--block-->Drive data-driven decision-making by establishing KPIs and analytics frameworks to measure marketing effectiveness across our marketing teams</li><li><!--block-->Collaborate closely with founders and executive team to align marketing strategy with company vision and growth targets</li><li><!--block-->Lead the development and execution of high-impact brand initiatives—set the strategic direction, collaborate with creative team and external agencies, and oversee the successful rollout of campaigns</li><li><!--block-->Serve as liaison between creative and marketing, bridging the gap between growth marketing goals and creative strategies</li><li><!--block-->Drive our content strategy, including steering cohesive messaging across the entire organization</li><li><!--block-->Assess various creative options and prioritize initiatives based on potential impact and alignment with business objectives</li><li><!--block-->Oversee all brand and comms touchpoints—including campaigns, emails, social media, podcasts, media relations, events, newsletters, merchandise, videos, thought leadership and more—to ensure a consistent and compelling brand experience that builds brand love and cultural impact</li></ul> <h2>🧪 We are looking for someone who:</h2> <ul><li><!--block-->Has a strong background leading a marketing team, preferably in both B2C and B2B environments</li><li><!--block-->Has experience in creating strategies and building new categories that resonate with target audiences</li><li><!--block-->Comfortable in data analytics and experience setting team targets and ensuring they’re met</li><li><!--block-->Is a team player who's eager to collaborate across functions to achieve shared goals</li><li><!--block-->Is an innovative thinker, always looking for new ways to engage customers and improve their experience with our products</li><li><!--block-->Has a strong ability to communicate complex ideas simply and attractively</li><li><!--block-->Is driven by data to make decisions and improve product positioning</li></ul><div><!--block--><strong>😀 We like to work with people who:</strong></div><ul><li><!--block-->Want to help build a global social safety net on the Internet</li><li><!--block-->Think for themselves instead of copying others</li><li><!--block-->Are willing to try new things, even with the risk of failure</li><li><!--block-->Are intellectually curious and open to new ideas</li><li><!--block-->Are creative and bold in the face of any problems</li><li><!--block-->Have strong integrity and do the right thing</li></ul>","tags":"[\"b2c\",\"b2b\"]","pubDate":"2025-02-22T11:47:38.174Z","link":"https://safetywing.pinpointhq.com/en/jobs/305372","slug":"head-of-marketing-safetywing-8786"},{"id":5412983603,"title":"Head of Performance Marketing","company":"Kindred","image":"https://pbs.twimg.com/profile_images/1515067066750885890/jAQEhnud_400x400.jpg","description":"<p style=\"min-height:1.5em\">Kindred is a members-only home swapping network that unlocks the ability to live a travel-rich lifestyle through the power of community. By exchanging primary residences with trusted peers, renters and owners alike can match with Kindred spirits and explore new destinations without breaking the bank.</p><p style=\"min-height:1.5em\">We are on a mission to build a sharing economy that lives up to the name, and we’ve raised significant capital from some of the best investors in Silicon Valley, including Index Ventures, Andreessen Horowitz, New Enterprise Associates, Bessemer Venture Partners, Caffeinated Capital, Elad Gil, and the founders of Opendoor, Figma, ClassPass, Clubhouse, Divvy, Gem, and Homebound.</p><p style=\"min-height:1.5em\">The co-founders are proven leaders from the early team at proptech company Opendoor ($15B+ exit) and have each separately built and scaled products that today do $1B+ annual revenue combined.</p><p style=\"min-height:1.5em\">We’re looking for the world’s top builders, executors, and believers to join us on this ride.</p><p style=\"min-height:1.5em\">You can learn more about us in <a target=\"_blank\" rel=\"noopener noreferrer nofollow\" href=\"https://www.forbes.com/sites/bridgetarsenault/2022/06/10/a-new-home-swapping-platform-allows-you-to-travel-the-world-like-cameron-diaz-and-kate-winslet/?sh=203a5d0722cb\">Forbes</a> and <a target=\"_blank\" rel=\"noopener noreferrer nofollow\" href=\"https://techcrunch.com/2023/04/19/opendoor-alums-raise-15m-for-kindred-a-home-swapping-network/\">TechCrunch</a>.</p><h1><strong>The Role:</strong></h1><p style=\"min-height:1.5em\">We’re looking for a well-traveled (literally and figuratively) Head of Performance Marketing to introduce Kindred to millions of future members. As we scale, this role will own and optimize every part of the acquisition funnel, driving efficient, high-quality growth across paid, organic, and emerging marketing channels.</p><p style=\"min-height:1.5em\">This is a high-impact, execution-driven role for someone who knows how to turn marketing spend into scalable, repeatable growth. If you’re as comfortable designing experiments as you are managing multi-million dollar budgets and thrive in a fast-paced, entrepreneurial environment, this is for you. But just as important as what you know is how you show up. Kindred is built on trust and generosity, and we’re looking for someone who leads with kindness, collaborates with humility, and lifts up the people around them.</p><h1><strong>You Will:</strong></h1><ul style=\"min-height:1.5em\"><li><p style=\"min-height:1.5em\">Own and scale Kindred’s acquisition strategy across paid search, paid social, content marketing, SEO, and other performance channels</p></li><li><p style=\"min-height:1.5em\">Design, launch, and continuously optimize marketing campaigns to drive high-quality growth at an efficient cost</p></li><li><p style=\"min-height:1.5em\">Manage the full acquisition funnel, ensuring seamless lead generation, conversion, and optimization at every stage</p></li><li><p style=\"min-height:1.5em\">Identify, test, and scale new acquisition channels beyond existing paid and organic strategies</p></li><li><p style=\"min-height:1.5em\">Develop a rigorous experimentation pipeline to refine messaging, targeting, and platform capabilities</p></li><li><p style=\"min-height:1.5em\">Partner with the product team to refine strategies that drive member value and long-term retention</p></li><li><p style=\"min-height:1.5em\">Build and manage performance reports and dashboards to surface insights, measure ROI, and guide strategy</p></li><li><p style=\"min-height:1.5em\">Build and mentor a world-class performance marketing team, fostering a culture of experimentation, data-driven decision-making, and continuous learning.</p></li><li><p style=\"min-height:1.5em\">Work closely with the creative team to develop high-performing ads and optimize asset performance</p></li><li><p style=\"min-height:1.5em\">Engage with partners (Meta, Google, LinkedIn, Twitter, TikTok) to identify new opportunities, resolve issues, and fully leverage platform capabilities</p></li><li><p style=\"min-height:1.5em\">Report performance metrics, key insights, and strategic recommendations to the executive team on a regular basis</p></li></ul><h1><strong>You May Be a Fit for This Role If You:</strong></h1><ul style=\"min-height:1.5em\"><li><p style=\"min-height:1.5em\">Are a collaborative, and low-ego leader who elevates those around them</p></li><li><p style=\"min-height:1.5em\">Have 12+ years of experience in performance marketing, growth marketing, or demand generation, ideally in marketplace, subscription, or e-commerce businesses</p></li><li><p style=\"min-height:1.5em\">Have 7+ years of experience leading teams, with a proven track record of building, scaling, and optimizing multimillion-dollar marketing budgets</p></li><li><p style=\"min-height:1.5em\">Have proven experience scaling companies from early-stage growth through late-stage, pre-IPO, and beyond, driving performance marketing strategies that evolve with the business.</p></li><li><p style=\"min-height:1.5em\">Have a deep understanding of paid acquisition, SEO, conversion rate optimization, and full-funnel growth strategies</p></li><li><p style=\"min-height:1.5em\">Are highly analytical, comfortable managing attribution models, performance dashboards, and budget forecasting</p></li><li><p style=\"min-height:1.5em\">Can confidently present performance insights, strategic recommendations, and growth opportunities to leadership, backed by data and a strong, well-articulated point of view.</p></li><li><p style=\"min-height:1.5em\">Have a test-and-learn mindset, with a track record of identifying new growth opportunities and scaling successful experiments</p></li><li><p style=\"min-height:1.5em\">Can collaborate across product, creative, and data teams to improve performance and unlock new growth levers</p></li><li><p style=\"min-height:1.5em\">Have an owner’s mentality—able to navigate ambiguity, move fast, and execute at a high level in a dynamic environment</p></li></ul><h1><strong>Our Benefits:</strong></h1><p style=\"min-height:1.5em\">At Kindred, we know that good things happen when we look out for one another. We offer our employees the following benefits:</p><ul style=\"min-height:1.5em\"><li><p style=\"min-height:1.5em\">Our opening spans more than one career level. The base salary offered depends on many factors, such as work experience, transferable skills, business needs and impact, and market demands.</p></li><li><p style=\"min-height:1.5em\">A vibrant, inclusive, and highly skilled team that ferociously protects team chemistry</p></li><li><p style=\"min-height:1.5em\">A culture of championship (vs. just mentorship), feedback, and continual development</p></li><li><p style=\"min-height:1.5em\">Competitive cash compensation and equity</p></li><li><p style=\"min-height:1.5em\">Comprehensive health benefits</p></li><li><p style=\"min-height:1.5em\">Flexible vacation policy</p></li><li><p style=\"min-height:1.5em\">Unlimited credits to stay at Kindred homes during your time as an employee</p></li><li><p style=\"min-height:1.5em\">$4,000 annual travel stipend to use toward travel costs to stay at a Kindred home</p></li><li><p style=\"min-height:1.5em\">Remote-flexible work environment. We encourage team members to travel and adventure, including working from Kindred HQ in San Francisco!</p></li><li><p style=\"min-height:1.5em\">Regular offsites to co-locate with the team</p></li></ul><p style=\"min-height:1.5em\"><em>We are committed to providing equal employment opportunities for all applicants and employees. Kindred does not discriminate on the basis of any protected characteristic, including race, color, ancestry, national origin, religion, creed, age, disability, sex, gender, sexual orientation, gender identity, gender expression, medical condition, genetic information, family care or medical leave status, marital status, domestic partner status, military and veteran status, or any other characteristic protected by US federal, state or local laws, or the laws of the country or jurisdiction where you work. Pursuant to the San Francisco Fair Chance Ordinance, we will consider for employment qualified applicants with arrest and conviction records.</em></p>","tags":"[\"aws\"]","pubDate":"2025-02-22T00:28:23.620Z","link":"https://jobs.ashbyhq.com/kindred/fa217d5a-22e1-4b24-95bc-227a1fb99e8c","slug":"head-of-performance-marketing-kindred-8381"},{"id":6378991123,"title":"VP of Sales","company":"Clutch","image":"https://app.ashbyhq.com/api/images/org-theme-logo/87f6e542-ae68-4ff1-ab48-f05e9dab1964/e24aecd5-3955-404a-8728-c08806c78730.png","description":"<p style=\"min-height:1.5em\"><strong>About the Role</strong></p><p style=\"min-height:1.5em\">The VP of Sales’ number 1 priority is to remove the CEO &amp; Co-Founder from the sales motion. To achieve this, you’ll build and scale a world-class sales motion that takes us from $35M to $100M+ in ARR, while championing our brand and driving thought leadership in the Credit Union movement.</p><p style=\"min-height:1.5em\">We’re looking for an experienced leader who can influence and garner respect at every level, from the boardroom to the frontlines. You’ll be a strategic operator who brings rigor and predictability to our revenue growth while building a high-performance culture within the team.</p><p style=\"min-height:1.5em\">To succeed in this role, you must have experience building and scaling high-performing teams that consistently exceed targets and have successfully driven a company’s growth from $35M to $100M+ ARR and beyond. It also means being accountable, dependable, autonomous, data-driven, and results-oriented with a deep understanding (or quickly developed understanding) of how our customers buy software.</p><p style=\"min-height:1.5em\">The Credit Union industry thrives on relationships. Our customers choose us because they \"like us” and therefore “trust us.” Our not-for-profit customers don’t typically engage in a high-quality ROI discussion until we have created real connections and positioned ourselves as trusted advisors. We have to build rapport via in-person interactions.</p><p style=\"min-height:1.5em\">To excel in your role, you’ll need to:</p><ul style=\"min-height:1.5em\"><li><p style=\"min-height:1.5em\">Find the right balance between leading as a front-line manager and enabling the team through an effective and repeatable sales process.</p></li><li><p style=\"min-height:1.5em\">Guiding and advising the team through deals, ensuring methodology compliance, and driving results.</p></li><li><p style=\"min-height:1.5em\">Conduct deal reviews, manager forecasts, and lead commit calls with precision.</p></li><li><p style=\"min-height:1.5em\">Represent the Sales team and the voice of prospective customers towards our executive leadership team, board, and investors.</p></li></ul><p style=\"min-height:1.5em\">Based on achievements, there is a clear path to grow into the company’s CRO, owning marketing, sales, and partnerships down the line.</p><p style=\"min-height:1.5em\"><strong>About the Team</strong></p><p style=\"min-height:1.5em\">Our Sales team includes Account Executives, Sales Managers, Sales Engineers, Rev Ops, and a growing Partnerships team. This group has consistently overachieved by focusing on four key elements:</p><ol style=\"min-height:1.5em\"><li><p style=\"min-height:1.5em\">A ferocious focus and dedication to supporting Credit Unions.</p></li><li><p style=\"min-height:1.5em\">Strong products with proven PMF.</p></li><li><p style=\"min-height:1.5em\">An incredibly collaborative sales approach across all departments.</p></li><li><p style=\"min-height:1.5em\">Strong relationships with channel partners.</p></li></ol><p style=\"min-height:1.5em\">We’re not following the standard SaaS playbook. With high ACVs and a unique go-to-market motion, we succeed by showing up as consultative, trusted advisors. Our success depends on truly understanding the Credit Union business, the industry, and the key players - including influential strategic partners.</p><p style=\"min-height:1.5em\">As the incoming VP of Sales, you’ll be the role model our GTM teammates admire and boast about. You’ll inspire, support, and elevate your team, helping them build and succeed in their careers while driving success for the company. This is your opportunity to lead an exceptional group of individuals, foster their growth, and cement the impact you have on their long-term careers.</p><p style=\"min-height:1.5em\"><strong>What You’ll Do</strong></p><p style=\"min-height:1.5em\">Within 3 months, you will:</p><ul style=\"min-height:1.5em\"><li><p style=\"min-height:1.5em\">Form strong relationships with our GTM team and win over their trust</p></li><li><p style=\"min-height:1.5em\">Form equally strong relationships with cross-functional leaders to create strong partnerships between the sellers &amp; builders of the company</p></li><li><p style=\"min-height:1.5em\">Showcase world-class leadership and sales expertise while displaying grit and determination in the trenches to support our team in closing deal</p></li></ul><p style=\"min-height:1.5em\"><strong>Within 6 months, you will:</strong></p><ul style=\"min-height:1.5em\"><li><p style=\"min-height:1.5em\">Embody the company’s core values, becoming the pride of the Sales team and a role model they admire</p></li><li><p style=\"min-height:1.5em\">Lead as a front-line manager, guiding and enabling AEs through consistent, effective sales processes tailored to our customers</p></li><li><p style=\"min-height:1.5em\">Equip and coach AEs with the tools, methodology, and step-by-step deal support they need to hit targets while ensuring compliance</p></li><li><p style=\"min-height:1.5em\">Spend meaningful time in person with customers (3+ visits/month), coaching AEs, refining the sales playbook, and building customer empathy to achieve shared goals</p></li><li><p style=\"min-height:1.5em\">Share actionable insights from customer interactions with the leadership team to drive improvements</p></li><li><p style=\"min-height:1.5em\">Close high-value, strategic opportunities while representing the company and capturing leads by attending at least 11 key industry conferences win 2025</p></li></ul><p style=\"min-height:1.5em\"><strong>Within 9 months, you will:</strong></p><ul style=\"min-height:1.5em\"><li><p style=\"min-height:1.5em\">Establish yourself as a leader who operates independently, represents the Sales team internally and externally, and makes smart, data-driven decisions that rival or exceed what the CEO &amp; Co-Founder would have made</p></li><li><p style=\"min-height:1.5em\">Present Sales performance and successes to the board and investors.</p></li><li><p style=\"min-height:1.5em\">Build a team of high-impact contributors whose growth aligns with the company’s success</p></li><li><p style=\"min-height:1.5em\">Position the organization to scale toward $100M in ARR by the end of 2026</p></li></ul><p style=\"min-height:1.5em\"><strong>What You’ll Bring</strong></p><ul style=\"min-height:1.5em\"><li><p style=\"min-height:1.5em\">Proven leadership and executive presence—you build trust, influence key stakeholders, and foster alignment at all levels, including with the board.</p></li><li><p style=\"min-height:1.5em\">Experience leading a high-growth sales org through $35M → $100M+ ARR and beyond.</p></li><li><p style=\"min-height:1.5em\">Track record of building, scaling, and developing high-performing sales teams that deliver results.</p></li><li><p style=\"min-height:1.5em\">10+ years in Enterprise SaaS sales leadership with high ACVs and complex sales cycles.</p></li><li><p style=\"min-height:1.5em\">Track record of setting up reporting systems and infrastructure that provides detailed visibility into pipeline as well as sales forecasts and that automate and regiment sales leadership with precision.</p></li><li><p style=\"min-height:1.5em\">The ability to inspire a team of A-players through action, accountability, and a clear vision.</p></li><li><p style=\"min-height:1.5em\">A healthy mix of courage, conviction, and humility—you get results without ego.</p></li><li><p style=\"min-height:1.5em\">Deep commitment to in-person relationship building—willing to spend 50%+ of your time with prospects and clients.</p></li><li><p style=\"min-height:1.5em\">Data-driven, strategic thinking—you make decisions based on insights and ensure predictability in revenue growth.</p></li><li><p style=\"min-height:1.5em\">A contagious positive mindset, open-mindedness, and a drive to push boundaries in a unique, non-standard SaaS playbook.</p></li><li><p style=\"min-height:1.5em\">Open-mindedness, out of the box problem solving, long-term thinking, genuine care for our customers’ mission and a contagious positive mindset.</p></li></ul><p style=\"min-height:1.5em\"><em>Please note that this role may evolve as our business needs change, so we appreciate your flexibility and adaptability.</em></p><p style=\"min-height:1.5em\"><strong>What’s In It For You?</strong></p><ul style=\"min-height:1.5em\"><li><p style=\"min-height:1.5em\"><strong>Remote Flexibility:</strong> Enjoy the freedom of remote work from anywhere, balancing life and career seamlessly.</p></li><li><p style=\"min-height:1.5em\"><strong>Unforgettable Off-Sites:</strong> Twice a year, bond with colleagues in exciting destinations, fostering teamwork and fresh ideas.</p></li><li><p style=\"min-height:1.5em\"><strong>Paid Time Off:</strong> Enjoy flexible PTO days yearly for relaxation and rejuvenation.</p></li><li><p style=\"min-height:1.5em\"><strong>Stock Options:</strong> Joining us means having a stake in our success, so you'll receive stock options as part of your compensation package.</p></li><li><p style=\"min-height:1.5em\"><strong>Home Office Setup:</strong> Create your ideal workspace with a dedicated budget for home office essentials.</p></li><li><p style=\"min-height:1.5em\"><strong>Work Trip Budget:</strong> Grow personally and professionally with a budget for work-related trips and co-working.</p></li><li><p style=\"min-height:1.5em\"><strong>Health Coverage:</strong> Prioritize your well-being with comprehensive health and dental insurance plans.</p></li></ul><p style=\"min-height:1.5em\"><strong>About Us</strong></p><p style=\"min-height:1.5em\"><strong>Clutch</strong> is a revolutionary vertical SaaS company, proudly backed by Andreessen Horowitz (A16z), aimed at revolutionizing the way Credit Unions engage and change the lives of their members. As a champion of financial well-being, we address the urgent need for affordable lending solutions in an era where the average American grapples with over $155,000 in household debt.  Unlike traditional financial institutions, Clutch develops software to turn Credit Unions into FinTech lenders and leverage their balance sheets to responsibly lend to over 130M Americans. Our mission extends beyond mere financial transactions; we strive to fundamentally enhance the way credit unions interact with their members. By integrating cutting-edge technologies and user-centric designs, we help credit unions provide seamless digital experiences that are on par with leading tech companies. This approach not only preserves but revitalizes the longstanding tradition of community and member-focused service inherent to credit unions.</p><p style=\"min-height:1.5em\">Clutch is an equal opportunity employer. All applicants will be considered for employment without attention to race, color, religion, sex, sexual orientation, gender identity, national origin, veteran or disability status.</p><p style=\"min-height:1.5em\"><em>Our organization participates in E-Verify. Click </em><a target=\"_blank\" rel=\"noopener noreferrer\" href=\"https://www.e-verify.gov/about-e-verify/what-is-e-verify\"><em>here</em></a><em> to learn about E-Verify.</em></p>","tags":"[]","pubDate":"2025-02-21T23:04:17.302Z","link":"https://jobs.ashbyhq.com/withclutch/a3a9a768-e639-4f32-a9f9-61648c71d6f6","slug":"vp-of-sales-clutch-8146"},{"id":5114373503,"title":"Lead Developer - 🇫🇷 French Fluent ","company":"Paradox","image":"https://media.licdn.com/dms/image/v2/D4D0BAQEmydwDkZ6NPw/company-logo_200_200/company-logo_200_200/0/1711612675702/weareparadox_en_logo?e=1743033600&v=beta&t=w-Hh_tfeKg8KOPSA6AHYXlcEcUm84UVSnDoP8KaF7L0","description":"<p style=\"min-height:1.5em\"><strong>Wait a minute. </strong></p><p style=\"min-height:1.5em\">Are you inspired by building a pioneering EdTech company that will empower millions of people? Do you dream of creating cutting-edge web applications that seamlessly combine AI, UX/UI excellence, and scalability to create transformative learning experiences at scale ? <em>Knowing that your code is used by thousands of people means something for you.</em></p><p style=\"min-height:1.5em\">Are you inspired to work hard, really hard to revolutionize education, innovate with AI,VR, wearables and impact people's lives ?</p><p style=\"min-height:1.5em\"></p><p style=\"min-height:1.5em\"><strong>Deep inside you are looking for a new adventure with… </strong></p><ul style=\"min-height:1.5em\"><li><p style=\"min-height:1.5em\"><strong>🗽 Freedom: feeling free to work remotely or hybrid and being trusted to deliver</strong></p></li><li><p style=\"min-height:1.5em\">🔥 <strong>Ambition:</strong> growing up surrounded by smart colleagues driven to create an iconic brand like Nike big </p></li><li><p style=\"min-height:1.5em\">😍 <strong>Impact:</strong> contributing to transform people lives at scale and feel your own impact in the company</p></li></ul><p style=\"min-height:1.5em\"><strong>And you deserve it because…</strong></p><ul style=\"min-height:1.5em\"><li><p style=\"min-height:1.5em\">You don’t just develop. You architect, optimize, groom and push the boundaries of technology.</p></li><li><p style=\"min-height:1.5em\">You’re obsessed with clean, efficient, and scalable code.</p></li><li><p style=\"min-height:1.5em\">You thrive on solving complex challenges and making applications faster, better, and more intuitive.</p></li><li><p style=\"min-height:1.5em\">AI fascinates you, and you see it as a tool to redefine software development and UX/UI user experience.</p></li></ul><p style=\"min-height:1.5em\">You don’t want to just code… Education and/or personal development inspires you.</p><p style=\"min-height:1.5em\"><strong>Then, this is the adventure you’ve been waiting for!</strong></p><p style=\"min-height:1.5em\">You’ll work hard, innovate fearlessly, and grow with us as we strive to make Paradox an iconic brand that changes lives worldwide.</p><p style=\"min-height:1.5em\">You'll work closely with our founding team to define our technical vision.</p><p style=\"min-height:1.5em\"><strong>This is a full-time position, carried out from our beautiful offices in Dubai, Lisbon or full-remote from anywhere in the world. </strong></p><p style=\"min-height:1.5em\"><strong>French and English fluency is required.</strong></p><p style=\"min-height:1.5em\"></p><h2>YOUR MISSION 🚀 </h2><p style=\"min-height:1.5em\">-------------------------------</p><p style=\"min-height:1.5em\"><strong>🎯 Your main goal </strong>will be to take Paradox’s online learning experience to the next level by building the new Paradox App, a state-of-the-art application that integrates AI, delivers an unparalleled user experience. You will be THE key player in creating an online learning management system that can handle several cohorts of hundreds of students at the same time and scales effortlessly to support thousands of students.</p><p style=\"min-height:1.5em\"></p><p style=\"min-height:1.5em\">Our sources of inspiration are Apple, Nike, Spotify, Disney for their obsession of excelling, having a worldwide impact and not just selling products but <strong>crafting experiences.</strong></p><p style=\"min-height:1.5em\">You will be playing a pivotal role in making Paradox play at that level and becoming an iconic brand.</p><p style=\"min-height:1.5em\"></p><p style=\"min-height:1.5em\"><u>To do so, here are your 5 responsibilities : </u></p><p style=\"min-height:1.5em\">1 | BUILD &amp; INNOVATE</p><ul style=\"min-height:1.5em\"><li><p style=\"min-height:1.5em\">Develop new features that <strong>enhance the Paradox App</strong> and redefine how users learn online.</p></li><li><p style=\"min-height:1.5em\">Implement <strong>AI-driven functionalities</strong> that personalize the learning experience.</p></li><li><p style=\"min-height:1.5em\">Continuously <strong>test, iterate, and push boundaries</strong> to improve performance and usability.</p></li><li><p style=\"min-height:1.5em\">Collaborate with cross-functional teams to<strong> integrate feedback and rapidly iterate</strong> on new ideas.</p></li></ul><p style=\"min-height:1.5em\"></p><p style=\"min-height:1.5em\">2 | SCALABILITY &amp; PERFORMANCE</p><ul style=\"min-height:1.5em\"><li><p style=\"min-height:1.5em\">Ensure the application can <strong>handle large volumes of concurrent users</strong> while maintaining speed and reliability.</p></li><li><p style=\"min-height:1.5em\">Optimize <strong>resource usage and infrastructure costs</strong> without sacrificing performance.</p></li><li><p style=\"min-height:1.5em\">Leverage <strong>CDN and caching strategies</strong> to improve load times globally.</p></li></ul><p style=\"min-height:1.5em\"></p><p style=\"min-height:1.5em\">3 | USER CENTERED DESIGN</p><ul style=\"min-height:1.5em\"><li><p style=\"min-height:1.5em\">Work closely with product and design teams to build <strong>intuitive, beautiful, and efficient</strong> user interfaces.</p></li><li><p style=\"min-height:1.5em\">Rapidly prototype features to test and refine customer experiences.</p></li><li><p style=\"min-height:1.5em\">Incorporate <strong>AI and automation</strong> to enhance user interactions.</p></li></ul><p style=\"min-height:1.5em\"></p><p style=\"min-height:1.5em\">4 | PROBLEM SOLVING &amp; TROUBLESHOOTING</p><ul style=\"min-height:1.5em\"><li><p style=\"min-height:1.5em\">Investigate and <strong>resolve technical challenges</strong> to ensure a seamless user journey.</p></li><li><p style=\"min-height:1.5em\">Analyze recurring issues and <strong>proactively implement solutions</strong> to prevent future problems.</p></li><li><p style=\"min-height:1.5em\">Work across teams to ensure a <strong>stable and efficient system.</strong></p></li></ul><p style=\"min-height:1.5em\"></p><p style=\"min-height:1.5em\">5 | COLLABORATION &amp; COMMUNICATION</p><ul style=\"min-height:1.5em\"><li><p style=\"min-height:1.5em\">Actively participate in <strong>tech architecture discussions</strong> and planning sessions.</p></li><li><p style=\"min-height:1.5em\">Provide and seek <strong>constructive feedback</strong> to continually improve the development process.</p></li><li><p style=\"min-height:1.5em\">Work within <strong>Agile frameworks</strong> to ensure timely and high-quality delivery.</p></li></ul><p style=\"min-height:1.5em\"></p><h2>DO YOU RECOGNIZE YOURSELF? 😍</h2><h3>-------------------------------</h3><h3><strong>Must Have</strong></h3><ul style=\"min-height:1.5em\"><li><p style=\"min-height:1.5em\">3-6 years of experience in Full Stack Development or Lead Development.</p></li><li><p style=\"min-height:1.5em\">Deep expertise in TypeScript &amp; React.js (minimum 3 years experience).</p></li><li><p style=\"min-height:1.5em\">Proficient in Tailwind CSS for sleek and responsive designs.</p></li><li><p style=\"min-height:1.5em\">Strong AI mindset – you actively integrate AI into your workflow.</p></li><li><p style=\"min-height:1.5em\">Passion for writing clean, maintainable, and scalable code.</p></li></ul><p style=\"min-height:1.5em\"></p><h3><strong>Personality</strong></h3><ul style=\"min-height:1.5em\"><li><p style=\"min-height:1.5em\">You’re a <strong>problem-solver</strong> who thrives on tackling challenges.</p></li><li><p style=\"min-height:1.5em\">Detail-oriented: <strong>Clean code is your signature.</strong></p></li><li><p style=\"min-height:1.5em\">Autonomous and proactive: You don’t just execute; you <strong>bring ideas to the table.</strong></p></li><li><p style=\"min-height:1.5em\">You love learning, iterating, and improving</p></li><li><p style=\"min-height:1.5em\">You continuously learn and experiment with new technologies</p></li><li><p style=\"min-height:1.5em\">You’re <strong>organized, rigorous, and adaptable</strong></p></li></ul><h3></h3><h3><strong>Nice to Have:</strong></h3><ul style=\"min-height:1.5em\"><li><p style=\"min-height:1.5em\">Experience with <strong>Nest.js</strong>.</p></li><li><p style=\"min-height:1.5em\">Experience working with <strong>Chargebee API, ZohoBooks API</strong>.</p></li><li><p style=\"min-height:1.5em\">Experience with <strong>LMS applications and mobile development.</strong></p></li></ul><p style=\"min-height:1.5em\"></p><h3><strong>Language</strong></h3><p style=\"min-height:1.5em\">French: fluent<br />English: fluent</p><p style=\"min-height:1.5em\"></p><h2>IT MIGHT NOT BE FOR YOU 🙅‍♀️</h2><h3>-------------------------------</h3><p style=\"min-height:1.5em\">Let’s be clear, we are looking for someone who is not just Great, and for whom Paradox ambition isn’t just another cool project; but a true mission.</p><p style=\"min-height:1.5em\"></p><p style=\"min-height:1.5em\">So if those <strong>personal interests :</strong> personal development / coaching / professional growth / education / edtech / teaching / edutainment<strong> are not things you REALLY love, and want to solve for other, let’s forget it</strong></p><p style=\"min-height:1.5em\"></p><p style=\"min-height:1.5em\">Let’s forget about it also if,</p><ul style=\"min-height:1.5em\"><li><p style=\"min-height:1.5em\">You <strong>don’t like to be challenged</strong> and grow in your job</p></li><li><p style=\"min-height:1.5em\">You don't like <strong>receiving or giving tough feedbacks</strong></p></li><li><p style=\"min-height:1.5em\">You <strong>don’t question the status quo: </strong>the process are there for a reason, we have always done it this way</p></li><li><p style=\"min-height:1.5em\">You <strong>like to have very specific &amp; fixed tasks</strong> assigned to you. Be told what to do and how to do it.</p></li><li><p style=\"min-height:1.5em\"><strong>Your only driver is joining a full-remote company</strong>: yes, our company culture is cool, but we want people to care about our mission, products, and their job!</p></li></ul><p style=\"min-height:1.5em\"></p><h2>🤩 JOIN US IF YOU CRAVE</h2><h3>-------------------------------</h3><h3><em><strong>Growth &amp; Ambition 🚀</strong></em></h3><p style=\"min-height:1.5em\"><em><strong><br /></strong></em>🏅 We hire only the best, it’s exhilarating to be <strong>surrounded by A-players who strive to perform</strong> <strong>whilst being in a good mood. You'll be working with some of the best minds. We understand that \"A\" people attract \"A\" people.</strong></p><p style=\"min-height:1.5em\">🏋️‍♀️ No more bosses, but ongoing conversations to support your professional development.</p><p style=\"min-height:1.5em\">⚡️ Being part of an ambitious company with a lot of growth opportunities</p><p style=\"min-height:1.5em\"><em><strong>Impact &amp; Meaning </strong></em><strong>🔥</strong></p><p style=\"min-height:1.5em\">🦄 <strong>Playing a crucial role in the development of a company</strong> whose content and products are enjoyed by millions of people<br /><strong>🤩 Waking up in the morning knowing you are making a difference:</strong> <em>we receive messages every day from clients who have successfully lost weight, quit smoking, reach a mile stone in their business, built better relationships, and made positive changes in their lives.<br /><br /><strong>But that’s not all, we believe that driven people deserve…</strong></em></p><p style=\"min-height:1.5em\"></p><p style=\"min-height:1.5em\"><em><strong>Freedom &amp; Well Being 🗽☀️</strong></em></p><p style=\"min-height:1.5em\">😎 <strong>A company culture based on autonomy &amp; accountability<br /></strong>🗽 <strong>Flexible working hours<br /></strong>🌎 <strong>A remote culture from day one with the freedom to work from wherever you want<br /></strong>🏤 <strong>Magnificent offices in Dubai and Lisbon:</strong> you’re at home worldwide<br /><strong>⌨️ Standing desks</strong> paid by the company, if you live far from our offices<br />💻 <strong>Macbook:</strong> <em>to be the most efficient in your work<br /></em>🏀 <strong>350€ per year paid by the company to take care of yourself</strong> <em>(for your gym, or dance class or whatever make you feel great)<br /></em>📚 <strong>150€ per year paid by the company to boost your knowledge</strong> (books, education): we are passionate about learning and want to support your growth)<br />🤝 <strong>1:1 coachings</strong>: a Paradox coach supporting you personally or professionally to live your best life<br />✈️ <strong>Team buildings</strong></p><p style=\"min-height:1.5em\"><em>* those benefits are only for full-time employees</em></p><p style=\"min-height:1.5em\"></p><h2>HIRING PROCESS 📃</h2><h3>-------------------------------</h3><p style=\"min-height:1.5em\"></p><p style=\"min-height:1.5em\">That job description resonated with you?</p><h3><strong>Here is your tailor made hiring process</strong></h3><p style=\"min-height:1.5em\"><strong>📃 A 6 to 8 minutes application survey (with a short video assignment) </strong></p><p style=\"min-height:1.5em\"><strong>📃 A 15/20 minutes what’s app call </strong>with <strong>Chloé</strong>, our Talent Manager, to tell you more about the challenge and see if it fits with your experience and expectations,</p><p style=\"min-height:1.5em\">💻 <strong>A video call</strong> with <strong>Chloé</strong> to do a deep dive into your career path and your ambition,</p><p style=\"min-height:1.5em\">💻 <strong>A video call</strong> with <strong>Gab, the Hiring Manager</strong> to dive deeper into your technical skills, see how we can match your desires with our needs and for you both to understand how you could fit in Paradox’s social media team.</p><p style=\"min-height:1.5em\">💻A Technical test, you will present to <strong>Luc, the Lead Developer</strong> so we can learn more about your technical choices and understand if we can write the success story together.</p><p style=\"min-height:1.5em\">💻<strong> A culture-fit video call </strong>with <strong>Timy</strong> - our culture coach - to check in depth the alignment between you and our values and culture</p><p style=\"min-height:1.5em\">💼 <strong>Reference check</strong> to get in-depth insights about how you work in different environments, make your onboarding easier, and give everybody on the team the insurance to be surrounded by A-Players.</p><p style=\"min-height:1.5em\"><strong>🫵🚀</strong> <strong>Welcome aboard!</strong></p><p style=\"min-height:1.5em\"></p><h3><strong>About our hiring process</strong></h3><p style=\"min-height:1.5em\">Our recruitment process is tailored to do our best to avoid that you or us realize that we’re not a perfect fit. Every step serves a purpose and will allow us to get to know you better as much as it’ll help you understand more where you’ll be stepping in.</p><p style=\"min-height:1.5em\">We also want you to have time to ask all of your questions regarding the mission, the long-term vision of your team and the company, our values, with the relevant interlocutor in front of you.</p><p style=\"min-height:1.5em\"></p><h2>But maybe YOU WONDER WHAT’S OUR STORY ? 😉</h2><p style=\"min-height:1.5em\">-------------------------------</p><p style=\"min-height:1.5em\">At Paradox, we are convinced that people do not want “just a job” anymore.</p><p style=\"min-height:1.5em\">We are all craving to have an impact through our professional journey. Some want to start their own venture, some want to become an intrapreneur in their current organization, some others just want their day-to-day tasks to have more meaning.</p><p style=\"min-height:1.5em\"><strong>🎯 PARADOX HAS ONE GOAL: TO EMPOWER PEOPLE AND ORGANIZATIONS TO LIVE THEIR TRUE AMBITIONS.</strong></p><p style=\"min-height:1.5em\">But where do we start?</p><p style=\"min-height:1.5em\">If you have an interest in personal development, you probably already know that:</p><ul style=\"min-height:1.5em\"><li><p style=\"min-height:1.5em\">Making things happen is a real struggle when you don’t know what truly inspires you and how to get there ;</p></li><li><p style=\"min-height:1.5em\">Available resources are either boring 😴 or full of crazy unsubstantiated theories 🤪.</p></li></ul><p style=\"min-height:1.5em\">It needs to change, and we’re here to make it happen!</p><p style=\"min-height:1.5em\"><strong>⭐️ OUR AMBITION IS TO MAKE SUCCESS THE ONLY POSSIBLE OUTCOME FOR OUR CLIENTS (WHATEVER SUCCESS MEANS FOR THEM), BY CRAFTING INNOVATIVE &amp; CAPTIVATING BREAKTHROUGH EXPERIENCES.</strong></p><p style=\"min-height:1.5em\">In other words, we want to make personal growth <strong>as entertaining as watching Netflix.</strong></p><p style=\"min-height:1.5em\">How, you might be wondering?</p><ul style=\"min-height:1.5em\"><li><p style=\"min-height:1.5em\">We travel the world and surround ourselves with <strong>top entrepreneurs</strong> <em>(Richard Branson - Founder of Virgin, Marc Simoncini - Founder of Meeting, Fred Mazzella - Founder of BlablaCar)</em>, <strong>world</strong> <strong>athletes</strong> <em>(Tony Parker - Hall of fame NBA Player, Frederick Bousquet - World record in 50m free swimming, Frank Leboeuf - WorldCup Footballer)</em>, and <strong>artists</strong> <em>(Gad Elmaleh - Comedian, Franck Dubosc, Barry Osborne - Producer of Lord of the Rings and Matrix)</em> ✊;</p></li><li><p style=\"min-height:1.5em\">We reverse engineer their <strong>strategies for achieving success</strong> and fulfillment and lean on the <strong>latest researches</strong> about neurosciences ⚙️;</p></li><li><p style=\"min-height:1.5em\">We deliver trainings &amp; educational contents around Power Skills (critical thinking, productivity, leadership, public speaking, coaching, stress management, etc.), <strong>self-growth and performance</strong>, through a balanced set of <strong>e-learning programs, events and edutainment videos</strong> 💡.</p></li></ul><p style=\"min-height:1.5em\">From one well-known<a target=\"_blank\" rel=\"noopener noreferrer nofollow\" href=\"https://www.linkedin.com/in/davidlarochefr/\"> <u>Founder</u></a> to a team of +45 people today (and counting!), this approach has paid off and enabled us to exceed 2 million followers on social networks, and to have thousands of people attending our online events and training courses.</p><p style=\"min-height:1.5em\"><strong>🔥 TOGETHER, WE ARE DRIVEN BY ONE DREAM:</strong></p><ol style=\"min-height:1.5em\"><li><p style=\"min-height:1.5em\">Helping 100 000 people achieve their dream and display their pictures on what we call the “100 000 dreams wall” ;</p></li><li><p style=\"min-height:1.5em\">Giving our clients access to constant personal growth by reinventing their learning experience ;</p></li><li><p style=\"min-height:1.5em\">Leverage AI and other technology to provide an outstanding customized experience to millions of people for them to transform their lives. </p></li></ol><p style=\"min-height:1.5em\"></p><p style=\"min-height:1.5em\"><strong>And that’s where you come in. Join the Paradox Revolution !</strong><br /></p>","tags":"[\"typescript\",\"management\"]","pubDate":"2025-02-21T21:18:18.121Z","link":"https://jobs.ashbyhq.com/paradox/187d7ba7-6844-4efd-8db9-498f7bdb4872","slug":"lead-developer-french-fluent-paradox-6473"},{"id":6019417030,"title":"Senior Full-stack Engineer (Marketing Hub)","company":"Circle","image":"https://media.licdn.com/dms/image/v2/D4E0BAQGsuyBYT8Wy1A/company-logo_200_200/company-logo_200_200/0/1709246393415/circleco_logo?e=1746662400&v=beta&t=KH2t1NJ7bcXknchnvYTCh2X0_q0BdXf-vERJqIz2p1k","description":"&lt;div class=&quot;content-intro&quot;&gt;&lt;h2&gt;About Us&lt;/h2&gt;\n&lt;p&gt;Circle is building the world’s leading all-in-one platform for online communities. We make it possible for creators, coaches, educators, and businesses to bring together their audience with engaging discussions, live streams, events, chat, courses, and payments — all in one place, all under their own brand.&lt;/p&gt;\n&lt;p&gt;We’re proud to be a fully remote company of around 180 (and growing!) team members from 30+ countries around the world. We seek exceptional individuals around the world, set them up to do the best work of their lives, and in turn, create a meaningful impact in their own lives. We don&#39;t track hours, but we do manage for high expectations very closely. We collaborate across time zones, are highly async, and like to document a lot.&lt;/p&gt;\n&lt;p&gt;Twice a year, we bring the whole company together in beautiful places around the world for our company offsites. So far, we’ve hosted offsites in Turkey, Portugal, Mexico, Thailand, Colombia, Italy, Ireland, and more, with still more to come!&lt;/p&gt;&lt;/div&gt;&lt;h2&gt;About the role&lt;/h2&gt;\n&lt;p&gt;We&#39;re looking for a Senior Full-stack engineer to join our Marketing Hub team as we aim to make Circle the top choice for creator/brand-led communities. You&#39;ll be working on features related to Email Marketing, including Email Broadcasts, Editors, Templates, Analytics, and more.&lt;/p&gt;\n&lt;p&gt;In this role, you will partake in all stages of the development lifecycle, from initial task definition to final deployment. As a senior engineer, you&#39;ll break down large epics into actionable tasks, follow through with development and testing, review PRs, push updates to production, and gradually release behind feature flags. Your responsibilities will also include bug-fixing and continuous improvement of the codebase. This role requires a high level of technical proficiency and a strong understanding of software development best practices.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;We have a preference for candidates in European and North/South American time zones.&lt;/strong&gt;&lt;/p&gt;\n&lt;h2&gt;What you&#39;ll be doing&lt;/h2&gt;\n&lt;ul&gt;\n&lt;li&gt;Work autonomously on a product built in Ruby on Rails backend and React front-end.&lt;/li&gt;\n&lt;li&gt;Build critical features and improvements for our web app, with a product-first mindset.&lt;/li&gt;\n&lt;li&gt;Work closely with Circle&#39;s leaders throughout the feature design process.&lt;/li&gt;\n&lt;li&gt;Work closely with our designers to create a world-class user experience.&lt;/li&gt;\n&lt;li&gt;Foster a bias for action, prioritizing speed of iteration without compromising on the quality of code or user experience.&lt;/li&gt;\n&lt;/ul&gt;\n&lt;h2&gt;What you&#39;ll need to be successful&lt;/h2&gt;\n&lt;ul&gt;\n&lt;li&gt;Strong alignment with our values, &lt;a href=&quot;https://circle.so/careers&quot;&gt;find our values on our career page&lt;/a&gt; if you haven’t read up on them yet.&lt;/li&gt;\n&lt;li&gt;You are proficient in English (spoken, written, and reading) at a &lt;a href=&quot;https://magoosh.com/english-speaking/english-proficiency-levels-a-guide-to-determining-your-level/&quot;&gt;CEFR Level C2&lt;/a&gt; / &lt;a href=&quot;https://www.govtilr.org/&quot;&gt;ILR Level 5&lt;/a&gt;.&lt;/li&gt;\n&lt;li&gt;&lt;strong&gt;6+ years experience&lt;/strong&gt; working as a full-stack engineer on complex web applications.&lt;/li&gt;\n&lt;li&gt;Strong proficiency in &lt;strong&gt;Ruby on Rails, MySQL/Postgresql, ReactJS, TypeScript, CSS/SCCS, TailwindCSS.&lt;/strong&gt;\n&lt;ul&gt;\n&lt;li&gt;Familiarity with both frontend and backend is necessary, but a high degree of proficiency in both is not a requirement. You should be able to individually build most small to medium features end-to-end across the stack, but you can excel in one over the other.&lt;/li&gt;\n&lt;/ul&gt;\n&lt;/li&gt;\n&lt;li&gt;A desire to work in an environment which values speed of iteration and individual autonomy, while also embracing personal accountability and the ability to collaborate effectively as part of a dynamic team.&lt;/li&gt;\n&lt;li&gt;Motivation to understand the business, our users, their requirements, and to deliver results.&lt;/li&gt;\n&lt;li&gt;Comfortable in a fast-paced environment with a certain level of ambiguity.&lt;/li&gt;\n&lt;li&gt;Great communication skills both in writing and verbal/oral (English).&lt;/li&gt;\n&lt;li&gt;Adaptable with the ability to change direction quickly if necessary.&lt;/li&gt;\n&lt;li&gt;Familiar with agile software development principles.&lt;/li&gt;\n&lt;li&gt;Should be able to lead a complex project end to end with judgment and an attention to detail when it comes to architectural, product, design, and process decisions, your judgment should inspire a high level of trust within the team.&lt;/li&gt;\n&lt;li&gt;Experience working on a fully distributed remote team.&lt;/li&gt;\n&lt;/ul&gt;\n&lt;h2&gt;Bonus points&lt;/h2&gt;\n&lt;ul&gt;\n&lt;li&gt;Experience with Elasticsearch / Sidekiq / Kafka / GraphQL.&lt;/li&gt;\n&lt;li&gt;Previous experience working with community platforms.&lt;/li&gt;\n&lt;li&gt;Experience working on email marketing tools or in the creator space.&lt;/li&gt;\n&lt;li&gt;Experience at a fast-growing start-up.&lt;/li&gt;\n&lt;li&gt;A track record of picking up new technologies and skills as you ship high-quality code.&lt;/li&gt;\n&lt;/ul&gt;\n&lt;h2&gt;$130,000 - $140,000 USD per year&lt;/h2&gt;\n&lt;p&gt;&lt;em&gt;The cash compensation range shown is a starting point. In addition to equity, benefits and perks, your cash compensation is subject to an annual review and increase on a once per year basis.&lt;/em&gt;&lt;/p&gt;\n&lt;p&gt;&amp;nbsp;&lt;/p&gt;&lt;div class=&quot;content-conclusion&quot;&gt;&lt;h2&gt;The fun stuff&lt;/h2&gt;\n&lt;ul&gt;\n&lt;li&gt;Fully remote:&amp;nbsp;work from anywhere in the world!&lt;/li&gt;\n&lt;li&gt;Autonomy and trust to do your job:&amp;nbsp;we care about outcomes over everything else.&lt;/li&gt;\n&lt;li&gt;Paid time away:&amp;nbsp;all employees are given 35 days of PTO annually. We also offer a paid sabbatical after 5 years.&lt;/li&gt;\n&lt;li&gt;Generous U.S. benchmarked compensation&amp;nbsp;and startup equity no matter where you are in the world.*&lt;/li&gt;\n&lt;li&gt;Awesome medical coverage&amp;nbsp;with 100% coverage for you and your family, or medical reimbursement options where applicable!*&lt;/li&gt;\n&lt;li&gt;Parental leave&amp;nbsp;for parents expanding their family, or just starting one.&lt;/li&gt;\n&lt;li&gt;Home office stipend&amp;nbsp;to help you get up and running.&lt;/li&gt;\n&lt;li&gt;Learning &amp;amp; development stipend&amp;nbsp;to help you level up your professional skills.&lt;/li&gt;\n&lt;li&gt;Annual bonus potential&amp;nbsp;for roles that don&#39;t already receive variable income or commission.&lt;/li&gt;\n&lt;li&gt;Company retreats:&amp;nbsp;Twice a year, the Circle team gets together for a fully paid company retreat in incredible places around the world! We’ve had past retreats in Colombia, Portugal, and Mexico, with more planned on the horizon.&lt;/li&gt;\n&lt;li&gt;Check out our&amp;nbsp;&lt;a href=&quot;https://careers.circle.so/&quot;&gt;Careers&lt;/a&gt;&amp;nbsp;page for more.&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;&lt;span style=&quot;font-size: 10pt;&quot;&gt;*&lt;em&gt;Your role, location and unique circumstance may affect this.&lt;/em&gt;&lt;/span&gt;&lt;/p&gt;\n&lt;h3&gt;Diversity, Equity &amp;amp; Inclusion&lt;/h3&gt;\n&lt;p&gt;As a fully-remote international company, diversity is baked into our DNA. Here’s how our CEO, Sid Yadav, frames our hiring mission: “let’s find talent in underserved and under-represented corners of the world, set them up to do the best work of their lives, and in turn, change their life.” To achieve this hiring mission, we offer competitive&amp;nbsp;U.S. benchmarked&amp;nbsp;compensation no matter where someone’s located in the world, and we proactively seek candidates who expand representation of backgrounds, cultures and lived experiences in our teams.&lt;/p&gt;\n&lt;h3&gt;Equal Employment Opportunity&lt;/h3&gt;\n&lt;p&gt;Circle is an equal opportunity employer and as such, we do not discriminate on the basis of race, color, religion, sex, sexual orientation, gender identity, national origin, age, disability, or any other characteristic protected by applicable laws.&amp;nbsp;If you require any accommodations during the recruitment process, please let us know and we will work with you to meet your needs.&lt;/p&gt;\n&lt;div class=&quot;&quot;&gt;\n&lt;h3 class=&quot;&quot;&gt;How We Use Candidate Data&lt;/h3&gt;\n&lt;p&gt;At Circle, we are committed to protecting your personal information. As a job applicant, the personal data you provide to us is collected and processed in accordance with the&amp;nbsp;&lt;strong&gt;General Data Protection Regulation (GDPR)&lt;/strong&gt; in the EU and the &lt;strong&gt;California Consumer Privacy Act (CCPA)&lt;/strong&gt;. This notice outlines the types of personal information we collect, the purpose for collecting it, and your rights.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Information We Collect:&lt;/strong&gt; We collect the following categories of personal information from job applicants:&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;Contact information (such as name, email address, phone number)&lt;/li&gt;\n&lt;li&gt;Employment history and qualifications&lt;/li&gt;\n&lt;li&gt;Education history&lt;/li&gt;\n&lt;li&gt;References and any other information you choose to share with us during the application process&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;&lt;strong&gt;Purpose of Collection:&lt;/strong&gt; We collect this information for the following purposes:&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;To assess your qualifications and suitability for the position&lt;/li&gt;\n&lt;li&gt;To communicate with you during the recruitment process&lt;/li&gt;\n&lt;li&gt;To comply with legal and regulatory obligations&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;&lt;strong&gt;Your Rights Under GDPR and CCPA:&lt;/strong&gt; You have the following rights regarding your personal information:&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;The right to request access to the personal information we hold about you.&lt;/li&gt;\n&lt;li&gt;The right to request the deletion of your personal information, subject to certain legal exceptions.&lt;/li&gt;\n&lt;li&gt;The right to opt out of the sale of your personal information (Note: We do not sell personal information).&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;For more information about how we handle your personal data or to exercise your rights, please refer to our full &lt;a href=&quot;https://circle.so/privacy&quot; target=&quot;_blank&quot;&gt;Privacy Policy&lt;/a&gt;.&lt;/p&gt;\n&lt;p&gt;By submitting your application, you acknowledge that you have read and understood this privacy notice.&lt;/p&gt;\n&lt;/div&gt;&lt;/div&gt;","tags":"[\"postgres\",\"typescript\",\"legal\",\"mysql\",\"aws\"]","pubDate":"2025-02-21T20:00:46.000Z","link":"https://job-boards.greenhouse.io/circleso/jobs/4553018008","slug":"senior-full-stack-engineer-marketing-hub-circle-2950"},{"id":4455797135,"title":"Software Engineer - Cody Core [IC4]","company":"Sourcegraph","image":"https://avatars.githubusercontent.com/u/3979584?s=200&v=4","description":"&lt;div class=&quot;content-intro&quot;&gt;&lt;h2&gt;&lt;span style=&quot;color: rgb(243, 78, 63);&quot;&gt;&lt;strong&gt;Who we are&lt;/strong&gt;&lt;/span&gt;&lt;/h2&gt;\n&lt;p&gt;Our mission at Sourcegraph is to make it so that &lt;a href=&quot;https://www.notion.so/sourcegraph/Mission-values-e9d37e6b972a4ef395c3076aea2bd07d?pvs=4&quot;&gt;everyone can code&lt;/a&gt;, not just ~0.1% of the population.&amp;nbsp;&lt;/p&gt;\n&lt;p&gt;We are transforming how the world’s most important companies build software by industrializing development with AI. Today, most professional developers spend a disproportionate amount of time understanding code and performing repetitive, low-level tasks—leaving less time for innovation and meaningful impact.&lt;/p&gt;\n&lt;p&gt;We’re changing that. Sourcegraph brings AI-powered search and agents to the enterprise, helping teams automate the mundane and amplify what developers do best— solving hard problems and creating great products.&lt;/p&gt;\n&lt;p&gt;Here’s how we’re making a difference:&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;&lt;strong&gt;Accelerating developers &lt;/strong&gt;with AI agents that deliver insights and precision—enabling 5x faster test creation, 30% increase in merge requests, and saving 20 minutes per developer daily.&lt;/li&gt;\n&lt;li&gt;&lt;strong&gt;Automating repetitive tasks,&lt;/strong&gt; from remediating vulnerabilities (saving teams 1,000+ hours annually) to speeding up migrations that would take years to months.&amp;nbsp;&lt;/li&gt;\n&lt;li&gt;&lt;strong&gt;Enabling innovation&lt;/strong&gt; by addressing complex problems like automated bug triage, vulnerability detection, and AI-driven code reviews seamlessly integrated into workflows.&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;Trusted by 7/10 top software companies by market cap, 4/6 top US banks and many of the companies leading global innovation, like Stripe, Indeed, Tesla, and 1Password, and with $225M in funding from investors like &lt;a href=&quot;https://techcrunch.com/2021/07/13/sourcegraph-raises-125m-series-d-on-2-6b-valuation-for-universal-code-search-tool/&quot;&gt;a16z&lt;/a&gt;, &lt;a href=&quot;https://about.sourcegraph.com/blog/series-c-with-sequoia/&quot;&gt;Sequoia&lt;/a&gt;, and &lt;a href=&quot;https://www.redpoint.com/companies/sourcegraph/&quot;&gt;Redpoint&lt;/a&gt;, we are building the tools that will define the next era of enterprise software development.&lt;/p&gt;\n&lt;p&gt;If you’re passionate about solving the hardest problems in software and shaping the future of technology, join us. Let’s build something extraordinary together.&lt;/p&gt;&lt;/div&gt;&lt;h2&gt;&lt;span style=&quot;color: rgb(243, 78, 63);&quot;&gt;&lt;strong&gt;Location&lt;/strong&gt;&lt;/span&gt;&lt;/h2&gt;\n&lt;p&gt;🌎 While we hire &lt;a href=&quot;https://sourcegraph.notion.site/How-we-engage-talent-outside-of-the-US-218f7193695a46cbb1ef39ef9c1f72d4&quot;&gt;almost anywhere&lt;/a&gt; in the world, we have a preference for someone to reside in the following locations for this role. However, if you feel qualified, we welcome you to apply regardless of location. No matter what, working hours must overlap with PST for at least 20 hours/week.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Preferred locations:&lt;/strong&gt;&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;Hybrid - San Francisco&lt;/li&gt;\n&lt;/ul&gt;\n&lt;h2&gt;&lt;span style=&quot;color: rgb(243, 78, 63);&quot;&gt;&lt;strong&gt;Why this job is exciting&lt;/strong&gt;&lt;/span&gt;&lt;/h2&gt;\n&lt;p&gt;Imagine being part of a team where your work will redefine the coding experience for developers around the world. As a Software Engineer on the Cody Core team, you will work on Cody, an AI coding assistant that lives in your editor. You will work at the forefront of integrating advanced AI technologies into everyday coding practices. This role offers a unique opportunity to innovate and push the boundaries of what an AI coding assistant can achieve, all while working with a talented and passionate team. You&#39;ll have the chance to see your contributions directly impact developers, enhancing their productivity and transforming how they interact with their code.&lt;/p&gt;\n&lt;p&gt;📅 Within one month, you will…&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;Familiarize yourself with Cody, understanding the architecture and the problems it solves for our users.&lt;/li&gt;\n&lt;li&gt;Start contributing to our current focus areas by working on tasks related to the end-to-end user experience.&lt;/li&gt;\n&lt;li&gt;Engage with your team members, learning from their experiences and sharing your insights to contribute to the project&#39;s direction.&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;📅 Within three months, you will…&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;Be contributing actively to the world’s best coding assistant.&lt;/li&gt;\n&lt;li&gt;Take ownership of smaller features and implement them, with a focus on improving user engagement and satisfaction.&lt;/li&gt;\n&lt;li&gt;Begin to influence the project&#39;s future direction by providing insights based on your work and user feedback, collaborating closely with product management and design teams.&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;📅 Within six months, you will…&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;Be fully ramped up and able to anticipate the needs of Cody users.&lt;/li&gt;\n&lt;li&gt;Establish yourself as a key contributor to the team, known for your expertise in both the technical and product aspects of our work.&lt;/li&gt;\n&lt;li&gt;Participate in initiatives that push the boundaries of what Cody can do, making coding more accessible and enjoyable for developers everywhere.&lt;/li&gt;\n&lt;/ul&gt;\n&lt;h2&gt;&lt;span style=&quot;color: rgb(243, 78, 63);&quot;&gt;&lt;strong&gt;About you&amp;nbsp;&lt;/strong&gt;&lt;/span&gt;&lt;/h2&gt;\n&lt;p&gt;You are a full-stack software engineer with at least 8 years of industry experience. You are comfortable with frontend and backend work as needed, can pick up frameworks quickly, and can deliver high-quality work.&amp;nbsp;&lt;/p&gt;\n&lt;p&gt;Beyond your technical proficiency, you are a forward-thinking and adaptive contributor, ready to navigate a complex project. Your vision extends beyond code: you are passionate about the broader impact of your work on making coding accessible and enjoyable for a diverse global community. You actively seek out opportunities to challenge the status quo, drive meaningful change, and foster an inclusive, high-performing team culture. You are an experienced remote/async worker.&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;8+ years experience as a full-stack engineer&lt;/li&gt;\n&lt;li&gt;Experience with Typescript or Go is required (both preferred)&lt;/li&gt;\n&lt;li&gt;Familiarity with code intelligence tools and AI-assisted development platforms such as Sourcegraph Cody, GitHub Copilot, or similar&lt;/li&gt;\n&lt;li&gt;Alignment with our values&lt;/li&gt;\n&lt;li&gt;Growth mindset&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;Nice to haves:&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;Experience writing extensions for one or more of the following: Visual Studio Code, JetBrains IDEs, Visual Studio, or Eclipse&lt;/li&gt;\n&lt;li&gt;Familiarity with compilers, language server protocols, code intelligence, or related technologies&lt;/li&gt;\n&lt;li&gt;Experience working closely with Product and Design teams&lt;/li&gt;\n&lt;li&gt;Previous role in a startup environment, comfortable with rapid iteration and adaptable to shifting priorities&lt;/li&gt;\n&lt;/ul&gt;\n&lt;h2&gt;&lt;span style=&quot;color: rgb(243, 78, 63);&quot;&gt;&lt;strong&gt;Level&lt;/strong&gt;&lt;/span&gt;&lt;/h2&gt;\n&lt;p&gt;📊 This job is an IC4. You can read more about &lt;a href=&quot;https://www.notion.so/sourcegraph/Leveling-Guide-0e1b5c76ada64b9caac387f8b7c4fc66&quot;&gt;our job leveling philosophy&lt;/a&gt; in our Handbook.&lt;/p&gt;\n&lt;h2&gt;&lt;span style=&quot;color: rgb(243, 78, 63);&quot;&gt;&lt;strong&gt;Compensation&lt;/strong&gt;&lt;/span&gt;&lt;/h2&gt;\n&lt;p&gt;&lt;strong&gt;💸 We pay you an above-average salary&lt;/strong&gt; because we want to hire the best people who are fully focused on helping Sourcegraph succeed, not worried about paying bills. As an &lt;a href=&quot;https://sourcegraph.notion.site/Mission-values-e9d37e6b972a4ef395c3076aea2bd07d&quot;&gt;open and transparent&lt;/a&gt; company that values &lt;a href=&quot;https://www.notion.so/sourcegraph/Compensation-Pay-Transparency-at-Sourcegraph-d58d0774f51b4b489d41c3628d30ff8d?pvs=4&quot;&gt;competitive compensation&lt;/a&gt;, our compensation ranges are visible to every single Sourcegraph teammate.&lt;/p&gt;\n&lt;p&gt;Your salary is determined by your pay band for the IC4 job level. For determining pay bands, we use a number of market and data-driven salary sources, along with your location zone, and target the high-end of the range to ensure we’re always paying above market regardless of where you live in the world. Both U.S. and international locations are divided into one of four zones, determined by the cost of labor index for each area. The salary for a successful candidate will be based on level, job-related skills, experience, qualifications, and location zone. Please note that the salaries below may be adjusted in the future.&lt;/p&gt;\n&lt;p&gt;💰 The target compensation for this role is based on the IC4 pay band for your zone.&amp;nbsp;&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;Zone 1: $200,000 USD&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;Please speak with a recruiter for additional information regarding zone locations.&lt;/p&gt;\n&lt;p&gt;📈 In addition to our cash compensation, we offer equity (because when we succeed as a company, we want you to succeed, too) and generous &lt;a href=&quot;https://sourcegraph.notion.site/Benefits-Perks-dd1da4b6b3a64780abed010a144d34ba&quot;&gt;perks &amp;amp; benefits&lt;/a&gt;.&lt;/p&gt;\n&lt;h2&gt;&lt;span style=&quot;color: rgb(243, 78, 63);&quot;&gt;&lt;strong&gt;Interview process&amp;nbsp;&lt;/strong&gt;&lt;/span&gt;&lt;/h2&gt;\n&lt;p&gt;&lt;em&gt;Below is the interview process you can expect for this role (you can read more about &lt;/em&gt;&lt;a href=&quot;https://sourcegraph.notion.site/Types-of-interviews-f279f080583d49ee9f2c60e30c8cb1f7&quot;&gt;&lt;em&gt;the types of interviews&lt;/em&gt;&lt;/a&gt;&lt;em&gt; in our Handbook). It may look like a lot of steps, but rest assured that we move quickly and the steps are designed to help you get the information needed to determine if we’re the right fit for you… Interviewing is a two-way street, after all!&amp;nbsp;&lt;/em&gt;&lt;/p&gt;\n&lt;p&gt;We expect the interview process to take 5.5 hours in total.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;👋 Introduction Stage&lt;/strong&gt; - we have initial conversations to get to know you better…&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;[30m]&lt;a href=&quot;https://www.notion.so/sourcegraph/Types-of-interviews-sample-questions-f279f080583d49ee9f2c60e30c8cb1f7?pvs=4#99be5ff628b2414194a0ba79d9f25f13&quot;&gt; Recruiter Screen&lt;/a&gt;&lt;/li&gt;\n&lt;li&gt;[15m]&lt;a href=&quot;https://sourcegraph.notion.site/Resources-for-Candidates-Engineering-Interview-Process-c37a70dea5794085bee0c0818c9ef0b3#6a6deb280d374652b21d5aa3061c82d2&quot;&gt; Hiring Manager Intro&lt;/a&gt;&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;&lt;strong&gt;🧑‍💻 Team Interview Stage&lt;/strong&gt; - we then schedule an all-day onsite interview to delve into your experience in more depth and introduce you to members of the team, including cross-functional partners…&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;[45m]&lt;a href=&quot;https://sourcegraph.notion.site/Resources-for-Candidates-Engineering-Interview-Process-c37a70dea5794085bee0c0818c9ef0b3#da568e7854bb4aaa9b027157088e2d71&quot;&gt; Technical Screen / Resume Deep Dive&lt;/a&gt;&lt;/li&gt;\n&lt;li&gt;[45m]&lt;a href=&quot;https://sourcegraph.notion.site/Resources-for-Candidates-Engineering-Interview-Process-c37a70dea5794085bee0c0818c9ef0b3#e83edd987754460e839138a4bbfd592e&quot;&gt; Pairing Exercise&lt;/a&gt;&amp;nbsp;&lt;/li&gt;\n&lt;li&gt;[60m] Coding&lt;/li&gt;\n&lt;li&gt;[45m] Systems Design&amp;nbsp;&lt;/li&gt;\n&lt;li&gt;[60m]&lt;a href=&quot;https://sourcegraph.notion.site/Types-of-interviews-sample-questions-f279f080583d49ee9f2c60e30c8cb1f7#cb00697e95304550a146c32563c0255d&quot;&gt; Cross-functional Team Collaboration Interview&lt;/a&gt; /&lt;a href=&quot;https://www.notion.so/sourcegraph/Types-of-interviews-sample-questions-f279f080583d49ee9f2c60e30c8cb1f7?pvs=4#e3a04291743048df87541a88aa8199dd&quot;&gt; Values Interview&lt;/a&gt;&amp;nbsp;&lt;/li&gt;\n&lt;li&gt;[15-30m]&lt;a href=&quot;https://www.notion.so/sourcegraph/How-to-work-with-Quinn-Slack-CEO-807673e0864d473f959cc4efd9642a5a?pvs=4#6f185c0e2011411eac5be9c675f9056c&quot;&gt; Leadership&lt;/a&gt; with co-founder&amp;nbsp;&lt;/li&gt;\n&lt;li&gt;We check references and conduct your background check&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;Please note - you are welcome to request additional conversations with anyone you would like to meet, but didn’t get to meet during the interview process.&lt;/p&gt;&lt;div class=&quot;content-conclusion&quot;&gt;&lt;h2&gt;&lt;span style=&quot;color: rgb(243, 78, 63);&quot;&gt;&lt;strong&gt;Learn more about us&lt;/strong&gt;&lt;/span&gt;&lt;/h2&gt;\n&lt;p&gt;You can learn more about what it is like to work at Sourcegraph by reading &lt;a href=&quot;https://sourcegraph.notion.site/d7614e3e9dc04c09ac2d42d57f1816e6?v=2a6d426dbae14390b155120b0c029ce0&quot;&gt;our handbook&lt;/a&gt;.&lt;/p&gt;\n&lt;p&gt;We are an ambitious team who are collectively working hard to build the most influential company in the world.&amp;nbsp; You can read more about our &lt;a href=&quot;https://sourcegraph.notion.site/What-it-s-like-working-at-Sourcegraph-119a8e11265880b18911eee4d9b7c460#119a8e1126588062b935fc66104b6115&quot;&gt;culture&lt;/a&gt;, &lt;a href=&quot;https://sourcegraph.notion.site/Compensation-Pay-Transparency-at-Sourcegraph-d58d0774f51b4b489d41c3628d30ff8d?pvs=74&quot;&gt;competitive compensation&lt;/a&gt; and &lt;a href=&quot;https://sourcegraph.notion.site/Benefits-Perks-dd1da4b6b3a64780abed010a144d34ba?pvs=74&quot;&gt;benefits&lt;/a&gt; here.&lt;/p&gt;\n&lt;p&gt;Sourcegraph is an equal opportunity workplace; we welcome people from all backgrounds.&amp;nbsp;&lt;/p&gt;\n&lt;p&gt;&lt;em&gt;Sourcegraph participates in &lt;/em&gt;&lt;a href=&quot;https://sourcegraph.notion.site/E-Verify-2ab3286dde3446d6bac2898c83610107&quot;&gt;&lt;em&gt;E-Verify&lt;/em&gt;&lt;/a&gt;&lt;em&gt; for U.S. Employees. &lt;/em&gt;&lt;/p&gt;&lt;/div&gt;","tags":"[\"typescript\",\"management\",\"engineering\"]","pubDate":"2025-02-21T18:40:38.000Z","link":"https://job-boards.greenhouse.io/sourcegraph91/jobs/5448414004","slug":"software-engineer-cody-core-ic4-sourcegraph-9289"},{"id":8223818865,"title":"Cloud & Platform Engineer","company":"Floy","image":"https://remotive.com/job/1973915/logo","description":"<div class=\"h3\">Your mission</div><p>\n\n                                We are seeking a highly skilled and experienced (Senior) Cloud &amp; Platform Engineer to join our team. <br>Your mission is to bring our core infrastructure to the next level by creating scalable, secure, and efficient cloud platforms. You will collaborate with cross-functional teams to ensure seamless operations and directly contribute to the reliability and scalability of our services, which are critical in improving patients' lives.\n\n                            </p><div class=\"h3\">Your responsibilities</div><p>\n</p><ul style=\"\"><li style=\"\">Design, implement, and manage scalable cloud platforms with high availability, performance, and security.</li><li style=\"\">Engineer and maintain Infrastructure as Code (IaC) solutions using tools like Terraform.</li><li style=\"\">Collaborate with cross-functional teams to streamline continuous integration and continuous delivery (CI/CD) workflows.</li><li style=\"\">Build, scale, secure, and monitor infrastructure to support development and production environments.</li><li style=\"\">Support cloud migrations and manage event-driven systems, including asynchronous workloads and message queues.</li><li style=\"\">Document processes, configurations, and infrastructure decisions to ensure high-quality knowledge sharing.</li><li style=\"\">Enhance developer experience by implementing tools and frameworks that improve productivity.</li><li style=\"\">Address security vulnerabilities through rigorous testing and proactive risk mitigation.</li><li style=\"\">Maintain and support self-hosted services critical to product infrastructure.</li></ul>\n<div class=\"h3\">What are we looking for?</div><p>\n</p><ul style=\"\"><li style=\"\">At least 3 years of experience building scalable cloud platforms.</li><li style=\"\">Familiarity with either AWS or GCP (decision pending).</li><li style=\"\">Strong proficiency in Python, including experience with Python-based API implementations.</li><li style=\"\">Proven expertise in Infrastructure as Code (IaC) using Terraform.</li><li style=\"\">Hands-on experience with Docker and CI/CD pipelines.</li><li style=\"\">Familiarity with event-driven systems, including queues and asynchronous workloads.</li><li style=\"\">Solid understanding of relational databases and their management in cloud environments.</li><li style=\"\">Experience with object storage solutions (e.g., S3, GCS) for scalable data management.</li><li style=\"\">Strong documentation skills and a highly structured approach to work.</li><li style=\"\">Experience in creating and maintaining secure and efficient cloud environments.</li><li style=\"\">Ability to monitor and optimize infrastructure for reliability and performance.</li><li style=\"\">A strong commitment to teamwork and collaboration.</li><li style=\"\">Familiarity with modern networking and security tools is beneficial.</li><li style=\"\">Experience with cloud migrations is a strong advantage.</li></ul><br>Good-to-have: <br><ul style=\"\"><li style=\"\">Certifications in cloud technologies (AWS, GCP, etc.).</li><li style=\"\">Experience working with DICOM and/or in the Radiology field is a big plus</li><li style=\"\">Experience working in a fast paced startup environment.</li><li style=\"\">Basic knowledge in data engineering is a plus (DBT, Airflow)</li></ul><br>We are looking for brilliant, hard-working people who strive to become recognised thought leaders in their domain. If you enjoy learning new things and thrive in a fast-paced environment, we would love to meet you. Together, we will continuously tailor the role to your strengths and development goals.<br><br>\n<div class=\"h3\">Why us</div><p>\n\n                                Pioneer medical AI to maximize human health. Become part of an ambitious team valuing individuals, dedication and a joyful work experience. Solve novel challenges with life-saving implications.<br></p><ul style=\"\"><li style=\"\">We accelerate your learning with rapid feedback, weekly 1:1 sessions and inspiring problems.</li><li style=\"\">We give you autonomy, flexibility and the opportunity to connect with our generation’s brightest minds.</li><li style=\"\">We provide flexible remote team culture, company retreats and fair compensation.</li></ul>\n<img src=\"https://remotive.com/job/track/1973915/blank.gif?source=public_api\" alt=\"\"/>","tags":"[\"docker\",\"python\",\"CI/CD\"]","pubDate":"2025-02-21T01:51:20.000Z","link":"https://remotive.com/remote-jobs/devops/cloud-platform-engineer-1973915","slug":"cloud-platform-engineer-floy-791"},{"id":7873239187,"title":"Senior Data Engineer","company":"Float","image":"https://avatars.githubusercontent.com/u/5396037?s=200&v=4","description":"<h3><strong>Who We Are</strong></h3><p>Float is the leading resource management software for professional services teams. Since 2012, we’ve grown every year—independently, self-funded, and profitably. We’re rated #1 for resource management on G2 and trusted by 4,500+ customers worldwide.</p><p>As a certified B Corporation, we’re committed to making a positive impact on our team, customers, the environment, and the remote community. Our 50+ person team works 100% remotely across the globe, with <a href=\"https://www.notion.so/Perks-and-benefits-1841a06d46528081a119c93f270ec71c?pvs=21\" rel=\"nofollow noreferrer noopener\" class=\"external\">perks and benefits</a> designed to support us in living our Best Work Life. You'll collaborate with teammates across Australia, Mexico, the UK, Nigeria, Canada, and the US. Learn more about our data security practices for employment or service contracts <a href=\"https://www.notion.so/Data-security-and-protection-guidelines-5a44ff7c04bb4a55a05873f6d5d7743b?pvs=21\" rel=\"nofollow noreferrer noopener\" class=\"external\">here</a>. Browse <a href=\"https://www.float.com/blog/\" rel=\"nofollow noreferrer noopener\" class=\"external\">our blog</a> to get a glimpse of life at Float and check out our <a href=\"https://www.glassdoor.com/Overview/Working-at-Float-EI_IE2055330.11,16.htm\" rel=\"nofollow noreferrer noopener\" class=\"external\">Glassdoor employer reviews</a>. See why our customers love Float <a href=\"https://www.g2.com/products/float-float/reviews\" rel=\"nofollow noreferrer noopener\" class=\"external\">on G2</a> .</p><p>We’re on a scale-up journey, and we’re seeking people who thrive in this stage. We want Float to be the place where you have the autonomy and opportunity to do the best work of your career.</p><h3><strong>Why We’re Hiring For This Role</strong></h3><p>We’re taking an exciting step toward integrating AI-driven pattern detection into Float, starting with our Resource Recommendation Engine. This initiative will help professional service teams make smarter resourcing decisions by learning from past successes—like identifying which teams consistently deliver successful projects—and optimizing for better outcomes. To bring this vision to life, we need a skilled Data Engineer with AI/ML expertise to help build the foundation of this effort. You’ll be a key part of our new Intelligence Squad, working alongside a technical product manager and other team members to drive innovation. This is a rare opportunity to shape a critical new capability at Float, lead technical discussions, and have a direct impact on our product and business strategy. We’re ready to elevate our AI strategy, and we need the right technical leader to make it happen. If you're excited by the challenge of building AI-powered solutions from the ground up, we’d love to hear from you!</p><p>Our Senior Staff Engineer, Roberto, explains the important role you will play within our Engineering team. <a href=\"https://www.loom.com/share/351f7210fb28436d9458d3b78b740f5f?sid=b5370f92-3ca6-4911-ba28-0b4d9f3b50f0\" target=\"_blank\" rel=\"nofollow noreferrer noopener\" class=\"external\"><strong>Watch this video!</strong></a></p><p><img src=\"https://cdn.loom.com/sessions/thumbnails/351f7210fb28436d9458d3b78b740f5f-355c07a742b2a515-full-play.gif\" width=\"640px\" height=\"auto\" style=\"width:640px;height:auto;\"></p><p>You’ll be working asynchronously with a bright, dedicated team from across the globe, with a strong focus on taking complex problems and creating solutions that feel simple and intuitive for our customers.</p><h3><strong>What You’ll Be Responsible For</strong></h3><p>Early on, you’ll jump right into:</p><ul> <li> <strong>Lead technical viability discussions:</strong> For the Intelligence squad’s initial deliveries, you’ll be responsible for leading discussions to learn more about the technical viability of the deliveries.</li> <li> <strong>Resource Recommendation Engine:</strong> Develop and test proof-of-concepts for this project.</li> <li> <strong>Analyse existing data:</strong> You will conduct a comprehensive analysis of existing data to uncover patterns, identify optimization opportunities, and support the squad’s next deliveries.</li> <li> <strong>Evaluate our data streaming pipeline: Y</strong>ou will be responsible for implementing and maintaining any changes to it our data streaming pipeline.</li> </ul><p>Once you are a bit more settled, we expect that you will jump into the following projects:</p><ul> <li> <strong>Lead technical discussions</strong> related to optimization, pattern detection, and AI, serving as the primary point of contact for these areas within Float.</li> <li> <strong>Develop and implement</strong> advanced algorithms to enhance the Resource Recommendation Engine and other product features, initially focused on pattern detection and optimization.</li> <li> <strong>Design, implement, and maintain</strong> our streaming data architecture to support real-time data processing and analytics, ensuring data integrity and reliability.</li> <li> <strong>Establish best practices</strong> and standards for optimization, AI, and data engineering development within the organization.</li> <li> <strong>Mentor and train</strong> team members on optimization, AI, and data engineering concepts and techniques, fostering a culture of continuous learning and innovation.</li> <li> <strong>Stay updated</strong> with the latest trends and related technologies, and proactively identify opportunities to incorporate them into Float's solutions.</li> </ul><h3><strong>What You’ll Need To Be Successful</strong></h3><p>We want you to love your work and believe that these skills will allow you to succeed in the role. Applying these skills requires:</p><ul> <li> <strong>Machine Learning &amp; Algorithms</strong>: Expertise in ML, expert systems, and advanced algorithms (e.g., pattern matching, optimization) with applied experience in Scheduling, Recommendations, or Personalization.</li> <li> <strong>Programming</strong>: Proficient in Python or Java and comfortable with SQL and Javascript/Typescript.</li> <li> <strong>Data Engineering</strong>: Experience with large-scale data pipelines and stream processing (e.g., Kafka, Debezium, Flink).</li> <li> <strong>Data Governance</strong>: Skilled in data integration, cleaning, and validation.</li> <li> <strong>Databases</strong>: Familiar with vector and graph databases (e.g., Neo4j).</li> <li> <strong>Independent Decision-Making</strong>: Knows when to act independently and when to seek input.</li> <li> <strong>Written Communication</strong>: Clear documentation and collaboration in a global team.</li> <li> <strong>Problem-Solving Skills</strong>: Balances immediate needs with long-term extensibility.</li> <li> <strong>Team Engagement</strong>: Actively collaborates to improve processes and achieve shared goals.</li> <li> <strong>Continuous Growth</strong>: Self-motivated, adaptable, and eager to take on challenges.</li> </ul><p>As a fully remote team, we’re looking for someone comfortable with asynchronous communication as the default, which means you have previous remote experience and are comfortable using tools like Slack, Loom, and Linear to communicate as needed. Don’t worry—you will have significant deep work time since we have <a href=\"https://www.float.com/blog/how-to-create-a-culture-with-fewer-meetings/\" rel=\"nofollow noreferrer noopener\" class=\"external\">very few meetings</a>.</p><h3><strong>Why Join Us</strong></h3><p>Pay for this role is US $167,471 (Level 3). Here’s a <a href=\"https://www.float.com/blog/why-were-changing-the-way-we-compensate-at-float/\" rel=\"nofollow noreferrer noopener\" class=\"external\">blog post</a> with more information on how we determine our salaries.</p><p>We’re a global <a href=\"https://www.float.com/blog/giving-our-team-agency-over-their-time/\" rel=\"nofollow noreferrer noopener\" class=\"external\">async remote company</a> with a diverse team of people from all over the world who share a common belief in living our <a href=\"https://www.float.com/blog/\" rel=\"nofollow noreferrer noopener\" class=\"external\">best work life</a>. We believe deeply in the idea of transparency and share our <a href=\"https://www.notion.so/Float-Handbook-9bf7a6a869744d41b2adfaa1c9131746?pvs=21\" rel=\"nofollow noreferrer noopener\" class=\"external\">Float Handbook</a> publicly so potential new team members can see first hand our <a href=\"https://www.notion.so/Pay-Perks-Benefits-and-Time-Away-From-Work-67c2928515af45729501aaf7d5195d8c?pvs=21\" rel=\"nofollow noreferrer noopener\" class=\"external\">perks &amp; benefits</a> as well as our <a href=\"https://www.notion.so/How-we-work-4727bfc669f647e790f2809efa92f8fe?pvs=21\" rel=\"nofollow noreferrer noopener\" class=\"external\">ways of working</a>. If you feel like you can thrive at Float to do your best work, we would love to hear from you.</p><h3><strong>Hiring Process For This Role</strong></h3><p>You’ll find a lot of useful information about our interview process and what it’s like to join our global team on the <a href=\"https://www.float.com/careers\" rel=\"nofollow noreferrer noopener\" class=\"external\">Float careers page</a>. The hiring process for this role looks like this:</p><p><strong>Initial First Meet (20 min):</strong> You'll meet with Julia, Talent Manager (<a href=\"https://www.linkedin.com/in/juliafulton1/\" rel=\"nofollow noreferrer noopener\" class=\"external\">hi, that’s me</a>!), to discuss your interest in the role and review your questions about working at Float.</p><p><strong>Take-Home Assignment (4 hours, paid)</strong>: You’ll complete a take-home technical assignment that will assess your ability to identify and communicate performance issues on a real application and suggest solutions. You will be paid an honorarium after completion of your take-home assignment, and will receive feedback on your assignment regardless of the outcome. </p><p><strong>Manager Interview (60 min)</strong>: Upon a successful take-home assignment, you’ll meet with Roberto (Senior Staff Engineer) and Sameet (Senior Application Engineer) to discuss your technical skills and how you have built data solutions in the past. </p><p><strong>Co-Worker Interview (30 min):</strong> You’ll meet with Christian (Services Team Lead) and Omar (Senior Application Engineer), to dive deeper into your skills and experience, and learn more about your ability to collaborate, communicate, and work cross-functionally. </p><p><strong>Founder Interview (30 min)</strong>: You’ll meet with Lars, Float’s CTO and Co-Founder, to get to know you and see if you have potential to be a great addition to the team.</p><p><em>Note: Industry research shows that women and those in traditionally underrepresented groups generally don’t apply to jobs unless they check all the boxes for the role. If you feel strongly that you have what it takes for this role but don’t check 100% of the boxes—that’s okay—we encourage you to apply anyway and highlight what you can bring to the table.</em></p>","tags":"[\"javascript\",\"typescript\",\"management\",\"engineering\",\"database\"]","pubDate":"2025-02-21T00:00:00.000Z","link":"https://apply.workable.com/j/C460FB7F0A","slug":"senior-data-engineer-float-2539"},{"id":6746771820,"title":"Editorial Research Assistant","company":"GrowthX Labs","image":"https://remotive.com/job/1974552/logo","description":"<p><strong>👉 IMPORTANT: Upload your resume as a PDF. Resumes in other formats (e.g., DOC or DOCX) will be automatically disqualified by our AI systems.</strong></p>\n<p>We're seeking an Editorial Research Assistant who's passionate about combining expert storytelling with AI-driven workflows. At GrowthX AI, you'll collaborate with a diverse team of strategists, editors, and AI specialists, crafting high-quality, engaging copy across various domains.</p>\n<p>(This is a fully remote role. We ask for a minimum of 4 hours of overlap with U.S. Pacific Time to collaborate with team members.)</p>\n<div class=\"h3\">Quick Intro</div>\n<p>At GrowthX, we design growth systems that integrate AI automation and expert guidance to help marketing teams with content creation, distribution, and conversion. Since our founding in 2024, we’ve hit seven-figure annual revenue in just five months, grown by double digits month-over-month, and teamed up with incredible partners like Reddit, Ramp, and HeyGen to drive their growth.</p>\n<div class=\"h3\">The Role: Editorial Research Assistant</div>\n<p>We're seeking an Editorial Research Assistant to support content creation and ensure accuracy, working closely with our Managing Editors and Content Writers. You will aid in the process of research, fact-checking, and refining content to maintain high standards of quality and credibility.</p>\n<div class=\"h3\">Who You'll Work With</div>\n<p>As the Editorial Research Assistant, you'll have access to a range of AI tools for enhanced research capabilities. You'll collaborate with:</p>\n<ul style=\"\">\n<li style=\"\">Managing Editors: Refining topics and adhering to brand style guidelines.</li>\n<li style=\"\">Content Writers: Assisting in research and providing validated source materials.</li>\n<li style=\"\">SEO Strategists: Ensuring content incorporates target keywords and SEO best practices.</li>\n</ul>\n<div class=\"h3\">Day-to-Day expectations</div>\n<p>Here's how you can expect to spend your time each week:</p>\n<p>60% – Research &amp; Fact-checking: Dive into academic, market, or expert sources to validate content and ensure credibility.<br>20% – Collaboration &amp; Support: Work with Content Writers and Editors to align on content strategies and objectives.<br>10% – Quality Review: Self-edit and review content for clarity, grammar, and project requirements.<br>10% – Learning &amp; Development: Stay updated on industry trends and AI-based tools to enhance research methodology.</p>\n<div class=\"h3\">Requirements</div>\n<div class=\"h3\">Key Responsibilities &amp; Skills Needed</div>\n<ul style=\"\">\n<li style=\"\">Strong Research Proficiency: Able to interpret complex information and distill it into reader-friendly language using credible sources.</li>\n<li style=\"\">Editorial Support: Assist in refining content, fact-checking, and maintaining high-quality standards.</li>\n<li style=\"\">SEO Awareness: Basic knowledge of SEO techniques including keyword placement and meta descriptions.</li>\n</ul>\n<div class=\"h3\">Nice to Haves</div>\n<ul style=\"\">\n<li style=\"\">Familiarity with AI Tools: Experience with GPT-based tools and automated content generation.</li>\n<li style=\"\">Industry Certifications: Relevant degrees or certifications in specialized fields such as healthcare, finance, marketing.</li>\n<li style=\"\">Multilingual Skills: Proficiency in additional languages, beneficial for global reach.</li>\n</ul>\n<div class=\"h3\">Benefits</div>\n<ul style=\"\">\n<li style=\"\">Salary: Competitive compensation</li>\n<li style=\"\">Fully Remote: Work from anywhere, coordinating with PST hours.</li>\n<li style=\"\">Unlimited PTO: Encouraged to take at least 15 days of vacation annually for well-being.</li>\n<li style=\"\">Professional Growth: Access to AI training, editorial workshops, and cross-functional skill-building.</li>\n<li style=\"\">Dynamic Culture: Collaborate with a diverse team valuing learning and experimentation.</li>\n</ul>\n<p><br><br></p>\n<div class=\"h2\">About the company</div>\n<p><br>We build end-to-end growth engines with expert-guided AI workflows. From content to distribution to conversion. <br><br>We're not another software company.<br>We're not trying to be an agency.<br>We're building something entirely different:<br><br></p>\n<ul style=\"\">\n<li style=\"\">AI-powered workflows that adapt to our clients</li>\n<li style=\"\">Expert guidance every step of the way</li>\n<li style=\"\">Zero burden on our clients team</li>\n<li style=\"\">Results that compound over time</li>\n</ul>\n<p><br><strong>Why?<br></strong><br>Because traditional options aren't cutting it:<br><br></p>\n<ul style=\"\">\n<li style=\"\">Agencies are expensive and often disconnected from your brand's reality.</li>\n<li style=\"\">Freelancers can be hit or miss, hard to manage, and challenging to retain.</li>\n<li style=\"\">In-house teams are costly to build and often bogged down by internal processes.</li>\n<li style=\"\">AI alone lacks the nuance and contextual understanding that human expertise brings.</li>\n<li style=\"\">Software tools require your team to do all the heavy lifting.</li>\n</ul>\n<p><br>We believe in combining the best of both worlds—AI and experts—to drive real growth.<br><br>Already, 25 incredible companies – from seed startups to public giants – are growing with us.<br><br>And we're just getting started... 🚀</p>\n<img src=\"https://remotive.com/job/track/1974552/blank.gif?source=public_api\" alt=\"\"/>","tags":"[\"seo\",\"AI/ML\",\"automation\",\"research\",\"healthcare\"]","pubDate":"2025-02-20T19:51:31.000Z","link":"https://remotive.com/remote-jobs/writing/editorial-research-assistant-1974552","slug":"editorial-research-assistant-growthx-labs-3486"}]