[{"id":5815824522,"title":"IT RMO Manager","company":"Bluemantis","image":"https://remotive.com/job/1920573/logo","description":"<div><!--block-->We seek a highly skilled and experienced Resource Management Office, Manager to join our team at Blue Mantis As a Resource Management Office, Manager, you will oversee resource allocation and optimize resource utilization across projects and departments. Your expertise in resource planning and management will be instrumental in ensuring the efficient delivery of projects and achieving organizational goals. The ideal candidate possesses a strategic mindset, strong organizational skills and excellent communication abilities. </div><br><br><div class=\"h3\">Key Responsibilities</div><div><!--block-->If you have a strong track record in resource management and are passionate about maximizing efficiency and productivity, we invite you to apply. We offer a competitive compensation package, comprehensive medical benefits and a supportive work environment that promotes professional growth. </div><ul style=\"\"><li style=\"\"><!--block-->Analyzing project demands, resource availability and constraints to develop effective resource allocation plans.</li><li style=\"\"><!--block-->Collaborating with project managers, department heads and stakeholders to understand resource requirements and project timelines.</li><li style=\"\"><!--block-->Developing and implementing resource planning strategies to align resource allocation with project demands and organizational goals.</li><li style=\"\"><!--block-->Optimizing resource utilization by identifying and resolving conflicts, bottlenecks or imbalances in resource allocation.</li><li style=\"\"><!--block-->Maintaining accurate resource records and documentation, including resource schedules, utilization reports and allocation decisions.</li><li style=\"\"><!--block-->Monitoring resource utilization trends and making proactive adjustments to ensure optimal resource allocation.</li><li style=\"\"><!--block-->Conducting regular assessments of resource performance, productivity and capacity to identify areas for improvement.</li><li style=\"\"><!--block-->Providing guidance and support to project teams in resource-related matters, including staffing, skill requirements and resource acquisition.</li><li style=\"\"><!--block-->Develop and implement resource management strategies and processes to optimize the firm’s resource allocation, utilization and availability.</li><li style=\"\"><!--block-->Collaborate with project managers and department heads to identify resource requirements for ongoing and upcoming projects.</li><li style=\"\"><!--block-->Evaluate project timelines, budgets and resource constraints to ensure the efficient allocation of resources.</li><li style=\"\"><!--block-->Maintain a comprehensive overview of available resources, including personnel, equipment and materials, ensuring their availability and suitability for projects.</li><li style=\"\"><!--block-->Monitor resource utilization, identifying and addressing potential bottlenecks or conflicts and implementing necessary adjustments.</li><li style=\"\"><!--block-->Coordinate with human resources, procurement and other relevant departments to ensure timely availability of resources as per project requirements.</li><li style=\"\"><!--block-->Conduct resource capacity planning to assess and manage resource demands based on project priorities and objectives.</li><li style=\"\"><!--block-->Track and report on resource utilization, analyzing data and providing suggestions for resource optimization.</li><li style=\"\"><!--block-->Collaborate with stakeholders to resolve resource-related conflicts, negotiate resource sharing and balance competing priorities.</li><li style=\"\"><!--block-->Implement and maintain resource management tools, systems and processes to enhance visibility, transparency and efficiency.</li><li style=\"\"><!--block-->Stay updated on industry trends, best practices and emerging technologies in resource management, applying relevant knowledge to improve organizational processes.  </li><li style=\"\"><!--block-->Provide overall operations support </li></ul><div><!--block--><br><br><br><br></div><br><br><div class=\"h3\">Skills, Knowledge &amp; Expertise</div><ul style=\"\"><li style=\"\"><!--block-->Experience managing an IT RMO or Managing an RMO for a Managed Service Provider. </li><li style=\"\"><!--block-->Experience with Managing IT RMO Staff Augmentation Projects.</li><li style=\"\"><!--block-->Bachelor’s degree in business, project management or a related field.</li><li style=\"\"><!--block-->5+ years of experience in resource management or a related role, preferably in a project-based environment.</li><li style=\"\"><!--block-->Strong understanding of resource planning, allocation and optimization principles and methodologies, preferably in the Indian context.</li><li style=\"\"><!--block-->Proficiency in using resource management software and tools to track, analyze and report on resource utilization.</li><li style=\"\"><!--block-->Excellent analytical and problem-solving skills to assess resource demands and optimize resource allocation.</li><li style=\"\"><!--block-->Effective communication and interpersonal skills to collaborate with stakeholders at all levels of the organization.</li><li style=\"\"><!--block-->Strong organizational and time management skills, with the ability to priorities tasks and manage multiple projects simultaneously.</li><li style=\"\"><!--block-->A detail-oriented mindset to maintain accurate resource records and documentation.</li><li style=\"\"><!--block-->Ability to work well under pressure and adapt to changing priorities and deadlines.</li><li style=\"\"><!--block-->A strategic perspective, with the ability to think proactively and implement resource management strategies that align with organizational goals.</li><li style=\"\"><!--block-->Professional certification in resource management or project management.</li><li style=\"\"><!--block-->Experience supporting Professional Services Organization for IT RMO Staff Aug projects. </li><li style=\"\"><!--block-->Familiarity with resource management in specific industries, such as IT, construction, or manufacturing.</li><li style=\"\"><!--block-->Experience utilizing resource management software or enterprise resource planning (ERP) systems.</li><li style=\"\"><!--block-->Experience with Salesforce and ServiceNow SPM and Resource Management</li><li style=\"\"><!--block-->Knowledge of project management methodologies, such as Agile or Scrum.</li><li style=\"\"><!--block-->Strong financial acumen and ability to analyze resource-related costs and budgets.</li><li style=\"\"><!--block-->Experience in managing remote or geographically dispersed teams.</li><li style=\"\"><!--block-->RMCP Certified is a huge plus  </li></ul><div><!--block--><br></div><div><!--block--><br></div><img src=\"https://remotive.com/job/track/1920573/blank.gif?source=public_api\" alt=\"\"/>","tags":"[\"salesforce\",\"scrum\",\"agile\",\"project management\",\"documentation\",\"time management\"]","pubDate":"2024-06-29 15:21:30.000","link":"https://remotive.com/remote-jobs/project-management/it-rmo-manager-1920573","savedDate":"2024-07-01 06:29:54.137","slug":"it-rmo-manager-bluemantis-4907"},{"id":3695165323,"title":"Founder in Residence, Re-Wilding Monoculture Systems","company":"Deep Science Ventures","image":"https://remotive.com/job/1920767/logo","description":"<p><strong>Join Us as a Founder in Residence in Agriculture</strong></p>\n<p>We're on the lookout for entrepreneurial individuals with technical and commercial domain expertise with keen interest in founding, and building a global scale, impact driven, high growth company from ground up.</p>\n<p>We are seeking applications from experienced industry, startup and/or new science or engineering based technology development professionals from anywhere in the world to work with us on the outcome: enhancing the yield and profits of monoculture crops, such as sugar cane, while reducing farm footprints across the tropics.</p>\n<p>You'll work closely with the DSV team, using <a class=\"external\" href=\"https://www.deepscienceventures.com/content/the-outcomes-graph-1\" rel=\"nofollow\">our methodology</a>, to spin-out a new company. During the programme, you’ll work on all aspects related to venture creation in this opportunity area, including working out the optimal approach to solve for the desired outcome, building a team and building a viable business case. Once the new venture is incorporated with pre-seed investment from DSV, you and your co-founders will own the majority stake in the business and continue receiving support from the DSV team post-spinout.</p>\n<p>The role is full-time, initially remote (can work from anywhere) with possible relocation once the new venture is incorporated.</p>\n<p> </p>\n<p><strong>Opportunity Area: Re-wilding Monoculture Systems</strong></p>\n<p>Monoculture crops such as sugarcane are grown extensively across the Tropics, forming a key part of local and national economies. Sugarcane accounts for 79% of worldwide sugar production, while also used for biofuel production, material manufacturing, and animal feed. In 2021, global sugarcane production amounted to approximately 2 billion tonnes [<a class=\"external\" href=\"https://www.statista.com/topics/1224/sugar/#topicOverview\" rel=\"nofollow\">1</a>], supplying a market is expected to reach $221.4bn by 2027 [<a class=\"external\" href=\"https://www.industryarc.com/Research/Global-Sugar-Cane-Market-Research-513420?utm_source=LinkedInarticle&amp;utm_medium=Social&amp;utm_campaign=Sasikran\" rel=\"nofollow\">2</a>], including sugar and other products. However, the monoculture production systems adopted for these crops exact significant environmental impacts, spanning from pesticide ecotoxicity [<a class=\"external\" href=\"https://soil.copernicus.org/articles/9/381/2023/\" rel=\"nofollow\">3</a>] to deforestation [<a class=\"external\" href=\"https://www.tandfonline.com/doi/full/10.1080/1747423X.2017.1291766\" rel=\"nofollow\">4</a>] and water pressures [<a class=\"external\" href=\"https://www.czarnikow.com/blog/sugarcane-production-and-water-risks-a-longer-term-view#:~:text=Sugarcane requires approximately 1%2C500%2D2%2C500,be divided into 4 stages.)\" rel=\"nofollow\">5</a>].</p>\n<p>There is a significant acceleration in government commitments to reversing ecosystem decline [<a class=\"external\" href=\"https://www.conservation.org/blog/audacious-reforestation-effort-grows-in-brazil\" rel=\"nofollow\">6</a>, <a class=\"external\" href=\"https://www.unep.org/news-and-stories/story/cop15-ends-landmark-biodiversity-agreement\" rel=\"nofollow\">7</a>], with agriculture sitting front and centre as the industry that requires transformation [<a class=\"external\" href=\"https://assets.bbhub.io/professional/sites/24/REPORT_Biodiversity_Finance_Factbook_master_230321.pdf\" rel=\"nofollow\">8</a>]. As a result, there is growing pressure building upon companies that source agricultural products such as sugar from the Tropics to reform their practices for sustainability [<a class=\"external\" href=\"https://bonsucro.com/what-is-bonsucro/\" rel=\"nofollow\">9</a>].</p>\n<p>Therefore, we see an opportunity to significantly enhance the productive outputs from monoculture crops, starting with sugarcane, while simultaneously returning land to nature. To do so, we have developed a strategy to deploy new technologies that directly addresses Jevon’s Paradox—where increased efficiency leads to greater resource consumption [<a class=\"external\" href=\"https://en.wikipedia.org/wiki/Jevons_paradox\" rel=\"nofollow\">10</a>]. This pulls together four inter-connected pillars:</p>\n<ul style=\"\">\n<li style=\"\"><strong>Stop Loss (Post-Harvest Loss Mitigation):</strong> Reduce sucrose loss post-harvest using technologies to inhibit enzymatic degradation.</li>\n<li style=\"\"><strong>In-Plant Processing (Biotechnological Advancements):</strong> Utilize sugarcane as a bioreactor for direct synthesis of high-value compounds.</li>\n<li style=\"\"><strong>Downstream Processing (High-Value Products Creation):</strong> Convert post-harvest sugarcane into high-value products.</li>\n<li style=\"\"><strong>Technology Access to Enhance Yield (Sustainable Productivity):</strong> Increase agricultural output through sustainable practices without expanding land use.</li>\n</ul>\n<p> </p>\n<p><strong>Our Approach</strong></p>\n<p>We aim to reduce the environmental footprint of sugarcane monocultures while improving productivity, yields, and profits - simultaneously addressing the needs of farmers, agribusiness and nature. To do so, we propose a combination of post-harvest loss mitigation [<a class=\"external\" href=\"https://edisciplinas.usp.br/pluginfile.php/6138680/mod_resource/content/1/Artigo sobre deteriora%C3%A7%C3%A3o de mat%C3%A9rias-primas.pdf\" rel=\"nofollow\">11</a>] and biotechnological advancements for high-value product creation from sugar cane [<a class=\"external\" href=\"https://www.cell.com/action/showPdf?pii=S2405-8440%2823%2900483-8\" rel=\"nofollow\">12</a>, <a class=\"external\" href=\"https://ift.onlinelibrary.wiley.com/doi/10.1111/1541-4337.13307\" rel=\"nofollow\">13</a>, <a class=\"external\" href=\"https://www.scielo.br/j/aabc/a/PLxJTZmRndcKr6pmQg5frqM/?lang=en\" rel=\"nofollow\">14</a>, <a class=\"external\" href=\"https://www.pnas.org/doi/full/10.1073/pnas.2000053117\" rel=\"nofollow\">15</a>, <a class=\"external\" href=\"https://www.nature.com/articles/s41598-018-33742-y\" rel=\"nofollow\">16</a>). Approximately 30% of sucrose degrades within one day post-harvest. Reducing post-harvest losses using technologies that inhibit enzymatic degradation can therefore deliver immediate improvements in resource efficiency. Furthermore, this can be paired with both in-plant and post-harvest interventions that boost the output of high value products, to reposition sugarcane as a feedstock toward high value chemical production that offers significantly improved value capture and economic resilience for farmers. Then finally, to alleviate land use conflicts and deforestation risks that could arise for such gains, these technologies can be deployed within innovative business models that require environmental compliance for access.</p>\n<p>While we aim to start in the multi-billion dollar sugar cane industry, we also see exciting scope for new technologies built in this space to provide a platform for extension into other crops that exhibit similar characteristics and needs. We are now looking for an ambitious future Founder to make this vision a reality.</p>\n<p><strong>Requirements</strong></p>\n<p><strong>Who Should Apply</strong></p>\n<p>Most suitable candidates will likely meet most of the following criteria:</p>\n<ul style=\"\">\n<li style=\"\">PhD or equivalent industry R&amp;D know-how focused on bioprocess engineering, enzymology, fermentation, metabolic engineering, phytochemistry, molecular plant biology and/or biochemistry;</li>\n<li style=\"\">In-depth knowledge of state-of-the-art (SOTA) technologies and constraints in at least one of the following areas: tropical agronomy (particularly sugarcane), post-harvest processing, production and extraction of bioactive compounds, and/or creating circular bio-economies;</li>\n<li style=\"\">Industry-specific know-how and commercial knowledge (e.g. forming strategic partnerships, agricultural value chains, procurement, etc.) especially with experience engaging directly with farmers and agribusiness;</li>\n<li style=\"\">Proven track record of innovation, preferably with experience in startup ecosystems and fundraising;</li>\n<li style=\"\">Strong entrepreneurial mindset with the ability to translate scientific discoveries into commercial opportunities, ideally with experience conducting techno-economic analyses and market assessments;</li>\n<li style=\"\">Experience of working in a leadership role, applying project management and collaborative skills with colleagues across different teams;</li>\n<li style=\"\">Exceptional command of English, with proficiency in additional languages such as Spanish, being advantageous for key markets like tropical agriculture;</li>\n<li style=\"\">Flexibility and willingness to engage in travel or relocation, given the venture's focus on regions with strategic relevance for tropical and subtropical agriculture, like Costa Rica.</li>\n</ul>\n<p><strong>Benefits</strong></p>\n<p><strong>Our Offer</strong></p>\n<p>By joining DSV, you will be part of a team of operators who have founded companies and led the translation of science at some of the most respected universities, charities, funds, and government agencies. Here’s what we offer:</p>\n<ul style=\"\">\n<li style=\"\">Access to optimised, purpose-built, proprietary tools, resources, and processes to help create high-impact ventures from scratch;</li>\n<li style=\"\">Opportunity area-specific know-how from our network of Partners and Advisors;</li>\n<li style=\"\">Up to £250k in investment to incorporate the new venture and develop early proof-of-concept data;</li>\n<li style=\"\">Guaranteed income of £4,166 per month paid as a consultancy fee until the company is launched and the pre-seed investment is secured;</li>\n<li style=\"\">Majority equity stake in the new company for you and your co-founders;</li>\n<li style=\"\">Continuous post-spinout support, including fundraising, commercial partnerships, recruitment, and team-building;</li>\n<li style=\"\">Collaborative support from dozens of Founders currently at DSV across sectors.</li>\n</ul>\n<p> </p>\n<p><strong>About DSV</strong></p>\n<p>Deep Science Ventures (DSV) is on a mission to create a future in which both humans and the planet can thrive. We use our unique venture creation process to create, spin-out, and invest in science companies, combining available scientific knowledge and founder-type scientists into high-impact ventures. Operating in four sectors—Pharmaceuticals, Climate, Agriculture, and Computation—we tackle the challenges defining these areas by taking a first principles approach and partnering with leading institutions.</p>\n<p><br><br></p>\n<div class=\"h2\">About the company</div>\n<p> </p>\n<p><strong>Deep Science Ventures is a venture creator, combining available scientific knowledge and founder-type scientists into high-impact ventures, to build a future where both humanity and the planet thrive.</strong></p>\n<p>We combine available scientific knowledge and founder-type scientists into high-impact ventures. Deep Science Ventures operates in 4 sectors: Curative Therapeutics, Restorative Cultivation, Scaling Intelligence and Net Zero Transition, tackling the challenges defining those areas by taking a first-principles approach and partnering with leading institutions.</p>\n<img src=\"https://remotive.com/job/track/1920767/blank.gif?source=public_api\" alt=\"\"/>","tags":"[\"project management\",\"research\",\"partnerships\",\"startup\",\"fundraising\",\"travel\"]","pubDate":"2024-06-28 21:21:15.000","link":"https://remotive.com/remote-jobs/all-others/founder-in-residence-re-wilding-monoculture-systems-1920767","savedDate":"2024-07-01 06:29:54.138","slug":"founder-in-residence-re-wilding-monoculture-systems-deep-science-ventures-7846"},{"id":1948090802,"title":"Functional Testing Lead (Java)","company":"Hazelcast","image":"https://remotive.com/job/1919639/logo","description":"<div><!--block--><strong>WHAT WE NEED</strong><br>We are looking for passionate Senior Software Quality Engineers who are responsible for evaluating and testing software products to secure quality and reliability excellence within our product whilst ensuring they meet the requirements of our products as well as the needs of our customers. </div><div><!--block--><br>Utilising Hazelcast's Java based real-time data platform, we are seeking Quality Engineers with experience of development and testing Java software platforms who can work alongside experienced Java software development engineers to solve difficult problems and help realise our product quality vision. </div><div><!--block--><br>We are looking for Senior Quality Engineers who can bring further experience to the team as we look to grow our Product Quality team.</div><br><br><div class=\"h3\">WHAT YOU’LL DO</div><ul style=\"\"><li style=\"\"><!--block-->Actively collaborating with developers and stakeholders to clarify requirements, especially in terms of testability, consistency, and completeness</li><li style=\"\"><!--block-->Ensuring testing is done at the right levels - unit, integration, end-2-end, exploratory etc.</li><li style=\"\"><!--block-->Collaborating with the team, working in pairs with programmers and other team members</li><li style=\"\"><!--block-->Create test plans, develop automated tests, review test results and document findings </li><li style=\"\"><!--block-->Configuring, using and managing test environments and test data</li><li style=\"\"><!--block-->Developing and maintaining the auto test frameworks to enable other team members to contribute automated tests</li><li style=\"\"><!--block-->Embracing different types of testing - exploratory, performance testing and automated testing</li><li style=\"\"><!--block-->Ensure focus on non-functional quality attributes in our software such as reliability, resiliency, performance, scalability, security etc.</li><li style=\"\"><!--block-->Detecting, isolating, debugging and resolving software issues through reviewing configuration files, logs or code</li><li style=\"\"><!--block-->Document software defects using Jira, reporting to software developers and ensuring they are resolved in a timely manner</li><li style=\"\"><!--block-->Investigate customer defects, validating fixes and ensuring lessons learned to drive continuous improvement in quality.</li><li style=\"\"><!--block-->Lead technical projects or sub projects managing risks, resource requirements and execution</li><li style=\"\"><!--block-->Explain and simplifies complex information to others; gathers and translates business requirements and anticipates obstacles to information flow.</li><li style=\"\"><!--block-->Have direct customer or other business stakeholder interaction, navigates key issues, constructively negotiates milestones and represents well the business.</li><li style=\"\"><!--block-->Championing testing best practices and coaching other team members in relevant aspects of testing</li><li style=\"\"><!--block-->Participating proactively in daily standup meetings, story grooming sessions, team retrospectives, suggesting and implementing improvements</li></ul><div><!--block--><br></div><br><br><div class=\"h3\">WHAT YOU HAVE</div><ul style=\"\"><li style=\"\"><!--block-->Min. 8 years experience of Java development </li><li style=\"\"><!--block-->Min. 8 years formal testing and verification experience</li><li style=\"\"><!--block-->Experience with automation frameworks and tools</li><li style=\"\"><!--block-->Experience in non-functional / quality attribute verification:<ul style=\"\"><li style=\"\"><!--block-->Performance benchmarking (latency and throughput)</li><li style=\"\"><!--block-->Resilience testing (chaos and fuzzing)</li><li style=\"\"><!--block-->Scalability testing</li></ul></li><li style=\"\"><!--block-->Knowledge of following are desirable:<ul style=\"\"><li style=\"\"><!--block-->Formal testing and verification methods</li><li style=\"\"><!--block-->CI/CD (Github Actions, Jenkins)</li><li style=\"\"><!--block-->Experience with Python</li><li style=\"\"><!--block-->Experience with Linux and Bash</li><li style=\"\"><!--block-->Experience with Docker and Maven</li><li style=\"\"><!--block-->Experience with Distributed Data Stores (MongoDB, ElasticSearch, Hadoop)</li><li style=\"\"><!--block-->Experience with Messaging Systems (Apache Kafka, RabbitMQ, Pulsar)</li><li style=\"\"><!--block-->Experience of data storage testing including designing and manipulating test data</li></ul></li><li style=\"\"><!--block-->Bachelor's degree in a relevant field of study (Computer Science, or related discipline) or equivalent experience.</li></ul><div><!--block--><strong>Personal Qualities</strong> </div><ul style=\"\"><li style=\"\"><!--block-->You are hands on, solving complex software and feature problems</li><li style=\"\"><!--block-->You lead by example, influencing others through a continuous demonstration of a strong software development practice</li><li style=\"\"><!--block-->Inquisitive, using critical thinking to ask lots of questions, overcome biases, break assumptions and consider different perspectives</li><li style=\"\"><!--block-->Strong analytical and problem solving skills</li><li style=\"\"><!--block-->Excellent communication and interpersonal skills</li><li style=\"\"><!--block-->Detail-oriented with a focus on accuracy</li><li style=\"\"><!--block-->Able to effectively negotiate priorities crossing multiple teams across the business</li><li style=\"\"><!--block-->Able to collaborate with other areas of the business to solve problems.</li><li style=\"\"><!--block-->Bring strong technical leadership to the group</li><li style=\"\"><!--block-->Able to explains difficult or sensitive information; works to build consensus internally and with the wider business.</li><li style=\"\"><!--block-->You quickly learn and adapt to new technologies and testing methodologies</li><li style=\"\"><!--block-->Able to plan and organise your own work</li></ul><div><!--block--><br></div><br><br><div class=\"h3\">BENEFITS</div><ul style=\"\"><li style=\"\"><!--block-->25 days annual leave + Bank holidays</li><li style=\"\"><!--block-->Group Company Pension Plan</li><li style=\"\"><!--block-->Private Medical Insurance</li><li style=\"\"><!--block-->Private Dental Insurance</li><li style=\"\"><!--block-->Life Insurance</li><li style=\"\"><!--block-->EAP (Employee Assistance Program)</li></ul><img src=\"https://remotive.com/job/track/1919639/blank.gif?source=public_api\" alt=\"\"/>","tags":"[\"apache\",\"docker\",\"elasticsearch\",\"hadoop\",\"java\",\"kafka\",\"mongoDB\",\"python\",\"security\",\"automation\",\"jira\",\"CI/CD\",\"bash\",\"jenkins\",\"debugging\",\"Linux/Unix\",\"testing\",\"computer science\",\"github\",\"maven\",\"insurance\"]","pubDate":"2024-06-28 19:20:53.000","link":"https://remotive.com/remote-jobs/qa/functional-testing-lead-java-1919639","savedDate":"2024-07-01 06:29:54.138","slug":"functional-testing-lead-java-hazelcast-2041"}]