[{"id":8057649877,"title":"Junior Software Engineer - Argentina/Remote","company":"MixRank","image":"https://pbs.twimg.com/profile_images/378800000147745937/0fac42c12b433bbbd53ff3e15cd6fca4_400x400.png","description":"<p>At MixRank, we create B2B SaaS products that enable sales, marketing, finance, and business intelligence teams to accelerate their business with data and insights into their customers. One that provides the most comprehensive database of mobile apps and websites, technographics, companies, and decision makers. It's a platform created with the sole purpose of providing the fastest way for sales reps to build prospect lists, prioritize leads, and contact decision-makers.</p>\n<p>We're looking for remote engineers that have finished school within the last 2 years or will finish in the next 6 months. This is an open-ended entry-level role with mentorship, and diverse opportunities to work on all areas of our product: databases, distributed systems, infrastructure and tooling, data analysis, machine learning, frontend and backend web development, APIs, data mining, data modeling, and more.</p>\n<p>Our code base is very friendly to new contributors. You'll have a fully-functional development environment within hours (fully automated) and be pushing commits on your first day. Deployments to production happen multiple times per day and finish in less than 2 minutes. Effectively all of our codebase is written in Python, SQL, and Javascript/TypeScript. The core technologies you'll need familiarity with to be productive are Python, PostgreSQL, Linux, and Git.</p>\n<p>Why Join MixRank? Fully-remote, no HQ office. Team of 44 people across 15+ countries. Invested in by Y Combinator, 500 Startups, Mark Cuban. Profitable and growing 50% every year.</p>\n<p>Please include your updated resume when applying for this role.</p>\n<p><strong>Important:</strong>&nbsp;Only accept job offers from emails ending in @<a href=\"http://mixrank.com/\" target=\"_blank\">mixrank.com</a>. Offers from any other email addresses are fraudulent. Do not share personal information with unverified senders.</p>\n","tags":"[\"postgres\",\"javascript\",\"typescript\",\"finance\",\"b2b\",\"database\"]","pubDate":"2025-01-29T09:12:53.418Z","link":"https://www.ycombinator.com/companies/mixrank/jobs/zkkqsPc-junior-software-engineer-argentina-remote","slug":"junior-software-engineer-argentina-remote-mixrank-5788"},{"id":9843720060,"title":"Data Scientist","company":"Atticus","image":"https://media.licdn.com/dms/image/v2/D560BAQHWkZ4dfdnqcQ/company-logo_200_200/company-logo_200_200/0/1667241664749/atticushq_logo?e=1743033600&v=beta&t=IKimC8hb4UT-bQFVefDOJ5jfW_yxRN7of8ZLj5GtZ4Q","description":"<h3><strong>About Atticus</strong></h3><p style=\"min-height:1.5em\">At any given time, 16 million Americans are experiencing a crisis that requires urgent help from our legal system or government. The right assistance could transform their lives. But today, most never get it. </p><p style=\"min-height:1.5em\">Atticus makes it easy for any sick or injured person in crisis to get the life-changing aid they deserve. In just three years, we’ve become the leading platform connecting people with disabilities to government benefits. We also help victims of accidents, misconduct, and violence get compensation from insurance. So far, we’ve gotten thousands of people access to over $2B in life-changing aid, and we’re just getting started.</p><p style=\"min-height:1.5em\">We've helped more than 20,000 people in need (see our 12,000+ five-star reviews) and raised more than $50 million from top VC firms like Forerunner, GV (Google Ventures), and True Ventures. (We closed our Series B round in May 2023, so we're well-funded for the foreseeable future.) We're small but moving fast — our team grew from 91 to over 150 last year and we expect to grow again in 2025.</p><h3><strong>The Job</strong></h3><p style=\"min-height:1.5em\">Our business generates a wealth of data with untapped potential to support people in need of aid, and improve their likelihood of positive outcomes in the legal system. Our platform covers a lot: evaluating a client’s case, giving advice, matching them with the right lawyer, formalizing the arrangement, and helping both parties work together as the case progresses. The data we generate across this end-to-end journey provides a unique opportunity to improve client experiences at a national scale for the legal practice areas we support, using novel data unavailable to other industry actors (individual law firms, government agencies).</p><p style=\"min-height:1.5em\">We are looking for Data Scientists to join our team and leverage this data to fulfill our mission. You’ll help establish the central Data Science team with our <a target=\"_blank\" rel=\"noopener noreferrer nofollow\" href=\"https://www.linkedin.com/in/vquoss/\"><u>Lead Data Scientist</u></a>, and embed closely with departments within Atticus to help us better apply data across all areas of our platform.</p><h3><strong>What you’ll do:</strong></h3><ul style=\"min-height:1.5em\"><li><p style=\"min-height:1.5em\">Serve as a founding member of the company’s data science function, building a culture of collaboration, growth, and excellence that will attract talent for years to come</p></li><li><p style=\"min-height:1.5em\">Design metrics, build data pipelines, run experiments, launch models – apply a broad toolkit to expansive data from a rapidly growing business</p></li><li><p style=\"min-height:1.5em\">Work closely with department leads and their teams to ensure our decision-making and operations are data-informed</p></li><li><p style=\"min-height:1.5em\">Interpret data as the collective voice of our clients, generating insights that inform our product roadmap and user experience </p></li><li><p style=\"min-height:1.5em\">Hold teams accountable to measurable impact, enabling them to identify and target their most effective levers to improve the business</p></li></ul><p style=\"min-height:1.5em\">The role is a rare opportunity to join a fast-growing Series B startup that doubles as a B-corp social enterprise. Every project you take on will help clients in need get the help they deserve, and you’ll shape our company culture as we scale. We’re looking for data scientists who are excited about our mission and the challenges it entails.</p><h3><strong>Qualifications</strong></h3><p style=\"min-height:1.5em\">Required:</p><ul style=\"min-height:1.5em\"><li><p style=\"min-height:1.5em\">You have 4+ years of relevant industry experience at a high-growth startup, or scrappy team at a larger company</p></li><li><p style=\"min-height:1.5em\">You’re eager to jump in and serve as the primary data thought partner for a cross-functional team working on a novel and quickly evolving problem space</p></li><li><p style=\"min-height:1.5em\">You’re excited about providing “full-stack” data support covering metric &amp; data model design, exploratory analysis, testing &amp; experimentation, and predictive modeling</p></li><li><p style=\"min-height:1.5em\">You’re fluent in SQL, and have substantial professional experience with Python or R</p></li><li><p style=\"min-height:1.5em\">You’ve built key metrics, reporting, and models from scratch for a product or business domain</p></li><li><p style=\"min-height:1.5em\">You’ve leveraged A/B testing or causal inference methods to help teams identify and target their most effective levers</p></li></ul><p style=\"min-height:1.5em\">Bonus / Nice-to-Have:</p><ul style=\"min-height:1.5em\"><li><p style=\"min-height:1.5em\">You have experience working on a two-sided marketplace</p></li><li><p style=\"min-height:1.5em\">You have experience with non-experimental casual inference methods</p></li><li><p style=\"min-height:1.5em\">You’ve shipped and maintained model code in a production environment</p></li></ul><p style=\"min-height:1.5em\">We are strongly committed to building a diverse team. If you’re from a background that’s underrepresented in tech, we’d love to meet you.</p><h3><strong>Salary and Benefits</strong></h3><p style=\"min-height:1.5em\">This is a rare opportunity to join a startup that has strong traction (substantial funding, well-respected backers, tremendous growth, and many happy customers) but is still small enough that you can have a huge impact and play a role in shaping our culture.</p><p style=\"min-height:1.5em\">We’re a certified B Corporation tackling a critical social problem. Our mission to help people in need drives everything we do, and your work here will touch many lives.</p><p style=\"min-height:1.5em\">We offer competitive pay — including equity — and generous benefits:</p><ul style=\"min-height:1.5em\"><li><p style=\"min-height:1.5em\">Medical and dental insurance with 100% of employee premiums covered</p></li><li><p style=\"min-height:1.5em\">15 vacation days &amp; ~19 paid holidays each year (including two weeks at end-of-year)</p></li><li><p style=\"min-height:1.5em\">Free membership to OneMedical</p></li><li><p style=\"min-height:1.5em\">$1,000 reimbursable stipend for education and training outside of work</p></li><li><p style=\"min-height:1.5em\">Student loan repayment assistance, 401(k), and optional HSA</p></li><li><p style=\"min-height:1.5em\">Free snacks, drinks, weekly lunches, and regular team dinners/events/retreats</p></li><li><p style=\"min-height:1.5em\">Humble, thoughtful, smart, fun colleagues </p></li></ul><p style=\"min-height:1.5em\">We anticipate the base salary band for this role will be between $150,000 and $180,000 in addition to equity and benefits. The salary at offer will be determined by a number of factors such as candidate’s experience, knowledge, skills and abilities, as well as internal equity among our team.</p><h3><strong>Location</strong></h3><p style=\"min-height:1.5em\">Today, about a third of our team are in Los Angeles (where we are headquartered) and the rest are fully remote and spread across the U.S. There are two options for this job:</p><ol style=\"min-height:1.5em\"><li><p style=\"min-height:1.5em\">Live in Los Angeles, work a few days a week (or more) out of our beautiful office downtown.</p></li><li><p style=\"min-height:1.5em\">Live wherever, work remotely, and travel to LA (on the company dime) as needed to be with your colleagues — typically once or twice per quarter.</p></li></ol><p style=\"min-height:1.5em\">In short: You can do this job well remotely, and we’re committed to empowering everyone with flexibility. But we care a lot about building a great culture and we think some interactions need to happen in person, so we put a lot of thought into retreats, offsites, and other ways to gather. </p><p style=\"min-height:1.5em\"><br /><br /></p>","tags":"[\"legal\"]","pubDate":"2025-01-28T22:30:25.188Z","link":"https://jobs.ashbyhq.com/atticus/9b841d71-e185-4d4d-ad38-7ffcbc886dd5","slug":"data-scientist-atticus-1376"},{"id":6801013140,"title":"AFC Analyst (Remote - Work from Anywhere)","company":"Xapo Bank","image":"https://avatars.githubusercontent.com/u/6930305?s=200&v=4","description":"&lt;div class=&quot;content-intro&quot;&gt;&lt;p style=&quot;text-align: left;&quot;&gt;&lt;span style=&quot;font-weight: 900;&quot;&gt;Work from anywhere, impact everywhere&amp;nbsp;&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;Diversity is at the heart of who we are at Xapo Bank. We’re a fully distributed team of over 140 Xapiens that work remotely from 40+ countries around the world.&amp;nbsp;&lt;/p&gt;\n&lt;p&gt;Our beginning: A world that enjoys economic freedom and wealth protection, no matter where you live or who is running your country. This is the dream that drove Wences Casares, our Founder and Chairman, to quietly transform the world of banking.&lt;/p&gt;\n&lt;p&gt;To achieve that, we search the world for the best people for the job. We work hard, think globally, and inspire each other to learn and grow. We are committed to changing the way things are done.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Risk is inherent in all of our business activities and managing risk well is the responsibility of every Xapien. Sound risk management enables us to serve our customers and deliver value for our shareholders, and helps make Xapo a great place to work.&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&amp;nbsp;&lt;/p&gt;\n&lt;p style=&quot;text-align: left;&quot;&gt;&lt;em&gt;&lt;span style=&quot;font-weight: 500;&quot;&gt;Although we are headquartered in Gibraltar, this is a full time, 100% remote position&amp;nbsp;&lt;br&gt;&lt;/span&gt;&lt;/em&gt;&lt;em&gt;&lt;span style=&quot;font-weight: 500;&quot;&gt;Work from anywhere!&lt;/span&gt;&lt;/em&gt;&lt;/p&gt;\n&lt;p style=&quot;text-align: left;&quot;&gt;&amp;nbsp;&lt;/p&gt;&lt;/div&gt;&lt;p&gt;&lt;strong&gt;Position Overview&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;Xapo is looking for an Anti-Financial Crime Analyst to identify, investigate and prevent financial crime by&amp;nbsp; reviewing suspicious transactions and activities to ensure we comply with all AML regulations and requirements.&amp;nbsp;&lt;/p&gt;\n&lt;p&gt;You will be part of a team of AFC Analysts responsible for reviewing and actioning alerts related to Onboarding, Fraud, AML, PEP &amp;amp; Sanctions and transaction monitoring. If you’re passionate about Bitcoin and preventing financial crime, this is a great opportunity to develop your career in a growing team.&amp;nbsp;&amp;nbsp;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;The ideal candidate will be either in US or Asian time zones to ensure Xapo’s ability to review alerts around the clock. Please note: This role requires working one weekend per month, with weekdays off in lieu.&amp;nbsp;&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Key Responsibilities&lt;/strong&gt;&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;Conduct Know Your Customer (KYC) and Customer Due Diligence (CDD) reviews of individual customers during onboarding.&lt;/li&gt;\n&lt;li&gt;Review alerts for suspicious transactions and behaviour to prevent fraud losses for Xapo and customers alike.&amp;nbsp;&lt;/li&gt;\n&lt;li&gt;Conduct transaction monitoring on fiat and crypto transactions sent to &amp;amp; from Xapo customers.&lt;/li&gt;\n&lt;li&gt;Detect, investigate and report suspicious activities, including predicate offences related to money laundering and terrorist financing.&amp;nbsp;&lt;/li&gt;\n&lt;li&gt;Review individual and business customer screening alerts for sanctions, PEPs and adverse media.&amp;nbsp;&lt;/li&gt;\n&lt;li&gt;Escalate any red flags and potential risks to senior team members.&lt;/li&gt;\n&lt;li&gt;Raise iSARs and other regulatory reports to the MLRO&lt;/li&gt;\n&lt;li&gt;Manage sensitive and confidential information with utmost care and integrity.&lt;/li&gt;\n&lt;li&gt;Work collaboratively within a cross-functional, global team&lt;/li&gt;\n&lt;li&gt;Take responsibility for the quality completion of cases&amp;nbsp;&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;&lt;strong&gt;Skills needed:&lt;/strong&gt;&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;Bachelor&#39;s degree in finance, economics, accounting, criminology, or a related field.&lt;/li&gt;\n&lt;li&gt;At least 1 year of relevant industry experience&lt;/li&gt;\n&lt;li&gt;An entry level knowledge of financial crime prevention, compliance, law or a similar discipline;&amp;nbsp;&lt;/li&gt;\n&lt;li&gt;Experience managing high volumes of workloads with competing priorities;&lt;/li&gt;\n&lt;li&gt;A methodical and logical approach combined with accuracy and attention to detail.&lt;/li&gt;\n&lt;li&gt;Self driven, curious, proactive and able to operate in a fast-paced environment.&amp;nbsp;&lt;/li&gt;\n&lt;li&gt;Strong communication skills, both written and verbal.&lt;/li&gt;\n&lt;li&gt;Past experience of working within Fintech, Banking or Cryptocurrency industries is required&lt;/li&gt;\n&lt;li&gt;ACAMS, ACFCS, ACFE or similar certifications are highly desirable&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;&lt;strong&gt;&lt;em&gt;Other requirements&lt;/em&gt;&lt;/strong&gt;&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;&amp;nbsp;A dedicated workspace.&lt;/li&gt;\n&lt;li&gt;&amp;nbsp;A reliable internet connection with the fastest speed possible in your area&lt;/li&gt;\n&lt;li&gt;&amp;nbsp;Devices and other essential equipment that meet minimal technical specifications.&lt;/li&gt;\n&lt;li&gt;&amp;nbsp;Alignment with Our Values.&lt;/li&gt;\n&lt;/ul&gt;&lt;div class=&quot;content-conclusion&quot;&gt;&lt;p&gt;&lt;span style=&quot;font-size: 12pt;&quot;&gt;&lt;strong&gt;Why work for Xapo?&lt;/strong&gt;&lt;/span&gt;&lt;/p&gt;\n&lt;p&gt;&lt;span style=&quot;font-weight: 500; font-size: 10pt;&quot;&gt;IMPACT GLOBALLY, WORK REMOTELY.&lt;/span&gt;&lt;/p&gt;\n&lt;ul&gt;\n&lt;li style=&quot;font-weight: 500;&quot;&gt;&lt;strong&gt;Shape the Future:&lt;/strong&gt;&lt;span style=&quot;font-weight: 500;&quot;&gt; Improve lives through cutting-edge technology, work 100% remotely from anywhere in the world.&lt;/span&gt;&lt;/li&gt;\n&lt;li style=&quot;font-weight: 500;&quot;&gt;&lt;strong&gt;Great work-life balance:&lt;/strong&gt;&lt;span style=&quot;font-weight: 500;&quot;&gt; &lt;/span&gt;&lt;span style=&quot;font-weight: 500;&quot;&gt;Build amazing things with a balance of autonomy and collaborative teamwork. Set your own work schedule and make use of a flexible PTO plan when you need to recharge.&lt;/span&gt;&lt;span style=&quot;font-weight: 500;&quot;&gt;&amp;nbsp;&lt;/span&gt;&lt;/li&gt;\n&lt;li style=&quot;font-weight: 500;&quot;&gt;&lt;strong&gt;Expect Excellence:&lt;/strong&gt;&lt;span style=&quot;font-weight: 500;&quot;&gt; Collaborate, learn, and grow with a high-performance team. Learn&lt;/span&gt;&lt;span style=&quot;font-weight: 500;&quot;&gt; how you learn best - from books to conferences, you’ll get a yearly budget for your individual learning and development goals.&lt;/span&gt;&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;&lt;strong&gt;At Xapo, we prioritize consumer protection and adhere to regulatory requirements by ensuring that all Xapiens are accountable for upholding principles of fair treatment, transparency, and ethical conduct in their interactions with customers and stakeholders.&lt;/strong&gt;&lt;/p&gt;&lt;/div&gt;","tags":"[\"finance\",\"management\"]","pubDate":"2025-01-28T18:33:08.000Z","link":"https://job-boards.greenhouse.io/xapo61/jobs/6341526003","slug":"afc-analyst-remote-work-from-anywhere-xapo-bank-9047"},{"id":6869301337,"title":"Growth Marketing Manager","company":"Synthflow","image":"https://yt3.googleusercontent.com/d1EZViC7xXJl3O7DDUguF5UgjjvGXpqeKMhl-ivOftHbUeIFJDURN3TR8MnKewBKI44oO3n5HA=s160-c-k-c0x00ffffff-no-rj","description":"<p style=\"min-height:1.5em\"><strong>Location: </strong>Remote </p><p style=\"min-height:1.5em\"><strong>Type: </strong>Full-Time </p><p style=\"min-height:1.5em\"><strong>Salary:</strong> 60-100,000 USD, depending on experience and location</p><p style=\"min-height:1.5em\"><strong>About Synthflow:</strong><br />At Synthflow, we’re building the easiest way for businesses to create AI-powered phone agents. We’re early, fast-growing, and laser-focused on making a massive impact. Our mission is to empower businesses to thrive by simplifying complex AI workflows. Join us to do the best work of your career while helping shape the future of AI-driven communication.</p><p style=\"min-height:1.5em\"><strong>The Role:</strong><br />We’re looking for a <strong>Growth Marketing Manager</strong> to work across Growth, Lifecycle, and Product Marketing to help drive our product’s branding, positioning, and messaging. You’ll <strong>own</strong> key areas like email communications, community building, influencer marketing, and content creation.</p><p style=\"min-height:1.5em\">This is a unique opportunity to join a fast-paced, early-stage startup and make a tangible impact on our trajectory. If you’re passionate about growth, love working at the intersection of marketing and product, and thrive in a dynamic environment, we want to hear from you.</p><p style=\"min-height:1.5em\"><strong>What You’ll Do:</strong></p><ul style=\"min-height:1.5em\"><li><p style=\"min-height:1.5em\"><strong>Own Community Building:</strong> Oversee and grow our vibrant communities on platforms like Discord, Skool, and Circle. Foster meaningful interactions, plan live events (webinars, Q&amp;A sessions, etc.), and create a sense of belonging among users.</p></li><li><p style=\"min-height:1.5em\"><strong>Own Email Comms:</strong> Craft and execute email campaigns that engage, educate, and convert our audience.</p></li><li><p style=\"min-height:1.5em\"><strong>Own Influencer Marketing:</strong> Scout and manage influencers to create engaging content about Synthflow across platforms like YouTube (videos), LinkedIn, newsletters, and more.</p></li><li><p style=\"min-height:1.5em\"><strong>Manage Content Creation &amp; Organic Social:</strong> Write compelling content (blogs, social posts, newsletters) and manage organic content on our social profiles (Facebook, Instagram, LinkedIn) to keep our audience engaged and up-to-date on all things Synthflow AI.</p></li><li><p style=\"min-height:1.5em\"><strong>Help with Branding &amp; Messaging:</strong> Collaborate with the team to refine our product’s branding, positioning, and messaging.</p></li><li><p style=\"min-height:1.5em\"><strong>Collaborate on Creative Assets:</strong> Work with our design team to create compelling assets for ads, social media posts, and other marketing materials.</p></li></ul><p style=\"min-height:1.5em\"><strong>What We’re Looking For:</strong></p><ul style=\"min-height:1.5em\"><li><p style=\"min-height:1.5em\">Proven experience in growth marketing, lifecycle marketing, or product marketing.</p></li><li><p style=\"min-height:1.5em\">Strong writing and storytelling skills with the ability to craft clear, compelling messaging.</p></li><li><p style=\"min-height:1.5em\">Experience managing and growing online communities (Discord, Skool, Circle, etc.).</p></li><li><p style=\"min-height:1.5em\">A track record of working with influencers and managing influencer campaigns.</p></li><li><p style=\"min-height:1.5em\">Empathy and enthusiasm for engaging with users and building relationships.</p></li><li><p style=\"min-height:1.5em\">Nice to have: Willingness to learn and advocate for a technical product.</p></li><li><p style=\"min-height:1.5em\">Nice to have: Experience with no-code and automation tools.</p></li></ul><p style=\"min-height:1.5em\"><strong>Why Join Synthflow?</strong></p><ul style=\"min-height:1.5em\"><li><p style=\"min-height:1.5em\">Be part of a fast-growing, early-stage startup with a mission to democratize AI.</p></li><li><p style=\"min-height:1.5em\">Work on a product that users love and rely on to grow their businesses.</p></li><li><p style=\"min-height:1.5em\">Collaborate with a passionate, empathetic, and talented team.</p></li><li><p style=\"min-height:1.5em\">Enjoy the flexibility of remote work and a supportive, impact-driven culture.</p></li></ul><p style=\"min-height:1.5em\"><strong>Ready to Make an Impact?</strong><br />If you’re excited to take ownership of key growth initiatives at a high-impact startup, we’d love to hear from you. Apply now and let’s build something incredible together.</p>","tags":"[]","pubDate":"2025-01-28T17:29:54.132Z","link":"https://jobs.ashbyhq.com/synthflow/e2588216-d6cb-4ca3-80fe-384edc0d1866","slug":"growth-marketing-manager-synthflow-3993"},{"id":5356513788,"title":"Revenue Enablement Specialist [IC1 - IC2]","company":"Sourcegraph","image":"https://avatars.githubusercontent.com/u/3979584?s=200&v=4","description":"&lt;div class=&quot;content-intro&quot;&gt;&lt;h2&gt;&lt;strong&gt;&lt;span style=&quot;color: #a112ff;&quot;&gt;Who we are&lt;/span&gt;&lt;/strong&gt;&lt;/h2&gt;\n&lt;p&gt;Our mission at Sourcegraph is to make it so that &lt;a href=&quot;https://www.notion.so/sourcegraph/Mission-values-e9d37e6b972a4ef395c3076aea2bd07d?pvs=4&quot;&gt;everyone can code&lt;/a&gt;, not just ~0.1% of the population.&amp;nbsp;&lt;/p&gt;\n&lt;p&gt;We are transforming how the world’s most important companies build software by industrializing development with AI. Today, most professional developers spend a disproportionate amount of time understanding code and performing repetitive, low-level tasks—leaving less time for innovation and meaningful impact.&lt;/p&gt;\n&lt;p&gt;We’re changing that. Sourcegraph brings AI-powered search and agents to the enterprise, helping teams automate the mundane and amplify what developers do best— solving hard problems and creating great products.&lt;/p&gt;\n&lt;p&gt;Here’s how we’re making a difference:&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;&lt;strong&gt;Accelerating developers &lt;/strong&gt;with AI agents that deliver insights and precision—enabling 5x faster test creation, 30% increase in merge requests, and saving 20 minutes per developer daily.&lt;/li&gt;\n&lt;li&gt;&lt;strong&gt;Automating repetitive tasks,&lt;/strong&gt; from remediating vulnerabilities (saving teams 1,000+ hours annually) to speeding up migrations that would take years to months.&amp;nbsp;&lt;/li&gt;\n&lt;li&gt;&lt;strong&gt;Enabling innovation&lt;/strong&gt; by addressing complex problems like automated bug triage, vulnerability detection, and AI-driven code reviews seamlessly integrated into workflows.&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;Trusted by 7/10 top software companies by market cap, 4/6 top US banks and many of the companies leading global innovation, like Stripe, Indeed, Tesla, and 1Password, and with $225M in funding from investors like &lt;a href=&quot;https://techcrunch.com/2021/07/13/sourcegraph-raises-125m-series-d-on-2-6b-valuation-for-universal-code-search-tool/&quot;&gt;a16z&lt;/a&gt;, &lt;a href=&quot;https://about.sourcegraph.com/blog/series-c-with-sequoia/&quot;&gt;Sequoia&lt;/a&gt;, and &lt;a href=&quot;https://www.redpoint.com/companies/sourcegraph/&quot;&gt;Redpoint&lt;/a&gt;, we are building the tools that will define the next era of enterprise software development.&lt;/p&gt;\n&lt;p&gt;If you’re passionate about solving the hardest problems in software and shaping the future of technology, join us. Let’s build something extraordinary together.&lt;/p&gt;&lt;/div&gt;&lt;h2&gt;&lt;span style=&quot;color: rgb(161, 18, 255);&quot;&gt;Location&lt;/span&gt;&lt;/h2&gt;\n&lt;p&gt;🌎 While we hire&amp;nbsp;&lt;a href=&quot;https://sourcegraph.notion.site/How-we-engage-talent-outside-of-the-US-218f7193695a46cbb1ef39ef9c1f72d4&quot;&gt;almost anywhere&lt;/a&gt; in the world, we have office hubs in select locations and expect this person to reside in San Francisco, Denver or Austin.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Preferred locations:&lt;/strong&gt;&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;San Francisco, CA&lt;/li&gt;\n&lt;li&gt;Denver, CO&lt;/li&gt;\n&lt;li&gt;Austin, TX&lt;/li&gt;\n&lt;/ul&gt;\n&lt;h2&gt;&lt;span style=&quot;color: rgb(161, 18, 255);&quot;&gt;&lt;strong&gt;Why this job is exciting&lt;/strong&gt;&lt;/span&gt;&lt;/h2&gt;\n&lt;p&gt;Joining Sourcegraph as a Revenue Enablement Specialist is an incredible opportunity to empower a high-performing revenue team at the forefront of developer productivity. You&#39;ll play a pivotal role in shaping enablement programs, refining processes, and creating impactful resources that directly drive revenue growth. Plus, you’ll work in a fast-paced, collaborative environment where your ideas and strategies can make a tangible impact on the company’s success.&lt;/p&gt;\n&lt;p&gt;📅 Within one month, you will…&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;Develop strong relationships with key members of the Sales, Technical Success, Revenue Operations, Marketing and People teams to align our strategies with business priorities.&lt;/li&gt;\n&lt;li&gt;Analyze our existing enablement&amp;nbsp; programs processes and make recommendations for improvement.&lt;/li&gt;\n&lt;li&gt;Learn the landscape by understanding Sourcegraph&#39;s product, sales process, and go-to-market strategy.&lt;/li&gt;\n&lt;li&gt;Familiarize themselves with existing tools (like Salesforce, Highspot) and enablement resources.&lt;/li&gt;\n&lt;li&gt;By the end of the first month, be positioned as a trusted partner to the revenue team and ready to take on their first enablement initiatives.&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;📅 Within three months, you will…&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;Tackle immediate needs, like updating a key resource, assisting with onboarding, or supporting a specific sales campaign.&lt;/li&gt;\n&lt;li&gt;Start rolling out updates to sales materials, onboarding programs, or processes based on feedback from the first month.&lt;/li&gt;\n&lt;li&gt;Deliver quick wins, such as a refreshed playbook, competitive battle cards, or updated messaging frameworks.&lt;/li&gt;\n&lt;li&gt;Actively participate in team meetings and sales calls to better understand challenges and align enablement efforts.&lt;/li&gt;\n&lt;li&gt;Collaborate with marketing, product, and revenue operations teams to align enablement efforts with company goals.&lt;/li&gt;\n&lt;li&gt;Gather ongoing feedback from sales reps and refine programs or resources as needed.&lt;/li&gt;\n&lt;li&gt;Start measuring the impact of enablement efforts by analyzing data (e.g., time to ramp, sales cycle length, or win rates).&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;📅 Within six months, you will…&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;Take full ownership of at least one major enablement initiative, such as onboarding, product training, or a sales content overhaul.&lt;/li&gt;\n&lt;li&gt;Design and execute a comprehensive training program, ensuring it aligns with the needs of the revenue team and supports their goals.&lt;/li&gt;\n&lt;li&gt;Collaborate closely with leadership to ensure enablement programs are continuously aligned with team performance and business objectives.&lt;/li&gt;\n&lt;li&gt;Leverage data and analytics to track the effectiveness of enablement initiatives (e.g., improvements in ramp time, win rates, or sales cycle duration).&lt;/li&gt;\n&lt;li&gt;Ensure all sales teams (e.g., SDRs, AEs, Customer Success) are equipped with the right content and tools to excel at every stage of the customer journey.&lt;/li&gt;\n&lt;li&gt;Establish strong feedback loops with sales reps, managers, and other stakeholders to refine enablement programs and materials based on real-world use.&lt;/li&gt;\n&lt;li&gt;Be recognized as a go-to resource for sales teams, offering guidance, coaching, and actionable support whenever needed.&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;📅 Within one year, you will…&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;Develop and execute a comprehensive, scalable sales enablement strategy aligned with Sourcegraph’s revenue goals.&lt;/li&gt;\n&lt;li&gt;Continuously improve onboarding programs to reduce ramp time and equip new hires with the skills and tools to succeed.&lt;/li&gt;\n&lt;li&gt;Demonstrate measurable improvements in key sales metrics, such as win rates, deal velocity, and quota attainment.&lt;/li&gt;\n&lt;li&gt;Create and maintain a robust, up-to-date repository of enablement materials, including playbooks, battle cards, objection-handling guides, and training modules.&lt;/li&gt;\n&lt;li&gt;Lead ongoing training sessions, including product updates, market trends, and skills workshops, to keep the sales team sharp and competitive.&lt;/li&gt;\n&lt;li&gt;Foster a feedback-rich environment where reps feel supported in their growth and development.&lt;/li&gt;\n&lt;li&gt;Build the foundation for scaling enablement efforts as Sourcegraph grows, ensuring the team is future-ready.&lt;/li&gt;\n&lt;li&gt;Establish yourself as a trusted advisor to sales leadership, contributing strategic insights and recommendations.&lt;/li&gt;\n&lt;/ul&gt;\n&lt;h2&gt;&lt;span style=&quot;color: rgb(161, 18, 255);&quot;&gt;&lt;strong&gt;About you&lt;/strong&gt;&lt;/span&gt;&lt;/h2&gt;\n&lt;p&gt;You are a proactive, resourceful, and detail-oriented professional who thrives in a fast-paced, high-growth environment. You’re passionate about empowering sales teams to succeed and love creating tools, resources, and training that make their jobs easier and more impactful. You have a knack for simplifying complex information and aligning cross-functional teams toward a common goal. You are strongly aligned with our &lt;a href=&quot;https://sourcegraph.notion.site/Mission-values-e9d37e6b972a4ef395c3076aea2bd07d&quot;&gt;values&lt;/a&gt;, inspired by our mission to make it so that everyone can code, and motivated to do your best work at Sourcegraph.&lt;/p&gt;\n&lt;p&gt;You’re not just a doer—you’re a problem solver who uses data and feedback to continuously improve processes and programs. You’re comfortable balancing strategy and execution, and you’re always looking for new ways to enable the sales team to achieve their best results.&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;🫴Proven track record of supporting sales teams with training, tools, and resources that drive measurable outcomes.&lt;/li&gt;\n&lt;li&gt;💪 Strong project management skills, with the ability to prioritize tasks and manage multiple initiatives simultaneously.&lt;/li&gt;\n&lt;li&gt;🧠 Proficiency with sales tools like Notion, Continu, Salesforce, or similar sales and enablement platforms.&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;Nice to haves:&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;🔍 2+ years in sales enablement, sales operations, or a related role within a SaaS or tech company.&lt;/li&gt;\n&lt;li&gt;Previous experience in B2B software sales&lt;/li&gt;\n&lt;li&gt;Previous experience in developer tools&lt;/li&gt;\n&lt;/ul&gt;\n&lt;h2&gt;&lt;span style=&quot;color: rgb(161, 18, 255);&quot;&gt;&lt;strong&gt;Level&lt;/strong&gt;&lt;/span&gt;&lt;/h2&gt;\n&lt;p&gt;📊 This job is an IC1 - IC2.&amp;nbsp; You can read more about &lt;a href=&quot;https://www.notion.so/sourcegraph/Leveling-Guide-0e1b5c76ada64b9caac387f8b7c4fc66&quot;&gt;our job leveling philosophy&lt;/a&gt; in our Handbook.&lt;/p&gt;\n&lt;h2&gt;&lt;span style=&quot;color: rgb(161, 18, 255);&quot;&gt;&lt;strong&gt;Compensation&lt;/strong&gt;&lt;/span&gt;&lt;/h2&gt;\n&lt;p&gt;&lt;strong&gt;💸 We pay you an above-average salary&lt;/strong&gt; because we want to hire the best people who are fully focused on helping Sourcegraph succeed, not worried about paying bills. As an &lt;a href=&quot;https://sourcegraph.notion.site/Mission-values-e9d37e6b972a4ef395c3076aea2bd07d&quot;&gt;open and transparent&lt;/a&gt; company that values &lt;a href=&quot;https://www.notion.so/sourcegraph/Compensation-Pay-Transparency-at-Sourcegraph-d58d0774f51b4b489d41c3628d30ff8d?pvs=4&quot;&gt;competitive compensation&lt;/a&gt;, our compensation ranges are visible to every single Sourcegraph teammate.&lt;/p&gt;\n&lt;p&gt;Your salary is determined by your pay band for the IC1 - IC2 job level. For determining pay bands, we use a number of market and data-driven salary sources, along with your location zone, and target the high-end of the range to ensure we’re always paying above market regardless of where you live in the world. Both U.S. and international locations are divided into one of four zones, determined by the cost of labor index for each area. The salary for a successful candidate will be based on level, job-related skills, experience, qualifications, and location zone. Please note that the salaries below may be adjusted in the future.&lt;/p&gt;\n&lt;p&gt;💰 The target compensation for this role is based on the IC1 - IC2 pay band for your zone.&amp;nbsp;&lt;/p&gt;\n&lt;p&gt;Zone 1: $78,000 - $90,000 USD&amp;nbsp;&lt;br&gt;Zone 2: $62,400 - $78,000 USD&lt;/p&gt;\n&lt;p&gt;Please speak with a recruiter for additional information regarding zone locations.&lt;/p&gt;\n&lt;p&gt;📈 In addition to our cash compensation, we offer equity (because when we succeed as a company, we want you to succeed, too) and generous &lt;a href=&quot;https://sourcegraph.notion.site/Benefits-Perks-dd1da4b6b3a64780abed010a144d34ba&quot;&gt;perks &amp;amp; benefits&lt;/a&gt;.&lt;/p&gt;\n&lt;h2&gt;&lt;span style=&quot;color: rgb(161, 18, 255);&quot;&gt;&lt;strong&gt;Interview process&lt;/strong&gt;&lt;/span&gt;&lt;/h2&gt;\n&lt;p&gt;&lt;em&gt;Below is the interview process you can expect for this role (you can read more about &lt;/em&gt;&lt;a href=&quot;https://sourcegraph.notion.site/Types-of-interviews-f279f080583d49ee9f2c60e30c8cb1f7&quot;&gt;&lt;em&gt;the types of interviews&lt;/em&gt;&lt;/a&gt;&lt;em&gt; in our Handbook). It may look like a lot of steps, but rest assured that we move quickly and the steps are designed to help you get the information needed to determine if we’re the right fit for you… Interviewing is a two-way street, after all!&amp;nbsp;&lt;/em&gt;&lt;/p&gt;\n&lt;p&gt;We expect the interview process to take 3.5 hours in total.&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;👋 Introduction Stage&lt;/strong&gt; - we have initial conversations to get to know you better…&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;[30m]&amp;nbsp;&lt;a href=&quot;https://www.notion.so/sourcegraph/Types-of-interviews-sample-questions-f279f080583d49ee9f2c60e30c8cb1f7?pvs=4#99be5ff628b2414194a0ba79d9f25f13&quot;&gt;Recruiter Screen&lt;/a&gt;&lt;/li&gt;\n&lt;li&gt;[45m]&amp;nbsp;&lt;a href=&quot;https://www.notion.so/sourcegraph/Types-of-interviews-sample-questions-f279f080583d49ee9f2c60e30c8cb1f7?pvs=4#1919882c0cf147c487eb1df40db8a694&quot;&gt;Hiring Manager Screen&lt;/a&gt; / &lt;a href=&quot;https://www.notion.so/sourcegraph/Types-of-interviews-sample-questions-f279f080583d49ee9f2c60e30c8cb1f7?pvs=4#c678a2a86e0e47e4958507e869bf7ded&quot;&gt;Resume Deep Dive&lt;/a&gt;&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;&lt;strong&gt;🧑‍💻 Team Interview Stage&lt;/strong&gt; - we then delve into your experience in more depth and introduce you to members of the team, including cross-functional partners…&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;[30m] &lt;a href=&quot;https://www.notion.so/sourcegraph/Types-of-interviews-sample-questions-f279f080583d49ee9f2c60e30c8cb1f7?pvs=4#cb00697e95304550a146c32563c0255d&quot;&gt;Cross-functional team collaboration&lt;/a&gt;&lt;/li&gt;\n&lt;li&gt;[30m] Working Session&amp;nbsp;&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;&lt;strong&gt;🎉 Final Interview Stage &lt;/strong&gt;- we move you to our final round, where you gain a better understanding of our business and values holistically…&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;[30m]&amp;nbsp;&lt;a href=&quot;https://www.notion.so/sourcegraph/Types-of-interviews-sample-questions-f279f080583d49ee9f2c60e30c8cb1f7?pvs=4#e3a04291743048df87541a88aa8199dd&quot;&gt;Values&lt;/a&gt;&lt;/li&gt;\n&lt;li&gt;[30m] &lt;a href=&quot;https://www.notion.so/sourcegraph/Types-of-interviews-sample-questions-f279f080583d49ee9f2c60e30c8cb1f7?pvs=4#80e2ecaed5854b1ba510b2e391c0c67b&quot;&gt;Leadership&lt;/a&gt; with Head of Sales&lt;/li&gt;\n&lt;li&gt;[15m]&amp;nbsp;&lt;a href=&quot;https://www.notion.so/sourcegraph/Types-of-interviews-sample-questions-f279f080583d49ee9f2c60e30c8cb1f7?pvs=4#80e2ecaed5854b1ba510b2e391c0c67b&quot;&gt;Leadership&lt;/a&gt; with Co-founder&lt;/li&gt;\n&lt;li&gt;We check references and conduct your background check&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;Please note - you are welcome to request additional conversations with anyone you would like to meet, but didn’t get to meet during the interview process.&lt;/p&gt;&lt;div class=&quot;content-conclusion&quot;&gt;&lt;h2&gt;&lt;strong&gt;&lt;span style=&quot;color: #a112ff;&quot;&gt;Learn more about us&lt;/span&gt;&lt;/strong&gt;&lt;/h2&gt;\n&lt;p&gt;You can learn more about what it is like to work at Sourcegraph by reading &lt;a href=&quot;https://sourcegraph.notion.site/d7614e3e9dc04c09ac2d42d57f1816e6?v=2a6d426dbae14390b155120b0c029ce0&quot;&gt;our handbook&lt;/a&gt;.&lt;/p&gt;\n&lt;p&gt;We are an ambitious team who are collectively working hard to build the most influential company in the world.&amp;nbsp; You can read more about our &lt;a href=&quot;https://sourcegraph.notion.site/What-it-s-like-working-at-Sourcegraph-119a8e11265880b18911eee4d9b7c460#119a8e1126588062b935fc66104b6115&quot;&gt;culture&lt;/a&gt;, &lt;a href=&quot;https://sourcegraph.notion.site/Compensation-Pay-Transparency-at-Sourcegraph-d58d0774f51b4b489d41c3628d30ff8d?pvs=74&quot;&gt;competitive compensation&lt;/a&gt; and &lt;a href=&quot;https://sourcegraph.notion.site/Benefits-Perks-dd1da4b6b3a64780abed010a144d34ba?pvs=74&quot;&gt;benefits&lt;/a&gt; here&lt;/p&gt;\n&lt;p&gt;Sourcegraph is an equal opportunity workplace; we welcome people from all backgrounds.&amp;nbsp;&lt;/p&gt;\n&lt;p&gt;&lt;em&gt;Sourcegraph participates in &lt;/em&gt;&lt;a href=&quot;https://sourcegraph.notion.site/E-Verify-2ab3286dde3446d6bac2898c83610107&quot;&gt;&lt;em&gt;E-Verify&lt;/em&gt;&lt;/a&gt;&lt;em&gt; for U.S. Employees. &lt;/em&gt;&lt;/p&gt;&lt;/div&gt;","tags":"[\"management\",\"b2b\"]","pubDate":"2025-01-28T17:12:11.000Z","link":"https://boards.greenhouse.io/sourcegraph91/jobs/5427882004","slug":"revenue-enablement-specialist-ic1-ic2-sourcegraph-5832"},{"id":3349799829,"title":"Android Engineer","company":"Clerk","image":"https://avatars.githubusercontent.com/u/49538330?s=200&v=4","description":"<h2>About Clerk</h2><p style=\"min-height:1.5em\">Clerk is a globally-distributed team dedicated to providing a best-in-class developer experience, with obsessive attention to every detail. Today, we provide developers with React components like <a target=\"_blank\" rel=\"noopener noreferrer nofollow\" href=\"https://clerk.dev/components/sign-up\">&lt;SignUp/&gt;</a>, <a target=\"_blank\" rel=\"noopener noreferrer nofollow\" href=\"https://clerk.dev/components/sign-in\">&lt;SignIn/&gt;</a>, and <a target=\"_blank\" rel=\"noopener noreferrer nofollow\" href=\"https://clerk.dev/components/user-profile\">&lt;UserProfile/&gt;</a>. These components allow developers to drop authentication and user management into their applications. We believe that <a target=\"_blank\" rel=\"noopener noreferrer nofollow\" href=\"https://youtube.com/watch?v=enUuBY3HXh4\">a component is worth a thousand APIs</a>.</p><p style=\"min-height:1.5em\"></p><h2><strong>About the Role</strong></h2><p style=\"min-height:1.5em\">We are looking for teammates who will be passionate about building a beautifully simple authentication tool. We are an authentication vendor, so we and our customers have strict requirements about the security, reliability, and latency of our service. These requirements are unique for a young startup, and shape our culture that respects and encourages quality over speed.</p><p style=\"min-height:1.5em\"></p><h2><strong>What You'll Work On</strong></h2><ul style=\"min-height:1.5em\"><li><p style=\"min-height:1.5em\">Building the most comprehensive, intuitive and customizable Authentication UIs. We'll need to implement it in Android, and make sure it works within all development frameworks -- Android (Swift/Kotlin), React Native, Flutter, Expo.</p></li><li><p style=\"min-height:1.5em\">Defining our mobile strategy. We need someone who knows the ins and outs of the mobile ecosystem, so that we don't get caught flat-footed.</p></li><li><p style=\"min-height:1.5em\">Above all, we need our SDKs to be as simple and intuitive as possible. We will empower the next generation of developers to focus on what matters to them, and not have to worry about the ins and outs of user/device management.</p></li></ul><h2><strong>Who You Are</strong></h2><ul style=\"min-height:1.5em\"><li><p style=\"min-height:1.5em\">Have 2+ years of experience in software engineering.</p></li><li><p style=\"min-height:1.5em\">Be passionate about mobile technologies.</p></li><li><p style=\"min-height:1.5em\">Be able to write clean, secure and performant code with attention to detail.</p></li><li><p style=\"min-height:1.5em\">Know the pain of building authentication and authorization features.</p></li><li><p style=\"min-height:1.5em\">Be able to perform well in a fast-paced environment.</p></li><li><p style=\"min-height:1.5em\">Thrive in a flat hierarchy and enjoy working remotely.</p></li></ul><h2>Benefits:</h2><ul style=\"min-height:1.5em\"><li><p style=\"min-height:1.5em\">We want you to know that we value the skills and experience you bring to the table. We go out of our way to make sure that you feel fairly compensated.</p></li><li><p style=\"min-height:1.5em\">At Clerk, we believe in shared success. That's why we offer a stock option plan so that everyone can benefit from the growth and prosperity of the company.</p></li><li><p style=\"min-height:1.5em\">We care about your well-being. That's why we offer top-tier health insurance to ensure that your health needs are fully met.</p></li><li><p style=\"min-height:1.5em\">Set up your ideal home office with the gear of your choice. At Clerk, we want to ensure that you have everything you need to perform at your best.</p></li><li><p style=\"min-height:1.5em\">We believe in work-life balance and trust you to take the time you need. Although we recommend 25 days per year, our vacation policy is unlimited. This is in addition to observing national holidays specific to your country of residence.</p></li><li><p style=\"min-height:1.5em\">Join our exceptional, diverse, and globally distributed team at Clerk. We are committed to fostering an inclusive environment where everyone can contribute their best in building impactful products and tools for the modern web.</p></li></ul>","tags":"[\"management\",\"engineering\"]","pubDate":"2025-01-28T17:08:57.824Z","link":"https://jobs.ashbyhq.com/clerk/942eae34-001c-42e5-8e48-17865828b2ff","slug":"android-engineer-clerk-5114"},{"id":6483290608,"title":"Data Engineer","company":"Status","image":"https://avatars.githubusercontent.com/u/11767950?s=200&v=4","description":"&lt;div class=&quot;content-intro&quot;&gt;&lt;p style=&quot;text-align: justify;&quot;&gt;&lt;strong&gt;About Status&lt;/strong&gt;&lt;/p&gt;\n&lt;p style=&quot;text-align: justify;&quot;&gt;&lt;span style=&quot;font-weight: 400;&quot;&gt;Status is building the tools and infrastructure for the advancement of a secure, private, and open web3.&amp;nbsp;&lt;/span&gt;&lt;/p&gt;\n&lt;p style=&quot;text-align: justify;&quot;&gt;&lt;span style=&quot;font-weight: 400;&quot;&gt;With the high level goals of preserving the right to privacy, mitigating the risk of censorship, and promoting economic trade in a transparent, open manner, Status is building a community where anyone is welcome to join and contribute.&lt;/span&gt;&lt;/p&gt;\n&lt;p style=&quot;text-align: justify;&quot;&gt;&lt;span style=&quot;font-weight: 400;&quot;&gt;As an organization, Status seeks to push the web3 ecosystem forward through research, creation of developer tools, and support of the open source community.&amp;nbsp;&lt;/span&gt;&lt;/p&gt;\n&lt;p style=&quot;text-align: justify;&quot;&gt;&lt;span style=&quot;font-weight: 400;&quot;&gt;As a product, Status is an open source, Ethereum-based app that gives users the power to chat, transact, and access a revolutionary world of Apps on the decentralized web. But Status is also building foundational infrastructure for the whole Ethereum ecosystem, including the Nimbus ETH 1.0 and 2.0 clients, the Keycard hardware wallet, and the Waku messaging protocol, the p2p communication layer for Web3.&lt;/span&gt;&lt;/p&gt;\n&lt;p style=&quot;text-align: justify;&quot;&gt;&lt;span style=&quot;font-weight: 400;&quot;&gt;As a team, Status has been completely distributed since inception. Our team is currently 200+ core contributors strong, and welcomes a growing number of community members from all walks of life, scattered all around the globe.&amp;nbsp;&lt;/span&gt;&lt;/p&gt;\n&lt;p style=&quot;text-align: justify;&quot;&gt;&lt;span style=&quot;font-weight: 400;&quot;&gt;We care deeply about open source, and our organizational structure has minimal hierarchy and no fixed work hours. We believe in working with a high degree of autonomy while supporting the organization&#39;s priorities.&lt;/span&gt;&lt;/p&gt;&lt;/div&gt;&lt;p&gt;&lt;strong&gt;About the Infrastructure Team&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;We’re a team scattered across the world, supporting teams building various things, from decentralized messaging protocols, through chat wallet applications for all platforms, to core components of Ethereum network infrastructure. We work asynchronously, with a high level of independence.&lt;/p&gt;\n&lt;p&gt;&lt;br&gt;We are seeking a Data Engineer to construct and maintain dynamic dashboards for to help with managing multiple software projects, handling financial portfolios, and coordinating social campaigns. The successful candidate will collect, analyze, and interpret data to provide actionable insights, enabling us to effectively track and improve our project progress.&lt;/p&gt;\n&lt;p&gt;&amp;nbsp;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Key responsibilities&lt;/strong&gt;&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;Develop and implement data pipelines for Open Source Project development, communication campaigns, and finance overview&lt;/li&gt;\n&lt;li&gt;Build visualization tools to track and analyze project progress, communication effectiveness, and financial health&lt;/li&gt;\n&lt;li&gt;Accompany teams lead to identify key elements for KPI analysis&lt;/li&gt;\n&lt;li&gt;Manage Data Warehouse to maintain data quality&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;&lt;strong&gt;You ideally will have&amp;nbsp;&lt;/strong&gt;&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;Experience with Data Pipeline implementation (DBT, Airflow, Airbyte)&lt;/li&gt;\n&lt;li&gt;Experience with SQL optimization&lt;/li&gt;\n&lt;li&gt;Experience with Python or other scripting languages&lt;/li&gt;\n&lt;li&gt;Experience with Grafana or other visualization tools&lt;/li&gt;\n&lt;li&gt;Experience in, and passion for, blockchain technology&lt;/li&gt;\n&lt;li&gt;A strong alignment to our principles:&amp;nbsp;&lt;a href=&quot;https://status.app/manifesto&quot;&gt;https://status.app/manifesto&lt;/a&gt;&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;&amp;nbsp;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Bonus points if&amp;nbsp;&lt;/strong&gt;&lt;/p&gt;\n&lt;ul&gt;\n&lt;li&gt;Comfortable working remotely and asynchronously&lt;/li&gt;\n&lt;li&gt;Experience working for an open source organization.&amp;nbsp;&amp;nbsp;&lt;/li&gt;\n&lt;li&gt;Experience with Linux, Docker&lt;/li&gt;\n&lt;li&gt;Experience with LLM fine-tuning&lt;/li&gt;\n&lt;/ul&gt;\n&lt;p&gt;&lt;em&gt;&lt;span style=&quot;font-weight: 400;&quot;&gt;[Don’t worry if you don’t meet all of these criteria, we’d still love to hear from you anyway if you think you’d be a great fit for this role. Just explain to us why in your cover letter]&lt;/span&gt;&lt;/em&gt;&lt;/p&gt;\n&lt;p&gt;&amp;nbsp;&lt;/p&gt;\n&lt;p&gt;&lt;strong&gt;Hiring Process&amp;nbsp;&lt;/strong&gt;&lt;/p&gt;\n&lt;ol&gt;\n&lt;li style=&quot;font-weight: 400;&quot;&gt;&lt;span style=&quot;font-weight: 400;&quot;&gt;Interview with People Ops team&lt;/span&gt;&lt;/li&gt;\n&lt;li style=&quot;font-weight: 400;&quot;&gt;&lt;span style=&quot;font-weight: 400;&quot;&gt;Technical Task&lt;/span&gt;&lt;/li&gt;\n&lt;li style=&quot;font-weight: 400;&quot;&gt;&lt;span style=&quot;font-weight: 400;&quot;&gt;Interview with BI Team Lead&lt;/span&gt;&lt;/li&gt;\n&lt;li style=&quot;font-weight: 400;&quot;&gt;&lt;span style=&quot;font-weight: 400;&quot;&gt;Interview with Infra Team Lead&lt;br&gt;&lt;br&gt;&lt;/span&gt;&lt;/li&gt;\n&lt;/ol&gt;\n&lt;p&gt;&lt;strong&gt;Compensation&lt;/strong&gt;&lt;/p&gt;\n&lt;p&gt;We are happy to pay in any mix of fiat/crypto.&lt;/p&gt;","tags":"[\"finance\"]","pubDate":"2025-01-28T12:53:55.000Z","link":"https://status.app/jobs?gh_jid=6308385","slug":"data-engineer-status-7480"},{"id":6589228295,"title":"Data Scientist, Health Informatics","company":"Jukebox Health","image":"https://remotive.com/job/1966145/logo","description":"<div><!--block-->At Jukebox Health, our mission is to empower everyone to live safer, healthier, more independent lives at home. We partner with health plans to make homes safer and more accessible for older adults and high-needs populations. We achieve this by combining technology with networks of clinicians, suppliers, and installers to deliver personalized home modifications and environmental supports nationwide. Founded by experienced entrepreneurs, Jukebox Health is a fast growing healthcare services company backed by top venture capital firms and The Home Depot. </div>\n<div><!--block--></div>\n<div><!--block-->We are seeking a Data Scientist to create the analytical underpinning to help drive our mission. The ideal candidate will have a strong background in healthcare informatics. </div>\n<div><!--block--></div>\n<div><!--block--></div>\n<div><!--block--></div>\n<p><br><br></p>\n<div class=\"h3\">Key Responsibilities</div>\n<ul style=\"\">\n<li style=\"\"><!--block-->Work with clinical operations team to analyze populations for targeting and outcomes analysis</li>\n<li style=\"\"><!--block-->Work with business leaders to produce KPIs that improve organizational focus</li>\n<li style=\"\"><!--block-->Own the core data architecture at Jukebox (lookml) to support self-service analytics for business users</li>\n<li style=\"\"><!--block-->Build data export processes in alignment with partner specifications</li>\n</ul>\n<div><!--block--></div>\n<p><br><br></p>\n<div class=\"h3\">Skills, Knowledge and Expertise</div>\n<ul style=\"\">\n<li style=\"\"><!--block-->Experience with SQL, BigQuery or equivalent</li>\n<li style=\"\"><!--block-->Experience with python/jupyter notebooks</li>\n<li style=\"\"><!--block-->Experience working with healthcare data sets including claims and/or HIE data</li>\n<li style=\"\"><!--block-->Experience with Looker, developing Lookml</li>\n<li style=\"\"><!--block-->Experience building ETL jobs and data cleaning</li>\n</ul>\n<div><!--block--></div>\n<p><br><br></p>\n<div class=\"h3\">Benefits</div>\n<ul style=\"\">\n<li style=\"\"><!--block-->Opportunity to build a new category leader in healthcare services</li>\n<li style=\"\"><!--block-->Competitive compensation including salary, stock options and benefits</li>\n<li style=\"\"><!--block-->Collaborative, flexible work environment coupled with an uplifting culture</li>\n<li style=\"\"><!--block-->Fully remote position</li>\n</ul>\n<div><!--block--></div>\n<img src=\"https://remotive.com/job/track/1966145/blank.gif?source=public_api\" alt=\"\"/>","tags":"[\"python\",\"sql\",\"ETL\",\"BigQuery\"]","pubDate":"2025-01-27T23:50:59.000Z","link":"https://remotive.com/remote-jobs/software-dev/data-scientist-health-informatics-1966145","slug":"data-scientist-health-informatics-jukebox-health-2593"},{"id":4303724963,"title":"IT Operations Engineer","company":"Sumsub","image":"https://remotive.com/job/1965407/logo","description":"<p dir=\"ltr\"><strong>Sumsub</strong> is the one verification platform to secure the whole user journey. With Sumsub’s customizable KYC, KYB, transaction monitoring and fraud prevention solutions, you can orchestrate your verification process, welcome more customers worldwide, meet compliance requirements, reduce costs and protect your business.<br><br>Sumsub has over 2,500 clients across the fintech, crypto, transportation, trading and gaming industries including Bitpanda, Wirex, Avis, Bybit, Huobi, Kaizen Gaming, and TransferGo.</p>\n<p dir=\"ltr\">We are looking for a technically proficient <strong>IT Operations Engineer </strong>with a strong passion for technology and expertise in endpoint device management.</p>\n<p dir=\"ltr\"><strong>Key Responsibilities:</strong></p>\n<ul style=\"\">\n<li dir=\"ltr\" style=\"\">\n<p dir=\"ltr\">Microsoft Entra ID Management: oversee provisioning and integration with identity management solutions, ensuring robust and secure access control policies.</p>\n</li>\n<li dir=\"ltr\" style=\"\">\n<p dir=\"ltr\">Intune Device Management: spearhead device enrollment processes, enforce compliance via conditional access policies, and generate detailed compliance reports using Microsoft Intune.</p>\n</li>\n<li dir=\"ltr\" style=\"\">\n<p dir=\"ltr\">Microsoft 365 Administration: provide in-depth administration and support of Microsoft 365, focusing on user management, security enhancements, and compliance adherence.</p>\n</li>\n<li dir=\"ltr\" style=\"\">\n<p dir=\"ltr\">Microsoft Graph API Implementation: develop and maintain integrations through Microsoft Graph API to enhance connectivity and functionality across services.</p>\n</li>\n<li dir=\"ltr\" style=\"\">\n<p dir=\"ltr\">IT Automation: Create and optimize IT automation scripts using Python and PowerShell, targeting process efficiencies and reducing operational overhead.</p>\n</li>\n<li dir=\"ltr\" style=\"\">\n<p dir=\"ltr\">Company Portal Development: Lead efforts in application deployment and management through the company portal for optimal application delivery.</p>\n</li>\n</ul>\n<p dir=\"ltr\"><strong>About You:</strong></p>\n<ul style=\"\">\n<li dir=\"ltr\" style=\"\">\n<p dir=\"ltr\">In-depth expertise in Microsoft Entra ID, Intune, and Microsoft 365 configurations and deployments.</p>\n</li>\n<li dir=\"ltr\" style=\"\">\n<p dir=\"ltr\">Comprehensive understanding of Identity and Access Management protocols including SAML, OAuth, and SSO, ensuring secure and streamlined user authentication processes.</p>\n</li>\n<li dir=\"ltr\" style=\"\">\n<p dir=\"ltr\">Experience in managing integration and administrative tasks for platforms like Slack and Google Workspace.</p>\n</li>\n<li dir=\"ltr\" style=\"\">\n<p dir=\"ltr\">Advanced proficiency in Python and PowerShell scripting for robust automation solutions.</p>\n</li>\n<li dir=\"ltr\" style=\"\">\n<p dir=\"ltr\">Knowledge of RESTful APIs, XML-based HTTP APIs, JSON, and related web services for seamless integration and data exchange.</p>\n</li>\n<li dir=\"ltr\" style=\"\">\n<p dir=\"ltr\">Excellent analytical and problem-solving capabilities with meticulous attention to detail.</p>\n</li>\n</ul>\n<p dir=\"ltr\">Additional Requirements:</p>\n<ul style=\"\">\n<li dir=\"ltr\" style=\"\">\n<p dir=\"ltr\">A minimum of 3+ years of hands-on experience with Microsoft Intune implementations and management is required.</p>\n</li>\n</ul>\n<p dir=\"ltr\"> </p>\n<p dir=\"ltr\"><strong>What We Offer:</strong></p>\n<ul style=\"\">\n<li style=\"\">Competitive compensation in compliance with your professional expertise.</li>\n<li style=\"\">Working with a product that matters. Our technology helps to protect millions of users and lots of online services worldwide.</li>\n<li style=\"\">International project. Our team works from offices in Berlin, Limassol, London, and Miami, our customers are spread from Mexico and the USA to Hong Kong, South Korea, and Singapore.</li>\n<li style=\"\">Remote first company – work from anywhere in the world.</li>\n<li style=\"\">Paid vacation and sick leave.</li>\n</ul>\n<p><strong>The hiring stages: </strong>TA screening -&gt; manager interview</p>\n<p><strong>Sounds like a great opportunity for your career development? Then go ahead and apply!</strong></p>\n<p><br><em>We are a global community of innovators, creators, and thinkers, and we believe that diversity fuels our innovation. Sumsub is proud to be an equal opportunity employer, committed to building a diverse and inclusive workforce. We welcome applications from people of all backgrounds, cultures, genders, experiences, abilities and perspectives. Join us in shaping the future inclusively.</em></p>\n<img src=\"https://remotive.com/job/track/1965407/blank.gif?source=public_api\" alt=\"\"/>","tags":"[\"python\",\"Microsoft 365\"]","pubDate":"2025-01-27T19:50:53.000Z","link":"https://remotive.com/remote-jobs/devops/it-operations-engineer-1965407","slug":"it-operations-engineer-sumsub-5788"},{"id":4752074272,"title":"Gradle Project Lead","company":"Gradle","image":"https://remotive.com/job/1964945/logo","description":"<p>Gradle is the build tool of choice for millions of developers around the globe and is the official build tool for Android applications. Developing Gradle is a dynamic and demanding engineering challenge, with the reward of significant industry impact and collaboration with some of the world's best software teams.</p>\n<p>Our software is used by some of the world's leading software organizations, such as Netflix, Airbnb, Spotify, Twitter, and Atlassian. We regularly collaborate with these and other users to make our products continuously better.</p>\n<div class=\"h2\">Profile</div>\n<p>We are looking for a Project Lead for Gradle Build Tool to help drive the evolution of the product to the next level and fully realize our vision, including developer-first software definition (see <a href=\"%22https://blog.gradle.org/declarative-gradle%22\" rel=\"nofollow\">https://blog.gradle.org/declarative-gradle</a>) and, in the future, broader polyglot support. </p>\n<p>We are looking for someone deeply passionate about making other software engineers more productive who preferably has experience in a similar role in a major developer tooling product. The role is hands-on and requires a combination of technical depth, strategic thinking, and a product mindset.  </p>\n<div class=\"h2\"><strong>Key responsibilities </strong></div>\n<ul style=\"\">\n<li style=\"\">The overarching primary responsibility is to help Gradle Build Tool advance its mission and achieve greater adoption and user satisfaction. </li>\n<li style=\"\">This involves:</li>\n<ul style=\"\">\n<li style=\"\">Guiding the technical and architectural direction of the project as a part of Gradle Build Tool leadership.</li>\n<li style=\"\">Being instrumental in defining, driving, and communicating the Gradle Build Tool product vision.</li>\n<li style=\"\">Facilitating and fostering collaboration and effectiveness between sub-teams in service of the overall product vision. </li>\n<li style=\"\">Representing the project internally with key stakeholders and externally with strategic partners. </li>\n<li style=\"\">Fostering relationships with key influencers in the user community.</li>\n<li style=\"\">Collaborating with critical outreach efforts to clearly and effectively advocate for Gradle Build Tool.</li>\n</ul>\n</ul>\n<div class=\"h3\"><strong>Gradle Build Tool leadership</strong></div>\n<ul style=\"\">\n<li style=\"\">Be instrumental in Gradle Build Tool leadership, which currently consists of the VP of Engineering and platform/team leads. </li>\n<li style=\"\">Help to build consensus and alignment in the Gradle Build Tool leadership team through productive collaboration, leveraging existing deep expertise, and integrating different perspectives.</li>\n</ul>\n<div class=\"h3\"><strong>Part of company leadership and broader impact on the business </strong></div>\n<ul style=\"\">\n<li style=\"\">Partner with key company stakeholders at a strategic level on Gradle Build Tool-related topics, especially with Develocity Engineering and Product, Marketing, and Developer Advocacy.</li>\n<li style=\"\">Collaborating with the Develocity project to identify and deliver value-increasing strategic initiatives in the service of both projects.</li>\n<li style=\"\">Influence Gradle Build Tool roadmap in a way that helps both the user community and the business. </li>\n</ul>\n<div class=\"h3\"><strong>Representing the team externally</strong></div>\n<ul style=\"\">\n<li style=\"\">Represent the Gradle Build Tool team at a strategic level with key external partners such as Google, JetBrains, Spring, GitHub, and Microsoft.</li>\n<li style=\"\">Help to develop and maintain productive relationships in collaboration with the VP of Engineering and the rest of the team.</li>\n</ul>\n<div class=\"h3\"><strong>Advocacy</strong></div>\n<ul style=\"\">\n<li style=\"\">Shaping a more compelling narrative about our vision and deliverables, including mentoring the broader team on storytelling and directly contributing to strategic content.</li>\n</ul>\n<div class=\"h3\"><strong>Hands-on coding </strong></div>\n<ul style=\"\">\n<li style=\"\">The role's primary focus is not to create software individually, but a degree of hands-on coding work is expected. Particularly, working with the codebase will be required to review critical engineering work and explore potential technical directions. </li>\n</ul>\n<div class=\"h2\"><strong>Benefits &amp; Perks</strong></div>\n<ul style=\"\">\n<li style=\"\">A focus on learning and development – Gradle offers an annual learning and development stipend and a monthly company-wide Learning Day, where we encourage all team members to focus on their professional development for the day</li>\n<li style=\"\">A hardware package that includes a laptop, monitor, other peripheral hardware, and a home office stipend to make sure you are fully set up to work remotely</li>\n<li style=\"\">Generous paid time off</li>\n<li style=\"\">Paid public holidays</li>\n<li style=\"\">Volunteer Day – We offer up to 8 hours of paid work time each year for team members to give back to their local communities</li>\n</ul>\n<div class=\"h2\"><strong>Location</strong></div>\n<ul style=\"\">\n<li style=\"\"><span style='\"font-weight:'>Anywhere in the world with working conditions that allow for seamless collaboration with your colleagues through email, chat, and video streaming</span></li>\n<li style=\"\">While our team works remotely and is spread across the globe, we deeply value daily interactions and collaboration.</li>\n</ul>\n<div class=\"h2\"><strong>How to apply</strong></div>\n<p><span style='\"font-weight:'>The following is required with your application:</span></p>\n<ul style=\"\">\n<li style=\"\">Submit your cover letter, answers to our application questions and resume via the form below</li>\n<li style=\"\">The recruitment team will be in touch after you have applied</li>\n</ul>\n<div class=\"h2\"><strong>About us</strong></div>\n<p>We are committed and skilled software engineers, product designers, and marketing experts who are passionate about developer productivity. We take pride in delivering products that are relied upon daily by some of the world's leading software organizations, such as Netflix, LinkedIn, Airbnb, SAP, and X (formerly Twitter).</p>\n<p>Our team is globally distributed but deeply connected. We value our interpersonal relationships as much as we value our achievements. We are a diverse and inclusive workplace where we learn from each other and together. We welcome people of different backgrounds, experiences, abilities, and perspectives.</p>\n<p>Visit our<a href=\"%22https://gradle.com/careers%22\" rel=\"nofollow\"> careers page</a> to learn more about the company and see other open positions. Visit <a href=\"%22https://glassdoor.com/Overview/Working-at-Gradle-Inc-EI_IE3007587.11,21.htm%22\" rel=\"nofollow\">Glassdoor</a> to read what current and former Gradle employees have to say about the company.</p>\n<div class=\"h2\"><strong>Privacy Notice</strong></div>\n<p>For information about our collection, use, and disclosure of applicants’ personal information as well as applicants’ rights over their personal information, please see our<a href=\"%22https://gradle.com/legal/ccpa-and-gdpr-job-applicant-privacy-notice/%22\" rel=\"nofollow\"> Job Applicant Privacy Notice.</a></p>\n<p> </p><img src=\"https://remotive.com/job/track/1964945/blank.gif?source=public_api\" alt=\"\"/>","tags":"[\"android\",\"video\",\"spring\",\"mentoring\",\"hardware\",\"chat\",\"github\",\"SAP\",\"gradle\",\"REST\",\"CCPA\"]","pubDate":"2025-01-27T11:50:10.000Z","link":"https://remotive.com/remote-jobs/project-management/gradle-project-lead-1964945","slug":"gradle-project-lead-gradle-4274"},{"id":4832905146,"title":"Marketing Specialist","company":"Connectly","image":"https://avatars.githubusercontent.com/u/79153089?s=200&v=4","description":"<div><b style=\"font-size: 11pt\">Are You Ready to Revolutionize Communication and Commerce with <a href=\"http://Connectly.ai\">Connectly.ai</a>?</b></div><div><span style=\"font-size: 11pt\">At <a href=\"http://Connectly.ai\">Connectly.ai</a>, we’re transforming how businesses connect with their customers. Our mission is to enable seamless, intelligent conversations through AI-powered messaging. This is a bold, expansive vision that requires a team as dynamic, driven, and inventive as the technology we’re creating.</span></div><div><span style=\"font-size: 11pt\">To bring this vision to life, we’re looking for candidates who are passionate about redefining customer engagement and have a deep belief in the power of AI and WhatsApp to create genuine, impactful interactions. We seek individuals who are eager to tackle tough challenges, value continuous growth, and thrive in a collaborative, high-energy environment. We want teammates who are driven to make a lasting difference, undaunted by complex problems, and motivated to shape the future of conversational commerce.</span></div><div><br></div><div><b style=\"font-size: 11pt\">What It Takes to Thrive at <a href=\"http://Connectly.ai\">Connectly.ai</a></b></div><div><span style=\"font-size: 11pt\">Our culture is ambitious and fast-paced, designed for those who want to work with top-tier professionals and are committed to excellence. If you’re ready to grow beyond what you thought possible, are excited about joining a mission-driven team, and are open to continuous learning, <a href=\"http://Connectly.ai\">Connectly.ai</a> might be the place for you.</span></div><div><br></div><div><b style=\"font-size: 11pt\"><a href=\"http://Connectly.ai\">Connectly.ai</a>’s Vision:&nbsp;</b><span style=\"font-size: 11pt\">We’re here to build an inclusive, AI-enabled communication platform that empowers businesses to engage their customers in meaningful ways. We’re pushing the boundaries of what conversational AI can accomplish for companies worldwide, driving innovation, accessibility, and ease of use in every interaction.</span></div><div><span style=\"font-size: 11pt\">If you’re ready to help shape this future with us, we can’t wait to meet you.</span></div><div><br></div><div>About the team: CEO&nbsp;<a href=\"https://www.linkedin.com/in/sloukakos/\">Stefanos&nbsp;</a>was the global Head of Messenger at Facebook. CTO&nbsp;<a href=\"https://www.linkedin.com/in/yandongliu/\">Yandong&nbsp;</a>was CTO of Strava. Other&nbsp;<a href=\"https://www.linkedin.com/search/results/people/?keywords=connectly.ai\">founding members</a>&nbsp;have experience working for McKinsey, Google, Facebook, Uber and other startups.</div><h3>Responsibilities</h3><li>Design and implement lead prospecting strategies and roadmaps which align with the company’s sales and marketing objectives</li><li>Research and identify potential leads through various channels</li><li>Qualify leads based on established criteria to determine their potential as customers.</li><li>Plan, execute, and optimize end-to-end lead generation campaigns using channels such as email marketing, social media, content marketing, SEO, PPC, etc.</li><li>Develop A/B testing strategies to identify and implement high-performing reach-out approaches.</li><li>Work closely with sales teams to ensure seamless handoff of qualified leads, track lead outcomes, and adjust strategies based on feedback.</li><li>Analyze lead generation metrics to evaluate campaign effectiveness and refine strategies for improved outcomes.</li><h3>Requirements</h3><li>5+ years of work experience in marketing with a strong focus on B2B lead generation and SaaS marketing</li><li>Bachelor’s degree in marketing, business administration, communication, or related field (preferred)</li><li>Proficiency in CRM and marketing automation tools</li><li>Strong organizational, data analysis and time management skills</li><li>Excellent written and verbal communication</li><li>Self-motivated, proactive individual</li><li>Advanced English proficiency (at least C1 English level)</li><h3>Benefits</h3><li>Competitive pay and bonus</li><li>Remote role: travel and work from wherever you want</li><li>Flexible work schedule to enable a smoother work-life balance</li><li>Unlimited time off</li><li>Learning and growth opportunities within the company</li><li>Work in an agile, fast-paced tech-driven environment that is transforming conversational commerce through AI</li><li>Be part of a supportive and dynamic team where collaboration and creativity are celebrated</li><div>Connectly&nbsp;is an equal opportunity employer. We’re committed to building a diverse, inclusive, and supportive workplace that is distributed around the world.</div><div><br></div><div>We're a remote-first company with clients and team members across the world. We allow you to work from anywhere in the world anytime you prefer, as long as you are able to stay on top of deliverables and are able to overlap with the scheduled team meetings and close collaboration hours. (location-specific legal requirements permitting). At the same time we are also experimenting with hybrid work models, so please don't let that discourage you from applying!</div><div><br></div><div>We're looking to cultivate a highly creative, motivating, and collaborative environment as we aim to move fast and build quickly. Talk to us if you are interested!</div><div><b style=\"font-size: 11pt\">Are You Ready to Revolutionize Communication and Commerce with <a href=\"http://Connectly.ai\">Connectly.ai</a>?</b></div><div><span style=\"font-size: 11pt\">At <a href=\"http://Connectly.ai\">Connectly.ai</a>, we’re transforming how businesses connect with their customers. Our mission is to enable seamless, intelligent conversations through AI-powered messaging. This is a bold, expansive vision that requires a team as dynamic, driven, and inventive as the technology we’re creating.</span></div><div><span style=\"font-size: 11pt\">To bring this vision to life, we’re looking for candidates who are passionate about redefining customer engagement and have a deep belief in the power of AI and WhatsApp to create genuine, impactful interactions. We seek individuals who are eager to tackle tough challenges, value continuous growth, and thrive in a collaborative, high-energy environment. We want teammates who are driven to make a lasting difference, undaunted by complex problems, and motivated to shape the future of conversational commerce.</span></div><div><br></div><div><b style=\"font-size: 11pt\">What It Takes to Thrive at <a href=\"http://Connectly.ai\">Connectly.ai</a></b></div><div><span style=\"font-size: 11pt\">Our culture is ambitious and fast-paced, designed for those who want to work with top-tier professionals and are committed to excellence. If you’re ready to grow beyond what you thought possible, are excited about joining a mission-driven team, and are open to continuous learning, <a href=\"http://Connectly.ai\">Connectly.ai</a> might be the place for you.</span></div><div><br></div><div><b style=\"font-size: 11pt\"><a href=\"http://Connectly.ai\">Connectly.ai</a>’s Vision:&nbsp;</b><span style=\"font-size: 11pt\">We’re here to build an inclusive, AI-enabled communication platform that empowers businesses to engage their customers in meaningful ways. We’re pushing the boundaries of what conversational AI can accomplish for companies worldwide, driving innovation, accessibility, and ease of use in every interaction.</span></div><div><span style=\"font-size: 11pt\">If you’re ready to help shape this future with us, we can’t wait to meet you.</span></div><div><br></div><div>About the team: CEO&nbsp;<a href=\"https://www.linkedin.com/in/sloukakos/\">Stefanos&nbsp;</a>was the global Head of Messenger at Facebook. CTO&nbsp;<a href=\"https://www.linkedin.com/in/yandongliu/\">Yandong&nbsp;</a>was CTO of Strava. Other&nbsp;<a href=\"https://www.linkedin.com/search/results/people/?keywords=connectly.ai\">founding members</a>&nbsp;have experience working for McKinsey, Google, Facebook, Uber and other startups.</div>","tags":"[\"management\",\"b2b\",\"legal\"]","pubDate":"2025-01-27T10:47:19.813Z","link":"https://jobs.lever.co/connectly/46b6284f-4169-4f6a-96a4-d429d22984f9","slug":"marketing-specialist-connectly-2507"}]