[{"id":2767278783,"title":"Director of Marketing at Mechanical Orchard","company":"Mechanical Orchard","image":"https://pbs.twimg.com/profile_images/1592609773958025216/CaG1yAqK_400x400.png","description":"<div class=\"section page-centered\" data-qa=\"job-description\"><div><span style=\"font-size: 11pt\">Mechanical Orchard is a fast-growing startup that takes a fresh view on old problems. We replace legacy computing systems for the Global 2000, with a focus on mitigating risk and creating a genuinely solid foundation for innovating and adapting.&nbsp;</span></div><div><br></div><div><span style=\"font-size: 11pt\">Our background in software development and the impact on the industry is well known, and we've literally helped write the book on XP and other impactful agile practices. We’re applying the same thoughtfulness and rigor in weaving AI into everything we do. We believe in the durable principles behind agile, and embrace the power of cross-functional teams, collective ownership, test driven development, short feedback loops, and continuous improvement.</span></div><div><br></div><div><span style=\"font-size: 11pt\">We are Generous, Ethical, Effective, and Kind.</span></div><div><br></div><div><span style=\"font-size: 11pt\">As the Director of Marketing at Mechanical Orchard, you’ll be one of the first marketers on the team, reporting directly to the CMO. This strategic role requires a blend of creativity, analytical prowess, and an enthusiasm for constantly finding better ways to achieve goals.</span></div><div><br></div><div><span style=\"font-size: 11pt\">You’ll be expected to: Develop and execute a comprehensive marketing strategy focused on demand generation to drive revenue and brand </span><a href=\"http://awareness.Use\" style=\"font-size: 11pt\">awareness. Use</a><span style=\"font-size: 11pt\"> insights from market research to tailor messaging that speaks directly to the challenges and needs of our prospects, both for brand efforts and deal </span><a href=\"http://pursuits.Stay\" style=\"font-size: 11pt\">pursuits. Stay</a><span style=\"font-size: 11pt\"> abreast of best practices in the industry, and track what our competitors are </span><a href=\"http://doing.Build\" style=\"font-size: 11pt\">doing. Build</a><span style=\"font-size: 11pt\"> and manage a vibrant community of technology leaders on LinkedIn, online, and in person, fostering engagement and positioning our brand as a thought </span><a href=\"http://leader.Craft\" style=\"font-size: 11pt\">leader. Craft</a><span style=\"font-size: 11pt\"> and/or commission and disseminate thought leadership content that resonates with our target audience, addressing the specific care abouts of CIOs and VPs of Infrastructure in enterprises with extensive legacy </span><span style=\"font-size: 14.6667px\"><u>systems. Collaborate</u></span><span style=\"font-size: 11pt\"> with the Sales and Engineering teams to ensure a cohesive brand message and the success of marketing </span><a href=\"http://initiatives.Analyze\" style=\"font-size: 11pt\">initiatives. Analyze</a><span style=\"font-size: 11pt\"> campaign performance across HubSpot and Google Analytics and adapt strategies to meet business objectives, especially across digital and physical </span><a href=\"http://touchpoints.Lead\" style=\"font-size: 11pt\">touchpoints. Lead</a><span style=\"font-size: 11pt\">, mentor, and help expand the marketing team to support the company's growth and strategic objectives.</span></div><div><br></div><div><span style=\"font-size: 11pt\">The ideal candidate is a utility player, able to perform across multiple facets of marketing. This person has worked as a product and/or solutions marketer in a professional, team-based environment, with experience with AI and generative AI trends and solutions.</span></div><div><br></div><div><span style=\"font-size: 11pt\">Strong communication and writing skills are required. Collaboration skills as well as empathy are essential for working closely with the development team, customers, and others at Mechanical Orchard.</span></div><div><span style=\"font-size: 11pt\">While this is a fully remote position, occasional travel may be required for customer visits and team gatherings.&nbsp;</span></div><div><br></div></div><!--[2022-11-28] [GOLD-2535] Remove payTransparencyV1 when feature flag is fully removed--><div class=\"section page-centered\" data-qa=\"closing-description\"><div><span style=\"font-size: 11pt\">Mechanical Orchard, Inc. is an Equal Opportunity Employer and Prohibits Discrimination and Harassment of Any Kind. Mechanical Orchard, Inc. is committed to the principle of equal employment opportunity for all employees and to providing employees with a work environment free of discrimination and harassment. All employment decisions at Mechanical Orchard, Inc. are based on business needs, job requirements and individual qualifications, without regard to race, color, religion or belief, national, social or ethnic origin, sex (including pregnancy), age, physical, mental or sensory disability, HIV Status, sexual orientation, gender identity and/or expression, marital, civil union or domestic partnership status, past or present military service, family medical history or genetic information, family or parental status, or any other status protected by the laws or regulations in the locations where we operate. Mechanical Orchard, Inc. will not tolerate discrimination or harassment based on any of these characteristics. Mechanical Orchard, Inc. encourages applicants of all ages. Mechanical Orchard, Inc. will provide reasonable accommodation to employees who have protected disabilities consistent with local law.</span></div><div><br></div><div>We look forward to reviewing your application. Thanks!</div></div><div class=\"section page-centered last-section-apply\" data-qa=\"btn-apply-bottom\"><a class=\"postings-btn template-btn-submit hex-color\" data-qa=\"show-page-apply\" href=\"https://jobs.lever.co/mechanicalorchard/6004dee7-7bf5-4492-9e09-54e7a49b0170/apply\">Apply for this job</a></div>","tags":"[\"engineering\",\"aws\"]","pubDate":"2023-11-09 07:15:33.931","link":"https://jobs.lever.co/mechanicalorchard/6004dee7-7bf5-4492-9e09-54e7a49b0170","savedDate":"2023-11-09 07:15:33.931","slug":"director-of-marketing-at-mechanical-orchard-mechanical-orchard-3002"},{"id":8960157385,"title":"Director, Finance Transformation","company":"Kraken","image":"https://pbs.twimg.com/profile_images/1306325743580848130/mk0qvsZ9_400x400.jpg","description":"<div class=\"section page-centered\" data-qa=\"job-description\"><div><b style=\"font-size: 18pt\">Building the Future of Crypto&nbsp;</b></div><div><br></div><div>Our Krakenites are a world-class team with crypto conviction, united by our desire to discover and unlock the potential of crypto and blockchain technology.</div><div><br></div><div>What makes us different? Kraken is a mission-focused company rooted in crypto values. As a Krakenite, you’ll join us on our mission to accelerate the global adoption of crypto, so that everyone can achieve financial freedom and inclusion. For over a decade, Kraken’s focus on our mission and crypto ethos has attracted many of the most talented crypto experts in the world.</div><div><br></div><div>Before you apply, please read the&nbsp;<a href=\"https://www.kraken.com/culture\" class=\"postings-link\">Kraken Culture</a>&nbsp;page to learn more about our internal culture, values, and mission.</div><div><br></div><div>As a fully remote company, we have Krakenites in 60+ countries who speak over 50 languages. Krakenites are industry pioneers who develop premium crypto products for experienced traders, institutions, and newcomers to the space. Kraken is committed to <a href=\"https://blog.kraken.com/crypto-education/security-at-kraken\" class=\"postings-link\">industry-leading security</a>, <a href=\"https://blog.kraken.com/category/crypto-education\" class=\"postings-link\">crypto education</a>, and <a href=\"https://blog.kraken.com/crypto-education/support-at-kraken\" class=\"postings-link\">world-class client support</a> through our products like&nbsp;<a href=\"https://pro.kraken.com/\" class=\"postings-link\">Kraken Pro</a>,&nbsp;<a href=\"https://www.kraken.com/en-us/nft\" class=\"postings-link\">Kraken NFT</a>, and&nbsp;<a href=\"https://futures.kraken.com/wallets\" class=\"postings-link\">Kraken Futures</a>.</div><div><br></div><div>Become a Krakenite and build the future of crypto!</div><div><br></div><div><b>About the Team: </b></div><div><br></div><div>At Kraken, our finance team consists of a group of specialists who are entrusted with the critical responsibility of safeguarding and enhancing the firm's value. We excel at managing liquidity, capital, and risk while providing robust financial controls and reporting functions to support executive decision-making. Our collective efforts directly contribute to Kraken's ongoing success.</div><div><br></div><div>The finance transformation team plays a pivotal role in aligning with the finance organization's mission and objectives. We are dedicated to developing innovative and agile financial processes, promoting greater flexibility, resilience, and operational effectiveness. Our focus is on crafting transformation strategies that encompass end-to-end processes, resulting in the implementation of next-generation systems and analytical solutions to optimize finance operations.</div><div><br></div><div>Collaboration lies at the core of our team's approach. We work closely with various departments within Kraken, including corporate development, business operations, product, engineering, HR, business systems, and all internal finance functions (accounting, tax, treasury, and FP&amp;A). By fostering a holistic vision and collaborative program development, we strive to execute impactful transformational initiatives and seamlessly integrate new products and processes.</div><div><br></div><div><b>The Opportunity: </b></div><div><br></div><div>We are seeking an experienced candidate to join our finance transformation team, someone with a proven track record of leadership in transformational projects. The ideal candidate is a thought leader in finance operational processes and systems, consistently delivering performance improvements. This role demands adaptability to thrive in a fast-paced, collaborative, and process-driven environment while effectively engaging with stakeholders across the organization.</div></div><div class=\"section page-centered\"><div><h3>What You'll Do: </h3><ul class=\"posting-requirements plain-list\"><ul><li>Develop a comprehensive understanding of finance operations, identifying operational process maturity gaps, and devising effective solution strategies.</li><li>Foster cross-functional collaborations to develop comprehensive solution development and project initiatives.</li><li>Act as a thought leader for finance operational processes and systems strategies.</li><li>Own the transformation program roadmap, driving its successful implementation and operational stability.</li><li>Evangelize and influence operational teams to embrace and succeed in adopting new processes.</li><li>Facilitate seamless communication across program projects, proactively identifying and addressing risks and opportunities for improvement.</li><li>Lead the team in developing business requirements, process maps, and future state processes and controls.</li><li>Define data-driven frameworks and processes to measure and manage implementations, focusing on business value.</li><li>Develop effective approaches for crafting solutions and managing change in novel domains.</li></ul></ul></div></div><div class=\"section page-centered\"><div><h3>Skills You Should HODL: </h3><ul class=\"posting-requirements plain-list\"><ul><li>12+ years of progressive experience in fintech or financial services, with a significant focus on financial transformation strategy, finance process improvements, and strategic decision-making.</li><li>Demonstrated leadership experience at a senior level, with a proven track record of leading successful finance transformation initiatives and driving cross-functional collaboration.</li><li>In-depth expertise and understanding of finance operations and technologies, with a strategic vision for leveraging emerging tools and systems to drive operational excellence.</li><li>Proficiency in leveraging databases and conducting complex data analysis using SQL queries and other relevant tools.</li><li>Extensive experience in project management, overseeing large-scale, complex cross-functional programs with a keen focus on delivering outcomes within scope, budget, and timelines.</li><li>Strong familiarity with company financial reporting, audits, and compliance frameworks, including SOX, and ability to implement robust controls and risk management practices.</li><li>Exceptional strategic thinking and problem-solving skills, coupled with a strong ability to translate strategic vision into actionable plans and initiatives.</li><li>Outstanding interpersonal and communication skills, with the ability to influence and collaborate effectively with stakeholders at all levels of the organization.</li><li>Proven leadership and team management capabilities, fostering a culture of high performance, professional development, and innovation.</li><li>Demonstrated ability to balance macro-to-micro perspectives, with a strategic mindset and meticulous attention to detail in decision-making and execution.</li><li>Highly adaptable and able to thrive in a dynamic, fast-paced environment, with a strong passion for learning and keeping abreast of industry trends and innovations.</li><li>Previous experience and knowledge of cryptocurrency and blockchain technology preferred, with a genuine interest and enthusiasm for the evolving cryptocurrency landscape.</li></ul></ul></div></div><!--[2022-11-28] [GOLD-2535] Remove payTransparencyV1 when feature flag is fully removed--><div class=\"section page-centered\" data-qa=\"salary-range\"><div>$155,000 - $234,000 a year</div><small><div>This is the target annual salary range for this role. This range is not inclusive of other additional compensation elements, such as our Bonus program, Equity program, Wellness allowance, and other benefits [US Only] (including medical, dental, vision and 401(k)).</div><div><br></div><div>The compensation range provided is influenced by various factors and represents the initial target range. Our salary offerings are dynamic and we strive to ensure that our base salary and total compensation package aligns and recognizes the top talent we aim to attract and retain. The compensation package of the successful candidate is based on various factors such as their skillset, experience, and job scope.</div></small></div><div class=\"section page-centered\" data-qa=\"closing-description\"><div>Location Tagging #US</div><div><br></div><div>Kraken is powered by people from around the world and we celebrate all Krakenites for their diverse talents, backgrounds, contributions and unique perspectives. We hire strictly based on merit, meaning we seek out the candidates with the right abilities, knowledge, and skills considered the most suitable for the job. We encourage you to apply for roles where you don't fully meet the listed requirements, especially if you're passionate or knowledgable about crypto!</div><div><br></div><div>As an equal opportunity employer, we don’t tolerate discrimination or harassment of any kind. Whether that’s based on race, ethnicity, age, gender identity, citizenship, religion, sexual orientation, disability, pregnancy, veteran status or any other protected characteristic as outlined by federal, state or local laws.&nbsp;</div><div><br></div><div><b style=\"font-size: 18px\">Stay in the know</b></div><div><br></div><div><a href=\"https://twitter.com/krakenfx\" class=\"postings-link\">Follow us on Twitter</a></div><div><a href=\"https://blog.kraken.com/#:~:text=Enter%20your%20email%20address\" class=\"postings-link\">Learn on the Kraken Blog</a></div><div><a href=\"https://www.linkedin.com/company/kraken-exchange/\" class=\"postings-link\">Connect on LinkedIn</a></div></div><div class=\"section page-centered last-section-apply\" data-qa=\"btn-apply-bottom\"><a class=\"postings-btn template-btn-submit hex-color\" data-qa=\"show-page-apply\" href=\"https://jobs.lever.co/kraken/5eb75b08-0922-4c17-9d99-bb2d394959e5/apply\">Apply for this job</a></div>","tags":"[\"Finance\",\"management\",\"engineering\",\"database\",\"aws\"]","pubDate":"2023-11-09 07:15:33.930","link":"https://jobs.lever.co/kraken/5eb75b08-0922-4c17-9d99-bb2d394959e5","savedDate":"2023-11-09 07:15:33.930","slug":"director-finance-transformation-kraken-4304"},{"id":4078882587,"title":"Senior Customer Success Manager","company":"Getro","image":"https://pbs.twimg.com/profile_images/1346314882648444928/c0g2OpD7_400x400.jpg","description":"\n    \n\n    <p>Getro is looking for a Senior Customer Success Manager to be an owner of day to day relationships with our customers and help our customers achieve their desired outcomes with our products. Additionally this role will be an owner of key CS projects such as helping build a customer community, hosting webinars, and optimizing CS tooling. This role will report to our Head of Customer Success and Experience.</p>\n<h2>What’s Getro:&nbsp;</h2>\n<p>Getro is on a mission to become the platform of choice for making professional introductions by combining technology and human empathy.</p>\n<p>We have two products:</p>\n<ul>\n<li>GetroJobs, which automatically aggregates jobs across a network of companies;</li>\n<li>GetroConnect, which allows talent (active and passive job seekers) and companies to connect with one another, facilitating introductions and referrals within networks.&nbsp;</li>\n</ul>\n<p>If you’ve ever hired or been hired through a referral, you’ve seen how powerful the right introduction can be. That’s the power of Getro.&nbsp;&nbsp;</p>\n<h2>You, as an expert:&nbsp;</h2>\n<ul>\n<li>Have 5+ years of direct experience in customer success in a remote environment. We’re specifically looking for:</li>\n<ul>\n<li>Prior experience owning a book of business at an early stage B2B SaaS company and / or</li>\n<li>Experience working with Venture Capital firms</li>\n</ul>\n<li>Have effective project management skills with a proven record of working successfully on multiple projects simultaneously.&nbsp; We need someone who can balance customer needs in tandem with their whole workload and know when to ask for help.</li>\n<li>Are an excellent communicator (verbal and written) - communicating clearly to customers is key to success in this role and as a remote team, most of our internal communication is written.</li>\n<li>Have experience managing contract renewals including pricing negotiations and forecasting churn risk based on client engagement and overall account health.</li>\n<li>Are confident delivering information to customers and advocating for them internally while also being an excellent listener that can hear a customer issue and understand the root of their problem. You show good judgment navigating these situations.&nbsp;</li>\n<li>Have sharp interviewing and information gathering skills with experience creating and delivering presentations to customers and cross-functional, internal stakeholders.</li>\n<li>Have experience working closely with product teams to represent the voice of the customer and facilitate discovery work .</li>\n<li>Understand and have used our tech stack or similar products: Freshdesk, Vitally, Chargebee, Hubspot, Google Analytics, Jira</li>\n</ul>\n<h2>You, as a person:&nbsp;</h2>\n<ul>\n<li>Are proactive and performance-driven. You make things happen.</li>\n<li>Are extremely resourceful and comfortable with ambiguity.</li>\n<li>Thrive in an environment focused on building and articulating successful client outcomes while driving company revenue</li>\n<li>Practice committed ownership:</li>\n<ul>\n<li>You own your projects from beginning to end</li>\n<li>You ask for buy-in to make better decisions, but aren’t paralyzed without it</li>\n<li>When things go wrong, you accept accountability for your part without blaming others</li>\n<li>You share learnings openly</li>\n</ul>\n<li>Are a team player with a high level of integrity and desire to assist your team and customers.</li>\n<li>Are a proactive communicator.</li>\n<li>Live between the PST and EST time zones.</li>\n</ul>\n<h2>A Week in the Life of A Senior Customer Success Manager:</h2>\n<ul>\n<li>Diagnosing trends in product adoption for your assigned customers and building a one:many motion to help drive customer awareness and usage of a particular feature</li>\n<li>Actively managing and setting priorities across the book of business you own.&nbsp;</li>\n<li>Running set up and renewal projects across the customers you own.</li>\n<li>Navigating a tough conversation where a customer wants to churn. Maybe you’re successful, maybe you’re not, but you openly share your learnings with the team afterwards.&nbsp;</li>\n<li>Helping a customer who is struggling with our <a href=\"https://www.notion.so/getro/Getro-Setup-Portal-89ea65dac3904ea89d9aa43f296b323a\">Self Serve Setup Portal</a> on a video call to problem solve..</li>\n<li>Collaborating with the sales team to identify areas of improvement in the handoff between sales and CSX.&nbsp;</li>\n<li>Writing a piece of content for our customer newsletter.</li>\n<li>Running metrics and developing strategies on how you can improve engagement and satisfaction for the book of business you own.</li>\n<li>Identifying upsell opportunities across your book of business.&nbsp;</li>\n<li>Participating e in our Growth Scrum - collaborating on the hottest issues impacting the wider team.&nbsp;</li>\n<li>Collecting and categorizing customer feedback to relay with product and growth teams.</li>\n<li>Troubleshooting bugs and helping draft clear examples and explanations for engineers and our data operations team.</li>\n</ul>\n<h2>Perks:</h2>\n<ul>\n<li>100% <a href=\"https://www.getro.com/blog/5-benefits-of-remote-working/\">remote</a>, 100% flexible: We trust each member of our team to work when they wish, and from a location they choose (between the PST and CET time zones). We believe in working smarter, not harder - we don't value presenteeism.&nbsp;</li>\n<li>Salary: $85,500 - 107,250&nbsp;</li>\n<ul>\n<li>Why the range? We decide salaries based on the <a href=\"https://www.getro.com/blog/the-future-of-remote-working-and-cost-of-living-adjustments-cola/\">cost of living</a> where you're based&nbsp;</li>\n</ul>\n<li>$200 / month cash coworking stipend&nbsp;</li>\n<li>Generous Employee Stock Options with an attractive strike price</li>\n<li><a href=\"https://www.getro.com/about-us/\">Unique culture</a>: we’re humans first and believe that work is more fulfilling when we can show our full selves to the people we work with.</li>\n<li>Work alongside a diverse, fully distributed team of 21 core members from 7+ countries</li>\n<li>Make an impact: help shape the path of an early-stage team</li>\n</ul>\n<h2>About Getro:&nbsp;</h2>\n<h3>Our customers:&nbsp;</h3>\n<p>We help 750+ independent professional networks — including venture capital funds (<a href=\"https://jobs.lererhippeau.com/jobs\">Lerer Hippeau</a>), accelerators (<a href=\"https://jobs.techstars.com/jobs\">Techstars</a>), membership communities (<a href=\"https://jobs.thechicgeek.ca/jobs\">Chic Geek</a>), economic development organizations&nbsp; (<a href=\"https://jobs.launchtn.org/jobs\">Launch Tennessee</a>), universities (<a href=\"https://jobs.entrepreneurs.utoronto.ca/jobs\">University of Toronto</a>), and more — make better introductions for their member and measure the outcomes of their intros.</p>\n<h3>Our team:&nbsp;</h3>\n<ul>\n<li>Techstars 2017 graduates</li>\n<li>Our co-founders have been working together in the recruiting space for the last 10 years and are multi-time founders</li>\n<li>Remote-first company, from 2018 (before covid)&nbsp;</li>\n<li>21 team members across 7+ countries (<a href=\"https://www.linkedin.com/feed/update/urn:li:activity:6967436011714846720?utm_source=share&amp;utm_medium=member_desktop\">Hear from Ted</a> &amp; <a href=\"https://www.linkedin.com/posts/getro-com_get-to-know-thomas-activity-6971090675580719104-v0ta?utm_source=share&amp;utm_medium=member_desktop\">meet Thomas</a> from our team)&nbsp;</li>\n<li>As a fully remote company, we don't have offices, but we do get together virtually and in-person for Summits (Germany, Cape Town, San Fran, Portugal...)&nbsp;</li>\n</ul>\n<h3>How we work:</h3>\n<p>We're ambitious but realistic - we know anything worth doing takes time. We trust each member of our team to work when they wish, and from a location they choose. We believe in working smarter, not harder - we don't value presenteeism and we're not impressed by long working hours. Above all, we value the contribution of each individual and take seriously our responsibility to enable you to work on things you love. These aren't just words - they're part of everything we do, including how we design our products.</p>\n<h3>One last thing:</h3>\n<p>Don’t meet every single requirement? Studies have shown that women and people of color are less likely to apply to jobs unless they meet every single qualification. At Getro we are dedicated to building a diverse, inclusive and authentic workplace, so if you’re excited about this role but your past experience doesn’t align perfectly with every qualification in the job description, we encourage you to apply anyways. You may be just the right candidate for this or other roles.</p>\n\n    \n\n    \n","tags":"[\"management\",\"B2B\"]","pubDate":"2023-11-09 07:15:33.930","link":"https://boards.greenhouse.io/getro/jobs/5798044003","savedDate":"2023-11-09 07:15:33.930","slug":"senior-customer-success-manager-getro-7075"},{"id":3319190658,"title":"Solutions Architect","company":"Timescale","image":"https://pbs.twimg.com/profile_images/1542681228666671107/L5LYJLAD_400x400.png","description":"&lt;p&gt;Timescale is hiring a Solutions Architect for our growing go to market team! The right candidate will be responsible for providing pre-sales expertise to our sales team that includes but is not limited to, ensuring the technical win,&amp;nbsp; deep technical assistance and strategy, along with high-level architecture and planning for growth and scale and interacting with customers on a day-to-day basis. You should have strong pre-sales engineering experience as well as deep experience with relational databases (PostgreSQL is a strong plus!) and must quickly gain a detailed understanding of TimescaleDB. You should have a “can do it” attitude, where helping the user comes first. Timescale is a remote-first organization. We have two openings for this skillset. One in San Francisco, CA and the other in Europe.&amp;nbsp;&lt;/p&gt;\n&lt;h3&gt;&lt;strong&gt;What You Will Do&lt;/strong&gt;&lt;/h3&gt;\n&lt;ul&gt;\n&lt;li&gt;Be an intrical part of our go to market motion from pre-sales to adoption&lt;/li&gt;\n&lt;li&gt;Be a strategic partner for our customers, helping them plan, execute, and succeed with their initial and ongoing usage and growth with Timescaledb.&lt;/li&gt;\n&lt;li&gt;Manage technical customer relationships, working closely with Sales / Customer Success, Technical Support, and Product Management to drive engagement.&lt;/li&gt;\n&lt;li&gt;Develop and maintain close relationships with our customers to help them be successful today and help them discover more and different opportunities for Timescaledb in their business in the future.&lt;/li&gt;\n&lt;li&gt;Be curious, always willing to learn, and always looking for ways to improve our products, processes, and culture.&amp;nbsp;&lt;/li&gt;\n&lt;/ul&gt;\n&lt;h3&gt;&lt;strong&gt;What You Need&lt;/strong&gt;&lt;/h3&gt;\n&lt;ul&gt;\n&lt;li&gt;Bachelor’s degree in computer science, information systems, or equivalent experience.&lt;/li&gt;\n&lt;li&gt;Relational DB experience at scale: administration, data modeling, query optimization&lt;/li&gt;\n&lt;li&gt;Experience in a technical pre-sales role required&lt;/li&gt;\n&lt;li&gt;Experience as a technical support professional, Technical Account Manager, Solutions Architect, Consultant, or similar role with external customers preferred&lt;/li&gt;\n&lt;li&gt;Strong aptitude for understanding and learning new software products.&lt;/li&gt;\n&lt;li&gt;Strong communication skills and the ability to express complex technical concepts to a varied audience.&lt;/li&gt;\n&lt;li&gt;A thorough and holistic approach to data platforms, data analysis, and infrastructure.&lt;/li&gt;\n&lt;/ul&gt;\n&lt;h3&gt;&lt;strong&gt;Other Things that Will Help&lt;/strong&gt;&lt;/h3&gt;\n&lt;ul&gt;\n&lt;li&gt;Be familiar with TimescaleDB! You should download and test it out before you apply.&lt;/li&gt;\n&lt;li&gt;Familiarity with broad cloud computing concepts and experience with AWS, GCP, and Azure.&lt;/li&gt;\n&lt;li&gt;Experience with Relational databases, NoSQL databases, data modeling tools, ETL Pipelines, and data lifecycle management.&lt;/li&gt;\n&lt;li&gt;Familiarity with Postgresql, including best practices, Query Plan analysis, backup/restore, migrations, etc&lt;/li&gt;\n&lt;li&gt;A strong sense of curiosity and a willingness to wade into the unknown and learn as you go.&lt;/li&gt;\n&lt;/ul&gt;\n&lt;h3&gt;&lt;strong&gt;About Timescale&lt;/strong&gt;&lt;/h3&gt;\n&lt;p&gt;At Timescale, we are dedicated to serving developers worldwide, enabling them to build exceptional data-driven products that measure everything that matters: software applications, industrial equipment, financial markets, blockchain activity, consumer behavior, machine learning models, climate change, and more. Analyzing this data across the time dimension (“time-series data”) enables developers to understand what is happening right now, how that is changing, and why that is changing. Timescale develops TimescaleDB, the category-defining open-source relational database for time-series data, and offers fully-managed TimescaleDB and related database services. Timescale is a remote-first company with a global workforce and is backed by Benchmark Capital, New Enterprise Associates, Redpoint Ventures, Icon Ventures, Two Sigma Ventures, and other leading investors.&lt;/p&gt;&lt;div class=&quot;content-conclusion&quot;&gt;&lt;p&gt;By applying for this position, you are agreeing to &lt;a href=&quot;https://www.timescale.com/legal/timescale-applicant-privacy-note&quot; target=&quot;_blank&quot;&gt;Timescale&#39;s Applicant Privacy Notice.&lt;/a&gt;&amp;nbsp;&lt;/p&gt;&lt;/div&gt;","tags":"[\"postgres\",\"management\",\"engineering\",\"legal\",\"database\",\"aws\"]","pubDate":"2023-11-09 07:15:33.929","link":"https://www.timescale.com/careers/7015361002?gh_jid=7015361002","savedDate":"2023-11-09 07:15:33.929","slug":"solutions-architect-timescale-8260"},{"id":6123819603,"title":"Core Infrastructure Engineer - Networking","company":"Kraken","image":"https://pbs.twimg.com/profile_images/1306325743580848130/mk0qvsZ9_400x400.jpg","description":"<div class=\"section page-centered\" data-qa=\"job-description\"><div><b style=\"font-size: 18pt\">Building the Future of Crypto&nbsp;</b></div><div><br></div><div>Our Krakenites are a world-class team with crypto conviction, united by our desire to discover and unlock the potential of crypto and blockchain technology.</div><div><br></div><div>What makes us different? Kraken is a mission-focused company rooted in crypto values. As a Krakenite, you’ll join us on our mission to accelerate the global adoption of crypto, so that everyone can achieve financial freedom and inclusion. For over a decade, Kraken’s focus on our mission and crypto ethos has attracted many of the most talented crypto experts in the world.</div><div><br></div><div>Before you apply, please read the&nbsp;<a href=\"https://www.kraken.com/culture\" class=\"postings-link\">Kraken Culture</a>&nbsp;page to learn more about our internal culture, values, and mission.</div><div><br></div><div>As a fully remote company, we have Krakenites in 60+ countries who speak over 50 languages. Krakenites are industry pioneers who develop premium crypto products for experienced traders, institutions, and newcomers to the space. Kraken is committed to <a href=\"https://blog.kraken.com/crypto-education/security-at-kraken\" class=\"postings-link\">industry-leading security</a>, <a href=\"https://blog.kraken.com/category/crypto-education\" class=\"postings-link\">crypto education</a>, and <a href=\"https://blog.kraken.com/crypto-education/support-at-kraken\" class=\"postings-link\">world-class client support</a> through our products like&nbsp;<a href=\"https://pro.kraken.com/\" class=\"postings-link\">Kraken Pro</a>,&nbsp;<a href=\"https://www.kraken.com/en-us/nft\" class=\"postings-link\">Kraken NFT</a>, and&nbsp;<a href=\"https://futures.kraken.com/wallets\" class=\"postings-link\">Kraken Futures</a>.</div><div><br></div><div>Become a Krakenite and build the future of crypto!</div><div><br></div><div><b style=\"font-size: 24px\">Proof of work</b></div><div><br></div><div><b style=\"font-size: 18px\">The team</b></div><div><br></div><div>If you thrive in a challenging, fun and fast-paced environment, the Core Infrastructure Engineer at Kraken is for you! Not only is this role a strategic hands-on role that is critical to the continuing success of Kraken; you will join a highly dedicated team that is responsible for managing the entire network and compute infrastructure for one of the leading cryptocurrency exchanges in the world.&nbsp; We are looking for a dynamic and innovative self-starter with the ability to think “outside of the box” to solve complex problems in a sustainable way.</div><div><br></div><div><a href=\"https://blog.kraken.com/post/17936/performance-at-kraken/\" class=\"postings-link\">Find our more about Core Infrastructure Engineering in our latest engineering blogpost! </a></div><div><br></div><div>This role is fully remote.&nbsp; We prefer candidates in European Timezones, to cover current needs.</div></div><div class=\"section page-centered\"><div><h3>The opportunity</h3><ul class=\"posting-requirements plain-list\"><ul><li>Design, implement, manage, and defend a “zero trust”, defense-in-depth network</li><li>Implement and evolve enterprise network access controls</li><li>Manage and deploy \"infrastructure as code\"</li><li>Write good quality policies, procedures, and technical documentation</li><li>Coordinate with internal development teams and other stakeholders to ensure network security principles are \"built-in\" from the beginning</li><li>Work with Engineering and IT Security teams to ensure that product features are securely deployed and monitored</li><li>Monitor and maintain all physical infrastructure (network, security, and compute), cloud data center environments, remote office locations, and respond to critical network problems to maximize service uptime</li><li>Assist in various projects with network related requirements</li><li>Mentor and evangelize security practices through cross-functional work with internal stakeholders and teams</li><li>Assume on-call responsibilities and duties per the schedule</li><li>Travel as needed to support physical datacenter and office locations</li></ul></ul></div></div><div class=\"section page-centered\"><div><h3>Skills you should HODL</h3><ul class=\"posting-requirements plain-list\"><ul><li>5+ years of network engineering background including offensive/defensive security</li><li>Deep experience in public (AWS or Azure or Google), private and/or hybrid cloud infrastructure</li><li>Experience with network security management tools and techniques</li><li>Familiarity with security testing tools (performance and threat-based)</li><li>Proficient in network and security design, implementation, and administration leveraging industry standard platforms from vendors such as: Palo Alto Networks, Cisco, Juniper, and Aruba</li><li>Experience with Switching (Capacity Planning &amp; VLAN’s), Routing (OSPF, EIGRP, BGP, ECMP, PBF), WAN Technologies (MPLS, VPLS, VPN), public cloud networking, and Security (IPS, RBAC, etc.)</li><li>Previous experience monitoring and management of intrusion detection systems and firewall devices</li><li>Demonstrated experience researching, building and implementing defensive security systems that are used against internal and external attack vectors</li><li>Excellent communication skills: demonstrated ability to explain complex technical issues to both technical and non-technical audiences</li><li>Excellent analytical and problem-solving skills</li><li>Ability to perform well under pressure, high attention to detail</li><li>Strong desire / interest in learning new technology</li><li>Highly motivated and passionate about infrastructure engineering and security</li><li>This role requires the ability to travel. For this reason, a valid passport will be mandatory</li></ul></ul></div></div><!--[2022-11-28] [GOLD-2535] Remove payTransparencyV1 when feature flag is fully removed--><div class=\"section page-centered\" data-qa=\"salary-range\"><div>$90,000 - $134,000 a year</div></div><div class=\"section page-centered\" data-qa=\"closing-description\"><div>Location Tagging: #EU #LI-Remote</div><div><br></div><div>Kraken is powered by people from around the world and we celebrate all Krakenites for their diverse talents, backgrounds, contributions and unique perspectives. We hire strictly based on merit, meaning we seek out the candidates with the right abilities, knowledge, and skills considered the most suitable for the job. We encourage you to apply for roles where you don't fully meet the listed requirements, especially if you're passionate or knowledgable about crypto!</div><div><br></div><div>As an equal opportunity employer, we don’t tolerate discrimination or harassment of any kind. Whether that’s based on race, ethnicity, age, gender identity, citizenship, religion, sexual orientation, disability, pregnancy, veteran status or any other protected characteristic as outlined by federal, state or local laws.&nbsp;</div><div><br></div><div><b style=\"font-size: 18px\">Stay in the know</b></div><div><br></div><div><a href=\"https://twitter.com/krakenfx\" class=\"postings-link\">Follow us on Twitter</a></div><div><a href=\"https://blog.kraken.com/#:~:text=Enter%20your%20email%20address\" class=\"postings-link\">Learn on the Kraken Blog</a></div><div><a href=\"https://www.linkedin.com/company/kraken-exchange/\" class=\"postings-link\">Connect on LinkedIn</a></div></div><div class=\"section page-centered last-section-apply\" data-qa=\"btn-apply-bottom\"><a class=\"postings-btn template-btn-submit hex-color\" data-qa=\"show-page-apply\" href=\"https://jobs.lever.co/kraken/e181f2aa-3d7f-4204-af7f-abab704c121b/apply\">Apply for this job</a></div>","tags":"[\"management\",\"engineering\",\"aws\"]","pubDate":"2023-11-09 07:15:33.929","link":"https://jobs.lever.co/kraken/e181f2aa-3d7f-4204-af7f-abab704c121b","savedDate":"2023-11-09 07:15:33.929","slug":"core-infrastructure-engineer-networking-kraken-1097"},{"id":4676647237,"title":"\n            Senior People Operations Manager (Remote)\n          ","company":"DuckDuckGo","image":"https://spreadprivacy.com/content/images/2023/05/duckduckgo-logo_wide.png","description":"\n            <p>Hi, we’re DuckDuckGo, the Internet privacy company for everyone who wants to take back their privacy now. For over a decade, we've been building our all-in-one product, developing new privacy technology, and working with policymakers to make online privacy simple and accessible for all. </p>\n<p><br></p>\n<p>Our app is now downloaded more than 78M times a year, and our private search engine packaged with it has become the #2 search engine on mobile in the United States and 18 other countries, including the United Kingdom, Canada, Australia, Germany, and the Netherlands. Oh, and we've been profitable since 2014, with revenue exceeding $100 million a year! Now, we’re rolling out a suite of new privacy solutions, including <u><a href=\"https://www.spreadprivacy.com/introducing-email-protection-beta/\" rel=\"noopener\">Email Protection</a></u>,  <u><a href=\"https://spreadprivacy.com/introducing-app-tracking-protection/\" rel=\"noopener\">App Tracking Protection</a></u> and our first-ever Desktop Apps for <u><a href=\"https://spreadprivacy.com/introducing-duckduckgo-for-mac/\" rel=\"noopener\">Mac</a></u><a href=\"https://spreadprivacy.com/introducing-duckduckgo-for-mac/\" rel=\"noopener\"> </a>and <u><a href=\"https://spreadprivacy.com/windows-browser-open-beta/\" rel=\"noopener\">Windows</a></u>.</p>\n<p><br></p>\n<p>We’re looking for a Senior People Operations Manager to help shape our all-in-one privacy solution and join our mission to show the world that protecting your privacy online can be simple.  </p>\n<p><br></p>\n<p><strong>The Opportunity</strong> </p>\n<p>In this role, you will leverage your empathy, critical thinking, and wealth of experience to empower individuals and teams across DuckDuckGo to achieve our goals. </p>\n<p><br></p>\n<p>Our People Ops organization is hands-on and committed to providing a high level of service, which is scaling with the company. You'll provide guidance through high-touch performance management, which will require you to constantly learn about new domains in order to provide exceptional support. You'll apply this same quality bar to your support of Functional Teams as they navigate the changes that come with a scaling tech organization. </p>\n<p><br></p>\n<p>DuckDuckGo operates on a distributed leadership model that will ask you to question your assumptions and creatively apply your knowledge in forward-thinking ways to serve the team as you identify and execute projects to serve the organization. We've got team members in 20+ countries working on unique challenges in online privacy, and the People Operations team provides them with the support they need to succeed.</p>\n<p><br></p>\n<p><strong>What You Will Bring to DuckDuckGo</strong> </p>\n<ul>\n<li>7+ years of People Operations experience working in a tech-driven organization, with deep experience in professional development, performance management, organizational behavior, employee relations, and labor law and compliance.&nbsp;</li>\n<li>Ability to effectively resolve complex engagement, performance, and employee relations issues with discretion, humanity, and critical thinking.</li>\n<li>Ability to adapt an HR Business Partner mindset to a distributed environment and identify the highest-leverage ways to serve our teams.</li>\n<li>Experience leading projects, process improvements, and substantive change within high-growth organizations.</li>\n<li>Ability to lead and collaborate on high-impact and complex projects from proposal through postmortem.  </li>\n<li>Skills to wrangle vague problems, propose innovative solutions, and execute them with a strong focus on metrics. </li>\n<li>Proven conflict resolution skills and keen emotional intelligence.</li>\n<li>Exceptional verbal and written communication skills.</li>\n</ul>\n<p><br></p>\n<p><strong>How We Will Support You </strong> </p>\n<p>Our core values -- build trust, question assumptions, and validate direction -- underpin how we work day-to-day and the support we give our team members. We strive to empower our team members to be self-directed and self-motivated in their work.  </p>\n<p><br></p>\n<ul>\n<li>\n<strong>Remote First, Always</strong>: We've always been a fully distributed company with team members all over the world. We trust you to get your work done wherever, and whenever.   </li>\n<li>\n<strong>Commitment to Personal Growth:</strong> Every team member has an annual budget of $1,250 USD to invest in their professional development. &nbsp;Every team member also has a dedicated Career Advisor, who serves as a guide to help you develop your strengths, identify your motivations, and understand your opportunities for growth. </li>\n<li>\n<strong>Leadership:</strong> We have many different types of leaders and possible combinations of leadership roles, so you can grow your career in a way that aligns best with your personal goals. You can seek additional leadership roles by being directly responsible for projects, taking ownership of areas of the company, developing and maintaining internal processes, or pursuing advisory roles. </li>\n<li>\n<strong>Work/Life Balance: </strong>Team members have the freedom and flexibility to organize their own work schedules. We want you to thrive both in and out of the office. We trust you to use good judgment and take the time off that you need to bring your best self to work.  </li>\n</ul>\n<p><br></p>\n<p>We also offer paid parental leave, a co-working stipend, office setup reimbursement, and a wellness stipend. More support resources can be found in our <u><a href=\"https://duckduckgo.com/assets/hiring/team_support_guide.pdf\" rel=\"noopener\">Team Member Support Guide</a></u>, which explains how we make your well-being a priority. </p>\n<p><br></p>\n<p>For more information on how we collaborate worldwide, from leadership in our relatively flat organization to start-to-finish ownership<strong>,</strong> check out <u><a href=\"https://duckduckgo.com/assets/hiring/how_we_work.pdf\" rel=\"noopener\">DuckDuckGo Culture: How We Work.</a></u> </p>\n<p><br></p>\n<p><strong>Compensation</strong> </p>\n<p>Annual compensation: $176,000 USD and stock options. Compensation is the same within a professional level, regardless of geographic location or functional area, and the compensation for each professional level is transparent across the organization.</p>\n<p><br></p>\n<p><strong>Hiring Process</strong> </p>\n<p>Hiring works best when it's a two-way street. Learn how we help you get to know DuckDuckGo and envision your future role here. Find out more about <u><a href=\"https://duckduckgo.com/assets/hiring/how_we_hire.pdf\" rel=\"noopener\">how we hire</a></u>. </p>\n<p><br></p>\n<p><strong>Diversity, Equity, and Inclusion</strong> </p>\n<p>DuckDuckGo provides equal work opportunities to all team members and applicants<u>,</u> and it prohibits discrimination and harassment of any type on the basis of race, color, ethnicity, caste, religion, age, sex (including pregnancy), national origin, disability status, genetics, protected veteran status, sexual orientation, gender identity or expression, or any other characteristic protected by our policies or federal, state, or local laws.</p>\n<p><br></p>\n<p>We want to ensure that our hiring process is accessible. If you need reasonable accommodation for any part of the application process because of a medical condition or disability, please send an email to <u><a href=\"mailto:careers@duckduckgo.com\" rel=\"noopener\">careers@duckduckgo.com</a></u> to let us know the nature of your request.  </p>\n<p><br></p>\n<p>If you think you might thrive in this environment, we would love to hear from you. </p>\n<p><br></p>\n<p><strong>Please note that:</strong> </p>\n<ol>\n<li>Sometimes we meet up! Expect to travel at least two times a year: once for our all-hands meetup and again for a team retreat (each around 4-5 days). While extenuating circumstances may impact attendance, everyone is strongly encouraged to attend.</li>\n<li>While we offer a flexible work arrangement with no core hours, expect an average full-time commitment of 40 hours per week. </li>\n<li>A successful candidate will be subject to a background check and must receive satisfactory results of the same, as a condition of joining the team. </li>\n<li>By applying for this role, you confirm that all information submitted is accurate and complete. You further acknowledge that providing false or fraudulent information during the application process is cause for denial of an offer, revocation of any existing offer, or other adverse action, up to and including termination after the start of your commencement of work.  </li>\n</ol>\n<p><br></p>\n<p>#LI-DNI</p>\n          ","tags":"[\"management\",\"aws\"]","pubDate":"2023-11-09 07:15:33.928","link":"https://duckduckgo.recruitee.com/o/senior-people-operations-manager","savedDate":"2023-11-09 07:15:33.928","slug":"senior-people-operations-manager-remote-duckduckgo-4662"},{"id":8964708370,"title":"Platform Engineer (Postgres team)","company":"Supabase","image":"https://pbs.twimg.com/profile_images/1651226564728700928/h0tz5UT1_400x400.jpg","description":"\n    <div class=\"content-intro\"><p><img src=\"https://pbs.twimg.com/media/FIdU8GJWQAUGWRA?format=jpg&amp;name=small\" alt=\"Join Supabase\" width=\"680\" height=\"453\"></p></div>\n\n    <p>We're looking for a Supabase Platform Engineer to join our team and elevate our PostgreSQL offerings.</p>\n<p>You'll work hand-in-hand with the PostgreSQL team and play an instrumental role in technical decision-making and refining internal methodologies.</p>\n<p>The focus of this role is around owning stability and deployment of our products. A first step is to streamline artifact builds/deployments via our public <strong><code>supabase/postgres</code></strong> GitHub repository. This repository bundles an array of features/products into docker images and AWS AMIs, giving users the ability to run Supabase on our cloud and locally. Subsequently, the role will function as a bridge between product and infrastructure teams to improve the reliability of product deployments and upgrades.</p>\n<p>In this role, your primary responsibilities will include:</p>\n<ul>\n<li>Refactoring our <a href=\"https://github.com/supabase/postgres\">supabase/postgres</a> repo to improve components and utilize nix for building, packaging, and conducting high-level infrastructure tests.</li>\n<li>Building tooling that allows for local builds, taps into a public cloud cache, and performs thorough full-stack infrastructure tests on every PR</li>\n<li>Timely PostgreSQL major, minor, and extension upgrades.</li>\n<li>Engaging in proactive identification and resolution of production issues in customer deployments.</li>\n<li>Spearheading the creation of best practices, tools, and tests to ensure enhanced stability and decreased deployment risks over time.</li>\n</ul>\n<p><strong>What we need</strong></p>\n<p>This role demands the following pivotal qualities:</p>\n<ol>\n<li><strong>PostgreSQL Expert</strong>: A profound understanding of PostgreSQL and its associated tools. Familiarity with extensions, performance optimization, and best practices is essential.</li>\n<li><strong>Infrastructure</strong>: Proven expertise in infrastructure management, tooling, and optimization.</li>\n<li><strong>Self-directed &amp; Initiative</strong>: At Supabase, we value independence and proactive problem-solving. We anticipate you to be a dynamic self-starter, thriving in asynchronous collaboration across diverse teams. Your knack for spotting areas of improvement and commitment to realizing those enhancements will be key.</li>\n</ol>\n<p><strong>What you’ll do</strong></p>\n<ul>\n<li>Improve the utility and efficiency of our PostgreSQL offerings.</li>\n<li>Contribute to the enhancement of our public GitHub repositories, especially <a href=\"https://github.com/supabase/postgres\">supabase/postgres</a>.</li>\n<li>Develop tooling and solutions within the Supabase ecosystem.</li>\n<li>Engage with customers routinely, ensuring our solutions resonate with their needs.</li>\n<li>Address and resolve GitHub and Support issues.</li>\n</ul>\n<p><strong>Must haves</strong></p>\n<ul>\n<li>3+ years experience with PostgreSQL and its ecosystem.</li>\n<li>Familiarity with Nix, Docker, Git, GitHub and associated tooling.</li>\n<li>Eagerness to mold and adapt our development tools/stack.</li>\n<li>Comfortable with regular interactions with customers</li>\n</ul>\n<p><strong>Nice to haves</strong></p>\n<ul>\n<li>Experience with PostgREST, gotrue, and other Supabase stack components.</li>\n<li>Exposure to public cloud platforms and deployment methodologies.</li>\n<li>Contributions to significant, open-source projects in the PostgreSQL domain.</li>\n</ul>\n<p><strong>We offer:</strong></p>\n<ul>\n<li>100% remote work from anywhere in the world. No location-based adjustment to your salary.</li>\n<li>ESOP (equity ownership in the company)</li>\n<li>Autonomous work. We work collaboratively on projects, but you set your own pace.</li>\n<li>Health, Vision and Dental benefits. Supabase covers 100% of the cost for employees and 80% for dependents</li>\n<li>Generous Tech Allowance for any office setup you need</li>\n<li>Annual Education Allowance</li>\n<li>Annually run off-sites.</li>\n</ul>\n<p></p>\n\n    \n\n    <div class=\"content-conclusion\"><h3>BUILD IN A WEEKEND. SCALE TO BILLIONS</h3>\n<p>Supabase adds auth, realtime, and restful APIs to Postgres without a single line of code.</p>\n<p>Each project within Supabase is an isolated&nbsp;Postgres cluster, allowing customers to scale independently, while still providing the features that you need to build: instant database setup, auth, row level security, realtime data streams, auto-generating APIs, and a simple to use web interface.</p>\n<p>We are a fully remote company.</p>\n<p>Key Tech: Javascript, Typescript, Go, Elixir, PostgREST (haskell), Postgres, Pulumi.</p>\n<h3><a id=\"about-the-team\" class=\"anchor\"></a>About the team</h3>\n<ul>\n<li>We're a startup. It's unstructured.</li>\n<li>Collectively founded more than a dozen venture-backed companies.</li>\n<li>More than 10 different nationalities.</li>\n<li>We deeply believe in <a href=\"https://supabase.com/blog/2022/03/25/should-i-open-source-my-company\" target=\"_blank\">the efficacy of collaborative open source</a>. We support existing communities and tools, rather than building \"yet another xx\".</li>\n<li>We \"dogfood\" everything. If you use it in your project, we use it in Supabase.</li>\n</ul>\n<h2><a id=\"process\" class=\"anchor\"></a>Process</h2>\n<ul>\n<li>The entire process is fully remote and all communication will happen over email or via video chat.</li>\n<li>Once you've submitted your application, the team will review your submission, and may reach out for a short screening interview over video call.</li>\n<li>If you pass the screen you will be invited to up to four follow up interviews. The calls:\n<ul>\n<li>usually take between 20-45 minutes each depending on the interviewer.</li>\n<li>are all 1:1.</li>\n<li>will be with both founders, a member of either the growth or engineering team (depending on the role), and usually one other person from your immediate team or function.</li>\n</ul>\n</li>\n<li>Once the interviews are over, the team will meet to discuss several roles and candidates and may:\n<ul>\n<li>ask one or two follow-up questions over email or a quick call.</li>\n<li>go directly to making an offer.</li>\n</ul>\n</li>\n</ul>\n<h2>&nbsp;</h2></div>\n","tags":"[\"postgres\",\"pulumi\",\"javascript\",\"typescript\",\"elixir\",\"management\",\"engineering\",\"database\",\"aws\"]","pubDate":"2023-11-09 07:15:33.927","link":"https://boards.greenhouse.io/supabase/jobs/5011466004","savedDate":"2023-11-09 07:15:33.927","slug":"platform-engineer-postgres-team-supabase-7138"},{"id":5181156303,"title":"Data Engineer ","company":"Supabase","image":"https://pbs.twimg.com/profile_images/1651226564728700928/h0tz5UT1_400x400.jpg","description":"\n    <div class=\"content-intro\"><p><img src=\"https://pbs.twimg.com/media/FIdU8GJWQAUGWRA?format=jpg&amp;name=small\" alt=\"Join Supabase\" width=\"680\" height=\"453\"></p></div>\n\n    <p>Supabase is an Open Source and fully remote company building developer tools for databases.</p>\n<p>We are seeking a Data Engineer.</p>\n<p><strong>You will:</strong></p>\n<ul>\n<li>Create, refactor, and test Airflow jobs syncing data among various input sources, Hubspot, and dbt reporting models.</li>\n<li>Create, refactor, and test our DBT models with the goal of developing a single source of truth for each data feature.</li>\n<li>Develop Tableau reports based on DBT model outputs.</li>\n</ul>\n<p><strong>You are:</strong></p>\n<ul>\n<li>A data engineer with experience in complex DBT models, managing Airflow pipelines, and infrastructure as code (ideally Pulumi).</li>\n<li>Comfortable refactoring data systems in-place with high uptime.</li>\n<li>Highly autonomous and able to translate business needs into concrete metrics.</li>\n<li>Experienced in cross-functional collaboration, you can deliver insights for Product and Business teams.</li>\n</ul>\n<p><strong>We offer:</strong></p>\n<ul>\n<li>100% remote work from anywhere in the world. No location-based adjustment to your salary.</li>\n<li>ESOP (equity ownership in the company)</li>\n<li>Autonomous work. We work collaboratively on projects, but you set your own pace.</li>\n<li>Health, Vision and Dental benefits. Supabase covers 100% of the cost for employees and 80% for dependents</li>\n<li>Generous Tech Allowance for any office setup you need</li>\n<li>Annual Education Allowance</li>\n<li>Annually run off-sites.</li>\n</ul>\n<p></p>\n\n    \n\n    <div class=\"content-conclusion\"><h3>BUILD IN A WEEKEND. SCALE TO BILLIONS</h3>\n<p>Supabase adds auth, realtime, and restful APIs to Postgres without a single line of code.</p>\n<p>Each project within Supabase is an isolated&nbsp;Postgres cluster, allowing customers to scale independently, while still providing the features that you need to build: instant database setup, auth, row level security, realtime data streams, auto-generating APIs, and a simple to use web interface.</p>\n<p>We are a fully remote company.</p>\n<p>Key Tech: Javascript, Typescript, Go, Elixir, PostgREST (haskell), Postgres, Pulumi.</p>\n<h3><a id=\"about-the-team\" class=\"anchor\"></a>About the team</h3>\n<ul>\n<li>We're a startup. It's unstructured.</li>\n<li>Collectively founded more than a dozen venture-backed companies.</li>\n<li>More than 10 different nationalities.</li>\n<li>We deeply believe in <a href=\"https://supabase.com/blog/2022/03/25/should-i-open-source-my-company\" target=\"_blank\">the efficacy of collaborative open source</a>. We support existing communities and tools, rather than building \"yet another xx\".</li>\n<li>We \"dogfood\" everything. If you use it in your project, we use it in Supabase.</li>\n</ul>\n<h2><a id=\"process\" class=\"anchor\"></a>Process</h2>\n<ul>\n<li>The entire process is fully remote and all communication will happen over email or via video chat.</li>\n<li>Once you've submitted your application, the team will review your submission, and may reach out for a short screening interview over video call.</li>\n<li>If you pass the screen you will be invited to up to four follow up interviews. The calls:\n<ul>\n<li>usually take between 20-45 minutes each depending on the interviewer.</li>\n<li>are all 1:1.</li>\n<li>will be with both founders, a member of either the growth or engineering team (depending on the role), and usually one other person from your immediate team or function.</li>\n</ul>\n</li>\n<li>Once the interviews are over, the team will meet to discuss several roles and candidates and may:\n<ul>\n<li>ask one or two follow-up questions over email or a quick call.</li>\n<li>go directly to making an offer.</li>\n</ul>\n</li>\n</ul>\n<h2>&nbsp;</h2></div>\n","tags":"[\"postgres\",\"pulumi\",\"javascript\",\"typescript\",\"elixir\",\"engineering\",\"database\"]","pubDate":"2023-11-09 07:15:33.927","link":"https://boards.greenhouse.io/supabase/jobs/5017312004","savedDate":"2023-11-09 07:15:33.927","slug":"data-engineer-supabase-2482"},{"id":4639763815,"title":"Junior Accountant - Fully Remote","company":"CoverGo","image":"https://pbs.twimg.com/profile_images/1382655628523364355/MWPIbbID_400x400.jpg","description":"<p><strong>Top 3 Reasons To Join Us </strong></p><ul> <li>Competitive Salary</li> <li>100% Globally Remote</li> <li>Working on the latest tech for the Insurtech Market Leader</li> </ul><p><strong>About Us</strong></p><p>At CoverGo, our mission is to empower all insurance companies to make insurance 100% digital and accessible to everyone.</p><ul> <li>We are a leading global no-code insurance platform for health, life, and P&amp;C</li> <li>We’re the winner of the Insurtech of the Year in all of Asia and other awards globally</li> <li>We work with insurance enterprise clients such as AXA, Bupa, MSIG, Dai-ichi, Bank of China Group Insurance, and many more</li> <li>We're an international, diverse team of over 120 people with 30 nationalities and team members working remotely from all over the world</li> <li>We are fully funded and backed by reputable VC funds and strategic institutional investors</li> <li>We have a global presence in Asia, EMEA and the Americas</li> <li>We’ve grown our annualized revenue by over 30x since January 2021</li> <li>We’re constantly working towards making CoverGo a workplace that you love coming to. We deeply believe that bringing together a diversity of thoughts, expressions, and perspectives is key to building the best culture for equally diverse communities all over the world</li> </ul><p><strong>What you will do:</strong><br></p><ul> <li>Responsible for daily accounting operations in Xero system for multiple entities</li> <li>Maintain proper and accurate records and supporting documents</li> <li>Assist with the preparation of the budget, forecast, and financial analysis</li> <li>Cash flow analysis and monthly reporting</li> <li>Daily communication with suppliers and various stakeholders on payments and accounting documentation</li> <li>Responsible for AP function of the firm</li> <li>Manage Inter-company reconciliations</li> <li>Perform ad hoc assignments and projects as required</li> </ul><p><strong>What we are looking for:</strong><br></p><ul> <li>Degree holder in Accounting, Finance, and related discipline</li> <li>CPA, ACCA or similar</li> <li>Minimum of 2 years of accounting experience</li> <li>Xero accounting software experience</li> <li>Excellent skills in the use of Microsoft Office</li> <li>Competent in to use of various software, App and IT solutions</li> <li>Working experience with international businesses</li> <li>Able to work independently and under pressure in a fast-paced environment with an emphasis on accuracy and timeliness</li> <li>Meticulous, well-organized and conscientious with a high level of initiative at work</li> <li>Self-motivated, hardworking, a strong sense of responsibility with a positive working attitude</li> <li>Resourceful, can-do attitude and willingness to learn and go beyond</li> <li>Good command of English is a must, knowing other languages would be an advantage</li> </ul><p><strong>Why You'll Love Working Here</strong></p><ul> <li>Fully Remote</li> <li>Flexible Leave</li> <li>International Environment</li> <li>Competitive renumeration package</li> <li>Performance Bonus</li> <li>Stock Options after 6 months </li> <li>Company activities and events</li> <li>Learning and development plan</li> </ul><p><strong>CoverGo Company</strong><a href=\"https://www.youtube.com/watch?v=YI0ezLxvFvA\" rel=\"nofollow noreferrer noopener\" class=\"external\"><strong> Video</strong></a></p><p>By submitting your application, you confirm that you have read, understood, and accepted the content of CoverGo’s <a target=\"_blank\" href=\"https://apply.workable.com/covergo/gdpr_policy?lng=en\" rel=\"nofollow noreferrer noopener\" class=\"external\">Privacy Notice</a> and you consent to the processing of your data as part of this application.</p><h3>Requirements: </h3><h3>Benefits: </h3>","tags":"[\"Finance\"]","pubDate":"2023-11-09 00:00:00.000","link":"https://apply.workable.com/covergo/j/660390AADD","savedDate":"2023-11-09 07:15:33.932","slug":"junior-accountant-fully-remote-covergo-9159"},{"id":8029823375,"title":"Technical Delivery Manager","company":"CoverGo","image":"https://pbs.twimg.com/profile_images/1382655628523364355/MWPIbbID_400x400.jpg","description":"<p><strong>Top 3 Reasons To Join Us</strong></p><ul> <li>Competitive Salary</li> <li>100% Remote</li> <li>Working on the latest tech for the Insurtech Market Leader</li> </ul><p><strong>About Us</strong></p><p>At CoverGo, our mission is to empower all insurance companies to make insurance 100% digital and accessible to everyone.</p><ul> <li>We are a leading global no-code insurance platform for health, life, and P&amp;C</li> <li>We’re the winner of the Insurtech of the Year in all of Asia and other awards globally</li> <li>We work with insurance enterprise clients such as AXA, Bupa, MSIG, Dai-ichi, Bank of China Group Insurance, and many more</li> <li>We're an international, diverse team of over 120 people with 30 nationalities and team members working remotely from all over the world</li> <li>We are fully funded and backed by reputable VC funds and strategic institutional investors</li> <li>We have a global presence in Asia, EMEA and the Americas</li> <li>We’ve grown our annualized revenue by over 30x since January 2021</li> <li>We’re constantly working towards making CoverGo a workplace that you love coming to. We deeply believe that bringing together a diversity of thoughts, expressions, and perspectives is key to building the best culture for equally diverse communities all over the world</li> </ul><p><strong>About the Role</strong></p><p>The Technical Delivery Manager is a key contributor responsible for overseeing the project management and technical aspects of internal product roadmap projects. This role requires a strong project management discipline and technical background, preferably with programming experience. The Technical Delivery Manager will primarily focus on internal-facing projects, working closely with cross-functional teams to drive successful project outcomes.</p><p><strong>What You Will Do</strong></p><ul> <li>Lead and manage the end-to-end project lifecycle of internal product roadmap projects</li> <li>Collaborate with cross-functional teams, including developers, QA engineers, DevOps, product and project managers, to ensure project success</li> <li>Utilize your technical expertise to effectively communicate with technical teams and make informed decisions</li> <li>Develop and maintain project plans, timelines, dependencies, and budgets</li> <li>Monitor and report on project progress and identify potential risks and issues, taking proactive steps to mitigate them</li> <li>Foster a culture of continuous improvement within the project management process</li> <li>Work closely with the Technical Delivery Director to align project priorities with company goals</li> <li>Ensure the successful delivery of high-quality products and solutions within the specified timeframe and budget</li> <li>Collaborate with internal stakeholders to gather project requirements and specifications</li> </ul><p><strong>What We Need</strong></p><ul> <li>Proven track record in project management, including the development of project plans, budget management, and successful project delivery</li> <li>Established proficiency as a programmer or engineer, showcasing a solid comprehension of technical principles and effective communication with technical teams</li> <li>Experience in the insurance industry, preferably in health and life insurance, with a deep understanding of insurance-related products, policies, and services</li> <li>Strong analytical and problem-solving skills to identify project risks and issues and implement effective solutions</li> <li>Relevant project management certifications, such as PMP (Project Management Professional), PRINCE2 or equivalent, would be a plus</li> <li>Strong conflict resolution skills to address issues within project teams and ensure smooth collaboration</li> <li>Ability to align project objectives with broader company goals and strategies</li> <li>Basic data analysis skills to assess project performance and make data-driven decisions</li> <li>A customer-centric mindset, with a focus on delivering solutions that enhance the customer experience</li> <li>Exceptional attention to detail to ensure project plans are accurately developed, executed, and monitored</li> <li>Strong verbal and written communication skills, with the ability to convey complex technical information to both technical and non-technical stakeholders</li> <li>Ability to adapt to changing project requirements, priorities, and timelines in a fast-paced and dynamic environment</li> </ul><p><strong>Why You'll Love Working Here</strong></p><ul> <li>Fully Remote</li> <li>Flexible Leave</li> <li>International Environment</li> <li>Competitive renumeration package</li> <li>Performance Bonus</li> <li>Stock Options after 6 months </li> <li>Company activities and events</li> <li>Learning and development plan</li> </ul><p><strong>CoverGo Company</strong><a href=\"https://www.youtube.com/watch?v=YI0ezLxvFvA\" rel=\"nofollow noreferrer noopener\" class=\"external\"><strong> Video</strong></a></p><p>By submitting your application, you confirm that you have read, understood, and accepted the content of CoverGo’s <a target=\"_blank\" href=\"https://apply.workable.com/covergo/gdpr_policy?lng=en\" rel=\"nofollow noreferrer noopener\" class=\"external\">Privacy Notice</a> and you consent to the processing of your data as part of this application.</p><p><a href=\"https://www.youtube.com/watch?v=YI0ezLxvFvA\" rel=\"nofollow noreferrer noopener\" class=\"external\"></a></p><h3>Requirements: </h3><h3>Benefits: </h3>","tags":"[\"management\"]","pubDate":"2023-11-09 00:00:00.000","link":"https://apply.workable.com/covergo/j/36CC0B7BA7","savedDate":"2023-11-09 07:15:33.932","slug":"technical-delivery-manager-covergo-1648"},{"id":1934016828,"title":"Security Engineer - Work Anywhere/Remote","company":"CloudLinux","image":"https://pbs.twimg.com/profile_images/696718028084482050/ymY3OEPk_400x400.png","description":"<p>Imunify360 Security Suite is a product of CloudLinux Inc., the maker of the #1 OS in security and stability for hosting providers. Imunify is an innovative security solution designed specifically for shared and VPS/Dedicated servers. The automated, easy-to-use solution with the six-layer approach to security delivers comprehensive and complete attack prevention.</p><p><strong>We are looking for someone who embodies our company values:</strong></p><ul> <li> <strong>Curious</strong>: Be willing to do research and design experiments by being hands-on</li> <li> <strong>Tenacious</strong>: Creating something new is hard work, and our Analytics team never gives up</li> <li> <strong>Customer Passion</strong>: Be the backbone of our solution and help us stay ahead of malware developers.</li> <li> <strong>Design for Scale</strong>: Work with the rest of the analytics and engineering team to make web-protection at scale possible</li> <li> <strong>Agile</strong>: Some days you may spend researching and designing experiments while others are spent using your analytical toolbox to surface insights into real-time incidents and file infection.</li> <li> <strong>Roll Up Your Sleeves</strong>: Partner closely internally to learn from others, and succeed as a team.</li> </ul><p><strong>How you’ll have an impact:</strong></p><ul> <li>Performing exploratory data analysis and building production machine learning models that identify malware, reveal hidden patterns in incidents, and help to determine file infections and malicious behavior.</li> <li>Writing production and offline analytics code in Python</li> <li>Working with distributed data pipelines</li> <li>Communicating complex ideas effectively to a variety of audiences</li> <li>Collaborate with engineering teams to strengthen our comprehensive security solution for web-hosting servers</li> </ul><h3>Requirements: </h3><p><strong>Past experience you’ll need:</strong></p><ul> <li>Bachelor's degree in computer science, applied mathematics, or an analytical field or equivalent practical experience</li> <li>Hands-on statistical analysis with a solid fundamental understanding</li> <li>Designing experiments and collecting data</li> <li>Practical SQL knowledge</li> <li>Experience in web development, specifically, the development in Python/PHP/JS</li> <li>Understanding web-based security fundamentals</li> <li>Familiarity with the Linux command line</li> <li>Fluent in English</li> </ul><p><strong>It would be plus:</strong></p><ul> <li>Experience as ML/DS engineer</li> <li>Building production ML models</li> </ul><h3>Benefits: </h3><p><strong>What's in it for you?</strong></p><ul> <li>A focus on professional development;<ul> <li>Training reimbursements</li> <li>Mentor programs</li> <li>Knowledge-Exchange programs</li> <li>Interesting and challenging projects</li> </ul> </li> <li>Flexible working hours</li> <li>Paid 24 days of vacation per year and unlimited sick leave</li> <li>Medical insurance reimbursement</li> <li>Co-working and gym/sports reimbursement</li> <li>The opportunity to receive a reward for the most innovative idea that the company can patent.</li> </ul><em>By applying for this position, you agree with </em><a href=\"https://cloudlinux.com/privacy-policy\" rel=\"nofollow noreferrer noopener\" class=\"external\"><em>Cloudlinux Privacy Policy</em></a><em> and give us your consent to maintain and process your personal data with this respect. Please read our Privacy Policy for more information.</em>","tags":"[\"engineering\"]","pubDate":"2023-11-08 00:00:00.000","link":"https://apply.workable.com/cloudlinux-1/j/1A83C08D53","savedDate":"2023-11-09 07:15:33.931","slug":"security-engineer-work-anywhere-remote-cloudlinux-7425"},{"id":2225219998,"title":"Head of Client Services (Fully Remote)","company":"CoverGo","image":"https://pbs.twimg.com/profile_images/1382655628523364355/MWPIbbID_400x400.jpg","description":"<p><strong>Top 3 Reasons To Join Us</strong></p><ul> <li>Competitive Salary</li> <li>100% Remote</li> <li>Insurtech industry leader worldwide</li> </ul><p><strong>About Us</strong></p><p>At CoverGo, our mission is to empower all insurance companies to make insurance 100% digital and accessible to everyone.</p><ul> <li>We are a leading global no-code insurance platform for health, life, and P&amp;C</li> <li>We’re the winner of the Insurtech of the Year in all of Asia and other awards globally</li> <li>We work with insurance enterprise clients such as AXA, Bupa, MSIG, Dai-ichi, Bank of China Group Insurance, and many more</li> <li>We're an international, diverse team of over 120 people with 30 nationalities and team members working remotely from all over the world</li> <li>We are fully funded and backed by reputable VC funds and strategic institutional investors</li> <li>We have a global presence in Asia, EMEA and the Americas</li> <li>We’ve grown our annualized revenue by over 30x since January 2021</li> <li>We’re constantly working towards making CoverGo a workplace that you love coming to. We deeply believe that bringing together a diversity of thoughts, expressions, and perspectives is key to building the best culture for equally diverse communities all over the world</li> </ul><p><strong>About the Role</strong></p><p>By joining CoverGo as the Head of Client Services, you will have the opportunity to work with a global team of insurance technology experts and be at the forefront of changing the insurance industry. If you are passionate about providing excellent customer service, leading high-performing project teams, and driving business growth across insurance clients, we invite you to join our team now.</p><p><strong>What You Will Do</strong></p><ul> <li>Lead and manage the client services department, overseeing all aspects of project management and portfolio governance for our global clients</li> <li>Develop and implement strategies to improve delivery efficiency, improve delivery standards, standardise project frameworks, enhance client satisfaction and drive business growth</li> <li>Establish and maintain strong relationships with key clients, ensuring their needs are met and expectations are exceeded</li> <li>Collaborate with cross-functional teams, such as sales and product development, to align on customer requirements and deliver innovative solutions</li> <li>Monitor and analyze customer data and feedback to identify trends, issues, and opportunities for improvement</li> <li>Train and mentor project team members, ensuring high levels of performance and professionalism</li> <li>Stay updated on industry trends and best practices in customer services to drive continuous improvement within the department</li> </ul><p><strong>What We Need</strong></p><ul> <li>Bachelor's degree in Business Administration, Information Technology, or a related field</li> <li>Proven experience in client services, enterprise transformation, or leading large delivery functions within the insurance or financial technology industry</li> <li>Proven experience in lifting delivery capability through the application of robust governance and frameworks </li> <li>Strong leadership skills, with the ability to inspire and motivate a team</li> <li>Excellent interpersonal and communication skills, with the ability to build and maintain relationships with clients and internal stakeholders</li> <li>Sound knowledge of insurance products and services, with the ability to understand and address customer needs</li> <li>Analytical mindset, with the ability to leverage customer data and feedback to drive informed business decisions</li> <li>Detail-oriented and results-driven, with the ability to multitask and prioritize effectively</li> <li>Familiarity with enterprise software solutions, platform SaaS models and CRM systems is preferred</li> <li>Familiarity with start-up environments and a determined mindset to make a positive contribution to the overall success of CoverGo</li> </ul><p><strong>Why You'll Love Working Here</strong></p><ul> <li>Fully Remote</li> <li>Flexible Leave</li> <li>International Environment</li> <li>Competitive renumeration package</li> <li>Performance Bonus</li> <li>Stock Options after 6 months</li> <li>Company activities and events</li> <li>Learning and development plan</li> </ul><p><strong>CoverGo Company<a target=\"_blank\" href=\"https://www.youtube.com/watch?v=YI0ezLxvFvA\" rel=\"nofollow noreferrer noopener\" class=\"external\"> Video</a></strong></p><p><br></p><p>By submitting your application, you confirm that you have read, understood, and accepted the content of CoverGo’s <a target=\"_blank\" href=\"https://apply.workable.com/covergo/gdpr_policy?lng=en\" rel=\"nofollow noreferrer noopener\" class=\"external\">Privacy Notice</a> and you consent to the processing of your data as part of this application.</p><h3>Requirements: </h3><h3>Benefits: </h3>","tags":"[\"management\"]","pubDate":"2023-11-08 00:00:00.000","link":"https://apply.workable.com/covergo/j/95928A1D06","savedDate":"2023-11-09 07:15:33.932","slug":"head-of-client-services-fully-remote-covergo-6221"},{"id":2469361678,"title":"Generative AI Designer","company":"Social Discovery Group","image":"https://remotive.com/job/1829872/logo","description":"<p><strong><a href=\"https://socialdiscoverygroup.com/about-us/\" rel=\"nofollow\"></a></strong></p>\n<p><a href=\"https://socialdiscoverygroup.com/about-us\" rel=\"nofollow\"><strong>Social Discovery Group</strong> </a>is the world's largest group of social discovery companies which unites <strong>more than 50 brands</strong>. For <strong>more than 20 years, </strong>we have been creating premium international dating services and social discovery apps with a focus on video streaming, AI technologies, entertainment, and game mechanics. Our product portfolio includes <strong>Dating.com, Cupid Media, Dil Mil, and many others.</strong> The products are already used by more than 500 million users in 150 countries around the world. </p>\n<p>SDG<strong> <a href=\"https://socialdiscoverygroup.com/investments\" rel=\"nofollow\">Invests</a> </strong>in social discovery technology startups around the world. <a href=\"https://socialdiscoverygroup.com/investments\" rel=\"nofollow\"><strong>Our Investments</strong></a> include <strong>Open AI, Patreon, Flo, Wildly, RAW, EVA AI, Clubhouse, Magnet, Tubit, Woebot, BamBam, Flure, </strong><strong>Astry</strong><strong>, </strong><strong>Coursera, Academia, Harbour, Space, Auto1, DocSend, AppAnnie, Rapyd, Boom Supersonic, Trading, View, K-Health and many others.</strong></p>\n<p>We solve the problem of loneliness, isolation, and disconnection with the help of digital reality.</p>\n<p>Our digital nomad team of <strong>more than 800 professionals </strong>works all over the world. Our international team of like-minded people and professionals solves ambitious daily tasks and creates truly global products. We value focusing on results, a proactive approach, and we are always looking for new and unconventional ideas.</p>\n<p>Our teams of digital nomads live and work remotely from <strong>Cyprus, Malta, the USA, Thailand, Indonesia, Hong Kong, Australia, Poland, Israel, Türkiye, Latvia and many others.</strong></p>\n<p>We are looking for a <strong>Generative AI Designer </strong>for one of our investment products.</p>\n<p></p>\n<p><strong>Your main tasks will be:</strong></p>\n<ul style=\"\"></ul>\n<ul style=\"\"><li style=\"\">Demonstrate expertise in generative AI techniques;</li><li style=\"\">Support the team in integrating AI into the design process;</li><li style=\"\">Collaborate with content and design teams for visuals;</li><li style=\"\">Create effective ads for various platforms;</li><li style=\"\">Improve ASO screens for enhanced app store visibility;</li><li style=\"\">Develop in-house design solutions for marketing and websites;</li><li style=\"\">Contribute to shaping EVA AI's brand identity;</li><li style=\"\">Propose design solutions using research insights and performance data.</li></ul>\n<p><strong>We expect from you:</strong></p>\n<ul style=\"\"><li style=\"\">Profound understanding of cutting-edge artificial intelligence technologies, encompassing Prompt Engineering, Image Manipulation Program, Midjourney, and other innovative approaches;</li><li style=\"\">Hands-on experience with state-of-the-art tools and frameworks in each of the mentioned technologies, showcasing awareness of the latest technological advancements;</li><li style=\"\">Development of creative concepts and designs seamlessly blending art and advanced technologies, staying abreast of the latest trends in artificial intelligence;</li><li style=\"\">Capability to craft innovative design solutions reflecting modern visual and technological trends, contributing to the aesthetics of the future;</li><li style=\"\">Practical experience working with diverse multimedia content formats, including images, video, and audio, with a focus on visual and sonic innovation.</li></ul>\n<p><strong>What do we offer:</strong><strong><br></strong></p>\n<ul style=\"\"><li style=\"\"><strong>REMOTE OPPORTUNITY</strong> to work full time;</li><li style=\"\"><strong>7 wellness days per year</strong> (time off) that can be used to deal with household issues, to lie down and recover without taking sick leave;</li><li style=\"\"><strong>Bonuses up to $5000 </strong>for recommending successful applicants for positions in the company;</li><li style=\"\">Full payment for <strong>professional training, international conferences and meetings;</strong></li><li style=\"\">Corporate discount for <strong>English lessons;</strong></li><li style=\"\">​<strong>Health benefits. </strong>If you are not eligible for Corporate Medical Insurance, the company will compensate up to $1000 gross per year per employee according to the paychecks. This can be spent on self-purchase of health insurance, or on doctor's fees for yourself and close relatives (spouse, children);</li><li style=\"\">​<strong>Workplace organization. </strong>The company provides all employees with an equipped workplace and all the necessary equipment (table, armchair, wifi, etc.) in the locations where we have offices or co-working. In the other locations, the company provides reimbursement of workplace costs up to $ 1000 gross once every 3 years according to the paychecks. This money can be spent on the rent of the co-working room, on equipping the working place at home (desk, chair, Internet, etc.) during those 3 years;</li><li style=\"\"><strong>Internal gamified gratitude system: </strong>receive bonuses from colleagues and exchange them for time off, merch, team building activities, massage certificates, etc. </li></ul>\n<p><strong>Sounds good? Join us now!</strong> </p>\n<img src=\"https://remotive.com/job/track/1829872/blank.gif?source=public_api\" alt=\"\"/>","tags":"[\"video\",\"AI/ML\",\"research\",\"brand design\",\"ASO\",\"trading\",\"nomad\",\"insurance\"]","pubDate":"2023-11-07 15:20:33.000","link":"https://remotive.com/remote-jobs/design/generative-ai-designer-1829872","savedDate":"2023-11-09 07:15:33.926","slug":"generative-ai-designer-social-discovery-group-5973"},{"id":6351711856,"title":"Chief HR Officer","company":"Ancient Gaming","image":"https://remotive.com/job/1825990/logo","description":"<p><strong>🌟 Allow us to introduce ourselves</strong></p>\n<p>Ancient Gaming, an innovative software creator for the future of iGaming, bucks the trend that has lacked innovation for two decades. <strong>We're not trend followers; we're trendsetters. </strong>As iGaming pioneers, we challenge the status quo, crafting not just appealing software but a whole new experience for the younger, high-spending generation seeking to reinvent gaming interactions.</p>\n<p> </p>\n<p>Founded in 2018 in Malta, we've become a global presence with <strong>50+ dedicated team members </strong>spanning <strong>25+ countries</strong>. And yes, we're proudly remote-first!</p>\n<p> </p>\n<p><strong>🚀 Your mission as a Chief HR Officer!</strong><span dir=\"ltr\"><br></span><span dir=\"ltr\">As</span> <span dir=\"ltr\">the</span> <span dir=\"ltr\">visionary</span> <span dir=\"ltr\">CHRO,</span> <span dir=\"ltr\">your</span> <span dir=\"ltr\">mission</span> <span dir=\"ltr\">will</span> <span dir=\"ltr\">be</span> <span dir=\"ltr\">to</span> <span dir=\"ltr\">spearhead</span> <span dir=\"ltr\">a</span> <span dir=\"ltr\">transformative</span> <span dir=\"ltr\">journey </span><span dir=\"ltr\">of</span> <span dir=\"ltr\">our</span> <span dir=\"ltr\">people</span> <span dir=\"ltr\">strategy</span> <span dir=\"ltr\">across</span> <span dir=\"ltr\">our</span> <span dir=\"ltr\">dynamic</span> <span dir=\"ltr\">Group</span> <span dir=\"ltr\">of</span> <span dir=\"ltr\">four</span> <span dir=\"ltr\">distinct</span> <span dir=\"ltr\">brands.</span> <span dir=\"ltr\">You</span> <span dir=\"ltr\">will </span><span dir=\"ltr\">guide</span> <span dir=\"ltr\">a</span> <span dir=\"ltr\">current</span> <span dir=\"ltr\">HR</span> <span dir=\"ltr\">team</span> <span dir=\"ltr\">of</span> <span dir=\"ltr\">5</span> <span dir=\"ltr\">people</span> <span dir=\"ltr\">and</span> <span dir=\"ltr\">shape</span> <span dir=\"ltr\">an</span> <span dir=\"ltr\">indelible</span> <span dir=\"ltr\">mark</span> <span dir=\"ltr\">on</span> <span dir=\"ltr\">our </span><span dir=\"ltr\">organization,</span> <span dir=\"ltr\">guiding</span> <span dir=\"ltr\">it</span> <span dir=\"ltr\">toward </span><span dir=\"ltr\">unprecedented</span> <span dir=\"ltr\">growth</span> <span dir=\"ltr\">and</span> <span dir=\"ltr\">success</span> <span dir=\"ltr\">by</span> <span dir=\"ltr\">harnessing</span> <span dir=\"ltr\">the </span><span dir=\"ltr\">full</span> <span dir=\"ltr\">potential</span> <span dir=\"ltr\">of</span> <span dir=\"ltr\">our</span> <span dir=\"ltr\">current</span> <span dir=\"ltr\">and</span> <span dir=\"ltr\">future</span> <span dir=\"ltr\">driving</span> <span dir=\"ltr\">force</span> <span dir=\"ltr\">-</span> <span dir=\"ltr\">people.</span><span dir=\"ltr\"><br></span></p>\n<p> </p>\n<p><strong>What you’ll be doing:</strong><strong><br></strong></p>\n<ul style=\"\">\n<li style=\"\"><strong>People Strategy:</strong> Develop and execute a comprehensive people strategy that aligns with the group's business goals and objectives, ensuring that talent initiatives support our growth and success.</li>\n<li style=\"\"><strong>Culture and Employee Experience: </strong>Foster a positive and inclusive culture that supports our values and mission. Continuously enhance the employee experience through initiatives that promote well-being, work-life balance, diversity, equity, and inclusion.</li>\n<li style=\"\"><strong>HR Operations:</strong> Provide strategic direction and oversight for all HR operations, including compensation and benefits, employee relations, policies and procedures, compliance, and HR systems. Implement best practices and ensure compliance with employment laws and regulations.</li>\n<li style=\"\"><strong>Performance Management: </strong>Develop and implement performance management frameworks, tools, and processes that align with the companies’ objectives, driving a high-performance culture and supporting employees in achieving their goals.</li>\n<li style=\"\"><strong>Leadership and Team Development: </strong>Coach, mentor, and develop the HR team, fostering a culture of continuous learning and growth. Partner with managers and leaders across the organization to support their development and enhance their leadership capabilities.</li>\n<li style=\"\"><strong>HR Analytics: </strong>Leverage HR analytics and data-driven insights to inform decision-making, measure HR effectiveness, and drive continuous improvement in HR processes and programs.</li>\n<li style=\"\"><strong>Networking and Industry Engagement:</strong> Build and maintain relationships with industry professionals, including candidates, competitors, and key influencers. Represent the company at industry conferences, seminars, and other events to promote our employer brand and stay updated on industry trends.</li>\n<li style=\"\"><strong>Employer Branding: </strong>Develop and execute initiatives to enhance the company's employer branding in collaboration with the extended HR team. Create compelling content to engage and attract high-caliber candidates.</li>\n<li style=\"\"><strong>Talent Acquisition: </strong>Work closely with the Talent Acquisition team and department heads to understand their talent needs and develop effective hiring strategies.</li>\n</ul>\n<div>\n<div><strong><span dir=\"ltr\">You</span> <span dir=\"ltr\">will</span> <span dir=\"ltr\">work</span> <span dir=\"ltr\">closely</span> <span dir=\"ltr\">with</span> <span dir=\"ltr\">our</span> <span dir=\"ltr\">top-notch</span> <span dir=\"ltr\">brands:</span></strong></div>\n<div>\n<ul style=\"\">\n<li dir=\"ltr\" style=\"\">\n<p dir=\"ltr\"><a href=\"https://www.csgoroll.com/\" rel=\"nofollow\">CSGORoll</a>: A community social gaming platform targeted towards CSGO players, featuring unique in-house custom-built games such as Roulette, Crash, Unboxing, and PVP. Users have the capability to bet and win Skins in real time.</p>\n</li>\n<li dir=\"ltr\" style=\"\">\n<p dir=\"ltr\"><a href=\"https://www.hypedrop.com/\" rel=\"nofollow\">HypeDrop</a>: A platform for buying and opening Mystery Boxes in real-time, featuring an unboxing game where people can unbox real-life products and have them shipped to their houses.</p>\n</li>\n<li dir=\"ltr\" style=\"\">\n<p dir=\"ltr\"><a href=\"https://www.hypeup.com/\" rel=\"nofollow\">HypeUp</a>: An iGaming brand where users can wager their balance or items from their \"Inventory\" against other people's items, such as watches, electronics, sneakers, and more, and can physically redeem their contents upon withdrawal.</p>\n</li>\n<li dir=\"ltr\" style=\"\">\n<p dir=\"ltr\"><a href=\"https://ancient.gg/\" rel=\"nofollow\">Ancient Gaming</a>: As a Group organization, providing software solutions to ambitious companies and working side by side with our clients to deliver excellent development, alongside business intelligence and creative direction.</p>\n</li>\n</ul>\n</div>\n</div>\n<p><strong>You will thrive in this role if you have:</strong></p>\n<ul style=\"\">\n<li style=\"\">\n<div><span dir=\"ltr\">Proven experience as a Chief HR Officer, or in a similar senior </span><span dir=\"ltr\">strategic </span><span dir=\"ltr\">leadership </span><span dir=\"ltr\">role </span><span dir=\"ltr\">in an advisory business capacity</span><span dir=\"ltr\">, ideally in a fast-paced, technology-driven </span><span dir=\"ltr\">organization.</span></div>\n</li>\n<li style=\"\">\n<div><span dir=\"ltr\">Strong knowledge of HR best practices, employment laws, and regulations.</span></div>\n</li>\n<li style=\"\">\n<div><span dir=\"ltr\">A strong network within the industry and a track record of representing </span><span dir=\"ltr\">various </span><span dir=\"ltr\">companies</span><span dir=\"ltr\"> at conferences.</span></div>\n</li>\n<li style=\"\">\n<div><span dir=\"ltr\">Deep knowledge of industry trends and best practices in talent acquisition.</span></div>\n</li>\n<li style=\"\">\n<div><span dir=\"ltr\">Exceptional communication and interpersonal skills.</span></div>\n</li>\n<li style=\"\">\n<div><span dir=\"ltr\">Strong problem-solving and decision-making abilities.</span></div>\n</li>\n<li style=\"\">\n<div><span dir=\"ltr\">Ability to handle sensitive and confidential information with discretion.</span></div>\n</li>\n<li style=\"\">\n<div><span dir=\"ltr\">Demonstrated success in developing and implementing strategic HR initiatives that </span><span dir=\"ltr\">drive business outcomes and high performance.</span></div>\n</li>\n<li style=\"\">\n<div><span dir=\"ltr\">Data-driven mindset with the ability to leverage HR analytics and metrics for </span><span dir=\"ltr\">decision-making.</span></div>\n</li>\n<li style=\"\">\n<div><span dir=\"ltr\">Proven ability to build and develop high-performing teams.</span></div>\n</li>\n<li style=\"\">\n<div><span dir=\"ltr\">Passion for innovation, technology, and creating an exceptional employee experience.</span></div>\n</li>\n</ul>\n<div> </div>\n<p><strong>What’s in it for you?</strong></p>\n<ul style=\"\">\n<li dir=\"ltr\" style=\"\"><strong>Flexibility Policy</strong> – It's about giving you the freedom to structure your workday in a way that best suits your lifestyle and responsibilities outside of work</li>\n<li dir=\"ltr\" style=\"\"><strong>Work-from-anywhere Policy</strong> – you have the chance to work from anywhere in the world, we are a remote-first company and we are proud of it!</li>\n<li dir=\"ltr\" style=\"\">Every year for our <strong>team-building </strong>we choose a location and go there to celebrate our achievements together</li>\n<li dir=\"ltr\" style=\"\">A<strong> dedicated budget</strong> to purchase all the equipment you need to set up your home office</li>\n<li dir=\"ltr\" style=\"\"><strong>L&amp;D budget</strong> for you to develop your skills!</li>\n<li dir=\"ltr\" style=\"\"><strong>Spill Mental Health Service </strong>– full access to counselling for any employees who need it</li>\n<li dir=\"ltr\" style=\"\">Young, fun, flat structured <strong>rapidly growing</strong> company with endless opportunities to grow</li>\n</ul>\n<p><em><br></em><em>This post not only outlines our ideal candidate but also serves as an inspiration for what this role can evolve into. Even if you consider yourself an 80% fit but have a genuine passion for this position, we encourage you to apply. We're eager to hear from individuals who share our enthusiasm.</em><br><br><em>Ancient Gaming is an equal opportunity employer. All applicants will be considered for employment without attention to race, color, religion, sex, sexual orientation, gender identity, national origin, veteran or disability status.</em><em><br></em></p>\n<img src=\"https://remotive.com/job/track/1825990/blank.gif?source=public_api\" alt=\"\"/>","tags":"[\"business intelligence\",\"go\",\"analytics\",\"brand design\",\"performance management\",\"diversity\",\"workday\",\"mental health\"]","pubDate":"2023-11-07 05:20:37.000","link":"https://remotive.com/remote-jobs/hr/chief-hr-officer-1825990","savedDate":"2023-11-09 07:15:33.926","slug":"chief-hr-officer-ancient-gaming-9604"},{"id":9865915763,"title":"Systems / Client Engineer","company":"Escape Velocity Entertainment Inc","image":"https://remotive.com/job/1826817/logo","description":"<p><strong>What We Are Looking For:</strong></p>\n<p>We're looking for a Systems Engineer, to join our team here at Escape Velocity, which collaborates remotely from around the world. Your mission will be to help make our AAA game run on mobile.</p>\n<p><strong>Requirements</strong></p>\n<p><strong>What We Will Do Together:</strong></p>\n<ul style=\"\">\n<li style=\"\">Develop and maintain a mobile version of our game for Android and iPhone platforms, ensuring high performance, functionality, and compatibility across both operating systems.</li>\n<li style=\"\">Explore and implement innovative solutions to adapt select features from the PC/Consoles versions of the game to the mobile platform, optimizing the gameplay experience for mobile users while maintaining gameplay integrity and quality.</li>\n<li style=\"\">Program hands-on in the Unreal (UE5) to continue to improve our game's Mobile compatibility, performance, and experience.</li>\n<li style=\"\">Develop studio-wide standards and practices to ensure our game developers (engineers, artists, sound designers, animators, etc) hit our Mobile quality bar.</li>\n<li style=\"\">Contribute to the design of our gameplay systems.</li>\n<li style=\"\">Collaborate with other internal departments (art, design, audio, QA, etc.)</li>\n<li style=\"\">Document software and features for internal and external teams</li>\n<li style=\"\">Participate in the code review process.</li>\n</ul>\n<p><strong>What You Will Bring:</strong></p>\n<ul style=\"\">\n<li style=\"\">Strong programming experience, including working in a game engine (commercial or proprietary)</li>\n<li style=\"\">Experience developing for Mobile platforms (Android and/or iOS) preferably on games.</li>\n<li style=\"\">Strong understanding of Mobile-specific engineering concerns such as release and approval cycles, OS upgrades, UI and control schemes, API integration and Mobile-specific performance concerns.</li>\n<li style=\"\">Experience shipping live Games-as-a-Service (GaaS)</li>\n<li style=\"\">Experience with Mobile-specific graphics and rendering issues.</li>\n<li style=\"\">Experience using Unreal Engine 4/5</li>\n<li style=\"\">A keen analytical mind, with strong problem-solving skills</li>\n<li style=\"\">Strong C++ skills and the ability to code and architect gameplay mechanics and tools</li>\n<li style=\"\">Well versed in games and the ability to articulate what is strong/weak about the design of existing games.</li>\n<li style=\"\">Excellent communication and interpersonal skills</li>\n<li style=\"\">Self-motivated, strong work ethic, and able to work independently.</li>\n<li style=\"\">Creativity in problem-solving and the ability to think outside of the established solutions.</li>\n<li style=\"\">Keen interest in games</li>\n</ul>\n<p><strong>Benefits</strong></p>\n<p><strong>Interested … a bit about Escape Velocity:</strong></p>\n<p>Escape Velocity is a team of passionate, talented developers working at a studio that offers excellent benefits and what we believe is a fantastic project. But that doesn’t make us unique. What does make us special? We value the time, energy, and talent of our players <em>and</em> our colleagues. We want every hour spent developing and playing our games to be an incredibly rewarding and worthwhile use of <em>your</em> time. To that end, we are fully remote and support team members nearly anywhere in the world. We prioritize honesty, even when that means sharing bad news. We strive to give everyone autonomy so they can determine how best to work and play; and we care more about what you bring to the game and studio than how many hours you’re clocking. We believe in constant improvement across all areas – from the game itself to our production design – and are constantly re-evaluating how we spend our time to ensure that we’re not wasting yours and we’re all always working on the most important things. Finally (and perhaps most importantly) we’re dedicated to building a culture of play, which not only makes us better game makers, but also strengthens the bonds between us all.</p>\n<p> </p>\n<p><strong>HOW TO APPLY</strong></p>\n<p>Click apply and complete an application, along with a Resume / CV. If we would like to move forward with your application, a member of the Recruiting Team will reach out to you and guide you through our process.</p>\n<p>Escape Velocity is proud to be an equal opportunity employer, we are committed to hiring, promoting, and compensating employees based on their qualifications and demonstrated ability to perform job responsibilities.</p>\n<p>Applications will be considered regardless of age, disability, gender identity, sexual orientation, religion, belief, race, or any other protected category.</p>\n<p> </p>\n<img src=\"https://remotive.com/job/track/1826817/blank.gif?source=public_api\" alt=\"\"/>","tags":"[\"android\",\"api\",\"C++\",\"ios\",\"UI/UX\",\"operating systems\"]","pubDate":"2023-11-06 17:21:08.000","link":"https://remotive.com/remote-jobs/devops/systems-client-engineer-1826817","savedDate":"2023-11-09 07:15:33.926","slug":"systems-client-engineer-escape-velocity-entertainment-inc-7476"}]